{"wiki_id": "http://www.wikidata.org/entity/Q111840", "itemLabel": "Carwyn Jones", "itemDescription": "former First Minister of Wales (born 1967)", "wikipedia_url": "https://en.wikipedia.org/wiki/Carwyn_Jones", "wikipedia_page": {"main": "Carwyn Howell Jones (born 21 March 1967) is a Welsh politician who served as First Minister of Wales and Leader of Welsh Labour from 2009 to 2018. He served as Counsel General for Wales from 2007 to 2009. Jones served as the Member of the Senedd (MS) for Bridgend from 1999 to 2021.\nJones served in the Cabinet as Secretary for Agriculture and Rural Development in the Welsh Government from 2000 to 2002, and as Minister of State for the Environment from 2003 to 2007. Following the 2007 election, he was appointed Minister for Education, Culture and the Welsh Language, and thereafter Counsel General for Wales and Leader of the House following the One Wales coalition agreement with Plaid Cymru.\nJones succeeded Rhodri Morgan as Welsh Labour Leader and First Minister on 1 December 2009, after Jones was elected with over 50% of the vote. The third politician to lead the Welsh Government, Jones was nominated as First Minister by the National Assembly on 9 December 2009, and was sworn into office the following day.On 21 April 2018 he announced he would step down as First Minister that autumn, and in December 2018 Mark Drakeford (the Finance Secretary in Jones' cabinet) was elected as his replacement.", "link_mentions": [{"page": "March 21", "response": ["*1967 – Carwyn Jones, Welsh lawyer and politician, First Minister of Wales"]}, {"page": "Welsh language", "response": ["On 5 October 2011, Meri Huws, Chair of the Welsh Language Board, was appointed the new Welsh Language Commissioner. She released a statement that she was \"delighted\" to have been appointed to the \"hugely important role\", adding, \"I look forward to working with the Welsh Government and organisations in Wales in developing the new system of standards. I will look to build on the good work that has been done by the Welsh Language Board and others to strengthen the Welsh language and ensure that it continues to thrive.\" First Minister Carwyn Jones said that Huws would act as a champion for the Welsh language, though some had concerns over her appointment: Plaid Cymru spokeswoman Bethan Jenkins said, \"I have concerns about the transition from Meri Huws's role from the Welsh Language Board to the language commissioner, and I will be asking the Welsh government how this will be successfully managed. We must be sure that there is no conflict of interest, and that the Welsh Language Commissioner can demonstrate how she will offer the required fresh approach to this new role.\" Huws started her role as the Welsh Language Commissioner on 1 April 2012."]}, {"page": "List of Welsh people", "response": ["*Carwyn Jones AM (born 1967), Labour, First Minister of Wales"]}, {"page": "Y Wladfa", "response": ["Carwyn Jones attended the celebration."]}, {"page": "TVR", "response": ["On 22 March 2016, the First Minister of Wales Carwyn Jones announced that TVR would build its factory in Ebbw Vale adjacent to the Circuit of Wales, creating 150 jobs, with TVR also receiving an undisclosed investment from the Welsh Government."]}, {"page": "Rhodri Morgan", "response": ["In July 2005, Morgan announced his intention to lead the Welsh Labour party into the 2007 general election, but retire as leader and First Minister sometime in 2009, when he would be 70. On his 70th birthday (29 September) he set the exact date as immediately following the Assembly's budget session on 8 December 2009. Counsel General Carwyn Jones, Health Minister Edwina Hart and Merthyr Tydfil and Rhymney AM Huw Lewis entered a leadership contest to elect a new Labour leader in Wales. On 1 December 2009 the winner was declared as Carwyn Jones, who assumed office as First Minister on 10 December 2009. Morgan remained a backbench AM until April 2011, when the third Assembly was dissolved prior to the general election on 5 May 2011."]}, {"page": "Local government in Wales", "response": ["In April 2013, it was announced that a major review was to be undertaken into local government organisation in Wales, with a Commission on Public Service Governance and Delivery being established, to be chaired by Sir Paul Williams. First Minister Carwyn Jones said: \"Since public sector budgets are likely to continue to tighten, and demand pressures grow, there is a clear need to examine how services can be sustained and standards of performance raised, so that people in Wales can continue to receive and influence the public services they need and value.\"Local councils in Wales could be cut after review , BBC News, 19 April 2013.", "Wales' First Minister Carwyn Jones said: \"This report addresses many issues that are critical at a time when the need for public services is outstripping the resources available to provide them. I have always been clear that the status quo is not an option.  Change is inevitable and essential so that our public services can become more efficient, effective, accessible and responsive.\" Janet Finch-Saunders AM, shadow minister for local government, said: \"What matters to the vast majority of hardworking families is not the intricate structures of local government, but knowing that services will be delivered in an efficient and cost effective way.... We believe that public services are best delivered locally so taxpayers can hold local representatives to account for what happens in their community.\"  Rhodri Glyn Thomas, for Plaid Cymru, commented: \"The weight of evidence presented to the Williams Commission shows that if the people of Wales are going to get the services they need and deserve then there has to be a radical improvement in the way public services are delivered.\"", "Following the 2016 assembly elections, First Minister Carwyn Jones announced that the proposals for local government reform would be taken \"back to the drawing board\" and that a new consensus on how to reform local government in Wales would be sought. The merger plans were formally dropped in January 2017, when the Welsh Government instead began a consultation on wider reform of local governance arrangements. The number of councils are to remain as they currently are, unless two or more local authorities wish to pursue a voluntary merger."]}, {"page": "Second Severn Crossing", "response": ["On 5 April 2018, the Secretary of State for Wales, Alun Cairns, announced that the crossing would be renamed as the Prince of Wales Bridge at a ceremony later in the year. He said that the renaming would be \"a fitting tribute to His Royal Highness in a year that sees him mark 60 years as The Prince of Wales and decades of continued, dedicated service to our nation.\"Phil Norris, \"Second Severn Crossing across the M4 to be renamed The Prince of Wales Bridge\", 5 April 2018. Retrieved 9 April 2018 A petition against the renaming had received more than 30,000 signatures by 8 April. Some politicians criticised the proposed renaming and the lack of public consultation on it, but it was confirmed that the First Minister of Wales, Carwyn Jones, had raised no objection to the proposal.Tristan Cork, \"Backlash grows as 30,000 sign petition against Second Severn Crossing being renamed Prince of Wales Bridge\", Bristol Post, 8 April 2018. Retrieved 9 April 2018 The bridge was renamed, despite opposition, on 2 July 2018 at a ceremony held at the toll plaza where a plaque was unveiled by the Prince and Duchess of Cornwall. There was no prior press release or other official communication from the Government. The cost for renaming the bridge, and the two signs erected, one at each end of the bridge, was £216,513.39."]}, {"page": "Minority government", "response": ["After the 2007 Assembly election, the Welsh Labour Party led by Rhodri Morgan initially formed a minority government in the National Assembly of Wales.  This was because they gained 26 seats in the election, which was short of an absolute majority of seats in the Assembly. Whilst Labour were initially unable to form a coalition with the Liberal Democrats, a 'Rainbow Coalition' of the Conservative Party (UK), Liberal Democrats and Plaid Cymru failed to come to fruition. However, on 6 July 2007, Welsh Labour Party members voted for a coalition with Plaid, which was followed by a similar result from Plaid Cymru members the next day. As a result, the Welsh Assembly was controlled by the Labour-Plaid alliance with Rhodri Morgan as First Minister (up until his retirement in 2009 and subsequent replacement by Carwyn Jones as First Minister) and Plaid Leader Ieuan Wyn Jones as his deputy. After the 2011 Welsh General Election, Welsh Labour won 30 seats and entered into a new government, with a minority of 0. In 2016 Welsh Labour returned with 29 seats out of 30 and formed a minority government of 0 with the one remaining Liberal Democrat AM. A minority government was also formed following the 2021 Senedd election, where Welsh Labour returned 30 seats, half of the legislature's available 60, but one short of a working majority (31), yet no coalition government was formed, with Labour relying on bipartisanship (minimally 1 extra vote from a non-Labour seat) for the passing of any legislation."]}, {"page": "Aberystwyth University", "response": ["*Carwyn Jones, First Minister of Wales (2009–18), AM for Bridgend"]}, {"page": "National Executive Committee of the Labour Party", "response": ["* Carwyn Jones (Welsh Labour Representative)"]}, {"page": "Bridgend", "response": ["* Carwyn Jones (politician, First Minister of Wales)"]}, {"page": "2003 National Assembly for Wales election", "response": ["| Carwyn Jones"]}, {"page": "British–Irish Council", "response": ["| 19th || 26 November 2012 || ||Carwyn Jones || Cardiff Castle, Cardiff || ", "| 27th Extraordinary || 22 July 2016 || ||Carwyn Jones || Cathays Park, Cardiff || ", "| 28th || 25 November 2016 || ||Carwyn Jones || Cathays Park, Cardiff || "]}, {"page": "Alun Michael", "response": ["On 9 November 2017 Michael asked Carwyn Jones to define the allegations made against Carl Sargeant, the former Welsh assembly member who apparently took his own life."]}, {"page": "List of current members of the British Privy Council", "response": ["| Carwyn Jones"]}, {"page": "Hywel Francis", "response": ["In February 2011, it was reported that Francis had been quoted in a US diplomatic cable released by WikiLeaks. The cable by a US embassy political officer dated from 2008 and discussed the upcoming Welsh Labour leadership election to choose a successor to the retiring Rhodri Morgan. Francis was quoted as claiming that all of the prospective candidates who were already members of the Welsh Assembly were seen as flawed by the Welsh Labour Party, and suggesting that many in the party were hoping for a \"white knight\" to be \"parachute[d] in\" from outside the Assembly. However, Francis claimed that he could not recall the conversation, suggesting that \"it sounds as if the diplomat suffers from poor shorthand\", and stating that \"it is on the record that I was an early supporter of  Carwyn Jones [...] I would certainly not have supported such an absurd suggestion as parachuting anyone into the assembly\"."]}, {"page": "England and Wales Cricket Board", "response": ["In 2017, the First Minister of Wales, Carwyn Jones called for the reintroduction of the Welsh one day team stating: \"[It] is odd that we see Ireland and Scotland playing in international tournaments and not Wales.\""]}, {"page": "Betty Williams (politician)", "response": ["She was a member of the Parliamentary Labour Party committees on education and employment; health and social services, and culture, media and sport. In 2009 she supported Carwyn Jones in the election for First Minister, strongly criticising his opponent Edwina Hart for dismissing suggestions that the First Minister needed to be able to speak the Welsh language. Williams said: \"“I think it’s important that we have someone who is bilingual as First Minister of Wales, like we’ve had with Rhodri who can conduct interviews through the medium of Welsh or English.”"]}, {"page": "First Minister of Wales", "response": ["Mark Drakeford of the Welsh Labour Party is the current first minister of Wales. He assumed office on 13 December 2018 as Wales' fourth First Minister, and the fourth first minister from the Labour Party, succeeding Carwyn Jones.", "|rowspan=\"3\" align=\"center\"| Carwyn Jones(1967–)AM for Bridgend", "On 11 May 2011, Carwyn Jones was the only person nominated for the position (by Janice Gregory), and was a subsequently recommended by the presiding officer to be appointed as First Minister.", "On 9 December 2009, Carwyn Jones was the only person nominated for the position (by Rhodri Morgan), and was a subsequently recommended by the presiding officer to be appointed as First Minister."]}, {"page": "Aberfan disaster", "response": ["* Statement on Aberfan in 2016 by the Welsh Government First Minister Carwyn Jones "]}, {"page": "Lib–Lab pact", "response": ["On 11 May 2016, following the 2016 election six days earlier, when the governing Labour Party had 29 AMs elected, one fewer than in 2011 and two short of an overall majority, Welsh Assembly members failed to elect a new First Minister on their return to the Senedd, after the roll-call tied the vote at 29-29; Plaid Cymru nominated its leader Leanne Wood, and won the backing of the Conservatives and UKIP, while Labour's incumbent First Minister Carwyn Jones won the support of sole Liberal Democrat Kirsty Williams, the only non-Labour member to back Jones in the tied vote for First Minister (and who, up until the day after the election, had been the leader of the Welsh Liberal Democrats), and his own party. On 19 May 2016, after Jones was reinstalled unopposed as First Minister, following a deal with Plaid Cymru, Williams was named Cabinet Secretary for Education in Jones's new Welsh Government; her appointment as Education Secretary was subject to ratification by Liberal Democrat members at a special conference in Newtown, Powys on 21 May 2016 and was overwhelmingly approved."]}, {"page": "List of Privy Counsellors (1952–present)", "response": ["* Carwyn Jones (b. 1967)"]}, {"page": "List of ministers of the environment", "response": ["|Carwyn Jones"]}, {"page": "England cricket team", "response": ["In 2017, the First Minister of Wales, Carwyn Jones called for the reintroduction of the Welsh one-day team stating: \"[It] is odd that we see Ireland and Scotland playing in international tournaments and not Wales.\""]}, {"page": "Maggie's Centres", "response": ["Maggie's South West Wales Centre at Singleton Hospital in Swansea was designed by the late Japanese Architect Kisho Kurokawa shortly before his death in 2007. The centre was opened in December 2011 by First Minister Carwyn Jones in the presence of guests of honour, Japanese ambassador to the UK Keiichi Hayashi, the family of architect Kisho Kurokawa, and Welsh footballer John Hartson."]}, {"page": "Cardiff Airport", "response": ["On 18 December 2012, it was announced that the Welsh Government was interested in buying the airport from its current owners.BBC News – Cardiff Airport: Welsh government plan to buy from TBI. Bbc.co.uk (18 December 2012). Retrieved on 23 July 2013. In 2012, the Airport faced sustained criticism from the First Minister of Wales, Carwyn Jones. On 28 February 2012, Jones announced to the Welsh Assembly: \"We would like to see many routes emerging from Cardiff Airport, but the Airport must get its act together... Last week, I went to the Airport and the main entrance was shut. People could not go in through the main entrance; they had to go through the side entrance. It is important that the Airport puts itself in a position where it is attractive to new airlines, and, unfortunately, that is not the case at present.\" His criticism led to accusations that he was \"talking down\" Cardiff Airport whilst aviation industry professionals commented that he was unqualified to make such comments. However, Jones returned to this theme on 7 March 2012 saying, \"With the condition of the Airport at the moment I would not want to bring people in through Cardiff Airport because of the impression it would give of Wales...I have to say the time has come now for the owners of the Airport to decide to run the Airport properly or sell it.\"", "Byron Davies, Shadow Minister for Transport, said: \"It is a bit rich for the First Minister to publicly attack and run down Cardiff Airport, when he has failed to seize opportunities, which would massively increase the range of routes available from Cardiff, introduce direct routes to North America, opening our economy to trade and business with one of the world's biggest economies\".Cardiff-New York air route worth £200m a year to Wales, report reveals. Wales Online (19 March 2012). Retrieved on 23 July 2013. Liberal Democrats spokesperson, Eluned Parrott, said: \"The First Minister needs to stop talking our capital city's Airport down and instead he should be doing all he can to encourage visitors to Cardiff Airport. His comments are hardly going to encourage tourism and business to Wales.\"First Minister Carwyn Jones under fire for attack on Cardiff Airport. Wales Online (13 March 2012). Retrieved on 23 July 2013.", "The First Minister's criticism was roundly rejected by Alex Cruz, chief executive of Vueling – a Spanish airline which operates regular flights from Cardiff. Cruz said \"We are more than satisfied with Cardiff Airport. We would not fly into an Airport that we did not feel was suitable for our customers.\"First Minister Carwyn Jones' Cardiff Airport criticism rejected. Wales Online (29 March 2012). Retrieved on 23 July 2013. However, on 20 March 2012 Jones again criticised Cardiff Airport saying \"business people\" had complained to him \"week after week, for many months about the Airport.\" He asserted he had put their points to the owners of the Airport but \"they have been met with a shrug of the shoulders. That is just not good enough. I know of situations, and have seen them myself, where people have been locked in the baggage hall and where the front door was not open and people had to go in through a side door—I had to do that the last time I used the Airport.\"Carwyn Jones renews attack on 'not good enough' Cardiff Airport. Wales Online (20 March 2012). Retrieved on 23 July 2013.", "On 29 May 2012, it was announced that Jones would personally chair a \"Task Force\" on Cardiff Airport with the aim of \"maximising its economic impact, commercially and for Wales\".Cardiff Airport to be targeted by task force, says Carwyn Jones. Wales Online (29 May 2012). Retrieved on 23 July 2013. On 27 June 2012, the Task Force, comprising tourist chiefs, local government spokesmen and trade unionists, met for the first time. No airlines were invited to attend.  A bid to obtain the full minutes of the meeting under the Freedom of Information Act was refused by the Information CommissionerLlywodraeth Cymru | Welsh Government. Wales.gov.uk. Retrieved on 23 July 2013."]}, {"page": "List of years in Wales", "response": ["* 2009 in Wales - Carwyn Jones takes over from Rhodri Morgan as First Minister of Wales"]}, {"page": "Jane Hutt", "response": ["Hutt was elected to the Senedd in 1999 and has been re-elected at every subsequent election. She served as a government minister for a total of 18 years, 5 months, 23 days (or 6,751 days) from 12 May 1999 to 3 November 2017 making her the then longest serving Labour Minister in UK history. Her record was surpassed in 2018 by Carwyn Jones who served a total of 6,868 days."]}, {"page": "Celtic Manor Resort", "response": ["To prepare for the 2010 Ryder Cup, The Twenty Ten Course, designed by Ross McMurray, was built, as part of a £16 million development. This was the first golf course in history to be purpose-built for the event. The development included a 120-metre-long £2m twin-suspension bridge, the course and a new clubhouse and surrounding infrastructure, which was promised as part of the bid to host the event in 2001. The new bridge, The Twenty Ten Bridge, links the practice ground to the golf course across the River Usk and was officially opened by the First Minister of Wales, Carwyn Jones.Celtic Manor Resort Unveils Twenty Ten Bridge"]}, {"page": "Face to Face (British TV programme)", "response": ["The programme was again revived by ITV Wales in 2011, presented by its Political Editor, Adrian Masters. The programme had exactly the same format as the BBC version, but the purpose of the first series was to interview the leaders of the four main political parties in the lead-up to the 2011 Assembly elections. Carwyn Jones, Nick Bourne, Ieuan Wyn Jones and Kirsty Williams were all interviewed. Further editions were broadcast in 2012, in a non-election context, the first of which featured Peter Hain."]}, {"page": "Brecon and Radnorshire (UK Parliament constituency)", "response": ["The Labour candidate, Chris Mann, won the selection over future AMs Carwyn Jones and Jeffrey Cuthbert, and future AM and MP Peter Law."]}, {"page": "Pontypool and Blaenavon Railway", "response": ["By 28 November 2005, the inspector appointed by the National Assembly for Wales, Stuart B Wild, MRTPI, MCMI made his report to Parliament. Subsequently, a full meeting of the planning Decision Committee of the National Assembly for Wales, chaired by Carwyn Jones, Minister for Environment, Planning and Countryside, approved the application on 24 January 2006."]}, {"page": "Kirsty Williams", "response": ["In the elections to the Welsh Assembly on 5 May 2016 Williams retained her Brecon and Radnorshire seat with an increased majority. However, as the sole Liberal Democrat representative in the new Assembly, she stood down as leader of the Welsh Liberal Democrats the day after the election. On the first day of plenary she voted with the Government on the appointment of the First Minister. First Minister Carwyn Jones appointed her to the Welsh Cabinet as Education Secretary; 31 seats are needed for a majority in the Welsh Assembly, Labour had 29, so Williams joining with the Labour administration created a working majority."]}, {"page": "Wales national cricket team", "response": ["In 2017, the First Minister of Wales, Carwyn Jones called for the reintroduction of the Welsh one day team stating: \"[It] is odd that we see Ireland and Scotland playing in international tournaments and not Wales.\""]}]}}