{"wiki_id": "http://www.wikidata.org/entity/Q1306352", "itemLabel": "Stanley Baker", "itemDescription": "Welsh actor and film producer (1928-1976)", "wikipedia_url": "https://en.wikipedia.org/wiki/Stanley_Baker", "wikipedia_page": {"main": "Sir William Stanley Baker (28 February 1928 – 28 June 1976) was a Welsh actor and film producer. Known for his rugged appearance and intense, grounded screen persona; he was one of the top British male film stars of the late 1950s, and later a producer.Born into a coal mining family in Glamorgan, Baker began his acting career in the West End. Following national service in the Royal Army Service Corps after the Second World War, he befriended actor Richard Burton and began appearing in film and television roles. He played the lead role in Hell Drivers and supporting role in The Guns of Navarone.  He was producer and lead actor in the 1964 film Zulu, in which he portrayed John Chard. \nBaker's performance in the 1959 film Yesterday's Enemy was nominated for the BAFTA Award for Best British Actor, and he was nominated for a Primetime Emmy Award for his turn in the BBC serial How Green Was My Valley. He was awarded a knighthood in 1976, although he died before the investiture ceremony: a heavy smoker, he developed lung cancer and he died in 1976.", "link_mentions": [{"page": "Achilles", "response": ["* The 1956 film Helen of Troy by Stanley Baker"]}, {"page": "February 28", "response": ["*1928 – Stanley Baker, Welsh actor and producer (died 1976)"]}, {"page": "Harry Secombe", "response": ["|Richard Attenborough, Stanley Baker"]}, {"page": "Sean Connery", "response": ["In early 1957, Connery hired agent Richard Hatton who got him his first film role, as Spike, a minor gangster with a speech impediment in Montgomery Tully's No Road Back alongside Skip Homeier, Paul Carpenter, Patricia Dainton, and Norman Wooland. In April 1957, Rakoffafter being disappointed by Jack Palancedecided to give the young actor his first chance in a leading role, and cast Connery as Mountain McLintock in BBC Television's production of Requiem for a Heavyweight, which also starred Warren Mitchell and Jacqueline Hill. He then played a rogue lorry driver, Johnny Yates, in Cy Endfield's Hell Drivers (1957) alongside Stanley Baker, Herbert Lom, Peggy Cummins, and Patrick McGoohan. Later in 1957, Connery appeared in Terence Young's poorly received MGM action picture Action of the Tiger opposite Van Johnson, Martine Carol, Herbert Lom, and Gustavo Rojo; the film was shot on location in southern Spain. He also had a minor role in Gerald Thomas's thriller Time Lock (1957) as a welder, appearing alongside Robert Beatty, Lee Patterson, Betty McDowall, and Vincent Winter; this commenced filming on 1 December 1956 at Beaconsfield Studios."]}, {"page": "Sid James", "response": ["His first major comedy role was in The Lavender Hill Mob (1951): with Alfie Bass, he made up the bullion robbery gang headed by Alec Guinness and Stanley Holloway. He also appeared in Lady Godiva Rides Again and The Galloping Major, both films were released in 1951, and as Harry Hawkins in The Titfield Thunderbolt (1953), and also had a lead role in The Wedding of Lilli Marlene. He featured in another Alec Guinness film, Father Brown (US: The Detective, 1954) and in Trapeze (1956) as Harry the snake charmer, a circus film which was one of the most successful films of its year, and he played Master Henry in \"Outlaw Money\" (also 1956), an episode of The Adventures of Robin Hood. James had a supporting part as a TV advertisement producer in Charlie Chaplin's A King in New York, a non-comic supporting role as a journalist in the science-fiction film Quatermass 2, and he performed in Hell Drivers (all 1957), a film with Stanley Baker. The next year, James starred with Miriam Karlin in East End, West End by Wolf Mankowitz, a half-hour comedy series for the ITV company Associated Rediffusion. Set within the Jewish community of London's East End, the series of six episodes was transmitted in February and March 1958, but plans for further episodes were abandoned after a disappointing response. For a while though, it had looked as if his commitment elsewhere might end his work with Tony Hancock, one of the most popular television comedians of the time.Cliff Goodwin Sid James: A Biography, London: Virgin Books, 2001, p.121-22"]}, {"page": "Eddie Chapman", "response": ["In the 1950s producer Ted Banborough announced plans to make a film about Chapman starring Michael Rennie or Stanley Baker, but this did not go ahead."]}, {"page": "1976", "response": ["* June 28 - Stanley Baker, Welsh actor and film producer (b. 1928)"]}, {"page": "1928", "response": ["*February 28 - Stanley Baker, Welsh actor and film producer (d. 1976)"]}, {"page": "Mai Zetterling", "response": ["After a brief return to Sweden in which she worked with Bergman again in his film Music in Darkness (1948), she returned to Britain and starred in a number of UK films, playing against such leading men as Tyrone Power, Dirk Bogarde, Richard Widmark, Laurence Harvey, Peter Sellers, Herbert Lom, Richard Attenborough, Keenan Wynn, Stanley Baker and Dennis Price."]}, {"page": "How Green Was My Valley", "response": ["The book has twice been adapted by the BBC for television, in 1960 and 1975. The 1960 adaptation featured Eynon Evans, Rachel Thomas and Glyn Houston. The 1975 production, scripted by Elaine Morgan, starred Stanley Baker, Siân Phillips, and Nerys Hughes."]}, {"page": "Victor McLaglen", "response": ["He went to Italy for Gli Italiani sono matti and had a good part in Sea Fury (1958), shot in England with Stanley Baker."]}, {"page": "Richard Burton", "response": ["Shortly after the release of Prince of Players, Burton met director Robert Rossen, who was well known at the time for his Academy Award-winning film, All the King's Men (1949). Rossen planned to cast Burton in Alexander the Great (1956) as the eponymous character. Burton accepted Rossen's offer after the director reassured him he had been studying the Macedonian king for two years to make sure the film was historically accurate. Burton was loaned by Fox to the film's production company United Artists, which paid him a fee of $100,000 (). Alexander the Great was made mostly in Spain during February 1955 and July 1955 on a budget of $6 million. The film reunited Burton with Bloom and it was also the first film he made with her. Bloom played the role of Barsine, the daughter of Artabazos II of Phrygia, and one of Alexander's three wives. Fredric March, Danielle Darrieux, Stanley Baker, Michael Hordern and William Squire were respectively cast as Philip II of Macedon, Olympias, Attalus, Demosthenes and Aeschines.", "Skyhorse Publishing Inc., 2008. Cf. p.214 on Burton's diatribe and Winston Churchill. The publication of these articles coincided with what would have been Churchill's centenary, and came after Burton had played him in a favourable light in A Walk with Destiny, with considerable help from the Churchill family. Politically Burton was a lifelong socialist, although he was never as heavily involved in politics as his close friend Stanley Baker. He admired Democratic Senator Robert F. Kennedy and once got into a sonnet-quoting contest with him. In 1972, Burton played Leon Trotsky in The Assassination of Trotsky. The next year, he agreed to play Josip Broz Tito in a film biography, since he admired the Yugoslav leader. While filming in Yugoslavia he publicly proclaimed that he was a communist, saying he felt no contradiction between earning vast sums of money for films and holding left-wing views since \"unlike capitalists, I don't exploit other people\".Ferris, Paul Richard Burton (1981).", "Burton courted further controversy in 1976 when he wrote an unsolicited article for The Observer about his friend and fellow Welsh thespian Stanley Baker, who had recently died from pneumonia at the age of 48; the article upset Baker's widow with its depiction of her late husband as an uncultured womaniser.Melvyn Bragg, Rich: the Life of Richard Burton, 1988, "]}, {"page": "List of Welsh people", "response": ["*Stanley Baker (1927–1976)"]}, {"page": "Michael Caine", "response": ["Caine's first film role was as one of the privates in George Baker's platoon in the 1956 film A Hill in Korea. The stars of the film were George Baker, Stanley Baker, Harry Andrews and Michael Medwin, with Stephen Boyd and Ronald Lewis, and Robert Shaw also had a small part. He appeared regularly on television in small roles. His first credited role on the BBC was in 1956, where he played Boudousse in the Jean Anouilh play The Lark. Other parts included three roles in Dixon of Dock Green in 1957, 1958 and 1959, prisoner-of-war series Escape (1957), crime/thriller drama Mister Charlesworth, and a court orderly in The Caine Mutiny Court-Martial (1958).", "When this play moved to the Criterion in Piccadilly with Michael Codron directing, he was visited backstage by Stanley Baker, one of the four stars in Caine's first film, A Hill in Korea, who told him about the part of a Cockney private in his upcoming film Zulu, a film Baker was producing and starring in. Baker told Caine to meet the director, Cy Endfield, who informed him that he already had given the part to James Booth, a fellow Cockney who was Caine's friend, because he \"looked more Cockney\" than Caine did. Endfield then told the 6'2\" Caine that he did not look like a Cockney but like an officer, and offered him a screen test for the role of a snobbish, upper class officer after Caine assured him that he could do a posh accent. Caine believes Endfield offered him, a Cockney, the role of an aristocrat because, being American, he did not have the endemic British class-prejudice. Though he tested poorly, Endfield gave him the part that would make him a film star."]}, {"page": "Wales", "response": ["The earliest surviving Welsh plays are two medieval miracle plays, Y Tri Brenin o Gwlen (\"The three Kings from Cologne\") and Y Dioddefaint a'r Atgyfodiad (\"The Passion and the Resurrection\").Davies (2008) p. 222 A recognised Welsh tradition of theatre emerged during the 18th century, in the form of an interlude, a metrical play performed at fairs and markets.Davies (2008) p. 223 Drama in the early 20th century thrived, but the country established neither a Welsh National Theatre nor a national ballet company. After the Second World War the substantial number of amateur companies that had existed before the outbreak of hostilities reduced by two-thirds.Davies (2008) p. 224 Competition from television in the mid-20th century led to greater professionalism in the theatre. Plays by Emlyn Williams and Alun Owen and others were staged, while Welsh actors, including Richard Burton and Stanley Baker, were establishing themselves as artistic talents. Anthony Hopkins is an alumnus of the Royal Welsh College of Music & Drama, and other notable Welsh actors include Michael Sheen and Catherine Zeta-Jones. Wales has also produced well known comedians including Rob Brydon, Tommy Cooper, Terry Jones, and Harry Secombe."]}, {"page": "Battle of Rorke's Drift", "response": ["The film Zulu (1964), produced by Stanley Baker, portrays the Battle of Rorke's Drift. The film received generally positive reviews from the critics. Some details of the film's account are, however, historically inaccurate (for example, in the movie the regiment is called the South Wales Borderers, but the unit was not in fact called that until two years after the battle, although the regiment had been based at Brecon in South Wales since 1873). While most of the men of the 1st Battalion, 24th Regiment of Foot (1/24) were recruited from the industrial towns and agricultural classes of England, principally from Birmingham and adjacent southwest counties, only 10 soldiers of the 1/24 that fought in the battle were Welsh. Many of the soldiers of the junior battalion, the 2/24, were Welshmen.Lock and Quantrill 2005, p.37 Of the 122 soldiers of the 24th Regiment present at the Battle of Rorke's Drift, 49 are known to have been of English nationality, 32 were Welsh, 16 were Irish, one was a Scot, and three were born overseas. The nationalities of the remaining 21 are unknown.Norman Holme (1999). The Noble 24th. p. 383."]}, {"page": "Jean Seberg", "response": ["In France, after appearing in Time Out for Love (Les grandes personnes, 1961), Seberg took the lead role in Moreuil's directorial debut, Love Play (La Recréation, also 1961). By that time, Seberg had become estranged from Moreuil, and she recollected that production was \"pure hell\" and that he \"would scream at [her].\" She followed with Five Day Lover (L'amant de cinq jours, 1962), Congo vivo (1962) and In the French Style (1962), a French-American film featuring Stanley Baker released through Columbia. She also appeared in the anthology film The World's Most Beautiful Swindlers (Les plus belles escroqueries du monde, 1963) and Backfire (Échappement libre, 1964),which reunited her with Jean-Paul Belmondo."]}, {"page": "Donald Pleasence", "response": ["Endowed with a bald head, a penetrating stare, and an intense voice, usually quiet but capable of a piercing scream, he specialised in portraying insane, fanatical, or evil characters, including the title role in Dr Crippen (1962), the frontier prophet Oracle Jones in Hallelujah Trail, the double agent Dr Michaels in the science-fiction film Fantastic Voyage (1966), the white trader who sells guns to the Cheyenne Indians in the revisionist western Soldier Blue (1970), the mad German psychoanalyst with Bud Spencer–Terence Hill in  Watch Out, We're Mad! (1974), Nazi leader Heinrich Himmler in The Eagle Has Landed (1976), and the Bond arch-villain Ernst Stavro Blofeld in You Only Live Twice (1967), the first film in which Blofeld's face is clearly seen. His interpretation of the character has become predominant in popular culture considering the popularity of the comic villain, Dr. Evil in the successful Austin Powers film series, which primarily parodies it. In the crime drama Hell is a City (1960), shot in Manchester, he starred opposite Stanley Baker, while he was memorably cast in the horror comedy What a Carve Up! (1961) as the “horrible-looking zombie” solicitor opposite Shirley Eaton, Sid James, Kenneth Connor and Dennis Price."]}, {"page": "Robert Powell", "response": ["Powell took up acting while an undergraduate, although he had already appeared as a teenager in The Adventures of Samuel Poppleton on BBC Radio Children's Hour from the North of England in Manchester, where he came under the guidance of producer, Trevor Hill, as detailed in Hill's autobiography, Over the Airwaves. He secured a post at a repertory theatre in Stoke-on-Trent. His first film part was in Robbery (1967), which starred Stanley Baker and was about the Great Train Robbery, in which he played the second man or locomotive driver's assistant. He had a small role in the original film version of The Italian Job (1969) playing one of the gang, but had to wait a few years for his first success, playing scientist Toby Wren in the BBC's science fiction series, Doomwatch in 1970."]}, {"page": "Great Train Robbery (1963)", "response": ["* The 1967 film, Robbery, is a heavily fictionalised version based on the events of 1963 directed by Peter Yates. The movie launched Yates's Hollywood career after it attracted the interest of Steve McQueen who got the British director to make his next feature, Bullitt. The film featured a gripping car chase (though this was connected to another earlier crime and not the robbery) which included scenes of a policeman being run down. Despite being a fictionalised account Robbery did draw on key details of the real robbery and these were reflected in the film. These included the detailed planning and preparation used, the use of a farmhouse as a base and the intended (but unsuccessful) use of a replacement driver for the train. The film ends with the mastermind of the robbery \"Clifton\", played by Stanley Baker (whose own company Oakhurst Productions had produced the film), evading capture and going on the run overseas by posing as a merchant seaman.", "* In Robbery (1967), Stanley Baker plays a character based upon Reynolds."]}, {"page": "Stuart Whitman", "response": ["Whitman told that when he first met Peter Falk on the set of Murder, Inc., they had differences but eventually became friends. Whitman found The Mark director Guy Green difficult to work with, finding him demanding and too strict, but they became good friends afterwards. On the set of Sands of the Kalahari, Whitman said he became best friends with fellow cast members Stanley Baker and Theodore Bikel, while he didn't click with Jim Brown at first, they too became friends."]}, {"page": "1976 in film", "response": ["| style=\"text-align:center;\"| 28 || Stanley Baker || style=\"text-align:center;\"| 48 || style=\"text-align:center;\"| UK || style=\"text-align:center;\"| Actor || "]}, {"page": "1970 in film", "response": ["*The Last Grenade, directed by Gordon Flemyng, starring Stanley Baker, Honor Blackman, Richard Attenborough, Alex Cord", "*Perfect Friday, starring Ursula Andress and Stanley Baker"]}, {"page": "1969 in film", "response": ["*Where's Jack?, starring Stanley Baker and Tommy Steele – (U.K.)"]}, {"page": "1968 in film", "response": ["*The Girl with the Pistol (La ragazza con la pistola), starring Monica Vitti and Stanley Baker – (Italy)"]}, {"page": "1967 in film", "response": ["* Accident, directed by Joseph Losey, starring Dirk Bogarde and Stanley Baker – (U.K.)", "* Robbery, directed by Peter Yates, starring Stanley Baker – (U.K.)"]}, {"page": "1965 in film", "response": ["* Dingaka, starring Stanley Baker – (South Africa)", "*Sands of the Kalahari, starring Stuart Whitman, Stanley Baker, Susannah York – (U.K.)"]}, {"page": "1964 in film", "response": ["* Zulu, directed by Cy Endfield, starring Stanley Baker, Michael Caine and Jack Hawkins – (U.K.)"]}, {"page": "1962 in film", "response": ["*Eva (released in the U.K. as Eve), starring Jeanne Moreau, Stanley Baker and Virna Lisi  – (Italy/France)"]}, {"page": "1960 in film", "response": ["*The Criminal, directed by Joseph Losey, starring Stanley Baker – (U.K.)", "*Hell Is a City, starring Stanley Baker – (U.K.)"]}, {"page": "1959 in film", "response": ["*Jet Storm, starring Richard Attenborough, Stanley Baker, Diane Cilento, Mai Zetterling – (Britain)", "*Yesterday's Enemy, directed by Val Guest, starring Stanley Baker – (Britain)"]}, {"page": "1957 in film", "response": ["*Hell Drivers, directed by Cy Endfield, starring Stanley Baker, Peggy Cummins, Patrick McGoohan – (GB)"]}, {"page": "1956 in film", "response": ["*Checkpoint (1956 film), directed by Ralph Thomas, starring Anthony Steel, Odile Versois, Stanley Baker & James Robertson Justice – (U.K.)", "*Helen of Troy, starring Rossana Podestà, Stanley Baker"]}, {"page": "1954 in film", "response": ["*The Good Die Young, directed by Lewis Gilbert, starring Stanley Baker and Laurence Harvey – (GB)"]}, {"page": "Television Wales and the West", "response": ["The main opening programme came at 7:00 pm with The Stars Rise in the West, a filmed special introduced by It's That Man Again regular Jack Train. The programme, produced in association with ITN, featured appearances from Ralph Richardson, Stanley Baker (later a founder of TWW's successors, Harlech Television), Naunton Wayne, Donald Sinden, Tessie O'Shea, Donald Houston, Petula Clark, Tommy Cooper and Ralph Reader. Harry Secombe also appeared in a short film clip, performing Nessun Dorma."]}, {"page": "BBC Television Shakespeare", "response": ["After the war, Shakespearean adaptations were screened much less frequently, and tended to be more 'significant' specifically made-for-TV productions. In 1947, for example, O'Ferrall directed a two-part adaptation of Hamlet, starring John Byron as Hamlet, Sebastian Shaw as Claudius and Margaret Rawlings as Gertrude (5 & 15 December). Other post war productions included Richard II, directed by Royston Morley, and starring Alan Wheatley as Richard and Clement McCallin as Bolingbroke (29 October 1950); Henry V, again directed by Morley, and starring Clement McCallin as Henry and Olaf Pooley as The Dauphin (22 April 1951); an original Sunday Night Theatre production of The Taming of the Shrew, directed by Desmond Davis, and starring Margaret Johnston as Katherina and Stanley Baker as Petruchio (20 April 1952); a TV version of John Barton's Elizabethan Theatre Company production of Henry V, starring Colin George as Henry and Michael David as The Dauphin (19 May 1953); a Sunday Night Theatre live performance of Lionel Harris' musical production of The Comedy of Errors, starring David Pool as Antipholus of Ephesus and Paul Hansard as Antipholus of Syracuse (16 May 1954); and The Life of Henry the Fifth, the inaugural programme of BBC's new World Theatre series, directed by Peter Dews, and starring John Neville as Henry and John Wood as The Dauphin (29 December 1957)."]}, {"page": "Tollesbury", "response": ["Lord Harlech and the film actor Stanley Baker) in the village square. Michael Attfield, chairman of the Tollesbury Association, was reported as saying that the Association would be pleased to let any other village \"threatened\" by the GWF festival have the results of what had been learned during the protest campaign."]}, {"page": "Tommy Steele", "response": ["In the West End, he appeared in She Stoops to Conquer, and played the title role of Hans Christian Andersen. On film, he recreated his London and Broadway stage role in Half a Sixpence, and played character roles in The Happiest Millionaire and Finian's Rainbow, although many critics found his personality to be somewhat overwhelming on screen. In this last film, probably his best known appearance in films, he played Og, the leprechaun turning human, and co-starred with Petula Clark and Fred Astaire. In 1968, British exhibitors voted him the fourth most popular star at the local box office.\"News in Brief\". The Times (London, England) 31 December 1968: 2. The Times Digital Archive. Web. 12 July 2012. The following year, he starred with Stanley Baker in the period drama Where's Jack?"]}, {"page": "John Barry (composer)", "response": ["These achievements caught the attention of the producers of a new film called Dr. No (1962) who were dissatisfied with a theme for James Bond given to them by Monty Norman. Barry was hired and the result was one of the most famous signature tunes in film history, the \"James Bond Theme\". (Credit goes to Monty Norman, see here.) When the producers of the Bond series engaged Lionel Bart to score the next James Bond film From Russia with Love (1963), they discovered that Bart could neither read nor write music. Though Bart wrote a title song for the film, the producers remembered Barry's arrangement of the James Bond Theme and his composing and arranging for several films with Adam Faith. Lionel Bart also recommended Barry to producer Stanley Baker for his 1964 film Zulu.Hall, Dr Sheldon Zulu: With Some Guts Behind It: The Making of the Epic Movie 2005 Tomahawk Press That same year Bart and Barry collaborated on the film Man in the Middle; and then, in 1965, Barry worked with director Bryan Forbes in scoring the World War II prison-camp drama King Rat."]}, {"page": "Mary Hopkin", "response": ["On 2 October 1968, Hopkin appeared at St Paul's Cathedral in London for the Pop Experience, where she sang \"Morning of My Life\", \"Turn Turn Turn\" and \"Plaisir d'amour\". In December that year, the NME music magazine reported that Hopkin was considering a lead acting role in Stanley Baker's planned film Rape of the Fair Country, which was to be based on  Alexander Cordell's book of the same name. That particular project did not materialise but Hopkin did sing the title songs to two of Baker's films, Where's Jack? and Kidnapped."]}, {"page": "Denis Quilley", "response": ["Quilley was born in Islington, North London, the son of Clifford Charles Quilley, a Post Office telegraphist, and his wife Ada Winifred, née Stanley.Gaye, p. 1085Barker, Dennis. \"Denis Quilley – Gifted actor whose versatility belied his great strengths\", The Guardian, 7 October 2003, p. 29 He won a scholarship to Bancroft's School in Woodford Green, London, and was expected to go from there to a university, but he was determined to become an actor as soon as possible.  He made his stage debut with the Birmingham Repertory Theatre Company, during the 1945 season, in a company that, he recalled, included Paul Scofield, Stanley Baker, Paul Eddington, Alun Owen and \"a 20-year-old wunderkind director called Peter Brook, of whom everybody was already in some awe.\"Hebert, Hugh. \"An Antony in search of his Cleo\", The Guardian, 31 January 1983, p. 11"]}, {"page": "George Baker (actor)", "response": ["Baker stayed as leading man in The Woman for Joe (1955) opposite Diane Cilento; The Feminine Touch (1956), playing a handsome doctor in a nurse film; A Hill in Korea (1956), playing a heroic soldier, with Robert Shaw and Stanley Baker in support; and The Extra Day (1956), a comedy."]}, {"page": "Ursula Andress", "response": ["Andress went to England to appear in Perfect Friday (1970), a heist film starring Stanley Baker and David Warner.  In Spain she appeared in Red Sun (1971), a Western with an international cast, including Charles Bronson, Toshiro Mifune and Alain Delon. In a 1972 interview, she said \"I think my image, especially to Americans, is that of a femme fatale, a man-eating woman. I'm not empty-headed or calculating and cool. But maybe my looks give that impression. I'm disciplined in my doings and undisciplined in my emotions. I can't control the things I feel or hide my feelings.\""]}, {"page": "Roy Kinnear", "response": ["Kinnear was Stanley Baker's original choice to play VC recipient Frederick Hitch in the film Zulu. Baker did not know Kinnear's name, and told the casting director to get \"the actor from That Was the Week That Was whose surname begins with K.\" David Kernan, also a cast member of that programme, was summoned and Baker chose to hire him rather than search for Kinnear."]}, {"page": "Accident (1967 film)", "response": ["*Stanley Baker as Charley", "The film confused many viewers who were not sure what it meant. \"It's obvious what Accident meant\", said Stanley Baker, who acted a lead role in the film. \"It meant what was shown on the screen.\" Baker did concede of Joseph Losey's filmmaking that, \"One of Joe's problems is that he tends to wrap things up too much for himself. I think that 75% of the audience didn't realise that Accident was a flashback.\""]}, {"page": "George Sanders", "response": ["He continued to act, though; his final roles were \"Fade Out\" with Stanley Baker on ITV Sunday Night, The Night of the Assassin (1970), Mission: Impossible (\"The Merchant\"), Rendezvous with Dishonour (1971); Doomwatch (1972), a feature-film version of a contemporary BBC television series; Endless Night (1972), and Psychomania (1973)."]}, {"page": "Michael Winner", "response": ["20th Century Fox hired Winner to direct The Games (1970), a film about the Olympic Games and which starred Ryan O'Neal and Stanley Baker, with script by Eric Segal."]}, {"page": "Wilbur Smith", "response": ["In 2012, Smith said When the Lion Feeds remained his favourite because it was his first to be published. Film rights were bought by Stanley Baker but no movie resulted. However, the money enabled Smith to quit his job in the South African taxation office, calculating he had enough to not have to work for two years."]}, {"page": "The Games (film)", "response": ["* Stanley Baker as Bill Oliver "]}]}}