{"wiki_id": "http://www.wikidata.org/entity/Q13645303", "itemLabel": "Lucy Christopher", "itemDescription": "author", "wikipedia_url": "https://en.wikipedia.org/wiki/Lucy_Christopher", "wikipedia_page": {"main": "Lucy Christopher is a British/Australian author best known for her novel Stolen, which won the Branford Boase award 2010 in the UK, and the 2010 Gold Inky in Australia. Her second book, Flyaway, was shortlisted for the 2010 Costa Book Awards and the 2010 Waterstone's Children's Book Prize. She currently lives in the United Kingdom and is working on her fourth novel, as well as the screenplay for her critically acclaimed novel Stolen.", "link_mentions": [{"page": "Fly Away", "response": ["* Flyaway, a 2012 novel by Lucy Christopher"]}, {"page": "Branford Boase Award", "response": [" | 2010 || Lucy Christopher || Stolen || Imogen Cooper || Chicken House Publishing", "* Lucy Christopher – Stolen – Chicken House"]}, {"page": "Mentone Girls' Grammar School", "response": ["*Lucy Christopher – Professional writer of young adult novels"]}, {"page": "Waterstones Children's Book Prize", "response": ["*Flyaway by Lucy Christopher"]}, {"page": "Prime Minister's Literary Awards", "response": ["*Stolen by Lucy Christopher", "*Flyaway by Lucy Christopher"]}, {"page": "2010 Costa Book Awards", "response": ["*Lucy Christopher, Flyaway"]}, {"page": "The Chicken House", "response": ["Founded in 2000 by Barry Cunningham and Rachel Hickman as Chicken House Publishing, it was bought by Scholastic in 2005. It has introduced many new successful authors, including Cornelia Funke, Roderick Gordon and Brian Williams, Kevin Brooks, Lucy Christopher, Rachel Ward, M. G. Leonard, Rachel Grinti, Kiran Millwood Hargrave and Jasbinder Bilan. The Story So Far, retrieved 18 June 2012 It is the UK publisher of the multi-million bestselling Maze Runner series."]}, {"page": "Stolen (Christopher novel)", "response": ["Stolen is the debut novel of author Lucy Christopher. It was published in the UK in 2009 and is the story of Gemma Toombs, a 16-year-old girl who is kidnapped by a 24-year-old man named Ty and taken to the middle of the Great Sandy Desert in the Australian Outback. Subtitled A Letter to My Captor, the book is told in second person narrative as a letter from Gemma to Ty.BBC News (25 May 2010). \"Branford Boase Award nomination for Bath author's debut\". Retrieved 22 March 2012.", "*Southern Schools Book Award Southern Schools Book Awards. \"Lucy Christopher - winner in 2010 with Stolen\". Retrieved 22 March 2012.", "*Interview: Lucy Christopher on the background to Stolen. The Hindu (15 December 2010).", "*Lucy Christopher on WorldCat"]}, {"page": "The Night She Disappeared", "response": ["The novel received positive reviews. Wendy Schmalz, for Publishers Weekly, was particularly effusive, stating \"it's a riveting story that many readers will finish in one sitting\", finding that \"each chapter is a surprise, and the tension builds steadily until the inevitable climactic face-off.\" Erin Wyatt, for VOYA magazine, found it to be a \"plot-driven, page-turning thriller\", stating that \"Henry provides just enough detail to provide depth and complexity to the characters\" and that \"the suspense builds to a fever pitch near the end of the book.\" Traci Glass, for School Library Journal, called the novel a \"fast-paced, gripping thriller\" and that \"fans of intense page-turners and those who liked Michele Jaffe's Rosebush or Lucy Christopher's Stolen will love this one.\" Tempering this a little, Glass also found that \"the ending comes a little too fast and is too neatly tied up\", though does find that, despite this, \"Gabie is an intriguing protagonist.\" Kirkus Reviews offered a more critical viewpoint, stating that they found that the way the novel is written, including various police reports and interviews and varying character view-points, to \"add interest and texture to what otherwise would be a straight genre tale\". They found that \"the police seem amazingly obtuse, Gabie's belief that Kayla is alive is given no realistic, clue-based hook and the third quarter [of the novel] has some pacing problems\"; however also that \"Gabie and Drew's budding relationship is believable, and it has a strong wingding climax followed by a feel-good ending\"; concluding that the novel is \"unexceptional but solid.\""]}, {"page": "Inky Awards", "response": ["|Lucy Christopher"]}]}}