{"wiki_id": "http://www.wikidata.org/entity/Q1546121", "itemLabel": "Greville Janner, Baron Janner of Braunstone", "itemDescription": "British politician, barrister and writer (1928-2015)", "wikipedia_url": "https://en.wikipedia.org/wiki/Greville_Janner", "wikipedia_page": {"main": "Greville Ewan Janner, Baron Janner of Braunstone, QC (11 July 1928 – 19 December 2015) was a British politician, barrister and writer. He became a Leicester Labour MP in the 1970 general election as a last-minute candidate, succeeding his father. He was an MP until 1997, and then elevated to the House of Lords. Never a frontbencher, Janner was particularly known for his work on Select Committees; he chaired the Select Committee on Employment for a time. He was associated with a number of Jewish organisations including the Board of Deputies of British Jews, of which he was chairman from 1978 to 1984, and was later prominent in the field of education about the Holocaust.\nBeginning in 1991, several allegations of child sexual abuse were made against Janner. Criminal proceedings brought in 2015 were halted by his death in December of that year; claims made against his estate were all dropped by May 2017, with Janner's family calling the claimants \"false accusers\" afraid of cross-examination. Carl Beech, whose accusations had led to the Operation Midland police investigation, was convicted for false accusation of Janner and others and jailed for 18 years; the Janner family subsequently criticized both the Labour politician Tom Watson for his part in the affair, and the system \"where people are believed instantly before the evidence is examined\". An enquiry into the handling of the case by officials began in October 2020.  In October 2021, the enquiry concluded that the police 'appeared reluctant to fully investigate' the allegations against Janner, and that the process had been marred by a 'series of failings'.", "link_mentions": [{"page": "December 19", "response": ["*  2015   – Greville Janner, Baron Janner of Braunstone, Welsh-English lawyer and politician (b. 1928)"]}, {"page": "List of Harvard Law School alumni", "response": ["*Greville Janner, Baron Janner of Braunstone, British Labour Party politician"]}, {"page": "Lord Janner", "response": ["*Greville Janner, Baron Janner of Braunstone (1928–2015), his son, Labour MP 1970–1997"]}]}}