{"wiki_id": "http://www.wikidata.org/entity/Q15707351", "itemLabel": "Owain ap Hywel", "itemDescription": "10th century king of Deheubarth", "wikipedia_url": "https://en.wikipedia.org/wiki/Owain_ap_Hywel_Dda", "wikipedia_page": {"main": "Owain ap Hywel (died c. 988) was king of Deheubarth in south Wales and probably also controlled Powys.\nOwain was one of the three sons of Hywel the Good. Upon Hywel's death in 948, Owain, Rhodri, and Edwin divided his lands among themselves according to Welsh law. The sons were not able to retain Hywel's hegemony over Gwynedd, which was reclaimed for its earlier dynasty by the sons of Idwal Foel.\nIn 950, two of the sons of Idwal Foel, Iago and Ieuaf, invaded the south, penetrating as far as Dyfed. The sons of Hywel retaliated by invading the north in 954, reaching as far north as the Conwy valley before being defeated at Llanrwst and being obliged to retreat to Ceredigion.\nRhodri died in 953 and Edwin in 954, leaving Owain in sole possession of Deheubarth alone.\nIn 958 Owain attacked Gorwennydd. From there he went to Euas and Ergin and seized them from Morgan the Great, King of Glamorgan.In 959 Owain broke into the monastery Llan Illdud in Gorwennydd, and damaged the monastery Catwg in Nant Garvan.In 962 Owain swore to pay yearly tribute to King Edgar the Peaceful.Owain did not again try to reclaim Gwynedd; instead, he and his son Einion turned eastwards to attack the kingdom of Morgannwg (modern Glamorgan) in 960, 970, and 977. Owain was now aging, and it appears that Einion took over the rule of the kingdom on behalf of his father. On a further raid on the east in 984, Einion was killed by the noblemen of Gwent.\nFollowing Einion's death, Owain's second son Maredudd took over his position. In 986, he successfully returned to the north and seized Gwynedd, ousting Ieuaf's son Cadwallon. Owain died in 988 and Maredudd became king of Deheubarth as well, although he later consented to share his kingdom with Einion's heirs Edwin and Cadell.\nThe A text of the Annales Cambriae was apparently compiled at Owain's instigation.", "link_mentions": {}}}