{"wiki_id": "http://www.wikidata.org/entity/Q16255748", "itemLabel": "Julia Watson", "itemDescription": "British actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Julia_Watson", "wikipedia_page": {"main": "Julia Watson (born 13 September 1953) is a British actress known for playing Barbara 'Baz' Wilder in the BBC medical drama Casualty in 1986, 1995–98 and again from 2003 to 2004.", "link_mentions": [{"page": "Casualty (TV series)", "response": ["Casualty follows the professional and personal lives of the medical and ancillary staff of Holby City Hospital's emergency department. It features an ensemble cast of regular characters, and began with ten main characters in its first series. The original characters are consultant Ewart Plimmer (Bernard Gallagher), senior house officer Baz Samuels (Julia Watson), charge nurse Charlie Fairhead (Derek Thompson), staff nurse Clive King (George Harris), state enrolled nurse Megan Roach (Brenda Fricker), student nurse Lisa \"Duffy\" Duffin (Cathy Shipton), paramedics Sandra Mute and Andrew Ponting (Lisa Bowerman and Robert Pugh), receptionist Susie Mercier (Debbie Roza) and porter Kuba Trzcinski (Christopher Rozycki)."]}, {"page": "The Yellow Wallpaper", "response": ["* In 1989, the story was adapted as The Yellow Wallpaper by the British Broadcasting Corporation (BBC), later shown in the U.S. on Masterpiece Theatre. It was adapted by Maggie Wadey, directed by John Clive, and starred Julia Watson and Stephen Dillane."]}, {"page": "List of Dempsey and Makepeace episodes", "response": ["| Julia Watson, Garry Cooper, Tim Preece"]}, {"page": "Never the Twain", "response": ["The series starred Windsor Davies (previously known for It Ain't Half Hot, Mum) and Donald Sinden as rival antique dealers, and also co-starred Robin Kermode (later replaced by Christopher Morris), Julia Watson (later replaced by Tacy Kneale), Honor Blackman, Teddy Turner, Derek Deadman, Maria Charles and Zara Nutley."]}, {"page": "David Harsent", "response": ["He lives with his wife, the actress Julia Watson, and their daughter in Barnes, London."]}, {"page": "Derby College", "response": ["* Julia Watson (former head girl), Casualty"]}, {"page": "Characters of Casualty", "response": ["Louis Fairhead, played by Gregory Foreman, is Charlie Fairhead (Derek Thompson) and Baz Wilder's (Julia Watson) son. He was born during the eleventh series. In 2015, Foreman revealed that he had been abused in the streets due to Louis' behaviour towards his father. The actor stated, \"A lot of people dislike Louis because they have such an affection for Charlie. They want him to be nice to his dad rather than put him down.\" Louis develops a heroin addiction."]}, {"page": "Amy's View", "response": ["A subsequent production followed at Nottingham Playhouse from Friday 5 to Saturday 20 November 2010, directed by Zoë Waterman. Esme Allen was played by Julia Watson with Kirsty Besterman as Amy, Ryan Early as Dominic, Robin Bowerman as Frank, Margaret Robertson as Evelyn and Thomas Eyre as Toby."]}, {"page": "Shadow Play (play)", "response": ["In 1991, BBC television mounted productions of the individual plays of Tonight at 8.30 starring Joan Collins.Truss, Lynne. \"Tonight at 8.30\", The Times, 15 April 1991 In Shadow Play she co-starred with Simon Williams.\"Tonight at 8.30\", BBC Genome. Retrieved 1 April 2020 A BBC radio production was broadcast in 1999 as part of the celebrations of Coward's centenary. Julia Watson and Steven Pacey played the Gayforths.\"Tonight at 8.30\", BBC Genome. Retrieved 1 April 2020"]}, {"page": "Casualty (series 1)", "response": ["The first series of Casualty consisted of fifteen episodes, which aired weekly on a Saturday night. Each episode was individually titled. The first series featured ten main characters, who were all appointed different roles within the A&E department. By the end of the first series, two actors would not be returning for the second series: Julia Watson (Baz Samuels) and George Harris (Clive King).", "*Julia Watson as Barbara \"Baz\" Samuels (until episode 15)"]}, {"page": "Casualty (series 9)", "response": ["Joan Oliver, Sorcha Cusack, Steven Brand and Jason Merrells were introduced in episode one as senior house officer Eddie Gordon, senior staff nurse Kate Wilson, staff nurse Adam Cooke and receptionist Matt Hawley. Lisa Coleman and Sue Devaney were also introduced throughout the series as staff nurse Jude Korcanik and paramedic Liz Harker respectively. They made their first appearances in episodes two and ten respectively. Colette Brown appeared in three episodes of the series as Adam's former wife Emma Quinn. Julia Watson decided to reprise her role of Barbara \"Baz\" Hayes, now a locum emergency medicine consultant. Watson had last appeared on the show at the conclusion of the first series and returned in episode twenty. Oliver and Brand departed at the conclusion of the series.", "*Julia Watson as Barbara \"Baz\" Hayes (from episode 20)"]}, {"page": "Casualty (series 10)", "response": ["The tenth series of Casualty features a cast of characters working in the emergency department of Holby City Hospital. The series began with 10 roles with star billing, which was a significant increase from the previous series. Clive Mantle starred as emergency medicine consultant Mike Barratt. Julia Watson appeared as specialist registrar Barbara \"Baz\" Hayes. Derek Thompson continued his role as charge nurse Charlie Fairhead while Sorcha Cusack portrayed senior staff nurse Kate Wilson. Patrick Robinson, Jane Gurnett and Lisa Coleman appeared as staff nurses Martin \"Ash\" Ashford, Rachel Longworth and Jude Korcanik. Ian Bleasdale and Sue Devaney starred as paramedics Josh Griffiths and Liz Harker. Jason Merrells portrayed receptionist Matt Hawley.", "*Julia Watson as Barbara \"Baz\" Hayes"]}, {"page": "Casualty (series 11)", "response": ["The eleventh series of Casualty features a cast of characters working in the emergency department of Holby City Hospital. The series began with 8 roles with star billing. Clive Mantle starred as emergency medicine consultant Mike Barratt. Julia Watson appeared as specialist registrar Barbara \"Baz\" Hayes. Derek Thompson continued his role as charge nurse Charlie Fairhead while Sorcha Cusack portrayed ward sister Kate Wilson. Lisa Coleman appeared as staff nurse Jude Korcanik. Ian Bleasdale and Sue Devaney starred as paramedics Josh Griffiths and Liz Harker. Jason Merrells portrayed receptionist Matt Hawley. Soo Drouet guest starred throughout the series as Monica, an anaesthetist. ", "*Julia Watson as Barbara \"Baz\" Hayes (until episode 1, from episode 9)"]}, {"page": "Casualty (series 12)", "response": ["The twelfth series of Casualty features a cast of characters working in the emergency department of Holby City Hospital. The series began with 8 roles with star billing, with a number of cast changes following the departures of several characters at the end of the previous series. Peter Birch and Julia Watson starred as emergency medicine consultants Jack Hathaway and Barbara \"Baz\" Hayes. Gray O'Brien appeared as senior house officer Richard McCaig. Derek Thompson continued his role as charge nurse Charlie Fairhead while Sorcha Cusack portrayed sister Kate Wilson. Jonathan Kerrigan appeared as staff nurse Sam Colloby. Ian Bleasdale and Sue Devaney starred as paramedics Josh Griffiths and Liz Harker. Soo Drouet continued her recurring role as Monica, an anaesthetist, until episode three. ", "*Julia Watson as Barbara \"Baz\" Hayes (until episode 26)"]}, {"page": "Casualty (series 18)", "response": ["The eighteenth series of the British medical drama television series Casualty began airing on BBC One in the United Kingdom on 13 September 2003, and concluded on 28 August 2004. The series consists of 46 episodes, which focus on the professional and personal lives of medical and ancillary staff at the emergency department (ED) of the fictional Holby City Hospital. Foz Allen serves as the series producer, while Mal Young and Mervyn Watson act as the executive producers of the series. Twelve regular cast members reprised their roles from the previous series and six actors joined the cast during the series. Original cast member Julia Watson, who portrays Baz Wilder, also returned.", "Leanne Wilson was introduced as staff nurse Claire Guildford, who was described as \"gentle, happy glow as dependable and down-to-earth\". Wilson explained that Claire is strong, confident in her decisions and excited about her work. The character quickly features in a story about the end of her relationship with Keith, her boyfriend of six years. Keith is not ready to end the relationship and becomes scary, not accepting her decision. The character of Tally Harper was reintroduced to the main cast, with the role recast to actress Holly Davidson. Tally is the \"troublesome\" eldest daughter of Harry, who the actress called \"feisty and independent\". Tally cares for her younger siblings, following the recent death of their mother. Davidson explained that Tally resents her father for not coping with her death well. The actress drew on her own parents' divorce to play the death of Tally's mother. One story for the character sees her become romantically involved with Simon, against the wishes of Harry. The series also features the return of original character Baz Wilder, portrayed by Julia Watson. The character was killed off after eight episodes.", "*Julia Watson as Baz Wilder (episodes 12−19)"]}, {"page": "Duffy (Casualty)", "response": ["In 1998, Shipton agreed to return to the role. The actress felt strange being back on the show because the cast and the show's humour had changed. She told author Rachel Silver that \"I did feel a bit left out at first but I soon got back into the swing of it.\"Silver 1998, p.102. Duffy returns to the hospital because \"she loved it\" and \"knows she's good at it\", she also has \"enormous enthusiasm\" to resume her career. She arrives to attend Charlie and Baz Hayes' (Julia Watson) wedding, as part of a two-episode special edition of Casualty. Alongside Shipton former cast members Brenda Fricker, Clive Mantle and Patrick Robinson all reprised their roles as Megan Roach, Mike Barratt and Martin Ashford respectively."]}, {"page": "List of Never the Twain episodes", "response": ["Never the Twain is a British television sitcom created by Johnnie Mortimer. The show debuted 7 September 1981 on ITV. During its ten-year run, 11 series and a Christmas special were produced, with 67 episodes broadcast in total. The lead characters are Simon Peel and Oliver Smallbridge, played by Donald Sinden and Windsor Davies respectively, who are rival antique dealers that have shops next door to each other as well as neighbouring houses. Peel's son David (Robin Kermode/Christopher Morris) and Smallbridge's daughter Lynn (Julia Watson/Tacy Kneale) enter into a relationship and marry much to the reluctance of their fathers. Peel and Smallbridge engage in a continuous games of one-upmanship but often appear to be friends despite neither prepared to admit it. Recurring characters include Veronica Barton (Honor Blackman), a middle-class widow whom Peel and Smallbridge battle for the affection of; Banks (Teddy Turner), Peel's butler; Ringo (Derek Deadman), Smallbridge's idiotic shop assistant; Mrs. Sadler (Maria Charles), Smallbridge's clumsy cleaner who has a habit of breaking things; and Eleanor (Zara Nutley), Peel's auntie."]}, {"page": "List of residents of Barnes, London", "response": ["|Julia Watson|| b. 1953|| Actress known for playing Barbara \"Baz\" Wilder in the BBC medical drama Casualty||Lives in Barnes||||"]}]}}