{"wiki_id": "http://www.wikidata.org/entity/Q336556", "itemLabel": "George Jeffreys, 1st Baron Jeffreys", "itemDescription": "Welsh judge (1645–1689), aka the Hanging Judge", "wikipedia_url": "https://en.wikipedia.org/wiki/George_Jeffreys,_1st_Baron_Jeffreys", "wikipedia_page": {"main": "George Jeffreys, 1st Baron Jeffreys, PC (15 May 1645 – 18 April 1689), also known as \"the Hanging Judge\", was a Welsh judge. He became notable during the reign of King James II, rising to the position of Lord Chancellor (and serving as Lord High Steward in certain instances). His conduct as a judge was to enforce royal policy, resulting in an historical reputation for severity and bias.", "link_mentions": [{"page": "April 18", "response": ["*1689 – George Jeffreys, 1st Baron Jeffreys, Welsh judge and politician, Lord Chancellor of Great Britain (b. 1648)"]}, {"page": "May 15", "response": ["*1645 – George Jeffreys, 1st Baron Jeffreys, British judge (d. 1689)"]}, {"page": "1689", "response": ["* April 18 – George Jeffreys, 1st Baron Jeffreys, British Lord Chief Justice (b. 1648)"]}, {"page": "1645", "response": ["* May 15 – George Jeffreys, 1st Baron Jeffreys, British judge (d. 1689)"]}, {"page": "List of Welsh people", "response": ["*George Jeffreys, 1st Baron Jeffreys (1648–1689), hanging judge"]}, {"page": "Judge Jeffreys", "response": ["#REDIRECT George Jeffreys, 1st Baron Jeffreys"]}, {"page": "Lord High Steward", "response": ["| George Jeffreys, 1st Baron Jeffreys(Lord Chancellor)"]}, {"page": "Baron Jeffreys", "response": ["*George Jeffreys, 1st Baron Jeffreys (1648–1689)"]}, {"page": "Popish Plot", "response": ["When James II acceded to the throne in 1685 he had Oates tried on two charges of perjury. The Bench which tried him was presided over by the formidable George Jeffreys, 1st Baron Jeffreys, who conducted the trial in such a manner that Oates had no hope of acquittal, and the jury brought in the expected guilty verdict. The death penalty was not available for perjury and Oates was sentenced to be stripped of clerical dress, whipped through London twice, and imprisoned for life and pilloried every year (the penalties were so severe that it has been argued that Jeffreys was trying to kill Oates by ill-treatment). Oates spent the next three years in prison. At the accession of William of Orange and Mary in 1689, he was pardoned and granted a pension of £260 a year, but his reputation did not recover. The pension was suspended, but in 1698 was restored and increased to £300 a year. Oates died on 12 or 13 July 1705, quite forgotten by the public which had once called him a hero."]}]}}