{"wiki_id": "http://www.wikidata.org/entity/Q3395909", "itemLabel": "Thomas Price", "itemDescription": "Welsh historian", "wikipedia_url": "https://en.wikipedia.org/wiki/Thomas_Price_(Carnhuanawc)", "wikipedia_page": {"main": "The Reverend Thomas Price (2 October 1787 – 7 November 1848) (known by the bardic name of Carnhuanawc) was a historian and a major Welsh literary figure of the early 19th century. Price was also \"an essayist, orator, naturalist, educationalist, linguist, antiquarian, artist and musician\". He contributed to learned and popular journals and was a leading figure in the revival of the Eisteddfod.", "link_mentions": [{"page": "University of Wales, Lampeter", "response": ["The Old Hall also contains paintings of various principals, presidents, benefactors, vice-chancellors et al. including Bishop Burgess, Maurice Jones, Thomas Price,  Llewelyn Lewellin, Edward Harold Browne, Keith Robbins and Brian Robert Morris."]}, {"page": "Lady Charlotte Guest", "response": ["Guest arrived in Wales already expert in seven languages. She learnt Welsh, and associated with leading literary scholars of the Abergavenny Welsh Society Cymdeithas Cymreigyddion y Fenni, notably including Thomas Price, and John Jones (Tegid) who supported and encouraged her in her work. Villemarqué had an initially cordial relationship with her about Breton sources, but then plagiarised her work. She translated several mediaeval songs and poems, then in 1837 she began on the Mabinogion. John Jones (Tegid) borrowed a copy of the Llyfr Coch Hergest manuscript for her from Judge Bosanquet, who had originally commissioned him to transcribe a copy when Tegid was a young scholar at Oxford. The first tale Charlotte translated from Tegid's transcription was \"The Lady of the Fountain\" or \"Owain,\" which was well received when published in 1838."]}, {"page": "Augusta Hall, Baroness Llanover", "response": ["Lady Llanover was greatly influenced by the local bard, Thomas Price, whom she met at a local Eisteddfod in 1826.  Carnhuanawc taught her the Welsh language; she took the bardic name \"Gwenynen Gwent\", ('the bee of Gwent'). She became an early member of Cymreigyddion y Fenni. Her Welsh was never considered fluent but she was an extremely enthusiastic proponent of all things Welsh. She structured her household at Llanover Hall on what she considered to be Welsh traditions and gave all her staff Welsh titles and Welsh costume to wear."]}, {"page": "Price (surname)", "response": ["* Four Price, or Walter Thomas Price IV (born 1967), member of the Texas House of Representatives", "* Thomas Price (1852–1909), mason and lay preacher who became the first Labour premier of South Australia", "* Thomas Price (Carnhuanawc) (1787–1848), historian and a major Welsh literary figure of the early 19th century", "* Walter Thomas Price IV (born 1967), Texas politician"]}, {"page": "Book of Aneirin", "response": ["During the 15th century, the poet Dafydd Nanmor owned the manuscript, and it later passed into the hands of Robert Vaughan of Hengwrt, a well-known collector. It remained in the Hengwrt collection until the 1780s, when it was stolen. Thomas Price (Carnhuanawc) later acquired it and, following his death in 1848, it was bought by another collector, Sir Thomas Phillipps, 1st Baronet. In 1896 it was bought by Cardiff Free Library and thus passed to the National Library of Wales, where it has been restored and rebound. "]}, {"page": "Pan-Celticism", "response": ["In the 1820s, early pan-Celtic contacts began to develop, firstly between the Welsh and the Bretons, as Thomas Price and Jean-François Le Gonidec worked together to translate the New Testament into Breton. The two men were champions of their respective languages and both highly influential in their own countries.  It was in this spirit that a Pan-Celtic Congress took place at the Cymreigyddion y Fenni's annual Eisteddfod in Abergavenny in 1838, where Bretons attended. Among these participants was Théodore Hersart de La Villemarqué, author of the Macpherson-Morganwg influenced Barzaz Breiz, who imported the Gorsedd idea into Brittany. Indeed, the Breton nationalists would be the most enthusiastic pan-Celticists,. acting as a lynch-pin between the different parts; \"trapped\" within another state (France), this allowed them to draw strength from kindred peoples across the Channel and they also shared a strong attachment to the Catholic faith with the Irish."]}, {"page": "List of Welsh-language authors", "response": ["*Thomas Price (Carnhuanawc) (1787–1848)"]}, {"page": "Christ College, Brecon", "response": ["* Thomas Price (Carnhuanawc) - historian and Welsh language advocate"]}, {"page": "Thomas Price", "response": ["Thomas Price may refer to:", "*Thomas Price (South Australian politician) (1852–1909), Premier of South Australia", "*Thomas Price (bishop) (1599–1685), Church of Ireland archbishop of Cashel", "*Thomas Price (Carnhuanawc) (1787–1848), Welsh literary figure of the early 19th century", "*Thomas Price (Queensland politician) (1840–1906), Member of the Queensland Legislative Assembly, Australia", "*Thomas Price (soldier) (1842–1911), Australian soldier", "*Thomas Price (Baptist minister) (1820–1888), Welsh Baptist minister", "*Tomos Prys (c. 1564–1634), also Thomas Price, Welsh soldier, sailor and poet", "*Thomas Price (governor), President of the British Virgin Islands", "*Thomas Price (actor) (born 1985), Hong Kong-born actor", "*Thomas Price (architect) (fl. 1846-1850), architect of Walkerville Brewery and other buildings in Adelaide, South Australia"]}, {"page": "1840s in Wales", "response": ["**date unknown — Thomas Price (Carnhuanawc), poet and historian (born 1787)"]}, {"page": "1842 in Wales", "response": ["*Thomas Price (Carnhuanawc) – A History of Wales to the Death of Llywelyn ap Gruffydd, vol. 14"]}, {"page": "1848 in Wales", "response": ["*7 November – Thomas Price (Carnhuanawc), poet and historian, 61"]}, {"page": "1830s in Wales", "response": ["*Thomas Price (Carnhuanawc) - Hanes Cymru a Chenedl y Cymry o'r Cynoesoedd hyd at Farwolaeth Llywelyn ap Gruffydd, vol. 1 (1836)"]}, {"page": "1820s in Wales", "response": ["*Thomas Price (Carnhuanawc) – An Essay on the Physiognomy and Physiology of the Present Inhabitants of Britain (1829)"]}, {"page": "1836 in Wales", "response": ["*Thomas Price (Carnhuanawc) - Hanes Cymru a Chenedl y Cymry o'r Cynoesoedd hyd at Farwolaeth Llywelyn ap Gruffydd, vol. 1"]}, {"page": "1820 in Wales", "response": ["**Thomas Price (Carnhuanawc) founds a Welsh school at Gelli Felen."]}, {"page": "1823 in Wales", "response": ["**The Welsh Literary Society of Brecon is established by Thomas Price (Carnhuanawc)."]}, {"page": "1829 in Wales", "response": ["*Thomas Price (Carnhuanawc) - An Essay on the Physiognomy and Physiology of the Present Inhabitants of Britain"]}, {"page": "1780s in Wales", "response": ["**2 October - Thomas Price (Carnhuanawc), historian (died 1848)"]}, {"page": "1813 in Wales", "response": ["*April - Thomas Price (Carnhuanawc) moves to Crickhowell to take over several parishes in the vicinity."]}, {"page": "1787 in Wales", "response": ["*2 October - Thomas Price (Carnhuanawc), historian (died 1848)"]}, {"page": "University of Wales Trinity Saint David", "response": ["The Old Hall also contains paintings of various principals, presidents, benefactors, vice-chancellors et al. including the founder of the University Bishop Thomas Burgess, Maurice Jones, Thomas Price, Llewelyn Lewellin, Edward Harold Browne, Keith Robbins and Brian Robert Morris."]}, {"page": "Jean-François Le Gonidec", "response": ["However he was unable to obtain official Catholic support for his translation of the New Testament. It was only published in 1827 under the auspices of the British and Foreign Bible Society, who had been lobbied to support Le Gonidec by the champion of Welsh language publications, Thomas Price (known as \"Carnhuanawc\"). The resulting \"Protestant\" translation was placed on the Index of Banned Books by the Catholic Church."]}, {"page": "Cymreigyddion y Fenni", "response": ["Another early member of the society was the Welsh poet and scholar, Rev. Thomas Price, known better today by his bardic name Carnhuanawc."]}, {"page": "Arthur James Johnes", "response": ["Johnes was an ardent student of Welsh literature. He was one of the promoters of the Cambrian Quarterly Magazine (1829–1833) (Literary Remains of the Rev. Thomas Price, ii. 97), to which he contributed articles under the signature of ‘Maelog,’ and under the same name published in 1834 some admirable English translations of poems by Dafydd ap Gwilym [q. v.] In 1831 Johnes won the prize offered by the Cymmrodorion Society for an essay on the causes of dissent in Wales, under the title 'An Essay on the Causes which have produced Dissent from the Established Church in the Principality of Wales.' It was published by the society, and to a second edition, published in 1832, he added copious historical and statistical details. A third edition was published in 1870 (Llanidloes, 8vo). This was the first successful attempt by a churchman to expose the abuses of the establishment in Wales–pluralism, nepotism, absenteeism, and the promotion of English-speaking clergy to Welsh-speaking parishes. Johnes wrote as a staunch friend of the church, and in 1837 he published in pamphlet form a correspondence on the subject with Lord John Russell, In the following year Johnes actively and successfully resisted Lord John's scheme for the union of the sees of Bangor and St. Asaph, and the appropriation of the income of one of them to the newly created see of Manchester. He published in 1841 ‘Statistical Illustrations of the Claims of the Welsh Dioceses to Augmentation out of the Funds at the disposal of the Ecclesiastical Commissioners, in a Letter to Lord John Russell,’ London, 8vo; and in 1843, ‘Philological Proofs of the original unity and recent origin of the Human Race,’ London, 8vo. A new edition of the latter appeared in 1846."]}, {"page": "Bible translations into Breton", "response": ["Jean-François Le Gonidec translated the Bible into Breton language. After the Catholic Church refused its publication it was eventually published in 1827 under the auspices of the British and Foreign Bible Society, who had been lobbied to support Le Gonidec by the champion of Welsh language publications, Thomas Price (known as \"Carnhuanawc\"). The resulting \"Protestant\" translation was placed on the Index of Banned Books by the Catholic Church."]}, {"page": "Cambrian Quarterly Magazine and Celtic Repertory", "response": ["The principal founder of the magazine was Rice Pryce Buckley Williames who also served as its first editor. His co-proprietor was Anthony Ashley Cooper, later Lord Shaftsbury. Thomas Price, a cleric and historian who was instrumental in reviving the Eisteddfod, was also a founder. The magazine was promoted by county court judge Arthur James Johnes."]}]}}