{"wiki_id": "http://www.wikidata.org/entity/Q3398669", "itemLabel": "Jon Lee", "itemDescription": "Welsh rock drummer", "wikipedia_url": "https://en.wikipedia.org/wiki/Jon_Lee_(drummer)", "wikipedia_page": {"main": "Jonathan Henry \"Jon\" Lee (28 March 1968 – 7 January 2002) was a Welsh drummer. He was the original drummer of the British rock band Feeder.", "link_mentions": [{"page": "List of Welsh people", "response": ["*Jon Lee (1968–2002), drummer with rock band Feeder"]}, {"page": "List of suicides", "response": ["* Jon Lee (2002), Welsh drummer for the British rock band Feeder, hanging"]}, {"page": "2002 in music", "response": ["* January 7 – Jon Lee (33), Feeder drummer (suicide)"]}, {"page": "List of drummers", "response": ["* Jon Lee (Feeder)"]}, {"page": "Feeder (band)", "response": ["The band was formed in 1994,Jon Lee tribute night at T. J.'s Newport, programme guide. although an earlier incarnation under the name of \"Reel\" was formed in 1992 by vocalist and guitarist Grant Nicholas, drummer Jon Lee and bassist Simon Blight, three of the four members of Raindancer, after the departure of that band's other member, guitarist John Canham. However, Blight left Reel later in 1992, and the band played with many session bassists before hiring Taka Hirose in 1994 and re-establishing themselves as Feeder; that year, the band signed with The Echo Label.", "Feeder garnered media attention in 2001 for their third album, Echo Park, and its lead single, \"Buck Rogers\", which later became a UK top five single. Jon Lee died by suicide at his Miami home in January 2002, after which the remaining members began to record and play with former Skunk Anansie drummer Mark Richardson. They released their fourth album, Comfort in Sound, later that year; it touched on themes such as loss and coming to terms with death, while also exploring themes of positivity. Richardson was ultimately made an official member, remaining so until May 2009 when he returned to a reformed Skunk Anansie. Feeder have since worked with a roster of drummers live and in the studio, including Tim Trotter, Karl Brazil and Geoff Holroyde. Between 2010 and 2017, the band charted four more top 20 albums, with the latest of these being 2017's The Best of Feeder their second consecutive top 10 album. In 2019, the band signed a deal with Believe UK to release their tenth studio album, Tallulah.", "In 1994, Reel/Real's bass player, Julian Smith, left the group. Grant Nicholas and Jon Lee went 'back to the drawing board'. They placed an advert in Loot for a new bass player. The advert was answered by Taka Hirose, a Japanese ex-pat working in London as a graphic designer. The trio changed their name to Feeder, after Nicholas's pet goldfish. In 1994, Feeder sent a demo tape to The Echo Label. Representatives at Echo listened to the tape, sent an employee to see the band play live, then offered them a record contract.", "=== Jon Lee's death and Comfort in Sound (2002–2003) ===", "In January 2002, Jon Lee died at home in Miami. The band kept out of the public eye for most of the year. It was during this time that lead-singer Grant Nicholas wrote a series of songs relating to their emotions and reactions to Jon's death, which formed their fourth album Comfort in Sound. The band brought in former Skunk Anansie and Little Angels drummer Mark Richardson, whom Grant first met in 1994, when Feeder went on tour with Richardson's then-band, B.l.o.w.", "* Jon Lee – drums ", " bar:Jon         text:\"Jon Lee\""]}, {"page": "Grant Nicholas", "response": ["After leaving school Nicholas worked as a bike courier in London. When Grant was 19, he joined a progressive rock band called Multi-Story as their singer. He released one album with the band called 'Through Your Eyes' and they disbanded soon after. The album was not given any backing by FM Records, due to internal problems during and after recording, in which original singer Paul Ford left leading to Nicholas from local band 'Silent Partner', to be asked to join and re-record the already laid-down vocals, while re-writing some lyrics to suit his style. It was their second and final album. After Multi-Story broke up, Grant joined Welsh nine-piece Temper Temper, where he met future Feeder drummer, Jon Lee. Grant then formed electric/acoustic rock band called Rain Dancer with Jon Lee. Then the two would later go on to form a band called Reel which later was changed to Feeder. Lee joined Nicholas when he moved to London to work as a sound engineer.", "The band were formed whilst Nicholas was a producer, before moving to London to gain more experience. He had already met Jon Lee in Newport who moved down afterwards. They formed a band named Raindancer, who despite winning a TV slot never gained a record deal. This saw bassist John Canham part ways with the band, before Simon Blight followed soon after when they reformed as Hum, which was changed to Reel, before then changing their name once again to Real in 1994 with their final name of Feeder being decided on that same year. The band signed to The Echo Label in November of that year still under the name of Real,  when this was changed to Feeder shortly afterwards, with Hirose taking over bass duties in 1995. A year later in 1996, their debut single proper \"Stereoworld\" reached number 128 in the UK charts during October 1996, while the second single \"Tangerine\" reached number 60. The first full-length album, Polythene, was released in May 1997. Produced by Chris Sheldon, it charted at number 65 in the UK and was certified Silver for sales over 60,000 copies in 2003 when the band had already broken through (then upgraded to Gold status for 100,000 copies in 2017). Metal Hammer magazine included it in its Top 20 Albums of 1997 list at number 1.", "In 2002, drummer Jon Lee took his own life, which saw the band keep out of the public eye, until their fourth album Comfort in Sound was nearing its completion. The first play of its lead single \"Come Back Around\" on the Radio 1 The Evening Session show, was the first time since Jon's death that the band made any public appearance and released new material, while a few days before this Grant was interviewed on the station, in which he spoke of their first shows without Jon. The single charted at No. 14, while the follow-up \"Just the Way I'm Feeling\" made the Top 10, both singles appeared on Comfort in Sound, also produced by Norton, which although charting one place lower than Echo Park, became their first Platinum seller. The album featured Mark Richardson of Skunk Anansie on drums, before he parted company with Feeder in 2009, to return to a reformed Skunk Anansie."]}, {"page": "Skunk Anansie", "response": ["Mark recorded sessions for various artists including Skin before joining Feeder after the death of their original drummer, Jon Lee. Mark has also been tutoring at the Brighton Institute with bandmate Ace."]}, {"page": "Polythene (album)", "response": ["*Jon Lee- drums"]}, {"page": "Echo Park (album)", "response": ["Following a return to live performances of their own, after performing for most of the year at various festivals and the release of the singles \"Buck Rogers\" and \"Seven Days in the Sun\" the album was released on 23 April 2001. Two further singles—\"Turn\" and \"Just a Day\"—followed the album's release, in which the latter was not on the album, but as a B-side on \"Seven Days in the Sun\". The album received mixed reviews from the music press but was received well by the public, reaching number five on the UK Albums Chart. It is the last album to feature drummer Jon Lee before his death the following year."]}, {"page": "Comfort in Sound", "response": ["Comfort in Sound is the fourth studio album by Welsh rock band Feeder, released on 21 October 2002 and also the first to be released by the band after the suicide of drummer Jon Lee earlier in the year. The album was recorded at RAK Studios in London during most of 2002, and was produced by Gil Norton.", "The album was given a low-key promotional build up due to the death of drummer Jon Lee. Before the album's release, the band played a warm-up show at the Portsmouth Wedgewood rooms prior to performing at the Reading and Leeds festivals and at the Gig on the Green. Kerrang! magazine gave a rating of 5/5 (KKKKK), for the band's performance.  Part of the band's appearance on the main stage at the Glastonbury Festival was featured on BBC Three and the full set was broadcast on BBC Radio 1 later in the year."]}, {"page": "2002 in British music", "response": ["* 7 January – Jon Lee, Feeder drummer, 33 (suicide)"]}, {"page": "Taka Hirose", "response": ["In 1992 Hirose moved to London to study graphic design. After moving to London, Hirose planned to continue his musical activities, and answered an advertisement in the local Loot magazine from Grant Nicholas and Jon Lee, who were searching for a bassist in their new band, which would later become Feeder.  A few days later, Hirose met Lee at Camden Station and they went back to Nicholas' house where the band was officially formed."]}, {"page": "Pushing the Senses", "response": ["Pushing the Senses contains music in the same rock styles featured on Feeder's 2002 album Comfort in Sound, but it focuses more on pianos, rather than a string orchestra.. feederweb.com. February 2005. Retrieved 7 March 2008. Only \"Pain on Pain\" on the album mainly used strings, including samples from a mellotron.\"Grant Nicholas about Pushing The Senses (Part 1)\" . toazted.com. December 2004. Retrieved 7 March 2008. Frontman Grant Nicholas said he did not think the album needed them. He also called the album the band's \"Recovery album\" as he felt he was more at ease writing the songs than he was with Comfort in Sound, after the loss of their drummer Jon Lee,\"International songwriters - Grant Nicholas\" . Mushroom Music Publishing. Retrieved 7 January 2011. alongside stating that he was inspired by artists such as John Lennon within the piano playing and writing the songs. Grant told Kerrang! in May 2004, \"I've done some recording on my own in a little studio up by where I live in North London. I demo the album in its full form before the rest of the band play on it. It's difficult to know at this stage what it will turn out like, but so far its slightly more mature sounding\". Grant later added \"Each album is a journey and a reflection of the past, there is some stuff that touches on what has happened, but there are songs about love, songs of loss and songs about the future.  I don't want to give too much away but there's one track called \"Bitter Glass\". Its quite dark but uplifting too. It's about pulling yourself out of a big hole\".Kerrang!, issue 1005. \"'I'VE GOT A GOOD FEELING ABOUT THIS!' Feeder frontman gets busy in the studio\". Emap Limited", "\"Bitterglass\" was one of the earlier songs written for the album, while being one of Grant's favourite songs it is also seen by him as one of the darker songs on the record, and refers to the events of Jon Lee's suicide although Grant noted that it is also uplifting and gives an optimistic feeling in its chorus, while also giving a hypnotic feel alongside stating that the piano in the verses gives \"a kind of haunting melody\". Other tracks on the album that did not see a single release such as \"Morning Life\" was a track Grant wanted to be \"very atmospheric\", and \"something that would be great when you are driving around in your car\", while also wanting it to have a \"cinematic intro\". Grant later claimed that \"Morning Life\" was a track many of the band's fans started to \"pick up on\" after buying the album, and also said \"another version is a possibility\". \"Pilgrim Soul\", the eighth track on the album was described by Grant as its most heaviest and said it will appeal to older fans. He said the album needed the track to \"give it a lift at the end of the record\" and that the \"sing-a-long chorus\" is what makes a song work. The chorus was explained as positive and the verses as dark, with the answer to the verses revealed in the chorus."]}, {"page": "Little Angels", "response": ["Mark Richardson joined Skunk Anansie to replace their original drummer.  When that band folded, he joined Feeder, following the suicide of their original drummer Jon Lee. He remained with the band until the end of 2008 when he re-joined Skunk Anansie for a greatest hits tour and album, plus new material."]}, {"page": "John Lee", "response": ["* Jon Lee (drummer) (1968–2002), of the band Feeder"]}, {"page": "2002 in Wales", "response": ["*7 January - Jon Lee, rock musician, 33"]}, {"page": "Jon Lee (actor)", "response": ["In 2008 Lee voiced the part of Max, in the British Disney Channel cartoon series Famous 5: On the Case. Over Christmas and New Year's 2008–09 he appeared at The White Rock Theatre, Hastings, performing the leading role in the pantomime Peter Pan.\"Peter Pan\" at The White Rock Theatre, Hastings  Both Lee and the show were well received.Peter Pan at The Stage.co.uk Later in 2009 Lee appeared as Billy Fury in Nick Moran’s new film Telstar. On 22 May 2010 he appeared in BBC One's Casualty as Craig, who is diagnosed with motor neurone disease.Jon Lee (Casualty) interview at lastbroadcast.co.uk He played John in the internationally acclaimed musical Tomorrow Morning by Laurence Mark Wythe at the Landor Theatre in London. Over the following Christmas and New Year's, Lee appeared at the New Victoria Theatre, Woking as Prince Charming in Cinderella.Panto review: Cinderella at New Victoria Theatre Woking at thisissurreytoday.co.uk", "| rowspan=2|Jon Lee", "| Jon Lee", "*Jon Lee on Myspace", "*Jon Lee on YouTube"]}, {"page": "Just a Day", "response": ["\"Just a Day\" is a song by Feeder, released as the band's final single of 2001, notable for being their last with drummer Jon Lee. It was first released on the \"Seven Days in the Sun\" single as a B-side. Despite having already appeared in the top 20 earlier in the year as a B-side, the single A-side release stayed in the UK top 20 for four weeks, peaking at number 12. It also peaked at number 47 in Ireland. It instantly became a regular to end the band's live sets, but has been occasionally rested from this position for a cover of \"Breed\" by Nirvana, while never used as one of the \"Feeder covers\" at Renegades gigs. \"Just a Day\" has sold over 100,000 downloads and physical copies combined, with an additional 100,000 sales-equivalent streams bringing this up to 200,000 domestic consumption figures, enabling it to be certified Silver in the process.", "Feeder's performance of \"Just a Day\" on CD:UK in December 2001 was Feeder's last with Jon Lee. After filming for the performance wrapped, Lee left the studio premises on the back of a moped to travel to an airport, as he would spend Christmas and indeed his final days at his Miami home. This would be the last time frontman Grant Nicholas would see Lee. The week Jon Lee died, the band were due to appear on Top of the Pops performing \"Can't Stand Losing You\", a cover of the Police which appears on CD1 of this EP. Their place was taken by Ash performing \"There's a Star\". Before the release of the single, Feeder had already appeared on Later... with Jools Holland for the first time. This would be the last time Jon would perform with the band in a live setting as CD:UK was not fully live, they ended the show with the aforementioned \"Can't Stand Losing You\"."]}, {"page": "Reading and Leeds Festivals line-ups", "response": ["Guns N' Roses played only in Leeds as they had a prior touring commitment in London on the day of the Reading event. In Reading they were replaced by Raging Speedhorn who appeared much lower on the bill. A weekend ticket cost £90, a day ticket was £39. Reel Big Fish pulled out of Leeds for undisclosed reasons. Antipop Consortium cancelled their Dance Stage appearance after they disbanded earlier that month. Feeder were invited by Melvin Benn to headline the main stage on the first day at Reading and the second day at Leeds. They later turned this down, as they did not want to play such a high-profile slot so soon after the death of their drummer Jon Lee in January of that year. As a result, Feeder would instead headline the Radio 1 Evening Session Stage."]}, {"page": "Mark Richardson (musician)", "response": ["In January 2002, Feeder's drummer Jon Lee committed suicide in his Miami home. Richardson was asked by Feeder's frontman—Grant Nicholas—to be the new drummer with the band. Richardson had previously worked with Feeder when they supported  b.l.o.w. as well as Skunk Anansie. His first gig with Feeder was a warm-up for the Reading and Leeds Festivals in 2002, at the Portsmouth Wedgewood Rooms on 21 August. Richardson recorded drums on 2002's Comfort In Sound, 2005's Pushing the Senses, tracks for 2006's The Singles album and 2008's Silent Cry. All of these albums including Comfort in Sound (his first album with Feeder) made the Top 10 of the UK Albums Chart. On 6 May 2009, it was announced that Feeder had 'ended their partnership' with Richardson after seven years."]}, {"page": "Buck Rogers (song)", "response": ["Feeder continued to have chart success after \"Buck Rogers\", despite many critics labelling the band as one-hit wonders. Drummer Jon Lee however died in January 2002 after taking his own life, before the band made their return to the live stage in August later that year, with the highlight being a well-received set on the second stage of the Reading Festival. Comfort in Sound became a big success in their homeland and was recorded with Mark Richardson on drums. It propelled Feeder to a brief arena status which ended after Silent Cry fell behind sales expectations, but last played arenas in 2006, two years before the album was released."]}, {"page": "Seven Days in the Sun", "response": ["The music video for the song features band members Grant Nicholas, Taka Hirose, and the late Jon Lee on a beach shot in Cape Town, South Africa, implementing various methods of reeling in some girls. Grant dresses up as a bike salesman, and gets the girls' passports in exchange for bicycles, Taka, a waiter in order to \"demonstrate\" his cooking skills, and Jon, in drag, possibly to show them his feminine side. However, it is only Taka that succeeds to impress. Nine years since the video was shot, Feeder released via their Facebook page previously unreleased behind-the-scenes footage. The video appeared on the \"Indie 500\" list on VH2 in 2004 at number 407."]}, {"page": "Tangerine (Feeder song)", "response": ["The music video (directed by Toby Duckett) begins with a first person camera sequence of being let in by a doorman to a squat known as Oddballs Hall. The now demolished building at the junction of Harrow Rd and Ladbroke Grove in London where Feeder are performing in a dingy hall which features rats, several arcade machines, a giant fiberglass wolf head  and a man in a bathtub filled with tangerines. One end of the hall was covered with mirrors which were smashed for effect during the filming but the process proved to be too dangerous to all concerned so does not appear in the finished piece. Several slow-motion sequences occur during the performance in which tangerines fly at the band as they leap through the air, drummer Jon Lee's bass drum is also filled with tangerines. In keeping with the orange-based image of the song (and of the band at the time) the band wear several orange items of clothing during the video, including their then-trademark orange jumpsuits.  At the end of the performance the camera returns to first person, leaves the building and returns to the street. The doorman and the dog were residents, everyone else that appears are crew, all the filming was done in a single day and was shot on 72mm film.", "Category:Songs written by Jon Lee (drummer)"]}, {"page": "High (Feeder song)", "response": ["Two days after drummer Jon Lee committed suicide at his home in Miami, on the 7 January 2002 BBC Radio 1 DJ Steve Lamacq broadcast a tribute show to him, as part of his then show titled The Evening Session. Many fans earlier on in the day contacted Steve to play \"High\" as a tribute to Jon at the end of his show, which he did. When the band returned to the live stage in August of that year, all live performances of \"High\" saw Grant Nicholas play an acoustic guitar instead of an electric guitar as with all performances prior to this. Touring guitarist Dean Tidey played all the electric parts of the song. This was the only year the song was performed with this arrangement. The band's appearance at the Reading and Leeds festivals saw them play the second stage, to reflect the low-key profile to their shows. The second stage to this festival at the time was called The Evening Session Stage, the same name as Steve Lamacq's show at the time."]}, {"page": "Lost and Found (Feeder song)", "response": ["The song was voted 79th best song of 2006 by the readers of Q Magazine.Q Issue 246 January 2007 The music video features Feeder playing in an abandoned community centre and a street gang. The vinyl set also includes a 1998 recording named \"Uptight\", which features Jon Lee playing drums. The music video uses quick switching of the scenes featuring the band and the gang, this has been noted by many who have seen the video as off putting due to the speed the scene changes are made which were likened to that of those that can cause epileptic seizures."]}, {"page": "1968 in Wales", "response": ["*28 March – Jon Lee, musician (d. 2002)"]}, {"page": "Come Back Around", "response": ["\"Come Back Around\" is the first single released from Welsh rock band Feeder's fourth studio album, Comfort in Sound (2002). It was their first release after drummer Jon Lee's death earlier in the year and reached number 14 on the UK Singles Chart, becoming the band's 10th top-40 hit in the process. It also reached number 45 in Ireland. The promo video features four female drummers as a tribute to Jon Lee."]}, {"page": "Insomnia (Feeder song)", "response": ["The music video for Insomnia features Grant Nicholas, Taka Hirose, and late drummer Jon Lee performing in a hotel room and other various places including the band on a train and places around New York City."]}, {"page": "Day In Day Out (Feeder song)", "response": ["The video features band members Grant Nicholas, Taka Hirose, and Jon Lee performing in separate enclosed hollow glass boxes with shots of various random people staring at them."]}, {"page": "Comfort in Sound (song)", "response": ["The music video features various montages in black and white from the band's shows over the years; it is the last time to date the band's late drummer Jon Lee appears in a music video, and the first time for touring guitarist Dean Tidey, who would later re-appear in the video for \"Pushing the Senses\", which used a similar format."]}, {"page": "The Darling Buds", "response": ["Pressing forward with their new style, the group followed with their third and final album in 1992, entitled Erotica, a few weeks before Madonna's album of the same name. The album contained the US single, \"Long Day in the Universe\", which was featured on the soundtrack for the Mike Myers film, So I Married an Axe Murderer.  Shortly after the album was completed, drummer Hughes left and was briefly replaced by Jon Lee (who drummed on two non-LP b-sides), then by drummer Dennis McCarthy.  Around the same time, the group added second guitarist Matt Gray (ex-Soldier Dolls) to the line up. Although they toured the United States in support of the album for a year, the members of the Darling Buds grew increasingly frustrated by their lack of commercial success and disbanded. Speaking to the Q Magazine in 2012, Lewis explained the reasons behind their decision: \"Sony's London office wanted to pass the financial buck after we'd moved to LA and the bureaucracy meant we couldn't tour or record. We got stuck in limbo for ages and eventually called it a day.\"", "*Jon Lee – drums (1992– two of the B-sides on \"Sure Thing\"; later of the band Feeder)"]}]}}