{"wiki_id": "http://www.wikidata.org/entity/Q3395608", "itemLabel": "Joseph Parry", "itemDescription": "Welsh composer", "wikipedia_url": "https://en.wikipedia.org/wiki/Joseph_Parry", "wikipedia_page": {"main": "Joseph Parry (21 May 1841 – 17 February 1903) was a Welsh composer and musician. Born in Merthyr Tydfil, Wales, he is best known as the composer of \"Myfanwy\" and the hymn tune \"Aberystwyth\", on which the African song \"Nkosi Sikelel' iAfrika\" is said to be based. Parry was also the first Welshman to compose an opera; his composition, Blodwen, was the first opera in the Welsh language.\nBorn into a large family, Parry left school to work in the local coal mines when he was nine years of age. He then went to work at the Cyfarthfa Ironworks, where his father was also employed. In 1854 the family emigrated to the United States, settling at Danville, Pennsylvania, where Parry again found employment at an iron works.\nThough Parry had a great interest in music, he had no opportunity to study it until there was a temporary closure of the Rough and Ready Iron Works. Some of his co-workers were also musicians, and they offered music lessons while the iron works was closed. Parry joined a music sight-reading class taught by one of the men. He continued to study harmony with another co-worker, and learned how to read and write while he was learning about harmony.\nParry soon began submitting compositions to eisteddfodau in Wales and the United States and winning awards. During a return visit to Wales for the National Eisteddfod at Llandudno, Parry was offered two music scholarships, but was unable to accept due to family obligations. A fund was established for the support of Parry and his family while he studied music.\nParry went on to receive a Doctorate in Music from the University of Cambridge; he was the first Welshman to receive Bachelor's and Doctor's degrees in music from the University. He returned to Wales in 1874 to become the first Professor of Music at Aberystwyth University, later accepting a position at Cardiff University.", "link_mentions": [{"page": "1903", "response": ["* February 17 – Joseph Parry, Welsh composer (b. 1841)"]}, {"page": "Morris dance", "response": ["The North West tradition is named after the North West region of England and has always featured mixed and female sides, at least as far back as the 18th century. There is a picture of Eccles Wakes painted in 1822 that shows both male and female dancers.'Eccles Fair Wakes - Mayday 1822' by Joseph Parry| "]}, {"page": "Mungu ibariki Afrika", "response": ["\"Mungu ibariki Afrika\" was translated and became the state anthem of Tanganyika. It was essentially assigned to Enoch Sontonga, who died in 1905. Mungu ibariki Afrika used the tune to \"Nkosi Sikelel' iAfrika\" with a Swahili translation of the words. It is not known who composed the lyrics but it is known that it was Samuel Mqhayi and Enoch Sontonga who created the early versions used by the African National Congress. Although the tune has been assigned to Sontonga it is thought by some that the tune was originally written by Joseph Parry.Joseph Parry's Te Deum: Premiere for lost composition, James McLaren, \"012, BBC News, retrieved 22 June 2014"]}, {"page": "Danville, Pennsylvania", "response": ["* Joseph Parry, Welsh-born composer of hymn whose song 'Aberystwyth' was adapted into Nkosi Sikelel' iAfrika, a component of the national anthem of South Africa."]}, {"page": "List of museums in Wales", "response": ["| Joseph Parry's Cottage || Merthyr Tydfil || Merthyr Tydfil || South Wales || Historic house || website, 1840s period ironworker's cottage, birthplace of composer Joseph Parry"]}, {"page": "1903 in music", "response": ["*February 17 – Joseph Parry, organist and composer, 61"]}, {"page": "1892 in music", "response": ["*Joseph Parry – Saul of Tarsus (oratorio)"]}, {"page": "1873 in music", "response": ["*Joseph Parry becomes Professor of Music at the University of Wales, Aberystwyth."]}, {"page": "1878 in music", "response": ["* Joseph Parry – Blodwen"]}, {"page": "1865 in music", "response": ["*Joseph Parry is admitted to the Gorsedd of bards at the National Eisteddfod of Wales."]}, {"page": "1841 in music", "response": ["*May 21 – Joseph Parry, composer (died 1903)"]}, {"page": "William Sterndale Bennett", "response": ["The novelist Elizabeth Sara Sheppard portrayed Bennett as 'Starwood Burney' in her popular eulogy of Mendelssohn, the 1853 novel Charles Auchester.Sheppard (1928), p. viii. Although Bennett's reputation in Germany did not notably survive the 1840s, his English pupils had significant influence on British music of the later 19th and earlier 20th century Britain. Among his pupils at the RAM and elsewhere were Arthur Sullivan, Joseph Parry, Alice Mary Smith, W. S. Rockstro, Hubert Parry, Tobias Matthay, Francis Edward Bache, Eaton Faning and William Cusins.Dibble, Jeremy. \"Parry, Sir Hubert\", Dawes, Frank. \"Matthay, Tobias\", Mackerness, E D. \" Cusins, Sir William\", Temperley Nicholas. \"Bache, Francis Edward\", Grove Music Online, Oxford University Press, accessed 5 March 2015  Bennett's contributions to elevating musical training standards at Cambridge and the RAM were part of a trend in England in the latter part of the 19th century whose \"cumulative effect ... prior to World War I was incalculable\", according to Caldwell.Caldwell (1999), p. 225."]}, {"page": "Aberystwyth University", "response": ["*Joseph Parry, Professor of Music, composer, conductor"]}, {"page": "Merthyr Tydfil", "response": ["*Joseph Parry – composer"]}, {"page": "Music of Wales", "response": ["Although choral music in the 19th century by Welsh composers was mainly religious, there was a steady body of secular songs being produced. Composers such as Joseph Parry, whose work Myfanwy is still a favourite Welsh song, were followed by David Jenkins and D. Emlyn Evans, who tailored songs specifically for the Victorian music market.Davies (2008), pg 581. These secular hymns were embraced by the emerging male voice choirs, which formed originally as the tenor and bass sections of chapel choirs, but also sang outside the church in a form of recreation and fellowship.Davies (2008), pg 532. The industrial workforce attracted less of a jollity of English glee clubs and also avoided the more robust militaristic style of music. Composers such as Charles Gounod were imitated by Welsh contemporaries such as Parry, Protheroe and Price to cater for a Welsh fondness of dramatic narratives, wide dynamic contrasts and thrilling climaxes. As well as the growth of male voice choirs during the industrial period, Wales also experienced an increase in the popularity of brass bands. The bands were popular among the working classes, and were adopted by paternalistic employers who saw brass bands as a constructive activity for their work forces.Davies (2008), pg 79. Solo artists of note during the nineteenth century included charismatic singers Robert Rees (Eos Morlais) and Sarah Edith Wynne, who would tour outside Wales and helped build the country's reputation as a \"land of song\".Davies (2008) p.445Davies (2008) p.734"]}, {"page": "Welsh National Opera", "response": ["Choral singing became increasingly popular in 19th-century Wales, principally owing to the rise of the eisteddfod as a symbol of its culture. The first Welsh National Opera Company was formed in 1890. A local newspaper commented that it was remarkable that \"a race of people to whom vocal music is a ruling passion should not generations ago have established a permanent national opera\".\"Welsh National Opera\", Merthyr Times, 21 May 1897, p. 3 The company gave performances of operas by the Welsh composer Joseph Parry in Cardiff and on tour in Wales. The company, predominantly amateur with some professional guest singers from the London stage, gave numerous performances of Parry's Blodwen and Arienwen, composed in 1878 and 1890 respectively. An American tour was planned, but the company folded, and Parry's final opera, The Maid of Cefn Ydfa, was given at Cardiff by the Moody-Manners Opera Company in 1902.\"Welsh Opera on Tour\", Western Mail, 5 September 1890, p. 4; and \"Dr Joseph Parry\", The Manchester Guardian, 18 February 1903, p. 4"]}]}}