{"wiki_id": "http://www.wikidata.org/entity/Q3400896", "itemLabel": "Elystan Glodrydd", "itemDescription": "Welsh royal", "wikipedia_url": "https://en.wikipedia.org/wiki/Elystan_Glodrydd", "wikipedia_page": {"main": "Elystan Glodrydd (or, occasionally, Elstan Glodrydd; died c. 1010), also known as \"Æthelstan the Famous\" and \"The Renowned,\" was, according to Welsh genealogical tracts, the founder of the fifth Royal Tribe of Wales. He was the Prince of Buellt, and later also of Fferreg (also known as Ferlix); in the century after his death, Fferreg split into Maelienydd and ElfaelVery little is known about Elystan himself, but his descendants, including Cadwallon ap Madog, continued to rule Ferlix, a minor principality in mid Wales, and the main part of Rhwng Gwy a Hafren—the land between the Wye and the Severn. An early Welsh genealogical tract links him to Gwrtheyrnion, while other descendants of Gwrtheyrnion ruled Maelienydd, Elfael., and Cedewain.  These territories lay in an area roughly equivalent to the later counties of Radnorshire and southern Montgomeryshire, in today's county of Powys.  It has been conjectured by historian Paul Remfry that these territories formed a polity known as Cynllibiwg. However, this is not generally accepted.\nA Welsh genealogical source makes Elystan the seventh in descent from Iorwerth Hirflawdd, who probably died in the mid 9th century.\nElystan married either Gwenllian, daughter of Einon ap Hywel Dda, or Gwladis, daughter of Rhyn ap Ednowen, prince of Tegengl. One of his sons, Cadwgan, lord of Radnor, was the ancestor of the Cadogan family.", "link_mentions": [{"page": "Royal coat of arms of the United Kingdom", "response": ["||The arms of the Earl of Wessex impaled with those granted in 1999 to her father, Christopher Rhys-Jones, with remainder to his elder brother Theo. The new grant was based on an unregistered 200-year-old design. The lion alludes to one of the Countess' ancestors the Welsh knight Elystan Glodrydd, prince of Ferrig.Sophie's new coat. BBC News. 19 May 1999. Retrieved 14 November 2010."]}, {"page": "Earl Cadogan", "response": ["Of Welsh origin, the family name was spelled Cadwgan until the early 15th century. According to Burke's Peerage, the family descends from: Rees ap Griffith ap Llewelyn ap Meredith Bengoch ap Howell (Lord of Penbuallt) ap Sitsylt (Lord of Builth) ap Llewelyn (Lord of Builth) ap Cadwgan ap Elystan Glodrydd (\"The Renowned\"), Prince of Fferreg, of Dol-y-Gaer, Breconshire."]}, {"page": "Cefnllys Castle", "response": ["Cefnllys is connected in tradition with Elystan Glodrydd, a 10th-century prince of Buellt and founder of the regional Welsh dynasty. The court of a Welsh ruler is assumed to have been sited nearby, but the time period, duration and precise location of such a  are unresolved. In a Clwyd-Powys Archaeological Trust report for Cadw, Robert Silvester observed that the motte-and-bailey north of Castle Bank is considered a probable site, granting that a  in this setting is more likely to have superseded the Norman castle than predated it, and no physical traces have been found. A silver thumb-ring recovered on Castle Bank may date from an early medieval period of Welsh occupation, and the circular graveyard ringed by yew trees could denote a pre-Norman origin of St Michael's Church. However, there is no substantive archaeological or written evidence to support any of these "]}, {"page": "Brycheiniog", "response": ["As a result of Hwgan's behaviour, his son, Dryffin (also known as Tryffin) was forced by King Athelstan to pay tribute. Athelstan's godson and namesake, Elystan Glodrydd, deprived Dryffin of Ferlix, merging it with his own realm of Buellt. Nevertheless, records like the Book of Baglan still have Dryffin's descendants as rulers of Brycheiniog; Hwgan (and hence Dryffin) is named there as a direct descendant of Tangwydd. What state the kingship of Brycheiniog was in at this time is not completely certain; Elisse ap Tewdwr's son, Tewdwr ap Elisse, was certainly ruling between 927 and 929. Tewdwr ap Elisse is reported to have witnessed a charter at the English royal court in 934, along with Hywel Dda."]}, {"page": "Maelienydd", "response": ["As Hwgan had been an aggressor against the Saxons, his son Dryffin was forced by King Æthelstan to pay tribute, and was deposed from Ferlix. He was replaced by Elystan Glodrydd, Æthelstan's god-son (and namesake), united Ferlix with his existing realm of Buellt; Dryffin and his heirs would now only rule in Brycheiniog. Elystan was succeeded by his son, Cadwgan, who was succeeded by his eldest son, Idnerth; a younger son gave rise to the Cadogan family, who were raised to the nobility many centuries later.", "In 1282, Llywelyn ap Gruffudd again attacked Edward's lands, and was subsequently killed in Buellt, while attacking the local castle; his headless body was buried in Cwmhir Abbey. As the forces of Ceri had sided with Llywelyn, Ceri was declared forfeit, and handed to Roger. Strictly speaking, however, Ceri was not the last part of Ferlix to be dominated by the family of Elystan Glodrydd. In the 15th century, the descendant and heir of Roger Mortimer, Richard Plantagenet, appointed Ieuan ap Philip as castellan of Cefnllys; Ieuan was a scion of the Cadogan family, and thus a direct male descendant of Elystan Glodrydd, by a cadet branch", "Elystan Glodrydd & Rhwng Gwy a Hafren: http://www.elystan.co.uk"]}, {"page": "Aberglasney", "response": ["The site was owned for ten generations of a family which by tradition could trace its origins to Elystan Glodrydd \"Prince between Wye and Severn,\" and Gwenllian, granddaughter of Hywel Dda. After the triumphant return of Henry Tudor at the Battle of Bosworth, then owner William ap Thomas who was knighted by the king for his service, gained formal responsibilities in both North and South Wales, and decided to move permanently north to Coed Helen on the North Wales coast."]}, {"page": "Lordship of Gower", "response": ["However, King Henry I instead granted Eginawc to , a leading member of the army of Iorwerth's brother, Cadwgan. Though Hywel originated in Maelienydd as a descendant of Elystan Glodrydd, (supposedly his great-grandsonJesus College Manuscript 20), he also had the highly advantageous quality that he was the grandson of Angharad, the maternal granddaughter of Maredudd ab Owain (as well as, supposedly, being a descendant of Tudwal the Lame)."]}, {"page": "Gwrtheyrnion", "response": ["Cadwr's grandson, and heir, married a granddaughter of Merfyn ap Rhodri, the king of Powys (this did not mean that Powys gained any authority over Buellt/GwrtheyrnionOwen, p. 203.); their grandson, and heir, was Elystan Glodrydd. Elystan Glodrydd conquered the adjacent land between the Wye and Severn - Ferlix (known also by various other spellings, such as Fferllys, Fferleg, and Fferregs) and incorporated it into his own realm. Elystan was succeeded by his son, Cadwgan, who was succeeded by his eldest son, Idnerth; a younger son gave rise to the Cadogan family, who were raised to the nobility many centuries later."]}, {"page": "Rhwng Gwy a Hafren", "response": ["In the Iron Age and the Roman era, Rhwng Gwy a Hafren made up part of the territory of the Ordovices. During the Early Middle Ages the region was evidently associated with the Kingdom of Powys, although in later centuries the monarchs of Powys exercised no control over it. After the 9th or 10th centuries, the region was ruled by families tracing their descent from the shadowy figures of Iorwerth Hirflawdd and his descendant Elystan Glodrydd.Owen, p. 203. Although these families had lineal ties to Powys, they operated independently of the Powys monarchy. In the early 9th century another dynasty arose which formed Buellt and Gwerthrynion into an independent minor kingdom. The rulers of this kingdom did not trace their descent from the royal line of Powys, but from Pascent or Pasgen, a reputed son of the early king Vortigern. However the Powys connection was never totally forgotten. Welsh topographical lore remembered the traditional borders of Powys as extending to the Wye, while in 1176, Bishop Adam Parvipontanus tried to claim Ceri as part of his Diocese of St Asaph, apparently based on the old territorial claims of Powys over Rhwng Gwy a Hafren."]}, {"page": "11th century in Wales", "response": ["*probable - Elystan Glodrydd, founder of the fifth Royal Tribe of Wales"]}, {"page": "Cadwallon ap Madog", "response": ["Cadwallon ap Madog was the son of Madog ab Idnerth who had died in 1140, while Idnerth was a grandson of Elystan Glodrydd who had died in around 1010 and had founded a dynasty in the Middle Marches of Wales, in the area known as Rhwng Gwy a Hafren (Between Wye & Severn).", "After the death of Madog ab Idnerth, there was clearly a great deal of conflict in the Middle March between his family and the Norman Marcher lords. Madog is known to have had at least five sonsPeter Clement Bartrum: Welsh Genealogies AD 300-1400, page 386 'Elystan Glodrydd 33' of whom Hywel ap Madog and Cadwgan ap Madog were killed in 1142 by Helias de Say, the Lord of Clun. Another son - Maredudd ap Madog - was killed by Hugh de Mortimer in 1146. This left two surviving sons, who ended up in control of the two principal divisions of their father's lands in Rhwng Gwy a Hafren: Cadwallon ap Madog ruled Maelienydd and his younger brother Einion Clud ruled Elfael. The two fell out and Cadwallon is recorded as having seized Einion and handed him over to Owain Gwynedd, who in turn handed him over to Henry II. But Einion was later free, joining with his brother to rally under the banner of Owain Gwynedd at Corwen in 1165.", "*www.elystan.co.uk - website dedicated to the dynasty of Rhwng Gwy a Hafren, founded by Elystan Glodrydd"]}, {"page": "Elfael", "response": ["Hwgan, Tangwydd's son and successor, attempted to invade Mercia, while King Edward the Elder was distracted by the Viking invasion;  Hwgan, however, hadn't reckoned with Edward's sister, Æthelflæd, who lead an army against him. Æthelflæd defeated Hwgan, in battle, then invaded his lands, captured Hwgan's castle (in Brycheiniog). and took his wife prisoner.Togographical History of Wales, Brecknockshire Hwgan decided to form an alliance with the Vikings, but died soon after. Hwgan's son, Dryffin succeeded him, but Elystan Glodrydd, god-son (and namesake) of King Athelstan, conquered Ferlix; Dryffin and his heirs would now only rule Brycheiniog. ", "Anarawd left a son, Llywelyn ab Anarawd, who was recorded as granting some of his remaining lands in Elfael to the Abbey of Cwm Hir, which had been founded by his family. Llywelyn's daughter Annes married her cousin Adda ap Madog, a patrilineal descendant of Maelgwn (of Maelienydd), via his son Maredudd;Peter C. Bartrum, Welsh Genealogies AD 300-1500: page 388 'Elystan Glodrydd 35' Adda would eventually be the last of his family to own any part of Ferlix - in his case, Ceri.D. Stephenson: The Lordship of Ceri in the Thirteenth Century, Montgomeryshire Collections 95 (2007), pages 23-31 "]}, {"page": "Iorwerth Hirflawdd", "response": ["Nothing is known certainly of his life, but he must have lived in the mid 9th century.  Elystan Glodrydd (died c.1010), who is regarded as the founder of the fifth Royal Tribe of Wales, was seventh in descent from him.  He also appears near the head of a dynasty of Arwystli, where he is named as son of Tegonwy ap Teon.  Tegonwy also appears in the genealogy of Bleddyn ap Cynfyn, who was the ancestor of the later Princes of Powys.  Bleddyn's claim to rule came from his father Cynfyn,  being a Powys nobleman, Interim King of Powys and maternal grandson of the former King Cadell."]}, {"page": "Buellt", "response": ["By the 11th century, Buellt and the rest of the Rhwng Gwy a Hafren passed under the control of a different dynasty tracing its descent to Elystan Glodrydd.Lloyd, p. 406 & note."]}, {"page": "Einion ab Owain", "response": ["* Gwenllian, typically but probably erroneously credited with marrying Elystan Glodrydd"]}, {"page": "Lordship of Brecknock", "response": ["In the century before the Lordship was founded, Brycheiniog had been contested between its traditional dynasty, and that of Ferlix (a realm at the heart of Rhwng Gwy a Hafren). No more of the traditional line is reported by historic manuscripts (such as those of Jesus College), beyond Tewdwr ap Griffri. The Book of Baglan reports that Bleddyn ap Maenyrch, heir of the traditional dynasty of Ferlix (who had by now lost Ferlix itself, to Elystan Glodrydd's heirs), was the King of Brycheiniog during the time of the Norman invasion of England (possibly by acquiring a claim through his mother, the niece of Tewdwr ap Griffri)."]}, {"page": "Trelystan", "response": ["Elystan Glodrydd, who died in 1010AD, was possibly buried at Trelystan, as the Welsh placename could derive from Cappell Tref Elistan. This is first mentioned in the Harleian Manuscript 1973, written by Jacob Chaloner: ", "*The Royal Tribes of Wales: Elystan Glodrydd"]}]}}