{"wiki_id": "http://www.wikidata.org/entity/Q346480", "itemLabel": "Dave Evans", "itemDescription": "Australian singer", "wikipedia_url": "https://en.wikipedia.org/wiki/Dave_Evans_(singer)", "wikipedia_page": {"main": "Dave Evans is an Australian singer. He was the original lead singer for the Australian hard rock band AC/DC in 1973–1974, and sang on their debut single shortly before being replaced by Bon Scott. Evans then went on to join the band Rabbit who were active into the early 1980s. He resumed a solo career shortly after the year 2000.\n\n", "link_mentions": [{"page": "July 20", "response": ["*1953 – Dave Evans, Welsh-Australian singer-songwriter "]}, {"page": "List of Welsh people", "response": ["*Dave Evans (born 1953), former lead singer AC/DC"]}, {"page": "AC/DC", "response": ["In November 1973, Malcolm and Angus Young formed AC/DC with bassist Larry Van Kriedt, vocalist Dave Evans, and ex-Masters Apprentices drummer Colin Burgess. Gene Pierson booked the band to play at Chequers nightclub on New Year's Eve, 1973. By this time, Angus Young had adopted his characteristic school-uniform stage outfit. The idea was his sister Margaret's. Angus had tried other costumes: Spider-Man, Zorro, a gorilla, and a parody of Superman, named Super-Ang. In its early days, most members of the band dressed in some form of glam or satin outfit. On stage, Evans was occasionally replaced by the band's first manager, Dennis Laughlin, who was the original lead singer with Sherbet. In Paul Stenning's book AC/DC: Two Sides To Every Glory it was stated that Evans did not get along with Laughlin, which also contributed to the band's bitter feeling toward Evans.", "In September 1974, Bon Scott, an experienced vocalist and friend of George Young, replaced Dave Evans after friend Vince Lovegrove recommended him to George Young. Scott's appointment coincided with him working as a chauffeur for the band at the time until an audition promoted him to lead singer. Like the Young brothers, Scott was born in Scotland and emigrated to Australia in his childhood. The band had recorded only one single with Evans, \"Can I Sit Next to You, Girl\" / \"Rockin' in the Parlour\"; the song was re-written and re-recorded with Bon Scott.", "* Dave Evans – lead vocals (1973–1974)"]}, {"page": "Bon Scott", "response": ["Scott formed his first band, the Spektors, in 1964 and became the band's drummer and occasional lead vocalist. He performed in several other bands, including the Valentines and Fraternity, before replacing Dave Evans as the lead singer of AC/DC in 1974.", "Scott's wife, Irene Thornton, later wrote, \"The first time Bon saw AC/DC was in August 1974. They came through Adelaide with the Lou Reed and Stevie Wright tour, and played their own show at the Pooraka Hotel... The first time I saw AC/DC was at the Pooraka Hotel in September. 'Get up there, Bon,' Vince kept saying. The band didn't have a singer that night; they were playing instrumental versions of old rock 'n' roll standards. The boys ripped through all these classic numbers and then finally, with enough pressure from Vince, Bon climbed onto the stage. I didn't realise that AC/DC had just sacked Dave Evans and they wanted Bon to replace him. Like Bon, the Youngs were Scottish, so there was an instant bond.\"\"My marriage to AC/DC frontman Bon Scott and why we split, by Irene Thornton\" adelaidenow.com.au 20 September 2014", "Scott replaced Dave Evans as the lead singer of AC/DC on 24 October 1974, when it became obvious the band and Evans were heading in different directions, with Evans having personal clashes with band members and management. Scott's appointment coincided with him working as a chauffeur for the band at the time until an audition promoted him to lead singer."]}, {"page": "Angus Young", "response": ["Young was 18 when he and older brother Malcolm formed AC/DC in 1973. Angus was on lead guitar, Malcolm on rhythm guitar, Colin Burgess on drums, Larry Van Kriedt on bass guitar and Dave Evans on vocals. \"Can I Sit Next To You Girl,\" their first single, was later re-recorded with Bon Scott as their vocalist. They decided upon the name AC/DC, suggested by their sister Margaret, who saw the letters \"AC/DC\" on the back of her sewing machine."]}, {"page": "Malcolm Young", "response": ["Malcolm Young was 20 when he and younger brother Angus formed AC/DC in 1973. Angus was on lead guitar, Malcolm on rhythm guitar, Colin Burgess on drums, Larry Van Kriedt on bass guitar and Dave Evans on vocals. \"Can I Sit Next To You Girl,\" their first single, was later re-recorded with Bon Scott as their vocalist. They decided upon the name AC/DC after seeing the letters \"AC/DC\" on the back of their sister Margaret's sewing machine. In 1975 AC/DC had moved to Melbourne."]}, {"page": "David Evans", "response": ["* Dave Evans (bluegrass) (1950–2017), American tenor singer and banjo player", "* Dave Evans (singer) (born 1953), first lead singer of the rock band AC/DC", "* Dave Evans (racing driver) (1898–1974), American racecar driver", "* Dave Evans (footballer) (born 1958), English footballer", "* Dave Evans (entrepreneur), American entrepreneur and Stanford professor", "* Dave Evans (reporter) (born 1962), American reporter with WABC-TV"]}, {"page": "Charters Towers", "response": ["* Dave Evans, first lead singer of AC/DC from 1973 to 1974"]}, {"page": "Blood Duster", "response": ["The eponymous Blood Duster album was released in 2003 and featured special guests including original AC/DC singer Dave Evans, Jay Dunne from 28 Days, and all three members of Melbourne band The Spazzys. Two further singles were released from this album, \"IWannaDoItWithADonna\" in 2003 and \"SixSixSixteen\" in 2004."]}, {"page": "T.N.T. (album)", "response": ["T.N.T. contains some of the band's best-known songs, including the title track, \"It's a Long Way to the Top\", \"The Jack\", and \"Rocker.\" Seven of the album's nine songs were written by the Young brothers and Scott, while \"Can I Sit Next to You Girl\" predated Scott's involvement in the band, having been recorded as a single with former vocalist Dave Evans.  It features a different arrangement and slightly different lyrics from the original version. It also runs almost a minute longer. \"School Days\" is a cover version of a Chuck Berry song, a major influence on both Young brothers. \"High Voltage\" was the first song written and recorded for the album, the title inspired by that of the previous album.  In 1993, Angus Young shared the origins of the title track with Vic Garbarini of Guitar For the Practicing Musician: \"I remember sitting home one night before going into the studio and playing around with some chords, and I suddenly thought, let's try playing...A...C...D...C. Sounded good. And then I thought AC/DC...power...\"High Voltage\"! I sang the chorus part to my brother in the studio and he thought it sounded great.\" Issued as the first single before the T.N.T. sessions began, many fans thought it was from High Voltage. Chris Gilbey of Albert Productions later claimed this caused a late surge in that album's sales. Lyrically, the LP features Bon Scott chronicling both the good and the bad about the rock and roll lifestyle, warning aspiring musicians that \"it's harder than it looks\" (\"It's a Long Way to the Top\") but also defiantly telling the moral majority to \"stick your moral standards 'cause it's all a dirty lie\" (\"Rock 'n' Roll Singer\"). In 1994, biographer Clifton Walker observed that Bon was \"virtually encapsulating his entire life\" in both songs. The lyrics of \"The Jack,\" sometimes titled \"(She's Got) The Jack,\" were developed by Scott, who was inspired by a letter Malcolm Young received during a tour of Adelaide. The letter, from a woman in Melbourne, implied that Malcolm had given her a venereal disease, although he claims that when he got tested, he was clean. Scott's original lyrics were far more explicit than those heard on the album, which he deliberately toned down in case the song got played on radio. The bravado-driven \"Live Wire,\" which was also sexually suggestive, would be the band's show-opener for several years. Almost right from the beginning, the band was taken to task in some quarters for their \"smutty\" lyrics, as Angus acknowledged to Guitar Worlds Tom Beaujour in 1998:"]}, {"page": "Dan Ar Braz", "response": ["Braz released a collegian album of Irish jigs and reels in 1979, entitled Irish Reels, Jigs, Hornpipes and Airs with a band featuring Davey Graham, Dave Evans, and Duck Baker.  It was not commercially successful, and for several years, Braz seemed to turn his back on Celtic music. In 1981, he toured Europe promoting his album Acoustic, a subdued collection of instrumentals, written by himself. He then joined a blues-rock trio. Between 1984 and 1987, he toured the United States over a dozen times. By the time he recorded Musiques pour les silences à venir (Music for the Silences to Come) in 1985, he was being described as \"New Age\". After making another instrumental album, he moved in a new direction by recording a collection of songs in English, Songs (1990). Most were written by him, plus one each by Richard Thompson and Donovan. He teamed up with John Kirkpatrick to record a film score in 1992.", "* Irish Reels, Jigs, Hornpipes and Airs (1979) (with Duck Baker, Dave Evans, Davey Graham)"]}, {"page": "Peter Dawkins (musician)", "response": ["In 1975, he moved briefly to Festival Records, where he worked with Billy Thorpe (including Thorpe's 1975 solo hit \"It's Almost Summer\"), before moving to CBS Records. He then produced a string of successful recordings, including hits for the expatriate New Zealand rock group Dragon and Melbourne band Australian Crawl, as well as reggae-rock group Billy T (which included former Daddy Cool guitarist Ross Hannaford), and hard rock group Rabbit, which was fronted by original AC/DC vocalist Dave Evans."]}, {"page": "Larry Van Kriedt", "response": ["Larry Van Kriedt (born July 4, 1954) is an American-born Australian jazz musician. He is best known for being the original bassist for the rock band AC/DC around November 1973, joining Malcolm Young (rhythm guitar), Angus Young (lead guitar), Dave Evans (lead vocals) and Colin Burgess (drums). He was replaced in February 1974. Van Kriedt also plays saxophone, guitar and vocals.", "In November 1973 he was asked to join the brand new band AC/DC by Malcolm Young. Shortly after, lead singer Dave Evans, drummer Colin Burgess and guitarist Angus Young joined. On December 31, 1973 the band performed their first ever live show. Four months later the band recorded the single \"Can I Sit Next to You, Girl\", although shortly afterwards Van Kriedt was fired and his bass lines were said to have been re-recorded by George Young (one of the older brothers of Malcolm and Angus). After this, he was replaced by Neil Smith. AC/DC employed a succession of bass players over the following few months."]}]}}