{"wiki_id": "http://www.wikidata.org/entity/Q3498851", "itemLabel": "Steve Bates", "itemDescription": "English rugby union footballer", "wikipedia_url": "https://en.wikipedia.org/wiki/Steve_Bates", "wikipedia_page": {"main": "Steve Bates (born 4 March 1963) is a rugby coach and retired from former rugby union player. He played at scrum-half for London Wasps and was capped once for the England national rugby union team. He twice worked as a coach at Newcastle Falcons, 1995–2003 and 2007–2010.\n\n", "link_mentions": [{"page": "Fettes College", "response": ["* Steve Bates, played for the England national rugby union team"]}, {"page": "Newcastle Falcons", "response": ["The season began with high hopes as All-Black prop Carl Hayman signed for the Falcons, reportedly as the highest paid Rugby Union player in the world.  Unfortunately, the season was the beginning of a downward spiral for the Falcons.  On 11 March 2008, Fletcher and Walton left the club, officially by mutual consent,Boss Fletcher Leaves Newcastle, BBC Sport, 11 March 2008  following Black who had left a couple of months earlier. Steve Bates took over as interim director of rugby until summer 2008 when the post was reviewed. Dave Thompson stated at that time that nine years of underachievement were the reason for the departure of John Fletcher and Peter Walton.", "Having said this, Bates guided the Falcons to a record-equalling run of seven consecutive Premiership defeats by April 2008 with home games against Leicester Tigers and London Wasps plus a season-concluding away trip to Worcester Warriors yet to come. Defeat in the European Challenge Cup semi-final against Worcester Warriors on 25 April 2008 may well have sounded the death knell for Steve Bates' tenure as interim DoR. However, on Tuesday 20 May 2008 Steve Bates was confirmed as Newcastle's Director of Rugby on a full-time basis.Steve Bates given Newcastle Falcons job, Telegraph, 20 May 2008  At the end of the season, fly-half Toby Flood left for Leicester Tigers and full-back Mathew Tait signed for Sale Sharks, as the struggling Falcons failed to hold onto young English international talent. England Saxons scrum-half Lee Dickson would also depart for Northampton Saints, where he would go on to earn full international honours.  Legendary Australia full back Matt Burke retired due to injury at the end of the campaign.", "The Falcons failed to replace the character and quality which had departed, with imports Gcobani Bobo and Filipo Levi flattering to deceive, Gopperth the sole bright spot.  After a disappointing season the pressure mounted on Steve Bates and on 4 May 2010, the club announced that Bates' contract had been terminated and he was being replaced by first team coach Alan Tait."]}, {"page": "Border Reivers (rugby union)", "response": ["*Steve Bates"]}, {"page": "Tom Varndell", "response": ["He was selected in the England Saxons side that defeated Ireland A at Welford Road on 1 February 2008, scoring a brace in his first international since the tour to Australia 18 months prior. Saxons coach Steve Bates was keen for him to put pressure on first team selection."]}, {"page": "West London Institute of Higher Education", "response": ["* Steve Bates England Rugby international scrum-half (1989)"]}, {"page": "Welwyn RFC", "response": ["*Steve Bates – London Wasps, England (1989; 1 cap)"]}, {"page": "1989 England rugby union tour of Romania", "response": ["Steve Bates (Wasps)"]}, {"page": "1990 England rugby union tour of Argentina", "response": ["|align=left |Steve Bates (Bath - 1 cap - Half-Back)|| 1|| || || || || 0"]}, {"page": "1994 England rugby union tour of South Africa", "response": ["| Steve Bates", "|SH ||19||Steve Bates", "|SH ||18||Steve Bates"]}, {"page": "List of England national rugby union players", "response": ["|1132||Steve Bates||scrum-half ||1989-05-13||v Romania at Bucharest"]}, {"page": "England national under-20 rugby union team", "response": ["*Steve Bates (head coach)"]}, {"page": "1993 Five Nations Championship squads", "response": ["# Steve Bates"]}, {"page": "1990 Five Nations Championship squads", "response": ["# Steve Bates"]}, {"page": "1985–86 John Player Cup", "response": ["| ||9|| Steve Bates"]}, {"page": "1986–87 John Player Cup", "response": ["| ||9|| Steve Bates"]}, {"page": "1994–95 Pilkington Cup", "response": ["| ||9|| Steve Bates"]}, {"page": "1998–99 Tetley's Bitter Cup", "response": ["|colspan=\"4\"| Steve Bates"]}]}}