{"wiki_id": "http://www.wikidata.org/entity/Q3507204", "itemLabel": "Tony Bourge", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Tony_Bourge", "wikipedia_page": {"main": "Tony Bourge (born 23 November 1948, in Cardiff, Wales) is a Welsh musician who was the original guitarist for the rock band Budgie. He left the band in 1978. In 1982 he joined original Budgie drummer Ray Phillips, and formed Tredegar, with future members of Cloven Hoof singer Russ North and guitarist Andy Wood.\nIn 2013 Bourge returned to the music scene with a new album of songs called Crank It Up.  Artists such as Jerry Cantrell of Alice in Chains, Josh Homme of Queens of the Stone Age, and Kim Thayil of Soundgarden list him as an influence.", "link_mentions": [{"page": "Squawk (album)", "response": ["*Tony Bourge - guitar"]}, {"page": "Budgie (album)", "response": ["*Tony Bourge  -  guitar"]}, {"page": "If I Were Brittania I'd Waive the Rules", "response": ["*Tony Bourge – guitar, backing vocals (lead vocals on track 6)"]}, {"page": "Budgie (band)", "response": ["Budgie formed in 1967 in Cardiff, Wales under the name Hills Contemporary Grass. Their original line-up consisted of Burke Shelley on vocals and bass, Tony Bourge on guitar and vocals, and Ray Phillips on drums. After performing several gigs in 1968, the band changed their name to Budgie the following year and recorded their first demo. The band had initially considered going under the name \"Six Ton Budgie\", but decided the shorter single word variant was preferable. Burke Shelley has said that the band's name came from the fact that he, \"loved the idea of playing noisy, heavy rock, but calling ourselves after something diametrically opposed to that\"."]}, {"page": "Bandolier (album)", "response": ["*Tony Bourge – guitar, vocals, harmonica"]}, {"page": "Never Turn Your Back on a Friend", "response": ["*Tony Bourge - guitars, backing vocals"]}, {"page": "List of guitarists", "response": ["*Tony Bourge (Budgie (band))"]}, {"page": "Janne Stark", "response": ["In August 2019 Janne left Grand Design.http://jannestark.com/music/grand%20design/biography-grand%20design.html In November the same year, Janne recorded a tribute to Welsh hard rock band Budgie under the project name Bandolier Kings. The album also features singer/guitarist Tony Spinner and guest spots from former Budgie members Tony Bourge and Steve Williams. Other guests includes for example Kyoji Yamamoto of Bow Wow, Ian Haugland of  Europe, John Gallagher of Raven and Bill Steer of  Firebird."]}, {"page": "Impeckable", "response": ["Impeckable is Welsh rock band Budgie's seventh album, released in February 1978 on A&M Records. Guitarist Tony Bourge left the band after the album was released.", "*Tony Bourge – guitar"]}, {"page": "In for the Kill!", "response": ["*Tony Bourge - guitar"]}, {"page": "Power Supply (album)", "response": ["Power Supply is Budgie's eighth studio album, released in October 1980 on Active Records, a sublabel of RCA Records (which was the distributor of A&M Records — Budgie's previous label — at the time). This is the first album without original guitarist Tony Bourge, who left the band in 1978 after the album Impeckable."]}, {"page": "List of lead guitarists", "response": ["* Tony Bourge (Budgie)"]}, {"page": "Heavier Than Air – Rarest Eggs", "response": ["**Tracks 1-4 feature Burke Shelley, Tony Bourge and Ray Philips"]}, {"page": "Best of Budgie (1975 album)", "response": ["*Tony Bourge - guitar"]}, {"page": "Best of Budgie (1981 album)", "response": ["*Tony Bourge - guitar"]}, {"page": "An Ecstasy of Fumbling – The Definitive Anthology", "response": ["* Tony Bourge - guitar (tracks 1-11 & 13-16)"]}, {"page": "Best of Budgie (1997 album)", "response": ["*Tony Bourge - guitar (all tracks)"]}, {"page": "Radio Sessions 1974 & 1978", "response": ["*Tony Bourge - guitar", "*Tony Bourge - guitar"]}, {"page": "The BBC Recordings (Budgie album)", "response": ["*Tony Bourge - guitar"]}, {"page": "Ray Phillips (musician)", "response": ["Phillips formed his own band in the mid-1970s known as Ray Phillips Woman. When former Budgie guitarist Tony Bourge joined the band in the early 1980s, they became known as simply Woman. In 1982 he rejoined Bourge and formed Tredegar."]}, {"page": "Russ North", "response": ["North formed his first band at the age of 18 when he and his family were living in Caernarfon in North Wales, the band were called Monza, and recorded around five songs and played live venues and festivals throughout the UK. After the demise of Monza, North was in the process of putting his next band together when he was asked to join Tredegar, a band from the South Wales village of the same name. Both Tony Bourge and Ray Phillips of Tredegar were former members of Budgie. North began touring with the band and also added vocals to the track \"Which Way To Go\" on the almost-completed self-titled album Tredegar. The band appeared on a Welsh television music show singing two songs, one \"Duma\" from the album, and another song \"The Dealer\" with lyrics written by North's father. When Tredegar toured Russ was often mobbed, frequently being mistaken for Kiss frontman Paul Stanley."]}, {"page": "Tredegar (band)", "response": ["Tredegar were formed by former Budgie members Tony Bourge and Ray Phillips. Their debut album was recorded in 1986 with the help of Persian Risk's Carl Sentance as a guest vocalist as the band did not have a permanent singer at the time. Russ North joined the band in time to record vocals for one song, and stayed with the band for around one year before leaving with guitarist Andy Wood to join Cloven Hoof.", "*Tony Bourge - guitar (1982-90)"]}, {"page": "Tredegar (album)", "response": ["All songs written by Ray Philips and Tony Bourge.", "*Tony Bourge – lead guitar"]}, {"page": "List of songs recorded by Iron Maiden", "response": ["|Burke ShelleyTony Bourge"]}, {"page": "Bourge", "response": ["* Tony Bourge (born 1948), Welsh musician"]}]}}