{"wiki_id": "http://www.wikidata.org/entity/Q3506759", "itemLabel": "Ray Phillips", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Ray_Phillips_(musician)", "wikipedia_page": {"main": "Raymond Anthony Phillips (born 1 March 1949, Ely, Cardiff, South Glamorgan, South Wales) is a Welsh drummer. He is best known as the original drummer for the Welsh rock band Budgie. He left the band in November 1973.Phillips formed his own band in the mid-1970s known as Ray Phillips Woman. When former Budgie guitarist Tony Bourge joined the band in the early 1980s, they became known as simply Woman. In 1982 he rejoined Bourge and formed Tredegar.\nIn the 1990s, Phillips founded another band, Six Ton Budgie, alongside his son Justin Phillips on guitar and ex-Tredegar bassist Tom Prince on bass. Phillips played drums but also took over on lead vocals. The band toured the UK extensively for the next few years before Phillips took a break from music to look after his father.His solo album, Judgement Day, was released in May 2011 and he began touring again as the Ray Phillips Band with Tom Prince (again) and guitarist Adam Healy. He published his autobiography in April 2018.", "link_mentions": [{"page": "Squawk (album)", "response": ["*Ray Phillips - drums"]}, {"page": "Budgie (album)", "response": ["*Ray Phillips  - drums, percussion"]}, {"page": "Budgie (band)", "response": ["Budgie formed in 1967 in Cardiff, Wales under the name Hills Contemporary Grass. Their original line-up consisted of Burke Shelley on vocals and bass, Tony Bourge on guitar and vocals, and Ray Phillips on drums. After performing several gigs in 1968, the band changed their name to Budgie the following year and recorded their first demo. The band had initially considered going under the name \"Six Ton Budgie\", but decided the shorter single word variant was preferable. Burke Shelley has said that the band's name came from the fact that he, \"loved the idea of playing noisy, heavy rock, but calling ourselves after something diametrically opposed to that\".", "In April 2018, founder member and original drummer Ray Phillips released his autobiography."]}, {"page": "Alex Van Halen", "response": ["Both brothers were trained as classical pianists during childhood. Although Alex is known as a professional drummer, he began his musical aspirations as a guitarist, with his brother Eddie taking up drums. While Eddie was delivering newspapers to pay for his drum kit, Alex would practice playing on them. After spending some time playing Eddie's drum kit, Alex became more skilled than Eddie was as a drummer. After Eddie heard Alex's mastery of The Surfaris drum solo in the song \"Wipe Out\", he decided to learn to play the electric guitar. Alex was influenced by Budgie drummer Ray Phillips."]}, {"page": "Never Turn Your Back on a Friend", "response": ["*Ray Phillips - drums"]}, {"page": "Tony Bourge", "response": ["Tony Bourge (born 23 November 1948, in Cardiff, Wales) is a Welsh musician who was the original guitarist for the rock band Budgie. He left the band in 1978. In 1982 he joined original Budgie drummer Ray Phillips, and formed Tredegar, with future members of Cloven Hoof singer Russ North and guitarist Andy Wood."]}, {"page": "Best of Budgie (1975 album)", "response": ["*Ray Phillips - drums (tracks 1, 4, 7 & 9)"]}, {"page": "Best of Budgie (1981 album)", "response": ["*Ray Phillips - drums"]}, {"page": "An Ecstasy of Fumbling – The Definitive Anthology", "response": ["* Ray Phillips - drums (tracks 1-7)"]}, {"page": "Best of Budgie (1997 album)", "response": ["*Ray Phillips - drums (tracks 1, 2 & 7)"]}, {"page": "The BBC Recordings (Budgie album)", "response": ["*Ray Phillips - drums"]}, {"page": "Russ North", "response": ["North formed his first band at the age of 18 when he and his family were living in Caernarfon in North Wales, the band were called Monza, and recorded around five songs and played live venues and festivals throughout the UK. After the demise of Monza, North was in the process of putting his next band together when he was asked to join Tredegar, a band from the South Wales village of the same name. Both Tony Bourge and Ray Phillips of Tredegar were former members of Budgie. North began touring with the band and also added vocals to the track \"Which Way To Go\" on the almost-completed self-titled album Tredegar. The band appeared on a Welsh television music show singing two songs, one \"Duma\" from the album, and another song \"The Dealer\" with lyrics written by North's father. When Tredegar toured Russ was often mobbed, frequently being mistaken for Kiss frontman Paul Stanley."]}, {"page": "Tredegar (band)", "response": ["Tredegar were formed by former Budgie members Tony Bourge and Ray Phillips. Their debut album was recorded in 1986 with the help of Persian Risk's Carl Sentance as a guest vocalist as the band did not have a permanent singer at the time. Russ North joined the band in time to record vocals for one song, and stayed with the band for around one year before leaving with guitarist Andy Wood to join Cloven Hoof.", "The band went through many line-up changes, eventually leading to Ray Phillips being the only original member left. Phillips took over vocal duties for an album that was recorded in 1991, but not released after the record company that agreed to distribute it had a change of heart at the last minute.", "*Ray Phillips - drums (1982-92), lead vocals (1991–92)"]}, {"page": "Tredegar (album)", "response": ["*Ray Phillips – drums, producer"]}, {"page": "Ray Phillips", "response": ["Ray Phillips may refer to:", "*Ray Phillips (musician) (born 1949), Welsh rock drummer, original member of Budgie", "*Ray Phillips (American football) (born 1954), NFL player", "*Ray Phillips (cricketer) (born 1954), Australian cricketer", "*Ray Phillips, American amateur boxer, List of US national Golden Gloves champions", "*Ray Phillips, character in the Belizean TV drama, Noh Matta Wat!"]}, {"page": "List of songs recorded by Jason Newsted", "response": ["| Burke ShelleyTony BourgeRay Phillips", "| Burke ShelleyTony BourgeRay Phillips"]}, {"page": "List of songs recorded by Metallica", "response": ["|Burke ShelleyTony BourgeRay Phillips", "|Burke ShelleyTony BourgeRay Phillips"]}, {"page": "List of Budgie band members", "response": ["Budgie were a Welsh heavy metal band from Cardiff. Formed in late 1967, the group originally consisted of lead vocalist and bassist Burke Shelley, guitarists and backing vocalists Tony Bourge and Brian Goddard, and drummer Ray Phillips. The group broke up in 2010, when their lineup featured Shelley, drummer Steve Williams (originally a member from 1974 to 1986, and later since 1999), and guitarist Craig Goldy (who joined in 2008).", "Budgie were formed in late 1967. The original lineup featured Burke Shelley, Brian Goddard, Tony Bourge and Ray Phillips. By early 1970, Goddard had left the group because, according to Shelley, \"he got a girl pregnant and suddenly had to get a job\". The remaining trio released Budgie in 1971, Squawk in 1972 and Never Turn Your Back on a Friend in 1973. By the end of 1973, Phillips had left Budgie. He was replaced by Pete Boot, who debuted on In for the Kill! released the following year. After around a year with the band, Boot was replaced at the end of 1974 by Steve Williams. Bandolier, If I Were Brittania I'd Waive the Rules and Impeckable followed, before Bourge left in the summer of 1978. He later recalled that \"I would've loved to have carried on, but after a while the lifestyle gets to you.\"", "|Ray Phillips", "*Ray Phillips – drums, percussion", "*Ray Phillips – drums, percussion", "*Ray Phillips – drums, percussion"]}]}}