{"wiki_id": "http://www.wikidata.org/entity/Q363711", "itemLabel": "John Penry", "itemDescription": "Protestant martyr", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Penry", "wikipedia_page": {"main": "John Penry (1563 – 29 May 1593) is Wales's most famous Protestant martyr.", "link_mentions": [{"page": "May 29", "response": ["*1593 – John Penry, Welsh martyr (b. 1559)"]}, {"page": "1593", "response": ["* May 29 – John Penry, Welsh Protestant (hanged) (b. 1559)"]}, {"page": "Reformation", "response": ["Bishop Richard Davies and dissident Protestant cleric John Penry introduced Calvinist theology to Wales. In 1588, the Bishop of Llandaff published the entire Bible in the Welsh language. The translation had a significant impact upon the Welsh population and helped to firmly establish Protestantism among the Welsh people.The Church in Wales: The Protestant Reformation"]}, {"page": "1559", "response": ["** John Penry, Welsh Protestant martyr (d. 1593)"]}, {"page": "Pilgrims (Plymouth Colony)", "response": ["The Separatist movement was controversial. Under the Act of Uniformity 1559, it was illegal not to attend official Church of England services, with a fine of one shilling (£0.05; about £ today) for each missed Sunday and holy day. The penalties included imprisonment and larger fines for conducting unofficial services. The Seditious Sectaries Act of 1593 was specifically aimed at outlawing the Brownists. Under this policy, the London Underground Church from 1566, and then Robert Browne and his followers in Norfolk during the 1580s, were repeatedly imprisoned. Henry Barrow, John Greenwood, and John Penry were executed for sedition in 1593. Browne had taken his followers into exile in Middelburg, and Penry urged the London Separatists to emigrate in order to escape persecution, so after his death they went to Amsterdam."]}, {"page": "History of Wales", "response": ["Bishop Richard Davies and dissident Protestant cleric John Penry introduced Calvinist theology to Wales. Calvinism developed through the Puritan period, following the restoration of the monarchy under Charles II, and within Wales' Methodist movement. However, few copies of Calvin's works were available before the mid-19th century.D. Densil Morgan, \"Calvinism in Wales: c.1590–1909,\" Welsh Journal of Religious History (2009), Vol. 4, p22-36  In 1567, Davies, William Salesbury, and Thomas Huet completed the first modern translation of the New Testament and the first translation of the Book of Common Prayer (). In 1588, William Morgan completed a translation of the whole Bible. These translations were as important to the survival of the Welsh language and had the effect of conferring status on Welsh as a liturgical language and vehicle for worship. This had a significant role in its continued use as a means of everyday communication and as a literary language down to the present day despite the pressure of English."]}, {"page": "Richard Bancroft", "response": ["In the following year Bancroft was made a prebendary of St Paul's; he had been canon of Westminster since 1587. He was chaplain successively to Lord Chancellor Hatton and Archbishop Whitgift. In June 1597, he was consecrated Bishop of London; and from this time, in consequence of the age and incapacity for business of Archbishop Whitgift, he was virtually invested with the power of primate, and had the sole management of ecclesiastical affairs. Among the more noteworthy cases which fell under his direction were the proceedings against \"Martin Marprelate\", Thomas Cartwright and his friends, and John Penry, whose \"seditious writings\" he caused to be intercepted and given up to the Lord Keeper."]}, {"page": "John Whitgift", "response": ["In the controversy between Walter Travers and Richard Hooker, he prohibited the former from preaching, and he presented the latter with the rectory of Boscombe in Wiltshire, to help him complete his Ecclesiastical Polity, a work that in the end did not represent Whitgift's theological or ecclesiastical standpoints. In 1587, he had Welsh preacher John Penry brought before the High Commission, and imprisoned; Whitgift signed Penry's death warrant six years later."]}, {"page": "1593 in literature", "response": ["*May 29 – The Welsh-born Protestant John Penry is executed for involvement in the Marprelate Controversy."]}, {"page": "1589 in literature", "response": ["*July – John Penry's printing press produces two tracts purporting to be by sons of Martin Marprelate, but probably by Martin himself: Theses Martinianae by \"Martin Junior\", and The Just Censure of Martin Junior by \"Martin Senior\"."]}, {"page": "1587 in literature", "response": ["*John Penry – The Æquity of an Humble Supplication"]}, {"page": "1559 in literature", "response": ["**John Penry, Protestant pamphleteer and martyr (died 1593)"]}, {"page": "Congregational church", "response": ["Short lifespans were typical of Separatist churches (also known as Brownist congregations). These were small congregations who met in secret and faced persecution. They were often forced to go into exile in Holland and tended to disintegrate quickly. Notable Separatists who faced exile or death included Henry Barrow (c. 1550–1593), John Greenwood  (died 1593), John Penry (1559–1593), Francis Johnson (1563–1618), and Henry Ainsworth (1571–1622)."]}, {"page": "Martin Marprelate", "response": ["The true identity of \"Martin\" was for a long time the subject of speculation. For many years, the main candidate was John Penry, a Welsh preacher and author of several impassioned polemics against the state of the church. Renaissance historian John Dover Wilson posited, in his 1912 book Martin Marprelate and Shakespeare's Fluellen,Dover Wilson, John, Martin Marprelate and Shakespeare's Fluellen, Alexander Moring Limited, 1912. the Welsh soldier Roger Williams was the author of the first three tracts signed \"Martin Prelate\", with Penry authoring the subsequent tracts signed \"Martin Junior\" and the Warwickshire squire and Member of Parliament Job Throckmorton the author of those signed \"Martin Senior\". In 1981 Leland Carlson argued for the authorship of Job Throckmorton.Carlson, Leland H., Martin Marprelate, Gentleman: Master Job Throckmorton Laid Open In His Colours (San Marino: Huntington Library, 1981) Kathryn M. Longley and Patrick Collinson suggested George Carleton. Henry M. Dexter argued for Henry Barrow."]}, {"page": "Old Kent Road", "response": ["St Thomas-a-Watering became a place of execution for criminals whose bodies were left hanging from the gibbets  on the principal route from the southeast to London. On 8 July 1539, Griffith Clerke, Vicar of Wandsworth was hanged and quartered here along with his chaplain and two others, for not acknowledging the royal supremacy of Henry VIII.  The Welsh Protestant martyr John Penry was also executed here on 6 April 1593; a small side street nearby is named after him. The Catholic  martyrs John Jones and John Rigby were executed in 1598 and 1600 respectively."]}, {"page": "Ratcliff", "response": ["From the late sixteenth century Ratcliffe and surrounding areas were notable areas for non-conformist Christianity. John Penry preached in the area in 1592/3, until he was spotted by the local vicar at Ratcliffe and subsequently hanged. By 1669 around 200 Presbyterians were worshipping at a warehouse at Ratcliffe Cross and there was a purpose built Quaker meeting house in Schoolhouse Lane, which was demolished by soldiers in 1670.http://www.british-history.ac.uk/report.aspx?compid=22739 accessed 21 April 2008"]}, {"page": "Llangammarch Wells", "response": ["The community includes Tirabad. Near Llangammarch Wells lies the small village of Cefn Gorwydd, birthplace of John Penry (1563 – 29 May 1593) the martyr, who was born at Cefn Brith farm. The farm is signposted but the old farmhouse is not the original building."]}, {"page": "Llangammarch (parish)", "response": ["John Penry, Wales's most famous Protestant martyr, was born at Cefn Brith, a farm near Llangammarch,  which is traditionally recognised as his birthplace."]}, {"page": "Marprelate Controversy", "response": ["Martin's tracts are characterised by mockery of Anglican dignitaries and satire against the corruptions of the Church of England. The style is 'a heady mixture of nonsense, satire, protest, irony and gossip', combined with pungent wit, 'full of the language of the street'. While Martin maintained puritan doctrines as a whole, the special point of his attack was the episcopacy. The pamphlets were printed at a secret press established by John Penry, a Welsh puritan, with the help of the printer Robert Waldegrave, about midsummer 1588, for the issue of puritan literature was forbidden by the authorities.", "Shortly afterward the press was moved to the Whitefriars, Coventry, the home of Knightley's great-nephew,John Hales' grandmother was Anne Fermor, and Sir Richard Knightley's first wife was Anne's sister, Mary Fermor; at his subsequent trial Hales protested that 'He had great reason, as he thought, to gratify Sir Richard Knightley in anything, to whom he owed much reverence, as he that had married his aunt'; . John Hales (d. 1 January 1607/8), and his wife, Frideswide, the daughter of William Faunt.. In late January 1589, Martin's Certain Mineral and Metaphysical School-points was printed at the Whitefriars, followed in March by John Penry's View of Some Part of Such Public Wants, and Martin's Hay Any Work For Cooper, a reply to the Admonition. Hales, the son of Christopher Hales and Mary Lucy, daughter of William Lucy, esquire, of Charlecote, was the nephew and heir of John Hales (d.1572)."]}, {"page": "National Library of Wales", "response": ["* John Penry's pamphlet of 1588, An exhortation unto the governours."]}, {"page": "List of Protestant martyrs of the English Reformation", "response": ["| data-sort-value=Penry|John Penry", "| John Penry (1563 - 1593), the Welsh Puritan preacher and author. Briefly imprisoned in 1587 for his book the Aequity of an Humble Supplication, in which he called for more preaching in the Welsh language. Returned to London from exile in Scotland in September 1592, and allied himself with the Separatist followers of Henry Barrow. Arrested on 22 March 1592/3. Indicted under the Act of Uniformity (1 Eliz. cap. 2). Executed by hanging at S. Thomas a Watering on 29 May 1593. The first signature on his death warrant was that of John Whitgift, Elizabeth I's Archbishop of Canterbury. Sources : PENRY, JOHN, by Robert Tudur Jones, Dictionary of Welsh Biography, https://biography.wales/article/s-PENR-JOH-1563 accessed 25 May 2016; 'Crefydd, Cenedlgarwch a'r Wladwriaeth: John Penry (1563–1593) a Phiwritaniaeth Gynnar', John Gwynfor Jones (University of Wales Press, 2014); BBC News article on the call by Welsh Independents for an apology from the Anglican Church: http://news.bbc.co.uk/go/pr/fr/-/1/hi/wales/south_west/7402541.stm Published: 2008/05/15 14:01:01. Retrieved 25 May 2016"]}, {"page": "St Alban Hall, Oxford", "response": ["*John Penry (1563–1593), Welsh Protestant martyr"]}, {"page": "Marlovian theory of Shakespeare authorship", "response": ["He was also in deep trouble at the time. \"But counterfeiting, treason, homosexuality, and blasphemy were all capital offences: the only question was whether hanging, beheading or being burnt at the stake was the most appropriate punishment.\" Accusations of his having persuaded others to atheism were coming to the Privy Council thick and fast and, whether true or not, he was certainly suspected of having written an atheistic book which was being used for subversive purposes., . For such crimes, trial and execution would have been almost guaranteed. Within the past two months, at least three people, Henry Barrow, John Greenwood and John Penry, had gone to the scaffold for offences no worse than this. Marlovians therefore contend that Marlowe would have had a strong motive for either being complicit in or agreeing to some means of escape.", "If a death is to be faked, however, a substitute body has to be found, and it was David A. More who first identified for Marlovians a far more likely \"victim\" than had been suggested earlier.See More's Drunken Sailor or Imprisoned Writer? On the evening before their 10 a.m. meeting at Deptford, at a most unusual time for a hanging, John Penry, about a year older than Marlowe, was hanged (for writing subversive literature) just two miles from Deptford, and there is no record of what happened to the body. Also of possible relevance is that the same William Danby would have been responsible for authorizing exactly what was to happen to Penry's corpse. Those who reject the theory claim that there would have been far too many obvious signs that the corpse had been hanged for it to have been used in this way, although Marlovians say that Danby, being solely in charge, would have been able quite easily to ensure that such evidence remained hidden from the jury."]}, {"page": "List of Puritans", "response": ["*John Penry"]}, {"page": "Religion in Wales", "response": ["Bishop Richard Davies and dissident Protestant cleric John Penry introduced Calvinist theology to Wales. They used the model of the Synod of Dort of 1618–1619. Calvinism developed through the Puritan period, following the restoration of the monarchy under Charles II, and within Wales' Methodist movement. However, few copies of Calvin's writings were available in Welsh before the mid 19th century.D. Densil Morgan, \"Calvinism in Wales: c.1590-1909,\" Welsh Journal of Religious History (2009), Vol. 4, p22-36"]}, {"page": "King's Bench Prison", "response": ["*John Penry (martyr, briefly incarcerated before his execution in 1593)"]}, {"page": "Poultry Compter", "response": ["* John Penry (executed 25 May 1593); Welsh martyrDead Sailor or Imprisoned Writer? "]}, {"page": "Haseley", "response": ["Haseley's fifteen minutes of fame came in 1588. At the time a non-conformist publication was enraging the bishops of the Church of England and was the talk of England. To avoid detection the printing press had to move around periodically and it came to the village that year, as one of the writers was the nephew of the lord of the manor. However it was discovered there and the head of the movement, John Penry, was later hanged."]}, {"page": "1887 in Wales", "response": ["*Crown – John Cadfan Davies, \"John Penry\""]}, {"page": "16th century in Wales", "response": ["*John Penry -  ", "*29 May - John Penry, Protestant martyr, 33"]}, {"page": "1590s in England", "response": ["** 29 May – execution of the Welsh Protestant John Penry suspected of involvement with the Marprelate Controversy."]}, {"page": "Richard Knightley", "response": ["He was a conspicuous member of the Puritan faction in Parliament, and in November 1588 was involved in the printing of the Marprelate tracts. In the late spring of 1588 Elizabeth Hussey allowed the printer Robert Waldegrave and the Puritan preacher and pamphleteer John Penry to set up a secret press at her country home at East Molesey, Surrey, across the Thames from Hampton Court Palace. The first tract to be printed there was a work by John Udall, the Demonstration of Discipline. In late 1588 and early 1589, Waldegrave embarked on an even more controversial enterprise, printing the first four tracts written against the ecclesiastical authorities by an unknown satirist using the pseudonym Martin Marprelate. The first of the Marprelate tracts, Martin's Epistle was printed on the secret press in October 1588. It enjoyed immense popularity, and the ecclesiastical authorities instigated a hue and cry after Martin. In November the press was moved from East Molesey to Sir Richard Knightley's house at Fawsley, where Martin's second tract, The Epitome, was printed. Knightley may even have met the expense of the printing. Shortly thereafter the secret press was moved to the Whitefriars, Coventry, the home of Knightley's great-nephew, John Hales,John Hales' grandmother was Anne Fermor, and Sir Richard Knightley's first wife was Anne's sister, Mary Fermor; . where Certaine Minerall and Metaphysicall Schoolpoints and Hay Any Worke for Cooper were printed, the former in early January and the latter in late March 1589. Waldegrave then refused to print any further tracts, citing the Puritan ministers' disapproval of Martin Marprelate's course of action.Knightley, Sir Richard (1533-1615), of Fawsley, Northamptonshire, History of Parliament Retrieved 10 December 2013. The secret press was then moved to Wolston Priory in Warwickshire, the home of Roger Wigston."]}, {"page": "List of members of Peterhouse, Cambridge", "response": ["|John Penry"]}, {"page": "John Waddington (minister)", "response": ["In 1854 he published John Penry: the Pilgrim Martyr (London), and in 1861 a more general treatise on Congregational Martyrs (London) (intended to form part of a series of Historical Papers but these were not continued). The work reached a second edition in the following year."]}, {"page": "Job Throckmorton", "response": ["Job Throckmorton (Throkmorton) (1545–1601) was a puritan English religious pamphleteer and Member of Parliament during the reign of Queen Elizabeth I. Possibly with John Penry and John Udall, he authored the Martin Marprelate anonymous anti-clerical satires; scholarly consensus now makes him the main author.Dorothy Auchter, Dictionary of Literary and Dramatic Censorship in Tudor and Stuart England (2001), p. 231.", "In 1587 Throckmorton and Edward Dunn Lee presented to Parliament a petition of John Penry, on preaching in Wales.Dennis Taylor, David N. Beauregard (editors), Shakespeare and the Culture of Christianity in Early Modern England (2003), p. 168. It caused Penry to be arrested by John Whitgift."]}, {"page": "Robert Some", "response": ["In July 1599 he look part in a disputation as to Christ's descent into hell, and opposed John Overall, the regius professor of divinity, on this and other matters. He also interposed in the Marprelate controversy.With A Godly Treatise containing and deciding certaine questions moved of late in London and other places, touching the Ministerie, Sacraments, and Church, London, 1588; there was a second edition the same year. He was answered by John Penry;M. Some laid open in his coulere: wherein the indifferent Reader may easily see howe wretchedly and loosely he hath handled the cause against M. Penri. and Some rejoined.A Defence of such Points in R. Some's last Treatise as Mr. Penry hath dealt against, London, 1588."]}, {"page": "History of the Puritans under Elizabeth I", "response": ["In 1588–89, a series of virulently anti-episcopal tracts were published under the pseudonym of Martin Marprelate.  These Marprelate tracts, likely published by Job Throckmorton and Welsh publisher John Penry, denounced the bishops as agents of Antichrist, the strongest possible denunciation for Christians.  The Marprelate tracts called the bishops \"our vile servile dunghill ministers of damnation, that viperous generation, those scorpions.\"", "*Job Throckmorton (1545-1601) Puritan activist, pamphleteer, and Member of Parliament. He is recognized by most to be the author of the Martin Mar-prelate tracts (anti-clerical satires), along with John Penry and John Udall."]}, {"page": "John Udall (Puritan)", "response": ["He matriculated as a sizar of Christ's College, Cambridge, on 15 March 1578, but soon afterwards migrated to Trinity College. There he graduated B.A. in 1581, and M.A. in 1584. John Penry was an undergraduate friend, and Udall also gained a working knowledge of Hebrew.", "*Donald J. McGinn (1966), John Penry and the Marprelate Controversy"]}, {"page": "Richard Greenham", "response": ["Samuel Clarke says Greenham died about 1591, in about his sixtieth year, while Fuller says his death was unrecorded, because he died of the plague which raged in 1592. It is mentioned by Waddington that on 2 April 1593 Greenham visited John Penry in the Poultry Compter. Henry Holland implies that he survived the affair of Lopez, February–June 1594."]}, {"page": "Robert Waldegrave", "response": ["Waldegrave hid the salvaged type at the house of Mistress Crane in the parish of St Mary Aldermanbury. Born Elizabeth Hussey, Mistress Crane was the widow of Queen Elizabeth's Cofferer of the HouseholdOfficers of the Green Cloth: Cofferer and Master of the Household,Officers of the Green Cloth: Masters Anthony Crane (d.1583), had reformist sympathies, and in the late spring of 1588 she allowed Waldegrave and John Penry to set up a secret press at her country home at East Molesey, Surrey, across the Thames from Hampton Court Palace. The first tract to be printed there was another of Udall's works, the Demonstration of Discipline. In late 1588 and early 1589, Waldegrave embarked on an even more controversial enterprise, printing the first four tracts written against the ecclesiastical authorities by an unknown satirist using the pseudonym Martin Marprelate. The first of the Marprelate tracts, Martin's Epistle was printed on the secret press in October 1588. The tract enjoyed immense popularity, and the ecclesiastical authorities instigated a hue and cry after Martin. In November the press was moved from East Molesey to Sir Richard Knightley's house at Fawsley in Northamptonshire, where Martin's second tract, The Epitome, was printed. Shortly thereafter the secret press was moved to the Whitefriars, Coventry, the home of Knightley's great-nephew, John Hales, where Certaine Minerall and Metaphysicall Schoolpoints and Hay Any Worke for Cooper were printed, the former in early January and the latter in late March 1589. Waldegrave then refused to print any further tracts, citing the Puritan ministers' disapproval of Martin Marprelate's course of action. Waldegrave had a patron and protector in James VI of Scotland who asked his diplomat Sir Robert Melville of Murdocairny to intercede with Elizabeth for him.William Fraser, The Melvilles: Melville & Leven Correspondence, vol. 2 (Edinburgh, 1890), pp. 10-11.", "Waldegrave's movements in the months immediately after he left the secret press are uncertain; John Penry claimed that he was printing in La Rochelle in May 1589. However, by early 1590 he was in Edinburgh, where by March that year he was granted a licence to print. On 9 October he was appointed King's Printer by James VI. In December the English ambassador Robert Bowes noted that James VI had \"planted Waldegrave to be his printer\", and he was a near and unwelcome neighbour of Bowes, who was usually lodged with Janet Fockart.Calendar State Papers Scotland: 1589-1593, vol. 10 (Edinburgh, 1936), p. 435."]}]}}