{"wiki_id": "http://www.wikidata.org/entity/Q438832", "itemLabel": "Michael Jones", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Michael_Jones_(Welsh-French_musician)", "wikipedia_page": {"main": "Michael Jones (born 28 January 1952) is a Welsh singer, guitarist, and songwriter who lives in France. He has made several hit albums and toured as trio Fredericks Goldman Jones (formed by Michael Jones, French singer-songwriter Jean-Jacques Goldman and American singer Carole Fredericks) and collaborated on a number of songs with Goldman.", "link_mentions": [{"page": "List of singer-songwriters", "response": ["*Michael Jones"]}, {"page": "Jean-Jacques Goldman", "response": ["Marc Lumbroso saw his potential and managed to sign him a five-album contract with Epic Records. That same year he released his first album, which he wanted to call Démodé (\"old-fashioned\", \"out of trend\"), but the label refused so it was left untitled (although \"Démodé\" is now its unofficial title). \"Il suffira d'un signe\" was his first significant success. In 1982, he released a second album with no title – this time the intended title was Minoritaire, which was also refused as it was deemed un-commercial (and has likewise become its unofficial title). It featured several hits: \"Quand la musique est bonne\", \"Comme toi\" (inspired by a picture of a young Jewish girl who died in a concentration camp although the heartfelt lyrics never explicitly mention this specific historical context), \"Au bout de mes rêves\", and was his breakthrough album, with about 900.000 units sold. His third album in 1984, the first with an official title, Positif (chosen as an ironic response to the refusal of the intended \"negative\" titles of his first two), contained new hits such as \"Encore un matin\" and \"Envole-moi\", and performed even better with about 1.000.000 units sold. His fourth album, Non homologué (\"not approved\", which continued his trend of ironically self-depreciative titles) garnered the hit songs \"Je marche seul\", \"Je te donne\" (a bilingual rock duet with Michael Jones with Jones singing the English verses and Goldman the French ones) and \"Pas toi\". He recorded a double album in 1987, Entre gris clair et gris foncé (\"Between light grey and dark grey\"), which launched a string of hits — \"Elle a fait un bébé toute seule\", \"Puisque tu pars\", \"Là-bas\" (a duet with Sirima), \"Il changeait la vie\" — and was a major success, with more than 2 million units sold.", "From 1990 to 1995, he went on to perform in a trio called Fredericks / Goldman / Jones with Carole Fredericks (an American singer and chorist who had settled in France in the 1970s, the sister of Taj Mahal) and Michael Jones (a Welsh guitarist and singer who had settled in his mother's native France, whom Goldman knew from Taï Phong—actually he joined the band when Goldman decided to stop touring—and with whom he had a hit in 1985 with \"Je te donne\"). Together they recorded two studio albums, Fredericks / Goldman / Jones in 1990 and Rouge in 1993 (inspired by the fall of the Berlin Wall and the end of the USSR—the title song features the Red Army Choir), one live album, Du New Morning au Zénith, and released several successful singles, such as \"Nuit\", \"À nos actes manqués\", \"Né en 17 à Leidenstadt\" (another song about war and how it affects people's lives), \"Juste après\" (inspired by a scene in a TV documentary about the work of Médecins Sans Frontières in Congo showing a missionary sister's harrowing struggle to reanimate a newborn) and \"Tu manques\". Several of these songs were later re-recorded in English, but did not find much success in England or the United States."]}, {"page": "1 fille & 4 types", "response": ["The second television special for France, Céline! was hosted by Flavie Flament and included the full performances of the following songs: \"Tout l'or des hommes\" (with \"4 Guys\": Jean-Jacques Goldman, Erick Benzi, Jacques Veneruso and Gildas Arzel), \"On ne change pas\", \"Toi et moi\" (with Charles Aznavour), \"Et je t'aime encore\", \"Pour que tu m'aimes encore\" (duet with Florent Pagny), \"Le vol d'un ange\", \"Apprends-moi\" (with \"4 Guys\"), \"Le loup, la biche et le chevalier (une chanson douce)\" (with Henri Salvador), \"Sous le vent\" (with Garou), \"S'il suffisait d'aimer\" (with Patrick Fiori, Florent Pagny and Roch Voisine) and \"Valse adieu\" (with \"4 Guys\"). The show also included solo performances by the special guests: Roch Voisine, Garou, Florent Pagny, Patrick Fiori, Michael Jones, Jean-Jacques Goldman, Charles Aznavour, Gérard Darmon, Martin Fontaine, Henry Salvador and Ricky Martin. The television special was broadcast on 18 November 2003 on TF1 and became the most watched program of the French prime-time by attracting 6,131,800 viewers and getting the 31,1% share of the audience."]}, {"page": "Non homologué", "response": ["Non homologué () is a 1985 album recorded by French artist Jean-Jacques Goldman. It was his fourth studio album and was released in September 1985. Goldman composed all the songs except \"Je te donne\", written in collaboration with Michael Jones. The album was recorded at Studio Gang by Jean-Pierre Janiau, assisted by Olivier do Espirito Santo. It was released by JRG/NEF and produced by Marc Lumbroso.", "# \"Je te donne\" (duet with Michael Jones) — 4:24", "# \"Je te donne\" (duet with Michael Jones) — 4:25", "* Michael Jones, Guy Delacroix, J. L. Delest, P. Gaillard, Jean-Jacques Goldman, Robert Goldman, and Jean-Pierre Janiaud, vocals", "* Jean-Jacques Goldman, Michael Jones, and Non Krief, electric guitar"]}, {"page": "Chansons pour les pieds", "response": ["* Michael Jones – choeurs, guitar"]}, {"page": "Narada Productions", "response": ["In 1979, John Morey started a mail-order business to sell new-age music. This led to the creation of Narada in Milwaukee in 1983, and the roster eventually included David Arkenstone, Jesse Cook, Michael Gettel, Michael Jones, David Lanz, Oscar Lopez, and Billy McLaughlin. Virgin bought Narada in 1997, along with Higher Octave and Back Porch, and directly signed Yanni and other New Age/Smooth Jazz acts.", "* Michael Jones"]}, {"page": "Carole Fredericks", "response": ["Between 1990 and 1996 she was in the trio Fredericks Goldman Jones alongside singer-songwriter Jean-Jacques Goldman and Welsh–French guitarist Michael Jones.", "Jean-Jacques invited Carole to join him and second guitarist, Michael Jones, on stage. Almost immediately, Carole was catapulted into prominence with the release of their debut album Fredericks Goldman Jones. The album went Diamond, selling 600,000 copies in the first 6 months, 1 million copies in the first year.  Fredericks Goldman Jones toured extensively throughout Europe, South East Asia, Japan, Africa and the French-speaking world. It also resulted in one of the best known songs by the trio titled \"À nos actes manqués\".", "For their next album, Fredericks Goldman Jones recorded a live performance at a Paris night club. The album featured the sweaty trio singing selections from their earlier albums. The result was - Fredericks Goldman Jones Du New Morning au Zénith. In a breakout performance, Carole took command of the stage supported by Becky Bell and Yvonne Jones, Jean-Jacques, Michael Jones and the entire band showcasing three R&B classics - Aretha Franklin's Think MySpace.com video, Knock on Wood , and Tobacco Road. The gritty club atmosphere, performance spontaneity and realism were captured on film then released as a music video. The album and subsequent DVD went Platinum.", "December 2–11, 1999 Carole headlined as a solo act in Paris at Saint-Germain-des-Prés Auditorium. She shared the stage with invited guests: Jean-Jacques Goldman, Faudel, Allan Théo, Bruno Pelletier, Michael Jones, Kani Curry of Poétic Lover and Nicole Amovin.", "* Fredericks Goldman Jones (1990, CBS) with Jean-Jacques Goldman and Michael Jones", "* Rouge (1993, Columbia) with Red Army Choir, Jean-Jacques Goldman and Michael Jones", "* Sur scène (1992, Columbia) with Jean-Jacques Goldman and Michael Jones", "* Du New Morning au Zénith (1995, Columbia) with Jean-Jacques Goldman and Michael Jones", "* Pluriel 90/96 (1996, Columbia) with Jean-Jacques Goldman and Michael Jones", "In his 2002 tour, \"Un Tour Ensemble\", Goldman paid tribute to his fallen friend, Carole Fredericks. During the concert, Michael Jones and Goldman sang Juste Après, a song from the Rouge album made famous by the trio. Midway through the song a screen was lowered and film footage of Carole was shown as her voice is heard singing with them.  Dailymotion video", "Celine Dion, Carole Fredericks, Jean-Jacques Goldman, Michael Jones and company perform Eddie Floyd's Knock on Wood for Taratata TV5 studio and television audiences.", "Carole Fredericks, Jean-Jacques Goldman, Michael Jones, Yvonne Jones, Becky Bell perform Aretha Franklin's Think live for New Morning audience. Recorded for Fredericks Goldman Jones album, Du New Morning au Zénith."]}, {"page": "XIII Bis Records", "response": ["* Michael Jones"]}, {"page": "1993 in Wales", "response": ["* Michael Jones – Rouge"]}, {"page": "Je te donne (song)", "response": ["\"Je te donne\" is a bilingual pop song, recorded in English and French. It was performed by Jean-Jacques Goldman and Michael Jones and was released as a single in late 1985. It reached number-one for eight weeks on the French Singles Chart, becoming one of the best-selling singles of the 1980s in France. The song has been covered by Worlds Apart in 1996 and Ivyrise in 2013 and achieved success in many countries where it charted.", "==Jean-Jacques Goldman and Michael Jones version==", "|French SNEP Singles Chart\"Je te donne\", by JJ Goldman and Michael Jones, in various Singles Chart Lescharts.com (Retrieved April 12, 2008)", "Category:Michael Jones (Welsh-French musician) songs"]}, {"page": "Michael Jones", "response": ["*Michael Jones (Canadian musician) (born 1942), new-age pianist", "*Michael Jones (film director) (born 1944), Canadian screenwriter", "*Michael Jones (Welsh-French musician) (born 1952)", "*Michael Jones (actor) (born 1987), American voice actor", "*Michael Jones (1959–2016), birth name of American musician Kashif", "*Michael Jones (born 1980), birth name of American rapper Wax", "*Michael Jones (English footballer) (born 1987), English footballer", "*Michael Jones (New Zealand footballer)", "*Michael Jones (rugby union) (born 1965), New Zealand rugby union player and coach", "*Michael Jones (boxer) (born 1974), English boxer of the 1990s and 2000s", "*Michael Jones (swimmer) (born 1994), British Paralympic swimmer", "*Michael Jones (cricketer) (born 1998), Scottish cricketer", "*Michael Jones (soldier) (died 1649), colonel during the Irish Confederate War", "*Michael Jones (public administrator) (1895–1978), New Zealand interpreter and broadcaster", "*Michael Jones (historian) (born 1940), British historian", "*Michael Jones, Lord Jones (1948–2016), Scottish judge", "*Michael Jones (activist) (born 1964), American psychology writer and practitioner", "*Michael Jones (scientist), computer vision researcher", "*Michael Jones (entrepreneur) (born 1975), American entrepreneur and investor", "*Michael Jones (priest) (died 1719), Anglican priest in Ireland "]}, {"page": "List of number-one singles of 1985 (France)", "response": ["|rowspan=\"5\" align=\"center\"|Jean-Jacques Goldman and Michael Jones"]}, {"page": "List of number-one singles of 1986 (France)", "response": ["| rowspan=\"3\" |Jean-Jacques Goldman and Michael Jones"]}, {"page": "À nos actes manqués", "response": ["\"À nos actes manqués\" is a 1991 song recorded by the French trio Jean-Jacques Goldman, Carole Fredericks and Michael Jones (the song was credited to Fredericks Goldman Jones). Released as the second single from their eponymous album, the song was one of the summer hits in France and was the trio's most successful single in terms of ranks on the chart. In 2011, M. Pokora covered the song on his album Mise à Jour and released it as a single, which achieved some success in French-speaking countries. The trio also released an English version, To The Deeds We Missed.", "The song was written and produced by Jean-Jacques Goldman. It was described by Elia Habib, an expert of French charts, as having \"a lively melody with African accents, [it] celebrates in its lyrics the small failures of the everyday life with a lot of tenderness and humor\". The refrain is performed by Carole Fredericks, while the verses are sung in turn by Jean-Jacques Goldman and Michael Jones.", "Category:Michael Jones (Welsh-French musician) songs"]}, {"page": "Né en 17 à Leidenstadt", "response": ["\"Né en 17 à Leidenstadt\" (English: \"Born in '17 in Leidenstadt\") is a 1990 song written by Jean-Jacques Goldman for his group Fredericks Goldman Jones. It was the third single from their debut album, Fredericks Goldman Jones, and was released in July 1991. It has been performed twice by Goldman alone, and also by Goldman with Carole Fredericks and Michael Jones, each with a specific verse to sing. An English version exists in which Fredericks and Jones sing in their native language.", "Category:Michael Jones (Welsh-French musician) songs"]}, {"page": "Nuit (song)", "response": ["\"Nuit\" is a song recorded by the French trio Jean-Jacques Goldman, Carole Fredericks and Michael Jones. It was the first single from their debut album, Fredericks Goldman Jones, on which the song features as the fifth track. It achieved success in terms of sales in France.", "Category:Michael Jones (Welsh-French musician) songs"]}, {"page": "Ivyrise", "response": ["Ivyrise were the sole British act on the album with Ben Falinski interpreting the bilingual French / English song co-written by Jean-Jacques Goldman and Michael Jones. The track has charted in SNEP, the official French Singles Chart reaching #1. A music videoMusic video for \"Je te donne\" by Leslie and Ivyrise was also prepared for the single which has received in excess of 33 million views on YouTube as of February 2020."]}, {"page": "No Ordinary World", "response": ["#\"On My Way Home\" – 4:13 (Jean-Jacques Goldman, Michael Jones)", "* Michael Jones – backing vocals (12)"]}, {"page": "Lemon Incest", "response": ["On the French Singles Chart, the single went straight to number seven on October 26, 1985. It climbed to number six for two weeks, then reached number two and stayed there for four consecutive weeks, being unable to dislodge the two number-one hits Century's \"Lover Why\" and Jean-Jacques Goldman and Michael Jones' \"Je te donne\". It then began to fall on the chart. The song totalled 10 weeks in the top 10 and 18 weeks in the top 50."]}, {"page": "RéCréation", "response": ["# \"J'oublierai ton nom\" (Jean-Jacques Goldman, Michael Jones) (duet with Ginie Line) — 4:20"]}, {"page": "Erick Benzi", "response": ["In 2007, Benzi became a member of group El Club with Gildas Arzel, Christian Seguret (fr) and Michael Jones."]}, {"page": "Tu manques", "response": ["\"Tu manques\" is a 1990 song recorded by Carole Fredericks, Jean-Jacques Goldman and Michael Jones. It was the sixth and last single from the album Fredericks Goldman Jones on which it appears as the last track and was released in May 1992. Although the three singers are credited on the single cover, only Goldman performed it. It was a top 15 hit in France.", "Category:Michael Jones (Welsh-French musician) songs"]}, {"page": "Fredericks Goldman Jones (album)", "response": ["All tracks performed by Carole Fredericks, Jean-Jacques Goldman and Michael Jones, except \"Tu manques\" (Goldman only).", "* Michael Jones – guitar, electric guitar, choir, chorus, co-arranger"]}, {"page": "Entre gris clair et gris foncé", "response": ["* Michael Jones – chorus, guitars"]}, {"page": "Liane Edwards", "response": ["Liane Edwards has collaborated in the studio or on stage with such artists as : Screaming Jay Hawkins, Zucchero, Albert Lee, Michael Jones, Bijou (SVP), Jett Williams, Ticky Holgado, Soldat Louis, Patrick Verbeke, Michelle Malone, Big Al Downing, Christian Seguret (fr), Brian Wooten, Janet Martin, Annabel, Rick Trevino, Heather Myles, Sarah Jory, Johnny Gallagher."]}, {"page": "Claude Le Péron", "response": ["It was during that year, 1983, that he crossed paths with Jean-Jacques Goldman, during the \"Champs Élysées\" show.Patrick Amine Jean-Jacques Goldman: un monde à part 2007 p.  15 \"Et à ce moment-là, Jean-Jacques rencontre pendant une émission de Drucker, Claude Le Péron. Il me donne le numéro de Claude, je l'appelle et lui demande s'il connaît un autre pianiste car nous avions besoin de deux claviers.\" Following the broadcast, Jean-Jacques Goldman decided to go on tour and needed a bassist who could sing. This led him to add Le Péron to his band.Rencontre avec Claude Le Peron He and other Goldman band members worked with Michael Jones, drummer Jean-François Gautier and the Rhinos.Jean-François Gautier (interview with drummer with the Rhinos)  \"J'ai choisi de venir avec Michael Jones, c'est un chanteur très sympa et connu du grand public grâce à sa présence aux cotés de Jean-Jacques Goldman. Avec les autres musiciens qui seront présents (Jacky Mascarel, Claude le Péron), cela sera la première fois depuis 20 ans que nous rejouerons tous ensemble. ..J'ai rencontré Claude Le Péron en 1978. À l'époque, j'étais tout jeune musicien et Claude était le bassiste d'Alain Souchon.\"", "Le Péron toured with Goldman and collaborated on many of his albums from that time until Goldman's last tour in 2002. Since that time, he has toured with Michael Jones and in groups such as Les Rapalas and After The Rain.", "=== with Michael Jones ==="]}, {"page": "Michael Jones (Welsh musician)", "response": ["#REDIRECT Michael Jones (Welsh-French musician)"]}, {"page": "Fredericks Goldman Jones", "response": ["Fredericks Goldman Jones was the name of a famous French musical trio made up of Jean-Jacques Goldman, Carole Fredericks and Michael Jones. Established in 1990, it remained active until 1996. After the amicable separation of the trio and the continuation of each in their solo musical careers, the three remained very close friends and continued to perform on special concerts together.", "In the albums released by the trio, and despite the prominence of Jean-Jacques Goldman, Carole Fredericks and Michael Jones were involved as main singers and not as guitarist in case of Jones or backing vocalist in case of Fredericks as in earlier collaborations with Goldman. For example, \"Il part\" has the sole vocals of Carole Fredericks; Michael Jones, took part prominently in duo renditions for \"Frères\", most of \"À nos actes manqués\", whereas others are sung by all members of the trio like \"Vivre cent vies\", \"Juste après\", \"Né en 17 à Leidenstadt\", \"Je l'aime aussi\". Jean-Jacques Goldman due to his prominence as singer-songwriter sang solo in \"Fermer les yeux\" aided by a Bulgarian choir, or \"Tu manques\".", "Most of the composition was to Jean-Jacques Goldman with the exception of a couple of songs with English lyrics that were co-written by the Welsh-born Michael Jones like \"Nuit\" or the English-language version of \"À nos actes manqués\". The trio also sang songs from the solo repertoire Goldman's solos albums including \"Pas toi\", \"Il suffira d'un signe\". Inversely Goldman used many of the trio songs in his solo concerts later on.", "| Rouge with Red Army Choir, Carole Fredericks and Michael Jones"]}, {"page": "Envole-moi", "response": ["In yet another live album released in 1989 entitled Traces, part of the song was interpreted by Goldman as part of a medley and introduced after a \"guitar duel\" between Goldman and Michael Jones, one of his partners in the musical collaboration Fredericks Goldman Jones. The medley included in order of occurrence: \"Je marche seul\" / \"Quand la musique est bonne\" / \"Au bout de mes rêves\" / \"Il suffira d'un signe\" / \"Envole-moi\" / \"Encore un matin\".", "In 2003, Jean-Jacques Goldman recorded yet another version with Michael Jones on the Fredericks Goldman Jones live album of a concert at Zénith de Lille and entitled Un tour ensemble."]}, {"page": "Les Enfoirés (participants)", "response": ["| Michael Jones || ||bgcolor=\"#FF80B0\" | 1989|| bgcolor=\"#FF80DF\" | 1992||bgcolor=\"#EE80FF\" | 1993||bgcolor=\"#BF80FF\" | 1994|| ||bgcolor=\"#809FFF\" | 1996||bgcolor=\"#80D0FF\" | 1997|| ||bgcolor=\"#80FFCE\" | 1999|| ||bgcolor=\"#90FF80\" | 2001||bgcolor=\"#BFFF80\" | 2002||||bgcolor=\"#FFDF80\" | 2004||bgcolor=\"#FFAE80\" | 2005||bgcolor=\"#FF8080\" | 2006||bgcolor=\"#CC6666\" | 2007||bgcolor=\"#CC8B66\" | 2008||bgcolor=\"#BB7B66\" | 2009|| bgcolor=\"#BB9B66\" | 2010 || bgcolor=\"#BBBB66\" | 2011 || bgcolor=\"#BB8B46\" | 2012 || bgcolor=\"#BB9B26\" | 2013 || bgcolor=\"#CG4G23\" | 2014 || bgcolor=\"#A52A2A\" | 2015 || bgcolor=\"#DC143C\" | 2016 || bgcolor=\"#ff180d\" | 2017 || bgcolor=\"#cd5c5c\" | 2018 ||  bgcolor=\"#cc250dd\" | 2019 || bgcolor=\"#gg295ee\" | 2020 || bgcolor=\"#hh150ee\" | 2021 || 27", "| Michael Jones || 26 || 1989-1994, 1996-1997, 1999, 2001-2002, 2004-2020"]}, {"page": "Ycare", "response": ["Ycare was part of the charity song \"Les voix de l'enfant\" (meaning the voices of the child) with other artists that included Yannick Noah, Lorie, M. Pokora, Mélissa Nkonda, Hugues Aufray, Joyce Jonathan, Nicolas Peyrac, Sheryfa Luna, Grégoire, Jenifer, Merwan Rim, Gérard Lenorman, Emmanuel Moire, Dominique Magloire, Mani, Priscilla, Mickael Miro, Rose, Philippe Lavil, Marie Myriam, Mikelangelo Loconte, Melissa Mars, Faudel, Anggun, Stanisla, Julie Zenatti, Colonel Reyel, Annie Cordy, Yves Duteil, Pauline Delpech, Pierre Souchon, Judith, Quentin Mosimann, Lââm, Michael Jones, Cylia and Collectif Métissé. The release was funded through a campaign with My Major Company.  and was released in 2013."]}, {"page": "Il suffira d'un signe", "response": ["In 1992, Goldman reprised the song with Carole Fredericks and Michael Jones for the trio’s live album \"Sur Scène\". After that, this live version will be released at the end of 1992, where it will reach the 14th position at the Top 50."]}, {"page": "Gildas Arzel", "response": ["Gildas Arzel (born in Alsace on 21 January 1961) is a French singer, songwriter, composer and multi-instrumentalist musician including guitar. In addition to his solo career, he has been in musical formations like in duo Die Form with Erick Benzi with a mix of electro-industrial, gothic and techno sounds and later in musical formation Canada (formed with Erick Benzi, Jacques Veneruso and Gwenn Arzel) and since 2007 in El Club formed with Erick Benzi, Michael Jones and Christian Seguret (fr),.Rencontre avec Gildas Arzel - Entretien enregistré le 11 septembre 1999", "He started his solo career with an eclectic mix of Irish and Scottish folk, cajun music, blues, rock, Celtic music and ethnic music. He has written a great number of successful songs and notable collaborations with Céline Dion, Johnny Hallyday, Roch Voisine, Jean-Jacques Goldman, Carole Fredericks, Michael Jones, Maurane, Nanette Workman, Florent Pagny, Yannick Noah, France D'Amour, J.A.H.O. etc. Céline Dion's album 1 fille & 4 types included  Jean-Jacques Goldman, Erick Benzi, Jacques Veneruso and Gildas Arzel. Roch Voisine's famous Acadian tune hit \"Jean Johnny Jean\" is written by Arzel. Arzel has also composed a number of film soundtracks.", "(Gildas Arzel, Erick Benzi, Michael Jones and Christian Seguret)"]}, {"page": "Jean-Jacques Goldman discography", "response": ["! scope=\"row\" |\"Je te donne\" (with Michael Jones)"]}]}}