{"wiki_id": "http://www.wikidata.org/entity/Q486165", "itemLabel": "Anarawd ap Rhodri", "itemDescription": "King of Gwynedd between 878 and 916.", "wikipedia_url": "https://en.wikipedia.org/wiki/Anarawd_ap_Rhodri", "wikipedia_page": {"main": "Anarawd ap Rhodri (died c. 916) was a King of Gwynedd, referenced as \"King of the Britons\" in the Annales Cambriae (The Annals of Wales).\nAnarawd's father Rhodri the Great, by conquest and alleged inheritances, had become ruler of most of northern Wales. However, under Welsh law he was bound to divide his lands among his able-bodied children upon his death during a Mercian invasion around 878. Anarawd, the eldest, retained the principal estate at Aberffraw and the throne of Gwynedd. His brothers Cadell and Merfyn also received large estates, sometimes said to include the kingdoms of Ceredigion and Powys, respectively. For this, one of the Welsh Triads records the brothers as the \"Three Diademed Princes of the Isle of Britain\". (Rhodri's fourth son, Tudwal the Lame, was apparently too young or not deemed able-bodied enough for the initial division.)\nThe brothers are recorded as cooperating closely against the rulers of the remaining lesser kingdoms of Wales. Æthelred of Mercia invaded Gwynedd around 881 and the Welsh annals hailed his defeat at Cymryd in the Battle of the Conwy as Dial Rhodri: \"God's vengeance for Rhodri\". Tudwal was old enough to participate in this battle, but his disfigurement on the field saw him judged as unfit to rule.\nWhile Cadell then turned on his brother Merfyn, creating the realm that would later empower Hywel the Good, Anarawd made an alliance with the Danish king in York in an attempt to guard himself against further Mercian attacks. After that alliance proved unsatisfactory, he came to an agreement with Alfred the Great of Wessex, visiting Alfred at his court. He received honours and gifts from the Saxons, and King Alfred stood witness at his confirmation. According to Alfred's biographer Asser, Anarawd used his new Saxon allies to help in repelling a raid by his former Danish allies around 894 and to ravage Cadell's lands in Ceredigion and Ystrad Tywi the following year. Around 902, an attack on Anglesey by the Danes of Dublin under Ingimundr was repulsed. Anarawd died c. 916, succeeded by his eldest son Idwal the Bald.", "link_mentions": [{"page": "916", "response": ["* Anarawd ap Rhodri, king of Gwynedd"]}, {"page": "890", "response": ["* King Anarawd ap Rhodri of Gwynedd makes the first ceremonial visit to an English court (that of Alfred the Great)."]}, {"page": "Wales", "response": ["In 853, the Vikings raided Anglesey, but in 856, Rhodri Mawr defeated and killed their leader, Gorm.Davies (2008) p. 911 The Britons of Wales made peace with the Vikings and Anarawd ap Rhodri allied with the Norsemen occupying Northumbria to conquer the north. This alliance later broke down and Anarawd came to an agreement with Alfred, king of Wessex, with whom he fought against the west Welsh. According to Annales Cambriae, in 894, \"Anarawd came with the Angles and laid waste Ceredigion and Ystrad Tywi.\""]}, {"page": "List of rulers of Wales", "response": ["* Anarawd ap Rhodri (878–916) (establishes the Aberffraw dynasty, the senior branch of descendants from Rhodri Mawr)"]}, {"page": "Rhodri the Great", "response": ["*Anarawd ap Rhodri (died 913)"]}, {"page": "Amlaíb Cuarán", "response": ["Edmund reconquered the Five Burghs in 942, an event celebrated in verse by the Anglo-Saxon Chronicle. The Chronicle reports the baptism of Amlaíb, with King Edmund becoming his godfather.Swanton, Anglo-Saxon Chronicle, pp. 110–111, Ms. A, s.a. 942, Ms. D, s.a. 942 & 943. This need not mean that Amlaíb was not already a Christian, nor would such a baptism have permanently committed him to Christianity, as such baptisms were often political acts. Alfred the Great, for example, had sponsored the confirmation of Christian Welsh king Anarawd ap Rhodri.Asser's Life of King Alfred the Great. Thus Hudson, Viking Pirates, p. 34. Regarding the confirmation, Hudson describes it as \"... a politically motivated act ... a recognised means of sealing an alliance with a dominant individual ...\". Ragnall was baptised some time later according to the Anglo-Saxon Chronicle. Amlaíb was expelled from the kingship of York in 944. The Anglo-Saxon Chronicle reports that \"King Edmund conquered all Northumbria and caused to flee away two kings [or \"royally-born men\"], Olaf and Rægnald\".Swanton, Anglo-Saxon Chronicle, pp. 110–111, Ms. A, s.a. 944, Ms. E., s.a. 944. It is possible that rivalry between Amlaíb and Ragnall contributed to their fall.Downham, Viking Kings, pp. 46 & 111–112; Woolf, Pictland to Alba, p. 182. Æthelweard's history reports that Amlaíb was deposed by a coup led by Wulfstan, Archbishop of York, and an unnamed Mercian ealdorman.Hudson, Viking Pirates, p. 35; Woolf, Pictland to Alba, p. 182, suggests that the unnamed Mercian leader was Æthelstan Half-King."]}, {"page": "List of battles 301–1300", "response": ["| rowspan=\"3\" |881 || Battle of the Conwy ||  || Anarawd ap Rhodri defeats the Mercians under Æthelred, Lord of the Mercians. Known in Welsh as Dial Rhodri: the Avenging of Rhodri."]}, {"page": "Kingdom of Gwynedd", "response": ["When Rhodri died in 878 the relative unity of Wales ended and it was once again divided into its component parts each ruled by one of his sons. Rhodri's eldest son Anarawd ap Rhodri inherited Gwynedd and would firmly establish the princely House of Aberffraw that would come to rule Gwynedd with but a few interruptions until 1283."]}, {"page": "Kingdom of Powys", "response": ["Rhodri the Great ruled over most of modern Wales until his death in 878. His sons would in turn found dynasties of their own which would loom large in Welsh history, each claiming descent from Rhodri. Merfyn inherited Powys, whilst his brothers, Anarawd ap Rhodri and Cadell, established the Aberffraw dynasty in Gwynedd and the line of Dinefwr respectively."]}, {"page": "List of state leaders in the 10th century", "response": [":*Anarawd ap Rhodri, King (878–916)", ":*Anarawd ap Rhodri, King (878–916)"]}, {"page": "Idwal Foel", "response": ["Idwal Foel (Idwal the Bald; died c. 942) or Idwal ab Anarawd (Idwal son of Anarawd) was a 10th-century King of Gwynedd in Wales. A member of the House of Aberffraw, he inherited the throne from his father, Anarawd ap Rhodri. William of Malmesbury credited him as \"King of the Britons\" in the manner of his father.William of Malmesbury. Gesta Regum Anglorum."]}, {"page": "King of the Britons", "response": ["|Anarawd ap Rhodri||878–916||Gwynedd||King of the Britons (in 916)||Annales Cambriae|| "]}, {"page": "Ystrad Tywi", "response": ["In an attempt to regain the lands previously held by his father Rhodri Mawr, in 894 king Anarawd ap Rhodri of Gwynedd—together with an English force from his ally Alfred the Great—laid waste to Ystrad Tywi and Ceredigion."]}, {"page": "House of Dinefwr", "response": ["With the death of Rhodri Mawr, the kingdom of Gwynedd passed to his eldest son Anarawd ap Rhodri. Rhodri's second son Cadell ap Rhodri, however, looked outside Gwynedd's traditional borders and took possession of the Early Medieval Kingdom of Dyfed by the late 9th century, establishing his capital at the citadel of Dinefwr. Cadell ap Rhodri's descendants are designated Dinefwr after the citadel from which they would rule Dyfed. The Dinefwr dynasty under king Hywel Dda would unite Dyfed and Seisyllwg into the kingdom of Deheubarth in the early 10th century. The Dinefwr dynasty would rule in Deheubarth until their conquest by the Anglo-Normans in the 13th century. This branch would compete with House Aberffraw for supremacy and influence in Wales throughout the 10th, 11th and 12th centuries, with Powys variously ruled between them. Eventually, a cadet branch of Dinefwr would establish itself in Powys by the mid-11th century, designated Mathrafal after the castle there."]}, {"page": "Anarawd ap rhodri", "response": ["#REDIRECT Anarawd ap Rhodri "]}, {"page": "10th century in Wales", "response": ["*Anarawd ap Rhodri, King of Gwynedd"]}, {"page": "History of Gwynedd during the High Middle Ages", "response": ["In 999 Meredudd ab Owain of Deheubarth died, and Cynan ap Hywel was able to wrestle back Gwynedd for the Aberffraw dynasty.Lloyd, J.E. A history of Wales: from the earliest times to the Edwardian conquest Cynan ap Hywel, Aeddan ap Blegywryd, However, Cynan himself was deposed by Aeddan ap Blegywryd in 1005. Aeddan was not himself connected to the Aberffraw family, and was perhaps a minor commote lord. Aeddan ruled Gwynedd until 1018, when he and his four sons were defeated in battle by Llywelyn ap Seisyll, lord of Rhuddlan in lower Gwynedd.Davies, John, A History of Wales, Penguin, 1994, Llywelyn ap Seisyll, virtually nothing known of..., married Anghared ferch Meredudd, Iago ab Idwal, Gruffudd kills Iago ab Idwal and takes Gwynedd and Powys pages 99,100Little is known of the ancestry of Llywelyn ap Seisyll, with later genealogists suggesting he was descended from a younger son of Anarawd ap Rhodri, which would make him a member of the Aberffraw house. However, this may be a genealogical construct to legitimize his son Gruffydd ap Llywelyn's rule of Gwynedd later in the 11th century.There is general consensus from the strong association of Llywelyn ap Seisyll and his son Gruffydd ap Llywelyn with the commote of Rhuddlan, that they may have been of the ruling family of the Rhuddlan commote."]}, {"page": "9th century in England", "response": ["** The Welsh ruler Anarawd ap Rhodri, King of Gwynedd, makes the first ceremonial visit to an English court, that of Alfred."]}, {"page": "Anarawd", "response": ["*Anarawd ap Rhodri (died 916), King of Gwynedd"]}, {"page": "List of rulers of Gwynedd", "response": ["* Anarawd ap Rhodri (878–916) (establishes the Aberffraw dynasty, the senior branch of descendants from Rhodri Mawr)"]}, {"page": "Battle of Conwy (9th century)", "response": ["#redirect Anarawd ap Rhodri"]}]}}