{"wiki_id": "http://www.wikidata.org/entity/Q4893330", "itemLabel": "Bernard Knight", "itemDescription": "British forensic pathologist and author", "wikipedia_url": "https://en.wikipedia.org/wiki/Bernard_Knight", "wikipedia_page": {"main": "Bernard Henry Knight  (born 3 May 1931) is a British forensic pathologist and writer. He became a Home Office pathologist in 1965 and was appointed Professor of Forensic Pathology, University of Wales College of Medicine, in 1980.", "link_mentions": [{"page": "Michael Jecks", "response": ["Jecks has written a series of novels featuring Sir Baldwin Furnshill, a former Knight Templar, and his friend Simon Puttock, Bailiff of Lydford Castle. He founded The Medieval Murderers, a speaking and entertainment group of historical writers including Bernard Knight, Ian Morson, Susanna Gregory, Phillip Gooden and CJ Sansom. The group has developed to collaborate on their books written as linked novellas, each book with a consistent theme, under the brand of The Medieval Murderers. More recently he helped create the Historical Writers' Association."]}, {"page": "Coroner", "response": ["* Novelist Bernard Knight, a former Home Office pathologist and a professor of forensic pathology at the University of Wales College of Medicine, is well known for his Crowner John Mysteries series set in 12th-century Devon, England. (\"Crowner\" is an archaic word for \"coroner\" and is based on the origins of the word. See the History section above.)", "* History of the Medieval English Coroner System by Prof. Bernard Knight"]}, {"page": "Mary Bell", "response": ["The following day, Dr Bernard Knight conducted a post-mortem upon the body of Martin Brown. Knight was unable to find any signs of violence on the child's body, and thus was unable to determine the child's cause of death, although he was able to discount the investigators' theory the child had died of poisoning through ingesting tablets. An inquest on 7 June returned an open verdict."]}, {"page": "Cardiff University", "response": ["*Bernard Knight, crime writer"]}, {"page": "Garway", "response": ["Garway is featured in The Fabric of Sin, a novel written by Phil Rickman, and in Bernard Knight's chapter in King Arthur's Bones by The Medieval Murderers."]}, {"page": "Crowner John Mysteries", "response": ["The Crowner John Mysteries are a series of novels by Bernard Knight following the fictional life of Sir John de Wolfe, a former Crusading knight appointed to the office of Keeper of the Pleas of the King's Crown (custos placitorum coronas), i.e. the King's Crowner or Coroner, for the county of Devon. ", "Crowner John appears in a series of books formed of linked stories written by Philip Gooden, Susanna Gregory, Michael Jecks, Bernard Knight and Ian Morson under the common pseudonym of the Medieval Murderers:", "* Fantastic Fiction: Bernard Knight", "Category:Novels by Bernard Knight"]}, {"page": "The Witch Hunter (novel)", "response": ["The Witch Hunter is a novel by Bernard Knight and the eighth book in his Crowner John Mysteries series. It was published in 2004 and like other books in the series, it is set in 12th century Exeter. "]}, {"page": "List of Welsh inventors", "response": ["*Bernard Knight Forensic pathologist, barrister and writer. Creator of the 'Crowner John' series, historic crime fiction. As a forensic pathologist, worked on the infamous Fred West case, recovering all twelve bodies. Born and spent most of his life in Cardiff. "]}, {"page": "Cultural depictions of Richard I of England", "response": ["*Richard appears in several of the Crowner John historical mystery novels by Bernard Knight, beginning with The Sanctuary Seeker (1998).Michael Burgess; Jill H Vassilakos Murder in retrospect : a selective guide to historical mystery fiction. Westport, Conn. : Libraries Unlimited, 2005.  (pg. 182)"]}, {"page": "Physician writer", "response": ["*Bernard Knight, CBE (born 1931) has written about thirty books, including contemporary crime fiction, historical novels about Wales, biography, non-fiction popular works on forensic medicine, twelve medico-legal textbooks and the current highly acclaimed Crowner John Mysteries series of 12th-century historical mysteries"]}, {"page": "Karen Maitland", "response": ["She has co-written several titles in the Medieval Murderers series with medieval crime writers including Bernard Knight, Ian Morson, Susanna Gregory, and Philip Gooden.  She has worked as a writer and editor on a number of cross-cultural books including \"Poems of Cultural Diversity\" and \"Cinders in the Wind\". Maitland is dyslexic and resides in the medieval city of Lincoln, not very far from Sherwood Forest.", "* The Sacred Stone (2010)(Written with Bernard Knight, Ian Morson, Susanna Gregory and Philip Gooden)"]}, {"page": "Murder of Lynette White", "response": ["White's throat had been cut from the right ear across the front and around to the left side of the neck, exposing the bones of the spine. There were multiple stab wounds to her chest and breasts, and other wounds to her face, stomach, arms, wrists and inner thighs, as well as defensive wounds on her hands.Regina v. Jeffrey Charles Gafoor [2005] EWHC 2163 (QB) Her Majesty's Courts Service 19 October 2005. Bernard Knight, the pathologist who conducted White's autopsy, described it as \"a mutilating attack with sexual overtones\" and identified a total of 69 wounds. Although she had been stabbed seven times in the heart he concluded that it was the throat injury which had killed her. He said: \"It would require considerable force because the skin, muscles, larynx and voice box had been cut right down to the neckbone.\" Speculating on how the wound could have been inflicted, he said it was a normal reflex for a person to keep their head down in such a situation, and her head may have been forcibly held back for the knife wound to be inflicted. One of the two T-shirts Lynette was wearing was \"absolutely lacerated. It looked like a colander.\" Knight believed the murder weapon was at least five inches long. He determined that she had died between midnight and 4am. Her wristwatch had stopped at 1:45am, leading the police to conclude that this was the most likely time of death."]}, {"page": "Severn House Publishers", "response": ["*Bernard Knight"]}, {"page": "Cultural depictions of William Marshal, 1st Earl of Pembroke", "response": ["* William Marshal is a significant secondary character in the novel The Witch Hunter by Bernard Knight, in the author's John Crowner medieval mystery series, published in 2004."]}, {"page": "Mamie Stuart", "response": ["At the conclusion of the 1961 inquest, Stuart's skeleton was retained at Cardiff University, where eminent forensic pathologist Bernard Knight is believed to have occasionally used them to teach students. No efforts were made to locate surviving relatives and return her body to her family. "]}]}}