{"wiki_id": "http://www.wikidata.org/entity/Q4964714", "itemLabel": "Brian McGuinness", "itemDescription": "British philosopher", "wikipedia_url": "https://en.wikipedia.org/wiki/Brian_McGuinness", "wikipedia_page": {"main": "Brian McGuinness (22 October 1927 – 23 December 2019) was a Wittgenstein scholar best known for his translation, with David Pears, of the Tractatus-Logico-Philosophicus.He was christened with the forenames \"Bernard Francis\" but changed his name to \"Brian\" in his youth. He commonly published, and was cited, as B. F. McGuinness.\nFormerly a tutee of RM Hare, McGuinness was a Fellow and Tutor at Queen's College in Oxford University from 1953 to 1988, and took a post at the Netherlands Institute for Advanced Study. In 1990, he became a professor at the University of Siena, Italy. From 1990 to 1993, he was director of the faculty of philosophy and social sciences of this university. During his time at Queen's, he was an invited speaker at the Oxford Socratic Club, speaking with J. D. Mabbott on \"The Problem of Free Will\" on 14 November 1955.", "link_mentions": [{"page": "Ludwig Wittgenstein", "response": ["An English translation was prepared in Cambridge by Frank Ramsey, a mathematics undergraduate at King's commissioned by C. K. Ogden. It was Moore who suggested Tractatus Logico-Philosophicus for the title, an allusion to Baruch Spinoza's Tractatus Theologico-Politicus. Initially there were difficulties in finding a publisher for the English edition too, because Wittgenstein was insisting it appear without Russell's introduction; Cambridge University Press turned it down for that reason. Finally in 1922 an agreement was reached with Wittgenstein that Kegan Paul would print a bilingual edition with Russell's introduction and the Ramsey-Ogden translation. This is the translation that was approved by Wittgenstein, but it is problematic in a number of ways. Wittgenstein's English was poor at the time, and Ramsey was a teenager who had only recently learned German, so philosophers often prefer to use a 1961 translation by David Pears and Brian McGuinness.", "* Wittgenstein: Gesamtbriefwechsel/Complete Correspondence. Innsbrucker Electronic Edition: Ludwig Wittgenstein: Gesamtbriefwechsel/Complete Correspondence contains Wittgenstein's collected correspondence, edited under the auspices of the Brenner-Archiv's Research Institute (University of Innsbruck). Editors (first edition): Monika Seekircher, Brian McGuinness and Anton Unterkircher. Editors (second edition): Anna Coda, Gabriel Citron, Barbara Halder, Allan Janik, Ulrich Lobis, Kerstin Mayr, Brian McGuinness, Michael Schorner, Monika Seekircher and Joseph Wang."]}, {"page": "1988 in literature", "response": ["*James Tait Black Memorial Prize for biography: Brian McGuinness, Wittgenstein, A Life: Young Ludwig (1889–1921)"]}, {"page": "Vienna Circle", "response": ["Also Wittgenstein's Tractatus logico-philosophicus was read out loud and discussed. From 1927 on personal meetings were arranged between Wittgenstein and Schlick, Waismann, Carnap and Feigl.For the recording of these meetings see Brian McGuinness, Wittgenstein and the Vienna Circle: Conversations Recorded by Friedrich Waismann. Trans. by Joachim Schulte and Brian McGuinness. New York: Barnes & Noble Books, 1979.", "* McGuinness, Brian. Wittgenstein and the Vienna Circle: Conversations Recorded by Friedrich Waismann. Trans. by Joachim Schulte and Brian McGuinness. New York: Barnes & Noble Books, 1979."]}, {"page": "R. M. Hare", "response": ["Some of Hare's students, such as Brian McGuinness, John Lucas, and Bernard Williams went on to become well-known philosophers. Peter Singer, known for his involvement with the animal liberation movement (who studied Hare's work as an honours student at the University of Melbourne and came to know Hare personally whilst he was an Oxford BPhil graduate student), has explicitly adopted some elements of Hare's thought, though not his doctrine of universal prescriptivism."]}, {"page": "James Tait Black Memorial Prize", "response": ["| 1988 || Piers Paul Read, A Season in the West || Brian McGuinness, Wittgenstein, A Life: Young Ludwig (1889–1921) (Ludwig Wittgenstein) || "]}, {"page": "List of philosophers born in the 20th century", "response": ["* Brian McGuinness (1927–2019)"]}, {"page": "McGuinness", "response": ["* Brian McGuinness (1927–2019), British philosopher"]}, {"page": "Screen Two", "response": ["Cast: Mark Rylance, Georgina Cates, Sara Stephens, Danny Dyer, Gabrielle Lloyd, Carol MacReadie, Max Brazier, Purdita Weeks, Charlotte Curley, Lucy Cohu, Judy Parfitt, Phyllis Ryan, Brian McGuinness, Owen Roe, Peadar Lamb, Michael James Ford and Ruth Comiskey"]}, {"page": "Josef Schächter", "response": ["* Friedrich Waismann, Josef Schächter und Moritz Schlick: Ethics and the Will. Essays, ed. and with an introduction by Brian McGuinness and Joachim Schulte,  Kluwer, Dordrecht-Boston-London 1994."]}, {"page": "Bernard F. McGuinness", "response": ["#Redirect Brian McGuinness"]}, {"page": "Bernard Francis McGuinness", "response": ["#Redirect Brian McGuinness"]}, {"page": "Bernard McGuinness", "response": ["#Redirect Brian McGuinness"]}, {"page": "Paddy McGuinness (civil servant)", "response": ["Born in Oxford to Professors Rosamond McGuinness and Brian McGuinness, McGuinness went to Ampleforth College, and then to Balliol College, Oxford where he took a BA in modern history. He has a sister Catherine McGuinness who chairs the Policy and Resources Committee of the City of London Corporation."]}, {"page": "McGuinness, Brian", "response": ["#redirectBrian McGuinness"]}, {"page": "Catherine McGuinness (English politician)", "response": ["She is the daughter of two academics, the philosopher Brian McGuinness and the music historian Rosamond McGuinness. Her brother, Paddy McGuinness, was  the Deputy National Security Adviser for Intelligence, Security, and Resilience at the Cabinet Office, 2014_January 2018."]}, {"page": "Rosamond McGuinness", "response": ["She married twice, first to Brian McGuinness, the philosopher and later to George Biddlecombe."]}, {"page": "2019 in philosophy", "response": ["*23 December – Brian McGuinness, British philosopher."]}, {"page": "Deaths in December 2019", "response": ["*Brian McGuinness, 92, British philosopher.Brian McGuinness, world-renowned expert on Ludwig Wittgenstein – obituary "]}]}}