{"wiki_id": "http://www.wikidata.org/entity/Q4963178", "itemLabel": "Brian Bowditch", "itemDescription": "British mathematician", "wikipedia_url": "https://en.wikipedia.org/wiki/Brian_Bowditch", "wikipedia_page": {"main": "Brian Hayward Bowditch (born 1961) is a British mathematician known for his contributions to geometry and topology, particularly in the areas of geometric group theory and low-dimensional topology. He is also known for solving the angel problem. Bowditch holds a chaired Professor appointment in Mathematics at the University of Warwick.", "link_mentions": [{"page": "Geometric group theory", "response": ["The emergence of geometric group theory as a distinct area of mathematics is usually traced to the late 1980s and early 1990s. It was spurred by the 1987 monograph of Mikhail Gromov \"Hyperbolic groups\"Mikhail Gromov, Hyperbolic Groups, in \"Essays in Group Theory\" (Steve M. Gersten, ed.), MSRI Publ. 8, 1987, pp. 75–263. that introduced the notion of a hyperbolic group (also known as word-hyperbolic or Gromov-hyperbolic or negatively curved group), which captures the idea of a finitely generated group having large-scale negative curvature, and by his subsequent monograph Asymptotic Invariants of Infinite Groups,Mikhail Gromov, \"Asymptotic invariants of infinite groups\", in \"Geometric Group Theory\", Vol. 2 (Sussex, 1991), London Mathematical Society Lecture Note Series, 182, Cambridge University Press, Cambridge, 1993, pp. 1–295. that outlined Gromov's program of understanding discrete groups up to quasi-isometry. The work of Gromov had a transformative effect on the study of discrete groupsIliya Kapovich and Nadia Benakli. Boundaries of hyperbolic groups. Combinatorial and geometric group theory (New York, 2000/Hoboken, NJ, 2001), pp. 39–93, Contemp. Math., 296, Amer. Math. Soc., Providence, RI, 2002. From the Introduction:\" In the last fifteen years geometric group theory has enjoyed fast growth and rapidly increasing influence. Much of this progress has been spurred by remarkable work of M. L. Gromov [in Essays in group theory, 75–263, Springer, New York, 1987; in Geometric group theory, Vol. 2 (Sussex, 1991), 1–295, Cambridge Univ. Press, Cambridge, 1993], who has advanced the theory of word-hyperbolic groups (also referred to as Gromov-hyperbolic or negatively curved groups).\"Brian Bowditch, Hyperbolic 3-manifolds and the geometry of the curve complex. European Congress of Mathematics, pp. 103–115, Eur. Math. Soc., Zürich, 2005. From the Introduction:\" Much of this can be viewed in the context of geometric group theory. This subject has seen very rapid growth over the last twenty years or so, though of course, its antecedents can be traced back much earlier. [...] The work of Gromov has been a major driving force in this. Particularly relevant here is his seminal paper on hyperbolic groups [Gr].\" and the phrase \"geometric group theory\" started appearing soon afterwards. (see e.g.Geometric group theory. Vol. 1. Proceedings of the symposium held at Sussex University, Sussex, July 1991. Edited by Graham A. Niblo and Martin A. Roller. London Mathematical Society Lecture Note Series, 181. Cambridge University Press, Cambridge, 1993. .).", "*The theory of word-hyperbolic and relatively hyperbolic groups. A particularly important development here is the work of Zlil Sela in 1990s resulting in the solution of the isomorphism problem for word-hyperbolic groups. The notion of a relatively hyperbolic groups was originally introduced by Gromov in 1987 and refined by  Farb and Brian Bowditch, in the 1990s. The study of relatively hyperbolic groups gained prominence in the 2000s."]}, {"page": "Angel problem", "response": ["Brian Bowditch's proof works for the 4-angel, while Oddvar Kloster's proof and András Máthé's proof  work for the 2-angel. Péter Gács's proof works only for a much larger constant. The proofs by Bowditch and Máthé have been published in Combinatorics, Probability and Computing. The proof by Kloster has been published in Theoretical Computer Science.", "Brian Bowditch defines a variant (game 2) of the original game with the following rule changes:"]}, {"page": "Bowditch", "response": ["*Brian Bowditch (born 1961), British mathematician"]}, {"page": "Whitehead Prize", "response": ["* 1997 Brian Bowditch, , Dominic Joyce"]}, {"page": "James W. Cannon", "response": ["Although the paper of Cannon and Thurston was finally published only in 2007, in the meantime it has generated considerable further research and a number of significant generalizations (both in the contexts of Kleinian groups and of word-hyperbolic groups), including the work of Mahan Mitra,Mahan Mitra. Cannon–Thurston maps for hyperbolic group extensions. Topology, vol. 37 (1998), no. 3, pp. 527–538.Mahan Mitra. Cannon–Thurston maps for trees of hyperbolic metric spaces. Journal of Differential Geometry, vol. 48 (1998), no. 1, pp. 135–164. Erica Klarreich,Erica Klarreich, Semiconjugacies between Kleinian group actions on the Riemann sphere. American Journal of Mathematics, vol. 121 (1999), no. 5, 1031–1078. Brian BowditchBrian Bowditch. The Cannon–Thurston map for punctured-surface groups. Mathematische Zeitschrift, vol. 255 (2007), no. 1, pp. 35–76. and others."]}, {"page": "Brian H. Bowditch", "response": ["#REDIRECT Brian Bowditch"]}, {"page": "B. H. Bowditch", "response": ["#redirectBrian Bowditch"]}, {"page": "List of University of Warwick people", "response": ["* Brian Bowditch - mathematician known for contributions to geometry and topology, and for solving the angel problem"]}, {"page": "Bowditch, Brian", "response": ["#redirectBrian Bowditch"]}]}}