{"wiki_id": "http://www.wikidata.org/entity/Q5180983", "itemLabel": "Craig Gallivan", "itemDescription": "British actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Craig_Gallivan", "wikipedia_page": {"main": "Craig Gallivan (born 9 February 1984, in Swansea) is a Welsh actor best known for playing Callum Watson in the ITV1 series Footballers Wives, alongside the ITV2 spin-off Footballers' Wives: Extra Time and more recently as Luke in Ruth Jones’ multi award-winning Sky1 television series Stella starring in over 50 episodes and 2 Christmas Specials. In 2018, Craig took over the lead role in the Andrew Lloyd Webber musical School of Rock and holds the record as the longest serving ‘Dewey’ in the shows West End history.\nCraig Gallivan spent his early years playing rugby and at the age of 12 was selected to play for his home city of Swansea and then subsequently went on to represent West Wales.\nCraig's younger sister Hayley was part of a youth drama group who travelled to London to audition for Cameron Macintosh's musical Oliver at the London Palladium. Somewhat reluctantly, Craig was persuaded to join them. Several recalls later, Craig was offered a part in the Sam Mendes production and in a matter of weeks was performing on the West End stage in front of 2000 people alongside Barry Humphries and Jim Dale. When the production was finally over Craig decided to pursue a career in acting.\nAt the age of 18 Craig was offered a place at the renowned drama school RADA (Royal Academy of Dramatic Art) where he trained for 3 years. By this time Craig had already made a number of stage and TV appearances including the BAFTA award-winning BBC drama Care (2000). On graduating from RADA Craig was launched into millions of UK homes playing Callum Watson in ITV's hit TV show Footballers Wives (2006). The show has since been shown internationally including throughout America via BBC Worldwide. Craig has gone on to star in numerous theatrical, TV and film productions including leading roles for The Royal Shakespeare Company (2008) and National Theatre (2008) in London, BBC's Dr Who spin-off Torchwood (2009) and as Tony Elliot in the multi Olivier and Tony award-winning Billy Elliot (2010), directed by Stephen Daldry, for which he was nominated Best Supporting Actor.\nCraig starred as Luke Morris in the hit SKY1 comedy-drama Stella, created by Ruth Jones. The show ran for 6 seasons winning numerous awards and has been hailed as SKY1's most watched show ever and seen the second-biggest UK comedy launch in multichannel history with its debut in 2012.", "link_mentions": [{"page": "Footballers' Wives", "response": ["*Craig Gallivan as Callum Watson (Series 5)"]}, {"page": "Billy Elliot the Musical", "response": ["* Tony – Craig Gallivan, Tom Lorcan, Killian Donnelly"]}, {"page": "Footballers' Wives: Extra Time", "response": ["* Craig Gallivan as Callum Watson (Series 2)"]}, {"page": "Steven Beale", "response": ["In 2005, the British media claimed that the character of Steven was due to return to EastEnders, three years after he had last appeared. The Sunday Mirror speculated that EastEnders bosses were hoping to cast an Australian actor to play Steven, to signify that he had been in New Zealand. It was claimed that actors from Australia's long-running soaps, Neighbours or Home and Away, were being considered. The rumours turned out to be false, and a subsequent rumour in January 2007 predicting that Footballers' Wives' actor Craig Gallivan was to play the role, was also quashed."]}, {"page": "List of alumni of the Royal Academy of Dramatic Art", "response": ["*Craig Gallivan (BA Acting 2005)"]}, {"page": "List of Footballers' Wives characters", "response": ["*Craig Gallivan as Callum Watson (Series 5)"]}, {"page": "Stella (British TV series)", "response": ["| Craig Gallivan"]}, {"page": "Frozen (musical)", "response": ["| align=\"center\" | Craig Gallivan"]}, {"page": "Gallivan", "response": ["*Craig Gallivan (born 1984), Welsh actor, played Callum Watson in Footballers Wives"]}]}}