{"wiki_id": "http://www.wikidata.org/entity/Q5225192", "itemLabel": "Darren Thomas", "itemDescription": "Welsh cricketer", "wikipedia_url": "https://en.wikipedia.org/wiki/Darren_Thomas", "wikipedia_page": {"main": "Stuart Darren Thomas (born 25 January 1975) is a former Welsh cricketer. He is a left-handed batsman and a right-arm medium-pace bowler.\nHaving first achieved notability taking a five-wicket haul against Derbyshire at the age of 17, Thomas took his chance at a place in the England youth team, and continued to bowl well through to 1995, at which point he suffered a dip in form which lasted until he regained his form in 1998, finishing top of the wicket-taking stakes with 81 wickets at an average of 24. He bowled an innings of 7 for 16, a record for Glamorgan, and was offered a chance to play for England A against South Africa and Zimbabwe.\nHe became the leading wicket taker in 2000 and recorded his first ten-wicket innings against Durham in 2002.\nIn 2007, after fifteen years with Glamorgan, he joined Essex County Cricket Club. However, a shoulder injury sustained in February of that year prevented his playing even once for the first team, and in September he announced his retirement.", "link_mentions": [{"page": "Warwickshire County Cricket Club in 2005", "response": ["On the fourth day, Robert Croft and Darren Thomas held Warwickshire briefly at bay with a partnership of 75, but this wasn't enough as Glamorgan succumbed for 323. Warwickshire captain, Nick Knight, said, \"Once they were bowled out for 198 on that pitch they were always going to struggle. They then put down three catches, which proved to be decisive. We had a bit of luck so we are not going to start going around saying that we are going to win the Championship just because we have won one match.\" John Derrick, Glamorgan's coach, said, \"Although we batted much better second time around, we made it difficult for ourselves by not scoring enough first innings runs. Warwickshire showed what playing pressure cricket is all about. They bowled with a lot of discipline. They piled up a big score to make sure that we did not get back into the game.\" (Cricinfo scorecard)"]}, {"page": "Glamorgan County Cricket Club in 2005", "response": ["*  Darren Thomas", "On the fourth day, Robert Croft and Darren Thomas held Warwickshire briefly at bay with a partnership of 75, but this wasn't enough as Glamorgan succumbed for 323. Warwickshire captain, Nick Knight, said, \"Once they were bowled out for 198 on that pitch they were always going to struggle. They then put down three catches, which proved to be decisive. We had a bit of luck so we are not going to start going around saying that we are going to win the Championship just because we have won one match.\" John Derrick, Glamorgan's coach, said, \"Although we batted much better second time around, we made it difficult for ourselves by not scoring enough first innings runs. Warwickshire showed what playing pressure cricket is all about. They bowled with a lot of discipline. They piled up a big score to make sure that we didn't get back into the game.\" (Cricinfo scorecard)", "Amid rains at Southampton, Hampshire batted their way to the big lead they were expected to get against Glamorgan, who had lost four games in the Championship before this. Former England batsman John Crawley took a day for his century, while in contrast Kevin Pietersen took two and a half hours for his, making a century off 99 balls and ending with 126. Hampshire eventually made 401 for 8 declared to get full batting points before attacking Glamorgan. Chris Tremlett reaped Glamorgan wickets in the next innings, removing David Hemp, Mike Powell and Jonathan Hughes among others to take four for 42 and reduce Glamorgan to 229 – a score that would have been much lower but for Darren Thomas, who blitzed his way to 63. Following on, Glamorgan got to 77 for 1 at stumps on day three, but wickets tumbled in the morning, reducing Glamorgan to 147 for 5. Robert Croft and Mike Powell rebuilt, but when Australian batsman Simon Katich had Croft caught by skipper Shane Warne and Powell went a few overs later, Glamorgan ended on a total of 250 as Zimbabwe all-rounder Sean Ervine picked up the last three wickets, finishing with five for 60, while Tremlett took three for 48. In reply, Hampshire reached the target of 79 inside fifteen overs, with Katich – unusually – opening the batting. With Nottinghamshire losing to Kent and Warwickshire and Surrey not playing, Hampshire took the lead in the Championship with their emphatic full-score win."]}, {"page": "Hampshire County Cricket Club in 2005", "response": ["Amid rains at Southampton, Hampshire batted their way to the big lead they were expected to get against Glamorgan, who had lost four games in the Championship before this. Former England batsman John Crawley crawled his way to a day-long century, while Kevin Pietersen took care of the fast scoring, making a century off 99 balls and ending with 126. Hampshire eventually made 401 for 8 declared to get full batting points before attacking Glamorgan. Chris Tremlett bowled well in the attempt, removing David Hemp, Mike Powell and Jonathan Hughes among others to take four for 42 and reduce Glamorgan to 229 – a score that would have been much lower but for Darren Thomas, who blitzed his way to 63. Following on, Glamorgan batted more casually, getting to 77 for 1 at stumps on day 3, but wickets tumbled in the morning, reducing Glamorgan to 147 for 5. Robert Croft and Mike Powell rebuilt, but when Australian batsman Simon Katich had Croft caught by skipper Shane Warne and Powell went a few overs later, Glamorgan imploded to 250 all out as Zimbabwe all-rounder Sean Ervine picked up the last three wickets, finishing with five for 60, while Tremlett took three for 48. In reply, Hampshire brushed aside the target of 79 inside fifteen overs, with Katich – unusually – opening the batting. With Nottinghamshire losing to Kent and Warwickshire and Surrey not playing, Hampshire took the lead in the Championship with their emphatic full-score win."]}, {"page": "NBC Denis Compton Award", "response": ["*Glamorgan – Darren Thomas", "*Glamorgan – Darren Thomas"]}, {"page": "Thomas (surname)", "response": ["*Darren Thomas (born 1975), Welsh footballer"]}, {"page": "3 Musketeers (film)", "response": ["*Darren Thomas as Rockford"]}, {"page": "List of Glamorgan County Cricket Club players", "response": ["* Darren Thomas (1992–2006) : S. D. Thomas"]}, {"page": "Alexandra Sports Club", "response": ["* Best bowling in an innings: 8/50 by Darren Thomas for England A v. Zimbabwe A, 1998/99Alexandra Sports Club, Harare – seven wickets in an innings in first-class cricket – CricketArchive. Retrieved 1 August 2016."]}]}}