{"wiki_id": "http://www.wikidata.org/entity/Q5241167", "itemLabel": "David Willicombe", "itemDescription": "Welsh rugby union and rugby league footballer", "wikipedia_url": "https://en.wikipedia.org/wiki/David_Willicombe", "wikipedia_page": {"main": "David Willicombe (birth unknown) is a Welsh former rugby union and professional rugby league footballer who played in the 1960s, 1970s and 1980s. He played at representative level for Great Britain and Wales, and at club level for Halifax and Wigan, as a centre, i.e. number 3 or 4.", "link_mentions": [{"page": "Cardiff", "response": ["In particular, the city has been the birthplace of sports stars such as Tanni Grey-Thompson and Colin Jackson as well as many Premier League, Football League and international footballers, such as Craig Bellamy, Gareth Bale, Ryan Giggs, Joe Ledley, and former managers of the Wales national football team Terry Yorath and John Toshack. International rugby league players from Cardiff include Frank Whitcombe, Billy Boston, David Willicombe and Colin Dixon. International Rugby Union Jamie Roberts, Jamie Robinson, Nicky Robinson, Rhys Patchell, and baseball internationals include George Whitcombe and Ted Peterson."]}, {"page": "1975 Rugby League World Cup", "response": ["*  David Willicombe"]}, {"page": "List of Great Britain national rugby league team players", "response": ["* David Willicombe circa-1974"]}, {"page": "List of Wigan Warriors internationals", "response": ["* David Willicombe won caps for Wales while at Halifax in 1970 against England, while at Wigan in 1975 against France, and England, in the 1975 Rugby League World Cup against France, England, Australia, New Zealand, New Zealand, and France, and in 1978 against France, England, and Australia, and won caps for Great Britain while at Wigan in 1974 against France (2 matches), and New Zealand (World Cup in 1975 6-caps, 2-tries)"]}, {"page": "1978 Kangaroo tour of Great Britain and France", "response": ["|RC ||3|| David Willicombe", "Wigan: George Fairbairn, Dennis Ramsdale, David Willicombe, Alan Greenall, Jimmy Hornby, Keiron O'Loughlin, Bernard Coyle, John Wood, Tony Karalius, Steve O'Neill, John Foran, Bill Melling, Dennis Boyd. Res - Malcolm Swann, David Regan. Coach - Vince Karalius"]}, {"page": "Dave Willicombe", "response": ["#REDIRECT David Willicombe"]}, {"page": "1977–78 Lancashire Cup", "response": ["|John Risman||3||David Willicombe", "|||T||David Willicombe (1)"]}, {"page": "1971–72 League Cup (rugby league)", "response": ["|David Willicombe||4||John Hegarty", "|David Willicombe (1)||T||David Topliss (1)"]}]}}