{"wiki_id": "http://www.wikidata.org/entity/Q5240884", "itemLabel": "David Watts Morgan", "itemDescription": "Welsh politician (1867-1933)", "wikipedia_url": "https://en.wikipedia.org/wiki/David_Watts_Morgan", "wikipedia_page": {"main": "David Watts Morgan,  (18 December 1867 – 23 February 1933), who later in life hyphenated his name to Watts-Morgan, was a Welsh trade unionist, a Labour politician, and a Member of Parliament (MP) from 1918 to 1933.\nDescribed as \"[straddling] the transition in south Wales miners' politics from Lib-Labism to socialism, but ... never fully representative of either\", Morgan encouraged Rhondda miners to enlist in the army in 1914 following the outbreak of the First World War, and was appointed Commander of the Order of the British Empire for his efforts. He initially served in the Welsh Regiment, before becoming a lieutenant-colonel in the Labour Corps. Morgan was awarded the Distinguished Service Order for bravery at the Battle of Cambrai in 1917, earning him the nickname \"Dai Alphabet\" in South Wales.", "link_mentions": [{"page": "Neath", "response": ["*David Watts Morgan (1867–1933), miners' leader and politician;"]}, {"page": "David Morgan", "response": ["* David Watts Morgan (1867–1933), Welsh trade unionist and Member of Parliament"]}, {"page": "1933 in Wales", "response": ["*23 February – David Watts Morgan, Member of Parliament for Rhondda East, 65"]}, {"page": "1867 in Wales", "response": ["*18 December – David Watts Morgan, Member of Parliament for Rhondda East (d. 1933) "]}, {"page": "Trade Union Group of Labour MPs", "response": [":1926: David Watts Morgan"]}, {"page": "David Watts-Morgan", "response": ["#REDIRECT David Watts Morgan"]}, {"page": "1915 Merthyr Tydfil by-election", "response": ["The wife of David Watts Morgan, Agent of the No. 1 Rhondda District of the SWMF and to be elected Labour MP for Rhondda East in 1918, supported Stanton, an act he (Morgan) later had to apologise for."]}, {"page": "1923 Anglesey by-election", "response": ["Labour's campaign was supported by visits from national figures such as Arthur Henderson, and a host of Labour MPs from south Wales such as David Watts Morgan, Tom Griffiths, David Grenfell and T. I. Mardy Jones, as well as prominent Welsh nationalist figures such as future Liberal MP William John Gruffydd and Principal Thomas Rees. John called for Welsh Home Rule, even though it was not Labour party policy."]}]}}