{"wiki_id": "http://www.wikidata.org/entity/Q5296340", "itemLabel": "Donna Edwards", "itemDescription": "Welsh actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Donna_Edwards_(actress)", "wikipedia_page": {"main": "Donna Edwards (born 1963) is a Welsh actress. Edwards is a Bafta Cymru award-winning for Best Actress.", "link_mentions": [{"page": "Pobol y Cwm", "response": ["|Britt Evans (née Monk) || Donna Edwards || 2002–"]}, {"page": "Against the Dying of the Light", "response": ["The film was directed by Jack Jewers, produced by Jack Jewers, Leo Brend and the (then) head of the archive, Iola Baines.  It features interviews with William Lloyd-George, (grandson of David Lloyd George); the actors Rhys Ifans, Donna Edwards and Sue Rodderick; the directors Marc Evans and Karl Francis; and the author Kevin Brownlow."]}, {"page": "Belonging (TV series)", "response": ["|Donna Edwards"]}, {"page": "The Life and Times of David Lloyd George", "response": ["* Donna Edwards - Mair Lloyd George"]}, {"page": "Dinas Powys", "response": ["*Donna Edwards (born in Merthyr Tydfil)- double BAFTA winning actress, lives in Dinas Powys"]}, {"page": "Donna Edwards", "response": ["On April 27, 2009, Rep. Donna Edwards was arrested outside the Sudan embassy during a protest against genocide in Darfur. The Representative and five other U.S. Congressional Representatives were protesting the blocking of aid to victims. They were arrested after ignoring warnings issued by police maintaining a police line to protect the embassy in Washington, D.C.", "Edwards and Rep. Chris Van Hollen (D-MD) faced off in the Democratic primary for the U.S. Senate seat to be vacated by Barbara Mikulski's (D) retirement.Arelis R. Hernández, \"U.S. Rep. Donna Edwards said to be announcing Senate bid on Tuesday\", The Washington Post, March 8, 2015.  She lost the primary election on April 26, 2016. Since she had run for the Senate seat, instead of for reelection to her Congressional seat, Edwards left public office when her term expired in January 2017."]}, {"page": "Edwards (surname)", "response": ["*Donna Edwards (born 1958), American politician", "*Donna Edwards (actress) (born 1963), Welsh actress"]}, {"page": "List of longest-serving soap opera actors", "response": ["|Donna Edwards || Britt Monk || Pobol y Cwm || 2002– ||  years ||"]}, {"page": "List of Pobol y Cwm characters", "response": ["|Britt Evans (née Monk) || Donna Edwards || 2002– || Sister of the late Brandon and half-sister to Garry Monk. Former partner of Teg, divorced from Siôn White. Mother of Chester, Catrin and Aaron. She runs the chippy and also owns Y Deri with Garry. Now married to Colin. Suffers from Bipolar Disorder."]}, {"page": "List of Welsh women", "response": ["*Donna Edwards (born 1963), actress"]}, {"page": "Off to Philadelphia in the Morning (TV series)", "response": ["*Donna Edwards ... Myfanwy Llewellyn"]}]}}