{"wiki_id": "http://www.wikidata.org/entity/Q5318618", "itemLabel": "Dyfodwg", "itemDescription": "Welsh saint", "wikipedia_url": "https://en.wikipedia.org/wiki/Dyfodwg", "wikipedia_page": {"main": "Dyfodwg, or Tyfodwg, was a 6th-century Welsh saint. He is one of the three saints (with Illtyd and Gwynno) from whom the ancient parish of Llantrisant takes its name, and possibly the patron (believed to have been Tyfodwg son of Gwilfyw) of the parish church of Llandyfodwg in Glynogwr, between Blackmill and Gilfach Goch in Bridgend, and gave his name to the ancient parish of Ystradyfodwg.Some records state Dyfodwg was a Breton monk, while others that he was born within the Glamorgan area. Iolo Morgannwg states that Dyfodwg founded a church at Ystradyfodwg (The vale of Tyfodwg) and was a disciple of Illtyd at Llantwit Major. However, there is no record of any church being dedicated to him in Ystradyfodwg itself (the parish church is dedicated to Saint John), leading some to suggest that the parish was named, not for a saint, but a local chieftain. One legend records that Tyfodwg was a chieftain promised sainthood by the monks at Penrhys.According to Rice Rees Tyfodwg was one of the associates of Cadfan (presumably Saint Cadfan), though the family line in the Cambrian Biography, is inconsistent with known chronology. His patronal feast is kept on 25 June.\n\n", "link_mentions": [{"page": "Llantrisant", "response": ["Llantrisant (; \"Parish of the Three Saints\") is a town in the county borough of Rhondda Cynon Taf, within the historic county boundaries of Glamorgan, Wales, lying on the River Ely and the Afon Clun. The three saints of the town's name are SS. Illtyd, Gwynno, and Dyfodwg. Llantrisant is a hilltop settlement, at an altitude of 174 m (565 ft) above sea level. The town is home to the Royal Mint.", "By the early 1900s Llantrisant had eight chapels, as well as the Llantrisant Parish Church Only two religious buildings remain. The elder is the church of 'y tri sant'. The three saints to which the church is dedicated are St. Illtyd, St. Gwynno and St. Dyfodwg. The site is believed to have been a place of Christian worship since at least the 7th century, and in 1096 the parish church was built and dedicated. The church was rebuilt by Richard de Clare in 1246 in the Norman style and in the 15th century the tower was added. Its interior houses an effigy of a 13th-century warrior, believed to be Cadwgan, lord of Miskin, a valuable Welsh church monument. The interior was restored in 1874 by Welsh neo-gothic designer John Prichard. The former parish office built 1873 on George Street is now a private home."]}, {"page": "Ystradyfodwg", "response": ["Ystradyfodwg or Ystrad Dyfodwg (Vale of Tyfodwg) was an ancient upland parish in Glamorgan, Wales. It is believed to have been named after Dyfodwg (or Tyfodwg) a 6th-century saint or chieftain. The Parish included most of the area which would later be known as Rhondda named for the parish rivers, Rhondda Fawr and Rhondda Fach. "]}, {"page": "Gwynno", "response": ["The Celtic bishop, Saint Dyfrig, founded three centres of learning in South-East Wales - at Llancarfan (near Cowbridge), Caerworgorn (now Llantwit Major), and Caerleon. Gwynno was one of the early members of the community at Llancarfan.Rees, Rice An Essay on the Welsh Saints, or the Primitive Christians usually considered to have been the founders of churches in Wales. London: Longman &c., 1836. Under the name of Gwynno, he is considered to have been one of the three founders of Llantrisant, Glamorganshire, together with Illtyd and Dyfodwg; Llanwynno, a chapel under Llantrisaint, is dedicated to him."]}, {"page": "St Dyfodwg", "response": ["#REDIRECT Dyfodwg"]}, {"page": "Saint Dyfodwg", "response": ["#REDIRECT Dyfodwg"]}, {"page": "St. Dyfodwg", "response": ["#REDIRECT Dyfodwg"]}, {"page": "List of Welsh saints", "response": ["|Dyfodwg"]}, {"page": "List of Church in Wales churches", "response": ["|SS Illtyd, Gwynno & Dyfodwg"]}]}}