{"wiki_id": "http://www.wikidata.org/entity/Q533591", "itemLabel": "Hue de Rotelande", "itemDescription": "Cambro-Norman poet", "wikipedia_url": "https://en.wikipedia.org/wiki/Hue_de_Rotelande", "wikipedia_page": {"main": "Hue de Rotelande was an important Cambro-Norman poet writing in Old French at the end of the 12th century.", "link_mentions": [{"page": "Robert Copland", "response": ["He translated from the French the romances of Kynge Appolyne of Thyre (W. de Worde, 1510), The History of Helyas Knyght of the Swanne (W. de Worde, 1512, 1522), and The Life of Ipomydon (Hue de Rotelande), not dated. Among his other works is The Complaynte of them that ben too late maryed, an undated tract printed by Wynkyn de Worde. William Copland, the printer, supposed to have been his brother, published three editions of Howleglas, perhaps by Robert, which in any case represent the earliest English version of Till Eulenspiegel. The Knyght of the Swanne was reprinted by W. Copland possibly in 1560, in William John Thoms's Early Prose Romances, vol. iii, and by the Grolier Club (1901); the Hye Way in William Carew Hazlitt's Remains of the Early Popular Poetry of England, vol. iv (1866)."]}, {"page": "Romance of Thebes", "response": ["From the Roman de Thebes also were possibly derived the Ipomedon and its sequel Protheselaus, two romans d'aventures written about the end of the 12th century by Hue de Rotelande, an Anglo-Norman poet who lived in Credenhill, near Hereford. The author asserts that he translated from a Latin book lent him by Gilbert Fitz-Baderon, 4th lord of Monmouth, but in reality he has written romances of chivalry on the usual lines, the names of the characters alone being derived from antiquity."]}, {"page": "Libeaus Desconus", "response": ["===Hue de Rotelande's Ipomedon===", "The twelfth-century romance Ipomedon, written in Norman French by Hue de Rotelande, is found in a Middle English version, Ipomadon, in MS Chetham 8009, lying in Chetham's Library, Manchester, England and dating from \"between the last decade of the fourteenth century and the middle of the fifteenth century\".Purdie, Rhiannon. 2001. Ipomadon. Oxford University Press for the Early English Text Society. Introduction. Following a number of adventures in which the eponymous hero demonstrates his martial prowess, Ipomadon puts on the garb of a fool and goes to the court of the uncle of the lady he loves, the King of Sicily, where he agrees to stay only if he is granted the \"fyrste battayle\".Purdie, Rhiannon. 2001. Ipomadon, line 6323. p 182. Shortly after he arrives, a maiden appears, \"apon a palfreye white as mylke\",Purdie, Rhiannon. 2001. Ipomadon, line 6454. p 186. seeking a champion to free her lady from oppression. The fool (Ipomadon) asks again that the quest be given to him. Since nobody else at court wants to undertake this task, the king concedes his request. The maiden is far from impressed. Only slowly does she moderate her acrimony as the fool travels along with her, defeating one hostile knight after another, until they reach the maiden's land and he frees the lady, who is, in fact, the lady he loves. The maiden's name is Imayne, she travels with a dwarf and, along the way, Ipomadon defeats a knight named Maugys."]}, {"page": "12th century in literature", "response": ["**Ipomedon by Hue de Rotelande", "**Protheselaus by Hue de Rotelande"]}, {"page": "Hugh of Rutland", "response": ["#REDIRECT Hue de Rotelande"]}, {"page": "Ipomedon", "response": ["Ipomedon is a romance composed in Anglo-Norman verse by Hue de Rotelande in the late 12th century at Credenhill near Hereford. In the sequel Protheselaus, which must have been composed slightly later, Hue acknowledges as his patron Gilbert fitzBaderon, lord of Monmouth. Gilbert's death in or just before 1191 gives an approximate terminus ante quem to both romances.", "Ipomedon is comparatively rich in references to the real world in which the poet lived. He names himself in full Hue de Rotelande (line 33 and two other places)Line numbers are based on Holden (1979); they differ slightly in Kölbing and Koschwitz (1889) and confirms that his house was at Credenhill: A Credehulle a ma meisun (line 10571). He mentions the siege of Rouen by King Louis VII of France in 1174 (lines 5351-5352), and also names a Welsh king called \"Ris\", almost certainly Rhys ap Gruffydd (line 8942). He has a backhanded compliment for the well-known writer Walter Map, evidently a friend or rival: Sul ne sai pas de mentir l'art: Walter Map reset ben sa part (\"I am not the only one who knows the art of lying: Walter Map is equally good at it\" (lines 7185-7186).W. P. Ker in Folklore vol. 14 (1903) pp. 313-314 A certain \"Huge de Hungrie\" who appears in the poem as a seducer of women is generally thought to represent Hugh, canon of Hereford, another friend or rival.", "*A. J. Holden, ed., Ipomedon: poème de Hue de Rotelande (fin du XIIe siècle). Lutetiae: Klincksieck, 1979", "* Lucy M. Gay, \"Hue de Rotelande's Ipomédon and Chrétien de Troyes\" in PMLA vol. 32 (1917) pp. 468-491", "* Walther Hahn, Der Wortschatz des Dichters Hue de Rotelande. Berlin, 1910", "* Robert W. Hanning, \"Engin in Twelfth Century Romance: An Examination of the Roman d'Enéas and Hue de Rotelande's Ipomedon\" in Yale French Studies no. 51 (1974) pp. 82-101"]}, {"page": "Protheselaus", "response": ["Protheselaus is a verse romance composed in Anglo-Norman by Hue de Rotelande at the end of the 12th century. Hue lived at Credenhill near Hereford, according to his earlier poem Ipomedon. Protheselaus is dedicated to Hue's patron Gilbert fitzBaderon, lord of Monmouth. Gilbert died in or just before 1191: that date is a terminus ante quem for the completion of Protheselaus.", "*Franz Kluckow, ed., Hue de Rotelande: Protheselaus. Göttingen, 1924", "*A. J. Holden, ed., Protheselaus by Hue de Rotelande. London: Anglo-Norman Text Society. 3 vols", "* Walther Hahn, Der Wortschatz des Dichters Hue de Rotelande. Berlin, 1910", "* R. M. Spensley, \"Form and Meaning in Hue de Rotelande's Protheselaus\" in Modern Language Review vol. 67 (1972) pp. 763-774"]}, {"page": "Hue de rotelande", "response": ["#REDIRECT Hue de Rotelande "]}, {"page": "1522 in poetry", "response": ["* Robert Copland, Ipomadon, publication year uncertain; derived from the Anglo-Norman Ipomedon (c. 1190) of Hue de RotelandeCox, Michael, editor, The Concise Oxford Chronology of English Literature, Oxford University Press, 2004, "]}, {"page": "Ipomadon", "response": ["The Anglo-Norman romance Ipomedon by Hue de Rotelande, composed near Hereford around 1180, survives in three separate Middle English versions, a long poem Ipomadon composed in tail-rhyme verse, possibly in the last decade of the fourteenth century,Ousby, Ian.  1993, reprinted 2003. The Cambridge guide to literature in English. Cambridge University Press, p 474 a shorter poem The Lyfe of Ipomydon, dating to the fifteenth century and a prose version, Ipomedon, also of the fifteenth century.Purdie, Rhiannon. 2001.  Ipomadon. Oxford University Press for the Early English Text Society. In each case, the story is taken independently from the Anglo-Norman romance Ipomedon, written in Old French by Hue de Rotelande \"not long after 1180\", possibly in Herefordshire, England.Purdie, Rhiannon. 2001. p lxi. It is included in a list of the popular English romances by Richard Hyrde in the 1520s.Sanzhez-Mardi, Jordi. 2004. Reading romance in late medieval England: the case of the Middle English Ipomedon. In: Philological Quarterly. Winter 2004.", "The earliest of these surviving versions in Middle English is Ipomadon and occurs in the manuscript Chetham 8009 (Manchester), which contains a unique copy of an 8,891-line tail-rhyme romance, dating in composition to \"anywhere between the last decade of the fourteenth century and the middle of the fifteenth century\"Purdie, Rhiannon. 2001, p xi. This version of the tale follows Hue de Rotelande's story quite closely, although abridging it somewhat by cutting battle details and most of Hue's rather coarse or prosaic narrative intrusions.Purdie, Rhiannon. 2001, pp lxx–lxxx. Composed in a dialect that suggests that it was originally written by a West Yorkshireman in his native West Yorkshire, in the north of England, the manuscript copy itself dates to the late-fifteenth century,Purdie, Rhiannon. 2001, pp xviii–xxiv. is from a London Scriptorium and contains clues that the work from which this copy was taken had itself been re-copied, somewhere down the line, in the southwest of England.Purdie, Rhiannon. 2001, pp xxxvii–liv.", "The insistence of the hero Ipomadon, in this Middle English version, to conceal his identity from his lady love, even when he has won her fairly and unambiguously whilst fighting in disguise, at a tournament that has been put on especially for the purpose of selecting a husband for this young queen whom he loves, is treated slightly differently from its source.Purdie, Rhiannon. 2001. pp lxx–lxxx. The anonymous author of this Middle English poem chooses to try to rationalise this behaviour, where the original author Hue de Rotelande is happy to point to its irrationality. However, the \"lack of motivation for the hero's deception and delay does not detract significantly from the poem.\"", "The battle is long and hard, goes on for hundreds of lines, but at last, Ipomadon is victorious. Lyoline lies dead at his feet. But now a very curious thing happens, and one that Hue de Rotelande is happy to remain inexplicable, although the author of this Middle English tail-rhyme romance tries to convince us that it is through a lingering uncertainty on Ipomadon's part, a lack of certainty that he has truly accorded with the Proud's vow. Ipomadon goes to Lyoline's tent, takes up his banner and declares that Lyoline is victorious! Since their horses were slain from under them, we are told, nobody in the city has had any idea which knight is which:"]}, {"page": "Gilbert fitzBaderon", "response": ["Gilbert fitzBaderon of Monmouth (died about 1189) was one of the two sons of Baderon fitzWilliam by his wife Rohese de Clare. When Baderon died, at some date between 1170 and 1176, Gilbert succeeded him as lord of Monmouth and holder of Monmouth Castle. Gilbert is best known as a patron of literature and it was under Gilbert's patronage that the poet Hue de Rotelande wrote his verse romance Ipomedon, which was among the most popular works in its genre in medieval England. The original text in Anglo-Norman (a variant of Old French spoken and written in Norman England and Wales) was translated at least three times into Middle English under the variant title Ipomadon. Hue de Rotelande afterwards wrote a sequel, Protheselaus, which he dedicated to his patron Gilbert fitzBaderon."]}, {"page": "Hue (name)", "response": ["* Hue de Rotelande, late 12th century Cambro-Norman poet"]}]}}