{"wiki_id": "http://www.wikidata.org/entity/Q5345705", "itemLabel": "Edward Vaughan", "itemDescription": "Welsh lawyer and politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Edward_Vaughan_(died_1683)", "wikipedia_page": {"main": "Edward Vaughan (died 1683) was a Welsh lawyer and politician who sat in the House of Commons from 1679 to 1681.", "link_mentions": [{"page": "List of Lords Commissioners of the Admiralty", "response": ["**Edward Vaughan"]}, {"page": "Ceredigion (UK Parliament constituency)", "response": ["| Edward Vaughan"]}, {"page": "17th century in Wales", "response": ["*date unknown – Edward Vaughan (MP)"]}, {"page": "John Vaughan (chief justice)", "response": ["He was born in Ceredigion, Wales, the eldest of eight children of Edward Vaughan and his wife Letitia (Lettic) Stedman of Strata Florida, and was educated initially at The King's School, Worcester between 1613 and 1618, when he was admitted to Christ Church, Oxford. He attended until 1621, leaving without gaining a degree, and the same year was accepted into the Inner Temple."]}, {"page": "Knights of the Royal Oak", "response": ["* Edward Vaughan, Esq.  £1,000"]}, {"page": "John Vaughan, 1st Viscount Lisburne", "response": ["The son of Edward Vaughan and grandson of Sir John Vaughan, he was created Baron Fethard and Viscount Lisburne, in the Peerage of Ireland, on 5 June 1695. He represented Cardiganshire in the House of Commons from 1694 to 1698."]}, {"page": "Edward Vaughan", "response": ["Edward Vaughan may refer to:", "*Edward Vaughan (archdeacon)", "*Edward Vaughan (bishop) (died 1522), Welsh bishop of St David's", "*Edward Vaughan (of Llwydiarth) (died 1661), Welsh MP for Merioneth and Montgomeryshire", "*Edward Vaughan (died 1683), Welsh lawyer and politician", "*Edward Vaughan (died 1718), Welsh MP for Merionethshire, 1679–1718", "*Edward Vaughan (priest) (1776–1849), Anglican priest in India"]}, {"page": "List of MPs elected to the English Parliament in 1661", "response": ["| Vaughan replaced 1669 by Edward Vaughan", "| Edward Vaughan"]}, {"page": "Edward Vaughan (of Llwydiarth)", "response": ["Edward Vaughan (c.1600–1661) was a Welsh politician who sat in the House of Commons at various times between 1626 and 1661.", "In the Civil War, Vaughan was a captain in the Parliamentary army. In 1647 he was elected MP for Montgomeryshire as a recruiter for the Long Parliament. He was a commissioner  for North Wales in June 1648. He  voted in the House on 7 December 1648 \"that the King's answer to the proposition of both Houses was a ground for peace \" and as a result was secluded under Pride's Purge  and imprisoned. On 27 April 1649, the Committee for the Advance of Money ordered Edward Vaughan to be brought up in custody before them to answer certain matters touching his estates, as he had hitherto treated their orders with contempt. However he was an active commissioner of sequestration for Montgomeryshire and was \"commended for his diligence in seizing delinquents's estates,\" by the London commissioners on 19 September 1650.", "He was appointed to serve as High Sheriff of Montgomeryshire for 1658 but served the office for two years 1658–1660. In 1659 Vaughan was again elected MP for Montgomeryshire. A petition by John Griffiths in November 1660 asked for \"a warrant to recover from Edward Vaughan of Llwydiarth co. Montgomery, the balance of £1,600 received by him in 1648 as a commissioner for disbanding the army. He was elected MP for Montgomeryshire in  Apnl 1661 for the Cavalier Parliament and sat until his death a few months afterwards.\""]}, {"page": "Edward Vaughan (died 1718)", "response": ["Edward Vaughan (died 5 December 1718), of Glan-y-Llyn, Merionethshire and Llwydiarth, Montgomeryshire, was a Welsh Tory politician who sat in the English and British House of Commons for 43 years from 1675 to 1718. He was briefly Father of the House.", "Vaughan was the eldest son of Howel Vaughan of Glan-y-Llyn, Merioneth and his wife Elizabeth Jones, daughter of Humphrey Jones of Ddol, Flintshire. He inherited from his wife's uncle Edward Vaughan MP, the estates of Llwydiarth and Llangedwyn, Denbighshire in 1661 and succeeded his father in 1669. He married  Mary Purcell, daughter of John Purcell, MP of Nantcribba in 1672."]}]}}