{"wiki_id": "http://www.wikidata.org/entity/Q5481174", "itemLabel": "Francis Gulston", "itemDescription": "British rower", "wikipedia_url": "https://en.wikipedia.org/wiki/Francis_Gulston", "wikipedia_page": {"main": "Francis Stepney Gulston (September 1845 – 1917) was an English rower who at Henley Royal Regatta won the Grand Challenge Cup  five times, the Stewards' Challenge Cup ten times, and the Silver Goblets  five times.Gulston was born at Llandilofawr, the son  of Alan James Gulston of Woodland Castle, Swansea and of Llandilo, Carmarthenshire. His father was a landowner and was High Sheriff of Carmarthenshire in 1860. Gulston was educated at the Royal Naval School, and entered Magdalene College, Cambridge in 1863. It is said he went to Cambridge mainly and merely to row, and was recalled as taking up residence at the college with a pilot jacket on, a bottle of gin in one pocket and a bottle of bitters in the other. The authorities would hardly let him take part in a college crew, and would not consider him for the Cambridge eight because they thought his style was  too professional. He became a civil engineer and was in business in London in 1866. Accounts exist of his social life in London and WalesGulston was a member of the Oscillators Club of Surbiton and then joined London Rowing Club heralding ten years of success with Gulston in their crews. LRC won the Grand Challenge Cup at Henley Royal Regatta in 1868 and the Stewards Challenge Cup in 1868, 1869 and 1871. Also in 1871, Gulston won the Silver Goblets  partnering Albert de Lande Long. He was captain of London Rowing Club in 1872  when they won the Grand and Stewards and he won Silver Goblets with Long again. LRC won Stewards every year until 1878. Meanwhile Gulston and Long were runners up in Silver Goblets in 1873 to Clement Courtenay Knollys and A Trower and won in 1874. They were disqualified in the final of Silver Goblets in 1875 but Gulston won with S le B Smith in 1876.\nIn August 1876 Guslon, together with R H Labat, A Trower and J Rowell went to Philadelphia on the steam ship Wyoming to take part in the town's centennial regatta. Gulston took part in the single scull and in the double scull with Labat. Prior to the event the rowers went for a swim in the Harlem giving scope for the local newspapers to describe their physiques. The New York Times wrote of Gulston \"very much larger than the others His face is full with heavy whiskers and he is in all respects a thorough English oarsman. His shoulders and back are immense while he is not the least lacking in full development of  arms and legs.\"In 1877 LRC won the Grand as well as Stewards and in 1879 Gulston had his fifth win in Silver Goblets, this time partnering R H Labat. In 1878 and 1879, Gulston as captain of LRC was involved in meetings to set up the Amateur Rowing Association In 1881 Gulston was living in Putney with his wife and year old son.Gulston was later living at Salcombe, Devon where he died  at the age of 71. He was recalled as \"that finest – I make no exception – gentleman oarsman\".Gulston married Emma Elizabeth Davis at Putney in 1880. His brother Alan Stepney Gulston was an artist and author.", "link_mentions": [{"page": "Albert de Lande Long", "response": ["Long was born at Ipswich, the son of Peter Bartholemew Long, a solicitor, and his wife Hannah Justinia Falkland.British Census 1881 RG11 4899/98 p38 and RG11 1878/66 p 1 He was a member of the London Rowing Club and in 1868 partnered William Stout to win pairs at the Metropolitan Regatta. In 1869 he won the Silver Goblets at Henley Royal Regatta with Stout,Henley Royal Regatta Results of Final Races 1839–1939  the London Cup at the Metropolitan Regatta and the Wingfield Sculls.  He retained the Wingfield Sculls in 1870, but came third in the Diamond Challenge Sculls that year. In 1871 he won Silver Goblets at Henley with Francis Gulston, but lost the Wingfield Sculls to William Fawcus.Wingfield Sculls Record of Races He won the Silver Goblets again with Gulston in 1872 and 1874."]}, {"page": "James Hastie (rower)", "response": ["Hastie was born at sea, and became a brewers agent in London.British Census 1881 RG11 0662/35 p 16  He was a member of Thames Rowing Club where he was a long-standing captain.The New York Times December 10, 1897 In 1877 Hastie with W Eyre won Silver Goblets at Henley Royal Regatta beating Frank Lumley Playford and S Le B Smith in the final.Henley Royal Regatta Results of Final Races 1839–1939  He was captain of Thames in 1878 when he was involved in meetings to set up the Amateur Rowing AssociationWalter Bradford Woodgate Boating p 194  and to set a definition for amateur.Walter Bradford Woodgate Boating p 192  In 1879 with Eyre he was runner-up in Silver Goblets to Francis Gulston and R H Labat. However Hastie and Eyre won Silver Goblets in 1880 beating Alexander Payne and F D Leader in the final and in 1881 beating Playford and P Adcock in the final. He spent the night of the census in 1881 at the Thames Clubhouse in Putney."]}, {"page": "Stanley le Blanc Smith", "response": ["Smith, nicknamed \"Slebs\",R C Chambers Lehmann The Complete Oarsman joined London Rowing Club and was a member of the crews that won the Stewards' Challenge Cup at Henley Royal Regatta every year from 1872 to 1878. He also won Silver Goblets in 1876 with Francis Gulston although in 1877 with Frank Lumley Playford, he was runner up to James Hastie and W H Eyre of Thames Rowing Club.Henley Royal Regatta Results of Final Races 1839–1939  In 1878 Smith was the first secretary of the Metropolitan Rowing Association, which was to become  the Amateur Rowing AssociationWalter Bradford Woodgate Boating p 194"]}, {"page": "Alfred Trower", "response": ["Trower was born at 2 Southwick Place, Hyde Park, London, the son of Henry Trower, a wine merchant, and his wife Helen Seymour.the Peerage.com He joined Kingston Rowing Club making his first Henley appearance in 1870Bailys Magazine 1880 and in 1873 won Silver Goblets at Henley partnering Clement Courtenay Knollys to beat Albert de Lande Long and Francis Gulston in the finalHenley Royal Regatta Results of Final Races 1839–1939  In 1874 he partnered Mair but they lost the final easily to Long  and Gulston. Trower then transferred to London Rowing Club and in August 1876 Trower, together with Gulston, R H Labat,  and J Rowell went to Philadelphia on the steam ship Wyoming to take part in the town's centennial regatta. Trower  competed in the pairs with Rowell. Prior to the event the rowers went for a swim in the Harlem giving scope for the local newspapers to describe their physiques. The New York Times wrote of Trower \"The heavy man of the four, he is also the tallest\""]}, {"page": "Gulston", "response": ["*Francis Gulston (1845-1917), English rower"]}]}}