{"wiki_id": "http://www.wikidata.org/entity/Q5522960", "itemLabel": "Gareth Roberts", "itemDescription": "British physicist", "wikipedia_url": "https://en.wikipedia.org/wiki/Gareth_Roberts_(physicist)", "wikipedia_page": {"main": "Sir Gareth Gwyn Roberts  (16 May 1940 – 6 February 2007) was a Welsh physicist specialising in semiconductors and molecular electronics, who was influential in British science policy through his chairmanship of several academic bodies and his two reports on the future supply of scientists and how university research should be assessed. He was knighted in 1997 for his services to higher education.", "link_mentions": [{"page": "List of Welsh people", "response": ["*Gareth Roberts (1940–2007), physicist"]}, {"page": "University of Sheffield", "response": ["*1991: Gareth Roberts"]}, {"page": "Ulster University", "response": ["Notable current and former academics who have worked at Ulster include historian Antony Alcock, political scientist Monica McWilliams, poets Andrew Waterman and James Simmons, literary critic Walter Allen, physicist and subsequently Vice-Chancellor of the University of Sheffield, Gareth Roberts, mathematician Ralph Henstock, solar energy technologist and President of Dublin Institute of Technology, Brian Norton, law professors Brice Dickson and Denis Moloney, Professor of Nursing Research Brendan George McCormack. Turner Prize-nominated video artist Willie Doherty, Official War Artist Paul Seawright and live artist Anne Seagrave."]}, {"page": "Research Assessment Exercise", "response": ["The official Review of Research Assessment, the 2003 \"Roberts Report\" commissioned by the UK funding bodies,Review of research assessment  – report by Sir Gareth Roberts to the UK funding bodies, May 2003 recommended changes to research assessment, partly in response to such criticisms."]}, {"page": "Hermione Lee", "response": ["Since 1998, she has been the Goldsmiths' Professor of English Literature and the first woman professorial fellow of New College, Oxford.\"Hermione Lee\", Lannan. She succeeded Sir Gareth Roberts as the sixth president of Wolfson College, Oxford, in 2008, serving until the end of academic year 2016–17. She is a lifetime honorary fellow of the Rothermere American Institute at the University of Oxford.\"Distinguished Fellows\", Rothermere American Institute."]}, {"page": "Cyril Hilsum", "response": ["He currently serves as Chairman of the Scientific Board for Peratech and is a Visiting Professor of Physics at UCL, as well as sitting on the Defence Scientific Advisory Council. He also endorses the Karen Burt Memorial Award, named after his daughter, which is awarded yearly by the Women's Engineering Society 'to a woman engineer of high calibre who has newly attained full corporate membership and Chartered Engineer status through her relevant professional Institution and who has contributed to the promotion of the engineering profession'. In 2006 he was made a Fellow of the ESSCIRC, and in 2007 wrote an obituary for Gareth Roberts for The Guardian and the Royal Society."]}, {"page": "The Association for Science Education", "response": ["|Sir Gareth Roberts"]}, {"page": "1940 in the United Kingdom", "response": ["* 16 May – Gareth Roberts, Welsh-born physicist (died 2007)"]}, {"page": "Gareth Roberts", "response": ["Gareth Roberts may refer to:", "*Gareth Roberts (physicist) (1940–2007), British physicist, engineer, and President of Wolfson College, Oxford", "*Gareth Roberts (rugby union) (born 1959), Welsh rugby player", "*Gareth Roberts (writer) (born 1968), British television writer", "*Gareth Roberts (footballer) (born 1978), Welsh football player", "*Gareth Roberts (statistician) (born 1964), British professor and Director of the Centre for Research in Statistical Methodology at University of Warwick", "*Gareth Roberts (co-driver) (1987–2012), Welsh rally co-driver"]}, {"page": "I. M. Dharmadasa", "response": ["I.M. Dharmadasa is Professor of Applied Physics and leads the Electronic Materials and Solar Energy (solar cells and other Semiconductor Devices) Group at Sheffield Hallam University, UK. Dharme has worked in semiconductor research since becoming a PhD student at Durham University as a Commonwealth Scholar in 1977, under the supervision of the late Sir Gareth Roberts. His interest in the electrodeposition of thin film solar cells grew when he joined the Apollo Project at BP Solar in 1988. He continued this area of research on joining Sheffield Hallam University in 1990.", "Earlier in his career, Dharmadasa graduated from the University of Peradeniya in Sri Lanka by completing two B.Sc. Honours degrees covering chemistry, physics and mathematics. He won the Dr. Hewavitharana Memorial Prize for best performance for his physics special degree in 1975, and joined the academic staff of the Physics Department in the Science Faculty at the University of Peradeniya. After winning an open commonwealth scholarship in 1977, he completed his Ph.D. thesis in 1980, under the supervision of the late Sir Gareth Roberts and M. Petty, at the University of Durham (UK), before returning to his post in Sri Lanka. A deep research interest generated by his Ph.D. thesis led to his return to the UK in 1984, where he was an active solar energy researcher at the University College Cardiff and the British Petroleum Company, before joining Sheffield Hallam University in 1990."]}, {"page": "1940 in Wales", "response": ["*16 May - Sir Gareth Roberts, physicist (died 2007)"]}, {"page": "2007 in Wales", "response": ["*6 February - Sir Gareth Roberts, physicist, 66"]}, {"page": "Gareth Roberts (Scientist)", "response": ["#REDIRECT Gareth Roberts (physicist)"]}, {"page": "Deaths in February 2007", "response": ["*Sir Gareth Roberts, 66, British physicist and principal of Wolfson College, Oxford."]}, {"page": "Gareth Roberts (scientist)", "response": ["#REDIRECT Gareth Roberts (physicist)"]}, {"page": "List of Brasenose College, Oxford people", "response": ["* Gareth Roberts, Welsh physicist"]}, {"page": "Sir Gareth Roberts", "response": ["#REDIRECT Gareth Roberts (physicist)"]}, {"page": "Gareth Gwyn Roberts", "response": ["#REDIRECT Gareth Roberts (physicist)"]}, {"page": "Bangor University", "response": ["* Gareth Roberts, physicist and university administrator"]}, {"page": "Index of physics articles (G)", "response": ["*Gareth Roberts (physicist)"]}, {"page": "List of presidents of the Institute of Physics", "response": ["*1998–2000 Sir Gareth Roberts"]}]}}