{"wiki_id": "http://www.wikidata.org/entity/Q5545143", "itemLabel": "George Thomas", "itemDescription": "Welsh rugby union and rugby league footballer", "wikipedia_url": "https://en.wikipedia.org/wiki/George_Thomas_(rugby)", "wikipedia_page": {"main": "George W. Thomas (1881 – 3 July 1916), also known by the nicknames of \"Ponty\" and \"Stitch\", was a Welsh rugby union and professional rugby league footballer who played in the 1900s and 1910s. He played club rugby union (RU) for Pontnewydd RFC and Newport RFC, and representative level rugby league (RL) for Great Britain, Wales, Other Nationalities and Lancashire, and at club level for Warrington (Heritage No. 111), as a goal-kicking forward (prior to the specialist positions of; prop, hooker, second-row, loose forward), during the era of contested scrums.", "link_mentions": [{"page": "George Thomas", "response": ["George Thomas may refer to:", "*Sir George Thomas, 1st Baronet (died 1774), Deputy Governor of Pennsylvania 1738–1747, Governor of the Leeward Islands 1753–1766", "*Sir George Thomas, 3rd Baronet (c. 1740–1815), British MP for Arundel", "*George Thomas, 1st Viscount Tonypandy (1909–1997), British Labour Party politician, Speaker of the House of Commons", "*George Thomas (Indian politician) (1926–1993), Indian politician", "*Sir George Thomas, 7th Baronet (1881–1972), British chess and badminton player", "*George Thomas (American football) (1928–1989), American football halfback and defensive back", "*George Thomas (wide receiver) (born 1964), American football wide receiver", "*George Thomas (baseball) (born 1937), American baseball player", "*George Thomas (badminton) (born 1966), Indian badminton player", "*George Thomas (canoeist), canoer from New Zealand", "*George Thomas (English cricketer) (born 2003)", "*George Thomas (Indian cricketer), cricketer from India", "*George Thomas (footballer, born 1857) (1857–?), Welsh international footballer", "*George Thomas (footballer, born 1930) (1930–2014), Welsh football player for Newport County", "*George Thomas (footballer, born 1997), Welsh football player who plays for Queens Park Rangers", "*George Thomas (golfer), American golfer", "*George Thomas (rugby) (1881–1916), rugby union and rugby league footballer of the 1900s and 1910s for Pontnewydd (RU), Newport, Great Britain (RL), Wales, and Warrington", "*George Thomas (rugby union) (1857–1934), rugby union footballer of the 1880s and 1990s for Wales, and Newport", "*George Thomas (soldier) (c. 1756–1802), Irish mercenary, active in 18th century India, also known as the \"Irish Raja\"", "*George Thomas (entrepreneur), African-American valet, impresario in Russia under Tsar Nicholas II", "*George Thomas (educator) (died 1951), American academic administrator"]}, {"page": "Warrington Wolves", "response": ["In 1908, 14 November the first touring Australian rugby league team visited Warrington. The Kangaroos embarked upon a massive six months tour of Britain taking in 45 matches. Their timing was not good as the north of England was hit by strikes in the cotton mills, which badly affected attendances as fans could not afford to watch the pioneering Aussies. On Saturday 14 November 1908 Warrington played the Kangaroos. Warrington won the match 10–3, with Jackie Fish the hero scoring one try and Ike Taylor the other, Fish and George Dickenson kicked a goal each. A crowd of 5,000 watched the match at Wilderspool. The Warrington team that day was Jimmy Tilley, Jack Fish, George Dickenson, Ike Taylor, Lewis Treharne, Ernest Brooks, John Jenkins, William Dowell, Alfred Boardman, Billy O'Neill, George Thomas, Peter Boardman, and John Willie Chester. The Australians came back to Wilderspool for \"revenge\" later in the tour but tries from Jack Fish, and John Jenkins earned the 'Wirepullers' an 8–8 draw. Two members of the Kangaroo squad, Dan Frawley and Larry O'Malley later signed for Warrington and played the next season at Wilderspool. Warrington have the best record of any club side against the touring Kangaroos with eight wins, one draw, and seven defeats from sixteen matches.http://www.warringtonwolves.org/100-years-since-wire-took-on-the-aussies-for-the-first-time-2372", "* George Thomas 1903 to 1914"]}, {"page": "George Thomas (rugby union)", "response": ["George Thomas (1857 – 14 June 1934) was a Welsh international rugby union wing who played club rugby for Newport and international rugby for Wales. He was also a professional sprinter and was an All-England Sprint Champion.George Thomas player profile  Newport RFC"]}, {"page": "List of Great Britain national rugby league team players", "response": ["* George Thomas circa-1908"]}, {"page": "Albert Naughton", "response": ["Naughton was inducted into the Warrington Wolves Hall of Fame in 2006 alongside Parry Gordon and George Thomas."]}, {"page": "George Thomas (rugby league)", "response": ["#REDIRECT George Thomas (rugby)"]}]}}