{"wiki_id": "http://www.wikidata.org/entity/Q5623843", "itemLabel": "Gwyneth Keyworth", "itemDescription": "actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Gwyneth_Keyworth", "wikipedia_page": {"main": "Gwyneth Anjuli Keyworth (born 15 September 1990) is a Welsh actress. She was born in Aberystwyth and began acting in a local Welsh language youth theatre group. She went on to appear with the National Youth Theatre.Since graduating from the Royal Academy of Dramatic Art, she is perhaps best known for her roles on British TV programmes, including Misfits and The Great Outdoors. She has had film roles, including the 2012 cannibal horror thriller Elfie Hopkins and the 2014 comedy-drama Closer to the Moon. She has also appeared in stage shows, including the 2015 Shakespeare's Globe production of Helen Edmundson's The Heresy of Love and a production of Little Shop of Horrors. In 2014, she starred in The Vodka Diaries as Periel and, in 2015, she played Clea in Season 5 of the HBO series Game of Thrones.", "link_mentions": [{"page": "List of alumni of the Royal Academy of Dramatic Art", "response": ["*Gwyneth Keyworth (BA Acting 2014)"]}, {"page": "Screen International", "response": ["* Gwyneth Keyworth"]}, {"page": "Ysgol Gyfun Gymunedol Penweddig", "response": ["*Gwyneth Keyworth, actress"]}, {"page": "The Great Outdoors (British TV series)", "response": ["*Gwyneth Keyworth as Hazel Stevens"]}, {"page": "Nathan Young", "response": ["The group dig Nathan up after they receive a message from Superhoodie. Lucy (Evelyn Hoskins) begins causing trouble for the gang. Kelly Bailey (Lauren Socha) agrees to have sex with Nathan after months of flirting. Lucy, who is a shape shifter, takes on Kelly's form and causes trouble between the pair. Nathan discovers he has a younger brother, Jamie (Sam Keeley). Jamie and Lily (Catrin Stewart) join the group at a nightclub where they take drugs, reversing their powers. Lily's power of cryokinesis is reversed to pyrokinesis and while in a car with Jamie she sets fire to it, killing them both. Nathan, who also has the power of mediumship, sees Jamie's ghost who leads him to his father and they decide to give their relationship another try. Nathan falls in love with Simon Bellamy (Iwan Rheon) after Vince (Nathan Constance) uses his power to tattoo people and control how they feel. Nathan and Kelly decide to consummate their relationship, but Kelly changes her mind when she decides that it would be best if they were just friends. Nathan is killed and deduces it was Jessica (Zawe Ashton) who killed him. When Jessica shows interest in Simon, Nathan tries to warn him off, but Simon does not believe him. They later realise Dave (Adrian Rawlins) is responsible. Brian (Jordan Metcalfe) goes public about his power. The group are exposed and become famous. Brian becomes jealous of the group's fame and begins killing them. He reduces Nathan to a state of vegetation although Curtis rewinds this timeline. Nathan begins a relationship with Marnie (Gwyneth Keyworth), who is pregnant but has no clue who the father of her child is. To support her and her baby, he sells his power of immortality to Seth (Matthew McNulty). As a result of this Nikki (Ruth Negga) is killed. The group steal money that Elliot (Edward Hogg) has collected while falsely claiming to be Jesus Christ reborn to buy new super powers."]}, {"page": "List of British films of 2012", "response": ["|| Director: Ryan Andrews   Cast: Jaime Winstone, Ray Winstone, Steven Mackintosh, Rupert Evans, Kate Magowan, Aneurin Barnard, Kimberley Nixon, Gwyneth Keyworth"]}, {"page": "Elfie Hopkins", "response": ["* Gwyneth Keyworth as Ruby Gammon"]}, {"page": "When Will There Be Good News?", "response": ["*Gwyneth Keyworth as Reggie"]}, {"page": "Closer to the Moon", "response": ["* Gwyneth Keyworth as Lidia", "The film was written and directed by Nae Caranfil, and produced by Michael Fitzgerald, Denis Friedman, Renata Rainieri, Alessandro Leone and Bobby Paunescu through the production company Mandragora Movies. In August 2011, it was announced that Vera Farmiga and Mark Strong had been cast in leading roles as Alice Bercovich and Max Rosenthal, respectively. Later that month, it was reported that Harry Lloyd had joined the cast in the role of Virgil. The rest of the cast consisted of Anton Lesser, Joe Armstrong, Christian McKay, Monica Bîrlădeanu, John Henshaw, Gwyneth Keyworth and Stuart McQuarrie. Principal photography took place in Bucharest, Romania in late 2011. The production budget of the film has been estimated to be approximately US$5 million or €4.4 million."]}, {"page": "The Heresy of Love", "response": ["| Angelica || Sarah Ovens || Gwyneth Keyworth"]}, {"page": "Doctor Thorne (TV series)", "response": ["* Gwyneth Keyworth as Augusta Gresham"]}, {"page": "List of Welsh women", "response": ["*Gwyneth Keyworth (active since 2009), actress"]}, {"page": "Power Monkeys", "response": ["* Gwyneth Keyworth as Jackie of the Labour party, a far-left neo-communist who wants to tax old age."]}, {"page": "Wasted (British TV series)", "response": ["*Gwyneth Keyworth as Alison, tattoo artist and the oblivious object of Morpheus' affection."]}, {"page": "Pip Broughton", "response": ["In January 2021, S4C broadcast their first half-hour drama, Fflam, produced by Vox Pictures with two episodes written by Broughton and starring Richard Harrington, Gwyneth Keyworth and Memet Ali Alabora. In July 2021, post-production began on Vox Pictures' new thriller for BBC1, The Trick starring Jason Watkins, Victoria Hamilton, George MacKay and Jerome Flynn, inspired by the real-life events surrounding the 2009 Climategate email hack at the University of East Anglia."]}, {"page": "Hang the DJ", "response": ["Frank's next match Nicola (Gwyneth Keyworth) immediately disdains him, but they are paired for a year. Meanwhile, Amy finds her nine-month match Lenny (George Blagden) attractive. Amy and Frank meet again, at an event where a couple talk about their successful pairing. Amy begins to find Lenny's mannerisms tiresome, particularly his heavy exhalations. After the relationship ends, she is repeatedly matched with people for 36 hours; having sex with each match, she begins to dissociate over the matches' pointlessness."]}, {"page": "Bang (TV series)", "response": ["* Gwyneth Keyworth as Ela (series 1)"]}, {"page": "Hidden (2018 TV series)", "response": ["* Gwyneth Keyworth as Megan Ruddock, a first-year psychology student at Bangor University (Series 1)"]}, {"page": "Defending the Guilty", "response": ["*Gwyneth Keyworth as Danielle Sadler, a junior barrister and pupil"]}, {"page": "The Crown (season 3)", "response": ["* Gwyneth Keyworth as Gwen Edwards "]}, {"page": "The Trouble with Maggie Cole", "response": ["The Trouble with Maggie Cole is a British comedy-drama television series directed by Ben Gregor, and written by Mark Brotherhood. The show's first episode premiered on British television network ITV on 4 March 2020. It stars Dawn French in the role of Maggie Cole as well as Mark Heap, Julie Hesmondhalgh, Vicki Pepperdine, Patrick Robinson, Emily Reid and Gwyneth Keyworth.", "* Gwyneth Keyworth as Becka Cole"]}, {"page": "Keyworth (surname)", "response": ["*Gwyneth Keyworth (born 1990), Welsh actress"]}]}}