{"wiki_id": "http://www.wikidata.org/entity/Q57053098", "itemLabel": "Aaron Lewis", "itemDescription": "Welsh association football player", "wikipedia_url": "https://en.wikipedia.org/wiki/Aaron_Lewis_(footballer)", "wikipedia_page": {"main": "Aaron James Lewis (born 26 June 1998) is a Welsh professional footballer who plays for Newport County as a right back. He is a Wales Under-21 international.", "link_mentions": [{"page": "Kenny Morgans", "response": ["Morgans is the uncle of footballer Aaron Lewis."]}, {"page": "Aaron Lewis", "response": ["Aaron Lewis (born April 13, 1972) is an American singer, songwriter and musician who is best known as the lead vocalist, rhythm guitarist and founding member of the rock band Staind, with whom he released seven studio albums. Since 2010, he has pursued a successful solo career in country music with his debut EP Town Line, which was released on March 1, 2011 on Stroudavarious Records. Lewis' first full-length solo release, The Road, was released by Blaster Records on November 13, 2012.", "At the 2014 Kansas City Rockfest, during the performance of the song \"Something to Remind You\" from Staind's eponymous 2011 album, Aaron Lewis scolded some men for groping a teenage female fan while she was crowd surfing. His rant was met with applause from the audience.", "Aaron Lewis was due to take part in a solo performance in Oklahoma City when he took to the stage and was three minutes from finishing his performance before shouting at the unruly audience and storming off stage. Members of the audience can be heard shouting at the singer, causing him to stop playing and shout before more audience members hurled abuse at the singer. He tried to begin his song but, after the crowd refuses to be quiet, he drops his guitar on the ground and tosses a red drink cup into the audience before walking off stage.", "* Aaron Lewis lyrics"]}, {"page": "Olchfa School", "response": ["* Aaron Lewis, Football player."]}, {"page": "Swansea City A.F.C. Under-23s", "response": ["|Aaron Lewis"]}, {"page": "Wales national under-20 football team", "response": ["The Wales squad for the 2017 Toulon Tournament was announced in May 2017. Players born between 1 January 1997 and 31 December 1999 were eligible for the tournament. Ben Woodburn and Harry Wilson were not available due to their inclusion in the Wales senior squad. Rhys Norrington-Davies, Mitch Clark, David Brooks, Aron Davies and Matthew Smith withdrew from the squad, and were replaced by Cian Harries, Aaron Lewis, Keiran Evans, Chris Mepham and Lloyd Humphries respectively. "]}, {"page": "2018–19 Doncaster Rovers F.C. season", "response": ["|44||DF||Aaron Lewis||3||0||0||0||0||0||0||0||0||0||0||0||0||0||0||3||0||0", "| 3 January 2019 || RB ||  || Aaron Lewis || Swansea City || 31 May 2019 || "]}, {"page": "2018–19 Swansea City A.F.C. season", "response": ["| 3 January 2019 || DF ||  || Aaron Lewis || Doncaster Rovers || 31 May 2019 || ", "| 15 July 2018 || DF ||  || Aaron Lewis || 1 year || 30 June 2019 || "]}, {"page": "Lirak Hasani", "response": ["Hasani made his senior debut for Doncaster Rovers on 23 March 2019, in a 0–4 away league defeat at Luton Town, as a 72nd minute substitute for Aaron Lewis. Aged 16 at the time, he was voted Doncaster's 'Man of the Match' by the club's supporters, and was praised by manager Grant McCann for his performance."]}, {"page": "2019–20 Lincoln City F.C. season", "response": ["| 10 August 2019 || RB ||  || Aaron Lewis ||  Swansea City || Free transfer || "]}, {"page": "2019–20 Swansea City A.F.C. season", "response": ["| 1 July 2019 || RB ||  || Aaron Lewis || colspan=\"2\"|Released || "]}]}}