{"wiki_id": "http://www.wikidata.org/entity/Q5724046", "itemLabel": "Henry Jones", "itemDescription": "Welsh baker in Bristol, England", "wikipedia_url": "https://en.wikipedia.org/wiki/Henry_Jones_(baker)", "wikipedia_page": {"main": "Henry Jones (1812 – 12 July 1891) was a baker in Bristol, England, who was responsible in 1845 for inventing self-raising flour. He established a family business called Henry Jones (Bristol) Ltd. His flour meant that hard tack could have been removed from sailors of the British Navy but the admiralty resisted for some years.", "link_mentions": [{"page": "Flour", "response": ["In English-speaking countries, self-raising (or self-rising) flour is commercially available with chemical leavening agents already in the mix.Self-rising flour -Retrieved 2011-04-15Nigella Lawson -Retrieved 2021-03-13 In America, it is also likely to be pre-salted; in Britain this is not the case. The added ingredients are evenly distributed throughout the flour, which aids a consistent rise in baked goods. This flour is generally used for preparing sponge cakes, scones, muffins, etc. It was invented by Henry Jones and patented in 1845. If a recipe calls for self-raising flour, and this is not available, the following substitution is possible:"]}, {"page": "Baking powder", "response": ["He did not patent his discovery, and others such as Henry Jones of Bristol soon produced and patented similar products. In 1845, Jones patented \"A new preparation of flour\" (self-raising flour) that included sodium bicarbonate and tartaric acid to obtain a leavening effect."]}, {"page": "Caldicot, Monmouthshire", "response": ["Court House was the home of baker Henry Jones, the inventor of self-raising flour, from 1864 until his death in 1891. He is buried in the churchyard.Some Memorial Inscriptions, Caldicot, Monmouthshire"]}, {"page": "Alfred Bird", "response": ["* Henry Jones, a Bristol baker who patented self-raising flour in 1845, as a means of providing fresh bread on ships."]}, {"page": "August Oetker", "response": ["* Henry Jones, a Bristol baker who patented self-raising flour in 1845, as a means of providing fresh bread on ships."]}, {"page": "Wheat flour", "response": ["*Self-rising or self-raising flour is white flour that is sold premixed with chemical leavening agents. It was invented by Henry Jones. Self-rising flour is typically composed of the following ratio:"]}, {"page": "Gnosall", "response": ["*Coton Mill, where local rumours suggest self-raising flour was invented (despite strong evidence it was created in 1845, by Henry Jones, a baker in Bristol.) "]}, {"page": "Henry Jones", "response": ["Henry Jones may refer to:", "*Henry Jones (poet) (1721–1770), poet and dramatist, born Drogheda, Louth", "*Henry Jones (photographer) (1826–1911), commercial photographer in Victoria and South Australia", "*Henry Jones Thaddeus (1859–1929), Irish painter", "*Henry Jones (actor) (1912–1999), American stage, film and television actor", "*Henry Jones (B'nai Brith), founder of B'nai Brith in 1843", "*Henry Jones (baker) (1812–1891), creator of self-raising flour", "*Henry Jones (entrepreneur) (1862–1926), Australian entrepreneur", "*Henry Uliomereyon Jones, better known as Dr. Henry Jones, convicted of a fraudulent Ponzi scheme through Tri Energy", "*Sir Henry Jones of Oxfordshire (died 1673), English army officer", "*Henry Jones (lawyer) (died 1592), Welsh lawyer and clergyman", "*Henry Jones (Upper Canada politician) (1790–1860), politician in Upper Canada", "*Henry Jones (MP) (died 1792), British Member of Parliament for Devizes, 1780–1784", "*Sir Henry Jones (MP for Carmarthenshire) (?1532–1586), Welsh MP for Carmarthenshire, Cardiganshire and Old Sarum", "*Sir Henry Jones (philosopher) (1852–1922), Welsh philosopher and academic", "*Henry Jones (second baseman) (1857–1955), 19th-century baseball second baseman", "*Henry Jones (pitcher), 19th-century baseball pitcher", "*Henry Jones (cricketer) (born 1989), English cricketer", "*Henry Jones (writer) (1831–1899), authority on card games and tennis; wrote under the pseudonym Cavendish ", "*Henry Jones (American football) (born 1967), American National Football League (NFL) defensive back", "*Henry Jones (bishop) (c. 1605–1681), Church of Ireland bishop of Clogher and then of Meath", "*Henry Jones, Jr., better known as Indiana Jones", "*Henry Jones, Sr., the father of Indiana Jones", "*Henry Jones, III, better known as Mutt Williams, Indiana Jones' son", "*Henry Jones IXL, a manufacturer of jams, conserves and sauces in Australia"]}, {"page": "Reginald Baker (film producer)", "response": ["*Alice Diana Baker (1881–1969), wife of Herbert William Pride Jones, grandson of Henry Jones, inventor of self-raising flour."]}, {"page": "Cuisine of Monmouthshire", "response": ["White bread has a historical connection with the county. Henry Jones was the inventor of self raising flour, he was born in Monmouth and lived at Llanfihangel Rogiet. Jones was granted a patent for self raising flour in 1845 and was granted a Royal Warrant and appointed purveyor of patent flour and biscuits to Queen Victoria in 1846. His bakery was based at Broadmead in Bristol and his patent records are held at Bristol Archives (Bristol Archives online catalogue (Ref. 29932)) Jones worshipped at St Michael and All Angels Church, Llanfihangel Rogiet, which is now cared for by the Friends of Friendless Churches who have produced an online guide for visitors to the church.", "thumb|right| Advertisement for Henry Jones’ self raising flour, original held by Bristol Archives"]}]}}