{"wiki_id": "http://www.wikidata.org/entity/Q6176030", "itemLabel": "Jeffrey Hamm", "itemDescription": "British fascist politician (1915-1992)", "wikipedia_url": "https://en.wikipedia.org/wiki/Jeffrey_Hamm", "wikipedia_page": {"main": "Edward Jeffrey Hamm (15 September 1915 – 4 May 1992) was a leading British fascist and supporter of Oswald Mosley. Although a minor figure in Mosley's prewar British Union of Fascists, Hamm became a leading figure after the Second World War and eventually succeeded as leader of the Union Movement after Mosley's retirement.", "link_mentions": [{"page": "Diana Mitford", "response": ["Once again they were well known for entertaining, but were barred from all functions at the British Embassy. During their time in France, the Mosleys quietly went through another marriage ceremony; Hitler had safeguarded their original marriage licence, and it was never found after the war. During this period, Mosley was unfaithful to Diana, but she found for the most part that she was able to learn to keep herself from getting too upset regarding his adulterous habits. She told an interviewer, \"I think if you're going to mind infidelity, you better call it a day as far as marriage goes. Because who has ever remained faithful? I mean, they don't. There's passion and that's it.\" Diana was also a lifelong supporter of the British Union of Fascists (BUF), and its postwar successor the Union Movement, to which she made financial contributions until the 1994 death of its organiser Jeffrey Hamm."]}, {"page": "Colin Wilson", "response": [" Controversially, during the 1950s Wilson expressed critical support for some of the ideas of Oswald Mosley the leader of Union Movement and after Mosley's death in December 1980, Wilson contributed articles to Mosley's former secretary Jeffrey Hamm's Lodestar magazine.Skidelsky, Robert Oswald Mosley p.503, p.511, Lodestar No.1-Winter 1985/86, No.4-Autumn/Winter 1986, No.7-Winter 1987/88, No.8-Spring 1988, No.9-Summer 1988, No.11-Spring 1989,"]}, {"page": "British Union of Fascists", "response": ["* Jeffrey Hamm was a prominent member and later Mosley's personal secretary."]}, {"page": "Stanley, Falkland Islands", "response": ["During the Second World War, a hulk in Stanley Harbour was used for interning the British Fascist and Mosleyite Jeffrey Hamm.: The European; PRO HO A minor player in the British Union of Fascists (BUF) due to his youth, Hamm moved to the Falkland Islands in 1939 to work as a teacher. He was arrested there in 1940 for his BUF membership (under Defence Regulation 18B) and later transferred to a camp in South Africa. Released in 1941, he was later called up to the Royal Armoured Corps and served until his discharge in 1944.", "* PRO HO 45/25740 \"Jeffrey Hamm\" (British Public Records)"]}, {"page": "43 Group", "response": ["The 43 Group was an English anti-fascist group set up by Jewish ex-servicemen after the Second World War. They did this when, upon returning to London, they encountered British fascist organisations such as Jeffrey Hamm's British League of Ex-Servicemen and later Oswald Mosley's new fascist party, the Union Movement. The activities of these fascist groups included antisemitic speeches in public places, and from the rank-and-file fascists, violent attacks on London Jews and Jewish property. Group members broke up far-right meetings, infiltrated fascist groups, and attacked the fascists in street fighting.Adam Lent \"British Social Movements Since 1945: Sex, Colour, Peace and Power\". Macmillan p19,  "]}, {"page": "Colin Jordan", "response": ["At Cambridge Jordan formed a Nationalist Club,  from which he was invited to join the short-lived British People's Party, a group of former British Union of Fascists members led by Lord Tavistock, heir to the Duke of Bedford.Stephen L. Frost, Twaz a Good Fight: The Life of Colin Jordan, NS Press UK (2014),  pp. 29-34 After the Second World War Jordan joined the British League of Ex-Servicemen and Women, a pro-fascist group led by Sir Oswald Mosley's secretary, Jeffrey Hamm,Stephen L. Frost, Twaz a Good Fight: The Life of Colin Jordan, NS Press UK (2014), pp. 25-27 but Jordan soon became associated with Arnold Leese and was left a house in Leese's will. This became the Notting Hill base of operations when Jordan launched the White Defence League in 1956.Sykes, Alan The Radical Right in Britain Palgrave (2005), p99 Jordan later merged this party with the National Labour Party to form the British National Party in 1960,Sykes, Alan The Radical Right in Britain Palgrave (2005), p100 although he split from it after a quarrel with John Bean, who was opposed to Jordan's advocacy of National Socialism."]}]}}