{"wiki_id": "http://www.wikidata.org/entity/Q6235888", "itemLabel": "John Goulstone Lewis", "itemDescription": "Welsh rugby union player", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Goulstone_Lewis", "wikipedia_page": {"main": "John \"Johnny\" Goulstone Lewis (25 December 1859 – 9 May 1935) was a Welsh international rugby union half-back who played club rugby for Llanelli and international rugby for Wales. Lewis was also a cricketer, but only played at local level for Llanelli, though he was the first player to score a century at Stradey Park.", "link_mentions": [{"page": "John Lewis (disambiguation)", "response": ["*John Goulstone Lewis (1859–1935), Welsh international rugby union player"]}, {"page": "1935 in Wales", "response": ["*9 May – John Goulstone Lewis, Wales international rugby union player, 75"]}, {"page": "1859 in Wales", "response": ["*25 December - John Goulstone Lewis Wales international rugby union player (died 1935)"]}, {"page": "1887 Home Nations Championship", "response": ["Wales: Samuel Clark (Neath), Charles Taylor (Blackheath), Arthur Gould (Newport), George Bowen (Swansea), John Goulstone Lewis (Llanelli), William Stadden (Cardiff), William Williams (Cardiff), Evan Roberts (Llanelli), Alexander Bland (Cardiff), William Bowen (Swansea), D Morgan (Swansea), Edward Alexander (Cambridge Uni.), Tom Clapp (Newport) capt., William Towers (Swansea), Thomas William Lockwood (Newport)"]}, {"page": "William Stadden", "response": ["Stadden's next two matches for Wales were against Ireland as part of the 1887 Championship, partnered with John Goulstone Lewis, and Scotland in 1888 with Cardiff team-mate Jem Evans; both were Welsh wins. Towards the end of 1888, Wales hosted their first oversea's tourists when the New Zealand Native team visited Britain. Under the captaincy of Frank Hill, Stadden partnered Charlie Thomas in a Welsh win over the Māori team. Stadden's last games for Wales both came in the 1890 Home Nations Championship, the first was a loss to Scotland at the Cardiff Arms Park, the second was Wales' first ever win over England. Stadden was the Welsh hero of the match after scoring the only point of the game played in England at Dewsbury.History of Welsh Rugby Rugby Canada website Early in the second half, Stadden took a line out and motioned that he was going to throw the ball long. The Welsh and England lines both shuffled back expecting a long throw, for Stadden to bounce the ball into the ground close to his feet, regathering the ball he rushed past two defending players to score the winning try.Godwin (1984), pg 24. Bouncing the ball from the line out was banned under IRB rules in 1906."]}, {"page": "William Towers (rugby union)", "response": ["Towers originally played rugby for local club Hartlepool Rovers, and represented his county side, Durham. After moving to Wales, Towers switched to first-class Welsh team Swansea. It was while playing for Swansea that Towers was first selected to play for Wales in a game against Ireland as part of the 1887 Home Nations Championship. Towers was one of two new caps on the day, the other being Llanelli's John Goulstone Lewis. Under the captaincy of Tom Clapp, Wales beat the Irish team even though Ireland outscored Wales three tries to one; a peculiarity of the scoring system of the time."]}, {"page": "Jem Evans", "response": ["Evans was first selected for Wales in the opening game of the 1887 Home Nations Championship, played in Llanelli against the English team. Evans was partnered with team captain and Newport player Charlie Newman. The Welsh team held England to a nil - nil draw, their best result to that date, and Evans was reselected for the next game of the Championship, away to Scotland. On this occasion, Evans was partnered with new cap George Bowen of Swansea, the Welsh captaincy going to Bob Gould. The match was a humiliation for Wales, with Scotland running in 12 tries without reply. The Welsh selectors reacted with massive restructuring of the back positions, with only Arthur 'Monkey' Gould keeping his place. Bowen and Evans were replaced by John Goulstone Lewis and William Stadden."]}, {"page": "John Gouldstone Lewis", "response": ["#REDIRECT John Goulstone Lewis"]}]}}