{"wiki_id": "http://www.wikidata.org/entity/Q6290254", "itemLabel": "Joshua T. Owen", "itemDescription": "Welshman who became Union Army general", "wikipedia_url": "https://en.wikipedia.org/wiki/Joshua_T._Owen", "wikipedia_page": {"main": "Joshua Thomas Owen (March 29, 1822 – November 7, 1887) was an educator, politician, and soldier from Pennsylvania who served as a Union brigadier general during the American Civil War. He commanded the famed Philadelphia Brigade for part of the war, but was relieved of duty for alleged cowardice during battle.", "link_mentions": [{"page": "Alexander S. Webb", "response": ["During the Maryland Campaign and the Battle of Antietam, recently promoted to lieutenant colonel, he served as chief of staff in Maj. Gen. Fitz John Porter's V Corps. After Antietam, he was ordered to Washington, D.C., where he served as Inspector of Artillery. In January 1863 he was again assigned to the V Corps, now commanded by Maj. Gen. George G. Meade, and served again as chief of staff. During the Battle of Chancellorsville, Meade gave Webb temporary command of Brig. Gen. Erastus B. Tyler's brigade and thrust him into battle. He performed well and Meade in his report on the battle paid particular detail to Webb's \"intelligence and zeal\". On July 1, 1863, President Abraham Lincoln appointed Webb brigadier general, to rank from June 23, 1863.Eicher, John H., and David J. Eicher. Civil War High Commands. Stanford, CA: Stanford University Press, 2001. . p. 730President Lincoln nominated Webb for appointment to the grade of brigadier general on December 31, 1863, and the U.S. Senate confirmed the appointment on August 1, 1864. Eicher, 2001, p. 730 Three days before the Battle of Gettysburg, Brig. Gen. John Gibbon arrested the Philadelphia Brigade's commander, Brig. Gen. Joshua T. Owen, and Webb was given command of the brigade (the 2nd Brigade, 2nd Division, II Corps). Initially, the brigade resented having the meticulously groomed and well-dressed Webb as their commanding officer, but he soon earned their respect through his attention to detail, his affability, and his discipline."]}, {"page": "California in the American Civil War", "response": ["In October 1861, Colonel Baker was authorized to increase his command to a brigade. The additional regiments were commanded by Colonels Joshua T. Owen, DeWitt Clinton Baxter, and Turner G. Morehead, all from Philadelphia, respectively designated the 2nd, 3rd, and 5th California Regiments. The 4th California Regiment, as planned, was composed of artillery and cavalry. These troops were soon detached. After Baker was killed in the Battle of Ball's Bluff, Pennsylvania claimed these four infantry regiments as a part of its quota, and they became known as the \"Philadelphia Brigade\" of Pennsylvania Volunteers. They were initially commanded by Brig. Gen. William W. Burns and first served in John Sedgwick's Division of the II Corps, Army of the Potomac. They had a distinguished service career, highlighted by their actions at the Battle of Antietam and their prominent position in the defense against Pickett's Charge at the Battle of Gettysburg."]}, {"page": "Laurel Hill Cemetery", "response": ["*Joshua T. Owen (1822–1887), Union brigadier general during the Civil War"]}, {"page": "Philadelphia Brigade", "response": ["At the Battle of Antietam, the brigade, now commanded by Brig. Gen. Oliver O. Howard, was part of Maj. Gen. John Sedgwick's attack near the West Woods. The division ran into stiff resistance and was then attacked in the flank. Most of the division was routed, including the Philadelphia Brigade; some companies had no time to return fire before being caught up in the rout. The brigade lost 545 men in as little as ten minutes.Sears (1983), p. 250 - 251. When Sedgwick was wounded during the battle, Howard took command of his division and Colonel Joshua T. Owen of the 69th regiment took command of the brigade. In the Battle of Fredericksburg the following December, the brigade participated in the assault on Marye's Heights. The 71st regiment was assigned provost duty in the city, so Howard transferred the 127th Pennsylvania to the brigade to replace it. The Philadelphia Brigade made it part way up the slope of the ridge but the rest of division failed to advance at the same time; both this and Confederate fire halted its advance. During the battle, the brigade lost 258 men, with the 127th Pennsylvania suffering 146 casualties.O'Reilly, pp. 325-327, 351. During the Battle of Chancellorsville in May 1863, Brig. Gen. John Gibbon's division (of which the brigade was a part) initially remained in their winter camps to act \"as a decoy while the rest of the army marched.\"Sears (1996), p. 310. On May 3, the division supported Major General John Sedgwick's attack on the Confederate rearguard at Fredericksburg and remained in the city afterwards to guard the city and the bridges across the river.Sears (1996), p. 377.", "thumb|right|upright=0.8|alt=Photo of man in moustache in Civil War era Brigadier General USA uniform|Joshua T. Owen, who commanded the brigade for the greater part of the war", "Just before the Battle of Gettysburg, Brig. Gen. Joshua T. Owen was relieved of command and replaced by Brig. Gen. Alexander S. Webb, in the hopes of improving the discipline of the brigade. During the battle, it defended Cemetery Ridge near the famous Angle on July 2 and July 3, 1863. On the evening of July 2, it helped drive Brig. Gen. Ambrose R. Wright's brigade back after it captured a portion of the ridge and recaptured a cannon. The 106th advanced as far as the Codori Barn near the Emmitsburg Road and the 72nd advanced just over the stone wall, before both regiments withdrew to their previous positions.Pfanz, p. 417, 419.", "*Brigadier General Joshua T. Owen — September 1862 - June 1863", "*Brigadier General Joshua T. Owen — August 1863 - June 1864"]}, {"page": "69th Pennsylvania Infantry Regiment", "response": ["The 69th Pennsylvania was recruited from Philadelphia Irish militia companies of the 2nd Regiment, Pennsylvania Militia. It was mustered into service on August 19, 1861, with Joshua T. Owen as its first colonel. Many of its members had served in the 24th Pennsylvania, a three-month volunteer regiment.  The unit was first designated the 2nd California. It left for Washington, D.C. that September, before being assigned to the Army of the Potomac in October as part of Colonel Edwin Baker's California Brigade. The regiment’s first action was at the Battle of Balls Bluff. After this battle, its name was changed to the 68th Penna. for a short time and then the 69th. They made an attempt with the 69th New York to form an Irish Brigade, but Governor Andrew Gregg Curtin of Pennsylvania opposed the idea, which led to the proposal being dropped. The 68th had their regimental designation changed to the 69th in honor of the 69th New York Infantry."]}, {"page": "Antietam Union order of battle", "response": ["Col Joshua T. Owen", "* 69th Pennsylvania: Col Joshua T. Owen"]}, {"page": "Chancellorsville Union order of battle", "response": ["BG Joshua T. Owen"]}, {"page": "Fredericksburg Union order of battle", "response": ["Col Joshua T. Owen"]}, {"page": "Wilderness Union order of battle", "response": ["BG Joshua T. Owen"]}, {"page": "Spotsylvania Court House Union order of battle", "response": ["BG Joshua T. Owen", "BG Joshua T. Owen"]}, {"page": "1887 in Wales", "response": ["*7 November – Joshua T. Owen, Welsh-born educator, politician, and soldier in the Union army during the American Civil War, 66"]}, {"page": "Cold Harbor Union order of battle", "response": ["BG Joshua T. Owen", "BG Joshua T. Owen"]}, {"page": "Joshua (name)", "response": ["*Joshua T. Owen (1822–1887), American (Union) Civil War brigadier general"]}, {"page": "Seven Days Union order of battle", "response": ["*\t69th Pennsylvania: Col Joshua T. Owen"]}, {"page": "Joshua Thomas Owen", "response": ["#REDIRECT Joshua T. Owen"]}, {"page": "Bristoe campaign Union order of battle", "response": ["BG Joshua T. Owen"]}, {"page": "Mine Run campaign Union order of battle", "response": ["BG Joshua T. Owen"]}, {"page": "Ball's Bluff Union order of battle", "response": ["*2nd California Infantry: Col Joshua T. Owen"]}, {"page": "Joshua Owen", "response": ["#redirect Joshua T. Owen"]}, {"page": "Peninsula campaign Union order of battle", "response": ["* 69th Pennsylvania: Col Joshua T. Owen"]}, {"page": "Hoke's Run Union order of battle", "response": ["* 24th Pennsylvania: Col Joshua T. Owen"]}, {"page": "Seven Pines Union order of battle", "response": ["* 69th Pennsylvania: Col Joshua T. Owen"]}, {"page": "General Owen", "response": ["*Joshua T. Owen (1822–1887), Union Army brigadier general"]}]}}