{"wiki_id": "http://www.wikidata.org/entity/Q6306064", "itemLabel": "Jules Williams", "itemDescription": "Welsh writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Jules_Williams", "wikipedia_page": {"main": "Julian Lloyd \"Jules\" Williams (born 23 July 1968) is a British writer, director, and producer. He has collaborated with best selling authors, he wrote both the Living The Life accompanying book and The Weigh Forward, and is the Director and Producer of Sky Arts 1 & Back Door Productions Living The Life.\nIn February 2009, Williams was invited to test the credibility of his profession when BBC's Newsnight ran a feature on the practice of remote viewing.", "link_mentions": [{"page": "Abergavenny", "response": ["* Jules Williams (born 1968), writer, director, and producer of The Weigh Forward."]}, {"page": "Leslie Phillips", "response": ["Phillips, in conjunction with Jules Williams and Back Door Productions, co-produced the Sky Arts series Living The Life which ran for three series."]}, {"page": "Bath Spa University", "response": ["*Jules Williams, writer, Director, Producer author of The Weigh Forward"]}, {"page": "Stephen Gately", "response": ["The Tree of Seasons was written in collaboration with June Considine and Jules Williams.page 1V The Tree of Seasons published by Hodder and Stoughton Ltd. Based on Gately's handwritten notes – the day he died he had just worked out the ending. The book released in the UK and Ireland on 13 May 2010, published by Hodder & Stoughton. It contains a foreword by Elton John and David Furnish, and is illustrated by Keith Wilson. The Tree of Seasons remained a bestseller and a top-ten seller for three consecutive weeks. The paperback version was released in April 2011."]}, {"page": "List of people with surname Williams", "response": ["*Jules Williams (born 1968), British writer, director and producer"]}, {"page": "The Tree of Seasons", "response": ["Following Gately's death in Spain in October 2009, the final drafts of The Tree of Seasons were completed in collaboration with June Considine.com June Considine and Jules Williams, with Andrew Cowles writing the acknowledgements.Reference page 1V The Tree of Seasons, published by Hodder and Stoughton Ltd."]}, {"page": "Jules williams", "response": ["#REDIRECT Jules Williams "]}, {"page": "Living the Life", "response": ["Living the Life is a production of Back Door Productions.  Executive Producer Rosemary Reed and Director Jules Williams produce the show out of their Pinewood Studios location.  The first season premiered on 6 November 2011,", "Season 1 of Living the Life was released on DVD exclusively through Tesco Entertainment.  The DVD set included four bonus episodes and an accompanying behind-the-scenes book, Living the Life written by director Jules Williams."]}]}}