{"wiki_id": "http://www.wikidata.org/entity/Q634405", "itemLabel": "Paul Aurelian", "itemDescription": "Welsh bishop of Léon, Brittany", "wikipedia_url": "https://en.wikipedia.org/wiki/Paul_Aurelian", "wikipedia_page": {"main": "Paul Aurelian (known in Breton as Paol Aorelian or Saint Pol de Léon and in Latin as Paulinus Aurelianus) was a 6th-century Welshman who became first bishop of the See of Léon and one of the seven founder saints of Brittany. He allegedly died in 575, rumoured to have lived to the age of 140, after having been assisted in his labors by three successive coadjutors. This suggests that several Pauls have been conflated.  Gilbert Hunter Doble thought that he might have been Saint Paulinus of Wales.\n\n", "link_mentions": [{"page": "March 12", "response": ["**Paul Aurelian"]}, {"page": "Glamorgan", "response": ["The region originated as an independent petty kingdom named Glywysing, believed to be named after a 5th-century Welsh king called Glywys, who is said to have been descended from a Roman Governor in the region. Saint Paul Aurelian was born in Glamorgan in the 6th century. The names  ( + territorial suffix , 'territory of Morgan') and  ( + , 'land of Morgan') reputedly derive from the 8th-century king Morgan ab Athrwys, otherwise known as \"Morgan Mwynfawr\" ('great in riches') who united Glywysing with the neighbouring kingdoms of Gwent and Ergyng, although some have argued for the similar 10th-century ruler Morgan Hen. It is possible it was only the union of Gwent and Glywysing that was referred to as Morgannwg.Wendy Davies. (1982). Wales in the Early Middle Ages. London: Leicester University Press By virtue of its location and geography, Morgannwg or Glywysing was the second part of Wales, after Gwent, to fall under the control of the Normans and was frequently the scene of fighting between the Marcher Lords and Welsh princes.William Rees. (1951). An Historical Atlas of Wales. Cardiff: University College"]}, {"page": "Celtic Christianity", "response": ["Illtud, said to have been an Armorican by descent, spent the first period of his religious life as a disciple of St. Cadoc at Llancarvan. He founded the monastery at Llantwit Major. The monastery stressed learning as well as devotion. One of his fellow students was Paul Aurelian, a key figure in Cornish monasticism. Gildas the Wise was invited by Cadoc to deliver lectures in the monastery and spent a year there, during which he made a copy of a book of the Gospels, long treasured in the church of St. Cadoc. One of the most notable pupils of Illtyd was St. Samson of Dol, who lived for a time the life of a hermit in a cave near the river Severn before founding a monastery in Brittany."]}, {"page": "Gildas", "response": ["The First Life of Gildas was written by an unnamed monk at the monastery which Gildas founded in Rhuys, Brittany in the 9th century. According to this tradition, Gildas is the son of Caunus, king of Alt Clut in the Hen Ogledd, the Brythonic-speaking region of northern Britain. He had four brothers; his brother Cuillum ascended to the throne on the death of his father, and the rest became monks. Gildas was sent as a child to the College of Theodosius (Cor Tewdws) in Glamorgan, under the care of St Illtud, and was a companion of St Samson of Dol and St Paul Aurelian. His master Illtud loved him tenderly and taught him with special zeal. He was supposed to be educated in liberal arts and divine scripture, but elected to study only holy doctrine, and to forsake his noble birth in favour of a religious life."]}, {"page": "Llantwit Major", "response": ["Under Illtud and his successors, Bangor Illtyd and the monastery grew in reputation both as the origin of many prominent Celtic evangelists and as a major centre of scholarly education. As such, it began to attract scholars from across the Celtic and wider world. The college itself was said to be the oldest in the world, consisting of seven halls, 400 houses and more than 2000 students at its peak, including seven sons of British princes, and scholars such as St. Patrick, St. Paul Aurelian, the bard Taliesin, Gildas the historian, Samson of Dol, and St. David are believed to have spent some time there. Samson was known to have been summoned by Dyfrig to join the monastery in 521 and he was briefly elected abbot before leaving for Cornwall. King Hywel ap Rhys (d. 886) was buried at the monastery.", "The foundation of St. Illtyd's Church dates back to the Age of the Saints in early Welsh Christianity and thus by its very existence provides evidence of continuity with sub-Roman Christianity. The town grew up around the Bangor Illtyd (\"Illtyd's college\"). Saint David, Saint Samson, Saint Paul Aurelian, Saint Gildas, Saint Tudwal, Saint Baglan and king Maelgwn Gwynedd are said to have studied at the divinity school. It  was  founded around AD 508 by St Illtyd as a centre of learning. The school is said to have stood on the north side of the churchyard; and the monastery was situated north of the tithe barn on Hill Head."]}, {"page": "Dolly Pentreath", "response": ["Dolly Pentreath was buried at Paul, where in 1860 a monument in her honour was set into the churchyard wall of the church of St Paul Aurelian by Louis Lucien Bonaparte, a nephew of Napoleon, and by the Vicar of Paul of the time. It read: "]}, {"page": "Christian monasticism", "response": ["Illtyd spent the first part of his religious life as a disciple of Cadoc at Llancarfan. He founded the monastery at Llanilltyd Fawr. One of his students was Paul Aurelian, a key figure in Cornish monasticism.Thurston, Herbert. \"Welsh Church.\" The Catholic Encyclopedia. Vol. 15. New York: Robert Appleton Company, 1912. 19 Nov. 2013 Gildas the Wise was also a student at Llanilltyd Fawr, as was Samson of Dol. Samson founded a monastery in an abandoned Roman fort near the river Severn and lived for a time the life of a hermit in a nearby cave before going to Brittany."]}, {"page": "Flag of Devon", "response": ["*12 March - Paul Aurelian, brother of St Sidwell"]}, {"page": "Paulinus", "response": ["*Paul Aurelian or Paulinus Aurelianus"]}, {"page": "Mount's Bay", "response": ["In the churchyard wall of the church of St. Paul Aurelian in Paul is the 1860 monument to Dolly Pentreath, according to tradition the last native speaker of the Cornish language."]}, {"page": "Illtud", "response": ["Illtud helped pioneer the monastic life of Wales by founding a monastery in what is now Llantwit Major. This became the first major Welsh monastic school, and was a hub of Celtic Christianity in Sub-Roman Britain. Illtud's own pupils are reckoned to have included seven sons of British princes and scholars such as Saint Patrick, Paul Aurelian, Taliesin, Gildas and Samson of Dol. Saint David is also believed to have spent some time there."]}, {"page": "Saint Paulinus", "response": ["*Paul Aurelian or Paulinus Aurelianus, 6th-century Welshman who became first bishop of the See of Léon and one of the seven founder saints of Brittany"]}, {"page": "Pol Aurélien", "response": ["#REDIRECT Paul Aurelian"]}, {"page": "St Illtyd's Church, Llantwit Major", "response": ["Saint David, Saint Samson, Saint Paul Aurelian, Gildas the Historian, Saint Tudwal, Saint Baglan and king Maelgwn Gwynedd. The ruins of the school are believed to be in a garden on the north side of the churchyard, and the monastery was situated north of the tithe barn on Hill Head."]}, {"page": "Paul, Cornwall", "response": ["Much of the history of Paul is connected with its parish church. The church itself is said to have been founded in 490, a very uncertain date and not documented, by Paul Aurelian, a Welsh saint known in Brittany as Paol Aurelian in Breton. There is no historical evidence to support his ever coming to West Penwith. He was founder of the cathedral at Saint-Pol-de-Léon, the city named after him. However this church could have been dedicated to Paul the Apostle, or Paulinus of York, there is no documentary evidence to prove any of these three Saint Pauls was the original dedicatee of the church. It was only named 'St. Pol-de-Leon' in 1907 and is probably connected with Henry Jenner who (with W. C. Borlase) opposed alleged 'Englishness' and consistent spelling of Cornish place names on OS maps."]}, {"page": "List of royal saints and martyrs", "response": ["*Paul Aurelian, 6th century Bishop in Brittany, son of Perphirius of Penychen"]}, {"page": "Saint-Pol-de-Léon", "response": ["It is noted for its 13th-century cathedral on the site of the original founded by Saint Paul Aurelian in the 6th century. It has kept a unique architecture, such as Notre-Dame du Kreisker Chapel, an 80 m high chapel, which is the highest in Brittany. It was also the scene of a battle during the Breton War of Succession, where the Montfortists and their English allies defeated an army led by Charles of Blois.", "The city takes its present name of one of the legendary founder saints of Brittany: Saint Paul Aurelian. The Latin name given to the entire region is now the Leon (\"Pays Léonard\"). It was long the seat of a bishop, now merged into the Roman Catholic Diocese of Quimper. The city later became a sort of religious capital."]}, {"page": "Bretons", "response": ["* Paul Aurelian, at Saint-Pol-de-Léon (Breton: Kastell-Paol),", "There is an ancient pilgrimage called the Tro Breizh (tour of Brittany) which involves pilgrims walking around Brittany from the grave of one of the Seven Founder Saints to another. Nowadays pilgrims complete the circuit over the course of several years. In 2002, the Tro Breizh included a special pilgrimage to Wales, symbolically making the reverse journey of the Welshmen Paul Aurelian, Brioc, and Samson. According to Breton religious tradition, whoever does not make the pilgrimage at least once in his lifetime will be condemned to make it after his death, advancing only by the length of his coffin each seven years.Bretagne: poems (in French), by Amand Guérin, published by P. Masgana, 1842: page 238."]}, {"page": "Roman Catholic Diocese of Quimper", "response": ["There is evidence that Christianity was preached in Léon twenty years before the evangelization of Cornouaille, but ancient Breton chronology is very uncertain. The legend of St. Paul Aurelian, written in 884, shows that the Breton monks believed the See of Léon had been founded in the Merovingian epoch. The hermit Saint Ronan, a native of Ireland, often held to be one of the 350 bishops consecrated by Saint Patrick, was in the fifth century known as one of the apostles of Cornouailles and the neighbourhood around Léon. Paul Aurelian, a Gallic monk, founder of monasteries at Ouessant on the north-west coast of Brittany and on the Island of Batz, was believed to have founded in an abandoned fort a monastery which gave origin to the town of St. Pol de Léon, afterwards the seat of a diocese. He was the first titular of the see, a wonder-worker and prophet, and was held to have died in 575 at the age of 140 years, after having been assisted in his labours by three successive coadjutors. Though the monastery of Léon was probably founded by Paul Aurelian in the sixth century, the history of the diocese is more complicated. It is at least certain that there are traces in history of a Diocese of Léon as far back as the middle of the ninth century."]}, {"page": "March 12 (Eastern Orthodox liturgics)", "response": ["* Saint Paul Aurelian (Paul de Léon), Bishop of Léon in Brittany, Confessor (572)Rev. Sabine Baring-Gould (M.A.). \"S. PAUL OF LEON, B. C. (A.D. 573.).\" In: The Lives of the Saints. Volume the Third: March. London: John C. Nimmo, 1897. pp. 223-226.", "File:Saint Pol Aurelien.jpg|Saint Paul Aurelian (Paul de Léon), Bishop of Léon."]}, {"page": "Pol de Leon", "response": ["#REDIRECT Paul Aurelian"]}, {"page": "Pol Aurelian", "response": ["#REDIRECT Paul Aurelian"]}, {"page": "Paulinus of Wales", "response": ["#Redirect Paul Aurelian"]}, {"page": "Rosnat", "response": ["Mrs. Dawson, writing in the Archaeologia Cambrensis, argues for Ty Gwyn, in Pembrokeshire, pointing out that \"Ty Gwyn\" is Welsh for \"White House\". According to John Francis Shearman, the most celebrated abbot of Ty Gwyn was Pawl Hen, also known as Paulinus of Wales or Paulinus of the North (sometimes identified with Paul Aurelian), which he then identified with Ty Gwyn ar Daf in Carmarthenshire. Ty Gwyn ar Dar, which means \"White House on the River Taf\", is now known as Whitland. Dawson maintains that Shearman is correct in naming Pawl Hen as founder of the monastery, but incorrect in placing Pawl Hen in that Ty Gwyn."]}, {"page": "Category talk:French saints", "response": ["Paul AurelianStub"]}, {"page": "Category talk:British saints", "response": ["Paul AurelianStub"]}, {"page": "Juthwara", "response": ["Juthwara's name is how she is known in Anglo-Saxon.  Some have suggested that it is a corruption of the British Aud Wyry (meaning Aud the Virgin),St. Aude Wyry alias St. Juthwara. the name by which she is known in Brittany. However, since Aud Wyry simply means \"Aud the Virgin\" (Aud is a Germanic name used in Northern France and not a Celtic name) it is more likely that Aud Wyry is a Breton reinterpretation of her original name. She was said to have been the sister of Paul Aurelian, Sidwell of Exeter and Wulvela but this is debated."]}, {"page": "Insular monasticism", "response": ["Illtud received the tonsure from Dyfrig, Archbishop of Llandaff, and then went to study under Cadoc at Llancarvan. He was subsequently ordained priest by Germanus of Auxerre. Around 500, Illtud, founded a monastery called Cor Tewdws at Llanilltud Fawr. Its school was a primary learning center of Sub-Roman Britain, but was situated on the Glamorgan Plain exposed to hostile incursions from Irish pirates, and to Viking raids. The course of studies at Llaniltyd (and this also applies to the other monasteries) included Latin, Greek, rhetoric, philosophy, theology, and mathematics. Saint Patrick, Paul Aurelian, the bard Taliesin, and Magloire, are believed to have spent some time there.Hall, Samuel Carter. The Book of South Wales, the Wye, and the Coast, Virtue & Company, 1861, pp. 252et seq. Samson of Dol was known to have been summoned by Dyfrig to join the monastery in 521 and he was briefly elected abbot before leaving for Cornwall.Chandlery, Peter. \"Welsh Monastic Foundations.\" The Catholic Encyclopedia Vol. 15. New York: Robert Appleton Company, 1912. 13 January 2020"]}, {"page": "Category talk:Ancient Christian denominations", "response": ["Paul AurelianStart"]}, {"page": "Chronological list of saints in the 6th century", "response": ["|Paul Aurelian|| || ||573|| || Bishop of León"]}, {"page": "Saint-Pol-de-Léon Cathedral", "response": ["Saint Paul Aurelian Cathedral (Cathédrale Saint-Paul-Aurélien) was a Roman Catholic cathedral, now basilica, in Saint-Pol-de-Léon, in the Finistère department in Brittany in north-western France. The 13th-century church stands on the site of the original church founded by Saint Paul Aurélien in the 6th century. It is a listed monument since 1840.", "It is dedicated to its 6th-century founder, the first bishop Saint Paul Aurelian. He was originally from Wales and is considered to have been the first bishop of the Léon area. We know something of Aurélien's life thanks to a manuscript written in 884 by a Landévennec monk.  Paul Aurélien was born in Wales in around 490, and educated at the Saint Iltud school. He was ordained as a priest and in 525 left Wales for the continent with a dozen companions. He landed at the Ile d'Ouessant and preached along the north Finistère coast up to the Île de Batz.  According to legend, he helped free the Île de Batz from a dragon which was terrorising the local population."]}, {"page": "Saint Paul Aurelian", "response": ["#redirect Paul Aurelian"]}, {"page": "Paulinus of wales", "response": ["#REDIRECT Paul Aurelian "]}, {"page": "St. Paul Aurelian", "response": ["#REDIRECT Paul Aurelian"]}]}}