{"wiki_id": "http://www.wikidata.org/entity/Q6388417", "itemLabel": "Ken Rowlands", "itemDescription": "British Boxer", "wikipedia_url": "https://en.wikipedia.org/wiki/Ken_Rowlands", "wikipedia_page": {"main": "Ken Rowlands (born 3 July 1927) was a Welsh light heavyweight boxer. Born in Maerdy in the Rhondda Valley but fighting out of Luton in England, Rowland's professional career spanned from 1948 to 1958. He first won the Welsh light heavyweight title in 1953, but after losing the title, retook it again in 1955.", "link_mentions": [{"page": "1927 in the United Kingdom", "response": ["**Ken Rowlands, Welsh boxer "]}, {"page": "Noel Trigg", "response": ["Trigg's first professional loss came in late 1955 when he lost by technical knockout to Portsmouth-based fighter Johnny Smith. A rematch was arranged for January 1956, but again Trigg lost, this time stopped by a gashed eyebrow in the sixth. On 7 May 1956 Trigg faced Ken Rowlands, the holder of the Welsh area light heavyweight title. The match went the full twelve rounds with Trigg winning on points and taking the Welsh title. Trigg defended the title successfully against Don Sainsbury in March 1957, and in 1958 he beat past British middleweight champion Albert Finch, after which Finch retired from boxing. On 23 April 1958, Trigg lost his Welsh area title to Redvers Sangoe at Sophia Gardens Pavilion in Cardiff. It was the start of a bad run of form which ended in Trigg's retirement from fighting after a loss to Gordon Corbett in August 1959."]}, {"page": "List of Welsh boxing champions", "response": ["|align=left | Ken Rowlands", "|align=left | Ken Rowlands"]}, {"page": "Terry Gooding", "response": ["Terence J. Gooding (15 April 1931 – 1 October 2018) was a British professional boxer. After winning several amateur titles, he was selected to represent Great Britain in the men's middleweight event at the 1952 Summer Olympics in Helsinki, Finland. After winning his first bout, he was eliminated in the second round. He turned professional in 1954, enjoying a strong start to his career by winning his first 12 bouts and earning a Welsh light-heavyweight title bout against Ken Rowlands, which he lost. After a second defeat, he retired from professional boxing.", "Gooding completed his National Service in 1953 and had no plans to continue his boxing career. However, he was convinced to turn professional by boxing manager Sam Burns and won his first professional fight in May 1954 against Mick Endley by decision. Including his victory over Endley, Gooding won his first 12 bouts in his first year as a professional. His record saw him ranked as the number four light-heavyweight in Britain and prompted a Welsh title bout against fellow Welshman Ken Rowlands. However, Rowlands won the fight by TKO after the referee stopped the fight in the sixth round. Gooding suffered a second defeat against Arthur Howard three months later and retired from boxing."]}]}}