{"wiki_id": "http://www.wikidata.org/entity/Q6558184", "itemLabel": "Lisa Lee Dark", "itemDescription": "Opera singer, actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Lisa_Lee_Dark", "wikipedia_page": {"main": "Lisa Lee Dark (born Lee Dark; 16 April 1981) is a Welsh opera singer, songwriter, and voice actress.", "link_mentions": [{"page": "Congenital adrenal hyperplasia", "response": ["* Lisa Lee Dark"]}, {"page": "List of people from Swansea", "response": ["*Lisa Lee Dark, singer"]}, {"page": "Ernesto Nicolini", "response": ["The Welsh opera singer and voice-over actress Lisa Lee Dark is Nicolini's 4th great-grand niece."]}, {"page": "Dark (surname)", "response": ["*Lisa Lee Dark (born 1981), Welsh opera singer and voice actress"]}, {"page": "List of intersex people", "response": ["* Lisa Lee Dark, Welsh opera singer and voice actress."]}, {"page": "List of Welsh women", "response": ["*Lisa Lee Dark (born 1981), opera singer, voice actress"]}, {"page": "Intersex rights in the United Kingdom", "response": ["Accounts of intersex people include Hereford Mappa Mundi, a medieval map of the known world (c.1300), includes a hermaphrodite, outside the borders of the world known to its makers. In the mid 19th-century, The Welshman newspaper published an account of a child on 7 November 1851. Another case was reported in 1906 by The Cambrian newspaper in Wales, on the death in Cardiff of an intersex child who, at post-mortem examination, was determined to be a girl. at the National Library of Wales Known historical intersex figures in the UK include Sir Ewan Forbes (1912-1991), 11th Baronet of Craigievar, Dawn Langley Simmons (1937 or 1922 to 2000), English author and biographer, and Georgina Somerset (née Turtle) (1923-2013), the first openly intersex person in the UK.Somerset, G. T. (1992) A Girl Called Georgina – Over the Sex Border, London, The Book Guild. Prominent present day individuals include \"national LGBT treasure\" Seven Graham, writer Iain Morland, Lady Colin Campbell, author of Guide to Being a Modern Lady, Lisa Lee Dark, Welsh opera singer and voice actress, Dee Palmer of Jethro Tull, and Caroline Cossey."]}]}}