{"wiki_id": "http://www.wikidata.org/entity/Q6662036", "itemLabel": "Llew Edwards", "itemDescription": "British boxer", "wikipedia_url": "https://en.wikipedia.org/wiki/Llew_Edwards", "wikipedia_page": {"main": "Llewellyn \"Llew\" Edwards (22 October 1894 – 1965) was a Welsh boxer who fought professionally between 1913 and 1922. He is most noted for winning both the British and the British Empire featherweight boxing titles in 1915 and for an outstanding winning record with a nearly 50% knockout ratio.  He took the Australian lightweight title against Herb McCoy in 1916.", "link_mentions": [{"page": "Porth", "response": ["*Llew Edwards, British featherweight boxing champion"]}, {"page": "Llew Edwards (politician)", "response": ["Sir Llewellyn Roy Edwards  (2 August 1935 – 26 May 2021), known as Llew Edwards, was a Queensland state politician and state Liberal Party leader.", "Llew Edwards started his working life as an electrician in his family's electrical business. He graduated from the University of Queensland with an M.B.B.S. in 1965.University of Queensland. (September 2010.) Alumni News .", "In 1984, he was made a Knight Bachelor and, in 1989, a Companion of the Order of Australia. The Sir Llew Edwards Building at the University of Queensland's St Lucia campus is named after him."]}, {"page": "Rhondda", "response": ["During the 20th century the Rhondda supplied a steady stream of championship boxers. Percy Jones was not only the first World Champion from the Rhondda, but the first Welshman to hold a World Title when he won the Flyweight belt in 1914. After Jones came the Rhondda's most notable boxer, Jimmy Wilde, also known as the \"Mighty Atom\", who took the IBU world flyweight title in 1916. British Champions from the valleys include Tommy Farr, who held the British and Empire heavyweight belt, and Llew Edwards, who took the British featherweight and Australian lightweight titles."]}, {"page": "1965 in Wales", "response": ["*30 August – Llew Edwards, boxer, 72"]}, {"page": "1915 in Wales", "response": ["*Boxing - Llew Edwards wins the British and Commonwealth featherweight titles."]}, {"page": "1894 in Wales", "response": ["*22 October – Llew Edwards, featherweight boxer (died 1965)"]}, {"page": "Don Lane (politician)", "response": ["In 1983 Llew Edwards was Deputy Premier, and Leader of the Liberal Party parliamentary team. The Liberal Party was increasingly becoming divided between the Ginger Group (Queensland) which opposed the Government on a number of issues and wanted to be the senior coalition partner, and was typically composed of more moderate small l liberals, vs the typically older and more conservative members who were content with the status quo. Increasingly new Liberal Party members being elected were less conservative. On 9 October 1978, this (combined with a failure to win many seats in the last election) had resulted in Sir William Knox being deposed as leader and replaced by Edwards. This stoush, and the increasing number of three cornered contests in the 1977 election had attracted the ire of the National Party in the 1980 election, where they had engaged in three-cornered contests in three seats to defeat Bruce Bishop (Surfers Paradise), Peter White (Southport), and Tony Bourke (Lockyer). Bishop and White had been particularly open in their hostility to the National Party, and to alleged corruption by Russ Hinze on the Gold Coast. Three incidents in 1981 had further damaged relations between the Nationals and many Liberals, with the Liberal representation in Cabinet reduced from 8 to 7, the appointment of John’s friend Ted Lyons to the CVhairmanship of the TAB board, and the appointment of the new Chief Justice.Lane, Don 1993, Trial and Error Boolarong Publications Pp97 "]}, {"page": "List of British featherweight boxing champions", "response": ["|align=left | Llew Edwards"]}, {"page": "Owen Moran", "response": ["|align=left| Llew Edwards", "|align=left| Llew Edwards"]}, {"page": "List of Commonwealth Boxing Council champions", "response": ["|align=left |  Llew Edwards"]}, {"page": "Bob Marriott", "response": ["Marriott was due to defend his British title against Llew Edwards in May 1920 but declined the fight and reportedly returned his Lonsdale Belt to the National Sporting Club."]}, {"page": "Charlie Hardcastle", "response": ["Hardcastle started 1917 with a points loss to former English champion Seaman Arthur Hayes in January. After Llew Edwards vacated, Hardcastle faced former amateur champion Alf Wye in June for the British featherweight title. Hardcastle knocked Wye out in 2 minutes and 22 seconds of the first round to become British champion. He successfully defended his British title in July against Ruddick, who was disqualified in the 15th round after hitting Hardcastle while he was down,\"Boxing Bouts\", Maoriland Worker, Volume 8, Issue 344, 26 September 1917, p. 2. Retrieved 16 January 2016 and in November made a second defence against Tancy Lee. Lee Knocked him out in the fourth round to take the title.Odd, Gilbert E. (1989) The Encyclopedia of Boxing, Book Sales, , p. 75"]}, {"page": "Toowong State School", "response": ["Centenary celebrations were held in 1980 with a centenary ball, walkathon, fete and reunion day and sports day, as well as the publication of a school history. A new school gate to St Osyth Street was constructed, opened on 29 June 1980 by the Honourable Dr Llew Edwards, MLA, Deputy Premier and Treasurer of Queensland, and a time capsule was buried on the northern side of the 1880 Ferguson building, to be retrieved in 2030."]}, {"page": "Harry Stone (boxer)", "response": ["In what was likely his greatest victory, Stone won the Australian lightweight title before an impressive crowd of 9000 on April 23, 1921, in a twenty-round bout in Melbourne, Australia, against Welshman Llew Edwards. The fight was described as an outstanding show of scientific boxing with both boxers well matched.Crowd of 9000 in \"Australian Boxing Championship\", The Observer, London, Greater England, pg. 19, 24 April 1921  Edwards seemed to look tired and a bit haggard during the bout, and suffered from a cut over his eye received in the fifth, though he fought with vitality and strength. Edwards had the disadvantage of protecting his eye, which reduced his ability to take the offensive, particularly against Stone's left.  Stone gained the advantage and was said to have his \"hands, feet, and shoulders all working, while the manner in which he bore into his opponent was both interesting and effective\".  In the seventh, Edwards punished Edward's body against the ropes early in the bout and did better in the infighting, but Stone threw more punches.  As late as the eleventh and thirteenth, Edwards landed a few telling blows, but Stone remained in calculated command, and landed more blows.  Edwards needed stitches to lacerations in both eyelids later in his dressing room, but his right seemed to have taken the most punishment.  The boxers received around 350 English pounds for their efforts.\"Stone Defeats Edwards\", The Age, Melbourne, Australia, pg. 11, 25 April 1921  Edwards had previously taken both the British and the British Empire featherweight titles in 1915.", "On February 18, 1922, Stone again defeated Llew Edwards in a fight at West Melbourne Stadium discontinued in the seventh round when Edwards's handlers were forced to throw in the towel, as their boxer had been completely outclassed.  Edwards' manager claimed that his boxer's eyesight may have failed him.\"Harry Stone Beats Llew Edwards\", The Sydney Morning Herald, Sydney, New South Wales, pg. 6, 20 February 1922"]}]}}