{"wiki_id": "http://www.wikidata.org/entity/Q6755651", "itemLabel": "Marc Jones", "itemDescription": "Welsh rugby union player", "wikipedia_url": "https://en.wikipedia.org/wiki/Marc_Jones_(rugby_union)", "wikipedia_page": {"main": "Marc Jones (born 3 April 1987) is a rugby union player for the Scarlets in the Pro 14 He plays as a hooker. In the 2005–2006 season, Jones made 1 appearance as Sale Sharks won their first ever Premiership title.On 19 January 2015, it was announced Jones joined Bristol on a two-year deal starting from the next season. On 22 March 2017, Jones returned to Sale Sharks on a two-year contract from the 2017–18 season.On 28 August 2018, Jones left Sale to sign for Welsh region Scarlets in the Pro14 from the 2018–19 season.", "link_mentions": [{"page": "Scarlets", "response": ["*  Marc Jones"]}, {"page": "Bristol Bears", "response": ["* Marc Jones - Sale Sharks"]}, {"page": "Marc Jones", "response": ["Marc Jones may refer to:", "*Marc Jones (rugby union) (born 1987), rugby union player", "*Marc Jones (police commissioner), Lincolnshire Police and Crime Commissioner, England"]}, {"page": "List of 2015–16 Premiership Rugby transfers", "response": ["* Marc Jones to  Bristol Rugby"]}, {"page": "List of 2015–16 RFU Championship transfers", "response": ["* Marc Jones from  Sale Sharks"]}, {"page": "2015–16 Sale Sharks season", "response": ["Sale Sharks signed four experienced players for the 2015–16 season: Springbok tighthead Brian Mujati, All Black second row Bryn Evans, Irish legend Peter Stringer, and former hooker Neil Briggs. These signings followed the departure of several Sharks such as Marc Jones and Will Cliff to Bristol, and Luke McLean at the end of the previous season, with Alberto DeMarchi returning to Treviso and Michael Paterson going to Northampton as well as the retirements of Nathan Hines and club legend, the all-time record Premiership try scorer Mark Cueto."]}, {"page": "List of 2017–18 Premiership Rugby transfers", "response": ["*  Marc Jones from  Bristol"]}, {"page": "List of 2017–18 RFU Championship transfers", "response": ["* Marc Jones to  Sale Sharks"]}]}}