{"wiki_id": "http://www.wikidata.org/entity/Q680538", "itemLabel": "Teilo", "itemDescription": "Welsh bishop and saint", "wikipedia_url": "https://en.wikipedia.org/wiki/Saint_Teilo", "wikipedia_page": {"main": "Saint Teilo (Latin: Teliarus or Teliavus; Breton: Teliau or Telo; French: Télo or Théleau; c. 500 – 9 February c. 560), also known by his Cornish name Eliud, was a British Christian monk, bishop, and founder of monasteries and churches. He was from Penalun (Penally) near Tenby in Pembrokeshire, south Wales.\nReputed to be a cousin, friend, and disciple of Saint David, he was bishop of Llandaff and founder of the first church at Llandaff Cathedral, where his tomb is. He also founded Llandeilo Fawr, as well as Penally Abbey at his place of birth.", "link_mentions": [{"page": "Cardiff", "response": ["Saint Teilo (c. 500 – 9 February c. 560) is the patron saint of Cardiff. He was a British Christian monk, bishop, and founder of monasteries and churches. Reputed to be a cousin, friend, and disciple of Saint David, he was Bishop of Llandaff and founder of the first church at Llandaff Cathedral, where his tomb is. His Saint's Day is 9 February."]}, {"page": "February 9", "response": ["*Teilo (Wales)"]}, {"page": "Celtic Christianity", "response": ["St David established his monastery on a promontory on the western sea. It was well placed to be a centre of Insular Christianity. When Alfred the Great sought a scholar for his court, he summoned Asser of Saint David's. Contemporary with David were Saint Teilo, Cadoc, Padarn, Beuno and Tysilio among them. It was from Illtud and his successors that the Irish sought guidance on matters of ritual and discipline. Finnian of Clonard studied under Cadoc at Llancarfan in Glamorgan."]}, {"page": "Llandaff Cathedral", "response": ["Llandaff Cathedral () is an Anglican cathedral and parish church in Llandaff, Cardiff, Wales. It is the seat of the Bishop of Llandaff, head of the Church in Wales Diocese of Llandaff. It is dedicated to Saint Peter and Saint Paul, and three Welsh saints: Dubricius (), Teilo and Oudoceus (). It is one of two cathedrals in Cardiff, the other being the Roman Catholic Cardiff Metropolitan Cathedral in the city centre.", "For many years, the cathedral had the traditional Anglican choir of boys and men, and more recently a girls' choir, with the only dedicated choir school in the Church in Wales, the Cathedral School, Llandaff. The cathedral contains a number of notable tombs, including Dubricius, a 6th-century British saint who evangelised Ergyng (now Archenfield) and much of South-East Wales, Meurig ap Tewdrig, King of Gwent, Teilo, a 6th-century Welsh clergyman, church founder and saint, and many Bishops of Llandaff, from the 7th century Oudoceus to the 19th century Alfred Ollivant, who was bishop from 1849 to 1882.", "Further legends were popularised by pseudo-historical writings such as those of Geoffrey of Monmouth and Iolo Morganwg. These would include the re-establishment of a Christian community at Llandaff by Saint Dyfrig (Dubricius) and his successor Saint Teilo. The most notable legends surrounding these two would state that Saint Dyfrig was made Archbishop by Saint Germanus of Auxerre while he travelled through Britain to oppose the Pelagian heresy, and linked both saints with King Arthur.", "The Normans considered Dyfrig and Teilo as the cathedral's original founders and today, they are the modern Cathedral's patron saints, along with their successor Oudoceus. The modern Bishop of Llandaff holds Saint Dyfrig to be the first bishop at Llandaff and the continuation of a Post-Roman church at the site is supported by secular and ecclesiastical writings, as well as by the remains of an ancient Celtic cross at the Bishop's Court's well.", "The Normans occupied Glamorgan early in the Norman conquest, appointing Urban their first bishop in 1107. He began construction of the cathedral in 1120 and had the remains of Saint Dyfrig transferred from Bardsey.  After the death of Urban, it is believed the work was completed some time in the last years of Bishop Nicholas ap Gwrgant, who died in 1183. The cathedral was dedicated to Saints Peter and Paul, Dubricius, Teilo and Oudoceus.", "Bishop Henry de Abergavenny organised the Llandaff Cathedral chapter circa 1214. He appointed fourteen prebends, eight priests, four deacons and two sub-deacons. De Abergavenny also made changes to Llandaff's episcopal seal, giving more detail to the figure of the bishop depicted on it and adding the phrase \"by the grace of God\" to its inscription. The west front dates from 1220 and contains a statue of St Teilo. By 1266, the structure that Urban began had been altered; the cathedral was dedicated again in 1266.", "thumb|left|The door of the west front of Llandaff Cathedral; a statue of St Teilo is seen above the door.", "* Teilo, 6th-century clergyman, church founder and saint."]}, {"page": "Teilo", "response": ["#redirect Saint Teilo"]}, {"page": "List of monastic houses in Wales", "response": ["|Celtic monksfounded (in the time of St David) 6th century by St Teilo;parochial? from c.1107", "|Celtic monkschurch of St Teilo founded 7th century;under abbot 9th century to c.1150;parochial ? from after 1276", "|Celtic monksfounded 6th century by St Teilo;dissolved c.1100;remains incorporated into Church in Wales parish church of SS Nicholas & Teilo", "|Benedictine monksdependent on Llandeilo Fawr;founded end of 6th century, patron St Teilo;dissolved 1107?;13th century church built on site", "|St Teilo____________________Llandeilo Ferwallt"]}, {"page": "Llandeilo", "response": ["Llandeilo is named after one of the better-known Celtic saints of the 6th century, Saint Teilo. The Welsh word llan signified a monastery or a church. Saint Teilo, who was a contemporary of Saint David, the patron saint of Wales, established a clas (a small monastic settlement) on the site of the present-day parish church.", "Although there is very little factual detail about the life of Saint Teilo, it appears that he was highly respected in his lifetime, and revered after his death: there are 45 places dedicated to him, some as far afield as Brittany.", "After Saint Teilo's death, two equally important ecclesiastical centres in Wales, Llandaff Cathedral and St David's Cathedral, laid claim to his body. There is reasonable evidence to suggest, however, that Saint Teilo was buried in Llandeilo. The parish church of Llandeilo Fawr (\"Great Llandeilo\") is dedicated to Saint Teilo, and until 1880 its churchyard encompassed his baptistery.", "The early Christian settlement that developed around the Saint Teilo's Church prospered, and by the early 9th century it had attained considerable ecclesiastical status as the seat of a Bishop-Abbot. The Church of St Teilo soon became a 'mother church' to the surrounding district, acquiring an extensive estate, and possessing one of Wales' most beautiful and finely illustrated manuscripts – the Gospel Book of Saint Teilo. The discovery of fragments of two large Celtic crosses from this period provides further testimony to Llandeilo's importance and indeed prestige as an early ecclesiastical centre.", "Towards the end of the 9th century, the importance of Llandeilo as a spiritual centre had started to decline and the Gospel Book of St Teilo was removed to Lichfield Cathedral, where it became commonly known as the Lichfield Gospels or the Book of Saint Chad. The Bishops of Lichfield still use this manuscript to swear allegiance to the Crown.", "In the centuries that followed the Norman conquest of England, the Bishop of Llandaff and Bishop of St David's both claimed Llandeilo for their respective diocese. By the early 12th century, Llandeilo came under the patronage of the Bishopric of St David's, an ecclesiastic borough that became responsible for the affairs of the town including its development as an important medieval market centre to an extensive agricultural hinterland. Until the middle of the 20th century, a fair called St. Teilo's Fair, which had been authorised initially by Edward I of England in 1290, was held annually in the churchyard. Some of the agricultural produce and other goods offered for sale are recorded to have been displayed on the tombstones. Today, the fair has been replaced by a small farmers' market, held on the first Saturday of every month in the same place.", "Image:St Teilo's Church, Llandeilo.jpg|St Teilo's Church, Llandeilo"]}, {"page": "Diocese of Monmouth", "response": ["|St Teilo, Llantilio Crossenny", "|St Teilo, Llantilio Pertholey", "|St Teilo, Llanarth Fawr", "| rowspan=\"2\" |Newport St Julian l/w Newport St Teilo", "|St Teilo, Newport ", "|St Teilo, Troedrhiwfuwch", "|St Teilo"]}, {"page": "June 16 (Eastern Orthodox liturgics)", "response": ["* Venerable Ismael (Isfael), a disciple of St Teilo in Wales, he was consecrated Bishop of Menevia by him (6th century)Great Synaxaristes:  Ὁ Ὅσιος Ἰσμαὴλ ἐξ Οὐαλίας. 16 ΙΟΥΝΙΟΥ. ΜΕΓΑΣ ΣΥΝΑΞΑΡΙΣΤΗΣ."]}, {"page": "Geraint", "response": ["According to the vita of Saint Teilo, in 549, in order to avoid the yellow plague then sweeping through Britain, Teilo, with a small group of monks, left Llandaff to join Samson of Dol in Brittany. Passing through Dumnonia, they were received hospitably by King Geraint at Din Gerrein. In gratitude, Teilo promised the King his spiritual assistance at the hour of death. Seven years later, Teilo returned to give the King the last rites. Perhaps because of the relationships that bound him to Teilo, he too was proclaimed holy.Salsano, Mario. \"San Geraint II King of Cornwall\", Santi e Beati, June 11, 2008"]}, {"page": "Pontarddulais", "response": ["Most of the town lies within the parish of Llandeilo Tal-y-bont apart from the small section west of the bridge which lies in Llanedi parish. The bridge referred to in the name of Llandeilo Tal-y-bont (meaning \"Saint Teilo's church at the end of the bridge\") is not the same as that of Pontaberdulais. The church bridge was located near the old church on the earlier Roman road that crossed the river Loughor near Hendy. The medieval church of St Teilo was carefully dismantled stone-by-stone and reassembled in St Fagans National History Museum in Cardiff. Pontarddulais first gained attention in the wider world in 1843, during the Rebecca Riots, when rioters attacked the toll gate there, after crossing the bridge.", "Pontarddulais railway station is on the Heart of Wales Line, with trains to Swansea to the south and Shrewsbury to the north. The A48 traverses the town as St Teilo Street and Bolgoed Road. Junction 48 of the M4 Motorway serves Pontarddulais."]}, {"page": "Dol-de-Bretagne", "response": ["In 549, the Welsh Saint Teilo was documented as coming to Dol where he joined Samson of Dol, and the fruit groves which they planted remain and are known as the groves of Teilo and Samson. Legend has it that while there he was assigned by King Budic II to subdue a belligerent winged dragon, which he was said to have tamed and then tied to a rock in the sea off Brittany. He is reported to have stayed in Dol for seven years and seven months so must have left in 556 or 557."]}, {"page": "Bishop of Llandaff", "response": ["The diocese covers most of the County of Glamorgan. The bishop's seat is in the Cathedral Church of Saint Peter and Saint Paul (the site of a church traditionally said to have been founded in 560 by Saint Teilo), in the village of Llandaff, just north-west of the City of Cardiff. The bishop's residence is Llys Esgob, The Cathedral Green, Llandaff, in Cardiff.", "The first evidence that the bishops were called Bishop of Llandaff is from the early 11th century. Before this, though still ministering to Glamorgan and Gwent, the bishops described themselves as Bishop of Teilo and were almost certainly based at Llandeilo Abbey. The very early bishops were probably based in Ergyng. Before 1107, the title Bishop of Gwlad Morgan (Glamorgan) had been adopted. It was not until the title Bishop of Llandaff was used by Bishop Urban from . In medieval records, the bishop was sometimes referred to as the Archbishop of Llandaff. This appears to have been a simple reaction to the claim of St David's to the archiepiscopal title.", "| align=\"center\" |  || align=\"center\" |  || Saint Teilo || Bishop of Teilo", "| align=\"center\" |  || align=\"center\" |  || Oudoceus || Bishop of Teilo (Llandaf)", "| align=\"center\" |  || align=\"center\" | ??? || Berthwyn || Bishop of Teilo; succeeded Oudoceus according to the Llandaff Charters", "| align=\"center\" | ??? || align=\"center\" | 874 || Nobis || Bishop of Teilo; probably the same as the Bishop of St David's"]}, {"page": "Llansteffan", "response": ["Llansteffan means \"Llan of Saint Stephen\", but honours a 6th-century Welsh associate of Saint Teilo rather than the more widely known protomartyr."]}, {"page": "Adam of Usk", "response": ["Adam was strongly devoted to Saint Teilo (associated with Llandaff Cathedral) and to Saint Thomas of India, whose cult had been vitalised by Dominican missions in Asia."]}, {"page": "February 9 (Eastern Orthodox liturgics)", "response": ["* Saint Teilo (Theliau, Teilan, Dillo, Dillon), Bishop of Llandaff, Wales (6th century)Rev. Richard Stanton. A Menology of England and Wales, or, Brief Memorials of the Ancient British and English Saints Arranged According to the Calendar, Together with the Martyrs of the 16th and 17th Centuries. London: Burns & Oates, 1892. pp. 60–61.Rev. Sabine Baring-Gould (M.A.). \"S. Teilo, B. of Llandaff. (About A.D. 560.).\" In: The Lives of the Saints. Volume the Second: February. London: John C. Nimmo, 1897. pp. 238-241.", "File:St Teilo in Holy Trinity Church, Abergavenny.jpg|St Teilo, Bishop of Llandaff."]}, {"page": "List of Catholic saints", "response": ["| Teilo"]}, {"page": "Mynydd-y-Garreg", "response": ["The Bro Cydweli LMA group parish of the Church in Wales provides a bilingual afternoon service on the first and third Sundays of the month at St Teilo's Church, Mynyddygarreg.Parish site. Retrieved 18 September 2020. Saint Teilo (c. 500 – 9 c. 560) was a 6th-century British monk and early Welsh saint from Pembrokeshire.History of Wales site. Retrieved 18 September 2020."]}, {"page": "Oudoceus", "response": ["Land grants in the Book of Llandaff show Oudoceus as a contemporary of late 7th-century kings of South Wales. He was said to be a son of Anawed, the sister of Saint Teilo. His brothers were said to be the saints Ismael, Bishop of Rhos, and Tyfei, the martyr.", "His associations with Llandaff are very strong and it seems he was an early patron of the church there, where he is said to have placed relics of Saint Teilo, one of his predecessors as bishop. In the Life of St. Oudoceus, Einion, King of Glywysing, is said to have been hunting a stag amongst the rocks and woods of the river Wye; when the stag reaching the cloak of Oudoceus lay down on it, the hounds were unable to touch it. Einion then made a gift of land to the saint. Einion, however, was the son of Morgan Hen ab Owain (died 974), thus not a contemporary. ", "The original church at Llandaff (perhaps a monastery) may well have been an early foundation. However, it is likely to have been founded by Saint Oudoceus rather than Saint Teilo. He eventually retired to Llandogo, near Tintern, and died there on 2 July, which is his feast day. He was supposedly buried at the church in Llandaff, on the site of the present Llandaff Cathedral, where there was a shrine to him until 1547. He is one of the three saints to whom the cathedral is dedicated.", "Oudoceus's 12th-century hagiographic 'life' in the Book of Llandaff tells how he was the son of King Budic of Brittany,Monks of Ramsgate. “Oudaceus”. Book of Saints, 1921. CatholicSaints.Info. 21 May 2016 born in that country shortly after his father's return there from exile in Dyfed. His mother, Anawed,  was said to be the sister of Saint TeiloNedelec, Louis. Cambria Sacra: Or, The History of the Early Cambro-British Christians, Chapter XI, Burns and Oates, 1879 and Budic promised that Oudoceus could train for a life in the Church under him. So Oudoceus came to Wales and eventually succeeded Teilo as Bishop of Llandaff.Butler, Alban. The Lives of the Saints, 1866  "]}, {"page": "Eliud, Saint", "response": ["#REDIRECT Saint Teilo"]}, {"page": "Llangolman", "response": ["The current Llandeilo chapel was built in 1882, though earlier chapel structures are recorded in the immediate vicinity. The name Llandeilo comes from the local church dedicated to the 5th-century saint, Teilo."]}, {"page": "St Padarn's Church, Llanbadarn Fawr", "response": ["thumb|Window of St Teilo in Holy Trinity Church, Abergavenny", "The anonymous author tells us that Padarn's parents were nobly born Armoricans (Bretons), and that he sailed to Britain with 847 monks to settle and build a monastery. He established monasteries and churches throughout Ceredigion. The attempt of Maelgwn, king of Gwynedd, to ruin Padarn rebounds on him through a miracle, and he compensates Padarn with the gift of lands between the rivers Rheidol and Clarach.Maelgwn is portrayed as a tyrant and opponent of the Church, not only in the Life of St Padarn but also in that of Saint Kentigern and of Saint Cadoc. Maelgwn, \"the great tempter of the saints\" arriving at the river Clarach, falsely accuses Padarn of theft and is thereby struck blind but restored at Padarn's intercession, after granting Padarn all the land from the river Rheidol to its source. Saint Padarn is closely associated with Saint David and Saint Teilo in a pilgrimage to Jerusalem in which the three are honoured by the Patriarch.Unfortunately, church records are almost as poor for this period in the Holy Land as they are in Wales. The Patriarchate traces its line of succession to the first Christian bishops of Jerusalem, the first being James the Just in the first century AD. Jerusalem was granted autocephaly in 451 by the Council of Chalcedon and in 531 became one of the initial five patriarchates. Padarn was given a tunicIt is possible that this tunic was a chasuble, which was adopted by the clergy in the sixth century, though it is said that Jesus himself wore one at the last supper, and its use was limited to the eucharist in the eleventh century. This is plausible, as it developed from the casula, which was derived from the planeta or paenula, a cloak worn by all classes and both sexes in the Graeco-Roman world. The paenula, a cloak similar to the poncho, was an over-dress originally worn only by slaves, soldiers, and others of low degree. Because of its convenience, it was adopted by fashion in the third century as a travelling cloak. – which later featured in the best known legend associated with him – and a staff. Most likely this account is fabricated, as are much of the details of the lives of the early saints, from a variety of sources, real and imagined.", "There follow confusing episodes involving Brittany (sometimes called Letia). Padarn finally leaves for France,At this time France (under the Merovingians) was smaller than it is today. where he dies, but his remains are brought back and buried in Vannes. A final chapter tells how Padarn, David and Teilo divide south Wales into three episcopates, with Padarn as bishop of Ceredigion. Then, convinced by a miracle performed by Padarn, a local governor called Eithir is persuaded to give land between the rivers Rheidol and Paith to Padarn. The lands owned by Llanbadarn in the twelfth century were between the rivers Rheidol and Clarach. The Paith is a minor tributary of the River Ystwyth. The obscure figure of Eithyr is commemorated in the farm name of Llaneithr, which stands a mile east of Devil's Bridge near the river Mynach.This section owes much to Gerald Morgan; Gerald Morgan, Ceredigion: A wealth of History (Gower, Llandysul, 2005).", "The Life is difficult to follow and extremely vague on any facts. Typically the author takes facts and traditions known to him and transfers them to the saint himself. Thus there was in the twelfth century a holy relic at Llanbadarn believed to have been Padarn's staff, Cyrwen, which could well be the origin of the place name Llangorwen. The writer obviously knew very little indeed about Padarn, except that he was seen as a contemporary of David and Teilo, who certainly lived during the sixth century.", "In the centre room of the transept there is a low slate slab altar stone, with an etched red Chi-Ro emblem, with Alpha and Omega incised. A Chi-ro is an early form of Christogram, and is formed by the super imposition of the first two letters of the Greek alphabet onto a circle. There is a rough Cornish granite monolith seat and prie-dieu, which with the altar stone are inset with gold-enamelled small tiles by Andrew Rowe. The wall plaster has an incised red line. There is a white glazed tiled floor with red tile border around the two early Celtic crosses. In the south wall above the stone crosses are 1920s/1930s windows representing Saints Padarn, Dewi and (in the centre and above) Teilo. The Padarn window is a single-light window with a standing figure of St Padarn holding a staff and chalice, with a valley and hills behind him. It was given in memory of members of the Bonsall family, and was made by the Heaton, Butler & Bayne, London, around 1930, thus preceding Peter Lord's work on the transept.", "There are small enclosed chambers to either side of the centre chapel. The chapel of St Padarn is on the left, with an imitation pointed vault and slate slab floor. In the entrance to the chapel there is a window on the left side depicting scenes from the manuscript Life of Padarn. The single-light window with various figures, scenes and motifs is by Elizabeth Edmundson, and dates from 1988. It includes Teilo, Padarn and Dewi (David) at the top, a healing by St Samson, Maelgwn, Arthur and Caradog, two kings of Ireland on horseback and a figure with the Virgin and Child. The figures are mostly modelled on figures from the Book of St Chad. In the chapel itself, which has a low slate altar stone and seat, is a porcelain relief sculpture by Gillian Still showing a story from the Life, the ordeal by boiling water. The chapel is lit only by two small windows (one with red glass, the other green) into the central chapel. Neither the altar stone in the larger room nor that in the chapel of St Padarn have been consecrated so neither are strictly speaking altars, and neither can be used for a Eucharistic service."]}, {"page": "Padarn", "response": ["In the Vita Sancti Paterni Padarn travels on a pilgrimage to Jerusalem with Saint David and Saint Teilo for all three to be ordained bishops by the patriarch. Along the way they acquired the gift of tongues so that whomever they spoke to understood them in his own language. The patriarch gave Paternus two gifts, a crozier and a finely woven tunic. On their return, they amicably divided Britannia into three bishoprics.Over, Kristen Lee., Kingship, Conquest, and Patria, Routledge, 2014 "]}, {"page": "Llantilio Crossenny", "response": ["===St Teilo's church===", "The Church of St Teilo dates from the 13th century and is ", "\"an unusually grand cruciform church.\" It was designated a Grade I listed building on 19 November 1953 and is dedicated to Saint Teilo."]}]}}