{"wiki_id": "http://www.wikidata.org/entity/Q6968916", "itemLabel": "Nathan Bonner-Evans", "itemDescription": "Welsh rugby union player", "wikipedia_url": "https://en.wikipedia.org/wiki/Nathan_Bonner-Evans", "wikipedia_page": {"main": "Nathan Bonner-Evans is a Wales A international rugby union player. A number 8 forward, he has played for Ospreys and for Sale Sharks. In December 2008 he signed for London Welsh RFC. In the 2005–2006 season, Bonner-Evans made 11 appearances as Sale Sharks won their first ever Premiership title.", "link_mentions": [{"page": "Danny Grewcock", "response": ["Following a citing, Grewcock pleaded guilty to stamping on Nathan Bonner-Evans in Bath's 18–16 home Guinness Premiership victory over Sale Sharks on 22 December 2006. He received a one-week suspension for the offence. The same season saw him cited a second time, this time for a punch on Thibault Privat in Bath's 22–16 defeat by Clermont Auvergne in the European Challenge Cup final on 19 May 2007. He was found guilty and suspended for the period 8 June – 15 September 2007 which, taking into account the close season of inactivity, meant that he was suspended from playing rugby for a period of seven weeks, the start of his season being judged to be 4 August 2007. He lodged an appeal against the ban but was unsuccessful."]}, {"page": "Sale Sharks", "response": ["New additions to the squad for the 2005–06 season included French prop Lionel Faure, Samoan back Elvis Seveali'i and Welsh number eight Nathan Bonner-Evans. Building on their European Challenge Cup success, Sale won 16 games out of 22 to finish two games clear at the top of the table. In the semi-final against London Wasps, they won 22–12. They won the 2006 Premiership title with a 45–20 win against Leicester Tigers."]}, {"page": "2002–03 Celtic League", "response": ["| ||8|| Nathan Bonner-Evans"]}, {"page": "History of Sale Sharks", "response": ["New additions to the squad for the 2005–06 season included French prop Lionel Faure, Samoan back Elvis Seveali'i and Welsh number eight Nathan Bonner-Evans. Building on their European Challenge Cup success, Sale won 16 games out of 22 to finish two games clear at the top of the table. In the semi-final, they won 22–12. They won the 2006 Premiership title with a 45–20 win against Leicester Tigers."]}]}}