{"wiki_id": "http://www.wikidata.org/entity/Q7167764", "itemLabel": "Peredur Lynch", "itemDescription": "Welsh academic and poet", "wikipedia_url": "https://en.wikipedia.org/wiki/Peredur_Lynch", "wikipedia_page": {"main": "Peredur Ionor Lynch (born 13 January 1963) is a Welsh academic who serves as professor of Welsh & Medieval Literature in the School of Welsh and Celtic Studies at Bangor University.", "link_mentions": [{"page": "John Prichard", "response": ["John Prichard (6 May 1817 – 13 October 1886) was a Welsh architect in the neo-Gothic style.The Welsh Academy Encyclopaedia of Wales. John Davies, Nigel Jenkins, Menna Baines and Peredur Lynch (2008) p.710.   As diocesan architect of Llandaff, he was involved in the building or restoration of many churches in south Wales."]}, {"page": "Carrog", "response": ["Carrog railway station is part of the Llangollen Railway and is a passing place on the line, now the extension to Corwen past the site of Bonwm has been opened. One notable resident of Carrog is Peredur Lynch who graduated from Bangor University to become a literary historian. Carrog has one primary school, Ysgol Carrog, which is over 100 years old."]}, {"page": "Llanfair-yn-Neubwll", "response": ["Llanfair-yn-Neubwll is a village and community on the Isle of Anglesey in the north west of Wales. The community includes the villages of Llanfihangel yn Nhowyn and Caergeiliog, and had a population of 1,688,Office for National Statistics : Census 2001 : Parish Headcounts : Isle of Anglesey Retrieved 10 January 2010 increasing to 1,874 at the 2011 census.  The community is heavily connected to the nearby Royal Air Force airfield, RAF Valley, established on Tywyn Trewan during the Second World War, and still in use. Due to the airfield, Llanfair-yn-Neubwll is one of the most anglicised of the communities on Anglesey.The Welsh Academy Encyclopaedia of Wales. John Davies, Nigel Jenkins, Menna Baines and Peredur Lynch (2008) p488 "]}, {"page": "Template talk:Welsh kingdoms", "response": ["* Oppose re expert usage. Historians use the phrase. For example, in the The Welsh Academy Encyclopaedia of Wales (John Davies, Nigel Jenkins, Menna Baines and Peredur Lynch et al., eds (2008). Cardiff: University of Wales Press. pp. 228. .) entry for Dyfed, Kingdom begins: \"One of the kingdom of early Wales ... \" and elsewhere. Daicaregos (talk) 13:20, 6 September 2009 (UTC)"]}, {"page": "Learned Society of Wales", "response": ["*Peredur Lynch"]}, {"page": "2017 in Wales", "response": ["*Peredur Lynch – Caeth a Rhydd"]}, {"page": "2018 in Wales", "response": ["*11 May – The short list for the Wales Book of the Year award for 2018 is announced. Contenders in the various categories include Thomas Dilworth, Gwyneth Lewis, Peredur Lynch, Robert Minhinnick and Mihangel Morgan."]}]}}