{"wiki_id": "http://www.wikidata.org/entity/Q722001", "itemLabel": "Luke Evans", "itemDescription": "Welsh actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Luke_Evans", "wikipedia_page": {"main": "Luke George Evans (born 15 April 1979) is a Welsh actor and singer. He began his career on the stage, performing in many of London's West End productions such as Rent, Miss Saigon, and Piaf before making his film breakthrough in the Clash of the Titans 2010 remake. Following his debut, Evans was cast in such action and thriller films as Immortals (2011), The Raven (2012), and the re-imagined The Three Musketeers (2011).\nIn 2013, Evans starred as the antagonist Owen Shaw in the blockbuster Fast & Furious 6, and also played Bard the Bowman in Peter Jackson's three-part adaptation of J. R. R. Tolkien's The Hobbit. Evans also portrayed the vampire Dracula in the character's 2014 film origin story, Dracula Untold. In 2017, Evans starred as Gaston in Disney's live-action adaptation of Beauty and the Beast, and portrayed American psychologist William Moulton Marston, creator of fictional character Wonder Woman, in the biographical drama Professor Marston and the Wonder Women. He had a lead role in the period drama series The Alienist in 2018. He released his debut album, At Last, on 22 November 2019. In 2020, he starred in a three-part miniseries The Pembrokeshire Murders. In 2021, he had a main role in the Hulu drama miniseries Nine Perfect Strangers.", "link_mentions": [{"page": "Apollo", "response": ["Apollo has been depicted in modern films, such as by Keith David in Disney's 1997 animated feature film, Hercules. Apollo has also been depicted by Luke Evans in the 2010 action film Clash of the Titans."]}, {"page": "1979", "response": ["* April 15 – Luke Evans, Welsh actor and singer"]}, {"page": "Pinocchio (1940 film)", "response": ["By October 2019, Robert Zemeckis entered talks to serve as the director on the project, with a script co-written by King, Weitz, and Simon Farnaby. Weitz and Milano are still confirmed as producers. The same month, it was reported that due to the less-than-expected box office numbers from Dumbo and Maleficent: Mistress of Evil, Disney was considering releasing the film exclusively through its streaming service, Disney+. By January 2020, it was announced that Zemeckis had officially joined the project as director, with a script he co-wrote with Weitz, that Jack Rapke and Jackie Levine will serve as executive producers, and that the film would still receive a theatrical release. In August 2020, Tom Hanks, a recurring collaborator of Zemeckis', once again entered talks to play Geppetto. In December 2020, the official release of Pinocchio on Disney+ was announced and that Hanks had officially signed on to play Geppetto. The film will feature the original's classic songs and new musical numbers written by Alan Silvestri and Glen Ballard. In January 2021, Oakes Fegley and Luke Evans entered early negotiations to portray Lampwick and the Coachman, respectively. The following month, Evans confirmed his casting for the movie."]}, {"page": "The Three Musketeers", "response": ["*The Three Musketeers (2011), directed by Paul W. S. Anderson and starring Luke Evans, Ray Stevenson and Milla Jovovich."]}, {"page": "Far from the Madding Crowd", "response": ["*Tamara Drewe (2010), a British romantic comedy film directed by Stephen Frears and based on the newspaper comic strip of the same name, which was a modern reworking of Far from the Madding Crowd, starring Gemma Arterton and Luke Evans as analogues of Bathsheba and Gabriel."]}, {"page": "Mandy Moore", "response": ["In February 2019, Moore co-starred with Justin Bartha, Barbara Jacques and Paul Lieberstein in the short comedic action film The Big Break. In March, she co-starred with J.K. Simmons, Sebastian Stan, Max Greenfield and Maika Monroe in the drama I'm Not Here and voiced Courtney in the Fox animated sitcom Family Guy, in the season 17 episode \"No Giggity, No Doubt\". On March 25, 2019, Moore received her star on the Hollywood Walk of Fame. After teasing fans with snippets of new music and photos from the studio throughout the year, on September 17, 2019, Moore released her first original song in over a decade, the single \"When I Wasn't Watching\", with an accompanying music video; this was followed by the single \"I'd Rather Lose\" on October 31. In November, she co-starred in the independent historical drama Midway with Ed Skrein, Patrick Wilson, Luke Evans, Aaron Eckhart, Nick Jonas, Dennis Quaid, and Woody Harrelson."]}, {"page": "Dolores O'Riordan", "response": ["Among those honouring O'Riordan were the Cranberries, Olé Koretsky, Andy Rourke former bassist of the Smiths, Stephen Street, U2, Duran Duran, Julian Lennon, Liz Phair, James Corden, Josh Groban, Roger Bennett, Hozier, Foster the People, Elijah Wood, Chris Cornell's brother Peter, Mark Lanegan, Pearl Jam, Bryan Adams, Halsey, Kodaline, the The, Michael Stipe and R.E.M., Dave Davies of the Kinks, Adele, Garbage, Annie Lennox, Cerys Matthews, Lisa Stansfield, Michelle Branch, Dan Brodbeck, Slash, Graham Hopkins, Benjamin Kowalewicz, Vic Fuentes, actors Luke Evans and Francois Arnaud, Questlove, Kiesza, Diplo, Gao Xiaosong, Colin Parry, The Tim Parry Johnathan Ball Foundation for Peace, Ali Hewson, Adi Roche and Chernobyl Children International."]}, {"page": "Pontypool", "response": ["* Luke Evans – actor and singer."]}, {"page": "Jason Statham", "response": ["In August 2011, he began filming Parker for director Taylor Hackford; the film was released in January 2013. Statham played Parker, the criminal antihero previously played by Mel Gibson in 1999's Payback and by Lee Marvin in 1967's Point Blank (though their characters were given different surnames). A. O. Scott of The New York Times said of the actor in the film: \"[Statham], who seems to be made entirely of muscle and scar tissue, is comfortable with his limitations as an actor. His Parker, in any case, is more of an axiom than a fully rounded human being.\" A 2012 BBC News report estimated that his ten-year film career to date (2002 to 2012) yielded over one billion dollars in the box office, making him one of the industry's most bankable stars. He was signed on to reprise his role as Lee Christmas in The Expendables 2 in 2012.In 2013, Statham had a cameo appearance at the end of Fast & Furious 6 as the brother of the film's antagonist Owen Shaw (Luke Evans). He reprised the character, this time as the main antagonist, in Furious 7, which was released in April 2015. He also starred opposite James Franco in the thriller Homefront, written by Sylvester Stallone, and headlined the British thriller Hummingbird. The latter film was praised by critics for pushing Statham's acting abilities to new heights. His \"attempt to develop his 'brand' by trying more adventurous parts\" noted by The Guardian's Mark Kermode, \"[broadened] his dramatic palette\". Statham made a cameo in the 2014 music video Summer of Calvin Harris as one of the car racers. In 2014, he returned as Lee Christmas in The Expendables 3. Although critically panned, the film would go on to gross $215 million against a $90 million budget."]}, {"page": "Junichi Suwabe", "response": ["| The Pembrokeshire Murders || Detective Superintendent Steve Wilkins || Luke Evans || || "]}, {"page": "Aaron Eckhart", "response": ["On November 8, 2019, he starred in Roland Emmerich’s blockbuster movie  Midway, which also starred Ed Skrein, Patrick Wilson, Luke Evans, Mandy Moore, Nick Jonas, Dennis Quaid and Woody Harrelson."]}, {"page": "The Big Fat Quiz of the Year", "response": ["Pre-recorded guest questions came from Luke Evans, Naomi Ackie, Louis Walsh, Luke Goss, Adam Lambert and Dina Asher-Smith. An in-studio guest question was asked by RuPaul's Drag Race UK finalist Baga Chipz and winner The Vivienne. The children of Mitchell Brook Primary School acted out the attempted proroguing of Parliament for a related question. Jon Snow reported on Lizzo's \"Juice\". Charles Dance read from the biography of Dani Dyer. The mystery guest was Jaden Ashman, the teenager who came second in a Fortnite tournament and won £900,000. The Big Fat Question was asked by Strictly Come Dancing contestant Mike Bushell.", "Pre-recorded guest questions came from Luke Evans, Ore Oduba, Dynamo, Christian Slater, Judy Murray and Reverend Kate Bottley. The children of Mitchell Brook Primary School acted out Garry Kasparov's defeat to Deep Blue. Jon Snow reported on Billy Ray Cyrus' \"Achy Breaky Heart\". Charles Dance read confusing online film reviews. The mystery guests were John Cornelius, Robbie Humphries and Anthony Eden, who all played The Milkybar Kid as children. The Big Fat Question featured several football team mascots for the teams to identify."]}, {"page": "Patrick Wilson (American actor)", "response": ["On November 8, 2019, Roland Emmerich’s blockbuster film Midway, was released, starring Wilson along with Ed Skrein, Mandy Moore, Luke Evans, Aaron Eckhart, Nick Jonas, Dennis Quaid and Woody Harrelson. In June 2020, Wilson signed on to Emmerich's Moonfall. Production began in October 2020 and is slated for a 2022 release."]}, {"page": "The Crow", "response": ["On December 14, 2008, Stephen Norrington announced in Variety that he planned to write and direct a \"reinvention\" of The Crow. Norrington distinguished between the original and his remake: \"Whereas Proyas’ original was gloriously Gothic and stylized, the new movie will be realistic, hard-edged and mysterious, almost documentary-style.\" In 2009 Ryan Kavanaugh's Relativity Media was negotiating with Edward R. Pressman for both the film's rights and financing. In May 2013, actor Luke Evans accepted the role of Eric Draven, with F. Javier Gutiérrez set to direct. According to James O'Barr the movie is expected to be much more faithful to the comic including flashbacks, metaphors, horses, trains and barbed wire, making it not suitable for younger audiences. Director Javier Gutiérrez also confirmed that his intentions are to create literally a page-by-page adaptation of the movie. Filming was slated to start in the spring of 2015 but on July 31, 2015, The Hollywood Reporter reported that production on the reboot stalled because of Relativity Media's bankruptcy."]}, {"page": "Bobby Cannavale", "response": ["In 2021, Cannavale played Tony Hogburn in the Nicole Kidman led Hulu miniseries, Nine Perfect Strangers, based on the novel of the same name by Liane Moriarty, of which also featured Melissa McCarthy, Michael Shannon, Luke Evans, Samara Weaving, and Asher Keddie."]}, {"page": "Daniel Brühl", "response": ["From 2018 to 2020, he played the title role as Dr. Laszlo Kreizler in The Alienist, an American period crime drama series based on the 1994 novel by Caleb Carr, alongside Luke Evans and Dakota Fanning. In his preparation, Brühl read about famous pioneering psychologists of the time (Sigmund Freud, Josef Breuer, and Carl Jung) and went to psychotherapy in Budapest just to get an understanding of the way they worked and thought. His wife Felicitas, a practicing psychotherapist, also put him in touch with criminal psychologists. In 2019, he received nominations for the Golden Globe Award as Best Actor in a Television Motion Picture and the Satellite Award for Best Actor in a Miniseries or Television Film for his role in the series which was nominated at the Primetime Emmy Awards as Outstanding Limited Series and the Golden Globe Awards as Best Television Motion Picture. In the same year, he played fertility physician Thomas in My Zoe (2019) which was his first foray into executive production."]}, {"page": "Taboo (musical)", "response": ["The show premiered in London's West End at the newly opened Venue Theatre on January 29, 2002, produced by Adam Kenwright, written by Boy George & Mark Davies Markham with a cast that included Luke Evans, Euan Morton, Matt Lucas and was directed by Christopher Renshaw with choreography by Les Child and costume design by Mike Nicholls. Comedian/talk-show host Rosie O'Donnell was so enamoured with it that she decided to finance a Broadway production. After 16 previews, it opened on November 13, 2003, at the Plymouth Theatre. Hampered by mostly scathing reviews, the production closed after 100 performances. The cast, directed by Christopher Renshaw, included Boy George (credited under his real name, George O'Dowd), Euan Morton, Liz McCartney, Raúl Esparza, Sarah Uriarte Berry, Jeffrey Carlson, and Cary Shields. O'Donnell reportedly lost her entire $10 million investment in the project. O'Donnell said in a 2007 interview about Leigh Bowery that she will take Taboo back to Broadway in the future.", "* Billy – the protagonist, Billy is an aspiring photographer. Frustrated with suburban life in Bromley, he runs to London ('Safe in the city') to make his fortune. There he meets Philip Sallon, who introduces him to Kim and George. He soon falls in love with Kim, and attaches himself to George's rising star. Not based on any one real life person. Played by Luke Evans in the original London production."]}, {"page": "Aberbargoed", "response": ["* Luke Evans, actor and singer"]}, {"page": "Hiroki Tōchi", "response": ["| Dracula Untold || Vlad III Țepeș || Luke Evans || ", "| Immortals || Zeus || Luke Evans || ", "| The Girl on the Train || Scott Hipwell || Luke Evans || "]}, {"page": "Michael Shannon", "response": ["In 2021, Shannon played Napoleon Marconi in the Hulu miniseries, Nine Perfect Strangers, based on the novel of the same name by Liane Moriarty, which features Nicole Kidman in the lead role, alongside Melissa McCarthy, Luke Evans, Samara Weaving, Asher Keddie, and Bobby Cannavale."]}, {"page": "Shaun Dooley", "response": ["In 2019, Shaun and his wife Polly produced an album, Got It Covered, for Children In Need. The album featured Helena Bonham Carter, Jim Broadbent, Olivia Colman, Luke Evans, Suranne Jones, Adrian Lester, Himesh Patel, David Tennant, Jodie Whittaker and Shaun himself singing unique cover versions of songs personal to them. The album was released on 1 November 2019. The album and accompanying documentary was co-produced by their company 20four7films, BBC Studios and SilvaScreen Records."]}, {"page": "Love Is a Battlefield", "response": ["=== Luke Evans version ===", "In 2019, Luke Evans covered the song as part of his debut album At Last and also released it as a single."]}, {"page": "It Must Be Love (Labi Siffre song)", "response": ["In 2019, the song was featured on the Children in Need album \"Got It Covered\", performed by Helena Bonham Carter, Jim Broadbent, Olivia Colman, Shaun Dooley, Luke Evans, Suranne Jones, Adrian Lester, Himesh Patel, David Tennant and Jodie Whittaker."]}, {"page": "The Coachman", "response": ["Luke Evans is set to portray The Coachman in a live-action adaptation of the Disney animated film."]}, {"page": "Kazuhiro Yamaji", "response": ["*The Hobbit: The Battle of the Five Armies (Bard the Bowman (Luke Evans))"]}, {"page": "Takuya Kirimoto", "response": ["*Midway (Wade McClusky (Luke Evans))"]}, {"page": "Nicholas Jarecki", "response": ["In 2019, Jarecki directed, wrote, and produced the multi-narrative film about the opioid epidemic, Crisis, starring Gary Oldman, Luke Evans,  Evangeline Lilly, Armie Hammer, Michelle Rodriguez, Veronica Ferres, Mia Kirshner, Greg Kinnear and Lily-Rose Depp. The film, still being released theatrically throughout the summer of 2021, has been well-received by critics and audiences, ranking as the #1 best selling film on iTunes for nearly two weeks during its initial US release and as the #1 box office debut film in Australia. The film was also the #1 independent film in theaters in its opening weekend in the US."]}, {"page": "Kissing You (Des'ree song)", "response": ["\"Kissing You\" has been covered by Beyoncé (2007), Taylor Dayne (2008), Stan Walker (2010) and Luke Evans (2019). Beyoncé filmed a music video for her rendition, which she retitled \"Still in Love (Kissing You)\". The change of title and music video went against copyright terms, and thus Des'ree's publishers filed a lawsuit against Beyoncé and her representatives. Infringing albums were recalled, and both sides agreed that the case be settled out of court."]}, {"page": "Robin Hood (2010 film)", "response": ["* Luke Evans as Sheriff's Thug"]}, {"page": "Gaston (Beauty and the Beast)", "response": ["Gaston, played by Welsh actor Luke Evans, appears in the 2017 remake. During an interview with Empire magazine, Evans said that Gaston would retain his hunter background, yet would also be a former soldier in the French army. He also implied that this version of Gaston is darker than the original.Evans’ Gaston in New ‘Beauty and the Beast’ Photo In the film, Gaston plays out the same role as in the animated movie, though with a few differences. A Captain in the light cavalry, Gaston is a hero to the village, but he's bored with his peaceful life after returning from the war. Gaston pursues Belle, determined to marry her, as she is the most beautiful girl in the village and thus the only one good enough for him. He also finds her independence to be a thrilling challenge, and shows disdain for the Bimbettes who constantly fawn over him purely because of his appearance. When the headmaster and Clothilde catch Belle teaching a girl how to read, they rouse some of the villagers into destroying the laundry invention she made which LeFou informs Gaston about. Gaston breaks up the activity as Pére Robert helps Belle pick up her laundry. While unaware on how this transaction towards Belle started, Gaston scolds the villagers for behaving like this and orders them to go home immediately. At one point, Gaston mentioned in a discussion to Belle that the headmaster didn't like him at first. He accosts her at her home, subtly offering his hand in marriage for when Maurice dies, but she turns him down. Gaston sulks in the tavern until LeFou cheers him up with a song. Maurice appears, claiming that Belle has been imprisoned by the Beast. While Gaston does not believe in the Beast, he offers to help Maurice in order to find out where Belle has gone."]}, {"page": "Yōji Ueda", "response": ["* Professor Marston and the Wonder Women (William Moulton Marston (Luke Evans))"]}, {"page": "Fast & Furious", "response": ["Dominic Toretto, Brian O'Conner and their team are offered amnesty for their crimes by Luke Hobbs, in exchange for helping him take down a skilled mercenary organization led by Owen Shaw (Luke Evans), one member of which is Toretto's former lover Letty Ortiz."]}]}}