{"wiki_id": "http://www.wikidata.org/entity/Q7253279", "itemLabel": "Prys Morgan", "itemDescription": "historian", "wikipedia_url": "https://en.wikipedia.org/wiki/Prys_Morgan", "wikipedia_page": {"main": "Prys Morgan FRHistS FSA FLSW (born 1937) is a Welsh historian.", "link_mentions": [{"page": "Rhodri Morgan", "response": ["Born in Cardiff, Hywel Rhodri Morgan was the son of Professor T. J. Morgan and the brother of historian Prys Morgan. His second cousin is Professor Garel Rhys."]}, {"page": "List of Welsh-language authors", "response": ["*Prys Morgan (born 1937)"]}, {"page": "1991 in Wales", "response": ["*Prys Morgan - Brad y Llyfrau Gleision"]}, {"page": "1989 in Wales", "response": ["*Prys Morgan – Beibl i Gymru"]}, {"page": "1975 in Wales", "response": ["*Prys Morgan - Iolo Morganwg"]}, {"page": "1937 in Wales", "response": ["**Prys Morgan, historian"]}, {"page": "T. J. Morgan", "response": ["He was born at \"Ynys-y-mwn\", in the village of Glais, near Swansea, and he studied Welsh at Swansea University. In 1926, he met his future wife, Huana Rees, at the National Eisteddfod of Wales. The couple wed in 1935. They had two sons: the politician Rhodri Morgan (1939–2017) and historian Prys Morgan (b. 1937)."]}, {"page": "Meredith (given name)", "response": ["In Old Welsh (c. 800–1150) the name was usually rendered as Morgetuid or Margetiud. The exact meaning of the first element, Mere, is unclear although some Welsh scholars have translated it as \"great\" or \"splendid\". The final element of iudd has the meaning of lord, and is found in other Welsh names such as Gruffydd and Bleidd[i]udd. However, in Middle Welsh (c. 1150s–1300s) the name was most commonly spelt as Maredud and Maredudd; \"in Welsh, the accent is on the penult, and this leads at times to the elision of the vowel of the first syllable,\" producing an early variant Mredydd, according to T.J. Morgan and Prys Morgan. Anglo-Norman scribes often used e for the first syllable and substituting the double d with a th, producing Mereduth. The forms Meredith and Meredyth are seen as early as the 14th century."]}, {"page": "Morganstown", "response": ["The Welsh-language services at Bethel came to an end about 1928.Prys Morgan, 'Hon ydyw'r Afon ond nid Hwn yw'r Dŵr', in Hywel T. Edwards (ed.), Merthyr a Thaf (Llandysul, 2001), p. 383.", "In a Welsh-language memoir about his up-bringing in Radyr (alongside his brother Rhodri), Professor Prys Morgan (b. 1937) refers to Morganstown as Pentre-poeth.Prys Morgan, 'Hon ydyw'r Afon ond nid Hwn yw'r Dŵr', in Hywel T. Edwards (ed.), Merthyr a Thaf (Llandysul, 2001), p. 383."]}, {"page": "St Lythans burial chamber", "response": ["Musculoskeletal analysis of the human remains found at Parc Cwm long cairn (), Gower, has shown significant gender lifestyle variation. Male muscular development is greater — possibly from hunting or herding. In contrast, no such variation was noticeable in the remains found during the excavation from the nearby Tinkinswood burial chamber.History of Wales, 25,000 BC  AD 2000, Prys Morgan (Ed), 2001, Tempus, , p 20", "* Prys Morgan (Ed), \"History of Wales 25,000 B.C. A.D. 2000\" (Publisher: Tempus Publishing, 2001) "]}, {"page": "Cambrian Archaeological Association", "response": ["The Cambrian Archaeological Society was founded at a time when a sense of Welsh national identity was increasingly asserting itself. It was also at the moment that the dominance of the Antiquarian and Welsh learned societies centred in London were on the wane.Emrys Jones ed. (2001) The Welsh in London, 1500–2000, Cardiff: UWP, pp. 69–74 There were two earlier learned Welsh Cultural societies in London; the Cymmrodorion founded in 1751http://www.cymmrodorion.org/our-history: Prof Prys Morgan, “A Brief History of the Cymmrodorion”- this society was the successor to an earlier society, ‘The Most Honorable and Loyal Society of Antient Britons’, which had been founded in 1715 and the Cymreigyddion (who conducted all their business in the Welsh language) founded in 1770.R. T. Jenkins and Helen M. Ramage ‘A History of the Honourable Society of Cymmrodorion and the Gwyneddigion and Cymreigyddion Societies (1751-1951), Y Cymmrodor Vol 50  The Cymmrodorion had ceased to meet in 1843, although it was re-established in 1873, while the Cymreigyddion  disappeared completely in the 1850s. The premier English antiquarian society, the Society of Antiquaries of London, which had received its Royal Charter in 1745, was also in an impoverished state, having virtually bankrupted itself as the result of publishing ventures.Joan Evans\"A History of the Society of Antiquaries\", Oxford, 1956, 258–60 In Scotland the Society of Antiquaries of Scotland had been established in Edinburgh in 1780, while in Ireland the Royal Irish Academy, established in 1786, had its own Antiquities Section, and in 1890 the Royal Society of Antiquaries of Ireland had been formed from the Kilkenny Archaeological Society. Against this background the British Archaeological Association was founded in 1844, and was followed rapidly by a breakaway group, the Royal Archaeological Institute, which pioneered a model of holding annual meetings or congresses in various parts of the British Isles and producing an annual journal (published in quarterly parts). This was the model adopted by Cambrian Archaeological Association for Wales and the Marches.", "* 2017 Ironbridge: Professor Prys Morgan"]}, {"page": "Gruffudd", "response": ["One of the oldest forms which gave rise to all other variations is Grippiud or Gripuid, which evolved into Old Welsh Griffudd. The second element of the name, iudd, as a noun has a meaning of 'lord' and is found in other Welsh names such as Meredith (Mared[i]udd) and Bleidd[i]udd. In North Wales Griffudd evolved into Gruffudd.  “When u came to have the same quality as the clear y (the y of monosyllables and final syllables) the name generally became Gruffydd, and this is now regarded as the standard form,” according to T.J. Morgan and Prys Morgan.  Gruffudd of Old Welsh became spelt as Gruffydd in Middle Welsh and Modern Welsh of today. The high central vowel sound of u/y was lost entirely in South Wales and replaced by the i sound, and the form Griffidd became standard in the south, the region to first be encountered by Anglo-Norman scribes."]}, {"page": "Lloyd (name)", "response": ["The name Lloyd/Llwyd originates with the Welsh adjective llwyd, usually understood to mean \"grey\" and can be distinguished as a \"fixed epithet\" passed on from one generation to the next, as early as the 14th century. However, the word llwyd also has other meanings, especially if buttressed with other nouns or adjectives, such as penllwyd (grey-headed) and llwydwyn (grey-white). In addition to \"grey\" as most commonly understood, llwyd also includes shades of brown, according to T.J. Morgan and Prys Morgan.", "By the time that the adjective llwyd became a fixed epithet and then a family name, llwyd had more or less lost its original meaning of \"grey\".  T. J. and Prys Morgan note"]}, {"page": "Elis James", "response": ["On Welsh-language radio, he hosted Dwy Iaith, Un Ymennydd for BBC Radio Cymru. In this series he interviewed personalities such as Prys Morgan, Sioned Wiliam and Dafydd Iwan."]}, {"page": "Prys", "response": ["* Prys Morgan (born 1937), Welsh historian"]}, {"page": "Strategic Trade Advisory Group", "response": ["|Prys Morgan"]}]}}