{"wiki_id": "http://www.wikidata.org/entity/Q7328258", "itemLabel": "Richard Page", "itemDescription": "British politician (born 1941)", "wikipedia_url": "https://en.wikipedia.org/wiki/Richard_Page", "wikipedia_page": {"main": "Richard Lewis Page (born 22 February 1941) is a former Conservative Member of Parliament (MP) in the United Kingdom from 1976 to 1979 and from December 1979 to 2005.", "link_mentions": [{"page": "1979 United Kingdom general election", "response": ["|Richard Page"]}, {"page": "List of MPs elected in the 2001 United Kingdom general election", "response": ["| Richard Page", "| Richard Page"]}, {"page": "List of MPs elected in the 1992 United Kingdom general election", "response": ["|Richard Page"]}, {"page": "List of MPs elected in the 1997 United Kingdom general election", "response": ["|Richard Page"]}, {"page": "List of MPs elected in the 1987 United Kingdom general election", "response": ["|Richard Page"]}, {"page": "List of MPs elected in the 1983 United Kingdom general election", "response": ["|Richard Page"]}, {"page": "Ringo Starr discography", "response": ["! scope=\"row\"| \"Now The Time Has Come\"(featuring Billy Valentine, Casey McPherson, Christian Collins, Colin Hay, James Maslow, Kirsten Collins, Maddi Jane, Richard Page and Wesley Stromberg)"]}, {"page": "Rick Derringer", "response": ["Derringer went on three world tours with Ringo Starr & His All-Starr Band. Rehearsals started in June 2010. They traveled in Europe, Russia, South America, Mexico and the USA. The tour featured Wally Palmar, Edgar Winter, Gary Wright, Richard Page and Gregg Bissonette."]}, {"page": "List of United Kingdom by-elections (1979–2010)", "response": ["|Richard Page"]}, {"page": "Colin Hay", "response": ["| \"Now The Time Has Come\"(Ringo Starr, Richard Page, Colin Hay, Billy Valentine, Wesley Stromberg, Christian Collins, Kirsten Collins, Maddi Jane, Casey McPherson & James Maslow)"]}, {"page": "Workington (UK Parliament constituency)", "response": ["The constituency was created by the Representation of the People Act 1918, which also abolished the seat of Cockermouth. Workington has traditionally supported the Labour Party, although a by-election in 1976 (forced by the elevation of Fred Peart to the House of Lords) was won by Richard Page of the Conservative Party. However, the constituency reverted to type at the 1979 general election when it was regained by Labour, which it held until the 2019 general election, when Mark Jenkinson won the seat for Conservatives for the first time in forty years.", "| Richard Page"]}, {"page": "Champion Air", "response": ["In March 1997, Minnesota Twins owner Carl Pohlad and Northwest Airlines acquired the company from Richard Page. The airline relocated to Minneapolis, Minnesota, where it shared facilities and resources with Northwest. Champion Air replaced Sun Country Airlines as the leading charter operator for Northwest-owned MLT Vacations. In 2003, five Champion Air executives supposedly completed a management buy-out to take control of the airline. This was a facade created to prevent the higher-cost NWA pilots and union from forcing the group to shifting the flying to NWA's union pilots.  The airline continued to operate both VIP and general charters for MLT and other operators.  Champion Air continued to be run behind the scenes by Northwest executives, including an all-NWA board of directors."]}, {"page": "List of MPs elected in the 2005 United Kingdom general election", "response": ["| South West Hertfordshire || David Gauke || Conservative || Richard Page || Conservative"]}, {"page": "South West Hertfordshire (UK Parliament constituency)", "response": ["| Richard Page"]}, {"page": "David Gauke", "response": ["Gauke was elected to the House of Commons at the 2005 general election for Hertfordshire South West following the retirement of Richard Page. Gauke won the seat with a majority of 8,473, making his maiden speech on 9 June 2005.House of Commons Debates for 9 June 2005  UK Parliament Between 2005 and 2008, he served as a member of the Procedure Select committee. He was a member of the Treasury Select Committee between 2006 and 2007, before joining the Opposition front bench as Shadow Treasury Minister."]}, {"page": "List of United Kingdom MPs: P", "response": ["*Richard Page"]}, {"page": "The Rex, Berkhamsted", "response": ["A local campaign group, Friends of the Rex, was formed in 1997 with the aim of saving the Rex from demolition and acquiring it for use as a film centre, with film critic Barry Norman as their honorary president. The campaign was supported by the Twentieth Century Society, Joan Bakewell, and actors Hugh Grant, Hayley Mills and Ian Richardson. Campaigners formed the Rex Film and Arts Centre Trust to put forward a number of commercial proposals for a leisure complex including cinema screens, a swimming pool and a pub. The dilapidated state of the Rex was discussed in the House of Commons; Tom Clarke of the Department for Culture, Media and Sport declined to offer government subsidy for restoring the Rex, and the local MP Richard Page took the view that the Rex was now an eyesore and should be de-listed and demolished to make way for sheltered housing."]}, {"page": "Cumbrian MPs", "response": ["* Richard Page, Conservative, 1976-1979"]}, {"page": "List of United Kingdom by-elections (1950–1979)", "response": ["|Richard Page"]}, {"page": "University of Bedfordshire", "response": ["* Richard Page"]}, {"page": "Winner in You", "response": ["* Tracks 1, 5 & 8 produced by Richard Perry; Co-production on track 1 by Andy Goldmark and Bruce Roberts; Associate producer on track 5: Bill LaBounty; Co-production on track 8 by Richard Page and Steve George.  Recorded by Michael Brooks, with assistance by Glen Holgiun, Julie Last, John Boghosian, Thom Panunzio and Kraig Miller. Tracks 1 and 5 mixed by Bill Schnee; Track 8 mixed by Don Smith. "]}, {"page": "Geoffrey Dodsworth", "response": ["He became Deputy Leader of the Conservative Group on York City Council in 1964 and was a member of the Council for six years, serving on major committees specialising in financial matters. He was Member of Parliament for South West Hertfordshire from February 1974, and was re-adopted for the June 1979 election.He resigned as an MP in October 1979, on medical advice. He had held office in the backbench Shipping and Shipbuilding Committees and was Joint Secretary of the Finance Committee. Geoffrey also served on the Select Committees on The Wealth Tax and Statutory Instruments. Richard Page was elected to succeed him in the subsequent by-election. He returned north and was Chairman of the Vale of York constituency association in 1998 and stood for the North Yorkshire County Council in 1997."]}, {"page": "I'll Lead You Home", "response": ["* Richard Page – background vocals (6, 7, 10)"]}, {"page": "United Kingdom by-election records", "response": ["|Richard Page"]}, {"page": "List of Conservative Party MPs (UK)", "response": ["*Richard Page; MP for Workington (1976–1979) and South West Hertfordshire (1979–2005)"]}, {"page": "1976 Workington by-election", "response": ["The Workington by-election, 1976 was a parliamentary by-election held in England for the House of Commons constituency of Workington in Cumbria on 4 November 1976.  It was won by the Conservative Party candidate Richard Page, who became the first non-Labour MP in the constituency’s history.", "The Conservative Party candidate was Richard Page, who was 35 and had contested the Workington seat against Peart in both 1974 general elections."]}, {"page": "Richard Page (disambiguation)", "response": ["Richard Page is a former Conservative Member of Parliament in the United Kingdom.", "Richard Page may also refer to:", "*Richard Page (musician) (born 1953), lead singer and bassist in 1980s US band Mr. Mister", "*Richard Page (courtier) (died 1548), gentleman of the Privy Chamber at the court of Henry VIII of England", "*Richard Page (professor), professor of medicine", "*Richard Page (cricketer) (1910–2006), English cricketer and British Army officer"]}, {"page": "James Maslow", "response": ["! scope=\"row\"| \"Now The Time Has Come\"(Ringo Starr featuring Billy Valentine, Casey McPherson, Christian Collins, Colin Hay, James Maslow, Kirsten Collins, Maddi Jane, Richard Page and Wesley Stromberg)"]}, {"page": "Old Johnians (Hurstpierpoint College)", "response": ["* Richard Page, Conservative Member of Parliament"]}, {"page": "Second Major ministry", "response": ["| Richard Page"]}, {"page": "Page, Richard", "response": ["#redirectRichard Page"]}, {"page": "Melissa Peirce", "response": ["|rowspan=\"1\"|Richard Page"]}, {"page": "Kim Bullard", "response": ["|Richard Page"]}]}}