{"wiki_id": "http://www.wikidata.org/entity/Q7636261", "itemLabel": "Sulien", "itemDescription": "Bishop of St David's", "wikipedia_url": "https://en.wikipedia.org/wiki/Sulien", "wikipedia_page": {"main": "Sulien was an 11th-century Bishop of St David's, for two periods (1073-1078 and 1079/80-1085/6). He died about 1090/1.\nSulien is closely associated with the clas church at Llanbadarn Fawr near Aberystwyth where it appears that he took refuge when St David's was at times exposed to Viking incursions. Llanbadarn enjoyed a reputation for scholarship. One of his sons, Rhigyfarch was the author of a 'Life of Saint David'.", "link_mentions": [{"page": "Deheubarth", "response": ["In the arena of the church, Sulien was the leader of the monastic community at Llanbadarn Fawr in Ceredigion. Born ca. 1030, he became Bishop of St David's in 1073 and again in 1079/80. Both of his sons followed him into the service of the church. At this time the prohibition against the marriage of clerics was not yet established. His sons produced a number of manuscripts and original Latin and vernacular poems. They were very active in the ecclesiastical and political life of Deheubarth. One son, Rhygyfarch (Latin: Ricemarchus) of Llanbadarn Fawr, wrote the Life of Saint David and another, Ieuan, was a skilful scribe and illuminator. He copied some the works of Augustine of Hippo and may have written the Life of St. Padarn."]}, {"page": "Rhygyfarch", "response": ["Rhygyfarch or Rhigyfarch (in contemporary late Old Welsh orthography Ricemarch, 1057–1099), eldest son of Sulien, whom he may have succeeded in 1091 as Bishop of St David's, was the author of the standard Life of Saint David. The original text was written in Latin but was translated into Welsh later in the Middle Ages as Buchedd Dewi and did much to enhance the cult status of Saint David in Wales.  He also wrote Latin poems, including one dealing with the different versions of the Psalter, and another called \"Planctus Ricemarch\" (Rhygyfarch's Lament), bemoaning the state of those parts of south Wales under Norman occupation."]}, {"page": "Category talk:Ancient Christian denominations", "response": ["SS Mael and Sulien's Church, Corwennot yet classified", "Suliennot yet classified"]}, {"page": "Dewisland", "response": ["Following the incumbency of Sulien, the chapter had begun a pattern of appointing his close blood relatives as Bishop of St. Davids (first Rhygyfarch, his eldest son, then Wilfred, his brother.Fasti Ecclesiae Anglicanae 1066-1300: Volume 9, the Welsh Cathedrals (Bangor, Llandaff, St Asaph, St Davids)., Institute of Historical Research, London, 2003. p. 45 When they elected Daniel, Sulien's younger son, it began to look like a state with hereditary leadership; King Henry I was able to use the Norman presence around Dewisland to prevent Daniel's consecration."]}, {"page": "St Padarn's Church, Llanbadarn Fawr", "response": ["===The Later Celtic period and the dominance of Sulien and his family===", "At this period the Llanbadarn community was dominated by Sulien (1011–91) and his remarkable family. Around 1055 Sulien, who was born into a family educated for many generations in the clas monastic school or college of Llanbadarn Fawr, returned there after five years study in Scotland and ten years study in Ireland (according to his son and biographer). After this time Llanbadarn Fawr became possibly the foremost place of learning in Wales. Sulien went on to be known as Sulien the Wise. He became the abbot of Llanbadarn Fawr and served as Bishop of St David's twice. Under his abbacy Llanbadarn Fawr's monastic library grew in size and importance; reputedly larger than those of Canterbury Cathedral and York Minster.Elizabeth Rees, Celtic Sites and Their Saints: A Guidebook (Bloomsbury Publishing, London, 2003), p. 105. Libraries, primarily in monasteries and cathedrals, were at the heart of the growth in knowledge during the Renaissance of the twelfth century; in 1212 the council of Paris condemned those monasteries that still forbade loaning books, reminding them that lending is \"one of the chief works of mercy\"; George Haven Putnam, Books and Their Makers in the Middle Ages (Hillary House, New York, 1962).", "Later Sulien, now Bishop of St David's (he was bishop 1073–1078 and 1080–1086), himself took refuge at Llanbadarn Fawr from the Vikings who were raiding St David's.The Vikings were to attack St David's eleven times between 967 and 1091; Mark Redknap, \"Limits of Viking influence in Wales\" (December 1998) 40 British Archaeology 12–14. Many of the bishops were murdered by raiders and marauders, including Bishop Morgeneu I (also known as Morgenveth, Morgeney, Uregeneu) in 999 and Bishop Abraham (who had been newly elected to succeed Sulien) in 1080.", "In the time of Sulien and his sons and grandsons the clas at Llanbadarn Fawr was an important scriptorium where texts were composed and copied. Rhygyfarch or Rhigyfarch, who was Sulien's eldest son, and may have succeeded him as bishop of St David's (after Sulien's second time in post), wrote, surely at his father's request, his Vita Davidis or Life of St David (later translated into Welsh as Buchedd Dewi) c.1081 – c.1090.M. Lapidge, \"The Welsh-Latin poetry of Sulien's family\" (1973–4) 8–9 Studia Celtica 68–106. Clearly the book was intended to promote the restoration of the damaged see, especially in the face of the Norman challenge. Rhygyfarch and his brother Ieuan were both fine poets in Latin. Ieuan copied manuscripts and composed poetry (Ieuan also wrote, in Welsh, a verse to Padarn's staff Cyrwen).", "At the same time, produced in Llanbadarn c.1079, the Ricemarch PsalterThe psalter, now at Trinity College, Dublin as MS 50, includes the Letter of St. Jerome to Chromatius and Elidorus; Breviarius Apostolorum; Martyrologium Hieronymianum, and Various Tables. It shows Viking influence. is one of only two surviving manuscripts certain to have been produced in Wales in the eleventh century.The other is a manuscript of St. Augustine's De Trinitate, now in Cambridge, by the same scribe. See, generally, See M. Lapidge, \"The Welsh-Latin poetry of Sulien's family\" (1973–4) 8–9 Studia Celtica 68–106 and Gillian Conway, \"Towards a cultural context for the eleventh-century Llanbadarn manuscripts\" (1997) 13(1) Ceredigion: Journal of the Cardiganshire Antiquarian Society 9–28.", "The monks were in residence for scarcely twenty years. Llanbadarn would have been a simple or obedientiary priory, a dependency of the abbey. The superior of such a priory, who was subject to the abbot in everything, was called a \"prior.\" These monasteries were satellites of the mother abbey. In light of earlier activities at Llanbadarn, it is worth noting that the forty-eighth rule of Saint Benedict prescribes extensive and habitual holy reading for the brethren.Esther De Waal, A Life Giving Way: A Commentary on the Rule of St Benedict (A. & C. Black, London, 2006), pp. 140–5; Nirmal Kaur, History of Education (Mittal Publications, New Delhi, 2005), p. 44. However, Benedictine monks were disallowed worldly possessions, thus necessitating the preservation and collection of sacred texts in monastic libraries for communal use.Francis Wormald and C.E. Wright, The English Library before 1700 (The Athlone Press, London, 1958), p. 15. One of the key Benedictine practices was copying sacred texts, so it might be expected that the monks created a scriptorium, if indeed one hadn't survived from the time of Sulien and his sons and grandsons.", "The church seems to have been restored as a clas or re-founded as a college of secular priests (a collegiate church) before 1144, but the heyday of the clas churches had passed. Gloucester Abbey tried to recover the church in 1175 and again in 1251, and even appealed to the Pope, but without success.Janet Burton and Karen Stöber (eds), Abbeys and Priorities of Medieval Wales (University of Wales Press, Cardiff, 2015), p. 110. The ancient clas establishment seems to have re-emerged from the brief period of the priory, for mention occurs in the Welsh annals, in the year 1137, of the death of John (Ieuan),M'S 199 in the Parker Library of Corpus Christi College, Cambridge, contains a fragmentary late eleventh-century copy of the monumental treatise De Trinitate by St Augustine of Hippo. The National Library of Wales possesses a photographic facsimile of a small part of the manuscript (NLW Facsimile 196). CCCC 199 is the work of the scribal artist Ieuan ap Sulien, who both copied the text of Augustine's treatise and vigorously decorated it with over 150 coloured initials in a version of Irish zoomorphic interlace style. Francoise Henry stated that Ieuan was \"the scribe and probably also the painter, of CCCC 199\" (\"Remarks on the decoration of three Irish psalters\" (1960) 61C Proceedings of the Royal Irish Academy pp. 23–40, at p. 39). The close interrelationship between the initials and the text of the manuscript, the stylistic match between the decoration of CCCC 199 and Ieuan's artistic work in the Psalter and Martyrology made for his brother Rhigyfarch, and Ieuan's failure, in his concluding poem in CCCC 199, to mention anyone other than himself as having had a hand in producing the manuscript, establish that the initials are his work. See Timothy Graham, \"The poetic, scribal, and artistic work of Ieuan ap Sulien in Corpus Christi College, Cambridge, MS 199: addenda and assessment\" (1996) 29(3) National Library of Wales Journal 241–256. arch-priest or archdeacon of Llanbadarn, who could have been none other than Ieuan ap Sulien, of the great line of Sulien.Nora Kershaw Chadwick, \"Intellectual life in West Wales in the Last Days of the Celtic Church\", in Nora K. Chadwick, Kathleen Hughes, Christopher Brooke and Kenneth Jackson (eds), Studies in the Early British Church (Cambridge University Press, Cambridge, 1958), pp. 170. In the twelfth century clas churches were led by an abod with clergy under an \"archpresbyter\" (archoffeiriad).Morgan emphasises the revived use of the title \"arch-priest\"; Gerald Morgan, Ceredigion: A wealth of History (Gower, Llandysul, 2005), p. 99. However chantries in religious communities were sometimes headed by a warden or archpriest; D. Crouch, \"The Origins of the Chantry: Some Further Anglo-Norman Evidence,\" (2001) 27 Journal of Medieval History 159-80. An archpriest might also be senior priest, responsible for a number of parishes. One archpriest still exists in Britain, at Haccombe. This is a small hamlet in Devon. Its small chapel is dedicated to Saint Blaise. The benefice is occupied by an incumbent with the title of Archpriest. The archpresbytery was established in 1341 with six clergy: only the archpriest survived at the Reformation.. The parish is now combined with that of Stoke-in-Teignhead with Combe-in-Teignhead.", "In the same record, in the year 1146, the death of Sulien ab Rhygyfarch, \"a man of great knowledge, and one of the college of Llanbadarn\", is noted. By this time, after the loss of the Gloucester link, the church was again in the hands of a lay abbot; the use of the title abbot did not mean that the church was an abbey.", "The south transept (popularly known as Capel y Dre [the Chapel of the Town] or Capel Aberystwyth) is now a museum and chapel of St Padarn. This was built 1985–1988, in the space of the old transept, to designs by Peter Lord, with work by a number of notable craftspeople. It was an initiative of the town rather than of the church. The exhibition depicts the rich history of the area, with displays on St Padarn, and local people like William Morgan. A facsimile copy of Morgan's Bible is displayed there. Another display tells the life story of Sulien. There are three niches or recesses, which may once have held the monumental effigies of some of its priests, but no effigies remain. The two larger niches are in the central chapel; a smaller niche houses the altar stone in the chapel of St Padarn, to the left.", "thumb|South transept central room, showing position of standing crosses, and entrance to Sulien Room, Llanbadarn Fawr church", "The staff borne by St Padarn in the window is probably intended to represent Curwen, which was revered at Llangorwen. It was given to him by the Patriarch of Jerusalem, along with a cloak or tunic, or so the Life of Padarn (Vita Sancti Paternus) tells us.The most complete copy of the Life is the Cotton Vespasian Axiv, written c.1200 at Brecon or Monmouth; E.G. Bowen, A History of Llanbadarn Fawr (a limited edition published under auspices of the Ysgol Cwmpadarn Centenary Celebration Joint committee/Gomer Press, Llandysul, 1979), p. 26. Padarn's crozier (whatever its true origin) became Llanbadarn's most important relic, still apparently extant in the twelfth century when Ieuan ap Sulien (d.1137), in a poem written on the life of his father Sulien, writes \"no other relic can be compared with Cyrwen. A wonderful gift – Padarn's staff\". (Cyrwen means \"white staff\"). It was no doubt this same crozier – assuming that the relic was genuine – that Bishop Sulien brought with him to the meeting of William the Conqueror with the two Welsh princes, Rhys ap Tewdwr and Gruffudd ap Cynan at St. David's in 1081, when the English king recognised Lord Rhys as the legitimate ruler of Deheubarth;Thanks to Gerald Morgan for additional information; See also Neil Evans, \"The Golden Age of the Welsh Saints: St Padarn\" (http://www.parishofaberystwyth.org.uk/history.html).", "To the right of the centre room are two small exhibition rooms entered through a screen with two further etched glass windows by Lord, of summer and spring. The first chamber, to the left and the smallest (the counterpart of the chapel of St Padarn), is Sulien's room, which has an incised slate floor slab and lettered text around wall from the Elegy of Rhygyfarch, both by Ieuan Rees.", "* Graham, Timothy, \"The poetic, scribal, and artistic work of Ieuan ap Sulien in Corpus Christi College, Cambridge, MS 199: addenda and assessment\" (1996) 29(3) National Library of Wales Journal 241–256", "* Lapidge, M., \"The Welsh-Latin poetry of Sulien's family\" (1973–4) 8–9 Studia Celtica 68–106"]}, {"page": "Bleiddud", "response": ["According to the Annales Cambriae, Bleiddud died in 1071 and was succeeded as Bishop of St David's by Sulien. According to the account of Brut y Tywysogion for the year 1071, ", "By the ninth century, and later, the right of the clergy to marry was well established in Wales, and an entry in the Book of St Chad records the grant of freedom to Bleiddud, son of Sulien, this apparently being the Sulien who succeeded Bishop Bleiddud. Gerald of Wales also notes that at the time it was usual for sons to follow fathers in church benefices.John Edward Lloyd, A History of Wales from the Earliest Times to the Edwardian Conquest (2009 edition), p. 215 The Book of Llandaff, dating from around 1125, also records a \"decree of the liberty of Bleiddud and his offspring\".W. J. Rees, ed., The Liber Landavensis, Llyfr Teilo, or the ancient register of the cathedral church of Llandaff (W. Rees for Welsh MSS. Society, 1840), p. 618: \"Whoever will keep this decree of the liberty of Bleiddud and his offspring, may he be blessed ; and whoever will not keep it, may he be cursed by God...\""]}, {"page": "Bishop of St Davids", "response": ["|align=center| ||align=center| ||Sulien ||Also Sulghein, Sulgenius. Resigned.", "|align=center| ||align=center| ||Sulien ||Restored."]}, {"page": "Cristiolus", "response": ["According to tradition, he was a son of Hywel, son of Emyr Llydaw and therefore brother to Sulien, Rhystud and Derfel Firm, and perhaps also Dwywe (or Dwywau)."]}, {"page": "Abraham (bishop of St David's)", "response": ["Abraham (died 1080) was Bishop of St David's and the Cathedral Close in Pembrokeshire, Wales from 1078, when he succeeded Sulien, until his murder in 1078Jones, William Basil and Freeman, Edward Augustus. The History and Antiquities of Saint David's, J. H. & J. Parker; J. R. Smith, and J. Petheram, 1856, p. 268 or 1080, during a Viking invasion. Sulien then served again as bishop."]}]}}