{"wiki_id": "http://www.wikidata.org/entity/Q7793755", "itemLabel": "Thomas Salisbury", "itemDescription": "Welsh aristocrat", "wikipedia_url": "https://en.wikipedia.org/wiki/Thomas_Salisbury", "wikipedia_page": {"main": "Sir Thomas Salisbury (or Salusbury) (1564 – 21 September 1586) was one of the conspirators executed for his involvement in the Babington Plot.", "link_mentions": [{"page": "Babington Plot", "response": ["The conspirators were sentenced to death for treason and conspiracy against the crown, and were to be hanged, drawn, and quartered. This first group included Babington, Ballard, Chidiock Tichborne, Thomas Salisbury, Henry Donn, Robert Barnewell and John Savage. A further group of seven men including Edward Habington, Charles Tilney, Edward Jones, John Charnock, John Travers, Jerome Bellamy, and Robert Gage, were tried and convicted shortly afterward. Ballard and Babington were executed on 20 September 1586 along with the other men who had been tried with them. Such was the public outcry at the horror of their execution that Elizabeth changed the order for the second group to be allowed to hang until \"quite dead\" before disembowelling and quartering.", "A 45-minute drama entitled The Babington Plot, written by Michael Butt and directed by Sasha Yevtushenko, was broadcast on BBC Radio 4 on 2 December 2008. This drama took the form of a documentary on the one-year anniversary of the executions, with the story being told from the perspective of Thomas Salisbury, Robert Poley, Gilbert Gifford and others who, while not conspirators, are in some way connected with the events, all of whom are interviewed by the Presenter (played by Stephen Greif). The cast also included Samuel Barnett as Thomas Salisbury, Burn Gorman as Robert Poley, Jonathan Taffler as Thomas Phelippes and Inam Mirza as Gilbert Gifford."]}, {"page": "Anthony Babington", "response": ["In about 1580, while travelling on the continent, he had met the arch-conspirator Thomas Morgan, and he was persuaded to courier letters to Mary while she was still being held by his former master, the Earl of Shrewsbury. He also assisted the movement of priests in the Catholic Midlands. But by 1586, with Mary removed to the harsher regime of Tutbury and the consequent closing down of communications with her, Babington's role as a courier came to an end. Twice in early 1586 he received letters from France, destined for Mary, but in each case he declined to 'deal further in those affairs'. Around this time he was reportedly considering leaving England permanently and was trying to secure a passport along with his Welsh friend, Thomas Salisbury. He obtained an introduction to Robert Poley, a man with good political contacts, with a view to securing a 'licence' to go to France. Poley, unknown to Babington, was an agent for Francis Walsingham, the Secretary of State, and was under orders to infiltrate known Catholic circles. He probably intentionally failed to obtain a passport for Babington, and instead persuaded him that he, Poley, was a Catholic sympathiser and could be trusted.  It was Babington's misplaced trust of, and possibly even love for, Poley that was a large contributory factor in his eventual downfall.Nicholl, Charles; The Reckoning (2002)", "In 2008 BBC Radio 4 broadcast an Afternoon Play by Michael Butt entitled The Babington Plot directed by Sasha Yevtushenko with Stephen Greif as \"The Presenter\", done in documentary-style and told from the perspective of some of the conspirators – some genuine, some government spies that had infiltrated the group - and several people who were in various ways involved in the events. Babington is portrayed as homosexual and having a relationship with Thomas Salisbury (played by Samuel Barnett) and then Robert Poley (played by Burn Gorman)."]}, {"page": "Salusbury family", "response": ["* Sir Thomas Salisbury (1564–1586)"]}, {"page": "List of people executed by the Tudors", "response": ["|Sir Thomas Salisbury"]}, {"page": "Samuel Barnett (actor)", "response": ["| Thomas Salisbury"]}, {"page": "Lleweni Hall", "response": ["* After the execution of Thomas Salisbury of Lleweni in 1586 for his involvement in the Babington Plot, Lleweni passed to his brother Sir John Salusbury of Lleweni (d. 1612). "]}, {"page": "St Giles in the Fields", "response": ["|Thomas Salisbury"]}, {"page": "Humphrey Llwyd", "response": ["Humphrey Llwyd (also spelled Lhuyd) (1527–1568) was a Welsh cartographer, author, antiquary and Member of Parliament. He was a leading member of the Renaissance period in Wales along with other such men as Thomas Salisbury and William Morgan. His library, together with those of his patron, the Earl of Arundel and his brother-in-law, Lord Lumley, formed the basis of the Royal Collection of books; currently housed at the British Library. His motto was  (\"Fame lasts longer than wealth\").Jones 2014."]}, {"page": "16th century in Wales", "response": ["*20 September - Thomas Salisbury, conspirator (executed), 22?"]}, {"page": "1580s in England", "response": ["** 20–21 September – execution of Anthony Babington, John Ballard, Chidiock Tichborne, Thomas Salisbury and the other 10 conspirators in the Babington Plot, who are hanged, drawn and quartered (the first seven being disembowelled before death) in St Giles Field, London."]}, {"page": "Thomas Salusbury", "response": ["*Sir Thomas Salisbury (c. 1564–1586),  Thomas Salusbury, one of the conspirators executed for his involvement in the Babington Plot", "*Sir Thomas Salusbury, 2nd Baronet (1612–1643), a.k.a. Sir Thomas Salisbury, a  Welsh poet, politician and Royalist colonel during the Civil War"]}, {"page": "Robert Poley", "response": ["In June 1586 Poley's cover as a Catholic sympathiser in Sir Francis's household was still working as he was asked to help obtain passports from Walsingham for Sir Anthony Babington and his fellow-conspirator Thomas Salisbury. From then on Poley became Babington's \"servant and companion\" and was often seen in his company despite doubts about Poley's trustworthiness being expressed by some Catholics. In the first two weeks of August, the conspiracy came to its fateful conclusion. On 2 June the conspirators had met and dined \"in Poley's garden\", the house having actually been requisitioned by the government from a Queen's Messenger, Anthony Hall. Babington found Poley copying some of his papers, but Poley was able to talk his way out of it. On the following day, Poley briefed Sir Francis and on 4 June passed messages from him back to Thomas Walsingham, who seems to have been the case officer. Although the conspirators fled they were all caught. In his cover as one of them Poley was committed to the Tower on 18 August, \"charged to have dealt treacherously\", but the Catholics weren't fooled. Anthony Babington, who was executed on 20 September, feared that it was Poley who had betrayed him, but he could never bring himself fully to accept it. After his arrest Babington sent Poley a letter saying \"Farewell sweet Robyn, if as I take thee, true to me. If not adieu, omnius bipedum nequissimus [of all two-footed creatures the vilest].\" Babington also asked him to return a diamond ring."]}, {"page": "John Salusbury (died 1578)", "response": ["He had married Jane, the daughter and coheiress of David Myddelton of Chester, Cheshire, and had six sons and two daughters.  His eldest son and heir John predeceased him in 1566.Ballinger, John. \"Katheryn of Berain\", Y Cymmrodon, Vol. XL, The Honourable Society of Cymmrodian, London, 1929 On his death, he was buried in St Marcel's church, Denbigh. His grandson Sir Thomas Salisbury was later executed for complicity in the Babington Plot."]}, {"page": "Salisbury, Thomas", "response": ["#redirectThomas Salisbury"]}]}}