{"wiki_id": "http://www.wikidata.org/entity/Q7807530", "itemLabel": "Timothy Stamps", "itemDescription": "Zimbabwean politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Timothy_Stamps", "wikipedia_page": {"main": "Timothy John Stamps (15 October 1936 – 26 November 2017) was a Zimbabwean politician and doctor who served in the Government of Zimbabwe as Minister of Health from 1986 to 2002. For most of that period, he was the only white member of the government.", "link_mentions": [{"page": "White Zimbabweans", "response": ["In the period immediately after independence, some White political leaders (such as Ian Smith) sought to maintain the identity of White Zimbabweans as a separate group. In particular, they wished to maintain a separate \"White roll\", maintaining the election of 20 seats in parliament reserved for White people; this was abolished in 1987). Despite this, a number of White Zimbabweans embraced the political changes, and many even joined Zanu-PF in the 1980s and 1990s: for example, Timothy Stamps served as Minister of Health in the Zimbabwean government from 1986 to 2002.", "In July 2002, 92 prominent Zimbabweans were subject to EU \"smart sanctions\", intended to express disapproval of various Zimbabwe government policies. These persons were banned from the EU, and access to assets they own in the EU was frozen.UN press release, 2002 :EU names Zimbabwe blacklist  91 of those on the blacklist were Black, and one was White: Dr. Timothy Stamps."]}, {"page": "1936 in Wales", "response": ["*15 October - Timothy Stamps, Minister of Health in Zimbabwe (died 2017 in Zimbabwe)"]}, {"page": "1980 Southern Rhodesian general election", "response": ["Comparatively little interest was shown in the election for the 20 white roll seats, partly because those elected were unlikely to have much influence in the independent Zimbabwe, but mostly because all seats were expected to be won easily by the Rhodesian Front under Ian Smith. Fourteen out of the twenty seats were filled unopposed, and only two candidates in the other seats could put up a reasonable challenge to the Rhodesian Front candidate. One was Dr Timothy Stamps, a newcomer to politics, in the Kopje constituency covering the centre of Salisbury. Stamps advocated co-operation with the new black-led government. In addition, Nick McNally, who had led the liberal 'National Unifying Force' which opposed white dominance, ran in Mount Pleasant in the Salisbury suburbs.", "| Timothy Stamps"]}, {"page": "David Parirenyatwa", "response": ["Parirenyatwa served as Deputy Minister of Health and Child Welfare until he was appointed as Minister of Health and Child Welfare in August 2002. He replaced Timothy Stamps, who was ill; Parirenyatwa had already been effectively in charge of the ministry for some time due to Stamps' illness.\"Zimbabwe: New government without Makoni\" , SADOCC, August 25, 2002."]}, {"page": "List of white Africans of European ancestry", "response": ["*Timothy Stamps, politician"]}]}}