{"wiki_id": "http://www.wikidata.org/entity/Q7818042", "itemLabel": "Tom Whittaker", "itemDescription": "Mountain climber", "wikipedia_url": "https://en.wikipedia.org/wiki/Tom_Whittaker_(mountaineer)", "wikipedia_page": {"main": "Tom Whittaker (born 1948 in York) was the first disabled person to climb to the summit of Mount Everest.Whittaker's right foot needed to be amputated following a car accident in 1979. Following this serious accident, he regained his strength and continued climbing. He was educated at Idaho State University\nIn 1981 he founded the Cooperative Wilderness Handicapped Outdoor Group (C.W.HOG) in Pocatello, Idaho. While living in Idaho, he was active in the southeast Idaho climbing community.\nHis first attempt on Everest was in 1995.On May 27, 1998, on his third attempt, Whittaker reached the summit of Mt. Everest, a lifelong dream, making him the first person with a disability to accomplish this feat.\nWhittaker's current quest is to climb the highest peaks on all seven continents.\nIn the 2006 Queen's Birthday Honours List, Whittaker was appointed Member of the Order of the British Empire (MBE). Tom currently lives in Prescott Arizona with his daughter, Georgia.", "link_mentions": [{"page": "Thomas Whittaker", "response": ["Thomas or Tom Whittaker may refer to:", "*Tom Whittaker (footballer) (1898–1956), football player and manager of Arsenal F.C.", "*Tom Whittaker (mountaineer) (born 1948), disabled mountaineer, the first disabled person to climb Mount Everest", "*Tom Whittaker (rugby union) (born 1986), English rugby union footballer", "*Tom Whittaker (trade unionist) (died 1995), English trade union leader"]}, {"page": "Scott Carpenter Space Analog Station", "response": ["After the success of Mission One, the station was outfitted for an expanded mission during the following summer in what was known as the NASA Challenge Mission . The Challenge Mission ran concurrently with the Space Shuttle Mission STS-95, the mission which featured veteran astronaut John Glenn. At the launch of the Space Shuttle, the Scott Carpenter Station Mission Commander, Dennis Chamberland and his crew embarked for an unbroken 11-day stay on the seafloor for the same period the Space Shuttle was in space. Following the flight, visitors to the seafloor station included motion picture director James Cameron, who conferenced with students in Pond Inlet, Nunavut via satellite phone,  as well as producer Eugene Roddenberry II and Mount Everest Explorer–climber, Tom Whittaker. In 1997, the station logged more than 36 days of manned missions on the seafloor."]}, {"page": "Timeline of Mount Everest expeditions", "response": ["*  Naturalized American and British born Tom Whittaker, whose right foot had been amputated, became the first disabled person to successfully reach the summit."]}, {"page": "List of Mount Everest records", "response": ["|Tom Whittaker"]}, {"page": "List of 20th-century summiters of Mount Everest", "response": ["* Tom Whittaker on May 27, 1998"]}]}}