{"wiki_id": "http://www.wikidata.org/entity/Q7822067", "itemLabel": "Tony Clark", "itemDescription": "British darts player", "wikipedia_url": "https://en.wikipedia.org/wiki/Tony_Clark_(darts_player)", "wikipedia_page": {"main": "Tony Clark is a Welsh former professional darts player who competed in events of the British Darts Organisation (BDO) in the 1970s and 1980s.", "link_mentions": [{"page": "Anthony Clark", "response": ["Anthony or Tony Clark may refer to:", "*Tony Clark (footballer) (born 1977), retired English footballer", "*Tony Clark (darts player) (born 1955), Welsh darts player", "*Tony Clark (politician) (born 1971), North Dakota Public Service Commissioner", "*Tony Clark (born 1972), former professional baseball player", "*Tony Clark (sport shooter) (born 1924), British Olympic shooter", "*Tony Clark, Blessid Union of Souls's bass guitarist"]}, {"page": "Alan Glazier", "response": ["* 1980: 1st Round (lost to Tony Clark 0-2) "]}, {"page": "Bill Lennard", "response": ["He enjoyed a successful year in 1976 by winning the prestigious News of the World Darts Championship (representing the Cotton Tree Inn, Manchester), the British Matchplay and the Swedish Open. The World Professional Darts Championship did not begin until two years later, Lennard made his debut at the championships in 1979 but lost his first round match to Tony Clark.", "His best run at the World Championships came in 1980 when he reached the quarter-finals, but was beaten by Tony Brown. Tony Clark again beat Lennard in the first round in 1981 and his last appearance in the World Championship came in 1982 when he was beaten by John Lowe.", "*1979: First round (lost to Tony Clark 0–2)", "*1981: First round (lost to Tony Clark 1–2)"]}, {"page": "Allan Hogg", "response": ["After winning the 1978 Canadian National Championship who will beat Hillyard Rossiter, Hogg reached the final of the 1979 Winmau World Masters. He defeated Tony Brown, Tony Clark and Barry Done before losing to Eric Bristow. In 1980. He was on the Unipart World Team Darts Matchplay with Tony Holyoake and Tony Foley to Canada. He then played in the 1980 BDO World Darts Championship, losing in the first round to Australian Alan Grant. In the 1981 BDO World Darts Championship, Hogg defeated Les Capewell in the first round before losing to John Lowe in round two."]}, {"page": "Nordic Invitational", "response": ["|  Leighton Rees / Tony Clark"]}, {"page": "BDO International Grand Prix Series", "response": ["|  Ian Jones  Robert Thornton Alan Walker  Tony Clark"]}]}}