{"wiki_id": "http://www.wikidata.org/entity/Q7976416", "itemLabel": "Wayne Law", "itemDescription": "cricketer", "wikipedia_url": "https://en.wikipedia.org/wiki/Wayne_Law", "wikipedia_page": {"main": "Wayne Lincoln Law (born 4 September 1978) is a former Welsh cricketer. Law was a right-handed batsman who bowled right-arm off break. He was born at Swansea, Glamorgan.\nHaving played since his teens for Swansea Cricket Club, the Glamorgan Second XI since 1995, as well as having spent time on the Lord's groundstaff where he played for MCC Young Cricketers in 1996, Law eventually made his first-class debut for Glamorgan in 1997 against Oxford University, hitting his first ball of the match for four and eventually ending on 38 not out in Glamorgan's second-innings. This was his only first-class appearance that season, though he made his List A debut, playing in Glamorgan's final two fixtures of the 1997 AXA Life League against Surrey and Essex. During this season, Law also appeared once for Wales Minor Counties against Herefordshire in the Minor Counties Championship, while the following season he would make a single MCCA Knockout Trophy appearance for the club against the Warwickshire Cricket Board.His performances encouraged then Glamorgan coach Duncan Fletcher, who considered Law to have natural flair and graceful timing, to give him an extended run in the Glamorgan side the following season, following the retirement of Hugh Morris at the end of the 1997 season. Over the coming three seasons, he made a total of 22 further first-class appearances, the last of which came against Nottinghamshire in the 2000 County Championship. In total, he scored 883 runs at an average of 28.48, with a high score of 131. This innings of note came against Lancashire at Colwyn Bay in 1998. Though he struggled for consistency, he still made notable contributions to the Glamorgan cause, notably against Lancashire at Blackpool in 1999 when he held out against Muttiah Muralitharan for over four hours in making 53 in Glamorgan's second-innings, though Lancashire still won the game by 10 wickets. Law was utilised more in first-class cricket, making just nine further List A appearances following his debut in that format in 1997. He played his final List A match against Middlesex in the 2000 National League. Law struggled during the opportunities he was given in this format, scoring just 104 runs at an average of 11.55, with a high score of 24.Having failed to secure a regular place in the Glamorgan team during the 2000 season, Law was released by county at the end of that season.\n\n", "link_mentions": [{"page": "Wayne State University Law School", "response": ["Wayne State University Law School (Wayne Law) is the law school of Wayne State University in Detroit. Wayne Law is located in Midtown, Detroit's Cultural Center. Founded in 1927, the law school offers juris doctor (J.D.), master of laws (LL.M.), online master of studies in law, and minors in law degree programs. Wayne Law's more than 12,000 alumni include judges, justices, law firm partners and government officials working in every major market in the United States and at least 17 countries.", "The Law School received full American Bar Association (ABA) accreditation in 1939.  The school's Moot Court program (originally called the Case Club) was established in 1938, and the Wayne Law Review began publication in 1954. As an additional honor, members of the Wayne Law Review were awarded Juris Doctor (J.D.) degrees rather than LL.B. degrees (J.D. degrees were awarded to all law students with an undergraduate degree beginning in 1965). In 1965, the Law School's students founded the Free Legal Aid Clinic, which is now operated in conjunction with Lakeshore Legal Aid and Neighborhood Legal Services.", "Wayne Law offers six different degree options.", "Wayne Law offers three J.D. program options for students. They include a full-time day program, a combined day and evening program, and a part-time evening program.", "Wayne Law's online Master of Studies in Law (MSL) degree is specifically designed to help specialists in human resources expand their knowledge of legal principles and the U.S. legal system.", "Lawyers who already have earned a J.D. degree from an accredited U.S. law school or an equivalent degree in another country and satisfy Wayne Law's LL.M. admissions criteria are eligible to undertake advanced legal studies for a LL.M. degree at Wayne Law. LL.M. majors include Corporate and Finance Law, Labor and Employment Law, and Taxation.", "Wayne Law’s joint J.D./LL.M. degree program allows students to earn both a J.D. and LL.M. in only seven semesters, rather than the eight semesters that would usually be required for a full-time student to complete both a J.D. degree (in three years) and an LL.M. degree (in one year).", "Wayne Law offers dual degree programs allowing students to earn both a J.D. and a master’s degree. Students can earn a master’s in one of the following disciplines in conjunction with other schools at Wayne State:", "Wayne Law operates eight clinics that are directed by expert faculty and experienced practitioners. The clinics provide hands-on casework to law students while simultaneously assisting residents of the metro Detroit community.", "Academic journals at Wayne Law include:", "Founded in 1997, The Journal of Law in Society is a student-managed publication of Wayne Law that provides scholarly discourse on the intersection of law and society. It is the scholarly arm of the Damon J. Keith Center for Civil Rights at Wayne Law.", "Established in 2017, the Journal of Business Law is a scholarly peer-reviewed journal operated and edited by students at Wayne Law.", "==== Wayne Law Review ====", "The Wayne Law Review contains articles, book reviews, transcripts, notes and comments by prominent academics, practitioners and students on timely legal topics.", "Wayne Law offers three externship programs and a Free Legal Aid Clinic to J.D. and LL.M. students:", "In 2011, Wayne Law opened the Damon J. Keith Center for Civil Rights at Wayne Law, named for Judge Damon J. Keith of the U.S. Court of Appeals for the Sixth Circuit, an alumnus of the Law School. The Keith Center addresses the civil rights needs of southeast Michigan and the nation by promoting the educational, economic and political power of underrepresented communities in urban settings. The Detroit Equity Action Lab at the Keith Center is funded by $2.9 million from the W.K. Kellogg Foundation. The center is also home to the Damon J. Keith Collection of African-American Legal History.", "=== Levin Center at Wayne Law ===", "In 2015, The Levin Center at Wayne Law was established and named for former U.S. Sen. Carl Levin. The Levin Center educates future attorneys, business leaders, legislators and public servants on their role overseeing public and private institutions and using oversight as an instrument of change.", "The Program for International Legal Studies is the focal point for all international activity at Wayne Law. Its study abroad programs and international fellowships give students a first-hand view of other nations' legal systems and approaches to legal education.", "The National Jurist and prelaw magazine have recognized Wayne Law as a Best Value Law School for seven years in a row, beginning in 2014. Wayne Law has been the only Michigan law school to be listed several times.", "In 2018, prelaw magazine recognized Wayne Law as one of the best law schools in the nation for practical training.", "U.S. News & World Report’s rankings for 2022 placed Wayne Law No. 72 overall, No. 83 in clinical training and No. 24 in part-time law programs.", "According to Wayne Law’s ABA-required disclosures for the class of 2019, 85.1% of graduates were employed in full-time, long-term positions that require bar passage or are J.D. advantage within ten months of graduation. Wayne Law’s overall employment rate for the class of 2019 was 88.6%. Wayne Law is No. 51 nationally and No. 2 in Michigan for placing recent graduates in full-time, long-term jobs that require bar passage or for which a J.D. is an advantage.", "* Jocelyn Benson, expert on civil rights law, education law and election law; former Wayne Law dean", "* Carl Levin, former U.S. Senator; Chair of Levin Center; distinguished legislator in residence, Wayne Law"]}, {"page": "List of Glamorgan County Cricket Club players", "response": ["* Wayne Law (1997–2000) : W. L. Law"]}]}}