{"wiki_id": "http://www.wikidata.org/entity/Q8016424", "itemLabel": "William Owen Pughe", "itemDescription": "Welsh lexicographer", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Owen_Pughe", "wikipedia_page": {"main": "William Owen Pughe (7 August 1759 – 4 June 1835) was a Welsh antiquarian and grammarian best known for his Welsh and English Dictionary, published in 1803, but also known for his grammar books and \"Pughisms\" (neologisms).", "link_mentions": [{"page": "Dafydd ap Gwilym", "response": ["* Translations into English verse from the poems of Davyth ap Gwilym, a Welsh bard of the fourteenth century (1834).Dafydd ap Gwilym, 1. cent. (1834). Translations into English verse from the poems of Davyth ap Gwilym, a Welsh bard of the fourteenth century. London: H. Hooper. By a translator only identified as Maelog, with A sketch of the life of Davyth ap Gwilym. Dedicated to William Owen Pughe."]}, {"page": "Mabinogion", "response": ["The first modern publications were English translations by William Owen Pughe of several tales in journals in 1795, 1821, and 1829.1. William Owen Pughe. 1795. \"The Mabinogion, or Juvenile Amusements, Being Ancient Welsh Romances\". Cambrian Register, 177–187.2. William Owen Pughe. 1821. \"The Tale of Pwyll\". Cambro-Briton Journal 2 (18): 271–275. 3. William Owen Pughe. 1829. \"The Mabinogi: Or, the Romance of Math Ab Mathonwy\". The Cambrian Quarterly Magazine and Celtic Repository 1: 170–179. However it was Lady Charlotte Guest in 1838–45 who first published the full collection, bilingually in Welsh and English. She is often assumed to be responsible for the name \"Mabinogion\", but this was already in standard use in the 18th century. Indeed, as early as 1632 the lexicographer John Davies quotes a sentence from Math fab Mathonwy with the notation \"Mabin\" in his Antiquae linguae Britannicae ... dictionarium duplex, article \"Hob\". The later Guest translation of 1877 in one volume has been widely influential and remains actively read today.Available online since 2004. Charlotte Guest. 2004. \"The Mabinogion\". Gutenberg. http://onlinebooks.library.upenn.edu/webbin/gutbook/lookup?num=5160. The most recent translation is a compact version by Sioned Davies.Sioned Davies. 2007. The Mabinogion. Oxford: Oxford University Press. John Bollard has published a series of volumes with his own translation, with copious photography of the sites in the stories.1. John Kenneth Bollard. 2006. Legend and Landscape of Wales: The Mabinogi. Llandysul, Wales: Gomer Press.2. John Kenneth Bollard. 2007. Companion Tales to The Mabinogi. Llandysul, Wales: Gomer Press.3. John Kenneth Bollard. 2010. Tales of Arthur: Legend and Landscape of Wales. Llandysul, Wales: Gomer Press. Photography by Anthony Griffiths. The tales continue to inspire new fiction,For example, the 2009–2014 series of books commissioned by Welsh independent publisher Seren Books; but the earliest reinterpretations were by Evangeline Walton starting in 1936. dramatic retellings,e.g. Robin Williams; Daniel Morden. visual artwork, and research.", "The name first appears in 1795 in William Owen Pughe's translation of Pwyll in the journal Cambrian Register under the title \"The Mabinogion, or Juvenile Amusements, being Ancient Welsh Romances\".Peter Stevenson, Welsh Folk Tales. The History Press, 2017, np.   The name appears to have been current among Welsh scholars of the London-Welsh Societies and the regional eisteddfodau in Wales. It was inherited as the title by the first publisher of the complete collection, Lady Charlotte Guest. The form mabynnogyon occurs once at the end of the first of the Four Branches of the Mabinogi in one manuscript. It is now generally agreed that this one instance was a mediaeval scribal error which assumed 'mabinogion' was the plural of 'mabinogi', which is already a Welsh plural occurring correctly at the end of the remaining three branches.S Davies trans. The Mabinogion (Oxford 2007) pp. ix–x", "Lady Charlotte Guest's work was helped by the earlier research and translation work of William Owen Pughe. The first part of Charlotte Guest's translation of the Mabinogion appeared in 1838, and it was completed in seven parts in 1845. A three-volume edition followed in 1846, and a revised edition in 1877.  Her version of the Mabinogion remained standard until the 1948 translation by Gwyn Jones and Thomas Jones, which has been widely praised for its combination of literal accuracy and elegant literary style.  Several more, listed below, have since appeared."]}, {"page": "Lady Charlotte Guest", "response": ["Lady Charlotte Elizabeth Guest (née Bertie; 19 May 1812 – 15 January 1895), later Lady Charlotte Schreiber, was an English aristocrat who is best known as the first publisher in modern print format of  The Mabinogion which is the earliest prose literature of Britain. Guest established  The Mabinogion as a source literary text of Europe, claiming this recognition among literati in the context of contemporary passions for the Chivalric romance of King Arthur and the Gothic movement. The name  Guest used for the book was derived from a mediaeval copyist's error,  already established in the 18th century by William Owen Pughe and the London Welsh societies.", "Some characters from the tales had been profiled in William Owen Pughe's Myvyrian Archaiology of Wales. Pughe published a translation of the first episode of Pwyll, from the First Branch, in 1795, and again in 1821. He made a complete translation of all the tales, but the work was unpublished at his death in 1835. Guest did not rely on Pughe's translations, though she did use a Welsh dictionary Pughe had completed in 1803."]}, {"page": "List of legendary kings of Britain", "response": ["Iolo Morganwg, between 1801 and 1807, published a series of Welsh Triads he claimed to have discovered in manuscript form, with the help of the antiquarian William Owen Pughe. These were later revealed to be a mixture of forgeries by Morganwg and Williams' alterations to authentic triads.Maryjones.usMaryjones.us Exactly how much \"authentic\" content there is of Morganwg's published work remains disputed by scholars today. Morganwg's triads describe the earliest occupation of Britain (Prydain) and contain a pseudo-historical reign of kings, beginning with Hu Gadarn, the \"Plough King\".Iolo manuscripts, Iolo Morganwg, Owen Jones, Society for the Publication of Ancient Welsh Manuscripts, Abergavenny, W. Rees; Longman and co., London, 1848."]}, {"page": "Iolo Morganwg", "response": ["Williams worked with Owen Jones and William Owen Pughe on The Myvyrian Archaiology of Wales, a three-volume collection of medieval Welsh literature published in 1801–1807. This relied partly on manuscripts in Williams's collection, some his forgeries. The forged material included a false Brut chronicle and a book attributed to Saint Cadoc. The second volume, which collected the Welsh Triads, contained an additional \"third series\" of forged triads, as well as Williams's alterations to the authentic ones."]}, {"page": "River Aeron", "response": ["The name of the river means \"battle\" or \"slaughter\" and derives from the Middle Welsh  with the same meaning. Aeron is believed to have been a Welsh god of war.p.144 A Wander Around the Coast of Wales by Steve Plant, FastPrint Publishing, 2014 Past interpretations of the name have included that of William Owen Pughe, who in his Dictionary of the Welsh Language believed  meant \"queen of brightness\".William Owen Pughe, A Dictionary of the Welsh Language: Explained in English, Volume 1, 1803, page 23. Aeron can also mean berries, fruit and grain. It’s a word that suggests the fruitfulness of the autumn harvest in a valley of plenty.Meaning of Aeron"]}, {"page": "List of Welsh-language authors", "response": ["*William Owen Pughe (1759–1835)"]}, {"page": "Owen Jones (antiquary)", "response": ["He had from boyhood studied Welsh literature, and later devoted time and money to its collection. Assisted by Edward Williams of Glamorgan (Iolo Morganwg) and Dr. William Owen Pughe, he published, at a cost of more than £1000, the well-known Myvyrian Archaiology of Wales (1801–1807), a collection of pieces dating from the 6th to the 14th century. The manuscripts which he had brought together are deposited in the British Library; the material not utilized in the Myvyrian Archaiology amounts to 100 volumes, containing 16,000 pages of verse and 15,300 pages of prose."]}, {"page": "Daniel Silvan Evans", "response": ["According to Thomas Parry (History of Welsh Literature to 1900), Silvan Evans coined the word \"telyneg\" to render the English \"lyric\", hence the title of an early work, Telynegion (1846), which apparently contained translations from Anacreon, Sappho, Ovid, French sonnets, and the work of English poets, especially Lord Byron. Parry judges Silvan Evans to have been overmuch influenced by William Owen Pughe's Dictionary in his use of vocabulary. However, R. E. Hughes in the Dictionary of Welsh Biography (1959) claims that Evans \"gradually became emancipated\" from Pughe's work."]}, {"page": "Nantglyn", "response": ["Nantglyn has had several notable residents over the centuries, including David Samwell (1751–98), the ship's surgeon aboard the Discovery during Captain Cook's final voyage of exploration. Samwell kept a journal that provides a detailed record of the voyage, and he witnessed Cook's death at the hands of hostile natives in Hawaii in 1779. Dr. William Owen Pughe (1759–1835), a well-known literary figure who compiled a Welsh-English dictionary and a Welsh grammar, among other works, lived in the village for the last 10 years of his life, although he was not born there. His son Aneurin Owen also lived here."]}, {"page": "Cantre'r Gwaelod", "response": ["In 1770, Welsh antiquarian scholar William Owen Pughe reported seeing sunken human habitations about four miles (6.4 km) off the Ceredigion coast, between the rivers Ystwyth and Teifi."]}, {"page": "Côr Tewdws", "response": ["Morganwg's fictions, including those not published until after his death, were totally accepted by early antiquaries within his lifetime. The founding Roman emperor was identified, probably correctly as Theodosius II. In his notes to the Iolo Manuscripts, Taliesin Williams calls the college ‘Bangor Tewdws’ rather than his father’s ‘Bangor Dewdws’. By 1803, it was already being called Côr Tewdws by Morganwg's associate William Owen Pughe in his 'Cambrian Biography', published by Morganwg himself, and this was the name generally followed thereafter. Other antiquarians used different dates to those outlined by Morganwg, which had been contradictory, and some favoured the college's destruction by Anglo-Saxon warbands rather than Irish priates."]}, {"page": "1759 in Great Britain", "response": ["* 7 August – William Owen Pughe, lexicographer (died 1835)"]}, {"page": "1830s in Wales", "response": ["**3 June - William Owen Pughe, grammarian and lexicographer (b. 1759) "]}, {"page": "1835 in Wales", "response": ["*4 June – William Owen Pughe, grammarian and lexicographer, 75"]}, {"page": "1822 in Wales", "response": ["*William Owen Pughe - Hu Gadarn"]}, {"page": "1810s in Wales", "response": ["*William Owen Pughe -  (translation of Milton's Paradise Lost) (1819)"]}, {"page": "1800s in Wales", "response": ["*William Owen Pughe - Geiriadur Cymraeg-Saesneg (1803)"]}, {"page": "1750s in Wales", "response": ["*7 August - William Owen Pughe, lexicographer (d. 1835)"]}, {"page": "1819 in Wales", "response": ["* William Owen Pughe - Coll Gwynfa (translation of Milton's Paradise Lost)"]}, {"page": "1806 in Wales", "response": ["*William Owen Pughe inherits the estate of the Rev. Rees Pughe in Denbighshire and takes the surname \"Pughe\"."]}, {"page": "1803 in Wales", "response": ["*William Owen Pughe - Geiriadur Cymraeg-Saesneg"]}, {"page": "1782 in Wales", "response": ["*William Owen Pughe and Robert Hughes (Robin Ddu yr Ail o Fôn) meet in London."]}, {"page": "Edward Hughes (poet)", "response": ["Hughes was born in Nannerch, Flintshire, north Wales and christened on 4 July 1772.  He matriculated at Jesus College, Oxford in 1794, obtaining his Bachelor of Arts degree in 1797 and his Master of Arts degree in 1800.  He was ordained and was a military chaplain for a time, including service on the Walcheren Campaign of 1809.  He was later rector of Llanddulas (1814–1818) and then of Bodfari (1818 until his death in 1850).  He won the prize at the eisteddfod in Denbigh in 1819 for an awdl called \"Elusengarwch\", the adjudication being by William Owen Pughe, Robert Davies (Bardd Nantglyn) and David Richards (Dewi Silyn), although the result was controversial as many others favoured David Owen (Dewi Wyn o Eifion).  Hughes won a prize offered by the Honourable Society of Cymmrodorion in 1822 for a cywydd called \"Hu Gadarn\" and again won prizes in the Denbigh eisteddfod of 1828, when John Blackwell (Alun) was among the adjudicators.  His poems were published in various contemporary collections.  He died in Bodfari on 11 February 1850, and was buried on 15 February 1850."]}, {"page": "John Roberts (Vicar of Tremeirchion)", "response": ["Roberts was born in 1775 in Denbighshire, north Wales, and educated at Jesus College, Oxford between 1792 and 1796, where he obtained a Bachelor of Arts degree.  He stayed in Oxford to help to correct the edition of the Welsh Bible and Prayer Book that was published by the Society for the Promotion of Christian Knowledge in 1799.  He was ordained and became curate of the Oxfordshire parishes of Chiselhampton and Stadhampton in 1798, returning to Wales in 1803 as curate (and from 1807, vicar) of Tremeirchion, Flintshire.  He was opposed to the views on Welsh orthography of William Owen Pughe, whose views had influenced Thomas Charles to print the British and Foreign Bible Society's edition of the Welsh Bible in the orthography favoured by Pughe.  The views of Roberts finally prevailed after several letters between him, Charles and the Society.  He had a similar debate, in print, with John Jones (Tegid) (\"Tegid\") about the Welsh Book of Common Prayer.  Whilst opposed to Methodism, he used some of their practices such as prayer meetings.  He edited a reprinted edition of a translation into Welsh of the Book of Homilies (1817) and published a Welsh hymnal (1831). He died on 25 July 1829."]}, {"page": "The Myvyrian Archaiology of Wales", "response": ["The Myvyrian Archaiology of Wales is a printed collection of medieval Welsh literature, published in three volumes by the Gwyneddigion Society between 1801 and 1807. Until John Gwenogvryn Evans produced  diplomatic editions of the important medieval Welsh manuscripts, the Myvyrian Archaiology provided the source text for many translators of medieval Welsh material.Mary Jones, \"Y Myvyrian Archaiology\", Jones' Celtic Encyclopedia, 2003, accessed 10 June 2009 It was founded, and funded, by Owen Jones, who engaged William Owen Pughe as editor, and Edward Williams, better known as Iolo Morganwg, to search Wales for manuscripts.Geraint Phillips, \"Jones, Owen (1741–1814)\", Oxford Dictionary of National Biography, Oxford University Press, Sept 2004; online edn, Jan 2008, accessed 11 June 2009 "]}, {"page": "Richard Llwyd", "response": ["In 1800, Llwyd published his poem \"Beaumaris Bay\", which was followed by Gayton Wake or Mary Dod (1804) and Poems, Tales, Odes, Sonnets, Translations from the British (1804). On a visit to London in 1808, to study at the British Museum, he was introduced to the likes of Owen Jones and William Owen Pughe, who furthered his reputation as one of the foremost experts in Welsh genealogy."]}, {"page": "1759 in Wales", "response": ["*7 August - William Owen Pughe, lexicographer (died 1835)"]}, {"page": "Pughism", "response": ["#REDIRECT William Owen Pughe"]}, {"page": "Pugheism", "response": ["#REDIRECT William Owen Pughe"]}]}}