{"wiki_id": "http://www.wikidata.org/entity/Q8020631", "itemLabel": "William Wynter", "itemDescription": "Welsh admiral under Queen Elizabeth I of England", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Wynter", "wikipedia_page": {"main": "Admiral Sir William Wynter (c.1521 – 20 February 1589) was an admiral and principal officer of the Council of the Marine under Queen Elizabeth I of England and served the crown during the Anglo-Spanish War (1585–1604).", "link_mentions": [{"page": "Martin Frobisher", "response": ["Finding his reputation as an adventurer-explorer damaged following the disastrous outcome of the Cathay Company venture, and that his services in that line were no longer required, Frobisher sought other employment. He applied to a major shareholder in the Arctic enterprise, Sir William Wynter, one of the Queen's most trusted naval commanders, who was leading a fleet of four heavily armed vessels to Ireland under orders to put down the Desmond rebellion against the English Crown. Frobisher secured an appointment as captain of Foresight and sailed in early March 1580; in November, he participated in the Siege of Smerwick at the Dingle Peninsula, a rocky promontory on the southwestern shore of Kerry, where Emanuel had wrecked two years previously."]}, {"page": "William Winter", "response": ["*William Wynter (1519–1589), English admiral"]}, {"page": "John Hawkins (naval commander)", "response": ["In 1578 Hawkins was appointed Treasurer of the Navy.Conyers Read, Lord Burghley and Queen Elizabeth (London: Jonathan Cape, 1960), p. 411. Hawkins's financial reforms of the Navy upset many who had vested interests. In 1582, his rival, Sir William Wynter, accused him of administrative malfeasance, instigating a Royal Commission on fraud against him. The commission, under William Cecil, 1st Baron Burghley, Francis Walsingham, and Drake, concluded that there was no corruption, and that the Queen's Navy was in first-rate condition. p. 103"]}, {"page": "Tudor navy", "response": ["* Vice Admiral Sir William Wynter 8 July 1549 (also Master of Naval Ordnance)", "* Vice Admiral Sir William Wynter 1557-1589 (also Surveyor)"]}, {"page": "Clitheroe (UK Parliament constituency)", "response": ["| 1572|| William Wynter|| Thomas Docwray"]}, {"page": "Anna of Austria, Queen of Spain", "response": ["In February 1569, Anna's engagement to her uncle Philip II was announced. In May 1570, they married by proxy. She  traveled from Austria to Spain in the autumn of 1570, accompanied by her brothers Albert and Wenceslaus. Anna passed along the English Channel, where Elizabeth I sent her admirals, Charles Howard and William Wynter, to offer support and safe passage. "]}, {"page": "Thomas Wilson (rhetorician)", "response": ["In his will proved in 1582, Thomas Wilson refers to his brother Godfrey Wilson of Durham, and calls Sir William Wynter his brother-in-law. He also had brothers Humphrey and William in Lincolnshire. He was first married to Agnes Wynter (sister of William Wynter), widow of William Broke of Ham in Essex: Broke died in 1562.J. MacLean and W.C. Heane (eds), The Visitation of the County of Gloucester taken in the year 1623, Harleian Society Vol. XXI (1885), pp. 274-82, at p. 278 (Internet Archive).Will of William Broke of Ham, Essex (P.C.C. 1562, Streate quire). Agnes died in 1574. Wilson names one son and two daughters who were born of this marriage:", "Sir Francis Walsingham, Sir William Wynter and Mathewe Smyth Esquire were appointed overseers to Wilson's will."]}, {"page": "Surveyor of the Navy", "response": ["* Admiral Sir William Wynter 8 July 1549."]}, {"page": "William Winter (admiral)", "response": ["#REDIRECT William Wynter"]}, {"page": "Portsmouth (UK Parliament constituency)", "response": ["| 1559|| William Wynter|| George Brooke alias Cobham", "| 1563|| William Wynter|| Thomas Smythe"]}, {"page": "Gloucestershire (UK Parliament constituency)", "response": ["|1586 (Oct)|| Hon. William Bridges || Sir William Wynter"]}, {"page": "Cundletown, New South Wales", "response": ["thumb|Map of Cundletown, New South WalesCundletown is a town on the Mid North Coast, New South Wales, Australia. Cundletown and the nearby larger town of Taree were both settled in 1831 by William Wynter. Cundletown had a population of 2,054 as of the 2016 census.Cundletown, \"ABS Census 2016\" and is a significant agricultural district. It is 16 km from the Tasman Sea coast, and 317 km north of Sydney."]}, {"page": "William Garrard", "response": ["Garrard also resumed his mercantile ventures in Africa. The five adventurers proposing a voyage to Guinea in 1561, Garrard, William Wynter (Surveyor of the Navy and Master of Navy Ordnance), Benjamin Gonson (Treasurer of the Navy since 1549), Anthony Hickman and Edward Castelin, looked for John Lok to lead the expedition, but Lok declined the offer.Goldsmid (ed.), Principal Navigations, Vol. XI: Africa, pp. 164-67 (Internet Archive). Following the Queen's charter-party for the Minion and the Primrose to engage in African trade in 1562,Calendar of State Papers, Domestic Series 1547–1580, p. 215 (Google). Sir William Chester took Winter's place among the promoters of the Guinea voyage of February 1562/63 to August 1563, for the ivory trade, described in William Rutter's report from the Primrose.Goldsmid (ed.), Principal Navigations, Vol. XI: Africa, pp. 167-70 (Internet Archive). This was not the same as the Guinea expedition led by Sir John Hawkins in October 1562 in the Salomon, the Swallow and the Janus, on behalf of Gonson and Wynter, Lionel Duckett, Thomas Lodge and Mr. Bromfield, in which Hawkins \"purchased\" Africans and carried them off as slaves to the West Indies.(R. Hakluyt, quotation in Prefatory Essay), in R.A. Brock (ed.), Miscellaneous Papers, 1672-1865, Now First Printed from the Manuscript in the Collections of the Virginia Historical Society, Collections, New Series vol. 6 (The Society, Richmond, Virginia 1887), pp. 3-4 (Hathi Trust). The closing date in the published quotation, (\"1653\"), is a misprint for \"1563\".C.R. Markham (ed.), The Hawkins' Voyages during the reigns of Henry VIII, Queen Elizabeth and James I, Hakluyt Society vol. LVII (London 1878), pp. 5-7 and p. iii-v (Google).", "John Hawkins, in his account of his third slaving voyage of 1568, implicated Garrard and his Company in his expedition.('The 3rd, unfortunate voyage...), in Markham, The Hawkins' Voyages, pp. 70-81 and pp. vi-xi (Google). It was overtly prompted by reports of large gold resources in the Guinea hinterland, a region under a Portuguese trading monopoly. Upon these matters William Garrard, William Wynter, Benjamin Gonson and Lionel Duckett deliberated how to venture, and Queen Elizabeth and William Cecil pondered in responding to Hawkins's request for a licence. They were well aware that he had used two previous Guinea expeditions as opportunities to convey \"negro\" slaves to the West Indies, but assured Diego Guzmán de Silva, the Spanish ambassador, that no Indies expedition was intended. Hawkins himself, who openly denied any such intention, had laid in a very great quantity of dried beans suitable to feed a human cargo for the transatlantic crossing, and dainty textiles more suited to the Hispanic than to the African trade.R. Unwin, The Defeat of John Hawkins. A Biography of his Third Slaving Voyage (Allen & Unwin, London 1960), at pp. 17-28."]}, {"page": "List of vice-admirals of Somerset", "response": ["*Sir William Wynter bef. 1561 – 1589"]}, {"page": "Deptford Dockyard", "response": ["* 1544–1545, William Wynter"]}, {"page": "William Pelham (lord justice)", "response": ["With his headquarters at Limerick, the lord justice garrisoned the Desmond district, his object being to confine the struggle to Kerry, and, with the assistance of the fleet, under William Wynter, to starve the rebels into submission. He also summoned a meeting of the noblemen and chief gentry of the province; but the attendance was meagre. He and Ormonde then entered Kerry together. From Castleisland, where they narrowly missed capturing the Earl of Desmond and Nicholas Sanders, they advanced along the valley of the River Maine, scouring the country as they went, to Dingle. At Dingle they found Admiral Winter, and, with his assistance, Pelham ransacked the coast between Dingle and Cork, while Ormonde harried the interior of the country. The western chiefs one by one submitted to Ormonde. At Cork there was a great meeting of all the lords and chiefs, and all were received to mercy except Lord Barrymore; but Pelham, acting on the advice of Sir Warham St. Leger, took them along with him to Limerick. Desmond was still at large, but his power had been crippled."]}, {"page": "Edward Wynter", "response": ["Wynter was the son of admiral Sir William Wynter. He matriculated at Brasenose College, Oxford on 20 December 1577, aged 17 and was awarded BA on 28 January 1579. He was a student of the Inner Temple in 1579. In 1587, he was elected Member of Parliament for Newport. W R Williams Parliamentary History of the County of Gloucester "]}, {"page": "William Winter (Royal Navy officer)", "response": ["#REDIRECT William Wynter"]}, {"page": "Benjamin Gonson", "response": ["Benjamin Gonson began his career as a private shipwright. He began his government work when he was appointed to the new Council of the Marine established by Henry VIII on 24 April 1546 as Surveyor and Rigger of the Navy. He held this post until 1549 when he was succeeded by Admiral William Wynter. On 8 April 1549 he was appointed Treasurer of Marine Causes which he first held alone (until 18 November 1577), and then jointly with Admiral John Hawkins (until 26 November 1577)."]}, {"page": "William Wynter (Royal Navy officer)", "response": ["#REDIRECT William Wynter"]}, {"page": "Sir William Winter", "response": ["#REDIRECT William Wynter"]}, {"page": "John Winter (Royalist)", "response": ["John Winter was the grandson of William Wynter, Vice-Admiral of England, who was granted the manor of Lydney in the Forest of Dean.  His parents were Sir Edward Winter and Anne, daughter of the Earl of Worcester."]}, {"page": "Sir Leonard Chamberlain", "response": ["Although he was often absent from the Channel Islands, Chamberlain cooperated with William Wynter to stabilise the military position there against the French threat during the Italian War of 1551–59, paying attention to Alderney and Sark. He died in Guernsey about August 1561."]}, {"page": "John Wynter", "response": ["The son of Sir George Wynter, of Lydney (1527–1581) and Anne Wynter, née Brayne (1537–1581). His uncle was the Admiral Sir William Wynter. His grandparents were Captain John Wynter, Treasurer of the Navy or Treasurer of Marine Causes,  and Alice Tyrrell or Tirry (1500–1561)."]}, {"page": "Wynter, William", "response": ["#redirectWilliam Wynter"]}, {"page": "Master of Naval Ordnance", "response": ["# Vice Admiral Sir William Wynter, 1557-1589 (also Surveyor and Rigger of the Navy)"]}, {"page": "Irish Squadron", "response": ["From the thirteenth until the beginning of the fifteenth century, the English Navy was divided into subsidiary fleets of which the Irish Fleet was a part of it along with the Western Fleet, the Northern Fleet and the Aquitaine Fleet each of these fleets had their own independent commanders. In 1406 these fleets came under the unified command of the High Admiral of England, Ireland and Aquitaine.Fortescue. p.238. In the Tudor period the squadron was established again during Anglo-Scottish Wars (1539-1545). In 1571 the Irish Squadron operated during Desmond Rebellions (1569–1573) and again in (1579–1583), its commander during these periods was Admiral Sir William Wynter in 1579 he was authorized to cut off all sea routes into Ireland and seize all ships of the pending papal invasion force. In 1616 it was formed again under the command of Sir Thomas Button.", "|20. ||Vice-Admiral||Sir William Wynter ||1560 ||Admiral of the Irish Squadron ||  "]}, {"page": "Armada Tapestries", "response": ["The tapesties included portraits of commanders, captains, and other worthies in the borders. These included: Christopher Baker; George Beeston; Charles Blount; Robert Carey; Captain Crosse; the Earl of Cumberland; Francis Drake; Charles Howard, Lord Effingham; Martin Frobisher; Thomas Garrat; Benjamin Gonson; John Hawkins; Edward Hoby; Lord Thomas Howard; Master Knyvet; the Earl of Northumberland; Horatio Palavicini; George Pinner; Captain Penton; Lord Henry Seymour; Lord Sheffield; Robert Southwell; Thomas Cecil; Roger Townshend; Thomas Vavasour; Master Willoughby; and William Wynter.William Thomson, Tapestry weaving in England (London, 1914), p. 33"]}, {"page": "Vice-Admiral in the Channel", "response": ["# Vice-Admiral, William Wynter, 1545–1547."]}, {"page": "John Stewart, Commendator of Coldingham", "response": ["During the Reformation Crisis the English government sent a fleet of warships to Scotland, and subsequently, by the Treaty of Berwick, an army to assist the Protestants at the siege of Leith. In January 1560 John Stewart sighted the English fleet commanded by William Wynter off Dunbar sailing towards the Isle of May and sent a boat to investigate.Joseph Bain, Calendar State Papers Scotland, vol. 1 (Edinburgh, 1898), pp. 273, 295."]}, {"page": "Francis Drake's circumnavigation", "response": ["In 1577, Drake was secretly commissioned by Queen Elizabeth I to set off on an expedition against the Spanish colonies on the American Pacific coast. The Queen invested 1,000 crowns in the venture and so Drake became a privateer. The expedition also intended to explore areas where there could be potential English settlement – the first of its kind. Elizabeth and members of her court, including Robert Dudley, Christopher Hatton and Francis Walsingham (now Elizabeth's Secretary of State) were among those who invested in Drake's voyage and secretly supported his privateering – the looting of Spanish ships and ports. Other prominent members were Clerk of the Queen's ships – George Wynter, Surveyor of the Navy – William Wynter and Sir John Hawkins."]}]}}