{"wiki_id": "http://www.wikidata.org/entity/Q100154", "itemLabel": "Emmy Klieneberger-Nobel", "itemDescription": "German Jewish microbiologist", "wikipedia_url": "https://en.wikipedia.org/wiki/Emmy_Klieneberger-Nobel", "wikipedia_page": {"main": "Emmy Klieneberger-Nobel (February 15, 1892 – September 11, 1985) was a German Jewish microbiologist and a founder of mycoplasma bacterial research. She performed most of her research at the Lister Institute in London, England, after having been expelled from Germany by the Nazis.", "link_mentions": [{"page": "Lister Institute of Preventive Medicine", "response": ["The discovery of co-enzymes by Sir Arthur Harden FRS and his colleagues was recognised by the co-award to him of the Nobel Prize for chemistry in 1929. The institute played a major part in defining the role of vitamins in post-war nutritional deficiency diseases that were widespread in Europe and elsewhere. Emmy Klieneberger-Nobel pioneered the study of mycoplasma and in 1935 discovered and cultured unusual strains of bacteria that lacked a cell wall, naming them L-form bacteria after the institute where she worked. The first director, Sir Charles Martin, appointed in 1903, retired in 1930."]}, {"page": "Robert Koch Medal and Award", "response": ["* 1980 Emmy Klieneberger-Nobel (United Kingdom)"]}, {"page": "Robert Koch Institute", "response": ["* Emmy Klieneberger-Nobel"]}, {"page": "L-form bacteria", "response": ["L-form bacteria, also known as L-phase bacteria, L-phase variants, and cell wall-deficient (CWD) bacteria, are strains of bacteria that lack cell walls. They were first isolated in 1935 by Emmy Klieneberger-Nobel, who named them \"L-forms\" after the Lister Institute in London where she was working."]}, {"page": "Emmy Klieneberger", "response": ["#REDIRECT Emmy Klieneberger-Nobel"]}, {"page": "Emmy Kleinberger", "response": ["#REDIRECT Emmy Klieneberger-Nobel"]}, {"page": "Emmy Kleinberger-Nobel", "response": ["#REDIRECT Emmy Klieneberger-Nobel"]}, {"page": "Crosby Hall, London", "response": ["With the rise of National Socialism (Nazism) in Germany and the passage of the anti-Jewish Law for the Restoration of the Professional Civil Service on 7 April 1933, Crosby Hall provided an important source of support for women academics who were being forced out of Germany. The BFUW undertook an additional fund-raising appeal on their behalf, which met with an enthusiastic response.  As a result, the BFUW was able to provide 3 new 12-month residential fellowships (in addition to 7 existing ones) as well as smaller awards. In 1934 the new fellowship recipients were Emmy Klieneberger-Nobel, Betty Heimann, and Helen Rosenau. Among many other women who received funding and support were Adelheid Heimann (no relation to Betty), Gertrud Kornfeld, Dora Ilse, and ."]}, {"page": "International Organization for Mycoplasmology", "response": ["* Emmy Klieneberger-Nobel a pioneer in the study of mycoplasma"]}, {"page": "Emmy Klieneberger‐Nobel", "response": ["#redirect Emmy Klieneberger-Nobel"]}]}}