{"wiki_id": "http://www.wikidata.org/entity/Q100146628", "itemLabel": "Marjorie Thomson", "itemDescription": "Scottish television actress (1913-2012)", "wikipedia_url": "https://en.wikipedia.org/wiki/Marjorie_Thomson", "wikipedia_page": {"main": "Marjorie Jessica Sutherland Thomson (13 October 1913 – 10 March 2012) was a Scottish film, television and theatre actress. She is best known as a cast regular in the hit TV series Take the High Road from 1980 to 1995. In the programme, she played local matriarch Grace Lachlan, one of several \"strong women characters (who) provided a focus\". Series creator Don Houghton praised Thomson and her co-star Eileen McCallum for their clarity as speakers of the Scots dialect, an essential attribute of their respective roles in the programme.Thomson was associated with the Glasgow Unity Theatre group from its foundation in 1941, playing a wide range of roles. As a member of the group, she played Jean Mutrie as female lead in The Gorbals Story, a successful play by Robert McLeish which opened in 1946 at the Queen's Theatre, Gallowgate and then toured the UK, including a residence at London's Garrick Theatre in 1948. Thomson reprised the role in the film version (1950). This was her screen debut and the cast included Russell Hunter, who became her first husband.She specialised in the stage through the 1950s until her TV debut on 1 January 1960. She told Michael Elder that her personal highlight in those years was appearing in Scotland's first Royal Variety Performance on 3 July 1958 at Glasgow's Alhambra Theatre, attended by Queen Elizabeth and the Duke of Edinburgh. Her TV debut was a guest role in Para Handy - Master Mariner. She stayed with the medium in addition to stage and some radio work. Over the next twenty years until Take the High Road began, she ran up a long list of TV credits. Among these were several guest parts in the original (1960s) series of Dr. Finlay's Casebook. She was a cast regular as Mrs Gauld in High Living which ran for three years from 1968 to 1971 and was billed as Scottish Television's first soap opera. In the 1970s, she continued to work in TV, on the stage and on the radio, building a reputation as one of Scotland's most respected character actresses. She appeared in three episodes of the TV series Sutherland's Law and also had a regular part in the radio version of The McFlannels.Thomson appeared in the first-ever episode of Take the High Road, aired on 19 February 1980, as Grace Lachlan. She stayed with the programme as one of the main cast until 1995, appearing in several hundred episodes. Grace was the widow of a sheep-herding crofter called Donald Lachlan and kept house for her son Dougal (played by Alec Monteath), who had succeeded his father as crofter at Ardvain on the Glendarroch estate. She left the programme in 1993 but returned for guest appearances until 1995. She was known outside acting as Marjorie Hunter and died aged 98 in Perthshire on 10 March 2012, survived by her daughters Lesley and Anne.", "link_mentions": {}}}