{"wiki_id": "http://www.wikidata.org/entity/Q10367191", "itemLabel": "Sam Lesser", "itemDescription": "Spanish Civil War veteran and Daily Worker/Morning Star journalist", "wikipedia_url": "https://en.wikipedia.org/wiki/Sam_Lesser", "wikipedia_page": {"main": "Sam Lesser (born Manassah Lesser or Manasseh Lesser and also known as Sam Russell; 19 March 1915 – 2 October 2010) was a British journalist and veteran of the Spanish Civil War's International Brigades. Lesser was one of the last surviving British veterans of the Spanish Civil War, and went on to serve as chair of the International Brigade Memorial Trust (IBMT), and write for the Daily Worker and its successor, the Morning Star.", "link_mentions": [{"page": "Lesser", "response": ["* Sam Lesser or Sam Russell (1915–2010), British journalist and Spanish Civil War veteran"]}, {"page": "Sam Russell", "response": ["*Sam Lesser (1915–2010), journalist who used the byline Sam Russell"]}, {"page": "2010 in the United Kingdom", "response": ["**Sam Lesser, journalist and Spanish Civil War veteran (b. 1915)"]}, {"page": "Deaths in October 2010", "response": ["*Sam Lesser, 95, British journalist."]}, {"page": "John L. Wainwright", "response": ["Wainwright is interested in social history which places emphasis on the lives of people. In his 2012 book The Last to Fall: the Life and Letters of Ivor Hickman, he reproduces the love letters sent by a young International Brigades Military Observer (who was also a former student of Ludwig Wittgenstein) in the months leading up to his death in the final hours of fighting in Spain, 1938. Among those interviewed for his analysis were Sam Lesser and David Marshall."]}, {"page": "George Green's School", "response": ["* Sam Lesser, Daily Worker/Morning Star journalist, veteran of the International Brigades during the Spanish Civil War."]}, {"page": "Sam Lessor", "response": ["#REDIRECT Sam Lesser"]}, {"page": "March 1915", "response": ["* Born: Gordon Brettell, British air force officer, member of No. 92 Squadron during and the escape team from the German POW camp Stalag Luft III during World War II, in Chertsey, England (d. 1944, executed); Sam Lesser, British journalist and soldier, member of the International Brigades during the Spanish Civil War and reporter for the Morning Star, in London (d. 2010); Patricia Morison, American actress and singer, best known for lead title roles in Kiss Me, Kate and The King and I, in New York City (d. 2018); Norman Yardley, English cricketer, batsman for the England cricket team from 1938 to 1950, and the Marylebone Cricket Club from 1938 to 1952, in Gawber, England (d. 1989)"]}, {"page": "Goodbye Barcelona", "response": ["The writers received a development grant in 2006 from the Arts Council to research and produce a first draft, and went on to meet several of the International Brigaders then still alive. These included Lou Kenton, Jack Jones, Penny Feiwel, Alun Menai Williams and Sam Lesser. Based on extensive research into the subject including books and films as well as the interviews with the Brigaders, Johnson and Lewkowicz then developed a first draft for the initial 2008 reading, directed by Mehmet Ergen at Arcola Theatre's Grimeborn Festival in 2008. This was attended by leading Spanish Civil War historian Sir Paul Preston and 92 year old International Brigader Sam Lesser amongst others."]}]}}