{"wiki_id": "http://www.wikidata.org/entity/Q1032003", "itemLabel": "Micah Hyde", "itemDescription": "Jamaican footballer (born 1974)", "wikipedia_url": "https://en.wikipedia.org/wiki/Micah_Hyde_(footballer)", "wikipedia_page": {"main": "Micah Anthony Hyde (born 10 November 1974) is a former professional footballer who played as a midfielder.\nHe played for Cambridge United and Finnish club Euran Pallo before joining Watford. He made more than 250 league appearances for Watford between 1997 and 2004, and played in the Premier League during the 1999–2000 season. He went on to play for Burnley and Peterborough United before slipping out of professional football in 2009 where he joined Conference Premier side Woking. He briefly returned to the Football League with Barnet before returning to finish his career in non-league with Billericay Town, Aveley and St Albans City.\nHyde was born in England, and made 17 appearances for Jamaica, scoring once.\nHyde came out of retirement in January 2016 signing for Southern Football League side Ware, managed by Ken Charlery.", "link_mentions": [{"page": "Queens Park Rangers F.C.", "response": ["| Micah Hyde"]}, {"page": "Woking F.C.", "response": ["* Micah Hyde"]}, {"page": "2006 FIFA World Cup qualification (CONCACAF)", "response": ["* Micah Hyde"]}, {"page": "Richard Johnson (soccer)", "response": ["Often in and out of the side for much of his early Watford career, Johnson became an integral part of Graham Taylor's re-shaped Watford side as it started the 1997–98 season. He formed a central midfield partnership with Micah Hyde that was to help drive Watford to the 1997–98 Division Two Championship. Johnson was also to show his long-range shooting skills in the 4–0 victory over rivals Luton Town at Kenilworth Road, scoring the first goal. The Hyde-Johnson axis continued into the 1998–99 season, with Johnson playing in Watford's drive to the play-offs and picking up a winners medal in the 2–0 final victory over Bolton. Johnson was to play a limited part in Watford's first Premiership season, with injuries sustained in August and January keeping him out for two months each time."]}, {"page": "Ware F.C.", "response": ["* Micah Hyde"]}, {"page": "Brimsdown Rovers F.C.", "response": ["Brimsdown Rovers F.C. was famous for David Beckham having played in its youth teams.The FA – Becks' Brimsdown boost, article from Friday, 24 September 2004 , accessed 7 July 2007 He joined Brimsdown Rovers as a 14-year-old, and played in their youth team for two years, becoming Under-15 Player of The Year in 1990. Six of the side went on to play professionally, including Micah Hyde, who played in the Premier League with Watford, and Jason Brissett and Ryan Kirby, who both joined Arsenal. David Beckham presented memorabilia to the club including a shirt bearing his name and original squad number of 28, which was later stolen from the clubhouse.", "In 1982–83 the club decided to concentrate on developing a youth team policy to secure the long-term success of the club. The youth section has regularly enjoyed success at both League and County level since its formation and its most famous product is David Beckham, the Manchester United and England star who also played for Real Madrid. From the same team in which David played, Micah Hyde (Watford) now with Burnley and Jason Brissett (Walsall) both made the professional ranks whilst Ryan Kirby had spells at Arsenal, Doncaster Rovers, Stevenage Borough and Aldershot and Ian Wiles, a more recent product of the youth section, signed for Colchester United. Following these players' examples, there were a number of boys who regularly attended various Schools of Excellence."]}, {"page": "Craig Morgan (footballer)", "response": ["In the 2007–08 season he made 41 league appearances, as well as signing a new three-year contract in February 2008, as the club won promotion to League One by finishing as runners-up to Milton Keynes Dons. Ahead of the club's League One campaign in the 2008–09 season, Morgan was handed the captaincy of the team at the age of just 23, taking over from Micah Hyde. However, on 29 September he was replaced as captain by Russell Martin, less than two months later. Peterborough Manager Darren Ferguson put the decision down to Morgan's involvement with the Welsh national team, which often saw him miss while on international duty, stating: \"Craig did fine, it's nothing about that, he was just missing games.\" Despite losing the captaincy, he remained a regular first-team player and helped the side to their second consecutive promotion after forming a defensive partnership with Gabriel Zakuani, finishing as runners-up to Leicester City and reaching the Football League Championship. During the summer break after the 2008–09 season, Morgan became Peterborough's all-time record international appearance maker by winning his 14th cap for Wales in a friendly against Estonia. In December 2009, Morgan revealed he nearly joined Notts County loan deadline window, but it fell through at the last minute."]}, {"page": "2007–08 Peterborough United F.C. season", "response": ["|Micah Hyde (c)"]}, {"page": "List of foreign Premier League players", "response": ["*Micah Hyde – Watford – 1999–2000"]}, {"page": "Nicky Deverdics", "response": ["Deverdics joined Barnet in July 2008 and went on to make 51 appearances for the Bees – winning the 'Most Improved Player' award in his first season. Upon signing Deverdics, the then manager Paul Fairclough told BBC London 94.9: \"He has played in the Scottish Premier. He's only 20 and has got a great left foot and has a big future.\" Deverdics played in a midfield alongside the likes of Yannick Bolasie, Albert Adomah and Micah Hyde."]}, {"page": "2009–10 Barnet F.C. season", "response": ["| July 2009 || CM ||  || Micah Hyde || Woking || Free || "]}, {"page": "1999 Football League First Division play-off Final", "response": ["No changes were made by either side during the break and Bolton kicked off the second half.  Six minutes in, Guðjohnsen's header dropped in front of Taylor who fouled Chamberlain in pursuit of a shot.  In the 56th minute Guðjohnsen had another chance after breaking free but the ball was cleared by Page.  A minute later, Micah Hyde was shown the first yellow card of the match for tugging an opponent's shirt.  In the 61st minute, a cross from Gardner was cleared off the line by Watford's Palmer.  Two subsequent corners from Bolton were defended by Watford.  Five minutes later, Bolton made the first substitution of the game with Scott Sellars coming on to replace Johansen.  On 68 minutes, a header from Mooney went close. ", "|CM ||8 ||Micah Hyde "]}, {"page": "2006–07 Burnley F.C. season", "response": ["!scope=\"row\"|Micah Hyde ", "|18||MF|| Micah Hyde || Peterborough United || £75k || 11 January 2007"]}, {"page": "List of foreign EFL Championship players", "response": ["*Micah Hyde – Burnley – 2004–07"]}, {"page": "2004–05 Burnley F.C. season", "response": ["|18||MF|| Micah Hyde || Watford || Free || 15 July 2004"]}, {"page": "Euran Pallo", "response": ["The most famous players to have turned out in EuPa's colours are Ari Valvee, the former Finnish international and Micah Hyde."]}, {"page": "1999–2000 Watford F.C. season", "response": ["* CM: #8,  Micah Hyde, 37"]}, {"page": "2010–11 Barnet F.C. season", "response": ["| Micah Hyde"]}, {"page": "2004–05 Watford F.C. season", "response": ["*  Micah HydeHyde was born in Newham, England, but also qualified to represent Jamaica internationally and made his international debut for Jamaica in 2001. –  Burnley, free"]}, {"page": "Micah Hyde (American football)", "response": ["He made his Buffalo Bills regular season debut in their season-opener against the New York Jets and recorded three solo tackles, broke up a pass, and intercepted a pass by Josh McCown in the 21–12 victory. On October 1, 2017, Hyde made seven combined tackles, two pass deflections, and intercepted two passes by Matt Ryan during a 23–17 win at the Atlanta Falcons. It marked Hyde's first time intercepting multiple passes in a single game. In Week 8, he recorded five solo tackles, a pass deflection, and intercepted a pass by Derek Carr in the Bills' 34–14 win against the Oakland Raiders. On November 2, 2017, Hyde was named the AFC Defensive Player of the Month for October after making four interceptions in the last four games. On December 3, 2017, he collected a career-high 12 combined tackles (ten solo) and a pass deflection during a 23–3 loss to the New England Patriots in Week 13. On December 19, 2017, it was announced that Hyde was voted to the 2018 Pro Bowl, marking the first time he received the honor. He finished his first season with the Buffalo Bills with 82 combined tackles (65 solo), 13 pass deflections, and five interceptions in 16 games and 16 starts. He set new career-highs in all four statistical categories. Pro Football Focus gave Hyde an overall grade of 86.2, ranking 14th among all qualified safeties in 2017. Hyde and Poyer were one of the highest graded safety duos in 2017 and were considered as possibly the best tandem in the league by many NFL analysts and media members. He was ranked 62nd by his peers on the NFL Top 100 Players of 2018.NFL Top 100 Players of 2018: No. 62 Micah Hyde"]}, {"page": "Micah Hyde", "response": ["Micah Hyde may refer to:", "* Micah Hyde (footballer) (born 1974), English-born Jamaican footballer", "* Micah Hyde (American football) (born 1990), American football safety"]}, {"page": "List of foreign Premier League goalscorers", "response": ["*Micah Hyde – Watford"]}]}}