{"wiki_id": "http://www.wikidata.org/entity/Q1038036", "itemLabel": "Robert Reid", "itemDescription": "Scottish rally co-driver", "wikipedia_url": "https://en.wikipedia.org/wiki/Robert_Reid_(co-driver)", "wikipedia_page": {"main": "Robert Reid (born 17 February 1966) is a retired British rally co-driver who partnered Richard Burns to victory in the 2001 World Rally Championship.  The partnership lasted from 1991 until 2003 during which time they entered into 103 world rallies, achieving 277 stage wins and 34 podium finishes.  The pair were runners-up in the 1999 World Rally Championship and the 2000 World Rally Championship. Since retiring from competition Reid has held positions with both Motorsport UK and FIA, and is currently President of the FIA Closed Road Commission and a member of both the FIA Safety Commission and the FIA International Sporting Code Review Commission.", "link_mentions": [{"page": "Richard Burns", "response": ["Richard Alexander Burns (17 January 1971 – 25 November 2005) was an English rally driver who won the 2001 World Rally Championship, having previously finished runner-up in the series in 1999 and 2000. He also helped Mitsubishi to the world manufacturers' title in 1998, and Peugeot in 2002. His co-driver in his whole career was Robert Reid. He is the only Englishman to have won the World Rally Championship as a driver.", "In 1990 he joined the Peugeot Challenge after David Williams bought Burns a Peugeot 205 GTI. Upon winning that series, Richard's prize was a chance to drive a World Rally Championship event in Great Britain that same year. Then in 1991 Burns met Robert Reid, the man who was to become his co-driver for the rest of his career, finishing 16th in their first WRC rally together. For 1992 Williams purchased a Group N Subaru Legacy for Burns; with support from Prodrive, they won the National Championship. This year also saw Burns help Colin McRae with his gravel notesBurns, R: Driving Ambition, page 72. Hodder and Stoughton, 2002. as Prodrive viewed Richard as a promising talent for the future. Burns won that year's Severn Valley Rally outright despite being in a slower car.", "There, all three of Burns' rivals were to have suffered retirement from the event by the end of the second leg proceedings on Saturday. On Sunday, 25 November 2001, therefore, Burns' third-place finish behind Peugeot duo Gronholm and Harri Rovanpera enabled him to become the first Englishman to win the World Rally Championship, with 44 points, he was world champion with the lowest points total since the Formula 1-styled point system was introduced in 1997. When Burns passed the finishing line at the final stage of the final rally in 2001, he uttered words thought to be paying tribute to his codriver Robert Reid: \"You're the best in the world\". To commemorate the title success, Subaru produced a special edition of the Subaru Impreza in the UK called the RB5. A messy legal battle ensued for the Englishman's services for the following 2002 season, from which fresh suitors, 2000 and 2001 manufacturers' champions Peugeot emerged victorious.", "In the 2003 season he was still winless, although seven podiums means he led the championship at most of the season. The gloomy prospect of a continued winning drought with the French team left Burns poised to rejoin Subaru, having signed for them for the second time beginning with the 2004 season, the ploy being to couple him with the eventual 2003 title winner, Norway's Petter Solberg. In November 2003, however, with the Englishman heading to the season-ending Wales Rally GB still with a chance of winning the title, Burns suffered a blackout while driving with Ford driver Markko Märtin to the rally. He was withdrawn from the event, and thus the title fight, and was later diagnosed with an astrocytoma, a type of malignant brain tumour. Treatment during 2004 was followed by surgery in April 2005 that was described as \"very successful\". But the diagnosis, that this type of brain tumor was malignant, was only soon realised. In August 2005 a fan day was made in which Burns' supporters were invited to see his private car collection, but he was unable to drive so his co-driver Robert Reid took the seat on his private cars.", "| rowspan=10 |Robert Reid"]}, {"page": "Rally Sweden", "response": ["|  Richard Burns Robert Reid ||  Marlboro Peugeot Total Peugeot 206 WRC"]}, {"page": "Colin McRae", "response": ["In August 2007, McRae said he was still hoping to find a seat for the 2008 WRC season, but said that \"if it doesn't happen next year, then I won't (return) because you can only be out of something at that level for so long.\" In 2007, talking to Autosport podcast, David Richards confirmed that he and McRae had talked about McRae's comeback to Subaru for season 2008. Robert Reid was contacted by McRae to be his co-driver and the pair were due to test together, but McRae was killed before the test could take place."]}, {"page": "Rally New Zealand", "response": ["| style=\"background:white;\"| Robert Reid", "| Robert Reid"]}, {"page": "Acropolis Rally", "response": ["|1999||  Richard Burns Robert Reid ||  Subaru Impreza S5 WRC '99   || WRC"]}, {"page": "Rally Australia", "response": ["|  Robert Reid"]}, {"page": "Pirelli Richard Burns Foundation Rally", "response": ["|  Robert Reid"]}, {"page": "Robert Reid", "response": ["*Robert Reid (architect) (1774–1856), Scottish architect", "*Robert Reid (American painter) (1862–1929), American impressionist painter", "*Robert Reid (antiquarian) (1773–1865), Scottish businessman and topographer", "*Sir Robert Reid (railwayman) (1921–1993), chairman of British Rail", "*Robert Reid (author) (born 1966), American author", "*Robert Reid (chemical engineer) (1924–2006), American chemical engineer in thermodynamics", "*Robert Reid (Kirkcaldy Burghs MP) (1831–1875), British Member of Parliament for Kirkcaldy Burghs, 1874–1875", "*Robert Reid (New Zealand politician) (1839–1897)", "*Robert Reid (Australian politician, born 1842) (1842–1904), merchant and member of the Victorian Legislative Council and Australian Senate", "*Robert Reid, 1st Earl Loreburn (1846–1923), British Liberal politician, Lord Chancellor", "*Sir Robert Reid (civil servant) (1883–1964), British colonial administrator in India", "*Robert Reid (Scottish footballer) (fl. 1913–1918)", "*Robert Reid (cross-country skier) (1898–1990), American Olympic skier", "*Robert Reid (ice hockey) (1932–2007), Australian ice hockey player", "*Robert Reid (basketball) (born 1955), American basketball player", "*Robert Reid (co-driver) (born 1966), Scottish world champion rally co-driver", "*Robert Reid (bishop) (died 1558), Scottish abbot and bishop, founder of the University of Edinburgh", "*Robert Reid (pipemaker) (1784–1837), Northumbrian smallpipes creator", "*Robert Reid (Medal of Honor) (1842–1929), American Civil War soldier and Medal of Honor recipient", "*Robert Reid (judge) (1855–1923), Justice of the Louisiana Supreme Court", "*Robert Reid-Pharr, American literary and cultural critic"]}, {"page": "Strathallan School", "response": ["* Robert Reid (born 1966), winner of the 2001 World Rally Driving Championship."]}, {"page": "2003 World Rally Championship", "response": ["| Robert Reid "]}, {"page": "List of World Rally Championship people", "response": ["* Robert Reid – co-driver to Richard Burns"]}, {"page": "Sport in Scotland", "response": ["Scotland's most recent world crown was won in 2001, when Perthshire born co-driver Robert Reid won the World Rally Championship with Richard Burns."]}, {"page": "2002 World Rally Championship", "response": ["|  Robert Reid"]}, {"page": "2001 World Rally Championship", "response": ["| Robert Reid"]}, {"page": "2000 World Rally Championship", "response": ["| Robert Reid"]}, {"page": "1998 World Rally Championship", "response": ["|align=left|  Robert Reid"]}, {"page": "Scottish Rally", "response": ["| Robert Reid"]}, {"page": "Gran Turismo 5", "response": ["Four-time NASCAR Cup champion Jeff Gordon appears in the game as a mentor to the player, guiding them in the skills of slipstreaming specific to the sport. Nine-time rally world champion Sébastien Loeb and four-time F1 world champion Sebastian Vettel appear in similar roles in their portions of the game, providing advice and encouragement in a series of challenges. Other cars in the game are named after rally driver Tommi Mäkinen, drivers Carl Edwards and Kyle Busch, and personalities Shuichi Shigeno and Jay Leno. Voice overs were recorded by Justin Bell, Tony Jardine and Robert Reid. One of the game's testers, listed in the credits, was Tomei Sports/Porsche racing driver Takashi Ohi."]}, {"page": "Subaru World Rally Team", "response": ["Subaru had an all new line up for the 1999 season, with the nominated driver/co-driver teams of Richard Burns/Robert Reid, Juha Kankkunen/Juha Repo, and third team of Bruno Thiry/Stéphane Prévot. The new car, the WRC99, featured an electronically controlled Paddle shifter with a drive-by-wire throttle. Due to technical difficulties, the team struggled until the season's 7th round in Argentina. From there on, the teams earned the podium in seven out of eight events, with five wins, three of which were 1–2 finishes. Subaru finished second in the Manufacturers' Championship, just four points behind Toyota. Burns scored victories in Greece, Australia, and Wales, for second place and Kankkunen took fourth in the Drivers' Championship, with wins in Argentina and Finland.", "Burns and Solberg composed Subaru's nominated line-up for the 2001 season with Markko Märtin/Michael Park and Toshi Arai/Tony Sircombe competing in selected events. Subaru again won the Driver's Championships in 2001 with Richard Burns and co-driver Robert Reid. Burns left Subaru for Peugeot at the end of the 2001 season."]}, {"page": "List of people from the London Borough of Croydon", "response": ["* Robert Reid, rally driver, lives in a flat in South Croydon"]}, {"page": "British Rally Championship", "response": ["|  Robert Reid"]}, {"page": "Robert Reid (rally)", "response": ["#REDIRECT Robert Reid (co-driver)"]}, {"page": "Rally Isle of Man", "response": ["|  Robert Reid"]}, {"page": "List of 2001 motorsport champions", "response": ["|  Richard Burns Robert Reid"]}, {"page": "Rally Scotland", "response": ["At a press conference in Glasgow on 15 October 2008 it was announced that Scotland would host the final round of the 2009 Intercontinental Rally Challenge and that Rally Scotland had secured a three-year contract with the IRC to host the event. Among those present at the launch was the First Minister of Scotland Alex Salmond, the ex-world champion Robert Reid and Andrew Cowan founder of Mitsubishi Ralliart."]}, {"page": "FIA Institute Young Driver Excellence Academy", "response": ["The participants are being trained by professional racing and rally drivers Alexander Wurz and Robert Reid, with workshops taking place throughout the year. "]}, {"page": "Chris Ingram (rally driver)", "response": ["After a day of varied tests Ingram was crowned the MSA Young Driver of the Year and has become the only rally driver to win the award, judged by Robert Reid and David Brabham amongst others."]}, {"page": "List of World Rally Championship co-drivers", "response": ["|align=left|  Robert Reid"]}, {"page": "2002 Acropolis Rally", "response": ["|  Robert Reid", "|  Robert Reid", "|  Robert Reid"]}, {"page": "2000 Swedish Rally", "response": ["|align=\"left\"|  Robert Reid"]}, {"page": "1998 Safari Rally", "response": ["The 1998 Safari Rally (formally the 46th Safari Rally Kenya) was held between 28 February and 2 March 1998. It was the first World Rally Championship victory for Richard Burns and his co-driver Robert Reid after his teammate Tommi Mäkinen and fellow Briton Colin McRae both retired.", "| Robert Reid"]}, {"page": "2000 Safari Rally", "response": ["|align=\"left\"|  Robert Reid"]}, {"page": "2000 Rallye de Portugal", "response": ["|align=\"left\"|  Robert Reid"]}, {"page": "1998 Rally GB", "response": ["It was the second victory of the 1998 season for Richard Burns and his co-driver Robert Reid and saw Tommi Mäkinen score a hat-trick of Drivers' championships after his closest rival Carlos Sainz, just 300 metres from the finish and running in fourth with just the final special stage to go, suffered a huge upset, his Corolla struck by engine failure at Margam, thus surrendering his title to Mäkinen.", "| Robert Reid"]}, {"page": "2000 Rallye Catalunya", "response": ["|align=\"left\"|  Robert Reid"]}, {"page": "David Senior", "response": ["Senior's first full-time contract came in 1993 when he signed for the Prodrive Junior Team, along with Alister and his teammates, Richard Burns and Robert Reid."]}]}}