{"wiki_id": "http://www.wikidata.org/entity/Q10379491", "itemLabel": "Jim McIntyre", "itemDescription": "footballer; football manager (born 1972)", "wikipedia_url": "https://en.wikipedia.org/wiki/Jim_McIntyre_(footballer)", "wikipedia_page": {"main": "James McIntyre (born 24 May 1972) is a Scottish football player and coach. McIntyre played mainly as a striker or as a left midfielder. During his playing career he played for Bristol City, Exeter City, Airdrieonians, Kilmarnock, Reading, Dundee United and Dunfermline Athletic.\nHe started his managerial career with Dunfermline Athletic followed by a scouting role at Bristol City. He then managed Queen of the South and Ross County, winning the Scottish League Cup in March 2016 with County. He was appointed Dundee manager in October 2018, but he was sacked in May 2019 after the club had been relegated.", "link_mentions": [{"page": "Dundee F.C.", "response": ["Dundee were relegated to the Scottish Championship at the end of the 2018–19 season. Manager Jim McIntyre and assistant manager Jimmy Boyle were sacked on 12 May. After playing the role of interim manager in Dundee's final home game, former player James McPake was hired as manager on a permanent basis, with Jimmy Nicholl, then current assistant manager of Northern Ireland, brought in as assistant manager. The club would finish the season (prematurely ended due to the COVID-19 pandemic) in 3rd place, and the following season would finish as runners-up. In the Premiership play-offs, Dundee would defeat Raith Rovers and Premiership side Kilmarnock to earn promotion back into the top flight after two seasons.", "| Jim McIntyre || 2018–2019"]}, {"page": "Ross County F.C.", "response": ["Ross County secured promotion to the Scottish Premier League on 10 April 2012 when their nearest rival to the title Dundee failed to beat Queen of the South. During this push to promotion, Ross County embarked on a 40-game undefeated run in league football, which continued into the Scottish Premier League. The run was ended by St Johnstone on 22 September 2012. The Staggies parted company with George and Derek Adams on 28 August 2014 following a poor start to the 2014–15 campaign.  Jim McIntyre was appointed manager on 9 September 2014, with Billy Dodds as his assistant.", "|  Jim McIntyre"]}, {"page": "Mark Burchill", "response": ["On 28 January 2005, Burchill was allowed to leave Portsmouth on a free transfer after spending two years out of favour. He chose to return to Scotland and sign for Hearts, where he remained until the end of the season. On 6 July 2005, he joined Dunfermline Athletic where he scored 12 league goals in 31 games in his first season, despite the club struggling in the bottom half of the table. He signed a year's extension to his contract with the Pars in December 2006. In April 2008, Dunfermline manager Jim McIntyre announced that Burchill had been offered a new contract but had decided to leave the Scottish First Division side in order to \"pursue other avenues\"."]}, {"page": "Airdrieonians F.C. (1878)", "response": ["| Jim McIntyre"]}, {"page": "McIntyre", "response": ["* Jim McIntyre (footballer) (born 1972), Scottish football player and manager"]}, {"page": "Jim Jefferies (footballer)", "response": ["Jefferies held talks with Dunfermline Athletic about succeeding Jim McIntyre as their manager and was appointed on 20 March. He was unable to keep the Pars in the top flight and were relegated at the end of the season. The following season in the Scottish First Division the club ran into financial difficulties and were placed in administration in March 2013. This led to a 15-point deduction penalty by the Scottish Football League as well as many first-team players leaving. The effect of the points penalty saw Jefferies' side relegated to the Scottish Second Division through the Scottish First Division play-offs losing to Alloa Athletic in the two-legged final. Jefferies signed a new contract with Dunfermline in December 2013, after the club exited administration. He resigned as manager in December 2014 stating that he felt there was no other option than for him to leave the club. He also stated that Dunfermline was likely to be his last job in management."]}, {"page": "Gordon Chisholm", "response": ["Chisholm was appointed as caretaker manager of Dundee United on 14 March 2005, following the sacking of Ian McCall. Chisholm suffered 3–2 defeats against both Celtic and Hibernian in his first two matches in charge.  The following week, however, Chisholm's team triumphed over Hibernian, Rangers and Hearts. United then went on to end a run of eight games over three years without a win against neighbours Dundee, with goals by Mark Wilson and Jim McIntyre sealing a 2–1 win. These results meant that Chisholm won the SPL manager of the month award in his first full month in charge of the team (April 2005). Chisholm's team then retained SPL status in dramatic style with a late Barry Robson penalty at Inverness on the final day of the season."]}]}}