{"wiki_id": "http://www.wikidata.org/entity/Q1038846", "itemLabel": "Charles Waterton", "itemDescription": "Naturalist and explorer", "wikipedia_url": "https://en.wikipedia.org/wiki/Charles_Waterton", "wikipedia_page": {"main": "Charles Waterton (3 June 1782 – 27 May 1865) was an English naturalist, explorer, and for seven years, a slave plantation manager. He is best known as a pioneering conservationist.\n\n", "link_mentions": [{"page": "1813", "response": ["* Charles Waterton begins the process of turning his estate at Walton Hall, West Yorkshire, England into what is, in effect, the world's first nature reserve."]}, {"page": "Richard Aldington", "response": ["*The Strange Life of Charles Waterton, 1782–1865 (1949)"]}, {"page": "List of biologists", "response": ["*Charles Waterton (1782–1865), English naturalist who introduced curare to Europe"]}, {"page": "John Hanning Speke", "response": ["*  — Includes Charles Waterton, John Hanning Speke, Henry Seebohm and Mary Kingsley. "]}, {"page": "Nature reserve", "response": ["The world's first modern nature reserve was established in 1821 by the naturalist and explorer Charles Waterton around his estate in Walton Hall, West Yorkshire. He spent £9000 on the construction of a three-mile long, 9 ft tall wall to enclose his park against poachers. He tried to encourage bird life by planting trees and hollowing out trunks for owls to nest in."]}, {"page": "West Yorkshire", "response": ["* Walton Hall, West Yorkshire, home of naturalist Charles Waterton and the world's first nature reserve"]}, {"page": "Walton, Wakefield", "response": ["Historically part of the West Riding of Yorkshire, the village lies on the Barnsley Canal and is home to Walton Hall, once the residence of Charles Waterton, known as 'Squire' Waterton. He was a  naturalist and explorer who, in 1820, transformed the grounds of the Walton Hall estate the world's first nature reserve. The estate is also often referred to on Ordnance Survey maps, etc., as Walton Park and, less frequently, as Walton Hall Park.  More recently, it has become widely known as Waterton Park.", "The first village school was established in the village in 1722 when two large cottages on Shay Lane were donated by Charles Waterton (grandfather of the aforementioned Squire Charles Waterton). One of the two cottages was a small schoolroom and the other was let to the newly appointed schoolmaster free of charge, providing the two poor children of the village were educated for free.", "* Blackburn, Julia. Charles Waterton, 1782–1865 Traveller and Conservationist. Century Publications, 1991. ", "* Moore, N. Charles Waterton of Walton Hall, 1762–1865. Wakefield Historical Publications, 1981. "]}, {"page": "Walton Hall, West Yorkshire", "response": ["Walton Hall is a stately home in the county of West Yorkshire, England, near Wakefield. It was built in the Palladian style in 1767 on an island within a  lake, on the site of a former moated medieval hall. It was the ancestral home of the naturalist and traveller Charles Waterton,  who made Walton Hall into the world's first wildfowl and nature reserve. Waterton's son, Edmund, sold the estate.", "Walton Hall with his residence at Cawthorne, was home to the Old English (Anglo-Saxon) Chieftain, Ailric, the ancestor of Charles Waterton, who is mentioned in the Domesday Book and was the Kings Thane for South Yorkshire. The day the Normans first came to Yorkshire, Ailric was at Walton Hall and was alerted by a man on horseback that they were coming in force. He hastily amassed his retainers and on horseback they ambushed the mounted Norman knights of Ilbert de Laci, who were moving on the road from Tanshelf to Wakefield. The better armoured and armed knights of Ilbert de Laci were able to drive off this attack. For 2–3 years Ailric was able to maintain a guerrilla war out of his estates in the west of South Yorkshire, until Ilbert was forced to come to an accommodation with him, whereby Ailric would communicate with the local people and Ilbert would grant him back, many of his former estates, including Walton Hall.", "In the time of Sir Robert Waterton who served King Henry VIII the hall came to the waters edge and was three storeys high. Sir Robert Waterton's father-in-law was Sir Richard Tempest, who was with King Henry VIII at the Field of the Cloth of Gold. His father in law was also Steward of the King's manor of Wakefield and involved in the Tempest - Saville feud. The only part of the old buildings that remain is the old watergate, which is said to be part of an earlier 14th century structure. At that time it was the only entrance to be made, across a lowered drawbridge. The old oak hall referred to by Charles Waterton was on the second storey and was in an L shape.", ":::Charles Waterton: His Home, Habits and Handiwork. Reminiscences of an Intimate and Most Confiding Personal Association for Nearly Thirty Years, by Richard Hobson MD. (1866/7)"]}, {"page": "Wakefield", "response": ["The National Coal Mining Museum for England (an Anchor Point of ERIH, The European Route of Industrial Heritage), the Yorkshire Sculpture Park and Nostell Priory are within the Wakefield metropolitan area, as is Walton Hall, a Georgian mansion set in what was the world's first nature reserve, created by the explorer Charles Waterton; the house is now a hotel."]}, {"page": "British Guiana", "response": ["* Charles Waterton"]}, {"page": "Little owl", "response": ["In 1843 several little owls that had been brought from Italy were released by the English naturalist Charles Waterton on his estate at Walton Hall in Yorkshire but these failed to establish themselves. Later successful introductions were made by Lord Lilford on his Lilford Hall estate near Oundle in Northamptonshire and by Edmund Meade-Waldo at Stonewall Park near Edenbridge, Kent. From these areas the birds spread and had become abundant by 1900. The owls acquired a bad reputation and were believed to predate game bird chicks. They therefore became a concern to game breeders who tried to elliminate them. In 1935 the British Trust for Ornithology initiated a study into the little owl's diet led by the naturalist Alice Hibbert-Ware. The report showed that the owls feed almost entirely on insects, other invertebrates and small mammals and thus posed little threat to game birds."]}, {"page": "El Dorado", "response": ["Between 1799 and 1804, Alexander von Humboldt conducted an extensive and scientific survey of the Guyana river basins and lakes, concluding that a seasonally-flooded confluence of rivers may be what inspired the notion of a mythical Lake Parime, and of the supposed golden city on the shore, nothing was found. Further exploration by Charles Waterton (1812) and Robert Schomburgk (1840) confirmed Humboldt's findings."]}, {"page": "Natural History Museum, London", "response": ["* The Travelling Naturalists (1985) by Clare Lloyd. (Study of 18th Century Natural History — includes Charles Waterton, John Hanning Speke, Henry Seebohm and Mary Kingsley). Contains colour and black and white reproductions. Croom Helm (UK). ."]}, {"page": "1782 in science", "response": ["* June 3 – Charles Waterton, English naturalist and explorer (died 1865)"]}, {"page": "1825 in science", "response": ["* Charles Waterton publishes Wanderings in South America, the North-west of the United States, and the Antilles, in the years 1812, 1816, 1820, and 1824; with original instructions for the perfect preservation of birds, &c. for cabinets of natural history."]}, {"page": "1813 in science", "response": ["* Charles Waterton begins the process of turning his estate at Walton Hall, West Yorkshire, England, into what is, in effect, the world's first nature reserve."]}, {"page": "1865 in science", "response": ["* May 27 – Charles Waterton (born 1782), English naturalist and explorer."]}, {"page": "Waterton Lakes National Park", "response": ["Waterton Lakes National Park is a national park located in the southwest corner of Alberta, Canada. It borders Glacier National Park in Montana, United States. Waterton was the fourth Canadian national park, formed in 1895 and named after Waterton Lake, in turn after the Victorian naturalist and conservationist Charles Waterton. Its range is between the Rocky Mountains and prairies. This park contains  of rugged mountains and wilderness."]}, {"page": "Mary Kingsley", "response": ["*  A study of 18th Century Natural History - includes Charles Waterton, John Hanning Speke, Henry Seebohm and Mary Kingsley. Contains colour and black and white reproductions. "]}, {"page": "English Mastiff", "response": ["Systematic breeding began in the 19th century,The History of the Mastiff, M. B. Wynn 1885. William Loxley. when J.W. (John Wigglesworth) Thompson purchased a bitch, Dorah, from John Crabtree, the head gamekeeper of Kirklees Hall, whose dogs were often held in the name of his employer, Sir George Armitage. Dorah was descended in part from animals owned by Thompson's grandfather Commissioner Thompson at the beginning of the century, as well as a Mastiff of the Bold Hall line (recorded from 1705), a bitch purchased from canal boat men, another caught by Crabtree in a fox trap, a dog from Nostal priory and another dog from Walton Hall, owned by the naturalist, Charles Waterton. J. W. Thompson's first stud dog, Hector, came from crossing a bitch, Juno, bought from animal dealer Bill George, to a dog, Tiger, owned by a Captain Fenton. Neither of these had any pedigree, as was normal for the period. Between 1830 and 1850 he bred the descendants of these dogs and some others to produce a line with the short, broad head and massive build he favoured. In 1835, T.V.H. Lukey started his operations by breeding an Alpine Mastiff bitch of the Chatsworth line, Old Bob-Tailed Countess (bought from dog dealer Bill White), to Pluto, a large black Mastiff of unknown origin belonging to the Marquis of Hertford. The result was a bitch called Yarrow, who was mated to Couchez, another Alpine Mastiff belonging (at the time) to White and later mated to a brindle dog also in White's possession. Lukey produced animals that were taller but less massive than Thompson's. After 1850, Thompson and Lukey collaborated, and the modern Mastiff was created, though animals without pedigree or of dubious pedigree continued to be bred from into the 20th century."]}, {"page": "List of alumni of Jesuit educational institutions", "response": ["*Charles Waterton - English naturalist and explorer (Stonyhurst College in Lancashire)"]}, {"page": "Curare", "response": ["In 1596, Sir Walter Raleigh mentioned the arrow poison in his book Discovery of the Large, Rich, and Beautiful Empire of Guiana (which relates to his travels in Trinidad and Guayana), though the poison he described possibly was not curare. In 1780, Abbe Felix Fontana discovered that it acted on the voluntary muscles rather than the nerves and the heart. In 1832, Alexander von Humboldt gave the first western account of how the toxin was prepared from plants by Orinoco River natives.During 1811–1812, Sir Benjamin Collins Brody experimented with curare (woorara). He was the first to show that curare does not kill the animal and the recovery is complete if the animal's respiration is maintained artificially. In 1825, Charles Waterton described a classical experiment in which he kept a curarized female donkey alive by artificial respiration with a bellows through a tracheostomy. Waterton is also credited with bringing curare to Europe., reprinted in  Robert Hermann Schomburgk, who was a trained botanist, identified the vine as one of the genus Strychnos and gave it the now accepted name Strychnos toxifera."]}, {"page": "Nest box", "response": ["A nest box, also spelled nestbox, is a man-made enclosure provided for animals to nest in.  Nest boxes are most frequently utilized for birds, in which case they are also called birdhouses or a birdbox/bird box, but some mammalian species such as bats may also use them. Placing nestboxes or roosting boxes may also be used to help maintain populations of  particular species in an area. The modern nest box was invented by the British conservationist Charles Waterton in the early 19th century to encourage more birdlife and wildfowl on the nature reserve he set up on his estate."]}, {"page": "Rupununi", "response": ["Sir Walter Raleigh claimed that the Rupununi was where the famed El Dorado was situated, however he never explored the river. Other early explorers such as Charles Waterton and Robert Schomburgk attempted to locate El Dorado, and successfully managed to visit the supposed location of the South-American myth, which is in fact part of the northern Rupununi. However they never found El Dorado."]}, {"page": "John Edmonstone", "response": ["A slave, he was probably born on a wood plantation in Demerara, British Guiana (present-day Guyana, South America). As was common, he was given the surname of his master, Charles Edmonstone, who owned the plantation and also owned the Cardross Park estate at Cardross, near Dumbarton in Scotland. Around 1812 the plantation was visited by the naturalist Charles Waterton, who spent considerable time teaching John Edmonstone taxidermy."]}, {"page": "List of English inventions and discoveries", "response": ["* 1821: World's first modern nature reserve established by naturalist and explorer Charles Waterton (1782–1965); Waterton was described by David Attenborough  as \"one of the first people anywhere to recognise not only that the natural world was of great importance but that it needed protection as humanity made more and more demands on it\"."]}, {"page": "List of Old Stonyhursts", "response": ["*Charles Waterton, Naturalist and creator of the world's first national park", "thumb|right|Charles Waterton"]}, {"page": "Waterton", "response": ["* Walton Hall at Waterton Park, a former seat of Charles Waterton and the Waterton family", "* Charles Waterton, an English naturalist"]}, {"page": "Charles Darwin", "response": ["Darwin spent the summer of 1825 as an apprentice doctor, helping his father treat the poor of Shropshire, before going to the University of Edinburgh Medical School (at the time the best medical school in the UK) with his brother Erasmus in October 1825. Darwin found lectures dull and surgery distressing, so he neglected his studies. He learned taxidermy in around 40 daily hour-long sessions from John Edmonstone, a freed black slave who had accompanied Charles Waterton in the South American rainforest."]}, {"page": "1813 in the United Kingdom", "response": ["* Charles Waterton begins the process of turning his estate at Walton Hall, West Yorkshire, into what is, in effect, the world's first nature reserve."]}, {"page": "1782 in Great Britain", "response": ["* 3 June – Charles Waterton, naturalist and explorer (died 1865)"]}, {"page": "1865 in the United Kingdom", "response": ["* 27 May – Charles Waterton, naturalist and explorer (born 1782)"]}, {"page": "Julia Blackburn", "response": ["* Charles Waterton, 1782–1865: Conservationist and Traveller (1991)"]}, {"page": "Jemima Blackburn", "response": ["Jemima Blackburn was a keen observer of bird behaviour, as evidenced by her writings. She describes the ejection of nestling meadow pipits (Anthus pratensis) by a blind and naked hatchling common cuckoo (Cuculus canorus), accompanied by a small drawing. This behaviour had been reported by Edward Jenner in 1788 but dismissed as impossible by Charles Waterton in 1836. Blackburn's account was originally published in a popular narrative for children, The Pipits in 1871. Charles Darwin refers to Blackburn's observations in the sixth edition of On the Origin of Species."]}, {"page": "Waterton, Lincolnshire", "response": ["Waterton is mentioned in the Domesday Book which records that, before the Norman Conquest, the manor was held by Fulcric who had one carucate of land with a hall.Folio: 369v Great Domesday Book At the time of the Domesday survey, it was waste. It became the property of the Abbot of Selby and at some point between 1160 and 1179 when Gilbert de Ver was Abbot, it was given by him to Reiner de Normanby, son of Norman de Normanby, for an annual rent of twelve shillings, the payment of which is enacted annually at Luddington at Candlemas.\"Lord of the Manor obeys order to pay: Lords of the Manor of Waterton should pay 12 shillings each year to the priest at Luddington.\" Lincolnshire Life vol 39 no 12 Mar 2000 p 7http://www.scunthorpetelegraph.co.uk/pictures/DAY-15-years-ago-21-Scunthorpe-Telegraph-pictures/pictures-28652436-detail/pictures.html#4 Reiner took the name de Waterton. According to the 19th-century historian of the Isle of Axholme Rev Stonehouse:Rev W.B. Stonehouse, MA. The History and Topography of the Isle of Axholme, being that part of Lincolnshire which is West of the Trent, Longman, Rees, Orme (London 1839) p446 \"this family is equal if not superior in a long line of ancestry to most of the commoners of England\". Notable members of the familyJ.W. Walker, OBE, FSA. The Burghs of Cambridgeshire and Yorkshire and the Watertons of Lincolnshire and Yorkshire (1931) The Yorkshire Archæological Journal XXX pp.314-419. include John de Waterton (Master of the Horse), Robert Waterton (guardian of Richard of York, 3rd Duke of York), Sir Hugh Waterton, Sir Robert and Sir Thomas Waterton (High Sheriffs of Yorkshire), Lady Margaret Waterton (Lady of the Garter), and Charles Waterton the naturalist. Robert Waterton is mentioned in Shakespeare's Richard II.William Shakespeare, \"King Richard II\" Act 2, Scene 1"]}, {"page": "Libraries and collections of Stonyhurst College", "response": ["The Long Room functioned as a museum of stuffed birds in Victorian display cabinets, the Waterton Collection, donated by old boy explorer Charles Waterton until they were transferred to the corridor linking the Old Infirmary with the school. It had been Waterton's wish for this record of his lifetime's work to be on display in his former school; the collection was lent to Wakefield Museum in the 1970s.A Stonyhurst Handbook for Visitors and Others, 3rd edition, 1963 Thankfully and due to the tireless work of the current curator Jan Graffius some of the collection has now returned to its home in the Long Room. The Long Room was used as a study room from the 1970s until 2003 when it was restored and once again used for a display of items from the College collections."]}, {"page": "Guyana", "response": ["Guyana has one of the largest unspoiled rainforests in South America, some parts of which are almost inaccessible by humans. The rich natural history of Guyana was described by early explorers Sir Walter Raleigh and Charles Waterton and later by naturalists Sir David Attenborough and Gerald Durrell. In 2008, the BBC broadcast a three-part programme called Lost Land of the Jaguar which highlighted the huge diversity of wildlife, including undiscovered species and rare species such as the giant otter and harpy eagle.", "The rich natural history of British Guiana was described by early explorers Sir Walter Raleigh and Charles Waterton and later by naturalists Sir David Attenborough and Gerald Durrell.", "* Charles Waterton, Wanderings in South America."]}, {"page": "List of British innovations and discoveries", "response": ["*The world's first Nature Reserve – Charles Waterton *Public Park – Joseph Paxton"]}, {"page": "Lake Parime", "response": ["===Charles Waterton, 1812===", "In 1812 Charles Waterton independently came to a similar conclusion and proposed that seasonal flooding of the Rupununi savannah could be the famed Lake Parime. Waterton wrote:"]}, {"page": "Sir Norman Moore, 1st Baronet", "response": ["Moore was born in Higher Broughton, Salford, Lancashire, in 1847. He was the only child of abolitionist and social reformer Rebecca Moore, née Fisher, of Limerick and the noted Irish  political economist Robert Ross Rowan Moore. The couple had been estranged since before Norman's birth, and he was raised by Rebecca through the support of her circle of Liberal nonconformist friends at Manchester. He studied initially at Chorlton High School, but left at the age of 14 to work in a cotton mill. He studied at Owens College from 1862 until 1865, and then read natural sciences at St Catharine's College, Cambridge University, from 1865 to 1868, graduating in 1869. During his time in Cambridge he met and became friends with Francis Darwin, the son of Charles Darwin, and the Reverend Whitwell Elwin. During his childhood in Manchester he had developed a passion for walking, and had visited Ireland on a walking tour, cementing his affinity for the country's history, people and culture. In 1863 he had visited the natural history collection at Walton Hall, Wakefield, befriending the author and explorer Charles Waterton."]}, {"page": "List of people from Wakefield", "response": ["* Charles Waterton, naturalist"]}]}}