{"wiki_id": "http://www.wikidata.org/entity/Q10396689", "itemLabel": "Nathan Lowndes", "itemDescription": "British footballer (born 1977)", "wikipedia_url": "https://en.wikipedia.org/wiki/Nathan_Lowndes", "wikipedia_page": {"main": "Nathan Peter Lowndes (born 2 June 1977) is an English former footballer who played as a forward.\nHe began his career with Leeds United, but failed to break into the first before his move to Watford in 1995. After making little impact at Watford, he moved to Scotland to play for St Johnstone in 1998. Three years later he transferred to Livingston. In 2002, he was loaned out to Rotherham United, before he moved back to England permanently with Plymouth Argyle later in the year. In 2004, he joined Port Vale, where he would stay for three years. He finished his professional career with Chester City at the end of the 2007–08 campaign, though came out of retirement to join Scone Thistle in May 2012.", "link_mentions": [{"page": "Plymouth Argyle F.C.", "response": ["** Argyle defeated Chesterfield 7–0 at Home Park to record their joint biggest win. In the process they also broke the English record for the fastest five goals scored in a professional game–after just 17 minutes. The goalscorers were: Lee Hodges (4 minutes), Tony Capaldi (11 minutes), Nathan Lowndes (12 & 17 minutes) and David Friio (16 minutes). Friio went on to complete his hat-trick, scoring in the 36th and 89th minutes. Football League Second Division, 3 January 2004."]}, {"page": "2002–03 Plymouth Argyle F.C. season", "response": ["The club began the 2002–03 season in the Football League Second Division, following their promotion from the Third Division.GoS: 2002–03 They finished in a creditable 8th position, with a record of 17 wins, 14 draws, and 15 defeats, from 46 games. Their leading goalscorer was Marino Keith with 12 goals in all competitions. The club reached the Third Round of the FA Cup, drawing 2–2 at home with Dagenham & Redbridge before losing the replay 2–0. They entered the League Cup at the First Round stage and were eliminated away to Crystal Palace 2–1 after extra-time. They also competed in the Football League Trophy where they reached the Second Round before being defeated 2–0 at home by Brentford. Notable players to begin their careers with the Pilgrims this season included David Norris, Tony Capaldi, Hasney Aljofree, and Nathan Lowndes.", "| 8 July 2002 ||  Nathan Lowndes || Livingston || Undisclosed"]}, {"page": "2004–05 Plymouth Argyle F.C. season", "response": ["|Nathan Lowndes"]}, {"page": "Lowndes", "response": ["*Nathan Lowndes (born 1977), English footballer"]}, {"page": "John Lambie (footballer, born 1941)", "response": ["In January 2003, Lambie announced that he would retire at the end of the season as he did not agree with new regulations in football; he had attempted to sign Nathan Lowndes and Steven Ferguson on loan from English clubs but was barred by FIFA as they had both recently played in Scotland for other teams. On 17 May 2003 he made his farewell in his last game at Firhill Stadium, a 1–0 loss to Dundee United, having already guaranteed survival in the SPL on a considerably lower budget than their competitors. He became a member of the club's board. In 2004, Lambie returned as manager for a fourth spell, this time as Caretaker, briefly around the end of 2004 and beginning of 2005, in a bid to help the team's struggles on the pitch under the new management foil of Derek Whyte and Gerry Britton, who were later dismissed from their roles, as Dick Campbell took over reign at Firhill."]}, {"page": "List of St Johnstone F.C. seasons", "response": ["|Nathan Lowndes"]}, {"page": "1999–2000 Scottish Premier League", "response": ["|  Nathan Lowndes || St Johnstone || style=\"text-align:center\"|10"]}, {"page": "Leeds United F.C. Reserves and Youth Team", "response": ["* Nathan Lowndes"]}, {"page": "History of Port Vale F.C.", "response": ["Foyle spent almost four years as manager after this, but the style of football the team were playing did him few favours as Vale finished 17th and 13th in his first two full campaigns in charge despite promising starts. Arguably the club's best recent achievements came in the two major cup competitions in the calendar year of 2006. Vale made it to the 4th round of the FA Cup in 2005–06 which was the club's first appearance at that stage since the club's giantkilling exploits a decade earlier. Vale were drawn away to Premier League Aston Villa but were defeated 3–1, holding the Birmingham side well into the 2nd period before succumbing to 2 Milan Baroš strikes and although Nathan Lowndes pulled one back, Steven Davis scored Villa's third."]}, {"page": "1998 Scottish League Cup Final", "response": ["|CF |14||| Nathan Lowndes || "]}, {"page": "Nathan Peter Lowndes", "response": ["#REDIRECT Nathan Lowndes"]}, {"page": "Emma Lowndes", "response": ["Lowndes is the eldest of three siblings born to Eric and Suzanne Lowndes. She has a younger brother, footballer Nathan Lowndes, and a sister, Katie Lowndes."]}, {"page": "1994–95 Leeds United A.F.C. season", "response": ["|  Nathan Lowndes"]}, {"page": "2004–05 Port Vale F.C. season", "response": ["The season started positively with ten points from five games, though until the end of the season Vale failed to find form, and picked up an average of one point a game despite only playing in five draws all season. At half-time at the opening game of the season at Vale Park, fans were surprised to hear an announcement over the public address system telling them not to sing songs deriding rivals Stoke City. Mark Goodlad picked up an injury, allowing Jonny Brain the chance to impress between the sticks. At the end of September, star midfielder Steve Brooker was sold to Bristol City for £225,000. The club failed to bring in Christian Roberts in return, though Marc Goodfellow was signed on a four-week loan deal the following month. Teenage defender James O'Connor also joined on loan from Aston Villa. In November, Andreas Lipa returned to his homeland to play for Austria Lustenau, after Foyle released the injury-plagued defender. McMahon also left the club to join Leyton Orient. Foyle brought a new signing to Vale Park though, with striker Nathan Lowndes joining on a free transfer from Plymouth Argyle. In December, defender Tyrone Loran joined on a one-month loan from Tranmere Rovers, though returned to Prenton Park when the loan deal was up, after Foyle failed to sign him permanently. Christian Hanson was also signed from non-league Billingham Synthonia. Foyle also signed Nigerian defender George Abbey, who had been released by Macclesfield Town. In January, Dean Smith retired as a player and took up coaching at Leyton Orient. As a replacement, former Vale player Tommy Widdrington joined until the end of the season on non-contract terms. In February, veteran midfielder Danny Sonner joined on a one-month loan from Peterborough United. In March, club legend and former teammate of Foyle, Tony Naylor, joined on an emergency short-term contract, though never took to the field. Tony Dinning also was signed on loan from Bristol City. In addition to this, Mark Innes joined on a free transfer from Chesterfield. Sonner's loan deal was also extended until the end of the season, at which point he was signed permanently, as was Dinning. Vale lost to fellow relegation strugglers Torquay United and Wrexham in the last five games of the season, though a 5–0 win over Barnsley ensured the club's safety from the drop.", "|align=\"left\"|FW||9||align=\"left\"| Nathan Lowndes", "|–||FW||||9||Nathan Lowndes||1||0||0||0||1", "| November 2004 || FW ||  || Nathan Lowndes || Plymouth Argyle || Free transfer || "]}, {"page": "2005–06 Port Vale F.C. season", "response": ["|align=\"left\"|FW||9||align=\"left\"| Nathan Lowndes", "|3||FW||||9||Nathan Lowndes||5||1||0||0||6"]}, {"page": "2006–07 Port Vale F.C. season", "response": ["At the end of the season a number of players were released: Nathan Lowndes (Chester City); George Abbey (Crewe Alexandra); Rhys Weston (Walsall); Michael Husbands (Macclesfield Town); Christian Smith (Clyde); Ross Gardner (Ilkeston Town); Malvin Kamara (Huddersfield Town); Michael Walsh and Mark Soboljew. Leon Constantine also decided against signing a new contract at Vale, and instead joined Leeds United. Danny Sonner also rejected his contract offer, and moved on to Walsall, but not before making a parting shot at the club's leadership.", "|align=\"left\"|FW||9||align=\"left\"| Nathan Lowndes", "| June 2007 || FW ||  || Nathan Lowndes || Chester City || Released || "]}]}}