{"wiki_id": "http://www.wikidata.org/entity/Q10315513", "itemLabel": "Lady Iris Mountbatten", "itemDescription": "English actress and model (1920-1982)", "wikipedia_url": "https://en.wikipedia.org/wiki/Lady_Iris_Mountbatten", "wikipedia_page": {"main": "Lady Iris Mountbatten (13 January 1920 – 1 September 1982) was an English actress and model, and a member of the Battenberg/Mountbatten family. She was the youngest great-grandchild of Queen Victoria. She was also a niece of Queen Victoria Eugenie of Spain.", "link_mentions": [{"page": "Royal Marriages Act 1772", "response": ["| 29 January 1941 || The Lady Iris Mountbatten || Hamilton Joseph Keyes O'Malley || not gazetted; HO124/46."]}, {"page": "Princess Marina of Greece and Denmark", "response": ["Her eight bridesmaids were her first cousins, Greek princesses Irene, Eugenie and Katherine, her maternal first cousin Grand Duchess Kira Kirillovna of Russia, her first cousin once removed Princess Juliana of the Netherlands, her husband's niece Princess Elizabeth of York, her husband's cousins the Lady Iris Mountbatten and Lady Mary Cambridge."]}, {"page": "Princess Beatrice of the United Kingdom", "response": ["| 90px ||align=left|Alexander Mountbatten, Marquess of Carisbrooke||23 November 1886||23 February 1960||align=left|married Lady Irene Denison (4 July 1890 – 16 July 1956) on 19 July 1917.1 daughter (Lady Iris Mountbatten, 1920–1982)."]}, {"page": "Mountbatten family", "response": ["** Lady Iris Mountbatten (1920–1982) m. Captain Hamilton Joseph Keyes O'Malley, div. 1946, m. Michael Neely Bryan, div. 1957, m. William Alexander Kemp"]}, {"page": "Alexander Mountbatten, 1st Marquess of Carisbrooke", "response": ["*Lady Iris Mountbatten (13 January 1920 – 1 September 1982)"]}, {"page": "Descendants of Queen Victoria", "response": ["| 80px ||Prince Alexander of Battenberg,later Sir Alexander Mountbatten,  first Marquess of Carisbrooke ||align=center|Windsor Castle, Berkshire, England||align=center|Kensington Palace, London||In 1917, Prince Alexander became Sir Alexander Mountbatten. On 7 November 1917, he was created Marquess of Carisbrooke, Earl of Berkhampsted and Viscount Launceston. Married 1917 Lady Irene Denison (1890–1956) and had issue (1 daughter): Lady Iris Mountbatten (1920–1982)."]}, {"page": "List of people involved in coronations of the British monarch", "response": ["*1937: Duchess of Northumberland, Lady Ursula Manners, Lady Diana Legge, Lady Elizabeth Percy, Lady Iris Mountbatten"]}, {"page": "St Mildred's Church, Whippingham", "response": ["*Lady Iris Mountbatten, daughter of The Marquess of Carisbrooke (ashes)"]}, {"page": "Mike Bryan (musician)", "response": ["In 1962, he toured Europe as music director of a band also sponsored by Goodyear. In 1966, he toured Vietnam with Martha Raye. On 5 May 1957 he married Lady Iris Mountbatten, only child of Alexander Mountbatten, 1st Marquess of Carisbrooke and a great-granddaughter of Queen Victoria. They divorced months later. He died of leukemia in 1972."]}, {"page": "Coronation of George VI and Elizabeth", "response": ["* Lady Iris Mountbatten (1920-1982), daughter of the Marquess of Carisbrooke.  "]}, {"page": "Versatile Varieties", "response": ["*On CBS, from January 28 to July 22, 1951, a Sunday morning children's TV show hosted by Lady Iris Mountbatten called Versatile Varieties, Junior Edition."]}, {"page": "List of participants in the coronation processions of George VI", "response": ["| colspan=2 | The Queen  Her train borne by the Mistress of the Robes: the Dowager Duchess of Northumberland  Assisted by:  Lady Ursula Manners, Lady Diana Legge, Lady Margaret Cavendish-Bentinck  Lady Elizabeth Percy, Lady Elizabeth Paget and Lady Iris Mountbatten  The Duchess's Page: Lord Geoffrey Percy || "]}]}}