{"wiki_id": "http://www.wikidata.org/entity/Q10379400", "itemLabel": "Neal Ardley", "itemDescription": "English association football player and manager (born 1972)", "wikipedia_url": "https://en.wikipedia.org/wiki/Neal_Ardley", "wikipedia_page": {"main": "Neal Christopher Ardley (born 1 September 1972) is an English professional football manager and former player who played as a right midfielder. He is currently the manager of Solihull Moors.\nArdley was capped at Under-21 level by England. Ardley spent the majority of his career with Wimbledon, making his debut for them on 20 April 1991 at the age of 18 in a 2–1 away win over Aston Villa in the Football League First Division. He went on to make over 100 appearances for Watford before having spells at Cardiff City and Millwall.Ardley announced his retirement from professional football on 30 August 2007 after suffering a series of injuries. On the same day, Ardley announced that he would return to former club Cardiff City having been appointed manager of the Cardiff City Youth Academy. He was the manager of AFC Wimbledon from 10 October 2012 to 12 November 2018. He took over as manager of Notts County on 23 November 2018.", "link_mentions": [{"page": "AFC Wimbledon", "response": ["The 2012–13 campaign marked the 10th anniversary of AFC Wimbledon's inaugural season. After an abysmal start to the season, manager Terry Brown was sacked on 19 September 2012 along with assistant manager Stuart Cash, with AFC Wimbledon sitting just above the relegation zone. First team coach Simon Bassey took over as caretaker manager with immediate effect. Bassey was in charge just four matches, however, before former Wimbledon player Neal Ardley was appointed as Terry Brown's permanent replacement on 10 October 2012, naming former Watford and Cardiff City teammate Neil Cox as his assistant manager. On 2 December 2012, AFC Wimbledon faced Milton Keynes Dons in the second round of the FA Cup, in the first ever meeting between the two sides following the relocation of Wimbledon F.C. to Milton Keynes, with the match ending as a 2–1 defeat for AFC Wimbledon. The Dons secured their Football League status on the final day of the 2012–13 season, despite having started the day in the relegation zone, by beating Fleetwood Town 2–1 at Kingsmeadow on 27 April 2013.", "AFC Wimbledon saw a disastrous start to the 2018–19 season, losing twelve of their first seventeen league games. Manager Neal Ardley departed the club by mutual agreement on 12 November 2018 after a tenure of 6 years, 1 month, 2 days, making him the longest serving manager to date. One bright spot in their season was the club's first ever appearance in the FA Cup 5th Round after beating West Ham United 4–2 in the 2018–19 FA Cup. On 4 December 2018, Glyn Hodges joined Wally Downes as AFC Wimbledon's assistant manager. After being rooted to the bottom of the table for most of 2019, they lost only 1 of their last 12 league games to lift them out of the relegation zone, ultimately staying up on goal difference on the last day of the season after a 0–0 draw with already relegated Bradford City. On 25 September 2019, Glyn Hodges took over the management of the first team on a temporary basis following the suspension of Wally Downes after being charged by the FA for betting misconduct. The club's youth coach, Mark Robinson, replaced Hodges on 30 January 2021, after a run of poor results; Robinson turned the season around and the club avoided relegation on the second-last matchday.", "As part of WISA's campaign to try and reclaim the history of Wimbledon Football Club, the Wimbledon Old Players Association (WOPA) was formed in 2005. Membership of WOPA is open to all former Wimbledon F.C. and AFC Wimbledon players and managers. Among the sixty founding members were Glenn Mulcaire, who scored AFC Wimbledon's first ever goal in 2002 and Kevin Cooper, who remains the club's all-time highest goal scorer with 107 goals between August 2002 and May 2004, as well as retaining the title for the most goals scored in a season with 66 during 2003–04. Others that joined included some of the legends of the old Wimbledon F.C. such as John Fashanu, Dave Beasant, Efan Ekoku, Neil Sullivan, Dave Bassett, Wally Downes, Marcus Gayle, Neal Ardley, Alan Kimble, Andy Thorn, Roger Joseph, Dickie Guy, Allen Batsford, Roger Connell, Ian Cooke, Roy Law and Steve Galliers.A club is born, Will Buckley, The Guardian, 14 July 2002 On 16 July 2006, WOPA fielded a team in the Masters Football Tournament at Wembley Arena, with AFC Wimbledon's backing. The team included Carlton Fairweather, Scott Fitzgerald, Marcus Gayle, and Dean Holdsworth.", "|| Neal Ardley||Epsom||10 October 2012||12 November 2018||326||108||91||127||33.13||2015–16 Football League Two play-off winners"]}, {"page": "Notts County F.C.", "response": ["On 12 January 2017, Alan Hardy completed the takeover of the club from Ray Trew and appointed Kevin Nolan as manager, followed in August 2018 by Harry Kewell. On 13 November 2018, Kewell left the club to be replaced by Neal Ardley. On 27 January 2019 with County bottom of League Two, Hardy officially put the club up for sale, though not before attracting the attention of the FA for accidentally including a picture of his penis in a screenshot posted to Twitter. On 4 May 2019 following a 3–1 defeat away at Swindon Town, Notts County were relegated from the English Football League for the first time in their 157-year history. The club was sold in the summer to Danish businessmen Alexander and Christoffer Reedtz.", "|align=left|Neal Ardley"]}, {"page": "Richard Duffy", "response": ["On 6 February 2018, he played former club Swansea City in the FA Cup, which ended in an 8–1 defeat. Nevertheless, he scored two goals in 43 league appearances to help the \"Magpies\" to qualify for the play-offs at the end of the 2017–18 campaign. He also filled in as captain during absences by Michael O'Connor and the Nottingham Post reported that he had an \"outstanding season\". He was offered new contract by Notts County at the end of the 2017–18 season. He missed three months at the start of the 2018–19 season with a hamstring injury. Speaking in April, manager Neal Ardley stated that \"he has been excellent [and] he has been part of the reason why we have looked solid at the back\". County were relegated at the end of the campaign, ending a 131-year stay in the Football League. He was released by Notts County at the end of the 2018–19 season."]}, {"page": "1996–97 FA Premier League", "response": ["| align=\"left\" |  Neal Ardley"]}, {"page": "Carlton Cole", "response": ["On 9 August 2016, Cole signed for United Soccer League club Sacramento Republic. After four appearances, he left the club to return to the United Kingdom. On 30 March 2017, Cole signed for Indonesian club Persib Bandung in the Liga 1. Signing a ten-month contract, he was reunited with former Chelsea teammate Michael Essien. Cole only played twice as a starter from his five appearances without scoring a goal. On 4 August, Persib officially terminated his contract. Cole was handed a trial by AFC Wimbledon in the beginning of January 2018 and immediately played for their development squad, where he scored a goal in his first game.Report: West Ham cult hero Carlton Cole on trial with League One side AFC Wimbledon‚ hitc.com, 10 January 2018 According to the club's manager, Neal Ardley \"Carlton's agent spoke to Simon Bassey [first-team coach] and asked about him coming in. This was back in November and we said yeah\".Exclusive: AFC Wimbledon boss provides update on Carlton Cole – as ex-West Ham, Chelsea and Charlton striker continues to train with Dons‚ londonnewsonline.co.uk, 17 January 2018 However, he was never handed a contract and despite interest from Hull City and Birmingham City, Cole announced his official retirement on 29 March 2018.Carlton Cole calls for West Ham fans to get behind team as he hangs up his boots‚ whufc.com, 29 March 2018"]}, {"page": "Barry Fuller", "response": ["On 28 May 2013, Fuller signed for League Two side AFC Wimbledon along with former Havant & Waterlooville midfielder Chris Arthur. Shortly after his signing, Fuller disclosed to the media that he hoped to establish himself as a key member of the squad and expressed his loyalty to the club by stating that he hoped to see out the rest of his professional career with AFC Wimbledon. A month later, he found himself reunited with former teammate and fellow ex-Gillingham captain, Andy Frampton, when it was announced that he had also signed a contract with the South London club on 28 June 2013. On 31 July 2013, manager Neal Ardley appointed Alan Bennett as club captain and declared that Fuller would act as vice-captain for the 2013–14 season. Fuller made his league debut for \"The Dons\" in a 1–1 draw with Torquay United on 3 August 2013. He was an ever-present for the club throughout the season, making forty five league appearances in total. Fuller's consistently committed performances and dogged attitude quickly established him as a favourite with supporters, culminating in him being voted as Player of the Year at the end of season awards. He scored his first goal for the Dons when he scored the winner in a 1–0 win over Dagenham & Redbridge."]}, {"page": "Neal", "response": ["*Neal Ardley (born 1972), English footballer and manager of AFC Wimbledon"]}, {"page": "2007–08 in English football", "response": ["*30 August 2007 – Neal Ardley (Millwall)"]}, {"page": "Rhys Weston", "response": ["In July 2013, Weston went on trial with League Two side AFC Wimbledon, and scored a goal in the \"Dons\" first friendly of the 2013–14 season, a 2–2 draw with Conference side Dartford at Princes Park on 6 July. He played the full ninety minutes in the \"Dons\" next friendly, a 2–0 win over Northern Premier League Premier Division side F.C. United of Manchester at The Cherry Red Records Stadium on 13 July. Weston came on as a second-half substitute in AFC Wimbledon's third pre–season game of the 2013–14 season, a 1–1 home draw against Championship side Charlton Athletic on 18 July. Three days later, Weston made his fourth friendly appearance for \"The Dons\" and played the full match as they beat Isthmian League Division One South side Walton Casuals 1–0 away at Waterside Stadium. Weston played in the \"Dons\" final pre–season game of the 2013–14 season, a 3–0 defeat to Italian Lega Pro Seconda Divisione/A side S.S.D. Monza 1912 at the Stadio Brianteo on 27 July 2013. Following Weston playing in all but one of the \"Dons\" pre–season games, manager Neal Ardley revealed he was hoping to sign Weston to a deal with AFC Wimbledon and on 7 August 2013, AFC Wimbledon confirmed the signing of Weston with Ardley praising Weston's desire to earn a contract with his dedication to the cause during pre–season."]}, {"page": "Neil Cox", "response": ["His final Football League club was then League One outfit Crewe Alexandra. Cox retired from professional football in 2008, going on to become a property developer in Portugal. Cox subsequently returned to the game in 2010 after being appointed manager of Leek Town. When the club had injury concerns Cox registered himself as a player with the league, making 4 appearances. Cox was in charge just one season before resigning for personal reasons. In October 2012, Cox joined Football League Two club AFC Wimbledon as assistant manager to former Watford teammate Neal Ardley. He left with Ardley on 12 November 2018. On 7 August 2020, Cox was appointed first team manager of Scunthorpe United.", "On 10 October 2012, it was announced that Cox would reunite with former Watford and Cardiff teammate Neal Ardley, a friend of Cox's for over 20 years, as his assistant manager at Football League Two side AFC Wimbledon. Ardley had invited Cox to attend his interview for the managerial position at the club and the pair took charge of the club, replacing Terry Brown who had been sacked by the club after winning just one of the opening seven matches of the 2012–13 season, leaving the Dons in 21st position. Both Neal Ardley and Neil Cox left AFC Wimbledon on 12 November 2018 by mutual consent after a long stretch of defeats and poor team performances.", "On 7 August 2020, Cox was confirmed as first team manager of EFL League Two side Scunthorpe United, this was a proud moment for Cox as it was his boyhood club. Former manager Neal Ardley wished him well and said that he would always look out for Scunthorpe's results. Things started poorly for Cox with only 4 points picked up after his opening 8 games. However an upturn of form followed with the Iron recording two wins against Oldham Athletic and Port Vale and a draw versus Morecambe F.C. from four league games  this saw Cox nominated for the November EFL League Two Manager of the Month. Following a 2–0 win at Oldham Athletic, he has since picked up 31 points from 23 games, most notably a 5-2 thumping of Harrogate Town and a 3–0 win over local rivals Grimsby Town. Cox favours a 4-4-1-1 formation. Unfortunately the impressive victory over Harrogate was more than reversed in a 6-1 defeat the following season."]}, {"page": "Rob Page", "response": ["In July 2011, Micky Adams again offered Page a coaching role at League Two club Port Vale. Page accepted, and was given a role in the club's youth set-up. He was promoted to first team coach in May 2012, following the retirement of Geoff Horsfield. In October 2012, Page was named as the bookmaker's favourite to become the next AFC Wimbledon manager. The job instead went to Neal Ardley. In May 2013, Page was reported to be one of two names considered for the vacant management position at former club Sheffield United; however David Weir was instead appointed as manager. At the end of the 2012–13 season Port Vale were promoted into League One. On 22 September 2013, Page was put in temporary charge of first team affairs at Vale Park after Micky Adams took the decision to take time off work to have hip replacement surgery. In his first match in charge the \"Valiants\" recorded a 1–0 win over Tranmere Rovers at Prenton Park."]}, {"page": "Andy Morrison", "response": ["Morrison was signed by Brian Horton for Huddersfield Town in the 1996–97 season. Horton used the £2.7 million that Sheffield Wednesday had used to purchase Andy Booth from Huddersfield, to invest in Morrison as well as Marcus Stewart from Bristol Rovers and Andy Payton from Barnsley. Horton, like Allardyce before him, also made Morrison captain. Morrison scored in his debut for Huddersfield against Charlton (which Huddersfield won 2–0). Morrison's Huddersfield teammate Ben Thornley described him as 'the hardest person to have ever played football'. Morrison won the respect of fans 'with his braveheart style warrior performances'. A knee injury restricted Morrison's appearances for Huddersfield in the 1996–97 season. He was replaced by Sam Collins in a 1–0 defeat to Tranmere Rovers in September 1996 and did not play for Huddersfield again until a 0–0 draw with Manchester City in November 1996, in which he was replaced by Kevin Gray just after half time. He did not play again until April 1997 when he replaced David Beresford, at half time, in a 2–1 defeat to Charlton Athletic. In the 1997–98 season, Morrison played in Huddersfield's 3–0 defeat to West Ham United in the League Cup, in which John Hartson scored a hat trick. He also played in Huddersfield's 1–0 defeat to Wimbledon, in the FA Cup, in which Neal Ardley scored the only goal. Huddersfield's poor results in the league that season (they went nine games without a win) led to Horton being sacked. Horton was replaced by Peter Jackson, who managed to keep the team up. Morrison played in Huddersfield's first victory that season, a 3–1 win against Stoke City (in which Lee Richardson, Stewart and Paul Dalton scored Huddersfield's goals). He also played in Huddersfield's second win of the season, a 1–0 victory against Manchester City at Maine Road, in which Rob Edwards scored the winner. In the 1998–99 season, Morrison played in Huddersfield's 2–1 defeat to Everton, in the League Cup, in which Olivier Dacourt and Marco Materazzi scored Everton's goals and Stewart scored Huddersfield's goal. Morrison fell out with Jackson early that season when the latter decided to make Barry Horne Huddersfield captain, leading to Morrison's departure."]}]}}