{"wiki_id": "http://www.wikidata.org/entity/Q10379648", "itemLabel": "Jason Kennedy", "itemDescription": "English footballer (born 1986)", "wikipedia_url": "https://en.wikipedia.org/wiki/Jason_Kennedy_(footballer)", "wikipedia_page": {"main": "Jason Brian Kennedy (born 11 September 1986) is an English professional footballer who plays as a midfielder for Marske United, on loan from Spennymoor Town where he is currently a player/coach.\nIn his 12-year-long playing career, Kennedy spent most of his career with Rochdale with whom he signed in 2009, going on to appear in 177 official games. Apart from Rochdale, Kennedy has previously played for Middlesbrough, Darlington, and has had loan spells with Boston United, and Bury. In 2013, he signed for Bradford City.", "link_mentions": [{"page": "Spennymoor Town F.C.", "response": ["| Assistant Player Coach ||  Jason Kennedy"]}, {"page": "Craig Curran", "response": ["Curran then signed on noncontract terms at Rochdale on 10 August 2012. He made his Rochdale debut, coming on as a substitute for Dele Adebola in the 70th minute, in a 4–2 loss against Torquay United on 25 August 2012. Curran then provided an assist for Jason Kennedy, for the winning goal in a 3–2 win over Accrington Stanley on 6 October 2012."]}, {"page": "2006–07 Middlesbrough F.C. season", "response": ["|3 November 2006|| Jason Kennedy||Boston United||3 months||", "|2 March 2007|| Jason Kennedy||Bury||3 months||"]}, {"page": "Tom Kennedy (English footballer)", "response": ["Kennedy made his debut, in the opening game of the season on 11 August 2007, in a 3–0 loss against Peterborough United. Since making his Rochdale debut, Kennedy quickly became a first team regular, playing in the left–back position. After suffering an illness that saw him missed one match in late–December, Kennedy returned from injury and set up one of the goals, in a 3–1 win over Darlington on 1 January 2008, followed up by scoring his first goal for the club, in a 1–0 win over Wycombe Wanderers on 11 January 2008. He scored his second goal of the season on 29 January 2008, in a 4–0 win over Chester. In the play-offs against Darlington, Kennedy scored the second penalty in a penalty shoot-out and Rochdale would win the game to go to the final to face Stockport County, after Jason Kennedy miss the final spot kick. After the match, Kennedy reflected the 2007–08 season, stating that the club have had an 'amazing' season and described this an unbelievable feeling. However, Rochdale would succumb 3–2 to Stockport County, remaining in League Two for the following season. Despite this, he went on to finish his first season, making 46 appearances (43 in the league) and scoring two times in all competitions."]}, {"page": "Middlesbrough F.C. Reserves and Academy", "response": ["| rowspan=\"5\" | 2003 ||  Jason Kennedy || Central Midfielder || 7"]}, {"page": "2007–08 Middlesbrough F.C. season", "response": ["Out of contract Jason Kennedy left to join Darlington, where he had ended the season on loan.", "|30 May 2008|| Jason Kennedy||Darlington||Out of contract||", "|3 August 2007|| Jason Kennedy||Livingston||To 1 January 2008||", "|29 February 2008|| Jason Kennedy||Darlington||To end of season||"]}, {"page": "2008 Football League Two play-off Final", "response": ["Rochdale faced Darlington in their play-off semi-final, with the first leg being held away at Balfour Webnet Arena on 10 May 2008. Jason Kennedy opened the scoring for the home side with a lob in the 28th minute before Chris Dagnall equalised for Rochdale on 70 minutes when his shot was deflected into the net by a Darlington defender, wrong-footing the goalkeeper David Stockdale. Ian Miller won the game 2–1 for Darlington in the first minute of stoppage time with a header.  The return leg was held at Spotland seven days later. Darlington opened the scoring with in the 28th minute after Rene Howe impeded Kennedy in the penalty area, and Clark Keltie scored from the penalty spot. Rochdale drew level on 43 minutes through Chris Dagnall and then took the lead after a deflected strike from David Perkins found the net on 78 minutes.  With the score at 2–1 after regular time, the aggregate scoreline was 3–3 and the match went into extra time, during which Perkins was sent off for dissent.  No goals were scored during the additional period, so the match had to be decided by a penalty shootout. Rochdale scored all five of their penalties while Darlington's Kennedy missed his and sent Rochdale to the play-off final. After the game Rochdale failed in an appeal against the red card given to Perkins and he was subsequently unavailable for selection for the final."]}, {"page": "List of Bradford City A.F.C. players (1–49 league appearances)", "response": ["|Jason Kennedy||||2013–2015||28||3||"]}, {"page": "Sam Morsy", "response": ["Following the departure of Anthony Griffith, Morsy stepped into the role of 'midfield enforcer' for the 2012–13 campaign. On 25 August, he opened the scoring after just 14 seconds in a 3–1 win over Morecambe at the Globe Arena, earning himself a place on the League Two team of the week. He stated that his aim for the season was \"to get more goals\", as he formed a \"formidable and unshakeable central midfield double act\" with Chris Shuker. However, after picking up a suspension in October for receiving five yellow cards, he admitted that \"I definitely have to cut down on yellow cards in future\". However a \"stupid\" high two-footed tackle on Rochdale's Jason Kennedy resulted in a straight red for Morsy on 6 November, and was the turning point that left a 2–0 lead for the Vale becoming a 2–2 draw, meaning two points were dropped at home. An angry Micky Adams fined him two weeks' wages (the maximum fine possible) in punishment, and called him a \"coward... [who] went to hurt their lad [Kennedy]\". Morsy issued an official apology, but insisted that \"there was no malice in the challenge\". Adams kept him out of the first-team picture for six weeks after the incident, and Morsy stated that \"I missed some important matches and that makes you re-evaluate your game.\" He was more of a bit-part player in the second half of the campaign, as Vale secured promotion with a third-place finish. He rejected the offer of a new two-year contract, and left the club."]}, {"page": "List of Rochdale A.F.C. players", "response": ["|align=left|Jason Kennedy"]}, {"page": "Andrew Tutte", "response": ["A number of clubs interested signing Tutte availability, with a host of League One and League Two sides expressing an interest in landing the player on loan. However, Rochdale won the race to sign him on loan until January. He made his Rochdale debut on 21 August 2010 as a substitute for Joe Thompson in a League One game against Colchester United. On 28 August 2010 in a match against Brentford which Rochdale won 3–1, Tutte provided a double assist in a match for Anthony Elding and Jason Kennedy respectively. Tutte made his last appearance for the club as a substitute for Jason Kennedy in a 1–0 loss against Exeter City. After being recalled by his parents club, Tutte made 9 appearance for them.", "On 6 August 2011, Tutte made his re-debut for the club in a 2–0 loss against Sheffield Wednesday before coming off for Chris O'Grady which was last appearance before joining them. On 10 September 2011, Tutte provided assist for Ashley Grimes to score an opener in a 4–2 win over Bury. On 6 March 2012, Tutte provided assist for Jason Kennedy again to score the only goal for the club in a match against Carlisle which they lost 2–1. The next game on 10 March 2012, Tutte scored his first goal for Rochdale with a maiden strike in a 2–2 draw against Huddersfield Town. His goal was later a Goal of the season at Rochdale's end-of-season awards on Sunday night on 29 April 2012. Eventually, Tutte couldn't save Rochdale and was relegated after losing 2–1 against Chesterfield. After the 2011–12 season, The club revealed Tutte would remain as Rochdale player under contract for the next season. On 4 June 2013 Tutte further extended his Rochdale career when he signed a two-year contract."]}, {"page": "Jason Kennedy", "response": ["Jason Kennedy may refer to:", "*Jason Kennedy (footballer) (born 1986), British football player", "*Jason Kennedy (TV personality) (born 1981), American television personality, correspondent and co-anchor in E! News"]}, {"page": "Jason Kennedy (football player)", "response": ["#REDIRECT Jason Kennedy (footballer)"]}, {"page": "Jason (given name)", "response": ["*Jason Kennedy (footballer) (born 1986), English association football player", "*Jason Kennedy (TV personality) (born 1981), American television personality"]}, {"page": "2011–12 Rochdale A.F.C. season", "response": ["|= ||MF || ||7 ||Jason Kennedy || 1 || 0 || 0 || 0 || 1"]}, {"page": "2012–13 Football League Two", "response": ["|align=\"left\"|Jason Kennedy"]}, {"page": "2013–14 Bradford City A.F.C. season", "response": ["Parkinson took up one-year options on Jon McLaughlin, Gary Jones, Kyel Reid and Garry Thompson to keep them at the club for another season, while Andrew Davies signed a new two-year contract to stay with the Bantams. However, Steve Williams and Dean Overson were released after being deemed surplus to the club's requirements. Goalkeeper Matt Duke also left the Bantams to join League Two side Northampton Town, Duke stated that he loved his time at Bradford but at 36 years of age he is looking for more 1st team football. Parkinson announced that he had released winger Zavon Hines stating that the winger needed first team football and Bradford could not promise him that. The first signing of the season came as the Bantams announced that they had signed Rochdale midfielder Jason Kennedy on a 2 Year Deal. On the same day, young defender Carl McHugh also signed a 1 Year Extension to his contract after an impressive 2012–13 campaign. Another important player for the Bantams, Nathan Doyle, also signed a 1 Year Extension after impressing the coach and becoming a key figure in the Bradford side.", "The next part of the Bantams pre-season was a tour of Ireland. They started this tour with a 4–1 win against Athlone Town. The Irish opened the scoring as Bradford defender James Meredith scored an own goal in the 23rd minute, however this was short lived as last season's top scorer Nahki Wells drove a shot into the bottom corner to equalize. The Bantams took the lead 8 minutes later as Mark Yeates blasted a drive into the other bottom corner, this soon became a 3–1 lead to Bradford when Raffaele De Vita's cross was bundled into the net by Rory McArdle. Alan Connell rounded off the scoring by slotting home a shot to make it 4–1. The second game on the Irish tour saw the Bantams face Bohemians, City once again went behind however this time it wasn't an own goal but rather an opposition player heading the ball in. This 1–0 lead was soon rubbed out by an equalizer to Garry Thompson who headed home a Jason Kennedy cross. Just after halftime the Bradford side dominated and this dominance paid off as Michael Nelson scored to make it 2–1. Youngster Louis Swain also added a goal before the game was wrapped up by a goal from Nahki Wells to ensure the Bantams won 4–1.", "|align=\"left\"|8||align=\"left\"|MF||align=\"left\"| Jason Kennedy", "| Jason Kennedy", "| Jason Kennedy"]}]}}