{"wiki_id": "http://www.wikidata.org/entity/Q10336824", "itemLabel": "Nigel Cawthorne", "itemDescription": "British writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Nigel_Cawthorne", "wikipedia_page": {"main": "Nigel Cawthorne (born 27 March 1951 in Wolverhampton) is a British freelance writer of fiction and non-fiction, and an editor. \nAccording to Cawthorne's website, he has written more than 150 books on a wide range of subjects. He also contributed to The Guardian, the Daily Mirror, the Daily Mail, and the New-York Tribune. He has appeared on television and BBC Radio 4's Today programme.", "link_mentions": [{"page": "Ike Turner", "response": ["Speaking on \"Rocket 88\" being a contender for the first rock 'n' roll record, broadcaster Paul Gambaccini said:In musical terms [he was] very important. \"Rocket 88\" is one of the two records that can claim to be the first rock 'n' roll record, the other being \"The Fat Man\" by Fats Domino from 1949. But \"Rocket 88\" does have a couple of elements which \"The Fat Man\" did not. The wailing saxophone and that distorted electric guitar. It was number one in the rhythm and blues chart for five weeks, it is in the Grammy Hall of Fame and it was an indisputable claim to fame for Ike Turner....To critics he will be known as a great founder, unfortunately to the general public he will always be known as a brutal man.Nigel Cawthorne—co-author of Turner's autobiography—said:Although there had been black rock 'n' rollers who had made it big already, they really only played to a white audience. Ike and Tina played to a mixed audience and he deliberately desegregated audiences in the southern states and he wouldn't play to any segregated audiences at all. Because he had such a big band and entourage he desegregated a lot of the hotels because the hotel chains wouldn't want to miss out on the money they would make from him touring the southern states.Turner's songs have been sampled by hip hop artists, most notably Salt-n-Pepa used \"I'm Blue\" for their 1994 hit \"Shoop\". Jurassic 5 used \"Getting Nasty\" from A Black Man's Soul on the track \"Concrete Schoolyard\" in 1997, Main Source also sampled \"Getting Nasty\" on the track \"Snake Eyes\" as well as Ike & Tina Turner's \"Bold Soul Sister\" on \"Just Hanging Out\"; both featured on their 1991 album  Breaking Atoms. The track \"Funky Mule\", also from A Black Man's Soul, has been sampled extensively by jungle DJs, with the drum introduction being a very popular break. It was sampled by producer Goldie for his 1994 hit \"Inner City Life\", in the same year by Krome & Time on \"The License\", and by Paradox in 2002 on track \"Funky Mule\".", "In 1999, Turner published his autobiography Takin' Back My Name: The Confessions of Ike Turner. It was written with Nigel Cawthorne and Little Richard wrote the introduction. In 2003, John Collis published Ike Turner: King of Rhythm about the life and musical contributions of Turner."]}, {"page": "List of military writers", "response": ["* Nigel Cawthorne – POW histories: The Bamboo Cage, The Iron Cage"]}, {"page": "Bertie Wooster", "response": ["Bertie is approximately 24 years old when he first meets Jeeves in \"Jeeves Takes Charge\".Wodehouse (2008) [1925], Carry On, Jeeves, chapter 1. Bertie recounts a story in which he was fifteen years old, and later mentions that this story occurred nine years before, meaning that he is approximately 24 years old in \"Jeeves Takes Charge\". His age is not stated in any other story. In the reference work Wodehouse in Woostershire by Wodehouse scholars Geoffrey Jaggard and Tony Ring, it is speculated that Bertie's age ranges from approximately 24 to 29 over the course of the stories.Ring & Jaggard (1999), pp. 124–126. Nigel Cawthorne, author of A Brief Guide to Jeeves and Wooster, also suggested that Bertie is approximately 29 at the end of the saga.Cawthorne (2013), p. 160."]}, {"page": "Eliza Lynch", "response": ["* A more fictional leaning anti-Lynch work,  The Empress of South America by Nigel Cawthorne. ", "See also The Shadows of Eliza Lynch by Sian Rees (Headline Review (6 January 2003)) and The Empress of South America by Nigel Cawthorne (William Heinemann, London 2003).", "* Nigel Cawthorne: The Empress of South America, London : Heinemann [u.a.], 2003, "]}, {"page": "José Gaspar Rodríguez de Francia", "response": ["Paraguayans often referred to him simply as \"Dr. Francia\" or Karaí Guazú (\"great lord\" in Guaraní). A few Indians believed that he had supernatural powers: when some saw him measuring the stars with his theodolite, they thought he was talking to night demons.Nigel Cawthorne, Empress of South America, p. 29,  Francia would later use it to straighten the streets of Asunción.", "Francia outlawed all opposition and established a secret police force. His underground prison was known as the \"chamber of truth\", and most of Paraguay's manufactures were made with prison labor. He abolished flogging, but his implementation of the death penalty was brutal, as he insisted all executions be carried out at a banquillo (\"stool\") under an orange tree outside his window. To avoid wasting bullets, most victims were bayoneted, and their families were not allowed to collect the corpses until they had been lying there all day to make sure that they were dead.Nigel Cawthorne, Empress of South America, p. 33", "Contrary to popular belief, Paraguay was not completely isolated. Francia welcomed political refugees from various countries. José Artigas, the hero of Uruguay's independence, was given asylum in 1820, along with 200 of his men. Artigas stayed in Paraguay even after Francia's death on a pension of $30 a monthNigel Cawthorne, Empress of South America, p. 34 and was pursued by Francisco Ramírez, who saw one of his warships also desert to Paraguay. In 1820, Francia ordered for runaway slaves to be given refuge and for refugees from Corrientes to be given canoes and land. In 1839, a whole company of Brazilian deserters was welcomed.  Many ex-slaves were also sent to guard the penal colony of Tevego.Luis Veron, Pequeña Enciclopedia de Historias Minúsculas del Paraguay"]}]}}