{"wiki_id": "http://www.wikidata.org/entity/Q10399230", "itemLabel": "Kevin Donovan", "itemDescription": "Footballer (born 1971)", "wikipedia_url": "https://en.wikipedia.org/wiki/Kevin_Donovan", "wikipedia_page": {"main": "Kevin Donovan (born 17 December 1971) is an English football coach, former professional footballer and sports co-commentator. He currently runs his own soccer academy that is linked to Brighouse Town.\nAs a player, he was a midfielder from 1988 to 2007 with lengthy spells at West Bromwich Albion and Grimsby Town which saw him win two play-off finals at Wembley Stadium. He also played in the Football League for Huddersfield Town, Halifax Town, Barnsley and Rochdale before finishing his career off in non-League football with York City and Alfreton Town.", "link_mentions": [{"page": "Grimsby Town F.C.", "response": ["The 1997–98 season saw the return of Alan Buckley as manager, after an unsuccessful period at West Bromwich Albion, for Grimsby Town's most successful post-war season. In the summer of 1997, Buckley succeeded in bringing in players to the club who were to be instrumental in the club's upcoming season; former skipper Paul Groves was re-signed from West Bromwich Albion, and Kevin Donovan and David Smith also joined the club from Albion. The mid-season capture of Huddersfield Town midfielder Wayne Burnett proved to be a great bit of business for Buckley. After a seemingly poor start to the League campaign, performances improved, which propelled the club into a promotion battle with Watford, Bristol City and an expensively assembled Fulham (at the time the only club at this level to have spent seven-figure sums on players), with Grimsby finishing the season in 3rd place.", "A good run in the League Cup saw the Mariners knock holders Leicester City and fellow Premier League side Sheffield Wednesday out of the competition before finally losing out to Liverpool. A decent run of form had ignited the careers of such younger players as Daryl Clare, Danny Butterfield and Jack Lester who were becoming an integral part of the Blundell Park set-up. The Mariners went on to dump Burnley out of the Football League Trophy Northern section area final, which would see the club book its first trip to Wembley Stadium. The club were drawn against Southern section champions AFC Bournemouth and in a tight game, an equaliser from substitute Kingsley Black took the game into extra time, and in the 112th minute Grimsby secured the game courtesy of a golden goal from Wayne Burnett. This was the first major trophy awarded to the club following its first appearance at Wembley. It took only four weeks for Grimsby to return to the stadium though, this time to face Northampton Town in the Division Two play-off Final. Town won the game 1–0 thanks to a first half Kevin Donovan goal which gave the club a historic Wembley double and the Mariners promotion back to Division One.", "|1998|| Kevin Donovan || Daryl Clare", "|  Kevin Donovan || 16 || 1997–98", "* 1998  Kevin Donovan"]}, {"page": "Mike Phelan", "response": ["With the introduction of Premier League squad numbers for the 1993–94 season, he was issued with the number 23 shirt which was next worn by Phil Neville. Phelan was given a free transfer at the end of the 1993-94 season. After leaving Old Trafford, Phelan signed for West Bromwich Albion, where he spent 18 months and played just 21 games, his first-team chances limited by younger players such as Kevin Donovan and Lee Ashcroft, who were more favoured by new manager Alan Buckley (appointed in the autumn following the dismissal of Keith Burkinshaw, who brought Phelan to the club)."]}, {"page": "Paul Groves (footballer)", "response": ["His next port of call was to join West Bromwich Albion for £600,000 in 1996 where he was signed once again by Alan Buckley. After one season with Albion, Buckley had moved back to Grimsby taking Groves with him for £250,000 as well as Kevin Donovan amongst others. Groves would be part of a selection of players who transferred between West Brom and Grimsby in the late to mid nineties through the Alan Buckley connection. Whilst with the club he played 33 times in all competitions scoring four goals.", "Groves signed a one-year contract with York City, who had recently been relegated to the Conference National, in June 2004 along with former Grimsby teammate Kevin Donovan. After one season with York, Groves left the club."]}, {"page": "Darren Wrack", "response": ["Wrack returned home to Cleethorpes and signed with his home town club Grimsby Town in July 1996 for a fee of £100,000. He was handed his \"Mariners\" debut by player-manager Brian Laws on 17 August 1996 when he came on as a 78th-minute replacement for Neil Woods in Town's 3–1 home defeat to Wolverhampton Wanderers. Grimsby were relegated from the First Division at the end of the 1996–97 season with Wrack featuring 11 times, scoring once in a 1–1 away draw with Reading. During the same season Wrack also spent a month on loan at Shrewsbury Town, featuring in five games for Fred Davies's \"Shrews\". During the 1997–98 season, with the club now under the tenure of Alan Buckley, Wrack failed to make an impact in the first team with the likes of Kevin Donovan, Tommy Widdrington and Paul Groves favoured over Wrack. Wrack would only feature twice for Grimsby under Buckley this season, a Football League Trophy victory over Hull City and a league defeat to Northampton Town. Grimsby earned promotion back to the First Division via the play-offs as well as winning the Football League Trophy in a Wembley double, however Wrack did not feature in either occasion. Speaking in 2006, Wrack stated that he felt he was \"never given the chance to shine\" at Blundell Park."]}, {"page": "List of Grimsby Town F.C. seasons", "response": ["|bgcolor=\"#D0F0C0\"| Kevin Donovan"]}, {"page": "List of Grimsby Town F.C. players", "response": ["|align=\"left\"|Kevin Donovan||||MF||1997–2000||156||24"]}, {"page": "Paul Robinson (footballer, born November 1978)", "response": ["In June 2004 he moved to York City,Robinson signs for York and became part of a veteran City squad that boasted the likes of Kevin Donovan, and also Paul Groves who had signed him for Grimsby, when he was player-manager at Blundell Park, after the completion of the 2004–05 season, Robinson was released by York."]}, {"page": "List of comedy films of the 2000s", "response": ["|The Tuxedo||Kevin Donovan||Jackie Chan, Jennifer Love Hewitt, Jason Isaacs ||United States||"]}, {"page": "Donovan (name)", "response": ["*Kevin Donovan (born 1971), English football player"]}, {"page": "David Smith (footballer, born 1968)", "response": ["On 19 August 2000, he scored an equaliser in the 84th minute in the 1–1 draw against Portsmouth, Smith was unmarked and sent a left-foot volley past goalkeeper Russell Hoult after a Kevin Donovan cross from the right."]}, {"page": "Stacy Coldicott", "response": ["Coldicott and Lee Ashcroft were the only additions to a squad newly promoted to Division One. Grimsby started well in Coldicott's first season with the club, but poor results in the later part of the season meant they finished in 11th position. He played regularly for the first team, combining well with players such as Paul Groves, Alan Pouton, Kevin Donovan and Wayne Burnett. Coldicott continued to feature despite changes of management, and played in three divisions for The Mariners, remaining with the club despite a broken leg which kept him out for nearly a year. After nearly 250 appearances in all competitions, Coldicott was released by manager Russell Slade in the summer of 2005 after choosing not to accept the offer of a short-term contract."]}]}}