{"wiki_id": "http://www.wikidata.org/entity/Q1040807", "itemLabel": "Lady Sarah Chatto", "itemDescription": "daughter of Princess Margaret, Countess of Snowdon; niece of Queen Elizabeth II", "wikipedia_url": "https://en.wikipedia.org/wiki/Lady_Sarah_Chatto", "wikipedia_page": {"main": "Lady Sarah Frances Elizabeth Chatto (née Armstrong-Jones; born 1 May 1964) is the only daughter of Princess Margaret and the only niece of Queen Elizabeth II. She is the youngest grandchild of King George VI and Queen Elizabeth. At her birth, she was seventh in line of succession to the British throne; as of December 2021, she is 28th.", "link_mentions": [{"page": "Queen Elizabeth The Queen Mother", "response": ["|| Lady Sarah Chatto || Samuel ChattoArthur Chatto"]}, {"page": "George VI", "response": ["| Princess Margaret || 21 August 1930 || 9 February 2002 || 6 May 1960Divorced 11 July 1978 || Antony Armstrong-Jones, 1st Earl of Snowdon || David Armstrong-Jones, 2nd Earl of SnowdonLady Sarah Chatto"]}, {"page": "Eton College", "response": ["* Samuel (1996) and Arthur Chatto (1999), sons of Lady Sarah Chatto, and Princess Margaret's grandsons."]}, {"page": "Sarah Armstrong-Jones", "response": ["#REDIRECT Lady Sarah Chatto"]}, {"page": "Daniel Chatto", "response": ["Daniel St George Chatto (born Daniel Chatto St George Sproule, 22 April 1957) is a British artist and former actor. He is the husband of Lady Sarah Chatto, the daughter of Princess Margaret, Countess of Snowdon, and niece of Queen Elizabeth II."]}, {"page": "Order of precedence in England and Wales", "response": ["| Lady Sarah Chatto", "| Lady Sarah Chatto"]}, {"page": "Order of precedence in Scotland", "response": ["#Nieces (by blood) of the Sovereign (Lady Sarah Chatto)"]}, {"page": "Lady Louise Windsor", "response": ["She was baptised in the Private Chapel of Windsor Castle on 24 April 2004 by David Conner, the Dean of Windsor; her godparents were Lady Sarah Chatto, Lord Ivar Mountbatten, Lady Alexandra Etherington, Francesca Schwarzenbach and Rupert Elliott. Louise was the last child to wear the original royal christening gown."]}, {"page": "Samuel Chatto", "response": ["#REDIRECT Lady Sarah Chatto#Marriage and issue"]}, {"page": "Arthur Chatto", "response": ["#REDIRECTLady Sarah Chatto#Marriage and issue"]}, {"page": "HMS Illustrious (R06)", "response": ["She was re-dedicated in 2005, and following the death of the ship's original sponsor Princess Margaret, her daughter Lady Sarah Chatto agreed to attend in a new role as \"ship's friend\"."]}, {"page": "Camberwell College of Arts", "response": ["* Lady Sarah Chatto (artist)"]}, {"page": "Succession to the British throne", "response": ["**** (28) Lady Sarah Chatto (née Armstrong-Jones; b. 1964) "]}, {"page": "Template talk:British Royal Family", "response": ["*The Lady Sarah ChattoMr. Daniel Chatto", "*The Lady Sarah ChattoMr. Daniel Chatto", "*The Lady Sarah ChattoMr. Daniel Chatto", "*The Lady Sarah ChattoMr. Daniel Chatto", "*The Lady Sarah ChattoMr. Daniel Chatto", ":::::Anyway I think it's right to have the name of Sarah on the Template because she is a British princess by marriage, and as you know, Diana, Princess of Wales remained a member of the Royal Family after her divorce and I think Sarah is also included. But Phillipses are not Prince and Princesses because they are the children and Grandchildren of the daughter of The Queen and of course Viscount Linly and Lady Sarah Chatto aren't Prince and Princess because they got their surname from their father and they belong to their father family. Keivan.fTalk 14:32, 24 May 2012 (UTC)"]}, {"page": "David Fane, 15th Earl of Westmorland", "response": ["He was a godfather to Lady Sarah Chatto, daughter of Princess Margaret and Antony Armstrong-Jones, 1st Earl of Snowdon."]}, {"page": "Jasper Conran", "response": ["Conran's first collection was for Henri Bendel in New York City. In 1978, aged 19, Conran designed his first womenswear collection under his own name. The following year he was elected to be part of the London Designer collections. Conran designed his first menswear collection in 1985. Conran designed the wedding dress of Princess Margaret's daughter, Lady Sarah Chatto (formerly Lady Sarah Armstrong-Jones) in 1994. He also designed clothes for Diana, Princess of Wales."]}, {"page": "Marianela Núñez", "response": ["In 2018, following a performance of Giselle, Núñez celebrated her 20th anniversary at the Royal Ballet. Artistic director Kevin O'Hare declared her \"one of the greats of her generation\". Present were Lady Sarah Chatto, Peter Wright, Monica Mason, and The Argentine ambassador to the UK Renato Carlos Sersale di Cerisano."]}, {"page": "International Best Dressed Hall of Fame List", "response": ["|Lady Sarah Chatto"]}, {"page": "1999 in the United Kingdom", "response": ["* 5 February – Arthur Chatto, son of Lady Sarah Chatto and Daniel Chatto"]}, {"page": "1996 in the United Kingdom", "response": ["** Samuel Chatto, son of Lady Sarah Chatto and Daniel Chatto"]}, {"page": "1964 in the United Kingdom", "response": ["* 1 May – Lady Sarah Chatto, daughter of Antony Armstrong-Jones and Princess Margaret"]}, {"page": "Portland Hospital", "response": ["* Samuel Chatto (born 1996)  first son of Lady Sarah Chatto and Daniel Chatto", "* Arthur Chatto (born 1999) second son of Lady Sarah Chatto and Daniel Chatto"]}]}}