{"wiki_id": "http://www.wikidata.org/entity/Q10462485", "itemLabel": "Jamie Reeves", "itemDescription": "English footballer (born 1953)", "wikipedia_url": "https://en.wikipedia.org/wiki/Jamie_Reeves_(footballer)", "wikipedia_page": {"main": "Jamie Reeves (born 5 March 1953) is a regular football pundit on ESPN STAR Sports coverage of the English Premier League. He was formerly a semi-professional football player in England's Southern League, Isthmian League and Essex Senior League, and won the FA Vase twice (in 1979 and 1984). He then moved to Singapore where he played in the FAS Premier League, before becoming a television pundit.", "link_mentions": [{"page": "Index of Singapore-related articles", "response": ["* Jamie Reeves (footballer)"]}, {"page": "Jamie Reeves", "response": ["Jamie Reeves (born 3 May 1962)David Webster, Sons of Samson Volume 2 Profiles, page 103 (Ironmind Enterprises),  is a British former coal miner, strongman and professional wrestler. As a strongman, he won the 1989 World's Strongest Man, was World Muscle Power champion, and also had numerous other titles including Europe's Strongest Man and Britain's Strongest Man. Following retirement from competitive sport he continued to be involved in strength athletics as a referee, event promoter and coach."]}, {"page": "Westcliff High School for Boys", "response": ["* Jamie Reeves, two-time FA Vase winning semi-professional footballer and football pundit"]}, {"page": "List of University of Kent people", "response": ["*Jamie Reeves - (MA) - semi-professional footballer who won the FA Vase twice; pundit on the ESPN Star Sports coverage of the Premier League"]}, {"page": "Jamie reeves footballer", "response": ["#REDIRECT Jamie Reeves (footballer)"]}, {"page": "Jamie Reeves (Footballer)", "response": ["#REDIRECT Jamie Reeves (footballer) "]}, {"page": "James Reeves", "response": ["James, Jim, Jimmy or Jamie Reeves may refer to:", "*Jamie Reeves (footballer) (born 1953), football pundit and former footballer", "*Jamie Reeves (born 1962), former coal miner, strongman and professional wrestler"]}]}}