{"wiki_id": "http://www.wikidata.org/entity/Q10425983", "itemLabel": "John Bramhall", "itemDescription": "English footballer (born 1956)", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Bramhall_(footballer)", "wikipedia_page": {"main": "John Bramhall (born 20 November 1956) is an English former professional footballer who played as a defender. He made more than 500 Football League appearances for six clubs from 1976 to 1991 and is now assistant chief executive of the Professional Footballers' Association.\nBramhall joined Tranmere Rovers in July 1976 from Stockton Heath. He made 170 league appearances for Rovers before joining Fourth Division rivals, Bury, in March 1982. He was to be a regular member of the side, although he was allowed to join Chester City on loan in November 1985. He played four games for the Blues during their promotion season from Division Four and the following season joined Rochdale.\nAfter two years spent playing regularly in the Rochdale side, Bramhall moved again to Halifax Town and finished his league career with 32 league appearances for Scunthorpe United. This took his overall Football League appearance tally to 521, scoring 42 goals in the process.\nBramhall then played non-league football for Hyde United. He is now regularly quoted in the media through his role at the PFA. John lives in the leafy \nvillage of Grappenhall, Cheshire, with his wife and two sons.", "link_mentions": [{"page": "Professional Footballers' Association", "response": ["* John Bramhall"]}, {"page": "John Bramhall", "response": ["John Bramhall, DD\"Alumni Dublinenses : a register of the students, graduates, professors and provosts of Trinity College in the University of Dublin (1593–1860 George Dames Burtchaell/Thomas Ulick Sadleir p92: Dublin, Alex Thom and Co, 1935 (1594 – 25 June 1663) was an Archbishop of Armagh, and an Anglican theologian and apologist. He was a noted controversialist who doggedly defended the English Church from both Puritan and Roman Catholic accusations, as well as the materialism of Thomas Hobbes."]}, {"page": "List of Rochdale A.F.C. players", "response": ["|align=left|John Bramhall"]}, {"page": "Bramhall (disambiguation)", "response": ["* John Bramhall (1594-1633), Anglican bishop and philosopher; Archbishop of Armagh", "* John Bramhall (footballer) (born 1956), former English professional footballer"]}, {"page": "1985–86 Chester City F.C. season", "response": ["||| style=\"text-align:left;\" | John Bramhall"]}]}}