{"wiki_id": "http://www.wikidata.org/entity/Q10423625", "itemLabel": "Paul Hardyman", "itemDescription": "English footballer and coach (born 1964)", "wikipedia_url": "https://en.wikipedia.org/wiki/Paul_Hardyman", "wikipedia_page": {"main": "Paul George Hardyman (born 11 May 1964 in Portsmouth) is an English former footballer and coach. He was a left-back for Portsmouth, Sunderland, Bristol Rovers, Barnet, Wycombe and Slough Town.\nHe is currently Academy manager and assistant coach at Orange County Soccer Club who have just won the United Soccer League (USL).", "link_mentions": [{"page": "Denis Smith (footballer, born 1947)", "response": ["He signed experienced midfielder Paul Bracewell for 1989–90, who partnered an increasingly effective Gabbiadini, and spent £130,000 on Portsmouth left-back Paul Hardyman. He introduced the exceptionally talented teenage winger Kieron Brady to the first team, but was unable to discipline the precocious teenager, and Brady never realised his full potential. Sunderland reached the play-offs, and faced rivals Newcastle United in the semi-final, securing passage into the final with a 2–0 victory at St James' Park. They lost 1–0 to Swindon Town in the play-off final at Wembley Stadium. However, Swindon were found guilty of financial irregularities and remained in the Second Division, whilst Sunderland took their place in the First Division."]}, {"page": "Alan McLoughlin", "response": ["In July 2011, he joined Portsmouth as Senior Academy Coach, working alongside other club favourites Andy Awford and Paul Hardyman.", "On 8 July 2013, McLoughlin was appointed Portsmouth's first-team coach.Portsmouth: Alan McLoughlin named as first-team coach; BBC Sport, 8 July 2013 Alongside manager Guy Whittingham, he assisted the side in their first season in League Two after relegation. Whittingham was sacked in November 2013 and replaced by Richie Barker, who lasted just three months. Andy Awford then took charge for the rest of the season as along with Hardyman and McLoughlin, Portsmouth were unbeaten in their final seven matches, keeping in the league and finishing 13th. Awford was appointed permanent manager and McLoughlin kept his role as first-team manager alongside new assistant Paul Hardyman in May 2014. He was released from his position as first-team coach at Portsmouth on 4 December 2014."]}, {"page": "1992 FA Cup Final", "response": ["|DF ||12|| Paul Hardyman || || "]}, {"page": "Kieron Brady", "response": ["Brady made his debut coming on as a substitute for Paul Hardyman in a 3–1 win against Plymouth Argyle at Roker Park on 18 November 1989. Brady's full debut came in a 2–2 draw with Port Vale F.C. at Roker Park on 30 December 1989."]}, {"page": "Waterlooville F.C.", "response": ["Notable former players include three who went on to play professional football in England, Paul Hardyman (transferred to Portsmouth in 1983), Guy Whittingham (to Portsmouth via Yeovil Town in 1989) and Paul Moody (to Southampton in 1991). Additionally, several players joined Ville after a professional career, including Vince Hilaire, Billy Gilbert, Joe Laidlaw and Gary Stanley. Calvin Hore holds the club record for player appearances, with nearly 800. He made his debut, aged 16, in September 1980, and aside from one season on the books of Portsmouth (1981–82), was a regular first team member until the club played its last match in May 1998. He was also club captain for most of the 1990s."]}, {"page": "Thomas Hauser (footballer)", "response": ["After Sunderland's relegation back to Division 2 Hauser started the season promisingly. Although not included in the squad for the opening league game, he did start the next five, the last of those five being a 1–1 draw with Blackburn Rovers at Roker Park which would prove to be Hauser's last league start for Sunderland. His final start, and indeed goal for Sunderland came in the League Cup in a 2–1 defeat at home to Huddersfield Town in front of only 8,161. Hauser's final appearance for Sunderland came on Boxing Day 1991 replacing Paul Hardyman in a 1–0 defeat to Tranmere Rovers at Prenton Park."]}, {"page": "1989–90 Sunderland A.F.C. season", "response": ["|Paul Hardyman"]}, {"page": "1990 Football League Second Division play-off Final", "response": ["Sunderland's opposition in their play-off semi-final were their Tyne–Wear derby rivals Newcastle United, with the first leg being played at Roker Park in Sunderland on 13 May 1990.  The game proved to be ill-tempered with a total of seven players were booked, including a red card being shown by the referee: Sunderland's Paul Hardyman was dismissed after a foul on the Newcastle goalkeeper John Burridge who saved Hardyman's second half injury-time penalty.  The match produced no shots on target and ended goalless.  The second leg was played at St James' Park in Newcastle three days later.  Eric Gates opened the scoring for the visitors when he converted a low cross from Gary Owers.  Marco Gabbiadini then doubled Sunderland's lead in the 86th minute which led to a pitch invasion from the home supporters: the referee halted play and withdrew the players to their dressing rooms for twenty minutes while police restored calm.  The final four minutes were played out without further addition to the score, and Sunderland qualified for the final, with a 2–0 aggregate victory."]}, {"page": "Hardyman, Paul", "response": ["#redirectPaul Hardyman"]}]}}