{"wiki_id": "http://www.wikidata.org/entity/Q1046040", "itemLabel": "James Redhouse", "itemDescription": "British lexicographer", "wikipedia_url": "https://en.wikipedia.org/wiki/James_Redhouse", "wikipedia_page": {"main": "Sir James William Redhouse  (30 December 1811 – 4 January 1892) authored the original and authoritative Ottoman - English dictionary. He was commissioned by the American Board of Commissioners for Foreign Missions for his dictionary. His work was later used as the basis for many Turkish - English dictionaries.", "link_mentions": [{"page": "Rumi", "response": ["* James Redhouse"]}, {"page": "List of lexicographers", "response": ["*James Redhouse (UK, 1811–1892) Turkish and English bilingual dictionary"]}, {"page": "Edward Granville Browne", "response": ["Browne was born in Stouts Hill, Uley, Gloucestershire, England, the son of civil engineer Benjamin Chapman Browne and his wife, Annie. He was educated at Trinity College, Glenalmond, Burnside's School in Berkshire, Eton College, and the Newcastle College of Physical Science. He then read natural sciences at Pembroke College, Cambridge. He also studied Arabic with Edward Henry Palmer and William Wright, Persian with Edward Byles Cowell, and Turkish with Sir James Redhouse, motivated by an interest in the Turkish people. After graduating in 1882 he travelled to Constantinople."]}, {"page": "Patrick Colquhoun (lawyer)", "response": ["From 1840 to 1844, Colquhoun was Plenipotentiary of the Hanse Towns at Constantinople, Persia and Greece, through his father's connections.William Schaw Lindsay  History of Merchant Shipping and Ancient Commerce 1874 by Sampson Low, Marston, Low & Searle, London In Constantinople he was close friends with James Redhouse. He encountered the author George Borrow on his travels and was not impressed.Elizabeth Robins Pennell Charles Godfrey Leland a Biography Part Two Kessinger Publishing, 2004 ,  He then returned to England and joined the Home Circuit. He was well respected in the literary world and became a Fellow of the Royal Society of Literature in 1845. Charles Leland wrote Who that knows London knoweth not Sir Patrick Colquhoun? I made his acquaintance in 1848, when, coming over from student-life in Paris.Charles Godfrey Leland The Gypsies. He was also a noted linguist. From 1857 to 1866, he was Aulic Counsellor to the King of Saxony and standing Counsel to the Saxon Legation. He was then member of the Supreme Court of Justice in Corfu from 1858 to 1861. In 1861, when he was Chief Justice of the Ionian Islands, he was knighted on 14 November. Colquhoun became Queen's Counsel in 1868 and a bencher of the Inner Temple in 1869.", "Colquhoun married Katherine de St Vitalis. Their daughter married Sir James Redhouse."]}, {"page": "Timeline of the name Palestine", "response": ["* 1856: James Redhouse, An English and Turkish dictionary: Regarded as the original and authoritative Ottoman-English dictionary, translates Holy Land as dari-filastin (House of Palestine)"]}, {"page": "J. W. Redhouse", "response": ["#REDIRECT James Redhouse"]}, {"page": "Redhouse (surname)", "response": ["*James Redhouse (1811–1892), British lexicographer"]}, {"page": "Diary of H.M. the Shah of Persia during his tour through Europe in A.D. 1873", "response": ["The Diary of H.M. the Shah of Persia during his tour through Europe in A.D. 1873 has been written by Naser al-Din Shah (1831-1896) while on his tour through the European continent in 1873, during the zenith of European imperialism. The book was translated into English by James Redhouse in 1874. It is the first of three diaries written by Naser al-Din Shah, who was King of Persia from 1848 until 1896, corresponding to his three tours through Europe respectively in 1873, 1878 and 1889. In the 1873 diary, Naser al-Din Shah relates his travel departing from Tehran and he describes his travel through the countries of Russia, Prussia, Germany, Belgium, England, France, Switzerland, Italy, Austria, Turkey and Georgia. The book has been criticized for its long and very detailed descriptions.", "The Diary of H.M. the Shah of Persia during his tour through Europe in A.D. 1873 was published in Persia in 1874 under its original Farsi name Ruznamaj-i safari-i Farangistan. After the Persian publication of the diary, the Shah sent the book to the European kings and ambassadors. The British government directly decided to translate it into English by Sir James Redhouse, a renowned British linguist (in 1874). Abbreviated version of the English translations of the diary have also been published. Besides, the diary has been translated in German in 1874, and later, in 1998, in French.  The diary thus became well-known in Britain and abroad. However, the German translation proved to be a fake one, written by the German novelist Michael Klapp.", "In the translation preface of the English translation, Sir James Redhouse states that “On the whole, a more interesting book of the kind can hardly be imagined”. The diary is indeed a significant publication, relating the travel of the first Persian monarch who ever traveled to Europe. Besides, at that time, it was relatively uncommon that a king directly addressed his subjects in a personal account of his travel and that he described how he had been received by foreign monarchs. The fact that the diary has been communicated verbatim before the European countries which had lately received the Shah, was also rather unusual. Accordingly, the Diary of H.M the Shah of Persia is a substantial and compelling piece of work.", "The translation of the book by James Redhouse is based on a highly censored version of the diary of the Shah. Less censored versions have been published in the 1990s in Persia. However, these versions have not been translated into English or any European language. These uncensored versions contain many passages that are not part of the book published by the Qajar court in 1874, such as very personal or critical comments about European royalty, descriptions of women, sexual encounters, etc."]}, {"page": "Redhouse, James", "response": ["#redirectJames Redhouse"]}, {"page": "J.W. Redhouse", "response": ["#REDIRECT James Redhouse"]}, {"page": "James William Redhouse", "response": ["#REDIRECT James Redhouse"]}]}}