{"wiki_id": "http://www.wikidata.org/entity/Q10414000", "itemLabel": "Jordan Murch", "itemDescription": "Footballer (born 1989)", "wikipedia_url": "https://en.wikipedia.org/wiki/Jordan_Murch", "wikipedia_page": {"main": "Jordan Murch (born 15 September 1989) is a Scottish footballer who plays for Petershill in the SJFA West Region Premiership. He has previously played in the Scottish Football League First Division for Clyde.", "link_mentions": [{"page": "Clyde F.C.", "response": ["* Jordan Murch"]}, {"page": "DFW Tornados", "response": ["*  Jordan Murch"]}, {"page": "2007–08 Clyde F.C. season", "response": ["| Jordan Murch || Clyde Youth || Free"]}, {"page": "Stephen Connolly", "response": ["In December 2008, he joined Stenhousemuir on loan for a month. He made four appearances in total for the Warriors and returned to Clyde with the short-term loan deemed a success. He then joined Stranraer on loan until the end of the season in January 2009, along with Jordan Murch. However, the loan was terminated early and he returned to Clyde after only three appearances."]}, {"page": "2008–09 Clyde F.C. season", "response": ["| Jordan Murch || Stranraer || Loan || 24 January 2009", "*May: The club ensure that they will be playing First Division football again after a 3–0 aggregate victory over Airdrie United in the playoff final.Clyde 3–0 Airdrie United Clyde FC Website – Retrieved 29 May 2008 Preparations are made for the forthcoming season, with Steven Masterton joining Greenock Morton,Morton capture Clyde's Masterton BBC Sport – Retrieved 29 May 2008 Gary Arbuckle, Shaun Fagan and Sean McKenna being released whilst Queen's Park captain Stuart Kettlewell becomes the first summer signing.Kettlewell agrees to Clyde move BBC Sport – Retrieved 29 May 2008 Keeper Peter Cherrie and winger Dave McKay sign new deals,McKay and Cherrie sign on Clyde FC Website – Retrieved 29 May 2008 and youngsters Jordan Murch and Stephen Connolly sign their first professional contracts.Two youngsters step up Clyde FC Website – Retrieved 29 May 2008 Marc McCusker, who was on loan to the club last season, signs a two-year contract following his release from Hearts, whilst Jörg Albertz retires.McCusker joins up Clyde FC Website – Retrieved 1 June 2008 Jörg Albertz retires.", "|MF ||style=\"text-align:left\"|  Jordan Murch || 0 (1) || 0 || 0 || 0", "|MF ||style=\"text-align:left\"|  Jordan Murch || 0 (1) || 0 || 0 || 0"]}, {"page": "Murch", "response": ["*Jordan Murch (born 1989), Scottish football player"]}]}}