{"wiki_id": "http://www.wikidata.org/entity/Q10439391", "itemLabel": "Steve Croudson", "itemDescription": "Footballer (born 1980)", "wikipedia_url": "https://en.wikipedia.org/wiki/Steve_Croudson", "wikipedia_page": {"main": "Steven David Croudson (born 24 November 1980) is an English former professional footballer and goalkeeping coach of League One side Lincoln City.\nHe played as a goalkeeper initially from 1998 to 2007, but later came out of retirement between 2010 and 2013. He initially played for his home town club Grimsby Town between 1998 and 2003. He retired from injury at the age of 26 and returned to Grimsby to serve as the club's Goalkeeping Coach. On 30 August 2010 he registered as a player again for Grimsby due to the injuries of the club's first and second choice keepers.During his playing career he also played with Scunthorpe United, Boston United, Stevenage Borough, Halifax Town, Kettering Town, Bangor City, Rhyl and Cammell Laird.\n\n", "link_mentions": [{"page": "Lincoln City F.C.", "response": ["|Steve Croudson"]}, {"page": "Aidan Davison", "response": ["In the summer of 1997 Davison joined Grimsby Town on a free transfer. The club had recently slipped into the Football League Second Division and manager Alan Buckley had sought after a new number 1 keeper following the departure of Paul Crichton a year before, his replacement Jason Pearcey had failed to live up to expectations and would start the 1997–98 season as Davison's understudy. He made his Town debut on 9 August 1997 in a 1–1 draw with Bristol City. His period at Blundell Park would see him play a part in one of the most successful seasons with Grimsby defeating AFC Bournemouth in the Football League Trophy final at Wembley Stadium and a few weeks later defeating Northampton Town in the Play-Off final also at Wembley. During the 1998–99 season, Steve Croudson became his new understudy as Grimsby cemented themselves 11th spot in the First Division. During his two-year stay he helped the club set a new clean sheet record of 50 in 100 games."]}, {"page": "Jason Batty", "response": ["Batty was born in Auckland, New Zealand. He started his career at Norwich City F.C. in their Academy system, he then moved back in New Zealand for a period of time before heading back overseas to join up with Bohemian F.C. in the League of Ireland. He then made 14 appearances for a Singapore team S-League before joining the Football Kingz. Batty made 16 appearances for the Football Kingz in their inaugural season in the NSL in 1999 before heading back to the UK for a spell in England with Championship side Grimsby Town in August 2000. He failed to dislodge regular shot stopper Danny Coyne and understudy Steve Croudson. After only six months he left the club and joined Scunthorpe United on similar terms but left at the end of the season after failing to make a 1st Team appearance. He then briefly played for Stalybridge Celtic in the Conference League."]}, {"page": "Danny Coyne", "response": ["In 1999, he left for Grimsby Town managed by Alan Buckley where he was a replacement for Town's number 1 Aidan Davison who had transferred to Sheffield United. Coyne soon became a fans' favourite for the club where he would remain for four seasons. During his time at Blundell Park he was a regular in the first team whilst having rookie Steve Croudson as his under study for the entire four-year stay. During the 2001–2002 season Coyne was part of the Grimsby team that beat Premier League side Liverpool 2–1 at Anfield in the third round of the English League Cup. In both the 00-01 and 01-02 seasons Coyne's performances would go on to see him be crowned the Supporters Player of The Season, as well as this he became a regular fixture in the Welsh international side. In the 2002–2003 at Grimsby he was part of a Welsh International trio of himself, John Oster and Darren Barnard who were on the books at Town. It was during that season that Grimsby would find themselves being relegated from the First Division after a five-year stay, and this would see the end of Coyne's Grimsby career."]}, {"page": "Kenny Arthur", "response": ["Arthur signed a two-year deal with Grimsby Town on 8 June 2010 taking the number one spot from Nick Colgan. Grimsby who had suffered a goalkeeping crisis in both the past two seasons saw the new seasons preparations stall when Arthur injured his hamstring in the club's defeat against Rushden & Diamonds. Incidentally an injury to his understudy Colgan meant that goalkeeping coach Steve Croudson was called up to replace Arthur for at least one game before Sheffield Wednesday's Richard O'Donnell was signed. Arthur returned to action on 20 September, against Fleetwood Town only to injure his thumb in the warm up, meaning O'Donnell was forced to fill in once again."]}, {"page": "Jonathan Rowan", "response": ["Rowan joined Conference North side Kettering Town along with fellow former Grimsby teammate Steve Croudson. After playing in only a handful of games for the club who were briefly managed by Paul Gascoigne he moved on again."]}, {"page": "James McKeown", "response": ["On Friday 23 June 2011 Grimsby Town announced they were in discussions to sign McKeown, following the club's announcement to bring in a second choice keeper to challenge number one Kenny Arthur after Town had heavily relied upon Goalkeeping Coach Steve Croudson in the previous season. On 2 July 2011 he signed a one-year contract with Town. McKeown played in the final of the Lincolnshire Senior Cup on 3 August 2011, beating Lincoln City 4–3 to win the cup at Sincil Bank."]}, {"page": "2008–09 Grimsby Town F.C. season", "response": ["|Steve Croudson"]}, {"page": "2007–08 Grimsby Town F.C. season", "response": ["|Steve Croudson"]}, {"page": "Andy Love (English footballer)", "response": ["Love was born in Grimsby, Lincolnshire, and began his football career as a trainee at hometown club Grimsby Town in 1995. Initially third-choice goalkeeper behind Paul Crichton and Jason Pearcey, he made his debut in Grimsby's 2–1 league defeat against Birmingham City on 1 March 1997. Crichton left Grimsby for West Bromwich Albion in 1997, but Love dropped down the pecking order again on the arrival of Aidan Davison. He joined Southern League club Ilkeston Town on loan during the 1998–99 season, and on his return had a brief run in Grimsby's first team. Finding himself again third choice, this time behind newcomer Danny Coyne and youngster Steve Croudson, he returned to Ilkeston on loan."]}, {"page": "2009–10 Grimsby Town F.C. season", "response": ["|Steve Croudson"]}, {"page": "2003–04 Grimsby Town F.C. season", "response": ["|13 ||  Steve Croudson || Boston United || 21 || Released"]}, {"page": "Lincolnshire derby", "response": ["! scope=\"row\" style=\"text-align:left;\"| Steve Croudson"]}, {"page": "2002–03 Grimsby Town F.C. season", "response": ["|align=\"left\"|13||align=\"left\"|GK||align=\"left\"| Steve Croudson"]}, {"page": "Croudson, Steve", "response": ["#redirectSteve Croudson"]}]}}