{"wiki_id": "http://www.wikidata.org/entity/Q10479830", "itemLabel": "Ryan Austin", "itemDescription": "Footballer (born 1984)", "wikipedia_url": "https://en.wikipedia.org/wiki/Ryan_Austin_(footballer)", "wikipedia_page": {"main": "Ryan Austin (born 15 November 1984) in Stoke-on-Trent is a retired English professional footballer and manager.", "link_mentions": [{"page": "Richard Duffy", "response": ["On 21 August 2019, Duffy joined Northern Premier League Division One South East club Kidsgrove Athletic. Manager Ryan Austin said that \"he brings real quality to our squad as well as vast experience. We've been looking for a leader, and an organiser for a long time and, Rich fits that role perfectly\". The 2019–20 season was formally abandoned on 26 March, with all results from the season being expunged, due to the COVID-19 pandemic in England.", "In May 2020, Duffy was appointed as assistant manager to Ryan Austin at North West Counties League Premier Division side Congleton Town. He succeeded Austin as manager on 24 May 2021, who resigned for personal reasons. Duffy also registered as a player."]}, {"page": "Chris Birchall", "response": ["Having left Port Vale at the end of the 2015–16 season, Birchall had a trial at Northampton Town in July 2016, who were managed by former Vale boss Rob Page. Two months later he signed with Northern Premier League Division One South side Kidsgrove Athletic. He scored four goals before he left the club in January 2017 due to high wages at that level. Manager Ryan Austin said that \"I understand that and we have parted on good terms\"."]}, {"page": "Richard Jackson (footballer, born 1980)", "response": ["On 22 October 2009, Jackson was set to sign for Darlington as one of four new players brought in by manager Steve Staunton, but Jackson's own deal fell through. He dropped into non-league to play for his hometown club Whitby Town, before he was signed by League Two club Burton Albion on a one-month contract on 4 December 2009, managed by his former Derby and Luton teammate Paul Peschisolido as cover for injuries to Ryan Austin and Andrew Corbett. He made his debut one day later when he was named in the starting lineup in a 2–2 draw away to Rotherham United. He made two further appearances, before signing a new one-and-a-half-year contract until the end of 2010–11. However, Jackson only made two appearances during this time as a result of various injuries, and was released by Burton at the end of 2010–11."]}, {"page": "Anthony Griffith (footballer)", "response": ["In September 2018, Griffith began coaching the under-14s at the Port Vale Academy. He was also appointed as first-team coach at Congleton Town two months later. On 7 November 2019, he was appointed as Congleton Town's joint-manager, alongside Phil Hadland. The duo were replaced by Ryan Austin on 29 April 2020, with Griffith remaining as a player-coach. He was appointed as a professional development phase lead coach at Port Vale in October 2020. Interim manager Danny Pugh had to start self-isolation after testing positive for COVID-19 on 18 January 2021, leaving Griffith, Frank Sinclair and Billy Paynter to take over first-team duties in his absence."]}, {"page": "Austin (surname)", "response": ["* Ryan Austin (born 1981), Trinidadian cricketer", "* Ryan Austin (footballer) (born 1984), English footballer"]}, {"page": "2009–10 Burton Albion F.C. season", "response": ["| Ryan Austin"]}, {"page": "2010–11 Burton Albion F.C. season", "response": ["*11 September: Shaun Harrad strikes the first hat-trick of the season for the Brewers in a 3–3 draw against Rotherham United. The match also sees the return of Ryan Austin, having been sidelined since November 2009, and the professional debut of Kevin Grocott.", "| Ryan Austin", "|align=\"left\"|15||align=\"left\"|DF||align=\"left\"| Ryan Austin", "| Ryan Austin", "| First Team | Ryan Austin , Burton Albion F.C., 10 July 2010."]}, {"page": "Crewe Alexandra F.C. Academy", "response": ["* Ryan Austin"]}, {"page": "2011–12 Burton Albion F.C. season", "response": ["|15 || ||DF ||Ryan Austin || 4 || 1 || 0 || 1 || 0 || 0 || 0 || 0 || 4 || 2", "| Ryan Austin"]}, {"page": "List of people from Stoke-on-Trent", "response": ["*Ryan Austin (born 1984), played for Burton Albion."]}, {"page": "2012–13 Burton Albion F.C. season", "response": ["* 15 May: Albion release four more players; Adam Bolder, Ryan Austin, Tony James and Greg Pearson, whilst Nathan Stanton and Aaron Webster both sign one-year contract extensions.", "| 15 June 2012 || DF ||  Ryan Austin ||  Kidderminster Harriers || 5 July 2012 ||"]}]}}