{"wiki_id": "http://www.wikidata.org/entity/Q10490343", "itemLabel": "Alec Stewart", "itemDescription": "Scottish footballer (1868-?)", "wikipedia_url": "https://en.wikipedia.org/wiki/Alec_Stewart_(footballer,_born_1868)", "wikipedia_page": {"main": "Alexander Stewart (born 1868, deceased) was a Scottish professional association footballer who played as a wing half.", "link_mentions": [{"page": "1893 FA Cup Final", "response": ["| MF||  || Alec Stewart"]}, {"page": "East Lancashire derby", "response": ["Burnley recorded their first league victory over Rovers in December 1891, albeit in heavy snowy conditions and controversial circumstances. Burnley were 3–0 up at half-time at Turf Moor. After the interval, Lofthouse was sent off along with Burnley's Alec Stewart after a brief altercation, and the rest of the Rovers outfield players went with him. Only Blackburn's goalkeeper, Herbie Arthur, stayed on the pitch. Arthur appealed for offside as Burnley bore down on his goal. The referee quickly abandoned the game and the points were awarded to Burnley."]}, {"page": "Frank Forman", "response": ["By the end of his first full season with Forest he had established himself in the half-back line, generally playing on the right, alongside Scotsmen John McPherson and either Peter McCracken or Alec Stewart, as Forest finished the season in thirteenth place. By 1898, Stewart had been replaced by Willie Wragg as Forest reached the FA Cup Final for the first time, after a controversial semi-final."]}, {"page": "1893–94 Everton F.C. season", "response": ["The departure of Alec Stewart to newly promoted Darwen and injury to Fred Geary left Everton needing a new left half and centre forward during the summer of 1893. The two men signed were of the highest calibre in the shape of Billy Stewart who had thrice been a league runner-up with Preston and record £400 signing of Jack Southworth from cash strapped Blackburn. Despite two such high profile signings Everton's start to the season proved very inconsistent and was a bench mark for the rest of the season in which they would finish only sixth. The full back partnership of Kelso and Howarth was broken up after the first ten games and played together just three more times as six different combinations including Parry, Lindsay and Arridge were tried in a bid to bring stability in front of Richard William's goal. The half back line of Boyle, Holt and Stewart lasted just three games before John Walker was tried in place of Holt after the 3–7 defeat by Derby. Holt was quickly recalled while Kelso, having been moved out of the back line was tried regularly in place of Dickie Boyle at right half in the second half of the season. The expensive signing of Southworth came too late for the first two games of the season in which the forward line, still robbed of Geary started as Latta, Bell, Maxwell, Chadwick and Milward. Alan Maxwell was replaced at centre forward by Alf Milward for the second game with James McMillan coming into the reshuffled front rank before Southworth made the slot his own in the third game with John Bell deputising for three games and Fred Geary, now back from injury stepping in for three. Geary was restricted to just nine appearances all season in every position of the front rank while Maxwell was also unable to get into the side, moving to newly promoted Darwen where his goals were unable to stave off relegation.", "|Fred Geary, Alec Stewart {own goal}"]}, {"page": "1889–90 Burnley F.C. season", "response": ["|Alec Stewart"]}, {"page": "1890–91 Burnley F.C. season", "response": ["|Alec Stewart"]}, {"page": "1891–92 Burnley F.C. season", "response": ["|Alec Stewart"]}, {"page": "Charlie Parry", "response": ["Parry was re-engaged by Everton in December 1892, on wages of £2 per week and returned to the first team in January 1893, when he took over from Jimmy Jamieson at left back for the match at Sunderland. Parry played in various positions in ten matches over the next three months until losing his place at left half to Alec Stewart for the final match of the season, following a 3–0 defeat at Burnley. During this period, Everton reached the final of the FA Cup, but Parry was not selected for any of the cup matches."]}, {"page": "Alec Stewart (disambiguation)", "response": ["Alec Stewart (born 1955) is a retired English cricketer.", "Alec Stewart may also refer to:", "*Alec Stewart (Australian footballer) (1915–1976), Australian footballer for North Melbourne in the VFL", "*Alec Stewart (footballer, born 1868) (1868–?), Scottish association footballer", "*Alec Stewart (racehorse trainer) (1955–2004), Scottish racehorse trainer"]}, {"page": "Alex Stewart (footballer, born 1868)", "response": ["#REDIRECTAlec Stewart (footballer, born 1868)"]}]}}