{"wiki_id": "http://www.wikidata.org/entity/Q10419237", "itemLabel": "Leon Braithwaite", "itemDescription": "English footballer (born 1972)", "wikipedia_url": "https://en.wikipedia.org/wiki/Leon_Braithwaite", "wikipedia_page": {"main": "Leon Jerome Braithwaite (born 17 December 1972) is an English former footballer. He played for Exeter City, making a total of 66 Football League appearances. He made appearances for Margate, scoring 38 goals. He joined Margate from Welling United in 2000 and had two spells with the club, leaving for the second time in 2005. Braithwaite's spell at St. Patrick's Athletic in the League of Ireland was notable for a number of key goals, including a winning goal against title rivals Cork City in Turner's Cross. Leon won two league of Ireland championship medals with St Patricks Athletics and represented the club in the champions league qualifier where he was influential in the 0–0 draw at against Glasgow Celtic FC at Park head in front of a full house of 60000 supporters only to lose the return leg 0:2\nLeon got called up to the Trinidad and Tobago squad, yet did not make his debut due to injury", "link_mentions": [{"page": "Braithwaite (surname)", "response": ["*Leon Braithwaite (born 1972), English footballer"]}, {"page": "Darren Braithwaite", "response": ["Braithwaite now teaches physical education at Lammas School and Sports College in Leyton, and coaches the likes of Jordon Roberts London. His brother, Leon Braithwaite, is a former professional footballer, who played for Exeter City in the 1990s."]}, {"page": "List of Margate F.C. seasons", "response": ["|align=left|Leon Braithwaite", "|align=left|Leon Braithwaite"]}, {"page": "2001–02 Football Conference", "response": ["|= ||align=left| Leon Braithwaite ||align=left| Margate ||16|| || || ||0||"]}, {"page": "List of St Patrick's Athletic F.C. players", "response": ["*Leon Braithwaite"]}, {"page": "List of foreign League of Ireland players", "response": ["* Leon Braithwaite – St Patrick's Athletic"]}]}}