{"wiki_id": "http://www.wikidata.org/entity/Q10468949", "itemLabel": "Paul West", "itemDescription": "British footballer (born 1970)", "wikipedia_url": "https://en.wikipedia.org/wiki/Paul_West_(footballer)", "wikipedia_page": {"main": "Paul Darrell West (born 22 June 1970) is an English former footballer and manager. He had a four-year career in the Football League with Port Vale, Bradford City, and Wigan Athletic, before moving on to Evesham United via Morecambe. He spent nine years playing for Evesham, and was appointed as the club's manager in 2007, before stepping down in November 2011. He led the club to the Southern Football League Division One Midlands title in 2007–08, as well as two Worcestershire Senior Cup final victories. He returned to manage the club for the 2012–13 season.", "link_mentions": [{"page": "Paul West", "response": ["Paul West may refer to:", "*Paul West (writer) (1930–2015), British-born American writer", "*Paul West (footballer) (born 1970), English footballer", "*Paul West, pseudonym of Stephen Clarke", "*Paul West (chef), Australian chef and TV presenter known for River Cottage Australia"]}, {"page": "Paul Darrell West", "response": ["#REDIRECT Paul West (footballer)"]}, {"page": "1990–91 Port Vale F.C. season", "response": ["In February, Ronnie Jepson was sold to Preston North End for £80,000, having previously been loaned out to Peterborough United. Gary West also spent much of the season away from Vale Park, spending time on loan at Gillingham and Lincoln City (signing permanently for Lincoln at the end of the season for a £25,000 fee). All of the money raised from Jepson's sale went on bringing Dutchman Robin van der Laan to Burslem from Wageningen. Right-back Paul West also arrived for a £3,800 fee from non-league Alcester Town. In March, Gary Ford and £80,000 were traded to Mansfield Town in exchange for Kevin Kent. Also of note during this spell was a hat-trick for Beckford in a 3–0 win over Blackburn Rovers on 9 March, and a run of four goals in the final four games for Robbie Earle. Striker Brian Mills made his debut in a final day win over Swindon Town, and would later be picked for the England squad for the 1991 FIFA World Youth Championship.", "|align=\"left\"|DF||align=\"left\"| Paul West", "| January 1991 || DF ||  || Paul West || Alcester Town || £8,000 || "]}, {"page": "1991–92 Port Vale F.C. season", "response": ["They finished bottom of the table with 45 points, five points short of the safety of Oxford United. With 42 goals scored Vale had the lowest tally in the division, along with Plymouth, though their 59 goals conceded was a respectable total. Foyle was top-scorer with eleven league goals and sixteen in all competitions. At the end of the season young right-back Paul West was permitted to join Bradford City on a free transfer.", "|align=\"left\"|DF||align=\"left\"| Paul West", "| May 1992 || DF ||  || Paul West || Bradford City || £80,000 || "]}]}}