{"wiki_id": "http://www.wikidata.org/entity/Q10462621", "itemLabel": "Len Stephenson", "itemDescription": "Footballer (1930-2014)", "wikipedia_url": "https://en.wikipedia.org/wiki/Len_Stephenson", "wikipedia_page": {"main": "Robert Leonard Stephenson (14 July 1930 – 29 September 2014) was an English footballer. A centre-forward, he scored 26 goals in 93 league games in a seven-year career in the Football League for Blackpool, Port Vale, and Oldham Athletic.", "link_mentions": [{"page": "2014 in association football", "response": ["* 29 September: Len Stephenson, English footballer (born 1930)"]}, {"page": "Cyril Done", "response": ["Cyril transferred to Port Vale in December 1954, when manager Freddie Steele paid out a four-figure fee. He scored in five consecutive games, as the club struggled in front of goal; he bagged six of Vale's eight goals in a run of just one win in nine games. He then faced his former employers, Liverpool, and gave them a reason to think that they had let him go too soon, as he got all four goals in Vale's 4–3 Second Division home win. He was the club's top scorer in 1954–55 with 13 goals in 18 appearances. Done then found the net 12 times in 18 games in 1956–57, with teammate Len Stephenson only scoring two more goals in almost twice the number of games. He hit nine goals in 16 games in 1956–57 to become the club's top-scorer in a dismal season at Vale Park, which saw the \"Valiants\" relegated in last place. In May 1957 he was given a free transfer to non-league side Winsford United, and later became player-manager of Skelmersdale United."]}, {"page": "Freddie Steele (footballer)", "response": ["The 1954–55 campaign would prove to be a disappointment, as the \"Valiants\" finished 17th in the Second Division. The team lost their defensive edge as Steele opted for a more attacking 'semi-continental style'. He added to his fire-power by signing experienced forward Cyril Done and young striker Len Stephenson. He organised a more defensive line-up for the 1955–56 campaign, and spent a club-record £7,000 for Tottenham Hotspur playmaker Eddie Baily. He gave a young Harry Poole his debut as Vale fell out of the promotion race by the end of the season to post a respectable 12th-place finish."]}, {"page": "1952–53 Blackpool F.C. season", "response": ["| Len Stephenson"]}, {"page": "Norman Low", "response": ["He was made manager of Port Vale in February 1957. Replacing Freddie Steele, who developed the Steel/Iron curtain, Low adopted an attacking policy, instructing his players 'to go out an entertain the public' and 'he never discussed the opposition'. However Vale were already heading out of the Second Division, and went on to finish in last place in 1956–57. Low announced a new youth policy at Vale Park, and promptly released Cyril Done (Winsford United); Ray King (sold to Boston United for £2,500); Reg Potts and Stan Turner (Worcester City); Tommy Cheadle, Stan Smith, and Derek Mountford (Crewe Alexandra); Len Stephenson and Billy Spurdle (Oldham Athletic); and Harry Anders (Accrington Stanley)."]}, {"page": "List of Port Vale F.C. seasons", "response": ["|Len Stephenson"]}, {"page": "Robert Leonard Stephenson", "response": ["#REDIRECT Len Stephenson"]}, {"page": "Robert Stephenson (disambiguation)", "response": ["* Len Stephenson (Robert Leonard Stephenson, 1930–2014), English footballer"]}, {"page": "List of people from Blackpool", "response": ["*Len Stephenson (born 1930), footballer"]}, {"page": "1954–55 Port Vale F.C. season", "response": ["On 5 February, strugglers Derby County thrashed the Vale 6–1 at the Baseball Ground, though the Vale's poor away record failed to deter a strong contingent of Vale fans from following the club around the country dressed in fancy dress. The following month aggressive young forward Len Stephenson was signed from Blackpool, and he impressed with his performances. Three defeats left the Vale in a relegation dogfight, but seven points from the first five games in April proved very useful. On 8 April, Done put four past his former club Liverpool in a 4–3 win. Three days later he scored a penalty at Anfield to earn a 1–1 draw. On 25 April, more than 40,000 turned up to Vale Park to witness the \"Potters\" claim a 1–0 victory. Vale won their final two games, including a 1–0 win over Rotherham United that denied the \"Millers\" a place in the top-flight.", "|align=\"left\"|FW||align=\"left\"| Len Stephenson", "|–||FW||||Len Stephenson||1||0||1", "| 10 March 1955 || FW ||  || Len Stephenson || Blackpool || £5,000 || "]}, {"page": "1955–56 Port Vale F.C. season", "response": ["|align=\"left\"|FW||align=\"left\"| Len Stephenson", "|2||FW||||Len Stephenson||12||2||12"]}, {"page": "1956–57 Port Vale F.C. season", "response": ["On the financial side, 105,000 spectators had been lost from the previous season to an average of only 14,046, leaving an income from gate receipts of £40,717. Despite this a profit of £1,268 was recorded. This occurred because of a wage budget cut of around £8,000 to £20,684 and a transfer credit of £625. The club's debts were worrying however, causing the club's directors to funnel £2,500 of their own resources towards repaying this debt. A clear-out of players was initiated for the first time in a good while, those departing included: Cyril Done (Winsford United); Ray King (sold to Boston United for £2,500); Reg Potts and Stan Turner (Worcester City); Tommy Cheadle, Stan Smith, and Derek Mountford (Crewe Alexandra); Len Stephenson and Billy Spurdle (Oldham Athletic); and Harry Anders (Accrington Stanley). Though many of these were some of the club's best players, many had also reached retirement age. Low admitted that he would have to buy young players to fill the vacancies in the first team.", "|align=\"left\"|FW||align=\"left\"| Len Stephenson", "|–||FW||||Len Stephenson||3||1||4", "| June 1957 || FW ||  || Len Stephenson || Oldham Athletic || £1,025 || "]}, {"page": "2014 in the United Kingdom", "response": ["**Len Stephenson, 84, footballer."]}, {"page": "2014–15 in English football", "response": ["* 29 September 2014: Len Stephenson, 84, former Blackpool, Port Vale and Oldham Athletic forward.\"Former Port Vale and Blackpool striker Len Stephenson dies aged 84\"  - Stoke Sentinel, 29 September 2014"]}, {"page": "Deaths in September 2014", "response": ["*Len Stephenson, 84, English footballer.Former Port Vale and Blackpool striker Len Stephenson dies aged 84 "]}, {"page": "Leonard Stephenson", "response": ["#REDIRECT Len Stephenson"]}]}}