{"wiki_id": "http://www.wikidata.org/entity/Q10409337", "itemLabel": "Mike Hellawell", "itemDescription": "English footballer, cricketer (born 1938)", "wikipedia_url": "https://en.wikipedia.org/wiki/Mike_Hellawell", "wikipedia_page": {"main": "Michael Stephen Hellawell (born 30 June 1938) is a former professional footballer who made 322 appearances in the Football League and played twice for England.", "link_mentions": [{"page": "Keighley", "response": ["*Mike Hellawell (1938–), professional footballer who made two appearances for England and also played for Birmingham City, Queens Park Rangers and Sunderland"]}, {"page": "St Bede's Grammar School", "response": ["* Mike Hellawell, footballer, played two international games for England in 1962"]}, {"page": "1963 Football League Cup Final", "response": ["|7 ||  Mike Hellawell", "|7 ||  Mike Hellawell"]}, {"page": "Arthur Turner (footballer, born 1909)", "response": ["His record in the transfer market was sound. He brought in England under-23 international Dick Neal to replace Len Boyd, bought wingers Harry Hooper and future England player Mike Hellawell, and gave first professional contracts to youngsters Malcolm Beard and Colin Withers.Matthews, Complete Record, pp. 61–62."]}, {"page": "List of English cricket and football players", "response": ["| Mike Hellawell"]}, {"page": "1967–68 Huddersfield Town A.F.C. season", "response": ["|Mike Hellawell||||MF||14 (1)||0||1||0||6||0||21 (1)||0"]}, {"page": "1966–67 Huddersfield Town A.F.C. season", "response": ["|Mike Hellawell||||MF||31||1||1||0||0||0||32||1"]}, {"page": "List of Huddersfield Town A.F.C. players", "response": ["|Mike Hellawell||||1966–1968||45 (1)||1||2||0||6||0||0||0||0||0||53 (1)||1"]}, {"page": "1961 Inter-Cities Fairs Cup Final", "response": ["In the first leg of the final, played in front of a crowd of only 21,000 at St Andrew's, Pedro Manfredini scored twice for Roma, and goalkeeper Fabio Cudicini made several high-class saves, before Mike Hellawell and Bryan Orritt scored late in the game to equalise the scores. In the second leg, watched by 60,000 spectators, Roma won by two goals to nil – an own goal when an attempted clearance rebounded off Brian Farmer's shin, and a shot from distance by Paolo Pestrin very late in the game while Birmingham's players were all upfield attacking – in the Stadio Olimpico to win their first and, , only trophy in European competition.", "In Copenhagen, melted snow and rain left standing water on the pitch, and the kickoff had been moved to late afternoon so that the match against KB could be televised. This meant the attendance was very low, and the floodlighting was inadequate. Having twice taken a two-goal lead, Birmingham conceded two late goals and the game ended 4–4. Young goalkeeper Colin Withers had let in six goals in his first appearance as replacement for Johnny Schofield, who had fractured his skull, but made several saves to keep Birmingham from losing this match. The Daily Mirror reporter suggested that if the other forwards had taken full advantage of new signing Jimmy Bloomfield's creativity, the score would have been rather different. The score in the home leg was indeed different. Goals from Robin Stubbs (2), Bloomfield, Mike Hellawell, and debutant Jimmy Harris gave Birmingham a 9–4 aggregate victory.", "The game was even for the first half-hour, then Manfredini scored a shot on the turn to give Roma the lead. They doubled their lead a quarter of an hour into the second half, \"thanks once more to the brilliant opportunism of Manfredini\", whom the Birmingham Mail described as \"a splendid centre-forward who acted as a one-man attack for most of the match\". Despite most of the attacking play coming from the home side, they found Cudicini in excellent form, and it was not until the last ten minutes of the match that Mike Hellawell's snap-shot surprised the goalkeeper to make it 2-1. With just two minutes left of normal time, Harris hit the bar, and in a goalmouth scramble, the ball was forced home by Bryan Orritt – who had fallen out of favour and been on the transfer list for several months – to give Birmingham a late equaliser.", "|OR||7|| Mike Hellawell", "The trophy was presented to Losi, the Roma captain, by Sir Stanley Rous, newly elected president of FIFA. Stampa Sera described Roma as deserving of their win, as the technically superior side who had had more possession, but accepted that the two goals that made the difference were both fortuitous. They were not surprised that Birmingham were bottom of the league, and rated only Trevor Smith and the 18-year-old Mike Hellawell as good players. Merrick agreed \"that Roma were the better footballing side and deserved to win. But they did not show any sportsmanship.\" Media both English and Italian singled out Lojacono as \"the outstanding performer\" who \"outgeneralled\" his opponents, but whose \"fiery temper ...continually spoiled a superb performance\"; who provoked his opponents, started fights and man-handled the referee but was instrumental in the move that forced Farmer's own goal and was involved in the late winner.", "|OR||7|| Mike Hellawell"]}, {"page": "Football League Third Division North versus South representative matches", "response": ["| Mike Hellawell"]}, {"page": "1963–64 Birmingham City F.C. season", "response": ["Twenty-five players made at least one appearance in nationally organised first-team competition, and there were fifteen different goalscorers. Forward Mike Hellawell played in 42 of the 44 first-team matches over the season, and Bertie Auld finished as leading goalscorer with 10 goals, all scored in league competition."]}, {"page": "1962–63 Birmingham City F.C. season", "response": ["Twenty-three players made at least one appearance in nationally organised first-team competition, and there were eleven different goalscorers. Half back Terry Hennessey played in 52 of the 53 first-team matches over the season (forwards Ken Leek and Mike Hellawell missed only two), and Leek finished as leading goalscorer with 29 goals, of which 20 were scored in league competition."]}, {"page": "1961–62 Birmingham City F.C. season", "response": ["Twenty-five players made at least one appearance in nationally organised first-team competition, and there were eleven different goalscorers. Forward Mike Hellawell played in all 50 first-team matches over the season (half back Malcolm Beard missed only one), and Ken Leek and Jimmy Harris finished as joint leading goalscorers with 20 goals in all competitions; Leek was top scorer in league competition with 18 goals.", "The final of the 1960–61 Inter-Cities Fairs Cup took place in late September and mid-October 1961, when the first round of the 1961–62 competition was already under way. In the semi-final, Birmingham had beaten Inter Milan home and away; no other English club beat them in a competitive match in the San Siro until Arsenal did so in the Champions League more than 40 years later. Birmingham played in the final for the second consecutive season, having lost to Barcelona in 1960. In the first leg, missed chances and poor defending allowed Roma to take a two-goal lead at St Andrew's, but second-half goals from Mike Hellawell and Bryan Orritt, whose late equaliser came after Jimmy Harris's shot rebounded from the crossbar, took Birmingham into the second leg on level terms. In front of a large crowd in the Stadio Olimpico, Roma won 2–0 to take the trophy 4–2 on aggregate.Matthews (2010), p. 98."]}, {"page": "1960–61 Birmingham City F.C. season", "response": ["Manager Gil Merrick, appointed to succeed Pat Beasley at the end of the 1959–60 season, brought in former Spanish international winger Emilio Aldecoa – the first Spaniard to play in the Football League – as coach.Matthews (2010), p. 356. Twenty-four players made at least one appearance in nationally organised first-team competition, and there were twelve different goalscorers. Full back Brian Farmer played in 54 of the 55 first-team matches over the season, and Jimmy Harris finished as leading goalscorer with 17 goals in all competitions; in the league, Harris and Mike Hellawell were joint top scorers, each with 10 goals."]}, {"page": "List of Warwickshire County Cricket Club players", "response": ["* Mike Hellawell (1962) : M. S. Hellawell (1)"]}, {"page": "Hellawell", "response": ["*Mike Hellawell (born 1938), English footballer"]}, {"page": "Michael Hellawell", "response": ["#REDIRECT Mike Hellawell"]}]}}