{"wiki_id": "http://www.wikidata.org/entity/Q1042892", "itemLabel": "James Barry", "itemDescription": "Irish painter (1741-1806)", "wikipedia_url": "https://en.wikipedia.org/wiki/James_Barry_(painter)", "wikipedia_page": {"main": "James Barry  (11 October 1741 – 22 February 1806) was an Irish painter, best remembered for his six-part series of paintings entitled The Progress of Human Culture in the Great Room of the Royal Society of Arts in London. Because of his determination to create art according to his own principles rather than those of his patrons, he is also noted for being one of the earliest romantic painters working in Britain, though as an artist few rated him highly until the fully comprehensive 1983 exhibition at the Tate Gallery led to a reassessment of this \"notoriously belligerent personality\", who emerged as one of the most important Irish artists. He was also notable as a profound influence on William Blake.", "link_mentions": [{"page": "Lithography", "response": ["During the first years of the 19th century, lithography had only a limited effect on printmaking, mainly because technical difficulties remained to be overcome. Germany was the main center of production in this period. Godefroy Engelmann, who moved his press from Mulhouse to Paris in 1816, largely succeeded in resolving the technical problems, and during the 1820s lithography was adopted by artists such as Delacroix and Géricault. After early experiments such as Specimens of Polyautography (1803), which had experimental works by  a number of British artists including Benjamin West, Henry Fuseli,  James Barry, Thomas Barker of Bath,  Thomas Stothard,  Henry Richard Greville, Richard Cooper, Henry Singleton, and  William Henry Pyne, London also became a center, and some of Géricault's prints were in fact produced there. Goya in Bordeaux produced his last series of prints by lithography—The Bulls of Bordeaux of 1828. By the mid-century the initial enthusiasm had somewhat diminished in both countries, although the use of lithography was increasingly favored for commercial applications, which included the prints of Daumier, published in newspapers. Rodolphe Bresdin and Jean-François Millet also continued to practice the medium in France, and Adolph Menzel in Germany. In 1862 the publisher Cadart tried to initiate a portfolio of lithographs by various artists, which was not successful but included several prints by Manet. The revival began during the 1870s, especially in France with artists such as Odilon Redon, Henri Fantin-Latour and Degas producing much of their work in this manner. The need for strictly limited editions to maintain the price had now been realized, and the medium became more accepted."]}, {"page": "Ossian", "response": ["British artists began to depict the Ossian poems early on, with the first major work a cycle of paintings decorating the ceiling the \"Grand Hall\" of Penicuik House in Midlothian, built by Sir James Clerk, who commissioned the paintings in 1772.  These were by the Scottish painter Alexander Runciman and lost when the house burnt down in 1899, though drawings and etchings survive, and two pamphlets describing them were published in the 18th century.Okun, 331–334 A subject from Ossian by Angelica Kauffman was shown in the Royal Academy exhibition of 1773, and Ossian was depicted in Elysium, part of the Irish painter James Barry's magnum opus decorating the Royal Society of Arts, at the Adelphi Buildings in London (still in situ).Okun, 334–335"]}, {"page": "Pandora", "response": ["In between these two had come James Barry’s huge Birth of Pandora, on which he laboured for over a decade at the turn of the nineteenth century.Now in Manchester Art Gallery Well before that he was working on the design, which was intended to reflect his theoretical writings on the interdependence between history painting and the way it should reflect the ideal state.Liam Lennihan,\"The Writings of James Barry and the Genre of History Painting\", Routledge 2017, p.186 An early drawing, only preserved now in the print made of it by Luigi Schiavonetti, follows the account of Hesiod and shows Pandora being adorned by the Graces and the Hours while the gods look on.The British Museum Its ideological purpose, however, was to demonstrate an equal society unified by the harmonious function of those within it. But in the actual painting which followed much later, a subordinated Pandora is surrounded by gift-bearing gods and Minerva stands near her, demonstrating the feminine arts proper to her passive role. The shift is back to the culture of blame whenever she steps outside it.John Barrell, James Barry, the birth of Pandora and the division of knowledge, Macmillan 1992, ch.7"]}, {"page": "Milo of Croton", "response": ["His death is also depicted in paintings. It is the subject of an eighteenth-century oil on canvas by Joseph-Benoît Suvée and a work by the eighteenth-century Irish painter James Barry."]}, {"page": "Philoctetes", "response": ["*Philoctetes on the Island of Lemnos by James Barry, 1770, From A Series of Etchings by James Barry, Esq. from his Original and Justly Celebrated Paintings, in the Great Room of the Society of Arts (Image)."]}, {"page": "Royal Society of Arts", "response": ["The RSA moved to its current home in 1774. The House, situated in John Adam Street, near the Strand in central London, had been purpose-designed by the Adam Brothers (James Adam and Robert Adam) as part of their innovative Adelphi scheme. The original building (6–8 John Adam Street) includes the Great Room, which features a magnificent sequence of paintings by Irish artist James Barry titled The Progress of Human Knowledge and Culture and portraits of the Society's first and second presidents, painted by Thomas Gainsborough and Joshua Reynolds respectively."]}, {"page": "Victoria and Albert Museum", "response": ["In 1857 John Sheepshanks donated 233 paintings, mainly by contemporary British artists, and a similar number of drawings to the museum with the intention of forming a 'A National Gallery of British Art', a role since taken on by Tate Britain; artists represented are William Blake, James Barry, Henry Fuseli, Sir Edwin Henry Landseer, Sir David Wilkie, William Mulready, William Powell Frith, Millais and Hippolyte Delaroche. Although some of Constable's works came to the museum with the Sheepshanks bequest, the majority of the artist's works were donated by his daughter Isabel in 1888, including the large number of sketches in oil, the most significant being the 1821 full size oil sketch for The Hay Wain. Other artists with works in the collection include: Bernardino Fungai, Marcus Gheeraerts the Younger, Domenico di Pace Beccafumi, Fioravante Ferramola, Jan Brueghel the Elder, Anthony van Dyck, Ludovico Carracci, Antonio Verrio, Giovanni Battista Tiepolo, Domenico Tiepolo, Canaletto, Francis Hayman, Pompeo Batoni, Benjamin West, Paul Sandby, Richard Wilson, William Etty, Henry Fuseli, Sir Thomas Lawrence, James Barry, Francis Danby, Richard Parkes Bonington and Alphonse Legros."]}, {"page": "National Gallery", "response": ["Following the Walpole sale many artists, including James Barry and John Flaxman, had made renewed calls for the establishment of a National Gallery, arguing that a British school of painting could only flourish if it had access to the canon of European painting. The British Institution, founded in 1805 by a group of aristocratic connoisseurs, attempted to address this situation. The members lent works to exhibitions that changed annually, while an art school was held in the summer months. However, as the paintings that were lent were often mediocre,Fullerton, Peter (1979). Some aspects of the early years of the British Institution for Promoting the Fine Arts in the United Kingdom 1805–1825. MA dissertation, Courtauld Institute of Art., p. 37 some artists resented the Institution and saw it as a racket for the gentry to increase the sale prices of their Old Master paintings. One of the Institution's founding members, Sir George Beaumont, Bt, would eventually play a major role in the National Gallery's foundation by offering a gift of 16 paintings."]}, {"page": "James Barry (surgeon)", "response": ["Barry was the second child born to Jeremiah and Mary-Ann Bulkley, and was given the name Margaret Anne. Mary-Ann Bulkley was the sister of James Barry, a celebrated Irish artist and professor of painting at London's Royal Academy. Jeremiah Bulkley ran the weigh house in Merchant's Quay, Cork. However, anti-Catholic sentiment led to his dismissal from this post. This and subsequent financial mismanagement left Mary-Ann and Barry without the support of either Jeremiah Bulkley (whose debts led to him spending time in the Marshalsea debtors' prison in Dublin) or later the Bulkleys' married son John. A third child appeared in the Bulkley family and was named Juliana.  Although presented as being Barry's sister, it is possible that she was Barry's daughter as a result of childhood sexual assault, as after Barry's death the charwoman who discovered Barry's sex when laying out the body reported that pregnancy stretch marks were present.", "The teenage Barry was educated with the prospect of becoming a tutor, but given a lack of evidence of any work history, the Bulkleys appear to have struggled to find Barry any suitable tutoring positions. A conspiracy appears to have developed between Barry, Mary-Ann Bulkley and some of the late James Barry's influential, liberal-minded friends (General Francisco de Miranda, Dr Edward Fryer, who had become Barry's personal tutor, and Daniel Reardon, the family's solicitor) to enable the teenage Barry to enter medical school. The University of Edinburgh was chosen and Mary-Ann and Barry boarded a Leith smack on 30 November 1809. Dr James Barry: The early years revealed, South African Medial Journal, 2008. And so, Margaret Anne Bulkley became James Barry, nephew of the late James Barry RA, and remained known thus for the next 56 years. In a letter to Daniel Reardon, sent on 14 December, Barry asked for any letters addressed to Margaret Bulkley to be forwarded to Mary-Ann Bulkley (whom Barry now refers to as \"my aunt\"), and mentions that '...it was very usefull  for Mrs. Bulkley (my aunt) to have a Gentleman to take care of her on Board Ship and to have one in a strange country...'. Although the letter was signed \"James Barry\", the solicitor indiscreetly wrote on the back of the envelope 'Miss Bulkley, 14 December'; this crucial piece of evidence was the one which enabled researchers to finally confirm that Margaret Bulkley and James Barry were one and the same.", "thumb|left|Portrait of James Barry, painted circa 1813–1816", "Following this military training, Barry was posted to Cape Town, South Africa in 1816. Through Lord Buchan, Barry had a letter of introduction to the Governor, Lieutenant General Lord Charles Henry Somerset. Following the successful, even spectacular, treatment of Lord Charles's sick daughter, Barry was welcomed into the family, maintained a close friendship with the Governor, and became his personal physician. In 1822 Somerset appointed Barry as Colonial Medical Inspector, an extraordinary jump in expectations from Barry's low military rank, which brought with it great responsibility. Over ten years of work in the Cape, Barry effected significant changes, among them improvements to sanitation and water systems, improved conditions for enslaved people, prisoners and the mentally ill, and provision of a sanctuary for the leper population. Barry also performed one of the first known successful Caesarean sections in which both mother and child survived; the child was christened James Barry Munnik in Barry's honour, and the name was passed down through the family, leading to Barry's name being borne by a later Prime Minister of South Africa, J. B. M. Hertzog. Barry also gained enemies by criticising local officials and their handling of medical matters, but the advantage of a close relationship with the Governor meant that the repercussions of these outspoken views were usually smoothed over.", "It has been stated to me that Inspector-General Dr James Barry, who died at 14 Margaret Street on 25 July 1865, was after his death found to be female.", "After the matter was made public, many people claimed to have known of it all along. The British Army, seeking to suppress the story, sealed all records of Barry for the next 100 years. The historian Isobel Rae gained access to the army records in the 1950s, and concluded that the painter James Barry was indeed Barry's uncle. Barry was buried in Kensal Green Cemetery, with a Portland stone headstone inscribed Dr James Barry Inspector General of Hospitals. It was claimed by several sources that John, the manservant who always attended Barry, returned to Jamaica, but his actual fate is unknown.", "Barry's interest in medicine was probably encouraged by the liberal-minded friends of the late James Barry RA, and just before travelling to Edinburgh to enroll as a medical student in 1809, Barry assumed a male identity. Barry's short stature, slight build, unbroken voice, delicate features and smooth skin led others to suspect that Barry was not a man but a pre-pubescent boy. This identity was maintained through surgical training and recruitment into the British Army which, at officer rank level, did not then require a medical examination.", "The story of James Barry is briefly told in Zoya Voskresenskaya's novel Devochka v Burnom More (Girl in the Stormy Sea, 1969), whose action takes place during WWII.", "A 2004 play, Whistling Psyche by Sebastian Barry, imagines a meeting between James Barry and Florence Nightingale.", "*du Preez, HM. \"Dr James Barry (1789–1865): The Edinburgh Years\". Journal of the Royal College of Physicians of Edinburgh, 2012; 42:258–65. ", "* The Mysterious Doctor James Barry"]}, {"page": "James Barry", "response": ["James Barry may refer to:", "*James Barry (Assemblyman) (1812–1883), Irish-born Wisconsin State Assemblyman", "*James Barry (Irish MP, 1659–1717), Irish politician", "*James Barry (Irish MP, 1661–1725), Irish politician", "*James Barry (Irish MP, 1689–1743), Irish politician", "*James Barry, 4th Earl of Barrymore (1667–1748), Irish soldier and Jacobite politician", "*James Barry (hurler) (born 1990), Irish hurler", "*James Barry, 1st Baron Barry of Santry (1603–1673), Irish lawyer", "*James Barry (painter) (1741–1806), Irish painter", "*James Barry (surgeon) ( 1789–1865), British physician"]}, {"page": "Charles Burney", "response": ["Burney's portrait was painted by Reynolds in 1781 for Henry Thrale's library. His bust was cut by Nollekens in 1805. He also appears in James Barry's The Thames (also known as Triumph of Navigation), which was painted in 1791 for the Royal Society of Arts. He had a wide circle of acquaintance among the distinguished artists and literary men of his day. At one time he thought of writing a life of his friend Dr Samuel Johnson, but retired before the crowd of biographers who rushed into that field."]}, {"page": "Francisco de Miranda", "response": ["After fighting for Revolutionary France, Miranda finally made his home in London, where he had two children, Leandro (1803 – Paris, 1886) and Francisco (1806 – Cerinza, Colombia, 1831),Edsel González, Carlos. \"Miranda Andrews, Francisco\", Diccionario de Historia de Venezuela. Caracas: Fundacíon Polar, 1997. Fundación Polar. \"Miranda Andrews, Leandro\", Diccionario de Historia de Venezuela. Caracas: Fundacíon Polar, 1997.  with his housekeeper, Sarah Andrews, whom he later married. He had a friendship with the painter James Barry, the uncle of the surgeon James Barry; Miranda helped to keep the secret that the latter was biologically female. Text. Pdf. According to historian Linda de Pauw, \"Miranda was an ardent feminist, named women as his literary executors, and published an impassioned plea for female education a year before Mary Wollstonecraft published her famous Vindication of the Rights of Women.\""]}, {"page": "List of Irish artists", "response": ["*James Barry (1741–1806)"]}, {"page": "Royal Dublin Society", "response": ["On foot of the successful award of premiums to artists and the public interest in this area, the RDS decided to establish an arts school. Through successful petitioning of the then Lord Lieutenant, Lord Chesterfield, it applied for Government support and was awarded an annual grant of £500 in 1746. The drawing school was established in 1750 and had an early emphasis on figure drawing, landscape and ornament, with architectural drawing added in the 1760s. Tuition was free and popular among people of a wide variety of trades and backgrounds. A notable student was James Hoban, who attended in the 1780s and went on to design the White House, in Washington DC. Among the artists who attended the RDS schools of art or were awarded premiums by the Society were: James Barry, George Barrett, Francis Danby, Edward Smyth, John Hogan."]}, {"page": "Art of the United Kingdom", "response": ["History painting in the grand manner continued to be the most prestigious form of art, though not the easiest to sell, and Reynolds made several attempts at it, as unsuccessful as Hogarth's.  The unheroic nature of modern dress was seen as a major obstacle in the depiction of contemporary scenes, and the Scottish gentleman-artist and art dealer Gavin Hamilton preferred classical scenes as well as painting some based on his Eastern travels, where his European figures by-passed the problem by wearing Arab dress.  He spent most of his adult life based in Rome and had at least as much influence on Neo-Classicism in Europe as in Britain.  The Irishman James Barry was an influence on Blake but had a difficult career, and spent years on his cycle The Progress of Human Culture in the Great Room of the Royal Society of Arts.  The most successful history painters, who were not afraid of buttons and wigs, were both Americans settled in London: Benjamin West and John Singleton Copley, though one of his most successful works Watson and the Shark (1778) was able to mostly avoid them, showing a rescue from drowning.  Smaller scale subjects from literature were also popular, pioneered by Francis Hayman, one of the first to paint scenes from Shakespeare, and Joseph Highmore, with a series illustrating the novel Pamela.  At the end of the period the Boydell Shakespeare Gallery was an ambitious project for paintings, and prints after them, illustrating \"the Bard\", as he had now become, while exposing the limitations of contemporary English history painting.Strong (1999), 478-479; Waterhouse, Chapter 20 Joseph Wright of Derby was mainly a portrait painter who also was one of the first artists to depict the Industrial Revolution, as well as developing a cross between the conversation piece and history painting in works like An Experiment on a Bird in the Air Pump (1768) and A Philosopher Lecturing on the Orrery (c. 1766), which like many of his works are lit only by candlelight, giving a strong chiaroscuro effect.Egerton, 332-342; Waterhouse, 285-289"]}, {"page": "Irish art", "response": ["Early Irish masters include: Garret Morphey, Robert Carver, George Barrett, Sr., James Barry, Hugh Douglas Hamilton.  The Irish impressionists included Roderic O'Conor and Walter Osborne, with other landscape artists: Augustus Nicholas Burke, Susanna Drury, Paul Henry, Nick Miller, Nathaniel Hone the Younger and Pat Harris."]}, {"page": "National Gallery of Ireland", "response": ["* James Barry (1741–1806)"]}, {"page": "List of Cork people", "response": ["* James Barry – neoclassical painter"]}, {"page": "List of British artists", "response": ["* James Barry (1741–1806) – Irish painter"]}, {"page": "Brendan Neiland", "response": ["In 1998 Neiland was appointed Keeper (Director) of the Royal Academy Schools, and was credited with revitalising what had been a struggling art school.Struggle for Power - Spectator In July 2004 he resigned as Keeper following newspaper reports concerning financial irregularities. Neiland was subsequently expelled from the membership following a vote by Royal Academicians.  Neiland is the first artist to be stripped of his membership since James Barry in 1799."]}, {"page": "1784 in art", "response": ["* James Barry – The Progress of Human Culture (completed series in Great Room of Society for the Encouragement of Arts, Manufactures and Commerce in London)"]}, {"page": "John Clarence Webster", "response": ["Webster retired from medicine in 1919 and returned to Shediac. There, he began work to record and popularize the history of New Brunswick. History had been a lifelong interest, and he was now able to devote his entire energies to the task. As a doctor, he had obtained the wealth and resources that enabled him to acquire important historical documents which had not yet been deposited in museums. Most of these documents would later be donated to the New Brunswick Museum, Saint John, but before then, he would use them to produce an important body of literature on the history of New Brunswick, Nova Scotia, and early Acadia (see list below). He was assisted by his wife in his work. For example, she translated various French language documents from the Acadian period, a difficult task given the archaic form of the language. A remarkable woman in her own right, Alice Webster was an important collector of art. She founded the Fine Arts Department of the New Brunswick Museum, created an endowment for the collection, and donated her own collection of regional and Asian art. She and Webster also acquired one of the most important artwork treasures in Canada, which portrays the death of James Wolfe in 1759, by James Barry and is on exhibition at the New Brunswick Museum.A National Treasure: Death of General Wolfe, 1776, New Brunswick Museum"]}, {"page": "Tiriel (poem)", "response": ["A major question concerning the manuscript is whether or not Blake ever intended to illuminate it. Whether he had devised his method for relief etching at the time of composition is unknown, although he did make twelve drawings which were apparently to be included with the poem in some shape or form. Peter Ackroyd suggests that the illustrations, \"conceived in the heroic style,\" were inspired by the work of James Barry and George Romney, both of whom Blake admired and were intended for illustration rather than illumination. Most scholars agree with this theory (i.e. the images wouldn't be combined with the text, they would simply accompany the text) and it has been suggested that Blake abandoned the project when he discovered the technique to realise his desire for full integration of text and image. His first relief etching was The Approach of Doom (1788), and his first successful combination of words and pictures were All Religions are One and There is No Natural Religion (both 1788), but they were experiments only.Damon (1988: 16) His first 'real' illuminated book was The Book of Thel (1789) and it is possible that he abandoned Tiriel to work on Thel after making his breakthrough with All Religions and Natural Religion. According to David Bindman, for example, \"Tiriel's clear separation of text and design is transitional in being an example of the conventional method of combining text with design implicitly rejected by Blake in developing the method of illuminated printing. He probably abandoned the series because his new technique took him beyond what had now become for him an obsolete method.\"Bindman (2003: 90)"]}, {"page": "1799 in art", "response": ["* James Barry becomes the first and (for 200 years) only member to be expelled from the British Royal Society of Arts, soon after the appearance of his belligerent Letter to the Dilettanti Society."]}, {"page": "1806 in art", "response": ["*22 February – James Barry, Irish painter, one of the earliest romantic painters working in Britain (born 1741)"]}, {"page": "1803 in art", "response": ["*James Barry – Self-portrait as Timanthes"]}, {"page": "1791 in art", "response": ["*James Barry – The Thames (or Triumph of Navigation)"]}, {"page": "1788 in art", "response": ["* James Barry – King Lear Weeping over the Dead Body of Cordelia (1786–88)"]}, {"page": "1741 in Ireland", "response": ["*11 October – James Barry, painter (died 1806)."]}, {"page": "1741 in art", "response": ["*October 11 – James Barry, Irish painter (died 1806)"]}, {"page": "1806 in Ireland", "response": ["*22 February – James Barry, painter (born 1741)."]}, {"page": "1762 in Ireland", "response": ["*Approximate date – James Barry paints Baptism of the King of Cashel."]}, {"page": "John Francis Rigaud", "response": ["Having demonstrated an artistic ability, Rigaud studied with Claudio Francesco Beaumont of Turin, historical painter to the king of Sardinia. He left Beaumont to travel Italy and study  painting in Florence and in Bologna, where he was made a member of the Accademia Clementina in 1766. He then travelled to Rome, but had to return home due to family considerations. In January 1768, he set off once again, this time to Piacenza, Parma, Bologna, and then, once again, to Rome. He settled there and studied the city's art, particularly the old masters, and participated in life-drawing schools. There he produced what the Dictionary of National Biography describes as \"one of his most important works\": Hercules Resting from his Labours. While in Rome, Rigaud became friends with the Swedish sculptor Johan Tobias Sergel and the Irish painter James Barry."]}, {"page": "Boydell Shakespeare Gallery", "response": ["| 122 || James Barry || King Lear || 5.3 || Tate  || 150px", "* King Lear, Act V, scene 3 by Francis Legat after James Barry"]}, {"page": "John Butts", "response": ["Butts was born and educated in Cork, Ireland, He painted landscapes somewhat in the style of Claude Lorrain,  and worked as an art teacher, his pupils in Cork including James Barry. In around 1757, at the age of about 30, he moved to Dublin, where  he continued to work as a landscape and figure painter, and was also employed as a scene-painter at the Crow Street Theatre.", "He spent much of his life in poverty. Barry, in a letter written soon after Butts' death, described him as \"an unfortunate man, who with all his merit never met with any thing but cares and misery, which I may say hunted him into the very grave. His cast of genius was very much that of Claude's, whom he resembles without any imitation more than anybody that I know of\".Letter from James Barry to Joseph Fenn Sleigh, published in "]}]}}