{"wiki_id": "http://www.wikidata.org/entity/Q104848637", "itemLabel": "Walter Bruce", "itemDescription": "Scottish footballer (1873-1941)", "wikipedia_url": "https://en.wikipedia.org/wiki/Walter_Bruce_(Scottish_footballer)", "wikipedia_page": {"main": "Walter Bruce (29 November 1873 – 1 February 1941) was a Scottish footballer who played for Vale of Leven, Renton and St Mirren as a centre half, His elder brother Daniel was also a footballer who won the English FA Cup with Notts County in 1894 and later played for St Mirren, possibly being involved in Walter's move there in 1898 after Renton resigned from the Scottish Football League earlier that season.\nHe never took part in a major final, reaching the semi-final stage of the Scottish Cup once with Renton (in 1896) and three times with St Mirren (1898, 1900, 1901). He did win the Dumbartonshire Cup with Renton in 1896 and played in the 1903 Glasgow Merchants Charity Cup final which St Mirren lost 5–2 to Celtic. From the next season, he lost his regular place in the Buddies side to Robert Robertson. He made 140 appearances for the Paisley team in the two major competitions and scored 13 goals.Bruce was selected for the Scottish Football League XI in 1902 and 1903, facing the Irish League XI on both occasions.He continued to live in his birthplace of Bonhill and worked in the Singer Corporation sewing machine factory in Clydebank until his death in 1941.", "link_mentions": [{"page": "Walter Bruce", "response": ["Walter Bruce may refer to:", "* Walter Bruce (English footballer) (1915–?), who played for Workington, Bradford City and Swansea Town", "* Walter Bruce (Northern Irish footballer) (1938–2015), who played for Glentoran and the Northern Ireland national team", "* Walter Bruce (Scottish footballer) (1873–1941), who played for Renton and St Mirren", "* Walter Bruce (Constant Moderator) (1605-1673), the only minister of the Church of Scotland to have served a perpetual role as Moderator"]}, {"page": "List of Scottish football families", "response": ["* Daniel Bruce, Walter Bruce (brother)Senior Football Players from the Vale of Leven in the 20th Century, The Vale of Leven"]}, {"page": "Robert Robertson (footballer)", "response": ["Robert Robertson was a Scottish footballer whose only club at the professional level was St Mirren, where he spent eleven seasons (all in the Scottish Football League's top division), making 296 appearances for the Buddies in the two major competitions and scoring 18 goals.Player profiles R, StMirren.info His position was mainly as a centre half, although early in his career he was an inside forward before displacing the established 'pivot' Walter Bruce; he took part in the 1903 Glasgow Merchants Charity Cup finalFootball.  Charity Cup Final., The Glasgow Herald, 25 May 1903 and the 1908 Scottish Cup Final,Football.  Scottish Cup–Final Tie., The Glasgow Herald, 20 April 1908 both of which St Mirren lost heavily to Celtic (5–2 and 5–1 respectively)."]}, {"page": "Walter Bruce (footballer, born 1873)", "response": ["#REDIRECT Walter Bruce (Scottish footballer)"]}]}}