{"wiki_id": "http://www.wikidata.org/entity/Q10469302", "itemLabel": "Ted Evans", "itemDescription": "Footballer (1868-1942)", "wikipedia_url": "https://en.wikipedia.org/wiki/Ted_Evans", "wikipedia_page": {"main": "John Edward Evans (April 1868 – 1942), also known as \"Jammer\", was an English footballer who played in the Football League for Bury, Burslem Port Vale and Stoke.", "link_mentions": [{"page": "John Evans", "response": ["*Ted Evans (John Edward Evans, 1868–1942), English footballer for Stoke and Port Vale"]}, {"page": "Edward Evans", "response": ["Edward Evans or Ted Evans may refer to:", "* Ted Evans (1868–1942), footballer", "* Ted Evans (politician) (1939–1981), Australian politician", "* Ted Evans (public servant) (1941–2020), Australian public servant and businessman"]}, {"page": "List of people with surname Evans", "response": ["*Ted Evans (1868–1942), English footballer", "*Ted Evans (public servant) (1941–2020), Australian public servant"]}, {"page": "Potteries derby", "response": ["| Ted Evans"]}, {"page": "John Edward Evans", "response": ["#REDIRECT Ted Evans"]}, {"page": "1891–92 Stoke F.C. season", "response": ["|align=\"left\"|FW||align=\"left\"| Ted Evans"]}, {"page": "1892–93 Stoke F.C. season", "response": ["In 1892–93 Stoke finally made an impression in the Football League and claimed seventh place in the table. They collected 29 points, 11 more than bottom club Newton Heath, but were 19 points behind champions Sunderland. Ted Evans became the first Stoke player to be sent-off in the league when he received his marching orders in an away match at Everton on 12 November 1892, Stoke held out for a 2–2 draw. Throughout the season manager Arthur Reeves was able to field a settled side which included successful Scottish imports Davy Christie, Davy Brodie, Billy Dickson, Willie Naughton and Jimmie Robertson. Stoke went on an eight match unbeaten run through October and November and back to back home 7–1 and 6–0 victories over Newton Heath and Bolton Wanderers respectively the best results in an encouraging campaign for the \"Potters\".", "|align=\"left\"|FW||align=\"left\"| Ted Evans"]}, {"page": "1893–94 Stoke F.C. season", "response": ["In 1893–94 the Stoke side was broken up with Alf Underwood, Bill Rowley and Ted Evans all losing their first choice status. Eleventh place in the table was achieved, thanks in main to an excellent home record of 13 wins from 15. The only defeat in front of their own fans came shortly after Christmas when Wolverhampton Wanderers won 3–0 whilst eventual champions Aston Villa were held 3–3 in the other game. As their home form was good Stoke's away from was awful picking up just two points and conceded 62 goals on their travels. Indeed, from 1 April 1893 to 17 March 1895 not one away win was gained and by coincidence it was Sheffield Wednesday whom Stoke beat on each occasion at the start and at the end of that dismal run. There was tragedy during the season as young defender Jack Proctor fell ill with pneumonia and died at the age of 22.", "|align=\"left\"|FW||align=\"left\"| Ted Evans"]}, {"page": "1894–95 Stoke F.C. season", "response": ["|align=\"left\"|FW||align=\"left\"| Ted Evans"]}, {"page": "List of people from Stoke-on-Trent", "response": ["*Ted Evans (1868–1942), played for Port Vale and Stoke City"]}, {"page": "1896–97 Burslem Port Vale F.C. season", "response": ["Supporters returned to the Athletic Ground and a crowd of 1,500 witnessed a 3–1 victory over Long Eaton Rangers on 6 March. Two away victories saw the club rise to fourth in the league, including a 1–0 win at Rushden in which Fred Belfield was \"advised to leave the field\" by the referee as the home crowd were threatening to rush the pitch in response to Belfield's repeated kicking of defender Minney. More crowd trouble also occurred in the 1–0 win at Doncaster Rovers, as Dick Evans was grabbed by the throat and Teddy Morse was \"hurled under the waggonette\". Morse was sent off in the following game, a 1–0 home defeat by Ilkeston Town, after Willett claimed he had bitten his nose. Vale went on to win their final two home fixtures, ending the campaign in seventh-place with 31 points from 28 matches, just one point away from third-place. Dick Evans finished as the club's top-scorer, claiming 12 league goals – though some of these might actually have been scored by namesake Ted Evans. The team's form in 1897 saw the club given a vote on whether they should be readmitted into the Football League at the league's annual meeting; however their 11 votes were two fewer than successful applicants Luton Town.", "|align=\"left\"|FW||align=\"left\"| Ted Evans", "|3||FW||||Ted Evans||10||1||1||12", "| Autumn 1896 || FW || || Ted Evans || Bury || Free transfer || "]}, {"page": "1897–98 Burslem Port Vale F.C. season", "response": ["|align=\"left\"|FW||align=\"left\"| Ted Evans", "|–||FW||||Ted Evans||4||0||2||6"]}, {"page": "Cathy Heffernan", "response": ["She has experience in observational documentary-making. She co-produced Deaf Sisterhood, a documentary about a deaf woman considering converting to Islam, with Bim Ajadi and Ted Evans, and directed Crossing the Divide."]}]}}