{"wiki_id": "http://www.wikidata.org/entity/Q10436799", "itemLabel": "Horace Burrows", "itemDescription": "English footballer (1910-1969)", "wikipedia_url": "https://en.wikipedia.org/wiki/Horace_Burrows", "wikipedia_page": {"main": "Horace Burrows (11 March 1910 – 22 March 1969) was a professional footballer who played for Mansfield Town and Sheffield Wednesday. Burrows was a left half whose league career lasted from 1932 to 1939, his career was curtailed by the outbreak of World War II. Burrows also played for the England national football team on three occasions.", "link_mentions": [{"page": "Sutton-in-Ashfield", "response": ["* Horace Burrows, footballer for Sheffield Wednesday and England"]}, {"page": "1935 FA Cup Final", "response": ["| ||6 || Horace Burrows"]}, {"page": "Burrows (surname)", "response": ["* Horace Burrows (1910-1969), English footballer"]}, {"page": "Wilf Sharp", "response": ["Walker signed Sharp as a possible replacement for Wednesday's long-serving half back Alf Strange who at 34 years old was in the twilight of his career. Even without Strange in the team, there was strong competition for the half back positions with Horace Burrows and Gavin Malloch keeping Sharp out of the team for the early months of the 1934–35 season. However, an injury to Malloch on 1 December 1934 in a home draw with Sunderland led to Sharp making his debut the following Saturday in a 1–0 victory at Leicester. Sharp showed good form and kept Malloch out of the side for the rest of the season as Wednesday went on a fine run of results, eventually finishing third in Division One and winning the 1935 FA Cup Final. The following season saw the team struggle to avoid relegation, Sharp (who was not involved in the 1935 FA Charity Shield]]) played 24 matches and eventually asked for a transfer as his wife could not settle in Sheffield. In his two years at Wednesday, Sharp played 48 league games and 10 FA Cup games, scoring two goals.Since 1888. Gives career statistics.Wilf Sharp, Sheffield Wednesday Archive"]}, {"page": "Douglas Hunt", "response": ["Hunt exchanged one relegation battle for another as Wednesday were also down near the bottom of the Second Division. He made his debut on 5 March 1938 against Manchester United and played in all the remaining 12 league games that season, scoring six goals as he provided a remedy for Wednesday's problem centre forward position which had been bothering them all season. He also took over from Horace Burrows as club penalty taker. Some of his goals were vital, he scored the winner at Nottingham Forest, then scored a vital brace in Wednesday's penultimate match of the season, a 2–1 home victory against Burnley which lifted the team out of the bottom three. He then scored the winner in the following Saturday's 2–1 win at Tottenham to ensure safety.Stuart Jackson's SWFC Archive. Gives details of Sheffield Wednesday career."]}, {"page": "Arthur Betts (footballer, born 1917)", "response": ["Arthur Betts was born in Huthwaite, Sutton-in-Ashfield into a mining family. He excelled at sport at school and district level and at 14 was a member of the 1931 Sutton and District team that won the Cobbin Cup, beating Nottingham at Sutton Junction's ground. At 15 Betts had trials with Mansfield Town F.C. whilst with Hucknall Colts F.C. his first youth team. Betts was employed, after leaving school at 14, at New Hucknall Colliery in the lamp cabin. During the season 1934/35 Betts signed for Birmingham City F.C. as an amateur, and played \"A\" team matches for the club. Another club interested in Betts as an amateur was Sheffield United F.C. and he played an \"A\" team match against Bradford City F.C. \"A\" in 1935 whilst having changed employment, working for Co-operative Whole Sale (CWS) at Huthwaite in the hosiery industry. Betts also played for the CWS works team at this time. Like another exceptional local player of the time, Horace Burrows, Betts also turned out in junior football for Sutton Junction F.C. In 1936 Betts was offered a professional contract with Mansfield Town F.C. managed by Harold Wightman. Betts refused initially due to concern over leaving secure full-time employment. However, he committed to Wightman in September later that year when Wightman became the manager of Nottingham Forest. Betts signed professional terms in September 1936, making his debut against Bradford City on 28/12/36."]}, {"page": "1931–32 Mansfield Town F.C. season", "response": ["|align=\"left\"|MF||align=\"left\"| Horace Burrows"]}, {"page": "1935 FA Charity Shield", "response": ["| ||6 || Horace Burrows"]}, {"page": "List of Sheffield Wednesday F.C. international footballers", "response": ["|Horace Burrows"]}]}}