{"wiki_id": "http://www.wikidata.org/entity/Q10427288", "itemLabel": "John James", "itemDescription": "English footballer, born 1948", "wikipedia_url": "https://en.wikipedia.org/wiki/John_James_(footballer,_born_1948)", "wikipedia_page": {"main": "John Brian James (24 October 1948 – February 2021) was an English footballer who played as a striker. He played in the English Football League for Port Vale, Chester and Tranmere Rovers, making 381 appearances in the process, and also played in the North American Soccer League for the Chicago Sting. He won promotions out of the Fourth Division with Port Vale, Chester and Tranmere.", "link_mentions": [{"page": "Stone, Staffordshire", "response": ["* John James (born 1948 in Stone) footballer, played for Port Vale F.C., Chester F.C. and Tranmere Rovers F.C. made 381 appearances "]}, {"page": "Gordon Lee (footballer)", "response": ["For the 1971–72 campaign he released Mick Hopkinson, John Green, and John King; and signed left-half John Flowers from Doncaster Rovers and full-back Tony Loska from Shrewsbury Town for 'a small fee'. Pre-season did not run smoothly however, as Lee fell out with Sammy Morgan, and had to contend with injuries to Roy Sproson, Stuart Sharratt, and top-scorer John James. Low attendances forced him to sell Clint Boulton to Torquay United for £10,000. In December, he brought Ray Harford from Mansfield Town for a £5,000 fee, as well as Keith Lindsey from Southend United for 'a small fee'. War in the boardroom continued, whilst only 2,809 turned up to see a 1–0 home win over Mansfield Town on 4 March. On 8 May, Sproson made his farewell competitive appearance for the club in front of only 2,743 supporters, and Lee angrily declared that \"the attendance was nothing short of a disgrace to mark the end of a legend\". Safety was assured with a 15h place finish, five points above relegated Mansfield Town.", "He did not retain the services of four players for the 1972–73 season: Mick Morris, Keith Ball, Stuart Sharratt, and John Flowers. Lee made some key signings however, bringing in Stafford Rangers goal-machine Ray Williams for £3,000, midfielder Freddie Goodwin (Southport), 'controversial' goalkeeper Alan Boswell (Bolton Wanderers), young midfielder Colin Tartt, and trialist goalkeeper Reg Edwards (Nuneaton Borough). Six wins were gained from the opening eight league games, though low attendances caused Lee to remark that \"the people here are not genuinely interested in league football\". Offered the management position at Shrewsbury Town, he rejected the offer as he believed the club \"lacked potential\" and that he had a \"feeling of loyalty towards the [Vale] players\". In mid-season he sold John James to Chester for £5,000, Ray Harford to Colchester United for £1,750, and Keith Lindsey to Gillingham for £750, whilst spending £2,250 to bring 'pacey' striker John Woodward in from Walsall. Lee's team was criticized for foul play, particularly on 10 March, when Blackburn Rovers manager Ken Furphy branded them \"a brutal and physical side\". In the FA Cup, West Ham United manager Ron Greenwood claimed that the Vale players attempted \"the most blatant calculated intimidation I have ever seen anywhere in the world\". Vale finished in sixth spot with 53 points, four short of promoted Notts County. The 69 goals conceded tally was higher than that of all but the bottom two clubs."]}, {"page": "Jesse James (disambiguation)", "response": ["* John James (footballer, born 1948) (1948–2021), English soccer player nicknamed Jesse James"]}, {"page": "John James", "response": ["John James is the name of:", "* John James (writer) (1923–1993), British writer of historical novels", "* John James (poet) (1939–2018), British poet", "* John James (guitarist) (born 1947), Welsh fingerstyle guitarist", "* John James (actor) (born 1956), American television actor", "* John James (American poet) (born 1987)", "* John James (Canadian musician) (active 1980s–2016), Canadian dance musician", "* John James (active 1986–1997), Australian musician formerly associated with the band Newsboys", "* John James (MP for Wallingford), 1364–1378, Member of Parliament (MP) for Wallingford", "* John James (14th-century MP), MP for Melcombe Regis", "* John James (died 1601), MP for St Ives and Newcastle-under-Lyme", "* John James (Parliamentarian) (died 1681), English politician who sat in the House of Commons in 1653 for Worcestershire", "* John James (died 1718), MP for Brackley", "* John James (Wisconsin politician) fl. 1850s member of the Wisconsin State Assembly", "* Sir John James, 1st Baronet (1784–1869), Dublin wine merchant and Lord Mayor of Dublin", "* John James (Canadian politician) (1911–1999), Canadian Member of Parliament", "* John James (Archdeacon of the Seychelles)", "* John James (priest) (died 1938), Archdeacon of Llandaff", "* John James (American football) (born 1949), former American professional football player and punter", "* John James (Australian rules footballer) (1934–2010), leading Australian rules footballer in the Victorian Football League (VFL)", "* John James (footballer, born 1934) (born 1934), English football inside forward for Birmingham and Torquay", "* John James (footballer, born 1948) (1948–2021), English football striker for Port Vale, Chester, Tranmere and Chicago Sting", "* John James (racing driver) (1914–2002), British racing driver", "* John James (rower) (born 1937), British rower and Olympic medallist", "* John James (tennis) (born 1951), Australian tennis player", "* John James (architect) (c. 1670–1746), English architect", "* John James (Australian architect) (born 1931), British-born Australian architect and historian", "* John James (pirate) (fl. 1699–1700), pirate active off the American east coast and Madagascar", "* John James (Manager of Barbuda) (1774–1826), resident manager of Barbuda in the early 19th century", "* John James (Medal of Honor) (1838–1902), American soldier in the Indian Wars"]}, {"page": "1969–70 Football League", "response": ["|18||align=left|  John James ||align=left| Port Vale ||14||3||0||17"]}, {"page": "1970–71 Football League", "response": ["|14||align=left|  John James ||align=left| Port Vale ||15||0||0||15"]}, {"page": "John Green (footballer, born 1939)", "response": ["Returning to Vale Park for the rest of the 1968–69 campaign, he found himself working under a new manager in Gordon Lee. Green struggled with his fitness but played twelve games, finding himself on the scoresheet in home wins against Newport County and Chester. He then helped the club to win promotion in 1969–70, and was an ever-present with 46 league and six cup appearances. He was given the club's Player of the Year award for his contribution to the campaign. He said that \"It came as a complete surprise, all the lads were sure it would be John James\". However, he could not translate this success over to the 1970–71 Third Division campaign, and new signings Brian Horton and Tony Lacey established themselves in the first eleven. He was not offered a new contract at the end of the season. Green had played a total of 98 league and cup games for Port Vale, scoring a total of 9 goals in all competitions."]}, {"page": "List of Port Vale F.C. seasons", "response": ["|John James", "|John James"]}, {"page": "History of Port Vale F.C.", "response": ["Long serving players Mick Morris and Keith Ball were released, as was John Flowers. Numerous new signings were made for 1972–73, most notable Ray Williams. After a 7–0 thrashing by Rotherham United – blamed largely on Alan Boswell, the side went on a run of five wins. Lee continued to bemoan the fans, saying 'the people here are not genuinely interested in league football', though he turned down a job offer at Shrewsbury Town out 'of loyalty to the players'. Vale went out of the FA Cup 1–0 to West Ham United in the third round, Ron Greenwood claimed 'we were lucky to come out alive' after Vale gave a physical display, though Lee defended his players 'enthusiasm'. What was indefensible however was the violence of a minority of supporters, leaving two Londoners nursing stab wounds. In January John James went to Chester for £5,000. They finished the season in sixth, four points away from promotion."]}, {"page": "John Brian Jones", "response": ["#REDIRECT John James (footballer, born 1948)"]}, {"page": "1965–66 Port Vale F.C. season", "response": ["|align=\"left\"|FW||align=\"left\"| John James"]}, {"page": "1966–67 Port Vale F.C. season", "response": ["|align=\"left\"|FW||align=\"left\"| John James"]}, {"page": "1967–68 Port Vale F.C. season", "response": ["|align=\"left\"|FW||align=\"left\"| John James", "|6||FW||||John James||2||0||0||2"]}, {"page": "1968–69 Port Vale F.C. season", "response": ["|align=\"left\"|FW||align=\"left\"| John James", "|4||MF||||John James||4||1||0||5"]}, {"page": "1969–70 Port Vale F.C. season", "response": ["They continued on from their unbeaten result at the end of the previous season, to make a club-record unbeaten sequence of ten away games, and nineteen games home and away {5 May to 8 November}. Five of these results were goalless draws, as the defence proved stronger than the attack following the departure of top-scorer Roy Chapman at the end of the previous season. Nevertheless, the run put them at the top of the table, and Lee credited his team's hard work and fitness. John James played on despite an injured ankle, Mick Morris found himself a permanent fixture as an energetic utility man, whilst Tommy McLaren also worked his way into the first eleven. The defence conceded just six goals in the opening fifteen league games. The run included a 1–0 win over Chesterfield at Saltergate, a 2–0 win over nearby Crewe Alexandra in front of a season-best Burslem crowd of 12,538, and a 'war of attrition' in a 1–1 draw 'full of ugly incidents' with Wrexham at the Racecourse Ground in front of a crowd of 19,946. Their 22 November fixture at the Old Showground with Scunthorpe United could have seen the Vale equal the best start to an English League season in the twentieth century. After a Wookey goal put them ahead they lost after a disputed penalty and a bizarre own goal from Roy Sproson. Meanwhile, Vale could not afford the £500 registration fee for Ian Buxton following the player's departure from Notts County, and so the club could only sign him for an initial three-month period.", "|align=\"left\"|FW||align=\"left\"| John James", "|1||FW||||John James||14||3||0||17"]}, {"page": "1970–71 Port Vale F.C. season", "response": ["They finished in seventeenth spot, their 42 points leaving them three clear of relegation. John James was the top-scorer with fifteen goals. As a reward for their endeavours, the players were taken on a working holiday to Benidorm, Spain.", "|align=\"left\"|FW||align=\"left\"| John James", "|1||FW||||John James||15||0||0||15"]}, {"page": "1971–72 Port Vale F.C. season", "response": ["The pre-season saw the arrival of left-half John Flowers from Doncaster Rovers and full-back Tony Loska from Shrewsbury Town for 'a small fee'. Meanwhile, three players picked up injuries: John James (cartilage), Roy Sproson (ribs), and Stuart Sharratt (ankle); whilst Sammy Morgan threatened to quit altogether after falling out with manager Gordon Lee over his decision to remain resident in Great Yarmouth rather than moving nearer to Burslem. Violence broke out in pre-season games, as the sport was in the grip of hooliganism.", "|align=\"left\"|FW||align=\"left\"| John James", "|–||FW||||John James||1||0||0||1"]}, {"page": "1972–73 Port Vale F.C. season", "response": ["The season opened with six victories in eight league games, though the third match was a huge 7–0 defeat at Millmoor to Rotherham United – the defeat was blamed on Boswell. After mid-September the \"Valiants\" struggled to score, and recorded six draws in eight games, though they remained in the top three. The club spent £8,500 on new floodlights and a public address system, however attendances dropped off from the crucial 6,000 break-even number. Lee complained about the lack of support, and said \"the people here are not genuinely interested in league football\". Offered the management position at Shrewsbury Town, he rejected the offer as he believed the club 'lacked potential' and that he had a 'feeling of loyalty towards the [Vale] players'. Going into the Christmas period Brian Horton was struck by injury, and the team struggled, heading down the league with inconsistent play. In January, Lee sold John James to Chester for £5,000, Ray Harford to Colchester United for £1,750, and Keith Lindsey to Gillingham for £750. To keep up the promotion bid, in February he spent £2,250 to bring 'pacey' striker John Woodward from Walsall. Vale began to pick up wins, though their 2–1 win over Blackburn Rovers led to them being branded by Rovers manager Ken Furphy as 'a brutal and physical side'. Vale lifted themselves into third place, though were out of the race after a 'shattering' 5–0 defeat to Southend United at Roots Hall. Their final home game of the season was a 2–2 draw with champions Bolton Wanderers, in which 'frenzied scenes' included police dogs separating the two sets of fans at the Bycars End, two attempted pitch invasions, and the referee kicked to the ground at the final whistle.", "|align=\"left\"|FW||align=\"left\"| John James", "|5||FW||||John James||3||1||0||4", "| February 1973 || FW ||  || John James || Chester || £5,000 || "]}, {"page": "John James (English footballer born 1948)", "response": ["#REDIRECT John James (footballer, born 1948)"]}, {"page": "John James (English footballer, born 1948)", "response": ["#REDIRECT John James (footballer, born 1948)"]}, {"page": "List of Chester City F.C. seasons", "response": ["| John James"]}, {"page": "1972–73 Chester F.C. season", "response": ["||| style=\"text-align:left;\" | John James"]}, {"page": "1973–74 Chester F.C. season", "response": ["||| style=\"text-align:left;\" | John James"]}, {"page": "1974–75 Chester F.C. season", "response": ["||| style=\"text-align:left;\" | John James"]}, {"page": "1975–76 Chester F.C. season", "response": ["||| style=\"text-align:left;\" | John James"]}, {"page": "2020–21 in English football", "response": ["* c. 11 February 2021: John James, 72, Port Vale, Chester and Tranmere Rovers striker."]}, {"page": "2021 in the United Kingdom", "response": ["** John James, English footballer (b. 1948)"]}, {"page": "Deaths in February 2021", "response": ["*John James, 72, English footballer (Port Vale, Chester City, Tranmere Rovers).John James passes away"]}]}}