{"wiki_id": "http://www.wikidata.org/entity/Q104217163", "itemLabel": "Hilda Annetta Walker", "itemDescription": "English sculptor and painter (1877-1960)", "wikipedia_url": "https://en.wikipedia.org/wiki/Hilda_Annetta_Walker", "wikipedia_page": {"main": "Hilda Annetta Walker FRSA (1877 – 3 June 1960) was an English sculptor, and a painter of landscapes, seascapes and horses, flourishing between 1902 and 1958. She was a war artist painting in England during the First and Second World Wars, and described as \"escapist\". Some of her early work was the production of oilette postcard paintings for Raphael Tuck & Sons, of firemen and horses. She was born in Mirfield, Yorkshire, England, to a family of blanket manufacturers who had the means to foster her art education. She grew up in the Protestant work ethic  of Congregationalism, and attended Leeds College of Art, where she studied under William Gilbert Foster of the Staithes group and William Charles Holland King, sculptor of Dover Marine War Memorial. She signed her works \"Hilda Walker\" or sometimes \"Hilda A. Walker\".\nHer siblings included Ronald Walker, Eric Walker and Dora Walker. The artist Marie Walker Last was her niece.\n\n", "link_mentions": [{"page": "Mirfield", "response": ["*Hilda Annetta Walker, artist"]}, {"page": "Walker (surname)", "response": ["*Hilda Annetta Walker (1877–1960), English sculptor"]}, {"page": "List of British painters", "response": ["*Hilda Annetta Walker (1877–1960)"]}, {"page": "Leeds Arts University", "response": ["* Hilda Annetta Walker, artist"]}, {"page": "List of British artists", "response": ["* Hilda Annetta Walker (1877–1960) – English sculptor and painter"]}, {"page": "Eric Walker (RAF officer)", "response": ["He was the brother of seafarer Dora Walker and artist Hilda Annetta Walker, and the uncle of the artist Marie Walker Last."]}, {"page": "Ronald Walker (British politician)", "response": ["He was the elder brother to Eric Walker (RAF officer), artist Hilda Annetta Walker and Whitby seafarer Dora Walker and uncle to artist Marie Walker Last."]}, {"page": "List of 20th-century women artists", "response": ["*Hilda Annetta Walker (1877–1960), sculptor and painter"]}, {"page": "List of painters by name beginning with \"W\"", "response": ["*Hilda Annetta Walker (1877–1860), English painter and sculptor"]}, {"page": "List of fellows of the Royal Society of Arts", "response": ["* Hilda Annetta Walker"]}, {"page": "Dora Walker", "response": ["Dora Muriel Walker was born to John Ely and Mary Elizabeth Walker, a textile manufacturing family in Mirfield, Yorkshire. Her father was a blanket manufacturer, she was one of a large family, including brother Sir Ronald Walker, sisters artist Hilda and Kathleen – who became secretary to Ramsay MacDonald. She was the sister of Eric Walker (RAF officer) and of artist Hilda Annetta Walker, the aunt of Yorkshire artist Marie Walker Last, and the great-great aunt of James Northcote."]}, {"page": "English Female Artists", "response": ["Barbara Bodichon, Eleanor Brown, Marian Emma Chase, Marian Croft, Susan Elizabeth Gay, Mary Gow, Alice Elfrida Manly, Madeline Marrable, Anna Blunden Martino, Clara Montalba, Emma Sophia Oliver, Elizabeth Phillips, Louise, Rose, and Margaret Rayner, Frances Redgrave, Harriette Anne Seymour, Norah and Ellen Vernon, Hilda Annetta Walker, Sophie S. Warren, Linnie Watt", "Hannah Bolton Barlow, Emily Desvignes, Frances C. Fairman, Katharine King, Mary Louisa Kirschner, Gertrude Jekyll, Frances Fripp Rossiter, Hilda Annetta Walker."]}]}}