{"wiki_id": "http://www.wikidata.org/entity/Q10471736", "itemLabel": "Simon Black", "itemDescription": "professional footballer (born 1975)", "wikipedia_url": "https://en.wikipedia.org/wiki/Simon_Black_(English_footballer)", "wikipedia_page": {"main": "Simon Anthony Black (born 9 November 1975) is an English former professional footballer who played as a forward in the Football League for Birmingham City.Black was born in Marston Green, Solihull. When he left school in 1991, he joined Birmingham City as a YTS trainee, and made his debut in Division One (second tier) on the opening day of the 1993–94 season in a 1–0 defeat at Charlton Athletic. He played once more in the league and twice in the Anglo-Italian Cup, before leaving the club. He was later on the books of Doncaster Rovers, without playing for the first team.He joined Yeovil Town, making his debut for them on 4 March and going on to make 13 appearances during the remainder of the 1994–95 season and score four goals. He subsequently played one match for Ilkeston Town on 24 February 1996 before joining Gloucester City, where he scored three goals in seven appearances by the end of the 1995–96 season.In early 1998 he signed for Brierley Hill Town, but joined Halesowen Town later in the year. He subsequently played for Bedworth United in 1999, Stourbridge from 2000 to 2001, Paget Rangers in 2002, Bridlington Town and Hall Road Rangers.", "link_mentions": [{"page": "Simon Black", "response": ["Simon Black (born 3 April 1979) is a former Australian rules football player and current assistant coach, who played his whole career with the Brisbane Lions in the Australian Football League (AFL).", "Born in Mount Isa, Queensland, to Western Australian mother and father Ray a dairy farmer of Kaitaia in New Zealand.Brownlow medalist Simon Black returns to play for New Zealand from AFL New Zealand He relocated to Western Australia with his family at a very young age, where he attended school at Corpus Christi College in Bateman and Aquinas College, Perth.Crikey - Famous alumni on Latham's hit list  Nurtured by his father, Black initially played rugby union with dreams of being an All Black thanks to his New Zealand heritage but later took up Australian rules.[https://www.stuff.co.nz/dominion-post/sport/9949899/AFL-Brisbane-Lions-boast-Kiwi-connections AFL: Brisbane Lions boast Kiwi connections", "Shortly after announcing his retirement from the AFL, Black signed on as an assistant coach at the Lions for two years. His main focus is coaching the team's forward line and attacking systems.\"Simon Black becomes assistant coach at Brisbane Lions\" by Matt Murnane, The Age, 5 November 2013. Retrieved 6 November 2013.", "In 2016, Black founded the Simon Black Australian Rules Academy, a full time sport and educational program which provides pathways for students to pursue University and Fitness qualifications while training and playing AFL in an elite academy environment. He subsequently resigned from his role as a coach at the Brisbane Lions to focus on growing the Academy program.", ":Simon Black's player profile at AFL Tables"]}, {"page": "The Baverstock Academy", "response": ["*Simon Black, footballer, Birmingham City F.C and Doncaster Rovers F.C."]}, {"page": "Simon Black (footballer)", "response": ["#REDIRECT Simon Black (English footballer)"]}]}}