{"wiki_id": "http://www.wikidata.org/entity/Q10410370", "itemLabel": "Neil Whitworth", "itemDescription": "English footballer (born 1972)", "wikipedia_url": "https://en.wikipedia.org/wiki/Neil_Whitworth", "wikipedia_page": {"main": "Neil Anthony Whitworth (born 12 April 1972) is an English former football defender.\nBorn in Ince-in-Makerfield, Wigan, to a former rugby league footballer, Whitworth began his career at Wigan Athletic as a trainee. He made his senior debut for Wigan on 10 February 1990 in a Third Division match against Leyton Orient; Wigan lost the match 2–0. Manchester United spotted Whitworth's potential and signed him for a fee of £45,000 in June 1990. His United debut came nine months later, when he played in a 1–1 draw away to Southampton. However, Whitworth did not play again for Manchester United and was shipped out on loan to four clubs before he and Colin McKee were sold to Kilmarnock for a combined fee of £350,000 in September 1994.\nWhitworth first went on loan to Preston North End for a month in January 1992, playing six games for the Lancashire club. He then went to Barnsley in February 1992 until the end of the season, making 11 appearances. He played out the 1992–93 season in the Manchester United reserve team, but went on another month-long loan to Rotherham United in October 1993, immediately followed by a month at Blackpool.\nWhitworth was issued with the number 32 shirt when the FA Premier League introduced squad numbers for the 1993–94 season, although he never took to the field in that shirt.\nIn 1997, Whitworth suffered a nasty bout of tuberculosis, and struggled to hold down a first-team place after his recovery. Towards the end of the 1997–98 season, he moved back to his home-town club, Wigan, on loan. Whitworth was released from his Kilmarnock contract at the end of May 1998, and immediately signed by Hull City. He stayed at Boothferry Park for two seasons, but only made 28 appearances in that time, before moving on to Exeter City. He stayed at Exeter for three years, making a total of 62 appearances. He was signed by Southport in August 2003, and formed a vital part of their defensive unit, despite attracting criticism from some quarters for his lack of aerial prowess. He was sent on a month's loan to Radcliffe Borough, before returning to Southport. However, at the end of the 2003–04 season, Whitworth decided to call time on his professional career. He made a brief comeback in 2006, playing a few games for Fleetwood Town but it was short-lived, and he has not played a professional game of football since.", "link_mentions": [{"page": "Colin McKee", "response": ["He went on loan to Bury for a month in January 1993, making two appearances for the Shakers. He returned to Manchester United, winning the Denzil Haroun Reserve Team Player of the Year award in 1993, but struggled to break into the first team, making only one appearance before being sold to Kilmarnock in September 1994 along with Neil Whitworth in a combined deal worth £350,000."]}, {"page": "1989–90 Manchester United F.C. season", "response": ["|  Neil Whitworth"]}, {"page": "1990–91 Manchester United F.C. season", "response": ["|align=\"left\"|DF||align=\"left\"| Neil Whitworth"]}, {"page": "1991–92 Manchester United F.C. season", "response": ["|  Neil Whitworth", "|  Neil Whitworth"]}, {"page": "1993–94 Manchester United F.C. season", "response": ["|align=\"left\"|32||align=\"left\"|DF||align=\"left\"| Neil Whitworth"]}, {"page": "1994–95 Manchester United F.C. season", "response": ["Goalkeeper Les Sealey was given a free transfer, having kept goal for United in two 18-month spells since December 1989, as was fellow veteran Mike Phelan, who had given five years of service in midfield. Just after the start of the season, defender Neil Whitworth and striker Colin McKee also headed out of the Old Trafford exit door, signing for Kilmarnock in the Scottish Premier Division."]}, {"page": "1999–2000 Hull City A.F.C. season", "response": ["|align=\"left\"|DF||align=\"left\"| Neil Whitworth"]}, {"page": "1998–99 Kilmarnock F.C. season", "response": ["|  Neil Whitworth"]}]}}