{"wiki_id": "http://www.wikidata.org/entity/Q10543930", "itemLabel": "Jamie McGuire", "itemDescription": "British footballer (born 1983)", "wikipedia_url": "https://en.wikipedia.org/wiki/Jamie_McGuire", "wikipedia_page": {"main": "Jamie Anthony McGuire (born 13 November 1983) is an English former footballer who played as a midfielder.", "link_mentions": [{"page": "Adam Murray", "response": ["On 9 December 2016, Murray was appointed as manager of Boston United, who were 15th in the National League North table. Murray said that \"the possibility of it being more of a project than a job, that’s what pulled me to it\". Boston went on to finish the 2016–17 season in 15th-place and Murray released four players in the summer. In April 2017 he told the media that he was planning to move the club's training base. He said that there was an \"unbelievable\" number of players eager to join the club, with summer signings including goalkeeper George Willis; defenders Bradley Beatson, James Clifton, Jack Cowgill, Taron Hare and Jordan Keane; midfielder Jamie McGuire; and forwards Ashley Hemmings, Pearson Mwanyongo, Kabongo Tshimanga and Tyrell Waite. He compared his team to a baby deer after a difficult start to the new season, stating that \"they’re a little bit wobbly when they’re born\", whilst also saying that \"[recruitment has] not been good enough and we take ultimate responsibility for that\". On 28 October 2017, Murray left his position as manager of Boston United after a run of one win in 11 games left the club in the bottom two. Upon departing York Street, he said that \"they need a shot of confidence and a centre forward, everything else is in place\"; the \"Pilgrims\" went on to finish the 2017–18 season in ninth-place. He later admitted it had been a mistake to take the Boston job."]}, {"page": "Alex Marrow", "response": ["At the start of the 2012–13 season, Marrow joined Fleetwood Town on loan, though Crystal Palace website stated it will end in January. Marrow made his debut on 22 August 2012, coming on as a substitute for Jamie McGuire in the second half, as they lost 1–0 to Bradford City. Marrow then received a red card after second bookable offence, in a 0–0 draw against Rochdale on 26 October 2012. After making twenty appearances, Marrow returned to his parent club."]}, {"page": "List of Mansfield Town F.C. players", "response": ["|align=\"left\"|Macguire, JamieJamie McGuire"]}, {"page": "2012–13 Fleetwood Town F.C. season", "response": ["|18||MF||Jamie McGuire||1||0||0||2||3", "|18||MF||Jamie McGuire||8||1||0||0||1||0||0||0||9||1'"]}, {"page": "2013–14 Mansfield Town F.C. season", "response": ["|Jamie McGuire", "|Jamie McGuire"]}, {"page": "2014–15 Mansfield Town F.C. season", "response": ["|align=\"left\"|12||align=\"left\"|MF||align=\"left\"| Jamie McGuire"]}, {"page": "2015–16 Mansfield Town F.C. season", "response": ["|24||MF||Jamie McGuire                           ||3||0||1||0||0||0||0||0||4||0"]}, {"page": "2016–17 Mansfield Town F.C. season", "response": ["|align=\"left\"|24||align=\"left\"|MF||align=\"left\"| Jamie McGuire"]}, {"page": "2017–18 Mansfield Town F.C. season", "response": ["| 1 July 2017 || CM ||  || Jamie McGuire || Coaching role || Released || "]}]}}