{"wiki_id": "http://www.wikidata.org/entity/Q10546480", "itemLabel": "Harry Hanford", "itemDescription": "Welsh footballer (1907-1996)", "wikipedia_url": "https://en.wikipedia.org/wiki/Harry_Hanford", "wikipedia_page": {"main": "Harold \"Harry\" Hanford (9 October 1907 – 1996) was a Welsh footballer who made more than 300 appearances in the Football League playing for Swansea Town, Sheffield Wednesday and Exeter City. He was capped seven times for Wales at senior international level.In the book by Geraint H Jenkins, 'Proud to be a Swan', Hanford is described as \"a muscular, lantern-jawed stopper\". Despite having been at the club for only a short time, he is a \"veteran\" of the Swansea City side struggling under the management of James Thomson towards the end of the 1920s. An inspirational figure in the side who, in times of economic hardship, regularly rallied the troops with the help of the \"legendary\" Joe Sykes and record Football League appearance holder for the Swans, Wilfred Milne.Hanford was part of the giant killing Swansea Town side that saw off First division Stoke City in the third round of the 1935 FA Cup. Swansea were having a difficult season in division two that year but, goals from S Lowery (2) Hughie Blair and Walter Bussey helped them see off Stoke at the Vetch Field. Hanford played alongside Wilfred Milne, who still holds the club record for most appearances in the Football League (586). However, the Swans went on to lose to Derby County in the fourth round.", "link_mentions": [{"page": "Blaengwynfi", "response": ["*Harry Hanford (1907–1995), born in Blaengwynfi, played as a footballer over 300 times in the Football League, for Swansea Town, Sheffield Wednesday and Exeter City. He was capped seven times for Wales."]}, {"page": "Ton Pentre F.C.", "response": ["* Harry Hanford"]}, {"page": "1996 in Wales", "response": ["**Harry Hanford, footballer, 88"]}, {"page": "Walter Millership", "response": ["Millership lost his centre half place to Harry Hanford in the last full season before World War II (1938–39), however he played 12 games as a stand in centre forward, scoring eight goals when Doug Hunt was injured. Millership captained Wednesday throughout the war playing in 155 wartime games, scoring 12 goals. He played in the 1943 War Cup Final defeat to Blackpool F.C.. He also played as a guest for Doncaster Rovers and Sheffield United during the war.Since 1888. Gives career statistics.SWFC Archive. Gives statistics of Sheffield Wednesday career."]}, {"page": "Harry hanford", "response": ["#REDIRECT Harry Hanford "]}, {"page": "List of Sheffield Wednesday F.C. international footballers", "response": ["|Harry Hanford"]}, {"page": "Hanford (surname)", "response": ["* Harry Hanford (1907–1996), Welsh footballer "]}]}}