{"wiki_id": "http://www.wikidata.org/entity/Q10553748", "itemLabel": "Dele Alli", "itemDescription": "English association football player", "wikipedia_url": "https://en.wikipedia.org/wiki/Dele_Alli", "wikipedia_page": {"main": "Bamidele Jermaine \"Dele\" Alli ( DEL-ee AL-ee; born 11 April 1996) is an English professional footballer who plays as a midfielder for Premier League club Tottenham Hotspur and the England national team.\nBorn and raised in Milton Keynes, he joined the youth system at Milton Keynes Dons aged 11 and broke into the first team five years later, during the 2012–13 season. Over the next two-and-a-half years he made 88 official appearances for the team, scoring 24 goals. He signed for Tottenham Hotspur in February 2015 for an initial fee of £5 million, being loaned back to the Dons for the remainder of the season. In each of his first two campaigns at White Hart Lane, Alli was voted the PFA Young Player of the Year and made the PFA Team of the Year.\nAlli played for the England U17, U18 and U19 teams, before making his senior debut in 2015. He was selected for UEFA Euro 2016 and the 2018 FIFA World Cup, helping England to the semi-finals of the latter.", "link_mentions": [{"page": "April 11", "response": ["*1996 – Dele Alli, English international footballer"]}, {"page": "1996", "response": ["** Dele Alli, English footballer"]}, {"page": "Milton Keynes", "response": ["* Dele Alli, professional footballer"]}, {"page": "Adidas", "response": ["Adidas has sponsored numerous players, including Lionel Messi, Zinedine Zidane, Kaká, David Beckham, Steven Gerrard, Gareth Bale, Thomas Müller, Xavi, Mesut Özil, James Rodríguez, Iker Casillas, Arjen Robben, Paul Pogba, Dele Alli, Luis Suárez, Ivan Rakitić, Diego Costa, Mohamed Salah, Roberto Firmino, Paulo Dybala, Mats Hummels and Manuel Neuer.\"Real Madrid superstar Gareth Bale shows off the lightest football boot ever made\". The Mirror. Retrieved 4 June 2014\"The face of... Ten celebrities who have earned big bucks from endorsements\". Independent. Retrieved 26 July 2014\"Behind the scenes at the new Adidas advert\". London Evening Standard. Retrieved 30 May 2014"]}, {"page": "Robbie Fowler", "response": ["During the 1994–95 season Fowler was a constant member of the Liverpool side, playing in all of their 57 competitive matches, including the victory in the 1995 League Cup final, and a match against Arsenal in which he scored what was then the Premier League's second-fastest hat-trick ever, in four minutes and 33 seconds.Fowler, p. 128. His record stood for twenty years until broken by Sadio Mané on 16 May 2015 for Southampton against Aston Villa, who scored three goals in two minutes and 56 seconds. He scored braces against Aston Villa, Ipswich Town, Chelsea and Norwich City in the league that season. Fowler was voted the PFA Young Player of the Year in two consecutive years in 1995 and 1996, a feat also achieved only by Ryan Giggs, Wayne Rooney and Dele Alli."]}, {"page": "Borehamwood", "response": ["*Dele Alli English footballer, lives in Elstree"]}, {"page": "Ryan Giggs", "response": ["At the end of the 1993–94 season, Giggs won a second title in a row, and became the first player in history to win two consecutive PFA Young Player of the Year awards, a feat equalled by Robbie Fowler, Wayne Rooney and Dele Alli."]}, {"page": "Milton Keynes Dons F.C.", "response": ["Milton Keynes Dons have built a reputation for youth development, run 16 disability teams and their football trust engages around 60,000 people; between 2012 and 2013 the club produced 11 young players who have been called into age group national teams and between 2004 and 2014. The club also gave first-team debuts to 14 local academy graduates, including the England international midfielder Dele Alli.MK Dons' Dele Alli has the makings of next Steven GerrardBBC Sport, 19 September 2014", "On 2 February 2015, Milton Keynes Dons academy graduate and first team midfielder Dele Alli was sold to Premier League side Tottenham Hotspur for a fee in the region of £5 million. Alli became the first Milton Keynes Dons academy graduate to make a full England senior team debut, on 9 October 2015.", ":This list contains players who have made 100 or more league appearances (with the exception of Dele Alli). Appearances and goals apply to league matches only; substitute appearances are included. Names in bold denote current Milton Keynes Dons players."]}, {"page": "PFA Young Player of the Year", "response": ["Although the award is open to players at all levels, all winners to date have played in the highest division of the English football league system. As of 2017, only Ryan Giggs, Robbie Fowler, Wayne Rooney and Dele Alli have won the award on more than one occasion. Only seven players from outside the United Kingdom have won the trophy,The total of seven includes Cyrille Regis, who was born in French Guiana but represented England at international level. compared with fifteen winners of the main PFA Players' Player of the Year award.  Although they have their own dedicated award, players aged 23 or under at the start of the season remain eligible to win the Players' Player of the Year award, and on three occasions the same player has won both awards for a season.  In 2018 Ryan Sessegnon of Fulham became the first player from outside the top division of English football to be nominated for the award."]}]}}