{"wiki_id": "http://www.wikidata.org/entity/Q10504090", "itemLabel": "John McReady", "itemDescription": "English association football player", "wikipedia_url": "https://en.wikipedia.org/wiki/John_McReady", "wikipedia_page": {"main": "John Lewis McReady (born 24 July 1992) is an English semi-professional footballer who plays as a midfielder for Northern Football Alliance Division One club Whitburn & Cleadon FC.\nMcReady started his career with Darlington in their youth system as a 10-year-old, and was first included in the first-team squad during the 2008–09 season. He made his debut towards the end of the following season, and by the end of 2011–12 had established himself in the team. After Darlington were demoted to the Northern League in 2012, McReady signed for York City. He left a year later to sign for FC Halifax Town, and from 2014 to 2016 played for Spennymoor Town", "link_mentions": [{"page": "2009–10 Darlington F.C. season", "response": ["!scope=row|John McReady"]}, {"page": "Michael Smith (footballer, born 1991)", "response": ["He joined Conference North club Workington on loan for a month on 29 October 2010, and made seven appearances before returning to Darlington. In his first four Conference matches back with Darlington he scored six goals. At the end of the season, he, Phil Gray and John McReady all signed new two-year contracts."]}, {"page": "2011–12 York City F.C. season", "response": ["Prior to the club's Football League return, York released Ashikodi, Blinkhorn, Bopp and Brown, while Meredith, Moke and Pilkington left on their own accord for Bradford City, Cambridge and Kidderminster. Challinor, Chambers, Doig, Fyfield, Ingham, Kerr and Parslow signed new contracts with the club. New players to join were defender Danny Blanchett from Burton Albion, midfielders Lee Bullock from Bradford, John McReady from Darlington and Jonathan Smith from Swindon, winger Michael Coulson from Grimsby, and striker Oli Johnson from Oxford United. Midfielder Tom Platt was promoted to the first-team squad from the youth team after signing a professional contract with the club."]}, {"page": "McReady", "response": ["#REDIRECT John McReady"]}, {"page": "2012–13 York City F.C. season", "response": ["Following the previous season's conclusion Moses Ashikodi, Matthew Blinkhorn, Eugen Bopp and Scott Brown were released, while James Meredith, Adriano Moke and Danny Pilkington departed for Bradford City, Cambridge United and Kidderminster Harriers respectively. Jon Challinor, Chambers, Chris Doig, Jamal Fyfield, Michael Ingham, Scott Kerr and Daniel Parslow signed new contracts with York. New players signed ahead of the start of the season were defender Danny Blanchett from Burton Albion, midfielders Lee Bullock from Bradford City, John McReady from Darlington 1883 and Jonathan Smith from Swindon Town, winger Michael Coulson from Grimsby Town and striker Oli Johnson from Oxford United. Midfielder Tom Platt, the previous season's youth-team captain and Youth Team Player of the Year, entered the first-team squad after agreeing a professional contract.", "|John McReady", "!scope=row|John McReady"]}, {"page": "2013–14 York City F.C. season", "response": ["York began the season with a 1–0 home win over the previous season's play-off finalists, Northampton Town, with debutant Jarvis scoring the winning goal in the 90th minute. However, defeat came in York's match against Championship team Burnley in the first round of the League Cup, going down 4–0 at home. The team endured their first league defeat of the season in the following match after being beaten 2–0 away by Dagenham & Redbridge, the home team scoring in each half. York then held Hartlepool United to a 0–0 home draw, before being beaten 3–2 away by Bristol Rovers, in which Jarvis scored twice before John-Joe O'Toole scored the winning goal for the home team in the 67th minute. Two signings were made shortly before the transfer deadline; defender George Taft was signed on a one-month loan from Leicester City, while Middlesbrough midfielder Ryan Brobbel joined on a one-month loan. Midfielder John McReady, who had been told he had no future with the club, departed after signing for FC Halifax Town. Jarvis gave York the lead away to Exeter City before Alan Gow scored in each half to see the home team win 2–1.", "|John McReady", "!scope=row|John McReady "]}, {"page": "List of Darlington F.C. players (25–99 appearances)", "response": ["Other players took part in significant matches in the history of the club. Tommy Barbour, Percy Sutcliffe, Alf Dolphin and Arthur Wolstenholme played in Darlington's first match in the Football League, a 2–0 win at home to Halifax Town on 27 August 1921. Tommy Moran scored twice and created two other goals, one for Ron Harbertson, as Darlington eliminated Chelsea, League champions only three seasons earlier, in the fourth round of the 1957–58 FA Cup to progress to the last 16 of the competition for only the second time in their history. Gary Coatsworth scored the goal that confirmed Darlington as winners of the 1989–90 Football Conference title. John McReady, Gary Smith and Michael Smith played in Darlington's last match in the Football League, against Dagenham & Redbridge on 8 May 2010. After Tommy Wright struck the bar in the 120th minute of the 2011 FA Trophy Final, substitute Chris Senior was first to the rebound to head Darlington's winning goal. Jamie Chandler was man of the match, and the team included seven other men listed here."]}, {"page": "John Lewis McReady", "response": ["#REDIRECT John McReady"]}, {"page": "McReady, John", "response": ["#redirectJohn McReady"]}]}}