{"wiki_id": "http://www.wikidata.org/entity/Q10543925", "itemLabel": "Paddy McLaughlin", "itemDescription": "Northern Irish association football player", "wikipedia_url": "https://en.wikipedia.org/wiki/Paddy_McLaughlin_(footballer,_born_1991)", "wikipedia_page": {"main": "Patrick Joseph McLaughlin (born 14 January 1991) is a Northern Irish professional footballer who plays as a midfielder for National League North club York City. He has played in the Football League for the club. McLaughlin previously played for Newcastle United, Grimsby Town, Harrogate Town, Gateshead and Hartlepool United. He has represented Northern Ireland at levels up to under-21.", "link_mentions": [{"page": "York City F.C.", "response": ["*Sports scientist: Paddy McLaughlin"]}, {"page": "List of York City F.C. players", "response": ["|Hartlepool United|| Soccerbase credit the goal York City scored against Gillingham on 26 January 2013 to Charlie Lee (own goal). However, the goal was later credited to Paddy McLaughlin.For country: "]}, {"page": "Gary Mills (footballer, born 1961)", "response": ["Mills made a statement of intent to win the Conference Premier title in 2011–12. His summer recruitment was focused on signing players who would improve the team's goalscoring record, and he succeeding in doing this when signing Matty Blair, Paddy McLaughlin and Jason Walker. York consistently occupied a play-off position throughout 2011–12, eventually securing one after finishing fourth in the table. The team played a passing style in the first half of the season, before often grinding out results with The Press saying they \"compensated for a loss of craft with bundles of graft\"."]}, {"page": "Chris Doig", "response": ["Doig signed for Conference Premier side Grimsby Town a one-year contract on 1 August 2013 as a player-coach, following a trial with the club. Doig also took over as the club's reserve team manager. He made his debut in Grimsby's away fixture at Gateshead on 14 August 2013 and scored the winning goal in a 2–1 win, as he headed home from a Paddy McLaughlin cross."]}, {"page": "Patrick McLaughlin", "response": ["* Paddy McLaughlin (footballer, born 1979), Northern Irish footballer and manager", "* Paddy McLaughlin (footballer, born 1991), Northern Irish footballer"]}, {"page": "Ryan Blake (footballer)", "response": ["Blake was capped by Northern Ireland at U19 and U21 level. He made his U19 debut in a 2–2 2010 European U19 championship elite qualifying draw with Russia on 23 May 2010, coming on as a 41st-minute substitute for Dean Jarvis. Blake made his U21 debut on 3 September 2010, coming on as an 86th-minute substitute for Paddy McLaughlin in a 4–0 2011 European U21 Championship qualifying victory over San Marino. He made his second appearance for the U21s in a friendly against Wales on 9 February 2011, starting the match and playing an hour before being substituted."]}, {"page": "2010–11 York City F.C. season", "response": ["Before the start of the new season York released Barrett, Carruthers, Constantine, Darville, Gash, Mackin and McWilliams, with Purcell, Rankine, Jonathan Smith, Till and Young leaving for Dover Athletic, Aldershot Town, Swindon Town, Fleetwood and Alfreton Town respectively. Fyfield, Ingham and Meredith signed new contracts with York, and McDermott was retained on non-contract terms. The club's new arrivals were goalkeeper Paul Musselwhite from Lincoln, defender Lanre Oyebanjo from Histon, midfielders Paddy McLaughlin from Newcastle United, Adriano Moke from Jerez Industrial and Michael Potts from Blackburn Rovers, winger Matty Blair from Kidderminster, and strikers Chambers from Leicester, Liam Henderson from Watford and Jason Walker from Luton."]}, {"page": "2010–11 Premier Reserve League", "response": ["|align=\"left\"| Paddy McLaughlin"]}, {"page": "2011–12 Newport County A.F.C. season", "response": ["|CM ||26|| Paddy McLaughlin || || "]}, {"page": "2011–12 Newcastle United F.C. season", "response": ["*6 June 2011: New contracts are offered to Michael Richardson and Ryan Donaldson, but Paddy McLaughlin, Daniel Leadbitter, Matthew Grieve and Aaron Spear are released at the end of the season.", "|  Paddy McLaughlin"]}, {"page": "2011–12 York City F.C. season", "response": ["30 players made at least one appearance in nationally organised first-team competition, and there were 19 different goalscorers. Goalkeeper Michael Ingham, defender James Meredith and midfielder Paddy McLaughlin missed only three of the 58 competitive matches played over the season. Matty Blair finished as leading scorer with 20 goals, of which 10 came in league competition, eight came in the FA Trophy and two came in the play-offs. The winner of the Clubman of the Year, voted for by the club's supporters, was Scott Kerr for his first full season with the club.", "New additions in defence ahead of the season's start included goalkeeper Paul Musselwhite from Lincoln City and defender Lanre Oyebanjo from Histon. Midfielders to sign were Paddy McLaughlin from Newcastle United, Adriano Moke from Jerez Industrial (via the Glenn Hoddle Academy), and Michael Potts from Blackburn Rovers, with winger Matty Blair joining from Kidderminster Harriers. Strikers Ashley Chambers, who had been on loan the previous season, and Liam Henderson signed from Championship clubs Leicester City and Watford respectively. Striker Jason Walker was the only player signed for a fee, having cost £60,000 from Luton Town.", "|Paddy McLaughlin", "!scope=row|Paddy McLaughlin"]}, {"page": "2012 FA Trophy Final", "response": ["|CM ||26|| Paddy McLaughlin || || "]}, {"page": "2012 Conference Premier play-off Final", "response": ["|MF ||26||Paddy McLaughlin  || "]}, {"page": "2012–13 York City F.C. season", "response": ["Coulson scored after 15 seconds to give York the lead at home to league leaders Oxford United, and with further goals from Chambers and Paddy McLaughlin the team went on to win 3–1. York won 1–0 away in their first round match of the Football League Trophy against Rotherham United, with Blair scoring an 80th-minute winner. Walker's equaliser in the fifth minute of stoppage time secured a 2–2 draw at home to Chesterfield. There had been three goals scored in a five-minute period in the first half; Chesterfield opened the scoring through Sam Hird and Coulson equalised for York before Craig Westcarr restored the visitors' lead. York drew their next match 1–1 away to Exeter City, having taken the lead through Coulson in the 52nd minute before the home team equalised when John O'Flynn scored in the 83rd minute. The team's first away defeat of the season came with a 3–1 defeat away to Burton Albion; after McLaughlin gave York a ninth-minute lead, Burton went on to win with goals from Lee Bell, Calvin Zola and Matt Paterson. A third draw in four matches came after York drew 0–0 at home to Cheltenham Town. Platt and Liam Henderson were sent out to Harrogate Town and Gainsborough Trinity on three-month and one-month loans respectively, while Dobie was released and Taylor had his loan extended for a second month. York's run of four matches without victory came to an end after a 2–0 win away to Aldershot Town, with Blair and Walker scoring in the second half.", "|Paddy McLaughlin", "!scope=row|Paddy McLaughlin"]}, {"page": "Jon Challinor", "response": ["On 25 August 2011, Challinor signed for Kettering's Conference Premier rivals York City on a contract until January 2012, having impressed manager Gary Mills when playing against York for Kettering two days earlier. He made his debut a day later, coming on as a 56th-minute substitute for Paddy McLaughlin in a 0–0 draw away to Fleetwood Town. Challinor was soon converted into a right back at York, a position in which he displayed composure and an ability to start attacking moves. His first goal for York came in a 4–2 win away to Hayes & Yeading United on 22 October 2011 with a drilled shot into the bottom right corner of the goal from the edge of the penalty area."]}, {"page": "Tom Platt", "response": ["He was recalled by newly appointed York manager Nigel Worthington on 21 March 2013, having scored three goals in six matches during his third spell with Harrogate. He made his York debut in a 2–1 defeat away to Torquay on 23 March 2013, entering the match as a half-time substitute for Paddy McLaughlin. He then started York's six remaining matches, being paired alongside Adam Reed in midfield, as York went on to avoid relegation on the final day of the 2012–13. Platt's emergence in the team was praised by Worthington as the \"biggest highlight\" of York's relegation battle, and having finished his first senior season at York with seven appearances signed a new two-year contract with the club in May 2013."]}, {"page": "2013–14 York City F.C. season", "response": ["Following the previous season's conclusion Lee Bullock, Jon Challinor, Chris Doig, Ben Everson, Scott Kerr, David McDaid, Paddy McLaughlin, Michael Potts, Jamie Reed and Jason Walker were released by York, while Matty Blair departed for Fleetwood Town. David McGurk, Lanre Oyebanjo, Daniel Parslow, Tom Platt and Chris Smith signed new contracts with the club. New players signed ahead of the start of the season were goalkeeper Chris Kettings on a season-long loan from Blackpool, defender Ben Davies on loan from Preston North End, midfielders Craig Clay from Chesterfield and Lewis Montrose from Gillingham, winger Sander Puri from St Mirren, and strikers Ryan Bowman from Hereford United, Richard Cresswell from Sheffield United, Wes Fletcher from Burnley and Ryan Jarvis from Torquay United. Defender Mike Atkinson and striker Chris Dickinson entered the first-team squad from the youth team after agreeing professional contracts."]}, {"page": "Patrick Joseph McLaughlin", "response": ["#REDIRECT Paddy McLaughlin (footballer, born 1991)"]}, {"page": "Patrick McLaughlin (footballer)", "response": ["#REDIRECT Paddy McLaughlin (footballer, born 1991)"]}]}}