{"wiki_id": "http://www.wikidata.org/entity/Q1051631", "itemLabel": "Joe Smith", "itemDescription": "English footballer (19 years with Bolton Wanderers) and manager (23 years with Blackpool)", "wikipedia_url": "https://en.wikipedia.org/wiki/Joe_Smith_(football_forward,_born_1889)", "wikipedia_page": {"main": "Joseph Smith (25 June 1889 – 11 August 1971) was an English professional football player and manager. He is eleventh in the list of England's top-flight goal scorers with 243 league goals to his name. He was manager of Blackpool for 23 years and guided them to victory in the 1953 FA Cup Final, the only time they have won the competition since their 1887 inception.\nA forward, he began his career at Crewe Alexandra, but did not play a first team game for the club. He instead made his name at Bolton Wanderers, where with 277 league and cup goals between 1908 and 1927, he is the club's second highest goalscorer, only eight behind Nat Lofthouse. He won the Second Division title with Bolton 1908–09, and played in FA Cup final victories in 1923 and 1926. He later hit 61 goals in 70 league games for Stockport County, before being appointed player-manager at Darwen in 1929. Two years later he was appointed manager of Reading, and narrowly missed out on promotion during his four seasons in charge. He became Blackpool manager in August 1935, and remained in this position until April 1958. He led the \"Seasiders\" to one victory in three FA Cup final appearances (1948, 1951, and 1953), and also led the club to runners-up spot in the Second Division in 1936–37, second place in the First Division in 1955–56, and runners-up in the 1953 FA Charity Shield.\n\n", "link_mentions": [{"page": "Joseph Smith (disambiguation)", "response": ["Joseph or Joe Smith may also refer to:", "*Joe Smith (comedian) (1884–1981), American comedian", "*Joe Smith (musician) (1902–1937), American jazz trumpeter", "*Joe Smith (music industry executive) (1928–2019), American music industry executive", "*Joe Smith (Missouri politician) (born c. 1973), Republican member of the Missouri House of Representatives", "*Joe Smith (footballer, born 1886) (1886–?), English footballer for Hull City, Everton and Bury", "*Joe Smith (football forward, born 1889) (1889–1971), England international footballer with Bolton Wanderers and manager of Blackpool", "*Joe Smith (football halfback, born 1889) (1889–1916), English footballer with Birmingham and Chesterfield, killed in action during the First World War", "*Joe Smith (footballer, born 1890) (1890–1956), England international footballer with West Bromwich Albion", "*Joe Smith (footballer, born 1908) (1908–1993), English footballer with Watford", "*Joe Smith (winger), English professional footballer with Burnley", "*Joe Smith (footballer, born 1953), Scottish footballer with Aberdeen", "*Joe Smith (American football coach) (1873–1923), American football player and coach", "*Joe Smith (running back) (born 1979), American professional gridiron football player", "*Joe Smith (1910s pitcher), American baseball player", "*Joe Smith (catcher) (1893–1974), American baseball catcher", "*Joe Smith (athlete) (1917–1993), American marathon runner", "*Joe Smith (basketball) (born 1975), American basketball player", "*Joe Smith (2010s pitcher) (born 1984), American baseball player", "*Joe Smith Jr. (born 1989), American boxer", "*Joe Smith (rugby union) (born 1991), South African rugby union player and powerlifter"]}, {"page": "Stanley Matthews", "response": [":\"You're 32, do you think you can make it for another couple of years?\" – Blackpool manager Joe Smith in 1947.", "After picking up an ankle injury in November, he missed most of the 1951–52 campaign, and was forced to instead spend most of his time working at the hotel he and his wife ran. It was during this time that he cut red meat from his diet to begin his new near-vegetarian diet. At this point new Stoke manager Frank Taylor enquired as to whether he might bring Matthews back to the club; all parties agreed to the idea in principle until Joe Smith put his foot down to ensure he stayed, with an inspirational speech he promised Matthews that an FA Cup winners medal was still possible, telling him that \"a lot of people think I'm mad, but even though you're 37, I believe your best football is still to come.\"", "Remaining a key first team member in 1956–57, injury restricted him to 25 league appearances, though Blackpool claimed a creditable fourth-place finish. Matthews scored his 18th and final goal for Blackpool in a 4–1 league victory over Tottenham Hotspur at Bloomfield Road on 3 September 1956. Blackpool finished seventh in 1957–58, after which Joe Smith left the club."]}, {"page": "Blackpool F.C.", "response": ["The club were founder members of the Lancashire League in 1889 and were invited into the Football League Second Division in 1896. They failed re-election in 1899 but had their Football League membership reinstated the following year. Blackpool remained in the Second Division until they won the league title in 1929–30, though they were relegated after three seasons in the First Division. Promoted again in 1936–37, the club entered a golden period under the stewardship of long-time manager Joe Smith. Blackpool lost the 1948 and 1951 FA Cup finals before winning the competition in 1953, in the so-called \"Matthews Final\", in which they beat Bolton Wanderers 4–3, overturning a 3–1 deficit in the closing stages of the game. That same year, four Blackpool players were in the England team which lost against Hungary at Wembley. In the 1950s they had four top-six finishes in the First Division, with their best position being runners-up to Manchester United in 1955–56. In 1956, Stanley Matthews was the inaugural recipient of the Ballon d'Or.", "Joe Smith was appointed Blackpool's sixth manager in August 1935, a role in which he remained for the next 23 years.", "There have been 36 full-time managers of Blackpool (including repeat appointments). The longest-serving manager was Joe Smith, who occupied the role for 23 years;", "| Joe Smith || c. 1 August 1935 || 30 April 1958 || 672 || 288 || 155 || 229 || 42.86 || Promotion to Division One (1936–37), FA Cup (1953)", "*Longest-serving manager: Joe Smith (22 years, 9 months; from 1 August 1935 to 30 April 1958)"]}, {"page": "Bolton Wanderers F.C.", "response": ["On 28 April 1923, Bolton won their first major trophy in their third final, beating West Ham United 2–0 in the first ever Wembley FA Cup final. The match, famously known as The White Horse Final was played in front of over 127,000 supporters. Bolton's centre-forward, David Jack scored the first ever goal at Wembley Stadium. Driven by long-term players Joe Smith in attack, Ted Vizard and Billy Butler on the wings, and Jimmy Seddon in defence, they became the most successful cup side of the twenties, winning three times. Their second victory of the decade came in 1926, beating Manchester City 1–0 in front of over 91,000 spectators, and the third came in 1929 as Portsmouth were beaten 2–0 in front of nearly 93,000 fans."]}, {"page": "Football records and statistics in England", "response": ["|  Joe Smith"]}]}}