{"wiki_id": "http://www.wikidata.org/entity/Q10554934", "itemLabel": "Jack Lindsay", "itemDescription": "Scottish footballer born 1921", "wikipedia_url": "https://en.wikipedia.org/wiki/Jack_Lindsay_(footballer,_born_1921)", "wikipedia_page": {"main": "John McArthur Lindsay (11 December 1921 – 9 February 2006) was a Scottish footballer who played in The Football League for Sheffield Wednesday, Bury, Carlisle United and Southport.\nIn 1952, he joined Wigan Athletic. In two spells at the club he made a combined total of 104 Lancashire Combination appearances, scoring 21 goals.", "link_mentions": [{"page": "Jack Lindsay", "response": ["Jack Lindsay (20 October 1900 – 8 March 1990) was an Australian-born writer, who from 1926 lived in the United Kingdom, initially in Essex. He was born in Melbourne, but spent his formative years in Brisbane. He was the eldest son of Norman Lindsay and brother of author Philip Lindsay.", "In the 1930s the Fanfrolico Press ceased as a business. Lindsay described that experience later in the autobiographical work Fanfrolico and After (1962). He moved to the left politically, writing for Left Review and joining the Communist Party of Great Britain at the end of the decade, becoming an activist. He started writing novels while living in Cornwall. Lindsay's earliest novels were set in Ancient Greece and the Roman Empire; they included Cressida's First Lover (1931), Rome For Sale and Caesar Is Dead (both 1934).Michael Cox and Jack Adrian, The Oxford Book of Historical Stories. Oxford; Oxford University Press, 1994.  (p.429). Lindsay's historical fiction also includes 1649: A Novel of a Year (1938), a social realist novel that begins with the execution of Charles I of England and explores the first year of the Republic through the eyes of ordinary citizens. He wrote 1649 as an anti-fascist novel.\"...the record of anti-Fascist historical novels is...surprisingly long and distinguished. It includes....Jack Lindsay's 1649 (1938)...\" Janet Montefiore, Men and Women Writers of the 1930s: The Dangerous Flood of History. London: Routledge, 1996.  (p. 142).  He collaborated with Edgell Rickword amongst others.", "Lindsay was awarded the Soviet Order of the Badge of Honour in 1967,Lindsay, Jack.  An article from The Great Soviet Encyclopaedia, Vol. 14 (1973). an Honorary Doctor of Letters by the University of Queensland in 1973. He was a fellow of the Royal Society of Literature (1946), the Australian Academy of the Humanities (1982), and a Member of the Order of Australia (1981).Jack Lindsay. AustLit.Member of the Order of Australia (AM). Subcategory of Order of Australia.", "*The Mimiambs of Herodas (1929). Translated by Jack Lindsay, Decorated by Alan Odle, with a Foreword by Brian Penton. ", "*The Complete Works of Gaius Petronius Done into English By Jack Lindsay with one Hundred Illustrations by Norman Lindsay; Comprising the Satyricon and Poems (1927, privately printed for sale to subscribers only)", "*Poetical Sketches by William Blake. With an Essay on Blake's Metric by Jack Lindsay. (Scholartis Press 1927)", "*I See the Earth: Poems by Elza De Locre, Illustrated by Peter Meadows (pseudonym for Jack Lindsay), (Scholartis Press 1928)", "*War Or Peace. Twelve linocuts by Noel Counihan. Poems by Jack Lindsay (1979)", "*Trinity: Music, Poems and Drawings by Jack Lindsay (1982)", "Dai Alexander – Honor Arundel – John Atkins – Maurice Carpenter – Herbert Corby – Leslie Daiken – Idris Davies – Tom Farnol – Alun Lewis – Jack Lindsay – John Manifold – Geoffrey Matthews – David Martin – Frances Mayo – Hubert Nicholson – Harold W. Owen – Paul Potts – John Pudney – Arnold Rattenbury – M. Richardson – Joyce Rowe – Francis Scarfe – John Singe – Randall Swingler – Mike Whittock", "* Culture and history: essays presented to Jack Lindsay (1984). Edited by Bernard Smith", "* Jack Lindsay: the thirties and forties (1984). Edited by Robert Mackie", "* Paul Gillen. Jack Lindsay: faithful to the earth (1993) ", "* Obituary of Jack Lindsay: Prolific and Proletarian. The Independent (London), 13 March 1990, p. 19 ", "* Jack Lindsay. The Times (London), 9 March 1990", "* Jack Lindsay: Poet Of The Crisis Years. The Morning Star (London), 28 October 2014. Page saved by the Wayback Machine", "* The Jack Lindsay Project. Retrieved 21 November 2017", "* Jack Lindsay papers (1893–1989) at the National Library of Australia", "*A London Fictions article about Jack Lindsay's 'Rising Tide'"]}, {"page": "Jack (given name)", "response": ["*Jack Lindsay (1900–1990), Australian-born British writer and poet", "*Jack Lindsay (footballer) (1921–2006), Scottish footballer"]}, {"page": "John Lindsay (disambiguation)", "response": ["John, Jon or Jack Lindsay may also refer to:", "*Jack Lindsay (footballer, born 1921) (1921–2006), Scottish footballer who played for Bury, Carlisle United, Southport and Wigan Athletic", "*Jack Lindsay (1900–1990), Australian-born British writer and poet"]}, {"page": "Jack Lindsay (footballer born 1921)", "response": ["#REDIRECT Jack Lindsay (footballer, born 1921)"]}]}}