{"wiki_id": "http://www.wikidata.org/entity/Q1051762", "itemLabel": "Jimmy Ruffell", "itemDescription": "English footballer (1900-1989)", "wikipedia_url": "https://en.wikipedia.org/wiki/Jimmy_Ruffell", "wikipedia_page": {"main": "James William Ruffell (8 August 1900 – 6 September 1989) was an English footballer who played as an outside-left. He made over 500 appearances in the Football League for West Ham United, and ended his career with a short spell at Aldershot.\nRuffell was born in Doncaster, but moved south at an early age. He played for Essex Road School, Manor Park, Fullers, Chadwell Heath United, Manor Park Albion, East Ham and Wall End United, before West Ham signed him from the works team of the Ilford Electricity Board in March 1920. He made his League debut against Bury in December 1921.He was an ever-present during the 1924–25 season, and went on to make 548 senior appearances for the Hammers, a record that wasn't beaten until Bobby Moore surpassed it in 1973. He scored a total of 166 goals, placing him third in the club's all-time records, above many of West Ham's finest strikers despite his role on the left wing. He was the club's top scorer for the 1927–28 and 1934–35 seasons, although he didn't score a single goal during the 1921–22, 1932–33 and 1936–37 seasons.In 1923, he was part of the team that contested the first FA Cup Final to be staged at Wembley Stadium, known as The White Horse Final.In April 1926 he made his England international debut in a 1–0 defeat by Scotland in Manchester. He played for England on another five occasions, but saw competition from the likes of Cliff Bastin, Eric Brook and Eric Houghton for the left-wing spot.Ruffell left the east London club in 1937. He joined Aldershot for a short spell, where he made two League appearances and played his final game against Port Vale.His brother Bill was also a professional footballer who had been on the books at West Ham and played League football for Nelson during the 1927–28 season.", "link_mentions": [{"page": "West Ham United F.C.", "response": ["# 548 Jimmy Ruffell (1921–37)", "# 166 Jimmy Ruffell (1921–37)"]}, {"page": "Eric Brook", "response": ["Brook's 'workmanlike' p29 club form earned him a call up to the England team in 1929 and he made his first appearance for his nation against Ireland. His debut performance for England was described as 'decidedly promising'. Brook went on to play for England a total of 18 times, scoring 10 goals. He may have played more times for his country, but faced competition, primarily from Arsenal's Cliff Bastin (who received 21 caps), but also from others, such as Aston Villa's Eric Houghton (who received 7 caps), Sheffield Wednesday's Ellis Rimmer (who received 4 caps) and West Ham's Jimmy Ruffell (who received six caps) and Jackie Morton (who received one cap). However, the versatility of Brook and Bastin meant that they often played together for England, usually with Bastin playing in the inside left position (in a game against Scotland in 1935 Bastin played at inside right). When they played together, Brook and Bastin would interchange at will, switches which often confused opposition defences. p96 Despite the rivalry, Brook and Bastin were in the latter's words 'always the greatest of friends'. The only players to have scored more goals for England, prior to the second world war, who did not play in the centre forward or inside forward positions were Cliff Bastin and Charles Bambridge. Only twelve players in total scored more goals for England than Brook prior to the war. In addition to playing for England, Brook often competed in trial matches for the Rest of England against the national team."]}, {"page": "1972–73 West Ham United F.C. season", "response": ["Pop Robson was the First Division's top scorer with 28 League goals, including eight doubles and a hat-trick, just one behind the post-war club record held by Geoff Hurst, who had left the Hammers for Stoke City the previous summer. In February 1973, Bobby Moore overtook Jimmy Ruffell's West Ham appearance record. He won his hundredth England cap in the same month."]}, {"page": "1922–23 West Ham United F.C. season", "response": ["West Ham's biggest win of the season came away to Leicester City on 15 February 1923 with the Hammers securing an emphatic 6–0 win. Billy Moore scored a hat-trick, with the other goals coming from Dick Richards, Jimmy Ruffell and Jack Tresadern.", "|Jimmy Ruffell"]}, {"page": "List of West Ham United F.C. seasons", "response": ["|Jimmy Ruffell", "|Jimmy Ruffell"]}, {"page": "List of West Ham United F.C. players", "response": ["| Jimmy Ruffell", "|Jimmy Ruffell"]}, {"page": "List of West Ham United F.C. records and statistics", "response": ["|Jimmy Ruffell"]}, {"page": "Syd King", "response": ["Following promotion Syd King instilled a period of consolidation for West Ham in the First Division, the highlight of which was the 1926–1927 season when West Ham finished in 6th place in Division One. This performance was not equalled by the Hammers until the 1958–1959 season during Ted Fenton's tenure. Part of the reason that this consistency was possible, was due to Syd King signing players that went on to become West Ham legends and record holders, as well as England internationals, including Jimmy Ruffell, Ted Hufton & Vic Watson."]}, {"page": "History of West Ham United F.C.", "response": [" Still under the leadership of Syd King and growing influence of Charlie Paynter, West Ham won election to the Football League Second division proper in 1919 for the first post-war football season. They were first promoted to the top division in 1923 as runners-up to Notts County (on goal average ahead of Leicester City) and subsequently enjoyed nine top flight seasons, though regularly in the lower half and only twice broaching the top ten (in 1926–27 and 1929/30).  Syd eventually built an attractive footballing side built around the skills of players such as Vic Watson, Jimmy Ruffell and Syd Puddefoot, and the goalkeeping of Ted Hufton."]}, {"page": "Tommy Yews", "response": ["Yews joined West Ham United for a fee of £150 in 1923 and played in the high-scoring Hammers team that included Vic Watson, and Jimmy Ruffell on the opposite wing. He made a total of 361 appearances for the Upton Park club, scoring 51 goals."]}, {"page": "Bill Robinson (English footballer)", "response": ["The following season saw Robinson's second hat-trick, in a 5–3 home defeat to Sheffield United, as well as five braces. He twice managed to score in five consecutive League games (between 9 September and 7 October, and between 30 December and 17 February). He held the post-war scoring record at West Ham, with his haul of 26 goals in 40 League games in 1950–51. The record would not be surpassed until 1958–59, when John Dick scored 27. At this point, he was fourth in West Ham's all-time goalscorers list, behind Vic Watson, Jimmy Ruffell and Syd Puddefoot."]}, {"page": "Dick Richards (footballer)", "response": ["He joined West Ham United in 1922 for a fee of £300. Initially joining as an outside-left, he was moved to the opposite flank to accommodate Jimmy Ruffell. The 1922–23 season saw Richards make 34 Second Division appearances. He also made 10 cup appearances for the club, including the 1923 FA Cup Final loss to Bolton Wanderers. The following season, after promotion to the First Division, Richards made a further ten appearances, including a single FA Cup appearance that saw the Hammers bow out of the competition to Second Division Leeds United. Richards picked up more international caps, playing at inside-left, at the 1923–24 British Home Championship, which saw victories for Wales against all three other teams."]}, {"page": "Stan Cribb", "response": ["In the summer of 1930, First Division club West Ham United paid £500 for Cribb's services as cover for Jimmy Ruffell, but he never made the first-team before moving across London to join Queens Park Rangers the following summer. He scored 13 goals in 28 appearances for Rangers, before a further move to Cardiff City in July 1932. After 11 goals from 29 appearances for the Ninian Park club, he retired in the summer of 1933."]}, {"page": "1923 FA Cup Final", "response": ["Both teams employed the 2-3-5 formation typical of the era: two full-backs, three half-backs, comprising one centre-half and two wing-halves, and five forwards, comprising two outside-forwards, two inside-forwards and a centre-forward.  West Ham's game plan initially centred on the two fast-moving outside-forwards Dick Richards and Jimmy Ruffell, but Bolton set out from the start to keep the two players contained, rushing at them whenever they got the ball.  After just two minutes West Ham half-back Jack Tresadern became entangled in the crowd after taking a throw-in and was unable to return to the pitch immediately.  This gave Bolton's David Jack the opportunity to shoot for goal.  His shot beat West Ham goalkeeper Ted Hufton to give Bolton the lead, and hit a spectator who was standing pressed against the goal net, knocking him unconscious. Three minutes later Vic Watson received the ball a few yards in front of the Bolton goal but his shot flew over the crossbar. Eleven minutes into the game the crowd surged forward once again and a large number of fans encroached onto the pitch, leading to the suspension of play while the mounted police again cleared the playing area. A number of fans required first aid from members of the British Red Cross while the players looked on and awaited the resumption of play. Policemen patrolled the perimeter of the pitch to keep it clear for the linesmen, after play was resumed.", "|FW |||| Jimmy Ruffell"]}, {"page": "Bill Ruffell", "response": ["William George Ruffell (29 April 1905 – March 1988) was an English professional footballer who played as an inside forward. He was the younger brother of Jimmy Ruffell, who made more than 500 league appearances for West Ham United and won six caps for the England national football team."]}, {"page": "Jimmy Harris (footballer, born 1907)", "response": ["He made his debut for the Hammers on Christmas Day 1930, playing at inside-left in the absence of Jimmy Ruffell, in a 4–3 victory over Portsmouth and retained his place for a further three matches, scoring in a 5–5 draw against Aston Villa on 3 January 1931. Following Ruffell's return, he only made one further appearance that season, in April, followed by two in January/February 1932."]}, {"page": "1931–32 West Ham United F.C. season", "response": ["As a warm-up to the season West Ham completed a three match unbeaten tour of Switzerland and began the season with their first ever win at Bolton's Burnden Park. This would be one of only 12 wins all season which saw poor form for the team. February saw the return of Syd Puddefoot to the club, after ten years away, but his seven appearances and no goals did nothing to stave off relegation. West Ham gained a single point from their last 10 games, finished 22nd and bottom and were relegated to the Second Division.  Vic Watson was the top scorer with 25 goals in all competitions. He was also top scorer in the league with 23. Jimmy Ruffell made the most appearances; 41 in all competitions."]}, {"page": "Ruffell", "response": ["*Jimmy Ruffell, English footballer"]}, {"page": "List of English association football families", "response": ["* Jimmy Ruffell, Bill Ruffell (brother)"]}]}}