{"wiki_id": "http://www.wikidata.org/entity/Q10510830", "itemLabel": "Len Worley", "itemDescription": "English footballer (born 1937)", "wikipedia_url": "https://en.wikipedia.org/wiki/Len_Worley", "wikipedia_page": {"main": "Leonard Francis Worley (born 26 June 1937) is a former amateur footballer who played for Wycombe Wanderers, Charlton Athletic, Tottenham Hotspur, Chesham United, Wealdstone, Slough Town, Hayes and represented England at amateur level on seven occasions.", "link_mentions": [{"page": "Chalfont St Peter", "response": ["*Len Worley – amateur footballerHugman, BJ (Ed) The PFA Premier & Football League Players' Records 1946–2005 (2005)  p675. Retrieved 28 July 2010"]}, {"page": "Chesham Grammar School", "response": ["*Len Worley,  footballer"]}, {"page": "1937 in the United Kingdom", "response": ["* 26 June – Len Worley, English footballer"]}, {"page": "List of Wycombe Wanderers F.C. players", "response": ["| Len Worley"]}, {"page": "History of Wycombe Wanderers F.C.", "response": ["Sid Cann was beginning to build a formidable team, one that could rightful challenge for the title of the greatest amateur side in the country. Two young lads made their debuts in 1954 and would go to become legends in their own right. Paul Bates, born in High Wycombe, was a prolific centre-forward, and scored more than 300 goals for the Chairboys. Many of those goals were supplied by Len Worley, born in Chalfont St. Peter, a right-winger who was known as the Stanley Matthews of amateur football. Despite breaking his leg twice, he played as an amateur for both Charlton Athletic and Tottenham Hotspur, but he was at home at Wycombe Wanderers and the fans were very happy to have him. The 1954–55 season saw the Blues embark on another FA Amateur Cup run, Wealdstone, Woking and Ilford were beaten and faced the famous Pegasus team in the quarter-finals. 14,000 at a snow-bound Loakes Park saw the home side do everything but score and the visitors escaped with a goalless draw. The replay at Iffley Road saw the Wanderers come from a goal down to win 2–1 with a last minute winner from Jackie Tomlin. Once again Bishop Auckland stood in Wycombe's way, and the semi-final at Belle Vue, Doncaster, was a tight affair. Over 5,000 Chairboys travelled north and was soon cheering as the Bishops missed a 13th-minute penalty. However, the Wembley dream was shattered when Oliver scored the winner with 19 minutes remaining.", "Even greater excitement had preceded it as the club made it to the FA Amateur Cup final at Wembley. St Albans City, Clapton and Hounslow Town were beaten and Ilford were the opponents for the quarter-final at East London sides Newbury Park ground. 5,000 Wycombe fans travelled in torrential rain, and the pitch was a quagmire but the game went on. They watched a see-saw game that ended in a 3–3 draw and the replay a week later at Loakes Park saw 15,500 people squeeze in to see the home side win 2–0. The semi-final was played at Highbury, scene of the club's 1931 triumph and opponents Corinthian Casuals contributed fully to an incredible tussle, which enraptured the 28,197 crowd. Norman Kerruish gave Casuals a first-minute lead, but Paul Bates header home an equaliser just three minutes later. He gave the Blues the lead on 20 minutes but Jack Laybourne made it 2–2 on the half hour. Wycombe Captain Frank Westley hobbled off on the hour and were soon down to nine men when Frank Smith dislocated his shoulder. Goalkeeper Dennis Syrett then injured himself when he collided with a post. Westley returned to play on the wing, and his incredible strength and determination helped galvanise the team. With twenty minutes to go Paul Bates crossed for Len Worley to head home. With five minutes left Worley was put in on goal and he fired home to give the Wanderers a magnificent 4–2 win.", "In December 1968 Barry Darvill resigned and the club approached Brian Lee, upon a recommendation from the Football Association. Brian Lee was appointed in December and took charge of his first game on 28 December 1968, a 0–0 draw at Clapton Lee's appointed was a real watershed moment for the club and within a month Lee was picking the team and the Selection Committee was disbanded. Lee's impact was even greater, and he started to rebuild the team in the summer of 1969. The reserve side was disbanded, due to limited resources. The quartered kit were also changed, the side wearing plain Cambridge blue shirts and Oxford blue shorts. Geoff Anthony, Peter Suddaby, John Delaney, Johnny Hutchinson and Keith Searle all joined the club and the side finished as runners-up in the league to Enfield Wanderers legend Len Worley played his last game for the club, as a substitute in a 1–0 win at Croydon Amateurs on 13 December 1969. He played 512 games for Wycombe, scoring 67 goals. Ted Powell, Larry Pritchard and Paul Fuschillo joined the club in the summer of 1970 and a hugely talented team won the club's third Isthmian League title, pipping Sutton United to the Championship by just one point. The quarter-finals of the FA Amateur Cup were reached again, but Skelmersdale United stunned at 10,203 crowd winning 3–0 at Loakes Park. The title was retained the following season as the side flew out of the traps, losing just one of its first 22 league matches, scored 102 goals in 40 games. The club was, however, determined to repeat its one and only FA Amateur Cup triumph and Aveley, Spennymoor United, Walton and Hersham and Hayes were beaten as the Blues reached the semi-final. It was played at Griffin Park, Brentford, scene of defeat in the semi-final of 1950. The opponents this time were Isthmian League rivals Hendon Wycombe were missing the influential Larry Pritchard through injury. The majority of the 9,210 crowd travelled from High Wycombe and they were aghast to see the Dons take the lead against the run of play after 14 minutes. Johnny Hutchinson equalised on 60 minutes but Hendon grabbed a winner with a lon-range shot that stood despite appeals that a Hendon player was in an offside position."]}]}}