{"wiki_id": "http://www.wikidata.org/entity/Q1051047", "itemLabel": "Catherine Storr", "itemDescription": "British psychiatrist and writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Catherine_Storr", "wikipedia_page": {"main": "Catherine Storr (born Catherine Cole; 21 July 1913 – 8 January 2001,) was an English children's writer, best known for her novel Marianne Dreams and for a series of books about a wolf ineptly pursuing a young girl, beginning with Clever Polly and the Stupid Wolf. She also wrote under the name Helen Lourie.", "link_mentions": [{"page": "Timeslip", "response": ["Ruth Boswell went on to adapt Catherine Storr's novel Marianne Dreams, as the children's television serial Escape Into Night (1972) and produced the first season of The Tomorrow People (1973–79; 1992–95)."]}, {"page": "Tam Lin", "response": ["* Thursday, by Catherine Storr (1971)"]}, {"page": "1913 in literature", "response": ["*July 21 – Catherine Storr, English children's writer (died 2001)"]}, {"page": "2001 in literature", "response": ["*January 8 – Catherine Storr, English children's writer (born 1913)"]}, {"page": "1955 in literature", "response": ["*Catherine Storr – Clever Polly and the Stupid Wolf"]}, {"page": "1958 in literature", "response": ["*Catherine Storr – Marianne Dreams"]}, {"page": "List of London Underground–related fiction", "response": ["*Catherine Storr: The Underground Conspiracy (1987), children's/teen novel. A teenage girl who travels on the Underground for fun soon becomes a pawn in an elaborate plan to use the Underground to transport drugs."]}, {"page": "Marianne Dreams", "response": ["Marianne Dreams is a children's fantasy novel by Catherine Storr. It was illustrated with drawings by Marjorie-Ann Watts and published by Faber and Faber in 1958. The first paperback edition, from Puffin Books in 1964, is catalogued by the Library of Congress as revised.", "Catherine Storr's later novel Marianne and Mark was a sequel to Marianne Dreams."]}, {"page": "Andrew Lowe Watson", "response": ["Andrew Lowe Watson  (17 January 1958 - 25 April 2021) was an English composer for musical theatre and concert music. Along with author Catherine Storr, he wrote the opera Marianne Dreams (2002), based on the children's fantasy novel. It premiered in London in June 2004. He was a student of Norma Fisher."]}, {"page": "Escape Into Night", "response": ["The serial was an adaptation of Catherine Storr's 1958 novel Marianne Dreams, and deals with a young girl, Marianne, whose drawings become the basis for dreams, and how the dividing line between dreams and reality blurs. The novel was later adapted into a 1988 film, Paperhouse."]}, {"page": "St Paul's Girls' School", "response": ["* Catherine Storr – author"]}, {"page": "Moira Buffini", "response": ["Buffini wrote Dying For It, a free adaptation of Nikolai Erdman's classic, The Suicide, for the Almeida in 2007. She followed it with Marianne Dreams a dance play with choreographer Will Tuckett, based on Catherine Storr's book. Her play for young people, A Vampire Story was performed as part of NT Connections in 2008."]}, {"page": "London Underground in popular culture", "response": ["* \"The Underground Conspiracy\" (1987), children's/teen's novel by Catherine Storr. A teenage girl who travels on the Underground for fun, soon becomes a pawn in an elaborate plan to use the Underground to transport drugs."]}, {"page": "Storr", "response": ["* Catherine Storr (1913–2001), English novelist and children's writer"]}, {"page": "Paperhouse (film)", "response": ["Paperhouse is a 1988 British dark fantasy film directed by Bernard Rose. It was based on the 1958 novel Marianne Dreams by Catherine Storr. The film stars Ben Cross, Glenne Headly and Gemma Jones. The original novel was the basis of a six-episode British TV series for children in the early 1970s which was titled Escape Into Night.", "The film's book basis, Marianne Dreams by Catherine Storr, was given a hardcover film tie-in release in 1989, featuring a film still of Charlotte Burke reaching towards a stormy sky with the imaginary house in the background, along with a bottom-corner caption reading, \"new major feature film Paperhouse\". The release was unusual, as most children's film tie-in books at the time were released as mass-market paperbacks, while publisher Lutterworth Press had opted for a bound hardcover instead. This edition of Storr's book has since fallen out of print."]}, {"page": "Marianne and Mark", "response": ["Marianne and Mark (1960) by Catherine Storr is a sequel to Marianne Dreams (1958). It and continues the story of the eponymous characters. The novel has far less basis in fantasy than the first book with Storr focusing on the trials of growing up rather than magical happenings, although there is arguably a fantastic subtext in Marianne and Mark.", "Catherine Storr, \"Fear and evil in children's books\", Children's literature in education 1, 1970, 22-40."]}, {"page": "The New York Review Children's Collection", "response": ["*The Complete Polly and the Wolf by Catherine Storr"]}, {"page": "Holland (publisher)", "response": ["* Catherine Storr"]}, {"page": "Simulated reality in fiction", "response": ["| Marianne Dreams by Catherine Storr"]}, {"page": "Starting Out (British TV series)", "response": ["Starting Out is the title of seven series of programmes made for UK schools by ATV and Central from 1973 to 1992. The writers included Catherine Storr, Dave Simpson, Anthony Horowitz and Grazyna Monvid. Comprising 56 episodes in total, the series were repeated until 1994.Starting Out on the Broadcast for Schools website", "*Series 1 (1973) written by Catherine Storr — 10 episodes about three girls, their boyfriends and their brothers", "*Series 2 (1976) written by Catherine Storr — 10 episodes about a group of teenagers who meet a young man who is on probation. "]}, {"page": "July 1913", "response": ["*Born: Catherine Storr, British children's writer, author of Marianne Dreams, in Kensington, England (d. 2001)"]}, {"page": "Deaths in January 2001", "response": ["*Catherine Storr, 87, English children's writer."]}, {"page": "Helen Lourie", "response": ["#Redirect Catherine Storr"]}, {"page": "Vlag en Wimpel", "response": ["* Catherine Storr, "]}, {"page": "List of Jackanory episodes", "response": ["|1518|| Kate and the Island: Part 1 - Going Away || Catherine Storr || Keith Barron || 09-Apr-73", "|1519|| Kate and the Island: Part 2 - Kate makes Friends || Catherine Storr || Keith Barron || 10-Apr-73", "|1520|| Kate and the Island: Part 3 - Kate goes Exploring || Catherine Storr || Keith Barron || 11-Apr-73", "|1521|| Kate and the Island: Part 4 - The Discovery || Catherine Storr || Keith Barron || 12-Apr-73"]}, {"page": "Clever Polly", "response": ["#REDIRECT Catherine Storr"]}]}}