{"wiki_id": "http://www.wikidata.org/entity/Q1055918", "itemLabel": "Lembit Öpik", "itemDescription": "British politician (born 1965)", "wikipedia_url": "https://en.wikipedia.org/wiki/Lembit_%C3%96pik", "wikipedia_page": {"main": "Lembit Öpik (, Estonian: [ˈlembit ˈøpˑik]; born 2 March 1965) is a former British politician. A former member of the Liberal Democrats, he served as the Member of Parliament (MP) for the constituency of Montgomeryshire in Wales from 1997 until he lost his seat at the 2010 general election. He was the leader of the Welsh Liberal Democrats from 2001 to 2007.Öpik stood unsuccessfully for the position of President of the party in 2004 and 2008. He was also unsuccessful in a bid to become the Liberal Democrats' nominee in the 2012 London mayoral election.Beyond his political work, Öpik has also been in the public eye through his appearances on several television shows and as a result of his personal relationships with ITV weather presenter Siân Lloyd and with pop star Gabriela Irimia of The Cheeky Girls, which drew considerable media attention.", "link_mentions": [{"page": "March 2", "response": ["*  1965   – Lembit Öpik, Northern Irish politician"]}, {"page": "University of Bristol", "response": ["The University of Bristol Students' Union (Bristol SU) located on Queen's Road in the Richmond Building is a founding member of the National Union of Students and is amongst the oldest students' unions in England. The union oversees three media outlets: UBTV, the Bristol University Radio Station (BURST) and the student newspaper Epigram. There is also a local branch of The Tab. The Union is responsible for representing students' academic interests through elections of student representatives and democratic events. The Union is also responsible for the organisation of the annual Welcome Fair, the co-ordination of Bristol Student Community Action, which organises volunteering projects in the local community, and the organisation of entertainment events and over 400 student groups, societies and clubs. Previous presidents have included Sue Lawley and former Liberal Democrat MP Lembit Öpik. There is a separate union for postgraduate students, as well as an athletic union, which is a member of the British Universities & Colleges Sport. In distinction to the \"blues\" awarded for sporting excellence at Oxford and Cambridge, Bristol's most successful athletes are awarded \"reds\".", "In government and politics, notable alumni include Albert II, Prince of Monaco, former Liberal Democrat MP Lembit Öpik, who was president of Bristol University Students' Union during his time, Sir Jonathan Evans,  former head of MI5, Nkosazana Dlamini-Zuma, Chairperson of the African Union Commission from October 2012 to January 2017, and Paul Boateng, the UK's first Black Cabinet Minister."]}, {"page": "List of MPs elected in the 2001 United Kingdom general election", "response": ["| Lembit Öpik", "| Lembit Öpik"]}, {"page": "Kennington", "response": ["* Lembit Öpik, politician."]}, {"page": "County Down", "response": ["* Lembit Öpik, former Liberal Democrat MP and Shadow Welsh and Shadow Northern Ireland Secretary, Bangor"]}, {"page": "List of Estonians", "response": ["*Lembit Öpik (born 1965), politician (United Kingdom)"]}, {"page": "Ernst Öpik", "response": ["His grandson, Lembit Öpik, was the Liberal Democrat Member of Parliament for Montgomeryshire in Wales from 1997 to 2010, and has advocated searching for asteroids that may collide with the Earth.  Lembit also became Chairman of the Parliament of Asgardia in 2019 and is a Member of the Supreme Space Council (SSC)https://asgardia.space/en/news/protocol-2-supreme-space-council-of-asgardia"]}, {"page": "Lembit Opik", "response": ["#REDIRECT Lembit Öpik"]}, {"page": "Mark Oaten", "response": ["On 19 January, Oaten withdrew from the contest, having failed to attract support from within the parliamentary party; his sole supporters were Lembit Öpik MP and Sarah Ludford, Baroness Ludford, a peer and MEP. He concluded his withdrawal statement with the words \"Next week I'll be giving some thought to where I go politically and giving my thoughts on the future of the Party.\""]}, {"page": "List of MPs elected in the 1997 United Kingdom general election", "response": ["|Lembit Öpik"]}, {"page": "List of MPs for constituencies in Wales (2001–2005)", "response": ["*Lembit Öpik"]}, {"page": "The Cheeky Girls", "response": ["In December 2006, it was revealed by the tabloids that former Liberal Democrat MP Lembit Öpik had broken up with long-time fiancée, ITV weather presenter Siân Lloyd, and was now romancing Gabriela."]}, {"page": "Bangor, County Down", "response": ["*Lembit Öpik, former Liberal Democrat MP and Shadow Welsh and Shadow Northern Ireland Secretary"]}, {"page": "Daily Sport", "response": ["The Daily Sport did not normally include news, although in 2008 Lembit Öpik (then a Liberal Democrat MP) began a regular weekly political column.Lembit to become Daily Sport political columnist. Libdemvoice.org (11 December 2008). Retrieved on 2011-04-03. Instead, its coverage indulged more in tabloid journalism, with an emphasis on celebrities, bad behaviour and toilet humour."]}, {"page": "University of Bristol Students' Union", "response": ["Former union presidents have included the broadcaster, Sue Lawley, St Lucia's foreign minister and ambassador to the United Nations, George W. Odlum and Lembit Öpik."]}, {"page": "List of Have I Got News for You episodes", "response": ["|Lembit Öpik MP", "|Lembit Öpik MP", "|Lembit Öpik MP", "|Lembit Öpik MP", "|Lembit Öpik MP", "|Lembit Öpik", "|Lembit Öpik"]}, {"page": "Mike Tuffrey", "response": ["On 15 June 2011, Tuffrey launched his bid to become the Liberal Democrat candidate for Mayor of London in the 2012 election. Running against Lembit Öpik, Tuffrey was \"widely tipped to become the Liberal Democrats' candidate\". He emerged after nominations were reopened as the \"anyone-but-Lembit\" candidate, with Öpik's detractors claiming that he lacked gravitas and his supporters claiming only he had a sufficiently high-profile. However, in the event Brian Paddick emerged as the party's candidate."]}, {"page": "International Simultaneous Policy Organization", "response": ["Individuals who have signed but are no longer MPs are: Conservative Party: Sir Richard Body; Labour: Celia Barlow, Tony Benn; Liberal Democrat: Lembit Öpik, John Hemmingsimpol.org: Endorsements"]}, {"page": "David Walliams", "response": ["| style=\"text-align: center\" | 17 || Have I Got News for You || Patrick Kielty || Panellist || Panellists: Clive Anderson, Lembit Öpik and Holly Walsh"]}, {"page": "Bargain Hunt", "response": ["| Lembit Öpik and Edwina Currie"]}, {"page": "Siân Lloyd", "response": ["From 2002, Lloyd was in a relationship with Lembit Öpik, then the MP for Montgomeryshire, and was engaged to him from 2004 to October 2006. They lived at a house they bought together in Öpik's constituency outside Newtown, Powys, and were due to marry in 2006. They had met at a Liberal Democrats conference session where the press meet the MPs, where they talked and she lost a ring. He found it, then lost it himself, then found it again two years later and called her; she had a spare ticket to go to the Proms, and they began a relationship. She appeared on Celebrity Who Wants To Be A Millionaire? with Öpik on 15 April 2006, winning £64,000 for charity. In December 2006 it was revealed that the relationship had broken down."]}, {"page": "Nick Clegg", "response": ["In March 2008, GQ magazine ran with an interview conducted by Piers Morgan in which Clegg admitted to sleeping with \"no more than 30\" women. Senior Lib Dem MPs defended his comments; Lembit Öpik said it showed \"you can be a human being and a party Leader\", and Norman Lamb that \"Nick tries to be absolutely straight in everything that he does, and that might sometimes get him into trouble but he will build a reputation for being honest and straightforward.\" Speaking to the BBC about the interview Clegg said \"wisdom with hindsight is an easy thing\" as what had been a split second response had been \"taken out of context, interpreted, over interpreted and so on\".", "In the aftermath of the results, Clegg again faced calls to quit as leader, with former MP Lembit Öpik suggesting that Clegg retain his Cabinet position while relinquishing leadership of the party, saying \"My empirical view is that we would have done better with a different leader\"."]}, {"page": "Armagh Observatory", "response": ["Ernst Julius Öpik (grandfather of Lembit Öpik MP) was based here for over 30 years and among his many contributions to astrophysics he wrote of the dangers of an asteroid impacting on the Earth."]}, {"page": "List of MPs elected in the 2005 United Kingdom general election", "response": ["| Montgomeryshire || Lembit Öpik || Liberal Democrat || Lembit Öpik || Liberal Democrat"]}, {"page": "Montgomeryshire (UK Parliament constituency)", "response": ["|Lembit Öpik"]}, {"page": "Serious Organised Crime and Police Act 2005", "response": ["However, others, such as Jeremy Corbyn MP disagreed, saying \"The Minister should think carefully about removing rights that are enshrined in our history\", and Glenda Jackson MP agreed with him, saying \"I regard it as the voice of democracy\". Lembit Öpik MP drew attention to the comments of the Prime Minister Tony Blair, who, on 7 April 2002, said: \"When I pass protestors every day at Downing Street ... I may not like what they call me, but I thank God they can. That's called freedom.\" The Home Office stated the security concerns, such as the possibility of explosive devices being left in and around Haw's paraphernalia, were another reason for the legislation."]}, {"page": "Mark Williams (politician)", "response": ["In February 2000, after a spell as President of Ceredigion Liberal Democrats, Williams was selected to fight the Ceredigion seat in the by-election caused by the resignation of Cynog Dafis. In that by-election, the Liberal Democrats rose back into second place, and in the general election of 2001 consolidated that by coming second, being just 3,944 votes behind Plaid Cymru. In May 2005, 13 years after Howells had been defeated, the Liberal Democrats regained Ceredigion, with Williams as their candidate, by a very narrow majority of 219 votes. Williams described his victory as an \"amazing result\", while the then Welsh Liberal Democrat leader, Lembit Öpik,  said that \"Mark Williams has pulled off the result of the night in Ceredigion\". Williams was the first non-Welsh-speaking Member of Parliament to represent the constituency since the widening of the electoral franchise in 1867. In 2010, he substantially increased his majority, winning just over 50% of the vote; this was the first time any candidate had won more than 50% of the vote in Ceredigion since 1959."]}, {"page": "The Apprentice (British TV series)", "response": ["After the first Comic Relief celebrity version proved a success, the BBC gave the green light for another edition the following year for Sport Relief 2008. Designed once again as a two-part special called Sport Relief Does The Apprentice, it was aired on 12 and 14 March 2008, and functioned on the same format as the Comic Relief version. For the Sport Relief edition, the celebrities that participated were Phil Tufnell, Nick Hancock, Lembit Öpik, Kelvin MacKenzie, Hardeep Singh Kohli, Lisa Snowdon, Jacqueline Gold, Louise Redknapp, Clare Balding and Kirstie Allsopp."]}, {"page": "Size zero", "response": ["The use of size 0 in advertisements and products of the clothing industry has been met with some media attention. In July 2009, Katie Green won a competition to represent Wonderbra. They referred her to the Premier Model Management agency for representation. Green reported that \"one of the guys from the PR agency from Wonderbra\" insisted that she lose weight, that it wasn't normal for models to be a (UK) size 8. \"Unless I could drop down to that weight, they wouldn't be willing to get me more work.\" Green at first complied, but then quit the agency. She then, with Liberal Democrat MP Lembit Öpik, launched a campaign titled \"Say No to Size Zero\". They began a petition drive with the goal to put an end to size zero and underweight models on the catwalk or working in the fashion industry. They set a goal to obtain 20,000 signatures and plan to present it to the UK Prime Minister and Parliament. They are campaigning for legislation that would require regular health checkups for all models before undertaking any assignments."]}, {"page": "National Liberal Club", "response": ["*Lembit Öpik, Lib Dem MP 1997–2010"]}, {"page": "List of United Kingdom MPs: O", "response": ["*Lembit Öpik (1997–2010)"]}, {"page": "The End Is Nigh", "response": ["*Summer 2006 – the third issue is on threats from space, including dangers from meteorites, aliens and includes an interview with Lembit Öpik. The cover is by Oliver Redding."]}, {"page": "1997 in Wales", "response": ["*1 May - In the UK general election, four female MPs are elected in Wales -- Julie Morgan, Ann Clwyd, Betty Williams and Jackie Lawrence. Lembit Öpik becomes MP for Montgomeryshire."]}, {"page": "2006 Liberal Democrats leadership election", "response": ["Campbell's backers stressed his authority, his experience and how respected he was even beyond the party. He was described as a unity candidate who could lead the party out of a troubled period. His detractors pointed out that his experience was largely in foreign policy and described him as an unknown when it came to domestic issues. The implication was that he would lead the party in a more market liberal direction, especially given that his support included prominent figures on the right of the party like David Laws and Nick Clegg. His detractors also questioned whether he was sufficiently supportive of Kennedy prior to the resignation. Hughes's supporters also stressed his Parliamentary experience (he had been an MP longer than Campbell), charisma and his very large majority (over Lembit Öpik) in the poll of party members for the post of President two years previously. In policy terms, Hughes's opposition to any role for the market in health and education was cited. Oaten was also seen to be to the right and talked of modernising the party. He attacked the \"nanny state\" instincts of the Labour government. However, the bookmakers favoured Campbell and Hughes over him. Oaten subsequently withdrew having gained minimal support amongst MPs. Chris Huhne, an MP since 2005 but a Member of the European Parliament for six years prior to that, entered the contest last, stressing his green policies. He soon gathered support, overtaking Oaten in the betting markets.", "*:Campaign manager: Lembit Öpik. Nominators: Öpik, Mike Hancock, John Hemming, Paul Keetch, John Leech, Paul Rowen and Bob Russell. Various media outlets reported that Oaten had the tacit backing of Charles Kennedy, although this was denied by Kennedy's office. His nominators included several MPs who were prepared to nominate any serious challenger to ensure a wide contest: Mike Hancock (who was supporting Hughes), John Hemming, Paul Keetch (who was supporting Campbell), and Paul Rowen (who was supporting Hughes). Öpik remained the only MP to publicly declare his support, with Baroness Ludford the only peer."]}, {"page": "1999 Liberal Democrats leadership election", "response": ["*MPs: Colin Breed, John Burnett, Vince Cable, Menzies Campbell, David Chidgey, Brian Cotter, Ronnie Fearn, Don Foster, Andrew George, Mike Hancock, Nick Harvey, Nigel Jones, Paul Keetch, Archie Kirkwood, Richard Livsey, Robert Maclennan, Ray Michie, Michael Moore, Mark Oaten, Lembit Öpik, Mathew Taylor (campaign manager), Paul Tyler, Phil Willis, Jim Wallace.", "*MPs: Mark Oaten (Campaign manager), Lembit Öpik."]}, {"page": "Timeline of events in the 2006 Liberal Democrats leadership election", "response": ["*In the immediate aftermath of the statement, several prominent Liberal Democrats rule themselves out of standing for the leadership against Kennedy, including Mark Oaten, Lembit Öpik, and Norman Baker. Öpik gives strong support to Kennedy, but Baker was more guarded about whether there should be a new leader. Menzies Campbell reiterated that he would not stand against Kennedy.", "*Within minutes, Ed Davey and Lembit Öpik declared that they would not be candidates in the election, Davey saying he would support Campbell and Öpik saying he would support Oaten (if Oaten stands). Later that day, Öpik said he supports Oaten's strategy of consulting with the other contenders."]}, {"page": "List of Liberal Democrat MPs", "response": ["* Lembit Öpik, Montgomeryshire, 1997–2010"]}]}}