{"wiki_id": "http://www.wikidata.org/entity/Q106411313", "itemLabel": "Christopher Crackenthorp Askew", "itemDescription": "British Royal Navy officer, captain in 1822 (1782-?)", "wikipedia_url": "https://en.wikipedia.org/wiki/Christopher_Crackenthorp_Askew", "wikipedia_page": {"main": "Christopher Crackenthorp Askew (born 23 May 1782) is third surviving son of the late John Askew, Esq., of Pallinsburn, co. Northumberland, by Bridget, daughter and heiress of John Watson, Esq., of Goswick, co. Durham; and brother of the present Lieut.-Gen. Sir Hen. Askew, K.C.B., of Pallinsburn, as also of Rich. Craster Askew, Esq., Recorder of Newcastle upon Tyne.\nThis officer entered the Navy, 21 Feb. 179S, as Second-cl. Vol., on board the Vestal 28, Capt. Chas. White, and shortly afterwards accompanied a squadron under Sir Home Popham, having for its object the destruction of the locks and sluice-gates of the Bruges canal. While next attached, during a period of six years, to the Amazon 38, Capts. Edw. Riou, Sam. Sutton, and Wm. Parker, he took part in the battle of Copenhagen, 2 April 1801; assisted at the capture of two privateers, carrying between them 40 guns and 256 men; and, in 1805, accompanied Lord Nelson to the West Indies and back in pursuit of the combined fleets of France and Spain. On 4 Feb. in the latter year he appears to have been on board a prize forming part of a convoy under the protection of the Arrow and Acheron, when those vessels were captured after a brave resistance by two of the enemy's frigates. Being made Lieutenant, 27 Nov. following, into the Utrecht 64, flag-ship in the Downs of Vioe-Admiral John Holloway, he next joined in that capacity, 4 Dec. 1805, the Dictator 64, Capt. Jas. Macnamara, and, 30 Dec. 1806, the Thalia 36, Capts. Jas. Walker, Thos. Manby, and Jas. Giles Vashon. During his continuance in the last-mentioned ship, of which he ultimately became Acting-Captain, Mr. Askew proceeded to Davis Strait in supposed pursuit of two French frigates, and on his return to Europe, after a fruitless exposure of several weeks to many severe hardships, and a prolonged stay on the coast of Labrador, attended the expedition to Flushing in 1809. Being promoted, when subsequently in the West Indies, to the rank of Commander, 26 Nov. 1811, Capt. Askew next served, from 7 June 1814, to 9 Oct. 1815, in the Shamrock 12, on the Irish station. His last appointment was, 22 May 1821, to the Martin 20, fitting for the Mediterranean, where he remained, until posted, 19 July 1822. He accepted the Retirement 1 Oct. 1846.\nCapt. Askew married, 13 Feb. 1828, Sarah, third daughter of the late Patrick Dickson, of White Cross, co. Berwick, and has issue. Agents – Hallett and Robinson.", "link_mentions": [{"page": "Askew", "response": ["*Christopher Crackenthorp Askew (born 23 May 1782), Royal Navy Captain "]}, {"page": "Christopher Askew", "response": ["#REDIRECT Christopher Crackenthorp Askew"]}]}}