{"wiki_id": "http://www.wikidata.org/entity/Q1065637", "itemLabel": "Charles Nicholl", "itemDescription": "British historian and writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Charles_Nicholl_(author)", "wikipedia_page": {"main": "Charles Nicholl is an English author specializing in works of history, biography, literary detection, and travel. He has been active as a writer since the 1970s and has been publishing books since 1980. His subjects have included Christopher Marlowe, Arthur Rimbaud, Leonardo da Vinci, Thomas Nashe and William Shakespeare. He is a fellow of the Royal Society of Literature.\nNicholl was educated at King's College, Cambridge. Awards include the Daily Telegraph young writer award in 1972, which gave him tickets to the Caribbean, as a result of which he visited Colombia. \nSince his early work he has shown an interest in counterculture. In 1974 he was the winner of the Sunday Times Young Writer Award for his account of an LSD trip entitled 'The Ups and The Downs', and he has since written about such topics as the drug trade (for example in The Fruit Palace) and the Elizabethan underworld (for example in The Reckoning). \n\nBesides his literary output, Nicholl has also presented documentary programmes on television.\nHe has lectured in Britain, Italy and the United States. He also lectures on Martin Randall Travel tours.\n\n", "link_mentions": [{"page": "Christopher Marlowe", "response": ["Marlowe is alleged to have been a government spy. Park Honan and Charles Nicholl speculate that this was the case and suggest that Marlowe's recruitment took place when he was at Cambridge. In 1587, when the Privy Council ordered the University of Cambridge to award Marlowe his degree as Master of Arts, it denied rumours that he intended to go to the English Catholic college in Rheims, saying instead that he had been engaged in unspecified \"affaires\" on \"matters touching the benefit of his country\".This is from a document dated 29 June 1587, from the National Archives – Acts of Privy Council. Surviving college records from the period also indicate that, in the academic year 1584–1585, Marlowe had had a series of unusually lengthy absences from the university which violated university regulations. Surviving college buttery accounts, which record student purchases for personal provisions, show that Marlowe began spending lavishly on food and drink during the periods he was in attendance; the amount was more than he could have afforded on his known scholarship income."]}, {"page": "Leonardo da Vinci", "response": ["Houssaye postulated that the unusually large skull was an indicator of Leonardo's intelligence; author Charles Nicholl describes this as a \"dubious phrenological deduction.\" At the same time, Houssaye noted some issues with his observations, including that the feet were turned toward the high altar, a practice generally reserved for laymen, and that the skeleton of  seemed too short. Art historian Mary Margaret Heaton wrote in 1874 that the height would be appropriate for Leonardo. The skull was allegedly presented to Napoleon III before being returned to the Château d'Amboise, where they were  in the chapel of Saint Hubert in 1874. A plaque above the tomb states that its contents are only presumed to be those of Leonardo."]}, {"page": "Francis Walsingham", "response": ["Fictional portrayals of Walsingham tend to follow Catholic interpretations, depicting him as sinister and Machiavellian.Cooper, p. 189; Wilson, p. 93 He features in conspiracy theories surrounding the death of Christopher Marlowe, whom he predeceased. Charles Nicholl examined (and rejected) such theories in The Reckoning: The Murder of Christopher Marlowe (1992), which was used as a source by Anthony Burgess for his novel A Dead Man in Deptford (1993).Rozett, pp. 72–74"]}, {"page": "1992 in literature", "response": ["*James Tait Black Memorial Prize for biography: Charles Nicholl, The Reckoning: The Murder of Christopher Marlowe"]}, {"page": "Thomas Nashe", "response": ["At some time in the early 1590s Nashe produced an erotic poem, The Choise of Valentines that begins with a sonnet to \"Lord S\". It has been suggested that The Choise of Valentines was written possibly for the private circle of Ferdinando Stanley, 5th Earl of Derby (then known as Lord Strange).Charles Nicholl, ‘Nashe, Thomas (bap. 1567, d. c.1601)’, Oxford Dictionary of National Biography, Oxford University Press, 2004; online edn, Jan 2008 :‘His panegyric to ‘thrice noble Amyntas’ (Pierce Penilesse, Works, 1.243–245), written in mid-1592, is taken to refer to Ferdinando Stanley, Lord Strange. The phrasing—‘private experience’, ‘benefits received’, and so on—suggests he had already enjoyed the favours of this popular nobleman, as did many writers, among them Marlowe and Kyd, who were ‘writing for his plaiers’ about 1591 (BL, Harley MS 6849, fol. 218)...It was also for Lord Strange (‘Lord S’) that Nashe wrote the mildly obscene verses known as ‘The Choise of Valentines’ or ‘Nash his Dildo’ (Works, 3.403–416), described by Gabriel Harvey in early 1593 as ‘thy unprinted packet of bawdye and filthy rimes’ (Works of Gabriel Harvey, 2.91). It has alternatively been suggested that \"Lord S.\" refers to the Earl of Southampton, Shakespeare's patron,Nashe, Thomas. The Unfortunate Traveller. or, The life of Jacke Wilton. The Percy Reprints, no. 1, edited by H. F. B. Brett-Smith. Oxford Basil Blackwell. 1920. page 3.  just as Nashe had inscribed The Unfortunate Traveler, to \"Lord Henry Wriothesley Earl of Southampton\".Nashe, Thomas. The Unfortunate Traveller. or, The life of Jacke Wilton. The Percy Reprints, no. 1, edited by H. F. B. Brett-Smith. Oxford Basil Blackwell. 1920. page 3. Sams, Eric. The Real Shakespeare Retrieving the early years, 1564–1594. Yale University Press. 1995. page 108.", "On the question of what this poem might say about Nashe's own sexuality, Nashe biographer Charles Nicholl, says \"not a lot perhaps\", but points out that \"there is nothing second hand\" about Nashe's \"evocations of sex.\""]}, {"page": "Pericles, Prince of Tyre", "response": ["A third related work is The Painful Adventures of Pericles by George Wilkins, published in 1608. But this seems to be a \"novelization\" of the play, stitched together with bits from Twine; Wilkins mentions the play in the Argument to his version of the storyF. E. Halliday, A Shakespeare Companion 1564–1964, Baltimore, Penguin, 1964 – so that Wilkins' novel derives from the play, not the play from the novel. Wilkins, who with Shakespeare was a witness in the Bellott v. Mountjoy lawsuit of 1612,Charles Nicholl, 'The gent upstairs', Guardian 20 October 2007. has been an obvious candidate for the author of the non-Shakespearean matter in the play's first two acts; Wilkins wrote plays very similar in style, and no better candidate has been found."]}, {"page": "Doctor Faustus (play)", "response": ["The 1604 version was once believed to be closer to the play as originally performed in Marlowe's lifetime, simply because it was older. By the 1940s, after influential studies by Leo Kirschbaum and W. W. Greg, the 1604 version came to be regarded as an abbreviation and the 1616 version as Marlowe's original fuller version. Kirschbaum and Greg considered the A-text a \"bad quarto\", and thought that the B-text was linked to Marlowe himself. Since then scholarship has swung the other way, most scholars now considering the A-text more authoritative, even if \"abbreviated and corrupt\", according to Charles Nicholl.", "\"Ravished\" by magic (1.1.112), Faustus turns to the dark arts when law, logic, science, and theology fail to satisfy him. According to Charles Nicholl this places the play firmly in the Elizabethan period when the problem of magic (\"liberation or damnation?\") was a matter of debate, and when Renaissance occultism aimed at a furthering of science. Nicholl, who connects Faustus as a \"studious artisan\" (1.1.56) to the \"hands-on experience\" promoted by Paracelsus, sees in the former a follower of the latter, a \"magician as technologist\"."]}, {"page": "Royal Society of Literature", "response": ["| Charles Nicholl"]}, {"page": "The Executioner's Song", "response": ["Not all reviews were favourable, however. Charles Nicholl complained in the Daily Telegraph that Mailer perhaps overestimated the charisma of his subject, and \"is often guilty of spurious[ly] overloading ... anything that touched Gilmore\". He also added that the work was in need of a \"judicious edit\"."]}, {"page": "James Tait Black Memorial Prize", "response": ["| 1992 || Rose Tremain, Sacred Country || Charles Nicholl, The Reckoning: The Murder of Christopher Marlowe (Christopher Marlowe) || "]}, {"page": "Robert Johnson (English composer)", "response": ["Johnson joined the Carey household at an interesting time in their patronage of the arts. In 1597 Dowland dedicated his First book of songs and ayres to George Carey.Charles Nicholl, \"The Lodger: Shakespeare on Silver Street\", Penguin Books."]}, {"page": "Hawthornden Prize", "response": ["* 1998 Charles Nicholl: Somebody Else: Arthur Rimbaud in Africa"]}, {"page": "Nicholl", "response": ["* Charles Nicholl (1870–1939), Wales international rugby union player", "* Charles Nicholl (author), English historian and biographer"]}, {"page": "Ingram Frizer", "response": ["Although some contend the \"self-defence\" evidence offered at Marlowe's inquest was quite in keeping with the victim's alleged propensity for sudden violence,Honan (2005: 352) this has been brought into question by Charles Nicholl, who notes that Marlowe's supposed previous history of violence has been somewhat exaggerated.\"… he was no stranger to violence… but [the evidence does not] prove much about him as an aggressor\": Nicholl (1993: 86–87) The tendency, particularly by Park Honan, to portray Marlowe as violent is challenged by Rosalind Barber in her essay \"Was Marlowe a Violent Man?\"."]}, {"page": "Leonardo da Vinci: The Flights of the Mind", "response": ["Leonardo da Vinci: Flights of the Mind is a 2004 biography of Leonardo da Vinci by Charles Nicholl."]}, {"page": "The Reckoning", "response": ["* The Reckoning: The Murder of Christopher Marlowe, a book by Charles Nicholl"]}, {"page": "Richard Creagh", "response": ["It has been said that Creagh was poisoned in prison, and this, whether true or false, was widely believed at the time of his death. . His date of death is given as 14 October 1585 in:  The principal suspect was the notorious double agent Robert Poley, best known for his role as agent provocateur in the Babington Plot and his suspected role in the killing of Christopher Marlowe. Poley, who was a fellow prisoner in the Tower during Creagh's last years there, is said to have visited him several times, but the suspicion seems to be based on his general bad character, rather than on any direct evidence of his guilt.Charles Nicholl   The Reckoning; the Murder of Christopher Marlowe 2nd Edition Random House 2002 p.193"]}, {"page": "Bellott v Mountjoy", "response": ["Charles Nicholl and others have identified Marie Mountjoy with the Mary Mountjoy, born circa 1568, who was a client of the astrologer Simon Forman in 1597 (for example, after losing a ring).Lauren Kassell, Michael Hawkins, Robert Ralley, John Young, Joanne Edge, Janet Yvonne Martin-Portugues, and Natalie Kaoukji (eds.). ‘CASE2835’, The casebooks of Simon Forman and Richard Napier, 1596–1634: a digital edition, https://casebooks.lib.cam.ac.uk/cases/CASE2835, accessed 5 August 2019.Nicholl, Charles. The Lodger Shakespeare: His Life on Silver Street. New York: Viking, 2007. (UK title The Lodger: Shakespeare on Silver Street)"]}, {"page": "Dolly Walker-Wraight", "response": ["* The Real Christopher Marlowe, an open letter to Charles Nicholl (1992)"]}, {"page": "Eleanor Bull", "response": ["Eleanor is known because it was at her house in which Christopher Marlowe was killed by stabbing during a quarrel with Ingram Frizer. Also present were Nicholas Skeres and Robert Poley. All had spent most of the day at Bull's house, apparently engaged in conversation, eating and drinking. At the inquest it was stated that the quarrel was over the bill (known as \"the reckoning\") for the day's events. Leslie Hotson, who first identified the documents relating to the inquest described Bull's house as a \"tavern\", leading to accounts of her as a kind of Mistress Quickly of Deptford \"who is always ready to let a room for some disreputable purpose\".H. N. Gibson, The Shakespeare Claimants: A Critical Survey of the Four Principle Theories concerning the Authorship of the Shakespearean Plays, Barnes & Noble, 1962, p.129. However, Charles Nicholl noted her genteel social connections, and stated that she was a \"woman of substance, well-born and well-connected, not at all the shabby old ale-house keeper she is often portrayed as.\"Charles Nicholl, The Reckoning: The Murder of Christopher Marlowe, p.36", "*The Reckoning: The Murder of Christopher Marlowe by Charles Nicholl [Vintage; New Ed edition (3 Oct 2002)]"]}, {"page": "Richard Martin (Lord Mayor of London)", "response": ["In March 1595 Martin raided the house of Edmund Williamson in Philip Lane, Cripplegate, after his brother Nicholas Williamson was arrested for treason. Martin discovered that Edmund Williamson ran a kind of pawnbroking business from his house, obtaining luxury goods from young men for small sums, less than their worth.HMC Salisbury Hatfield, vol. 5 (London, 1894), pp. 141-2. Nicholas Skeres, an associate of Christopher Marlowe involved in the credit racket, was taken by Martin and held for a few days.Constance Brown Kuriyama, Christopher Marlowe: A Renaissance Life (Cornell University Press, 2002), p. 103: Charles Nicholl, The Reckoning: The Murder of Christopher Marlowe (London, 2002), pp. 34-5."]}, {"page": "CWA Gold Dagger for Non-Fiction", "response": ["* Charles Nicholl, The Reckoning"]}, {"page": "Penguin Celebrations", "response": ["*Charles Nicholl - Leonardo da Vinci: Flights of the Mind"]}, {"page": "Ernest Delahaye", "response": ["Ernest Delahaye (1853–1930) was a French writer and essayist. He maintained a long and close friendship with Arthur Rimbaud with whom he first met in April 1865 when they attended school together in Charleville in the Ardennes region of France. He and Rimbaud had a shared interest in poetry, and he would help Rimbaud by making fair copies of his drafts for distribution to Rimbaud's literary friends. He was one of the few (seven) recipients of the privately printed A Season in Hell, though Rimbaud later asked for it back to give it to someone else. According to Rimbaud biographer, Charles Nicholl, Rimbaud's \"[last] strictly dateable poem\" was contained in a letter to Delahaye of 14 October 1875. Through Rimbaud, Delahaye also met poet Paul Verlaine and became friendly with him. Verlaine wrote a poem - Sonnet Boiteux - which is dedicated to him. Delahaye mixed his civil service career, working at the Education Ministry, with writing biographical material on both Rimbaud and Verlaine, contributing first-hand accounts of the poets' lives and families. Most of Delahaye's correspondence with Rimbaud and Verlaine survives."]}, {"page": "Charles Nicoll", "response": ["#REDIRECT Charles Nicholl (author)"]}, {"page": "Marlowe portrait", "response": ["Below this is a Latin motto, Quod me nutrit me destruit, in English That which nourishes me destroys me. This wording has not been found in other texts, but it reflects a common Elizabethan sentiment. Author Charles Nicholl suggests that it is a version of Quod me alit me extinguit (That which feeds me extinguishes me), an Elizabethan motto which appears in the poet Samuel Daniel's 1585 work The Worthy Tract of Paulus Jovius, and later in William Shakespeare's Pericles, Prince of Tyre, c. 1607, and his Sonnet 73, 1609."]}]}}