{"wiki_id": "http://www.wikidata.org/entity/Q1064298", "itemLabel": "Charles Evans", "itemDescription": "British mountain climber", "wikipedia_url": "https://en.wikipedia.org/wiki/Charles_Evans_(mountaineer)", "wikipedia_page": {"main": "Sir Robert Charles Evans M.D., DSc, (19 October 1918 – 5 December 1995) was a British mountaineer, surgeon, and educator. He was leader of the 1955 British Kangchenjunga expedition and deputy leader of the 1953 British Mount Everest expedition, both of which were successful.", "link_mentions": [{"page": "December 5", "response": ["*  1995   – Charles Evans, English mountaineer, surgeon, and educator (b. 1918)"]}, {"page": "Kangchenjunga", "response": ["In 1955, Joe Brown and George Band made the first ascent on 25 May, followed by Norman Hardie and Tony Streather on 26 May. The full team also included John Clegg (team doctor), Charles Evans (team leader), John Angelo Jackson, Neil Mather, and Tom Mackinnon.", "* Charles Evans Kangchenjunga The Untrodden Peak, Hodder & Stoughton, Leader of the 1955 expedition. Principal of the University College of North Wales, Bangor. Foreword by His Royal Highness the Duke of Edinburgh, K.G.", "* Charles Evans; George Band 1956. Kangchenjunga Climbed. The Geographical Journal 122 (1): 1–12.", "* Charles Evans 1956. \"Kangchenjunga: The Untrodden Peak\". The Times Literary Supplement."]}, {"page": "May 25", "response": ["*  1955   – First ascent of Mount Kangchenjunga: On the British Kangchenjunga expedition led by Charles Evans, Joe Brown and George Band reach the summit of the third-highest mountain in the world (8,586 meters); Norman Hardie and Tony Streather join them the following day."]}, {"page": "October 19", "response": ["*1918 – Charles Evans, English-Welsh mountaineer, surgeon, and educator (d. 1995)"]}, {"page": "1955", "response": ["* May 25 – Joe Brown and George Band are the first to attain the summit of Kangchenjunga in the Himalayas, as part of the British Kangchenjunga expedition led by Charles Evans."]}, {"page": "Mount Everest", "response": ["Birds, such as the bar-headed goose, have been seen flying at the higher altitudes of the mountain, while others, such as the chough, have been spotted as high as the South Col at .The Ascent of Everest by John Hunt (Hodder & Stoughton, 1953) In chapter 14, Hunt describes seeing a chough on the South Col; meanwhile Charles Evans saw some unidentified birds fly over the col Yellow-billed choughs have been seen as high as  and bar-headed geese migrate over the Himalayas. In 1953, George Lowe (part of the expedition of Tenzing and Hillary) said that he saw bar-headed geese flying over Everest's summit.", "In 1953, a ninth British expedition, led by John Hunt, returned to Nepal. Hunt selected two climbing pairs to attempt to reach the summit. The first pair, Tom Bourdillon and Charles Evans, came within  of the summit on 26 May 1953, but turned back after running into oxygen problems. As planned, their work in route finding and breaking trail and their oxygen caches were of great aid to the following pair. Two days later, the expedition made its second assault on the summit with the second climbing pair: the New Zealander Edmund Hillary and Tenzing Norgay, a Nepali Sherpa climber. They reached the summit at 11:30 local time on 29 May 1953 via the South Col route. At the time, both acknowledged it as a team effort by the whole expedition, but Tenzing revealed a few years later that Hillary had put his foot on the summit first. They paused at the summit to take photographs and buried a few sweets and a small cross in the snow before descending."]}, {"page": "Edmund Hillary", "response": ["In 1952, Hillary learned that he and Lowe had been invited by the Joint Himalayan Committee for the 1953 British attempt and immediately accepted. Shipton had been named as leader but was replaced by Hunt. Hillary objected but was immediately impressed by Hunt's energy and determination. Hunt asked Charles Evans and Hillary to form with him a small three-man planning group on the expedition. Hunt wrote that:", "Hillary had hoped to climb with Lowe, but Hunt named two teams for the ascent: Tom Bourdillon and Charles Evans; and Hillary and Tenzing. Hillary, therefore, made a concerted effort to forge a working friendship with Tenzing. Hillary wrote, \"Tenzing had substantially greater personal ambition than any Sherpa I had met.\""]}, {"page": "1957 in literature", "response": ["*Charles Evans – Kangchenjunga: The Untrodden Peak"]}, {"page": "List of climbers and mountaineers", "response": ["* Charles Evans (1918–1995) UK, Alps, Wales, leader of Kangchenjunga first ascent 1955 British Kangchenjunga expedition"]}, {"page": "Tenzing Norgay", "response": ["Working slowly, the expedition set up their penultimate camp at the South Col, at . On 26 May, Tom Bourdillon and Charles Evans attempted the climb, but turned back when Evans' oxygen system failed. The pair had reached the South Summit, coming within 300 vertical feet (91 m) of the summit. Hunt then directed Norgay and Hillary to go for the summit."]}, {"page": "Death zone", "response": ["Mountaineers use supplemental oxygen in the death zone to reduce deleterious effects. An open-circuit oxygen apparatus was first tested on the 1922 and 1924 British Mount Everest expeditions; the bottled oxygen taken in 1921 was not used (see George Finch and Noel Odell).  In 1953 the first assault party of Tom Bourdillon and Charles Evans used closed-circuit oxygen apparatus. The second (successful) party of Ed Hillary and Tenzing Norgay used open-circuit oxygen apparatus; after ten minutes taking photographs on the summit without his oxygen set on, Hillary said he \"was becoming rather clumsy-fingered and slow-moving\".  "]}, {"page": "Imja Tse", "response": ["The southwest summit of Imja Tse was first climbed in 1953 as part of a training exercise by a British expedition that went on to summit Mount Everest. The team who climbed Imja Tse comprised Tenzing Norgay, Charles Evans, Alfred Gregory, Charles Wylie and seven other Sherpas. The main summit was first climbed in 1956 by Hans-Rudolf Von Gunten and two unknown Sherpas, members of a Swiss team that went on to make the second ascent of Everest and first ascent of Lhotse.O'Connor, Bill. The Trekking Peaks of Nepal. The Crowood Press, 1989, p.74"]}, {"page": "Robert Evans (disambiguation)", "response": ["*Charles Evans (mountaineer) (Robert Charles Evans, 1918–1995), British mountaineer, surgeon, and educator"]}, {"page": "John Hunt, Baron Hunt", "response": ["Base Camp was established on 12 April 1953. The next few days were taken up with establishing a route through the Khumbu Icefall, and once opened, teams of Sherpas moved tons of supplies up the mountain. A succession of advanced camps were created, slowly forging higher up the mountain. By 21 May, Wilfrid Noyce and Annullu had reached the psychological milestone of the South Col. Hunt had selected two climbing pairs to attempt the summit. The first pair (Tom Bourdillon and Charles Evans) set out on 26 May but were forced to turn back after becoming exhausted high on the mountain. On the same day, Hunt himself climbed to  with Da Namgyal Sherpa to leave a cache of equipment on the Southeast Ridge for the second summit party. On 28 May, the expedition made its second assault on the summit with the second climbing pair. The summit was eventually reached at 11:30 am on 29 May 1953 by the New Zealander Edmund Hillary and Sherpa Tenzing Norgay from Nepal (Norgay had previously ascended to a record mark on Everest with a Swiss expedition of 1952)."]}, {"page": "Oxford University Mountaineering Club", "response": ["The club has taken a significant part in the development of mountaineering in the United Kingdom, and many famous British climbers have been members of the club. Andrew Irvine was at Merton College and was a member of the OUMC at the time of his fatal attempt to climb Everest with George Mallory. Tom Bourdillon (whose father was one of the club's founders), Charles Evans and Michael Westmacott, all former members of the OUMC, were members of the successful 1953 British Expedition to Everest. Evans was Deputy Leader to John Hunt on that expedition, Bourdillon was responsible for the oxygen apparatus, and Westmacott was in charge of keeping the dangerous passage through the Khumbu Icefall open. Bourdillon and Evans made the first attempt on the summit, on 26 May 1953, three days before the successful climb by Sir Edmund Hillary and Tenzing Norgay. They reached the South Summit (at 8750 m then the highest summit to have been climbed), but had to turn back due to severe exhaustion. Charles Evans was later the Leader of the first successful expedition to Kangchenjunga in 1955.", "*Charles Evans (1918–1995), New College "]}, {"page": "Pen-y-Gwryd", "response": ["The hotel's most notable mountaineering link is to the first successful Everest expedition in 1953 and the first successful Kangchenjunga expedition in 1955, where training and testing of oxygen equipment for those expeditions took place, at Helyg near Capel Curig. On the right at the hotel entrance there is a Tyrolean-style Stüberl (dining room) with the signatures, written on the ceiling, of the teams that did the first ascent of Everest in 1953 and of the first ascent of Kangchenjunga in 1955 – these include Sir Edmund Hillary, Tenzing Norgay, Sir John Hunt, Charles Evans, George Band, Joe Brown, John Angelo Jackson, Wilfred Noyce,  Tony Streather, Tom Mackinnon, Norman Hardie, Neil Mather, John Clegg and others, including Noel Odell from Mallory's 1924 expedition and Chris Bonington of later successes. There are many photographs and exhibits provided by the original team members in the main bar and guest lounge. In the past each year, now every five years, Pen-y-Gwryd hosts the Everest and Kangchenjunga reunions."]}, {"page": "Hillary Step", "response": ["The step had been seen by the first assault party of Tom Bourdillon and Charles Evans when they reached the South Summit on 26 May 1953 at 13:00 (too late to attempt the summit). Seated on the snow dome, they could look closely at the last  ascent to the summit. It was not the gentle snow ridge they had hoped for, but a thin crest of snow and ice on rock, steep on the left, overhanging as a cornice on the right. It was interrupted by a formidable-looking  rock step two-thirds of the way up."]}, {"page": "Timeline of Mount Everest expeditions", "response": ["*      In 1953, a ninth British expedition, led by John Hunt and organized and financed by the Joint Himalayan Committee, returned to Nepal. Hunt planned for three assaults of two climbers each, including \"a third and last attempt\" if necessary after a delay of some days. After Wilfrid Noyce and Annullu had forced a passage to the South Col, two climbing pairs previously selected by Hunt attempted to reach the summit. The first pair, Charles Evans and Tom Bourdillon, using closed-circuit oxygen sets  achieved the first ascent of the  South Summit, within as little as  of the final summit, but could go no further because of oxygen equipment problems and lack of time. Two days later, the second assault was made with the fittest and most determined climbing pair. Using conventional open-circuit oxygen sets, the summit was eventually reached at 11:30 a.m. local time on May 29, 1953 by the New Zealander Edmund Hillary and Tenzing Norgay, a Nepali, climbing the South Col route. They paused at the summit to take photographs, Hillary saying after ten minutes taking photographs on the summit without his oxygen set on that he \"was becoming rather clumsy-fingered and slow-moving\". They buried a few sweets and a small cross in the snow before descending. Although they characterized it as the culmination of a team effort by the whole expedition, there was intense public speculation as to which of the pair had set foot on the summit first. In 1955 Tenzing disclosed in his autobiography that it was Hillary. News of the expedition's success reached London on the morning of Queen Elizabeth II's coronation. Times reporter James Morris sent a coded message by runner to Namche Bazaar, where a wireless transmitter was used to relay the message to London. The conquest of Everest was probably the last major news item to be delivered to the world by runner. Returning to Kathmandu a few days later, Hillary and Hunt discovered that they had been knighted for their efforts."]}, {"page": "1955 in Wales", "response": ["*18 April–28 May – Charles Evans leads the mountaineering expedition that conquers Kanchenjunga."]}, {"page": "Alpine Club (UK)", "response": ["*1968–1971: Charles Evans"]}, {"page": "List of Old Salopians", "response": ["* Charles Evans (1918–1995), surgeon and mountaineer"]}, {"page": "Robert Charles Evans", "response": ["#REDIRECT Charles Evans (mountaineer)"]}, {"page": "Gold Medal (RGS)", "response": ["|Charles Evans"]}, {"page": "Welsh Sports Hall of Fame", "response": ["* Sir Charles Evans (Mountaineering) *"]}, {"page": "1955 in the United Kingdom", "response": ["* 25 May – Joe Brown and George Band are the first to attain the summit of Kanchenjunga, as part of a British team led by Charles Evans."]}, {"page": "Tom Bourdillon", "response": ["With his father, Robert Bourdillon, he developed the closed-circuit bottled oxygen apparatus used by Charles Evans and himself on their pioneering climb to the South Summit  of Everest on 26 May 1953. Bourdillon could well have been either the first or second man to officially summit Everest, but he was forced back when Evans's oxygen system failed. The pair came within three hundred feet of the Main Summit; both turning back after reaching the South Summit. Three days later, Hunt directed Edmund Hillary and Tenzing Norgay to go for the Main Summit, using open-circuit equipment; which they reached on 29 May 1953. Bourdillon never attempted an Everest expedition again."]}, {"page": "Charles Evans", "response": ["Charles Evans may refer to:", "*Charles Evans (businessman) (1926–2007), fashion executive and producer of the film Tootsie", "*Charles Evans Jr. (born 1963), his son, film producer", "*Carlo Burton, aka Charles Evans, film actor, producer and director", "*Charles Evans (cricketer, born 1866) (1866–1956), English cricketer", "*Charles Evans (cricketer, born 1851) (1851–1909), English cricketer and British Army officer", "*Charles Evans (footballer) (1897–1939), Welsh footballer", "*Chuck Evans (American football) (Charles Evans, 1967–2008), American football fullback", "*Charles Evans (politician) (1882–1947), Liberal party member of the Canadian House of Commons", "*Charles Evans Hughes (1862–1948), American Republican politician and Chief Justice of the U.S. Supreme Court ", "*Charles Evans Hughes Jr. (1889–1950), American Solicitor General", "*Charles Evans Whittaker (1901–1973), American Associate Justice of the Supreme Court", "*Charles Evans (Royal Navy officer) (1908–1981),", "*Charles Evans (librarian) (1850–1935), American librarian and bibliographer", "*Sir Charles Evans (mountaineer) (1918–1995), UK mountaineer, surgeon, and educator", "*Charles Evans Hughes III (1915–1985), American architect", "*Charles Evans (colonial businessman) (1827–1881)"]}, {"page": "Dennis Davis (climber)", "response": ["In 1957, Dennis and Charles Evans, as a two-man team without supplementary oxygen, climbed Annapurna IV before making an ambitious, but unsuccessful attempt on Annapurna II."]}, {"page": "Wilfrid Noyce", "response": ["At the initial meeting of the Everest team at the premises of the Royal Geographical Society on 17 November 1952, Noyce was designated as being charge of writing (meaning the dispatches that were to be sent home from the mountain) and \"volunteered to help with the packing\" (he aided Stuart Bain with this).South Col, pp. 2–3 On the walk-in to the mountain, Noyce, together with Charles Evans, who had been designated as in charge of stores at the RGS meeting, were designated as the \"baggage party\", in charge of the clothing and equipment for the approach.The Ascent of Everest, p. 63. Noyce was also in charge of mountaineering equipment on the ascent itself, having been instructed in the repair of high-altitude boots (\"I had worked for three days with Robert Lawrie's bootmakers, learning chiefly how to stick on micro-cellular rubber soles and heels\").South Col, p. 30 Noyce's skills in boot repair were in demand on the ascent; according to Charles Wylie, the thin Vibram soles that were used on the boots often peeled off at the toes but Noyce \"saved the situation with some really professional repair work\".Charles Wylie, 'Notes on Certain Items of Equipment', Appendix IV in The Ascent of Everest, p. 252. Noyce compiled Appendix 1, 'Diary of the Expedition', in The Ascent of Everest, pp. 235–40."]}, {"page": "World altitude record (mountaineering)", "response": ["Mount Everest was climbed the following year. On 26 May, three days before the successful attempt, Tom Bourdillon and Charles Evans reached the South Summit before turning back due to malfunctioning oxygen apparatus. Their height of 8,760 m (28,750 ft) represented a new, short lived, altitude record, and can be seen as a summit record if this is taken to include minor tops as well as genuine mountains.Unsworth (2000), p. 329 Edmund Hillary and Tenzing Norgay finally reached the 8,848 m (29,029 ft) true summit on 29 May 1953, marking the final chapter in the history of the mountaineering altitude record.Unsworth (2000), pp. 334-337 While the exact height of Everest's summit is subject to minor variation due to the level of snow cover and the gradual upthrust of the Himalaya, significant changes to the world altitude record are now impossible."]}, {"page": "Bangor University", "response": ["* Charles Evans, Principal 1958–1984"]}, {"page": "Derwen", "response": ["* Charles Evans (mountaineer) (1918-1995)"]}, {"page": "List of Fliers' & Explorers' Globe Signers", "response": ["* Charles Evans  "]}, {"page": "Bottled oxygen (climbing)", "response": ["In 1953 the first assault party of Tom Bourdillon and Charles Evans used closed-circuit oxygen apparatus which had been developed by Bourdillon and his father, and returned expired oxygen to the breathing bag.  The successful second assault party of Ed Hillary and Tenzing Norgay used open-circuit oxygen apparatus; after ten minutes taking photographs on the summit without his oxygen set on, Hillary said he \"was becoming rather clumsy-fingered and slow-moving\". "]}, {"page": "1953 British Mount Everest expedition", "response": ["Several members of the British expedition had a strong loyalty to Shipton and were unhappy that he had been replaced. Charles Evans, for instance, stated, \"It was said that Shipton lacked the killer instinct – not a bad thing to lack in my view.\" Edmund Hillary was among those most opposed to the change, but he was won over by Hunt's personality and by his admission that the change had been badly handled.Jim Perrin, Obituary — Sir Edmund Hillary from The Guardian dated 11 January 2008 online George Band recalls Committee member Larry Kirwan, the Director/Secretary of the Royal Geographical Society, saying that \"they had made the right decision but in the worst possible way\".Band, Everest Exposed, p. 116", "Hunt planned for three assaults of two climbers each including \"a third and last attempt\" if necessary, although after two consecutive assaults; a wait for some days would be necessary to \"recover our strength\" and to replenish the camps. The plan for the first two assaults had been announced by Hunt on 7 May. The first assault party using closed-circuit oxygen equipment was to start from Camp VIII and aim to reach the South Summit (and if possible the Summit), composed of Tom Bourdillon and Charles Evans as only Bourdillon could cope with the experimental sets. The second assault party using open-circuit oxygen equipment was to be the strongest climbing pair, Ed Hillary and Tenzing Norgay; to start from Camp IX higher on the South Col. The third assault party would have been Wilf Noyce and Mike Ward.", "The first of two climbing pairs previously selected by Hunt, Tom Bourdillon and Charles Evans, set out for the summit on 26 May. They successfully made the first ascent of the  South Summit at 1 pm, coming within  of the final summit. They could see that between the South Summit and the Summit was a thin crest of snow and ice on rock, with a rock step (the Hillary Step). Before starting Evans had a problem with a damaged valve in his oxygen set which took over an hour to fix; then they climbed at the unprecedented rate of almost  per hour. At  feet when they changed soda lime canisters, Evans' set had another problem which Bourdillon could not fix; Evans kept going but his breathing was painfully laboured. They reached the South Summit at 1 pm (at that time the highest summit climbed), but were forced to turn back at 1.20 pm after becoming exhausted, defeated by problems with the closed-circuit oxygen sets and lack of time.", "| Charles Evans"]}, {"page": "South Summit (Mount Everest)", "response": ["The peak is a dome-shaped peak of snow and ice, and is connected to the summit of Mount Everest by the Cornice Traverse and Hillary Step. It was first climbed by Charles Evans and Tom Bourdillon of the 1953 British Mount Everest expedition on 26 May 1953.  They arrived at 1 pm, too late to continue on to the primary summit because of problems with Evans' oxygen set, but Edmund Hillary and Tenzing Norgay, the next pair to make a summit bid, traversed the South Summit to reach the main peak on 29 May. The distance separating the two summits is approximately ."]}, {"page": "May 1955", "response": ["*Joe Brown and George Band are the first to attain the summit of Kangchenjunga in the Himalayas, as part of the British Kangchenjunga expedition led by Charles Evans."]}, {"page": "1951 British Mount Everest reconnaissance expedition", "response": ["When Shipton returned home and was called to a meeting of the Himalayan Committee on 28 July 1952, he still did not know his leadership had been called into question. His main opponents were not present and no one liked to tell him what had been happening. Shipton, indeed, expressed his own doubts about his leadership – he preferred small, exploratory, trekking-style expeditions and disliked a competitive element. Nonetheless, the committee said he was their choice as leader and supported his proposal for Charles Evans to be co-leader. Behind the scenes Hunt was offered the co-leadership and when the two men met and discovered they had been told different stories they were both dismayed. Hunt thought his chance at Everest had gone. At the next meeting of the committee, it was Shipton's allies who were not there and Shipton was asked to leave the room while the leadership was discussed. When he returned he was told his involvement could only be as co-leader and even that would have to be surrendered once Base Camp had been reached. He was told a man of \"dynamic personality, drive and enthusiasm\" was required. The Committee went on to send a telegram to Hunt appointing him as leader without waiting for Shipton to reply. Shipton decided he would not take part in the expedition."]}, {"page": "Norman Hardie", "response": ["In London, he lived with other climbers from New Zealand. After Edmund Hillary's successful first ascent of Mount Everest, the New Zealand Alpine Club organised an expedition into the Barun Valley in Nepal in 1954. Hardie's role was to survey and map the routes up to Makalu, the fifth highest mountain in the world. He became close friends with Charles Evans during the expedition. When Evans received a telegram during the expedition inviting him to lead an attempt to climb Kangchenjunga in the next season, he asked Hardie to join him. Kangchenjunga, the third-highest mountain, was then the highest unclimbed peak."]}, {"page": "Deaths in December 1995", "response": ["*Charles Evans, 77, British mountaineer, surgeon, and educator."]}, {"page": "1952 British Cho Oyu expedition", "response": ["The expedition members were Eric Shipton, Charles Evans, Tom Bourdillon, Ray Colledge, Alfred Gregory and Griffith Pugh (UK); from NZ Ed Hillary, George Lowe and Earle Riddiford, and from Canada Campbell Secord (Michael Ward was not available as he was completing his national military service and sitting an surgery examination). The expedition sailed on 7 March from Southampton; except for Shipton, Pugh and Secord who flew out later.", "Bourdillon decided that the best combination was a closed-circuit apparatus breathing pure oxygen for climbing and an open-circuit set giving a comparatively low concentration of oxygen for sleeping. With his father, Robert Bourdillon, he developed the closed-circuit oxygen apparatus used by Charles Evans and himself on their pioneering climb to the South Summit of Everest on 26 May 1953."]}]}}