{"wiki_id": "http://www.wikidata.org/entity/Q1066875", "itemLabel": "Charlie Creed-Miles", "itemDescription": "British actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Charlie_Creed-Miles", "wikipedia_page": {"main": "Charlie Creed-Miles (born 24 March 1972) is an English actor and musician.Creed-Miles was born in Nottingham, and had his first starring screen role, aged 21, in The Punk (1993). His brief relationship with actress Samantha Morton (with whom he co-starred in The Last Yellow) produced a daughter, Esme Creed-Miles, born in 2000.", "link_mentions": [{"page": "Press Gang", "response": ["* Danny McColl (Charlie Creed-Miles) the paper's photographer. Creed-Miles became disenchanted with his minor role and left after the second series."]}, {"page": "1996 in film", "response": ["| The Young Poisoner's Handbook || C/FP Distribution || Benjamin Ross (director/screenplay); Jeff Rawle (screenplay); Hugh O'Conor, Tobias Arnold, Ruth Sheen, Roger Lloyd-Pack, Norman Caro, Charlotte Coleman, Jack Deam, Vilma Hollingbery, Frank Mills, Rupert Farley, Malcolm Sinclair, Charlie Creed-Miles, Antony Sher, Cate Fowler, Hazel Douglas, Arthur Cox, John Thomson, Simon Kunz, Tim Potter, Dorothea Alexander, Paul Stacey, Samantha Edmonds, Robert Dem, Peter Pacey, Joost Siedhoff, Dirk Robertson, John Abbott, Jean Warren, Frank Coda, Anna Kollenda, Katja Kollenda || Black Comedy, Crime, Drama || Live action"]}, {"page": "1997 in film", "response": ["| The Fifth Element || Columbia Pictures || Luc Besson (director/screenplay); Robert Mark Kamen (screenplay); Bruce Willis, Gary Oldman, Milla Jovovich, Ian Holm, Chris Tucker, Luke Perry, Brion James, Tommy \"Tiny\" Lister Jr., Lee Evans, Charlie Creed-Miles, Tricky, John Neville, John Bluthal, Mathieu Kassovitz, Christopher Fairbank, Kim Chan, Al Matthews, Maiwenn Le Besco || Sci-Fi, Action || Live action"]}, {"page": "1998 in film", "response": ["| Nil by Mouth || 20th Century Fox / ARP Selection / EuropaCorp / SE8 GROUP || Gary Oldman (director/screenplay); Ray Winstone, Kathy Burke, Charlie Creed-Miles, Laila Morse, Edna Doré, Chrissie Cotterill, Jon Morrison, Jamie Foreman, Steve Sweeney || Drama || Live action"]}, {"page": "1992 in film", "response": ["| London Kills Me || Fine Line Features / PolyGram Filmed Entertainment / Working Title Films / Channel Four Films || Hanif Kureishi (director/screenplay); Justin Chadwick, Steven Mackintosh, Emer McCourt, Roshan Seth, Fiona Shaw, Brad Dourif, Tony Haygarth, Eleanor David, Alun Armstrong, Nick Dunning, Naveen Andrews, Rowena King, Stevan Rimkus, Ben Peel, Danny John-Jules, Paudge Behan, Yemi Goodman Ajibade, Sandy McDade, Tracey MacLeod, Philip Glenister, Charlie Creed-Miles, Karl Collins, Sean Pertwee, Pippa Hinchley, Marianne Jean-Baptiste, Garry Cooper, Gordon Warnecke, Dave Atkins || Comedy, Drama || Live action"]}, {"page": "Samantha Morton", "response": ["Morton dated actor Charlie Creed-Miles, whom she met on the set of the film The Last Yellow, in 1999. They broke up when Morton was 15 weeks pregnant with their daughter, actress Esme Creed-Miles, born 5 February 2000."]}, {"page": "The Upper Hand (TV series)", "response": ["*Al (Charlie Creed-Miles) - Auntie Pat's uncle (although several years younger than her). A former young offender, he attempts to turn his life around by training as a hairdresser. Charlie takes him under his wing, but is less keen on having him around when he spots an attraction between Al and Jo."]}, {"page": "The Young Poisoner's Handbook", "response": ["*Charlie Creed-Miles – Berridge"]}, {"page": "Charles II: The Power and the Passion", "response": ["The edited American version also leaves out Charles's trickery of George Villiers, Duke of Buckingham (played by Rupert Graves) regarding the treaty's secret provision.  Thus, Buckingham's later opposition to Charles's insistence that his brother James (later James II played by Charlie Creed-Miles) inherit the throne appears to be motivated by merely spite and jealousy rather than a feeling of betrayal.", "*Charlie Creed-Miles ... James, Duke of York"]}, {"page": "4.50 from Paddington", "response": ["**Charlie Creed-Miles – Harold Crackenthorpe"]}, {"page": "Faith in the Future", "response": ["*Jools (Charlie Creed-Miles - (Series 1); Simon Pegg - Series 2-3) - A kind-hearted, but somewhat naive, young man who becomes obsessed with Hannah after she is dumped by his friend Nick. He is notoriously clumsy and accident-prone (to the point that he thinks it is his fault when a tree crashes through Faith's window). Although other women, including Hannah's friend Caroline and Faith's friend June, show an interest in him, Jools only has eyes for Hannah, despite her continuing disparagement of him."]}, {"page": "Sarah Quintrell", "response": ["Quintrell's writing debut, Ellen, was broadcast on Channel 4 in late 2016. Directed by Mahalia Belo and starring Jessica Barden, Yasmin Monet Prince, Jaime Winstone, Joe Dempsie and Charlie Creed-Miles. Ellen won the Broadcast Television Award Best Single Drama 2017, Writers' Guild Great Britain Best Short Form Drama 2017, BAFTA Cymru Feature/Television Film 2017 and the Prix Italia TV Drama 2017. Quintrell was nominated for the BAFTA Breakthrough Talent Award at the 2017 BAFTA Craft Awards."]}, {"page": "Nil by Mouth (film)", "response": ["* Charlie Creed-Miles as Billy"]}, {"page": "Glastonbury the Movie", "response": ["* Charlie Creed-Miles", "and extended appearances from The Lemonheads, Omar, The Orb, Spiritualized, Roy Harper, The Verve, Perry Farrell / Porno For Pyros, Back To The Planet, Chuck Prophet, Airto Moreira, Evan Dando, Louise Goffin, Andy Guithrie, Ozric Tentacles, Kickshaw, McKoy, Si Begg, The Co-Creators, Cristian Vogel, Dr Didg, The Filberts, X-Productions, Bender, Charlie Creed-Miles, Dexter Fletcher"]}, {"page": "London Kills Me", "response": ["* Charlie Creed-Miles as Kid in Lift"]}, {"page": "Loved Up", "response": ["* Danny - Charlie Creed-Miles"]}, {"page": "Charlie Creed Miles", "response": ["#REDIRECT Charlie Creed-Miles"]}, {"page": "Charles Creed Miles", "response": ["#REDIRECT Charlie Creed-Miles"]}, {"page": "Creed (surname)", "response": ["*Charlie Creed-Miles (born 1972), British actor"]}, {"page": "Miles (surname)", "response": ["*Charlie Creed-Miles, English actor"]}, {"page": "Birmingham Boys", "response": ["In the BBC television series Peaky Blinders a fictionalised version of Billy Kimber was portrayed by Charlie Creed-Miles."]}, {"page": "Five Days (TV series)", "response": ["The police begin a house to house investigation. Meanwhile, DC Stephen Beam (Charlie Creed-Miles) wakes up Sarah Wheeler (Sarah Smart), who has jet-lag and is disoriented. On learning the time from Beam, she dashes out of her flat, and opens a shed door to dump her rubbish. There, crouching in the darkness, she finds Ethan, and the dog. Ethan says that he was supposed to look after Rosie. Sarah is seen as a heroine for finding him. Ethan tells the police that his dog bit a man, who had a dirty white van. Kyle's mother Hazel (Margot Leicester) becomes suspicious of his actions. His hand is damaged, and he begins to wash his white van every day despite previously never washing it."]}, {"page": "You and I (2008 film)", "response": ["You and I (; also known by its working title, Finding t.A.T.u.) is a 2008 drama film directed by Roland Joffé depicting a fictionalised version of real events adapted from the novel t.A.T.u. Come Back. The film features Mischa Barton, Anton Yelchin, Charlie Creed-Miles, Helena Mattsson, Alexander Kaluzhsky, Bronson Pinchot and Shantel VanSanten. The film is about a teenage girl, Lana, who moves from a rural town in Russia to Moscow, completely unaware that meeting an internet girlfriend, Janie, will result in a string of adventures."]}, {"page": "25th Brit Awards", "response": ["! width=\"50%\" | International Female Solo Artist(presented by Charlie Creed-Miles)"]}, {"page": "List of American films of 2004", "response": ["| King Arthur || Touchstone Pictures / Jerry Bruckheimer Films || Antoine Fuqua (director); David Franzoni (screenplay); Clive Owen, Keira Knightley, Ioan Gruffudd, Stephen Dillane, Stellan Skarsgård, Ray Winstone, Hugh Dancy, Ray Stevenson, Til Schweiger, Mads Mikkelsen, Ken Stott, Joel Edgerton, Sean Gilder, Pat Kinevane, Ivano Marescotti, Lorenzo De Angelis, Stefania Orsola Garello, Alan Devine, Charlie Creed-Miles, Johnny Brennan, David Murray, Dawn Bradfield, Maria Gladkowska || Drama, Action, Adventure ||"]}, {"page": "Essex Boys", "response": ["Essex Boys is a 2000 British crime film. It was directed by Terry Winsor and stars Sean Bean, Alex Kingston, Tom Wilkinson, Charlie Creed-Miles and Holly Davidson.", "* Charlie Creed-Miles as Billy Reynolds/narrator"]}, {"page": "List of thriller films of the 2000s", "response": ["|Harry Brown||Daniel Barber||Michael Caine, Emily Mortimer, Charlie Creed-Miles||United Kingdom||"]}, {"page": "Cultural depictions of James II of England", "response": ["He has also been portrayed by Gibb McLaughlin in the 1926 silent film Nell Gwynne, based on a novel by Joseph Shearing, Lawrence Anderson in the 1934 film Nell Gwyn, Vernon Steele in the 1935 film Captain Blood, based on the novel by Rafael Sabatini, Douglas Matthews in the 1938 BBC TV drama Thank You, Mr. Pepys, Henry Oscar in the 1948 film Bonnie Prince Charlie, John Westbrook in the 1969 BBC TV series The First Churchills, Guy Henry in the 1995 film England, My England, the story of the composer Henry Purcell, and Charlie Creed-Miles in the 2003 BBC TV miniseries Charles II: The Power & the Passion."]}, {"page": "Born Equal", "response": ["* Charlie Creed-Miles as man in hostel"]}, {"page": "List of American films of 2010", "response": ["| Harry Brown || Samuel Goldwyn Films || Daniel Barber (director); Gary Young (screenplay); Michael Caine, Emily Mortimer, Charlie Creed-Miles, David Bradley, Iain Glen, Sean Harris, Ben Drew, Jack O'Connell, Lee Oakes, Joseph Gilgun, Liam Cunningham, Jamie Downey, Liz Daniels, Raza Jaffrey, Klariza Clayton", "| Hereafter || Warner Bros. Pictures / The Kennedy/Marshall Company || Clint Eastwood (director); Peter Morgan (screenplay); Matt Damon, Cécile de France, Jay Mohr, Bryce Dallas Howard, Thierry Neuvic, Marthe Keller, Derek Jacobi, Lyndsey Marshal, Richard Kind, Steven R. Schirripa, Jenifer Lewis, Charlie Creed-Miles, Franz Drameh, Mylène Jampanoï, Stéphane Freiss, Laurent Bateau, Jean-Yves Berteloot, Niamh Cusack, George Costigan, Mathew Baynton, Tom Price, Frankie and George McLaren, Céline Sallette, Hélène Cardona"]}, {"page": "Injustice (British TV series)", "response": ["The killing of a reclusive farm worker, John Jarrold, takes place near to the Travers' home, and the investigation is led by the hard-nosed  D.I. Wenborn (Charlie Creed-Miles), who strongly dislikes Will after the barrister showed that one of his men lied in court to get a false conviction.", "* Charlie Creed-Miles as DI Mark Wenborn"]}, {"page": "List of British films of 2011", "response": ["|| Director: Dexter Fletcher   Cast: Charlie Creed-Miles, Will Poulter, Liz White, Sammy Williams, Charlotte Spencer, Leo Gregory, Neil Maskell, Iwan Rheon, Jason Flemyng, Jaime Winstone, Olivia Williams, Andy Serkis"]}, {"page": "Wild Bill (2011 film)", "response": ["Wild Bill is a 2011 British crime comedy drama film directed by Dexter Fletcher and starring Charlie Creed-Miles and Andy Serkis. It was released in UK cinemas on 23 March 2012.", "Bill (Charlie Creed-Miles) is paroled after serving an eight year prison sentence for drug related offences. Returning to his home in East London Bill finds his two sons, 15-year-old Dean (Will Poulter) and 11-year-old Jimmy (Sammy Williams) abandoned by their mother, Dean having dropped out of school to work and take care of Jimmy on his own. Dean makes it clear to Bill that he is not welcome in either his or Jimmy's lives. Bill's former criminal associates Dickie (Neil Maskell) and Terry (Leo Gregory) offer Bill some drug dealing. Bill is on license and refuses, not wanting to return to prison. Bill instead intends to go to Scotland and work on the oil rigs. During a parole meeting Bill finds out that his sons, under aged and without a legal guardian will be surrendered to foster care. Reluctant to be a father to Dean and Jimmy, Bill still insists on going to Scotland; Dean reveals that he has confiscated his drugs and threatens to tell the police if Bill doesn't remain.", "* Charlie Creed-Miles as Wild Bill"]}, {"page": "True Love (TV series)", "response": ["*Charlie Creed-Miles as David, Sandra's husband and Holly's lover (appears in episodes 3 and 4)"]}, {"page": "Great Expectations (2011 TV series)", "response": ["*Charlie Creed-Miles as Sergeant"]}, {"page": "Screen Two", "response": ["Cast: Charlie Creed-Miles, Tom Bell, Liz Smith"]}]}}