{"wiki_id": "http://www.wikidata.org/entity/Q1064247", "itemLabel": "Charles Edward Callwell", "itemDescription": "Anglo-Irish officer of the British Army and author", "wikipedia_url": "https://en.wikipedia.org/wiki/Charles_Edward_Callwell", "wikipedia_page": {"main": "Major-General Sir Charles Edward Callwell  (2 April 1859 – May 1928), was an Anglo-Irish officer of the British Army, who served in the artillery, as an intelligence officer, and as a staff officer and commander during the Second Boer War, and as Director of Operations & Intelligence during World War I. He was also a noted writer of military biography, history, and theory.", "link_mentions": [{"page": "Charles Edward", "response": ["*Charles Edward Callwell, British soldier"]}, {"page": "Order of the White Eagle (Serbia)", "response": ["* Charles Edward Callwell"]}, {"page": "Strategic War Game of 1905", "response": ["The Strategic War Game of 1905 was a wargame run by the British General Staff between January and May 1905. The game was umpired by James Grierson, an expert on the German Army. There were three sides: Colonel Charles Edward Callwell played the British commander-in-chief, William Robertson played the German commander-in-chief with Arthur Lynden-Bell playing that of the Belgian Army. Grierson had been the British military attaché to Berlin from 1896-1900, where he had had experience of their Kriegsspiel."]}, {"page": "1907 Birthday Honours", "response": ["*Colonel Charles Edward Callwell, General Staff Officer, 1st Grade, Headquarters of Army."]}, {"page": "1917 Birthday Honours", "response": ["*Colonel and Hon. Major-General Charles Edward Callwell,  (ret. pay)."]}, {"page": "Sir Charles Callwell", "response": ["#REDIRECTCharles Edward Callwell"]}, {"page": "Milo Talbot (British Army officer)", "response": ["Shortly after the outbreak of the First World War he was recalled to service for special duties at the War Office as a General Staff Officer of the 1st grade, with effect from 22 September 1914. Talbot, with Major-General Charles Edward Callwell, Captain Cecil Lambert, Captain Herbert Richmond and the Admiralty's Director of Transport Graeme Thompson was part of a committee put together in September 1914 to plan for a naval landing at Gallipoli.  Talbot recorded that Callwell considered it was \"likely to prove an extremely difficult operation of war\" but thought a force of sixty thousand men could prevail.  Callwell had previously been against such an operation and may well have been persuaded to change his mind by Winston Churchill's force of will.  Talbot had returned to the retired list by 14 January 1916 when he was appointed a Companion of the Order of the Bath.  He assisted Reginald Wingate, Governor-General of the Sudan, with preparations for the defence of that country as a member of the Permanent Committee of Defence in 1916."]}]}}