{"wiki_id": "http://www.wikidata.org/entity/Q1063510", "itemLabel": "Charles Murray, 7th Earl of Dunmore", "itemDescription": "British politician and peer (1841-1907)", "wikipedia_url": "https://en.wikipedia.org/wiki/Charles_Murray,_7th_Earl_of_Dunmore", "wikipedia_page": {"main": "Charles Adolphus Murray, 7th Earl of Dunmore VD (24 March 1841 – 27 August 1907), styled Viscount Fincastle from birth until 1845, was a Scottish peer, Conservative politician, explorer, author, and artist.", "link_mentions": [{"page": "Charles Murray", "response": ["*Charles Murray, 7th Earl of Dunmore (1841–1907), Scottish peer and Conservative politician"]}, {"page": "Great Game", "response": ["This left the border east of Lake Zorkul in the Wakhan region to be defined. This territory was claimed by China, Russia and Afghanistan. In the 1880s, the Afghans had advanced north of the lake to the Alichur Pamir. In 1891, Russia sent a military force to this area and its commander, Yanov, ordered the British Captain Francis Younghusband to leave Bozai Gumbaz in the Little Pamir. The Russians claimed that because they had annexed the Khanate of Kokand they had a claim over the Pamirs. Afghanistan claimed that the region never paid tribute to Kokand and was independent, so having annexed it the region was theirs. The British claimed that this was a breach of the Anglo-Russian Agreement of 1873. Unfortunately for Britain, the Indian government pointed out that Bozai Gumbaz was not included in the Agreement and so it was in an undefined zone. Bozai Gumbaz had not appeared on the Russian map as being in Wakhan. Additionally, the British became aware that Younghusband had mistakenly entered Russian territory near Kara Kul and could have been arrested by the administrator there. Yanov offered a verbal apology if he had mistakenly entered the Wakhan territory, and the Russian government proposed a joint survey to agree on a border. In 1892, the British sent Charles Murray, 7th Earl of Dunmore to the Pamirs to investigate. Britain was concerned that Russia would take advantage of Chinese weakness in policing the area to gain territory. Murray was engaged in some form of diplomacy or espionage but the matter is not clear,Robert Middleton, Huw Thomas, and Markus Hauser. Tajikistan and the High Pamirs, Odyssey Books, p. 476 and in 1893 reached agreement with Russia to demarcate the rest of the border, a process completed in 1895."]}, {"page": "1865 in architecture", "response": ["* Amhuinnsuidhe Castle, Harris, Scotland, built for Charles Murray, 7th Earl of Dunmore, by David Bryce. In 2003 Amhuinnsuidhe Castle Estate purchases the castle (and its fishing rights)."]}, {"page": "Alexander Murray, 8th Earl of Dunmore", "response": ["Murray was born on 22 April 1871 to Charles Murray, 7th Earl of Dunmore and Lady Gertrude Coke, immediately taking the courtesy title of Viscount Fincastle. His grandparents included Alexander Murray, 6th Earl of Dunmore, Lady Catherine Herbert, Thomas Coke, 2nd Earl of Leicester, and Lady Juliana Whitbread. His paternal great-grandmother was the Russian noblewoman Countess Catherine Woronzoff (or Vorontsova), daughter of the Russian ambassador to St James's, Semyon Romanovich Vorontsov.  He was educated privately and at Eton before joining the army."]}, {"page": "Lord Lieutenant of Stirlingshire", "response": ["* Charles Murray, 7th Earl of Dunmore 16 February 1875 – 1885"]}, {"page": "List of Christian Scientists (religious denomination)", "response": ["*Charles Murray, 7th Earl of Dunmore – Scottish peer, politician, explorer, author, and teacher of Christian ScienceThe Earl of Dunmore, C.S.B. Longyear.org"]}, {"page": "Thomas Coke, 2nd Earl of Leicester", "response": ["*Lady Gertrude Coke (1847 – 28 November 1943) she married Charles Murray, 7th Earl of Dunmore on 5 April 1866. They have six children. "]}, {"page": "Charles Adolphus Murray", "response": ["#REDIRECT Charles Murray, 7th Earl of Dunmore"]}, {"page": "Amhuinnsuidhe Castle", "response": ["Originally named Fincastle, the house was built in the Scottish baronial style by architect David Bryce in 1864–1867 for Charles Murray, 7th Earl of Dunmore (styled Viscount Fincastle until 1845), whose grandfather George Murray, 5th Earl of Dunmore had purchased the island in 1834. J M Barrie found inspiration for his play Mary Rose while staying at the castle in 1912 and visiting the nearby Loch Voshimid, \"where we found Mary Rose\". In 2003, Amhuinnsuidhe Castle Estate purchased the castle and the fishing rights, while the North Harris Estate was transferred into community ownership. The castle is now operated as a venue for fishing, shooting parties, weddings and corporate events."]}, {"page": "Charles Adolphus Murray, 7th Earl of Dunmore", "response": ["#REDIRECT Charles Murray, 7th Earl of Dunmore"]}, {"page": "Amhuinnsuidhe", "response": ["Amhuinnsuidhe Castle was built in 1865 for Charles Murray, 7th Earl of Dunmore. The castle, as the North Harris Estate, remained in private ownership until 2003."]}, {"page": "William Elphinstone, 15th Lord Elphinstone", "response": ["Lord Elphinstone married Lady Constance Euphemia Murray (1838–1922), daughter of Alexander Murray, 6th Earl of Dunmore, in 1864.  Among her siblings was Lady Susan Murray, Charles Murray, 7th Earl of Dunmore, and Lady Victoria Alexandrina (wife of Rev. Henry Cunliffe, a son of Sir Robert Cunliffe, 4th Baronet). Together, they were the parents of five children, only one of whom married:"]}, {"page": "CA Murray", "response": ["#REDIRECT Charles Murray, 7th Earl of Dunmore"]}, {"page": "Charles James Murray", "response": ["His paternal grandparents were George Murray, 5th Earl of Dunmore and the former Lady Susan Hamilton (a daughter of Archibald Hamilton, 9th Duke of Hamilton). His paternal uncle was Alexander Murray, 6th Earl of Dunmore and among his paternal cousins were Lady Susan Catherine Mary Murray (wife of James Carnegie, 9th Earl of Southesk), Lady Constance Euphemia Woronzow Murray (wife of William Elphinstone, 15th Lord Elphinstone), and Charles Murray, 7th Earl of Dunmore. His maternal grandparents were prominent landowner and businessman James Wadsworth. His maternal uncle, James S. Wadsworth, was a Union Army General during the American Civil War. Among his American cousins were Cornelia Wadsworth Adair (who married Scots-Irish businessman John George Adair and became matriarch of Glenveagh Castle in County Donegal, Ireland), U.S. Representative James Wolcott Wadsworth, and Elizabeth Wadsworth, who married Arthur Smith-Barry (later Baron Barrymore)."]}, {"page": "Depsang Plains", "response": ["In 1893, Charles Murray, 7th Earl of Dunmore, in his daily records of his travels with Major Roche through Ladakh, Tibet and Pamirs, wrote of seeing musk deer, kiang, Tibetan antelope and a butterfly in the region in and around the Depsang Plains. Dunmore noted that K2, the second highest mountain in the world, could be seen from the plateaus. In 1906, Sven Hedin had travelled east from Burtsa to the Aksai Chin lake on the traditional silk road."]}, {"page": "Ardvourlie Castle", "response": ["Ardvourlie Castle is a 19th-century country house on Harris, one of the Western Isles off the north-west coast of Scotland. The house was built beside Loch Seaforth in 1863 as a hunting lodge on the North Harris Estate, for Charles Murray, 7th Earl of Dunmore, the then owner of the island.  It is a category B listed building."]}, {"page": "1865 in Scotland", "response": ["* Amhuinnsuidhe Castle on Harris is built for Charles Murray, 7th Earl of Dunmore by David Bryce."]}, {"page": "Cathleen Mann", "response": ["In 1946, she married John Robert Follett, the son of Brigadier-General Gilbert Burrell Spencer Follett, who had been killed in action during the First World War, and Lady Mildred Follet, daughter of Charles Murray, 7th Earl of Dunmore. Follett was a racehorse owner, but died in 1953, aged 46, shortly before Francis Douglas also died. The two deaths seemed to have caused Mann to have a nervous breakdown, but it has been said that during this period she produced some of her best work, from landscapes and child portraits to sculpture and abstract paintings. She befriended the artist Matthew Smith and was influenced by his work. As a result, the Oxford Dictionary of National Biography opines that her best work occurred during the last ten years of her life. During this period she experimented with abstract art, drawings of nude models and sculpture."]}, {"page": "Harold Gore Browne", "response": ["Harold was the son of Thomas Gore Browne, brother to Ethel Locke King and Wilfrid Gore Browne. He was married to Lady Muriel Murray, daughter of Charles Murray, 7th Earl of Dunmore. His brother Francis's son, Stewart Gore Browne of Shiwa Ngandu was Harold's nephew. "]}, {"page": "Leckhampton Court", "response": ["The Hargreaves entertained sumptuously, entertaining a number of notable guests at the court, most famously: Fredrick Roberts, 1st Earl Roberts, Henry Wellesley, 3rd Duke of Wellington, Charles Murray, 7th Earl of Dunmore, and Henry Somerset, 8th Duke of Beaufort. John died in 1900, leaving the court to his younger daughter Edith Muriel, who was to marry Colonel Cecil Ewles, son of the noted botanist Henry John Elwes.Miller, Eric (2011). Leckhampton Court: Manor House to Hospice. Leicester: Matador. p. 26-27. ."]}]}}