{"wiki_id": "http://www.wikidata.org/entity/Q1065888", "itemLabel": "Inspector Morse", "itemDescription": "fictional character in crime novels by Colin Dexter", "wikipedia_url": "https://en.wikipedia.org/wiki/Inspector_Morse", "wikipedia_page": {"main": "Detective Chief Inspector Endeavour Morse, GM, is the eponymous fictional character in the series of detective novels by British author Colin Dexter. On television, he appears in the 33-episode drama series Inspector Morse (1987–2000), in which John Thaw played the character, as well as the (2012–) prequel series Endeavour, portrayed by Shaun Evans. The older Morse is a senior CID (Criminal Investigation Department) officer with the Thames Valley Police in Oxford in England and, in the prequel, Morse is a young detective constable rising through the ranks with the Oxford City Police and in later series the Thames Valley Police.\nMorse presents, to some, a reasonably sympathetic personality, despite his sullen and snobbish temperament, with a classic Jaguar Mark 2 (a Lancia in the early novels), a thirst for English real ale, and a love of classical music (especially opera and Wagner), poetry, art and cryptic crossword puzzles. In his later career he is usually assisted by Sergeant Robbie Lewis. Morse's partnership and formal friendship with Lewis is fundamental to the series.", "link_mentions": [{"page": "Colin Dexter", "response": ["Norman Colin Dexter  (29 September 1930 – 21 March 2017) was an English crime writer known for his Inspector Morse series of novels, which were written between 1975 and 1999 and adapted as an ITV television series, Inspector Morse, from 1987 to 2000. His characters have spawned a sequel series, Lewis, and a prequel series, Endeavour.", "In 1954, Dexter began his teaching career in the East Midlands, becoming assistant Classics master at Wyggeston School, Leicester. There he helped the Christian Union school society. However, in 2000 he stated that he shared the same views on politics and religion as Inspector Morse, who was portrayed in the final Morse novel, The Remorseful Day, as an atheist.", "The initial books written by Dexter were general studies text books. He began writing mysteries in 1972 during a family holiday. Last Bus to Woodstock was published in 1975 and introduced the character of Inspector Morse, the irascible detective whose penchants for cryptic crosswords, English literature, cask ale, and music by composer Wagner reflect Dexter's own enthusiasms. Dexter's plots used false leads and other red herrings.", "The success of the 33 two-hour episodes of the ITV television series Inspector Morse, produced between 1987 and 2000, brought further attention to Dexter's writings, featuring both Morse and his assistant Sergeant Robert Lewis. In the manner of Alfred Hitchcock, Dexter made a cameo appearance in almost all episodes. From 2006 to 2016, Morse's assistant featured in a 33-episode ITV series titled Lewis (Inspector Lewis in the United States).", "===Inspector Morse novels===", "Category:Inspector Morse"]}, {"page": "Detective fiction", "response": ["| Inspector Morse"]}, {"page": "January 3", "response": ["*  1942   – John Thaw, English actor and producer, played Inspector Morse (d. 2002)"]}, {"page": "Oxford", "response": ["* Colin Dexter, who wrote and set his Inspector Morse detective novels in Oxford.", "* Inspector Morse (1987-2000)"]}, {"page": "University of Oxford", "response": ["* The Inspector Morse detective novels (1975–1999) by Colin Dexter, adapted for television as Inspector Morse (1987–2000), the spin-off Lewis (2006–2015), and the prequel Endeavour (2012–)."]}, {"page": "John Thaw", "response": ["John Edward Thaw,  (3 January 1942 – 21 February 2002) was an English actor who appeared in a range of television, stage, and cinema roles. He starred in the television series Inspector Morse as title character Detective Chief Inspector Endeavour Morse, Redcap as Sergeant John Mann, The Sweeney as Detective Inspector Jack Regan, Home to Roost as Henry Willows, and Kavanagh QC as title character James Kavanagh.", "Thaw will perhaps be best remembered for two television roles: the hard-bitten, tough-talking Flying Squad detective Jack Regan in The Sweeney (1975–1978), and the quietly spoken, introspective, well-educated and bitter detective Detective Chief Inspector Endeavour Morse in Inspector Morse (1987–93, with later specials until 2000).  His role as Regan in the Thames Television/ITV series, along with two film spin-offs, established him as a major star in the United Kingdom. Thaw was only 32 when he was cast in The Sweeney, although many viewers thought he was older.", "Alongside his put-upon Detective Sergeant Robert \"Robbie\" Lewis (Kevin Whately), Morse became a high-profile character—\"a cognitive curmudgeon with his love of classical music, his drinking, his classic Jaguar and spates of melancholy\". According to The Guardian, \"Thaw was the definitive Morse, grumpy, crossword-fixated, drunk, slightly anti-feminist, and pedantic about grammar.\" Inspector Morse became one of the UK's most loved TV series; the final three episodes, shown in 2000, were seen by 18 million people, about one third of the British population. He won \"Most Popular Actor\" at the 1999 National Television Awards and won two BAFTA awards for his role as Morse.", "*1987 to 2000: Inspector Morse (Thirty-three films) – Detective Chief Inspector Endeavour Morse", "*2000: Inspector Morse: Rest in Peace – Inspector Morse", "*1990 British Academy Award – Best Actor for: \"Inspector Morse\"", "*1993 British Academy Award – Best Actor for: \"Inspector Morse\"", "*1998 National Television Award – Most Popular Actor for: \"Inspector Morse\"", "*1998 Special Recognition Award – Most Popular Actor for: \"Inspector Morse\"", "*2001 National Television Award – Most Popular Actor for: \"Inspector Morse\" and Academy Fellowship", "*1991 British Academy Award – Best Actor for: \"Inspector Morse\"", "*1992 British Academy Award – Best Actor for: \"Inspector Morse\"", "Category:Inspector Morse"]}, {"page": "Cryptic crossword", "response": ["Cryptic crosswords often appear in British literature, and are particularly popular in murder mysteries, where they are part of the puzzle. The character Inspector Morse created by Colin Dexter is fond of solving cryptic crosswords, and the crosswords often become part of the mystery. Colin Dexter himself set crosswords for The Oxford Times for many years and was a national crossword champion. In the short story \"The Fascinating Problem of Uncle Meleager's Will\", by Dorothy L Sayers, Lord Peter Wimsey solves a crossword in order to solve the mystery, while the solution to Agatha Christie's Curtain hinges on an Othello themed crossword. Ruth Rendell has used the device in her novel One Across, Two Down. Among non-crime writers, crosswords often feature in the works of P. G. Wodehouse, and are an important part of the book The Truth About George. Alan Plater's 1994 novel Oliver's Travels (turned into a BBC television serial of the same name in 1995) centres round crossword solving and the hunt for a missing compiler."]}, {"page": "Bodleian Library", "response": ["The Bodleian is one of the libraries consulted by Christine Greenaway (one of Bodley's librarians) in Colin Dexter's Inspector Morse novel The Wench is Dead (1989). The denouement of Michael Innes's Operation Pax (1951) is set in an imaginary version of the underground bookstack, reached at night by sliding down the \"Mendip cleft\", a chute concealed in Radcliffe Square.", "The Library's architecture has made it a popular location for filmmakers, representing either Oxford University or other locations.  It can be seen in the opening scene of The Golden Compass (2007), Brideshead Revisited (1981 TV serial), Another Country (1984), The Madness of King George III (1994), and the first two Harry Potter films, in which the Divinity School doubles as the Hogwarts hospital wing and Duke Humfrey's Library as the Hogwarts library.Leonard, Bill, The Oxford of Inspector Morse Location Guides, Oxford (2004) p. 203 . In The New World (2005), the library edifice is portrayed as the entrance to the Royal Court of the English monarchy. The Bodleian also featured in the Inspector Morse televised spin-off Lewis, in the episode \"And the Moonbeams Kiss the Sea\", where a murder takes place in the basement. It also featured in the episode \"Fugue\" of the Inspector Morse televised spin off Endeavour as the answer to an anagrammatic clue left by a serial killer for the young Morse."]}, {"page": "Josephine Tey", "response": ["* In 1989 Colin Dexter reprised the hospital-bound detective motif of Daughter of Time in his Inspector Morse novel The Wench is Dead, which was also made into an episode in the Morse television series."]}, {"page": "Sidekick", "response": ["While unusual, it is not unheard of for a sidekick to be more attractive, charismatic, or physically capable than the supposed hero. This is most typically encountered when the hero's appeal is more intellectual rather than sexual. Such heroes (usually fictional sleuths and scientists) are often middle-aged or older and tend towards eccentricity. Such protagonists may, due to either age or physical unsuitability, be limited to cerebral conflicts, while leaving the physical action to a younger or more physically capable sidekick. This type of sidekick is rarely encountered in fiction, because the hero runs the risk of being upstaged by them. However, examples of successful such pairings include Detective Monk and his sidekick Sharona, Inspector Morse and his sidekick Detective Sergeant Robbie Lewis, Nero Wolfe and his sidekick Archie Goodwin, Hiro Nakamura and his sidekick Ando Masahashi, and Miles Vorkosigan and his sidekick cousin Ivan Vorpatril. In other media, The Green Hornet's sidekick, Kato, has (especially since the 1960s television series with Bruce Lee) been depicted as a capable man of action, for instance in martial arts. The earliest Doctor Who serials, particularly during the First Doctor era, had young male companions who were capable of the physical action that the elderly William Hartnell was not. This became more important as Hartnell's health declined during his tenure as The Doctor. This was not an issue with the following Doctors as they were cast with significantly younger actors."]}, {"page": "Colin Baker", "response": ["Since leaving Doctor Who Baker has spent much of his time on the stage with appearances throughout the country in plays as diverse as Peter Nichols' Privates on Parade, Ira Levin's Deathtrap, Ray Cooney's Run for Your Wife and Ariel Dorfman's Death and the Maiden. For many years he has been a pantomime stalwart. In 2000 he appeared in Snow White and the Seven Dwarfs alongside actress Louise Jameson who had previously played the Fourth Doctor's companion Leela. In 2003 he starred in the Carl Rosa Opera Company's production of operetta H.M.S. Pinafore, directed by Timothy West. In 2008, he toured with ex-wife Liza Goddard in She Stoops To Conquer. More recent theatre appearances have seen Baker tackle the role of Inspector Morse in House of Ghosts and a UK tour of The Woman in White."]}, {"page": "1975 in literature", "response": ["*January – Colin Dexter's detective novel Last Bus to Woodstock introduces his Oxford police officer, Inspector Morse."]}, {"page": "Kevin Whately", "response": ["Kevin Whately (born 6 February 1951) is an English actor. He is best known for his roles as Neville  \"Nev\" Hope in the British comedy-drama Auf Wiedersehen, Pet, Robert \"Robbie\" Lewis in the crime dramas Inspector Morse 1987–2000 and Lewis 2006–2015, and his role as Jack Kerruish in the drama series Peak Practice, although he has appeared in numerous other roles.", "Whately's television appearances include episodes of Shoestring, Geordie Racer, Angels, Juliet Bravo, Strangers, Coronation Street, Auf Wiedersehen Pet, Alas Smith and Jones, Look and Read, You Must Be The Husband, B&B, Peak Practice, Skallagrigg, The Broker's Man, Murder in Mind, Inspector Morse, 2003 Comic Relief Auf Wiedersehen Pet, Lewis, New Tricks, Who Gets the Dog?, The Children and Silent Cry. Whately provided one of the voices for the English-language version of the 1999 claymation Children's television series Hilltop Hospital. He has also done voiceovers for a WaterAid advertisement.", "In 1985, Whately appeared in a 3-part Miss Marple adaptation (\"A Murder Is Announced\") for the BBC. His part, Detective Sergeant Fletcher, opposite John Castle as Inspector Craddock, was very similar to what became the career-defining role he took two years later, when he was cast as Detective Sergeant Lewis, the down-to-earth complement to the eponymous Inspector Morse played by John Thaw. Whately starred opposite Thaw in 32 episodes over 13 years in the hugely successful series that established him as a household name in the UK.", "Whately lives in Woburn Sands near Milton Keynes with his wife actress Madelaine Newton, who starred in the 1970s BBC drama When the Boat Comes In. Madelaine starred as Morse's love interest in the Inspector Morse episode entitled Masonic Mysteries (1990; series 4, episode 4).", "Whately enjoys rock music and plays the guitar; he has cited Pink Floyd and Dire Straits as bands he has particularly enjoyed. He is a fan of Newcastle United on the football field, but says that he prefers rugby league, and as a cricketer admitted to Inspector Morse writer Colin Dexter that he would like to have played cricket professionally for England. Dexter devised the storyline for the Inspector Morse episode \"Deceived by Flight\" (1989; series 3, episode 3) in which Sergeant Lewis had to go undercover in a cricket team to investigate drug smuggling.", "|Inspector Morse", "Category:Inspector Morse"]}, {"page": "Mycroft Holmes", "response": ["* British writer Colin Dexter, author of the Inspector Morse series of books, wrote a Sherlock Holmes short story \"A Case of Mis-Identity\", part of a collection of short stories published under the title \"Morse's Greatest Mystery\", in which Watson's practical knowledge of the circumstances of a case outwits both Sherlock and Mycroft."]}, {"page": "Sam Vimes", "response": ["His Grace, The Duke of Ankh, Commander Sir Samuel \"Sam\" Vimes is a fictional character in Terry Pratchett's Discworld series. Vimes is depicted in the novels as somewhere between an Inspector Morse-type 'old-school' British policeman, and a film noir-esque grizzled detective. His appearances throughout the Discworld sequence show him slowly and grudgingly rising through the ranks of both police force and society. As of his latest promotion, his full name and title is \"His Grace, His Excellency, The 1st Duke of Ankh; Commander Sir Samuel Vimes\".  When serving as Ambassador for Ankh-Morpork, he is also referred to simply as \"His Excellency\", and is also nicknamed \"Blackboard Monitor Vimes\",The Fifth Elephant,  \"Vimes the Butcher/Butcher Vimes\"Monstrous Regiment,  and \"Vetinari's Terrier\" (or his hammer, depending upon the occasion).  According to his wife, Sybil, Vimes is recognised by many as Lord Vetinari's right-hand man.", "Discussing Pratchett's legacy in The Guardian, Andrew Brown wrote that Vimes \"may be the most fully realised decent man in modern literature,\" while the Hollywood Reporter has described him as \"Inspector Morse-meets-Humphrey Bogart-esque \"."]}, {"page": "Thames Valley Police", "response": ["The fictional Inspector Morse, the main character in 13 novels by Colin Dexter and 33 television episodes by ITV, works for Thames Valley Police, but in the spin-off series, Lewis, the force is referred to as Oxfordshire Police. The prequel spin-off Endeavour covers Morse's early years in Oxford City Police and takes its merger into Thames Valley Police as a continuing theme."]}, {"page": "Morse", "response": ["* Inspector Morse, a fictional British detective in books by Colin Dexter", "** Inspector Morse (TV series) A television series about the fictional detective"]}, {"page": "The Eagle and Child", "response": ["More recently, the pub was regularly frequented by Colin Dexter, who created Inspector Morse."]}, {"page": "A Case of Identity", "response": ["Colin Dexter, known for writing the Inspector Morse novels, wrote a short story based on this called \"A Case of Mis-Identity\", in which Holmes's brother Mycroft is involved in the case's deduction; in this story, Holmes's theory about the 'Hosmer Angel' character is the same, while Mycroft deduces that 'Hosmer Angel' is a fiction created by the mother and daughter to eliminate the step-father, only for Watson to reveal that 'Hosmer Angel' is actually a real person who was attacked and robbed on the way to his wedding, hospitalized, and eventually treated by Watson, who used his own detective skills to verify the man's identity.Colin Dexter, Morse's Greatest Mystery and Other Stories, Chicago: Ballantine Books, 1996, pp.168–169."]}, {"page": "List of fictional Oxford colleges", "response": ["==Inspector Morse==", "The Inspector Morse series of books by Colin Dexter is predominantly set within Oxford and its environs, including the University. Consequently, many fictional colleges are named. The derived television series, Inspector Morse, Lewis and Endeavour, continued this practice.", "|Arnold College||Inspector Morse T|| ||", "|Beaufort College||Inspector Morse T; Endeavour T: \"Girl\"||Named after Henry Beaufort, a Plantagenet royal and Chancellor of the University of Oxford from 1397 to 1399||", "|Beaumont College||Inspector Morse novels|| Beaumont Street is a short street in central Oxford. One end emerges opposite Balliol's side entrance, and it extends to the front of Worcester. Beaumont Street was formerly the site of Beaumont Palace, perhaps the \"location\" of the college.||", "|Courtenay College||Inspector Morse T||Based on Oriel. Nuneham Courtenay is a village 5 miles south-east of Oxford; in the 14th century, the village belonged to the influential Courtenay family. Nuneham House now belongs to the University.||", "|Lonsdale College||Inspector Morse novels and subsequent Lewis T|| College attended by Endeavour Morse.", "|St Saviour's College||Inspector Morse, episode \"Fat Chance\"|| ||New College", "|Wolsey College||Inspector Morsenovels and Endeavour|| Based on Christ Church: Cardinal Wolsey founded Christ Church.|| "]}, {"page": "Glenfiddich", "response": ["* thumb|right|200px|The Glenfiddich Solera Reserve 15-year single malt scotch whisky.Glenfiddich was the favourite whisky of fictional detective Inspector Morse, as well as his creator Colin Dexter."]}, {"page": "Diogenes Small", "response": ["Diogenes Small (1797–1812) is a fictional character created by the English crime writer Colin Dexter in his Inspector Morse series of novels. The character, the supposed author of numerous historical and other works, does not appear in the novels although Dexter has used his quotations.", "One of the distinctive features of Dexter's Inspector Morse novels is the use of quotations as chapter headings, which began in the second novel in the series, Last Seen Wearing (1976); then in the fourth, Service of All the Dead (1979); and in the sixth, The Riddle of the Third Mile (1983) onwards. However, it was not always possible to find suitable quotations for every chapter, so many were simply invented by Dexter and attributed to non-existent sources, the most common of which was Diogenes Small.Dening, Penelope. \"Morse CODE\", 25 Nov 1995, Irish Times. These appeared in the last five novels of the series: The Jewel That Was Ours (1991), The Way Through the Woods (1992), The Daughters of Cain (1994), Death Is Now My Neighbour (1996), and The Remorseful Day (1999). Over twenty years, Dexter created a lengthy bibliography for the fictional author, including Small's Enlarged Dictionary, which apparently ran to at least 18 editions within Small's tragically short lifespan.", "Category:Inspector Morse"]}, {"page": "Neil Pearson", "response": ["Pearson has acted in several BBC Radio Dramas including the black comedy series Vent as comatose writer Ben Smith, adaptations of the Martin Beck novels playing Beck's sidekick Detective Lennart Kollberg, and House of Ghosts: A Case for Inspector Morse where he played the late Colin Dexter's iconic fictional detective Inspector Morse."]}, {"page": "Roger Allam", "response": ["In January 2012, he starred in the first series of Endeavour, the prequel to the long-running Inspector Morse, playing the gruff but kind-hearted Detective Inspector Fred Thursday, young Endeavour Morse's mentor in 1960s Oxford. By 2018 Allam had portrayed his central character in five additional well-received series, which are also aired in America as part of the PBS Masterpiece Mystery! series. In March 2019, the show's sixth season had concluded on ITV, was scheduled for broadcast in the summer in the United States, and had been recommissioned for a seventh season to be set in 1970.", "| Inspector Morse"]}, {"page": "Inspector", "response": ["In fiction, \"Inspector\" is often used as a term and title for a detective, even if their duties and role does not match that of an inspector in a Commonwealth police force. Examples of fictional inspectors include the characters Inspector Clouseau, Inspector Gadget, Inspector Zenigata, Inspector Javert, Inspector Lestrade, Inspector Morse, Inspector Palmu, Kurt Wallander, and Inspector Goole, the title character of An Inspector Calls."]}, {"page": "University of Oxford Botanic Garden", "response": ["In Philip Pullman's trilogy of novels His Dark Materials, a bench in the back of the garden is one of the locations/objects that stand parallel in the two different worlds that the protagonists, Lyra Belacqua and Will Parry, inhabit.Leonard, Bill, The Oxford of Inspector Morse Location Guides, Oxford (2004) p.198. . In the last chapter of the trilogy, both promised to sit on the bench for an hour at noon on Midsummer's day every year so that perhaps they may feel each other's presence next to one another in their own worlds. Now a place of pilgrimage for Pullman's fans, the bench is recognizable due to graffiti such as \"Lyra + Will\" or \"L + W\" left by its visitors and, since 2019, the sculpture by Julian Warren installed behind it."]}, {"page": "Gorton", "response": ["* John Thaw, actor best known for his role as Inspector Morse, was born in West Gorton."]}, {"page": "Corgi Classics", "response": ["In 1995, Corgi regained its independence as a new company, \"Corgi Classics Limited\", and moved to new premises in Leicester. Corgi Classics turned to British television for model ideas, and soon released models such as Mr. Bean's Mini, Inspector Morse's Jaguar and later models based on Enid Blyton's Noddy tales. A variety of firms ranging from Cadbury's chocolate to Guinness beer to Eddie Stobart haulage have had Corgi scale models made of their road vehicles. In 1995 Corgi introduced a new range of 1/76th scale UK and Hong Kong bus models under the \"Original Omnibus Company\" banner; by 2007, the total number of individual model releases in this sub-range had exceeded eight hundred.", "* Inspector Morse's Jaguar Mk II"]}, {"page": "Endeavour Morse", "response": ["#redirect Inspector Morse"]}, {"page": "Wytham", "response": ["==Inspector Morse==", "Wytham village and Wytham Woods have frequently featured in the \"Inspector Morse\" detective novels by Colin Dexter, most notably in The Way Through the Woods."]}, {"page": "Andrew Burt", "response": ["Burt was the first actor to play the character of Inspector Morse, starring in Last Bus to Woodstock, in June 1985, on BBC Radio 4. "]}, {"page": "Dave Stone", "response": ["Stone also contributed a number of comic series appearing in 2000 AD and in the Judge Dredd Megazine, focusing on the Judge Dredd universe.  In collaboration with David Bishop and artist Shaky Kane he produced the much disliked Soul Sisters, which he has described as \"a joke-trip, which through various degrees of miscommunication ended up as a joke-strip without any jokes.\"  Working independently, he created the better received Armitage, a take on Inspector Morse set in a future London, and also contributed to the ongoing Judge Hershey series."]}, {"page": "Robert Glenister", "response": ["*The Wench is Dead -Sgt. Lewis (1992, BBC Radio 4) opposite John Shrapnel as Inspector Morse", "*Last Seen Wearing – Sgt. Lewis (1994, BBC Radio 4) opposite John Shrapnel as Inspector Morse", "*The Silent World of Nicholas Quinn – Sgt. Lewis (1996, BBC Radio 4) opposite John Shrapnel as Inspector Morse"]}, {"page": "Lew-is", "response": ["#REDIRECT Inspector Morse"]}, {"page": "Lewis (TV series)", "response": ["Lewis is a British television detective drama produced for ITV, first airing in 2006 (pilot) then 2007 (series 1). It is a spin-off from Inspector Morse and, like that series, it is set in Oxford. Kevin Whately reprises his character Robert \"Robbie\" Lewis, who was Morse's sergeant in the original series. Lewis has now been promoted to detective inspector and is assisted by DS James Hathaway, portrayed by Laurence Fox, who was promoted to inspector before the seventh series. The series also stars Clare Holman as forensic pathologist Dr. Laura Hobson, likewise reprising her role from Inspector Morse and from the seventh season, Angela Griffin as DS Lizzie Maddox.", "Colin Dexter, the author of the Inspector Morse novels, makes a very brief cameo appearance in several episodes, including one as a porter at Wadham College. The episode scripts follow Dexter's approach, but each of them is credited to one of several other writers including, most frequently, Russell Lewis, Alan Plater, and Stephen Churchett.", "The music for the series was composed by Barrington Pheloung, who created the music for the original Inspector Morse series.", "Category:Inspector Morse"]}]}}