{"wiki_id": "http://www.wikidata.org/entity/Q1066006", "itemLabel": "Charles Sanderson, Baron Sanderson of Bowden", "itemDescription": "British baron (born 1933)", "wikipedia_url": "https://en.wikipedia.org/wiki/Charles_Sanderson,_Baron_Sanderson_of_Bowden", "wikipedia_page": {"main": "(Charles) Russell Sanderson, Baron Sanderson of Bowden (born 30 April 1933) is a British Conservative Party politician and a life peer. He was a member of the House of Lords from 1985 until his retirement in 2018.\nSanderson was educated at St. Mary's School, Melrose, Glenalmond College, Bradford Technical College and the Scottish Textile College.Knighted in 1981, Sanderson was created a life peer on 5 June 1985 as Baron Sanderson of Bowden, of Melrose in the District of Ettrick and Lauderdale and spoke regularly in the House of Lords. Bowden in his title is taken from a village in the Roxburghshire area of the Scottish Borders.\nFrom 1987 to 1990 Lord Sanderson was a Minister of State in the Scottish Office, responsible for housing, agriculture and fisheries. He also served as Chairman of the Conservative Party in Scotland in the early 1990s, and was seen as responsible for removing Michael Forsyth from the Scottish Office and other right-wingers from the Party's Central Office in Scotland.In 2010 he was appointed to lead a review into the future of the Conservative Party in Scotland. This followed the 2010 United Kingdom general election, where despite winning a plurality of seats in the House of Commons, the Conservatives won only one constituency in Scotland. Lord Sanderson's report recommended an overhaul of leadership, with a separately elected leader to take full responsibility of the party's performance in Scotland. A formal response from the party was expected in early 2011.He retired from the House of Lords on 29 March 2018.", "link_mentions": [{"page": "April 30", "response": ["*1933 – Charles Sanderson, Baron Sanderson of Bowden, English politician"]}, {"page": "List of barons in the peerages of Britain and Ireland", "response": ["#*Charles Sanderson, Baron Sanderson of Bowden"]}, {"page": "The Lord Sanderson of Bowden", "response": ["#REDIRECT Charles Sanderson, Baron Sanderson of Bowden"]}, {"page": "Charles Russell Sanderson, Baron Sanderson of Bowden", "response": ["#REDIRECT Charles Sanderson, Baron Sanderson of Bowden"]}, {"page": "Baron Sanderson of Bowden", "response": ["#REDIRECT Charles Sanderson, Baron Sanderson of Bowden"]}, {"page": "Charles Bowden (disambiguation)", "response": ["* Charles Sanderson, Baron Sanderson of Bowden (born 1933), British Conservative Party politician and a life peer in the House of Lords"]}]}}