{"wiki_id": "http://www.wikidata.org/entity/Q1064363", "itemLabel": "Charles Fitzgerald", "itemDescription": "British colonial governor (1792-1887)", "wikipedia_url": "https://en.wikipedia.org/wiki/Charles_Fitzgerald", "wikipedia_page": {"main": "Charles Fitzgerald  (c. 1791 – 29 December 1887) was an Irish officer in the Royal Navy and Governor of The Gambia from 1844 until 1847, then Governor of Western Australia from 1848 to 1855.Son of William FitzGerald, 2nd Duke of Leinster, Fitzgerald joined the Royal Navy in March 1809, passed his examination in 1815, and was commissioned in March 1826.Soon after his arrival in Western Australia in 1848, Fitzgerald accompanied Augustus Gregory on an expedition in the Northampton region where Gregory and his brother had discovered lead the year before. An encounter with Aboriginal people resulted in Fitzgerald being speared in the leg and at least three Aborigines shot dead.The town of Geraldton, Western Australia, was named after him.\n\n", "link_mentions": [{"page": "Amistad (film)", "response": ["* Peter Firth as Captain Charles Fitzgerald"]}, {"page": "Governor of Western Australia", "response": ["| Captain Charles Fitzgerald "]}, {"page": "List of colonial governors in 1848", "response": ["*# Captain Charles Fitzgerald, Governor of Western Australia (1848–1855)"]}, {"page": "List of colonial governors in 1849", "response": ["* Western Australia – Captain Charles Fitzgerald, Governor of Western Australia (1848–1855)"]}, {"page": "List of colonial governors in 1850", "response": ["* Western Australia – Captain Charles Fitzgerald, Governor of Western Australia (1848–1855)"]}, {"page": "List of colonial governors in 1851", "response": ["* Western Australia – Captain Charles Fitzgerald, Governor of Western Australia (1848–1855)"]}, {"page": "List of colonial governors in 1852", "response": ["* Western Australia – Captain Charles Fitzgerald, Governor of Western Australia (1848–1855)"]}, {"page": "List of colonial governors in 1853", "response": ["* Western Australia – Captain Charles Fitzgerald, Governor of Western Australia (1848–1855)"]}, {"page": "List of colonial governors in 1854", "response": ["* Western Australia – Captain Charles Fitzgerald, Governor of Western Australia (1848–1855)"]}, {"page": "List of colonial governors in 1855", "response": ["*# Captain Charles Fitzgerald, Governor of Western Australia (1848–1855)"]}, {"page": "List of colonial governors of the Gambia", "response": ["| rowspan=\"2\"| CaptainCharles FitzgeraldRN(1791–1887)"]}, {"page": "Frederick Irwin", "response": ["On the death of Governor Andrew Clarke in February 1847, Irwin took office as acting Governor until the arrival of the new governor, Charles Fitzgerald, in August 1848. His administration was extremely unpopular with the settlers of Western Australia, due to both the poor financial state of the colony and his stern character, and the arrival of Fitzgerald was widely celebrated. Irwin retired from the army in 1854 and returned to England in 1856, where he died in Cheltenham in 1860."]}, {"page": "Anthony O'Grady Lefroy", "response": ["Lefroy was private secretary to Governor Charles Fitzgerald from 1843 probably until 1853, and again from 1854 to 1855.  In 1851 he was Clerk to the Executive and Legislative Councils.  In 1856, Lefroy was appointed Colonial Treasurer, and he would hold that position for over 30 years, until the advent of responsible government in December 1890.  He did, however, spend portions of this period in England: he was in England in 1858, 1863–65, and 1868–71."]}, {"page": "George Fletcher Moore", "response": ["Under the acting governorship of Frederick Irwin, Moore's popularity waned further.  The government of Irwin and Moore was extremely unpopular; Battye (1924) writes \"every administrative act was viewed with suspicion. ... Long years of depression and struggle had made the colonists pessimistic, and ... they threw the blame on the Government of the day.\"  The eventual appointments of Madden and the new governor, Charles Fitzgerald, left Moore with almost no influence in the new government."]}]}}