{"wiki_id": "http://www.wikidata.org/entity/Q1064402", "itemLabel": "Charles Fox", "itemDescription": "British civil engineer and railway contractor (1810-1874)", "wikipedia_url": "https://en.wikipedia.org/wiki/Charles_Fox_(civil_and_railway_engineer)", "wikipedia_page": {"main": "Sir Charles Fox (11 March 1810 – 11 June 1874) was an English civil engineer and contractor. His work focused on railways, railway stations and bridges.", "link_mentions": [{"page": "The Crystal Palace", "response": ["Paxton was acclaimed worldwide for his achievement, and was knighted by Queen Victoria in recognition of his work. The project was engineered by Sir William Cubitt; Paxton's construction partner was the ironwork contractor Sir Charles Fox's Fox and Henderson, whose director Charles Fox was also knighted for his contribution. The 900,000 square feet (84,000 m2) of glass was provided by the Chance Brothers glassworks in Smethwick. This was the only glassworks capable of fulfilling such a large order; it had to bring in labour from France to fulfil the order in time. The final dimensions were  long by  wide. The building was  high, with  on the ground floor alone.Hunt, Lynn, Thomas R. Martin, and Barbara H. Rosenwein, The Making of the West: Peoples and Cultures. Boston/New York: Bedford/St. Martin's, 2009. P 685.", "* McKean, John. Crystal Palace: Joseph Paxton & Charles Fox (London, Phaidon Press, 1994)"]}, {"page": "Great Exhibition", "response": ["A special building, or \"The Great Shalimar\", was built to house the show. It was designed by Joseph Paxton with support from structural engineer Charles Fox, the committee overseeing its construction including Isambard Kingdom Brunel, and went from its organisation to the grand opening in just nine months. The building was architecturally adventurous, drawing on Paxton's experience designing greenhouses for the sixth Duke of Devonshire. It took the form of a massive glass house, 1848 feet long by 454 feet wide (about 563 metres by 138 metres) and was constructed from cast iron-frame components and glass made almost exclusively in Birmingham and Smethwick. From the interior, the building's large size was emphasized with trees and statues; this served, not only to add beauty to the spectacle, but also to demonstrate man's triumph over nature. The Crystal Palace was an enormous success, considered an architectural marvel, but also an engineering triumph that showed the importance of the Exhibition itself. The building was later moved and re-erected in 1854 in enlarged form at Sydenham Hill in south London, an area that was renamed Crystal Palace. It was destroyed by fire on 30 November 1936."]}, {"page": "Joseph Paxton", "response": ["Its novelty was its revolutionary modular, prefabricated design, and use of glass. Glazing was carried out from special trolleys, and was fast: one man managed to fix 108 panes in a single day. The Palace was  long,  wide and  high. It required 4,500 tons of iron,  of timber and needed over 293,000 panes of glass. Yet it took 2,000 men just eight months to build, and cost just £79,800. Quite unlike any other building, it was itself a demonstration of British technology in iron and glass. In its construction, Paxton was assisted by Charles Fox, also of Derby for the iron framework, and William Cubitt, Chairman of the Building Committee. All three were knighted. After the exhibition they were employed by the Crystal Palace Company to move it to Sydenham where it remained until it was destroyed by fire in 1936."]}, {"page": "Railroad switch", "response": ["On early lines, vehicles were moved between tracks by means of sliding rails. The switch was patented by Charles Fox in 1832."]}, {"page": "Euston railway station", "response": ["The station building was designed by the classically trained architect Philip Hardwick with a  trainshed by structural engineer Charles Fox. It had two  platforms, one each for departures and arrival. The main entrance portico, known as the Euston Arch was also by Hardwick, and was designed to symbolise the arrival of a major new transport system as well as being seen as \"the gateway to the north\". It was  high, and supported four  by  hollow Doric propylaeum columns made from Bramley Fall stone, the largest ever built. It was completed in May 1838 and cost £35,000 (now £)."]}, {"page": "Smethwick", "response": ["One notable company was The London Works, manufacturing base of the Fox Henderson Company which made the steel framework for the Crystal Palace. This was founded by Charles Fox, whose inventions included the first patented railway points. His notable employees included William Siemens, the notable mechanical and electrical engineer. The company was bankrupted in 1855 by the failure of an overseas railway to pay for work done. The site was later used by the GKN company. In 2015 the site was being cleared to build the new Midland Metropolitan University Hospital which aims to combine the Sandwell General Hospital at West Bromwich and City Hospital, Dudley Road. Work at the site later came to a standstill because of a crisis in the construction industry."]}, {"page": "Grosvenor Bridge", "response": ["The bridge was widened by four tracks on the eastern side for the London, Brighton and South Coast Railway and London, Chatham and Dover Railway between 1865 and 1866, at a cost of £245,000.  Sir Charles Fox was the engineer."]}, {"page": "Timeline of railway history", "response": ["*1832 - The railway switch is patented by Charles Fox."]}, {"page": "Herbert William Garratt", "response": ["Garratt began his engineering career by serving an apprenticeship under John Carter Park, then locomotive superintendent of the North London Railway, from 1879 to 1882 at the North London Railway Bow works. He gained further experience at Doxford's marine engineering works in Sunderland and later as an inspector for Sir Charles Fox and Sir Alexander Rendel. Garratt joined the Argentine Central Railway in 1889, where he became Locomotive Superintendent in 1892, and between 1900 and 1906 he worked for railways in Cuba, Lagos, and Lima (Peru). In 1902, Garratt was elected to membership of the Institute of Mechanical Engineers. He returned to England in 1906, taking on a role inspecting locomotives built for the New South Wales Government Railways by British manufacturers."]}, {"page": "Roma Street railway station", "response": ["The construction of a railway station on Roma Street was part of a plan to extend the Main Line to Brisbane. An iron station building designed by Sir Charles Fox & Sons was to be imported from the United Kingdom for this purpose, but economic problems in Queensland led to the order being cancelled. In 1873, the Superintendent of Public Buildings Francis Stanley designed a smaller station for the site, with construction beginning in the same year under John Petrie. The station was officially opened on 14 June 1875 as Brisbane at the same time that the Main Line opened to Indooroopilly."]}, {"page": "Nunhead Cemetery", "response": ["* Sir Charles Fox, 1810–1874, civil and railway engineer"]}, {"page": "Railway turntable", "response": ["However, the problems with turnplates and sliding rails were twofold. First, they were relatively small (often no more than  in length), which limited the wagon length that could be turned. Second, their switching capacity could only be accessed when the wagon was on top of them and still, which limited the total capacity of any wagonway. The railway switch, which overcame both of these problems, was patented by Charles Fox in 1832."]}, {"page": "3 ft 6 in gauge railways", "response": [";1865: In 1865 the Queensland Railways were constructed. Its  gauge was promoted by the Irish engineer Abraham Fitzgibbon and consulting engineer Charles Fox.", ";1868: In 1868 Charles Fox asks civil engineer Edmund Wragge to survey a  railway in Costa Rica."]}, {"page": "Wirral line", "response": ["The first proposal to connect Birkenhead and Liverpool by a rail tunnel was made in 1864 by the Liverpool and Birkenhead Railway Company.  The bill received the support of the chairman of the Mersey Docks and Harbour Board and of John Laird, the Member of Parliament for Birkenhead at the time, although ultimately it was unsuccessful due to strong opposition from the LNWR. A second tunnel proposal was made in 1865 by Sir Charles Fox who planned to build a single track pneumatic railway under the Mersey between the two settlements.  The Mersey Railway Act was passed in 1866 although the project was hindered with knowledge of engineering difficulties and limitations with pneumatic railways in other parts of the country. On 22 December 1869, Fox held a meeting with Liverpool businessmen and merchants where it was decided that the pneumatic single track railway would be substituted with a conventional steam double track line.  Powers for the Mersey Railway Company to build a steam railway were granted in 1871 as well as those to extend the original planned route to connect with the joint Great Western and London and North Western railway at .", "A contract was made with John Dickson to raise the necessary funding and then construct the railway, but he soon became bankrupt. Work on constructing the tunnel did not commence until December 1879 when a preliminary contract was entered with Major Samuel Isaac, a London businessman, to dig a pilot tunnel for determining the nature of the strata beneath the Mersey. Isaac subcontracted the construction work to John Waddell & Sons of Edinburgh who appointed James Brunlees and Charles Douglas Fox, eldest son of Sir Charles Fox, as engineers in chief. Two shafts were dug in the grounds of the Mersey Docks and Harbour Board for the pilot tunnel - one in Birkenhead with a diameter of  and the other in Liverpool of diameter . It was determined that there was an almost uninterrupted stratum of red sandstone beneath the river and as a result construction began in August 1881 before the pilot bore had been completed."]}, {"page": "Charles Fox", "response": ["Charles Fox may refer to:", "*Charles Fox (1660–1713), British politician, Paymaster of the Forces", "*Charles Fox (socialist activist) (1861–1939), British socialist activist and dentist", "*Charles Fox (civil and railway engineer) (1810–1874), British civil and railway engineer, built the Crystal Palace", "*Charles Fox (cricketer) (1858–1901), English cricketer", "*Charles Fox (swimmer) (born 1948), Zambian Olympic swimmer", "*Charles Fox (jazz critic) (1921–1991), British jazz critic", "*Charles Fox (composer) (born 1940), film and television composer", "*Charles Fox (artist) (1794–1849), English artist", "*Charles Fox (scientist) (1797–1878), British scientist", "*Charles Fox (missionary) (1878–1977), English ethnographer and missionary", "*Charles Fox (mathematician) (1897–1977), British-born mathematician", "*Charles Foxe (died 1590), MP for Much Wenlock and Ludlow"]}, {"page": "Avonside Engine Company", "response": ["In 1872 on the recommendation of Sir Charles Fox and Sons, Avonside built two large 42-ton  Fairlies for shipment to Canada, one each to the Toronto, Grey and Bruce Railway and the Toronto and Nipissing Railway. The Avonside Works Manager at the time these locomotives were built was Alfred Sacré, the brother of Charles Sacré Locomotive Engineer of the Manchester Sheffield & Lincolnshire Railway. Alfred Sacré trained under Archibald Sturrock at the Doncaster Plant of the Great Northern Railway and in 1872 moved from Avonside to the Yorkshire Engine Company, Sheffield where he built more Fairlie types."]}, {"page": "Scarborough and Whitby Railway", "response": ["Construction of the line began on 4 May 1872. The  line was engineered by Sir Charles Fox and Son, and cost approximately £27,000 () per mile. Included in the construction was a large 13-arch brick viaduct over the River Esk near Whitby (see Larpool Viaduct)."]}, {"page": "Narrow-gauge railways in Canada", "response": ["In Ontario, the Toronto, Grey and Bruce Railway (TG&BR) and the Toronto and Nipissing Railway (T&NR), were the first public passenger carrying narrow-gauge railways on the continent of North America, coming into service in the summer of 1871. The gauge of  was chosen on the recommendation of Carl Abraham Pihl, Chief Engineer of the Norwegian State Railways, who had adopted this gauge in Norway in the early 1860s. Sir Charles Fox, engineer and constructor of the Crystal Palace at the Great Exhibition of 1851 in London’s Hyde Park, was largely responsible for adoption of the gauge throughout the former British Empire and Colonies, it becoming commonly known as the ‘Colonial’ gauge. The objective of the Toronto, Grey and Bruce Railway and the Toronto and Nipissing Railway was to open up the bush country north of Toronto to settlement and commerce. The lines were first surveyed by John Edward Boyd of Saint John, New Brunswick, who, as Railway Engineer of that colony in the 1860s, had advocated the construction of the New Brunswick Railway on the gauge of 3 ft 6 in. Boyd later became the Chief Engineer of the narrow-gauge Prince Edward Island Railway. The chief Engineer of both the Toronto, Grey and Bruce Railway and the Toronto and Nipissing Railway was Edmund Wragge, a former pupil and associate of Sir Charles Fox. Wragge returned to Britain between 1895 and 1905 and was honoured by the award of the Telford Gold Medal of the Institution of Civil Engineers for his work on the approach to and construction of the London (Marylebone) terminus of the Great Central Railway. The Ontario lines were of substantial length, over  in aggregate, and both were built with the objective of connecting with a future Pacific railway, at Lake Nipissing in the case of the T&NR, and via steamers to the Lakehead in the case of the TG&BR. Only the latter was achieved. Although independent of each other financially, they were promoted and engineered by the same men and were in fact connected by a short length of third rail in the Toronto waterfront trackage of the Grand Trunk Railway. These Ontario railways attempted several innovations in addition to the adoption of the narrow gauge: the use of Clark’s six wheel radial axles for longer stock – a complete failure and never used; the use of four wheel boxcars for economy and flexibility – not entirely successful; the use of large Fairlie articulated 0-6-6-0 freight locomotives (see illustration) – found very powerful and useful initially, but heavy on maintenance and not pursued further; and the early use of powerful Avonside Engine Company 4-6-0 and Baldwin Locomotive Works 2-8-0 locomotives for freight haulage – very successful engines which remained in service with the Canadian Pacific Railway after gauge standardization. Initially very successful in stimulating trade, the two railways had difficulty carrying all the traffic offered in the early 1870s. Then, after they had bought large numbers of additional freight locomotives and boxcars, the traffic fell off due to the economic depression of the mid-1870s and was insufficient to support the heavy financial burden of the capital invested. A case of ‘too much, too late’. Like all smaller railways in central Canada in the early 1880s their financial difficulties made them vulnerable in the battle for feeder routes and traffic between the Grand Trunk Railway and the Canadian Pacific Railway (CPR). The Toronto and Nipissing Railway was amalgamated into the Midland Railway of Canada in 1881 and made standard gauge as part of the Midland's plan to obtain direct access to Toronto; later the whole enterprise was absorbed by the Grand Trunk Railway. The Toronto, Grey and Bruce Railway was first acquired by the Grand Trunk Railway which converted it to standard gauge in 1881, but following its own financial embarrassment it was forced to cede control to the Ontario and Quebec Railway a proxy for the Canadian Pacific Railway. Much of the trackage has been abandoned and lifted but some remains in service.  of the T&NR from Toronto to Stouffville carries GO Transit commuter trains and a further  from Stouffville to Uxbridge, Ontario, is operated as a tourist line by the York Durham Heritage Railway.  of the TG&BR from Toronto to Bolton, Ontario, carries CPR freight trains, and about  from Melville Junction to Orangeville is operated by the Orangeville-Brampton Railway.  Another tourist line, the Portage Flyer, operates at the Muskoka Heritage Place museum complex in Huntsville, and runs on  of  narrow-gauge track."]}, {"page": "Francis Fox (civil engineer)", "response": ["Born in Derby, England, he was one of three sons of the noted engineer and contractor Sir Charles Fox.", "Educated at Highgate School, Brighton College and Tonbridge School, he entered into business with his father and his brother Charles Douglas in 1857. In 1860 the three formed a partnership, the firm being known as Sir Charles Fox and Sons. In 1871 he designed the Telescopic Bridge in Bridgwater.  Fox was also a consultant for the Simplon Tunnel and in 1878 constructed the replacement train shed at Bristol Temple Meads railway station. He became an engineer for the Great Central Railway and, in 1889, collaborated with his brother Douglas and H.W. Braddock in the construction of Marylebone station, London. He also assisted his brother in the construction of the Liverpool Overhead Railway, which was opened in 1893."]}, {"page": "John William Grover", "response": ["Grover was the only son of Henry Montague Grover, the rector of Hitcham, Buckinghamshire. He was sent to Marlborough College and studied in Germany and under the engineer Sir Charles Fox. He left to work for the railway engineer John Fowler, surveying routes in Portugal. "]}, {"page": "Toronto, Grey and Bruce Railway", "response": ["He now advocated the use of the narrow gauge of  with all major construction in wood, which system he had developed since the early 1860s. Pihl's ideas had been noticed in Britain where the smaller Ffestiniog Railway in Wales was also proving a success. After a visit to Norway the  gauge was taken up by Sir Charles Fox and Sons, the firm founded by the eminent engineer and constructor of the Crystal Palace at the Great Exhibition of 1851. Fox had a very influential consulting practice throughout the former British Empire and Colonies and was instrumental in gaining acceptance for the  gauge in Canada, New Zealand, Australia and South Africa.", "The choice of the narrow gauge led to vigorous challenges in London, England and Canada. Zerah Colburn the editor of the London technical journal Engineering used its columns to violently criticise the advice of Douglas Fox, the elder son of Sir Charles Fox, to the promoters, which was taken up by the Hamilton, Ontario Spectator which supported that town's claim to be the hub, (rather than Toronto) of railway traffic for western Ontario.", "Based partly on contemporary British railway practice, the experience of Sir Charles Fox and Sons on the Queensland Railways, and Carl Abraham Pihl's work in Norway, the early rolling stock was intended to consist of short four-wheel boxcars, and longer six-wheel flat and passenger cars using Clark's radial axle arrangement. The four-wheel boxcars were reliable and suited the traffic at first but became too small for the increasing traffic and were not added to after 1874. Many became wayside grounded tool vans after gauge standardisation."]}, {"page": "Toronto and Nipissing Railway", "response": ["A charismatic Scots-born Toronto wharfinger and trader, George Laidlaw, took up the challenge. He was a business associate of the powerful Gooderham and Worts Distillery interests, and other Toronto bankers and merchants. Laidlaw advertised in newspapers in London, England for suggestions as to how railways might be built more cheaply in Canada. He received a reply from Carl Abraham Pihl, first managing engineer of Norway's Railway Construction Bureau. Pihl had worked on the construction, under Robert Stephenson, of the first Norwegian trunk railway – the Hovedbanen from Christiania (today Oslo) to Eidsvoll – which opened in 1854, where the same issues of overbuilding a line in a small farming and fishing economy had led to an unaffordable railway.  He now advocated the use of the narrow gauge of  with all major construction in wood, which system he had developed since the early 1860s. Pihl's ideas had been noticed in Britain where the smaller Ffestiniog Railway was also proving a success. After a visit to Norway, the 3 ft 6 in gauge was taken up by Sir Charles Fox and Sons, the firm founded by the eminent engineer and constructor of the Crystal Palace at the Great Exhibition of 1851. Fox had a very influential consulting practice throughout the former British Empire and Colonies and was instrumental in gaining acceptance for the  gauge in Canada, New Zealand, Australia and South Africa.", "The choice of the narrow gauge led to vigorous challenges in London, England and Canada. Zerah Colburn, the editor of the London technical journal Engineering, used its columns to violently criticise the advice of Douglas Fox, the elder son of Sir Charles Fox, to the promoters, and this was taken up by the Hamilton Spectator, which supported that town's claim to be the hub (rather than Toronto) of railway traffic for western Ontario. Abraham Fitzgibbon, the chief engineer of the Queensland Railways, came to the aid of the promoters with a speech in Toronto. The main opposition to the narrow gauge came from the Wellington, Grey and Bruce Railway in the west and the Port Whitby and Port Perry Railway in the east. Both lines were proposing to build competing lines on the  \"Provincial gauge\", and claimed that the choice of the narrow gauge was a ruse to ensure that all the traffic of the districts would be exclusively trans-shipped at Toronto, rather than Hamilton and Whitby. The opposition narrowly failed to defeat the narrow gauge, and provincial charters were granted to the Toronto and Nipissing Railway and the Toronto, Grey and Bruce Railway on March 4, 1868.", "Based partly on contemporary British railway practice, the experience of Sir Charles Fox and Sons on the Queensland Railways, and Carl Abraham Pihl's work in Norway, the early rolling stock was intended to consist of short four-wheel boxcars, and longer six-wheel flat and passenger cars using Clark's radial axle arrangement. The four-wheel boxcars were reliable and suited the traffic at first, but became too small for the increasing traffic, and were not added to after 1874. Many became wayside grounded tool vans after gauge standardisation. The first longer flatcars were built using imported sets of Clark's radial gear and put into service with the construction contractors. The intention was that they would go more easily around tight curves. Whether through bad design, poor assembly, or abuse and heavy uneven loading by the construction gangs, the six-wheel cars proved disastrously prone to derailment and were soon put aside in favour of cars re-equipped with two standard North American four-wheel trucks (bogies). The passenger cars were never used in six-wheel form due to safety concerns."]}, {"page": "William Bragge", "response": ["With a recommendation from Sir Charles Fox, Bragge, representing Edward T. Belhouse & Co. of Manchester, was sent to Brazil where he worked on the project to light Rio de Janeiro with gas, as well as surveying the first railway in Brazil. For his fine work, Bragge received distinctions from the emperor Don Pedro II, including the Order of the Rose. Bragge built the first line that was hauled by the locomotive, La Porteña, on the Ferrocarril Oeste de Buenos Aires. In addition, he built gas and waterworks for the city of Buenos Aires. He was a founder of Argentina's Primitiva de Gas Company."]}, {"page": "Derby", "response": ["In 1840, the North Midland Railway set up its works in Derby and when it merged with the Midland Counties Railway and the Birmingham and Derby Junction Railway to form the Midland Railway, Derby became its headquarters. The connection with the railway encouraged others, notably Andrew Handyside, Charles Fox and his son Francis Fox. ", "* Sir Charles Fox (1810–1874), civil engineer and contractor, focusing on railways, railway stations and bridges."]}, {"page": "Clement Wilks", "response": ["After being engaged for a short time on the Paris to Saint-Germain-en-Laye railway, which opened in 1837, he went to England and was articled to Sir Charles Fox, then of the London works and Resident Engineer of the London and Birmingham Railway. His professional education was continued with Messrs. Fox, Henderson and Co. until 1841. In 1842 he had the chief management of a French engineering establishment on the Garonne, where he remained for three or four years. He then returned to England and was engaged to work with Mr. George Watson Buck, M.Inst.C.E. on the Ely and Huntingdon railway, then in the course of construction. After Mr. Buck's retirement from ill-health, he was associated with Mr. John Hawkshaw in surveying for the Manchester and Southport line and subsequently for the Lancashire and Yorkshire Railway near Heckmondwike."]}, {"page": "Oxford, Witney and Fairford Railway", "response": ["Nonetheless a railway to Witney itself was desirable, and after some false starts a public meeting was held on 23 December 1858 to propose a branch line from the OW&WR at Yarnton, where there was to be a new junction station. Sir Charles Fox was appointed Engineer and in the 1859 session a Bill was presented to Parliament to authorise the railway. Despite GWR opposition, the Witney Railway was authorised by Act of 1 August 1859. Capital was to be £50,000 in shares and £16,000 in borrowings.Jenkins says £34,000 in shares and £16,000 in borrowings, but this seems to be an error; the phrase Capital £50,000 and one-third of the sum in debentures may have been misinterpreted."]}, {"page": "Skew arch", "response": ["The problem of building skew arch masonry bridges was addressed by a number of early civil engineers and mathematicians, including Giovanni Barbara (1726), William Chapman (1787), Benjamin Outram (1798), Peter Nicholson (1828), George Stephenson (1830), Edward Sang (1835), Charles Fox (1836), George W. Buck (1839) and William Froude (c. 1844).", " at Croft-on-Tees near Darlington. However, by 1836 a young engineer called Charles Fox had improved on Nicholson's helicoidal method and other writers were proposing alternative approaches to the problem.", "====Charles Fox's English method in brick====", "thumb|150px|left|Charles Fox (1810–1874)", "The idea was expanded in Charles Fox's 1836 publication On the Construction of Skew Arches, in which he considered the intrados of the barrel and the extrados as separate surfaces mapped onto concentric cylinders by drawing a separate development for each. This approach had two advantages. Firstly, he was able to develop a theoretical third, intermediate surface midway between the intrados and the extrados, which allowed him to align the centre of each voussoir, rather than its inner surface, along the desired line, thereby better approximating the ideal placement than Nicholson was able to achieve."]}, {"page": "George Berkley (engineer)", "response": ["Berkley was a consulting engineer for the Indian Midland Railway and, with Sir Charles Fox, built the 19–mile long Indian Tramway, a light railway running from Arconum to Conjeverum.  He served as president of the Institution of Civil Engineers from May 1891 to May 1892.."]}, {"page": "Charles Douglas Fox", "response": ["Douglas was born in Smethwick, Staffordshire, the oldest son of Sir Charles Fox and had two brothers and a sister. Sir Charles was a civil engineer and had designed, amongst other things, The Crystal Palace in Hyde Park.  Douglas was educated at Cholmondeley School, also known as Highgate School, from 1851 to 1854 and King's College School from 1854 to 1855. He studied at King's College London from 1855 to 1857 and was to have studied further at Trinity College, Cambridge but the financial collapse of his father's contracting company in 1857 ended his education. Douglas was instead articled to his father who had set up an engineering consultancy, Sir Charles Fox and Sons."]}, {"page": "Sir Charles Fox", "response": ["#REDIRECT Charles Fox (civil and railway engineer)"]}, {"page": "Bedford–Northampton line", "response": ["The first proposal to link the county towns of Northampton and Bedford was in 1845 by the Northampton, Bedford and Cambridge Railway, which intended to continue the line to Cambridge. No progress was made and the company collapsed leaving the shareholders out-of-pocket. A second attempt was made in 1864 when the route was surveyed by James Burke for the East and West Junction Railway but the scheme was dropped due to the demands made by owners of land along the proposed alignment. Another attempt was made by the Bedford, Northampton and Leamington Railway for which Sir Charles Fox & Son surveyed a route diverging west from Bedford, passing through Biddenham then south of Turvey to reach Olney before cutting across Flore and Weedon. The successful line was promoted by Lieutenant-Colonel W.B. Higgins of Picts Hill, Turvey, together with James Howard and William Henry Whitbread."]}, {"page": "Yarnton railway station", "response": ["On 13 November 1861, the Witney Railway opened a  branch line from the OW&WR at Yarnton to . By this time, the OW&WR had merged with the Worcester and Hereford Railway and the Newport, Abergavenny and Hereford Railway to become, as of 14 June 1860, the West Midland Railway (WMR). It was leased by the Great Western Railway for 999 years from 30 May 1861 and was taken over by this company from 1 August 1863. According to Sir Charles Fox, the engineer engaged by the Witney Railway to survey their line, the OW&WR had given an undertaking to build a station at Yarnton and to stop their trains to connect with services on the branch line. It was proposed that all Witney services would terminate at Yarnton, where \"a fine new inter-change station\" would be built providing connections to Worcester, Oxford, Witney and Euston. However, after the WMR had settled its differences with the Great Western and agreed to be leased by it in 1861, the through service from Worcester to Euston had been withdrawn from September and there was no need for a grand station at Yarnton."]}, {"page": "Peter Nicholson (architect)", "response": ["Charles Fox openly acknowledged Nicholson's contribution while claiming his own to be the superior method."]}, {"page": "Fox (surname)", "response": ["* Sir Charles Fox (civil and railway engineer) (1810–1874), English civil engineer"]}, {"page": "List of peaks on the British Columbia–Alberta border", "response": ["|Mount Fox||||||||||Elk Lakes||||||||believed to be named after Sir Charles Fox (1810–1874) British railway engineer associated with the introduction of the parallel switch.\""]}, {"page": "Edmund Wragge", "response": ["Wragge was educated at Rossall School on the Lancashire coast. When he was seventeen, in about 1853, he commenced his engineering career as a pupil with Messrs. Fox, Henderson and Company, London Works, Smethwick. John Henderson, the Scottish-born ironmaster, is said to have been a friend of Wragge's father. After the partnership between Fox and Henderson was wound up in the mid-1850s Wragge completed his pupilage in London with Sir Charles Fox and Son, until he was about twenty-two years of age in 1858. A position with Fox, the celebrated engineer of the Crystal Palace housing the Great Exhibition of 1851, would have required payment of a substantial premium.Personal communication with Mrs Ann Mitchell, North Hatley, Quebec. Great-great-granddaughter of Edmund Wragge.", "In 1859 Wragge went to South Africa where he remained for three and a half years as a district engineer on the construction of the Cape Town and Wellington Railway. The consultant engineer of the proposed line was Sir Charles Fox, who had submitted an estimated cost of £500,000 in 1851. The line was built by the Cape Town Railway and Dock Company, which was incorporated in London in 1853, with a concession to build a line from Cape Town to Wellington. Wragge was responsible, under a resident engineer, for work on 14 miles of the line. It is likely that it was a part of the line near Stellenbosch, where the railway arrived in 1862, for he married Lucy Eliza Carlyon, the sixteen and a half year old daughter of a Cornish Anglican clergyman there in November 1861. The railway was completed to Wellington in 1863.", "Wragge then returned to England with his wife, and for a year (1862–63) he was an assistant engineer on the London, Chatham and Dover Railway. Then for the three years between 1863 and 1866, he became resident engineer in charge of the reconstruction of the approaches from Battersea to Victoria Station, for the London Chatham & Dover, the London Brighton & South Coast, and the London & South Western Railways. Sir Charles Fox & Sons engineered this complex scheme of high level lines at Battersea, and the widening of the railway bridge over the Thames. ", "During this period he prepared a proposal (one of several between 1850 and 1900), for a light railway in the Rother Valley of Sussex. Plans and documents developed by Sir Charles Fox and Edmund Wragge were deposited on 30 November 1865. The line was not built until 1900 when it was constructed by Colonel Fred Stephens as the Rother Valley Railway, the first of the notoriously uneconomic light railway projects that Stephens engineered. Later it became the Kent and East Sussex Railway, parts of which are now a preserved steam railway line.", "His relationship with Sir Charles continued when Fox asked him to go to Costa Rica in December 1868, to make a survey for a narrow gauge railway across the country from the Atlantic to the Pacific Coast. On the basis of the survey, Sir Charles Fox and Sons were to submit a bid to construct the line. Wragge took along his brother in law, Leonard Carlyon, as his assistant. After a long and difficult journey by steamer to Panama, by rail across the Isthmus, another steamer to the Pacific coast of Costa Rica, followed by several days in a mule train to the capital, San José, he was devastated to find that American contractors had beaten him by two weeks, and scooped up the contract. After fruitless negotiations to try to upset the provisional contract, Wragge and Carlyon set off back to England, but both contracted fever in Panama, from which Carlyon died on board ship and was buried in Jamaica.", "In 1869 Wragge applied for membership of the Institution of Civil Engineers, which was granted in January 1870. He was sponsored by Sir Charles Fox, and his candidate circular provides not only details of his career, but also an insight into Wragge's lengthy list of seconders from the railway industry, including some distinguished proponents of the narrow gauge such as Sir Henry Whatley Tyler, HM's chief inspector of railways.", "On his return from Costa Rica, Wragge's letters indicate that he worked on a project in the English Midlands for some months until Sir Charles Fox secured for him the position of chief engineer of the Toronto, Grey and Bruce Railway (TG&BR),  and the Toronto and Nipissing Railway (T&NR) in July 1869. This placement must have been settled by telegram, because Douglas Fox left Toronto on 27 July 1869, promising to have an engineer sent out, and Edmund Wragge departed for Norway to see Pihl's narrow gauge railways on 1 August 1869. Wragge arrived in Toronto in September 1869 and between that time and late 1874 he engineered and constructed over 280 route miles of the 3 ft 6 in gauge railways, at a total cost of £900,000. The railways were built economically as a practical means of opening up the interior of the province of Ontario to settlement.", "Wragge returned occasionally to Britain during this period and a letter in his 1883 correspondence indicates that he was working there with Sir Charles Fox and Sons on negotiations for the building of the Quebec North Shore Railway. Sir William Cornelius Van Horne, the president of the Canadian Pacific Railway (CPR) asked Wragge in 1888 to act as an arbitrator in compensation negotiations between the CPR and the Canadian government.", "His work on the rebuilding of Union Station and continued association with Douglas Fox led to his return to Britain, at the age of 60, in 1896,  to participate in the building of the last main line into Central London, that of the Great Central Railway. Construction of this heavily engineered connection commenced in late 1894, of which the most difficult part was to drive a mainline railway through the London suburbs to a terminus at Marylebone. This was the section for which Sir Charles Fox and Sons were the consultants. Edmund Wragge was the resident engineer from 1897 to 1899 and lived in the St Marylebone district, close to the construction works. The completion of the line in March 1899, was marked by the presentation of several technical papers to the Institution of Civil Engineers. G. A. Hobson and Edmund Wragge gave a lengthy and detailed paper in November 1900, describing the engineering and construction of the approaches to Marylebone Station. The Institution Of Civil Engineers awarded Wragge and Hobson the Telford Medal and premiums for this work. Hobson is credited with the design of the great railway bridge of 1905 over the Zambezi River at Victoria Falls."]}, {"page": "Mount Fox (Canada)", "response": ["Mount Fox is a  mountain on the shared border between Alberta and British Columbia, Canada. It is situated  on the Continental Divide south of the Kananaskis Lakes area of the Canadian Rockies. It was named in 1859 by John Palliser after Sir Charles Fox (1810-1874), a member of the Royal Geographical Society."]}, {"page": "Scots Charitable Society of Boston", "response": ["On St. Andrew's Day in 1857 the group held a 200th anniversary supper at the Revere House hotel. The society's \"president was escorted from his residence by the members of the society, some of whom, with himself, were dressed in the Highland costume. They were preceded by pipers, who played national airs. The meeting was most enthusiastic, and the president gave an excellent speech.\" \"Addresses were made by Mr. Henry Grattan, H.B.M. Consul; Sir Charles Fox, builder of the Crystal Palace, London ; J.D. Andrews, Esq.; Charles W. Story, Esq,; Messrs. John C. Crowley, President of the Irish Charitable Society; James Cruickshanks, and others. Poems were read by Dr. William Wallace Morland and Jeffrey Brackett, Esq.; and national songs sung by various members of the Society and of the Caledonia Club. Letters were read by the Secretary from the Hon. Robert C. Winthrop, Samuel A. Eliot, Esq., and Dr. Holmes, regretting that they could not be present, and expressing sentiments of the warmest interest towards this the oldest of Charitable Societies in the States. After singing 'Auld Lang Syne' and dancing 'Ronald McDonald' the meeting adjourned.\""]}, {"page": "List of fellows of the Royal Society of Arts", "response": ["* Sir Charles Fox"]}]}}