{"wiki_id": "http://www.wikidata.org/entity/Q1067045", "itemLabel": "Charlie Winston", "itemDescription": "English singer-songwriter", "wikipedia_url": "https://en.wikipedia.org/wiki/Charlie_Winston", "wikipedia_page": {"main": "Charlie Winston Gleave (born 14 September 1978), better known as Charlie Winston, is an English singer-songwriter based in London. Winston has so far had his most significant commercial success in France.\n\n", "link_mentions": [{"page": "Hobo", "response": ["* \"Like a Hobo\" by Charlie Winston"]}, {"page": "Audrey Tautou", "response": ["She appeared in the music video of \"I Love Your Smile\", a song by British singer-songwriter Charlie Winston."]}, {"page": "Real World Records", "response": ["* Charlie Winston", "*In Your Hands, Charlie Winston, 2009"]}, {"page": "Paléo Festival", "response": ["*Charlie Winston", "*Charlie Winston"]}, {"page": "Southside Festival", "response": ["*Charlie Winston"]}, {"page": "Hurricane Festival", "response": ["| Alberta Cross, Archive, Ash, Band Of Skulls, Beatsteaks, Biffy Clyro, Bigelf, Billy Talent, Bonaparte, Boys Noize(performance cancelled), Bratze, Charlie Winston, Coheed And Cambria, Cosmo Jarvis, Cymbals Eat Guitars, Danko Jones, Deftones, Deichkind, Dendemann, Does It Offend You, Yeah?, Donots, Dropkick Murphys, Element of Crime, Enter Shikari, Erol Alkan (performance cancelled), Faithless, Florence and the Machine, FM Belfast, Frank Turner, Frittenbude, Good Shoes, HORSE the Band, Hot Water Music, Ignite, Jack Johnson, Jennifer Rostock, Kap Bambino, Kashmir, Katzenjammer, K's Choice, La Roux, LaBrassBanda, LCD Soundsystem, Local Natives, Madsen, Mando Diao, Marina And The Diamonds, Massive Attack, Moneybrother, Mr. Oizo, Paramore, Phoenix featuring Richard Conwaaaaay, Porcupine Tree, Revolverheld, Shout Out Louds, Skindred, Skunk Anansie, Stone Temple Pilots, Tegan and Sara, The Blackout, The Bloody Beetroots, The Gaslight Anthem, The Get Up Kids, The Hold Steady, The Prodigy, The Specials, The Strokes, The Temper Trap, The XX, Timid Tiger, Turbostaat, Two Door Cinema Club, Vampire Weekend, We Are Scientists, White Lies, Zebrahead"]}, {"page": "Eurockéennes", "response": ["* Charlie Winston"]}, {"page": "Émilie Simon", "response": ["* \"Ballad of the Big Machine\" featuring Charlie Winston (2010)"]}, {"page": "Caribana Festival (Switzerland)", "response": ["Side stages: Editors, Travis, Chris Cornell, Fink (UK), Fuse Factory, Wipe Out, Fullblast, Poni Hoax, Dub Incorporation, Madcon, Stress, UB40, Sand, Hindi Zahra, Project5, Junior Tshaka, Tweek, Nneka, Dan Black, Katy Perry, Charlie Winston, Thomas Dutronc, Licia Chery, Krystle Warren, Krash on Earth, Victori4, Dorian Gray, Yoav", "Main stage : Pony Pony Run Run, Gossip, Everlast, Kasabian, Gorillaz Sound System, Dropkick Murphys, Lou Reed, The Specials, Grand Corps Malade, Charlie Winston, Keziah Jones, 2manydjs"]}, {"page": "Vieilles Charrues Festival", "response": ["**Saturday, July 18 : Charlie Winston, Renan Luce, Les Tambours du Bronx, Ghinzu, La Rue Kétanou, Cocoon, Izia, Coming Soon, Nashville Pussy, Naïve New Beaters, The Driver (aka Manu le Malin), Surkin, Metronomy, Big Fest Noz, Championnat du monde d'Air Biniou"]}, {"page": "This Wheel's on Fire", "response": ["Other artists who have released their own versions of the song include: Hamilton Camp, Phil Lesh, Golden Earring, Elvis Costello, the Hollies, Ian and Sylvia, Les Fradkin, Leslie West, Serena Ryder, Charlie Winston, June Tabor, Guster, Marco Benevento and Rat Scabies."]}, {"page": "I'm a Man (The Spencer Davis Group song)", "response": ["Volkswagen aired a UK television commercial titled \"Dog\" in late winter 2008, which featured a dog miming singing \"I'm a Man\". The version used in the advertisement for the Polo was a cover version by a young British singer-songwriter, Charlie Winston. The Noam Murro-directed advert was banned after complaints from the RSPCA and over 750 viewers."]}, {"page": "Tom Baxter", "response": ["Tom Baxter (born Thomas Baxter Gleave, 29 October 1973) is an English singer-songwriter based in London. He was born in Ipswich, Suffolk, and grew up in Cornwall with his sister Vashti Anna, two brothers, Jo Spencer and Charlie Winston, and parents Jeff and Julie Gleave (who were regulars on the folk music circuit in the late 1960s and early 1970s).  Tom and his siblings use their middle names as stage surnames."]}, {"page": "Wax Tailor", "response": ["In 2009, Wax Tailor came back with \"Say Yes\", his first single on his new album In the Mood for Life, released on 21 September, featuring with Charlie Winston, Charlotte Savary, Sara Genn, Dionne Charles, A State of Mind, Mattic, Ali Harter, and Speech Defect."]}, {"page": "Beirut Central District", "response": ["Some of the jazz artists who have taken part in the festival recently are Rabih Abou-Khalil, Charbel Rouhana, Marcus Miller, Patti Austin, Randy Crawford, Joe Sample, Arturo Sandoval, Charlie Winston, Chucho Valdés and several others."]}, {"page": "Osheaga Festival", "response": ["Sunday: Galactic with Cyril Neville, Ian Kelly, Ariane Moffatt, Charlie Winston, Snoop Dogg, Metric"]}, {"page": "Gurtenfestival", "response": ["(15–18 July): Amy Macdonald, An Horse, Archive, Babyshambles, Bad Religion, Band of Skulls, Biffy Clyro, Blood Red Shoes, Charlie Winston, Chocquibtown, Editors, Empire of the Sun, Faith No More, Florence and the Machine, Gogol Bordello, Gossip, Groove Armada, Jet, John Butler Trio, Lunik, Milow, Open Season, Rodrigo y Gabriela, Sens Unik, Skunk Anansie, Steff la Cheffe, Stereophonics, The Kooks, The Parlotones"]}, {"page": "The Spitz", "response": ["Acts that played over the years at The Spitz include 17 Hippies, 3 Men & Black (The Selecter, The Stranglers, Bad Manners), A Hawk and a Hacksaw, Acoustic Ladyland, Adem, Ai Phoenix, Aiden Smith, Apparat, Athlete, Baba Maal, Bert Jansch, Beth Orton, Big Strides, Bikini Atoll, Billy Bragg, Billy Childish, Cat Empire, Charlie Winston, Chris T-T, Cobra Killer, Davey Graham, Dick Dale, Ed Harcourt, Fionn Regan, Fonda 500, Glen Matlock, GLORYHOLE! Gravenhurst, Great Lake Swimmers, Hayden, Historia, Holly Golightly, Florence and the Machine, Hot Chip, Jamie Woon, Joan as a Policewoman, John Parish, John Renbourn, Joni Davis, Kate Nash, King Creosote, Lee Ranaldo (Sonic Youth), Little Axe, Little Barrie, Little Sparta, Low, Minutemen, Mr. Hudson, Nought, Omar, Pete and the Pirates, Pete Molinari, Phoenix, Pips, Chips and Video Clips, Polar Bear, Rachel Unthank (The Unthanks), Ralfe Band, Richard Hawley, Rodrigo Y Gabriela, Roy Harper, Seasick Steve, Son of Dave, Spiers & Boden, St. Thomas, Terry Edwards, Thalia Zedek, The Gossip, The Horrors, The Long Blondes, The Men They Couldn't Hang, The Wave Pictures, Tom Baxter, Tom Morello (Rage Against the Machine), Tunng, Turin Brakes, Vetiver feat Devendra Barnhart and many more. "]}, {"page": "European Border Breakers Award", "response": ["| United Kingdom || Charlie Winston || Hobo"]}, {"page": "Jamie Morrison", "response": ["* Charlie Winston - Hobo - Album - Drums and percussion"]}, {"page": "List of number-one hits of 2009 (France)", "response": ["|Charlie Winston", "|Charlie Winston", "|Charlie Winston", "|Charlie Winston", "|Charlie Winston", "|Charlie Winston", "|Charlie Winston", "|Charlie Winston", "|Charlie Winston", "|Charlie Winston", "|Charlie Winston", "|Charlie Winston", "|Charlie Winston"]}, {"page": "Hobo (Charlie Winston album)", "response": ["Hobo is the second album by British singer-songwriter Charlie Winston.  It was released by Real World Records in 2009.", "* The official Charlie Winston website", "* Charlie Winston's profile on MySpace", "Category:Charlie Winston albums"]}, {"page": "1920 Dayton Triangles season", "response": ["* Charlie Winston (G)"]}, {"page": "Make Way (Charlie Winston album)", "response": ["Make Way is the first album by British singer-songwriter Charlie Winston.  It was released in 2007.", "* The official Charlie Winston website", "* Charlie Winston's profile on MySpace", "Category:Charlie Winston albums"]}, {"page": "List of artists who have covered Bob Dylan songs", "response": ["|data-sort-value = \"Winst\"|Charlie Winston||This Wheel's on Fire||"]}, {"page": "Like a Hobo", "response": ["\"Like a Hobo\" is a 2009 song recorded by British singer-songwriter Charlie Winston. It was the lead single from his second album Hobo on which it appears as the second track. Released in April 2009, the song achieved great success in Belgium (Wallonia) where it was ranked since January thanks to downloads, and was a top ten hit for 15 weeks. In France, it debuted at number-one on 11 April and stayed for eleven weeks in the top five.", "Category:Charlie Winston songs"]}, {"page": "Germany in the Eurovision Song Contest 2010", "response": ["| 1 || align=\"left\" | Christian Durstewitz || align=\"left\" | \"I'm Yours\" (Jason Mraz) || 5 || align=\"left\" | \"In Your Hands\" (Charlie Winston) || Eliminated"]}, {"page": "The Big Machine", "response": ["*\"The Ballad Of The Big Machine\" (featuring Charlie Winston)"]}, {"page": "Glastonbury Festival 2010", "response": ["The Lightning SeedsAlabama 3Charlie WinstonSteve Harley & Cockney RebelThe UnthanksThe Avett BrothersThe WurzelsNick HarperTom Williams & The Boat"]}, {"page": "List of number-one singles of 2010 (France)", "response": ["|Charlie Winston"]}, {"page": "Stefano Lentini", "response": ["Lentini collaborates with English songwriter Charlie Winston for the Main Title of the TV Series The Red Door. The song, titled \"It's Not Impossible\" was n#2 in the iTunes Soundtrack Chart in Italy."]}, {"page": "NRJ Music Awards 2010", "response": ["# \"Kick the Bucket\" by Charlie Winston – 2:41", "# \"Kick the Bucket\" by Charlie Winston"]}, {"page": "Apple Music Festival", "response": ["* July 28: Amadou and Mariam + Charlie Winston"]}, {"page": "So Fresh: The Hits of Spring 2010", "response": ["#Charlie Winston - \"In Your Hands\""]}, {"page": "Battle of the Blades (season 2)", "response": ["|\"I Love Your Smile\" – Charlie Winston", "|\"I Love Your Smile\" – Charlie Winston"]}]}}