{"wiki_id": "http://www.wikidata.org/entity/Q1064515", "itemLabel": "Charles Geddes, Baron Geddes of Epsom", "itemDescription": "British trade unionist", "wikipedia_url": "https://en.wikipedia.org/wiki/Charles_Geddes,_Baron_Geddes_of_Epsom", "wikipedia_page": {"main": "Charles John Geddes, Baron Geddes of Epsom, CBE (1 March 1897 – 2 May 1983) was a British trade unionist.\nBorn in Camberwell, London, his parents were active socialists in the Labour movement at a time that the Labour party was being founded in London.\nCharles attended Blackheath Central School but left still aged only thirteen.   He joined the Post Office in 1911 as a boy messenger, running errands.  In his spare time he worked for a shopkeeper in Deptford, East London where he first came into contact with the Post Office Workers Union.\nHe served as a fighter pilot in the Royal Flying Corps during World War I, being commissioned a pilot officer in 1918.\nOn returning to civilian work, Geddes became active in the new Union of Post Office Workers rising to district chairman of the London district of the union's council.  During the Second World War he was appointed assistant-general secretary of the UPW.  He was Deputy General Secretary of the union from 1941, and then General Secretary from 1944 to 1957.  In 1946 he joined the board of the TUC.  He ruled on shipbuilding and engineering disputes for the Attlee government.   He referred wage claims to and impartial body before the establishment of ACAS.  Geddes became authoritative and knowledgeable about the extent and scope of industrial disputes.  In 1955, he served as President of the Trades Union Congress.Geddes was Chairman of Polyglass Ltd.Appointed a Commander of the OBE in 1950,In 1957, Geddes was offered a Knighthood by the Macmillan government, he accepted, and then promptly resigned his position in UPW.On 4 August 1958, he became the third life peer created by letters patent under the Life Peerages Act 1958, with the title Baron Geddes of Epsom, of Epsom in the County of Surrey, and was introduced on 22 October.   He argued strongly in his maiden speech for extending protection of old age pension schemes.  He praised the plucky Londoners who had defended the country during the Blitz, suggestive of the man in the boiler suit, a kind of community socialist.  Geddes was not especially happy in the Lords which involved much complicated legal procedure and conventional rules.  Being a Keynesian he verged on a strongly unionised planned economy that was more socialist than mixed.  He proposed round table negotiations with employers as a way of reducing unemployment.  This new approach presaged the Wilsonian bureaucracy that attempted to modernise and improve productivity.  Incentivisation was intrinsic argued Geddes, so that workers could share in economic benefits.   In 1963 he told the Macmillan government that more investment was required in the Post Office.He died aged 86.", "link_mentions": [{"page": "Geddes (surname)", "response": ["*Charles Geddes, Baron Geddes of Epsom (1897–1963), British entrepreneur and life peer"]}, {"page": "Baron Geddes of Epsom", "response": ["#REDIRECT Charles Geddes, Baron Geddes of Epsom"]}, {"page": "Lord Geddes of Epsom", "response": ["#REDIRECT Charles Geddes, Baron Geddes of Epsom"]}, {"page": "Charles Geddes", "response": ["#REDIRECT Charles Geddes, Baron Geddes of Epsom"]}, {"page": "Charles John Geddes", "response": ["#REDIRECT Charles Geddes, Baron Geddes of Epsom"]}, {"page": "Charles Geddes (trade unionist)", "response": ["#REDIRECT Charles Geddes, Baron Geddes of Epsom"]}]}}