{"wiki_id": "http://www.wikidata.org/entity/Q1074342", "itemLabel": "Ching-He Huang", "itemDescription": "British Chinese television chef, food writer and food entrepreneur", "wikipedia_url": "https://en.wikipedia.org/wiki/Ching_He_Huang", "wikipedia_page": {"main": "Ching-He Huang  (Chinese: 黃瀞億; pinyin: Huáng Jìngyì; Wade–Giles: Huang2 Ching4-i4; born  (1978-04-08) 8 April 1978), often known in English-language merely as Ching, is a Taiwanese-born food writer and TV chef.  She has appeared in a variety of television cooking programmes, and is the author of nine best-selling cookbooks.  Ching is recognised as a foodie entrepreneur, having created her own food businesses.  She has become known for Chinese cookery internationally through her TV programmes, books, noodle range, tableware range, and involvement in many campaigns and causes.", "link_mentions": [{"page": "List of Iron Chef America episodes", "response": ["|style=\"background:lightblue\"|Michael Symon & Ching-He Huang"]}, {"page": "Saturday Kitchen", "response": ["* Ching-He Huang", "Series 1 (2013):Each show, James Martin was joined by guest chefs, including: Gennaro Contaldo, Daniel Galmiche, Ching-He Huang, Nathan Outlaw, Theo Randall, Vivek Singh, and Bryn Williams.", "Series 2 (2014):James Martin returned for another 10-episode run of Christmas Kitchen in December 2014. Over the 10 episodes, he was joined by several respected chefs, including: Jason Atherton, Galton Blackiston, Monica Galetti, Ching-He Huang, Nathan Outlaw, Glynn Purnell, and Bryn Williams.", "For each show, Kerridge was joined by different chefs, including: Jason Atherton, Michael Caines, Daniel Clifford, Gennaro Contaldo, Lisa Goodwin-Allen, Angela Hartnett, Ching-He Huang, Tom Kitchin, Glynn Purnell, Theo Randall, and Bryn Williams."]}, {"page": "...Cooks!", "response": ["*Ching-He Huang"]}, {"page": "List of British Chinese people", "response": ["* Ching-He Huang, food broadcaster and food writer"]}, {"page": "Taste (TV series)", "response": ["Chefs appearing on the show included Jean-Christophe Novelli, Marcus Wareing, Richard Phillips, Ed Baines, Paul Bloxham, Gino D'Acampo, Merrilees Parker, and Ching-He Huang."]}, {"page": "Chinese Food Made Easy", "response": ["*Interviews: Ching-He Huang Radio86"]}, {"page": "Chinese Food in Minutes", "response": ["Chinese Food in Minutes is a 13-part peak time cooking television series commissioned and shown by Five, first aired on 9 February 2010. The first part of Chinese Food in Minutes, with chef Ching-He Huang, served up 1 million viewers and 4% share that night. The series Chinese Food in Minutes was based on Huang's title of the same name, published by HarperCollins in September 2009.", "* Ching-He Huang's Official Website"]}, {"page": "Don Chow Tacos", "response": ["Don Chow Tacos and owner Lau were featured on the  Cooking Channel's show \"Easy Chinese\" hosted by Ching-He Huang in June 2012.  The episode focused on late night street food.  Lau prepared one of Don Chow's signature dishes, the Chinese BBQ Pork taco, while Huang prepared a spicy oyster omelet \"Taco\"."]}]}}