{"wiki_id": "http://www.wikidata.org/entity/Q1079243", "itemLabel": "Christian Darnton", "itemDescription": "British composer", "wikipedia_url": "https://en.wikipedia.org/wiki/Christian_Darnton", "wikipedia_page": {"main": "Philip Christian Darnton (30 October 1905 – 14 April 1981), also known as Baron von Schunck, was a British composer and author.", "link_mentions": [{"page": "Robert Nichols (poet)", "response": ["In 1919 the English composer Kaikhosru Shapurji Sorabji wrote Music to \"The Rider by Night\" (not extant in full).Sorabji archive Peter Warlock (a close friend) composed a choral setting of The Full Heart in 1916, and a song setting of The Water Lily in 1922, along with others, now lost.Peter Warlock Society: Complete Works of Peter Warlock The Naiads' Music and The Pigeon Song were set by Arthur Bliss (also a friend) in his Pastoral: (Lie Strewn White Flocks) of 1928,Music Sales Classical and Bliss also used Dawn on the Somme in his choral symphony Morning Heroes of 1930. E J Moeran set Blue-eyed spring for voice and piano in 1932National Library of Australia and used poetry from the unfinished play Don Juan Tenorio the Great for his Nocturne for baritone solo, chorus and orchestra of 1935.National Library of Australia Christian Darnton set five poems by Nichols in his 1938 work Swansong, for soprano and orchestra.The LeiderNet Archive"]}, {"page": "Randall Swingler", "response": ["Swingler was an accomplished flautist, playing regularly with the professional London orchestras. He was later much involved in musical collaboration as a librettist, including song cycles with Benjamin Britten (Advance Democracy, 1938), Alan Bush (The Winter Journey, 1946) and Alan Rawsthorne (A Canticle of Man, 1953). His friend John Sykes also set the four poems of Homage to John Dowland in 1957.Fearful Symmetry – Songs and piano music, reviewed at MusicWeb International Among several notable pieces, Swingler co-wrote Ballad of Heroes with Britten and the poet W. H. Auden and wrote a new version of the English lyrics of the Polish revolutionary song \"Whirlwinds of Danger\".Ballad of Heroes There are settings of his verse by Arnold Cooke, Christian Darnton, Erik Chisholm, Norman Demuth, John Ireland, Elisabeth Lutyens, and Bernard Stevens."]}, {"page": "Nigel Balchin", "response": ["His first marriage broke up following a partner-swapping arrangement between the Balchins, the artist Michael Ayrton and the latter's partner Joan. Elisabeth also had an affair with the composer Christian Darnton. Balchin divorced Elisabeth in 1951 and she married Ayrton a year later. Balchin included an unflattering caricature of Darnton as the poet Stephen Ryle in his novel Darkness Falls from the Air (1942)."]}, {"page": "Percy Scholes", "response": ["\"Nothing he put out was ever \"ghosted\"; all bore the individual stamp of the salty P.A.S style.\" wrote W.R Anderson in 1958.Musical Times No 1387, September 1958, p 501 In his writing for this work, and elsewhere, Scholes never believed in holding back his personal views in favour of a neutral point of view. He is credited  with the description of harpsichord music as sounding like \"a toasting fork on a birdcage\"; when describing Handel and Bach, he said that \"Handel was the more elegant composer, but Bach was the more thorough\". Scholes led the public denunciations of Arthur Eaglefield Hull when it was found that his book Music: Classical, Romantic and Modern (1927) was found to have borrowed material from other writers. How much of this was plagiarism and how much a mere careless, hasty failure to cite sources is not known, but the scandal left Hull very upset. He took his own life by throwing himself under a train at Huddersfield station on 4 November, 1928.Sibley Music Library: Arthur Eaglefield HullScholes, Percy. \"The Ethics of Borrowing\", Musical Times, No 1019, 1 January 1928, p 59 Reviews of Christian Darnton's You and Music (1940) were generally positive until Scholes catalogued so many serious and obvious errors (such as “Binary form may be represented by A.B.A.”) that he presented the work as an elaborate joke to trap unwary reviewers.Scholes, Percy A. \"Our Humourless Reviewers\", Musical Times No 1179, May 1941, p 176-177 "]}, {"page": "Harry Farjeon", "response": ["Farjeon left the Royal Academy of Music in 1900, but in 1901 he returned to teach composition. Two years later, at the age of 25, he became the Academy's youngest ever professor, having become the family wage-earner after the death of his father. Among his pupils were Mary Chandler, George Lloyd, Christian Darnton, Geraldine Mucha, Phyllis Tate, Daniel Jones and Steve Race. He also taught at the Blackheath Conservatoire."]}, {"page": "Cyril Rootham", "response": ["In 1914 Rootham had become a Fellow of St John's after taking over the post of University Lecturer in Form and Analysis of Music. In 1924 he was made Senior Lecturer in Counterpoint and Harmony. Rootham was also a much appreciated teacher of orchestration. His many students included Arthur Bliss, Arnold Cooke, Christian Darnton, Armstrong Gibbs, Patrick Hadley, Walter Leigh, Basil Maine,  Robin Orr, Bernard Stevens and Percy Young."]}, {"page": "Crown Film Unit", "response": ["Music was an important element. The conductor Muir Mathieson was the director of music for many productions, and notable composers commissioned to write original scores included Walter Leigh, Benjamin Britten, Ernst Meyer, Richard Addinsell, Benjamin Frankel, Christian Darnton, Guy Warrack and Arthur Benjamin.Mathieson, Muir. 'Music for Crown', in Hollywood Quarterly. Vol. 3, No. 3 (Spring, 1948), pp. 323-326 "]}, {"page": "List of symphony composers", "response": ["*Christian Darnton (1905–1981), British composer of 4 symphonies"]}, {"page": "1981 in British music", "response": ["*14 April – Christian Darnton, composer, 75"]}, {"page": "Montagu Slater", "response": ["Slater was also involved in staging large pageants, including one in 1938 at Wembley Stadium. For this, he wrote a scenario with André van Gyseghem for composer Alan Bush's ‘Pageant of Co-operation.’ He was one of a group of Communist intellectuals who came together to celebrate the 100th anniversary of the publication of the Communist Manifesto in 1948 with a pageant held at the Royal Albert Hall on 30 March 1948. Music and arrangements by composers including Rutland Boughton, Christian Darnton, Inglis Gundry, Phillip Cardew, Malcolm Arnold, Aubrey Bowman, and Bernard Stevens. Alan Bush arranged music for the Finale comprising The Red Flag and The Internationale. The entire event was scripted by Slater."]}, {"page": "Darnton", "response": ["* Christian Darnton, British composer"]}, {"page": "List of compositions for viola: C to E", "response": ["* Christian Darnton (1905–1981)"]}, {"page": "Edward Clark (conductor)", "response": ["He was responsible for producing a number of important world and British premieres (some of which he also conducted), and he was associated with most of the important European and British composers, such as Arnold Schoenberg, Anton Webern, Alban Berg, Ferruccio Busoni, Igor Stravinsky, Béla Bartók, Paul Hindemith, William Walton, Arthur Bliss, Arnold Bax, Peter Warlock, John Ireland, Constant Lambert, Arthur Benjamin, Humphrey Searle, Denis ApIvor, Alan Rawsthorne, Benjamin Britten, Michael Tippett, Benjamin Frankel, Roberto Gerhard, Luigi Dallapiccola, Christian Darnton and others."]}, {"page": "Sophie Wyss", "response": ["In 1936, together with Adolph Hallis, Benjamin Britten, Alan Rawsthorne and Christian Darnton, Wyss was a founder of the Hallis Concert Society, which gave a number of innovative concerts in London in the period 1936–1939. These included British premieres of both contemporary and historical British and European music, including works of Giovanni Pierluigi da Palestrina, François Couperin, Alban Berg, Paul Hindemith, Elisabeth Lutyens and Elizabeth Maconchy.Plant (n.d.) Details of the programmes of these concerts are given at the Concert Programmes: Darnton collection site of the Arts and Humanities Research Council (accessed 10 June 2014)."]}, {"page": "Adolph Hallis", "response": ["During his career Hallis premiered numerous works, including piano concertos by Alan Rawsthorne and Erik Chisholm.Mears (n.d.)  He gave the first British performance of Dmitri Shostakovich's First Piano Concerto in Birmingham in 1936. Although Arnold Cooke's Piano Concerto (1939/'40) was written for Hallis, the outbreak of WWII prevented him giving its première, which was given instead by Louis Kentner with the BBC Symphony Orchestra under Clarence Raybould in 1943 in a studio broadcast for the BBC's Third Programme. In 1938 he made, for Decca Records, the first complete recording of the piano Préludes of Claude Debussy.Siek (2011), 324–5. With Sophie Wyss, Alan Rawsthorne, Christian Darnton and Benjamin Britten he formed the Hallis Concert Society, which gave a number of innovative concerts in London in the period 1936–1939. These included British premieres of both contemporary and historical British and European music, including works of Giovanni Pierluigi da Palestrina, François Couperin, Arnold Cooke, Alban Berg, Paul Hindemith, Elisabeth Lutyens and Elizabeth Maconchy.Plant (n.d.) Details of the programmes of these concerts are given at the Concert Programmes: Darnton collection site of the Arts and Humanities Research Council (accessed 10 June 2014)."]}, {"page": "Elizabeth Ayrton", "response": ["Elisabeth's first marriage ended following an affair with composer Christian Darnton,Collett, Derek (2015). His Own Executioner: The Life of Nigel Balchin. SilverWood. . and later a partner-swapping arrangement between the Balchins, the painter Michael Ayrton and his partner, Joan.  Balchin divorced Elisabeth in 1951 and she married Ayrton a year later. After her marriage she started to write. She submitted pieces successfully to various magazines, her poetry was read on BBC radio and she contributed to  Woman's Hour. Her first novel, 'The Cook's Tale' (entitled \"Sauce and Sensuality\" in the USA) was published in 1957. She wrote three further novels:  \"The Cretan\" (entitled \"Silence in Crete\" in the USA) in 1963, \"Two Years in My Afternoon\", (1972) and \"Day Eight\" (1978). Her archaeological book \"The Doric Temple\" was published in 1957."]}, {"page": "Iris Lemare", "response": ["In 1931, Lemare, Elisabeth Lutyens and Anne Macnaghten created a series of concerts showcasing British composers. They performed 40 new works in these Macnaghten-Lemare Concerts, which featured music written by Benjamin Britten, Christian Darnton, Gerald Finzi, Luytens, Elizabeth Machonchy, Alan Rawsthorne, John Sykes and Michael Tippett. These series of concerts provided unknown composers with a platform and gave opportunities to young musicians. The chamber orchestra assembled by Lemare included a majority of women string players. The Musical Times wrote \"There is nothing quite like these concerts in London; the concert givers get to grips with the real thing in a most delightful, unconventional way, and after an evening spent with them, one feels music is gloriously alive.\" The concert series took place in the Ballet Club Theatre (later known as the Mercury Theatre). When the series ran into financial trouble, Hubert Foss introduced Lemare to Robert Mayer and his wife, Dora Moulton, who supported three seasons of the Macnaghten-Lemare Concerts, although the last two seasons were known only as the Lemare Concerts after Macnaghten dropped out. In 1937, the concerts came to an end."]}, {"page": "Bernard Shore", "response": ["As a soloist, Shore made his debut as a soloist in a recital with Angus Morrison in 1925. The following year came his first appearance at the BBC Proms, giving the first London performance of Gordon Jacob's Viola Concerto No 1.BBC Proms performance archive, 23 September, 1926 He gave the second performance of William Walton's Viola Concerto in 1930 (following its premiere the previous year with Hindemith as soloist, in which Shore had played principal viola).BBC Proms performance archive, 21 August, 1930 On 27 August 1931 he played Flos Campi by Vaughan Williams at a Prom.Radio Times Issue 412, 23 August 1931, p 42 Shore commissioned Christian Darnton's Viola Concerto, and gave its first performance on 15 April 1936.Radio Times Issue 654, 12 April 1936, p 42 Other premieres of British music included Philip Sainton's Serenade Fantastique in 1936, Elizabeth Maconchy's Viola Concerto in 1937 and (with Albert Sammons) Stanley Wilson's Concerto for Violin and Viola, also in 1937.  With Eda Kersey he premiered Arthur Benjamin's Romantic Fantasy for violin, viola and orchestra on 24 March 1938 at a Royal Philharmonic Society concert, with Benjamin conducting.David C F Wright, Eda Kersey"]}]}}