{"wiki_id": "http://www.wikidata.org/entity/Q1076623", "itemLabel": "Richie Faulkner", "itemDescription": "British guitarist", "wikipedia_url": "https://en.wikipedia.org/wiki/Richie_Faulkner", "wikipedia_page": {"main": "Richard Ian Faulkner (born 1 January 1980) is an English musician best known as one of the lead guitarists for the heavy metal band Judas Priest since 2011, replacing original member K. K. Downing. Faulkner has also performed with Lauren Harris, Christopher Lee, Voodoo Six, Dirty Deeds, and Ace Mafia.", "link_mentions": [{"page": "Jimi Hendrix", "response": ["Uli Jon Roth, pop singer Halsey, Kiss's Ace Frehley, Metallica Kirk Hammett, Aerosmith's Brad Whitford, Judas Priest's Richie Faulkner, instrumental rock guitarist Joe Satriani, King's X singer/bassist Doug Pinnick, Frank Zappa/David Bowie/Talking Heads/King Crimson/Nine Inch Nails hired gun Adrian Belew, and heavy metal virtuoso Yngwie Malmsteen, who said: \"[Hendrix] created modern electric playing, without question ... He was the first. He started it all. The rest is history.\": Hendrix influenced Yngwie Malmsteen and Joe Satriani, \"[Hendrix] created modern electric playing\"; : Hendrix influenced Kirk Hammett; : Hendrix influenced Stevie Ray Vaughan. \"For many\", Hendrix was \"the preeminent black rocker\", according to Jon Caramanica. Members of the Soulquarians, an experimental black music collective active during the late 1990s and early 2000s, were influenced by the creative freedom in Hendrix's music and extensively used Electric Lady Studios to work on their own music."]}, {"page": "1980", "response": ["* January 1 – Richie Faulkner, British rock guitarist "]}, {"page": "Judas Priest", "response": ["The band's membership has seen much turnover, including a revolving cast of drummers in the 1970s and the departure of singer Rob Halford in 1992. Tim \"Ripper\" Owens, formerly of Winter's Bane, replaced Halford in 1996 and recorded two albums with Judas Priest, before Halford returned to the band in 2003. The current line-up consists of Halford, guitarists Glenn Tipton and Richie Faulkner, bassist Ian Hill and drummer Scott Travis. The band's best-selling album is 1982's Screaming for Vengeance, with their most commercially successful line-up featuring Hill, Halford, Tipton, guitarist K. K. Downing, and drummer Dave Holland. Tipton and Hill are the only two members of the band to appear on every album.", "On 20 April 2011, it was announced that K. K. Downing had retired from the band and would not complete the Epitaph World Tour. Downing cited differences with the band and the management, and a breakdown in their relationship. Richie Faulkner, guitarist for Lauren Harris' band, was announced as his replacement for the Epitaph World Tour. Downing's retirement left bassist Ian Hill as the only remaining founder member of the band.", "In a November 2015 interview with Reverb.com, Richie Faulkner said that the band would start work on their eighteenth studio album in 2016. In April 2016, Loudwire posted a photo showing Rob Halford, Glenn Tipton and Faulkner himself in the studio beginning the process of the album, with Halford confirming in a radio interview that it would be ready by early 2017. During an interview at the 2016 edition of the Rock 'n' Roll Fantasy Camp, Halford expressed dissatisfaction on making an album similar to Redeemer of Souls. Faulkner then stated that the band would begin recording in January 2017 and also said that they would not go on tour until 2018.", "On 12 February 2018, Glenn Tipton revealed that he had Parkinson's disease and would step down from touring. According to the band, the disease's progression left him unable to play the more challenging material. Tipton stated that he was still a member of the band despite his diagnosis and did not rule out future on-stage appearances. Andy Sneap was then announced as his replacement for the tour. Richie Faulkner later assured fans that Tipton would perform with the band \"at some point in the tour.\" At the 20 March 2018 show in Newark, New Jersey, Tipton joined the band on stage to perform \"Metal Gods\", \"Breaking the Law\" and \"Living After Midnight\", then \"Victim of Changes\" and \"No Surrender\" on later dates. He continued to appear for encores throughout the remainder of the Firepower World Tour.", "File:Judas Priest With Full Force 2018 03.jpg|Richie Faulkner", "* Richie Faulkner – guitars, backing vocals (2011–present)", "| Richie Faulkner || Guitarist of the Year || "]}, {"page": "K. K. Downing", "response": ["Downing officially left Judas Priest on 20 April 2011, citing \"an on-going breakdown in working relationships between myself, elements of the band and management for some time.\" He stated that there were at least \"21 reasons\" why he left, but refused to go into specific detail; however, he did express disappointment in the band's live performance and thought it could've been better. Judas Priest had since continued with Richie Faulkner as his replacement.", "After not performing on stage since Judas Priest's 30th-anniversary celebration of the 1980 album British Steel in 2009, Downing made his live return at the 2019 edition of the Bloodstock Open Air festival where he performed with former Manowar guitarist Ross the Boss as they played the songs \"The Green Manalishi (With the Two Prong Crown)\", \"Heading Out to the Highway\", \"Breaking the Law\" and \"Running Wild\". He cited it being \"a bit of a whirlwind\" and the perfect way to get reintroduced to the stage. He also said that there was very little time for him to rehearse as some of the band members arrived the same day of their scheduled rehearsal, \"But we did manage to squeeze an hour or so in the following day.\" He described the performance as being \"a jam, really… And there was quite a bit of improvisation in there. And that's where it is.\" In a Twitter response from a fan, Richie Faulkner praised Downing's performance upon viewing video footage of him, saying that he \"looked and sounded great. Good to see the man up on stage where he belongs again.\""]}, {"page": "Glenn Tipton", "response": ["Rob Halford left Judas Priest in 1992 and the band then separated. During their split, Tipton wrote material for a solo project he formed in the mid-1990s. His first solo effort was the album Baptizm of Fire, which was released in 1997, followed by Edge of the World in 2006. In 1996, Judas Priest reformed with new vocalist Tim \"Ripper\" Owens. This new version of the band recorded the albums Jugulator in 1997 and Demolition in 2001. Both of these albums experimented with new sounds that distinguished them from the records with Halford. In 2003, Judas Priest reunited with Rob Halford and toured in celebration of his return in 2004. The band released Angel of Retribution in 2005 and Nostradamus in 2008. In 2010, Judas Priest announced their Epitaph World Tour, which was to be the last major world tour, which was also their first tour without original guitarist K. K. Downing, and the first to feature his replacement, Richie Faulkner. The band later retracted this announcement, and released their seventeenth album Redeemer of Souls in July 2014, as well as supporting the album with a world tour.", "Tipton's daughter, Karina Greenin, took part in an annual marathon in Barcelona to help raise funds for her father's foundation, which exceeded her £3,500 goal. Richie Faulkner recalled that Tipton was diagnosed during the Redeemer of Souls Tour, \"maybe, actually, a bit before. So, after the 'Epitaph' tour, but before the 'Redeemer Of Souls' tour he got diagnosed, and they told him that he had it for quite a few years before that, but he didn't know. He kept it quiet, which is his business… He chose to go and check it out and they told him that it was the onset Parkinson's, and he told us. But he was able to do the 'Redeemer Of Souls' tour.\" He then said that the set had to be slightly changed in order to accommodate him. The band did not perform a few songs on the first part of the tour, but upon their appearance in Australia, they began to perform them due to Tipton's resurgence in his health and managed to successfully perform the entire tour, but stepped down during rehearsals for the Firepower World Tour due to the disease's progression which caused emotional heartbreak for the band. Tipton expressed his heartfelt gratitude to the fans for their support for him, \"particularly over the past year which has been a tough one for me.....thank you all so much! No surrender!!\""]}, {"page": "Demon Hunter", "response": ["On December 15, 2021, it was announced that Richie Faulkner of Judas Priest recorded a guitar solo for the next album, Exile, slated for release in 2022."]}, {"page": "Lauren Harris", "response": ["*Richie Faulkner – guitars, backing vocals (2005–2010)"]}, {"page": "Faulkner (surname)", "response": ["* Richie Faulkner (born 1980), English guitarist"]}, {"page": "Gibson Flying V", "response": ["File:Judas Priest With Full Force 2018 03.jpg|Judas Priest guitarist Richie Faulkner has his own line of custom Flying Vs manufactured by Gibson subsidiary Epiphone."]}, {"page": "Demolition (Judas Priest album)", "response": ["Guitarist Richie Faulkner cites \"Hell Is Home\" as his favourite song, \"It's really heavy and the vocal melody is really great. I think Ripper sings it really well. It's probably one of my favorite Priest songs of the Ripper era. 'Hell Is Home' — I really like that.\""]}, {"page": "January 1980", "response": ["**Richie Faulkner, English heavy metal guitarist for the band Judas Priest since 2011 (replacing K. K. Downing, who had founded the band in 1969); in London"]}, {"page": "Judas Priest discography", "response": ["English heavy metal band Judas Priest have released 18 studio albums, six live albums, seven compilation albums, 29 singles, 10 video albums, and 21 music videos. The band currently consists of bassist Ian Hill, drummer Scott Travis, singer Rob Halford, and guitarists Glenn Tipton and Richie Faulkner. After guitarist K. K. Downing's retirement from the band in 2011, bassist Ian Hill is the only remaining founding member. Judas Priest have sold over 50 million albums worldwide, with 12 million copies in the United States."]}, {"page": "List of Gibson players", "response": ["*Richie Faulkner (Judas Priest) frequently plays Gibson Custom Shop Flying V and Gibson Les Paul Custom models."]}, {"page": "List of heavy metal guitarists", "response": ["*Richie Faulkner (Judas Priest)"]}]}}