{"wiki_id": "http://www.wikidata.org/entity/Q1077393", "itemLabel": "Chris Kamara", "itemDescription": "English association football player and manager (born 1957)", "wikipedia_url": "https://en.wikipedia.org/wiki/Chris_Kamara", "wikipedia_page": {"main": "Christopher \"Kammy\" Kamara (born 25 December 1957) is an English former professional football player and manager who works as a presenter and football analyst at Sky Sports.\nAs a player, he was known as a tough-tackling midfielder. He joined the Royal Navy at the age of 16, before being signed up to Portsmouth in November 1974. He spent three years at the club before being sold on to Swindon Town for £14,000. He returned to Portsmouth in 1981 for a £50,000 fee, but was traded to Brentford in October 1981. He spent four years with the \"Bees\" before leaving the club after picking up a runners-up medal in the Football League Trophy in 1985.\nHe re-signed with Swindon Town in August 1985 and helped the club to two successive promotions into the Second Division. He moved on to Stoke City in 1988, and a successful spell with the club won him a move to Leeds United in 1990. He helped the club to the Second Division title in 1989–90, but was out injured for 8 months before being sold to Luton Town for £150,000 in 1991. He had loan spells with Premier League clubs Sheffield United and Middlesbrough, before joining Sheffield United on a permanent basis in 1993. The following year he joined Bradford City as a player-coach.\nHe was appointed Bradford City manager in November 1995 and took the club from a relegation scrap to promotion out of the Second Division via the play-offs in 1996. He left the club in January 1998 and quickly took the reins at Stoke City, before he left the \"Potters\" in April 1998. From there he became a broadcaster with Sky Sports and has since appeared as a presenter on numerous other television programmes.", "link_mentions": [{"page": "December 25", "response": ["*  1957   – Chris Kamara, English footballer and sportscaster"]}, {"page": "Stoke City F.C.", "response": ["1997–98 saw Stoke move to its new ground, the Britannia Stadium, after 119 years at the Victoria Ground. Chic Bates, Macari's assistant, was appointed manager for the club's first season in the new ground. He did not last long though, and was replaced by Chris Kamara in January 1998. Kamara could not improve the club's fortunes either, and he too left in April. Alan Durban, previously Stoke's manager two decades earlier, took charge for the remainder of season. Despite his best efforts, Durban was unable to keep the club up, as defeat against Manchester City on the final day of the season consigned Stoke to relegation to the third tier.", "|  Chris Kamara"]}, {"page": "Ian Wright", "response": ["Wright has appeared in television commercials for the chicken sauce, Chicken Tonight, Nescafé and Ladbrokes along with Chris Kamara, Ally McCoist and former Arsenal teammate Lee Dixon. Wright appeared in an advertisement for the Wii console where he was seen playing Mario Strikers Charged and Wii Sports with his son Shaun. In his playing career, Wright was sponsored by the sportswear company Nike, and appeared in Nike commercials. In October 1992, Ian Wright featured on the first TV commercial for Nike in the UK, Nike \"Kick it\" was Nike first TV commercial for Football. In 1996, he starred in a Nike commercial titled \"Good vs Evil\" in a gladiatorial game set in a Roman amphitheatre. Appearing alongside football players from around the world, including Ronaldo, Eric Cantona, Luís Figo, Patrick Kluivert, Paolo Maldini and Jorge Campos, they defend \"the beautiful game\" against a team of demonic warriors, which culminates with Cantona striking the ball and destroying evil. In 1997 he starred in Nike's \"Park Life\" commercial (set to the tune \"Parklife\" by Blur) where a group of pub league players playing amateur football at Hackney Marshes in east London are suddenly joined by top Premier League footballers, including Wright, Cantona, David Seaman and Robbie Fowler. In 2000, \"Park Life\" was ranked number 15 in Channel 4's poll of the 100 Greatest TV Ads."]}, {"page": "List of sports announcers", "response": ["* Chris Kamara – Sky Sports 1996–present"]}, {"page": "Welshpool Town F.C.", "response": ["Following Welshpool's 10–1 defeat to local rivals Waterloo Rovers on Boxing Day 2011, Sky Sports presenter Jeff Stelling made a joke at the club's expense on Soccer Saturday.  Manager David Jones then wrote to the programme explaining the club's plight and that the heavy scoreline was largely the result of him having to spend the second half as a stand-in goalkeeper.  The letter was read live on air by Stelling, and Soccer Saturday reporter and ex-professional player Chris Kamara then offered to turn out for the club to aid their fight against relegation.", "Kamara made his debut on 28 January 2012, but could not prevent a 6–1 home defeat to Rhayader Town, though he did provide the corner that led to Welshpool's goal early in the second half with the score at 2–0.Shropshire Star Sky’s Chris Kamara in unbelievable return with Welshpool Town (30 January 2012)", "Because of transfer rules, Kamara was signed to the club until the end of the 2011–12 season, and played for the team again when they hosted Newbridge-on-Wye on 28 March 2012.Shropshire Star Unbelievable! Chris Kamara back on the ball for Welshpool (20 March 2012) He was joined in that match by another former professional player and Soccer Saturday regular, Paul Merson, who also signed up to Welshpool.Shropshire Star (28 March 2012) Merson scored in the match, but Welshpool still lost 4–1.Shropshire Star (29 March 2012)"]}, {"page": "Hartlepool", "response": ["Supporters of the club bear the nickname of Monkey Hangers. This is based upon a legend that during the Napoleonic wars a monkey, which had been a ship's mascot, was taken for a French spy and hanged. Hartlepool has also produced football presenter Jeff Stelling, who has a renowned partnership with Chris Kamara who was born in nearby Middlesbrough. Jeff Stelling is a keen supporter of Hartlepool United Football Club and often refers to them when presenting Sky Sports News. It is also the birthplace and childhood home of Pete Donaldson, one of the co-hosts of the Football Ramble podcast as well as co-host of the Abroad in Japan podcast, and a prominent radio DJ."]}, {"page": "Through the Keyhole", "response": ["| 7 || Paddy McGuinnessCatherine TyldesleyChris Kamara || Ricki LakeJamie TheakstonDanielle Armstrong", "| 2 || Danny DyerSally PhillipsChris Kamara || Michael OwenLesley GarrettEmily Atack || 12 January 2019 ||"]}, {"page": "List of game show hosts", "response": ["| Chris Kamara || United Kingdom || Ninja Warrior UK (2014–present)"]}, {"page": "Bradford City A.F.C.", "response": ["In January 1994, Geoffrey Richmond came from Scarborough to take over as chairman, and promised to guide City to the Premier League within five years. He cleared the debts and after four months sacked manager Frank Stapleton to appoint his own manager, Lennie Lawrence. Lawrence left after little more than a year to join Luton Town but his successor, Chris Kamara took City to the play-offs and their first game at Wembley Stadium. They defeated Notts County 2–0 in the final to earn promotion to Division One. City avoided relegation the following season by winning their last two league games 1–0 against Charlton and then beating Queens Park Rangers 3–0 on the final day of the season, but Kamara was sacked in January 1998. Paul Jewell took over, initially on a temporary basis, before he was given a permanent contract. He bought the club's first £1 million signings and guided the club to the Premier League—the first time they had been in the top flight for 77 years—with a second-place finish. The following season, Jewell continued to defy the critics, who labelled his team Dad's Army, by avoiding relegation again on the last day with a 1–0 victory over Liverpool, with a goal from David Wetherall.", "*  Chris Kamara", "*  Chris Kamara (1995–1998)"]}, {"page": "List of Have I Got News for You episodes", "response": ["|Chris Kamara"]}, {"page": "Neville Southall", "response": ["In December 1997, Southall went to Alvin Martin's Southend United of the Second Division on loan. He made 9 appearances in a brief stay at Roots Hall. He joined Chris Kamara's First Division Stoke City in February 1998. Kamara resigned two months later, and caretaker-manager Alan Durban pulled Southall aside on his first day in charge to say \"I'll let you manage the reserves, so long as you keep your head down, do whatever I tell you, and I won't tell everybody you're a bad influence\". Southall was shocked by Durban's words and could not explain his attitude. Both Southend and Stoke would end the season bottom of their respective divisions and Everton only avoided relegation on the last day of the season. He left the Britannia Stadium in the summer, and later said \"one of the worst episodes of my life had drawn to a close\"."]}, {"page": "Alan Ball Jr.", "response": ["The following month he joined Colchester United as assistant to Jock Wallace and in October 1989 took up a similar post under Mick Mills at Stoke City. However, Mills was sacked two weeks later and Ball was promoted to the manager's seat. He came to the conclusion that the squad he had inherited was simply not good enough and out went Chris Kamara, Dave Bamber, Leigh Palin, Carl Saunders, Gary Hackett and Nicky Morgan. Into the side came Tony Ellis, Lee Sandford, Tony Kelly, Dave Kevan, Paul Barnes and Noel Blake. It was a big gamble by Ball to change so much of the squad so quickly, and it did not pay off. Stoke stayed rooted to the bottom of the table and was relegated to the Third Division for the first time in 63 years."]}, {"page": "Romford Market", "response": ["The market originated as a sheep market in 1247.English History Online – Romford Economic History Under the Royal Charter of the Liberty of Havering, granted by King Henry III no other market is permitted to set up within a day's sheep drive (six and two-thirds miles) of Romford. The market is the subject of a 1726 legal case called Keech v. Sandford.Keech v. Sandford (1726) Sel Cas. Ch.61 This is one of the foundational cases of English trust law, on the fiduciary duty of loyalty. The market was also used to film parts of The Prodigy's music video for the track \"Voodoo People\" remixed by Pendulum, and also a film starring Chris Kamara."]}, {"page": "Paul Merson", "response": ["On 28 March 2012, he made a one-off appearance for Mid Wales Football League side Welshpool Town, playing alongside fellow Sky Sports pundit Chris Kamara against Newbridge-on-Wye. Merson scored the opening goal in the 4–1 defeat at the Maes y Dre Recreation Ground. On 11 October 2017, Merson signed for Welsh Football League Division Three team Caerau. Following international clearance, he made his debut on 18 October against Pontyclun. In December 2019, Merson joined Hanworth Villa in the Combined Counties League Premier Division, making two appearances for the Villains in total."]}, {"page": "Gary Megson", "response": ["While still playing at Norwich City, Megson became assistant to manager John Deehan. When Deehan resigned as manager of Norwich on 9 April 1995, with Norwich heading for relegation after a terrible loss of form since Christmas, Megson stepped up to the manager's seat for the remainder of the season, and had five games remaining to secure survival. However, Norwich collected just one point from their remaining games and were relegated. Martin O'Neill was appointed manager that summer, with Megson leaving the club to play for Lincoln City and then Shrewsbury, before joining Bradford City late in 1995 as assistant manager to Chris Kamara. However, by Christmas that year, he was back at Norwich as manager following the departure of Martin O'Neill to Leicester City. Norwich finished 15th in Division One that season and Megson then left the club as Mike Walker returned as manager."]}, {"page": "Craig Revel Horwood", "response": ["Horwood lent his vocals to a single released by other celebrities under tutorage of choirmaster Gareth Malone for the Children in Need charity single of 2014; the choir performed a version of Avicii's \"Wake Me Up\". On 15 January 2016, he appeared as a panellist on a special edition of ITV's Loose Women (titled \"Loose Women and Men\") alongside series regulars Andrea McLean and Nadia Sawalha and fellow special hosts Peter Andre and Chris Kamara. He also starred in an edition of Who Do You Think You Are?, broadcast on 13 July 2017, in which he learned about his ancestry and family history."]}, {"page": "The Big Fat Quiz of the Year", "response": ["No celebrity guests appeared in studio to ask questions due to the ongoing COVID-19 pandemic. Pre-recorded questions came from Joe Wicks, Bob Odenkirk, Carole Baskin, Laura Whitmore, Craig David, Keith Lemon, KSI, Chris Kamara, Nicola Coughlan, and LadBaby. The children of Mitchell Brook Primary School acted out the Dominic Cummings scandal for a related question. Jon Snow reported on Jawsh 685 and Jason Derulo's \"Savage Love (Laxed – Siren Beat)\". Charles Dance read from The Meaning of Mariah Carey. The mystery guest was Billy McLean, whose joke WhatsApp voice memo started a false rumour that the British government was planning to combat hunger during lockdown by making a lasagne the size of Wembley Stadium.", "Pre-recorded guest questions came from Little Mix, Gareth Malone, Paul Whitehouse, Joey Essex, Jessica Ennis-Hill, Dom and Steph Parker from Gogglebox, Kevin McCloud, Darcey Bussell and Alesha Dixon. Chris Kamara provided the in-studio guest question. The children of Mitchell Brook Primary School acted out The Great Fire of London. Jon Snow reported on Queen's \"Bohemian Rhapsody\"."]}, {"page": "Paul Jewell", "response": ["Jewell had a brief loan spell at Grimsby Town before returning to Bradford. He retired as a player in 1997–98 when Bradford won promotion from Division Two in 1995–96 under manager Chris Kamara."]}, {"page": "Kammy", "response": ["* nickname of Chris Kamara (born 1957), English former footballer and manager"]}, {"page": "Martin Offiah", "response": ["In 2006 he appeared on a Reality TV special of The Weakest Link, winning £10,050 and splitting the winnings with Danniella Westbrook. Offiah won Celebrity come Dine With Me in 2011 which was a Rugby World Cup special. Offiah beat Victor Ubogo, Kieran Bracken and Gareth Chilcott. Offiah has also appeared on BBC quiz show Pointless, firstly with Chris Kamara in 2012, where they were eliminated in the first round, the second time in 2013 with cricketer Philip Tufnell where they won the cash prize by getting a Pointless answer in the final round. Offiah donated his £1,250 prize to the Joining Jack Charity. In 2014, he was a contestant on Splash!, and was the fourth to be eliminated from the competition. In 2015, he appeared with his son Tyler on Big Star's Little Star where they won £11,000 for charity. In 2015, Offiah took part on All Star Mr & Mrs with his partner Virginia."]}]}}