{"wiki_id": "http://www.wikidata.org/entity/Q107125229", "itemLabel": "Edward Hawtrey", "itemDescription": "English first-class cricketer and educator (1847-1916)", "wikipedia_url": "https://en.wikipedia.org/wiki/Edward_Hawtrey_(cricketer)", "wikipedia_page": {"main": "Edward Montague Hawtrey (10 October 1847 – 14 August 1916) was an English first-class cricketer and schoolmaster.\nThe son of The Reverend John Hawtrey, he was born at Windsor in October 1847. He was educated at Eton College, before going up to St John's College, Cambridge. He was active in athletics while at Cambridge and was a member of the  Cambridge University Athletics Club, for which he served a president in 1872. Hawtrey competed in the 3 mile race university race in 1872, in which he finished in a dead heat in 15 minutes 44 seconds with Oxford's Robin Benson. He gained athletics blues in 1870, 1871 and 1872. After graduating from Cambridge he became the headmaster of Hawtreys in 1873 (which had been founded by his father in 1869), overseeing the schools move to Westgate-on-Sea in 1883. He later played first-class cricket for the Marylebone Cricket Club, making two appearances against Hampshire in 1880 and Somerset in 1882. He struggled as a batsman, scoring just one run across four innings', while as a bowler he took 2 wickets. Hawtrey was headmaster at Hawtreys until his death at Westgate in August 1916. His brother was the footballer and FA Cup winner John Hawtrey, while his youngest brother was the actor Charles Hawtrey.", "link_mentions": [{"page": "Hawtreys", "response": ["John Hawtrey's son, Edward, removed the school to Westgate-on-Sea early in 1883.p 94, The History of Slough, Maxwell Fraser, Slough Corporation, 1973 When Edward Hawtrey died, the name of the school was changed to Hawtreys."]}, {"page": "Edward Hawtrey", "response": ["Edward Hawtrey may refer to:", "* Edward Hawtrey (cricketer), English cricketer and schoolmaster"]}, {"page": "Somerset County Cricket Club in 1882", "response": ["The Somerset team travelled to Lord's in London in early August to face the Marylebone Cricket Club (MCC). Somerset batted first after winning the toss, but lost three batsmen for ducks early in the innings. Somerset's captain, Newton – playing his first match of the season for the county, batted for the rest of the innings to score 57 runs, and shared a large partnership with Francis Reed. The MCC started well in their innings, but the introduction of Fowler into the bowling attack brought their batting to a quick conclusion; Fowler took four wickets while only conceding eight runs, and claimed a hat-trick by bowling Edward Hawtrey, Charles Burke and Thomas Mycroft in successive deliveries. Somerset had a 25-run lead going into the second innings, in which Newton once again top-scored. In addition to his total of 67, Lyonel Hildyard made an unbeaten 59, and Fowler scored 23 runs from just six scoring shots, including a six which went out of the ground. The Western Daily Press described Fowler as \"possibly the hardest hitter amongst English cricketers\", while his history of the county, David Foot suggests that Fowler was \"perhaps the earliest Somerset batsman to parade the fundamental skills of slogging.\" Somerset totalled 219, to leave the MCC needing to score 245 runs to win. Principally due to the batting of John Russel, the MCC reached the target, but only had one wicket remaining; Fothergill having taken five wickets and Charles Winter four."]}, {"page": "List of Marylebone Cricket Club players (1864–1894)", "response": ["* Edward Hawtrey (1880–1882) : E. M. Hawtrey"]}]}}