{"wiki_id": "http://www.wikidata.org/entity/Q10860", "itemLabel": "Siobhan Chamberlain", "itemDescription": "English association football goalkeeper (born 1983)", "wikipedia_url": "https://en.wikipedia.org/wiki/Siobhan_Chamberlain", "wikipedia_page": {"main": "Siobhan Rebecca Chamberlain (born 15 August 1983) is a retired English professional footballer who last played as a goalkeeper for FA WSL club Manchester United and the England national team. She is also a sports pundit and commentator.\nShe joined Manchester United in 2018 after playing for Liverpool. Before joining Liverpool in December 2015, she had been at Notts County on loan from Arsenal. Chamberlain previously played at the top club level for Chelsea, Fulham, Birmingham City and Bristol Academy, as well as for North American W-League club Vancouver Whitecaps. She has represented the England women's national football team on 50 occasions since her debut in 2004. This included being part of the squad at three FIFA Women's World Cups and three UEFA Women's Championships.", "link_mentions": [{"page": "August 15", "response": ["*1983 – Siobhan Chamberlain, English association football goalkeeper"]}, {"page": "Wigan Warriors", "response": ["*Siobhan Chamberlain, former Manchester United, and England Goalkeeper"]}, {"page": "MUTV (Manchester United F.C.)", "response": ["*Siobhan Chamberlain"]}, {"page": "Chelsea F.C. Women", "response": ["After an eighth-placed finish in 2006–07, Gore drafted in England players Siobhan Chamberlain, Casey Stoney and Eniola Aluko that summer. American World Cup winner Lorrie Fair, regarded as one of the best midfielders in the women's game, joined in January as Chelsea finished 2007–08 in fifth position."]}, {"page": "UEFA Women's Euro 2009", "response": ["|GK ||13|| Siobhan Chamberlain || ||"]}, {"page": "Siobhan", "response": ["*Siobhan Chamberlain (born 1983), British footballer"]}, {"page": "Chamberlain (surname)", "response": ["*Siobhan Chamberlain (born 1983), English football goalkeeper"]}, {"page": "Kay Hawke", "response": ["Hawke's international debut was against Sweden at U21 level on 1 October 2004.  The match took place at Örjans Vall, home ground of Swedish side Halmstads BK, and ended 1–0 to England, giving Hawke an international debut clean sheet. Having played football for England at U21 and U23 level Hawke finally made her full debut for England on 14 February 2008 against Norway in Cyprus. She replaced Siobhan Chamberlain after 73 minutes of the 2–1 win."]}, {"page": "Karen Bardsley", "response": ["Bardsley had previously played as goalkeeper in all five games and was part of the history-making team which beat Norway in the round of 16 to become the first senior England women's team to win a world cup knockout match. She was substituted in the 51st minute of the quarter-final match against Canada, after suffering an inflammation of her right eye; she was immediately taken off pitch with her eye visibly swollen and was substituted with Siobhan Chamberlain. The reasoning for the swelling was unknown, but parts of the artificial turf were suspected."]}]}}