{"wiki_id": "http://www.wikidata.org/entity/Q10858359", "itemLabel": "Stuart Clark", "itemDescription": "British writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Stuart_Clark_(author)", "wikipedia_page": {"main": "Stuart Clark is a contemporary English writer and widely read astronomy journalist. His career is devoted to presenting the dynamic and complex world of astronomy to the general public, both as semi-fictional novels of past scientists and as popularised astronomy articles.", "link_mentions": [{"page": "Royal Society Prizes for Science Books", "response": ["*The Sun Kings - The Unexpected Tragedy of Richard Carrington and the Tale of How Modern Astronomy Began  by Stuart Clark"]}, {"page": "Stuart Clark", "response": ["Clark started out playing first-grade cricket for Sutherland District Cricket Club, opening the bowling with Glenn McGrath in that club's Sydney Grade Cricket grand final win in the 1995-96 season. Clark made his first-class debut with the New South Wales Blues on 4 February 1998 against Tasmania at the Sydney Cricket Ground.New South Wales v Tasmania Sheffield Shield 1997/98  Cricket Archive. Retrieved 31 December 2007 He had a poor debut season, taking only 4 wickets at an average of 76.75. First-class Bowling in Each Season by Stuart Clark  Cricket Archive. Retrieved 31 December 2007 The 1998–99 season also saw Clark struggle as he took only 2 wickets at an average of 220.50. After his first 7 first-class matches, Clark averaged 124.66 with the ball. His poor performances led to him being dropped during the 1998–99 season and he did not play a first-class match for over 2 years.First-Class Matches played by Stuart Clark (85)  Cricket Archive. Retrieved 31 December 2007"]}, {"page": "The Museum of Curiosity", "response": ["*Stuart Clark"]}, {"page": "Ethan Siegel", "response": ["Described as \"beautifully illustrated and full of humour\", his blog won the 2010 Physics.org award for best blog, judged by Adam Rutherford, Alom Shaha, Gia Milinovich, Hayley Birch, Lata Sahonta, and Stuart Clark and the people's choice award, and his post \"Where Is Everybody?\" came third in the 2011 3 Quarks Daily science writing awards, judged by Lisa Randall, winning a \"Charm Quark\" for \"[taking] on the challenge of simplifying probability estimates without sacrificing the nature of the enterprise or suppressing the uncertainties involved\"."]}]}}