{"wiki_id": "http://www.wikidata.org/entity/Q1086512", "itemLabel": "Christopher Bailey", "itemDescription": "British fashion designer", "wikipedia_url": "https://en.wikipedia.org/wiki/Christopher_Bailey_(fashion_designer)", "wikipedia_page": {"main": "Christopher Paul Bailey CBE (born 11 May 1971) is a British fashion designer who was president and chief creative officer of Burberry. In May 2014, he took up the role of chief creative officer and president, following the departure of former CEO Angela Ahrendts. In February 2018, he was succeeded as chief creative officer by Riccardo Tisci.", "link_mentions": [{"page": "Paul Reubens", "response": ["Pee-wee's small glen plaid suits seemed ridiculous during the 1980s, but since the late 1990s have made him a \"style icon\", with fashion houses and designers like Christopher Bailey, Ennio Capasa, Miuccia Prada, Viktor & Rolf, and Thom Browne creating tightly cut suits with high armholes and short trousers that have been compared to Pee-wee's. In early 2007 Nike released a collection of Nike SB sneakers called \"Fallen Heroes\". The collection was loosely inspired by Milli Vanilli, MC Hammer, Vanilla Ice, and Pee-wee Herman. Pee-wee's sneakers use a gray and white color scheme with red detail, with an illustration on the insole of a man in a suit sitting alone in a theatre with his hand on his lap suggesting Reubens's 1991 theatre arrest."]}, {"page": "Princess Margaret, Countess of Snowdon", "response": ["In April 2007, an exhibition titled Princess Line – The Fashion Legacy of Princess Margaret opened at Kensington Palace, showcasing contemporary fashion from British designers such as Vivienne Westwood inspired by Princess Margaret's legacy of style. Christopher Bailey's Spring 2006 collection for Burberry was inspired by Margaret's look from the 1960s.Heald, pp. 296–297"]}, {"page": "David Hockney", "response": ["Hockney was inducted into Vanity Fairs International Best-Dressed Hall of Fame in 1986. In 2005 Burberry creative director Christopher Bailey centred his entire spring/summer menswear collection around the artist and in 2012 fashion designer Vivienne Westwood, a close friend, named a checked jacket after Hockney.Ellie Pithers (25 January 2012), David Hockney: back on the fashion map The Daily Telegraph In 2011 British GQ named him one of the 50 Most Stylish Men in Britain and in March 2013 he was listed as one of the Fifty Best-dressed Over-50s by The Guardian."]}, {"page": "Burberry", "response": ["In May 2001, Christopher Bailey joined Burberry as creative director. Christopher Bailey has been the chief creative officer since 2014, as well as CEO from 2014 – November 2017. Bailey stepped down as chief creative officer in March 2018 and departed the brand completely by the end of 2018.", "In October 2013, it was announced that Ahrendts would take up the position of Senior Vice President of retail and online at Apple, Inc. from April 2014, and be replaced as CEO by Bailey. During her tenure, sales increased to over £2 billion, and shares gained more than threefold to £7 billion. Burberry promotes its British connection; according to The Guardian, a British national daily newspaper, as of July 2012, Burberry maintains two production facilities in Great Britain, one in Castleford producing raincoats, and one in Keighley. In spring 2014, fashion designer Christopher Bailey became CEO of Burberry and retained the role as chief creative officer. His basic salary was £1.1m, with total compensation of up to £10m a year depending on sales targets being met.", "In July 2016, it was announced that Celine boss Marco Gobbetti would become CEO of the FTSE 100 Company, while Christopher Bailey became the Creative Director and President. In 2016, the label launched its \"Mr Burberry\" fragrance. In 2016, Burberry had an increase in reported profits, with 77 per cent of sales coming from Burberry's stores. The increase was in part attributed to strong sales in Asia. In early May 2017, the store announced it was moving 300 employees from London to Leeds. In July 2017, Gobbetti replaced Bailey as CEO. In March 2018, Burberry named Riccardo Tisci as the brand's chief creative officer effective 12 March. A few months later, Tisci presented a new logo and monogram for the brand, designed by the English graphic designer Peter Saville."]}, {"page": "List of fashion designers", "response": ["* Christopher Bailey"]}, {"page": "Greatest Britons", "response": ["**Nominees: Christopher Bailey; Stella McCartney"]}, {"page": "Elle Style Awards", "response": ["* British Brand of the Year: Christopher Bailey, Burberry", "*Editor's Choice: Christopher Bailey"]}, {"page": "Cannes Lions International Festival of Creativity", "response": ["In the 1990s, the Festival also added a programme of learning in the form of seminars and workshops. Over the years, this side of the Festival has grown considerably, and in 2013 it featured around 130 sessions over 7 days.The Festival | Cannes Lions International Festival of Creativity  These included talks from Christopher Bailey, Jack Black, Jenson Button, Nick Cannon, Shepard Fairey, Arianna Huffington, David Karp, and Annie Leibovitz."]}, {"page": "Alex McDowell", "response": ["In October 2008, McDowell founded the World Building Institute. The preeminent knowledge space for designers and creators in cross-platform narrative media, the Institute provides opportunities for creative thinkers across multiple disciplines to explore how world building and narrative design can be applied in broad contexts. Current members include: Christopher Bailey, Wolfgang Bergmann, Jim Bissell, John Seely Brown, Rick Carter, Chris Defaria, Dr. Syliva Earle, Scott Fisher, Terry Jones, Ann Pendleton-Jullian, Yuval Sharon, among many others."]}, {"page": "The Fashion Awards", "response": ["    |Christopher Bailey MBE", "    Christopher Bailey For Burberry", "    Christopher Bailey", "    Christopher Bailey for Burberry", "    Christopher Bailey for Burberry", "    Christopher Bailey"]}, {"page": "Simon Woods", "response": ["Since 2009, Woods has been in a relationship with Christopher Bailey, the former chief executive of the British fashion house, Burberry.The Tatler List, Christopher Bailey. They married in 2012. They have two daughters, Iris and Nell."]}, {"page": "Bailey (surname)", "response": ["* Chris and Christopher Bailey (disambiguation), multiple people", "*** Christopher Bailey (fashion designer) (born 1971), English fashion executive", "*** Christopher Bailey (screenwriter) (born 19??), British lecturer and Doctor Who screenwriter"]}, {"page": "Sam Riley", "response": ["He featured in the autumn/winter 2008 publicity campaign for the British fashion house Burberry,  supervised by Christopher Bailey and shot by Mario Testino.Millar, Jamie; GQ; Sam Riley Exclusive!, February 2011. CQ.com ; retrieved 9 February 2011. He modelled the fall/winter 2014 Stefano Pilati-designed couture collection of Ermenegildo Zegna.Stefano Pilati concept zegna.com He was named one of GQs 50 best dressed British men in 2015."]}, {"page": "University of Westminster", "response": ["* Fashion designers including Christopher Bailey (Chief Executive and Chief Creative Officer at Burberry), Markus Lupfer, Carri Mundane (founder and creative designer at CassettePlaya, Stuart Vevers (executive creative director at Coach) and Vivienne Westwood."]}, {"page": "Andrew Groves", "response": ["Groves is Professor of Fashion Design at the University of Westminster and is the director of the Westminster Menswear Archive. He was the course director for the BA Fashion Design course between 2003 and 2019. Alumni of the course include Christopher Bailey, Stuart Vevers, Markus Lupfer, Liam Hodges, Ashley Williams, Claire Barrow, and Roberta Einer. He is the director of the Westminster Menswear Archive, which he launched in 2015. It holds over 2000 examples of British menswear including garments from Craig Green, Joe Casely-Hayford, Kim Jones, Aitor Throup, Vivienne Westwood, Nigel Cabourn, and Meadham Kirchhoff."]}, {"page": "Christopher Bailey (Fashion Designer)", "response": ["#REDIRECT Christopher Bailey (fashion designer) "]}, {"page": "Chris Liu", "response": ["In the early nineties Liu studied at Auckland University of Technology in New Zealand and worked as a designer with knitwear brand Sabatini for four years. In 2001 he moved to London for a placement at Burberry Prorsum followed by a design consultancy with Christopher Bailey."]}, {"page": "Ryan Seacrest", "response": ["Seacrest worked with Burberry's Christopher Bailey who designed Seacrest's suits for red carpet events as well as New Year's Eve since 2009 and American Idol starting in 2010. Seacrest wore close-fitting suits and decided to make something similar for a wider audience at an \"accessible\" price point."]}, {"page": "Riccardo Tisci", "response": ["Riccardo Tisci (; born 1974) is an Italian fashion designer. He studied in Italy at the Design Istituto d’Arte Applicata in Cantù until the age of 17, and then graduated from London's Central Saint Martins Academy in 1999. In 2005, Tisci was given the title of creative director for Givenchy Women's haute couture and ready-to-wear lines. In May 2008 he was additionally named as menswear and accessories designer of the Givenchy men's division. In March 2018, it was announced he had been appointed chief creative officer of Burberry, succeeding Christopher Bailey.", "In 2018, Tisci was named by Burberry to replace Christopher Bailey as the brand's chief creative officer.Samanta Conti (March 1, 2018), Burberry Taps Riccardo Tisci as Chief Creative Officer Women's Wear Daily."]}, {"page": "Council of Fashion Designers of America", "response": ["| style=\"text-align:center;\" |Christopher Bailey  () for Burberry"]}, {"page": "Rosie Huntington-Whiteley", "response": ["Huntington-Whiteley remained unknown outside the fashion industry until 2008, when she was cast by chief creative director Christopher Bailey, replacing Agyness Deyn for Burberry's autumn/winter campaign with actor Sam Riley. She got her first British Vogue cover on the November 2008 issue, alongside Eden Clark and Jourdan Dunn in a feature celebrating British models. The following year, she was featured as the face of Karen Millen's spring/summer 2009 advertising campaign. She starred in a short film for Agent Provocateur lingerie playing a woman whose boyfriend forgets Valentine's Day."]}, {"page": "Rose Marie Bravo", "response": ["In her new job she initiated a radical reform of the British classic brand and improvements of the company structure. Her strategy included signing top model Kate Moss and recruiting the young designer Christopher Bailey in 2001, who was working for Gucci at that time. The Burberry line of products was greatly increased and especially the newly added perfumes contributed to the company's raising profits."]}, {"page": "Alessandra Facchinetti", "response": ["Facchinetti later replaced Christopher Bailey at Gucci and became one of the key members of the brand's design team under Tom Ford in 2001One Turns Into Four: PPR Expected to Tap Gucci Designers Today Women's Wear Daily, March 11, 2004. and, following Ford's resignation, was appointed designer of its women's apparel in 2004.Alessandra Galloni (March 4, 2004), Gucci Taps 2 Insiders To Succeed Tom Ford Wall Street Journal. After only her second collection, she was replaced by Frida Giannini.Eric Wilson (March 9, 2005), Gucci Replaces Its Designer for Women's Wear New York Times. From 2006 to 2007, she subsequently worked as designer for Moncler, where she oversaw the brand's Gamme Rouge collection of outerwear;Alessandra Facchinetti's fairy tale at Moncler International Herald Tribune, September 26, 2007. her last effort for Moncler was the spring 2008 collection.Alessandra Ilari (December 4, 2007), Facchinetti Ending Deal With Moncler Women's Wear Daily. "]}, {"page": "Samata (fashion entrepreneur)", "response": ["Samata was Fashion Editor of The Talent Magazine presented at the Channel 4 Magazine launch and styling actor Nicholas Holt for the first cover issue. Samata's journalism work notably covers the subject of sustainable fashion and fashion enterprise. Her London Fashion Week coverage for The Guardian coined the phrase 'Eco-Ghosting'. Samata's interviewees include Suzy Amis Cameron, Missi Pyle, Dame Vivienne Westwood and Christopher Bailey. In 2016 Samata narrated, co-directed and co-produced short documentary about sustainable fashion entitled Designing Change with Suzy Amis Cameron. She has appeared on ITV News At Ten, ITV News at Six, and others. She was asked by ITV News to pass an official comment on the appointment of fellow Ghanaian Edward Enninful as the Editor of Vogue UK in addition to the role of women in broadcasting. In 2019 she interviewed Christopher Raeburn at the Copenhagen Fashion Summit."]}, {"page": "Carri Munden", "response": ["In 2007, Munden was nominated for \"Best Menswear Designer\" at the British Fashion Awards, alongside Christopher Bailey and Alexander McQueen."]}, {"page": "2009 Birthday Honours", "response": ["* Christopher Bailey, Creative Director, Burberry. For services to the Fashion Industry."]}, {"page": "Christopher Bailey (Creative Director)", "response": ["#REDIRECT Christopher Bailey (fashion designer)"]}, {"page": "Red (The Communards album)", "response": ["The last cut on the original vinyl side one is an emotional ballad. It was written in memory of Mark Ashton a friend of Somerville and Richard Coles who died of HIV/AIDS. Mark Hooper of The Rough Guide to Rock writes that this cut may be Somerville's \"most impassioned moment\". It was among the first pop songs to address AIDS. \"For a Friend\" reached number 28 on the British charts. It was featured in the soundtrack of the 2014 film Pride. It was also one of the songs played at Burberry’s February 2018 show, marking Christopher Bailey’s final outing for the brand."]}, {"page": "The Daydream Club", "response": ["|Christopher Bailey contacted the band requesting their participation in an upcoming ad campaign, and they were chosen as the new faces for the Spring/Summer eyewear launch alongside other British musicians including Life in Film, Marika Hackman and One Night Only. All tracks were recorded exclusively for Burberry with accompanying music videos filmed on set in London. The track secured the band features with Rolling Stone magazine, Vogue, Grazia and a number of other fashion and music editorials. The re-worked single version was mixed and mastered by Sam Bell. "]}, {"page": "Met Gala", "response": ["|Anna Wintour, Christopher Bailey, Sienna Miller"]}, {"page": "Christopher Bailey", "response": ["Christopher Bailey is the name of:", "*Christopher Bailey (fashion designer) (born 1971), Chief Creative and CEO of Burberry", "*Christopher Bailey (screenwriter), lecturer and Doctor Who screenwriter"]}, {"page": "Kai Z Feng", "response": ["Feng has also garnered an international reputation for his portraiture work and has photographed many well-known names including Jennifer Lopez, Nicole Kidman, Cate Blanchett, Susan Sarandon, Hilary Swank, Bruno Mars, Katy Perry, Eva Mendes, Anna Paquin, Holly Hunter, Mischa Barton, Christopher Bailey, Katherine Jenkins, Nicholas Hoult, Jim Sturgess, Esperanza Spalding, Darren Criss, Troye Sivan and Amir Khan among others."]}, {"page": "Cara Delevingne", "response": ["Delevingne was scouted by Burberry's Christopher Bailey in 2012 while working part-time in the office of a fashion website. Bailey cast her in the company's spring/summer 2011 campaign."]}]}}