{"wiki_id": "http://www.wikidata.org/entity/Q1086825", "itemLabel": "Christopher Llewellyn Smith", "itemDescription": "British particle physicist", "wikipedia_url": "https://en.wikipedia.org/wiki/Christopher_Llewellyn_Smith", "wikipedia_page": {"main": "Sir Christopher Hubert Llewellyn Smith  (born 19 November 1942) is an Emeritus Professor of Physics at the University of Oxford.", "link_mentions": [{"page": "University College London", "response": ["* Sir Christopher Llewellyn Smith (1999–2002)"]}, {"page": "DEMOnstration Power Plant", "response": ["The EU DEMO timeline has slipped several times, following slippage in the ITER timetable. The following timetable was presented at the IAEA Fusion Energy Conference in 2004 by Christopher Llewellyn Smith:"]}, {"page": "Llywelyn", "response": ["*Sir Christopher Llewellyn Smith, British physicist"]}, {"page": "Richard Dalitz", "response": ["His research collaborators included Hans Bethe, Frank Close, F. J. Duarte, Freeman Dyson, Nicholas Kemmer, Rudolf Peierls, Christopher Llewellyn Smith and John Clive Ward."]}, {"page": "Ishfaq Ahmad Khan", "response": ["In the 1990s, Ahmad played a pivotal role in building closer relations with the CERN, and lobbied tirelessly for PAEC to reach an agreement with CERN. In 1997, Ahmad, as chair of PAEC, signed an agreement with CERN in the up gradation of the CMS detector and the financial contribution worth one million SFr for the construction of eight magnetic rings for the detector. This was followed by in 1998, Ishfaq Ahmad, as PAEC chairman, reached another contract with CERN. The signing of the agreement was followed by the state visit of CERN's director Christopher Llewellyn Smith with whom Ahmad signed a collaborative agreement that provided an entry point for Pakistani's scientist (respectively PAEC) into the CMS collaboration."]}, {"page": "List of directors general of CERN", "response": ["|Christopher Llewellyn Smith"]}, {"page": "Llewellyn Smith (Physicist)", "response": ["#REDIRECT Christopher Llewellyn Smith "]}, {"page": "Synchrotron-Light for Experimental Science and Applications in the Middle East", "response": ["The facility is the only synchrotron radiation facility in the Middle East and is one of around 60 in the world. , the president of the SESAME Council is Rolf Heuer. He was preceded by Christopher Llewellyn Smith (2008-2017) and Herwig Schopper (2004-2008). All three were previously directors-general of CERN. Khaled Toukan, the chairman of the Jordan Atomic Energy Commission, is the current director and former vice-president of SESAME."]}, {"page": "Christopher Smith", "response": ["*Christopher Llewellyn Smith (born 1942), British physicist"]}, {"page": "Llewellyn Smith (physicist)", "response": ["#REDIRECT Christopher Llewellyn Smith"]}, {"page": "Christopher Hubert Llewellyn Smith", "response": ["#REDIRECT Christopher Llewellyn Smith"]}, {"page": "Derek Roberts", "response": ["Roberts retired in 1999, but returned to UCL in 2002 to act as interim Provost following the resignation of his successor, Christopher Llewellyn Smith. He served until the appointment of Malcolm Grant in August 2003."]}, {"page": "Culham Centre for Fusion Energy", "response": ["* 2003–2008: Christopher Llewellyn Smith"]}, {"page": "Sir Christopher Llewellyn Smith", "response": ["#REDIRECT Christopher Llewellyn Smith"]}, {"page": "Index of physics articles (C)", "response": ["*Christopher Llewellyn Smith"]}, {"page": "The Life Scientific", "response": ["| data-sort-value=\"Llewellyn Smith, Christopher\"| Christopher Llewellyn Smith"]}, {"page": "Chris Llewellyn Smith", "response": ["#REDIRECT Christopher Llewellyn Smith"]}, {"page": "Physics outreach", "response": ["As a form of outreach within the physics education community for teachers and students, in 1997 the US National Science Foundation (NSF) and Department of Energy USDOE established QuarkNet, a professional teacher development program. In 2012, the University of Notre Dame received a $6.1M, five-year grant to support a nationwide expansion of the Quarknet program. Also in 1997, the European Particle Physics Outreach Group, led by Christopher Llewellyn Smith, FRS, and Director General of CERN, was formed to create a community of scientists, science educators, and communication specialists in science education and public outreach for particle physics.  This group became the International Particle Physics Outreach Group (IPPOG) in 2011 after the start up of the LHC.About IPPOG. (n.d.). Retrieved from http://ippog.web.cern.ch/content/2011/about-ippog"]}, {"page": "AAAS Award for Science Diplomacy", "response": ["|2019||Christopher Llewellyn Smith, Eliezer Rabinovici, Zehra Sayers, Herwig Schopper and Khaled Toukan||"]}, {"page": "List of Honorary Fellows of New College, Oxford", "response": ["*Sir Christopher Llewellyn Smith"]}, {"page": "SLAC Theory Group", "response": ["Notable physicists who were students or postdoctoral researchers in the SLAC Theory Group include Nima Arkani-Hamed, Thomas Appelquist, Mirjam Cvetic, Michael Dine, John Ellis, Rouven Essig, Edward Farhi, Steven Frautschi, Joshua Frieman, Roscoe Giles, Yuval Grossman, Jack F. Gunion, Alan Guth, Howard Haber, Claude Itzykson, Robert Jaffe, David E. Kaplan, Igor Klebanov, Peter Lepage, Christopher Llewellyn Smith, Kirill Melnikov, Stephen Parke, Maxim Perelstein, Joel Primack, Joseph Polchinski, Davison Soper, Henry Tye, Mark Wise, and Tung-Mow Yan."]}]}}