{"wiki_id": "http://www.wikidata.org/entity/Q10875", "itemLabel": "Laura Bassett", "itemDescription": "English association football player (born 1983)", "wikipedia_url": "https://en.wikipedia.org/wiki/Laura_Bassett", "wikipedia_page": {"main": "Laura Bassett (born 2 August 1983) is an English former football defender who represented England internationally. She played for FA WSL club Notts County, Birmingham City (two separate spells), Arsenal, Leeds Carnegie, Chelsea, and Australian W-League club Canberra United.\nBassett acquired over 60 caps for the national team between 2003 and 2017, being part of the squad at UEFA Women's Euro 2009, the 2011 FIFA Women's World Cup, UEFA Women's Euro 2013, the 2015 FIFA Women's World Cup and UEFA Women's Euro 2017.", "link_mentions": [{"page": "Nuneaton", "response": ["* Laura Bassett, Member of the 2015 WWC Bronze medal-winning England Women's National Football team "]}, {"page": "England women's national football team", "response": ["At the 2015 FIFA Women's World Cup in Canada, England lost their opening group game to France but won their remaining group games against Mexico and Colombia, easing through to the last 16 to play 1995 champions Norway. A 2–1 win set up a meeting with hosts Canada in the quarter-finals. Despite facing not only a strong Canadian team but a capacity partisan crowd at BC Place in Vancouver, England progressed to the semifinals of the Women's World Cup for the first time in their history with another 2–1 win, which also marked the first semifinal appearance by any England senior team since the men reached the last four of the 1990 World Cup in Italy. Playing reigning World Cup holders Japan in the semi-finals, England conceded a penalty kick, which Aya Miyama converted past Karen Bardsley. Japan then conceded a penalty as Yuki Ogimi clipped Steph Houghton and Fara Williams slotted it past Ayumi Kaihori to level the game. However, in the last minute of the game, Laura Bassett scored an own goal to send Japan through to the final. England eventually finished in third place by beating Germany 1–0 after extra time after a Williams penalty, their first time beating their archrivals in the women's game. It marked the best finish for any England senior team since the men's team famously won the 1966 World Cup as hosts."]}, {"page": "Karen Carney", "response": ["Carney joined Birmingham City Ladies at the age of 11 and played at various age levels for the club alongside the likes of Eniola Aluko and Laura Bassett. She made her first-team debut for Birmingham City in the FA Women's Premier League National Division against Fulham Ladies at the age of 14. She earned FA National Young Player of the Year honors in 2005 and 2006."]}, {"page": "Women's football in England", "response": ["The women's game in England took a hit following the 2012 Olympics after England was unable to advance from the group stages at Women's EURO 2013 in Sweden, which led to Hope Powell's departure as manager and the appointment of Welshman Mark Sampson. However, England then gave the women's game a boost that may be even bigger than the Olympic boost when they stunned many both at home and abroad by finishing third at the 2015 Women's World Cup in Canada. Along the way, they beat Norway for their first knockout stage win and then host nation Canada in front of a capacity partisan crowd in Vancouver. Following a devastating loss in the semis against defending champion Japan after a Laura Bassett own goal, the team rebounded to beat Germany for the first time in women's football after a 1–0 extra-time win in the third-place game. It meant that England had finished as the top European team at the World Cup and had recorded the second-best World Cup showing by any England senior team behind only Sir Alf Ramsey, Bobby Charlton and Bobby Moore's England men's squad famously winning the 1966 World Cup as hosts."]}, {"page": "Birmingham City W.F.C.", "response": ["In March 2003, local sports reporter Gary Newbon criticised women's football and bet the club £500 that they could not attract 500 supporters to their upcoming match against Doncaster Belles. Humiliated Newbon lost his bet. The academy had begun to produce players for the first team at this point, and Laura Bassett became the first Birmingham City Ladies player, from the academy or otherwise, to appear for England at full international level."]}, {"page": "UEFA Women's Euro 2009", "response": ["|DF ||19|| Laura Bassett || ||"]}, {"page": "List of FIFA Women's World Cup goalscorers", "response": ["* Laura Bassett (scored for Japan in 2015)"]}, {"page": "Last-minute goal", "response": ["* 2015 FIFA Women's World Cup Semi-finals – Japan vs. England, 1 July 2015: In the second semi-final match, reigning champions Japan faced England, who reached the semi-finals for the first time. Both teams scored one goal each in the first half of the match from penalties. The score was still 1–1 until the second minute of stoppage time, when Laura Bassett committed an own goal while attempting to clear the ball off the English goaline. Japan moved on to lose their title to U.S., their former opponent in the final round four years ago in Germany, after a 2–5 defeat. England, however, went on to beat Germany 1–0 to secure third place."]}, {"page": "Camille Abily", "response": ["At the opening match of the 2015 FIFA Women's World Cup, a 1–0 win over England in Moncton, Abily controversially escaped punishment when she inflicted a black eye on Laura Bassett by elbowing the English player in the face."]}, {"page": "List of foreign A-League Women players", "response": ["* Laura Bassett – Canberra United – 2017–18"]}, {"page": "2002 FIFA U-19 Women's World Championship squads", "response": ["| 6 ||align=left|Laura Bassett ||align=left| Birmingham City  ||align=left|  ||0 ||0 ||0 ||0 ||0"]}, {"page": "UEFA Women's Euro 2013", "response": ["* Laura Bassett"]}]}}