{"wiki_id": "http://www.wikidata.org/entity/Q1088032", "itemLabel": "Llywelyn Bren", "itemDescription": "Welsh noble", "wikipedia_url": "https://en.wikipedia.org/wiki/Llywelyn_Bren", "wikipedia_page": {"main": "Llywelyn Bren (died 1318), or Llywelyn ap Gruffudd ap Rhys or Llywelyn of the Woods (English), also spelt Llewelyn Bren, was a nobleman who led a 1316 revolt in Wales in the reign of King Edward II of England. It marked the last serious challenge to English rule in Wales until the attempts of Owain Lawgoch to invade Wales with French support in the 1370s. Hugh Despenser the Younger's unlawful execution of Llywelyn Bren helped to lead to the eventual overthrow of both Edward II and Hugh.", "link_mentions": [{"page": "1316", "response": ["* January 28–March 18 – Llywelyn Bren revolts against English rule in Wales."]}, {"page": "1318", "response": ["** Llywelyn Bren, Welsh rebel"]}, {"page": "History of Wales", "response": ["There were a number of rebellions including ones led by Madog ap Llywelyn in 1294–1295Moore, D. The Welsh wars of independence p. 159. and by Llywelyn Bren, Lord of Senghenydd, in 1316–1318. In the 1370s, the last representative in the male line of the ruling house of Gwynedd, Owain Lawgoch, twice planned an invasion of Wales with French support. The English government responded to the threat by sending an agent to assassinate Owain in Poitou in 1378.Moore, D. The Welsh wars of independence p.164-6"]}, {"page": "Cardiff Castle", "response": ["Richard's grandson, Gilbert de Clare, the last male de Clare, died at the Battle of Bannockburn in 1314 and the castle was given to Hugh Despenser the Younger, the controversial favourite of Edward II. Poor harvests and harsh governance by the Despenser family encouraged a Welsh rebellion under Llywelyn Bren in 1316; this was crushed and Llywelyn was hanged, drawn and quartered in Cardiff Castle in 1318 on Hugh's orders.;  The execution attracted much criticism from across both the English and Welsh communities, and in 1321 Hugh arrested Sir William Fleminge as a scapegoat for the incident, first detaining him in the Black Tower and then executing him in the castle grounds.;  Conflict between the Despensers and the other Marcher Lords broke out soon after, leading to the castle being sacked in 1321 during the Despenser War. The Despensers recovered the castle and retained it for the rest of the century, despite the execution of Hugh Despenser for treason in 1326.;  Under a 1340 charter granted by the Despensers, the castle's constable was made the de facto mayor of Cardiff, controlling the local courts.; "]}, {"page": "Caerphilly", "response": ["After the death of Gilbert de Clare at the battle of Bannockburn in 1314, Edward II became guardian of De Clare's three sisters and heiresses. In 1315 he replaced de Badlesmere with a new English administrator, Payn de Turberville of Coity, who persecuted the people of Glamorgan. Then like many in northern Europe at the time, the region was in the throes of a serious famine. In coming to the defence of his people, Llywelyn Bren, the great grandson of Ifor Bach and Welsh Lord of Senghenydd incurred the wrath of de Turberville, who charged him with sedition. Llywelyn appealed to Edward II to call off or control his self-interested agent, but Edward ordered Llywelyn to appear before Parliament to face the charge of treason. The King promised Llywelyn that if the charges were found true, he would be hanged. Llywelyn fled and prepared for war. On 28 January 1316, Llywelyn began the revolt by a surprise attack on Caerphilly Castle. He captured the constable outside the castle and the outer ward but could not break into the inner defences. They burned the town, slaughtered some of its inhabitants and started a siege. The town was rebuilt but remained very small throughout the Middle Ages. The first evidence of its emerging importance was the construction of a court house in the 14th century, the only pre-19th century building remaining in the town."]}, {"page": "Caerphilly Castle", "response": ["The castle was attacked during the Madog ap Llywelyn revolt of 1294, the Llywelyn Bren uprising in 1316 and during the overthrow of Edward II in 1326–27. In the late 15th century, however, it fell into decline and by the 16th century the lakes had drained away and the walls were robbed of their stone. The Marquesses of Bute acquired the property in 1776 and under the third and fourth Marquesses extensive restoration took place. In 1950 the castle and grounds were given to the state and the water defences were re-flooded. In the 21st century, the Welsh heritage agency Cadw manages the site as a tourist attraction.", "Gilbert's son, also called Gilbert de Clare, inherited the castle, but he died fighting at the battle of Bannockburn in 1314 while still quite young. The family's lands were initially placed under the control of the Crown, but before any decision could be taken on the inheritance, a revolt broke out in Glamorgan. Anger over the actions of the royal administrators caused Llywelyn Bren to rise up in January 1316, attacking Caerphilly Castle with a large force of men. The castle withstood the attack, but the town was destroyed and the rebellion spread. A royal army was despatched to deal with the situation, defeating Bren in a battle at Caerphilly Mountain and breaking the Welsh siege of the castle."]}, {"page": "Ystradfellte", "response": ["Ystradfellte is chiefly known in history as the place where the Welsh nobleman and rebel leader Llywelyn Bren surrendered at the end of his revolt of 1316. Llywelyn gave himself up on the condition that his men be spared, but was himself put to death in 1318 at Cardiff.Biography: Craig Owen Jones, Compact History of Welsh Heroes: Llywelyn Bren, Gwasg Carreg Gwalch, Llanrwst, 2007. . Retrieved 27 March 2019."]}, {"page": "Llantrisant", "response": ["Llantrisant Castle stands in parkland in the centre of the town though only one wall of the raven tower remains. Although initially built as a wooden fortification it was rebuilt as a stone structure around 1246 by Richard de Clare, Lord of Glamorgan. In 1294 the castle was damaged during the uprising against the Norman overlords, led by Madog ap Llywelyn, and again in 1316 by Llywelyn Bren. It is believed that the castle was destroyed in 1404 by Owain Glyndŵr though there is no written proof of the event. John Leland reported the castle as ruined in his writings in 1536."]}, {"page": "Timeline of British history", "response": ["| Revolt of Llywelyn Bren in South Wales."]}, {"page": "Timeline of British history (1000–1499)", "response": ["* 1316 Revolt of Llywelyn Bren in south Wales"]}, {"page": "Cosmeston Medieval Village", "response": ["In addition to the plague, the villagers would have had to combat other difficulties. The land is low-lying and at the mercy of the many water sources that now feed the Cosmeston Lake. There is substantial evidence of drainage dykes, but even they would have struggled to keep the arable land free from waterlogging and constant flooding. Additionally the period was one of permanent political upheaval with intermittent resistance and armed conflict between several local Welsh leaders.  In January 1316, for instance, Llywelyn Bren attacked Caerphilly Castle, and for the next two months there was conflict and devastation throughout the Glamorgan region."]}, {"page": "Humphrey de Bohun, 4th Earl of Hereford", "response": ["The subsequent revival of royal authority and the growing ascendancy of the Despensers (Hugh the elder and younger) led de Bohun and other barons to rebel against the king again in 1322. De Bohun had special reason for opposing the Despensers, for he had lost some of his estates in the Welsh Marches to their rapacity and he felt they had besmirched his honour. In 1316 De Bohun had been ordered to lead the suppression of the revolt of Llywelyn Bren in Glamorgan which he did successfully. When Llewelyn surrendered to him the Earl promised to intercede for him and fought to have him pardoned. Instead Hugh the younger Despenser had Llewelyn executed without a proper trial. Hereford and the other marcher lords used Llywelyn Bren's death as a symbol of Despenser tyranny."]}, {"page": "Hugh Despenser the Younger", "response": ["Eleanor was also the niece of the new king, Edward II of England, and this connection brought Despenser closer to the English royal court. He joined the baronial opposition to Piers Gaveston, the king's favourite (and Despenser's brother-in-law, through Gaveston's marriage to Eleanor's sister Margaret). Eager for power and wealth, Despenser seized Tonbridge Castle in 1315, after his brother-in-law's death under the misapprehension that it belonged to his mother-in-law; he relinquished it on discovering that the rightful owner was, in fact, the Archbishop of Canterbury. In 1318 he murdered Llywelyn Bren, a Welsh hostage in his custody.", "Like his father, the younger Despenser was accused of widespread criminality. Amongst other examples, Despenser seized the Welsh lands of his wife's inheritance while ignoring the claims of his two brothers-in-law. He further cheated his sister-in-law Elizabeth de Clare out of Gower and Usk, and forced Alice de Lacy, 4th Countess of Lincoln, to give up her lands to him. He had murdered Llywelyn Bren in 1318 while the Welshman was being held hostage, and during his exile he spent a period of time as a pirate in the English Channel, \"a sea monster, lying in wait for merchants as they crossed the sea\". In addition he imprisoned Sir William Cokerell in the Tower of London and extorted money from him."]}, {"page": "Madog ap Llywelyn", "response": ["The revolt of 1294–95 elicited a harsh response from Edward I in the form of humiliating and punitive ordinances further restricting the civil rights and economic and social opportunities of the Welsh. However, it was not long before Llywelyn Bren, Lord of Senghenydd, led a second rebellion, aided by some of the more prominent Marcher Lords in 1316."]}, {"page": "Ifor Bach", "response": ["Descendants of Ifor ap Meurig continued to hold sway in the area and to harry the Normans for at least another century. He was succeeded by his son Gruffudd before 1170.  Gruffudd ap Ifor married Mabel FitzRobert, a natural daughter of Robert, Earl of Gloucester, and half sister of the kidnapped earl. Ifor's descendants included his grandson Morgan Gam and his great-grandson Llywelyn Bren and, through Gruffudd and Mabel, Franklin Pierce."]}, {"page": "Llywelyn", "response": ["*Llywelyn Bren (died 1318), nobleman who led a Welsh rebellion in 1316"]}, {"page": "Dinefwr Castle", "response": ["The castle now came into English hands, though it is recorded to have been burnt during the rebellion of Llywelyn Bren in 1316. In 1317 it was given to Hugh Despenser, the king's favourite. It was unsuccessfully besieged by the forces of Owain Glyndŵr in 1403. Towards the end of the 15th century the castle was held by Sir Rhys ap Thomas, who carried out extensive rebuilding. In 1531 his grandson  Rhys ap Gruffydd was executed for treason and the castle was confiscated by the crown, though the family were later able to recover it. In 1660 Newton House was built nearby and the castle keep modified as a summer house. The remains of the large windows can be seen at the top of the keep, but it burned down in the 18th century."]}, {"page": "Wales in the Late Middle Ages", "response": ["There were a number of rebellions including ones led by Madog ap Llywelyn in 1294-5 Moore, D. The Welsh wars of independence p.159 and by Llywelyn Bren, Lord of Senghenydd, in 1316–18. In the 1370s the last representative in the male line of the ruling house of Gwynedd, Owain Lawgoch, twice planned an invasion of Wales with French support. The English government responded to the threat by sending an agent to assassinate Owain in Poitou in 1378.Moore, D. The Welsh wars of independence p.164-6"]}, {"page": "Coat of plates", "response": ["In the transitional period segmented armour like the coat of plates was replaced by larger, better shaped and fitted plates. Mathias Goll stresses that while plate armour was more effective, the segmented armour could be \"lighter and more flexible while it left less 'dangerous' chinks\". The segmented armour also put fewer demands on the craftsman, requiring fewer tools and less skill, thus being prominently cheaper. As a consequence, the \"older\" types could remain in production alongside more \"modern\" developments. In addition to protection and wearer comfort, this armor was also chosen for fashion.Goll 2013: pp. 53. In 1295, the coat of plates was worn along with mail by nearly all troops in an army gathered by King Philip IV of France. In that same year, a Lombard merchant brought to Bruges the huge amount of 5,067 coats-of-plates, alongside other equipment.Nicolle, David, 1999, In 1295 a Lombard merchant brought no fewer than 1,885 crossbows, 666,258 quarreli, 6,309 small shields, 2,853 light helmets, 4,511 quilted coats, 751 pairs of gauntlets, 1,374 gorgiera neck protectors and brassards, 5,067 coats-of-plates, 13,495 lances or lanceheads, 1,989 axes and 14,599 swords and couteaux daggers to Brugge, p. 53. The armor was so popular that in 1316 the captured harnesses of the Welsh noble Llywelyn Bren included a \"buckram armor\".Heath, Ian 1989, the confiscated armor of the rebel Llywelyn Bren (of the royal house of Senghenydd in Glamorgan) is recorded to have comprised an aketon, a gambeson, 3 haubergeons, an iron breastplate, a buckram armor (doubtless a coat-of-plates), an iron helmet, 2 pairs of maunc' (vambraces), a shield and a pair of gauntlets. Though this harness is somewhat more comprehensive than that generically in use at the end of the 13th century, the significant point is that would have made Llywelyn Bren undistinguishable from his English adversaries., p. 93. By the second half of the 14th century, the coat of plates became affordable enough to be worn by soldiers of lesser status, like the Gotland's militiamen or the urban militia of Paris. "]}, {"page": "1310s in England", "response": ["** 28 January – Welsh revolt against English rule in Glamorgan led by Llywelyn Bren breaks out with an attack on Caerphilly Castle.", "** 18 March – Llywelyn Bren surrenders to Humphrey de Bohun, Earl of Hereford, at Ystradfellte.", "** Hugh Despenser the Younger has Llywelyn Bren hanged, drawn and quartered at Cardiff Castle without authority."]}, {"page": "14th century in Wales", "response": ["*28 January - Llywelyn Bren, a nobleman of Glamorgan, leads a revolt, attacking Caerphilly Castle.", "*March - In a brief battle at Castell Mor Graig, Llywelyn Bren and his men are forced to break off their six-week siege of Caerphilly.", "*18 March - Llywelyn Bren surrenders unconditionally to Humphrey de Bohun, 4th Earl of Hereford.", "*Llywelyn Bren is unlawfully executed at Cardiff Castle."]}, {"page": "Timeline of Cardiff history", "response": ["1315: Llywelyn Bren, a great-grandson of Ifor Bach, attacked Cardiff Castle."]}, {"page": "Wales in the Middle Ages", "response": ["There were a number of rebellions including ones led by Madog ap Llywelyn in 1294–1295 and by Llywelyn Bren, Lord of Senghenydd, in 1316–1318. In the 1370s the last representative in the male line of the ruling house of Gwynedd, Owain Lawgoch, twice planned an invasion of Wales with French support. The English government responded to the threat by sending an agent to assassinate Owain in Poitou in 1378."]}, {"page": "John Grey, 2nd Baron Grey de Wilton", "response": ["He was summoned to Parliament from 1309 to 1322. His first parliamentary appointment was that of Lord Ordainer in 1310, and was followed by the grant in 1311 of Ruthin Castle, which passed to his younger son Roger de Grey. He was at the Battle of Bannockburn, where the English army took a heavy defeat. Nonetheless he was trusted by Edward II who was confident in the appointment as Justice of North Wales in February 1314/15 and governor of Caernarfon Castle.Breese's Calendars of Gwynedd p. 125, (London, 1873). He was relieved of his constabulatory responsibilities the following year and called to raise troops in response to the insurrection led by Llywelyn Bren."]}, {"page": "History of Cardiff", "response": ["Between 1158 and 1316 Cardiff was attacked on several occasions. Amongst the various attackers of the castle were Ifor Bach, who captured the Earl of Gloucester who at the time held the castle. Morgan ap Maredudd apparently attacked the settlement during the revolt of Madog ap Llywelyn in 1294. In 1316 Llywelyn Bren, Ifor Bach's great-grandson, also attacked Cardiff Castle as part of a revolt. He was illegally executed in the town in 1318 on the order of Hugh Despenser the Younger."]}, {"page": "Senghenydd", "response": ["In 1318 Llywelyn became the prisoner of the ruthless Hugh Despenser the younger, one of King Edward's favourites at court, who had become Lord of Glamorgan in November 1317 and thus the largest land owner in South Wales, and was a great rival of Mortimer. Without the king's direction, he took Llywelyn Bren to Cardiff Castle where he had him hanged, drawn and quartered without a proper trial. After the parts of his body were exhibited in various parts of the county he was buried in the Grey Friars at Cardiff. Llywelyn's lands were seized by Despenser. This action was condemned at the time and later used as example of the Despensers' growing tyranny. Despenser also imprisoned Lleucu and some of her sons in Cardiff.", "With the overthrow of Edward II, the estates in Senghenydd were restored (11 February 1327) to Llywelyn Bren's sons: Gruffydd, John, Meurig, Roger, William and Llywelyn. The Earls of Hereford continued to pay at Brecon an allowance to their mother Lleucu until 12 April 1349."]}, {"page": "Kenfig Castle", "response": ["The castle was sacked by the Welsh on at least six occasions, in 1167, 1183, 1232, 1242, 1294, and 1295, by Morgan ap Maredudd during the revolt of Madog ap Llywelyn, and again in 1316 during the revolt of Llywelyn Bren. In the early 14th century, the castle was substantially reconstructed. The ramparts were removed to make the court more level and a curtain wall was erected, with a large gatehouse leading to the borough. The tower was also substantially rebuilt."]}, {"page": "List of Anglo-Welsh wars", "response": ["* 1316 uprising in Gwent and Morgannwg led by Llywelyn Bren the lord of Senghennydd and a descendant of the kings of Morgannwg. Rebels put Caerphilly Castle under siege for six weeks and burn the town. Bren's forces are defeated, he is captured and executed."]}, {"page": "William Montagu, 2nd Baron Montagu", "response": ["In May 1313 he attended King Edward II and his wife Isabella of France when they travelled to France to pay a state visit to King Philip IV, and in the same year and in 1314 served again in Scotland. In February 1316 he played a leading part in suppressing a rebellion in Glamorgan by Llywelyn Bren (died 1318), and in July 1316 was sent to Bristol to settle grievances between the town's burgesses and Bartholomew de Badlesmere, 1st Baron Badlesmere (died 1322), Constable of Bristol Castle. In reward for his services, in August 1316 he was granted the marriage of the king's ward Joan de Verdun, daughter and heiress of Theobald de Verdun, whom he married-off the following year to his younger son, John Montagu (d. August 1317). In November 1316 he was appointed Steward of the Household to King Edward II, a position which was accompanied by the grant, on 13 January 1317, of an annuity of 200 marks which he received until June 1317, when in lieu of the annuity the king granted him for life, as \"King's Bachelor\", several manors, including Gravesend in Kent and Kingsbury in Somerset. On 26 September 1317 the King granted him licence to crenellate his mansion house at Cassington in Oxfordshire. He was summoned by writ to Parliament from 20 November 1317, where he was one of the majores barones in the king's party."]}, {"page": "Goronwy ap Tudur Hen", "response": ["Goronwy ap Tudur Hen was Lord of Penmynydd and a soldier in the service of the English crown. He joined King Edward II of England for his invasion of Scotland in 1314 as part of the First War of Scottish Independence, which included service at the Battle of Bannockburn in June of that year. In 1316, a rebellion took place in Glamorgan under the leadership of Llywelyn Bren, at the same time Edward was campaigning in Scotland. Despite this there was little concern that it would spread to North Wales, with the royal officials instead concerned with the threat of invasion from Ireland. Some 1,500 troops were summoned from the area to support the King, and among those leading those troops were Iorweth ap Gruffudd, Gruffudd Llwyd and his cousin Goronwy ap Tudur Hen. After these troops, under the command of Gruffudd Llwyd, moved to Chester, they were dismissed on 4 August 1316 to return to North Wales in order to protect the area from the Irish threat."]}, {"page": "Conquest of Wales by Edward I", "response": ["Rebellions continued to occur in Wales sporadically. These included revolts in 1287–88, and more seriously, in 1294 under Madog ap Llywelyn, a distant relative of Llywelyn ap Gruffudd and in 1316–1318 by Llywelyn Bren, Lord of Senghenydd. In the 1370s, Owain Lawgoch the last representative in the male line of the ruling house of Gwynedd planned two invasions of Wales with French support. In 1400, a Welsh nobleman, Owain Glyndŵr (or Owen Glendower), led the most serious revolt against English rule. None of these rebellions succeeded and by the Laws in Wales Acts 1535–1542 Wales was effectively incorporated into the Kingdom of England."]}, {"page": "Bren (surname)", "response": ["*Llywelyn Bren (died 1318), Welsh rebel"]}, {"page": "Tregrug Castle", "response": ["The original castle on the site, a Norman motte and bailey to the east of the existing ruins, is first recorded in 1262.Wiles, J. (13 February 2003).  This castle was later superseded by the current structure. The estate, including the motte and bailey,Wiles, J. (13 February 2003).  came into the ownership of the  family in 1245, and was in possession of Bogo de Clare (1248-1294), the third son of Richard de Clare, for some years before his death. In 1369, the community of Tregrug was severely affected by one of the later outbreaks of the plague. A new ambitious noble residence, enclosed in a high stone wall, with defensive banks and ditches, was started in the early 14th century, probably by Gilbert de Clare. The castle passed briefly into the hands of the Despenser family; it may have been Hugh Despenser who began the construction of the late medieval structure from which most of the now-standing ruins derive. It was attacked during the revolt of Llywelyn Bren in 1316."]}]}}