{"wiki_id": "http://www.wikidata.org/entity/Q1083822", "itemLabel": "Christine Tobin", "itemDescription": "singer-songwriter", "wikipedia_url": "https://en.wikipedia.org/wiki/Christine_Tobin", "wikipedia_page": {"main": "Christine Tobin (born 7 January 1963, Dublin, Ireland) is an Irish vocalist and composer from Dublin who has been part of the London jazz and improvising scene since the second half of the 1980s. She has been influenced by a diverse range of singers and writers including Betty Carter, Bessie Smith, Leonard Cohen, Olivier Messiaen, Miles Davis and poets William Butler Yeats, Paul Muldoon and Eva Salzman.", "link_mentions": [{"page": "Last Amendment", "response": ["* Savage Utopia – featuring Eve Libertine, Christine Tobin, A-Soma, Louise Elliot, Kevin Davy, Phil Robson, Liam Noble, Davide Mantovani, Matt Black (of Coldcut) performing work by Penny Rimbaud (Babel Label/Exitstencil, 2004)"]}, {"page": "Eve Libertine", "response": ["She was one of the vocalists who worked with the British anarcho-punk band Crass. Her works with the band include the single \"Reality Asylum\", as well as performing most of the vocals on the group's third album, Penis Envy (1981), the lyrics of which have a heavy anarcha-feminist content. After the dissolution of Crass in 1984, Libertine worked with her son Nemo Jones, a guitarist. She trained as a classical singer and has performed as part of Crass Agenda (renamed Last Amendment as of 2005) and with Penny Rimbaud, Matt Black, Christine Tobin, Julian Siegel, Ingrid Laubrock, Nabil Shaban, and Kate Shortt.", "Libertine held her first exhibition of artwork, entitled Head On, at the 96 Gillespie gallery, Finsbury Park, London, in September 2005.   She has designed album sleeves for Christine Tobin and Partisans. Bracketpress released a limited edition set of cards with her artwork to raise funds for Butterfield Green Community Orchard in north London."]}, {"page": "Babel Label", "response": ["Babel's catalogue includes albums by Jenkins, Steve Argüelles, Julian Argüelles, Huw Warren, Christine Tobin and Phil Robson. Held on the Tips of Fingers by Polar Bear and Knee-Deep in the North Sea by Portico Quartet were nominated for the Mercury Prize."]}, {"page": "Tim Garland", "response": ["As a bandleader, he first achieved recognition with the jazz/folk crossover group Lammas (which included Don Paterson and Christine Tobin), going on with a number of groups under his own name, the Dean Street Underground Orchestra, Storms/Nocturnes, Acoustic Triangle, and the Lighthouse Project."]}, {"page": "BBC Jazz Awards", "response": ["* Best Vocalist:Christine Tobin"]}, {"page": "Huw Warren", "response": ["Warren has performed and recorded with many of the UK's finest jazz musicians, including Kenny Wheeler, Loose Tubes, Steve Arguelles, Julian Arguelles, Billy Jenkins, John Parricelli, John Etheridge, Christine Tobin, Tim Garland, Scott Stroman, Antonio Forcione, and Brian Abrahams' District Six."]}, {"page": "Gary Husband", "response": ["In 1998, Husband released his first (solo synth) album, Diary Of A Plastic BoxMusicWeb Express review Gary Husband - \"The Complete Diary Of A Plastic Box\" (later to be re-released as a double CD in 2008, entitled The Complete Diary Of A Plastic Box), From 1998 to 2001 he led his piano trio (The New Gary Husband Trio) featuring bassist Mick Hutton and drummer Gene Calderazzo. The trio's CD releases From The Heart and AspireAll About Jazz review Gary Husband & Friends - \"Aspire\" (featuring guest appearances by Billy Cobham, vocalists Mark King (musician), Christine Tobin and Hamish Stuart), highlight the music of this group. Of his several solo piano album releases, The Things I See * Interpretations Of The Music Of Allan HoldsworthAll About Jazz review Gary Husband - \"The Things I See * Interpretations Of The Music Of Allan Holdsworth\" is an imaginative reworking of the guitarist's music. Years later he released A Meeting Of Spirits,All About Jazz review Gary Husband - \"A Meeting Of Spirits * Interpretations Of The Music Of John McLaughlin\" presenting a further selection of similarly highly personalised works based on the music of John McLaughlin."]}, {"page": "Human Chain (band)", "response": ["In 1998, Bates set up a new Anglo-Swedish band called Quiet Nights, which consisted of the four members of Human Chain plus Swedish jazz singer Josefine Cronsholm. This band was to cover an area of jazz which Bates had previously shunned or mocked – songs which had become jazz standards. Bates had anticipated this new project with his infamous 1995 subversion of \"New York, New York\" (performed by Delightful Precipice and sung by Irish singer Christine Tobin). The Quiet Nights band was to approach the same territory and continue to subvert the original songs, but generally with a much more down-tempo and peaceful approach."]}, {"page": "Steve Buckley (musician)", "response": ["Buckley's main area of work has always been within the contemporary jazz scene, playing and recording with artists such as John Taylor, Julian Arguelles, Eddie Parker, Steve Noble, Billy Jenkins, Huw Warren, Christine Tobin, Colin Towns, Seb Rochford, Mike Outram, Joseph Jarman, Jonathon Joseph and Leroy Jenkins.", "* Christine Tobin, Yell of the Gazelle (Babel, 1996)"]}, {"page": "The Gregson Centre", "response": ["* Christine Tobin"]}, {"page": "Ben Davis (cellist)", "response": ["He has since pursued a varied musical career encompassing classical, world, early music, jazz and experimental. He has performed with Ingrid Laubrock, Bobby McFerrin, Mary Halvorson, Simon Nabatov, Wadada Leo Smith, Tom Rainey, Tomeka Reid, Vincent Courtois, Django Bates, Chris Biscoe, Liam Noble, Stuart Hall, Hassan Erraji, Mulatu Astatke, Joglaresa, The Dufay Collective, Evan Parker, Christine Tobin, Steve Buckley, Huw Warren, Jason Yarde, Julian Joseph, and the Stavanger Symphony Orchestra. Ben moved to the Chicago USA in 2016 where he formed a trio with guitarist Sam Mosching and drummer Steve Hunt and a duo with guitarist Matt Gold. "]}, {"page": "1963 in jazz", "response": ["* 7 – Christine Tobin, Irish vocalist and composer."]}, {"page": "Parliamentary Jazz Awards", "response": ["* Jazz Vocalist of the Year  – Christine Tobin"]}, {"page": "List of people associated with Goldsmiths, University of London", "response": ["*Christine Tobin"]}, {"page": "Ian Shepherd", "response": ["Shepherd first trained and worked at Sound Recording Technology, near Cambridge in the UK, from 1994-2010. He started by copying tapes but was working as a mastering engineer by the end of the first year. He later developed SRT's Enhanced CD and DVD services, including mixing and mastering in surround-sound. Shepherd left SRT in 2010 to form Mastering Media, Ltd. His recording, mastering, re-mastering and authoring credits include Keane, Tricky, Deep Purple, Tina May, the Royal Philharmonic Orchestra, Culture Club, Christine Tobin and King Crimson amongst others."]}, {"page": "2012 in British music", "response": ["*Contemporary Jazz Composition: Sailing to Byzantium – Christine Tobin"]}, {"page": "Winter Truce (and Homes Blaze)", "response": ["*Christine Tobin – vocals"]}, {"page": "Tobin (surname)", "response": ["*Christine Tobin (born 1963), Irish singer"]}, {"page": "Liam Noble (musician)", "response": ["Noble's 2004 recording Romance Among the Fishes was a quartet album, with Phil Robson (guitar), Drew Gress (bass) and Tom Rainey (drums). Noble and Robson had often played together, but the four had been put together earlier the same year for an appearance at the Cheltenham Jazz Festival.Fordham, John (14 October 2005) \"Liam Noble, Romance Among the Fishes\". The Guardian. Noble's 2009 trio album, Brubeck, was described by the dedicatee, Dave Brubeck, as \"an inspiration and a challenge for me to carry on in the avenues that you [Noble] have opened\".Fordham, John (3 April 2009) \"Liam Noble Trio: Brubeck\". The Guardian. In 2010, Noble accompanied vocalist Christine Tobin on the album Tapestry Unravelled, a reworking of Carole King's Tapestry from four decades earlier.Hodgkinson, Will (24 June 2010) \"Christine Tobin Weaves a New Tapestry\". The Guardian. In 2015, Noble will release the solo piano album A Room Somewhere.\"Liam Noble Solo Album Launch\". Vortex. Retrieved 27 February 2015.", "|Duo, with Christine Tobin (vocals)"]}, {"page": "Phil Robson", "response": ["Born in Derby (Derbyshire), England in 1970, Robson began guitar studies at age 14. He played in the house rhythm section at the local club with visiting musicians as John Etheridge and Bheki Mseleku as well as with his clarinettist father, Trevor Robson. He moved to London at the age of 18 where he studied at the Guildhall School Of Music and Drama, being the youngest student at the time to do the post graduate course in jazz studies. He went on to be an integral part of the London scene and has since been the leader of several acclaimed musical projects of his own as well as appearing as a sideman with many international artists including Barbra Streisand, Django Bates, Mark Turner, Kenny Wheeler, David Liebman, Dame Cleo Laine, Maceo Parker, Donny McCaslin, and Charles Earland, among others. He also co-led the seminal UK jazz rock band \"Partisans\" with Julian Siegel and has been a long time partner of the Irish singer/songwriter Christine Tobin. ", "*Phil Robson Octet with Jason Yarde, Julian Siegel, Christine Tobin, Gene Calderazzo, Thebe Lipere, Karren Street."]}, {"page": "List of years in jazz", "response": ["* 1963 in jazz, deaths of Addison Farmer, Arvid Gram Paulsen, Bob Scobey, Bobby Jaspar, Castor McCord, Curtis Counce, Dinah Washington, Gene Sedric, Glen Gray, Herbie Nichols, Ike Quebec, Irving Aaronson, Jimmy Reynolds, Joe Gordon, John Adriano Acea, Lizzie Miles, Lodewijk Parisius, Naftule Brandwein, Pete Brown, Roy Palmer, Sam Allen, Skinnay Ennis, Sonny Clark, Specs Wright, and Wade Legge; births of Anders Widmark, Antoine Roney, Baard Slagsvold, Benny Green, Bill Lowrey, Bill Wells, Christine Ott, Christine Tobin, Cyrus Chestnut, Dan Berglund, Dalia Faitelson, Dave Douglas, Dave McKean, Don Braden, Don Paterson, Eric Person, Eric Vloeimans, Eva Cassidy, Fredrik Lundin, Gerald Cleaver, Gianni Lenoci, Gilad Atzmon, Gonzalo Rubalcaba, Holly Cole, Horacio \"El Negro\" Hernandez, Jacqui Dankworth, Jeff Beal, Jens Johansson, Jon Ballantyne, Karen Briggs, Marc Antoine, Marcus Roberts, Martin Pizzarelli, Nelson Faria, Niels Lan Doky, Nigel Mooney, Nikki Iles, Peter Havlicek, Ole Amund Gjersvik, Ralph Alessi, Renato Borghetti, Ron Miles, Russ Lorenson, Russell Malone, Scott Colley, Sherrie Maricle, Stephanie Biddle, Steve Argüelles, Thomas Blachman, Thulla Christina Wamberg, Tierney Sutton, Tine Asmundsen, Vigleik Storaas, Ximo Tebar, Yoko Kanno, and Yoron Israel."]}]}}