{"wiki_id": "http://www.wikidata.org/entity/Q1083399", "itemLabel": "Joe Goss", "itemDescription": "American boxer", "wikipedia_url": "https://en.wikipedia.org/wiki/Joe_Goss", "wikipedia_page": {"main": "Joseph Goss was an English bare knuckle boxer.  After defeating Tom Allen in Boone County, Kentucky, he held the American and what many boxing historians now consider the World Heavyweight boxing championship from 7 September 1876 to 30 May 1880. Although he rarely scaled more than 160 pounds, the clever and aggressive Goss routinely fought men both bigger and heavier than himself.\n\n", "link_mentions": [{"page": "1866 in sports", "response": ["* 6 August — Jem Mace defeats Joe Goss in the 21st round and reclaims the vacant English Championship.Cyber Boxing Zone – Jem Mace.  Retrieved on 8 November 2009."]}, {"page": "1876 in sports", "response": ["* After three years of inactivity, Tom Allen finally defends his American Championship title against Joe Goss at Boone County, Kentucky.Cyber Boxing Zone – Tom Allen.  Retrieved on 12 November 2009.  Goss, another English fighter, takes the title when Allen is disqualified for a foul punch in the 14th round.  Goss is another inactive champion and does not defend the title until May 1880.Cyber Boxing Zone – Joe Goss.  Retrieved on 12 November 2009."]}, {"page": "1878 in sports", "response": ["* A number of fights scheduled to involve one or two of Joe Goss, Paddy Ryan and John J. Dwyer are all cancelled.  Goss retains his American Championship title in his weight division.Cyber Boxing Zone – Joe Goss.  Retrieved on 12 November 2009."]}, {"page": "1879 in sports", "response": ["* John J. Dwyer defeats former champion Jimmy Elliott in 12 rounds at Long Point, Canada, and then claims the Heavyweight Championship of America due to the continued inactivity of current champion Joe Goss and the main challenger Paddy Ryan.  His claim is not recognised.  Subsequently, Dwyer becomes involved in a bar room brawl with Ryan in New York City.Cyber Boxing Zone – John J Dwyer.  Retrieved on 12 November 2009."]}, {"page": "1880 in sports", "response": ["* 30 May — after four years of inactivity, Joe Goss finally defends his Heavyweight Championship of America title against Paddy Ryan at Collier's Station, West Virginia.  Ryan wins after 87 rounds.Cyber Boxing Zone – Paddy Ryan.  Retrieved on 12 November 2009."]}, {"page": "Bare-knuckle boxing", "response": ["* Joe Goss 1876-1880"]}, {"page": "Jem Mace", "response": ["Mace was first recognised as English Middleweight champion on 1 September 1863, following his 19-round victory over Joe Goss, first staged at Wooton.  The two boxers fought at catchweights of 10 stones, 10 pounds, or roughly 68 kg (150 lbs.), currently in the very light middleweight range.  Very little fighting occurred at Wooton, and when the police intervened after thirteen minutes, the fight was moved first to Bassett, then finally to Purfleet, Essex, near London.  The purse was an exceptional £1000 to be split between the two boxers and the fighting ended at Purfleet after eighteen rounds taking two hours and ten minutes. In the final round, Mace landed a right handed lunge to the left of King's jaw that knocked him out.  Puglistica wrote that \"Goss was entirely overmatched in science, length, and weight\".\"Great Fight for £1000 between Mace and Goss\", Sheffield and Rotterham Independent, Sheffield, England, pg. 3, 2 September 1863First location lasted only thirteen minutes before police intervened in \"The Fight Between Jem Mace and Goss\", The Morning Post, London, Greater London, pg. 7, 2 September 1863", "He regained the English heavyweight championship against Goss in a 21-round victory on 6 August 1866 between Purfleet, Essex, and Gravesend on the North bank of the Thames, twenty miles East of London. By one reliable account, the ring used was only sixteen feet square, eight square feet shorter than the regulation size. Mace was said to be suffering from a strained left foot or ankle.  In a close physical matching, Goss was nearly the same height, and only a few pounds lighter, at around 158 pounds.  Goss, though he had the vitality of a man nearly seven years younger, did not gain from the advantage, as Mace's experience, skill, and conditioning seemed to count for more than the wear he'd received from his years in the ring.  Mace deftly avoided Goss's strong rushes with a shift of his shoulders or a bob of his head, showing great flexibility and speed.  Mace could strike or counter quickly, particularly using his left, and often did so under Goss's defences, even in the early rounds where he scored early and with precision.  Mace, in the 14th through 20th rounds, got the better of Goss, frequently striking his left eye with his right fist.  At the end of the match in the 21st round, Mace remained strong, but Goss was groggy and weak.  Mace was said to have very few injuries, but Goss had been battered around the \"head, face, neck, and chest\", with loosened teeth and badly battered eyes.  In the final round, Goss's seconds threw up the sponge ending the fight when their boxer staggered in his attempt to land a blow on Mace, who defended himself by merely stepping aside.\"Slashing Fight Between Jem Mace and Joe Goss\", The Nottinghamshire Guardian, Nottingham, England, pg. 7, 10 August 1866Mace took the 14th through 16th in \"Fight for 400 between Mace and Goss\", Cheshire Observer, Chester, Chesire, England, pg. 2, 11 August 1866", "|style=\"text-align:left;\"| Joe Goss", "|style=\"text-align:left;\"| Joe Goss", "|style=\"text-align:left;\"| Joe Goss"]}, {"page": "Paddy Ryan", "response": ["Patrick \"Paddy\" Ryan (15 March 1851 – 14 December 1900) was an Irish American boxer, and became the bare-knuckle American heavyweight champion on May 30, 1880, after he won the title from Joe Goss.  He retained the title until losing it to the exceptional John L. Sullivan on February 7, 1882.", "In the most significant win of his career, Ryan defeated bare-knuckle heavyweight championship Joe Goss on May 30, 1880, in Collier's Station, West Virginia.   In the 87th round, Goss was unable to continue and the contest was stopped after 90 minutes.  Ryan's final blow was a right that knocked out Goss. Up until that time, the fight was tight and well-contested.\"His Last Fight\", The Boston Globe, Boston, Massachusetts, pg. 5, 24 March 1885 Goss's seconds claimed a foul in the 87th, and with him being unable to continue, the judges awarded the bout to Ryan. His opponent appeared winded, but Ryan was terribly battered around the face and body. Ryan was nearly twenty pounds heavier and nearly six inches taller than Goss, a discrepancy which would have never been allowed in today's boxing, and may have made the difference in the match.\"Ryan Wins\", Harrisburgh Daily Independent, Harrisburgh, Pennsylvania, pg. 1, 2 June 1889Knocked out with a right in Pollock, Adam J, John L. Sullivan: The Career of the First Gloved Heavyweight Champion, (2006) McFarland and Company, Jefferson, North Carolina, Chapter 5, pg. 34", "Ryan was six years older, at least ten pounds lighter, but an inch or two taller, which gifted him with greater reach. His advantage in reach was apparently offset by less sophisticated defensive skills and speed, and somewhat inferior conditioning. Sullivan's seconds were Billy Madden and Joe Goss. His umpire was James Shannon. There was a dispute over the selection of a referee which was finally settled by the appointment of two referees: Alexander Brewster of New Orleans and Jack Hardy of Vicksburg. Considered ancient for a modern boxer, the thirty-seven year old Ryan knew he was battered from his long career and admitted, “I meant to have retired before, but you know how it is. When you whip somebody there is always somebody else turning up that wants to try his hand, and that’s the way I am caught this time.”", "| Joe Goss"]}, {"page": "London Prize Ring Rules", "response": ["Famous fighters of prize ring include William \"Bendigo\" Thompson, Tom Cribb, Jack Broughton, James \"Deaf\" Burke, \"Professor\" Mike Donovan, Tom Allen, Samuel \"Dutch Sam\" Elias, John \"Gentleman\" Jackson, the \"Benicia Boy\" John Camel Heenan, Daniel Mendoza, Tom Molineaux, John \"Old Smoke\" Morrisey, Tom Sayers, Owen Swift, the \"Trojan Giant\" Paddy Ryan, Joe Goss, and James \"Yankee Sullivan\" Ambrose, Arhan \"Hanuman Dragon\" Deshmukh. England's last prize ring great was \"gypsy\" Jem Mace, and America's was John L. Sullivan—both men fought under both sets of rules, with and without gloves and are considered bridges to the modern era of boxing."]}, {"page": "Thomas King (boxer)", "response": ["King now became very selective of his opponents refusing to meet Mace in the ring again.  Mace was frustrated and angry at not being given the opportunity to regain his heavyweight title, and in order to prompt a match deliberately set out to pick a fight with King in the street. Biography of Jem Mace  King still refused to fight him and retired allowing the heavyweight title to fall vacant, though subsequently many unofficially claimed it.Mace finally regained the title in 1866, in a victory over Joe Goss and held it until his own retirement in 1871.  Mace became the last undisputed heavyweight champion recognized under the London Prize Ring rules.  The more modern Queensbury rules written in 1865 enforcing boxing with gloves eventually replaced the London Prize Ring Rules."]}, {"page": "Goss (surname)", "response": ["*Joe Goss (1838–1885), English boxer"]}, {"page": "Joe Coburn", "response": ["Around 1865, According to the Irish Post, Coburn defeated world and American champions Joe Goss and Tom Allen, as well as Bill Rayel in Great Britain, in a build up for a future fight with American Jem Mace.  He fought at around 190 pounds during his British tour, certainly a heavyweight, and a good bit heavier than he fought in his earlier boxing career."]}, {"page": "Lew Brown (baseball)", "response": ["By 1887, he was working as a bartender at the Saracen's Head, a Boston saloon run by the widow of boxer Joe Goss. He played in a benefit game that year with other retired players at the South End Grounds, and he had gained a surprising amount of weight since leaving baseball. By July 1888, Brown said that he had reduced his weight to 214 pounds and that he was hoping to play baseball again.  "]}, {"page": "John Mahan", "response": ["He often frequented Harry Hill's bar, a hugely popular sportsman resort and the center of New York's sporting culture during the late 19th century. He became a sparring partner for then bare knuckle champion Joe Goss and later helped train Paddy Ryan who would defeat Goss for the title in 1880."]}, {"page": "Tom Allen (boxer)", "response": ["Tom Allen (23 April 1839 – 5 April 1903) was a bare-knuckle boxer who claimed the Heavyweight Championship from 1873, when he defeated Mike McCoole, until 1876, when he lost to Joe Goss.  For much of his earlier career he fought just above the middleweight range, around 165-75, making him smaller than most of the heavyweights he met.", "After several fights were stopped by Police, Allen and Joe Goss finally met on 5 March 1867  for the Middleweight championship of England in Gloucestershire.  According to one account, Goss had a decided lead until the 34th round.  Goss's right and Allen's left were somewhat disabled in the fighting, which caused the judges to end the fight in the 35th round in a draw.\"Pugilism\", The Illustrated Police News, London, Greater, London, pg. 4, 9 March 1867.  According to one source, the purse was 400 English pounds per side.\"The Allen-Gallagher Fight\", St. Louis Globe, St. Louis, Missouri, pg. 4, 18 August 1869", "On 7 September 1876, Allen lost the Heavyweight championship of America to Joe Goss in 34 rounds in Boone County, Kentucky, taking one hour and fourteen minutes.  The first seven rounds were fought in Kenton County, Kentucky and ruled a draw.  Each side collected $5,000. Many considered the title Allen fought for a world and not just an American title, and most boxing historians today consider the title a heavyweight world title.  According to one source, a foul caused when Allen struck Goss when he was down in the 14th, turned the decision in favor of Goss.  Some dispute occurred as to whether the blow was deliberate.  Several newspaper accounts seemed to agree with Allen that he had the better of the fight and was winning when the foul occurred.Allen was winning against Goss in \"The Campaign Spirit\", The Spirit of Democracy, pg. 3, 12 September 1876 Allen claimed to have won the bout, and stated \"It seems to me that I cannot get fair play in this country, and I now say I will never again enter the ring\".  Allen was arrested briefly after the match, as boxing was illegal in Kentucky.  Goss was later arrested on September 16 in New York.\"After the Battle\", \"Joe Goss Arrested\", The Cincinnati Enquirer, Cincinnati, Ohio, pg. 8, 9 September 1876Goss arrested in The Cincinnati Daily Star, Cincinnati, Ohio, pg. 1, 16 September 1876\"Fight for the Championship of the World\", New York Daily News, New York, New York, pg. 3, 8 September 1876  According to one account, Allen skipped bail to head to England to seek fights, and spend time at the racetracks."]}]}}