{"wiki_id": "http://www.wikidata.org/entity/Q1092611", "itemLabel": "Mark Bowen", "itemDescription": "Welsh association football player", "wikipedia_url": "https://en.wikipedia.org/wiki/Mark_Bowen_(footballer)", "wikipedia_page": {"main": "Mark Rosslyn Bowen (born 7 December 1963) is a Welsh football manager and former professional footballer. \nHe was a left-back he notably played in the Premier League for Norwich City, West Ham United and Charlton Athletic, having initially played in the top flight with Tottenham Hotspur. He also played in the Football League with Wigan Athletic and Reading, as well as in Japan with Shimizu S-Pulse. He was capped 41 times by Wales, scoring 3 goals.\nSince retiring in 1999, he has worked as assistant and First team coach to former international teammate Mark Hughes with Wales, Blackburn Rovers, Manchester City, Fulham, Queens Park Rangers, Stoke City and Southampton. Bowen was Head Coach and Manager for Reading during the 2019–20 season.", "link_mentions": [{"page": "1963", "response": ["** Mark Bowen, Welsh footballer"]}, {"page": "Reading F.C.", "response": ["The following season, Clement was sacked on 6 December 2018 after poor results left the club outside of the relegation zone only on goal difference. He was replaced by José Gomes as manager on 22 December 2018, who steered the club away from relegation to finish 20th again. However, after a slow start to the 2019–20 season, Gomes was dismissed after less than a year in charge with the team in the relegation zone in October 2019. Sporting director Mark Bowen was promoted to the role as his replacement a week later, who lead the team to finish 14th before departing the club in August 2020."]}, {"page": "Norwich City F.C.", "response": ["* Mark Bowen (1987–96)", "|1990|| Mark Bowen"]}, {"page": "Neath", "response": ["*Mark Bowen (1963–, b. Briton Ferry), Former manager of Reading FC, and played for Spurs and Norwich City;"]}, {"page": "Mark Hughes", "response": ["In his second season, he helped Blackburn finish inside the top six of the Premier League and subsequently qualify for the UEFA Cup, beating teams such as Chelsea, Manchester United (twice) and Arsenal en route. After just missing out on the League Cup final, his team sealed their spot in Europe by defeating champions Chelsea 1–0 at home. On 4 May 2006, Hughes and assistant Mark Bowen signed new three-year contracts to remain at Blackburn until the summer of 2009.", "On 29 July 2010, Hughes became the new manager of Fulham, following the departure of Roy Hodgson to Liverpool. Hughes agreed a two-year contract with the London side and was officially unveiled to the media on 3 August 2010, before his first match as manager on 7 August against Werder Bremen. Hughes was joined at Fulham by his backroom team of Eddie Niedzwiecki, Mark Bowen and Kevin Hitchcock. His first league match in charge of the Cottagers came exactly a week later, when they drew 0–0 at Bolton Wanderers on the opening day of the Premier League season, followed by a resolute display against Manchester United in a 2–2 draw at Craven Cottage.", "On 14 March 2018, Hughes succeeded Mauricio Pellegrino as manager of relegation-threatened Premier League club Southampton, signing a short-term contract for the remainder of the 2017–18 season. His first game was a 2–0 win at Wigan Athletic in an FA Cup quarter final. On 25 May 2018, after a season that saw the Saints retain their Premier League status, the club announced that Hughes had signed a new three-year contract. His assistants, Mark Bowen and Eddie Niedzwiecki, also signed long-term contracts with the club."]}, {"page": "Shimizu S-Pulse", "response": [":* Mark Bowen"]}, {"page": "Olivier Tébily", "response": ["Returning fit at the start of the 2003–04 Premier League season, Tébily found himself no longer first choice, though his versatility made him the manager's preferred defensive substitute. For the next couple of years, he was used irregularly. Coach Mark Bowen cited a lack of confidence, and a long-standing problem with concentration, as leading to inconsistency of performance; though the player's own determination to combat the problem led him to encourage the coaching staff to keep shouting at him during the game to maintain his concentration levels. In addition, he underwent laser eye surgery to deal with the problems caused by wearing contact lenses for football. He sometimes struggled badly against quick, tricky players, but always gave of his best when given an opportunity."]}, {"page": "Anthony Barness", "response": ["Barness left Chelsea in August 1996, and returned to Charlton Athletic for a fee of £165,000. He was an important and regular part of the Charlton team, managed by Alan Curbishley. In his first season back at The Valley, he was a virtual ever present and a top performer in a Charlton side struggling after the sale of Lee Bowyer. Barness suddenly left the first team in 1997 being replaced by Mark Bowen at left back and occasionally Paul Konchesky, and only made a handful of appearances from then on many at right back. Although Mark Bowen was an excellent performer for Charlton in the 97/98 season, many Charlton fans were perplexed by Anthony's replacement as he'd been a very reliable player. Alan Curbishley was quoted at the time of dropping him, that he'd been virtually ever present the previous season and appeared close to burn out. Though the fans saw a minimal drop off in form, it retains a mystery why he fell out of favour with Alan Curbishley."]}]}}