{"wiki_id": "http://www.wikidata.org/entity/Q10977621", "itemLabel": "Phipps Hornby", "itemDescription": "English cricketer", "wikipedia_url": "https://en.wikipedia.org/wiki/Phipps_Hornby_(cricketer)", "wikipedia_page": {"main": "Captain Phipps John Hornby (24 April 1820 – 8 April 1848) was an English army officer and first-class cricketer.\nPhipps represented Hampshire county cricket teams in a single first-class cricket match in 1842 against Marylebone Cricket Club (MCC). He served with the Royal Engineers, where he gained the rank of captain. He died in April 1848 whilst serving at Montreal in Canada at the age of just 27.", "link_mentions": [{"page": "Phipps Hornby", "response": ["Admiral Sir Phipps Hornby,  (27 April 1785 – 19 March 1867) was a prominent and experienced Royal Navy officer of the nineteenth century. Hornby served on frigates throughout most of his wartime experience, which included witnessing the Nore Mutiny first hand aged 12 in 1797. Later, commanding his own sixth-rate  in 1811, Hornby played a vital role in the British victory at the Battle of Lissa. At Lissa a British squadron under William Hoste overwhelmed a French force more than twice their own strength, Volage combating a much larger ship alone for several minutes and taking numerous casualties, including Hornby, who was wounded.", " by his wife Lucy Smith-Stanley (d.1833) a daughter of James Smith-Stanley, Lord Strange (1716–1771), (son and heir apparent of Edward Stanley, 11th Earl of Derby (1689–1776) of Knowsley Hall in Lancashire) and a sister of Edward Smith-Stanley, 12th Earl of Derby (1752–1834). Phipps Hornby's sister Charlotte Margaret Hornby (d.1817) married their first cousin Edward Smith-Stanley, 13th Earl of Derby (1775–1851), KG, and was the mother of Edward Smith-Stanley, 14th Earl of Derby (1799–1869), thrice Prime Minister of the United Kingdom (1852, 1858–9, 1866–8), thus Phipps Hornby's nephew. His eldest brother was Edmund Hornby (1773–1857) of Dalton Hall near Burton, Westmorland, a Member of Parliament for Preston, Lancashire, from 1812 to 1826,Escott, Margaret, biography of \"Hornby, Edmund (1773–1857), of Dalton Hall, Westmld.\"", "published in: History of Parliament: House of Commons 1820–1832, ed. D.R. Fisher, 2009  who married his first cousin Lady Charlotte Stanley (d.1805), a daughter of Edward Smith-Stanley, 12th Earl of Derby. The close association between the Earls of Derby and the Hornby family would play a significant role in Phipps Hornby's career and politics."]}, {"page": "List of English cricketers (1841–1850)", "response": ["|Phipps Hornby"]}, {"page": "Hornby (surname)", "response": ["*Geoffrey Thomas Phipps Hornby (1825–1895), British admiral of the fleet", "*Phipps Hornby (1785–1867), British naval officer", "*Phipps Hornby (cricketer) (1820–1848), English cricketer"]}]}}