{"wiki_id": "http://www.wikidata.org/entity/Q1092801", "itemLabel": "Melanie South", "itemDescription": "British female tennis player", "wikipedia_url": "https://en.wikipedia.org/wiki/Melanie_South", "wikipedia_page": {"main": "Melanie Jayne South (born 3 May 1986) is a former English tennis player.\nShe won six singles and 24 doubles titles on the ITF Circuit. On 2 February 2009, she reached her best singles ranking of world No. 99. On 9 March 2009, she peaked at No. 120 in the doubles rankings.\nHer greatest success in a Grand Slam tournament came in the first round of the 2006 Wimbledon Championships when she came back from one set down to beat world No. 14, Francesca Schiavone, in a match witnessed by Martina Navratilova. At the time, South was ranked No. 305 in the world and had reached the main-draw courtesy of a wildcard. Not since the third round of the 1998 tournament, when Samantha Smith beat then-world No. 7, Conchita Martínez, had a British woman beaten an opponent of a similar ranking at Wimbledon. She lost in the second round to Shenay Perry, the world No. 62. Outside of Wimbledon, South reached the first round of the 2009 Australian Open without needing to qualify or receiving a wildcard. This was the first time in her career that her ranking was high enough to grant her access to a Grand Slam main draw without a wildcard. She lost to world No. 17 Marion Bartoli in round one.South announced her retirement from professional tennis on 2 December 2013 in order to focus on a coaching career.", "link_mentions": [{"page": "Melanie", "response": ["* Melanie South (born 1986), British tennis player"]}, {"page": "Kimiko Date", "response": ["She qualified for the $50k Kangaroo Cup in Gifu, Japan. In the first round, she played compatriot and world No. 183 Rika Fujiwara. In only her fourth match on the tour for eleven years, Date won in three sets. At the quarterfinal stage, Date came up against world No. 80 and fellow Japanese, Aiko Nakamura, whom she beat in three sets. This marked her first top-100 win of her comeback. In her semifinal match, she defeated No. 3 seed Melanie South. However, in the final, she was defeated by Tamarine Tanasugarn, in three sets. She won the doubles title at that tournament with teenage and fellow Japanese partner Kurumi Nara, defeating Melanie South and Nicole Thyssen in a match tie-breaker.", "|  Melanie South Nicole Thyssen", "|  Emma Laine   Melanie South"]}, {"page": "Alicia Molik", "response": ["Molik played in two Wimbledon warm up tournaments, reaching the second round in Birmingham, however, lost in the first round in Eastbourne to Melanie South 6–1, 3–6, 6–7. Molik was able to rebound, and easily won her first round match at Wimbledon, defeating Anastasia Rodionova 6–3, 6–2, before losing in the second round to Serena Williams 6–7, 3–6. Molik and Santangelo, the 6th seeds in the doubles tournament, made it to the semifinals before losing to eventual champions Cara Black and Liezel Huber. Also competing in the mixed doubles, Molik and partner Jonas Björkman made the final, before losing to Jelena Janković and Jamie Murray."]}, {"page": "Ai Sugiyama", "response": ["At Wimbledon, seeded 26th, she beat wildcard Melanie South and Alizé Cornet. She lost against the second seeded Sharapova in the third round. In doubles, she and Srebotnik beat Andreea Ehritt-Vanc and Anastasia Rodionova; Émilie Loit and Nicole Pratt, and got a walkover from Bartoli and Meilen Tu in the third round. In the quarterfinals, they beat Elena Likhovtseva and Sun Tiantian. They came back from 1–6, 0–3 to beat top-seeded Raymond and Stosur, winning in three sets. They lost in the final to the second seeded Black and Huber."]}, {"page": "2005 Wimbledon Championships", "response": ["#  Katie O'Brien /  Melanie South"]}, {"page": "Elena Baltacha", "response": ["For Baltacha, 2006 was a year much shortened by injury. Her first tournament of the year was the qualifying event for the Australian Open where she lost to Yuan Meng at the second stage of qualifying. In February she played one $25k ITF event (where she lost to Melanie South in the first round) and attempted to qualify for three consecutive Tier-II tournaments: Antwerp, Dubai (beaten in final round by Kateryna Bondarenko) and Qatar. This was then followed by two first round losses in $25k tournaments and a run to the semifinals of another. In May she again represented Great Britain in the Fed Cup and again won all three of her singles matches. She beat: Hungarian Kyra Nagy, Bulgaria's Dimana Krastevitch, and Valeria Bondarenko from Ukraine. In the Europe/Africa play-off however, she lost to Slovakia's Magdaléna Rybáriková. After the Fed Cup, Elena played only one more tournament in 2006. This tournament was the French Open where she lost in round one of qualifying to Yevgenia Savransky. She underwent keyhole surgery on a prolapsed disc on 7 June and spent the rest of the season out-of-action recovering and as a result, her season-ending ranking was world number 347.", "By the time Baltacha returned to action in March 2007 after surgery, her singles ranking had fallen to 660 in the world and as such, she had to qualify for her first $25k ITF tournament of the year in Las Palmas de Gran Canaria. She qualified before losing to Sorana Cîrstea in the first round. She then competed in two more $25k events in March (reaching the quarterfinals of one) before heading to Bulgaria to compete in the Fed Cup for Britain. She played two singles matches (winning one) and four doubles matches (winning two). Following this, she reached two consecutive $25k semifinals in Incheon and Gimcheon, one as a qualifier and the other as a lucky loser. She consolidated these results with a run to the quarterfinals of another $25k in Changwon. In June she received a wild card into the main draw of the DFS Classic where she showed \"fighting spirit\" in her first round loss to Milagros Sequera. She then received a wild card into the qualifying draw for the Hastings Direct International and proved she deserved it by dropping only nine games in the three matches she won to qualify. She then went on to beat the British number one, Anne Keothavong, in round one of the main draw in a tense three set match and join fellow Britains, Melanie South and Katie O'Brien in the second round, making this the first year since 1991 that three British women reached the second round. She could not quite match up to world number 14, Nicole Vaidišová, in the second round though and was beaten in straight sets. She then received another wild card into the main draw of Wimbledon but wasn't able to overcome the 19th seed, Katarina Srebotnik.", "Baltacha began her 2008 season by qualifying for the ASB Classic, beating compatriot, Melanie South, along the way. She faced two-time ASB Classic champion and number 7 seed, Eleni Daniilidou, in the opening round and was beaten. She then progressed to round two of the qualifying tournament for the Australian Open when her first round opponent, Virginie Pichet, retired when down one set. She was beaten in the second round of qualifying by Zhang Shuai. In February, she tried to qualify for Doha (Tier I) and Dubai (Tier II) but was unsuccessful in both. She then returned to action on the ITF circuit and won her next two consecutive tournaments: Jersey ($25k) and Torhout ($75k). In May, she again lost in the first round of the qualifying tournament for the French Open and in June she again received a wild card into the main draw of the DFS Classic where she was beaten in round one by Ekaterina Makarova. Another wild card granted her entry into the qualifying rounds of the International Women's Open where she won her first match against Naomi Cavaday before retiring at one set down in her second match against Tsvetana Pironkova. She then played in the main draw of Wimbledon (again courtesy of a wild card) where she beat Angelique Kerber in the first round. She was defeated in the second round by eventual semifinalist Zheng Jie in straight sets.", "Baltacha began 2009 by falling in the first round of qualifying for the ASB Classic before winning three matches to qualify for the Australian Open. She joined compatriots Katie O'Brien (also a qualifier), Anne Keothavong and Melanie South in the main draw; the first time that four British women had competed in the main draw of a Grand Slam other than Wimbledon since the 1992 U.S. Open. Baltacha came up against German, Anna-Lena Grönefeld, in the first round and defeated her comfortably to set up a clash with former world number one, Amélie Mauresmo. Despite surprising many by taking the first set, Baltacha eventually lost in three sets.", "| Doubles (with Melanie South)", "| Doubles (with Melanie South)"]}, {"page": "Marion Bartoli", "response": ["Seeded sixth at the Stanford Classic, Bartoli defeated Akgul Amanmuradova, Anne Keothavong, defending champion Anna Chakvetadze, and Ai Sugiyama, to move into her first final since Wimbledon in 2007. In the final, Bartoli lost to the Canadian qualifier Aleksandra Wozniak. In Montreal, she beat Melanie South, Anna Chakvetadze and Ai Sugiyama to reach the semifinals, where she was defeated by Dominika Cibulková. At the US Open, Bartoli was seeded 12th and beat Galina Voskoboeva, Virginia Ruano Pascual and former champion and 23rd seed Lindsay Davenport to reach the fourth round, where she lost to 29th-seeded Sybille Bammer.", "Seeded 16th at the Australian Open, Bartoli defeated Melanie South, Tsvetana Pironkova, Lucie Šafářová and top seed Jelena Janković to reach the quarterfinals, where she lost to seventh seed Vera Zvonareva. Bartoli won her fourth career title at the Monterrey Open. Seeded second, she beat Michaëlla Krajicek, Magdaléna Rybáriková, Vania King, and Zheng Jie to reach the final, where she defeated unseeded Li Na."]}, {"page": "Elke Clijsters", "response": ["|  Melanie South"]}, {"page": "Sofia Arvidsson", "response": ["|  Melanie South   Caroline Maes"]}, {"page": "Emma Laine", "response": ["|  Melanie South", "|  Melanie South", "|  Melanie South", "|  Melanie South", "|  Melanie South", "|  Melanie South", "|  Melanie South", "|  Melanie South"]}, {"page": "Maret Ani", "response": ["|  Jarmila Gajdošová   Melanie South"]}, {"page": "Margit Rüütel", "response": ["|  Karen Paterson   Melanie South"]}, {"page": "Jarmila Wolfe", "response": ["|  Melanie South", "|  Melanie South", "|  Tímea Babos   Melanie South", "|  Tímea Babos   Melanie South"]}, {"page": "Sun Shengnan", "response": ["|  Emma Laine   Melanie South", "|  Ksenia Lykina   Melanie South"]}, {"page": "Anna Fitzpatrick", "response": ["In April 2008, Fitzpatrick reached her first ITF quarterfinal of the year in Toluca, a $10k tournament. Just two weeks later she reached her second of the year, this one in Irapuato $25k. In June, the first of four consecutive wildcards allowed her direct entry into the main draw of the $50k event in Surbiton where she lost to Georgie Stoop in round one. Her second wild card of June entered her into the main draw of the DFS Classic, a Tier III tournament. She was beaten by Melanie South, 4–6, 4–6, in round one. Wild card number three allowed her access into the qualifying draw of the International Women's Open where world No. 62, Ekaterina Makarova, beat her in straight sets, 6–7(4), 3–6. Her fourth of four consecutive wild cards gave her entry into the qualifying draw of Wimbledon where she was beaten by Yuliana Fedak from Ukraine. In early August, Fitzpatrick injured her foot while playing in an ITF in Portugal. The injury turned out to be a stress fracture in her left foot and it put her out of action for the rest of the season and as a result, she ended the season ranked world No. 424.", "|  Melanie South   Lenka Wienerová", "|  Anna Smith   Melanie South"]}, {"page": "2006 Wimbledon Championships", "response": ["#  Francesca Schiavone (First round, lost to Melanie South)", "#  Melanie South", "#  Katie O'Brien /  Melanie South"]}, {"page": "2007 Wimbledon Championships", "response": ["#  Melanie South", "#  Karen Paterson /  Melanie South", "#  Alex Bogdanovic /  Melanie South"]}, {"page": "Mervana Jugić-Salkić", "response": ["|  Melanie South"]}, {"page": "Arantxa Parra Santonja", "response": ["|  Melanie South"]}, {"page": "2008 Wimbledon Championships", "response": ["| Melanie South (WC)", "#  Melanie South", "#  Anne Keothavong /  Melanie South", "#  Alex Bogdanovic /  Melanie South"]}, {"page": "Trudi Musgrave", "response": ["|  Surina De Beer   Melanie South"]}, {"page": "Caroline Maes", "response": ["|  Melanie South"]}, {"page": "Nonsuch High School for Girls", "response": ["* Melanie South, tennis player This is Local London article from 28 June 2007 accessed 6 August 2007"]}, {"page": "Anne Keothavong", "response": ["Keothavong recovered well from her injury and returned to action ahead of schedule in March at the $10k tournament in Sunderland where she suffered a three-set first-round defeat by Verdiana Verardi. She then immediately reached three successive $10k finals; the first in Bolton and the second two in Bath. She won the first two by beating Veronika Chvojková and Claire Peterzan respectively and lost the third to compatriot, Melanie South. The first of the two tournaments in Bath was also the only time Keothavong competed with her sister Lena in doubles on the ITF Circuit. They reached the quarterfinals together. In late April, Keothavong competed in the Fed Cup and helped Britain avoid relegation from the Africa/Europe Zone Group I by beating Caroline Wozniacki to help Britain beat Denmark. This meant that although they lost ties against Serbia and Montenegro and Slovenia, they avoided a place in the relegation play-offs for another year. In May, she reached the semifinals of a $25k event in Monzón where she lost to Angelique Kerber. She was then given a wildcard into the main draw of the DFS Classic where she lost to Laura Granville in the first round. This was followed by a wild card into the Hastings Direct International qualifying tournament where Arantxa Parra Santonja defeated her in the first round. After this, another wildcard allowed Keothavong entry into the main draw of the Wimbledon Championships where she faced Mariana Díaz Oliva in the first round and lost in straight sets.", "Keothavong started her 2006 season by losing in the first round of qualifying for the Brisbane International (Tier III), the final round of qualifying for the Hobart International and the second round of qualifying for the Australian Open. In February, Keothavong returned to Britain and reached the final of the ITF tournament in Jersey where she beat Ana Vrljić to win the title. She then entered the $25k tournament in Sunderland where she beat four compatriots; Melanie South, Rebecca Llewellyn, Sarah Coles and Katie O'Brien in straight sets to reach the final where she was beaten by Elise Tamaëla. Later in February, Keothavong reached the quarterfinals of an ITF tournament in Orange, California ($25k) and one month later, in March, she reached another ITF final, again $25k. In April, she reached the semifinals of the $25k event in Patras and competed for Great Britain in the Fed Cup where she won one of her three singles rubbers. She qualified for the Internationaux de Strasbourg, a Tier-III tournament, where she lost to Anna Smashnova in the first round.", "Keothavong's 2008 campaign began when Keothavong failed to qualify for the Tier-II tournament, the Medibank International. She then attempted to qualify for the Australian Open and won her first match against Jorgelina Cravero before losing her second to Monica Niculescu. February saw her join compatriots, Melanie South, Katie O'Brien and Elena Baltacha, to represent Britain in the Fed Cup. Despite Keothavong winning each of her three singles matches in the round robin stage, Britain was forced to fight relegation from the Europe/Africa Group I by playing Portugal. They won 2–0 thanks to yet another victory in singles from Keothavong and a singles victory from O'Brien. For the remainder of February, Keothavong competed on the ITF circuit and reached the quarterfinals of a $25k event in Stockholm and won a $25k title in Capriolo. In early April, she lost in the final of a $50k tournament; this one in Patras where Magdaléna Rybáriková defeated her in straight sets. Continuing competition on the ITF Circuit, she won a $50k tournament in Jounieh, Lebanon (despite break outs of fighting between Shia and Hezbollah militia less than ten miles away in Beirut). This tournament win propelled Keothavong into the top 100 for the first time in her career and guaranteed her a place in the main draw of Wimbledon for the first time in her career; the first time a British woman had entered Wimbledon on merit since 1999. She then fell in the first round of qualifying for the French Open before reaching another $50k final (in Surbiton)."]}, {"page": "Marina Erakovic", "response": ["| Melanie South"]}, {"page": "Michelle Larcher de Brito", "response": ["On 22 May 2009, de Brito qualified for her first Grand Slam tournament main draw at the French Open after winning the final round of the qualifying by beating world No. 152, Kristína Kučová, world No. 177, Yuliana Fedak, and world No. 151, Ekaterina Ivanova. She became the first Portuguese female player ever to do so. After overcoming Melanie South in the first round, Larcher de Brito once again made history by becoming the first Portuguese player overall to qualify for the third round of a Grand Slam by beating world No. 15 Zheng Jie. She would lose to home player Aravane Rezaï, a game in which her opponent made a number of complaints about the amount of noise coming from the Portuguese.Rezai rises above shrieks of Larcher de Brito The Independent, 30 May 2009 With her third round result, she entered the top 100 for the first time, a ranking of world No. 90."]}, {"page": "Tatjana Maria", "response": ["|  Julie Coin   Melanie South"]}, {"page": "Danica Krstajić", "response": ["|  Sorana Cîrstea   Melanie South"]}, {"page": "Naomi Cavaday", "response": ["|  Karen Paterson   Melanie South"]}, {"page": "Katie O'Brien", "response": ["In addition to her singles success as a junior, she also won one doubles title, lost in the final of another, reached four doubles semifinals and seven doubles quarterfinals (one of which in the 2004 Wimbledon Championships, partnering compatriot Melanie South). She reached her career–high doubles ranking of world No. 201 on 3 February 2003, and ended her junior career with a win–loss record of 17–26.", "O'Brien's first tournament of the season was the Australian Open where she entered qualifying as the No. 15 seed. After being gifted an easy first round victory over Darya Kustova when Kustova had to retire with the score at 6–3, 1–0 in O'Brien's favour, O'Brien was forced to fight hard in her second qualifying match against Yanina Wickmayer. She eventually won, 4–6, 6–3, 8–6, to set up a final round qualifying match against the No. 11 seed in the qualifying tournament, Yuan Meng. O'Brien was defeated 6–4, 6–2. In early February, she competed as part of the Great Britain Fed Cup team in the Fed Cup and was given tough opponents. She challenged Patty Schnyder but eventually lost, 6–7, 5–7, and also lost to Ágnes Szávay and Caroline Wozniacki. However, she and Anne Keothavong managed to save Britain from relegation from the Europe/Africa Group I by winning two singles matches against Portugal. This was followed by O'Brien's first appearance on the ITF circuit in 2008 which came at the $75k event in Midland where she was the No. 5 seed. She faced the No. 2 seed, Laura Granville, in the quarterfinals and was beaten, 1–6, 6–3, 6–1. O'Brien then attempted to qualify for four consecutive WTA events, in Doha, Dubai, Bangalore and Indian Wells. She lost in round one of qualifying in each of them with the exception of Indian Wells where she lost in the round two of qualifying to Barbora Záhlavová-Strýcová. Over March and April she reached the quarterfinals of two ITF tournaments: Jersey ($25k) and Saint-Malo ($100k). In May, O'Brien entered the French Open qualifying draw and beat fellow Brit, Melanie South in the opening round. She fell in round two to Kristina Barrois, 4–6, 2–6, and then headed to the DFS Classic where she beat Alla Kudryavtseva in the first round before falling to Yaroslava Shvedova in round two. A wildcard allowed O'Brien entry into the International Women's Open (previously the Hastings Direct International) where she lost to Samantha Stosur. Shahar Pe'er beat O'Brien in the first round of Wimbledon.", "O'Brien started her 2009 season by attempting to qualify for the ASB Classic in Auckland, New Zealand. She came up against the No. 2 seed in the qualifying tournament, Ayumi Morita, and lost in three sets, 6–3, 2–6, 7–5. Her next tournament was the qualifying event for the first Grand Slam of the year, the Australian Open. She beat Sandra Záhlavová, Julie Ditty and Betina Jozami to gain entry into the main draw for the first time in her career. She faced Monica Niculescu in round one but lost, 4–6, 4–6. Nevertheless, the 2009 Australian Open marked the first time since the 1992 US Open that four British women had competed in the main draw of a Grand Slam other than Wimbledon. O'Brien's three compatriots were Anne Keothavong, Melanie South and fellow qualifier, Elena Baltacha. Following the Australian Open, O'Brien returned to ITF action as the No. 3 seed at the $25k event in Sutton. She won four matches in straight sets before defeating wildcard Johanna Konta, 3–6, 6–2, 6–4, in the final to win her first title since September 2006 and the third ITF singles title of her career. Between this and the French Open she reached the semifinals of ITF tournaments in Midland ($75k), Biberach ($50k) and Johannesburg ($100k) as well as reaching the quarterfinals of a $100k+H event in Torhout. She also won a $25k in Jersey and was the runner-up in another $25k event, this one in Minsk. In May she reached the final round of qualifying for the French Open before losing to Arantxa Rus, 4–6, 6–7, however she gained entry to the main draw as a lucky loser when No. 6 seed Vera Zvonareva withdrew from the tournament due to injury. O'Brien lost to Olga Govortsova 1–6, 1–6, in the first round.", "O'Brien began her grass court season as the No.5 seed in a $50k in Nottingham but she was beaten in the second round by Naomi Cavaday, 6–2, 6–3. She was then given a wildcard into the main draw of the Aegon Classic where she was drawn to face fellow British wild card, Melanie South. O'Brien eventually lost in three sets, 6–4, 1–6, 7–6. Immediately following this she went on to fall in the second round of qualifying for the Aegon International to the world No. 46, Ekaterina Makarova, 4–6, 2–6. Another wildcard then granted O'Brien entry to the main draw of Wimbledon where she lost, 2–6, 7–5, 4–6, in round one to world No. 35, Iveta Benešová. After Wimbledon, a number of first and second round defeats followed before O'Brien reached the final of another $25k in July. She was beaten in the final by fellow Brit Georgie Stoop. In August, O'Brien was the No. 3 seed in the qualifying tournament for the US Open but she was stopped in round two of qualifying by lower-ranked Anna Tatishvili. In late September, she reached the final of a $75k in Shrewsbury as the sixth seed where she came up against fellow Brit and fifth seed Elena Baltacha. O'Brien lost in three sets, 3–6, 6–4, 3–6, but this result was enough to move both finalists into the top 100 for the first time in their careers. Over the course of her final few tournaments of the year, O'Brien reached another $100k semifinal as well as the second round of the HP Open where she was swept aside 6–0, 6–1 by top seed Caroline Wozniacki. She finished the year inside the top 100 with a ranking of world No. 90.", "|  Melanie South", "|  Melanie South", "|     Melanie South"]}, {"page": "2008 WTA Tour", "response": ["|rowspan=4| 9 Jun || rowspan=2 style=\"background:#d4f1c5;\"| DFS Classic Birmingham, Great BritainTier III event$200,000 - Grass - 56S/32Q/16DSingles - Doubles || Kateryna Bondarenko7–6(9–7), 3–6, 7–6(7–4) ||  Yanina Wickmayer ||rowspan=2| Marina Erakovic Bethanie Mattek ||rowspan=2| Petra Cetkovská Alona Bondarenko  Melanie South Nicole Vaidišová"]}, {"page": "Petra Cetkovská", "response": ["|  Arantxa Parra Santonja   Melanie South"]}, {"page": "Julie Ditty", "response": ["|  Mervana Jugić-Salkić Melanie South"]}, {"page": "Klaudia Jans-Ignacik", "response": ["|  Rebecca Llewellyn   Melanie South"]}, {"page": "Andrea Sestini Hlaváčková", "response": ["|  Katie O'Brien   Melanie South", "|  Arantxa Parra Santonja   Melanie South", "|  Marina Erakovic   Melanie South"]}, {"page": "Natalie Grandin", "response": ["|  Melanie South"]}, {"page": "Alicja Rosolska", "response": ["|  Rebecca Llewellyn   Melanie South"]}, {"page": "Monique Adamczak", "response": ["|  Melanie South", "|  Melanie South"]}, {"page": "Christina Wheeler", "response": ["|  Melanie South "]}]}}