{"wiki_id": "http://www.wikidata.org/entity/Q1095291", "itemLabel": "Clare Colvin", "itemDescription": "British journalist", "wikipedia_url": "https://en.wikipedia.org/wiki/Clare_Colvin", "wikipedia_page": {"main": "Clare Colvin is a journalist and writer. She is the opera critic for the Sunday Express, and a book reviewer for the Daily Mail. Her father is Ian Colvin.", "link_mentions": [{"page": "Alice Thomas Ellis", "response": ["In 1968, Haycraft and a partner bought Gerald Duckworth and Company, a publishing house in London. Ellis became its fiction editor. Her most famous client was Beryl Bainbridge, who worked with Ellis for many years. The author Clare Colvin, in Ellis's obituary in The Guardian, described her skills as an editor:She combined a novelist's imagination with an editor's forensic skills, getting immediately to the heart of the problem, with an observation such as, \"Lovely characters, darling, but where's the plot?\"Thomas-Ellis' first novel, The Sin Eater (1977) appeared under the pseudonym Alice Thomas Ellis, which she used in all her later writing. Probably her best-known novel, Unexplained Laughter (1985), was adapted for UK television, as was her Summerhouse Trilogy. Her novel The 27th Kingdom (1982) was shortlisted for the Booker Prize. In a New York Times article, Margalit Fox described her work:Shot through with melancholy, Ms. Ellis's novels focus on the small savageries, deep discontents and abiding grief of women's lives. Yet they are also mordantly funny sendups of bourgeois manners. Sometimes, as in the work of Shirley Jackson, the gothic overlays the domestic, to unsettling effect. Many of Ms. Ellis's characters are repellent, and they are meant to be. Ellis's cookery books include All-natural Baby Food (Fontana/Collins, 1977) and Darling, you shouldn't have gone to so much trouble, co-written with Caroline Blackwood. Blackwood and her poet husband, Robert Lowell, were frequent visitors to the Haycraft home. ", "*Alice Thomas Ellis: obituary by Clare Colvin at The Guardian, 10 March 2005"]}, {"page": "Colvin (surname)", "response": ["* Clare Colvin, British writer, daughter of Ian Colvin"]}, {"page": "Clare (given name)", "response": ["* Clare Colvin, British writer"]}]}}