{"wiki_id": "http://www.wikidata.org/entity/Q10967535", "itemLabel": "Noel Thompson", "itemDescription": "British journalist", "wikipedia_url": "https://en.wikipedia.org/wiki/Noel_Thompson", "wikipedia_page": {"main": "Noel Thompson is a Northern Irish news journalist with BBC Northern Ireland. He was part of the presenting team for BBC Radio Ulster's flagship morning programme Good Morning Ulster.", "link_mentions": [{"page": "BBC Northern Ireland", "response": ["* Noel Thompson"]}, {"page": "St Catharine's College, Cambridge", "response": ["|Noel Thompson"]}, {"page": "BBC Newsline", "response": ["The current Newsline brand was introduced on 12 February 1996 when the main evening programme returned to a 6.30pm timeslot.  Although Noel ThompsonBelfast Telegraph: \"Present twists on Newsline's presentation\", dated 6 May 1996; accessed 17 June 2008Belfast Telegraph: \"Beeb's Noel wins hearts and minds of Breakfast bosses\"; dated 10 August 1998; accessed 17 June 2008 and Lynda Bryans were the original choice of presenters, Thompson was later dropped causing Bryans to resign and move to UTV. The programme's first presenters were political editor Jim Dougal and reporter Yvette Shapiro. Dougal was replaced as anchor by Conor Bradford after two months.Belfast Telegraph: \"TV faces flock to Kincora book launch\", dated 23 April 1996; accessed 17 June 2008", "Noel Thompson and Donna Traynor became the programme's main anchors until August 2012, when Thompson left to join BBC Radio Ulster. Newsline is now presented by a single main anchorBelfast Newsletter: \"All Change on BBC Newsline\"; dated 27 August 2012; accessed 28 August 2012"]}, {"page": "List of University of Cambridge people", "response": ["*Noel Thompson (St Catharine's)"]}, {"page": "Campbell College", "response": ["*Noel Thompson, BBC journalist"]}, {"page": "Breakfast News", "response": ["*Noel Thompson"]}, {"page": "BBC Breakfast", "response": ["* Noel Thompson (2000–2009)"]}, {"page": "Good Morning Ulster", "response": ["In November 2019 Noel Thompson and Karen Patterson both announced they would be stepping down from Good Morning Ulster, effective from January 2020.", "*Noel Thompson"]}, {"page": "2000 Today", "response": ["** Noel Thompson"]}, {"page": "Category talk:British journalists", "response": ["Noel Thompsonnot yet classified"]}, {"page": "Hearts and Minds (1996 TV programme)", "response": ["Hearts and Minds is a British political and current affairs television programme presented by Noel Thompson that was broadcast on BBC Northern Ireland. The programme was normally broadcast on Thursday nights at 19:30 on BBC Two and 23:35 on BBC One, and on Sunday afternoons on BBC Parliament.Hearts and Minds BBC Two, 21 June 2012 The programme featured the main Northern Irish politicians discussing the biggest event in local politics of that week. The show was broadcast from 1996 to 2012.", "An occasional section in the middle of Hearts and Minds called \"If You Ask Me...\" featured a journalist or commentator  giving their opinion on certain events that happened in the week illustrated by the cartoons of Ian Knox. Among those to have participated were Malachi O'Doherty Fionnuala O'Connor, Liam Clarke, Alex Kane, Newton Emerson, Lindsay Allen and Fionola Meredith. At the end of the show there was a comedy sketch featuring Tim McGarry, best known for playing Da in Give My Head Peace, as a Belfast black taxi driver picking up Noel Thompson from the BBC's Broadcasting House in Belfast. In this sketch, McGarry provided a comedic monologue discussing the weekly events.", "Hearts and Minds was axed by BBC Northern Ireland at the end of June 2012BBC's flagship politics show Hearts and Minds gets axe Belfast Telegraph, 7 June 2012 after years of speculation it would end.BBC’s Noel Thompson axed from TV screens Belfast Telegraph, 12 March 2012 ", "The final episode aired on 21 June 2012 with Noel Thompson chairing the show as usual and also played the original titles at the start. The show featured a look back at the past 16 years and featured a panel with all political parties except Sinn Féin as they pulled out at the last minute. The last show featured Malachi O'Doherty in the \"If You Ask Me...\" section looking back at the show and events at the time with the usual cartoon drawings of all political figures. The final episode showed all big moments such as interviews with leaders and the first time the UUP and Sinn Féin appeared in a studio together and all the bust ups between Noel Thompson and various political figures. The show ended as always with Tim McGarry's taxi journey and ended with Noel saying thanks for watching and goodbye before a final caption saying \"That's All Folks!\" "]}, {"page": "Paddy O'Flaherty", "response": ["O'Flaherty died on 27 September 2016; his death was announced by Noel Thompson on Good Morning Ulster. Speaking after his death was announced, Peter Johnston, the Controller of BBC Northern Ireland, said that \"We were all deeply saddened to hear of the death of Paddy, who for many years was a well-known face and voice across our airwaves and television screens\" and that \"Paddy was for many years a well-known face and voice across our airwaves and television screens.\" Northern Ireland First Minister Arlene Foster said that she was \"really sorry to hear about Paddy's death. Such a gentle person\", whilst deputy First Minister Martin McGuinness said that O'Flaherty was \"a wonderful broadcaster, fiddler and like myself, a fly fisherman\". Séamus Dooley from the National Union of Journalists said that O'Flaherty was \"the embodiment of all that is best in public service broadcasting\". He was remembered at the 2016 Phonographic Performance Ireland Radio Awards along with Terry Wogan. His funeral was held at St Gerard's Church in Belfast, and was attended by 300 people. O'Flaherty's wife Brenda died in 2003, and he is survived by his two children."]}]}}