{"wiki_id": "http://www.wikidata.org/entity/Q1097308", "itemLabel": "Bobby Hassell", "itemDescription": "English footballer (born 1980)", "wikipedia_url": "https://en.wikipedia.org/wiki/Bobby_Hassell", "wikipedia_page": {"main": "Robert John Francis Hassell (born 4 June 1980) is an English former footballer who played for Mansfield Town, Barnsley FC and Bharat FC in I-League as a defender. He is now Academy Manager at Barnsley FC.", "link_mentions": [{"page": "Barnsley F.C.", "response": ["*Academy Manager: Bobby Hassell", "|2009|| Bobby Hassell"]}, {"page": "Sam Togwell", "response": ["His tenure at Palace did not last much longer, however, as he left for Barnsley in July 2006 for an undisclosed fee. Togwell made his League debut for Barnsley on 5 August 2006, in a 2–1 defeat at Cardiff City. He made 46 appearances in 2006–07, including both Championship clashes with former club Palace, both of which finished 2–0 for the home team. Battling with Bobby Hassell and new signing Anderson Silva de França for a first team place, he found life tough at Oakwell the next season. In all he played 27 games, three of which came in the club's impressive FA Cup run, including a substitute appearance in the memorable victory over Premier League team Chelsea."]}, {"page": "Martin Cranie", "response": ["Seven days later, Cranie made his debut appearance with the Tykes as a substitute for Bobby Hassell in the 3–1 defeat at Wolves. Eleven days later on 1 September 2012, Cranie provided an assist for Jacob Mellis, who scored the only goal in a 1–0 win over Bristol City. Three weeks later on 22 September 2012, Cranie provided another assist for Craig Davies, in a 5–0 win over Birmingham City. However, Cranie suffered injuries during the season, one of which sidelined him throughout October, then was sidelined throughout December and sidelined for a third time due to hamstring strain in early-April. In his first season at Barnsley, Cranie made thirty-six appearances for the club. Cranie was awarded the club's Players' Player of the Year award in April 2013. With his contract expiring at the end of the 2012–13 season, Cranie agreed to sign a new 2-year contract with the club."]}, {"page": "Rob Atkinson", "response": ["Born in North Ferriby, East Riding of Yorkshire, Atkinson has come through the youth ranks with Barnsley, making his debut on 6 March 2004. In the 2005–06 season he had a six-month loan spell with Scarborough playing 22 league games. He was also loaned out to Halifax Town during the 2006–07 season. After some impressive performances, Atkinson was recalled to Barnsley following injuries to first team players Bobby Hassell, Paul Reid and Antony Kay. Atkinson played his first full game for the Oakwell based club on Boxing Day 2006, in a 1–0 win over Burnley. In this game, Atkinson's performance earned him the man of the match award."]}, {"page": "Bill Dearden", "response": ["Dearden returned to Mansfield Town later in 1999, and was appointed the club's new full-time manager following Steve Parkin's departure. During his three-year stay as Mansfield manager, he brought up several talented youngsters from the youth team, including Liam Lawrence, Bobby Hassell and Lee Williamson, and signed key players such as Chris Greenacre and Wayne Corden, guiding the \"Stags\" to the verge of promotion. However, he left the club midway through the 2001–02 promotion season to take control of local rivals Notts County. Stuart Watkiss took over from Dearden, and took Mansfield out of the Third Division at the end of the season."]}]}}