{"wiki_id": "http://www.wikidata.org/entity/Q10977292", "itemLabel": "Bert Hunt", "itemDescription": "English cricketer (1911-1985)", "wikipedia_url": "https://en.wikipedia.org/wiki/Bert_Hunt", "wikipedia_page": {"main": "Hubert (Bert) Hunt, born at Long Ashton, Somerset, on 18 November 1911, and died at Pill, Somerset on 29 November 1985, played in 11 first-class cricket matches for Somerset in the 1936 season.\nThe brother of George Hunt who played 233 matches for Somerset as a professional between 1921 and 1931, Bert Hunt was a lower-order right-handed batsman and a right-arm off-spin bowler. He played fairly regularly for two months from the end of May to the end of July 1936 as the second spin bowler (after Horace Hazell) in the Somerset side, but in that period he bowled fewer than 100 first-class overs. But he had his moments. Against Derbyshire at Ilkeston, he took seven for 49 in the first innings and was then not called upon to bowl at all in the second innings as Somerset beat the 1936 County Champions by an innings. A week later, he was among the Somerset batsmen who hit Hedley Verity of Yorkshire and England for 89 runs from nine overs, contributing two sixes in an innings of 22 that was surpassed by Hazell, who hit Verity for four sixes in a single over. But at the end of the season, he left the Somerset staff and he never played first-class cricket again.\nDavid Foot, the historian of Somerset cricket, wrote of Hunt that he had \"a healthy cynicism about the life of an expendable professional cricketer\" and that he \"preferred to stick to his weekend matches for his village team, Lodway\". Foot added: \"His pals in the parish used to say of him: 'He had the most perfect temperament we ever came across – the bowler who never complained. We could put down five catches off him, as we did more than once, and he merely smiled'.\"\nAfter leaving first-class cricket, Hunt played Minor Counties cricket for Cornwall in 1939 and 1948, when he took 23 wickets at an average of 17 apiece. He was an umpire in Minor Counties matches in 1950.", "link_mentions": [{"page": "List of Somerset County Cricket Club players", "response": ["* Bert Hunt (1936) 11 matches CA"]}, {"page": "Hubert Hunt (cricketer)", "response": ["#REDIRECT Bert Hunt"]}]}}