{"wiki_id": "http://www.wikidata.org/entity/Q10988949", "itemLabel": "Simon Ecclestone", "itemDescription": "English cricketer (born 1971)", "wikipedia_url": "https://en.wikipedia.org/wiki/Simon_Ecclestone", "wikipedia_page": {"main": "Simon Charles Ecclestone (born 16 July 1971) played first-class and List A cricket for Oxford University and Somerset between 1994 and 1998. He also appeared in 1992 in List A cricket for Cambridgeshire. He was born at Great Dunmow, Essex.\nEducated at Bryanston School and at Durham University, Ecclestone was a hard-hitting left-handed middle-order batsman and a right-arm medium pace bowler. From 1990 to 1993 he played Minor Counties cricket for Cambridgeshire, for whom his brother Giles also played and in 1992 he appeared in one List A match, a NatWest Trophy match against Northamptonshire.In 1994, he was at Oxford University and in addition to appearing in first-class matches for the university side, he also played in one List A match for the Combined Universities cricket team. He won a blue by appearing in the annual University Match against Cambridge University. After the university cricket season was over, he appeared in a handful of List A and first-class matches for Somerset. In 1995, he appeared irregularly in Somerset's first team in both County Championship and one-day matches, but in 1996, he became a regular in List A games and made two centuries in them. In a Benson and Hedges Cup match against Middlesex he made an unbeaten 112 and put on 188 for the second wicket with Mark Lathwell. Little over a week later he made 130 in a 40-over Sunday League game against Surrey, this time putting on 183 for the second wicket with Peter Bowler and hitting 11 fours and 5 sixes.In 1997, Ecclestone played first-class matches more regularly for Somerset and also deputised as captain when Bowler was injured. He himself suffered a knee injury in the match against Kent when he was captaining the side, but he returned after retiring hurt in the first innings and made 123, his only County Championship century, and followed that with 94 in the second innings. Earlier in the same season he had made 133, his highest first-class score, in the match against Oxford University. He also scored 102 not out against the Pakistan A side that toured England playing first-class matches in 1997. In the season as a whole, he made 951 first-class runs at an average of 45.28 and was awarded his Somerset county cap. The journalist David Foot, writing in Wisden Cricketers' Almanack, suggested that Ecclestone had \"a future in captaincy\".But that did not happen. In 1998, Ecclestone's knee injury got worse and restricted him to just five first-class games and five List A matches. He was forced to retire from cricket at the end of the season.\nSince retirement, Ecclestone has appeared in occasional minor matches and in 2002 he toured Malaysia and Singapore as a member of a Marylebone Cricket Club (MCC) side.", "link_mentions": [{"page": "List of Somerset County Cricket Club players", "response": ["* Simon Ecclestone (1994–1998) 36 matches CA"]}, {"page": "List of Somerset County Cricket Club seasons", "response": ["|align=left|Simon Ecclestone"]}, {"page": "List of Cambridgeshire County Cricket Club List A players", "response": ["*Simon Ecclestone, 1 match, 1992 "]}, {"page": "Ecclestone (surname)", "response": ["*Simon Ecclestone (born 1971), English cricketer"]}]}}