{"wiki_id": "http://www.wikidata.org/entity/Q1096957", "itemLabel": "Claude Maxwell MacDonald", "itemDescription": "British diplomat (1852-1915)", "wikipedia_url": "https://en.wikipedia.org/wiki/Claude_Maxwell_MacDonald", "wikipedia_page": {"main": "Colonel Sir Claude Maxwell MacDonald,  (12 June 1852 – 10 September 1915) was a British soldier and diplomat, best known for his service in China and Japan.", "link_mentions": [{"page": "Boxer Rebellion", "response": ["In January 1900, with a majority of conservatives in the imperial court, Empress Dowager Cixi changed her position on the Boxers, and issued edicts in their defence, causing protests from foreign powers. In spring 1900, the Boxer movement spread rapidly north from Shandong into the countryside near Beijing. Boxers burned Christian churches, killed Chinese Christians and intimidated Chinese officials who stood in their way. American Minister Edwin H. Conger cabled Washington, \"the whole country is swarming with hungry, discontented, hopeless idlers.\" On 30 May the diplomats, led by British Minister Claude Maxwell MacDonald, requested that foreign soldiers come to Beijing to defend the legations. The Chinese government reluctantly acquiesced, and the next day a multinational force of 435 navy troops from eight countries debarked from warships and travelled by train from Dagu (Taku) to Beijing. They set up defensive perimeters around their respective missions.", "The legations of the United Kingdom, France, Germany, Italy, Austria-Hungary, Spain, Belgium, the Netherlands, the United States, Russia and Japan were located in the Beijing Legation Quarter south of the Forbidden City. The Chinese army and Boxer irregulars besieged the Legation Quarter from 20 June to 14 August 1900. A total of 473 foreign civilians, 409 soldiers, marines and sailors from eight countries, and about 3,000 Chinese Christians took refuge there. Under the command of the British minister to China, Claude Maxwell MacDonald, the legation staff and military guards defended the compound with small arms, three machine guns, and one old muzzle-loaded cannon, which was nicknamed the International Gun because the barrel was British, the carriage Italian, the shells Russian and the crew American. Chinese Christians in the legations led the foreigners to the cannon and it proved important in the defence. Also under siege in Beijing was the Northern Cathedral (Beitang) of the Catholic Church. The Beitang was defended by 43 French and Italian soldiers, 33 Catholic foreign priests and nuns, and about 3,200 Chinese Catholics. The defenders suffered heavy casualties especially from lack of food and mines which the Chinese exploded in tunnels dug beneath the compound. The number of Chinese soldiers and Boxers besieging the Legation Quarter and the Beitang is unknown.", "One newspaper called the aftermath of the siege a \"carnival of ancient loot\", and others called it \"an orgy of looting\" by soldiers, civilians and missionaries. These characterisations called to mind the sacking of the Summer Palace in 1860.James L. Hevia, \"Looting and Its Discontents: Moral Discourse and the Plunder of Beijing, 1900–1901\", in Bickers and Tiedemann, ed., The Boxers, China, and the World (2007): 94. Each nationality accused the others of being the worst looters. An American diplomat, Herbert G. Squiers, filled several railway carriages with loot and artifacts. The British Legation held loot auctions every afternoon and proclaimed, \"Looting on the part of British troops was carried out in the most orderly manner.\" However, one British officer noted, \"It is one of the unwritten laws of war that a city which does not surrender at the last and is taken by storm is looted.\" For the rest of 1900–1901, the British held loot auctions everyday except Sunday in front of the main-gate to the British Legation. Many foreigners, including Sir Claude Maxwell MacDonald and Lady Ethel MacDonald and George Ernest Morrison of The Times, were active bidders among the crowd. Many of these looted items ended up in Europe. The Catholic Beitang or North Cathedral was a \"salesroom for stolen property.\"Chamberlin, Wilbur J. letter to his wife (11 December 1900), in Ordered to China: Letters of Wilbur J. Chamberlin: Written from China While Under Commission from the New York Sun During the Boxer Uprising of 1900 and the International Complications Which Followed, (New York: Frederick A. Stokes, 1903), p. 191"]}, {"page": "Ernest Mason Satow", "response": ["Satow did not have the good fortune to be named the first British Ambassador to Japan - the honour was instead bestowed on his successor Sir Claude Maxwell MacDonald in 1905."]}, {"page": "Claude MacDonald", "response": ["#RedirectClaude Maxwell MacDonald"]}, {"page": "Claude Maxwell Macdonald", "response": ["#REDIRECT Claude Maxwell MacDonald"]}, {"page": "Claude Macdonald", "response": ["#RedirectClaude Maxwell MacDonald"]}, {"page": "Japan–United Kingdom relations", "response": ["*Claude Maxwell MacDonald - Diplomat"]}, {"page": "List of premature obituaries", "response": ["* Claude Maxwell MacDonald, was the British minister in Beijing during the Boxer Rising in 1900, and had his obituary published in \"The Times\" along with those of other prominent foreigners in the city. MacDonald died in 1915."]}, {"page": "Eight-Nation Alliance", "response": ["The diplomatic compound was under siege by the Wuwei Rear Division of the Chinese Army and some Boxers (Yihetuan), for 55 days, from 20 June to 14 August 1900. A total of 473 foreign civilians, 409 soldiers from eight countries, and about 3,000 Chinese Christians took refuge in the Legation Quarter.Thompson, 84–85  Under the command of the British minister to China, Claude Maxwell MacDonald, the legation staff and security personnel defended the compound with small arms and one old muzzle-loaded cannon discovered and unearthed by Chinese Christians, who turned it over to the Allies. It was nicknamed the International Gun because the barrel was British, the carriage Italian, the shells Russian and the crew American."]}, {"page": "Claude M. Macdonald", "response": ["#redirectClaude Maxwell MacDonald"]}, {"page": "Macdonald", "response": ["* Claude Maxwell MacDonald (1852–1915), British soldier and diplomat"]}, {"page": "Sir Claude Maxwell MacDonald", "response": ["#REDIRECTClaude Maxwell MacDonald"]}, {"page": "Convention for the Extension of Hong Kong Territory", "response": ["On 10 April 1898, the French, who also desired Chinese territory, forced the Qing Empire into a 99-year lease of Kwang-Chou-Wan to France to support France in southern China and Indochina. In order to maintain the balance of powers, Britain ordered Claude Maxwell MacDonald to pressure Qing Empire into allowing the expansion of Hong Kong for . As a result, the Convention for the Extension of Hong Kong Territory was signed on 9 June 1898 in Beijing (Peking).Anand, R.P. (2003) Cultural Factors in International Relations, Abhinav Publications.   The contract was signed to give the British full jurisdiction of the newly acquired land that was necessary to ensure proper military defence of the colony around the island.Ghai, Yash P. (1999) Hong Kong's New Constitutional Order: The Resumption of Chinese Sovereignty and the Basic Law, HK University Press.  Some of the earliest proposals for the land's usage in 1894 included cemetery space, an exercise ground for British troops as well as land for development. From the British perspective concerns over security and territorial defence provided the major impetus for the agreement."]}, {"page": "List of ambassadors of the United Kingdom to China", "response": ["|Sir Claude Maxwell MacDonaldE. W. Edwards, 'MacDonald, Sir Claude Maxwell (1852–1915)’, Oxford Dictionary of National Biography, Oxford University Press, Sept 2004; online edn, Jan 2008 , accessed 5 November 2008||24 April 1896||25 October 1900"]}, {"page": "Clan Macdonald of Clanranald", "response": ["* Colonel The Rt Hon. Sir Claude Maxwell MacDonald (1852–1915), British soldier and diplomat"]}, {"page": "George Sansom", "response": ["Sansom first arrived in Japan in 1904 and was attached to the British legation in Tokyo to learn the Japanese language. While he was working as private secretary to Sir Claude Maxwell MacDonald the legation gained higher status by becoming an embassy, and Sansom was present during the negotiations for the renewal of the Anglo-Japanese Alliance in 1905. He remained in Japan for most of his diplomatic career, serving in consulates around Japan, where he also acquired proficiency in Japanese dialects."]}, {"page": "Timeline of Nigerian history", "response": ["| 2 February || Consul-general Claude Maxwell MacDonald receives a letter from King Koko offering to release hostages in exchange for a redress of grievances against the Company. This request is declined."]}, {"page": "John Twiggs Myers", "response": ["In May 1900, Myers was sent to China aboard the cruiser USS Newark and put ashore with a detachment of 48 marines (including then Private Daniel Daly) and 3 sailors to guard the US Legation in Peking, just as the Boxer Rebellion broke out. Myers' Marines occupied a wall defending the Legations, arguably the most vulnerable part of the defensive position, and led an attack (along with Russian and British troops) as part of a ferocious battle on July 3 which dislodged the main Boxer position near the wall. Myers was wounded in the leg by a spear; his attack was claimed by the British Consul, Sir Claude Maxwell MacDonald, as \"one of the most successful operations of the siege, as it rendered our position on the wall, which had been precarious, comparatively strong.\" As a result of his bravery in this action, he was brevetted major and advanced four numbers in rank. In 1921, Myers would also become one of only 20 living marines to be awarded the USMC Brevet Medal when that decoration was created. Upon recovering from his wounds, he served as the provost marshal on American Samoa and was then transferred to the Marine barracks at Bremerton, Washington.The Savage Wars of Peace by Max Boot, Chapter 4, \"Red Summer: Boxer Uprising, 1900\""]}, {"page": "Claud Maxwell Macdonald", "response": ["#REDIRECT Claude Maxwell MacDonald "]}, {"page": "CM Macdonald", "response": ["#REDIRECT Claude Maxwell MacDonald "]}, {"page": "Hôpital Temporaire d'Arc-en-Barrois", "response": ["Social connections helped the Bromley-Martins obtain the personal support of the joint committee's chairmen, Sir Claude Maxwell MacDonald and the Hon. Arthur Stanley, M.P. The hospital project gained approval in November 1914 after Emily Georgiana Kemp, a British artist, writer and international explorer, offered salary support for an 11-member corps of experienced trained nurses. "]}, {"page": "William Scott Ament", "response": ["Edwin Hurd Conger (7 March 1843 – 18 May 1907), the United States Minister to China (1898–1905);\"The Missionaries Defended: Interviews in Japan with Minister Conger and Dr. Ament: Goods Sold to Succor Native Christians.\" Kobe Herald (24 April 1901). Reprinted in The New York Times (25 April 1901):2. ; A History of the Precious Metals from the Earliest Times to the Present, 358; Edwin Conger, quoted in Porter, 242. by Colonel Sir Claude Maxwell MacDonald (1852–1915), the chief British diplomat in Beijing during the Boxer Uprising, and the commander of the defence of the besieged foreign legations;Sir Claude MacDonald, quoted in Porter, 244. and by Charles Harvey Denby (1830–1904), the former United States Minister to China (1885–1898)Charles Denby, China and Her People, 217–218."]}, {"page": "Twain–Ament indemnities controversy", "response": ["====Claude Maxwell MacDonald====", "Colonel Sir Claude Maxwell MacDonald (1852–1915), the chief British diplomat in Beijing during the Boxer Uprising, and the commander of the defence of the besieged foreign legations, also defended the missionaries:Claude Maxwell MacDonald, quoted in Porter, 244."]}, {"page": "Sir Claude Macdonald", "response": ["#REDIRECT Claude Maxwell MacDonald "]}, {"page": "June 1900", "response": ["* In Beijing, Imperial Chinese troops surrounded the legation quarter, where the diplomatic corps from western powers and Japan were headquartered. British minister Sir Claude Maxwell MacDonald telegraphed: \"Situation extremely grave. Unless arrangements are made for immediate advance to Peking, it will be too late.\""]}, {"page": "Claude McDonald", "response": ["#REDIRECT Claude Maxwell MacDonald"]}, {"page": "Seymour Expedition", "response": ["Boxer bands advanced on Beijing in May and June 1900. The Qing dynasty was ambivalent about the Boxers, fearing that they might become anti-Qing. The Boxers became a serious threat to Western and Japanese citizens, as well as to Chinese Christians living in northern China. The diplomatic legations in Beijing requested that guards be sent to protect them. As such, more than 400 marines and naval troops from eight countries arrived in Beijing on May 31.  However, as the Boxers began posing a more significant threat, it became apparent that additional troops were needed. On June 9, Sir Claude Maxwell MacDonald, the British Minister in China, cabled Vice-Admiral Edward Hobart Seymour, commander of the British navy's China Station, that the situation in Beijing was becoming more serious and that troops should be landed with all arrangements made for an advance to Peking [Beijing] at once."]}, {"page": "Siege of the International Legations", "response": ["In early 1900 the Boxer movement spread rapidly north from Shandong into the countryside near Beijing. Boxers burned Christian churches, murdered Chinese Christians and intimidated Chinese officials who stood in their way. Two missionaries, Protestant William Scott Ament and Catholic Bishop Favier, reported to the diplomatic ministers (Ambassadors) about the growing threat.Porter, Henry D. William Scott Ament: Missionary of the American Board to China. New York: Fleming H. Revell, 1911, pp. 175–9.Foreign Relations of the United States, 1900, p. 130 American Minister Edwin H. Conger cabled Washington, \"The whole country is swarming with hungry, discontented, hopeless idlers.\" Requesting a warship to be stationed offshore of Tianjin, the nearest port to Beijing, he reported, \"Situation becoming serious.\"Foreign Relations of the United States, 1900, Washington: GPO, pp. 122, 130.  On May 30, the diplomats, led by British Minister Claude Maxwell MacDonald, requested that foreign soldiers come to Beijing to defend the legations and the citizens of their countries. The Chinese government reluctantly acquiesced, and the next day more than 400 soldiers from eight countries disembarked from warships and traveled by train to Beijing from Tianjin. They set up defensive perimeters around their respective missions.Morrison, Dr. George E. \"The Siege of the Peking Legations\" The Living Age, Nov 17, 24 and Dec 1, 8, and 15, 1900, p.475.Thompson, 42."]}, {"page": "Francis Dunlap Gamewell", "response": ["The next morning, amidst the chaos of hundreds of people milling around the British Legation, the British Minister Claude Maxwell MacDonald appointed Frank Gamewell as Chief of Staff of the Committee for Fortifications. He gave Gamewell absolute authority to organize the fortification of the British Legation against an anticipated attack by Boxers and the Chinese Army. Gamewell took to the job with alacrity. A British author described him, \"G[amewell] is the man of the hour … Already the British Legation, which at the commencement of the siege was utterly undefended by any entrenchments or sandbags, is rapidly being hustled into order by the masterful hand of this missionary … the hard worked man always finds time for everything. It is a wonder.\"Weale, B.L. (Bertram Lenox Simpson). Indiscreet Letters from Peking. New York: Dodd, Meade, 1907, pp. 142-143 The members of Gamewell's fortification committee, missionaries all, were called \"the fighting parsons.\"Thompson, p. 89"]}]}}