{"wiki_id": "http://www.wikidata.org/entity/Q10988660", "itemLabel": "John Kelly", "itemDescription": "Manx scholar, born 1750", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Kelly_(scholar)", "wikipedia_page": {"main": "John Kelly LL.D. (1750 – 12 November 1809) was a Manx scholar, translator and clergyman.", "link_mentions": [{"page": "John Kelly", "response": ["*John Kelly (engineer), Irish professor, former Registrar of University College Dublin", "*John Kelly (scholar) (1750–1809), at Douglas, Isle of Man", "*John Kelly (actor) (1901–1947), American film actor whose credits include Meet Dr. Christian", "*John Kelly (artist) (born 1965), Australian artist", "*John Kelly (author) (born 1964), British author and illustrator", "*John Kelly (born 1978), member of the Doctor Who Restoration Team", "*John Kelly (Irish broadcaster) (born 1965), Irish radio broadcaster and presenter of The View", "*John Kelly (performance artist) (born 1959), American performance artist, visual artist and writer", "*John Kelly (Sinn Féin politician) (1936–2007), Northern Irish republican leader", "*John Kelly (New York politician) (1822–1886), politician in Tammany Hall, U.S. Representative from New York (1855–1858)", "*John Kelly (Brooklyn politician) (1855–1900), American politician from New York", "*John Kelly (bailiff) (c. 1793–1854), Member of the House of Keys and High Bailiff of Castletown, Isle of Man", "*John Kelly (Canadian politician) (1852–1934), municipal councillor in Edmonton, Alberta, Canada", "*John Kelly (New South Wales politician) (1840–1896), Australian politician", "*John Kelly (Roscommon politician) (born 1960), Irish Labour Party Senator", "*John Kelly of Killanne (died 1798), leader of the Irish Rebellion of 1798 in Wexford", "*John Kelly (Royal Navy officer) (1871–1936), British Admiral of the Fleet", "*John Kelly (footballer, born 1909) (1909–?), English footballer for York City", "*John Kelly (footballer, born 1913) (1913–?), English footballer for Bradford City", "*John Kelly (footballer, born 1921) (1921–2001), Scottish international football player (Barnsley)", "*John Kelly (footballer, born 1935), Scottish footballer for Crewe Alexandra", "*John Kelly (footballer, born 1960), Anglo-Irish soccer player whose clubs included Tranmere Rovers, Preston", "*John Kelly (American football) (born 1944), American football player", "*John Kelly (running back) (born 1996), American football running back", "*John Kelly (rugby), English former rugby union and professional rugby league footballer", "*John Kelly (rugby union, born 1974), Irish rugby union player", "*John Kelly (boxer) (1932–2016), Northern Irish boxer", "*John Kelly (catcher) (1859–1908), 1879–1884 baseball player", "*John Kelly (equestrian) (born 1930), Australian Olympic equestrian", "*John Kelly (golfer) (born 1984), American amateur golfer", "*John Kelly (Lancashire and Derbyshire cricketer) (1922–1979), English cricketer", "*John Kelly (Nottinghamshire cricketer) (1930–2008), English cricketer", "*John Kelly (outfielder) (1879–1944), 1907 baseball player", "*John Kelly (racewalker) (1929–2012), Irish Olympic athlete", "*John Kelly (sportscaster) (born 1960), ice hockey sportscaster", "*John Kelly (Tipperary hurler) (born 1948), Irish retired sportsperson", "*John Kelly (runner) (born 1984), American endurance athlete", "*John Kelly (1840–1904), British architect specialising in churches, see Kelly & Birchall", "*John Kelly (diplomat) (born 1941), British diplomat and Governor of the Turks and Caicos Islands", "*John Kelly (minister) (1801–1876), Congregational minister", "*John Kelly (John Clark), character in a number of Tom Clancy novels", "*John Kelly (NYPD Blue), character on the TV series NYPD Blue, played by David Caruso", "*John Kelly Girls' Technology College"]}, {"page": "Fenodyree", "response": ["John Kelly's dictionary has suggested an alternate etymology, stemming from . The term has also been used in the sense of \"satyr\" in the 1819 Manx translation of the Bible (Isaiah 34:14) by Kelly."]}, {"page": "Glashtyn", "response": ["However the spelling \"Glashtyn\" is used as heading in John Kelly's Fockleyr dictionary of 1866."]}, {"page": "List of Manx people", "response": ["*John Kelly (1750–1809), lexicographer and Bible translator into Manx"]}, {"page": "Mark Hiddesley", "response": ["Of 20,000 people in the Isle of Man, few in Hildesley's day knew English. A Manx translation of the New Testament had been begun by his predecessor Thomas Wilson. Hildesley himself learned Manx well enough to conduct the church services in it, but not perfectly. John Kelly made for him a grammar and dictionary. At first, with the support of the Society for Promoting Christian Knowledge, Hildesley printed the New Testament and the Book of Common Prayer, translated, under his direction, by the clergy of the diocese, as well as the Christian Monitor, John Lewis's Exposition of the Catechism, and Bishop Wilson's Form of Prayer for the use of the herring fishermen.", "With further assistance, about 1766 Hildesley' made arrangements for the translation of the Old Testament, dividing it into 24 parts. The names of the translators are in Weeden Butler's Life of Bishop Hildesley (pp. 252–6). The work was given for final revision to Philip Moore and John Kelly. The first volume of the translation was completed on 2 July 1771; the second volume was ready for the press on 6 April 1772; and all was finished and transcribed in December of the same year, at the time of the bishop's death. The work was printed at Whitehaven under the title of: Yn Vible Cashcrick: ny, yn Chenn Chonaant. Veih ny chied ghlaraghyn, dy kiaralagh chyndaït ayns Gailck; ta shen dy ghra, chengey ny mayrey Ellan Vannin. It was published in 1773. The second edition of the Manx scriptures was published at Whitehaven in 1775, and the last edition at London in 1819. In 1825 George Murray, bishop of Sodor and Man, informed the SPCK that the displacement of Manx by English in the Island removed the necessity of providing further copies of the Manx bible."]}, {"page": "Manx Society for the Publication of National Documents", "response": ["The Manx Society for the Publication of National Documents, or simply the Manx Society, was a text publication society founded in February 1858 with the objective of publishing reprints of historical documents relating to the Isle of Man, its people, and culture. Over its lifetime the society published 33 volumes of documents, the last appearing in 1893. Its publications included an English-Manx dictionary based on the surviving manuscript of John Kelly, books on the laws and currency of the island, reprints of accounts of visits to the island, the Book of Common Prayer in Manx, and a translation of the Chronicles of Mann."]}, {"page": "Bible translations into Manx", "response": ["Of 20,000 people in the Isle of Man, few in Hildesley's day knew English. A Manx translation of the New Testament had been begun by his predecessor Thomas Wilson Hildesley himself learned Manx well enough to conduct the church services in it, but not perfectly. John Kelly made for him a grammar and dictionary. At first, with the support of the Society for Promoting Christian Knowledge, Hildesley printed the New Testament and the Book of Common Prayer, translated, under his direction, by the clergy of the diocese, as well as the Christian Monitor, John Lewis's Exposition of the Catechism, and Bishop Wilson's Form of Prayer for the use of the herring fishermen.", "With further assistance, around 1766, Hildesley made arrangements for the translation of the Old Testament, dividing it into 24 parts. The names of the translators are given in Weeden Butler's Life of Bishop Hildesley.Weeden Butler, Life of Bishop Hildesley pp. 252–6) The work was given for final revision to Philip Moore and John Kelly. The first volume of the translation was completed on 2 July 1771; the second volume was ready for the press on 6 April 1772; and all was finished and transcribed in December of the same year, at the time of the bishop's death. The work was printed at Whitehaven under the title of: . It was published in 1773. The second edition of the Manx scriptures was published as one volume at Whitehaven in 1775."]}, {"page": "Archibald Cregeen", "response": ["The dictionary was ordered in an unusual way for a language that undergoes initial mutation of words, in that it is strictly alphabetical, including entries for mutated forms:Both the first edition of the Dictionary (1835) and the second (1910) comprise a strictly alphabetical list of word forms, which is particularly valuable for users not entirely familiar with the nature and range of variation in the initial letter of Manx words, due to initial consonant mutations, and to the addition of consonants (such as d- or n-) before certain forms of vowel-initial verbs. A consequence of this strictly alphabetical procedure, though, is that related forms of the same word, or word-family, are scattered throughout the dictionary. Thus, in a sense, Cregeen’s Dictionary as published is more like an index to a lexicon than a lexicon itself.It is worth noting that Cregeen was not the first person to attempt to write a dictionary for the Manx language. Reverend John Kelly had attempted to do so in his A Triglot Dictionary of the Celtic Language, as spoken in Man, Scotland, and Ireland together with the English, but much of this was destroyed in a fire during publishing. Cregeen would not have been aware of this as although Kelly's dictionary was partially extant in manuscript form, it was not published until decades later in 1866."]}, {"page": "Doug Fargher", "response": ["Although Fargher wrote the first modern dictionary for the Manx language, he was not the first Manxman to write one. Reverend John Kelly attempted to do so in his A Triglot Dictionary of the Celtic Language, as spoken in Man, Scotland, and Ireland together with the English, but much of this was destroyed in a fire during publishing in 1807.Moore, A.W. (1901). \"John Kelly (1750-1809)\". A Manx Notebook. Retrieved 18 July 2020. Archibald Cregeen spent decades writing his A Dictionary of the Manks Language (1838) but was not aware of Kelly's dictionary, as although it was partially extant in manuscript form, it was not published until decades later in 1866.Moore, A. W. (1901). \"Archibald Cregeen\". A Manx Notebook. Retrieved 17 July 2020 Rev. William Wood also published a small dictionary for school students of Manx in 1950."]}]}}