{"wiki_id": "http://www.wikidata.org/entity/Q1108753", "itemLabel": "Colin Williams", "itemDescription": "British Archdeacon", "wikipedia_url": "https://en.wikipedia.org/wiki/Colin_Williams_(priest)", "wikipedia_page": {"main": "Colin Henry Williams (born 12 August 1952) is a British Anglican priest. Since 2015, he has served as an Archdeacon in the Diocese in Europe; he was Archdeacon of Lancaster from 1999 to 2005.", "link_mentions": [{"page": "St Stephen's House, Oxford", "response": ["* Colin Williams – General Secretary of the Conference of European Churches"]}, {"page": "Diocese in Europe", "response": ["*Eastern Archdeaconry, consisting of: Albania, Armenia, Austria, Azerbaijan, Belarus, Bosnia and Herzegovina, Bulgaria, Croatia, Czech Republic, Georgia, Greece, Hungary, Kosovo, Moldova, Mongolia, Montenegro, North Macedonia, Poland, Romania, Russia, Serbia, Slovakia, Slovenia, Turkey, Turkmenistan, Ukraine, and Uzbekistan. The previous archdeacon was Patrick Curran, who was based in Vienna, Austria and served 2002–2015. The archdeacon is assisted by two area deans (one in Greater Athens, Greece and one in Moscow, Russia). Colin Williams was full-time Archdeacon 2015–2019, taking charge of both the Eastern archdeaconry and that of Germany and Northern Europe, and being based in Frankfurt, Germany;Diocese in Europe — First full time stipendiary archdeacon appointed  (Accessed 29 May 2015) Leslie Nathaniel is Williams' successor full-time in both roles."]}, {"page": "St Laurence's Church, Ludlow", "response": ["* The Venerable Colin Williams (2010 to 2015)"]}, {"page": "Archdeacon of Lancaster", "response": ["*1999–2005 (res.): Colin Williams (afterwards archdeacon emeritus; born 1952)"]}, {"page": "Colin Williams", "response": ["Colin Williams may refer to:", "* Colin Williams, first vice-president of the Council for Aboriginal Rights in 1951", "* Colin Welland (1934–2015), British actor and screenwriter originally named Colin Williams", "* Colin Williams (priest) (born 1955), Archdeacon of Lancaster from 1999 to 2005", "* Colin Williams (producer), of Jim Henson's Pajanimals", "* Colin Williams, dean of University of Plymouth Colleges network", "* Colin Williams, guitarist for British band His Majesty (founded 1983)", "* Colin Williams, OBE, formerly Director, Scotland, The Princess Royal Trust for Carers, recipient of 2006 New Year Honours"]}, {"page": "Archdeacons in the Diocese in Europe", "response": ["They share this task with running a local church in their area, although the Diocese in Europe was (as of 2012) working towards a new system whereby there would be four full-time archdeacons instead. Colin Williams became a full-time Archdeacon for both the Eastern archdeaconry and that of Germany and Northern Europe (\"Archdeacon of Europe\") in September 2015, based in Frankfurt, Germany;Diocese in Europe — First full time archdeacon appointed  (Accessed 29 May 2015) his successor, Leslie Nathaniel is full-time in both roles together.https://europe.anglican.org/downloads/advertisement-archdeacon-of-the-east-and-germany-and-northern-europe.pdf David Waller is now also archdeacon of two archdeaconries: Gibraltar and Italy & Malta. It is also intended that the next Archdeacon of France (full-time) will also, eventually, become Archdeacon of Switzerland.", "*October 20151 April 2019 (ret.): Colin Williams (as Archdeacon of the Eastern archdeaconry and of Germany and Northern Europe)", "Following the resignation of Jonathan Lloyd, the Archdeacon of Switzerland, Peter Potter, became acting archdeacon of Germany and Northern EuropeEurobishop – Archdeacon Peter Potter also to be Acting Archdeacon of Germany and Northern Europe (Accessed 20 April 2014) until the licensing in October of Colin Williams as the new full-time Archdeacon for Eastern and Northern Europe.", "*October 20151 April 2019 (ret.): Colin Williams (as Archdeacon of the Eastern archdeaconry and of Germany and Northern Europe)"]}]}}