{"wiki_id": "http://www.wikidata.org/entity/Q11059251", "itemLabel": "Sidney Barton", "itemDescription": "British diplomat (1876-1946)", "wikipedia_url": "https://en.wikipedia.org/wiki/Sidney_Barton", "wikipedia_page": {"main": "Sir Sidney Barton  (26 November 1876 – 20 January 1946) was a British barrister and diplomat, serving as consul-general in Shanghai and as minister to Ethiopia.", "link_mentions": [{"page": "Pettigo", "response": ["*Sir Sidney Barton, British Minister to Ethiopia"]}, {"page": "List of Old Paulines", "response": ["*Sidney Barton (1876–1946); diplomat"]}, {"page": "March of the Iron Will", "response": ["After his somber meeting with his chieftains, Haile Selassie visited Sir Sidney Barton at the British Legation. He spoke softly to Sir Sidney but to the point. Britain had encouraged him with fine words and had made many promises. However, Britain had provided Ethiopia with few guns for which the Ethiopians had paid cash. Haile Selassie stressed that he had risked his own life for Ethiopia but also for the League of Nations. He asked Sir Sidney whether Britain would now come to his aid in this hour of direst need. Shortly afterwards Haile Selassie drove away, his mouth grim with disappointment."]}, {"page": "List of Knights Grand Cross of the Order of the British Empire", "response": ["**Sir Sidney Barton (1 January)"]}, {"page": "List of ambassadors of the United Kingdom to Ethiopia", "response": ["*1929–1936: Sir Sidney BartonSir Sydney Barton 1876–1946 – Association for the Development of Pettigo & TullyhommonCourt Circular, The Times, London, 22 March 1929, page 19"]}, {"page": "List of members of Middle Temple", "response": ["*Sir Sidney Barton, Consul-General in Shanghai (1922-1929) and Minister to Ethiopia (1929-1936)"]}, {"page": "1913 Birthday Honours", "response": ["*Sidney Barton, Esq., Chinese Secretary to His Majesty's Legation at Peking."]}, {"page": "Order of the Star of Ethiopia", "response": ["** Sidney Barton"]}, {"page": "List of Consuls-General of the United Kingdom in Shanghai", "response": ["|Sir Sidney Barton||24 August 1922||21 May 1929||"]}, {"page": "Student interpreter", "response": ["* Sir Sidney Barton, British Minister to Ethiopia"]}, {"page": "Cecil Holliday", "response": ["He died on 31 July 1924 at St Marie's Hospital in the French Concession in Shanghai and was buried at the Bubbling Well Road Cemetery at a funeral attended by the British Consul-General, Sidney Barton, and the British Crown Advocate for China, Hiram Parkes Wilkinson.  The pall bearers were Sir Edward Pearce and Messrs A.W. Burkill, C.R. Burkill, Calder Marshall, C.H. Arnhold and C.W. Porter.North China Herald, August 9, 1924, p216"]}, {"page": "1926 Birthday Honours", "response": ["*Sidney Barton  His Majesty's Consul-General at Shanghai"]}, {"page": "1936 New Year Honours", "response": ["*Sir Sidney Barton  His Majesty's Envoy Extraordinary and Minister Plenipotentiary at Addis Ababa."]}, {"page": "List of Knights Commander of the Royal Victorian Order appointed by George V", "response": ["|Sir Sidney Barton, KBE, CMG"]}]}}