{"wiki_id": "http://www.wikidata.org/entity/Q1107138", "itemLabel": "William Stainton Moses", "itemDescription": "British medium", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Stainton_Moses", "wikipedia_page": {"main": "William Stainton Moses (1839–1892) was an English cleric and spiritualist medium. He promoted spirit photography and automatic writing, and co-founded what became the College of Psychic Studies. He resisted scientific examination of his claims, which have generally been demolished.", "link_mentions": [{"page": "Spiritualism", "response": ["William Stainton Moses (1839–92) was an Anglican clergyman who, in the period from 1872 to 1883, filled 24 notebooks with automatic writing, much of which was said to describe conditions in the spirit world. However, Frank Podmore was skeptical of his alleged ability to communicate with spirits and Joseph McCabe described Moses as a \"deliberate impostor\", suggesting his apports and all of his feats were the result of trickery.Frank Podmore. (1902). Modern Spiritualism: A History and a Criticism. Volume 2. Methuen & Company. pp. 283-287 \"It seems reasonable to conclude that all the marvels reported at [Moses] seances were, in fact, produced by the medium's own hands: that it was he who tilted the table and produced the raps, that the scents, the seed pearls, and the Parian statuettes were brought into the room in his pockets: and that the spirit lights were, in fact, nothing more than bottles of phosphorised oil. Nor would the feats described have required any special skill on the medium's part.\"Joseph McCabe. (1920). Spiritualism: A Popular History From 1847. Dodd, Mead and Company. pp. 151–173"]}, {"page": "Mary Todd Lincoln", "response": ["In 1872, she went to spiritualist photographer, William H. Mumler, who produced a photograph of her that appears to faintly show Lincoln's ghost behind her (photo in Allen County Public Library, Fort Wayne, Indiana).Mysteries at the Museum, season 2 (2011), \"The French Connection\" episode. The College of Psychic Studies, referencing notes belonging to William Stainton Moses, claims that the photo was taken in the early 1870s, that Lincoln had assumed the name of 'Mrs. Lindall', and that Lincoln had to be encouraged by Mumler's wife to identify her husband on the photo."]}, {"page": "Edward Maitland", "response": ["Maitland was a spiritualist. He joined the London Spiritualist Alliance in March, 1884.M. A. Oxon (William Stainton Moses). The London Spiritualist Alliance. Light. Volume 4. March 15, 1884. p. 108 He was a vegetarian."]}, {"page": "College of Psychic Studies", "response": ["Early members included well known spiritualists such as Charles Maurice Davies, Charles Isham, William Stainton Moses, Stanhope Templeman Speer, Morell Theobald and George Wyld.Spence, Lewis. (2006 edition, originally published 1920). An Encyclopaedia of Occultism. Cosimo. p. 80.  The BNAS carried out experimental séances and investigations into mediumship. It held no dogmatic religious views but was known for \"sympathising with the religion of Jesus Christ\"."]}]}}