{"wiki_id": "http://www.wikidata.org/entity/Q11040742", "itemLabel": "Kevin Anderson", "itemDescription": "British climatologist", "wikipedia_url": "https://en.wikipedia.org/wiki/Kevin_Anderson_(scientist)", "wikipedia_page": {"main": "Kevin Anderson (born 28 June 1962) is a British climate scientist. Anderson has a decade of industrial experience, principally as an engineer in the petrochemical industry. He regularly provides advice on issues of climate change (with a focus on energy and mitigation) across different tiers of governance, from local and regional through to national and the European Commission.", "link_mentions": [{"page": "Nigel Lawson", "response": ["In 2011, Bob Ward of the Grantham Research Institute said that the GWPF was \"spreading errors\" and \"the 'facts'\" Lawson \"repeats are demonstrably inaccurate\". Ward also criticised Lawson for repeating in a 2010 BBC radio debate that Antarctic ice volumes were unchanged even after his error was highlighted by his opponent, Professor Kevin Anderson. Ward said that Lawson provided no evidence to back his claim which is contrary to satellite measurements, and Lawson similarly incorrectly implied that the correlation between CO2 and sea levels was uncertain as well as that sea levels were rising more slowly since 1950 than before it."]}, {"page": "Kevin Anderson", "response": ["Kevin Anderson may refer to:", "* Kevin Anderson (actor) (born 1960), American actor", "* Kevin Anderson (tenor) (fl. 1990s), American opera singer", "* Kevin Anderson (cinematographer), Australian cinematographer and filmmaker", "* Kevin Anderson (athletic director) (born 1955), American university sports administrator", "* Kevin Anderson (soccer) (born 1971), American soccer midfielder", "* Kevin Anderson (boxer) (born 1983), British boxer", "* Kevin Anderson (tennis) (born 1986), South African tennis player", "* Kevin Anderson (basketball) (born 1988), American basketball player", "* Kevin Anderson (scientist) (born 1962), British climate scientist", "* Kevin Anderson (train conductor) (died 2018), fatally wounded during the Ponton train derailment", "* Kevin Anderson (politician), Australian politician"]}, {"page": "Charles Moore, Baron Moore of Etchingham", "response": ["In December 2019, Moore was a guest editor on the BBC flagship news programme, Today, where he invited fellow Global Warming Policy Foundation affiliates Matt Ridley and Michael Kelly to be interviewed in back-to-back editions of the programme also featuring climate activist Greta Thunberg and climate scientist Kevin Anderson. Moore said the BBC was biased against climate change deniers. Today host, Nick Robinson, said that the corporation's coverage was governed by \"Ofcom regulations and the law\" and that it reported the \"global consensus\" on climate science, denying it preached a certain position."]}, {"page": "Renewable energy in the European Union", "response": ["Underlying many of the EU's energy policy proposals is the goal to limit global temperature changes to no more than 2 °C above pre-industrial levels,New EU energy plan – more security, less pollution, press release by European Commission of which 0.8 °C has already taken place and another 0.5–0.7 °C (for total warming of 1.3-1.5 °C) is already committed.Oliver Geden (2013), Modifying the 2°C Target. Climate Policy Objectives in the Contested Terrain of Scientific Policy Advice, Political Preferences, and Rising Emissions, SWP Research Paper 5 2 °C is usually seen as the upper temperature limit to avoid 'dangerous global warming'. However some scientists, such as Kevin Anderson, professor of energy and climate change in the School of Mechanical, Aeronautical and Civil Engineering at the University of Manchester and former director of the Tyndall Centre, the UK's leading academic climate change research organisation, have argued that to be consistent with the science, 1 °C is a more accurate threshold for \"dangerous\" climate change.[Prof Kevin Anderson, past climate danger, in denial YouTube https://www.youtube.com/watch?v=32HfnxIDLLA] 18 November 2012[The Truth About Global Warming: Brutal Numbers, Tenuous Hope http://vimeo.com/39555673] Cabot Institute Annual Lecture, 2012"]}, {"page": "Personal carbon trading", "response": ["* \"Beyond carbon pricing to TEQs – reconciling scientific reality with realpolitik\" Popular peer-reviewed paper advocating for TEQs, edited by Kevin Anderson and lead-authored by Shaun Chamberlin (July 2015)"]}, {"page": "Tyndall Centre", "response": ["The Tyndall Centre's Director is Professor Robert Nicholls at the University of East Anglia and former of Southampton University. Former directors of the Tyndall Centre include Professor Corinne Le Quéré FRS CBE and Professor Sir Robert Watson interim Directors Carly Mclachlan and Professor Kevin Anderson, Professor Andrew Watkinson and Professor John Schellnhuber. The founding director is Professor Mike Hulme. Asher Minns is Executive Director.", "*Kevin Anderson (scientist)"]}, {"page": "Air transport in the United Kingdom", "response": ["Climate scientist Kevin Anderson of the Tyndall Centre for Climate Change Research demonstrated in 2009 that continued annual growth in UK air travel at the usual seven percent until 2012 and at three percent thereafter will lead to such travel consuming 70 percent of the UK's total planned national carbon emissions by 2030.Anderson, K. (2008, 17 June). Reframing climate change: from long-term targets to emission pathways (esp. slide 24 onward).Anderson K, Bows A (2008). Reframing the climate change challenge in light of post-2000 emission trends. Philosophical Transactions of the Royal Society A: Mathematical, Physical and Engineering Sciences (366:1882, p.3863-3882).  In that less-than-business-as-usual scenario, UK air travel emissions would increase from 11 MT in 2006, to 17 MT in 2012, and 28 MT in 2030. His contention is that the consequences of not promptly reducing the demand or supply for air travel in the UK and elsewhere will result in severe consequences for society and the ecosystems upon which humanity depends.Anderson, K. (2009). Presentation at the 4 Degrees and Beyond International Climate Change Conference, Oxford, 2009. Session 10: Avoiding Large Climate Changes. Global emission pathways: balancing Annex 1 mitigation with non-Annex 1 development. [1] Slides: Slides  ; [2] Audio: Audio ; [3] Video: MP4 video (216 MB)Anderson, K. and Alice Bows. Beyond 'dangerous' climate change: emission scenarios for a new world. Beyond ‘dangerous’ climate change: emission scenarios for a new world. Phil. Trans. R. Soc. A 13 January 2011 369:20-44; ."]}, {"page": "List of climate scientists", "response": ["* Kevin Anderson, Director of the Tyndall Centre for Climate Change Research and is an adviser to the British Government on climate change."]}, {"page": "Climate Change: Global Risks, Challenges and Decisions", "response": ["The conference acts as a focal point for media coverage of climate science, and significant coverage has been given to announcements made prior to the conference by scientists .  The Times reported notable climate scientist Professor Kevin Anderson as saying \"We all hope that Copenhagen will succeed but I think it will fail. We won't come up with a global agreement,....I think we will negotiate, there will be a few fudges and there will be a very weak daughter of Kyoto. I doubt it will be significantly based on the science of climate change.\""]}, {"page": "Hourglass (newspaper)", "response": ["It was edited by environmental activist Zion Lights and included interviews with Margaret Atwood, Amanda Palmer and Neil Gaiman, Ray Mears, Michael Eavis, Christiana Figueres, Tom Rivett-Carnac, Maxine Peake, and Kevin Anderson. XR spokesperson Rupert Read was a regular columnist for the paper."]}]}}