{"wiki_id": "http://www.wikidata.org/entity/Q11059542", "itemLabel": "Cedric Blaker", "itemDescription": "(1889-1965)", "wikipedia_url": "https://en.wikipedia.org/wiki/Cedric_Blaker", "wikipedia_page": {"main": "Cedric Blaker  (19 November 1889 – 18 June 1965) was a British entrepreneur in China and Hong Kong. He was the chairman of the Hongkong and Shanghai Banking Corporation, the South China Morning Post and the Hong Kong Chamber of Commerce and also an unofficial member of the Executive Council and the Legislative Council of Hong Kong.\nHis son, Baron Blaker, was a Conservative minister.", "link_mentions": [{"page": "The Hongkong and Shanghai Banking Corporation", "response": ["#Cedric Blaker (1954–1958)"]}, {"page": "Peter Blaker", "response": ["Blaker was born in Hong Kong, son of Cedric Blaker. He was educated at Shrewsbury School before being evacuated to Canada in 1939. There he took a degree in classics, before being commissioned in the Canadian Army. On return to England he went to New College, Oxford. He qualified as a lawyer, and later joined the Foreign Office."]}, {"page": "Douglas Clague", "response": ["Clague was also one of the commandants of the Royal Hong Kong Auxiliary Police Force, and a member of both the Executive and the Legislative Councils of Hong Kong, when he succeeded Cedric Blaker on 21 March 1958. From 1950 to 1951 he was President of the Gunners Roll of Hong Kong."]}, {"page": "1958 Birthday Honours", "response": ["* Cedric Blaker, MC, ED, JP. For public services in Hong Kong."]}, {"page": "John Arthur Blackwood", "response": ["John Arthur Blackwood (3 November 1904 – 6 August 1973) was a British Hong Kong businessman. He was the taipan of Butterfield & Swire and chairman of Cathay Pacific Airways. Between 1954 and 1955, he was the chairman of the Hong Kong General Chamber of Commerce, replacing Cedric Blaker. He represented the Chamber of Commerce as an Unofficial member of the Legislative Council of Hong Kong from 1954 to 1955. In the Legislative Council, he strongly opposed the introduction of section 27 to the Inland Revenue Ordinance, which allowed the government (in case of doubt as to the provenance of a profit) to consider lack of overseas taxation as evidence that the profit in question arose in Hong Kong, thus becoming liable to taxation in Hong Kong. The section was repealed 27 years later as misconceived.Taxation without Representation page 140. . Michael Littlewood. Hong Kong University Press. 1 January 2010. Google Books. Alphabet. Retrieved 2017-06-19. "]}]}}