{"wiki_id": "http://www.wikidata.org/entity/Q1108688", "itemLabel": "Colin Tarrant", "itemDescription": "English actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Colin_Tarrant", "wikipedia_page": {"main": "Colin Tarrant (14 June 1952 – 26 January 2012) was an English actor best known for playing Inspector Andrew Monroe in ITV's The Bill between 1990 and 2002.", "link_mentions": [{"page": "The Railway Children", "response": ["A new stage adaptation written by Mike Kenny and directed by Damian Cruden was staged in 2008 and 2009 at the National Railway Museum, York. The adaptation starred Sarah Quintrell, Colin Tarrant and Marshall Lancaster (2008 only), and featured a Stirling Single steam locomotive (GNR 4–2–2 No.1 of 1870) which, while not actually in steam, entered the stage on the tracks originally leading into the York Goods Station, in which the 'Station Hall' section of the museum is now situated. The stage was constructed inside the large tent outside the Goods Station, which is usually reserved for some of the working locomotives of the museum. The project was set up by York Theatre Royal, and involved its younger members (Youth Theatre) in the production.York Theatre Royal production. Yorktheatreroyal.co.uk. Retrieved on 18 June 2016.British Theatre Guide review. Britishtheatreguide.info. Retrieved on 18 June 2016. This adaptation then transferred for two seasons to two disused platforms at Waterloo International railway station. The amateur rights now allow local amateur companies across the UK to produce the play. A Toronto production in 2011 was staged at Roundhouse Park, home of John Street Roundhouse National Historic Site by Mirvish Productions. A temporary 1,000-seat theatre was built at the base of the CN Tower, around the railway tracks—with the audience seated on either side—and it featured the vintage British steam locomotive No.563 of the LSWR T3 class of 1892, shipped across specially for the occasion and then used in the subsequent 2014 production at King's Cross, London."]}, {"page": "Shirebrook", "response": ["*Colin Tarrant, actor, born in Shirebrook\"Bill Legend Colin Tarrant Suicide Shock\", The People, 29 January 2012"]}, {"page": "Tarrant", "response": ["* Colin Tarrant (1952–2012), British actor"]}, {"page": "List of The Bill characters", "response": ["* Colin Tarrant played Inspector Andrew Monroe from 1990 to 2002, replacing Christine Frazer. He appeared in over 700 episodes, more than any other high-ranking uniform officer. Only Simon Rouse as Jack Meadows had more appearances by a senior officer during the series history. The character was killed in the Sun Hill explosion in 2002.", "| Andrew Monroe || Colin Tarrant || 1990-2002 || style=\"text-align:center;\"|704 || Inspector"]}, {"page": "Marshall Lancaster", "response": ["Until 23 August 2008 he starred in the York Theatre Royal's production of Mike Kenny's adaptation of The Railway Children alongside Colin Tarrant and Sarah Quintrell at the National Railway Museum."]}, {"page": "Golden Opportunity (The Bill)", "response": ["* Insp. Andrew Monroe (Colin Tarrant, 1990–2002) - Last seen in Episode 008 - Golden Opportunity, death announced in Episode 009 - No Signs of Life"]}, {"page": "History of The Bill", "response": ["Executive Producer Richard Handford left the show at the start of 2002, being replaced on a temporary basis by Chris Parr. In February, Paul Marquess became Handford's successor, changing the format of the series to a serialised, soap opera-style system; he also dropped on-screen episode titles for the first time, which did not return until 2007. Marquess had previously worked on Brookside and used similar methods to his time on that series, notably axing a large percentage of the cast including veterans Ben Roberts (Ch. Insp. Derek Conway) and Colin Tarrant (Insp. Andrew Monroe). Their characters were among ten killed off in 2002, more than the total number in the entire series history (nine between 1984 and 2001). Six of the ten characters were killed off in the 2002 station fire, which also led to a major redevelopment of the station set; the CID office was overhauled and the management offices were reduced to accommodate a Community Safety Unit (in keeping with the department's integration to the real-life Metropolitan Police). The move proved controversial but did boost ratings after a decline prior to Marquess arriving, while it allowed him to bring a wide array of new characters. Marquess was highly progressive in representing modern views, casting the first lesbian officer in PC Gemma Osbourne and the show's highest-ranking black officer in Supt. Adam Okaro, amongst others. The series also aired groundbreaking scenes such as the first gay and lesbian kisses, as well as a gay wedding in 2005."]}, {"page": "The Bill (series 18)", "response": ["The show also dropped on-screen titles for the first time in the show's history, the last of which being the episode 'Quinnan: Part 6'. That six-part plot led to the departure of long serving character, PC Dave Quinnan,  as actor Andrew Paul exited the series after 12 years. Unlike Paul, who left voluntarily, many of the early departures were enforced as Marquess dismissed a total of eight characters to make way for a major revamp of the cast as part of the move to a soap-opera style series. The longest serving dismissals were that of Andrew Monroe & Derek Conway, with both Colin Tarrant & Ben Roberts sacked after 12 & 14 years on the show, respectively. Their departure came as part of the events around the second station fire, producers following the same format as the 1990 fire by staging a fire to account for a set redevelopment. The events of the fire, which killed six cast members, were preceded by the murder of Conway in a petrol bomb attack. This led to the second major cast change on the series in as many years, following the Don Beech fiasco that saw CID disbanded in 2000. While the decision to remove a large number of long-term characters was controversial amongst die-hard fans, the dramatic scenes from the fire and its related episodes saw a rise in viewership after it dropped prior to Marquess' introduction. The series also made history by airing its first on-screen gay kiss, and while it led to some 170 complaints, they were all dismissed by the Independent Television Committee, who deemed the scene was not \"sexually explicit\"."]}, {"page": "The Bill", "response": ["* Colin Tarrant played Inspector Andrew Monroe from 1990 to 2002 when he was axed as part of a series overhaul. Appearing in 704 episodes meant no other Inspector or DI made more appearances than him."]}, {"page": "List of longest-serving soap opera actors", "response": ["|Colin Tarrant || Andrew Monroe || The Bill || 1990–2002 || years ||"]}, {"page": "Mike Kenny (writer)", "response": ["His Olivier Award-winning adaptation of The Railway Children for York Theatre Royal, has had several successful revivals at Waterloo and Kings Cross stations, as well as at the National Railway Museum. The first production, directed by Damian Cruden, starred Sarah Quintrell, Colin Tarrant, Marshall Lancaster, Elizabeth Keates, Marcus Brigstocke and featured a working Stirling Single (GNR 4-2-2 No.1) steam locomotive on a real rail track. In Canada, it won the People’s Choice Award following its record-breaking run in Toronto. Mike also won the 2015 Writers Guild Award for Best Play for Younger Audiences with Three Wise Monkeys and the Deutscher Kindertheaterpreis in 2012 with Electric Darkness. In July 2013, Mike was awarded an honorary Doctor of Letters by the University of Nottingham for his work in theatre for young people."]}, {"page": "Calendar Girls (play)", "response": ["*Colin Tarrant as John", "*Colin Tarrant as John", "*Colin Tarrant as John", "*Colin Tarrant as John"]}, {"page": "2012 in British television", "response": ["|Colin Tarrant"]}, {"page": "Deaths in January 2012", "response": ["*Colin Tarrant, 59, British actor (The Bill), suicide."]}, {"page": "2012 in the United Kingdom", "response": ["**Colin Tarrant, actor (born 1952)"]}, {"page": "The Rainbow (BBC serial)", "response": ["* Colin Tarrant as Will Brangwen"]}]}}