{"wiki_id": "http://www.wikidata.org/entity/Q1106319", "itemLabel": "Adrian Lambert", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Adrian_Lambert", "wikipedia_page": {"main": "Adrian Lambert (born 26 April 1972 in Brighton) is an English bassist and songwriter who currently plays for thrash metal band Biomechanical and progressive rock band Son of Science.  Lambert also played bass in power metal band DragonForce from 2002–2006.", "link_mentions": [{"page": "DragonForce", "response": ["DragonForce's second studio album, Sonic Firestorm, proved to be even more successful than their previous album, with the help of the album's lead single, \"Fury of the Storm\". Sonic Firestorm was the first DragonForce album to feature new bassist Adrian Lambert and drummer Dave Mackintosh. When Mackintosh entered the band in 2004, they began referring to their style of music as \"extreme power metal\" due to his fast blast beats and double bass rhythms. The tour was longer than the band's previous tour for Valley of the Damned, and featured many more headlining shows. The band toured with many well-known metal bands such as W.A.S.P. and Iron Maiden. On the album, they also added a video commentary focusing on the making of Sonic Firestorm.", "* Adrian Lambert – bass, backing vocals (2002–2005)"]}, {"page": "Sonic Firestorm", "response": ["Sonic Firestorm is the second studio album by British power metal band DragonForce, released through Noise Records on 11 May 2004. It is the first album to feature bassist Adrian Lambert and drummer Dave Mackintosh. The reissue of this album was released on 22 February 2010, along with a remixed and remastered version of the band's first album, Valley of the Damned. The re-release also came with the bonus track \"Cry of the Brave\", which was a Japanese bonus track on the original release.DragonForce: Live Playing 'Through The Roof' Since Having In-Ear Monitors ", "*Adrian Lambert – bass"]}, {"page": "List of bass guitarists", "response": ["* Adrian Lambert (Biomechanical, DragonForce)"]}, {"page": "Inhuman Rampage", "response": ["Inhuman Rampage is the third studio album by English power metal band DragonForce, released on 9 January 2006 via Noise Records. Its first single, \"Through the Fire and Flames\", has received rock radio and Fuse TV airplay, and has appeared as a playable track on the video games Guitar Hero III: Legends of Rock and Rocksmith 2014 Edition – Remastered. It is the band's first album to feature harsh vocals, which were recorded by Demoniac vocalist Lindsay Dawson; the album is also the last to feature bassist Adrian Lambert, who left the band in 2005 and was replaced by Frédéric Leclercq before the album's release.", "*Adrian Lambert – bass"]}, {"page": "Extended-range bass", "response": ["* Adrian Lambert of Biomechanical"]}, {"page": "Frédéric Leclercq", "response": ["In 2005 Leclercq joined Dragonforce as a replacement to Adrian Lambert on the Sonic Firestorm tour.  He released 7 albums with the band.  He later parted with the band due to wanting to pursue other types of music on his own.  Guitarist Herman Li once said,\" I didn't want to get Fred because he is such a phenomenal guitarist.\""]}, {"page": "Through the Fire and Flames", "response": ["* Adrian Lambert – bass"]}, {"page": "Biomechanical (band)", "response": ["*Adrian Lambert – bass (2007–present) - (formerly of Intense (UK) and DragonForce, Son of Science)"]}, {"page": "Son of Science", "response": ["Son of Science are an English progressive metal band from Brighton, England, formed by bassist Adrian Lambert after leaving UK power metal band DragonForce. The band play a technical but catchy style of metal characterised by multiple time changes, unison guitar and keyboard solos, and bone-jarring heavy riffs.", "*Adrian Lambert - Bass (2006-) (ex-Intense), ex-DragonForce, Biomechanical)"]}, {"page": "List of English people", "response": ["* Adrian Lambert (born 1976), bassist"]}, {"page": "Lambert (name)", "response": ["* Adrian Lambert (b. 1972), English bassist and songwriter"]}, {"page": "Revolution Deathsquad", "response": ["*Adrian Lambert – bass guitar"]}]}}