{"wiki_id": "http://www.wikidata.org/entity/Q1116655", "itemLabel": "Alex Maskey", "itemDescription": "Irish politician (born 1952)", "wikipedia_url": "https://en.wikipedia.org/wiki/Alex_Maskey", "wikipedia_page": {"main": "Alex Maskey (born 8 January 1952) is an Irish politician who has been Speaker of the Northern Ireland Assembly since 2020 and was the first member of Sinn Féin to serve as Lord Mayor of Belfast from 2002 to 2003. He was Sinn Féin's longest sitting councillor and is currently an MLA for Belfast West as well as being a former councillor for the Laganbank electoral area of Belfast.", "link_mentions": [{"page": "Sinn Féin", "response": ["Under Adams' leadership electoral politics became increasingly important. In 1983 Alex Maskey was elected to Belfast City Council, the first Sinn Féin member to sit on that body. Sinn Féin polled over 100,000 votes in the Westminster elections that year, and Adams won the West Belfast seat that had been held by the Social Democratic and Labour Party (SDLP). By 1985 it had fifty-nine seats on seventeen of the twenty-six Northern Ireland councils, including seven on Belfast City Council.Murray and Tonge (2005), p. 155.", "On 27 February 2005, a demonstration against the murder of Robert McCartney on 30 January 2005 was held in east Belfast. Alex Maskey, a former Sinn Féin Lord Mayor of Belfast, was told by relatives of McCartney to \"hand over the 12\" IRA members involved. The McCartney family, although formerly Sinn Féin voters themselves, urged witnesses to the crime to contact the PSNI. Three IRA men were expelled from the organisation, and a man was charged with McCartney's murder.", "By the beginning of 1985, Sinn Féin had won its first representation on local councils, owing to three by-election wins in Omagh (Seamus Kerr, May 1983) and Belfast (Alex Maskey in June 1983 and Sean McKnight in March 1984). Three sitting councillors also defected to Sinn Féin in Dungannon, Fermanagh and Derry (the last defecting from the SDLP).The three were S. Cassidy (Dungannon), J. J. McCusker (Fermanagh) and W. McCartney (Derry). Sinn Féin succeeded in winning 59 seats in the 1985 local government elections, after it had predicted winning only 40 seats. However, the results continued to show a decline from the peak of 1983, as the party won 75,686 votes (11.8%). The party failed to gain any seats in the 1986 by-elections caused by the resignation of unionist MPs in protest at the Anglo-Irish Agreement. While this was partly due to an electoral pact between unionist candidates, the SF vote fell in the four constituencies they contested."]}, {"page": "Gerry Adams", "response": ["On 30 April 2014, Adams was arrested by detectives from the Police Service of Northern Ireland (PSNI) Serious Crime Branch, under the Terrorism Act 2000, in connection with the murder of Jean McConville in 1972. He had previously voluntarily arranged to be interviewed by police regarding the matter, and maintained he had no involvement. Fellow Sinn Féin politician Alex Maskey claimed that the timing of the arrest, \"three weeks into an election\", was evidence of a \"political agenda [...] a negative agenda\" by the PSNI. Jean McConville's family had campaigned for the arrest of Adams over the murder.Sinn Fein leader Gerry Adams arrested over murder of widowed mother abducted in 1972  Jean McConville's son Michael said that his family did not think the arrest of Adams would ever happen, but were \"quite glad\" that the arrest took place. Adams was released without charge after four days in custody and it was decided to send a file to the Public Prosecution Service, which would decide if criminal charges should be brought.Sinn Féin leader Gerry Adams held over Jean McConville murder . BBC News. 30 April 2014.Shadow of Jean McConville murder still hangs over Gerry Adams and Sinn Fein  Irish Independent, 5 May 2014."]}, {"page": "Omagh bombing", "response": ["On 7 February 2008, the Northern Ireland Policing Board decided to appoint a panel of independent experts to review the police's investigation of the bombing. Some of the relatives of the bombing victims criticised the decision, saying that an international public inquiry covering both the Republic of Ireland and Northern Ireland should have been established instead. The review was to determine whether enough evidence exists for further prosecutions. and to investigate the possible perjury of two police witnesses made during Hoey's trial. Sinn Féin member of the Policing Board Alex Maskey stated that, \"Sinn Féin fully supports the families' right to call for a full cross-border independent inquiry while the Policing Board has its clear and legal obligation to scrutinise the police handling of the investigations ... We recognise that the board has a major responsibility in carrying out our duty in holding the PSNI to account in the interests of justice for the Omagh families\"."]}, {"page": "Mairead Maguire", "response": ["Alex Maskey of Sinn Féin charged that at the time of the Troubles, the Peace People movement was hijacked by the British government and used to turn public opinion against Irish republicanism. \"For me and others, the Peace People and their good intentions were quickly exploited and absorbed into British state policy,\" Maskey opined."]}, {"page": "Northern Ireland Assembly", "response": ["The Assembly is chaired by the Speaker and three Deputy Speakers, of whom one is appointed Principal Deputy Speaker. Lord Alderdice served as the first Speaker of the Assembly from July 1998, but retired in March 2004 to serve as a member of the Independent Monitoring Commission that supervised paramilitary ceasefires. The position is currently held by the Sinn Féin MLA Alex Maskey. In the Assembly, the Speaker and ten other members constitute a quorum."]}, {"page": "List of members of the 2nd Northern Ireland Assembly", "response": ["|Alex Maskey", "|Alex Maskey"]}, {"page": "Northern Ireland Policing Board", "response": ["Sinn Féin Policing Board member Alex Maskey stated that his party fully supported the families' right to call for a \"full cross-border independent inquiry\" while the Policing Board had a \"clear and legal obligation to scrutinise the police handling of the investigations.\" He also stated: \"We recognise that the board has a major responsibility in carrying out our duty in holding the PSNI to account in the interests of justice for the Omagh families.\"\"Orde to outline the extent of dissident threat\" . The Belfast Telegraph. Published 7 February 2008."]}]}}