{"wiki_id": "http://www.wikidata.org/entity/Q11107926", "itemLabel": "Jack Howlett", "itemDescription": "British mathematician and computer scientist", "wikipedia_url": "https://en.wikipedia.org/wiki/Jack_Howlett", "wikipedia_page": {"main": "Jack Howlett CBE (30 August 1912 – 5 May 1999) was a British mathematician and computer scientist who was head of the Atlas Computer Laboratory for the duration of its existence.", "link_mentions": [{"page": "Douglas Hartree", "response": ["During the Second World War Hartree supervised two computing groups. The first group, for the Ministry of Supply, has been described by Jack Howlett as a \"job shop\" for the solution of differential equations. At the outbreak of World War II, the differential analyser at the University", "(front to back: Jack Howlett, Nicholas R. Eyres, J. G. L. Michel; centre, Douglas Hartree; right Phyllis Lockett Nicolson). Problems were submitted to the group without information about the source but included the automatic tracking of targets, radio propagation, underwater explosions, heat flow in steel, and the diffusion equation later found to be for isotope separation. The second group was the magnetron research group of"]}, {"page": "John Pinkerton (computer designer)", "response": ["He edited the ICL Technical Journal between 1990 and 1996. His predecessor, Jack Howlett, commented: \"John took the task of editing the journal with great seriousness, energy, and enthusiasm, and spared no effort in ensuring that the papers for each issue... met his exacting standards for content, presentation, and written English. He was very good indeed at discussing the content and form of a possible paper with a potential author, and, with an experienced author, ... helping to sort out the essential ideas and put them in the right logical order.\" He also frequently intervened with the managers of potential authors to allocate time and recognition for this activity."]}, {"page": "Bury College", "response": ["* Jack Howlett CBE, computer scientist and director from 1961 to 1975 of the Atlas Computer Laboratory (produced many computer software innovations) (1923–30)"]}, {"page": "Atlas Computer Laboratory", "response": ["Throughout its life it was headed by Jack Howlett. Early staff or visitors included A. O. L. Atkin (1964–1970), I. J. Good (1964–1967), and Donald Michie who had worked together at Bletchley Park during the Second World War.", "* Paper by Jack Howlett on the operation of the Lab"]}, {"page": "Howlett", "response": ["* Jack Howlett, British mathematician and computer scientist"]}, {"page": "Harwell computer", "response": ["As Ted Cooke-Yarborough wrote of his design in 1953 \"a slow computer can only justify its existence if it is capable of running for long periods unattended and the time spent performing useful computations is a large proportion of the total time available\". The design was noted for its reliability because in the period from May 1952 until February 1953 it averaged 80 hours per week running time. Dr Jack Howlett, Director of the Computer Laboratory at AERE 1948–61, said it \"could be left unattended for long periods; I think the record was over one Christmas-New Year holiday when it was all by itself, with miles of input data on punched tape to keep it happy, for at least ten days and was still ticking away when we came back.\" It was the machine's untiring durability, rather than its speed, that was its main feature. Human mathematicians (a job role called a \"hand-computer\") could make calculations at a similar speed, but not continuously for the same lengths of time. Dr Howlett commented:"]}, {"page": "1969 New Year Honours", "response": ["* Jack Howlett, Director, Atlas Computer Laboratory, Science Research Council."]}, {"page": "Cluff", "response": ["* Jack Howlett as Doctor Hamm"]}, {"page": "Bibliography of E. T. Whittaker", "response": ["Whittaker's fourth major work, The Calculus of Observations a Treatise on Numerical Analysis, coauthored with George Robinson, was a pioneering textbook in numerical analysis that was originally published in 1923 and provides an introduction to methods of practical computation. The first four chapters, on interpolation, were published separately under A Short Course in Interpolation, in 1924. The book went through four total editions, with the fourth in 1944. The book received positive reviews upon its initial release. It was reviewed by William Fleetwood Sheppard, Lewis Fry Richardson, and Jack Howlett, among others. Several of the book's reviewers found that it was advanced and intended mostly for mathematicians. Some reviewers also noted that the book was the first to be devoted fully to the subject in the English language. Forty-three years after its initial publication, Jack Howlett reviewed a reprint of the fourth edition by Dover Publications in 1969 in a comparison of the book with two newer works. He wrote that \"one can hardly call it a modern book\" and noted that the book had changed relatively little since its original print in 1924 and from the lectures that Whittaker delivered at the Edinburgh Mathematical Laboratory between 1913 and 1923. He went on to remark that there are only a few useful chapters in the book concerning the calculus of finite differences and its applications, including interpolation and difference formulae, but that the rest of the book seemed \"completely outmoded\"."]}]}}