{"wiki_id": "http://www.wikidata.org/entity/Q1117505", "itemLabel": "Brian Froud", "itemDescription": "British illustrator and artist", "wikipedia_url": "https://en.wikipedia.org/wiki/Brian_Froud", "wikipedia_page": {"main": "Brian Froud (born 1947) is an English fantasy illustrator and conceptual designer. He is most widely known for his 1978 book Faeries with Alan Lee, and as the conceptual designer of the Jim Henson films The Dark Crystal (1982) and Labyrinth (1986). According to Wired, Froud is \"one of the most pre-emiminent visualizers of the world of faerie and folktale\".Froud’s most recent work has been developing the 2019 streaming television series The Dark Crystal: Age of Resistance.", "link_mentions": [{"page": "Cottingley Fairies", "response": ["The 1997 films FairyTale: A True Story and Photographing Fairies were inspired by the events surrounding the Cottingley Fairies. The photographs were parodied in a 1994 book written by Terry Jones and Brian Froud, Lady Cottington's Pressed Fairy Book."]}, {"page": "Jim Henson", "response": ["In 1982, Henson founded the Jim Henson Foundation to promote and develop the art of puppetry in the United States. Around that time, he began creating darker and more realistic fantasy films that did not feature the Muppets and displayed \"a growing, brooding interest in mortality.\" He co-directed The Dark Crystal (1982) with Frank Oz, \"trying to go toward a sense of realism—toward a reality of creatures that are actually alive\". To provide a visual style distinct from the Muppets, the puppets in The Dark Crystal were based on conceptual artwork by Brian Froud, and it was a financial and critical success."]}, {"page": "List of science fiction and fantasy artists", "response": ["*Brian Froud (born 1947) (Hugo)"]}, {"page": "Planescape", "response": ["Cook conceived of the look for the setting from images such as \"the gloomy prisons of Piranesi's Le Carceri etchings, and Brian Froud's illustrations and surrealist art\", and Dana Knutson was assigned to draw whatever Cook wanted. \"Before any of us knew it, [Knutson] drew the Lady of Pain. I'm very fond of the Lady of Pain; she really locks up the Planescape look. We all liked her so much that she became our logo."]}, {"page": "Terry Jones", "response": [";Illustrated by Brian Froud"]}, {"page": "Fairy", "response": ["Images of fairies have appeared as illustrations, often in books of fairy tales, as well as in photographic media and sculpture. Some artists known for their depictions of fairies include Cicely Mary Barker, Amy Brown, David Delamare, Meredith Dillman, Gustave Doré, Brian Froud, Warwick Goble, Jasmine Becket-Griffith, Rebecca Guay, Florence Harrison, Kylie InGold, Greta James, Alan Lee, Ida Rentoul Outhwaite, Myrea Pettit, Arthur Rackham, Suza Scalora, and Nene Thomas.", "* Brian Froud and Alan Lee, Faeries (Peacock Press/Bantam, New York, 1978)"]}, {"page": "Labyrinth (1986 film)", "response": ["Labyrinth is a 1986 musical fantasy film directed by Jim Henson, with George Lucas as executive producer, based on conceptual designs by Brian Froud. It revolves around 16-year-old Sarah (Jennifer Connelly)'s quest to reach the center of an enormous otherworldly maze to rescue her infant half-brother Toby, whom Sarah accidentally wished away to Jareth, the Goblin King (David Bowie). Most of the film's main characters are played by puppets produced by Jim Henson's Creature Shop, apart from Bowie and Connelly.", "The film's concept designer Brian Froud has stated that the character of Jareth was influenced by a diverse range of literary sources. In his afterword to the 20th anniversary edition of The Goblins of Labyrinth, Froud wrote that Jareth references \"the romantic figures of Heathcliff in Wuthering Heights and a brooding Rochester from Jane Eyre\" and The Scarlet Pimpernel. Bowie's costumes were intentionally eclectic, drawing on the image of Marlon Brando's leather jacket from The Wild One as well as that of a knight \"with the worms of death eating through his armor\" from Grimms' Fairy Tales. In his audio commentary of Labyrinth, Froud said that Jareth also has influences from Kabuki theatre.", "The film's conceptual designer Brian Froud says that Labyrinth was first discussed between himself and director Jim Henson. Both agreed to work on another project together, and Froud suggested that the film should feature goblins. On the same journey, Froud \"pictured a baby surrounded by goblins\" and this strong visual image, along with Froud's insight that goblins traditionally steal babies, provided the basis for the film's plot.", "Henson stated that, \"I wanted to put two characters of flesh and bone in the middle of all these artificial creatures, and David Bowie embodies a certain maturity, with his sexuality, his disturbing aspect, all sorts of things that characterize the adult world.\" Henson met David Bowie in the summer of 1983 to seek his involvement, as Bowie was in the U.S. for his Serious Moonlight Tour at the time. Henson pursued Bowie for the role of Jareth and sent him each revised draft of the film's script for his comments. During a meeting that took place on June 18, 1984, Henson showed Bowie The Dark Crystal and a selection of Brian Froud's concept drawings to pique his interest in the project. Bowie formally agreed to take part on February 15, 1985, several months before filming began. Bowie discussed why he was involved in the film, stating that, \"I'd always wanted to be involved in the music-writing aspect of a movie that would appeal to children of all ages, as well as everyone else, and I must say that Jim gave me a completely free hand with it. The script itself was terribly amusing without being vicious or spiteful or bloody, and it had a lot more heart in it than many other special effects movies, so I was pretty hooked from the beginning.\"", "Labyrinth opened in U.S. theaters on June 27, 1986. The film received a Royal Charity premiere at the London Film Festival on December 1, 1986, with Charles, Prince of Wales and Diana, Princess of Wales in attendance.  Jim Henson, Brian Henson, Brian Froud, Jennifer Connelly, and the animatronic creature Ludo were all present to support the film.", "The film made its DVD premiere in 1999 in the US and has since been re-released on DVD in 2003, 2007, and 2016. All DVD releases of the film feature the Inside the Labyrinth documentary as an extra. The 2003 re-release was described as a collector's edition and featured a set of exclusive collectors cards that featured concept art by Brian Froud. The 2007 release was promoted as an Anniversary Edition and featured a commentary by Brian Froud and two newly produced making-of documentaries, \"Journey Through the Labyrinth: Kingdom of Characters\" and \"Journey Through the Labyrinth: The Quest for Goblin City\" which featured interviews with producer George Lucas, choreographer Gates McFadden of Star Trek fame (listed as Cheryl McFadden), and Brian Henson.", "Several critics noted the film's subtext and found it successful to varying degrees. Saw Tek Meng of the New Strait Times acknowledged that \"Sarah's experiences in the labyrinth are symbolic of her transition from child to woman\" but ultimately found the film \"too linear\" for its latent themes to come through. The New York Times Nina Darnton compared the film's tone to the writings of E. T. A. Hoffmann, stating that Hoffman's The Nutcracker \"is also about the voyage to womanhood, including the hint of sexual awakening, which Sarah experiences too in the presence of a goblin king.\" Darton enjoyed the film and considered it more successful than Henson's previous collaboration with Brian Froud The Dark Crystal.", "Labyrinth was translated to various forms of tie-in media upon release. The Goblins of Labyrinth is a book containing Brian Froud's concept art for the film with descriptions by Terry Jones. It was published in 1986 and reissued in a deluxe expanded 20th anniversary edition in 2006. A concurrent novelization of the film was written by A. C. H. Smith which, along with Smith's novelization of The Dark Crystal, was reprinted with illustrations and Jim Henson's notes by Archaia Publishing in 2014. Marvel Comics published a three-issue comic book adaptationLabyrinth (Marvel, 1986 Series)  at the Grand Comics Database which was first released in a single volume as Marvel Super Special #40 in 1986.Marvel Super Special #40  at the Grand Comics Database The film was adapted into picture book form as Labyrinth: The Storybook, written by Louise Gikow with illustrations by Bruce McNally, and Labyrinth: The Photo Album, written by Rebecca Grand with photographs taken by John Brown from the film set. Other tie-in adaptations included a read-along storybook produced by Buena Vista Records, which came with either a 7\" 33⅓ RPM recordLabyrinth Read Along Adventure  on Discogs or cassette tape.Read Along Adventure: Labyrinth at Google Arts & Culture", "Archaia Entertainment announced that it was developing a prequel graphic novel about the story of how Jareth became the Goblin King in 2011 and in collaboration with The Jim Henson Company. Project editor Stephen Christy described the graphic novel as a \"very tragic story\" featuring a teenaged Jareth and said that it does not feature Sarah or Toby. In early stages of development, there were plans for the novel to integrate music into the plot in some way. David Bowie was approached by Archaia to seek permission to use his likeness and ascertain if he wished to have any involvement in the project. Brian Froud was set to design characters as a creative consultant on the project and produce covers for the graphic novel. The novel's official synopsis is reported to feature a young Jareth who is taken into the Labyrinth by a witch. Jareth's plot revolves around his \"attempt to rescue his true love from the clutches of the wicked and beautiful Goblin Queen.\"  The graphic novel was initially set for release at the end of 2012 but was repeatedly delayed. Its scheduled April 2014 release slot was replaced by Archaia's reissue of the Labyrinth novelization. The graphic novel remains unreleased as of 2021.", "In 2016, Brian Froud expressed that he would like to see Labyrinth adapted as a stage musical with live puppetry and special effects, remarking that it would be \"an absolute gift to do it on stage. People would come and sing the songs and dress up, I think.\" Brian Henson announced that the Jim Henson Company was working on a \"stage show, a big theatrical version\" of Labyrinth, in April 2018. He said that the production was not intended for Broadway theatre but could potentially take place on London's West End."]}, {"page": "Stardust (Gaiman novel)", "response": ["In 1999, Charles Vess' Green Man Press produced a portfolio as a benefit for Charles Vess' wife Karen, injured in a car accident, titled A Fall of Stardust, which contained two chapbooks and a series of art plates. The first chapbook, written by Gaiman, comprised  \"Wall: A Prologue\" short story, \"Septimus' Triolet\" poem, \"Song Of The Little Hairy Man\", and \"The Old Warlock's Reverie: A Pantoum\" poem. The second chapbook was a short story entitled The Duke of Wellington Misplaces His Horse by Susanna Clarke. Art plates were illustrated by William Stout, Mike Mignola, Terri Windling, Bryan Talbot, Jill Thompson, Paul Chadwick, P. Craig Russell, Mark Crilley, Elizabeth Johns, Michael Zulli, Robin Mullins, Lisa Snellings, Terry Moore, Tony DiTerlizzi, Linda Medley, Lorenzo Mattotti, Zander Cannon, Dave McKean, Jeff Smith, Trina Robbins & Steve Leialoha, Gary Gianni, Janine Johnston, Stan Sakai, Michael Kaluta, Moebius, Rebecca Guay, Geof Darrow, Brian Froud and Charles Vess. Several plates were coloured by Eric Olive. Todd Klein worked with Charles Vess to create the unique logo. Those who order this collection directly from Green Man Press received an additional art plate by Sergio Aragonés."]}, {"page": "1978 in literature", "response": ["*David Larkin (with Brian Froud and Alan Lee) – Faeries"]}, {"page": "Tinker Bell", "response": ["In addition to the illustrations in the original editions of Peter Pan, Tinker Bell has also been depicted by fantasy artists such as Brian Froud and Myrea Pettit. She also appears in the edition of Peter Pan in Scarlet illustrated by David Wyatt."]}, {"page": "The Dark Crystal", "response": ["It was marketed as a family film, but was notably darker than the creators' previous material. The animatronics used in the film were considered groundbreaking for its time, with most creatures, like the Gelflings, requiring around four puppeteers to achieve full manipulation. The primary concept artist was fantasy illustrator Brian Froud, famous for his distinctive fairy and dwarf designs. Froud also collaborated with Henson for his next project, the 1986 film Labyrinth.", "Henson's inspiration for the visual aspects of the film came around 1975–76,Fantastic Films  #32, February, 1983 after he saw an illustration by Leonard B. Lubin in a 1975 edition of Lewis Carroll’s poetry showing crocodiles living in a palace and wearing elaborate robes and jewelry.David Odell (2012), \"Reflections on Making The Dark Crystal and Working with Jim Henson\". In: Froud, B., Dysart, J., Sheikman, A. & John, L. The Dark Crystal: Creation Myths, Vol. II. Archaia. McAra, Catriona (2013) A Natural History of \"The Dark Crystal\": The Conceptual Design of Brian Froud. In: The Wider Worlds of Jim Henson. McFarland, Jefferson, pp. 101-116.Brian Froud (2003), \"A Journey into The Dark Crystal\". In: Froud, B. & Llewellyn, J. J., The World of the Dark Crystal. Pavilion Books.  The film's conceptual roots lay in Henson's short-lived The Land of Gorch, which also took place in an alien world with no human characters. According to co-director Frank Oz, Henson's intention was to \"get back to the darkness of the original Grimms' Fairy Tales\", as he believed that it was unhealthy for children to never be afraid.Peter Hartlaub, Q&A: Frank Oz on Henson, “Dark Crystal” and the Kwik Way , SFGate, (Jun 28, 2007)", "Brian Froud was chosen as concept artist after Henson saw one of his paintings in the book Once upon a time. The characters in the film are elaborate puppets, and none are based on humans or any other specific Earth creature. Before its release, The Dark Crystal was billed as the first live-action film without any human beings on screen, and \"a showcase for cutting-edge animatronics\".", "A tie-in novelization of the film was written by A. C. H. Smith. Henson took a keen interest in the novelization, as he considered it a legitimate part of the film's world rather than just an advertisement. He originally asked Alan Garner to write it, but Garner declined on account of prior engagements. Henson and Smith met several times over meals to discuss the progress of the manuscript. According to Smith, their only major disagreement had arisen over his dislike of the Podlings, which he considered \"boring\". He included a scene in which a Garthim carrying a sackful of Podlings fell down a cliff and crushed them. Henson considered this scene to be an element of \"gratuitous cruelty\" that did not fit well into the scope of the story. In order to assist Smith in his visualizing the world of The Dark Crystal, Henson invited him to visit Elstree Studios during filming. In June 2014, Archaia Entertainment reprinted the novelization, with included extras such as some of Brian Froud's illustrations and Jim Henson's notes.", "* A book entitled The World of The Dark Crystal, written and illustrated by Brian Froud, was released at the same time as the film. The book, written as the annotated translation of the Book of Aughra by fictional Oxford professor \"J.J. Llewellyn\", expands greatly on the world of \"Thra\", detailing its conditions and history, as well as providing some additional story background.", "* John Bauer (illustrator)— an inspiration for Brian Froud's work on The Dark Crystal"]}, {"page": "Alan Lee (illustrator)", "response": ["Non-Tolkien books he has illustrated include Faeries (with Brian Froud), Lavondyss by Robert Holdstock, The Mabinogion (two versions), Castles by David Day, The Mirrorstone by Michael Palin, The Moon's Revenge by Joan Aiken, and Merlin Dreams by Peter Dickinson.. Retrieved 15 July 2012. Select a title to see its linked publication history and general information. Select a particular edition (title) for more data at that level, such as a front cover image or linked contents.", "Lee worked as a conceptual designer on the films Legend, Erik the Viking, King Kong and the television mini-series Merlin. The art book Faeries, produced in collaboration with Brian Froud, was the basis of a 1981 animated feature of the same name. Executive producer Thomas W. Moore and others.", "For his 1978 book with Brian Froud, Faeries, Lee was runner-up for the fantasy Locus Award, year's best art or illustrated book."]}, {"page": "Charles de Lint", "response": ["*The Wild Wood (Brian Froud's Faerielands, Illustrated by Brian Froud) (1994)", "*The Dreaming Place (young adult, illustrated by Brian Froud) (1990)"]}, {"page": "Animatronics", "response": ["Directors such as Steven Spielberg and Jim Henson have been pioneers in using animatronics in the film industry; a film co-directed by the latter, The Dark Crystal, was promoted as the first to feature no human characters, and showcased groundbreaking puppets designed by Brian Froud and created by Henson's then recently established Creature Shop in London."]}, {"page": "Arthur Rackham", "response": ["Rackham's work influenced a number of artists. These include Gustaf Tenggren, Brian Froud, William Stout, Tony DiTerlizzi, and Abigail Larson. Froud cites the early influence of Rackham, \"in particular, [Rackham's] drawings of trees that had faces\", as sparking his interest in illustrating fairy tales, and describes having had a love of nature from childhood that has informed his style."]}, {"page": "Saturn Award for Best Costume Design", "response": ["| Brian Froud and Ellis Flyte"]}, {"page": "MirrorMask", "response": ["Polis initially spoke to both McKean and Brian Froud, the concept artist for Labyrinth and The Dark Crystal. The initial intention was to have McKean direct the film with Froud doing the designs, but Polis stated that it \"made more sense\" to have McKean do the designs seeing as he was the one directing the film. Since they had a tight budget, McKean designed creatures who were comparatively simple. He assigned entire sequences rather than tiny pieces to individual artists, so that the young professionals working on the film would have the creative opportunity to make part of it their own. He worked with them very closely in a single room. About the animators, he said that, \"All but two were straight from art school and almost all from Bournemouth. We took half the class. They all knew each other already.\" McKean says that one example of the spirit of the film is that they only had one peach during the filming of the scene where Valentine eats the future fruit. Artist Ian Miller also contributed to the designs of trees and certain other objects in the film, and also provided some of the illustrations pinned to Helena's bedroom wall."]}, {"page": "San Diego Comic-Con", "response": ["|July 19–22, 2001 ||San Diego Convention Center ||53,000 ||Brian Michael Bendis, John Buscema, Michael Chabon, Frank Cho, Julie Doucet, Brian Froud, Wendy Froud, Gene Ha, Joe R. Lansdale, Russell Myers, P. Craig Russell, Kim Stanley Robinson, Spider Robinson, Alvin Schwartz, Dan Spiegle, Jhonen Vasquez, Judd Winick, Bernie Wrightson ||"]}, {"page": "Legend (1985 film)", "response": ["The look Scott envisioned for Legend was influenced by the style of Disney animation. He had even offered the project to Disney, but they were intimidated by the film's dark tone at a time when Disney still focused on family-friendly material. Visually, Scott referenced films like Snow White and the Seven Dwarfs, Fantasia and Pinocchio. The look of Legend was also influenced by the art of Arthur Rackham and Heath Robinson.Jones 1986, p. 24. Scott had initially sought the services of conceptual designer Brian Froud, but was turned down. He then hired Alan Lee as a visual consultant, who drew some characters and sketched environments. However, Scott eventually replaced Lee with Assheton Gorton, a production designer whom he had wanted for both Alien and Blade Runner. Scott hired Gorton because he knew \"all the pitfalls of shooting exteriors on a soundstage. We both knew that whatever we did would never look absolutely real, but would very quickly gain its own reality and dispense with any feeling of theatricality\"."]}, {"page": "Kent Institute of Art & Design", "response": ["* Brian Froud, fantasy artist "]}]}}