{"wiki_id": "http://www.wikidata.org/entity/Q1115849", "itemLabel": "Jonathan Davies", "itemDescription": "Welsh rugby union footballer, and rugby league footballer and administrator", "wikipedia_url": "https://en.wikipedia.org/wiki/Jonathan_Davies_(rugby,_born_1962)", "wikipedia_page": {"main": "Jonathan Davies, OBE (born 24 October 1962) is a Welsh former rugby player who played in the 1980s and 1990s, and who represented Wales in both rugby union and rugby league. A goal-kicking backline player, he played his club rugby in Wales, England and Australia. Davies has since become a television commentator for both codes and media personality, in both the Welsh and English languages.", "link_mentions": [{"page": "October 24", "response": ["*  1962   – Jonathan Davies, Welsh rugby player and television host"]}, {"page": "Jiffy", "response": ["* Jonathan Davies (rugby, born 1962), nicknamed \"Jiffy\""]}, {"page": "David Watkins (rugby)", "response": ["Watkins was appointed Newport RFC team manager in 1992–93 and later became the club's chairman when he was awarded an MBE. In 2006 Watkins, along with Falklands War hero Simon Weston, was installed as a patron of the Welsh Rugby League at a ceremony held in the Welsh Assembly. He was managing director of the Cardiff City Blue Dragons. In 2009, Watkins took over the position of Crusaders president from Jonathan Davies."]}, {"page": "Wales national rugby union team", "response": ["Neil Jenkins was the first rugby player to surpass 1000 Test points. He holds several Welsh records, including the most points scored for Wales with 1049, the most successful penalty kicks for Wales with 248, and the Welsh record for most points in a single Test match with 30. The record for drop-goals for Wales is held by Jonathan Davies with 13.", "* 2003 – Jonathan Davies, Willie Davies, John Dawes"]}, {"page": "Question of Sport", "response": ["* Jonathan Davies, rugby union player (1998)"]}, {"page": "Wales national rugby league team", "response": ["* 27 October 1991 – Papua New Guinea met Wales at Vetch Field, Swansea. Roared on by a fervent crowd of 11,422; Wales won by a record 68–0 margin, scoring thirteen tries. In that match dual-rugby international Jonathan Davies scored 24 points from two tries and 8 goals.", "* 1995 – Wales win the European Championship, with a win over England (the first since 1968 and the biggest on Welsh soil). Mike Gregory is head coach for the 1995 World Cup. Wales make the semi-finals of the World Cup, only to lose to England 25–10 at Old Trafford in Manchester. The 1995 World Cup between Wales and Western Samoa in front of a capacity crowd of over 15,000 at Swansea was a pinnacle for Welsh Rugby League in the modern era. Following rugby union's decision to go professional, the flow of talent going north from the valleys dried up and Jonathan Davies returned to rugby union.", "| Jonathan Davies", "*2003 Jonathan Davies, Willie Davies"]}, {"page": "David Campese", "response": ["Campese was recalled to the Australian side for their final Test of the 1996 European tour, his 101st Test and his final Test appearance playing for the Wallabies. Australian coach Greg Smith returned Jason Little to the outside centre position and situated Campese on the right wing while Joe Roff occupied the left wing. Australia led Wales 18–6 at halftime. In the second half Welsh outside centre Gareth Thomas scored a try after intercepting a pass from George Gregan. Following this Welsh flyhalf Jonathan Davies kicked two penalties to give Wales a 19–18 lead. Australia's Matt Burke landed a penalty to give Australia a 21–19 lead, before Australia scored a penalty try in the final moments of the Test to win 28–19."]}, {"page": "Phil Davies", "response": ["His career is also memorable for his involvement in the so-called \"Battle of Cardiff\" in 1987, an extremely violent clash between Wales and England that saw Davies wind up on the wrong end of lock Wade Dooley's fist. Davies' first international appearance came in a 24–15 victory over England in Cardiff, a game that saw his brother-in-law, Jonathan Davies, also make his debut. England, who had not won in Cardiff since 1963, led the game 15–12, before fullback Chris Martin failed to take a high kick and Davies (Jonathan) scored a crucial try. Davies' next appearance came in a 40–3 victory against Fiji at the Arms Park, and he marked the occasion by scoring two of his side's seven tries."]}, {"page": "Crawshays RFC", "response": ["They are mainly a touring team who play fast entertaining rugby. It is regarded an honour to be invited to play for such a prestigious team. They are usually, a mix of seasoned internationals, and promising youngsters, with the occasional local player available at short notice. Many Wales rugby legends have played for them, including JPR Williams, Phil Bennett and Jonathan Davies."]}, {"page": "Crusaders Rugby League", "response": ["The season was crucial for the Crusaders, as to fulfill their aim of applying for a Super League licence for the 2009 season,Wales Online – Eyes On Future. Retrieved 30 August 2010. the team would have to be playing in the National League One in 2008, and thus had to be promoted this season.The Guardian – Crusaders Unveil New Signings. Retrieved 28 August 2010.Wales On Sunday – From Brisbane To Bridgend. Retrieved 30 August 2010. Leighton Samuel brought in his solicitor, David Thompson, as chief executive of the club to oversee the application for Super League. In January both Jace Van Dijk and John Dixon finished second in the National League Two Player of the Year and National League Two Coach of the Year categories respectively at the TotalRL Fan Awards. Just before the start of the season it was announced that Welsh former player Jonathan Davies had been appointed Honorary President of the club,South Wales Echo – Davies In League With Celts. Retrieved 30 August 2010. and that he would be attending matches throughout the year. The club also announced that they were moving their training ground to the RAF's St Athan base,Wales On Sunday – RAF Back Crusaders. Retrieved 30 August 2010. beating off competition from Cardiff City who also wanted to use the facilities;Glamorgan Gazette – Ready For The Big Time. Retrieved 30 August 2010. and that Frenchman Thibault Giroud had been appointed as new fitness coach.Glamorgan Gazette – Ready To Put Down Roots. Retrieved 30 August 2010."]}, {"page": "BBC Sport", "response": ["John Inverdale and Gabby Logan lead the BBC's rugby coverage.  Martin Johnson, Sam Warburton, Jeremy Guscott, Brian Moore, Jonathan Davies, John Barclay, Jamie Heaslip, Andy Nicol, Chris Paterson, Thomas Castaignede and Michele Campagnaro are the main pundits and co-commentators. The BBC's main commentators are Eddie Butler and Andrew Cotter. Sonja McLaughlan and Lee McKenzie are the reporters.", "The BBC shows live coverage of the Challenge Cup including both semi-finals and the final, the Four Nations and the Rugby League World Cup. Coverage is hosted by Mark Chapman and Tanya Arnold with commentary from Dave Woods, Jonathan Davies and Brian Noble. The BBC's Super League Show shows weekly highlights of the Super League, Magic Weekend, Super 8's and the Grand Final."]}, {"page": "Records and statistics of the Rugby World Cup", "response": ["| Jonathan Davies || "]}, {"page": "Doug Laughton", "response": ["Laughton coached Widnes and Leeds. Doug Laughton took over the job of team coach when Frank Myler retired from the position in 1978. Immediately, he gained from the Widnes players the same respect for his coaching that he still enjoyed for his playing ability.\"Virtual Rugby League Hall of Fame. Doug Laughton\" Retrieved on 11 Jan 2018 His first acquisition when he became coach was Mick Burke. He had three coaching spells at Widnes between 1978 and 1996. During the 1989–90 Rugby Football League season, he coached defending champions Widnes to their 1989 World Club Challenge victory against the visiting Canberra Raiders. He arrived at Leeds in 1991, and took the club to two successive Challenge Cup Finals, but was beaten by Wigan on both occasions. He surprisingly resigned at the end of the 1994–95 season. Laughton recruited the likes of Martin Offiah, Jonathan Davies, Alan Tait, and John Devereux as his Widnes side conquered England and the world in 1989.\"Widnes legend Doug Laughton reveals the moment he turned to Rugby Union\" Retrieved on 11 Jan 2018 During his first season as coach, the club gained four major trophies. More recently, they have been the only team to win three successive Premiership titles, and have become World Club Champions."]}, {"page": "1994 Kangaroo tour of Great Britain and France", "response": ["|FB ||1|| Jonathan Davies", "Despite Great Britain captain and halfback Shaun Edwards being sent-off after 25 minutes for a high shot on Australian second rower Bradley Clyde, the Lions put in another brilliant performance at Wembley and, as they had done in the first Test of the 1990 Kangaroo Tour, defeated the Kangaroos 8–4. Lions fullback Jonathan Davies, the \"Welsh Wizard\", put in a Man of the Match performance, including a 50-metre solo try in the first half after being put into a gap by Denis Betts then outpacing Australian fullback Brett Mullins to score in the corner. Davies was also a solid last line of defence, repelling many breaks by the Kangaroos, until he dived on a loose ball close to his line and was fallen on by teammate Barrie McDermott, resulting a dislocated shoulder midway through the second half saw him leave the field and later be ruled him out for the rest of the series as well as Wales' game against the Kangaroos before the second Ashes test.", "Although they were also without their superstar and inspirational captain Jonathan Davies who had dislocated his right shoulder in the first Ashes Test just 8 days earlier at Wembley, the Welsh team still boasted plenty of international rugby league experience with players like Phil Ford, Anthony Sullivan, John Devereux, Kevin Ellis, Jonathan Griffiths, Paul Moriarty and Rowland Phillips. In Davies' absence, the Dragons were captained by front row forward Dai Young. For the Australian's, only Greg Florimo had yet to play test football."]}, {"page": "S4C Chwaraeon", "response": ["* Jonathan Davies"]}, {"page": "Alun Wyn Jones", "response": ["In 2019 Jones captained Wales in their Grand Slam victory and was named Player of the Championship in a public vote. It was later established that Jones suffered knee ligament damage early in the Grand Slam decider against Ireland. Following the game, he was referred to by Jonathan Davies and others as \"the greatest ever\" Welsh rugby player."]}]}}