{"wiki_id": "http://www.wikidata.org/entity/Q1113742", "itemLabel": "Clare Hollingworth", "itemDescription": "British journalist", "wikipedia_url": "https://en.wikipedia.org/wiki/Clare_Hollingworth", "wikipedia_page": {"main": "Clare Hollingworth, OBE (10 October 1911 – 10 January 2017) was an English journalist and author. She was the first war correspondent to report the outbreak of World War II, described as \"the scoop of the century\". As a rookie reporter for The Daily Telegraph in 1939, while travelling from Poland to Germany, she spotted and reported German forces massed on the Polish border; The Daily Telegraph headline read: \"1,000 tanks massed on Polish border \"; three days later she was the first to report the German invasion of Poland.Hollingworth was appointed OBE by Elizabeth II for \"services to journalism\" in 1982. She died on 10 January 2017 at the age of 105.\n\n", "link_mentions": [{"page": "Irgun", "response": ["Clare Hollingworth, the Daily Telegraph and The Scotsman correspondent in Jerusalem during 1948 wrote several outspoken reports after spending several weeks in West Jerusalem:"]}, {"page": "Journalism", "response": ["Described as \"the scoop of the century\", as a rookie journalist for The Daily Telegraph in 1939 Clare Hollingworth was the first to report the outbreak of World War II. While travelling from Poland to Germany, she spotted and reported German forces massed on the Polish border; The Daily Telegraph headline read: \"1,000 tanks massed on Polish border \"; three days later she was the first to report the German invasion of Poland.\"Clare Hollingworth, Reporter Who Broke News of World War II, Dies at 105\", The New York Times, 10 January 2017 "]}, {"page": "January 10", "response": ["*  2017   – Clare Hollingworth, English journalist (b. 1911)"]}, {"page": "Mao Zedong", "response": ["Having grown up in Hunan, Mao spoke Mandarin with a marked Hunanese accent. Ross Terrill wrote Mao was a \"son of the soil ... rural and unsophisticated\" in origins, while Clare Hollingworth said that Mao was proud of his \"peasant ways and manners\", having a strong Hunanese accent and providing \"earthy\" comments on sexual matters. Lee Feigon said that Mao's \"earthiness\" meant that he remained connected to \"everyday Chinese life.\""]}, {"page": "October 10", "response": ["*1911 – Clare Hollingworth, English journalist and author (d. 2017)"]}, {"page": "1911", "response": ["* October 10 – Clare Hollingworth, English journalist (d. 2017)"]}, {"page": "Helen Hunt", "response": ["In The Miracle Season (2018), based on the true story of the Iowa City West High School volleyball team, Hunt played Kathy Bresnahan, a volleyball coach. In 2019, Hunt appeared in the BBC series World on Fire as journalist Nancy Campbell, a character inspired by real-life war correspondent Clare Hollingworth, and reprised the role of Jamie Buchman in the Mad About You revival, which premiered in the form of a limited series, by Spectrum Originals."]}, {"page": "2017", "response": ["** Clare Hollingworth, English journalist and author (b. 1911)"]}, {"page": "Knighton, Leicester", "response": ["*Clare Hollingworth: journalist and first person to alert the world that World War II had started"]}, {"page": "War correspondent", "response": ["*Clare Hollingworth; covered World War II, Algerian War, Vietnam War, Bangladesh Liberation War (1971)."]}, {"page": "UCL School of Slavonic and East European Studies", "response": ["*Clare Hollingworth (Croatian), journalist"]}, {"page": "Ashby School", "response": ["* Clare Hollingworth, journalist"]}, {"page": "Luo Yixiu", "response": ["In Mao: A Reinterpretation, American historian Lee Feigon argued that Mao's experience with arranged marriage inspired him to become \"a vehement advocate of women's rights\" in the late 1910s, as he began to write articles for the left-wing press criticizing the traditional Chinese family system and arguing that love, rather than societal or family pressures, should be the primary determinant in marriage. This idea had previously been expressed by journalist and sinologist Clare Hollingworth. In their biography Mao: The Unknown Story, Jung Chang and Jon Halliday agreed, stating that it was this experience with Luo that turned Mao into a \"fierce opponent\" of arranged marriage."]}, {"page": "Melton (UK Parliament constituency)", "response": ["*Labour: Clare HollingworthReport of the Annual Conference of the Labour Party, 1939"]}, {"page": "Diamond industry in Israel", "response": ["Between 1944 and 1948 the industry suffered from the increasing lawlessness and in February 1948 closed down completely.The Scotsman, March 8th 1948: 'Clare Hollingworth, Jerusalem, by Air Mail : One of the biggest casualties of the Palestine civil war occurred last month in a veil of obscurity. The entire Jewish-owned diamond polishing industry of Palestine, which had grown during the war to be the second largest in the world after that of Holland, was closed down. It is considered unlikely that the industry, which in 1946 exported £5,501,000 worth of cut diamonds, mostly to the United States, will reopen again on anything like its former scale. Four official reasons are given for ‘suspending work’. The first is that 2500 workers in 34 diamond-cutting plants walked out as a result of ‘hold-ups by dissident underground organisations.’ Secondly, Mr O. Ben-Ami, president of the Diamond Manufacturing Association, states that £200,000 of diamonds have been stolen since 1944. The third reason is that insurance companies, after raising diamond insurance rates for Palestine to 12 per cent. recently declined cover altogether. Fourthly, the Palestine Post Office no longer accepts registered mail. The fate of the diamond industry illustrates the twin dangers which threaten the whole of the new industrial system which the Zionists have built up rapidly in Palestine in recent years, and on which many Zionist economists based their hopes for the livelihood of a future Jewish state. The dangers are the dislocation caused by the guerrilla struggle waged by Jewish extremists, which has now developed into an economically paralysing civil war, and the post-war revival of international trade at competitive prices, which has revealed the shaky basis of wartime expansion of Zionist industry.'"]}, {"page": "1911 in the United Kingdom", "response": ["* 10 October – Clare Hollingworth, journalist (died 2017)"]}, {"page": "List of people from Leicester and Leicestershire", "response": ["*Clare Hollingworth (foreign correspondent)"]}, {"page": "Women in journalism", "response": ["* Clare Hollingworth, OBE (1911–2017), first war correspondent to report the outbreak of World War II"]}, {"page": "List of World War II war correspondents (1942–43)", "response": ["*Clare Hollingworth, Daily Express, Chicago Daily News"]}, {"page": "The Guardian", "response": ["* Clare Hollingworth"]}, {"page": "The Daily Telegraph", "response": ["The Telegraph has been the first newspaper to report on a number of notable news scoops, including the outbreak of World War II by rookie reporter Clare Hollingworth, described as \"the scoop of the century\", the 2009 MP expenses scandalwhich led to a number of high-profile political resignations and for which it was named 2009 British Newspaper of the Yearand its 2016 undercover investigation on the England football manager Sam Allardyce.", "In 1937, the newspaper absorbed The Morning Post, which traditionally espoused a conservative position and sold predominantly amongst the retired officer class.  Originally William Ewart Berry, 1st Viscount Camrose, bought The Morning Post with the intention of publishing it alongside The Daily Telegraph, but poor sales of the former led him to merge the two. For some years, the paper was retitled The Daily Telegraph and Morning Post before it reverted to just The Daily Telegraph.  In the late 1930s, Victor Gordon Lennox, The Telegraphs diplomatic editor, published an anti-appeasement private newspaper The Whitehall Letter that received much of its information from leaks from Sir Robert Vansittart, the Permanent Under-Secretary of the Foreign Office, and Rex Leeper, the Foreign Office's Press Secretary.Watt, Donald Cameron \"Rumors as Evidence\" pages 276–286 from Russia War, Peace and Diplomacy edited by Ljubica & Mark Erickson, London: Weidenfeld & Nicolson, 2004 page 278. As a result, Gordon Lennox was monitored by MI5. In 1939, The Telegraph published Clare Hollingworth's scoop that Germany was to invade Poland."]}, {"page": "Paul K. Joyce", "response": ["Joyce co-executive produced a feature film script based on Non-Stop, the science fiction novel by Brian Aldiss. He is currently co-developing an adaptation of the life story of war correspondent, Clare Hollingworth, known for scooping the beginning of the Second World War in 1939. Joyce has also written a new contemporary musical work entitled, Celestial. Based on the poems of the late Johnnie Douglas-Pennant, this work is narrated by actor Michael Sheen and features Steve Howe on guitar and soundscapes by Chris Watson. Howe then asked him to do orchestrations on Yes's new album The Quest.http://www.pkjmusic.com/dreams-can-come-true/"]}, {"page": "List of centenarians (authors, editors, poets and journalists)", "response": ["|Clare Hollingworth || 1911–2017 || 105 || British journalist, first correspondent to report on World War II"]}, {"page": "List of Desert Island Discs episodes (1991–2000)", "response": ["|||Clare Hollingworth||History of England by G. M. Trevelyan||Paper and pens (with thick nibs)|| more"]}, {"page": "Israel Diamond Exchange", "response": ["The first diamond cutting facility in the country was opened in 1937, during the British Mandate. The industry grew over the next seven years, but between 1944 and 1948 it suffered from the increasing lawlessness and in February 1948 closed down completely, with seemingly little chance of recovery.The Scotsman, March 8th 1948: 'Clare Hollingworth, Jerusalem, by Air Mail : One of the biggest casualties of the Palestine civil war occurred last month in a veil of obscurity. The entire Jewish-owned diamond polishing industry of Palestine, which had grown during the war to be the second largest in the world after that of Holland, was closed down. It is considered unlikely that the industry, which in 1946 exported £5,501,000 worth of cut diamonds, mostly to the United States, will reopen again on anything like its former scale. Four official reasons are given for ‘suspending work’. The first is that 2500 workers in 34 diamond-cutting plants walked out as a result of ‘hold-ups by dissident underground organisations.’ Secondly, Mr O. Ben-Ami, president of the Diamond Manufacturing Association, states that £200,000 of diamonds have been stolen since 1944. The third reason is that insurance companies, after raising diamond insurance rates for Palestine to 12 per cent. recently declined cover altogether. Fourthly, the Palestine Post Office no longer accepts registered mail. The fate of the diamond industry illustrates the twin dangers which threaten the whole of the new industrial system which the Zionists have built up rapidly in Palestine in recent years, and on which many Zionist economists based their hopes for the livelihood of a future Jewish state. The dangers are the dislocation caused by the guerrilla struggle waged by Jewish extremists, which has now developed into an economically paralysing civil war, and the post-war revival of international trade at competitive prices, which has revealed the shaky basis of wartime expansion of Zionist industry.'"]}, {"page": "SS Empire Cross", "response": ["The noted correspondent Clare Hollingworth, at the time reporting from Palestine to the News of the World, asserted that the Empire Cross was indeed blown up by the Haganah. A few days later a spokesperson for the Haganah phoned the paper and hotly denied the charge, accusing Hollingworth of being \"biased and motivated by hatred\".Quoted in \"The Prison Letters of Moshe Sharet\" (in Hebrew) ["]}, {"page": "The Mare's Nest", "response": ["The book was well received at the time by reviewers. Writing in The Economist, William Kimber called it \"remarkable\" for its coverage of both sides, Allied and German. He concluded that the book shows that the British reached the right conclusions, despite errors along the way, while the Germans hindered their own efforts with disputes between the army, air force, SS and civilian ministers. The Times noted that the book highlighted how the hunt for the V-weapons was punctuated by \"conflicts of personality between scientists, intelligence officers, and Service leaders\", while at the same time conveying \"the efficiency of the British Intelligence Services at the lower level\" even if the higher-level co-ordination was sometimes lacking. The Guardian's Clare Hollingworth noted that the book \"provides some excellent quotations from intelligence documents, both British and German, as well as sketches of Peenemünde and of the [V-2 rocket]\" and suggested that \"perhaps scientists or soldiers engaged in rocketry\" would find it useful."]}, {"page": "Hollingworth (surname)", "response": ["* Clare Hollingworth (1911–2017), British journalist and author"]}]}}