{"wiki_id": "http://www.wikidata.org/entity/Q11117499", "itemLabel": "Gordon Harris", "itemDescription": "English cricketer (born 1964)", "wikipedia_url": "https://en.wikipedia.org/wiki/Gordon_Harris_(English_cricketer)", "wikipedia_page": {"main": "Gordon Andrew Robert Harris (born 11 January 1964) is a former English cricketer. Harris was a right-handed batsman who bowled right-arm fast-medium. He was born in Tottenham, Middlesex and educated at Merchant Taylors' School and Leicester Polytechnic.Harris made his only first-class appearance for Leicestershire in the 1986 County Championship against Worcestershire. Following this match he appeared in his only List A game for the county against Worcestershire at New Road. He joined Bedfordshire in 1988, making his debut for the county against Lincolnshire in the Minor Counties Championship. He played Minor counties cricket for Bedfordshire in 1988 and 1989, making twelve Minor Counties Championship and three MCCA Knockout Trophy appearances.In 1990, Harris joined Hertfordshire, making his debut for the county against Northumberland in the Minor Counties Championship. He played Minor counties cricket for Hertfordshire from 1990 to 1993, making 17 Minor Counties Championship and eleven MCCA Knockout Trophy appearances. He made his first List A appearance for the county in the 1990 NatWest Trophy against Warwickshire. He made two further List A appearances for Hertfordshire, against Warwickshire in the 1991 NatWest Trophy and Gloucestershire in the 1993 NatWest Trophy. He took 2 wickets in these three games, which came at an average of 58.00, with best figures of 3/32. In 1994, he joined Middlesex, making two first-class appearances for the county against Glamorgan and Surrey. He claimed his only first-class wicket in the match against Glamorgan, that of David Hemp. He also made three List A appearances for Middlesex in the 1994 AXA Equity & Law League, taking 6 wickets at an average of 16.83, with best figures of 5/26. These figures came against Northamptonshire. His cricket career came to an end after the 1994 season.\nHe also played field hockey to county level.Gordon's youngest son, Ben Harris, is part of the GB Rugby Sevens Team that have placed 4th in the Tokyo 2020 Olympics.", "link_mentions": [{"page": "Merchant Taylors' School, Northwood", "response": ["* Gordon Harris (born 1964) – Cricketer"]}, {"page": "Gordon Harris", "response": ["Gordon Harris may refer to:", "* Gordon Harris (footballer, born 1940) (1940–2014), English footballer", "* Gordon Harris (footballer, born 1945), Scottish footballer", "* Gordon Harris (actor) (1918–1965), English actor", "* Gordon Harris (urban planner), Canadian urban planner", "* Gordon Harris (Australian cricketer) (1897-1974), Australian cricketer", "* Gordon Harris (English cricketer) (born 1964), former English cricketer", "* Gordon Harris (Canadian politician)"]}, {"page": "List of Hertfordshire County Cricket Club List A players", "response": ["*Gordon Harris (1990–1993): GAR Harris"]}]}}