{"wiki_id": "http://www.wikidata.org/entity/Q1111131", "itemLabel": "John Hassall", "itemDescription": "English musician, songwriter", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Hassall_(musician)", "wikipedia_page": {"main": "John Cory Hassall (born in Westminster, London) is an English musician and bassist for The Libertines. He now performs with his own band The April Rainers. Previously, he formed the band Yeti.", "link_mentions": [{"page": "The Libertines", "response": ["The Libertines are an English rock band, formed in London in 1997 by frontmen Carl Barât (vocals/guitar) and Pete Doherty (vocals/guitar). The band, centred on the songwriting partnership of Barât and Doherty, has also included John Hassall (bass) and Gary Powell (drums) for most of its recording career. The band was part of the garage rock revival and spearheaded the movement in the UK.", "They formed a band with their neighbour Steve Bedlow, commonly referred to as \"Scarborough Steve,\" and named themselves \"The Strand\", later discarded for \"The Libertines\" after the Marquis de Sade's Lusts of the Libertines (\"The Albions\" was also considered, but rejected; Albion is an archaic name for Britain). They later met John Hassall and Johnny Borrell, who played bass with the Libertines for a short period. Many of their early gigs took place in the flat shared by Doherty and Barât.", "* John Hassall – bass (1999–2000, 2001–2004, 2010, 2014–present)"]}, {"page": "Carl Barât", "response": ["In 1996, Barât was studying for a drama degree at Brunel University at the campus in St. Margarets, Twickenham. Although he dropped out halfway through, during his time he became well-acquainted with Pete Doherty's sister, Amy-Jo and through her, Barât met Doherty. They soon developed an intense friendship based on a shared interest in music and songwriting. Barât and Doherty also developed a shared mythology in which they were on a ship called 'The Albion' sailing to 'Arcadia'. After both dropped out of university, they formed The Libertines. The band in its final incarnation included bassist John Hassall and drummer Gary Powell. Barât and Doherty were co-frontmen, sharing songwriting, vocal and guitar duties.", "On 15 May 2009, Barât, Doherty and Powell of the Libertines played on stage together for the first time since the split in 2004. The Libertines (minus Denmark-residing bassist John Hassall) came together for a tribute gig for their late promoter, Johnny Sedassy. The six song set, which included \"What a Waster\", \"Up the Bracket\" and \"Death on the Stairs\", was played after Babyshambles appeared on stage. Barât explained that the show was a 'one off', although he admitted that the likelihood of more shows could not be ruled out. Barât also expressed his desire to get on stage with Doherty again, although perhaps not until 2010. Powell also confirmed that he'd be interested in a full reunion, although he wished to \"readdress old ghosts first\".[NME, 30 May 2009, Page 13]"]}, {"page": "Johnny Borrell", "response": ["Through his friendship with schoolmate John Hassall, at Highgate School, Borrell was involved in the early formation of The Libertines. He was present at the sessions for their debut album Up The Bracket and appears as a character in songs, notably \"Boy Looked at Johnny\" and \"Death on the Stairs\", and also \"What a Waster\" which appeared as a bonus track on the album in Japan.", "Borrell is one of \"The Dalston Set\", a clique of indie notables connected to the early days of The Libertines, along with Dominic Masters of The Others, Pete Doherty, Carl Barât, John Hassall, and the Queens of Noize. It has been reported that he was briefly a stand-in bassist for The Libertines before they were signed, but in recent interviews he has claimed that this is not true; however, in Pete Welsh's Kids in the Riot, it is alleged that Borrell was sacked as The Libertines' bassist for unreliable behaviour. In general though there is little animosity between the two bands, and Borrell remains friends with Carl Barât. The Libertines' song \"The Boy Looked at Johnny\" is reputedly about Borrell, and Razorlight's \"Don't Go Back To Dalston\" is reputedly directed at Pete Doherty, telling him to curtail his drug habit."]}, {"page": "List of bass guitarists", "response": ["* John Hassall (The Libertines)"]}, {"page": "Yeti (band)", "response": ["Yeti were an English rock band, founded in 2004 by John Hassall, of The Libertines. Hassall met Brendan Kersey, Andrew Deian and Mark Underwood (formerly Harmony Williams) through mutual friends, and the line-up was completed when drummer Graham Blacow responded to a classified advertisement.  The band is based in North London."]}, {"page": "Camden School for Girls", "response": ["*John Hassall (born 1981), musician, The Libertines"]}, {"page": "John Hassall", "response": ["John Hassall may refer to:", "*John Hassall (musician) (born 1981), English bassist", "*John Hassall (illustrator) (1868–1948), English poster artist", "*John Hassall, chairman of Sheffield United F.C., an English football club"]}, {"page": "John Hassell (English musician)", "response": ["#REDIRECT John Hassall (musician)"]}, {"page": "One Eye on the Banquet", "response": ["Tracks 2 & 4 were written by John Hassall.", "Lianne Steinberg of Drowned in Sound said John Hassall's performance on One Eye on the Banquet was completely different in comparison to his previous time in The Libertines."]}, {"page": "John Hassell (english musician)", "response": ["#REDIRECT John Hassall (musician)"]}, {"page": "Yume!", "response": ["Yume! is a compilation album of UK band Yeti, released on August 29, 2007 by Japanese indie record label, Vinyl Junkie. Most of the tracks had been previously released in the United Kingdom on singles or the EP, \"One Eye on the Banquet\".Tracks 1, 3, 4, 6, 8 and 10 written by John Hassall.2, 5, 7 and 11 by Mark Underwood.9 and 12 by Andrew Déian."]}, {"page": "The Libertines discography", "response": ["The discography of the Libertines, a London-based indie rock band, consists of three studio albums, four extended plays (EPs), one compilation album, six singles and six music videos. Formed in 1997, the Libertines consisted of Pete Doherty (vocals/rhythm guitar), Carl Barât (vocals/lead guitar), John Hassall (bass) and Gary Powell (drums)."]}, {"page": "East End Film Festival", "response": ["For the festival's 10th anniversary in 2011, it looked back on the story of east London with a programme of screenings and events featuring more than sixty feature films and hundreds of shorts, alongside a broad range of live, site-specific events and master classes. The festival opened on 27 April with the World Premiere gala screening of Roger Sargent's The Libertines: There Are No Innocent Bystanders  Frequently described as the UK's most important music photographer, Roger Sargent's debut feature is an all-access documentary that followed Carl Barat, Pete Doherty, John Hassall and Gary Powell for The Libertines' reunion in 2010. The East End Film Festival also offered the UK's second-ever screening of Ken Russell’s highly controversial 1971 film The Devils (film). EEFF 2011 saw the launch of Movie May Day, a May Bank Holiday weekend cornucopia of film and culture with hundreds of free screenings, projections, live music, quizzes, filmmaking competitions, and site-specific installations across the East End"]}]}}