{"wiki_id": "http://www.wikidata.org/entity/Q11203370", "itemLabel": "Griffith Jones", "itemDescription": "British film, stage and television actor (1909-2007)", "wikipedia_url": "https://en.wikipedia.org/wiki/Griffith_Jones_(actor)", "wikipedia_page": {"main": "Griffith Jones (born Harold Jones; 19 November 1909 – 30 January 2007) was an English film, stage and television actor.", "link_mentions": [{"page": "Jean Anouilh", "response": ["* The Cavern (La Grotte). Strand Theatre, London: 11 November 1965. Directed by Donald McWhinnie. With Alec McCowen, Siobhan McKenna, Griffith Jones, Gemma Jones."]}, {"page": "Michael Rennie", "response": ["He followed this in another movie with Lockwood at Gainsborough, the sensual costume adventure The Wicked Lady (both 1945). Rennie was the fifth lead, beneath Lockwood, James Mason, Patricia Roc and Griffith Jones. but it was a good part (the one true love of Lockwood's character) and an excellent project to be associated with – the year's biggest box-office hit, subsequently being listed ninth on a list of top ten highest-grossing British films of all time."]}, {"page": "Pericles, Prince of Tyre", "response": ["* Ron Daniels directed the play in 1979 at The Other Place, an unlikely venue for such an expansive play. Daniels compensated for the lack of space by canny use of lighting and offstage music and sound effects. Peter McEnery played Pericles; Julie Peasgood was Marina. Griffith Jones was Gower."]}, {"page": "Blithe Spirit (play)", "response": ["An American television adaptation was broadcast in 1946, with Philip Tonge as Charles, Carol Goodner as Ruth, Leonora Corbett as Elvira and Estelle Winwood as Madame Arcati. \"Blithe Spirit\", IMDb, retrieved 19 March 2014 In Britain, BBC television broadcast a production in 1948, directed by George More O'Ferrall, with Frank Lawton as Charles, Marian Spencer as Ruth, Betty Ann Davies as Elvira and Beryl Measor reprising her stage role of Madame Arcati.\"Blithe Spirit\", British Film Institute, retrieved 19 March 2014 Coward directed a 14 January 1956, live American television adaptation for the Ford Star Jubilee series, in which he also starred as Charles, with Claudette Colbert as Ruth, Lauren Bacall as Elvira and Mildred Natwick as Madame Arcati.Lesley, pp. 348–349 A British commercial television adaptation in 1964 was directed by Joan Kemp-Welch, with Griffith Jones as Charles, Helen Cherry as Ruth, Joanna Dunham as Elvira and Hattie Jacques as Madame Arcati.A Choice of Coward No 2 – Blithe Spirit, British Film Institute, retrieved 19 March 2014 Another American television TV production was presented in 1966 on the Hallmark Hall of Fame, with Dirk Bogarde as Charles, Rachel Roberts as Ruth, Rosemary Harris as Elvira and Ruth Gordon as Madame Arcati.\"Blithe Spirit\", IMDb, retrieved 19 March 2014"]}, {"page": "Miranda (1948 film)", "response": ["Miranda is a 1948 black and white British comedy film, directed by Ken Annakin and written by Peter Blackmore, who also wrote the play of the same name from which the film was adapted. The film stars Glynis Johns, Googie Withers, Griffith Jones, Margaret Rutherford, John McCallum and David Tomlinson. Denis Waldock provided additional dialogue. Music for the film was played by the London Symphony Orchestra, conducted  by Muir Mathieson.  The sound director was B. C. Sewell.", "* Griffith Jones as Dr Paul Martin "]}, {"page": "Gemma Jones", "response": ["Jones was born in Marylebone, the daughter of Irene (née Isaac; 1911–1985) and Griffith Jones, an actor (1909–2007). Her brother Nicholas Jones is also an actor. She attended the Royal Academy of Dramatic Art,Gemma Jones Biography – Yahoo! Movies where she won the gold medal.Radio Times, p.6, 10–16 July 1971."]}, {"page": "The Wicked Lady", "response": ["Caroline (Patricia Roc) invites her beautiful, green-eyed friend Barbara (Margaret Lockwood) to her wedding to wealthy landowner and local magistrate Sir Ralph Skelton (Griffith Jones). The scheming Barbara soon has Sir Ralph entranced. Caroline, wishing his happiness, stands aside, and even allows Barbara to persuade her to be her maid of honour so as to lessen the scandal of the abrupt change of brides. At the wedding reception, Barbara meets a handsome stranger, Kit Locksby (Michael Rennie). It is love at first sight for both, but too late.", "*Griffith Jones as Sir Ralph Skelton"]}, {"page": "Doomwatch", "response": ["Cast: John Paul as Dr Spencer Quist, Simon Oates as Dr John Ridge, Robert Powell as Tobias Wren, Joby Blanshard as Colin Bradley, Wendy Hall as Pat Hunnisett, Griffith Jones as Falkner, Michael Ripper as Reid, Brian Cox as Owen, Derrick O'Connor as Operator, Peter Miles as Cook, Tessa Shaw as Mrs. Reid, Sheila Sands as Stripper. "]}, {"page": "An Ideal Husband", "response": ["The BBC has broadcast seven radio adaptations since its first, in 1926: a 1932 version starring Leslie Perrins and Kyrle Bellew; a radio version of the 1943 Westminster Theatre production; a Bristol Old Vic version in 1947 featuring William Devlin, Elizabeth Sellars, Catherine Lacey and Robert Eddison; a 1950 production with Griffith Jones, Fay Compton and Isabel Jeans; a 1954 version produced by Val Gielgud; a 1959 adaptation starring Tony Britton and Faith Brook; a 1970 version with Noel Johnson, Ronald Lewis, Jane Wenham and Rosemary Martin; and a 2007 adaption with Alex Jennings, Emma Fielding, Janet McTeer and Jasper Britton.\"An Ideal Husband\", BBC Genome. Retrieved 16 April 2021"]}, {"page": "A Woman of No Importance", "response": ["The play has been adapted for the cinema in at least four versions: British (1921), German (1936), French (1937) and Argentine (1945). The BBC has broadcast six adaptations of the play: one for television (1948) and five for radio (1924, 1949, 1955, 1960 and 1992).\"A Woman of No Importance\", BBC Genome. Retrieved 15 April 2021 A 1960 television adaptation broadcast by Independent Television starred Griffith Jones and Gwen Watford as Illingworth and Mrs Arbuthnot.\"A Woman of No Importance (1960)\", British Film Institute. Retrieved 15 April 2021"]}, {"page": "Griffith Jones", "response": ["Griffith Jones may refer to:", "*Griffith Jones (Llanddowror) (1684–1761), Llanddowror, who established circulating schools in Wales", "**Ysgol Griffith Jones, Carmarthenshire, UK, a school named after the educator", "*Griffith Jones (mayor), appointed to the Supreme Court of Pennsylvania in 1690, later Mayor of Philadelphia", "*Griffith Jones (actor) (1909–2007), actor, who played Caryl Sanger in the film Escape Me Never (1935)", "*Griffith Jones (priest) (1684–1761), Welsh Anglican priest who promoted Methodism"]}, {"page": "List of people associated with University College London", "response": ["* Griffith Jones, actor"]}, {"page": "Play of the Month", "response": ["|Maxine Audley,Griffith Jones,Richard Leech,Gerald Sim,Richard Vernon,Llewellyn Rees,David Garth,John Bryans,Iréna Mayeska,Alan Haywood,John Baker"]}, {"page": "They Made Me a Fugitive", "response": ["* Griffith Jones as Narcy"]}, {"page": "Nicholas Jones (actor)", "response": ["Jones was born in London, the younger brother of actress Gemma Jones. They are the children of actor Griffith Jones (1909–2007) and Robin Isaac. He was educated at Westminster School."]}, {"page": "Fall of Eagles", "response": ["*Griffith Jones – Hintze"]}, {"page": "The Lotus Eaters (TV series)", "response": ["| colspan=2                  | Griffith Jones"]}, {"page": "A Yank at Oxford", "response": ["A cocky American athlete named Lee Sheridan (Robert Taylor) receives a scholarship to attend Cardinal College, University of Oxford in 1937. At first, Lee is reluctant to go to the college owing to his father, Dan's, (Lionel Barrymore) limited income, but he finally does attend. Once in England, Lee brags about his athletic triumphs to Paul Beaumont (Griffith Jones), Wavertree (Robert Coote), and Ramsey (Peter Croft) on the train to Oxford. Annoyed, they trick Lee into getting off the train at the wrong stop. Lee, however, does make his way to Oxford where the students attempt to trick him again, this time into thinking that he is getting a grand reception. Seeing through the deception, he follows the prankster impersonating the Dean and after chasing him is thrown off and ends up kicking the real Dean of Cardinal (Edmund Gwenn) before retreating. This begins a contentious relationship between them when Lee reports to apologize.", "* Griffith Jones as Paul Beaumont"]}, {"page": "List of alumni of the Royal Academy of Dramatic Art", "response": ["*Griffith Jones (Acting Diploma 1932)"]}, {"page": "Quadrille (play)", "response": ["After a provincial tour beginning at the Manchester Opera House on 15 July 1952, the play opened at the Phoenix Theatre in London on 12 September 1952 and ran until 27 June 1953.\"Theatres\", The Times, 13 September 1952, p. 2 and 27 June 1953, p. 2 The play starred Coward's friends Lynn Fontanne and Alfred Lunt, with Griffith Jones, Marian Spencer and Sylvia Coleridge. The costumes and scenery were by Cecil Beaton and the play was directed by the author. It was fairly successful, running for 329 performances, but failed to match the outstanding popularity of his biggest pre-war hits.Lesley, pp. 314, 370 and 361Lahr, p. 136", "*The Marquess of Heronden (Hubert) – Griffith Jones"]}, {"page": "The Rake's Progress (film)", "response": ["* Griffith Jones as Sandy Duncan"]}, {"page": "2007 in the United Kingdom", "response": ["* 30 January – Griffith Jones, actor (born 1910)"]}, {"page": "Deaths in January 2007", "response": ["*Griffith Jones, 97, British actor."]}, {"page": "2007 in Wales", "response": ["*30 January - Griffith Jones, actor, 97"]}, {"page": "1909 in the United Kingdom", "response": ["* 19 November – Griffith Jones, actor (died 2007)"]}, {"page": "Richard of Bordeaux", "response": ["For BBC radio, Griffith Jones played the young King in 1946. Probably because its brand of 1930s pacifism became discredited as appeasement, the play is rarely revived. However, Laurence Payne played the King at the old theatre at Guildford after the War, when Kenneth Williams was John Maudelyn. Gielgud himself reprised his stage role at the microphone in 1941 and 1952. Some of the latter broadcast can be heard on a commercially released recording of Gielgud's audio work. Martin Jarvis was well-received as Richard in a 1974 radio production. Gielgud wrote a letter of congratulation to Jarvis on his performance."]}, {"page": "1910 in the United Kingdom", "response": ["* 19 November – Griffith Jones, actor (died 2007)"]}, {"page": "The Rise of Catherine the Great", "response": ["*Griffith Jones as Grigory Orlov"]}, {"page": "List of The Avengers and The New Avengers cast members", "response": ["* Griffith Jones"]}, {"page": "The Life and Adventures of Nicholas Nickleby (play)", "response": ["* Griffith Jones as Flunkey, Old Lord, Mr. Fluggers and Tim Linkinwater"]}, {"page": "The Day Will Dawn", "response": ["The Day Will Dawn, released in the US as The Avengers, is a 1942 war film set in Norway during World War II. It stars Ralph Richardson, Deborah Kerr, Hugh Williams and Griffith Jones, and was directed by Harold French from a script written by Anatole de Grunwald, Patrick Kirwan and Terence Rattigan, based on a story by Frank Owen.Allmovie Credits The music by Richard Addinsell was performed by the London Symphony Orchestra conducted by Muir Mathieson.", "* Griffith Jones as Inspector Gunter"]}, {"page": "List of adventure films of the 1930s", "response": ["|The Wife of General Ling||Ladislao Vajda||Griffith Jones, Valéry Inkijinoff, Adrianne Renn||United Kingdom||"]}, {"page": "Stars in Battledress", "response": ["* Griffith Jones (film actor and later Royal Shakespeare Company stalwart)"]}, {"page": "King's Rhapsody", "response": ["A television version of the play was broadcast in 1957 by the BBC, who (according to the Radio Times) \"ingeniously cut the three and a quarter hours of the original action to an hour and a half.\" Vanessa Lee reprised her role of Princess Cristiane from the original stage production, and Griffith Jones played Novello's role of Nikki, with Margot Grahame as his mistress."]}, {"page": "Harold Jones", "response": ["* Griffith Jones (actor) (Harold Jones, 1909–2007), British stage and television actor"]}, {"page": "List of British films of 1948", "response": ["|Look Before You Love||Harold Huth||Margaret Lockwood, Griffith Jones||Drama||"]}, {"page": "List of British films of 1951", "response": ["|Honeymoon Deferred || Mario Camerini || Sally Ann Howes, Griffith Jones, Kieron Moore || Comedy || Co-production with Italy"]}, {"page": "List of British films of 1954", "response": ["|The Scarlet Web||Charles Saunders||Griffith Jones, Hazel Court||Crime||", "|Star of My Night||Paul Dickson||Griffith Jones, Kathleen Byron||Drama||"]}, {"page": "List of British films of 1957", "response": ["|Account Rendered||Peter Graham Scott||Griffith Jones, Ursula Howells, Honor Blackman||Mystery||", "|Face in the Night||Lance Comfort||Griffith Jones, Lisa Gastoni||Crime||"]}]}}