{"wiki_id": "http://www.wikidata.org/entity/Q11295738", "itemLabel": "Carmen Blacker", "itemDescription": "British scholar of Japanese", "wikipedia_url": "https://en.wikipedia.org/wiki/Carmen_Blacker", "wikipedia_page": {"main": "Carmen Blacker FBA, OST, OBE (13 July 1924 – 13 July 2009) was a British Japonologist. She was a lecturer in Japanese at Cambridge University.\n\n", "link_mentions": [{"page": "Divination", "response": ["* Loewe, Michael, and Carmen Blacker, eds. 1981. Oracles and Divination. Shambhala/Random House. ."]}, {"page": "Minakata Kumagusu", "response": ["*Blacker, Carmen (2000). “Minakata Kumagusu, 1867-1941: A Genius Now Recognized.” Collected Writings of Carmen Blacker, pp. 235–247. New York: Routledge."]}, {"page": "Japan–United Kingdom relations", "response": ["*Carmen Blacker - English Japanologist Cambridge lecturer"]}, {"page": "Hugh Cortazzi", "response": ["* 2000 – Shillony, Ben-Ami. Collected Writings of Ben-Ami Shillony (eds., Carmen Blacker and Hugh Cortazzi). London: Routledge;  (cloth)"]}, {"page": "Hilda Ellis Davidson", "response": ["Davidson also dedicated herself to examining the history of folklore studies itself. In this connection, together with Carmen Blacker, she edited Women and Tradition: A Neglected Group of Folklorists (2000). In 1987, Davidson helped found the Katharine Briggs Dining Club. She organized many of its conferences, and edited the papers that were produced as a result, often in cooperation with Blacker and Anna Chaudhri. In 1988 she published a biography of her friend Katharine Briggs. The last of her editorial projects, A Companion to the Fairy Tale (2003), was conducted in cooperation with Chaudhri.", "*(2001) Women and Tradition, Hilda Ellis Davidson and Carmen Blacker, Carolina Academic Press, Durham, N.C."]}, {"page": "Kakiemon", "response": ["Wares included bowls, dishes and plates, often hexagonal, octagonal or fluted with scalloped edges. The famed white nigoshide body was only used with open forms, and not for closed shapes such as vases, bottles and teapots, or for figures and animals. The hexagonal vases and covers known as \"Hampton Court\" vases were named after a pair at Hampton Court Palace near London, recorded in an inventory of 1696. Around 1730, this shape was copied at Meissen, Saxony, which entered into a \"sister city\" contract with Arita, in 1979. The style was also adopted and copied in Chelsea and Worcester in the 1750s and by Samson Ceramics in the 19th century.The Collected Writings of Modern Western Scholars on Japan Carmen Blacker, Hugh Cortazzi, Ben-Ami Shillony p. 338. Statuettes were also created, an example being the Kakiemon elephants (British Museum). "]}, {"page": "Blacker", "response": ["* Carmen Blacker FBA (1924–2009), British scholar of the Japanese language, daughter of Dr Carlos Blacker"]}, {"page": "Santō Kyōden", "response": ["* (1806, translated by Carmen Blacker as \"The Straw Sandal Or The Scroll of the Hundred Crabs\", Global Oriental, 2008, )"]}, {"page": "Yoshio Markino", "response": ["A devoted Anglophile, Markino only returned to Japan in 1942 due to WWII when England declared war on Japan for attacking British Malaya, Singapore and Hong Kong. In 1952 in Kamakura he met Carmen Blacker who was studying ascetic Buddhism there on the way up a set of temple steps, in 'a shirt covered in smears of blue and green paint ... a sketchbook in his hand' rambling for almost 4 hours in English and Japanese rushing up the steps out of breath aged 83 noting 'how happy he had been in London, and that he had never wanted to leave [as] he had so many friends, and was never tired of sketching the people and painting the mists.'Edwardian London through Japanese Eyes: The Art and Writings of Yoshio Markino, 1897–1915, Hugh Cortazzi, 2012, Preface"]}, {"page": "The Folklore Society", "response": ["* 1982–84 Carmen Blacker"]}, {"page": "Michael Loewe", "response": ["Michael Loewe was born on 2 November 1922 in Oxford, England, to a distinguished Anglo-Jewish family. Loewe's great-grandfather Louis Loewe (1809–1888) was a Prussian Silesian professor of Oriental studies and theology who later emigrated to Britain, and was the personal secretary of the prominent British Jewish businessman, financier, and philanthropist Moses Montefiore. Loewe's father, Herbert Loewe, was a professor of the Semitic languages who taught at both Cambridge University and Oxford University, while his mother, Ethel Victoria Hyamson, was a sister of the British official and historian Albert Hyamson. His elder brother Raphael Loewe (1919–2011) was, like their father, a scholar of Semitic languages, and was a professor of Hebrew and Jewish studies at University College London. Loewe was married to Carmen Blacker, a scholar in the Japanese language."]}, {"page": "Human guise", "response": ["The wandering stranger (ijin, 異人) in Japanese folklore may turn out as a secret prince or as a priest... \"And he can also be an avowedly supernatural being, outside the human race. The Wardens of certain pools, for example, who are believed to be snakes, and to be ready to lend lacquer cups and bowls to those who wish to borrow them for a party, are referred to as ijin. So are the uncanny yamabito or 'mountain people', said to be seven or eight feet tall, to be covered with hair or leaves, and to live deep in the mountains beyond human habitation. .... The Stranger is... possessed of powerful magic, but he is disguised as a filthy beggar. Be careful therefore how you treat strangers....\"Carmen Blacker (1990). \"The Folklore of the Stranger: A Consideration of a Disguised Wandering Saint\", pp.162-168, in Folklore, Vol.101, No.2 (1990).   (print),  (web). Generically, a stranger \"may as easily be a dangerous incarnation of the Devil as a messenger from God\"."]}, {"page": "Richard Mason (historian)", "response": ["Mason was born and raised in England, following a year of military service, he began studying Japanese history under Carmen Blacker at Cambridge University, which he attended from 1954 to 1958. His PhD dissertation, completed at Australia National University, and published as a book in 1969, was entitled \"Japan's First General Election, 1890.\""]}, {"page": "Carlos Blacker", "response": ["Carmen Blacker (1924-2009), a scholar in the Japanese language and Ann Thetis Blacker (1927–2006), the painter and singer, were daughters of Carlos Blacker."]}, {"page": "List of women in Bletchley Park", "response": ["* Carmen Blacker"]}, {"page": "List of Somerville College, Oxford, people", "response": ["*Carmen Blacker FBA OST OBE (1924–2009), scholar of Japanese language"]}, {"page": "Henry Fellowship", "response": ["*Carmen Blacker, British scholar of Japan, at Harvard University (1950-51)."]}]}}