{"wiki_id": "http://www.wikidata.org/entity/Q11252147", "itemLabel": "Robert Carpenter", "itemDescription": "English cricketer (1830-1901)", "wikipedia_url": "https://en.wikipedia.org/wiki/Robert_Carpenter_(cricketer)", "wikipedia_page": {"main": "Robert Pearson Carpenter (18 November 1830 – 14 July 1901) was an English first-class cricketer who played between 1855 and 1876, generally acknowledged to be one of the outstanding batsmen of the 1850s and 1860s. He was a right-handed batsman, usually opening the innings, and an occasional wicketkeeper. He played mostly for the Cambridge and Cambridgeshire sides, the North and the United All-England Eleven. In 1859, Carpenter went to North America as a member of the first-ever overseas tour undertaken by the England team and, in 1862–63, was in the England team to Australia and New Zealand. When travelling to Australia, the team travelled from Liverpool to Melbourne on the SS Great Britain. \nHe umpired in two Test matches between England and Australia in the 1880s. His son Herbert played for Essex.\nCarpenter's known first-class career spanned the 1855 to 1876 seasons.  He scored 5,220 runs in 141 matches with an average of 24.39, making four centuries with a highest score of 134. A noted fielder, he held 190 catches and made two stumpings.\nAt the end of the 1859 English cricket season, Carpenter was one of the twelve players who took part in cricket's first-ever overseas tour when an England cricket team led by George Parr visited North America. He also toured Australia with Parr in 1863. In the early 1860s, Carpenter and his Cambridgeshire contemporary Thomas Hayward were rated the finest batsmen in England. Richard Daft was among those ranking them as equal first, but George Parr reckoned Carpenter the better of the two. W. G. Grace said of Carpenter that \"he may be safely placed as one of the finest of our great batsmen\".Carpenter played in the Gentlemen v Players fixture for the Players on many occasions, scoring centuries in the 1860 and 1861 fixtures at The Oval. In the 1860 match, he hit a ball clean out of The Oval.", "link_mentions": [{"page": "1861 in sports", "response": ["* Most runs – Robert Carpenter 883 @ 30.44 (HS 106)"]}, {"page": "Robert Carpenter", "response": ["Robert Carpenter may refer to:", "* Robert Carpenter (American politician) (1909–1979), member of the Ohio House of Representatives", "*Robert Carpenter (MP) (died 1607), MP for Rye", "* Robert Carpenter (cricketer) (1830–1901), English cricketer"]}, {"page": "Cambridgeshire County Cricket Club", "response": ["The club played 39 first-class matches in all, winning thirteen, losing 21 and drawing five. The most successful season was 1864, when all 3 matches played were won. The regular home ground was Fenner's. Thomas Hayward made the most appearances, playing in 35 of the matches. He also made most runs, with 1,934 at 33.34, and scored two of the four centuries made for the county, both in 1861. He and Robert Carpenter put on 212 for the 3rd wicket against Surrey at The Oval in 1861, both scoring centuries. This was the highest partnership for the county. George Tarrant took the most wickets: 197 at 12.25, plus a further 22 wickets for which the runs conceded are not known. He had match figures of 15–56 against Kent at Chatham in 1862, including 8–16 in an innings. He also took 8–45 in an innings against Surrey at Fenner's the same year.The Wisden Book of County Cricket, by Christopher Martin-Jenkins and Frank Warwick, Queen Anne Press, 1981, pp. 436–440.", "* Robert Carpenter"]}, {"page": "List of Test cricket umpires", "response": ["|Robert Carpenter||||2||1886||1888"]}, {"page": "Thomas Hayward (cricketer)", "response": ["Thomas Hayward (21 March 1835 – 21 July 1876) was an English first-class cricketer who was generally reckoned to be one of the outstanding batsmen of the 1850s and 1860s. In the early 1860s, he and Robert Carpenter, his county colleague, were rated as the two finest batsmen in England. Richard Daft was among those ranking them as equal first, though George Parr reckoned Carpenter the better of the two."]}, {"page": "Fred Lillywhite", "response": ["The touring party of 1859 left Liverpool on the SS Nova Scotian on 7 September and returned on 11 November. Its members, in addition to Wisden and John Lillywhite, were the captain George Parr (1826–91), Julius Caesar (1830–78), William Caffyn (1828–1919), Robert Carpenter (1830–1901), Alfred Diver (1824–1876), James Grundy (1824–1873), Tom Hayward (1835–76), John Jackson (1833–1910), Tom Lockyer (1826–1869) and H. H. Stephenson (1833–1896), who later led the first private tour by an England XI to Australia in 1861."]}, {"page": "History of English cricket (1816–1863)", "response": ["On 7 September, the departure of cricket's first-ever touring team. A photograph was taken on board ship before they sailed from Liverpool. The team of English professionals went to North America and played five matches, winning them all. There were no first-class fixtures. The 12-man squad was: George Parr (captain), James Grundy, John Jackson (all of Nottinghamshire); Robert Carpenter, Alfred Diver, Thomas Hayward (all of Cambridgeshire); Julius Caesar, William Caffyn, Tom Lockyer, H. H. Stephenson (all of Surrey); John Lillywhite, John Wisden (both of Sussex).", "In the 1861 season, 36 first-class matches were played. Robert Carpenter was the leading run-scorer with 883 @ 30.44. Edgar Willsher was the leading wicket-taker with 87 @ 11.65."]}, {"page": "1871 English cricket season", "response": ["|Robert Carpenter || All England ElevenCambridgeshire|| 9 || 16 || 4 || 446 || 87 not out || 37.16 || 0 || 3"]}, {"page": "Robert P. Carpenter", "response": ["#REDIRECT Robert Carpenter (cricketer)"]}, {"page": "Cambridge Town Club", "response": ["Cambridge Town Club (CTC) was a first-class cricket club established in Cambridge before 1817. Among notable players who represented CTC were Tom Hayward senior, Robert Carpenter and George Tarrant. It co-existed with Cambridge University Cricket Club, an entirely separate entity, and the two teams played each other on numerous occasions.ACS, Important Cricket Matches, pp. 32–39."]}, {"page": "United North of England Eleven", "response": ["The UNEE's rivalry with the USEE was renewed in 1872 when four matches were arranged although the last one at Leeds in September was cancelled.CricketArchive – match scorecard.  Retrieved on 4 December 2008. The first match at Bishop's Stortford in June was drawn.  Robert Carpenter, William Oscroft, John Hicks and James Shaw made first appearances for the UNEE.  In August, the UNEE won by 8 wickets at Hunslet, Arnold Rylott making his first appearance.CricketArchive – match scorecard.  Retrieved on 4 December 2008. In September, the tide turned and the USEE recorded its first win over the UNEE by 8 wickets despite the addition of Thomas Hayward and Richard Daft to the UNEE team.CricketArchive – match scorecard.  Retrieved on 4 December 2008."]}, {"page": "Mill Road, Cambridge", "response": ["*Robert Carpenter — cricketer. Born 18 November 1830 in Mill Road."]}, {"page": "English cricket team in Australia and New Zealand in 1863–64", "response": ["The team was captained by George Parr (Nottinghamshire) who was joined by William Caffyn, Julius Caesar, Tom Lockyer, (all Surrey); Alfred Clarke, Cris Tinley, John Jackson (all Nottinghamshire); George Tarrant, Robert Carpenter, Thomas Hayward (all Cambridgeshire); George Anderson (Yorkshire); and E. M. Grace (amateur; West Gloucestershire CC). Grace was the sole amateur in the party, all the other players being professionals.CricInfo; including team photo. Retrieved on 12 July 2009."]}, {"page": "Bob Carpenter (cricketer)", "response": ["#REDIRECT Robert Carpenter (cricketer)"]}, {"page": "W. G. Grace's cricket career (1864 to 1870)", "response": ["According to CricketArchive, Grace made 8 first-class appearances in 1866, scoring 581 runs at 52.81 including 2 centuries with a highest score of 224 not out and taking 9 catches. He took 31 wickets at 15.58 including 3 returns of 5 wickets in an innings with best figures of 7–51 in the Gentlemen v Players match.Rae, p.495. These figures brought him for the first time into leading positions in the seasonal first-class statistics. He was the fifth highest runscorer behind Harry Jupp, Tom Hearne, Charles Buller and Russell Walker; and second in the batting averages behind Robert Carpenter. He was a creditable 15th in the list of wicket-takers, having bowled many less deliveries than all of those above him except James Southerton. Grace took 31 wickets from 1,269 deliveries compared with the overall leader George Wootton who took 119 wickets from 4,712 deliveries, though Wootton had a more economical average."]}, {"page": "W. G. Grace in the 1871 English cricket season", "response": ["The first two Gentlemen v Players matches of 1871 were held in early July at Lord's, starting Monday, 3 July, and the Oval, starting on Thursday, 6 July. The Lord's fixture was drawn as a result of rain. Gentlemen won the toss and batted first, scoring 208. Grace, who opened with A. N. Hornby, scored 50. Players responded with 180, Grace taking 1/16, and Gentlemen then scored 146 all out, Grace making 37. There was no time left for the second Players innings to begin. At the Oval, there was better weather and the match was completed, Gentlemen winning by 5 wickets. They batted first and totalled 299. Grace made only 16 and the outstanding innings was 97 by Walter Hadow. Players struggled and only the efforts of Robert Carpenter, who was 72 not out, enabled them to reach 182. Following on, Players were better in the second innings and scored 260 to leave Gentlemen needing 144 to win. Grace scored 43 as they easily reached 145–5.", "In all first-class matches in 1871, a total of 17 centuries were scored and Grace accounted for 10 of them, including the first century in a first-class match at Trent Bridge.Rae, p.99. He averaged 78.25 and the next best average by a batsman playing more than a single innings was 39.57, barely more than half his figure. His aggregate for the season was 2,739 and this was the first time that anyone had scored 2,000 first-class runs in a season; Harry Jupp was next best with 1,068. Grace's highest score was 268 for South v. North at The Oval. He took 79 wickets at 17.02 with a best analysis of 7–67. He claimed five wickets in an innings 5 times and twice had 10 in a match.Rae, p.495. Besides Grace and apart from Jupp and Ted Pooley who were the highest runscorers, other leading batsmen in 1871 were Richard Daft, Robert Carpenter, Fred Grace, Henry Charlwood and Ephraim Lockwood. The leading bowlers were James Southerton, Alfred Shaw, Jem Shaw, Frank Farrands, Grace, Ned Willsher, James Street and Tom Emmett."]}, {"page": "Herbert Carpenter", "response": ["Carpenter came from a cricketing family and was the son of Cambridgeshire's Robert Carpenter. He made his Essex debut in 1888 and his consistent batting helped the county achieve first-class status in 1894. Carpenter scored 1000 runs in a season on six occasions. In 1900, he amassed 1468 runs including four centuries. His career at Essex spanned 26 years scoring 13,403 runs in 264 matches at an average of 29.50."]}, {"page": "List of Cambridge Town Club and Cambridgeshire cricketers", "response": ["* Robert Carpenter (1855–1871) : R. P. Carpenter"]}, {"page": "July 1901", "response": ["** Robert Carpenter, 70, English cricket batsman and umpire during the 19th century (b. 1830)"]}, {"page": "George Carpenter (cricketer)", "response": ["George Carpenter (28 February 1818 – 3 June 1849) was an English first-class cricketer active 1838–1844 who played for Cambridge Town Club. He was born and died in Cambridge. A brother of Robert Carpenter, he appeared in nine first-class matches.George Carpenter at CricketArchive"]}, {"page": "Edward Hume (cricketer)", "response": ["The son of William Wheeler Hume, he was born in September 1841 at Scaldwell, Northamptonshire. He was educated at Marlborough College, where he was coached in cricket by Robert Carpenter. From Marlborough he studied at Trinity College, Oxford. While studying at Oxford, he made his debut in first-class cricket for Oxford University against the Marylebone Cricket Club (MCC) at Oxford in 1861. He played first-class cricket for Oxford until 1863, making six appearances and scoring 74 runs, with a high score of 21. "]}]}}