{"wiki_id": "http://www.wikidata.org/entity/Q11290928", "itemLabel": "Elizabeth Poston", "itemDescription": "English composer, pianist and writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Elizabeth_Poston", "wikipedia_page": {"main": "Elizabeth Poston (24 October 1905 – 18 March 1987) was an English composer, pianist and writer.", "link_mentions": [{"page": "1987 in music", "response": ["*March 18 – Elizabeth Poston, composer, 82"]}, {"page": "1905 in music", "response": ["* October 24 – Elizabeth Poston, English composer, pianist and writer (d. 1987)"]}, {"page": "List of women composers by birth date", "response": ["* Elizabeth Poston (1905–1987)"]}, {"page": "Stevenage", "response": ["* Elizabeth Poston, composer, born in Highfield House, Pin Green (now the site of Hampson Park) and later lived in Rooks Nest."]}, {"page": "Good King Wenceslas", "response": ["Elizabeth Poston, in the Penguin Book of Christmas Carols, referred to it as the \"product of an unnatural marriage between Victorian whimsy and the thirteenth-century dance carol\". She goes on to detail how Neale's \"ponderous moral doggerel\" does not fit the light-hearted dance measure of the original tune, and that if performed in the correct manner \"sounds ridiculous to pseudo-religious words\";Elizabeth Poston, The Penguin Book of Christmas Carols (London: Penguin, 1965) a similar development has arisen with the song O Christmas Tree, whose tune has been used for Maryland, My Maryland, The Red Flag, and other unrelated songs."]}, {"page": "Terence Tiller", "response": ["Vol. 61, No. 1, Winter 1985, p 84-5G D Bridson. 'Broadcast Poetry in Britain', in Poetry, Vol 79 No 5, February 1952 During this period, Tiller became a noted Fitzrovian.Butler, Marilyn. 'Rise and Fall of Radio Features', in London Review of Books Vol 2 No 15, 7 August, 1980 He collaborated with the composer Elizabeth Poston on features such as The Shepherds' Play (1947), The Death of Adam (1949), Lilith (1950), and The Holy Child (1952). In 1955 he was producer of the first BBC radio adaptation of Tolkien's The Lord of the Rings (which did not please the author). He adapted and modernized Chaucer's The Parlement of Foules in 1958.Third Programmme, 8 June, 1958 In 1969 he completed the posthumous story After Ten Years by C. S. Lewis for broadcast,BBC Radio 3, 9 March, 1969 and in 1973 he brought Mervyn Peake's The Rhyme of the Flying Bomb to the airwaves.BBC Radio 3, 9 August, 1973 In 1979 Tiller dramatized Vladimir Nabokov's novel The Defence.BBC Radio 4, 22 January, 1979."]}, {"page": "Andrew Young (poet)", "response": ["There were several musical settings of his poetry, including the incidental music composed by Imogen Holst for his play Nicodemus (1937). \"Christmas Day\" from his collection Speak to the Earth (1939) also proved popular with composers and was set by Mervyn Roberts (1947), Robin Milford (1949), Neil Butterworth (1954), and Elizabeth Poston (1967).Andrew Young Homepage"]}, {"page": "Shushan the Palace: Hymns of Earth", "response": ["#\"Jesus Christ the Apple Tree\"  – 3:05 - lyric collected by Joshua Smith, music by Elizabeth Poston"]}, {"page": "David Holbrook", "response": ["*The Cambridge Hymnal (1967) compiler with Elizabeth Poston"]}, {"page": "Poston", "response": ["*Elizabeth Poston (1905–1987), English composer"]}, {"page": "Jean Coulthard", "response": ["Born in Vancouver, British Columbia, Coulthard was the daughter of Jean Blake Robinson Coulthard, a prominent and influential music teacher in Vancouver. Through her mother she received her earliest musical training and was introduced at an early age to the work of French composers like Claude Debussy and Maurice Ravel, both of whom were lifelong influences. From 1924-1928 she studied the piano with Jan Cherniavsky and music theory with Frederick Chubb. A scholarship from the Vancouver Woman's Musical Club enabled her to pursue studies at the Royal College of Music in 1928-1929 where she was a pupil of Kathleen Long, R.O. Morris, and Ralph Vaughan Williams. She studied in the 1930s and early 1940s with such composers as Béla Bartók, Aaron Copland, and Arnold Schoenberg. In 1944-1945, Coulthard worked for an entire academic year with Bernard Wagenaar of the Juilliard School, New York.W. Bruneau and D.G. Duke, Jean Coulthard: A Life in Music (Vancouver: Ronsdale Press, 2005), pp. 63-67, . In 1948 she met the British composer Elizabeth Poston (who was visiting Canada) and they began a long friendship and an extensive correspondence over the next 30 years.* Alabastor, John: Elizabeth Poston: Catalogue of Works with Biographical Context (2018) "]}, {"page": "Howards End", "response": ["Forster based his description of Howards End on a house at the hamlet of Rooks Nest in Hertfordshire, his childhood home from 1883 to 1893. The house, known in Forster's childhood as \"Rooksnest\" had, as in the novel, been owned by a family named Howard, and the house itself had been called \"Howards\" in their day.Editor's Introduction, in Howards End, Penguin Books. This information was passed to Forster many years after the publication of the novel by a family friend, the composer Elizabeth Poston, who by that point lived at the house; this came as a surprise to Forster, who concluded that having known and then forgotten these facts like a child, he had unwittingly used them when writing the novel. According to his description in an appendix to the novel, Rooks Nest was a hamlet with a farm on the Weston Road just outside Stevenage.\"Appendix: Rooknest\" in Howards End, Penguin Books. The house is marked on modern Ordnance Survey maps at ."]}, {"page": "Carols for Choirs", "response": [" ||  Elizabeth Poston (arr.)"]}, {"page": "Finzi Trust", "response": ["Recording projects have included not only music by Finzi, but also by Michael Berkeley, Benjamin Britten, Howard Ferguson, Ivor Gurney, Herbert Howells, Kenneth Leighton, Malcolm Lipkin, Herbert Sumsion, Elizabeth Poston, William Walton and Percy Whitlock."]}, {"page": "Madeleva Wolff", "response": ["* Composer Elizabeth Poston used Sister Madeleva's poetry as text for a piece for voice and piano titled Sheepfolds. (1958)"]}, {"page": "Elisabeth Poston", "response": ["#REDIRECT Elizabeth Poston"]}, {"page": "Harold Samuel", "response": ["To make a living Harold Samuel taught (he was, for example, the piano teacher of the British composers Benjamin Britten and Elizabeth Poston), did vocal coaching and became a sought-after accompanist (performing especially with violinist Isolde Menges).  His solo career, however, was at a standstill until 1919 when he played an all-Bach programme in London.  He soon found a ready audience for large amounts of Bach's keyboard works in their original form.  In 1921 he gave six successive Bach recitals in London and a similar cycle in New York City.  He toured the US regularly from 1924.  He wrote a musical comedy, Hon'ble Phil, songs and piano pieces."]}, {"page": "Concertino for Harpsichord and String Orchestra (Leigh)", "response": ["Concertino for Harpsichord and String Orchestra is a short harpsichord concerto written in 1934 by English composer Walter Leigh.  It was premiered by the English composer and pianist Elizabeth Poston."]}, {"page": "Queen Margaret's School, York", "response": ["*Elizabeth Poston, Composer"]}, {"page": "Resonet in laudibus", "response": ["There is no definitive version of the Latin text, and there are many variations and parodies in various sacred songbooks, as well as extended, embellished versions (for example motets by the Franco-Flemish composer Orlande de Lassus or the Slovenian-German composer Jacobus Gallus).[ Jacobus Gallus's version], All Music Guide, accessed 27 November 2010 Georg Wicel, a contemporary of Martin Luther, referred to the carol as \"one of the chief Christmas songs of joy\" in 1550. In addition to its literal English translation, it has also appeared as \"Christ was born on Christmas Day\" in two different translations by John Mason Neale in 1853 (who based his version on the 1582 Swedish song collection Piae Cantiones) and Elizabeth Poston in 1965. "]}, {"page": "1987 in British music", "response": ["*18 March - Elizabeth Poston, composer, 81"]}, {"page": "Society of Women Musicians", "response": ["The Society of Women Musicians was a British group founded in 1911 for mutual cooperation between women composers and performers, in response to the limited professional opportunities for women musicians at the time. The founders included Katharine Emily Eggar, a composer, Marion Scott, a musicologist, and Gertrude Eaton, a singer. 37 women came to the first meeting, held on 11 July 1911 at the Women's Institute, 92 Victoria Street, including Rebecca Helferich Clarke, Alma Haas, and Liza Lehmann, who later became the group's first president.Grove, SWM The first concert was held on 25 January 1912 in the small room of Queen's Hall.Concert Programmes.org Regular concerts followed at the same venue and at the Aeolian and Wigmore Halls. They featured premieres from women composers such as Ethel Barns, Rebecca Clarke, Katharine Eggar, Dorothy Howell, Liza Lehmann, Fiona McCleary (1900–1986), Marion Scott and Ethel Smyth. In later years there were also premieres from Ruth Gipps, Elisabeth Lutyens, Elizabeth Maconchy and Elizabeth Poston.", "The group had a number of influential musicians as presidents, including Cécile Chaminade, Astra Desmond, Myra Hess, Rosa Newmarch, Evelyn Suart and Elizabeth Poston. The post of vice-president was largely honorary, and was held by woman musicians such as Nadia Boulanger, Imogen Holst, Elisabeth Lutyens, Elizabeth Maconchy and Fanny Waterman."]}, {"page": "Jesus Christ the Apple Tree", "response": ["Jesus Christ the Apple Tree (also known as Apple Tree and, in its early publications, as Christ Compared to an Apple-tree) is a poem, possibly intended for use as a carol, written in the 18th century. It has been set to music by a number of composers, including Jeremiah Ingalls (1764–1838), Elizabeth Poston (1905–1987) and John Rutter."]}, {"page": "Antonio Brosa", "response": ["Brosa was the soloist for the premiere performance of the young Elizabeth Poston's Violin Sonata, broadcast by the BBC on 9 July 1928,Radio Times issue 249, 8 July 1928, p 16 for Haydn Wood's Violin Concerto on 1 March 1933, with the BBC Symphony Orchestra, conducted by Joseph Lewis,Gramophone: Coleridge Taylor, H Wood, Violin Concertos and also for the first performance of Arthur Benjamin's Violin Concerto (1932) on 5 January 1934 with the BBC Symphony Orchestra, conducted by Adrian Boult.Pleskun, Stephen (2014): A chronological history of Australian composers and their compositions"]}, {"page": "St Matthew's Church, Northampton", "response": ["* 1959 – Elizabeth Poston – Festal Te Deum"]}, {"page": "Douglas Cleverdon", "response": ["In 1939 he joined the BBC, where he co-created The Brains Trust with fellow producer Howard Thomas.Thomas, Howard With An Independent Air London: Weidenfeld & Nicolson 1977  From 1945 he was in the department headed by Laurence Gilliam.Asa Briggs, The History of Broadcasting in the United Kingdom (1995), p. 348. Later, in 1948, Cleverdon would adapt and produce David Jones's major poem In Parenthesis for radio, with Richard Burton and Dylan Thomas, with music by Elizabeth Poston,The Official Richard Burton Website  for BBC Radio's Third Programme. In 1954 Cleverdon produced Under Milk Wood, the premier of the Dylan Thomas dramatic poem; according to Jenny Abramsky it had taken seven years to persuade Thomas to write it.BBC – Press Office – Jenny Abramsky Oxford lecture one At around this time he also worked with Henry Reed on the Hilda Tablet cycle of plays."]}, {"page": "Personent hodie", "response": ["The most common English translation of the text is by \"James M. Joseph\", a pseudonym of the composer Jane M. Joseph (1894–1929). She translates the title as \"On this day earth shall ring\", although there are several other English translations.Hugh Keyte, Andrew Parrott, \"Personent Hodie, On This Day Earth Shall Ring\" in The Musical Times, Vol. 133, No. 1795 (September 1992), pp. 1–4 Other versions include Elizabeth Poston's 1965 \"Boys' Carol\", which translates the first line of the text as \"Let the boys' cheerful noise/Sing today none but joys\" and John Mason Neale's \"Let the Song be Begun\", which uses the melody but not the text of the carol.The Boys' Carol at Golden Hind Music, URL accessed 4 January 2009\"Personent hodie\" at hymnsandcarolsofchristmas.com, URL accessed 4 January 2009 Aidan Oliver's non-verse translation renders the text as \"Today let the voices of children resound in joyful praise of Him who is born for us.\""]}, {"page": "Hoffnung Music Festival", "response": [":Sugar Plums (realized by Elizabeth Poston) (Dolmetsch Ensemble)"]}, {"page": "Stainer & Bell", "response": ["* Female composers: Elizabeth Poston, Grace Williams, Morfydd Owen, Janet Wheeler and Roxanna Panufnik, among others in the 2019 publication Multitude of Voyces."]}, {"page": "Susan Einzig", "response": ["*Elizabeth Poston, The Children's Songbook, 1961"]}, {"page": "Robert Wilkinson (English cricketer)", "response": ["Forster had written a piece about the house, the \"Rooksnest memoir\", by 1894 when he was 15 which mentions Wilkinson as landlord. Howards End (1910) was his novel about his childhood home; he continued to visit the house into the later 1940s, and he retained the furniture all his life. From 1914 Elizabeth Poston lived there: the Forsters had known the Poston family when they were the residents. The memoir was published with the Penguin Modern Classics edition of Howards End. Another memoir by Forster, from the 1940s and about West Hackhurst, Abinger Hammer in Surrey which was his home from 1925, returns to the associations of Rooksnest."]}, {"page": "Rooks Nest House", "response": ["Elizabeth Poston, composer and president of the Society of Women Musicians, was born at Highfield in 1905 and in 1914, the widowed Clementine Poston, daughter Elizabeth and son Ralph moved to Rooks Nest House as tenants of the Poyntz-Stewarts of Chesfield. Forster and Poston went on to meet at a concert at the National Gallery during the war, and he became a regular visitor to his old home. Poston stayed at Rooks Nest after her mother's death and was able to buy it. Forster and Poston had installed a plaque on the exterior wall of the building that read: \"E. M. Forster, Elizabeth Poston, Clementine Poston lived here and loved this place\". Poston stayed there until her death in 1987."]}]}}