{"wiki_id": "http://www.wikidata.org/entity/Q11296399", "itemLabel": "Tom Adams", "itemDescription": "British actor (1938-2014)", "wikipedia_url": "https://en.wikipedia.org/wiki/Tom_Adams_(actor)", "wikipedia_page": {"main": "Anthony Frederick Charles \"Tom\" Adams (9 March 1938 – 11 December 2014) was an English actor with roles in adventure, horror and mystery films and several TV shows.  He was best known for his role as Daniel Fogarty in several series of The Onedin Line.", "link_mentions": [{"page": "1965 in film", "response": ["*Licensed to Kill, starring Tom Adams – (U.K.)"]}, {"page": "The Great Escape (film)", "response": ["* Tom Adams as Dai Nimmo 'Diversions', a Welsh officer."]}, {"page": "General Hospital (British TV series)", "response": ["* Tom Adams as Mr Guy Wallman, Consultant general surgeon/CEO"]}, {"page": "The Onedin Line", "response": ["Lady Fogarty, Elizabeth Fogarty (nee Onedin, formerly Frazer) (Jessica Benton), James's volatile sister, became pregnant by seafarer Daniel Fogarty (Michael Billington / Tom Adams). To avoid disgrace, she married wealthy Albert Frazer (Philip Bond), developer of steamship technology and heir to the Frazer shipyards, a connection James soon turned to his own advantage. Elizabeth gave birth to a son, William Frazer. ", "Other regular cast members included Jessica Benton (Elizabeth Frazer), Brian Rawlinson and James Garbutt (Robert Onedin), Mary Webster, (Sarah Onedin), Michael Billington / Tom Adams (Daniel Fogarty)."]}, {"page": "Holyport", "response": ["Monty Python filmed a Maypole dance-related sketch on the green, the film Happy is the Bride was shot here and in Bray, and Joan Collins filmed an advertisement in Holyport some years back. The movie One of Our Dinosaurs Is Missing was partly filmed in Holyport. A scene from the 1995 Mr Bean episode, entitled 'Tee off Mr Bean', was filmed on Holyport Green. Holyport was the final residence of veteran BBC TV presenter Frank Bough until his death in 2020, and for many years the former actor Tom Adams, who died in 2014, was spotted frequently in the village pubs. Stirling Moss, the famous racing driver, lived in the village, and was a member of the Bray and Holyport Scout Group."]}, {"page": "The Wednesday Play", "response": ["| Tom AdamsGriffith DaviesBen HowardGeorge SewellFrank JarvisJune MurphyPeter DucrowJohn Harvey"]}, {"page": "Pyrates", "response": ["*Tom Adams as Calico Jack (uncredited)"]}, {"page": "John Arnatt", "response": ["One of Arnatt's most high-profile roles was as \"The Deputy Sheriff of Nottingham\" in the fourth and final season of 1955-60 TV series The Adventures of Robin Hood starring Richard Greene. His character filled in for Alan Wheatley, who played the regular sheriff. Arnatt's character was introduced and interacted with Wheatley's character in the episode \"The Devil You Don't Know\". In the 1962 film Dr Crippen, starring Donald Pleasence (who also had a recurring role in \"The Adventures of Robin Hood\" as Prince John), Arnatt played Chief Inspector Walter Dew. Arnatt also played an imitation \"M\" to Tom Adams' imitation James Bond in two films, Licensed to Kill and Where the Bullets Fly (1966). In 1967, Arnatt got something of a promotion when he played the High Sheriff of Nottingham opposite Barrie Ingham's Robin in the film A Challenge for Robin Hood."]}, {"page": "DFS Furniture", "response": ["For many years in the 1980s and 1990s, actor Tom Adams was the face of DFS's television advertisements. In December 2008, one television commercial by DFS was banned by the Advertising Standards Authority, following complaints that the company had doctored the footage to inflate the perceived size of their sofas, relative to the actors."]}, {"page": "The House That Dripped Blood", "response": ["Charles Hillyer (Denholm Elliott), a hack writer who specialises in horror stories, and his wife Alice (Joanna Dunham), move into the house. Charles begins working on a novel focusing on Dominic, a murderous, psychopathic strangler; Charles becomes simultaneously enamoured and disturbed by the character. Charles soon starts to see Dominic (Tom Adams), who begins stalking and tormenting him.", "*Tom Adams as Richard/Dominic"]}, {"page": "The Enigma Files", "response": ["*Tom Adams as Detective Chief Inspector Nick Lewis"]}, {"page": "List of The Avengers (TV series) episodes", "response": ["| Nyree Dawn Porter, Peter Arne, Frank Thornton, Hamilton Dyce, Gary Watson, Tom Adams, Patrick Connor", "| Katharine Blake, Tom Adams, Reed De Rouen, Francis de Wolff"]}, {"page": "The Fighting Prince of Donegal", "response": ["*Tom Adams as Henry O'Neill"]}, {"page": "Hammer House of Mystery and Suspense", "response": ["| Dirk Benedict, Jenny Seagrove, George Sewell, John Paul, Tom Adams, Burt Kwouk, James Ellis, Reginald Marsh, Alibe Parsons, Hugh Morton"]}, {"page": "The Pyrates", "response": ["*Tom Adams as Calico Jack Rackham "]}, {"page": "Journey to the Unknown", "response": ["The series has a fantasy, science fiction, supernatural and horror theme, very similar to the American television series The Twilight Zone, and deals with normal people whose everyday situations somehow become extraordinary. It featured both British and American actors: American actors included George Maharis, Vera Miles, Barbara Bel Geddes, Patty Duke, Carol Lynley, Joseph Cotten, Stefanie Powers and Brandon deWilde, along with familiar British actors such as Dennis Waterman, Jane Asher, Kay Walsh, Roddy McDowall, Nanette Newman, Ann Bell and Tom Adams. Seventeen episodes were produced.Journey to the Unknown episode guide. Directors of the episodes included Roy Ward Baker, Alan Gibson, Robert Stevens, Don Chaffey and Michael Lindsay-Hogg. Each episode was executive-produced either by Joan Harrison or Norman Lloyd, both of whom had co-produced Alfred Hitchcock Presents and The Alfred Hitchcock Hour from 1955 to 1965."]}, {"page": "List of The Avengers and The New Avengers cast members", "response": ["* Tom Adams"]}, {"page": "Tom Adams", "response": ["* Tom Adams (actor) (1938–2014), English actor", "* Tom Adams (cricketer) (1808–1894), English cricketer", "* Tom Adams (illustrator) (1926–2019), American illustrator", "* Tom Adams (bluegrass musician) (born 1958), American bluegrass musician", "* Tom Adams (politician) (1931–1985), Prime Minister of Barbados, real name Jon Adams", "* Tom Adams (entrepreneur) (born 1972), Swedish-American businessman", "* Tom Adams (Canadian football) (born 1934), Canadian football end", "* Tom Adams (American football) (born 1940), American football player"]}, {"page": "List of American films of 1966", "response": ["| The Fighting Prince of Donegal || Michael O'Herlihy || Peter McEnery, Susan Hampshire, Tom Adams || Adventure|| Walt Disney"]}, {"page": "Von Richthofen and Brown", "response": ["* Tom Adams as Owen"]}, {"page": "List of British films of 1965", "response": ["|Licensed to Kill || Lindsay Shonteff || Tom Adams, John Arnatt, Peter Bull|| Spy comedy/thriller||"]}, {"page": "List of British films of 1966", "response": ["|Where the Bullets Fly ||John Gilling||Tom Adams, Dawn Addams ||Espionage||"]}, {"page": "List of former Emmerdale characters", "response": ["|rowspan=\"2\"|Malcolm Bates || Tom Adams || rowspan=\"2\"| 1984, 1987–1989, 1991"]}, {"page": "Licensed to Kill (1965 film)", "response": ["Licensed to Kill is an Eastmancolor 1965 superspy imitation James Bond film starring Tom Adams as British secret agent Charles Vine. It was directed and co-written by Lindsay Shonteff. Producer Joseph E. Levine picked it up for American and worldwide distribution and reedited it under the title The Second Best Secret Agent in the Whole Wide World.Blake, Matt & Deal, David The Eurospy Guide Luminary Press 2004", "Facing numerous assassination attempts, a Swedish scientist who has invented an anti-gravity device and his daughter seek to provide the invention to the United Kingdom. With James Bond unavailable, H.M. Government provides Agent Charles Vine (Tom Adams), a former mathematician, as a bodyguard and assassin.", "* Tom Adams as Charles Vine", "What Eon Productions's reaction was to the blatant imitation is not known, but Shonteff was missing from the two Vine sequels starring Tom Adams:"]}, {"page": "2014 in film", "response": ["| style=\"text-align:center;\"| 11 || Tom Adams || style=\"text-align:center;\"| 76 ||style=\"text-align:center;\"| English || style=\"text-align:center;\"| Actor || "]}, {"page": "Ghost Squad (TV series)", "response": ["* 5.  High Wire: A wave of bank robberies across Western Europe and a circus playing nearby each time leads Craig to get a job with them after saving the boss's (William Hartnell) life. Rice, the boss worked with Wilson in Special Ops in WWII. Hartnell with no stand-in got very wet doing underwater escapes in this show. Also features John Cairney, Tom Adams and André Maranne."]}, {"page": "A Prize of Arms", "response": ["A Prize of Arms is a 1962 British crime film directed by Cliff Owen and starring Stanley Baker, Helmut Schmid, Patrick Magee and Tom Bell with early appearances by several actors including Fulton Mackay, Michael Ripper,Geoffrey Palmer, Tom Adams and Rodney Bewes. Set in 1956, the film follows a criminal gang as it tries to rob an army pay convoy during the Suez Crisis.", "* Tom Adams as Corporal Glenn"]}, {"page": "The Peaches", "response": ["Directed by Michael Gill and written by Yvonne Gilan, his then wife, it stars Juliet Harmer as the Very Beautiful Girl, Tom Adams as The Boy Next Door, and is narrated by Peter Ustinov.  It also features an appearance from the nine-year-old A. A. Gill, son of the director and writer. ", "*Tom Adams as The Boy Next Door"]}, {"page": "Fathom (1967 film)", "response": ["| Tom Adams || Mike, Owner of Casa Miguel"]}, {"page": "Subterfuge (1968 film)", "response": ["* Tom Adams as Peter Langley "]}, {"page": "Tom (given name)", "response": ["* Tom Adams (actor), English actor"]}, {"page": "Journey to Midnight", "response": ["*Tom Adams as Jerry Crown"]}, {"page": "This Is My Street", "response": ["Harry eventually tires of Marge when he meets her younger, educated sister, Jinny (Annette Andre) who has returned from college. It is clear that he is a man for whom the chase is more interesting than the catch, in this case even more so because Jinny has a boyfriend, hospital doctor Paul (Tom Adams); the two men, with their differing class backgrounds, show mutual resentment of each other, with Paul denigrating Harry as a barrow boy. Marge is still infatuated with Harry and jealous of Jinny, and suggests eloping and leaving Cindy behind.  When she discovers Harry plans to marry her sister she attempts to kill herself by putting her head in the gas oven. She is saved by a shower which leads her mother to bring in the washing, close enough to the house that she smells the gas. She has left a suicide note exposing her affair with Harry, but her mother's chance intervention means an ambulance rushes her to hospital. Mother evicts Harry, and Jinny breaks it off with him. Mother suggests to Sid that he finds another job in ‘a nice clean area”."]}, {"page": "Where the Bullets Fly", "response": ["Where the Bullets Fly is a 1966 British comedy spy film directed by John Gilling and starring Tom Adams as Charles Vine and John Arnatt repeating their roles from Licensed to Kill. It also stars Dawn Addams, Tim Barrett and Michael Ripper.", "* Tom Adams - Charles Vine", "A third film in the Charles Vine series, called Somebody's Stolen Our Russian Spy (also known as O.K. Yevtushenko) was produced by James Ward, and written by Michael Pittock. The script was polished and directed by José Luis Madrid, who shot the whole film in Spain rather than United Kingdom where the previous instalments were made. Tom Adams reprised his role as Vine."]}, {"page": "Duel of Hearts", "response": ["* Tom Adams ...  Magistrate"]}, {"page": "List of Emmerdale Farm characters (1988)", "response": ["| Malcolm Bates' (Tom Adams) second wife. She gives birth to their son William in October 1987. She and William attend Malcolm's daughter, Kathy's (Malandra Burrows) wedding to Jackie Merrick (Ian Sharrock).", "| The son of Sonia (Erica Lynley) and Malcolm Bates (Tom Adams)."]}, {"page": "The Daredevil Men", "response": ["The Daredevil Men is a 1972 British short subject detailing the activities of stunt performers and stunt arrangers featuring Tom Adams."]}]}}