{"wiki_id": "http://www.wikidata.org/entity/Q11239404", "itemLabel": "Michael Green", "itemDescription": "British theologian and author", "wikipedia_url": "https://en.wikipedia.org/wiki/Michael_Green_(theologian)", "wikipedia_page": {"main": "Edward Michael Bankes Green (20 August 1930 – 6 February 2019) was a British theologian, Anglican priest, Christian apologist and author of more than 50 books.", "link_mentions": [{"page": "Michael Green", "response": ["Michael Green may refer to:", "* Michael Green (biologist), professor at the University of Massachusetts Amherst", "* Michael Green (physicist) (born 1946), professor at Queen Mary University", "* Michael Green (political expert) (born 1961), professor at Georgetown", "* Michael Green (humorist) (1927–2018), British author and journalist", "* Michael Green (painter and sculptor) (born 1929), British painter and sculptor", "* Michael Green (agent), American talent manager and film producer", "* Michael Green (radio), British former controller of BBC Radio 4", "* Michael Green (writer), American screenwriter, comics writer, and television producer", "* Michael Green (youtuber), American vlogger, son of The Angry Grandpa", "* Michael Green (diplomat) (died 2012), New Zealand diplomat", "* Michael Green (soccer) (born 1989), American", "* Michael Green (Australian rules footballer) (born 1948)", "* Michael Green (cricketer, born 1891)", "* Michael Green (cricketer, born 1951)", "* Michael Green (field hockey) (born 1972), German field hockey player", "* Michael Green (sailor) (born 1954), Olympic sailor", "* Michael Green (sprinter) (born 1970), Jamaican", "* Michael Green (swimmer) (born 1963), British", "* Michael Green (tennis) (born 1937), American player in the 1950s and 60s", "* Michael Green (theologian) (1930-2019), British Anglican priest", "* Michael Green (New York lawyer) (born 1961), District Attorney for Monroe County, New York", "* Michael Green (architect) (born 1966), Canadian architect", "* Michael Green (murder victim), lynched near Upper Marlboro, Maryland. September 1, 1878", "* Grant Shapps, who used Michael Green as a pseudonym for business purposes", "* Heydon Prowse, who used the name Michael Green when running for election against Shapps", "* Michael Greene (born 1933), film & TV actor", "* C. Michael Greene, American arts executive"]}, {"page": "Oxford Inter-Collegiate Christian Union", "response": ["The 1950s saw OICCU at perhaps its greatest numerical strength, while the SCM was seen to have moved towards Marxism. One leading figure at this time was Michael Green (President in 1952), who has been a leading evangelical in the Church of England and then the Anglican Communion since the 1960s. Green has taken a particular interest in promoting the Charismatic Movement, including within OICCU.", "A feature of the post-war years has been the custom of triennial missions which attempt to explain the gospel to every undergraduate. These missions can trace their history back to the visit of Dwight Moody and Ira D. Sankey in 1882, but the current model began with a 1940 mission led by Lloyd-Jones. Subsequent main speakers have included Michael Green, Dick Lucas (long-time rector of St Helen's Bishopsgate), John Stott; one of Stott's series of talks was subsequently published as Basic Christianity, and Tim Keller."]}, {"page": "St John's College, Nottingham", "response": ["It was under Coggan's successor, Prebendary Hugh Jordan, that discussion of a move away from London began. Jordan believed that the college's future lay outside of the capital city and nearer to a university, and he learnt that a site was available in Nottingham, whose university's theological department was growing in reputation. In 1970, Michael Green, who succeeded Jordan as principal, oversaw the move from London to the college's current location in Bramcote, Nottingham. This move meant that the formal name 'London College of Divinity' was not longer applicable, and 'St John's' became the legal title of the institution.", "*Michael Green (1969 to 1975)"]}, {"page": "1930 in the United Kingdom", "response": ["* 20 August – Michael Green, theologian (died 2019)"]}, {"page": "Penal substitution", "response": ["The ransom theory of atonement was the nearly predominant view accepted in the period of the Early Church Fathers.Michael Green, The Empty Cross of Jesus (Eastbourne: Kingsway, 2004; first published 1984), p. 64-5: 'The simplest and most obvious understanding of the cross is to see it as the supreme example. ... This is a favourite theme in the early Fathers, as H.E.W. Turner showed in The Patristic Doctrine of Redemption. ... It can scarcely be denied that much of the second century understanding of the cross was frankly exemplarist.' As ransom theory of atonement began to fade from view in the Middle ages, other theories such as the satisfaction theory began to develop.J. F. Bethune-Baker, An introduction to the early history of Christian doctrine to the time of the Council of Chalcedon (London: Methuen & Co, 1903), p. 328, 351-2: 'Of the various aspects of the Atonement which are represented in the pages of the New Testament, the early Fathers chiefly dwell on those of sacrifice (and obedience), reconciliation, illumination by knowledge, and ransom. Not till a later time was the idea of satisfaction followed up' [p. 328]; 'The only satisfaction which was thought of was the satisfaction which the penitent himself makes. There is no suggestion of any satisfaction of the divine justice through the sufferings of Christ. ' [p. 328, n. 3]; 'From this review of the teaching of the Church it will be seen that there is only the most slender support to be found in the earliest centuries for some of the views that became current at a later time. It is at least clear that the sufferings of Christ were not regarded as an exchange or substitution of penalty, or as punishment inflicted on him by the Father for our sins. There is, that is to say, no idea of vicarious satisfaction, either in the sense that our sins are imputed to Christ and his obedience to us, or in the sense that God was angry with him for our sakes and inflicted on him punishment due to us.' [p. 351-2].  It has been generally recognized that only hints of penal substitutionary atonement can be found in the writing of the Early Church, with the most explicit articulations arriving during the time of the Reformation."]}, {"page": "List of University of Oxford people in religion", "response": ["*Michael Green (Exeter and Wycliffe Hall) priest, professor, and evangelist"]}, {"page": "Edward Michael Bankes Green", "response": ["#REDIRECT Michael Green (theologian)"]}, {"page": "E. J. H. Nash", "response": ["Despite the involvement of some of his protégés, (David Watson, Michael Green, John Collins, David Macinnes and later Nicky Gumbel) he did not welcome the Charismatic Renewal of the early 60s and 70s. On hearing one leader expressing himself in a way characteristic of the renewal, he said \"will officers please not pray such emotional prayers,\" something David Watson records as a disappointment: \"although slight in itself, [it] seemed to oppose all the new found joy and freedom in worship that had become so important to me.\"", "Through him many influential people became converted to Christianity, including such clergy as John Stott, David Sheppard, Michael GreenMichael Green Thirty Years That Changed the World: The Book of Acts for Today (Grand Rapids: Eerdmans, 2004) 178 John Pollock, Dick Lucas, Bishop Maurice Wood, Bishop Timothy Dudley-Smith, Mark Ruston, John Collins, Hugh Palmer, Mark Ashton, Paul Perkins, John Coles, William Taylor, Henry Chadwick,  Richard Bewes and David Macinnes.  David Watson was invited by David Sheppard and attended thirty-five camps in five years.David Watson You are My God (London: Hodder, 1983) 122 Sir Fred Catherwood also participated.  Among Nash's other spiritual progeny were several principals of theological colleges, and over 200 clergy.  In education there were several head teachers and over 150 teaching staff. In sport, John Dewes and David Sheppard both played cricket for England. In the military, there was Brigadier Ian Dobbie. Justin Welby, the current Archbishop of Canterbury, was also a participant."]}, {"page": "Gerald Coates", "response": ["P D Hocken says that Coates is a \"dynamic and somewhat flamboyant figure, whose insistence on the gospel of grace has sometimes produced controversy.\"Stanley M Burgess, Eduard M van der Maas (eds) New International Dictionary of Pentecostal and Charismatic Movements (Grand Rapids: Zondervan, 2002) s.v.  \"Gerald Coates\"  Karla Poewe notes his reputation for generosity when working with churches of other nations.Karla O. Poewe Charismatic Christianity as a Global Culture (Columbia: University of South Carolina Press, 1994) 25 Sir Cliff Richard says \"As a Christian influencer, Gerald has been at the forefront of much of today's radical church activity, I've come to respect his opinions and initiatives, as well as his more personal counsel.\"  Prolific author and former minister of Westminster Chapel R. T. Kendall says, \"Gerald Coates is brilliant, controversial, unpredictable, lovable and quotable.\"  Author Michael Green said, \"He is a colourful troubadour in a world of grey men ...committed to Christian unity.\" Author and speaker J.John says \"Gerald's influence on British Christianity over the last 40 years has been extraordinary.\""]}, {"page": "Roger T. Forster", "response": ["Forster studied mathematics and theology at Cambridge University from 1951 to 1954.Anthony O'Sullivan \"Roger Forster and the Ichthus Christian Fellowship: The Development of a Charismatic Missiology\" Pneuma 16 no 2 Fall 1994, 248 He was a contemporary of David Watson, Michael Harper, Michael Green and David Sheppard. By the standards of his later evangelical beliefs, he considered his Methodist upbringing to be both liberal and without a clear presentation of the Christian gospel. When he heard an explanation of it by an Anglican bishop (Hugh Gough) at the Christian Union, he decided, \"to follow Christ.\" Three years later,  he reported an experience of being baptised in the Spirit which he described as \"sine curves of love going through the room.\" Sider observes that the foundations of later values began to take shape at this point: a commitment to combine evangelical ministry with social action, together with recognition and service to all true people of God, irrespective of church affiliation."]}, {"page": "Annihilationism", "response": ["* Michael GreenMichael Green, Evangelism Through the Local Church. London: Hodder and Stoughton, 1990, p69–70"]}, {"page": "Six Preachers", "response": ["* Michael Green"]}, {"page": "Basil Atkinson", "response": ["Atkinson was most notable for his advocacy of soul sleep and conditional immortality.Basil F. C. Atkinson, Life and Immortality: an Examination of the Nature and Meaning of Life and Death as They Are Revealed in the Scriptures Taunton, England within the Cambridge Inter-Collegiate Christian Union (CICCU) and the Inter Varsity Fellowship in the 1920s where he influenced, among others, John W. Wenham.Pibworth: \"It is in this book that Wenham says \"I had learnt the doctrine from Basil Atkinson (as recounted in Chapter 8) [of his autobiography, Facing Hell] in about 1934\". The role of Basil Atkinson, conditional immortality and other evangelicals is discussed extensively in Wenham's autobiography. Wenham states that J. Stafford Wright, Robert Clark and Norman Anderson and Michael Green also shared conditional immortality views. It is worth noting that they also all studied at Cambridge.\""]}, {"page": "Recapitulation theory of atonement", "response": ["While it is sometimes absent from summaries of atonement theories,E.g. Leon Morris, 'Theories of the Atonement' in Elwell Evangelical Dictionary. more comprehensive overviews of the history of the atonement doctrine typically include a section about the “recapitulation” view of the atonement, which was first clearly formulated by Irenaeus of Lyons.H. N. Oxenham, ‘‘The Catholic doctrine of the atonement’’ (London: Longman, Green, Longman, Roberts, and Green, 1865), p. 114-118James Bethune-Baker, An introduction to the early history of Christian doctrine to the time of the Council of Chalcedon (London: Methuen & Co, 1903), p. 333-337J. K. Mozley, The doctrine of the atonement (New York: Charles Scribner's Sons, 1916), p. 100-101R. Mackintosh, Historic theories of the atonement (London: Hodder & Stoughton, 1920), p. 89-90L. W. Grensted, A Short History of the Doctrine of the Atonement (Manchester: Manchester University Press, 1920), p. 57-60Robert S. Franks, A history of the doctrine of the work of Christ in its ecclesiastical development vol. 1 (London: Hodder and Stoughton), p. 37ff.Gustaf Aulen, Christus Victor (1931) (London: SPCK), p. 16ff., esp. p. 20-22,29Michael Green, The Empty Cross of Jesus (Eastbourne: Kingsway, 2004; first published 1984), p. 66-68", "For Irenaeus, the ultimate goal of Christ's work of solidarity with humankind is to make humankind divine. Of Jesus he says, he 'became what we are, that He might bring us to be even what He is Himself'.Irenaeus, Against Heresies Preface to Book 5 in A. Roberts and J. Donaldson (eds), The Writings of Irenaeus Vol. 2 (Edinburgh: T & T Clark, 1869), p. 55 This idea has been most influential in the Eastern Christianity, particularly within the Eastern Orthodox Church,Michael Green, ‘‘The Empty Cross of Jesus’’ (Eastbourne: Kingsway, 2004; first published 1984), p. 67 having been taken on by many other Church Fathers, such as Ss. Athanasius, Gregory of Nazianzus, Augustine, and Maximus the Confessor. This Eastern Orthodox theological development out of the recapitulation view of the atonement is called theosis (\"deification\")."]}, {"page": "Titus Trust", "response": ["Titus Trust grew out of the Iwerne Trust which was created in 1932 by E. J. H. Nash, popularly known as \"Bash\", in the village of Iwerne Minster in  Dorset, to promote evangelicalism in the Church of England and in senior leadership positions in the British establishment.  Many men who became influential church leaders attended the Iwerne camps, including John Stott, David Sheppard, Michael Green, Dick Lucas and Justin Welby. Randle Manwaring wrote  "]}, {"page": "2019 in the United Kingdom", "response": ["**Michael Green, 88, British theologian."]}, {"page": "Deaths in February 2019", "response": ["*Michael Green, 88, British theologian.Evangelist Michael Green dies (1930-2019)"]}, {"page": "The Bible Speaks Today", "response": ["*Michael Green, The Message of Matthew"]}, {"page": "E. Michael Green", "response": ["#REDIRECT Michael Green (theologian)"]}]}}