{"wiki_id": "http://www.wikidata.org/entity/Q1131497", "itemLabel": "May Sinclair", "itemDescription": "British novelist 1863-1946", "wikipedia_url": "https://en.wikipedia.org/wiki/May_Sinclair", "wikipedia_page": {"main": "May Sinclair was the pseudonym of Mary Amelia St. Clair (24 August 1863 – 14 November 1946), a popular British writer who wrote about two dozen novels, short stories and poetry. She was an active suffragist, and member of the Woman Writers' Suffrage League. She once dressed up as a demure, rebel Jane Austen for a suffrage fundraising event. Sinclair was also a significant critic in the area of modernist poetry and prose, and she is attributed with first using the term 'stream of consciousness' in a literary context, when reviewing the first volumes of Dorothy Richardson's novel sequence Pilgrimage (1915–1967), in The Egoist, April 1918.", "link_mentions": [{"page": "Anne Brontë", "response": ["It is easy to underestimate the extent to which the novel challenged the social and legal structures. In 1913 May Sinclair said that the slamming of Helen Huntingdon's bedroom door against her husband reverberated throughout Victorian England.Brontё, Anne. The Tenant of Wildfell Hall. 1848. Introduction. Winifred Gerin. New York: Penguin. 1979."]}, {"page": "List of English-language poets", "response": ["*May Sinclair (1863–1946, E)"]}, {"page": "Ezra Pound", "response": ["Pound mixed with the cream of London's literary circle, including Maurice Hewlett, Laurence Binyon, Frederic Manning, Ernest Rhys, May Sinclair, Ellen Terry, George Bernard Shaw, Hilaire Belloc, T. E. Hulme, and F. S. Flint.Tytell (1987), 42–45 Through the Shakespears, he was introduced to the poet W. B. Yeats, Olivia Shakespear's former lover. He had already sent Yeats a copy of A Lume Spento, and Yeats had apparently found it \"charming\".Tytell (1987), 46 Pound wrote to William Carlos Williams on 3 February 1909: \"Am by way of falling into the crowd that does things here. London, deah old Lundon, is the place for poesy.\"Pound (1971), 7 According to Richard Aldington, London found Pound amusing. The newspapers interviewed him,Aldington (1941), 105. and he was mentioned in Punch magazine, which on 23 June 1909 described \"Mr. Ezekiel Ton\" as \"the most remarkable thing in poetry since Robert Browning ... [blending] the imagery of the unfettered West, the vocabulary of Wardour Street, and the sinister abandon of Borgiac Italy\".Punch, 23 June 1909, 449; Nadel (2010), 159"]}, {"page": "Ford Madox Ford", "response": ["In 1908, Ford founded The English Review.  Ford published works by Thomas Hardy, H. G. Wells, Joseph Conrad, Henry James, May Sinclair, John Galsworthy and William Butler Yeats; and debuted works of Ezra Pound, Wyndham Lewis, D. H. Lawrence and Norman Douglas. Ezra Pound and other Modernist poets in London in the teens particularly valued Ford's poetry as exemplifying treatment of modern subjects in contemporary diction.  In 1924, he founded The Transatlantic Review, a journal with great influence on modern literature. Staying with the artistic community in the Latin Quarter of Paris, Ford befriended James Joyce, Ernest Hemingway, Gertrude Stein, Ezra Pound and Jean Rhys, all of whom he would publish (Ford was the model for the character Braddocks in Hemingway's The Sun Also Rises).  Basil Bunting worked as Ford's assistant on the magazine."]}, {"page": "Romantic", "response": ["* The Romantic (1920 novel), by May Sinclair"]}, {"page": "Stream of consciousness", "response": ["In literary criticism, stream of consciousness is a narrative mode or method that attempts \"to depict the multitudinous thoughts and feelings which pass through the mind\" of a narrator.J. A. Cuddon, A Dictionary of Literary Terms. (Harmondsworth, Penguin Books,1984), pp. 660–1). The term was coined by Alexander Bain in 1855 in the first edition of The Senses and the Intellect, when he wrote, \"The concurrence of Sensations in one common stream of consciousness (on the same cerebral highway) enables those of different senses to be associated as readily as the sensations of the same sense\" (p. 359).William C. Waterhouse, \"The Source of the Stream\". NY Times Review of Books, 22 November 2007. But it is commonly credited to William James who used it in 1890 in his The Principles of Psychology. In 1918, the novelist May Sinclair (1863–1946) first applied the term stream of consciousness, in a literary context, when discussing Dorothy Richardson's novels.May Sinclair, 'The Novels of Dorothy Richardson', The Egoist, Vol. 5, No. 4, (April 1908), pp. 57–58. Pointed Roofs (1915), the first work in Richardson's series of 13 semi-autobiographical novels titled Pilgrimage, is the first complete stream-of-consciousness novel published in English. However, in 1934, Richardson comments that \"Proust, James Joyce, Virginia Woolf & D.R. ... were all using 'the new method', though very differently, simultaneously\".In a letter to the bookseller and publisher Sylvia Beach Windows of Modernism: Selected Letters of Dorothy Richardson, ed. Gloria G. Fromm Athens, Georgia, University of Georgia Press, 1995, 282. There were, however, many earlier precursors and the technique is still used by contemporary writers.", "The term was first applied in a literary context in The Egoist, April 1918, by May Sinclair, in relation to the early volumes of Dorothy Richardson's novel sequence Pilgrimage. Richardson, however, describes the term as a \"lamentably ill-chosen metaphor\".\"Novels\", Life and Letters, 56, March 1948, p. 189."]}, {"page": "1916 in literature", "response": ["*May Sinclair – Tasker Jevons"]}, {"page": "1915 in literature", "response": ["*May Sinclair – A Journal of Impressions in Belgium"]}, {"page": "1917 in literature", "response": ["*May Sinclair – The Tree of Heaven"]}, {"page": "1904 in literature", "response": ["*May Sinclair – The Divine Fire"]}, {"page": "1918 in literature", "response": ["**The English writer May Sinclair introduces the term \"Stream of consciousness\" to describe a narrative mode, in a discussion of Dorothy Richardson's novel sequence Pilgrimage in The Egoist."]}, {"page": "1921 in literature", "response": ["*May Sinclair - Mr. Waddington of Wyck"]}, {"page": "1922 in literature", "response": ["*May Sinclair – Life and Death of Harriett Frean"]}, {"page": "1946 in literature", "response": ["*November 14 – May Sinclair, English novelist (born 1863)"]}, {"page": "The Tenant of Wildfell Hall", "response": ["Most critics now consider The Tenant of Wildfell Hall to be one of the first feminist novels. May Sinclair, in 1913, said that \"the slamming of [Helen's] bedroom door against her husband reverberated throughout Victorian England.\"  In leaving her husband and taking away their child, Helen violates not only social conventions but also the early 19th century English law.", "Elizabeth Gaskell repeated Charlotte's words about Anne in The Life of Charlotte Brontë, claiming that the subject of The Tenant \"was painfully discordant to one who would fain have sheltered herself from all but peaceful and religious ideas.\" In his essay on Emily Brontë, Algernon Charles Swinburne briefly mentioned The Tenant in the context of Branwell's decline as a novel \"which deserves perhaps a little more notice and recognition than it has ever received\" and added that \"as a study of utterly flaccid and invertebrate immorality it bears signs of more faithful transcription from life than anything in Jane Eyre or Wuthering Heights.\"  Margaret Oliphant believed that Anne \"would have no right to be considered at all as a writer but for her association with [her sisters'] imperative spirits.\" Mary Ward, a novelist, who was widely known for her anti-feminist views, in her introduction to 1900 edition of The Tenant, accused Anne of \"the narrowness of view\" and absence of \"some subtle, innate correspondence between eye and brain, between brain and hand, [which] was present in Emily and Charlotte.\" She concluded that \"it is not as the writer of Wildfell Hall, but as the sister of Charlotte and Emily Brontë, that Anne Brontë escapes oblivion.\" May Sinclair, while famously saying that \"when [Anne] slammed the door of Mrs Huntingdon's bedroom she slammed it in the face of society and all existing moralities and conventions,\" considered that she \"had no genius.\" Despite that, her opinion about The Tenant was unexpectedly high: \"There are scenes, there are situations, in Anne's amazing novel, which for sheer audacity stand alone in mid-Victorian literature, and which would hold their own in the literature of revolt that followed... Her diagnosis of certain states, her realization of certain motives, suggests Balzac rather than any of the Brontës.\" In her introduction to the 1914 edition of the novel Sinclair was also ambivalent about Anne and her novel — while acclaiming it as \"the first presentment of that Feminist novel\", she stated that \"it bores to tears.\" Her opinion of Helen was also mixed: \"If Agnes Grey is a little prig, Helen Huntingdon is a prig enormous... She is Anne Bronte's idea of noble womanhood, the first of the modern, large-souled, intellectual heroines.\" The only thing Sinclair wholly approved of was the author's treatment of marital laws of the time: \"Anne Brontë attacks her problem with a freedom and audacity before which her sisters’ boldest enterprises seem cowardly and restrained... Her behaviour is the least unusual, not to say revolutionary.\""]}, {"page": "World War I in literature", "response": ["May Sinclair volunteered with the Munro Ambulance Corps in 1914 and published her account of the front in Belgium as A Journal of Impressions in Belgium (1915). She followed this with three novels about the war, Tasker Jevons (1916), The Tree of Heaven (1917) and The Romantic (1920). Journalist Evadne Price wrote a semi-biographical novel Not So Quiet: Stepdaughters of War (1930) about ambulance drivers based on women she had interviewed."]}, {"page": "Dorothy Richardson", "response": ["In a review of Pointed Roofs (The Egoist April 1918), May Sinclair first applied the term \"stream of consciousness\" in her discussion of Richardson's stylistic innovations. Pointed Roofs was the first volume in a sequence of 13 novels titled Pilgrimage, the first complete stream of consciousness novel published in English. The term was coined by William James in 1890 in his The Principles of Psychology. In a letter to the bookseller and publisher Sylvia Beach in 1934, Richardson comments that \"Proust, James Joyce, Virginia Woolf & D.R. ... were all using 'the new method', though very differently, simultaneously\".Windows of Modernism: Selected Letters of Dorothy Richardson, ed. Gloria G. Fromm Athens, Georgia, University of Georgia Press, 1995, 282.", "Richardson hated the term, calling it in 1949 \"that lamentably meaningless metaphor 'The Shroud of Consciousness' borrowed ... by May Sinclair from the epistemologists, ... to describe my work, & still, in Lit. criticism. pushing its inane career\".Windows of Modernism, 600."]}, {"page": "A. E. Coppard", "response": ["Coppard's short stories were praised by Ford Madox Ford and Frank O'Connor. Coppard's book Nixey's Harlequin received good reviews from L. A. G. Strong, Gerald Bullett, and The Times Literary Supplement (which praised Coppard's \"brilliant virtuosity as a pure spinner of tales\").Advertisement for Nixey's Harlequin in The American Mercury, January 1932, (p.145). Coppard's supernatural fiction was admired by Algernon Blackwood.\"Blackwood was widely read in supernatural fiction and he remarked to Derleth that authors like A. E. Coppard, H. Russell Wakefield, Henry S. Whitehead, May Sinclair and Mary Wilkins Freeman never failed to please.\" Mike Ashley, Starlight Man : The Extraordinary Life of Algernon Blackwood. London : Constable, 2001.  (p.321) Brian Stableford argues that Coppard's fantasy has a similar style to that of Walter de la Mare and that \"many of his mercurial and oddly plaintive fantasies are deeply disturbing\"."]}, {"page": "Lady Cynthia Asquith", "response": ["Asquith became known for editing The Ghost Book, an anthology of supernatural fiction, including work by D. H. Lawrence, Algernon Blackwood, Arthur Machen, Oliver Onions, and May Sinclair.Mike Ashley and William Contento, The Supernatural Index: A Listing of Fantasy, Supernatural, Occult, Weird, and Horror Anthologies. Greenwood Publishing, 1995. , pp. 728–729."]}, {"page": "Almroth Wright", "response": ["Wright was strongly opposed to women's suffrage. He argued that women's brains were innately different from men's and were not constituted to deal with social and public issues. His arguments were most fully expounded in his book The Unexpurgated Case Against Woman Suffrage (1913). In the book, Wright also vigorously opposes the professional development of women. Rebecca West and May Sinclair both wrote articles criticizing Wright's opposition to women's suffrage. Charlotte Perkins Gilman satirized Wright's opposition to women's suffrage in her novel Herland."]}, {"page": "Mary Amelia St. Clair", "response": ["#REDIRECT May Sinclair"]}, {"page": "Cicely Hamilton", "response": ["In 1908 she and Bessie Hatton founded the Women Writers' Suffrage League. This grew to around 400 members, including Ivy Compton-Burnett, Sarah Grand, Violet Hunt, Marie Belloc Lowndes, Alice Meynell, Olive Schreiner, Evelyn Sharp, May Sinclair and Margaret L. Woods. It produced campaigning literature, written by Sinclair amongst others, and recruited many prominent male supporters. "]}, {"page": "The Dial", "response": ["* Vol. 72 (January–June 1922) Conrad Aiken, Sherwood Anderson, Louis Aragon, Alexander Archipenko, Maxwell Bodenheim, Ivan Bunin, Kenneth Burke, Ananda Coomaraswamy, Hart Crane, Thomas Jewell Craven, S. Foster Damon, E. E. Cummings, Alfeo Faggi, Hermann Hesse, A. L. Kroeber, D. H. Lawrence, Henri Matisse, Henry McBride, Raymond Mortimer, Paul Rosenfeld, Henri Rousseau, Bertrand Russell, Carl Sandburg, George Santayana, Gilbert Seldes, May Sinclair, Felix Timmermans, Paul Valéry"]}, {"page": "Mary Butts", "response": ["In the first years of World War I, she was living in London, undertaking social work for the London County Council in Hackney Wick, and in a lesbian relationship. She then met the modernist poet, John Rodker, a pacifist at that time hiding in Dorking with fellow poet and pacifist Robert Trevelyan. In May 1918 she married Rodker, and in November 1920 gave birth to their daughter, Camilla Elizabeth. Butts also adopted Rodker's pacifism. She helped Rodker to set up as a publisher, and through him she met several modernist writers, including Ezra Pound, Wyndham Lewis, Ford Madox Ford, Roger Fry and May Sinclair. Shortly after the birth of her daughter she began a liaison with Cecil Maitland."]}, {"page": "List of suffragists and suffragettes", "response": ["* May Sinclair (1863-1946) – member of the Woman Writers' Suffrage League"]}, {"page": "Cheltenham Ladies' College", "response": ["*May Sinclair, writer"]}, {"page": "Publishers Weekly list of bestselling novels in the United States in the 1910s", "response": ["# The Tree of Heaven by May Sinclair"]}, {"page": "Rock Ferry", "response": ["Other areas of architectural significance include Egerton Park, an oasis of late nineteenth-century villas in a leafy setting, and the Byrne Avenue Baths, a 1930s swimming pool with plenty of Art Deco features, which closed in February 2009. The row of semi-detached houses on Rockville Street, built in 1837, is one of the earliest rows of private houses in Britain to use Gothic detailing on their exteriors, while St Anne's Catholic Church on Highfield Road was designed by E. W. Pugin. The writer May Sinclair was a Rock Park resident. F. E. Smith, later Earl of Birkenhead, also briefly lived in a house on Green Lawn. Former Australian Premier Sir Charles Gavan Duffy lived at Rose Cottage, which still stands on Rockville Street, where his son, Irish politician George Gavan Duffy, was born in 1882."]}, {"page": "List of modernist women writers", "response": ["* May Sinclair (1863–1946), British novelist and short story writer."]}, {"page": "Women Writers' Suffrage League", "response": ["* May Sinclair"]}, {"page": "Sinclair (surname)", "response": ["*May Sinclair, British novelist"]}, {"page": "Miss May Sinclair", "response": ["#REDIRECT May Sinclair"]}, {"page": "1891 in poetry", "response": ["* May Sinclair, Essays in Verse"]}, {"page": "Norton Anthology of Literature by Women", "response": ["* May Sinclair (1863–1946)"]}, {"page": "Henry S. Whitehead", "response": ["In a letter to August Derleth, Algernon Blackwood included Whitehead on a list of writers that he admired.\"Blackwood was widely read in supernatural fiction and he remarked to Derleth that authors like A. E. Coppard, H. Russell Wakefield, Henry S. Whitehead, May Sinclair and Mary Wilkins Freeman never failed to please.\" Mike Ashley, Starlight Man : The Extraordinary Life of Algernon Blackwood. London : Constable, 2001.  (p.321)"]}, {"page": "Margery Lawrence", "response": [" Like May Sinclair before her, Lawrence became a confirmed spiritualist and believer in reincarnation in later years, and her book is heavy with didactic occultist dialogue. Another well-known supernatural volume is Master of Shadows (1959)."]}, {"page": "The Book of Fantasy", "response": ["* \"Where Their Fire Is Not Quenched\". May Sinclair, The English Review Oct ’22 (begins page 241)"]}]}}