{"wiki_id": "http://www.wikidata.org/entity/Q1139433", "itemLabel": "Frank Harper", "itemDescription": "British actor and film producer", "wikipedia_url": "https://en.wikipedia.org/wiki/Frank_Harper", "wikipedia_page": {"main": "Frank Harper (born 12 December 1962) is an English actor and film producer. He is best known for his \"hard man\" roles, such as Billy Bright in The Football Factory (2004) and Dog in Lock, Stock and Two Smoking Barrels (1998).", "link_mentions": [{"page": "In the Name of the Father (film)", "response": ["*Frank Harper as Ronnie Smalls"]}, {"page": "2003 in film", "response": ["| Bend It Like Beckham || Fox Searchlight Pictures || Gurinder Chadha (director/screenplay); Guljit Bindra, Paul Mayeda Berges (screenplay); Parminder Nagra, Keira Knightley, Jonathan Rhys Meyers, Anupam Kher, Shaznay Lewis, Archie Panjabi, Shaheen Khan, Frank Harper, Juliet Stevenson, Ameet Chana, Kulvinder Ghir, Pooja Shah, Preeya Kalidas, Trey Farley, Zohra Sehgal, Saraj Chaudhry, Paven Virk, Gary Lineker, Alan Hansen, John Barnes || Comedy, Drama || || Live Action"]}, {"page": "1999 in film", "response": ["| Lock, Stock and Two Smoking Barrels || Summit Entertainment || Guy Ritchie (director/screenplay); Jason Flemyng, Dexter Fletcher, Nick Moran, Jason Statham, Steven Mackintosh, Vinnie Jones, Nicholas Rowe, Lenny McLean, P. H. Moriarty, Frank Harper, Sting, Huggy Leaver, Stephen Marcus, Vas Blackwood, Vera Day, Alan Ford, Danny John-Jules, Victor McGuire, Rob Brydon, Steve Collins || Crime, Thriller || Live action"]}, {"page": "1989 in film", "response": ["| For Queen and Country || Atlantic Entertainment Group || Martin Stellman (director/screenplay); Trix Worrell (screenplay); Denzel Washington, Dorian Healy, Bruce Payne, Amanda Redman, Sean Chapman, Graham McTavish, Geff Francis, Frank Harper, Craig Fairbrass, George Baker, Stella Gonet, Ken Stott, Jimmi Harkishin, Stephen Lawrence, Michael Bray, Colin Thomas, Brian McDermott || Crime, Drama || Live action "]}, {"page": "1993 in film", "response": ["| In the Name of the Father || Universal Pictures || Jim Sheridan (director/screenplay); Terry George (screenplay); Daniel Day-Lewis, Emma Thompson, Pete Postlethwaite, John Lynch, Corin Redgrave, Beatie Edney, John Benfield, Paterson Joseph, Marie Jones, Gerard McSorley, Frank Harper, Mark Sheppard, Don Baker, Tom Wilkinson || Biography, Drama || Live action"]}, {"page": "Lock, Stock and Two Smoking Barrels", "response": ["* Frank Harper as Dog"]}, {"page": "Bend It Like Beckham", "response": ["Chadha, who played an active role in casting, chose Parminder Nagra and Keira Knightley, who would play the two lead roles in the film, while Archie Panjabi and Jonathan Rhys Meyers were in early talks to join the cast. Shaznay Lewis and Anupam Kher were also in final talks. Juliet Stevenson and Frank Harper joined as Paula Paxton and Alan Paxton, mother and father of Jules."]}, {"page": "The Football Factory (film)", "response": ["The Football Factory is a 2004 British sports drama film written and directed by Nick Love and starring Danny Dyer, Tamer Hassan, Frank Harper, Roland Manookian, Neil Maskell and Dudley Sutton. The film is loosely based on the novel of the same name by John King and the first foray into filmmaking by video game producers Rockstar Games (creators of games such as the Grand Theft Auto series, among others), credited as executive producers. The film was released in the United Kingdom on 14 May 2004.", "Tommy Johnson (Danny Dyer) is a member of a violent Chelsea hooligan firm and an eager ornithologist. His friends and fellow hooligans include Tommy's best friend Rod King (Neil Maskell), the hot-tempered Billy Bright (Frank Harper), and impulsive younger members Zeberdee (Roland Manookian) and Raf (Calum MacNab). Tommy spends his days drinking, using drugs, womanising and fighting, much to the disappointment of his grandfather Bill Farrell (Dudley Sutton), a pensioner and veteran who plans to move to Australia with his best friend Albert (John Junkin).", "*Frank Harper — Billy Bright is a man around forty, part of the older generation of the Firm. Throughout the film it is shown that he wants to be the leader of the firm but lacks the composure needed."]}, {"page": "Kevin & Perry Go Large", "response": ["|Frank Harper"]}, {"page": "Tube Tales", "response": ["Cast: (in alphabetical order) Edna Doré (Bag Lady); Frank Harper (Ticket Inspector); William Hoyland (Suicide Victim); Richard Jobson (Vendor); Tom Watson (The Son); Ray Winstone (The Father).", "Cast: (in alphabetical order) Ed Allen (Youth 2); Frank Harper (Station Guard); Morgan Jones (Youth 1); Alan Miller (Old Man); Cleo Sylvestre (Woman).", "Cast: (in alphabetical order) Joao Costa Menezes (?); Doña Croll (Elizabeth); Leonie Elliott (Rosebud); Danny Cerqueira (Station Guard); Frank Harper (Station Guard); Ian Puleston-Davies (Typewriter Man); Rachel Weisz (Angela)."]}, {"page": "Mat Fraser (actor)", "response": ["His film Kung Fu Flid was released in 2009, starring Faye Tozer (formerly of pop group Steps), Frank Harper and Terry Stone.Kung Fu Flid at IMDb"]}, {"page": "Ludger Pistor", "response": ["| Frank Harper"]}, {"page": "For Queen and Country", "response": ["* Frank Harper as Mickey"]}, {"page": "Shane Meadows", "response": ["He has worked twice with Toby Kebbell, Frank Harper, Bob Hoskins, Ladene Hall, Jimmy Hynd, Mat Hand, Dominic Dillon and Darren O. Campbell. He has worked three times with Stephen Graham, Joe Gilgun, Rosamund Hanson, Andrew Ellis, Danielle Watson, Chanel Cresswell, Perry Benson, Kriss Dosanjh and Michael Socha and at least four times with Paddy Considine, Vicky McClure, Andrew Shim (who also had cameo roles in Dead Man's Shoes and The Stairwell ), Thomas Turgoose, Jo Hartley and George Newton.", "Shane Meadows often casts certain actors more than once in his films. Meadows has most frequently worked with Paddy Considine, Vicky McClure, Andrew Shim, Thomas Turgoose, Frank Harper and Jo Hartley.", "! Frank Harper"]}, {"page": "A Room for Romeo Brass", "response": ["* Frank Harper as Joe Brass"]}, {"page": "List of films set in Berlin", "response": ["* St George's Day, 2012 – two elderly and famous British Cousin gangsters have angered a Russian competitor. To reconcile him and to pay their debts they undertake an audacious diamond heist in Berlin. Directed by Frank Harper."]}, {"page": "Bound 4 Da Reload (Casualty)", "response": ["Released on 24 April 2000, the song peaked at number one on the UK Singles Chart on 30 April 2000. The 12-inch of the single was not eligible for the singles chart due to its length, which broke chart regulations and had instead appeared on the UK Albums Chart, reaching number 71. While the record appeared on Top of the Pops during its week at number one, many radio stations refused to play \"Bound 4 Da Reload\" because of its controversial spoken sample taken from the film Lock, Stock and Two Smoking Barrels, spoken by the actors Tony McMahon and Frank Harper (\"Ah! Shit! I've been shot!/I don't fucking believe this, could everyone stop getting shot?\")."]}, {"page": "The Search for John Gissing", "response": ["*Frank Harper — Dexter"]}, {"page": "This Is England", "response": ["* Frank Harper as Lenny"]}, {"page": "Francis Harper", "response": ["* Frank Harper (born 1962), British actor"]}, {"page": "Harper (name)", "response": ["*Frank Harper (born 1962), English actor and producer"]}, {"page": "Andrew Shim", "response": ["| Film debutFirst time partnered with Shane Meadows, Vicky McClure, Frank Harper, Ladene Hall and Paddy Considine", "| Fifth time partnered with Shane Meadows, third time opposite Vicky McClure, second time partnered with Frank Harper and Jo Hartley, first time opposite Thomas Turgoose, Joseph Gilgun, Stephen Graham, Rosamund Hanson, Chanel Cresswell and Michael Socha", "| Third time partnered with Frank Harper"]}, {"page": "Fit but You Know It", "response": ["The music video for the single has a cameo of the cast of The Football Factory which includes Danny Dyer and Frank Harper. In the video, Mike Skinner plays the part of a man picking up his holiday photos from the developers. As the song is playing, he looks through the photos which show scenes from his holiday. The video was released on two separate formats- a DVD single (which also included the video for \"The Irony of it All\" and a bonus DVD which came with some copies of parent album A Grand Don't Come For Free."]}, {"page": "Rise of the Footsoldier", "response": ["* Frank Harper as Jack Whomes"]}, {"page": "Goodbye Charlie Bright", "response": ["*Frank Harper as Tommy's dad"]}, {"page": "Shiner (2000 film)", "response": ["* Frank Harper as Jeff \"Stoney\" Stone "]}, {"page": "Lucky Break (2001 film)", "response": ["*Frank Harper as John Toombes"]}, {"page": "List of English people", "response": ["* Frank Harper (born 1962)"]}, {"page": "Second Sight (TV series)", "response": ["* Frank Harper as DS Tommy Finch"]}, {"page": "Other People's Children (TV series)", "response": ["When Josie (Emma Fielding) marries Matthew (Frank Harper), she already has a child, eight-year-old Rufus (Jacob Engelberg), from her previous marriage to Tom (Denis Lawson). But Josie's patient determination crumbles as Matthew's three children turn against both her and Rufus. Things seem at first to be a lot easier for Josie's ex-husband, Tom, an architect who has two other children besides Rufus (Tom's first wife died when his children were small). Tom has a new partner, the calm, reasonable high-management career woman Elizabeth (Serena Gordon), whom Rufus (who visits Tom regularly) seems to like rather well. However, it's Tom's 25-year-old daughter, Dale (Emilia Fox), who can't bear to see her father in love, and moves back in with him in order to disrupt the romance and their possible future marriage. Indeed, Dale had earlier managed to drive away Josie. Meanwhile, Matthew's former wife, Nadine (Lesley Manville), very bitter after the divorce and living on very little income, has moved to the countryside, taking over a half-dilapidated old house. Her children leave the relative comfort of their home in order to escape their father's new wife, Josie, only to find themselves in deprived circumstances. The story moves back and forth between Josie, Nadine and Elizabeth. The stories eventually play themselves out: Elizabeth breaks the relationship with Tom, Matthew's children come to accept Josie, and Nadine finally makes peace with her countryside existence, even being befriended by a local farmer, with implications of a possible future romance."]}, {"page": "Twenty Four Seven (film)", "response": ["* Frank Harper as Ronnie Marsh"]}, {"page": "StreetDance 3D", "response": ["* Frank Harper as Fred"]}, {"page": "Permanent Vacation (2007 film)", "response": ["*Frank Harper (Eric Bury)", "*SoCal Independent Film Festival 2007\tWinner – Best Actor Frank Harperclick 2007 Best Actor "]}, {"page": "List of people from the London Borough of Lewisham", "response": ["*Frank Harper (actor) grew up in the borough and attended Malory School in Downham"]}, {"page": "Dave Harper (footballer)", "response": ["His son, Frank Harper, is a British actor whose roles include that of the father of a football-loving teenage girl (played by Keira Knightley) in Bend It Like Beckham."]}, {"page": "Reg Traviss", "response": ["Reginald Stephen Traviss (born 12 February 1977) is an English film director and writer. He came to public attention in the UK in 2006 with the theatrical release of his debut feature film Joy Division which starred Ed Stoppard, Bernard Hill, Tom Schilling, Bernadette Heerwagen and Ricci Harnett. He followed up his World War Two drama with Psychosis (2010), a psychological thriller that starred Charisma Carpenter, Ricci Harnett and Justin Hawkins. Traviss directed Screwed, a prison drama based on the 2008 book Screwed: The Truth About Life as a Prison Officer, by a former prison guard writing under the pseudonym Ronnie Thompson. The film, released theatrically in the UK in June 2011, starred Noel Clarke, James D'Arcy, Frank Harper and Kate Magowan.", "In 2008 to 2009 Traviss worked on his second film Psychosis, a psychological-thriller and homage in the style of cult British chillers Hammer House of Horror and Tales of the Unexpected. The story was a reworking of the segment Dreamhouse from the Michael Armstrong film Screamtime, and starred Charisma Carpenter in the lead role, supported by Ricci Harnett, Paul Sculfor and rock singer Justin Hawkins. The film premiered in 2010 at the 'Home of Cult British Horror' Prince Charles Cinema in Leicester Square, London. In 2010 Traviss directed Screwed, the film adaptation of Ronnie Thompson's bestselling Prison Officer's memoir Screwed: The Truth About Life as a Prison Officer, by Headline Publishing about an ex-British soldier who returns from Iraq to take job in one of England's toughest jails only to find that the Officers are more corrupt than the convicts. Screwed was released in theatres across the UK in June 2011 and starred acclaimed actors Noel Clarke and James D'Arcy alongside tough guy actors Frank Harper and Jamie Foreman"]}, {"page": "List of British films of 2012", "response": ["|| Director: Frank Harper   Cast: Frank Harper, Craig Fairbrass, Charles Dance, Vincent Regan, Dexter Fletcher, Nick Moran, Keeley Hazell"]}, {"page": "St George's Day (film)", "response": ["St George's Day is a 2012 British gangster film. It is directed by Frank Harper and stars Harper, Craig Fairbrass, Charles Dance, Vincent Regan, Dexter Fletcher, Nick Moran and Keeley Hazell.", "Infamous cousins Micky Mannock (Frank Harper) and Ray Collishaw (Craig Fairbrass) run London's top firm. But their supremacy in the capital's gangster underworld is threatened when they lose a drug shipment belonging to the Russian Mafia. The stakes could not be higher as they plan an audacious heist in Berlin. If successful, this could pay off their debts and set them up for life. Hiding out among an English super-firm gearing up for a massive showdown as the 3 Lions play Germany on St. George's Day, their gang have just one shot at the job. But with the cops and Russians on their trail, the last thing they need is a grass (snitch) in the ranks.", "* Frank Harper as Micky Mannock", "The premiere of the film took place at the Odeon in Covent Garden, London on 29 August 2012. The premiere was attended by stars of the film, such as Frank Harper, Craig Fairbrass, Keeley Hazell and Tony Denham, and other actors, such as Bruce Payne. The general release of the film took place on 7 September 2012. The film has received mixed reviews. The film has a rating of four out of five on Time Out's London magazine website while The Daily Telegraph gave it a rating of two out of five and The Independent gave it a rating of one out of five. One reviewer stated that Harper just about pulls off the 'globe-hopping plot involving gangsters, drug deals, heists and more than a touch of double-crossing betrayal' and that whilst the film is 'sometimes predictable, it's never dull, with a fast-paced plot and a terrific cast'. Phelim O'Neill, who reviewed the film for The Guardian, stated that 'it's a low-budget film with enough ambition to take the action overseas, and it's nicely shot'."]}]}}