{"wiki_id": "http://www.wikidata.org/entity/Q11310753", "itemLabel": "John Thirkell", "itemDescription": "British trumpeter", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Thirkell", "wikipedia_page": {"main": "John Thirkell is a British trumpet and flugelhorn player, who has appeared on hundreds of pop, rock, and jazz recordings.  Through the 1980s and early 1990s he was on at least one album in the UK Charts continuously, without a break, for over 13 years. In 2009 he had two consecutive UK No.1 singles with Pixie Lott and was the first person to be inducted into the Musician's Union \"Hall of Fame.\" In 2020 he scored his 25th No.1 playing on BTS's \"Dynamite\".\nHe is also known for playing with Level 42 in partnership with fellow Brit and saxophonist Gary Barnacle.\nHis other credits include work with artists such as Rod Stewart, George Michael, Lisa Stansfield, Jamiroquai, UB40, Cher, Tina Turner, Pet Shop Boys, Swing Out Sister, Spice Girls, BTS and many more, along with stints in the Buddy Rich Band and Gil Evans Orchestra. He is also the producer of covers band Red Sauce.", "link_mentions": [{"page": "Jamiroquai", "response": ["* John Thirkell – trumpet, flugelhorn"]}, {"page": "Spice Girls", "response": ["The group moved into a three-bedroom house in Maidenhead, Berkshire, and spent most of 1994 practising songs written for them by Bob Herbert's long-time associates John Thirkell and Erwin Keiles. According to Stephenson, the material they were given was \"very, very young pop\", and none were later used by the Spice Girls. During these first months, the group worked on demos at South Hill Park Recording Studios in Bracknell with producer and studio owner Michael Sparkes and songwriter and arranger Tim Hawes. They were also tasked with choreographing their own dance routines, which they worked on at Trinity Studios in Knaphill, near Woking, Surrey. A few months into the training, Stephenson was fired for a perceived lack of commitment. Heart Management turned to the group's vocal coach, Pepi Lemer, to find a replacement. After Lemer's first recommendation declined the offer, Lemer recommended her former pupil, Emma Bunton, who auditioned for the Herberts and joined as the fifth member."]}, {"page": "Level 42", "response": ["In December 1990, Level 42 returned to play a record run of concerts at Hammersmith Odeon, London, in part fulfilling booking obligations preceding the band's recent hiatus. The concerts featured Allan Holdsworth (whom Husband had asked to play as a favour while the band searched for a permanent guitarist) plus four additional players: Lyndon Connah (ex-64 Spoons) on additional keyboards and percussion and sharing backing vocals with Annie McCaig, plus the horn section from the Guaranteed album (John Thirkell and Gary Barnacle)."]}, {"page": "The Brand New Heavies", "response": ["* John Thirkell - trumpet, flugel (1994–1997)"]}, {"page": "Fever (Kylie Minogue album)", "response": ["* John Thirkell – flute, trumpet "]}, {"page": "The Lexicon of Love", "response": ["* John Thirkell - Trumpet, Flugel on \"Poison Arrow\" and \"The Look of Love\""]}, {"page": "Very (Pet Shop Boys album)", "response": ["* Phil Todd, Snake Davis, John Barclay, John Thirkell and Mark Nightingale – brass on track 12"]}, {"page": "Radio K.A.O.S.", "response": ["* John Thirkell – trumpet"]}, {"page": "Welcome to the Beautiful South", "response": ["*John Thirkell – trumpet, fluglehorn"]}, {"page": "Swing Out Sister", "response": ["Consequently, when they released their debut album, It's Better to Travel, on 11 May 1987, it reached number one on the UK Albums Chart. The album blended real horns, synths (arranged subtly, to sound like strings), drums, and xylophones, scored by producer/arranger Richard Niles. The follow-up single to the effervescent \"Breakout\" was the brooding \"Surrender\", which featured a trumpet solo performed by John Thirkell. It rose to number seven on the UK charts in January 1987. The next single was the more serious and jazzy \"Twilight World\". This song was the subject of many remixes and was a dance club favourite worldwide. The final single, \"Fooled By a Smile\", returned to the upbeat pop orientation characteristic of \"Breakout\".", "Numerous changes were afoot by the time the fourth album, The Living Return, was released in September 1994. The replacement of producer Paul O'Duffy, after initial studio sessions with Ray Hayden, contributed to a looser, rawer feel to the songs that were often the results of studio jam sessions. Though Drewery and Connell still led Swing Out Sister, additional musicians, including former 52nd Street bassist Derick Johnson, Pa'lante percussionist Chris Manis, Jazz Defectors drummer Myke Wilson, and trumpet player John Thirkell, increased the group to ten members who replicated the live performances that had been captured on the Japan-only release Live at the Jazz Cafe. The album featured a cover of the Delfonics song \"La-La (Means I Love You)\", which was released as a single and was included on the soundtrack of the movie Four Weddings and a Funeral."]}, {"page": "Emergency on Planet Earth", "response": ["*John Thirkell – trumpet, flugelhorn"]}, {"page": "Travelling Without Moving", "response": ["* John Thirkell - trumpet"]}, {"page": "Kaleidoscope World (Swing Out Sister album)", "response": ["* John Thirkell - trumpet (1, 6)"]}, {"page": "The Rapture (album)", "response": ["*Gary Barnacle, Peter Thoms, Luke Tunney and John Thirkell [uncredited] - brass section on \"New Skin\""]}, {"page": "Older (album)", "response": ["*John Thirkell – trumpet, flugelhorn"]}, {"page": "What Up, Dog?", "response": ["* Bill Reichenbach Jr., Dan Higgins, Kim Hutchcroft, Jerry Hey, Gary Grant, John Thirkell, John Barclay, Guy Barker, Pete Beachill, Phil Todd, Chris \"Snake\" Davies, Stuart Brooks — brass"]}, {"page": "Absolute Beginners (David Bowie song)", "response": ["**John Thirkell – trumpet"]}, {"page": "Writing on the Wall (Bucks Fizz album)", "response": ["* John Thirkell - Trumpet"]}, {"page": "A Maximum High", "response": ["* The Phantom Horns  (featuring Gary Barnacle and John Thirkell) – horns, brass on \"Going For Gold\" and \"Getting Better\""]}, {"page": "Wildest Dreams (Tina Turner album)", "response": ["* Chris \"Snake\" Davis, John Thirkell, Andy Hamilton, Steve Hamilton, Peter Thoms, Andy Bush – horns"]}, {"page": "John thirkell", "response": ["#REDIRECT John Thirkell "]}, {"page": "Crazyhead", "response": ["* John Thirkell - Trumpet"]}, {"page": "Leeds Conservatoire", "response": ["The conservatoire has exported a variety of notable alumni in different musical disciplines. This includes Jazz pianists David Newton, Nikki Iles, saxophonists Pete Wareham and Alan Barnes, trumpeters Chris Batchelor and Richard Iles, and guitarist Nick Webb. Badly Drawn Boy, Snake Davis, John Thirkell, Adrian Snell, Matthew Bourne, James Lynch of Touch and Go, Michael Spearman of Everything Everything, Chris Sharkey of Trio VD and Acoustic Ladyland, Ryan and Gary Jarman of The Cribs, James Yeoburn Mark Holub and Brett Domino are also associated with the conservatoire. Dave Bainbridge, guitarist with Iona and later keyboards player for Strawbs, also studied there and won the BBC Radio 2 Best Jazz soloist award whilst at the conservatoire."]}, {"page": "Don't Stop (Status Quo album)", "response": ["*John Thirkell – trumpet on \"Fun, Fun, Fun\", \"Get Back\", \"Sorrow\", \"Proud Mary\" and \"Get Out Of Denver\""]}, {"page": "Forever Now (Level 42 album)", "response": ["*John Thirkell, Derek Watkins and Stuart Brooks – trumpets"]}, {"page": "Bankstatement", "response": ["** John Thirkell - trumpet "]}, {"page": "Slave to the Rhythm (album)", "response": ["* John Thirkell – percussion, trumpet"]}, {"page": "The Big Dish (band)", "response": ["Lindsay, McFie and Docherty then completed the follow-up album Creeping Up on Jesus in 1988 with session musicians — including drummer Blair Cunningham and horn men Gary Barnacle & John Thirkell, Craig Armstrong and Paul Wickens (keyboards). Despite Bruce Lampcov's muscular production, this second effort proved commercially unsuccessful and the band was dropped from Virgin, when Lindsay refused to countenance recording a cover version."]}, {"page": "Surrender (Swing Out Sister song)", "response": ["The song features a trumpet solo performed by John Thirkell and features Drewery laughing at the beginning of the song."]}, {"page": "Johnny Thirkell", "response": ["#REDIRECT John Thirkell"]}, {"page": "U-Vox", "response": ["* Derek Watkins, Gary Barnacle, John Thirkell, Pete Thoms – brass on \"The Prize\" "]}, {"page": "Guaranteed (Level 42 album)", "response": ["* John Thirkell – trumpets"]}, {"page": "Forever Now (Level 42 song)", "response": ["*John Thirkell, Derek Watkins and Stuart Brooks - Trumpets"]}, {"page": "Si Tú Me Miras", "response": ["* John Thirkell – trumpet"]}, {"page": "List of Level 42 members", "response": ["|John Thirkell"]}, {"page": "Brother Sister", "response": ["* John Thirkell - trumpet, flugelhorn (Solo on \"Dream on Dreamer\")"]}, {"page": "Heart Like a Sky", "response": ["* John Thirkell – trumpet, flugelhorn "]}, {"page": "Secret Garden (T'Pau song)", "response": ["* John Thirkell, Simon Gardener – trumpet on \"This Girl\""]}, {"page": "Slave to the Rhythm (Grace Jones song)", "response": ["* John Thirkell – trumpet "]}, {"page": "Lisa Stansfield (album)", "response": ["*John Thirkell – trumpet, horn arrangements"]}, {"page": "Swing: Original Motion Picture Soundtrack", "response": ["*John Thirkell - trumpet"]}, {"page": "Richard Niles", "response": ["He appeared as the leader of the house band, Bandzilla, in Ruby Wax's Channel 4 television series Don't Miss Wax. Bandzilla released an album of big band instrumentals. Bandzilla was the house band for the Michael Ball television series (1994) with Niles as musical director. Niles wrote and arranged for both Joe Cocker and James Brown on this series. As leader of Bandzilla, he released Blue Movies featuring Guy Barker and John Thirkell (Lifetime Records, 1990) and Bandzilla Rises!!!  (Bandzilla Records, 2016) co-produced by John Thirkell and featuring Randy Brecker, Leo Sayer, Clarice Assad, Lamont Dozier Jr. and Nigel Hitchcock."]}, {"page": "Warped by Success", "response": ["*John Thirkell - trumpet, flugelhorn"]}, {"page": "Stages (Elaine Paige album)", "response": ["* John Thirkell - trumpet, flugelhorn"]}, {"page": "Get in Touch with Yourself", "response": ["* John Thirkell – trumpet (2, 4, 6), flugelhorn (2, 4, 6), trumpet solo (7)"]}, {"page": "The Living Return", "response": ["* John Thirkell – trumpet, flugelhorn"]}, {"page": "Union (Toni Childs album)", "response": ["*Gary Barnacle, Pete Thoms, John Thirkell – horns "]}]}}