{"wiki_id": "http://www.wikidata.org/entity/Q1148705", "itemLabel": "Cyril Tourneur", "itemDescription": "English dramatist", "wikipedia_url": "https://en.wikipedia.org/wiki/Cyril_Tourneur", "wikipedia_page": {"main": "Cyril Tourneur (; died 28 February 1626) was an English soldier, diplomat and dramatist who wrote The Atheist's Tragedy (published 1611); and (better-known play), The Revenger's Tragedy (1607), which is sometimes erroneously and speciously attributed to Thomas Middleton.", "link_mentions": [{"page": "List of English-language poets", "response": ["*Cyril Tourneur (died 1626, E)"]}, {"page": "Roger Zelazny", "response": ["Roger Joseph Zelazny was born in Euclid, Ohio, the only child of Polish immigrant Joseph Frank Żelazny and Irish-American Josephine Flora Sweet. In high school, he became the editor of the school newspaper and joined the Creative Writing Club.  In the fall of 1955, he began attending Western Reserve University and graduated with a B.A. in English in 1959.  He was accepted to Columbia University in New York and specialized in Elizabethan and Jacobean drama, graduating with an M.A. in 1962.  His M.A. thesis was entitled Two traditions and Cyril Tourneur: an examination of morality and humor comedy conventions in The Revenger's Tragedy."]}, {"page": "1575", "response": ["** Cyril Tourneur, English dramatist (d. 1626)"]}, {"page": "English Renaissance theatre", "response": ["*Cyril Tourneur"]}, {"page": "Thomas Middleton", "response": ["Middleton wrote in many genres, including tragedy, history and city comedy. His best-known plays are the tragedies The Changeling (with William Rowley) and Women Beware Women, and the cynically satirical city comedy A Chaste Maid in Cheapside. Earlier editions of The Revenger's Tragedy attributed the play to Cyril Tourneur,Three Jacobean Tragedies (Penguin, 1968) and the Revels edition (Manchester UP, 1975) stated so on the cover, although the Revels editor makes a case for Middleton inside. or refused to arbitrate between Middleton and Tourneur.The New Mermaids and Revels Student Edition leave open the question of authorship. However, since the statistical studies by David LakeThe Canon of Middleton's Plays (Cambridge University Press, 1975). and MacDonald P. Jackson,Middleton and Shakespeare: Studies in Attribution (1979). Middleton's authorship has not been seriously contested, and no further scholar has defended the Tourneur attribution.The play is attributed to Middleton in Jackson's facsimile edition of the 1607 quarto (1983), in Bryan Loughrey and Neil Taylor's edition of Five Middleton Plays (Penguin, 1988), and in Thomas Middleton: The Collected Works (Oxford, 2007).", "*The Revenger's Tragedy (1606). Earlier editions often attribute authorship to Cyril Tourneur."]}, {"page": "List of poets", "response": ["*Cyril Tourneur (1575–1626), English poetic dramatist"]}, {"page": "The Crying of Lot 49", "response": ["Pynchon devotes a significant part of the book to a play-within-a-book, a detailed description of a performance of an imaginary Jacobean revenge play, involving intrigues between Thurn und Taxis and Trystero. Like \"The Mousetrap\", based on \"The Murder of Gonzago\" that Shakespeare placed within Hamlet, the events and atmosphere of The Courier's Tragedy (by the fictional Richard Wharfinger) mirror those transpiring around them. In many aspects it resembles a typical revenge play, such as The Spanish Tragedy by Thomas Kyd, Hamlet by William Shakespeare and plays by John Webster and Cyril Tourneur."]}, {"page": "English drama", "response": ["Other revenge tragedies include The Changeling written by Thomas Middleton and William Rowley, The Atheist's Tragedy by Cyril Tourneur, first published in 1611, Christopher Marlowe's The Jew of Malta, The Revenge of Bussy D'Ambois by George Chapman, The Malcontent (c. 1603) of John Marston and John Ford's 'Tis Pity She's a Whore. Besides Hamlet, other plays of Shakespeare's with at least some revenge elements, are Titus Andronicus, Julius Caesar and Macbeth."]}, {"page": "1626 in literature", "response": ["*February 28 – Cyril Tourneur, English dramatist (born 1575)"]}, {"page": "1625 in literature", "response": ["*August 2–September 26 – Playwright Cyril Tourneur becomes secretary to the Council of War. On October 8 he joins the catastrophic Cádiz expedition in another secretarial post under Sir Edward Cecil and on December 11 is put ashore from the returning fleet at Kinsale in Ireland, terminally ill.\"Chronology\" in Regents Renaissance Drama edition of The Revenger's Tragedy."]}, {"page": "1613 in literature", "response": ["*June 5 – Cyril Tourneur is commissioned by Robert Daborne to write one act of the play The Arraignment of London in order to help meet a deadline. Later in the year, Tourneur is paid £10 for delivering letters from the Stuart monarchy to Brussels."]}, {"page": "1611 in literature", "response": ["*Cyril Tourneur – The Atheist's Tragedy (published)"]}, {"page": "1575 in literature", "response": ["**Cyril Tourneur, English dramatist (died 1626)"]}, {"page": "Jacques Rivette", "response": ["In Duelle (Une quarantaine) (1976), the Queen of the Night (Juliet Berto) battles the Queen of the Sun (Bulle Ogier) over a magic diamond which will allow the winner to remain in modern-day Paris. In Noroît (Une vengeance) (1976), the pirate Morag (Geraldine Chaplin) seeks revenge against the pirate Giulia (Bernadette Lafont) for killing her brother. Duelle was filmed in March and April 1975, and Noroît was shot at Brittany in May. De Gregorio saw Cyril Tourneur's The Revenger's Tragedy, and suggested it to Rivette. The script, written in 15th-century Old English, caused some difficulty for the actresses."]}, {"page": "King's Men (playing company)", "response": ["|-son – and four by Francis Beaumont and John Fletcher, reflecting their growing popularity with audiences and dominance in the King's Men's repertoire. The mysterious Cardenio, allegedly by Shakespeare and Fletcher, was also performed.In addition to Much Ado, the Shakespearean plays performed were Othello, The Tempest, The Winter's Tale, Julius Caesar, and both parts of Henry IV. Jonson's play was The Alchemist; the Beaumont and Fletcher plays were The Maid's Tragedy, The Captain, A King and No King, and Philaster (which was also performed twice). In addition to Cardenio, the other plays performed were Cyril Tourneur's lost play The Nobleman, and four anonymous works, The Merry Devil of Edmonton, The Twins' Tragedy, The Knot of Fools, and A Bad Beginning Makes a Good Ending – twenty performances of eighteen plays. The specific dates of the performances are not in the extant records. Chambers, Vol. 2, p. 217."]}, {"page": "Revenge play", "response": ["Other play writers of the period questioned the conventions of the genre through parody reversals of generic expectations.Maus, Katherine Eisaman.  \"Introduction\". Four Revenge Tragedies. Ed. Katherine Eisaman Maus. Oxford: Oxford University Press.  1995. Print. In Thomas Middleton's The Revenger's Tragedy, the revenge character Vindice is a spiteful man whose pleasure in the act of revenge is what seems to be his true motivation for its fulfillment.Middleton, Thomas. \"The Revenger's Tragedy\". Four Revenge Tragedies. Ed. Katherie Eisaman Maus. Oxford: Oxford University Press. 1995. Print. The Atheist's Tragedy by Cyril Tourneur followed an anti-revenge plot by having Montferrer's ghost explicitly order his son Charlemont not to seek revenge in order to avoid the villainy of violence.Tourner, Cyril. The Atheist's Tragedy. Ed. Katherie Eisaman Maus. Oxford: Oxford University Press. 1995. Print."]}, {"page": "Tourneur", "response": ["* Cyril Tourneur (1575-1626), English dramatist"]}, {"page": "The Revenger's Tragedy", "response": ["The Revenger's Tragedy is an English-language Jacobean revenge tragedy now attributed to Thomas Middleton, after long being attributed to Cyril Tourneur. It was performed in 1606, and published in 1607 by George Eld.", "The play was published anonymously in 1607; the title page of this edition announced that it had been performed \"sundry times\" by the King's Men (Loughrey and Taylor, xxv). A second edition, also anonymous (actually consisting of the first edition with a revised title-page), was published later in 1607. The play was first attributed to Cyril Tourneur by Edward Archer in 1656; the attribution was seconded by Francis Kirkman in lists of 1661 and 1671.Gibbons, ix Tourneur was accepted as the author despite Archer's unreliability and the length of time between composition and attribution (Greg, 316). Edmund Kerchever Chambers cast doubt on the attribution in 1923 (Chambers, 4.42), and over the course of the twentieth century a considerable number of scholars argued for attributing the play to Thomas Middleton. There are indications that this play was submitted by Middleton to Robert Keysar of The Queen's Revels company under the name of The Viper and Her Brood. The critics who supported the Tourneur attribution argued that the tragedy is unlike Middleton's other early dramatic work, and that internal evidence, including some idiosyncrasies of spelling, points to Tourneur. More recent scholarly studies arguing for attribution to Middleton point to thematic and stylistic similarities to Middleton's other work, to the differences between The Revenger's Tragedy and Tourneur's other known work, The Atheist's Tragedy, and to contextual evidence suggesting Middleton's authorship (Loughrey and Taylor, xxvii). "]}, {"page": "Siege of Ostend", "response": ["* Cyril Tourneur who was at Ostend from 1601–02 – references the parley stratagem employed by Francis Vere in The Atheist's Tragedy"]}, {"page": "Fortune Theatre, Dunedin", "response": ["The Fortune presented the New Zealand professional premiere of the renaissance drama, The Revenger's Tragedy (Thomas Middleton, previously attributed to Cyril Tourneur), in 1995. Campbell Thomas directed and designed the production and a score was specially commissioned for it from Anthony Ritchie."]}, {"page": "Macabre", "response": ["The quality is not often found in ancient Greek and Latin writers, though there are traces of it in Apuleius and the author of the Satyricon. Outstanding instances in English literature include the works of John Webster, Robert Louis Stevenson, Mervyn Peake, Charles Dickens, Roald Dahl, Thomas Hardy and Cyril Tourneur. In American literature, authors whose work feature this quality include Edgar Allan Poe, H. P. Lovecraft, and Stephen King. The word has gained its significance from its use in French as la danse macabre for the allegorical representation of the ever-present and universal power of death, known in English as the Dance of Death and in German as Totentanz. The typical form which the allegory takes is that of a series of images in which Death appears, either as a dancing skeleton or as a shrunken shrouded corpse, to people representing every age and condition of life, and leads them all in a dance to the grave. Of the numerous examples painted or sculptured on the walls of cloisters or church yards through medieval Europe, few remain except in woodcuts and engravings."]}, {"page": "Stephen Tompkinson", "response": ["| The Revenger's Tragedy || Vindice || Cyril Tourneur (Attributed) || Royal Exchange, Manchester || 2008"]}, {"page": "Francis Urquhart", "response": ["Urquhart is portrayed as having few other interests outside politics, though he is an avid reader of Italian Renaissance poetry and Elizabethan/Jacobean drama, with John Webster and Cyril Tourneur being among his favorite authors. He frequently quotes William Shakespeare, particularly Macbeth."]}, {"page": "John Warburton (officer of arms)", "response": ["*The Nobleman, a tragicomedy by Cyril Tourneur.  It was performed by the King's Men at court on 23 February 1612.", "* Cyril Tourneur"]}, {"page": "The Book of the Thousand Nights and a Night", "response": ["Many early commentators on Burton's Nights criticised his eccentric \"mixture of obsolete words, mediaeval phrases, modern slang, Americanisms, and foreign words and expressions\".Penzer, Op. cit., pg 319. Jorge Luis Borges, however, wrote a celebrated essay on “The Translators of The Thousand and One Nights”See, for example: Borges, Jorge Luis (1999), Selected Non-Fictions, Editor: Eliot Weinberger; Translators: Esther Allen, Suzanne Jill Levine, and Eliot Weinberger; New York: Viking, pp 92–109. (This essay was originally published in 1936 as \"Los traductores de las 1001 Noches\" in Eternidad.) in which – while he chastises Burton for his distortions and \"indulgent loitering\" — he allows that “the problems that Burton resolved are innumerable”Borges, Op. cit., pg 99 and delights in his careful use of an extravagantly exotic vocabulary in which each word \"is indubitably the mot juste.\" In summarising his use of language, Borges concluded that “In some way, the almost inexhaustible process of English is adumbrated in Burton – John Donne’s hard obscenity, the gigantic vocabularies of Shakespeare and Cyril Tourneur, Swinburne’s affinity for the archaic, the crass erudition of the authors of 17th century chapbooks, the energy and imprecision, the love of tempests and magic.”Borges, Op. cit., pg 108."]}, {"page": "Tourneur, or Turner, Cyril", "response": ["#REDIRECT Cyril Tourneur"]}, {"page": "Literary Taste: How to Form It", "response": ["* John Webster, Cyril Tourneur* and John Ford: plays"]}, {"page": "Lust's Dominion", "response": ["The play has been categorized as a revenge tragedy, comparable to Kyd's The Spanish Tragedy, Shakespeare's Titus Andronicus and Hamlet, and to tragedies by Thomas Middleton (The Revenger's Tragedy), John Webster (The White Devil) and Cyril Tourneur (The Atheist's Tragedy)."]}, {"page": "1575 in poetry", "response": ["** Cyril Tourneur (died 1626), English playwright and poet"]}, {"page": "The Honest Man's Fortune", "response": ["The Honest Man's FortuneThe title of this play resembles the subtitle of Cyril Tourneur's The Atheist's Tragedy, or The Honest Man's Revenge. is a Jacobean era stage play, a tragicomedy written by Nathan Field, John Fletcher, and Philip Massinger. It was apparently the earliest of the works produced by this trio of writers, the others being The Queen of Corinth and The Knight of Malta.", "Nineteenth-century scholars recognised that the play had multiple authors, based on its profile of internal evidence; critics beginning with F. G. Fleay proposed several potential authors working in combination, including Fletcher, Massinger, Field, Robert Daborne, Cyril Tourneur, and John Webster.Oliphant, pp. 383–91. Cyrus Hoy, in his wide-ranging study of authorship shares in the Fletcher canon, argued that both the printed and manuscript texts reveal the hands of Fletcher, Massinger, and Field. Hoy determined that the play is \"very largely\" the work of Field, but also that the collaboration among the writers is close and complex and cannot fully be split among the scenes of the play.Logan and Smith, pp. 63–4. Insofar as an Act/scene division is possible and meaningful, Hoy offered this assignment:"]}, {"page": "The Atheist's Tragedy", "response": ["The Atheist's Tragedy, or the Honest Man's Revenge is a Jacobean-era stage play, a tragedy written by Cyril Tourneur and first published in 1611. It is the only dramatic work recognised by the consensus of modern scholarship as the undisputed work of Tourneur, \"one of the more shadowy figures of Renaissance drama.\"Terence P. Logan and Denzell S. Smith, eds, The New Intellectuals: A Survey and Bibliography of Recent Studies in English Renaissance Drama, Lincoln, NE, University of Nebraska Press, 1977; pp. 248 and 267–73."]}, {"page": "Robert Daborne", "response": ["Henslowe's records in the collection of Dulwich College contain more than thirty references to Daborne in letters, receipts, and other documents in the 1613-15 period. Constantly impecunious, like so many of his writing contemporaries, Daborne relied on the self-interested generosity of Henslowe, to whom he was indebted for a series of small loans. He worked on at least five plays for Henslowe in this era, either alone or with collaborators who included Cyril Tourneur, John Fletcher, Nathan Field, and Philip Massinger. None of these plays, with titles like Machiavel and the Devil, The Arraignment of London, and The She Saint, have survived.Chambers, E. K. The Elizabethan Stage. 4 Volumes, Oxford, Clarendon Press, 1923; Vol. 3, p. 272."]}, {"page": "Victor Lanoux", "response": ["| Cyril Tourneur"]}, {"page": "Comedy of menace", "response": ["In his second one-act play, The Dumb Waiter (1960), as accentuated through the 2008 film by Martin McDonagh closely resembling and markedly influenced by it, In Bruges, \"Pinter conveys the idea of political terror through the staccato rhythms of music-hall cross-talk and the urban thriller: Hackney Empire cross-fertilises with Hemingway's The Killers [1927]\" (Billington 90), one of Pinter's own acknowledged early influences, along with Franz Kafka (348–49); Elizabethan and Jacobean dramatists, such as William Shakespeare, John Webster, and Cyril Tourneur, whose work his schoolmaster Joseph Brearley had introduced to him; Samuel Beckett (mostly his novels [43]); and black-and-white American movies of the 1940s and 1950s.See Wardle, \"Comedy of Menace\" 33, as qtd. in Merritt 225."]}, {"page": "1570s in England", "response": ["** Cyril Tourneur, dramatist (died 1626)"]}, {"page": "1610s in England", "response": ["** Cyril Tourneur's play The Atheist's Tragedy published."]}]}}