{"wiki_id": "http://www.wikidata.org/entity/Q1148577", "itemLabel": "Cyril Cartwright", "itemDescription": "British bicycle racer", "wikipedia_url": "https://en.wikipedia.org/wiki/Cyril_Cartwright_(cyclist)", "wikipedia_page": {"main": "Cyril Cartwright (28 January 1924 – 29 September 2015) was a British cyclist who held national records on the track and on the road and came second in the world amateur pursuit championship in Copenhagen in 1949. He held the British five-mile and 30-mile records.Cyril Cartwright was a miner in the Dukinfield area of England. He won the national 25-mile time trial championship in 1948, one of the first riders in the country to beat one hour for the distance. He set a national record at 59m 18s. He won the British Empire Games (Now called the Commonwealth Games) 4,000m pursuit in Auckland, New Zealand, in 1950, beating the future Tour de France rider, Russell Mockridge. The ship journey to New Zealand took five weeks. Cartwright got in as many miles as he could before the ship left in January, including riding from Manchester to London and back over a weekend. He took 13 hours on the southbound journey, 11 hours going north. He said:\n\nI had a five-weeks sea voyage ahead depending almost entirely on a set of rollers to keep fit at international level. Most of the time it was impossible to ride free-standing with two hands on the drops (The lower section of racing handlebars.) because it was necessary to hang on to the ship with one hand because of the rolling of the waves. If the sea was calm, I would have the rollers placed for and aft of the ship and ride with two hands. If the sea was rough, I rode port and starboard across the ship behind a bulkhead to keep the spray off me, hanging on for dear life with one hand.\nOf his ride against Mockridge, he said:\n\nI began to have doubts as he went off at the start like a cork from a bottle. In the first half he had 15 yards' lead on me after my weak start, but then I got down in my streamlined position and settled down to pace I knew I could hold. Four thousand metres can be a long way when you get tired, so Just slaved away at the pedals and waited for him to crack. After two laps he had increased his lead to 25 yards, then he started to struggle and at four laps I was level.\nBy three-quarter distance, Mockridge was struggling so badly that he gave up when he was 50 yards behind. As well as the gold medal, Cartwright received a certificate for the fastest time ridden in New Zealand.\nCartwright remembered: \"As we boarded his ship [for the journey home], the captain didn't say 'Congratulations, nice work.' His words were: 'I've locked those rollers of yours in the hold for the voyage home. You were nothing but a nuisance on the way here but we don't want to have to put up with it on the way back.\".He stopped racing after not being selected for the Olympic Games in Helsinki in 1952.", "link_mentions": [{"page": "Tom Simpson", "response": ["Berger told Simpson that if he wanted to be a successful road cyclist, he needed experience in track cycling, particularly in the pursuit discipline. Simpson competed regularly at Fallowfield Stadium in Manchester, where in early 1956 he met amateur world pursuit silver medallist Cyril Cartwright, who helped him develop his technique. At the national championships at Fallowfield the 18-year-old Simpson won a silver medal in the individual pursuit, defeating amateur world champion Norman Sheil before losing to Mike Gambrill.", "Simpson looked for any advantage over his opponents. He made his own saddle, a design which is now standard. During his time with Peugeot, he rode bikes made by Italian manufacturer Masi that resembled Peugeots. Simpson was obsessed with dieting since 1956, when he was mentored by Cyril Cartwright. Simpson understood the value of fruit and vegetables after reading Les Cures de jus by nutritionist Raymond Dextreit; during the winter, he would consume  of carrots a day. Other unusual food preferences included pigeons, duck and trout skin, raspberry leaves and garlic in large quantities."]}, {"page": "List of British cyclists", "response": ["* Cyril Cartwright"]}, {"page": "Manchester Wheelers' Club", "response": ["*Cyril Cartwright"]}, {"page": "British National Team Pursuit Championships", "response": ["| 1947  ||Manchester Wheelers  Reg Harris Cyril Cartwright Alan Geldard Alan Bannister  N W Brown  ||      ||"]}, {"page": "Cartwright (surname)", "response": ["* Cyril Cartwright (cyclist), British cyclist"]}, {"page": "1949 UCI Track Cycling World Championships", "response": ["|Knud Andersen || Cyril Cartwright || Aldo Gandini"]}, {"page": "Carlton Cycles", "response": ["The Carlton Flyer was Carlton's flagship bicycle frame from its introduction in 1935 to the 1970s. Its distinctive frame geometry featured steep angles and a small fork rake, and became popular and as a track and time trial bicycle. It was on this frame that Cyril Cartwright won a silver medal in the individual pursuit at the 1949 World Championships and Tom Simpson won a bronze medal in the team pursuit at the 1956 Olympics."]}, {"page": "England at the 1950 British Empire Games", "response": ["|Cyril Cartwright                                ||26|| Butcher  ||gold "]}, {"page": "British National Individual Pursuit Championships", "response": ["| 1948 || Charlie Marriner & Cyril Cartwright || no second place   || ", "| 1950|| Cyril Cartwright || Ken Mitchell || Jack Simpson"]}, {"page": "Cyril Cartwright", "response": ["Cyril Cartwright may refer to:", "* Cyril Cartwright (cyclist) (1924–2015), British cyclist", "* Cyril Cartwright (civil servant) (1920–1943), British colonial service administrator"]}]}}