{"wiki_id": "http://www.wikidata.org/entity/Q114576", "itemLabel": "Hans Keller", "itemDescription": "Austrian-British musician and writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Hans_Keller", "wikipedia_page": {"main": "Hans (Heinrich) Keller (11 March 1919 – 6 November 1985) was an Austrian-born British musician and writer, who made significant contributions to musicology and music criticism, as well as being a commentator on such disparate fields as psychoanalysis and football. In the late 1950s, he invented the method of \"wordless functional analysis\", in which a musical composition is analysed in musical sound alone, without any words being heard or read. He worked full-time for the BBC between 1959 and 1979.", "link_mentions": [{"page": "Franz Schmidt", "response": ["Schmidt's premiere of The Book with Seven Seals was made much of by the Nazis (who had annexed Austria shortly before in the Anschluss), and Schmidt was seen to give the Nazi salute (according to a report by Georg Tintner, who revered Schmidt and whose intent to record his symphonies was never realised). His conductor Oswald Kabasta was apparently an enthusiastic Nazi who, being prohibited from conducting in 1946 during de-nazification, committed suicide. These facts long placed Schmidt's posthumous reputation under a cloud. His lifelong friend and colleague Oskar Adler, who fled the Nazis in 1938, wrote afterwards that Schmidt was never a Nazi and never antisemitic but was extremely naive about politics. Hans Keller gave a similar endorsement. Regarding Schmidt's political naivety, Michael Steinberg, in his book The Symphony, tells of Schmidt's recommending Variations on a Hebrew Theme by his student Israel Brandmann to a musical group associated with the proto-Nazi German National Party. Most of Schmidt's principal musical friends were Jews, and they benefited from his generosity."]}, {"page": "Pyotr Ilyich Tchaikovsky", "response": ["According to Brown and musicologists Hans Keller and Daniel Zhitomirsky, Tchaikovsky found his solution to large-scale structure while composing the Fourth Symphony. He essentially sidestepped thematic interaction and kept sonata form only as an \"outline\", as Zhitomirsky phrases it.Zhitomirsky, 102. Within this outline, the focus centered on periodic alternation and juxtaposition. Tchaikovsky placed blocks of dissimilar tonal and thematic material alongside one another, with what Keller calls \"new and violent contrasts\" between musical themes, keys, and harmonies.Brown, The Final Years, 426; Keller, 347. This process, according to Brown and Keller, builds momentumBrown, The Final Years, 426. and adds intense drama.Keller, 346–47. While the result, Warrack charges, is still \"an ingenious episodic treatment of two tunes rather than a symphonic development of them\" in the Germanic sense,Warrack, Symphonies, 11. Brown counters that it took the listener of the period \"through a succession of often highly charged sections which added up to a radically new kind of symphonic experience\" (italics Brown), one that functioned not on the basis of summation, as Austro-German symphonies did, but on one of accumulation."]}, {"page": "The Threepenny Opera", "response": ["The ambivalent nature of The Threepenny Opera, derived from an 18th-century ballad opera but conceived in terms of 20th-century musical theatre, has led to discussion as to how it can best be characterised. According to critic and musicologist Hans Keller, the work is \"the weightiest possible lowbrow opera for highbrows and the most full-blooded highbrow musical for lowbrows\"."]}, {"page": "Tone row", "response": ["A tone row has been identified in the A minor prelude from book II of J.S. Bach's The Well-Tempered Clavier (1742)\"Discovery Reveals Bach's Postmodern Side\". Weekend Edition Sunday, NPR, 6 September 2009. and by the late eighteenth century, their use was a well-established technique, found in works such as Mozart's C major String Quartet, K. 157 (1772), String Quartet in E-flat major, K. 428, String Quintet in G minor, K. 516 (1790), and the Symphony in G minor, K. 550 (1788). Beethoven also used the technique but, on the whole, \"Mozart seems to have employed serial technique far more often than Beethoven\". Franz Liszt used a twelve-tone row in the opening of his Faust Symphony. Hans Keller claims that Schoenberg was aware of this serial practice in the classical period and that \"Schoenberg repressed his knowledge of classical serialism because it would have injured his narcissism.\""]}, {"page": "Benjamin Britten", "response": ["As early as 1948 the music analyst Hans Keller, summarising Britten's impact on 20th-century opera to that date, compared his contribution to that of Mozart in the 18th century: \"Mozart may in some respects be regarded as a founder (a 'second founder') of opera. The same can already be said today, as far as the modern British – perhaps not only British – field goes, of Britten\".Keller, Hans. \"Britten and Mozart\", Music & Letters, January 1948, pp. 17–30  In addition to his own original operas, Britten, together with Imogen Holst, extensively revised Purcell's Dido and Aeneas (1951) and The Fairy-Queen (1967). Britten's Purcell Realizations brought Purcell, who was then neglected, to a wider public, but have themselves been neglected since the dominance of the trend to authentic performance practice. His 1948 revision of The Beggar's Opera amounts to a wholesale recomposition, retaining the original melodies but giving them new, highly sophisticated orchestral accompaniments."]}, {"page": "Arnold Schoenberg", "response": ["Schoenberg's serial technique of composition with twelve notes became one of the most central and polemical issues among American and European musicians during the mid- to late-twentieth century. Beginning in the 1940s and continuing to the present day, composers such as Pierre Boulez, Karlheinz Stockhausen, Luigi Nono and Milton Babbitt have extended Schoenberg's legacy in increasingly radical directions. The major cities of the United States (e.g., Los Angeles, New York, and Boston) have had historically significant performances of Schoenberg's music, with advocates such as Babbitt in New York and the Franco-American conductor-pianist Jacques-Louis Monod. Schoenberg's students have been influential teachers at major American universities: Leonard Stein at USC, UCLA and CalArts; Richard Hoffmann at Oberlin; Patricia Carpenter at Columbia; and Leon Kirchner and Earl Kim at Harvard. Musicians associated with Schoenberg have had a profound influence upon contemporary music performance practice in the US (e.g., Louis Krasner, Eugene Lehner and Rudolf Kolisch at the New England Conservatory of Music; Eduard Steuermann and Felix Galimir at the Juilliard School). In Europe, the work of Hans Keller, , and René Leibowitz has had a measurable influence in spreading Schoenberg's musical legacy outside of Germany and Austria. His pupil and assistant Max Deutsch, who later became a professor of music, was also a conductor. who made a recording of three \"master works\" Schoenberg with the Orchestre de la Suisse Romande, released posthumously in late 2013. This recording includes short lectures by Deutsch on each of the pieces."]}, {"page": "Sonata form", "response": ["From the 1950s onward, Hans Keller developed a 'two-dimensional' method of analysis that explicitly considered form and structure from the point of view of listener expectations. In his work, the sonata-allegro was a well-implied 'background form' against whose various detailed features composers could compose their individual 'foregrounds'; the 'meaningful contradiction' of expected background by unexpected foreground was seen as generating the expressive content. In Keller's writings, this model is applied in detail to Schoenberg's 12-note works as well as the classical tonal repertoire. In recent times, two other musicologists, James Hepokoski and Warren Darcy, have presented, without reference to Keller, their analysis, which they term Sonata Theory, of the sonata-allegro form and the sonata cycle in terms of genre expectations, and categorized both the sonata-allegro movement and the sonata cycle by the compositional choices made to respect or depart from conventions. Their study focuses on the normative period of sonata practice, notable ones being the works of Haydn, Mozart, Beethoven, Schubert, and their close contemporaries, projecting this practice forward to development of the sonata-allegro form into the 19th and 20th centuries."]}, {"page": "Robert Simpson (composer)", "response": ["In the latter part of his career as a BBC producer Simpson frequently clashed with the management of the organisation. In the 1970s he was one of those – Hans Keller and Deryck Cooke were others – who started the (unsuccessful) revolt against the report Broadcasting in the Seventies and its plan for \"generic broadcasting\" (i.e. separate networks for pop, classical and speech). A decade later Simpson was energetic in his opposition to a cost-cutting reorganisation that ultimately proposed the decommissioning of five of the eleven BBC orchestras. During the ensuing musicians' strike (which caused the cancellation of the first several weeks of the 1980 BBC Promenade Concerts) Simpson chose to disregard BBC staff regulations and discuss the matter with a national newspaper; he then resigned from the corporation, publicly alleging a \"degeneration of traditional BBC values in the scramble for ratings\". (Hans Keller later described these criticisms as \"demonstrable fact\".)Hans Keller, 'An Untainted Mass Medium', The Spectator, 20 December 1980 Had Simpson remained silent for a few more months he would have been able to retire with a full pension, but his feeling was that such a course would have compromised his principles. Abominating the ethos of Thatcherite Britain, in 1986 he moved to the Republic of Ireland, settling on Tralee Bay in Kerry. In 1991, he suffered a severe stroke during an English lecture tour, which caused damage to the thalamus and left him in debilitating pain for the remaining six years of his life. He died in Tralee in 1997, aged 76.", "* Symphony No. 7 (1977), dedicated to Hans Keller and his wife, the artist Milein Cosman", "* 'Fiftieth Birthday Essays': A Tribute to Robert Simpson, with articles by Jascha Horenstein, Robert Layton, Hans Keller, Hugh Ottoway, Peter Dobson and Ainslee Cox. Edited by Edward Johnson for Triad Press (1971)."]}, {"page": "Musical analysis", "response": ["Some analysts, such as Donald Tovey (whose Essays in Musical Analysis are among the most accessible musical analyses) have presented their analyses in prose. Others, such as Hans Keller (who devised a technique he called Functional Analysis) used no prose commentary at all in some of their work."]}, {"page": "Carl Flesch", "response": ["He was known for his solo performances in a very wide range of repertoire (from Baroque music to contemporary), gaining fame as a chamber music performer. He also taught in Bucharest (1897–1902), Amsterdam (1903–08), Philadelphia (1924–28) and Berlin (Hochschule fuer Musik, 1929–34). He published a number of instructional books, including Die Kunst des Violin-Spiels (The Art of Violin Playing, 1923) in which he advocated for the violinist as artist rather than merely virtuoso. Among his pupils were Charles Barkel, Edwin Bélanger, Norbert Brainin, Felix Galimir, Bronislaw Gimpel, Ivry Gitlis, Szymon Goldberg,  Ida Haendel, Zvi (Heinrich) Haftel, Josef Hassid, Adolf Leschinski, Alma Moodie, Ginette Neveu, Yfrah Neaman, Ricardo Odnoposoff, Eric Rosenblith, Max Rostal, Henryk Szeryng, Henri Temianka, Roman Totenberg and Josef Wolfsthal, all of whom achieved considerable fame as both performers and pedagogues. He said his favorite pupil was the Australian Alma Moodie, who achieved great fame in the 1920s and 1930s but made no recordings and is little known today.Kay Dreyfus, Alma Moodie and the Landscape of Giftedness, 2002 In his memoirs he said, \"there was above all Henry [i.e., Henri] Temianka, who did great credit to the [Curtis] Institute: both musically and technically, he possessed a model collection of talents.\"Carl Flesch: The Memoirs of Carl Flesch (trans. Hans Keller and ed. by him in collaboration with C.F.Flesch); foreword by Max Rostal (1957) ", "* Carl Flesch: The Memoirs of Carl Flesch (trans. Hans Keller and ed. by him in collaboration with C.F.Flesch); foreword by Max Rostal (1957)."]}, {"page": "BBC Third Programme", "response": ["The decision to close down the Third Programme was opposed by many within the BBC, some of them senior figures. Within the music division, a 'BBC rebellion' gathered force, with its most vocal members including Hans Keller and Robert Simpson. Ultimately however, the attempt to prevent the culture-conscious Third being replaced by what Keller called \"a daytime music station\" proved unsuccessful."]}, {"page": "Robert Robinson (broadcaster)", "response": ["In 1967, Robinson presented the edition of The Look of the Week in which classical musicologist Hans Keller was brought face to face with the young Pink Floyd. He wrote and presented The Fifties on BBC1."]}, {"page": "Piotr Zak", "response": ["Piotr (or Pjotr) Zak is the name of a fictional Polish composer whose alleged composition Mobile for Tape and Percussion was broadcast twice on the BBC Third Programme on 5 June 1961 in a performance supposedly played by \"Claude Tessier\" and \"Anton Schmidt\".  In fact, the composer and the performers were pseudonyms of BBC producers Hans Keller and Susan Bradshaw, who concocted the deliberately unmusical percussive piece as a hoax.  According to Bradshaw, \"It was a serious hoax to set people thinking that fake music can be indistinguishable from the genuine.\"http://www.langston.com/Fun_People/1993/1993AMD.html The success of the hoax, however, is open to question.  While Mobile for Tape and Percussion was reviewed seriously by several critics, all of the reviews were roundly negative, with the piece being almost instantly identified as a \"non-musical\" studio prank.; ; ", "Nearly two months after the event, a BBC spokesman denied that the work was a hoax, describing it instead as an \"experiment\", in which \"the percussion instruments on the tape were played at random. I imagine that Piotr Zak does not exist. But we did not hoax the listeners. It was an experiment\". A conflicting report published the next day claimed that the BBC confessed the entire programme had been a hoax. It was revealed that the piece had been produced by Hans Keller and Susan Bradshaw at the BBC. By striking randomly and with deliberate senselessness at a collection of percussion instruments, the two (as \"Tessier\" and \"Schmidt\") had produced a strenuously meaningless twelve-minute \"work\" of superficially \"avant-garde\" character; this was completed by the addition of a selection of human whistling sounds (evidently meant to represent the \"tape\"), and with the resulting chaos being edited into some kind of whole by BBC technicians.", "* Maconie, Robin, and Hans Keller. 1980. Letters to the editor. London Review of Books 2, no. 5 (20 March).", "*Zak, Pjotr [alias Hans Keller]. 1962. \"Zak on Stockhausen\". The Musical Times 103, no. 1433 (July): 484–85."]}, {"page": "List of Austrian Jews", "response": ["* Hans Keller, musicologistOxford Dictionary of National Biography: \"he described himself as an 'unpious Jew'\""]}, {"page": "Gilbert Biberian", "response": ["Born in Istanbul, Turkey of Greek-Armenian heritage. Biberian's ethnic roots are integral to his compositions. He studied at Trinity College of Music, graduating in 1968. In 1965 a French Government grant took him to France to study with Ida Presti and Alexandre Lagoya. He studied composition with James Patten, Elisabeth Lutyens and Hans Keller, as well as widening and enriching his musical knowledge by working with non-guitarists Anthony Kinsella (piano) and Vic Bennett (clarinet)."]}, {"page": "Danny Blanchflower", "response": ["Anton Weinberg's 1985 Channel 4 documentary film The Keller Instinct featured an appearance by Blanchflower, who spoke approvingly of his late friend musicologist Hans Keller's advocacy of inventive, tactically creative football. He retired from his position as a writer for the Sunday Express in 1988."]}, {"page": "Benjamin Frankel", "response": ["Rostal made the premiere recording in 1944. He went on to perform Frankel's most famous work, the Violin Concerto \"in memory of 'the six million'\" (a reference to the Jews murdered during the Holocaust), commissioned for the 1951 Festival of Britain, and was the soloist in the Viola Concerto for BBC radio broadcasts in 1970 and 1972. The core of Frankel's output are the eight symphonies (composed between 1958 and 1971)Orr, Buxton. 'Benjamin Frankel's Symphonies and the Death of Tonality', in The Listener, 12 October 1972, p 483 and the five string quartets (composed between 1945 and 1965). His friend Hans Keller was a champion of his concert music and did much to promote its performance at home and abroad.", "* Benjamin Frankel and Hans Keller, drawing by Milein Cosman"]}, {"page": "Elisabetta Brusa", "response": ["Brusa was born in Milan, and as a child wrote 32 piano pieces. At the Milan Conservatory she formally studied composition with Bruno Bettinellivfg (who also taught famous Italian conductors like Claudio Abbado and Riccardo Muti) and Azio Corghi, graduating in 1980. She then taught Composition at the Conservatorios of Vicenza, Mantova and Brescia before arriving at the Conservatorio of Milan in 1985. She also received instruction from Sir Peter Maxwell Davies and Hans Keller. She first appeared on the Young Italian Composers RAI 3 television programme in 1983.International Who's Who in Classical Music, 21st Ed. London: Europa Publications Limited (2005): 117"]}, {"page": "Chord substitution", "response": ["Haydn later \"reharmonizes the theme\".Barret-Ayres, R. (1974 p. 359) Joseph Haydn and the String Quartet, London, Barrie & Jenkins. Hans Keller calls this \"the fullest and richest statement\"Keller, H. (1986, p. 217) The Great Haydn Quartets. London, Dent. of the famous melody: \"In the second bar, for instance, there even is a turn to the relative minor\":Keller (1986), p. 219."]}, {"page": "Symphony No. 4 (Tchaikovsky)", "response": ["It is also due to Madame von Meck that, at her request, Tchaikovsky wrote a program explaining the symphony. This action encouraged numerous writers to quote it instead of focusing on the symphony's purely musical qualities, including what Hans Keller termed \"one of the most towering symphonic structures in our whole literature\" in the opening movement.Keller, 345-346. This program hindered acceptance of the symphony for many years, prejudicing Alfred Einstein and other musicologists against it.Keller, 346. But this must be seen in the context of Einstein's general lack of sympathy for Tchaikovsky's music."]}, {"page": "Symphony No. 5 (Tchaikovsky)", "response": ["* Hans Keller: 'Peter Ilyich Tchaikovsky', in Vol. I of 'The Symphony', ed. Robert Simpson (Harmondsworth, 1966)."]}, {"page": "John Whiting", "response": ["Marching Song was adapted into a three-act opera by Benjamin Frankel, with a libretto by Hans Keller. Finished by the composer in short score, it was orchestrated after his death by Buxton Orr and broadcast on 3 October 1983 by BBC Radio 3.https://genome.ch.bbc.co.uk/search/0/20?adv=0&q=marching+song+frankel&media=all&yf=1923&yt=2009&mf=1&mt=12&tf=00%3A00&tt=00%3A00#search"]}, {"page": "Alan Walker (musicologist)", "response": ["Walker was born in Scunthorpe, Lincolnshire. He received an LGSM certificate in 1949, ARCM in 1950, a Bachelor of Music from University of Durham in 1956, and a Doctor of Music in 1965. Between 1957 and 1960 he studied privately with Hans Keller, an association which he has always acknowledged as formative. These lessons were resumed, albeit irregularly, once Walker joined Keller at the BBC in 1961.", "*'Tribute to Hans Keller', Canadian University Music Review, xvii (1996), 118–28."]}, {"page": "The Listener (magazine)", "response": ["In its early decades The Listener attracted celebrated contributors including H. E. Bates, E. M. Forster, T. S. Eliot, Julian Huxley, George Orwell, Bertrand Russell, George Bernard Shaw, Virginia Woolf, G. K. Chesterton, Herbert Read, Hans Keller and John Kenneth Galbraith. It also provided an important platform for new writers and poets. W. H. Auden, Edwin Muir, Christopher Isherwood, Stephen Spender, Sylvia Plath and Philip Larkin all had early works published in The Listener. Later, regular columnists included John Cole, Stephen Fry and Roy Hattersley. Barry Fantoni provided the magazine with cartoons and illustrations for twenty-one years."]}, {"page": "Milein Cosman", "response": ["In 1947, Cosman met the Viennese-born musician, writer, broadcaster and teacher Hans Keller (1919-1985), whom she married in 1961. Some books of his writings – The Jerusalem Diary (2001), Stravinsky The Music Maker (2010) and Britten (2013), for example – include many of her drawings and prints.", "In 2006, Cosman founded the Cosman Keller Art and Music Trust, which aims to support young musicians and artists as well as publishing, exhibiting and archiving her own and Hans Keller’s work. In 2014, a documentary film on Milein Cosman made by Christoph Böll was premiered in Düsseldorf in her presence.", "* Hans Keller and Donald Mitchell (eds) (with drawings by Cosman): Benjamin Britten: A Commentary on his Work from a Group of Specialists (London, Rockliff, 1952) ", "* (with Hans Keller): Stravinsky at Rehearsal (1962; published in Germany as Stravinsky Dirigiert)", "* (with Hans Keller): 1975 (1984 minus 9) (London, 1977)", "* (with Hans Keller): Stravinsky Seen and Heard (Toccata Press, 1982; ). Reissued as Stravinsky The Music Maker (ed. M. Anderson, Toccata Press, 2010)", "* (With Hans Keller): The Jerusalem Diary - Music, Society and Politics, 1977 and 1979 (ed. C. Wintle & F. Williams, Plumbago Books, 2001, )", "*  (with Hans Keller): Britten London, Plumbago Books and Arts, 2013,  (hardback), 978-0-95660075-2 (softback)"]}, {"page": "Oskar Adler", "response": ["In 1935 the violinist Louis Krasner consulted Adler (as well as Carl Flesch) about the solo part of Alban Berg's Violin Concerto, which Krasner had commissioned but could not, at that time, play. Around this time, Adler was also the teacher of the young Hans Keller, later a musician, writer and Schoenberg-expert resident in the UK."]}, {"page": "Bayan Northcott", "response": ["Born in Harrow on the Hill (London), Northcott read English at Oxford University and received a Bachelor of Arts degree from Oxford in 1962.  He then taught English from 1964 to 1970. Northcott developed an interest in composition. He was encouraged by Alexander Goehr and Hans Keller. Subsequently he read music at the University of Southampton, where his instructors included Goehr and Jonathan Harvey. Northcott earned a BMus degree from Southampton in 1971. Northcott has mentored other composers such as Robin Holloway and Julian Anderson."]}, {"page": "Blooms of Dublin", "response": ["The piece received mixed reviews. Hans Keller called it \"a pathetic pastiche\" in which \"senseless tonal and rhythmic antics...take the place of even the most elementary invention.\"Keller, Hans. 'Phoneydom' in The Listener, 11 February 1982, p 26-7 Aside from one repeat broadcast in 1983 it has not been revived, and has never been staged."]}, {"page": "Symphony No. 3 (Tchaikovsky)", "response": ["For other musicologists, the Schumannesque formal layout has been either a blessing or a curse. John Warrack admits the second movement, Alla tedesca, \"balances\" the work but he nonetheless senses \"the conventional four-movement pattern being interrupted\" unnecessarily, not amended in an organic manner.Warrack, Symphonies, 20–1. Brown notes that if Tchaikovsky amended the four-movement pattern because he felt it no longer adequate, his efforts proved unsuccessful.Brown, Final, 441. Hans Keller disagrees. Rather than a \"regression\" in symphonic form, Keller sees the five-movement form, along \"with the introduction of dance rhythms into the material of every movement except the first,\" as widening \"the field of symphonic contrasts both within and between movements.\"Keller, 344–5."]}, {"page": "Jonathan Harvey (composer)", "response": ["Harvey was born in Sutton Coldfield, and studied at St John's College, Cambridge, eventually obtaining a PhD. He also took private lessons with Erwin Stein and Hans Keller on the advice of Benjamin Britten. In 1969, he took up a Harkness Fellowship at Princeton University. In the 1980s, Harvey produced music at IRCAM after receiving an invitation from Pierre Boulez to work there."]}, {"page": "Pink Floyd", "response": ["EMI-Columbia released Pink Floyd's second single, \"See Emily Play\", on 16 June 1967. It fared slightly better than \"Arnold Layne\", peaking at number 6 in the UK. The band performed on the BBC's Look of the Week, where Waters and Barrett, erudite and engaging, faced tough questioning from Hans Keller. They appeared on the BBC's Top of the Pops, a popular programme that controversially required artists to mime their singing and playing. Though Pink Floyd returned for two more performances, by the third, Barrett had begun to unravel, and around this time the band first noticed significant changes in his behaviour. By early 1967, he was regularly using LSD, and Mason described him as \"completely distanced from everything going on\".: Barrett was \"completely distanced from everything going on\"; : Barrett's increasing LSD use starting early 1967."]}, {"page": "1985 in the United Kingdom", "response": ["* 6 November – Hans Keller, Austrian-born British musician and writer (born 1919)"]}, {"page": "I'll Be Seeing You (song)", "response": ["A resemblance between the main tune's first four lines and a passage within the theme of the last movement of Gustav Mahler's Third Symphony (1896) was pointed out by Deryck Cooke in 1970.Cooke's radio broadcast is described in Hans Keller, 'Truth & Music', Music and Musicians Magazine, November 1970  Mahler himself may have derived this passage from the overture to Daniel Auber's comic opera (Marco Spada (1852)."]}, {"page": "List of compositions by Benjamin Britten", "response": ["*Children's Crusade for nine boy soloists and chorus, percussion, organ and two pianos (text by Bertolt Brecht, trans. Hans Keller; 1968)", "* Op. 82, Children's Crusade (words Bertolt Brecht/Hans Keller), 1968"]}, {"page": "List of fictitious people", "response": ["* Piotr Zak, nonexistent Polish composer, created for a BBC programme by Susan Bradshaw and Hans Keller."]}, {"page": "Robert Still", "response": ["At school and at university Still developed a lifelong interest in racquet sports, including real tennis, in which he won a university sporting blue. Both his father and grandfather were solicitors in a long-established London firm, and he had been intended for the law. He studied music at Oxford under Ernest Walker, Sir Hugh Allen and others (ancestor Peter Still had acted for George III), and then spent two years at the Royal College of Music under C. H. Kitson, Gordon Jacob and the organist Basil Allchin. He also studied under Wilfred Dunwell at Trinity College of Music (modern harmony and counterpoint) and later in life under Hans Keller.", "The four string quartets were recorded by the Villiers Quartet in 2013-14.Review, Gramophone, January 2015 They show a stylist journey from the pre-classical and folk-song models of the first two (only Number 1 was performed during the composer's lifetime and was premiered in 1948), to the \"without key\" polytonality of the second two, which date from the 1960s and show the influence of Bartok and Schoenberg, and of Hans Keller, whose advice Still sought out at this period.Clark, Edward. Notes to Naxos CD 8 571353 (2015)"]}, {"page": "Progressive tonality", "response": ["In British post-World War II musicology, 'progressive tonality' was sometimes contrasted with 'regressive tonality' (e.g. in the analytic and critical writings of Hans Keller). The distinction was not one of chronological or stylistic 'advancedness', but rather a means of distinguishing between tonal motions that could either be reckoned as 'up' or 'down' around a circle of fifths construed as intersecting with the original tonic. By this measure, Mahler's 4th Symphony would exhibit 'progressive tonality' (it begins in G and ends in E, three fifths 'higher')—while the same composer's 5th Symphony would display 'regressive tonality' (it begins in C and ends in D, five fifths 'lower')."]}, {"page": "Symphony No. 2 (Tchaikovsky)", "response": ["More recently, Hans Keller has advocated at least the occasional performance of the 1872 version.Keller, 343-344. Dr. David Brown has added, \"To be fair to the second version, it is certainly attractive, and structurally as clear as anything that Tchaikovsky could wish for. There is an undeniable heaviness in the original, but its imposing scale, and its richness of content and detail make it a far more impressive piece that ought to be restored to the place, which is still permanently usurped by its slighter and far less enterprising successor.\"Brown, 264."]}, {"page": "List of British Jewish entertainers", "response": ["*Hans Keller,Oxford Dictionary of National Biography: \"he described himself as an 'unpious Jew'\" musicologist"]}]}}