{"wiki_id": "http://www.wikidata.org/entity/Q1156363", "itemLabel": "Walter Eric Spear", "itemDescription": "German physicist", "wikipedia_url": "https://en.wikipedia.org/wiki/Walter_Eric_Spear", "wikipedia_page": {"main": "Walter Eric Spear FRSE PhD FRS FInstP (20 January 1921 – 21 February 2008) was a German physicist noted for his pioneering work to help develop large area electronics and thin film displays. He was born in Frankfurt to a Jewish father and a Lutheran mother; by the time he finished his school examinations in 1938 life for Jews and people associated with Jews was becoming difficult.  With the support of friends and relatives in Britain, the family were able to move to London, where he arrived in 1938 \"with a small suitcase and a large cello\".", "link_mentions": [{"page": "University of Dundee", "response": ["* Walter Eric Spear, physicist"]}, {"page": "Royal Society Bakerian Medal", "response": ["*1988 Walter Eric Spear, Amorphous semiconductors, a new generation of electronic materials."]}, {"page": "University of Westminster", "response": ["* Engineers and Scientists including Sir Alexander Fleming (Awarded the 1945 Nobel Prize in Medicine), Sir Frederick Augustus Abel (chemist and inventor of cordite), Seweryn Chomet (theoretical physicist), Sir Diarmuid Downs (former President of the Institution of Mechanical Engineers), Lewis R. B. Elton (physicist and researcher in education), George Hockham (engineer and pioneer in research for fiber-optics), Gerald Palmer (Car designer, including Jowett Javelin and MG Magnette), Walter Eric Spear (physicist and pioneer of thin film displays) and Armand de Waele (chemist and rheologist)."]}, {"page": "Deaths in February 2008", "response": ["*Walter Eric Spear, 87, German physicist. "]}, {"page": "Alf Adams", "response": ["He attended University of Leicester to study physics, in part because he didn't have the foreign language qualifications demanded by most other universities. He also completed his PhD at Leicester with Professor Walter Eric Spear on Orthorhombic crystal systems, before doing postdoctoral research in Physics at Karlsruhe Institute of Technology in Germany, where he met and married his wife Helga.BBC Radio 4, The Life Scientific. Profile of Alf Adams"]}, {"page": "List of fellows of the Royal Society S, T, U, V", "response": ["|Walter Eric Spear||20/03/1980||"]}, {"page": "EPS Europhysics Prize", "response": ["* 1977: Walter Eric Spear - Amorphous silicon devices"]}, {"page": "Index of physics articles (W)", "response": ["*Walter Eric Spear"]}, {"page": "List of fellows of the Royal Society elected in 1980", "response": ["*Walter Eric Spear  (d. 2008)"]}, {"page": "Spear (surname)", "response": ["*Walter Eric Spear (1921–2008), German physicist"]}, {"page": "Peter LeComber", "response": ["He worked closely with Walter Eric Spear FRS in the development of Amorphous silicon and the creation of solar panels.", "He met Walter Eric Spear whilst working in Leicester and together they went to Dundee University in 1969 to establish the Carnegie Laboratory of Physics to study non-crystalline solids."]}, {"page": "List of Makdougall Brisbane Prize winners", "response": ["*1978–80 – Walter Eric Spear"]}]}}