{"wiki_id": "http://www.wikidata.org/entity/Q1153445", "itemLabel": "Richard Ellis", "itemDescription": "British astronomer", "wikipedia_url": "https://en.wikipedia.org/wiki/Richard_Ellis_(astronomer)", "wikipedia_page": {"main": "Richard Salisbury Ellis  (born 25 May 1950, Colwyn Bay, Wales) is Professor of Astrophysics at the University College London. He previously served as the Steele Professor of Astronomy at the California Institute of Technology (Caltech). \nHe was awarded the 2011 Gold Medal of the Royal Astronomical Society.", "link_mentions": [{"page": "Wolfson College, Oxford", "response": ["In the sciences, alumni of the college include the human geneticist Dame Kay Davies, the astronomer and Caltech professor Richard Ellis, and mathematician James R. Norris. Entrepreneurs include Reid Hoffman, who was the co-founder and executive chairman of LinkedIn. "]}, {"page": "The Sky at Night", "response": ["Many of the world's leading astronomers have appeared on the show through the years, including Harlow Shapley (the first to measure the size of the Milky Way galaxy), Fred Hoyle, Carl Sagan, Jocelyn Bell Burnell, Samuel Tolansky, Harold Spencer Jones, Martin Ryle, Richard Ellis, Carlos Frenk and Bart Bok. Other guests have included Arthur C. Clarke, Astronomer Royal Sir Martin Rees, Arnold Wolfendale, Allan Chapman, Sir Bernard Lovell, Michael Bentine, Wernher von Braun and Open University professors John Zarnecki, Monica Grady, Edwin Maher and Colin Pillinger."]}, {"page": "Magdalene College, Cambridge", "response": ["* Richard Ellis, Professor of Astrophysics, University College London and former Director of Palomar Observatory, California"]}, {"page": "Palomar Observatory", "response": ["* Richard Ellis, 2000–2006", "The multi-year POSS projects were followed by the Palomar Quasar Equatorial Survey Team (QUEST) Variability survey.Caltech press release: \"New Sky Survey Begins at Palomar Observatory.\"  July 29, 2003. This survey yielded results that were used by several projects, including the Near-Earth Asteroid Tracking project. Another program that used the QUEST results discovered 90377 Sedna on 14 November 2003, and around 40 Kuiper belt objects. Other programs that share the camera are Shri Kulkarni's search for gamma-ray bursts (this takes advantage of the automated telescope's ability to react as soon as a burst is seen and take a series of snapshots of the fading burst), Richard Ellis's search for supernovae to test whether the universe's expansion is accelerating or not, and S. George Djorgovski's quasar search."]}, {"page": "Plumian Professor of Astronomy and Experimental Philosophy", "response": ["# Richard Ellis (1993–2000)"]}, {"page": "Richard Ellis", "response": ["Richard Ellis may refer to:", "* Richard Ellis (astronomer) (born 1950), Caltech professor and former director of Palomar Observatory", "* Richard Ellis (biologist) (born 1938), American marine biologist, author, and illustrator ", "* Richard Ellis (librarian) (1865–1928), Welsh librarian and scholar", "* Richard Ellis (paediatrician) (1902–1966), British paediatrician", "*Richard Ellis (Texas politician) (1781–1846), Texas legislator", "*Richard Ellis (MP), in 1417 and 1421, MP for Great Yarmouth", "*Richard Ellis (Massachusetts politician), 17th century representative to the Great and General Court", "*Richard Ellis (Dedham), 19th century representative to the Great and General Court", "*Richard Ellis (English cricketer) (born 1960), former English cricketer", "*Richard Ellis (New Zealand cricketer) (born 1945), New Zealand cricketer", "*Richard Ellis (journalist), British former editor of the Sunday Telegraph", "*Richard Ellis (American photographer) (born 1960), news photographer and founder of the photo agency Newsmakers", "*Richard Ellis (Maltese photographer) (1842–1924), British-Maltese photographer", "*Richard Ellis International Limited, now part of CBRE Group, real estate company"]}, {"page": "Colwyn Bay", "response": ["*Richard Ellis, the California-based astronomer, was born and went to school in Old Colwyn"]}, {"page": "Gold Medal of the Royal Astronomical Society", "response": ["| 2011 || Richard Ellis || Eberhard Grün || ||  "]}, {"page": "2dF Galaxy Redshift Survey", "response": ["In astronomy, the 2dF Galaxy Redshift Survey (Two-degree-Field Galaxy Redshift Survey), 2dF or 2dFGRS is a redshift survey conducted by the Australian Astronomical Observatory (AAO) with the 3.9m Anglo-Australian Telescope between 1997 and 11 April 2002.Final Status of Survey Observations   The data from this survey were made public on 30 June 2003.  The survey determined the large-scale structure in two large slices of the Universe to a depth of around 2.5 billion light years (redshift ~ 0.2).  It was the world's largest redshift survey between 1998 (overtaking Las Campanas Redshift Survey) and 2003 (overtaken by the Sloan Digital Sky Survey).  Matthew Colless, Richard Ellis, Steve Maddox and John Peacock were in charge of the project. Team members Shaun Cole and John Peacock were awarded a share of the 2014 Shaw Prize in astronomy for results from the 2dFGRS."]}, {"page": "Samuel Oschin telescope", "response": ["About half of the large photographic glass plate negatives exposed on the telescope, some 19,000 in all, had been accumulating in the sub-basement of the Robinson building at the California Institute of Technology since 1949. In 2002, astronomer Jean Mueller approached Richard Ellis, the director of the Caltech Optical Observatories, to volunteer to the task of organizing the Oschin Telescope plate archive. Given the go-ahead, she recruited eleven volunteers from the Mount Wilson Observatory Association (MWOA) and the Los Angeles Astronomical Society (LAAS), and the team then spent 13 weekends (more than one thousand hours) poring over the stacks, placing plates in protective sleeves, and packing them in more than 500 boxes that were transported to Palomar."]}, {"page": "Institute of Astronomy, Cambridge", "response": ["* Richard Ellis"]}, {"page": "Richard Ellis(astronomer)", "response": ["#REDIRECT Richard Ellis (astronomer)"]}, {"page": "Royal Society Bakerian Medal", "response": ["*1998 Richard Ellis, The morphological evolution of the galaxies."]}, {"page": "Waterstock", "response": ["Opposite the church are Church Farm Cottages and the Old Rectory, a substantial stone-built 18th-century house, the only other 'gentlemen's house'. In the 20th century it was the home of the violinist Manoug Parikian, his wife Diana Parikian, the antiquarian bookseller, and their two sons, until his sudden death on Christmas Eve 1987. He is buried in St Leonard's churchyard.  Richard Ellis the Californian astronomer lived in the Old School House while a graduate student at Oxford from 1971 to 1974."]}, {"page": "List of Durham University people", "response": ["* Richard Ellis FRS – Professor of Astronomy at UCL; Gold Medal of the Royal Astronomical Society (2011)"]}, {"page": "Supernova Cosmology Project", "response": ["* Richard Ellis, California Institute of Technology"]}, {"page": "Festival della Scienza", "response": ["* Richard Ellis"]}, {"page": "Chronology of the universe", "response": ["Using the 10-metre Keck II telescope on Mauna Kea, Richard Ellis of the California Institute of Technology at Pasadena and his team found six star forming galaxies about 13.2 billion light-years away and therefore created when the universe was only 500 million years old."]}, {"page": "List of Corpus Christi College, Oxford people", "response": ["* Richard Ellis – astronomer and cosmologist"]}, {"page": "Durham University Department of Physics", "response": ["File:Richard Ellis-49 copy.jpg|Richard Ellis, Professor (1985–1993)"]}, {"page": "List of fellows of the Royal Society D, E, F", "response": ["| Jonathan Richard Ellis||21/03/1985||"]}]}}