{"wiki_id": "http://www.wikidata.org/entity/Q1158505", "itemLabel": "Damien Lewis", "itemDescription": "British journalist and writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Damien_Lewis_(filmmaker)", "wikipedia_page": {"main": "Damien Gavin Lewis (born March 1966) is a British author and filmmaker who has spent over twenty years reporting from and writing about conflict zones in many countries. He has produced about twenty films.\nHe has written more than fifteen books, some of which have been published in over thirty languages.  His books have appeared on bestseller lists in many countries. He is a Fellow of the Winston Churchill Memorial Trust, and a Fellow of the Royal Geographical Society.", "link_mentions": [{"page": "Norwegian heavy water sabotage", "response": ["An account of Operation Gunnerside is part of Neal Bascomb's 2016 The Winter Fortress: The Epic Mission to Sabotage Hitler's Atomic Bomb (). Damien Lewis's book Hunting Hitler's Nukes: The Secret Race to Stop the Nazi Bomb (), also published that year, details the raid and the sinking of the SF Hydro. The 2018 book, Heroes of Telemark; Sabotaging Hitler's atomic bomb, Norway 1942–44 by David Greentree (), describes the operation's planning, execution and aftermath."]}, {"page": "Index on Censorship", "response": ["2004 winners: Journalism: Kaveh Golestan; Music: West–Eastern Divan Orchestra; Whistleblowing: Satyendra Dubey; Film: Amamdla! by Lee Hirsch; Books: Slave by Mende Nazer and Damien Lewis; Special: Mordechai Vanunu; Censor of the Year: John Ashcroft."]}, {"page": "West Side Boys", "response": ["* Operation Certain Death, Damien Lewis, Arrow Books, 2005, "]}, {"page": "00 Agent", "response": ["The origins of the Double O title may date to Fleming's wartime service. According to World War II historian Damien Lewis in his book Churchill's Secret Warriors, agents of the Special Operations Executive (SOE) were given a \"0\" prefix when they became \"zero-rated\" upon completion of training in how to kill. As part of his role as assistant to the head of naval intelligence, Rear Admiral John Godfrey (himself the inspiration for M), Fleming acted as liaison to the SOE."]}, {"page": "Tears of the Desert", "response": ["Tears of the Desert is an autobiographical book written by Sudanese medical doctor Halima Bashir and co-authored by English journalist Damien Lewis. This autobiography gives an account of Bashir's life in the Darfur region of Sudan, marked by personal experience of civil war, genocide, sexual violence and murder.Bashir, Halima and Lewis, Damien. (2008). Tears of the Desert: A Memoir of Survival in Darfur. Harper Collins Publishers Ltd. ISBN 0345506251. As a result of speaking out about the torture of her compatriots inflicted by Janjaweed militias, Bashir applied for political asylum in the United Kingdom.", "Co-author Damien Lewis stated that one of his goals was to, \"make … you or I or anybody else in the West feel that that could be them … how would they feel, if that happened to them, brings it home to on the personal human family level. What would you feel, if it was your children or your father, or your grandparents, or your village? … So it doesn't feel like thousands of miles away in a different culture in a place we don't understand.\""]}, {"page": "Airstan incident", "response": ["*The story of this is included in Operation Man Hunt () by Damien Lewis"]}, {"page": "Halima Bashir", "response": ["Bashir left Sudan and travelled to the United Kingdom to claim asylum, she had paid a people trafficker with jewellery. While in the UK, she protested the country's lack of action against Sudan, handing a letter personally to Lord David Triesman, the Minister for Africa within the British government. She wrote an autobiography, Tears of the Desert, in collaboration with Damien Lewis."]}, {"page": "Damien Lewis (author)", "response": ["#REDIRECT Damien Lewis (filmmaker)"]}, {"page": "Trisha Posner", "response": ["The Pharmacist of Auschwitz was the first nonfiction account of Nazi officer Victor Capesius. Michael Granberry, the Arts Critic for The Dallas Morning News said that \"In Pharmacist of Auschwitz, author Patricia Posner reminds us why we need to remember the Holocaust... Posner's book doubles as the spellbinding story of Nazi Germany's largest industrial conglomerate, I.G. Farben. Capesius worked for Farben's Bayer pharmaceutical subsidiary.\" Damien Lewis said that the book was \"Shocking. Revelatory. Compelling. A truly authentic and riveting read. A milestone in WWII and Holocaust history.\"\"The Pharmacist of Auschwitz\" 2 Seas Foreign Rights Catalog, January 2018"]}, {"page": "Kevin Fegan", "response": ["Obama the Mamba, about Barack Obama's Kenyan brother, George Hussein Obama (loosely adapted from George's autobiography with Damien Lewis), was a co-production for Curve Theatre Leicester and The Lowry Salford and was Nominated Best New Play Manchester Theatre Awards 2012.", "Fegan's other recent plays for The Lowry Salford include Slave (from the book by Mende Nazer & Damien Lewis) produced by Feelgood Theatre at The Lowry in 2010, followed by a national tour in 2011 (Winner Pete Postlethwaite Best New Play Manchester Theatre Awards 2010 and Winner Best Play or Film Human Trafficking Foundation 2011);"]}, {"page": "John Giwa-Amu", "response": ["John was involved in the co-production of the film, The Silent Storm, starring Damien Lewis and Andrea Riseborough, which was released in cinemas in May 2016 by Sony."]}, {"page": "Suraya Sadeed", "response": ["In 2011 Sadeed released an autobiography Forbidden Lessons in a Kabul Guesthouse, written by Sadeed and Damien Lewis. "]}, {"page": "Bravehound", "response": ["*Damien Lewis"]}, {"page": "Damien Lewis", "response": ["Damien Lewis may refer to:", "* Damien Lewis (American football) (born 1997), American football player", "* Damien Lewis (filmmaker) (born 1966), British author and filmmaker"]}]}}