{"wiki_id": "http://www.wikidata.org/entity/Q11689998", "itemLabel": "Chijindu Ujah", "itemDescription": "British sprinter", "wikipedia_url": "https://en.wikipedia.org/wiki/CJ_Ujah", "wikipedia_page": {"main": "Chijindu \"CJ\" Ujah (born 5 March 1994) is British athlete, specialising as a sprinter. The lead-off runner of the Great Britain 4 × 100 metre relay team that won both the World title in 2017 and the European title in 2016 and 2018, he also won the title in the 100 metres at the 2017 Diamond League final. Having won a silver medal at the Tokyo 2020 Summer Olympics, he was suspended after doping tests found two prohibited substances.", "link_mentions": [{"page": "Dwain Chambers", "response": ["Chambers began 2014 by finishing second in the 60 m at the British Indoor Championships, before going on to finish sixth in the 60 m final at the World Indoor Championships in a time of 6.52s. This was the fastest time he had run the 60m in since 2010. In his first three 100 m races of the outdoor season he failed to break 10.20, before hitting form during the British Championships. Going into the event, he was only ranked 10th in the UK, but he won the 100 m final, defeating Chijindu Ujah, who had broken 10 seconds three weeks earlier. Chambers' victory guaranteed him selection for the European Championships as his winning time was 10.12 secs, inside the European qualifying mark of 10.20. This was his fifth consecutive win at the British Championships. Chambers won his final medal in international competition at the 2014 IAAF World Relays in May. At the 2014 European Championships in August, Chambers missed out on a final individual medal by 0.02 seconds, finishing 4th in the 100m final in 10.24. This would be his last appearance at a major championships.", "Chambers' performances at tournaments in the 100 metres event make him one of the fastest European sprinters in the history of recorded athletics. His personal best of 9.97 s set at the 1999 Seville World Championships places him as the seventh fastest European in the 100 m and the sixth fastest Briton behind Linford Christie (9.87 s), James Dasaolu (9.91 s), Zharnel Hughes (9.91 s), Chijindu Ujah (9.96 s) and Joel Fearon (9.96 s). Chambers' annulled 9.87 s finish at the Paris Grand Prix in 2002 would have made him the joint fastest British 100 m sprinter with Christie and the joint second fastest European in the event."]}, {"page": "Greg Rutherford", "response": ["Rutherford sustained a hamstring injury during the Paris Diamond League meeting on 6 July, which forced him to withdraw midway through the competition. British Athletics delayed announcing their selection for the men's long jump at the World Championships due to the injury, but on 30 July Rutherford's selection was confirmed after he passed fitness tests. At the championships Rutherford failed to reach the final, finishing 14th in the qualifying round on 14 August with a jump of 7.87m. In the autumn of 2013 Rutherford appointed Jonas Tawiah-Dodoo as his coach. Tawiah-Dodoo also coaches 100m 2013 European Junior Champion Chijindu Ujah and 200m 2011 European Junior Champion David Bolarinwa. Rutherford's decision to work with a sprint coach was inspired by advice from former World and Olympic long jump champion Dwight Phillips."]}]}}