{"wiki_id": "http://www.wikidata.org/entity/Q1160181", "itemLabel": "Daniel Broido", "itemDescription": "", "wikipedia_url": "https://en.wikipedia.org/wiki/Daniel_Broido", "wikipedia_page": {"main": "Daniel Broido (17 May 1903, Kirensk-1990) was a Russian-British engineer who played a significant role in the development of computers.Daniel was the son of Mark Broido and Eva (née Lwowna) while they were political exiles in Kirensk, Siberia. They had been active Mensheviks and Eva had translated Women under Socialism by August Bebel into Russian.  She was active with an illegal workers library producing and distributing written material. She was arrested in January 1901 and, after 15 months in prison, sentenced to three to five years in exile in Siberia. The family returned to St Petersburg illegally, where his sister Vera Broido was born in 1907.\nHe moved to Germany and studied mechanical engineering in Berlin, and found work as an engineer working for Rotaprint. In 1934 Rotaprint sent him to London, where he settled. He remained in the United Kingdom during the Second World War, working for Caterpillar Tractors during World War II.\nIn 1956, Broido was appointed Chief Mechanical Engineer to work on the LEO computer.", "link_mentions": [{"page": "Raoul Hausmann", "response": ["In addition to his work as an artist, Hausmann was interested in science and technology throughout his career, especially emerging fields like television and sound film, and Einstein's work on relativity (which Hausmann rejected).Ether Machines: Roaul Hausmann's Optophonetic Media, Arndt Niebisch, p162 In 1929, he received a patent for a \"device for monitoring body cavities and tubes,\" which today we would call an endoscope (patent number DRP473166). While researching light and electronics for his artworks, Hausmann collaborated with a Russian engineer Daniel Broido to design a computer that used similar technology. The device was granted a patent by the British patent office in 1934 (patent number GB446338).The Dada Computer"]}, {"page": "Kirensk", "response": ["*Daniel Broido (1903-1990), computer engineer"]}, {"page": "Broido", "response": ["*Daniel Broido (1903–1990), Russian British engineer"]}, {"page": "Broido, Daniel", "response": ["#redirectDaniel Broido"]}]}}