{"wiki_id": "http://www.wikidata.org/entity/Q11630", "itemLabel": "Jane Hillston", "itemDescription": "British computer scientist", "wikipedia_url": "https://en.wikipedia.org/wiki/Jane_Hillston", "wikipedia_page": {"main": "Jane Elizabeth Hillston (born 1963) is British professor of Quantitative Modelling and Head of School in the School of Informatics, University of Edinburgh, Scotland.", "link_mentions": [{"page": "Calculus of communicating systems", "response": ["* PEPA, developed by Jane Hillston introduces activity timing in terms of exponentially distributed rates and probabilistic choice, allowing performance metrics to be evaluated."]}, {"page": "School of Informatics, University of Edinburgh", "response": ["* Jane Hillston Quantitative Modelling"]}, {"page": "PEPA", "response": ["Performance Evaluation Process Algebra (PEPA) is a stochastic process algebra designed for modelling computer and communication systems introduced by Jane Hillston in the 1990s. The language extends classical process algebras such as Milner's CCS and Hoare's CSP by introducing probabilistic branching and timing of transitions."]}, {"page": "BCS-FACS", "response": ["In recent years, a series of evening seminars have been held, mainly at the BCS London office. Speakers have included leading computer scientists, mainly from the United Kingdom but some from abroad, including Samson Abramsky FRS, Jean-Raymond Abrial (France/Switzerland), Farhad Arbab, Troy Astarte, Dines Bjørner (Denmark), Robin Bloomfield, Richard Bornat (twice), Egon Börger (Italy), Jonathan Bowen, Jan Broenink (Netherlands), Michael Butler, Muffy Calder OBE (twice), Jack Copeland (New Zealand), Tim Denvir, Cedric Fournet (France), Mike Gordon FRS, Anthony Hall, Mark Harman, Martin Henson, Rob Hierons, Jane Hillston, Mike Hinchey, Sir Tony Hoare FRS, Mike Holcombe, Michael Jackson, Cliff Jones, Marta Kwiatkowska (twice), Zhiming Liu, Tom Maibaum, Ursula Martin CBE, Peter Mosses, Ben Moszkowski, Peter O'Hearn FRS, Steve Reeves (New Zealand), John Reynolds (USA), Peter Ryan, Steve Schneider, Joe Stoy, David Turner, John Tucker, Phil Wadler, among others."]}, {"page": "Johanna Moore", "response": ["From 2014-2018 she was head of the School of Informatics and in 2016 instigated the Blockchain Technology Laboratory. She was succeeded as head of the school by Professor Jane Hillston. She is ranked as one of the top 10 computer scientists at Edinburgh with a H-index of 58."]}, {"page": "Lumpability", "response": ["where q(i,j) is the transition rate from state i to state j.Jane Hillston, Compositional Markovian Modelling Using A Process Algebra in the Proceedings of the Second International Workshop on Numerical Solution of Markov Chains: Computations with Markov Chains, Raleigh, North Carolina, January 1995. Kluwer Academic Press "]}, {"page": "List of alumni of the University of York", "response": ["* Jane Hillston, mathematician: BA Mathematics, 1985"]}, {"page": "Index of women scientists articles", "response": ["*Jane Hillston"]}, {"page": "Jane Elizabeth Hillston", "response": ["#REDIRECT Jane Hillston"]}, {"page": "Roger Needham Award", "response": ["* 2004 Jane Hillston on Tuning Systems: From Composition to Performance"]}, {"page": "Suffrage Science award", "response": ["* Jane Hillston"]}]}}