{"wiki_id": "http://www.wikidata.org/entity/Q116747", "itemLabel": "William Pleeth", "itemDescription": "British cellist", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Pleeth", "wikipedia_page": {"main": "William Pleeth OBE (12 January 1916 – 6 April 1999) was a well-known British cellist and an eminent teacher, who became widely known as the teacher of Jacqueline du Pré.", "link_mentions": [{"page": "Paul Tortelier", "response": ["He taught Jacqueline du Pré when she briefly attended his classes at the Paris Conservatoire, though he was not her main teacher (that was William Pleeth). Other students included Arto Noras, Nathan Waks and Raphaël Sommer. In the 1970s he gave a series of master classes which were recorded and broadcast on TV by the BBC, which demonstrate his very dynamic style of playing."]}, {"page": "Jacqueline du Pré", "response": ["At the age of four du Pré is said to have heard the sound of the cello on the radio and asked her mother for \"one of those\".  She began with lessons from her mother, who composed little pieces accompanied by illustrations, before enrolling at the London Violoncello School at age five, studying with Alison Dalrymple. For her general education, du Pré was enrolled first at Commonweal Lodge, a former independent school for girls in Purley, and then at the age of eight, transferred to Croydon High School, an independent day school for girls in South Croydon. In 1956, at the age of 11, she won the Guilhermina Suggia Award, and was granted renewal of the award each year until 1961. The Suggia award paid for du Pré's tuition at the Guildhall School of Music in London, and for private lessons with the celebrated cellist William Pleeth."]}, {"page": "Amadeus Quartet", "response": ["The group gave its first performance as the Amadeus Quartet at the Wigmore Hall in London on 10 January 1948, underwritten by British composer and conductor Imogen Holst.  On 25 January 1983 the Quartet gave a 35th-anniversary concert in the same concert hall with a programme which included Beethoven's String Quartet in C major, Op. 59 No. 3 (3rd Rasumovsky Quartet). Touring extensively, the Amadeus performed throughout Europe, Canada, the United States, Japan, and South America. Noted for its smooth, sophisticated style, its seamless ensemble playing, and its sensitive interpretation, the quartet made some 200 recordings, among them the complete quartets of Ludwig van Beethoven, Johannes Brahms, and Wolfgang Amadeus Mozart. For concerts as well as recordings of string quintets (Mozart, Franz Schubert, Johannes Brahms, Anton Bruckner) and string sextets (Brahms) they regularly invited Cecil Aronowitz as second viola and William Pleeth as second cello.  Though they emphasized a standard Classical and Romantic repertory, they also performed works by such 20th-century composers as Béla Bartók, and Benjamin Britten who wrote his last string quartet expressly for them, which they premiered after his death."]}, {"page": "Allegri Quartet", "response": ["The Allegri Quartet is a string quartet that was founded in 1953 by Eli Goren and William Pleeth.", "* William Pleeth"]}, {"page": "Hilary and Jackie", "response": ["* Bill Paterson as William Pleeth"]}, {"page": "Davidov Stradivarius", "response": ["The cello was sold in Paris in 1888. In 1928 it was purchased by Herbert N. Straus, an American business executive. When he died, his widow asked New York City musical instrument dealer Rembert Wurlitzer to sell the instrument for her. In 1964, the Davydov cello was purchased for US$90,000 by Ismena Holland who in turn presented the instrument to her goddaughter, the English cellist Jacqueline du Pré. Upon receiving the Davydov, Du Pre's instructor, William Pleeth, declared it as \"one of the really great instruments of the world\". Practically all of du Pré's recordings from 1968 to 1970 were made on this instrument. By 1970, du Pré began using a different cello (made for her by Sergio Peresson and purchased by her husband Daniel Barenboim), as she was bothered by the Davidov's \"unpredictability.\" Yo-Yo Ma later commented, \"Jackie's unbridled dark qualities went against the Davydov. You have to coax the instrument. The more you attack it, the less it returns\". The Peresson was her primary instrument for the remainder of her career."]}, {"page": "Edmund Rubbra", "response": ["In 1941, Rubbra was called up for army service. After 18 months he was given an office post, again because of his knowledge of shorthand and typing. While he was there, he ran a small orchestra assisted by a double-bass player from the BBC orchestra. The War Office asked him to form a piano trio to play classical chamber music to the troops. Rubbra was happy to oblige, and the trio, with William Pleeth the cellist, Joshua Glazier violinist and himself on the piano took six months acquiring a repertoire of chamber music. \"The Army Classical Music Group\", was formed and later expanded to seven people. On one occasion an overzealous entertainment officer thought there would be a better audience by advertising with big posters for \"Ed Rub & his seven piece Band\". They travelled all over England and Scotland and then to Germany, with their own grand piano which, with its legs removed for transport, became a seat for them in the back of the transport lorry.Grover, Aldershot, 1993, pp. 16–19", "The Cello Sonata of 1946 was dedicated to William Pleeth (the cellist in The Army Classical Music Group) and his wife. It was sometimes performed by Jacqueline du Pré, who was a pupil of William Pleeth. Rubbra's Second Piano Trio, Op. 138, was first performed by the members of The Army Classical Music Group, who got together again especially for this performance in 1970, though Glazier had now been replaced by Gruenberg.Grover, Aldershot, 1993, p. 368"]}, {"page": "Richard Harwood", "response": ["He complemented his studies by taking master classes and lessons with Mstislav Rostropovich, János Starker, Steven Isserlis, Boris Pergamenschikow, Miklós Perényi, Bernard Greenhouse, Valentin Erben (Alban Berg Quartet), William Pleeth, Zara Nelsova, and Ferenc Rados."]}, {"page": "Pieter Wispelwey", "response": ["Pieter Wispelwey was born in Haarlem and grew up in Santpoort. From a very early age he was exposed to the sounds of his father's amateur string quartet when they rehearsed at the Wispelwey home. He began on the piano, but later took up the cello at age eight. Later on he took lessons from Dicky Boeke and Anner Bylsma in Amsterdam, followed by studies with Paul Katz in the USA and William Pleeth in the UK."]}, {"page": "Ofra Harnoy", "response": ["Harnoy was born in Hadera, Israel.  She moved with her family to Toronto in 1971. When she was six, she began cello lessons with her father, Jacob Harnoy. Her teachers included Vladimir Orloff, William Pleeth, Pierre Fournier, Jacqueline du Pré, and Mstislav Rostropovich."]}, {"page": "Julius Klengel", "response": ["His students included Guilhermina Suggia,Obituary, The Musical Times, September 1950, p. 362 Hideo Saito, Emanuel Feuermann, Paul Grümmer, William Pleeth, and Gregor Piatigorsky. He died in October 1933 in his hometown of Leipzig."]}, {"page": "List of cellists", "response": ["*Anthony Pleeth (born 1948, England, baroque cello, son and student of William Pleeth)", "*William Pleeth (1916–1999, England, teacher of Jacqueline du Pré)"]}, {"page": "Ian Parrott", "response": ["Ian Parrott (5 March 1916 – 4 September 2012) was a prolific Anglo-Welsh composer and writer on music. His distinctions included the first prize of the Royal Philharmonic Society for his symphonic poem Luxor, and commissions by the BBC and Yale University, and for many leading British musicians. In 1958 his cor anglais concerto was first performed at Cheltenham Festival, and in 1963 his cello concerto was given by William Pleeth and the Hallé Orchestra – both concertos were conducted by Sir John Barbirolli."]}, {"page": "Anssi Karttunen", "response": ["Karttunen's teachers included Erkki Rautio, William Pleeth, Jacqueline du Pré and Tibor de Machula. He plays a cello by Francesco Ruggeri."]}, {"page": "Anthony Pleeth", "response": ["He studied cello with his father, renowned cellist William Pleeth, at the Guildhall School of Music and Drama, where he was the Gold Medallist in 1966.  He made his first recording for the BBC at the age of 13. He was a founder of the Galliard Trio (with Trevor Pinnock, harpsichord and Stephen Preston, flute), with which he performed from 1965 to its disbanding in 1972."]}, {"page": "Amanda Forsyth", "response": ["Daughter of composer Malcolm Forsyth, Forsyth came to Canada from South Africa at age 2 and began playing the cello at age 3. She became a protégé of William Pleeth in London and later studied with Harvey Shapiro at the Juilliard School in New York City and with Lynn Harrell in Los Angeles. After two seasons with the Toronto Symphony Orchestra, she became the youngest principal ever selected by the Calgary Philharmonic Orchestra where she remained for six years. In 1999, Forsyth was appointed principal cello of the National Arts Centre Orchestra, a position she left in 2015 to pursue her solo and chamber music career."]}, {"page": "Cello Concerto (Sullivan)", "response": ["In the early 20th century there was a single performance by the soloist May Mukle with the Bournemouth Municipal Orchestra conducted by Dan Godfrey; after that the work was not heard again until the final performance of the original score, given by William Pleeth and the Goldsbrough Orchestra conducted by Charles Mackerras in a concert for the BBC Third Programme, broadcast live on 7 July 1953.Mackie, p. 170"]}, {"page": "Herbert Murrill", "response": ["After graduating he organised a recital of his own music (shared with Brian Easdale) at the Wigmore Hall in London on July 1, 1931.The Times, 3 July, 1931, p. 12. Manchester Guardian, 5 July, 1931, p. 14 In 1933 he married the concert pianist  (1906-2000). They subsequently divorced and she married William Pleeth in 1942. He was for a time in the 1930s organist of Christ Church, Lancaster Gate, London and St Thomas' Church, Regent Street (now demolished). He also acted as Musical Director of The Group Theatre, where he worked with W H Auden and Benjamin Britten, conducting the music Britten composed for Timon of Athens in 1935.Bostridge, Mark (ed.) Britten's Century: Celebrating 100 Years of Britten, p. 56Sidnell, Michael. Dances of Death: The Group Theatre of London in the Thirties (1984)"]}, {"page": "Martti Rousi", "response": ["Martti Rousi started to play the cello at the age of 8 in Turku. His first teachers were Timo Hanhinen and Seppo Kimanen. He then studied at the Sibelius Academy with Arto Noras and received his diploma in 1983. In 1985–86, he studied with Janos Starker at Indiana University. He also took part in Master Classes with Natalia Gutman, Walter Deshpalj, and William Pleeth."]}, {"page": "Oliver Gledhill", "response": ["Oliver is Professor of Cello at Junior Guildhall and also teaches at Mill Hill School. He was a Scholar at the Guildhall School of Music and won numerous awards including the ISTEL/Redditch Music Society Competition. He studied with many eminent cellists including William Pleeth, Edmund Kurtz and André Navarra."]}, {"page": "Eurovision Young Musicians 1988", "response": ["* – William Pleeth"]}, {"page": "Gervase de Peyer", "response": ["De Peyer played first performances of concertos by Arnold Cooke, Sebastian Forbes, Alun Hoddinott, Joseph Horovitz, Thea Musgrave, Elizabeth Maconchy, William Mathias and Edwin Roxburgh. He premiered the Fantasy on an American Hymn Tune Op.70 for clarinet, cello and piano by Kenneth Leighton, commissioned by de Peyer, William Pleeth and Raphael Wallfisch and played by them at the Cheltenham Music Festival in 1975, and Miklós Rózsa's Sonata for Clarinet Solo op. 41 in New York in 1987."]}, {"page": "Kristin von der Goltz", "response": ["Her first teachers were her parents, Georg Conrad von der Goltz and Kirsti Hjort. She later studied with William Pleeth in London and others. She plays regularly with the London Philharmonic Orchestra and the Hanover Band, and from 1991 to 2004 was a member of the Freiburger Barockorchester. Since 1992 von der Goltz has been with the acclaimed Trio Vivente, with Anne Katharina Schreiber (violin) and Jutta Ernst (piano). She went on to teach."]}, {"page": "St Padarn's Church, Llanbadarn Fawr", "response": ["The last window that had contained plain glass was given stained glass in the late twentieth century. For many years well-known local musician Professor Ian Parrott regularly sat beneath this window during services. Before he died, at the age of 96, he commissioned a stained glass window – as he said, he would like to be able to enjoy it before he died.Parrott was a prolific Anglo-Welsh composer and writer on music. His distinctions included the first prize of the Royal Philharmonic Society for his symphonic poem \"Luxor\", and commissions by the BBC and Yale University, and for many leading British musicians. In 1958 his \"cor anglais\" concerto was first performed at the Cheltenham Festival, and in 1963 his cello concerto was given by William Pleeth and the Hallé Orchestra – both concertos were conducted by Sir John Barbirolli. From 1951 to 1983 he was Gregynog Professor of Music at Aberystwyth University. The window, which was designed by John Petts, is on the theme of \"Music in Praise of the Lord\"."]}, {"page": "Adrian Shepherd", "response": ["Shepherd was born in 1939 in the county of Essex, England, and studied the cello with William Pleeth at the Guildhall School of Music and Drama, For 20 years he was principal cello with the Royal Scottish National Orchestra and professor of cello at the Royal Scottish Academy of Music and Drama. Shepherd founded the modern instrument ensemble Cantilena in 1970 and remained its artistic director and conductor. He was also a director of the Cantilena Festival on Islay each July."]}, {"page": "Shauna Rolston", "response": ["Rolston was a cello child prodigy and attended the Geneva Conservatory in Switzerland at age fourteen.  She studied with Pierre Fournier, and later at the Britten-Pears School in Aldeburgh (England) where she also studied with William Pleeth. At sixteen, she played at New York's Town Hall, with her mother at the piano. Following her formative studies at the Banff Centre and abroad, Rolston earned undergraduate (Art) and graduate (Music) degrees at Yale where she studied with Aldo Parisot."]}, {"page": "Paul Watkins (musician)", "response": ["Paul Watkins (born 1970) is a Welsh classical cellist and conductor.  His brother is the composer Huw Watkins.  Watkins studied cello with William Pleeth, Melissa Phelps and Johannes Goritzki.  In 1988, he won the BBC Young Musician of the Year in the string section. From 1990 to 1997, he was principal cellist of the BBC Symphony Orchestra."]}, {"page": "Michael Sanderling", "response": ["Born in East Berlin, Michael Sanderling is the son of the contrabassist Barbara Wagner and the conductor Kurt Sanderling.  He received his first cello lessons at age five in Berlin. At age eleven, he became a student of Matthias Pfaender at the Spezialschule für Musik Berlin. The 17-year-old Sanderling was accepted at the Hochschule für Musik Hanns Eisler Berlin and studied with Josef Schwab. He took further lessons with William Pleeth, Yo-Yo Ma, Gary Hoffmann and Lynn Harrell. In 1987, he won a 1st prize at the Maria Canals International Music Competition. The same year, after his debut as a soloist, he was engaged as solo cellist of the Leipzig Gewandhaus Orchestra where he stayed until 1992.  From 1994 to 2006, he was guest solo cellist at the Berlin Radio Symphony Orchestra (East Berlin).  From 1994 to 1998, he was an academic at his alma mater in Berlin. In 1998, he started teaching at the Frankfurt University of Music and Performing Arts. Between 2000 and 2003, he was also a professor at Hochschule der Künste Bern. He was a member of the Trio Ex Aequo from 1988 to 1996. Sanderling ended his career as a cello soloist in 2010, to focus on teaching and conducting.Süße-Krause, Uta and Eggebrecht, Harald (2009). Cellisten Cellists, p. 189. Michael Imhof Verlag, Petersberg. ."]}, {"page": "Andrew Shulman", "response": ["Shulman studied cello with Amaryllis Fleming, Joan Dickson and William Pleeth. He received an 'Honorary RCM' from The Queen Mother in 1986, and subsequently became a professor at the Royal College of Music. He has given masterclasses in Europe, Scandinavia, Russia, the Ukraine, the USA, South America, the Far East and New Zealand."]}, {"page": "Jackie's Song", "response": ["In a letter to The Times on 20 January 1999, co-signed by Yehudi Menuhin, Itzhak Perlman, William Pleeth, Mstislav Rostropovich and Pinchas Zukerman, Lloyd Webber wrote: \"Hillary and Jackie ... concentrates heavily on an affair which Jacqueline had with her sister's husband and portrays her as selfish, spoilt and manipulative. This is not the Jacqueline du Pré that we, as her friends and colleagues, knew. Jacqueline possessed a wonderful joy in making music, and a unique ability to bring joy to her audience. This is the Jacqueline du Pré that we remember.\""]}, {"page": "Cecil Aronowitz", "response": ["* Johannes Brahms: String Quintets, String Sextet No. 1, String Sextet No. 2, Amadeus Quartet, William Pleeth (1966–1968)Brahms String Quintets & String Sextets", "* Richard Strauss: Prelude to Capriccio, Amadeus Quartet, William Pleeth (1971)Strauss review Christopher Fifield, 2001 "]}, {"page": "Bion Tsang", "response": ["Tsang began piano studies at age six and added cello a year later.  At age eight he entered the Juilliard School of Music Pre-College Division, where he studied cello with Ardyth Alton, Channing Robbins and Leonard Rose and piano with Edgar Roberts.  Tsang attended Harvard University for college, returning to Poughkeepsie on weekends to study cello with Luis Garcia-Renart.  He received his Bachelor of Arts degree from Harvard, where he was nominated for a Rhodes Scholarship and graduated with honors in January 1989.  Subsequently, he spent the next six months in London, England studying cello privately with William Pleeth, before moving on to Yale University to study cello with Aldo Parisot.  Tsang received a Master of Music degree from Yale in June 1991 and a Master of Musical Arts degree in June 1993."]}, {"page": "Martin Rummel", "response": ["The son of Peter Rummel, professor of law, grew up in Linz, where he went to primary school and graduated from Akademisches Gymnasium, where he received a Classical education, with highest marks in 1992. After early harpsichord and piano lessons from Helga Schiff-Riemann, he started to learn the cello in 1982 from Wilfried Tachezi at what is today the Anton Bruckner Private University for Music, Drama, and Dance. Simultaneously, he studied the harpsichord with August Humer, but did not finish this course. In March 1991, he got his diploma as a concert cellist with highest marks, being the youngest graduate of the institution's history at the time. After a few private lessons from Robert Cohen in London, he then studied there with William Pleeth. In the second half of the 1990s, he also studied with Maria Kliegel in Cologne and received a diploma with distinction and the \"Konzertexamen\" at the Musikhochschule. Subsequently, Rummel returned to studying with William Pleeth in London, whose last pupil he was to become."]}, {"page": "Françoise Groben", "response": ["Born on 4 December 1965 in Luxembourg City, Groben first studied the cello with Georges Mallach at the Conservatoire de Luxembourg. She continued with Boris Pergamenshikov at the Musikhochschule, Cologne, and subsequently with William Pleeth, Daniil Shafran, as well as with members of the Amadeus Quartet. In 1990 she won 2nd prize in the International Tchaikovsky Competition in Moscow.\"Performance Today: Zehetmair Quartet\", NPR. Retrieved 28 December 2010.\"Françoise Groben, Cello\" , Cecilia-cmc-de.  Retrieved 28 December 2010."]}, {"page": "1989 New Year Honours", "response": ["* William Pleeth, Cellist."]}, {"page": "List of fellows of the Royal College of Music", "response": ["* William Pleeth, 1988"]}, {"page": "Catherine Hewgill", "response": ["Hewgill continued her studies at the Aspen Music Festival and the Music Academy of the West and had private tuition from Mstislav Rostropovich and William Pleeth. In 1988 after touring Europe with I Solisti Veneti, she returned to her native Australia, initially as a cellist with the Australian Chamber Orchestra. She joined the Sydney Symphony Orchestra in 1989 and in 1990 became the orchestra's Principal Cellist. That same year she became a founding member of the Novalis Quartet, a string quartet which specialised in the music of the Romantic era.Bebbington, Warren Arthur (1997). \"Novalis Quartet\", The Oxford Companion to Australian Music, p. 496. Oxford University Press"]}, {"page": "Mats Rondin", "response": ["Rondin studied with Gunnar Norrby at the Royal College of Music in Stockholm and Erling Bengtsson Blöndal and Frans Helmerson at the Swedish Radio Music School in Edsbergsvägen. He gained a diploma in 1981 and studied further with William Pleeth in London. He also took lessons with Ralph Kirshbaum and Mstislav Rostropovich."]}, {"page": "Deaths in April 1999", "response": ["*William Pleeth, 83, British cellist."]}, {"page": "Mayke Rademakers", "response": ["Rademakers received her first cello lessons from Hungarian cellist György Schiffer. From the age of 16 she attended masterclasses by André Navarra at the summer school of the Accademia Chigiana in Siena, Italy. She then studied with André Navarra in Vienna. After 2 years she continued her studies with William Pleeth in London and with a Fulbright grant with János Starker. Her final examination at the Academy of Music in Utrecht was awarded cum laude."]}, {"page": "Concours de violoncelle Rostropovitch", "response": ["| Reine Flachot Raya Garbousova Cristobal Halffter Ludwig Hoelscher Alain Meunier André Navarra Aldo Parisot William Pleeth Étienne Vatelot"]}, {"page": "Pleeth, William", "response": ["#redirectWilliam Pleeth"]}, {"page": "Robert Cohen (cellist)", "response": ["Cohen was born on 15 June 1959 in London to violinist Raymond Cohen and pianist Anthya Rael. Having begun playing the cello at age 5, at age 10 he entered the Purcell School for Young Musicians. He also began studies with William Pleeth. At age 12 he made his concerto debut at the Royal Festival Hall, where he performed the Boccherini Concerto in B flat. His Wigmore Hall recital debut followed at age 17. In 1975 he began studies at the Guildhall School of Music and Drama, he graduated with a postgraduate Diploma of Advanced Solo in 1977. During this period he also studied with Jacqueline du Pré, André Navarra and Mstislav Rostropovich."]}, {"page": "Pleeth", "response": ["*William Pleeth (1916–1999), British cellist"]}, {"page": "The Brook Street Band", "response": ["The BSB was set up in 1996, with funds donated by William Pleeth and Margaret Good, cellist Theo’s maternal grandparents. Chamber music making had always been the driving passion in their musical careers and Pleeth and Good recognised the passion Theo had for it, and advised and enabled her to set up The Brook Street Band. The group took its name from Theo’s love for Handel’s music.  "]}]}}