{"wiki_id": "http://www.wikidata.org/entity/Q11723553", "itemLabel": "Jazmin Sawyers", "itemDescription": "British long jumper", "wikipedia_url": "https://en.wikipedia.org/wiki/Jazmin_Sawyers", "wikipedia_page": {"main": "Jazmin Sawyers (born 21 May 1994) is a British track and field athlete who competes in the long jump, and sports presenter. She has also competed as a bobsledder and a heptathlete.\nRepresenting England, she was the silver medallist in the long jump at the 2014 Commonwealth Games. At the both the 2016 Summer Olympics and the 2020 Summer Olympics, she finished eighth in the long jump. In 2017, she competed in the sixth series of The Voice UK. Her outdoor personal best is 6.90m achieved in June 2021.\n\n", "link_mentions": [{"page": "University of Bristol", "response": ["Other alumni include Anne McClain, member of the 2013 NASA Astronaut Class, mathematician Iain Gordon, long jumper Jazmin Sawyers, and Luke Bond, an organist at Windsor Castle, amongst many others."]}, {"page": "Gugl Games", "response": ["|Jazmin Sawyers"]}, {"page": "Jasmine (given name)", "response": ["* Jazmin Sawyers (b. 1994), British long jumper"]}, {"page": "List of people from Stoke-on-Trent", "response": ["*Jazmin Sawyers (born 1994), long jumper."]}, {"page": "Athletics at the 2011 Commonwealth Youth Games", "response": ["The men's 800 metres was high calibre and medallists Timothy Kitum and Nijel Amos both went on to win medals at the 2012 London Olympics. Jazmin Sawyers, the long jump and relay gold medallist in Douglas, advanced into the senior ranks three years later at the 2014 Commonwealth Games by getting the long jump silver.", "| Dina Asher-SmithYasmin MillerSophie PappsJazmin Sawyers || 46.19"]}, {"page": "Great Britain at the 2012 Winter Youth Olympics", "response": ["Mica McNeill and Jazmin Sawyers, in the two-girl Bobsled, won Great Britain's only medal at the Games.", "|   ||  Mica McNeillJazmin Sawyers || Bobsleigh || Two-girls || 22 Jan", "|Mica McNeillJazmin Sawyers"]}, {"page": "2012 World Junior Championships in Athletics", "response": ["| Jazmin Sawyers ||6.67 WJL"]}]}}