{"wiki_id": "http://www.wikidata.org/entity/Q1178414", "itemLabel": "Davy Kaye", "itemDescription": "British comedian (1916-1998)", "wikipedia_url": "https://en.wikipedia.org/wiki/Davy_Kaye", "wikipedia_page": {"main": "Davy Kaye MBE (born David Kodeish, 25 March 1916 – 3 February 1998) was an English comedy actor and entertainer.\n\n", "link_mentions": [{"page": "1998 in film", "response": ["| style=\"text-align:center;\"| 2 || Davy Kaye || style=\"text-align:center;\"| 81 || style=\"text-align:center;\"| Bahamas || style=\"text-align:center;\"| Actor || "]}, {"page": "You Rang, M'Lord?", "response": ["*Lady Lavender Southwick (Mavis Pugh) – Lady Lavender is Lord Meldrum's mother-in-law and she resides with her parrot, Captain, in the second bedroom of the house. She is very wealthy and has interests in many businesses including a large number of shares in the Union Jack Rubber Company. Lavender was born into an aristocratic family in the early 1850s, we are given to understand that she led a somewhat promiscuous youth, having many affairs, including with Boris the Crown Prince (later King) of Dalmatia (Davy Kaye). She then became involved with a young army officer called Captain Cedric Dolby (Maurice Denham); the two later became engaged, but separated shortly before he was sent off to fight in the Zulu war. After the death of her husband, Lord Southwick, Lady Lavender moved in with her daughter and son-in-law, becoming increasingly reclusive and senile, and enjoyed throwing plates of food at Ivy, the maid. She calls the servants by alternative names of her choosing (calling Ivy 'Ethel', Henry 'Steven' and Stokes 'Capes'). She has no idea who Teddy is (when he explains he is \"George's brother\" she comments she has a son-in-law with that name)."]}, {"page": "Carry On at Your Convenience", "response": ["Sid and Beattie find that Joey can correctly predict winners of horseraces – he tweets when the horse's name is read out. Sid bets on Joey's tips and makes several large wins – including a vital £1,000 loaned to W.C. when the banks refuse a bridging loan – before Sid is barred by Benny (Davy Kaye) his bookie after making several payouts.", "*Davy Kaye as Benny"]}, {"page": "Those Magnificent Men in Their Flying Machines", "response": ["* Davy Kaye as Jean, Chief mechanic for Pierre Dubois"]}, {"page": "Juke Box Jury", "response": ["* 20 June 1964 – Jane Asher, Davy Kaye, Stirling Moss, Anne Heywood"]}, {"page": "The Wrong Arm of the Law", "response": ["* Davy Kaye as Trainer King"]}, {"page": "List of British music hall performers", "response": ["* Davy Kaye (1916–1998)"]}, {"page": "The Magnificent Seven Deadly Sins", "response": ["* Davy Kaye "]}, {"page": "Grand Order of Water Rats", "response": ["* 1984 Davy Kaye"]}, {"page": "Chitty Chitty Bang Bang", "response": ["* Davy Kaye as Admiral"]}, {"page": "A Nightingale Sang in Berkeley Square (film)", "response": ["* Davy Kaye as Sid the Yid"]}, {"page": "Ritchie Blackmore", "response": ["*1964 Davy Kaye – \"A Fool Such As I\" (Single)"]}, {"page": "Alice's Adventures in Wonderland (1972 film)", "response": ["* Davy Kaye - Mouse", ": Performed by Davy Kaye"]}, {"page": "The Biggest Bundle of Them All", "response": ["* Davy Kaye as Davey"]}, {"page": "Crooks in Cloisters", "response": ["Crooks in Cloisters is a 1964 British comedy which features Ronald Fraser as 'Little Walter',  the leader of a gang of forgers, including Barbara Windsor as 'Bikini', Bernard Cribbins as 'Squirts', Melvyn Hayes as 'Willy', Grégoire Aslan as 'Lorenzo', and Davy Kaye as 'Specs'.", "* Davy Kaye as Specs "]}, {"page": "Davy (given name)", "response": ["*Davy Kaye (1916–1998), British actor"]}, {"page": "The Pot Carriers", "response": ["* Davy Kaye as Mouse"]}, {"page": "List of Royal Variety Performances", "response": ["| The Gang and 'Monsewer' Eddie Gray, The Cavendish Singers, The John Tiller Girls, Erica Yorke, The Victoria Palace Girls, The Marie De Vere Dancers, Vera Lynn, Harry Secombe, The Wiere Brothers, Stanley Black and the Dance Orchestra, Tony Fayne, David Evans, Richard Murdoch, Kenneth Horne, Arthur English, Sally Ann Howes, Jimmy Edwards, Florence Desmond, Norman Evans, Alan and Blanche Lund, Pearl Primus and her Company, Hoops - The Boys, Joaquin Pérez Fernandes and his Latin American Company, The Mary De Vere Dancers, Johnny Hutch and the Seven Volants, Sam Browne and his Singers, The Keyboard Quintette, Carroll Gibbons, Billy Thorburn, Ivor Moreton and Davy Kaye, Charlie Kunz, Patricia Morison, Barbara Bruce, Nervo and Knox, Naughton and Gold, Bud Flanagan, Miklos Gafni, Vera Lynn and Michael Dalton, Frances Day, Florence Desmond, Sally Ann Howes, Adelaide Hall, Sylvia Peters, Carole Lynne, Valerie Tandy, Anona Winn, Chesney Allen, Jimmy Gold, Gracie Fields, George Mitchell Choir, Jack Radcliffe, Cicely Courtneidge."]}, {"page": "List of acts that have appeared on the Royal Variety Performance", "response": ["*Davy Kaye: 1951"]}, {"page": "Satan's Harvest", "response": ["*Davy Kaye as Trigger"]}, {"page": "The World Ten Times Over", "response": ["* Davy Kaye ...  Compère"]}, {"page": "List of You Rang, M'Lord? characters", "response": ["*Lady Lavender Southwick (Mavis Pugh) – Lady Lavender is Lord Meldrum's mother-in-law and she resides with her parrot, Captain, in the second bedroom of the house. She is very wealthy and has interests in many businesses including a large number of shares in the Union Jack Rubber Company. Lavender was born into an aristocratic family in the early 1850s, we are given to understand that she led a somewhat promiscuous youth, having many affairs, including with Boris the Crown Prince (later King) of Dalmatia (Davy Kaye). She then became involved with a young army officer called Captain Cedric Dolby (Maurice Denham), the two later became engaged, but separated shortly before he was sent off to fight in the Zulu war. After the death of her husband, Lord Southwick, Lady Lavender moved in with her daughter and son-in-law, becoming increasingly reclusive and senile, and enjoyed throwing plates of food at Ivy. Lavender had a habit of calling the staff different names. Ivy would be called \"Ethel\", Alf would be called \"Capes\" and Henry would be called \"Steven\". Lavender was very genourous to the servants, giving them a suitcase with £10,000 in it, the family jewels, business company shares, and her bed. In the end it was Lavender who saved the Union Jack Rubber Company from collapse by selling her jewels and signing it over to Cissy."]}, {"page": "1995 New Year Honours", "response": ["*Davy Kaye. For charitable services."]}, {"page": "Kaplan Kaye", "response": ["Born in Watford, Hertfordshire, the son of actor and entertainer Davy Kaye, Kaplan 'Kap' Kaye trained at the Corona Stage Academy. His television debut was as Young Scrooge in an adaptation of A Christmas Carol (1958), part of the Tales from Dickens series. Other television appearances include roles in The Charlie Drake Show (1961), Henry in six episodes of William (1963), Eagle Rock (1964), The Saint (1964), the mini-series The Three Musketeers (1966), Armchair Theatre (1967), Z-Cars (1968), The First Lady (1968), and Journey to the Unknown (1968).Kaye on the Internet Movie Database"]}, {"page": "List of Sapphire & Steel serials", "response": ["| colspan=\"5\" | Patience Collier as Emma Mullrine, Davy Kaye as Lord Mullrine, Nan Munro as Felicity McDee, Jeffry Wickham as Felix Harborough, Jeremy Child as Howard McDee, Jennie Stoller as Annabelle Harborough, Peter Laird as Greville, Stephen MacDonald as George McDee, Christopher Bramwell as Tony Purnell, Patricia Shakesby as Anne Shaw, Debbie Farrington as Veronica Blamey, Valentine Dyall as Radio broadcast voice"]}, {"page": "Hippodrome, Aldershot", "response": ["The Hippodrome played host to many famous artists of the day, including: Marie Lloyd, Neville Kennard, The Western Brothers, Tom Leamore,Tom Leamore on The Music Hall Guild of Great Britain and America website Humphrey Lyttelton, Acker Bilk, Mike & Bernie Winters, Eric Delaney, Chas McDevitt and Nancy Whiskey, Arthur English, Clapham and Dwyer, Sabrina, Phyllis Dixey,Bond, Derek. Steady, Old Man!: Don't You Know There's a War On? Leo Cooper (1990) pg 105 Google Books Florrie Forde, Gracie Fields,'By Request' - The Official Gracie Fields website Terry Scott, Arthur Askey, Harry Champion, Leon Cortez, Ella Shields, Tommy Fields, Hylda Baker, Arthur Lucan and Kitty McShane in their famous 'Old Mother Riley' act, Ivor Moreton and Davy Kaye, Joe Loss and his Orchestra, Lonnie Donegan, Chris Barber and his Jazz Band, Johnny Dankworth and Cleo Laine, Primo Scala and His Accordion Band, Jimmy James and Eli Woods, Wee Georgie Wood, George Robey, Cicely Courtneidge, Tommy Trinder, Jack Haig, George Martin, Chrystabel Leighton-Porter as 'Jane', Robertson Hare, Peter Jeffrey, Clive Dunn, Geoffrey Lumsden and Max Miller.Hippodrome Programmes in the Glenn Christodoulou Collection"]}, {"page": "Fun at St. Fanny's", "response": ["* Davy Kaye as Ferdy  "]}, {"page": "Deaths in February 1998", "response": ["*Davy Kaye, 81, British actor and entertainer.Patrick Newley Davy Kaye Obituary - The Independent 6 February 1998, Retrieved 28 October 2019"]}, {"page": "Winning Widows", "response": ["Other actors who appeared in the series include Thorley Walters, Carole Shelley, Anthony Sagar, Willoughby Goddard, Harold Goodwin, Hugh Paddick, John Junkin, Davy Kaye, Barbara Hicks, Graham Stark, Joe Melia, Ronnie Stevens, Anneke Wills and Bernard Cribbins."]}]}}