{"wiki_id": "http://www.wikidata.org/entity/Q1179117", "itemLabel": "Stanley Harris", "itemDescription": "English sportsman (1881-1926)", "wikipedia_url": "https://en.wikipedia.org/wiki/Stanley_Harris_(footballer)", "wikipedia_page": {"main": "Stanley Shute Harris (19 July 1881 – 4 May 1926) was an English footballer who represented and captained the England national football team. He also played first-class cricket for various clubs, appearing in a total of 16 first-class matches.", "link_mentions": [{"page": "England national amateur football team", "response": ["Its first international match was against Germany on 21 September 1901, a 12–0 win at White Hart Lane, London, R. E. Foster scoring 6 (One source gives 7). The next match was away against France on 1 November 1906 and resulted in a 15–0 win for England, with Stanley Harris netting seven goals and Vivian Woodward four. The team played many internationals against the full representative sides of Europe, which were usually a mixture of amateur and professional players. The strength of the English amateur team meant they were still able to beat many of these sides and in fact they were unbeaten in 20 matches from 1906 to 1910. Whilst these England amateur matches are not considered full senior internationals by The Football Association, they are deemed to be by their opponents. As such, the England amateur side delivered the biggest defeats on several European nations; the Netherlands in 1907, Germany & Belgium in 1909, and Sweden & Hungary in 1912 (as Great Britain), beating them 12-2, 9–0, 11–2, 12-2 and 7-0 respectively."]}, {"page": "England national football team records and statistics", "response": ["; Most goals in a matchPlaying for England Amateurs, Stanley Harris scored seven goals against France on 1 November 1906 and Vivian Woodward scored six against Netherlands on 11 December 1909.  While not recognized by the Football Association, these matches are considered full internationals by the Dutch and French FAs."]}, {"page": "Osbert Lancaster", "response": ["In 1918 Lancaster was sent to St Ronan's preparatory school, Worthing. The régime at the school leaned heavily towards sport, in which he was neither interested nor proficient. The headmaster, Stanley Harris, was a celebrated amateur footballer and occasional first class cricketer, but he was reasonably tolerant of Lancaster's disdain for games, and on the whole Lancaster enjoyed his time at the school. His education there was, he later commented, of more importance to him than anything he learned later in his school and university career.Knox, p. 16 He left St Ronan's in 1921, aged thirteen, and went to Charterhouse, where his father and uncles had all been sent.Knox, p. 18 There he was shocked by the bullying and bad language,Boston, pp. 44–45 but in addition to its sporty, philistine \"bloods\",Boston, pp. 44 and 47 the school had an intellectual and aesthetic tradition. Lancaster's biographer Richard Boston writes, \"The hearty Baden-Powell, for example, was offset by Ralph Vaughan Williams and Robert Graves, while talented Carthusian artists had included Thackeray, Leech, Lovat Fraser and Max Beerbohm\".Boston, p. 47 The art master, P.J.(\"Purple\")Johnson, encouraged Lancaster, insisting that a sound technique was a prerequisite for effective self-expression in drawing or painting; in that respect the boy's time at the school was valuable, though otherwise the headmaster found him \"irretrievably gauche... a sad disappointment\".Boston, p. 46 Lancaster shared Beerbohm's view that being an old boy of the school was more pleasurable than being a pupil there."]}, {"page": "1881 in association football", "response": ["* 19 July – Stanley Harris (d. 1926), England international forward in six matches (1904–1906), scoring two goals."]}, {"page": "1903–04 British Home Championship", "response": ["|align=left|Stanley Harris"]}, {"page": "1904–05 British Home Championship", "response": ["|align=left|Stanley Harris"]}, {"page": "Freddie Wilcox", "response": ["The following season he was joint leading scorer in league matches, though with only eight goals, as the team established itself at the higher level. In 1904–05 he played and scored for The North against The South in an England international trial, but the selectors preferred Stanley Harris at inside left. Wilcox and partner Oakey Field gained a reputation as the \"best left wing in the First League\" of that season, but both were injured towards the end of the campaign as Small Heath, who had been challenging for the title, were only able to finish seventh. Wilcox still managed twelve goals, and a further five in 1905–06 as he again lost time to injury and to a reported disagreement with the club."]}, {"page": "Stanley Harris", "response": ["Stanley Harris may refer to:", "*Stanley Harris (footballer) (1881–1926), English footballer and cricketer"]}, {"page": "List of English cricket and football players", "response": ["| Stanley Harris"]}, {"page": "Stanley Harris (cricketer)", "response": ["#REDIRECT Stanley Harris (footballer)"]}, {"page": "List of Gloucestershire County Cricket Club players", "response": ["* Stanley Harris (1902) : S. S. Harris"]}, {"page": "1906 Sheriff of London Charity Shield", "response": ["|FW || ||  Stanley Harris"]}, {"page": "1907 Sheriff of London Charity Shield", "response": ["|Forward || || Stanley Harris"]}]}}