{"wiki_id": "http://www.wikidata.org/entity/Q1176696", "itemLabel": "David Speedie", "itemDescription": "Scottish footballer (born 1960)", "wikipedia_url": "https://en.wikipedia.org/wiki/David_Speedie", "wikipedia_page": {"main": "David Robert Speedie (born 20 February 1960) is a Scottish former footballer who played for several clubs in England during the 1980s and 1990s, most notably Chelsea, Coventry City, Liverpool and Blackburn Rovers. He accumulated more than 500 football league appearances and scored almost 150 goals in a 14-year professional career. He also earned ten international caps for Scotland.", "link_mentions": [{"page": "Chelsea F.C.", "response": ["|1985|| David Speedie"]}, {"page": "Alan Shearer", "response": ["During the middle of 1992, Southampton's manager, Ian Branfoot, became \"the most popular manager in English football\", as he took telephone calls from clubs \"trying to bargain with players they don't want plus cash\". Although Branfoot accepted that a sale was inevitable, he claimed that \"whatever happens, we are in the driving seat\".Quoted in  In July 1992, Shearer was sold to Blackburn Rovers for a fee of £3.6 million, with David Speedie reluctantly moving to The Dell as part of the deal. Despite Branfoot's claim to be \"in the driving seat\", Saints failed to include a \"sell-on clause\" in the contract. Shearer, less than a month off his 22nd birthday, was the most expensive player in British football. In his four years in the Southampton first team, Shearer made a total of 158 appearances in all competitions, scoring 43 goals."]}, {"page": "Blackburn Rovers F.C.", "response": ["|1991–92|| David Speedie"]}, {"page": "Coventry City F.C.", "response": ["|  David Speedie", "|  David Speedie", "|  David Speedie 15", "|  David Speedie 9"]}, {"page": "Glenrothes", "response": ["Famous people associated with the town include the actor Dougray Scott who grew up in Glenrothes and attended Auchmuty High School. Douglas Mason, known as one of the engineers of the \"Thatcher revolution\" and the \"father of the poll tax\" set up home in Glenrothes in the 1960s and spent most of his adult life living there. Henry McLeish, the former First Minister of Scotland lived in Glenrothes, having been brought up in nearby Kennoway. Glenrothes town centre is home to the building involved in the notorious Officegate scandal, which ultimately led to McLeish's resignation as First Minister in 2001. Tricia Marwick, the first female Presiding Officer of the Scottish Parliament served as MSP for Glenrothes. The town has also been home to current and former professional football players including Kevin McHattie (Inverness Caledonian Thistle and previously Hearts), Billy MacKay (formally Rangers and Hearts) and David Speedie (formally Chelsea, Liverpool)."]}, {"page": "Stamford Bridge (stadium)", "response": ["Now complete, the stand is the primary external 'face' of the stadium, being the first thing fans see when entering the main gate on Fulham Road. The Main Entrance is flanked by hospitality entrances, formerly named after former Chelsea players Nigel Spackman and David Speedie. Signage at those entrances with those players' names was removed in 2020, to be replaced by directional signage, meaning those entrances are no longer named after any player.  The stand also features the largest concourse area in the stadium, it is also known as the 'Great Hall' and is used for many functions at Stamford Bridge, including the Chelsea Player of the Year ceremony."]}, {"page": "Peter Beardsley", "response": ["Beardsley suffered another blow to his first team chances in January 1991 when Kenny Dalglish signed David Speedie. Dalglish stepped down the following month and was replaced a few weeks later by former Liverpool player Graeme Souness, after Ronnie Moran spent two months in charge on an interim basis. Beardsley managed 27 games that campaign and scored 11 goals – three of them in a 4–0 league win over Manchester United on 16 September 1990, and a further two in the Merseyside derby against Everton a week later.", "Liverpool were top of the league at this stage, but in the new year were overhauled by Arsenal and the title went to Highbury at the end of the season. And with the arrival of Dean Saunders for a national record fee of £2.9 million after the end of the season, Beardsley's days at Anfield were looking even more numbered, despite the sale of David Speedie."]}, {"page": "Ronny Rosenthal", "response": ["During the 1990–91 season, Rosenthal faced continued fierce competition for a place in the first team from Liverpool's established strikers Ian Rush and Peter Beardsley, and then from mid-season signing David Speedie. He played 16 times in the league, and scored five goals as Liverpool finished second in the league. In 1991–92, Rosenthal played 20 times in the league, but it was a frustrating league campaign for both player and club, as the Reds finished sixth in the league and Rosenthal only found the net three times. Liverpool did win the FA Cup that season, but Rosenthal was not selected for the final. Despite the pre-season departure of both Speedie and Beardsley, Rosenthal was now faced with competition for a place from new signing Dean Saunders. 1992–93 was slightly better, as Rosenthal played 27 games in the new Premier League, and scored six goals, but it was another frustrating season for Liverpool, who finished sixth in the league once again and spent most of the season occupying even lower positions. Saunders had been sold to Aston Villa early in the season, while new signing Paul Stewart proved to be a major disappointment. A memorable occasion during that first Premier League season came when Rosenthal hit the crossbar with a shot on an open goal in a league match against Aston Villa."]}, {"page": "Dean Saunders", "response": ["During the 1990–91 season he netted 17 league goals but Derby still went down in bottom place with just five league wins all season. Their relegation saw most of the country's top clubs queue up in their bid to capture Saunders' services, and Everton were favourites to sign him, and there were also approaches from Aston Villa's new manager Ron Atkinson, and Nottingham Forest's Brian Clough. Saunders ended up at Liverpool, who paid a then English record fee of £2.9 million for Saunders on 19 July 1991 to make him Ian Rush's new strike-partner following the departures of David Speedie and Peter Beardsley."]}, {"page": "Nigel Spackman", "response": ["Born in Romsey, Hampshire, Spackman started at Andover and spent his first three years as a professional with AFC Bournemouth before joining Chelsea for £35,000 in the summer of 1983. He signed for Chelsea as part of manager John Neal's re-building of the side alongside the likes of Kerry Dixon, Pat Nevin and David Speedie. Spackman scored on his debut for the club in a 5–0 opening day win over Derby County, though he was not a regular goalscorer. Chelsea were promoted at the end of that season as Second Division champions and finished 6th in the following two seasons back in the top tier, with Spackman a near ever-present. During the 1986–87 season, several key players, including Spackman, fell out with manager John Hollins and he was sporadically left out of the starting line-up or played out of position. He was sold to Liverpool in 1987 for £400,000."]}, {"page": "John Aldridge", "response": ["In early 1987, Liverpool were losing their chief striker Ian Rush to Juventus at the end of the 1986–87 season and needed a proven and experienced replacement. The Liverpool-born Aldridge was now recognised as one of the First Division's most competent scorers, and he even bore a physical resemblance to Rush. He signed for Kenny Dalglish's side on 27 January 1987 for £750,000 and was initially used as a partner for Rush (filling a position previously occupied by player-manager Dalglish and fellow striker Paul Walsh) and as an occasional substitute. Dalglish had been interested in signing a number of other strikers including Chelsea's David Speedie and Arsenal's Charlie Nicholas for a number of months before settling on Aldridge."]}, {"page": "Howard Gayle", "response": ["He then spent five years at Blackburn Rovers, signing for them in 1987 and being a regular striker in their quest for top flight football. However, by the time Blackburn were promoted in 1992 (to the newly created Premier League), Gayle had been left behind in the pecking order by expensively signed new players like Mike Newell and David Speedie, and with the arrival of national record signing Alan Shearer that summer, it was clear that Blackburn manager Kenny Dalglish felt that Gayle was surplus to requirements at Ewood Park."]}]}}