{"wiki_id": "http://www.wikidata.org/entity/Q11737413", "itemLabel": "Katie Byres", "itemDescription": "British athlete", "wikipedia_url": "https://en.wikipedia.org/wiki/Katie_Byres", "wikipedia_page": {"main": "Katie Byres (born 11 September 1993) is a British former track and field athlete who competed in the pole vault. She holds a personal best of 4.52 m (14 ft 9+3⁄4 in) for the event, set in Nevers, France on 18 February 2012. Her highest national ranking during her career was third in 2012. She also ranked 16th in the world in the 2012 indoor season. She broke the British under-20 records for pole vault, indoors and outdoors.Born in Chesterfield, Byres is a member of Sale Harriers Manchester. She became interested in pole vaulting after watching the 2004 Olympic pole vault final on television. She began travelling to Sportcity in Manchester to train for the event. She was coached until 2013 by Julien Raffalli-Ebezant, who also coached national record breaker Holly Bradshaw. After then, she began training with Kate Rooney – herself a former pole vaulter. In 2008 Byres won the England Open Athletics Championships and placed fifth at the 2009 British Athletics Championships the following year, still aged 15. She later managed runner-up performances at the 2012 British Indoor Athletics Championships, 2013 British Indoor Athletics Championships and 2014 British Athletics Championships.In international age category competitions she placed tenth at the 2009 European Youth Olympic Festival, won the B-final of the pole vault at the 2010 Summer Youth Olympics, and came ninth at the 2013 European Athletics U23 Championships.She was also a participant at the 2012 World Junior Championships in Athletics, 2012 IAAF World Indoor Championships, and 2014 Commonwealth Games, but failed to record a valid height at any of the competitions.She retired from competitive pole vaulting after January 2015. Following her pole vault career, Byres attended Nottingham Trent University, completing a degree in Events Management, and worked for Young Enterprise.", "link_mentions": [{"page": "Great Britain at the 2010 Summer Youth Olympics", "response": ["|Katie Byres"]}, {"page": "2012 IAAF World Indoor Championships – Women's pole vault", "response": ["|  ||align=left| Katie Byres ||align=left|   || xxx || || || || || || || ||  ||"]}, {"page": "2012 World Junior Championships in Athletics – Women's pole vault", "response": ["| || B || align=left|Katie Byres || align=left| || – || – || – || xxx ||  ||  || "]}, {"page": "Athletics at the 2014 Commonwealth Games – Women's pole vault", "response": ["|  || align=\"left\"| Katie Byres || align=\"left\"|  || xxx || || || || || || || || || ||"]}, {"page": "2013 European Athletics U23 Championships – Women's pole vault", "response": ["| 9 || align=left | Katie Byres || align=left |  || - || o || o || xxx ||  ||  ||  ||  ||  ||  ||  ||  ||  ||  4.15 || ", "| 1 || align=left | Katie Byres || align=left |  || 4.20 || Q SB", "| 1 || align=left | Katie Byres || align=left |  || - || - || - || - || o || - || o || o ||  4.20 || Q SB"]}, {"page": "2013 British Indoor Athletics Championships", "response": ["|Katie Byres || 4.20 m"]}, {"page": "2014 British Athletics Championships", "response": ["|Katie Byres || 4.10 m"]}, {"page": "2012 British Indoor Athletics Championships", "response": ["|Katie Byres || 4.37 m"]}]}}