{"wiki_id": "http://www.wikidata.org/entity/Q11721652", "itemLabel": "Tom Bateman", "itemDescription": "actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Tom_Bateman_(actor)", "wikipedia_page": {"main": "Thomas Jonathan Bateman (born 15 March 1989) is an English actor, best known for his roles on the historical fantasy drama series Da Vinci's Demons (2013–2015) and in the film Murder on the Orient Express (2017).", "link_mentions": [{"page": "Vanity Fair (novel)", "response": ["*Vanity Fair (2018), a seven-part ITV and Amazon Studios adaptation, starring Olivia Cooke as Becky Sharp, Tom Bateman as Captain Rawdon Crawley, and Michael Palin as Thackeray."]}, {"page": "Murder on the Orient Express", "response": ["On 16 June 2015, 20th Century Fox hired Kenneth Branagh to direct and star as Poirot in another film adaptation of the story, which was released on 3 November 2017. On 29 September 2016, the studio issued a press release announcing much of the cast, including Johnny Depp as Ratchett, Michelle Pfeiffer as Mrs Hubbard, Penélope Cruz as Pilar Estravados (a Spanish version of Greta Ohlsson, the name coming from a character in Hercule Poirot's Christmas), Judi Dench as Princess Dragomiroff, Derek Jacobi as Masterman, Leslie Odom Jr. as Dr Arbuthnot, Daisy Ridley as Mary Debenham, Lucy Boynton as Countess Andrenyi, Tom Bateman as Monsieur Bouc, Manuel Garcia-Rulfo as Biniamino Marquez (a Cuban version of Antonio Foscarelli), Josh Gad as Hector MacQueen, Marwan Kenzari as Pierre Michel, Sergei Polunin as Count Andrenyi, Willem Dafoe as Cyrus Hardman, and Olivia Colman as Hildegarde Schmidt. The character of Col. Arbuthnot is combined with Dr. Constantine to create Dr Arbuthnot, a sniper who served under Col. Armstrong in the war and had his medical school paid for by Armstrong; MacQueen's father is portrayed as having been a prosecutor in the Armstrong case rather than the Armstrong family's lawyer, and whose career was ruined after he prosecuted the maid Susanne; and Monsieur Bouc is changed from the director of the line to the director's nephew. Added was a direct link for Poirot to the Armstrong kidnapping—before Sonia's death, John Armstrong wrote to Poirot for help. Also unlike the book, the kidnapping didn't take place in Long Island but in New Jersey, where the Lindbergh Kidnapping took place. Susanne Michel is switched from Pierre Michel's daughter to his sister. Cyrus Hardman poses as an Austrian scientist named Gerhard Hardman for part of the film. The last scene also sets up Death on the Nile as a sequel."]}, {"page": "Giuliano de' Medici", "response": ["Giuliano is portrayed by Tom Bateman in Starz's original series Da Vinci's Demons (2013–2015). He has an affair with Vanessa, who becomes pregnant with his child. He is murdered in the season 1 finale. Giuliano de' Medici was portrayed by Bradley James in the second season of the TV series Medici: Masters of Florence (2016–2019)."]}, {"page": "Cherwell School", "response": ["*Tom Bateman, actor. "]}, {"page": "Suzan-Lori Parks", "response": ["Father Comes Home From the Wars, Parts 1, 2 & 3 premiered Off-Broadway at the Public Theater on March 14, 2014 and closed on March 22, 2014 in a developmental production. Directed by Jo Bonney, the cast featured Sterling K. Brown (Hero), Peter Jay Fernandez (Oldest Old Man), Russell G. Jones (Leader/Runaway), and Jacob Ming-Trent (Runaway slave / Odyssey Dog / Fourth).\" Father Comes Home From the Wars, Parts 1, 2 & 3 March\", lortel.org, retrieved January 14, 2017. The play returned to the Public Theater on October 14, 2014 and ran to December 7, 2014, with the same director and cast. Jacob Ming-Trent won the 2015 Lucille Lortel Award for Outstanding Featured Actor in a Play\" Father Comes Home From the Wars, Parts 1, 2 & 3 October\", lortel.org, retrieved January 14, 2017 and Parks won the 2015 Obie Award for playwriting presented by the American Theater Wing.Obie Awards, 2015 Winners obieawards.com The play, which takes place during the American Civil War, is presented in three parts: Part 1, A Measure of a Man; Part 2, The Battle in the Wilderness; and Part 3, The Union of My Confederate Parts.Hetrick, Adam. \"Suzan-Lori Parks Father Comes Home from the Wars' Extends Again\" Playbill, November 17, 2014 From September 15 to October 22, 2016 the play had its London premiere at the Royal Court in a transfer of the Public Theatre production directed by Jo Bonney. The cast featured Steve Toussaint, Nadine Marshall, Leo Wringer, Sibusiso Mamba, Tom Bateman, and Jimmy Akingbola.\" royalcourttheatre.com, retrieved October 25, 2018"]}, {"page": "Yuichi Nakamura (voice actor)", "response": ["*Murder on the Orient Express, Bouc (Tom Bateman)"]}, {"page": "List of thriller films of the 2010s", "response": ["|Cold Pursuit||Hans Petter Moland||Liam Neeson, Tom Bateman, Tom Jackson||United States||Action thriller"]}, {"page": "Da Vinci's Demons", "response": ["* Tom Bateman as Giuliano de' Medici, brother to Lorenzo (seasons 1–2)"]}, {"page": "Thomas Bateman (disambiguation)", "response": ["*Tom Bateman (politician) (1922–2003), Australian politician", "*Tom Bateman (actor) (born 1989), English actor"]}, {"page": "The Tunnel (TV series)", "response": ["* Tom Bateman as Danny Hillier ", "The series includes several guest stars. Joseph Mawle plays a social worker named Stephen Beaumont, Tom Bateman appears as journalist Danny Hiller, and Tobi Bakare plays Chuks Akinade. Thibault de Montalembert plays Olivier Pujol, who is the head of the Calais police service, and Elise's superior. Sigrid Bouaziz plays Cécile Cabrillac and Cédric Vieira plays Philippe Viot; these characters are police officers who work with Elise. Mathieu Carrière and Jeanne Balibar play banker Alain Joubert, and his wife Charlotte, respectively. Merlin actress Angel Coulby stars as Laura Roebuck, Karl's wife, while Jack Lowden plays Adam, his son. Keeley Hawes guest-starred as Suze Harcourt, a care worker and drug addict, along with Liz Smith, who plays Harriet, an elderly woman under Harcourt's care."]}, {"page": "WhatsOnStage Award for Best Actor in a Play", "response": ["| Tom Bateman"]}, {"page": "Daisy Ridley", "response": ["Ridley resides in Primrose Hill, London. Since 2017, she has been in a relationship with actor Tom Bateman, whom she met on the set of Murder on the Orient Express."]}, {"page": "Shakespeare in Love (play)", "response": ["The play premiered at the Noël Coward Theatre in London's West End on 22 July 2014. It was produced by Disney Theatrical Productions and Sonia Friedman Productions and directed by Declan Donnellan, with design by Nick Ormerod and music by Paddy Cunneen. The original cast included David Oakes appearing as Marlowe, Tom Bateman as Will, and Lucy Briggs-Owen as the heroine Viola De Lesseps. The production closed on 18 April 2015.Shakespeare In Love. Accessed: 21 March 2015.", "* Tom Bateman as William Shakespeare"]}, {"page": "Snatched (2017 film)", "response": ["* Tom Bateman as James"]}, {"page": "Jekyll and Hyde (TV series)", "response": ["*Tom Bateman Dr. Robert Jekyll/Hyde, the grandson of the Victorian Dr. Henry Jekyll/Edward Hyde, the son of Louis Jekyll/Hyde and the twin brother of Olalla Jekyll/Hyde. As with most \"modern\" Jekyll-and-Hydes, in his Hyde state he possesses superhuman strength, speed and an accelerated healing factor.", "The series was based at 3 Mills Studios and also filmed in Kent – Rochester High Street doubles as the exterior of the Empire music hall and The Guildhall Museum features as the hotel where Dr. Jekyll (Tom Bateman) first lodges when arriving in England. The Historic Dockyard Chatham was used as location for the scenes used for Gravesend Docks, Tenebrae offices and factory and various areas of the site feature as London Streets and markets. Elmley Nature Reserve features in episode three as the setting for Maggie's (Niamh Walsh) country house and the Fort Amherst tunnels are used in episodes 9 and 10 where Jekyll finds out about the powers of The Incubus."]}, {"page": "Creditors (2015 film)", "response": ["Creditors is a Britishhttp://www.bfi.org.uk/sites/bfi.org.uk/files/downloads/bfi-we-are-uk-film-uk-films-for-sale-cannes-2015-05-13.pdf drama film written and directed by Ben Cura, based on the play of the same title by August Strindberg and starring Christian McKay, Andrea Deck, Ben Cura, Tom Bateman and Simon Callow.http://filmcourage.com/content/writerdirector-ben-cura’s-uk-love-triangle-feature-film-creditors-world-premiering-at-nyc’s- Set in present-day England and Spain in this adaptation, it had its world premiere at the 2015 Nordic International Film Festival in New York City as part of the festival's Official Selection, where it was nominated for and was awarded the Honorable Mention for Best Nordic Narrative Feature. The film was a United Kingdom production by London-based company Tough Dance, founded by Ben Cura and Andrea Deck. Spanish company Cuibar Productions financed the film. Paris-based sales agents New Morning Films took on world sales of the film in early 2015. The film is actor Ben Cura's debut as a director, screenwriter, and producer.", "*Tom Bateman as Michael Redmane"]}, {"page": "Murder on the Orient Express (2017 film)", "response": ["Murder on the Orient Express is a 2017 mystery film directed by Kenneth Branagh with a screenplay by Michael Green, based on the 1934 novel of the same name by Agatha Christie. The film stars Branagh as Hercule Poirot, with Tom Bateman, Penélope Cruz, Willem Dafoe, Judi Dench, Johnny Depp, Josh Gad, Derek Jacobi, Leslie Odom Jr., Michelle Pfeiffer, and Daisy Ridley in supporting roles. The film is the fourth screen adaptation of Christie's novel, following the 1974 film, a 2001 TV film version, and a 2010 episode of the television series Agatha Christie's Poirot. The plot follows Poirot, a world-renowned detective, as he investigates a murder on the luxury Orient Express train service in the 1930s.", "* Tom Bateman as Bouc, Poirot's friend, and nephew of the owner of the Orient Express.", "In June 2016, Angelina Jolie entered into \"talks\" to join the cast of the film, in the role of Mrs. Caroline Hubbard. However, it was later reported that Jolie had passed on the role and that Charlize Theron, among others, was in consideration for the role. In August 2016, Leslie Odom Jr. joined the cast. In September 2016, Tom Bateman, Johnny Depp, Michelle Pfeiffer, Daisy Ridley, Michael Peña, Judi Dench, Lucy Boynton and Derek Jacobi joined the cast. In October 2016, Josh Gad and Marwan Kenzari joined the cast. In November 2016, Penélope Cruz joined the cast. In December 2016, Sergei Polunin joined the cast. In January 2017, William Dafoe and Manuel Garcia-Rulfo joined the cast with the latter replacing Peña, who had dropped out of the project."]}, {"page": "Patricia Lovett", "response": ["She has also produced many commissioned works including pieces for Great Ormond Street Hospital for Sick Children, the Woodland Trust, Courtauld Institute of Art, British Academy Film Awards (BAFTAs) and Dulwich Picture Gallery. She has also worked in film and television providing tools and materials for Wolf Hall (BBC series) (a replica Book of Hours), Treasures of the Anglo-Saxons (BBC Radio 4) and the Simon Schama BBC series A History of Britain. She has taught Mark Rylance and Tom Bateman how to prepare and use a quill for film and theatre performances and has appeared in “Numerous instances of being filmed as ‘the hand’, writing documents, signing documents, ‘being’ poets or historical figures, drawing maps etc.” for film and television."]}, {"page": "List of British films of 2017", "response": ["|| Directors: Kenneth Branagh  Cast: Kenneth Branagh, Daisy Ridley, Josh Gad, Derek Jacobi, Leslie Odom Jr., Tom Bateman, Penélope Cruz, Willem Dafoe, Judi Dench, Michelle Pfeiffer, Olivia Colman, Lucy Boynton, Johnny Depp"]}, {"page": "Into the Dark (TV series)", "response": ["Into the Dark was ordered in January 2018, and has been met with a positive response from critics upon its premiere. Each episode has starred different actors, including Tom Bateman, Dermot Mulroney, Nyasha Hatendi, Suki Waterhouse, Matt Lauria, Jimmi Simpson, Keir O'Donnell, Israel Broussard, Aurora Perrineau, Clayne Crawford, Martha Higareda, Corey Fogelmanis, Jude Demorest, Jahkara Smith, Adelaide Kane, Reign Edwards, Britt Baron, Giorgia Whigham, Felicia Day, Tina Majorino, Judy Greer, Barry Watson, Dana Drori, and Megalyn Echikunwoke."]}, {"page": "Death on the Nile (2022 film)", "response": ["Death on the Nile is an upcoming mystery thriller film directed by Kenneth Branagh from a screenplay by Michael Green, based on the 1937 novel of the same name by Agatha Christie. Produced by Branagh, Ridley Scott, Judy Hofflund and Kevin J. Walsh, the film is a follow-up to Murder on the Orient Express (2017) and stars  Branagh returning as Hercule Poirot, along with Tom Bateman (also returning from the first film), Annette Bening, Russell Brand, Ali Fazal, Dawn French, Gal Gadot, Armie Hammer, Rose Leslie, Emma Mackey, Sophie Okonedo, Jennifer Saunders, and Letitia Wright round out the ensemble cast. The film is the third screen adaptation of Christie's novel, following the 1978 film and an episode of the television series Agatha Christie's Poirot broadcast in 2004.", "* Tom Bateman as Bouc, Poirot's friend and confidant and Euphemia’s son", "In September 2018, Gal Gadot joined the cast. In addition, Paco Delgado was hired to design the costumes. In October 2018, Armie Hammer joined the cast, and Tom Bateman was confirmed to reprise his role as Bouc for the film. In January 2019, Jodie Comer had joined the cast. In April 2019, Letitia Wright joined the cast. Annette Bening was in talks to join in June. Russell Brand joined the cast in August 2019. Ali Fazal, Dawn French, Rose Leslie, Emma Mackey, Sophie Okonedo and Jennifer Saunders were added in September, with Comer not being involved."]}, {"page": "Cold Pursuit", "response": ["Cold Pursuit is a 2019 black comedy action thriller film directed by Hans Petter Moland from a screenplay by Frank Baldwin. A British-American co-production, the film stars Liam Neeson, Tom Bateman, Tom Jackson, Emmy Rossum, Domenick Lombardozzi, Julia Jones, John Doman, and Laura Dern.  It is a remake of the 2014 Norwegian film In Order of Disappearance (Kraftidioten), also directed by Moland, and follows a vengeful snowplow driver who starts killing the members of a drug cartel following the murder of his son.", "* Tom Bateman as Trevor \"Viking\" Calcote"]}, {"page": "Beecham House", "response": ["| Tom Bateman"]}, {"page": "Vanity Fair (2018 TV series)", "response": ["The series stars Olivia Cooke as Becky Sharp, Tom Bateman as Captain Rawdon Crawley, and Michael Palin as the author William Makepeace Thackeray.", "* Tom Bateman as Rawdon Crawley, an empty-headed cavalry officer, younger of the two Crawley sons and favourite of their Aunt Matilda, until he marries Sharp, a woman of a far lower class."]}, {"page": "The Body (Into the Dark)", "response": ["\"The Body\" is an episode of American horror anthology web television series Into the Dark that aired as the first episode of the show's first season. It originally premiered in the United States on October 5, 2018, on Hulu. The episode was directed by Paul Davis from a script he co-wrote with Paul Fischer, based on the 2013 short film of the same name also written by the duo. It stars Tom Bateman, Rebecca Rittenhouse, Aurora Perrineau, David Hull, Ray Santiago, Harvey Guillén, and Max Adler.", "Professional hitman Wilkes (Tom Bateman) has just finished murdering a never-to-be-named famous man in his lavish apartment. Sipping a glass of the dead man's wine and tasting his casu marzu, Wilkes receives a call from his employer and lets him know he finished the job. The only thing left is to remove the body. Wilkes wraps it up like a mummy and drags it through the hotel lobby and into the street. He is seen by several people, but they assume it is all part of his Halloween costume.", "Simultaneously with the announcement of the series premiere, it was confirmed that Tom Bateman, Rebecca Rittenhouse, Aurora Perrineau, David Hull, and Ray Santiago would star in the episode."]}, {"page": "Behind Her Eyes (novel)", "response": ["On 25 January 2019, it was announced that Netflix had given the production a series order for a first season. Steve Lightfoot is credited as the creator, executive producer and show runner of the limited series. In August 2019, it was confirmed that Simona Brown, Eve Hewson, Tom Bateman and Robert Aramayo would star in the limited series."]}, {"page": "Behind Her Eyes (TV series)", "response": ["Behind Her Eyes is a British noir supernatural psychological thriller web series created by Steve Lightfoot, based on the 2017 novel of the same name by Sarah Pinborough, that premiered on Netflix on 17 February 2021. The limited series stars Simona Brown, Tom Bateman, Eve Hewson and Robert Aramayo.", "* Tom Bateman as Dr. David Ferguson", "In August 2019, it was confirmed that Simona Brown, Eve Hewson, Tom Bateman and Robert Aramayo would star in the limited series."]}, {"page": "2015 WhatsOnStage Awards", "response": ["**Tom Bateman – Shakespeare in Love"]}, {"page": "List of fictional Native Americans", "response": ["|A Ute drug lord and the rival of Trevor \"Viking\" Calcote (Tom Bateman). The 2019 remake of the 2014 Norwegian film In Order of Disappearance."]}, {"page": "List of American films of 2019", "response": ["| Cold Pursuit || Summit Entertainment / StudioCanal|| Hans Petter Moland (director); Frank Baldwin (screenplay); Liam Neeson, Tom Bateman, Tom Jackson, Emmy Rossum, Domenick Lombardozzi, Julia Jones, John Doman, Laura Dern || "]}, {"page": "List of American films of 2022", "response": ["| Death on the Nile || 20th Century Studios / Scott Free Productions / TSG Entertainment || Kenneth Branagh (director); Michael Green (screenplay); Kenneth Branagh, Tom Bateman, Annette Bening, Russell Brand, Ali Fazal, Dawn French, Gal Gadot, Armie Hammer, Rose Leslie, Emma Mackey, Sophie Okonedo, Jennifer Saunders, Letitia Wright || "]}, {"page": "Thirteen Lives", "response": ["*Tom Bateman as Chris Jewell"]}, {"page": "List of crime films of the 2020s", "response": ["| Death on the Nile || Kenneth Branagh || Kenneth Branagh, Tom Bateman, Annette Bening, Russell Brand, Ali Fazal, Dawn French, Gal Gadot, Armie Hammer, Rose Leslie, Emma Mackey, Sophie Okonedo, Jennifer Saunders, Letitia Wright || United States, United Kingdom || Mystery thriller"]}, {"page": "List of British films of 2022", "response": ["|| Director: Kenneth Branagh  Cast: Kenneth Branagh, Tom Bateman, Annette Bening, Russell Brand, Ali Fazal, Dawn French, Gal Gadot, Armie Hammer, Rose Leslie, Emma Mackey, Sophie Okonedo, Jennifer Saunders, Letitia Wright || 20th Century Studios"]}]}}