{"wiki_id": "http://www.wikidata.org/entity/Q11716745", "itemLabel": "James Clarke", "itemDescription": "British rower", "wikipedia_url": "https://en.wikipedia.org/wiki/James_Clarke_(rower)", "wikipedia_page": {"main": "James Clarke (born 31 December 1984) is a British lightweight rower. He learned to row at St Paul's School, London and went on to row for Durham University, under the tutelage of Wade Hall-Craggs. Clarke was a member of St Cuthbert's Society and graduated in 2006. He won a gold medal at the 2007 World Rowing Championships in Munich with the lightweight men's four.\nHe competed at the Beijing Olympics in 2008, coming 5th. \nFollowing the 2008 season he changed weight categories, switching to compete in the open weight category. He gained selection for the GB men's heavyweight squad, competing in the men's eight in 2009, finishing 5th and then in 2010 winning a silver medal at the Karapiro World Championships in New Zealand.", "link_mentions": [{"page": "List of Durham University people", "response": ["* James Clarke (Cuths)"]}, {"page": "London Rowing Club", "response": ["Two of its members, James Lindsay-Fynn and James Clarke, competed in the Beijing Olympic Games in 2008 as part of the Lightweight Men's Coxless Fours.  Nick Strange and Ben Helm competed in the Lightweight double sculls and Lightweight four at the Atlanta Olympic Games in 1996. The London lightweight four of 1994; Butt, Watson, Strange and Helm set a Worlds best time for Open and Lightweight fours of 05:48:86 (Paris, May '94)", "*James Clarke"]}, {"page": "Grand Challenge Cup", "response": ["|2009 || Leander & Molesey2009 Winners, The Grand Challenge Cup, Henley Royal Regatta, http://www.hrr.co.uk ||  Tom Broadway, James Clarke, James Orme, Peter Marsland, Tom Wilkinson, Tom Burton, Tom Solesbury, Tom Ransley, Phelan Hill (c)  || Princeton T.C  & California RC  ||½ l"]}, {"page": "Durham University Boat Club", "response": ["The first Durham rower to make the GB Olympic squad was Simon Hobbs (King's College, now Newcastle University) who was spare man in 1952. In recent years, Durham representation had included Wade Hall-Craggs, Roger Brown, Kim Thomas and Philippa Cross (1992); Roger Brown (M8+), Philippa Cross (W2-) and Suzie Ellis (W8+) (1996); Ian Lawson (M1x) and Tracy Langlands (LW2x) (2004); Steve Rowbotham (bronze; M2x), James Clarke (LM4- ) Alice Freeman (W8+) and Louisa Reeve (W8+ and W2-) (2008); and Sophie Hosking (gold; LW2x) and Louisa Reeve (W8+) (2012). Lily van den Broecke coxed the mixed 4+ to gold in the 2012 Paralympics."]}, {"page": "2007 World Rowing Championships", "response": ["|   Richard Chambers (b)James Lindsay-Fynn (2)Paul Mattick (3)James Clarke (s) || 6:16.21"]}, {"page": "James Clarke", "response": ["James Clarke may refer to:", "*James Clarke (composer) (born 1957), British composer", "*James Clarke (author) (born 1972), cinema author", "*James Clarke (Iowa politician) (1812–1850), American politician and Governor of Iowa Territory", "*James Clarke (died 1599), English MP for Leicester", "*James Clarke (died 1612), English MP for Mitchell", "*James Clarke (died 1621), English MP for Taunton", "*James Clarke (athlete) (1874–1929), Irish Olympic tug of war competitor", "*James Clarke (footballer, born 1913), English footballer for Bradford City and Rotherham United", "*James Clarke (footballer, born 1923), English footballer for Nottingham Forest", "*James Clarke (footballer, born 1982), English footballer for Rochdale and Grimsby Town", "*James Clarke (footballer, born 1989), English footballer for Newport County", "*James Clarke (footballer, born 2000), Irish footballer for Mansfield Town F.C.", "*James Clarke (cricketer) (born 1979), English cricketer", "*James Clarke (rower) (born 1984), British lightweight rower", "*James Clarke (antiquary) (1798–1861), English antiquary and amateur poet", "*James Clarke (VC) (1894–1947), English World War I soldier and recipient of the Victoria Cross", "*James Clarke Hook (1819–1907), English painter"]}, {"page": "Great Britain at the 2008 Summer Olympics", "response": ["|align=left|Richard Chambers James Clarke James Lindsay-Fynn Paul Mattick"]}, {"page": "2010 World Rowing Championships", "response": ["| Tom BroadwayJames ClarkeCameron NicholJames FoadMoe SbihiGreg SearleTom RansleyDaniel RitchiePhelan Hill|| 5:34.46"]}, {"page": "Richard Chambers (rower)", "response": ["In 2007 he rowed in the lightweight men's four, alongside James Clarke, Paul Mattick and James Lindsay-Fynn.  Together they won the 2007 Rowing World Cup Series, and went on to take the gold medal at the World Rowing Championships in Munich-Oberschleissheim.  The following year the same quartet represented Great Britain at the 2008 Beijing Olympic Games, where they finished in fifth place."]}, {"page": "2010 Rowing World Cup – World Cup 1", "response": ["|Nathaniel Reilly-O'DonnellJames ClarkeJames OrmeJames FoadMoe SbihiGreg SearlePete ReedDaniel RitchiePhelan Hill (cox)"]}]}}