{"wiki_id": "http://www.wikidata.org/entity/Q1173373", "itemLabel": "Dave Wakeling", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Dave_Wakeling", "wikipedia_page": {"main": "David Wakeling (born 19 February 1956) is an English singer, songwriter and musician, known for his work with the band the Beat (known in North America as the English Beat) and General Public.", "link_mentions": [{"page": "February 19", "response": ["*  1956   – Dave Wakeling, English singer-songwriter and guitarist"]}, {"page": "1956", "response": ["** Dave Wakeling, English musician"]}, {"page": "1991 in music", "response": ["| No Warning || Dave Wakeling || US"]}, {"page": "General Public", "response": ["General Public was an English band formed by vocalists Dave Wakeling and Ranking Roger of The Beat, and which also included former members of Dexys Midnight Runners, the Specials, and the Clash. They are best remembered for their hits \"Tenderness\" (1984) and \"I'll Take You There\" (1994).", "After the break-up of The Beat in 1983 (known as the English Beat in North America), vocalists Dave Wakeling and Ranking Roger decided to continue working together in a new venture.  They joined up with keyboardist Mickey Billingham (Dexys Midnight Runners), guitarist Mick Jones (the Clash), bassist Horace Panter (the Specials) and drummer Stoker (Dexys Midnight Runners/the Bureau) to form a supergroup of the UK punk and ska scene. They named the band General Public and were rapidly signed to Virgin Records in the UK and I.R.S. Records in North America.", "Since 2004, Dave Wakeling has toured the US with a full backing band as the English Beat. They often perform General Public tracks."]}, {"page": "The Specials", "response": ["Radiation fronted and worked with numerous artists including the Tearjerkers (a band that he had begun in the last months of the Specials), the Bonediggers, the Raiders and Three Men & Black (including Jean-Jacques Burnel of the Stranglers), Jake Burns (Stiff Little Fingers), Pauline Black, Bruce Foxton (the Jam), Dave Wakeling (the Beat, General Public) and Nick Welsh (Skaville UK). He also fronts the Skabilly Rebels, a band that mixes rockabilly with ska. He joined the 1990s Specials line-up and again in 2009, continuing to 2014."]}, {"page": "Roddy Radiation", "response": ["After The Specials 2, Byers worked with the acoustic project, Three Men & Black, which consisted of Jean Jacques Burnel (The Stranglers), Jake Burns (Stiff Little Fingers), Pauline Black (The Selecter), Bruce Foxton (The Jam) and Dave Wakeling (The Beat, General Public) and Nick Welsh (Skaville UK)."]}, {"page": "The Beat (British band)", "response": ["The Beat, consisting of Dave Wakeling (vocals, guitar), Ranking Roger (vocals), Andy Cox (guitar), David Steele (bass), Everett Morton (drums), and Saxa a.k.a. Lionel Augustus Martin (saxophone), released three studio albums in the early 1980s: I Just Can't Stop It (1980), Wha'ppen? (1981) and Special Beat Service (1982), and a string of singles, including \"Mirror in the Bathroom\", \"Save It for Later\", \"I Confess\", \"Too Nice to Talk To\", \"Can't Get Used to Losing You\", \"Hands Off...She's Mine\", and \"All Out to Get You\".", "After the break-up of the Beat in 1983, Dave Wakeling and Ranking Roger went on to form General Public and had a couple of hit singles in the US and Canada including \"Tenderness\", while Andy Cox and David Steele formed Fine Young Cannibals with vocalist Roland Gift from the ska band Akrylykz. Drummer Everett Morton and Saxa formed the International Beat along with the Birmingham-based singer, Tony Beet, and the band released an album titled The Hitting Line on Blue Beat Records in 1990 (BBSLP 009). The album was produced by Ranking Roger and he often guested with the band at some of their shows. The International Beat toured the UK and United States before calling it a day in 1992. Ranking Roger also briefly joined Mick Jones' post-Clash band Big Audio Dynamite and performed at several live shows with the band. However, the band broke up shortly after he joined when its last album was shelved by the record company. Meanwhile, \"March of the Swivelheads\", an instrumental version of the Beat's song \"Rotating Head\", was used in the climactic chase scene of 1986's Ferris Bueller's Day Off; the band was listed in the end credits as \"The (English) Beat\". \"Save It for Later\" was featured on the soundtrack album to 1996's Kingpin, 2010's Hot Tub Time Machine and 2017's Spider-Man: Homecoming.", "Dave Wakeling fronts the US version of the group as the English Beat, which usually adds a couple of General Public songs to the setlist. The singer and his band flew over to the UK in April 2011, to perform at the London International Ska Festival at the Clapham Grand music venue. They played the Dorset Steam Fair Show 2011 on 31 August 2011. At this point, both the UK and US versions of the band continued to tour frequently on either sides of the Atlantic.", "The English Beat recorded two new songs that feature prominently in the Scooby-Doo! Mystery Incorporated episode \"Dance of the Undead\" which aired 26 March 2013. It features a zombie ska group called Rude Boy and the Ska-Tastics who come back to life in order to turn people into zombies and make them dance to ska music forever. According to an interview Dave Wakeling conducted with the San Francisco Examiner, he said: \"This was my first opportunity to do anything for television as a gun for hire, and I actually managed to record and mix two songs in 12 hours. It was like running at double speed with no brakes, but it was exciting, and Warner Bros. really loved them. So the zombies have a song called ‘You’re Dead Right, Mate,’ and the Hex Girls have one called ‘We’re the Good Bad Girls,’ which has a definite Ramones-Runaways vibe to it, but frankly, I'm really happy I did it, because I’ve always loved ‘Scooby-Doo.\"", "In 2018 the Beat feat. Ranking Roger released The Beat - Live At The Roundhouse a live album with accompanying DVD, while The (English) Beat starring Dave Wakeling released an album called Here We Go Love!. This album was announced by Wakeling in 2014, with the project funded through the PledgeMusic website (which was a direct-to-fan music platform where fans could donate money to a group to complete an album project).", "* Dave Wakeling - lead vocals, guitar (1978-1983)", "===The English Beat starring Dave Wakeling===", "* Dave Wakeling - lead vocals, guitar", "* Songfacts interview with Dave Wakeling", "* 2009 Dave Wakeling interview at Bullz-Eye.com"]}, {"page": "List of ska musicians", "response": ["*Dave Wakeling"]}, {"page": "I Just Can't Stop It", "response": ["*Dave Wakeling – lead vocals, rhythm guitar"]}, {"page": "Horace Panter", "response": ["In his second year at Lanchester Polytechnic he met Jerry Dammers and together they formed The Specials. The band started playing in Coventry bars and clubs before releasing their first single, 'Gangsters' on their own record label (2-Tone). Following the break-up of The Specials in 1981, Panter went on to play with General Public with Dave Wakeling and Ranking Roger from the original Beat, and then with the reformed Specials in the 1990s. Panter then joined forces with Neol Davies of The Selecter to form a Blues band, Box of Blues. Today, he is a full-time member of the reformed Specials and is also in a blues combo, called 'Blues 2 Go'. He has also played with Malik & Pettite (formerly The Tones), and is in the process of getting together a ska orchestra called 'The Uptown Ska Collective' who will begin touring in 2014."]}, {"page": "Hazel O'Connor", "response": ["O'Connor married artist Kurt Bippert in 1987. The ceremony took place on Venice Beach, California. It received coverage by Hello! magazine. The actor David Rappaport was best man, and Dave Wakeling from The Beat gave O'Connor away. Bippert and O'Connor divorced in 2000."]}, {"page": "King Edward VI Camp Hill School for Boys", "response": ["* Dave Wakeling, singer and songwriter, founder of ska band The Beat"]}, {"page": "Bands Reunited", "response": ["|David Steele and Andy Cox were both unresponsive to numerous requests to participate, possibly implying a lack of interest in a reunion. The remaining members did not perform although Dave Wakeling did perform with the current version of the Beat at their own concert."]}, {"page": "Punch the Clock", "response": ["# \"Big Sister's Clothes/Stand Down, Margaret\" (BBC Session) (Costello, Roger Chalery, Andy Cox, Everett Morton, David Steele, Dave Wakeling) – 5:17"]}, {"page": "She's Having a Baby", "response": ["The She's Having a Baby soundtrack album was released in 1988 on I.R.S. Records label and produced by Dave Wakeling.", "In the video for Dave Wakeling's title tune, he performs alongside a female backup singer; behind them, a huge screen displays various clips from the movie. All of this is alternated with footage of Wakeling as he shops at a music store for guitars.", "# \"She's Having a Baby\" – Dave Wakeling"]}, {"page": "Andy Cox", "response": ["Andy Cox (born Andrew Cox, 25 January 1956)\"IMDb\"/ is a British guitarist born in Birmingham, who along with Dave Wakeling, founded The Beat in 1978."]}, {"page": "The Tears of a Clown", "response": ["*Dave Wakeling – lead vocals, rhythm guitar"]}, {"page": "List of guitarists", "response": ["*Dave Wakeling (The Beat, General Public)"]}, {"page": "Ranking Roger", "response": ["Roger became a punk rock fan as a teenager and was the drummer in the Dum Dum Boys before joining ska revival pioneers the Beat in the late 1970s. The Dum Dum Boys' first gig was with the Beat and his burgeoning friendship with them meant he began to gatecrash their gigs, take the mic, and start toasting. He had appeared on stage, toasting and singing with them, many times before officially joining the band. His energetic style and Jamaican-influenced vocals, paired with Dave Wakeling, were crucial in distinguishing the band from the other second-wave ska bands. The Beat released three albums: the critically acclaimed and seminal I Just Can't Stop It (1980), Wha'ppen? (1981) and Special Beat Service (1982)."]}, {"page": "All the Rage (General Public album)", "response": ["# \"Hot You're Cool\" (Mickey Billingham, Roger Charlery, Horace Panter, Dave Wakeling) – 3:47", "* Dave Wakeling — vocals, guitar"]}, {"page": "Open D tuning", "response": ["*Dave Wakeling of The Beat (known in North America as The English Beat) on the track \"Save It For Later\" from Special Beat Service as well as \"Click Click\" from the band's debut.Dave Wakeling tuning his guitar on 94.9 FM. Accessed 2010-04-15. "]}, {"page": "Keep Moving (Madness album)", "response": ["*General Public (Dave Wakeling and Ranking Roger) – backing vocals on \"Waltz Into Mischief\" and \"Victoria Gardens\" "]}, {"page": "David Steele (musician)", "response": ["From 1978 to 1983, Steele was bassist in the 2 Tone ska revival band the Beat, (known in the United States as the English Beat). After Ranking Roger and Dave Wakeling left the Beat to form General Public, Steele and guitarist Andy Cox recruited singer Roland Gift to form Fine Young Cannibals, whose career lasted into the early 1990s. In 1988, while FYC were on hiatus, Cox and Steele released the instrumental house music single, \"Tired of Getting Pushed Around\", under the name of Two Men, a Drum Machine and a Trumpet. It reached No. 18 on the UK Singles Chart. That same year, they also collaborated with Wee Papa Girl Rappers on the single \"Heat It Up\" which reached No. 21. "]}, {"page": "Special Beat Service", "response": ["* Dave Wakeling – Vocals, guitar"]}, {"page": "BBC Radio 1's Big Weekend", "response": ["| Noel Gallagher's High Flying Birds Simple Minds  Emeli Sandé  Squeeze  The Shires  Amy Macdonald  The Beat starring Dave Wakeling  Julie Fowlis"]}, {"page": "Jools' Annual Hootenanny", "response": ["* The Beat starring Dave Wakeling", "* \"Hands Off Shes Mine\" performed by The Beat featuring Dave Wakeling", "* \"Mirror in the Bathroom\" performed by The Beat featuring Dave Wakeling", "* \"Tears of a Clown\" performed by The Beat featuring Dave Wakeling", "* \"How Can You Stand There\" performed by The Beat featuring Dave Wakeling"]}, {"page": "Brian Klemm", "response": ["*Klemm also tours with Dave Wakeling's lineup of Two Tone band The Beat on their UK shows."]}, {"page": "Hands Off...She's Mine", "response": ["Dave Wakeling later said that some people took the meaning of the song completely wrong, saying that \"It was meant obviously to mean the opposite. Of course she’s not yours. Nobody is ever anybody else’s, are they? And some people got it, but some girls were really offended. They were like, \"I can’t believe you’d come up with something like that! 'Hands Off, She’s Mine'. What nonsense!\" I’m like, \"Yes. That’s the point. It’s nonsense.\"\""]}, {"page": "In the Studio", "response": ["* Dave Wakeling, Elvis Costello, Lynval Golding, Molly Jackson, Polly Jackson, Ranking Roger - backing vocals on \"Nelson Mandela\""]}, {"page": "Free Nelson Mandela", "response": ["In 1984, the students' union at Wadham College, Oxford, passed a motion to end every college \"bop\" (dance) with the song. The tradition continues to this day. A Nelson Mandela 70th Birthday Tribute remake, released in 1988, featured Elvis Costello, Dave Wakeling, Ranking Roger and Lynval Golding on backing vocals.", "* Afrodiziak (Caron Wheeler, Naomi Thompson, Claudia Fontaine), Molly Jackson, Polly Jackson, Lynval Golding, Elvis Costello, Ranking Roger, Dave Wakeling – Backing Vocals"]}, {"page": "Starvation/Tam Tam Pour L'Ethiopie", "response": ["*Additional vocals: Dave Wakeling"]}, {"page": "1956 in the United Kingdom", "response": ["* 19 February – Dave Wakeling, rock singer-songwriter"]}, {"page": "List of musicians who play left-handed", "response": ["*Dave Wakeling (The English Beat, General Public) (right-handed, but learned to play left-handed)"]}, {"page": "WLIR", "response": ["After five years of production, the documentary entitled Dare to Be Different - WLIR: The Voice of a Generation by Ellen Goldfarb debuted at the Tribeca Film Festival in April 2017. It details WLIR's history, program director Denis McNamara and team’s August 1982 format change, the influence the station had and its battles with the FCC. The station's staff, musical firsts and fans are documented. After the premiere, A Flock of Seagulls, the Beat's Dave Wakeling and the Alarm played live sets."]}, {"page": "Live at the Gorge 05/06", "response": ["#\"Better Man\" / \"Save It for Later\" (Vedder / Roger Charlery, Andrew Cox, Everett Morton, David Steele, Dave Wakeling) – 7:35"]}, {"page": "List of Rickenbacker players", "response": ["* Dave Wakeling of The English Beat"]}]}}