{"wiki_id": "http://www.wikidata.org/entity/Q1175607", "itemLabel": "David McKee", "itemDescription": "British children's illustrator", "wikipedia_url": "https://en.wikipedia.org/wiki/David_McKee", "wikipedia_page": {"main": "David John McKee (born 2 January 1935) is a British writer and illustrator, chiefly of children's books and animations.\nFor his contribution as a children's illustrator, he was UK nominee for the biennial, international Hans Christian Andersen Award in 2006.", "link_mentions": [{"page": "Elephant", "response": ["Elephants are ubiquitous in Western popular culture as emblems of the exotic, especially since – as with the giraffe, hippopotamus and rhinoceros – there are no similar animals familiar to Western audiences. The use of the elephant as a symbol of the U.S. Republican Party began with an 1874 cartoon by Thomas Nast. As characters, elephants are most common in children's stories, in which they are generally cast as models of exemplary behaviour. They are typically surrogates for humans with ideal human values. Many stories tell of isolated young elephants returning to a close-knit community, such as \"The Elephant's Child\" from Rudyard Kipling's Just So Stories, Disney's Dumbo, and Kathryn and Byron Jackson's The Saggy Baggy Elephant. Other elephant heroes given human qualities include Jean de Brunhoff's Babar, David McKee's Elmer, and Dr. Seuss's Horton."]}, {"page": "Plymouth", "response": ["Antarctic explorers Robert Falcon Scott who was born in Plymouth and Frank Bickerton both lived in the city. Artists include Beryl Cook whose paintings depict the culture of Plymouth and Robert Lenkiewicz, whose paintings investigated themes of vagrancy, sexual behaviour and suicide, lived in the city from the 1960s until his death in 2002. Illustrator and creator of children's series Mr Benn and King Rollo, David McKee, was born and brought up in South Devon and trained at Plymouth College of Art. Jazz musician John Surman, born in nearby Tavistock, has close connections to the area, evidenced by his 2012 album Saltash Bells. The avant garde prepared guitarist Keith Rowe was born in the city before establishing the jazz free improvisation band AMM in London in 1965 and MIMEO in 1997. The musician and film director Cosmo Jarvis has lived in several towns in South Devon and has filmed videos in and around Plymouth. In addition, actors Sir Donald Sinden and Judi Trott were born in Plymouth. George Passmore of Turner Prize winning duo Gilbert and George was also born in the city, as was Labour politician Michael Foot whose family reside at nearby Trematon Castle."]}, {"page": "List of children's literature writers", "response": ["*David McKee (born 1935) – Toucan Two Can"]}, {"page": "Putney", "response": ["*David McKee, creator of Mr Benn, lived at 54 Festing Road (\"at 52 Festive Road\"), subsequently re-broadcast. Outside engraved paving slab"]}, {"page": "Picture book", "response": ["Japanese author and illustrator Mitsumasa Anno has published a number of picture books, beginning in 1968 with Mysterious Pictures. In his \"Journey\" books a tiny character travels through depictions of the culture of various countries. Everyone Poops was first published in Japan in 1977, written and illustrated by the prolific children's author Tarō Gomi. It has been translated into several languages. Australian author Margaret Wild has written more than 40 books since 1984 and won several awards. In 1987 the first book was published in the Where's Wally? (known as Where's Waldo? in the United States and Canada) series by the British illustrator Martin Handford. The books were translated into many languages and the franchise also spawned a TV series, a comic strip and a series of video games. Since 1989 over 20 books have been created in the Elmer the Patchwork Elephant series by the British author David McKee. They have been translated in 40 languages and adapted into a children's TV series."]}, {"page": "1989 in literature", "response": ["*David McKee – Elmer"]}, {"page": "1935 in literature", "response": ["*January 2 – David McKee, English children's writer and illustrator"]}, {"page": "1968 in literature", "response": ["*David McKee – Elmer the Patchwork Elephant"]}, {"page": "King Rollo", "response": ["King Rollo is a children's character, created by David McKee in 1980. He is the main character in a series of books, animations narrated by Ray Brooks, and a comic strip in the magazine Buttons. Thirteen episodes of the animation were produced in 1980 by McKee's own King Rollo Films, and were originally shown as part of the pre-school 'See-Saw' strand."]}, {"page": "Mr Benn", "response": ["Mr Benn is a character created by David McKee who appears in several children's books, and an animated television series of the same name originally transmitted by the BBC in 1971 and 1972. The first episode was the Red Knight.", "David McKee got the inspiration for Mr Benn from Festing Road in Putney where he used to live. The image of Mr Benn himself was based on the artwork \"The Businessman\" by Micaela Mitchell. McKee had the house \"next door\" at 54 Festing Road, where residents installed an engraved paving slab in his honour on 26 November 2009. (\"I think it was because in the first book I drew myself looking out of the window, and I thought it would be quite nice to have him next door\", said McKee.)", "A Mr Benn Annual  () was published by Polystyle Publications Ltd in 1972. It was written by Jan Falconer and illustrated by David McKee. This contained a number of illustrated text stories, three strip-cartoon style adventures and a few puzzle pages. Mr Benn visits: China for a kite festival, a fairytale Arabia, Venice and Holland. He also becomes a barrow boy in a pearly suit and meets Mr Grubbly and his animal friends in the African jungle.", "In 1999, it was reported that a feature film was in development and that director Jevon O'Neill's production company, Erinfilm, had purchased the film rights to Mr Benn from David McKee. The film was to star John Hannah as Mr. Benn and Ben Kingsley as the Shopkeeper. However, the film was cancelled in 2001 and, as of 2017, the project remains dormant. In an interview with the BBC in May 2014, McKee stated that, on a film version: \"I'd like to see that [the film] happen, because Mr Benn's a big boy and he can live his own life. I think he's right for being developed on the big screen\".", "Simon Sheridan's book The A to Z of Classic Children's Television (Reynolds & Hearn books, 2004, reprinted 2007)  contains a chapter on Mr. Benn and an interview with creator David McKee."]}, {"page": "Cutout animation", "response": ["*David McKee's King Rollo (1980)"]}, {"page": "ApologetiX", "response": ["ApologetiX has had multiple other drummers as well, including: their longtime fill-in drummer, Keith Harrold (who played on Isn't Wasn't Ain't and Keep the Change); David McKee (who played on Jesus Christ Morningstar as well as two concerts in 1998); and Jon \"Bermuda\" Schwartz (the drummer for \"Weird Al\" Yankovic), who played on seven tracks on Biblical Graffiti. Ron Zanski (two shows in 1993) and Allen Muckle (three shows in 2001) have also played with the band.", "*David McKee - Drums (2001)"]}, {"page": "McKee", "response": ["* David McKee (born 1935), British writer and illustrator"]}, {"page": "Fuller Building", "response": ["In the years after its opening, many galleries were opened on the storefronts in the lowest six floors. The Fuller Building became \"one of Manhattan's most prestigious gallery addresses\", as The New York Times described it. The gallery tenants over the years have included the Nailya Alexander Gallery, Andrew Crispo, the Charles Egan Gallery, André Emmerich, Hammer Galleries, Marlborough-Gerson, Pierre Matisse, the Katharina Rich Perlow Gallery, and the Zabriskie Gallery. Other gallery occupants have included the Kent Fine Art Gallery, Jan Krugier, David McKee, Robert Miller, the Tibor de Nagy Gallery, and Joan Washburn."]}, {"page": "Plymouth College of Art", "response": ["Honorary fellowships have since been offered to artist David McKee, Toby Gorniak MBE, Peter Jenkinson OBE, Sir John Sorrell CBE and Lady Frances Sorrell OBE, and Sir Nicholas Serota and Richard Deacon CBE, among others.  "]}, {"page": "Ray Brooks (actor)", "response": ["Brooks was also the narrator of the well known children's animations by David McKee: Mr Benn and King Rollo.  From 1980 to 1985, he played Detective Sergeant Dave Brook on BBC Radio 4 (later on BBC Radio 2) in four series of Detective written by Robert Barr, and subsequently repeated on BBC Radio 4 Extra from 2013. Brooks starred in the Edward Boyd thriller, Castles in Spain, on BBC Radio 4 in 1987."]}, {"page": "1935 in art", "response": ["* 2 January – David McKee, English author and illustrator"]}, {"page": "Step Inside", "response": ["#Isabel's Noisy Tummy: David McKee", "#Not Now, Bernard: David McKee"]}, {"page": "Elmer the Patchwork Elephant", "response": ["Elmer the Patchwork Elephant (often shortened to Elmer) is a children's picture book series by the British author David McKee.", "Elmer the Patchwork Elephant also features in a wide range of merchandising. His first story is also featured and animated in Anytime Tales, a storytelling animated programme narrating five of David McKee and Tony Ross' stories. The story of Elmer was originally narrated by British voice actor Johnny Morris, who died on 6 May 1999, aged 82. Sophie Aldred also read his first story which was also animated by Mike Hibbert in an episode of Words and Pictures from 1993, featuring the letter E."]}, {"page": "David McKee (ice hockey)", "response": ["David McKee (born December 5, 1983) is a professional hockey goaltender. He most recently played with the Quad City Mallards of the Central Hockey League during the 2011–12 season. McKee was formerly a star college goaltender at Cornell University.", "David McKee started for three years at Cornell University. During his record-breaking college career, he had a career record of 65–24–13 with a .926 SV%, 1.71 GAA and 18 shutouts. During the 2003–04 season, he had a shutout streak of 159:27 from December 5 to December 28. Even though his rookie year was astounding, nothing could compare to the end of the 2004–05 season, where over his final 21 games, he allowed just 20 goals while posting a 0.93 goals against average and a .962 save percentage to go along with an 18–2–1 record to help lead his team to win the ECAC title. He led the Cornell Big Red to a season record 19-game unbeaten streak. During that season, McKee also recorded a record-breaking 10 shutouts.", "On April 1, 2006, the Mighty Ducks of Anaheim announced that they signed him with a two-year entry-level contract. Mighty Ducks executive vice president and general manager Brian Burke said, \"Over the past two seasons, David McKee has proven to be one of the premier players at the collegiate level. He is a great addition to the core of young talented players within our organization.”", "**David McKee. Retrieved 26 Nov 2006.", "**(28 Dec 2006). David McKee Recalled from Augusta. Press release.", "*Cornell Big Red . David McKee. Retrieved 26 Nov 2006."]}, {"page": "Deutscher Jugendliteraturpreis", "response": ["* Picture book: Du hast angefangen! Nein, du! (Two Monsters) by David McKee, "]}, {"page": "David Mckee", "response": ["#REDIRECT David McKee "]}, {"page": "Satoshi Kitamura", "response": ["In 2009 he left London and returned to Japan to care for his parents, but continues to travel and work for publishers across the globe. Apart from writing and illustrating children's books, Satoshi has been commissioned for various projects including Tokyo Underground posters, signage at Birmingham Children's Hospital and designing stationery. He also translates David McKee's Elmer the Patchwork Elephant series for the Japanese market."]}, {"page": "Ediciones Ekare", "response": ["It has published works by , Ana Maria Machado, Aquiles Nazoa, Teresa Duran, Javier Saez Castán, Marta Carrasco, Antonio Skarmeta, Alexis Deacon, Satoshi Kitamura, Ron Brooks, Margaret Wild, Helen Oxenbury, Tomi Ungerer, Arnold Lobel, Leo Lionni, Ed Young, Max Velthuijs, Eugenio Montejo, David McKee, Arnal Ballester, Emilio Urberuaga, Rocío Martínez, Fernando Krahn, Marua de la Luz Uribe, Irene Savino, Kurusa, Alba Marina Rivera, among others."]}, {"page": "Violet Easton", "response": ["#REDIRECTDavid McKee"]}, {"page": "Booktrust Early Years Award", "response": ["***David McKee, Elmer’s First Counting Book (Andersen Press)"]}, {"page": "Andersen Press", "response": ["Andersen Press specialises in picture books and children’s fiction, and the authors it publishes include Melvin Burgess, Max Velthuijs, Ralph Steadman, Quentin Blake, Jeanne Willis and Emma Chichester Clark. Perhaps the most well-known character on the list is Elmer the Patchwork Elephant, created by David McKee."]}, {"page": "Songs for Sorrow", "response": ["|David McKee||\"Toy Boy\"||20 — 21", "|David McKee||\"Lonely Alcoholic\"||38 — 39"]}, {"page": "King Rollo Films", "response": ["King Rollo Films Ltd, known as King Rollo Films, is an animation production company established in 1978 by David McKee. For over 30 years, the company has been producing cartoons for children's television. Their studios are based in Honiton, England."]}, {"page": "List of World Book Day books", "response": ["*Elmer's Parade by David McKee (Andersen Press)"]}, {"page": "1980 in animation", "response": ["* October 1: The animated TV series King Rollo, based on David McKee's children's novels, is first broadcast."]}, {"page": "List of fictional pachyderms", "response": ["|David McKee"]}]}}