{"wiki_id": "http://www.wikidata.org/entity/Q1173565", "itemLabel": "David Ambrose", "itemDescription": "English novelist and screenwriter", "wikipedia_url": "https://en.wikipedia.org/wiki/David_Ambrose", "wikipedia_page": {"main": "David Edwin Ambrose (born 21 February 1943) is a British novelist, playwright and screenwriter. His credits include at least twenty films, four stage plays, and many hours of television, including the controversial Alternative 3 (1977). He was born in Chorley, Lancashire, and educated at Blackburn Grammar School and Merton College, Oxford. He was married to the Swiss-born artist Laurence Ambrose from 1979 until her death in 2019.", "link_mentions": [{"page": "Stanley Holloway", "response": ["In 1970, Holloway began an association with the Shaw Festival in Canada, playing Burgess in Candida. He made what he considered his West End debut as a straight actor in Siege by David Ambrose at the Cambridge Theatre in 1972, co-starring with Alastair Sim and Michael Bryant. He returned to Shaw and Canada, playing the central character Walter/William in You Never Can Tell in 1973."]}, {"page": "1991 in film", "response": ["| Year of the Gun || Triumph Films || John Frankenheimer (director); David Ambrose (screenplay); Andrew McCarthy, Sharon Stone, Valeria Golino, John Pankow, George Murcell, Mattia Sbragia, Roberto Posse, Thomas Elliot, Lou Castel || Thriller || Live action "]}, {"page": "1985 in film", "response": ["| D.A.R.Y.L. || Paramount Pictures || Simon Wincer (director); David Ambrose, Allan Scott, Jeffrey Ellis (screenplay); Barret Oliver, Mary Beth Hurt, Michael McKean, Danny Corkill, Josef Sommer, David Wohl, Colleen Camp, Steve Ryan, Amy Linker, Kathryn Walker, Hardy Rawls, Jim Fitzpatrick || Sci-Fi || Live action"]}, {"page": "1983 in film", "response": ["| Amityville 3-D || Orion Pictures || Richard Fleischer (director); David Ambrose (screenplay); Tony Roberts, Tess Harper, Robert Joy, Candy Clark, Lori Loughlin, Meg Ryan, Neill Barry, Josefina Echánove || Horror || Live action"]}, {"page": "1980 in film", "response": ["| The Final Countdown || United Artists / The Bryna Company || Don Taylor (director); David Ambrose, Gerry Davis, Thomas Hunter, Peter Powell (screenplay); Kirk Douglas, Martin Sheen, Katharine Ross, James Farentino, Ron O'Neal, Charles Durning, Victor Mohica, James C. Lawrence, Soon-Tek Oh, Joe Lowry, Alvin Ing, Mark Thomas, Harold Bergman, Richard Liberty, Lloyd Kaufman, Dan Fitzgerald, Peter Douglas || Sci-Fi, War || Live action"]}, {"page": "1979 in film", "response": ["| The Fifth Musketeer || Columbia Pictures || Ken Annakin (director); David Ambrose, George Bruce (screenplay); Beau Bridges, Sylvia Kristel, Ursula Andress, Cornel Wilde, Ian McShane, Lloyd Bridges, José Ferrer, Alan Hale Jr., Olivia de Havilland, Rex Harrison, Helmut Dantine, Patrick Pinney || Adventure || Live Action "]}, {"page": "Alternative 3", "response": ["The programme was presented as an edition of an Anglia TV series called Science Report.Director returns to relive TV hoax that shocked the world - Press Release - UEA The intended transmission date was 1 April, but it seems that Anglia was unable to obtain an ITV network slot for the programme on that date due to strike action/labour disputes. The script was written by Chris Miles and David Ambrose.  Music was supplied by Brian Eno, a portion of his score being released on the album Music for Films (1978). Apart from the presenter Tim Brinton, all the characters in the programme were played by actors who were explicitly credited at the end.", "The film was released on DVD in October 2007, together with a 30-minute featurette with presenter Tim Brinton and writers David Ambrose and Christopher Miles who also directed Alternative 3; a production stills gallery; and contemporary press cuttings presented in the form of slowly scrolling rostrum camera shots."]}, {"page": "D.A.R.Y.L.", "response": ["D.A.R.Y.L. is a 1985 science fiction film written by David Ambrose, Allan Scott, and Jeffrey Ellis. It was directed by Simon Wincer and stars Barret Oliver, Mary Beth Hurt, Michael McKean, Danny Corkill, and Josef Sommer. D.A.R.Y.L. was released in the United States on June 14, 1985 and released in Singapore on May 5, 1986. The original music score was composed by Marvin Hamlisch."]}, {"page": "Gerry Davis (screenwriter)", "response": ["*Feature film (co-written with Thomas Hunter, Peter Powell and David Ambrose, 1980)"]}, {"page": "Tim Brinton", "response": ["Brinton was the presenter and narrator of the mockumentary Alternative 3, and lent it the gravitas it needed to be a successful hoax. The programme had been due to be broadcast on April Fools' Day, 1977, but industrial action meant that it was broadcast in June. Sometimes cited as a British parallel to Orson Welles's radio production of The War of the Worlds, Alternative 3 purported to be an investigation into Britain's contemporary \"brain drain\". Alternative 3 was supposedly a plan to relocate a cross section of Earth's scientific and philosophical population to Mars in the event of climate change or some other planetary catastrophe. When the DVD was released in October, 2007, it had a 30-minute featurette in the extras, featuring an interview with Brinton, as well as his fellow \"conspirators\", David Ambrose and Christopher Miles who also directed Alternative 3, alongside a production stills gallery and contemporary press cuttings."]}, {"page": "Amityville 3-D", "response": ["Amityville 3-D (also known as Amityville III: The Demon) is a 1983 American supernatural horror film directed by Richard Fleischer and starring Tony Roberts, Tess Harper, Robert Joy, and Candy Clark. It is the third film based in the Amityville Horror series, it was written by David Ambrose, under the pseudonym William Wales. It was one of a spate of 3-D films released in the early 1980s, and was the only Orion Pictures film filmed in the format."]}, {"page": "The Survivor (1981 film)", "response": ["|David Ambrose"]}, {"page": "The Fifth Musketeer", "response": ["Kevin Thomas of the Los Angeles Times wrote, \"There are some nice moments along the way from a largely nostalgic cast and some reasonably sumptuous settings, with the Schoenbrunn Palace standing in for Versailles. However, since Ken Annakin's direction and David Ambrose's script are uninspired, 'The Fifth Musketeer' tends to be plodding.\""]}, {"page": "Year of the Gun (film)", "response": ["Giacomo Pezzali purchased the rights to Michael Mewshaw's novel Year of the Gun in 1983 and hired Carlo Lizzani to direct. However, the next year Edward R. Pressman optioned the novel and hired screenwriter Barrie Keeffe and director Jean-Jacques Beineix in what was to be Beineix's English-language debut. He formed a partnership with Eric Fellner to produce the film at the 1988 Cannes Film Festival. Keeffe and Beineix were replaced with David Ambrose and John Frankenheimer in 1990. ", "The film received mixed reviews. New York Times film critic Janet Maslin, criticized the transition from book to film by saying, \"But the plot, from a screenplay by David Ambrose based on Michael Mewshaw's book, turns out to be dizzyingly overcomplicated, and far too much of it hinges on the American journalist's supposed power to make trouble with his novel, which he says will be a \"Day of the Jackal\"-like mixture of real and fictitious characters. It is this journalist's advance knowledge of the plot to kidnap Aldo Moro, a former Italian Prime Minister, that makes so many waves.\""]}, {"page": "Allan Scott (Scottish screenwriter)", "response": ["He is currently preparing a production of The Conjuror (co-written with David Ambrose), to be directed by Des McAnuff, as well as The Garden of the Black Martini (co-written with Allison Burnett), and two new musicals."]}, {"page": "Christopher Miles", "response": ["David Ambrose the writer, decided with Miles to re-work the plot of a script he had with Anglia Television as if it was a documentary. Alternative 3 (1977) caused a scandal with its supposed landings on Mars and prescient climate-change forebodings and was banned in the USA. Anglia’s chairman Sir John Woolf, after the success of the film’s worldwide sales, offered Miles the first of the Tales of the Unexpected, then introduced by Roald Dahl. In \"Neck\" (1978) Sir John Gielgud was cast as a butler for the first time.", "Alternative 3 - based on the TV film by David Ambrose & Christopher Miles written by Leslie Watkins"]}, {"page": "Dawn-Michelle Baude", "response": ["In the 1990s, she lived in Egypt, Lebanon and France. She gave birth to her son, Alexandre, in 1996—the same year she received her Diplôme d'études approfondies from the Sorbonne. She joined the faculty of Bard College's Lacoste School of the Arts program in southern France, during which time she met poet Gustaf Sobin, artist Curt Asker, composer Anders Hillborg, writer David Ambrose, filmmaker Peter Montagnon and other habitués of the Provence region."]}, {"page": "Kampf um Rom", "response": ["The novel was adapted for the screen by David Ambrose, but the screenplay was written by Ladislas Fodor. Director Robert Siodmak was not comfortable with the project. In late 1967, he wrote a letter to Brauner in which he noted that after having read all the scripts he felt that the dialogue was \"too simple (to put it mildly) almost throughout and barely up to the standard of ten-year-old children. The characters are not consistent, they have numerous breaks and even the heroes are becoming uninteresting and unlikeable towards the end of the movie. [...] At the end of part 2 the historical facts have been changed so violently that we have to voice serious concerns. The doom of the Ostrogoths is not just a great drama of world literature but also a huge historical drama. [...] Treason and exposure, guilt and atonement are constructed so primitively that they cause deadly boredom [...]\""]}, {"page": "Michel Altieri", "response": ["* Spiral, by John Buffalo Mailer, directed by David Ambrose (2011)"]}, {"page": "Blackout (1985 film)", "response": ["Blackout is a 1985 American made-for-television psychological thriller film directed by Douglas Hickox, and written by Richard Smith, Richard Parks, Les Alexander, and David Ambrose."]}, {"page": "Stanley Holloway on stage and screen", "response": ["| The show had a three-month run with Alastair Sim, David Ambrose and Michael Bryant."]}, {"page": "Frederick Bradnum", "response": ["A radio producer of drama from 1950 to 1961, he also directed 12 Bernard Shaw plays for the Third Programme and numerous plays by Henrik Ibsen. He played a major role, along with Donald McWhinnie and Desmond Briscoe, in establishing the BBC Radiophonic Workshop and wrote Private Dreams And Public Nightmares (1957) for it, which was the first radiophonic poem, featuring the voices of young actors Frederick Treves, Joan Sanderson and Andrew Sachs. This was considered an \"early example of the experiments blending sounds and voices\". In the 1960s, he produced a number of plays for the BBC's anthology drama series Thirty-Minute Theatre, including several Sherlock Holmes works. He continued to work as a part-time script adviser until 1986. Several of his plays, such as In at the Kill and Minerva Alone, were adapted for theatre and performed by the Hampstead Theatre Club onstage in the early 1960s. In at the Kill, a one-act play, is described as a \"macabre little piece\" by Theatre World. Another radio play, Goose With Pepper (1972), similarly was dramatised for the theatre by David Ambrose in August 1975. From the early 1970s to the mid-1990s, he produced mainly for Radio 4. His last play, The Terraced House, was written for Radio 4 in 1994. In 2003, BBC Radio 7 rebroadcast his 25-part BBC Radio 4 adaptation of Anthony Powell's A Dance to the Music of Time, which originally ran during the years 1979–82."]}, {"page": "Goose With Pepper", "response": ["Goose With Pepper is a radio drama by Frederick Bradnum. The play was originally written for BBC Radio 4, airing on 17 September 1972. The BBC said of it \"Mr Bradnum's new play has that astonishing ease and easy depth that come with maturity; technique is undetectable; humanity, occasionally in the past veiled by self-consciousness, shines through, clear and warm.\" In August 1975 the play was dramatised for the theatre by David Ambrose."]}, {"page": "Bryna Productions", "response": ["The Final Countdown went through a team of writers, including Thomas Hunter, Peter Powell, David Ambrose and Gerry Davis and was turned down by every major Hollywood film studio. In early May 1979, The Bryna Company announced that it had secured a $7,000,000 financing deal for The Final Countdown with Arthur Guinness Son and Company Limited's film-financing subsidiary, Film Finance Group. The picture was to be co-produced by Film Finance Group's president, Richard Rogers St. Johns, through its film production division, Aspen Productions. Filming began, using Panavision cameras and Technicolor film with Dolby Stereophonic sound, on May 23, 1979, on location aboard the U.S.S. Nimitz in Norfolk, Virginia, followed by Miami, Florida and Pearl Harbor, Hawaii. The film co-starred Kirk Douglas, Martin Sheen, James Farentino and Katharine Ross and was directed by Don Taylor."]}, {"page": "Ambrose (surname)", "response": ["*David Ambrose, British novelist and screenwriter"]}, {"page": "List of Australian High Commissioners to Vanuatu", "response": ["||David Ambrose||1990||1992||"]}, {"page": "Mother of God (disambiguation)", "response": ["*Mother of God, a novel by David Ambrose 1995"]}, {"page": "List of people named David", "response": ["*David Ambrose (born 1943), British novelist"]}, {"page": "Ambrose, David", "response": ["#redirectDavid Ambrose"]}, {"page": "Nancy H. Kleinbaum", "response": ["* D.A.R.Y.L. (1985, based on a script by David Ambrose, Allan Scott and Jeffrey Ellis)"]}]}}