{"wiki_id": "http://www.wikidata.org/entity/Q11704108", "itemLabel": "Stuart David", "itemDescription": "Scottish musician, songwriter and novelist", "wikipedia_url": "https://en.wikipedia.org/wiki/Stuart_David", "wikipedia_page": {"main": "Stuart David is a Scottish musician, songwriter and novelist, famed for originating two distinct musical genres: Folk Hop and Horror Pop (later termed Noir'n'B or Switchblade Pop). He co-founded the band Belle and Sebastian and was a member from 1996–2000, and then went on to front Looper (1998–present).  He has published five novels – Nalda Said (IMP, 1999), The Peacock Manifesto (IMP, 2001), Peacock's Tale (Barcelona Review, 2011), Jackdaw & the Randoms (Hotkey, 2015) and Peacock's Alibi (Polygon, 2018) – and one volume of memoir, In The All-Night Cafe (Little, Brown, 2015), chronicling the formation of Belle and Sebastian.", "link_mentions": [{"page": "Belle and Sebastian", "response": ["Belle and Sebastian were formed in Glasgow, Scotland in 1994 by Stuart Murdoch and Stuart David, both of whom had enrolled at Stow College's Beatbox programme for unemployed musicians. Together, with music professor Alan Rankine (formerly of The Associates), they recorded some demos, which were picked up by the college's Music Business course that produces and releases one single each year on the college's label, Electric Honey. As the band had a number of songs already and the label was extremely impressed with the demos, Belle and Sebastian were allowed to record a full-length album, which was recorded mostly live over three days, entitled Tigermilk. Murdoch once described the band as a \"product of botched capitalism\". The band took their name from a short story Murdoch had written inspired by the television adaptation of the French novel Belle et Sébastien about a six-year-old boy and his dog.", "Stuart David soon left the band to concentrate on his side project, Looper, and his book writing, which included his The Idle Thoughts of a Daydreamer. He was replaced by Bobby Kildea of V-Twin. The \"Jonathan David\" single, sung by Stevie Jackson, was released in June 2001 and was followed by \"I'm Waking Up to Us\" in November, which saw the band use an outside producer (Mike Hurst) for the first time. Most of 2002 was spent touring and recording a soundtrack album, Storytelling (for Storytelling by Todd Solondz). Campbell left the band in the spring of 2002, in the middle of the band's North American tour to pursue a solo career, first as The Gentle Waves, and later under her own name. She later collaborated with singer Mark Lanegan on three albums.", "*Looper (band) is an electronic music group fronted by Stuart David.", "* Stuart David – bass (1996–2000)"]}, {"page": "Jeepster Records", "response": ["The label's strong relationship with Belle & Sebastian enabled them in 1999 to sign Stuart David's side-project Looper, and Isobel Campbell's solo project The Gentle Waves, releasing albums for each that same year, along with a string of EPs and singles for their entire roster. The label enjoyed further good publicity when Belle & Sebastian won Best Newcomer in the 1999 Brit Awards. Later that year, Jeepster reissued Belle & Sebastian's debut album Tigermilk, which had previously been available only on limited issue vinyl."]}, {"page": "Tigermilk", "response": ["* Stuart David – bass"]}, {"page": "If You're Feeling Sinister", "response": ["*Stuart David – bass"]}, {"page": "Fold Your Hands Child, You Walk Like a Peasant", "response": ["The band introduced many stylistic changes on this album, such as an organic strings section and more songs with lead vocals by other members of the band; Sarah Martin sings on \"Waiting for the Moon to Rise\", Isobel Campbell sings on \"Family Tree\", and performs duets with Stevie Jackson on \"Beyond the Sunrise\" and Stuart Murdoch on \"Women's Realm\". Jackson also sings lead vocal on \"The Wrong Girl\". It is the last Belle & Sebastian album to feature bass player Stuart David, who departed the band after the album's completion."]}, {"page": "List of bass guitarists", "response": ["* Stuart David (Belle and Sebastian, Looper)"]}, {"page": "The Boy with the Arab Strap", "response": ["Stuart Murdoch recalled the recording process for this album felt very different from the previous two. The group spent several months working on it versus the previous albums which were recorded in just a number of days. The music itself was somewhat more experimental as well as more collaborative with some tracks written by Stevie Jackson and Isobel Campbell and more members of the group contributing vocals. Stevie Jackson sings lead on both \"Seymour Stein\" and \"Chickfactor\", Stuart David gives a spoken word performance on \"A Space Boy Dream\", whilst Isobel Campbell sings lead on \"Is It Wicked Not to Care?\" and duets with Murdoch on \"Sleep the Clock Around\".", "* Stuart David – bass, spoken word (\"A Space Boy Dream\")"]}, {"page": "Dog on Wheels", "response": ["Dog on Wheels is the debut EP by Belle & Sebastian, released in 1997 on Jeepster Records. The four recordings on the EP actually pre-date the band's début album Tigermilk, produced whilst bandmembers Stuart Murdoch and Stuart David were on the Beatbox music course at Stow College, Glasgow. Murdoch, David and Mick Cooke are the only long-term members to play on the songs, though Cooke only appears on the title track. The drums were supplied by David Campbell, whilst Brian Nugent played flute on \"String Bean Jean\", and Gerry Campbell, a tutor at Beatbox, provided keyboards on \"The State I Am In\" and \"Belle & Sebastian\" as well as lead guitar on \"String Bean Jean\". Other contributors to the E.P. include Mark McWhirter, Michael Angus and David Mackenzie, though their roles have not been confirmed."]}, {"page": "Lazy Line Painter Jane", "response": ["Lazy Line Painter Jane was Belle & Sebastian's second EP, released in 1997 on Jeepster Records. The title track features guest vocalist Monica Queen and was recorded in a church hall. \"A Century of Elvis\" features bassist Stuart David reading out a story he had written, over music by the band. The backing music from that track was later used on \"A Century of Fakers\" from 3.. 6.. 9 Seconds of Light. The front cover features Thea Martin holding Reason and Reality: The Relationship Between Science and Theology by John Polkinghorne. The EP was later re-packaged as part of the Lazy Line Painter Jane box-set, and all four tracks were collected on the Push Barman to Open Old Wounds compilation. The EP narrowly missed out on a top 40 placing in the UK singles chart, reaching #41."]}, {"page": "Legal Man", "response": ["\"Legal Man\" is the debut single of Scottish indie pop band Belle and Sebastian. The track features Isobel Campbell, Sarah Martin, and Rozanne Suarez (credited as the Maisonettes) on vocals and Snow Patrol drummer Jonny Quinn on congas. The cover artwork—designed by Andrew Symington—features band members Stevie Jackson and Campbell along with Adrienne Payne and Suarez. Two B-sides were released with the single: \"Judy Is a Dick Slap\", an instrumental, and \"Winter Wooskie\", which was the last time bass player Stuart David sang lead vocals before departing the band in 2000.", "The two B-side tracks are notable for their historical significance; \"Judy Is a Dick Slap\" is the first instrumental released by the band while \"Winter Wooskie\" is the third and final song featuring lead vocals from former bass player Stuart David, who left the band in 2000. All three tracks from the single were later collected on the Push Barman to Open Old Wounds compilation."]}, {"page": "Isobel Campbell", "response": ["Belle & Sebastian was formed in 1996 by Stuart Murdoch and Stuart David; Campbell had met Murdoch at a New Year's Eve party at age nineteen, and then participated in a recording session with Murdoch and David sponsored by Stow College's Music Business Administration curriculum. They named themselves Belle & Sebastian after a children's book of the same name. Murdoch was the lead singer on the first two albums, with Campbell playing cello, percussion and singing backing vocals. A classically trained cellist, Campbell also played keyboards. She also took lead vocals on a few songs from the band, and co-wrote their top-20 UK single \"Legal Man\"."]}, {"page": "Looper (band)", "response": ["Looper are a Scottish electronic music group fronted by Belle and Sebastian co-founder Stuart David.", "Looper emerged from Belle & Sebastian in 1997, when Stuart David (co-founder and bass player of B&S) and his wife Karn (an artist who directed the early B&S videos) collaborated for a show at Glasgow School of Art. A degree show fundraiser for Stuart’s sister Karla Black – who received a Turner Prize nomination in 2011- the performance was a multi-media affair incorporating TVs, super 8 film, 35mm slides and kinetic sculptures"]}, {"page": "List of Scottish musicians", "response": ["*Stuart David"]}, {"page": "Bobby Kildea", "response": ["Bobby Kildea is a musician from Northern Ireland. He currently plays bass and guitar in the Scottish indie pop band Belle & Sebastian, after joining in 2001 to replace departing bassist Stuart David, and had previously been in V-Twin. He is the band's only Northern Irish member and is notable for his laidback demeanor and long hair."]}, {"page": "Richard Colburn", "response": ["Richard Colburn (born 25 July 1970) is the drummer of the Scottish indie band Belle & Sebastian. Before he joined Belle & Sebastian, he used to sell pies on match days outside Celtic Park and studied Music Business at Stow College. Appears as: \"After bonding in an all-night café in Glasgow in January 1996, Stuart Murdoch and Stuart David teamed up with drummer and percussionist Richard Colburn – a fellow student of the Stow College Music Business course from Perth who used to sell pies on match days at Celtic Park.\"   "]}]}}