{"wiki_id": "http://www.wikidata.org/entity/Q11756795", "itemLabel": "Lilia Kopylova", "itemDescription": "British ballroom dancer", "wikipedia_url": "https://en.wikipedia.org/wiki/Lilia_Kopylova", "wikipedia_page": {"main": "Lilia Andreyevna Kopylova (Russian: Лилия Андреевна Копылова; born 18 June 1978) is a Russian professional dancer.\nWith her husband Darren Bennett, she has been competing as an amateur since July 1997 and as a professional since May 2003. The couple has achieved considerable success in the professional Latin style of dancing, both nationally in the UK and internationally.", "link_mentions": [{"page": "Julian Clary", "response": ["In Spring 2007, Clary did a theatre tour of the UK with his show An Evening with... Julian Clary. From 2 October 2007, he played the much coveted role of 'Emcee', in Rufus Norris's Olivier Award-winning production of Cabaret, which was in its second year in the West End. Clary was with the show until 19 April 2008. The following year he took part in the Strictly Come Dancing Tour in January and February 2009. He was partnered with Lilia Kopylova."]}, {"page": "Darren Gough", "response": ["In 2005, Gough took part in the BBC television show Strictly Come Dancing, partnered with British National champion Lilia Kopylova. He was the first cricketer to win the show, a feat former teammate Mark Ramprakash would emulate the following year. He went on to win both the main series and the 2005 Christmas Special.Two years later he returned to win the 2007 Christmas Special. Following this he took part in the Strictly Come Dancing live tour during January and February 2008."]}, {"page": "Strictly Come Dancing", "response": ["! Lilia Kopylova", "Over the years, many dancers from the show have formed both professional and personal partnerships, dancing together competitively, on the show, or both. Darren Bennett and Lilia Kopylova are married, as are James and Ola Jordan and Aljaž Škorjanec and Janette Manrara, who became engaged after joining the show in 2013 and were married in 2017. Matthew and Nicole Cutler are divorced but remain professional partners; Karen Hauer and Kevin Clifton were engaged when Clifton entered the show in 2013 and were married prior to the 2015 series, before divorcing in 2018, while Neil and Katya Jones entered the show as a married couple before separating in 2019. Anton Du Beke and Erin Boag have danced as a professional couple since 1997, while Vincent Simone and Flavia Cacace are former Argentine Tango world champions as a duo and have done multiple tours together. Brendan Cole and Camilla Dallerup danced together for many years, including a stint in the original series of Come Dancing; following their split in 2004, Cole and Katya Virshilas formed a professional partnership, before parting in November 2009. Other current and former professional partnerships featured on the show include Dallerup and Ian Waite, Paul Killick and Hanna Karttunen, Andrew Cuerden and Hanna Haarala, Brian Fortuna and Kristina Rihanoff, Rihanoff and Robin Windsor, Pasha Kovalev and Anya Garnis, siblings Kevin and Joanne Clifton, AJ Pritchard and Chloe Hewitt, and Gorka Márquez and Karen Hauer.", "| Darren Gough & Lilia Kopylova", "|Matt Dawson & Lilia Kopylova", "In Autumn 2004, the second series commenced. Five of the eight original professionals returned: these were Brendan Cole, Anton Du Beke, Erin Boag, Paul Killick and Camilla Dallerup. There were also five new professionals: Darren Bennett, Ian Waite, Lilia Kopylova, Nicole Cutler and Hazel Newberry. This was the only series Newberry participated in, while the other professionals competed in the following series.", "|Lilia Kopylova", "In 2005, the third series commenced. Brendan Cole, Anton Du Beke, Erin Boag, Camilla Dallerup, Darren Bennett, Ian Waite and Lilia Kopylova returned from the second series. Nicole Cutler, Paul Killick and Hazel Newberry did not return. They were replaced by Karen Hardy, Hanna Haarala, Izabela Hannah, Andrew Cuerden and Matthew Cutler.", "|Lilia Kopylova", "|Lilia Kopylova", "|Lilia Kopylova", "|Lilia Kopylova", "|Lilia Kopylova", "The eighth series of Strictly Come Dancing began with a launch show on 11 September 2010; three weeks later, the live shows started on 1 October 2010.BBC unveils new 'Strictly' launch show  Digital Spy, 14 August 2010 Three new professional dancers were announced: Artem Chigvintsev, Jared Murillo and Robin Windsor.Three new guys join the team  Strictly Come Dancing, BBC, August 2010 Darren Bennett, Lilia Kopylova, Brian Fortuna and Matthew Cutler did not return. The celebrities were revealed on 8 September 2010Strictly Come Dancing line-up is revealed  BBC News, 8 September 2010 and their professional partners were revealed during the launch show.'Strictly Come Dancing' couples revealed  Digital Spy, 11 September 2010Dancers  Strictly Come Dancing 2010, BBC"]}, {"page": "Matt Dawson", "response": ["He took part in Strictly Come Dancing in 2006, partnered by Lilia Kopylova. Although appearing initially to be an unlikely contender, he came second, only beaten in the final by cricketer Mark Ramprakash. He later returned to the show in 2008 to dance with Elaine Paige in Sport Relief does Strictly Come Dancing to raise money for Sport Relief, where they came second."]}, {"page": "Downtown (Petula Clark song)", "response": ["Directed by Harvey & Carolyn, (the directors who also directed her video for her single \"Maybe\") the sexually suggestive music video for the single is set in a hotel bedroom featuring Bunton as a maid. It includes appearances from contestants from the BBC's reality television show Strictly Come Dancing and features cameos from Matt Dawson, Louisa Lytton, Carol Smillie, Spoony, Mark Ramprakash, Claire King, Peter Schmeichel, Craig Revel Horwood, Anton du Beke, Brendan Cole, Erin Boag, Lilia Kopylova, Karen Hardy, and Darren Bennett. According to Mark Ramprakash the video was shot at \"a big house near Baker Street\".Ramprakash, Mark (2011). Strictly Me: my life under the spotlight Edinburgh: Mainstream Publishing. "]}, {"page": "Darren Bennett (dancer)", "response": ["Darren Lee Bennett (born 14 February 1977) is an English professional dancer. With his wife Lilia Kopylova he has a successful career in professional Latin dancing, competing nationally and internationally. Darren's favourite dances are the Samba and the Foxtrot.  They teach private lessons in their own studio at Sheffield, England. ", "Bennett is a consultant creative producer for the Dancing with the Stars (Irish Edition) TV show working alongside his wife and choreographer Lilia Kopylova."]}, {"page": "Dancing with the Stars", "response": ["Series 3, 2005: Darren Gough & Lilia Kopylova", "The Turkish version was called Yok Böyle Dans. Thirteen couples were participating in the competition. Lilia Kopylova was the head of the judging panel of four. Azra Akın won the competition with her partner Nikolai."]}, {"page": "Mark Ramprakash", "response": ["In 2006, Ramprakash and Karen Hardy won the BBC's Strictly Come Dancing, beating Matt Dawson, former England rugby player, and Lilia Kopylova in the final. Ramprakash was the second consecutive cricketer to win the show, following former England team mate Darren Gough. In a special edition of Strictly Come Dancing for Sport Relief on 14 March 2008, Ramprakash and partner Kara Tointon were the winners after performing a samba. In 2008, he appeared on a special Strictly Come Dancing episode of The Weakest Link, being the fifth voted off."]}, {"page": "Don Warrington", "response": ["In 2008 Warrington competed in the sixth series of Strictly Come Dancing, partnered with the 2005 and 2006 British National Champion in Latin American dance, Lilia Kopylova.\"Don Warrington & Lilia Kopylova\", Strictly Come Dancing, BBC One. After Week 4, Warrington was joint seventh out of the remaining 12 contestants with an average of 24.5 points. In Week 5 he was eliminated, having lost the dance-off against Heather Small, with the first three judges all voting for Small over Warrington."]}, {"page": "Richard Dunwoody", "response": ["On 25 August 2009 it was announced that he would take part in Series 7 of the BBC's Strictly Come Dancing partnering Lilia Kopylova. The couple were eliminated on the second week."]}, {"page": "Erin Boag", "response": ["In the show's third series, Boag was partnered up with former Olympic athlete, Colin Jackson. They also reached the finals of the competition, but were named the runners-up to cricketer Darren Gough and his professional partner, Lilia Kopylova. She and Jackson later competed in the 2005 Christmas special, where they finished in fifth place."]}, {"page": "2005 in British television", "response": ["*17 December – Cricketer Darren Gough and dancing partner Lilia Kopylova win the third series of Strictly Come Dancing. Shayne Ward wins the second series of The X Factor on the same evening."]}, {"page": "Strictly Come Dancing (series 4)", "response": ["| Lilia Kopylova"]}, {"page": "Flavia Cacace", "response": ["Cacace returned to Strictly Come Dancing for the seventh series in 2009, partnering Coronation Street and Queer as Folk actor Craig Kelly. The couple were in the bottom two in the second week against Lilia Kopylova and Richard Dunwoody, and were forced to perform their tango again. They won votes from three of the four judges and consequently made it through to the third week of the competition. They were also in the bottom two in week 4, against Darren Bennett and Lynda Bellingham. They went through to the next week on the casting vote of head judge Len Goodman. In week 5, the couple received their lowest score of the competition so far and were second from the bottom on the leaderboard. However, they were saved from the dance-off by the public. The  couple were eliminated in Week 8 of the competition, when the show went to Blackpool, after performing a cha-cha-cha."]}, {"page": "Russians in the United Kingdom", "response": ["*Lilia Kopylova, dancer"]}, {"page": "Pasha Kovalev", "response": ["By coming second, Pasha became the first male professional dancer to reach two consecutive Strictly finals, and the third professional dancer to do so overall after Lilia Kopylova and Aliona Vilani."]}, {"page": "Strictly Come Dancing (series 5)", "response": ["| Lilia Kopylova"]}]}}