{"wiki_id": "http://www.wikidata.org/entity/Q11774380", "itemLabel": "Dave McCabe", "itemDescription": "English recording artist; singer, songwriter and guitarist", "wikipedia_url": "https://en.wikipedia.org/wiki/Dave_McCabe", "wikipedia_page": {"main": "David Alan McCabe (born 3 January 1981) is an English singer, songwriter and guitarist, the frontman of The Zutons and a former member of Tramp Attack.", "link_mentions": [{"page": "Prescot", "response": ["*Dave McCabe – Lead singer of the Merseyside band the Zutons."]}, {"page": "Thea Gilmore", "response": ["On 19 May 2008 Fruitcake Records (via Fullfill and distributed by Universal Records) released Liejacker, Gilmore's eighth album featuring contributions from Joan Baez, Dave McCabe, and Erin McKeown. It was preceded on 12 May by the single \"Old Soul\", a duet with McCabe.  In June 2008, Gilmore signed to Rykodisc (Warner) for the United States. Liejacker was released in the US on 23 September 2008."]}, {"page": "The Zutons", "response": ["The Zutons formed in Liverpool in 2001, taking their name from Captain Beefheart's Magic Band guitarist Zoot Horn Rollo. Dave McCabe had previously been in the band Tramp Attack. Both Pritchard and Payne were members of Edgar Jones' post Stairs band The Big Kids (with Sean's brother Howie Payne of The Stands). The band was originally a four-piece, before Payne's girlfriend Abi Harding began joining The Zutons on stage for a couple of songs mid-set, playing simple saxophone lines. The other band members liked the way her saxophone enhanced their sound and Harding became a full member, contributing vocals and sax.", "Pritchard joined Noel Gallagher's High Flying Birds, Molloy collaborated with Sean's sister, Candie Payne, before forming Serpent Power with Ian Skelly and joining The Coral and Sean Payne recorded with Miles Kane. In 2010, singer Dave McCabe was convicted of assault before releasing solo album Church of Miami in 2015. The Zutons' song \"What's your Problem\" was featured in a trailer for the 2012 movie Wreck-It Ralph.", "In November 2018 the band announced a reunion tour to play Who Killed..... The Zutons?' on its 15th anniversary. While original members Dave McCabe, Boyan Chowdhury, Sean Payne and Abi Harding were all on board, Russell Pritchard confirmed via social media that he was not taking part in the reunion tour. In place of Pritchard, Cast member Jay Lewis was recruited to play bass."]}, {"page": "Whiston, Merseyside", "response": ["*Dave McCabe, lead singer and guitarist of The Zutons"]}, {"page": "List of people from Merseyside", "response": ["* Dave McCabe: Singer and songwriter, guitarist in The Zutons."]}, {"page": "He Ain't Heavy, He's My Brother", "response": ["Keith Mullen of the Farm recruited Guy Chambers to produce the single and with Chambers offering free use of his Sleeper Studios to record the song. On 25 October 2012, Steve Rotheram, Guy Chambers and Kenny Dalglish announced plans of the single to be recorded by various artists such as Robbie Williams, Rebecca Ferguson, Paloma Faith, Beverley Knight, Melanie C, Holly Johnson, Mick Jones, Glen Campbell, Peter Hooton, Chris Sharrock, Glenn Tilbrook, Ren Harvieu, Dave McCabe, Paul Heaton, Hollie Cook, Jon McClure, John Power, Gerry Marsden, and two original members of the Hollies, Bobby Elliott and Tony Hicks.", "* Dave McCabe (The Zutons)"]}, {"page": "The Prescot School", "response": ["* Dave McCabe, The Zutons lead singer"]}, {"page": "Tramp Attack", "response": ["Tramp Attack formed in Liverpool in 2001 by Dave McCabe, Hollyoaks and Brookside actor Kristian Ealey, Matt Barton, drummer Ian Lane, bassist Scott Dulson and guitar player Tony Dunne who left early on to form The Bandits.", "Dulson was replaced by James Redmond and Dunne was replaced by Dave McCabe. After quickly gaining an enthusiastic and loyal fanbase, the band secured residencies in the pubs and clubs of Liverpool and went on to win a Battle Of The Bands at The Royal Court.", "The band released their debut single 'Rocky Hangover' in 2001 on Honey Records. The single was produced by Rob Ferrier at Great Northern Studios with B sides 'Broken Man'(written by McCabe) and 'Ladybird' (written by Redmond). Soon after the release of the single, the band split with Dave McCabe going on to form The Zutons and Kristian Ealey working with Edgar Jones in an early lineup of his 'Edgar Jones & the Joneses' band with Candie Payne.", "* Dave McCabe – guitar, vocals (2000–2001)"]}, {"page": "McCabe (surname)", "response": ["*Dave McCabe, English vocalist and musician"]}, {"page": "Valerie (Zutons song)", "response": ["In an interview with The Scotsman in May 2008, lead singer Dave McCabe described the writing process of the song: \"I could tell you I was inspired by gazing out across the Mersey or walking past Macca's old house, but the truth is I got the idea in a cab on the way to my mum's. The whole song was written before I got there, so 20 minutes, max.\""]}, {"page": "Roy Martin (musician)", "response": ["Dave McCabe (The Zutons, Joan Baez, Erin McKeown, Teitur, Athena Andreadis, and many other notable artists."]}, {"page": "David McCabe", "response": ["*Dave McCabe, lead vocalist and guitarist for English rock band, The Zutons", "*Dave McCabe, writer of The Darkside Detective"]}, {"page": "2012 Summer Olympics opening ceremony", "response": ["| Dave McCabe, Abi Harding, Sean Payne, Russell Pritchard, Boyan Chowdhury"]}, {"page": "The Justice Collective", "response": ["Vocalists include Andy Brown (of Lawson), Gerry Marsden (of Gerry and the Pacemakers), Paul Heaton (of The Beautiful South), Glenn Tilbrook (of Squeeze), John Power (of Cast and The La's), Robbie Williams (of Take That), Melanie C (of Spice Girls), Rebecca Ferguson, Holly Johnson (from Frankie Goes to Hollywood), Paloma Faith, Beverley Knight, Eliza Doolittle, Dave McCabe (of The Zutons), Peter Hooton (of The Farm), Ren Harvieu, Jon McClure (of Reverend and The Makers), Paul McCartney (of The Beatles), Shane MacGowan (of The Pogues), Bobby Elliott and Tony Hicks (both of The Hollies), Hollie Cook (from The Slits), LIPA Gospel Choir, Clay Crosse, Alan Hansen, Peter Reid, comedian John Bishop, writer Neil Fitzmaurice and footballer Kenny Dalglish. Musicians were Chris Sharrock (of Beady Eye) on drums, David Catlin-Birch (of World Party) on bass, Paul McCartney (of The Beatles) on lead guitar, Mick Jones (of The Clash) on electric guitar, Andrew \"Davo\" Davitt on acoustic guitar,  Guy Chambers on piano, Elton John on piano, Will Pound on harmonica, Liverpool Philharmonic Orchestra on strings,  Richard Blake on trumpet/flugelhorn, Matthew Lewis on trombone/euphonium, Meredith Moore on French horn and Will Roberts on tuba. Guy Chambers was producer, Richard Flack producer and engineer and Oliver Som, Liam Nolan, Chris Taylor, Jon Withnall, Tony Draper and Alec Brits as engineer."]}, {"page": "List of songs recorded by Amy Winehouse", "response": ["| Dave McCabeThe Zutons"]}]}}