{"wiki_id": "http://www.wikidata.org/entity/Q11727603", "itemLabel": "Jody Cundy", "itemDescription": "English racing cyclist", "wikipedia_url": "https://en.wikipedia.org/wiki/Jody_Cundy", "wikipedia_page": {"main": "Jody Alan Cundy,  (born 14 October 1978) is an English cyclist and former swimmer. He has represented Great Britain at seven Summer Paralympics winning eight Gold, one Silver and three Bronze medals across swimming and cycling events. He has also competed in multiple World Championships, winning 20 world titles (17 in Cycling and 3 in Swimming.)", "link_mentions": [{"page": "Wisbech", "response": ["*Jody Cundy CBE, (born 14 October 1978 in Wisbech) is a Paralympian."]}, {"page": "Peter Tatchell", "response": ["On 21 September 2012, he was awarded a Lifetime Achievement award at the UK's first National Diversity Awards. Alongside Misha B, Jody Cundy, Peter Norfolk and others he was a patron for 2013 National Diversity Awards."]}, {"page": "Great Britain at the 2004 Summer Paralympics", "response": ["|rowspan=\"3\"|Jody Cundy", "|Sascha Kindred David Roberts Giles Long James Crisp Jody Cundy Robert Welbourn"]}, {"page": "List of British cyclists", "response": ["* Jody Cundy"]}, {"page": "Cundy", "response": ["*Jody Cundy, English cyclist and swimmer "]}, {"page": "Great Britain at the 2008 Summer Paralympics", "response": ["thumb|right|300px|Double gold medallist Jody Cundy", "Great Britain's cycling team consisted of ten riders, including returning Paralympic gold medalists Aileen McGlynn, her tandem partner Ellen Hunter, and Darren Kenny. Former swimmers Jody Cundy and Sarah Storey were also named in the squad. The Paralympic cycling team, coached by Chris Furber and managed Helen Mortimer, trained alongside the British Olympic cycling team. Darren Kenny won five medals, four gold and one silver, more golds than any other British competitor at these Games. Cundy set a new world record and won two gold medals on the track to add to his five swimming medals from previous Games; this meant he matched Rebecca Romero's achievement in the Olympics of becoming a medal winner in two different sports. In all British cyclists won twenty medals, seventeen of them gold, to top the cycling medal tables for both road and track events.", "|Jody Cundy", "|Jody Cundy,Darren Kenny,Mark Bristow"]}, {"page": "Cycling at the 2008 Summer Paralympics", "response": ["|  Darren Kenny  Mark Bristow  Jody Cundy"]}, {"page": "List of IPC world records in swimming", "response": ["File:Jody Cundy.jpg|Jody Cundy"]}, {"page": "Swimming at the 2000 Summer Paralympics", "response": ["|valign=top|   Jody Cundy  Giles Long  David Roberts  James Crisp  Matt Walker  Marc Woods"]}, {"page": "British National Team Pursuit Championships", "response": ["| Scienceinsport.comJody Cundy, Tim Lawson, Adam Duggleby & Alistair Rutherford"]}, {"page": "British National Team Sprint Championships", "response": ["| 2010 || Sky Track CyclingChris Hoy, Jason Kenny, Ross Edgar & Matt Crampton  || City of Edinburgh RCJohn Paul, Callum Skinner, Kevin Stewart  || Scienceinsport.comJody Cundy, Andrew Kelly, Dave Readle   ", "| 2012 || North West Region BDavid Daniell, Peter Mitchell, Lewis Oliva || City of Edinburgh RCBruce Croall, John Paul, Callum Skinner  || North West Region AMatthew Crampton, Jody Cundy, Craig MacLean "]}, {"page": "Darren Kenny", "response": [": Men's team sprint (LC1–4 CP3/4), Paralympics, Beijing (with Mark Bristow and Jody Cundy)"]}, {"page": "Great Britain at the 2000 Summer Paralympics", "response": ["|rowspan=\"3\"|Jody Cundy", "|From:David Roberts,Matthew Walker,Giles Long,James Crisp,Jody Cundy,Marc Woods"]}, {"page": "Great Britain at the 1996 Summer Paralympics", "response": ["|  || Jody Cundy || Swimming || Men's 100m butterfly S10"]}, {"page": "Matt Walker (swimmer)", "response": ["Walker competed in the Paralympics for the first time during the 2000 games, in Sydney. In all he took home three medals from these games, a bronze in the 100 m breaststroke SB7, silver in the 50 m freestyle S7 and gold in the 4×100 m freestyle 34 pts. As part of the gold medal winning relay team, which also included Jody Cundy, Giles Long and David Roberts, he set a new world record time of 4:06.85."]}, {"page": "Össur", "response": ["Team Össur is a group of international para-athletes sponsored by Össur. Sponsees include Sarah Reinertsen, Markus Rehm, Jody Cundy  and Rudy Garcia-Tolson."]}, {"page": "2009 New Year Honours", "response": ["* Jody Cundy, Cyclist. For services to Disabled Sport."]}, {"page": "Great Britain at the Paralympics", "response": ["|11||Jody Cundy || Swimming Cycling || 1996 - 2020 || style=\"text-align:center;\"| M ||style=\"text-align:center;\"|8 ||style=\"text-align:center;\"|3 ||style=\"text-align:center;\"|1 ||style=\"text-align:center;\"|12", "|Jody Cundy||||1978||1996 - 2016 (6)||18 - 38||M||7||0||3||10"]}, {"page": "List of 2008 Summer Paralympics medal winners", "response": ["|  Darren Kenny  Mark Bristow  Jody Cundy"]}, {"page": "Cycling at the 2008 Summer Paralympics – Men's time trial", "response": ["| align=center| || Jody Cundy ||  || 1.05.47 WR"]}, {"page": "2011 UCI Para-cycling Track World Championships", "response": ["| Jody Cundy|| 1:05.144 WR", "| Jody Cundy|| 4:51.919", "| Terry Byrne,Jody Cundy,Darren Kenny|| 49.540 WR"]}, {"page": "2011 UCI Para-cycling Track World Championships – Men's 1 km time trial", "response": ["|Jody Cundy", "|  ||align=left| Jody Cundy ||align=left|  || 1:05.144 WR"]}, {"page": "2011 UCI Para-cycling Track World Championships – Mixed team sprint", "response": ["| 1 ||align=left| Terry ByrneJody Cundy Darren Kenny||align=left|  || 49.809 || WR", "|  ||align=left| Terry ByrneJody Cundy Darren Kenny||align=left|  || 49.540"]}, {"page": "2011 UCI Para-cycling Track World Championships – Men's individual pursuit", "response": ["|Jody Cundy", "| 2 ||align=left| Jody Cundy ||align=left|  || 4:44.085 || ", "| ||align=left| Jody Cundy ||align=left|  || 4:51.919"]}, {"page": "Great Britain at the 2012 Summer Paralympics", "response": ["Jody Cundy won a bronze medal in the men's C4 individual pursuit, but was controversially not allowed a restart after a problem with his start in the men's C4-5 time trial. Former RAF technician Jon-Allan Butterworth, competing in his first Paralympics, won the silver medal in that event along with two other silver medals in the men's C5 individual pursuit and as part of the C1-5 sprint team. In the men's B time trial, the tandem of Anthony Kappes and pilot Craig MacLean twice had a mechanical problem with their chain and were not allowed a second restart. Neil Fachie and pilot Barney Storey won the gold medal in a world record time. Both pairings met in an all-British final in the men's B sprint event, where Kappes and MacLean won the gold medal after breaking the world record time during the qualification round. Mark Colbourne set two new world records on the way to gold in the men's C1 individual pursuit, while David Stone won gold in the T1-2 road race, defending the title he won in 2008.", "|Jody Cundy", "|Jody Cundy"]}, {"page": "Panathlon Foundation", "response": ["Fundraising events have included, Woodland Group cycling from London to Paris in May 2014. Jody Cundy, Danny Crates & Liz Johnson competing in the London Triathlon 2014., Hilton Hotel Stansted hosting virtual 'Around the World in a Day' events., Panathlon supporter Andy Haven running the Atacama Desert Challenge in 2019 and sponsors running the 2021 London Marathon and Royal Parks Half. "]}, {"page": "C4 (classification)", "response": ["Competitors in this classification include Australia's Tyson Lawrence and Britain's Jody Cundy."]}, {"page": "LC2 (classification)", "response": ["LC3 competitors include Jody Cundy from Great Britain who has won a gold medal at the Paralympics."]}, {"page": "Misha B", "response": ["Misha B, alongside Jody Cundy, Peter Norfolk, Peter Tatchell, is a joint patron of the UK's National Diversity Awards, an annual event which recognises positive role models and organisations who are connected to diversity in the United Kingdom. In 2013 she was quoted as saying that the awards were a \"great opportunity to recognise and celebrate diversity.\""]}, {"page": "Jon-Allan Butterworth", "response": ["At the 2016 Summer Paralympics he finished in 4th place in the C4-5 1k Time trial, and then won Gold with Jody Cundy and Louis Rolfe in the C1-5 750m Team Sprint.Men's C4-5 1000m Time Trial Schedule & Results – Paralympic Cycling Track Mixed C1-5 750m Team Sprint "]}, {"page": "James Crisp", "response": ["To date Crisp has won twelve Paralympic medals. Seven of the medals were awarded at the 2000 Summer Paralympics including individual golds in the 100 m backstroke and the 200 m individual medley. He was also part of the victorious 4x100 m freestyle relay team alongside Jody Cundy, Giles Long, David Roberts, Matt Walker and Marc Woods. At the 2004 Games Crisp won four individual medals, including three silvers, with all four events being in different stroke styles."]}, {"page": "Cycling at the 2012 Summer Paralympics – Men's 1 km time trial C4–5", "response": ["| Jody Cundy"]}, {"page": "Concerns and controversies at the 2012 Summer Paralympics", "response": ["==Jody Cundy disqualification==", "Cyclist Jody Cundy attracted criticism for his reaction to a disqualification in the C4/C5 1 km time trial, which followed a dispute over a starting gate opening.  He was quoted as shouting at his coaches, \"I fell out of the gate because the fucking gate didn't open. Everybody else gets the fucking re-ride… you don’t know the half of it. Do you know what it’s like? Four years of my life. One minute three, I could have destroyed everyone… in front of a six thousand home crowd. I'll never get this opportunity ever, ever, ever again.\" He had to be physically restrained by the team mechanic. He later returned to the arena to apologise to the crowd, saying, \"I would like to apologise for my language, I think that even after all that noise you might have been able to hear my language… Congratulations to all my fellow competitors.\""]}, {"page": "Cycling at the 2012 Summer Paralympics – Men's individual pursuit C4", "response": ["| Jody Cundy"]}, {"page": "September 2012 in sports", "response": ["***Men's individual pursuit C4:London 2012 Men's Ind. C4 Pursuit Official results  Carol-Eduard Novak   Jiří Ježek   Jody Cundy "]}]}}