{"wiki_id": "http://www.wikidata.org/entity/Q11722972", "itemLabel": "John Harvey", "itemDescription": "architectural historian (1911-1997)", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Harvey_(historian)", "wikipedia_page": {"main": "John Hooper Harvey  (25 May 1911 – 18 November 1997) was an English architectural historian, who specialised in writing on English Gothic architecture and architects. Paul Crossley has described him as \"the most prolific and arguably the most influential writer on Gothic architecture in the post-war years\". He made extensive use of archival sources, and is particularly remembered for having – through his study of Henry Yevele (1944), and his biographical dictionary of English Mediaeval Architects (1954) – helped dispel the myth that the architects of medieval buildings were anonymous figures of whom little could be discovered. He also published more generally on England in the later middle ages, and was a pioneer in the field of garden history.", "link_mentions": [{"page": "Edward the Black Prince", "response": ["The black field of his \"shield for peace\" is well documented (see Arms and heraldic badge above). However, there is no sound evidence that Edward ever wore black armour, although John Harvey (without citing a source) refers to \"some rather shadowy evidence that he was described in French as clad at the battle of Crécy ' en armure noire en fer bruni ' – in black armour of burnished steel\". Richard Barber suggests that the name's origins may have lain in pageantry, in that a tradition may have grown up in the 15th century of representing the prince in black armour. He points out that several chronicles refer to him as Edward the IV (the title he would have taken as King had he outlived his father): this name would obviously have become confusing when the actual Edward IV succeeded in 1461, and this may have been the period when an alternative had to be found."]}, {"page": "Architecture of cathedrals and great churches", "response": ["The earliest large churches date from Late Antiquity. As Christianity and the construction of churches spread across the world, their manner of building was dependent upon local materials and local techniques. Different styles of architecture developed and their fashion spread, carried by the establishment of monastic orders, by the posting of bishops from one region to another and by the travelling of master stonemasons who served as architects.John Harvey, The Gothic World. The successive styles of the great church buildings of Europe are known as Early Christian, Byzantine, Romanesque, Gothic, Renaissance, Baroque, Rococo, Neoclassical, and various Revival styles of the late 18th to early 20th centuries, and then Modern.Sir Banister Fletcher, History of Architecture on the Comparative Method. Underlying each of the academic styles are the regional characteristics. Some of these characteristics are so typical of a particular country or region that they appear, regardless of style, in the architecture of churches designed many centuries apart.", "* John Harvey, The Gothic World, 1100–1600, 1950, Batsford, ISBN", "* John Harvey, English Cathedrals, 1961, Batsford, ISBN"]}, {"page": "Wells Cathedral", "response": ["Its Gothic architecture is mostly in Early English style of the late 12th – early 13th centuries, lacking the Romanesque work that survives in many other cathedrals. Building began about 1175 at the east end with the choir. Historian John Harvey sees it as Europe's first truly Gothic structure, breaking the last constraints of Romanesque. The stonework of its pointed arcades and fluted piers bears pronounced mouldings and carved capitals in a foliate, \"stiff-leaf\" style. Its Early English front with 300 sculpted figures, is seen as a \"supreme triumph of the combined plastic arts in England\". The east end retains much ancient stained glass. Unlike many cathedrals of monastic foundation, Wells has many surviving secular buildings linked to its chapter of secular canons, including the Bishop's Palace and the 15th-century residential Vicars' Close. It is a Grade I listed building.", "Construction of the cathedral began in about 1175, to the design of an unknown architect. Wells is the first cathedral in England to be built, from its foundation, in Gothic style. According to art historian John Harvey, it is the first truly Gothic cathedral in the world, its architects having entirely dispensed with all features that bound the contemporary east end of Canterbury Cathedral and the earlier buildings of France, such as the east end of the Abbey of Saint Denis, to the Romanesque. Unlike these churches, Wells has clustered piers rather than columns and has a gallery of identical pointed arches rather than the typically Romanesque form of paired openings. The style, with its simple lancet arches without tracery and convoluted mouldings, is known as Early English Gothic."]}, {"page": "William Worcester", "response": ["Worcester made several journeys through England, and his notes (now known as his \"Itineraries\") contain much information. His survey of Bristol, which he appears to have devised as a self-contained work, is particularly detailed, and of great value to historians and antiquaries. Portions of his notes were printed by James Nasmith in 1778; and the description of Bristol was published by James Dallaway under the title William Wyrcestre Redivivus in 1823, and reprinted in his Antiquities of Bristowe in 1834. Modern scholarly editions and translations have been published as the Itineraries of William Worcestre in 1969, edited by John Harvey; and as The Topography of Medieval Bristol in 2000, edited by Frances Neale."]}, {"page": "John Harvey", "response": ["John Harvey may refer to:", "*John Harvey (racing driver) (1938–2020), winner of the 1983 Bathurst 1000", "*John Harvey (cricketer) (1939–2003), English cricketer", "*John Harvey (rugby league) (born 1955), Australian rugby league player and coach", "*John Harvey (American football) (born 1966), National Football League running back", "*John Harvey (Canadian football) (born 1950), Canadian Football League running back", "*John Harvey (football manager), manager of Heart of Midlothian F.C. 1966–1970", "*John Harvey (footballer, fl. 1890–1900), Scottish footballer (Sunderland AFC)", "*John Harvey (footballer, born c. 1934), Scottish footballer (Partick Thistle)", "*John Harvey (cyclist), English Cyclist (Born 1884)", "*John Harvey (Virginia governor) (died 1646), 17th-century Crown governor of Virginia", "*John Harvey (Albemarle) (died 1679), Governor of Colonial North Carolina", "*John Harvey (North Carolina politician) (died 1775), 18th-century Speaker of the North Carolina House of Representatives ", "*John Harvey (British Army officer) (1778–1852), officer during the War of 1812 and Governor of several Canadian provinces", "*John Harvey (Australian politician) (1823–1893), politician in the early days of South Australia, founder of the town of Salisbury", "*John Harvey (British politician) (1920–2008), British Conservative MP for Walthamstow East", "*John Harvey (Royal Navy officer, born 1772) (1772–1837), long serving Royal Navy officer", "*John Harvey (Royal Navy officer, born 1740) (1740–1794), long serving naval officer killed at the Glorious First of June", "*John Harvey (RAAF officer) (born 1954), current serving RAAF Air Marshal", "*John Harvey (actor) (1911–1982), English stage and film actor", "*John Harvey (American actor) (1917–1970), American actor", "*Harvey (announcer) (John Harvey, born 1951), American television and radio personality", "*John Harvey (author) (born 1938), British author of crime fiction", "*John Harvey (ironfounder), partner in Harveys of Hayle, late-18th-century ironfounders, father-in-law of Richard Trevithick", "*John Harvey (astrologer) (1564–1592), English astrologer and physician", "*John Harvey (historian) (1911–1997), British architectural historian, who wrote on English Gothic architecture and architects", "*John Harvey (psychologist) (born 1943), American psychologist", "*SS John Harvey, a 1942 Second World War Liberty ship", "*Sir John Harvey-Jones (1924–2008), British businessman, chairman of ICI, then presenter of BBC TV show Troubleshooter"]}, {"page": "Old St Paul's Cathedral", "response": ["According to the architectural historian John Harvey, the octagonal chapter house, built about 1332 by William de Ramsey, was the earliest example of Perpendicular Gothic.Harvey, 105. This is confirmed by Alec Clifton-Taylor, who notes that the chapter house and St Stephen's Chapel at the medieval Westminster Palace predate the early Perpendicular work at Gloucester Cathedral by several years.Clifton-Taylor, 196. The foundations of the chapter house were recently made visible in the redeveloped south churchyard of the new cathedral."]}, {"page": "Architecture of the medieval cathedrals of England", "response": ["Note: all the dimensions are those given by John Harvey unless otherwise cited. The periods and style names are those used by Banister Fletcher and others, based on Rickman and Sharpe.", "The researches of John Harvey have uncovered the names of many English medieval architects, and by tracing stylistic characteristics, it has sometimes proved possible to track their careers from one building to another. Leading architects were highly paid - especially those employed in the King's works - and they can often be identified from regular payments in cathedral accounts."]}, {"page": "Nelson's Pillar", "response": ["By 1949 the Irish Free State had evolved into the Republic of Ireland and left the British Commonwealth, but not all Irish opinion favoured the removal of the Pillar. That year the architectural historian John Harvey called it \"a grand work\", and argued that without it, \"O'Connell Street would lose much of its vitality\". Most of the pressure to get rid of it, he said, came from \"traffic maniacs who ... fail to visualise the chaos which would result from creating a through current of traffic at this point\". In a 1955 radio broadcast Thomas Bodkin, former director of the National Gallery of Ireland, praised not only the monument, but Nelson himself: \"He was a man of extraordinary gallantry. He lost his eye fighting bravely, and his arm in a similar fashion\"."]}, {"page": "William de Ramsey", "response": ["William de Ramsey was a scion of the de Ramsey family of master masons whose work, according to John Harvey, can be found at Ramsey Abbey, Norwich Cathedral, Ely Cathedral, and possibly also in Paris. Ramsey died of plague in 1349, during the Black Death. William Ramsey's daughter, Agnes Ramsey, carried on his workshop after his death."]}, {"page": "List of regional characteristics of European cathedral architecture", "response": ["The earliest large churches date from the Roman Empire. As Christianity and the construction of churches and cathedral spread throughout the world, their manner of building was dependent upon local materials and local techniques. Different styles of architecture developed and their fashion spread, carried by the establishment of monastic orders, by the posting of bishops from one region to another and by the travelling of master stonemasons who served as architects.John Harvey, The Gothic World. The styles of the great church buildings are successively known as Early Christian, Byzantine, Romanesque, Gothic, Renaissance, Baroque, various Revival styles of the late 18th to early 20th centuries and Modern.Sir Banister Fletcher, History of Architecture on the Comparative Method.  Overlaid on each of the academic styles are the regional characteristics. Some of these characteristics are so typical of a particular country or region that they appear, regardless of style, in the architecture of cathedrals designed many centuries apart.", "* John Harvey, The Gothic World, 1100-1600, 1950, Batsford, ISBN", "* John Harvey, English Cathedrals, 1961, Batsford, ISBN"]}, {"page": "Old St Matthew's Church, Lightcliffe", "response": ["The original building on the site was a chapel of ease called Eastfield Chapel, which was built in 1529. This was damaged during the Reformation, and repaired in 1536. The chapel was rebuilt as a church in Neoclassical style in 1775, and designed by William Mallinson of Halifax. It was replaced in the late 19th century by a new church a short distance away. The old church was then used as a mortuary chapel. It was severely damaged by a storm in the 1960s and its fabric deteriorated and the church suffered from vandalism. The Bishop of Wakefield wanted to have the whole church demolished. After negotiation, it was agreed that the diocese would pay for the demolition of the body of the church, while the Friends of Friendless Churches would be responsible for financing the repair and restoration of the tower. The Friends were granted a 99-year lease on the tower on 1 January 1974. The repair work was carried out by Marshalls of Elland and it was supervised by the Gothic expert Dr John Harvey. Further repairs were carried out in 1990 at a cost of £5,800."]}, {"page": "List of fellows of the Society of Antiquaries of London", "response": ["*John Harvey (1911–1997), architectural historian"]}, {"page": "List of people educated at St John's School, Leatherhead", "response": ["* John Harvey (1911-1997), architectural historian"]}, {"page": "List of architectural historians", "response": ["* John Harvey (1911–1997), English Gothic architecture and architects. "]}, {"page": "John Hooper Harvey", "response": ["#REDIRECT John Harvey (historian)"]}, {"page": "J.H. Harvey", "response": ["#REDIRECT John Harvey (historian)"]}, {"page": "J. H. Harvey", "response": ["#REDIRECT John Harvey (historian)"]}, {"page": "John Harvey (architectural historian)", "response": ["#REDIRECT John Harvey (historian)"]}, {"page": "Deaths in November 1997", "response": ["*John Harvey, 86, English architectural historian."]}, {"page": "Perpendicular Gothic", "response": ["In 1906 William Lethaby, Surveyor of the Fabric of Westminster Abbey, proposed that the origin of the Perpendicular style was to be found not in 14th-century Gloucester, as was traditionally argued, but in London, where the court of the House of Plantagenet was based at Westminster Palace beside Westminster Abbey. The cathedral of London, the episcopal see of the third-most senior bishop in the Church of England, was then Old St Paul's Cathedral. According to the architectural historian John Harvey, the octagonal chapter house of St Paul's, built about 1332 by William Ramsey for the cathedral canons, was the earliest example of Perpendicular Gothic. Alec Clifton-Taylor agreed that St Paul's chapter house and St Stephen's Chapel at Westminster Palace predate the early Perpendicular work at Gloucester. In the early 21st century the outline of the foundations of the chapter house was made visible in the redeveloped south churchyard of the present 17th-century cathedral."]}, {"page": "Robert Pickersgill Howgrave-Graham", "response": ["As J. Greig remarked in the obituary for Nature “photography was, for him (Howgrave-Graham), handmaiden to archaeology. The art of photographing the interesting and beautiful features of the architecture of medieval buildings was one at which he excelled and many of his photographs, some of striking beauty, have been reproduced in books on Gothic art.”  An example being a photograph of Bristol Cathedral that appeared in the 1972 book Mediaeval Architect by John Harvey. Howgrave-Graham also took the photographs for the book Unknown Westminster Abbey by L. E. Tanner published in 1948."]}]}}