{"wiki_id": "http://www.wikidata.org/entity/Q1174233", "itemLabel": "David Diringer", "itemDescription": "British historian and linguist", "wikipedia_url": "https://en.wikipedia.org/wiki/David_Diringer", "wikipedia_page": {"main": "David Diringer (1900–1975) was a British linguist, palaeographer and writer. He was the author of several well-known books about writing systems.\nOn the back dust-jacket flap of Writing (1962), under About the Author, we may read the following brief biography of the author as scholar: \"David Diringer, M.A. (Cantab.), D.Litt. (Florence), was educated in Florence, to which University he subsequently returned, first as Lecturer, then as Professor. He has taught [...] in England, on the Continent, in the [US], and elsewhere. He was Secretary at the First International Congress of Etruscan Studies (1928) and at the first three Congresses of Colonial Studies in Italy (1931, 1934, 1937). Since 1948, Dr. Diringer has been Lecturer in Semitic Epigraphy at the University of Cambridge. He is the author of several books, including The Early Hebrew Inscriptions (1934) [and] The Alphabet in the History of Civilization (1937), and of more than 200 contributions to learned journals. Dr. Diringer is the founder and director of the Alphabet Museum at Cambridge.\"", "link_mentions": [{"page": "Abugida", "response": ["Related concepts were introduced independently in 1948 by James Germain Février (using the term ) and David Diringer (using the term semisyllabary), then in 1959 by Fred Householder (introducing the term pseudo-alphabet).Householder, F. (1959). Review of The Decipherment of Linear B by John Chadwick, The Classical Journal, 54(8), 379-383. Retrieved 30 September 2020, from http://www.jstor.org/stable/3294984 The Ethiopic term \"abugida\" was chosen as a designation for the concept in 1990 by Peter T. Daniels.Daniels, P. (1990). Fundamentals of Grammatology. Journal of the American Oriental Society, 110(4), 727-731. doi:10.2307/602899: \"We must recognize that the West Semitic scripts constitute a third fundamental type of script, the kind that denotes individual consonants only. It cannot be subsumed under either of the other terms. A suitable name for this type would be \"alephbeth,\" in honor of its Levantine origin, but this term seems too similar to \"alphabet\" to be practical; so I propose to call this type an \"abjad,\" [Footnote:  I.e., the alif-ba-jim order familiar from earlier Semitic alphabets, from which the modern order alif-ba-ta-tha is derived by placing together the letters with similar shapes and differing numbers of dots. The abjad is the order in which numerical values are assigned to the letters (as in Hebrew).] from the Arabic word for the traditional order6 of its script, which (unvocalized) of course falls in this category... There is yet a fourth fundamental type of script, a type recognized over forty years ago by James-Germain Fevrier, called by him the \"neosyllabary\" (1948, 330), and again by Fred Householder thirty years ago, who called it \"pseudo-alphabet\" (1959, 382). These are the scripts of Ethiopia and \"greater India\" that use a basic form for the specific syllable consonant + a particular vowel (in practice always the unmarked a) and modify it to denote the syllables with other vowels or with no vowel. Were it not for this existing term, I would propose maintaining the pattern by calling this type an \"abugida,\" from the Ethiopian word for the auxiliary order of consonants in the signary.\" In 1992 Faber suggested \"segmentally coded syllabically linear phonographic script\", and in 1992 Bright used the term alphasyllabary,Amalia E. Gnanadesikan (2017) Towards a typology of phonemic scripts, Writing Systems Research, 9:1, 14-35, DOI: 10.1080/17586801.2017.1308239 \"The second is that of Bright (1996, 1999) which follows Daniels in abjads and alphabets (Bright, 1999), but identifies instead of abugidas a category of alphasyllabaries. As Bright (1999) points out, the definition of abugida and the definition of alpha- syllabary differ. This fact alone suggests that at least one of the two classifications is either incom- plete or inaccurate—or at the very least that they have two different purposes. This paper is intended as a (long-delayed) response to Bright (1999) and argues that both of these systems are in fact incomplete.\"Littera ex occidente: Toward a Functional History of Writing. Peter T. Daniels, in STUDIES IN SEMITIC AND AFROASIATIC LINGUISTICS PRESENTED TO GENE B. GRAGG Edited by CYNTHIA L. MILLER pages 53-69:\"Alongside the terms I rejected (neosyllabary [Février 1948], pseudo-alphabet [Householder 1959], semisyllabary [Diringer 1948], and alphasyllabary [Bright 1992]) because they imply exactly the notion I am trying to refute – that the abugida is a kind of alphabet or a kind of syllabary – I have just come across semialphabet in the Encyclopœdia Britannica Micropœdia (though what is intended by the distinction \"the syllabic KharoœøÏ (sic) and semialphabetic BrΩhmÏ\" [s.v. \"Indic Writing Systems\"] is unfathomable). W. Bright denies having devised the term alphasyllabary, but it has not yet been found to occur earlier than his 1992 encyclopedia (in 1990: 136 he approved semisyllabary). Compare Daniels 1996b: 4 n. * and Bright 2000 for the different conceptualizations of abugida and alphasyllabary: functional vs. formal, as it happens. The words abjad and abugida are simply words in Arabic and Ethiopic, respectively, for the ancient Northwest Semitic order of letters, which is used in those languages in certain functions alongside the customary orders (in Arabic reflecting rearrangement according to shape, and in Ethiopic reflecting an entirely different letter-order tradition\" and Gnanadesikan and Rimzhim, Katz, & Fowler have suggested aksara or āksharik.Amalia E. Gnanadesikan (2017) Towards a typology of phonemic scripts, Writing Systems Research, 9:1, 14-35, DOI: 10.1080/17586801.2017.1308239 \"This type of script has been given many names, among them semi-alphabet (Diringer, 1948, referring to Brāhmī), semi-syllabary (Diringer, 1948, referring to Devanāgarī) or semi-syllabic script (Baker, 1997), syllabic alphabet (Coulmas, 1999), alphasyllabary (Bright, 1996, 1999; Trigger, 2004), neosyllabary (Daniels, 1990), abugida (Daniels, 1996a) and segmentally coded syllabically linear phonographic script (Faber, 1992) as well as the Sanskrit-inspired terms aksara system (Gnanadesikan, 2009) or āksharik script (Rimzhim, Katz, & Fowler, 2014). As is discussed further below, however, there is a considerable degree of typological diversity in this family of scripts.\""]}, {"page": "Parchment", "response": ["Writing on prepared animal skins had a long history, however. David Diringer noted that \"the first mention of Egyptian documents written on leather goes back to the Fourth Dynasty (c. 2550–2450 BC), but the earliest of such documents extant are: a fragmentary roll of leather of the Sixth Dynasty (c. 24th century BC), unrolled by Dr. H. Ibscher, and preserved in the Cairo Museum; a roll of the Twelfth Dynasty (c. 1990–1777 BC) now in Berlin; the mathematical text now in the British Museum (MS. 10250); and a document of the reign of Ramses II (early thirteenth century BC).\"David Diringer, The Book before Printing: Ancient, Medieval and Oriental, Dover Publications, New York 1982, p. 172. Though the Assyrians and the Babylonians impressed their cuneiform on clay tablets, they also wrote on parchment from the 6th century BC onward. Rabbinic literature traditionally maintains that the institution of employing parchment made of animal hides for the writing of ritual objects such as the Torah, mezuzah, and tefillin is Sinaitic in origin, with special designations for different types of parchment such as gevil and klaf.Maimonides, Hilkhoth Tefillin 1:3."]}, {"page": "Papyrus", "response": ["Papyrus was replaced in Europe by the cheaper, locally produced products parchment and vellum, of significantly higher durability in moist climates, though Henri Pirenne's connection of its disappearance with the Muslim conquest of Egypt is contested.Pirenne, Mohammed and Charlemagne, critiqued by R.S. Lopez, \"Mohammed and Charlemagne: a revision\", Speculum (1943:14–38.). Its last appearance in the Merovingian chancery is with a document of 692, though it was known in Gaul until the middle of the following century. The latest certain dates for the use of papyrus are 1057 for a papal decree (typically conservative, all papal bulls were on papyrus until 1022), under Pope Victor II,David Diringer, The Book before Printing: Ancient, Medieval and Oriental, Dover Publications, New York 1982, p. 166. and 1087 for an Arabic document. Its use in Egypt continued until it was replaced by less expensive paper introduced by the Islamic world who originally learned of it from the Chinese. By the 12th century, parchment and paper were in use in the Byzantine Empire, but papyrus was still an option.Bompaire, Jacques and Jean Irigoin. La paleographie grecque et byzantine, Centre National de la Recherche Scientifique, 1977, 389 n. 6, cited in Alice-Mary Talbot (ed.). Holy women of Byzantium, Dumbarton Oaks, 1996, p. 227. .", "* David Diringer, The Book before Printing: Ancient, Medieval and Oriental, Dover Publications, New York 1982, pp. 113–169, ."]}, {"page": "Linguistic prescription", "response": ["Early historical trends in literacy and alphabetization were closely tied to the influence of various religious institutions. Western Christianity propagated the Latin alphabet. Eastern Orthodoxy spread the Greek and Cyrillic alphabets. Judaism used the Hebrew alphabet, and Islam the Arabic script. Hinduism used the Devanagari script.David Diringer, The Alphabet: A Key to the History of Mankind (1947; South Asia, reprinted 1996);  In certain traditions, strict adherence to prescribed spellings and pronunciations was and remains of great spiritual importance. Islamic naming conventions and greetings are notable examples of the linguistic prescription being a prerequisite to spiritual righteousness. Another commonly cited example of prescriptive language usage closely associated with social propriety is the system of Japanese honorific speech."]}, {"page": "Baybayin", "response": ["David Diringer, accepting the view that the scripts of the Malay archipelago originate in India, writes that the South Sulawesi scripts derive from the Kawi script, probably through the medium of the Batak script of Sumatra. The Philippine scripts, according to Diringer, were possibly brought to the Philippines through the Buginese characters in Sulawesi. According to Scott, 's immediate ancestor was very likely a South Sulawesi script, probably Old Makassar or a close ancestor. This is because of the lack of final consonants or vowel canceller markers in . South Sulawesi languages have a restricted inventory of syllable-final consonants and do not represent them in the Bugis and Makassar scripts. The most likely explanation for the absence of final consonant markers in  is therefore that its direct ancestor was a South Sulawesi script. Sulawesi lies directly to the south of the Philippines and there is evidence of trade routes between the two.  must therefore have been developed in the Philippines in the fifteenth century CE as the Bugis-Makassar script was developed in South Sulawesi no earlier than 1400 CE.Caldwell, Ian. 1988. Ten Bugis Texts; South Sulawesi 1300-1600. PhD thesis, Australian National University, p.17"]}, {"page": "Category talk:English historians", "response": ["List of all pages in category English historians retrieved by PockBot.PockBot is currently Undergoing Trials. If you have any comments on its performance please leave them at Wikipedia:Bots/Requests_for_approval/PockBotArticleClass / StatusPeter Ackroydnot yet classifiedHarold Actonnot yet classifiedJohn Dalberg-Acton, 1st Baron Actonnot yet classifiedAethelweardnot yet classifiedGrace Aguilarnot yet classifiedLucy Aikinnot yet classifiedAilred of Rievaulxnot yet classifiedGeoffrey Aldermannot yet classifiedSir Archibald Alisonnot yet classifiedAndrew Allamnot yet classifiedGeorge Allan (antiquary)not yet classifiedWilliam Edward David Allennot yet classifiedAlured of Beverleynot yet classifiedJames Pettit Andrewsnot yet classifiedWilliam Archer (critic)not yet classifiedGeoffrey Ashenot yet classifiedHarold Brakspearnot yet classifiedRichard Baker (chronicler)not yet classifiedJohn Baker (legal historian)not yet classifiedAdolphus Ballardnot yet classifiedJoshua Barnesnot yet classifiedCorrelli BarnettStartHugh Bichenonot yet classifiedRobert Blake, Baron Blakenot yet classifiedWilliam Henry Blissnot yet classifiedRichard Bonneynot yet classifiedGerald Brenannot yet classifiedFrancis Brinkleynot yet classifiedOscar Browningnot yet classifiedKevin Brownlownot yet classifiedHenry Thomas Bucklenot yet classifiedJames Burneynot yet classifiedWilliam Camdennot yet classifiedJohn Capgravenot yet classifiedEdward Cardwellnot yet classifiedGeorge Carewnot yet classifiedThomas Cartenot yet classifiedPaul Cartledgenot yet classifiedChristopher Catherwoodnot yet classifiedWilliam Cavenot yet classifiedHector Munro Chadwicknot yet classifiedOwen Chadwicknot yet classifiedAllan Chapmannot yet classifiedWinston Churchill14px GAEdward Hyde, 1st Earl of Clarendonnot yet classifiedAlan Clarknot yet classifiedKenneth Clarknot yet classifiedBob Clarke (historian)not yet classifiedRobert Conquestnot yet classifiedCharles Henry Coopernot yet classifiedWilliam Coxenot yet classifiedMandell Creightonnot yet classifiedAndrew Dalbynot yet classifiedSamuel Danielnot yet classifiedBasil Davidsonnot yet classifiedGodfrey Daviesnot yet classifiedChristopher Dawsonnot yet classifiedGoldsworthy Lowes Dickinsonnot yet classifiedDavid Diringernot yet classifiedJohn Andrew Doylenot yet classifiedWilliam Dugdalenot yet classifiedAlfred Duggannot yet classifiedThomas Henry Dyernot yet classifiedBryan Edwardsnot yet classifiedLeonard Elliott Elliot-Binnsnot yet classifiedThomas Elmhamnot yet classifiedGeorge Finlaynot yet classifiedMoses I. Finleynot yet classifiedPercy Hethrington Fitzgeraldnot yet classifiedRobin Lane Foxnot yet classifiedJames Anthony Froudenot yet classifiedFrancis Aidan Cardinal Gasquetnot yet classifiedGeoffrey the Bakernot yet classifiedEdward GibbonStartMartin Gilbertnot yet classifiedRobert Gildeanot yet classifiedMary Anne Everett Greennot yet classifiedVivian H. H. Greennot yet classifiedHenry Melvill Gwatkinnot yet classifiedE. E. Y. Halesnot yet classifiedEdward Hallnot yet classifiedHenry Hallamnot yet classifiedJohn Hardyngnot yet classifiedEdward Hastednot yet classifiedPeter Hennessynot yet classifiedHenry of Huntingdonnot yet classifiedChristopher Hibbertnot yet classifiedAndrew Hignellnot yet classifiedChristopher Hill (historian)not yet classifiedHarry Hinsleynot yet classifiedPatricia Hollis, Baroness Hollis of Heighamnot yet classifiedJ. C. Holtnot yet classifiedW. G. Hoskinsnot yet classifiedWilliam Howittnot yet classifiedBettany Hughesnot yet classifiedWilliam Hutton (Birmingham historian)not yet classifiedDavid Irvingnot yet classifiedCatherine Jacksonnot yet classifiedJohn Heneage Jessenot yet classifiedJohn S. Conwaynot yet classifiedJohn of Hexhamnot yet classifiedJohn Jortinnot yet classifiedJohn Keaynot yet classifiedIan Kershawnot yet classifiedAlexander William Kinglakenot yet classifiedHenry Knightonnot yet classifiedRichard Knollesnot yet classifiedPeter Laslettnot yet classifiedBernard Lewisnot yet classifiedJohn Lingardnot yet classifiedCatherine Macaulaynot yet classifiedThomas Babington Macaulay, 1st Baron Macaulaynot yet classifiedDiarmaid MacCullochnot yet classifiedJohn Maddicottnot yet classifiedHenry James Sumner Mainenot yet classifiedFrederic William Maitlandnot yet classifiedNoel Malcolmnot yet classifiedGeorge Bruce Mallesonnot yet classifiedTheodore Augustine Mannnot yet classifiedThomas Maynot yet classifiedCharles Merivalenot yet classifiedWilliam Nassau Molesworthnot yet classifiedPhilip Morantnot yet classifiedJames Augustus Cotter Morisonnot yet classifiedLewis Bernstein Namiernot yet classifiedJohn Julius Norwichnot yet classifiedDimitri Obolenskynot yet classifiedRichard Ollardnot yet classifiedRobin Osbornenot yet classifiedHenry Nutcombe Oxenhamnot yet classifiedFrancis Palgravenot yet classifiedMatthew Parisnot yet classifiedC. Northcote Parkinsonnot yet classifiedMichael Pearsonnot yet classifiedLiza Picardnot yet classifiedCharles Plummernot yet classifiedAlbert Pollardnot yet classifiedFrederick York Powellnot yet classifiedF. M. Powickenot yet classifiedJohn Prebblenot yet classifiedH. F. M. Prescottnot yet classifiedAnthony Preston (naval historian)not yet classifiedJames Rennellnot yet classifiedRicardian (Richard III)not yet classifiedRichard of Hexhamnot yet classifiedAndrew Robertsnot yet classifiedMichael Roberts (historian)not yet classifiedJohn C. G. Röhlnot yet classifiedFrederick Rolfenot yet classifiedJohn Holland Rosenot yet classifiedEmma Georgina Rothschildnot yet classifiedMichael Ernest Sadlernot yet classifiedJohn Saltmarshnot yet classifiedDominic Sandbrooknot yet classifiedNigel Saulnot yet classifiedSimon Schamanot yet classifiedJohn Robert Seeleynot yet classifiedMartin Sharp (journalist)not yet classifiedJane Shawnot yet classifiedWalter Sichelnot yet classifiedRaleigh Ashlin Skeltonnot yet classifiedDavid Smith (historian)not yet classifiedRichard Southernnot yet classifiedGeorge Speaightnot yet classifiedJohn Spelmannot yet classifiedDavid Starkeynot yet classifiedLawrence Stonenot yet classifiedAgnes Stricklandnot yet classifiedJohn Strypenot yet classifiedWilliam Stubbsnot yet classifiedRichard Talbertnot yet classifiedWilliam Woodthorpe Tarnnot yet classifiedAlasdair and Hettie Taylernot yet classifiedA. J. P. Taylornot yet classifiedArnold Fitz Thedmarnot yet classifiedConnop Thirlwallnot yet classifiedThomas Wykesnot yet classifiedE. P. Thompsonnot yet classifiedEmma Elizabeth Thoytsnot yet classifiedH. W. Timperleynot yet classifiedHugh Tootellnot yet classifiedJoshua Toulminnot yet classifiedMichael Trappes-Lomaxnot yet classifiedG. M. Trevelyannot yet classifiedSir George Trevelyan, 2nd Baronetnot yet classifiedHugh Trevor-Roper, Baron Dacre of Glantonnot yet classifiedAndrew White Tuernot yet classifiedSharon Turnernot yet classifiedKenneth Turpinnot yet classifiedRobert Vaughannot yet classifiedOrderic Vitalisnot yet classifiedAndrew Wallace-Hadrillnot yet classifiedSpencer Walpolenot yet classifiedAdolphus William Wardnot yet classifiedVeronica Wedgwoodnot yet classifiedJohn Wheeler-Bennettnot yet classifiedThomas Abingtonnot yet classifiedArthur Agardenot yet classifiedJohn Yonge Akermannot yet classifiedAnthony Allennot yet classifiedJohn Anstisnot yet classifiedJohn Anstis, youngernot yet classifiedElias Ashmolenot yet classifiedJohn Aubreynot yet classifiedJoseph Ayloffenot yet classifiedThomas Baker (antiquarian)not yet classifiedChristopher Barkernot yet classifiedDaines Barringtonnot yet classifiedJohn Thomas Blightnot yet classifiedMatthew Bloxamnot yet classifiedWilliam Copeland Borlasenot yet classifiedJohn Brandnot yet classifiedEdward Wedlake Brayleynot yet classifiedWilliam Bright, D.D.not yet classifiedJohn Britton (antiquary)not yet classifiedGeorge Bucknot yet classifiedWilliam Bullock (collector)not yet classifiedRichard Burnnot yet classifiedRichard Carewnot yet classifiedRichard Chandlernot yet classifiedSimonds d'Ewesnot yet classifiedJohn Evans (archaeologist)not yet classifiedLewis Evans (collector)not yet classifiedFrederick William Fairholtnot yet classifiedThomas Dudley Fosbrokenot yet classifiedAugustus Wollaston Franksnot yet classifiedJohn Frerenot yet classifiedRichard Gough (antiquarian)not yet classifiedEdwin Guestnot yet classifiedJohn Guillimnot yet classifiedRobert Stephen Hawkernot yet classifiedThomas Hearnenot yet classifiedJoseph Hunternot yet classifiedKenneth Hamilton Jenkinnot yet classifiedJohn Battelynot yet classifiedWilliam Lambardenot yet classifiedAshton Levernot yet classifiedCharles Herbert Mayonot yet classifiedWilliam Nicolsonnot yet classifiedWilliam Oldysnot yet classifiedFrancis Pecknot yet classifiedMargaret Bentinck, Duchess of Portlandnot yet classifiedJames Prinsepnot yet classifiedGerald Henry Rendallnot yet classifiedJoseph Ritsonnot yet classifiedJohn Seldennot yet classifiedCharles Hamilton SmithStubHenry Spelmannot yet classifiedJohn Stownot yet classifiedWilliam Stukeleynot yet classifiedMerlin Hanbury-Tracy, 7th Baron Sudeleynot yet classifiedJohn Timbsnot yet classifiedRoger Twysdennot yet classifiedGeorge Vertuenot yet classifiedJohn Weevernot yet classifiedAnthony Woodnot yet classifiedThomas Wrightnot yet classifiedJohn Aylmer (English constitutionalist)not yet classifiedWalter Bagehotnot yet classifiedA. V. Diceynot yet classifiedGeoffrey Rudolph Eltonnot yet classifiedStephen Gardinernot yet classifiedJohn Hooker (English constitutionalist)not yet classifiedJames I of Englandnot yet classifiedErskine May, 1st Baron Farnboroughnot yet classifiedWilliam Stoughton (English constitutionalist)not yet classifiedEdward Aglionbynot yet classifiedEdward Bellasisnot yet classifiedWalter Blountnot yet classifiedJohn Brooke-Littlenot yet classifiedWilliam Brugesnot yet classifiedSamuel Egerton Brydgesnot yet classifiedBernard Burkenot yet classifiedAlfred Butlernot yet classifiedClive Cheesmannot yet classifiedPeter Wilson Coldhamnot yet classifiedRodney Dennysnot yet classifiedGilbert Dethicknot yet classifiedWilliam Dethicknot yet classifiedAlan Dickinsnot yet classifiedPatric Laurence Dickinsonnot yet classifiedArthur Charles Fox-Daviesnot yet classifiedJames Frerenot yet classifiedRichard Graham-Viviannot yet classifiedEverard Greennot yet classifiedPeter Gwynn-Jonesnot yet classifiedIsaac Heardnot yet classifiedCecil Humphery-Smithnot yet classifiedWilliam Hunt (officer of arms)not yet classifiedThomas Joseph-Watkinnot yet classifiedGregory Kingnot yet classifiedHenry Lane (officer of arms)not yet classifiedEdmund Lodgenot yet classifiedRoger Machado (officer of arms)not yet classifiedMichael Maclagannot yet classifiedHenry Robert Charles Martinnot yet classifiedRobin de la Lanne-Mirrleesnot yet classifiedNicholas Harris Nicolasnot yet classifiedPeter O'Donoghuenot yet classifiedHenry Paston-Bedingfeldnot yet classifiedJohn Philipotnot yet classifiedLeslie Pinenot yet classifiedJames Planchénot yet classifiedArchibald Russellnot yet classifiedAlfred Scott-Gattynot yet classifiedWilfrid Scott-Gilesnot yet classifiedRichard St Georgenot yet classifiedFrancis Thynnenot yet classifiedAubrey Toppinnot yet classifiedCharles Townley (officer of arms)not yet classifiedWilliam Barclay Turnbullnot yet classifiedArthur Vicarsnot yet classifiedAnthony Wagnernot yet classifiedJohn Walker (officer of arms)not yet classifiedJohn Warburton (officer of arms)not yet classifiedDavid White (officer of arms)not yet classifiedCharles Wriothesleynot yet classifiedThomas Wriothesleynot yet classifiedJohn Writhenot yet classifiedLionel Barnettnot yet classifiedRichard Francis Burtonnot yet classifiedJoseph Dacre Carlylenot yet classifiedBasil Hall Chamberlainnot yet classifiedDuncan Forbesnot yet classifiedNathaniel Brassey Halhednot yet classifiedThomas Hydenot yet classifiedWilliam Jones (philologist)not yet classifiedEdward William Lanenot yet classifiedSamuel Leenot yet classifiedWilliam Marsden (orientalist)not yet classifiedReynold A. Nicholsonnot yet classifiedE. A. Wallis Budgenot yet classifiedCharles Wilkinsnot yet classifiedEdit by PockBot (on behalf of PocklingtonDan)"]}, {"page": "History of the alphabet", "response": ["* David Diringer, History of the Alphabet, 1977, ."]}, {"page": "History of writing", "response": ["* David Diringer Writing. New York: Praeger. 1962."]}, {"page": "Codex Marianus", "response": ["Later researchers as Josip Hamm has warned that vocalization of yers (ъ > o, ь > e), as well as the occasional disappearance of epenthetic l, suggests Macedonian provenience. According to F. Curta, the book was \"certainly of Macedonian origin\", written \"either in Ohrid or in one of the monastic centers in the region.\" According to H. G. Lunt, \"Certain deviations from the theoretical norms indicate Macedonian influences, others possibly Serbian (if not northern Macedonian)\". There are a number of arguments that link the Codex Marianus with Bulgarian territory that bordered that of Serbia.Monastic Traditions: Selected Proceedings of the Fourth International Hilandar Conference, the Ohio State University, 14–15 August 1998, Charles E. Gribble, Predrag Matejić Издание, Slavica, 2003, , p. 15.  It is difficult to answer whether the Codex was created before the end of the First Bulgarian Empire (1018), or after its Byzantine conquest, i.e. into the theme of Bulgaria.Slavic Scriptures: The Formation of the Church Slavonic Version of the Holy Bible, Henry R. Cooper, Fairleigh Dickinson Univ Press, 2003, pp. 97-98.,  Lunt proposed the 1030s, but David Diringer dates it from the late 10th century.The Illuminated Book: Its History and Production, David Diringer, Faber, 1967, p. 115."]}, {"page": "History of medieval Tunisia", "response": ["The Libyan Berbers developed their own writing system, evidently derived from Phoenician,Its modern name Tifinagh, more accurately in French Tifinar, derives in the Afroasiatic morphology of Semitic triliteral roots from FNR which signifies the Phoenician people. P. Salama, \"The Sahara in Classical antiquity\" 286-295, at 289-290, in General History of Africa, volume II, Ancient Civilizations of Africa (UNESCO 1990) Abridged Edition. Many alphabets seem to derive via the Pheonician. as early as the 4th century BC.David Diringer, Writing (London: Thames and Hudson 1962) at 124, 132, 141. A chart shows the Berber letters and sound values of ancient Libyan and modern Tifinagh. Brent and Fentress (1996) at 220. It was a boustrophic script, i.e., written left to right then right to left on alternating lines, or up and down in columns.Joseph R. Applegate, \"The Berber Language\" at 96-118, 115, in Hodge (ed.), Afroasiatic. A Survey (1971). Boustrophic writing was more common in the ancient world. Most of these early inscriptions were funerary and short in length. Several longer texts exist, taken from Thugga, modern Dougga, Tunisia. Both are bilingual, being written in Punic with its letters and in Berber with its letters. One throws some light on the governing institutions of the Berbers in the 2nd century BC.Over 150 words, the text dates from the era of the Berber King Masinissa.  The other text begins: \"This temple the citizens of Thugga built for King Masinissa.... \"Steven Roger Fischer, A History of Writing (London: Reaktion 2001) at 92. The text is over 50 words and dates from the Second Punic War, 218-201. Fischer also reports a Celt-Iberian coin from Spain of the first century B.C. inscribed with Libyan letters. Ibid. at 93. Today the script descendent from the ancient Libyan remains in use; it is called Tifinagh."]}, {"page": "Diringer, David", "response": ["#REDIRECT David Diringer"]}, {"page": "Diringer, D.", "response": ["#REDIRECT David Diringer"]}, {"page": "Portal talk:Writing", "response": ["Diringer (David Diringer) - "]}, {"page": "List of people named David", "response": ["*David Diringer (1900–1975), British linguist"]}, {"page": "List of Egyptian inventions and discoveries", "response": ["* Parchment – Writing on prepared animal skins had a long history, however. David Diringer noted that \"the first mention of Egyptian documents written on leather goes back to the Fourth Dynasty (c. 2550–2450 BC), but the earliest of such documents extant are: a fragmentary roll of leather of the Sixth Dynasty (c. 24th century BC), unrolled by Dr. H. Ibscher, and preserved in the Cairo Museum; a roll of the Twelfth Dynasty (c. 1990–1777 BC) now in Berlin; the mathematical text now in the British Museum (MS. 10250); and a document of the reign of Ramses II (early thirteenth century BC).\"David Diringer, The Book before Printing: Ancient, Medieval and Oriental, Dover Publications, New York 1982, p. 172."]}]}}