{"wiki_id": "http://www.wikidata.org/entity/Q1173668", "itemLabel": "David Battley", "itemDescription": "British actor (1935-2003)", "wikipedia_url": "https://en.wikipedia.org/wiki/David_Battley", "wikipedia_page": {"main": "David John Battley (5 November 1935 – 20 January 2003) was a British actor of stage and screen, mainly appearing in comedy roles.", "link_mentions": [{"page": "Eric Idle", "response": ["On television, Idle created Rutland Weekend Television (RWT), a sketch show on BBC2, written by himself, with music by Neil Innes. RWT was 'Britain's smallest television network'. The name was a parody of London Weekend Television, the independent television franchise contractor that provided Londoners with their ITV services at weekends; Rutland had been England's smallest county, but had recently been 'abolished' in an administrative shake-up. To make the joke complete, the programme went out on a weekday. Other regular performers were David Battley, Henry Woolf, Gwen Taylor and Terence Bayler. George Harrison made a guest appearance on one episode."]}, {"page": "2003 in film", "response": ["| style=\"text-align:center;\"| 20 || David Battley || style=\"text-align:center;\"| 67 || style=\"text-align:center;\"| UK || style=\"text-align:center;\"| Actor || "]}, {"page": "1996 in film", "response": ["| Willy Wonka & the Chocolate Factory (re-release) || Warner Bros. Pictures / Wolper Pictures / The Quaker Oats Company || Mel Stuart (director); Roald Dahl (screenplay); Gene Wilder, Jack Albertson, Peter Ostrum, Roy Kinnear, Julie Dawn Cole, Leonard Stone, Denise Nickerson, Dodo Denney, Paris Themmen, Ursula Reit, Michael Böllner, Diana Sowle, Aubrey Woods, David Battley, Günter Meisner, Peter Capell, Werner Heyking, Peter Stuart, Dora Altmann, Franziska Liebing, Ernst Ziegler, Victor Beaumont, Frank Delfino, Gloria Manon, Stephen Dunne, Tim Brooke-Taylor, Ed Peck, Pat Coombs, George Claydon, Malcolm Dixon, Rusty Goffe, Angelo Muscat, Rudy Borgstaller, Ismed Hassan, Norman McGlen, Pepe Poupee, Marcus Powell, Albert Wilkinson || Musical, Fantasy || Live action"]}, {"page": "1983 in film", "response": ["| Krull || Columbia Pictures / Barclays Mercantile / Industrial Finance || Peter Yates (director); Stanford Sherman (screenplay); Ken Marshall, Lysette Anthony, Freddie Jones, Francesca Annis, Trevor Martin, David Battley, Bernard Bresslaw, Alun Armstrong, Liam Neeson, Robbie Coltrane, Michael Elphick, Dicken Ashworth, Todd Carty, Bronco McLoughlin, Gerard Naprous, Andy Bradford, Bill Weston, John Welsh, Graham McGrath, Tony Church, Clare McIntyre, Belinda Mayne || Sci-Fi, Fantasy || Live action"]}, {"page": "Mr. Bean", "response": ["Although Mr. Bean is the only significant character in the programme, others appear usually as foils for his various antics. Other than his girlfriend Irma Gobb (Matilda Ziegler), there are more characters in each episode. However several notable British actors and comedians appear alongside Atkinson in the series as various one-off supporting characters, including Owen Brenman, Richard Briers, Roger Sloman, Angus Deayton, Stephen Frost, Nick Hancock, Christopher Ryan, Paul Bown, Caroline Quentin, Danny La Rue, Roger Brierley, Roger Lloyd-Pack, Rupert Vansittart, David Battley, David Schneider, Richard Wilson and Rudolph Walker. Vansittart and Walker later appeared alongside Atkinson in The Thin Blue Line.Credits at the Internet Movie Database. Retrieved 17 April 2008."]}, {"page": "The Beiderbecke Tapes", "response": ["*John the Barman – David Battley"]}, {"page": "Comedy Playhouse", "response": ["For Richer...For Poorer (25 June 1975) starring David Battley, Harry H. Corbett, Don Henderson and Eric Pohlmann"]}, {"page": "Alice in Wonderland (1966 TV play)", "response": ["The play featured a number of prominent British actors including Michael Redgrave (as the Caterpillar), John Gielgud (as the Mock Turtle), and Peter Sellers (as the King of Hearts), as well as two of Miller's fellow cast members from Beyond the Fringe, Peter Cook and Alan Bennett as the Mad Hatter and the Mouse, respectively. The title role was played by Anne-Marie Mallik, the 13-year-old daughter of a Surrey barrister, this being her only known acting performance. Wilfrid Brambell played the White Rabbit, Michael Gough (who later appeared in Tim Burton's 2010 film adaptation) and Wilfrid Lawson were the March Hare and the Dormouse, Alison Leggatt was the Queen of Hearts, and Leo McKern did a drag turn as the Ugly Duchess. The journalist and broadcasting personality Malcolm Muggeridge was The Gryphon. John Bird played the Fish Footman. The play also featured a young Eric Idle, several years before Monty Python brought him notice, uncredited as a member of the Caucus Race. David Battley appears briefly as the Executioner."]}, {"page": "Theatre 625", "response": ["|Angela Douglas,Bee Duffell,Philip Grout,Jimmy Thompson,Patrick Tull,Jimmy Gardner,David Battley,Job Stewart,Harold Innocent,Brian Steele,Noel Davis,Derek Needs,Henzie Raeburn,Dudley Jones"]}, {"page": "Redcap (TV series)", "response": ["It starred John Thaw as Sergeant John Mann, a member of the Special Investigation Branch of the Royal Military Police and ran for two series and 26 episodes between 1964 and 1966. Other actors appearing in the series included Kenneth Colley, Keith Barron, Windsor Davies, David Battley and Allan Cuthbertson. The series was created by Jack Bell and employed a variety of writers including Roger Marshall, Troy Kennedy-Martin, Jeremy Paul, Robert Holles and Richard Harris."]}, {"page": "John Battley", "response": ["In 1933 he married Sybill Allchurch, and they had two sons: Bernard and actor David Battley."]}, {"page": "Rutland Weekend Television", "response": ["*David Battley - Best remembered for his performance as the schoolteacher Mr. Turkentine in Willy Wonka & the Chocolate Factory (1971) and the hapless Ergo in Krull (1983). In the show, he was often the straight man, and second only to Idle in the number of his performances throughout the series. He was the Paul McCartney character in the original (RWT) Rutles sketch, but was not involved in the TV special All You Need Is Cash (1978). Battley also appears in the final episode as David Frost, whom he had also portrayed in a stage production.", "Idle said of his RWT colleagues (in the same Radio Times interview): \"Neil Innes is superb. I must be his biggest fan. Henry Woolf played Toulouse-Lautrec in the West End. He's the best small philosopher in London at the moment. And David Battley – what can I say? Straight, pale, dead-pan brilliant. Our cameraman, Peter Bartlett, filmed the Queen but says I'm easier to work with.\"", "* Santa Doesn't Live Here Any More. Supposedly a play by Arthur Serious, this sketch parodies a typically miserable family Christmas, with David Battley complaining about everything and suggesting \"a nice game of suicide\". Eric Idle relates a charming childhood memory that quickly turns nasty, and Neil Innes arrives as a postman, with an unusual present in the shape of a sexy showgirl, prompting Battley's remark \"they make lovely presents, women\". This segues into Innes's doleful song, \"I Don't Believe in Santa Any More\".", "* Being Normal. A spoof documentary about one man's completely uneventful life. Despite having had lunatic parents and a miserable childhood, Arthur Sutcliffe (David Battley) remains depressingly ordinary, going to \"straight pubs\" and feeling at home in the company of \"other normals\". The documentary's narrator decides that \"the little man from the off-licence\" (Woolf) is to blame, not just for Sutcliffe's misfortune, but for everything, including Leicester City Football Club's failure to win the FA Cup, racial prejudice and the unequal distribution of wealth. This segues into Innes's song Lie Down and Be Counted.", "* The Cretin Club. A man (David Battley) is despondent after he scores zero in an IQ test, but since he managed to get his name right at the top of the paper, the examiner (Eric Idle) gives him two points and membership to the Cretin Club, whose perks include cufflinks, a club tie and an 'I Am A Cretin' T-shirt. (This sketch was expanded upon in The Rutland Dirty Weekend Book.)", "* Ron Badger / Satan's Electrical Shop. The Devil (David Battley) is found in reduced circumstances, running a small electrical shop. He complains that people's souls are no good to him (\"they just sit there, soulfully...if people sold me their privates, it'd be more interesting\") but reluctantly decides to buy just one more. The customer (Eric Idle) hasn't taken Satan's economic downturn into account though, and the promise to make love to Helen of Troy turns out to be a seedy one-night stand with \"Helen of bleeding Edgbaston, more like\" in a grubby seaside hotel room.", "On RWT, \"The Rutles\" are portrayed by: Eric Idle as the Harrison character, Neil Innes as the Lennon character, David Battley as the McCartney character, and John Halsey as the Ringo character. They are introduced as: \"Dirk\" (Idle), \"Nasty\" (Innes), \"Stig\" (Battley), & \"Barry\" (Halsey). (\"Barry\" is inexplicably changed to \"Kevin\" on the RWT soundtrack album.) The original version of \"I Must Be in Love\", is performed by Neil Innes & Fatso, and is slightly different than the 1978 All You Need Is Cash version. Also of note, on RWT, \"The Rutles\" are quite clearly a product of Rutland, whereas in All You Need Is Cash, they are relocated to Liverpool."]}, {"page": "Truly, Madly, Bletchley", "response": ["Starring Julian Dutton, Liz Fraser, David Battley, Toby Longworth and Simon Godley, Truly, Madly, Bletchley follows a group of Councillors who decide to start their own public access cable radio show. "]}, {"page": "Krull (film)", "response": ["The film stars an ensemble cast: Kenneth Marshall as Prince Colwyn, Lysette Anthony as Princess Lyssa, Trevor Martin as the voice of the Beast, Freddie Jones as Ynyr, Bernard Bresslaw as Rell the Cyclops, David Battley as Ergo the Magnificent, Tony Church and Bernard Archard as kings and the fathers of Colwyn and Lyssa, Alun Armstrong as the leader of a group of bandits that include early screen roles for actors Liam Neeson and Robbie Coltrane, John Welsh as The Emerald Seer, Graham McGrath as Titch, and Francesca Annis as The Widow of the Web.", "* David Battley as Ergo the Magnificent, the film's comedic relief who has the shapeshifting ability to turn into various animals. He describes himself as \"short in stature, tall in power, narrow of purpose, and wide of vision\".", "The Aurum Film Encyclopedia expressed admiration for the \"engaging characters who surround the pallid hero and heroine\" and also called the action scenes \"nicely judged\".Phil Hardy, The Aurum Film Encyclopedia: Science Fiction London : Aurum, 1991.  (p.346). Lambie called the characters \"flat\", Gibron said that the acting \"seemed pitched just a tad too high for the relatively low brow material\", while Buchanan described Marshall's performance as Colwyn as \"somewhat wooden\". Jawetz opined that \"Marshall, who looks like the lovechild of Patrick Swayze and Bruce McCulloch, is not quite tough enough to pull off his warrior role, but the supporting cast seems more solid.\" Lambie praised David Battley's performance as Ergo, while Justine Elias, another journalist for The House Next Door, called Battley's character \"awful\", elaborating that \"even the dullest child would find this unfunny. I pitied Ken Marshall when he was forced to react with hearty ha-ha-has to every crap magic trick.\""]}, {"page": "2003 in the United Kingdom", "response": ["* 20 January – David Battley, actor (born 1935)"]}, {"page": "List of alumni of the Royal Academy of Dramatic Art", "response": ["*David Battley (Acting Diploma 1959)"]}, {"page": "Don't Just Lie There, Say Something!", "response": ["* David Battley as Country Yokel"]}, {"page": "List of The Good Life episodes", "response": ["| style=\"font-size: 100%;\" |It's Christmas Eve, and in the Goods' house Tom and Barbara are making home-made decorations and crackers in readiness for Christmas Day; while at the Leadbetters', after a standoff with a delivery driver (David Battley), Margo has sent back her whole order because the Christmas tree was six and a quarter inches too short. But when the shop does not deliver her order the following day, she and Jerry are left with no decorations, food or drink. So Tom and Barbara invite them round for a self-sufficiency Christmas of home-made paper hats and improvised party games."]}, {"page": "1935 in the United Kingdom", "response": ["** David Battley, actor (died 2003)"]}, {"page": "BBC-3 (TV series)", "response": ["Regular performers included John Bird, Lynda Baron, David Battley, Roy Dotrice, Bill Oddie, and Leonard Rossiter.Radio Times entry for Radio Times entry for  Guests included Millicent Martin and Alan Bennett. The musical director was Dave Lee. With its white sets, BBC-3 retained the look of its predecessor, Not So Much a Programme. Its name was a reference to the BBC's second channel, BBC2, which had started the previous year."]}, {"page": "David battley", "response": ["#REDIRECT David Battley "]}, {"page": "Julian Dutton", "response": ["The following year, in 1994, he was given his own series, Truly, Madly, Bletchley, which he wrote and starred in, along with David Battley, Liz Fraser, Simon Godley and Toby Longworth."]}, {"page": "List of British actors", "response": ["* David Battley (1935–2003)"]}, {"page": "David Batley", "response": ["#REDIRECT David Battley"]}, {"page": "Hotel Paradiso (film)", "response": ["* David Battley as George "]}, {"page": "The Omega Connection", "response": ["Luther Starling (Jeffrey Byron) is a superspy for the American government who after completing his latest mission of retrieving stolen documents sets out on a six week vacation across Europe. Luther is picked up at Heathrow airport in London, England by his friend Roger (Larry Cedar) in his Morgan 3-Wheeler to stay with Roger and Roger's Aunt Lydia (Mona Washbourne) for the duration of the London leg of Luther's trip. By chance the two follow a motorcade where British Secret Service agents Bidley and Peters (Roy Kinnear and David Battley respectively) are escorting a recently defected Eastern European scientist, Professor Buchinski (David Kossoff) who possesses a revolutionary new energy formula. However when a team of armed gunmen ambush the motorcade intent on kidnapping the Professor, Luther attempts to intervene but is outmatched but the professor slips a gold ring into his jacket pocket. Upon discovery of the ring, it leads Luther and Roger on an adventure across London as they attempt to rescue the professor from the villainous criminal organization Omega.", "* David Battley as Peters "]}, {"page": "Mister Quilp", "response": ["* David Battley as Codlin "]}, {"page": "List of Charlie and the Chocolate Factory characters", "response": ["Mr. Turkentine is Charlie Bucket's school teacher and appears in the 1971 film, but not in the book or the 2005 film. He has an odd sense of humour, which he uses to express knowledge. He asks Charlie to assist him in making a medicine using several scientific elements for the class, but the project is interrupted due to the frantic Golden Ticket search for Willy Wonka. Mr. Turkentine, when hearing the news about the Golden Tickets during the project, dismisses the class and runs out. Later, when it is revealed that all of the tickets have supposedly been found ending with a Paraguayan millionaire, he decides to use Wonka bars as an example to teach his class about percentages. He uses a few students as examples for the class, including Charlie. Charlie, however, reveals that he only opened two Wonka bars during the search and so, to help make it easier for his class, he decides to pretend that Charlie opened 200. Mr. Turkentine is played by British actor David Battley."]}, {"page": "Battley", "response": ["*David Battley (1935–2003), British actor"]}, {"page": "Charlie and the Chocolate Factory (franchise)", "response": ["| David Battley"]}]}}