{"wiki_id": "http://www.wikidata.org/entity/Q1175646", "itemLabel": "D. M. S. Watson", "itemDescription": "paleontologist", "wikipedia_url": "https://en.wikipedia.org/wiki/D._M._S._Watson", "wikipedia_page": {"main": "Prof David Meredith Seares Watson FRS FGS HFRSE LLD (18 June 1886 – 23 July 1973) was the Jodrell Professor of Zoology and Comparative Anatomy at University College, London from 1921 to 1951.", "link_mentions": [{"page": "Baphetidae", "response": ["Baphetids were first described by Edward Drinker Cope when he erected the family Baphetidae in 1865 for Baphetes. Richard Lydekker named Loxomatinae in 1889 for Loxomma, which later became known as Loxommatidae. D. M. S. Watson described the group as Loxommidae in 1917. Later studies have shown Baphetes and Loxomma to be close relatives within the same family, and because Baphetidae was named before Loxommatidae, it has seniority and is the valid name of the group."]}, {"page": "Morganucodon", "response": ["In the summer of 1947, fieldwork was done at Duchy Quarry in Glamorgan in southern Wales. Grey conglomerate that formed fissure fill deposits within karstic voids in Carboniferous limestone was extracted. In 1949, Walter Georg Kühne noted the lower cheek tooth of a primitive mammal while examing samples of the rock. He named it Morganucodon watsoni, with the genus name being derived from Morganuc, which Kühne stated was the name of South Glamorgan in the Domesday Book, with the species name being in honour of D. M. S. Watson. Additional remains of M. watsoni were described by Kühne in 1958. Also in 1958, Kenneth Kermack and Frances Mussett described additional remains from Pant Quarry, about a mile from Duchy Quarry, that had been collected in 1956. In August 1948, an expedition to Lufeng in Yunnan, China yielded a 1 in (2.5 cm) long skull. It was shortly sent to Beijing (then Peking) and then eventually sent out of China, and deposited with Kenneth Kermack at University College London in 1960. The specimen was preliminarily described in 1963 by Harold W. Rigney, who noted the similarity to Morganucodon from Britain, and considered it cogeneric, naming the new species Morganucodon oehleri in honor of the reverend Edgar T. Oehler, who had originally collected the specimen. In 1978 C. C. Young described Eozostrodon heikuopengensis from the Hei Koa Peng locality near Lufeng, based on an associated skull and dentary, as well as a right maxilla and associated dentary.C.-C. Young. 1978. New materials of Eozostrodon. Vertebrata PalAsiatica 16:1-3 A revision by William A. Clemens in 1979 assigned this species to Morganucodon, based on its close similarity to the two previously named species. In 1980 Clemens named the species Morganucodon peyeri, from isolated teeth found in Late Triassic (Rhaetian) deposits near Hallau, Switzerland, with the species being named after paleontologst Bernhard Peyer.W. A. Clemens. 1980. Rhaeto-Liassic mammals from Switzerland and West Germany. Zitteliana 5:51-92 In 1981, Kermack, Mussett and Rigney published an extensive monograph on the skull of Morganucodon. In 2016 Percy Butler and Denise Sigogneau-Russell named the species Morganucodon tardus from an upper right molar (M34984) collected from the Watton Cliff locality near Eype in Dorset, England, dating to the late Bathonian stage of the Middle Jurassic. The species being named after the Latin tardus, late, in reference to it being the youngest member of the genus.Butler, P.M. and Sigogneau-Russell, D. 2016. Diversity of triconodonts in the Middle Jurassic of Great Britain. Palaeontologia Polonica 67, 35–65. LSID urn:lsid:zoobank.org: pub: C4D90BB6-A001-4DDB-890E-2061B4793992"]}, {"page": "Wollaston Medal", "response": ["*1965 D. M. S. Watson"]}, {"page": "Sauropsida", "response": ["Category:Taxa named by D. M. S. Watson"]}, {"page": "Romanes Lecture", "response": ["* 1928 D. M. S. Watson — Palaeontology and the Evolution of Man"]}, {"page": "Linnean Medal", "response": ["*1949: D. M. S. Watson"]}, {"page": "Adelospondyli", "response": ["Category:Taxa named by D. M. S. Watson"]}, {"page": "David Watson", "response": ["* D. M. S. Watson (David Meredith Seares Watson, 1886–1973), British paleontologist"]}, {"page": "Grant Museum of Zoology and Comparative Anatomy", "response": ["Robert Edmond Grant was the first Chair of Zoology in England, the founder of the Grant Museum collection and its first curator. He set the precedent that the Chair of Zoology at UCL (then the University of London) was also the curator of the comparative zoology collection. On his death Grant left his own collection to the museum, and was briefly succeeded by William Henry Allchin before care of the collection passed to invertebrate zoologist Edwin Ray Lankester in 1875. Lankester was curator until 1891 and added significantly to the museum collection. Later lecturer curators included evolutionary biologist W. F. R. Weldon, Edward Alfred Minchin, embryologist J. P. Hill and palaeontologist D. M. S. Watson. After 1948 the curatorship of the museum was no longer the responsibility of the Chair of Zoology and the museum was under the care of professional curators."]}, {"page": "Temnospondyli", "response": ["Temnospondyli became a commonly used name at the turn of the 20th century. Paleontologists included both embolomeres and rhachitomes in the group. Cope's Ganocephala and Labyrinthodonta fell out of use. In 1919, British paleontologist D. M. S. Watson proposed that the evolutionary history of these large amphibians could be seen through changes in their vertebrae. Embolomerous forms in the Carboniferous graded into rhachitomous forms in the Permian, and finally into stereospondyls in the Triassic. More importantly, Watson began using the term Labyrinthodontia to refer to these groups. The name Temnospondyli was rarely used in the decades that followed. Swedish paleontologist Gunnar Säve-Söderbergh removed embolomeres from the group, narrowing its scope to rhachitomes and stereospondyls. His classification of labyrinthodonts was based heavily on characteristics of the skull rather than the vertebrae."]}, {"page": "Broughton, Salford", "response": ["* Jodrell Professor of Zoology and Comparative anatomy D. M. S. Watson (1886–1973)"]}, {"page": "Paranthodon", "response": ["In 1909, Robert Broom visited the collection of the British Museum of Natural History. He concluded that Owen had mixed the partial distorted skull, teeth, and a mandible of a pareiasaur and a partial upper jaw of a dinosaur, BMNH 47338, which were from two different species. Broom kept the name Anthodon for the pareiasaur, but identified the other fossil as a member of the genus Palaeoscincus, naming the new species Paleoscincus africanus in 1912. He found that the anatomy of the teeth were quite different, even though they resembled each other, as well as those of Stegosaurus. In 1929, Franz Nopcsa, unaware of Broom's previous publication, provided a second novel name as D. M. S. Watson believed that the jaw should be differentiated from Anthodon. Nopcsa named the species Paranthodon Owenii, with the generic name derived from the Latin para, meaning \"similar\", \"near\", or \"beside\", and Anthodon, and specific name honouring Owen. Following modern conventions, the specific name was later emended to owenii. Both names were brought into the current nomenclature by Walter P. Coombs in his 1971 dissertation as the new combination Paranthodon africanus, as the name Paranthodon was the first new generic name for the fossils and africanus was the first new specific name. This makes Paranthodon africanus the proper name for the taxon previously known as Palaeoscincus africanus and Paranthodon owenii."]}, {"page": "David Meredith Seares Watson", "response": ["#REDIRECT D. M. S. Watson"]}, {"page": "Tritylodontidae", "response": ["Because of their mammal-like appearance, tritylodontids were originally placed within Mammalia. Starting with the work of British paleontologist D. M. S. Watson in 1942, a close relationship was favored between tritylodontids and cynodonts. Watson and other paleontologists noted that tritylodontids lacked the dentary and squamosal jaw articulation that was characteristic of early mammals. Haughton and Brink (1954) were the first to classify tritylodontids within Cynodontia. Later studies identified close similarities between the teeth of tritylodontids and traversodontids, and tritylodontids were eventually thought to be descendants of traversodontids. Under this classification, which was widely accepted in the following decades, Tritylodontidae was previous considered to be part of Gomphodontia, a larger group within Cynognathia. The name Tritylodontoidea was previously used for the group, which traditionally included the families Diademodontidae, Trirachodontidae, Traversodontidae, and Tritylodontidae."]}, {"page": "Cuvieronius", "response": ["An account has Cuvieronius remains being found in Ecuador with human artifacts dated around 200 to 400 AD.D. M. S. Watson, History of Elephants"]}, {"page": "Lyell Medal", "response": ["* 1935 D. M. S. Watson"]}, {"page": "Ernest Hanbury Hankin", "response": ["Hankin moved to Bombay following an outbreak of plague in 1905. During this period he took some interest in vultures at the Towers of Silence, which had apparently increased in numbers. Hankin wrote on the Bubonic plague (1899) and \"On the Epidemiology of Plague\" in the Journal of Hygiene in 1905, but his interests also drifted towards the subject of flight, possibly through his observations on vultures. In 1914 he published Animal Flight about soaring flight in birds, based on observations he made, particularly of gulls and vultures, in Agra. He introduced a technique to plot the flight path of soaring birds by tracing their movements on a horizontal mirror. He identified thermals and currents as a requirement for soaring and dynamic soaring. His work on soaring birds caught the interest of Cambridge mathematician turned meteorologist Gilbert Walker who was also at Simla who discussed the role and nature of thermals and eddies in providing birds with the lift needed. With D. M. S. Watson, at the time a lecturer in Vertebrate Palaeontology at University College London, he also published a pioneering paper on the flight of pterodactyls in the Aeronautical Journal (1914).Levenspeil, Octave \"Atmospheric Pressure at the Time of Dinosaurs\"  Chemical Engineering Department, Oregon State University, n. d."]}, {"page": "D.M.S. Watson", "response": ["#REDIRECT D. M. S. Watson"]}, {"page": "D M S Watson", "response": ["#REDIRECT D. M. S. Watson "]}, {"page": "DMS Watson", "response": ["#REDIRECT D. M. S. Watson "]}, {"page": "Mesosuchus", "response": ["Category:Taxa named by D. M. S. Watson"]}, {"page": "Arctops", "response": ["Category:Taxa named by D. M. S. Watson"]}, {"page": "Darwin–Wallace Medal", "response": ["*D. M. S. Watson"]}, {"page": "Spathicephalus", "response": ["The type species of Spathicephalus, S. mirus, was named by paleontologist D. M. S. Watson in 1929. Watson described seven fossil specimens from an outcrop of the Rumbles Ironstone in the town of Loanhead in Midlothian, Scotland. The ironstone dates to the late Namurian stage (earliest Upper Carboniferous) and is part of the Limestone Coal Group. These specimens were discovered in the 1880s and include a mostly complete skull with the palate exposed, an impression of the underside of a skull roof, a right portion of the back of a skull, and various jaw fragments. At the time, Spathicephalus and other tetrapods from the Namurian of Scotland were some of the oldest tetrapods known, predating the better-known Late Carboniferous tetrapod assemblages of the British Coal Measures. In November 1974, Scottish paleontologist Stanley P. Wood discovered additional skull and jaw fragments of Spathicephalus in an open-pit mine (the Dora Open Cast Mine) near the town of Cowdenbeath in Fife. Wood found these fossils in a layer of siltstone that is the same age as the ironstone in Loanhead.", "Spathicephalus is an early member of the group Tetrapoda, which includes all four-limbed vertebrates. According to the most recent studies of early tetrapod phylogeny, it belongs to a clade or evolutionary grouping within Tetrapoda called Baphetoidea but lies outside a subgroup of baphetoids called Baphetidae, which form the \"core\" of Baphetoidea. Most recent studies of tetrapod evolutionary relationships find baphetoids to be stem group tetrapods, meaning that they branched off from other tetrapods before the most recent common ancestor of living tetrapods (amphibians, reptiles, birds, and mammals) appeared. Paleontologists recognized that Spathicephalus was a close relative of baphetids ever since D. M. S. Watson first described it in 1929. Two main features link Spathicephalus with baphetids: antorbital fenestrae that have fused with the orbits, and a closed palate formed mostly from a pair of broad pterygoid bones. Watson placed Spathicephalus in Loxommatidae, a family he had named twelve years earlier to include what are now called baphetids. Although the name Baphetidae has existed since 1865 and takes precedence over Loxommatidae, paleontologists referred to these tetrapods as loxommids throughout much of the twentieth century. In a 1947 review of early tetrapods, paleontologist Alfred Romer called Spathicephalus \"a grotesque type of loxommid,\" considering its unusual skull to be evidence of a primitive position within the group."]}, {"page": "Eunotosaurus", "response": ["Eunotosaurus was named in 1892, but it was not until 1914 that it was proposed to be an ancestor of Chelonia, the turtle order. English zoologist D. M. S. Watson claimed that Eunotosaurus was transitional between cotylosaurs (now referred to as captorhinids) and Chelonia. He compared it to \"Archichelone\", a name he devised for a hypothetical chelonian ancestor, noting that its ribs appeared to be intermediate between those of turtles and other tetrapods. Watson's \"Archichelone\" had a pelvic girdle that was pushed back on the vertebral column and placed under the shell. However, fossils of Eunotosaurus show that the pelvis is in the normal tetrapod position and is placed over the ribs rather than within them, as in modern turtles. Many fossils have been found showing a semi-rigid, turtle-like rib cage, one which presumably necessitated a tortoise-like fashion of walking."]}, {"page": "Sthenarosaurus", "response": ["Sthenarosaurus (meaning \"strong lizard\") is an extinct genus of rhomaleosaurid pliosauroid discovered in the Toarcian-aged 'Main Alum Shale' (Commune subzone of Bifrons zone)Sepkoski, Jack Sepkoski's Online Genus Database – Cephalopoda in Whitby, England. The type species, S. dawkinsi, was named and described in 1909.D. M. S. Watson. 1909. IV. A preliminary note on two new genera of upper Liassic plesiosaurs. Memoirs and Proceedings of the Manchester Literary and Philosophical Society 54(4):1-28 The type specimen is MMUM LL 8023, a set of postcrania discovered in Whitby. Other indeterminate specimens are known, including a pectoral girdle (pictured in taxobox) described in 1911."]}, {"page": "David M. S. Watson", "response": ["#REDIRECT D. M. S. Watson"]}, {"page": "Broomia", "response": ["Broomia is an extinct genus of millerettid parareptile from the Middle Permian (Capitanian stage) of South Africa. It was originally described by D. M. S. Watson."]}, {"page": "Akidnognathidae", "response": ["The first family-level name used to classify an akidnognathid was Euchambersidae, erected by South African paleontologist Lieuwe Dirk Boonstra in 1934 for the genus Euchambersia. In 1940, German paleontologist Friedrich von Huene changed the spelling of the name to Euchambersiidae, the correct form of Latin. Akidnognathidae was first named in 1954 by South African paleontologists Sidney H. Haughton and A. S. Brink. It included several therocephalians still recognized as akidnognathids as well as several now classified as scylacosaurids. English and American paleontologists D. M. S. Watson and Alfred Romer moved many of these therocephalians into the family Whaitsiidae in 1956, although many were moved back to Akidnognathidae in later years. Whaitsiids and akidnognathids are similar in appearance, leading some paleontologists to propose placing them in a superfamily called Whaitsioidea. Moschorhinidae was erected as another name for the family in 1974, and Annatherapsididae was proposed in 1975. Three subfamilies were also proposed in 1975: Annatherapsidinae, Moschorhininae and Euchambersiinae. While the name Euchambersiidae may have priority over Akidnognathidae because it was named first, Akidnognathidae is currently considered the valid name because it is based on the first named genus of the group, Akidnognathus (Akidnognathus was named in 1918 while Euchambersia was named in 1931)."]}, {"page": "Baurioidea", "response": ["Baurioidea is a superfamily of therocephalian therapsids. It includes advanced therocephalians such as Regisaurus and Bauria. The superfamily was named by South African paleontologist Robert Broom in 1911. Bauriamorpha, named by D. M. S. Watson and Alfred Romer in 1956, is a junior synonym of Bauriodea."]}]}}