{"wiki_id": "http://www.wikidata.org/entity/Q1176187", "itemLabel": "David Priestland", "itemDescription": "British historian", "wikipedia_url": "https://en.wikipedia.org/wiki/David_Priestland", "wikipedia_page": {"main": "David Priestland is a British historian. He teaches modern history at the University of Oxford and is Fellow of St Edmund Hall.", "link_mentions": [{"page": "People's war", "response": ["Historian David Priestland dates the beginning of the policy of people's war to the publication of a \"General Outline for Military Work\" in May 1928, by Chinese Central Committee.  This document established official military strategies to the Chinese Red Army during the Chinese civil war."]}, {"page": "History of communism", "response": ["The historical existence of the Communist International (Comintern) and the broader communist movement is divided among periods, regarding changes in the general policy it followed.Richard Pipes, Communism: A History (2003)David Priestland, The Red Flag: A History of Communism (2010).Robert Service, Comrades: Communism: A World History (2011).Duncan Hallas, The Comintern: The History of the Third International (1985).S. A. Smith, ed. The Oxford Handbook of the History of Communism (2014). Ch. 10 on Comintern."]}, {"page": "Dictatorship of the proletariat", "response": ["In the 20th century, Vladimir Lenin developed Leninism—the adaptation of Marxism to the socio-economic and political conditions of Imperial Russia (1721–1917). This body of theory later became the official ideology of some Communist states. Lenin wrote that the  Marxist concept of dictatorship meant an entire societal class holds political and economic control, within a democratic system. Lenin argued for the destruction of the foundations of the bourgeois state and its replacement with what David Priestland described as an \"ultra-democratic\" dictatorship of the proletariat based on the Paris Commune's system."]}, {"page": "Soviet democracy", "response": ["The first soviets, also called workers' councils, were formed after the Russian Revolution of 1905. Vladimir Lenin and the Bolsheviks saw the soviet as the basic organizing unit of society in a socialist system and at first supported this form of democracy. The soviets also played a considerable role in the February and October Revolutions. At that time, they represented a variety of socialist parties in addition to Bolsheviks. According to the official Soviet historiography, the first soviet was formed in May 1905 in Ivanovo (north-east of Moscow) during the 1905 Russian Revolution (Ivanovsky Soviet). In his memoirs, the Russian anarchist Volin claims that he witnessed the beginnings of the St Petersburg Soviet in January 1905. The Russian workers were largely organized at the turn of the 20th century, leading to a government-sponsored trade union leadership. In 1905, as the Russo-Japanese War (1904-1905) increased the strain on Russian industrial production, the workers began to strike and rebel. The soviets represented an autonomous workers' movement, one that broke free from the government's oversight of workers' unions. Soviets sprang up throughout the industrial centers of Russia, usually organized at the factory level. The soviets disappeared after the Revolution of 1905, but re-emerged under socialist leadership during the Russian Revolution. Lenin argued for the destruction of the foundations of the bourgeois state and its replacement with what David Priestland described as an \"ultra-democratic\" dictatorship of the proletariat based on the Paris Commune's system."]}, {"page": "Titles of distinction awarded by the University of Oxford", "response": ["* David Priestland, Professor of Modern History"]}, {"page": "The Dawn of Everything", "response": ["While wondering whether a book that “hypothesizes confidently in the face of scant or confusing evidence, can be trusted”, historian Daniel Immerwahr described the book as “a work of dizzying ambition”. Andrew Anthony accused the authors of \"cherrypicking\" but said the authors persuasively replace \"the idea of humanity being forced along through evolutionary stages with a picture of prehistoric communities making their own conscious decisions of how to live.\" Historian David Priestland argued that Peter Kropotkin had more powerfully addressed the sorts of questions that a persuasive case for modern-day anarchism should address. However, Priestland lauded the authors' historical \"myth-busting\" and called it \"an exhilarating read\"."]}]}}