{"wiki_id": "http://www.wikidata.org/entity/Q1179802", "itemLabel": "Henry Cockburn", "itemDescription": "English footballer (1921-2004)", "wikipedia_url": "https://en.wikipedia.org/wiki/Henry_Cockburn_(footballer)", "wikipedia_page": {"main": "Henry Cockburn (14 September 1921 – 2 February 2004) was an English professional footballer, who played league football for Manchester United, Bury and Peterborough United. He represented England at international level, playing 13 times for his country. He also played once for the England B team.\nBorn in Ashton-under-Lyne, Lancashire, Cockburn attended Stamford High School and began his football career as a forward with Goslings FC in the early 1940s. He joined Manchester United in 1943, turning professional in August 1944. However, because of the Second World War, he had to wait until 1946 for his league debut, by which time he had been converted into a wing half. He also made his England debut against Northern Ireland that year.\nWith United, Cockburn won the 1948 FA Cup and the 1952 league title. He left United in October 1954, joining Bury where he ended his league career after two seasons. He subsequently played for Peterborough United, Corby Town and Sankey's.\nAfter retiring as a player, Cockburn later worked as assistant trainer at Oldham Athletic and assistant and then senior coach at Huddersfield Town. It was whilst at Huddersfield Town in the 1960s that Henry was to be a major influence on future Wolves record appearance maker, Derek Parkin.\nDuring the 1960s, Cockburn played cricket for Ashton Cricket Club, usually fielding at cover.", "link_mentions": [{"page": "Duncan Edwards", "response": ["The 1953–54 season saw Edwards emerge as a semi-regular player in the United first team. After impressing in a friendly against Kilmarnock he replaced the injured Henry Cockburn for the away match against Huddersfield Town on 31 October 1953,McCartney, pp. 25–26. and went on to appear in 24 league matches as well as United's FA Cup defeat to Burnley. Nonetheless he was also still an active part of the youth squad and played in the team which won the Youth Cup for the second consecutive season. He made his first appearance for the national under-23 team on 20 January 1954 in Italy,McCartney, p. 30. and was considered for inclusion in the full England team, but on the day when the selection committee watched him in action, against Arsenal on 27 March, he gave a poor performance and was not called up.McCartney, pp. 34–36."]}, {"page": "Henry Cockburn", "response": ["Henry Cockburn may refer to:", "* Henry Cockburn (bishop) (died 1476), Scottish prelate, Bishop of Ross", "* Henry Cockburn, Lord Cockburn (1779–1854), Scottish judge and author", "* Henry Cockburn (consul) (1859-1927), British Consul, grandson of the above", "* Henry Cockburn (footballer) (1921–2004), English international football player"]}, {"page": "Cockburn (surname)", "response": ["*Henry Cockburn (bishop) (died 1476), 15th century Scottish bishop", "*Henry Cockburn (consul) (1859–1927), British consul", "*Henry Cockburn (footballer), English (soccer) footballer"]}, {"page": "1948 FA Cup Final", "response": ["|LH ||6 || Henry Cockburn"]}, {"page": "1947–48 Manchester United F.C. season", "response": ["|align=\"left\"|HB||align=\"left\"| Henry Cockburn"]}, {"page": "1951–52 Manchester United F.C. season", "response": ["|align=\"left\"|HB||align=\"left\"| Henry Cockburn"]}, {"page": "1952–53 Manchester United F.C. season", "response": ["|align=\"left\"|HB||align=\"left\"| Henry Cockburn"]}, {"page": "Deaths in February 2004", "response": ["*Henry Cockburn, 82, English footballer."]}, {"page": "1946–47 Manchester United F.C. season", "response": ["|align=\"left\"|HB||align=\"left\"| Henry Cockburn"]}, {"page": "1948–49 Manchester United F.C. season", "response": ["|align=\"left\"|HB||align=\"left\"| Henry Cockburn"]}]}}