{"wiki_id": "http://www.wikidata.org/entity/Q117345", "itemLabel": "Barbara Euphan Todd", "itemDescription": "British writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Barbara_Euphan_Todd", "wikipedia_page": {"main": "Barbara Euphan Todd (9 January 1890 – 2 February 1976) was an English writer widely remembered for her ten books for children about a scarecrow called Worzel Gummidge. These were adapted for radio and television. The title story was chosen as the first in the new publisher's series Puffin Books.", "link_mentions": [{"page": "List of English-language poets", "response": ["*Barbara Euphan Todd (1890–1976, E)"]}, {"page": "Jon Pertwee", "response": ["After a stint between 1974 and 1978 as the host of the Thames Television murder-mystery game show Whodunnit?, Pertwee took the starring role in Worzel Gummidge, based on the books written by Barbara Euphan Todd. Produced by ITV franchise contractor Southern Television in the initial run, it was first transmitted on ITV from 1979. Pertwee had first been approached to play the part of  Worzel Gummidge in a film to be written by Keith Waterhouse and Willis Hall. When this project fell through Pertwee encouraged the writers to create a television pilot instead and via his agent pitched the idea to the BBC who turned it down and then Thames Television who likewise passed on the project. Pertwee later admitted that he \"began to lose faith in the project\", until Southern Television's Lewis Rudd heard about it and enthusiastically agreed that the company would make the series. "]}, {"page": "List of children's literature writers", "response": ["*Barbara Euphan Todd (1890–1976) – Worzel Gummidge series"]}, {"page": "1936 in literature", "response": ["*Barbara Euphan Todd – Worzel Gummidge (first in the Worzel Gummidge series of eleven books)"]}, {"page": "1941 in literature", "response": ["**Penguin Books publishes in the U.K. the first story book in its Puffin Books children's paperback imprint: Worzel Gummidge by Barbara Euphan Todd. The series editor is Eleanor Graham."]}, {"page": "1976 in literature", "response": ["*February 2 – Barbara Euphan Todd, English children's writer (born 1890)"]}, {"page": "1890 in literature", "response": ["**Barbara Euphan Todd, English children's writer (died 1976)"]}, {"page": "Worzel Gummidge", "response": ["Worzel Gummidge is a walking, talking scarecrow character in British children's fiction, who originally appeared in a series of books by the English novelist Barbara Euphan Todd.\"Worzel Gummidge (1979–81)\" ScreenOnline.org.uk It was the first story book published by Puffin Books.Daniel Hahn (2015). \"The Oxford Companion to Children's Literature\". p. 479. Oxford University Press", "Worzel Gummidge is a 2019 British TV fantasy miniseries, and an adaptation of the Worzel Gummidge series by Barbara Euphan Todd. It stars Mackenzie Crook, who also wrote and directed the series, as a magical scarecrow. It was produced by Leopard Pictures (part of the Argonon Group) and was broadcast by BBC One on 26 and 27 December 2019."]}, {"page": "Culture of the United Kingdom", "response": ["A pioneer of children's publishing, John Newbery made children's literature a sustainable and profitable part of the literary market.Matthew O Grenby (2013). \"Little Goody Two-Shoes and Other Stories: Originally Published by John Newbery\". p. vii. Palgrave Macmillan The History of Little Goody Two-Shoes was published by Newbery in 1765. Founded by Sir Allen Lane in 1935, Penguin Books revolutionised publishing in the 1930s through its inexpensive paperbacks, bringing high-quality paperback fiction and non-fiction to the mass market. Formed in 1940, Puffin Books is the children's imprint of Penguin Books. Barbara Euphan Todd's scarecrow story, Worzel Gummidge, was the first Puffin story book in 1941.Daniel Hahn (2015). \"The Oxford Companion to Children's Literature\". p. 479. Oxford University Press"]}, {"page": "Penguin Books", "response": ["Aircraft Recognition (S82) by R. A. Saville-Sneath, was a bestseller. In 1940, the children's imprint Puffin Books began with a series of non-fiction picture books; the first work of children's fiction published under the imprint was Barbara Euphan Todd's Worzel Gummidge the following year. Another series that began in wartime was the Penguin Poets: the first volume was a selection of Tennyson's poems (D1) in 1941. Later examples are The Penguin Book of Modern American Verse (D22), 1954, and The Penguin Book of Restoration Verse (D108), 1968. J. M. Cohen's Comic and Curious Verse appeared in three volumes over a number of years."]}, {"page": "Donnington, Berkshire", "response": ["*Barbara Euphan Todd (1890–1976), author of the Worzel Gummidge series of stories for children, died at Donnington."]}, {"page": "Blewbury", "response": ["In the 20th century the village attracted a number of notable artists and writers. Writers have included Elizabeth Ferrars, Alt URL Dick Francis (from 1954 to 1980), Kenneth Grahame, Marguerite Steen,\"Who Was Who: 1971–1980\", London, A. & C. Black GB Stern, Barbara Euphan Todd and Ben Fergusson.  Artists have included William Nicholson,Sophie Bowness (2004). Nicholson, Sir William Newzam Prior (1872–1949). Oxford Dictionary of National Biography (online edition). Oxford University Press. . father of abstract painter Ben Nicholson, illustrator Susan Beatrice « Twissie » Pearse children's book illustrator, including Amelia Anne series, H Davis Richter known for much-reproduced interiors and Eli Marsden Wilson. The tradition continues, and keen amateur artists receive direction from the professional artists Roy East and Ron Freeborn. The village used to have an art gallery devoted to the work of local artists."]}, {"page": "Mass media in the United Kingdom", "response": ["A pioneer of children's publishing, John Newbery made children's literature a sustainable and profitable part of the literary market.Matthew O Grenby (2013). \"Little Goody Two-Shoes and Other Stories: Originally Published by John Newbery\". p. vii. Palgrave Macmillan The History of Little Goody Two-Shoes was published by Newbery in 1765. Founded by Sir Allen Lane in 1935, Penguin Books revolutionised publishing in the 1930s through its inexpensive paperbacks, bringing high-quality paperback fiction and non-fiction to the mass market. Formed in 1940, Puffin Books is the children's imprint of Penguin Books. Barbara Euphan Todd's scarecrow story, Worzel Gummidge, was the first Puffin story book in 1941.Daniel Hahn (2015). \"The Oxford Companion to Children's Literature\". p. 479. Oxford University Press"]}, {"page": "Aunt Sally", "response": ["* An Aunt Sally literally going by the name of 'Aunt Sally' is a major character in Barbara Euphan Todd's Worzel Gummidge books and subsequent TV series adaptations."]}, {"page": "Puffin Books", "response": ["Four years after Penguin Books had been founded by Allen Lane, the idea for Puffin Books was hatched in 1939, when Noel Carrington, at the time an editor for Country Life books, met him and proposed a series of children's non-fiction picture books, inspired by the brightly coloured lithographed books mass-produced at the time for Soviet children.The History of PuffinPuffin Picture Books, Stella & Rose's Books Lane saw the potential, and the first of the picture book series were published the following year. The name \"Puffin\" was a natural companion to the existing \"Penguin\" and \"Pelican\" books. Many continued to be reprinted right into the 1970s. A fiction list soon followed, when Puffin secured the paperback rights to Barbara Euphan Todd's 1936 story Worzel Gummidge and brought it out as the first Puffin story book in 1941.Daniel Hahn, The Oxford Companion to Children's Literature (Oxford: OUP, 2015), p. 479."]}, {"page": "St Catherine's School, Bramley", "response": ["* Barbara Euphan Todd – children's writer"]}, {"page": "Todd (surname)", "response": ["* Barbara Euphan Todd, English writer"]}, {"page": "Soberton", "response": ["It is the Soberton of \"Baron Anson of Soberton\", an 18th–19th century peerage. The children's writer Barbara Euphan Todd was brought up there.Book Rags biography: Retrieved 18 June 2012."]}, {"page": "Arksey", "response": ["Arksey is a village in the Metropolitan Borough of Doncaster in South Yorkshire, England. It had an estimated population of 1,303 as of 2010.https://dmbcwebstolive01.blob.core.windows.net/media/Tenant2/Documents/Arksey_tcm33-73641.pdf  It was the birthplace of the children's writer Barbara Euphan Todd on 9 January 1890. Arksey has four satellite hamlets, Shaftholme, Tilts, Almholme and Stockbridge."]}, {"page": "Scarecrow", "response": ["Worzel Gummidge, a scarecrow who came to life in a friendly form, first appeared in series of novels by Barbara Euphan Todd in the 1930s and later in a popular television adaptation."]}, {"page": "Miss Ranskill Comes Home", "response": ["Miss Ranskill Comes Home is a novel by Barbara Euphan Todd. It was first published in 1946, under her married name, Barbara Bower."]}, {"page": "Worzel Gummidge (TV series)", "response": ["Worzel Gummidge is a British television fantasy series, produced by Southern Television for ITV, based on the Worzel Gummidge books by English author Barbara Euphan Todd.\"Worzel Gummidge (1979–81)\" ScreenOnline.org.uk The programme starred Jon Pertwee as the titular scarecrow and Una Stubbs as Aunt Sally. It ran for four series in the UK from 1979 to 1981. On a countdown of the greatest British children's programmes, this series was number 50 in the 50 Greatest Kids TV Shows on Channel 5 on 8 November 2013. Channel 4 reprised the show in 1987 as Worzel Gummidge Down Under, which was set in New Zealand."]}, {"page": "Worzel Gummidge Down Under", "response": ["Worzel Gummidge Down Under is a New Zealand-British television series adapted from the books written by Barbara Euphan Todd and the British fantasy series television programme produced and broadcast in the United Kingdom named Worzel Gummidge, starring Jon Pertwee. The story continued in New Zealand when Aunt Sally was sold to a museum owner."]}, {"page": "Worzel Gummidge Turns Detective", "response": ["Worzel Gummidge Turns Detective is a British children's television series, first aired by the BBC in 1953. It was the first TV manifestation of Barbara Euphan Todd's character who had already appeared on radio and would reappear on television 26 years later."]}, {"page": "Ursula Graham Bower", "response": ["Born in 1914 in England, the daughter of Commander John Graham Bower, RN (1886–1940), Ursula Bower was educated at Roedean School; a shortage of family funds prevented her from finishing her school education and achieving her goal of reading Archaeology at Oxford. Ursula Graham Bower – the Queen of the Nagas, India-north-east.com On her father's remarriage in 1932, Bower became the stepdaughter of children's writer Barbara Euphan Todd, the creator of the fictional scarecrow Worzel Gummidge. In the same year she travelled to Canada."]}, {"page": "List of early Puffin Story Books", "response": ["|PS 1 ||Worzel Gummidge||Barbara Euphan Todd||Elizabeth Alldridge||1941||The scarecrow of Scatterbrook who comes alive", "|PS 30||Worzel Gummidge and Saucy Nancy||Barbara Euphan Todd||John Harwood||1947||A ship's figurehead comes to life", "|PS 37||South Country Secrets||Euphan (Barbara Euphan Todd) and Klaxon||William Grimmond||1947||The South Country's secrets are about smugglers, wishing wells, Roman villas, and such strange things as a wall made of bullock horns. \"Klaxon\" was the pseudonym of Euphan's husband John Graham Bower", "|PS 61||Worzel Gummidge Again||Barbara Euphan Todd||John Harwood|| 1949||Another book about the scarecrow"]}, {"page": "Argonon", "response": ["Crook features in the titular role in Worzel Gummidge, while also writing and directing the series. The miniseries is an adaptation of Barbara Euphan Todd's series of books in which the character Worzel Gummidge, a magical scarecrow, appears. Two one-hour specials aired in December 2019, one in December 2020, and three further one-hour films have been announced for late 2021."]}, {"page": "February 1976", "response": ["*Died: Barbara Euphan Todd, 86, English children's author known for creating \"Worzel Gummidge\""]}, {"page": "List of Jackanory episodes", "response": ["|353|| Worzel Gummidge: Gummidge Goes for a Walk || Barbara Euphan Todd || Gordon Rollings || 17-Jul-67", "|354|| Worzel Gummidge: Gummidge's New Clothes || Barbara Euphan Todd || Gordon Rollings || 18-Jul-67", "|355|| Worzel Gummidge: Aunt Sally || Barbara Euphan Todd || Gordon Rollings || 19-Jul-67", "|356|| Worzel Gummidge: The Battle of the Scarecrows || Barbara Euphan Todd || Gordon Rollings || 20-Jul-67", "|357|| Worzel Gummidge: Gummidge Gives a Party || Barbara Euphan Todd || Gordon Rollings || 21-Jul-67", "|1766|| Worzel Gummidge Again: Scatterbrook Scarecrows || Barbara Euphan Todd || Geoffrey Bayldon || 04-Nov-74", "|1767|| Worzel Gummidge Again: The Caretaker || Barbara Euphan Todd || Geoffrey Bayldon || 05-Nov-74", "|1768|| Worzel Gummidge Again: Guy and Gummidge || Barbara Euphan Todd || Geoffrey Bayldon || 06-Nov-74", "|1769|| Worzel Gummidge Again: Tapioca Pudding || Barbara Euphan Todd || Geoffrey Bayldon || 07-Nov-74", "|1770|| Worzel Gummidge Again: The Christmas Party || Barbara Euphan Todd || Geoffrey Bayldon || 08-Nov-74"]}, {"page": "Worzel Gummidge (2019 miniseries)", "response": ["Worzel Gummidge is a 2019 British TV fantasy mini-series and an adaptation of the Worzel Gummidge books by Barbara Euphan Todd. It stars Mackenzie Crook, who also wrote and directed the series, as the scarecrow. It was produced by Leopard Pictures and was broadcast by BBC One on 26 and 27 December 2019."]}]}}