{"wiki_id": "http://www.wikidata.org/entity/Q1173158", "itemLabel": "Dave Cousins", "itemDescription": "singer, songwriter and musician from England", "wikipedia_url": "https://en.wikipedia.org/wiki/Dave_Cousins", "wikipedia_page": {"main": "Dave Cousins (born David Joseph Hindson; 7 January 1945, in Hounslow, Middlesex, England) is an English singer and songwriter, who has been the leader, singer and most-active songwriter of Strawbs since 1967.", "link_mentions": [{"page": "Grace Darling", "response": ["At Bamburgh, a museum is dedicated to her achievements and the seafaring life of the area.  From 1990-2020 an RNLI Mersey-class lifeboat at Seahouses bore the name Grace Darling. Singer/songwriter Dave Cousins of Strawbs wrote \"Grace Darling\" (on the album Ghosts) in tribute and as a love song. The children's singing group The Limeliters sang a different \"Grace Darling\" (featuring the refrain \"Help, help, came a desperate yelp!\") in their 1962 album, recorded live in concert, Through Children's Eyes. In 2017, Duke Special set Michael Longley's poem \"Grace Darling\" to music and recorded it on the album Hallow. The Grace Darling Hotel, one of the oldest extant hotels in Melbourne, Victoria, opened in 1854."]}, {"page": "Mary Hopkin", "response": ["She continued to do projects of her choosing, working with people such as Julian Colbeck; she wrote the lyrics and performed a song on his CD Back to Bach. Also, there was Marc Cerrone's The Collector, a stage play/opera, for which she performed two songs on the CD and video. She worked again with old friends, the guitarist Brian Willoughby and Dave Cousins (of Strawbs) on their CD The Bridge. She also appeared on a Beatles' tribute album by RAM Pietsch."]}, {"page": "On Through the Night", "response": ["The spoken word intro to \"When the Walls Came Tumbling Down\" was performed by Dave Cousins of Strawbs. Joe Elliott had done the spoken portion in earlier live performances and demo recordings that showed up on some early bootlegs. In his biography, Cousins claims that he did his best Laurence Olivier impersonation for the song's intro.", "*Dave Cousins – voice on \"When the Walls Came Tumblin' Down\""]}, {"page": "Sandy Denny", "response": ["Further recordings were released in 2011, including a German recording of Fotheringay in concert released as Essen 1970 on the Garden of Delights label. The performance was remastered by original band member Jerry Donahue. This release was followed by 19 Rupert Street, a home recording of a rehearsal featuring Sandy and Alex Campbell recorded at his flat in August 1967. This release is notable for the fact that Sandy performs a number of tracks that are not available in any other versions, including a cover of \"Fairytale Lullaby\" by John Martyn. This CD was put out by Sandy's former Strawbs bandmate Dave Cousins on his Witchwood label.", "Since her death, many tributes have been made to Denny, both in music and elsewhere. Dave Pegg of Fairport Convention recorded the tribute \"Song for Sandy\" on his 1983 solo album The Cocktail Cowboy Goes It Alone. Dave Cousins of the Strawbs wrote \"Ringing Down the Years\" in memory of  Denny shortly after her death. Songs more specific to the death were Bert Jansch's \"Where Did My Life Go\" and Richard Thompson's \"Did She Jump or Was She Pushed?\" Fellow Brit folk pioneers Spriguns changed the title of their 1978 album to Magic Lady after hearing of Denny's death while recording.Sleeve notes from the CD release of Mandy Morton and Spriguns, Magic Lady (1994). In 1998, a variety of Daylily was named after her."]}, {"page": "Roger Glover", "response": ["*Dave Cousins – Two Weeks Last Summer (1972)"]}, {"page": "Mungo Jerry", "response": ["With time, Dorset found the group's good-time blues and jug band repertoire a little restricting, and in 1972 he released a solo album Cold Blue Excursion, with his songs backed by strings and brass and, in one instance, a jazz band. His intention to broaden the group's appeal by recruiting a drummer led to King and Earl trying to sack him, but the management, regarding Dorset as inseparable in the public eye from Mungo Jerry, fired them both instead. Dorset and Godfrey, the bassist, recruited new members and presented a new sound, heard on the fourth album Boot Power. Colin Earl and Paul King went on to form The King Earl Boogie Band and recorded an album at Richard Branson's Manor Studios called Trouble at Mill, produced by Dave Cousins of Strawbs. They played together on and off in the years following and ended up with a band called Skeleton Crew."]}, {"page": "Maddy Prior", "response": ["*\"The King\" / \"Ringing Down the Years\" (1980) (with Dave Cousins/Strawbs)"]}, {"page": "Strawbs", "response": ["The Strawbs formed in 1964 as the Strawberry Hill Boys while the founder members were at St Mary's Teacher Training College, Strawberry Hill, London. The name was shortened to 'The Strawbs' for a June 1967 concert in which they wanted to display the band name on stage. Their long-time leader and most active songwriter is guitarist and singer Dave Cousins (guitar, dulcimer, banjo, vocals) (born David Joseph Hindson, 7 January 1945, Hounslow, Middlesex). In the early days Strawbs played with Sandy Denny (later lead singer of Fairport Convention and Fotheringay).", "A reunion on Rick Wakeman's TV show Gas Tank in 1983 resulted in an invitation to reform to headline 1983's Cambridge Folk Festival.  The Grave New World line-up plus Brian Willoughby (who had replaced Lambert when he left in 1978 during the making of Heartbreak Hill, and had also begun a partnership with Dave Cousins as an acoustic duo from 1979 onwards) went on from there to perform occasionally in the UK, US and Europe over the next few years, replacing Weaver with Chris Parren from the Hudson Ford band and Ford himself (when he relocated to the US) with bass player Rod Demick.", "Dave Cousins recorded a new solo album, The Boy in the Sailor Suit, with The Blue Angel Orchestra.  In 2008, he released his third solo album, Secret Paths, with steel guitarist Melvin Duffy.  Along with the album, he toured the US in Spring 2008 (joined by Ian Cutler for the early part of the tour). A concert album from this tour, entitled Duochrome, was released in September 2008.", "*Dave Cousins – vocals, guitar, banjo, dulcimer, autoharp ", "*Dave Cousins – vocals, acoustic guitar, banjo, dulcimer "]}, {"page": "Blót: Sacrifice in Sweden", "response": ["The performance incorporated music by Giuseppe Verdi, Johann Sebastian Bach and Sergei Prokofiev; lyrics from the works of Rudyard Kipling, Friedrich Nietzsche and Henry Wadsworth Longfellow; the voices of Oswald Mosley, Benito Mussolini, and wolves.  Ian Read's \"Seeker\" (originally performed by Fire + Ice) was covered; as well as traditional songs like \"Brian Boru's March\" and Dave Cousins' \"The Hangman And The Papist\"."]}, {"page": "Robert Kirby", "response": ["*Dave Cousins: Two Weeks Last Summer (1972)"]}, {"page": "Psalm 23", "response": ["*1972: Dave Cousins – \"Lay Down\" from the album Bursting at the Seams"]}, {"page": "The Six Wives of Henry VIII (album)", "response": ["*Dave Cousins – electric banjo on \"Catherine Howard\""]}, {"page": "Dominic Behan", "response": ["Dave Cousins of the band Strawbs wrote his song \"Josephine, for Better or for Worse\" in honour of Josephine and Dominic Behan. This song has been recorded several times; the best-known version is on the album Dragonfly by Strawbs in 1970. Bob Dylan's 1963 song \"With God on our Side\" uses the melody and narrative framework of Behan's \"The Patriot Game\", as well as being influenced by its theme. The melody, as Behan admitted during a correspondence in The Guardian with Michael Grosvenor Myer, was actually derived and adapted from a version of the traditional song known as \"The Nightingale\", \"The Grenadier and the Lady\", \"The Month of May\", though had been significantly changed in both tempo and mood to serve the narrative of the song the Patriot Game."]}, {"page": "Terry St Clair", "response": ["His second album, From the Little Back Room was released in 1991, having taken eighteen months to record. The production and arrangements using electronic sequencing and samples were all completed by St Clair. In 1994 St Clair recorded Basically... Terry St. Clair, his first completely acoustic album. In 1997 St Clair was approached by an American record label, to record a new album in New York City, although the deal ultimately fell through. At this time st Clair performed in the United States for the first time. St Clair was introduced to music journalist John Tobler by Dave Cousins of the Strawbs."]}, {"page": "John Hawken", "response": ["At his audition for the Strawbs, Dave Cousins introduced Hawken to the mellotron. The band consisted of Cousins (singer-songwriter), Dave Lambert (guitar), Chas Cronk (bass), Rod Coombes (drums) and Hawken on keyboards. Tours included the US, Japan and Europe. During Hawken's tenure with the band (1973–1975) they released two albums, Hero and Heroine and Ghosts."]}, {"page": "Nick Awde", "response": ["November 2008 saw the first MelloFest take place at the Fiddler's Elbow in Kentish Town, London. Organised by Awde, MelloFest One featured two Mellotrons onstage along with discussions and live Mellotron-inspired music from guests, plus the official launch of Awde's book Mellotron. Talking about their music and in some cases also playing it were: David Cross (King Crimson), Nick Magnus (Steve Hackett Band), Martin Orford (IQ), Jakko Jakszyk (21st Century Schizoid Band/Tangent/Level 42), Dave Cousins (Strawbs) & Robert Kirby (Strawbs/Nick Drake/Paul Weller), Robert Webb (England) and Tony Clarke, producer of the Moody Blues."]}, {"page": "John Ford (musician)", "response": ["After playing in various bands, Ford's unusual percussive style of bass playing caught the eye of Strawbs' leader Dave Cousins during a performance at Cousins' folk club in Hounslow. He joined Strawbs in May 1970, and Ford's influence on the band, primarily known as a folk rock group, shifted them into a new direction in the progressive / art rock scene. Ford penned songs such as \"Heavy Disguise\" and \"Part of the Union\", Strawbs' biggest chart hit, whilst working with David Bowie/T. Rex producer Tony Visconti on A&M Records."]}, {"page": "Sonja Kristina", "response": ["In 1968, Kristina auditioned for and won the part of \"Crissy\" in the London stage production of the stage musical Hair. She features on the original cast album singing the song \"Frank Mills\", also released as a single. She also briefly sang with The Strawbs, following the departure of Sandy Denny. Dave Cousins remembered:  Cousins eventually published the book, called The Bruising of Hearts, The Losing of Races, in 1993. It included a poem \"Silver Smile\", written for Kristina in the late 1960s."]}, {"page": "Chris Tsangarides", "response": ["In February 2012, Tsangarides announced details of a new record label Dark Lord Records formed with The Strawbs frontman Dave Cousins.  The first release on the new label was Normalityville Horror by Spit Like This on 21 May.", "* Dave Cousins"]}, {"page": "John Young (British musician)", "response": ["Young has worked as keyboard player with The Strawbs on their November/December 2010 Canada/UK tour, alongside Dave Cousins, Dave Lambert, Chas Cronk, and Tony Fernandez."]}, {"page": "Ric Sanders", "response": ["Over the years Sanders has worked with Rick Wakeman, Dave Cousins of Strawbs, Jethro Tull, Robert Plant, Roy Harper, Gary Brooker of Procol Harum, Pentangle, Gordon Giltrap, Andrew Cronshaw, June Tabor, Martin Simpson, Charlie Landsborough, All About Eve, The Mission, Fred Thelonious Baker, Catherine Howe and John Etheridge (guitarist with Soft Machine and Stéphane Grappelli) with whom he co-led the group 2nd Vision.", "* Rick Wakeman and Dave Cousins: Hummingbird (2002)"]}, {"page": "Paul King (Mungo Jerry)", "response": ["He and the group's keyboard player Colin Earl (born 6 May 1942, Hampton) formed the King Earl Boogie Band with guitarist Dave Lambert, bassist Russell John Brown and washboard player Joe Rush, who had been a part-time Mungo Jerry member. Their album Trouble at Mill, produced by Dave Cousins of Strawbs, was well reviewed, but a single, \"Plastic Jesus\", was banned by the BBC on grounds of blasphemy. The group disbanded a few months later, and Lambert later joined Strawbs."]}, {"page": "Intergalactic Touring Band", "response": ["* Dave Cousins: Lead vocal on \"Heartbreaker\""]}, {"page": "Fire (band)", "response": ["Fire was a late 1960s/early 1970s band that consisted of Dave Lambert (who later joined Strawbs), Bob Voice and Dick Dufall (Paul Brett Sage). Brett himself joined them for their now classic Magic Shoemaker LP recorded at Pye Studios London, in 1970. This vinyl LP has been in the UK's top 10 of collectable vinyl, being listed in Millers Antique Collectable guide. A 2008 archival release, The Magic Shoemaker Live, features live recordings of the original Fire line up, plus Paul Brett and Dave Cousins (Strawbs), with Ray Hammond as the narrator."]}, {"page": "From the Witchwood", "response": ["*Dave Cousins – lead vocals, backing vocals, acoustic guitar, electric guitar, dulcimer, banjo, recorder"]}, {"page": "Just a Collection of Antiques and Curios", "response": ["The band line-up had changed from the previous album, Dragonfly. Only founder-members Dave Cousins and Tony Hooper remained; with double bass player Ron Chesterman and cellist Claire Deniz having departed the band, and bassist John Ford, drummer Richard Hudson, and keyboardist Rick Wakeman having joined.", "#\"Martin Luther King's Dream\" (Dave Cousins) – 2:53", "*Dave Cousins – vocals, acoustic guitar, electric guitar, dulcimer"]}, {"page": "Dragonfly (Strawbs album)", "response": ["*Dave Cousins – Vocals, Acoustic guitar, Dulcimer, Chinese piano, Percussion"]}, {"page": "Grave New World", "response": ["#\"Benedictus\" (Dave Cousins) – 4:24", "\"I'm Going Home\" originally appeared on Dave Cousins's solo album Two Weeks Last Summer. This track is the first occasion on which Dave Lambert recorded with the band. He had occasionally been appearing on stage for encores, but after this album and the departure of Tony Hooper, Lambert joined the band full-time.", "*Dave Cousins – lead vocals, backing vocals, acoustic guitar, electric guitar, dulcimer, recorder", "Produced by Dave Cousins, Richard Hudson, John Ford, Blue Weaver and Tony Hooper"]}, {"page": "Bursting at the Seams", "response": ["#\"Flying\" (Dave Cousins) – 4:49", "*Dave Cousins – lead vocals, backing vocals, acoustic guitar, electric guitar, banjo"]}, {"page": "Hero and Heroine", "response": ["After the tour supporting the previous album, Bursting at the Seams (1973), there was an acrimonious  split leaving only Dave Cousins and Dave Lambert to rebuild the band. John Hawken of The Nashville Teens and Renaissance on keyboards, Chas Cronk on bass and Rod Coombes on drums from Juicy Lucy and Stealers Wheel completed the line-up.  The new line-up gelled very quickly and studio sessions were very productive. The album was released first in the US to a warm reception, and then in the UK where reviews were less positive. The album only reached number 35 on the UK Album ChartsUK Top 40 database  . everyHit.com. retrieved December 16, 2008 and the band increasingly began to look to North America for a successful future.", "*Dave Cousins – lead vocals, backing vocals, acoustic guitar, electric guitar", "*Dave Cousins, Tom Allom – Producers"]}, {"page": "Ghosts (Strawbs album)", "response": ["#\"Ghosts\" (Dave Cousins) – 8:31", "*Dave Cousins – lead vocals, backing vocals, acoustic guitar, electric guitar, recorder"]}, {"page": "Nomadness", "response": ["#\"To Be Free\" (Dave Cousins) – 4:17", "*Dave Cousins – lead vocals, (Side 1: tracks 1, 3, 4. Side 2: 1, 2 4, 5) backing vocals, acoustic guitar, dulcimer, banjo"]}, {"page": "Deep Cuts (Strawbs album)", "response": ["#\"I Only Want My Love to Grow in You\" (Dave Cousins, Chas Cronk) – 3:00", "*Dave Cousins – lead vocals, backing vocals, acoustic guitar"]}, {"page": "Richard Hudson (musician)", "response": ["Richard Hudson was a member of Elmer Gantry's Velvet Opera, in which he played drums and sitar and sang. In 1970, he and band-mate John Ford joined Strawbs. Hudson and Ford began to co-write material which appeared to be aiming in a slightly different direction to the compositions of Strawbs' main writer, Dave Cousins. In 1973 after a 52-date tour to promote the album Bursting at the Seams, there were acrimonious exchanges (which both parties now regret). Hudson and Ford left to form Hudson Ford. Hudson at this point switched from playing drums to guitar and sang more lead vocals."]}, {"page": "Burning for You", "response": ["The producer of the album Jeffrey Lesser was, according to songwriter/singer Dave Cousins, \"...a great engineer but didn't understand the dynamics of the band\".Cousins, David \"Deadlines\" CD production notes, Witchworks Media, 2007 The album was intended to be the final one by the band but Cousins was persuaded to carry on when he met with Clive Davis of Arista Records.Cousins, David \"Deadlines\" CD production notes, Witchworks Media, 2007 The final track here \"Goodbye\" was meant to be his final word on his career leading the band.Cousins, David \"Deadlines\" CD production notes, Witchworks Media, 2007", "#\"Burning for Me\" (Dave Cousins, John Mealing) – 4:01", "*Dave Cousins – vocals (1–10) (lead vocals 1, 2, 4, 5, 6, 10)  acoustic guitar (2–4, 6–8)"]}, {"page": "Deadlines (Strawbs album)", "response": ["#\"No Return\" (Dave Cousins, Dave Lambert) – 4:57", "Signed to Arista Records by his management team, Dave Cousins was persuaded by label head Clive Davis to record a new Strawbs album. Cousins had intended \"Burning For You\" to be the last album by the band. Cousins management also insisted that the band work with producer Jeffrey Lesser despite the fact that Cousins felt that Lesser didn't \"understand the dynamics\" of the band. Spending a night out with Davis, Cousins was charmed by the label head and, despite his misgivings, returned to the studio to make the band's final album of the 1970s. Lesser insisted that guitarist/singer Dave Lambert be the lead singer for the album.Cousins, David Sleeve notes expanded \"Deadlines\", 2012 Witchwork Media", "*Dave Cousins – lead vocals, backing vocals, acoustic guitar"]}]}}