{"wiki_id": "http://www.wikidata.org/entity/Q1173108", "itemLabel": "Dave Bassett", "itemDescription": "English footballer and manager (born 1944)", "wikipedia_url": "https://en.wikipedia.org/wiki/Dave_Bassett", "wikipedia_page": {"main": "David Thomas Bassett (born 4 September 1944 in Stanmore) is an English football manager and a former player. During his career he has managed Wimbledon, Watford, Sheffield United, Crystal Palace, Nottingham Forest, Barnsley, Leicester City and Southampton.", "link_mentions": [{"page": "September 4", "response": ["*  1944   – Dave Bassett, English footballer and manager"]}, {"page": "Brighton & Hove Albion F.C.", "response": ["The sale of the Goldstone Ground went through in 1997, leading to Brighton having to play some 70 miles away at Gillingham's Priestfield stadium for two seasons. Micky Adams was appointed Brighton's manager in 1999. For the start of the 1999–2000 season the Seagulls secured a lease to play home games at Withdean Stadium, a converted athletics track in Brighton owned by the local council. 2000–01 was Brighton's first successful season for 13 years. They were crowned champions of Division Three and promoted to Division Two. Adams left in October 2001 to work as Dave Bassett's assistant at Leicester, being replaced by former Leicester manager Peter Taylor. The transition proved to be a plus point for Brighton, who maintained their good form and ended the season as Division Two champions – winning a second successive promotion. Just five years after almost succumbing to the double threat of losing their Football League status and going out of business completely, Brighton were one division away from the Premier League."]}, {"page": "Watford F.C.", "response": ["Following Taylor's departure, Wimbledon manager Dave Bassett was appointed as his replacement, and England winger John Barnes was sold to Liverpool. After 4 wins from his opening 23 league fixtures, Bassett was sacked in January 1988. Watford were bottom of the First Division at the time of his departure, and Steve Harrison could not prevent relegation at the end of the season. In 1988–89, Harrison's Watford failed to return to the First Division, after defeat in the Second Division play-offs. The under-18 team won the FA Youth Cup, beating Manchester City 2–1 after extra time, with future England international David James in goal for the Hornets. Harrison departed in 1990, and over the next few years, the closest Watford came to promotion was a seventh-placed finish in Division One in the 1994–95 season. However, in the following season – Glenn Roeder's third as manager – Watford struggled. Despite the return of Graham Taylor as caretaker manager in February 1996, the club was relegated to Division Two.", "Graham Taylor took charge of Watford in 1977. He led the club to promotion to the Third Division in 1978, the Second Division in 1979, and the First Division for the first time in Watford's history in 1982. After a second-placed finish in the First Division in 1983, Watford competed in European competition for the first time in 1983–84, as well as reaching the 1984 FA Cup final. Taylor left the club at the end of 1986–87. Under the six subsequent permanent managers (Dave Bassett, Steve Harrison, Colin Lee, Steve Perryman, Glenn Roeder and Kenny Jackett), Watford slid from 9th in the top tier in 1987, to 13th in the third tier in 1997. Taylor returned as manager for the start of the 1997–98 season. He led the club to consecutive promotions, but could not prevent relegation from the Premier League in 1999–2000. Since Taylor's retirement in 2001, Watford have had twelve managers. Of these, Aidy Boothroyd took Watford back to the Premier League in 2006, but Watford were relegated in 2007, and Boothroyd departed in 2008.\"Boothroyd & Watford part company\". BBC Sport. 3 November 2008. Retrieved 14 July 2012."]}, {"page": "Stanmore", "response": ["*Dave Bassett, football coach, was born in Stanmore."]}, {"page": "Nottingham Forest F.C.", "response": ["===Stuart Pearce and Dave Bassett (1997–1999)===", "34-year-old captain Stuart Pearce was installed as player-manager on a temporary basis just before Christmas in 1996 and he inspired a brief upturn in the club's fortunes. However, in March 1997 he was replaced on a permanent basis by Dave Bassett and left the club that summer after 12 years. Forest were unable to avoid relegation and finished the season in bottom place. They won promotion back to the Premier League at the first attempt, being crowned Division One champions in 1997–98. Bassett was sacked in January 1999, with Ron Atkinson replacing him.", "|align=left| Dave Bassett"]}, {"page": "2001–02 FA Premier League", "response": ["Leicester City was the first team officially relegated from the Premiership, finishing bottom of table with just five Premiership wins in their last season at 111-year-old Filbert Street before relocation to the new 32 000-seat Walkers Stadium. The club went through the regime of two managers during the season – Peter Taylor was replaced by Dave Bassett in early October; six months later Bassett joined the club's board to be replaced by former assistant manager Micky Adams.", "| Dave Bassett", "| Dave Bassett"]}, {"page": "Leicester City F.C.", "response": ["Taylor was sacked after a poor start to the 2001–02 season, and his successor Dave Bassett lasted just six months before being succeeded by his assistant Micky Adams, the change of management being announced just before relegation was confirmed. Leicester won just five league matches all season.", "Leicester have had a total of nine permanent secretary/managers and 36 permanent managers (not including caretakers). Nigel Pearson and Peter Hodge have both had two separate spells in charge of the club. Dave Bassett also had a second spell as caretaker manager after his spell as permanent manager."]}, {"page": "Sheffield United F.C.", "response": ["They fell back into the Third Division in 1988, but new manager Dave Bassett masterminded a quick revival which launched the Blades towards one of the most successful eras in their history. Successive promotions in the aftermath of the 1988 relegation saw them return to the First Division in 1990 after a 14-year exile. They survived at this level for four seasons (being founder members of the new Premier League in 1992 after peaking with a ninth-place finish in the last season of the old First Division) and reached an FA Cup semi-final in the 1992–93 season before being relegated in 1994.", "With a new ambitious board in place United recruited Ian Porterfield as manager in June 1981. He had an immediate impact, winning the Division Four championship in his first season and taking the club back into the second tier two years later on a meagre budget. Despite this many fans were unhappy with the style of football and odd team selections and Porterfield was sacked in 1986 following supporter protests. Coach Billy McEwan was promoted to the position of manager but failed to improve the standard of play and with attendances falling and the team in danger of relegation once more he was sacked in January 1988. United now turned to the colourful character of Dave Bassett who had most recently had a short, unsuccessful spell as manager of Watford. It was to prove an astute appointment as although he could not prevent relegation in his first season he built a solid, hard working team on a small budget and won back to back promotions, returning the club to the top flight and achieving regular mid-table finishes. With the formation of the Premier League United's old financial problems and willingness to sell star players without replacing them meant the side eventually succumbed to relegation and when an immediate return was not forthcoming Basset was sacked in December 1995."]}, {"page": "AFC Wimbledon", "response": ["As part of WISA's campaign to try and reclaim the history of Wimbledon Football Club, the Wimbledon Old Players Association (WOPA) was formed in 2005. Membership of WOPA is open to all former Wimbledon F.C. and AFC Wimbledon players and managers. Among the sixty founding members were Glenn Mulcaire, who scored AFC Wimbledon's first ever goal in 2002 and Kevin Cooper, who remains the club's all-time highest goal scorer with 107 goals between August 2002 and May 2004, as well as retaining the title for the most goals scored in a season with 66 during 2003–04. Others that joined included some of the legends of the old Wimbledon F.C. such as John Fashanu, Dave Beasant, Efan Ekoku, Neil Sullivan, Dave Bassett, Wally Downes, Marcus Gayle, Neal Ardley, Alan Kimble, Andy Thorn, Roger Joseph, Dickie Guy, Allen Batsford, Roger Connell, Ian Cooke, Roy Law and Steve Galliers.A club is born, Will Buckley, The Guardian, 14 July 2002 On 16 July 2006, WOPA fielded a team in the Masters Football Tournament at Wembley Arena, with AFC Wimbledon's backing. The team included Carlton Fairweather, Scott Fitzgerald, Marcus Gayle, and Dean Holdsworth."]}, {"page": "Dore, South Yorkshire", "response": ["Notable residents include Gary Megson, a former footballer and  manager of Sheffield Wednesday F.C., Dave Bassett, former footballer and former manager of Southampton F.C., Watford F.C., Sheffield United and Nottingham Forest F.C., and Chris Waddle,A Charmed life in Dore and Totley, South Yorkshire Yorkshire Life. 23 March 2011. Retrieved 20 November 2020. former England international and player with Sheffield Wednesday football club."]}, {"page": "Barnsley F.C.", "response": ["For the 1994–95 season, Barnsley turned to midfielder Danny Wilson to manage the club. His first season brought a sixth-place finish in the First Division, which would normally have meant a play-off place, but a restructuring of the league meant that they missed out. They finished 10th a year later before finally emerging as serious promotion contenders in the 1996–97 season, finally clinching runners-up spot and automatic promotion and gaining the top flight place that they had spent 99 years trying to win. Barnsley lasted just one season in the Premier League but they did reach the quarter-finals of the FA Cup, defeating Manchester United in the fifth round. They also made their record signing that season with Gjorgji Hristov for £2 million. Wilson then departed to take over at Sheffield Wednesday, being succeeded as Barnsley manager by striker John Hendrie, who had been a key player in the promotion-winning team. Barnsley were the only team from outside the Premier League to reach the quarter-finals of the FA Cup in the 1998–99 season, but only finished 13th in the league. Hendrie was then replaced as manager by Dave Bassett, who rejuvenated the team and took them to fourth place in 1999–2000. The team lost in the play-off final to Ipswich Town, the last play-off final at Wembley before the stadium was closed for redevelopment.", "*  Dave Bassett (1999–2000)"]}, {"page": "George Graham (footballer, born 1944)", "response": ["However, he was linked with several managerial vacancies after leaving Tottenham. In October 2001, following the dismissal of Peter Taylor at Leicester City, he was linked with that vacancy, but it was filled by Dave Bassett instead."]}, {"page": "Crystal Palace F.C.", "response": ["Smith left the club and Steve Coppell returned as technical director in the summer of 1995, and through a combination of the first-team coaching of Ray Lewington and latterly Dave Bassett's managership Palace reached the play-offs. They lost the 1996 play-off final in dramatic fashion when Steve Claridge scored in the last minute of extra-time for Leicester City to win 2–1. The following season saw Coppell take charge as first-team manager when Dave Bassett departed for Nottingham Forest in early 1997 The club was successful in the play-offs at the second time of asking when they defeated Sheffield United 1–0 in the final at Wembley.King, pp. 51–2", "|align=left| Dave Bassett"]}, {"page": "Vinnie Jones", "response": ["Jones left Leeds United early in the 1990–91 season after losing his regular first-team place to youngsters David Batty and Gary Speed. His former Wimbledon manager Dave Bassett signed him for Sheffield United in September 1990 for a transfer fee of £700,000. He played a total of 35 matches for The Blades in the First Division, scoring two goals."]}, {"page": "Dennis Wise", "response": ["Wise started his career as an apprentice with Southampton, but was left without a club after he fell out with manager Lawrie McMenemy. He moved to Wimbledon on 28 March 1985 at the age of 18 on a free transfer and made his debut under manager Dave Bassett. During the autumn of 1985, Wise was loaned to Swedish non-league club Grebbestads IF. He returned to Plough Lane following his loan spell and helped the club gain promotion to the Football League First Division in 1986. In his first season in the First Division, Wise scored four goals in 27 starts as the club defied the critics and finished the season in sixth place.", "Wise returned to Southampton on a free transfer on 27 June 2005 and made 12 appearances for the club. With the resignation of Harry Redknapp, he was briefly joint-caretaker manager of the club with Dave Bassett. However, he left St Mary's on 26 December, when George Burley was appointed as the new manager. He scored once in the league for Southampton, in a 2–2 draw with Ipswich Town.", "On 4 August, Leeds were granted their golden share, but they were given another penalty, this time 15 points, after administrators KPMG refused to resurrect the CVA for the 'old' Leeds United company. Despite this, they made an excellent start, winning their first 7 league games and Wise was named as manager of the month for both August and September. However, on 29 October 2007, Poyet left Leeds to become Juande Ramos's assistant at Tottenham. Three days later, Wise's ex-manager at Wimbledon, Dave Bassett, became his number two. The partnership did not start well and Leeds finally lost their unbeaten record, losing 3–1 to Carlisle United at Brunton Park on 3 November."]}, {"page": "2001–02 in English football", "response": ["*10 October 2001 - Dave Bassett is named as Leicester City's new manager, with Brighton & Hove Albion manager Micky Adams being appointed as his assistant.", "*4 April 2002 - Dave Bassett becomes director of football at Leicester City and he hands managerial duties over to his assistant Micky Adams.", "* 10 October - Dave Bassett takes over at Leicester City, replacing Peter Taylor (sacked 30 September)", "* 4 April - Micky Adams takes over at Leicester City, replacing Dave Bassett (becomes Director of Football)"]}, {"page": "Nigel Winterburn", "response": ["Winterburn was born in Arley, Warwickshire. He began his career with Birmingham City but never played for the first team, though he did earn youth caps for England while with the club. He joined Oxford United, but never played for their first team either, and then in 1983 he was signed on a free transfer by Dave Bassett to join Wimbledon, who were on a steady climb up the divisions after gaining promotion from the non-league pyramid six years earlier."]}, {"page": "Wimbledon F.C.", "response": ["Still in south London, 1980–81 saw Wimbledon regain Third Division status at the first attempt, at the end of an eventful season which saw chairman Ron Noades walk out of the club to take over Crystal Palace, taking manager Dario Gradi to Selhurst Park with him. At Plough Lane, assistant manager Dave Bassett was promoted to manager. Under Bassett, Wimbledon were relegated in 22nd place. Just before the survival battle was lost, injured defender Dave Clement committed suicide. Wimbledon once again regained Third Division status at the first time of asking, triumphing as Fourth Division champions in 1982–83, and in the next season the Wimbledon players continued to excel as they achieved a second promotion to the Second Division after finishing runners-up with 97 league goals.", "Many observers tipped Wimbledon to go straight back down in 1986–87, but after losing the first game of the season away at Manchester City, Wimbledon won the next four games to perch atop the league table on 1 September. Wimbledon eventually finished sixth, before Dave Bassett moved on to Watford. His successor was Bristol Rovers manager Bobby Gould. Dubbed \"The Crazy Gang\" because of the eccentric behaviour of its players, fans and chairman, Sam Hammam, the club's greatest moment came in 1988 when, very much against expectation, the team won the FA Cup, beating overwhelming favourites Liverpool 1–0 with a goal from Lawrie Sanchez. 37,000 Wimbledon fans witnessed captain Dave Beasant becoming the first goalkeeper to save a penalty in an FA Cup final, stopping John Aldridge's shot. The only downside of this triumph was the fact that the club would not be able to compete in the European Cup Winners' Cup, as the ban on English teams from European competition following the Heysel Stadium Disaster was still in operation at this time.", "Prior to the appointment of H. R. Watts as first team manager in 1930, a committee would deal with first team affairs, such as choosing the team on a matchday. Doc Dowden was appointed manager in 1946, and stayed in the position until leaving at the end of the 1954–55 season. Les Henley arrived in his place as first team coach, and stayed at the club for sixteen years in which the club progressed immensely, winning the FA Amateur Cup as well as three Isthmian League championships before turning professional and moving to the Southern League. However, in 1971 Henley was replaced by Mike Everitt, who arrived as player-manager. After two seasons, Everitt left to manage Brentford and Dick Graham arrived as a replacement. Graham remained until March 1974, and a replacement was not appointed until July of that year, when Allen Batsford was made manager. Batsford led Wimbledon to The Football League, but resigned only halfway through the first League season. Dario Gradi was made manager three days later, but after three seasons he too resigned. His replacement was Dave Bassett, who took Wimbledon to sixth in the First Division before moving to Watford. Bobby Gould spent three years as manager before being replaced by Ray Harford, who spent just over a season with Wimbledon. After Harford, Peter Withe had a spell as manager lasting only three months. Joe Kinnear was brought in during January 1992, and managed the club until leaving in 1999 due to ill health. A season was spent under Egil Olsen in which the team was relegated from the FA Premier League before Terry Burton was made manager. Burton's Wimbledon narrowly missed the play-offs twice in a row before he was sacked. Stuart Murdoch managed Wimbledon for the club's final two seasons."]}]}}