{"wiki_id": "http://www.wikidata.org/entity/Q1176847", "itemLabel": "David Thomson", "itemDescription": "British film critic and historian", "wikipedia_url": "https://en.wikipedia.org/wiki/David_Thomson_(film_critic)", "wikipedia_page": {"main": "David Thomson (born 18 February 1941) is a British film critic and historian based in the United States, and the author of more than 20 books. His reference works in particular — Have You Seen...?: A Personal Introduction to 1,000 Films (2008) and The New Biographical Dictionary of Film (6th edition, 2014) — have been praised as works of high literary merit and eccentricity. Benjamin Schwarz, writing in The Atlantic Monthly, called him \"probably the greatest living film critic and historian\" who \"writes the most fun and enthralling prose about the movies since Pauline Kael\". John Banville called him \"the greatest living writer on the movies\".", "link_mentions": [{"page": "Brian De Palma", "response": ["David Thomson wrote in his entry for De Palma, \"There is a self-conscious cunning in De Palma's work, ready to control everything except his own cruelty and indifference.\"Thomson, p. 257. Matt Zoller Seitz objected to this characterisation, writing that there are films from the director which can be seen as \"straightforwardly empathetic and/or moralistic\"."]}, {"page": "Chris Marker", "response": ["Marker was born Christian François Bouche-Villeneuve. He was always elusive about his past and known to refuse interviews and not allow photographs to be taken of him; his place of birth is highly disputed. Some sources and Marker himself claim that he was born in Ulaanbaatar, Mongolia.Thomson, David, The New Biographical Dictionary of Film Fourth Edition, Little, Brown (2003). Other sources say he was born in Belleville, Paris, and others, in Neuilly-sur-Seine. The 1949 edition of Le Cœur Net gives his birthday as 22 July. Film critic David Thomson has said, \"Marker told me himself that Mongolia is correct. I have since concluded that Belleville is correct—but that does not spoil the spiritual truth of Ulan Bator.\"Thomson, David, The New Biographical Dictionary of Film Fifth Edition, Little, Brown (2010). When asked about his secretive nature, Marker said, \"My films are enough for them [the audience].\""]}, {"page": "Cinema of the United Kingdom", "response": ["The team of Basil Dearden and Michael Relph, from an earlier generation, \"probe[d] into the social issues that now confronted social stability and the establishment of the promised peacetime consensus\".Tim O'Sullivan, \"Dearden, Basil (1911-1971)\", BFI screenonline, citing the Reference Guide to British and Irish Film Directors. Pool of London (1950).Carl Daniels, \"Pool of London (1950)\", BFI screenonline. and Sapphire (1959) were early attempts to create narratives about racial tensions and an emerging multi-cultural Britain.Ann Ogidi, \"Sapphire (1959)\", BFI screenonline. Dearden and Relph's Victim (1961), was about the blackmail of homosexuals. Influenced by the Wolfenden report of four years earlier, which advocated the decriminalising of homosexual sexual activity, this was \"the first British film to deal explicitly with homosexuality\".Mark Duguid, \"Victim (1961)\", BFI screenonline. Unlike the New Wave film makers though, critical responses to Dearden's and Relph's work have not generally been positive.See also David Thomson A New Biographical Dictionary of Film, London: Little, Brown, 2002, p. 213, and (for a defence) Brian McFarlane (ed.), The Encyclopedia of British Film, 2003, London: Methuen/BFI, p. 168."]}, {"page": "Howard Hawks", "response": ["Orson Welles in an interview with Peter Bogdanovich said of Howard Hawks, in comparison with John Ford, that \"Hawks is great prose; Ford is poetry.\"Bogdanovich, Peter. \"The Southener.\" Indiewire.com, January 18, 2011. Retrieved: July 1, 2016. Despite Hawks's work in a variety of Hollywood genres, he still retained an independent sensibility. Film critic David Thomson wrote of Hawks: \"Far from being the meek purveyor of Hollywood forms, he always chose to turn them upside down. To Have and Have Not and The Big Sleep, ostensibly an adventure and a thriller, are really love stories. Rio Bravo, apparently a Western – everyone wears a cowboy hat – is a comedy conversation piece. The ostensible comedies are shot through with exposed emotions, with the subtlest views of the sex war, and with a wry acknowledgment of the incompatibility of men and women.\" David Boxwell argues that the filmmaker's body of work \"has been accused of a historical and adolescent escapism, but Hawks's fans rejoice in his oeuvre's remarkable avoidance of Hollywood's religiosity, bathos, flag-waving, and sentimentality.Boxwell, David. \"Howard Hawks.\" Senses of Cinema, May 2002. Retrieved: July 1, 2016."]}, {"page": "James Stewart", "response": ["Stewart is remembered for portraying idealist \"everyman\" characters in his films. His heroism on-screen and devotion to his family made him relatable and representative of the American ideal, leading Stewart to be considered one of the best-loved figures in twentieth-century American popular culture. According to film scholar Dennis Bingham, \"his ability to 'play'—even symbolize—honesty and 'American ideals' made him an icon into whose mold later male stars tried to pour themselves.\" Similarly, film scholar James Naremore has called Stewart \"the most successful actor of the 'common man' in the history of movies\" and \"the most intensely-emotional leading man to emerge from the studio system,\" who could cry on screen without losing his masculinity. David Thomson has explained Stewart's appeal by stating that \"we wanted to be him, and we wanted to be liked by him,\" while Roger Ebert has stated that \"whether he played everyman, or everyman's hidden psyche, Stewart was an innately likable man whose face, loping gait and distinctive drawl became famous all over the world.\" Among Stewart's most recognizable qualities was his manner of speaking with a hesitant drawl. According to film scholar Tim Palmer, \"Stewart's legacy rests on his roles as the nervous idealist standing trial for, and gaining stature from, the sincerity of his beliefs, while his emotive convictions are put to the test.\" Film critic David Ansen wrote about Stewart's appeal as a person in addition to his appeal as an actor. Ansen retold a story in which Jack Warner, upon being told about Ronald Reagan's presidential ambitions, said, \"No. Jimmy Stewart for president, Ronald Reagan for best friend.\" Ansen further explained that Stewart was the ultimate trustworthy movie star."]}, {"page": "Marilyn Monroe", "response": ["Monroe remains a cultural icon, but critics are divided on her legacy as an actress. David Thomson called her body of work \"insubstantial\" and Pauline Kael wrote that she could not act, but rather \"used her lack of an actress's skills to amuse the public. She had the wit or crassness or desperation to turn cheesecake into acting—and vice versa; she did what others had the 'good taste' not to do\". In contrast, Peter Bradshaw wrote that Monroe was a talented comedian who \"understood how comedy achieved its effects\", and Roger Ebert wrote that \"Monroe's eccentricities and neuroses on sets became notorious, but studios put up with her long after any other actress would have been blackballed because what they got back on the screen was magical\". Similarly, Jonathan Rosenbaum stated that \"she subtly subverted the sexist content of her material\" and that \"the difficulty some people have discerning Monroe's intelligence as an actress seems rooted in the ideology of a repressive era, when superfeminine women weren't supposed to be smart\"."]}, {"page": "Marlon Brando", "response": ["In the A&E Biography episode on Brando, biographer Peter Manso comments, \"On the one hand, being a celebrity allowed Marlon to take his revenge on the world that had so deeply hurt him, so deeply scarred him. On the other hand he hated it because he knew it was false and ephemeral.\" In the same program another biographer, David Thomson, relates, \"Many, many people who worked with him, and came to work with him with the best intentions, went away in despair saying he's a spoiled kid. It has to be done his way or he goes away with some vast story about how he was wronged, he was offended, and I think that fits with the psychological pattern that he was a wronged kid.\""]}, {"page": "Robert Falcon Scott", "response": ["In 1966, Reginald Pound, the first biographer given access to Scott's original sledging journal, revealed personal failings which cast a new light on Scott, although Pound continued to endorse his heroism, writing of \"a splendid sanity that would not be subdued\". Another book critical of Scott, David Thomson's Scott's Men, was released in 1977. In Thomson's view, Scott was not a great man, \"at least, not until near the end\"; his planning is described as \"haphazard\" and \"flawed\", his leadership characterised by lack of foresight. Thus by the late 1970s, in Jones's words, \"Scott's complex personality had been revealed and his methods questioned\"."]}, {"page": "Cary Grant", "response": ["In 1940, Grant played a callous newspaper editor who learns that his ex-wife and former journalist, played by Rosalind Russell, is to marry insurance officer Ralph Bellamy in Hawks' comedy His Girl Friday, which was praised for its strong chemistry and \"great verbal athleticism\" between Grant and Russell. Grant reunited with Irene Dunne in My Favorite Wife, a \"first rate comedy\" according to Life magazine, which became RKO's second biggest picture of the year, with profits of $505,000. After playing a Virginian backwoodsman in the American Revolution-set The Howards of Virginia, which McCann considers to have been Grant's worst film and performance, his last film of the year was in the critically lauded romantic comedy The Philadelphia Story, in which he played the ex-husband of Hepburn's character. Grant felt his performance was so strong that he was bitterly disappointed not to have received an Oscar nomination, especially since both his lead co-stars, Hepburn and James Stewart, received them, with Stewart winning for Best Actor. Grant joked \"I'd have to blacken my teeth first before the Academy will take me seriously\". Film historian David Thomson wrote that \"the wrong man got the Oscar\" for The Philadelphia Story and that \"Grant got better performances out of Hepburn than her (long-time companion) Spencer Tracy ever managed.\"Thomson, David, A Biographical Dictionary of Film, Martin Secker and Warburg Ltd, London, 1994, pg. 301. Stewart's winning the Oscar \"was considered a gold-plated apology for his being robbed of the award\" for the previous year's Mr. Smith Goes to Washington.Kinn, Gail, and Jim Piazza, \"The Academy Awards: The Complete History of Oscar\", Black Dog and Leventhal Publishers, New York, 2002, p. 57.Michael Gebert, The Encyclopedia of Movie Awards, St. Martin's Paperbacks, New York, 1996, p. 96. Grant's not being nominated for His Girl Friday the same year is also a \"sin of omission\" for the Oscars.", "Stirling refers to Grant as \"one of the shrewdest businessmen ever to operate in Hollywood\". His long-term friendship with Howard Hughes from the 1930s onward saw him invited into the most glamorous circles in Hollywood and their lavish parties. Biographers Morecambe and Stirling state that Hughes played a major role in the development of Grant's business interests so that by 1939, he was \"already an astute operator with various commercial interests\". Scott also played a role, encouraging Grant to invest his money in shares, making him a wealthy man by the end of the 1930s. In the 1940s, Grant and Barbara Hutton invested heavily in real estate development in Acapulco at a time when it was little more than a fishing village, and teamed up with Richard Widmark, Roy Rogers, and Red Skelton to buy a hotel there. Behind his business interests was a particularly intelligent mind, to the point that his friend David Niven once said: \"Before computers went into general release, Cary had one in his brain\". Film critic David Thomson believes that Grant's intelligence came across on screen, and stated that \"no one else looked so good and so intelligent at the same time\".", "Biographers Morecambe and Stirling believe that Cary Grant was the \"greatest leading man Hollywood had ever known\". Schickel stated that there are \"very few stars who achieve the magnitude of Cary Grant, art of a very high and subtle order\" and thought that he was the \"best star actor there ever was in the movies\". David Thomson and directors Stanley Donen and Howard Hawks concurred that Grant was the greatest and most important actor in the history of the cinema. He was a favorite of Hitchcock, who admired him and called him \"the only actor I ever loved in my whole life\", and remained one of Hollywood's top box-office attractions for almost 30 years. Pauline Kael stated that the world still thinks of him affectionately because he \"embodies what seems a happier time−a time when we had a simpler relationship to a performer\"."]}, {"page": "Ingrid Bergman", "response": ["Intermezzo became an enormous success and as a result Bergman became a star. Ratoff, said, \"She is sensational.\" This was the \"sentiment of the entire set\", wrote a retrospective, adding that workmen went out of their way to do things for her and that the cast and crew \"admired the quick, alert concentration she gave to direction and to her lines\". Film historian David Thomson notes that this became \"the start of an astonishing impact on Hollywood and America\", where her lack of make-up contributed to an \"air of nobility\". According to Life, the impression that she left on Hollywood, after she returned to Sweden, was of a tall girl \"with light brown hair and blue eyes who was painfully shy, but friendly, with a warm, straight, quick smile\". Selznick appreciated her uniqueness. Bergman was hailed as a fine new talent, and received many positive reviews. The New York Times noted her \"freshness and simplicity and natural dignity\" and the maturity of her acting which was nonetheless, free of \"stylistic traits - the mannerisms, postures, precise inflections - that become the stock in trade of the matured actress.\" Variety noted that she was warm and convincing, and provided an \"arresting performance\" and that her \"charm, sincerity\" ...and \"infectious vivaciousness\" would \"serve her well in both comedy and drama.\" There was also recognition of her natural appearance, in contrast to other film actresses. The New York Tribune said: \"Using scarcely any makeup, but playing with mobile intensity, she creates the character so vividly and credibility that it becomes the core of [the] narrative\". Bergman made her stage debut in 1940 with Lilliom opposite Burgess Meredith, at a time when she was still learning English. Selznick was worried that his new starlet's value would diminish if she received bad reviews. Brooks Atkinson of The New York Times reviewed that Bergman seemed at ease, and commanded the stage that evening. That same year she starred in June Night, (Juninatten) a Swedish language drama film directed by Per Lindberg.Charlotte Chandler, Ingrid: Ingrid Bergman, A Personal Biography 71 141653914X - 2007 -\"... more films in Germany ended, Ingrid started the last Swedish film she had agreed to do, June Night. The theme of the film, sexual harassment, was well ahead of its time. Juninatten (June Night, 1940) Kerstin Nosbäc (Ingrid Bergman) leads ...\" She plays Kerstin, a woman who has been shot by her lover. The news reaches the national papers. Kerstin moves to Stockholm under the new name of Sara, but lives under the scrutiny and watchful eye of her new community. Öresunds-Posten wrote, \"Bergman establishes herself as an actress belonging to the world elite.\"", "Film historian David Thomson, said she \"always strove to be a 'true' woman\", and many filmgoers identified with her:"]}, {"page": "The Best Years of Our Lives", "response": ["Several decades later, film critic David Thomson offered tempered praise: \"I would concede that Best Years is decent and humane... acutely observed, despite being so meticulous a package. It would have taken uncommon genius and daring at that time to sneak a view of an untidy or unresolved America past Goldwyn or the public.\"Thomson, 2002, p. 949. 4th Edition; the first edition was published in 1975. See "]}, {"page": "Elizabeth Taylor", "response": ["Regardless of the acting awards she won during her career, Taylor's film performances were often overlooked by contemporary critics; according to film historian Jeanine Basinger, \"No actress ever had a more difficult job in getting critics to accept her onscreen as someone other than Elizabeth Taylor... Her persona ate her alive.\" Her film roles often mirrored her personal life, and many critics continue to regard her as always playing herself, rather than acting. In contrast, Mel Gussow of The New York Times stated that \"the range of [Taylor's] acting was surprisingly wide\", despite the fact that she never received any professional training. Film critic Peter Bradshaw called her \"an actress of such sexiness it was an incitement to riot – sultry and queenly at the same time\", and \"a shrewd, intelligent, intuitive acting presence in her later years.\" David Thomson stated that \"she had the range, nerve, and instinct that only Bette Davis had had before – and like Davis, Taylor was monster and empress, sweetheart and scold, idiot and wise woman.\" Five films in which she starred – Lassie Come Home, National Velvet, A Place in the Sun, Giant, and Who's Afraid of Virginia Woolf? – have been preserved in the National Film Registry, and the American Film Institute has named her the seventh greatest female screen legend of classical Hollywood cinema."]}, {"page": "Buster Keaton", "response": ["Film critic David Thomson later described Keaton's style of comedy: \"Buster plainly is a man inclined towards a belief in nothing but mathematics and absurdity ... like a number that has always been searching for the right equation. Look at his face—as beautiful but as inhuman as a butterfly—and you see that utter failure to identify sentiment.\"Thomson, David, Have you Seen...?, Alfred A. Knopf Publishing, 2008, p. 767. Gilberto Perez commented on \"Keaton's genius as an actor to keep a face so nearly deadpan and yet render it, by subtle inflections, so vividly expressive of inner life. His large, deep eyes are the most eloquent feature; with merely a stare, he can convey a wide range of emotions, from longing to mistrust, from puzzlement to sorrow.\"Perez Gilberto 'The Material Ghost—On Keaton and Chaplin' 1998 Critic Anthony Lane also noted Keaton's body language:"]}, {"page": "Barbara Stanwyck", "response": ["In Preston Sturges's romantic comedy The Lady Eve (1941), she plays a slinky, sophisticated con-woman who \"gives off an erotic charge that would straighten a boa constrictor\",Michael Gebert, The Encyclopedia of Movie Awards, St. Martin's Paperbacks, New York, 1996, pg. 102. while falling in love with her intended mark, the guileless, wealthy herpetologist, played by Henry Fonda.Schneider, Steven Jay, Ed. (London, 2003). \"1000 Movies You Must See Before You Die\", Quintessence Editions Limited, pg. 141 Film critic David Thomson described Stanwyck as \"giving one of the best American comedy performances\", and she was reviewed as brilliantly versatile in \"her bravura double performance\" by The Guardian. The Lady Eve is among the top 100 movies of all time on Time and Entertainment Weekly's lists, and is considered to be both a great comedy and a great romantic film with its placement at #55 on the AFI's 100 Years ...100 Laughs list and #26 on its 100 Years ...100 Passions list."]}, {"page": "Robert Altman", "response": ["Overlapping dialogue among large groups of actors adds complexity to Altman's films, and they were often criticized as appearing haphazard or disconnected on first viewing. Some of his critics changed their minds after seeing them again. British film critic David Thomson gave Nashville (1975) a bad review after watching it the first time, but later wrote, \"But going back to Nashville and some of the earlier films, ... made me reflect: It remains enigmatic how organized or purposeful Nashville is. ... The mosaic, or mix, permits a freedom and a human idiosyncrasy that Renoir might have admired.\" During the making of the film, the actors were inspired, and co-star Ronee Blakley was convinced of the film's ultimate success:"]}, {"page": "Paul Muni", "response": ["Although Muni was considered one of the best film actors of the 1930s, some film critics such as David Thomson and Andrew Sarris, accuse him of overacting."]}, {"page": "Black Narcissus", "response": ["According to film critic David Thomson, \"Black Narcissus is that rare thing, an erotic English film about the fantasies of nuns, startling whenever Kathleen Byron is involved\".David Thomson The New Biographical Dictionary of Film, London: Little, Brown, 2002, p, p.694"]}, {"page": "Leonardo DiCaprio", "response": ["In 1996, DiCaprio starred opposite Claire Danes in Baz Luhrmann's film Romeo + Juliet, an abridged modernization of William Shakespeare's romantic tragedy of the same name, which retained the original Shakespearean dialogue. The project grossed $147 million worldwide, and earned DiCaprio a Silver Bear for Best Actor at the 1997 Berlin International Film Festival. Reviewing his early works, David Thomson of The Guardian called DiCaprio \"a revelation\" in What's Eating Gilbert Grape, \"very moving\" in This Boy's Life, \"suitably desperate\" in The Basketball Diaries and \"a vital spark\" in Romeo + Juliet. Later in 1996, DiCaprio starred in Marvin's Room, a family drama revolving around two sisters, played by Meryl Streep and Diane Keaton, who are reunited through tragedy after 17 years of estrangement. DiCaprio portrayed Hank, Streep's character's troubled son, who has been committed to a mental asylum. Lisa Schwarzbaum of Entertainment Weekly praised \"the deeply gifted DiCaprio\" for holding his own against the experienced actresses Keaton and Streep, describing the three as \"full-bodied and so powerfully affecting that you're carried along on the pleasure of being in the presence of their extraordinary talent\"."]}, {"page": "Miller's Crossing", "response": ["Film critic David Thomson calls the film \"a superb, languid fantasia on the theme of the gangster film that repays endless viewing\".Thomson, David (2008), \"Have You Seen...?\", New York City: Knopf, p. 554. Of Turturro's performance he says \"This could be the finest work of one of our best supporting actors\". Roger Ebert gave it 3/4 stars, stating \"It is likely to be most appreciated by movie lovers who will enjoy its resonance with films of the past\"."]}, {"page": "Casablanca (film)", "response": ["The novel As Time Goes By, written by Michael Walsh and published in 1998, was authorized by Warner. The novel picks up where the film leaves off, and also tells of Rick's mysterious past in America. The book met with little success. David Thomson provided an unofficial sequel in his 1985 novel Suspects."]}, {"page": "Theo Angelopoulos", "response": ["His regular collaborators include the cinematographer Giorgos Arvanitis, the screenwriter Tonino Guerra and the composer Eleni Karaindrou. One of the recurring themes of his work is immigration, the flight from homeland and the return, as well as the history of 20th century Greece. Angelopoulos was considered by British film critics Derek Malcolm and David Thomson as one of the world's greatest directors."]}, {"page": "Badlands (film)", "response": ["In April 1974, Jay Cocks wrote that the film \"might better be regarded less as a companion piece to Bonnie and Clyde than as an elaboration and reply. It is not loose and high-spirited. All its comedy has a frosty irony, and its violence, instead of being brutally balletic, is executed with a dry, remorseless drive.\" According to executive producer Edward Pressman, apart from Canby's New York Times review, most initial reviews of the film were negative, but its reputation with critics improved over time. David Thomson conversely reported that the work was \"by common consent [...] one of the most remarkable first feature films made in America.\" Writing years later for The Chicago Reader, Dave Kehr wrote: \"Malick's 1973 first feature is a film so rich in ideas it hardly knows where to turn. Transcendent themes of love and death are fused with a pop-culture sensibility and played out against a midwestern background, which is breathtaking both in its sweep and in its banality.\"  "]}, {"page": "Tony Curtis", "response": ["Although his early film roles mainly took advantage of his good looks, by the latter half of the 1950s he had demonstrated range and depth in numerous dramatic and comedy roles. In his earliest parts he acted in a string of mediocre films, including swashbucklers, westerns, light comedies, sports films and a musical. However, by the time he starred in Houdini (1953) with his wife Janet Leigh, \"his first clear success,\" notes critic David Thomson, his acting had progressed immensely."]}, {"page": "The General (1926 film)", "response": ["A mural was painted on a building in Cottage Grove, OR commemorating the film. David Thomson has speculated it is \"the only memorial in the United States to Buster Keaton.\"Thomson, David. The Whole Equation. New York, NY: Alfred A. Knopf. 2005. . p. 382."]}, {"page": "David Lean", "response": ["The next film directed by Lean was The Passionate Friends (1949), an atypical Lean film, but one which marked his first occasion to work with Claude Rains, who played the husband of a woman (Todd) torn between him and an old flame (Howard). The Passionate Friends was the first of three films to feature the actress Ann Todd, who became his third wife. Madeleine (1950), set in Victorian-era Glasgow is about an 1857 cause célèbre with Todd's lead character accused of murdering a former lover. \"Once more\", writes film critic David Thomson \"Lean settles on the pressing need for propriety, but not before the film has put its characters and the audience through a wringer of contradictory feelings.\" The last of the films with Todd, The Sound Barrier (1952), has a screenplay by the playwright Terence Rattigan and was the first of his three films for Sir Alexander Korda's London Films. Hobson's Choice (1954), with Charles Laughton in the lead, was based on the play by Harold Brighouse.", "The critical verdict was not unanimous, however. For example, David Thomson, writing about Lean in his New Biographical Dictionary of Film, comments: The New York Times film critic Bosley Crowther dismissed Lawrence of Arabia as \"a huge, thundering camel-opera that tends to run down rather badly as it rolls on into its third hour and gets involved with sullen disillusion and political deceit\". Writing in The Village Voice, Andrew Sarris remarked that Lawrence was \"simply another expensive mirage, dull, overlong, and coldly impersonal ... on the whole I find it hatefully calculating and condescending\"."]}, {"page": "The Deer Hunter", "response": ["Film critic and biographer David Thomson also agrees that the film works despite the controversy: \"There were complaints that the North Vietnamese had not employed Russian roulette. It was said that the scenes in Saigon were fanciful or imagined. It was also suggested that De Niro, Christopher Walken, and John Savage were too old to have enlisted for Vietnam (Savage, the youngest of the three, was thirty). Three decades later [written in 2008], 'imagination' seems to have stilled those worries ... and The Deer Hunter is one of the great American films.\"Thomson, David (October 14, 2008). \"Have You Seen ... ?\": A Personal Introduction to 1,000 Films. New York, NY: Random House. p. 209. .", "However, many critics, including David Thomson and A.O. Scott., by The New York Times film critic A. O. Scott on YouTube. maintain that The Deer Hunter is still a great film, the power of which has not diminished.", "David Thomson wrote in an article titled \"The Deer Hunter: Story of a scene\" that the film changed the way war-time battles were portrayed on film: \"The terror and the blast of firepower changed the war film, even if it only used a revolver. More or less before the late 1970s, the movies had lived by a Second World War code in which battle scenes might be fierce but always rigorously controlled. The Deer Hunter unleashed a new, raw dynamic in combat and action, paving the way for Platoon, Saving Private Ryan and Clint Eastwood's Iwo Jima films.\""]}, {"page": "The Shop Around the Corner", "response": ["Film historian David Thomson wrote:"]}, {"page": "Gregory Peck", "response": ["Film historian David Thomson wrote \"From his debut, Peck was always a star and rarely less than a box office success.\" After gaining stage recognition, Peck was offered his first film role, the male lead in the war-romance Days of Glory (1944), directed by Jacques Tourneur, alongside top-billed Tamara Toumanova, a Russian-born ballerina. Peck portrayed the leader of Russian guerrillas resisting the Germans in 1941 who stumble across a beautiful Russian dancer (Toumanova), who had been sent to entertain Russian troops, and protect her by letting her join their group.Thomson, David (London, 1994) \"A Biographical Dictionary of Film\", Martin Secker and Warburg Ltd., pg. 576. During production of the film, Tourneur \"untrained\" Peck from his theater training where he was used to speaking in a formal manner and projecting his voice to the entire hall. Peck considered his performance in the film as quite amateurish and did not wish to watch the film after it was released. The film lost money at the box office, disappeared from theaters quickly, and was largely dismissed by critics. ", "Peck took his first \"against type\" role, as a cruel, amoral cowboy in the western soap opera Duel in the Sun (1946) with top-billed Jennifer Jones as the provocative, temptress object of Peck's love, anger and desire. Their chemistry is described by film historian David Thomson as \"a constant knife fight of sensuality\".Thomson, David (London, 1994) \"A Biographical Dictionary of Film\", Martin Secker and Warburg Ltd., pg. 577. Also starring Joseph Cotten as Peck's righteous half brother and competitor for the affections of the \"steamy, sexpot\" character of Jones, the movie was resoundingly criticized, and even banned in some cities, due to its lurid nature.Bergen, Ronald (London: 2004) in \"501 Must-See Movies\", Bounty Books. The publicity around the eroticism of Duel in the Sun,Fox, Ken, Ed Grant, Jo Imeson, Andrew Joseph and Maitland McDonaugh, Eds. (New York, 1998) \"The Movie Guide\", Berkley Publishing Group, pg. 183. one of the biggest movie advertising campaigns in history,Tookey, Christopher (London, 1994), \"The Film Critics' Film Guide\", Boxtree Limited. pg. 214. used a new tactic of opening in hundreds of theaters across the U.S. at once, saturating the theaters in cities where it opened, resulting in the film being the second highest-grossing movie of both 1947 and the 1940s.Kay, Eddie Dorman (New York, 1990). \"Box Office Champs: The Most Popular Movies from the Last 50 Years\", M & M Books, pg. 39. Nicknamed \"Lust in the Dust\", the film received mostly negative reviews upon release, such as Bosley Crowther writing that \"performances are strangely uneven\", although Jones received a nomination for the Academy Award for Best Actress. The opinions of Peck's performance have been polarized.", "He portrayed  a US army colonel investigating the kidnapping of a young soldier in Night People (1954). Peck later stated that the role of was one of his favorites as his lines were \"tough and crisp and full of wisecracks, and more aggressive than other roles\" he'd played.  The film received praise for its production and direction, but did poorly at the box office. Peck flew to Sri Lanka to film The Purple Plain (1954), playing a Canadian bomber pilot with strong emotional problems during the Second World War. The Purple Plain was panned in the United States but became a hit in the United Kingdom, ranking tenth at the box office in 1954, and was nominated for a BAFTA Award for Outstanding British Film. Of his performance, Crowther wrote, \"the extent of Peck's agony is impressively transmitted...in vivid and unrelenting scenes.\" In recent years, the movie \"has become one of Peck's most respected works,\" with critic David Thomson rating Peck's performance as excellent. Craig Butler of All Movie describes \"Peck is astonishing, giving the sort of layered, intense yet nuanced performance that deserves major awards\"."]}, {"page": "Michael Douglas", "response": ["According to film historian and critic David Thomson, Douglas was capable of playing characters who were \"weak, culpable, morally indolent, compromised, and greedy for illicit sensation without losing that basic probity or potential for ethical character that we require of a hero\".Thomson, David. The New Biographical Dictionary of Film, Alfred A. Knopf (2002) pp. 247–249 Critic and author Rob Edelman points out similarities in many of Douglas's roles, writing that in some of his leading films, he personified the \"contemporary, Caucasian middle-to-upper-class American male who finds himself the brunt of female anger because of real or imagined sexual slights\".Edelman, Rob; Unterburger, Amy L. (Ed.) International Dictionary of Films and Filmmakers-3: Actors and Actresses (3rd Ed.), St. James Press (1997) pp. 347–348"]}, {"page": "Ernst Lubitsch", "response": ["His next film was a romantic comedy, written with Samson Raphaelson, Trouble in Paradise (1932). Later described (approvingly) as \"truly amoral\" by critic David Thomson, the cynical comedy was popular both with critics and with audiences. But it was a project that could only have been made before the enforcement of the Production Code, and after 1935, Trouble in Paradise was withdrawn from circulation. It was not seen again until 1968. The film was never available on videocassette and only became available on DVD in 2003.", "In 1940, he directed The Shop Around the Corner, an artful comedy of cross purposes. The film reunited Lubitsch with his Merry Widow screenwriter Raphaelson, and starred James Stewart and Margaret Sullavan as a pair of bickering co-workers in Budapest, each unaware that the other is their secret romantic correspondent. David Thomson wrote:"]}, {"page": "Robert Donat", "response": ["He was cast as Thomas Becket in T. S. Eliot's Murder in the Cathedral in Robert Helpmann's production at The Old Vic theatre in 1952 but, although his return to stage was well received, his illness forced him to withdraw during the run. For the same reason, he dropped out of the film Hobson's Choice (1954). Scheduled to play Willy Mossop, he was replaced by John Mills. Author David Shipman speculates that Donat's asthma may have been psychosomatic: \"His tragedy was that the promise of his early years was never fulfilled and that he was haunted by agonies of doubt and disappointment (which probably were the cause of his chronic asthma).\" David Thomson also suggested this explanation, and Donat himself thought that his illness had a 90% basis in his psychology. In a 1980 interview with Barry Norman, his first wife, Ella Annesley Voysey (by then known as Ella Hall),\"The British Greats: 2, Robert Donat\", BBC Genome, 6 August 1980 from Radio Times Issue 2960, 31 July 1980, p. 50 said that Donat had an asthma attack as a psychosomatic response to the birth of their daughter. According to her: \"Robert was full of fear.\"reprinted in The Listener, vol.104, p. 241"]}, {"page": "Mickey Rooney", "response": ["His mother saw an advertisement for a child to play the role of \"Mickey McGuire\" in a series of short films.Current Biography 1942. H.W. Wilson Co. (January 1942). pp. 704–06. . Rooney got the role and became \"Mickey\" for 78 of the films, running from 1927 to 1936, starting with Mickey's Circus (1927), his first starring role. During this period, he also briefly voiced Oswald the Lucky Rabbit for Walter Lantz Productions. He made other films in his adolescence, including several more of the McGuire films. At age 14, he played the role of Puck in the Warner Bros. all-star adaptation of A Midsummer Night's Dream in 1935. Critic David Thomson hailed his performance as \"one of the cinema's most arresting pieces of magic\". Rooney then moved to MGM, where he befriended Judy Garland, with whom he began making a series of musicals that propelled both of them to stardom.Krantz, Les. Their First Time in the Movies, The Overlook Press N.Y. (2001) p. 45Archived at Ghostarchive and the Wayback Machine: Archived at Ghostarchive and the Wayback Machine: ", "\"There was nothing he couldn't do,\" said actress Margaret O'Brien. MGM boss Louis B. Mayer treated him like a son and saw in Rooney \"the embodiment of the amiable American boy who stands for family, humbug, and sentiment,\" wrote critic and author David Thomson."]}, {"page": "Heaven's Gate (film)", "response": ["In subsequent years, some critics have come to the film's defense, beginning with European critics who praised it after the film played at the Cannes Film Festival.Khan, Omar. \"Heaven's Gate (1981)\"  Robin Wood was an early champion of Heaven's Gate and its reassessment, calling it \"one of the few authentically innovative Hollywood films ... It seems to me, in its original version, among the supreme achievements of the Hollywood cinema.\"\"Top Ten Lists by Critics and Filmmakers\". Combustible Celluloid. Retrieved November 25, 2010. David Thomson calls the film \"a wounded monster\" and argues that it takes part in \"a rich American tradition (Melville, James, Ives, Pollock, Parker) that seeks a mighty dispersal of what has gone before. In America, there are great innovations in art that suddenly create fields of apparent emptiness. They may seem like omissions or mistakes at first. Yet in time we come to see them as meant for our exploration.\"Thomson, David (October 14, 2008). \"Have You Seen ...?\": A Personal Introduction to 1,000 Films. New York City: Random House. p. 363. . Martin Scorsese has said that the film has many overlooked virtues.LaGravenese, Richard (director); Demme, Ted (director). (2003). A Decade Under the Influence: Yesterday, Today and Tomorrow. [Film]. IFC. Some of these critics have attempted to impugn the motives of the earliest reviewers. Robin Wood noted, in his initial review of the film, reviewers tended to pile on the film, attempting to \"outdo [one an]other with sarcasm and contempt.\" Several members of the cast and crew have complained that the initial reviews of the film were tainted by its production history and that daily critics were reviewing it as a business story as much as a motion picture. In April 2011, the staff of Time Out London selected Heaven's Gate as the 12th greatest Western of all time. While Peter Biskind covered the many excesses and problems with the movie in his book Easy Riders, Raging Bulls, he also noted that Heaven's Gate was not dissimilar to other big-budget, troubled projects of the late 1970s and early 1980s (such as Steven Spielberg's 1941 and Warren Beatty's Reds), and that the backlash against Heaven's Gate could have easily been directed elsewhere. Biskind speculated that Michael Cimino's personal unpopularity was the main reason this film became so widely reviled. Philip French praised the film in his original review."]}, {"page": "Dog Day Afternoon", "response": ["The call between Pacino and Sarandon was improvised. Lumet felt that Sarandon \"had great taste\", and that the actor would not resort to \"homosexual clichés\". He deemed the humor of his improvisation as \"genuinely funny\", and that it was not \"laughing at a gay character\". Sarandon felt that the conversation was welcomed by the audiences because it \"wasn't about a drag queen and his boyfriend\", and that it reflected two people that were \"trying to come to grips with what is wrong in their relationship.\" The film was characterized by its \"light comic touch\", and according to critic David Thomson, for its \"ear and instinct for comedy\". In Pierson's script, Wortzik's question regarding which country Sal wanted to escape to did not have a scripted response, but Cazale improvised by answering \"Wyoming\". Lumet had to cover his mouth, as he nearly interrupted the scene by laughing."]}, {"page": "The Last Emperor", "response": ["The Criterion Collection 2008 version of four DVDs adds commentary by Ian Buruma, composer David Byrne, and the Director's interview with Jeremy Isaacs (ASIN: B000ZM1MIW, ).  It includes a booklet featuring an essay by David Thomson, interviews with production designer Ferdinando Scarfiotti and actor Ying Ruocheng, a reminiscence by Bertolucci, and an essay and production-diary extracts from Fabien S. Gerard.", "* \"The Last Emperor, or The Manchurian Candidate\"—An essay by David Thomson at the Criterion Collection"]}, {"page": "Isabelle Huppert", "response": ["David Thomson on Claude Chabrol's Madame Bovary: \"[Huppert] has to rate as one of the most accomplished actresses in the world today, even if she seems short of the passion or agony of her contemporary, Isabelle Adjani.\" Stuart Jeffries of The Observer on The Piano Teacher: \"This is surely one of the greatest performances of Huppert's already illustrious acting career, though it is one that is very hard to watch.\" Director, Michael Haneke: \"[Huppert] has such professionalism, the way she is able to represent suffering. At one end you have the extreme of her suffering and then you have her icy intellectualism. No other actor can combine the two.\" Of her performance in 2007's Hidden Love, Roger Ebert said \"Isabelle Huppert makes one good film after another.... she is fearless. Directors often depend on her gift for conveying depression, compulsion, egotism and despair. She can be funny and charming, but then so can a lot of actors. She is in complete command of a face that regards the void with blankness.\" In 2010, S.T. VanAirsdale described her as \"arguably the world's greatest screen actress.\""]}, {"page": "James Coburn", "response": ["In The New Biographical Dictionary of Film, critic David Thomson states that \"Coburn is a modern rarity: an actor who projects lazy, humorous sexuality. He has made a variety of flawed, pleasurable films, the merits of which invariably depend on his laconic presence. Increasingly, he was the best thing in his movies, smiling privately, seeming to suggest that he was in contact with some profound source of amusement\".Thomson, David. \"The New Biographical Dictionary Of Film\". Knopf 2004 Film critic Pauline Kael remarked on Coburn's unusual characteristics, stating that \"he looked like the child of the liaison between Lt. Pinkerton and Madame Butterfly\".Rule, Vera. \"James Coburn\". The Guardian, Friday 3/6/99 George Hickenlooper, who directed Coburn in The Man from Elysian Fields called him \"the masculine male\".\"Tough Guise\". People Magazine. August 3, 2001 Andy García called him \"the personification of class, the hippest of the hip\", and Paul Schrader noted \"he was of that 50s generation. He had that part hipster, part cool-cat aura about him. He was one of those kind of men who were formed by the Rat Pack kind of style.\"Breznican, Anthony. \"Actor James Coburn dead of heart attack at age 74\". Today's News-Herald. July 23, 2001"]}, {"page": "Jean Vigo", "response": ["Vigo is noted for two films that affected the future development of both French and world cinema: Zero for Conduct (1933) and L'Atalante (1934).  Zero for Conduct was approvingly described by critic David Thomson in The New Biographical Dictionary of Film as \"forty-four minutes of sustained, if roughly shot anarchic crescendo.\" L'Atalante was Vigo's only full-length feature. The simple story of a newly married couple splitting and reuniting effortlessly merges unpolished, naturalistic filmmaking with shimmering, dreamlike sequences and effects. Thomson described the result as \"not so much a masterpiece as a definition of cinema, and thus a film that stands resolutely apart from the great body of films.\" "]}, {"page": "Sarah Miles", "response": ["Shortly after finishing at RADA, Miles performed in \"Manhunt\" an episode of the TV series Deadline Midnight. Her film debut was as Shirley Taylor, a \"husky wide-eyed nymphet\"David Thomson A New Biographical Dictionary of Film, London: Little Brown, 2002, p.594  in Term of Trial (1962), which featured Laurence Olivier; she was nominated for the BAFTA Award for Best Newcomer.", "Miles appeared in The Rehearsal (1963) for TV and then played Vera from Manchester in Joseph Losey's The Servant (1963), and \"thrust sexual appetite into British films\" according to David Thomson."]}, {"page": "Hugh Grant", "response": ["Regarding his romantic comedy star era, some film critics, such as Roger Ebert, have defended the limited variety of his performances, while some others have dismissed him as a \"one-trick pony\". Eric Fellner, co-owner of Working Title Films and a longtime collaborator, said, \"His range hasn't been fully tested, but each performance is unique.\" Many of Grant's films of the 1990s followed a similar plot that captured an optimistic bachelor experiencing a series of embarrassing incidents to find true love, often with an American woman. In earlier films, he was adept at plugging into the stereotype of a repressed Englishman for humorous effects, allowing him to gently satirise his characters as he summed them up and played against the type simultaneously. These performances were sometimes deemed excessive, in the words of The Washington Posts Rita Kempley, due to Grant's \"comic overreactions—the mugging, the stuttering, the fluttering eyelids\". She added: \"He's got more tics than Benny Hill.\" His penchant for conveying his characters' feelings with mannerisms, rather than direct emotions, has been one of the foremost objections raised against his acting style. Stephen Hunter of The Washington Post once stated that, to be effective as a comic performer, Grant must get \"his jiving and shucking under control\". Film historian David Thomson opined in The New Biographical Dictionary of Film that the actor equated merely \"itchy mannerisms\" with screen acting.David Thomson A New Biographical Dictionary of Film, London: Little"]}, {"page": "Irving Thalberg", "response": ["In describing the rationale for this early appointment as studio manager, film historian David Thomson writes that his new job \"owed nothing to nepotism, private wealth, or experience in the film industry.\" He reasons that despite \"Thalberg's youth, modest education, and frail appearance ... it is clear that he had the charm, insight, and ability, or the appearance of it, to captivate the film world.\"Thomson, David. The New Biographical Dictionary of Film, Alfred A. Knopf, New York (2002) pp. 867–868"]}, {"page": "Intolerance (film)", "response": ["Critic Armond White considers Intolerance the greatest film ever made, writing, \"A century later we are as close to its subject as we are distant from its art.\" Praise for the work is not unanimous, however. David Thomson argued that the film's impact is weakened by its \"self-destructive frenzy\":"]}]}}