{"wiki_id": "http://www.wikidata.org/entity/Q1173879", "itemLabel": "David Button", "itemDescription": "English association football player (born 1989)", "wikipedia_url": "https://en.wikipedia.org/wiki/David_Button", "wikipedia_page": {"main": "David Robert Edmund Button (born 27 February 1989) is an English professional footballer who plays as a goalkeeper for EFL Championship club West Bromwich Albion.\nA product of the Tottenham Hotspur academy, Button came to prominence at Brentford in 2013. He earned 31 caps for England from U16 to U20 level.", "link_mentions": [{"page": "February 27", "response": ["*1989 – David Button, English footballer"]}, {"page": "Richard Lee (footballer)", "response": ["Lee began the 2012–13 season out injured and due to the form of Simon Moore, he made just six appearances. He signed a new one-year contract extension in December 2012 and underwent a shoulder reconstruction operation in March 2013, which kept him out of first team action for six months. He made just five appearances during Brentford's promotion-winning 2013–14 season and spent much of the season as backup to new signing David Button, though he won a promotion medal by virtue of being an unused substitute on the final day of the season versus Stevenage.", "Lee signed a new one-year contract extension in February 2014, but after just one appearance during the first month of the 2014–15 season, he made the decision to retire at the end of the campaign. Lee's persistent shoulder injury could be traced back to the ruptured biceps he suffered in 2005 and he admitted in 2011 that playing through injuries had caused lasting damage. Lee spent the 2014–15 season as third-choice goalkeeper behind David Button and Jack Bonham and after falling to fourth-choice behind Development Squad goalkeeper Mark Smith, he departed on loan in late March 2015. At the 2014–15 end-of-season awards dinner, Lee was presented with a long-service award for his five seasons at the club. He made 87 appearances during his time at Griffin Park."]}, {"page": "West London derby", "response": ["* David Button – first Brentford, then Fulham"]}, {"page": "Tottenham Hotspur F.C. Under-23s and Academy", "response": ["Spurs also loaned out Tomas Pekhart to Southampton, Troy Archibald-Henville to Norwich City, Simon Dawkins to Leyton Orient, David Button to Grays Athletic, and Andrew Barcham, Leigh Mills & Charlie Daniels went on loan to Gillingham."]}, {"page": "Chris Neal", "response": ["In July 2009, Neal made a permanent move from Preston, rejoining Paul Simpson's Shrewsbury Town for a nominal fee. He started the first four games of the 2009–10 season, but lost his place to loanee David Button due to a groin injury, and played just six further games that season. He began the 2010–11 campaign as the \"Shrews\" preferred keeper following an injury to rival Ben Smith, but lost his first team place in November after 20 appearances, and only played a handful of games thereafter as a fit again Smith was preferred by manager Graham Turner. He made his first League Two appearance of the 2011–12 season on 8 October, but remained between the sticks for the rest of the season, as Shrewsbury won promotion as the division's runners-up."]}, {"page": "Adam Legzdins", "response": ["Legzdins made his first team debut for Crewe in the League Cup defeat to Blackpool on 11 August 2009, after loan goalkeeper David Button returned to Tottenham Hotspur, and followed this up with his debut in the Football League on 22 August, keeping a clean sheet in the 1–0 home win against Hereford United."]}, {"page": "Monk's Walk School", "response": ["* David Button, Brighton and Hove Albion Goalkeeper"]}, {"page": "Ben Roberts (footballer)", "response": ["On 29 December 2010, he left Yeovil Town to return to their League One rivals Charlton Athletic. During his tenure at Charlton, Roberts oversaw the early careers of Rob Elliot, Ben Hamer, Neil Etheridge, Marko Dmitrovic, Dillon Phillips, David Button and Nick Pope."]}, {"page": "2008 UEFA European Under-19 Championship", "response": ["*  David Button"]}, {"page": "2008–09 Tottenham Hotspur F.C. season", "response": ["|19 September 2008|| David Button||Grays Athletic||20 November 2008", "|16 January 2009|| David Button||AFC Bournemouth||16 February 2009", "|6 March 2009|| David Button||Luton Town||7 April 2009", "|17 April 2009|| David Button||Dagenham & Redbridge||1 May 2009"]}, {"page": "Odion Ighalo", "response": ["Ighalo joined Watford on a season-long loan deal from Udinese, on 29 July 2014. He made his debut for the English club in the first round of the League Cup away to Stevenage on 12 August, and scored his first goal in the Championship against Brentford on 30 September by tucking the ball home after his initial penalty was saved by David Button, in a 2–1 home win."]}, {"page": "Button (name)", "response": ["*David Button (born 1989), English football goalkeeper"]}, {"page": "2008–09 Luton Town F.C. season", "response": ["|align=\"left\"|35||align=\"left\"|GK||align=\"left\"| David Button", "| 6 March 2009 ||  David Button || Tottenham Hotspur || 6 April 2009 || style=\"text-align:center;\"|"]}, {"page": "2009 Football League Trophy Final", "response": ["|GK ||35|| David Button"]}, {"page": "2009–10 Crewe Alexandra F.C. season", "response": ["* 20 August: Tottenham Hotspur recall on-loan 'keeper David Button.", "* 1 September: Crewe lose in the Football League Trophy to Stockport County, the first Cheshire derby of the season. and re-sign David Button on loan until 3 January.", "* 27 October: Tottenham Hotspur recall on loan 'keeper David Button again."]}, {"page": "2009–10 Tottenham Hotspur F.C. season", "response": ["Throughout the transfer window, a number of loans were negotiated. Early in the transfer window, youngsters Ryan Mason and Steven Caulker joined Yeovil Town on loan for six months, followed soon by Adel Taarabt returning to Queens Park Rangers for a season-long loan. The transfers continued, as Troy Archibald-Henville rejoined Exeter City until January 2010, and on the same day, it was revealed that goalkeeper Ben Alnwick would join newly relegated Norwich City for three months. After this, young Adam Smith joined Wycombe Wanderers for an initial one-month deal, subsequently followed by the development of the deal to send Andros Townsend to long-term affiliate Leyton Orient for a period of six months. After a good pre-season with Spurs, midfielder Jake Livermore signed for Derby County for a period of a month but later extended to six thanks to a series of good performances. Jon Obika joined his fellow Spurs loanees at Yeovil in mid-August, putting pen to paper for an initial one-month loan. The loans continued with Jamie O'Hara joining Portsmouth until January 2010, in an effort to get first team football, followed later by the loan of midfielder Sam Cox to Cheltenham for one month. The last loans of the summer transfer window involved three youth goalkeepers, with David Button, Oscar Jansson and Lee Butcher joining Crewe Alexandra, Exeter and Grays Athletic respectively.", "| 22 July 2009 || David Button||Crewe Alexandra||20 August 2009", "| 1 September 2009 || David Button||Crewe Alexandra||27 October 2009", "| 20 November 2009 || David Button||Shrewsbury||5 May 2010", "| align=\"left\" |  David Button", "|| 35 || align=\"left\" | David Button|| 0 || 0 || 1 || 1"]}, {"page": "2010–11 Southampton F.C. season", "response": ["The season got off to a disappointing start for Southampton, who lost 1–0 to Plymouth Argyle in the opening game of the season on 7 August 2010. Despite dominating the first half, it was the visiting side who broke the deadlock when Luke Summerfield scored within two minutes of the beginning of the second half. Substitute Adam Lallana was the first to test Argyle goalkeeper David Button in the last quarter of the game, but the home side failed to regain their early momentum to slip to a defeat in their first game of the campaign despite a number of late chances. The club were due to play Milton Keynes Dons at Stadium:mk on 14 August, but due to the death of Markus Liebherr the match was rescheduled for 15 September. On 21 August Southampton picked up their first league point of the season against Leyton Orient, drawing 1–1 at St Mary's. On his return to the team following injury, Rickie Lambert scored a free kick early in the game to put the Saints ahead, only for Terrell Forbes to equalise two minutes later with a headed goal. Momentum changed hands throughout the remainder of the game, and a number of chances were created but missed by Southampton players, not least Lee Barnard, but the game ended level to leave the Saints in the bottom quarter of the table. The following week the club recorded their first win of the season, with an emphatic 4–0 away victory over Bristol Rovers. The game saw defender José Fonte score his debut for the club, as well as goals from Adam Lallana and a penalty from Rickie Lambert, ending in the final minute with Lee Barnard's first goal of the season. Despite this impressive win, it was the last game for manager Alan Pardew, who was sacked just days later."]}, {"page": "2010–11 Plymouth Argyle F.C. season", "response": ["Goalkeeper David Button joined the club on a season-long loan from Tottenham Hotspur,\"Plymouth Argyle sign Tottenham Hotspur goalkeeper David Button\". The Plymouth Herald. 4 August 2010. Retrieved 15 January 2011. and defender Lee Molyneux signed a permanent contract after impressing on trial.\"Molyneux in contention for Argyle debut against previous club\". The Plymouth Herald. 5 August 2010. Retrieved 15 January 2011. Two other players left the club on loan. Defender Chris Barker joined Southend United for one month, and midfielder Damien Johnson signed a season-long deal with Huddersfield Town. The club started the season with a 1–0 win at Southampton.\"Southampton 0–1 Plymouth\". BBC Sport. 7 August 2010. Retrieved 7 August 2010. Luke Summerfield scored the winning goal in a match which was broadcast live on Sky Sports.\"Early goals give Sheffield Wednesday winning start against Dagenham\". The Guardian. 7 August 2010. Retrieved 27 August 2010.\"Pilgrims off to best possible start as Saints put to sword\". The Plymouth Herald. 9 August 2010. Retrieved 15 January 2011. They were knocked out of the League Cup by Notts County three days later. A second half goal from John Spicer eliminated Argyle at the first round stage for the third year in row.\"Plymouth 0–1 Notts County\". BBC Sport. 10 August 2010. Retrieved 11 August 2011. Midfielder Dean Parrett arrived on a season-long loan from Tottenham Hotspur.\"Parrett set for Argyle bow\". TeamTalk. 13 August 2010. Retrieved 21 June 2014. A late goal from Rory Patterson earned the club a share of the points at Home Park against Carlisle United in a 1–1 draw, having fallen behind to an Ian Harte goal.\"Plymouth 1–1 Carlisle\". BBC Sport. 14 August 2010. Retrieved 14 August 2010. This was followed by a 2–1 defeat at Walsall. Joe Mason gave Argyle the lead, but second half goals from Paul Marshall and former player Reuben Reid won the game for the home side.\"Walsall 2–1 Plymouth\". BBC Sport. 21 August 2010. Retrieved 21 August 2010. Kári Árnason was shown a straight red card in stoppage time.\"Plymouth Argyle 'own worst enemies' in defeat at Walsall\" . The Plymouth Herald. 23 August 2010. Retrieved 27 August 2010. Sean Kinsella and Jordan Trott were loaned out to Bridgwater Town for one month.\"Peter Reid rubbishes rumour of Adam Le Fondre player-plus-cash deal\" . The Plymouth Herald. 31 August 2010. Retrieved 16 January 2011. Argyle were defeated 3–0 at home by Peterborough United, who scored three second-half goals thanks to strikers Craig Mackail-Smith, who scored twice, and Aaron McLean.\"Plymouth 0–3 Peterborough\". BBC Sport. 28 August 2010. Retrieved 2 September 2010. The club completed two transfers before the summer transfer window closed. Defender Stéphane Zubar arrived from Vaslui on a free transfer,\"Pilgrims snap up Zubar\". Sky Sports. 31 August 2010. Retrieved 21 June 2014. and Chris Barker joined Southend United permanently, also on a free transfer, after spending a month with them on loan.", "|align=\"left\"| David Button", "|Free transfer\"Plymouth Argyle sign goalkeeper David Button\". BBC Sport. 3 August 2010. Retrieved 3 August 2010.", "| David Button"]}, {"page": "2010–11 Tottenham Hotspur F.C. season", "response": ["The transfer window also saw younger player acquires loan move to gain regular football. The first loan move saw young goalkeeper David Button, fresh off of signing a new three-year contract, join Plymouth Argyle on a season-long loan, followed by another young goalkeeper, Oscar Jansson, joining Northampton Town until September 2010, and completing three loan moves in a week, England under-19 international John Bostock left to join Hull City for the duration of the 2010–11 season. Six days later, winger Andros Townsend signed a season-long loan for Ipswich Town after featuring for Tottenham in their pre-season tour of the United States. On the same day, Dean Parrett joined David Button at Plymouth on a one-month deal. The following day, Ryan Mason, who also featured in Spurs' pre-season, joined Doncaster Rovers on a one-month deal, trailed a week later with young striker Jon Obika clinching a move to Crystal Palace for the season.", "|3 August 2010 || David Button||Plymouth Argyle||End of 2010–11 Season"]}]}}