{"wiki_id": "http://www.wikidata.org/entity/Q117041", "itemLabel": "Selwyn Edge", "itemDescription": "British businessman and racing driver (1868-1940)", "wikipedia_url": "https://en.wikipedia.org/wiki/Selwyn_Edge", "wikipedia_page": {"main": "Selwyn Francis Edge (1868–1940) was a British businessman, racing driver, cyclist and record-breaker. He is principally associated with selling and racing De Dion-Bouton, Gladiator; Clemént-Panhard, Napier and AC cars.", "link_mentions": [{"page": "William Friese-Greene", "response": ["In 1911, George Albert Smith and Charles Urban filed a lawsuit against Friese-Greene, claiming that the Biocolour process infringed upon Smith's Kinemacolor patents, despite the fact that Friese-Greene had both patented and demonstrated his work before Smith. Urban was granted an injunction against Biocolour in 1912, but the Sussex-based, flamboyant racing driver Selwyn Edge became an investor in the system and funded an appeal to the High Court. This overturned the original verdict on the grounds that Kinemacolor made claims for itself which it could not deliver. Urban fought back and pushed it up to the House of Lords, which in 1915 upheld the decision of the High Court. The decision benefited nobody. For Urban it was a case of hubris because now he could no longer exercise control over his own system, so it became worthless. For Friese-Greene, the arrival of the war and personal poverty meant there was nothing more to be done with colour for some years."]}, {"page": "Spyker", "response": ["In 1922, racing driver Selwyn Edge took to Brooklands in a Spyker C4 fitted with streamlined racing bodywork, setting a new \"Double 12\" average world speed record, covering 1,782 miles (2,868 km) at an average speed of  for the 24 hour aggregate of two 12-hour periods.The Manchester Guardian, 21 July 1922, Page 7."]}, {"page": "AC Cars", "response": ["In 1921, Selwyn Edge (who had previously been with Napier) bought shares in the company, and was subsequently appointed governing director. He did not get along with Weller or Portwine, who resigned less than a year later. In customary fashion, Edge sought publicity for the company through motoring competition.", "Selwyn Edge bought the company outright for £135,000 in 1927 and re-registered it as AC (Acedes) Ltd., but sales, which had been falling, continued to decline. The company was caught by the crash of 1929 and went into voluntary liquidation."]}, {"page": "Tractor", "response": ["The first commercially successful light-weight petrol-powered general purpose tractor was built by Dan Albone, a British inventor in 1901.Moffitt, John. The Ivel Story.  He filed for a patent on 15 February 1902 for his tractor design and then formed Ivel Agricultural Motors Limited. The other directors were Selwyn Edge, Charles Jarrott, John Hewitt and Lord Willoughby. He called his machine the Ivel Agricultural Motor; the word \"tractor\" came into common use after Hart-Parr created it. The Ivel Agricultural Motor was light, powerful and compact. It had one front wheel, with a solid rubber tyre, and two large rear wheels like a modern tractor. The engine used water cooling, utilizing the thermo-syphon effect. It had one forward and one reverse gear. A pulley wheel on the left hand side allowed it to be used as a stationary engine, driving a wide range of agricultural machinery. The 1903 sale price was £300. His tractor won a medal at the Royal Agricultural Show, in 1903 and 1904. About 500 were built, and many were exported all over the world. The original engine was made by Payne & Co. of Coventry. After 1906, French Aster engines were used."]}, {"page": "Brooklands", "response": ["On 28–29 June 1907, eleven days after the circuit opened, it played host to the world's first 24-hour motor event, with Selwyn Edge leading three specially converted Napier cars around the circuit. A statement of intent had been made in 1906, and Selwyn Edge entered into a physical training program to prepare for the event. His car, \"804\" was extensively modified, having a special fuel tank, bodywork removed, and a special windscreen. Over 300 red railway lamps were used to light the track during the night. Flares were used to mark the upper boundary of the track. Edge drove his car for the full duration, with the drivers of the other two cars (Henry C. Tryon/A. F. Browning and F. Draper/Frank Newton) taking the more familiar shift approach. During the event Edge covered a distance of  at an average speed of , comfortably beating the existing record of  set at Indianapolis in 1905.Record Motor Drive At Brooklands. The Times (London, England): Issue 38373 Monday, 1 July 1907; p. 6"]}, {"page": "1902 in sports", "response": ["* The third Gordon Bennett Cup is run from Paris to Innsbruck and won by Selwyn Edge (Great Britain) driving a Napier 30hp."]}, {"page": "Motorboat", "response": ["The first competition, held in July 1903, at Cork Harbour in Ireland, and officiated by the Automobile Club of Great Britain and Ireland and the Royal Victoria Yacht Club, was a very primitive affair, with many boats failing even to start. The competition was won by Dorothy Levitt in a Napier launch designed to the specifications of Selwyn Edge. This motorboat was the first proper motorboat designed for high speed. She set the world's first water speed record when she achieved  in a  steel-hulled, 75-horsepower Napier speedboat fitted with a three-blade propeller. As both the owner and entrant of the boat, \"S. F. Edge\" was engraved on the trophy as the winner."]}, {"page": "Gordon Bennett Cup (auto racing)", "response": ["On Thursday, 2 July 1903 the Gordon Bennett Cup was the first international motor race to be held in Ireland, an honorific to Selwyn Edge who had won the 1902 event in the Paris-Vienna race driving a Napier. The Automobile Club of Great Britain and Ireland wanted the race to be hosted in the British Isles, and their secretary, Claude Johnson, suggested Ireland as the venue because racing was illegal on British public roads. The editor of the Dublin Motor News, Richard J. Mecredy, suggested an area in County Kildare, and letters were sent to 102 Irish MPs, 90 Irish peers, 300 newspapers, 34 chairmen of county and local councils, 34 County secretaries, 26 mayors, 41 railway companies, 460 hoteliers, 13 PPs, plus the Bishop of Kildare and Leighlin, Patrick Foley, who pronounced himself in favour. Local laws had to be adjusted, ergo the 'Light Locomotives (Ireland) Bill' was passed on 27 March 1903. Kildare and other local councils drew attention to their areas, whilst Queen’s County declared That every facility will be given and the roads placed at the disposal of motorists during the proposed race. Eventually Kildare was chosen, partly on the grounds that the straightness of the roads would be a safety benefit. As a compliment to Ireland the British team chose to race in Shamrock green which thus became known as British racing green although the winning Napier of 1902 had been painted Olive green.Forix 8W – Britain's first international motor race by Brendan Lynch, based on his Triumph of the Red Devil, the 1903 Irish Gordon Bennett Cup Race. October 22, 2003The Gordon Bennett races – the birth of international competition. Author Leif Snellman, Summer 2001", "|  Selwyn Edge"]}, {"page": "List of international auto racing colours", "response": ["When Britain first competed in 1902, it had to choose a different colour from her national colours of red, white and blue, as these had already been allocated. Selwyn Edge's winning Napier of 1902 was painted olive green, and green was well-established as an appropriate colour for locomotives and machinery, in which Britain had led the world during the previous century.   When Britain hosted the 1903 Gordon Bennett Cup the following year on a closed course at Athy in Ireland, the British adopted Shamrock green which later evolved into various shades of 'British racing green'."]}, {"page": "British racing green", "response": ["In the days of the Gordon Bennett Cup, Count Eliot Zborowski, father of inter-war racing legend Louis Zborowski, suggested that each national entrant be allotted a different colour. Every component of a car had to be produced in the competing country, as well as the driver being of that nationality. The races were hosted in the country of the previous year's winner. When Britain first competed in 1902, they had to choose a different colour from the national flag colours of red, white and blue, because those had already been taken for the 1900 race by America, Germany and France respectively. When Selwyn Edge won the 1902 Gordon Bennett Cup race for England in his Napier it was decided that the 1903 race would be held in Ireland, at that time a part of the United Kingdom, as motor racing at the time was illegal in Great Britain. As a mark of respect for their Irish hosts the English Napier cars were painted shamrock green."]}, {"page": "Spyker C8", "response": ["The name 'Double 12' is a reference to the 24-hour world speed record, set in 1922 by racing driver Selwyn Edge in a Spyker C4."]}, {"page": "1926 24 Hours of Le Mans", "response": ["The 1926 24 Hours of Le Mans was the 4th Grand Prix of Endurance, and took place on 12 and 13 June 1926. It was the first Le Mans race where the winner's average speed was over , and also the first to break the 24-hour distance record set by Selwyn Edge at Brooklands in 1907."]}, {"page": "1925 24 Hours of Le Mans", "response": ["The other new British team to enter was AC Cars. Originally making a 3-wheel delivery vehicle called an Auto Carrier, it was the post-war investment by famous British racer Selwyn Edge, that got the new AC Six into production. The entry was raced by John Joyce and Victor Bruce (engaged to famous female racer Mary Petre).Spurring 2011, p.166"]}, {"page": "Harmsworth Cup", "response": ["1904 Harmsworth Trophy England won the trophy in 1903 with Dorothy Levitt driving a Napier-powered, 40-foot steel-hulled boat at 19.53 mph at Queenstown in Cork harbour, . It was owned and entered by Selwyn Edge a director of Napier Motors. France won in 1904. In 1907, it was won by Americans for the first time.1907 Harmsworth Trophy The US and England traded it back and forth until 1920. From 1920 to 1933, Americans had an unbroken winning streak. Gar Wood won this race eight times as a driver and nine times as an owner between 1920 and 1933.", "|1903||Queenstown (now Cobh), Ireland||Napier I||Selwyn Edge||UK||E. Campbell Muir/Dorothy Levitt||19.53", "|1905||Arcachon, France||Napier II||Selwyn Edge||UK||Lord Montagu||26.03"]}, {"page": "Dan Albone", "response": ["Albone conceived a light-weight petrol-powered general purpose agricultural vehicle. By November 1901 he had completed his tractor design, and filed for a patent on 15 February 1902. On 12 December 1902 he formed Ivel Agricultural Motors Limited. The other directors were Selwyn Edge, Charles Jarrott, John Hewitt and Lord Willoughby. He called his machine the Ivel Agricultural Motor, the word 'tractor' did not come into common use until later."]}, {"page": "Category talk:Female racing drivers", "response": ["Later in 1903 Dorothy Levitt won the inaugural British International Harmsworth Trophy at Cork Harbour in Ireland.  She won at 19.3 mph in a steel hulled, Napier powered speedboat fitted with a 3 blade propeller, owned by Selwyn Edge.", "In 1905 Dorothy Levitt drove an 80hp Napier at the annual speed trials in Brighton, winning both her class and the Autocar Challenge Trophy.  Additionally a ‘works drive’ in a French Mors in the Tourist Trophy had been prohibited by Selwyn Edge in order to protect the reputation of his Napier marquee.", "She was effectively both a 'works driver' and publicist for Napier cars owned by Selwyn Edge, plus also being his mistress for a period."]}, {"page": "Dorothy Levitt", "response": ["Scant information is available about Levitt's life except indications that she was an experienced horse rider. She described remaining astride a galloping horse while it negotiated jumps in a steeplechase as easier than retaining a seat in a car being driven at speed. In 1902 she was employed as a secretary at the Napier & Son works in Vine Street, Lambeth, where she was engaged initially on a temporary basis. The Napier engineering company had been purchased by Montague Napier from the executors of his father's estate. After undertaking work for Selwyn Edge on his Panhard et Levassor racing car, Napiers diversified to manufacturing cars in 1899. At this time the British motor industry was only beginning to develop; even the suggestion of motor races on public roads caused an outcry with hill climbs and speed tests having to be undertaken on private land.", "In July 1903 (possibly the 12th), Levitt won the inaugural British International Harmsworth Trophy for motor-boats, defeating the French entry Trefle-A-Quatre. The event was officiated by the Automobile Club of Great Britain and Ireland and the Royal Victoria Yacht Club and took place at the Royal Cork Yacht Club at Cork Harbour in Ireland. Levitt set the world's first Water Speed Record when she achieved  in a  steel-hulled, 75-horsepower Napier speedboat fitted with a 3-blade propeller. Selwyn Edge was both the owner and entrant of the boat, and thus \"S. F. Edge\" is engraved on the trophy as the winner. The third crew member, Campbell Muir, may also have taken the controls. An article in the Cork Constitution on 13 July reported \"A large number of spectators viewed the first mile from the promenade of the Yacht Club, and at Cork several thousand people collected at both sides of the river to see the finishes.\"", "Her success and skills meant that she was offered a works drive in a French Mors in the inaugural RAC Tourist Trophy Race on the Isle of Man, but she was prohibited from accepting by Selwyn Edge, to protect the reputation of his Napier marque. Ironically the  1905 event was won by Mr. J. S. Napier in his Arrol Johnson car, ahead of 40 competitors."]}, {"page": "Mrs Victor Bruce", "response": ["Bruce borrowed an AC Six car (PF6465) from Selwyn Edge, and started the 1927 Monte Carlo Rally from John o' Groats. After travelling  in 72 hours without sleeping, she finished sixth overall, and won the Coupe des Dames, for the women's class. On 28 January 1927, she departed Monte Carlo on an  endurance trial through Italy, Sicily, Tunisia, Morocco, Spain, and France. She drove the car  around the Montlhéry oval circuit near Paris, then finally returned to England. On 9 July 1927, she departed from London in the same car (PF6465), once again accompanied by her husband plus a journalist and an engineer. They drove through France, Belgium, the Netherlands, Germany, Denmark, Sweden, Finland, and finally planted a Union Jack about  north of the Arctic Circle. It was farther north than anyone had previously driven, a record that remained unbroken until the 21st century."]}, {"page": "Hugh F. Locke King", "response": ["Locke King was spurred on by Selwyn Edge (1868–1940), an experienced racing driver and car dealer, to complete the project with his highly publicised challenge that he would drive the course in a Napier (Lion) single-handedly at a constant 60 mph for 24 hours without a rest break. Edge was to complete his remarkable challenge on the finished track without mishap. His wife took over the supervision of the finish of the build after Locke King became too ill due to stress to continue partly due to the escalating costs to finish it. An aerodrome was constructed within the Track in 1909 and this soon attracted many pioneer aviators who collectively helped to create the British aviation industry."]}, {"page": "1907 Grand Prix season", "response": ["Great Britain had a universal speed limit of  on the open road and did not allow motor-racing on public roads, as on the continent Rendall 1993, p.50 (however these laws did not apply in Ireland or the Isle of Man). Therefore, constructed at his own expense, Hugh F. Locke King established the first purpose-built racetrack in the world at Brooklands on his estate in Surrey. A pear-shaped course, with banking at each end, it was  long and  wide. It opened on 28 June with Selwyn Edge setting a new 24-hour distance record of . The first full race meeting was on 6 July with six races. Georgano 1971, pp.70-1"]}, {"page": "Motorsport before 1906", "response": ["|  Selwyn Edge"]}, {"page": "Montague Napier", "response": ["Following a meeting with businessman and racing driver Selwyn Edge in 1899 Napier diversified into automobile manufacturer, and for a time his company was the leading supplier of luxury cars in the British market. His focus switched from cars to aircraft engines after the outbreak of the First World War in 1914, and he developed the very successful Lion engine.", "Motor historian Peter King describes Napier as \"very secretive by nature\"; not much is known about his early life. He was born on 14 April 1870 at 68 York Road, Lambeth, London, the youngest of the four sons of James Murdoch Napier and his wife, Fanny Jemima, née Mackenzie. His father had taken over his own father's interest in the engineering business he had set up there by 1836, making printing machinery for the newspaper industry. The business diversified unto making coin-weighing machines for the Royal Mint, but by the time of James Murdoch Napier's death in 1895 it was in decline. Napier had worked in the family business from an early age, but he was not doing so at the time of his father's death. He bought the business from the executors of his father's estate and diversified into producing machine tools for the cycle industry. As an avid racing cyclist he had been participating in races of the North Road Cycling Club alongside riders like Selwyn Edge. In the 1891 100 Mile Road Race on the Great North Road he finished fourth.", "Napier met Selwyn Edge again in 1899, for whom he agreed to build a car based on Edge's Panhard et Levassor, which he had bought after it came second in the 1896 Paris–Marseilles race. So impressed was Edge with the result that he contracted to buy six more cars, and set up a showroom in London from which to sell them. The first cars were ready by 1900, and so successful were they that Napier decided to move his company to larger premises in Acton, London. While Napier concentrated on the engineering Edge focused on the marketing and publicity. In 1902 he drove a Napier to victory in that year's Gordon Bennett Cup, the first British victory in an international motor race. Napier cars dominated the British luxury car market until 1906, but Napier was unconvinced that there was a sustainable long-term market for such vehicles, unlike Rolls-Royce, his main competitor. Napier therefore set up a new company to develop more popular cars."]}, {"page": "1902 Gordon Bennett Cup", "response": ["The 1902 Gordon Bennett Cup, formally titled the III Coupe Internationale, was a motor race held on 26–28 June 1902, on public roads between Paris, France, and Innsbruck, Austria. The race was held over a 565 km section of the route of the Paris-Vienna race, held concurrently. France were to attempt to defend the Gordon Bennett Cup against Britain, and each country was represented by three entries, with the car that finished the race in the shortest time winning the race on behalf of his country. Selwyn Edge driving a Napier, and representing the Automobile Club of Britain and Ireland, was the only competitor to finish the race and so Britain were the winners of the Gordon Bennett Cup and would be required to defend it in Britain the following year.", "|  Selwyn Edge "]}, {"page": "Edge (surname)", "response": ["* Selwyn Edge (1868–1940), British businessman, racing driver, and cyclist"]}, {"page": "Selwyn Francis Edge", "response": ["#redirect Selwyn Edge"]}, {"page": "S. F. Edge", "response": ["#redirect Selwyn Edge"]}, {"page": "1903 Gordon Bennett Cup", "response": ["On Thursday, 2 July 1903 the Gordon Bennett Cup was the first international motor race to be held in Ireland, an honorific to Selwyn Edge who had won the 1902 event in the Paris-Vienna race driving a Napier. The Automobile Club of Great Britain and Ireland wanted the race to be hosted in the British Isles, and their secretary, Claude Johnson, suggested Ireland as the venue because racing was illegal on British public roads. The editor of the Dublin Motor News, Richard J. Mecredy, suggested an area in County Kildare, and letters were sent to 102 Irish MPs, 90 Irish peers, 300 newspapers, 34 chairmen of county and local councils, 34 County secretaries, 26 mayors, 41 railway companies, 460 hoteliers, 13 PPs, plus the Bishop of Kildare and Leighlin, Patrick Foley, who pronounced himself in favour. Local laws had to be adjusted, ergo the 'Light Locomotives (Ireland) Bill' was passed on 27 March 1903. Kildare and other local councils drew attention to their areas, whilst County Laois declared That every facility will be given and the roads placed at the disposal of motorists during the proposed race. Eventually Kildare was chosen, partly on the grounds that the straightness of the roads would be a safety benefit. As a compliment to Ireland the British team chose to race in Shamrock green which thus became known as British racing green, although the winning Napier of 1902 had been painted Olive green.Forix 8W – Britain's first international motor race by Brendan Lynch, based on his Triumph of the Red Devil, the 1903 Irish Gordon Bennett Cup Race. October 22, 2003The Gordon Bennett races – the birth of international competition. Author Leif Snellman, Summer 2001", "|  Selwyn Edge "]}, {"page": "Charles Cooper (motor manufacturer)", "response": ["On leaving school, Charles Cooper was taken on as an apprentice at Napier & Son's engineering works in Acton. It was while working at the Napier plant that Cooper got his first taste of motor sport, working on the racing and record-breaking cars of company director and pioneering driver Selwyn Edge. Soon after completing his apprenticeship World War I broke out. Britain declared war on 3 August 1914, and only three weeks later Cooper enlisted in the Royal Army Service Corps. He saw active service throughout the war, invalided home after being gassed during the capture of Valenciennes in late 1918, only weeks before the signing of the Armistice with Germany."]}, {"page": "William Watson (motoring pioneer)", "response": ["In August 1908 Watson bought from Selwyn Edge his 1907-built four cylinder racing car known as Little Dorrit, after being impressed by its performance at the newly constructed Brooklands track.  The car was named a Hutton rather than a Napier because Edge had been successfully promoting the merits of six cylinder Napiers and did not want to be associated with a four cylinder car.  Hutton, a young motor dealer, had been allowed to form a separate company to run the four cylinder Napier-made cars.  Three Huttons were in preparation for the big race.", "In 1905 Watson became agent for Napier cars thanks to his cycling connection with Selwyn Edge.  He later wrote that he considered Napiers to have been the best British cars for about the first seven years of the century.", "The company moved to larger premises at 56–58 Renshaw Street, Liverpool in 1907.  Watson became one of the first Rolls Royce agents in 1908, having tested a Silver Ghost the previous year, been impressed by its quietness and performance and having immediately applied for the franchise.  Privately in Wales he demonstrated it to Selwyn Edge, who had believed that there was no better car than the Napier."]}, {"page": "1901 Gordon Bennett Cup", "response": ["The British were to be represented in the event by Selwyn Edge driving a Napier. On the way from Britain to France, Edge had reservations about the Dunlop tires fitted to the car and elected to replace them with tires of foreign manufacture making the car ineligible for the Gordon Bennett race. As a result, Edge transferred his entry to the open Paris-Bordeaux event leaving only the French to compete in the Gordon Bennett Cup race."]}, {"page": "1904 Gordon Bennett Cup", "response": ["There were 18 starters from eight countries,Grand Prix History online (retrieved 11 June 2017) including three British entrants. The first car started from Saalburg at 7 a.m. The winner was France's Leon Théry, who accomplished the four laps in , an average speed of .Grand Prix History online (retrieved 11 June 2017) says  With each of his lap times within 3 minutes of the other, he earned his nickname of \"the Chronometer\".Grand Prix History online (retrieved 11 June 2017) Jenatzy was second, driving a Mercedes. The only British competitor placed was Sidney Girling driving a Wolseley. Australia'sHull, Peter G. \"Napier: The Stradivarius of the Road\", in Northey, Tom, ed. The World of Automobiles (London: Orbis, 1974), Volume 13, p.1483. Selwyn Edge, the 1902 winner who again drove a Napier, was reported to have held a good position during the first two laps, but was disqualifiedHull, p.1488. on lap three after receiving outside assistance due to tyre problems.Onlookers helped throw buckets of water over the wheels to cool the tyres.", "|  Selwyn Edge "]}]}}