{"wiki_id": "http://www.wikidata.org/entity/Q11860480", "itemLabel": "Gillian Ayres", "itemDescription": "British artist (1930-2018)", "wikipedia_url": "https://en.wikipedia.org/wiki/Gillian_Ayres", "wikipedia_page": {"main": "Gillian Ayres  (3 February 1930 – 11 April 2018) was an English painter. She is best known for abstract painting and printmaking using vibrant colours, which earned her a Turner Prize nomination.", "link_mentions": [{"page": "Turner Prize", "response": ["Sculpture and installation artist Richard Long is presented the prize after three previous nominations. Controversially, Long is awarded for his lifetime body of work rather than an exhibition of work in 1989. Other nominees included painter Gillian Ayres, figurative painter Lucian Freud, Italian-born sculptor Giuseppe Penone, painter Paula Rego, abstract painter Sean Scully and Richard Wilson. Italian Giuseppe Penone became the first foreign artist to be nominated for the strength of his exhibitions in Britain."]}, {"page": "Howard Hodgkin", "response": ["In 1980, Hodgkin was invited by John Hoyland to exhibit work as part of the Hayward Annual at the Hayward Gallery along with Gillian Ayres, Basil Beattie, Terry Setch, Anthony Caro, Patrick Caulfield, Ben Nicholson and others."]}, {"page": "List of British painters", "response": ["*Gillian Ayres (1930–2018)"]}, {"page": "Timeline of art", "response": ["* 2018 in art - Death of Mauro Staccioli, Betty Woodman, Vladimir Yankilevsky, Carlo Pedretti, Kynaston McShine, William Scharf, Ed Moses, Jack Whitten, Robert Pincus-Witten, Sonia Gechtoff, Frank Gaylord, Gillian Ayres, Marcia Hafif, Per Kirkeby, Tom Wolfe, Robert Indiana, Alan Bean, Gregg Juarez, Malcolm Morley, Irving Sandler, Michaele Vollbracht, David Goldblatt. Sabina Ott, Krishna Reddy, Paul Taylor, Irving Petlin, Tchan Fou-li, Annette Michelson, Robert Venturi, Geta Brătescu, Henry Wessel Jr., Jane Fortune, Helena Almeida, Milton Gendel,.Mel Ramos, Paul Allen, Jacques Monory, Harold Stevenson, Karl-Heinz Adler, Stan Lee, Lubomir Tomaszewski, Peter Peryer, Robert Morris, Vivian Lynn, Enrico Crispolti, Wendy Beckett, Jean Dumontier"]}, {"page": "Camberwell College of Arts", "response": ["* Gillian Ayres  (1989 Turner Prize nominee)"]}, {"page": "Murray Edwards College, Cambridge", "response": ["* Gillian Ayres"]}, {"page": "Momart", "response": ["*1988 — Gillian Ayres"]}, {"page": "1930 in art", "response": ["* 3 February – Gillian Ayres, English abstract painter (d.2018)"]}, {"page": "Bath School of Art and Design", "response": ["Visiting artists and tutors have included Kenneth Armitage, William Scott, Terry Frost, Peter Lanyon, Sir Herbert Read, Adrian Heath, Bernard Meadows, Howard Hodgkin, Anthony Fry, Martin Froy, John Colbeck, John Furnival, Gillian Ayres, Peter Potworowski, Claes Oldenburg, James Greaves, Peter Kinley, James Tower, John Hoskin, Mark Lancaster, Michael Craig-Martin, John Ernest, Anthony Hill, Richard Hamilton, Roger Clarke, Jim Dine, Tom Phillips, Jeremy Gardiner and Morton Feldman."]}, {"page": "St Paul's Girls' School", "response": ["* Gillian Ayres – artist"]}, {"page": "Stephen Snoddy", "response": ["He worked from 1987 to 1991 on an exhibition programme that included solo exhibitions by Richard Long, Giuseppe Penone, Gillian Ayres, Rachel Whiteread, Vong Phaophanit, Jannis Kounellis: Drawings, Jack B. Yeats: The Late Works (which toured to the Whitechapel Art Gallery and Haags Gemeentemuseum) and the first solo exhibition of Juan Muñoz in the UK."]}, {"page": "Norman Rosenthal", "response": ["Rosenthal was notoriously unpopular with Royal Academicians. Many felt their work had been ignored by the Exhibitions Secretary, and was only displayed in the annual Summer Exhibition with which Rosenthal played no part.\" I want the best exhibitions. That's that,\" Rosenthal told Fiona Maddocks in an article for the Evening Standard in 1998. \"OK. Strictly speaking all the Academicians are equal,\" he continued, \"But it's an open secret that some are more equal than others: Tracey Emin, Norman Foster, Zaha Hadid, David Hockney, Gary Hume, Anish Kapoor, Tom Phillips, Richard Rogers, the 'Angel of the North man'.\" In an interview on BBC Omnibus in 1997 he questioned the significance of the artist John Ward, a Royal Academician, and was felt to have ridiculed an elderly Victor Pasmore. That month three Academicians resigned – Michael Sandle (who subsequently rejoined), Craigie Aitchison and Gillian Ayres. Two cited the treatment of Pasmore as one of their chief reasons for going. The inclusion of Myra, Marcus Harvey's contentious portrait of Myra Hindley, in the Sensation exhibition and Rosenthal himself were other reasons cited. In 2004, Rosenthal was nearly sacked by Lawton Fitt, an ex-Goldmann Sachs banker who took the role of the Royal Academy's Secretary. \"Fitt and two others sent me a fax saying my services were no longer required and I should find a solicitor,\" Rosenthal has said. \"I did: Cherie Blair. My biggest regret is not having seen their faces when they received her letter.\""]}, {"page": "John Kasmin", "response": ["Other artists that Kasmin showed included Barnett Newman, Ad Reinhardt, Frank Stella, Kenneth Noland, Morris Louis, Helen Frankenthaler, Anthony Caro, William G. Tucker, John Latham, Richard Smith, Bernard Cohen, Robin Denny, Howard Hodgkin and Gillian Ayres."]}, {"page": "Carborundum printmaking", "response": ["* Gillian Ayres"]}, {"page": "Ken Eastman", "response": ["While in Edinburgh, Eastman worked mainly in Raku. After arriving at the Royal College of Art in London he experimented in various ways of working with ceramic form, including sculpture, before confining himself to painting on rectangle ceramic platter shapes in a style very much in the spirit of Gillian Ayres, an artist whose work he greatly admired at the time.Towers of Strength, article by Tanya Harrod, photos by Phil Sayer  For many years his making has centered around a slab building technique using painted ceramic colours and oxides."]}, {"page": "List of Turner Prize winners and nominees", "response": ["|Gillian AyresLucian FreudGiuseppe PenonePaula RegoSean ScullyRichard Wilson"]}, {"page": "List of cultural depictions of Cleopatra", "response": ["*Gillian Ayres: \"Antony and Cleopatra\" (1982)"]}, {"page": "Gillian", "response": ["* Gillian Ayres (born 1930), English painter"]}, {"page": "Gimpel Fils", "response": ["During the 1950s and 60s Gimpel Fils was highly influential in its association with the avant-garde.  It supported modern British artists, including those of the St Ives School, as well as rising American artists and French abstract painters of the School of Paris. Gimpel Fils represented many of the major artists of the time, including Barbara Hepworth and Ben Nicholson. Nicholson moved to Gimpel Fils from the Lefevre Gallery and stayed until the early 1960s.  In supporting the next generation of artists emerging in this period it gave first exhibitions to Lynn Chadwick, Anthony Caro, Peter Lanyon and Alan Davie, while also being associated with a number of other British artists, including Louis le Brocquy, Ivon Hitchens, Gillian Ayres, Bernard Meadows, Kenneth Armitage and Robert Adams.  From France Gimpel Fils represented the likes of Marie Laurencin, Pierre Soulages, Nicolas de Staël, Serge Poliakoff, Fahrelnissa Zeid, and Yves Klein, as well as working with American artists such as Marcel Duchamp, Alexander Calder, Willem de Kooning, Sam Francis and Larry Rivers, who had his first London exhibition at the gallery in 1962.Obituary: Peter Gimpel, The Times, 2 July 2005. Link to InfoTrac National Newspapers Database (requires login). Retrieved 2012-10-17. An obituary of Peter Gimpel in The Independent newspaper suggested that: \"Despite the rise of Marlborough Fine Art and stiff competition from the likes of the Redfern, Waddington and Hanover galleries, Gimpel Fils was for a time unrivaled in the range and quality of its artists.\""]}, {"page": "Theodore Mendez", "response": ["Theodore R P Mendez (1934–1997) was an English abstract artist who taught at Camberwell College of Arts in London for over thirty years. After attending Strand School, he entered Camberwell College of Arts in 1950 as a student, where his contemporaries included Terry Frost, Howard Hodgkin, Euan Uglow, Roy Turner Durrant, Bernard Dunstan and Gillian Ayres. He returned as a teacher; and from 1976-1984 was head of the Textile Department."]}, {"page": "Swindon Museum and Art Gallery", "response": ["Swindon Museum and Art Gallery's collection focuses on major artists and movements of 20th and 21st century British art, with several works presented by the Art Fund and the Contemporary Art Society. Artists in the collection include Simon Carter, Amanda Ansell, Ben Nicholson, Henry Moore, Lucian Freud, Graham Sutherland, L S Lowry, Paul Nash, Steven Pippin, Terry Frost, Roger Hilton, Howard Hodgkin, John Hoyland, Richard Hamilton, Gwen John, Augustus John, Maggi Hambling, John Bellany, Tony Bevan, Ivon Hitchens, John Piper, Christopher le Brun, Dennis Creffield, Lisa Milroy, Julie Umerle, David Leach, Lucie Rie, Hans Coper, Gillian Ayres, Linda Ingham, Robert Priseman, Sheila Fell, Eileen Cooper, Grayson Perry and William Turnbull.  The media include paintings, photography and studio pottery."]}, {"page": "List of 20th-century women artists", "response": ["*Gillian Ayres (1930–2018), painter"]}, {"page": "Myra (painting)", "response": ["Four members of the Royal Academy – Craigie Aitchison, Gillian Ayres, Michael Sandle and John Ward – resigned in protest at its inclusion in the exhibition.Young, p.34Stallabrass, p.313 The Metropolitan Police Clubs and Vice Unit visited the exhibition before it opened, but could find insufficient evidence to bring a prosecution in respect of any of the exhibits under the Obscene Publications Act.Young, p.35"]}, {"page": "Eric Craven Gregory", "response": ["Gregory’s collection, which had been housed in his tiny flat at 139 Swan Court, Chelsea, numbered some 150 items at his death. From it the Tate elected to take as gifts Louis Marcoussis’s Interior with a Double Bass, Moore’s Figure and Half-Figure, Hans Arp’s Constellation According to the Laws of Chance, Jean Dubuffet’s Man with a Hod, and Vieira da Silva’s Paris. Gregory’s executors (who included Bonamy Dobrée) also gave the Tate a Giacometti drawing closely related to the sculptor’s Man Pointing, already owned by the gallery, and agreed to sell to the Tate twelve further pieces comprising works by Moore, Hepworth, Paolozzi, Dalwood, Butler, Davie, Frost, Anthony Caro and Robert Clatworthy.Alice Correia, entry for Henry Moore’s Half-figure (T00241) under subject title \"Henry Moore: Sculptural Process and Public Identity\" () at https://www.tate.org.uk/art/research-publications/henry-moore/henry-moore-om-ch-half-figure-r1146178. The relevant items carry Tate Accession Numbers T00240 to T00245, T00262 to T00271, T00273 and T00274. In November 1959 Sotheby’s held two auctions of sculpture and paintings from the residual collection. The lots included twenty-one examples of work by members of the St Ives School (7 Nicholsons, 7 Hepworths, 5 Frosts, an Alfred Wallis and a Wilhelmina Barns-Graham), and paintings by Gillian Ayres, Sandra Blow and William Scott.Sotheby’s Modern British Art Sale Catalogue, 2 June 2004 (text in respect of Lot 61A, Ben Nicholson, Isle Tristan) at sothebys.com. A Moore sculpture of a small seated girl for which Gregory had paid £62 in 1931 sold for £2,800 in 1959: Illustrated London News, 29 July 1961."]}, {"page": "2011 Birthday Honours", "response": ["*Ms Gillian Ayres, OBE. For services to art."]}, {"page": "Christo Coetzee", "response": ["This time without a sponsor, he took an administrative position at a tobacco company, but found it wanting. He enquired at Gimpel Fils, where Peter and Ernest Gimpel (nephews of Lord Duveen) recommended taking a position at the framing business of Robert Savage, where, indeed, Coetzee found a more rewarding position. It was during this time that he took a painting to Gillian Ayres at the Artists' International Association (AIA), who in turn showed it to photographer and stylist Anthony Denney, who bought the painting immediately for £12."]}, {"page": "Mavis Cheek", "response": ["Mavis was educated in church schools until the age of 11 when she failed her eleven-plus examination and was placed in the B stream of her girls' secondary modern school in Raynes Park. They did not do O-levels in her stream, but they did do drama. She appeared in school plays, including the title role of Julius Caesar,Guardian interview. which began her lifelong love of theatre. She left school at 16 to become a receptionist with Editions Alecto, a Kensington art publishing company. They produced the first series of etchings by David Hockney, \"A Rake's Progress\", and other groundbreaking works by contemporary artists. She later moved to the firm's gallery in Albemarle Street, where she dealt with Hockney and other artists like Allen Jones, Patrick Caulfield and Gillian Ayres.Fantastic Fiction site: Retrieved 2 April 2012. In 1969 she married a \"childhood sweetheart\", whom she had met at a meeting of the Young Communist League in New Malden, when she was fifteen. They both attended the Wimbledon Youth Parliament. They separated when she was in her mid-twenties. Following this and after twelve happy years working with Editions Alecto, Mavis left to take a degree at Hillcroft College, a further education college for women, from which she graduated in the Arts with distinction. Shortly after this her daughter Bella by the artist Basil Beattie was born.Author's website. Retrieved 28 September 2012."]}, {"page": "Hastings Contemporary", "response": ["* Gillian Ayres"]}]}}