{"wiki_id": "http://www.wikidata.org/entity/Q1184760", "itemLabel": "Dorothy Stafford", "itemDescription": "English noblewoman and courtier (1526-1604)", "wikipedia_url": "https://en.wikipedia.org/wiki/Dorothy_Stafford", "wikipedia_page": {"main": "Dorothy Stafford, Lady Stafford (1 October 1526 – 22 September 1604) was an English noblewoman, and an influential person at the court of Queen Elizabeth I of England, to whom she served as Mistress of the Robes. Dorothy Stafford was the second wife of Sir William Stafford, widower of Mary Boleyn. She and her family sought exile in Geneva during the reign of Mary I to escape the persecution of their Protestant religion. The Protestant reformer John Calvin stood as godfather to her youngest son.", "link_mentions": [{"page": "October 1", "response": ["*1526 – Dorothy Stafford, English noble (d. 1604)"]}, {"page": "1604", "response": ["* September 22 – Dorothy Stafford, English noble (b. 1526)"]}, {"page": "1526", "response": ["* October 1 – Dorothy Stafford, English noble (d. 1604)"]}, {"page": "Lady Mary Grey", "response": ["Despite the disastrous consequences of her sister Katherine's secret marriage, Mary also now married without the Queen's permission. On 16 July 1565,Doran states the marriage took place on 10 or 12 August. while the Queen was absent attending the marriage of her kinsman, Sir Henry KnollysSir Henry Knollys was the son of Queen Elizabeth's first cousin, Catherine Carey. (d. 21 December 1582), and Margaret Cave, the daughter of Sir Ambrose Cave,. Mary secretly married the Queen's serjeant porter, Thomas Keyes, son of Richard Keyes, esquire, of East Greenwich, Kent, by Agnes Saunders, the daughter of Henry Saunders of Ewell, Surrey. Having learned from her sister's experience, Mary took the precaution of having three of her cousins attend as witnesses, her childhood friend, Mary Willoughby,Mary Willoughby was the daughter of Anne Grey and Sir Henry Willoughby of Wollaton, Nottinghamshire; . now the wife of Sir Matthew Arundell, and two of the daughters of Lady Stafford.De Lisle does not give the daughters' names; however she states that they were the daughters of Mary's lifelong friend Lady Dorothy Stafford, sister of Thomas Stafford (executed 1557); ; . The marriage was an unsuitable one for many reasons. Keyes was from a minor gentry family in Kent, was more than twice Mary's age, and was a widower with six or seven children.. Moreover, Mary was described by the Spanish ambassador as 'little, crook-backed and very ugly', while Keyes stood 6 feet 8 inches tall.; . Sir William Cecil wrote to Sir Thomas Smith that 'The Sergeant Porter, being the biggest gentleman of this court, has married secretly the Lady Mary Grey, the least of all the court ... The offence is very great'.Mary S. Lovell, Bess of Hardwick (Abacus, 2005), p. 178; ."]}, {"page": "Douglas Sheffield, Baroness Sheffield", "response": ["On 29 November 1579 Douglas Sheffield married Sir Edward Stafford,Jenkins 2002 p. 249 whose mother, Dorothy Stafford, was very influential with the Queen.Doran 1996 p. 161 From 1583 until 1591 Edward Stafford served as English ambassador to the court of Henry III of France; his wife accompanied him to Paris. There Lady Sheffield became a prominent figure in society and a special friend of Catherine de' Medici, whom she advised about a reform of the French royal household. By Stafford she had two sons, who both died young. The ambassador honoured his wife greatly, but had to cope with the fact that she was still emotionally agitated by remembrances of the Earl of Leicester.Jenkins 2002 p. 298 Stafford was politically opposed to Leicester, and the personal tensions aggravated this rivalry.Jenkins 2002 pp. 285–286, 325; Haynes 1992 p. 44"]}, {"page": "Henry Stafford, 1st Baron Stafford", "response": ["* Dorothy Stafford (1 October 1526 – 22 September 1604), who married Sir William Stafford, by whom she had six children. She was an influential person at the court of Queen Elizabeth I whom she served as Mistress of the Robes."]}, {"page": "Marian exiles", "response": ["During their continental sojourn, few of the exiles became well integrated economically or politically into their new communities. With the exception of the exile community in Aarau, the majority of exiles were clergy (67) or theological students (119). The next largest group was composed of gentry (166) who, with others back in England, financed the exiles. This group included Elizabeth Berkeley (Countess of Ormond), Sir Peter Carew, William Cecil, Sir John Cheke, Sir Anthony Cooke, Sir Francis Knollys, Sir Richard Morrison, Dame Dorothy Stafford, and Sir Thomas Wroth. Of about 500 known English exiles, there were 40 merchants, 32 artisans, 7 printers, 3 lawyers, 3 physicians, 3 yeomen, 13 servants, and 19 men with no profession. Of the artisans 12–17 were weavers who settled in Aarau. Strype names London merchant and exile Thomas Heton (or Heyton, Eaton) as the host-general of all the exiles. Financial backers for the exiles included London merchants Richard Springham and John Abel. Support also came from the King of Denmark, the Prince Palatine of the Rhine, the Duke of Württemberg, the Duke of Bipont, and many continental leaders of the reformed movement: Heinrich Bullinger, Konrad Pelikan, Bibliander, Josias Simmler, Wolphius, and Ludwig Lavater."]}, {"page": "Richard Drake", "response": ["Drake married Ursula Stafford, daughter of Sir William Stafford and Dorothy Stafford, by whom he had a son, Francis Drake (d. 1634).; ; ; ."]}, {"page": "William Stafford (courtier)", "response": ["The couple initially lived at Chebsey in Staffordshire, but later moved to the Boleyn family home, Rochford Hall at Rochford, in Essex. They lived in relative obscurity until Mary died in 1543, after which Stafford served in Scotland. He was knighted there in 1545 - during the reign of Henry VIII - and, two years later, became an MP for Hastings.Sir William Stafford (1512-1556), History of Parliament Online, accessed June 2018. Also in 1545, Stafford remarried, this time to his second cousin, Dorothy Stafford, the youngest daughter of Henry Stafford, 1st Baron Stafford and Ursula Pole (d. 1570).", "Stafford married secondly, in 1545, Dorothy Stafford (d. 22 September 1604), daughter of Henry Stafford, 1st Baron Stafford, and Ursula Pole, by whom he had three sons and three daughters:Richardson states that they had four sons, including Sir Edward, William, and Sir John, and two daughters, Ursula, who married Richard Drake, esquire, and Elizabeth, who married Sir William Drury and Sir John Scot; ..", "*William Stafford (1554–1612), conspirator, who about 1593 married Anne Gryme (d. 1612), daughter of Thomas Gryme of Antingham, Norfolk, by whom he had a daughter, Dorothy Stafford, and a son, William Stafford (1593–1684)..", "*Dorothy Stafford, who likely died in infancy.."]}, {"page": "Mary Scudamore", "response": ["Mary Scudamore (née Shelton) (c. 1550 – 1603) was a courtier and the daughter of Sir John Shelton of Shelton Hall, Norfolk and his wife, Margaret Parker. She was one of only six women who were appointed to the Privy chamber of Elizabeth I. When her close friend, Lady Dorothy Stafford, was ill, it was Mary Scudamore who was the Queen's sleeping companion.Scidmore, Warren. \"Elizabeth Skydmore who died in 1614, a spinster of Marlwood Park in Thornbury, Cloucestershire\". Occasional Papers, No. 35."]}, {"page": "William Stafford (conspirator)", "response": ["He was the son of William Stafford of Chebsey, who had been the brother-in-law of Henry VIII of England and the uncle of Elizabeth I. The elder William Stafford's first marriage had been to Mary Boleyn, sister of Anne Boleyn, and Stafford was the child of his second marriage to Dorothy Stafford.. "]}, {"page": "Elizabeth Stafford", "response": ["Elizabeth Stafford's parents were second cousins. Her mother was Dorothy Stafford (1 October 1526 – September 1604), the daughter of Henry Stafford, 10th Baron Stafford (1501–1563), son and heir of Edward Stafford, 3rd Duke of Buckingham, by Ursula Pole (d. 1570).. Through her mother, Elizabeth Stafford and her siblings were of royal blood.", "Dorothy Stafford was Sir William Stafford's second wife.  In 1534 he had secretly wed, as her second husband, Mary Boleyn (c. 1499–1543), sister of King Henry VIII's second wife, Anne Boleyn. Mary Boleyn is said to have been pregnant at the time of her marriage to Sir William Stafford;. however if there were children of the marriage, nothing further is known of them..Emerson states that they 'may have had two children, Edward (1535–1545) and Anne'; see Emerson, Kate, 'Mary Boleyn (c.1498 – July 1543)' in 'A Who's Who of Tudor Women'  Retrieved 14 March 2013.", "*William Stafford (1554–1612), conspirator, who about 1593 married Anne Gryme (d. 1612), daughter of Thomas Gryme of Antingham, Norfolk, by whom he had a daughter, Dorothy Stafford, and a son, William Stafford (1593–1684).", "*Dorothy Stafford, who likely died in infancy.", "Elizabeth Stafford's parents were staunch Protestants, and on 29 March 1555, during the reign of the Catholic Mary I, they took their two children, Elizabeth and Edward, in the company of a cousin, Elizabeth Sandys, into exile. In 1556 they were in Geneva, where on 4 January 1556 the Protestant reformer, John Calvin, stood as godfather to their youngest son, John Stafford, and where Sir William Stafford died, and was buried on 5 May of that year. After Sir William Stafford's death a dispute ensued with Calvin over the custody of his godson, John Stafford, and Dorothy Stafford 'managed to escape' with her children, in the company of Elizabeth Sandys, to Basel, where the Stafford family were neighbours of the Protestant reformer John Knox. In November 1558 Queen Mary died and Elizabeth I acceded to the throne, and on 14 January 1559 Dorothy Stafford and her children left Basel for England. The family took up residence for a time at Waltham, Essex."]}, {"page": "Scot's Hall", "response": ["*Firstly, in 1590, to Elizabeth Stafford (c. 1546 – 6 February 1599), widow of Sir William Drury (30 May 1550 – 18 January 1590) of Hawstead, Suffolk, and daughter of Sir William Stafford (d. May 1556) by his wife, Dorothy Stafford (1 October 1526 – 22 September 1604), granddaughter of Edward Stafford, 3rd Duke of Buckingham. By his first marriage, Scott was the stepfather of Sir Robert Drury, friend of the poet, John Donne. Without issue."]}, {"page": "Ursula Pole, Baroness Stafford", "response": ["* Dorothy Stafford (1 October 1526 – 22 September 1604), married Sir William Stafford, by whom she had six children. Dorothy was an influential person at the court of Queen Elizabeth I to whom she served in the capacity of Mistress of the Robes."]}, {"page": "Edward Stafford (diplomat)", "response": ["Stafford was born to Sir William Stafford of Chebsey, Staffordshire and Dorothy Stafford, his second wife."]}, {"page": "Stephen Soame", "response": ["In the Lackford Hundred, the manor of Herringswell (which came to Soame) was sold and assured to Reginald and William Stone by Thomas, Lord Howard in 1591 and 1595 (and so to Dame Anne Soame), and that of Freckenham was sold to Soame by Sir Oliver Cromwell in 1600.W.A. Copinger, Manors of Suffolk, IV (Manchester 1909), pp. 162-63, 165-66 (Internet Archive). Further east, Sir Thomas Reade sold the manor of Earl Stonham (formerly a possession of Sir Thomas Gresham) to Soame by fine in 1594.W.A. Copinger, Manors of Suffolk, II (Manchester 1908), pp. 358-60 (Internet Archive). A vellum map of the manor of Earl Stonham, Suffolk, dated 1587, made by the surveyor Thomas Clarke of Stamford Baron and bearing the arms of Sir Stephen Soame, was exhibited in December 1849.\"Quarterly Meetings. Bury St Edmunds, Dec 20 1849\", Proceedings of the Suffolk Institute of Archaeology I (1853), pp. 148-55 (Society's pdf), at p. 152. Nicholas Turner had licence to alienate the manor of Thorney Campsey at Stowupland (Stow Hundred) to Soame in 1598:W.A. Copinger, Manors of Suffolk, VI (Manchester 1910), pp. 236-37 (Internet Archive). in the same year Lady Dorothy Stafford had licence to alienate the manor of Wetheringsett (in Hartismere) to him, and the sale was completed in 1600.W.A. Copinger, Manors of Suffolk, III (Manchester 1909), pp. 330-31 (Internet Archive). He also held premises in Mendlesham. His title in the manor of Northall alias Cornhall at Bures St Mary (Babergh) is mentioned in 1609, but presumably came earlier in connection with the marriage of his daughter Jane Soame to Sir Nathaniel Barnardiston, in which family it was formerly held.W.A. Copinger, Manors of Suffolk, I (Manchester 1905), pp. 55-56."]}, {"page": "William Drury (MP for Suffolk)", "response": ["Drury married Elizabeth Stafford, the daughter of Sir William Stafford of Chebsey, Staffordshire, and Dorothy Stafford, by whom he had two sons and four daughters:; ."]}, {"page": "John Scott (soldier)", "response": ["*Firstly, in 1590, to Elizabeth Stafford (d. 6 February 1599), widow of Sir William Drury (30 May 1550 – 18 January 1590) of Hawstead, Suffolk, and daughter of Sir William Stafford (d. May 1556) by his wife, Dorothy Stafford (1 October 1526 – 22 September 1604), granddaughter of Edward Stafford, 3rd Duke of Buckingham. By his first marriage, Scott was the stepfather of Sir Robert Drury, friend of the poet, John Donne. Without issue."]}]}}