{"wiki_id": "http://www.wikidata.org/entity/Q11812037", "itemLabel": "John Herbert Hedley", "itemDescription": "British flying ace", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Herbert_Hedley", "wikipedia_page": {"main": "Captain John Herbert Hedley (19 July 1887 – 1 April 1977) was a World War I British flying ace credited with eleven aerial victories. The observer ace claimed to have survived a bizarre flying mishap which earned him the moniker \"The Luckiest Man Alive.\" Hedley also survived uninjured after his plane was shot down in 1918, and he became a prisoner of war. After his immigration to the United States in 1920, he became a regular on the lecture circuit, enthralling American audiences with the stories of his military service.", "link_mentions": [{"page": "North Shields", "response": ["*John Herbert HedleyWorld War I flying ace"]}, {"page": "List of World War I aces credited with 11–14 victories", "response": ["| John Herbert Hedley"]}, {"page": "Robert Kirby Kirkman", "response": ["However, on 27 March he and his observer, Captain John Herbert Hedley, were shot down by Karl Gallwitz of Jasta Boelcke near Foucaucourt and captured. He remained a prisoner of war until after the armistice of 11 November 1918, and was transferred to RAF's unemployed list on 28 February 1919."]}, {"page": "Karl Gallwitz", "response": ["Gallwitz originally flew a Roland D.III for artillery cooperation units on the Russian Front, shooting down two observation balloons with FA 37, before a brief assignment to Jasta 29. On 24 August 1917, he joined Jasta Boelcke in France. He scored three times in October; the last one, on the 27th, was over Arthur Rhys-Davids. He started over again in 1918, scoring five more times, including bringing down British aces Robert Kirby Kirkman and John Herbert Hedley. Gallwitz finished out his tally of ten on 21 April 1918,The Aerodrome website http://www.theaerodrome.com/aces/germany/gallwitz.php Retrieved on 20 April 2010 and crashed soon thereafter. Once he recuperated from his injuries, he was assigned to Inspekteur der Flieger."]}, {"page": "John Hedley", "response": ["* John Herbert Hedley, World War I flying ace dubbed \"The Luckiest Man Alive\""]}, {"page": "List of World War I flying aces from the British Empire", "response": ["* John Herbert Hedley"]}]}}