{"wiki_id": "http://www.wikidata.org/entity/Q11880493", "itemLabel": "Madeline Duggan", "itemDescription": "English actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Madeline_Duggan", "wikipedia_page": {"main": "Madeline Elizabeth Duggan (born 28 June 1994) is an English actress, known for her portrayal of Lauren Branning in the BBC soap opera EastEnders from 2006 to 2010.", "link_mentions": [{"page": "EastEnders", "response": ["In March 2008, scenes showing Tanya Branning (Jo Joyner) and boyfriend, Sean Slater (Robert Kazinsky), burying Tanya's husband Max (Jake Wood) alive, attracted many complaints. The UK communications regulator Ofcom later found that the episodes depicting the storyline were in breach of the 2005 Broadcasting Code. They contravened the rules regarding protection of children by appropriate scheduling, appropriate depiction of violence before the 9 p.m. watershed and appropriate depiction of potentially offensive content. In September 2008, EastEnders began a grooming and paedophilia storyline involving characters Tony King (Chris Coghill), Whitney Dean (Shona McGarty), Bianca Jackson (Patsy Palmer), Lauren Branning (Madeline Duggan) and Peter Beale (Thomas Law). The storyline attracted over 200 complaints."]}, {"page": "Peter Beale", "response": ["A budding athlete, who is Peter's PE teacher, tells Ian that Peter could compete in the 2012 Olympics. Keen for Peter to succeed, Ian begins putting pressure on him to train hard and is unhappy when Peter is distracted by  Lauren Branning (Madeline Duggan), who Peter begins dating in December 2007. Lauren's father, Max Branning (Jake Wood), is also unhappy, especially when he catches Peter and Lauren playing truant and drinking alcohol and Max orders Peter to end the relationship in October 2008 but Peter tries standing up to him. Max angrily grabs Peter and throttles him so Peter tells Lauren that Max was behind their breakup, making Lauren so angry that she tries to run Max over. Peter later gave evidence in court, stating that when Lauren left his house, she was upset and angry. When Lauren returns home (after being found not guilty of attempting to murder Max) in April 2009, Peter settles his differences with Max and declares his love for Lauren. Peter tries to look impressive by lying that he and Lauren have had sex in the allotments. Lucy and Jay Brown (Jamie Borthwick) quickly spread this rumour at school and Lauren dumps Peter. Max is furious about what Peter has said and tries to punch him. Peter and Lauren reconcile and Lauren tells Peter she is ready to have sex. However, Lauren's mother, Tanya Branning (Jo Joyner), finds the condoms Peter and Lauren are using and Lauren's older brother, Bradley Branning (Charlie Clements), overhears Peter talking about it. The next day, Peter and Lauren try to see each other in secret but fail. Peter tells Max that he loves Lauren and Max finally accepts it."]}, {"page": "Stacey Slater", "response": ["Despite being initially unimpressed by Walford newcomer Bradley Branning (Charlie Clements), she eventually grows to like him and they start dating. Bradley becomes Stacey's first true love. Stacey is stunned when Sean appears back in her life after seven years, but is happy to have her brother back. Stacey's relationship with Bradley hits a rough patch when Stacey discovers she has been impregnated by Bradley and he urges her to have an abortion. Stacey reluctantly has the abortion and their romance sours. Bradley calls time on his relationship with Stacey when she embarrasses him at a work party. To get back at Bradley, Stacey seduces his father Max Branning (Jake Wood). Subsequently, they begin an affair. Although they agreed that it would only be about sex, Stacey falls in love with Max, but Max rejects her. Eventually, Max also falls for Stacey and agrees to leave his wife, Tanya Branning (Jo Joyner). However, Max has this on a halt as he learns that Tanya is pregnant. While Max and his family are out of town, Stacey reunites with Bradley and accepts his marriage proposal. When Max returns, he declares his love for Stacey and wants to run away with her. Stacey tells Max they are over for good and she is marrying Bradley. Stacey feels overwhelmed on her wedding day and almost does not go through with the ceremony, but Bradley convinces her to marry him. Max propositions Stacey after the wedding ceremony and their kiss is recorded on Max's eldest daughter Lauren's (Madeline Duggan) hidden video camera. Lauren gives a DVD of the recording to Bradley as a Christmas present, revealing the fling to the entire family. Tanya and Bradley are devastated over their spouses' betrayal and both marriages end. Some time later, Bradley decides to give his marriage to Stacey another chance, suggesting that they start a family. Stacey is uncertain and secretly continues taking birth control pills. She has a one-night-stand with Callum Monks (Elliott Jordan). She immediately regrets cheating on Bradley. Stacey attempts to reignite the spark in her marriage, but eventually decides her and Bradley are over. She has a brief relationship with Callum, but they split up over his harsh treatment of her mother."]}, {"page": "List of former EastEnders characters", "response": ["| Madeline Duggan"]}, {"page": "Bradley Branning", "response": ["Bradley has romances with his colleague Lydia Asler (Amy Noble) and beautician Preeti Choraria (Babita Pohoomull). Unknown to Bradley, Stacey has embarked on an affair with Max in revenge. Max ends the affair by taking his family to Spain for six weeks, and while he is away, Bradley and Stacey reconcile and get engaged. They marry in November 2007, although Stacey has one last kiss with Max after the wedding, which is recorded by Max's daughter Lauren's (Madeline Duggan) hidden camcorder. Lauren makes a DVD, which is played on Christmas Day, revealing the affair. Bradley and Stacey separate, and he moves away from Walford."]}, {"page": "Dugan", "response": ["* Madeline Duggan (born 1994), British actress"]}, {"page": "Max Branning", "response": ["In 2008, Max became central to a whodunit storyline that saw him run over by a mystery assailant who was eventually revealed to be his daughter Lauren (Madeline Duggan). He has also had to come to terms with the death of his son Bradley Branning (Charlie Clements), being framed for attempted murder by Carl White (Daniel Coonan) and his girlfriend Emma's death. In October 2015, Max was wrongly convicted for Lucy Beale's murder, the true murderer was later revealed to be her younger half-brother Bobby (Eliot Carrington). After his release from prison, Max became the show's central antagonist as he sought revenge against Ian and Phil along with everyone else – including his own family – who saw him wrongfully imprisoned, by conspiring with James Willmott-Brown (William Boyde) in his nefarious scheme to redevelop Albert Square. Throughout the events of his revenge storyline, Max arranged for Jack to lose custody over his stepson Matthew Mitchell-Cotton; framed Phil's rival Vincent Hubbard (Richard Blackwood) for drug dealing, resulting in his arrest; blackmailed and later caused the death of Ian's stepson Steven; and forced Jane to leave Walford under the threat of having Bobby harmed in prison. The storyline ultimately concluded with Max attempting to commit suicide after his plan for revenge had failed, but this ended with both his daughters Lauren and Abi (Lorna Fitzgerald) accidentally falling off the roof from The Queen Victoria when they attempted to stop their father; Lauren survived the fall whilst Abi died. A couple of months later in 2018, Max married Tanya's sister Rainie in his bid to help win his custody case over Abi's daughter.", "Max arrives in Walford in June 2006 to confront his father, Jim Branning (John Bardon), after being estranged for 17 years, but Jim throws him out and Max meets his son Bradley Branning (Charlie Clements), and decides to stay to rebuild their relationship. Max's wife Tanya Branning (Jo Joyner) arrives to collect him and a month later, Max, Tanya and their daughters Lauren Branning (Madeline Duggan until June 2010, Jacqueline Jossa thereafter) and Abi Branning (Lorna Fitzgerald) move to Albert Square. Tanya learns about Max's affair with Gemma Clewes (Natalie J. Robb), but she gives their marriage one last try. As an apology, Max buys 10 Turpin Road for Tanya to open as a beauty parlour and begins spending time with Bradley."]}, {"page": "Tanya Branning", "response": ["Tanya's storylines have included opening her own salon, giving birth to her third child, discovering that her husband Max Branning (Jake Wood) had an affair with Stacey Slater (Lacey Turner) before divorcing and then burying him alive with the help from her new partner Sean Slater (Robert Kazinsky), marrying Greg Jessop (Stefan Booth), starting an affair with Max on her wedding day to Greg, dealing with her eldest daughter, Lauren Branning's (Madeline Duggan/Jacqueline Jossa) alcoholism, battling cervical cancer, discovering that Max has a secret wife, Kirsty Branning (Kierston Wareing) on their second wedding day, witnessing her daughters Lauren and Abi Branning (Lorna Fitzgerald) fall from the roof of The Queen Victoria public house and subsequently dealing with Abi’s death, which leads to her mental breakdown.", "Tanya arrives in Albert Square after her husband Max Branning's (Jake Wood) car breaks down, not realising in fact Max is visiting his family. She finds out that he has had an affair with Gemma Clewes (Natalie J. Robb) but forgives him. To make it up to her, Max buys 10 Turpin Road for Tanya, which she turns into a beauty salon named Booty. Tanya, after much pressure from Max, gives birth to Oscar. Unbeknown to Tanya, Max has started an affair with Stacey Slater (Lacey Turner), who is Max's son Bradley Branning's (Charlie Clements) former girlfriend. When the affair is revealed on Christmas Day on a video recording recorded by Tanya and Max's daughter, Lauren Branning (Madeline Duggan/Jacqueline Jossa), Tanya asks for a divorce and starts a relationship with Stacey's brother Sean Slater (Robert Kazinsky). Tanya plots to bury Max alive and with the help of Sean, they drug Max and bury him in the woods. Tanya later feels guilty and digs him up and breaks up with Sean. Tanya then has to face her sister, Rainie (Tanya Franks), turning up as she did the year before, claiming she is clean of drugs, though tests positive, so Tanya orders her to leave. Tanya then starts a relationship with Max's brother Jack Branning (Scott Maslen) and Max tries to split them up. Tanya and Max later share a kiss, after Max is abducted and beaten by Jack. Max is knocked down in a deliberate hit-and-run. Tanya admits to the police that she tried to kill Max; however, Lauren was the real culprit. After the police find out Lauren was the driver, Max and Tanya suffer a bumpy relationship which ends up in Tanya forgiving Max and allowing him to move back in, but when she finds out they are in debt and Max has been hiding it, she leaves with Lauren and Oscar after finding out Booty was to close down, with daughter Abi Branning (Lorna Fitzgerald) refusing to go with Tanya and staying with Max."]}, {"page": "Abi Branning", "response": ["Abi Branning is a fictional character from the BBC soap opera EastEnders, played by Lorna Fitzgerald. She was introduced by executive producer Kate Harwood on 3 July 2006 as an extension to the Branning family, along with father Max (Jake Wood), mother Tanya Branning (Jo Joyner) and older sister Lauren Branning (Madeline Duggan/Jacqueline Jossa). Her storylines involve her friendships and relationships with Ben Mitchell (Charlie Jones/Joshua Pascoe/Harry Reid) and Jay Brown (Jamie Borthwick), her toxic friendship with Babe Smith (Annette Badland), faking a pregnancy so that Ben would not leave her for Paul Coker (Jonny Labey), being a suspect in the murder of Lucy Beale (Hetti Bywater), her affair with Lauren's fiancé, Steven Beale (Aaron Sidwell), and falling pregnant by him.", "Abi moves to Albert Square with her parents Max Branning (Jake Wood) and Tanya Branning (Jo Joyner), and sister Lauren Branning (Madeline Duggan), where she befriends Ben Mitchell (Charlie Jones). Abi is hit by Dean Wicks' (Matt Di Angelo) car, suffering a broken wrist, cuts and bruises, but she recovers with no long-term impairment. Abi later learns that Ben's father, Phil Mitchell's (Steve McFadden), girlfriend Stella Crawford (Sophie Thompson) is abusing him, so due to this, Abi and Ben plan to run away, but fail as they are caught by their parents. Abi then stands up to Stella and tells Ben to do the same, leading Stella to kill herself when Ben reveals the abuse. In December 2007, she chooses the name for her newborn baby brother, Oscar. Soon after, when Max's affair with his son Bradley Branning's (Charlie Clements) wife, Stacey Slater (Lacey Turner), is revealed, Max and Tanya separate and eventually divorce. Abi begins to live sporadically with each parent, frequently defending Max to Tanya and Lauren, until Max and Tanya reunite in 2009, however Abi leaves with Tanya after learning of Max's financial problems. In September 2009, Abi and Jordan Johnson (Michael-Joel David Stuart) find Jordan's mother Trina Johnson's (Sharon Duncan Brewster) body in the summerhouse at the allotments having been accidentally killed by Jordan's father, Lucas Johnson (Don Gilet)."]}, {"page": "1994 in the United Kingdom", "response": ["* 28 June - Madeline Duggan, actress"]}, {"page": "Lauren Branning", "response": ["Lauren Branning is a fictional character from the BBC soap opera EastEnders. The role was originated by Madeline Duggan, who first appeared on 3 July 2006. Duggan played the role for four years until her exit on 23 June 2010. Three months later, on 27 September 2010, the role was recast with Jacqueline Jossa. In August 2014, Jossa announced that she was expecting her first child. In December 2014, Jossa filmed her final scenes prior to taking maternity leave, which aired on 24 February 2015, following the show's 30th anniversary celebrations. She returned temporarily on 14 September 2015 for her father's murder trial before departing again on 2 October 2015. Lauren made a permanent return on 27 May 2016. In September 2017, it was announced that Jossa and Lorna Fitzgerald, who plays Lauren's sister Abi, had been axed by executive consultant John Yorke. Jossa finished filming with the show on 11 January 2018, and Lauren departed on 16 February 2018.", "Lauren Branning was introduced in 2006 by executive producer Kate Harwood. She and her immediate family—father Max (Jake Wood), mother Tanya (Jo Joyner) and sister Abi (Lorna Fitzgerald)—are an extension of the popular and long-running Jackson/Branning clan, who have appeared in the series since 1993. It was announced in May 2006 that Lauren would be played by actress Madeline Duggan.  Duggan was replaced by Jacqueline Jossa, with Duggan's final scenes airing on 23 June 2010."]}, {"page": "Madeline Duggen", "response": ["#REDIRECT Madeline Duggan"]}, {"page": "List of EastEnders characters (2007)", "response": ["Craig Dixon, played by Rory Jennings, arrives in Albert Square for an interview with Ian Beale (Adam Woodyatt), to work in Ian's chip shop. Ian employs Craig, and Craig goes on to secretly date Ian's daughter, Lucy (Melissa Suffield). It is soon revealed that Craig has a gun in the glove compartment of his car. Lauren Branning (Madeline Duggan) invites him and Lucy to her house and they play truth or dare. Craig and Lucy leave when they are interrupted by Lauren's sister, Abi (Lorna Fitzgerald). Craig later dares Lucy to shoplift from the Minute Mart. Craig also has a minor disagreement with Patrick Trueman (Rudolph Walker) when purchasing alcohol from the Minute Mart when Patrick asks him for proof of age much to the annoyance of Craig, who shows him his passport, proving he is 18 years old. Patrick is attacked soon after.", "| A police desk sergeant. He first appears when Shirley Carter (Linda Henry) and Pat Evans (Pam St. Clement) are arrested for fighting in the street, and then when Rob Minter (Stuart Laing) was arrested for assaulting May Wright (Amanda Drew). In 2009, he is seen again when Lauren Branning (Madeline Duggan) confesses to her father Max's (Jake Wood) attempted murder, and appears later when Roxy (Rita Simons) and Ronnie Mitchell (Samantha Womack) are arrested.BBC One - EastEnders, 12/03/2009 In 2010, Sergeant Lewis is present when Peggy Mitchell (Barbara Windsor) visits Danny Mitchell (Liam Bergin) at the police station after he is arrested for fighting.BBC One - EastEnders, 11/03/2010 In 2012, he appears when Ben Mitchell (Joshua Pascoe) confesses to Heather Trott's (Cheryl Fergison) murder, and in 2013 when Lauren (now Jacqueline Jossa) is arrested for assaulting Lucy Beale (Hetti Bywater). ", "| Peter Beale's (Thomas Law) French exchange student who takes a liking to Steven Beale (Aaron Sidwell). She leaves the Square when the Beales forbid her from seeing Steven, setting up Peter with Lauren Branning (Madeline Duggan) in the process."]}, {"page": "Branning family", "response": ["Between 2006 and 2012, new influx of Branning's joined the show - Max Branning (Jake Wood), his wife Tanya (Jo Joyner) and their children Lauren (Madeline Duggan/Jacqueline Jossa) and Abi (Lorna Fitzgerald). Max and Tanya later had another child Oscar Branning in 2007. Max's son with his ex-wife Rachel (Sukie Smith/Pooky Quesnel); Bradley Branning (Charlie Clements) was introduced earlier in 2006. Jim's son Jack Branning (Scott Maslen) and his daughter Penny Branning (Mia Mckenna-Bruce) were introduced in 2007 and 2008, as well as Bianca's children Liam Butcher (James Forde), Tiffany Dean (Maisie Smith), Morgan Jackson-King (Devon Higgs) and her ward Whitney Dean (Shona McGarty) in 2008. Suzy Branning (now played by Maggie O'Neill) also returned to the show for a five months the same year. In February 2010, Carol returned to the show with her son Billie, who was killed off months later. Once again in 2011, the Branning family were rejuvenated with the return of Derek Branning (now played by Jamie Foreman), alongside the introduction of his children Joey Branning (David Witts) and Alice Branning (Jasmyn Banks) the following year. Carol's daughter Sonia returned in 2014 with her daughter Bex Fowler (Jasmine Armfield), as did Robbie in both 2015 and 2017 and Bianca in 2019.", "The Branning family were introduced as an extension to the established Jackson family consisting of Carol Jackson (Lindsay Coulson), her children Bianca Jackson (Patsy Palmer), Robbie Jackson (Dean Gaffney), Sonia Fowler (Natalie Cassidy) and Billie Jackson (Devon Anderson), her husband Alan Jackson (Howard Antony) and his grandmother Blossom Jackson (Mona Hammond). Carol's father Jim Branning, played by John Bardon, had appeared in the show in 1996 as a guest character and was reintroduced in 1999 as a regular by Matthew Robinson. Three other of Jim's children, April Branning (Debbie Arnold), Derek Branning (Terence Beesley) and Sue Branning (Julie Christian-Young) also appeared in 1995 and 1996, as well as his first wife Reenie Branning (Joy Graham), who died off screen in 1999, allowing Jim to move in with his grandchildren. Jim was paired romantically with Dot Cotton (June Brown), and the couple married on screen in February 2002. The family was extended in 2005 with the arrival of Jim's grandson Bradley Branning (Charlie Clements), in January 2006. Bradley's arrival prompted a series of complaints from residents in the Hertfordshire town of Tring, where Bradley had allegedly lived before he moved to East London, as they thought their town had been portrayed as \"snobbish\". The BBC responded by saying that Tring was chosen following a storyline conference in the town, where the production team enjoyed their stay, saying that Bradley was not a snob but was portrayed as a character who led a sheltered life because his father left him when he was young. In 2006, scriptwriters decided to pair Bradley with the character Stacey Slater, played by Lacey Turner. Meanwhile, actor Jake Wood was introduced as Bradley's estranged father Max Branning, along with his second wife Tanya Branning (Jo Joyner) and their two daughters Lauren Branning (Madeline Duggan from 2006 to 2010, Jacqueline Jossa since 2010) and Abi Branning (Lorna Fitzgerald). Max, a serial womaniser, had left Bradley with his mother Rachel Branning, played by Sukie Smith in 2006 and Pooky Quesnel from 2007 onwards, after an affair with Tanya, and had not seen his son for several years. Max arrived with a mistress, Gemma Clewes (Natalie J. Robb), who was warned off by Bradley. Scott Maslen was announced as the latest member of the Branning clan, Jim's youngest son Jack Branning, in July 2007. Minor appearances followed from Jack's ex-wife Selina Branning and daughter Penny Branning (Mia McKenna-Bruce). Sue, renamed Suzy, was reintroduced in 2008 played by Maggie O'Neill, though she departed later that year. Bardon suffered a stroke in 2007, and a storyline was written in which Jim tended to a sick Carol, and suffered a stroke while he was there. Dot and Jim remained together, with Jim making sporadic appearances throughout 2008 and 2009 to visit Dot, and Bardon made a more permanent return to the show in late 2009, which lasted until 2011."]}, {"page": "Jack Branning", "response": ["Jack is the youngest child of Jim (John Bardon) and Reenie Branning (Joy Graham) and brother of Derek (Terence Beesley; Jamie Foreman), Carol (Lindsey Coulson), April (Debbie Arnold), Suzy (Julie Christian-Young; Maggie O'Neill) and Max (Jake Wood). Having grown up in a large family in a poor area of East London, Jack regularly fought his older brother, Max, for the attentions of his father who was an alcoholic. He was very close friends with Michael Moon (Steve John Shepherd), another local East End boy who went to school with him and had a closer relationship with him than he did with his brothers. As a teenager, Jack stole his grandfather's World War II medal, knowing that it was Jim's prized possession as his father had died in combat when he was only six years old, and blamed Max, causing a huge rift between Jim and Max and resulting in Max walking out in 1989. Despite Max and Jack being arch-rivals, they kept in touch as Jack was present at Max's wedding to Tanya Cross (Jo Joyner) in 1994 and watched his nieces Lauren (Madeline Duggan; Jacqueline Jossa) and Abi (Lorna Fitzgerald) grow up."]}, {"page": "Bacon's College", "response": ["* Madeline Duggan, actress who played Lauren Branning on the BBC1 soap EastEnders.  "]}, {"page": "List of EastEnders characters (2006)", "response": ["Maxwell \"Max\" Branning, played by Jake Wood, is the son of Jim (John Bardon), and father of Bradley Branning (Charlie Clements). He moves to Albert Square with his wife Tanya (Jo Joyner) and their daughters, Lauren and Abi (Madeline Duggan and Lorna Fitzgerald) for a fresh start after Max had been caught having an affair. They have a baby, Oscar, however Max soon goes back to his old ways, and has an affair with Bradley's girlfriend, Stacey Slater (Lacey Turner). The affair has devastating consequences, and leads to Tanya burying Max alive, and Lauren running him over. Max has a relationship with Vanessa Gold (Zöe Lucker), but eventually goes back to Tanya. However they split again and while spending time away from Walford, Max marries Kirsty (Kierston Wareing).", "Tanya Lauren Branning, played Jo Joyner, is married to Max Branning (Jake Wood). She moves to Walford with him and their daughters, Lauren and Abi (Madeline Duggan and Lorna Fitzgerald), for a fresh start after Max had been caught having an affair. They have a baby, Oscar, but after Tanya learns that Max has had another affair, she leaves him and starts a relationship with Sean (Robert Kazinsky), and then Max's brother, Jack (Scott Maslen). Tanya eventually returns to Max, but after another split, she marries Greg Jessop (Stefan Booth). Tanya then has an affair with Max, but when she is diagnosed with cancer it ends her marriage with Greg, and her affair with Max. However, after recovering, Tanya soon returns to Max yet again.", "Lauren Branning is played by Madeline Duggan from 2006 to 2010, and Jacqueline Jossa from 2010 onwards. She is the eldest daughter of Max (Jake Wood) and Tanya (Jo Joyner), the sister of Abi (Lorna Fitzgerald), and half-sister of Bradley Branning (Charlie Clements). Lauren uncovers an affair between her father and Bradley's fiancée, Stacey Slater (Lacey Turner). The affair leads to the breakdown of her parents' marriage, and blaming Max, Lauren runs him over in a car. Lauren has brief relationships with Peter Beale (Thomas Law) and Ryan Malloy (Neil McDermott), but has a serious relationship with her cousin, Joey Branning (David Witts). However, when Lauren becomes an alcoholic this leads to Joey ending their relationship.", "Linda surprises her daughter by coming to Walford for Jane's wedding to Ian Beale (Adam Woodyatt). Linda instantly causes controversy when she calls Ian a bad father after she hears his daughter, Lucy (Melissa Suffield), talking to her friend, Lauren Branning (Madeline Duggan), about strippers. She also criticises Pat Evans's (Pam St. Clement) earrings at Jane's hen-party, and berates Jane for wearing white when she is marrying for a second time. Linda reveals that Jane's birth name is Lesley, and continues to call her Lesley during her stay. When Jane's affair with Grant Mitchell (Ross Kemp) is revealed at the wedding ceremony, Linda leaves Walford and returned to Florida."]}, {"page": "List of EastEnders characters (2008)", "response": ["Selina Branning, played by Daisy Beaumont, is the ex-wife of Jack Branning (Scott Maslen), and mother of their daughter Penny Branning (Mia McKenna Bruce). This was Beaumont's second role in EastEnders as she previously played Helen Graham in 2000. She was listed by Digital Spy as a suspect in Max Branning's (Jake Wood) hit-and-run. However, Lauren Branning (Madeline Duggan) was the culprit. She appears between 21 January and 1 February 2008.", "Tony King, played by Chris Coghill, is the partner of established character Bianca Jackson (Patsy Palmer), and a father-figure to her four children. He made his first appearance on 12 September 2008. It was reported in July 2008 that Tony would be arriving in the serial as part of a child sexual abuse storyline involving Bianca's adopted daughter Whitney Dean (Shona McGarty). BBC News described the plot as an ongoing \"predatory paedophile storyline\", noting that this was the first time this subject matter had been tackled by a UK soap opera. The Daily Mirror Beth Neil branded the plot strand \"one of the darkest and most disturbing storylines EastEnders has ever attempted\", with critic Jim Shelley deeming it to be a \"new low\" for EastEnders. Tony sexually abuses Whitney, and begins grooming her school-friend Lauren Branning (Madeline Duggan), before his predatory nature is uncovered and he is arrested for his crimes. Tony appeared between 12 September and 12 December 2008 and returned in December 2009 to stand trial. The NSPCC praised the storyline for \"helping to raise awareness of the hidden nature of sexual abuse\". The storyline also gained EastEnders a Royal Television Society Programme Award in March 2009 in the Soap and Continuing Drama category.", "In the upcoming case, Tanya had been arrested for attempted murder on her estranged husband Max Branning (Jake Wood). Despite promising Jack Tanya's freedom and helping her client in every way she could to see that she would be given bail, she admitted to Jack that Tanya didn't stand a chance of getting released. This proved true when Tanya's bail application was denied later that day. She later appeared, when she visited Tanya in prison to inform her that Max is concerned she is covering for Jack. However, this has been proven incorrect, although it has been revealed that Tanya is covering for her daughter, Lauren Branning (Madeline Duggan) . She returned to accompany Tanya in court, she asked Tanya to think about what her plea would be. When the truth about Lauren was revealed, she asked Kendra to contact social services because she felt that she will only make things worse for her family. She appeared later when she seemingly attended Lauren's court appearance.", "She first appeared when she visited Bianca Jackson (Patsy Palmer) on 11 December 2008 to interview her and Whitney. Whilst there, Lauren Branning (Madeline Duggan) also came forward and told her the story of how Tony treated her. The next day, she returned to Pat Evans' (Pam St. Clement) house to let Bianca know that Tony had been released on police bail because Whitney hadn't given her statement. Whitney later gave her statement to the police and Tony was later charged. She returned to tell Whitney and Bianca that Tony had pleaded \"Not Guilty\" to the charges and she later informs them that Tony attempted suicide while in custody. She returned to tell Whitney that a verdict is expected on whether Tony will be sentenced.", "She first appears when she visits Whitney Dean (Shona McGarty) following her abuse by Tony King (Chris Coghill). She later informs Tanya Branning (Jo Joyner) that her daughter Lauren Branning (Madeline Duggan) wanted to remain in care. She visits Stacey Branning (Lacey Turner) and her baby Lily Branning, and notes that Stacey appears agitated. She visits Stacey again after Janine Malloy (Charlie Brooks) reports Stacey for neglecting Lily. However, Maria concludes that Lily is not being neglected. She returns and comes to see Stacey for a home visit, not knowing that Stacey has gone missing with Lily. She visits again where Ryan Malloy (Neil McDermott) pretends to be Stacey's partner. Maria is so impressed that she says she will not need to visit Stacey again. Maria returns in March 2012 to take custody of George Trott after the death of his mother, Heather (Cheryl Fergison). She later returns George to Shirley Carter (Linda Henry), who is George's godmother, while Social Services try to locate George's father, Darren Miller (Charlie G. Hawkins). A week later she returns to collect George to reunite him with Darren."]}, {"page": "List of people from the London Borough of Southwark", "response": ["|Madeline Duggan"]}, {"page": "Whitney Dean", "response": ["When Tony begins grooming Whitney's best-friend Lauren Branning (Madeline Duggan) into harboring romantic feelings for him, Whitney becomes jealous and demands Tony to focus on her rather than Lauren. As her sixteenth birthday approaches, she buys tickets for them to travel abroad. Tony loses interest in Whitney and hides her passport, but it is found and returned to her. On the day she turns sixteen, Whitney confesses her relationship with Tony to Bianca. Horrified, she confronts Tony and realizes that he has been abusing Whitney all along. She calls the police and Tony is arrested, much to Whitney's dismay. Whitney confronts Bianca for her actions and Bianca tries to get Whitney to see what Tony is really like, which causes Whitney to have a breakdown. The next day, the police reveal that Tony has been released on bail. Moments later, he secretly confronts Bianca and tries to explain himself to her. She refuses and Tony begins insulting Bianca, unaware that Whitney is hearing their argument in the background. Whitney comes to Bianca's defense and tells Tony to leave them alone. Tony then tries to flee the square, but is rearrested by the police and sent to prison awaiting trial; Whitney decides to make a statement to the police. "]}, {"page": "Madeleine (name)", "response": ["*Madeline Duggan (born 1994), English actress "]}, {"page": "List of British former child actors", "response": ["*Madeline Duggan (born 1994)"]}, {"page": "Tony King (EastEnders)", "response": ["Tony King is a fictional character from the BBC soap opera EastEnders, played by Chris Coghill. He was the partner of established character Bianca Jackson (Patsy Palmer), and a father-figure to her four children. Tony sexually abused Bianca's stepdaughter, Whitney Dean (Shona McGarty), and began grooming her school-friend Lauren Branning (Madeline Duggan), before his predatory nature was uncovered and he was arrested for his crimes. Tony appeared between 12 September and 12 December 2008 and returned in December 2009 to stand trial."]}, {"page": "List of British actors", "response": ["* Madeline Duggan (born 1994)"]}]}}