{"wiki_id": "http://www.wikidata.org/entity/Q11800905", "itemLabel": "John Tremayne", "itemDescription": "English politician and landowner", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Tremayne_(1825%E2%80%931901)", "wikipedia_page": {"main": "John Tremayne (1825–1901) was a member of a landed family in the cornish county of Cornwall, and owner of the Heligan estate near Mevagissey. At various times, he was a member of the UK Parliament for the constituencies of East Cornwall and South Devon, and High Sheriff of Cornwall. He was also the third of four successive members of the Tremayne family who are credited with the creation of the gardens around Heligan House that are now well known as the Lost Gardens of Heligan.", "link_mentions": [{"page": "Lost Gardens of Heligan", "response": ["*John Tremayne, son of John Hearle Tremayne", "*John Claude Lewis Tremayne, son of John Tremayne and better known as \"Jack\""]}, {"page": "South Devon (UK Parliament constituency)", "response": ["|John Tremayne || Conservative"]}, {"page": "East Cornwall (UK Parliament constituency)", "response": ["|John Tremayne || Conservative"]}, {"page": "Tremayne", "response": ["*John Tremayne (1825–1901), MP for constituencies in both Cornwall and Devon, and High Sheriff of Cornwall", "*John Tremayne Babington (later John Tremayne Tremayne), British Air Marshal and High Sheriff of Cornwall"]}, {"page": "List of MPs elected in the 1874 United Kingdom general election", "response": ["| John Tremayne"]}, {"page": "John Hearle Tremayne", "response": ["In addition to his parliamentary service, John Tremayne was a Justice of the peace and, in 1831, High Sheriff of Cornwall."]}, {"page": "Richard Davey (MP)", "response": ["Along with Michael Williams, also a Whig, they were elected without opposition on 2 April 1857; John Tremayne, the Conservative candidate, having stood down. In 1859, the Whigs joined the new Liberal Party. He was re-elected for this seat until 1868."]}, {"page": "List of United Kingdom by-elections (1868–1885)", "response": ["|John Tremayne"]}, {"page": "John Tremayne", "response": ["John Tremayne may refer to:", "*John Tremayne (fl. 1388), MP for Truro (UK Parliament constituency) in 1388", "* John Tremayne (1647–1694), English lawyer and politician, Serjeant-at-Law and King's Serjeant, MP for Tregony", "* John Tremayne (1825–1901), MP for constituencies in both Cornwall and Devon, and High Sheriff of Cornwall in 1859", "* John Tremayne Babington (1891–1979), later John Tremayne Tremayne, British Air Marshal and High Sheriff of Cornwall in 1954", "* John Tremayne (died 1504), of Tremayne & Collacombe, High Sheriff of Cornwall in 1485 & 1487", "* John Tremayne (of Heligan), High Sheriff of Cornwall in 1745"]}, {"page": "John Tremayne (1825 - 1901)", "response": ["#REDIRECT John Tremayne (1825–1901)"]}, {"page": "John Tremayne (1825-1901)", "response": ["#REDIRECT John Tremayne (1825–1901)"]}]}}