{"wiki_id": "http://www.wikidata.org/entity/Q11801548", "itemLabel": "Henry Elwes", "itemDescription": "British politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Henry_Elwes", "wikipedia_page": {"main": "Sir Henry William George Elwes  (born 24 October 1935) is a retired British politician and public servant. He served as a District and County Councillor in Gloucestershire for 32 years and was Lord Lieutenant of Gloucestershire between 1992 and 2010.", "link_mentions": [{"page": "University of Gloucestershire", "response": ["In February 2012 Rennie Fritchie was announced as the new Chancellor succeeding Lord Carey of Clifton, the former Archbishop of Canterbury. Sir Henry Elwes and the former Bishop of Gloucester Michael Perham are Pro-Chancellors. As of August 2011, Stephen Marston holds the post of Vice-Chancellor."]}, {"page": "Gloucestershire Wildlife Trust", "response": ["The Trust was founded in 1961 and was then named the Gloucestershire Trust for Nature Conservation.Annual Reports of the Gloucestershire Trust for Nature Conservation and Gloucestershire Wildlife Trust, Wildlife News (Trust magazine) and the Trust website Founder members included Sir Peter Scott, Christopher Cadbury and a group of other local people with the shared interest of nature conservation.Gloucestershire Wildlife Trust timeline which includes a photograph of the historic occasion The name was changed to the Gloucestershire Wildlife Trust in 1991. In 1990 Lady Scott became the Trust's patron succeeding her late husband, Sir Peter Scott. Originally the Trust headquarters was at Church House, Standish, which was opened in 1971. By that year 33 nature reserves were under trust management. In 1989 Prince of Wales was present at the launch of the appeal for funding for the proposed new nature centre, which was held in Shire Hall, Gloucester.  In 1992 a new headquarters and Conservation Centre was opened at Robinswood Hill Country Park by Sir David Attenborough. In 1993 Sir Henry Elwes became the President following the late Lord Dulverton.  In 1995 Prince of Wales visited the Midger SSSI reserve, being one of the woodland reserves in the county.  In 1997 Prince of Wales opened the Lower Woods SSSI Nature Reserve. In 1999 Chris Packham launched an event on Cleeve CommonDoe, J, Parrott, S, (edited McGlone, Dr. G, Regini, K), October 1989, 'Gloucestershire Commons – Their History, Wildlife and Future', Gloucestershire Trust for Nature Conservation hosted by the Trust, which involved geological work at Rolling Bank Quarry SSSI. In 2004 a Special 10-year award from 'Investors in People' was achieved. In 2008 the Badgeworth SSSI nature reserve, the first reserve managed by the Trust, celebrated its 75th anniversary. In 2012 this reserve celebrated its 50th anniversary of being managed by the Trust.", "In December 2014, Ellie Harrison the host of Countryfile became President of the Trust taking over from Sir Henry Elwes."]}, {"page": "Lord Lieutenant of Gloucestershire", "response": ["*Sir Henry Elwes 17 February 1992 – 24 October 2010London Gazette, issue no.52841, 20 February 1992"]}, {"page": "Gloucestershire County Council", "response": ["*Sir Henry Elwes (born 1935), later Lord Lieutenant of Gloucestershire'ELWES, Sir Henry (William George)' in Who's Who 2013 (London: A & C Black, 2012)"]}, {"page": "Ellie Harrison (journalist)", "response": ["In December 2014, Harrison took over as President of the Gloucestershire Wildlife Trust from Sir Henry Elwes."]}, {"page": "Henry William George Elwes", "response": ["#REDIRECT Henry Elwes"]}, {"page": "List of deputy lieutenants of Gloucestershire", "response": ["* Sir Henry Elwes"]}, {"page": "Fruit and Vegetable Preservation Research Station", "response": ["The Duke of Kent visited on Wednesday 16 November 1994, with Sir Henry Elwes; the Duke was representing the British Overseas Trade Board. Times Wednesday November 16 1994, page 18 The Princess of Wales opened a new building on Thursday June 27 1996.Times Thursday 27 June 1996, page 20 Anne, Princess Royal attended an annual lecture lunch on Wednesday June 9 2004.Times Thursday June 10 2004, page 35"]}]}}