{"wiki_id": "http://www.wikidata.org/entity/Q1189059", "itemLabel": "Dennis Crompton", "itemDescription": "British architect", "wikipedia_url": "https://en.wikipedia.org/wiki/Dennis_Crompton", "wikipedia_page": {"main": "Dennis Crompton (born in 1935) is an English architect, lecturer and writer on architectural subjects. He was a member of Archigram. He was known as the back-room fixer dealing with technology and looking after the archives of the group.", "link_mentions": [{"page": "Archigram", "response": ["Based at the Architectural Association in London, the main members of the group were Peter Cook, Warren Chalk, Ron Herron, Dennis Crompton, Michael Webb and David Greene. Designer Theo Crosby was the \"hidden hand\" behind the group.Simon Sadler, Archigram: architecture without architecture, MIT Press, 2005, p.161 He gave them coverage in Architectural Design magazine (where he was an editor from 1953–62), brought them to the attention of the Institute of Contemporary Arts (ICA) in London, where, in 1963, they mounted an exhibition called Living City,Crosby raised the money for this from the Gulbenkian Foundation, and subsequently edited its publication in the ICA's Living Arts magazine: Sadler, op cit, p.207 and in 1964 brought them into the Taylor Woodrow Design Group, which he headed, to take on experimental projects.Peter Cook, Archigram, Princeton Architectural Press, 1999, p.44 The pamphlet Archigram I was printed in 1961 to proclaim their ideas. Committed to a 'high tech', light weight, infra-structural approach that was focused towards survival technology, the group experimented with modular technology, mobility through the environment, space capsules and mass-consumer imagery. Their works offered a seductive vision of a glamorous future machine age; however, social and environmental issues were left unaddressed. "]}, {"page": "Architectural Association School of Architecture", "response": ["The AA Bookshop has a wide collection of architectural literature  and is used as a platform for AA's own publications. AA Publications has a long tradition of publishing architects, artists and theorists early in their careers, as well as occasionally publishing figures who have already gained notoriety in other fields of expertise, such as Salman Rushdie. AA Publications produces the journal, AA Files, and the AA Book, known as the Projects Review, which annually documents the work undertaken by members of the school from Foundation to Graduate programmes. AA publications are designed and edited by the AA Print Studio, originally established in 1971 as part of the Communications Unit directed by Dennis Crompton of Archigram. The school had its own independent radio station."]}, {"page": "Ron Herron", "response": ["Shortly after finishing his architectural studies, Herron went to work for London County Council, alongside Warren Chalk and Dennis Crompton."]}, {"page": "British high-tech architecture", "response": ["*Dennis Crompton (b. 1935) founding member and archivist of Archigram"]}]}}