{"wiki_id": "http://www.wikidata.org/entity/Q11813548", "itemLabel": "Patrick Whitefield", "itemDescription": "English horticulturist", "wikipedia_url": "https://en.wikipedia.org/wiki/Patrick_Whitefield", "wikipedia_page": {"main": "Patrick Whitefield (born Patrick R. Vickers, 11 February 1949 – 27 February 2015) was a British permaculture teacher, designer, author, and consulting editor for Permaculture Magazine.  He was regarded as one of the leading and pioneering permaculture authorities in Europe.He was born Patrick Vickers, in Devizes, Wiltshire, and grew up on a smallholding in Somerset before studying agriculture at Shuttleworth College in Bedfordshire.  After several years working in agriculture in the Middle East and Africa, he returned to Somerset and bought a flower-rich hay meadow, the White Field near Butleigh, to maintain it as a nature reserve.  Thereafter he took his name from the field, which, after 25 years, he transferred to the care of the Somerset Wildlife Trust.As well as producing vegetables, Whitefield undertook a variety of traditional country crafts, and for a period was a prominent member of the Ecology Party (forerunner of the Green Party of England and Wales) and was involved in the early years of the Glastonbury music festival. He was an influential British exponent of the permaculture system from 1990, developing his own approach.  He was interviewed in several television programmes advocating permaculture, including the BBC's It's Not Easy Being Green (2006) and A Farm for the Future (2008).He was the author of Tipi Living (1987), Permaculture in a Nutshell (1993), How to Make a Forest Garden (1996), The Earth Care Manual (2004), and The Living Landscape, How to Read it and Understand it (2010).  The Minimalist Gardener (2017) was posthumously published.   He taught on various courses in England, including at Ragmans Lane Farm in Gloucestershire and created the first online permaculture design course in Britain. He also worked as a permaculture design consultant, and set up Patrick Whitefield Associates to pass on his skills and experience to a new generation of teachers.He died at his home in Glastonbury, Somerset, on 27 February 2015, aged 66.\n\n", "link_mentions": [{"page": "Permaculture", "response": ["Proponents of forest gardens include Graham Bell, Patrick Whitefield, Dave Jacke, Eric Toensmeier and Geoff Lawton. Bell started building his forest garden in 1991 and wrote The Permaculture Garden in 1995, Whitefield wrote the book How to Make a Forest Garden in 2002, Jacke and Toensmeier co-authored the two volume book set Edible Forest Gardening in 2005, and Lawton presented the film Establishing a Food Forest in 2008."]}, {"page": "Forest gardening", "response": ["Robert Hart adapted forest gardening for the United Kingdom's temperate climate during the 1980s. His theories were later developed by Martin Crawford from the Agroforestry Research Trust and various permaculturalists such as Graham Bell, Patrick Whitefield, Dave Jacke and Geoff Lawton.", "Numerous permaculturalists are proponents of forest gardens, or food forests, such as Graham Bell, Patrick Whitefield, Dave Jacke, Eric Toensmeier and Geoff Lawton. Bell started building his forest garden in 1991 and wrote the book The Permaculture Garden in 1995, Whitefield wrote the book How to Make a Forest Garden in 2002, Jacke and Toensmeier co-authored the two volume book set Edible Forest Gardens in 2005, and Lawton presented the film Establishing a Food Forest in 2008."]}, {"page": "Mulch", "response": ["Cardboard or newspaper can be used as semi-organic mulches. These are best used as a base layer upon which a heavier mulch such as compost is placed to prevent the lighter cardboard/newspaper layer from blowing away. By incorporating a layer of cardboard/newspaper into a mulch, the quantity of heavier mulch can be reduced, whilst improving the weed suppressant and moisture retaining properties of the mulch.Patrick Whitefield, 2004, The Earth Care Manual, Permanent Publications,  However, additional labour is expended when planting through a mulch containing a cardboard/newspaper layer, as holes must be cut for each plant. Sowing seed through mulches containing a cardboard/newspaper layer is impractical. Application of newspaper mulch in windy weather can be facilitated by briefly pre-soaking the newspaper in water to increase its weight."]}, {"page": "Whitefield", "response": ["*Patrick Whitefield, British permaculture expert"]}, {"page": "It's Not Easy Being Green", "response": ["In the first series they received advice from permaculture expert Patrick Whitefield and green auditor Donnachadh McCarthy.  They were also helped by friends Jim Milner and Anda Phillips as well as at points a small army of friends and relatives.  A book entitled It's Not Easy Being Green: One Family's Journey Towards Eco-Friendly Living by Dick Strawbridge was released to accompany the series."]}, {"page": "Permaculture Association", "response": ["* Patrick Whitefield"]}, {"page": "2015 in the United Kingdom", "response": ["**Patrick Whitefield, 66, permaculturist."]}, {"page": "Deaths in February 2015", "response": ["*Patrick Whitefield, 66, English permaculturist.Patrick Whitefield 1949-2015"]}]}}