{"wiki_id": "http://www.wikidata.org/entity/Q11812012", "itemLabel": "Charles Dawson Booker", "itemDescription": "British flying ace", "wikipedia_url": "https://en.wikipedia.org/wiki/Charles_Dawson_Booker", "wikipedia_page": {"main": "Major Charles Dawson Booker  (sometimes hyphenated into Dawson-Booker) (21 April 1897 – 13 August 1918) was an English World War I fighter ace credited with 29 victories. He was promoted to high rank while relatively young as a result of his gallantry and unswerving dedication to his country.", "link_mentions": [{"page": "No. 201 Squadron RAF", "response": ["Charles Dawson Booker, "]}, {"page": "No. 208 Squadron RAF", "response": ["Anthony Arnold, Charles Dawson Booker, Robert J. O. Compston, Harold Day, Stanley Goble, "]}, {"page": "Robert A. Little", "response": ["Following a period of rest in England, Little turned down a desk assignment and volunteered to return to action on the Western Front, joining Lieutenant Colonel Collishaw's No. 3 Squadron RNAS in March 1918. The unit evolved into No. 203 Squadron of the new Royal Air Force on 1 April, formed after the merger of the RNAS and the Royal Flying Corps. Now ranked captain, and again flying Sopwith Camels, Little gained a further nine successes, beginning with a Fokker Triplane on 1 April, and concluding with two kills in one day on 22 May, an Albatros and a DFW. During this stretch of victories, on 21 April 1918, he was brought down unharmed by Friedrich Ehmann.VanWyngarden, Pfalz Scout Aces of World War I, p. 66 On 27 May, Little received reports of German Gotha bombers in the vicinity, and took off on a moonlit evening to intercept the raiders. As he closed with one of the bombers, his plane was caught in a searchlight beam and he was struck by a bullet that passed through both his thighs. He crash-landed in a field near Nœux, and bled to death before he was discovered the following morning by a passing gendarme. Little's skull and ankle had also been fractured in the impact; his body was identified by his friend and fellow ace, Charles Dawson Booker.Shores at al., Above the Trenches, p. 81  Collishaw launched an investigation but it was never established whether the single bullet that hit Little had come from a gunner in the Gotha or from the ground."]}, {"page": "Richard Minifie", "response": ["On returning to the Western Front, Minifie went on to score an additional four aerial victories on the Sopwith Camel. In March 1918, he was promoted to acting flight commander. Later that month, he acted as No. 1 Squadron's commanding officer during the transition of command from Dallas to Lieutenant Commander Charles Dawson Booker. On 13 March, Minifie led a party of four aircraft out on a patrol. While airborne, the group intercepted a formation of five German scout planes. In the ensuring battle, Minifie personally destroyed two of the aircraft while a third was shot down by one of his men. These two scout planes were to be Minifie's final victories of the war, raising his ultimate tally to twenty-one aircraft shot down and making him the seventh highest-scoring Australian ace of the conflict. His aerial achievements were composed of ten and one shared aircraft destroyed, eight and one shared out of control, and one captured. As a result of his gallantry while operating against hostile forces, particularly in the air battle of 13 March, Minifie was awarded a second Bar to his Distinguished Service Cross. The announcement and accompanying citation was published in the London Gazette on 17 April 1918, reading:"]}, {"page": "Adolf Ritter von Tutschek", "response": ["On 11 August 1917, after victory 23, von Tutschek was severely wounded in the shoulder by Flt Lt Charles Dawson Booker of Naval 8 Squadron. If Viktor Schobinger had not intervened and shot Booker down, von Tutschek would probably have been killed."]}, {"page": "Ulrich Neckel", "response": ["June 1918 was Neckel's greatest month, as he notched up eight victories, and added two more in July. On 12 August Neckel was appointed by Jagdgeschwader 2 Commander Rudolf Berthold to provisionally command Jasta 19. The following day saw Neckel's down 29-kill ace Major Charles Dawson Booker. Booker died gallantly, fighting six to one odds to preserve the life of the rookie pilot with him. This was Neckel's 22nd victory."]}, {"page": "Charles Booker", "response": ["* Charles Dawson Booker (1897–1918), World War I fighter ace"]}, {"page": "Hazel Wallace", "response": ["His next triumph on the morning of 15 May was more of the same, as Wallace, Findlay, Kinkead, Brading, Charles Dawson Booker, Robert McLaughlin, and three other British pilots pounced upon and destroyed an Albatros D.V. A solo \"out of control\" win on the afternoon patrol for the 15th, and another the next day put Wallace's tally at eight."]}, {"page": "Robert McLaughlin (RAF officer)", "response": ["He was posted to No. 201 Squadron in France, flying the Sopwith Camel single-seat fighter. He gained his first aerial victory on 9 May 1918 by destroying an Albatros D.V over Bapaume. On 15 May he repeated the feat, which he shared with Major Charles Dawson Booker, Captain Samuel Kinkead, Lieutenants Maxwell Findlay, R. Hemmens, James Henry Forman, Hazel LeRoy Wallace, Reginald Brading, and R. S. S. Orr. On 30 May he drove another D.V down out of control over Achiet-le-Grand."]}, {"page": "Hans Waldhausen", "response": ["On 27 September 1917, Waldhausen ignited and destroyed another observation balloon southwest of Roulette at 1705 hours, followed five minutes later by a 9 Squadron Royal Aircraft Factory RE.8 sent into Farbus Wood. At 1815 hours, Waldhausen flamed another balloon at Neuville-Saint-Vaast. Shortly thereafter, he came into combat with a number of British aircraft, and was shot down, although he survived, badly wounded.  It has been suggested that Waldhausen was a victim of Charles Dawson Booker and Philip Tudhope, although Herbert Thompson (later Sir Herbert Thompson) was credited with the \"kill\". BBC Radio \"Today\" 27th September, 1967  Waldhausen went off to a prisoner of war camp. His still-usable aircraft was renumbered by the Royal Flying Corps as serial number G74."]}, {"page": "Edward Crundall", "response": ["| Victory shared with Richard Burnard Munday & Charles Dawson Booker"]}, {"page": "Viktor Schobinger", "response": ["Leutnant Viktor Schobinger was a World War I flying ace credited with eight confirmed victories. Victory number two was confirmed over Charles Dawson Booker.", "His first success with them came when he downed Bristol F.2 Fighter number A7114 over Feuchy at 2100 hours on 9 August 1917. However, Schobinger's most notable triumph came two days later. British Triplane ace Charles Dawson Booker shot down and severely wounded Schobinger's Staffelführer, Adolf von Tutschek. In turn, Schobinger saved Tutschek by sending Booker unhurt down behind British lines, but destroying his machine. The hospitalized Tutschek passed temporary command of his jasta to Schobinger. The latter would lead Jasta 12 for nine weeks without suffering losses. While in command, he would have a personal insignia of a light blue ovoid painted stretching down the side of his Albatros D.V's fuselage.Van Wyngarden 2007, pp. 55, 69, 90."]}, {"page": "Maxwell Findlay", "response": ["Findlay was a Scotsman living in Canada when World War I began. He returned to the British Isles to enlist in the Black Watch (Royal Highland Regiment). He later transferred to the Royal Naval Air Service, being promoted from probationary temporary flight officer to temporary flight sub-lieutenant on 16 April 1917. His first duty assignment, to No. 6 Naval Squadron, brought him two \"out of control\" victories over Albatros D.Vs in July and August 1917. He transferred to No. 1 Naval Squadron, and used a Sopwith Camel to score three more \"out of control\" wins on 15 November and 4 December 1917, as well as on 8 March 1918, to become an ace. On 10 March, he destroyed an Albatros D.V. On the 16th, his second win was shared with Hazel LeRoy Wallace. By 30 May, his score was 14, including a shared win with Wallace, Charles Dawson Booker, Samuel Kinkead, James Henry Forman, Robert McLaughlin, Reginald Brading, R. Hemmens, and R. S. S. Orr. On 25 April 1918 he was appointed a temporary captain in the Royal Air Force."]}, {"page": "Reginald Brading", "response": ["Brading joined the Royal Naval Air Service on 12 June 1917, just a month past his eighteenth birthday. He trained in an operational squadron, 12 Naval, before being posted to 1 Naval in April 1918 as a Sopwith Camel pilot. On 2 May, he scored his first aerial victory when a squadron patrol caught a luckless German reconnaissance plane north of Albert and Brading, Samuel Kinkead, Hazel Wallace, and four other pilots sent it down out of control for a win apiece. On the 15th, Brading gained a second victory in similar fashion, teaming with Kinkead, Wallace, Charles Dawson Booker, Robert McLaughlin, Maxwell Findlay, James Henry Forman, and two other pilots to destroy an Albatros D.V to add to all their scores. Brading also received a second victory that day, for his solo win in driving a second Albatros D.V down out of control. His fourth triumph came on 9 June, when he drove a DFW reconnaissance plane down out of control. On 28 June, he became an ace by driving down another Albatros D.V. From there on, Brading's wins were always over the best German fighter planes, Fokker D.VIIs and a Pfalz D.XII. The only curiosity among them was the last pilot downed plummeted to his death in one of the pioneering uses of a parachute; that was on 16 September 1918."]}, {"page": "Reginald Soar", "response": ["By 22 July, Soar had raised his score to an even dozen, sharing some of his wins with Charles Dawson Booker, Robert A. Little, and a couple of other squadronmates. Soar's final tally was two captured enemy reconnaissance planes shared with other pilots, a share in destroying a recon machine, and nine enemy planes driven down out of control.At least one \"out of control\" victory was confirmed by capture of the German planes crew; see above. In official recognition of his exploits, he was awarded the Distinguished Service Cross, gazetted 11 August 1917."]}, {"page": "Richard Burnard Munday", "response": ["| Victory shared with Charles Dawson Booker and Edward Crundall"]}, {"page": "August 1918", "response": ["* Died: Charles Dawson Booker, British air force officer, commander of the No. 201 Squadron during World War I (killed in action) (b. 1897)"]}, {"page": "Booker (name)", "response": ["* Charles Dawson Booker (1897–1918), English World War I ace fighter pilot"]}, {"page": "List of World War I flying aces from the British Empire", "response": ["* Charles Dawson Booker"]}, {"page": "List of people educated at Bedford School", "response": ["*Major Charles Dawson Booker DSC (1897–1918), First World War flying aceChristopher Shores, Norman L. R. Franks, Russell Guest, Above the Trenches: A Complete Record of the Fighter Aces and Units of the British Empire Air Forces, 1915–20, 1990, "]}]}}