{"wiki_id": "http://www.wikidata.org/entity/Q1182053", "itemLabel": "Declan Ganley", "itemDescription": "Irish businessman, entrepreneur, and activist (born 1968)", "wikipedia_url": "https://en.wikipedia.org/wiki/Declan_Ganley", "wikipedia_page": {"main": "Declan James Ganley (born 23 July 1968) is an English-born Irish entrepreneur, businessman, and political activist. He was the founder and leader of the Irish branch of the Libertas Party.Primarily a telecommunications entrepreneur, Ganley has built businesses across the European Union, Russia and latterly, the United States. Notably, he co-founded Broadnet, a company which rolled out internet and telecoms services across the European Union in the late 1990s. In 1999, after the award of 42 German licences to Broadnet, the Irish Independent valued Broadnet at $875m. Ganley later sold his shares to Comcast for an undisclosed sum. \nAs of 2022, he is the chairman and CEO of Rivada Networks, a telecommunications company specialising in the use and arbitrage of wireless spectrum. Rivada has patented technologies in the field of dynamic spectrum arbitrage. In 2013, Ganley testified that Rivada's patents had the potential to \"save the taxpayer hundreds of millions of dollars\". He founded and sold companies in forestry and the online sector.\nDuring the 2008 Irish referendum on the Treaty of Lisbon, Ganley and the Libertas Institute successfully campaigned for a \"No\" vote, which was overturned in a second referendum. He campaigned for a \"No\" vote in the 2012 Irish European Fiscal Compact referendum. He has guest-presented Tonight with Vincent Browne.In 2009, Ganley founded and became chairman of Libertas, a political party with pan-European ambitions. The party was unsuccessful in the 2009 European Parliament Election, succeeding in getting only one candidate elected, in France. Ganley was upbeat after the defeat, describing the venture as a failed experiment.\n\n", "link_mentions": [{"page": "The Irish Times", "response": ["The Irish Times tended to support the Lisbon Treaty. However, opposing views were also printed, including articles by Declan Ganley of Libertas Ireland, and other anti-Lisbon campaigners."]}, {"page": "Máire Geoghegan-Quinn", "response": ["At the 1997 general election she retired from politics completely, citing privacy issues, after details about her 17-year-old son's expulsion from school appeared in the newspapers. \"If his mother had been a homemaker, an architect or a businesswoman, this simply would not have happened\" she commented.Alan Murdoch, \"Media blamed as Ireland's first woman cabinet minister quits\", The Independent, 28 January 1997. Other reports suggested that she saw her prospects for promotion under Ahern as poor,Denis Coughlan, \"Maybe more than a matter of family privacy Maire Geoghegan-Quinn will be a big loss to Fianna Fail, but the denizens of Leinster House are already calling 'next business',\" Irish Times, 28 January 1997. and a weak showing in constituency opinion polls indicated her seat could be in danger.John Burns and Rory Godson, \"Desperately seeking candidates\", The Sunday Times, 19 January 1997. She became a non-executive director of Aer Lingus, a member of the board of the Declan Ganley-owned Ganley Group, and wrote a column for The Irish Times."]}, {"page": "Václav Klaus", "response": ["In November 2008, during a stay in Ireland after a state visit, Klaus held a joint press conference with Declan Ganley, head of Libertas, which was at that time campaigning for a \"no\" vote in a referendum on the Lisbon Treaty. Members of the Irish government called this an \"inappropriate intervention\", and \"unusual and disappointing\".", "At the same meeting, Irish MEP Brian Crowley told Klaus that the Irish people wanted ratification of the Treaty of Lisbon and were \"insulted\" by Klaus' association with Declan Ganley and Libertas. Klaus responded that \"the biggest insult to the Irish people is not to accept the results of the Irish referendum\". Crowley replied, \"You will not tell me what the Irish think. As an Irishman, I know it best\". British Eurosceptic journalist Christopher Booker wrote that the meeting \"confirms the inability of the Euro-elite to accept that anyone holds views different from their own\"."]}, {"page": "Rurality Movement", "response": ["In the 2009 European Parliament election, the party ran as the junior partner of the Movement for France under the etiquette of the Libertas political movement led by Irish businessman Declan Ganley. They won 4.8% of the vote, but only one seat, that of MPF leader Philippe de Villiers."]}, {"page": "European political party", "response": ["* On 1 November 2008 Declan Ganley had registered a company in Dublin called the Libertas Party Ltd. Libertas applied for Europarty recognition which was briefly granted but then suspended following the disavowal of two of its candidates."]}, {"page": "Movement for France", "response": ["In the 2009 European Parliament election, the party ran with Hunting, Fishing, Nature, Tradition under the umbrella of the Libertas political movement led by Irish businessman Declan Ganley. It won 4.8% and only Philippe de Villiers was re-elected: Patrick Louis was defeated. The MPF was the only Libertas affiliated party throughout the whole of the European Union to elect MEPs in 2009. The party was member of the Europe of Freedom and Democracy (EFD) group during the 7th European Parliament."]}, {"page": "Irish European Constitution referendum", "response": ["Anti-Lisbon Treaty campaigners like Declan Ganley and Patricia McKenna quoted Giscard differently: \"Public opinion will be led to adopt, without knowing it, the proposals that we dare not present to them directly\" ... \"All the earlier proposals will be in the new text, but will be hidden and disguised in some way.\" To the Irish Times Giscard complained the full quote should have read: \"The latest brainwave is to preserve part of the innovations of the constitutional treaty, but hide them by breaking them up into several texts. The most innovative provisions would become simple amendments to the treaties of Maastricht and Nice. The technical improvements would be regrouped in a colourless, harmless treaty. The texts would be sent to national parliaments, which would vote separately. Thus public opinion would be led to adopt, without knowing it, the provisions that we dare not present directly. This process of 'dividing to ratify' is obviously unworthy of the challenge at stake. It may be a good magician's act. But it will confirm European citizens in the idea that the construction of Europe is organised behind their backs by lawyers and diplomats\"."]}, {"page": "Jens-Peter Bonde", "response": ["* 2009: Advisor to Declan Ganley for the European Election 2009"]}, {"page": "Earth Party", "response": ["In April 2009, the party announced in a joint press conference with the leader of the pan-European alliance Libertas.eu Declan Ganley that it would run for the 2009 European Parliament election with an open electoral list under the banner of Libertas.\"Libertas and MPT announce European election partnership\" , 27 April 2009, http://www.libertas.eu/   While not against European integration, MPT demands more accountability and transparency from the European Union, and the pursuit of a referendum on the Lisbon Treaty in Portugal.\"Europeias: MPT quer referendo em Portugal e é contra Tratado de Lisboa\" , 27 April 2009, Correio do Minho In the elections, MPT received 24,062 votes (0.67% of the votes)."]}, {"page": "Village (magazine)", "response": ["The magazine was sued by anti-Lisbon Treaty campaigner Declan Ganley in 2008 but proceedings were settled."]}, {"page": "The Hibernian", "response": ["Issue number 25 from May 2008 featured Declan Ganley of Libertas on the cover and carried an extensive interview with him.Interview with Declan Ganley, Issue number 25 May 2008"]}, {"page": "Citizens (Spanish political party)", "response": ["In 2009, it was announced that Cs would run for the European election allied with the Libertas coalition. The party's association with Declan Ganley's Libertas platform raised some concern on account of the coalition formed by the latter with nationalist and ultranationalist parties in each of its local European chapters, seemingly at odds with the professed ideology of Cs."]}, {"page": "2009 European Parliament election in Ireland", "response": ["| Declan Ganley"]}, {"page": "Libertair, Direct, Democratisch", "response": ["At the European level, the party allied itself with moderate Eurosceptics such as the British Conservative Party, the Czech Civic Democrats and the Polish Law and Justice, and sits on the European Conservatives and Reformists group in the European Parliament. LDD was initially expected to align themselves with the European Liberal Democrat and Reform Party (ELDR) after an open invitation to this effect by ELDR chairwoman Annemie Neyts. Prior to joining the ECR group, LDD was also briefly courted by Declan Ganley's pan-European movement Libertas."]}, {"page": "List of Catholic seminaries", "response": ["* Moyne Park, Abbeyknocknoy, Ballyglunin, Co. Galway, in 1909 opened as a Camillian hospice, a seminary for the Missionaries of the Sacred Heart in 1936, closed in the early 1970s. was the home of Declan Ganley, Donovan and George MacBeth until his death in 1992."]}, {"page": "Twenty-eighth Amendment of the Constitution Bill 2008", "response": ["|Libertas||Declan Ganley||No", "On 12 March 2008, Libertas, a lobby group started by businessman Declan Ganley launched a campaign called Facts, not politics which advocated a No vote in the referendum. A month later, the German Chancellor, Angela Merkel appealed to Irish people to vote Yes in the referendum whilst on a visit to Ireland. The anti-Lisbon Treaty campaign group accused the government and Fine Gael of a U-turn on their previous policy of discouraging foreign leaders from visiting Ireland during the referendum campaign. The European Commissioner for the Internal Market Charlie McCreevy admitted he had not read the Treaty from cover to cover, and said \"he would not expect any sane person to do so\".", "In September 2008 rumours in Brussels indicated that US billionaires and neocons heavily influenced the Irish vote by sponsoring the \"No\" campaigns, particularly those of Declan Ganley's Libertas lobby group. It is said that US interest groups this way pursued their goal of hindering the European Union to become a stronger partner internationally. However, the British conservative MEP Jonathan Evans reported to EUobserver on 9 December 2008 after returning from a European Parliament delegation to the US, \"[o]ur congressional colleagues drew our attention to a statement from US deputy secretary of state John Negroponte at Trinity College Dublin on 17 November, completely refuting the suggestion of any US dimension whatsoever\". The European Parliament is considering launching \"an inquiry to discover whether US agencies actively supported Libertas in the 12 June referendum.\"", "*Photos & Recordings of the College Historical Society debate on the Irish ratification of the Lisbon Treaty, featuring Garret FitzGerald, Joe Higgins, Declan Ganley and Maurice Hayes."]}, {"page": "2009 European Parliament election in the Czech Republic", "response": ["Two newly founded right-wing parties, the Czech wing Libertas.cz of Declan Ganley's Libertas founded by Vladimír Železný and the Party of Free Citizens, ran in the election."]}, {"page": "Áine Lawlor", "response": ["Lawlor also presents on an intermittent One to One, a current affairs interview programme on RTÉ One. She spent one interview with Libertas Institute leader, Declan Ganley, \"looking over the top of her glasses at him, utterly determined to put a halt to his gallop, and still he kept on coming\". In her interview with academic Samantha Power, Lawlor \"allowed Power to drone on in that earnest and humourless way peculiar to people who think that what they have to say is of grave global import\"."]}, {"page": "Declan J. Ganley", "response": ["#REDIRECT Declan Ganley"]}, {"page": "John McGuirk", "response": ["He has worked in various public relations roles and as a communications manager for Declan Ganley's Rivada Networks. He has been the editor of Gript Media, which describes its primary aim as supporting news and debate \"without the liberal filter,\" since 2020.  He also writes for the Irish Catholic. McGuirk has appeared as a guest on Irish broadcast media, including The Last Word and Tonight with Vincent Browne."]}, {"page": "Alive! (newspaper)", "response": ["In 2009, Fr. McKevitt attended a meeting in Roscommon of the John Paul II Society along with Declan Ganley (the founder of the now-defunct political organisation Libertas), Senator Rónán Mullen and a number of other conservative Roman Catholics.."]}, {"page": "Political foundation at European level", "response": ["It was reported on 1 November 2008 that Declan Ganley had registered a company in Dublin called the Libertas Foundation Ltd\"Ganley registers Libertas as a European political party\" Irish Times, 1 November 2008 and that it was intended \"to act as a European Political Foundation for the Libertas Party\". Ganley attempted to get EU recognition and funding of €111,000 for the Libertas Foundation in February 2009,\"Parliament says 'Yes' then 'No' to funding for Libertas\", European Voice, 5 February 2009 but the attempt was rejected because its board members were all from one member state and the foundation name was the same as the aspirant Europarty also founded by Ganley. The same meeting of the Bureau of the European Parliament that rejected the Libertas foundation but (momentarily) recognised the Libertas party also defunded the Alliance of Independent Democrats in Europe (AIDE)."]}]}}