{"wiki_id": "http://www.wikidata.org/entity/Q1181147", "itemLabel": "Dean Windass", "itemDescription": "English association football player (born 1969)", "wikipedia_url": "https://en.wikipedia.org/wiki/Dean_Windass", "wikipedia_page": {"main": "Dean Windass (born 1 April 1969) is an English former professional footballer who played as a striker. He played spells at Bradford City and contributed to his hometown team Hull City's promotion to the Premier League in 2008.\nWindass started his footballing career as a trainee at his hometown club, Hull City, and signed his first professional contract there. He scored 64 goals in 205 games for Hull, and, when he left, he brought the club a record transfer fee at the time, going on to play in the top divisions in both English and Scottish football. Later in his career, he returned to Hull City, and scored the only goal of the 2008 Football League Championship play-off final to take them to the top flight for the first time in their history.\nWindass also had two spells at Bradford City, where he became the club's third-highest scorer of all time. He has also played for Aberdeen, Oxford United, Middlesbrough, Sheffield Wednesday, Sheffield United, and Oldham Athletic. He is seen as a controversial player, once being sent off three times in a game for Aberdeen, as well as grabbing another opponent's testicles in a match at Bradford City.\nWindass scored his last Premier League goal at the age of 39, becoming Hull City's oldest-ever scorer. He officially announced his retirement from the game on 19 October 2009, but hoped to carry on with a career in coaching. He briefly worked as player-coach, under former manager Colin Todd at Darlington, but the pair only lasted nine games in charge.\nHe came out of retirement and played for Barton Town Old Boys before joining Scarborough Athletic on a game-by-game deal. In 2012 he began playing for AFC. Walkington in the Premier Division of the East Riding League, where his ex-teammate Leigh Palin is the manager.", "link_mentions": [{"page": "April 1", "response": ["*  1969   – Dean Windass, English footballer and manager"]}, {"page": "Kingston upon Hull", "response": ["Notable sportspeople include Ebenezer Cobb Morley (16 August 1831 – 20 November 1924) was an English sportsman and is regarded as the father of the Football Association and modern football. Clive Sullivan, rugby league player, who played for both of Hull's professional rugby league teams and was the first black Briton to captain any national representative team. The main A63 road into the city from the Humber Bridge is named after him (Clive Sullivan Way). Nick Barmby played for Tottenham Hotspur, Middlesbrough, Everton, Liverpool, and Leeds United before returning to play for his hometown club Hull City. He also won 23 England caps and played in the famous 5–1 victory over Germany in 2001. Another footballer is Dean Windass, who had two spells with Hull City."]}, {"page": "Bridlington", "response": ["There are three main parks. Queen's Park is a small open area at the junction of the B1254 and Queensgate. Westgate Park is a mostly wooded area between Westgate and the A165 on the outskirts of the town. The largest open area is Duke's Park, between Queensgate and the railway line. It hosts Bridlington Sports and Community Club, a skate park and Bridlington Town Football Club. In addition, there is a Sports Centre on the outskirts, in Gypsey Road, with a general-purpose sports hall, a gymnasium and squash courts. In January 2014, Bridlington Leisure World on the Promenade, with its swimming facilities, gymnasium and indoor bowling rinks, closed for redevelopment. A temporary Olympic legacy pool was opened by Jo Jackson in January 2014 at the Bridlington Sports Centre in Gypsey Road, while Leisure World was rebuilt. The new centre opened on 23 May 2016, with an official opening on 1 July 2016 by Rebecca Adlington, Gail Emms and Dean Windass."]}, {"page": "Bradford City A.F.C.", "response": ["*  Dean Windass", "*  Senior playersPeter Atherton, Wayne Jacobs, David Wetherall and Dean Windass appointed player/caretaker managers. (November 2003)"]}, {"page": "Oxford United F.C.", "response": ["John Shuker holds the record for the most league appearances with 478 between 1962 and 1977. John Aldridge holds the record for most league goals scored in a season in the 1984–85 season, scoring 30. Graham Atkinson holds the record for the most league goals with 77, as well as most overall goals with 107.Brodetsky p.360 The most capped player in internationals is Jim Magilton, with 18 caps for Northern Ireland. The largest amount of money Oxford have received by selling a player was an estimated £3,000,000 for Kemar Roofe's transfer to Leeds United in July 2016. The largest transfer fee Oxford have paid was £470,000 for Dean Windass' transfer from Aberdeen in August 1998,Brodetsky p.365 though the undisclosed fee paid for Marvin Johnson at the start of the 2016–17 season is thought to have exceeded this figure. Oxford are the only team in history to have been promoted consecutively from Division Three to the First Division as Champions."]}, {"page": "Hull City A.F.C.", "response": ["Hull reached the Second Division in 1985 under player-manager Brian Horton. They remained there for the next six years before finally going down in 1991, by which time the club's manager was Terry Dolan. Hull finished 14th in the Third Division in the 1991–92 season, meaning that they would be competing in the new Second Division the following season. In their first season in the rebranded division, Hull narrowly avoided another relegation, but the board kept faith in Dolan and over the next two seasons they achieved mid-table finishes. Financial difficulties hampered City's progress, as key players such as Alan Fettis and Dean Windass", "However, Taylor left the club to take up the manager's job at Crystal Palace and Colchester United's Phil Parkinson was confirmed as his replacement, but was sacked on 4 December 2006 with Hull in the relegation zone, despite having spent over £2 million on players during the summer. Phil Brown took over as caretaker manager, and took over permanently in January 2007, having taken Hull out of the relegation zone. Brown brought veteran striker Dean Windass back to his hometown club on loan from Bradford City, and his eight goals helped secure Hull's Championship status as they finished in 21st place.", "Adam Pearson sold the club to a consortium led by Paul Duffen in June 2007, stating that he \"had taken the club as far as I could\", and would have to relinquish control in order to attract \"really significant finance into the club\". Under Paul Duffen and manager Phil Brown, Hull City improved greatly on their relegation battle of 2006–07 and qualified for the play-offs after finishing the season in third place. They beat Watford 6–1 on aggregate in the semi-finals and played Bristol City in the final on 24 May 2008, which Hull won 1–0 at Wembley Stadium, with Hull native Dean Windass scoring the winning goal. Their ascent from the bottom division of the Football League to the top division of English football in just five seasons is the third-fastest ever."]}, {"page": "2004–05 in English football", "response": ["Leading goalscorer: Stuart Elliott (Hull City) – 27, and Dean Windass (Bradford City) – 27"]}, {"page": "EFL League One", "response": ["|style=\"text-align:left;\"|  Dean Windass"]}, {"page": "Roy Aitken", "response": ["The following season saw Aitken invest heavily in the transfer market; signing striker Dean Windass for £750,000 and midfielder Paul Bernard for a club record £1 million.  Bernard struggled to justify his expensive transfer fee whilst Windass' time at Pittodrie was hampered by his on-field indiscipline. Nevertheless, Aitken led Aberdeen to silverware when they won the Scottish League Cup on 26 November 1995, beating Dundee 2–0 in the final."]}, {"page": "Paul Jewell", "response": ["Richmond turned to Jewell, already Kamara's assistant manager, who then won his first game 2–1 to Stockport County. In his 21 games in charge, Jewell won six games and drew five to guide City to 13th, their highest position since Jewell had joined the club. He was rewarded with a permanent contract when others expected Richmond to recruit a higher-profile replacement. Richmond wanted to make a promotion challenge, so Jewell broke the club's transfer record twice within the first week of the 1998–99 season, first with the £1m acquisition of Lee Mills and then the £1.3m purchase of Arsenal youngster Isaiah Rankin. He also brought back Stuart McCall from Rangers. After a poor start, when City won just one of its first seven games, they picked up momentum and were second behind Sunderland for most of the latter half of the season. Jewell added Lee Sharpe on loan and a third £1m signing, Dean Windass, as City held off Ipswich Town and Birmingham City to finish second. With promotion to the Premier League, Bradford had returned to top-flight football after an absence of 77 years."]}, {"page": "Colin Todd", "response": ["Todd was announced as the new manager of League Two Darlington on 20 May 2009. He replaced Dave Penney who left the club to join League One side Oldham Athletic as a result of Darlington's administration. Todd brought Dean Windass, a player whom he had at Bradford City, as his assistant player manager. Darlington made a poor start to the 2009–10 season, and having picked up just one point from eight league games, Todd agreed with chairman Raj Singh that he would leave the club if they failed to win their ninth game against Grimsby Town. Darlington drew 1–1 with Grimsby and Todd, as well as Windass, left the club. They had won only one of their 11 games in charge, and none in the league—the club's worst start to a season."]}, {"page": "Brian Horton", "response": ["The 1987–88 campaign began promisingly, and Hull were in the top six and chasing the automatic promotion places by the half-way stage. However, a dreadful run of results in which there was just one win in 17 games ended any hope of promotion. Their form was not helped by the sale of star play-maker Garry Parker to Nottingham Forest for a £270,000 fee, which Horton later admitted was a mistake. After a 4–1 home defeat to Swindon Town, chairman Don Robinson was furious and immediately fired Horton. The players took responsibility for the defeat and urged the chairman to re-consider, Robinson obliged, but Horton refused the offer of reinstatement. During his reign he turned down the opportunity to sign apprentice Dean Windass."]}, {"page": "Jimmy Bullard", "response": ["Alongside comedians Rob Beckett and Ian Smith, Bullard hosted UK television channel Dave's comedy-football podcast The Magic Sponge. The podcast was an irreverent look at the lives of professional footballers and included appearances from guests including Barry Fry, Dean Windass and Lee Hendrie."]}, {"page": "Menston", "response": ["Paul Jewell, a retired footballer and the former manager of Bradford City, Sheffield Wednesday, Wigan Athletic and most recently Ipswich Town, has lived in the village since the 1990s. Dean Windass, the former Bradford City and Hull City footballer, lives in the village. Nick Hodgson, Nick Baines and Simon Rix, all members of the rock band, the Kaiser Chiefs, met while attending St. Mary's Roman Catholic High School in Menston. Born in Menston were: Smith Wigglesworth, a notable early Pentecostal preacher (1859); Eric Knight, the author who created the fictional collie, Lassie (1897); Annie Margaret Barr, a Unitarian minister and founder of the Kharang Rural Centre in the Khasi Hills, North East India (1899); and actor Sam Riley (1980)."]}, {"page": "John McDermott (English footballer)", "response": ["In October 2009, he was once again linked with the vacant managers post at Grimsby following the sacking of Mike Newell. This time McDermott as well as Dean Windass expressed a desire to take the job. McDermott was appointed assistant manager of Harrogate Town ahead of the 2010–11 season. In 2017, McDermott became the Director of Football at Cleethorpes Town, taking them to Wembley in the FA Vase Cup Final, before being named as Alfreton Town manager in May 2017."]}, {"page": "Fraizer Campbell", "response": ["Campbell finished the season as Hull's top scorer, with 15 goals in 32 appearances. On 24 May 2008, he played in the Hull City team that achieved promotion to the top flight for the first time in their 104-year history. Campbell provided the assist for Dean Windass' goal in a 1–0 win over Bristol City in the Championship play-off Final at Wembley Stadium."]}, {"page": "Stuart Elliott (footballer, born 1978)", "response": ["Elliott joined Hull City for £230,000 and in his first season finished as the club's top scorer in 2002–03 with 12 goals. In 2003–04, he continued to impress and again hit double figures for his club. As Hull City clinched a place in The Championship in 2004–05, Elliott enjoyed a fantastic season netting 27 goals in the league (which earned him the golden boot, albeit shared with Dean Windass) as well as two in the cup, while also starring for Northern Ireland. This goal scoring tally is perhaps made all the more impressive given that Elliott does not play as a striker and was out for 6 weeks with an injury during mid-season."]}, {"page": "2007–08 in English football", "response": ["24 May 2008: Hull City reach the top flight for the first time in their history with a 1–0 win over Bristol City in the Football League Championship play-off final, with 39-year-old striker Dean Windass scoring the winning goal. It is Hull's third promotion in five seasons – the second-quickest rise from the league's fourth tier to the highest. On the same day, Avram Grant is sacked as manager of Chelsea (without a major trophy for the first time in four years) despite having taken them to the brink of Premier League and Champions League glory this season."]}, {"page": "Steel City derby", "response": ["* Dean Windass"]}, {"page": "1999–2000 in English football", "response": ["22 March 2000 – Dean Windass scores a hat-trick in Bradford City's 4–4 relegation crunch thriller with Derby County at Valley Parade."]}, {"page": "David Wetherall", "response": ["Despite the club's relegation to League One and another spell in administration, Wetherall turned down a move away from Bradford City after snubbing Coventry City during the 2004 summer. In October 2004, Wetherall and fellow veteran player Dean Windass both signed year's extensions to their contracts, with Wetherall's keeping him at Bradford until the end of the 2007–08 season. He also put his injury problems to one side for the 2004–05 season and missed just one league game – a 1–1 draw with Walsall in February when he was ruled out because of suspension ending his run of 42 consecutive games. Bradford manager Colin Todd had identified Wetherall as a key player for the season, but despite scoring four goals and striker Windass' 27 goals earning him the league's top scorer's crown, Bradford could only finish 11th.", "Wetherall was one of four senior players to act as Bradford City manager for two weeks during November 2003, following the sacking of Nicky Law. He, as well as Peter Atherton, Wayne Jacobs and Dean Windass oversaw training but just one game when Bradford City lost 1–0 to Stoke City with Jacobs taking charge from the touchline. Wetherall took his first full steps into management on a caretaker basis when he was appointed player-manager at Bradford City following the sacking of Colin Todd on 12 February 2007. The side were on a poor run of form but Wetherall, whose role was extended in March, could not reverse the fortunes and the side were relegated to League Two. During Wetherall's short stint in charge the club won just two games and drew another four. During his spell in charge of Bradford, Wetherall appointed his former Leeds teammate Nigel Martyn as goalkeeping coach, a position he kept under McCall. Wetherall returned to concentrate on his playing career after Stuart McCall was named full-time manager during the summer of 2007."]}, {"page": "Stuart McCall", "response": ["McCall still had one year left on his Rangers contract in 1998, but much of the team that Walter Smith had built had left and McCall was allowed to leave on a free transfer by new manager Dick Advocaat, as long as he joined an English club. Barnsley and Huddersfield Town were both interested in signing McCall, but he rejoined Bradford City as club captain. Rookie manager Paul Jewell put together a squad which emerged as surprise promotion contenders after two seasons spent battling relegation, adding other new signings, including central midfield partner Gareth Whalley and striker Lee Mills, who went on to be club's top goal-scorer. The season started off slowly with just one win from the first seven games, but by the latter half of the season, City were vying with Ipswich Town and Birmingham City for the second promotion spot behind runaway leaders Sunderland. Loan signing Lee Sharpe and Dean Windass were added to the ranks and City had the chance to seal promotion in their penultimate game against relegation-threatened Oxford United. The game finished as a 0–0 draw, with McCall heading over the goal in the final minutes, taking the promotion bid to the final game of the season. Days later he was named the club's player of the year. A 3–2 victory over Wolverhampton Wanderers at Molineux on 9 May 1999 ensured promotion to the Premier League and denied Ipswich Town – the team that had thwarted McCall and Bradford 11 years before.", "On 2 July 2002. McCall joined Sheffield United, where he played an integral part in their first-team side, despite being 38, and also coached the reserves to the league title. He played 71 league games over the next two seasons, and scored twice, including a winner against former side Bradford. He was in the side that reached the Division One play-off final in 2003 as well as the semi-finals of both cup competitions that year. However he and Dean Windass, who was also now at Sheffield United, were both left out of the play-off final, as United lost 3–0 to Wolverhampton Wanderers. McCall played just two League Cup games in the 2004–05 season, and retired just a few weeks before his 41st birthday. His career total of 763 league games placed him in 13th position on the all-time appearance list of British footballers."]}, {"page": "Jerel Ifil", "response": ["In August 2009 Ifil appeared as a trialist for Scottish Premier League side Aberdeen in their 1–0 win over Hull City in a testimonial for Dean Windass. He subsequently signed a two-year deal with the club on 12 August 2009. He made his debut in a 3–1 loss to Celtic on the opening day of the 2009–10 SPL season."]}]}}