{"wiki_id": "http://www.wikidata.org/entity/Q118988", "itemLabel": "Lucy Gutteridge", "itemDescription": "Film actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Lucy_Gutteridge", "wikipedia_page": {"main": "Lucy Kérimée Gutteridge (born 28 November 1956) is an English retired actress. She is best known for her portrayal of Gloria Morgan Vanderbilt in the television miniseries Little Gloria... Happy at Last (1982), for which she received a Golden Globe Award nomination.", "link_mentions": [{"page": "1956", "response": ["** Lucy Gutteridge, English actress"]}, {"page": "1987 in film", "response": ["* The Trouble with Spies, directed by Burt Kennedy, starring Donald Sutherland and Lucy Gutteridge"]}, {"page": "1985 in film", "response": ["| Hitler's SS: Portrait in Evil || NBC Productions / Edgar J. Scherick Associates / Metromedia Producers Corporation || Jim Goddard (director); Lukas Heller (screenplay); Carroll Baker, Paul Brooke, Warren Clarke, Michael Elphick, José Ferrer, Lucy Gutteridge, Colin Jeavons, Stratford Johns, Derek Newark, Bill Nighy, John Normington, Tony Randall, John Shea, Robert Urquhart, David Warner, Ivor Roberts, John Dicks, Prentis Hancock, Struan Rodger, Robert MacLeod, John Woodnutt, Walter Sparrow, Bernard Lloyd, Peter Craze, John Benfield, James Coyle, Forbes Collins, Peter Howell, Pam St. Clement, Nick Brimble, Maurice Colbourne, Vernon Midgley, Peter Marquis, Jodie Andrews, Caspian Batorv || Drama, War || Live action"]}, {"page": "1984 in film", "response": ["| Top Secret! || Paramount Pictures || Jim Abrahams, David Zucker, Jerry Zucker (directors/screenplay); Martyn Burke (screenplay); Val Kilmer, Lucy Gutteridge, Christopher Villiers, Billy J. Mitchell, Jeremy Kemp, Omar Sharif, Peter Cushing, Michael Gough, Warren Clarke, Harry Ditson, Jim Carter, Eddie Tagoe, John Sharp, Ian McNeice, Gertan Klauber, Richard Mayes, Vyvyan Lorrayne, Max Faulkner, Tristram Jellinek, John J. Carney, Dimitri Andreas, Doug Robinson || Action, Comedy || Live action", "| A Christmas Carol || CBS / 20th Television / Entertainment Partners Ltd. || Clive Donner (director); Roger O. Hirson (screenplay); George C. Scott, Frank Finlay, David Warner, Susannah York, Edward Woodward, Roger Rees, Angela Pleasence, Michael Carter, Anthony Walters, Caroline Langrishe, Lucy Gutteridge, Nigel Davenport, Joanne Whalley, Timothy Bateson, Michael Gough, John Quarmby, Peter Woodthorpe, Liz Smith, John Sharp, Derek Francis, Brian Pettifer, Cathryn Harrison, Mark Strickson, Danny Davies, Catherine Hall || Family, Fantasy, Drama || Live action"]}, {"page": "Love in a Cold Climate", "response": ["* in 1980 by Simon Raven for Thames Television (set 1924-1940) starring Lucy Gutteridge, Rosalyn Landor, Michael Aldridge, Judi Dench, Vivian Pickles and Jean-Pierre Cassel "]}, {"page": "Omar Sharif", "response": ["| TV play by Don Webb, with John Mills and Lucy Gutteridge"]}, {"page": "The Seven Dials Mystery", "response": ["* Lucy Gutteridge as Lorraine Wade"]}, {"page": "Gloria Morgan Vanderbilt", "response": ["* Gloria Morgan Vanderbilt was portrayed by British actress Lucy Gutteridge in the 1982 television miniseries Little Gloria ... Happy at Last."]}, {"page": "Till We Meet Again (novel)", "response": ["It was also made into a 1989 television mini-series, Judith Krantz's Till We Meet Again starring Bruce Boxleitner, Hugh Grant, Courteney Cox, Michael York, Lucy Gutteridge, Charles Shaughnessy, Mia Sara, and Barry Bostwick."]}, {"page": "Judith Krantz's Till We Meet Again", "response": ["The story starts in Dijon in 1913. Eve (Lucy Gutteridge) is the daughter of a prominent doctor family, and is destined to be married off to Roger Grillont (James Langton), but instead she falls in love with a low-class theater performer, Alan Marais (Maxwell Caulfield). Alain believes that she is an orphan from the same social class as him, and loses his interest after finding out that she is a rich, privileged girl. Nevertheless, she follows him to live in Paris, where her neighbor Vivianne de Biron (Juliet Mills) helps her land a job as a showgirl. Alain disapproves of her profession, comparing it with prostitution, following which she leaves him.", "*Lucy Gutteridge as Eve de Lancel (part 1 & 2)"]}, {"page": "Top Secret!", "response": ["Top Secret! is a 1984 American action comedy film written and directed by Jim Abrahams, David Zucker, and Jerry Zucker (ZAZ). It stars Val Kilmer (in his film debut role) and Lucy Gutteridge alongside a supporting cast featuring Omar Sharif, Peter Cushing, Michael Gough, and Jeremy Kemp.", "* Lucy Gutteridge as Hillary Flammond", "Kilmer was cast after the directors saw him in a play called Slab Boys with Sean Penn and Kevin Bacon. He turned up to the audition dressed like Elvis Presley. \"I like to think of it as the role Elvis never got but should have\", said Abrahams. Lucy Gutteridge, who plays the female lead, had just appeared in the Royal Shakespeare Company production of Nicholas Nickleby."]}, {"page": "Golden Globe Award for Best Actress – Miniseries or Television Film", "response": ["| Lucy Gutteridge || Gloria Morgan Vanderbilt || Little Gloria... Happy at Last || NBC"]}, {"page": "Bernard Gutteridge", "response": ["In 1947, Gutteridge married Nabila Farah Kérimée Halim, daughter of H.H. Prince Muhammad Said Bey Halim of Egypt and a relative of Egypt's last king, Fuad II; they were divorced in 1971. One of their three daughters is the actress Lucy Gutteridge.Burke's Royal Families of the World, ed. Hugh Montgomery-Massingberd, 1977, pp. 27-28 Gutteridge subsequently remarried, in 1971, to Elizabeth Tegher."]}, {"page": "Hammer House of Horror", "response": ["Estate agent Norman Shenley (Denholm Elliott) has an affair with secretary Lolly Fellows (Lucy Gutteridge). Shenley wants to divorce his wife Emily (Pat Heywood) and marry Lolly but Emily does not consent. Mr Rayburn (James Laurenson)  visits Shenley, saying he wishes to sell a desolate property named Lower Moat Manor through him. Norman visits the house, and starts to hear a voice saying \"you shouldn't have killed your wife on Friday the 13th\" and sees Emily's body tumbling down, after which he wakes up in bed beside his wife. Thinking it was a nightmare, Norman returns to work that morning and finds that Lolly cannot remember Mr.Rayburn's visit the previous day. Shenley revisits Lower Moat Manor, but finds that the house does not exist, and when he enters a phone booth to inform Lolly, the message comes up \"why did you do it\", smoke emits from the telephone and chokes him. Again, he wakes up beside his wife and finds that he was having another nightmare within a nightmare. And again, neither Emily nor Lolly are able to remember him recounting these events to them before."]}, {"page": "Play of the Month", "response": ["|Hannah Gordon,Evelyn Laye,Rosalind Ayres,Julian Holloway,Lucy Gutteridge,Anton Rodgers,Geraldine Alexander"]}, {"page": "Hitler's SS: Portrait in Evil", "response": [":played by Lucy Gutteridge"]}, {"page": "A Christmas Carol (1984 film)", "response": ["* Lucy Gutteridge – Belle, Scrooge's fiancée"]}, {"page": "40th Golden Globe Awards", "response": ["*Lucy Gutteridge - Little Gloria... Happy at Last as Gloria Morgan Vanderbilt"]}, {"page": "Little Gloria... Happy at Last", "response": ["Little Gloria... Happy at Last is a 1982 American-British biographical drama television miniseries directed by Waris Hussein and written by William Hanley, based on the 1980 book of the same name by Barbara Goldsmith. It stars Lucy Gutteridge as socialite Gloria Morgan Vanderbilt and Angela Lansbury as her sister-in-law, Gertrude Vanderbilt Whitney, with Bette Davis, Christopher Plummer, Maureen Stapleton, Martin Balsam, Barnard Hughes, Glynis Johns, John Hillerman, Michael Gross, and Joseph Maher in supporting roles.", "* Lucy Gutteridge as Gloria Morgan Vanderbilt", "| Lucy Gutteridge"]}, {"page": "1956 in the United Kingdom", "response": ["* 28 November – Lucy Gutteridge, film actress"]}, {"page": "The Life and Adventures of Nicholas Nickleby (play)", "response": ["* Lucy Gutteridge as Milliner, Sprouter, Young Fiancee, Miss Ledrock and Madeline Bray"]}, {"page": "List of American films of 1984", "response": ["|Top Secret!||Jim Abrahams, David Zucker ||Val Kilmer, Lucy Gutteridge, Omar Sharif ||Comedy || Paramount"]}, {"page": "Don Webb (playwright)", "response": ["His television work started with a single play commissioned by Brenda Reid for the BBC after seeing LadyBird. Kenneth Ives directed a cast of Omar Sharif, Sir John Mills and Lucy Gutteridge in Edge Of The Wind, which was broadcast on Christmas Day 1985 on BBC2. The television work that followed included Radio Phoenix, twenty odd episodes of a teen series about a radio station in Southampton, then eight episodes of Juliet Bravo, culminating in a climactic final episode. He was employed on Rockliffe's Babies, again for the BBC, and then created the chart topping sitcom Joint Account, starring Hannah Gordon and Peter Egan."]}, {"page": "List of comedy films of the 1980s", "response": ["|Val Kilmer, Lucy Gutteridge, Omar Sharif, Peter Cushing, Michael Gough"]}, {"page": "List of adventure films of the 1980s", "response": ["|Tusks||Tara Moore||John Rhys-Davies, Andrew Stevens, Lucy Gutteridge, Julian Glover||United States||"]}, {"page": "The Devil's Crown", "response": ["* Lucy Gutteridge as Alys, Countess of the Vexin"]}, {"page": "1956 in British television", "response": ["* 28 November – Lucy Gutteridge, actress"]}, {"page": "The Trouble with Spies", "response": ["*Lucy Gutteridge as Mona"]}, {"page": "The Gay Lord Quex (play)", "response": ["An early television production of excerpts from the play, directed by Royston Morley, was broadcast by the BBC in April 1938.\"Broadcasting\", The Times, 22 April 1938, p. 12 Morley also directed the BBC's first post-war television production of the play, with Ronald Ward as Quex (1947). Later BBC television versions were transmitted in 1953 with André Morell as Quex, with Joyce Heron and Alan Wheatley; and 1983, starring Anton Rodgers, Lucy Gutteridge and Hannah Gordon.\"The Gay Lord Quex\", BBC Genome, retrieved 10 February 2018 BBC Radio broadcast versions of the play starring Peter Cushing (1954), Jack Hulbert (1964), and Nigel Patrick (1973)."]}, {"page": "The Woman He Loved", "response": ["*Lucy Gutteridge as Thelma Furness, Viscountess Furness"]}, {"page": "List of LGBT-related films of 1993", "response": ["|Grief ||  || United States || Comedy || Craig Chester, Kent Fuher (also as Jackie Beat), Illeana Douglas, Alexis Arquette, Carlton Wilborn, Lucy Gutteridge, Robin Swid, William L. Rotko (credited as Bill Rotko),  Shawn Hoffman, Frank Rehwaldt, Greg Bennett, Mickey Cottrell, Katherine Connella (credited as Catherine Connella), Mary Woronov and Mauri Bernstein\t||"]}, {"page": "Gutteridge", "response": ["* Lucy Gutteridge (born 1956), British actress"]}, {"page": "Richard Glatzer", "response": ["Glatzer used his experience working in day time television to create his first independent film, Grief (1993), a comedy-drama focusing on a writer for a trashy daytime TV show who comes to grips with office politics, a co-worker crush and homophobia. It premiered at San Francisco's Frameline Festival where it won the Audience Award for Best Picture. It then went on to Toronto, where it was picked out by former LA Weekly critic Manohla Dargis as one of the festival highlights. It starred Craig Chester, Illeana Douglas, Alexis Arquette, Jackie Beat, Carlton Wilborn, and Lucy Gutteridge."]}, {"page": "The Life and Adventures of Nicholas Nickleby (1982 film)", "response": ["*Lucy Gutteridge as Madeleine Bray"]}, {"page": "Merlin and the Sword", "response": ["* Lucy Gutteridge as Niniane"]}, {"page": "Love in a Cold Climate (1980 TV series)", "response": ["Love in a Cold Climate is a 1980 British television series produced by Thames Television. It is an adaptation of the Nancy Mitford novels The Pursuit of Love (1945) and Love in a Cold Climate (1949), set between 1924 and 1940, with a screenplay adaptation by Simon Raven.Harris M. Lentz III, \"Raven, Simon\" in Obituaries in the Performing Arts, 2001: Film, Television, Radio, p. 242 It was originally broadcast on the ITV network in eight episodes. The series starred Lucy Gutteridge, Rosalyn Landor, Michael Aldridge, Judi Dench, Vivian Pickles, and Jean-Pierre Cassel.", "*Lucy Gutteridge as Linda "]}]}}