{"wiki_id": "http://www.wikidata.org/entity/Q11879940", "itemLabel": "Lynda Baron", "itemDescription": "English actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Lynda_Baron", "wikipedia_page": {"main": "Lilian Baron (born 24 March 1939), known professionally as Lynda Baron, is an English actress, comedian and singer, best known for playing Auntie Mabel in the award-winning children's series Come Outside (1993–1997), Nurse Gladys Emmanuel in the BBC comedy series Open All Hours (1976–1985) and its sequel, Still Open All Hours (2013–2016), and the part of Linda Clarke in EastEnders in 2006 and from 2008 to 2009, with a brief return in 2016.", "link_mentions": [{"page": "Coronation Street", "response": ["The BBC commissioned a one-off drama called The Road to Coronation Street, about how the series first came into being. Jessie Wallace plays Pat Phoenix (Elsie Tanner) with Lynda Baron as Violet Carson (Ena Sharples), Celia Imrie as Doris Speed (Annie Walker) and James Roache as his own father William Roache (Ken Barlow). It was broadcast on 16 September 2010 on BBC Four."]}, {"page": "Follies", "response": ["The musical played in the West End at the Shaftesbury Theatre on July 21, 1987, and closed on February 4, 1989, after 644 performances. The producer was Cameron Mackintosh, the direction was by Mike Ockrent, with choreography by Bob Avian and design by Maria Björnson. The cast featured Diana Rigg (Phyllis), Daniel Massey (Ben), Julia McKenzie (Sally), David Healy (Buddy), Lynda Baron, Leonard Sachs, Maria Charles, Pearl Carr & Teddy Johnson. Dolores Gray was praised as Carlotta, continuing to perform after breaking her ankle, although in a reduced version of the part.\"'Follies' London listing\" sondheimguide.com. Retrieved August 29, 2010. During the run, Eartha Kitt replaced Gray, sparking somewhat of a comeback (she went on to perform her own one-woman show at The Shaftesbury Theatre to sell-out houses for three weeks from 18 March 1989 after Follies closed). Other cast replacements included Millicent Martin as Phyllis. Julia McKenzie returned to the production for the final four performances.", "|colspan='1' align=center| Lynda Baron"]}, {"page": "British sitcom", "response": ["Open All Hours (1976, 1981, 1982 and 1985) was created and written by Roy Clarke for the BBC. It ran for 26 episodes in four series and stars Ronnie Barker (Porridge)  with David Jason  (Only Fools and Horses) with a regular supporting cast that includes Lynda Baron, Stephanie Cole, Barbara Flynn, Maggie Ollerenshaw, and Kathy Staff.", "dinnerladies (1998 –2000) closed the decade with the BBC One sitcom winning many awards including \"Best New TV Comedy\" at the 1999 British Comedy Awards, and the second won \"Best TV Comedy\" in 2000. Created, written and co-produced by Victoria Wood starring herself as the main character, Brenda Furlong, it is based on the lives and interactions of the employees of a works canteen and ran for a total of 16  episodes.The permanent cast occasionally featured guest actors from many of the country's best known stars of comedy and straight drama on TV, film, radio, and stage, including  Joanne Froggatt (Downton Abbey, Liar, Angela Black), Tina Malone (Brookside, Shameless), Dora Bryan OBE (A Taste of Honey, Absolutely Fabulous, Last of the Summer Wine), Lynda Baron (Open All Hours, Coronation Street, EastEnders), Elspet Gray (The Whitehall Farces, Fawlty Towers, Black Adder, Four Weddings and a Funeral, Solo),  Janette Tough (The Krankies, French and Saunders),  Simon Williams (Upstairs, Downstairs; Holby City, EastEnders), Kenny Doughty (Coronation Street, Vera),  Eric Sykes CBE, an icon of 5 decades of British radio and TV sitcom,", "Still Open All Hours (2013–present) is a sequel to  Open All Hours and was created and written by Roy Clarke for the BBC. By 2020 47 episodes had been broadcast. It stars David Jason  (Only Fools and Horses) supported by James Baxter (Alma's Not Normal, Red Dwarf ) with a regular supporting cast that includes Lynda Baron,"]}, {"page": "David Jason", "response": ["| 2013– ||Still Open All Hours || Granville || A revival of the original series, featuring original cast members Lynda Baron and Maggie Ollerenshaw."]}, {"page": "Dinnerladies (TV series)", "response": ["The ensemble cast occasionally featured guest actors from many of the country's best known stars of comedy and straight drama on TV, film, radio, and stage, including  Joanne Froggatt (Downton Abbey, Liar, Angela Black), Tina Malone (Brookside, Shameless), Dora Bryan OBE (A Taste of Honey, Absolutely Fabulous, Last of the Summer Wine), Lynda Baron (Open All Hours, Coronation Street, EastEnders), Elspet Gray (The Whitehall Farces, Fawlty Towers, Black Adder, Four Weddings and a Funeral, Solo),  Janette Tough (The Krankies, French and Saunders),  Simon Williams  (Upstairs, Downstairs; Holby City, EastEnders), Kenny Doughty (Coronation Street, Vera),  Eric Sykes CBE, an icon of 5 decades of British radio and TV sitcom, "]}, {"page": "Streatham", "response": ["*Lynda Baron, actor"]}, {"page": "Bernard Cribbins", "response": ["Having played Tom Campbell, a companion to Dr. Who in the feature film Daleks' Invasion Earth 2150 A.D. (1966), Cribbins returned to Doctor Who in 2006, when a photograph of him and fellow Doctor Who alumna Lynda Baron at a wedding appeared on the BBC's tie-in website for the television episode \"Tooth and Claw\"."]}, {"page": "Open All Hours", "response": ["Across the road lives Nurse Gladys Emmanuel (Lynda Baron), occupied by her professional rounds, and her elderly mother. Arkwright longs to marry Gladys, but she resists his persistent pressures. In later episodes, it is explained that the two have been engaged for many years but have been unable to go through with a wedding due to the advanced age of her mother, for whom she cares at home. Though short-tempered with Arkwright, she is concerned for his and Granville's welfare.", "A sequel, entitled Still Open All Hours, was created in 2013 by original writer Roy Clarke and featuring several original cast members, including David Jason, Lynda Baron, Stephanie Cole and Maggie Ollerenshaw. On 30 January 2014, the BBC commissioned Still Open All Hours for six new episodes beginning on 26 December 2014. and has so far run for six series.", "| Nurse Gladys Emmanuel|| Lynda Baron || colspan=\"4\"  || 26", "In 1984, at which time no new episodes of the series had been produced for two years, a spin-off was proposed based around Lynda Baron's character, Nurse Gladys Emmanuel. Given the working title Call the Nurse, this spin-off series would have followed Nurse Gladys as she visited various eccentric and demanding patients. The characters of Arkwright and Granville were not written to appear, and Roy Clarke was keen to develop a new set of supporting characters rather than rely on those already built up for Open All Hours. A thirty-minute pilot was written but did not enter production as the BBC turned down the series; instead, Open All Hours returned for its fourth and what would be final series the following year."]}, {"page": "Bishop's Stortford", "response": ["*Lynda Baron (born 1939), an actress who played Nurse Gladys Emanuel in Open All Hours, lived in the town."]}, {"page": "The Two Ronnies", "response": ["As the series gathered more popularity, the sketches began to feature more famous and well-known British actors, including John Cleese, Patrick Troughton, Jacki Piper, Stratford Johns, Joan Sims, Patricia Routledge, Jenny Agutter and Lynda Baron, Ronnie Barker's co-star in Open All Hours."]}, {"page": "Witches (Discworld)", "response": ["* Nanny Ogg – Lynda Baron"]}, {"page": "Nanny Ogg", "response": ["In the Wyrd Sisters animated adaptation, Nanny Ogg was voiced by June Whitfield. In the BBC Radio 4 adaptation of Wyrd Sisters she was played by Lynda Baron."]}, {"page": "Duke of York's Theatre", "response": ["* In Celebration (5 July 2007 – 15 September 2007) by David Storey, starring Orlando Bloom, Tim Healy and Lynda Baron"]}, {"page": "Enlightenment (Doctor Who)", "response": ["Cumming came up with the idea that the Eternals would not blink and cast actors who she believed could provide detached performances. Cumming recalled Peter Sallis had played a similarly detached character in the 1974 BBC drama The Pallisers, and she cast him in the role of Striker. Sallis was present during the rehearsals for the serial but when production was delayed he was unavailable for the new filming dates, being committed to filming Last of the Summer Wine, and was forced to drop out of the production, being replaced by Keith Barron.  Lynda Baron was cast as Captain Wrack, having previously participated in Doctor Who in the 1966 serial The Gunfighters as the voice that sings the \"Ballad of the Last Chance Saloon\" heard throughout that story. Tony Caunter, who had previously played Thatcher in The Crusade and Morgan in Colony in Space, was given the role of Jackson, with Christopher Brown and David Rhule being cast as Marriner and Wrack's sidekick Mansell respectively. Similarly to Sallis, David Rhule was unavailable for the revised filming dates in January, so singer Leee John replaced him at short notice, despite having no previous acting experience.", "Reviewing the story for Doctor Who Magazine's 200 Golden Moments special edition, Jeremy Bentham described it as being epic in scale, suggesting it played to the original strengths of the series; \"performance, period set design and claustrophobic mood...\". He likens Enlightenment to the work of Stanley Kubrick, saying \"...it felt grand, it felt lonely, and yes, it felt epic.\" On reappraising the story for the same magazine following its release on DVD, Gary Gillatt was equally as effusive, calling it \"...one of Doctor Who's finest serials.\"  He highlights the performance of Keith Barron as Captain Striker as being \"a master class of under-stated menace\" and \"pitch perfect\", juxtaposing this with the over-the-top pantomime villainy of Lynda Baron as Captain Wrack, with the two captains balancing each other out perfectly."]}, {"page": "Theatre 625", "response": ["|Richard Todd,Ray Brooks,Anthony Bate,Lynda Baron,Diana Fairfax,John Barcroft,Barry Wilsher,Roger Kemp,John Baker,John Gill"]}, {"page": "Juke Box Jury", "response": ["* 6 November 1965 – Dave Clark, Lynda Baron, Alexandra Bastedo, Pete Murray"]}, {"page": "Stephanie Cole", "response": ["Since 2013, Cole has reprised her role as Delphine Featherstone in Still Open All Hours. She appears with original actors David Jason, Lynda Baron and Maggie Ollerenshaw."]}, {"page": "Urmston", "response": ["Other people born in the town include actor and entertainer Matthew Kelly, two former Manchester City footballers, David White and Michael Johnson, Franklin Charles Buckley (more commonly known as Major Frank Buckley) an English football player and notable manager for both Blackpool and Wolverhampton Wanderers, Lynda Baron, best known for playing Nurse Gladys Emmanuel in Open All Hours, and Jeremy \"Jez\" Kerr, singer and bassist of post-punk band A Certain Ratio. Actor George Coulouris was partly brought up in Urmston. Keith Hopwood, the rhythm guitarist of Herman's Hermits, attended Urmston Grammar School. Former Manchester United player David Herd had a home in Urmston; Herd had owned a local garage that still bears his name. Paul Stenning, ghostwriter and author, attended Urmston Grammar School and lived in the area for many years.Live Preston & Fylde http://www.live-magazines.co.uk/regions/preston-fylde/ magazine interview 2014, Pg. 117 Arts & Culture."]}, {"page": "The Upper Hand (TV series)", "response": ["*Auntie Pat (Lynda Baron) - Charlie's godmother; a lively, kind-hearted woman with a habit of pinching people's cheeks in greeting (to the point that other characters instinctively protect their faces on seeing her)."]}, {"page": "The Gunfighters", "response": ["Laurence Payne later played Morix in The Leisure Hive (1980) and Dastari in The Two Doctors (1985). Lynda Baron would later appear in the serial Enlightenment (1983), in the role of Captain Wrack, and as Val in the 2011 episode \"Closing Time\".", "This story is notable for being the first Doctor Who episode to contain musical narration, in the form of the \"Ballad of the Last Chance Saloon\". It was sung by Lynda Baron and written by Tristram Cary. The ballad itself is included as an extra on the CD soundtrack release. The notion of commissioning original songs for Doctor Who would resume when the series was revived in 2005, beginning with \"Song for Ten\" in \"The Christmas Invasion\"."]}, {"page": "You Bet!", "response": ["|bgcolor=\"ffdddd\"| Lynda Baron"]}, {"page": "The Rag Trade", "response": ["| Guest Stars: Lynda Baron and Barry Linehan"]}, {"page": "Come Outside", "response": ["Come Outside is a British educational children's television series that ran from 23 September 1993 to 18 March 1997, presented by and starring Lynda Baron as Auntie Mabel and her dog 'Pippin'. It remains one of the BBC's most successful and watched children's programmes of all time and due to its popularity, was repeated on CBeebies until Late 2009.", "The two main characters are Auntie Mabel (played by Lynda Baron), and her dog Pippin, who was initially played by a female dog also called Pippin and later by the dog's grandson Mr Higgins. A feature of Come Outside is Auntie Mabel's unusual mode of transport: a small aeroplane (a Slingsby T67 Firefly) with multi-coloured polka dots.", "*(Auntie) Mabel Featherstone – the main human character of the show. She lives with her dog, Pippin. In some episodes a close up of Auntie Mabel's hand can be seen, revealing a wedding ring. Auntie Mabel never talks of her husband, but rather about her sister Edie. Played by Lynda Baron.", "In the episode \"Marmalade\" Auntie Mabel flies to Seville to visit an orange grove. Shooting was restricted to the one day on which the oranges were ready for harvesting. This was only known with very short notice and consequently arrangements to fly out were made at the last minute. It happened well outside the main production period by which time Lynda Baron was committed to other work and was not free to travel to Seville. To make it appear that Aunt Mabel had visited the orange grove, she was recorded in the studio against a Chroma key background while a body double was used for reverse angle shots of her in Spain."]}, {"page": "Jane Beale", "response": ["Jane learns that Lucy is pregnant and suggests Lucy consider an abortion but Lucy wants Jane and Ian to adopt the baby. Jane agrees but Ian refuses and blames Jane for taking advantage of Lucy. Ian convinces Lucy to have an abortion and arranges it, then tells Jane that Lucy has miscarried. Fearing that Jane will learn the truth, Ian persuades her to visit her mother, Linda Clarke (Lynda Baron), in Florida. Jane is suspicious but Lucy convinces her to go. That night, Masood reminds her of their kiss and asks if he can go with her, but she goes alone as Masood stays in Walford after Syed attempts suicide. When Jane returns, the family learn that there are inconsistencies in Lucy and Peter's exam results and the papers will be investigated. Lucy denies cheating but later admits that she did. When Jane tells Lucy's friend Zsa Zsa Carter (Emer Kenny) that she is upset about Lucy's lies, Zsa Zsa assumes Jane is talking about the abortion and tells her about it. Jane asks Lucy to promise her that she is not hiding anything else and she does, but Jane learns that Ian knew about the abortion and that Lucy planned to cheat on her exam, so she decides to leave once she has what she feels she is owed. She opens another bank account and plans to transfer funds secretly before leaving, telling Ian that she no longer wants to adopt, but Ian suggests that she adopt Bobby and she agrees, as she can fight for access to him. Jane tells Christian about the abortion and he urges her to leave Ian, offering to help."]}, {"page": "List of former EastEnders characters", "response": ["| Linda Clarke || Lynda Baron || 2006, 2008–2009, 2016"]}, {"page": "Oh No It's Selwyn Froggitt", "response": ["*Lynda Baron – Vera Parkinson (Series 2–3)", "Froggitt lives with his mother (Megs Jenkins) and his brother Maurice (Robert Keegan). Maurice's girlfriend, Vera Parkinson, was played by Rosemary Martin in the first series. In the second and third series (during which Maurice and Vera marry), Vera was played by Lynda Baron. A running gag is Froggitt's mother saying \"Don't open that cupboard our Selwyn, things fall out!\" whenever he opens the cupboard in the Froggitt front room, before objects fall from it. Froggitt is on the committee of his local working men's club, serving as concert secretary in charge of booking \"turns\". Froggitt's colleagues on the committee are the dour Scouser Jack (Bill Dean), Harry (Harold Goodwin) and excitable, stereotypical Welshman Clive (Richard Davies), often referred to as Taff by Selwyn. All decisions taken by the club committee are taken on a \"show of hands...\" and \"carried unanimously\". In keeping with the A Midsummer Night's Dream characterisations, Maynard saw the committee as the mechanicals. Froggitt is incompetent at everything he turns his hand to, being equally inept at his day job (digging holes and filling them in), do-it-yourself at home, and booking acts for the club. Nevertheless, he is honest and hard-working, unlike the other committee members, who usually sit back in comfort while Froggitt does the manual labour. They generally tolerate him because he is prepared to volunteer for unwanted tasks. Barman at the club is Raymond (Ray Mort), often seen answering the telephone with a number of highly fictitious and fanciful addresses."]}, {"page": "The Mrs Bradley Mysteries", "response": ["John Alderton as Alastair Bing; Emma Fielding as Eleanor Bing, aka 'Mouse'; Tristan Gemmill as Garde Bing; Lynda Baron as Mrs. MacNamara; Tom Butcher as Bertie Philipson; Eleanor Tremain as Dorothy Manners; Sue Devaney as Mabel Jones; Simeon Andrews as Family Doctor; Tyler Butterworth as Ferdinand Bradley; Emma Davies as Hermione Bradley;  John Conroy as Henry Baxter;  Andrew Hallett as Constable; Roger Grainger as Funeral Vicar; Alec Linstead as Wedding Vicar; Carmela Marner as Pamela Storbin."]}, {"page": "Hands of the Ripper", "response": ["*Lynda Baron as Long Liz"]}, {"page": "Nancherrow", "response": ["* Lynda Baron as Dashka"]}, {"page": "Fat Friends", "response": ["*Lynda Baron as Norma Patterson (series 2-4)"]}, {"page": "Stanley Lebor", "response": ["He appeared in Minder in the Series 1 episode The Bengal Tiger, The Naked Civil Servant, \"Ever Decreasing Circles,\" Tarka the Otter, Gandhi, Grange Hill, 'Allo 'Allo!, Superman IV: The Quest for Peace and Last of the Summer Wine. In 1986 he acted with Lynda Baron in a party political broadcast for the SDP–Liberal Alliance."]}, {"page": "The Funny Side of Christmas", "response": ["Cast: Ronnie Barker as Arkwright, David Jason as Granville, and Lynda Baron as Nurse Gladys Emmanuel"]}, {"page": "Not So Much a Programme, More a Way of Life", "response": ["Whereas TW3 had had a dark nightclub atmosphere, the new programme used predominantly white sets. The theme tune was sung by Lynda Baron."]}, {"page": "BBC-3 (TV series)", "response": ["Regular performers included John Bird, Lynda Baron, David Battley, Roy Dotrice, Bill Oddie, and Leonard Rossiter.Radio Times entry for Radio Times entry for  Guests included Millicent Martin and Alan Bennett. The musical director was Dave Lee. With its white sets, BBC-3 retained the look of its predecessor, Not So Much a Programme. Its name was a reference to the BBC's second channel, BBC2, which had started the previous year."]}, {"page": "Donna Jackson", "response": ["Donna was raised by her grandmother Shirley (Lynda Baron), who appears in the series eight episode \"Bad Blood\". Clarke Peters, star of American drama series The Wire, was cast as her estranged father in 2009. He appeared from 14 July to 11 August 2009, suffering from cancer of the splenic flexure, pancreas and abdominal wall. Jacobs was \"thrilled\" by Peters' casting, and reported that his first appearance rendered the programme's crew \"star-struck\" for the first time in her five years on the show. His appearance allowed Donna to confront her father over his abandonment of her as a child, and rendered her devastated upon learning that he had accepted his impending death. Peters assessed that his appearance had an \"enormous impact\" on Donna, explaining that his role allowed the audience to discover more about her life, as: \"This is a way to get into these characters rather than just seeing them as one-dimensional characters, dealing with whatever happens at Holby.\" Producers Diana Kyle and Tony McHale intended the storyline to reveal a new side to Donna, depicting her attempting to cope, in contrast to the \"smiling party girl\" viewers were familiar with."]}, {"page": "List of music featured on Doctor Who", "response": ["| \"Ballad of the Last Chance Saloon\" || Lynda Baron || The Gunfighters || Lynda Baron later appeared onscreen as Captain Wrack in the Fifth Doctor serial Enlightenment. Specially composed for the episode."]}, {"page": "List of EastEnders characters (2006)", "response": ["Linda Clarke, played by Lynda Baron, is the mother of Jane Beale (Laurie Brett) and Christian Clarke (John Partridge). She appeared for two episodes in 2006, and then regularly from November 2008 to February 2009. On 8 April 2016, it was announced that Linda will return for a Beale family storyline later in the year. She returned on 26 May 2016, departing on 10 June the same year."]}, {"page": "Mrs. Brown, You've Got a Lovely Daughter (film)", "response": ["* Lynda Baron as Miss Fisher"]}, {"page": "Christian Clarke", "response": ["Christian is surprised to see his mother Linda (Lynda Baron) after having lost contact with her for nearly 20 years. At first, Christian dislikes her because she still disapproves of his sexuality, but when Ian's son Peter (Thomas Law) tells him how he lost his mother Cindy (Michelle Collins), Christian makes amends with her. Roxy unexpectedly goes into premature labour, and Christian offers to help raise the baby, Amy, as her marriage to Sean Slater (Robert Kazinsky) has ended. However, Roxy leaves Christian heartbroken when she gets back with Sean. She later tells Christian that he is to be Amy's godfather. Roxy gives her daughter the middle name Christina, after Christian. Christian's colleague at Masala Queen, Syed Masood (Marc Elliott), argues with him over his sexuality, saying that homosexuality goes against his God's will, but then unexpectedly kisses and has sex with Christian. Syed tries to avoid Christian, although Christian wants to begin a relationship with him. Syed refuses him although they continue with their affair, Syed eventually denies that he is gay and proposes to his girlfriend Amira Shah (Preeya Kalidas). On the day of Syed and Amira's engagement party, Christian takes a man called Luke back to his flat, but Luke beats Christian up after revealing he is not gay and hates gay men cottaging in public places. Following this, Christian becomes agoraphobic, but Syed helps Christian return to a normal life. Christian's friend James Mackie (Paul Keating) turns up, and Syed sees them together and is jealous. After James admits that he has feelings for Christian, Syed tries to put him off. Christian finds out and tells Syed that he will be with him but he must break up with Amira, but Syed cannot go through with it, so Christian starts a relationship with James. However, one day Christian takes Syed down an alleyway and kisses him, not realising they have been seen. Christian then breaks off his romance with James and restarts his secret affair with Syed. Christian and Syed are photographed looking cosy in an alleyway. Syed is blackmailed and Christian discovers it is Lucy. Syed soon breaks off the affair, and Christian tells Syed he cannot help arrange his wedding any more.", "On 8 April 2016, it was announced that Partridge would be \"briefly\" returning for a third guest stint in \"early summer\" 2016, alongside Lynda Baron who plays his on-screen mother, Linda Clarke. Their return storyline was billed as \"explosive\" for the Beale family, \"unmissable\", and something that would see \"change in the Beale family forever\". Partridge was confirmed to be filming EastEnders as well as touring with the production of Chicago The Musical. Of his return, Partridge said, \"I am thrilled to be able to return to EastEnders whilst touring the UK with Chicago. Christian is never far from my mind – I turn my back for five minutes and look what happens.\" Partridge returned to filming on 14 April 2016, filming scenes which he believed would air \"around June\". He described returning to filming as \"wonderful\" and compared to \"putting on a nice, comfortable pair of shoes.\" He also praised the EastEnders team for being \"very welcoming\", adding that it \"seemed so natural to be back\" and felt like he had \"never been away\". Partridge confirmed that he would feature in a lot of scenes with Brett as Christian will return to \"look after Jane Beale\". He teased that his return may involve the 'Who Killed Lucy Beale?' storyline and would be part of a \"big year\" for the Beale family."]}, {"page": "List of EastEnders characters (2008)", "response": ["Brenda buys Charlie a summerhouse for his allotment, but the concrete flooring is smashed by Suzy Branning (Maggie O'Neill), which looks like it will ruin the gift. However, the following day, Charlie sorts the problem so the concrete can be re-laid. Brenda helps raise money for Children in Need in The Queen Victoria but walks out of the pub after Linda Clarke (Lynda Baron) starts flirting with Charlie. On Christmas Day, Sean Slater (Robert Kazinsky) sings the song \"Stop The Cavalry\" to Roxy Slater (Rita Simons) as a Christmas present, and Brenda and a friend accompany him. When Charlie shared his concerns with Patrick Trueman (Rudolph Walker) that his and Brenda's relationship is moving too slowly, Patrick tells him to invite her to dinner and use candles to make it romantic. Charlie asks Winston (Ulric Browne) for some romantic music but he gives him club music. After this, Charlie gives Brenda some drink but spills it on her. As he wipes it off, he touches her breast and is interrupted by Danielle Jones (Lauren Crace). Brenda reassures Charlie that she has feelings for him but leaves with a worried look on her face."]}, {"page": "When We Are Married", "response": ["* 27 October 2010 - 26 February 2011, Garrick Theatre, London (Cast included Sam Kelly, Maureen Lipman, Lynda Baron and Jodie McNee who previously appeared in the 2009 Leeds production.)"]}]}}