{"wiki_id": "http://www.wikidata.org/entity/Q1187613", "itemLabel": "Vic Watson", "itemDescription": "English footballer (1897-1988)", "wikipedia_url": "https://en.wikipedia.org/wiki/Vic_Watson", "wikipedia_page": {"main": "Victor Martin Watson (10 November 1897 – 3 August 1988) was an English professional footballer who played most of his club football for West Ham United.", "link_mentions": [{"page": "West Ham United F.C.", "response": ["** Vic Watson (42) Div. One (1929–30)", "** Vic Watson (50) Div. One (1929–30)", "** Vic Watson (6) v Leeds United (h) 9 February 1929", "# 505 Vic Watson (1920–35)", "# 326 Vic Watson (1920–35)"]}, {"page": "Girton, Cambridgeshire", "response": ["* Vic Watson (1897-1988) West Ham United's record goal scorer"]}, {"page": "Lambert & Butler", "response": ["Taking advantage of the rise in popularity of football cards in the 1920s and 1930s, Lambert & Butler released a set of association football trading cards in 1931. It consisted of a series of painted portraits that included West Ham's star centre-forward, Vic Watson. Nevertheless, the outbreak of World War II forced tobacco companies to cease production of cigarette cards."]}, {"page": "1922–23 West Ham United F.C. season", "response": ["The match, that became known as the White Horse Final, kicked off 45 minutes late with thousands of fans standing on the touchlines. West Ham were 1-0 down within six minutes. Jack Tresadern entered the crowd to retrieve the ball and before he could return to the pitch Bolton had profited from the numerical advantage and taken the lead, with a header from David Jack. After a half-time break which had seen the players remain on the pitch, West Ham's only chance of the game came as Dick Richards swung a chest-high cross from the right wing for Vic Watson who had his shot saved and held by Bolton goalkeeper Dick Pym. Soon after, Bolton secured their victory with a goal from John Smith. There were so many bodies pressing up behind the goal that the ball instantly rebounded out and many had mistakenly thought that the ball had just hit a post. All subsequent FA Cup Finals were all-ticket.", "Vic Watson finished the season as top scorer with 27 goals in league and cup games. Billy Moore was the only ever-present player, finishing the season with 51 appearances.", "|Vic Watson"]}, {"page": "List of West Ham United F.C. seasons", "response": ["|Vic Watson", "|Vic Watson", "|Vic Watson", "|Vic Watson", "|Vic Watson", "|Vic Watson", "|Vic Watson", "|Vic Watson", "|Vic Watson"]}, {"page": "Wellingborough Town F.C.", "response": ["*Vic Watson, who left the club to join Premier League side West Ham United for just £50. Watson went on to become West Ham's all-time record goalscorer, with 326 goals in 15 years at Upton Park."]}, {"page": "List of West Ham United F.C. players", "response": ["| Vic Watson", "|Vic Watson"]}, {"page": "List of West Ham United F.C. records and statistics", "response": ["|Vic Watson"]}, {"page": "Syd King", "response": ["Following promotion Syd King instilled a period of consolidation for West Ham in the First Division, the highlight of which was the 1926–1927 season when West Ham finished in 6th place in Division One. This performance was not equalled by the Hammers until the 1958–1959 season during Ted Fenton's tenure. Part of the reason that this consistency was possible, was due to Syd King signing players that went on to become West Ham legends and record holders, as well as England internationals, including Jimmy Ruffell, Ted Hufton & Vic Watson."]}, {"page": "1988–89 in English football", "response": ["* 3 August 1988 – Vic Watson, 90, was West Ham United's all-time leading goalscorer with 326 goals between 1920 and 1935."]}]}}