{"wiki_id": "http://www.wikidata.org/entity/Q11812014", "itemLabel": "Leslie William Burbidge", "itemDescription": "British flying ace", "wikipedia_url": "https://en.wikipedia.org/wiki/Leslie_William_Burbidge", "wikipedia_page": {"main": "Captain Leslie William Burbidge  (born 10 March 1891, Bexhill-on-Sea, Sussex, England, date and place of death unknown) was a World War I flying ace credited with six aerial victories. He flew as an observer/gunner in Bristol F.2 Fighters in 20 Squadron.", "link_mentions": [{"page": "List of World War I aces credited with 6 victories", "response": ["| Leslie William Burbidge"]}, {"page": "William Benger", "response": ["Benger initially served in the King's Royal Rifle Corps, and transferred to the Royal Flying Corps in 1917, where he served as an observer/gunner in the Bristol Two-Seater Fighters of 20 Squadron. He was injured in action in a crash landing caused by anti-aircraft fire on 25 June 1917. He scored his first aerial victory on 25 September 1917, in a win shared with Leslie William Burbidge. Two days later, piloted by William Durrand, he set an Albatros D.V aflame over Moorslede. On 3 October, Benger scored an \"out of control\" victory. Eight days later, he set a D.V on fire and drove another one down out of control.Franks et.al. (1997), p. 4. On 17 October 1917 Benger was the observer in Bristol Fighter, No. A7271, piloted by Lieutenant Arthur Gilbert Vivian Taylor, which was shot down over Poelcapelle, Belgium, by Theodor Quandt of Jasta 36. Benger and Taylor were both captured, but died of their injuries shortly afterwards."]}, {"page": "Thomas Traill", "response": ["Traill scored eight aerial victories. In the process, he had three other aces serve as his gunner/observer at various times. While in combat on 2 July 1918, Percy Griffith Jones called out a warning from the plane's rear seat and Traill ducked. The German fighter behind them killed Jones and put a bullet through the cockpit and out the windscreen, missing Traill. Traill's next observer took an incendiary bullet in his leg. Leslie William Burbidge then became Traill's observer.", "| Observer: Leslie William Burbidge", "| Observer: Leslie William Burbidge"]}, {"page": "Leslie William Burbridge", "response": ["#REDIRECT Leslie William Burbidge"]}, {"page": "Burbidge", "response": ["* Leslie William Burbidge (1891–??), English World War I flying ace"]}, {"page": "List of World War I flying aces from the British Empire", "response": ["* Leslie William Burbidge"]}]}}