{"wiki_id": "http://www.wikidata.org/entity/Q1183376", "itemLabel": "Deirdre Cartwright", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Deirdre_Cartwright", "wikipedia_page": {"main": "Deirdre Cartwright (born 27 July 1958) is a British guitarist and composer.\nCartwright was a member of Painted Lady, which later became known as Girlschool; she left to form another band, Tour De Force.In 1983 Cartwright provided the guitar tuition element of the BBC/PBS series Rockschool alongside bass guitarist Henry Thomas and drummer Geoff Nicholls. In 1989, along with Alison Rayner, she started a regular monthly night at the Vortex Jazz Club called Blow The Fuse.", "link_mentions": [{"page": "Girlschool", "response": ["In 1975, school friends and neighbours from Wandsworth, South London, Kim McAuliffe (rhythm guitar, vocals) and Dinah Enid Williams (bass, vocals) formed an all-girl rock cover band called Painted Lady, together with Tina Gayle on drums. Deirdre Cartwright joined the new band on lead guitar, Val Lloyd replaced Gayle on drums and they started playing the local pub scene. \"The reason we were all girls was we couldn’t find any blokes who wanted to play with us! This was the natural thing to do\", McAuliffe explained to Gary Graff in 1997 about the all-female composition of the band."]}, {"page": "Steve Lodder", "response": ["Lodder became active in jazz music, playing with Maggie Nicols, John Etheridge, Harry Beckett, and Deirdre Cartwright.Eur (2002). The International Who's Who in Popular Music 2002 (Europa International Who's Who in Popular Music), Routledge, 1st ed. p. 309.  He toured with George Russell in the 1980s, and in 1989 accompanied Carol Grimes; later that year he toured with Simply Red."]}, {"page": "Cartwright (surname)", "response": ["* Deirdre Cartwright, British guitarist"]}, {"page": "Dierdre Cartwright", "response": ["#REDIRECT Deirdre Cartwright"]}, {"page": "Rockschool", "response": ["Aired in the United States by public television station WNET, Herbie Hancock was brought in to host the series for the American market. Hancock presented various topics in a studio classroom setting, interspersed with short lessons from the \"Rockschool Band\" composed of Deirdre Cartwright on electric guitar, Geoff Nicholls on drums, and Henry Thomas on bass, and interview segments with well-known musicians.", "* Guitar: Deirdre Cartwright", "* Deirdre Cartwright (official site)"]}, {"page": "1958 in jazz", "response": ["* 26 – Deirdre Cartwright, British guitarist and composer."]}, {"page": "List of Girlschool band members", "response": ["* Deirdre Cartwright - lead guitar"]}, {"page": "Lydia D'Ustebyn Ladies Swing Band", "response": ["* Deirdre Cartwright- Guitar"]}, {"page": "National Jazz Archive", "response": ["Patrons of the archive have included Baroness Amos, John Altman, Liane Carroll, Deirdre Cartwright, Gary Crosby, Paul Jones, Soweto Kinch, Cleo Laine, Michael Parkinson, Courtney Pine, John Prescott, Clare Teal, Kate Westbrook, and Mike Westbrook."]}, {"page": "List of years in jazz", "response": ["* 1958 in jazz, deaths of Carl Perkins, Danny Alvin, Doc Cook, Fulton McGrath, George E. Lee, Herbie Fields, Joe Morris, Lorraine Geller, Martha Boswell, Olivia Plunket Greene, Shifty Henry, Sterling Bose, Ted Donnelly, Tiny Bradshaw, Tom Brown, and W. C. Handy; births of Ana Caram, Andrew Lamb, Anita Baker, Anne-Marie Giørtz, Bajone, Bill Evans, Bjørn Klakegg, Bob Holz, Bruce Barth, Béla Fleck, Carlos del Junco, Carol Chaikin, Chieli Minucci, Claude Deppa, David Berkman, David Finck, David Hazeltine, David Newton, Deirdre Cartwright, Don Byron, Don Laka, Ellen Sandweiss, Erna Yuzbashyan, Frans Bak, Gabriel Fliflet, Gar Samuelson, George Koller, George Schuller, Gerald L. Cannon, Greg Boyer, Howard Alden, Jair-Rôhm Parker Wells, Jakko Jakszyk, Jan Gunnar Hoff, Jeanie Bryson, Jerry Zigmont, Jesse McGuire, Jim Campilongo, Jim Snidero, Joe DeRenzo, John Goldsby, Jonas Hellborg, Kenny Drew Jr., Kenny Washington, Kevin Mahogany, Kirk Whalum, Lakki Patey, Lannie Battistini, Lars Danielsson, Leon Lee Dorsey, Leroy Jones, Lewis Nash, Michael Formanek, Michael Weiss, Nancy Zeltsman, Olav Dale, Paul Grabowsky, Prince Rogers Nelson, Roberto Gatto, Rodney Franklin, Ronaldo Folegatti, Ronan Guilfoyle, Satoko Fujii, Stevie Vallance, Tom Schuman, Tomas Franck, Tony Lakatos, Ulf Wakenius, and Wolfgang Mitterer."]}, {"page": "The Sadista Sisters", "response": ["* Deirdre Cartwright, ", "* Deirdre Cartwright was ex-Painted Lady. "]}]}}