{"wiki_id": "http://www.wikidata.org/entity/Q11803262", "itemLabel": "Hugh Dundas", "itemDescription": "Fighter pilot and businessman (1920-1995)", "wikipedia_url": "https://en.wikipedia.org/wiki/Hugh_Dundas", "wikipedia_page": {"main": "Sir Hugh Spencer Lisle Dundas,  (22 July 1920 – 10 July 1995), nicknamed \"Cocky\", was a fighter pilot in the Royal Air Force (RAF) during the Second World War and later a senior broadcasting executive. He was promoted to squadron leader and awarded the Distinguished Flying Cross at the age of 21, advanced to wing commander at 22 and, at 23, was awarded the Distinguished Service Order and became one of the youngest group captains in the RAF. Dundas retired from the RAF in 1949, and was knighted in 1987 for his services to business and the media.", "link_mentions": [{"page": "Group captain", "response": ["* Hugh DundasWorld War II fighter pilot and the youngest person to hold this rank, aged 24 years"]}, {"page": "Johnnie Johnson (RAF officer)", "response": ["Johnson returned to operational flying in early 1941 in 616 Squadron, which was forming part of the Tangmere Wing. Johnson often found himself flying alongside Wing Commander Douglas Bader and Australian ace Tony Gaze. On 15 January 1941, Johnson, the recently appointed Squadron Leader Burton and Pilot Officer Hugh Dundas, who arrived back at the squadron on 13 September 1940, took off to offer cover for a convoy off North Cotes. The controller vectored the pair onto an enemy aircraft, a Dornier Do 17. Both attacked the bomber and lost sight of it and each other. Although the controllers intercepted distress signals from the bomber Johnson did not see it crash. They were credited with one enemy aircraft damaged. It was the only time Johnson was to engage a German bomber. By the end of January, Johnson had added another 16.35 flying hours on Spitfires.", "After the death of the WW2 RAF fighter pilot Douglas Bader in 1982, Johnson, Denis Crowley-Milling and Sir Hugh Dundas set up the Douglas Bader Foundation, to continue supporting disabled charities, of which Bader was a passionate supporter.", "Johnson spent most of the 1980s and 1990s as a keynote speaker, fundraiser and spending time on his hobbies; travelling, fishing, shooting and walking his dogs. Johnson appeared on the long–running British television show This Is Your Life on 8 May 1985, the 40th anniversary of VE Day. Among the programme's guests was German fighter ace Walter Matoni. British wartime propaganda had alleged Johnson had challenged Matoni to a personal duel; a version of events denied by Johnson. The two men arranged to meet after the war but were unable to do so until the TV programme. Among other guests was Hugh Dundas, \"Nip\" Heppel, who flew alongside Johnson on his first operation—in which he earned a rebuke from Bader—Crowley-Milling, Johnson's former wing commander Patrick Jameson and his uncle, Charlie Rossell who was over 100 years old at the time.", "As a teenager, Johnson became fascinated by speed and joined the Melton Car Club with two boyhood friends. Johnson enjoyed the lifestyle of cars and \"pacey women\". Although he had many early interests, Johnson later settled and added to his family. On 14 November 1942, Johnson married Pauline Ingate in Norwich during home leave. Hugh Dundas acted as best man and Lord Beaverbrook's son, Wing Commander Max Aitken also attended.  During the war Pauline worked for the Fire Service. They had two sons: Michael (16 October 1944) and Chris (born 1 December 1946). After the couple split up, Johnson lived with his partner, Janet Partridge."]}, {"page": "RAF Tangmere", "response": ["Later in the war, as the RAF turned from defence to attack, Group Captain Douglas Bader, the legless fighter ace, commanded the Tangmere wing of Fighter Command. Today he is commemorated by a plaque outside the former Bader Arms public house, now a Co-operative Food outlet in the village. 616 Squadron, which included Johnnie Johnson and Hugh Dundas, arrived at Tangmere in late February 1941.Sarkar, Dilip. Spitfire Ace of Aces: The True Wartime Story of Johnnie Johnson. Amberley Publishing, 2011.  page43 Johnson went on to become the highest scoring Western Allied fighter ace against the Luftwaffe."]}, {"page": "List of World War II aces from the United Kingdom", "response": ["| data-sort-value=\"Dundas,John\"| Dundas, John Charles || data-sort-value=\"16\"| 16 || 609 || DFC || KIA 28 November 1940 Brother of Hugh Dundas."]}, {"page": "Dundas (surname)", "response": ["* Hugh Dundas, British World War II fighter pilot", "* Hugh Dundas, Scottish chieftain, fought alongside William Wallace (Braveheart)."]}, {"page": "No. 616 Squadron RAF", "response": ["*Group Captain Sir Hugh Dundas CBE DSO & Bar DFC"]}, {"page": "List of aviators by nickname", "response": ["* \"Cocky\" – Hugh Dundas, British Second World War RAF fighter aceThe Most Dangerous Enemy, p.362."]}, {"page": "Index of World War II articles (H)", "response": ["# Hugh Dundas"]}, {"page": "No. 601 Squadron RAF", "response": ["| June 1948 || 1950 || Sqn Ldr Hugh Dundas, DSO & Bar, DFC"]}, {"page": "Cuthbert Orde", "response": ["In drawing the cream of the pilots, names and uniforms soon became out of date as subjects were promoted and decorated. On finishing his drawing of Hugh Dundas, Orde joked, \"I've left room for the DFC. The people I draw always seem to get it.\" Four days later Dundas did."]}, {"page": "List of RAF aircrew in the Battle of Britain (D–F)", "response": ["|Dundas, John Charles||Plt Off||BR||609 Sqn||DFC and bar||Official Ace, MIA 28 November 1940; older brother of Hugh Dundas"]}, {"page": "August 1915", "response": ["* Born: John Dundas, British air force officer, member of the No. 609 Squadron during World War II, recipient of the Distinguished Flying Cross, brother to Hugh Dundas, in West Yorkshire, England (d. 1940, killed in action) ;   Ring Lardner Jr., American screenwriter, recipient of the Academy Award for Best Original Screenplay for Woman of the Year and M*A*S*H, in Chicago (d. 2000)"]}, {"page": "1987 Birthday Honours", "response": ["*Robert Hugh Dundas, Supervisor, Forestry Service, Department of Agriculture, Northern Ireland."]}, {"page": "VE Day 70: A Party to Remember", "response": ["A message from Dame Vera Lynn was also read out, filmed interviews were shown and actor Adrian Lester read an account of fighter pilot Hugh Dundas. World War II veterans including Chelsea pensioners were guests of honour."]}, {"page": "Royal Air Squadron", "response": ["The Royal Air Squadron (RAS) is a flying club in the United Kingdom founded in 1966 by Peter Vanneck, the Hon. Hugh Astor and Anthony Cayzer - friends who shared a passionate interest in flying light aircraft. Prince Philip was the Squadron's Air Commodore. Two of the earliest members were Second World War heroes Sir Douglas Bader and Hugh Dundas. Others included Sir Max Aitkin, Tommy Sopwith, Kenneth McAlpine, John Houlder and Lord Waterpark."]}, {"page": "Deaths in July 1995", "response": ["*Hugh Dundas, 74, British RAF fighter pilot during World War II and later a senior executive for British television."]}]}}