{"wiki_id": "http://www.wikidata.org/entity/Q1189596", "itemLabel": "John Castle", "itemDescription": "British actor (b. 1940)", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Castle", "wikipedia_page": {"main": "John Michael Frederick Castle (born 14 January 1940) is an English actor. He is best known for his film and television work, most notably playing Bill in Michelangelo Antonioni's Blowup (1966) and Geoffrey in The Lion in Winter (1968). His other significant credits include Man of La Mancha (1972) and RoboCop 3 (1993).", "link_mentions": [{"page": "Abner", "response": ["*1985, King David (film) – Abner is portrayed by English actor John Castle. King David portrayed by Richard Gere. "]}, {"page": "John Newton", "response": ["*Newton is portrayed by actor John Castle in the British television miniseries, The Fight Against Slavery (1975)."]}, {"page": "The Prisoner", "response": ["* John Castle"]}, {"page": "David Irving", "response": ["* Irving was portrayed by John Castle in courtroom dramatizations of the Lipstadt case for the PBS Nova episode \"Holocaust on Trial\" (2000).\"Holocaust on Trial: Making\" NOVA Online"]}, {"page": "Agrippa Postumus", "response": ["*In I, Claudius (1976), a television series by Jack Pulman based on Graves' novels, Postumus was played by John Castle. This retains the story from the novel of Postumus being framed for the assault on Livilla, and the later visit to Planasia by Augustus, but removes his fictional survival and shifts the events concerning his banishment to after the Battle of the Teutoburg Forest. He is killed by Sejanus on Planasia after Augustus' death."]}, {"page": "2003 in film", "response": ["| Gods and Generals || Warner Bros. Pictures || Ronald F. Maxwell (director/screenplay); Jeff Daniels, Robert Duvall, Kevin Conway, C. Thomas Howell, Stephen Lang, Mira Sorvino, Jeremy London, Matt Letscher, Brian Mallon, Bo Brinkman, Bruce Boxleitner, William Sanderson, Billy Campbell, Alex Hyde-White, Joseph Fuqua, John Prosky, Royce D. Applegate, Patrick Gorman, W. Morgan Sheppard, James Patrick Stuart, Jonathon Demers, Andrew Prine, James Garrett, J. Scott Watkins, Fred Griffith, Tim O'Hare, John Castle, Matt Lindquist, Ted Turner, Lester Kinsolving, Cooper Huckabee, Kali Rocha, Donzaleigh Abernathy, Karen Hochstetter, Martin Clark, Christie Lynn Smith, Lydia Jordan, George Allen, Robert Byrd, Phil Gramm, Dana Rohrabacher, Ed Markey || Period, Drama || || Live Action"]}, {"page": "1993 in film", "response": ["| RoboCop 3 || Orion Pictures || Fred Dekker (director/screenplay); Robert John Burke, Nancy Allen, Rip Torn, John Castle, Jill Hennessy, Mako, C.C.H. Pounder, Remy Ryan, Bruce Locke, Jodi Long, John Posey, Felton Perry, Robert DoQui, Bradley Whitford, Daniel von Bargen, Stanley Anderson, Stephen Root, Eva LaRue Callahan, S.D. Nemeth, Mario Machado || Sci-Fi, Action || Live action"]}, {"page": "1985 in film", "response": ["| King David || Paramount Pictures || Bruce Beresford (director); Andrew Birkin, James Costigan (screenplay); Richard Gere, Edward Woodward, Alice Krige, Denis Quilley, Niall Buggy, Cherie Lunghi, Hurd Hatfield, Jack Klaff, John Castle, Tim Woodward, David de Keyser, Simon Dutton, Jean-Marc Barr, George Eastman, Arthur Whybrow, Christopher Malcolm, Valentine Pelka, Gina Bellman, James Coombes, Jason Carter, Aïché Nana, Ishia Bennison, Marino Masé, Anton Alexander, Tomás Milián, John Barrard, John Gabriel, Lorenzo Piani, David Graham, John Hallam, Ian Sears, Ned Vukovic, James Lister, Genevieve Allenbury, Massimo Sarchielli, Jenny Lipman, Roberto Renna, Michael Müller, Mark Drewry, Nicholas van der Weide, Shimon Avidan, Peter Frye, David George, Nicola Di Gioia || Epic, Historical, Drama || Live action"]}, {"page": "1980 in film", "response": ["| Never Never Land || Sharp Features || Paul Annett (director); Petula Clark, Cathleen Nesbitt, John Castle, Anne Seymour, Heather Miller, Evelyn Laye, Roland Culver || Drama || Live action"]}, {"page": "1979 in film", "response": ["| Eagle's Wing || Rank Film Distributors / Peter Shaw Productions || Anthony Harvey (director); John Briley (screenplay); Martin Sheen, Sam Waterston, Harvey Keitel, Stéphane Audran, John Castle, Caroline Langrishe, Jorge Russek, Manuel Ojeda, , Pedro Damian, Claudio Brook, José Carlos Ruiz, Farnesio de Bernal, Cecilia Camacho, Enrique Lucero || Western || Live Action"]}, {"page": "1969 in film", "response": ["*The Promise, starring John Castle and Ian McKellen – (U.K.)"]}, {"page": "Geoffrey II, Duke of Brittany", "response": ["Geoffrey has been portrayed by John Castle in the movie The Lion in Winter (1968) and by John Light in the 2003 made-for-TV remake. He has also been portrayed by Austin Somervell (as a boy) and Martin Neil (as an adult) in the BBC TV drama series The Devil's Crown (1978)."]}, {"page": "Kevin Whately", "response": ["In 1985, Whately appeared in a 3-part Miss Marple adaptation (\"A Murder Is Announced\") for the BBC. His part, Detective Sergeant Fletcher, opposite John Castle as Inspector Craddock, was very similar to what became the career-defining role he took two years later, when he was cast as Detective Sergeant Lewis, the down-to-earth complement to the eponymous Inspector Morse played by John Thaw. Whately starred opposite Thaw in 32 episodes over 13 years in the hugely successful series that established him as a household name in the UK."]}, {"page": "Lord Edgware Dies", "response": ["*John Castle as Lord Edgware"]}, {"page": "Blowup", "response": ["Blowup (sometimes styled as Blow-up or Blow Up) is a 1966 mystery thriller film directed by Michelangelo Antonioni and produced by Carlo Ponti. It was Antonioni's first entirely English-language film, and stars David Hemmings as a London fashion photographer who believes he has unwittingly captured a murder on film. The film also stars Vanessa Redgrave, Sarah Miles, John Castle, Jane Birkin, Tsai Chin, Peter Bowles, and Gillian Hills, as well as 1960s model Veruschka. The film's plot was inspired by Julio Cortázar's short story \"Las babas del diablo\" (1959). The screenplay was by Antonioni and Tonino Guerra, with English dialogue by British playwright Edward Bond. The cinematographer was Carlo di Palma. The film's non-diegetic music was scored by jazz pianist Herbie Hancock, while rock group the Yardbirds also feature. The film is set within the mod subculture of 1960s Swinging London."]}, {"page": "Mark Gatiss", "response": ["On 25 December 2013, a version of the ghost story \"The Tractate Middoth\" by M. R. James and adapted by Gatiss was broadcast on BBC Two as part of the long-running A Ghost Story for Christmas series. It starred Sacha Dhawan, John Castle, Louise Jameson, Una Stubbs, David Ryall, Eleanor Bron, Nick Burns and Roy Barraclough. It was followed on 25 December 2013 by a screening on BBC2 of a new documentary by Gatiss titled M. R. James: Ghost Writer. The programme saw Gatiss explore the work of James and look at how his work still inspires contemporary horror today."]}, {"page": "Thomas Flamank", "response": ["Flamank, played by John Castle, appeared as a character in the ninth episode of the 1972 BBC television series The Shadow of the Tower, which focused on the reign of Henry VII."]}, {"page": "Nicholas Monsarrat", "response": ["* The Reconciliation (1984) –  TV film, directed by John Jacobs, starring Roger Rees, John Castle, Jim Norton, Meg Davies, teleplay by Roy Russell."]}, {"page": "The Wings of the Dove", "response": ["It was again adapted as a television play by the BBC in 1965, directed by Rudolph Cartier. Another TV adaptation occurred in 1979 starring John Castle and Suzanne Bertish."]}, {"page": "The Wednesday Play", "response": ["| John CastleJulian GloverFreddie JonesEdwin RichfieldRoy StewartNigel StockJohn StrattonZena WalkerGordon GostelowDeclan Mulholland"]}, {"page": "Theatre 625", "response": ["|James Maxwell,Ann Lynn,Lyndon Brook,John Castle,David Buck,Reg Lye,Roland Brand,Robert Eddison,Ruth Dunning", "|Tony Selby,Anna Wing,Avril Elgar,John Castle,Richard Moore,Peter Pratt,Kevin Barry,Billy Russell,Patrick Cato,Sydney Arnold,Chris Chittell"]}, {"page": "Venice Preserv'd", "response": ["For the opening showing of Venice Preserv’d on 9 February 1682 at the Duke's Theatre, William Smith played the character of Jaffeir. In 1782 John Kemble was Jaffeir. In London in 1953, John Gielgud filled the role of Jaffeir. Alan Bates was Jaffeir in 1969 at The Bristol Old Vic's production of Venice Preserv’d. More recently, John Castle was Jaffeir in 1970 during the Prospects Productions’ of Venice Preserv’d. (6) in 1984 Michael Pennington was Jaffeir (6). In 2019, Michael Grady-Hall played Jaffeir at the RSC."]}, {"page": "King David (film)", "response": ["King David is a 1985 American Biblical epic film about the life of David, the second King of the Kingdom of Israel, as recounted in the Hebrew Bible. The film is directed by Bruce Beresford, written by Andrew Birkin and James Costigan, and stars Richard Gere in the title role. The ensemble cast includes Edward Woodward, Alice Krige, Denis Quilley, Cherie Lunghi, Hurd Hatfield, John Castle, Jean-Marc Barr, Christopher Malcolm, and Gina Bellman."]}, {"page": "Play of the Month", "response": ["|Elizabeth Spriggs,Betsy Blair,John Castle,Suzanne Bertish,Lisa Eichhorn,Rupert Frazer,Alan Rowe,Gino Melvazzi"]}, {"page": "Never Never Land (film)", "response": ["Never Never Land  is a 1980 British drama film directed by Paul Annett and starring Petula Clark, Cathleen Nesbitt, John Castle, and Anne Seymour. It is named after Neverland, the magical setting of the classic children's tales of Peter Pan.", "Seven-year-old Jennie (Heather Miller) has been abandoned by her parents and left in the care of her aunt Bee (Petula Clark) and uncle Jim (John Castle).  Jennie is treated poorly by her two elder cousins, and taking her lead from the story Peter and Wendy, she runs away from home with her younger cousin Joe (Christian Henson).  She finds shelter in an abandoned London townhouse occupied by a gang of young ruffians, and becomes the equivalent of Wendy, role-playing \"mother\" to the Lost Boys.  An old woman named Edith Forbes (Cathleen Nesbitt, in her final screen performance) befriends the girl."]}, {"page": "William N. Pendleton", "response": ["Pendleton was portrayed in the 2003 Civil War film Gods and Generals by John Castle. The scene featured a conversation between Pendleton and Stonewall Jackson regarding his son, Alexander Swift \"Sandie\" Pendleton, who was present.  During the scene, Pendleton informed Jackson of the naming the howitzers Mathew, Mark, Luke, and John; to which, Jackson replied \"I'm sure your men will spread the gospel wherever they encounter the enemy.\""]}, {"page": "The Three Hostages", "response": ["The story was adapted for television by the BBC in 1977. Written by John Prebble and directed by Clive Donner, the 85-minute television film The Three Hostages starred Barry Foster as Hannay, Diana Quick as Mary, Alexander Mackay as Hannay's son Peter John, Peter Blythe as Sandy Arbuthnot and John Castle as Medina. It was shown in the United States by PBS."]}, {"page": "Lillie (TV series)", "response": ["*John Castle as Prince Louis of Battenberg"]}, {"page": "Saved (play)", "response": ["The original cast included John Castle, Tony Selby, Ronald Pickup, Dennis Waterman, William Stewart, Barbara Ferris, Lucy Fleming, Gwen Nelson and Alison Fraser. The creative team included: director William Gaskill and lighting by Eric Baker."]}, {"page": "The New Avengers (TV series)", "response": ["| John Castle, Shaun Curry, Alun Armstrong, Michael Barrington, Brian Croucher, Stephen Moore, John Forbes-Robertson, David Purcell"]}, {"page": "Reilly, Ace of Spies", "response": ["* John Castle as Count Massino"]}, {"page": "List of people educated at Brighton College", "response": ["*John Castle (born 1940), actor"]}, {"page": "Peter Arne", "response": ["In 1968, he played the roles of the prisoner known as the Duke, as well as Dr. Sanson Carrasco, in the London stage production of Man of La Mancha. (The two roles were played by John Castle in the 1972 film version of the musical.)"]}, {"page": "List of The Professionals episodes", "response": ["| John Castle, Bruce Boa, Damien Thomas, Ralph Michael, David Baron, Peter Craze, Jim McManus, Peter Davidson, Luan Peters, Jonathan David", "| John Carson, John Castle, Ed Bishop, James Bree, Robert Rietti, Maya Woolfe, Anthony Bailey, John Bay, Hilary Ryan, Neville Barber"]}, {"page": "List of alumni of the Royal Academy of Dramatic Art", "response": ["*John Castle (Acting Diploma 1964)"]}, {"page": "Aleksandr Demyanenko", "response": ["* The Lion in Winter (1968) (John Castle)"]}, {"page": "Jacques Damala", "response": ["He has been portrayed by three actors in film and television biopics of Sarah Bernhardt. He was portrayed by John Castle in the film The Incredible Sarah (opposite Glenda Jackson) on 1976, by Canadian actor Jean LeClerc in the TV movie Sarah (also 1976) and by Gonzalo Vega in the Mexican TV series La Divina Sarah (1980)."]}, {"page": "Castle (surname)", "response": ["* John Castle, British actor", "* John Castle (baseball) (1879–1929), American baseball player"]}, {"page": "Antony and Cleopatra (1972 film)", "response": ["Antony and Cleopatra is a 1972 film adaptation of the play of the same name by William Shakespeare, directed by and starring Charlton Heston, and made by the Rank Organisation. Heston and Hildegarde Neil portray the titular roles of Mark Antony and Cleopatra, with a supporting cast featuring Eric Porter, John Castle, Fernando Rey, Carmen Sevilla, Freddie Jones, Peter Arne, Douglas Wilmer, Julian Glover and Roger Delgado. The picture was produced by Peter Snell from a screenplay by Federico De Urrutia and the director.", "* John Castle as Octavius Caesar "]}, {"page": "Man of La Mancha (film)", "response": ["* John Castle as Sanson Carrasco / The Duke"]}, {"page": "John Argentine", "response": ["Argentine is a major character in the Channel 4 drama The Princes in the Tower in which he interrogates Perkin Warbeck to test the veracity of his claim to being Richard of Shrewsbury, 1st Duke of York. He is portrayed in the show by John Castle."]}, {"page": "Cultural depictions of Augustus", "response": ["*Antony and Cleopatra (1972), portrayed by John Castle."]}, {"page": "The Lion in Winter (1968 film)", "response": ["The Lion in Winter is a 1968 British-American historical drama film set around the Christmas of 1183, about political and personal turmoil among the royal family of Henry II of England, his wife Eleanor of Aquitaine, their children, and their guests. The film was directed by Anthony Harvey; written by James Goldman (based on his own play of the same name); produced by Joseph E. Levine, Jane C. Nusbaum, and Martin Poll; and starred Peter O'Toole, Katharine Hepburn, John Castle, Anthony Hopkins (in his first major film role), Jane Merrow, Timothy Dalton (in his film debut) and Nigel Terry.", "* John Castle as Geoffrey, their middle son"]}, {"page": "I, Claudius (TV series)", "response": ["* John Castle as Postumus"]}]}}