{"wiki_id": "http://www.wikidata.org/entity/Q1189587", "itemLabel": "Dennis Waterman", "itemDescription": "English actor-singer", "wikipedia_url": "https://en.wikipedia.org/wiki/Dennis_Waterman", "wikipedia_page": {"main": "Dennis Waterman (born 24 February 1948) is an English actor and singer. He is best known for his tough-guy leading roles in television series including The Sweeney, Minder and New Tricks, singing the theme tune of the latter two.\nWaterman's acting career has spanned 60 years, starting with his childhood roles in film and theatre, and his adult roles in film, television, and West End theatre. He is notable for the range of roles he played, including drama (Up the Junction),  horror (Scars of Dracula), adventure (Colditz), comedy (Fair Exchange), comedy-drama (Minder), musical (Windy City) and sports (The World Cup: A Captain's Tale), as well as police TV series such as The Sweeney.\nHe has appeared in 29 films, most recently in 2020.", "link_mentions": [{"page": "Chelsea F.C.", "response": ["Up until the 1950s, the club had a long-running association with the music halls; their underachievement often provided material for comedians such as George Robey. It culminated in comedian Norman Long's release of a comic song in 1933, ironically titled \"On the Day That Chelsea Went and Won the Cup\", the lyrics of which describe a series of bizarre and improbable occurrences on the hypothetical day when Chelsea finally won a trophy. In Alfred Hitchcock's 1935 film The 39 Steps, Mr Memory claims that Chelsea last won the Cup in 63 BC, \"in the presence of the Emperor Nero.\" Scenes in a 1980 episode of Minder were filmed during a real match at Stamford Bridge between Chelsea and Preston North End with Terry McCann (played by Dennis Waterman) standing on the terraces."]}, {"page": "February 24", "response": ["*  1948   – Dennis Waterman, English actor "]}, {"page": "My Fair Lady", "response": ["Cameron Mackintosh produced a new production on March 15, 2001, at the Royal National Theatre, which transferred to the Theatre Royal, Drury Lane on July 21. Directed by Trevor Nunn, with choreography by Matthew Bourne, the musical starred Martine McCutcheon as Eliza and Jonathan Pryce as Higgins, with Dennis Waterman as Alfred P. Doolittle. This revival won three Olivier Awards: Outstanding Musical Production, Best Actress in a Musical (Martine McCutcheon) and Best Theatre Choreographer (Matthew Bourne), with Anthony Ward receiving a nomination for Set Design.\"Olivier Winners 2002\"  olivierawards.com, accessed December 5, 2011. In December 2001, Joanna Riding took over the role of Eliza, and in May 2002, Alex Jennings took over as Higgins, both winning Olivier Awards for Best Actor and Best Actress in a Musical respectively in 2003.\"Olivier Winners 2003\"  olivierawards.com, accessed December 5, 2011. In March 2003, Anthony Andrews and Laura Michelle Kelly took over the roles until the show closed on August 30, 2003.\"'My Fair Lady', 2001–2003\" , Albemarle-london.com, accessed December 5, 2011.", "| Dennis Waterman"]}, {"page": "Clapham", "response": ["* Dennis Waterman – actor"]}, {"page": "Putney", "response": ["*Dennis Waterman, actor grew up in Putney and attended Granard School"]}, {"page": "Roehampton", "response": ["* Dennis Waterman, actor"]}, {"page": "The Music Man", "response": ["The first Australian production ran from March 5, 1960, to July 30, 1960, at the Princess Theatre in Melbourne, and at the Tivoli Theatre in Sydney from December 13, 1960, to February 4, 1961.The Music Man, AusStage.edu.au, accessed June 10, 2017 The first UK production opened at Bristol Hippodrome, transferring to London's West End at the Adelphi Theatre on March 16, 1961, starring Van Johnson, Patricia Lambert, C. Denier Warren, Ruth Kettlewell and Dennis Waterman. It ran for 395 performances at the Adelphi.", "| style=\"text-align:center;\" | Dennis Waterman"]}, {"page": "1961 in music", "response": ["* The Music Man London production opened at the Adelphi Theatre on March 16.  Starring Van Johnson, Patricia Lambert, Ruth Kettlewell and Dennis Waterman."]}, {"page": "1988 in film", "response": ["*The First Kangaroos, directed by Frank Cvitanovich, starring Dennis Waterman – (U.K./Australia)"]}, {"page": "1977 in film", "response": ["* Sweeney!, starring John Thaw and Dennis Waterman – (UK)"]}, {"page": "1970 in film", "response": ["*Scars of Dracula, starring Christopher Lee, Dennis Waterman and Jenny Hanley  - (U.K.)"]}, {"page": "1968 in film", "response": ["*Up the Junction, starring Dennis Waterman and Suzy Kendall – (U.K.)"]}, {"page": "Amanda Pays", "response": ["In 1985 she played the part of Nikki South in the television film Minder on the Orient Express, alongside Dennis Waterman and George Cole."]}, {"page": "Forced perspective", "response": ["The same technique is also used in the Dennis Waterman sketch in the British BBC sketch show Little Britain. In the television version, larger than life props are used to make the caricatured Waterman look just three feet tall or less. In The History of the World, Part I, while escaping the French peasants, Mel Brooks' character, Jacques, who is doubling for King Louis, runs down a hall of the palace, which turns into a ramp, showing the smaller forced perspective door at the end. As he backs down into the normal part of the room, he mutters, \"Who designed this place?\""]}, {"page": "Slapping (music)", "response": ["*'I Could Be So Good for You', by Dennis Waterman and the theme tune for the British television series 'Minder' features slap bass."]}, {"page": "Suzi Quatro", "response": ["Other acting roles include a 1982 episode of the British comedy-drama series Minder (called \"Dead Men Do Tell Tales\") as Nancy, the singer girlfriend of Terry (Dennis Waterman)."]}, {"page": "Sonia (singer)", "response": ["In 1993, Sonia made her theatre debut in the musical Slice of Saturday Night, alongside Dennis Waterman. The following year she replaced singer Debbie Gibson as Sandy in a West End revival of Grease, where she stayed for a year. In 1997 she returned to the stage on the musical What A Feeling!, which also included fellow 1980s stars Luke Goss and Sinitta. An accompanying soundtrack album was released."]}, {"page": "Guys and Dolls", "response": ["A concert performance ran at London's Cadogan Hall from 22 to 25 August 2012, featuring Dennis Waterman, Ruthie Henshall, Anna-Jane Casey, and Lance Ellington (Strictly Come Dancing), with musical director Richard Balcombe and the Royal Philharmonic Concert Orchestra and Choir."]}, {"page": "George Cole (actor)", "response": ["Cole died at the age of 90 on 5 August 2015 at the Royal Berkshire Hospital in Reading, Berkshire, after a short illness. His funeral took place at Reading Crematorium on 13 August. The Minder theme song was played and Cole's Minder co-star Dennis Waterman gave a eulogy."]}, {"page": "Minder (TV series)", "response": ["The original show starred Dennis Waterman as Terry McCann, a Fulham FC fan, an honest and likeable bodyguard (minder in London slang) and George Cole as Arthur Daley, a socially ambitious, but highly unscrupulous importer-exporter, wholesaler, used-car salesman and purveyor of anything else from which there was money to be made, whether within the law or not.", "Although initially developed to focus on Terry's character, as the series progressed, the focus shifted to feature Terry and Arthur more evenly, with more screen time allotted to Arthur and his dealings. Barman Dave (whose last name was given on a couple of occasions as Harris) at first made only occasional appearances, but the rapport between Arthur, Terry and Dave also become popular and by the second series he too was given more screen time: In Series 7, the final series to feature Dennis Waterman as Terry and thus the last to feature the original opening credits, the sequence was modified very slightly to include shots of Terry, Arthur and Dave at the Winchester, giving Edwards his own billing (previously he had been credited amongst the guest cast).", "Rula Lenska played a number of roles in the show and was married to Dennis Waterman.", "Minder was devised by writer Leon Griffiths as a vehicle for Dennis Waterman after his success in The Sweeney. George Cole's wheeler-dealer character is almost secondary, with Arthur assigning Terry a new \"minding\" job in each episode. A number of early episodes focus on Terry in such assignments, with Arthur remaining in the background. However, as the comedy potential of Cole's dodgy-dealing character emerged, as well as the successful on-screen pairing of Waterman and Cole (which proved to be one of the series' most popular elements), the emphasis increasingly focused more on Arthur's exploits, and by a few series into the show's life, typical plots revolved more around Arthur's latest shady scams instead of some of the more \"gritty\" plots of Terry's minding jobs.", "The show's opening credit sequence shows the Arthur Daley and Terry McCann characters negotiating over the sale of the white Ford Capri interspersed with still photos of the two main characters, highlighting Terry's credentials as a retired boxer and ex-convict, this presumably symbolising the characters' first meeting and the terms of their partnership. During the Dennis Waterman era, the closing credits consisted of a number of black and white (with blue tint) still photographs of Arthur and Terry together outside famous London landmarks, and a few hinting of (unseen) previous escapades typical of a standard episode plot. In the later Gary Webster series, this changed to Arthur and Ray walking along Southend Pier, which is over a mile long: at the end Arthur realises he has left his lighter at the other end of the pier and they start to walk back to find it.", "The theme tune, \"I Could Be So Good for You\", written in 1979 by Gerard Kenny and Patricia Waterman, was sung by Dennis Waterman. It was released as a single in October 1979, credited to 'Dennis Waterman with the Dennis Waterman Band', but failed to enter the charts. It was then re-released in October 1980, upon which it became more successful, peaking at No.3 in the UK Singles Chart in November. The writing credit of Kenny/Waterman often lead people to mis-credit Dennis as co-writer. Dennis Waterman also sang the theme songs to other programmes he starred in, including On the Up, Stay Lucky, and New Tricks, and this led to a parody in Little Britain where Dennis Waterman played by David Walliams is offered acting work; he always assumes he will also \"write the theme tune, sing the theme tune...\".", "Writer Gerard Kenny has also released his own version of the song, appearing on his 1994 album Time Between the Time. A live version of the song sung in duet between Gerard Kenny and Dennis Waterman was released on 1997's The Best of Gerard Kenny – The Singles album. Also, in 2004, Kenny released yet another album Coming Home which featured a \"chilled\" (and slower) recording of the song as its opening track. Kenny spoke about the composition of the song and how he met Waterman in a 2021 interview.", "The show was a number of times said to have come to its end, only to reappear. For example, in 1984, TV Times reported that series 5 would be the last. In 1985, it again seemed as if that the current series was the last one, and it was off-air (bar repeats) for three years, to reappear in 1988. This series appeared to be the last as Dennis Waterman announced his departure at the end of its run. However, after a two-and-a-half-year break, the show was back again for a further two-and-a-half-year run, which ended with the 10th series in 1994.", "The series inspired a hit single, \"Arthur Daley (E's Alright!)\" by The Firm, which made the UK Top 20 in 1982. George Cole and Dennis Waterman released a Christmas record in 1983 called \"What are We Gonna Get 'Er Indoors?\" which reached No. 21 in the charts. The duo performed it on Top of the Pops on 22 December 1983.", "In 1980, an annual based on the series was released by Grandreams. It was based upon the early concept of the series being based around Terry, and made no reference to Arthur. Two further annuals were released by World International Publishing for 1985 and 1986. These annuals featured both Terry and Arthur, with illustrations of both Dennis Waterman and George Cole.", "* I Could Be So Good For You/Nothing at All (single), Dennis Waterman & The Dennis Waterman Band (1979), EMI5009."]}, {"page": "Flying Squad", "response": ["The Flying Squad's work was dramatised in the 1970s British television series The Sweeney, and two theatrically released feature film spin-offs, Sweeney! and Sweeney 2, starring John Thaw and Dennis Waterman. A further film adaptation, The Sweeney (starring Ray Winstone), was released in 2012.Screendaily.com: The Sweeney"]}, {"page": "Sutton Coldfield", "response": ["*Dennis Waterman – actor, Minder formerly lived in Sutton"]}, {"page": "John Collier (fiction writer)", "response": ["* Special Delivery — Adapted by Michael Ashe and Paul Wheeler as Eve for Journey to the Unknown, September 26, 1968 (Season 1, Episode 10), starring Carol Lynley, Dennis Waterman and Michael Gough.", "* Special Delivery — A man falls in love with a department-store mannequin. This was later adapted for an episode of the 1960s TV series Journey to the Unknown, retitled \"Eve\", which starred Dennis Waterman and Carol Lynley."]}, {"page": "Farnham Common", "response": ["*Dennis Waterman – actor"]}, {"page": "The Sweeney", "response": ["The Sweeney is a 1970s British television police drama focusing on two members of the Flying Squad, a branch of the Metropolitan Police specialising in tackling armed robbery and violent crime in London. It stars John Thaw as Detective Inspector Jack Regan and Dennis Waterman as his partner, Detective Sergeant George Carter. It was produced by the Thames Television subsidiary Euston Films for broadcast on the ITV network in the UK between 1975 and 1978. ", "The part of Jack Regan was specifically written for John Thaw, who was a friend of Ian Kennedy Martin, with whom he had worked on the TV drama series Redcap in the 1960s. Dennis Waterman was cast after his performance in the Special Branch episode \"Stand and Deliver\", also produced by Euston Films. ", "Dennis Waterman plays Detective Sergeant George Hamilton Carter who comes from south London. In the series' timeline, George was in the Flying Squad prior to events in Regan, but quit for family reasons (cf. Regan and 1.5 \"Jigsaw\"). Carter is not as aggressive as Regan and usually plays the \"good cop\" role. He is married to Alison Carter, a schoolteacher, but is widowed when she is murdered in episode 2.5 \"Hit and Run\".  He is a former amateur boxer, as shown in the pilot Regan, and is described as having professional boxing potential in episode 2.1 \"Chalk and Cheese\". Like Regan, he enjoys a drink, and follows football. After the death of his wife Carter is shown dating women in several episodes. ", "::ɫGeorge Cole and Dennis Waterman went on to star in Minder.", "The final series has been criticised as being the weakest.The Anorak Zone, The Sweeney, Season Four November 2014. Retrieved February 22, 2021. The perceived decline in quality led John Thaw and Dennis Waterman to the realisation that the show was in danger of running out of steam, and the decision was taken to end it while it was still extremely popular.", "4.11 \"Hearts and Minds\", was the last episode to be filmed, and features the comedy duo Morecambe and Wise. It was a quid pro quo for John Thaw and Dennis Waterman appearing in a sketch on the 1976 Morecambe and Wise Christmas show on BBC One.", "In 1977 and 1978, publishers Brown Watson (who specialised in annuals based on TV series) published two editions of The Sweeney Annual featuring a mix of comic strips (some with art by Brian Lewis) and illustrated text stories, interspersed with occasional features on the TV series, articles about policing, puzzles and (in the 1978 annual) an interview with John Thaw and Dennis Waterman.", "Commentary with Dennis Waterman, producer Ted Childs and director Tom Clegg.", "Commentaries with Dennis Waterman, Garfield Morgan, producer Ted Childs, writers Trevor Preston and Troy Kennedy-Martin, directors Tom Clegg and David Wickes and editor Chris Burt.", "*\"The Electric Theatre Show\" interviews with John Thaw, Dennis Waterman and Ted Childs.", "*\"This is Your Life – Dennis Waterman\" extract.", "* Dennis Waterman, Reminder. Hutchinson, 2000. ."]}, {"page": "Esher", "response": ["The sitcom On the Up starring Dennis Waterman was set in Esher."]}, {"page": "List of show business families", "response": ["* Actor and singer Dennis Waterman is the father of actress Hannah Waterman by his second wife actress Patricia Maynard. His third wife was actress Rula Lenska."]}, {"page": "Little Britain", "response": ["A special live version, featuring appearances from celebrities such as Russell Brand and Dennis Waterman was filmed in 2006 and appeared on 2007's Comic Relief show.", "The Little Britain cast returned for a second Comic Relief Special, this time live and with special guests: Russell Brand, Kate Moss, Patsy Kensit, Jonathan Ross, Kate Thornton, Chris Moyles, Dennis Waterman, Peter Kay, David Baddiel, Jeremy Edwards, and Dawn French."]}, {"page": "Denis Waterman", "response": ["#REDIRECT Dennis Waterman"]}, {"page": "Michael Moran (music producer)", "response": ["Other songs co-written by Moran are \"Snot Rap\" (recorded by Kenny Everett), as well as \"No Mean City\" (the theme to the crime drama Taggart, sung by Maggie Bell), \"It's Alright\" (the theme to the crime drama New Tricks, sung by Dennis Waterman) and the music for the UK game series Chain Letters, Lucky Ladders and The Krypton Factor. "]}, {"page": "Hank Marvin", "response": ["* 1977: Dennis Waterman Waterman  (also features Brian Bennett)"]}, {"page": "Man in the Wilderness", "response": ["*Dennis Waterman – Lowrie"]}, {"page": "Rula Lenska", "response": ["Lenska was married to the actors Brian Deacon (1977–1987) and Dennis Waterman (1987–1998).", "Lenska has been married twice, first to actor Brian Deacon (4 June 1977 – 1987), with whom she had one daughter, Lara Parker (née Lara Deacon), and secondly, to actor Dennis Waterman, from 3 January 1987 until 31 March 1998. Both marriages ended in divorce. She and Waterman met on the set of Minder in 1981 where their characters had a brief love interest. Her marriage to Waterman ended, and in March 2012 Waterman caused controversy with some comments on that aspect of their relationship: \"It's not difficult for a woman to make a man hit her. She certainly wasn't a beaten wife, she was hit and that’s different.\" Lenska said that she was relieved that he had now admitted beating her."]}, {"page": "The Life and Loves of a She-Devil", "response": ["|Dennis Waterman", "The novel was adapted in 1986 as an award-winning BBC television serial, starring Patricia Hodge as Mary Fisher, Dennis Waterman as Bobbo and Julie T. Wallace as Ruth, with only minor changes from the book."]}, {"page": "Euston Films", "response": ["Initial shows such as Special Branch gained reasonable praise, but it was The Sweeney that first gave the company critical and commercial success. Using a storyline style known as \"kick, bollock and scramble\", this formula continued in such shows as Fox and Widows. In 1979, the company created Minder as a vehicle for Sweeney star Dennis Waterman, giving the company its longest-running show."]}, {"page": "Theatre 625", "response": ["|Peter Blythe,John Sharp,Peter Howell,Tamara Kinchco,Noel Davis,Ann Way,Norman Wynne,Jeremy Ranchev,Roger Shepherd,Robert Dodson,Roger Bradley,Michael Wenning,Christopher Witty,Dane Howell,Dennis Waterman,Hywel Bennett,Norman Bacon"]}, {"page": "Match of the Day", "response": ["*Between 1995 and 1999, the BBC broadcast Match of the Seventies (1995–96), Match of the Eighties (1997) and Match of the Nineties (1999). Each series acted as a chronological review of seasons through each decade, presented in a slightly off-beat style, and relied heavily on footage originally included in Match of the Day broadcasts. Presenters included Dennis Waterman, Danny Baker, Mark Radcliffe, and Marc Riley."]}, {"page": "Hannah Waterman", "response": ["Waterman was born on the 22 July 1975 in London, to actor Dennis Waterman and actress Patricia Maynard. She attended Norwich High School for Girls and Saint Felix School, Southwold and Putney High School. She is also a graduate of the University of Warwick."]}, {"page": "DJM Records", "response": ["Other acts on the label in the 1970s included Hector; Ireland's Celtic rockers Horslips; John Inman, Mr. Bloe, who included pianist  and harmonica player Harry Pitch; former Fleetwood Mac member Danny Kirwan, who recorded three albums for DJM, Second Chapter (1975), Midnight in San Juan (1976), and Hello There Big Boy! (1979); The Tremeloes, after their departure from CBS/Epic in 1974; singer-turned-actor Dennis Waterman; and Johnny \"Guitar\" Watson, who had several successful singles and albums in the US."]}, {"page": "Robin Askwith", "response": ["Shortly after starring in Antony Balch's Horror Hospital (1973), Askwith was offered the starring role in Confessions of a Window Cleaner (1974), directed by Val Guest. The part had been turned down by Richard Beckinsale, Richard O'Sullivan, Nicky Henson and Dennis Waterman. The success of the film led to three sequels, Confessions of a Pop Performer (1975), Confessions of a Driving Instructor (1976) and Confessions from a Holiday Camp (1977)."]}, {"page": "C. E. Webber", "response": ["Other television shows he wrote or created for the BBC included the 1961 action adventure serial Hurricane, the 1962 children's comedy William, starring Dennis Waterman, based on the books by Richmal Crompton, and in 1964 episodes of the Thorndyke detective series."]}, {"page": "Dennis waterman", "response": ["#REDIRECT Dennis Waterman"]}, {"page": "Brian Bennett", "response": ["*Dennis Waterman – Downwind of Angels – LP – DJF 204830 – DJM – 1976", "*Dennis Waterman – Dennis Waterman – LP – DJF 20513 – DJM – 1977"]}, {"page": "List of sports films", "response": ["| Dennis Waterman in a story of an Australian team on a tour of Great Britain."]}, {"page": "Frazer Hines", "response": ["Because of this success, Hines began attending Corona Theatre School in London where his fellow classmates included Richard O'Sullivan, Dennis Waterman, Jeremy Bulloch and Francesca Annis. Making his debut in the film John and Julie (1955) as an extra in a crowd scene, Hines went on to have minor roles in a number of films including  One Good Turn (1955) and The Woman for Joe (1955) before playing speaking parts in Moby Dick, The Weapon and X the Unknown (all 1956). Hines' breakthrough role however was in 1957 where he performed the role of Napoleon in a six-part television adaptation of John Buchan's 1922 novel Huntingtower. That same year, Hines appeared alongside Charlie Chaplin in the film A King in New York. From 1957 and throughout the 1960s, he performed a steady stream of roles in various television series, such as Jan in The Silver Sword (1957–58), Tim Birch in Emergency – Ward 10 (1963–64), and Roger Wain in Coronation Street (1965). He appeared in a 1964 serial, Smuggler's Bay, with Patrick Troughton.  With a well-established career in television, Hines appeared in feature films less frequently, however he did appear in Tunes of Glory (1960) with Alec Guinness, I Could Go On Singing (1963) with Judy Garland and the James Bond film You Only Live Twice (1967)."]}, {"page": "Glynis Barber", "response": ["Her stage work has included Macbeth, Killing Time with Dennis Waterman, High Flyers with Hugh Grant, Make Me a Match and The Graduate. In 2011 Barber starred alongside Christopher Timothy and Denis Lill in Alan Ayckbourn's Seasons Greetings playing Belinda. In 2013 she plays impulsive and rebellious Melissa Gardner in Love Letters at Dundee Repertory Theatre along with Michael Brandon.  Barber played Carole King's mother, Genie Klein, in the West End production of 'Beautiful – The Carole King Musical' from opening at The Aldwych Theatre on 24 February 2015 until 28 November 2015"]}, {"page": "Play of the Month", "response": ["|Vivien Merchant,Peter Jeffrey,Dennis Waterman,Gwen Taylor,Shelagh Fraser,Trevor Baxter,Tony Sibbald"]}, {"page": "Unman, Wittering and Zigo", "response": ["The play was adapted for television as an episode of BBC 2's Theatre 625 series and broadcast in June 1965. It was the BBC's Italia Prize entry that year. It featured a number of young actors who gained a higher profile including Hywel Bennett and Dennis Waterman."]}]}}