{"wiki_id": "http://www.wikidata.org/entity/Q1195378", "itemLabel": "Billy Key", "itemDescription": "British Indian Army major-general (1895-1986)", "wikipedia_url": "https://en.wikipedia.org/wiki/Billy_Key", "wikipedia_page": {"main": "Major-General Berthold Wells Key,  (19 December 1895 – 26 September 1986), known as Billy Key, was a British Indian Army officer.", "link_mentions": [{"page": "Index of Singapore-related articles", "response": ["* Billy Key"]}, {"page": "Missouri Sports Hall of Fame", "response": ["| 1988||Billy Key||Basketball"]}, {"page": "18th Infantry Division (United Kingdom)", "response": ["The delayed brigade counter-attack was ordered for dawn on 21 January, spearheaded by 2LR, but 6RNR and 3/16PR were incapable of attacking so soon and 2LR had only just arrived; the attack was postponed again, but with orders to begin as soon as possible. At 20:00, Lieutenant-General Arthur Percival, GOC Malaya Command, decided that the Japanese capture of the Pelandok defile seriously endangered Westforce's line of communications. He ordered Bennett to continue to withdraw south of Labis to a line from Paloh to the Sungei Gerchang bridge on the road to Labis, and to detach a brigade as soon as possible to dig in at the Yong Peng road junction. As the 27th Australian Brigade covered Yong Peng, Percival put all troops on the Muar–Yong Peng road back under the command of Westforce at 12:30. The counter-attack by the 53rd Brigade never occurred; at 10:30 on 21 January, Major-General Billy Key (GOC 11th Indian Division) visited the brigade and learned that half his orders had not been transmitted, that the brigade had not planned an attack, and that 2LR had been sent to dig in at the east end of the causeway. An attack could be arranged for 14:00, but more confusion occurred, and the start time was moved to 15:30. The Japanese positions gave a view of the ground east of the ridge, making surprise impossible to achieve, and more time was needed to arrange artillery support and concentrate 2LR. The attack was postponed again to 18:00 and then to the morning of 22 January. The artillery took so long to register that there was another postponement to 09:00, but 2LR, who had assembled under cover of night, were spotted by Japanese reconnaissance aircraft and bombed and strafed. With no prospect of surprise, and doubtful that the attack could succeed, Duke cancelled the operation and redeployed the three battalions to guard the causeway and the ground from there to the defile."]}, {"page": "List of presidents of the National Association of Basketball Coaches", "response": ["| 1986–87 ||Billy Key ||Missouri-Rolla"]}, {"page": "Berthold Wells Key", "response": ["#REDIRECT Billy Key"]}]}}