{"wiki_id": "http://www.wikidata.org/entity/Q1192904", "itemLabel": "Trevor Storton", "itemDescription": "Footballer; football manager (1949-2011)", "wikipedia_url": "https://en.wikipedia.org/wiki/Trevor_Storton", "wikipedia_page": {"main": "Trevor Storton (26 November 1949 – 23 March 2011) was an English footballer who played as a central defender.", "link_mentions": [{"page": "Oswestry Town F.C.", "response": ["*Trevor Storton (1985?–1986)"]}, {"page": "Chester City F.C.", "response": ["That season also saw Chester reach the Football League Cup semi-finals. After beating Walsall, Blackpool and Preston North End, Chester hosted Football League champions Leeds United in round four. Two goals from John James and one from Trevor Storton gave Chester a 3–0 win that is regarded as one of the greatest shocks in the competition's history. In the next round a goal from James meant Newcastle United were defeated in a home replay to set up a semi–final tie with Aston Villa. Brian Little's late goal in the second leg at Villa Park sealed a 5–4 win for eventual cup winners Villa.", "* Trevor Storton (caretaker, Nov 1963 – Jan 1984)", "| Trevor Storton"]}, {"page": "Paddy Kenny", "response": ["He had trials at Birmingham City and Bradford City, before he was signed by Neil Warnock at Bury in September 1998 for a £10,000 fee following a recommendation from Avenue's manager Trevor Storton. With Dean Kiely in goal for the \"Shakers\", Kenny was loaned out to Whitby Town in the Northern Premier League to gain some first team experience in March 1999. He played a total of eight games for the \"Seasiders\". Two months later Kiely was sold to Charlton Athletic, giving Kenny the chance to become Bury's regular goalkeeper."]}, {"page": "Cliff Sear", "response": ["In 1968, Sear joined Chester, initially as a player. He scored on his debut against York City in August 1968, doubling his tally of Football League goals in his 14-year career.  However, the vast majority of his 19-year service to the club would be in coaching capacities. Between March 1982 and November 1982 he was manager of the club (initially as caretaker), but he did not enjoy this role and happily returned to working with the youth team and helping his successors in the manager's chair. He did though have another tenure as caretaker manager the helm in January 1984, after previous caretaker manager Trevor Storton stepped down as the club awaited the appointment of John McGrath."]}]}}