{"wiki_id": "http://www.wikidata.org/entity/Q11978482", "itemLabel": "Jeremy Young", "itemDescription": "British television actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Jeremy_Young", "wikipedia_page": {"main": "John H. Young (born 1934, Liverpool), known professionally as Jeremy Young, is an English actor of Scottish descent.Young has numerous television credits, including Deadline Midnight (1960), Doctor Who (appearing as caveman Kal in three episodes of the first serial An Unearthly Child in 1963, as well as playing Gordon Lowery in the one episode serial Mission to the Unknown in 1965) and Coronation Street as nightclub owner Benny Lewis in 1972. His film credits include appearances in The Wild and the Willing (1962), Crooks and Coronets (1969), Eyewitness (1970), Hopscotch (1980) and Photographing Fairies (1997).He has worked for BBC Radio and teaches and directs at the Court Theatre Training Company which is part of the Courtyard, London.Young was married to actress Coral Atkins in 1960, and later to Kate O'Mara from 1971 to 1976.", "link_mentions": [{"page": "The Three Musketeers", "response": ["*The Three Musketeers, a 1966 BBC adaptation in ten 25-minute episodes, directed by Peter Hammond and starring Jeremy Brett, Jeremy Young and Brian Blessed"]}, {"page": "Kate O'Mara", "response": ["O'Mara was married twice, first to Jeremy Young in 1971; the couple divorced in 1976. In 1993, she married Richard Willis, but the marriage was dissolved in 1996. She had two sons, Dickon Young (1964–2012) and Christopher Linde (born 1965), both from previous relationships, although Dickon took his stepfather's surname. She gave up Linde for adoption and he was named by his adoptive parents, Derek and Joy Linde."]}, {"page": "Athos (character)", "response": ["*Jeremy Young, in The Further Adventures of the Three Musketeers (1967)"]}, {"page": "An Unearthly Child", "response": ["Za (Derek Newark), the leader of a primitive Paleolithic tribe, attempts to make fire. A young woman called Hur (Alethea Charlton) warns him that if he fails to do so, the stranger called Kal (Jeremy Young) will be made leader. After exiting the TARDIS, the unnamed old man, whom Ian and Barbara refer to as the Doctor, is kidnapped by Kal, when he witnesses him light a match. Kal takes the Doctor back to the tribe and threatens to kill him if he does not make fire; Ian, Barbara and Susan intervene, but the group is imprisoned in a large cave. With the help of Old Mother (Eileen Way), who believes that fire will bring death to the tribe, they escape from the settlement but are intercepted and recaptured before reaching the TARDIS. Kal says they will be sacrificed if they do not make fire. While Ian tries to start a fire, Kal enters the cave and attacks Za, but is killed. Ian gives a burning torch to Za, who shows it to the tribe and is declared leader. Susan notices that placing a skull over a burning torch makes it appear alive; when the tribe enters the cave, they are faced with several burning skulls, and are terrified, allowing the group to flee to the TARDIS and escape through time and space to a silent and unknown forest. Unnoticed by the crew, the radiation meter rises to \"Danger\"."]}, {"page": "Randall and Hopkirk (Deceased)", "response": ["*Jeremy Young"]}, {"page": "Doomwatch", "response": ["Cast: John Paul as Dr Spencer Quist, Simon Oates as Dr John Ridge, Robert Powell as Tobias Wren, Joby Blanshard as Colin Bradley, Emrys Jones as Colonel Smithson, Jeremy Young as Vincent Llewellyn, Ray Mort as Jones, Edward Evans as Dai, Michael Newport as Bryn, David Davies as Davies, Eliza Ward as Elizabeth Llewellyn, Mary Hignett as Mrs. Adams, Jay Neill as Laing."]}, {"page": "The Wednesday Play", "response": ["| Fabia DrakeRaymond HuntleySarah LawsonWallas EatonSally BazeleyRoddy Maude-RoxbyBarbara CouperClive MortonHenry McGeeJeremy Young", "| Alan BatesMary MillerTerence De MarneyJeremy YoungDonald SumpterBrigit ForsythMichael Mulcaster"]}, {"page": "Mission to the Unknown", "response": ["Barry Jackson had previously appeared as Ascaris in The Romans and would appear as Drax in The Armageddon Factor (1979). Jeremy Young had previously played Kal in An Unearthly Child (1963). Edward de Souza would later play Mortimer Davey in the audio play The Roof of the World."]}, {"page": "A Touch of Brimstone", "response": ["*Jeremy Young as Willy Frant / Lord Castigan"]}, {"page": "The Three Musketeers in film", "response": ["*The Three Musketeers, a 1966 BBC adaptation in ten 25-minute episodes, directed by Peter Hammond and starring Jeremy Brett, Jeremy Young, and Brian Blessed"]}, {"page": "Rita Sullivan", "response": ["Rita turns up at The Rovers to see Len and tells him about Alec's offer. Rita auditions for Alec. Rita cooks for the lads at No.9. Ray and Jerry don't like her. Jerry doesn't like the idea of having Rita around. Rita gets a regular spot from Alec. Jerry tells Ray he thinks Rita is a gold-digger. Rather than be taken out for the night by Len, she makes a meat and potato pie for the lads and wins Jerry over. Len takes her home and next morning Ray and Jerry discover he hasn't come back but has spent the night with her. Len brings Rita to the opening of a new betting shop. Benny Lewis (Jeremy Young), the owner, talks Rita into an afternoon job as a hostess. Len thinks he's got designs on her. Rita refuses to clean for Benny. Benny asks Rita to join the staff permanently. Rita isn't sure and asks Len who tells her it's her decision. Rita still can't decide whether to take the job with Benny. Len books a meal out for the two of them. Benny also asks Rita to come round to his flat that night but she turns him down. Len tells Rita he can't take her out after all. Benny entertains Rita in his new luxury flat above the betting shop though few of the remote control things work properly. Hilda Ogden (Jean Alexander) finds them there together. Rita tells Benny she will work for him. Hilda gleefully gossips to Len that Rita is with Benny. Rita stands Benny up to go out with Len. Rita skives off work to be with Benny. Rita passes on an invite to Len for drinks at Benny's flat."]}, {"page": "The New Avengers (TV series)", "response": ["| Julian Holloway, Peter Cellier, Jeremy Young, Patrick Malahide, W. Morgan Sheppard, Keith Marsh, Keith Alexander"]}, {"page": "Coral Atkins", "response": ["Atkins was married to British actor Jeremy Young. After divorcing him, she had a six-year relationship with film director Peter Whitehead, with whom she had a son, Harry Whitehead. Atkins died in West Berkshire Community Hospital, Thatcham, West Berkshire on 2 December 2016, from cancer."]}, {"page": "R3 (TV series)", "response": ["R3 was a 50-minute British television drama series produced by the BBC between 1964 and 1965. Its full title was Ministry of Research Centre No. 3. The series starred John Robinson as Sir Michael Gerrard, Jeremy Young as Wilson, David Blake Kelly as Captain Rogers, and was set in a scientific research facility at the Ministry of Research. R3 is also notable for providing early TV exposure for a young Oliver Reed, cast as one of the scientists on the ministry staff, Dr. Richard Franklin."]}, {"page": "List of The Professionals episodes", "response": ["| David Swift, Jeremy Young, Stuart Wilson, Lynda Bellingham, Victoria Burgoyne, Timothy Carlton, Chris Sullivan"]}, {"page": "You Can Always Find a Fall Guy", "response": ["*Jeremy Young ...  Douglas Kershaw"]}, {"page": "List of The Avengers and The New Avengers cast members", "response": ["* Jeremy Young"]}, {"page": "Gary Watson", "response": ["He became known for his appearances in British ITC productions of the 1960s, including The Avengers, The Saint and Randall and Hopkirk (Deceased) in 1969 in the last episode \"The Smile Behind the Veil\". In 1966 he appeared as Aramis in all ten episodes of The Three Musketeers, starring alongside Brian Blessed and Jeremy Young. He also appeared in the 1967 Doctor Who serial \"The Evil of the Daleks\". He played Denisov in the 1972 television series War and Peace. and the semi-regular character of Detective Inspector Fred Connor in the long-running BBC police drama Z-Cars between 1972 and 1974. In 1974 he played George Vavasor in five episodes of The Pallisers. In 1977 he played the role of Ross in the BBC series Murder Most English. He also appeared in the 1970 Thames Television adaptation of , playing MacDuff. He was also much employed as a reader and narrator, featuring in dozens of commercials throughout the 1970s and 1980s. He was particularly noted for his work for British Transport Films and commercials for Lloyds Bank and Nescafé."]}, {"page": "Young (surname)", "response": ["*Jeremy Young (born 1934), British actor"]}, {"page": "Dickens Hill", "response": ["As well as the inmates, prison officers also become regulars for the duration of the storyline, such as officers Crane (Raymond Trickett), McLeish (Neil Daglish) and Stone (Jeremy Young). Outside the prison, members of the Firm were also heavily involved in Den's exit storyline, including Joanne Francis (Pamela Salem), the manager of Strokes; Gregory Mantel (Pavel Douglas); and Brad Williams (Jonathan Stratt), who had appeared intermittently since 1986, but is seen on a regular basis during this storyline. Investigating police officers included DS West (Leonard Gregory) and D.I.Bob Ashley (Robin Lermittee), who join Walford CID determined to close down the firm. Occasionally, regular characters from the Albert Square are seen to visit Den in prison, this includes Den's daughter Sharon (Letitia Dean), his friends Pete Beale, Pat Wicks (Pam St. Clement) and Joanne Francis, and even one of his worst enemies - Pauline Fowler (Wendy Richard).\"Xmas 88 - Den in prison\", BBC. URL last accessed on 2006-09-26."]}, {"page": "2007 PapaJohns.com Bowl", "response": ["Cincinnati quarterback Ben Mauk passed for four touchdowns and 334 yards. Southern Miss quarterback Jeremy Young went 18-for-32 for 122 yards with two touchdowns and three interceptions. After being down 31-14 in the fourth, quarter Jeremy Young cut the lead by scoring a 5-yard touchdown pass to Chris Johnson, but Southern Miss' rally fell short after they couldn't recover an onside kick or convert a fourth-and-1 play on its next possession. Only 35,258 people attended the game, less than half of Legion Field's capacity. Cincinnati distributed 8,352 tickets, a school record for bowl attendance, while Southern Mississippi distributed around 5,000 tickets. Cincinnati's win brought their record to 10-3, their first 10-win season since 1951. With the loss Southern Miss' record ended at 7-5.Papajohns.com Bowl Game Notes :: Cincinnati 31, Southern Miss. 21"]}, {"page": "Ghost Squad (TV series)", "response": ["* 20.  Lost in Transit: A murderous band of fanatics under Van Tempel (Anthony Jacobs) want to take over the world. GS has a man inside their organisation but they spot him. Tony Miller has to stop them letting a large bomb off at the Opera. Also features John Woodvine, André Maranne, Jeremy Young, Arnold Diamond, Walter Randall, John Scott Martin, Anthony Jacobs, Brian Vaughan and Wilfred Carter."]}, {"page": "Crooks and Coronets", "response": ["* Jeremy Young as Reilly "]}, {"page": "The Wild and the Willing", "response": ["* Jeremy Young as Policeman"]}, {"page": "List of Minder episodes", "response": ["|colspan=\"3\"|Guest stars: Liza Goddard as Jocelyn Maxwell-Saunders, Jane Carr as Rita, Jim Norton as O'Brady, Jeremy Young as Everett."]}, {"page": "The Bringers of Wonder, Part One", "response": ["* Jeremy Young — Jack Bartlett"]}, {"page": "The Bringers of Wonder, Part Two", "response": ["* Jeremy Young — Jack Bartlett"]}, {"page": "Up Pompeii! (series 1)", "response": ["| Jeremy Young"]}, {"page": "Scarlet and Black (TV series)", "response": ["* Jeremy Young - Duke of Wellington"]}, {"page": "The Forget-Me-Knot", "response": ["*Jeremy Young as George Burton"]}]}}