{"wiki_id": "http://www.wikidata.org/entity/Q11935286", "itemLabel": "Marcus Coates", "itemDescription": "British artist", "wikipedia_url": "https://en.wikipedia.org/wiki/Marcus_Coates", "wikipedia_page": {"main": "Marcus Coates is a contemporary artist and ornithologist living in London. His works, including performances and installations that have been recorded as video art, employ shamanistic rituals in communication with \"the lower world\", and contrast natural and man-made processes.", "link_mentions": [{"page": "National Trust", "response": ["From the 1980s to 2001 the Trust commissioned artists to create works depicting National Trust places with their \"Foundation for Art\", and in 2009 launched its contemporary art programme entitled \"Trust New Art\" in a joint venture with Arts Council England and Arts Council of Wales. As part of this programme the Trust has worked with over 200 artists to create new artworks inspired by their places including: Jeremy Deller, Anya Gallaccio, Antony Gormley, Sir Richard Long, Serena Korda, Marcus Coates and Katie Paterson.Trust New Art guidebook (2019)"]}, {"page": "Elephant and Castle", "response": ["* Some of contemporary artist and ornithologist Marcus Coates' work has focused on housing in Elephant and Castle, including a film (Vision Quest – a Ritual for Elephant & Castle) and an on-stage trance in 2009. "]}, {"page": "Daiwa Anglo-Japanese Foundation", "response": ["The Daiwa Foundation Art Prize was a triennial prize open to British artists resident in the United Kingdom who had not previously had a solo exhibition in Japan. In addition to an exhibition in Japan, the winning artist was given a period of support and introductions to key individuals and organisations in the Japanese contemporary art world.  The winning artist was also awarded a participation fee of £5,000. Recent winners are Marcus Coates (2009), Haroon Mirza (2012), Oliver Beer (2015), and Kate Groobey (2018). The Daiwa Foundation Art Prize was discontinued after the last winner in 2018."]}, {"page": "Kate MacGarry", "response": ["The gallery represents several international artists including Matt Bryans, Marcus Coates, Iain Forsyth and Jane Pollard, Samson Kambalu,  Dr Lakra, 2008 John Moores 25 Contemporary Painting Prize winner Peter McDonald, Goshka Macuga, Ben Rivers Francis Upritchard, and 2019 Turner prize nominee Helen Cammock. Kambalu and Upritchard were named among the 50 most exciting artists in Europe in 2016. The gallery's booth, which showcased Goshka Macuga's Preparatory Notes for a Chicago Comedy was named one of the top ten at Frieze Art Fair 2014. "]}, {"page": "Berwick Film & Media Arts Festival", "response": ["The festival was established in 2005 by its current Chairman Professor Huw Davieshttp://www.derby.ac.uk/staff/huw-davies/ and artist Marcus Coates. Peter Taylor has been Festival Director since January 2015. As an Arts Council England National Portfolio organisation, BFMAF receives regular funding from Arts Council England."]}, {"page": "Berwick Gymnasium Arts Fellowship", "response": ["2002 Annie Cattrell, Marcus Coates, Geraint Evans"]}, {"page": "Leo Fitzmaurice", "response": ["After leaving college Fitzmaurice moved away from pure painting and his practice eventually focussed on a strategy of intervening in already existing objects, materials and situations, a way of working which continues to this day. Some of his earlier work was shown at EASTinternational in 1995 where one of his pieces was purchased for the Arts Council Collection. Also after graduating Fitzmaurice developed an interest in working in non-gallery situations by co-organising a number of 'artist-led' projects such as All in the Mind (1998), with artist Patricia McKinnon Day, which took place inside a disused mental asylum; and Up In The Air/Further Up In The Air (1999–2004) with artist Neville Gabie, which used tower blocks as contexts for art and writing. In these projects Fitzmaurice worked with the artists and writers George Shaw, Julian Stallabrass, Elizabeth Wright, Lothar Gotz, Will Self, Anna Fox, Marcus Coates and Bill Drummond amongst others.Further Up in the Air. Fitzmaurice, Leo; Gabie, Neville. (Eds). Furtherafield "]}, {"page": "Manchester Science Festival", "response": ["Exhibitions are a feature of the festival programme, including contemporary science exhibitions at the Museum of Science and Industry. Since 2014, Cape Farewell, UK have partnered with the festival to commission an exhibition inspired by James Lovelock’s Gaia Theory. Notable exhibitions include Marcus Coates’ The Sounds of Others and Tania Kovats’ Evaporation.", "The eighth Manchester Science Festival showcased Marcus Coates’ exhibition The Sounds of Others, a 3D printing exhibition, a debate over the future of fracking with Bez from Happy Mondays, and the building of a Mega Menger. The website Creative Tourist wrote about Manchester Science Festival’s programme, saying that, “The delight in such a diversity of diversions is being able to wander according to one’s own fancy; being cartographer to your own map. The book of Manchester is open: choose your own adventure”."]}, {"page": "Compton Verney Art Gallery", "response": ["*Marcus Coates: CB3CV ChiffChaff - Coates is particularly interested in the relationship between animals and humans. GB3CV ChiffChaff was an attempt to search for parallels between the communication systems of wild birds and amateur radio enthusiasts"]}]}}