{"wiki_id": "http://www.wikidata.org/entity/Q11962354", "itemLabel": "Bronco Lane", "itemDescription": "British Army officer", "wikipedia_url": "https://en.wikipedia.org/wiki/Bronco_Lane", "wikipedia_page": {"main": "Major Michael Patrick 'Bronco' Lane, MM, BEM (born 1945) is a former British Army officer and author, known for his climbing expeditions which led to his summiting Mount Everest in 1976.\n\n", "link_mentions": [{"page": "Timeline of Mount Everest expeditions", "response": ["*  British and Nepalese Army Expedition to Everest - 16 May an expedition by the British Army and Royal Nepalese Army which was under the command of Tony Streather - the summiteers were Special Air Service soldiers Bronco Lane and Brummie Stokes who ascended up  the South West face."]}, {"page": "Bronco (disambiguation)", "response": ["*Bronco Lane (born 1945), former British Army major, author and mountain climber"]}, {"page": "Brono Lane", "response": ["#REDIRECT Bronco Lane"]}, {"page": "Tony Streather", "response": ["Streather led the 1976 British and Nepalese Army Expedition to Everest, which successfully put two British Army climbers on the summit: Bronco Lane and Brummie Stokes."]}, {"page": "Scaife Glacier", "response": ["The Scaife Glacier is named after Sergeant Kenneth Scaife (born 1939) who died in an accident in the area on 9 August 1972, while on the final stage of a British Army Expedition.Bronco Lane, Military Mountaineering: A History of Services Mountaineering, 1945–2000."]}, {"page": "Michael Patrick Lane", "response": ["#REDIRECT Bronco Lane"]}, {"page": "List of 20th-century summiters of Mount Everest", "response": ["*Brummie Stokes and Bronco Lane on May 16, 1976Joint British Army & Royal Nepalese Army Everest Expedition  (1976 British Army expedition)"]}, {"page": "1975 British Mount Everest Southwest Face expedition", "response": ["Everest was summited again by the British the following year in the joint British and Nepalese Army Expedition by a similar route. The expedition was under the command of Tony Streather, and the summiteers were Special Air Service soldiers Bronco Lane and Brummie Stokes."]}, {"page": "Army Mountaineering Association", "response": ["* Major Bronco Lane MM, BEM (Special Air Service) – Ascent of Everest, 16 May 1976http://www.everest1953.co.uk/michael-bronco-lane|accessed 16 May 2016", "* John Stokes (mountaineer) (Brummy Stokes), , BEM (Special Air Service) – Ascent of Everest, 16 May 1976 with Bronco Lane"]}, {"page": "Michael Lane", "response": ["*Bronco Lane (Michael Patrick Lane, born 1945), former British Army officer, mountaineer, and author"]}, {"page": "1976 British and Nepalese Army Expedition to Everest", "response": ["The 1976 British and Nepalese Army Expedition to Everest resulted in the successful summit of Mount Everest via its South Face on 16 May. This was the second time this had been achieved - less than a year previously, the 1975 British Mount Everest Southwest Face expedition being the first up the same route.Joint British Army & Royal Nepalese Army Everest Expedition  The expedition by the British Army and Royal Nepalese Army was under the command of Tony Streather, and the summiteers were Special Air Service soldiers Bronco Lane and Brummie Stokes.", "Two SAS men Brummie Stokes and Bronco Lane took part in the 1975 expedition to the neighbouring peak of Nuptse, which is 25,850 feet high to Everest’s 29,030 feet. Four men had died on that particular trip, but Stokes and Lane were undeterred about climbing Everest itself. The following year both were given leave from the SAS to attempt an Army ascent of Everest. The expedition was to be a joint British-Nepalese Army operation under the command of Streather.", "As their oxygen supplies began to run perilously low, they huddled down to make an improvised camp for the night. The mercury dropped to around minus 20 degrees Celsius, made colder by the wind chill. They scraped a hole in the snow near the South Summit for the night and they had to hit each other to keep themselves awake and in so doing kept themselves alive next morning.EverestHistory.com: Michael Bronco Lane Stokes tried and failed to attach an oxygen bottle to his face-mask. Lane had to remove his glove to attach the bottle but after an hour his hand was frozen. After the night in the open both men's feet were badly frostbitten."]}]}}