{"wiki_id": "http://www.wikidata.org/entity/Q11989258", "itemLabel": "Michael Ferguson", "itemDescription": "British script writer, television director and television producer", "wikipedia_url": "https://en.wikipedia.org/wiki/Michael_Ferguson_(director)", "wikipedia_page": {"main": "Michael Ferguson (14 June 1937 – 4 October 2021) was a British television director and producer. His early career included directing four serials of the BBC's science fiction series Doctor Who (1966–1971). He later directed ITV's police drama series The Bill and was promoted to become its producer (1988–1989), and as executive producer of the BBC soap opera EastEnders (1989–1991) he was responsible for the introduction of two of its most popular and long-running characters, Phil and Grant Mitchell. He then produced the BBC medical drama series Casualty (1993–1994).", "link_mentions": [{"page": "EastEnders", "response": ["By the end of 1989 EastEnders had acquired a new executive producer, Michael Ferguson, who had previously been a successful producer on ITV's The Bill. Brake suggested that Ferguson was responsible for bringing in a new sense of vitality and creating a programme that was more in touch with the real world than it had been over the previous year."]}, {"page": "Peggy Mitchell", "response": ["Peggy was introduced as a guest character in April 1991, by executive producer Michael Ferguson. The character was brought in as the mother of the already established Mitchell clan: Phil (Steve McFadden), Grant (Ross Kemp) and Sam (Danniella Westbrook). Specifically, she played a key role in a storyline about the elopement of her daughter Sam with Ricky Butcher (Sid Owen). Peggy was played by actress Jo Warne for a period of three months, but was written out upon the completion of the storyline. Two other actresses had been cast in the part before Warne: the first quit before she could film any scenes, and the second, Frances Cuka (who had appeared in the EastEnders prequel CivvyStreet), filmed eight episodes, though all of her scenes were scrapped before broadcast."]}, {"page": "List of film and television directors", "response": ["*Michael Ferguson"]}, {"page": "The Seeds of Death", "response": ["The Seeds of Death is the fifth serial of the sixth season of the British science fiction television series Doctor Who. Written by Brian Hayles and an uncredited Terrance Dicks and directed by Michael Ferguson, it originally aired in six weekly parts on BBC1 from 25 January to 1 March 1969. It sees the return of the Ice Warriors, previously introduced by Hayles in the 1967 serial The Ice Warriors."]}, {"page": "Sharon Watts", "response": ["The arrival of the Mitchell brothers in 1990 heralded a new era for EastEnders, but also for Sharon. Brothers Phil (Steve McFadden) and Grant Mitchell (Ross Kemp) were introduced by executive producer Michael Ferguson, as he wanted to bring in a couple of young men who would bring an air of danger to the show.Brake 1995, p. 91. Both the Mitchell brothers would prove to be extremely important for Sharon in the following years, most notably when she married one brother, then had an affair with the other."]}, {"page": "Michael Ferguson", "response": ["Michael Ferguson may refer to:", "*Michael Ferguson (Irish politician) (1953–2006), Irish Sinn Féin politician who represented Belfast West", "*Michael Ferguson (Australian politician) (born 1974), Australian politician", "*Michael Ferguson (director) (1937–2021), British television director who worked on the BBC science fiction television series Doctor Who", "*Michael Ferguson, Canadian policeman convicted for the manslaughter of Darren Varley ", "*Michael Ferguson (Auditor General) (1958–2019), Auditor General of Canada", "*Michael Ferguson (Connecticut politician), member of the Connecticut House of Representatives", "*Michael Ferguson (biochemist) (born 1957), British biochemist, University of Dundee"]}, {"page": "Pauline Fowler", "response": ["In 1989, the character was used to highlight another important gynaecological health issue, fibroids.Brake, Colin, p. 74 The storyline sees Pauline ignoring health problems, such as chronic fatigue, and using homoeopathic preparations rather than seeking medical assistance. Her fibroids are discovered by chance, when the character Ricky Butcher (Sid Owen) knocks her down in his Austin Mini. In the 1989 Boxing Day episode, Pauline spends time in hospital, recovering from a necessary hysterectomy. Wendy Richard has since revealed that the storyline had originally been scripted differently. Before the outcome of Pauline's illness was screened, producers had decided that the character was to be killed off with cancer. This was a decision that had been made by the show's boss, Mike Gibbon, to refresh the format by replacing some of the serial's older characters. The scriptwriters went as far as giving Pauline a mystery illness. The newly appointed executive producer, Michael Ferguson, decided to scrap the original storyline, believing that Pauline, as one of the soap's original characters, was too valuable an asset to lose. The storyline was rewritten and the character was given a different gynaecological ailment that was treatable.Wiggins, Lizzie, p. 149"]}, {"page": "Michael Wisher", "response": ["Wisher is remembered for many different roles in the British science fiction television series Doctor Who. His contributions began with uncredited voice work in the Second Doctor serial The Seeds of Death (1969). The director of that story, Michael Ferguson, later asked Wisher to play reporter John Wakefield in the Third Doctor serial The Ambassadors of Death (1970). In the following season he appeared as Rex Farrel in Terror of the Autons (1971). During the later years of the Third Doctor era, Wisher acted as the villainous Commissioner Kalik in Carnival of Monsters (1973) and provided Dalek voices in Frontier in Space (1973), Planet of the Daleks (1973) and Death to the Daleks (1974)."]}, {"page": "The Ambassadors of Death", "response": ["The Ambassadors of Death is the third serial of the seventh season of the British science fiction television series Doctor Who, which was first broadcast in seven weekly parts on BBC1 from 21 March to 2 May 1970. Written by Trevor Ray, Terrance Dicks and Malcolm Hulke (though solely credited to David Whitaker), the serial was directed by Michael Ferguson.", "In 2009, a commentary for the future DVD release was recorded, including Caroline John, Nicholas Courtney, Michael Ferguson, Peter Halliday, Derek Ware and Terrance Dicks. The January 2011 edition of Wired UK magazine, published in December 2010 carried a full-page article on the recolourisation of the story. It was stated in the article that the Restoration Team expected to deliver a fully restored colour version of the story to the BBC \"within weeks\".Burton, Charlie (2010). 'Time Travel TV' WIRED UK, January 2011, p74. In issue 430 of Doctor Who Magazine the DVD was announced but later set back due to restoration difficulties. The release was delayed until 2012 when Doctor Who Magazine issue 449 confirmed that the full-colour version would soon be out on DVD.Doctor Who Magazine, Panini UK Limited issue 449 published 28 June 2012, p9 It was later announced that the story would be released on DVD on 1 October 2012. Among the special features on the DVD is a documentary entitled Mars Probe 7: Making The Ambassadors of Death. Although David Whitaker is the sole credited writer on the actual episodes, the DVD sleeve credits The Ambassadors of Death as being written by David Whitaker, Malcolm Hulke and Trevor Ray."]}, {"page": "Sam Mitchell (EastEnders)", "response": ["The character Sam Mitchell was introduced in July 1990 by EastEnders' executive producer Michael Ferguson as the young sister of the Mitchell brothers, Phil (Steve McFadden) and Grant (Ross Kemp). Sam was one of several characters introduced by the producer in the summer of 1990. Others included Eddie Royle (Michael Melia), and three generations of the Tavernier family."]}, {"page": "Phil Mitchell", "response": ["Phil Mitchell is a fictional character from the BBC soap opera EastEnders, played by Steve McFadden. He was introduced to the soap opera on 20 February 1990 and was followed by his brother Grant (Ross Kemp), sister Sam (Danniella Westbrook/Kim Medcalf) and mother Peggy (Jo Warne/Barbara Windsor). Phil was one of the major characters introduced by executive producer Michael Ferguson, who wanted to bring in some macho male leads. Phil and his brother Grant became popularly known as the Mitchell brothers in the British media, with Phil initially portrayed as the more level-headed of the two thugs. Storylines featuring the Mitchell family dominated the soap opera throughout the 1990s, with Phil serving as one of the show's central characters and protagonist villains since the 1990s. McFadden temporarily left the series in late 2003, then returned in April 2005 for a brief appearance before making a permanent return in October 2005.", "In late 1989 EastEnders acquired a new executive producer, Michael Ferguson, who took over from Mike Gibbon. Ferguson had previously been a producer on ITV's The Bill which seemed to be challenging EastEnders in providing a realistic vision of modern life in London. Due to his success on The Bill, Peter Cregeen, the Head of Series at the BBC, poached Ferguson to become executive producer of EastEnders."]}, {"page": "Grant Mitchell (EastEnders)", "response": ["Grant Mitchell is a fictional character from the British soap opera EastEnders, played by Ross Kemp. He was introduced by producer Michael Ferguson to revamp the show, and originally served as one of the show's leading protagonists throughout the 1990s; with the character first appearing in 22 February 1990 and then departing on 25 October 1999 after Kemp had opted to leave the show. He then returned to the show on 24 October 2005 for a few weeks and returned again between March and June 2006. Kemp was persuaded to return to the role for brief stints during a period of heavy media criticism aimed at EastEnders. The return proved to be a ratings success. Kemp reprised the role of Grant for various guest stints in 2016, appearing in twelve episodes between 13 May and 9 September.", "In the latter part of 1989 EastEnders executive producer Michael Ferguson, had taken over from Mike Gibbon. Ferguson had previously been a producer on ITV's The Bill — a hard-hitting and successful police drama, which seemed to be challenging EastEnders in providing a realistic vision of modern life in London. Due to his success on The Bill, Peter Cregeen, the Head of Series at the BBC, poached Ferguson to become executive producer of EastEnders."]}, {"page": "Pat Coombs", "response": ["In 1989, she appeared in the BBC soap opera EastEnders. For a year she played Marge Green, Brown Owl of the Walford Brownies' pack, where she worked closely with EastEnders regulars June Brown, Edna Doré and Gretchen Franklin. Coombs's character was introduced as part of a deliberate attempt to bring humour into the programme, which had come under attack for being too depressing. The character subsequently became one of many to be axed in 1990 following the appointment of new executive producer Michael Ferguson. Coombs was said to be extremely upset that the character of Marge only lasted for one year, but the producers felt there was no place in the programme's new plan for a character \"whose prime function was to be comic relief\"."]}, {"page": "Hattie Tavernier", "response": ["Hattie Tavernier is a fictional character from the BBC soap opera EastEnders, played by Michelle Gayle between 5 July 1990 and 21 December 1993. Hattie and her family were introduced in July 1990 by producer Michael Ferguson. The Taverniers were the first collective black family to join the soap at the same time. Portrayed as an intelligent, independent young woman, Hattie remained in the serial after the departures of many of her screen family, covering issues such as miscarriage and sexual harassment.", "In the latter part of 1989 EastEnders acquired a new executive producer named Michael Ferguson, who took over from Mike Gibbon. Ferguson had previously been a producer on ITV's The Bill — a hard-hitting, gritty and successful police drama, which seemed to be challenging EastEnders in providing a realistic vision of modern life in London. Due to his success on The Bill, Peter Cregeen, the Head of Series at the BBC, poached Ferguson to become executive producer of EastEnders."]}, {"page": "Diane Butcher", "response": ["When the storyline had originally been scripted in 1989, it was left open-ended, meaning that none of the writers or producers of EastEnders had decided whether Diane would ever be found. However, towards the end of 1989, EastEnders acquired a new executive producer, Michael Ferguson, and according to scriptwriter Colin Brake, one of his first decisions was that \"Diane must be found\". The subsequent story of her returning home and adjusting to life back in Walford was developed."]}, {"page": "Airline (1982 TV series)", "response": ["|1||\"Look After Number One\"||3 January 1982, 9 p.m.||Michael Ferguson||Wilfred Greatorex", "|2||\"Brave New World\"||10 January 1982, 9.15 p.m.||Michael Ferguson||Wilfred Greatorex", "|3||\"Conscience\"||17 January 1982, 9 p.m.||Michael Ferguson||Wilfred Greatorex", "|6||\"Captain Clarke Plus One\"||7 February 1982, 9 p.m.||Michael Ferguson||Ray Jenkins", "|9||\"Too Many Promises\"||28 February 1982, 9 p.m.||Michael Ferguson||Michael Russell"]}, {"page": "Jules Tavernier (EastEnders)", "response": ["In the latter part of 1989 EastEnders acquired a new executive producer named Michael Ferguson, who took over from Mike Gibbon. Ferguson had previously been a producer on ITV's The Bill – a hard-hitting, gritty and successful police drama, which seemed to be challenging EastEnders in providing a realistic vision of modern life in London. Due to his success on The Bill, Peter Cregeen, the Head of Series at the BBC, poached Ferguson to become executive producer of EastEnders."]}, {"page": "Clyde Tavernier", "response": ["In the latter part of 1989, Michael Ferguson became the new executive producer of EastEnders, taking over from Mike Gibbon. Ferguson had previously been a producer on ITV's The Bill – a hard-hitting, gritty and successful police drama, which seemed to be challenging EastEnders in providing a realistic vision of modern life in London. Due to his success on The Bill, Peter Cregeen, the Head of Series at the BBC, poached Ferguson to become the executive producer of EastEnders."]}, {"page": "Marge Green", "response": ["Marge Green (credited as Brown Owl in her first appearance)  is a fictional character from the BBC soap opera EastEnders, played by Pat Coombs.\"Pat Coombs\", The Guardian. URL last accessed on 2007-02-15. from 9 May 1989 to 8 February 1990. Introduced in 1989, elderly Marge is scripted as comical and timid. The character was one of many to be axed in 1990 when Michael Ferguson took over the role as executive producer from her introducer Mike Gibbon.", "By the end of the year, EastEnders had acquired a new executive producer, Michael Ferguson, who had previously been a successful producer on ITV's The Bill. Brake has suggested that Ferguson was responsible for bringing in a new sense of vitality, and creating a programme that was more in touch with the real world than it had been over the last year. A new era began in 1990 with the introduction of the Mitchell brothers, Phil (Steve McFadden) and Grant (Ross Kemp), successful characters who would go on to dominate the soap thereafter. As the new production machine cleared the way for new characters and a new direction, a number of characters were axed from the show at the start of the year. Among them was Marge, as well as many other characters that had been introduced to the show in 1989. By March 1990 they had all gone. Brake has said that Pat Coombs was upset to be leaving the programme so soon, but with the show's new direction there was no place for characters \"whose prime function was to be comic relief\"."]}, {"page": "Karim family", "response": ["Ashraf has been described as heavy-handed, serious-minded and stern, while the children have been described as bright, Sohail \"sneaky\" and Shireen \"pretty\". Storylines concentrate on racial difficulties and Ashraf's struggles to maintain Muslim ideologies in his children's lives, while they are identifying with Western culture. A love triange storyline is integrated into the Karims' marriage in 1989, when Ashraf is revealed to be having a long-running affair with a white woman named Stella (Cindy O'Callaghan), causing many family problems. The culmination of this storyline sees the departure of the Karims in June 1990; they were among many to be axed by executive producer Michael Ferguson. It has been reported that the fate of Sufia was originally scripted differently. Prior to Ferguson's introduction, Gibbon had recruited writer David Yallop to devise ways to kill various members of the cast based, he claims, on their portrayer's acting ability. According to Yallop, Gibbon had agreed that Sufia would be gunned-down and killed in a shotgun raid. The plot never came to fruition, as Gibbon was demoted as head producer and then resigned."]}, {"page": "Mo Butcher", "response": ["Edna Doré's portrayal of Mo's descent into Alzheimer's has been described as \"deeply moving\" by John Millar of the Daily Record. Former executive producer of EastEnders, Michael Ferguson, has suggested that Mo suffering from Alzheimer's in 1990 gave people permission to talk about an illness \"that had been almost too distressing to discuss in public before.\" He alleged that viewers informed him that EastEnders had given them a shorthand \"like Mo\" to discuss Alzheimer's."]}, {"page": "List of assassinations in fiction", "response": ["* The Glory Boys – 1984 television film by Michael Ferguson in which the IRA aids a PLO terrorist in a hit on an Israeli nuclear scientist"]}, {"page": "Leonard Lewis", "response": ["In 1990 Lewis began directing for BBC's soap opera, EastEnders. By the end of 1991 he had been promoted to co-producer along with Helen Greaves, both taking over charge of the show following the departure of executive producer, Michael Ferguson. Lewis and Greaves formulated a new regime for EastEndrers, giving the writers of the serial more authority in storyline progression, with the script department providing \"guidance rather than prescriptive episode storylines\". By the end of 1992 Helen Greaves left the serial and Lewis became executive and series producer. Among the storylines that aired under Lewis' tenure were, Arthur Fowler's affair with Christine Hewitt, Pat Butcher's drunk-driving accident, the death of Gill Fowler, Sharon Watts's affair with her brother-in-law Phil Mitchell, and the reintroduction of Cindy Beale. Other characters introduced included, David Wicks, Mandy Salter, Richard Cole, Sanjay Kapoor, Christine Hewitt, Nigel Bates, Natalie Price and the Jackson family, while axings included Pete Beale, and some of Tavernier family. Lewis decided to leave EastEnders in 1994 after the BBC controllers demanded an extra episode a week, taking its weekly airtime from 1hr (two episodes), to 1.5hrs (3 episodes). Lewis felt that producing an hour of \"reasonable quality drama\" a week was the maximum that any broadcasting system could generate without loss of integrity. Having set up the transition to the new schedule, the first trio of episodes — dubbed The Vic siege — marked Lewis' departure from the programme.  He decided to retire in 1995."]}, {"page": "Julie Cooper (EastEnders)", "response": ["Julie Cooper is a fictional character from the BBC soap opera, EastEnders, played by Louise Plowright from 1989–1990. The character was one of Mike Gibbon's introductions, but she was axed in 1990 at the start of Michael Ferguson's reign as executive producer. Julie is portrayed as a bubbly, big haired Salford girl, who has a hungry appetite for men.", "By the end of the year EastEnders had acquired a new executive producer, Michael Ferguson, who had previously been a successful producer on ITV's The Bill. Brake has suggested that Ferguson was responsible for bringing in a new sense of vitality, and creating a programme that was more in touch with the real world than it had been over the last year. A new era began in 1990 with the introduction of the Mitchell brothers, Phil (Steve McFadden) and Grant (Ross Kemp), successful characters who would go on to dominate the soap thereafter. As the new production machine cleared the way for new characters and a new direction, a number of characters were axed from the show at the start of the year. Among them was Julie, as well as many other characters that had been introduced to the show in 1989. By March 1990 they had all gone. Several of the actors were upset to be leaving the programme so soon, but with the show's new direction there was no place for characters \"whose prime function was to be comic relief\". Louise Plowright has since revealed that she would have liked to have stayed with the soap longer, but that the split was an amicable one. She commented, \"They just didn't know where to go with the character.\""]}, {"page": "Trevor Short", "response": ["By the end of the year EastEnders had acquired a new executive producer, Michael Ferguson, who had previously been a successful producer on ITV's The Bill. Ultimately, Ferguson was responsible for bringing in a new sense of vitality and creating a programme that was more in touch with the real world than it had been over the last year. A new era began in 1990 with the introduction of the Mitchell brothers, two hugely successful characters who would go on to dominate the soap thereafter. As the new production machine cleared the way for new characters and a new direction, a number of characters were axed from the show at the start of the year. Among them was Trevor, as well as every other \"comedic\" character that had been introduced to the show in 1989. By March 1990 they had all gone. Several of the actors were upset to be leaving the programme so soon, but with the show's new direction there was no place for characters \"whose prime function was to be comic relief\"."]}, {"page": "Phil McDermott", "response": ["Phil McDermott is a British actor. Before turning to acting he was a trainee priest, a scrap metal worker, a weighbridge operator and a carpenter. He is most famous for playing a regular character in the BBC soap opera EastEnders. He played the dim-witted odd-job man, Trevor Short from 1989–1990. His character was one of many to be axed from the show in early 1990 following the introduction of the new executive-producer, Michael Ferguson."]}, {"page": "Paul Priestly", "response": ["By the end of the year EastEnders had acquired a new executive producer, Michael Ferguson, who had previously been a successful producer on ITV's The Bill. Ultimately, Ferguson was responsible for bringing in a new sense of vitality, and creating a programme that was more in touch with the real world than it had been over the last year. A new era began in 1990 with the introduction of the Mitchell brothers, Phil (Steve McFadden) and Grant (Ross Kemp), two hugely successful characters, who would go on to dominate the soap thereafter. As the new production machine cleared the way for new characters and a new direction, a number of characters were axed from the show at the start of the year. Among them was Paul, as well as every other \"comedic\" character that had been introduced to the show in 1989. By March 1990 they had all gone. Several of the actors were upset to be leaving the programme so soon, but with the show's new direction there was no place for characters \"whose prime function was to be comic relief\"."]}, {"page": "Mark Thrippleton", "response": ["Thrippleton is best known for playing the northern builder, Paul Priestly, in the popular BBC soap opera EastEnders. His character joined the show in 1989, but was one of many to be axed in 1990 following the introduction of the new executive-producer, Michael Ferguson."]}, {"page": "Mike Gibbon", "response": ["He directed and produced the BBC televised soap opera, EastEnders. He began directing the programme in 1985 and began producing the programme in 1988. He became the show's new producer following the departure of the show's creator and series producer Julia Smith. Due to personal conflict with the series' head, Peter Cregeen, he was replaced by Michael Ferguson.-  It was reported that Gibbon controversially called for the killing of at least ten long-running characters in a bid to boost ratings. According to the writer David Yallop, acting ability was a key factor in deciding which members of the cast to kill off. Cast lists were marked with black asterisks, signifying a death for their character. One of the written plots saw characters die in an IRA bombing. However, the plots never came to fruition, as Gibbon was demoted and then resigned from the serial."]}, {"page": "List of EastEnders crew members", "response": ["* Michael Ferguson (1990–1991)", "*Michael Ferguson (1990)"]}, {"page": "List of films featuring the Irish Republican Army", "response": ["|Michael Ferguson"]}, {"page": "British Academy Television Award for Best Drama Series", "response": ["|Casualty || Gerraint Morris, Michael Ferguson || BBC Bristol || rowspan=\"2\"|BBC One "]}]}}