{"wiki_id": "http://www.wikidata.org/entity/Q1192339", "itemLabel": "Ewan MacColl", "itemDescription": "English folk singer, songwriter, communist, labour activist, actor, poet, playwright, and record producer (1915-1989)", "wikipedia_url": "https://en.wikipedia.org/wiki/Ewan_MacColl", "wikipedia_page": {"main": "James Henry Miller (25 January 1915 – 22 October 1989), better known by his stage name Ewan MacColl, was a folk singer songwriter, folk song collector, labour activist and actor, born in England of Scottish parents. He is known as one of the instigators of the 1960s folk revival as well as writing such songs as \"The First Time Ever I Saw Your Face\" and \"Dirty Old Town\".MacColl collected hundreds of traditional folk songs, including the version of \"Scarborough Fair\" later popularised by Simon & Garfunkel, and released dozens of albums with A.L. Lloyd, Peggy Seeger and others, mostly of traditional folk songs. He also wrote many left-wing political songs, remaining a steadfast communist throughout his life and engaging in political activism.", "link_mentions": [{"page": "January 25", "response": ["*1915 – Ewan MacColl, English singer-songwriter, actor and producer (d. 1989)"]}, {"page": "October 22", "response": ["*1989 – Ewan MacColl, English singer-songwriter, producer, actor, and playwright (b. 1915)"]}, {"page": "Protest song", "response": ["Folk singer Ewan MacColl was for some time one of the principal musical figures of the British nuclear disarmament movement. A former agitprop actor and playwright. MacColl, a prolific songwriter and committed leftist, some years earlier had penned \"The Ballad of Ho Chi Minh\" (1953), issued as single on Topic Records, and \"The Ballad of Stalin\" (1954), commemorating the death of that leader. Neither record has ever been reissued.His widow Peggy Seeger copyrighted \"The Battle of Stalin\" in 1992, when she included it in her Essential Ewan MacColl Songbook, explaining that after the revelations of Stalin's crimes in 1956, MacColl became ashamed of having written it and never wanted to speak or hear about it. See the discussion on Mudcat Cafe."]}, {"page": "The Pogues", "response": ["With the aid of producer Elvis Costello, they recorded the follow-up, Rum Sodomy & the Lash, in 1985 during which time guitarist Philip Chevron joined. The album title is a famous comment falsely attributed to Winston Churchill who was supposedly describing the \"true\" traditions of the British Royal Navy. The album cover featured The Raft of the Medusa, with the faces of the characters in Théodore Géricault's painting replaced with those of the band members. The album shows the band moving away from covers to original material. Shane MacGowan came into his own as a songwriter with this disc, offering up poetic storytelling, such as \"The Sick Bed of Cúchulainn\" and \"The Old Main Drag\", as well as definitive interpretations of Ewan MacColl's \"Dirty Old Town\" and Eric Bogle's \"And the Band Played Waltzing Matilda\" (this had previously been covered by Shane's fellow punk contemporaries Skids in 1981)."]}, {"page": "Vietnam War", "response": ["The war also influenced a generation of musicians and songwriters in Vietnam, the United States, and throughout the world, both anti-war and pro/anti-communist, with the Vietnam War Song Project having identified 5,000+ songs about or referencing the conflict. The band Country Joe and the Fish recorded The \"Fish\" Cheer/I-Feel-Like-I'm-Fixin'-to-Die Rag in 1965, and it became one of the most influential anti-Vietnam protest anthems. Many songwriters and musicians supported the anti-war movement, including Pete Seeger, Joan Baez, Bob Dylan, Peggy Seeger, Ewan MacColl, Barbara Dane, The Critics Group, Phil Ochs, John Lennon, John Fogerty, Nina Simone, Neil Young, Tom Paxton, Jimmy Cliff and Arlo Guthrie. The modern classical composer George Crumb composed a string quartet, a threnody, regarding the war in 1970 titled Black Angels."]}, {"page": "1915", "response": ["* January 25 – Ewan MacColl, English folk singer, songwriter, and poet (d. 1989)"]}, {"page": "1989", "response": ["** Ewan MacColl, British folk singer, political activist and actor (b. 1915)"]}, {"page": "Grammy Award for Song of the Year", "response": ["|Ewan MacColl"]}, {"page": "Ivor Novello", "response": ["Novello presented only two new shows during the Second World War. Arc de Triomphe (1943), a musical vehicle for Mary Ellis, was only a modest success, but Perchance to Dream (1945) was immensely successful, running for 1,022 performances. In between the two shows, Novello had been in serious legal trouble and served four weeks in prison for misuse of petrol coupons, a serious offence under rationing laws in wartime Britain. An admiring fan had stolen the coupons from her employer, but the court found that Novello was also culpable.MacQueen-Pope, p. 234. The offending fan, Dora Grace Constable, escaped with a £50 fine: see ODNB The prison term, though short, came as a severe shock to Novello, both mentally and physically, and had serious lasting effects. Not everybody was supportive; Coward's sympathy was limited: \"He's been fighting like a steer to keep going as before the war and hasn't done a thing for the general effort\",Hoare (1995), p.349; Coward's modified sympathy was later echoed in Ewan MacColl's song \"Ivor\": see MacColl, Ewan. Bad Lads and Hard Cases, Riverside LP 1957 but when Novello returned to The Dancing Years after his release, he received \"a rapturous ovation\" on his first entrance."]}, {"page": "River Thames", "response": ["Ewan MacColl's \"Sweet Thames, Flow Softly\", written in the early 1960s, is a tragic love ballad set on trip up the river (see Edmund Spenser's love poem's refrain above)"]}, {"page": "Lancashire", "response": ["A local pioneer of folk song collection in the first half of the 19th century was Shakespearean scholar James Orchard Halliwell,E. D. Gregory, Victorian Songhunters: the Recovery and Editing of English Vernacular Ballads and Folk Lyrics, 1820–1883 (Lanham, MD: Scarecrow, 2006), , p. 248. but it was not until the second folk revival in the 20th century that the full range of song from the county, including industrial folk song, began to gain attention. The county produced one of the major figures of the revival in Ewan MacColl, but also a local champion in Harry Boardman, who from 1965 onwards probably did more than anyone to popularise and record the folk song of the county.Folk North West, , retrieved 16 February 2009. Perhaps the most influential folk artists to emerge from the region in the late 20th century were Liverpool folk group The Spinners, and from Manchester folk troubadour Roy Harper and musician, comedian and broadcaster Mike Harding.J, C. Falstaff, 'Roy Harper Longest Running Underground Act', Dirty Linen, 50 (Feb/Mar '94), http://www.dirtylinen.com/feature/50harper.html , 16 February 2009.S. Broughton, M. Ellingham and R. Trillo, World Music: Africa, Europe and the Middle East (Rough Guides, 1999), , p. 67. The region is home to numerous folk clubs, many of them catering to Irish and Scottish folk music. Regular folk festivals include the Fylde Folk Festival at Fleetwood.'Festivals', Folk and Roots, , retrieved 8 January 2009."]}, {"page": "Thomas the Rhymer", "response": ["*Modern versions of the \"Thomas the Rhymer\" ballad include renditions by British folk rock act Steeleye Span which recorded two different versions for their 1974 album Now We Are Six and another for Present--The Very Best of Steeleye Span, released in 2002. Singer Ewan MacColl has also recorded his version of the ballad."]}, {"page": "Ho Chi Minh", "response": ["Many activists and musicians wrote songs about Hồ Chí Minh and his revolution in different languages during the Vietnam War to demonstrate against the United States. Spanish songs were composed by Félix Pita Rodríguez, Carlos Puebla and Alí Primera. In addition, the Chilean folk singer Víctor Jara referenced Hồ Chí Minh in his anti-war song \"El derecho de vivir en paz\" (\"The Right to Live in Peace\"). Pete Seeger wrote \"Teacher Uncle Ho\". Ewan MacColl produced The Ballad of Ho Chi Minh in 1954, describing \" a man who is father of the Indo-Chinese people, And his name it is Ho Chi Minh.\" Russian songs about him were written by Vladimir Fere and German songs about him were written by Kurt Demmler."]}, {"page": "Oswald Mosley", "response": ["* On Mosley's release from prison in 1943, Ewan MacColl wrote the song \"The Leader's a Bleeder\", set to the tune of the Irish song \"The Old Orange Flute\".  The song suggests that Mosley had been treated relatively well in prison owing to his aristocratic background."]}, {"page": "Rod Stewart", "response": ["Stewart worked in the family shop and as a newspaper delivery boy.Ewbank and Hildred, Rod Stewart: The New Biography, pp. 12–13. He then worked briefly as a labourer for Highgate Cemetery, which became another part of his biographical lore. He worked in a North Finchley funeral parlour and as a fence erector and sign writer. In 1961 he went to Denmark Street with The Raiders and got a singing audition with well-known record producer Joe Meek, but Meek stopped the session with a rude sound.Ewbank and Hildred, Rod Stewart: The New Biography, pp. 14–16, 20.  Stewart began listening to British and American topical folk artists such as Ewan MacColl, Alex Campbell, Woody Guthrie, Ramblin' Jack Elliott, and especially Derroll Adams and the debut album of Bob Dylan.Moritz (ed.), Current Year Biography 1979, p. 375.", "An Old Raincoat Won't Ever Let You Down became Stewart's first solo album in 1969 (it was known as The Rod Stewart Album in the US). It established the template for his solo sound: a heartfelt mixture of folk, rock, and country blues, inclusive of a British working-class sensibility, with both original material (\"Cindy's Lament\" and the title song) and cover versions (Ewan MacColl's \"Dirty Old Town\" and Mike d'Abo's \"Handbags and Gladrags\"). The backing band on the album included Wood, Waller and McLagan, plus Keith Emerson and guitarists Martin Pugh (of Steamhammer, and later Armageddon and 7th Order) and Martin Quittenton (also from Steamhammer)."]}, {"page": "Pete Seeger", "response": ["Charles and Constance divorced when Pete was seven and in 1932 Charles married his composition student and assistant, Ruth Crawford, now considered by many to be one of the most important modernist composers of the 20th century.See Judith Tick, Ruth Crawford Seeger: a Composer's Search for American Music (1997). Deeply interested in folk music, Ruth had contributed musical arrangements to Carl Sandburg's extremely influential folk song anthology, the American Songbag (1927), and later created significant original settings for eight of Sandburg's poems. Pete's eldest brother, Charles Seeger III, was a radio astronomer, and his next older brother, John Seeger, taught in the 1950s at the Dalton School in Manhattan and was the principal from 1960 to 1976 at Fieldston Lower School in the Bronx. Pete's uncle, Alan Seeger, a noted American war poet (\"I Have a Rendezvous with Death\"), had been one of the first American soldiers to be killed in World War I. All four of Pete's half-siblings from his father's second marriage—Margaret (Peggy), Mike, Barbara, and Penelope (Penny)—became folk singers. Peggy Seeger, a well-known performer in her own right, married British folk singer and activist Ewan MacColl. Mike Seeger was a founder of the New Lost City Ramblers, one of whose members, John Cohen, married Pete's half-sister Penny, also a talented singer, who died young. Barbara Seeger joined her siblings in recording folk songs for children. In 1935, Pete attended Camp Rising Sun, an international leadership camp held every summer in upstate New York, which influenced his life's work. His final visit occurred in 2012."]}, {"page": "1989 in music", "response": ["*October 22 – Ewan MacColl, folk singer, 74"]}, {"page": "1959 in music", "response": ["*Approximate date – Ballads and Blues folk club founded by Ewan MacColl and others in a London pub in Soho as part of the second British folk revival."]}, {"page": "1957 in music", "response": ["* \"The First Time Ever I Saw Your Face\"     w.m. Ewan MacColl"]}, {"page": "1949 in music", "response": ["* \"Dirty Old Town\" w.m. Ewan MacColl"]}, {"page": "Joan Littlewood", "response": ["Littlewood was born in Stockwell, London, and was educated at La Retraite Convent School in Clapham Park. She trained as an actress at RADA, but left after an unhappy start and moved to Manchester in 1934, where she met folksinger Jimmie Miller, who later became known as Ewan MacColl. After joining his troupe, Theatre of Action, Littlewood and Miller soon were married. After a brief move to London, they returned to Manchester and set up the Theatre Union in 1936.", "In 1945, after the end of World War II, Littlewood, her husband the communist folk singer Ewan MacColl, and other Theatre Union members formed Theatre Workshop and registered it while staying at Ormesby Hall. The following eight years were spent touring. Shortly afterwards, when Gerry Raffles joined the troupe, MacColl and Littlewood divorced, though they still worked together for many years and Littlewood was godmother to MacColl's two children. Littlewood and Raffles were life partners until his death in 1975.", "* Goorney, Howard, and Ewan MacColl (1990). Agit-Prop to Theatre Workshop: Political Playscripts, 1930–50. Manchester, UK: Manchester University Press. "]}, {"page": "1915 in music", "response": ["*January 25 – Ewan MacColl, English folk singer and songwriter (d. 1989)"]}, {"page": "Folk rock", "response": ["During the 1950s and early 1960s in the UK, a parallel folk revival referred to as the second British folk revival, was led by folk singers Ewan MacColl and Bert Lloyd. Both viewed British folk music as a vehicle for leftist political concepts and an antidote to the American-dominated popular music of the time. However, it wasn't until 1956 and the advent of the skiffle craze that the British folk revival crossed over into the mainstream and connected with British youth culture. Skiffle renewed popularity of folk music forms in Britain and led directly to the progressive folk movement and the attendant British folk club scene. Among the leading lights of the progressive folk movement were Bert Jansch and John Renbourn, who would later form the folk rock band Pentangle in the late 1960s. Other notable folk rock artists with roots in the progressive folk scene were Donovan, Al Stewart, John Martyn and Paul Simon."]}, {"page": "List of folk musicians", "response": ["*Ewan MacColl"]}]}}