{"wiki_id": "http://www.wikidata.org/entity/Q12073104", "itemLabel": "William Barnes Wollen", "itemDescription": "English painter (1857-1936)", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Barnes_Wollen", "wikipedia_page": {"main": "William Barnes Wollen  (6 October 1857 – 28 March 1936) was an English painter mostly known for his paintings of battle and historical scenes and sporting events.", "link_mentions": [{"page": "Battle of Omdurman", "response": ["The subject of the battle made its appearance in several oil paintings later exhibited in Britain. In particular, the charge of the 21st Lancers held special appeal and several artists portrayed the scene including Stanley Berkeley, Robert Alexander Hillingford, Richard Caton Woodville, William Barnes Wollen, Gilbert S. Wright, Edward Mathew Hale, Capt. Adrian Jones, Major John C. Mathews, and Allan Stewart. The pictorial press covered the campaign extensively and employed several artists to record the events."]}, {"page": "War artist", "response": ["* William Barnes Wollen, 1857–1936"]}, {"page": "Royal Institute of Painters in Water Colours", "response": ["*William Barnes Wollen"]}, {"page": "28th Regiment at Quatre Bras (painting)", "response": ["She had copies of the historic uniforms made by a government manufacturer in Pimlico. However, the shako she depicts the regiment wearing is incorrect. Whilst nearly all Regiments of Foot in the British Army had adopted the false-fronted Belgic shako since 1812, so the replica uniforms were correct for a standard line regiment, the 28th Regiment continued to wear the older stovepipe shakos during the Hundred Days campaign.  The older headwear can be seen clearly in William Barnes Wollen's painting: 28th Gloucester Regiment at Waterloo."]}, {"page": "Wollen", "response": ["*William Barnes Wollen (1857–1936), English painter"]}, {"page": "Chelmsford Museum", "response": ["The house also incorporates the Museum of the Essex Regiment and the Essex Yeomanry. Highlights of this collection include the French Imperial Eagle captured by the 2nd Battalion of the 44th Regiment of Foot from the French 62nd Régiment d'Infanterie de Ligne at the Battle of Salamanca in 1812, as well as The Last Stand of the 44th Regiment at Gundamuck, a painting by William Barnes Wollen depicting the 1842 retreat from Kabul in Afghanistan."]}, {"page": "John Charlton (artist)", "response": ["The shock of the loss of his two sons on the Western Front was too much to bear and on 10 November 1917, while the war still raged, Charlton died after a brief illness at Banks House, Lanercost at the age of 68. \"He felt the loss of his two suns profoundly,\" read his obituary in The Graphic. On the wall of St. Mary Magdalene, Lanercost Priory, are memorials to the artist and his two sons. During his career, Charlton never gained much attention beyond his picture of the Diamond Jubilee. He created numerous illustrations for The Graphic but his oil paintings of military and battle scenes were rarely mentioned in the reviews. And his paintings of the Great War were criticised as being anachronistic and better suited to the previous century. Nonetheless, his paintings are dramatic and well-executed with careful attention to detail, and he certainly ranks among his contemporaries, Richard Caton Woodville, James Princip Beadle and William Barnes Wollen as one of Britain's preeminent 'battle' painters of the late Victorian period."]}, {"page": "Barron Kilner", "response": ["Kilner can be seen in the crowd of William Barnes Wollen's painting \"The Rugby Match\", which features Yorkshire's 11-3 victory over Lancashire during the 1893/94 season and is now held at the Rugby Football Union headquarters at Twickenham Stadium. Alf Barraclough is shown being tackled, and passing the ball to Jack Toothill, with Tommy Dobson on the outside. Kilner is the first person in the crowd to the right of Dobson's head."]}, {"page": "Thomas Dobson (rugby)", "response": ["Tommy Dobson won cap(s) for Yorkshire (RU) while at Bradford FC, in William Barnes Wollen's painting of Yorkshire's 11–3 victory over Lancashire during the 1893/94 season, a painting that is now held at the Rugby Football Union headquarters in the Twickenham Stadium, Alfred \"Alf\" Barraclough can be seen being tackled, and passing the ball to Jack Toothill, with Tommy Dobson on the outside, although Tommy Dobson did not actually participate in this particular match."]}, {"page": "John Toothill", "response": ["Jack Toothill won cap(s) for Yorkshire (RU) while at Bradford FC, in William Barnes Wollen's painting of Yorkshire's 11–3 victory over Lancashire during the 1893/94 season, a painting that is now held at the Rugby Football Union headquarters in the Twickenham Stadium, Alfred \"Alf\" Barraclough can be seen being tackled, and passing the ball to Jack Toothill, with Tommy Dobson on the outside, although Tommy Dobson did not actually participate in this particular match."]}, {"page": "Roger Walker (rugby union)", "response": ["In William Barnes Wollen's painting \"The Rugby Match\", featuring Yorkshire's 11-3 victory over Lancashire during the 1893/94 season, a painting that is now held at the Rugby Football Union headquarters in the Twickenham Stadium, Alf Barraclough can be seen being tackled, and passing the ball to Jack Toothill, with Tommy Dobson on the outside, Roger Walker can be seen in the crowd, he is the seventh person to the right of Tommy Dobson's head."]}, {"page": "The Wide World Magazine", "response": ["Some famous names occasionally wrote for the magazine (such as Arthur Conan Doyle, Henry Morton Stanley, Douglas Reeman etc.), and it was copiously illustrated with photographs, as well as black and white drawings by such artists as Terence Cuneo, Cecil Stuart Tresilian, Alfred Pearse, Chas Sheldon, Paul Hardy, William Barnes Wollen, John L. Wimbush, Charles J. Staniland, Joseph Finnemore, John Charlton, Warwick Goble, Tom Browne, Ernest Prater, Gordon Browne, Edward S. Hodgson, Norman H. Hardy, Inglis Sheldon Williams, and Harry Rountree.See Volumes 3 and 7, for example (bibliography)."]}, {"page": "Alf Barraclough", "response": ["Alf Barraclough won cap(s) for Yorkshire while at Manningham, in William Barnes Wollen's painting The Rugby Match, featuring Yorkshire's 11-3 victory over Lancashire during the 1893/94 season, a painting that is now held at the Rugby Football Union headquarters in the Twickenham Stadium, Alf Barraclough can be seen being tackled, and passing the ball to Jack Toothill, with Tommy Dobson on the outside, although Tommy Dobson did not actually participate in this particular match."]}, {"page": "The Battle of the Roses", "response": ["The Battle of the Roses also known as The Rugby Match or The Roses Match is an 1895 portrait by artist William Barnes Wollen. It is based on the rugby union match between the representative sides of Yorkshire and Lancashire played at Fallowfield, Manchester on 24 November 1894. It depicts the Yorkshire team in the all-white strip attacking while the Lancashire team in the hooped red and white jerseys and black shorts try to prevent a pass being made. The action on the pitch takes place in front of a packed stadium.  "]}]}}