{"wiki_id": "http://www.wikidata.org/entity/Q12065586", "itemLabel": "Penry Williams", "itemDescription": "Welsh artist (1802-1885)", "wikipedia_url": "https://en.wikipedia.org/wiki/Penry_Williams_(artist)", "wikipedia_page": {"main": "Penry Williams (1802 – 27 July 1885) was a Welsh artist who spent most of his life in Rome.", "link_mentions": [{"page": "Merthyr Tydfil", "response": ["*Penry Williams – artist"]}, {"page": "John Gibson (sculptor)", "response": ["Throughout most of his time in Rome Gibson had an alleged relationship with the Welsh artist Penry WilliamsShopland, Norena 'Frances and Mary' from Forbidden Lives: LGBT stories from Wales Seren Books (2017)"]}, {"page": "1885 in Wales", "response": ["*27 July – Penry Williams, artist"]}, {"page": "1845 in Wales", "response": ["*Penry Williams paints the portrait of Lady Charlotte Guest."]}, {"page": "Penry Williams", "response": ["thumb|right|Penry Williams", "Penry Williams (5 September 1866 – 26 June 1945) was a Liberal Party politician in England.  He was born in Middlesbrough, the son of Edward Williams, a Cleveland ironmaster.  He was a brother of Aneurin Williams MP."]}, {"page": "Thomas Brigstocke", "response": ["Brigstocke was born  at 61, King Street, Carmarthen, on 17 April 1809, the third son of David and Mary Brigstocke. He was educated at Queen Elizabeth's Grammar School in Carmarthen. At the age of sixteen he was sent by his parents to study in the studio of Henry Sass in Charlotte Street, London. Eight months later he became a student at the Royal Academy  Schools,  first under Henry Perronet Briggs, and then under John Prescott Knight. In 1833 he left Britain to study  in Paris, Florence, Rome, and Naples, spending eight years in Italy. During this period he made various copies of the old masters, including one of Raphael's Transfiguration which was bought as an altarpiece for Christ Church, Albany Street, London, on the recommendation of the painter William Collins. During his time in Rome he associated with two other Welsh artists residents there, John Gibson and Penry Williams, as well as Englishmen such as E.M. Ward and Joseph Severn. Brigstocke, a Welsh-speaker, is said to have taught the noted linguist Cardinal Mezzofanti the language."]}, {"page": "List of painters by name beginning with \"W\"", "response": ["*Penry Williams (1802–1885), Welsh/Italian painter"]}, {"page": "List of Welsh artists", "response": ["*Penry Williams (1805–1885), Wales-born painter who lived and worked in Rome from 1827"]}, {"page": "James Dafforne", "response": ["|Penry Williams"]}, {"page": "Merthyr Tydfil County Borough", "response": ["*Penry Williams — artist (painter)"]}, {"page": "Frederick Thrupp", "response": ["On 15 February 1837 Thrupp started for Rome, accompanied by James Uwins, nephew of Thomas Uwins, and arrived there on 17 March. While at Rome he had the support of John Gibson, who admired his Ferdinand, modelled soon after his arrival in 1837, and found several private commissions for him. Gibson induced him to abandon a taste for caricature. Thrupp also made the acquaintance of Bertel Thorvaldsen, and formed friendships among the English colony of artists at Rome.Including William Theed, Richard James Wyatt, Joseph Severn, Penry Williams, Edward Lear, and others. He finally returned to London in October 1842, when he took a house at No. 232 Marylebone Road (then called the New Road), where he built a large gallery and studio. He let most of the house and lived himself at 15 Paddington Green (the house where he was born) till, on his mother's death in 1845, his two unmarried sisters joined him in the Marylebone Road. Here he lived for forty years."]}, {"page": "Lumb Stocks", "response": ["Stocks engraved plates for the literary annuals then in vogue, among which were \"The Lace Maker\" and \"Going to Service\", after James Inskipp, for the Amulet of 1835. He engraved for William Finden's Royal Gallery of British Art (1838–1840) the plates of \"The Procession to the Christening\", after Penry Williams, \"Preparing Moses for the Fair\", from The Vicar of Wakefield, after Daniel Maclise, and \"Nell Gwyn\", after Charles Landseer. He produced \"Raffaelle and the Fornarina\" (1842), after Sir Augustus Wall Callcott, engraved for the Art Union of London; and three plates – \"The Glee Maiden\" and \"Ruth\", after Robert Scott Lauder, and \"The Parable of the Ten Virgins\", after James Eckford Lauder – engraved for the Association for the Promotion of the Fine Arts in Scotland.", "Christening procession) - painted by Penry Williams ; engraved by L. Stocks LCCN2012648909.jpg|The Christening Procession after Penry Williams"]}, {"page": "Penry", "response": ["*Penry Williams (1866–1945), English politician ", "*Penry Williams (artist) (1802–1885), Welsh artist", "*Penry Williams (historian) (1925-2013), Welsh historian"]}]}}