{"wiki_id": "http://www.wikidata.org/entity/Q12025739", "itemLabel": "Joe Dunthorne", "itemDescription": "Novelist, poet", "wikipedia_url": "https://en.wikipedia.org/wiki/Joe_Dunthorne", "wikipedia_page": {"main": "Joe Dunthorne (born 1982) is a Welsh novelist, poet and journalist. He first made his name with his novel Submarine (2008), which was made into a film in 2010. His second novel, Wild Abandon (2011), won the RSL Encore Award. A selection of his poems was published in 2010 in the Faber New Poets series. His first solo collection of poems appeared in 2019.", "link_mentions": [{"page": "List of English-language poets", "response": ["*Joe Dunthorne (born 1982, W)"]}, {"page": "UEA Creative Writing Course", "response": ["*Joe Dunthorne (MA, 2005), novelist"]}, {"page": "Paddy Considine", "response": ["In 2011, Considine starred in a film adaptation of Joe Dunthorne's book Submarine, which Richard Ayoade wrote and directed. Also in 2011, Considine appeared as Porter Nash in the adaptation of the Ken Bruen novel Blitz, as well as starring as Jack Whicher in The Suspicions of Mr Whicher, written by Helen Edmundson and Neil McKay. In the same year, Considine was briefly reunited with one of his A Room for Romeo Brass co-stars, BAFTA-winning actress Vicky McClure. The two shared the screen in a television advert to promote \"Films for Life Season\". The ad was shot over two days in Spain."]}, {"page": "Richard Ayoade", "response": ["From 1998 to 1999, Ayoade was the president of the Footlights club at St Catharine's College, Cambridge. He and Matthew Holness debuted their respective characters Dean Learner and Garth Marenghi at the Edinburgh Festival Fringe in 2000, bringing the characters to television with Garth Marenghi's Darkplace (2004) and Man to Man with Dean Learner (2006). He appeared in the comedy shows The Mighty Boosh (2004–2007) and Nathan Barley (2005), before becoming widely known for his role in The IT Crowd. After directing music videos for Kasabian, Arctic Monkeys, Vampire Weekend, and Yeah Yeah Yeahs, he wrote and directed the comedy-drama film Submarine (2010), an adaptation of the 2008 novel by Joe Dunthorne. He co-starred in the American science fiction comedy film The Watch (2012) and his second film as a writer and director, the black comedy The Double (2013), drew inspiration from Fyodor Dostoevsky's novella of the same title.", "In 2010, Ayoade made his debut directorial feature, Submarine, a coming-of-age comedy-drama he adapted from Joe Dunthorne's 2008 novel of the same name. The film stars newcomers Craig Roberts and Yasmin Paige with Sally Hawkins, Noah Taylor, and Paddy Considine. It follows Welsh teenager Oliver Tate (Roberts) as he becomes infatuated with a classmate (Paige) and the turmoil of his parent's failing relationship. Produced by Warp Films and Film4, it premiered at the 35th Toronto International Film Festival in September 2010, had a general release in the UK in March 2011, and was released in June in the US after being picked up by the Weinstein Company for North America. Arctic Monkeys and The Last Shadow Puppets frontman Alex Turner contributed five original songs to the soundtrack, inspired by Simon & Garfunkel's music in The Graduate (1967). The film was positively received by critics, with The Guardian critic Peter Bradshaw calling Ayoade a \"tremendous new voice in British film\". Ayoade was nominated for a BAFTA for Outstanding Debut by a British Writer, Director or Producer at the 65th British Academy Film Awards."]}, {"page": "Timothy McSweeney's Quarterly Concern", "response": ["| align=\"center\" | Winter 2013 || \"Multiples\" or Twelve Stories Appearing in up to Six Versions EachGuest editor: Adam Thirlwell(oblong softcover with a two-layer stepped partial cover)  || Letters: none Contributing writers: Originals: Carlo Emilio Gadda, Youssef Habchi El-Achkar, Franz Kafka, Søren Kierkegaard, Danilo Kiš, László Krasznahorkai, Richard Middleton, Kenji Miyazawa, Giuseppe Pontiggia, A. L. Snijders, Enrique Vila-Matas Translations: Nadeem Aslam, Tash Aw, John Banville, Frédéric Beigbeder, Laurent Binet, A. S. Byatt, Orly Castel-Bloom, J. M. Coetzee, Lydia Davis, Joe Dunthorne, Dave Eggers, Nathan Englander, Álvaro Enrigue, Péter Esterházy, Jeffrey Eugenides, Adam Foulds, Julia Franck, Rodrigo Fresán, Tristan Garcia, Francisco Goldman, Andrew Sean Greer, Arnon Grunberg, Yannick Haenel, Rawi Hage, Aleksandar Hemon, Sheila Heti, Chloe Hooper, Heidi Julavits, Daniel Kehlmann, Etgar Keret, Jonas Hassen Khemiri, László Krasznahorkai, Jonathan Lethem, Mara Faye Lethem, Valeria Luiselli, Ma Jian, Sarah Manguso, Javier Marías, Clancy Martin, Wyatt Mason, Tom McCarthy, David Mitchell, Cees Nooteboom, Lawrence Norfolk, Julie Orringer, Francisco Pacifico, Alan Pauls, José Luís Peixoto, Gary Shteyngart, Sjón, Zadie Smith, Peter Stamm, Adam Thirlwell, Colm Tóibín, Camille de Toledo, Jean-Christophe Valtat, Vendela Vida, Ivan Vladislavić, John Wray, Alejandro Zambra, Florian Zeller Illustrations: Wesley Allsbrook, Erin Althea, Mike Bertino, Brianna Harden, Ian Huebert, Tim Lahan Cover illustrations: Wesley Allsbrook, Erin Althea, Mike Bertino, Kelsey Dake, Ian Huebert"]}, {"page": "List of people from Swansea", "response": ["*Joe Dunthorne, poet, novelist"]}, {"page": "Olchfa School", "response": ["* Joe Dunthorne, poet and author\"Shooting of movie adaptation surreal experience for writer\", \"This is South Wales\", 20 November 2009, accessed 24 August 2011."]}, {"page": "Curtis Brown (agency)", "response": ["The Curtis Brown Prize was established in 2006 in memory of agent Giles Gordon (1940-2003).\"The Curtis Brown Award - Annual award established in memory of Giles Gordon\", University of East Anglia. Worth £1,500, it is awarded annually for the best writer of prose fiction on the University of East Anglia MA in Creative Writing (Prose Fiction) course, based on the material submitted by students for their MA assessment. The winner is chosen by a panel of Curtis Brown agents from a shortlist comprising all students in the year who achieve an MA with distinction.Prizes - The Curtis Brown Prize, University of East Anglia. The inaugural award was made to Joe Dunthorne in 2006 for his novel Submarine. Other recipients are: Tamara Britten (2007), Daniel Timms (2008), Lauren Owen (2009), Gillian Daly (2010), Chelsey Flood (2011), Charlotte Stretch (2012)."]}, {"page": "Craig Roberts", "response": ["In 2010, Roberts had worldwide success with the teenage lead role in the film Submarine, based on the 2008 novel by Joe Dunthorne. It was directed by Richard Ayoade and also starred Paddy Considine and Yasmin Paige."]}, {"page": "Pen Pusher", "response": ["As well as championing new writing, the magazine featured more well-known literary names. Contributors to the magazine include Simon Callow, Hugo Williams, Simon Munnery, Joe Dunthorne, Josie Long and John Hegley."]}, {"page": "Encore Award", "response": ["|Joe Dunthorne"]}, {"page": "Bollinger Everyman Wodehouse Prize", "response": ["**Joe Dunthorne - Submarine (Hamish Hamilton)"]}, {"page": "Literary Death Match", "response": ["In Europe, the event has featured readers Joe Dunthorne (author of Submarine), Esther Freud (Hideous Kinky), Nikesh Shukla (C4 Comedy Labs' Kabadasses creator), comedy writers David Quantick and Robert Popper, and judges Rich Fulcher (The Mighty Boosh), model-turned-author Sara J. Stockbridge, comedian Josie Long, Sichuan chef Fuchsia Dunlop, Kaiser Chiefs drummer Nick Hodgson and Irish musician Cathy Davey.", "| Amber Marks (Book Club Boutique), Joe Dunthorne (English Writers Football Team), Tim Wells (Pen Pusher Magazine), and Nick Harkaway (BBC Radio 3's The Verb)"]}, {"page": "Five Dials", "response": ["Five Dials has staged several events in the UK and abroad to celebrate the release of the magazine. In September 2009, the Paris issue was launched from the famous Shakespeare and Company bookstore on the Left Bank, with readings from writers Steve Toltz and Joe Dunthorne; the tenth issue was released at an event held in conjunction with Book Slam at London's Wilton's Music Hall in February 2010; and the recent Quebec issue was launched in Montreal. The magazine attracted positive attention from the Canadian and Québécois press, including the Montreal Mirror, the Montreal Gazette, and The Walrus."]}, {"page": "John Osborne (writer)", "response": ["He presents Stress Test, a monthly poetry show on Soho Radio, alongside Martha Sprackland and Joe Dunthorne."]}, {"page": "Submarine (2010 film)", "response": ["Submarine is a 2010 coming-of-age comedy-drama film written and directed by Richard Ayoade and starring Craig Roberts, Yasmin Paige, Noah Taylor, Paddy Considine and Sally Hawkins. It was adapted from the 2008 novel Submarine by Joe Dunthorne, and is an international co-production between the United Kingdom and the United States. Submarine is Ayoade's directorial debut."]}, {"page": "Poetry Wales", "response": ["Poems: John Freeman, Di Slaney, Joe Dunthorne, Annie Brechin, Ben Bransfield, Ben Rogers, Nerys Williams, Dai George, Abeer Ameer, Kerry Hardie, Alan Perry, Leo Temple, Elizabeth Porter, Jan Harris, Rhian Edwards, Susie Wild, Daniel Sluman, Rhiannon Hooson, Jill Munro, Stephen Payne, Taylor Edmonds, Richard Georges, Lauren Pope, Bethany Pope, Michael Loveday, Katrina Naomi, Peter Knaggs, Zillah Bowes, Jodie Hollander, Paul Stephenson, Kathy Miles, Tony Curtis, Zoë Wells", "Poems: Gillian Clarke, Osi Rhys Osmond, Stephen Knight, Vicky Morris, Jessica Mookherjee, Marvin Thompson, Liz Lefroy, Emily Blewitt, clare e. potter, Patrick Jones, Phil Jones, Arjunan Manuelpillai, Di Slaney, Matthew Jarvis, Rhea Seren Phillips, David Rees Davies, Joe Dunthorne, Matthew Caley, David Clarke, Emily Cotterill, Shauna Robertson, Christopher Meredith, Emma Simon, Wendy Pratt, Neetha Kunaratnam, Rhian Edwards, Linda Saunders, John Freeman", "Poems: Sascha Aurora Ahktar, Jazmine Linklater, Stewart Sanderson, Ifor Ap Glyn, Chloe Garner, Sian Melangell Dafydd, Simon Mundy, Sarah Marina, Andrew Spragg, Joe Dunthorne, Rose Knapp, Mike Jenkins, John White, Rosemary Corlett, David O’Hanlon, Eleanor Rees, Maitreyabandhu, Dan O’Brien, Fiona Cameron, Owen Lewis, Nerys Williams, James Stradner, Robert Sheppard."]}, {"page": "Submarine (EP)", "response": ["Submarine is the debut solo EP by English musician and Arctic Monkeys lead vocalist Alex Turner. It was released on 14 March 2011 in the United Kingdom. The EP consists of six original songs by Alex Turner from the film Submarine and was released by Domino. Submarine, the debut film from Richard Ayoade, was based on the novel by Joe Dunthorne."]}, {"page": "Steven J Fowler", "response": ["* Joe Dunthorne"]}, {"page": "Submarine (novel)", "response": ["Submarine is a novel by Joe Dunthorne. First published by Hamish Hamilton in 2008, it was adapted into a film in 2010."]}, {"page": "The White Review", "response": ["The 2017 Short Story Prize was awarded to both a UK and Ireland winner, as well as a US and Canada winner, with two respective shortlists and judging panels. The UK and Ireland judges were Jon Day, Joe Dunthorne and Faber and Faber publisher Mitzi Angel. The US and Canada judges were Hari Kunzru, literary agent Anna Stein and New Directions publisher Barbara Epler. Both winners were awarded May, 2017.  The White Review Poet's Prize was also introduced in 2017, and was launched to recognise and celebrate English-language poets who are at the crucial stage of creating their debut pamphlet or collection, and to encourage poetry that explores and expands the possibilities of the page-poetry form. The 2017 judges were Kayo Chingonyi, Vahni Capildeo and Penguin Books editor Donald Futers. The poetry winner was awarded December 7, 2017. "]}, {"page": "Sunday Times Short Story Award", "response": ["!style=white-space:nowrap scope=\"row\"|Will Cohu, Nothing but GrassJoe Dunthorne, Critical Responses to My Last RelationshipAdam Marek, Fewer ThingsDavid Vann, It's Not Yours", "!style=white-space:nowrap scope=\"row\"|Joe Dunthorne, All The Poems Contained Within Will Mean Everything to EveryonePaul Dalla Rosa, CommeLouise Kennedy, In silhouetteKevin Barry, The Coast of LeitrimEmma Cline, What Can You Do With a General||"]}, {"page": "Ministry of Stories", "response": ["As of late 2012, 5,000 young people have taken part in activities sponsored by the MoS. About 500 trained volunteers have contributed to the effort, as have writers including Joe Dunthorne, David Nicholls and Zadie Smith, as well as actors Colin Firth and Emma Thompson."]}, {"page": "Festival N°6", "response": ["| 2013 || James Blake, My Bloody Valentine, Manic Street Preachers, Jagwar Ma, Mount Kimbie, Johnny Marr, Frankie Knuckles, Norman Jay, Carl Craig, Andrew Weatherall, Daniel Avery, Daddy G, Geraint Jarman, David Holmes and Andy Votel, Bryn Fôn, Justin Robertson, Crazy P Soudsystem, Horse Meat Disco, Mark Thomas, Seann Walsh, Clinic, Caitlin Rose, Wire, Stuart Maconie, Tricky, Caitlin Moran... || The Brythoniaid male voice choir (Special performances), Joe Duddell (Special performances), John Cooper Clarke (Literature and talks), DBC Pierre (Literature and talks), Paul Morley (Literature and talks), Bob Stanley (Literature and Talks), John Niven (Literature and talks), Joe Dunthorne (Literature and talks), Viv Groskop (Literature and talks)..."]}, {"page": "Sam Riviere", "response": ["* The Truth About Cats & Dogs with Joe Dunthorne (Visual Editions, 2016)"]}, {"page": "Nell Zink", "response": ["Nicotine was published in 2016. In Joe Dunthorne's review he says, \"there is a recklessness and a freshness to this complex tale that is at its best when its elements of horror and humor collide.\" In a New York Times book review, Dwight Garner praises the book, saying, \"I could listen to Ms Zink's dialogue all day; she may be, at heart, a playwright.\""]}, {"page": "Endorsements in the 2019 United Kingdom general election", "response": ["* Joe Dunthorne, novelist and poet"]}, {"page": "Nicotine (novel)", "response": ["Nicotine was generally liked by reviewers. The Independent praised its humour and commented that it \"proves Zink’s distinctive verve as mesmerising as ever\". Reviewing the book in The Guardian, Joe Dunthorne noted the speed at which she is known to write novels and hoped \"a book this good didn’t come easily\", saying that \"Zink writes with a joyful recklessness\". Vox also enjoyed her \"energetic and zingy\" prose. For Kirkus Reviews, the book was \"social satire with a sharp wit and a big heart\"."]}]}}