{"wiki_id": "http://www.wikidata.org/entity/Q1200073", "itemLabel": "Derek Mahon", "itemDescription": "Irish poet", "wikipedia_url": "https://en.wikipedia.org/wiki/Derek_Mahon", "wikipedia_page": {"main": "Derek Mahon (23 November 1941 – 1 October 2020) was an Irish poet. He was born in Belfast, Northern Ireland but lived in a number of cities around the world.  At his death it was noted that his \"influence in the Irish poetry community, literary world and society at large, and his legacy, is immense\".  President of Ireland Michael D Higgins said of Mahon \"he shared with his northern peers the capacity to link the classical and the contemporary but he brought also an edge that was unsparing of cruelty and wickedness.\"", "link_mentions": [{"page": "List of English-language poets", "response": ["*Derek Mahon (born 1941, NI)"]}, {"page": "Samuel Beckett", "response": ["In his theatre of the late period, Beckett's characters—already few in number in the earlier plays—are whittled down to essential elements. The ironically titled Play (1962), for instance, consists of three characters immersed up to their necks in large funeral urns. The television drama Eh Joe (1963), which was written for the actor Jack MacGowran, is animated by a camera that steadily closes in to a tight focus upon the face of the title character. The play Not I (1972) consists almost solely of, in Beckett's words, \"a moving mouth with the rest of the stage in darkness\".Quoted in Knowlson (1997) p522 Following from Krapp's Last Tape, many of these later plays explore memory, often in the form of a forced recollection of haunting past events in a moment of stillness in the present. They also deal with the theme of the self-confined and observed, with a voice that either comes from outside into the protagonist's head (as in Eh Joe) or else another character comments on the protagonist silently, by means of gesture (as in Not I). Beckett's most politically charged play, Catastrophe (1982), which was dedicated to Václav Havel, deals relatively explicitly with the idea of dictatorship. After a long period of inactivity, Beckett's poetry experienced a revival during this period in the ultra-terse French poems of mirlitonnades, with some as short as six words long. These defied Beckett's usual scrupulous concern to translate his work from its original into the other of his two languages; several writers, including Derek Mahon, have attempted translations, but no complete version of the sequence has been published in English.", "Of all the English-language modernists, Beckett's work represents the most sustained attack on the realist tradition. He opened up the possibility of theatre and fiction that dispense with conventional plot and the unities of time and place to focus on essential components of the human condition. Václav Havel, John Banville, Aidan Higgins, Tom Stoppard, Harold Pinter and Jon Fosse have publicly stated their indebtedness to Beckett's example. He has had a wider influence on experimental writing since the 1950s, from the Beat generation to the happenings of the 1960s and after. In an Irish context, he has exerted great influence on poets such as Derek Mahon and Thomas Kinsella, as well as writers like Trevor Joyce and Catherine Walsh who proclaim their adherence to the modernist tradition as an alternative to the dominant realist mainstream."]}, {"page": "Seamus Heaney", "response": ["In 1963 Heaney began lecturing at St Joseph's, and joined the Belfast Group, a poets' workshop organized by Philip Hobsbaum, then an English lecturer at Queen's University. Through this, Heaney met other Belfast poets, including Derek Mahon and Michael Longley."]}, {"page": "Jean Racine", "response": ["The linguistic effects of Racine's poetry are widely considered to be untranslatable,The Poetry of the untranslatable: Racine's Phèdre confronted by Hughes and Lowell - Enlighten although many eminent poets have attempted to translate Racine's work into English, including Lowell, Richard Wilbur, Ted Hughes, Tony Harrison, and Derek Mahon, and Friedrich Schiller into German."]}, {"page": "List of poets", "response": ["*Derek Mahon (1941–2020), Northern Irish poet"]}, {"page": "Tithonus", "response": ["* Tithonus is a poem by Derek Mahon, included in his Selected Poems 1990."]}, {"page": "Elpenor", "response": ["Also, Derek Mahon suggests Elpenor (but does not name him specifically) in his poem \"Lives\". Mahon talks of a decaying oar, planted in a beach, thinking of Ithaca."]}, {"page": "1991 in literature", "response": ["*Cholmondeley Award: James Berry, Sujata Bhatt, Michael Hulse, Derek Mahon"]}, {"page": "1941 in literature", "response": ["*November 23 – Derek Mahon, Irish poet (died 2020)"]}, {"page": "1965 in literature", "response": ["*Eric Gregory Award: John Fuller, Derek Mahon, Michael Longley, Norman Talbot"]}, {"page": "Glengormley", "response": ["*Derek Mahon — Irish poet who lived in Glengormley. One of his best-known poems is entitled Glengormley."]}, {"page": "Griffin Poetry Prize", "response": ["*Derek Mahon, Life on Earth"]}, {"page": "Palgrave's Golden Treasury", "response": ["Dannie Abse – Fleur Adcock – William Alexander, Earl of Stirling – Kingsley Amis – Simon Armitage – Matthew Arnold – W. H. Auden – Francis Bacon, Lord Verulam – Anna Laetitia Barbauld – George Barker – Richard Barnfield – Francis Beaumont – Patricia Beer – John Betjeman – Laurence Binyon – Thomas Blackburn – Edmund Blunden – Eavan Boland – Ronald Bottrall – Robert Bridges – George Mackay Brown – Elizabeth Barrett Browning – Robert Browning – Alan Brownjohn – Robert Burns – George Gordon Noel, Lord Byron – Norman Cameron – Roy Campbell – Thomas Campbell – Thomas Campion – Thomas Carew – Henry Carey – Lewis Carroll – Charles Causley – Colley Cibber – John Clare – Austin Clarke – Jack Clemo – Arthur Hugh Clough – Hartley Coleridge – Samuel Taylor Coleridge – John Collins – William Collins – Tony Connor – Henry Constable – David Constantine – Abraham Cowley – William Cowper – Richard Crashaw – Robert Crawford – Allan Cunningham – Samuel Daniel – George Darley – Donald Davie – W. H. Davies – Dick Davis – Thomas Dekker – Walter de la Mare – Lord De Tabley – Richard Watson Dixon – Keith Douglas – Ernest Dowson – Michael Drayton – William Drummond – John Dryden – Carol Ann Duffy – Helen Dunmore – Douglas Dunn – Lawrence Durrell – Thomas Stearns Eliot – Alistair Elliot – Jean Elliot – William Empson – D. J. Enright – Gavin Ewart – James Fenton – Roy Fisher – Edward FitzGerald – John Fletcher – Veronica Forrest-Thomson – John Fuller – Roy Fuller – Elizabeth Garrett – David Gascoyne – John Gay – Oliver Goldsmith – Robert Graham – Robert Graves – Thomas Gray – Thom Gunn – Michael Hamburger – Ian Hamilton – Thomas Hardy – Tony Harrison – Seamus Heaney – John Heath-Stubbs – George Herbert – Robert Herrick – Thomas Heywood – Geoffrey Hill – Ralph Hodgson – David Holbrook – Molly Holden – Thomas Hood – Gerard Manley Hopkins – A. E. Housman – Ted Hughes – T. E. Hulme – Elizabeth Jennings – Lionel Johnson – Ben Jonson – Patrick Kavanagh – John Keats – Sidney Keyes – Thomas Kinsella – Rudyard Kipling – James Kirkup – Charles Lamb – Walter Savage Landor – Philip Larkin – D. H. Lawrence – Edward Lear – Laurie Lee – Alun Lewis – Cecil Day-Lewis – Lady Anne Lindsay – Thomas Lodge – John Logan – Michael Longley – Richard Lovelace – Edward Lowbury – John Lyly – George MacBeth – Norman MacCaig – Hugh MacDiarmid – Louis MacNeice – Derek Mahon – Christopher Marlowe – Andrew Marvell – John Masefield – George Meredith – William Julius Mickle – John Milton – Thomas Moore – William Morris – Andrew Motion – Edwin Muir – Paul Muldoon – Carolina, Lady Nairne – Thomas Nash – Robert Nichols – Norman Nicholson – Bernard O'Donoghue – Wilfred Owen – Coventry Patmore – Tom Paulin – Ambrose Philips – Alexander Pope – Peter Porter – Jonathan Price – F. T. Prince – Matthew Prior – Craig Raine – Peter Redgrove – Henry Reed – Anne Ridler – Michael Riviere – W. R. Rodgers – Samuel Rogers – Isaac Rosenberg – Alan Ross – Christina Georgina Rossetti – Dante Gabriel Rossetti – Carol Rumens – Lawrence Sail – Siegfried Sassoon – Vernon Scannell – Sir Walter Scott – Peter Scupham – Sir Charles Sedley – George Sewell – William Shakespeare – Percy Bysshe Shelley – James Shirley – Sir Philip Sidney – Jon Silkin – C. H. Sisson – Edith Sitwell – Iain Crichton Smith – Stevie Smith – Robert Southey – Bernard Spencer – Stephen Spender – Edmund Spenser – Jon Stallworthy – Anne Stevenson – Sir John Suckling – Algernon Charles Swinburne – Joshua Sylvester – Alfred, Lord Tennyson – Dylan Thomas – Edward Thomas – R. S. Thomas – Francis Thompson – James Thomson (The Seasons) – James Thomson (B.V.) – Anthony Thwaite – Terence Tiller – Charles Tomlinson – The Shepherd Tony – Henry Vaughan – Edward Vere, Earl of Oxford – John Wain – Ted Walker – Edmund Waller – Vernon Watkins – John Webster – Robert Wells – Lawrence Whistler – Hugo Williams – George Wither – Charles Wolfe – William Wordsworth – Sir Henry Wotton – David Wright – Kit Wright – Sir Thomas Wyat – William Butler Yeats – Andrew Young"]}, {"page": "British literature", "response": ["While poets T. S. Eliot, W. H. Auden and Dylan Thomas were still publishing after 1945, new poets started their careers in the 1950s and 1960s including Philip Larkin (1922–85) (The Whitsun Weddings,1964) and Ted Hughes (1930–98) (The Hawk in the Rain, 1957). Northern Ireland has produced a number of significant poets, the most famous being Nobel prize winner Seamus Heaney. However, Heaney regarded himself as Irish and not British. Others poets from Northern Ireland include Derek Mahon, Paul Muldoon, James Fenton, Michael Longley, and Medbh McGuckian."]}, {"page": "Irish poetry", "response": ["In addition to John Hewitt, mentioned above, other important poets from Northern Ireland  include Robert Greacen (1920–2008) who, along with Valentin Iremonger, edited an important anthology, Contemporary Irish Poetry in 1949. Greacen was born in Derry, lived in Belfast in his youth and then in London during the 1950s, 1960s and 1970s. He won the Irish Times Prize for Poetry in 1995 for his Collected Poems, after he returned to live in Dublin when he was elected a member of Aosdana. Other poets of note from this time include Roy McFadden (1921–1999), a friend for many years of Greacen. Padraic Fiacc (born 1924), was born in Belfast, but lived in America during his youth. In the 1960s, and coincident with the rise of the Troubles in the province, a number of Ulster poets began to receive critical and public notice. Prominent amongst these were John Montague (born 1929), Michael Longley (born 1939), Derek Mahon (born 1941), Séamus Heaney (1939-2013) and Paul Muldoon (born 1951).", "Derek Mahon was born in Belfast and worked as a journalist, editor, and screenwriter while publishing his first books. He has published comparatively little."]}, {"page": "Irish literature", "response": ["Most attention has been given to Irish writers who wrote in English and who were at the forefront of the modernist movement, notably James Joyce, whose novel Ulysses is considered one of the most influential works of the century. The playwright Samuel Beckett, in addition to a large amount of prose fiction, wrote a number of important plays, including Waiting for Godot. Several Irish writers have excelled at short story writing, in particular Edna O'Brien, Frank O'Connor, Lord Dunsany and William Trevor. Other notable Irish writers from the twentieth century include, poets Eavan Boland and Patrick Kavanagh, dramatists Tom Murphy and Brian Friel and novelists Edna O'Brien and John McGahern. In the late twentieth century Irish poets, especially those from Northern Ireland, came to prominence including Derek Mahon, Medbh McGuckian, John Montague, Seamus Heaney and Paul Muldoon Influential works of writing continue to emerge in Northern Ireland with huge success such as Anna Burns, Sinéad Morrissey, and Lisa McGee.", "thumb|175px|Derek Mahon", "Northern Ireland has also produced a number of significant poets since 1945, including John Hewitt, John Montague, Seamus Heaney, Derek Mahon, Paul Muldoon, James Fenton, Michael Longley, Frank Ormsby, Ciarán Carson and Medbh McGuckian. John Hewitt (1907–87), whom many consider to be the founding father of Northern Irish poetry, was born in Belfast, and began publishing in the 1940s. Hewitt was appointed the first writer-in-residence at Queen's University, Belfast in 1976. His collections include The Day of the Corncrake (1969) and Out of My Time: Poems 1969 to 1974 (1974) and his Collected Poems in 1991.", "James Fenton's poetry is written in contemporary Ulster Scots, and Michael Longley (1939– ) has experimented with Ulster Scots for the translation of Classical verse, as in his 1995 collection The Ghost Orchid. Longley has spoken of his identity as a Northern Irish poet: \"some of the time I feel British and some of the time I feel Irish. But most of the time I feel neither and the marvellous thing about the Good Friday agreement was that it allowed me to feel more of each if I wanted to.\" He was awarded the Queen's Gold Medal for Poetry in 2001. Medbh McGuckian's, (born Maeve McCaughan, 1950) first published poems appeared in two pamphlets in 1980, the year in which she received an Eric Gregory Award. Medbh McGuckian's first major collection, The Flower Master (1982), was awarded a Rooney prize for Irish Literature, an Ireland Arts Council Award (both 1982) and an Alice Hunt Bartlett Prize (1983). She is also the winner of the 1989 Cheltenham Prize for her collection On Ballycastle Beach, and has translated into English (with Eiléan Ní Chuilleanáin) The Water Horse (1999), a selection of poems in Irish by Nuala Ní Dhomhnaill. Among her recent collections are The Currach Requires No Harbours (2007), and My Love Has Fared Inland (2008). Paul Muldoon (1951– ) has published over thirty collections and won a Pulitzer Prize for Poetry and the T. S. Eliot Prize. He held the post of Oxford Professor of Poetry from 1999 to 2004. Derek Mahon's (1941– ) first collection Twelve Poems appeared in 1965. His poetry, which is influenced by Louis MacNeice and W. H. Auden, is \"often bleak and uncompromising\".The Oxford Companion to English Literature, ed. Margaret Drabble, (Oxford: Oxford University Press, 1996), p.616. Though Mahon was not an active member of The Belfast Group, he associated with the two members, Heaney and Longley, in the 1960s.The Oxford Companion to English Literature, (1996), p.616; beck.library.emory.edu/BelfastGroup/web/html/overview.html Ciarán Carson's poem Belfast Confetti, about the aftermath of an IRA bomb, won The Irish Times Irish Literature Prize for Poetry in 1990."]}, {"page": "List of Irish poets", "response": ["* Derek Mahon (1941–2020, E)"]}]}}