{"wiki_id": "http://www.wikidata.org/entity/Q12065907", "itemLabel": "Jacki Piper", "itemDescription": "British actress (1946-)", "wikipedia_url": "https://en.wikipedia.org/wiki/Jacki_Piper", "wikipedia_page": {"main": "Jacqueline Crump (born 3 August 1946), known professionally by her stage name Jacki Piper, is an English actress, best known for her appearances as the female juvenile lead in the British film comedies Carry On Up the Jungle (1970), Carry On Loving (1970), Carry On at Your Convenience (1971), and Carry On Matron (1972).", "link_mentions": [{"page": "The Two Ronnies", "response": ["As the series gathered more popularity, the sketches began to feature more famous and well-known British actors, including John Cleese, Patrick Troughton, Jacki Piper, Stratford Johns, Joan Sims, Patricia Routledge, Jenny Agutter and Lynda Baron, Ronnie Barker's co-star in Open All Hours."]}, {"page": "Carry On at Your Convenience", "response": ["Vic's dim stooge Bernie Hulke (Bernard Bresslaw) provides bumbling assistance in both his union machinations and his attempts to woo Sid's daughter, factory canteen worker Myrtle (Jacki Piper). She is torn between Vic and Lewis Boggs, who is something of a playboy but insists he loves her.", "*Jacki Piper as Myrtle Plummer", "After Sid James's character was criticised for leering at some girls in Carry On Henry (1971), here his character was changed to the put-upon family man similar to the character he portrayed in the TV sitcom Bless This House. In the next film Carry On Matron (1972) his character was preoccupied with thieving, but made odd suggestive comments to nurses (including one played by Jacki Piper, who played his daughter in this film). Sid's girl-chasing persona was fully reinstated for subsequent films."]}, {"page": "List of people from Birmingham", "response": ["*Jacki Piper – Actress"]}, {"page": "Return of the Saint", "response": ["| 1–14 || 10 December 1978 || \"Tower Bridge is Falling Down\" || John Woodvine, Alfie Bass, Paul Maxwell, Jacki Piper, Alan Browning, Neil Hallett, Johnnie Wade"]}, {"page": "Carry On Up the Jungle", "response": ["Carry On Up the Jungle is a 1970 British adventure comedy film, the 19th release in the series of 31 Carry On films (1958–1992). The film marked Frankie Howerd's second and final appearance in the series. He stars alongside regular players Sid James, Charles Hawtrey, Joan Sims, Terry Scott and Bernard Bresslaw. Kenneth Connor returns to the series for the first time since Carry On Cleo six years earlier and would now feature in almost every entry up to Carry On Emmannuelle in 1978. Jacki Piper makes the first of her four appearances in the series. This movie is a send-up of the classic Tarzan films. It features an unusually dark tone for the series, as the protagonists are faced with certain death after they are apprehended by a cannibalistic tribe in the jungle.", "Camp ornithologist Professor Inigo Tinkle (Frankie Howerd) tells a less-than-enraptured audience about his most recent ornithological expedition to the darkest, most barren regions of the African wilds in search for the legendary Oozlum bird, which is said to fly in ever decreasing circles until it disappears up its own rear end. Financing the expedition is Lady Evelyn Bagley (Joan Sims) and the team are led by the fearless (and lecherous) Bill Boosey (Sid James) and his slow-witted African guide Upsidasi (Bernard Bresslaw in blackface). Also on the expedition is Tinkle's idiotic assistant, Claude Chumley (Kenneth Connor) and June (Jacki Piper), Lady Bagley's beautiful but unappreciated maidservant. The journey does not get off to a good start, with a mad gorilla terrorising the campsite and the travellers' realising they have ventured into the territory of the bloodthirsty \"Noshas\", a tribe of feared cannibals.", "* Jacki Piper as June"]}, {"page": "Jack Douglas (actor)", "response": ["On 26 April 2007, Douglas celebrated his 80th birthday. There was a special celebration arranged at Pinewood Studios, to coincide with his anniversary, which was attended by his family and friends. These included actors that Douglas had worked with; amongst them were Fenella Fielding, Jacki Piper, Lance Percival and Valerie Leon."]}, {"page": "Carry On Loving", "response": ["Timid Bertram Muffet (Richard O'Callaghan) winds up with model Sally Martin (Jacki Piper) after the agency muddles his directions to a blind date. Client Terry Philpott (Terry Scott) suffers several failures in his dealings with the agency including a disastrous meeting with prim, sheltered Jenny Grubb (Imogen Hassall). Jenny moves in with Sally, undergoes a makeover, and becomes a model. Terry later finds romance with the \"new\" Jenny.", "*Jacki Piper as Sally Martin"]}, {"page": "Carry On Matron", "response": ["The much put-upon Sister (Jacki Piper) desperately tries to keep the ward in order, while Cutting's secretary, Miss Banks (Patsy Rowlands) keeps her employer in check, but nothing can cool his pent-up desire to prove himself as a man, and it's Matron who's in his sights. The criminal gang don disguises—Sid dresses as the foreign \"Dr Zhivago\" and Ernie as a heavily expectant mum—but the crime is thwarted by the mothers-to-be. The medical hierarchy's threat to call the police is halted when Sid reveals the heroine of the day is a man, and the hospital realise they would suffer nationwide humiliation if anyone found out. Cyril weds his shapely nurse Susan, and Matron finally gets her doctor.", "*Jacki Piper as Sister"]}, {"page": "List of Carry On films cast members", "response": ["* Jacki Piper (4) played the female romantic leads in Up the Jungle, Loving and At Your Convenience and a large supporting role Matron.", "!Shirley Eaton!!Eric Barker!!Bill Owen!!Terence Longdon!!Leslie Phillips!!June Whitfield!!Esma Cannon!!Liz Fraser!!Dilys Laye!!Angela Douglas!!Jacki Piper!!Kenneth Cope!!Bernard Cribbins"]}, {"page": "List of adventure films of the 1970s", "response": ["|Carry On Up the Jungle||Gerald Thomas||Frankie Howerd, Sid James, Charles Hawtrey, Joan Sims, Jacki Piper||United Kingdom||Adventure comedy"]}, {"page": "Doctor in Trouble", "response": ["* Jacki Piper as Girl in taxi"]}, {"page": "Mr. Love", "response": ["* Jacki Piper as Ida"]}, {"page": "The Love Ban", "response": ["* Jacki Piper as Pregnant Woman"]}, {"page": "Run for Your Wife (2012 film)", "response": ["*Jacki Piper - Nurse"]}, {"page": "Piper (surname)", "response": ["* Jacki Piper (born 1946), British actor"]}, {"page": "Richard Jackson (theatrical producer)", "response": ["*Marry Me You Idiot with Lynda Bellingham and Jacki Piper (Jermyn Street) 2002."]}, {"page": "The Rough with the Smooth", "response": ["* Jacki Piper as Helen"]}]}}