{"wiki_id": "http://www.wikidata.org/entity/Q1208781", "itemLabel": "Diana Athill", "itemDescription": "literary editor, novelist, memoirist (1917-2019)", "wikipedia_url": "https://en.wikipedia.org/wiki/Diana_Athill", "wikipedia_page": {"main": "Diana Athill  (21 December 1917 – 23 January 2019) was a British literary editor, novelist and memoirist who worked with some of the greatest writers of the 20th century at the London-based publishing company Andre Deutsch Ltd.", "link_mentions": [{"page": "Norfolk", "response": ["* Diana Athill, literary editor and author, South Norfolk and Ditchingham"]}, {"page": "Jean Rhys", "response": ["After a long absence from the public eye, she was rediscovered by Selma Vaz Dias, who in 1949, placed an advertisement in the New Statesman asking about her whereabouts, with a view to obtaining the rights to adapt her novel Good Morning, Midnight for radio. Rhys responded, and thereafter developed a long-lasting and collaborative friendship with Vaz Dias, who encouraged her to start writing again. This encouragement ultimately led to the publication in 1966 of her critically acclaimed novel Wide Sargasso Sea. She intended it as an account of the woman whom Rochester married and kept in his attic in Jane Eyre. Begun well before she settled in Bude, the book won the notable WH Smith Literary Award in 1967. She returned to themes of dominance and dependence, especially in marriage, depicting the mutually painful relationship between a privileged English man and a Creole woman from Dominica made powerless on being duped and coerced by him and others. Both the man and the woman enter marriage under mistaken assumptions about the other partner. Her female lead marries Mr. Rochester and deteriorates in England as the \"madwoman in the attic\". Rhys portrays this woman from a quite different perspective from the one in Jane Eyre. Diana Athill of André Deutsch gambled on publishing Wide Sargasso Sea. She and the writer Francis Wyndham helped to revive interest in Rhys's work.Preliminary page in Jean Rhys, Quartet, Penguin: 2000,  There have been film, operatic and radio adaptations of the book.Brian Kellow,\"On the Beat: A novel that sings: Jean Rhys's Wide Sargasso Sea\", Opera News, December 2012 — Vol. 77, No. 6.\"Jean Rhys – Wide Sargasso Sea\", RadioListings.\"Jean Rhys – Wide Sargasso Sea\", BBC Radio 4 Extra. "]}, {"page": "1917 in literature", "response": ["**Diana Athill, English author and editor (died 2019)"]}, {"page": "PEN/Ackerley Prize", "response": ["* 1987: Diana Athill, After the Funeral"]}, {"page": "National Book Critics Circle Award", "response": ["|2009 || Diana Athill || Somewhere Towards the End", "* Diana Athill, Somewhere Towards the End (Norton)"]}, {"page": "Gitta Sereny", "response": ["The Case of Mary Bell was first published in 1972 following Mary Bell's trial; in it Sereny interviewed her family, friends and the professionals involved in looking after Mary during her trial. This book was edited by Diana Athill who would also edit Sereny's Into That Darkness."]}, {"page": "Royal Society of Literature", "response": ["| Diana Athill OBE"]}, {"page": "Brian Moore (novelist)", "response": ["Moore has been the subject of two biographies: Brian Moore: The Chameleon Novelist (1998) by Denis Sampson and Brian Moore: A Biography (2002) by Patricia Craig. Brian Moore and the Meaning of the Past (2007) by Patrick Hicks provides a critical retrospective of Moore's works. Information about the publishing of Moore's novel Judith Hearne, and the break-up of his marriage can be found in Diana Athill's memoir Stet (2000).Athill, Diana (2000) Stet: a memoir, London: Granta "]}, {"page": "Wide Sargasso Sea", "response": ["Rhys' editor Diana Athill discusses the events surrounding the publication of the book in her memoir. The book came out of a friendship between Rhys and Selma Vaz Dias who encouraged her to start writing again. At the time, Rhys was living in a shack made of corrugated iron and tar paper in a slum neighborhood of Cheriton Fitzpaine. The book was virtually completed in November 1964 when Rhys, who was 74 years old and complained of the cold and rain in her shack, suffered a heart attack. Athill cared for Rhys in the hospital for two years, keeping a promise not to publish the book until Rhys was well enough to compile the manuscript and add a few final lines. The income from the book provided enough money for Rhys to improve her living conditions."]}, {"page": "Literary Review", "response": ["Contributors to the magazine have included Diana Athill, Kingsley Amis, Martin Amis, Beryl Bainbridge, John Banville, Julian Barnes, Maile Chapman, Hilary Mantel, John Mortimer, Malcolm Bradbury, A. S. Byatt, Paul Johnson, David Starkey, John Gray, Robert Harris, Nick Hornby, Richard Ingrams, Joseph O'Neill, Lynn Barber, Derek Mahon, Oleg Gordievsky, John Sutherland and D. J. Taylor.  Recently published authors of new fiction include William Trevor, Claire Keegan and Nicola Barker."]}, {"page": "Imagine (TV series)", "response": ["* \"Diana Athill - Growing Old Disgracefully\""]}, {"page": "André Deutsch", "response": ["His small but influential publishing house was active until the 1990s, and included books by Jack Kerouac, Wole Soyinka, Earl Lovelace, Norman Mailer, George Mikes, V. S. Naipaul, Ogden Nash, Andrew Robinson, Philip Roth, Art Spiegelman, John Updike, Margaret Atwood, Charles Gidley Wheeler, Helene Hanff, Peter Benchley, Leon Uris, Molly Keane, Michael Rosen, Quentin Blake, John Cunliffe, and Ludwig Bemelmans.\"Andre Deutsch CBE\", Andre Deutsch.Com. Deutsch employed dedicated editor Diana Athill, who in 1952 was a founding director of the publishing company that was given his name (and who in her memoir Stet described him as \"possibly the most difficult man in London\").Meany, Helen, \"Deutsch courage\", The Irish Times, 23 September 2000. A number of book series were established including The Language Library,The Language Library (Andre Deutsch) - Book Series List, publishinghistory.com. Retrieved 16 September 2018.\"English Words\", The Guardian, 13 July 1954, p. 4. Grafton Books (works on librarianship, bibliography and book collecting)A Grafton Book, worldcat.org. Retrieved 24 November 2019. and the Introduces guides.Introduces (Andre Deutsch) - Book Series List, publishinghistory.com. Retrieved 16 September 2018.Gillon, Diana and Meir, \"Mutually inscrutable\", The Guardian, 12 November 1965, p. 9."]}, {"page": "Michael X", "response": ["Michael X plays a part in Make Believe: A True Story (1993), a memoir by Diana Athill."]}, {"page": "Liane de Pougy", "response": ["Upon her marriage to Prince Georges Ghika on 8 June 1910 she became Princess Ghika; eighteen years into their marriage, her husband left her for another woman, but the following year he came back to her. Pougy does not explain in her Notebooks the circumstances surrounding his return. Her son's death as an aviator in World War I turned her more deeply towards religion.  After her husband and she stumbled onto the Asylum of Saint Agnes while driving through Savoy in 1928, she became deeply involved in this institution devoted to the care of children with birth defects. Thanks to Pougy's fundraising efforts, Coco Chanel became the \"leading benefactress\" of the asylum. The couple moved to Lausanne, Switzerland, during World War II where they reconnected with Father Rzewuski, a Dominican priest who became \"her confidant from whom she hoped to get help for the advancement of her religious and spiritual life.\" Pougy became a tertiary of the Order of Saint Dominic as Sister Anne-Mary after her husband's death. She died in Lausanne, Switzerland on 26 December 1950 and was buried in the enclosure of the sisters of the Sainte-Agnès asylum in Saint-Martin-le-Vinoux. Her memoirs, Mes cahiers bleus, were translated into English by Diana Athill and published by Andre Deutsch.", "*My Blue Notebooks (Mes cahiers bleus); translated by Diana Athill, foreword by R. P. Rzewuski, (Andre Deutsch, 1979) "]}, {"page": "Grendel (novel)", "response": ["It was given special mention by Diana Athill in her memoir Stet, covering her decades as an editor with UK publisher André Deutsch. \"Having to read Beowulf almost turned me against Oxford, so when a New York agent offered me this novel I could hardly bring myself to open it. If I hadn't, I would have missed a great pleasure – a really powerful feat of imagination.\""]}, {"page": "Ian Jack", "response": ["After a false start as a would-be librarian, he joined The Glasgow Herald as a trainee journalist in 1965 and after a short spell in its head office was sent to work on two weekly papers in Lanarkshire, the now-defunct Cambuslang Advertiser and the East Kilbride News. Later he worked for the Scottish Daily Express at its Glasgow offices. In 1970, he joined The Sunday Times in London, where he became a section editor and then a foreign correspondent-cum-feature writer with a special interest in South Asia and particularly India, which he began to visit in the mid 1970s. From 1986 to 1989, he wrote for The Observer and Vanity Fair, and then joined the team that created The Independent on Sunday, which he edited from 1991 to 1995. His editorship of the quarterly Granta magazine, to which he had previously contributed as a writer, spanned 47 issues over twelve years to 2007. While at Granta, Jack also commissioned and edited books by Diana Athill, Simon Gray, Janet Malcolm and Travis Elborough, among others. He has contributed regularly to The Guardian since 2001, and began to write a weekly column for the paper six years later. He occasionally teaches at the India Institute, King's College London."]}, {"page": "Costa Book Awards", "response": ["|align=\"left\"|Diana AthillSomewhere Towards the End"]}, {"page": "Benson Medal", "response": ["*Diana Athill"]}, {"page": "Transatlantic Review (1959–1977)", "response": ["B. S. Johnson was eventually the sole poetry editor and assembled the feature \"New Transatlantic Poetry\".  He also proposed the annual Erotica competition, which was open to fiction, poetry and illustration. Prize-winners included Paul Ableman, Diana Athill, Gavin Ewart, Giles Gordon, D. M. Thomas, Jerry Stahl, Jay Jeff Jones, Trevor Hoyle, Patrick Hughes and Steve Barthelme."]}, {"page": "Marie-Louise von Motesiczky", "response": ["Diana Athill wrote about her friendship with Motesiczky in her memoir 'Somewhere Towards the End' (Granta, 2008)."]}, {"page": "Great Lives", "response": ["|Diana Athill, British literary editor, novelist & memoirist"]}, {"page": "1917 in the United Kingdom", "response": ["* 21 December – Diana Athill, author (died 2019)"]}, {"page": "Edward Field (poet)", "response": ["British editor Diana Athill's Instead of a Book: Letters to a Friend (Granta Books, 2011) is a collection of letters from her to Field chronicling their intimate correspondence spanning more than 30 years.\"Diana Athill introduces Instead of a Book: Letters to a Friend\", YouTube, November 3, 2011.\"Diana Athill's letters: Dear Edward – Missives about everything, including the kitchen sink\", The Economist, October 29, 2011."]}, {"page": "Carroll & Graf Publishers", "response": ["* Diana Athill"]}, {"page": "Imbert-Terry baronets", "response": ["The first Baronet's sister, Mary Anne Abbot Imbert-Terry (1844–1936), married Rev. Herbert Athill, rector of Digswell, Herts., and was thus paternal grandmother of the literary editor and writer Diana Athill.Burke's Peerage, Baronetage and Knightage, 2003, vol. 2, p. 2029Legacies of British Slave-ownership: Colonial Slavery and the Formation of Victorian Britain, Catherine Hall et al, Cambridge University Press, 2014, pp. 37, 66–67The History of the Island of Antigua, vol. I, Vere Langford Oliver, 1894, pp. 10–13"]}, {"page": "Diana (name)", "response": ["*Diana Athill, British literary editor, novelist and memoirist"]}, {"page": "Stet", "response": ["* Stet: a memoir, a 2000 book by Diana Athill"]}, {"page": "List of atheist authors", "response": ["* Diana Athill (1917–2019): British literary editor, novelist and memoirist who worked with some of the writers of the 20th century.\"Last week, looking through a book about 15th-century painting in Italy, I began to wonder why I loved these paintings so much. Almost all of them are illustrations of religious subjects, and I have been an atheist almost since the day I was confirmed in the Christian faith by the Bishop of Norwich in 1931. To describe the atheism first: it originated in a certainty that I was going to start breaking the rules as laid down by the god I'd been taught about, followed by a suspicion that if his rules were so easy to break he couldn't be all that he was cracked up to be. Then came its firmer base: the observation that many of the most hideous things done to each other by human beings have been done in his name. It can be argued that this is our fault, not God's. But the god we Europeans are supposed to believe in a) created us as well as everything else that is; b) is omnipotent; c) is Love. In which case, one must assume from the evidence rammed down our throats for century after century that he is liable to fits of serious derangement during which he is Not Himself.\" Diana Athill, 'I'm a believer – but only in a good story', The Guardian, January 21, 2004, Features Pages, p. 5."]}, {"page": "List of atheists (surnames A to B)", "response": ["|\"I have been an atheist almost since the day I was confirmed in the Christian faith by the Bishop of Norwich in 1931.\"Diana Athill, 'I'm a believer - but only in a good story', The Guardian, 21 January 2004, Features Pages, Pg. 5."]}, {"page": "Gale Benson", "response": ["Benson is a central character in Diana Athill's memoir of her friendship with Gale's lover, Hakim Jamal, Make Believe: A True Story.Athill, Diana, Make Believe: A True Story, London: Sinclair-Stevenson, 1993."]}, {"page": "2009 New Year Honours", "response": ["* Diana Athill, Literary Editor and Author. For services to Literature."]}, {"page": "2008 Costa Book Awards", "response": ["*Diana Athill, Somewhere Towards the End"]}, {"page": "Nigel Hamilton (author)", "response": ["He then attended Munich University and Trinity College, Cambridge, where he received an honours degree in history and a master's degree.  Subsequently, he trained under André Deutsch and Diana Athill as a book publisher at André Deutsch Publishers.  After leaving Deutsch, he taught at a school in Greenwich where he assisted in reviving the historic borough on the River Thames. Hamilton opened a bookstore and began writing with his mother, Olive Hamilton, the first history of Greenwich in nearly a century, Royal Greenwich. He wrote several more guide books and edited the arts page in a London newspaper."]}, {"page": "English PEN", "response": ["Past winners include Alison Light's A Radical Romance (2020),Chandler, Mark (19 August 2020)\"Light's Radical Romance wins PEN Ackerley Prize\"The Bookseller Yrsa Daley-Ward's The Terrible (2019),Chandler, Mark (10 July 2019)  \"Daley Ward wins PEN Ackerley Prize\" The Bookseller Richard Beard's The Day That Went Missing (2018),11 July 2018 \"Richard Beard awarded PEN Ackerley Prize 2018 for ‘The Day That Went Missing’\" English PEN Amy Liptrot's The Outrun (2017),Onwuemezi, Natasha (6 July 2017)  \"Liptrot's 'exhilarating' memoir wins PEN Ackerley Prize\" The Bookseller Alice Jolly's Dead Babies and Seaside Towns (2016),Flood, Allison (13 July 2016). \"Crowd-funded memoir wins £3,000 PEN Ackerley prize\" The Guardian Henry Marsh's Do No Harm (2015),Page, Benedicte (30 June 2015) \"Marsh wins PEN Ackerley Prize\" The Bookseller Sonali Deraniyagala's The Wave (2014),Travis, Ben (15 July 2014)  \"Sonali Deraniyagala wins the 2014 PEN/Ackerley Prize for tsunami memoir\" The Telegraph Richard Holloway's Leaving Alexandria (2013),Farrington, Joshua (18 July 2013)  \"Holloway memoir wins PEN/Ackerley Prize\" The Bookseller Duncan Fallowell's How To Disappear (2012),19 July 2012  \"Duncan Fallowell wins PEN/Ackerley Prize 2012\" English PEN Michael Frayn's My Father's Fortune (2011),Irvine, Lindesay (22 July 2011)  \"Michael Frayn's memoir of his father wins autobiography prize \" The Guardian Gabriel Weston's Direct Red (2010),Trust Me, I'm a Doctor - Miss Gabriel Weston BBC Two Julia Blackburn's The Three of Us (2009),Julia Blackburn | Authors | Faber & Faber Miranda Seymour's In My Father's House (2008),12 June 2008 \"Miranda Seymour wins Ackerley Prize\" English PEN Brian Thompson's Keeping Mum (2007),Richardson, Anna (19 July 2007  \"Thompson wins PEN/Ackerley prize\" The Bookseller Alan Bennett's Untold Stories (2006), Jonathan Gathorne-Hardy's Half an Arch (2005),Catling, Patrick (4 September 2005)  \"Too good for Mills & Boon\" The Telegraph Bryan Magee's Clouds of Glory (2004), Jenny Diski's Stranger on a Train (2003), Michael Foss' Out of India (2002), Lorna Sage's Bad Blood (2001), Mark Frankland's Child Of My Time (2000), Margaret Forster's Precious Lives (1999), Katrin Fitzherbet's True To Both My Selves (1998), Tim Lott's The Scent of Dried Roses (1997), Eric Lomax's The Railway Man (1996), Paul Vaughan's Something in Linoleum (1995), Blake Morrison's And When Did You Last See Your Father? (1994), Barry Humphries' More Please (1993), John Osborne's Almost a Gentleman (1992), Paul Binding's St Martin's Ride (1991), Germaine Greer's Daddy, We Hardly Knew You (1990), John Healy's The Grass Arena (1989), Anthony Burgess' Little Wilson and Big God (1988), Diana Athill After a Funeral (1987), Dan Jacobson's Time and Time Again (1986), Angelica Garnett's Deceived with Kindness (1985), Richard Cobb's Still Life (1984), Kathleen Dayus' Her People (1982), Ted Walker's High Path (1983), and Edward Blishen's Shaky Relations (1982)."]}, {"page": "A Flag on the Island", "response": ["A Flag on the Island is a collection of short stories written by V.S. Naipaul, and first published by André Deutsch in 1967.  It includes the title novella, \"A Flag on the Island,\" outtakes from previous books such as \"The Enemy\", from Miguel Street, and pieces published in periodicals in Britain or the United States. The book is dedicated to Diana Athill."]}, {"page": "Ditchingham Hall", "response": ["The writer Diana Athill was brought up in Ditchingham Hall.Diana Athill: Being the other woman was what I was best at - Telegraph Retrieved 2016-11-01. The Great Storm of 1987 did great damage to the estate trees according to the German author W. G. Sebald who was visiting at the time."]}, {"page": "List of centenarians (authors, editors, poets and journalists)", "response": ["|Diana Athill || 1917–2019 || 101 || British literary editor, novelist and memoirist"]}, {"page": "Beer in the Snooker Club", "response": ["According to author Diana Athill, Beer in the Snooker Club is \"a classic of the literature of emigration.\"http://www.serpentstail.com/book?id=11001  Serpents Tail. Diana Athill.", "* Diana Athill. After a Funeral. London: Cape, 1986. - winner of the J. R. Ackerley Prize for Autobiography"]}]}}