{"wiki_id": "http://www.wikidata.org/entity/Q1200131", "itemLabel": "Derek Shulman", "itemDescription": "Scottish musician and singer", "wikipedia_url": "https://en.wikipedia.org/wiki/Derek_Shulman", "wikipedia_page": {"main": "Derek Victor Shulman (born 11 February 1947) is a Scottish musician and singer, multi-instrumentalist, and record executive.  From 1970 to 1980, he was lead vocalist for the band Gentle Giant.", "link_mentions": [{"page": "February 11", "response": ["*  1947   – Derek Shulman, Scottish singer-songwriter and producerLarkin 2011, p. 2371"]}, {"page": "1947", "response": ["** Derek Shulman, Scottish musician (Gentle Giant)"]}, {"page": "Bon Jovi", "response": ["thumb|right|Derek Shulman, who signed Bon Jovi to their first record deal.", "Once the band began playing showcases and opening for local talent, they caught the attention of record executive Derek Shulman, who signed them to Mercury Records and who was part of the PolyGram company. Because Jon Bon Jovi wanted a group name, Pamela Maher, a friend of Richard Fischer and an employee of Doc McGhee, suggested they call themselves Bon Jovi, following the example of the other famous two-word bands such as Van Halen. This name was chosen instead of the original idea of Johnny Electric. Pamela's suggestion of the name was met with little enthusiasm, but two years later they hit the charts under that name."]}, {"page": "Dream Theater", "response": ["In January 1991, the band received a demo tape from Kevin James LaBrie, of glam metal band Winter Rose. The band had received the tape just before they were about to commit to another singer. The band was so impressed by his demo that he was flown from Canada to New York for an audition. LaBrie jammed on three songs with the band, and was immediately hired to fill the vocalist position. Once recruited, LaBrie decided to drop his first name to avoid confusion with the other Kevin in the band. For the next few months, the band returned to playing live shows (still mostly around NYC), while working on vocal parts for the music written before acquiring LaBrie. Derek Shulman and Atco Records (now East West), a division of Elektra Records, signed Dream Theater to a seven-album contract based on a three-song demo (later made available as \"The Atco Demos\" through the Dream Theater fan club)."]}, {"page": "Jethro Tull (band)", "response": ["Gentle Giant's Derek Shulman put Jethro Tull as one of the greatest bands in progressive rock history. After touring with the band in 1972, Shulman praised the band as musicians and friends. Nick Cave is a fan of Jethro Tull, having named one of his sons Jethro in honour of the group.  His group, Grinderman, also covered \"Locomotive Breath\" during soundchecks. At Cave's own request, Ian Anderson presented him with his Album of the Year trophy at the MOJO Awards in 2008."]}, {"page": "Pantera", "response": ["After being turned down \"28 times by every major label on the face of the Earth\", Atco Records representatives Mark Ross and Stevenson Eugenio were asked by their boss Derek Shulman, who was interested in signing Pantera, to see the band perform in Texas. Ross was so impressed by the band's performance that he called his boss that night, suggesting that the band should be signed to the label. Atco Records accepted, and at the conclusion of 1989, the band recorded its major label debut at Pantego Studios and hired Terry Date to produce it, in large part because of his work with Soundgarden, Metal Church and Overkill, the latter of whose latest album at the time The Years of Decay was one of the sources of inspiration behind Pantera's transition away from glam/traditional heavy metal to thrash/groove metal, as well as Diamond Darrell's guitar tone on the album."]}, {"page": "Cowboys from Hell", "response": ["Writing sessions for Cowboys from Hell took place throughout 1988 and 1989. After being turned down \"28 times by every major label on the face of the Earth\", Atco Records representative Mark Ross was asked by his boss, Derek Shulman (who was interested in signing Pantera), to see the band perform after Hurricane Hugo stranded him in Texas. Ross was so impressed by the band's performance that he called his boss that night, suggesting that Pantera be signed to the label."]}, {"page": "1947 in music", "response": ["*February 11 – Derek Shulman (Gentle Giant)"]}, {"page": "Ian Anderson", "response": ["In 2011, with the end of Jethro Tull touring, and the question of his friend Derek Shulman (whatever happened to Gerald Bostock?), Anderson begun to produce a sequel to Thick as a Brick (1972), titled Thick as a Brick 2 or TAAB2, was released on 3 April 2012. It is billed as being performed by Jethro Tull's Ian Anderson instead of being a Jethro Tull album proper. Anderson toured performing both albums in their entirety. A trailer for TAAB2 was posted on YouTube."]}, {"page": "Roadrunner Records", "response": ["The 1990s saw the arrival of acts such as Life of Agony, Machine Head, Suffocation, Type O Negative, and underground grunge rockers Willard. As the 1990s wore on, several of Roadrunner's bands managed to make an impact on the mainstream, most notably Sepultura and Type O Negative. Sepultura's 1993 album, Chaos A.D., became the first Roadrunner band to crack the Top 40 on the Billboard album chart. Type O Negative became the first Roadrunner band to receive a certification from the RIAA; this was a Gold award (and later Platinum award) for the 1993 album Bloody Kisses, which was certified in 1995. The band also became the first Roadrunner band to receive radio play. In 2000, Slipknot became the first Roadrunner band to go Platinum. Nickelback were also very successful on the label, although they were signed to another label in their native Canada.  Derek Shulman ran the label in the late '90s."]}, {"page": "Cinderella (band)", "response": ["Cinderella was formed in 1982 in Philadelphia suburb, Clifton Heights, Pennsylvania, by singer-songwriter, keyboardist, and guitarist Tom Keifer and bassist Eric Brittingham. The initial lineup also included guitarist Michael Schermick and drummer Tony Destra. In 1985, Shermick and Destra left to form Britny Fox, another Philadelphia-based glam metal band. Cinderella practiced in the attic of the American Legion building in Wayne, PA. In a 2014 interview, Tom Keifer stated that Kiss bass guitarist Gene Simmons first took interest in the band and tried to get them a deal with PolyGram, but they were not interested. Jon Bon Jovi saw them perform at the Empire Rock Club in Philadelphia and talked to his A&R man, Derek Shulman about seeing the group.  Shulman was not convinced at first either, and wanted to sign the band to a six-month development deal. But after extensive negotiations, he finally signed the band.Newall, Mike (March 10, 2005). \"Hit Paraders \". Philadelphia City Paper. Retrieved on May 23, 2007. In 1985, with a recording contract with Mercury/Polygram Records in the works, guitarist Jeff LaBar and drummer Jim Drnec joined the band."]}, {"page": "Gentle Giant", "response": ["The core of what was to become Gentle Giant comprised three brothers: Phil Shulman (born 27 August 1937), Derek Shulman (born 11 February 1947) and Ray Shulman (born 8 December 1949). The brothers were of Scottish-Jewish descent. Phil and Derek were born in the Gorbals, which was then a notorious slum area of Glasgow, Scotland. The family moved to Portsmouth, England, where Ray was born. Their father was an army musician turned jazz trumpeter, who continued his musical work in Portsmouth.  He encouraged his sons to learn various instruments; and Phil, Derek, and Ray all became multi-instrumentalists. During the early 1960s, Derek and Ray became interested in playing rhythm-and-blues and formed a band together. Phil — originally acting as a manager figure in order to look after his much younger brothers — eventually became a band member himself.", "By 1966, the Shulmans' band — initially called the Howling Wolves, then the Road Runners — had taken on the name of Simon Dupree and the Big Sound and were pursuing more of a soul/pop direction. As lead singer and frontman, Derek Shulman took on the 'Simon Dupree' pseudonym while Phil played saxophone and trumpet, and youngest brother Ray played guitar and violin. (Both Ray and Phil also played trumpet and sang backing vocals for the group which, during its lifetime, briefly featured the future Elton John as pianist as well as recording a single with Dudley Moore as guest). Signing to the EMI record label, Simon Dupree and the Big Sound produced several non-charting singles before being pushed by their management and label in the direction of psychedelia. This resulted in the UK Top 10 hit \"Kites\" in the autumn of 1967 (and the release of the Without Reservation album later in the year).", "Success only served to frustrate the Shulman brothers, who considered themselves to be blue-eyed soul singers and felt that their change of style was insincere and insubstantial. Derek Shulman was later to describe \"Kites\" as \"utter shit\".\" The Shulmans' opinion was confirmed, in their eyes, by the successive failure of follow-up singles to \"Kites\". Attempting to escape their new image, they released a pseudonymous double A-side single in late 1968 as the Moles - \"We Are the Moles (parts 1 & 2)\". This compounded their identity crisis as the single was subsequently caught up in a rumour that the Moles were, in fact, the Beatles recording under a different name and with Ringo Starr as lead singer. The rumour was eventually debunked by Pink Floyd leader Syd Barrett, who outed Simon Dupree and the Big Sound as the band behind the record.", "The new band also featured three lead vocalists. Derek Shulman sang in a tough rhythm-and-blues style and generally handled the more rock-oriented vocals; Phil Shulman handled the more folk-or-jazz-influenced songs; and Kerry Minnear (who had a particularly delicate voice) sang the lighter folk and chamber-classical lead vocals. Minnear did not sing lead vocals at live concerts, because of his inability to support and project his voice at a level suitable for live amplification (Derek and Phil Shulman handled Minnear's lead vocal parts when the band played live). It has been reported that Elton John unsuccessfully auditioned for lead vocalist with the newly formed group.", "Gentle Giant was followed in 1971 by Acquiring the Taste. This second album showcased a band who were developing rapidly. Far more experimental and dissonant than its predecessor, Acquiring the Taste was shaped primarily by Kerry Minnear's broad classical and contemporary classical music training.  It also showed the band expanding their already impressive instrumental palette (although many years later Derek Shulman would admit \"we recorded [Acquiring the Taste] without any idea of what it would be like before we got into the studio. It was a very experimental album and we still didn't have an ultimate direction\".)\" The band's sense of challenge was made evident in the liner notes to Acquiring the Taste, which contained a particularly lofty statement of intent even by progressive rock standards. Producer Tony Visconti has claimed authorship of this liner note as well as the \"giant\" story accompanying the first album(source: \"Bowie Bolan and the Brooklyn Boy\" [book], Visconti)", "Before embarking on the Octopus tour, the band played a grueling set of dates supporting Black Sabbath, during which they proved to be very unpopular with the majority of the headlining band's fans. Derek Shulman recalled, \"It was perhaps the most ridiculous pairing of groups ever in the history of show business. For the most part we got booed off the stage\". Following the tour, Gentle Giant underwent their most significant line-up change when a burnt-out and discouraged Phil Shulman left the band following disagreements with his brothers. Derek Shulman took over all lead vocals for live concerts, becoming Gentle Giant's de facto lead singer (although Kerry Minnear continued to sing his own share of lead vocals on records).", "The Power and the Glory followed in 1974. This was Gentle Giant's third concept album, this time taking power and corruption as the linking theme. The band also wrote a separate single with the same title. According to Derek Shulman, \"WWA said, 'Now boys, you've got to be commercial, you've gotta make singles. Now you run away and write us a single.' So we did three atrocious numbers. This song's the worst - 'You've got it lads!' - and we went into the studio and handed over the tapes when we came out. They put it out, we yelled at them, and they gave it back - took it off the market\". (The single was added to CD reissues of the album).", "Gentle Giant's next release was 1976's Interview - another concept album, this time based around an imaginary interview with the band. The music pointedly poked fun at the state of the music industry and at the silly questions that rock stars are repeatedly asked in order to project an image for marketing. Ironically, this more satirical and subversive approach ultimately proved to be a symptom of the undermining of the band's work and artistic integrity. Derek Shulman later admitted, \"I think Interview was the start of the erosion. I think the creative juices were starting to wane a little bit... I think Interview was the start of the slide towards the realization that this is a business now, and that's also a part of what the business had become. I was managing the band at the time and music business became a major business\".\" Despite this approach, the album did not repeat its predecessor's American chart success, peaking at No. 137.", "Despite this setback, the band pursued their course to its conclusion on 1978's Giant for a Day! on which all former progressive rock stylings were purged in favour of radio-friendly soft rock and further (unsuccessful) attempts at creating hit singles. In order to present a more straightforward group identity, Derek Shulman now handled all lead vocals and the band abandoned their coventional battery of string instruments, wind instruments, tuned percussion and vocal interplay in favour of a straightforward guitar/bass/keyboards/drums/lead singer set-up. Giant for a Day! was another poor seller, later adjudged by the band as being a creative mistake. Derek Shulman eventually remembered it as being \"real contrived\" while Kerry Minnear would confess to having felt unsure as to whether he had anything to contribute to the album (although he did make an attempt to write a commercial single, \"It's Only Goodbye\").", "While Kerry Minnear would pronounce himself far more satisfied with this album and its songs, Ray Shulman would eventually state, \"I hated making [that] last record, I hated being involved with it\". In 2005, Derek Shulman reflected, \"Civilian was done with less passion than some of the other albums. As it turns out we as a band were just not good at being rock or pop stars. We would have loved to be as popular as a Genesis or Rush or Yes. In hindsight, I sometimes think that Gentle Giant was wrongfully put into the progressive rock category. Much of what we did was very clever, but we certainly didn't do these long complex tunes like Yes or Genesis did\".", "In the summer of 1980, the group disbanded. In 2005, Derek Shulman recalled that \"the creative juices just weren't flowing. I was living in Los Angeles at the time when we broke up. We weren't really sure what direction to take. I don't regret the decision we made to disband, and I'd do it again if we were to do the whole thing all over again\". Ray Shulman has commented: \"There was definitely the decision that the last tour would be the last tour. Once we knew that, we enjoyed ourselves. We decided to quit then rather than let it go on too long\".\" In an interview with Mojo in 2000, Kerry Minnear asserted that the split \"wasn't because of punk; it was because we had lost our way musically\".", "Following the dissolution of the band, Derek Shulman went on to a successful career in the organisational side of the music business (initially promotion and artist development for PolyGram, followed by A&R at Mercury Records, becoming president of Atco Records, after which he became President of Roadrunner Records. He is now the owner of new music company 2Plus Music & Entertainment). Ray Shulman moved into soundtrack work for television and advertising before becoming a record producer (working with, among others, Echo & the Bunnymen, the Sundays, and the Sugarcubes). He has written soundtracks for computer games, as well as producing DVDs for artists such as Genesis and Queen.", "A fan video of \"Proclamation\" was posted on YouTube on 15 July 2020. The video featured appearances from Gentle Giant members Gary Green, Kerry Minnear, Derek Shulman, Ray Shulman, Phil Shulman, John Weathers and Malcolm Mortimore. Additional musicians included Jakko Jakszyk, Billy Sherwood, Yes/Steve Hackett bassist Lee Pomeroy, Rachel Flowers, Dan Reed (Dan Reed Network), Richard Hilton (Chic) and Mikey Heppner (Priestess) among others. The video was directed and edited by Noah Shulman and mixed by his uncle Ray.", "In 2005, to celebrate the band's 35th anniversary, a series of digitally remastered and specially packaged CDs of their later albums were released by Derek Shulman's company, DRT Entertainment. They all featured unreleased live tracks (of varying quality) as bonuses. Many of these albums (most notably, In a Glass House) were previously difficult to purchase in North America without resorting to imports. The re-released albums are: In a Glass House (1973), The Power and the Glory (1974), Free Hand (1975), Interview (1976), The Missing Piece (1977), Playing the Fool (1977, live), and Giant for a Day (1978).", "A reissue series on CD and, with bonus tracks, as digital downloads was begun in 2009/2010. In a 2009 interview Derek Shulman also indicated that plans were in the works to put out an animated film based on The Power and the Glory (this has yet to come to fruition). In 2011 the original mastertapes for Three Friends (1972) and Octopus (1972) were located and Alucard Music reissued each album with a bonus live performance of material from each respective album. Each album was remastered by Ray Shulman and Francis Kervorkian (both of whom worked on the 2009 remasters).", "Gentle Giant's music was mostly composed by Kerry Minnear and Ray Shulman, with additional musical ideas contributed by Derek Shulman (who was also known to contribute entire songs). Lyrics were mostly written by Phil Shulman and Derek Shulman (Kerry Minnear wrote some lyrics) up until Phil's departure following the release of Octopus (1972) – subsequent lyrics were mostly written by Derek Shulman, with help from Kerry Minnear. It shares several aspects with that of other progressive rock bands, including:", "*Derek Shulman – lead vocals, saxophone, recorder, keyboards, bass guitar, drums, percussion, \"Shulberry\" (3-string custom electric ukulele)   (1970–1980)", "*Derek Shulman – lead vocals, saxophone, recorder, keyboards, bass guitar, drums, percussion, \"Shulberry\"", "*Derek Shulman – lead vocals, saxophone, recorder, keyboards, bass guitar, drums, percussion, \"Shulberry\"", "*Derek Shulman – lead vocals, saxophone, recorder, keyboards, bass guitar, drums, percussion, \"Shulberry\"", "*Derek Shulman – lead vocals, saxophone, recorder, keyboards, bass guitar, drums, percussion, \"Shulberry\"", " bar:Derek text:\"Derek Shulman\""]}, {"page": "Billy Sherwood", "response": ["By 1989, Sherwood was invited to meet Yes bassist Chris Squire after singer and record executive Derek Shulman suggested his name. By this time, Yes had suffered a setback when singer Jon Anderson had left and formed Anderson Bruford Wakeman Howe (ABWH). Sherwood was invited to jam with the remaining Yes members, Squire, guitarist Trevor Rabin, drummer Alan White, and keyboardist Tony Kaye, with the intention of Sherwood on lead vocals. By the time the five had recorded some demos, they merged with members of ABWH in 1990 to become an eight-man formation of Yes, which lasted until 1992. The two groups recorded songs for Union (1991), which features the first song that Sherwood and Squire wrote together, \"The More We Live - Let Go\". Sherwood struck up a friendship with Squire that would lead him to work with him throughout the next 20 years."]}, {"page": "DRT Entertainment", "response": ["DRT Entertainment was a New York City based independent record label founded in 2003 by Derek Shulman, Ron Urban, and Theodore \"Ted\" Green. The label is defunct."]}, {"page": "Atomic Opera", "response": ["In 1994, after Derek Shulman, president of Collision Arts (a subsidiary of Giant Records) saw the band play live at Zelda's in Houston, he signed them the spot. Soon, they released their first full album, For Madmen Only. During this time, the band toured with such artists as Dio and King's X. The band's video for \"Justice\" was played approximately 20 times on MTV."]}, {"page": "Simon Dupree and the Big Sound", "response": ["Simon Dupree and the Big Sound were a British psychedelic band formed in 1966 by brothers Derek Shulman (vocals), Phil Shulman (vocals, saxophone, trumpet), and Ray Shulman (guitar, violin, trumpet, vocals); also known for their later prog rock band, Gentle Giant."]}, {"page": "Octopus (Gentle Giant album)", "response": ["*Derek Shulman - lead vocals (tracks 1-4, 8), alto saxophone (track 5)"]}, {"page": "Shulman", "response": ["*Derek Shulman, Scottish musician"]}, {"page": "The Power and the Glory (Gentle Giant album)", "response": ["The Power and the Glory is the sixth album by the British progressive rock group Gentle Giant, released in 1974. Contrary to popular belief, the title of the album and its many lyrical themes were not inspired by author Graham Greene's novel of the same name, although Derek Shulman was aware of Greene's novel.Interview with Wayne Klein, 16 February 2010, from \"Progressive Land\" Guitarist Gary Green has cited this album as his favourite by the band.\"Progressive Land\" Interview with Gary Green by Wayne Klein ", "In a 2010 interview17 February 2010 Interview for Progressiveland website with Derek Shulman by Wayne Klein Derek Shulman announced that the band are working at creating an animated film based around the themes, characters and songs of the album. The animations subsequently became available in the album's Blu-ray release, of July 2014, which also features a remix (both in stereo and 5.1 surround format) by Steven Wilson. The new edition was released by Alucard, the company that managed Gentle Giant material.", "* Derek Shulman – lead vocals on tracks 1, 2 and 4-8, tenor saxophone (track 2)", "*Interview with Derek Shulman, 17 February 2010, by Wayne Klein https://web.archive.org/web/20100719034532/http://www.dvdivas.net/INDEX-PROGRESSIVELAND.html"]}, {"page": "Three Friends (album)", "response": ["*Derek Shulman – lead vocals (3–6)"]}, {"page": "Acquiring the Taste", "response": ["*Derek Shulman – alto saxophone (tracks 1, 6), clavichord (track 3), cowbell (track 3), lead vocals (tracks 3, 5, 6), vocals (tracks 1, 2, 7, 8)"]}, {"page": "Gentle Giant (album)", "response": ["*Derek Shulman – lead (1, 2, 3, 5, 6) and backing vocals, bass (4)"]}, {"page": "In a Glass House", "response": ["The 2004 release had two live recordings from the tour as bonus tracks. The album was reissued in 2005 and distributed by Derek Shulman's DRT label with 1 bonus live track as part of the 35th Anniversary reissue series of the band's back catalogue. In 2009, In a Glass House became available for the first time as a digital download with bonus live recordings (these recordings differed from the original 2004 and 2005 release of the album) remastered by Fred Kervorkian under the supervision of Ray Shulman. In a Glass House received a physical release on CD as part of a 40th Anniversary series of reissues this time without any bonus tracks with plans to release vinyl versions of all the band's albums from In a Glass House through Giant for a Day in late 2010.\"Progressiveland\" interview with Derek Shulman  by Wayne Klein, 17 February 2010", "All lead vocals by Derek Shulman and Kerry Minnear, except \"A Reunion\", sung by Kerry Minnear.", "*Derek Shulman – lead vocals (1-4, 6), alto saxophone and soprano saxophones (6), descant recorder (1)"]}, {"page": "Free Hand", "response": ["*Derek Shulman – lead vocals (1-4 and 7), treble recorder (6), alto saxophones (1)"]}, {"page": "Playing the Fool", "response": ["*Derek Shulman – lead vocals, alto saxophone, soprano recorder, bass, percussion"]}, {"page": "Interview (album)", "response": ["*Derek Shulman – lead vocals, alto saxophone , percussion "]}, {"page": "The Missing Piece (Gentle Giant album)", "response": ["All lead vocals by Derek Shulman, except \"As Old as You're Young\", sung by Kerry Minnear and Shulman.", "* Derek Shulman – lead vocals on all tracks"]}, {"page": "Giant for a Day!", "response": ["All lead vocals by Derek Shulman, except where noted.", "*Derek Shulman – lead vocals all tracks except tracks 4 and 7"]}, {"page": "Civilian (Gentle Giant album)", "response": ["All lead vocals by Derek Shulman, except \"Shadows on the Street\", sung by Kerry Minnear.", "*Derek Shulman – lead vocals on all tracks except track 3"]}, {"page": "List of Scottish musicians", "response": ["*Derek Shulman, lead singer for Simon Dupree and the Big Sound and Gentle Giant"]}, {"page": "Dan Reed Network", "response": ["The band signed to Mercury Records with the aid of Derek Shulman (who was enjoying success with Bon Jovi and Cinderella), and were managed by Bill Graham. In winter 1987, the group released an eponymous debut album which was produced by Bruce Fairbairn (who had worked with Bon Jovi) and was engineered and mixed by Mike Fraser at Little Mountain Sound Studios in Vancouver. They released their first single \"Ritual\", which peaked at No. 38 on the Billboard Hot 100. The song also received a music video."]}, {"page": "Phil Shulman", "response": ["He is the eldest brother of Derek Shulman and Ray Shulman. All three were members of the sixties psychedelic group Simon Dupree and the Big Sound, and then formed the seminal progressive rock group Gentle Giant. A multi-instrumentalist, he has played alto and tenor saxophone, flute, clarinet, trumpet, cello, mellophone, piano, plus occasional percussion and vocals."]}, {"page": "Derek", "response": ["*Derek Shulman (born 1947), Scottish singer/instrumentalist and record executive"]}, {"page": "List of Scottish Jews", "response": ["** Derek Shulman, multi-instrumentalist and songwriter"]}, {"page": "Portsmouth College", "response": ["* Derek Shulman, musician with Simon Dupree and the Big Sound"]}, {"page": "Yoso", "response": ["The band played three Mexican dates in October 2009.\"La buena música es para siempre, las otras sólo duran 15 minutos\", aseguró Billy Sherwood, integrante de Yoso In December, Sherwood announced the band would be moving forward with Jody Cortez on drums, and also that they had acquired Derek Shulman as their manager. Some live shows in early 2010 followed."]}]}}