{"wiki_id": "http://www.wikidata.org/entity/Q1200109", "itemLabel": "Derek Redmond", "itemDescription": "British retired athlete", "wikipedia_url": "https://en.wikipedia.org/wiki/Derek_Redmond", "wikipedia_page": {"main": "Derek Anthony Redmond (born 3 September 1965) is a retired British sprinter. During his career, he held the British record for the 400 metres sprint, and won gold medals in the 4x400 metres relay at the World Championships and European Championships.At the 1992 Olympic Games in Barcelona, Redmond tore his hamstring in the 400 metres semi-final but continued the race limping and, with assistance from his father, managed to complete a full lap of the track as the crowd gave him a standing ovation. Although Redmond was disqualified and listed as \"Did Not Finish\" due to the outside assistance finishing the race, the incident has become a well-remembered moment in Olympic history, having been the subject of one of the International Olympic Committee's \"Celebrate Humanity\" videos and been used in advertisements by Visa as an illustration of the Olympic spirit and featured in Nike's \"Courage\" commercials in 2008.", "link_mentions": [{"page": "Linford Christie", "response": ["In the successful British bid for the 2012 Olympic Games, Christie was absent from the team, even though he has stated that he attempted to get involved. Christie has cited an ongoing feud between himself and former teammate Sebastian Coe, who led the bid committee, as a likely reason for the snub,Christie hits out at Olympic snub BBC Sport (14 October 2005) Retrieved on 2009-01-20Coe and Christie clash again BBC Sport (8 February 2002) Retrieved on 2009-01-20Campbell wants Christie call-up BBC Sport (5 July 2006) Retrieved on 2009-01-20 Commenting on the argument, Christie's teammate, Derek Redmond, said he was \"a well-balanced athlete; he has a chip on both shoulders.\"Faces of the week BBC Sport (11 August 2006) Retrieved on 2009-01-20"]}, {"page": "1992 Summer Olympics", "response": ["* Derek Redmond of Great Britain tore a hamstring during a 400-meter semi-final heat. As he struggled to finish the race, his father entered the track without credentials and helped him complete the race, to a standing ovation from the crowd."]}, {"page": "Sharron Davies", "response": ["In 1992, she met athlete Derek Redmond at the Barcelona Olympics. In 1994 they were married in Northampton, and had two children. They were divorced in 2000."]}, {"page": "1991 World Championships in Athletics", "response": ["|Roger BlackDerek RedmondJohn RegisKriss AkabusiAde Mafe*Mark Richardson*||2:57.53(AR)"]}, {"page": "1987 World Championships in Athletics", "response": ["|Derek RedmondKriss AkabusiRoger BlackPhil BrownTodd Bennett*Mark Thomas*||2:58.86"]}, {"page": "Roger Black", "response": ["In 1986, Black graduated to the senior ranks and made a spectacular impact first winning at the Commonwealth Games in Edinburgh in 45.57, and then at the European Championships in Stuttgart, winning in a time of 44.59, his first British Record, breaking Derek Redmond's 44.82 record from the previous year. Having also won golds in both 4 × 400 m relays at both of those events as well, Black's 1986 season had turned into a gold rush of four gold medals."]}, {"page": "Great Britain at the 1992 Summer Olympics", "response": ["*Derek Redmond"]}, {"page": "1986 European Athletics Championships", "response": ["|Derek Redmond Kriss AkabusiBrian Whittle Roger Black||2:59.84"]}, {"page": "4 × 400 metres relay", "response": ["|Roger Black, Derek Redmond, John Regis, Kriss Akabusi"]}, {"page": "You Bet!", "response": ["|bgcolor=\"ffdddd\"| Derek Redmond"]}, {"page": "Kriss Akabusi", "response": ["At the 1991 World Championships in Tokyo, Akabusi won the bronze medal in the 400 m hurdles and a gold medal as a member of the 4 x 400 relay team alongside Roger Black, Derek Redmond and John Regis, with Akabusi as anchor leg. At the start of the final lap, he took the baton in second place behind the American team, but eventually overtook American runner Antonio Pettigrew (who had won the 400 m individual event) on the final straight and crossed the line in first place to win the gold medal for Britain in a time of 2:57.53, a new British record."]}, {"page": "They Think It's All Over (TV series)", "response": ["*Feel The Sportsman, one of the most popular rounds of the show, in which the regular panellists have to try to identify a mystery guest, or their sporting notability, by touch whilst blindfolded. Guests subjected to a groping include Will Carling, Ashia Hansen, Henry Cooper, Lucinda Green, Geoff Capes, Victor Ubogu, Jonah Lomu (who infamously appeared minutes after Chris Eubank had been goaded into calling him \"a big poof\"), Andy Fordham, Manc Union Paintball Team, Arsenal Women's Football Team (which Rory guessed right on the whistle), Aylesbury United F.C. in their infamous 1995 FA Cup duck conga goal celebration, a preserved Mick the Miller, the Subbuteo Gary Lineker, a cardboard cutout of Roy of the Rovers, Tony Bullimore, Stirling Moss and the aforementioned Karl Power. One notable variant in 2001 saw the regulars feeling an animal, having been shown a clip of Sven-Göran Eriksson on Italian television trying to identify animals by touch alone. David Gower and Jonathan Ross correctly guessed their animal (a zebra) but Gary Lineker and Rory McGrath failed to get theirs (an alligator – they failed to even touch it), with McGrath and Lineker removing their blindfolds and running off the set in panic. Occasionally, the guests get to play in lieu of one of the regulars; a notable example was Sharron Davies, when the sportsman was her then husband Derek Redmond, whom she recognised."]}]}}