{"wiki_id": "http://www.wikidata.org/entity/Q12064659", "itemLabel": "Michael Offei", "itemDescription": "British actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Michael_Offei", "wikipedia_page": {"main": "Michael Shaun Offei (born 4 October 1966) is an English actor. He is best known for starring in the CBeebies children's TV show The Story Makers, a role he took up in 2002.", "link_mentions": [{"page": "Hitman (franchise)", "response": ["A film adaptation of the game series was released in 2007. The film, titled simply Hitman, is set in a separate continuity from the game series, directed by Xavier Gens and starring Timothy Olyphant as Agent 47 after the role went to Vin Diesel who's also the executive producer but  stepped down from the role. The film also stars Dougray Scott, Robert Knepper, Ulrich Thomsen and Michael Offei. In the film, the International Contract Agency is replaced by a similar group called the Organization, which, like the ICA, benefits from ties to various government agencies, is neutral in global matters and morality, and performs missions all over the world. Unlike the game wherein the hitmen are contracted from a range of backgrounds, the Organization instead recruits orphans and trains them from an early age."]}, {"page": "The Story Makers", "response": ["*Byron Wordsworth – Played by Michael Offei (appears in series 2–4)"]}, {"page": "Mill Hill County High School", "response": ["*Michael Offei, actor"]}, {"page": "Hitman (2007 film)", "response": ["* Michael Offei as Jenkins: Whittier's right-hand man at Interpol.", "In December 2006, Diesel stepped down from the role. In January 2007, Olyphant was cast as the lead with director Xavier Gens at the helm. In March, actor Dougray Scott was cast as Agent 47's nemesis, with Olga Kurylenko, Robert Knepper, Ulrich Thomsen, and Michael Offei also joining the cast."]}, {"page": "List of American films of 2007", "response": ["| Hitman || 20th Century Fox || Xavier Gens (director); Skip Woods (screenplay); Timothy Olyphant, Dougray Scott, Robert Knepper, Olga Kurylenko, Ulrich Thomsen, Henry Ian Cusick, Michael Offei, James Faulkner, Eriq Ebouaney, Emil Abossolo-Mbo, Lisa Jacobs, Sabine Crossen, Susan White, Asen Blatechki, Vladimir Kolev || Action, Thriller"]}, {"page": "ZingZillas", "response": ["* Zak has a positive attitude. He is serious, confident and likes taking risks. He is a gorilla who is the lead singer, played by Jeremiah Krage and Jack Andrews and has purple fur. He is voiced by Michael Offei."]}, {"page": "Offei, Michael", "response": ["#redirectMichael Offei"]}, {"page": "Offei", "response": ["*Michael Offei (born 1966), British actor"]}]}}