{"wiki_id": "http://www.wikidata.org/entity/Q12053389", "itemLabel": "John Cooke Bourne", "itemDescription": "British engraver", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Cooke_Bourne", "wikipedia_page": {"main": "John Cooke Bourne (1 September 1814 – February 1896) was a British artist, engraver and photographer, best known for his lithographs showing the construction of the London and Birmingham Railway and the Great Western Railway.\nHis set of prints were each published as separate book, and became classic representations of the construction of the early railways. Prints were often hand coloured for a vivid picture of events.", "link_mentions": [{"page": "Great Western Railway", "response": ["George Thomas Clark played an important role as an engineer on the project, reputedly taking the management of two divisions of the route including bridges over the River Thames at Lower Basildon and Moulsford and of Paddington Station. Involvement in major earth-moving works seems to have fed Clark's interest in geology and archaeology and he, anonymously, authored two guidebooks on the railway: one illustrated with lithographs by John Cooke Bourne; the other, a critique of Brunel's methods and the broad gauge.", "The GWR attracted the attention of the artists from an early date. John Cooke Bourne's History and Description of the Great Western Railway was published in 1846 and contained a series of detailed lithographs of the railway that give readers a glimpse of what the line looked like in the days before photography. J. M. W. Turner painted his Rain, Steam and Speed - The Great Western Railway in 1844 after looking out of the window of his train on Maidenhead Railway Bridge, and in 1862 William Powell Frith painted The Railway Station, a large crowd scene on the platform at Paddington. The station itself was initially painted for Powell by W Scott Morton, an architect, and a train was specially provided by the GWR for the painting, in front of which a variety of travellers and railway staff form an animated focal point."]}, {"page": "London and Birmingham Railway", "response": ["*John Cooke Bourne"]}, {"page": "Tring", "response": ["Tring is in west Hertfordshire, adjacent to the Buckinghamshire border, at a low point in the Chiltern Hills known as the 'Tring Gap'. This has been used as a crossing point since ancient times, being at the junction of the Icknield Way and under the Romans Akeman Street, the major Roman road linking London to Cirencester. It is transected east and west by the ancient earthwork called Grim's Dyke. It is located at the summit level of the Grand Union Canal and both the canal and railway pass through in deep cuttings. Tring railway cutting is  long and an average of  deep and is celebrated in a series of coloured lithographs by John Cooke Bourne showing its construction in the 1830s."]}, {"page": "1896 in art", "response": ["* February – John Cooke Bourne, English topographical artist, lithographer and photographer (born 1814)"]}, {"page": "Wolverton railway works", "response": ["The original bridge across the Grand Union canal was built in 1834-5 (chief engineer, Robert Stephenson) and is a Grade II* listed monument. The bridge is composed of numerous cast iron girders, many made by the Butterley Company Iron works. It is a rare survival since most similar bridges were removed at the end of the Victorian era. The more imposing Wolverton viaduct to the north of the old station yard is one of the most impressive viaducts on the line, and was built in 1838 across the River Ouse valley. There were many problems encountered during construction, especially landslips on the adjacent embankment. They can still be seen just south of the viaduct and were portrayed by John Cooke Bourne in his description of the railway published just after it had opened.."]}, {"page": "1814 in art", "response": ["*September 1 – John Cooke Bourne, English topographical artist, lithographer and photographer (died 1896)"]}, {"page": "Bourne (surname)", "response": ["* John Cooke Bourne (1814–1896), artist and engraver"]}, {"page": "John Bourne", "response": ["*John Cooke Bourne (1814–1896), English artist and engraver"]}, {"page": "Skew arch", "response": ["The bridge carrying the London and Birmingham Railway over the London Road at Boxmoor in Hertfordshire, adjacent to what is now Hemel Hempstead station on the West Coast Main Line, is an example of a segmental arch of extreme obliquity that was designed by Buck and incorporates both of these features. Constructed in masonry, with a brick barrel, stone quoins and a 58° angle of skew, it was completed in 1837. Shortly before the railway opened the bridge was the subject of an ink and wash drawing dated 12 June 1837, one of a series of works by artist John Cooke Bourne illustrating the construction of the line."]}, {"page": "Bourne, John Cooke", "response": ["#REDIRECT John Cooke Bourne"]}, {"page": "Charles Cheffins", "response": ["From 1830 he was engaged by Captain John Ericsson to assist in making drawings for locomotive engines. The next year he became assistant to George Stephenson and prepared plans and sections of the projected Grand Junction Railway. On the completion of the parliamentary submissions for the Grand Junction Railway, between 1832 and 1833, he set up his own cartographical and drawing business, and spent over two decades working as a surveyor for numerous railroad construction projects in the United Kingdom. In 1838, he published his first Map of the Grand Junction Railway and Adjacent Country; and the next year Cheffins's Official Map of the Railway from London to Birmingham, Manchester and Liverpool. In 1846, Cheffins commissioned John Cooke Bourne to write the History of the Great Western Railway. Occasionally, Cheffins also published lithographical work by others. In the year 1848, he had been elected an Associate of the Institution of Civil Engineers and continued to take interest in all their proceedings."]}, {"page": "Jacques-Eugène Armengaud", "response": ["One of the examples published in the 1860 edition was the design of the Nicholas Chain Bridge, designed by Charles Blacker Vignoles and pictured by John Cooke Bourne.See The practical draughtsman's book of industrial design, 1860, Plate 45 (online)"]}, {"page": "List of Orientalist artists", "response": ["* John Cooke Bourne (British, 1814–1896) Lithographer"]}]}}