{"wiki_id": "http://www.wikidata.org/entity/Q1217074", "itemLabel": "Charles Holroyd", "itemDescription": "British artist (1861-1917)", "wikipedia_url": "https://en.wikipedia.org/wiki/Charles_Holroyd", "wikipedia_page": {"main": "Sir Charles Holroyd (9 April 1861 – 17 November 1917) was an English artist and curator. He was Keeper of the Tate from 1897 to 1906, and Director of the National Gallery from 1906 to 1916.", "link_mentions": [{"page": "Tate", "response": ["* Sir Charles Holroyd (1897 to 1906)"]}, {"page": "National Gallery", "response": ["The initial reception of Impressionist art at the Gallery was exceptionally controversial. In 1906, Sir Hugh Lane promised 39 paintings, including Renoir's Umbrellas, to the National Gallery on his death, unless a suitable building could be built in Dublin. Although eagerly accepted by the director Charles Holroyd, they were received with extreme hostility by the Trustees; Lord Redesdale wrote that \"I would as soon expect to hear of a Mormon service being conducted in St. Paul's Cathedral as to see the exhibition of the works of the modern French Art-rebels in the sacred precincts of Trafalgar Square\".Quoted in  Perhaps as a result of such attitudes, Lane amended his will with a codicil that the works should only go to Ireland, but crucially this was never witnessed. Lane died on board the RMS Lusitania in 1915, and a dispute began which was not resolved until 1959. Part of the collection is now on permanent loan to Dublin City Gallery (\"The Hugh Lane\") and other works rotate between London and Dublin every few years.", "|Sir Charles Holroyd||1906–1916"]}, {"page": "Newlyn", "response": ["*Charles Holroyd, painter"]}, {"page": "1917 in art", "response": ["** Sir Charles Holroyd, English etcher (b. 1861)"]}, {"page": "Holroyd", "response": ["* Charles Holroyd"]}, {"page": "1861 in art", "response": ["* April 9 – Charles Holroyd, English etcher (died 1917)"]}, {"page": "Potternewton", "response": ["*Sir Charles Holroyd (1861–1917) Artist and museum curator"]}, {"page": "Sir Charles Holroyd", "response": ["#REDIRECT Charles Holroyd"]}]}}