{"wiki_id": "http://www.wikidata.org/entity/Q1226322", "itemLabel": "Walter Baldwin Spencer", "itemDescription": "English-Australian biologist and anthropologist.", "wikipedia_url": "https://en.wikipedia.org/wiki/Walter_Baldwin_Spencer", "wikipedia_page": {"main": "Sir Walter Baldwin Spencer  (23 June 1860 – 14 July 1929), was a British-Australian evolutionary biologist, anthropologist and ethnologist. He is known for his fieldwork with Aboriginal peoples in Central Australia, contributions to the study of ethnography, and academic collaborations with Frank Gillen. Spencer introduced the study of zoology at the University of Melbourne and held the title of Emeritus Professor until his death in 1929.", "link_mentions": [{"page": "List of biologists", "response": ["*Walter Baldwin Spencer (1860–1929), British-Australian evolutionary biologist and anthropologist,Abbreviation in zoology: Spencer known for fieldwork with Aboriginal peoples in Central Australia"]}, {"page": "The Dreaming", "response": ["The station-master, magistrate, and amateur ethnographer Francis Gillen first used the terms in an ethnographical report in 1896. With Walter Baldwin Spencer, Gillen published a major work, Native Tribes of Central Australia, in 1899. In that work, they spoke of the Alcheringa as \"the name applied to the far distant past with which the earliest traditions of the tribe deal\". Five years later, in their Northern Tribes of Central Australia, they gloss the far distant age as \"the dream times\", link it to the word alcheri meaning 'dream', and affirm that the term is current also among the Kaitish and Unmatjera."]}, {"page": "Cave painting", "response": ["In the early 20th century, following the work of Walter Baldwin Spencer and Francis James Gillen, scholars such as Salomon Reinach, Henri Breuil and  interpreted the paintings as 'utilitarian' hunting magic to increase the abundance of prey. Jacob Bronowski states, \"I think that the power that we see expressed here for the first time is the power of anticipation: the forward-looking imagination. In these paintings the hunter was made familiar with dangers which he knew he had to face but to which he had not yet come.\""]}, {"page": "James George Frazer", "response": ["When Frazer's Australian colleague Walter Baldwin Spencer requested to use native terminology to describe Aboriginal Australian cultures, arguing that doing so would be more accurate, since the Christian terms were loaded with Christian connotations that would be completely foreign to members of the cultures he was describing, Frazer insisted that he should use Judeo-Christian terms instead, telling him that using native terms would be off-putting and would seem pedantic. A year later, Frazer excoriated Spencer for refusing to equate the non-estrangement of Aboriginal Australian totems with the Christian doctrine of reconciliation. When Spencer, who had studied the aboriginals firsthand, objected that the ideas were not remotely similar, Frazer insisted that they were exactly equivalent. Based on these exchanges, Larsen concludes that Frazer's deliberate use of Judeo-Christian terminology in the place of native terminology was not to make native cultures seem less strange, but rather to make Christianity seem more strange and barbaric."]}, {"page": "Institutional racism", "response": ["Torres Strait Islander people are indigenousm to the Torres Strait Islands, which are in the Torres Strait between the northernmost tip of Queensland and Papua New Guinea. Institutional racism had its early roots here due to interactions between these islanders, who had Melanesian origins and depended on the sea for sustenance and whose land rights were abrogated, and later the Australian Aboriginal peoples, whose children were removed from their families by Australian Federal and State government agencies and church missions, under acts of their respective parliaments. The removals occurred in the period between approximately 1909 and 1969, resulting in what later became known as the Stolen Generations. An example of the abandonment of mixed-race (\"half-caste\") children in the 1920s is given in a report by Walter Baldwin Spencer that many mixed-descent children born during construction of The Ghan railway were abandoned at early ages with no one to provide for them. This incident and others spurred the need for state action to provide for and protect such children. Both were official policy and were coded into law by various acts. They have both been rescinded and restitution for past wrongs addressed at the highest levels of government."]}, {"page": "Desert bandicoot", "response": ["The description by Walter Baldwin Spencer was published in 1897, using a specimen provided by a European correspondent, Mr. Gillen, who had settled at Alice Springs. The holotype was placed at the National Museum in Melbourne. ", "Category:Taxa named by Walter Baldwin Spencer"]}, {"page": "Samuel Alexander", "response": ["By 1912, however, Alexander had altered his views to some extent and considered that the book had served its purpose and had become dated. During the period of his fellowship at Lincoln, he contributed articles on philosophical subjects to Mind, the Proceedings of the Aristotelian Society, and the International Journal of Ethics. He did some travelling on the continent, and in the winter of 1890–91 was in Germany working at the psychological laboratory of Hugo Münsterberg at Freiburg. Among his colleagues at Lincoln was Walter Baldwin Spencer."]}, {"page": "Stretford", "response": ["Sir Walter Baldwin Spencer KCMG (1860–1929) a British-Australian biologist and anthropologist was born in Stretford, as were ABC's lead singer Martin Fry, rock climber Derek Hersey and television actor John Comer, best known for his role as café owner Sid in the BBC sitcom Last of the Summer Wine."]}, {"page": "Spencer (taxonomy)", "response": ["#redirect Walter Baldwin Spencer"]}, {"page": "Sir Walter Baldwin Spencer", "response": ["#redirect Walter Baldwin Spencer"]}, {"page": "Gould's mouse", "response": ["As Pseudomys fieldii, the species was described in a description published by Edgar Ravenswood Waite in 1896, the holotype was obtained at Alice Springs; the author allied the new species to the genus Mus. Another description was provided in 1910 by the mammalogist Oldfield Thomas, a new species named as Pseudomys (Thetomys) praeconis. Thomas described a specimen that was obtained at Shark Bay, where the collector Guy C. Shortridge found the dry skull of a female lying on the ground on Bernier Island at the Peron Peninsula; Shortridge reported that he thought the species was locally extinct. Another specimen held at the British Museum, an old female obtained by F. M. Rayner during the voyage of  in 1858, was designated as the holotype. The specific epithet was nominated by Waite to fulfil a request of Walter Baldwin Spencer that J. Field be acknowledged for their collection of specimens during the Horn expedition."]}, {"page": "List of authors of names published under the ICZN", "response": ["* Spencer – Walter Baldwin Spencer (1860–1929)"]}, {"page": "Baw Baw frog", "response": ["The species was described as Philoria frosti by Walter Baldwin Spencer in 1901, honouring Charles Frost, an Australian naturalist. The specimens used in the species description (type series) were provided by Frost, an amateur herpetologist, who recovered five individuals that had been regurgitated by a tiger snake Notechis scutatus.", "Category:Taxa named by Walter Baldwin Spencer"]}, {"page": "1929 in Australia", "response": ["* 14 July – Sir Walter Baldwin Spencer, evolutionary biologist, anthropologist, and ethnologist (b. 1860)"]}, {"page": "List of VFL/AFL commissioners and club presidents", "response": ["| Walter Baldwin Spencer || 1919–1926 || Carlton"]}, {"page": "Royal Society of Victoria", "response": ["* 1904: Sir Walter Baldwin Spencer"]}, {"page": "Interracial marriage", "response": ["Historical marriages of Aboriginal Australian women with European men and Asian men of various nationality have been recorded in the late 19th and 20th century. Chinese immigrant men and other Asian men migrated to Australia and intermarried with Aboriginal Australian women. In 1913, anthropologist and temporary Chief Protector Walter Baldwin Spencer opposed these intermarriages and demonstrated clear bias against the mixing of Aboriginal women and Asian men (as opposed to white men), claiming their sexual contact caused 'rapid degeneration of the native'."]}, {"page": "Protector of Aborigines", "response": ["*Walter Baldwin Spencer (1911Kahlin Compound (1913 - 1939) to 1914/16?)"]}, {"page": "Long-tailed dunnart", "response": ["Category:Taxa named by Walter Baldwin Spencer"]}]}}