{"wiki_id": "http://www.wikidata.org/entity/Q1226478", "itemLabel": "Ed Sanders", "itemDescription": "British actor in Sweeney Todd", "wikipedia_url": "https://en.wikipedia.org/wiki/Ed_Sanders_(actor)", "wikipedia_page": {"main": "Edward William Sanders (born 4 February 1993) is an English actor, singer, and record producer. He is best known for his performance as Tobias Ragg in the 2007 film Sweeney Todd: The Demon Barber of Fleet Street. He was also featured on the film's soundtrack. He also appeared in the historical adventure drama film Hugo in 2011, where he was part of the ensemble.", "link_mentions": [{"page": "Sweeney Todd", "response": ["* Sweeney Todd: The Demon Barber of Fleet Street (2007), a film directed by Tim Burton, adapted from Sondheim's musical. It stars Johnny Depp as Sweeney Todd, Helena Bonham Carter as Mrs. Lovett, Alan Rickman as Judge Turpin, and Ed Sanders as Toby. The film received two Golden Globe Awards – one for Best Actor in a Comedy or Musical (Johnny Depp), and one for Best Picture, Comedy or Musical.  The film was also nominated for three Academy Awards, winning for Art Direction."]}, {"page": "Ed Sanders (disambiguation)", "response": ["Ed Sanders is a poet, singer, social activist, environmentalist, novelist and publisher.", "Edward or Ed Sanders may also refer to:", "* Ed Sanders (TV personality) (born 1968), carpenter who appears in Extreme Makeover: Home Edition", "* Ed Sanders (boxer) (1930–1954), Olympic gold medalist in boxing", "* Ed Sanders (actor) (born 1993), English actor, singer and record producer"]}, {"page": "Sweeney Todd: The Demon Barber of Fleet Street", "response": ["A feature film adaptation of Sweeney Todd, directed by Tim Burton with a screenplay by John Logan, was released on December 21, 2007. It stars Johnny Depp as Todd (Depp received an Oscar nomination and a Golden Globe Award for his performance), Helena Bonham Carter as Mrs. Lovett, Alan Rickman as Judge Turpin, Sacha Baron Cohen as Signor Pirelli, Jamie Campbell Bower as Anthony Hope, Laura Michelle Kelly as The Beggar Woman, Jayne Wisener as Johanna, Ed Sanders as Toby, and Timothy Spall as Beadle Bamford. The film was well received by critics and theatregoers and also won the Golden Globe Award for Best Motion Picture – Musical or Comedy."]}, {"page": "Tobias Ragg", "response": ["In the stage musical, Toby is portrayed as a mentally handicapped adult; Ken Jennings, who originated the Broadway role, was 31 on opening night, and Neil Patrick Harris was 27. In the 2007 movie, he is a child and not mentally ill, portrayed by 14-year-old Ed Sanders."]}, {"page": "Forest Row", "response": ["There have been several notable residents of Forest Row in the recent past and present. These include Owen Barfield, the writer and philosopher, Ben Elton, the comedian and novelist, David Gilmour from the band Pink Floyd, Violet Needham, author, Richard Jones, bass player and background singer in the Feeling, Jonael Schickler, a Swiss Philosopher and Sean Yates, professional cyclist. The singer Engelbert Humperdinck had a holiday cottage in the village during the 1980s. Actor Ed Sanders is from Forest Row.  American-born DJ and producer Secondcity (real name Rowan Harrington) lived in Forest Row having moved there when he was 12. Noted amateur golfer and writer Horace Hutchinson called Forest Row his home in the late 1920s and early 1930s, before his death in 1932."]}, {"page": "Sweeney Todd: The Demon Barber of Fleet Street (2007 film)", "response": ["Three members of the cast had never been in a film before: Ed Sanders was cast as Toby, Jayne Wisener as Johanna, and Jamie Campbell Bower, who auditioned, and after four days got the part of Anthony said, \"I think I weed myself. I was out shopping at the time and I got this call on my mobile. I was just like, 'OH MY GOD!' Honestly, I was like a little girl running around this shop like oh-my-god-oh-my-god-oh-my-god.\"", "| Ed Sanders"]}, {"page": "List of American films of 2007", "response": ["| Sweeney Todd: The Demon Barber of Fleet Street || Paramount Pictures / DreamWorks Pictures / Warner Bros. Pictures || Tim Burton (director); John Logan (screenplay); Johnny Depp, Helena Bonham Carter, Alan Rickman, Timothy Spall, Sacha Baron Cohen, Jayne Wisener, Jamie Campbell Bower, Laura Michelle Kelly, Ed Sanders, Anthony Stewart Head || Musical, Period, Slasher"]}, {"page": "Sanders (surname)", "response": ["*Ed Sanders (1930–1954), American boxer", "*Ed Sanders (born 1939), American poet, singer, social activist", "*Ed Sanders (born 1968), English carpenter, actor and television host", "*Ed Sanders (born 1993), British actor and singer"]}, {"page": "13th Critics' Choice Awards", "response": ["* Ed Sanders – Sweeney Todd: The Demon Barber of Fleet Street as Tobias Ragg"]}, {"page": "29th Young Artist Awards", "response": ["* Ed Sanders – Sweeney Todd: The Demon Barber of Fleet Street – Paramount Pictures"]}, {"page": "List of Old Ardinians", "response": ["*Ed Sanders - actor"]}]}}