{"wiki_id": "http://www.wikidata.org/entity/Q122122", "itemLabel": "Karl Johnson", "itemDescription": "Welsh actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Karl_Johnson_(actor)", "wikipedia_page": {"main": "Karl Johnson (born 1 March 1948) is a Welsh actor, who has worked on stage, film and television. His notable roles to date include the title role in Derek Jarman's 1993 film Wittgenstein, and those of Cato the Younger in the television drama series Rome and of Twister Turrill in the BBC costume drama Lark Rise to Candleford.\n\n", "link_mentions": [{"page": "The Winter's Tale", "response": ["On 1 May 2016, BBC Radio 3's Drama on 3 broadcast a production directed by David Hunter, with Danny Sapani as Leontes, Eve Best as Hermione, Shaun Dooley as Polixenes, Karl Johnson as Camillo, Susan Jameson as Paulina, Paul Copley as the Shepherd and Faye Castelow as Perdita. This production will be re-broadcast on 6 May 2018."]}, {"page": "The Exorcist (novel)", "response": ["starring Robert Glenister as Father Karras, Lydia Wilson as Regan, Teresa Gallagher as Chris MacNeil, Karl Johnson as Detective Kinderman, Bryan Dick as Father Dyer, Alexandra Mathie as The Demon and Ian McDiarmid as Father Merrin."]}, {"page": "Noises Off", "response": ["A London production ran from 3 December 2011 to 10 March 2012 at the Old Vic Theatre, directed by Lindsay Posner and starring Jonathan Coy, Janie Dee, Robert Glenister, Jamie Glover, Celia Imrie, Karl Johnson, Aisling Loftus, Amy Nuttall and Paul Ready. This production transferred to the Novello Theatre in the West End from 24 March to 30 June 2012, and then toured Britain and Ireland with a different cast."]}, {"page": "1987 in film", "response": ["| My Demon Lover || New Line Cinema || Charlie Loventhal (director); Leslie Ray (screenplay); Scott Valentine, Michele Little, Robert Trebor, Alan Fudge, Gina Gallego, Calvert DeForest, Arnold Johnson, Marsha Clark, Karl Johnson, Lin Shaye, Tasia Valenza, Dan Patrick Brady, Eva Charney, Kennedy Clarke, Steven Hutchins, Franis James, Peewee Piemonte, Leslie Ray || Comedy || Live action"]}, {"page": "1979 in film", "response": ["| The Tempest || || Derek Jarman (director/screenplay); Heathcote Williams, Toyah Willcox, Karl Johnson, Peter Bull, Richard Warwick, David Meyer, Neil Cunningham, Jack Birkett, Christopher Biggins, Peter Turner, Ken Campbell, Elisabeth Welch, Claire Davenport, Helen Wellington-Lloyd, Kate Temple, Angela Wittingham || Drama, Fantasy || Live Action"]}, {"page": "1948 in film", "response": ["*March 1 - Karl Johnson, Welsh actor"]}, {"page": "Star Wars (radio series)", "response": ["The supporting cast included Rick Hall, Andrew Hawkes, Sherman Howard, Karl Johnson, John Kapelos, Ron Le Paz, Joe Liss, Paul Mercier, Steven Petrarca, Jonathan Penner, Gil Segel, Nia Vardalos and Ron West. Ken Hiller provides the narration."]}, {"page": "Dixon of Dock Green", "response": ["The Black and Blue Lamp by Arthur Ellis was screened in the BBC2 Screenplay series of drama plays on 7 September 1988. In the play – which begins with a montage of key scenes from The Blue Lamp – Tom Riley (Sean Chapman) and PC Hughes (Karl Johnson) are projected forwards into a violent parody of 1980s police procedurals called The Filth. Once there, they meet the corrupt Superintendent Cherry (Kenneth Cranham) and Superintendent Hammond (John Woodvine) and discover just how much policing has changed between the two periods."]}, {"page": "Jubilee (1978 film)", "response": ["* Karl Johnson – Sphinx"]}, {"page": "Under Milk Wood", "response": ["|Second Drowned||Dylan Thomas|| || || || || ||?||Karl Johnson"]}, {"page": "Cato the Younger", "response": ["In the television series Rome, Cato, played by actor Karl Johnson, is a significant character, although he is shown as somewhat older than his actual age (mid-40s) at the time. In the 2002 miniseries Julius Caesar, Cato as played by Christopher Walken is depicted as much older than he was, seen as a major figure in the senate when Caesar is just a young man, although Caesar was five years older than Cato. Cato was featured in the BBC docudrama Ancient Rome: The Rise and Fall of an Empire."]}, {"page": "The Blue Lamp", "response": ["In 1988, Arthur Ellis's satirical BBC Two play The Black and Blue Lamp had the film characters of Riley (Sean Chapman) PC \"Taffy\" Hughes (Karl Johnson) transported forwards in time into an episode of The Filth, a gritty contemporary police television series, replacing their modern-day counterparts."]}, {"page": "Endgame (play)", "response": ["In 2020 the Old Vic in London produced a version with Alan Cumming, Daniel Radcliffe, Jane Horrocks and Karl Johnson  the play in a double bill with Rough for Theatre II."]}, {"page": "The Seven-Per-Cent Solution", "response": ["The story was dramatised for radio by Denny Martin Flinn. The adaptation aired on BBC Radio 4 on 9 January 1993. It was directed by Jane Morga, with Simon Callow as Sherlock Holmes, Ian Hogg as Dr Watson, Karl Johnson as Sigmund Freud, David King as Professor Moriarty, Philip Voss as Mycroft Holmes, Matthew Morgan as Baron von Leinsdorf, Melinda Walker as Nancy Osborn Slater, Geraldine Fitzgerald as Baroness von Leinsdorf, and Wolf Kahler as Hugo von Hoffmansthal. The radio adaptation was more faithful to the novel than the film adaptation."]}, {"page": "Glengarry Glen Ross", "response": ["* Karl Johnson – John Williamson"]}, {"page": "The Pier", "response": ["The Pier is a 2011 Irish romantic drama film written and directed by Gerard Hurley and starring Karl Johnson, Hurley and Lili Taylor.", "*Karl Johnson as Larry McCarthy"]}, {"page": "Conor McPherson", "response": ["In September 2006, to great critical acclaim, McPherson made his National Theatre debut as both author and director with The Seafarer at the Cottesloe auditorium, starring Karl Johnson and Jim Norton, with Ron Cook as their poker-playing, Mephistophelean guest. Norton won an Olivier Award for his performance while McPherson was nominated for both the Olivier and Evening Standard Awards for Best Play. In October 2007 The Seafarer opened on Broadway, keeping with it most of its creative team, including McPherson as director and both Jim Norton and Conleth Hill in their respective roles, with David Morse taking over as Sharky, and Ciarán Hinds portraying Mr. Lockhart. The production on Broadway received some positive reviews including such statements as \"McPherson is quite possibly the finest playwright of his generation\" from Ben Brantley at The New York Times and \"Succinct, startling and eerie, and the funniest McPherson play to date\" from The Observer. Norton's performance as Richard Harkin in The Seafarer at the National Theatre won the 2007 Best Supporting Actor Laurence Olivier Award, and he won a Tony Award in 2008 for Best Featured Actor in a play."]}, {"page": "Rainbow (TV series)", "response": ["The third season of the show saw several major cast changes, some of which would remain for the entirety of the show's run. David Cook was replaced as presenter by Geoffrey Hayes, with Stanley Bates replacing Leeson in the role of Bungle, whose appearance also saw several further changes over the ensuing years. The characters of Sunshine and Moony were dropped altogether. The singers also changed; Telltale now replaced by the trio of Charlie Dore, Julian Littman and Karl Johnson. Halfway through the season, Ronnie Le Drew took over as Zippy's puppeteer.", "* Charlie Dore, Julian Littman and Karl Johnson - the singing trio who replaced Telltale in 1974. They stayed with the show before being replaced by Rod, Matt & Jane in 1975. Charlie Dore and Julian Littman went on to have hugely successful music careers, while Karl Johnson became a well-known actor."]}, {"page": "Play of the Month", "response": ["|David Daker,Lloyd McGuire,Terence Budd,Tim Woodward,Karl Johnson,Donald Hewlett,David Troughton,Terry Bale,Leslie Schofield"]}, {"page": "Mike Walker (radio dramatist)", "response": ["| Robert Lindsay, Jonathan Coy, Alison Steadman, Karl Johnson, Lydia Wilson, Andrew Scott, Paul Ready, James Lailey, Tracy Wiles, Simon Bubb, Carl Prekopp, Adjoa Andoh, Daniel Cooper, Clive Merrison, Gerard McDermott, Paul Moriarty, Christopher Webster, Adam Billington, Rikki Lawton and Alex Rivers"]}, {"page": "Rome (TV series)", "response": ["* Karl Johnson as Cato the Younger (Season 1) – An extreme traditionalist, against political, social, and moral decay, and a staunch defender of the Roman Republic. The real Cato the Younger was a Roman orator, author and politician who committed suicide to avoid living under Caesar's tyranny."]}, {"page": "Hot Fuzz", "response": ["* Karl Johnson as PC Bob Walker, the oldest officer in the Sandford police"]}, {"page": "List of Rome characters", "response": ["| Karl Johnson"]}, {"page": "A Tale of Two Cities", "response": ["*In December 2011, as part of its special season on Charles Dickens' Bicentenerary, BBC Radio 4 produced a new five-part adaptation for radio by Mike Walker with original music by Lennert Busch and directed by Jessica Dromgoole and Jeremy Mortimer which won the 2012 Bronze Sony Radio Academy Award for Best Drama. The cast included Robert Lindsay as the voice of Charles Dickens, Paul Ready as Sydney Carton, Karl Johnson as Dr Manette, Lydia Wilson as Lucie Manette, Jonathan Coy as Mr Lorry, Andrew Scott as Darnay, Alison Steadman as Miss Pross and Clive Merrison as Marquis St. Evrémonde."]}, {"page": "Pure (2002 film)", "response": ["* Karl Johnson as Grandad"]}, {"page": "The Chatterley Affair", "response": ["Also portrayed are numerous real-life participants in the trial, such as judge Mr Justice Byrne (played here by Karl Johnson), prosecutor Mervyn Griffith-Jones (Pip Torrens), defence lawyer Gerald Gardiner (Donald Sumpter) and sociologist Richard Hoggart (David Tennant)."]}, {"page": "Love Is the Devil: Study for a Portrait of Francis Bacon", "response": ["* Karl Johnson – John Deakin"]}, {"page": "David Copperfield (1999 film)", "response": ["* Karl Johnson as Tungay"]}, {"page": "List of biographical films", "response": ["||Karl Johnson"]}, {"page": "John Deakin", "response": ["Deakin was the basis for the photographer Carl Castering in Colin Wilson's novel Ritual in the Dark. Deakin was played by actor Karl Johnson in John Maybury's biographical film about Francis Bacon, Love Is the Devil: Study for a Portrait of Francis Bacon."]}, {"page": "1948 in Wales", "response": ["*1 March - Karl Johnson, actor"]}, {"page": "Ancient Rome: The Rise and Fall of an Empire", "response": ["*Karl Johnson as Marcellus"]}, {"page": "The Edge of Love", "response": ["* Karl Johnson as Dai Fred"]}, {"page": "List of Irish films", "response": ["| The Pier || Gerard Hurley || Gerard Hurley, Karl Johnson || Drama ||  "]}, {"page": "The Mysteries", "response": ["Many well known actors appeared in the productions, including Brenda Blethyn, Kenneth Cranham, Edna Doré, Lynn Farleigh, Brian Glover (as God),  Karl Johnson (as Jesus), Richard Johnson, Mark McManus, Eve Matheson (as Eve), Jack Shepherd and Robert Stephens (as Herod). ", "|Karl Johnson", "|Karl Johnson", "|Karl Johnson"]}, {"page": "Close My Eyes (film)", "response": ["Close My Eyes is a 1991 film written and directed by Stephen Poliakoff and starring Alan Rickman, Clive Owen and Saskia Reeves as well as Lesley Sharp and Karl Johnson. Music was by Michael Gibbs and the film was produced for Beambright and FilmFour International by Therese Pickard. It had a limited theatrical release from 6 September 1991,Plays: 3, Stephen Poliakoff, Methuen Drama, 1998, Introduction, pages 198. before being shown in Channel 4's Film on Four strand on 28 October 1993.The Kaleidoscope British Independent Television Drama Research Guide, Kaleidoscope Publishing, 2010, page 1857.", "* Karl Johnson as Colin"]}, {"page": "Catherine the Great (1995 film)", "response": ["*Karl Johnson as Sheshkovsky"]}, {"page": "Sons and Lovers (1981 TV serial)", "response": ["Sons and Lovers is a 1981 BBC television serial based on D. H. Lawrence's 1913 book Sons and Lovers.  It starred Eileen Atkins, Tom Bell, Karl Johnson, Lynn Dearth and Leonie Mellinger.  It was adapted by Trevor Griffiths and directed by Stuart Burge, and originally shown as seven episodes.  It aired in the US as part of the PBS's Masterpiece Theatre program in 1982."]}, {"page": "Hot Fuzz (soundtrack)", "response": ["* \"Happy Birthday\" – Jim Broadbent, Olivia Colman, Kevin Eldon, Karl Johnson, Simon Pegg & Edgar Wright"]}, {"page": "Wittgenstein (film)", "response": ["Wittgenstein is a 1993 experimental comedy-drama film directed by Derek Jarman and produced by Tariq Ali. An international co-production of the United Kingdom and Japan, the film is loosely based on the life story as well as the philosophical thinking of the philosopher Ludwig Wittgenstein. The adult Wittgenstein is played by Karl Johnson.", "* Karl Johnson as adult Wittgenstein"]}, {"page": "The Tempest (1979 film)", "response": ["The Tempest is a 1979 film adaptation of William Shakespeare's play of the same name. Directed by Derek Jarman, produced by Don Boyd, with Heathcote Williams as Prospero, it also stars Toyah Willcox, Jack Birkett and Helen Wellington-Lloyd from Jarman's previous feature, Jubilee (1977), as well as his long-time cohort Karl Johnson.", "* Karl Johnson as Ariel"]}, {"page": "List of American films of 2007", "response": ["| Hot Fuzz || Universal Pictures / StudioCanal / Working Title Films || Edgar Wright (director/screenplay); Simon Pegg (screenplay); Simon Pegg, Nick Frost, Jim Broadbent, Timothy Dalton, Bill Bailey, Bill Nighy, Martin Freeman, Steve Coogan, Cate Blanchett, Edward Woodward, Paddy Considine, Billie Whitelaw, David Bradley, Adam Buxton, Olivia Colman, Ron Cook, Kenneth Cranham, Julia Deakin, Kevin Eldon, Paul Freeman, Karl Johnson, Lucy Punch, Anne Reid, Rafe Spall, David Threlfall, Peter Wight, Stuart Wilson, Rory McCann, Robert Popper, Joe Cornish, Chris Waitt, Eric Mason, Lorraine Hilton, Patricia Franklin, Stephen Merchant, Tim Barlow, Ben McKay, Alice Lowe, Maria Charles, Peter Jackson, Garth Jennings, Edgar Wright || Action, Comedy"]}, {"page": "A Prayer for the Dying", "response": ["* Karl Johnson as Fitzgerald"]}, {"page": "When I'm 64 (film)", "response": ["The cab that picks Jim up from school is driven by Ray (Paul Freeman), a widower whose grown children, Caz (Tamzin Outhwaite) and Little Ray (Jason Flemyng), use him as an unpaid babysitter for their kids. Ray also feels lonely and unfulfilled, and the terminal illness of his friend Billy (Karl Johnson) has made him face his own mortality. He is inspired to take charge of his own life after learning of Jim's plans."]}, {"page": "Frozen (2005 film)", "response": ["*Karl Johnson as Coastguard Bill"]}, {"page": "The Seafarer (play)", "response": ["* James 'Sharky' Harkin: Karl Johnson"]}]}}