{"wiki_id": "http://www.wikidata.org/entity/Q12239847", "itemLabel": "Mohamed Larbi Zitout", "itemDescription": "Algerian activist", "wikipedia_url": "https://en.wikipedia.org/wiki/Mohamed_Larbi_Zitout", "wikipedia_page": {"main": "Mohamed Larbi Zitout (Arabic: محمد العربي زيتوت), is an Algerian political commentator and former diplomat, born on 29 July 1963 in Laghouat, Algeria.", "link_mentions": [{"page": "Index of Algeria-related articles", "response": ["Mohamed Larbi Zitout -"]}, {"page": "Rachad", "response": ["Rachad was founded in 2007 by a number of Algerian opponents of the current government, including Abbas Aroua, Mourad Dhina, Rachid Mesli, Mohamed Samraoui, and Mohamed Larbi Zitout (who comprise the movement's secretariat, and all live in exile), and others living in Algeria whose identity has not been made public. In September 2008, its founding member Abbas Aroua, through the Cordoba Foundation, organised a conference in Geneva, \"Perspectives on political change in Algeria\", which brought together Algerians from a variety of political perspectives who oppose the current system, including Rachad, to agree on a set of shared principles.\"Geneva Symposium: Perspectives for political change in Algeria\", Rachad, 2008-11-15,  Along with other groups across the political spectrum, it called for a boycott of the 2009 presidential elections; afterwards, it condemned the reported results as fraudulent (as later confirmed by WikiLeaks in 2011), and claimed that the true participation rate was just 16%. The organisation has made extensive use of TV and the Internet to spread its ideas, with spokespersons appearing on major channels including Aljazeera.Rachad's means of communication include Rachad TV and the YouTube channels YouRachad and TvRachad In January 2011, as unprecedented large-scale protests began in Algeria, it called upon its supporters to join demonstrations against the system. Rachad's pronouncements have been supportive of the Arab Spring uprisings, including the overthrow of Muammar Gaddafi in Libya, while condemning the Algerian political reforms undertaken by the Bouteflika régime as a \"masquerade\"."]}, {"page": "Mourad Dhina", "response": ["In 2007, he founded with Mohamed Larbi Zitout, Abbas Aroua, Rachid Mesli and Mohamed Samraoui, the Rachad movement, an Algerian opposition movement which advocates a radical non-violent change in the Algerian political system to establish good governance in Algeria."]}, {"page": "2010–2012 Algerian protests", "response": ["While riots on this scale are unprecedented since the 1991 election, their wider political implications are not yet clear.  The rioters had no collective ties to any Algerian political party, organisation, or trade union, and some sources commented that they seemed to have no political slogans. Some opposition groups emphasised the riots' political dimension; ex-diplomat and opposition spokesperson Mohamed Larbi Zitout described them as \"a revolt, and probably a revolution, of an oppressed people\", while the Socialist Forces Front responded to the government's lowering of food prices on 8 January with the slogan \"The government cannot buy Algerians' silence\". Agence France-Presse (AFP) has linked the January protests with events in Tunisia, stating, \"In Tunisia, similar unrest sparked the overthrow of the government of Zine Al Abidine Ben Ali, whose 23 years in power ended with his flight to Saudi Arabia last Friday. Algerian commentators have said that more Tunisia-style protests could break out in Algeria.\" Despite their scale, the riots were dealt with by the government in much the same way as the localised riots that had already become a routine way of communicating grievances: it sought to avoid creating martyrs and made a specific concession (in this case, a return to the status quo ante of allowing un-declared food sales by Cevital) not seen as threatening the overall system."]}]}}