{"wiki_id": "http://www.wikidata.org/entity/Q12240689", "itemLabel": "Muhammad Abdel-Haleem", "itemDescription": "Professor of Islamic studies", "wikipedia_url": "https://en.wikipedia.org/wiki/Muhammad_Abdel-Haleem", "wikipedia_page": {"main": "Muhammad A. S. Abdel Haleem (Arabic: محمد عبد الحليم سعيد, born 1930), , is the King Fahd Professor of Islamic Studies at the School of Oriental and African Studies, University of London (SOAS) in London, England, and editor of the Journal of Qur'anic Studies.", "link_mentions": [{"page": "Jihad", "response": ["The Hans Wehr Dictionary of Modern Written Arabic defines the term as \"fight, battle; jihad, holy war (against the infidels, as a religious duty)\". However, given the range of meanings, it is incorrect to equate it simply with \"holy war\". The notion of jihad has its origins in the Islamic idea that the whole humankind will embrace Islam. In the Qur'an and in later Muslim usage, jihad is commonly followed by the expression fi sabil illah, \"in the path of God.\"For a listing of all appearances in the Qur'an of jihad and related words, see Muhammad Fu'ad 'Abd al-Baqi, Al-Muʿjam al-Mufahras li-Alfaz al-Qur'an al-Karim (Cairo: Matabi' ash-Sha'b, 1278), pp. 182–83; and Hanna E. Kassis, A Concordance of the Qur'an (Berkeley: University of California Press, 1983), pp. 587–88. Muhammad Abdel-Haleem states that it indicates \"the way of truth and justice, including all the teachings it gives on the justifications and the conditions for the conduct of war and peace.\" "]}, {"page": "Quran translations", "response": ["In 2004, a new translation of the Qurʻan by Muhammad Abdel-Haleem was also published, with revised editions being published in 2005 and 2008."]}, {"page": "Jizya", "response": ["Muhammad Abdel-Haleem states that the term poll tax does not translate the Arabic word jizya, being also inaccurate in light of the exemptions granted to children, women, etc., unlike a poll tax, which by definition is levied on every individual (poll = head) regardless of gender, age, or ability to pay. He further adds that the root verb of jizya is j-z-y, which means 'to reward somebody for something', 'to pay what is due in return for something' and adds that it is in return for the protection of the Muslim state with all the accruing benefits and exemption from military service, and such taxes on Muslims as zakat.", "Commenting on this verse, Muhammad Sa'id Ramadan al-Buti says: Quote: «الآية أمرت بالقتال لا بالقتل، وقد علمت الفرق الكبير بين الكلمتين ... فأنت تقول: قتلت فلاناً، إن بدأته بالقتل، وتقول: قاتلته، إذا قاومت سعيه إلى قتلك بقتل مثله، أو سابقته إلى ذلك كي لا ينال منك غرة.» Translation: \"The verse commands qitāl (قتال) and not qatl (قتل), and it is known that there is a big distinction between these two words... For you say qataltu (قتلت) so-and-so if you initiated the fighting, while you say qātaltu (قاتلت) him if you resisted his effort to fight you by a reciprocal fight, or if you forestalled him in that so that he would not get at you unawares.\" (online)[T]he verse commands qitāl () and not qatl (), and it is known that there is a big distinction between these two words... For you say qataltu () so-and-so if you initiated the fighting, while you say qātaltu () him if you resisted his effort to fight you by a reciprocal fight, or if you forestalled him in that so that he would not get at you unawares.Muhammad Abdel-Haleem writes that there is nothing in the Qur'an to say that not believing in God and the Last Day is in itself grounds for fighting anyone. Whereas Abū Ḥayyān states \"they are so described because their way [of acting] is the way of those who do not believe in God,\" Ahmad Al-Maraghī comments: Quote: «أي قاتلوا من ذكروا حين وجود ما يقتضى القتال كالاعتداء عليكم أو على بلادكم أو اضطهادكم وفتنتكم عن دينكم أو تهديد منكم وسلامتكم كما فعل بكم الروم وكان ذلك سببا لغزوة تبوك» Translation: \"That is, fight those mentioned when the conditions which necessitate fighting are present, namely, aggression against you or your country, oppression and persecution against you on account of your faith, or threatening your safety and security, as was committed against you by the Byzantines, which was what led to Tabuk.\"[F]ight those mentioned when the conditions which necessitate fighting are present, namely, aggression against you or your country, oppression and persecution against you on account of your faith, or threatening your safety and security, as was committed against you by the Byzantines, which was what led to Tabuk.", "A number of translators have rendered the text as \"those who do not embrace the true faith/follow the religion of truth\" or some variation thereof. Muhammad Abdel-Haleem argues against this translation, preferring instead to render dīna'l-ḥaqq as 'rule of justice'.", "Yaser Ellethy states that the \"insignificant amount\" of the jizya, as well as its progressive structure and exemptions leave no doubt that it was not imposed to persecute people or force them to convert. Niaz A. Shah states that jizya is \"partly symbolic and partly commutation for military service. As the amount is insignificant and exemptions are many, the symbolic nature predominates.\" Muhammad Abdel-Haleem states, \"[t]he jizya is a very clear example of the acceptance of a multiplicity of cultures within the Islamic system, which allowed people of different faiths to live according to their own faiths, all contributing to the well-being of the state, Muslims through zakāt, and the ahl al-dhimma through jizya.\""]}, {"page": "List of translations of the Quran", "response": ["* Muhammad Abdel-Haleem, 2004, The Qur'an (Oxford World Classics). ()."]}, {"page": "Sword Verse", "response": ["As per Muhammad Abdel-Haleem, translator of the Quran, while contextualizing 9:5 and bringing the wider sequential narrative: It was these hardened polytheists in Arabia, who would accept nothing other than the expulsion of the Muslims or their reversion to paganism, and who repeatedly broke their treaties, that the Muslims were ordered to treat in the same way – to fight them or expel them."]}, {"page": "M.A.S Abdel Haleem", "response": ["#redirect Muhammad Abdel-Haleem"]}, {"page": "Muhammad Abdel Haleem", "response": ["#redirect Muhammad Abdel-Haleem"]}, {"page": "M.A.S. Abdul Haleem", "response": ["#REDIRECT Muhammad Abdel-Haleem"]}, {"page": "M. A. S. Abdel Haleem", "response": ["#REDIRECT Muhammad Abdel-Haleem"]}, {"page": "M. A. S. Abdel-Haleem", "response": ["#redirect Muhammad Abdel-Haleem"]}, {"page": "Abdul Halim", "response": ["* Muhammad Abdel-Haleem, Egyptian academic working in London"]}, {"page": "List of School of Oriental and African Studies people", "response": ["*Muhammad Abdel-Haleem, Islamic Studies"]}, {"page": "Library of Arabic Literature", "response": ["* Muhammad Abdel-Haleem (School of Oriental & African Studies, University of London)"]}, {"page": "Abdel-Haleem, Muhammad", "response": ["#redirectMuhammad Abdel-Haleem"]}, {"page": "Haleem, M. A. S. Abdel", "response": ["#redirectMuhammad Abdel-Haleem"]}, {"page": "MAS Abdul Haleem", "response": ["#redirectMuhammad Abdel-Haleem"]}, {"page": "MAS Abdel-Haleem", "response": ["#redirectMuhammad Abdel-Haleem"]}, {"page": "M.A.S. Abdel-Haleem", "response": ["#redirectMuhammad Abdel-Haleem"]}, {"page": "Haleem, M. A.", "response": ["#redirectMuhammad Abdel-Haleem"]}, {"page": "M.A.S. Abdel Haleem", "response": ["#redirectMuhammad Abdel-Haleem"]}, {"page": "Haleem, M.A.S. Abdel", "response": ["#REDIRECT Muhammad Abdel-Haleem"]}]}}