{"wiki_id": "http://www.wikidata.org/entity/Q1232165", "itemLabel": "William Le Queux", "itemDescription": "British writer", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Le_Queux", "wikipedia_page": {"main": "William Tufnell Le Queux () (2 July 1864 - 13 October 1927) was an Anglo-French journalist and writer. He was also a diplomat (honorary consul for San Marino), a traveller (in Europe, the Balkans and North Africa), a flying buff who officiated at the first British air meeting at Doncaster in 1909, and a wireless pioneer who broadcast music from his own station long before radio was generally available; his claims regarding his own abilities and exploits, however, were usually exaggerated. His best-known works are the anti-French and anti-Russian invasion fantasy The Great War in England in 1897 (1894) and the anti-German invasion fantasy The Invasion of 1910 (1906), the latter becoming a bestseller.\n\n", "link_mentions": [{"page": "Spy fiction", "response": ["But the term \"spy novel\" was defined by The Riddle of the Sands (1903) by Irish author Erskine Childers. The Riddle of the Sands described two British yachtsman cruising off the North Sea coast of Germany who turned amateur spies when they discover a secret German plan to invade Britain. Its success created a market for the invasion literature subgenre, which was flooded by imitators. William Le Queux and E. Phillips Oppenheim became the most widely read and most successful British writers of spy fiction, especially of invasion literature. Their prosaic style and formulaic stories, produced voluminously from 1900 to 1914, proved of low literary merit.", "The American adaptation of Casino Royale (1954) featured Jimmy Bond in an episode of the Climax! anthology series. The narrative tone of television espionage ranged from the drama of Danger Man (1960–68) to the sardonicism of The Man from U.N.C.L.E (1964–68) and the flippancy of I Spy (1965–68) until the exaggeration, akin to that of William Le Queux and E. Phillips Oppenheim before the First World War (1914–18), degenerated to the parody of Get Smart (1965–70)."]}, {"page": "1947 in literature", "response": ["**William Le Queux, English-born French novelist and writer (born 1864)"]}, {"page": "Royston, Hertfordshire", "response": ["The Battle of Royston was a fictional battle in William Le Queux' The Invasion of 1910. The book describes how a German Army invades England through East Anglia and marches on London. Royston is where a battle takes place which fails to halt their advance."]}, {"page": "William le Queux", "response": ["#REDIRECT William Le Queux"]}, {"page": "Prince Luigi Amedeo, Duke of the Abruzzi", "response": ["** On the \"Pole Star\" in the Arctic Sea (1903) by H.R.H. Luigi Amadeo of Savoy, (Duke of the Abruzzi), translated by William Le Queux, 2 vols. "]}, {"page": "Frederick Roberts, 1st Earl Roberts", "response": ["In retirement he was a keen advocate of introducing compulsory military training in Britain, to prepare for a great European war. He campaigned for this as president of the National Service League, holding the post from 1905 until 1914. In 1907 a selection of his speeches was published under the title A Nation in Arms. Roberts provided William Le Queux with information for his novel The Invasion of 1910 and checked the proofs. In 1910 Roberts' friend Ian Hamilton, in co-operation with the Secretary of State for War, Richard Haldane, published Compulsory Service in which he attacked Roberts' advocacy of compulsory military training. This caused much hurt to Roberts. He replied, with the help of Leo Amery and J. A. Cramb, with Fallacies and Facts (1911)."]}, {"page": "H. Irving Hancock", "response": ["The series may have been influenced by William Le Queux's The Great War in England in 1897 (1894) in which the French launch a surprise invasion of England and penetrate into the heart of London but are finally defeated after much desperate and heroic fighting by the British protagonists. The book was highly popular in the early Twentieth Century, and Hancock is likely to have read it."]}, {"page": "Anti-German sentiment", "response": ["Newspaper publisher Lord Alfred Harmsworth, 1st Viscount Northcliffe in 1894 commissioned author William Le Queux to write the serial novel The Great War in England in 1897, which featured France and Russia combining forces to crush Britain. Happily German intervention on Britain's side turned back France and Russia. Twelve years later, however, Harmsworth asked him to reverse enemies, making Germany the villain. The result was the bestselling The Invasion of 1910, which originally appeared in serial form in the Daily Mail in 1906.  Harmsworth now used his newspapers like \"Daily Mail\" or \"The Times\" to attack Berlin, inducing an atmosphere of paranoia, mass hysteria and Germanophobia that would climax in the Naval Scare of 1908–09.J. Lee Thompson, Politicians, the Press and Propaganda. Lord Northcliffe and the Great War, 1914–1919 (Kent State University Press, 1999). "]}, {"page": "Jack the Ripper suspects", "response": ["Alexander Pedachenko (alleged dates 1857–1908) was named in the 1923 memoirs of William Le Queux, Things I Know about Kings, Celebrities and Crooks. Le Queux claimed to have seen a manuscript in French written by Rasputin stating that Jack the Ripper was an insane Russian doctor named Alexander Pedachenko, an agent of the Okhrana (the Secret Police of Imperial Russia), whose aim in committing the murders was to discredit Scotland Yard. He was supposedly assisted by two accomplices: \"Levitski\" and a tailoress called Winberg.Le Queux, quoted in Rumbelow, p. 197 and Whitehead and Rivett, p. 103 However, there is no hard evidence that Pedachenko ever existed, and many parts of the story as recounted by Le Queux fall apart when examined closely.Begg, p. 309 For example, one of the sources named in the manuscript was a London-based Russian journalist called Nideroest, who was known for inventing sensational stories. Reviewers of Le Queux's book were aware of Nideroest's background, and unabashedly referred to him as an \"unscrupulous liar\".Quoted in Rumbelow, p. 198 Pedachenko was promoted as a suspect by Donald McCormick, who may have developed the story by adding his own inventions.Woods and Baddeley, p. 147"]}, {"page": "Legion of Frontiersmen", "response": ["*William Le Queux"]}, {"page": "Inspirations for James Bond", "response": ["Apparently, inspiration for the James Bond spy novels may have come from the writings of William Le Queux; inspiration for the James Bond films may have come from the early silent films of German director Fritz Lang, including the Dr. Mabuse films, and the 1928 film Spione.", "Besides real life individuals, James Bond was also inspired by one of Dennis Wheatley's characters; the secret agent Gregory Sallust,  based on Wheatley's late friend Gordon Eric Gordon-Tombe. It is also said that the character of James Bond took inspiration from a collection of short stories about a gentlemanly and sophisticated spy by Somerset Maugham, using his own spying experience as a basis.Morgan, 1980, p. 206. Another inspiration for the James Bond spy novels may have come from the writings of William Le Queux."]}, {"page": "Tickencote", "response": ["John Clare, when working as a lime burner, used to drink at the Flowerpot Inn, which is now the private house, Flower Pot Cottage (former Stonecroft). In 1903, William Le Queux wrote The Tickencote Treasure."]}, {"page": "The Riddle of the Sands", "response": ["Though wars with Germany would become a central issue for Britain for much of the first half of the 20th century, few Britons anticipated that before 1900. Historically, it was France which was the traditional enemy of England and Britain, from the Hundred Years' War until the Napoleonic Wars. Just nine years before The Riddle of the Sands, William Le Queux published The Great War in England, raising the specter of a French surprise invasion of England, reaching London – with Germany cast as Britain's loyal ally, rushing to help and in the nick of time saving England from the evil French; as evident from the great success of this book when published in 1894, the British public at that time took seriously the idea of a French threat and a German ally. But Emperor Wilhelm II's policy of building up the German Navy and challenging British sea power effected a change in the actual power relations - reflected in the specific literary genre of invasion novels and the identity assigned to the possible invader of British soil."]}, {"page": "Max Pemberton", "response": ["Pemberton was the editor of boys' magazine Chums in 1892–1893 during its heyday.  Between 1896 and 1906 he also edited Cassell's Magazine (see ), in which capacity he published the early works of R. Austin Freeman and William Le Queux."]}, {"page": "Lost world", "response": ["*The Great White Queen: A Tale of Treasure and Treason by William Le Queux"]}, {"page": "Invasion literature", "response": ["William Le Queux was the most prolific author of the genre; his first novel was The Great War in England in 1897 (1894) and he went on to publish from one to twelve novels a year until his death in 1927. His work was regularly serialised in newspapers, particularly the Daily Mail, and attracted many readers. It is believed Ian Fleming's James Bond character was inspired by Le Queux's agent \"Duckworth Drew\". In some ways The Great War can be considered an antithesis to The Battle of Dorking – with the one ending for Britain in sombre and irrevocable defeat and decline, while in the other the invasion of London is pushed back in the last moment (with the help of Germany, portrayed as a staunch ally against France and Russia), with enormous territorial aggrandizement (Britain gets Algeria and Russian Central Asia; \"Britannia\" becomes \"Empress of the World\").", "*The Great War in England in 1897 (1894) by William Le Queux", "*The Invasion of 1910 (1906) by William Le Queux", "*Spies of the Kaiser (1909) by William Le Queux", "* The Terror of the Air by William Le Queux (1920)"]}, {"page": "Before Armageddon", "response": ["*\"The Great War in England in 1897\" - William Le Queux (Answers, 1893)"]}, {"page": "The Great War in England in 1897", "response": ["The Great War in England in 1897 was written by William Le Queux and published in 1894.", "*William Le Queux (1894). The Great War in England in 1897. From Internet Archive."]}, {"page": "The Swoop!", "response": ["In writing The Swoop, Wodehouse was responding to an upsurge in the popularity of the invasion genre: 1909 marked \"the year of greatest suppuration\"  of the genre. William Le Queux's The Invasion of 1910 had been serialised in the Daily Mail and was a best-seller, while Guy du Maurier's play, An Englishman's Home, which had opened at Wyndham's Theatre on 27 January, was a theatrical sensation, playing in three London theatres simultaneously. "]}, {"page": "Otto Penzler", "response": ["On April 8, 2010 Swann Galleries auctioned The Otto Penzler Collection of British Espionage and Thriller Fiction. The sale represented a select portion of Penzler's private library with works by Eric Ambler, Ian Fleming, Graham Greene, John le Carré, William Le Queux, H. C. McNeile, E. Phillips Oppenheim, and Dennis Wheatley. Penzler also befriended many noted authors including Ambler, Ken Follett, John Gardner and others, who inscribed copies of their works. \"British spy novels are among the greatest of all works in the mystery genre\", Penzler said in the introduction to the Swann auction catalogue. \"This is the first auction ever devoted entirely to this important literary genre.\""]}, {"page": "Rape of Belgium", "response": ["Agreeing with the analysis of historian Susan Kingsley Kent, historian Nicoletta Gullace writes that \"the invasion of Belgium, with its very real suffering, was nevertheless represented in a highly stylized way that dwelt on perverse sexual acts, lurid mutilations, and graphic accounts of child abuse of often dubious veracity.\" In Britain, many patriotic publicists propagated these stories on their own. For example, popular writer William Le Queux described the German army as \"one vast gang of Jack-the-Rippers\", and described in graphic detail events such as a governess hanged naked and mutilated, the bayoneting of a small baby, or the \"screams of dying women\", raped and \"horribly mutilated\" by German soldiers, accusing them of cutting off the hands, feet, or breasts of their victims."]}, {"page": "Mario Benzing", "response": ["Between the two World Wars he wrote several novels and biographies of historical figures in Italian. These figures included Messalina, Cleopatra and the Queen Christina of Sweden. As a literary translator from English, German and French, he specially devoted his work, often as first Italian translator, to Rudyard Kipling, Joseph Conrad (first Italian translation of The Shadow Line in 1929), Jack London (first Italian translation of The Mutiny of the Elsinore in 1928), Arthur Schnitzler, Lewis Carroll, D. H. Lawrence (first Italian translation of The Rainbow in 1937), P. G. Wodehouse, Edgar Wallace, Hugh Walpole, Edgar Allan Poe, Vicki Baum, H. G. Wells (first Italian translation of The World of William Clissold in 1931), Ernst Theodor Amadeus Hoffmann, Ehm Welk, Eduard von Keyserling, Jakob Wassermann, Joseph Hergesheimer, Robert Louis Stevenson, Helen Hunt Jackson, Sigrid Undset, Edgar Rice Burroughs, Guy Boothby, William Le Queux, Sax Rohmer, Rose Macaulay, Richard Marsh, Alice Muriel Williamson and many others, showing a special sensitiveness in translating original poems in Italian verses."]}, {"page": "Politics in fiction", "response": ["* The Czar's Spy (1905) by William Le Queux"]}, {"page": "Official Secrets Act 1911", "response": ["The Act was passed during a febrile period of \"spy fever\" in the years leading up to the First World War, with widespread anti-German sentiment in Britain provoked by the Anglo-German naval arms race and events such as the Kruger telegram and the Agadir Crisis. These fuelled numerous press and literary accounts of imaginary German undercover activities, such as William Le Queux's 1909 book, Spies for the Kaiser. Plotting the downfall of England.  By the end of 1908, newspapers were receiving hundreds of fanciful letters detailing the activities of suspected German spies. For example, a letter in the Morning Post in May 1907 claimed that there were 90,000 German reservists and spies in Britain, with weapons caches for them in every major city, whilst an article in the 1909 edition of The Annual Register alleged that 50,000 Mauser rifles stored in a cellar near Charing Cross were intended for the 66,000 German reservists rumoured to be in London. Invasion fiction also became extremely popular, with novels such as Erskine Childers' 1903 The Riddle of the Sands, Le Queux's The Invasion of 1910 serialised by the Daily Mail in 1906, and Saki's When William Came of 1913."]}, {"page": "British Empire in fiction", "response": ["* The Great War in England in 1897 (1894) by William Le Queux is another invasion literature novel depicting the invasion of Britain by the French with their Cossack allies, with the invading forces penetrating into London - but the British saved in the nick of time by the intervention of their staunch German allies led by the Kaiser..."]}, {"page": "1906 in the United Kingdom", "response": ["* William Le Queux and H. W. Wilson's invasion literature novel The Invasion of 1910 (originally serialised in the Daily Mail from 19 March)."]}, {"page": "Strychnine poisoning", "response": ["* In \"The Fox Hunter\" chapter of William Le Queux's Secrets of the Foreign Office, a strychnine derivative is suspected in the murder of Beatrice Graham and the attempted murder of the protagonist Duckworth Drew. The poison was applied to pins concealed in Graham's fur shawl and Drew's hotel towel."]}, {"page": "The Rivals of Sherlock Holmes (TV series)", "response": ["| 2.10 || The Secret of the Fox Hunter || Duckworth Drew of the Secret Service || William Le Queux || Derek Jacobi"]}, {"page": "The Back Door (fiction)", "response": ["The Back Door was an anonymous work of invasion literature serialised in Hong Kong newspaper The China Mail from 30 September through 8 October 1897. The work, written in the form of a historical account, describes an imagined Russian and French landing at Hong Kong's Deep Water Bay, followed by shelling of Victoria Peak, a sea battle in the Sulphur Channel between Hong Kong Island and Green Island, and a last stand at Stonecutters Island in which British forces were decisively defeated. The story was intended as a criticism of the lack of British funding for the defence of Hong Kong; fears of invasion were driven by French expansionism in Southeast Asia and increasing Russian influence in Manchuria. It was speculated, but never proven, that members of the Imperial Japanese Army read the book in preparation for the 1941 Battle of Hong Kong, in which Japanese forces overran Hong Kong (via the New Territories, rather than Hong Kong Island) in just 18 days. In terms of its style, it follows the model laid out by George Tomkyns Chesney's The Battle of Dorking, but is noteworthy for its attention to detail, even giving real names of individual soldiers and ships; one reviewer described it as \"unique\" in its verisimilitude, stating that only William Le Queux's The Invasion of 1910 and Cleveland Moffett's The Conquest of America could compare to it."]}, {"page": "The Rivals of Sherlock Holmes (book series)", "response": ["| William Le Queux || \"The Secret of the Fox Hunter\" || Duckworth Drew"]}, {"page": "Herbert Wrigley Wilson", "response": ["Other than his newspaper work, Wilson was also co-author, with William Le Queux, of a novel entitled The Invasion of 1910 (1906), and was the author of numerous books about naval and military history:"]}, {"page": "The Invasion of 1910", "response": ["The Invasion of 1910 is a 1906 novel written mainly by William Le Queux (along with H. W. Wilson providing the naval chapters). It is one of the most famous examples of invasion literature. It is viewed by some as an example of pre-World War I Germanophobia. It can also be viewed as prescient, as it preached the need to prepare for war with Germany."]}, {"page": "Hal Hurst", "response": ["*The Great Court Scandal (1907) (written by William Le Queux)"]}, {"page": "Edgar Speyer", "response": ["The end of the 19th century and the first decade of the 20th century saw rising anti-German sentiment in Britain.  As the naval arms race between Britain and Germany escalated, distrust of Germans and those of German origin was stirred-up by press warnings of the rising military threat from Germany. This was developed further in popular magazines such as the National Review and in novels such as Erskine Childers' The Riddle of the Sands and invasion novels such as William Le Queux's The Invasion of 1910."]}, {"page": "Balmaclellan", "response": ["William Le Queux  (1864-1927) His novels The Czar's Spy (1905) and The Place of Dragons (1916) have scenes set in the area."]}, {"page": "Invasion of England", "response": ["* The Great War in England in 1897 and The Invasion of 1910 by William Le Queux"]}, {"page": "The Globe (London newspaper)", "response": ["Staff of the newspaper included William Davenport Adams, Arthur Morrison,Ernest A. Treeton, William Le Queux,Official Publisher Site of William Le Queux Retrieved 15 October 2013. and P. G. Wodehouse, who took over from William Beach Thomas as assistant to Harold Begbie on the \"By the Way\" column and eventually succeeded Begbie in 1904. Wodehouse's career at the newspaper coincided with those of Charles H. Bovill and Herbert Westbrook.Jasen, David A. (2002) P.G. Wodehouse: A Portrait of a Master, pp. 42–50. Music Sales Group. Google Books. Retrieved 15 October 2013. Under Aitken (Beaverbrook) the \"By the Way\" column was moved to the Daily Express, where it was signed 'Beachcomber'."]}, {"page": "History of espionage", "response": ["The spy novel emerged as a distinct genre of fiction in the late 19th century; it dealt with themes such as colonial rivalry, the growing threat of conflict in Europe and the revolutionary and anarchist domestic threat. The \"spy novel\" was defined by The Riddle of the Sands (1903) by author Erskine Childers, which played on public fears of a German plan to invade Britain (an amateur spy uncovers the nefarious plot). In the wake of Childers's success there followed a flood of imitators, including William Le Queux and E. Phillips Oppenheim."]}]}}