{"wiki_id": "http://www.wikidata.org/entity/Q1235523", "itemLabel": "Watson Cheyne", "itemDescription": "British surgeon and bacteriologist (1852-1932)", "wikipedia_url": "https://en.wikipedia.org/wiki/Watson_Cheyne", "wikipedia_page": {"main": "Sir William Watson Cheyne, 1st Baronet,  (14 December 1852 – 19 April 1932) was a Scottish surgeon and bacteriologist, who pioneered the use of antiseptic surgical methods in the United Kingdom.", "link_mentions": [{"page": "Joseph Lister", "response": ["On the 11 September 1877, Joseph and Aggie moved to London and the couple found a house at 12 Park Crescent, Regent's Park.  Lister began teaching on the first day of October. The hospital made it mandatory that all students should attend Lister's lecturers.  Attendance was small compared to the four hundred who would regularly attend his classes in Edinburgh. Lister's conditions of employment were met, but he was only provided with 24 beds, instead of the 60 beds that he was used to in Edinburgh. Lister stipulated that he should be able to bring from Edinburgh four people who would constitute the core of his new staff at the hospital. These were  Watson Cheyne who became his assistant surgeon, John Stewart, an anatomical artist and senior assistant, along with W.H. Dobie and James Altham who were Lister's dressers (surgical assistants who dressed wounds). There was considerable friction at Lister's first lecture, both from students who heckled him and staff. Even the nurses were hostile. This was clearly illustrated in October 1877 when a patient, Lizzie Thomas, who travelled from Edinburgh Royal Infirmary to be treated for a Psoas abscess, was not admitted due to not having the correct paperwork. Lister could hardly believe that such a lack of sympathy from imperious nurses could exist. More so, such a state of mind was a real danger to his patients, as it depended on loyal staff to carry out the preparations required for antiseptic surgery."]}, {"page": "Royal College of Surgeons of England", "response": ["| Sir William Watson Cheyne || 1914–16"]}, {"page": "William Watson", "response": ["* Watson Cheyne or Sir William Watson (1852–1932), 1st Baronet Cheyne, Scottish surgeon and bacteriologist"]}, {"page": "Edinburgh and St Andrews Universities (UK Parliament constituency)", "response": ["| Sir Watson Cheyne"]}, {"page": "William Watson Cheyne", "response": ["#REDIRECT Watson Cheyne"]}, {"page": "List of people born at sea", "response": ["| Watson Cheyne, 1st BaronetCheyne, Sir William Watson, 1st Baronet. (2007). In Encyclopædia Britannica. Retrieved March 9, 2007, from Encyclopædia Britannica Online."]}, {"page": "William Watson, 1st Baronet Cheyne", "response": ["#REDIRECT Watson Cheyne"]}, {"page": "Sir William Watson Cheyne, 1st Baronet", "response": ["#REDIRECT Watson Cheyne"]}, {"page": "List of Conservative Party MPs (UK)", "response": ["*Sir Watson Cheyne, 1st Baronet"]}, {"page": "Sir William Watson, 1st Baronet Cheyne", "response": ["#REDIRECT Watson Cheyne"]}, {"page": "Sir William Cheyne, 1st Baronet", "response": ["#REDIRECT Watson Cheyne"]}, {"page": "Hunterian Oration", "response": ["*1915 Sir William Watson Cheyne, The Treatment of Wounds in War "]}, {"page": "Sir Watson Cheyne, 1st Baronet", "response": ["#REDIRECT Watson Cheyne"]}, {"page": "1917 Edinburgh and St Andrews Universities by-election", "response": ["The Edinburgh and St Andrews Universities by-election of 1917 was held on 10 August 1917.  The by-election was held due to the incumbent Conservative MP, Sir Christopher Johnston, becoming a Senator of the College of Justice.  It was won by the Conservative candidate Watson Cheyne, who was unopposed due to a War-time electoral pact.", "At a meeting of the electors on 10 August 1917, Sir William Watson Cheyne, Professor of Clinical Surgery at King's College, London, was elected in place of Sir Christopher Nicholson Johnston KC, who has been appointed to judicial office.The Times, 11 August 1917"]}, {"page": "List of fellows of the Royal Society elected in 1894", "response": ["# William Watson Cheyne (1852–1932)"]}, {"page": "Watson (given name)", "response": ["* Watson Cheyne (1852–1932), Scottish surgeon and bacteriologist"]}, {"page": "Johnnie Notions", "response": ["The only known remaining work of Notions is a wig stretching block that was made for James Cheyne, 7th Laird of Tangwick (the great-grandfather of Sir William Watson Cheyne), who was the laird of the area around Eshaness. The block is said to have been made in the image of a man from Hillswick who contracted smallpox and was treated by Notions. It is made from a worm-eaten piece of wood, the holes of which were filled with smaller pieces of wood to portray the smallpox scars on the man's face. The wig block is now kept in the Shetland Museum."]}, {"page": "List of University of Aberdeen people", "response": ["Prominent alumni of the medical faculty include Patrick Manson, who first proposed malaria was transmitted by mosquito, and was the founder of the tropical medicine field, the London School of Hygiene & Tropical Medicine, and the Dairy Farm in 1886. Robert Brown, botanist and discoverer of Brownian motion, William Watson Cheyne, pioneer in the use of antiseptic surgical methods under Joseph Lister, Neil Arnott, inventor of the waterbed and one of the founders of University College London, Kai Ho, politician, co-founder of the University of Hong Kong and teacher of Sun Yat-sen, Peter Shepherd, who introduced the concept of teaching first aid to civilians, James Cantlie, pioneer in the use of first aid, William Wilson Jameson, Chief Medical Officer (1942–44) and an important figure in the development of the National Health Service, Graeme Catto, former President of the General Medical Council, Alexander Ogston, discoverer of Staphylococcus aureus, Alexander Stuart, Alexander Mowat, pioneer of paediatric hepatology, John Mudge, Robert Daniel Lawrence, founder of the British Diabetic Association, Joseph Adams, founder of medical genetics, and Arthur Keith, discoverer of the sinoatrial node. The first full-body MRI scanner was also invented in Aberdeen. Nora Wattie OBE, pioneer for women and children's health care in Glasgow slums."]}, {"page": "List of honorary medical staff at King Edward VII's Hospital for Officers", "response": ["|Sir Watson Cheyne ||1852 – 1932 || ||100px|Watson Cheyne2 ||"]}]}}