{"wiki_id": "http://www.wikidata.org/entity/Q1231122", "itemLabel": "David Wilkie Wynfield", "itemDescription": "British artist (1837-1887)", "wikipedia_url": "https://en.wikipedia.org/wiki/David_Wilkie_Wynfield", "wikipedia_page": {"main": "David Wilkie Wynfield (1837 – 26 May 1887) was a British painter and photographer.\nWynfield was distantly related to the Scottish artist David Wilkie, after whom he was named. Born in India, he was originally intended by his family for the priesthood, but instead chose art as a profession. He studied at Leigh's art school in the 1850s and his first painting was accepted for the Royal Academy summer exhibition in 1859.\nWynfield associated with a group of other artists who became known as the St. John's Wood Clique. Their work typically took the form of anecdotal historical narratives. Wynfield himself painted many works set in Medieval or Renaissance Europe, concentrating on romantic problems of couples.In the 1860s Wynfield became interested in photography. He developed a technique of shallow-focus portrait photography which he passed on to Julia Margaret Cameron, who later acknowledged him as the main influence on her own work, writing that \"to my feeling about his beautiful photography I owed all my attempts and indeed consequently all my success\".Many of Wynfield's photographs portrayed members of the St. John's Wood Clique and their friends in fancy dress. The combination of soft focus, close-up, large-format print and historical costumes produced a photographic style that was completely original at the time. Wynfield was attempting to imitate the painterly effects of old master artists such as Titian, using the new medium. A selection of the photographs was published in 1864 as a book entitled The Studio: A Collection of Photographic Portraits of Living Artists, Taken in the Style of Old Masters, by an Amateur.\nAs with many of the subjects of his photographs Wynfield served in The Artists' Rifles. He reached the rank of Captain and was commanding 'H' Company in 1880.\nIn his autobiography his friend Henry Stacy Marks said that Wynfield died of consumption.\n\n", "link_mentions": {}}}