{"wiki_id": "http://www.wikidata.org/entity/Q12326285", "itemLabel": "Martin Lowson", "itemDescription": "British aerospace engineer", "wikipedia_url": "https://en.wikipedia.org/wiki/Martin_Lowson", "wikipedia_page": {"main": "Professor Martin Lowson (5 January 1938 – 14 June 2013) was an aeronautical engineer.  He held a number of senior academic appointments in UK and US universities, was a co-patentee of the BERP helicopter rotor system, and also made a significant contribution to the development of personal rapid transport systems.", "link_mentions": [{"page": "King's School, Worcester", "response": ["| Martin Lowson || (1938–2013) || Aeronautical engineer; Professor, University of Bristol"]}, {"page": "ULTra (rapid transit)", "response": ["The system was originally designed by Martin Lowson and his design team; Lowson had put £10 million into the project. He formed Advanced Transport Systems (ATS) in Cardiff to develop the system, and the site was later the location of its test track. Ultra has twice been awarded funding from the UK National Endowment for Science, Technology and the Arts (NESTA).\"Martin Lowson, Advanced Transport Systems Ltd awardee profile\"  NESTA milestones Much of the original research on Ultra was done by the Aerospace Engineering department at the University of Bristol in the 1990s. Recently, the company renamed itself to \"Ultra PRT Limited\" because of its primary business, and it moved its corporate headquarters to Bristol."]}, {"page": "BERP rotor", "response": ["The BERP rotor blade design was developed under the British Experimental Rotor Programme. The initial BERP rotor blades were developed in the late 1970s to mid-1980s as a joint venture programme between Westland Helicopters and the Royal Aircraft Establishment (RAE), with Professor Martin Lowson as a co-patentee. The goal was to increase the helicopters lifting-capability and maximum speed using new designs and materials."]}, {"page": "2013 in the United Kingdom", "response": ["**Martin Lowson, 75, aeronautical engineer."]}, {"page": "Deaths in June 2013", "response": ["*Martin Lowson, 75, English aeronautical engineer.Professor Martin Lowson"]}, {"page": "Martin Lowson (Aeronautical Engineer)", "response": ["#REDIRECT Martin Lowson"]}, {"page": "Lowson, Martin", "response": ["#redirectMartin Lowson"]}]}}