{"wiki_id": "http://www.wikidata.org/entity/Q12406978", "itemLabel": "Herbert Dowbiggin", "itemDescription": "British colonial policeman in Ceylon 1913-1937", "wikipedia_url": "https://en.wikipedia.org/wiki/Herbert_Dowbiggin", "wikipedia_page": {"main": "Sir Herbert Layard Dowbiggin  (26 December 1880 – 24 May 1966) was the eighth British colonial Inspector General of Police of Ceylon from 1913 to 1937, the longest tenure of office of an Inspector General of Police (IGP). He was called the 'Father of Colonial Police'. He was knighted in 1931.", "link_mentions": [{"page": "Mark Anthony Bracegirdle", "response": ["He took an active part in organising a public meeting on Galle Face Green in Colombo on 10 January 1937 to celebrate Sir Herbert Dowbiggin's departure from the island. It was called by the LSSP to protest against the atrocities claimed to have been committed during Dowbiggin's long tenure as Inspector General of Police, particularly during the 1915 riots. In March, he was co-opted to serve on the executive committee."]}, {"page": "Sri Lankan independence movement", "response": ["In 1915 commercial-ethnic rivalry erupted into a riot in the Colombo against the Muslims, with Christians participating as much as Buddhists. The British colonial authorities reacted heavy-handedly, as the riot was also directed against them. Dharmapala had his legs broken and was confined to Jaffna; his brother died there. Captain D. E. Henry Pedris, a militia commander was shot for mutiny. Inspector-General of Police Herbert Dowbiggin became notorious for his methods. Hundreds of Sinhalese Buddhists were arrested by the British colonial government during the Riots of 1915. Those imprisoned without charges included future leaders of the independence movement; F.R. Senanayake, D. S. Senanayake, Anagarika Dharmapala, Dr C A Hewavitarne, Arthur V Dias, H. M. Amarasuriya, Dr. W. A. de Silva, Baron Jayatilaka, Edwin Wijeyeratne, A. E. Goonesinghe, John Silva, Piyadasa Sirisena and others.An illustrious son of Sabaragamuwa. Daily News, retrieved on 20 October 2007.", "On 28 November 1936, at a meeting in Colombo, the president of the LSSP, Dr. Inusha de Silva, introduced Mark Anthony Bracegirdle, a British/Australian former planter saying: 'This is the first time a white comrade has ever attended a party meeting held at a street corner.' He made his first public speech in Sri Lanka, warning that the capitalists were trying to split the workers of Sri Lanka and put one against the other. He took an active part in organising a public meeting called by the LSSP on Galle Face Green in Colombo on 10 January 1937 to celebrate Sir Herbert Dowbiggin's departure from the island and to protest against the actions of the police during his tenure as Inspector General. In March, he was co-opted to serve on the executive committee."]}, {"page": "Charles Tegart", "response": ["* Herbert Dowbiggin, British colonial policeman"]}, {"page": "Palestine Police Force", "response": ["In January 1930, Herbert Dowbiggin, colonial Inspector General of Police of Ceylon, was sent to Palestine to advise on the re-organization of the Palestine Police Force, and his report was submitted in May of that year. It was a highly confidential document which it was considered impossible to publish at the time.League of Nations Permanent Mandates Commission , Minutes of the Meeting held at Geneva from June 9th to June 27th, 1931."]}, {"page": "Milden, Suffolk", "response": ["*Herbert Dowbiggin (1880-1966), policeman and eighth British colonial Inspector General of Police of Ceylon from 1913 to 1937."]}, {"page": "E. W. Perera", "response": ["During the First World War, in 1915 commercial and ethnic rivalries erupted into riots throughout British Ceylon by Buddhists and Christians against Muslims. Fearing an possible uprising, the inexperienced Governor of Ceylon Sir Robert Chalmers declared martial law on 2 June 1915 and on the advice of Inspector General Herbert Dowbiggin began to suppress the riots by issuing orders to the colonial police and military to summarily execute anyone they deemed  to be a rioter.  Many prominent Sri Lankans such as D. S. Senanayake, D. R. Wijewardena, Arthur V. Dias, Dr. Cassius Pereira, Dr. W. A. de Silva, F.R. Dias Bandaranaike, H. W. Amarasuriya and A.H. Molamure were imprisoned and Captain D.E.Henry Pedris, a militia commander, was executed on the charge of mutiny."]}, {"page": "Herbert Layard Dowbiggin", "response": ["#Redirect Herbert Dowbiggin"]}, {"page": "Charles Alwis Hewavitharana", "response": ["He was imprisoned in 1915 along with his brother Edmund Hewavitarne (who later died in prison), D. S. Senanayake, D. R. Wijewardena following the Muslim riots. Fearing an uprising the inexperienced British colonial Governor of Ceylon Sir Robert Chalmers declared Martial Law on 2 June 1915 and on the advice of Inspector General of Police Herbert Dowbiggin began a brutal suppression of the Sinhala Buddhist community by giving orders to the Police and the Army to shoot any one who they deemed a rioter without a trial, it is said that the numbers of Sinhalese killed this way were in the thousands. Many local leaders were imprisoned and Captain D.E.Henry Pedris, a military officer, was executed based on false charges of mutiny."]}, {"page": "Mandatory Palestine", "response": ["* Herbert Dowbiggin (1880–1966) – police expert"]}, {"page": "1915 Sinhalese-Muslim riots", "response": ["The following day, the 29 May rumors spread around the city after some Indian Moors claim to have a group of Afghan fighters coming up from Colombo to raze to the ground the Temple of the Sacred Tooth Relic in Kandy, which was the holiest of places of worship for the Buddhist in the island. Soon crowds gathered in the city and peasants from the nearby villages came to the city to defend their Temple. Soon more cases of violence were reported when a mostly Buddhist mobs attacked Moorish bazaars. The first bloodshed of the riots was reported when an Indian Moor shot dead an eighteen year old Sinhalese boy in Colombo Street, in Kandy and the shooter was not arrested by the policemen who witnessed it. This aggravated the situation and rioting escalated. Shops in the bazaars were damaged, Sinhalese bazaars were attacked by Moors, Moorish buildings in Katugastota and Mahaiyawa were damaged. In Kandy the police took steps to control the rioting and police reinforcements were brought in from Colombo. On leaning a train load of Moors were enrout to Kandy, the Government Agent ordered the carriages halted at Katugastota, faced with arrest these Moors returned to Colombo the following day. Herbert Dowbiggin, the Inspector General of Police (IGP) was dispatched to Kandy with a detachment of 50 soldiers from the 28th Punjabi Regiment which was stationed in Colombo and arrived in Kandy at 3 AM on 30 May. In the morning of 30 May several leading gentlemen of Kandy, Dunuwille Dissawa, Advocate Arthur Perera and Cudah Ratwatte met with Vaughan, the Government Agent and IGP Dowbiggin. By this time several persons have been killed and wounded in the rioting, including a government clerk. 60 members of the Trinity College, Kandy cadet contingent were sworn in as special constables which included teachers and students. They were deployed to deter riots on Trincomalee Steet. Soon Vaughan and IGP Dowbiggin came to Trincomalee Steet by car, with the rioters not dispersing, Dowbiggin left and return on foot with the Punjabis and constables, forcing the rioters to disperse without firing a shot. The cadets were ordered to patrol the streets and the Punjabis mounted sentries at key locations in the city. The lack of police action aggravated the rioting, the presence of the Punjabi soldiers deterred the rioters, who dispersed to other parts by foot and train, along the railway line to Rambukkan, Polgashawela, Alawwa, Ambepussa, Meerigama, Veyangoda, Henaratgoda and Kelaniya towards Colombo. Policing in the rural areas were carried out by unpaid Vidanes who were petty headmen reporting to the local headmen and the Government Agent, uniformed and paid Constables were stationed only far between along major roads. These two groups rarely co-operated, if at all. "]}, {"page": "Timeline of intercommunal conflict in Mandatory Palestine", "response": ["* The British enlarge their garrison in Mandatory Palestine: They have two infantry battalions, 2 RAF squadrons and 4 squadrons of armoured cars. The Palestine Police Force is re-organised by Sir Herbert Dowbiggin and isolated Jewish settlements are given arms caches to be used if under attack."]}, {"page": "F. B. Walgampahe", "response": ["F. B. Walgampahe (18?? - 1915) was the Basnayaka Nilame (the Lay Chief) of the Ancient Temple of Gadaladeniya in Gampola, Kandy. He was accused as an instigator of the 1915 Ceylonese Riots by Herbert Dowbiggin, the Inspector General of Police and died in the custody of the colonial authorities in the early part of the riots.Leveling Crowds: Ethnonationalist Conflicts and Collective Violence in South ...  By Stanley Jeyaraja Tambiah \"Memorandum upon recent disturbances in Ceylon\" "]}, {"page": "Deaths in May 1966", "response": ["* Sir Herbert Dowbiggin, British Inspector General of Police of Ceylon (b. 1880)"]}, {"page": "Stanley Senanayake", "response": ["Don Stanley Ernest Perera Rajapakse Senanayake (23 August 1918 – 18 December 1989) was the 18th Inspector General of the Sri Lanka Police (IGP) (1970–1978). Senanayake is the second longest serving IGP, after Sir Herbert Dowbiggin (who served 24 years), remaining in the position for seven years."]}, {"page": "Index of Sri Lanka–related articles (H)", "response": ["# Herbert Dowbiggin"]}]}}