{"wiki_id": "http://www.wikidata.org/entity/Q1242516", "itemLabel": "Reginald Marsh", "itemDescription": "English actor (1926-2001)", "wikipedia_url": "https://en.wikipedia.org/wiki/Reginald_Marsh_(actor)", "wikipedia_page": {"main": "Reginald Albert Saltmarsh, known by the stage name Reginald Marsh (17 September 1926 – 9 February 2001), was an English actor who is best remembered for supporting roles in many British sitcoms from the 1970s onwards.", "link_mentions": [{"page": "An Inspector Calls", "response": ["A selection of scenes from the play were broadcast in the ITV series Conflict on 15 May 1967. Produced by Associated Television, the 25-minute programme was directed by George More O'Ferrall, and starred Reginald Marsh as Arthur Birling, Julian Curry as Eric, Margo Andrew as Sheila, Pauline Winter as Mrs Birling, Stuart Saunders as Inspector Goole, Michael Graham as Gerald Croft, and Ann Dimitri as Edna."]}, {"page": "The Good Life (1975 TV series)", "response": ["*Reginald Marsh – Andrew/Sir"]}, {"page": "Peter Tinniswood", "response": ["The short-lived ITV series Never Say Die (1970) drew on Tinniswood's days as a hospital porter. Set in Victoria Memorial Hospital, the show focused on the comedy created between the patients and staff. It starred Reginald Marsh and Patrick Newell."]}, {"page": "George and Mildred", "response": ["*Reginald Marsh as Humphrey Pumphrey", "During 1977, Brian Murphy and Yootha Joyce, joined at one point by Reginald Marsh, toured in a successful stage version of the programme. The tour included appearances at The King's Theatre, Edinburgh. In 1976 and 1977, Murphy and Joyce appeared as the ugly sisters, Georgina and Mildred, in the London Palladium pantomime, Cinderella."]}, {"page": "Randall and Hopkirk (Deceased)", "response": ["*Reginald Marsh"]}, {"page": "Bill Kenwright", "response": ["Kenwright tried his hand at record production in 1969, producing two singles for Manchester band Money, who also worked as his backing band for several cabaret gigs in Oldham and at Allinson's, Liverpool. The first record, \"Come Laughing Home\", was the title music for Kenwright's first foray into theatrical production, with Reginald Marsh (also a star of Coronation Street) as co-producer. The show starred Anne Reid, who at the time was playing Valerie Barlow in Coronation Street. It was the first time a Coronation Street star had worked in live theatre whilst still acting in the series. The show opened at Blackpool's Grand Theatre. The single was also released in Argentina."]}, {"page": "Comedy Playhouse", "response": ["A Girl's Best Friend (3 July 1974) starring Zena Walker and Reginald Marsh"]}, {"page": "The Wednesday Play", "response": ["| Reginald MarshRhoda LewisJohn Collin"]}, {"page": "It Happened Here", "response": ["The film had an estimated cast of 900, all volunteers, with several professional actors among them Sebastian Shaw and Reginald Marsh. A number of the extras in the film were members of British science fiction fandom, and a portion was previewed at a science fiction convention in Peterborough.Linwood, Jim. \"The Third Reich: My Part in its Downfall\"; e*I*25 (Vol. 5 No. 2), April 2006 (Earl Kemp, ed.)Skyrack #71, 20 Oct. 1964 (Ron Bennett, ed.) Many of the British fascists in the film were former members of the British Union of Fascists, and similarly, German ex-servicemen portrayed SS and Wehrmacht soldiers and airmen.Kevin Brownlow: How It Happened Here. UKA Press, London/Amsterdam/Shizuoka 2007, . The key role of Pauline, a nurse evacuated from Salisbury to London, was played by Pauline Murray. The film was partially shot in Grim's Dyke. Though the cast was almost entirely amateur, It Happened Here helped to launch the career of its cinematographer, Peter Suschitzky, who went on to work on such films as The Rocky Horror Picture Show and The Empire Strikes Back."]}, {"page": "The Champions", "response": ["| colspan=\"5\" style=\"background-color: white;\" |After a nuclear submarine is stolen by ex-Nazis who are determined to use it to continue the war, the Champions are tasked with hunting it down.With Joseph Furst, John Woodvine, Reginald Marsh, Gábor Baraker"]}, {"page": "Terry and June", "response": ["*Reginald Marsh – Sir Dennis Hodge", "Terry works for \"Playsafe Fire Extinguishers and Appliances\", and his boss is Malcolm Harris. In a continuity error his surname is sometimes referred to as Laurence instead of Harris. Malcolm frequently has affairs, and he and his wife Beattie, a friend of June, frequently argue. The owner of Terry's company is Sir Dennis Hodge (played by Reginald Marsh who played a similar character in The Good Life), a grumpy man who rules the company with a rod of iron. His personal secretary of over 20 years is Miss Nora Fennell, whose fondness for Sir Dennis is not returned."]}, {"page": "Only When I Laugh (TV series)", "response": ["Guest appearances have been made by Gwen Taylor, John Quayle, Neil McCarthy, Patrick Troughton, Moira Lister, Pat Ashton, Neil Connery, Pamela Cundell, Brenda Cowling, Reginald Marsh, Rosalind Ayres, Ann Beach, Mary Tamm, Karl Howman, Isla Blair, Ronnie Stevens, Stephen Greif, Robert Gillespie, Sylvia Kay and Frank Middlemass."]}, {"page": "Katy Manning", "response": ["After leaving Doctor Who, Manning appeared predominantly on stage consistently. From 1973 to 1975, she appeared opposite Derek Nimmo in Why Not Stay For Breakfast? in the West End, as well as appearing in There's a Girl in My Soup with Gerald Flood. She then starred in the play French Without Tears in 1975 and So Who Needs Men with Peter Denyer and Jeff Rawle in 1976 before joining the Young Vic for a time in 1977 and taking part in many of Shakespeare's works including playing Ophelia in Hamlet. From 1977 to 1978, she toured in Doctor in the House, a production that also starred Jimmy Edwards, Bob Grant and future Doctor Who actor Colin Baker, before starring as Myra alongside Lionel Blair in The Monkey Walk in 1978. From 1979 to 1980, Manning toured in the thriller play The Gentle Hook, then in 1980 she toured in Peter Terson's VE Night alongside Ian Cullen and Jane Goddard and in 1981, she appeared on stage in Thark alongside Brian Murphy and Reginald Marsh. "]}, {"page": "Elsie Tanner", "response": ["Now a widow, Elsie married Alan Howard in 1970 (Alan was played by Alan Browning, who would become Patricia Phoenix's real-life husband). This marriage was also rocky; shortly after they married, script-writers bankrupted affluent Alan so Elsie would stay in Weatherfield. Eventually, in 1973, the two went to live in Newcastle-upon-Tyne but Elsie returned alone in 1976 as she and Alan had separated and later got divorced. Elsie was also involved with bookie Dave Smith (Reginald Marsh) in the early 1970s, owner of local football team Weatherfield County FC."]}, {"page": "Blanche Hunt", "response": ["In 1976, she meets bookmaker Dave Smith (Reginald Marsh), with whom she had a wartime romance. They rekindle their affair and decides to move away to help Dave run his country club in Kenilworth. After her affair with Dave Smith ends, Blanche returns to Weatherfield in January 1977 to help look after her newborn granddaughter Tracy (Christabel Finch), accompanied by Warwickshire vet, Steve Bassett (Dennis Chinnery). They become engaged but split up that May. In 1981, Blanche returns to Weatherfield for Deirdre's wedding to Ken Barlow (William Roache)."]}, {"page": "The Baron (TV series)", "response": ["Although not regular cast members, Reginald Marsh and Derek Newark also appeared in three episodes (once reprising earlier roles, and once playing different characters). Occasionally actors were used twice but in different roles in the same run of episodes, including Paul Maxwell, Peter Bowles, George Murcell and Edwin Richfield."]}, {"page": "The Plane Makers", "response": ["*Arthur Sugden                 –       Reginald Marsh"]}, {"page": "Sir Gregory Parsloe", "response": ["* In the 1985–1992 Blandings radio series, Parsloe was voiced by Reginald Marsh."]}, {"page": "Reginald Marsh", "response": ["Reginald Marsh may refer to:", "* Reginald Marsh (artist) (1898–1954), American painter", "* Reginald Marsh (actor) (1926–2001), English comic actor", "* Reginald Marsh (cricketer) (1897–1969), English cricketer"]}, {"page": "List of Bergerac episodes", "response": ["| Hetty Baynes, Stephen McGann, Sarah Lawson, Reginald Marsh, Tony Adams"]}, {"page": "Berserk!", "response": ["* Reginald Marsh as Sergeant Hutchins"]}, {"page": "List of The Avengers (TV series) episodes", "response": ["| Anthony Nicholls, Melissa Stribling, Reginald Marsh, Richard Thorp, Terence Woodfield"]}, {"page": "Hammer House of Mystery and Suspense", "response": ["| Dirk Benedict, Jenny Seagrove, George Sewell, John Paul, Tom Adams, Burt Kwouk, James Ellis, Reginald Marsh, Alibe Parsons, Hugh Morton"]}, {"page": "The Scales of Justice", "response": ["|9. \"The Material Witness\" || 1965 || Noel Travarthen, Reginald Marsh, Sally Nesbitt, Harry Locke, Hector Ross, John Horsley, Steve Peters || Geoffrey Nethercott || B&W || A young man is the personal assistant to a company executive who has little time for him."]}, {"page": "List of Worthing inhabitants", "response": ["* Reginald Marsh, actor and star of Coronation Street in the 1960s and 1970s, grew up in Worthing."]}, {"page": "When Did You Start to Stop Seeing Things?", "response": ["* Reginald Marsh as James Laker"]}, {"page": "List of The Avengers and The New Avengers cast members", "response": ["* Reginald Marsh"]}, {"page": "List of British films of 1963", "response": ["|The Sicilians||Ernest Morris||Robert Hutton, Reginald Marsh||Thriller||"]}, {"page": "List of British films of 1977", "response": ["|Sky Pirates||C.M. Pennington-Richards||Bill Maynard, Reginald Marsh||Family/adventure||"]}, {"page": "List of former Emmerdale characters", "response": ["|Bob Molesworth || Reginald Marsh || 1973"]}, {"page": "List of former Coronation Street characters", "response": ["|Dave Smith || Reginald Marsh || 1962, 1966–1971, 1976"]}, {"page": "Cultural depictions of Edward VII", "response": ["*Reginald Marsh in Young Winston (1972)"]}, {"page": "The Erpingham Camp", "response": ["*Reginald Marsh - Erpingham"]}, {"page": "Mildred Roper", "response": ["Mildred Dorothy Tremble was born in London and had three siblings: Arthur, Ethel (Avril Elgar) and Hilda (Jean Marlow). Her eldest sibling was her only brother, Arthur Tremble, who had emigrated to New Zealand and was employed branding sheep; it is hinted that he was homosexual. He died in 1950. Her eldest sister, Ethel, married Humphrey Pumphrey (Reginald Marsh), and moved into a large mansion in Oxshott. Hilda, married a man called Fred, nicknamed 'Fertile Fred' by George and Humphrey, and had five unnamed children. During the Second World War, Mildred worked in the canteen at an airbase near London with Gladys (Eunice Black) and Kitty, and several others; Mildred had many boyfriends, including flight sergeant Lee Kennedy (Lionel Murton), army sergeant Arthur Mulgrove (Norman Mitchell) and many others including a ginger one, a tall one with a crew cut and one with a moustache."]}, {"page": "Headline Hunters (1968 film)", "response": ["*Reginald Marsh as Bogshot"]}, {"page": "Christmas Night with the Stars", "response": ["* Not in Front of the Children – by Richard Waring, starring Wendy Craig and Ronald Hines, with Hugo Keith-Johnston, Verena Greenlaw, Jill Riddick and Reginald Marsh. Directed by Graeme Muir."]}, {"page": "The Rat Catchers", "response": ["It hangs in the air around us. It is invisible and yet pointed with deadly accuracy. Can Hurst and Smith save the nation? Also stars Reginald Marsh, Sylvia Kay, Morris Perry and Basil Moss.", "A very unpleasant murder and Hurst and Smith are in revolt as the Brigadier orders them to eliminate a public figure. Also stars Reginald Marsh, Derren Nesbitt and Michael Peake.", "The Brigadier forms a strange alliance to get rid of a common enemy but the outcome is violence of the worst kind as death stalks the streets. Also stars James Kerry, Reginald Marsh and Derren Nesbitt."]}, {"page": "List of Coronation Street characters (1962)", "response": ["Dave Smith is a bookmaker and small-town businessman played by actor Reginald Marsh on a recurring basis between 1962 and 1976. Dave is introduced as owner of the local bookies when he appears for two episodes in September 1962. Dave is immediately interested in Elsie Tanner and he invites her to go on holiday with him. Elsie returns a couple of weeks later, having got bored of Dave's company."]}, {"page": "List of Coronation Street characters (1961)", "response": ["| Reginald Marsh"]}, {"page": "The Incredible Robert Baldick", "response": ["*Reginald Marsh as Charles Aldington"]}, {"page": "The Ragman's Daughter", "response": ["* Reginald Marsh as George "]}, {"page": "List of Minder episodes", "response": ["|colspan=\"3\"|Guest stars: Moray Watson as Commander Hawksly, Reginald Marsh as Johnny Winstanley, Ray Winstone as Arnie, Sarah Berger as Penny, Peter Rutherford as Large Man, Bill Treacher as Punter."]}, {"page": "Elaine Taylor (actress)", "response": ["In the mid-1960s Taylor appeared in episodes of various British television series, including The Benny Hill Show (1965), The Lance Percival Show (1966), in which she sang as well as taking part in comedy sketches, The Old Campaigner (1967), which featured Terry-Thomas as a womanising plastics salesman,The Independent, 19 February 2001: obituary of Reginald Marsh. The casting of Terry-Thomas, then a considerable international star, was considered quite a coup for Robin Nash who directed the pilot episode for the BBC: Times obituary of Robin Nash, 9 July 2011. and Mr Rose, starring William Mervyn as a retired senior policeman (1968). Her appearance with Benny Hill on 18 December 1965 included a gender-reversal parody of the 1956 film Baby Doll that Hill repeated in 1974 with Diana Darvey. Taylor is thought also to have been the announcer of a sketch in which Hill first performed his song \"Those Days\" in imitation of Sonny and Cher. She worked again with Hill in the third series of his BBC radio show Benny Hill Time, which started on the Light Programme on 27 February 1966 and featured, among others, Patricia Hayes and Peter Vernon.Andy Foster & Steve Furst (1996) Radio Comedy 1938–1968"]}, {"page": "The Best Pair of Legs in the Business", "response": ["* Reginald Marsh - Fred"]}]}}