{"wiki_id": "http://www.wikidata.org/entity/Q1249215", "itemLabel": "Peter Cook", "itemDescription": "British architect", "wikipedia_url": "https://en.wikipedia.org/wiki/Peter_Cook_(architect)", "wikipedia_page": {"main": "Sir Peter Cook  (born 22 October 1936) is an English architect, lecturer and writer on architectural subjects. He was a founder of Archigram, and was knighted in 2007 by the Queen for his services to architecture and teaching. He is also a Royal Academician and a Commandeur de l'Ordre des Arts et des Lettres of the French Republic. His achievements with Archigram were recognised by the Royal Institute of British Architects in 2004, when the group was awarded the Royal Gold Medal.", "link_mentions": [{"page": "Jonathan Meades", "response": ["*English Extremists: The Architecture of Campbell Zogolovitch Wilkinson Gough (1988, Fourth Estate, ; co-author with Deyan Sudjic and Peter Cook)"]}, {"page": "October 22", "response": ["*  1936   – Peter Cook, English architect and academic"]}, {"page": "Graz", "response": ["For the year that Graz was Cultural Capital of Europe, new structures were erected. The Graz Museum of Contemporary Art (German: Kunsthaus) was designed by Peter Cook and Colin Fournier and is situated next to the Mur river. The Island in the Mur is a floating platform made of steel. It was designed by American architect Vito Acconci and contains a café, an open-air theatre and a playground."]}, {"page": "List of architects", "response": ["*Peter Cook (born 1936), UK"]}, {"page": "Future Systems", "response": ["In the 1990s the company moved from theoretical projects to fee-paying work with projects such as the \"spacecraft-like\" Media Centre at Lord's Cricket Ground in London (completed 1999), and the Selfridges Building (completed 2003). For Lord's, Kaplicky received the Stirling Prize. The Selfridges department store is a prime example of the early 21st century movement referred to as \"blobitecture\", and has been compared to Peter Cook's Kunsthaus in Graz, Austria."]}, {"page": "Southend-on-Sea", "response": ["* Peter Cook, architect"]}, {"page": "Stirling Prize", "response": ["*Peter Cook, Colin Fournier for Kunsthaus, Graz, Austria"]}, {"page": "Institute of Contemporary Arts", "response": ["* Peter Cook 1970–1973"]}, {"page": "Archigram", "response": ["thumb|Peter Cook presents Archigram's project of “Plug-in City”", "Based at the Architectural Association in London, the main members of the group were Peter Cook, Warren Chalk, Ron Herron, Dennis Crompton, Michael Webb and David Greene. Designer Theo Crosby was the \"hidden hand\" behind the group.Simon Sadler, Archigram: architecture without architecture, MIT Press, 2005, p.161 He gave them coverage in Architectural Design magazine (where he was an editor from 1953–62), brought them to the attention of the Institute of Contemporary Arts (ICA) in London, where, in 1963, they mounted an exhibition called Living City,Crosby raised the money for this from the Gulbenkian Foundation, and subsequently edited its publication in the ICA's Living Arts magazine: Sadler, op cit, p.207 and in 1964 brought them into the Taylor Woodrow Design Group, which he headed, to take on experimental projects.Peter Cook, Archigram, Princeton Architectural Press, 1999, p.44 The pamphlet Archigram I was printed in 1961 to proclaim their ideas. Committed to a 'high tech', light weight, infra-structural approach that was focused towards survival technology, the group experimented with modular technology, mobility through the environment, space capsules and mass-consumer imagery. Their works offered a seductive vision of a glamorous future machine age; however, social and environmental issues were left unaddressed. ", "===Plug-in-City, Peter Cook, 1964===", "===Instant City, Peter Cook===", "* Peter Cook and Michael Webb (1999), Archigram, Princeton Architectural Press"]}, {"page": "Southern California Institute of Architecture", "response": ["SCI-Arc's undergraduate and graduate programs culminate in two public events in which students present their thesis projects to renowned critics from around the world, including Peter Cook, Greg Lynn, and Pritzker Prize recipient Thom Mayne. \"SCI-Arc has long been one of this country’s best experimental labs in which designers speculate about the future of the human-made environment, and its thesis projects are its calling cards.\"", "A recent program and exhibition, \"LA in Wien/Wien in LA,\" investigated the architecture of Los Angeles and Vienna and their respective influences on one another in over the last century. It brought together six esteemed international architects—Hitoshi Abe, Peter Cook, Eric Owen Moss, Thom Mayne, Peter Noever, and Wolf Prix of Coop Himmelb(l)au—to share their perspectives and experiences in a discussion led by Anthony Vidler. The full scope of SCI-Arc public programs includes lectures, exhibitions, faculty talks and other opportunities for interaction between the school and the community."]}, {"page": "Architectural Association School of Architecture", "response": ["*Sir Peter Cook"]}, {"page": "Columbia Graduate School of Architecture, Planning and Preservation", "response": ["*Peter Cook - Member of Archigram"]}, {"page": "Arts University Bournemouth", "response": ["* The CRAB Drawing Studio, an innovative building designed by the Cook-Robotham Architectural Bureau led by Sir Peter Cook, which was shortlisted for the 2016 RIBA South West Awards. It is the first purpose-built drawing studio to open in the UK for 100 years, emphasising natural light and featuring a large circular north-light and a rear clerestory, which provides softer light.", "*Peter Cook (architect)"]}, {"page": "Hornsey College of Art", "response": ["* Peter Cook (architect), architect"]}, {"page": "The Bartlett", "response": ["The Bartlett Faculty of the Built Environment is the UK's largest and leading multidisciplinary faculty of the built environment, covering architecture, planning, construction and project management, development planning and environmental design as well as many other specialist fields. It is particularly well known for its architecture and planning schools following the leadership of Sir Peter Cook and Sir Peter Hall respectively in the 1990s. The faculty undertakes research in the built environment, and is known for developing the space syntax theory. The current Dean is Christoph Lindner (Professor in Urban Studies).", "* Sir Peter Cook"]}, {"page": "Peter Cook (disambiguation)", "response": ["Peter Cook (1937–1995) was a British comedian.", "Peter Cook may also refer to:", "*Peter Cook (MP), Member of Parliament for Leominster, 1390 and 1391", "* Peter Cook (antiques) (1924–2003), Australian antique dealer and For Love or Money panelist", "* Peter Cook (English footballer) (1927–1960), English footballer", "* Peter Cook (Australian footballer) (born 1932), Australian footballer for Melbourne", "* Peter Cook (architect) (born 1936), British architect", "* Peter Cook (Australian politician) (1943–2005), Australian senator", "* Peter Cook (jockey) (born 1950), retired Australian jockey", "* Peter Cook (born c. 1959), architect and fourth husband of Christie Brinkley", "* Peter Cook (press secretary), financial news anchor and press secretary", "* Peter Mackenzie (born Peter Cook, 1961), American actor", "*Peter Cooke (disambiguation)"]}, {"page": "Blobitecture", "response": ["One precedent is Archigram, a group of English architects working in the 1960s, to which Peter Cook belonged. They were interested in inflatable architecture as well as in the shapes that could be generated from plastic. Ron Herron, also a member of Archigram, created blob-like architecture in his projects from the 1960s, such as Walking Cities and Instant City, as did Michael Webb with Sin Centre.Archigram,  Peter Cook, editor (Princeton Architectural Press, 1999).   Buckminster Fuller's work with geodesic domes provided both stylistic and structural precedents. Geodesic domes form the building blocks for works including The Eden Project. Niemeyer's Edificio Copan built in 1957 undulates nonsymetrically invoking the irregular non-linearity often seen in blobitecture. There was a climate of experimental architecture with an air of psychedelia in the 1970s that these were a part of.   The Flintstone House by William Nicholson in 1976, was built over large inflated balloons. Frederick Kiesler's unbuilt, Endless House is another instance of early blob-like architecture, although it is symmetrical in plan and designed before computers; his design for the Shrine of the Book (construction begun, 1965) which has the characteristic droplet form of fluid also anticipates forms that interest architects today. Similarly, one would have to include the work of Vittorio Giorgini (Casa Saldarini), Pascal Haüsermann and especially that of Antti Lovag as examples of successfully built blobs. The latter built the famous Palais Bulleshttp://www.palaisbulles.com/ close to Cannes on the French Côte d'Azur, owned by fashion designer Pierre Cardin.", "A building that also can be considered an example of a blob is Peter Cook and Colin Fournier's Kunsthaus (2003) in Graz, Austria. Other instances are Roy Mason's Xanadu House (1979), and a rare excursion into the field by Herzog & de Meuron in their Allianz Arena (2005).  By 2005, Norman Foster had involved himself in blobitecture to some extent as well with his brain-shaped design for the Philological Library at the Free University of Berlin and the Sage Gateshead opened in 2004. French-born architect  build the free shaped Biomorphic House (2012)in Israel.", "Image:Graz Kunsthaus 3.jpg|Peter Cook and Colin Fournier's Kunsthaus in Graz, Austria"]}, {"page": "List of people associated with University College London", "response": ["* Sir Peter Cook (1936–), architect, The Bartlett Professor of Architecture"]}, {"page": "Reyner Banham", "response": ["Having previously written regular exhibition reviews for ArtReview, then titled Art News and Review, Banham began working for the Architectural Review in 1952. Notably in its December 1955 issue, Banham contributed an essay titled \"The New Brutalism\", in which he sought to stylistically define New Brutalism. His hypotheses became widely discussed and debated topics among members of Team X and other groups involved in urban planning at the time. Banham also had connections with the Independent Group, the 1956 This Is Tomorrow art exhibition – considered by many to the birth of pop art – and the exponents of Brutalist architecture, which he documented in his 1966 book The New Brutalism: Ethic or Aesthetic?. Before this, in Theory and Design in the First Machine Age, he had cut across mentor Pevsner's main theories, linking modernism to built structures in which the 'functionalism' was actually subject to formal structures. Later, he wrote a Guide to Modern Architecture (1962, later titled Age of the Masters, a Personal View of Modern Architecture). Banham predicted a \"second age\" of the machine and mass consumption. The Architecture of the Well-Tempered Environment (1969) follows Giedion's Mechanization Takes Command (1948), putting the development of technologies such as electricity and air conditioning ahead of the classic account of structures. In the 1960s, Cedric Price, Peter Cook, and the Archigram group also found this to be an absorbing arena of thought."]}, {"page": "Zvi Hecker", "response": ["Zvi Hecker was born as Tadeusz Hecker in Kraków, Poland. He grew up in Poland and Samarkand. He began his education in architecture at the Cracow University of Technology.Peter Cook, Rosie Llewellyn-Jones. New Spirit in Architecture, Rizzoli. 1991. p. 149. He immigrated to Israel in 1950.\"Zvi Hecker\"  Arcspace. Date: 7 March 2001, retrieved 24 October 2007. There he studied architecture at the Technion - Israel Institute of Technology, graduating in 1955. At the Technion, Eldar Sharon was a classmate, and Alfred Neumann was their professor.Hillit Mazor. \"From Bat-Yam to Rishon Letsion\", Architecture of Israel Quarterly. Issue 69. May 2007. Between 1955 and 1957, he studied painting at the Avni Institute of Art and Design,The Palmach History Museum - Architect  Venice Biennale Israeli Pavilion. Retrieved 24 October 2007. before beginning his career as an architect. Between 1957 and 1959, Hecker served in the Combat Engineering Corps of the Israel Defense Forces.", "Hecker taught in Canada, the United States, Israel, and Austria at the Université Laval, University of Texas at Arlington, Washington University in St. Louis, Iowa State University, Technion – Israel Institute of Technology, and the University of Applied Arts Vienna.\"Zvi Hecker | Architect | Berlin\" retrieved 19 June 2009. Zvi Hecker writes about his work periodically,Zvi Hecker. \"Die Ära der Exzesse ist vorbei\" Der Tagesspiegel. 23 January 2009. co-authoring books with Sir Peter Cook, John Hejduk, and others.John Hejduk et al. House of the Book, Black Dog Publishing, 1999. "]}, {"page": "Neo-futurism", "response": ["Beginning in the late 1960s and early 1970s by architects such as Buckminster Fuller and John C. Portman Jr.; architect and industrial designer Eero Saarinen, Archigram, an avant-garde architectural group (Peter Cook, Warren Chalk, Ron Herron, Dennis Crompton, Michael Webb and David Greene, Jan Kaplický and others); it is considered in part an evolution out of high-tech architecture, developing many of the same themes and ideas."]}, {"page": "Storefront for Art and Architecture", "response": ["Examples of artists and architects that have participated in Storefront events include Bernard Tschumi, Hilary Sample, Peter Cook, Mark Wigley, Jenny Sabin, Oana Stanescu, Bryony Roberts, Tatiana Bilbao, Mabel Wilson, Meejin Yoon, Juergen Mayer, Jimenez Lai, Rosalyne Shieh, Jing Liu (architect), Mitchell Joachim, and Saskia Sassen."]}, {"page": "Architectural theory", "response": ["*Peter Cook (architect)"]}, {"page": "Megastructure (planning concept)", "response": ["At the same time, European architects also initiated megastructure movements by forming megastructural groups and schools with various theories and approaches. One of the most influential groups among them was Archigram based at the Architectural Association in London. In the 1961 pamphlet \"Archigram I\" the group advocated a megastructural approach for buildings and cities which emphasizes technology, infrastructure, and dynamic movements within megastructures (Simon Sadler, Archigram: Architecture Without Architecture). Projects by Archigram, such as the Walking City (Ron Herron, 1964) and Plug-in-City (Peter Cook, 1964), illustrated the future of city where modular structures and movable urban entities resemble fun and flexibility.", "=== Plug-in-City project, Peter Cook, 1963-4 ==="]}, {"page": "High-tech architecture", "response": ["Some of the earliest practitioners of high-tech architecture included the British architecture group Archigram, whose members frequently designed advanced futuristic buildings and cities. On the most influential of these was Peter Cook's Plug-in City, a theoretical mega structure designed around the detach-ability and replacement of each of its individual units. The concept of removable and interchangeable elements of buildings would later become a widespread characteristic within the high-tech style. Less direct precursors included Buckminster Fuller and Frei Otto, whose focus on minimizing construction resources generated an emphasis on tensile structures, another important element in many high-tech designs. Louis Kahn's concept of \"served\" and \"servant\" spaces, particularly when implemented in the form of service towers, later became a widespread feature of high-tech architecture."]}, {"page": "Kunsthaus Graz", "response": ["Kunsthaus Graz was designed by Colin Fournier as the Partner-in-Charge together with Sir Peter Cook. According to The Bartlett School of Architecture at University College London, the Kunsthaus' design sought to be deliberately provocative, innovate museum design by offering a less \"institutional\" approach to organising exhibition spaces and employs new materials and manufacturing techniques. The building is an example of blob architecture, and has a skin made of iridescent blue acrylic panels that also double as photovoltaic panels. Owing to its shape contrasting with its surroundings, it is known in local vernacular as the \"Friendly Alien\". or rather as the black tumor."]}, {"page": "Patricio Pouchulu", "response": ["Born in Buenos Aires, he graduated as an Architect at Universidad de Buenos Aires before moving to London to study with Peter Cook at The Bartlett School of Architecture, University College London, where he got a M.Arch. He was awarded by the British Council and Fondo Nacional de las Artes. He taught at the University of Buenos Aires (1989–1996), Fachhochschule-Munich, Germany (1999–2004). He is invited as external critic at the Bartlett and other schools since 2000. He is investigating on Habitat.", "In Buenos Aires he experienced the Modern Movement through the early work of Clorindo Testa; after visiting his office in the late eighties they eventually became friends. He co-organized events with Jorge Glusberg (CAYC) for the BA/Bienal Internacional de Arquitectura de Buenos Aires, where he exhibited experimental projects. Hosted by Peter Cook, in 2000 Pouchulu lectured in London on his Architectural Fictions. He attended the Venice Biennale, and Documenta in Kassel, where he met Yona Friedman."]}, {"page": "Peter Cook (Architect)", "response": ["#REDIRECT Peter Cook (architect) "]}, {"page": "Ron Herron", "response": ["Architects Peter Cook, Mike Webb, and David Greene had been meeting regularly as a group at a greasy spoon in Swiss Cottage, and had already self-published a pamphlet called \"Archigram\" (from \"architecture\" + \"telegram\"). After they published the second issue they sought out Herron, Chalk and Crompton, who they knew by reputation. These six formed the core of Archigram. In 1963 the group was invited by Theo Crosby to exhibit on \"The Living City\" at the Institute of Contemporary Arts, which became a manifesto of sorts."]}, {"page": "Forum AID Award", "response": ["Detlef Rahe (chairperson), Hélène Binet, Peter Cook, Kristin Feireiss, Satyendra Pakhale"]}, {"page": "Hélène Binet", "response": ["She has worked with Raoul Bunschoten, Caruso St John, David Chipperfield, Tony Fretton, Zaha Hadid, Zvi Hecker, John Hejduk, Coop Himmelb(l)au, Daniel Libeskind, the architect Peter Cook, Sauerbruch Hutton, Peter Zumthor, and Josef Paul Kleihues among others, besides publishing books on buildings by Le Corbusier, Alvar Aalto, Sigurd Lewerentz, and Dimitris Pikionis.", "*  The House of the Book, Peter Cook, Zvi Hecker, John Hejduk. Black Dog, 1999,"]}, {"page": "Experimental architecture", "response": ["Experimental architecture was brought into discourse by Peter Cook in 1970, with the publication of his book Experimental Architecture.Cook, Peter (1970). Experimental Architecture. New York: Universe Books.  Through critical readings of several twentieth century projects – architectural and urban – Cook instigated ways of counteracting the architectural rules that “falls back upon tradition, stylization, or can't.” "]}, {"page": "Great Expectations (2007 film)", "response": ["The film uses interviews to frame the history of utopian and visionary architecture through the 20th century. Subjects include Le Corbusier, Oscar Niemeyer, Peter Cook, Buckminster Fuller, Moshe Safdie, Antti Lovag, Paolo Soleri, Peter Vetsch and Jacque Fresco."]}, {"page": "USC School of Architecture", "response": ["*Peter Cook"]}, {"page": "Brit Andresen", "response": ["Most recently, in February 2011, Andresen in collaboration with Sir Peter Cook and Gavin Robotham of Crab Studio, has won the design competition for the new Soheil Abedian School of Architecture at Bond University, Queensland."]}, {"page": "Garanti Gallery", "response": ["GG organized a 12-session “Transdisciplines Lecture Series” in collaboration with Platform Garanti in 2008 and 2009. The lectures aimed to open to discussion the production environment that would transcend disciplines as envisioned by the new institution to be formed by GG and Platform Garanti while the process of unification and change undertaken by these two entities still continued. Lecturers in chronological order were Marcos Novak, Marie-Ange Brayer, Peter Taylor, Fiona Raby of Dunne & Raby, George Legrady, Hans Ulrich Obrist, Charles Waldheim, Nikolaus Hirsch, Peter Cook, Gijs van Oenen, Ciro Najle and Trevor Paglen."]}, {"page": "Kathryn Findlay", "response": ["Findlay was born in Forfar in Scotland, the daughter of a sheep farmer, and studied fine arts at the Edinburgh College of Art. She moved to England at the end of her first year in 1972 to study at the Architectural Association. While Findlay was studying at the Architectural Association, she was tutored by Peter Cook, Christine Hawley, and Leon Van Schaik. Findlay graduated with an Architectural Association Diploma in 1979."]}]}}