{"wiki_id": "http://www.wikidata.org/entity/Q1245136", "itemLabel": "Bruce Forsyth", "itemDescription": "British presenter, actor, comedian, singer, dancer, and screenwriter", "wikipedia_url": "https://en.wikipedia.org/wiki/Bruce_Forsyth", "wikipedia_page": {"main": "Sir Bruce Joseph Forsyth-Johnson  (22 February 1928 – 18 August 2017) was a British entertainer and presenter whose career spanned more than 70 years. Forsyth came to national attention from the late 1950s through the ITV series Sunday Night at the London Palladium. He went on to host several game shows, including The Generation Game, Play Your Cards Right, The Price Is Right and You Bet!. He co-presented Strictly Come Dancing from 2004 to 2013. In 2012, Guinness World Records recognised Forsyth as having the longest television career for a male entertainer.", "link_mentions": [{"page": "August 18", "response": ["*2017 – Bruce Forsyth, English television presenter and entertainer (b. 1928)"]}, {"page": "February 22", "response": ["*  1928   – Bruce Forsyth, English singer and television host (d. 2017) "]}, {"page": "Neopets", "response": ["Neopets was conceived in 1997 by Adam Powell, a British student at the University of Nottingham at the time. He shared this idea with Donna Williams and the two started work on the site in September 1999, with Powell responsible for the programming and the database and Williams the web design and art. Their original office was located in Guildford. With the help of two friends, the site launched on 15 November 1999. Powell stated that the original goal was to \"keep university students entertained, and possibly make some cash from banner advertising\". The site contained popular culture references, such as a Neopet that was simply a picture of Bruce Forsyth."]}, {"page": "Sid James", "response": ["Remembered for a lascivious persona in the Carry On films, with the Snopes website describing him as \"the grand old man of dirty laughter\", he became known for his amiability in his later television work. Bruce Forsyth described him as \"a natural at being natural\".Forsyth, speaking on the TV programme Heroes of Comedy, 2001"]}, {"page": "The Goodies", "response": ["Tim Brooke-Taylor also appeared on BBC's hospital comedy TLC, as well as the sitcoms You Must Be The Husband (with Diane Keen and Sheila Steafel), and Me and My Girl (with Richard O'Sullivan and Joan Sanderson). He also played in a televised pro-celebrity golf match opposite Bruce Forsyth."]}, {"page": "1928", "response": ["** Sir Bruce Forsyth, English entertainer (d. 2017)"]}, {"page": "The Muppet Show", "response": ["*\"Fozzie Bear's Act\" – Fozzie Bear gets on stage and performs his famously bad jokes. Statler and Waldorf heckle him in a perpetual rivalry. The sketches became less frequent as Fozzie's off-stage presence became more prevalent. In one first-season episode, however, Fozzie turned the tables on Statler and Waldorf with help from Bruce Forsyth and they waved a white flag in surrender. Mainly appeared during the first season, but made occasional appearances in later seasons."]}, {"page": "British sitcom", "response": ["West Yorkshire, whose theme tune for The Good Life is among his memorable credits.  He was a successful light entertainment composer and musical director including his  arrangements for  comedienne Beryl Reid's 1968-67  Beryl Reid Says Good Evening. He collaborated with many stars including Judy Garland, Pearl Bailey, Sammy Davis Jr., Vic Damone and Bruce Forsyth.   Rhodes was often referred to as \"the musicians’ musician\". He counted musicians such as Ronnie Hazlehurst, Monty Norman and Phil Phillips among his friends.  In 1958 he scored the theme  for  Dr No, the first James Bond film."]}, {"page": "2017", "response": ["* August 18 – Bruce Forsyth, English television presenter and entertainer (b. 1928)"]}, {"page": "Tim Brooke-Taylor", "response": ["In 2004, Brooke-Taylor and Garden were co-presenters of Channel 4's daytime game show, Beat the Nation, in which they indulged in typical game show \"banter\", but took the quiz itself seriously. He appeared on stage in Australia and England, usually as a middle class Englishman. In the early 1980s, he branched out into pantomime as the Dame in Dick Whittington. He was also the author (and co-author) of several humorous books, based mainly on his radio and television work, and the sports of golf and cricket. His interest in golf came to the fore when he took part in the Pro-Celebrity Golf television series (opposite Bruce Forsyth), and appeared in the premiere episode of the BBC's golf-based game show Full Swing."]}, {"page": "List of British comedians", "response": ["*Bruce Forsyth (1928–2017)"]}, {"page": "Frankie Howerd", "response": ["He then experimented with different formats and contexts, including stage farces, Shakespearean comedy roles, and television sitcoms. At the start of the 1960s, he began to recover his old popularity, initially with a season at Peter Cook's satirical Establishment Club in Soho in London. He was boosted further by success on That Was the Week That Was (TW3) in 1963 and on stage with A Funny Thing Happened on the Way to the Forum (1963–1965), which led into regular television work. In 1966 and 1967, he co-hosted a 90-minute Christmas show called The Frankie and Bruce Christmas Show with Bruce Forsyth, featuring many top acts of the day."]}, {"page": "Les Dawson", "response": ["On 1 June 2013 ITV broadcast Les Dawson: An Audience with That Never Was. The programme featured a Pepper's ghost projection of Dawson, presenting content for a 1993 edition of An Audience with... to be hosted by Dawson but unused due to his death two weeks before recording. The show served as a tribute and featured celebrities including Bruce Forsyth, Cilla Black, Terry Wogan and Ken Dodd. Also among the audience were Dawson's wife Tracy and daughter Charlotte (who was only eight months old when he died)."]}, {"page": "George Martin", "response": ["Other comedians he worked with included Bernard Cribbins, Charlie Drake, Terry Scott, Bruce Forsyth, Michael Bentine, Dudley Moore, Flanders and Swann, Lance Percival, Joan Sims, Bill Oddie, and The Alberts. He worked with both Jim Dale and the Vipers Skiffle Group, with whom he had several hits. In early 1962, Martin collaborated with Maddalena Fagandini, then working at the BBC Radiophonic Workshop, to create two electronic singles, \"Time Beat\" and \"Waltz in Orbit\", which were released as records by the pseudonymous Ray Cathode. As Martin wanted to add rock and roll to Parlophone's repertoire, he struggled to find a \"fireproof\" hit-making pop artist or group.", "* Bruce Forsyth – \"I'm in Charge\" (1959)"]}, {"page": "Glastonbury Festival", "response": ["|Dizzee Rascal, Ben Howard, Jake Bugg, Sir Bruce Forsyth, Primal Scream, Vampire Weekend, The Vaccines, Kenny Rogers, Beady Eye, Tame Impala, Hurts Portishead, Billy Bragg, Skrillex (secret show)"]}]}}