{"wiki_id": "http://www.wikidata.org/entity/Q1256895", "itemLabel": "James McArthur", "itemDescription": "Scottish association football player", "wikipedia_url": "https://en.wikipedia.org/wiki/James_McArthur", "wikipedia_page": {"main": "James McFarlane McArthur (born 7 October 1987) is a Scottish professional footballer who plays as a central midfielder for Premier League club Crystal Palace.\nMcArthur started his career at Hamilton Academical and was part of the team that won the 2007–08 Scottish First Division title. He made over 190 appearances for Hamilton before joining Wigan Athletic in July 2010. McArthur helped Wigan win the FA Cup in 2013. He was transferred to Crystal Palace in the summer of 2014.\nMcArthur made 32 international appearances for the Scotland national team between 2010 and 2017.", "link_mentions": [{"page": "Hamilton Academical F.C.", "response": ["The Accies' stay in the SPL ended in the 2010–11 season, when they were relegated after a 1–0 defeat away to St Johnstone. Despite their relegation, Hamilton's time in the top flight was most notable for their emphasis on youth, including midfielders James McCarthy and James McArthur, both of whom went on to play for English club Wigan Athletic in the Premier League before gaining international recognition."]}, {"page": "Steven Caldwell", "response": ["It wasn't until on 11 November 2010 when Caldwell was called up to the national team squad for over a year. He briefly captained Scotland when a substitution took place in a 3–0 win against the Faroe Islands on 16 November 2010. His twelfth and final full cap came against Northern Ireland in the 2011 Nations Cup. In total, Caldwell won twelve caps for Scotland at senior international level. Reflecting on his time at the national side, he said: \"I think I was unlucky at times with Scotland. I think there was a certain snobbery about playing in Scotland at the time. Guys who played with Scottish clubs got caps that I was better than. I sit here and I'm bloody proud of those 12 caps I won. I'm especially proud and will be forever proud of the three or four I played with my brother. I can't ever really get across what that feels like, what that means for me, for him, for the two of us. It's one of my greatest achievements in football. I got two late Scotland caps when I was playing for Wigan and I'm really, really proud of those. I felt like it was the start of this era that we're in now. We had these young guys coming through – Steven Naismith, James Morrison, James McArthur. Kenny Miller was captain in that last game [against Northern Ireland in Dublin in 2011] and as he went off, he gave me the armband. It was another honour. Whatever the game, to have worn the Scottish armband, that was an incredible feeling.\""]}, {"page": "Julián Speroni", "response": ["Despite being told by manager Pulis that he would not be Crystal Palace's first choice goalkeeper, Speroni, nevertheless, continued to remain the first choice following the departure of Pulis at the start of the 2014–15 season. In a match against Burnley on 13 September 2014, he saved a penalty from Scott Arfield, as the club drew 0–0. After the match, his performance was praised by the returning manager Neil Warnock, saying: \"I think they broke the mould with him. Speroni is just a one-off but he does that every week and that's why he's been here so long with us. Speroni is a gem of a person.\" During a 2–2 draw against West Bromwich Albion on 25 October 2014. Speroni was substituted in the 55th minute after he took a blow to the face from Craig Dawson's arm. After the match, manager Warnock questioned the official's failure to take action against Dawson, calling it \"an assault almost\" and that Speroni could have been injured. But he made his recovery and returned to the starting line–up against Sunderland, as Crystal Palace lost 3–1 on 3 November 2014. Speroni then made his 347th league appearance for Crystal Palace, breaking John Jackson's record as the team's goalkeeper with the most league appearances, against Arsenal on 21 February 2015, losing 2–1. During a 2–1 win against Stoke City on 21 March 2015, he made an impressive display by making impressive saves and was praised by his teammate, James McArthur. However, Speroni uncharacteristically had an inconsistent season could be due to a lack of rotation and even a sense of being too comfortable in the number one spot. Despite being dropped to the substitute bench for the last two remaining matches of the 2014–15 season, he went on to make thirty–seven appearances in all competitions. On 22 May 2015, Speroni signed a one-year contract extension at Crystal Palace to keep him at the club until at least the end of the 2015–16 season."]}, {"page": "Artur Boruc", "response": ["Boruc endured a decline of form in the first half of season 2008–09 as he committed several goalkeeping errors, in particular against Rangers in a 2–4 defeat at Parkhead on 31 August 2008 where he was badly at fault for Rangers fourth goal, and against Hibernian at Easter Road on 7 December 2008, where John Rankin scored against him from 45 yards out, a goal Rankin later referred to as a \"squiggler.\" He did however save a James McArthur penalty in a 4–0 win over Hamilton Academical on 4 October 2008. Despite this run of relatively poor performances, Boruc was one of 55 players (including five goalkeepers) shortlisted on 20 October 2008 for the FIFPro World XI Player Awards. Discipline, however, also became an issue again, with Boruc fined £500 by the Scottish Football Association (SFA) for gestures he made towards Rangers fans during the Old Firm game in August."]}, {"page": "1987 in association football", "response": ["* October 7 — James McArthur, Scottish international footballer"]}, {"page": "Barrowfield", "response": ["Footballer James McArthurProgramme exclusive: McArthur on gritty Glasgow upbringing, Crystal Palace FC match programme, 1 September 2019 and actor Paul BranniganKevin Brannigan: East End drag artist on his battle to make his mark, Evening Times, 7 January 2019 grew up in Barrowfield in the 1990s."]}, {"page": "Robert Snodgrass", "response": ["Born in Glasgow, Snodgrass grew up in the city's Gallowgate area; he played boys' club football for a team affiliated with Rangers alongside future international teammate James McArthur who is a month younger and lived a few blocks away. Celtic offered him an apprenticeship, along with Clyde and Livingston. He felt that he had little chance of breaking through at Parkhead, so chose Livingston, joining their setup at the same time as another East End boy who would go on to play for Scotland, Graham Dorrans."]}, {"page": "Nigel Pearson", "response": ["In February 2015, following a home defeat by Crystal Palace in a game in which, at one point, Pearson put his hands around Palace's James McArthur's neck, while on the ground, the press reported that Pearson had been sacked. In a \"night of confusion,\" it was reported by The Guardian that club staff, and even Pearson himself, had been told that he was sacked. However, the same evening, the club issued a statement stating that such claims were \"inaccurate and without foundation.\" Following victories against West Ham United, West Brom, Swansea City and Burnley, with just one defeat, against Chelsea, during the month of April 2015, Pearson won the Premier League Manager of the Month for the first time. On 29 April 2015, following a 3–1 defeat to Chelsea, Pearson was again embroiled in controversy, when he called a journalist an \"ostrich\", \"stupid\" and \"daft\" during a post-match news conference. He apologised for his comments the following day."]}, {"page": "James McCarthy (footballer)", "response": ["Hamilton accepted a bid for McCarthy from Wigan Athletic on 16 July 2009. He completed the move to Wigan on 21 July, on a five-year deal, believed to be worth just under £1.2 million. The fee could rise to £3.0 million depending on appearances. McCarthy made his debut for Wigan on 22 August 2009, as a 74th-minute substitute in a 5–0 defeat to Manchester United. He scored his first goal for Wigan in the FA Cup third round victory against fellow Premier League team Hull City on 2 January 2010, and marked his first Premier League start with a goal in a 2–0 victory away to Wolverhampton Wanderers on 16 January 2010. He was later joined in the Wigan midfield by former Hamilton teammate James McArthur."]}, {"page": "2007–08 in Scottish football", "response": ["|September|| John Collins(Hibernian)|| Scott McDonald(Celtic)|| Andrew Driver(Heart of Midlothian)|| Scott Anson(Kilmarnock)|| Owen Coyle(St Johnstone)|| Steve Paterson(Peterhead)|| John McGlashan(Arbroath)|| Ryan Stevenson(Ayr United)||  James McArthur(Hamilton Academical)"]}, {"page": "List of Scottish Premier League monthly award winners", "response": ["| James McArthur (Hamilton Academical)"]}, {"page": "Aaron Ramsey", "response": ["In October 2012, Ashley Williams was appointed captain of Wales by Chris Coleman, replacing Ramsey after a run of defeats, but the manager said Ramsey would most likely be captain of Wales again in his career. On 22 March 2013, Ramsey scored an equalising 73rd-minute penalty in a 2–1 victory over fellow British rivals Scotland in a 2014 FIFA World Cup qualification fixture, however he received a red card for a foul on James McArthur during added time."]}, {"page": "2007–08 Scottish First Division", "response": ["|September|| Owen Coyle (St Johnstone) ||Second Division player||  James McArthur (Hamilton Academical)"]}, {"page": "Scotland national football team results (2000–2019)", "response": ["|Kenny Miller, James McArthur, Kris Commons", "|Own goal, James McArthur", "|James McArthur", "|Stuart Armstrong, Andrew Robertson, James McArthur"]}, {"page": "2008–09 Scottish Premier League", "response": ["| James McArthur"]}, {"page": "Eden Hazard", "response": ["On 18 April, Hazard scored the only goal in a home win over Manchester United, after he latched on to Oscar's backheel pass to score past David de Gea. He was voted Man of the Match thereafter for his performance. As a result of Hazard's impressive performances throughout the 2014–15 campaign, his manager declared him \"one of the top three players in the world\". On 26 April, Hazard was recognised as the best player of the season among his peers, winning the PFA Players' Player of the Year. A week later, he scored the only goal as Chelsea defeated Crystal Palace to win their first Premier League title since 2010. He won a penalty after being fouled by James McArthur, and took it himself, heading in the rebound after it was saved by Julián Speroni."]}, {"page": "2008–09 in Scottish football", "response": ["The Young Player of the Year award was awarded to James McCarthy who was named on the shortlist along with; Heart of Midlothian winger Andrew Driver, Hibernian striker Steven Fletcher and fellow Hamilton Academical midfielder James McArthur."]}, {"page": "Scottish Football League monthly awards", "response": ["|  James McArthur", "|   James McArthur"]}, {"page": "2011 Nations Cup", "response": ["Northern Ireland and Scotland met a day after the opening match, attracting a crowd of more than 18,000. Scotland midfielder Scott Brown suffered an injury in the warm-up leading to his withdrawal from the starting line-up. When the match began, Northern Ireland enjoyed the brighter start as Niall McGinn saw a shot saved by opposition goalkeeper Allan McGregor However, Scotland soon took control of the match and Kenny Miller, captaining Scotland for the first time in his career, gave his side the lead after 19 minutes after a corner fell to him a yard from the goalline. The goal was the first Scotland had scored in an away fixture since December 2009. Scotland applied further pressure; Steven Caldwell hit the crossbar with a header and Kris Commons' shot was cleared off the goalline before James McArthur, Brown's late replacement in the side, added a second goal after 31 minutes. In the opening minutes of the second half, Scotland scored a third goal via Commons. The match ended in a 3–0 victory for Scotland, matching Ireland's opening result and recording the biggest away victory for the Scots in more than five years. ", "|CM ||13||James McArthur", "|MF ||13||James McArthur || || ", "* James McArthur"]}, {"page": "List of Hamilton Academical F.C. players", "response": ["|James McArthur||||2005–2010||168||10||"]}, {"page": "James MacArthur (disambiguation)", "response": ["* James McArthur (born 1987), Scottish football player"]}, {"page": "List of Crystal Palace F.C. players", "response": ["|align=\"left\"|James McArthur||||MF||2014–||238||19||||"]}, {"page": "List of TV Guide covers (1970s)", "response": ["| Jack Lord & James McArthur of Hawaii Five-O"]}]}}