{"wiki_id": "http://www.wikidata.org/entity/Q1250294", "itemLabel": "Dorothy Emmet", "itemDescription": "British philosopher", "wikipedia_url": "https://en.wikipedia.org/wiki/Dorothy_Emmet", "wikipedia_page": {"main": "Dorothy Mary Emmet (; 29 September 1904, Kensington, London – 20 September 2000, Cambridge) was a British philosopher and head of Manchester University's philosophy department for over twenty years. With Margaret Masterman and Richard Braithwaite she was a founder member of the Epiphany Philosophers. She was the doctoral advisor of Alasdair MacIntyre and Robert Austin Markus.", "link_mentions": [{"page": "Index of philosophy articles (D–H)", "response": ["* Dorothy Emmet"]}, {"page": "Alasdair MacIntyre", "response": ["*1970. Sociological Theory and Philosophical Analysis (anthology co-edited with Dorothy Emmet). London and Basingstoke: Macmillan."]}, {"page": "List of women philosophers", "response": ["*Dorothy Emmet (1904–2000)"]}, {"page": "Herbert McCabe", "response": ["Herbert McCabe was born in Middlesbrough in the North Riding of Yorkshire. He studied chemistry at Manchester University, but influenced by Dorothy Emmet switched to philosophy. He contributed a number of pieces to Humanitas, and became friends with Eric John among others.\"Herbert McCabe\", obit, The Guardian "]}, {"page": "List of philosophers born in the 20th century", "response": ["* Dorothy Emmet (1904-2000)"]}, {"page": "Women in philosophy", "response": ["*Dorothy Emmet (1904–2000) was a Commonwealth Fellowship at Radcliffe College, where she was a pupil of A.N. Whitehead. From 1932 to 1938 she was a lecturer in Philosophy at King's College, Newcastle-upon-Tyne (now the University of Newcastle), having beaten A.J. Ayer as a finalist for the job. She joked that the profession owed her one, since Ayer went on to a distinguished career at University College London. Emmet went from Newcastle to the University of Manchester, first as a lecturer in the Philosophy of Religion and then as Sir Samuel Hall Professor of Philosophy. She was head of Manchester University's philosophy department for over twenty years. With Margaret Masterman and Richard Braithwaite she was a founder member of the Epiphany Philosophers, and Editor of Theoria to Theory. Emmet was also President of the Aristotelian Society 1953–1954. Between 1966 and 1976 she paid a number of visits to Africa as an examiner and consultant on courses in philosophy in the universities of Ifa and Ibadan, Nigeria. Emmet was a Fellow of Lucy Cavendish College, Cambridge, which has specialized in students from non-traditional backgrounds. Her books include Whitehead's Philosophy of Organism (1932) and The Nature of Metaphysical Thinking (1945)."]}, {"page": "Index of metaphysics articles", "response": ["Dorothy Emmet --"]}, {"page": "Outline of metaphysics", "response": ["* Dorothy Emmet (1904 – 2000) –"]}, {"page": "Index of contemporary philosophy articles", "response": ["* Dorothy Emmet"]}, {"page": "Thomas Henry Croxall", "response": ["Kierkegaard: The Prophet of the Now, by T.S. Gregory, November 21, 1946; The Prophet of the Absolute, by H.V. Martin;  Lectures on the Religious thought of Kierkegaard (Lecture IV), Geismar, Augsburg Publishing House; Philosophy, July 1941, by Professor Dorothy Emmet; Existentialism: Disintegration of Man's Soul, Guido De Ruggiero, 1948, Social Sciences Publishers Inc. New York"]}]}}