{"wiki_id": "http://www.wikidata.org/entity/Q1258787", "itemLabel": "Henry Augustus Smyth", "itemDescription": "British Army general", "wikipedia_url": "https://en.wikipedia.org/wiki/Henry_Augustus_Smyth", "wikipedia_page": {"main": "General Sir Henry Augustus Smyth  (25 November 1825 – 19 September 1906) was a senior British Army officer. He was the son of Admiral William Henry Smyth and the brother of astronomer Charles Piazzi Smyth and geologist Sir Warington Wilkinson Smyth. Of his sisters, Henrietta married the theologian Baden Powell and Georgiana the anatomist Sir William Henry Flower.", "link_mentions": [{"page": "Robert Baden-Powell, 1st Baron Baden-Powell", "response": ["In 1876 Baden-Powell joined the 13th Hussars in India with the rank of lieutenant. He enhanced and honed his military scouting skills amidst the Zulu in the early 1880s in the Natal province of South Africa, where his regiment had been posted, and where he was Mentioned in Dispatches. Baden-Powell's skills impressed his superiors and in 1890 he was brevetted Major as Military Secretary and senior Aide-de-camp to the Commander-in-Chief and Governor of Malta, his uncle General Sir Henry Augustus Smyth. He was posted to Malta for three years, also working as intelligence officer for the Mediterranean for the Director of Military Intelligence. He frequently travelled disguised as a butterfly collector, incorporating plans of military installations into his drawings of butterfly wings. In 1884 he published Reconnaissance and Scouting."]}, {"page": "Charles Piazzi Smyth", "response": ["Smyth's brothers were Warington Wilkinson Smyth and Henry Augustus Smyth. His sisters were Henrietta Grace Smyth, who married Reverend Baden Powell and was mother of Robert Baden-Powell, 1st Baron Baden-Powell (founder of the world Scouting Movement), Georgiana Rosetta Smyth, who married William Henry Flower; and Ellen Philadelphia Smyth, who married Captain Henry Toynbee of the HEIC."]}, {"page": "Scout Association of Malta", "response": ["The history of scouting in Malta is truly rich in events that mark its chequered history. The close connection the Islands have with the Scout Movement's founder, Lord Robert Baden-Powell started when he served in the rank of Captain as Assistant Military Secretary to his uncle, General Sir Henry Augustus Smyth who then was Governor of Malta, between 1890-1893."]}, {"page": "List of colonial governors in 1890", "response": ["* Malta Colony – Henry Augustus Smyth, Governor of Malta (1890–1893)"]}, {"page": "List of colonial governors in 1891", "response": ["* Malta Colony – Henry Augustus Smyth, Governor of Malta (1890–1893)"]}, {"page": "List of colonial governors in 1892", "response": ["* Malta Colony – Henry Augustus Smyth, Governor of Malta (1890–1893)"]}, {"page": "List of colonial governors in 1893", "response": ["*# Henry Augustus Smyth, Governor of Malta (1890–1893)"]}, {"page": "Henry Smyth", "response": ["* Henry Augustus Smyth (1825–1906), Governor of Malta"]}, {"page": "List of governors of Malta", "response": ["| Sir Henry Augustus Smyth || 60px || 1890 || 1893"]}]}}