{"wiki_id": "http://www.wikidata.org/entity/Q1250272", "itemLabel": "Dorothy Boyd", "itemDescription": "actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Dorothy_Boyd", "wikipedia_page": {"main": "Dorothy Boyd (14 April 1907 – 1996) was an English film actress. She appeared in 38 films between 1926 and 1940. She was born in Sanderstead, Surrey, England and died in England. Without any previous stage experience, she came to films when she appeared in three short films made in the Phonofilm sound-on-film process, Knee Deep in Daisies (1926), The Sentence of Death (1927), and The Burglar and the Girl (1928). A director was impressed by her and brought her to the notice of Alfred Hitchcock who cast her in his feature Easy Virtue (1928).", "link_mentions": [{"page": "Easy Virtue (1928 film)", "response": ["* Dorothy Boyd as Hilda Whittaker"]}, {"page": "Phonofilm", "response": ["# The Burglar and the Girl (1928) comedy short with Moore Marriott and Dorothy Boyd", "# Knee Deep in Daisies (1926) song \"I'm Knee-Deep in Daisies (and Head Over Heels in Love)\" sung by Paul England and Dorothy BoydSilentEra entry", "# The Sentence of Death (1927) dramatic short directed by Miles Mander and starring Dorothy Boyd (US title: His Great Moment)"]}, {"page": "Frances Dade", "response": ["Dade moved to Hollywood, California in the late 1920s to pursue an acting career. She first caught the attention of Samuel Goldwyn as Lorelei Lee in the touring company of Gentlemen Prefer Blondes. He gave her a contract, though she later went freelance. Her first film role was in 1928, when she had an uncredited role alongside stars Dorothy Boyd and Mabel Poulton in The Constant Nymph. She also appeared in such films as Raffles (1930) and Seed (1931)."]}, {"page": "List of British films of 1935", "response": ["|The Ace of Spades||George Pearson||Michael Hogan, Dorothy Boyd||Drama||", "| Inside the Room || Leslie S. Hiscott|| Austin Trevor, Dorothy Boyd || Mystery ||"]}, {"page": "List of British films of 1934", "response": ["|Get Your Man || George King || Dorothy Boyd, Sebastian Shaw || Comedy ||", "|Important People||Adrian Brunel||Stewart Rome, Dorothy Boyd||Comedy||", "|Oh No Doctor! || George King || Jack Hobbs, Dorothy Boyd || Comedy ||", "|Virginia's Husband||Maclean Rogers||Dorothy Boyd, Reginald Gardiner||Comedy||"]}, {"page": "List of British films of 1933", "response": ["|The Iron Stair || Leslie S. Hiscott || Henry Kendall, Dorothy Boyd || Crime ||", "|A Shot in the Dark||George Pearson||Dorothy Boyd, Jack Hawkins, O. B. Clarence||Mystery||", "|Two Wives for Henry||Adrian Brunel ||Garry Marsh, Dorothy Boyd||Comedy||"]}, {"page": "List of British films of 1931", "response": ["|The House of Unrest||Leslie Howard Gordon||Dorothy Boyd, Malcolm Keen||Thriller||", "|Love Lies||Lupino Lane||Stanley Lupino, Dorothy Boyd||Comedy||", "|The Love Race||Lupino Lane||Stanley Lupino, Jack Hobbs, Dorothy Boyd||Comedy||", "|Third Time Lucky||Walter Forde||Bobby Howes, Dorothy Boyd||Comedy||"]}, {"page": "List of British films of 1930", "response": ["|Birds of Prey||Basil Dean||C. Aubrey Smith, Dorothy Boyd, Frank Lawton||Thriller||", "|Too Many Crooks||George King||Laurence Olivier, Dorothy Boyd, Ellen Pollock||Comedy short||"]}, {"page": "List of British films of 1938", "response": ["|Romance à la carte || Maclean Rogers || Leslie Perrins, Dorothy Boyd || Comedy || "]}, {"page": "List of British films of 1937", "response": ["| Pearls Bring Tears || Manning Haynes || John Stuart, Dorothy Boyd || Comedy ||"]}, {"page": "List of British films of 1936", "response": ["|Everything Is Rhythm||Alfred J. Goulding||Harry Roy, Dorothy Boyd||Musical||", "| Ticket of Leave || Michael Hankinson || Dorothy Boyd, John Clements || Crime ||", "| A Touch of the Moon || Maclean Rogers || John Garrick, Dorothy Boyd || Comedy || "]}, {"page": "Pearls Bring Tears", "response": ["Pearls Bring Tears is a 1937 British comedy drama film directed by Manning Haynes and starring John Stuart, Dorothy Boyd and Googie Withers.", "Madge Hart (Dorothy Boyd) borrows a pearl necklace to wear to a dance, but then accidentally breaks it. She is further concerned because the pearls were only on loan to her husband as security for a business deal. Madge then rushes the necklace to be repaired, but when it is stolen, further panic ensues.", "*Dorothy Boyd as Madge Hart"]}, {"page": "Third Time Lucky (1931 film)", "response": ["Third Time Lucky is a 1931 British comedy film directed by Walter Forde and starring Bobby Howes, Dorothy Boyd and Gordon Harker. It was made at Islington StudiosWood p.70 and based on a play by Arnold Ridley. The film's sets were designed by art director Walter Murton.", "* Dorothy Boyd as Jennifer Elling"]}, {"page": "The Iron Stair (1933 film)", "response": ["The Iron Stair (1933) is a British crime film directed by Leslie S. Hiscott and starring Henry Kendall, Dorothy Boyd, and Michael ", "* Dorothy Boyd as Eva Marshall"]}, {"page": "The Constant Nymph (1928 film)", "response": ["Young composer Lewis Dodd (Novello) travels to Austria to visit his mentor Albert Sanger (Georg Henrich). He meets Sanger's teenage daughters Tessa (Poulton), Antonia (Benita Hume), and Pauline (Dorothy Boyd) and Sanger's third wife Linda (Mary Clare), who does not appear to be liked by Sanger's daughters. The atmosphere is jovial and celebratory, until Sanger dies very suddenly.", "* Dorothy Boyd as Pauline Sanger"]}, {"page": "The Ace of Spades", "response": ["The Ace of Spades is a 1935 British drama film directed by George Pearson and starring Michael Hogan, Dorothy Boyd and Richard Cooper.", "* Dorothy Boyd - Nita Daventry "]}, {"page": "It Happened in Paris (1935 film)", "response": ["* Dorothy Boyd as Patricia "]}, {"page": "Inside the Room", "response": ["Inside the Room is a 1935 British mystery film directed by Leslie S. Hiscott and starring Austin Trevor, Dorothy Boyd and George Hayes. It was shot at Twickenham Studios in west London.https://www.imdb.com/title/tt0026531/ A French detective, Pierre Santos, investigates a popular singer suspected of murder.BFI.org The film's sets were designed by the studio's resident art director James A. Carter."]}, {"page": "Too Many Crooks (1930 film)", "response": ["Too Many Crooks is a 1930 British comedy crime film directed by George King and starring Laurence Olivier, Dorothy Boyd and Arthur Stratton.https://www.imdb.com/title/tt0021485/", "*Dorothy Boyd as The Girl \t"]}, {"page": "Rynox", "response": ["* Dorothy Boyd as Peter"]}, {"page": "A Shot in the Dark (1933 film)", "response": ["A Shot in the Dark is a 1933 British mystery film directed by George Pearson and starring Dorothy Boyd, O. B. Clarence, Jack Hawkins and Michael Shepley. When a wealthy old man dies suddenly, a local priest suspects something and begins to investigate.", "* Dorothy Boyd as Alaris Browne "]}, {"page": "Deaths in 1996", "response": ["*Dorothy Boyd, English film actress (b. 1907) "]}, {"page": "Important People", "response": ["Important People is a 1934 British comedy film directed by Adrian Brunel and starring Stewart Rome, Dorothy Boyd and Jack Raine.BFI.org In the film, a bickering couple stand against each other as candidates in a local council election.", "* Dorothy Boyd as Margaret Westcott"]}, {"page": "The Sport of Kings (1931 film)", "response": ["* Dorothy Boyd as Dulcie Primrose"]}, {"page": "Birds of Prey (1930 film)", "response": ["Birds of Prey, also known in the United States as The Perfect Alibi, is a 1930 British mystery film produced and directed by Basil Dean, from a screenplay he co-wrote with A.A. Milne from Milne's play which was known as The Perfect Alibi in the United States and The Fourth Wall in the United Kingdom. The film stars Dorothy Boyd, Robert Loraine, Warwick Ward, C. Aubrey Smith, Frank Lawton, and Robert Loraine, and was produced at Beaconsfield Studios by Associated Talking Pictures.Wood p.69", "Hilton's nephew, Jimmy Hilton (Frank Lawton), and his girlfriend Mollie (Dorothy Boyd), who also happens to be the ward of the elder Hilton, become suspicious of the story told by the two men, and begin their own investigation. Their questioning leads them to arrive at the truth, and the two murderers are apprehended.", "* Dorothy Boyd as Mollie Cunningham"]}, {"page": "Somehow Good", "response": ["Somehow Good is a 1927 British silent drama film directed by Jack Raymond and starring Fay Compton, Stewart Rome and Dorothy Boyd. It was made at Twickenham Studios and premiered in October 1927.Low p.187", "* Dorothy Boyd - Sally"]}, {"page": "The Love Race", "response": ["The Love Race is a 1931 British comedy film directed by Lupino Lane and starring Stanley Lupino, Jack Hobbs and Dorothy Boyd. It was adapted from Lupino's play of the same name and was produced by British International Pictures.", "*Dorothy Boyd as Ida Mostyn"]}, {"page": "Everything Is Rhythm", "response": ["Everything Is Rhythm is a 1936 British musical film directed by Alfred J. Goulding and starring Harry Roy, Princess Pearl and Dorothy Boyd.BFI.org", "* Dorothy Boyd - Grethe von Essen "]}, {"page": "Auld Lang Syne (1929 film)", "response": ["Auld Lang Syne is a 1929 British musical film directed by George Pearson and starring Harry Lauder, Dorothy Boyd, and Patrick Aherne. It was originally made as a silent film, but in September 1929 sound was added.BFI Database entry It was shot at Cricklewood Studios in Cricklewood, London.", "* Dorothy Boyd - Jill Bray"]}, {"page": "Toni (1928 film)", "response": ["Toni is a 1928 British thriller film directed by Arthur Maude and starring Jack Buchanan, Dorothy Boyd and Forrester Harvey.BFI.org It was made at Elstree Studios by British International Pictures and based on a play by Dion Titheradge.", "* Dorothy Boyd - Princess Eugenie "]}, {"page": "Get Your Man (1934 film)", "response": ["Get Your Man is a 1934 British comedy film directed by George King and starring Dorothy Boyd, Sebastian Shaw and Clifford Heatherley.BFI.org It is based on the play Tu m'epouseras by Louis Verneuil. It features the second screen appearance of future star Rex Harrison.", "* Dorothy Boyd - Nancy McAlpine"]}, {"page": "The Ball of Fortune", "response": ["* Dorothy Boyd as Connie"]}, {"page": "Virginia's Husband (1934 film)", "response": ["Virginia's Husband is a 1934 British comedy film directed by Maclean Rogers and starring Dorothy Boyd, Reginald Gardiner and Enid Stamp-Taylor. The screenplay concerns a woman who enlists a man to pose as her husband to trick her aunt. The play by Florence Kilpatrick on which the film is based, had previously been adapted as a silent film in 1928.", "* Dorothy Boyd - Virginia Trevor "]}, {"page": "List of Elstree Studios productions", "response": ["*Toni is a thriller film directed by Arthur Maude and starring Jack Buchanan, Dorothy Boyd and Forrester Harvey."]}, {"page": "Two Wives for Henry", "response": ["Two Wives for Henry is a 1933 British comedy film directed by Adrian Brunel and starring Garry Marsh, Dorothy Boyd and Jack Raine. A man decides to take a \"substitute\" wife with him for a vacation in Brighton, but things soon begin to go wrong.", "* Dorothy Boyd as Estelle Stetson"]}, {"page": "Love's Option", "response": ["Love's Option is a 1928 British silent adventure film directed by George Pearson and starring Dorothy Boyd, Patrick Aherne and James Carew. It was made at Cricklewood Studios based on the novel The Riddle by Douglas Newton. The film was distributed by Paramount Pictures' British subsidiary, enabling the company to meet its yearly quota set down by the British government. The film follows several rivals attempting to gain control of a valuable Spanish copper mine. It was known by the alternative title A Girl of Today.", "* Dorothy Boyd as Dorothy "]}, {"page": "Fifty-Fifty (play)", "response": ["*Countess Romani – Dorothy Boyd"]}, {"page": "Everything in Life", "response": ["* Dorothy Boyd as Miss Winstone  "]}, {"page": "List of British films of 1928", "response": ["|Love's Option||George Pearson||Dorothy Boyd, Patrick Aherne||Adventure||", "|Toni||Arthur Maude||Jack Buchanan, Dorothy Boyd||Thriller||"]}, {"page": "List of British films of 1929", "response": ["|Auld Lang Syne||George Pearson||Harry Lauder, Dorothy Boyd||Drama||"]}, {"page": "1936 in British music", "response": ["* Everything Is Rhythm, starring Harry Roy and Dorothy BoydBFI.org"]}]}}