{"wiki_id": "http://www.wikidata.org/entity/Q125084", "itemLabel": "John Hanning Speke", "itemDescription": "British military officer and explorer", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Hanning_Speke", "wikipedia_page": {"main": "Captain John Hanning Speke (4 May 1827 – 15 September 1864) was an English explorer and officer in the British Indian Army who made three exploratory expeditions to Africa. He is most associated with the search for the source of the Nile and was the first European to reach Lake Victoria (known to locals as Nam Lolwe in Dholuo and Nnalubaale or Ukerewe in Luganda). Speke is also known for propounding the Hamitic hypothesis in 1863, in which he supposed that the Tutsi ethnic group were descendants of the biblical figure Ham, and had lighter skin and more Hamitic features than the Bantu Hutu over whom they ruled.", "link_mentions": [{"page": "List of Scots", "response": ["* James Augustus Grant (1827–1892), British Army Lieutenant who accompanied John Hanning Speke in the search and discovery of the source of the River Nile; the Grant's gazelle is named in his honour"]}, {"page": "List of historical drama films and series set in Near Eastern and Western civilization", "response": ["| Mountains of the Moon || 1990 || 1854–1864 || Journey of Richard Francis Burton and John Hanning Speke in their expedition to Central Africa and the rivalry that followed"]}, {"page": "History of Africa", "response": ["Knowledge of Africa increased. Numerous European explorers began to explore the continent. Mungo Park traversed the Niger River. James Bruce travelled through Ethiopia and located the source of the Blue Nile. Richard Francis Burton was the first European at Lake Tanganyika. Samuel White Baker explored the Upper Nile. John Hanning Speke located a source of the Nile at Lake Victoria. Other significant European explorers included Heinrich Barth, Henry Morton Stanley (coiner of the term \"Dark Continent\" for Africa in an 1878 book), Silva Porto, Alexandre de Serpa Pinto, Rene Caille, Friedrich Gerhard Rohlfs, Gustav Nachtigal, George Schweinfurth, and Joseph Thomson. The most famous of the explorers was David Livingstone, who explored southern Africa and traversed the continent from the Atlantic at Luanda to the Indian Ocean at Quelimane. European explorers made use of African guides and servants, and established long-distance trading routes.Shillington (2005), p. 295.Collins and Burns (2007), pp. 254–257."]}, {"page": "May 4", "response": ["*1827 – John Hanning Speke, English soldier and explorer (d. 1864)"]}, {"page": "Nile", "response": ["Lake Victoria was first sighted by Europeans in 1858 when British explorer John Hanning Speke reached its southern shore while traveling with Richard Francis Burton to explore central Africa and locate the great lakes. Believing he had found the source of the Nile on seeing this \"vast expanse of open water\" for the first time, Speke named the lake after the then Queen of the United Kingdom. Burton, recovering from illness and resting further south on the shores of Lake Tanganyika, was outraged that Speke claimed to have proved his discovery to be the true source of the Nile when Burton regarded this as still unsettled. A very public quarrel ensued, which sparked a great deal of intense debate within the scientific community and interest by other explorers keen to either confirm or refute Speke's discovery. British explorer and missionary David Livingstone pushed too far west and entered the Congo River system instead. It was ultimately Welsh-American explorer Henry Morton Stanley who confirmed Speke's discovery, circumnavigating Lake Victoria and reporting the great outflow at Ripon Falls on the lake's northern shore.", "* Journal of the Discovery of the Source of the Nile, John Hanning Speke. William Blackwood, Edinburgh, 1863; Harper & Brothers, New York; 1864"]}, {"page": "September 15", "response": ["*1864 – John Hanning Speke, English soldier and explorer (b. 1827)"]}, {"page": "University of Oxford", "response": ["Other notable figures include Gertrude Bell, an explorer, archaeologist, mapper and spy, who, along with T. E. Lawrence, helped establish the Hashemite dynasties in what is today Jordan and Iraq and played a major role in establishing and administering the modern state of Iraq; Richard Francis Burton, who travelled in disguise to Mecca and journeyed with John Hanning Speke as the first European explorers to visit the Great Lakes of Africa in search of the source of the Nile; anthropologist Katherine Routledge, who carried out the first survey of Easter Island; mountaineer Tom Bourdillon, member of the expedition to make the first ascent of Mount Everest; and Peter Fleming, adventurer and travel writer and elder brother of Ian Fleming, creator of James Bond."]}, {"page": "1860", "response": ["* October – John Hanning Speke and James Augustus Grant leave Zanzibar, to search for the source of the Nile River."]}, {"page": "1858", "response": ["* February 13 – Richard Francis Burton and John Hanning Speke become the first Europeans to discover Lake Tanganyika."]}, {"page": "Bath, Somerset", "response": ["The city is home to the Victoria Art Gallery, the Museum of East Asian Art, and Holburne Museum, numerous commercial art galleries and antique shops, as well as a number of other museums, among them Bath Postal Museum, the Fashion Museum, the Jane Austen Centre, the Herschel Museum of Astronomy and the Roman Baths. The Bath Royal Literary and Scientific Institution (BRLSI) in Queen Square was founded in 1824 from the Society for the encouragement of Agriculture, Planting, Manufactures, Commerce and the Fine Arts founded in 1777. In September 1864, BRLSI hosted the 34th annual meeting of the British Science Association, which was attended by explorers David Livingstone, Sir Richard Francis Burton, and John Hanning Speke. The history of the city is displayed at the Museum of Bath Architecture, which is housed in a building built in 1765 as the Trinity Presbyterian Church. It was also known as the Countess of Huntingdon's Chapel, as she lived in the attached house from 1707 to 1791."]}, {"page": "Henry Morton Stanley", "response": ["In 1874, the New York Herald and the Daily Telegraph financed Stanley on another expedition to Africa.  His ambitious objective was to complete the exploration and mapping of the Central African Great Lakes and rivers, in the process circumnavigating Lakes Victoria and Tanganyika and locating the source of the Nile.  Between 1875 and 1876 Stanley succeeded in the first part of his objective, establishing that Lake Victoria had only a single outlet – the one discovered by John Hanning Speke on 21 July 1862 and named Ripon Falls. If this was not the Nile's source, then the separate massive northward flowing river called by Livingstone, the Lualaba, and mapped by him in its upper reaches, might flow on north to connect with the Nile via Lake Albert and thus be the primary source.", "Stanley wrote with some measure of satisfaction when describing how Captain John Hanning Speke, the first European to visit Uganda, had been punched in the teeth for disobedience to Mbarak Bombay, a caravan leader also employed by Stanley, which made Stanley claim that he would never allow Bombay to have the audacity to stand up for a boxing match with him. In the same paragraph, Stanley described how he several months later administered punishment to the African."]}, {"page": "David Livingstone", "response": ["In January 1866, Livingstone returned to Africa, this time to Zanzibar, and from there he set out to seek the source of the Nile. Richard Francis Burton, John Hanning Speke, and Samuel Baker had identified either Lake Albert or Lake Victoria as the source (which was partially correct, as the Nile \"bubbles from the ground high in the mountains of Burundi halfway between Lake Tanganyika and Lake Victoria\"), but there was still serious debate on the matter. Livingstone believed that the source was farther south and assembled a team to find it consisting of freed slaves, Comoros Islanders, twelve Sepoys, and two servants from his previous expedition, Chuma and Susi. "]}, {"page": "List of explorers", "response": ["| John Hanning Speke"]}, {"page": "Richard Francis Burton", "response": ["Burton's best-known achievements include: a well-documented journey to Mecca in disguise, at a time when Europeans were forbidden access on pain of death; an unexpurgated translation of One Thousand and One Nights (commonly called The Arabian Nights in English after early translations of Antoine Galland's French version); the publication of the Kama Sutra in English; a translation of The Perfumed Garden, the \"Arab Kama Sutra\"; and a journey with John Hanning Speke as the first Europeans to visit the Great Lakes of Africa in search of the source of the Nile.", "In May 1854, Burton traveled to Aden in preparation for his Somaliland Expedition, supported by the Royal Geographical Society. Other members included G.E. Herne, William Stroyan, and John Hanning Speke. Burton undertook the expedition to Harar, Speke investigated the Wady Nogal, while Herne and Stroyan stayed on at Berbera.  According to Burton, \"A tradition exists that with the entrance of the first [white] Christian Harar will fall.\"  With Burton's entry, the \"Guardian Spell\" was broken.", "  at:1854 text:\"1854: Meets John Hanning Speke.\""]}, {"page": "Lake Victoria", "response": ["Lake Victoria (; ; ; also Ukerewe) is one of the African Great Lakes. Though having multiple local language names, the lake was renamed after Queen Victoria by the explorer John Hanning Speke, the first Briton to document it in 1858, while on an expedition with Richard Francis Burton. ", "The lake existed and was known to many Africans in the catchment area long before it was sighted by a European in 1858 when the British explorer John Hanning Speke reached its southern shore while on his journey with Richard Francis Burton to explore central Africa and locate the Great Lakes. Believing he had found the source of the Nile on seeing this \"vast expanse of open water\" for the first time, Speke named the lake after Queen Victoria. Burton, who had been recovering from illness at the time and resting further south on the shores of Lake Tanganyika, was outraged that Speke claimed to have proved his discovery to have been the true source of the Nile River, which Burton regarded as still unsettled. A very public quarrel ensued, which not only sparked a great deal of intense debate within the scientific community of the day, but also much interest by other explorers keen to either confirm or refute Speke's discovery."]}, {"page": "John Speke", "response": ["#REDIRECT John Hanning Speke"]}, {"page": "John Henning Speke", "response": ["#REDIRECT John Hanning Speke"]}, {"page": "List of suicides", "response": ["* John Hanning Speke (1864), British explorer, gunshot. An inquest concluded that his death was accidental, a conclusion supported by Speke's biographer Alexander Maitland, as the location of the fatal wound just below Speke's armpit made suicide unlikely.  However the idea of suicide has appealed to some critics of Speke."]}, {"page": "1864 in literature", "response": ["*September – A debate at the Royal Geographical Society between Richard Francis Burton and John Hanning Speke is prevented by Speke's suicide (or accidental shooting)."]}, {"page": "List of geographers", "response": ["*John Hanning Speke (England, 1827–1864)"]}, {"page": "Buganda", "response": ["Before the arrival of Europeans in the region, Buganda was an expanding, \"embryonic empire\". It built fleets of war canoes from the 1840s to take control of Lake Victoria and the surrounding regions and subjugated several weaker peoples. These subject peoples were then exploited for cheap labor. The first Europeans to enter the Kingdom of Buganda were British explorers John Hanning Speke and Captain Sir Richard Francis Burton while searching for the headwaters of the Nile in 1862. They found a highly organized political system which was marred, however, by the ongoing practice of mass human sacrifice estimated at 800 persons annually."]}, {"page": "James Augustus Grant", "response": ["He returned to England in 1858, and in 1860 joined John Hanning Speke in the memorable expedition which solved the problem of the Nile sources. The expedition left Zanzibar in October 1860 and reached Gondokoro, where the travellers were again in touch with what they regarded as civilization, in February 1863. Speke was the leader, but Grant carried out several investigations independently and made valuable botanical collections. He acted throughout in absolute loyalty to his comrade. "]}, {"page": "Natural History Museum, London", "response": ["* The Travelling Naturalists (1985) by Clare Lloyd. (Study of 18th Century Natural History — includes Charles Waterton, John Hanning Speke, Henry Seebohm and Mary Kingsley). Contains colour and black and white reproductions. Croom Helm (UK). ."]}, {"page": "Gondokoro", "response": ["The Austrian Catholic missionary Ignatius Knoblecher set up a mission there in 1852. It was abandoned in 1859.  Gondokoro was the scene for the arrival of John Hanning Speke and James Augustus Grant after their two years and five months long journey through Central Africa from Zanzibar. They arrived exhausted on February 13, 1863 and expected to be met by the British consul John Petherick and his rescue party. As Petherick was away hunting in the countryside, the two explorers instead were welcomed by Samuel Baker and his \"wife\" Florence Baker, who greeted them with a cup of tea.To The Heart Of The Nile: Lady Florence Baker and the Exploration of Central Africa, by Pat Shipman"]}, {"page": "Early history of Uganda", "response": ["Meanwhile, Buganda was receiving not only traded goods and guns but a stream of foreign visitors as well. The explorer John Hanning Speke passed through Buganda in 1862 and claimed he had discovered the source of the Nile. Both Speke and Stanley (based on his 1875 stay in Uganda) wrote books that praised the Baganda for their organisational skills and willingness to modernise. Stanley went further and attempted to convert the king to Christianity. Finding Kabaka Mutesa I apparently receptive, Stanley wrote to the Church Missionary Society (CMS) in London and persuaded it to send missionaries to Buganda in 1877."]}, {"page": "1858 in science", "response": ["* February 13 – Richard Francis Burton and John Hanning Speke become the first Europeans to discover Lake Tanganyika.", "* August 3 – John Hanning Speke discovers Lake Victoria, source of the River Nile."]}, {"page": "John McDouall Stuart", "response": ["Stuart reached Adelaide in October 1860. Although he had narrowly failed to cross the continent, his achievement in determining the centre was immense, ranked with John Hanning Speke's discovery of the source of the Nile. Stuart had solved that which he attempted with Capt. Sturt 15 years earlier – the riddle of the nature of the centre of the great Australian continent. He was awarded the Royal Geographical Society's Patron's Medal – becoming only the second person to receive both the Patron's Medal and a gold watch (the other was Dr Livingstone). Belatedly, even the South Australian government started to recognise Stuart's abilities, and was honoured with a public breakfast at White's Rooms in Adelaide."]}, {"page": "Sitatunga", "response": ["The scientific name of the sitatunga is Tragelaphus spekii. The species was first described by the English explorer John Hanning Speke in 1863. Speke first observed the sitatunga at a lake named \"Little Windermere\" (now Lake Lwelo, located in Kagera, Tanzania). In his book Journal of the Discovery of the Source of the Nile, Speke called the animal \"nzoé\" (Kiswahili name for the animal) or \"water-boc\" (due to its resemblance to the waterbuck). The scientific name has often been misstated as T. spekei, and either Speke or Sclater is referred to as the binomial authority. "]}, {"page": "Mary Kingsley", "response": ["*  A study of 18th Century Natural History - includes Charles Waterton, John Hanning Speke, Henry Seebohm and Mary Kingsley. Contains colour and black and white reproductions. "]}, {"page": "Jinja, Uganda", "response": ["In 1954, the construction of the Owen Falls Dam submerged the Ripon Falls. Most of the \"Flat Rocks\" that gave the area its name disappeared under water as well. The local Baganda called the area \"the stones\" which is \"Mayinja\" in Luganda. The name \"Jinja\" is derived from this. A description of what the area looked like can be found in the notes of John Hanning Speke, the first European to lay eyes on the source of the Nile:"]}, {"page": "Mountains of the Moon (Africa)", "response": ["* The feature film Mountains of the Moon (1990) relates the story of Sir Richard Francis Burton and John Hanning Speke seeking the source of the Nile in the 1850s. "]}, {"page": "Ruanda-Urundi", "response": ["To implement their vision, the Belgians extended and consolidated a power structure based on indigenous institutions. In practice, they developed a Tutsi ruling class to formally control a mostly Hutu population, through the system of chiefs and sub-chiefs under the overall rule of the two Mwami. Contemporary racial science and eugenics led Belgian administrators believed that the Tutsi were genetically more closely related to Europeans than the Hutu superior and deserved power. Some scholars circulated, including John Hanning Speke, propagated the Hamitic hypothesis which held that the Tutsi were descended from \"black Caucasians\" who invaded Europe and were the ancestors of all the more \"civilised\" African peoples. While before colonization the Hutu had played some role in governance, the Belgians simplified matters by further stratifying the society on ethnic lines. Hutu anger at the Tutsi domination was largely focused on the Tutsi elite rather than the distant colonial power.Peter Langford, \"The Rwandan Path to Genocide: The Genesis of the Capacity of the Rwandan Post-colonial State to Organise and Unleash a project of Extermination\". Civil Wars Vol. 7 n.3 Musinga was deposed by the administration as mwami of Ruanda in November 1931 after being accused of disloyalty. He was replaced by his son Mutara III Rudahigwa."]}, {"page": "Bagamoyo", "response": ["But Bagamoyo was not only a trade centre for ivory and copra; it was also a starting point for renowned European explorers. From Bagamoyo they moved out to find the source of the River Nile and explored the African inner lakes. Some of these were Richard Francis Burton, John Hanning Speke, Henry Morton StanleyStanley, H.M., 1899, Through the Dark Continent, London: G. Newnes,  and James Augustus Grant. Although often believed so, David Livingstone had never been to Bagamoyo in his lifetime. Only after his death he was laid out in the Old Church's tower (nowadays named Livingston Tower) to wait for the high tide to come in and ship his body to Zanzibar."]}, {"page": "Ruzizi River", "response": ["The Ruzizi River, flowing south into Lake Tanganyika, is part of the upper watershed of the Congo River. Nineteenth-century British explorers such as Richard Francis Burton and John Hanning Speke, uncertain of the direction of flow of the Ruzizi, thought that it might flow north out of the lake toward the White Nile. Their research and follow-up explorations by David Livingstone and Henry Morton Stanley established among Europeans that this was not the case. The Ruzizi flows into Lake Tanganyika, which overflows into the Lukuga River about  south of Ujiji. The Lukuga flows west into the Lualaba River, a major tributary of the Congo."]}, {"page": "Samuel George Morton", "response": ["* John Hanning Speke"]}, {"page": "Speke's gazelle", "response": ["Speke's gazelle is named after John Hanning Speke, a British explorer of Central Africa."]}, {"page": "Busoga", "response": ["Busoga's written history began in 1862. On 28 July Royal Geographical Society explorer John Hanning Speke arrived at Ripon Falls (near Jinja, where the Victoria Nile flows from Lake Victoria and begins its descent to Egypt. Since Speke's route (inland from the East African coast) took him around the southern end of Lake Victoria, he approached Busoga from the west (through Buganda). Having reached his goal (the source of the Nile), he turned northward and followed the river downstream without exploring Busoga. He records, however, being told that Usoga (Swahili for Busoga) was an island (it is bordered on all four sides by water)."]}, {"page": "European exploration of Africa", "response": ["At the beginning of the 19th century, European knowledge of the geography of the interior of Sub-Saharan Africa was still rather limited. Expeditions exploring Southern Africa were made during the 1830s and 1840s, so that around the midpoint of the 19th century and the beginning of the colonial Scramble for Africa, the unexplored parts were now limited to what would turn out to be the Congo Basin and the African Great Lakes. This \"Heart of Africa\" remained one of the last remaining \"blank spots\" on world maps of the later 19th century (alongside the Arctic, Antarctic and the interior of the Amazon basin). It was left for 19th-century European explorers, including those searching for the famed sources of the Nile, notably John Hanning Speke, Sir Richard Burton, David Livingstone and Henry Morton Stanley, to complete the exploration of Africa by the 1870s. After this, the general geography of Africa was known, but it was left to further expeditions during the 1880s onward, notably, those led by Oskar Lenz, to flesh out more detail such as the continent's geological makeup.", "* John Hanning Speke (1827–1864) (discovered the source of the Nile)"]}, {"page": "Dowlish Wake", "response": ["The Manor was the home of the family of John Hanning Speke who took part in three expeditions to Central Africa from 1854 to 1862, the last two in search of the source of the Nile. Speke discovered Lake Victoria and maintained that it was the source of the White Nile. On his third expedition, Speke identified Ripon Falls, the outlet of Lake Victoria, as the source of the Nile; this was confirmed by Henry Morton Stanley in a later expedition. Speke was killed in Neston Park in Wiltshire by his own gun while hunting with his cousin on 18 September 1864; Dr David Livingstone and Sir Roderick Murchison, President of the Royal Geographical Society, attended his funeral. A memorial to Speke, with a lifesize bust, is in the church where he is buried."]}]}}