{"wiki_id": "http://www.wikidata.org/entity/Q1261348", "itemLabel": "Phillip Goodhand-Tait", "itemDescription": "British singer-songwriter", "wikipedia_url": "https://en.wikipedia.org/wiki/Phillip_Goodhand-Tait", "wikipedia_page": {"main": "Phillip Goodhand-Tait (born 3 January 1945, Hull, East Riding of Yorkshire, England) is an English singer-songwriter, record producer and keyboard player.", "link_mentions": [{"page": "Barney Bubbles", "response": ["Bubbles also maintained his freelance output, producing designs for Peter Jenner (Ian Dury and Billy Bragg's manager), and others. He created a prodigious output by working for such bands, musicians and performers as Peter Hammill, Vivian Stanshall, Generation X, Big Star, Johnny Moped, Whirlwind, Billy Bragg, Clover, the Sinceros, Roger Chapman, Phillip Goodhand-Tait, Dr. Feelgood, Inner City Unit and the Psychedelic Furs. As a result, his work appeared on releases by labels such as Aura, Chiswick, Utility, Go! Discs, Epic, Charisma, CBS, Line Records, United Artists and Riddle Records. His signature style emerged as one that was colourful, playful, loaded with geometry, art-history and music-history references, jokes, cryptograms and symbols. The overriding appetite was for going against the grain of accepted design standards. His work is simultaneously complex in meaning and simple in its delivery. Examples include:"]}, {"page": "Camel (band)", "response": ["Andrew Latimer (guitar), Andy Ward (drums), and Doug Ferguson (bass) had been playing as a trio called the Brew around the Guildford, Surrey area of England. In early 1971 they auditioned to be the back-up band for singer/songwriter Phillip Goodhand-Tait and appeared on his album I Think I'll Write a Song on DJM Records. They then recruited keyboardist Peter Bardens and after an initial gig to fulfill a Bardens commitment under the name Peter Bardens' On, they changed their name to Camel. Their first gig under that name was at Waltham Forest Technical College, London supporting Wishbone Ash in December 1971."]}, {"page": "Chrysalis Records", "response": ["* Phillip Goodhand-Tait"]}, {"page": "Mel Collins", "response": ["*Phillip Goodhand-Tait and the Stormsville Shakers; saxophonist 1966"]}, {"page": "Spanish Train and Other Stories", "response": ["* Phillip Goodhand-Tait – harmonium"]}, {"page": "Land's End (album)", "response": ["* Phillip Goodhand-Tait – keyboards  "]}, {"page": "One of the Boys (Roger Daltrey album)", "response": ["\"Parade\" is a cover song originally released on Phillip Goodhand-Tait's sixth solo album, Teaching an Old Dog New Tricks, in 1976.", "\"Leon\" was written and recorded by Phillip Goodhand-Tait in 1972 and originally released on his third album Songfall. The song was released as a single (by Daltrey) in April 1978 but did not chart and was not released in the UK."]}, {"page": "List of pop and rock pianists", "response": ["*Phillip Goodhand-Tait"]}, {"page": "Philip Goodhand-Tait", "response": ["#REDIRECT Phillip Goodhand-Tait"]}, {"page": "Far Beyond These Castle Walls", "response": ["* Phillip Goodhand-Tait – harmonium"]}, {"page": "Goodhand", "response": ["* Phillip Goodhand-Tait (born 1945), English singer-songwriter, record producer, and keyboard player"]}, {"page": "Play Dirty Live", "response": ["*Phillip Goodhand-Tait, Len Epand - executive producers"]}, {"page": "Euson", "response": ["* Leon - #14 in May/June, 1974A Phillip Goodhand-Tait composition."]}, {"page": "Metal Racer", "response": ["* Phillip Goodhand-Tait - producer"]}, {"page": "Love Affair (band)", "response": ["Love Affair's first single, \"She Smiled Sweetly\", written by Mick Jagger and Keith Richards and released on Decca Records, flopped, but the band reached the top of the UK Singles Chart in January 1968 with \"Everlasting Love\". By this time the group had relocated to CBS Records. The song was first recorded by Robert Knight, whose version had reached No. 13 in the Billboard Hot 100 chart in the autumn of 1967, and it was previously offered to Marmalade, who turned it down. On the B-side was a cover version of \"Gone Are the Songs of Yesterday\", which was written by Phillip Goodhand-Tait. After its success, Goodhand-Tait saw an opportunity and signed a contract with Love Affair's managers John Cokell and Sid Bacon. Goodhand-Tait went on to write more songs for Love Affair."]}, {"page": "Live at the Marquee (Osibisa album)", "response": ["*Production (Original): Phillip Goodhand-Tait, Maurice Bacon, Kate & Derek Burbidge"]}, {"page": "Best of Rockers & Ballads", "response": ["# \"Leon\" (Phillip Goodhand-Tait)"]}, {"page": "The Everlasting Love Affair", "response": ["The band recorded the album in November 1968 at the CBS Recording Studios. The band's keyboardist Morgan Fisher, who had taken a break from the band to complete his final year at Hendon County Grammar School, returned in time for involvement in the recording of the album. The album's recording process was brief. Due to their commitments, the band had one day to complete the album. The band was involved in the orchestral arrangements but session musicians were again incorporated as it was deemed the most effective way to utilise their limited time. The band lacked the confidence to compose their own songs so all of the tracks were either cover versions or written by Phillip Goodhand-Tait. Goodhand-Tait first contributed the B-side for \"Everlasting Love\", and when the tapes were complete, more compositions followed for the album. Many of the songs followed the pop formula that brought the band to success, a cause of frustration for the group. The album was released in December 1968 to the UK, but it failed to chart nationally. In 2006, the album was reissued by Repertoire Records with eight bonus-tracks and a 16-page booklet containing an illustrated history of the band."]}, {"page": "World of Music (Mary O'Hara album)", "response": ["#\"Oceans Away\" (Phillip Goodhand-Tait)"]}]}}