{"wiki_id": "http://www.wikidata.org/entity/Q1272578", "itemLabel": "Richard Sharpe", "itemDescription": "fictional character", "wikipedia_url": "https://en.wikipedia.org/wiki/Sharpe_(novel_series)", "wikipedia_page": {"main": "Sharpe is a series of historical fiction stories by Bernard Cornwell centred on the character of Richard Sharpe. The stories formed the basis for an ITV television series featuring Sean Bean in the title role.\nCornwell's series is composed of many novels and several short stories, and charts Sharpe's progress in the British Army during the Napoleonic Wars, though the novels were published in non-chronological order. He begins in Sharpe's Tiger as a private in the 33rd Regiment of Foot who is continually promoted, finally rising to lieutenant colonel in Sharpe's Waterloo. His military career ends with the final defeat of Napoleon, but he has more adventures as a civilian.\nSharpe is born to a whore in the rookeries of London. Orphaned at an early age, he grows up in poverty. He is eventually taken in by prostitute (and later bar owner) Maggie Joyce and becomes a thief. He has to flee the city after killing a man to protect Maggie.\nEnlisting in the army, he is promoted to sergeant as a reward for completing a highly dangerous spying mission in India. He is made an officer, an ensign, when he saves the life of his commanding officer, Arthur Wellesley (the future Duke of Wellington), during the Battle of Assaye. It is a mixed blessing, as he constantly has to fight class prejudice in an army where an officer's rank is often purchased without regard to qualification. Cornwell sees to it that he is improbably present at many important battles of the British Empire at the end of the 18th century and beginning of the 19th, including the Battle of Waterloo.\nSharpe is described as \"brilliant but wayward\" in Sharpe's Sword, and he is portrayed by the author as a \"loose cannon\". He becomes a highly skilled and experienced leader of light troops. In contrast to the honourable Horatio Hornblower, the inspiration for the series, Sharpe is a rogue, an unabashed thief and murderer who has no qualms about killing a bitter enemy when the opportunity arises. However, he is protective of women in general and has a number of lovers over the course of his life.\nHe is six feet tall, with an angular, tanned face, long black hair, and blue eyes. He has a deep scar on his right cheek which pulls at his right eye, giving his face a mocking expression when relaxed; this disappears when he smiles, which is not too frequently. By the end of the series, he has had two wives and three children.", "link_mentions": [{"page": "Gordon Riots", "response": ["In Bernard Cornwell's Sharpe novels (1981–2007), the protagonist Richard Sharpe's mother was killed during the riots while he was still a child."]}, {"page": "Bernard Cornwell", "response": ["Bernard Cornwell,  (born 23 February 1944) is an English author of historical novels and a history of the Waterloo Campaign. He is best known for his novels about Napoleonic Wars rifleman Richard Sharpe.  He has also written the Saxon / Last Kingdom stories about King Alfred and the making of England.", "Cornwell's first series of historical novels features the adventures of Richard Sharpe, an English soldier during the Napoleonic Wars, in particular the Peninsular Wars once Arthur Wellesley was sent to lead the campaign against Napoleon's forces on the Iberian Peninsula. The first 11 books of the Sharpe series began with Sharpe's Rifles and ended with Sharpe's Waterloo, published in the US as Waterloo. These detail Sharpe's adventures in various Peninsular War campaigns over the course of seven years. Subsequently, Cornwell wrote Sharpe's Tiger, Sharpe's Triumph, Sharpe's Fortress, Sharpe's Trafalgar, and Sharpe's Prey, depicting Sharpe's earlier adventures under Wellington's command in India, including his hard-won promotion to the officer corps, his return to Britain, and his arrival in the 95th Rifles; he also wrote the sequel Sharpe's Devil, set six years after the end of the wars. Sharpe's Battle takes place during the Battle of Fuentes de Onoro. Since 2003, he has written further \"missing adventures\" set during the Peninsular War era, based on major battles of that long campaign, for a total of 24 novels in this series.", "Four novels set during the American Civil War follow the adventures of Boston-born Nathaniel Starbuck during his service in the Confederate Army. The series is notable for an appearance by Richard Sharpe's son as a supporting character."]}, {"page": "Sean Bean", "response": ["Sean Bean (born Shaun Mark Bean on 17 April 1959) is an English actor. After graduating from the Royal Academy of Dramatic Art, Bean made his professional debut in a theatre production of Romeo and Juliet in 1983. Retaining his Yorkshire accent, he first found mainstream success for his portrayal of Richard Sharpe in the ITV series Sharpe, which originally ran from 1993 to 1997.", "Bean's critical successes in Caravaggio and Lady Chatterley contributed to his emerging image as a sex symbol, but he became most closely associated with the character of Richard Sharpe, the maverick Napoleonic Wars rifleman in the ITV television series Sharpe. The series was based on Bernard Cornwell's novels about the Peninsular War, and the fictional experiences of a band of soldiers in the famed 95th Rifles. Starting with Sharpe's Rifles, the series followed the fortunes and misfortunes of Richard Sharpe as he rose from the ranks as a Sergeant, promoted to Lieutenant in Portugal, to Lieutenant Colonel by the time of the Battle of Waterloo.", "| Sergeant/Lieutenant Richard Sharpe", "| Captain Richard Sharpe", "| Captain Richard Sharpe", "| rowspan=2 |Major Richard Sharpe", "| rowspan=\"3\" | Major Richard Sharpe", "| rowspan=\"5\" | Major Richard Sharpe", "| Lieutenant Colonel Richard Sharpe", "| Sergeant/Colonel Richard Sharpe", "| Colonel Richard Sharpe"]}, {"page": "Battle of Assaye", "response": ["*Bernard Cornwell's fictional character Richard Sharpe earned his battlefield promotion to officer's rank by saving Wellesley's life at the Battle of Assaye. The novel Sharpe's Triumph (HarperCollins, 1998, ) depicts the campaign and the battle in detail. Both men's memories of Assaye are mentioned several more times throughout the series as Sharpe and Wellington's careers progress.  The television adaptation differs and depicts Sharpe saving Wellesley's life from French soldiers in Spain during the later Peninsular War."]}, {"page": "Sharpe (TV series)", "response": ["Sharpe is a British television drama series starring Sean Bean as Richard Sharpe, a fictional British soldier in the Napoleonic Wars, with Irish actor Daragh O'Malley playing his second in command Patrick Harper. Sharpe and Harper are the heroes of the Sharpe series of novels by Bernard Cornwell; most, though not all, of the episodes are based on the books. Produced by Celtic Films and Picture Palace Films for the ITV network, the series was filmed mainly in Crimea, with recording of other episodes in Turkey, England, Portugal, Spain and the two final episodes filmed in India.", "At the beginning of the series, Richard Sharpe is a sergeant in the 95th Rifles serving in Portugal during the Peninsular War in 1809. When he single-handedly saves the life of General Sir Arthur Wellesley from a group of French cavalrymen, Wellesley gives Sharpe a battlefield commission, appointing him a lieutenant. Sharpe is placed in charge of a detachment of elite \"chosen men\" of the 95th Rifles. Patrick Harper eventually becomes his best friend and is promoted to sergeant and later sergeant major.", "* Sean Bean as Sergeant, later Lieutenant-Colonel, Richard Sharpe (1993–1997, 2006, 2008)"]}, {"page": "Richard", "response": ["* Richard Sharpe, main character in the Sharpe novel series, portrayed by Sean Bean in TV adaptations"]}, {"page": "Rifle Brigade (The Prince Consort's Own)", "response": ["* Richard Sharpe – fictional hero of Bernard Cornwell's \"Sharpe\" novels, which prominently feature the 95th."]}, {"page": "Sharpe", "response": ["**Richard Sharpe (fictional character), the title character of the Sharpe series by Bernard Cornwell"]}, {"page": "Sharpe's Regiment", "response": ["Sharpe's Regiment is the seventeenth historical novel in the Richard Sharpe series by Bernard Cornwell, first published in 1986. The story is set in England as Sharpe looks for the missing Second Battalion of the South Essex Regiment needed in Spain to fight in the Napoleonic Wars."]}, {"page": "South Essex Regiment", "response": ["*Richard Sharpe (1815), confirmed in command by the Duke of Wellington."]}, {"page": "Sharpe's Havoc", "response": ["Sharpe's Havoc: Richard Sharpe and the Battle of Oporto is the seventh historical novel in the Richard Sharpe series by Bernard Cornwell, first published in 2003.", "During a general British and Portuguese retreat from the French after the First Battle of Porto, Captain Horgan orders Lieutenant Richard Sharpe and his men to help find and escort to safety 19-year-old Englishwoman Kate Savage, the daughter of a recently deceased prominent port merchant.  For some unknown reason, she ran away from her home in Oporto.  Horgan also tells Sharpe to \"keep a close eye\" on Colonel James Christopher, who has been staying with the Savages and was the one who requested help in retrieving her. After Horgan leaves, however, Christopher dismisses Sharpe and his men. ", "*Richard Sharpe – protagonist."]}, {"page": "Sharpe's Tiger", "response": ["Sharpe's Tiger is the fifteenth (though first in chronological order) historical novel in the Richard Sharpe series by Bernard Cornwell and was first published in 1997.  It acts as a prequel to the \"original\" Sharpe series, which begins in 1809, while Sharpe is a captain in the Peninsular War during the Talavera Campaign in Spain.  In Tiger, Sharpe is a private in the 33rd Regiment of Foot, serving in southern India during the Siege of Seringapatam in 1799.", "Richard Sharpe is a private in the 33rd Regiment of Foot in the British army. The British invade Mysore and advance on the Tippoo Sultan's capital city of Seringapatam. Sharpe is contemplating desertion with his paramour, half-caste army widow Mary Bickerstaff, due to his sadistic company sergeant, Obadiah Hakeswill. Hakeswill lusts after Mary, so he provokes Sharpe into hitting him before witnesses, company commander Captain Morris and Ensign Hicks. Sharpe is court-martialled; Lieutenant William Lawford, who is supposed to act as his defender, is absent and Sharpe is given the virtual death sentence of 2,000 lashes. However, the regiment's commander, Colonel Arthur Wellesley (later the Duke of Wellington), halts the punishment at just over 200 lashes.  Lawford has been offered an extremely dangerous mission and has requested Sharpe. Sharpe agrees to go along if he is made a sergeant if they are successful.", "* Richard Sharpe – the protagonist; private in the British army serving in India, serving in the 33rd Regiment"]}, {"page": "Sharpe's Triumph", "response": ["Sharpe's Triumph is the second historical novel in the Richard Sharpe series by Bernard Cornwell, first published in 1998. Sharpe is a sergeant in the army who attracts the attention of General Arthur Wellesley at Ahmednuggur.", "Sergeant Richard Sharpe and a small detachment arrive at an isolated East India Company fort to transport 80,000 recovered rounds of stolen ammunition to the armory at Seringapatam.  Whilst Sharpe and his men rest, a company of East India Company sepoys arrive under the command of Lieutenant William Dodd.  Dodd abruptly has his men massacre the unsuspecting, outnumbered garrison.  Sharpe is wounded and feigns death, allowing him to escape Dodd's determination to leave no witnesses.", "* Richard Sharpe – British Army Sergeant, protagonist"]}, {"page": "Sharpe's Fortress", "response": ["Sharpe's Fortress is the third historical novel of the Richard Sharpe series, by Bernard Cornwell, first published in 1998. It is the last of the Sharpe India trilogy. It tells the story of Ensign Sharpe, during the battle of Argaum and the following siege of the Fortress of Gawilghur in 1803.", "In 1803, Arthur Wellesley's British and sepoy army is in pursuit of the Mahrattas in western India, having beaten them in the Battle of Assaye. Ensign Richard Sharpe, newly made an officer, is beginning to wish he had remained a sergeant, as most of his fellow officers look down upon him, including Captain Urquhart, his commanding officer. Urquhart suggests he sell his commission if he is not happy. ", "*Richard Sharpe – an ensign in the British Army"]}, {"page": "Sharpe's Prey", "response": ["Sharpe's Prey is the fifth historical novel in the Richard Sharpe series by Bernard Cornwell, first published in 2001. The story is set in 1807 during the Napoleonic Wars .", "Second Lieutenant Richard Sharpe is sent to Copenhagen in 1807 with the job of protecting a nobleman on a secret mission. Sharpe soon discovers that his task is complicated by traitors, spies and the bombardment of Copenhagen.", "The year is 1807, and Richard Sharpe is at a very low point in his life. His beloved aristocratic lover, Lady Grace Hale, has died in childbirth, along with their newborn son. Her family's lawyers then took all of Sharpe's wealth (loot he obtained fighting in India), claiming it was Grace's and that it now reverts to her family. Destitute and relegated to the menial job of quartermaster, Sharpe is on the streets of London, contemplating leaving the army.", "*Richard Sharpe – Second lieutenant and quartermaster in the 95th Rifles"]}, {"page": "Sharpe's Rifles", "response": ["Sharpe's Rifles is chronologically the sixth, but the ninth published, historical novel in the Richard Sharpe series by Bernard Cornwell, first published in 1988.", "Lieutenant Richard Sharpe is caught up in the French invasion of Galicia, Spain in January 1809.", "*Richard Sharpe – Lieutenant in the 95th Rifles"]}, {"page": "Sharpe's Trafalgar", "response": ["Sharpe's Trafalgar is the fourth historical novel in the Richard Sharpe series by Bernard Cornwell, first published in 2000. It is the first of the novels in the wars against Napoleon, putting the army ensign at the Battle of Trafalgar in 1805.", "In 1805, Richard Sharpe is to sail to England from India aboard the East Indiaman Calliope to join the 95th Rifles. He is swindled after purchasing supplies for the voyage. After finding out, he gets not only his money back, but also helps fellow victim Royal Navy Captain Joel Chase do the same, saving Chase from great financial embarrassment. Chase wants to show his gratitude, but is under orders to destroy a French 74 named the Revenant that is raiding the Indian Ocean. ", "* Richard Sharpe"]}, {"page": "Sharpe's Eagle", "response": ["Sharpe's Eagle is a historical novel in the Richard Sharpe series by Bernard Cornwell, first published in 1981. The story is set in July 1809, in the midst of the Talavera Campaign during the Peninsular War.  It was the first Sharpe novel published, but eighth in the series' chronological order.", "It is July 1809. During the Talavera Campaign, Sir Arthur Wellesley's army has entered Spain to confront Marshal Victor. Richard Sharpe and his small group of thirty riflemen, separated from their regiment during the retreat from Corunna, are attached to the newly arrived South Essex Regiment.  Commanded by the cowardly and bullying Lieutenant Colonel Sir Henry Simmerson, the South Essex is a raw, inexperienced unit that has been drilled mercilessly with frequent use of the lash.", "*Richard Sharpe"]}, {"page": "Nock gun", "response": ["Its bizarre appearance and operation has led to it being portrayed in modern fictional works, notably in The Alamo feature film, and the Richard Sharpe series of novels by Bernard Cornwell.", "In Bernard Cornwell's series of historical novels featuring Richard Sharpe and, more recently, in the Sharpe TV series, Nock guns are used by the character Patrick Harper."]}, {"page": "Sharpe's Gold", "response": ["Sharpe's Gold is the second (though ninth in chronological order) historical novel in the Richard Sharpe series by Bernard Cornwell first published in 1981. The story is set in August 1810 and features the destruction of Almeida during the Peninsular War.", "General Wellington orders Richard Sharpe to find out what happened to Claud Hardy, one of Major Michael Hogan's exploring officers, who was sent to locate Spanish gold thought to be in the (fictional) hamlet of Casatejada, and to retrieve the gold himself through any means necessary, as Wellington's army is in desperate need of funds.", "*Richard Sharpe — Captain in the British army, officer of rifles"]}, {"page": "Sharpe's Battle", "response": ["Sharpe's Battle is the twelfth historical novel in the Richard Sharpe series by Bernard Cornwell, first published in 1995. The story is set during the Peninsular War in Spain in 1811."]}, {"page": "Sharpe's Company", "response": ["Sharpe's Company is a historical novel in the Richard Sharpe series by Bernard Cornwell, first published in 1982. It was the third in the series to be published, but is thirteenth in chronological order. The story is set January to August 1812 featuring the Siege of Badajoz during the Peninsular War."]}, {"page": "The Starbuck Chronicles", "response": ["*Patrick Lassan – A French Cavalry colonel who begins the story as an observer in George McClellan's army but crosses the lines with Nate Starbuck and rides with the Confederate cavalry. He is described as tall and dark haired with a scarred face and an eye patch. He is the son of Richard Sharpe (the star of Bernard Cornwell's Sharpe seriesBernardCornwell.net – Bulletin Board) and carries his father's 1796 Heavy Cavalry Sword.", "In the second book of the Starbuck series, Copperhead, Starbuck encounters Patrick Lassan, Chasseur Colonel of the French Imperial Guard, and French Military Observer attached to the Union Army. The son of an English father and a French mother, he uses his mother's last name – Lassan – because his parents never married. It is ultimately revealed that Lassan is the son of Richard Sharpe. His sword, described as an oversized steel-hilted straight sword, is likely the same 1796 Heavy Cavalry Sword carried by his father throughout the earlier Peninsular War."]}, {"page": "Sharpe's Sword", "response": ["Sharpe's Sword is a historical novel in the Richard Sharpe series by Bernard Cornwell. It is the fourth in the series, being first published in 1983, though the fourteenth chronologically.  Set in the summer of 1812 including the Battle of Salamanca on 22 July 1812, the story follows Sharpe and his friend Sergeant Harper involved in espionage while hunting down the sadistic and highly dangerous Colonel Philippe Leroux.", "*Captain Richard Sharpe – Rifle Captain in the British army, Officer Commanding the Light Company of the South Essex Battalion."]}, {"page": "Sharpe's Fury", "response": ["Sharpe's Fury is the eleventh historical novel in the Richard Sharpe series by Bernard Cornwell, published in 2006. The story is set in 1811 during Wellington's campaign in the Iberian peninsula."]}, {"page": "Sharpe's Waterloo", "response": ["Sharpe's Waterloo is a historical novel in the Richard Sharpe series by Bernard Cornwell.  Originally published in 1990 under the title Waterloo, it is the eleventh and final novel of the \"original\" Sharpe series (beginning with Sharpe's Eagle), and the twentieth novel in chronological order.", "Napoleon having escaped from Elba, Richard Sharpe leaves his farm in Normandy to rejoin the British Army (to safeguard his half pay). He is appointed a lieutenant colonel of a Dutch-Belgian cavalry regiment and hired as one of the Prince of Orange's staff officers. Sharpe's friend Patrick Harper, despite being a civilian who has ostensibly come to Belgium to trade in horses, resumes his old place at Sharpe's side.", "*Richard Sharpe – now a staff officer in the Dutch army"]}, {"page": "Sharpe's Devil", "response": ["Sharpe's Devil is the twenty-second historical novel in the Richard Sharpe series written by Bernard Cornwell and published in 1993. The story is set in 1820, with Sharpe and Harper en route to Chile to find their old friend Blas Vivar. Along the way they encounter the exiled Napoleon Bonaparte and the Scottish former Royal Navy officer Lord Cochrane.", "* Richard Sharpe; former British rifleman who has been called out of retirement on his farm in France to travel to Chile in search of an old friend."]}, {"page": "Sharpe's Christmas", "response": ["\"Sharpe's Christmas\" is a short story by historical fiction author Bernard Cornwell. It features Cornwell's fictional hero Richard Sharpe. It was originally written for the British newspaper The Daily Mail, which serialised it during the 1994 Christmas season. An extended version was published by The Sharpe Appreciation Society in a short story collection of the same name in 2003 to raise funds for The Bernard and Judy Cornwell Foundation.", "\"Sharpe's Christmas\" is set in 1813, towards the end of the Peninsular War and falls after Sharpe's Regiment. Major Richard Sharpe and the Prince of Wales Own Volunteers have to stop the French garrison of the fortress of Ochagavia from escaping back to France. The garrison consists of 300 soldiers, plus their women and children and another 1,000 men from the 75th Line Infantry Regiment, commanded by Colonel Caillou. The garrison is commanded by Colonel Gudin, an old friend of Sharpe's from his days in India. To ensure the garrison's swift escape, Brigadier General Picard is sent with his brigade to the village of Irati in the Pyrenees, along Gudin's escape route. Sharpe fends off Picard's brigade, but allows Colonel Gudin, the women and children and the 75th's Imperial Eagle to escape.   "]}, {"page": "Sharpe's Escape", "response": ["Sharpe's Escape is the twenty-third (tenth in chronological order) historical novel in the Richard Sharpe series by Bernard Cornwell, published in 2004. Sharpe is embroiled in the British retreat through Portugal in 1810 from the defence of the ridge at Bussaco to the Lines of Torres Vedras, where the French offensive is successfully halted.", "Captain Richard Sharpe and his riflemen rejoin the South Essex Regiment during Wellington's retreat in Portugal.  Sharpe is in a foul mood because his promised month of leave in Lisbon (after retrieving the gold in Sharpe's Gold) lasted barely a week, and in an even fouler mood because of Lieutenant Cornelius Slingsby, foisted on Sharpe by the South Essex's commander, Colonel William Lawford, at the insistence of his wife in England (Slingsby's sister-in-law) to advance the latter's career by any means. Lawford, despite knowing Sharpe's ability as a soldier, is seeking to ease Sharpe out and give Slingsby command of the South Essex's Light Company.", "* Captain Richard Sharpe - OC Light Company, South Essex Regiment", "* Sergeant Patrick Harper - sergeant in the British army, close friend and ally to Richard Sharpe"]}, {"page": "Sharpe's Revenge", "response": ["Sharpe's Revenge is the nineteenth historical novel in the Richard Sharpe series written by Bernard Cornwell, first published in 1989. The peace of 1814 formally ends the Peninsular War, but it does not end all hostilities among individuals.", "In 1814, Richard Sharpe and his second wife, Jane, quarrel over Sharpe's imminent duel with Captain Bampfylde, resulting from the latter's cowardice in the previous novel, Sharpe's Siege. Just in case, Sharpe grants her power of attorney over the considerable sum of money he has lodged with his prize agent in London.  Sharpe fights the duel, wounding Bampfylde in the buttocks, and sends Jane to England with instructions to purchase a country home in Dorset, even though she makes it clear she wants to live in London."]}, {"page": "Sharpe's Rifles (TV programme)", "response": ["The drama tells the story of Richard Sharpe, an ambitious and hardened soldier from Yorkshire. The story follows the exploits of Sharpe and his band of chosen men through Spain after they survive an ambush by French cavalry.", "Filming took place in the Crimea,Programme end credits Portugal and England, during which Paul McGann who was the original actor cast for the role of Richard Sharpe, broke his leg and was quickly replaced with Sean Bean.", "In 1809, Sir Arthur Wellesley (David Troughton), the commander of the British army fighting the French in Portugal, is saved from three pursuing French cavalrymen by Sergeant Richard Sharpe (Sean Bean) of the 95th Rifles. Wellesley rewards Sharpe with a field commission to Lieutenant.", "* Sean Bean as Sergeant/Lieutenant Richard Sharpe"]}, {"page": "Sharpe's Eagle (TV programme)", "response": ["In 1809, Sir Arthur Wellesley, commander of the British forces in the Iberian Peninsula, prepares to invade French-controlled Spain. He orders Lieutenant Richard Sharpe and his band of \"chosen men\" to accompany the arrogantly incompetent, newly arrived Sir Henry Simmerson and his South Essex Regiment on a small, but significant mission to destroy a bridge vital to French troop movements. Simmerson, his nephew Lieutenant Gibbons (Neil Dudgeon) and Lieutenant Berry (Daniel Craig) despise Sharpe for his low birth. However, Major Lennox (David Ashton), who knew Sharpe from their days in India, and American-born Captain Leroy (Gavan O'Herlihy) appreciate his military skill and sense of honour.", "* Sean Bean as Richard Sharpe"]}, {"page": "Sharpe's Christmas (short story collection)", "response": ["Sharpe's Christmas, is a short story collection by historical fiction author Bernard Cornwell which he  began conceptualising in 1980s.Sharpe’s Christmas Retrieved 28 July 2013 It contains two stories featuring Cornwell's fictional hero Richard Sharpe. It was published by The Sharpe Appreciation Society Sharpe’s Appreciation Society Retrieved 28 July 2013 in 2003 in order to raise funds for The Bernard and Judy Cornwell Foundation. This novel contains two stories that take place at different times, thus in an interview with the author, the book was left unnumbered in the Sharpe’s series.Timeline of the Sharpe’s books Retrieved 28 July 2013", "Category:Richard Sharpe short stories"]}]}}