{"wiki_id": "http://www.wikidata.org/entity/Q1276720", "itemLabel": "Henry Mackenzie", "itemDescription": "Scottish lawyer and writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Henry_Mackenzie", "wikipedia_page": {"main": "Henry Mackenzie FRSE (August 1745 – 14 January 1831, born and died in Edinburgh) was a Scottish lawyer, novelist and writer, sometimes seen as the Addison of the North. While remembered mostly as an author, his main income came from legal roles, which led in 1804–1831 to a lucrative post as Comptroller of Taxes for Scotland, whose possession allowing him to follow his interest in writing.", "link_mentions": [{"page": "Scottish Enlightenment", "response": ["* Henry Mackenzie (1745–1831) lawyer and writer "]}, {"page": "Joanna Baillie", "response": ["*1810 The Scottish-themed Family Legend, produced at Edinburgh under the patronage of Sir Walter Scott, had a brief though brilliant success. It included a prologue by Scott and an epilogue by Henry Mackenzie. Its success encouraged the theatre managers to revive De Monfort, which was also well received."]}, {"page": "Waverley (novel)", "response": ["Ch. 25 (72) A Postscript, which should have been a Preface: The author ends with a set of comments on the foregoing work and a dedication to Henry Mackenzie."]}, {"page": "1831 in literature", "response": ["*January 14 – Henry Mackenzie, Scottish novelist (born 1745)"]}, {"page": "Samuel Rogers", "response": ["In 1788 his elder brother Thomas died, and Samuel's business responsibilities were increased. In the next year he paid a visit to Scotland, where he met Adam Smith, Henry Mackenzie, Hester Thrale and others. In 1791 he was in Paris, and enjoyed the Orleans Collection of art at the Palais Royal, many of the treasures of which were later to pass into his possession. With Gray as his model, Rogers took great pains in polishing his verses, and six years elapsed after the publication of his first volume before he printed his elaborate poem on The Pleasures of Memory (1792) – regarded by some as the last embodiment of the poetic diction of the 18th century. The theory of elevating and refining familiar themes by abstract treatment and lofty imagery is taken to extremes. In this art of \"raising a subject\", as the 18th century phrase was, the Pleasures of Memory is much more perfect than Thomas Campbell's Pleasures of Hope, published a few years later in imitation. Byron said of it, \"There is not a vulgar line in the poem.\""]}, {"page": "Henry Raeburn", "response": ["Examples of his earlier portraiture include a bust of Mrs Johnstone of Baldovie and a three-quarter-length of Dr James Hutton: works which, if somewhat timid and tentative in handling and not as confident as his later work, nevertheless have delicacy and character. The portraits of John Clerk, Lord Eldin, and of Principal Hill of St Andrews belong to a later period. Raeburn was fortunate in the time in which he practised portraiture. Sir Walter Scott, Hugh Blair, Henry Mackenzie, Lord Woodhouselee, William Robertson, John Home, Robert Fergusson, and Dugald Stewart were resident in Edinburgh, and were all painted by Raeburn. Mature works include his own portrait and that of the Rev. Sir Henry Moncrieff Wellwood, a bust of Dr Wardrop of Torbane Hill, two full-lengths of Adam Rolland of Gask, the remarkable paintings of Lord Newton and Dr Alexander Adam in the National Gallery of Scotland, and that of William Macdonald of St Martin's. Apart from himself, Raeburn painted only two artists, one of whom was Sir Francis Leggatt Chantrey, the most important and famous British sculptor of the first half of the 19th century. It has recently been revealed that Raeburn and Chantrey were close friends and that Raeburn took exceptional care over the execution of his portrait of the sculptor, one of the painter's mature bust-length masterpieces.David Wilson, '‘Chantrey's solar face': An intriguing mystery about Raeburn's portraits of a great sculptor', The British Art Journal, Vol. XIV, No. 3 [2013/14], pp. 45–57.  ", "*Henry Mackenzie"]}, {"page": "1745 in literature", "response": ["*July 26 – Henry Mackenzie, Scottish novelist, writer and poet (died 1831)"]}, {"page": "1771 in literature", "response": ["**Henry Mackenzie's The Man of Feeling inaugurates the fashion for sentimentalism in novels.", "*Henry Mackenzie – The Man of Feeling"]}, {"page": "1773 in literature", "response": ["*Henry Mackenzie – The Man of the World", "*Henry Mackenzie – The Prince of Tunis"]}, {"page": "1777 in literature", "response": ["*Henry Mackenzie – Julia de Roubigne"]}, {"page": "1781 in literature", "response": ["*Henry Mackenzie – Julia de Roubignei"]}, {"page": "John Home", "response": ["The Works of John Home were collected and published by Henry Mackenzie in 1822 with \"An Account of the Life and Writings of Mr John House,\" which also appeared separately in the same year, but several of his smaller poems seem to have escaped the editor's observation. These are: \"The Fate of Caesar\", \"Verses upon Inveraray\", \"Epistle to the Earl of Eglintoun\", \"Prologue on the Birthday of the Prince of Wales, 1759\" and several \"Epigrams\", which are printed in vol. ii. of Original Poems by Scottish Gentlemen (1762). See also Sir W Scott, \"The Life and Works of John Home\" in the Quarterly Review (June 1827). Douglas is included in numerous collections of British drama. Voltaire published his Le Gaffe, ou l'Ecossaise (1760), Londres (really Geneva), as a translation from the work of Hume, described as pasteur de l'église d'Edimbourg, but Home seems to have taken no notice of the mystification."]}, {"page": "The Mirror", "response": ["* The Mirror (1779–1780), a short lived literary magazine by Henry Mackenzie"]}, {"page": "Susan Edmonstone Ferrier", "response": ["Ferrier was privately educated. Through her family she came to know many notable Edinburgh people, including Scott and the novelist Henry Mackenzie. In 1797 her father took her in 1797 to Inveraray, home of his client and patron John Campbell, 5th Duke of Argyll. She became a friend of the family, especially of a granddaughter, Charlotte Clavering (died 1869), with whom she corresponded. Clavering was initially involved in the writing of Ferrier's first novel Marriage, although ultimately her contribution was limited to the section entitled \"The History of Mrs Douglas\".Elspeth Yeo's ODNB entry: Retrieved 2 May 2012. Subscription required Some letters between Ferrier and Clavering appear in the front matter of a six-volume edition of the novels.R. Brimley Johnson (ed.): Marriage (London: J. M. Dent & Co., 1894), Vol. I, pp. xxv–xlv."]}, {"page": "Augustan literature", "response": ["The sentimental novel, or \"novel of sentiment\", developed after 1740, and among the most famous examples in English are Samuel Richardson's Pamela, or Virtue Rewarded (1740), Oliver Goldsmith's Vicar of Wakefield (1766), Laurence Sterne's Tristram Shandy (1759–67), Sentimental Journey (1768), Henry Brooke's The Fool of Quality (1765–70), Henry Mackenzie's The Man of Feeling (1771) and Maria Edgeworth's Castle Rackrent (1800). Continental examples are Jean-Jacques Rousseau's novel Julie, or the New Heloise, his autobiography The Confessions (1764–70) and Goethe's novel The Sorrows of Young Werther (1774).J. A. Cuddon, The Penguin Dictionary of Literary Terms and Literary Theory, 4th edition (London: Penguin Books, 1999), p.809; M. H. Abrams, A Glossary of Literary Terms, 7th edition (Fort Worth: Harcourt Brace,1999), p.283."]}, {"page": "Augustan prose", "response": ["Henry Fielding's sister, Sarah Fielding, was also a novelist.  Her David Simple (1744) outsold Joseph Andrews and was popular enough to require sequels.  Like her brother, Sarah propounds a theory of good nature.  David Simple is, as his name suggests, an innocent.  He is possessed of a benevolent disposition and a desire to please, and the pressures and contradictory impulses of society complicate the plot.  On the one hand, this novel emphasizes the role of society, but, on the other, it is a novel that sets up the sentimental novel.  The genuine compassion and desire for goodness of David Simple were affecting for contemporary audiences, David Simple is a forerunner of the heroes of later novels such as Henry Mackenzie's The Man of Feeling (1771)."]}, {"page": "Alison Cockburn", "response": ["At her house on Castlehill, and afterwards in Crichton Street, she received many illustrious friends, among whom were Henry Mackenzie, William Robertson, David Hume, John Home, Lord Monboddo,Betteridge, R. & McLean, R. (2019), Northern Lights: The Scottish Enlightenment, National Library of Scotland, p. 10 the Keiths of Ravelston, the Balcarres family and Lady Anne Barnard, the author of \"Auld Robin Gray.\" As a Rutherfurd she had a connexion with Sir Walter Scott's mother, and was her intimate friend. Lockhart quotes a letter written by Mrs Cockburn in 1777, describing the conduct of little Walter Scott, then scarcely six years old, during a visit which she paid to his mother, when the child gave as a reason for his liking for Mrs Cockburn that she was a \"virtuoso like himself.\""]}, {"page": "Colvin Smith", "response": ["Returning to Scotland in 1827, he settled in Edinburgh, occupying the house and studio which had formerly belonged to the Scottish painter Raeburn at 32 York Place. Soon he attained a wide practice as a portrait-painter, and among his sitters were Lord Jeffrey, Henry Mackenzie, author of The Man of Feeling, and many of the most celebrated Scotsmen of the time."]}, {"page": "Sensibility", "response": ["The effusive nature of many sentimental heroes, such as Harley in Henry Mackenzie's 1771 novel The Man of Feeling, was often decried by contemporary critics as celebrating a weak, effeminate character, which ultimately contributed to a discrediting of previously popular sentimental novels (and to a lesser extent, all novels) as unmanly works. This concern coincided with a marked rise in the production of novels by women writers of the period, whether they chose to write in a sentimental mode or not, and played a significant role in larger debates about gender, genre, literary value, and nationalist political aims during the last decade of the eighteenth century and the first decades of the nineteenth, when the \"National Tale\" concept emerged in the wake of the French Revolutionary Wars and the union of Great Britain and Ireland."]}, {"page": "Colinton", "response": ["* Henry Mackenzie – Scottish novelist (note- the tiny cottage known as \"Henry Mackenzie's cottage\" seems unlikely for his social standing, and his only link to this area is during is apprenticeship as a lawyer, to George Inglis of Redhall House, when aged 14, however, as an apprentice his link would have been to Inglis' office in Edinburgh, not his house in Redhall)"]}, {"page": "Man of Feeling", "response": ["#REDIRECT Henry Mackenzie#Biography."]}, {"page": "Marie Jeanne Riccoboni", "response": ["Madame Riccoboni's work is among the most eminent examples of the \"sensibility\" novel; among the parallels cited in English literature are works by Laurence Sterne and Samuel Richardson. A still nearer parallel may be found in the work of Henry Mackenzie. Her works were also described as \"letter novel\" containing the negotiations of femininity, desire, and ambition. She has influenced other writers, including Pierre Choderlos de Laclos and his literary aesthetics."]}, {"page": "Addison of the North", "response": ["#REDIRECT Henry Mackenzie"]}, {"page": "Sentimental novel", "response": ["Among the most famous sentimental novels in English are Samuel Richardson's Pamela, or Virtue Rewarded (1740), Oliver Goldsmith's Vicar of Wakefield (1766), Laurence Sterne's Tristram Shandy (1759–67), Sentimental Journey (1768), Henry Brooke's The Fool of Quality (1765–70), Henry Mackenzie's The Man of Feeling (1771) and Maria Edgeworth's Castle Rackrent (1800). Continental examples are Jean-Jacques Rousseau's novel Julie, or the New Heloise, his autobiography The Confessions (1764–70) and Goethe's  novel The Sorrows of Young Werther (1774).J. A. Cuddon, The Penguin Dictionary of Literary Terms and Literary Theory, 4th edition (London: Penguin Books, 1999), p.809; M. H. Abrams, A Glossary of Literary Terms, 7th edition (Fort Worth: Harcourt Brace,1999), p.283. Tobias Smollett tried to imply a darker underside to the \"cult of sensibility\" in his The Expedition of Humphry Clinker (1771). Another example of this type of novel is Frances Burney's Evelina (1778), wherein the heroine, while naturally good, in part for being country-raised, hones her politeness when, while visiting London, she is educated into propriety. This novel also is the beginning of \"romantic comedy\", though it is most appropriately labeled a conduct novel and a forerunner of the female Bildungsroman in the English tradition exemplified by later writers such as Jane Austen, Charlotte Brontë, and George Eliot.Laura Sue Fuderer, The Female Bildungsroman in English: An Annotated Bibliography of Criticism (1990)"]}, {"page": "The Man of Feeling", "response": ["The Man of Feeling is a sentimental novel published in 1771, written by Scottish author Henry Mackenzie. The novel presents a series of moral vignettes which the naïve protagonist Harley either observes, is told about, or participates in. This novel is often seen to contain elements of the Romantic novel, which became prolific in the years following its publishing."]}, {"page": "Lasswade", "response": ["*right bank: Eldin (residence of John Clerk, F.R.S. (1736-1812), inventor of the naval tactic of breaking the enemy's line), Polton, Springfield, Glenesk, Hawthornden, Gorton, and Auchendinny (residence of Henry Mackenzie, the author of The Man of Feeling)"]}, {"page": "History of the Jews in Scotland", "response": ["The late-18th-century author Henry Mackenzie speculated that the high incidence of biblical place names around the village of Morningside near Edinburgh might indicate that Jews had settled in the area during the Middle Ages. This belief has, however, been shown to be incorrect, with the names originating instead from the presence of a local farm named \"Egypt\" mentioned in historical documents from the 16th century and believed to indicate a Romani presence.C J Smith, Historic South Edinburgh, Edinburgh & London 1978, p.205  \"At the distance of less than a mile from Edinburgh there are places with Jewish names—Canaan, the river or brook called Jordan, Egypt—a place called Transylvania, a little to the east of Egypt. There are two traditions of the way in which they got their names: one, that there was a considerable eruption of gypsies into the county of Edinburgh who got a grant of these lands, then chiefly a moor; the other, which I have heard from rather better authority, that some rich Jews happened to migrate into Scotland and got from one of the Kings (James I, I think it was said) a grant of these lands in consideration of a sum of money which they advanced him.\""]}, {"page": "The Speculative Society", "response": ["The founding group, in November 1764, consisted of John Bonar, the younger, John Bruce, William Creech, Henry Mackenzie, and a Mr Belches of Invermay. They were encouraged by William Robertson."]}, {"page": "Literary Taste: How to Form It", "response": ["* Henry Mackenzie: The Man of Feeling"]}, {"page": "Lewis Grant-Ogilvy, 5th Earl of Seafield", "response": ["His uncles included Henry Mackenzie and Alexander Penrose Cumming-Gordon."]}, {"page": "Sir James Grant, 8th Baronet", "response": ["His sister, Penuel Grant, married the Scottish author, Henry Mackenzie."]}, {"page": "1831 in poetry", "response": ["* January 14 – Henry Mackenzie (born 1745), Scottish novelist, writer, critic and poet"]}, {"page": "1771 in Great Britain", "response": ["* Henry Mackenzie's novel The Man of Feeling."]}, {"page": "1771 in poetry", "response": ["* Henry Mackenzie, Pursuits of Happiness, published anonymously after a stay in London; Scottish\"Henry Mackenzie\", reprint from an article by William Anderson, in Scottish Nation (1859-66), 3:23-25, retrieved 2009-06-28."]}, {"page": "1745 in poetry", "response": ["* July 26 – Henry Mackenzie (died 1831), Scottish novelist, writer and poet"]}, {"page": "William Bannatyne, Lord Bannatyne", "response": ["Among his intimate friends were Henry Mackenzie, Robert Cullen, William Craig, Hugh Blair, Erskine and Alexander Abercromby. He was a member of the Mirror Club and Lounger Club, at the end of the eighteenth century."]}, {"page": "Alexander Dirom", "response": ["In 1795 he was elected a Fellow Royal Society and in 1796 a Fellow of the Royal Society of Edinburgh. His proposers for the latter were Henry Mackenzie, John Playfair, and James Finlayson."]}, {"page": "Critical approaches to Hamlet", "response": ["Henry Mackenzie notes the tradition of seeing Hamlet as the most varied of Shakespeare's creations: \"With the strongest purposes of revenge he is irresolute and inactive; amidst the gloom of the deepest melancholy he is gay and jocular; and while he is described as a passionate lover he seems indifferent about the object of his affections.\" Like Richardson, Mackenzie concludes that the tragedy in the play arises from Hamlet's nature: even the best qualities of his character merely reinforce his inability to cope with the world in which he is placed. To this analysis Thomas Robertson adds in particular the devastating impact of the death of Hamlet's father."]}]}}