{"wiki_id": "http://www.wikidata.org/entity/Q127332", "itemLabel": "Charlotte Brontë", "itemDescription": "English novelist and poet", "wikipedia_url": "https://en.wikipedia.org/wiki/Charlotte_Bront%C3%AB", "wikipedia_page": {"main": "Charlotte Brontë (, commonly ; 21 April 1816 – 31 March 1855) was an English novelist and poet, the eldest of the three Brontë sisters who survived into adulthood and whose novels became classics of English literature.\nShe enlisted in school at Roe Head in January 1831, aged 14 years. She left the year after to teach her sisters, Emily and Anne, at home, returning in 1835 as a governess. In 1839 she undertook the role as governess for the Sidgwick family but left after a few months to return to Haworth where the sisters opened a school, but failed to attract pupils. Instead, they turned to writing and they each first published in 1846 under the pseudonyms of Currer, Ellis, and Acton Bell. Although her first novel, The Professor, was rejected by publishers, her second novel, Jane Eyre, was published in 1847. The sisters admitted to their Bell pseudonyms in 1848, and by the following year were celebrated in London literary circles.\nCharlotte Brontë was the last to die of all her siblings. She became pregnant shortly after her marriage in June 1854 but died on 31 March 1855, almost certainly from hyperemesis gravidarum, a complication of pregnancy which causes excessive nausea and vomiting.", "link_mentions": [{"page": "Anne Brontë", "response": ["Emily's death deeply affected Anne. Her grief undermined her physical health.Gaskell EC. The Life of Charlotte Brontë: author of 'Jane Eyre,' 'Shirley,' 'Villette,' 'The Professor,' etc., Elder Smith, 1896, p. 287 read online or download Over Christmas Anne had influenza. Her symptoms intensified and in early January her father sent for a Leeds physician. The doctor diagnosed advanced consumption with little hope of recovery. Anne met the news with characteristic determination and self-control.", "* Fraser, Rebeca, The Brontës: Charlotte Brontë and her family, Crown Publishers, 1988, "]}, {"page": "Autobiography", "response": ["The term \"fictional autobiography\" signifies novels about a fictional character written as though the character were writing their own autobiography, meaning that the character is the first-person narrator and that the novel addresses both internal and external experiences of the character. Daniel Defoe's Moll Flanders is an early example. Charles Dickens' David Copperfield is another such classic, and J.D. Salinger's The Catcher in the Rye is a well-known modern example of fictional autobiography. Charlotte Brontë's Jane Eyre is yet another example of fictional autobiography, as noted on the front page of the original version. The term may also apply to works of fiction purporting to be autobiographies of real characters, e.g., Robert Nye's Memoirs of Lord Byron."]}, {"page": "April 21", "response": ["*1816 – Charlotte Brontë, English novelist and poet (d. 1855)"]}, {"page": "Abigail", "response": ["Abigail's self-styling as a handmaid and following led to Abigail being a traditional term for a waiting-woman, for example as the waiting gentlewoman in Beaumont and Fletcher's The Scornful Lady, published in 1616. Jonathan Swift and Henry Fielding use Abigail in this generic sense, as does Charlotte Brontë. Anthony Trollope makes two references to the abigail (all lower case) in The Eustace Diamonds, at the beginning of Chapter 42, whilst Thomas Mann makes the same reference at the start of the second chapter of Part 2 in Buddenbrooks (published in 1901). William Rose Benet notes the notoriety of Abigail Hill, better known as \"Mrs Masham\", a lady-in-waiting to Queen Anne.The Reader's Encyclopedia, 1948, s.v. \"Abigail\". George MacDonald Fraser makes mention of \"an abigail fussing about the room\" in his novel Flashman from The Flashman Papers series."]}, {"page": "Bildungsroman", "response": ["* Jane Eyre, by Charlotte Brontë (1847)"]}, {"page": "List of English-language poets", "response": ["*Charlotte Brontë (1816–1855, E)"]}, {"page": "Emily Brontë", "response": ["At seventeen, Emily began to attend the Roe Head Girls' School, where Charlotte was a teacher, but suffered from extreme homesickness and left after only a few months. Charlotte wrote later that \"Liberty was the breath of Emily's nostrils; without it, she perished. The change from her own home to a school and from her own very noiseless, very secluded but unrestricted and unartificial mode of life, to one of disciplined routine (though under the kindest auspices), was what she failed in enduring... I felt in my heart she would die if she did not go home, and with this conviction obtained her recall.\"Gaskell, The  Life of Charlotte Brontë, p. 149 Emily returned home and Anne took her place.Fraser, The Brontës, p. 84 At this time, the girls' objective was to obtain sufficient education to open a small school of their own.", "In 1846, the sisters' poems were published in one volume as Poems by Currer, Ellis, and Acton Bell. The Brontë sisters had adopted pseudonyms for publication, preserving their initials: Charlotte was \"Currer Bell\", Emily was \"Ellis Bell\" and Anne was \"Acton Bell\".Encyclopedia of British writers, 19th century (2009), p. 41 Charlotte wrote in the 'Biographical Notice of Ellis and Acton Bell' that their \"ambiguous choice\" was \"dictated by a sort of conscientious scruple at assuming Christian names positively masculine, while we did not like to declare ourselves women, because... we had a vague impression that authoresses are liable to be looked on with prejudice\".Gaskell, The life of Charlotte Brontë (1857), p. 335 Charlotte contributed 19 poems, and Emily and Anne each contributed 21. Although the sisters were told several months after publication that only two copies had sold,Winifred Gérin, Charlotte Brontë: the evolution of genius (1969), p. 322 they were not discouraged (of their two readers, one was impressed enough to request their autographs).Margot Peters, Unquiet Soul: A Biography of Charlotte Brontë (1976), p. 219 The Athenaeum reviewer praised Ellis Bell's work for its music and power, singling out his poems as the best: \"Ellis possesses a fine, quaint spirit and an evident power of wing that may reach heights not here attempted\",In the footsteps of the Brontës (1895), p. 306 and The Critic reviewer recognised \"the presence of more genius than it was supposed this utilitarian age had devoted to the loftier exercises of the intellect.\"The poems of Emily Jane Brontë and Anne Brontë (1932), p. 102", "Charlotte Brontë remains the primary source of information about Emily, although as an elder sister, writing publicly about her only shortly after her death, she is considered by certain scholars not to be a neutral witness. Stevie Davies believes that there is what might be called Charlotte's smoke-screen and argues that Emily evidently shocked her, to the point where she may even have doubted her sister's sanity. After Emily's death, Charlotte rewrote her character, history and even poems on a more acceptable (to her and the bourgeois reading public) model. Biographer Claire O'Callaghan suggests that the trajectory of Brontë's legacy was altered significantly by Elizabeth Gaskell’s biography of Charlotte, concerning not only because Gaskell did not visit Haworth until after Emily’s death, but also because Gaskell admits to disliking what she did know of Emily in her biography of Charlotte. As O'Callaghan and others have noted, Charlotte was Gaskell's primary source of information on Emily's life and may have exaggerated or fabricated Emily’s frailty and shyness to cast herself in the role of maternal saviour.", "My sister's disposition was not naturally gregarious; circumstances favoured and fostered her tendency to seclusion; except to go to church or take a walk on the hills, she rarely crossed the threshold of home. Though her feeling for the people round was benevolent, intercourse with them she never sought; nor, with very few exceptions, ever experienced. And yet she knew them: knew their ways, their language, their family histories; she could hear of them with interest, and talk of them with detail, minute, graphic, and accurate; but WITH them, she rarely exchanged a word.Editor's Preface to the Second Edition of Wuthering Heights, by Charlotte Brontë, 1850.", "Wuthering Heightss violence and passion led the Victorian public and many early reviewers to think that it had been written by a man.Carter, McRae, The Routledge History of Literature in English: Britain and Ireland (2001), p. 240 According to Juliet Gardiner, \"the vivid sexual passion and power of its language and imagery impressed, bewildered and appalled reviewers.\"Juliet Gardiner, The History today who's who in British history (2000), p. 109 Literary critic Thomas Joudrey further contextualizes this reaction: \"Expecting in the wake of Charlotte Brontë's Jane Eyre to be swept up in an earnest Bildungsroman, they were instead shocked and confounded by a tale of unchecked primal passions, replete with savage cruelty and outright barbarism.\"Joudrey, Thomas J. \"'Well, we must be for ourselves in the long run': Selfishness and Sociality in Wuthering Heights.\" Nineteenth-Century Literature 70.2 (2015): 165. Even though the novel received mixed reviews when it first came out, and was often condemned for its portrayal of amoral passion, the book subsequently became an English literary classic.Wuthering Heights, Mobi Classics (2009) Emily Brontë never knew the extent of fame she achieved with her only novel, as she died a year after its publication, aged 30.", "Although a letter from her publisher indicates that Emily had begun to write a second novel, the manuscript has never been found. Perhaps Emily or a member of her family eventually destroyed the manuscript, if it existed, when she was prevented by illness from completing it. It has also been suggested that, though less likely, the letter could have been intended for Anne Brontë, who was already writing The Tenant of Wildfell Hall, her second novel.The letters of Charlotte Brontë (1995), edited by Margaret Smith, Volume Two 1848–1851, p. 27", "Emily's health was probably weakened by the harsh local climate and by unsanitary conditions at home,Gaskell, The  Life of Charlotte Brontë, pp. 47–48  where water was contaminated by run off from the church's graveyard. Branwell died suddenly, on Sunday, 24 September 1848. At his funeral service, a week later, Emily caught a severe cold which quickly developed into inflammation of the lungs and led to tuberculosis.Benvenuto, Emily Brontë, p. 24 Though her condition worsened steadily, she rejected medical help and all offered remedies, saying that she would have \"no poisoning doctor\" near her.Fraser, \"Charlotte Brontë: A Writer's Life\", 316 On the morning of 19 December 1848, Charlotte, fearing for her sister, wrote:", "She grows daily weaker. The physician's opinion was expressed too obscurely to be of use – he sent some medicine which she would not take. Moments so dark as these I have never known – I pray for God's support to us all.Gaskell, The  Life of Charlotte Brontë, pp. 67", "At noon, Emily was worse; she could only whisper in gasps. With her last audible words she said to Charlotte, \"If you will send for a doctor, I will see him now\",Gaskell, The  Life of Charlotte Brontë, pp. 68 but it was too late. She died that same day at about two in the afternoon. According to Mary Robinson, an early biographer of Emily, it happened while she was sitting on the sofa.Robinson, Emily Brontë, p. 308 However, Charlotte's letter to William Smith Williams where she mentions Emily's dog, Keeper, lying at the side of her dying-bed, makes this statement seem unlikely.Barker, The Brontës, p. 576", "In the 2019 film How to Build a Girl, Emily and Charlotte Brontë are among the historical figures in Johanna's wall collage.How to Build a Girl screenplay retrieved June 2, 2021"]}, {"page": "George Orwell", "response": ["During this time, he was distracted by concerns about style and possible libel in Keep the Aspidistra Flying. He made a quick visit to Liverpool and during March, stayed in south Yorkshire, spending time in Sheffield and Barnsley. As well as visiting mines, including Grimethorpe, and observing social conditions, he attended meetings of the Communist Party and of Oswald Mosley (\"his speech the usual claptrap—The blame for everything was put upon mysterious international gangs of Jews\") where he saw the tactics of the Blackshirts (\"...one is liable to get both a hammering and a fine for asking a question which Mosley finds it difficult to answer.\").A Kind of Compulsion, p. 457 He also made visits to his sister at Headingley, during which he visited the Brontë Parsonage at Haworth, where he was \"chiefly impressed by a pair of Charlotte Brontë's cloth-topped boots, very small, with square toes and lacing up at the sides.\"A Kind of Compulsion, p. 450. The Road to Wigan Pier Diary"]}, {"page": "Gothic fiction", "response": ["Emily Brontë's Wuthering Heights (1847) transports the Gothic to the forbidding Yorkshire Moors and features ghostly apparitions and a Byronic hero in the person of the demonic Heathcliff. The Brontës' fictions were cited by feminist critic Ellen Moers as prime examples of Female Gothic, exploring woman's entrapment within domestic space and subjection to patriarchal authority and the transgressive and dangerous attempts to subvert and escape such restriction. Emily's Cathy and Charlotte Brontë's Jane Eyre are examples of female protagonists in such roles.Jackson (1981) pp. 123–129. Louisa May Alcott's Gothic potboiler, A Long Fatal Love Chase (written in 1866, but published in 1995) is also an interesting specimen of this subgenre.", "The Romantic strand of Gothic was taken up in Daphne du Maurier's Rebecca (1938), which is seen by some to have been influenced by Charlotte Brontë's Jane Eyre.Yardley, Jonathan (16 March 2004). \"Du Maurier's 'Rebecca,' A Worthy 'Eyre' Apparent\". The Washington Post. Other books by Du Maurier such as Jamaica Inn (1936) also display Gothic tendencies. Du Maurier's work inspired a substantial body of \"female Gothics\", concerning heroines alternately swooning over or being terrified by scowling Byronic men in possession of acres of prime real estate and the appertaining droit du seigneur.", "From the castles, dungeons, forests and hidden passages of the Gothic novel genre emerged female Gothic. Guided by the works of authors such as Ann Radcliffe, Mary Shelley and Charlotte Brontë, the female Gothic allowed female societal and sexual desires to be introduced."]}, {"page": "Jane Austen", "response": ["In response, Henry James decried \"a beguiled infatuation\" with Austen, a rising tide of public interest that exceeded Austen's \"intrinsic merit and interest\".Southam (1987), 46–47, 230 (for the quote from James); Johnson (2014), 234. The American literary critic A. Walton Litz noted that the \"anti-Janites\" in the 19th and 20th centuries comprised a formidable literary squad of Mark Twain, Henry James, Charlotte Brontë, D. H. Lawrence and Kingsley Amis, but in \"every case the adverse judgement merely reveals the special limitations or eccentricities of the critic, leaving Jane Austen relatively untouched\".Litz, A. Walton \"Recollecting Jane Austen\" pp. 669–682 from Critical Inquiry, Vol. 1, No. 3, March 1975 p. 670."]}, {"page": "Künstlerroman", "response": ["*1847 Charlotte Brontë's Jane Eyre"]}, {"page": "Lesbian", "response": ["Gradually, women began to author their own thoughts and literary works about lesbian relationships. Until the publication of The Well of Loneliness, most major works involving lesbianism were penned by men. Foster suggests that women would have encountered suspicion about their own lives had they used same-sex love as a topic, and that some writers including Louise Labé, Charlotte Charke, and Margaret Fuller either changed the pronouns in their literary works to male, or made them ambiguous.Foster, pp. 116–127. Author George Sand was portrayed as a character in several works in the 19th century; writer Mario Praz credited the popularity of lesbianism as a theme to Sand's appearance in Paris society in the 1830s.Faderman (1981), p. 263. Charlotte Brontë's Villette in 1853 initiated a genre of boarding school stories with homoerotic themes.Castle, p. 429."]}, {"page": "Louisa May Alcott", "response": ["In 1847, she and her family served as station masters on the Underground Railroad, when they housed a fugitive slave for one week and had discussions with Frederick Douglass. Alcott read and admired the \"Declaration of Sentiments\" published by the Seneca Falls Convention on women's rights, advocating for women's suffrage, and became the first woman to register to vote in Concord, Massachusetts in a school board election. The 1850s were hard times for the Alcotts, and in 1854 Louisa found solace at the Boston Theatre, where she wrote The Rival Prima Donnas, which she later burned due to a quarrel between the actresses on who would play what role. At one point in 1857, unable to find work and filled with despair, Alcott contemplated suicide. During that year, she read Elizabeth Gaskell's biography of Charlotte Brontë and found many parallels to her own life. In 1858, her younger sister Elizabeth died and her older sister Anna married a man named John Pratt. This felt to Alcott like a breaking up of their sisterhood."]}, {"page": "Manchester", "response": ["Charles Dickens is reputed to have set his novel Hard Times in the city, and though partly modelled on Preston, it shows the influence of his friend Mrs Gaskell. Gaskell penned all her novels but Mary Barton at her home in 84 Plymouth Grove. Often her house played host to influential authors: Dickens, Charlotte Brontë, Harriet Beecher Stowe and Charles Eliot Norton, for example. It is now open as a literary museum.", "Charlotte Brontë began writing her novel Jane Eyre in 1846, while staying at lodgings in Hulme. She was accompanying her father Patrick, who was convalescing in the city after cataract surgery. She probably envisioned Manchester Cathedral churchyard as the burial place for Jane's parents and the birthplace of Jane herself.Alexander, Christine, and Sara L. Pearson. Celebrating Charlotte Brontë: Transforming Life into Literature in Jane Eyre. Brontë Society, 2016, p. 173. Also associated with the city is the Victorian poet and novelist Isabella Banks, famed for her 1876 novel The Manchester Man. Anglo-American author Frances Hodgson Burnett was born in the city's Cheetham Hill district in 1849, and wrote much of her classic children's novel The Secret Garden while visiting nearby Salford's Buile Hill Park."]}, {"page": "March 31", "response": ["*1855 – Charlotte Brontë, English novelist and poet (b. 1816)"]}, {"page": "Punch (magazine)", "response": ["Increasing in readership and popularity throughout the remainder of the 1840s and '50s, Punch was the success story of a threepenny weekly paper that had become one of the most talked-about and enjoyed periodicals. Punch enjoyed an audience including Elizabeth Barrett, Robert Browning, Thomas Carlyle, Edward FitzGerald, Charlotte Brontë, Queen Victoria, Prince Albert, Ralph Waldo Emerson, Emily Dickinson, Herman Melville, Henry Wadsworth Longfellow, and James Russell Lowell. Punch gave several phrases to the English language, including The Crystal Palace, and the \"Curate's egg\" (first seen in an 1895 cartoon by George du Maurier). Several British humour classics were first serialised in Punch, such as the Diary of a Nobody and 1066 and All That. Towards the end of the 19th century, the artistic roster included Harry Furniss, Linley Sambourne, Francis Carruthers Gould, and Phil May.Punch, or the London Charivari (1841–1992) — A British Institution, Philip V. Allingham; Contributing Editor, Victorian Web; Faculty of Education, Lakehead University, Thunder Bay, Ontario. Among the outstanding cartoonists of the following century were Bernard Partridge, H. M. Bateman, Bernard Hollowood (who also edited the magazine from 1957 to 1968), Kenneth Mahood, and Norman Thelwell."]}, {"page": "Pride and Prejudice", "response": ["Charlotte Brontë, however, in a letter to Lewes, wrote that Pride and Prejudice was a disappointment, \"a carefully fenced, highly cultivated garden, with neat borders and delicate flowers; but ... no open country, no fresh air, no blue hill, no bonny beck\"."]}, {"page": "Sheridan Le Fanu", "response": ["* \"A Chapter in the History of a Tyrone Family\" (1839), which may have influenced Charlotte Brontë's Jane Eyre. This story was later reworked and expanded by Le Fanu as The Wyvern Mystery (1869)."]}, {"page": "Tuberculosis", "response": ["Tuberculosis was for centuries associated with poetic and artistic qualities among those infected, and was also known as \"the romantic disease\". Major artistic figures such as the poets John Keats, Percy Bysshe Shelley, and Edgar Allan Poe, the composer Frédéric Chopin, the playwright Anton Chekhov, the novelists Franz Kafka, Katherine Mansfield, Charlotte Brontë, Fyodor Dostoevsky, Thomas Mann, W. Somerset Maugham, George Orwell, and Robert Louis Stevenson, and the artists Alice Neel, Jean-Antoine Watteau, Elizabeth Siddal, Marie Bashkirtseff, Edvard Munch, Aubrey Beardsley and Amedeo Modigliani either had the disease or were surrounded by people who did. A widespread belief was that tuberculosis assisted artistic talent. Physical mechanisms proposed for this effect included the slight fever and toxaemia that it caused, allegedly helping them to see life more clearly and to act decisively."]}, {"page": "1840s", "response": ["* October 16, 1847 – Charlotte Brontë publishes Jane Eyre under the pen name of Currer Bell."]}, {"page": "1850s", "response": ["*Charlotte Brontë publishes Villette in 1853"]}, {"page": "1847", "response": ["* October 19 – Charlotte Brontë publishes Jane Eyre under the pen name of Currer Bell in England."]}, {"page": "1855", "response": ["* March 31 – Charlotte Brontë, English author (b. 1816)"]}, {"page": "1816", "response": ["* April 21 – Charlotte Brontë, English novelist, poet (d. 1855)"]}, {"page": "Yorkshire", "response": ["Although the first Professor of English Literature at Leeds University, F.W. Moorman, claimed the first extant work of English literature, Beowulf, was written in Yorkshire, this view does not have common acceptance today. However, when Yorkshire formed the southern part of the kingdom of Northumbria there were several notable poets, scholars and ecclesiastics, including Alcuin, Cædmon and Wilfrid. The most esteemed literary family from the county are the three Brontë sisters, with part of the county around Haworth being nicknamed Brontë Country in their honour. Their novels, written in the mid-19th century, caused a sensation when they were first published, yet were subsequently accepted into the canon of great English literature. Among the most celebrated novels written by the sisters are Anne Brontë's The Tenant of Wildfell Hall, Charlotte Brontë's Jane Eyre and Emily Brontë's Wuthering Heights.  Wuthering Heights was almost a source used to depict life in Yorkshire, illustrating the type of people that reside there in its characters, and emphasising the use of the stormy Yorkshire moors.  Nowadays, the parsonage which was their former home is now a museum in their honour. Bram Stoker authored Dracula while living in Whitby and it includes several elements of local folklore including the beaching of the Russian ship Dmitri, which became the basis of Demeter in the book."]}, {"page": "William Makepeace Thackeray", "response": ["Charlotte Brontë dedicated the second edition of Jane Eyre to Thackeray."]}, {"page": "Vanity Fair (novel)", "response": ["Critics hailed the work as a literary treasure before the last part of the serial was published. In her correspondence, Charlotte Brontë was effusive regarding his illustrations as well: \"You will not easily find a second Thackeray. How he can render, with a few black lines and dots, shades of expression, so fine, so real; traits of character so minute, so subtle, so difficult to seize and fix, I cannot tell—I can only wonder and admire... If Truth were again a goddess, Thackeray should be her high priest.\" "]}, {"page": "Pseudonym", "response": ["Some female authors used male pen names, in particular in the 19th century, when writing was a male-dominated profession. The Brontë sisters used pen names for their early work, so as not to reveal their gender (see below) and so that local residents would not know that the books related to people of the neighbourhood. The Brontës used their neighbours as inspiration for characters in many of their books. Anne Brontë's The Tenant of Wildfell Hall (1848) was published under the name Acton Bell, while Charlotte Brontë used the name Currer Bell for Jane Eyre (1847) and Shirley (1849), and Emily Brontë adopted Ellis Bell as cover for Wuthering Heights (1847). Other examples from the nineteenth-century are the novelist Mary Ann Evans (George Eliot) and the French writer Amandine Aurore Lucile Dupin (George Sand). Pseudonyms may also be used due to cultural or organization or political prejudices."]}, {"page": "Gillian Anderson", "response": ["* Narrated Charlotte Brontë's lost story \"L'Ingratitude\" for London Review of Books's podcast (2012)."]}, {"page": "Franco Zeffirelli", "response": ["He moved on to contemporary themes with a remake of the boxing picture The Champ (1979) and the critically panned Endless Love (1981). In the 1980s, he made a series of successful films adapting opera to the screen, with such stars as Plácido Domingo, Teresa Stratas, Juan Pons and Katia Ricciarelli. He returned to Shakespeare with Hamlet (1990), casting Mel Gibson in the lead role. His adaptation of the Charlotte Brontë novel Jane Eyre (1996) was a critical success."]}, {"page": "Napoleonic Wars", "response": ["*Charlotte Brontë's novel Shirley (1849), set during the Napoleonic Wars, explores some of the economic effects of war on rural Yorkshire."]}, {"page": "Epidemic typhus", "response": ["* (1847) In Jane Eyre by Charlotte Brontë, an outbreak of typhus occurs in Jane's school Lowood, highlighting the unsanitary conditions the girls live in."]}, {"page": "Charades", "response": ["In the early 19th century, the French began performing \"acting\" or \"acted charades\"—with the written description replaced by dramatic performances as a parlor game—and this was brought over to Britain by the English aristocracy. Thus the term gradually became more popularly used to refer to acted charades, examples of which are described in William Thackeray's Vanity Fair and in Charlotte Brontë's Jane Eyre.\"charade, n.\" OED Online. Oxford University Press, June 2015. Web. 1 September 2015."]}, {"page": "George Sand", "response": ["Sand is also referred to in Virginia Woolf's book-length essay A Room of One's Own along with George Eliot and Charlotte Brontë as \"all victims of inner strife as their writings prove, sought ineffectively to veil themselves by using the name of a man.\"Virginia Woolf, A Room of One's Own, Penguin Books, 1929, p. 52; ."]}, {"page": "Peak District", "response": ["Key scenes in Jane Austen's 1813 novel Pride and Prejudice are set in the Peak. Peveril of the Peak (1823) by Sir Walter Scott is a historical novel set at Peveril Castle, Castleton, in the reign of Charles II. William Wordsworth was a frequent visitor to Matlock; the Peak inspired several of his poems, including an 1830 sonnet to Chatsworth House. The village of Morton in Charlotte Brontë's 1847 novel Jane Eyre is based on Hathersage, where Brontë stayed in 1845; Thornfield Hall may have been inspired by nearby North Lees Hall. Snowfield in George Eliot's novel Adam Bede (1859) is thought to be based on Wirksworth, where her uncle managed a mill; Ellastone (as Hayslope) and Ashbourne (as Oakbourne) also feature."]}, {"page": "Wuthering Heights", "response": ["In 1850 Charlotte Brontë edited the original text for the second edition of Wuthering Heights and also provided it with her foreword.\"Charlotte Brontë's 1850 Preface to Wuthering Heights\", British Library online She addressed the faulty punctuation and orthography but also diluted Joseph's thick Yorkshire dialect. Writing to her publisher, W S Williams, she said that  Irene Wiltshire, in an essay on dialect and speech, examines some of the changes Charlotte made.", "Likewise Virginia Woolf suggests the importance of the Yorkshire landscape of Haworth to the poetic vision of both Emily and Charlotte Brontë:", "There is no evidence that either Thrushcross Grange or Wuthering Heights are based on actual buildings, but various locations have been speculated as inspirations. Top Withens, a ruined farmhouse in an isolated area near the Haworth Parsonage, was suggested as the model for Wuthering Heights by Ellen Nussey, a friend of Charlotte Brontë. However, its structure does not match that of the farmhouse described in the novel. High Sunderland Hall, near Law Hill, Halifax where Emily worked briefly as a governess in 1838, now demolished, has also been suggested as a model for Wuthering Heights. However, it is too grand for a farmhouse.", "Romanticism was also a major influence, which included the Gothic novel, the novels of Walter ScottElizabeth Gaskell The Life of Charlotte Brontë, London: Smith, Elder & Co., 1857, p.104. and the poetry of Byron. The Brontës' fiction is seen by some feminist critics as prime examples of Female Gothic. It explores the domestic entrapment and subjection of women to patriarchal authority, and the attempts to subvert and escape such restriction. Emily Brontë's Cathy Earnshaw and Charlotte Brontë's Jane Eyre are both examples of female protagonists in such a role.", "However, the word daemon can also mean \"a demon or devil\", and that is equally relevant to Heathcliff,OED. whom Peter McInerney describes as \"a Satanic Don Juan\".Peter McInerney, \"Satanic conceits in Frankenstein and Wuthering Heights\". Nineteenth Century Contexts, 4:1, 1-15, 1980. Heathcliff is also \"dark-skinned\", \"as dark almost as if it came from the devil\". Likewise Charlotte Brontë described him \"‘a man's shape animated by demon life - a Ghoul - an Afreet’\".John Bowen, \"Who is Heathcliff?\" (The novel 1832–1880) British Library online In Arabian mythology an \"afreet\" is a powerful jinn or demon.OED However, John Bowen believes that \"this is too simple a view\", because the novel presents an alternative explanation of Heathcliff's cruel and sadistic behaviour; that is, that he has suffered terribly: \"is an orphan; ... is brutalised by Hindley; ... relegated to the status of a servant; Catherine marries Edgar\".John Bowen, \"Who is Heathcliff?\" See also: the discussion of the demonic in the section on the gothic novel above; the Byronic hero; and the Romantic hero.", "Childhood is a central theme of Wuthering Heights.Richard Chase, \"The Brontes: A Centennial Observance\", in The Brontes: A Collection of Critical Essays, ed. by Ian Gregor (Englewood Cliffs: Prentice Hall, 1970; repro 1986), pp. 19-33 (p. 32). Emily Brontë \"understands that 'The Child is 'Father of the Man' (Wordsworth, 'My heart leaps up', 1. 7)\". Wordsworth, following philosophers of education, such as Rousseau, explored ideas about the way childhood shaped personality. One outcome of this was the German bildungsroman, or \"novel of education\", such as  Charlotte Brontë's Jane Eyre (1847), Eliot's The Mill on the Floss (1860), and Dickens's Great Expectations (1861).Melissa Fegan. Wuthering Heights: Character Studies. London: Continuum, 2008, p. 4. Bronte's characters \"are heavily influenced by their childhood experiences\", though she is less optimistic than her contemporaries that suffering can lead to \"change and renewal\".Melissa Fegan, Wuthering Heights: Character Studies, p. 5."]}, {"page": "Jane Eyre", "response": ["Jane Eyre  (originally published as Jane Eyre: An Autobiography) is a novel by English writer Charlotte Brontë, published under the pen name \"Currer Bell\", on 16 October 1847, by Smith, Elder & Co. of London. The first American edition was published the following year by Harper & Brothers of New York. Jane Eyre is a Bildungsroman which follows the experiences of its eponymous heroine, including her growth to adulthood and her love for Mr. Rochester, the brooding master of Thornfield Hall.", "The novel revolutionised prose fiction by being the first to focus on its protagonist's moral and spiritual development through an intimate first-person narrative, where actions and events are coloured by a psychological intensity. Charlotte Brontë has been called the \"first historian of the private consciousness\", and the literary ancestor of writers like Proust and Joyce.", "The early sequences, in which Jane is sent to Lowood, a harsh boarding school, are derived from the author's own experiences. Helen Burns's death from tuberculosis (referred to as consumption) recalls the deaths of Charlotte Brontë's sisters, Elizabeth and Maria, who died of the disease in childhood as a result of the conditions at their school, the Clergy Daughters School at Cowan Bridge, near Tunstall, Lancashire. Mr. Brocklehurst is based on Rev. William Carus Wilson (1791–1859), the Evangelical minister who ran the school. Additionally, John Reed's decline into alcoholism and dissolution recalls the life of Charlotte's brother Branwell, who became an opium and alcohol addict in the years preceding his death. Finally, like Jane, Charlotte became a governess. These facts were revealed to the public in The Life of Charlotte Brontë (1857) by Charlotte's friend and fellow novelist Elizabeth Gaskell.Stevie Davies, Introduction and Notes to Jane Eyre. Penguin Classics ed., 2006.", "The Gothic manor of Thornfield Hall was probably inspired by North Lees Hall, near Hathersage in the Peak District. This was visited by Charlotte Brontë and her friend Ellen Nussey in the summer of 1845, and is described by the latter in a letter dated 22 July 1845. It was the residence of the Eyre family, and its first owner, Agnes Ashurst, was reputedly confined as a lunatic in a padded second floor room. It has been suggested that the Wycoller Hall in Lancashire, close to Haworth, provided the setting for Ferndean Manor to which Mr. Rochester retreats after the fire at Thornfield: there are similarities between the owner of Ferndean—Mr. Rochester's father—and Henry Cunliffe, who inherited Wycoller in the 1770s and lived there until his death in 1818; one of Cunliffe's relatives was named Elizabeth Eyre (née Cunliffe). The sequence in which Mr. Rochester's wife sets fire to the bed curtains was prepared in an August 1830 homemade publication of Brontë's The Young Men's Magazine, Number 2. Charlotte Brontë began composing Jane Eyre in Manchester, and she likely envisioned Manchester Cathedral churchyard as the burial place for Jane's parents and Manchester as the birthplace of Jane herself.Alexander, Christine, and Sara L. Pearson. Celebrating Charlotte Brontë: Transforming Life into Literature in Jane Eyre. Brontë Society, 2016, p. 173.", ":::Do you think I am an automaton? ­a machine without feelings?...Do you think, because I am poor, obscure, plain, and little, I am soulless and heartless? You think wrong — I have as much soul as you, — and full as much heart...I am not talking to you now through the medium of custom, conventionalities, nor even of mortal flesh; — it is my spirit that addresses your spirit; just as if both had passed through the grave, and we stood at God's feet, equal, — as we are.Martin, Robert B. Charlotte Brontë's Novels: The Accents of Persuasion. NY: Norton, 1966, p. 252\"Jane Eyre, Proto-Feminist vs. 'The Third Person Man'\". P. J. Steyer '98 (English 73, Brown University, 1996). Victorian Web", "Category:Novels by Charlotte Brontë"]}, {"page": "Elizabeth Gaskell", "response": ["Elizabeth Cleghorn Gaskell (née Stevenson; 29 September 1810 – 12 November 1865), often referred to as Mrs Gaskell, was an English novelist, biographer and short story writer. Her novels offer a detailed portrait of the lives of many strata of Victorian society, including the very poor. Her work is of interest to social historians as well as readers of literature. Her first novel, Mary Barton, was published in 1848. Gaskell's The Life of Charlotte Brontë, published in 1857, was the first biography of Charlotte Brontë. In this biography, she wrote only of the moral, sophisticated things in Brontë’s life; the rest she left out, deciding that certain, more salacious aspects were better kept hidden. Among Gaskell's best known novels are Cranford (1851–53), North and South (1854–55), and Wives and Daughters (1865), each having been adapted for television by the BBC.", "In 1850 the Gaskells moved to a villa at 84 Plymouth Grove.Uglow J. Elizabeth Gaskell: A Habit of Stories (Faber and Faber; 1993) () She took her cow with her. For exercise, she would happily walk three miles to help another person in distress.  In Manchester, Elizabeth wrote her remaining literary works, while her husband held welfare committees and tutored the poor in his study. The Gaskells' social circle included writers, journalists, religious dissenters, and social reformers such as William and Mary Howitt and Harriet Martineau. Poets, patrons of literature and writers such as  Lord Houghton,  Charles Dickens and John Ruskin visited Plymouth Grove, as did the American writers Harriet Beecher Stowe and Charles Eliot Norton, while the conductor Charles Hallé, who lived close by, taught piano to one of their daughters. Elizabeth's friend Charlotte Brontë stayed there three times, and on one occasion hid behind the drawing room curtains as she was too shy to meet the Gaskells' other visitors.", "In June 1855 Patrick Brontë asked Gaskell to write a biography of his daughter Charlotte, and The Life of Charlotte Brontë was published in 1857. This played a significant role in developing Gaskell's own literary career. In the biography, Gaskell chose to focus more on Brontë as a woman than as a writer of Romantic fiction.Stone, Donald D. The Romantic Impulse in Victorian Fiction. Cambridge: Harvard University Press, 1980, p. 141. In 1859 Gaskell travelled to Whitby to gather material for Sylvia's Lovers, which was published in 1863. Her novella Cousin Phyllis was serialized in The Cornhill Magazine from November 1863 to February 1864. The serialization of her last novel, Wives and Daughters, began in August 1864 in The Cornhill. She died of a heart attack in 1865, while visiting a house she had purchased in Holybourne, Hampshire. Wives and Daughters was published in book form in early 1866, first in the United States and then, ten days later, in Britain.", "* The Life of Charlotte Brontë (1857)"]}, {"page": "Emma (novel)", "response": ["Later reviewers or commenters on the novel include Charlotte Brontë, George Henry Lewes, Juliet Pollock, Anne Ritchie, Henry James, Reginald Farrer, Virginia Woolf, and E.M. Forster. Other reviewers include Thomas Babington Macauley who considered Austen to be a \"Prose Shakespeare\", and Margaret Oliphant who stated in Blackwood's Edinburgh Magazine in March that she prefers Emma to Austen's other works and that it is \"the work of her mature mind\". Although Austen's Pride and Prejudice is the most popular of her novels, critics such as Robert McCrum suggest that \"Emma is her masterpiece, mixing the sparkle of her early books with a deep sensibility\"The 100 best novels: No 7 – Emma by Jane Austen (1816) The Guardian 4-Nov-2013Susan Morgan. In the Meantime. University of Chicago Press, pp23-51. and John Mullan has argued that Emma was a revolutionary novel which changed the shape of what is possible in fiction\" because \"The novel bent narration through the distorting lens of its protagonist’s mind\".How Jane Austen’s Emma changed the face of fiction The Guardian 5-Dec-2015"]}, {"page": "David Copperfield", "response": ["In 1847, Jane Eyre, Charlotte Brontë's first-person narrative, was acclaimed as soon as it was published. Unlike Thackeray, who adored it, Dickens claims years later never to have read it. True or false, he had encountered Elizabeth Gaskell's Mary Barton a novel that called for understanding and sympathy in a class-eaten society.Charles Dickens, Letter, Letter to Rogers, 18 February 1849. Thackeray's Pendennis was serialised at the same time as David Copperfield and it depicts its hero's personal and social journey from the countryside to the city. A rivalry existed between the two writers, though it preoccupied Thackeray more than Dickens. The most direct literary influence is \"obviously Carlyle\" who, in a lecture given in 1840, the year of his meeting with Dickens, on \"On Heroes, Hero-Worship\" and \"the Heroic in History\", claims that the most important modern character is \"the hero as a man of letters\". This is David's destiny, through experience, perseverance and seriousness.", "David Copperfield has pleased many writers. Charlotte Brontë, for example, commented in 1849 in a letter to the reader of her publisher: I have read David Copperfield; it seems to me very good—admirable in some parts. You said it had affinity to Jane Eyre: it has—now and then—only what an advantage has Dickens in his varied knowledge of men and things!Charlotte Brontë, Letter to W S Williams, 13 September 1849, cited by  Tolstoy, for his part, considered it \"the best work of the best English novelist\" and, according to F. R. and Q. D. Leavis, was inspired by David and Dora's love story to have Prince Andrew marry Princess Lise in War and Peace. Henry James remembered being moved to tears, while listening to the novel, hidden under a table, read aloud in the family circle. Dostoevsky enthusiastically cultivated the novel in a prison camp in Siberia. Franz Kafka wrote in his diary in 1917, that the first chapter of his novel Amerika was inspired by David Copperfield.Kafka's novel is a kind of inverted bildungsroman, since the young man whose destiny we follow is more of a disaster than an accomplishment. James Joyce parodied it in Ulysses. Virginia Woolf, who was not very fond of Dickens, states that David Copperfield, along with Robinson Crusoe, Grimm's fairy tales, Scott's Waverley and Pickwick's Posthumous Papers, \"are not books, but stories communicated by word of mouth in those tender years when fact and fiction merge, and thus belong to the memories and myths of life, and not to its esthetic experience.\" Woolf also noted in a letter to Hugh Walpole in 1936, that she is re-reading it for the sixth time: \"I'd forgotten how magnificent it is.\"Virginia Woolf, Letter to Hugh Walpole, 8 February 1936. It also seems that the novel was Sigmund Freud's favourite; and Somerset Maugham sees it as a \"great\" work, although his hero seems to him rather weak, unworthy even of its author, while Mr Micawber never disappoints: \"The most remarkable of them is, of course, Mr Micawber. He never fails you.\""]}, {"page": "List of poets", "response": ["*Charlotte Brontë (1816–1855), English novelist and poet, eldest of three Brontë sisters"]}, {"page": "List of biographers", "response": ["*Elizabeth Gaskell (En, 1810–1865) – Charlotte Brontë"]}, {"page": "First-person narrative", "response": ["A first-person narrative is a mode of storytelling in which a storyteller recounts events from their own point of view using the first person Grammarly, https://www.grammarly.com/blog/first-second-and-third-person/#:~:text=We%2C%20us%2C%20our%2Cand,%2C%20my%2C%20mine%20and%20myself.\" It may be narrated by a first person protagonist (or other focal character), first person re-teller, first person witness, or first person peripheral. A classic example of a first person protagonist narrator is Charlotte Brontë's Jane Eyre (1847), in which the title character is also the narrator telling her own story, \"I could not unlove him now, merely because I found that he had ceased to notice me\"."]}, {"page": "Robert Southey", "response": ["In 1837 Southey received a letter from Charlotte Brontë, seeking his advice on some of her poems. He wrote back praising her talents, but discouraging her from writing professionally: \"Literature cannot be the business of a woman's life,\" he argued. Years later, Brontë remarked to a friend that the letter was \"kind and admirable; a little stringent, but it did me good.\""]}, {"page": "School and university in literature", "response": ["Educational settings as place and/or subject in fiction form the theme of this catalogue of titles and authors. Organized alphabetically by the author's last name, the information is further divided by general school environments and those where the university, specifically, is the locale.  The list spans centuries and geographical boundaries, featuring Charlotte Brontë, Agatha Christie and Honoré de Balzac as well as contemporary writers Curtis Sittenfeld, Joyce Carol Oates and Donna Tartt.  For those interested in learning more about the school/university in literature, references are included that provide a more academic study of the subgenre.", "* Charlotte Brontë: The Professor and Villette"]}, {"page": "John Ruskin", "response": ["Although critics were slow to react and the reviews were mixed, many notable literary and artistic figures were impressed with the young man's work, including Charlotte Brontë and Elizabeth Gaskell.Tim Hilton, John Ruskin: The Early Years (Yale University Press, 1985) p. 73. Suddenly Ruskin had found his métier, and in one leap helped redefine the genre of art criticism, mixing a discourse of polemic with aesthetics, scientific observation and ethics. It cemented Ruskin's relationship with Turner. After the artist died in 1851, Ruskin catalogued nearly 20,000 sketches that Turner gave to the British nation.", "* Pathetic fallacy: Ruskin coined this term in Modern Painters III (1856) to describe the ascription of human emotions to inanimate objects and impersonal natural forces, as in \"Nature must be gladsome when I was so happy\" (Charlotte Brontë, Jane Eyre).Modern Painters III (see Part VI, \"Of Many Things\", c. XII, \"Of the Paethetic Fallacy\") see Works 5.201–220."]}]}}