{"wiki_id": "http://www.wikidata.org/entity/Q1276141", "itemLabel": "Joe Baker", "itemDescription": "England international association footballer (1940-2003)", "wikipedia_url": "https://en.wikipedia.org/wiki/Joe_Baker", "wikipedia_page": {"main": "Joseph Henry Baker (17 July 1940 – 6 October 2003) was an England international footballer. Born in Woolton in Liverpool, England, he spent virtually his entire childhood growing up in Motherwell, Scotland. He is notable for being the first professional player to have played for England without having previously played in the English football league system, and for scoring over 100 goals in both the English and Scottish leagues. His brother Gerry Baker was also a professional footballer, who played internationally for the United States.", "link_mentions": [{"page": "Nottingham Forest F.C.", "response": ["By this time Forest had replaced Notts County as the biggest club in Nottingham. Johnny Carey assembled a team including Joe Baker and Ian Storey-Moore that for a long spell went largely unchanged in challenging for the 1966–67 Football League title. They beat title rivals Manchester United 4–1 at the City Ground on 1 October. The 3–0 win against Aston Villa on 15 April had Forest second in the table a point behind United. Injuries eventually took effect meaning Forest had to settle for being League runners-up and losing in the FA Cup semi-final to Dave Mackay's Tottenham Hotspur."]}, {"page": "Hibernian F.C.", "response": ["Hibernian players have been capped at full international level for 26 different national teams, with 67 Hibernian players appearing for Scotland. Hibernian rank fifth amongst all clubs in providing players for Scotland, behind the Old Firm, Queen's Park and Hearts. James Lundie and James McGhee were the first Hibs players to play for Scotland, in an 1886 British Home Championship match against Wales. Lawrie Reilly holds the record for most international caps earned while a Hibs player, making 38 appearances for Scotland between 1949 and 1957. In 1959, Hibs forward Joe Baker became the first player who had not previously played for an English club to win a cap for England.", "*Most competitive goals in a season: Joe Baker, 46 in 1959–60", "*Most league goals in a season: Joe Baker, 42 in 1959–60"]}, {"page": "Billy Wright (footballer, born 1924)", "response": ["He became manager of England's youth team in 1960, before being appointed manager of Arsenal in 1962, replacing George Swindin. Initially Arsenal started strongly under Wright, finishing seventh in 1962–63 and qualifying for Europe for the first time in their history, but failed to build on this. Wright enjoyed mixed success with his signings, who included successes such as Bob Wilson, Joe Baker and Frank McLintock, but also less successful players such as Ian Ure."]}, {"page": "George Graham (footballer, born 1944)", "response": ["Bertie Mee's Arsenal were looking for a replacement for Joe Baker, and paid £50,000 plus Tommy Baldwin in 1966 to bring Graham to Highbury. He made his debut on 1 October 1966 at home to Leicester City, and although the result was a 4–2 defeat he immediately became a regular in the Arsenal side. He was Arsenal's top scorer in both 1966–67 and 1967–68, having started out as a centre forward for the club, but later moved back into midfield as an inside forward with John Radford moving from the wing to central striker."]}, {"page": "Norman Hunter (footballer)", "response": ["Hunter played three games for England under-23 before given his debut for the England team in 1965 by manager Alf Ramsey. On 8 December 1965, England played Spain in Madrid. Hunter came on in his first game, as a 35th minute substitute for Joe Baker. The substitution of Hunter in a midfield position allowed Ramsey to deploy both Bobby Charlton and Alan Ball in more attacking roles as England won 2–0. The existing partnership between Jack Charlton and Bobby Moore meant that he spent much of his international career as an understudy, winning 28 caps in total. He was in the squad which won the 1966 World Cup but did not play any games."]}, {"page": "Owen Hargreaves", "response": ["As a Canadian citizen with a Welsh mother and an English father, Hargreaves was eligible to represent Canada, Wales or England. Hargreaves initially played for Wales, and was capped three times for the Wales under-19 team, but then opted to play for the England under-21 team in 2000 and was capped by the senior squad the following year. He is the only player to have played for England without having previously lived in the United Kingdom, and only the second, after Joe Baker, to have done so without having previously played in the English football league system.", "Hargreaves played his first full international game on 15 August 2001 against the Netherlands at White Hart Lane, giving him the distinction of being the only player to appear for England despite having never lived in England. He was also the second player (after Joe Baker) to have appeared for England without having played in English league football and the first to appear for England without having played in Britain. In only his second cap he came on as a substitute as England famously beat Germany 5–1 in the Olympiastadion. Hargreaves was the only player playing outside the Premier League to be selected for England's 2002 FIFA World Cup squad. Hargreaves was injured after just fifteen minutes of England's second group game against Argentina and had to be substituted."]}, {"page": "Denis Law", "response": ["Law moved to Torino for a fee of £110,000,This was roughly equivalent to £1.65 million at 2004 values, according to the retail price conversion utility at measuringworth.com. (a record fee for a transfer involving a British player) and was accompanied by Joe Baker who had signed from Scottish side Hibernian. Law's time in Italy did not go according to plan. Another Italian club, Internazionale, tried to prevent him becoming a Torino player as soon as he arrived, claiming he had signed a pre-contract agreement with them, although they dropped this claim before the season started.", "On 7 February 1962, he was injured in a car crash when his teammate Joe Baker drove the wrong way around a roundabout and clipped the kerb as he tried to turn the car around, flipping it over. Baker was almost killed, but Law's injuries were not life-threatening.", "Although his time in Italy was mixed, Law was voted number one foreign player in Italy ahead of teammate Joe Baker, Fiorentina winger Kurt Hamrin and Inter Milan midfielder Luis Suarez. The lifestyle and culture of a foreign country was an eye-opener for the young Scotsman, and the medical expertise and sports science in Italy was far ahead of what was available in the UK at the time. Ultimately though, Law found the football to be joyless and overly defensive, with him being subjected to violent man marking and heavy tackling on a frequent basis."]}, {"page": "Albion Rovers F.C.", "response": ["*Joe Baker (1981–1982)", "*Joe Baker (1984–1985)"]}, {"page": "Wishaw", "response": ["*Joe Baker, footballer"]}, {"page": "Woolton", "response": ["*Joe Baker, England international footballer, born in Woolton"]}, {"page": "England national football team records and statistics", "response": [": Joe Baker, of Hibernian, 18 November 1959, 2–1 vs. Northern Ireland", "|Joe Baker", "|18 November 1959 – 22 May 1960Joe Baker's first appearance was the first by any player who had never represented an English club.", "|Joe Baker"]}, {"page": "Ian Storey-Moore", "response": ["Storey-Moore was playing junior football in Scunthorpe when spotted by a scout for Nottingham Forest for whom he signed in May 1961. Johnny Carey became Forest manager in 1963. Carey assembled a team including Storey-Moore, Joe Baker and Alan Hinton that for a long spell went largely unchanged in challenging for the 1966–67 Football League title. They beat title rivals Manchester United 4–1 at the City Ground on 1 October 1966. The 3–0 win against Aston Villa on 15 April had Forest second in the table a point behind United. Injuries eventually took effect meaning Forest had to settle for being League Runners-up and losing in the 1966-67 FA Cup semi-final to Dave Mackay's Tottenham Hotspur."]}, {"page": "Peter Storey", "response": ["He made his senior debut on 30 October 1965, taking Billy McCullough's place at left-back in a 3–1 defeat to Leicester City at Filbert Street. The Daily Telegraph reported that he had a \"promising\" game against a \"clever\" opponent in right-winger Jackie Sinclair. He retained his first team place and went on to play all of the remaining 29 games, though the season would prove to be a poor one for the \"Gunners\" as manager Billy Wright was sacked after dropping top-scorer Joe Baker and disillusioning the dressing room. Arsenal finished in 14th place in 1965–66, just four points above the relegation zone, and were knocked out of the FA Cup at the Third Round following a 3–0 defeat to Blackburn Rovers, who would end the season bottom of the First Division."]}, {"page": "Bernie Slaven", "response": ["He joined Albion Rovers in April 1983 after being signed by Benny Rooney – his former manager at Morton; however it would be Rooney's successor, Andy Ritchie, who converted Slaven from a left-half into a centre-forward. In this new position he scored 31 goals in the 1984–85 season with many set up by Vic Kasule. Slaven won the 1984–85 Daily Record Golden Shot award in the process. Ritchie would not enjoy the benefits of his decision though, as he was replaced by Joe Baker early in the season, and Baker went to also appoint Slaven as club captain. Slaven went on to be named as both the club's and the division's Player of the Year. During this time as a semi-professional he was working as a gardener, but Rovers chairman Tom Fagan demanded £40,000 to sell Slaven, which was a high price for a non-professional third-tier player. Slaven refused to play for Rovers, and was subsequently contacted by a reporter from The Sunday Post, who wrote to 54 English and Scottish clubs on his behalf. Middlesbrough responded to the letter with the offer of a two-week trial."]}, {"page": "Geoff Strong", "response": ["Strong played 19 league games that season, scoring ten goals, and appeared in 20 the following season, 1961–62, before finally becoming an automatic first-choice in 1962–63. Playing as an inside forward or centre forward, Strong formed a lethal attacking partnership with Joe Baker and became a regular goalscorer for the clubhis record being 31 in all competitions in 1963–64; Baker and Strong together scored 62 that season."]}]}}