{"wiki_id": "http://www.wikidata.org/entity/Q1275370", "itemLabel": "Humphry Osmond", "itemDescription": "British psychiatrist (1917-2004)", "wikipedia_url": "https://en.wikipedia.org/wiki/Humphry_Osmond", "wikipedia_page": {"main": "Humphry Fortescue Osmond (1 July 1917 – 6 February 2004) was an English psychiatrist who expatriated to Canada, then moved to work in the United States. He is known for inventing the word psychedelic and for his research into interesting and useful applications for psychedelic drugs. Osmond also explored aspects of the psychology of social environments, in particular how they influenced welfare or recovery in mental institutions.\n\n", "link_mentions": [{"page": "Aldous Huxley", "response": ["In the spring of 1953, Huxley had his first experience with the psychedelic drug mescaline. Huxley had initiated a correspondence with Doctor Humphry Osmond, a British psychiatrist then employed in a Canadian institution, and eventually asked him to supply a dose of mescaline; Osmond obliged and supervised Huxley's session in southern California. After the publication of The Doors of Perception, in which he recounted this experience, Huxley and Swami Prabhavananda disagreed about the meaning and importance of the psychedelic drug experience, which may have caused the relationship to cool, but Huxley continued to write articles for the society's journal, lecture at the temple, and attend social functions. Huxley later had an experience on mescaline that he considered more profound than those detailed in The Doors of Perception."]}, {"page": "July 1", "response": ["*1917 – Humphry Osmond, English-American lieutenant and psychiatrist (d. 2004)"]}, {"page": "Lysergic acid diethylamide", "response": ["LSD-assisted psychotherapy was used in the 1950s and early 1960s by psychiatrists such as Humphry Osmond, who pioneered the application of LSD to the treatment of alcoholism, with promising results, resulting in Osmond coining the term 'psychedelic' (lit. mind manifesting) as a term for LSD and related hallucinogens, superseding the previously held 'psychotomimetic' model, in which LSD was believed to mimic schizophrenia. Due to the discovery of LSD's ability to induce transcendental experiences with lasting psychological benefit, in contrast to schizophrenia. During this time, the Central Intelligence Agency (CIA) was interested in LSD as an addition to its preexisting research into using psychoactive substances to aid interrogation under Project MKUltra. Due to LSD's unpredictability, The CIA eventually ceased research into this in favor of the possibility of giving LSD to world leaders so that they would discredit themselves under its influence. This resulted in the CIA administering LSD to unwitting test subjects in order to observe how they would react, the most well-known example of this being Operation Midnight Climax. LSD was one of several psychoactive substances evaluated by the U.S. Army Chemical Corps as possible non-lethal incapacitants in the Edgewood Arsenal human experiments."]}, {"page": "Psychedelic rock", "response": ["The term \"psychedelic\" was coined in 1956 by psychiatrist Humphry Osmond in a letter to LSD exponent Aldous Huxley and used as an alternative descriptor for hallucinogenic drugs in the context of psychedelic psychotherapy.N. Murray, Aldous Huxley: A Biography (Hachette, 2009), , p. 419. As the countercultural scene developed in San Francisco, the terms acid rock and psychedelic rock were used in 1966 to describe the new drug-influenced music\"Logical Outcome of fifty years of art\", LIFE, 9 September 1966, p. 68. and were being widely used by 1967. The two terms are often used interchangeably, but acid rock may be distinguished as a more extreme variation that was heavier, louder, relied on long jams, focused more directly on LSD, and made greater use of distortion.Eric V. d. Luft, Die at the Right Time!: A Subjective Cultural History of the American Sixties (Gegensatz Press, 2009), , p. 173."]}, {"page": "The Doors of Perception", "response": ["=== Research by Humphry Osmond ===", "Huxley had first heard of peyote use in ceremonies of the Native American Church in New Mexico, soon after coming to the United States in 1937.Woodcock, George (1972) Dawn and the Darkest Hour: A study of Aldous Huxley, p. 274, Faber & Faber,  He first became aware of the cactus's active ingredient, mescaline, after reading an academic paper written by Humphry Osmond, a British psychiatrist working at Weyburn Mental Hospital, Saskatchewan, in early 1952. Osmond's paper set out results from his research into schizophrenia, using mescaline that he had been undertaking with colleagues, doctors Abram Hoffer and John Smythies.Bedford, Sybille (1974) Aldous Huxley: A Biography, Volume Two: 1939–1963 p. 144, Chatto & Windus,  In the epilogue to his novel The Devils of Loudun, published earlier that year, Huxley had written that drugs were \"toxic short cuts to self-transcendence\".Huxley, Aldous (1952), The Devils of Loudun, Chatto & Windus For the Canadian writer George Woodcock, Huxley had changed his opinion because mescaline was not addictive and appeared to be without unpleasant physical or mental side-effects.  Further, he had found that hypnosis, autohypnosis and meditation had apparently failed to produce the results he wanted.Woodcock (1972) p. 275", "Huxley continued to take these substances several times a year until his death,Dunaway, David King (1989) p. 300 but with a serious and temperate frame of mind.Dunaway, David King (1989) p. 327 He refused to talk about the substances outside scientific meetings,Dunaway, David King (1989) p. 298 turned down an invitation to talk about them on TVDunaway, David King (1989) p. 330 and refused the leadership of a foundation devoted to the study of psychedelics, explaining that they were only one of his diverse number of interests.Dunaway, David King (1989) p. 369 For Philip Thody, a professor of French literature, Huxley's revelations made him conscious of the objections that had been put forward to his theory of mysticism set out in Eyeless in Gaza and Grey Eminence, and consequently Island reveals a more humane philosophy.Thody, Philip (1973) Aldous Huxley Leaders of Modern Thought, Studio Vista,  However, this change in perspective may lie elsewhere. In October 1955, Huxley had an experience while on mescaline that he considered more profound than those detailed in The Doors of Perception. He decided his previous experiments, the ones detailed in Doors and Heaven and Hell, had been \"temptations to escape from the central reality into false, or at least imperfect and partial Nirvanas of beauty and mere knowledge.\"Stevens, Jay (1998) Storming Heaven: LSD and the American Dream, pp. 56–57, Grove Press,  He wrote in a letter to Humphry Osmond, that he experienced \"the direct, total awareness, from the inside, so to say, of Love as the primary and fundamental cosmic fact. ... I was this fact; or perhaps it would be more accurate to say that this fact occupied the place where I had been.\"Letter to Humphry Osmond, 24 October 1955. in Achera Huxley, Laura (1969) This Timeless Moment. p. 139, Chatto & Windus The experience made its way into the final chapter of Island.Achera Huxley, p. 146 This raised a troublesome point. Was it better to pursue a course of careful psychological experimentation.... or was the real value of these drugs to \"stimulate the most basic kind of religious ecstasy\"?"]}, {"page": "1917", "response": ["** Humphry Osmond, British psychiatrist (d. 2004)"]}, {"page": "1955", "response": ["* September 2 – Under the guidance of Dr. Humphry Osmond, Christopher Mayhew ingests 400 mg of mescaline hydrochloride and allows himself to be filmed as part of a Panorama special for BBC TV in the U.K. that is never broadcast."]}, {"page": "Mescaline", "response": ["In 1955, English politician Christopher Mayhew took part in an experiment for BBC's Panorama, in which he ingested 400 mg of mescaline under the supervision of psychiatrist Humphry Osmond. Though the recording was deemed too controversial and ultimately omitted from the show, Mayhew praised the experience, calling it \"the most interesting thing I ever did\"."]}, {"page": "Psychedelia", "response": ["The term was first coined as a noun in 1956 by psychiatrist Humphry Osmond as an alternative descriptor for hallucinogenic drugs in the context of psychedelic psychotherapy.Nicholas Murray, Aldous Huxley: A Biography, 419. It is irregularlyOxford English Dictionary, 3rd edition, September 2007, s.v., Etymology derived from the Greek words ψυχή psychḗ 'soul, mind' and δηλείν dēleín 'to manifest', with the meaning \"mind manifesting,\" the implication being that psychedelics can develop unused potentials of the human mind.A. Weil, W. Rosen. (1993), From Chocolate To Morphine: Everything You Need To Know About Mind-Altering Drugs. New York, Houghton Mifflin Company. p. 93 The term was loathed by American ethnobotanist Richard Schultes but championed by American psychologist Timothy Leary.W. Davis (1996), \"One River: Explorations and Discoveries in the Amazon Rain Forest\". New York, Simon and Schuster, Inc. p. 120."]}, {"page": "Adrenochrome", "response": ["In 1954, researchers Abram Hoffer and Humphry Osmond claimed that adrenochrome is a neurotoxic, psychotomimetic substance and may play a role in schizophrenia and other mental illnesses."]}, {"page": "GKT School of Medical Education", "response": ["* Humphry Osmond, psychiatrist who worked with psychedelic drugs and coined the term"]}, {"page": "Weyburn", "response": ["*Humphry Osmond - medical researcher"]}, {"page": "Milford, Surrey", "response": ["*Humphry Osmond, psychiatrist"]}, {"page": "Orthomolecular medicine", "response": ["In the 1950s, some individuals believed that vitamin deficiencies caused mental illness. Psychiatrists Humphry Osmond and Abram Hoffer gave people having acute schizophrenic episodes high doses of niacin,"]}, {"page": "1917 in science", "response": ["* July 1 – Humphry Osmond (died 2004), English-born psychiatrist."]}, {"page": "2004 in science", "response": ["* February 6 – Humphry Osmond (b. 1917), English-born psychiatrist."]}, {"page": "Guy's Hospital", "response": ["* Humphry Osmond, psychiatrist who worked with psychedelic drugs and coined the term"]}, {"page": "1956 in science", "response": ["* April – Humphry Osmond first proposes use of the word psychedelic to describe the effect of certain drugs, at a meeting of the New York Academy of Sciences."]}, {"page": "Psychedelic therapy", "response": ["Studies by Humphry Osmond, Betty Eisner, and others examined the possibility that psychedelic therapy could treat alcoholism (or, less commonly, other addictions). One review of the usefulness of psychedelic therapy in treating alcoholism concluded that the possibility was neither proven nor disproven. Another thorough meta-analysis from 2012 found that \"In a pooled analysis of six randomized controlled clinical trials, a single dose of LSD had a significant beneficial effect on alcohol misuse at the first reported follow-up assessment, which ranged from 1 to 12 months after discharge from each treatment program. This treatment effect from LSD on alcohol misuse was also seen at 2 to 3 months and at 6 months, but was not statistically significant at 12 months post-treatment. Among the three trials that reported total abstinence from alcohol use, there was also a significant beneficial effect of LSD at the first reported follow-up, which ranged from 1 to 3 months after discharge from each treatment program.\"", "Psychedelic therapy involves the use of very high doses of psychedelic drugs, with the aim of promoting transcendental, ecstatic, religious or mystical peak experiences. Patients spend most of the acute period of the drug's activity lying down with eyeshades listening to nonlyrical music and exploring their inner experience. Dialogue with the therapists is sparse during the drug sessions but essential during psychotherapy sessions before and after the drug experience. There are two therapists, one man and one woman. The recent resurgence of research (see § Early 21st Century Resurgence above) uses this method. It is more closely aligned to transpersonal psychology than to traditional psychoanalysis. Psychedelic therapy is practiced primarily in North America. The psychedelic therapy method was initiated by Humphry Osmond and Abram Hoffer (with some influence from Al Hubbard) and replicated by Keith Ditman."]}, {"page": "2004 in the United Kingdom", "response": ["* 6 February – Humphry Osmond, psychiatrist (born 1917)"]}, {"page": "Alfred Matthew Hubbard", "response": ["The confident and connected Al Hubbard invited Dr. Humphry Osmond  to join him for lunch at the Vancouver Yacht Club. Osmond and his colleagues were using the drug, as well as the similar substance, mescaline, in psychiatric research and treatment at Weyburn, Saskatchewan. Osmond later recalled that the Yacht Club \"was a very dignified place, and I was rather awed by it. [Hubbard] was a powerfully-built man...with a broad face and a firm hand-grip. He was also very genial, an excellent host.\" \"Captain Hubbard\" was interested in acquiring some mescaline, which was then still legal, and Dr. Osmond supplied him with some.", "The Central Intelligence Agency grew out of the post-World War II OSS, which was reputed to be one of Hubbard's employers. Under the auspices of MK-ULTRA, the CIA regularly dosed its agents and associates with powerful hallucinogens as a preemptive measure against what was alleged to be the Soviets' own chemical technology, sometimes with disastrous results. It is possible that Hubbard had some links with the CIA, but Humphry Osmond doubts that Hubbard would have been associated with a project like MK-ULTRA, \"not particularly on humanitarian grounds, but on the grounds that it was bad technique.\""]}, {"page": "History of lysergic acid diethylamide", "response": ["In one study in the late 1950s, Dr. Humphry Osmond gave LSD to alcoholics in Alcoholics Anonymous who had failed to quit drinking.Dyck, Erika. Psychedelic Psychiatry: LSD From Clinic to Campus. The Johns Hopkins University Press, 2008. After one year, around 50% of the study group had not had a drink — a success rate that has never been duplicated by any other means.Maclean, J.R.; Macdonald, D.C.; Ogden, F.; Wilby, E., \"LSD-25 and mescaline as therapeutic adjuvants.\" In: Abramson, H., Ed., The Use of LSD in Psychotherapy and Alcoholism, Bobbs-Merrill: New York, 1967, pp. 407–426; Ditman, K.S.; Bailey, J.J., \"Evaluating LSD as a psychotherapeutic agent,\" pp.74–80; Hoffer, A., \"A program for the treatment of alcoholism: LSD, malvaria, and nicotinic acid,\" pp. 353–402. Bill Wilson, the founder of Alcoholics Anonymous, participated in medically supervised experiments on the effects of LSD on alcoholism and believed LSD could be used to cure alcoholics.", "Huxley was introduced to psychedelic drugs in 1953 by a friend, psychiatrist Humphry Osmond. Osmond had become interested in hallucinogens and their relationship to mental illness in the 1940s. During the 1950s, he completed extensive studies of a number of drugs, including mescaline and LSD. As noted above, Osmond had some remarkable success in treating alcoholics with LSD.", "Although he had no medical training, Hubbard collaborated on running psychedelic sessions with LSD with Ross McLean at Vancouver's Hollywood Hospital, with psychiatrists Abram Hoffer and Humphry Osmond; with Myron Stolaroff at the International Federation for Advanced Study in Menlo Park, California; and with Willis Harman at the Stanford Research Institute (SRI). At various times over the next 20 years, Hubbard also reportedly worked for the Canadian Special Services, the U.S. Justice Department and the U.S. Bureau of Alcohol, Tobacco & Firearms. It is also rumored that he was involved with the CIA's MK-ULTRA project. How his government positions actually interacted with his work with LSD is unknown.", "LSD began to be used recreationally in certain (primarily medical) circles. Mainly academics and medical professionals, who became acquainted with LSD in their work, began using it themselves and sharing it with friends and associates. Among the first to do so was British psychiatrist Humphry Osmond."]}, {"page": "Psychedelic art", "response": ["Psychedelic art (also known as psychedelia) is art, graphics or visual displays related to or inspired by psychedelic experiences and hallucinations known to follow the ingestion of psychedelic drugs such as LSD and psilocybin. The word \"psychedelic\" (coined by British psychologist Humphry Osmond) means \"mind manifesting\".  By that definition, all artistic efforts to depict the inner world of the psyche may be considered \"psychedelic\"."]}, {"page": "Christopher Mayhew", "response": ["In 1955 Mayhew took part in an experiment that was intended to form a Panorama special for BBC TV, but was never broadcast. Under the guidance of his friend Humphry Osmond, Mayhew ingested 400 mg of mescaline hydrochloride and allowed himself to be filmed for the duration of the trip. Samples of the audio were used in the psychedelic dance tracks \"Mayhew Speaks Out\" and \"Christopher Mayhew Says\" by the band the Shamen. Part of the footage was included in the BBC documentary LSD – The Beyond Within (1986)."]}, {"page": "St George's Hospital", "response": ["* Humphry Osmond, pioneer of orthomolecular psychiatry and coiner of the word psychedelic"]}, {"page": "Socio-architecture", "response": ["Socio-architecture is a phrase coined by psychologist Humphry Osmond and Canadian architect Kyo Izumi as part of their research for the best architectural form for Osmond's Weyburn Mental Hospital in 1951."]}, {"page": "Orthomolecular psychiatry", "response": ["Orthomolecular psychiatry began with Abram Hoffer and Humphry Osmond in the 1950s and was continued by Carl Pfeiffer, although proponents of orthomolecular psychiatry say that the ideas behind their approach can be traced back to the 1920s and '30s. as cited in  Orthomolecular psychiatry's goal of weaning patients from conventional neuroleptic drugs follows \"Pfeiffer's Law\", \"For every drug that benefits a patient, there is a natural substance that can achieve the same effect\". In 1968, Linus Pauling first used the term orthomolecular."]}, {"page": "Robert Sommer", "response": ["Sommer was influenced by his studies on environmental psychology with Dr. Humphry Osmond, a psychiatrist who researched hallucinogens. Osmond coined the term psychedelic and also worked in mental hospitals researching social environments and how they affect recovery.In Memoriam: Humphry Osmond. \"Journal of Environmental Psychology.\" Volume 24, Issue 2, June 2004, Pages 257-258"]}, {"page": "Abram Hoffer", "response": ["Working in Saskatchewan with Humphry Osmond (who coined the term \"psychedelic\"), Hoffer and other scientists sought to find medicinal uses for hallucinogenic drugs.  Part of the research involved Hoffer, Osmond and their wives consuming LSD in an effort to become better acquainted with, and better understand its effects, later joined by other experimenters and their wives.Dyck, 2008, p. 37.  Their work began attracting notoriety within professional, provincial and federal and political circles, and they were courted by the emerging movement to restrict peyote as well as Native American groups that used the substance in religious ceremonies.Dyck, 2008, p. 84-5.  Hoffer, Osmond and others treated alcoholics with LSD.  Canadian scientists reported a fifty percent success rate in one study, although Hoffer speculated that it was more likely the psychedelic experience of LSD, rather than simulated delirium tremens, that convinced the alcoholics to stop drinking.", "* Chemical Basis of Clinical Psychiatry, with Humphry Osmond. Springfield, IL: Thomas, 1960. .", "* The Hallucinogens, with Humphry Osmond and Thaddeus E. Weckowicz. Academic Press, 1967. .Jarvik, Murray. Review of  The Hallucinogens, by Abram Hoffer, Osmond Humphry and Thaddus E. Weckowicz. Science, Vol. 160, No. 3830, May 24, 1968, pp. 868. .", "* Hoffer-Osmond Diagnostic Test, with Humphry Osmond and Kelm H. Tuscaloosa, AL: Behavior Science Press, 1975.", "* Tanne, Janice Hopkins. \"Humphry Osmond.\" British Medical Journal, Vol. 328, No. 7441, March 20, 2004, p. 713. . Full issue available. \"Psychiatrist who investigated LSD, 'turned on' Aldous Huxley, and coined the word 'psychedelic'.\""]}, {"page": "Humphry", "response": ["*Humphry Osmond (1917–2004), British psychiatrist"]}, {"page": "Journal of Orthomolecular Medicine", "response": ["In 1967, Hoffer found it increasingly difficult to publish reports on his studies of megavitamin therapies and claimed that his studies were rejected in a conspiracy of mainstream medicine, prompted by what he alleged to be extended conflicts of interest on the part of the American Psychiatric Association.Megavitamin Therapy In Reply To Task Force Report on Megavitamin and Orthomolecular Therapy in Psychiatry. Canadian Schizophrenia Foundation. August 1976Abram Hoffer, Adventures in Psychiatry: The Scientific Memoirs of Dr. Abram Hoffer, KOS Publishing, Toronto, 2005 Review. The Journal of Schizophrenia followed the formation of the Canadian Schizophrenia Foundation and the American Schizophrenia Association. Hoffer and Humphry Osmond, who developed the hypothesis that schizophrenia is caused by the endogenous production of an epinephrine (adrenaline) based hallucinogen, were called before the Committee of Ethics of the American Psychiatric Association to explain why they were publicizing a treatment, called xenobiotic psychiatry by Bernard Rimland, which was considered outside of standard psychiatric practice.Article by Hoffer , accessed 23 Sept 2006. Hoffer claims that one of the assistant editors of the American Journal of Psychiatry announced that he would never allow any article from Hoffer's group to appear in his journal."]}, {"page": "List of people associated with the University of London", "response": ["* Humphry Osmond (KCL)"]}, {"page": "Humphrey Osmond", "response": ["#redirect Humphry Osmond"]}, {"page": "List of psychiatrists", "response": ["|Humphry Osmond "]}, {"page": "Heini Hediger", "response": ["In the 1950s, psychologist Humphry Osmond developed the concept of socio-architecture hospital design, such as was used in the design of the Weyburn mental hospital in 1951, based partly on Hediger's species-habitat work."]}, {"page": "1917 in the United Kingdom", "response": ["* 1 July – Humphry Osmond, psychiatrist (died 2004)"]}]}}