{"wiki_id": "http://www.wikidata.org/entity/Q12793061", "itemLabel": "Julian Jefferson", "itemDescription": "British cricket player (1899-1966)", "wikipedia_url": "https://en.wikipedia.org/wiki/Julian_Jefferson", "wikipedia_page": {"main": "Julian Jefferson (18 July 1899 – 18 June 1966)  was an English first-class cricketer and British Army officer. Graduating from Sandhurst, he entered into the Welsh Guards during the later stages of the First World War. His military career spanned from 1918–1949, with Jefferson serving during the Second World War and commanding British forces in the North Caribbean in 1948. He was appointed a CBE in the 1948 Birthday Honours, and in the same year he was awarded the Legion of Merit by the United States. During the early part of his military service, he played first-class cricket for the British Army and the Combined Services cricket team. He was the father of the cricketer Richard Jefferson.", "link_mentions": [{"page": "Will Jefferson", "response": ["Jefferson was a right-handed opening batsman and a reliable slip fielder. He was born in Derby to a cricketing family; his father Richard Jefferson played first-class cricket for Surrey, while his grandfather Julian Jefferson played first-class cricket in the 1920s for services teams. He showed his promise at Oundle School and Durham University. Jefferson studied at Durham from 1999 to 2002, completing the Sport in the Community course. He made his first-class debut for British Universities against the touring Zimbabweans in 2000."]}, {"page": "Richard Jefferson (cricketer)", "response": ["The son of Brigadier Julian Jefferson, Jefferson was educated at Winchester College and Corpus Christi College, Cambridge. He won a blue but left after a year. He went on to play a couple of seasons for Surrey before illness in 1965 curtailed his first-class career. He subsequently played for Norfolk, before taking a Certificate in Education and teaching in a private school.  Winchester College Register  "]}, {"page": "List of Old Greshamians", "response": ["*Brigadier Julian Jefferson, British Army officer", "*Julian Jefferson – cricketer"]}, {"page": "Jefferson (surname)", "response": ["* Julian Jefferson, English cricketer"]}, {"page": "1948 Birthday Honours", "response": ["*Brigadier Julian Jefferson, late Foot Guards. Lately Commander, North Caribbean Area."]}]}}