{"wiki_id": "http://www.wikidata.org/entity/Q1275884", "itemLabel": "Godfrey Brown", "itemDescription": "athletics competitor", "wikipedia_url": "https://en.wikipedia.org/wiki/Godfrey_Brown_(athlete)", "wikipedia_page": {"main": "Arthur Godfrey Kilner Brown (21 February 1915 – 4 February 1995) was a British athlete, winner of a gold medal in the 4 × 400 m relay at the 1936 Summer Olympics. He later became Headmaster of the Royal Grammar School Worcester, a post which he held from 1950 until his retirement in 1978.\nBorn in Bankura, Bengal, India, Godfrey Brown was a highly talented runner at distances from 100 yd (91 m) to the half-mile. He won the British AAA championships in 440 yd (400 m) in 1936 and 1938 and in 880 yd (800 m) in 1939.\n\nAt the Berlin Olympics, Brown was narrowly beaten by Archie Williams in the 400 m individual event, but Brown anchored the British 4 × 400 m relay team to a gold medal ahead of the United States.In 1937, Brown won 400 m at the World Student Games, with additional gold medals at both relays.At the 1938 European Championships, Brown won the individual 400 m, anchored the British 4 × 400 m relay team to a second place and won the bronze at 4 × 100 m relay.\nBrown was educated at Warwick School, where he was Head Boy from 1933 – 1934. In 1935 he went to study English and History at Peterhouse, Cambridge University and worked after graduation as a history master at Bedford School. Because his sight was poor he was not mobilized in the Army, staying as school master at Cheltenham College from 1943 to 1950. From 1950 till 1978, Brown was the headmaster of Worcester Royal Grammar School. He died in Sussex, aged 79.\nHis sister Audrey and brother Ralph were also notable athletes, Audrey winning a silver in 4 × 100 m relay at the 1936 Olympics and Ralph won the British AAA championships title in 440 yd (400 m) hurdles in 1934.", "link_mentions": [{"page": "Eric Liddell", "response": ["His performance in the 400-metre race in Paris stood as a European record for 12 years, until beaten by another British athlete, Godfrey Brown, at the Berlin Olympics in 1936."]}, {"page": "Royal Grammar School Worcester", "response": ["The house system was introduced in 1899 by the then headmaster Frederick Arthur Hillard. Initially six houses were established, and membership of houses was based on the place of residence of each boy. The original houses were: Boarders, Barbourne, City, St. John's, County A, and County B. In 1909 the house system was changed to reflect the increasing number of boys in the school, and the difficulty of allocating pupils on the basis of where they lived. The six houses created in 1909 were: School House, for boarders, (which, due to common usage, changed to Whiteladies, as this was the building in which the boarders lived); Temple (after Henry Temple, headmaster 1850s); Tudor (after Elizabeth I); Woolfe (after Richard Woolfe, benefactor 1877 ); Wylde (after Thomas Wylde, benefactor 1558); and Yewle (after Robert Yewle, Six Master 1561). In 1963 two additional houses were created by the then headmaster Godfrey Brown, namely Langley (after William Langley, Six Master 1561) and Moore (after John Moore, benefactor 1626).", "The most recent building work to a school building took place on the school's Performing Arts Centre. The Performing Arts Centre (formerly a gymasium), was extended to create three spaces: Studio 1 downstairs, Studio 2 upstairs, and the Godfrey Brown Theatre. An entrance was added to the back of the building and a car park was opened. This project cost the school £2.8 million.", "* Godfrey Brown Headmaster 1950–78, Olympic Gold Medallist."]}, {"page": "Bedford School", "response": ["*Godfrey Brown (1915–1995), History master, Olympic gold medal winner, 1936"]}]}}