{"wiki_id": "http://www.wikidata.org/entity/Q12791220", "itemLabel": "Ian David Erskine", "itemDescription": "(1898-1973)", "wikipedia_url": "https://en.wikipedia.org/wiki/Ian_Erskine", "wikipedia_page": {"main": "Major General Ian David Erskine  (17 March 1898 – 27 July 1973) was a senior British Army officer.", "link_mentions": [{"page": "Lord Cardross", "response": ["Several other members of this branch of the Erskine family have also gained distinction. John Erskine of Cardross, younger son of the second Lord, was a soldier and politician. John Erskine of Carnock, son of John Erskine of Cardross, was a noted jurist. John Erskine, leader of the Evangelical Party in the 18th century Scottish Church, was the son of John Erskine of Carnock by his first wife. John Elphinstone Erskine, grandson of James Erskine, son of James Erskine of Carnock by his second wife, was an admiral in the Royal Navy. Sir David Erskine, son of James Erskine, brother of John Elphinstone Erskine, was Serjeant at Arms of the British House of Commons between 1885 and 1915 and held several positions at the British court. James Francis Erskine (1862–1936), eldest son of Sir David Erskine, was a brigadier-general in the Scots Guards. His son Malcolm David Erskine (1903–1949), was a brigadier in the Scots Guards. Seymour Elphinstone Erskine (1863–1945), second son of Sir David Erskine, was an admiral in the Royal Navy. Walter Hugh Erskine (1870–1948), third son of Sir David Erskine, was Deputy Serjeant at Arms of the British House of Commons between 1929 and 1940. Ian David Erskine (1898–1973), son of Alan David Erskine, fourth son of Sir David Erskine, was a major-general in the British Army. Sir Arthur Erskine, fifth son of Sir David Erskine, was a soldier and courtier. Sir James Elphinstone Erskine, brother of Sir David Erskine, was an admiral of the fleet. George Elphinstone Erskine (1841–1912), son of George Keith Erskine, brother of John Elphinstone Erskine, was a major-general in the Bombay Cavalry in the Indian Army. His son by his second wife, Sir George Erskine, was a general in the British Army."]}, {"page": "1949 Birthday Honours", "response": ["*Major-General (local) (now Colonel) Ian David Erskine, C.B.E., D.S.O., late Foot Guards."]}, {"page": "1947 Birthday Honours", "response": ["* Major-General (local) Ian David Erskine, , (15319), late Scots Guards."]}]}}