{"wiki_id": "http://www.wikidata.org/entity/Q1282266", "itemLabel": "Ed Alleyne-Johnson", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Ed_Alleyne-Johnson", "wikipedia_page": {"main": "Ed Alleyne-Johnson (born 1959) is a British electric violinist and prolific busker. He has been busking since he was a Fine Art student at Oxford University in the early 1980s. He uses an electric violin he carved with a kitchen knife, a custom pedalboard and portable amplifier. This setup has enabled him to perform on the street in almost every major city in Europe, and across the United States and Canada.\nHe was a member of the English post-punk/alternative rock band New Model Army, recording and touring with them for five years, with several concerts in Germany among over 200 concerts worldwide. They supported acts such as Simple Minds, Bob Dylan, David Bowie, The Cure, Midnight Oil and Faith No More.", "link_mentions": [{"page": "New Model Army (band)", "response": ["Thunder and Consolation was released in February 1989, and saw the band moving towards a more folk-rock sound, especially on the tracks including violinist Ed Alleyne-Johnson.  Described as the band's \"landmark\" album, it reached number 20 in the UK charts, the singles \"Stupid Questions\" and \"Vagabonds\" making an impression in America, and the band was able to tour the album there with Alleyne-Johnson also providing additional guitar and keyboards.  At the end of the year however, Harris left the band, to be replaced by Peter \"Nelson\" Nice, who would play with the band for more than 20 years. 1990's Impurity continued the folk-driven theme with Alleyne-Johnson still to the fore and Adrian Portas joining the band on guitar.", "  bar:EdAJ      text:Ed Alleyne-Johnson"]}, {"page": "Ultraviolet (disambiguation)", "response": ["* Ultraviolet, a 1994 album by Ed Alleyne-Johnson, or the title track"]}, {"page": "Thunder and Consolation", "response": ["Thunder and Consolation was released in 1989 and is the fourth studio album by British rock band New Model Army. The album stands as a landmark in the New Model Army catalogue, being their most successful album to date and reaching No. 20 in the UK Albums Chart. It also saw the band gaining new musical grounds as they adopted a more folky sound with the assistance of violinist Ed Alleyne-Johnson. It was produced by Tom Dowd and the band.", "*Ed Alleyne-Johnson – violin"]}, {"page": "Impurity (New Model Army album)", "response": ["The album sees the band venturing further into the musical territory which they began exploring on their previous album, Thunder and Consolation (1989). Violinist Ed Alleyne-Johnson was again a collaborator. It also contained the guitar work of Adrian Portas.", "*Ed Alleyne-Johnson - violins"]}, {"page": "Raw Melody Men", "response": ["*Ed Alleyne-Johnson – violin, keyboards, mandolin"]}, {"page": "BBC Radio One Live in Concert (New Model Army album)", "response": ["*Ed Alleyne-Johnson – violin"]}, {"page": "List of electric violinists", "response": ["* Ed Alleyne-Johnson"]}, {"page": "List of performers on Later... with Jools Holland", "response": ["* Ed Alleyne-Johnson"]}, {"page": "List of Later... with Jools Holland episodes", "response": ["|Suede / Soul Asylum / Bryan Ferry / Fishbone / Ed Alleyne-Johnson"]}, {"page": "Rock violin", "response": ["* Ed Alleyne-Johnson (New Model Army) (1989-1995)"]}]}}