{"wiki_id": "http://www.wikidata.org/entity/Q128343", "itemLabel": "Lord Charles Bentinck", "itemDescription": "British politician (1780-1826)", "wikipedia_url": "https://en.wikipedia.org/wiki/Lord_Charles_Bentinck", "wikipedia_page": {"main": "Lord William Charles Augustus Cavendish-Bentinck (20 May 1780 – 28 April 1826), known as Lord Charles Bentinck, was a British soldier and politician and a great-great-grandfather of Queen Elizabeth II.", "link_mentions": [{"page": "Ahnentafel", "response": ["#Lord Charles Bentinck (3 October 1780 – 28 April 1826)"]}, {"page": "William Cavendish-Bentinck, 3rd Duke of Portland", "response": ["*Lord Charles Bentinck (20 May 178028 April 1826).The Register of Births and Baptisms in the Parish of St James within the Liberty of Westminster. 1761-1786. 17 June 1780. Paternal grandfather of Cecilia Bowes-Lyon, Countess of Strathmore and Kinghorne, grandmother to Queen Elizabeth II; ancestor of the 6th and 7th dukes of Portland, and of Lady Ottoline Morrell."]}, {"page": "Richard Wellesley, 1st Marquess Wellesley", "response": ["* Anne Wellesley (1788–1875), who married firstly Sir William Abdy, 7th Baronet, and secondly Lieutenant-Colonel Lord Charles Bentinck"]}, {"page": "Treasurer of the Household", "response": ["*Lord Charles Bentinck 1812–1826"]}, {"page": "Earl of Portland", "response": ["The fifth Duke died unmarried and was succeeded by his first cousin once removed, William Cavendish-Bentinck, 6th Duke of Portland, who was the only son from the first marriage of Lieutenant-General Arthur Cavendish-Bentinck, younger son of Lord Charles Bentinck, the third son of the third Duke. Charles' first son, also named Charles, was a maternal great-grandfather of Queen Elizabeth II. In 1880, the sixth Duke also succeeded his stepmother as second Baron Bolsover. He was a Conservative politician and served as Master of the Horse from 1886 to 1892 and from 1895 to 1905."]}, {"page": "Earl of Mornington", "response": ["The first earl was succeeded by his eldest son, Richard, the second earl. He used the original family surname of Wellesley in lieu of Wesley. He was a prominent soldier, diplomat and politician. In 1797 he was created Baron Wellesley, of Wellesley in the County of Somerset, in the Peerage of Great Britain, which entitled him to a seat in the British House of Lords. In 1799 he was further honoured when he was made Marquess Wellesley, of Norragh, in the Peerage of Ireland. However, he was said to be bitterly disappointed at not receiving a dukedom or at least an English peerage of high rank. He referred to his Irish marquessate as a \"double-gilt potato\". Lord Wellesley had several children by his French mistress, Hyacinthe-Gabrielle Roland (they were married in 1794 after the birth of their children). One of them, Anne, married as her second husband Lord Charles Bentinck. They were great-great-grandparents of Queen Elizabeth II."]}, {"page": "William Bentinck, 4th Duke of Portland", "response": ["Portland was the eldest son of Prime Minister William Cavendish-Bentinck, 3rd Duke of Portland and Lady Dorothy, daughter of William Cavendish, 4th Duke of Devonshire and Charlotte Boyle, Baroness Clifford. He was the elder brother of Lord William Bentinck and Lord Charles Bentinck."]}, {"page": "List of Privy Counsellors (1714–1820)", "response": ["*Lord Charles Bentinck (1780–1826)"]}, {"page": "Bentinck family", "response": ["************Lord Charles Bentinck (1780–1826), British soldier and politician; married to Lady Charles Bentinck (1788–1875)"]}, {"page": "William Cavendish-Bentinck, 6th Duke of Portland", "response": ["Portland was the son of Lieutenant-General Arthur Cavendish-Bentinck by his first wife Elizabeth Sophia Hawkins-Whitshed, daughter of Sir St Vincent Hawkins-Whitshed, 2nd Baronet and granddaughter of Admiral Sir James Hawkins-Whitshed, 1st Baronet. His paternal grandparents were Lord Charles Bentinck and his second wife Anne Wellesley, the natural daughter of Richard Wellesley, 1st Marquess Wellesley. His great-great-uncle was Arthur Wellesley, 1st Duke of Wellington. Lord Charles was the third son of Prime Minister William Cavendish-Bentinck, 3rd Duke of Portland by his wife Lady Dorothy Cavendish, daughter of William Cavendish, 4th Duke of Devonshire and Lady Charlotte Boyle. Portland's mother died only a few days after his birth. He was educated at Eton. He inherited the Cavendish-Bentinck estates, based around Welbeck Abbey in Nottinghamshire, from his cousin William Cavendish-Scott-Bentinck, 5th Duke of Portland, in 1879. He also succeeded his stepmother as second Baron Bolsover in 1893. His half-sister Lady Ottoline Morrell was a society hostess and patron of the arts associated with the Bloomsbury Group."]}, {"page": "Baron Bolsover", "response": ["Baron Bolsover, of Bolsover Castle in the County of Derby, was a title in the Peerage of the United Kingdom.Debrett's Peerage and Baronetage (1967 edition) p2023 It was created on 23 April 1880 (as Baroness Bolsover) for Augusta Cavendish-Bentinck, with remainder to the heirs  male of the body of her late husband Lieutenant-General Arthur Cavendish-Bentinck (1819–1877), younger son of Lord Charles Bentinck, third son of William Cavendish-Bentinck, 3rd Duke of Portland.thePeerage.com Lady Bolsover was the daughter of the Very Reverend Henry Montague Browne, Dean of Lismore, second son of James Caulfeild Browne, 2nd Baron Kilmaine.DEATH OF THE BARONESS BOLSOVER Nottinghamshire Guardian (London, England), Saturday, August 12, 1893; pg. 5; Issue 2517 She was succeeded according to the special remainder by her stepson William Cavendish-Bentinck, 6th Duke of Portland, who became the second Baron Bolsover. He was the only child from Arthur Cavendish-Bentinck's first marriage, to Elizabeth Sophia Hawkins-Whitshed."]}, {"page": "Ashburton (UK Parliament constituency)", "response": ["|rowspan=\"2\"| Lord Charles Bentinck"]}, {"page": "Charles Cavendish-Bentinck (priest)", "response": ["Born at Kensington, Bentinck was the elder son of Lieutenant Colonel Lord Charles BentinckCharles Cavendish   and of Anne Wellesley, formerly Lady Abdy.Anne Wellesley   He had a younger brother, Arthur Cavendish Bentinck, and two sisters, Anne and Emily. His was frequently addressed as William or William-Charles to distinguish him from his father. Later in life, he presented his name as William Charles Cavendish Bentinck, resulting in his unique \"W. C. C. Bentinck\" signature. He rarely used the double-barreled Cavendish-Bentinck surname."]}, {"page": "Sir William Abdy, 7th Baronet", "response": ["On 3 July 1806, he married Anne Wellesley, eldest and illegitimate born, later legitimitated, daughter of Richard Wellesley, 1st Marquess Wellesley and Hyacinthe-Gabrielle Roland, at Hyde Park Corner. At some point during their marriage, she became lover of Lord Charles Bentinck and as result Abdy and his wife were divorced in 1816. He never remarried and died aged 89, without legitimate issue, at Hill Street, London. With his death the baronetcy became extinct."]}, {"page": "Louisa Cavendish-Bentinck", "response": ["Louisa Burnaby married the Rev. Charles Cavendish-Bentinck, as his second wife, on 13 December 1859.Almanach de Gotha (1922) (Justus Perthes, Gotha); Almanach de Gotha (1904) (Justus Perthes, Gotha)  Rev. Cavendish-Bentinck was the elder son of Lieutenant Colonel Lord Charles Bentinck and Anne Wellesley, formerly Lady Abdy.Anne Wellesley   His paternal grandparents were William Cavendish-Bentinck, 3rd Duke of Portland, Prime Minister of Great Britain, and Dorothy Cavendish, a daughter of William Cavendish, 4th Duke of Devonshire.  Together Louisa and Charles were the parents of three children:"]}, {"page": "Lord Cavendish-Bentinck", "response": ["#REDIRECT Lord Charles Bentinck"]}, {"page": "Charles Bentinck", "response": ["* Lord Charles Bentinck (1780–1826), father of the priest, hence great-great-grandfather of Elizabeth II"]}, {"page": "Lord Bentinck", "response": ["* Lord Charles Bentinck (1780–1826), British soldier and politician"]}, {"page": "Lord William Charles Cavendish-Bentinck", "response": ["#REDIRECT Lord Charles Bentinck"]}, {"page": "Lady Anne Cavendish-Bentinck", "response": ["Anne was related to Queen Elizabeth II and her surname was shared with the latter's maternal grandmother Cecilia Bowes-Lyon, Countess of Strathmore and Kinghorne; they shared a great-great grandfather Lord Charles Bentinck."]}, {"page": "Lord Charles Augustus Cavendish-Bentinck", "response": ["#REDIRECT Lord Charles Bentinck"]}, {"page": "Liverpool ministry", "response": ["| Lord Charles Bentinck"]}, {"page": "Lord William Charles Augustus Cavendish-Bentinck", "response": ["#REDIRECT Lord Charles Bentinck"]}, {"page": "Lord William Cavendish-Bentinck", "response": ["#REDIRECT Lord Charles Bentinck"]}, {"page": "List of United Kingdom by-elections (1806–1818)", "response": ["|rowspan=2|6 August 1812||rowspan=2|Ashburton||u||Lord Charles Bentinck||Lord Charles Bentinck||Treasurer of the Household"]}, {"page": "Dorothy Bentinck, Duchess of Portland", "response": ["*Lord Charles Bentinck (3 October 1780 – 28 April 1826). Paternal grandfather of Cecilia Bowes-Lyon, Countess of Strathmore and Kinghorne"]}]}}