{"wiki_id": "http://www.wikidata.org/entity/Q1282096", "itemLabel": "Robert Thornton", "itemDescription": "Scottish darts player", "wikipedia_url": "https://en.wikipedia.org/wiki/Robert_Thornton_(darts_player)", "wikipedia_page": {"main": "Robert 'Bob' Thornton (born 17 July 1967) is a Scottish professional darts player.\nThornton is a three-time major winner between the BDO and PDC, having won the World Masters in 2007, UK Open in 2012, and World Grand Prix in 2015. He is also a former finalist at the Players Championship Finals in 2009 and Grand Slam of Darts in 2013. In addition, Thornton has reached three World Championship quarter-finals across both organisations and was a participant in the Premier League in 2013, 2014 and 2016.", "link_mentions": [{"page": "Phil Taylor (darts player)", "response": ["In June, Taylor looked on course to win his fifth UK Open title after registering convincing wins over Ronnie Baxter, Terry Jenkins and Denis Ovens to book a place in the final against Robert Thornton. Taylor won the first two legs, but the Scot then won nine of the next 10 before closing out the match 11–5. Taylor had missed a total of 23 darts at doubles and, in doing so, suffered his sixth defeat in a major PDC final out of the 72 he had contested. Taylor then played in his first European Tour event and gained revenge for his defeat in the World Championship by beating Chisnall 6–2 in the final. He had beaten Raymond van Barneveld 6–5 in the quarter-finals and Wes Newton 6–3 in the semis at the event in Berlin. In July, Taylor walked off the stage at the Shetland Open during a semi-final match with Raymond van Barneveld.", "Taylor was involved in a high quality darts match in the semi-finals of the Grand Slam of Darts against Lewis as he averaged 109.76 to Lewis' 110.99 (the highest recorded combined average) in a 16–9 win. Taylor's finishing in the high scoring match proved to be the difference and included checkouts of 167 and 160. The players hit 32 180s between them breaking the PDC record of 31 which was set in the 2007 World Championship final, a match which had 32 more legs than this one. Both players described the game as the greatest they had been involved in afterwards. The final proved to be a more low-key affair as Taylor gained revenge over Robert Thornton for his loss in the 2012 UK Open to win 16–6 and seal his fifth Grand Slam title."]}, {"page": "Ted Hankey", "response": ["Hankey was drawn in Group B of the 2012 Grand Slam of Darts with Michael van Gerwen, Robert Thornton and Steve Beaton. He was whitewashed 0–5 by Thornton but defeated Beaton 5–3 to stay alive in the group. However, requiring a 5–0 or 5–1 victory over Van Gerwen in his last game to have a chance of progressing, Hankey visibly struggled with a three-dart average of 59, missing five successive shots at a single in the first leg (including two that missed the board completely) to set up a double. Hankey was then seen rubbing his left eye repeatedly and losing his balance, and Van Gerwen eventually won the match 5–0 with a 90 average. Two days later it was revealed that Hankey had suffered a 'stroke', had very high cholesterol and diabetes and needed six to eight weeks' rest, which ruled him out of the qualifier for the 2013 World Championship."]}, {"page": "Saltcoats", "response": ["* Robert Thornton, professional darts player"]}, {"page": "Nine-dart finish", "response": ["To date, Adrian Lewis is the only player to hit a nine-darter in a World Championship final, doing so during the 2011 PDC World Darts Championship final against Gary Anderson. In 2013, Terry Jenkins and Kyle Anderson were the first players to hit a nine-darter on the same day, doing so on the second day of the 2014 PDC World Darts Championship. Wade and Robert Thornton were the first players to both achieve a perfect leg in the same match, doing so during the 2014 World Grand Prix. In 2021, William Borland became the first player to win a televised match by hitting a nine-darter in the final leg, defeating Bradley Brooks in a sudden-death leg during the opening round of the 2022 PDC World Darts Championship.", "In October 2014 at the 2014 World Grand Prix, James Wade followed soon after by Robert Thornton became the first players to both hit a nine-darter in the same match. This tournament was double-in double-out, meaning the 2nd and 3rd televised double-in double-out nine-dart-finishes were hit in the same match. This also makes James Wade the only man ever to have hit a 'standard' nine-darter and a double-in double-out nine-darter.", "| James Wade  ||  Robert Thornton", "| Robert Thornton ||  James Wade", "!scope=\"row\" | Robert Thornton", "| Brendan Dolan, James Wade, Robert Thornton"]}, {"page": "Raymond van Barneveld", "response": ["In his third World Cup of Darts and first with Michael van Gerwen, the Dutch pair suffered a shock in the last 16 when they were beaten 5–3 by the Finnish duo of Jani Haavisto and Jarkko Komula. Van Barneveld was never out of the top four in the Premier League during all 14 weeks of the league phase. He won 10 out of his 16 games to finish second in the table which set up a semi-final meeting with Taylor against whom he had lost 7–3 and drawn with 6–6 in their two league clashes. From level at 3–3 in the semi-final, Taylor stormed away to win 8–4 to deny Van Barneveld his first Premier League final. Van Barneveld reached the final of the non-ranking Dubai Masters thanks to 10–6 and 11–5 wins over Adrian Lewis and James Wade. He faced Van Gerwen and was beaten 7–11. Van Barneveld defeated defending champion Robert Thornton in the last 16 of the 2013 UK Open and survived one match dart from Ronnie Baxter in the quarter-finals to win 10–9. His semi-final against Andy Hamilton went into a last leg decider, with Van Barneveld missing a total of six darts for the match to lose 10–9. He lost in the second round of the European Championship and World Matchplay to Thornton and Justin Pipe respectively. Van Barneveld put his bad form behind him in October by securing his first ranking title of 2013 at the tenth Players Championship of the year with a 6–3 defeat of Peter Wright in the final. However, less than a week later in the second round of the World Grand Prix he was beaten 3–0 by Michael van Gerwen in 21 minutes. In the defence of his Grand Slam of Darts title he beat Ricky Evans and Tony O'Shea, but lost his final group game against Mervyn King to be knocked out of the competition on leg difference."]}, {"page": "Professional Darts Corporation", "response": ["An additional 19 players have won a single title. That list is composed of Justin Pipe, Raymond van Barneveld, Adrian Lewis, Simon Whitlock, John Part, Wes Newton, Steve Beaton, Gary Anderson, Vincent van der Voort, Mervyn King, Robert Thornton, Alan Norris, Max Hopp, Jonny Clayton, Daryl Gurney, Jamie Hughes, Krzysztof Ratajski, Devon Petersen and José de Sousa."]}, {"page": "John Part", "response": ["At the European Darts Trophy  in Sindelfingen (Germany) Part reached the quarter finals after defeating Vincent van der Voort, Robert Thornton and Ronnie Baxter. Dutchman Michael van Gerwen ended his chance to win a second successive European Tour event."]}, {"page": "Mark Walsh (darts player)", "response": ["At the 2012 World Championship he came from a set down to defeat Warren French, 3–1 in the first round. Walsh played Kevin Painter in the Last 32 and came back from 1–3 to level the match at 3–3. He couldn't keep his momentum going, however, as he lost the deciding set by 3 legs to 0 to exit the tournament 3–4. At the World Matchplay, Walsh beat Colin Osborne 10–8 in the first round, before being comprehensively beaten 4–13 by James Wade in the last 16. Despite winning the first set in his first round match against Robert Thornton at the World Grand Prix, he only took one more leg and lost 1–2. Walsh qualified from Group 8 of the Championship League with a 6–5 victory against Steve Beaton. However, he finished bottom of the eight man Winners Group, winning just one of his seven matches. Walsh was whitewashed 0–5 in his opening Group H game of the Grand Slam of Darts, but came back to defeat both Wayne Jones and Christian Kist 5–4. However, his heavy defeat and narrow wins meant that he failed to qualify for the knockout stage on leg difference. After all 33 ProTour events of 2012 had been played, Walsh was 23rd on the Order of Merit, inside the top 32 who qualified for the Players Championship Finals. He was beaten 1–6 by Thornton in the first round.", "In October, Walsh reached the quarter-finals of a Pro Tour event for the first time in a year at the 11th Players Championship as he beat the likes of Andy Hamilton and Newton, before his run was ended with a 6–4 defeat against Robert Thornton. He lost 5–0 to Robert Thornton and 5–1 to Andy Hamilton at the Grand Slam of Darts, before a consolation 5–2 victory over Justin Pipe but Walsh was already resigned to finishing bottom of the group."]}, {"page": "Kevin Painter", "response": ["In October, Painter made it through to his first PDC ranking final since his major success almost two years ago at the 12th Players Championship of the season. From the last 16 onwards he defeated Robert Thornton, Wes Newton and Michael Smith, but was whitewashed 6–0 by Kim Huybrechts in the final."]}, {"page": "British Darts Organisation", "response": ["BDO number 1 Robert Thornton decided to move to the PDC in May 2008. Gary Anderson and Mark Webster were the BDO's two top ranked players when they signed with the PDC in January 2009. 2008 Lakeside runner-up Simon Whitlock also signed with the PDC in 2009. Weeks after winning the Lakeside title in January 2014, Stephen Bunting became the first reigning BDO champion to join the PDC. Three-time defending champion Glen Durrant followed suit in 2019 after winning a PDC tour card at Q School, declaring it \"as good as winning the championship at Lakeside.\" John Part (1997), Richie Burnett (2000), Ted Hankey  (2012), Les Wallace (2013), Christian Kist (2014), and Scott Waites (2020) are the other past BDO champions who subsequently switched to the PDC."]}, {"page": "Mervyn King (darts player)", "response": ["At the World Grand Prix in October, King reached his first major final in two years. In his first round match against Terry Jenkins, King survived five missed match darts from his opponent to edge the game 2–1 in sets, and then saw off Dave Chisnall (3–1) and Robert Thornton (3–0 in 31 minutes) to meet home favourite Brendan Dolan in the semi-finals. King came back from 0–2 down in the first set to take it and from there was in control of the match as he won 5–2 and met Michael van Gerwen in the final. King led 3–0 and 4–1 in the final, but from there on only won three more legs as he lost the match 4–6. King afterwards admitted he was unhappy with the crowd, as they were loudly booing his starting and finishing doubles, but the £40,000 runner-up prize saw him climb to 13th in the world.", "King lost in the first round of the PDC World Championship for the first time in its 2013 edition 2–3 to Dean Winstanley. The match has been described as a classic with both players missing darts to win before Winstanley took the deciding set 6–4. His first final of the year came at the eighth UK Open Qualifier in April, having won seven games including defeats over James Wade, Wes Newton and Robert Thornton, but he was then whitewashed 0–6 by Michael van Gerwen. He was the seventh seed for the UK Open itself. King reached the final of the Austrian Darts Open by beating Joe Cullen 6–0 in the quarter-finals with an average of 103.66 and Steve Beaton 6–5 in the semis. He faced van Gerwen once more in the final and was defeated 3–6. He also played van Gerwen in the third round of the UK Open and was defeated 5–9. King's second European Tour final of the year came in September at the German Darts Masters where he edged past Peter Wright 6–5 in the third round, whitewashed James Wade 6–0 in the quarter-finals and beat Wayne Jones 6–4 in the semis. He faced Steve Beaton and with the final on throw with Beaton 4–3 ahead King incredibly burst his score when on 134 as he hit a treble 20 with his last dart instead of a single to leave 40. Beaton replied by finishing 160 and, even though King fought back to take the match into a deciding leg, he never had a dart for the title as Beaton won 6–5. King could not replicate his performances at the World Grand Prix from last year as he was defeated 2–0 in sets by Wayne Jones in the first round."]}, {"page": "Dennis Priestley", "response": ["In 2012, Priestley qualified for the 2012 UK Open, where he lost in the fifth round to eventual winner Robert Thornton. He also qualified for his first European Tour Event, the Dutch Darts Masters, and was beaten 3–6 by Andy Smith in the first round. In November, Priestley reached the final of the Players Championship 17 in Crawley, where he was beaten 2–6 by Simon Whitlock, having defeated an in-form Michael van Gerwen 6–1 in the semi-finals, despite his opponent averaging 105. His run to the final and successive quarter-final defeats in the last two events secured his qualification for the World Championship in December through the ProTour Order of Merit. He played Ronnie Baxter in the first round and lost 1–3.", "Priestley only entered a handful of events in 2013 and his best finish came in May at the third Players Championship where he lost 6–2 in the quarter-finals to Robert Thornton. Despite this, he still had a tour card for 2014, as he was world number 51 at the start of the season, inside the top 64."]}, {"page": "Anastasia Dobromyslova", "response": ["Dobromyslova made headlines when she qualified for the 2008 UK Open, a PDC major tournament, by winning through the Pub Qualifiers event, beating Darren Place 5–2 and Pete Galloway 5–0. In the first round, she was drawn to play Robert Thornton, who was also a BDO player who won through the Pub Qualifiers, and was the reigning World Masters champion. Thornton narrowly won 6–5.", "Dobromyslova represented Russia in the first ever PDC World Cup of Darts along with Konchikov.  The pair beat Gibraltar, paired by Dylan Duo and Dyson Parody, in the first round, before losing to Scotland's Gary Anderson and Robert Thornton."]}, {"page": "Martin Atkins (darts player, born 1965)", "response": ["* 2005: 1st round (lost to Robert Thornton 0–3)"]}, {"page": "Adrian Lewis", "response": ["Lewis reached the final of the 2011 PDC World Darts Championship courtesy of victories over Tony Eccles, Mark Dudbridge, Robert Thornton, Vincent van der Voort and Mark Webster en route to the final, where he played Gary Anderson. The match-up ensured that, for the first time, the winner of the PDC World Championship would not have previously succeeded in the rival BDO World Championship. Lewis himself became the only player to have reached the PDC final without playing full-time on the BDO circuit.", "He almost exited the tournament on multiple occasions, beginning with his first round match against Nigel Heydon. He trailed 0–2 and was stung by a wasp during a break on his non-throwing hand, but nevertheless managed to claw his way back to 2–2. Heydon led 2–1 in the deciding set, but never had a dart for the match as Lewis won four of the last five legs to avoid an early exit. More comfortable victories ensued over Robert Thornton (4–2) and Wayne Jones (4–0), with Lewis seemingly heading for the semi-finals as he led Terry Jenkins 3–0 in the last 8, having only lost 2 legs. However, his opponent stormed back to level the match, before Lewis rediscovered his form to win the last two sets and clinch a 5–3 win. He said after the match that he had \"lost his way\" during Jenkins' fightback, but was delighted to be in the semi-finals.", "Lewis lost in the last 32 of the UK Open 7–9 to Wes Newton, and in the final of the seventh Players Tour Championship of the season, 3–6 to Ronnie Baxter. Lewis entered the World Matchplay knowing that if he could progress further than Phil Taylor he would move to world number one for the first time. He began with a 10–0 whitewash of Robert Thornton and a 13–7 victory over Andy Smith, but was then beaten 12–16 by Terry Jenkins in the quarter-finals to remain second in the world. In September, Lewis won his first individual title since his World Championship win at the fourth European Tour event, the German Darts Masters in Stuttgart. He dropped just three legs in his first three games before beating Tony West 6–3 in the quarter-finals and James Wade 6–1 in the semis to face occasional practice partner Ian White in the final. Lewis won 6–3 to claim his first European Tour title. After losing his opening two games of the Grand Slam of Darts to Tony O'Shea and John Part, Lewis failed to qualify from his group for the fourth time in the six stagings of the tournament. After all 33 ProTour events of 2012 had been played, Lewis finished 11th on the Order of Merit to qualify for the Players Championship Finals. Lewis had spent 24 hours with his wife Sarah as she went into labour, before travelling to the tournament in Minehead to face Richie Burnett. With Lewis leading 5–3, the pair were involved in a heated argument on stage as Burnett accused him of clicking his darts while he was throwing. Lewis took out 116 in the next leg to take the match, before returning to Stoke where Sarah gave birth to a boy in the early hours of the morning. Lewis once again returned to Minehead to face Taylor on only five hours sleep in 48 hours and lost 7–10.", "Lewis won his third major title at the European Championship, his first that wasn't a World Championship. He beat Mensur Suljović in the first round then averaged over 100 in his last four matches, including victory over Michael van Gerwen in the semi-finals, maintaining his high standard for 63 successive legs, which culminated in an 11–6 victory over Simon Whitlock in the final. Lewis beat Ronny Huybrechts, Brendan Dolan and Andy Hamilton at the World Matchplay to once again face van Gerwen in the semi-finals of a major event. The match was played at a frenetic pace as the 32 legs took 52 minutes, with Lewis hitting 16 180's and fighting back from 14–15 down to win 17–15. In his first Matchplay final Lewis played Phil Taylor and averaged 105.92 and hit 19 maximums, but Taylor averaged 111.23 to take the match 18–13. In October, Lewis won his first Pro Tour title in over a year at the ninth Players Championship as he came from 3–0 down in the final to beat Brendan Dolan 6–4. Lewis almost pulled out of the inaugural Masters tournament due to a bout of flu before edging past Kim Huybrechts in the first round 6–5 and then thrashing home favourite Robert Thornton 8–2. His semi-final match with Raymond van Barneveld was the best of the event as he took out a 116 finish in the final leg to break throw and win 10–9. However, he only had 15 minutes to prepare for the final against Taylor and, although he averaged 108, he was 5–0 down at the first break. Lewis claimed his first leg of the final to trail 9–1 but the match was over in the next. Lewis overcame Van Gerwen and Kim Huybrechts in the last 16 and quarter-finals of the Grand Slam of Darts to meet Taylor in the semi-finals. What followed was the highest quality darts match ever played as Lewis averaged 110.99 over 25 legs to Taylor's 109.76 in a 16–9 defeat, the highest combined average ever recorded. Lewis was 8–7 up but missed darts at doubles to lose eight successive legs including one where both players had left 160 with Lewis wiring the double top only for Taylor to step in and take it out. The match broke the PDC record for 180's with 32, beating the old record set in the 2007 World Championship final where 31 were made in 32 more legs than this match.", "Lewis threw a nine-dart finish to win the opening set of his third round tie against Raymond van Barneveld at the 2015 World Championship. He went a set ahead three times but van Barneveld levelled on each occasion, with Lewis missing one match dart in the sixth set. Lewis lost his form in the deciding set to be defeated 4–3 failing to reach the quarter-final stage of the event for the first time since 2009. On the opening night of the Premier League, Lewis set his highest televised average of 113.80 in beating van Barneveld 7–1. A day later he claimed the first UK Open Qualifier by beating van Gerwen 6–1 and said afterwards that his play signalled his intent for the year ahead. He lost 6–5 in the final of the fifth event to Michael Smith. Lewis' UK Open reign ended when he was beaten 9–3 by Raymond van Barneveld in the third round. He took the third Players Championship with a 6–3 win over Robert Thornton in the final and lost 6–1 to Van Gerwen in the final of the next event. A 6–5 victory over Brendan Dolan saw Lewis claim the fifth event and he lost 6–3 to Keegan Brown in the final of the eighth. Despite his good start to the Premier League, Lewis could not win another match until the ninth week, which saved him from relegation by a point. Lewis would ultimately finish sixth in the table with five wins from his 16 games, which resulted in him missing the play-offs for the fourth year in a row. Lewis and Taylor advanced to the final of the World Cup and their match against the Scottish pairing of Gary Anderson and Peter Wright went to the final singles game in which Lewis beat Wright 4–1 to seal England's third title in the event. He suffered a surprise 13–10 loss to Gerwyn Price in the second round of the World Matchplay and was thrashed 11–3 by Taylor in the final of the Sydney Darts Masters. However, Lewis atoned for this soon afterwards by claiming his first World Series of Darts title at the Auckland Darts Masters as Van Barneveld missed five match darts in the final leg to allow Lewis to edge it 11–10. Lewis failed to get past the second round of the World Grand Prix for the fifth year in a row as he lost 3–0 to Mark Webster."]}, {"page": "Martin Adams", "response": ["In the second round he came up against Martin Phillips. It was easy pickings for Adams, who cruised to a 4–0 victory with Phillips paying the price for many missed doubles. In the quarter-finals he played a fiercely fought match against Masters champion Robert Thornton, whom he led at one time 4–2. Thornton fought back to make it 4–4 but Adams eventually took control of his visible nerves to win 5–4. Adams went on to lose in the semi-finals to number-one seed Mark Webster, who eventually won the tournament."]}, {"page": "James Wade", "response": ["At the 2013 World Championship, Wade beat Peter Hudson 3–0, Steve Beaton 4–2 and Vincent van der Voort 4–0 and then edged past Wes Newton 5–4 in the quarter-finals. He was 1–3 down to Michael van Gerwen in the semi-finals, who then hit a nine dart finish and was a double 12 away from becoming the first player to hit successive perfect legs. However, Wade won the set and then levelled the game at 3–3. Despite averaging 10 points lower than his opponent, which included hitting one 180 to van Gerwen's 14, Wade stayed in the match by taking out finishes at crucial times. But the pressure exerted on Wade eventually showed as he lost 4–6. Wade's best performance of the league stage of the Premier League came in week five when he averaged 105.73 during a 7–1 win over Robert Thornton, who had not lost any of his first four matches. Despite losing three matches in a row he went into the final night needing a positive result against Phil Taylor to qualify for the play-offs. He managed a 6–6 draw and after other results were favourable for Wade he finished fourth in the league to play van Gerwen in the semi-finals, who he had beaten 7–4 and lost to 5–7 during the league campaign. Wade uncharacteristically missed a plethora of darts at doubles, hitting just 20% during the match and, despite a brief fightback from 2–7 down, he would lose 4–8.", "Wade's match against Robert Thornton in the second round of the World Grand Prix is regarded as the best in the tournament's history. At 1–0 up in sets, Wade opened the next with the second ever double-start nine-dart finish and threw a 156 finish in the leg after. However, he went on to lose the set and the following one, before Thornton incredibly threw the game's second nine-darter to become the first players to have thrown a perfect leg in the same match in darts history. Thornton would miss four darts to win 3–1, with the tie instead going into a deciding set which Wade took to advance to the quarter-finals. Wade continued his run by beating Phil Taylor for the first time in a major knockout tournament and reached the final by fighting back from 3–1 down against Gary Anderson to win 4–3. Wade paid the price for missing doubles against Michael van Gerwen including three to win both the fifth and seventh sets as he fell short of claiming a hat-trick of Grand Prix titles with a 5–3 defeat. The following week, Wade won the 17th Players Championship by fighting back from 5–3 behind to beat Kim Huybrechts 6–5. He was denied a weekend double 24 hours later as Van Gerwen beat him 6–2 in the final of the 18th event.", "In October 2014, at the World Grand Prix against Robert Thornton, Wade hit scores of 160, 180 and 161 to become the second ever player to throw a double-start nine darter. Later in the match Thornton repeated the feat with the pair becoming the first players to both throw nine darters in the same match in the history of darts. Wade remains the only PDC player to achieve a televised 9 darter for double start and open start formats."]}, {"page": "World Grand Prix (darts)", "response": ["The double-start format also makes landing a perfect nine-dart finish even more difficult, as it limits the number of combinations and guarantees that a player must finish on the bullseye (unless they start with one). There were two famous near misses in the first two years, the first with Phil Taylor in the 1998 final against Rod Harrington, when Taylor was distracted by loud commentary from Sid Waddell just before throwing the eighth dart (which Taylor hit) before he missed the bullseye; and the second in the 1999 semi final, when Harrington missed the bullseye against Taylor. The first nine-darter in Grand Prix history was eventually completed by Brendan Dolan in the 2011 semi-final against James Wade. In 2014, James Wade and Robert Thornton both hit perfect legs in the same match, the first time this happened in any televised event. On all three occasions, the leg started with a score of 160 (starting on double 20), followed by 180, followed by finishing 161 with treble 20, treble 17, and bullseye.", "|  Robert Thornton ", "|Robert Thornton|| Scotland||align=center|1||align=center|0||align=center|1||align=center|8", "| Robert Thornton", "| Robert Thornton", "| Robert Thornton"]}, {"page": "Premier League Darts", "response": ["|align=center| 2016 ||align=right| Robert Thornton  75.68 ||align=center| 0–7 ||  Dave Chisnall 101.16", "|align=center| 2016 ||align=right| Robert Thornton  88.38 ||align=center| 0–7 ||  Phil Taylor 102.15"]}, {"page": "World Masters (darts)", "response": ["|  Robert Thornton"]}, {"page": "Michael van Gerwen", "response": ["Van Gerwen's third title of the year came at the 11th Players Championship, where he defeated Ian White 6–1 in the final with a 107.85 average. Van Gerwen was involved in an exceptional match in the last 16 of the European Championship as he was defeated by compatriot Raymond van Barneveld 9–10, despite averaging 104. Another Players Championship success followed with a 6–5 victory over Robert Thornton.", "At the PDC awards dinner in January 2013, van Gerwen won three awards; Young Player of the Year, PDPA Player of the Year and Fans' Player of the Year. In his first World Cup of Darts, he partnered van Barneveld and the Dutch pair suffered a shock in the last 16 when they were beaten 3–5 by the Finnish duo of Jani Haavisto and Jarkko Komula. Van Gerwen won his first tournament of 2013 at the first UK Open Qualifier of the year with a 6–2 victory over Dave Chisnall in the final. He completed a weekend double a day later by defeating Brendan Dolan also by a 6–2 scoreline in the second Qualifier. The win saw van Gerwen replace Wade as the world number three. His run continued by taking the third event with a 6–2 win against Michael Smith. Van Gerwen's first defeat on the 2013 Pro Tour came a day later when Robert Thornton beat him 4–6 in the semi-finals of the fourth Qualifier. His unbeaten run stood at 29 matches until this defeat. Despite losing in the semi-finals of the European Darts Trophy to Paul Nicholson in April, van Gerwen replaced Adrian Lewis as the world number two. He reached another final at the fifth UK Open Qualifier, beating Phil Taylor 6–2 along the way, but lost 1–6 to Simon Whitlock. Van Gerwen bounced back a day later to win the sixth event which included a 112.67 average in a 6–1 win over Michael Smith in the semi-finals and a 6–5 defeat of Kim Huybrechts in the final. He also won the final event with a 6–0 ten-minute thrashing of Mervyn King in the final, meaning he had won five of the eight Qualifiers. His sixth title of the year came a week later at the second Players Championship by beating Stuart Kellett 6–1 in the final.", "Van Gerwen's play continued as he won the European Darts Open in Düsseldorf, Germany, saving his best performance for the final where he beat Simon Whitlock 6–2 with an average of 106.68. Another title followed less than a week later as he won the non-ranking Dubai Darts Masters, taking out finishes of 170 and 164 during an 11–7 triumph over Raymond van Barneveld in the final. His 10th tournament win came in June at the Austrian Darts Open by beating Mervyn King 6–3 in the final. It was van Gerwen's fifth title in a row and he was on a run of 24 unbeaten games. He was the number one seed for the UK Open having earned £35,600 in the eight qualifying events, just over £25,000 ahead of Robert Thornton in second place. Van Gerwen stretched his unbeaten streak to 27 games before he met Taylor in the quarter-finals. Van Gerwen did not quite produce his best game as he was beaten 7–10.", "Van Gerwen progressed to the semi-finals of the 2015 World Championship, which included his then highest World Championship average of 105.26 in beating Robert Thornton in the quarters. He played Gary Anderson in the event for the second year in a row and once again trailed 3–1 before levelling at 3–3. However, he missed four darts to take the next set and instead saw his reign as world champion come to end with a 6–3 loss. Van Gerwen won the Masters by beating van Barneveld 11–6 in the final with an average of 112.49. He lost in the final of the first UK Open Qualifier 6–1 to Adrian Lewis, but atoned for this a day later by winning the second event by beating Vincent van der Voort 6–3. Van Gerwen also took the third event with a 6–1 triumph over James Wade which meant he had won 25 of 26 matches since the World Championship. He extended this to 30 out of 31 games when he won the German Darts Championship by defeating Anderson 6–2 in the final with an exceptional average of 117.94. Jelle Klaasen missed a total of ten match darts in the final of the fourth UK Open Qualifier to allow van Gerwen to win 6–5. A 31 consecutive game winning streak was ended by Terry Jenkins the next day.", "Van Gerwen won his first World Matchplay title by beating James Wade 18–12. It saw him overtake Wade as the PDC's second most successful player with nine major tournament wins, but still a long way behind Taylor who leads with 79. Michael Smith defeated van Gerwen 6–2 in the final of the European Darts Trophy, but he took the European Darts Matchplay seven days later with a 6–4 success over Chisnall in the final. Van Gerwen hit 18 180s in the final of the World Grand Prix against Robert Thornton, but ultimately missed too many doubles to be edged out 5–4 in sets. He looked set to lose a second successive major final when he trailed Gary Anderson 10–7 at the European Championship, but won the next four legs without allowing the Scot a dart for the match to win 11–10. It marked the first time van Gerwen had retained a major title.", "|  Robert Thornton", "|align=\"left\"|Robert Thornton"]}, {"page": "Richie Burnett", "response": ["At the German Darts Championship Burnett came through final leg deciders against James Richardson and Robert Thornton and then averaged almost 102 in beating Steve Brown 6–2. His best run of the year continued with a 6–4 quarter-final success over Jamie Caven before missing one match dart in the semis against Peter Wright to lose 6–5."]}, {"page": "John Walton (darts player)", "response": ["Walton opened his 2001 campaign with a 3–1 first round win over Ritchie Davies and averaged an excellent 100.62 during the match. He then beat Mervyn King 3–0 with another high average of 99.00. His quarter-final victory over Marko Pusa saw Walton achieve an incredible 14 consecutive legs. Not surprisingly, the result was a 5–0 whitewash. Walton then beat Wayne Mardle 5–3 in the semi-final and Ted Hankey 6–2 in the final to become World Champion and also one of only a few players to have held both the Winmau World Masters and World Championship simultaneously. He joined Eric Bristow, Phil Taylor, Richie Burnett and Bob Anderson as the fourth player to win them in the same season. Martin Adams and Stephen Bunting have since joined this elite group of players. He has enjoyed only moderate success since his 2001 World Championship victory – the defence of his title ended with a second round loss to Colin Monk and he went out in the second round to Davies in 2003. He did manage to reach the 2004 quarter-finals, but lost 1–5 to Raymond van Barneveld. In 2005 he lost to Darryl Fitton in the second round and he was knocked out by Stephen Roberts in 2006. Another second round defeat, this time to Gary Robson followed in 2007, and in 2008 he lost in the first round to the then-reigning Winmau World Masters champion Robert Thornton. He hasn't won any of the major open events since his successful year in 2001 when he took the British Open, British Classic, Belgium Open, Scottish Open and Portland Open. Overall his tournament success has dried up since winning the world title, but he continues to maintain a high world ranking by progressing to the quarter-final and semi-final stages of several Open darts events.", "* 2008: 1st round (lost to Robert Thornton 0–3)"]}, {"page": "Andy Hamilton (darts player)", "response": ["*2011: Second round (lost to Robert Thornton 0–4)"]}, {"page": "2007 in darts", "response": ["*18 – Robert Thornton surprises the field by clinching the 2007 Winmau World Masters in Bridlington. He beat Martin Adams, Martin Atkins and Darryl Fitton on his way to the title.", "*25 – Shaun Greatbatch wins the Swedish Open with a 4–1 victory over fellow Englishman Dave Prins. Greatbatch had beaten new World Masters winner Robert Thornton 4–2 in the last four. Sweden's Carina Ekberg beat Norway's Rachna David 4–3 for the women's title.", "|  Robert Thornton"]}, {"page": "Darren Webster", "response": ["In December 2013, Webster lost to James Wade in the first round of the 2014 World Championship, despite leading 2 sets to 1 (first to 3). He missed six darts to win the match, to which Wade responded in three straight legs, thus winning the match. He played in the World Matchplay for the first time since 2005 and was beaten 10–4 by Taylor in the first round. Webster's resurgence of form also saw him play in his first World Grand Prix and Grand Slam of Darts, but he lost in the opening round of the former and was defeated in all three of his group games in the latter. A final appearance in a major event of the year came at the Players Championship Finals where he missed two match darts in the deciding leg of the first round against Robert Thornton to lose 6–5."]}, {"page": "Terry Jenkins", "response": ["2009 was a good year for Jenkins. He started the year winning the Bobby Bourn Memorial Players Championship.2009 Players Championship Bobby Bourn Memorial. Despite not making the top 4 in the 2009 Premier League Darts, he made the quarter finals of both the 2009 Las Vegas Desert Classic and 2009 UK Open Darts. His best performance of the season came at the 2009 World Matchplay Darts where he lost in the final to Phil Taylor. As a result, Jenkins' entry into the 2010 Premier League Darts was guaranteed. Jenkins' good form continued in the 2009 World Grand Prix Darts, reaching the semi final, losing again to Taylor. He got through to the semi-finals of the 2009 Grand Slam of Darts following a sensational 10–9 win over James Wade in the 2nd round and then defeated Robert Thornton in the quarter-finals before he was beaten in the semis by Scott Waites.", "In March, Jenkins reached his eighth major PDC final at the UK Open. He beat James Wade 9–8 in the last 16, Brendan Dolan 10–4 in the quarter-finals, and sensationally beat world number one and world champion Michael van Gerwen 10–8 in the semi-finals. He was beaten 11–1 by Adrian Lewis (who averaged over 109) in the final. His run earned him £25,000 and secured his place in the top 20 on the PDC Order of Merit. Jenkins averaged 105.85 against Robert Thornton in the final of the eighth Players Championship, but was defeated 6–4. He won his first ranking title in two years at the 10th event by beating Stephen Bunting 6–3 in the final. Jenkins' second major final of the year came at the European Championship where he lost 11–4 to Van Gerwen, meaning he has now reached nine major finals without being crowned the champion. At the Players Championship Finals he knocked out Van Gerwen for the second time in a major event this season with a 10–7 success, but Wes Newton defeated Jenkins 10–5 in the quarter-finals."]}, {"page": "Colin Osborne", "response": ["In 2010, Osborne reached the semi-finals of the Players Championship Finals before losing to King. At the Grand Slam of Darts, Osborne lost his opening group match to Robert Thornton before beating Whitlock and Dave Chisnall to qualify for the knockout stages. He lost 10–3 to Gary Anderson in the last 16. He then reached the third round of the 2011 World Championship, and was 3–2 up against van Barneveld before losing 4–3."]}, {"page": "Gary Anderson (darts player)", "response": ["At the 2010 World Matchplay he produced the first whitewash for six years with a 10–0 thumping of fellow Scot Robert Thornton during their first round encounter. His second round encounter was against Jelle Klaasen, with Klaasen winning 14–12.", "Anderson represented Scotland along with Robert Thornton for the inaugural PDC World Cup of Darts in 2010 PDC World Cup of Darts. They entered the tournament in the second round as 4th seeds and beat Russia, paired by Anastasia Dobromyslova and Roman Konchikov, 6–2 to advance to the group stage, where they lost their opening group game to Wales pairing Mark Webster and Barrie Bates.  Having recovered to secure victory against Bill Davis and Darin Young of the United States, Anderson and Thornton went out after defeat to Spain's Carlos Rodriguez and Antonio Alcinas.", "In June, he completed his first live televised nine-dart finish in a 9–3 third round win over Davey Dodds at the UK Open. He lost in the next round to compatriot, and eventual winner of the event, Robert Thornton 7–9. He was then forced to take a month away from the sport due to problems focusing with his left eye, returning to play in the World Matchplay. There he played Dean Winstanley in the first round and, despite leading 5–0, lost the match 11–13. Anderson was banned by the Darts Regulation Authority for two European Tour events and the European Championship due to \"him failing to complete his match and his subsequent behaviour\" at the European Tour Event 2. In October, he lost in the final of the 14th Players Championship of the year, 5–6 to Robert Thornton in an all Scottish final. Anderson then won the non-ranking Irish Masters by beating Colin Osborne 6–1 in the final. He finished second in Group F of the Grand Slam of Darts to qualify for the last 16, where he faced Andy Hamilton. Despite averaging almost 102, Anderson lost 9–10 in a thrilling match. After all 33 ProTour events of 2012 had been played, Anderson was 26th on the Order of Merit, inside the top 32 who qualified for the Players Championship Finals. He saw off Wes Newton and Robert Thornton, but was then beaten 8–10 by Simon Whitlock in the quarter-finals.", "Anderson survived three match darts versus John Bowles in the second round of the 2013 World Championship to win in a deciding set, but was then comfortably beaten by Raymond van Barneveld 0–4 in 33 minutes as he missed a total of 23 darts at doubles. Because the ranking system works as a two-year rolling list based on prize money earned, Anderson lost the £100,000 from reaching the 2011 World Championship final and dropped to world number 11 after the tournament. Anderson partnered Robert Thornton for the third time at the World Cup of Darts and they were shocked by Spain 4–5 in the last 16. He threw a nine-dart finish in the third UK Open Qualifier during a first round win over Josh Payne, but lost in the following round 5–6 to Michael van Gerwen.", "Anderson comfortably beat Mark Dudbridge and Brendan Dolan in the 2014 World Championship to face Michael van Gerwen in the third round. He took advantage of a sluggish start from Van Gerwen to establish a 3–1 lead and also missed two darts to win the set he lost. However, Anderson's usual scoring power deserted him as he lost three sets in a row to exit the tournament. Anderson bemoaned the fact that he had been playing consistently well over the previous months but kept losing games he should win through silly mistakes. He then began the year by claiming his first ranking title in two and a half years at the German Darts Championship. Anderson recovered from 5–3 down to Justin Pipe in the final to win 6–5, surviving six match darts from his opponent in the process and said afterwards his goal for the year was to reclaim his ranking in the top eight. His good start to the year continued as he won the fifth UK Open Qualifier with a 6–2 defeat of Robert Thornton. At the UK Open itself he lost 9–7 to Ian White in the fifth round. Anderson's third title of the year came at the first Players Championship as he averaged 111.47 in beating Andrew Gilding 6–5 in a high quality final. Another tournament victory came a week later at the third event by edging out Phil Taylor 6–5, with Anderson describing afterwards that winning has become a habit again."]}, {"page": "Tony O'Shea", "response": ["In the 2008 World Championship, O'Shea defeated Steve Farmer in the first round, but was defeated by Winmau World Masters champion Robert Thornton in the second round.", "* 2008: 2nd Round (lost to Robert Thornton 2–4)"]}, {"page": "Darryl Fitton", "response": ["Fitton debuted in the BDO World Championship in 2003 as a qualifier, but lost 1-3 to fellow qualifier John Burton in the first round. In 2004, he returned to Lakeside, again hitting a 180 score with his very first turn. He reached the quarter-finals before being beaten by Andy Fordham, who went on to win the title. The following year, he reached the semi-finals, this time losing out to Raymond van Barneveld in a hard-fought 5-3 scoreline, as van Barneveld went on to win the title that year. After that, Darryl did not win a match at the World Championship for the next two years, losing to Martin Adams and Phill Nixon in the first round of the 2006 and 2007 championships respectively. Fitton did reach the final of the Winmau World Masters in 2007, leading Robert Thornton 5-2 before Thornton hit back to win 7-5.", "|  Robert Thornton"]}, {"page": "Tony West (darts player)", "response": ["* 2005: Second round: (lost to Robert Thornton 0–3)"]}, {"page": "Mark Webster (darts player)", "response": ["Webster was the Welsh captain for the inaugural 2010 PDC World Cup of Darts in which Barrie Bates was his partner. After beating New Zealand in their first game 6–4 Webster and Bates became the surprise package of the tournament topping their group in the next stage which included wins over the Scottish pairing of Gary Anderson and Robert Thornton and the Spanish team of Carlos Rodriguez and Antonio Alcinas who had knocked out the England team consisting of world number one and two Phil Taylor and James Wade. This meant that they played the Australian team of Simon Whitlock and Paul Nicholson in the Semi-finals. A 6–5 win for Webster over Nicholson in the opening match proved crucial as it kept them in the match after the other 3 matches were won by Australia taking the match the doubles match. They won this 6–4 which meant that the match would go to a sudden death leg to decide who went to the final. Despite Australia winning the throw for the bull and opening with a 180 from Whitlock consecutive 140's from Wales got them back in the match. Bates then held his nerve to take out a 116 to take them to the final which also went to the doubles match after Webster defeated Co Stompé and Raymond van Barneveld back to back with a 100+ average in each match. However they lost the doubles 8–5 to finish runners up in the tournament."]}, {"page": "Grand Slam of Darts", "response": ["|style=\"text-align:left\"|  Robert Thornton ", "| Robert Thornton"]}, {"page": "Wayne Jones (darts player)", "response": ["* 2009: First round (lost to Robert Thornton 1–3)"]}, {"page": "Simon Whitlock", "response": ["On his World Matchplay debut in 2010, Whitlock reached the semi-finals before losing to Phil Taylor.  At the 2010 Grand Slam of Darts, he lost all three of his group matches against Dave Chisnall, Colin Osborne and Robert Thornton.", "His European Championship win in 2012 earned him a spot in the 2013 Premier League. Whitlock could only win three of his first nine games to avoid relegation by just one point after week nine. Consecutive wins over Robert Thornton, Andy Hamilton and Michael van Gerwen followed to improve Whitlock's chances of securing a play-off spot, and he went into the final night needing wins from matches against Adrian Lewis and Raymond van Barneveld. However, he could only draw 6–6 with Lewis and lost 4–7 to van Barneveld to finish the season sixth in the table.", "Whitlock's disappointing play continued into the 2015 World Championship when he was beaten 3–1 by Darren Webster in the first round, hitting just 17% of his doubles in the process. Whitlock did not receive a wildcard to compete in the Premier League, meaning he missed the event for the first time since 2009. He lost 9–5 against Robert Thornton in the third round of the UK Open. Whitlock and Nicholson were knocked out in the quarter-finals of the World Cup following a 4–2 doubles defeat against Belgium."]}, {"page": "Wes Newton", "response": ["At the first UK Open qualifier in February, Newton beat Kim Huybrechts 6–3 in the final to receive £6,000. He also beat Kevin Dowling, Andy Brown, Robert Thornton, Jerry Hendriks and Richie Howson on the way to the final.http://www.pdc.tv/page/NewsdeskDetail/0,,10180~2607377,00.html He also won the eighth qualifier three months later with a 6–2 victory over Justin Pipe in the final. In the UK Open itself he lost to eventual winner Robert Thornton in the quarter-finals. At the World Matchplay, Newton beat James Hubbard 10–5 in the first round, before throwing the first televised nine-dart finish of his career in the 11th leg of his last 16 match against Justin Pipe. However, despite being 9–7 up in the game, he went on to lose 10–13."]}, {"page": "Scott Waites", "response": ["Waites had a lower-profile season in 2013–14, suffering early exits in the Winmau Masters and Zuiderduin Masters and not being selected to defend his WDF World Cup singles title. He did enjoy another good run at the PDC Grand Slam, reaching the semi-finals before being defeated by Robert Thornton. However, his season ended in disappointment when, as the defending champion, he was eliminated in the first round of the 2014 BDO World Darts Championship 3–0 by eventual runner-up Alan Norris. It was the first time Waites had lost in the first round of the world championship, and afterwards he complained of a lack of preparation due to injuries as well as a power-cut shortly before his match started, though he still gave credit to Norris for his performance."]}]}}