{"wiki_id": "http://www.wikidata.org/entity/Q1282562", "itemLabel": "Mark Kermode", "itemDescription": "English film critic", "wikipedia_url": "https://en.wikipedia.org/wiki/Mark_Kermode", "wikipedia_page": {"main": "Mark James Patrick Kermode (, KUR-moh-d; né Fairey; born 2 July 1963) is an English film critic and musician. He is the chief film critic for The Observer, contributes to the magazine Sight & Sound, presents the BBC Four documentary series Mark Kermode's Secrets of Cinema, co-presents the BBC Radio 5 Live show Kermode and Mayo's Film Review, and previously co-presented the BBC Two arts programme The Culture Show. Kermode is a member of the British Academy of Film and Television Arts. Kermode is a founding member of the skiffle band the Dodge Brothers, for which he plays double bass.", "link_mentions": [{"page": "Blade Runner", "response": [": Directed by Andrew Abbott and hosted/written by Mark Kermode. Interviews with production staff, including Scott, give details of the creative process and the turmoil during preproduction. Insights into Philip K. Dick and the origins of Do Androids Dream of Electric Sheep? are provided by Paul M. Sammon and Hampton Fancher."]}, {"page": "Blue Velvet (film)", "response": ["Mark Kermode walked out on the film and gave the film a poor review upon its release, but revised his view of the film over time. In 2016, he remarked, \"as a film critic, it taught me that when a film really gets under your skin and really provokes a visceral reaction, you have to be very careful about assessing it ... I didn't walk out on Blue Velvet because it was a bad film. I walked out on it because it was a really good film. The point was at the time I wasn't good enough for it.\""]}, {"page": "David Lynch", "response": ["After Wild at Heart's success, Lynch returned to the world of the canceled Twin Peaks, this time without Frost, to create a film that was primarily a prequel but also in part a sequel. Lynch said, \"I liked the idea of the story going back and forth in time.\"Lynch and Rodley 2005. p. 187. The result, Twin Peaks: Fire Walk with Me (1992), primarily revolved around the last few days in the life of Laura Palmer, and was much \"darker\" in tone than the TV series, with much of the humor removed, and dealing with such topics as incest and murder. Lynch has said the film is about \"the loneliness, shame, guilt, confusion and devastation of the victim of incest\". The company CIBY-2000 financed Twin Peaks: Fire Walk with Me, and most of the TV series' cast reprised their roles, though some refused and many were unenthusiastic about the project.Lynch and Rodley 2005. pp. 184–187. The film was a commercial and critical failure in the United States but a hit in Japan, and some critics, such as Mark Kermode, have called it Lynch's \"masterpiece\"."]}, {"page": "Director's cut", "response": ["The film Justice League was begun by Zack Snyder, who completed principal photography but was unable to complete the project due to family circumstances. Joss Whedon stepped in to complete the project, which was released in 2017 with Snyder retaining the directorial credit. Snyder later returned to the project and, in 2021, DC Entertainment released Zack Snyder's Justice League, a heavily revised, greatly expanded (242 minutes vs the 120-minute runtime of the theatrical cut) and partially reshot version of the original. Snyder's cut was released in March 2021 on HBO Max, and was generally much better received than the theatrical version. However, there were still some dissenting voices against the film like BBC critic Mark Kermode who called it a \"Coherent bore\",  while Collider's Matt Goldberg said that it still felt like a rough cut and did not make the case for its 'epic scope' and criticising a lack of character development with the extra runtime and comparing it unfavourably in this regard to the directors cut of Kingdom of  Heaven."]}, {"page": "Keanu Reeves", "response": ["Reeves appeared in the Richard Linklater-directed animated science fiction thriller A Scanner Darkly, which premiered at the 2006 Cannes Film Festival. Reeves played Bob Arctor/Fred, an undercover agent in a futuristic dystopia under high-tech police surveillance. Based on the novel of the same name by Philip K. Dick, the film was a box office failure. However, the film attracted generally favourable reviews; Paul Arendt of the BBC thought the film was \"beautiful to watch\", but Reeves was outshone by his co-star Robert Downey Jr. His next role was Alex Wyler in The Lake House (2006), a romantic drama adaptation of the South Korean film Il Mare (2000), which reunited him with Sandra Bullock. Despite its box office success, Mark Kermode of The Guardian was highly critical, writing \"this syrup-drenched supernatural whimsy achieves stupidity at a genuinely international level [...] The last time Bullock and Reeves were together on screen the result was Speed. This should have been entitled Stop\". Towards the end of 2006, he co-narrated The Great Warming with Alanis Morissette, a documentary about climate change mitigation."]}, {"page": "Salò, or the 120 Days of Sodom", "response": ["The film is the subject of the documentary Salò: Fade to Black (2001) written by Mark Kermode and directed by Nigel Algar."]}, {"page": "Terry Gilliam", "response": ["* Terry Gilliam was awarded the Fellowship of the Kermodes, by film critic Mark Kermode."]}, {"page": "The Shawshank Redemption", "response": ["Zihuatanejo has been interpreted as an analogue for heaven or paradise. In the film, Andy describes it as a place with no memory, offering absolution from his sins by forgetting about them or allowing them to be washed away by the Pacific Ocean, whose name means \"peace\". The possibility of escaping to Zihuatanejo is only raised after Andy admits that he feels responsible for his wife's death. Similarly, Red's freedom is only earned once he accepts he cannot save himself or atone for his sins. Freeman has described Red's story as one of salvation as he is not innocent of his crimes, unlike Andy who finds redemption. While some Christian viewers interpret Zihuatanejo as heaven, film critic Mark Kermode wrote that it can also be interpreted as a Nietzschean form of guiltlessness achieved outside traditional notions of good and evil, where the amnesia offered is the destruction rather than forgiveness of sin, meaning Andy's aim is secular and atheistic. Just as Andy can be interpreted as a Christ-like figure, he can be seen as a Zarathustra-like prophet offering escape through education and the experience of freedom. Film critic Roger Ebert argued that The Shawshank Redemption is an allegory for maintaining one's feeling of self-worth when placed in a hopeless position. Andy's integrity is an important theme in the story line, especially in prison, where integrity is lacking.", "A 2017 poll conducted by Gatwick Airport also identified the film as the fourth-best to watch while in flight. When film critic Mark Kermode interviewed a host of United States moviegoers, they compared it to a \"religious experience\". It was also voted as New Zealand's favorite film in a 2015 poll. Lasting fan appreciation has led to it being considered one of the most beloved films of all time."]}, {"page": "The Princess Bride (film)", "response": ["In 2000, readers of Total Film magazine voted The Princess Bride the 38th greatest comedy film of all time. In 2006, William Goldman's screenplay was selected by the Writers Guild of America as the 84th best screenplay of all time; it earned the same ranking in the Guild's 2013 update. The film was selected number 88 on The American Film Institute's (AFI) \"AFI's 100 Years... 100 Passions\" listing the 100 greatest film love stories of all time. BBC Radio 5's resident film critic, Mark Kermode, is a fan of the film, frequently considering it a model to which similar films aspire."]}, {"page": "Werner Herzog", "response": ["Grizzly Man, directed by Herzog, was awarded the Alfred P. Sloan Prize at the 2005 Sundance Film Festival. In 2006, Herzog was shot in the abdomen while on Skyline Drive in Los Angeles. He had been giving an interview on Grizzly Man to Mark Kermode of the BBC. Herzog continued the interview without seeking medical treatment, stating \"it's not significant\". The shooter later turned out to be a crazed fan with an air-rifle. Regarding the incident, Herzog later said, \"I seem to attract the clinically insane.\" In a 2021 episode of Diminishing Returns podcast covering Herzog's film Stroszek, presenter Dallas Campbell called this incident a hoax, claiming to be friends with the director of the piece and that the incident was \"set up\". Two days later, Herzog helped actor Joaquin Phoenix exit his car after a car-crash."]}, {"page": "Leonardo DiCaprio", "response": ["In 2015, DiCaprio produced and played fur trapper Hugh Glass in Alejandro G. Iñárritu's survival drama The Revenant. DiCaprio has described it as his most difficult film; he had to eat a raw slab of bison's liver and sleep in animal carcasses, and suffered hypothermia. He also learned to shoot a musket, build a fire, speak two Native American languages (Pawnee and Arikara) and apply ancient healing techniques. Built on a budget of $135 million, the film earned $533 million worldwide. The film received positive reviews with particular praise for DiCaprio's acting; Mark Kermode of The Guardian wrote of DiCaprio's \"brainstorming\" portrayal and \"his turn to triumph with a performance which relies more upon physicality than the spoken word\", and Nick De Semlyen of Empire noted his \"raw performance helps elevate what could have been just another man-versus-nature drama\". The film earned him numerous awards, including an Academy Award, a Golden Globe, a BAFTA, a Screen Actors Guild Award and a Critic's Choice Award for Best Actor. For the next three years, DiCaprio narrated documentaries and served as a producer for films. In 2016, he was an executive producer for The Ivory Game and Catching the Sun; produced, hosted, and narrated the documentary Before the Flood about climate change; and produced the crime drama Live by Night. The lattermost received largely unenthusiastic reviews and failed to recoup its $65 million production budget. His production ventures in 2018 were also box-office failures—the psychological horror Delirium and the eponymous retelling of the legend Robin Hood. "]}, {"page": "Absolutely Fabulous", "response": ["*Mark Kermode"]}, {"page": "Meryl Streep", "response": ["Directed by Rob Marshall, Into the Woods (also 2014) is a Disney film adaptation of the Broadway musical with music and lyrics by Stephen Sondheim in which Streep plays a witch. A fantasy genre crossover inspired by the Grimm Brothers' fairy tales, it centers on a childless couple who set out to end a curse placed on them by Streep's vengeful witch.-  Though the film was dismissed by some critics such as Mark Kermode as \"irritating naffness\", Streep's performance earned her Academy Award, Golden Globe, SAG, and Critic's Choice Award nominations for Best Supporting Actress. -- -  In July 2014, it was announced that Streep would portray Maria Callas in Master Class, but the project was pulled after director Mike Nichols's death in November of the same year."]}, {"page": "Lenny (film)", "response": ["In 2012, British film critic Mark Kermode put Hoffman's performance as Lenny Bruce at number eight in a top-ten video of Hoffman's best performances.Archived at Ghostarchive and the Wayback Machine: "]}, {"page": "The Deer Hunter", "response": ["Cimino's next film, Heaven's Gate (1980), debuted to lacerating reviews and took in only $3 million in ticket sales, effectively leaving United Artists bankrupt. The failure of Heaven's Gate led several critics to revise their positions on The Deer Hunter. Canby said in his famous review of Heaven's Gate, \"[The film] fails so completely that you might suspect Mr. Cimino sold his soul to the Devil to obtain the success of The Deer Hunter, and the Devil has just come around to collect.\"Canby, Vincent (November 19, 1980). \"'Heaven's Gate,' A Western by Cimino\" . The New York Times. Retrieved 2010-09-24. Andrew Sarris wrote in his review of Heaven's Gate, \"I'm a little surprised that many of the same critics who lionized Cimino for The Deer Hunter have now thrown him to the wolves with equal enthusiasm.\" Sarris added, \"I was never taken in ... Hence, the stupidity and incoherence in Heaven's Gate came as no surprise since very much the same stupidity and incoherence had been amply evident in The Deer Hunter.\" In his book Final Cut: Dreams and Disaster in the Making of Heaven's Gate, Steven Bach wrote, \"critics seemed to feel obliged to go on the record about The Deer Hunter, to demonstrate that their critical credentials were un-besmirched by having been, as Sarris put it, 'taken in.'\"Bach, p. 370 Film critic Mark Kermode described it as \"a genuinely terrible film\"."]}, {"page": "Freaks (1932 film)", "response": ["Film critic Mark Kermode awarded the film four out of five stars in a 2015 review, noting that, \"today, Browning's sympathies are clear; if there are 'freaks' on display here, they are not the versatile performers to whom the title seems to allude\". Film theorist and critic Andrew Sarris echoed this sentiment, proclaiming Freaks \"one of the most compassionate films ever made\". Ed Gonzalez of Slant Magazine wrote in a 2003 retrospective that the film's moral significance has often been obscured by critical attention to its more shocking elements, noting that this \"seriously underplay[s] the film's blistering humanity and the audacious aesthetic and philosophical lengths to which Browning goes to challenge the way we define beauty and abnormality\"."]}, {"page": "Speed (1994 film)", "response": ["Mark Kermode of the BBC recalled having named Speed his film of the month working at Radio 1 at the time of release, and stated in 2017, having re-watched the film for the first time in many years, that it had stood the test of time and was a masterpiece."]}, {"page": "A.I. Artificial Intelligence", "response": ["Upon re-watching the film many years after its release, BBC film critic Mark Kermode apologized to Spielberg in an interview in January 2013 for \"getting it wrong\" on the film when he first viewed it in 2001. He now believes the film to be Spielberg's \"enduring masterpiece\"."]}, {"page": "The Fifth Element", "response": ["The film has been described by CBS News, Rotten Tomatoes, and ComingSoon.com as a science-fiction cult classic. However, film critic Mark Kermode reported that The Fifth Element was one of the most divisive films among his readers, regarded as both the best and the worst summer blockbuster of all time. Kermode recalled his own experience: \"I remember very clearly being in Cannes when [The] Fifth Element was first played, and it really divided the audience.\" Stephen Cass of Discover ranked the film the third-best science-fiction film on subscription service Hulu, writing, \"People seem to either like or loathe The Fifth Element ... Lavish visuals and entertaining performances from Bruce Willis, Milla Jovovich, and Gary Oldman make this movie worth watching.\" In some circles, the film has gained a \"so-bad-it's-good\" status; Meredith Woerner of io9 listed The Fifth Element as one of \"The 20 Best Worst Science-Fiction Movies of All Time\". In 2007, the Visual Effects Society placed The Fifth Element at number 50, tied with Darby O'Gill and the Little People, on their list of the 50 most influential visual effects films of all time. In 2014, Time Out listed the film at number 42 on their \"100 best sci-fi movies\" list."]}, {"page": "Lonnie Donegan", "response": ["*My twenty-year love affair with the joy of skiffle, article by Mark Kermode The Observer, 1 June 2008"]}, {"page": "John Pilger", "response": ["Geoffrey Macnab described it as an \"angry, impassioned documentary\" while for Mark Kermode it is a \"searing indictment of the ongoing mistreatment\" of the first Australians.Mark Kermode \"Utopia – review\", The Observer, 17 November 2013"]}, {"page": "Jonathan Ross", "response": ["Ross said that while he \"had a wonderful time working for the BBC\" he had \"decided not to re-negotiate when my current contract comes to an end,\" a choice which was  \"not financially motivated\". The announcement came a day after it became public knowledge that Graham Norton had signed a two-year deal with the BBC. Torin Douglas, the Corporation's media correspondent speculated Norton would be a ready-made replacement for Ross's chat show role, while Mark Kermode of BBC Radio 5 Live was a potential successor in the film review role, but that \"replacing Ross on radio will be harder.\" Ross last appeared on the film programme in Episode 10 of Film 2010 with Jonathan Ross aired on 17 March 2010. After Kermode publicly ruled himself out on 26 March, Claudia Winkleman was announced 30 March 2010 as his replacement as host of the Film programme."]}, {"page": "Greenbelt Festival", "response": ["| rowspan=\"3\" | Luke Leighfield, Beverley Knight, Courtney Pine, Shed Seven, London Community Gospel Choir, Ty, Jars of Clay, Foy Vance, Lou Rhodes, The King Blues, The Dodge Brothers, Ugly Duckling, Zic Zazou, Tom Hollander, Kester Brewin, John Bell, Richard Rohr, Maggi Dawn, Mark Yaconelli, Dave Andrews, Cole Moreton, Bruce Kent, Clare Short, John Smith, Jude Simpson, Andy Flannagan, Robin Ince, Martyn Joseph, Milton Jones, Peter Tatchell, Lucy Winkett, Mark Vernon, Stanley Hauerwas, Richard Chartres, Foy Vance, Roger McGough, David Morrissey, Simon Mayo, Linda Marlowe, Mark Kermode, Laurence Freeman, Abdul-Rehman Malik, Riding Lights Theatre Company, Andrew Rumsey, Tony Vino, Bobby Baker, Steve Lawson, Jason Barnett, Nick Park, Gareth Higgins, Cole Moreton, Janey Lee Grace, Richard Harries, Gustavo Parajon, Karen Ward, Pip Wilson, Eliacín Rosario-Cruz, Tom Sine, Francis Spufford, Jo Ind, Catherine Venn, Michael McDermott"]}, {"page": "Cate Blanchett", "response": ["In 2013, Blanchett played Jasmine Francis, the lead role in Woody Allen's Blue Jasmine, co-starring Alec Baldwin and Sally Hawkins. Her performance garnered widespread acclaim, with some critics considering it to be the finest of her career to that point (surpassing her acclaimed performance in Elizabeth). In his review for The Guardian, Mark Kermode proclaimed, \"Blanchett takes on the challenge like a peak-fitness runner facing a marathon, ploughing her way through 26 miles of emotional road pounding, with all the ups and downs, strains and tears, stomach turns and heartburns that that entails, a feat that occasionally leaves her (and us) gasping for breath.\" Peter Travers, reviewing the film for Rolling Stone, called Blanchett's performance, \"miraculous\", and went on to write, \"The sight of Jasmine – lost, alone and unable to conjure magic out of unyielding reality – is devastating. This is Blanchett triumphant, and not to be missed.\" The performance won her more than 40 industry and critics' awards, including the LAFCA Award, NYFCC Award, NSFC Award, Critics' Choice Award, Santa Barbara International Film Festival Outstanding Performance of the Year Award, SAG Award, Golden Globe Award, BAFTA Award, Independent Film Spirit Award and the Academy Award for Best Actress.List of awards and nominations received by Cate Blanchett Blanchett's win made her just the sixth actress to win an Oscar in both of the acting categories, the third to win Best Actress after Best Supporting Actress, and the first Australian to win more than one acting Oscar."]}, {"page": "Emma Thompson", "response": ["Following a brief, uncredited role in the post-apocalyptic blockbuster I Am Legend (2007), Thompson played the devoutly Catholic Lady Marchmain in a 2008 film adaptation of Brideshead Revisited. Critics were unenthusiastic about the film, but several picked Thompson out as its highlight. Mark Kermode said \"Emma Thompson is to some extent becoming the new Judi Dench, as the person who kind of comes in for 15 minutes and is brilliant ... [but then] when she goes away, the rest of the movie has a real problem living up to the wattage of her presence\". Thompson was further acclaimed for her work in the London-based romance Last Chance Harvey (2008), where she and Dustin Hoffman played a lonely, middle-aged pair who cautiously begin a relationship. Critics praised the chemistry between the two leads, and both received Golden Globe nominations for their performances. Thompson's two 2009 films were both set in 1960s England, and in both she made cameo appearances: as a headmistress in the critically praised drama An Education and as a \"tippling mother\" in Richard Curtis's The Boat That Rocked.", "Thompson is regarded as one of the finest actresses of her generation and one of Britain's most recognisable actresses, held in high regard within Hollywood. Early in her career, when she was closely associated with her first husband Kenneth Branagh, she was considered a \"luvvy\". The public warmed to her after the separation, and she became one of the key actresses of the 1990s. Her status has continued to grow; in 2008, journalist Sarah Sands stated that Thompson has improved with age and experience, and Mark Kermode said of her performances, \"There is something about her which is — you just trust her. You just think 'I'm in proper hands here.' ... She's up there with the great, I mean really great, British female performers\"."]}, {"page": "Ken Russell", "response": ["Film critic Mark Kermode, speaking in 2006, and attempting to sum up the director's achievement, called Russell \"somebody who proved that British cinema didn't have to be about kitchen-sink realism—it could be every bit as flamboyant as Fellini.  Later in his life he turned to making low-budget experimental films such as The Lion's Mouth and Revenge of the Elephant Man, and they are as edgy and 'out there' as ever\".Mark Kermode, speaking to Lauren Laverne, on BBC2's The Culture Show, October 2006.", "Russell was appointed visiting fellow at the University of Southampton in April 2007, where he acted in a similar capacity to his role at the Newport Film School, until March 2008. His arrival was celebrated with a screening of the rare director's cut of The Devils hosted by Mark Kermode."]}, {"page": "Victim (1961 film)", "response": ["Similarly, though several actresses had turned down the role, Sylvia Syms readily accepted the part of Laura. English film critic Mark Kermode notes her reasons for this included previous theatre work with John Gielgud which exposed her to the laws surrounding homosexuality at the time, and that a family friend of hers had committed suicide after being accused of being gay. Consequently, she felt that the film's story had to be told. Other gay cast members included Dennis Price and Hilton Edwards."]}, {"page": "Ralph Fiennes", "response": ["In 2020, Fiennes voiced a tiger in the family fantasy adventure film Dolittle starring Robert Downey Jr.. In the same year, he appeared in the monologue play Beat the Devil by David Hare at the Bridge Theatre in London, and then in the 2021 film version of the play. Also in 2021, he starred in the British drama film The Dig playing the Suffolk archaeologist Basil Brown alongside Carey Mulligan, and Lily James. The film received positive reviews with critics praising his performance in the film. Mark Kermode critic of The Guardian described Fiennes portrayal as having an \"admirable eloquence\". Later in 2021, Fiennes is also set to star in Matthew Vaughn's period spy film The King's Man and Cary Joji Fukunaga's James Bond film No Time to Die. He is set to reunite with director Wes Anderson in The Wonderful Story of Henry Sugar starring opposite Benedict Cumberbatch, Dev Patel, and Ben Kingsley."]}, {"page": "1963 in film", "response": ["*July 2 - Mark Kermode, English critic"]}, {"page": "Christopher Nolan", "response": ["After The Dark Knights success, Warner Bros. signed Nolan to direct Inception (2010). Nolan also wrote and co-produced the film, described as \"a contemporary sci-fi actioner set within the architecture of the mind\". Starring a large ensemble cast led by Leonardo DiCaprio, the film became a critical and commercial success upon its release in July 2010. Richard Roeper of the Chicago Sun-Times awarded the film a perfect score of \"A+\" and called it \"one of the best movies of the [21st] century\". Mark Kermode named it the best film of 2010, stating \"Inception is proof that people are not stupid, that cinema is not trash, and that it is possible for blockbusters and art to be the same thing.\" The film ended up grossing over $836million worldwide and was nominated for eight Academy Awards, including Best Picture and Best Original Screenplay; it won the award for Best Cinematography, Best Sound Mixing, Best Sound Editing and Best Visual Effects. Nolan was also nominated for BAFTA and Golden Globe awards, among other accolades.", "Geoff Andrew of the British Film Institute and Sight & Sound magazine, called Nolan \"a persuasively inventive storyteller\", singling him out as one of the few contemporary filmmakers producing highly personal films within the Hollywood mainstream. He also pointed out that his films are as notable for their \"considerable technical virtuosity and visual flair\" as for their \"brilliant narrative ingenuity and their unusually adult interest in complex philosophical questions\". David Bordwell observed that Nolan is \"considered one of the most accomplished living filmmakers\", citing his ability to turn genre movies into both art and event films, as well as his box office numbers, critical acclaim, and popularity among cinemagoers. In 2008, film critic Philip French deemed Nolan \"the first major talent to emerge this [21st] century\". Film critic Mark Kermode complimented the director for bringing \"the discipline and ethics of art-house independent moviemaking\" to Hollywood blockbusters, calling him \"living proof that you don't have to appeal to the lowest common denominator to be profitable\". The Observer described Nolan as a \"skilful, stylish storyteller, capable of combining the spectacle of Spielberg with the intellectual intricacy of Nicolas Roeg or Alain Resnais\". Mark Cousins applauded the director for embracing big ideas, \"Hollywood filmmakers generally shy away from ideas—but not Christopher Nolan\". Scott Foundas of Variety declared Nolan \"the premier big-canvas storyteller of his generation\", while Justin Chang of the Los Angeles Times called him \"the great proceduralist of 21st century blockbuster filmmaking, a lover of nuts-and-bolts minutiae.\""]}, {"page": "Ring (film)", "response": ["Sight & Sound critic Mark Kermode praised the film's \"timeless terror\", with its \"combination of old folk devils and contemporary moral panics\" which appeal to both teen and adult audiences alike. While Adam Smith of Empire Online finds the film \"throttled by its over complexity, duff plotting and a distinct lack of actual action\",Smith, Adam (n.d.), 'Review of Ring', Empire Online. Kermode emphasizes that \"one is inclined to conclude that it is the telling, rather than the content of the tale, that is all-important\". Variety agrees that the slow pace, with \"its gradual evocation of evil lying await beneath the surface of normality\", is one of the film's biggest strengths.(1999), 'Review: The Ring', Variety Magazine. Ring was listed as the twelfth best horror film of all time by The Guardian and also picked by Stuart Heritage in the same paper as the film that frightened him most.Ring: the film that frightened me most, The Guardian, Tuesday 21 October 2014"]}, {"page": "National Science and Media Museum", "response": ["Guests at Bradford International Film Festival included Riz Ahmed, Jenny Agutter, Michael Apted, David Arnold, Thomas Arslan, Ken Annakin, Olivier Assayas, Richard Attenborough, Simon Beaufoy, Alan Bennett, James Benning, Claire Bloom, Kenneth Branagh, Adam Buxton, Jack Cardiff, Ian Carmichael, Gurinder Chadha, Tom Courtenay, Mark Cousins, Alex Cox, Brian Cox, Benedict Cumberbatch, Terence Davies, Michael Deeley, Denis Dercourt, The Dodge Brothers, James Ellis, Mike Figgis, Freddie Francis, Terry Gilliam, Stephen Graham, Richard Griffiths, Ronald Harwood, Mike Hodges, Joanna Hogg, John Hurt, Derek Jacobi, Gualtiero Jacopetti, Terry Jones, Patrick Keiller, Mark Kermode, Mike Leigh, Euan Lloyd, Ken Loach, Malcolm McDowell, Virginia McKenna, Fernando Meirelles, Kay Mellor, Metamono, Chris Morris, Barry Norman, Michael Palin, Pawel Pawlikowski, Christian Petzold, Sally Potter, Godfrey Reggio, Menelik Shabazz, John Shuttleworth, Jean Simmons, Timothy Spall, Imelda Staunton, Eric Sykes, Julien Temple, Alex Thomson, Richard Todd, Danny Trejo, Roy Ward Baker, Peter Whitehead, Michael G. Wilson, Barbara Windsor, Ray Winstone, Stephen Woolley, Thierry Zéno and many independent filmmakers from around the world."]}, {"page": "Napoléon (1927 film)", "response": ["Anita Brookner of London Review of Books wrote that the film has an \"energy, extravagance, ambition, orgiastic pleasure, high drama and the desire for endless victory: not only Napoleon’s destiny but everyone’s most central hope.\" The 2012 screening has been acclaimed, with Mick LaSalle of the San Francisco Chronicle calling the film, \"A rich feast of images and emotions.\" He also praised the triptych finale, calling it, \"An overwhelming and surprisingly emotional experience.\" Judith Martin of The Washington Post wrote that the movie \"inspires that wonderfully satisfying theatrical experience of whole-heartedly cheering a hero and hissing villains, while also providing the uplift that comes from a real work of art\" and praised its visual metaphors, editing, and tableaus. Peter Bradshaw wrote in The Guardian that Napoleon \"looks startlingly futuristic and experimental, as if we are being shown something from the 21st century’s bleeding edge. It’s as if it has evolved beyond spoken dialogue into some colossal mute hallucination.\" Mark Kermode described the film \"as significant to the evolution of cinema as the works of Sergei Eisenstein and D. W. Griffith\" that \"created a kaleidoscopic motion picture which stretched the boundaries of the screen in every way possible.\"Archived at Ghostarchive and the Wayback Machine: "]}, {"page": "Gary Oldman", "response": ["Following his Friends appearance, Oldman did not appear in any major roles until 2004; it was suggested that he was blacklisted in Hollywood during this time,Mendelson, Scott (7 November 2008). Oh My God, They Killed Gary (Oldman)! Huffington Post. Retrieved 6 August 2012. following the controversy that had surrounded the release of The Contender. In 2002, he starred in the generally well-received Interstate 60, and played the Devil in the BMW short film, The Hire: Beat the Devil. Guardian writer Xan Brooks described the early 2000s as Oldman's \"low point\", recalling \"barrel-scraping roles\" in the 2003 films Tiptoes and Sin. Although the film failed to impress reviewers, Oldman did garner some praise for his portrayal of a man with dwarfism in Tiptoes: Lisa Nesselson in Variety described his work as \"astonishingly fine\",Nesselson, Lisa (24 September 2003).  Variety. Retrieved 5 November 2011. and the performance was later mentioned in Mark Kermode's \"Great Acting in Bad Films\".Kermode, Mark. Great Acting in Bad Films. BBC. 27 January 2012. Retrieved 11 August 2012.", "In 2004, Oldman returned to prominence when he landed a starring role in the Harry Potter film series, playing Harry Potter's godfather Sirius Black. The following year, he starred as James Gordon in Christopher Nolan's commercially and critically successful Batman Begins, a role that he reprised in the even more successful sequel The Dark Knight (2008) and once more in the conclusion, The Dark Knight Rises (2012). Film critic Mark Kermode, in reviewing The Dark Knight, downplayed claims that Heath Ledger's Joker was the highlight of the film, saying, \"the best performance in the film, by a mile, is [by] Gary Oldman... it would be lovely to see him get a nomination because actually, he's the guy who gets kind of overlooked in all of this.\". BBC Radio 5 Live. 25 July 2008. Retrieved 29 August 2012. Oldman co-starred with Jim Carrey in the 2009 version of A Christmas Carol in which Oldman played three roles.Morris, Clint (30 November 2007). . Moviehole.net He had a starring role in David Goyer's supernatural thriller The Unborn, released in 2009."]}, {"page": "BBC Radio 5 Live", "response": ["* Kermode and Mayo's Film Review with Mark Kermode and Simon Mayo (Friday)"]}, {"page": "An Officer and a Gentleman", "response": ["Rex Reed gave a glowing review where he commented: \"This movie will make you feel ten feet tall!\" British film critic Mark Kermode, an admirer of Taylor Hackford observed, \"It's a much tougher film than people remember it being; it's not a romantic movie, it's actually a movie about blue-collar, down-trodden people.\""]}, {"page": "Twin Peaks: Fire Walk with Me", "response": ["Later retrospective analysis of the film has also trended more positive, with critic Mark Kermode writing in 2007 that many have come to consider the film a \"masterpiece\". In a 2002 review, Ed Gonzalez of Slant Magazine gave the film a four out of four stars, and the following year, the publication included it in a list of \"100 essential films.\" Appearing on the podcast The Cinephiliacs in 2015, filmmaker James Gray called it \"an incredible film,\" \"a masterpiece,\" and \"a classic example of how the critics get it wrong.\" Further speaking of the film, he said, \"I've never seen a movie that's been made in the last 30 years [...] in America, which so asks us to understand and be in the shoes of a person suffering so profoundly. It's a thing of beauty.\""]}, {"page": "3D film", "response": ["Film critic Mark Kermode, a noted detractor of 3D, has surmised that there is an emerging policy of distributors to limit the availability of 2D versions, thus \"railroading\" the 3D format into cinemas whether the paying filmgoer likes it or not. This was especially prevalent during the release of Prometheus in 2012, where only 30% of prints for theatrical exhibition (at least in the UK) were in 2D. His suspicions were later reinforced by a substantial number of complaints about Dredd from those who wished to see it in 2D but were denied the opportunity. In July 2017, IMAX announced that they will begin to focus on screening more Hollywood tentpole movies in 2D (even if there's a 3D version) and have fewer 3D screenings of movies in North America, citing that moviegoers in North America prefer 2D films over 3D films.", "Film critic Mark KermodeMark Kermode. \"Come in Number 3D, your time is up\". BBC News, December 23, 2009. argued that 3D adds \"not that much\" value to a film, and said that, while he liked Avatar, the many impressive things he saw in the film had nothing to do with 3D. Kermode has been an outspoken critic of 3D film describing the effect as a \"nonsense\" and recommends using two right or left lenses from the 3D glasses to cut out the \"pointy, pointy 3D stereoscopic vision\", although this technique still does not improve the huge brightness loss from a 3D film.Mark Kermode. . BBC News, January 15, 2010. Versions of these \"2-D glasses\" are being marketed.Browning, Skylar (June 16-June 23, 2011). \"Two D's Better Than Three: Hank Green Finds a Place in Hollywood's Excesses \", Missoula Independent, Vol. 22, No. 24, p.8."]}, {"page": "The Ninth Configuration", "response": ["On review aggregator Rotten Tomatoes, The Ninth Configuration has an approval rating of  based on  reviews, with an average rating of . Leonard Maltin has described the movie as \"hilarious yet thought-provoking, with endlessly quotable dialogue and an amazing barroom fight scene.\"Leonard Maltin, Leonard Maltin's 2009 Movie Guide (Plume, 2008) p.991 Blatty's screenplay was later published in 2000 with commentary by English film critic Mark Kermode (Kermode also contributed to the audio commentary and featurette on the film's DVD release in 2002). Kermode has described The Ninth Configuration as \"a breathtaking cocktail of philosophy, eye-popping visuals, jaw-dropping pretentiousness, rib-tickling humour and heart-stopping action. From exotically hallucinogenic visions of a lunar crucifixion to the claustrophobic realism of a bar-room brawl, via such twisted vignettes as Robert Loggia karaoking to Al Jolson and Moses Gunn in Superman drag, Blatty directs like a man with no understanding of, or interest in, the supposed limits of mainstream movie-making. The result is a work of matchless madness which divides audiences as spectacularly as the waves of the Red Sea, a cult classic that continues to provoke either apostolic devotion or baffled dismissal 20 years on.\"The Ninth Configuration – USA 1979, Reviewed by Mark Kermode, British Film Institute – Sight and Sound, July 1999 issue"]}, {"page": "Alastair Campbell", "response": ["It is also widely believed that the character of Malcolm Tucker from the BBC political satire comedy The Thick of It is loosely based on Campbell. Tucker is famous for his short fuse and use of very strong language. In an interview with Mark Kermode on BBC2's The Culture Show, Campbell denied that the two are similar in any relevant way, but admitted to his liberal use of profanities in the workplace. The interview descended into argument with Campbell accusing the likes of Mark Kermode and the show's creator Armando Iannucci of being responsible for people's cynicism with modern politics."]}, {"page": "Newsnight", "response": ["From 2000 until December 2009, on Friday evenings Newsnight gave way at 11:00pm to Newsnight Review, a 35-minute consumer survey of the week's artistic and cultural highlights. Mark Lawson was the programme's main presenter in its Late Review incarnation, which began life as a strand of The Late Show. He continued to chair the panel of guest reviewers when it reincarnated as Newsnight Review in 2000, up until December 2005. The programme was presented by Kirsty Wark, Martha Kearney, John Wilson, Tim Marlow, Kwame Kwei-Armah and Hardeep Singh Kohli. Regular reviewers included Mark Kermode, Tom Paulin, Ekow Eshun and Germaine Greer."]}, {"page": "List of films considered the worst", "response": ["Exorcist II: The Heretic is the sequel to William Friedkin's Oscar-winning 1973 film, directed by John Boorman. While British film critic Mark Kermode called the original film his favourite film of all time, he believes the sequel to be the worst film ever made. The Golden Turkey Awards named it the second-worst film ever made, after Plan 9 from Outer Space. Critic Bill Chambers stated it was \"Possibly the worst film ever made and surely the worst sequel ever made.\" It also appeared in The Official Razzie Movie Guide book. Friedkin believes the sequel diminished the value of the original film and called it \"the worst piece of shit I've ever seen\" and \"a fucking disgrace.\" Eventually, the film garnered so much hate that Boorman disowned it. In an interview with Bob McCabe for the book The Exorcist: Out of the Shadows, he confessed, \"The sin I committed was not giving the audience what it wanted in terms of horror.\"John Boorman, cited in Bob McCabe, The Exorcist: Out of the Shadows (Omnibus Press, 1999), p.164", "Dirty Grandpa, a 2016 comedy film starring Robert De Niro and Zac Efron as a grandfather and grandson going to Florida during Spring break, received negative reviews for its gross-out and shock humor that was also considered as sexist, homophobic and racist. Mike Ryan of Uproxx said: \"Dirty Grandpa is the worst movie I’ve ever seen in a movie theater. Burn it.\" He later also picked it as the worst film he had ever both reviewed and seen. Pete Hammond of Deadline Hollywood said: \"... Dirty Grandpa, is not just the worst movie [De Niro] has ever been in, but it may be the worst movie anyone has ever been in.\" Glenn McDonald of Indy Week said: \"The awful, ugly Dirty Grandpa is the comedy equivalent of torture porn ... In fact, in the dizzying moments after being bludgeoned by this miserable specimen, I was convinced it's among the worst movies ever made.\" Richard Roeper gave the film zero stars, writing, \"If Dirty Grandpa isn't the worst movie of 2016, I have some serious cinematic torture in my near future.\" On his YouTube channel, Roeper also said: \"I'm not ready to say Dirty Grandpa is the worst movie I've ever seen, but I'm also not ready to say it's not the worst movie I've ever seen.\" Mark Kermode, on his BBC Radio 5 Live show (Kermode and Mayo's Film Review), said that he found the film \"truly, genuinely horrible\" and went on to say, \"after Dirty Grandpa I did feel genuinely unclean, I wanted to go and have a shower, because it's just so revolting. Somewhere in hell there is a multiplex playing this on a double bill, with Movie 43 and Entourage.\" He would later go on to brand it his least favorite film of 2016. "]}, {"page": "East Finchley", "response": ["The independent Phoenix Cinema (once called the Rex and before that the Coliseum) is located on the High Road, and regularly shows films with more individual appeal than is the case with the cinema chains. It is the oldest purpose-built cinema in the UK (the only older ones having started life as theatres). Time Out, the arts magazine, describes the Phoenix as the best single-screen cinema in London. Film critic Mark Kermode has written that the Phoenix Cinema \"remains the single most significant cinema in my development as a bona fide cinema obsessive.\"Kermode, Mark. It's Only a Movie: Reel Life Adventures of a Film Obsessive. London: Random House, 2010; page 26."]}, {"page": "Pink Flamingos", "response": ["On Rotten Tomatoes the film has an approval rating of 81% based on reviews from 42 critics, with an average rating of 7.2/10. On Metacritic it has a weighted average score of 47 out of 100, based on reviews from 10 critics, indicating \"mixed or average reviews\". In the \"Cult Movies\" episode of the UK documentary series Mark Kermode's Secrets of Cinema, Kermode admitted that Pink Flamingoes is, \"one of the very few films that I have ever walked out of, when I first saw it as a teenager on a late-night double bill at the Phoenix in East Finchley.\""]}, {"page": "Pirates of the Caribbean: The Curse of the Black Pearl", "response": ["Roger Ebert acclaimed the performances of Depp and Rush, and particularly that \"It can be said that [Depp's] performance is original in its every atom. There has never been a pirate, or for that matter a human being, like this in any other movie... his behavior shows a lifetime of rehearsal.\" However, he felt the film went on for too long, a criticism shared by Kenneth Turan's negative review, feeling it \"spends far too much time on its huge supporting cast of pirates (nowhere near as entertaining as everyone assumes) and on bloated adventure set pieces,\" despite having also enjoyed Depp's performance. Mark Kermode described the film as \"a triumph of turgid theme-park hackery over the art of cinema\"."]}, {"page": "Linda Blair", "response": ["In 1997, Blair reunited with director Wes Craven for a cameo role as a reporter in Scream (1996), and also starred in a Broadway revival of Grease, playing Rizzo. Also in 1997, she appeared in a documentary for Channel 4 in the United Kingdom entitled Didn't You Used to be Satan?, which served as a biography of her life to that point and how the film The Exorcist had dominated her career and life. Blair appeared in critic Mark Kermode's 1998 BBC documentary The Fear of God (which Kermode directed and hosted), included as a special feature on the DVD of The Exorcist.  In 1999, Blair appeared in an online parody of The Blair Witch Project titled The Blair Bitch Project."]}, {"page": "Chipping Barnet", "response": ["* Mark Kermode (born 1963), film critic and musician, was born in the town."]}]}}