{"wiki_id": "http://www.wikidata.org/entity/Q1288931", "itemLabel": "Henry Hellyer", "itemDescription": "Explorer, surveyor and architect in Tasmania, Australia", "wikipedia_url": "https://en.wikipedia.org/wiki/Henry_Hellyer", "wikipedia_page": {"main": "Henry Hellyer (1790 – c. 1 September 1832) was an English surveyor and architect who was one of the first explorers to visit the rugged interior of the north west of Tasmania, Australia and made the most comprehensive maps of the area up to that time.", "link_mentions": [{"page": "Cradle Mountain-Lake St Clair National Park", "response": ["Europeans first explored Cradle Mountain in 1827 and 1828 with Joseph Fossey and Henry Hellyer surveying for the Van Diemen's Land Company. Lake St Clair was sighted by surveyor William Sharland in 1832, with George Frankland leading an expedition to it three years later."]}, {"page": "Cradle Mountain", "response": ["Europeans first explored, and climbed, Cradle Mountain in 1827 and 1828 with Joseph Fossey and Henry Hellyer surveying for the Van Diemen's Land Company."]}, {"page": "Overland Track", "response": ["Europeans first explored Cradle Mountain in 1827 and 1828 with Joseph Fossey and Henry Hellyer surveying for the Van Diemen's Land Company. Lake St Clair was sighted by surveyor William Sharland in 1832, with George Frankland leading an expedition to it three years later."]}, {"page": "Hellyer College", "response": ["Established in 1976, it provides academic and vocational training to around 850 students from North-West Tasmania, including the West Coast, Circular Head and King Island. Hellyer College was named after Henry Hellyer, who was an explorer in north west Tasmania during the 1820s. In 2009 it became part of the Burnie Campus of the Tasmanian Academy (ex Hellyer College) and Burnie Campus of the Tasmanian Polytechnic (ex TAFE Burnie and Hellyer College)."]}, {"page": "Hellyer", "response": ["Henry Hellyer was an explorer in north west Tasmania during the 1820s."]}, {"page": "1790 in Australia", "response": ["** Henry Hellyer, Van Diemen's Land explorer (d. 1832)"]}, {"page": "Hellyerite", "response": ["It was first identified in 1958 in the Old Lord Brassy mine,Williams KL,Threadgold IM,Hounslow AW. Hellyerite: A new nickel carbonate from Heazlewoord, Tasmania. The American Mineralogist,1959;44:533-538.  Tasmania, Australia and named after Henry Hellyer (1791–1832), Chief Surveyor of the Van Diemens Land Company. It is also reported from the Pafuri nickel deposit in Limpopo Province, South Africa."]}, {"page": "Stanley, Tasmania", "response": ["* Henry Hellyer - Chief Surveyor, explorer, and architectHellyer, Henry (1790–1832) Australian Dictionary of Biography"]}, {"page": "Mole Creek", "response": ["During the 1820s, the Van Diemen's Land Company cut a stock route from Deloraine to Emu Bay (now known as Burnie) via Chudleigh and Mole Creek. Prior to this cattlemen had run cattle and built stockman's huts on the land west of Westbury. From the 1820s onwards land grants began being issued as the land was gradually surveyed.Evans & Terry, p.9  A systemic exploration of Mole Creek and the area west was conducted in 1826 by Edward Curr, Joseph Fossey and Henry Hellyer.Evans & Terry, p.20 Mole Creek was originally a mixture of tall forest, plains and boggy marsh. Settlers in the early 19th century cleared the land largely using fire and the ring barking of trees.Evans & Terry, p.33 The land was first held in large leaseholds by the wealthiest in the colony of Tasmania. In the mid-19th century a number of waste lands acts were passed by the government allowing for smaller holdings, opening up the then densely forested land around the town of Mole Creek.Evans & Terry, p.26  Many of these first settlers were farm labourers or ex-convicts, who had worked as labourers or tenant farmers on the larger holdings."]}, {"page": "Tasmanian emu", "response": ["At a ceremony at Cape Grim on 14 April 1834, Aboriginal people danced and characterised emus by stretching out one arm to emulate the long neck of the bird. The Tasmanian emu was also symbolised in Indigenous art. The depiction of the emu in ‘native drawings’ is noted in the narrative of the overland journey of Sir John and Lady Franklin from Hobart to Macquarie Harbour in 1842. The area they were referring to was subsequently called Painters Plains.  The emu’s representation in ceremonial activities and art suggests a great familiarity with the emu and may further support the notion of its abundance in Van Diemen’s Land. The proliferation of places in Van Diemen’s Land named after the emu also indicates the plentiful existence of the species. Henry Hellyer, the surveyor for the Van Diemen’s Land Company, came across a river and seeing the footprints of the emu on some moist ground by the water called it Emu River. Emu Bay takes its name from that river. There are also Emu Bottom, Emu Valley, Emu Flat, Emu Hill, Emu Ground, Emu Heights, Emu Plains and Emu Point. There was an Emu Inn in Hobart as early as 1823, and later the Emu Tavern in Liverpool Street, Hobart."]}, {"page": "1832 in Australia", "response": ["* 1/2 September – Henry Hellyer, Van Diemen's Land explorer (b. 1790)"]}, {"page": "Hellyer Gorge", "response": ["The Hellyer Gorge is a gorge in Tasmania, through which flows the Hellyer River, named after Henry Hellyer. It is the subject of the Hellyer Gorge State Reserve. The Murchison Highway passes through the area with many sharp and steep bends, which provides the setting to a stage of Targa Tasmania. Being subject to black ice, this portion of road has now been bypassed by the newer Ridgley Highway. Nevertheless, the area is quite picturesque and some bush-walking tracks have been blazed for tourists."]}, {"page": "Hellyer River", "response": ["The river flows for  before joining into the Arthur River.  High quality cool temperate rainforest and tall eucalyptus forest grows along much of the river. Significant species include Myrtle Beech, Leatherwood, Southern Sassafras and Messmate. The river in named in honour of the explorer Henry Hellyer."]}, {"page": "William Hellyer", "response": ["Almost nothing is known of his early life. His father was Thomas Hellyer (1801–41) and his uncle was Henry Hellyer, surveyor, architect and explorer in Tasmania. On 20 January 1840 William married Margaret Gray at Bathurst."]}, {"page": "Hellyers Road Distillery", "response": ["Hellyers Road is a whisky distillery in Burnie, Tasmania. Founded in 1999 by a group of dairy farmers, it takes its name from a road surveyed in 1827 by explorer Henry Hellyer. In 2010, Hellyers Road was recognised by the Malt Whisky Association of Australia for producing the nation's best single malt, and in 2013 Hellyers Road Pinot Noir Finish was  voted ‘Best New World Whisky’ from a series of blind tastings conducted at the Whisky Live fair in Paris."]}, {"page": "Preolenna", "response": ["Henry Hellyer traversed the region on an expedition in 1827. The location was noted for the presence of coal in the nearby Jessie Gorge/Maweena area and some 5000 acres of \"first class milling\" timber and \"first class basaltic soils\" (Loftus Hills, Government Surveyor, 1913)."]}, {"page": "Emu Heights, Tasmania", "response": ["The municipal area of City of Burnie, of which Emu Heights is part, was proclaimed a city on 26 Apr 1988. It was previously named Emu Bay Municipality. The municipality and the bay to its north were named for the Emu River, which was named in 1827 by explorer Henry Hellyer for emu tracks seen in the vicinity. It is believed that the name of this locality has the same derivation."]}, {"page": "Emu River (Tasmania)", "response": ["The Emu River is a perennial river for most of its length, located in the north-western region of Tasmania, Australia. It was named by Henry Hellyer, an early explorer who saw emu tracks in the vicinity."]}, {"page": "Ridgley, Tasmania", "response": ["The area was named by surveyor Henry Hellyer in the 1920s. The locality was gazetted in 1966."]}, {"page": "East Ridgley, Tasmania", "response": ["It is believed that the name “Ridgley” was conferred by surveyor Henry Hellyer in the 1820s."]}, {"page": "Hellyer, Tasmania", "response": ["Hellyer was gazetted as a locality in 1962. It was named for Henry Hellyer, a surveyor of Tasmania in the 1820s."]}]}}