{"wiki_id": "http://www.wikidata.org/entity/Q12810095", "itemLabel": "Jane Hill", "itemDescription": "British newsreader", "wikipedia_url": "https://en.wikipedia.org/wiki/Jane_Hill", "wikipedia_page": {"main": "Jane Amanda Hill (born 10 June 1969 in Eastbourne, Sussex) is an English newsreader working for the BBC. She is one of the main presenters for BBC News, and is the main presenter on the BBC News at One and the BBC News at Five, as well as regularly presenting the BBC Weekend News, BBC News at Ten and BBC News at Six. She also occasionally presents The World Tonight on BBC Radio 4 and is whilst presenting BBC News at Five on Fridays on the BBC News Channel which includes The Film Review.", "link_mentions": [{"page": "BBC News (TV channel)", "response": ["* BBC News at Five – This was an hour of news live from Broadcasting House in London, usually presented by Huw Edwards or Jane Hill, with an in-depth look back at the day's national and international news, sport and weather. The new schedule under the COVID-19 pandemic involves the BBC News at One presenter continuing on air until 16:00, replacing Afternoon Live. Another presenter then takes over and this shift is extended until 18:00. In line with much branded programming, the BBC News at Five is not currently on air.", "|Jane Hill", "|Jane Hill", "|Jane Hill", "|Jane Hill", "|Jane Hill", "* Jane Hill  BBC News, BBC News at One, BBC News at Six, BBC News at Ten, The Film Review"]}, {"page": "Queen Mary University of London", "response": ["File:Jane Hill Downing Street reception 2011 cropped.jpg|Jane Hill, BBC News presenter"]}, {"page": "British-American Project", "response": ["* Jane Hill, BBC"]}, {"page": "Wedding of Prince Charles and Camilla Parker Bowles", "response": ["The BBC gained the rights to broadcast the event where there was live coverage of the Service of Prayer and Dedication from St George's Chapel. On BBC One, Huw Edwards and Sophie Raworth presented the live coverage of the event and fashion advisors Trinny Woodall and Susannah Constantine contributed as the contemporary social commentators. The BBC had around thirty cameras at the event and shared footage with broadcasters throughout the world. BBC News 24 also had coverage during the day with Jane Hill and Simon McCoy reporting live from Windsor."]}, {"page": "BBC News at Ten", "response": ["|Jane Hill", "*Sophie Raworth is not currently presenting the BBC News at Ten, as she is now the interim presenter of the new ‘Sunday Morning’ programme on BBC One, which replaced ‘The Andrew Marr Show’, as well as covering for George Alagiah on the BBC News at Six. Her cover is being provided by Clive Myrie. When he is unavailable, Reeta Chakrabarti and Jane Hill. "]}, {"page": "The World Tonight", "response": ["*Jane Hill – occasional presenter"]}, {"page": "Matthew Amroliwala", "response": ["After working as a chartered accountant, he joined the BBC and, in 1990, became a BBC network television correspondent. In 1997, he joined the BBC News Channel as a presenter of the channel's evening programmes and from the beginning of 2001, he has presented the late afternoon news programme, first with Jane Hill and then with Maxine Mawhinney. In April 2006, he was re-united with Hill on the 11 am–2 pm shift until March 2013 when the duo moved to the 2 pm–5 pm slot on Tuesday to Friday; Emily Maitlis co-presented on Mondays."]}, {"page": "South Today", "response": ["*Jane Hill"]}, {"page": "BBC News at Six", "response": ["Alagiah was diagnosed with bowel cancer in 2014, and took leave from presenting duties. Raworth and Bruce were the main cover presenters during this time, which also saw regular appearances from Reeta Chakrabarti and Jane Hill. Alagiah returned in late 2015, but saw his cancer return in 2018, and once again took leave to undergo further treatment. Raworth once again covered Alagiah during his absence, with Bruce, Chakrabarti, Hill and Clive Myrie also regularly appearing on the programme. Alagiah returned to his presenting duties in January 2019.", "|Jane Hill", "*Sophie Raworth is not currently presenting the BBC News at Six and the BBC News at Ten on Fridays, as she is now the interim presenter of the new ‘Sunday Morning’ programme on BBC One, which has replaced ‘The Andrew Marr Show’. Her cover is being provided by Clive Myrie. When he is unavailable, Reeta Chakrabarti and Jane Hill present.  "]}, {"page": "BBC News at One", "response": ["The BBC News at One is the afternoon/lunchtime news bulletin from the BBC. Produced by BBC News, the programme is broadcast on BBC One and the BBC News channel (via British Sign Language) from Monday to Sunday at 1:00pm for 30 minutes, although it can be broadcast on the weekend. The programme is currently presented by Ben Brown, Jane Hill, Victoria Derbyshire, and Reeta Chakrabarti.     ", "From 23 March 2020, Simon McCoy took the role as the Monday-Wednesday presenter, following the axe of the BBC’s Afternoon Live, Jane Hill continued to present on Thursdays, with her sharing the role on Fridays with Kate Silverton. Raworth ceased to present the bulletin and appeared exclusively as a main anchor of the BBC News at Six and BBC News at Ten.", "|Jane Hill", "|Jane Hill", "|Jane Hill", "|Jane Hill", "|Jane Hill", "Ben Brown, Jane Hill, Reeta Chakrabarti, Clive Myrie and Martine Croxall appear as relief presenters. Victoria Derbyshire appears as a backup relief presenter.  "]}, {"page": "BBC Breakfast", "response": ["* Jane Hill (2002–2004)"]}, {"page": "List of gay, lesbian or bisexual people: H", "response": ["| Jane Hill"]}, {"page": "Category talk:British journalists", "response": ["Jane Hillnot yet classified"]}, {"page": "Dateline London", "response": ["Esler hosted his final edition on 25 March 2017, and Mawhinney on 8 April 2017. Since 15 April 2017, Dateline London was hosted on rotation by Jane Hill or Shaun Ley, while Carrie Gracie and Tim Willcox provided occasional cover."]}, {"page": "The Film Review", "response": ["Jane Hill serves as the main host, and Mark Kermode as the regular film critic. However, during the Coronavirus restrictions, the programme is presented by the film critic alone. It has concentrated on home streaming releases as cinemas have been closed, but from 24 July 2020 is beginning to include cinema theatrical releases again. From September 10 2021, The Film Review came back from the BBC Studios by the presenter and the film critic for the first time since the COVID-19 pandemic began."]}, {"page": "MoonWalk (charity event)", "response": ["Celebrity participants have included Claire Balding, Debbie Chazen, Charlie Condou, Liza Goddard, Jane Hill, Lorraine Kelly, Sally Lindsay, Nell McAndrew, Kirsty McCabe, Jojo Moyes, Paul O’Grady, Sue Perkins, Tom Read Wilson, Aliza Reger, Gaby Roslin, Jennifer Saunders, Penny Smith and Sue Vincent."]}, {"page": "List of current BBC newsreaders and reporters", "response": ["|Jane Hill", "| Jane Hill ", "| Jane Hill ||  The Film Review"]}, {"page": "Proto-Nahuan language", "response": ["An alternative hypothesis by Jane Hill is that Proto-Nahuatl arose within Mesoamerica, and the Nahuas are the only remainders of a large-scale northward migration."]}, {"page": "BBC News at Five", "response": ["The BBC News at Five is an hour-long daily news programme broadcast at 5:00pm on BBC News. The programme is fronted by Huw Edwards, the BBC's lead presenter for major breaking news, and Jane Hill on Friday.  The show includes a detailed look at the news, as well as analysis with guests and sport and weather updates.", "|Jane Hill ", "|Jane Hill", "|Jane Hill", "|Jane Hill", "|Jane Hill", "|Jane Hill", "|Jane Hill", "| 2013–present ||Jane Hill|| Main presenter (Friday)"]}, {"page": "Jane (given name)", "response": ["*Jane Hill (born 1969), British newsreader", "*Jane Hill (born 1936), Australian politician"]}, {"page": "BBC Weekend News", "response": ["|Jane Hill"]}, {"page": "1969 in British television", "response": ["* 10 June – Jane Hill, journalist and newsreader"]}, {"page": "Richard Osman", "response": ["Osman attended Warden Park School in Cuckfield. While still at school, he gained his first broadcasting experience, as a regular contributor to Turn It Up, an open-access music show which went out on Sunday evenings on BBC Radio Sussex (the show was also notable for giving early broadcast experience to BBC news journalist Jane Hill and radio DJ Jo Whiley). From 1989 to 1992, he studied Politics and Sociology at Trinity College, Cambridge, where he was a contemporary of Pointless co-presenter Alexander Armstrong, who read English."]}, {"page": "Charles H. McNutt", "response": ["McNutt described the theoretical approach of the University of New Mexico curriculum as Boazian, with an emphasis on culture history. In 1955 he started in the Ph. D. program at the University of Michigan for his doctorate in 1955, where he described his education as geared in a more evolutionary anthropological direction. This was during Albert Spaulding’s time at Michigan, an influential archaeologist known for his reliance on quantitative methods for typifying cultures. McNutt's first  experience with Southeastern archaeology was during a trip in 1955 as a graduate student to Poverty Point with Albert Spaulding and James B. Griffin,Shannon Tushingham, Jane Hill, Charles H. McNutt, 2003. Histories of Southeastern Archaeology. University of Alabama Press, Tuscaloosa. to meet James A. Ford and other noted archaeologists of the time to discuss the site. They subsequently visited Monk's Mound in Cahokia and attended the 14th annual SEAC (Southeastern Archaeological Conference). However, it was not until 1959 that he began work in what would later become his area of expertise, the southeastern United States. McNutt worked continually in the field during this period, excavating and publishing on a number of sites in the Northern Great Plains, although his doctoral dissertation, on the early Puebloan occupation of the Tesque By-pass site, was indicative of his continued interest in the Southwest.", "McNutt is also known for his close work with his graduate students, who have included many now notable archaeologists, among them Dr. Shannon Tushingham of Washington State University, Dr. Jane Hill of the University of Pennsylvania, Guy Weaver, RPA, with whom McNutt has published on multiple sites, such as the Duncan Tract Site,\"The Duncan Tract Site, (40TR27), Trousdale County, Tennessee.\" 1983.  Tennessee Valley Authority, Publications in Anthropology, no. 33.  Senior author, with Guy G. Weaver. and Lisa Lumb, with whom he published Units 2 and 6 of the Chucalissa Indian village site.Chucalissa: Excavations in Units 2 and 6; 1959-67. 1988.  M.S.U. Anthropological Research Center, Occasional Papers,  no. 15. (with Lisa Cutts Lumb.) McNutt has written numerous papers and monographs, and edited such books as Prehistory of the Central Mississippi Valley and The Woodland-Mississipian Transition of the Midsouth.", "*Histories of Southeastern Archaeology. 2002 ed., with Jane Hill and Shannon Tushingham. University of Alabama Press, Tuscaloosa."]}, {"page": "List of alumni of Queen Mary University of London", "response": ["* Jane Hill – British newsreader, BBC News"]}, {"page": "Jane Hill (disambiguation)", "response": ["Jane Hill (born 1969) is a British newsreader.", "Jane Hill may also refer to:", "* Jane Hill (ecologist), British-born academic", "* Jane Hill (politician) (1936–2015), Australian politician"]}]}}