{"wiki_id": "http://www.wikidata.org/entity/Q1281472", "itemLabel": "Margaretta Scott", "itemDescription": "British actor (1912-2005)", "wikipedia_url": "https://en.wikipedia.org/wiki/Margaretta_Scott", "wikipedia_page": {"main": "Margaretta Mary Winifred Scott (13 February 1912 – 15 April 2005) was an English stage, screen and television actress whose career spanned over seventy years. She is best remembered for playing the eccentric widow Mrs. Pumphrey in the BBC television series All Creatures Great and Small (1978–1990).", "link_mentions": [{"page": "February 13", "response": ["*  1912   – Margaretta Scott, English actress (d. 2005)"]}, {"page": "Through the Looking-Glass", "response": ["* A dramatised audio-recorded version, directed by Douglas Cleverdon, was released in 1959 by Argo Records. The book is narrated by Margaretta Scott, starring Jane Asher as Alice, along with actors Frank Duncan (Humpty Dumpty, Red King, Frog), Tony Church, Norman Shelley, and Carleton Hobbs.Cleverdon, Douglas (1959). Alice Through the Looking Glass [sound recording]. Written by Lewis Carroll (1872). London: Argo. Retrieved via National Library of Australia and Archived on 10 April 2020."]}, {"page": "Elizabeth R", "response": ["Elizabeth R featured many well-known British actors, including Malcolm McFee, Michael Williams, Margaretta Scott, John Woodvine, James Laurenson, Angela Thorne, Brian Wilde, Robin Ellis, Robert Hardy, and Peter Egan.", "* Margaretta Scott - Catherine de' Medici"]}, {"page": "Things to Come", "response": ["Things to Come (also known in promotional material as H. G. Wells' Things to Come) is a 1936 British black-and-white science fiction film from United Artists, produced by Alexander Korda, directed by William Cameron Menzies, and written by H. G. Wells. The film stars Raymond Massey, Edward Chapman, Ralph Richardson, Margaretta Scott, Cedric Hardwicke, Maurice Braddell, Derrick De Marney, and Ann Todd.", "* Margaretta Scott as Roxana Black/Rowena Cabal", "* Margaretta Scott is credited with the dual role of Roxana Black and Rowena Cabal, but the latter character does not appear in the longest surviving cut of the film."]}, {"page": "Celia Johnson", "response": ["She attended St Paul's Girls' School in London from 1919 until 1926, and played in the school's orchestra under Gustav Holst. She acted in school productions, but had no other acting experience, when she was accepted to study at Royal Academy of Dramatic Art in 1926, where she was in the same class as Margaretta Scott. She later spent a term in Paris, studying under Pierre Fresnay at the Comédie Française. She later recalled her choice of an acting career with the comment, \"I thought I'd rather like it. It was the only thing I was good at. And I thought it might be rather wicked.\""]}, {"page": "BBC Television Shakespeare", "response": ["The BBC had screened many Shakespearean adaptations before, and by 1978, the only plays which they had not shown in specifically made-for-TV adaptations were Henry VIII, Pericles, Timon of Athens, Titus Andronicus and The Two Gentlemen of Verona.Willis, p. 8. However, despite this level of experience, they had never produced anything on the scale of the Shakespeare Series. Exclusively made-for-television Shakespearean productions had commenced on 5 February 1937 with the live broadcast of Act 3, Scene 2 from As You Like It, directed by Robert Atkins, and starring Margaretta Scott as Rosalind and Ion Swinley as Orlando. Later that evening, the wooing scene from Henry V was broadcast, directed by George More O'Ferrall, and starring Henry Oscar as Henry and Yvonne Arnaud as Katherine. O'Ferrall would oversee numerous broadcasts of Shakespearean extracts over the course of 1937, including Mark Antony's funeral speech from Julius Caesar, with Henry Oscar as Antony (11 February), several scenes between Benedick and Beatrice from Much Ado About Nothing, featuring Henry Oscar and Margaretta Scott (also 11 February), several scenes between Macbeth and Lady Macbeth from Macbeth, starring Laurence Olivier and Judith Anderson (25 March), and a heavily truncated version of Othello, starring Baliol Holloway as Othello, Celia Johnson as Desdemona and D.A. Clarke-Smith as Iago (14 December)."]}, {"page": "2005 in film", "response": ["| style=\"text-align:center;\"| 15 || Margaretta Scott || style=\"text-align:center;\"| 93 || style=\"text-align:center;\"| UK || style=\"text-align:center;\"| Actress || "]}, {"page": "Cholesbury", "response": ["In the churchyard there are at several gravestones of interest. One commemorates David Newton who died in 1878, a Royal Marine who fought at the Battle of Trafalgar in 1805.David Newton's story Cholesbury-cum-St leonards LHG newsletter 2005 p8 Retrieved 15 June 2009 There are adjoining gravestones of two sisters Margaret Lowenfeld a pioneer of child psychology and psychotherapy who died in 1973, her sister Helena Wright known internationally for her campaigning work in birth control and family planning who died in 1982, and their cousin's wife Claire Loewenfeld who wrote books on herb gardening and nutrition and died in 1974. Margaretta Scott (Wooldridge) also lies here."]}, {"page": "Hawridge", "response": ["* Margaretta Scott English actor of stage, film and television (1912–2005) lived in the village with her husband Composer John Wooldridge, daughter actor Susan Wooldridge and son theatre producer Hugh Wooldridge during the 1950s"]}, {"page": "Argo Records (UK)", "response": ["The company at this time recorded dramatised versions of Alice in Wonderland (1958) and Through the Looking-Glass, both directed by Douglas Cleverdon and both starring Jane Asher in the title role, with actors Tony Church, Norman Shelley, and Carleton Hobbs, with Margaretta Scott as the narrator; and The Wind in the Willows (1960), adapted and produced by Toby Robertson, with Richard Goolden as Mole, Frank Duncan as Rat, Tony Church as Badger, and Norman Shelley as Toad, with Patrick Wymark as the narrator. Another significant recording from this era is the premiere recording of Benjamin Britten's one-act opera/miracle play for children, Noye's Fludde (1961)."]}, {"page": "Elizabeth David", "response": ["At Regent's Park David made little professional progress. The company was distinguished, headed by Nigel Playfair and Jack Hawkins, and, in the leading female roles, Anna Neagle and Margaretta Scott.\"Open Air Theatre\", The Times, 22 May 1934, p. 13 David was restricted to bit parts.Chaney, p. 67; and Cooper pp. 42–43 Among her colleagues in the company was an actor nine years her senior, Charles Gibson Cowan. His disregard for social conventions appealed strongly to her, and she also found him sexually irresistible. His being married did not daunt either of them, and they began an affair that outlasted her stage career.Cooper, p. 47 Chaney comments, \"Cowan was the ultimate outsider. He was working class, left wing, Jewish, an actor, a pickpocket, a vagabond, who lived in caves in Hastings for a time. Her mother called him a 'pacifist worm'. He was a sexual presence, and slept with anything that moved.\"Treneman, Ann. \"Elizabeth David's final recipe: take one culinary saint, two rival books, add wine and sex and stir to boiling point\", The Independent, 2 December 1998. Retrieved 22 November 2017 David's mother strongly disapproved, and tried to put a stop to the affair.Chaney, p. 89 She arranged for her daughter to spend several weeks holidaying with family and friends in Malta in the first half of 1936 and in Egypt later in the same year, but in her 1999 biography Artemis Cooper comments that David's lengthy absence failed to detach her from her involvement with Cowan.Cooper, pp. 52–54 During her stay in Malta, David was able to spend time learning from her hostess's cook, Angela, who was happy to pass on her expertise. Although she could produce elaborate grand dinners when required, the most important lesson she taught David was to work day in, day out, with all available ingredients, showing her how to make an old bird or a stringy piece of meat into a good dish.Cooper, p. 53"]}, {"page": "Deaths in April 2005", "response": ["*Margaretta Scott, 93, English actress (\"Mrs. Pumphrey\" in All Creatures Great and Small)."]}, {"page": "Allan Aynesworth", "response": ["In the 1930s Aynesworth continued to appear in West End plays. His Lord Porteus attracted enthusiastic reviews when The Circle was revived in 1931. He maintained a keen interest on the doings of a new generation of actors. Asked by an interviewer in 1937 who he thought were the \"real thing\" among the younger actors, he replied, \"that young fellow who played Hamlet – Gielgud – yes, he's certainly the real thing; and that other boy... Laurence Olivier, and the little girl who's played some Shakespeare, Margaretta Scott\". When Gielgud produced and starred in The Importance of Being Earnest in 1938 he and his colleagues were delighted and encouraged when Aynesworth came backstage after the first night and told them he found the production delightful, catching the original gaiety and \"exactly the right atmosphere\".Croall, p. 255"]}, {"page": "2005 in the United Kingdom", "response": ["* 15 April – Margaretta Scott, actress (born 1912)"]}, {"page": "Susan Wooldridge", "response": ["Wooldridge was born in London, England, and educated at convent schools, the Central School of Speech and Drama, and L'Ecole Jacques Lecoq, Paris. She is the daughter of actress Margaretta Scott and composer John Wooldridge. Her brother is Hugh Wooldridge."]}, {"page": "Hugh Wooldridge", "response": ["Hugh Wooldridge is an English theatre director, theatre and television producer and writer, and stage lighting designer. Wooldridge was born in Amersham, Bucks, the son of British composer John Wooldridge and actress Margaretta Scott. He is the brother of actress Susan Wooldridge. Wooldridge currently specialises in large productions, often at the Royal Albert Hall, London.  He also teaches, gives master-classes and runs workshops."]}, {"page": "Catholic Association of Performing Arts", "response": ["Deceased former members of the Guild include actors Sir Alec Guinness (a former Vice-President of the Guild), Patricia Hayes (who was a former Chair of the Guild, as was her son, actor Richard O'Callaghan), Danny La Rue, Michael Williams (a former Chair), Margaretta Scott, Moira Lister, Eamonn Andrews (a former Chair), Lionel Jeffries (a former Chair) and Frank Finlay. Guinness and Jeffries were both converts. Member Vince Powell was a noted television writer and producer. Last of the Summer Wine star Joe Gladwin was Northern representative before his death.The Catholic Directory of England and Wales, 1981, pg 393"]}, {"page": "List of Bergerac episodes", "response": ["| Paul Brooke, Amanda Redman, Barrie Ingham, Margaretta Scott, Ron Pember, Nicholas McArdle, Jim McManus"]}, {"page": "2005 in British television", "response": ["|Margaretta Scott"]}, {"page": "Erik Chitty", "response": ["| colspan=2                  | Margaretta Scott"]}, {"page": "List of alumni of the Royal Academy of Dramatic Art", "response": ["*Margaretta Scott (Acting Diploma 1929)"]}, {"page": "John Wooldridge", "response": ["Wooldridge's first marriage was in 1942 to Mary Latham, with whom he had a son, Morris Latham, who also became a pilot. The union ended in divorce. He subsequently married the actress Margaretta Scott in 1948, with whom he had a daughter, Susan Wooldridge, who also became an actress; and a son, Hugh Wooldridge."]}, {"page": "List of Upstairs, Downstairs (1971 TV series) characters", "response": ["|Margaretta Scott || Lady Castleton, Lady Marjorie's aunt || 1 || 1 || 1", "Portrayed by Margaretta Scott, Lady Southwold's sister, Lady Katherine \"Kate\" Castleton (died 1921), was to have presented Elizabeth to King Edward VII at a Londonderry House ball in 1905. By 1912, she was known as 'stone deaf and not very good company' dying in 1921 and leaving James £1,000, some of which he used to buy an aeroplane."]}, {"page": "1912 in the United Kingdom", "response": ["* 13 February – Margaretta Scott, actress (died 2005)"]}, {"page": "The Man from Morocco", "response": ["* Margaretta Scott as Manuela de Roya"]}, {"page": "List of adventure films of the 1930s", "response": ["|Return of the Scarlet Pimpernel||Hanns Schwarz||Barry K. Barnes, Sophie Stewart, Margaretta Scott, James Mason||United Kingdom||"]}, {"page": "List of British films of 1942", "response": ["|Sabotage at Sea||Leslie S. Hiscott||David Hutcheson, Margaretta Scott||War||"]}, {"page": "List of British films of 1945", "response": ["|The Man from Morocco||Mutz Greenbaum||Anton Walbrook, Margaretta Scott||World War II||"]}, {"page": "Margueretta Scott", "response": ["#REDIRECT Margaretta Scott"]}, {"page": "Fanny by Gaslight (film)", "response": ["* Margaretta Scott as Alicia Seymore"]}, {"page": "All Creatures Great and Small (1978 TV series)", "response": ["Margaretta Scott appears as the rich dog-owner Mrs Pumphrey. One of her staff, irked at having to look after his employer's pampered Pekingese, Tricki Woo, is William Hodgekin (Teddy Turner). He longs for it to \"have its chips\" and succumb to illness, which is why he grumbles whenever the vets pay a visit."]}, {"page": "Idol of Paris", "response": ["*Margaretta Scott – Empress Eugenie "]}, {"page": "Action for Slander", "response": ["* Margaretta Scott as Josie Bradford"]}, {"page": "Landfall (film)", "response": ["* Margaretta Scott as Mrs. Burnaby "]}, {"page": "The Scamp", "response": ["* Margaretta Scott as Mrs. Blundell  "]}, {"page": "Star Chamber (play)", "response": ["The BBC broadcast the play on the Home Service in May 1940 starring Margaretta Scott, and again in June 1941.The Times, 18 May 1940, p. 11 and The Manchester Guardian, 24 June 1941, p. 2 In 1991, BBC television mounted productions of the Tonight at 8.30 plays with Joan Collins taking the Lawrence roles, but Star Chamber was omitted.Truss, Lynne. \"Tonight at 8.30\", The Times, 15 April 1991 The play was not included in the Heinemann edition of the Tonight at 8.30 plays published in 1936, and was first published in 1939 in Rose Window, a tribute to St Bartholomew's Hospital by twenty-five authors, including Vera Brittain, J.B. Priestley, Hugh Walpole, Emlyn Williams and Radclyffe Hall as well as Coward. The book was illustrated by Anna Zinkeisen, who contributed a drawing of Xenia James (Lawrence's role) to accompany Star Chamber.Coward bibliography at the Noel Coward website In connection with Coward's centenary in 1999, the play was printed in the 7th volume of the Methuen series of Coward's Collected Plays."]}, {"page": "The Return of the Scarlet Pimpernel", "response": ["The Return of the Scarlet Pimpernel is a 1937 British thriller film directed by Hanns Schwarz and starring Barry K. Barnes, Sophie Stewart, Margaretta Scott and James Mason. It is a sequel to the 1934 film The Scarlet Pimpernel based on the stories by Baroness Emmuska Orczy.", "* Margaretta Scott as Theresa Cobarrus"]}]}}