{"wiki_id": "http://www.wikidata.org/entity/Q128121", "itemLabel": "Mick Jagger", "itemDescription": "English songwriter, singer of The Rolling Stones", "wikipedia_url": "https://en.wikipedia.org/wiki/Mick_Jagger", "wikipedia_page": {"main": "Sir Michael Philip Jagger (born 26 July 1943) is an English singer, songwriter, actor, and film producer who has achieved international fame as the lead vocalist and one of the founder members of the Rolling Stones. His songwriting partnership with Keith Richards is one of the most successful in history. Jagger's career has spanned over six decades, and he has been described as \"one of the most popular and influential frontmen in the history of rock & roll\". His distinctive voice and energetic live performances, along with Richards' guitar style, have been the Rolling Stones's trademark throughout the band's career. Jagger gained press notoriety for his romantic involvements and was often portrayed as a countercultural figure.\nJagger was born and grew up in Dartford, Kent. He studied at the London School of Economics before abandoning his studies to join the Rolling Stones. Jagger has written most of the Rolling Stones' songs together with Richards, and they continue to collaborate musically. In the late 1960s, Jagger starred in the films Performance (1970) and Ned Kelly (1970) to a mixed reception. In the 2000s, he co-founded a film production company, Jagged Films, and through them has produced a number of feature films, beginning with the 2001 historical drama Enigma.  He began a solo recording career in 1985, releasing his first album, She's the Boss and joined the electric supergroup SuperHeavy in 2009. Relationships with the Stones' members, particularly Richards, deteriorated during the 1980s, but Jagger has always found more success with the band than with his solo and side projects. Jagger has been married and divorced once, and has had several other relationships, resulting in eight children with five women.\nIn 1989, Jagger was inducted into the Rock and Roll Hall of Fame, and in 2004 into the UK Music Hall of Fame with the Rolling Stones. As a member of the Rolling Stones, and as a solo artist, he reached number one on the UK and US singles charts with 13 singles, the top 10 with 32 singles and the top 40 with 70 singles. In 2003, he was knighted for his services to popular music.", "link_mentions": [{"page": "Andy Warhol", "response": ["According to Bob Colacello, Warhol devoted much of his time to rounding up new, rich patrons for portrait commissions—including Shah of Iran Mohammad Reza Pahlavi, his wife Empress Farah Pahlavi, his sister Princess Ashraf Pahlavi, Mick Jagger, Liza Minnelli, John Lennon, Diana Ross, and Brigitte Bardot. In 1979, reviewers disliked his exhibits of portraits of 1970s personalities and celebrities, calling them superficial, facile and commercial, with no depth or indication of the significance of the subjects."]}, {"page": "Alexis Korner", "response": ["In 1961, Korner and Davies formed Blues Incorporated,   initially a loose-knit group of musicians with a shared love of electric blues and R&B music. The group included, at various times, Charlie Watts, Jack Bruce, Ginger Baker, Long John Baldry, Graham Bond, Danny Thompson and Dick Heckstall-Smith. It also attracted a wider crowd of mostly younger fans, some of whom occasionally performed with the group, including Mick Jagger, Keith Richards, Brian Jones, Geoff Bradford, Rod Stewart, John Mayall and Jimmy Page."]}, {"page": "Brigitte Bardot", "response": ["Bardot's fourth and current husband is Bernard d'Ormale; they have been married since 16 August 1992. In 2018, in an interview accorded to Le Journal du Dimanche, she denied rumors of relationships with Johnny Hallyday, Jimi Hendrix, and Mick Jagger."]}, {"page": "Brion Gysin", "response": ["According to José Férez Kuri, author of Brion Gysin: Tuning in to the Multimedia Age (2003) and co-curator of a major retrospective of the artist's work at The Edmonton Art Gallery in 1998, Gysin's wide range of \"radical ideas would become a source of inspiration for artists of the Beat Generation, as well as for their successors (among them David Bowie, Mick Jagger, Keith Haring, and Laurie Anderson)\".Kuri, Tuning in to the Multimedia Age, coverflap. Other artists include Genesis P-Orridge, John Zorn (as displayed on the 2013's Dreamachines album) and Brian Jones."]}, {"page": "Buddy Holly", "response": ["Mick Jagger saw Holly performing live in Woolwich, London, during a tour of England; Jagger particularly remembered Holly's performance of \"Not Fade Away\" – a song that also inspired Keith Richards, who modeled his early guitar playing on the track. The Rolling Stones had a hit version of the song in 1964. Richards later said, \"[Holly] passed it on via the Beatles and via [the Rolling Stones] ... He's in everybody\"."]}, {"page": "Bo Diddley", "response": ["After the funeral service, a tribute concert was held at the Martin Luther King Center in Gainesville, Florida, and featured guest performances by his son and daughter, Ellas A. McDaniel and Evelyn \"Tan\" Cooper; long-time background vocalist and original Boette, Gloria Jolivet; long-time friend, co-producer, and former Bo Diddley & Offspring guitarist Scott \"Skyntyte\" Free; and Eric Burdon. In the days following his death, tributes were paid by then-President George W. Bush, the United States House of Representatives, and musicians and performers including B. B. King, Ronnie Hawkins, Mick Jagger, Ronnie Wood, George Thorogood, Eric Clapton, Tom Petty, Robert Plant, Elvis Costello, Bonnie Raitt, Robert Randolph and the Family Band and Eric Burdon. Burdon used video footage of the McDaniel family and friends in mourning for a video promoting his ABKCO Records release \"Bo Diddley Special\".", "Bo Diddley was posthumously awarded a Doctor of Fine Arts degree by the University of Florida for his influence on American popular music. In its People in America radio series, about influential people in American history, the Voice of America radio service paid tribute to him, describing how \"his influence was so widespread that it is hard to imagine what rock and roll would have sounded like without him.\" Mick Jagger stated that \"he was a wonderful, original musician who was an enormous force in music and was a big influence on the Rolling Stones. He was very generous to us in our early years and we learned a lot from him\". Jagger also praised the late star as a one-of-a-kind musician, adding, \"We will never see his like again\". The documentary film Cheat You Fair: The Story of Maxwell Street by director Phil Ranstrom features Bo Diddley's last on-camera interview."]}, {"page": "Dave Grohl", "response": ["Since his first appearance in 1992, Grohl has been a musical guest on Saturday Night Live 14 timesmore than any other musician. He has appeared with Nirvana, Foo Fighters, Them Crooked Vultures, Mick Jagger, and Tom Petty and the Heartbreakers."]}, {"page": "David Bowie", "response": ["Conn quickly began to promote Bowie. His debut single, \"Liza Jane\", credited to Davie Jones with the King Bees, was not commercially successful. Dissatisfied with the King Bees and their repertoire of Howlin' Wolf and Willie Dixon covers, Bowie quit the band less than a month later to join the Manish Boys, another blues outfit, who incorporated folk and soul—\"I used to dream of being their Mick Jagger\", Bowie was to recall. Their cover of Bobby Bland's \"I Pity the Fool\" was no more successful than \"Liza Jane\", and Bowie soon moved on again to join the Lower Third, a blues trio strongly influenced by the Who. \"You've Got a Habit of Leaving\" fared no better, signalling the end of Conn's contract. Declaring that he would exit the pop music world \"to study mime at Sadler's Wells\", Bowie nevertheless remained with the Lower Third. His new manager, Ralph Horton, later instrumental in his transition to solo artist, helped secure him a contract with Pye Records. Publicist Tony Hatch signed Bowie on the basis that he wrote his own songs. Dissatisfied with Davy (and Davie) Jones, which in the mid-1960s invited confusion with Davy Jones of the Monkees, he took on the stage name David Bowie after the 19th-century American pioneer James Bowie and the knife he had popularised. His first release under the name was the January 1966 single \"Can't Help Thinking About Me\", recorded with the Lower Third. The single flopped like its predecessors.", "Tonight (1984), another dance-oriented album, found Bowie collaborating with Tina Turner and, once again, Iggy Pop. It included a number of cover songs, among them the 1966 Beach Boys hit \"God Only Knows\". The album bore the transatlantic Top 10 hit \"Blue Jean\", itself the inspiration for a short film that won Bowie a Grammy Award for Best Short Form Music Video, Jazzin' for Blue Jean. Bowie performed at Wembley Stadium in 1985 for Live Aid, a multi-venue benefit concert for Ethiopian famine relief. During the event, the video for a fundraising single was premiered, Bowie's duet with Mick Jagger. \"Dancing in the Street\" quickly went to number one on release. The same year, Bowie worked with the Pat Metheny Group to record \"This Is Not America\" for the soundtrack of The Falcon and the Snowman. Released as a single, the song became a Top 40 hit in the UK and US.", "Bowie declared himself gay in an interview with Michael Watts for a 1972 issue of Melody Maker, coinciding with his campaign for stardom as Ziggy Stardust. According to Buckley, \"If Ziggy confused both his creator and his audience, a big part of that confusion centred on the topic of sexuality.\" In a September 1976 interview with Playboy, Bowie said, \"It's true—I am a bisexual. But I can't deny that I've used that fact very well. I suppose it's the best thing that ever happened to me.\" His first wife, Angie, supports his claim of bisexuality and alleges that Bowie had a relationship with Mick Jagger."]}, {"page": "Ed Sullivan", "response": ["The Rolling Stones famously capitulated during their fifth appearance on the show, in 1967, when Mick Jagger was told to change the titular lyric of \"Let's Spend the Night Together\" to \"Let's spend some time together\". \"But Jagger prevailed,\" wrote Nachman, by deliberately calling attention to the censorship, rolling his eyes, mugging, and drawing out the word \"t-i-i-i-me\" as he sang the revised lyric. Sullivan was angered by the insubordination, but the Stones did make one additional appearance on the show, in 1969."]}, {"page": "Gram Parsons", "response": ["While in England with the Byrds in the summer of 1968, Parsons left the band due to his concerns over a planned concert tour of South Africa, and after speaking to Mick Jagger and Keith Richards about the tour, he cited opposition to that country's apartheid policies. There has been some doubt expressed by Hillman over the sincerity of Parsons' protest. It appears that Parsons was mostly apolitical, although he did refer to one of the younger African-American butlers in the Connor household as being \"like a brother\" to him in an interview. During this period Parsons became acquainted with Mick Jagger and Keith Richards of The Rolling Stones. Before Parsons' departure from the Byrds, he had accompanied the two Rolling Stones to Stonehenge (along with McGuinn and Hillman) in the English county of Wiltshire. Immediately after leaving the band, Parsons stayed at Richards' house and the pair developed a close friendship over the next few years, with Parsons reintroducing the guitarist to country music. According to Stones' confidant and close friend of Parsons, Phil Kaufman, the two would sit around for hours playing obscure country records and trading off on various songs with their guitars."]}, {"page": "James Brown", "response": ["*Mr. Dynamite: The Rise of James Brown (2014), released in April 2014, written and directed by Alex Gibney, produced by Mick Jagger.", "* Get on Up (2014), released in theaters on August 1, 2014. Chadwick Boseman plays the role of James Brown in the film. Originally, Mick Jagger and Brian Grazer had begun producing a documentary film on Brown in 2013. A fiction film had been in the planning stages for many years and was revived when Jagger read the script by Jez and John-Henry Butterworth."]}, {"page": "Joey Ramone", "response": ["Ramone's signature cracks, hiccups, snarls, crooning, and youthful voice made Joey one of punk rock's most recognizable voices. Allmusic.com wrote that \"Joey Ramone's signature bleat was the voice of punk rock in America.\" As his vocals matured and deepened through his career, so did the Ramones' songwriting, leaving a notable difference from his initial melodic and callow style—two notable tracks serving as examples are \"Somebody Put Something in My Drink\" and \"Mama's Boy\". Dee Dee Ramone was quoted as saying \"All the other singers [in New York] were copying David Johansen (of the New York Dolls), who was copying Mick Jagger... But Joey was unique, totally unique.\"Quoted in Strongman (2008), p. 61."]}, {"page": "John Lennon", "response": ["In early 1974, Lennon was drinking heavily and his alcohol-fuelled antics with Harry Nilsson made headlines. In March, two widely publicised incidents occurred at The Troubadour club. In the first incident, Lennon stuck an unused menstrual pad on his forehead and scuffled with a waitress. The second incident occurred two weeks later, when Lennon and Nilsson were ejected from the same club after heckling the Smothers Brothers. Lennon decided to produce Nilsson's album Pussy Cats, and Pang rented a Los Angeles beach house for all the musicians. After a month of further debauchery, the recording sessions were in chaos, and Lennon returned to New York with Pang to finish work on the album. In April, Lennon had produced the Mick Jagger song \"Too Many Cooks (Spoil the Soup)\" which was, for contractual reasons, to remain unreleased for more than 30 years. Pang supplied the recording for its eventual inclusion on The Very Best of Mick Jagger (2007).The Very Best of Mick Jagger liner notes"]}, {"page": "July 26", "response": ["*  1943   – Mick Jagger, English singer-songwriter, producer, and actor"]}, {"page": "Jimi Hendrix", "response": ["In mid-November, they performed at the Bag O'Nails nightclub in London, with Clapton, John Lennon, Paul McCartney, Jeff Beck, Pete Townshend, Brian Jones, Mick Jagger, and Kevin Ayers in attendance. Ayers described the crowd's reaction as stunned disbelief: \"All the stars were there, and I heard serious comments, you know 'shit', 'Jesus', 'damn' and other words worse than that.\" The performance earned Hendrix his first interview, published in Record Mirror with the headline: \"Mr. Phenomenon\". \"Now hear this ... we predict that [Hendrix] is going to whirl around the business like a tornado\", wrote Bill Harry, who asked the rhetorical question: \"Is that full, big, swinging sound really being created by only three people?\" Hendrix said: \"We don't want to be classed in any category ... If it must have a tag, I'd like it to be called, 'Free Feeling'. It's a mixture of rock, freak-out, rave and blues\". Through a distribution deal with Polydor Records, the Experience's first single, \"Hey Joe\", backed with \"Stone Free\", was released on December 16, 1966.  After appearances on the UK television shows Ready Steady Go! and the Top of the Pops, \"Hey Joe\" entered the UK charts on December 29 and peaked at number six.; . Further success came in March 1967 with the UK number three hit \"Purple Haze\", and in May with \"The Wind Cries Mary\", which remained on the UK charts for eleven weeks, peaking at number six. On March 12, 1967, he performed at the Troutbeck Hotel, Ilkley, West Yorkshire, where, after about 900 people turned up (the hotel was licensed for 250) the local police stopped the gig due to safety concerns."]}, {"page": "Leni Riefenstahl", "response": ["Riefenstahl photographed the 1972 Olympic Games in Munich, and rock star Mick Jagger along with his wife Bianca for The Sunday Times. Years later, Riefenstahl photographed Las Vegas entertainers Siegfried & Roy. She was guest of honour at the 1976 Olympic Games in Montreal, Quebec, Canada."]}, {"page": "MTV", "response": ["Lois's first pitch to the network was roundly rejected when Lois insisted that rock stars like Mick Jagger should be crying when they said the tag line, not unlike his failed 'Maypo' revamp. His associate, and Seibert mentor Dale Pon took over the campaign, strategically and creatively, and was able to get the campaign greenlit when he laughed the tears out of the spots. From then on –with the exception of the closely logos on the first round of commercials– Pon was the primary creative force.", "The campaign featured popular artists and celebrities, including Pete Townshend, Pat Benatar, Adam Ant, David Bowie, the Police, Kiss, Culture Club, Billy Idol, Hall & Oates, Cyndi Lauper, Madonna, Lionel Richie, Ric Ocasek, John Mellencamp, Peter Wolf, Joe Elliott, Stevie Nicks, Rick Springfield, and Mick Jagger, interacting with the MTV logo on-air and encouraging viewers to call their pay television providers and request that MTV be added to their local channel lineups. Eventually, the slogan became so ubiquitous that it made an appearance as a lyric sung by Sting on the Dire Straits song \"Money for Nothing\", whose music video aired in regular rotation on MTV when it was first released in 1985."]}, {"page": "Monty Python", "response": ["Mick Jagger featured in a promotional video for the shows: \"Who wants to see that again, really? It's a bunch of wrinkly old men trying to relive their youth and make a load of money—the best one died years ago!\" Michael Palin stated that the final reunion show on 20 July 2014 would be the last time that the troupe would perform together. It was screened to 2,000 cinemas around the world. Prior to the final night, Idle stated, \"It is a world event and that’s really quite exciting. It means we’re actually going to say goodbye publicly on one show. Nobody ever has the chance to do that. The Beatles didn’t get a last good night.\" The last show was broadcast in the UK on Gold TV and internationally in cinemas by Fathom Events through a Dish Network satellite link."]}, {"page": "Martin Scorsese", "response": ["Scorsese directed the pilot for Vinyl written by Terence Winter and George Mastras, with Mick Jagger producing and Mastras as showrunner. The series stars Bobby Cannavale as Richie Finestra, founder and president of a top-tier record label, set in 1970s New York City's drug-and sex-fueled music business as punk and disco were breaking out, all told through the eyes of Finestra trying to resurrect his label and find the next new sound. Filming began on July 25, 2014. Co-stars include Ray Romano, Olivia Wilde, Juno Temple, Andrew Dice Clay, Ato Essandoh, Max Casella, and James Jagger. On December 2, 2014, Vinyl was picked up by HBO. The series lasted one season. Scorsese has acted as executive producer of several indie films, like the 2014 The Third Side of the River (directed by his protege Celina Murga), another 2014 film Revenge of the Green Dragons (co-directed by Andrew Lau, whose film Infernal Affairs inspired The Departed), as well as Bleed for This and Free Fire."]}, {"page": "Musical ensemble", "response": ["Other times, the vocalist will bring another musical \"voice\" to the table, most commonly a harmonica or percussion; Mick Jagger, for example, played harmonica and percussion instruments like maracas and tambourine whilst singing at the same time. Keith Relf of the Yardbirds played harmonica frequently, though not often while also singing. Ozzy Osbourne was also known to play the harmonica on some occasions (i.e. \"The Wizard\" by Black Sabbath). Vocalist Robert Brown of lesser known steampunk band Abney Park plays harmonica, accordion, and darbuka in addition to mandolin. Flutes are also commonly used by vocalists, most notably Ian Anderson of Jethro Tull and Ray Thomas of the Moody Blues, though these are difficult to play while singing at the same time."]}, {"page": "Marrakesh", "response": ["As one of the principal tourist cities in Africa, Marrakesh has over 400 hotels. Mamounia Hotel is a five-star hotel in the Art Deco-Moroccan fusion style, built in 1925 by Henri Prost and A. Marchis. It is considered the most eminent hotel of the city and has been described as the \"grand dame of Marrakesh hotels.\" The hotel has hosted numerous internationally renowned people including Winston Churchill, Prince Charles of Wales and Mick Jagger. Churchill used to relax within the gardens of the hotel and paint there. The 231-room hotel, which contains a casino, was refurbished in 1986 and again in 2007 by French designer Jacques Garcia. Other hotels include Eden Andalou Hotel, Hotel Marrakech, Sofitel Marrakech, Palm Plaza Hotel & Spa, Royal Mirage Hotel, Piscina del Hotel, and Palmeraie Palace at the Palmeraie Rotana Resort.\"Palmeraie Rotana Resort \" In March 2012, Accor opened its first Pullman-branded hotel in Marrakech, Pullman Marrakech Palmeraie Resort & Spa. Set in a  olive grove at La Palmeraie, the hotel has 252 rooms, 16 suites, six restaurants and a  conference room."]}, {"page": "Philip Glass", "response": ["Glass has collaborated with recording artists such as Paul Simon, Suzanne Vega, Mick Jagger, Leonard Cohen, David Byrne, Uakti, Natalie Merchant, S'Express (Glass remixed their track Hey Music Lover in 1989) and Aphex Twin (yielding an orchestration of Icct Hedral in 1995 on the Donkey Rhubarb EP). Glass's compositional influence extends to musicians such as Mike Oldfield (who included parts from Glass's North Star in Platinum), and bands such as Tangerine Dream and Talking Heads. Glass and his sound designer Kurt Munkacsi produced the American post-punk/new wave band Polyrock (1978 to the mid-1980s), as well as the recording of John Moran's The Manson Family (An Opera) in 1991, which featured punk legend Iggy Pop, and a second (unreleased) recording of Moran's work featuring poet Allen Ginsberg."]}, {"page": "The Rocky Horror Picture Show", "response": ["In the stage productions, actors generally did their own make-up; however, for the film, the producers chose Pierre La Roche, who had previously been a make-up artist for Mick Jagger and David Bowie, to redesign the make-up for each character. Production stills were taken by rock photographer Mick Rock, who has published a number of books from his work. In Rocky Horror: From Concept to Cult, designer Sue Blane discusses the Rocky Horror costumes' influence on punk music style, opining \"[It was a] big part of the build-up [to punk].\" She states that ripped fishnet stockings, glitter, and coloured hair were directly attributable to Rocky Horror."]}, {"page": "Roxy Music", "response": ["The band's self-titled debut album, produced by King Crimson's Pete Sinfield, was the first in a series of albums with increasingly sophisticated covers, with art direction by Ferry in collaboration with his friend Nick De Ville. The album artwork imitated the visual style of classic \"girlie\" and fashion magazines, featuring high-fashion shots of scantily clad models Amanda Lear, Marilyn Cole and Jerry Hall, each of whom had romances with Ferry during the time of their contributions, as well as model Kari-Ann Muller who appears on the cover of the first Roxy album but who was not otherwise involved with anyone in the band, and who later married Mick Jagger's brother Chris. The title of the fourth Roxy album, Country Life, was intended as a parody of the well-known British rural magazine of the same name, and the visually punning front cover photo featured two models (two German fans, Constanze Karoli—sister of Can's Michael Karoli—and Eveline Grunwald) clad only in semi-transparent lingerie standing against an evergreen hedge. As a result, in many areas of the United States the album was sold in an opaque plastic wrapper because retailers refused to display the cover. Later, an alternative cover, featuring just a picture of the forest, was used."]}, {"page": "Roy Orbison", "response": ["In 1963, touring took a toll on Orbison's personal life. His wife Claudette had an affair with the contractor who built their home in Hendersonville, Tennessee. Friends and relatives attributed the breakdown of the marriage to her youth and her inability to withstand being alone and bored. When Orbison toured Britain again in the autumn of 1963, she joined him.Amburn, pp. 122–123. He was immensely popular wherever he went, finishing the tour in Ireland and Canada. Almost immediately, he toured Australia and New Zealand with the Beach Boys and returned again to Britain and Ireland, where he was so besieged by teenaged girls that the Irish police had to halt his performances to pull the girls off him.Amburn, p. 125. He travelled to Australia again, this time with the Rolling Stones. Mick Jagger later remarked, referring to a snapshot he took of Orbison in New Zealand, \"a fine figure of a man in the hot springs, he was.\"Amburn, p. 134."]}, {"page": "Smiley", "response": ["In recent times, the face now known as a smiley has evolved into a well-known image and brand, recognisable for its yellow and black features. Despite the use of smiling faces in popular culture during the early 20th century in the United States, no one in the 1960s had commercialised a smiley-design. The first time a combination of yellow and black was used for a smiling face was in late 1962, when New York City radio station WMCA released a yellow sweatshirt as part of a marketing campaign. By 1963, over 11,000 sweatshirts had been given away. They had featured in Billboard magazine and numerous celebrities had also been pictured wearing them, including actress Patsy King and Mick Jagger. The radio station used the happy face as part of a competition for listeners. When the station called listeners, any listener who answered their phone \"WMCA Good Guys!\" was rewarded with a \"WMCA good guys\" sweatshirt that incorporated the yellow and black happy face into its design. The features of the WMCA smiley was a yellow face, with black dots as eyes and had a slightly crooked smile. The outline of the face was also not smooth to give it more of a hand drawn look. Originally, the yellow and black sweatshirt (sometimes referred to as gold), had WMCA Good Guys written on the front with no smiley face."]}, {"page": "Satan", "response": ["In the early 1900s, jazz and blues became known as the \"Devil's Music\" as they were considered \"dangerous and unholy\". According to legend, blues musician Tommy Johnson was a terrible guitarist before exchanging his soul to the Devil for a guitar. Later, Robert Johnson claimed that he had sold his soul in return for becoming a great blues guitarist. Satanic symbolism appears in rock music from the 1960s. Mick Jagger assumes the role of Lucifer in the Rolling Stones' \"Sympathy for the Devil\" (1968), while Black Sabbath portrayed the Devil in numerous songs, including \"War Pigs\" (1970) and \"N.I.B.\" (1970)."]}, {"page": "Tambourine", "response": ["Singers who rarely play an instrument are likely to play the tambourine at concerts: among the most well-known examples are Mick Jagger of the Rolling Stones, Jim Morrison of the Doors, Janis Joplin leading Big Brother and the Holding Company, and Stevie Nicks as part of Fleetwood Mac and as a solo performer. Very often, the instrument used in pop music is the headless tambourine or \"jingle ring\", lacking a drum head. The singer should, however, play the tambourine with the overall song arrangement in mind; in some cases, band members have purposely hidden the tambourine from an irresponsible lead singer who disregards the interplay of rhythm. On the other hand, skilled performers such as Jagger have brought a fine sense of timing to their tambourine playing. In the Rolling Stones' 1964 U.S. single of \"Time Is on My Side\", the less-known version, Jagger lays the tambourine on the front of the beat while Charlie Watts holds the snare to the back of the beat, which allows the longer decay time of the tambourine to synchronise with the snare at the end. The result is an intentional feeling of running to catch up."]}, {"page": "Tom Waits", "response": ["In 2013, Waits's cover of \"Shenandoah,\" recorded with Keith Richards, was included on the compilation album Son of Rogue's Gallery: Pirate Ballads, Sea Songs & Chanteys. The album was released February 19 on ANTI-. On May 5, 2013, Waits joined the Rolling Stones on stage at the Oracle Arena in Oakland, California to duet with Mick Jagger on the song \"Little Red Rooster\". The same year, the songs \"Hold On\" and \"I Don't Wanna Grow Up\" were sung by the character Beth Greene (Emily Kinney) in The Walking Dead episodes \"I Ain't a Judas\" and \"Infected\", respectively. On October 27, 2013, Waits performed at the 27th annual Bridge School Benefit concert in Mountain View California. Rolling Stone called it a \"triumph\"."]}, {"page": "The Rolling Stones", "response": ["The Rolling Stones are an English rock band formed in London in 1962. Active for almost six decades, they are one of the most popular and enduring bands of the rock era. In the early 1960s, the Rolling Stones pioneered the gritty, heavier-driven sound that came to define hard rock. Their first stable line-up comprised vocalist Mick Jagger, multi-instrumentalist Brian Jones, guitarist Keith Richards, bassist Bill Wyman, and drummer Charlie Watts. During their formative years Jones was the primary leader: he assembled the band, named it, and drove their sound and image. After Andrew Loog Oldham became the group's manager in 1963, he encouraged them to write their own songs. Jagger and Richards became the primary creative force behind the band, alienating Jones, who developed a drug addiction that interfered with his ability to contribute meaningfully.", "Keith Richards and Mick Jagger became childhood friends and classmates in 1950 in Dartford, Kent.White, Charles. (2003), pp. 119–120, The Life and Times of Little Richard: The Authorised Biography, Omnibus Press. The Jagger family moved to Wilmington, Kent,  away, in 1954. In the mid-1950s, Jagger formed a garage band with his friend Dick Taylor; the group mainly played material by Muddy Waters, Chuck Berry, Little Richard, Howlin' Wolf and Bo Diddley. Jagger met Richards again on 17 October 1961 on platform two of Dartford railway station. The Chuck Berry and Muddy Waters records Jagger was carrying revealed a shared interest. A musical partnership began shortly afterwards. Richards and Taylor often met Jagger at his house. The meetings moved to Taylor's house in late 1961 where Alan Etherington and Bob Beckwith joined the trio; the quintet called themselves the Blues Boys.", "thumb|right|A trade ad for the 1965 Rolling Stones' North American tour|alt=A black and white trade ad for the 1965 Rolling Stones' North American tour. The members of the band are sitting on a staircase with either their hands clasped, or arms folded, looking at the camera. From left: The front row contains Brian Jones, Bill Wyman; the second row contains Charlie Watts and Keith Richards; the third (and final) row contains Mick Jagger.", "In early 1967, Jagger, Richards and Jones began to be hounded by authorities over their recreational drug use, after News of the World ran a three-part feature entitled \"Pop Stars and Drugs: Facts That Will Shock You\". The series described alleged LSD parties hosted by the Moody Blues attended by top stars including the Who's Pete Townshend and Cream's Ginger Baker, and alleged admissions of drug use by leading pop musicians. The first article targeted Donovan (who was raided and charged soon after); the second instalment (published on 5 February) targeted the Rolling Stones. A reporter who contributed to the story spent an evening at the exclusive London club Blaise's, where a member of the Rolling Stones allegedly took several Benzedrine tablets, displayed a piece of hashish and invited his companions back to his flat for a \"smoke\". The article claimed this was Mick Jagger, but it turned out to be a case of mistaken identity; the reporter had in fact been eavesdropping on Brian Jones. Two days after the article was published Jagger filed a writ for libel against the News of the World.", "thumb|upright|The Rolling Stones performing in December 1981|alt=The Rolling Stones on stage in December 1981. From left: Mick Jagger wearing a blue jacket with yellow clothing and a black belt singing into a microphone, Keith Richards wearing black pants and a small purple vest (no shirt) playing a black guitar to the left—and slightly in front—of Jagger, Ronnie Wood wearing an orange jacket and black shirt/pants playing a beige guitar behind Jagger and Richards.", "In late 2001, Mick Jagger released his fourth solo album, Goddess in the Doorway. It met with mixed reviews, reaching No. 44 in the UK and No. 39 in the US. A month after the September 11 attacks, Jagger, Richards and a backing band took part in The Concert for New York City, performing \"Salt of the Earth\" and \"Miss You\". In 2002, the Stones released Forty Licks, a greatest hits double album, to mark forty years as a band. The collection contained four new songs recorded with the core band of Jagger, Richards, Watts, Wood, Leavell and Jones. The album has sold more than 7 million copies worldwide. It reached No. 2 in both the US and UK. The same year, Q magazine named the Rolling Stones one of the 50 Bands To See Before You Die, and the 2002–2003 Licks Tour gave people that chance. It included shows in small theatres. The Stones headlined the Molson Canadian Rocks for Toronto concert in Toronto, Canada, to help the city—which they had used for rehearsals since the Voodoo Lounge tour—recover from the 2003 SARS epidemic. An estimated 490,000 people attended the concert.", "After performances in Japan, China, Australia and New Zealand in March/April 2006, the Stones' tour took a scheduled break before proceeding to Europe. During the break Keith Richards was hospitalised in New Zealand for cranial surgery after a fall from a tree on Fiji, where he had been on holiday. The incident led to a six-week delay in launching the European leg of the tour. In June 2006 it was reported that Ronnie Wood was continuing his alcohol abuse rehabilitation programme, but this did not affect the rearranged European tour schedule. Mick Jagger's throat problems forced the cancellation of two of the 21 shows scheduled for July–September 2006. The Stones returned to North America for concerts in September 2006, and returned to Europe on 5 June 2007. By November 2006, the Bigger Bang tour had been declared the highest-grossing tour of all time.", "The Rolling Stones have sold over 240 million albums worldwide and have held over 48 tours of varying length, including three of the highest-grossing tours of all time: Bridges to Babylon Tour, Voodoo Lounge Tour, and A Bigger Bang Tour. In May 2013, Rolling Stone magazine declared them the \"most definitional band that rock & roll has produced\". The Telegraph has called Mick Jagger \"the Rolling Stone who changed music\". The band has been the subject of numerous documentaries and were inducted into the Rock and Roll Hall of Fame by Pete Townshend in 1989. The Rolling Stones have inspired and mentored new generations of musical artists both as a band and individually. They are also credited with changing the \"whole business model of popular music\". The only artist to top the UK Album Charts in six different decades, they are tied with Elvis Presley and Robbie Williams for the second most Number 1 albums on the Official UK Chart, surpassed only by the Beatles. In 2002, CNN called the Stones \"far and away the most successful act in rock today\", adding, \"since 1989 alone, the band has generated more than $1.5 billion in gross revenues. That total includes sales of records, song rights, merchandising, sponsorship money, and touring. The Stones have made more money than U2, or Springsteen, or Michael Jackson, or Britney Spears, or the Who–or whoever. Sure, Mick attended the London School of Economics, but his greatest talent, besides strutting and singing, is his ability to surround himself and the rest of the band with a group of very able executives.\"", "From small clubs and hotels in London with little room for Jagger to move around to selling out stadiums worldwide, Rolling Stones tours have changed significantly over the decades. The Stones' early setups were simple compared to what they became later in the band's career when elaborate stage designs, pyrotechnics and giant screens were used. By the time the Stones toured America in 1969, they began to fill large halls and arenas, such as The Forum in Inglewood, California. They were also using more equipment, including lighting rigs and better sound equipment than they had used in clubs. The 1969 tour is considered a \"great watershed tour\" by Mick Jagger because they \"started hanging the sound and therefore hanging the lights\". Attributing the birth of arena rock to the Stones 1969 US tour, The Guardian ranked it 19 on their list of the 50 key events in rock music history. Before this tour the loudest sound at large-capacity shows was often the crowd, so the Stones used lighting and sound systems that ensured they could be seen and heard in the biggest arenas. The Guardian commented that their \"combination of front-of-house excellence and behind the scenes savvy took the business of touring to an entirely new level.\" During the 1972 tour, the Stones developed a complex light show which included giant mirrors that bounced the light off them.", "* Mick Jaggerlead and backing vocals, harmonica, rhythm guitar, percussion, keyboards (1962–present)"]}, {"page": "Woodstock", "response": ["* The Rolling Stones were invited but declined because Mick Jagger was in Australia filming Ned Kelly, and Keith Richards' girlfriend Anita Pallenberg had just given birth to their son Marlon."]}, {"page": "1943", "response": ["* July 26 – Mick Jagger, English rock singer (The Rolling Stones)"]}, {"page": "1970", "response": ["**Mick Jagger is fined £200 for possession of cannabis."]}, {"page": "Princess Margaret, Countess of Snowdon", "response": ["Reportedly, Margaret had her first extramarital affair in 1966, with her daughter's godfather Anthony Barton, a Bordeaux wine producer.Heald, p. 170; Warwick, p. 245 A year later she had a one-month liaison with Robin Douglas-Home, a nephew of former British Prime Minister Alec Douglas-Home.Heald, p. 170 Margaret claimed that her relationship with Douglas-Home was platonic, but her letters to him (which were later sold) were intimate.Warwick, pp. 245–246 Douglas-Home, who suffered from depression, died by suicide 18 months after the split with Margaret. Claims that she was romantically involved with musician Mick Jagger,Aronson, p. 229 actor Peter Sellers, and Australian cricketer Keith Miller are unproven. According to biographer Charlotte Breese, entertainer Leslie Hutchinson had a \"brief liaison\" with Margaret in 1955. A 2009 biography of actor David Niven included assertions, based on information from Niven's widow and a good friend of Niven's, that he had had an affair with the princess, who was 20 years his junior.Munn, Michael (24 May 2009).\"Oh God, I wanted her to die\", The Sunday Times, Retrieved 29 May 2009. In 1975, the Princess was listed among women with whom actor Warren Beatty had had romantic relationships.Playgirl, Volume 3, 1975 John Bindon, an actor from Fulham, who had spent time in prison, sold his story to the Daily Mirror, boasting of a close relationship with Margaret.Aronson, p. 260"]}, {"page": "Mikhail Bulgakov", "response": ["*According to Mick Jagger, Master and Margarita was the inspiration for The Rolling Stones' \"Sympathy for the Devil\" (1968). "]}, {"page": "Soho", "response": ["Great Marlborough Street was first laid out in the early 18th century, and named after the military commander John Churchill, 1st Duke of Marlborough. The street was initially fashionable and was home to numerous peers. The London College of Music was based at No. 47 from 1896 to 1990, while the department store Liberty is on the corner with Regent Street. The street was the location of Philip Morris's original London factory and gave its name to the Marlboro brand of cigarettes. Marlborough Street Magistrates Court was based at No. 20–21 and had become one of the country's most important magistrates courts by the late 19th century. The Marquess of Queensbury's libel trial against Oscar Wilde took place here in 1895. The Rolling Stones' Mick Jagger and Keith Richards were tried for drugs possession at the court in 1967, with fellow band member Brian Jones being similarly charged a year later."]}, {"page": "Freddie Mercury", "response": ["One of Mercury's most notable performances with Queen took place at Live Aid in 1985. Queen's performance at the event has since been voted by a group of music executives as the greatest live performance in the history of rock music. The results were aired on a television program called \"The World's Greatest Gigs\". Mercury's powerful, sustained note during the a cappella section came to be known as \"The Note Heard Round the World\". In reviewing Live Aid in 2005, one critic wrote, \"Those who compile lists of Great Rock Frontmen and award the top spots to Mick Jagger, Robert Plant, etc. all are guilty of a terrible oversight. Freddie, as evidenced by his Dionysian Live Aid performance, was easily the most godlike of them all.\" Queen roadie Peter Hince states, \"It wasn't just about his voice but the way he commanded the stage. For him it was all about interacting with the audience and knowing how to get them on his side. And he gave everything in every show.\"", "In 1981–1983 Mercury recorded several tracks with Michael Jackson, including a demo of \"State of Shock\", \"Victory\", and \"There Must Be More to Life Than This\". None of these collaborations were officially released at the time, although bootleg recordings exist. Jackson went on to record the single \"State of Shock\" with Mick Jagger for the Jacksons' album Victory. Mercury included the solo version of \"There Must Be More To Life Than This\" on his Mr. Bad Guy album. \"There Must Be More to Life Than This\" was eventually reworked by Queen and released on their compilation album Queen Forever in 2014. In addition to working with Michael Jackson, Mercury and Roger Taylor sang on the title track for Billy Squier's 1982 studio release, Emotions in Motion and later contributed to two tracks on Squier's 1986 release, Enough Is Enough, providing vocals on \"Love is the Hero\" and musical arrangements on \"Lady With a Tenor Sax\". In 2020, Mercury's music video for \"Love Me Like There's No Tomorrow\" was nominated for Best Animation at the Berlin Music Video Awards. Woodlock studio is behind the animation."]}, {"page": "Tony Richardson", "response": ["Among stars that Richardson directed were Jeanne Moreau, Orson Welles, Rob Lowe, Milton Berle, Trevor Howard, David Hemmings, Nicol Williamson, Tom Courtenay, Lynn Redgrave, Marianne Faithfull, Richard Burton,Until dismissed by Richardson for repeatedly failing to show up on set as contracted (Richardson, pp. 212–3) Jodie Foster, Anthony Hopkins, Mick Jagger, Katharine Hepburn, Seth Green, Tommy Lee Jones and Judi Dench. His musical composers included Antoine Duhamel, John Addison and Shel Silverstein. His screenwriters were Jean Genet, Christopher Isherwood, Terry Southern, Marguerite Duras, Edward Bond (adapting Vladimir Nabokov) and Edward Albee. Richardson and Osborne eventually fell outHeilpern, pp.346–51 during production of the film Charge of the Light Brigade (1968). The basic issue was Osborne's unwillingness to go through the rewrite process, more arduous in film than it is in the theatre. Richardson had a different version. In his autobiography (p. 195), he writes that Osborne was angry at being replaced in a small role by Laurence Harvey to whom the producers had obligations. Osborne took literary revenge by creating a fictionalised and pseudonymous Richardson – a domineering and arrogant character whom everyone hated – in his play The Hotel in Amsterdam."]}, {"page": "British sitcom", "response": ["Nick Ingman (b.1948) wrote the title music for Keeping Up Appearances. His collaborators include Paul McCartney, Mick Jagger, Björk, and the British X-factor. Ingman was a Visiting Professor at the London College of Music. He conducted the original recording of the Oscar-Winning score of Finding Neverland. His arrangements have accounted for 14 No.1 singles and 5 double platinum albums in the UK and he has been nominated for a Grammy three times."]}, {"page": "Led Zeppelin IV", "response": ["Recording sessions for the album began at Island Records' new Basing Street studios in London in December 1970. The group had considered Mick Jagger's home, Stargroves as a recording location, but decided it was too expensive. They subsequently moved the following month to Headley Grange, a country house in Hampshire, England, using the Rolling Stones Mobile Studio and engineer Andy Johns, with the Stones' Ian Stewart assisting. Johns had just worked on engineering Sticky Fingers and recommended the mobile studio. Guitarist and producer Jimmy Page later recalled: \"We needed the sort of facilities where we could have a cup of tea and wander around the garden and go in and do what we had to do.\" This relaxed, atmospheric environment at Headley Grange also provided other advantages for the band, as they were able to capture spontaneous performances immediately, with some tracks arising from the communal jamming. Bassist and keyboardist John Paul Jones remembered there was no bar or leisure facilities, but this helped focus the group on the music without being distracted."]}, {"page": "Houses of the Holy", "response": ["By 1972, Led Zeppelin had achieved sustained commercial and critical success from both their studio albums and live shows. They were keen to record on location using the Rolling Stones Mobile Studio as it had been an enjoyable experience for their untitled fourth album, released the previous year. After touring Australia, in April 1972 the group decided to take the mobile studio to Mick Jagger's home, Stargroves, a manor house and country estate in Hampshire. Eddie Kramer returned as recording engineer."]}, {"page": "Ike Turner", "response": ["In 1965, Phil Spector saw them perform at a club on the Sunset Strip and invited them to film The Big T.N.T. Show. Impressed by their performance, Spector negotiated a deal with their manager Bob Krasnow, head of Loma Records, offering $20,000 to produce Tina and have them released from their Loma contract. After Tina and Spector recorded \"River Deep – Mountain High,\" the duo signed to Spector's Philles label in 1966. The failure of the single in America triggered Spector's retreat from the music industry. However, it was a hit in Europe, reaching No. 3 on the UK Singles Chart and No. 1 on Los 40 Principales in Spain. Following the song's success in the UK, Mick Jagger invited them to open for the Rolling Stones on their 1966 British Tour. This exposure introduced them to a wider audience outside of R&B. Soon they were booking bigger venues, and by 1969 they were headlining in Las Vegas."]}, {"page": "American Pie (song)", "response": ["*  Historically oriented interpretation of \"American Pie\".  The interpretation was specifically noted on in an archived version of McLean's website page on \"American Pie\".archived version of McLean's website page on \"American Pie\". The material, dated November 2002, includes a recording of Dinah Shore singing \"See The USA In Your Chevrolet\" and a photograph of Mick Jagger in costume at the Altamont Free Concert with a Hells Angel member in the background."]}]}}