{"wiki_id": "http://www.wikidata.org/entity/Q12804074", "itemLabel": "Thomas Cecil Hunt", "itemDescription": "", "wikipedia_url": "https://en.wikipedia.org/wiki/Thomas_Cecil_Hunt", "wikipedia_page": {"main": "Brigadier Thomas \"Tommy\" Cecil Hunt  (5 June 1901 – 22 December 1980) was a British physician and gastroenterologist.After education at St Paul's School, London, Thomas Cecil Hunt matriculated at Magdalen College, Oxford, where he received a First Class Honours degree in Physiology in 1922. He then studied medicine at St Mary's Hospital Medical School, where he graduated BM BCh in 1926. In his first year of medical school, he made a roundtrip from London to Oxford each week as an assistant to Charles Sherrington in physiology tutoring and demonstrating. In 1927 Oxford University awarded Hunt a Radcliffe travelling fellowship, enabling him to go to Berlin and Vienna and study endocrine diseases and metabolism. At the University of Vienna he studied endocrinology under Richard Bauer (1879–1959), professor extraordinarius. In 1938 when Bauer, as a Jew, was forced to flee from Vienna, Hunt helped him relocate.In 1928 Hunt qualified MRCP. At St Mary's Hospital he was from 1928 to 1930 a medical registrar and in 1930 was appointed physician in charge of outpatients. In 1930 he graduated DM and married Barbara Todd, noted for acting in London theatre.Hunt held appointments as physician to the Royal Masonic Hospital, the Paddington Hospital, and the King Edward VII Hospital for Officers. In 1931 Hunt became a member of the Association of Physicians, Great Britain and Ireland. He was chair of the Medical Sickness Annuity and Life Assurance Society. In 1935 he was elected FRCP.On the 19 and 20 November 1937, Arthur Hurst chaired the first meeting of the British Society of Gastroenterology with a council consisting of T. L. Hardy, T. C. Hunt, Sir Henry Tidy, and L. J. Witts and with 37 members to establish detailed plans and rules.\nIn January 1940 Thomas joined the RAMC, and his lifelong love of travel was fully satisfied over the five years of war. One of his early appointments was consulting physician in Freetown, which gave him the chance of going aboard almost every troopship in the Merchant Navy. Later, as a brigadier, he was consultant in Algeria and Iraq, and with his headquarters in Baghdad he visited most countries in the Middle East as well as India.\nAfter the end of WWII, Hunt returned to St Mary's Hospital. In 1956–1957, he became the president of the Society of Gastroenterology for one year. He was from 1962 to 1966 the president of the World Congress of Gastroenterology. In 1964 he was appointed CBE. In 1973, under the auspices of the Royal College of Physicians, he gave the Harveian Oration on Digestive diseases: the changing scene. Also in 1973, under the auspices of the Medical Society of London, he gave the Lettsomian Lectures on Doubt, Dogma and Dyspepsia.Upon his death, he was survived by his widow, two daughters, and a son.", "link_mentions": [{"page": "Thomas Hunt", "response": ["* Thomas Cecil Hunt (1901–1980), English physician"]}]}}