{"wiki_id": "http://www.wikidata.org/entity/Q128336", "itemLabel": "William Bentinck, 4th Duke of Portland", "itemDescription": "English noble & ancestor of the Queen Mother", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Bentinck,_4th_Duke_of_Portland", "wikipedia_page": {"main": "William Henry Cavendish-Scott-Bentinck, 4th Duke of Portland,  (24 June 1768 – 27 March 1854), styled Marquess of Titchfield until 1809, was a British politician who served in various positions in the governments of George Canning and Lord Goderich.", "link_mentions": [{"page": "1854", "response": ["** William Bentinck, 4th Duke of Portland, English politician (b. 1768)"]}, {"page": "William Cavendish-Bentinck, 3rd Duke of Portland", "response": ["*William Bentinck, 4th Duke of Portland (24 June 176827 March 1854)."]}, {"page": "John Bentinck, 5th Duke of Portland", "response": ["He was born in London, the second son of William Bentinck, 4th Duke of Portland, and his wife Henrietta, daughter of General John Scott. He was baptised at St George's Church, Hanover Square, on 30 September. One of nine children, he was known by his second Christian name, John, as all the male members of the family were named William. He was the brother of Charlotte Denison, future wife of Evelyn Denison, 1st Viscount Ossington."]}, {"page": "Earl of Portland", "response": ["The third Duke was succeeded by his eldest son, William Bentinck, 4th Duke of Portland. The fourth Duke was also a politician and served as Lord Privy Seal in 1827 and as Lord President of the Council from 1827 to 1828. He married Henrietta Scott, daughter of Major-General John Scott, in 1795 and assumed by Royal licence the same year the additional surname of Scott in the manner of Cavendish-Bentinck. His eldest son and heir apparent, William Cavendish-Scott-Bentinck, Marquess of Titchfield, represented two constituencies in Parliament but died unmarried in 1824, 15 years before his father. The fourth Duke was therefore succeeded by his second son, William Cavendish-Scott-Bentinck, 5th Duke of Portland. The fifth Duke is remembered as a capable architect and engineer but eccentric, who excavated an underground art gallery and library under his estate at Welbeck Abbey."]}, {"page": "Baron Seaford", "response": ["Charles married in 1828 Lady Lucy Cavendish-Bentinck, daughter of William Bentinck, 4th Duke of Portland, and his wife Henrietta Scott. Through this marriage a substantial fortune came into the Ellis family, mainly based on property ownership in central London. His grandson, the eighth and fourth Baron, assumed in 1917 by Royal Licence his great-grandmother's surname of Scott in addition to that of Ellis. He was succeeded by his son, the ninth and fifth Baron respectively. On his death in 1999 the two baronies separated."]}, {"page": "William Henry Bentinck, 4th Duke of Portland", "response": ["#REDIRECT William Bentinck, 4th Duke of Portland"]}, {"page": "William Cavendish-Scott-Bentinck, 4th Duke of Portland", "response": ["#REDIRECT William Bentinck, 4th Duke of Portland"]}, {"page": "William Henry Cavendish, Lord Bentinck", "response": ["#REDIRECT William Bentinck, 4th Duke of Portland"]}, {"page": "William Henry Cavendish-Scott-Bentinck", "response": ["#REDIRECT William Bentinck, 4th Duke of Portland"]}, {"page": "William Henry Cavendish", "response": ["#REDIRECT William Bentinck, 4th Duke of Portland"]}, {"page": "Baron Howard de Walden", "response": ["The young Lord Howard de Walden (1799–1868), aged four when he inherited the title from his great-grandfather, eventually married Lady Lucy Cavendish-Scott-Bentinck, youngest daughter of William Bentinck, 4th Duke of Portland, and sister and co-heiress of the reclusive William Cavendish-Scott-Bentinck, 5th Duke of Portland. With her childless sister, Viscountess Ossington, she inherited the Duke of Portland’s London estate in Marylebone in 1879.  Building leases granted from the mid 18th century began to make huge financial returns from the 1870s and quickly made the Howard de Walden family one of the wealthiest in the country.\"Survey of London\" vol 51, eds C Thom & P Temple (Bartlett School of Architecture, University College, London, 2017)pp17-19   Charles Augustus died in 1868 and his heir had to wait until the death of his mother in 1899 before receiving his London inheritance. Meanwhile the indebted Jamaican estates were conveyed to his younger brother Evelyn in 1891.Barry Higman, Montpelier (Kingston: University of the West Indies Press, 1998), p. 67,71  "]}, {"page": "William Henry Cavendish-Scott-Bentinck, 4th Duke of Portland", "response": ["#REDIRECT William Bentinck, 4th Duke of Portland"]}, {"page": "Evelyn Denison, 1st Viscount Ossington", "response": ["Lord Ossington married Lady Charlotte, daughter of William Bentinck, 4th Duke of Portland, in 1827, but he left no children. He died on 7 March 1873, and his title became extinct.  Lady Ossington died in 1889."]}, {"page": "William Cavendish-Bentinck-Scott, 4th Duke of Portland", "response": ["#REDIRECT William Bentinck, 4th Duke of Portland"]}, {"page": "William Bentinck", "response": ["* William Bentinck, 4th Duke of Portland (1768–1854), British politician"]}, {"page": "Bentinck family", "response": ["************William Bentinck, 4th Duke of Portland (1768–1854), British politician"]}, {"page": "Lord George Bentinck", "response": ["Bentinck was born into the prominent Bentinck family, the fifth child and third son of William Bentinck, 4th Duke of Portland and Henrietta (née Scott). His mother was the daughter, and along with her two sisters, the heiress, of the rich General John Scott of Fife."]}, {"page": "Welbeck Abbey", "response": ["* 1809 – 1854 William Bentinck, 4th Duke of Portland"]}, {"page": "Charles Cavendish-Bentinck (priest)", "response": ["The likelihood of Bentinck becoming Duke of Portland increased, as his uncle William Bentinck, 4th Duke of Portland died on 27 March 1854 and all four of his sons were unmarried or dead. The eldest, William, Marquess of Titchfield, had died in 1824, and Lord George on 21 September 1848. The eccentric Lord William (who succeeded his father as the 5th Duke of Portland) and the youngest son, Lord Henry, both remained unmarried. Bentinck himself was the next heir after Lord Henry, however, he was also childless at the time: his wife Sinetta had died at Ampthill on 19 February 1850, of mesentery,Register of Deaths for Ampthill Registrar's District, 1850, vol. 6, p. 4 leaving Bentinck a widower with no surviving children."]}, {"page": "Lord Charles Bentinck", "response": ["Bentinck was the third son of British Prime Minister William Cavendish-Bentinck, 3rd Duke of Portland and Lady Dorothy (1750–1794), only daughter of Prime Minister William Cavendish, 4th Duke of Devonshire. William Bentinck, 4th Duke of Portland, and Lord William Bentinck were his elder brothers."]}, {"page": "Duchess of Portland", "response": ["* Henrietta Bentinck, Duchess of Portland (née Henrietta Scott) (1774–1844), wife of William Bentinck, 4th Duke of Portland"]}]}}