{"wiki_id": "http://www.wikidata.org/entity/Q128967", "itemLabel": "Edward Heath", "itemDescription": "former prime minister of the United Kingdom (1916–2005)", "wikipedia_url": "https://en.wikipedia.org/wiki/Edward_Heath", "wikipedia_page": {"main": "Sir Edward Richard George \"Ted\" Heath  (9 July 1916 – 17 July 2005) was a British politician who served as Prime Minister of the United Kingdom from 1970 to 1974 and Leader of the Conservative Party from 1965 to 1975. Heath also served for 51 years as a Member of Parliament from 1950 to 2001. Outside politics, Heath was a world-class yachtsman, a talented musician, and an author.\nBorn the child of a carpenter and a lady's maid, Heath was educated at a grammar school and became a leader within student politics while studying at the University of Oxford. He served as an officer in the Royal Artillery during the Second World War. He worked briefly in the Civil Service, but resigned in order to stand for Parliament, and was elected for Bexley at the 1950 election. He was promoted to become Chief Whip by Anthony Eden in 1955, and in 1959 was appointed to the Cabinet by Harold Macmillan as Minister of Labour. He later held the role of Lord Privy Seal and in 1963, was made President of the Board of Trade by Alec Douglas-Home. After the Conservatives were defeated at the 1964 election, Heath was elected as Leader of the Conservative Party in 1965, becoming Leader of the Opposition. Although he led the Conservatives to a landslide defeat at the 1966 election, he remained in the leadership, and at the 1970 election led his party to an unexpected victory.\nDuring his time as prime minister, Heath oversaw the decimalisation of British coinage in 1971, and in 1972 he led the reformation of local government in the United Kingdom, significantly reducing the number of local authorities and creating several new metropolitan counties, much of which remains to this day. Perhaps Heath's most prominent achievement came in 1973, when he led the United Kingdom into membership of the European Communities (which would later become the European Union) as a member state. Heath had always been a strong supporter of British membership of the EC, and after winning the decisive vote in the House of Commons by 356 to 244 to join, he led the negotiations that culminated in the UK's entry into the EC on 1 January 1973. According to biographer John Campbell, Heath regarded this as his personal \"finest hour\".Heath's time as prime minister also coincided with the height of the Troubles in Northern Ireland, with his approval of internment without trial and subsequent suspension of the Stormont Parliament seeing the imposition of direct British rule. Unofficial talks with Provisional Irish Republican Army delegates were unsuccessful, as was the Sunningdale Agreement of 1973, which led the MPs of the Ulster Unionist Party to withdraw from the Conservative whip. Heath also tried to reform British trade unionism with the Industrial Relations Act, and hoped to deregulate the economy and make a transfer from direct to indirect taxation. However, a miners' strike at the start of 1974 severely damaged the Government, causing the implementation of the Three-Day Week to conserve energy. Attempting to resolve the situation, Heath called an election for February 1974, attempting to obtain a mandate to face down the miners' wage demands, but this instead resulted in a hung parliament, with the Conservatives losing their majority. Despite gaining fewer votes, the Labour Party won four more seats, and Heath resigned as Prime Minister on 4 March after talks with the Liberal Party to form a coalition government were unsuccessful.\nAfter losing a second successive election in October 1974, Heath insisted he would continue as leader, but in January 1975, Margaret Thatcher announced she would challenge Heath for the leadership, and on 4 February, she narrowly outpolled him in the first round. Heath chose to resign the leadership rather than contest the second round. Heath returned to the backbench, where he would remain until 2001. In 1975, he played a major role in the referendum on British membership of the EC, campaigning for the eventually successful \"Yes\" vote to remain in the Community. He would later become an embittered critic of Thatcher during her time as prime minister, speaking and writing against the policies of Thatcherism. Following the 1992 election, he became Father of the House, until his retirement in 2001. He died in 2005, aged 89. He is one of four British prime ministers never to have married. He has been described by the BBC as \"the first working-class meritocrat\" to become Conservative leader in \"the party's modern history\" and \"a One Nation Tory in the Disraeli tradition who rejected the laissez-faire capitalism that Thatcher would enthusiastically endorse.\"\n\n", "link_mentions": [{"page": "2001 United Kingdom general election", "response": ["The 2001 general election is the last to date in which any government has held an overall majority of more than 100 seats in the House of Commons, and the second of only two since the Second World War (the other being 1997) in which a single party won over 400 MPs. Notable departing MPs included former Prime Ministers Edward Heath (also Father of the House) and John Major, former Deputy Prime Minister Michael Heseltine, former Liberal Democrat leader Paddy Ashdown, former Cabinet ministers Tony Benn, Tom King, John Morris, Mo Mowlam, John MacGregor and Peter Brooke, Teresa Gorman, and then Mayor of London Ken Livingstone."]}, {"page": "Liberal Party (UK)", "response": ["In local elections, Liverpool remained a Liberal stronghold, with the party taking the plurality of seats on the elections to the new Liverpool Metropolitan Borough Council in 1973. On 26 July 1973, the party won two by-elections on the same day, in the Isle of Ely (with Clement Freud), and Ripon (with David Austick). In the February 1974 general election, the Conservative government of Edward Heath won a plurality of votes cast, but the Labour Party gained a plurality of seats. The Conservatives were unable to form a government due to the Ulster Unionist MPs refusing to support the Conservatives after the Northern Ireland Sunningdale Agreement. The Liberals obtained 6.1 million votes, the most it would ever achieve, and now held the balance of power in the Commons. Conservatives offered Thorpe the Home Office if he would join a coalition government with Heath. Thorpe was personally in favour of it, but the party insisted it would only agree pending a clear government commitment to introducing proportional representation (PR) and a change of prime minister. The former was unacceptable to Heath's cabinet and the latter to Heath personally, so the talks collapsed. Instead, a minority Labour government was formed under Harold Wilson but with no formal support from Thorpe. In the October 1974 general election, the Liberals total vote slipped back slightly (and declined in each of the next three) and the Labour government won a wafer-thin majority."]}, {"page": "Baron Aberdare", "response": ["Baron Aberdare, of Duffryn in the County of Glamorgan, is a title in the Peerage of the United Kingdom. It was created on 23 August 1873 for the Liberal politician Henry Bruce. He served as Home Secretary from 1868 to 1873. His grandson, the third Baron, was a soldier, cricketer and tennis player and a member of the International Olympic Committee. His son, the fourth Baron, held office in the Conservative administration of Edward Heath and was later a Deputy Speaker of the House of Lords. Lord Aberdare was one of the ninety-two elected hereditary peers that were allowed to remain in the House of Lords after the passing of the House of Lords Act 1999.  the title is held by his son, the fifth Baron, who succeeded in 2005 and was elected to the House of Lords in 2009."]}, {"page": "Bloody Sunday (1972)", "response": ["Two days after Bloody Sunday, the British Parliament adopted a resolution for a tribunal into the shootings, resulting in Prime Minister Edward Heath commissioning the Lord Chief Justice, Lord Widgery, to undertake it. Many witnesses intended to boycott the tribunal as they lacked faith in Widgery's impartiality, but were eventually persuaded to take part. Widgery's quickly-produced report—completed within 10 weeks (on 10 April) and published within 11 weeks (on 19 April)—supported the Army's account of the events of the day. Among the evidence presented to the tribunal were the results of paraffin tests, used to identify lead residues from firing weapons, and that nail bombs had been found on the body of one of those killed. Tests for traces of explosives on the clothes of eleven of the dead proved negative, while those of the remaining man could not be tested as they had already been washed. It has been argued that firearms residue on some deceased may have come from contact with the soldiers who themselves moved some of the bodies, or that the presence of lead on the hands of one (James Wray) was easily explained by the fact that his occupation regularly involved the use of lead-based solder."]}, {"page": "Clement Attlee", "response": ["His leadership style of consensual government, acting as a chairman rather than a president, won him much praise from historians and politicians alike. Christopher Soames, the British Ambassador to France during the Conservative government of Edward Heath and cabinet minister under Margaret Thatcher, remarked that \"Mrs Thatcher was not really running a team. Every time you have a Prime Minister who wants to make all the decisions, it mainly leads to bad results. Attlee didn't. That's why he was so damn good\".Hennessy, Peter. The Prime Minister: The Office and its Holders since 1945, Chapter 7, p. 150"]}, {"page": "Concorde", "response": ["The heads of France and the United Kingdom flew in Concorde many times.   Presidents Georges Pompidou,  Valéry Giscard d'Estaing The New York Times. Giscard Arrives for Talks With Ford  and François Mitterrand  \"President Francois Mitterrand prepared today to fly by Concorde\". Kingston Gleaner, 12 September 1985, p. 9. The New York Times. Miitterrand's travels are well received back home regularly used Concorde as French flagman aircraft in foreign visits. Queen Elizabeth II and Prime Ministers Edward Heath, Jim Callaghan, Margaret Thatcher, John Major and Tony Blair took Concorde in some charter flights such as the Queen's trips to Barbados on her Silver Jubilee in 1977, in 1987 and in 2003, to the Middle East in 1984 and to the United States in 1991.   Barbados Concorde Experience , barbadosconcorde.com Pope John Paul II flew on Concorde in May 1989."]}, {"page": "December 22", "response": ["*  1974   – The house of former British Prime Minister Edward Heath is attacked by members of the Provisional IRA."]}, {"page": "Distance education", "response": ["The Open University in the United Kingdom was founded by the-then Labour government led by Prime Minister, Harold Wilson, based on the vision of Michael Young. Planning commenced in 1965 under the Minister of State for Education, Jennie Lee, who established a model for the Open University (OU) as one of widening access to the highest standards of scholarship in higher education and set up a planning committee consisting of university vice-chancellors, educationalists, and television broadcasters, chaired by Sir Peter Venables. The British Broadcasting Corporation (BBC) Assistant Director of Engineering at the time, James Redmond, had obtained most of his qualifications at night school, and his natural enthusiasm for the project did much to overcome the technical difficulties of using television to broadcast teaching programs .The Open University revolutionized the scope of the correspondence program and helped to create a respectable learning alternative to the traditional form of education. It has been at the forefront of developing new technologies to improve the distance learning service as well as undertaking research in other disciplines. Walter Perry was appointed the OU's first vice-chancellor in January 1969, and its foundation secretary was Anastasios Christodoulou. The election of the new Conservative government under the leadership of Edward Heath, in 1970; led to budget cuts under Chancellor of the Exchequer Iain Macleod (who had earlier called the idea of an Open University \"blithering nonsense\"). However, the OU accepted its first 25,000 students in 1971, adopting a radical open admissions policy. At the time, the total student population of conventional universities in the United Kingdom was around 130,000."]}, {"page": "European Economic Community", "response": ["The four countries resubmitted their applications on 11 May 1967 and with Georges Pompidou succeeding Charles de Gaulle as French president in 1969, the veto was lifted. Negotiations began in 1970 under the pro-European UK government of Edward Heath, who had to deal with disagreements relating to the Common Agricultural Policy and the UK's relationship with the Commonwealth of Nations. Nevertheless, two years later the accession treaties were signed so that Denmark, Ireland and the UK joined the Community effective 1 January 1973. The Norwegian people had finally rejected membership in a referendum on 25 September 1972."]}, {"page": "Indira Gandhi", "response": ["Gandhi spent a number of years in Europe during her youth and had formed many friendships there. During her premiership she formed friendships with many leaders such as West German chancellor, Willy Brandt and Austrian chancellor Bruno Kreisky. She also enjoyed a close working relationship with many British leaders including conservative premiers, Edward Heath and Margaret Thatcher."]}, {"page": "July 9", "response": ["*  1916   – Edward Heath, English colonel and politician; Prime Minister of the United Kingdom, 1970-74 (d. 2005)"]}, {"page": "John Major", "response": ["Like some post-war former prime ministers (such as Edward Heath), Major turned down a peerage when he retired from the House of Commons in 2001. He said that he wanted a \"firebreak from politics\" and to focus on writing and his business, sporting and charity work."]}, {"page": "July 17", "response": ["*  2005   – Edward Heath, English colonel and politician, Prime Minister of the United Kingdom (b. 1916)"]}, {"page": "Michael Foot", "response": ["Foot took a back seat in Labour politics following 1983 and retired from the House of Commons at the 1992 general election, when Labour lost to the Conservative Party (led by John Major) for the fourth election in succession, but remained politically active. From 1987 to 1992, he was the oldest sitting British MP (preceding former Prime Minister Sir Edward Heath). He defended Salman Rushdie, after Ayatollah Khomeini advocated killing the novelist in a fatwā, and took a strongly pro-interventionist position against Serbia during its conflict with Croatia and Bosnia, supporting NATO forces whilst citing defence of civilian populations in the latter countries. In addition, he was among the Patrons of the British-Croatian Society. The Guardians political editor Michael White criticised Foot's \"overgenerous\" support for Croatian leader Franjo Tuđman."]}, {"page": "Margaret Thatcher", "response": ["Thatcher studied chemistry at Somerville College, Oxford, and worked briefly as a research chemist, before becoming a barrister. She was elected Member of Parliament for Finchley in 1959. Edward Heath appointed her Secretary of State for Education and Science in his 1970–1974 government. In 1975, she defeated Heath in the Conservative Party leadership election to become Leader of the Opposition, the first woman to lead a major political party in the United Kingdom. On becoming prime minister after winning the 1979 general election, Thatcher introduced a series of economic policies intended to reverse high inflation and Britain's struggles in the wake of the Winter of Discontent and an oncoming recession. Her political philosophy and economic policies emphasised deregulation (particularly of the financial sector), the privatisation of state-owned companies, and reducing the power and influence of trade unions. Her popularity in her first years in office waned amid recession and rising unemployment, until victory in the 1982 Falklands War and the recovering economy brought a resurgence of support, resulting in her landslide re-election in 1983. She survived an assassination attempt by the Provisional IRA in the 1984 Brighton hotel bombing and achieved a political victory against the National Union of Mineworkers in the 1984–85 miners' strike.", "Jim Prior suggested Thatcher as a Shadow Cabinet member after the Conservatives' 1966 defeat, but party leader Edward Heath and Chief Whip William Whitelaw eventually chose Mervyn Pike as the Conservative Shadow Cabinet's sole woman member. At the 1966 Conservative Party conference, Thatcher criticised the high-tax policies of the Labour government as being steps \"not only towards Socialism, but towards Communism\", arguing that lower taxes served as an incentive to hard work. Thatcher was one of the few Conservative MPs to support Leo Abse's bill to decriminalise male homosexuality. She voted in favour of David Steel's bill to legalise abortion, as well as a ban on hare coursing. She supported the retention of capital punishment and voted against the relaxation of divorce laws.", "The Conservative Party, led by Edward Heath, won the 1970 general election, and Thatcher was appointed to the Cabinet as Secretary of State for Education and Science. Thatcher caused controversy when, after only a few days in office, she withdrew Labour's Circular 10/65 which attempted to force comprehensivisation, without going through a consultation process.  She was highly criticised for the speed at which she carried this out. Consequently, she drafted her own new policy (Circular 10/70), which ensured that local authorities were not forced to go comprehensive. Her new policy was not meant to stop the development of new comprehensives; she said: \"We shall [...] expect plans to be based on educational considerations rather than on the comprehensive principle.\"", "Thatcher defined her own political philosophy, in a major and controversial break with the one-nation conservatism of her predecessor Edward Heath, in a 1987 interview published in Woman's Own magazine:"]}, {"page": "Prime Minister of the United Kingdom", "response": ["Macmillan's successors, Alec Douglas-Home, Harold Wilson, James Callaghan and Margaret Thatcher, all accepted life peerages (although Douglas-Home had previously disclaimed his hereditary title as Earl of Home). Edward Heath did not accept a peerage of any kind and nor have any of the prime ministers to retire since 1990, although Heath and Major were later appointed as Knights of the Garter."]}, {"page": "Richard Nixon", "response": ["In early 1978, Nixon went to the United Kingdom. He was shunned by American diplomats and by most ministers of the James Callaghan government. He was welcomed, however, by the Leader of the Opposition, Margaret Thatcher, as well as by former prime ministers Lord Home and Sir Harold Wilson. Two other former prime ministers, Harold Macmillan and Edward Heath, declined to meet him. Nixon addressed the Oxford Union regarding Watergate:"]}, {"page": "Rhodesia", "response": ["From 1968 until 1970, there was virtually no further dialogue between Rhodesia and the UK. In a referendum in 1969, white voters approved a new constitution and the establishment of a republic, thereby severing Rhodesia's last links with the British Crown, duly declared in March 1970. This changed immediately after the election of Edward Heath, who reopened negotiations. Smith remained optimistic that Heath would do his utmost to remedy Anglo-Rhodesian relations, although disappointed that he continued to adhere publicly to the original \"five principles\" proposed by Alec Douglas-Home, now foreign secretary. In November 1971, Douglas-Home renewed contacts with Salisbury and announced a proposed agreement that would be satisfactory to both sides – it recognised Rhodesia's 1969 constitution as the legal frame of government, while agreeing that gradual legislative representation was an acceptable formula for unhindered advance to majority rule. Nevertheless, the new settlement, if approved, would also implement an immediate improvement in black political status, offer a means to terminate racial discrimination, and provide a solid guarantee against retrogressive constitutional amendments."]}, {"page": "Roy Jenkins", "response": ["Jenkins was educated at Pentwyn Primary School, Abersychan County Grammar School, University College, Cardiff, and at Balliol College, Oxford, where he was twice defeated for the Presidency of the Oxford Union but took a first-class degree in Politics, Philosophy and Economics (PPE).Campbell, Roy Jenkins: A Well-Rounded Life, p. 17, p. 25, p. 60. His university colleagues included Tony Crosland, Denis Healey and Edward Heath, and he became friends with all three, although he was never particularly close to Healey.", "Despite Edward Heath claiming it was a \"hard, cold budget, without any glimmer of warmth\" Jenkins' first budget broadly received a warm reception, with Harold Wilson remarking that \"it was widely acclaimed as a speech of surpassing quality and elegance\" and Barbara Castle that it \"took everyone's breath away\". Richard Crossman said it was \"genuinely based on socialist principles, fair in the fullest sense by really helping people at the bottom of the scale and by really taxing the wealthy\".Richard Crossman, The Diaries of a Cabinet Minister, Volume II: Lord President of the Council and Leader of the House of Commons, 1966–69 (Hamish Hamilton, 1976), p. 723. In his budget broadcast on 19 March, Jenkins said that Britain had been living in a \"fool's paradise\" for years and that it was \"importing too much, exporting too little and paying ourselves too much\", with a lower standard of living than France or West Germany.Campbell, Roy Jenkins: A Well-Rounded Life, p. 323.", "After his death, Blair paid tribute to \"one of the most remarkable people ever to grace British politics\", who had \"intellect, vision and an integrity that saw him hold firm to his beliefs of moderate social democracy, liberal reform and the cause of Europe throughout his life. He was a friend and support to me\".Michael White and Lucy Ward, 'Statesman Jenkins dies at 82', The Guardian (6 January 2003). James Callaghan and Edward Heath also paid tribute and Tony Benn said that as \"a founder of the SDP he was probably the grandfather of New Labour\".'What they said', The Times (6 January 2003), p. 4. However, he was strongly criticised by others including Denis Healey, who condemned the SDP split as a \"disaster\" for the Labour Party which prolonged their time in opposition and allowed the Tories to have an unbroken run of 18 years in government."]}, {"page": "Sabah", "response": ["The Ninth Schedule of the Constitution of Malaysia states that the Malaysian federal government is solely responsible for foreign policy and military forces in the country. Before the formation of Malaysia, North Borneo security was the responsibility of Great Britain, Australia and New Zealand. In the wake of threats of \"annexation\" from the Philippines after President Ferdinand Marcos signed a bill by including Sabah as part the Republic of the Philippines on its maritime baselines in the Act of Congress on 18 September 1968, the British responds in the next day by sending their Hawker Hunter fighter-bomber jets to Kota Kinabalu with the jets stopped over at the Clark Air Base not far from the Philippines capital of Manila. British Army senior officer Michael Carver then reminded the Philippines that Britain would honour its obligations under the Anglo-Malayan Defence Agreement (AMDA) if fighting broke out. In addition, a large flotilla of British warships would sail to Philippines waters near Sabah en route from Singapore along with the participation of ANZUS forces. The AMDA treaty have since been replaced by the Five Power Defence Arrangements (FPDA) although the present treaty does not include East Malaysian states as its main priority, British security protection intervention can still be included over the two states. Citing in 1971 when British Prime Minister Edward Heath been asked in Parliament of London on what threats the British intended to counter under the FPDA, the Prime Minister replied: to \"forces outside [Malaysia] in southern Thailand and north of the Malaysian border\"."]}, {"page": "History of the United Kingdom", "response": ["After the relative prosperity of the 1950s and 1960s, the UK experienced extreme industrial strife and stagflation through the 1970s following a global economic downturn; Labour had returned to government in 1964 under Harold Wilson to end 13 years of Conservative rule. The Conservatives were restored to government in 1970 under Edward Heath, who failed to halt the country's economic decline and was ousted in 1974 as Labour returned to power under Harold Wilson. The economic crisis deepened following Wilson's return and things fared little better under his successor James Callaghan."]}, {"page": "Politics of the United Kingdom", "response": ["The United Kingdom first joined the then European Communities in January 1973 by the then Conservative Prime Minister Edward Heath, and remained a member of the European Union (EU) that it evolved into; British citizens, and other EU citizens resident in the UK, between 1979 and 2019 elected members to represent them in the European Parliament in Brussels and Strasbourg."]}, {"page": "Economy of the United Kingdom", "response": ["During the 1973 oil crisis, the 1973–74 stock market crash, and the secondary banking crisis of 1973–75, the British economy fell into the 1973–75 recession and the government of Edward Heath was ousted by the Labour Party under Harold Wilson, which had previously governed from 1964 to 1970. Wilson formed a minority government in March 1974 after the general election on 28 February ended in a hung parliament. Wilson secured a three-seat overall majority in a second election in October that year."]}, {"page": "University of Oxford", "response": ["Twenty-eight British prime ministers have attended Oxford, including William Gladstone, H. H. Asquith, Clement Attlee, Harold Macmillan, Edward Heath, Harold Wilson, Margaret Thatcher, Tony Blair, David Cameron, Theresa May and Boris Johnson. Of all the post-war prime ministers, only Gordon Brown was educated at a university other than Oxford (the University of Edinburgh), while Winston Churchill, James Callaghan and John Major never attended a university."]}, {"page": "History of the United Arab Emirates", "response": ["By 1966, the British government had come to the conclusion that it could no longer afford to govern what is now the United Arab Emirates. Much deliberation took place in the British parliament, with a number of MPs arguing that the Royal Navy would not be able to defend the Trucial Sheikhdoms. Denis Healey, who, at the time, was the UK Secretary of State for Defence, reported that the British Armed Forces were severely overextended, and in some respects, dangerously under-equipped to defend the Sheikhdoms. On 16 January 1968, British Prime Minister Harold Wilson announced the decision to end the treaty relationships with the seven Trucial Sheikhdoms which had been, together with Bahrain and Qatar, under British protection. The British decision to withdraw was reaffirmed in March 1971 by Prime Minister Edward Heath."]}, {"page": "Conservative Party (UK)", "response": ["Following controversy over the selections of Harold Macmillan and Alec Douglas-Home via a process of consultation known as the 'Magic Circle',Thorpe, D.R. (2010). Supermac. a formal election process was created and the first leadership election was held in 1965. Of the three candidates, Edward Heath won with 150 votes to Reginald Maudling's 133 and Enoch Powell's 15 votes.", "=== Edward Heath (1965–1975) ===", "Edward Heath's 1970–74 government was known for taking the UK into the EEC, although the right-wing of the party objected to his failure to control the trade unions at a time when a declining British industry saw many strikes, as well as a recession which started in 1973 and lasted for two years.", "No subject has proved more divisive in the Conservative Party in recent history than the role of the United Kingdom within the European Union. Though the principal architect of the UK's entry into the European Communities (which became the European Union) was Conservative Prime Minister Edward Heath, and both Winston Churchill and Harold Macmillan favoured some form of European union, the bulk of contemporary Conservative opinion is opposed to closer economic and particularly political union with the EU. This is a noticeable shift in British politics, as in the 1960s and 1970s the Conservatives were more pro-Europe than the Labour Party: for example, in the 1971 House of Commons vote on whether the UK should join the European Economic Community, only 39 of the then 330 Conservative MPs were opposed to membership. Divisions on Europe came to the fore under the premiership of Margaret Thatcher (1979–1990) and were cited by several ministers resigning, including Geoffrey Howe, the Deputy Prime Minister, whose resignation triggered the challenge that ended Thatcher's leadership. Under Thatcher's successor, John Major (1990–1997), the slow process of integration within the EU forced party tensions to the surface. A core of Eurosceptic MPs under Major used the small Conservative majority in Parliament to oppose Government policy on the Maastricht Treaty. By doing so they undermined Major's ability to govern.", "In 1968, Edward Heath issued his 'Perth declaration', in support of a Scottish assembly, in the wake of growing nationalism. However, the cause went unanswered during his turbulent premiership, and under Margaret Thatcher and John Major's leadership, the Conservatives vehemently opposed devolution, and campaigned against it in the 1997 devolution referendum. Following the Scottish Parliament's establishment in 1999, they have vowed to support its continued existence, and along with Labour and the Liberal Democrats, they supported the Scotland Bill (2011), granting further devolution of power. They campaigned alongside Labour and the Liberal Democrats against full Scottish Independence in the 2014 Scottish independence referendum.", "One-nation conservatism was the party's dominant ideology in the 20th century until the rise of Thatcherism in the 1970s. It has included in its ranks Conservative Prime Ministers such as Stanley Baldwin, Harold Macmillan and Edward Heath. One Nation Conservatives in the contemporary party include Malcolm Rifkind and Damian Green. The name itself comes from a famous phrase of Disraeli. Ideologically, One Nation Conservatism identifies itself with a broad liberal conservative stance. They are often associated with the Tory Reform Group and the Bow Group.", "| rowspan=\"4\"|Edward Heath"]}, {"page": "1974", "response": ["** Following a hung parliament in the United Kingdom general election, Conservative prime minister Edward Heath resigns and is succeeded by Labour's Harold Wilson, who previously led the country from 1964 to 1970."]}, {"page": "1916", "response": ["* July 9 – Edward Heath, Prime Minister of the United Kingdom (d. 2005)"]}, {"page": "1970", "response": ["* June 18 – 1970 United Kingdom general election: the Conservative Party wins and Edward Heath becomes Prime Minister, ousting the Labour government of Harold Wilson after nearly six years in power. The election result is something of a surprise, as most of the opinion polls had predicted a third successive Labour win."]}, {"page": "1965", "response": ["* July 27 – Edward Heath becomes Leader of the British Conservative Party."]}, {"page": "1973", "response": ["* February 26 – Edward Heath's British government publishes a Green Paper on prices and incomes policy."]}]}}