{"wiki_id": "http://www.wikidata.org/entity/Q1281760", "itemLabel": "John Harwood", "itemDescription": "British watchmaker", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Harwood_(watchmaker)", "wikipedia_page": {"main": "John Harwood (1893–1964) was a British watchmaker who invented a self-winding wristwatch.", "link_mentions": [{"page": "Watch", "response": ["The impact of the First World War of 1914-1918 dramatically shifted public perceptions on the propriety of the man's wristwatch and opened up a mass market in the postwar era. The creeping barrage artillery tactic, developed during the war, required precise synchronization between the artillery gunners and the infantry advancing behind the barrage. Service watches produced during the war were specially designed for the rigours of trench warfare, with luminous dials and unbreakable glass. The War Office began issuing wristwatches to combatants from 1917. By the end of the war, almost all enlisted men wore a wristwatch (or wristlet), and after they were demobilized the fashion soon caught on: the British Horological Journal wrote in 1917 that \"the wristlet watch was little used by the sterner sex before the war, but now is seen on the wrist of nearly every man in uniform and of many men in civilian attire\". By 1930 the ratio of wristwatches to pocket watches was 50 to 1. John Harwood invented the first successful self-winding system in 1923.", "A self-winding or automatic watch is one that rewinds the mainspring of a mechanical movement by the natural motions of the wearer's body. The first self-winding mechanism was invented for pocket watches in 1770 by Abraham-Louis Perrelet, but the first \"self-winding\", or \"automatic\", wristwatch was the invention of a British watch repairer named John Harwood in 1923. This type of watch winds itself without requiring any special action by the wearer. It uses an eccentric weight, called a winding rotor, which rotates with the movement of the wearer's wrist. The back-and-forth motion of the winding rotor couples to a ratchet to wind the mainspring automatically. Self-winding watches usually can also be wound manually to keep them running when not worn or if the wearer's wrist motions are inadequate to keep the watch wound.", "* UK patent GB218487, Improvements relating to wrist watches, 1923 patent resulting from John Harwood's invention of a practical self-winding watch mechanism."]}, {"page": "History of watches", "response": ["The company H. Williamson Ltd., based in Coventry, was one of the first to capitalize on this opportunity. During the company's 1916 AGM it was noted that \"...the public is buying the practical things of life. Nobody can truthfully contend that the watch is a luxury. It is said that one soldier in every four wears a wristlet watch, and the other three mean to get one as soon as they can.\" By the end of the War, almost all enlisted men wore a wristwatch, and after they were demobilized, the fashion soon caught on – the British Horological Journal wrote in 1917 that \"...the wristlet watch was little used by the sterner sex before the war, but now is seen on the wrist of nearly every man in uniform and of many men in civilian attire.\" By 1930, the ratio of wrist- to pocketwatches was 50 to 1. The first successful self-winding system was invented by John Harwood in 1923."]}, {"page": "Automatic watch", "response": ["Invented by John Harwood, a watch repairer from Bolton, England, who took out a UK patent with his financial backer, Harry Cutts, on 7 July 1923, and obtained a corresponding Swiss patent on 16 October 1923.  The Harwood system used a pivoting weight which swung as the wearer moved, winding the mainspring. The ratchet mechanism wound the mainspring only when moving in one direction.  The weight did not rotate a full 360°; spring bumpers limited its swing to about 180°, to encourage a back and forth motion. This early type of self-winding mechanism is now referred to as a 'hammer' or 'bumper'."]}, {"page": "List of English inventions and discoveries", "response": ["* 1923: Self-winding watch invented by John Harwood (1893–1964)."]}, {"page": "British Horological Institute", "response": ["*1957 John Harwood - invented the self-winding wristwatch"]}, {"page": "Blancpain", "response": ["In 1926, the Manufacture entered into a partnership with John Harwood and started marketing the first automatic wristwatch. The year 1932 saw the end of the family's management of the firm, which had lasted for over two centuries. On the death of Frédéric-Emile Blancpain, his only daughter, Berthe-Nellie, did not wish to go into watchmaking. The following year, the two members of the staff who had been closest to Frédéric-Emile, Betty Fiechter and André Léal, bought the business. As there was no longer any member of the Blancpain family in control of the firm, the two associates were obliged by law as it stood at the time to change the company name. The firm would be called Rayville S.A., succ. de Blancpain, \"Rayville\" being a phonetic anagram of Villeret. Despite this change of name, the identity of the Manufacture was perpetuated, and the characteristics of the brand were preserved."]}, {"page": "Fortis (Swiss watchmaker)", "response": ["Fortis was founded by Walter Vogt in 1912. Twelve years after its establishment, Vogt set up production with John Harwood, inventor of the automatic wristwatch. In 1926, Fortis released the patented Harwood Automatic, the first self-winding wristwatch, at Baselworld. In 1937, Fortis commemorated the company's 25th anniversary by manufacturing and marketing its first chronographs, including the Rolls and the Autorist. The Autorist was also designed by John Harwood and used the movement of the strap to power the watch. By 1943,"]}, {"page": "List of people from Bolton", "response": ["*John Harwood (1893–1964) – invented self-winding wristwatch"]}, {"page": "History of timekeeping devices", "response": ["Fob watches were starting to be replaced at the turn of the 20th century. The Swiss, who were neutral throughout World War I, produced wristwatches for both sides of the conflict. The introduction of the tank influenced the design of the Cartier Tank watch, and the design of watches during the 1920s was influenced by the Art Deco style. The automatic watch, first introduced with limited success in the 18th century, was reintroduced in the 1920s by the English watchmaker John Harwood. After he went bankrupt in 1929, restrictions on automatic watches were lifted and companies such as Rolex were able to produce them. In 1930, Tissot produced the first ever non-magnetic wristwatch."]}, {"page": "List of British innovations and discoveries", "response": ["*Self-winding watch – John Harwood"]}, {"page": "John Harwood", "response": ["John Harwood may refer to:", "*John Harwood (watchmaker) (1893–1965), English watchmaker who developed first self-winding watch", "*John Harwood (biochemist) (born 1946), British biochemist", "*John Harwood (writer) (born 1946), Australian novelist", "*John Harwood (journalist) (born 1956), American journalist"]}, {"page": "List of watchmakers", "response": ["* John Harwood (1893–1965), English inventor and clockmaker, automatic wrist watch, Fortis watch brand."]}]}}