{"wiki_id": "http://www.wikidata.org/entity/Q12989166", "itemLabel": "William Hutchings", "itemDescription": "English cricketer (1879-1948)", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Hutchings", "wikipedia_page": {"main": "William Edward Colebrooke Hutchings (31 May 1879 – 8 March 1948) was an English amateur cricketer who played in 24 first-class cricket matches for Kent County Cricket Club and Worcestershire County Cricket Club at the turn of the twentieth century. He served in the Army Service Corps attached to the Royal Garrison Artillery during World War I in Egypt and on the Western Front where he was wounded.", "link_mentions": [{"page": "Prees", "response": ["* William Hutchings (1879 – 1948 in Prees) soldier and English amateur cricketer, played in 24 first-class matches for Kent and Worcestershire."]}, {"page": "Hutchings", "response": ["*William Hutchings (1879–1948), English cricketer"]}, {"page": "List of Old Tonbridgians", "response": ["* William Hutchings, county cricketer"]}, {"page": "William Hutchings (disambiguation)", "response": ["William Hutchings (1879–1948) was an English amateur cricketer.", "William Hutchings may also refer to:", "*William Hutchings (priest) (1835–1912), Anglican priest and author"]}, {"page": "Hutchings, William", "response": ["#redirectWilliam Hutchings"]}, {"page": "Edward Colebrooke (cricketer)", "response": ["The son of Dr. Henry Colebrooke, he was born at Southborough in October 1858. He was educated at Charterhouse School, before going up to Exeter College, Oxford. While at Oxford, he made his debut in first-class cricket for the Gentlemen of England against Oxford University in 1879 at Oxford. The following season he played first-class cricket for Oxford University, making five appearances and gaining a blue. He made an additional first-class appearance in 1880 when he played for the Gentlemen of Kent against the Gentlemen of England at Canterbury. In seven first-class matches, Colebrook scored 161 runs at an average of 13.41, with a high score of 34 not out. After graduating from Oxford, he became a priest in the Church of England. He died without issue at Canterbury in August 1939. His nephew's Kenneth Hutchings, Frederick Hutchings and William Hutchings all played first-class cricket, with Kenneth playing at Test level for England."]}]}}