{"wiki_id": "http://www.wikidata.org/entity/Q12989015", "itemLabel": "Vikram Solanki", "itemDescription": "English cricketer (born 1976)", "wikipedia_url": "https://en.wikipedia.org/wiki/Vikram_Solanki", "wikipedia_page": {"main": "Vikram Singh Solanki (born 1 April 1976) is an English cricket coach and former first-class cricketer. In limited over international cricket, he played over 50 One Day Internationals for England as a batsman and occasional off-spinner.\nIn county cricket, he played for Surrey, having previously spent 17 years at Worcestershire. In 2007, he became the 24th Worcestershire batsman to pass 10,000 career runs for the county. He also captained Worcestershire from 2005 to 2010, before resigning mid-season.In September 2015 he announced his retirement as a player. After obtaining an LLB from the Open University, Vikram then studied the Legal Practice Course at the University of Law.\nIn January 2018, Solanki was appointed deputy head coach at Surrey CCC, and in June 2020 he was promoted to head coach by Surrey's Director of Cricket, Alec Stewart, in succession to Michael di Venuto. During this time  he was also a member of the Royal Challengers Bangalore coaching staff in the Indian Premier League, where he worked as the assistant coach.In addition to Solanki's playing and coaching roles, he has also held cricket administration roles. In March 2009 he was appointed Chairman of The Professional Cricketer's Association, where he also held the role of Interim Chief Executive and in March 2017 he became FICA President, succeeding former West Indian International, Jimmy Adams.", "link_mentions": [{"page": "List of people from Rajasthan", "response": ["*Vikram Solanki, Cricket"]}, {"page": "Andrew Strauss", "response": ["Strauss's first taste of international cricket came as part of England's tour of the sub-continent, but he would only fulfil the role of the twelfth man; despite considering himself better in the long form of the game, Strauss was surprised to be selected for the One Day squad. Although he was not selected for the main team, Strauss did make an appearance in a tour match, starring with 51 in an opening partnership of 146 in a slow, but fluent innings. As England moved straight from Bangladesh to Sri Lanka, Strauss continued to put pressure on England opener Vikram Solanki in a tour match top scoring with 83, juxtaposed with Solanki's five ball duck and was rewarded with his England debut in a disastrous ten-wicket defeat where he was caught and bowled by fellow debutant Dinusha Fernando and was subsequently omitted for the rest of the tour."]}, {"page": "Surrey County Cricket Club", "response": ["* Vikram Solanki (2020-2022)"]}, {"page": "Marcus Trescothick", "response": ["Trescothick played well against a weak Zimbabwe side in the two-Test series in May–June 2003, and scored an unbeaten century in the three ODIs against Pakistan averaging over 100.Batting and Fielding for England, National Westminster Bank Challenge 2003, CricketArchive. Retrieved on 7 August 2007. His form continued in the 2003 NatWest Series, with 114 not out against South Africa. The opening stand with Vikram Solanki of 200 runs was the highest first-wicket partnership for England and provided the first instance of both England openers scoring centuries in the same innings.Gupta, Rajneesh \"England v South Africa ODI on 28 June 2003 – statistical highlights\", CricketArchive, 28 June 2003. Retrieved on 7 August 2007. Trescothick maintained his form in the South Africa Test matches; a career-best 219 at The Oval completed a successful series in which he averaged 60.87.South Africa in England, 2003 Test Series Averages, ESPNcricinfo. Retrieved on 8 August 2007.", "Trescothick was unable to avoid a recurrence of his previous difficulties when travelling abroad, however, and returned home on 15 October, citing the same \"stress related illness\". Brian Rose, who Trescothick had approached initially after Somerset's defeat by Trinidad and Tobago on 12 October, released a statement to the media stating \"Marcus admitted a couple of days ago that he wasn't 100% so that's fair enough. I think his future will be in domestic cricket and that may even help him with this particular form of illness. I think over the next two or three years you'll see Marcus Trescothick performing wonderfully well in county cricket.\" Michael Vaughan, who had by then retired from cricket, praised Trescothick's \"courageous\" decision, as did Vikram Solanki, then PCA chairman. Journalist Andrew Miller called for an end to the rising criticism of Trescothick's decision from the public, while Paul Hayward of the Guardian also derided those critical of the Somerset player's actions. Despite returning home, Trescothick continued to affirm his commitment to the club by signing a new three-year contract with optional fourth year, in December. He was named captain for the 2010 season.", "* England and The Oval first wicket partnership record: 200 with Vikram Solanki, 2003 v South Africa"]}, {"page": "Jimmy Adams", "response": ["In addition to his playing and coaching credentials, Adams was appointed chairman of FICA in May 2009, replacing the South African great Barry Richards. Adams held this role until March 2017 when he was replaced by Vikram Solanki, Surrey CCC's head coach.https://www.bbc.com/sport/cricket/53023773 12th June 2020"]}, {"page": "Worcestershire County Cricket Club", "response": ["Worcestershire failed to gain promotion in 2000, despite overseas signing Glenn McGrath taking 76 Championship wickets at an average of 13.77. In 2003, Worcestershire were promoted to County Championship Division One for the first time after winning the Division Two title. Worcestershire also reached the final of the Cheltenham & Gloucester trophy, beating Lancashire in a memorable semi-final at New Road on 9 August 2003. There was disappointment in the Lord's final, though, as Worcestershire lost by seven wickets and the Pears were also relegated from Division One of the National League. 2004 was a yo-yo year with Worcestershire relegated in the County Championship, promoted back to Division One in the rebranded totesport League and losing finalists again in the C&G Trophy. Vikram Solanki scored centuries in both the semi-final win against Warwickshire and the final against Gloucestershire, but the 'Gladiators' won by eight wickets at Lord's.", ":1998: Vikram Solanki", "*2nd: 316 by Stephen Moore and Vikram Solanki v. Gloucestershire, Cheltenham, 2008"]}, {"page": "Gloucestershire County Cricket Club in 2005", "response": ["Despite being strengthened by their new acquisition from the West Indies, Ramnaresh Sarwan, Gloucestershire Gladiators still went down at Bristol. Having been put in to bat by Worcestershire Royals after rain delayed the start, Kabir Ali dug out a wicket with his first ball, and despite 51 from Matt Windows Gloucestershire still only posted 168 for 9. In reply, Vikram Solanki and Stephen Moore batted 12.4 overs without loss before rain intervened, and Worcestershire were then 20 runs ahead of their Duckworth/Lewis target.", "A menacing spell from Shoaib Akhtar, who got six wickets for 16 runs, including the first five as Gloucestershire crashed to 22 for 5, left Gloucestershire Gladiators without any hope in the bottom-fight at New Road, Worcester. Akhtar's bowling analysis was the best in the National League all season. After Akhtar was taken off, Malinga Bandara and Mark Alleyne set about trying to bat out fifty overs, but Alleyne was caught by Worcestershire Royals' Vikram Solanki and Kabir Ali cleaned up the tail with two wickets as Gloucestershire were all out for 105. Bandara then got the wickets of Stephen Moore and Vikram Solanki with successive deliveries, but Chris Gayle guided the hosts home with an unbeaten 53 off 70 balls, as Worcestershire won with more than 20 overs to spare."]}, {"page": "Essex County Cricket Club in 2005", "response": ["Essex Eagles continued on their winning ways with their twelfth National League victory of the season, taking a win in the last over thanks to a 78-run stand between Grant Flower and Ravinder Bopara. However, it was Worcestershire Royals who won the toss and batted first, Stephen Moore and Vikram Solanki (coming in for Chris Gayle who retired hurt) adding 103 for the first wicket. Gayle returned when Solanki was dismissed, hitting 44, and 25 from Ben Smith helped Worcestershire to 227 for 5. Andre Adams took three wickets as Worcestershire lost four for one solitary run, but Smith added 10 with the number 11 Nadeem Malik to bring the total of 240 for 9. Essex lost captain Ronnie Irani for nine early on, but a stroke-filled half-century from Alastair Cook sent Essex to 135 for 3, and Grant Flower then hit four sixes to complete a run-a-ball 81. Despite two late wickets from Kabir Ali, Bopara saw Essex home with five deliveries to spare to finish on 46 not out."]}, {"page": "Glamorgan County Cricket Club in 2005", "response": ["Worcestershire Royals failed to defend a total of 273 for 3 – their highest of the season thus far – against Glamorgan Dragons at New Road. Winning the toss and batting first, Worcestershire captain Vikram Solanki paired up for 91 with Stephen Moore, who would go on to make 104. Zander de Bruyn also made an unbeaten fifty to lift Worcestershire to 273 for 3. The Indian international Sourav Ganguly was the only Glamorgan bowler to escape with less than five runs an over to his name, as he got one wicket for 19 in his five overs. Worcestershire dismissed Robert Croft in the second over, but Glamorgan sent out another pinch-hitter in Alex Wharf who made 38 before he was bowled by David Leatherdale, who took two for 35. Another wicket fell shortly afterwards, and Glamorgan were 67 for 3, but Sourav Ganguly made 53, Mike Powell contributed 82, and David Hemp sealed the win with his unbeaten 51 off 36 ball. The Glamorgan batsman took a particular liking to England Test spinner Gareth Batty who finished wicketless for 69 runs."]}, {"page": "Northamptonshire County Cricket Club in 2005", "response": ["At Northampton, Worcestershire Royals captain Vikram Solanki led from the front, scoring 119 off 137 balls, including 13 fours and 1 six. Support from his colleagues took the visitors up to 211 for 4 off their 45 overs. Worcestershire director of cricket Tom Moody said of Solanki: \"I can't see why he won't be in the mix for England section this summer. It depends how the selectors shuffle the deck, but I would imagine he will be in their minds for consideration at the very least. We were very confident he was ready for the challenge of captaincy and he has had a great start.\""]}, {"page": "British Asian", "response": ["* Vikram Solanki"]}, {"page": "Lancashire County Cricket Club in 2005", "response": ["Lancashire recorded an innings victory at Stanley Park in Blackpool against Worcestershire to go second in the Division Two table of the County Championship. Mal Loye and Stuart Law made centuries in the first innings, which became a very difficult one for the Worcestershire bowlers. On the second day, Worcestershire finally got some breakthroughs, as Loye was dismissed for 187 and North for 60, and Lancashire could declare with a total of 562 for 8. Chris Gayle played an innings in typical fashion, hitting eight fours from 25 deliveries before he was bowled by Dominic Cork for 43. Cork also got Graeme Hick for a duck, as Worcestershire closed the second day on 111 for 3. Ben Smith and Vikram Solanki fought back, however, pairing up for 140 for the fourth wicket, and Worcestershire looked confident of avoiding the follow-on with the score on 330 for 4. However, two wickets from Andrew Symonds and three from James Anderson ended the Worcestershire effort for 376, still trailing by 186.", "Lancashire Lightning ensured continued survival in Division One of the National League with a victory over Worcestershire Royals in a rain-shortened match that was cut down from 45 to 33 overs. David Leatherdale and Gareth Batty took early wickets, as Lancashire lost their first four wickets for 65 runs, but Glen Chapple and Stuart Law added 84 for the fifth wicket, and Kyle Hogg also provided quick runs as Lancashire ended on 186 for 8. The six Lancashire bowlers then shared out wickets, as James Anderson ended with three for 12 including England batsman Vikram Solanki, while spinners Murali Kartik and Andrew Symonds took two each as Worcestershire were bowled out for 111. No Worcestershire batsman passed 25, and thus Worcestershire fell down into Division Two."]}, {"page": "Worcestershire County Cricket Club in 2005", "response": ["Worcestershire County Cricket Club in 2005 played their County Championship games in Division Two and their Totesport League games in Division One. Under their new captain, Vikram Solanki, they were tipped to go straight back up to the top flight of the County Championship and started the season 9–2 second favourites to end up as Division Two champions.", "At Derby, Worcestershire won the toss and chose to bat. Stephen Moore was run out early for 19. He held his pose, showing off his defensive shot during an appeal for leg before wicket, as Moss came in on the blind side and threw the ball at the stumps. The other opener, Stephen Peters, stayed around though, and made 55. Once Moore was out, Peters was joined by Graeme Hick, who was given lives on 8 and 57, and made 80 off 119 balls before finally being lbw for 80 off one that kept low. Vikram Solanki then went for a duck, but Worcestershire were never in trouble, finishing on 305 for 6 at close.", "At Northampton, Worcestershire Royals captain Vikram Solanki led from the front, scoring 119 off 137 balls, including 13 fours and 1 six. Support from his colleagues took the visitors up to 211 for 4 off their 45 overs. Worcestershire director of cricket Tom Moody said of Solanki: \"I can't see why he won't be in the mix for England section this summer. It depends how the selectors shuffle the deck, but I would imagine he will be in their minds for consideration at the very least. We were very confident he was ready for the challenge of captaincy and he has had a great start.\"", "The first day at The Grange saw no play because of rain. After losing the toss, Scotland were put in, and the bowlers immediately made it very difficult for Scotland. It took them six overs to make their first ten runs, and every time they tried to accelerate, they lost wickets. In the end, they could only muster 134 all out in 46.5 overs. Vikram Solanki and Stephen Moore made this target look easy, passing the required 135 runs without losing a wicket in 5 balls fewer than 20 overs. Both batsmen made half-centuries. (Cricinfo scorecard)", "Middlesex Crusaders were lifted by a massive 160-run partnership between New Zealand all-rounder Scott Styris and former England Test player Ed Smith as they assembled 224 for 7 in a rain-shortened match at Worcester, in which Worcestershire's bowlers delivered six maiden overs. However, Worcestershire Royals' reply were hampered by wickets falling everywhere, along with lack of responsibility to keep the run-rate up, as Vikram Solanki made 40 off 66 balls and Zander de Bruyn 55 off 74 – too slow to chase 225 in 44 overs. When Gareth Batty was run out, a rot set in, as Worcestershire lost five wickets for 15 runs and were forced to crawl to 192 for 9.", "Worcestershire Royals would be ruing lost opportunities after the game with Glamorgan Dragons at New Road. Winning the toss and batting first, captain Vikram Solanki paired up for 91 with Stephen Moore, who would go on to make 104. Zander de Bruyn also made an unbeaten fifty to lift Worcestershire to 273 for 3. The Indian international Sourav Ganguly was the only Glamorga bowler to come out with some credit, as he got one wicket for 19 in his five overs. Worcestershire started creditably, snaring the wicket of Robert Croft in the second over, but Glamorgan sent out another pinch-hitter in Alex Wharf who made 38 before he was bowled bu David Leatherdale who took two for 35. However, Sourav Ganguly with 53, Michael Powell with 82, and David Hemp with an unbeaten 51 off 36 balls chased down the target. The Glamorgan batsman took a particular liking to England Test spinner Gareth Batty who finished wicketless for 69 runs.", "Despite being strengthened by their new acquisition from the West Indies, Ramnaresh Sarwan, Gloucestershire Gladiators still went down at Bristol. Having been put in to bat by Worcestershire Royals after rain delayed the start, Kabir Ali dug out a wicket with his first ball, and despite 51 from Matthew Windows Gloucestershire still only posted 168 for 9. In reply, Vikram Solanki and Stephen Moore batted 12.4 overs without loss before rain intervened, and Worcestershire were then 20 runs ahead of their Duckworth/Lewis target.", "The first day only allowed one over of play, after Vikram Solanki sent Australia in to bat and Justin Langer hit a four off Kabir Ali. On the second day, Langer and Matthew Hayden accumulated 110 for the first wicket, and runs just kept flowing as the Australians made 402 in a day – Brad Haddin top-scoring with 94, Jason Gillespie making an unbeaten 53 including two sixes, while Nadeem Malik got the best bowling figures three wickets for 78. Ali, meanwhile, was punished, to end with 124 conceded runs in 20 overs.", "Lancashire recorded an innings victory at Stanley Park in Blackpool against Worcestershire to go second in the Division Two table of the County Championship. Mal Loye and Stuart Law made centuries in the first innings, which became a very difficult one for the Worcestershire bowlers. On the second day, Worcestershire finally got some breakthroughs, as Loye was dismissed for 187 and North for 60, and Lancashire could declare with a total of 562 for 8. Chris Gayle played an innings in typical fashion, hitting eight fours from 25 deliveries before he was bowled by Dominic Cork for 43. Cork also got Graeme Hick for a duck, as Worcestershire closed the second day on 111 for 3. Ben Smith and Vikram Solanki fought back, however, pairing up for 140 for the fourth wicket, and Worcestershire looked confident of avoiding the follow-on with the score on 330 for 4. However, two wickets from Andrew Symonds and three from James Anderson ended the Worcestershire effort for 376, still trailing by 186.", "A menacing spell from Shoaib Akhtar, who got six wickets for 16 runs, including the first five as Gloucestershire crashed to 22 for 5, left Gloucestershire Gladiators without any hope in the bottom-fight at New Road, Worcester. Akhtar's bowling analysis was the best in the National League all season. After Akhtar was taken off, Malinga Bandara and Mark Alleyne set about trying to bat out fifty overs, but Alleyne was caught by Worcestershire Royals' Vikram Solanki and Kabir Ali cleaned up the tail with two wickets as Gloucestershire were all out for 105. Bandara then got the wickets of Stephen Moore and Vikram Solanki with successive deliveries, but Chris Gayle guided the hosts home with an unbeaten 53 off 70 balls, as Worcestershire won with more than 20 overs to spare.", "Essex Eagles continued on their winning ways with their twelfth National League victory of the season, taking a win in the last over thanks to a 78-run stand between Grant Flower and Ravinder Bopara. However, it was Worcestershire Royals who won the toss and batted first, Stephen Moore and Vikram Solanki (coming in for Chris Gayle who retired hurt) adding 103 for the first wicket. Gayle returned when Solanki was dismissed, hitting 44, and 25 from Ben Smith helped Worcestershire to 227 for 5. Andre Adams took three wickets as Worcestershire lost four for one solitary run, but Smith hung in there with number 11 Nadeem Malik and ensured a total of 240 for 9. Essex lost captain Ronnie Irani for nine early on, but a stroke-filled half-century from Alastair Cook sent Essex to 135 for 3, and Grant Flower then hit four sixes to complete a run-a-ball 81. Despite two late wickets from Kabir Ali, Bopara saw Essex home with five deliveries to spare to finish on 46 not out. ", "Lancashire Lightning ensured continued survival in Division One of the National League with a victory over Worcestershire Royals in a rain-shortened match that was cut down from 45 to 33 overs. David Leatherdale and Gareth Batty took early wickets, as Lancashire lost their first four wickets for 65 runs, but Glen Chapple and Stuart Law added 84 for the fifth wicket, and Kyle Hogg also provided quick runs as Lancashire ended on 186 for 8. The six Lancashire bowlers then shared out wickets, as James Anderson ended with three for 12 including England batsman Vikram Solanki, while spinners Murali Kartik and Andrew Symonds took two each as Worcestershire were bowled out for 111. No Worcestershire batsman passed 25, and thus Worcestershire fell down into Division Two."]}, {"page": "Derbyshire County Cricket Club in 2005", "response": ["At Derby, Worcestershire won the toss and chose to bat. Stephen Moore was run out early for 19. He held his pose, showing off his defensive shot during an appeal for leg before wicket, as Jonathan Moss came in on the blind side and threw the ball at the stumps. The other opener, Stephen Peters, stayed around though, and made 55. Once Moore was out, Peters was joined by Graeme Hick, who was given lives on 8 and 57, and made 80 off 119 balls before finally being lbw for 80 off one that kept low. Vikram Solanki then went for a duck, but Worcestershire still made 305 for 6 at the close."]}, {"page": "Hampshire County Cricket Club in 2005", "response": ["In a bonus 12-over match, arranged in haste as Hampshire were bowled out for 85 in the first match, Hampshire – led by hired-in Vikram Solanki who made 41 – scored 110 for 4, but were still beaten by a massive smash from Kevin Pietersen for England, as he scored 46 from 15 balls. However, that was not all – Chris Tremlett's three wickets threatened to ruin England's chase, but Simon Jones and Darren Gough saw them to the target on the last ball."]}, {"page": "Middlesex County Cricket Club in 2005", "response": ["Middlesex Crusaders were lifted by a massive 160-run partnership between New Zealand all-rounder Scott Styris and former England Test player Ed Smith as they assembled 224 for 7 in a rain-shortened match at Worcester, in which Worcestershire's bowlers delivered six maiden overs. However, Worcestershire Royals' reply were hampered by wickets falling everywhere, along with lack of responsibility to keep the run-rate up, as Vikram Solanki made 40 off 66 balls and Zander de Bruyn 55 off 74 – too slow to chase 225 in 44 overs. When Gareth Batty was run out, a rot set in, as Worcestershire lost five wickets for 15 runs and were forced to crawl to 192 for 9."]}, {"page": "National League Division One in 2005", "response": ["At Northampton, Worcestershire Royals captain Vikram Solanki led from the front, scoring 119 off 137 balls, including 13 fours and 1 six. Support from his colleagues took the visitors up to 211 for 4 off their 45 overs. Worcestershire director of cricket Tom Moody said of Solanki: \"I can't see why he won't be in the mix for England section this summer. It depends how the selectors shuffle the deck, but I would imagine he will be in their minds for consideration at the very least. We were very confident he was ready for the challenge of captaincy and he has had a great start.\"", "Middlesex Crusaders were lifted by a massive 160-run partnership between New Zealand all-rounder Scott Styris and former England Test player Ed Smith as they assembled 224 for 7 in a rain-shortened match at Worcester, in which Worcestershire's bowlers delivered six maiden overs. However, Worcestershire Royals' reply were hampered by wickets falling everywhere, along with lack of responsibility to keep the run-rate up, as Vikram Solanki made 40 off 66 balls and Zander de Bruyn 55 off 74 – too slow to chase 225 in 44 overs. When Gareth Batty was run out, a rot set in, as Worcestershire lost five wickets for 15 runs and were forced to crawl to 192 for 9.", "Worcestershire Royals would be ruing lost opportunities after the game with Glamorgan Dragons at New Road. Winning the toss and batting first, captain Vikram Solanki paired up for 91 with Stephen Moore, who would go on to make 104. Zander de Bruyn also made an unbeaten fifty to lift Worcestershire to 273 for 3. The Indian international Sourav Ganguly was the only Glamorga bowler to come out with some credit, as he got one wicket for 19 in his five overs. Worcestershire started creditably, snaring the wicket of Robert Croft in the second over, but Glamorgan sent out another pinch-hitter in Alex Wharf who made 38 before he was bowled bu David Leatherdale who took two for 35. However, Sourav Ganguly with 53, Michael Powell with 82, and David Hemp with an unbeaten 51 off 36 balls chased down the target. The Glamorgan batsman took a particular liking to England Test spinner Gareth Batty who finished wicketless for 69 runs.", "Despite being strengthened by their new acquisition from the West Indies, Ramnaresh Sarwan, Gloucestershire Gladiators still went down at Bristol. Having been put in to bat by Worcestershire Royals after rain delayed the start, Kabir Ali dug out a wicket with his first ball, and despite 51 from Matt Windows Gloucestershire still only posted 168 for 9. In reply, Vikram Solanki and Stephen Moore batted 12.4 overs without loss before rain intervened, and Worcestershire were then 20 runs ahead of their Duckworth/Lewis target.", "A menacing spell from Shoaib Akhtar, who got six wickets for 16 runs, including the first five as Gloucestershire crashed to 22 for 5, left Gloucestershire Gladiators without any hope in the bottom-fight at New Road, Worcester. Akhtar's bowling analysis was the best in the National League all season. After Akhtar was taken off, Malinga Bandara and Mark Alleyne set about trying to bat out fifty overs, but Alleyne was caught by Worcestershire Royals' Vikram Solanki and Kabir Ali cleaned up the tail with two wickets as Gloucestershire were all out for 105. Bandara then got the wickets of Stephen Moore and Vikram Solanki with successive deliveries, but Chris Gayle guided the hosts home with an unbeaten 53 off 70 balls, as Worcestershire won with more than 20 overs to spare.", "Essex Eagles continued on their winning ways with their twelfth National League victory of the season, taking a win in the last over thanks to a 78-run stand between Grant Flower and Ravinder Bopara. However, it was Worcestershire Royals who won the toss and batted first, Stephen Moore and Vikram Solanki (coming in for Chris Gayle who retired hurt) adding 103 for the first wicket. Gayle returned when Solanki was dismissed, hitting 44, and 25 from Ben Smith helped Worcestershire to 227 for 5. Andre Adams took three wickets as Worcestershire lost four for one solitary run, but Smith hung in there with number 11 Nadeem Malik and ensured a total of 240 for 9. Essex lost captain Ronnie Irani for nine early on, but a stroke-filled half-century from Alastair Cook sent Essex to 135 for 3, and Grant Flower then hit four sixes to complete a run-a-ball 81. Despite two late wickets from Kabir Ali, Bopara saw Essex home with five deliveries to spare to finish on 46 not out.", "Lancashire Lightning ensured continued survival in Division One of the National League with a victory over Worcestershire Royals in a rain-shortened match that was cut down from 45 to 33 overs. David Leatherdale and Gareth Batty took early wickets, as Lancashire lost their first four wickets for 65 runs, but Glen Chapple and Stuart Law added 84 for the fifth wicket, and Kyle Hogg also provided quick runs as Lancashire ended on 186 for 8. The six Lancashire bowlers then shared out wickets, as James Anderson ended with three for 12 including England batsman Vikram Solanki, while spinners Murali Kartik and Andrew Symonds took two each as Worcestershire were bowled out for 111. No Worcestershire batsman passed 25, and thus Worcestershire fell down into Division Two."]}, {"page": "Scottish Saltires in 2005", "response": ["The first day at The Grange saw no play because of rain. After losing the toss, Scotland were put in, and the bowlers immediately made it very difficult for Scotland. It took them six overs to make their first ten runs, and every time they tried to accelerate, they lost wickets. In the end, they could only muster 134 all out in 46.5 overs. Vikram Solanki and Stephen Moore made this target look easy, passing the required 135 runs without losing a wicket in 5 balls fewer than 20 overs. Both batsmen made half-centuries. (Cricinfo scorecard)"]}, {"page": "Kabir Ali", "response": ["Kabir was not in England contention during the 2006 season, and for the winter of 2006–07 he turned out for Rajasthan in the Ranji Trophy along with teammate Vikram Solanki. Worcestershire's 2007 season began poorly, but Kabir claimed a career-best 8–50 in a rain-affected match against Lancashire in May. These were the best figures at Old Trafford for 13 years."]}, {"page": "Australian cricket team in England in 2005", "response": ["The Australian captain Ricky Ponting brought on part-time spinner Michael Clarke to bowl the 11th over, and got immediate success, when Pietersen launched him to Matthew Hayden on the fifth ball, but England were still 101 for 3 after 11 overs. In the next over, the new batsman Michael Vaughan edged Andrew Symonds' ball to midwicket, and the pressure was suddenly on the English. With Trescothick out for 41 a bit later to an attempted sweep off Symonds, England were suddenly looking down a hole after a fine start, and Andrew Strauss and Paul Collingwood slowed the scoring, to see England 111 for 5 with six overs to play. However, a slog sweep from Collingwood to end the 15th over turned the match again, as it went away for six and England moved to 124 for 5. With Jason Gillespie being brought back, Collingwood led the charge, as England stole 17 runs off the 17th over and wrought control of the game again. Despite Andrew Strauss being bowled by Gillespie for 18, Collingwood hit another two boundaries towards the end of the over, to move onto 42 not out and the team score to 167 for 6. Vikram Solanki was out in the next over for 9, caught by Hussey off McGrath, and on the last ball, Collingwood was caught by for 46. Still, England would be pleased with 179 for 8, the highest score on the Rose Bowl in Twenty20 matches.", "Australia dug themselves out of the hole, however, Michael Clarke and Michael Hussey slowly accumulating to increase the rate. England clearly lacked a fifth bowler, opting instead for Vikram Solanki to bat down the order, so they used a combination of Michael Vaughan, Solanki and Collingwood to get through their ten required overs. That let Australia off the hook, with Clarke and Hussey adding 105, before Jon Lewis – who had been taken to the cleaners earlier on – dug out Michael Clarke with an inside edge onto the stumps, taking the fifth wicket of the game at just the right time. Shane Watson accumulated well with Hussey, however, hitting six an over as Lewis was smashed about again, but Harmison got his revenge by completing his first five-wicket haul in ODIs as Hussey was beaten by a slower ball – the first time Hussey had been dismissed in One Day Internationals, for a batting average of 229. Then, Andrew Flintoff was brought back, getting a splendid yorker in for Watson, who was out for 25 just as the Aussies were preparing to hit out – the score 220 for 7 after 44.1 overs. Jason Gillespie and Brad Hogg survived a couple of overs from Flintoff and Harmison – meaning that Harmison finished with five for 33 off ten overs. Towards the end, Australia built up again, before losing Gillespie to a top edge, but 244 for 8 with seven balls remaining still looked difficult for England to chase. Gough dug out Michael Kasprowicz with a yorker with two balls to spare, and four legbyes ended the innings to take Australia to 252 for 9.", "A rescue operation from Andrew Flintoff and Vikram Solanki followed, pairing up for 79 before Solanki was caught at midwicket off Brad Hogg. Then, Flintoff was nearly stumped off Hogg's bowling, only to give a catch at long on later on in the over for 44. With England at 94 for 5, they needed seven and a half runs an over, with Kevin Pietersen and Geraint Jones at the crease. However, even Pietersen could not save them this time, as he was caught in the deep off Symonds for 19, and the rest of the match just became a task to bat out 50 overs. Thanks to Darren Gough, who made 46 not out (ironically, the top score of the innings), and a level-headed 11 not out from Steve Harmison, England made that, but lost by 57 runs – thus also losing the bonus point.", "They never recovered. Despite another skier being dropped, this time by Adam Gilchrist, and the crowd enjoying Gillespie dropping more catches whilst practising in the field, Australia's dominance and fine fielding on the ground saw more England wickets fall. In 27.5 overs, they only mustered 93 runs – for the loss of six wickets, with Michael Vaughan, Andrew Strauss, Andrew Flintoff, Paul Collingwood and Geraint Jones all out. A desperate situation meant England had to use their substitute, putting on Vikram Solanki for bowler Simon Jones – and Solanki helped save England to some respectability, along with Kevin Pietersen. Solanki made an unbeaten 53 and Pietersen 74 as England posted 228 for 7.", "The first day only allowed one over of play, after Vikram Solanki sent Australia in to bat and Justin Langer hit a four off Kabir Ali. On the second day, Langer and Matthew Hayden accumulated 110 for the first wicket, and runs just kept flowing as the Australians made 402 in a day – Brad Haddin top-scoring with 94, Jason Gillespie making an unbeaten 53 including two sixes, while Nadeem Malik got the best bowling figures three wickets for 78. Ali, meanwhile, was punished, to end with 124 conceded runs in 20 overs."]}, {"page": "Twenty20 in England in 2005", "response": ["The Australian captain Ricky Ponting brought on part-time spinner Michael Clarke to bowl the eleventh over, and got immediate success, when Pietersen launched him to Matthew Hayden on the fifth ball, but England were still 101 for 3 after eleven overs. In the next over, the new batsman Michael Vaughan edged Andrew Symonds' ball to midwicket, and the pressure was suddenly on the English. With Trescothick out for 41 a bit later to an attempted sweep off Symonds, England were suddenly looking down a hole after a fine start, and Andrew Strauss and Paul Collingwood slowed the scoring, to see England 111 for 5 with six overs to play. However, a slog sweep from Collingwood to end the fifteenth over turned the match again, as it went away for six and England moved to 124 for 5. With Jason Gillespie being brought back, Collingwood led the charge, as England stole seventeen runs off the seventeenth over and wrought control of the game again. Despite Andrew Strauss being bowled by Gillespie for 18, Collingwood hit another two boundaries towards the end of the over, to move onto 42 not out and the team score to 167 for 6. Vikram Solanki was out in the next over for 9, caught by Hussey off McGrath, and on the last ball, Collingwood was caught by for 46. Still, England would be pleased with 179 for 8, the highest score on the Rose Bowl in Twenty20 matches."]}, {"page": "One-Day Internationals in England in 2005", "response": ["Australia dug themselves out of the hole, however, Michael Clarke and Michael Hussey slowly accumulating to increase the rate. England clearly lacked a fifth-bowler, opting instead for Vikram Solanki to bat down the order, so they used a combination of Michael Vaughan, Solanki and Collingwood to get through their ten required overs. That let Australia off the hook, with Clarke and Hussey adding 105, before Jon Lewis - who had been taken to the cleaners earlier on - dug out Michael Clarke with an inside edge onto the stumps, taking the fifth wicket of the game at just the right time. Shane Watson accumulated well with Hussey, however, hitting six an over as Lewis was smashed about again, but Harmison got his revenge by completing his first five-wicket-haul in ODIs as Hussey was beaten by a slower ball - the first time Hussey had been dismissed in One-Day Internationals, for a batting average of 229. Then, Andrew Flintoff was brought back, getting a splendid yorker in for Watson, who was out for 25 just as the Aussies were preparing to hit out - the score 220 for 7 after 44.1 overs. Jason Gillespie and Brad Hogg survived a couple of overs from Flintoff and Harmison - meaning that Harmison finished with five for 33 off ten overs. Towards the end, Australia built up again, before losing Gillespie to a top edge, but 244 for 8 with seven balls remaining still looked difficult for England to chase. Gough dug out Michael Kasprowicz with a yorker with two balls to spare, and four legbyes ended the innings to take Australia to 252 for 9.", "A rescue operation from Andrew Flintoff and Vikram Solanki followed, pairing up for 79 before Solanki was caught at midwicket off Brad Hogg. Then, Flintoff was nearly stumped off Hogg's bowling, only to give a catch at long on later on in the over for 44. With England at 94 for 5, they needed seven and a half runs an over, with Kevin Pietersen and Geraint Jones at the crease. However, even Pietersen couldn't save them this time, as he was caught in the deep off Symonds for 19, and the rest of the match just became a task to bat out 50 overs. Thanks to Darren Gough, who made 46 not out (ironically, the top score of the innings), and a level-headed 11 not out from Steve Harmison, England made that, but lost by 57 runs - thus also losing the bonus point.", "They never recovered. Despite another skier being dropped, this time by Adam Gilchrist, and the crowd enjoying Gillespie dropping more catches whilst practising in the field, Australia's dominance and fine fielding on the ground saw more England wickets fall. In 27.5 overs, they only mustered 93 runs - for the loss of six wickets, with Michael Vaughan, Andrew Strauss, Andrew Flintoff, Paul Collingwood and Geraint Jones all out. A desperate situation meant England had to use their substitute, putting on Vikram Solanki for bowler Simon Jones - and Solanki helped save England to some respectability, along with Kevin Pietersen. Solanki made an unbeaten 53 and Pietersen 74 as England posted 228 for 7."]}, {"page": "Richard Johnson (cricketer, born 1974)", "response": ["Johnson's first taste of international cricket came during the 1992–93 Coca-Cola International Youth Cricket Challenge in South Africa, where he represented England Under-18s, alongside fellow future Test cricketers Marcus Trescothick and Vikram Solanki. The following winter, he toured Sri Lanka with England Under-19s, playing one youth Test and three youth One Day Internationals.  He claimed three wickets in each innings of his Test appearance, including that of Mahela Jayawardene, and followed this up with four wickets in the ODI series, finishing the tournament with a bowling average of 14.16 from his Test and 16.50 from the ODI series."]}, {"page": "Walter Lawrence Trophy", "response": ["! scope=\"row\"| Vikram Solanki"]}, {"page": "Daryl Mitchell (English cricketer)", "response": ["Daryl Keith Henry Mitchell (born 25 November 1983) is an English former first-class cricketer. Primarily a right-handed batsman who often opened the innings, Mitchell also bowled right-arm medium pace. He played for Worcestershire. He was appointed vice-captain for the 2010 season, and made captain when Vikram Solanki resigned in mid-August.", "Mitchell was appointed vice-captain to Vikram Solanki for the start of the season, replacing the departed Gareth Batty. He struck a rich vein of form that season, scoring four centuries and 1,000 runs by mid-August. Three of his centuries came in consecutive innings, two against Gloucestershire at Cheltenham, where he led Worcestershire to an improbable victory having been 202 behind on first innings, and another, a fine 165, against Glamorgan. Following defeat in this last match, Solanki resigned as captain, and Mitchell was immediately appointed his successor."]}, {"page": "Steven Davies", "response": ["After his first call up to the England A squad, Davies scored 192, to date his highest first-class score, against Gloucestershire in June 2006, sharing a partnership worth 345 runs with Vikram Solanki (who scored 222), and also taking five first-innings catches."]}, {"page": "Liam Plunkett", "response": ["Plunkett was called up for the England One Day International and Test squads to tour Pakistan in November & December 2005 after an injury to Simon Jones. He made his Test debut in the third Test of that series in Lahore taking figures of 2–125 in the innings defeat. Plunkett came on as a Super Sub in his first ODI on 10 December 2005 after Kevin Pietersen went off with a back injury. Plunkett finished with England's best bowling figures, taking 3 wickets for 51 runs, and he was also involved in the run out of Shoaib Akhtar. They were three of the last six wickets, which fell for 23 as England went on to win the match by 42 runs. Two days later, when Plunkett entered the crease, England's score was a disappointing 130 for 8 in the second ODI. He added 56 runs to the total in a record ninth-wicket 100 run partnership with Vikram Solanki before chipping a return catch to Shoaib Akhtar. England needed to keep the Pakistani run rate below five an over, however, after setting a target of 231, but Plunkett's seven overs went for 63 – Kamran Akmal taking 39 off the 25 balls Plunkett bowled to him."]}, {"page": "Birmingham and District Premier League", "response": ["* Vikram Solanki Wolverhampton"]}, {"page": "English cricket team in Pakistan in 2005–06", "response": ["Marcus Trescothick (captain) Somerset; James Anderson (Lancashire); Ian Bell (Warwickshire); Ian Blackwell (Somerset); Paul Collingwood (Durham); Andrew Flintoff (Lancashire); Steve Harmison (Durham); Geraint Jones (Kent); Kabir Ali (Worcestershire) Kevin Pietersen (Hampshire); Liam Plunkett (Durham); Matt Prior (Sussex); Vikram Solanki (Worcestershire); Andrew Strauss (Middlesex); Shaun Udal (Hampshire)", "Shoaib returned for two more wickets, and when Paul Collingwood chipped a return catch to Danish Kaneria England were 130/8 with 20 overs still to bat. They had little option but to put on their Super Sub Vikram Solanki, a specialist batsman, for bowler James Anderson - Solanki joined in with Liam Plunkett, who hit a maiden fifty in his second ODI for England, as the two shared a 100-run partnership. However, Plunkett and Steve Harmison were out in successive balls in the penultimate over, and England set a target of 230 on a pitch that had been described as \"flat and perfect for batting\". As it turned out, it wasn't enough - Flintoff, Harmison and Collingwood got a wicket each, but the Pakistani batsmen hit 34 boundaries in total - 138 of 231 runs - with Akmal sharing two 70+ stands, the opening with Salman Butt, and a third-wicket one with Mohammad Yousuf (who hit 28 off 68 balls) to carry Pakistan to 187/3 before he pulled a Harmison short ball to Solanki for 102. By that time, though, Pakistan needed 44 in 13.3 overs, and Inzamam-ul-Haq hit six fours in an unbeaten 31 as Pakistan made it to the target with six overs to spare. (Cricinfo scorecard)"]}, {"page": "English cricket team in India in 2005–06", "response": ["* Vikram Solanki (Tour ODI c) (ODI only)", "Notes: England captain Andrew Flintoff was replaced as captain by Vikram Solanki, as he was at home visiting his newly born baby."]}]}}