{"wiki_id": "http://www.wikidata.org/entity/Q12982983", "itemLabel": "James Ormond", "itemDescription": "English cricketer (born 1977)", "wikipedia_url": "https://en.wikipedia.org/wiki/Jimmy_Ormond", "wikipedia_page": {"main": "James Ormond (born 20 August 1977, in Coventry, England) is a former English cricketer. He is a right-handed batsman and a right-arm medium-fast bowler although he has also bowled off-spin in his second and final Test match against India in Mohali.\nJames grew up playing club cricket at Corley CC and established himself as a hard hitting fast bowling all rounder creating batting as well as bowling records.  He also played a few games for rivals Fillongley CC and memorably felled Fillongley stalwart Geoff Myton, who was innocently standing at second slip.\nOrmond made his first-class debut in 1995 for Leicestershire County Cricket Club and played a part in the successful championship seasons of 1996 and 1998. Ormond had several consistent seasons at Leicestershire which saw him get rewarded with representation for England at Under-19 level and places on England A tours of Kenya and Sri Lanka.\nOrmond eventually made his full Test debut against Australia in 2001. He was then picked for the tour of India where he played his second and final Test match. His two Test wickets were Ricky Ponting and Rahul Dravid, who both went on to score 12,000 Test runs. He was ostensibly dropped for lack of form, though many suspected that new coach Duncan Fletcher's obsession with fitness actually led to his being culled from the squad.\nAfter he returned to England he moved from Leicestershire to Surrey, where he won another County Championship title in his first season. He remained at the club until the end of the 2009 season when he was released. He is presently cricket coach at Stockport Grammar School.", "link_mentions": [{"page": "Surrey County Cricket Club in 2005", "response": ["*  James Ormond"]}, {"page": "2003 Twenty20 Cup", "response": ["The inaugural Twenty20 match was contested between Hampshire Hawks and Sussex Sharks at The Rose Bowl on 13 June 2003.  The match attracted a sell-out crowd and was screened live on Sky Sports.  Hampshire \"came out of the blocks firing\", according to Cricinfo's Vic Isaacs, scoring 66 runs in the opening 7 overs.  A steady fall of wickets thereafter resulted in the Hawks scoring 153 all out.  Hampshire's Wasim Akram and Alan Mullally then bowled economically, and despite a half-century by Sussex's Tim Ambrose, Hampshire won by 5 runs.  In the division's other opening-night match, Surrey Lions’ James Ormond took the first five-wicket haul in the Twenty20 Cup to help restrict Middlesex Crusaders to 155, which Surrey then passed with four balls remaining to secure the win."]}, {"page": "English cricket team in India in 2001–02", "response": ["* James Ormond", "A 16-man England squad for the India and New Zealand Test series was announced in late August 2001. Two uncapped players, Essex wicket-keeper James Foster and Yorkshire off-spinner Richard Dawson were included for the first time, while Lancashire wicket-keeper Warren Hegg was recalled to the squad. On 17 October, England's 16-man squad for the ODI series was announced. It included the same side that toured Zimbabwe earlier that month, with additions of Andrew Caddick, Darren Gough, Ashley Giles, Michael Vaughan and Craig White. Paul Grayson, James Kirtley, Mark Ramprakash, Ryan Sidebottom and Chris Silverwood were omitted. Amidst questions regarding security of the players, Andrew Caddick and James Foster decided not to tour India and declared themselves unavailable on 30 October. They were replaced by Somerset pace-bowler Richard Johnson and Gloucestershire off-spinner Martyn Ball. Giles, White and James Ormond who were nursing injuries were declared fit on 7 November. Graham Thorpe left for England just before the Second Test due to \"personal\" reasons and was replaced by Michael Vaughan. On 3 January 2002, The England squad was announced again for the ODI series. The core of the team that played the Test series was retained. Additionally, Caddick and Thorpe, who made themselves available, were added to the squad, while White who sustained an injury was excluded."]}, {"page": "James Ormond", "response": ["James Ormond or Ormonde may refer to:", "* James Ormond (administrator) (died 1497), Lord High Treasurer of Ireland, 1492–1494", "* James Ormond (alpine skier) (born 1973), British alpine skier", "* James Ormonde (Australian politician) (1903–1970), Australian politician"]}]}}