{"wiki_id": "http://www.wikidata.org/entity/Q12988180", "itemLabel": "Mike Edwards", "itemDescription": "cricketer (born 1940)", "wikipedia_url": "https://en.wikipedia.org/wiki/Mike_Edwards_(cricketer)", "wikipedia_page": {"main": "Michael John Edwards (born 1 March 1940) is a former English cricketer who played for Cambridge University from 1960 to 1962 and for Surrey from 1961 to 1974. He was a batsman who had only limited success until he became an opener in 1966. He was also a fine short-leg fielder.\n\n", "link_mentions": [{"page": "Michael Edwards", "response": ["Michael or Mike Edwards may refer to:", "*Mike Edwards (basketball) (born early 1950s), American basketball player", "*Mike Edwards (cricketer) (born 1940), former cricketer", "*Mike Edwards (cornerback) (born 1991), American football player", "*Mike Edwards (safety) (born 1996), American football player", "*Mike Edwards (footballer, born 1974), Tranmere Rovers footballer", "*Mike Edwards (footballer, born 1980), Notts County F.C. footballer", "*Mike Edwards (high jumper) (born 1990), British-Nigerian athlete and winner at the 2018 British Indoor Athletics Championships", "*Mike Edwards (linebacker) (born 1957), American football player", "*Mike Edwards (motorcyclist) (born 1962), British motorcycle racer", "*Mike Edwards (pole vaulter) (born 1968), British pole vaulter", "*Mike Edwards (rugby league) (born 1974), rugby league footballer", "*Mike Edwards (second baseman) (born 1952), Major League Baseball second baseman, 1977–1980", "*Mike Edwards (third baseman) (born 1976), Major League Baseball infielder/outfielder, 2003–2006", "*Mike Edwards (musician) (1948–2010), cellist of the band Electric Light Orchestra", "*Mike Edwards (journalist), Scottish journalist for Scotland Today"]}, {"page": "Surrey County Cricket Club", "response": ["*  Mike Edwards"]}, {"page": "Alleyn's School", "response": ["* Mike Edwards (cricketer)"]}, {"page": "John Edrich", "response": ["The following summer, Surrey won the County Championship for the first time since 1958, with Edrich's batting being an important factor in the county's success. By now, Stewart had dropped down the order to number three, and Edrich had formed another successful opening partnership with Mike Edwards. Stewart retired after the 1972 season, and from 1973 to 1977 Edrich succeeded him as Surrey's captain."]}, {"page": "Professional Cricketers' Association", "response": ["Mike Edwards was appointed the first treasurer in 1968, and was elected chairman in 1970. He subsequently resigned the post following a majority decision by the membership to accept a donation from the Transvaal in apartheid-era South Africa."]}, {"page": "Tulse Hill School", "response": ["*Mike Edwards - Head of Economics (ex-deputy head and head of sixth form) – played cricket for Surrey between 1961 and 1974. Mike played twice for England in the West Indies. On his retirement in 1990, he went on to be the main cricketing coach for Surrey based at the Oval. He mentored several future England players and was interviewed by The Guardian newspaper in a valedictory sports profile before he finally retired from his Surrey post.", "**Tom Wilson and Mike Edwards - jointly"]}, {"page": "Michael Edwards (cricketer)", "response": ["#REDIRECT Mike Edwards (cricketer)"]}, {"page": "List of Surrey County Cricket Club players", "response": ["* Mike Edwards (1961–1974) : M. J. Edwards"]}, {"page": "Commonwealth XI cricket team in Pakistan in 1967–68", "response": ["Captained by Richie Benaud, the Commonwealth team consisted of Roger Prideaux, Mushtaq Mohammad, Tony Lewis, Don Shepherd, Peter Walker, John Murray, David Allen, Mike Edwards, Brian Luckhurst, John Hampshire, Peter Marner, Ken Shuttleworth and Keith Boyce. Benaud was not available for the early matches and Prideaux, as vice-captain, and Lewis deputised for him."]}, {"page": "List of Marylebone Cricket Club players (1946–1977)", "response": ["* Mike Edwards (1973) : M. J. Edwards (Surrey)"]}, {"page": "Robert Fleming (cricketer)", "response": ["Fleming was born at Woking in July 1953 and later studied at Jesus College, Cambridge. While studying at Cambridge, he played first-class cricket for Cambridge University Cricket Club in 1974, making nine appearances. Playing as an off break bowler in the Cambridge side, he took 7 wickets at an average of 74.57, with best figures of 3 for 91. As a tailend batsman, he scored 60 runs with a highest score of 13 not out. He also made two appearances in List A one-day cricket for Cambridge in the 1974 Benson & Hedges Cup against Surrey at The Oval and Sussex at Hove. He took one wicket in these matches, that of Surrey's Mike Edwards."]}]}}