{"wiki_id": "http://www.wikidata.org/entity/Q1292041", "itemLabel": "Edward Denison Ross", "itemDescription": "British Orientalist and linguist (1871-1940)", "wikipedia_url": "https://en.wikipedia.org/wiki/Edward_Denison_Ross", "wikipedia_page": {"main": "Sir Edward Denison Ross (6 June 1871 – 20 September 1940) was an orientalist and linguist, specializing in languages of the Far East. He was the first director of the University of London's School of Oriental Studies (now SOAS, University of London) from 1916 to 1937.Ross read in 49 languages, and spoke in 30. He was director of the British Information Bureau for the Near East. Sometime after 1877, Ross wrote an Introduction a reprint of George Sale's translation. Along with Eileen Power, he wrote and edited a 26-volume series published by George Routledge & Sons, The Broadway Travellers. The series included the diary of the 17th-century naval chaplain Henry Teonge. Ross joined the staff of the British Museum in 1914, appointed to catalogue the collections of Sir Aurel Stein. He was an original trustee of the E. J. W. Gibb Memorial Series. In 1934 Edward Denison Ross attended Ferdowsi Millenary Celebration in Tehran.", "link_mentions": [{"page": "Omar Khayyam", "response": ["The earliest allusion to Omar Khayyam's poetry is from the historian Imad ad-Din al-Isfahani, a younger contemporary of Khayyam, who explicitly identifies him as both a poet and a scientist (, 1174).Ali Dashti (translated by L. P. Elwell-Sutton), In Search of Omar Khayyam, Routledge Library Editions: Iran (2012) One of the earliest specimens of Omar Khayyam's Rubiyat is from Fakhr al-Din Razi. In his work  (ca. 1160), he quotes one of his poems (corresponding to quatrain LXII of FitzGerald's first edition). Daya in his writings (, ca. 1230) quotes two quatrains, one of which is the same as the one already reported by Razi. An additional quatrain is quoted by the historian Juvayni (, ca. 1226–1283). In 1340 Jajarmi includes thirteen quatrains of Khayyam in his work containing an anthology of the works of famous Persian poets (), two of which have hitherto been known from the older sources.Edward Denison Ross, Omar Khayyam, Bulletin of the School Of Oriental Studies London Institution (1927) A comparatively late manuscript is the Bodleian MS. Ouseley 140, written in Shiraz in 1460, which contains 158 quatrains on 47 folia. The manuscript belonged to William Ouseley (1767–1842) and was purchased by the Bodleian Library in 1844.There are occasional quotes of verses attributed to Omar in texts attributed to authors of the 13th and 14th centuries, but these are of doubtful authenticity, so that skeptical scholars point out that the entire tradition may be pseudepigraphic."]}, {"page": "SOAS University of London", "response": ["Since its foundation, the school has had nine directors. The inaugural director was the celebrated linguist Sir Edward Denison Ross. Under the stewardship of Sir Cyril Philips, the school saw considerable growth and modernisation. Under Colin Bundy in the 2000s, the school became one of the top ranked universities both domestically and internationally. In January 2021 Professor Adam Habib became director of SOAS in place of Baroness Valerie Amos, who had taken up the position of Master at University College, Oxford.", "| 1916 || Sir Edward Denison Ross"]}, {"page": "Chagatai Khanate", "response": ["* Elias, N. Commentary. The Tarikh-i-Rashidi (A History of the Moghuls of Central Asia). By Mirza Muhammad Haidar. Translated by Edward Denison Ross, edited by N. Elias. London, 1895.", "* Mirza Muhammad Haidar. The Tarikh-i-Rashidi (A History of the Moghuls of Central Asia). Translated by Edward Denison Ross, edited by N.Elias. London, 1895."]}, {"page": "Zoilos II", "response": ["and the might of the Orient, with him, and furthest Bactria).Francis Henry Skrine and Edward Denison Ross, The Heart of Asia: A History of Russian Turkestan and the Central Asian Khanates from the Earliest Times, by London, Methuen, 1899, p.19; E. Drouin, “Bactriane”, La Grande Encyclopédie: Inventaire Raisonné des Sciences, des Lettres et des Arts, Paris, Lamirault, 1885-1902, Tome 4, pp.1115-1122, nb 1118."]}, {"page": "Tughlugh Timur", "response": ["Mirza Muhammad Haidar. The Tarikh-i-Rashidi: A History of the Moghuls of Central Asia.Trans. Edward Denison Ross", "*Mirza Muhammad Haidar. The Tarikh-i-Rashidi: A History of the Moghuls of Central Asia.Trans. Edward Denison Ross. "]}, {"page": "Edward Ross", "response": ["*Edward Denison Ross (1871–1940), English Orientalist and linguist"]}, {"page": "Ann Lambton", "response": ["Lambton was born in 1912 in Newmarket, Suffolk. She was the elder daughter of the Hon. George Lambton, younger son of the 2nd Earl of Durham) and his wife Cicely Margaret Horner (1882–1972). Through the influence of Edward Denison Ross, a family friend, she studied Persian at SOAS under Ross and Hamilton Gibb, and others (Arthur Tritton, Vladimir Minorsky, and Hassan Taqizadeh)."]}, {"page": "Ikbal Ali Shah", "response": ["In his introduction to the 1939 edition of Ikbal Ali Shah's book, Alone In Arabian Nights, Sir Edward Denison Ross stated that while the Sirdar, well known to him for many years, was \"tremendously modest about his achievements\", he considered him \"the greatest contemporary writer and traveller of the East\". He referred to the book as \"fascinating\" and \"extraordinary\", commenting on its \"erudition, scope and range\" and declaring that the Sirdar wrote \"the most excellently idiomatic English\".Shah, Sirdar Ikbal Ali (1992). Alone in Arabian Nights. Octagon Press Ltd, London. p. vii. . Originally published 1933; revised 1969."]}, {"page": "Yunus Khan", "response": ["|+ Genealogy of Younas Khan/Haji Ali according to Mirza Muhammad Haidar DughlatThe Tarikh-i-Rashidi: a history of the Moghuls of central Asia by Mirza Muhammad Haidar Dughlat; Editor: N. Elias,Translated by Sir Edward Denison Ross,Publisher:S. Low, Marston and co., 1895", "*Mirza Muhammad Haidar. The Tarih-i-Rashidi ( A History of the Moghuls of Central Asia). Translated by Edward Denison Ross, edited by N.Elias. London, 1895"]}, {"page": "Eileen Power", "response": ["From 1926, she and Edward Denison Ross edited The Broadway Travellers, a book series of 26 works which was published by George Routledge & Sons.Collecting The Broadway Travellers Series, thebooksinmylife.com. Retrieved 30 April 2020."]}, {"page": "Moghulistan", "response": ["*Mirza Muhammad Haidar. The Tarikh-i-Rashidi: A History of the Moghuls of Central Asia. Trans. Edward Denison Ross. ", "* Elias, N. Commentary. The Tarikh-i-Rashidi (A History of the Moghuls of Central Asia). By Mirza Muhammad Haidar. Translated by Edward Denison Ross, edited by N. Elias. London, 1895."]}, {"page": "Edward denison ross", "response": ["#REDIRECT Edward Denison Ross "]}, {"page": "Mansur Khan (Moghul Khan)", "response": ["Mansur Khan (1482/3–1543) (; ), was the last khan of a united Moghulistan from 1503 until his death. From his father Ahmad Alaq, the previous khan, he inherited the eastern parts of Moghulistan proper (Yili area), the Muslim oasis cities of Yanqi, Baicheng, and Kuche, and the Buddhist \"Uighur\" holdout of Turfan.\"Chapter LIV. Transactions of Mansur Khan\" in Mirza Muhammad Haidar. The Tarikh-i-Rashidi: A History of the Moghuls of Central Asia.Trans. Edward Denison Ross.  He also led a jihad of conquest against Oirat Mongol and Chinese territories to the east, including Hami and Dunhuang, and attempted to convert the Kyrgyz to Islam."]}, {"page": "E. Denison Ross", "response": ["#REDIRECT Edward Denison Ross"]}, {"page": "Denison Ross", "response": ["#REDIRECT Edward Denison Ross"]}, {"page": "Mirza Muhammad Haidar Dughlat", "response": ["His historical work Tarikh-i-Rashidi (تاریخ رشیدی) ( History of Rashid ) is a personal memoir combined with a Central Asian history written in Persian. Mirza Muhammad Haidar dedicated this extensive work, written in Kashmir in  two volumes, to the contemporary ruler of Kashgaria, viz., Abdurashid Khan, son of Sultan Said Khan. It was translated into English in 1895 by Ney Elias and Edward Denison Ross. Among other events, the Tarikh-i-Rashidi describes the founding of the Kazakh Khanate in 1465 and Muhammad Haidar Dughlat's personal encounter with one of the early Kazakh rulers, namely Kasym Khan."]}, {"page": "Sir Denison Ross", "response": ["#REDIRECT Edward Denison Ross"]}, {"page": "Saniz Mirza", "response": ["*Mirza Muhammad Haidar. The Tarikh-i-Rashidi (A History of the Moghuls of Central Asia). Translated by Edward Denison Ross, edited by N.Elias. London, 1895"]}, {"page": "Jahangir Mirza", "response": ["*Mirza Muhammad Haidar. The Tarikh-i-Rashidi (A History of the Moghuls of Central Asia). Translated by Edward Denison Ross, edited by N.Elias. London, 1895"]}, {"page": "Muhammad Haidar Mirza (I) Dughlat", "response": ["*Mirza Muhammad Haidar. The Tarikh-i-Rashidi (A History of the Moghuls of Central Asia). Translated by Edward Denison Ross, edited by N.Elias. London, 1895"]}, {"page": "George de Roerich", "response": ["By the time Roerich was 15, he had already begun studying Egyptology with Boris Turayev and Mongolian language and history with Andrei Dmitryevich Rudnyev. He was a student with broad interests and many talents. After finishing his studies at Karl May School, he entered the Indian and Iranian department of Oriental Languages at London University in 1918. Under Indologist Professor Edward Denison Ross he studied Sanskrit and Pali. He was recognized for his language abilities and was introduced as the best Sanskrit student to the Secretary of State for Indian Affairs who visited the university.http://en.icr.su/family/gnr/"]}, {"page": "James Forlong", "response": ["* Vol.10 - Ta'rikh-i-Jahan-gushay of Juwayni (vol.3), by Wahid-ul-Mulk, intro by Edward Denison Ross (1931)"]}, {"page": "Kahn Lectures", "response": ["The next two series of lectures in the series were held in January 1931 by Herbert Joseph Spinden, the expert in pre-Columbian American archaeology who had already been considered twice before, and in the fall of 1931 by Edward Denison Ross, director of (what was still known as) the School of Oriental Studies of the University of London, who talked about Persian art. Neither of these were published. Ross's lectures were described by Baldwin Smith as \"rather flat, as the Englishman thought he could chat along pleasantly on most anything to an American audience.\"Levine, p. xxii, citing a letter from Smith to F. L. Wright dated 4 January 1931 [which should be 1932, according to Levine] in the archives of The Frank Lloyd Wright Foundation For the fifth round of lectures, the Department invited the French architectural historian Marcel Aubert, but he had to cancel after a scheduling conflict appeared with his lectures at Yale. Morey suggested to Kahn that the remaining funds be given to a student in need.Levine, p. xxii, citing a letter from Morey to Kahn of 21 April 1932, Princeton University Library Because of the financial losses Kahn had sustained during the preceding years, he could not renew his gift.Levine, p. xxii. Otto Kahn died two years later.", "*Edward Denison Ross on Persian art, Fall 1931"]}, {"page": "Henry Teonge", "response": ["The diary passed after Teonge's death to a certain John Holyoake, probably the man of that name who was Mayor of Warwick in 1699–1700 and whose uncle had property in Spernall. It was not published until 1825.The Diary of H. Teonge, Chaplain on board his Majesty's Ships Assistance, Bristol, and Royal Oak Anno 1675 to 1679... With biographical and historical notes. London: Charles Knight, 1825. The manuscript then disappeared, which prompted allegations that it was a forgery, but it re-emerged at a Sotheby's auction in London in 1918. The 1927 scholarly edition edited by G. E. Manwaring and published in the Broadway Travellers Series under the eye of series editors Edward Denison Ross and Eileen Power has an informative introduction and notes.G. E. Manwaring, ed., The Diary of Henry Teonge, Chaplain on Board H. M. Ships Assistance, Bristol and Royal Oak 1675-1679, London: George Routledge & Sons, 1927. It was reprinted in 2005.."]}, {"page": "Edward Heron-Allen", "response": ["He made friends with Mirza Malkom Khan (Nāẓem-al-Molk), the famous Persian Minister in London  and in 1896 he studied colloquial Persian with Mirza ʿAlinaqi of the Persian Legation. In 1897 he began studying with Edward Denison Ross, Professor of Persian at University College, London."]}, {"page": "Roerichism", "response": ["In August 1902 their eldest son, George, was born in Okulovka, Novgorod Oblast. After finishing his studies at Karl May School, he entered the Indian and Iranian department of Oriental Languages at London University in 1918. Under the Indologist Edward Denison Ross he studied Sanskrit and Pali. Later he became a world-renowned scientist, orientalist, and guru. George is known for his contributions to Tibetan dialectology, his monumental translation of the Blue Annals, and his 11-volume Tibetan-Russian-English dictionary with Sanskrit parallels. After spending almost thirty years in India, George returned in 1957 to Russia. His return and acquisition of Soviet citizenship was courageous as the USSR's opinion on his family was rather distorted. Because of his effort, bans were lifted on everything associated with Roerichism and the legacy of research left by the family was preserved. The first of Nicholas Roerich's exhibitions was organized in Moscow in 1958, then spread to Leningrad, Riga, Kiev, Tbilisi, and other cities. He was able to dispel myths about the family's philosophy of Agni Yoga or Living Ethics in the USSR. George died on 21 May 1960, and his ashes were placed in Moscow, at the Novodevichy Cemetery. Svetoslav Roerich is the author of the memorial to this outstanding Russian scientists."]}, {"page": "1918 Birthday Honours", "response": ["*Edward Denison Ross  Principal of the School of Oriental Studies"]}, {"page": "Baháʼí studies", "response": ["* 1901 Has Edward Denison Ross writing an article for The North American Review called \"Babism\".\"Babism\", by E. Denison Ross,The North American Review, Vol. 172, No. 533, April 1901, pp. 606–622 It appeared again in 1912 in Great Religions of the World in 1912 with a preface about ʻAbdu'l-Bahá's travels.Babism, by E. Denison Ross, Great Religions of the World, New York: Harper & Brothers, Publishers, 1901/1912, pp. 189-217"]}, {"page": "Gibb Memorial Series", "response": ["Edward Denison Ross"]}, {"page": "Bulletin of the School of Oriental & African Studies", "response": ["The Bulletin of the School of Oriental and African Studies, founded in 1917 (one year after the foundation of the School) as Bulletin of the School of Oriental Studies, is an interdisciplinary journal of Asian and African studies, published by Cambridge University Press on behalf of  School of Oriental and African Studies. The first editor was also the first director of the School, Edward Denison Ross. The name changed in 1940 as a consequence of the change in the School's name (changed 1938) to incorporate African Studies. Later editors have included Dennis Twitchett (1964–68)  and Robert Mayer and its current editors are Ayman Shihadeh and Nathan W. Hill."]}, {"page": "Sir Edward Denison Ross", "response": ["#redirectEdward Denison Ross"]}]}}