{"wiki_id": "http://www.wikidata.org/entity/Q13002", "itemLabel": "Paul Gascoigne", "itemDescription": "English association football player and manager (born 1967)", "wikipedia_url": "https://en.wikipedia.org/wiki/Paul_Gascoigne", "wikipedia_page": {"main": "Paul John Gascoigne (, born 27 May 1967), nicknamed Gazza,  is an English former professional footballer who played as an attacking midfielder. He is described by the National Football Museum as \"widely recognised as the most naturally talented English footballer of his generation\".Born and raised in Gateshead, Gascoigne signed schoolboy terms with Newcastle United, before turning professional with the club in 1985. Three years later, he was sold to Tottenham Hotspur for £2.2 million. He won the FA Cup with Spurs in 1991, before being sold to Italian club Lazio for £5.5 million. In 1995, he was transferred to Rangers for £4.3 million and helped the club to two league titles, a Scottish Cup and a Scottish League Cup. He returned to England in a £3.4 million move to Middlesbrough in 1998. He made his debut in the Premier League in the 1998–99 season, having already featured in the 1998 Football League Cup Final. He switched to Everton in 2000, and later had spells with Burnley, Gansu Tianma and Boston United.\nGascoigne represented the England national team from 1988 to 1998, in which he was capped 57 times and scored ten goals. He was part of the England team that reached fourth place in the 1990 FIFA World Cup, where he famously cried after receiving a yellow card in the semi-final with West Germany, which meant he would have been suspended for the final had England won the game. He also helped the team to the semi-finals of Euro 96, which included scoring a goal against Scotland, described in 2013 as \"one of the most iconic goals in the game's recent history\". He has been involved in a number of high-profile goal celebrations at both club and international level, including the \"dentist's chair\" celebration from Euro 96, and mimicking playing the flute with Rangers in 1998, a reference to the Protestant Orange Order.In the later part of his career, and especially following retirement, Gascoigne's life became dominated by severe mental and emotional problems, particularly alcoholism. He has been jailed or sectioned on numerous occasions and his struggles receive regular coverage in the British press. He has frequently attempted to live without alcohol, though rehabilitation programmes have provided only temporary relief. His personal issues ended his coaching career, and he has not worked in football since being dismissed as the manager of Kettering Town in 2005.", "link_mentions": [{"page": "The Beano", "response": ["Notable famous members of the old Dennis the Menace/Beano Club include Auberon Waugh, Mike Read, and Mark Hamill, as well as honorary members Paul Gascoigne, and Princes William and Harry. Chris Tarrant cited Dennis as his role model when he was a child, and Paul Rudd revealed Roger the Dodger was his favourite strip. Stella McCartney created tribute fashion to both The Beano and The Dandy, explaining they were \"a huge part of my childhood\" and wanted to celebrate \"the next generation of Beano fans with a sustainable and practical range for kids who still share that ‘Beano’ spirit of these iconic characters\". In music pop culture, the album Blues Breakers with Eric Clapton is nicknamed \"The Beano Album\" because Eric Clapton is holding issue 1242 on its cover."]}, {"page": "Serie A", "response": ["During the 1980s and 1990s, most Serie A clubs signed a large number of players from foreign nations (both EU and non-EU members). Notable foreign players to play in Serie A during this era included Irish international Liam Brady, England internationals Paul Gascoigne and David Platt, France's Michel Platini and Laurent Blanc, Lothar Matthäus and Jürgen Klinsmann from Germany, Dutchmen Ruud Gullit and Dennis Bergkamp, and Argentina's Diego Maradona."]}, {"page": "May 27", "response": ["*1967 – Paul Gascoigne, English international footballer, coach, and manager"]}, {"page": "S.S. Lazio", "response": ["The arrival of Sergio Cragnotti in 1992 changed the club's history due to his long-term investments in new players to make the team a Scudetto competitor. A notable early transfer during his tenure was the capture of English midfielder Paul Gascoigne from Tottenham Hotspur for £5.5 million. Gascoigne's transfer to Lazio is credited with the increase of interest in Serie A in the United Kingdom during the 1990s. Cragnotti repeatedly broke transfer records in pursuit of players who were considered major stars – Juan Sebastián Verón for £18 million, Christian Vieri for £19 million and breaking the world transfer record, albeit only for a matter of weeks, to sign Hernán Crespo from Parma for £35 million."]}, {"page": "1967", "response": ["** Paul Gascoigne, English footballer"]}, {"page": "Nickname", "response": ["* Loose ties to a person's name with an attached suffix: Gazza for English footballer Paul Gascoigne (though used more widely in Australia for Gary) and similar \"zza\" forms (Hezza, Prezza, etc.) for other prominent personalities whose activities are frequently reported in the British press. (See also Oxford \"-er\" for a similar but wider phenomenon.)"]}, {"page": "Newcastle United F.C.", "response": ["United dropped once again to the Second Division at the end of the 1977–78 season. Dinnis was replaced by Bill McGarry, and then he was replaced by Arthur Cox. Cox steered Newcastle back to the First Division at the end of the 1983–84 season, with players such as Peter Beardsley, Chris Waddle and ex-England captain Kevin Keegan the fulcrum of the team. However, with a lack of funds, Cox left for Derby County and Keegan retired. With managers such as Jack Charlton and then Willie McFaul, Newcastle remained in the top-flight, until key players such as Waddle, Beardsley and Paul Gascoigne were sold, and the team was relegated once more in 1989. McFaul left the managerial post, and was replaced by Jim Smith. Smith left at the start of the 1991–92 season and the board appointed Osvaldo Ardiles his replacement.", "|1988|| Paul Gascoigne"]}, {"page": "Northumberland", "response": ["Two of Jackie Milburn’s nephews from Ashington, Bobby Charlton and Jackie Charlton are perhaps the two most significant players for England. Bobby joined Manchester United and Jackie Leeds United both contributing much to the success and history of their respective clubs. They both became permanent fixtures in Alf Ramsey's 1966 England World Cup winning team. Malcolm Macdonald was a successful Newcastle player of the 1970s. Great national players who played at Northumberland clubs in the 1980s and 1990s include Peter Beardsley, Paul Gascoigne, Chris Waddle and Alan Shearer. Shearer remains the highest scoring player in Premier League history with 260 goals in 441 appearances."]}, {"page": "Tottenham Hotspur F.C.", "response": ["The 1980s was a period of change that began with a new phase of redevelopment at White Hart Lane, as well as a change of directors. Irving Scholar took over the club and moved it in a more commercial direction, the beginning of the transformation of English football clubs into commercial enterprises. Debt at the club would again lead to a change in the boardroom, and Terry Venables teamed up with businessman Alan Sugar in June 1991 to take control of Tottenham Hotspur plc. Venables, who had become manager in 1987, signed players such as Paul Gascoigne and Gary Lineker. Under Venables, Spurs won the 1990–91 FA Cup, making them the first club to win eight FA Cups.", "*  Paul Gascoigne", "* 1990  Paul Gascoigne"]}, {"page": "Rangers F.C.", "response": ["*  Paul Gascoigne"]}, {"page": "Newcastle upon Tyne", "response": ["Lindisfarne are a folk-rock group with a strong Tyneside connection. Their most famous song, \"Fog on the Tyne\" (1971), was covered by Geordie ex-footballer Paul Gascoigne in 1990. Venom, reckoned by many to be the originators of black metal and extremely influential to the extreme metal scene as a whole, formed in Newcastle in 1979. Folk metal band Skyclad, often regarded as the first folk metal band, also formed in Newcastle after the break-up of Martin Walkyier thrash metal band, Sabbat. Andy Taylor, former lead guitarist of Duran Duran was born here in 1961. Brian Johnson was a member of local rock band Geordie before becoming the lead vocalist for Australian band AC/DC, with whom he'd release Back in Black, the 2nd best-selling studio album of all time, and the 4th biggest seller in the USA."]}, {"page": "Everton F.C.", "response": ["*  Paul Gascoigne (2002 inductee)", "*  Paul Gascoigne"]}, {"page": "1994 FIFA World Cup", "response": ["* In disciplinary matters, for the first time yellow cards accumulated in the group stage were wiped clean after its completion, and players started with a clean slate at the start of the knockout stage. Previously, players were suspended for one game if accumulating two yellow cards throughout the tournament. Now, players were suspended for one game after accumulating two yellow cards in the group stage, or two yellow cards in the knockout stage. This was in response to the situation in 1990, where players such as Claudio Caniggia and Paul Gascoigne were suspended for the later games."]}, {"page": "Chris Waddle", "response": ["Waddle was in England's squad at the 1986 and 1990 FIFA World Cup as well as UEFA Euro 1988. Although England were eliminated at the group stages of Euro 88 after losing all three games, they did reach the quarter-finals of the 1986 World Cup and the semi-finals in 1990, where Waddle missed the decisive penalty in the latter as he put it inches over the bar in the shootout defeat to West Germany. He says he only took the fifth penalty because Paul Gascoigne, who had been suspended from playing in the next game if England progressed, was too upset to take it. He subsequently blamed a chance meeting with Uri Geller and Michael Jackson prior to the tournament for missing his penalty.\"Rewind radio: Euro 2012; In Our Time\". The Guardian. 17 June 2012. Waddle's performances in the 1990 World Cup were described as \"superb\" by Rob Bagchi, writing for The Guardian in 2010."]}, {"page": "1990 FIFA World Cup", "response": ["* Paul Gascoigne"]}, {"page": "Munich air disaster", "response": ["In the midst of the preparations, former United player Eric Cantona, who had retired from football to pursue a career in film in 1997, expressed an interest in returning to Manchester United for a farewell match. Edwards took the opportunity to combine the two events into one.Morrin, pp. 203–204. Due to Cantona's acting career, his schedule meant that he would not be available in February 1998 and the match was moved to 18 August, with the opposition to be a European XI chosen by Cantona; the side selected by Cantona featured the likes of French internationals Laurent Blanc, Pascal Vahirua and Jean-Pierre Papin, England's Paul Gascoigne, former Manchester United players Bryan Robson and Mark Hughes, and Cantona's brother Joël. Cantona himself played the first half of the match for the European XI, before switching sides at half-time. Manchester United ultimately won the match 8–4, with goals from Ryan Giggs, Paul Scholes, Jordi Cruyff, Phil Neville, Nicky Butt, Alex Notman (2) and Cantona, while Papin, Blanc, Martin Dahlin and United player Mark Wilson were the scorers for the European XI."]}, {"page": "Iron Maiden", "response": ["Over the course of several decades, the band's cover illustrations and iconography have appeared in various TV productions, music videos by artists representing popular music in the broad sense, and in press publications. The distinctive cover illustrations, especially the group's mascot and logo, have become part of celebrity clothing (especially t-shirts) worn privately, as well as at prestigious industry events, including fashion shows. Among hundreds of others can be found: Lady Gaga, Paris Hilton, Rihanna, Madonna, Rowan Atkinson, Taylor Swift, Taylor Hill, Selena Gomez, David Beckham, David Hasselhoff, Diego Maradona, Kelly Rowland, Taryn Manning, Olivia Munn, Travis Scott, Cameron Diaz, Dolph Ziggler, Justin Bieber, Hilary Duff, Kirsten Dunst, Nicole Kidman, Drew Barrymore, Charlize Theron, Lindsay Lohan, Miley Cyrus, Holly Madison, David Banks, Jaden Smith, Michael Fassbender, Sam Worthington, Taylor Momsen, Kat Von D, Keith Urban, Amy Poehler, Paul Gascoigne, Marc Overmars, Faustino Asprilla, Juicy J, Kourtney Kardashian, DJ Mustard, Odell Beckham Jr, Ann Sydney, Kylie Jenner, Benicio del Toro, Pilar Rubio, Slaven Bilic, Pablo Zabaleta, Anushka Sharma, Terry Butcher, Ian Wright, Patrick Vieira, Paul Mariner, Stuart Pearce, Iggy Azalea, Bjorn Einar Romoren."]}, {"page": "Liam Gallagher", "response": ["After an argument on a flight to Australia in 1998 that apparently involved a scone, Gallagher was banned for life from Cathay Pacific airlines; he responded that he would \"rather walk\". During the band's Australian tour at the time, he was arrested and charged with assault after allegedly headbutting a 19-year-old fan who claimed he was only asking Gallagher for a photo. Criminal charges were later dropped, although a civil case was pursued that led to Gallagher reportedly settling out of court. In 2006, Gallagher allegedly had a drunken brawl with footballer Paul Gascoigne at the Groucho Club in London, which ended with him setting off a fire extinguisher in Gascoigne's face."]}]}}