{"wiki_id": "http://www.wikidata.org/entity/Q1303923", "itemLabel": "Felix Wakefield", "itemDescription": "English colonist of New Zealand", "wikipedia_url": "https://en.wikipedia.org/wiki/Felix_Wakefield", "wikipedia_page": {"main": "Felix Wakefield (30 November 1807 – 23 December 1875) was an English colonist.", "link_mentions": [{"page": "Sumner, New Zealand", "response": ["The Canterbury Association initially administered Sumner, with the valley being surveyed by Edward Jollie in 1849 and he drew up a street plan in November of that year. However, the planned settlement was rejected by Godley and the land was not subdivided. When the first allocation of rural sections was made public in February 1851, rural section No.2 was allocated to Felix Wakefield. This section was bounded in the North by a road along the coast, in the West by the road between Christchurch and Lyttelton, by an accommodation road against the hillside in the East and another accommodation road across the valley in the South. The street names on the 1850 settlement plan were not used and Wakefield subdivided and leased or sold off parts of this rural section in smaller lots to create a settlement he called Wakefield Township.", "*Felix Wakefield (1807–1875), first landowner"]}, {"page": "Arthur Wakefield", "response": ["Arthur Wakefield was born in Essex, a son of Edward Wakefield (1774–1854), a distinguished surveyor and land agent, and Susanna Crash (1767–1816). His grandmother, Priscilla Wakefield (1751–1832), was a popular author for the young, and one of the introducers of savings banks. He was the brother of Catherine Gurney Wakefield (1793-1873), Edward Gibbon Wakefield (1796–1862), Daniel Bell Wakefield (1798–1858), William Hayward Wakefield (1801–1848), John Howard Wakefield (1803–1862), Felix Wakefield (1807–1875), Priscilla Susannah Wakefield (1809–1887), Percy Wakefield (1810–1832), and an unnamed child born in 1813."]}, {"page": "Edward Gibbon Wakefield", "response": ["He was the brother of: Catherine Gurney Wakefield (1793–1873) (who was the mother of Charles Torlesse (1825–1866)); Daniel Bell Wakefield  (1798–1858); Arthur Wakefield (1799–1843); William Hayward Wakefield (1801–1848); John Howard Wakefield (1803–1862); Felix Wakefield (1807–1875); Priscilla Susannah Wakefield (1809–1887); Percy Wakefield (1810–1832); and an unnamed child born in 1813.", "Without notice, his youngest brother Felix Wakefield, who had been in Tasmania since the early 1830s, reappeared in England accompanied by eight of his children, having abandoned his wife and youngest child in Australia. Felix had no money and no prospects and was unable to provide for his family. Wakefield found him somewhere to live and farmed out the children among relatives, but it was another year before his health was strong enough to take over the role of surrogate father, Felix being apparently unable to do anything for his family."]}, {"page": "William Wakefield", "response": ["He was the brother of: Catherine Gurney Wakefield (1793–1873), the mother of Charles Torlesse (1825–1866); Edward Gibbon Wakefield (1796–1862); Daniel Wakefield (1798–1858); Arthur Wakefield (1799–1843); John Howard Wakefield (1803–1862); Felix Wakefield (1807–1875); Priscilla Susannah Wakefield (1809–1887); Percy Wakefield (1810–1832); and an unnamed child born in 1813."]}, {"page": "Daniel Wakefield (judge)", "response": ["He was the brother of Catherine Gurney Wakefield (1793–1873), the mother of Charles Torlesse (1825–1866); Edward Gibbon Wakefield (1796–1862); Arthur Wakefield (1799–1843); William Hayward Wakefield (1801–1848); John Howard Wakefield (1803–1862); Felix Wakefield (1807–1875); Priscilla Susannah Wakefield (1809–1887); Percy Wakefield (1810–1832); and an unnamed child born in 1813."]}, {"page": "List of political families", "response": ["**Edward Wakefield (1845–1924) – nephew, son of brother Felix Wakefield, Member of Parliament"]}, {"page": "Grand Crimean Central Railway", "response": ["During this time the pioneer photographer Roger Fenton had arrived and he recorded the railway and its progress. On April 2, the railway was used to carry the sick and injured from the plateau down to Balaclava.  It has been argued that this was the first hospital train ever to run. Also during this time, Colonel William McMurdo had been appointed to be in charge of a new department of the army, the Land Transport Corps. He arrived in the Crimea in early March, and one of his duties was to take over the operation of the railway from the contractors. Felix Wakefield was given the temporary rank of lieutenant-colonel and he arrived to take command of the Army Works Corps employed on the project. It was finally handed over by Peto, Brassey and Betts in early July."]}, {"page": "Edward Wakefield (New Zealand politician)", "response": ["Felix Edward Wakefield Alt URL (22 May 1845 – 10 August 1924) was the son of Felix Wakefield, one of Edward Gibbon Wakefield’s younger brothers. Edward was born in Launceston, Tasmania, brought up in New Zealand, and educated in France and at King's College London."]}, {"page": "1875 in New Zealand", "response": ["* 23 December: Felix Wakefield, colonist (born 1807)"]}, {"page": "1807 in New Zealand", "response": ["* 30 November (in England): Felix Wakefield, colonist"]}, {"page": "Priscilla Wakefield", "response": ["The Wakefields had five children, of whom three survived to adulthood. The two surviving sons were Edward Wakefield (1774–1854) and Daniel Wakefield. The surviving daughter, Isabella (3 March 1773 – 17 October 1841), married Joshua Head of Ipswich on 12 September 1794. Her grandchildren included Edward Gibbon Wakefield, Daniel Bell Wakefield, William Hayward Wakefield, Arthur Wakefield and Felix Wakefield."]}, {"page": "James Townsend (New Zealand settler)", "response": ["The Townsend family, with four sons and six daughters, voyaged to New Zealand as settlers in 1850 on one of the First Four Ships, the Cressy. He was on the initial committee of the Canterbury Association, with Felix Wakefield and others. He also took part in the Zoological Committee of the settlement, raising funds in London for the importation of native British species. A high opinion of his trustworthiness was held by Jerningham Wakefield, who communicated it to John Robert Godley."]}, {"page": "Edward Wakefield (statistician)", "response": ["#Felix Wakefield (1807–1875)."]}, {"page": "Lyttelton Times", "response": ["| 8 || 1 March || 1–18 || Felix Wakefield (RS 2) Guise Brittan (RS 5) Henry Sewell (RS 9) John Watts-Russell (RS 12) Lord Wharncliffe (RS 15) Walpole Cheshire Fendall (RS 18)", "| 11 || 22 March || 54–70 || Joseph Longden and Henry Le Cren (RS 55) Felix Wakefield (RS 56) Richard James Strachan Harman (RS 58) Guise Brittan (RS 60) Benjamin Lancaster (RS 62) Thomas Rowley Jr. (RS 63) Edward Kent and Isaac Luck (RS 64)"]}, {"page": "Barbadoes Street Cemetery", "response": ["*Felix Wakefield (1807–1875), engineer and Canterbury colonist"]}, {"page": "Charles Torlesse", "response": ["Torlesse held town section (TS) 732 in trust for Felix Wakefield, a brother of Edward Gibbon Wakefield. The section fronted onto both Cathedral Square and Hereford Street. From 1863, Torlesse was in partnership with Henry Matson, and operated as land agents under the banner of Torlesse & Matson. On the evening of 4 June 1864, a fire started in their building and a large number of wooden buildings were destroyed. Torlesse then bought the section of Wakefield for £1145, and commissioned builders Balke and Brouard to build a new two-storey stone building fronting onto Cathedral Square for £1124. This building was the first building made of permanent material in the Square and became known as the Torlesse Building. It was demolished in 1916, and the Strand picture theatre was built in its place. Today, part of the land is occupied by the ANZ Bank (itself due to be demolished due to earthquake damage), Strand Lane and a building housing a public toilet."]}, {"page": "James Campbell (land commissioner)", "response": ["Campbell was appointed to the Committee of Management of the Society of Canterbury Colonists when it was formed in London on 25 April 1850. The Society was formed \"for the purpose of making suggestions and expressing the opinions of the Colonists upon matters relating to the welfare of the proposed Colony\" being established by the Canterbury Association in Canterbury New Zealand. The other members of the Society's first Committee of Management were Guise Brittan (Chairman), James FitzGerald, Rev Dr Thomas Rowley, Henry Phillips, Henry Sewell, Conway Lucas Rose and Edward Ward (brother of Crosbie Ward), who was appointed secretary of the society. After elections on 18 July 1850 C L Rose and Rev Dr Thomas Rowley were replaced on the Committee by George Leslie Lee, Charles Maunsell, John Watts Russell, Henry John Tancred, James Townsend and Felix Wakefield; however, Lee and Sewell immediately vacated their appointments.Minute Book of the Society of Canterbury Colonists, April 1850 to December 1851, pages 2,3 and 23Press, 15 December 1900, page 4"]}, {"page": "Wakefield (surname)", "response": ["*Edward Wakefield (New Zealand politician) (1845–1924), son of Felix Wakefield, New Zealand politician and journalist", "*Felix Wakefield (1807–1875), brother of Edward Gibbon Wakefield"]}]}}