{"wiki_id": "http://www.wikidata.org/entity/Q1303394", "itemLabel": "William Glock", "itemDescription": "British journalist", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Glock", "wikipedia_page": {"main": "Sir William Frederick Glock, CBE (3 May 1908 – 28 June 2000) was a British music critic and musical administrator who was instrumental in introducing the Continental avant-garde, notably promoting the career of Pierre Boulez.\n\n", "link_mentions": [{"page": "Alan Bush", "response": ["When war broke out in September 1939, Bush registered for military service under the National Service (Armed Forces) Act of 1939.  He was not called up immediately, and continued his musical life, helping to form the WMA Singers to replace the now-defunct LLCU, and founding the William Morris Music Society. In April 1940 he conducted a Queen's Hall concert of music by Soviet composers which included the British premieres of Shostakovich's Fifth Symphony, and Khatchaturian's Piano Concerto. William Glock in The Observer was disdainful, dismissing the Khatachurian concerto as \"sixth-rate\", and criticising the inordinate length, as he saw it, of the symphony. "]}, {"page": "Pierre Boulez", "response": ["On 18 June 1955, Hans Rosbaud conducted the first performance of Boulez's best-known work, Le Marteau sans maître, at the ISCM Festival in Baden-Baden. A nine-movement cycle for alto voice and instrumental ensemble based on poems by René Char, it was an immediate, international success.Jameux, 79–80. William Glock wrote: \"even at a first hearing, though difficult to take in, it was so utterly new in sound, texture and feeling that it seemed to possess a mythical quality like that of Schoenberg's Pierrot lunaire.\"Glock, 132. When Boulez conducted the work in Los Angeles in early 1957, Stravinsky—who described it as \"one of the few significant works of the post-war period of exploration\"—attended the performance. Boulez dined several times with the Stravinskys and (according to Robert Craft) \"soon captivated the older composer with new musical ideas, and an extraordinary intelligence, quickness and humour\".Walsh, 359; Heyworth (1986), 15 and 22. Relations soured somewhat the following year over the first Paris performance of Stravinsky's Threni for the Domaine musical. Poorly planned by Boulez and nervously conducted by Stravinsky, the performance broke down more than once.Walsh, 385–387; Glock, 74.", "His appearances with the orchestra over the next five years included his debuts at the Proms and at Carnegie Hall (1965)Vermeil, 189; Glock, 106. and tours to Moscow and Leningrad, Berlin and Prague (1967).Glock, 107 and 109; Vermeil, 191. In January 1969 William Glock, controller of music at the BBC, announced his appointment as chief conductor.Glock, 139.", "Dérive 1 (1984), dedicated to William Glock on his retirement from the Bath Festival, is a short quintet in which the piano takes the lead. The material is derived from six chords and, according to Ivan Hewett, the piece \"shuffles and decorates these chords, bursting outwards in spirals and eddies, before returning to its starting point\". At the end the music \"shivers into silence\".", "* Bennett, Gerald. 1986. The Early Works. In Pierre Boulez: A Symposium, edited by William Glock, 41–84. London: Eulenburg Books. .", "* Bradshaw, Susan. 1986. The Instrumental and Vocal Music. In Pierre Boulez: A Symposium, edited by William Glock, 127–229. London: Eulenburg Books. .", "* Heyworth, Peter. 1986. The First Fifty Years. In Pierre Boulez: A Symposium, edited by William Glock, 3–40. London: Eulenburg Books. ."]}, {"page": "Ralph Vaughan Williams", "response": ["In 1943 Vaughan Williams conducted the premiere of his Fifth Symphony at the Proms. Its serene tone contrasted with the stormy Fourth, and led some commentators to think it a symphonic valediction. William Glock wrote that it was \"like the work of a distinguished poet who has nothing very new to say, but says it in exquisitely flowing language\".Glock, William. \"Music\", The Observer, 18 July 1943, p. 2 The music Vaughan Williams wrote for the BBC to celebrate the end of the war, Thanksgiving for Victory, was marked by what the critic Edward Lockspeiser called the composer's characteristic avoidance of \"any suggestion of rhetorical pompousness\".Lockspeiser, Edward. \"Thanksgiving for Victory, for Soprano Solo, Speaker, Chorus and Orchestra by R. Vaughan Williams\", Music & Letters, October 1945, p. 243   Any suspicion that the septuagenarian composer had settled into benign tranquillity was dispelled by his Sixth Symphony (1948), described by the critic Gwyn Parry-Jones as \"one of the most disturbing musical statements of the 20th century\", opening with a \"primal scream, plunging the listener immediately into a world of aggression and impending chaos.\"Parry-Jones, Gwyn. \"The Inner and Outer Worlds of RVW\" , Journal of the RVW Society, July 1995 Coming as it did near the start of the Cold War, many critics thought its pianissimo last movement a depiction of a nuclear-scorched wasteland.Horton, p. 210; and Kennedy (1980) pp. 301–302 The composer was dismissive of programmatic theories: \"It never seems to occur to people that a man might just want to write a piece of music.\"Kennedy (1980), p. 302"]}, {"page": "BBC Symphony Orchestra", "response": ["As a result of initiatives begun in the 1960s by the BBC controller of music William Glock, performing standards gradually began to rise. Under Andrew Davis in the 1990s and Jiří Bělohlávek in the 2000s, the orchestra prospered. By the second decade of the 21st century, the BBC SO was once again regarded by critics as of first-class status. From the outset, the orchestra has been known for pioneering new music, and it continues to do so, at the Proms, in concerts at the Barbican Centre, and in studio concerts from its base at BBC Maida Vale studios.", "In 1959, the BBC appointed William Glock as controller of music for the BBC.  During Glock's tenure, the profile and fortunes of the BBC SO began to rise.  Glock engaged Antal Doráti as the orchestra's principal conductor.  Heyworth judged that Doráti raised standards of playing and brought new vigour to the programmes in his four years in charge (1962–1966). Doráti was convinced that the orchestra was stultified by concentrating on studio broadcasts, as it did except during the Proms season. He strove to free players from \"slavery to the microphone\", and Glock promoted a regular series of concerts at the Festival Hall.Glock, p. 106 The music critic Tom Sutcliffe later wrote that Doráti and his successors, Colin Davis (1967–71), Pierre Boulez (1971–75) and Gennady Rozhdestvensky (1978–81) had been partly successful in improving playing standards, but had not brought the orchestra up to its original level of distinction."]}, {"page": "Arthur Bliss", "response": ["Throughout his life, Bliss was vigilant on the state of music in Britain, about which he had written extensively since the 1920s.See for example, Bliss, Arthur. \"Some Aspects of the Present Musical Situation\". Proceedings of the Musical Association, 49th Session (1922–1923), pp. 59–77, accessed 23 March 2011 ; and Bliss, Arthur. \"Aspects of Contemporary Music\", The Musical Times, May 1934, pp. 401–05; accessed 23 March 2011  In 1969 he publicly censured the BBC for its plan to cut its classical music budget and disband several of its orchestras. He was delegated by his colleagues Walton, Britten, Peter Maxwell Davies and Richard Rodney Bennett to make a strong protest to William Glock, the BBC's controller of music. "]}, {"page": "The Proms", "response": ["After Wood's death, Julian Herbage acted as de facto principal administrator of the Proms for a number of years, as a freelance employee after his retirement from the BBC, with assistance from such staff as Edward Clark and Kenneth Wright. During the tenure of William Glock as Controller of the Proms, from 1960 to 1973, the Proms repertory expanded both forwards in time, to encompass then contemporary and avant-garde composers such as Boulez, Berio, Carter, Dallapiccola, Peter Maxwell Davies, Gerhard, Henze, Ligeti, Lutosławski, Lutyens, Maw, Messiaen, Nono, Stockhausen, and Tippett, as well as backwards to include music by past composers such as Purcell, Cavalli, Monteverdi, Byrd, Palestrina, Dufay, Dunstaple, and Machaut, as well as less-often performed works of Johann Sebastian Bach and Joseph Haydn. From the 1960s, the number of guest orchestras at the Proms also began to increase, with the first major international conductors (Leopold Stokowski, Georg Solti, and Carlo Maria Giulini) performing in 1963, and the first foreign orchestra, the Moscow Radio Symphony Orchestra, performing in 1966. Since that time, almost every major international orchestra, conductor and soloist has performed at the Proms. In 1970, Soft Machine's appearance led to press attention and comment as the first \"pop\" band to perform there.", "* William Glock (1960–1973)"]}, {"page": "Jack Brymer", "response": ["After Beecham's death in 1961 Brymer and other members of the RPO including MacDonagh became unhappy about the management of the RPO.\"Lives Remembered\", The Times, 2 October 2003, p. 41 The BBC's controller of music, William Glock, invited Brymer and MacDonagh to move to the BBC Symphony Orchestra. Brymer was the orchestra's co-principal clarinettist from 1963 to 1971. He also began to play more often in chamber music. When Pierre Boulez became chief conductor of the BBC SO in 1971, the sound he sought from his players, \"avant garde, harsher, more cutting in its edge\", did not appeal to Brymer. He accepted an invitation to join the London Symphony Orchestra as co-principal with Gervase de Peyer. An example of Brymer's sound in his LSO years can be heard in a 1972 recording of Rachmaninoff's Symphony No 2, conducted by André Previn. In The Gramophone, Edward Greenfield wrote of Brymer's \"distinctively refined tone-colour … breathtakingly expressive\" in the slow movement.Greenfield, Edward. \"Rachmaninov. Symphony No 2 in E minor\", The Gramophone, April 1973, p. 121"]}, {"page": "Colin Davis", "response": ["After he left Sadler's Wells, and being passed over as principal conductor of the London Symphony Orchestra, Davis was named chief conductor of the BBC Symphony Orchestra (BBC SO), effective September 1967.Orga, p. 158 At first, in the general view of the public, his tenure was overshadowed, at least during the Proms, by the memory of Sir Malcolm Sargent. Compared to the \"suave father figure\" image of SargentCox, p. 192 to the promenaders, it took some time for the much younger Davis to be accepted. The BBC's official historian of the Proms later wrote, \"Davis never really identified himself with the Proms in the way that Sargent had done. Davis was uncomfortable with the traditional hullabaloo of the Last Night of the Proms and attempted, unsuccessfully, to modernise it.Orga, p. 166 The BBC's Controller of Music, William Glock, was a long-standing admirer of Davis, and encouraged him to put on adventurous programmes, with a new emphasis on modern music, both at the Proms and throughout the rest of the orchestra's annual schedule.Blyth, p. 16  Following his tenure as BBC SO chief conductor, Davis served as chief guest conductor of the BBC SO from 1971 to 1976.Kenyon, Nicholas, The BBC Symphony Orchestra: The first fifty years, 1930-1980.  British Broadcasting Corporation (ISBN 0 563 17617 2), p. 441 (1981)."]}, {"page": "BBC Radio 3", "response": ["In 1987 the positions of Controller of Music and Controller of Radio 3 were merged, and with it the operation of the Proms, under the former Music Controller John Drummond. Drummond, like Hearst, believed that the music programmes' presentation was too stiff and formalDrummond (2001), p. 354. and he therefore encouraged announcers to be more natural and enthusiastic. Repeats of classic drama performances by the likes of John Gielgud and Paul Scofield were also included because, in his view, newer drama was \"gloomy and pretentious\".Drummond (2001), pp. 370–371. He also introduced features and celebrations of the anniversaries of famous figures including William Glock, Michael Tippett and Isaiah Berlin. Drummond also introduced the show Mixing It which targeted the music genres that fell between Radios 1 and 3, often seen as a precursor to the programme Late Junction."]}, {"page": "Elisabeth Lutyens", "response": ["She found success in 1947 with a cantata setting Arthur Rimbaud's poem Ô saisons, Ô châteaux. The BBC refused to perform it at the time because the soprano range was thought to go beyond the bounds of the possible, but the BBC was nevertheless the organisation that gave first performances to many of her works from the 1940s to the 1950s. Her work in this period included incidental music for a number of poetry readings, such as Esmé Hooton's Zoo in 1956. The BBC began playing her music again when her friend William Glock became Director of Music. Lutyens is remembered for her intolerance of her better-known contemporaries among English composers including Vaughan Williams, Holst, Ireland, and Bax.\"cowpat music\", Concise Oxford Dictionary of Music, Oxford University Press. Retrieved 8 September 2020  She dismissed them as \"the cowpat school\" in a lecture she gave at the Dartington International Summer School in the 1950s, disparaging their \"folky‐wolky melodies on the cor anglais\"."]}, {"page": "Symphony No. 5 (Vaughan Williams)", "response": ["The response of music critics was generally enthusiastic. The anonymous reviewer in The Times wrote that the symphony \"belongs to that small body of music that, outside of late Beethoven, can properly be described as transcendental … this is music not only of contemplation but of benediction\". A grudging note was struck by William Glock, a proponent of avant-garde music, who commented in The Observer that the symphony was \"like the work of a distinguished poet who has nothing very new to say, but says it in exquisitely flowing language\".Glock, William. \"Music\", The Observer, 18 July 1943, p. 2 Neville Cardus wrote, \"The Fifth Symphony contains the most benedictory and consoling music of our time.\"Cardus, Neville, \"The Measure of Vaughan Williams\", The Saturday Review, 31 July 1954, p. 45 When the first recording came out in 1944 (see below) The Observer was more welcoming than Glock had been the year before, saying that the Fifth was to the Fourth Symphony as The Tempest is to King Lear … ideal beauty.\"\"On the Record: The Hallé Orchestra\", The Observer, 25 June 1944, p. 3"]}, {"page": "Brightwell-cum-Sotwell", "response": ["*Sir William Glock, Director of Music at the BBC and head of the Proms concerts, also lived in the village and died there in 2000."]}, {"page": "List of University of Cambridge people", "response": ["*Sir William Glock (Caius)"]}, {"page": "BBC Symphony Chorus", "response": ["The arrival of William Glock at the BBC as Controller, Music, in 1959, had the same revolutionary effect on the BBC Choral Society as on every other department concerned with music. In addition, the Society suffered a sudden loss in 1961 with the death of Leslie Woodgate, who had guided it through 27 years of its existence. On 15 June 1961, a memorial concert was held, directed by Keith Falkner (who had been a soloist in the first concert in 1928) and by George Thalben-Ball. Peter Gellhorn took over the post of Chorus Master, which he held for some eleven years until 1972. Under the Glock regime new works began to re-assume a vital part in the Society's repertoire. On 1 August 1963 the London premiere of Britten's War Requiem (first performed the preceding year at Coventry Cathedral) was given, with Britten and Meredith Davies conducting. Later that year Alan Rawsthorne's Carmen Vitale was a choral commission; and at the beginning of 1963 the Society faced one of its greatest challenges, a new work by Hans Werner Henze called Novae de Infinito Laudes. This was given two performances under the composer's direction: on 17 March 1965, and again at the Proms on 27 August. Distinguished visitors in this period included Leopold Stokowski (in Mahler's Second Symphony). A return visit by Ernest Ansermet to conduct Honegger's King David had been planned to mark the 10th anniversary of Honegger's death, but Ansermet was ill and Sir Adrian Boult took over at short notice.BBC Genome, January 10, 1966, Network Three, 20.25: Honegger"]}, {"page": "Gordon Jacob", "response": ["In 1959 a BBC television documentary about Jacob was directed by Ken Russell; in the following years, under its controller of music William Glock, the BBC was seen as increasingly hostile to living composers who wrote tonal music. It was always denied that Glock had a blacklist,Morley, Christopher. \"McCabe in Conversation\", Music and Vision, 1999. Retrieved 2 November 2018 but music by non avant-garde composers, including Edmund Rubbra, Arnold Bax, John Ireland and even William Walton, was demonstrably out of favour with the BBC during the 1960s.Kennedy, p. 200 By this decade a large proportion of a composer's income came from royalties for broadcasts, and like others of his generation, Jacob suffered from the BBC's disinclination to play his music. He was fortunate in having a steady stream of commissions from the US, where his music was popular with university wind-bands. He never retired from composing, and went on writing until shortly before his death."]}, {"page": "Royal Philharmonic Society", "response": ["** William Glock"]}, {"page": "Marshfield, Gloucestershire", "response": ["* William Glock, music critic"]}, {"page": "Harold Truscott", "response": ["After the change in BBC music policy initiated by Sir William Glock in the late 1950s, Truscott's music ceased to receive attention, but he remained active as a copious giver of broadcast talks and contributor to journals on a wide range of subjects. He had an encyclopaedic range of knowledge and enthusiasms, ranging from the central composers of the Classical tradition to marginalised figures of the 19th and 20th centuries who were then deeply unfashionable. His advocacy of Granville Bantock, Havergal Brian, Dussek, Medtner, Hans Pfitzner, Max Reger, Franz Schmidt, Robert Volkmann and others was as sincere, and informed by an acquaintance with the music as close, as his discussions of Schubert's piano sonatas or Haydn's string quartets. His principal writings include books on Beethoven's Late String Quartets (Dobson, 1968) and Franz Schmidt's Orchestral Music (Toccata Press, 1984), as well as important contributions to The Symphony edited by Robert Simpson (Penguin Books, 1966). Unfinished at his death were a volume on Schmidt's chamber music, a study of the music of Korngold, another of Beethoven's Ninth Symphony and a near-complete book on Schubert and the piano. He also left an unfinished autobiography entitled Laughter in the Dark."]}, {"page": "Bath International Music Festival", "response": ["*Sir William Glock (1975–1984)"]}, {"page": "Karl Rankl", "response": ["In wartime Britain Rankl was unable to obtain a permit to work as a conductor until 1944, and he devoted much of his time to composition.Harewood, p. 68 His widow later recalled that Rankl also played the viola in a string quartet during this period.Conway, Paul. \"Karl Rankl (1898–1968)\", Music Web International, accessed 3 April 2011 When he was eventually given the necessary work permit to resume his conducting career, Rankl conducted the Liverpool Philharmonic, BBC NorthernGlock, William, \"Music\", The Observer, 21 January 1945, p. 2 and London Philharmonic Orchestras.\"The Coliseum Concerts\", The Times, 6 April 1945, p. 6 He made a favourable impression; The Times  praised his \"boundless energy … clear-cut performance and with a strong feeling for the shapely line of a melody.\" William Glock in The Observer praised the \"natural firmness\" of his \"splendid\" and \"authoritative\" conducting of Beethoven. Among those whom Rankl impressed was David Webster, chairman of the Liverpool Philharmonic. In 1944, Webster was invited to set up a new opera company at the Royal Opera House, Covent Garden in London. He turned to Rankl for advice and soon decided to appoint him musical director of the fledgling company."]}, {"page": "Albert Medal (Royal Society of Arts)", "response": ["* 1971: Sir William Glock CBE 'for his outstanding services to music'"]}, {"page": "Peter Donohoe (pianist)", "response": ["However, during his final year as an undergraduate he decided to put all his energies into the piano. After graduating, he spent one year studying with Yvonne Loriod and Olivier Messiaen in Paris. During his student years at the Royal Northern College of Music he had also studied with Vlado Perlemuter, Sir William Glock, Roger Woodward, Charles Rosen and Sequeira Costa. In 1974 and 1975 he attended the Bartók Seminar in Budapest, where he studied with Pál Kadosa and first met his long-term colleague, Zoltán Kocsis."]}, {"page": "A Child of Our Time", "response": ["Later writers would state that A Child of Our Time placed Tippett in the first rank of the composers of his generation,  and most of the early reviews were favourable. Among these, The Timess critic called the work \"strikingly original in conception and execution\", and wrote that Tippett had succeeded quite remarkably in writing an effective tract for the times. A second Times review, written a few days after the premiere, suggested that the oratorio had articulated a key contemporary question: \"How is the conflict of the inevitable with the intolerable to be resolved?\" It pointed to the hope expressed in the final spiritual, \"Deep River\", and concluded that despite some weak passages the work created a successful partnership between art and philosophy. William Glock in The Observer was laudatory: \"The most moving and important work by an English composer for many years\". Glock found that the spirituals suited the themes of the oratorio perfectly, and had been arranged \"with a profound sense of beauty\"."]}, {"page": "Agatha Christie indult", "response": ["* William Glock"]}, {"page": "John Veale", "response": ["Veale wrote in a tonal idiom and felt that his early work suffered neglect in the 1960s and 1970s under the avant garde musical regime at the BBC and its Director of Music William Glock. He died in Bromley, (a south-eastern suburb of London) on 16 November 2006 after a struggle with prostate cancer."]}, {"page": "John Amis", "response": ["In 1948, William Glock invited Amis to run a summer school for musicians at Bryanston School, Dorset. The summer school moved to Dartington in 1953. Amis remained administrative director until 1981, during which time he brought to the school a long line of international musicians, amongst them Paul Hindemith, Igor Stravinsky, and Sir Michael Tippett."]}, {"page": "Symphony No. 4 (Arnold)", "response": ["The work was commissioned by William Glock for the BBC. The composer conducted the first performance with the BBC Symphony Orchestra on 2 November 1960 at the Royal Festival Hall."]}, {"page": "A. H. Fox Strangways", "response": ["Returning to England, Fox Strangways settled in London. He became Honorary Secretary of the India Society.The Times, 17 December 1912. He contributed concert reviews to The Times and later joined the staff of the paper. During the First World War he deputised for the chief music critic, H C Colles, who was away on active service. In 1925 he moved to The Observer as chief music critic, where he remained until 1939, when he retired aged eighty and was succeeded by William Glock. When Colles edited the third edition of Grove's Dictionary (1927), Fox Strangways was a major contributor."]}, {"page": "Organ Concerto (Williamson)", "response": ["Williamson's Organ Concerto was written in 1961, to a commission from Sir William Glock specifically for that year's BBC Proms season.Malcolm Williamson: A 70th Birthday Tribute (Paul Conway) The première took place at the Royal Albert Hall, London, on 8 August, and was performed by the London Philharmonic Orchestra under Sir Adrian Boult (a staunch advocate of Williamson's musicHarris & Meredith) with the composer himself as soloist."]}, {"page": "Glock (disambiguation)", "response": ["*William Glock (1908–2000), British musical administrator"]}]}}