{"wiki_id": "http://www.wikidata.org/entity/Q130549", "itemLabel": "Tracey Ullman", "itemDescription": "English-born actress, comedian, singer, dancer, screenwriter, producer, director, author and businesswoman", "wikipedia_url": "https://en.wikipedia.org/wiki/Tracey_Ullman", "wikipedia_page": {"main": "Tracey Ullman (born Trace Ullman; 30 December 1959) is a British-American actress, comedian, singer, writer, producer, and director. Her earliest mainstream appearances were on British television sketch comedy shows A Kick Up the Eighties (with Rik Mayall and Miriam Margolyes) and Three of a Kind (with Lenny Henry and David Copperfield). After a brief singing career, she appeared as Candice Valentine in Girls on Top with Dawn French and Jennifer Saunders.\nShe emigrated from the United Kingdom to the United States, where she starred in her own network television comedy series, The Tracey Ullman Show, from 1987 until 1990, which also featured the first appearances of the long-running animated media franchise The Simpsons. She later produced programmes for HBO, including Tracey Takes On... (1996–99), for which she garnered numerous awards. Her sketch comedy series Tracey Ullman's State of the Union ran from 2008 to 2010 on Showtime. She has also appeared in several feature films. Ullman was the first British woman to be offered her own television sketch show in both the United Kingdom and the United States.In 2016, she returned to British television with the BBC sketch comedy show Tracey Ullman's Show, her first project for the broadcaster in over thirty years. This led to the creation of the topical comedy series Tracey Breaks the News in 2017.\nIn 2017, Ullman was reportedly Britain's richest comedian and second-richest British actress, with an estimated wealth of £80 million. She is the recipient of numerous accolades, including twelve American Comedy Awards, seven Primetime Emmy Awards, two British Academy Film Awards, four Satellite Awards, a Golden Globe Award, and a Screen Actors Guild Award.\n\n", "link_mentions": [{"page": "List of comedians", "response": ["* Tracey Ullman (born 1959)"]}, {"page": "December 30", "response": ["*  1959   – Tracey Ullman, English-American actress, singer, director, and screenwriter"]}, {"page": "Into the Woods", "response": ["A theatrical film adaptation of the musical was produced by Walt Disney Pictures, directed by Rob Marshall, and starring Meryl Streep, Emily Blunt, James Corden, Anna Kendrick, Chris Pine, Tracey Ullman, Christine Baranski, Lilla Crawford, Daniel Huttlestone, MacKenzie Mauzy, Billy Magnussen, and Johnny Depp. The film was released on December 25, 2014. It was a critical and commercial hit, grossing over $213 million worldwide. For her performance as the Witch, Streep was nominated for the Academy Award for Best Supporting Actress. The film also received Academy Award nominations for Best Production Design and Best Costume Design."]}, {"page": "New Malden", "response": ["* In the BBC sketch-comedy series Tracey Ullman's Show comedian Tracey Ullman's OAP character Kay Clark lives with her 103-year-old mother in New Malden."]}, {"page": "The Simpsons", "response": ["The family was conceived by Groening shortly before a solicitation for a series of animated shorts with producer James L. Brooks. He created a dysfunctional family and named the characters after his own family members, substituting Bart for his own name; he thought Simpson was a funny name in that it sounded similar to \"simpleton\". The shorts became a part of The Tracey Ullman Show on April 19, 1987. After three seasons, the sketch was developed into a half-hour prime time show and became Fox's first series to land in the Top 30 ratings in a season (1989–1990).", "When producer James L. Brooks was working on the television variety show The Tracey Ullman Show, he decided to include small animated sketches before and after the commercial breaks. Having seen one of cartoonist Matt Groening's Life in Hell comic strips, Brooks asked Groening to pitch an idea for a series of animated shorts. Groening initially intended to present an animated version of his Life in Hell series. However, Groening later realized that animating Life in Hell would require the rescinding of publication rights for his life's work. He therefore chose another approach while waiting in the lobby of Brooks's office for the pitch meeting, hurriedly formulating his version of a dysfunctional family that became the Simpsons. He named the characters after his own family members, substituting \"Bart\" for his own name, adopting an anagram of the word brat.", "The Simpson family first appeared as shorts in The Tracey Ullman Show on April 19, 1987. Groening submitted only basic sketches to the animators and assumed that the figures would be cleaned up in production. However, the animators merely re-traced his drawings, which led to the crude appearance of the characters in the initial shorts. The animation was produced domestically at Klasky Csupo, with Wes Archer, David Silverman, and Bill Kopp being animators for the first season. Colorist Georgie Peluse was the person who decided to make the characters yellow.", "In 1989, a team of production companies adapted The Simpsons into a half-hour series for the Fox Broadcasting Company. The team included the Klasky Csupo animation house. Brooks negotiated a provision in the contract with the Fox network that prevented Fox from interfering with the show's content. Groening said his goal in creating the show was to offer the audience an alternative to what he called \"the mainstream trash\" that they were watching. The half-hour series premiered on December 17, 1989, with \"Simpsons Roasting on an Open Fire\". \"Some Enchanted Evening\" was the first full-length episode produced, but it did not broadcast until May 1990, as the last episode of the first season, because of animation problems. In 1992, Tracey Ullman filed a lawsuit against Fox, claiming that her show was the source of the series' success. The suit said she should receive a share of the profits of The Simpsons—a claim rejected by the courts.", "The Simpsons has six main cast members: Dan Castellaneta, Julie Kavner, Nancy Cartwright, Yeardley Smith, Hank Azaria, and Harry Shearer. Castellaneta voices Homer Simpson, Grampa Simpson, Krusty the Clown, Groundskeeper Willie, Mayor Quimby, Barney Gumble, and other adult, male characters. Julie Kavner voices Marge Simpson and Patty and Selma, as well as several minor characters. Castellaneta and Kavner had been a part of The Tracey Ullman Show cast and were given the parts so that new actors would not be needed. Cartwright voices Bart Simpson, Nelson Muntz, Ralph Wiggum and other children. Smith, the voice of Lisa Simpson, is the only cast member who regularly voices only one character, although she occasionally plays other episodic characters. The producers decided to hold casting for the roles of Bart and Lisa. Smith had initially been asked to audition for the role of Bart, but casting director Bonita Pietila believed her voice was too high, so she was given the role of Lisa instead. Cartwright was originally brought in to voice Lisa, but upon arriving at the audition, she found that Lisa was simply described as the \"middle child\" and at the time did not have much personality. Cartwright became more interested in the role of Bart, who was described as \"devious, underachieving, school-hating, irreverent, [and] clever\". Groening let her try out for the part instead, and upon hearing her read, gave her the job on the spot. Cartwright is the only one of the six main Simpsons cast members who had been professionally trained in voice acting prior to working on the show. Azaria and Shearer do not voice members of the title family, but play a majority of the male townspeople. Azaria, who has been a part of the series' regular voice cast since the second season, voices recurring characters such as Moe Szyslak, Chief Wiggum, Apu Nahasapeemapetilon and Professor Frink. Shearer provides voices for Mr. Burns, Mr. Smithers, Principal Skinner, Ned Flanders, Reverend Lovejoy and formerly Dr. Hibbert. Every main cast member has won a Primetime Emmy Award for Outstanding Voice-Over Performance.", "Several different U.S. and international studios animate The Simpsons. Throughout the run of the animated shorts on The Tracey Ullman Show, the animation was produced domestically at Klasky Csupo. With the debut of the series, because of an increased workload, Fox subcontracted production to several local and foreign studios. These are AKOM,First episode credit in production order:  Anivision,First episode credit in production order:  Rough Draft Studios,First episode credit in production order:  USAnimation,First episode credit in production order:  and Toonzone Entertainment.First episode credit in production order: "]}, {"page": "1959", "response": ["* December 30 – Tracey Ullman, British-American comedian and actress"]}, {"page": "Helen Hunt", "response": ["In 1990, Hunt appeared with Tracey Ullman and Morgan Freeman in a Wild West version of The Taming of the Shrew, at the Delacorte Theater in Central Park. In 1991, Hunt starred in Trancers II, the direct-to-video sequel to Trancers (1984), and played the lead female role in the sitcom My Life and Times, which only aired for 6 episodes. In 1992, she would appear in the drama The Waterdance as a married woman having an affair with a writer; in the harem comedy Only You, as a travel agent and the love interest of a doll's house designer; in the mockumentary Bob Roberts, as Rose Pondell, a field reporter at WLNO; and in Mr. Saturday Night, as a young agent named Annie Well. In 1992, Hunt returned for her fourth and final outing as Lena in Trancers III, the second sequel of the Trancers series including Trancers 1.5, which was among her five film releases that year."]}, {"page": "Eric Idle", "response": ["Idle's play What About Dick? was given a staged reading at two public performances in Hollywood on 10–11 November 2007. The cast included Idle, Billy Connolly, Tim Curry, Eddie Izzard, Jane Leeves, Emily Mortimer, Jim Piddock and Tracey Ullman. The play returned on 26–29 April 2012 in the Orpheum Theatre with most of the cast returning with the exception of Emily Mortimer who was replaced by Sophie Winkleman. Russell Brand also joined the cast. The play was made available for digital download on 13 November 2012."]}, {"page": "Stiff Records", "response": ["Established at the outset of the punk rock boom, Stiff signed various punk and new wave acts such as Nick Lowe, the Damned, Lene Lovich, Wreckless Eric, Elvis Costello, Ian Dury, and Devo.  In the 1980s, with most of their early signings having moved on, the label found commercial success with Madness, The Pogues, Tracey Ullman, The Belle Stars, Kirsty MacColl and others.", "* Tracey Ullman"]}, {"page": "Scott Bakula", "response": ["Bakula performed various songs from his career for a one-night-only performance entitled An Evening with Scott Bakula at Sidney Harman Hall on January 18, 2008, as a benefit for the restoration of the historic Ford's Theater. Bakula had three appearances in 2008. He appeared as Atty. Jack Ross in an episode of Boston Legal, \"Glow in the Dark\", which aired on February 12, 2008, on the ABC network. From March 4 – April 20, he starred as Tony Hunter in the world premiere of Dancing in the Dark at The Old Globe in San Diego, California. Dancing in the Dark is based on the movie The Band Wagon (1953). Bakula appeared as the character Chris Fulbright in the five-episode run of the Tracey Ullman sketch comedy series State of the Union on Showtime."]}, {"page": "Dan Castellaneta", "response": ["He auditioned for a role in The Tracey Ullman Show and his first meeting underwhelmed Tracey Ullman and the other producers. Ullman decided to fly to Chicago to watch Castellaneta perform. His performance that night was about a blind man who tries to become a comedian and Ullman later recalled that although there were flashier performances that night, Castellaneta made her cry. She was impressed and Castellaneta was hired.", "Castellaneta is most famous for his role as Homer Simpson on the longest-running American animated television show The Simpsons. The Tracey Ullman Show included a series of animated shorts about a dysfunctional family. Voices were needed for the shorts, so the producers decided to ask Castellaneta and fellow cast member Julie Kavner to voice Homer and Marge Simpson respectively, rather than hire more actors. Homer's voice began as a loose impression of Walter Matthau, but Castellaneta could not \"get enough power behind that voice\" and could not sustain his Matthau impression for the nine- to ten-hour long recording sessions."]}, {"page": "Meryl Streep", "response": ["In 2004, Streep was awarded the AFI Life Achievement Award by the board of directors of the American Film Institute. In 2011, she received a Kennedy Center Honors, introduced by Tracey Ullman, and speeches by 2009 Kennedy Center Honoree Robert De Niro and 2003 Kennedy Center Honoree Mike Nichols. Those also to honor Streep included, Kevin Kline, Emily Blunt, Stanley Tucci, and Anne Hathaway. The tribute ended with the whole cast who sang \"She's My Pal,\" a play on \"He's My Pal\" from Ironweed."]}, {"page": "List of British comedians", "response": ["*Tracey Ullman (born 1959)", "*Tracey Ullman (born 1959)"]}, {"page": "Ebertfest", "response": ["| Tracey Ullman, Vincent D'Onofrio, Lili Taylor"]}, {"page": "Errol Flynn", "response": ["In 1961, Beverly Aadland's mother, Florence, co-wrote The Big Love with Tedd Thomey, alleging that Flynn had been involved in a sexual relationship with her daughter, who was 15 when it began. The memoir was adapted in 1991 by Jay Presson Allen and her daughter Brooke Allen into a one-woman play, The Big Love, which starred Tracey Ullman as Florence Aadland in its New York premiere."]}, {"page": "Angela Merkel", "response": ["On the British sketch-comedy Tracey Ullman's Show, comedian Tracey Ullman has parodied Merkel to international acclaim with German media dubbing her impersonation as the best spoof of Merkel in the world.\"True total hottie Frau\": Die bislang beste Merkel – Parodie kommt von der BBC , Buzzer, 21 January 2016."]}, {"page": "The Band Wagon", "response": ["A revised version of the stage adaptation under the name The Band Wagon was presented in a staged concert in November 2014 as part of a New York City Center Encores! special event. The cast starred Brian Stokes Mitchell, Tracey Ullman, Michael McKean, Tony Sheldon and Laura Osnes, with direction and choreography by Kathleen Marshall.Suskin, Steven. \"That's Entertainment!\" Star-Studded 'The Band Wagon' Brings \"Sweet Music\" to City Center\" Playbill, November 11, 2014"]}, {"page": "Jennifer Saunders", "response": ["In 1985, Saunders starred in and co-wrote Girls on Top with French, Tracey Ullman, and Ruby Wax, which portrayed four eccentric women sharing a flat in London. Saunders also appeared in Ben Elton's Happy Families where she played various members of the same family, including all four Fuddle sisters in the six-episode BBC situation comedy. Saunders starred in a Comic Strip film called The Supergrass, a little-known parody of slick 1980s police dramas, directed by Peter Richardson. Saunders played Meryl Streep playing Arthur Scargill's wife in Strike, a Comic Strip spoof on the 1984 miners' strike. She appeared twice as a guest on The Young Ones."]}, {"page": "French and Saunders", "response": ["French and Saunders began to establish themselves in what was referred to as the \"underground comedy\" scene, along with many other prolific actors and comedians whom they would work with during the next twenty-plus years. In 1983, they starred in an edition of Channel 4's series The Entertainers,The TV Museum Youtube channel: a trailer for the programme, transmitted 6 October 1983, appears on their YouTube website and later went on to appear as comedy relief on the weekly music programme The Tube on the same channel, for which French received her honour of being the first person to use the word \"blowjob\" on British television. In 1985, French and Saunders collaborated on the programme Girls on Top, which they once again (with Ruby Wax) wrote and starred in. Co-stars Tracey Ullman and Ruby Wax rounded out a set of four oddball roommates, and the show ran for two series. In 1986, French and Saunders made their first of many appearances on Comic Relief, and they signed a long-term contract with the BBC."]}]}}