{"wiki_id": "http://www.wikidata.org/entity/Q13085344", "itemLabel": "Marian Wenzel", "itemDescription": "British artist and art historian", "wikipedia_url": "https://en.wikipedia.org/wiki/Marian_Wenzel", "wikipedia_page": {"main": "Marian Barbara Wenzel (December 18, 1932 – January 6, 2002) was a British artist and art historian. She dedicated most of her active career to research of Bosnian-Herzegovinian art and cultural history.", "link_mentions": [{"page": "Vlachs", "response": ["Some researchers, like Bogumil Hrabak and Marian Wenzel, theorized that the origins of Stećci tombstones, which appeared in medieval Bosnia between 12th and 16th century, could be attributed to Vlach burial culture of Bosnia and Herzegovina of that times.Marian Wenzel, \"Bosnian and Herzegovinian Tombstobes—Who Made Them and Why?\" Sudost-Forschungen 21 (1962): 102–143"]}, {"page": "Aromanians", "response": ["The medieval Vlachs (Aromanians) of Herzegovina are considered authors of the famous funerary monuments with petroglyphs ( in Serbian) from Herzegovina and surrounding countries. The theory of the Vlach origin was proposed by Bogumil Hrabak (1956) and Marian WenzelMarian Wenzel, Bosnian and Herzegovinian Tombstobes-Who Made Them and Why?\" Sudost-Forschungen 21(1962): 102–143 and more recently was supported by the archeological and anthropological researches of skeleton remains from the graves under stećci. The theory is much older and was first proposed by Arthur Evans in his work Antiquarian Researches in Illyricum (1883). While doing research with Felix von Luschan on stećak graves around Konavle, he found that a large number of skulls were not of Slavic origin but similar to older Illyrian and Arbanasi tribes, as well as noting that Dubrovnik memorials recorded those parts inhabited by the Vlachs until the 15th century.Mužić, Ivan (2009). \"Vlasi i starobalkanska pretkršćanska simbolika jelena na stećcima\". Starohrvatska prosvjeta (in Croatian). Split: Museum of Croatian Archaeological Monuments. III (36): 315–349.", "In medieval times, the Aromanians populated Herzegovina and elevated famous necropolises with petroglyphs (Radimlja, Blidinje, etc.).Marian Wenzel, Bosnian and Herzegovinian Tombstobes-Who Made Them and Why?\" Sudost-Forschungen 21(1962): 102–143. The Aromanians, known as Cincari (Цинцари), migrated to Serbia in the 18th and early 19th centuries. They most often were bilingual in Greek, and were often called \"Greeks\" (Grci). They were influential in the forming of Serbian statehood, having contributed with rebel fighters, merchants and intellectuals. Many Greek Aromanians (Грко Цинцари) came to Serbia with Alija Gušanac as krdžalije (mercenaries) and later joined the Serbian Revolution (1804–1817). Some of the notable rebels include Konda Bimbaša and Papazogli. Among the notable people of Aromanian descent are playwright Jovan Sterija Popović (1806–1856), novelist Branislav Nušić (1864–1938), and politician Vladan Đorđević (1844–1930)."]}, {"page": "2002 in the United Kingdom", "response": ["*6 January – Marian Wenzel, art historian (born 1932)"]}, {"page": "1932 in the United Kingdom", "response": ["* 18 December – Marian Wenzel, art historian (died 2002)"]}, {"page": "Stećak", "response": ["The chronology established by Marian Wenzel assumes they developed from the plate headstones, the oldest one dating back to 1220 (the first were probably erected sometime in the mid-12th century), the monumental ones emerged somewhere around 1360, those with visual representations around 1435–1477, and that total production ended circa 1505. However, some consider that it lasted until the late 16th century, with rare examples that continued until the 18th century. Stećci in the form of chest (sanduk) and ridge/saddle-roofed (sljemenjak) do not seem to have appeared before the middle or the end of the 14th century (1353-1477), while the remaining two basic forms – the upright pillar (stup) and cross (krstača / križina), no earlier than mid-15th century. In the case of the latter, upright or standing forms could be influenced by the nišan – the upright monolithic stones on top of the Muslim (Turkish) graves, which had already emerged by the end of the 14th century in conquered parts of Macedonia and Serbia. This form is predominantly found in Serbia and Eastern Bosnia.", "Since the mid-20th century many scholars like Marian Wenzel, once the world's leading authority on the art and artifacts of medieval Bosnia and Herzegovina, concluded that the stećci tombstones were a common tradition amongst Catholic, Orthodox and Bosnian Church followers alike. Wenzel's conclusion supported other historians' claims that they reflect a regional cultural phenomenon rather than belonging to a particular religious faith. Sometime the inscriptions/motifs do reveal the confessional affiliation of necropolis/deceased to one of the three Church organizations in medieval Bosnia and Zachlumia. This interconfessionality of stećci is one of their most remarkable features, and indicates high degree of Christianization of medieval Bosnian community. However, it is considered that there is not enough basis to be perceived as exclusively Christian.", "The autochthonous Vlachian theory was proposed by Bogumil Hrabak (1956) and Marian Wenzel (1962), and more recently was supported by the archeological and anthropological researches of skeleton remains from the graves under stećci. However, the theory is much older and was first proposed by Arthur Evans in his work Antiquarian Researches in Illyricum (1883). While doing research with Felix von Luschan on stećak graves around Konavle found out that a large number of skulls weren't of Slavic origin yet similar to older Illyrian and Arbanasi tribes, as well noted that Dubrovnik memorials recorded those parts to be inhabited by the Vlachs until the 15th century.", "Since the second half of the 19th century, stećci are seen as a symbol of Bosnia and Herzegovina, being objects of South Slavic ideological ethno-national building myths and ownership, as well different opinions on their archaeological, artistic and historical interpretation. The breakup of Yugoslavia and Bosnian War (1992–1995) caused a resurgence of Bosnian, Croatian and Serbian nationalism, in which all three ethnic groups tried to appropriate them as part of their own culture exclusively. Paradoxically, none of these groups in Bosnia and Herzegovina, (Bosniaks, Bosnian Serbs and Bosnian Croats), originally remember them in their collective consciousness, leaving them to deteriorate in nature or to human carelessness and destruction which at least halved the number. This attitude alone implies how such appropriation is based on an ideological construct. According to Marian Wenzel one of the three pervasive ethno-national ideological constructs, specifically the thesis about Bogomil origin of stećci, dates as far back as the last decade of the 19th century when it has been put forward by Austria-Hungarian bureaucracy, namely by a member of the Hungarian parliament Janos von Asboth, in correlation with similar thesis on origin of Muslim inhabitants of Bosnia and Herzegovina as descendants of Bogomils. Such distortion of history will later attract criticism by scholars like Wenzel, who stated that through this particular example Austria-Hungarian authority practically delivered stećci \"as a gift to Muslims, emphasizing their inheritance rights to the land and implying that the later Christians, comparatively, were the 'newcomers'\". During the war of the 1990s this theory will again have its resurgence in media and public discourse, seeking historical-political legitimacy in which Islamization of local Bosnia and Herzegovina populace was not only caused by Ottoman occupation but also by ingrained religious idiosyncrasy, epitomized in Bogomilsm, thus affirming ethnic and confessional difference between Bogomil population and population of Catholic and Orthodox confession. However, it did not make a significant influence on scientific thinking or scholarship and comparative research in Bosnia and Herzegovina, nor elsewhere."]}, {"page": "List of alumni of The Courtauld Institute of Art", "response": ["* Marian Wenzel"]}, {"page": "Deaths in January 2002", "response": ["*Marian Wenzel, 69, British artist and art historian, leading authority on the art of medieval Bosnia and Herzegovina, cancer."]}, {"page": "Khalili Collection of Islamic Art", "response": ["Very few Islamic rings had been documented before Khalili published his collection of 618. Whereas some rings are purely decorative, many function as signet rings while others have religious inscriptions intended to give protection to the wearer. Art historian Marian Wenzel used the collection as the basis for a typology of Islamic rings. "]}]}}