{"wiki_id": "http://www.wikidata.org/entity/Q1300807", "itemLabel": "Sidney Abrahams", "itemDescription": "English long jumper and Chief Justice of Ceylon", "wikipedia_url": "https://en.wikipedia.org/wiki/Sidney_Abrahams", "wikipedia_page": {"main": "Sir Sidney Solomon Abrahams  (11 February 1885 – 14 May 1957), nicknamed Solly, was a British Olympic athlete and 26th Chief Justice of Ceylon (Sri Lanka). He was the older brother of famed Olympian Harold Abrahams.\n\n", "link_mentions": [{"page": "Harold Abrahams", "response": ["Abrahams's father, Isaac, was a Jewish immigrant from Polish Lithuania, then part of the Russian Empire since the Partitions of Poland. He worked as a financier, and settled in Bedford with his Welsh Jewish wife, Esther Isaacs. Harold was born in Bedford in 1899. His eldest brother was the physician Sir Adolphe Abrahams (1883 – 1967), the founder of British sport medicine. His middle brother was another British Olympic athlete,  long jumper Sir Sidney Abrahams (1885 – 1957)."]}, {"page": "List of Privy Counsellors (1936–1952)", "response": ["*Sir Sidney Abrahams (1885–1957)"]}, {"page": "Edward Stubbs", "response": ["On the same day there was a 50,000-strong rally at Galle Face Green, which was addressed by Dr N.M. Perera, Philip Gunawardena, and S.W.R.D. Bandaranaike, condemning Stubbs. Bracegirdle made a dramatic appearance on the platform at this rally, but the police were powerless to arrest him. They managed to arrest him a couple of days later, but a writ of habeas corpus was served and the case was called before a bench of three Supreme Court judges presided over by Chief Justice Sir Sidney Abrahams. The brilliant H.V. Perera, the county's leading civil lawyer, volunteered his services free on behalf of Bracegirdle; he was made a King's Counsel (KC) on the day that Bracegirdle appeared in court. On 18 May order was made that he could not be deported for exercising his right to free speech, and Bracegirdle was a free man."]}, {"page": "List of Asian Jews", "response": ["* Sidney Abrahams, Chief Justice"]}, {"page": "Bedford Modern School", "response": ["* Olympians: Charles Foulkes (field hockey bronze), John Yallop (rowing silver), Tim Foster (rowing gold), Thomas Hammond (track and field), Sir Sidney Abrahams (long jump), Hamilton Milton (swimming), Peter Knapp (rowing), John Yallop (rowing), Neil Keron (rowing), Rod Chisholm (rowing)"]}, {"page": "List of British Jews", "response": ["* Sir Sidney Abrahams, Britain, Olympic long jumper"]}, {"page": "List of Jews in sports", "response": ["* Sir Sidney Abrahams, Britain, Olympic long jumper"]}, {"page": "Mark Anthony Bracegirdle", "response": ["The police managed to arrest him a couple of days later at the Hulftsdorp residence of Vernon Gunasekera, the Secretary of the LSSP. However, the necessary legal preparations had been made. A writ of Habeas Corpus was served and the case was called before a bench of three Supreme Court judges presided over by Chief Justice Sir Sidney Abrahams. H.V. Perera, the county's leading civil lawyer, volunteered his services free on behalf of Bracegirdle; he was made a Kings Counsel (KC) on the day that Bracegirdle appeared in court. On 18 May order was made that he could not be deported for exercising his right to free speech, and Bracegirdle was a free man."]}, {"page": "Sri Lankan independence movement", "response": ["However, the police managed to arrest him a couple of days later at the Hulftsdorp residence of Vernon Gunasekera, the Secretary of the LSSP. However, the necessary legal preparations had been made. A writ of habeas corpus was served and the case was called before a bench of three Supreme Court judges presided over by Chief Justice Sir Sidney Abrahams. H. V. Perera, the county's leading civil lawyer, volunteered his services free on behalf of Bracegirdle; he was made a Queen's Counsel (QC) on the day that Bracegirdle appeared in court. On 18 May order was made that he could not be deported for exercising his right to free speech, and Bracegirdle was a free man."]}, {"page": "Great Britain at the 1912 Summer Olympics", "response": ["| Sidney Abrahams"]}, {"page": "Athletics at the 1912 Summer Olympics – Men's long jump", "response": ["| 12 ||align=left| Sidney Abrahams ||align=left| "]}, {"page": "Abrahams", "response": ["*Sidney Abrahams (1885–1957), British athlete and judge of law"]}, {"page": "Chief Justice of Sri Lanka", "response": ["| Sir Sidney Abrahams"]}, {"page": "List of English people", "response": ["* Sir Sidney Abrahams (1885–1957), Olympic long jumper"]}, {"page": "History of the Jews in Sri Lanka", "response": ["* Sir Sidney Abrahams, British-born Chief Justice."]}, {"page": "Sidney Solomon Abrahams", "response": ["#REDIRECT Sidney Abrahams"]}, {"page": "Sidney (given name)", "response": ["*Sidney Abrahams (1885–1957), British long jumper"]}, {"page": "Adolphe Abrahams", "response": ["Abrahams married Adrienne Walsh in 1922; they had a son and a daughter. He was the elder brother of the athletes Harold Abrahams CBE and Sir Sidney Abrahams KC.  He died on 11 December 1967."]}, {"page": "Philip James Macdonell", "response": ["Sir Phillip James Macdonell (10 January 1873 – 15 December 1940) was the 25th Chief Justice of Ceylon. He was appointed in 1931 succeeding Stanley Fisher and was Chief Justice until 1936. He was succeeded by Sidney Abrahams."]}, {"page": "Laurence George Bowman", "response": ["His daughter, born in 1894 as Ruth Bowman, in 1914 married Sidney Abrahams.‘ABRAHAMS, Rt Hon. Sir Sidney Solomon’, Who Was Who, A & C Black, an imprint of Bloomsbury Publishing plc, 1920–2016; online edn, Oxford University Press, 2014 ; online edn, April 2014 accessed 3 Oct 2017 They had two children, Valerie and Anthony Abrahams.‘ABRAHAMS, Anthony Claud Walter’, Who Was Who, A & C Black, an imprint of Bloomsbury Publishing plc, 1920–2016; online edn, Oxford University Press, 2016 ; online edn, April 2016 accessed 3 Oct 2017 As Lady Ruth Abrahams, she was also politically active in the Liberal Party. She stood for parliament on three occasions; Orpington in 1950, Nottingham East in 1951 and Wembley North in 1955.The Times House of Commons, 1950-55"]}]}}