{"wiki_id": "http://www.wikidata.org/entity/Q1318142", "itemLabel": "Alfred Burdon Ellis", "itemDescription": "British Army officer and ethnographer", "wikipedia_url": "https://en.wikipedia.org/wiki/Alfred_Burdon_Ellis", "wikipedia_page": {"main": "Alfred Burdon Ellis (1852–1894) was a British Army officer and ethnographer, known for his writings on West Africa.", "link_mentions": [{"page": "West India Regiments", "response": ["Eight West India Regiments were commissioned between 24 April and 1 September 1795. In addition to incorporating into the 1st West India Regiment the Carolina Corps that had been in existence since 1779, the original intention was both to recruit free blacks from the West Indian population and to purchase slaves from the West Indian plantations.The History of the First West India Regiment, Alfred Burdon Ellis, 1885, p. 26.Brian Dyde, The Empty Sleeve: The Story of the West India Regiments of the British Army, 1997, , p. 22. Between 1795 and 1808, an estimated 13,400 slaves were purchased for service in the West India Regiments at the cost of about £925,000. This constituted about 7% of the enslaved Africans imported into the British West Indies during this period. The eighth of the newly raised regiments (Skerrett's) was disbanded the following year but the quality of the new corps led to a further five West India Regiments being raised in 1798."]}, {"page": "Alfred Ellis", "response": ["* Alfred Burdon Ellis (1852–1894), British Army officer and ethnographer"]}, {"page": "List of names in A Biographical Dictionary of Modern Rationalists", "response": ["* Alfred Burdon Ellis"]}, {"page": "Royal Warrant of Precedence", "response": ["|Alfred Burdon Ellis (KCB)"]}, {"page": "Ashanti Empire", "response": ["Slavery was historically a tradition in the Ashanti Empire, with slaves typically taken as captives from enemies in warfare. The Ashanti Empire was not only the largest slaveowning state in the territory of today's Ghana but also the largest trader in the region to supply the Atlantic slave trade. The welfare of their slaves varied from being able to acquire wealth and intermarry with the master's family to being sacrificed in funeral ceremonies. The Ashanti believed that slaves would follow their masters into the afterlife. Slaves could sometimes own other slaves, and could also request a new master if the slave believed he or she was being severely mistreated.Alfred Burdon Ellis,"]}, {"page": "Christian Schiønning", "response": ["In 1811, during his term as governor, Schiønning was forced to pay a ransom of one hundred ounces of gold to the Empire of Ashanti for the release of the commandant of Fort Konigenstein, the Danish fort at Ada, who had helped Know Saffatchi, king of the Akwapim, escape from the army of Apoko, an Ashanti general under Asantehene Osei Bonsu.A History of the Gold Coast of West Africa, Alfred Burdon Ellis, page 124; London: Chapman & Hall, Id, 1893."]}, {"page": "A. B. Ellis", "response": ["#REDIRECT Alfred Burdon Ellis"]}, {"page": "Alfred Wilks Drayson", "response": [" at pp. 13–4 He was a younger brother of the novelist Caroline Agnes Drayson, and brother-in-law of the novelist John Richardson who married the second daughter Maria Caroline, and was born at Waltham Abbey where the factory was located. Another sister, Louisa, married Samuel Burdon Ellis as his second wife, and was mother of Alfred Burdon Ellis. The fourth surviving daughter, Helen Matilda, married Charles Davies in 1848. Further sisters were Emily (1811–1894), who married William Woods (died 1856) of Woolwich Dockyard; and Laurette, christened 1819.\"England, Essex Parish Registers, 1538-1997,\" database, FamilySearch (https://familysearch.org/ark:/61903/1:1:XK8M-358 : 12 December 2014), Laurette Drayson, 11 Jun 1819, Christening; citing Waltham-Abbey, Essex, England, Record Office, Chelmsford; FHL microfilm 1,526,972."]}, {"page": "Culture of the Ashanti Empire", "response": ["Slaves were typically taken as captives from enemies in warfare. The welfare of Ashanti slaves varied from being able to acquire wealth and intermarry with the master's family to being sacrificed in funeral ceremonies. The Ashanti sacrificed slaves upon the death of their masters. The Ashanti believed that slaves would follow their masters into the afterlife. Slaves could sometimes own other slaves, and could also request a new master for severe mistreatment.Slavery in the Asante Empire of West Africa, Mises InstituteAlfred Burdon Ellis,"]}]}}