{"wiki_id": "http://www.wikidata.org/entity/Q1319495", "itemLabel": "Julian Richings", "itemDescription": "English Canadian actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Julian_Richings", "wikipedia_page": {"main": "Julian Richings (born 8 September 1956) is a British-Canadian actor. He has appeared in over 50 films and 20 television series.\n\n", "link_mentions": [{"page": "2000 in film", "response": ["| The Claim || United Artists || Michael Winterbottom (director); Frank Cottrell Boyce (screenplay); Peter Mullan, Milla Jovovich, Wes Bentley, Nastassja Kinski, Sarah Polley, Julian Richings, Shirley Henderson, Sean McGinley, Tom McCamus, Barry Ward, Duncan Frasier || Romance || Live action"]}, {"page": "2003 in film", "response": ["| Wrong Turn || 20th Century Fox / Regency Enterprises || Rob Schmidt (director); Alan B. McElroy (screenplay); Desmond Harrington, Eliza Dushku, Emmanuelle Chriqui, Jeremy Sisto, Lindy Booth, Kevin Zegers, Julian Richings, Garry Robbins, Wayne Robson, David Huband, Ted Clark, Yvonne Gaudry, Joel Harris, James Downing || Horror || || Live Action", "| Open Range || Touchstone Pictures || Kevin Costner (director); Craig Storper, Lauran Paine (screenplay); Robert Duvall, Kevin Costner, Annette Bening, Michael Gambon, Michael Jeter, Diego Luna, James Russo, Abraham Benrubi, Dean McDermott, Kim Coates, Herbert Kohler Jr., Peter MacNeill, Cliff Saunders, Patricia Stutz, Julian Richings, Ian Tracey, Rod Wilson || Western || || Live Action", "| My Life Without Me || Sony Pictures Classics || Jean-Claude Larrieu (director); Isabel Coixet (screenplay); Sarah Polley, Scott Speedman, Mark Ruffalo, Deborah Harry, Jessica Amlee, Kenya Jo Kennedy, Amanda Plummer, Leonor Watling, Maria de Medeiros, Julian Richings, Alfred Molina || Drama, Romance || || Live Action"]}, {"page": "1995 in film", "response": ["| Moonlight and Valentino || Gramercy Pictures / PolyGram Filmed Entertainment || David Anspaugh (director); Ellen Simon (screenplay); Elizabeth Perkins, Gwyneth Paltrow, Kathleen Turner, Whoopi Goldberg, Jon Bon Jovi, Peter Coyote, Jeremy Sisto, Josef Sommer, Shadia Simmons, Erica Luttrell, Judah Katz, Julian Richings || Comedy, Drama || Live action"]}, {"page": "1997 in film", "response": ["| Mimic || Dimension Films / Miramax Films || Guillermo del Toro (director/screenplay); Matthew Robbins (screenplay); Mira Sorvino, Jeremy Northam, Josh Brolin, Charles S. Dutton, Giancarlo Giannini, F. Murray Abraham, Norman Reedus, Julian Richings, Doug Jones, Alexander Goodwin, Alix Koromzay, James Costa, Javon Barnwell || Sci-Fi, Horror || Live action"]}, {"page": "1998 in film", "response": ["| Cube || Trimark Pictures || Vincenzo Natali (director/screenplay); Andre Bijelic, Graeme Manson (screenplay); Nicole de Boer, Nicky Guadagni, David Hewlett, Andrew Miller, Julian Richings, Wayne Robson, Maurice Dean Wint || Sci-Fi, Horror || Live action", "| Urban Legend || TriStar Pictures / Original Film / Phoenix Pictures || Jamie Blanks (director); Silvio Horta (screenplay); Jared Leto, Alicia Witt, Rebecca Gayheart, Joshua Jackson, Loretta Devine, Tara Reid, Michael Rosenbaum, Robert Englund, Natasha Gregson Wagner, Danielle Harris, John Neville, Stephanie Anne Mills, Brad Dourif, Julian Richings || Horror || Live action"]}, {"page": "1999 in film", "response": ["| The Red Violin || Lions Gate Films || Francois Girard (director/screenplay); Don McKellar (screenplay); Jason Flemyng, Greta Scacchi, Don McKellar, Sylvia Chang, Samuel L. Jackson, Colm Feore, Carlo Cecchi, Irene Grazioli, Jean-Luc Bideau, Anita Laurenzi, Samuele Amighetti, Christoph Koncz, Clotilde Mollet, Arthur Denberg, Eva Marie Bryer, Joshua Bell, Tao Hong, Liu Zifeng, Han Xiaofei, Wang Xiaoshuai, Monique Mercure, Julian Richings, Sandra Oh, Remy Girard, Ireneusz Bogajewicz, Marvin Mill, Russell Yuen || Drama || Live action"]}, {"page": "1994 in film", "response": ["| Squanto: A Warrior's Tale || Walt Disney Pictures || Xavier Koller, Christopher Stoia (directors); Darlene Craviotto (screenplay); Adam Beach, Sheldon Peters Wolfchild, Irene Bedard, Eric Schweig, Leroy Peltier, Michael Gambon, Nathaniel Parker, Alex Norton, Mark Margolis, Julian Richings, Mandy Patinkin, Donal Donnelly, Stuart Pankin, Paul Klementowicz, Bray Poor, Tim Hopper, John Saint Ryan, John Dunn-Hill, Selim Running Bear Sandoval || Adventure, Drama || Live action"]}, {"page": "The Red Violin", "response": ["*Julian Richings – Nicolas Olsberg"]}, {"page": "Cube (1997 film)", "response": ["Cube is a 1997 Canadian independent science fiction horror film directed and co-written by Vincenzo Natali. A product of the Canadian Film Centre's First Feature Project, Nicole de Boer, Nicky Guadagni, David Hewlett, Andrew Miller, Julian Richings, Wayne Robson and Maurice Dean Wint star as individuals trapped in a bizarre and deadly labyrinth of cube-shaped rooms.", "* Julian Richings as Alderson, a prisoner and a mysterious character. He woke up in another room and never met the rest of the group. He is said to be in his 30s."]}, {"page": "My Life Without Me", "response": ["* Julian Richings as Dr. Thompson"]}, {"page": "Hard Core Logo", "response": ["Hard Core Logo is a 1996 Canadian mockumentary adapted by Noel Baker from the novel of the same name by author Michael Turner. The film was directed by Bruce McDonald and illustrates the self-destruction of punk rock. Released in 1996, the film documents a once-popular punk band, Hard Core Logo, comprising lead singer Joe Dick (Hugh Dillon), fame-tempted guitarist Billy Tallent (Callum Keith Rennie), schizophrenic bass player John Oxenberger (John Pyper-Ferguson), and drummer Pipefitter (Bernie Coulson). Julian Richings plays Bucky Haight, Dick's idol. Several notable punk musicians, including Art Bergmann, Joey Shithead and Joey Ramone, play themselves in cameos. Canadian television personality Terry David Mulligan also has a cameo, playing a fictionalized version of himself.", "*  Julian Richings as Bucky Haight"]}, {"page": "Kingdom Hospital", "response": ["* Julian Richings as Otto, the all-purpose man of Kingdom, who regularly watches the security feeds. Otto is accompanied by Blondi, an intelligent German Shepherd Dog. Blondi has on several occasions shown self-consciousness and actual thought capabilities; as an in-joke, he thinks in a German accent. Blondi's name is a reference to Adolf Hitler's favorite German Shepherd Dog, also named Blondi."]}, {"page": "War of the Worlds (1988 TV series)", "response": ["Whereas bacteria and radiation are constant problems for the aliens in the first season, the Morthren have quickly found a cure-all means for this by transmutating into human bodies. With this, they forwent the ability to possess human bodies, retaining only one human body. These bodies are, however, easily damaged; as seen in the series a single bullet wound is enough to cause the aliens' human form to break down, killing them. Their equivalent of body-swapping is a cloning machine that makes exact copies of someone, only differing in that the duplicates would be loyal to the Morthren cause and their existence tied to the original. Ironically, as sores are the telltale signs of alien possession in the first season, a lack of scars or any physical flaw was a telltale sign of a clone, as the Morthren are fixated with perfection. While the Eternal is their god, the Morthren are led by Malzor (played by Denis Forest, who had a large part in the Season 1 episode “Vengeance Is Mine”). Just under him was the scientist Mana (Catherine Disher, whose husband also played a major role in a Season 1 episode) with Ardix (Julian Richings who appeared briefly in “He Feedeth Among the Lillies”) as her assistant."]}, {"page": "Once a Thief (TV series)", "response": ["*Julian Richings as Mr. Camier, Murphy's partner."]}, {"page": "Mimic (film)", "response": ["* Julian Richings as Workman"]}, {"page": "Open Range (2003 film)", "response": ["* Julian Richings as Wylie"]}, {"page": "Wrong Turn (2003 film)", "response": ["*Julian Richings as Three Finger"]}, {"page": "The Crossing (2000 film)", "response": ["* Julian Richings as McKenzie "]}, {"page": "The Claim (2000 film)", "response": ["* Julian Richings as Frank Bellanger"]}, {"page": "The Last Casino", "response": ["The Last Casino (also known by its French title, La Mise Finale) is a 2004 French-language Canadian drama film about a card counting scheme.Canadian Feature Film Database. (2015). \"The Last Casino\", Retrieved on April 2, 2018. The film was produced by Greg Dummett, Lorraine Richard and Madeleine Henri, directed by Pierre Gill and written by Steven Westren. The Last Casino stars Charles Martin Smith as Barnes, Katharine Isabelle as Elyse, Kris Lemche as Scott, Julian Richings as Orr and Albert Chung as George.", "* Julian Richings as Orr"]}, {"page": "Cube (film series)", "response": ["| Julian Richings", "| Julian Richings"]}, {"page": "Fan Expo Canada", "response": ["| Neal Adams, Oluniké Adeliyi, Gillian Anderson, Kevin J. Anderson, Kelley Armstrong, Robert Bailey, Jamie Bamber, John Barrowman, Julie Benz, Jon Bernthal, Devon Bostick, Billy Burke, J. Scott Campbell, Greg Capullo, John Carpenter, Colleen Clinkenbeard, K. C. Collins, Amanda Conner, A. J. Cook, Monte Cook, Darwyn Cooke, Richard Crouse, Robin D. Laws, Tony Daniel, William B. Davis, Sergio Di Zio, Nelsan Ellis, Steve Epting, Lou Ferrigno, David Finch, Joe Flanigan, Sean Patrick Flanery, Ron Garney, Adi Granov, Ed Greenwood, Matthew Gray Gubler, Kris Holden-Ried, Alan Howarth, Rick Howland, Dale Keown, Juliet Landau, Robin Laws, Bob Layton, Stan Lee, Wendee Lee, Jeff Lemire, Christopher Lloyd, Francis Manapul, Michael Mando, J. P. Manoux, Jamie Marchi, James Marsters, Rose McGowan, Ed McGuinness, Steve McNiven, Jason Mewes, Vic Mignogna, Tony Moore, Kate Mulgrew, Trina Nishimura, Tom Noonan, Lisa Ortiz, Carlos Pacheco, David Paetkau, Zoie Palmer, Jimmy Palmiotti, Yanick Paquette, Dan Parent, David Prowse, Frank Quitely, Norman Reedus, John Rhys-Davies, Esad Ribić, Julian Richings, John A. Russo, Chris Sarandon, Anna Silk, Dan Slott, Kevin Smith, Ksenia Solo, Chris Sprouse, Amanda Tapping, J. Michael Tatum, Veronica Taylor, Jill Thompson, Tony Todd, Elias Toufexis, Alan Tudyk, Bob Tyrrell, Ethan Van Sciver, Nana Visitor, Billy West, Booker T, Brentalfloss. Surprise guest Sarah Wayne Callies (unannounced). Attending Casts from Arrow, Criminal Minds, Continuum, Flashpoint, Dead Before Dawn, Revolution (TV series), Lost Girl, A Little Bit Zombie, Todd and the Book of Pure Evil, among others."]}, {"page": "Dora Mavor Moore Award", "response": ["Past winners have included Salome Bey, Kawa Ada, John Alcorn, BirdLand Theatre, Michel Marc Bouchard, Valerie Buhagiar, Ronnie Burkett, Caroline Cave, Waawaate Fobister, Paul-André Fortier, David Hersey, Tomson Highway, Christopher House, Stuart Hughes, John Krizanc, Daniel MacIvor, Manitoba Theatre for Young People, Diego Matamoros, Neil Munro, Julian Richings, Roseneath Theatre, Tyley Ross, Djanet Sears, Denis Simpson, Michel Tremblay and Jonathan Wilson."]}, {"page": "The Silent Speaker", "response": ["Timothy Hutton is Archie Goodwin; Maury Chaykin is Nero Wolfe. Other members of the cast (in credits order) are Debra Monk (Mrs. Boone), Colin Fox (Fritz Brenner), Bill Smitrovich (Inspector Cramer), Cynthia Watros (Phoebe Gunther), Joe Flaherty (Dr. Vollmer), George Plimpton (Winterhoff), James Tolkan (FBI Agent Richard Wragg), Conrad Dunn (Saul Panzer), Fulvio Cecere (Fred Durkin), David Schurmann (Frank Erskine), Christine Brubaker (Hattie Harding), Bill MacDonald (Breslow), Matthew Edison (Edward Erskine), R.D. Reid (Sergeant Purley Stebbins), Nicky Guadagni (Mrs. Cramer/Secretary), Richard Waugh (Don O'Neill), Manon von Gerkan (Nina Boone), Julian Richings (Alger Kates), Robert Bockstael (Solomon Dexter), Gary Reineke (Hombert), Steve Cumyn (Skinner) and Doug Lennox (Inspector Ash)."]}, {"page": "The Tracey Fragments (film)", "response": ["* Julian Richings as Dr. Heker", "|style=\"text-align:center;\"| Julian Richings"]}, {"page": "The Tracey Fragments (novel)", "response": ["The 2007 paperback release of The Tracey Fragments, a media tie-in to the film adaptation, contained multiple pages of full-colour screenshots of the main featured actors including Elliot Page, Julian Richings and Slim Twig."]}, {"page": "Armageddon (convention)", "response": ["And TV/Movie Guests Nicholas Hoult (X-Men films, Warm Bodies), Tom Welling (Smallville, Lucifer), Amy Acker (The Gifted, Person of Interest, Angel), James Carpinello (Gotham), Julian Richings (Supernatural, 12 Monkeys), Amber Midthunder (Legion, Roswell, New Mexico), Tati Gabrielle, Adeline Rudolph, Abigail Cowen (Chilling Adventures of Sabrina), Aimee Garcia (Lucifer), Ray Wise (Reaper, Twin Peaks), Officers Mike Minogue and Karen O'Leary (Wellington Paranormal)."]}, {"page": "The Top of His Head", "response": ["*  Julian Richings as Robert (henchman)"]}, {"page": "22nd Genie Awards", "response": ["*Julian Richings, The Claim"]}, {"page": "The Pretender: Island of the Haunted", "response": ["* Julian Richings as Brother Clote "]}, {"page": "Squanto: A Warrior's Tale", "response": ["* Julian Richings as Sir George's Servant "]}, {"page": "Thrill Seekers (film)", "response": ["Thrill Seekers (also known as The Time Shifters) is a 1999 science fiction television film directed by  Mario Azzopardi and starring Casper Van Dien, Catherine Bell, Julian Richings and Martin Sheen. The film aired on October 17, 1999 on TBS.", "* Julian Richings as Murray Trevor, Time-Traveling Tourist  "]}, {"page": "List of English Canadians", "response": ["*Julian Richings, actor"]}, {"page": "List of Highlander cast members", "response": ["|valign=\"top\"|Julian Richings|| valign=\"top\"|Basil Morgan|| valign=\"top\"|\"Reborn\", \"Birthright\"|| valign=\"top\"|1998"]}, {"page": "Canadian Screen Award for Best Supporting Actor", "response": ["| Julian Richings"]}]}}