{"wiki_id": "http://www.wikidata.org/entity/Q1313905", "itemLabel": "Sarah Broadie", "itemDescription": "British historian of philosophy", "wikipedia_url": "https://en.wikipedia.org/wiki/Sarah_Broadie", "wikipedia_page": {"main": "Sarah Jean Broadie  (née Waterlow; 3 November 1941 – 8 August 2021) was a British philosopher, a Professor of Moral Philosophy and Wardlaw Professor at the University of St Andrews. Broadie specialised in ancient philosophy, with a particular emphasis on Aristotle and Plato. Her work engages with metaphysics and both ancient and contemporary ethics. She has achieved numerous honours throughout her career as an academic philosopher. Broadie studied Greats at Somerville College, Oxford, graduating in 1960. Previously she has worked at the University of Edinburgh, University of Texas at Austin, Yale, Rutgers, and Princeton.", "link_mentions": [{"page": "University of St Andrews", "response": ["*Sarah Broadie"]}, {"page": "List of philosophers born in the 20th century", "response": ["* Sarah Broadie (1941-2021)"]}, {"page": "Myles Burnyeat", "response": ["Concluding her 2012 laureation address, Professor Sarah Broadie noted of Burnyeat that:\"Above all, he is a paradigm to philosophers and classicists for combining formidable learning with first hand engagement in philosophy’s own concerns: principally its concerns with ethics and epistemology. His writings on the ancients take issue with such moderns as Russell, Moore, Wittgenstein, Descartes, Berkeley, and for that matter Ronald Dworkin. The aim – in which he has set and achieved the highest standards – isn’t simply to compare different specimens of the genus ‘philosopher’, but to open us up to the transformative toing and froing of philosophy as an on-going enterprise.\""]}, {"page": "Howison Lectures in Philosophy", "response": ["* 2014 — Sarah Broadie — \"The Theoretical Impulse in Plato and Aristotle\""]}, {"page": "List of Guggenheim Fellowships awarded in 1986", "response": ["| Sarah Broadie||||Philosophy"]}, {"page": "British Society for Ethical Theory", "response": ["*2012: University of Stirling. Keynotes: Sarah Broadie, Frances Kamm."]}, {"page": "List of honorary fellows of Somerville College, Oxford", "response": ["* Sarah Broadie"]}, {"page": "Broadie, Sarah", "response": ["#redirectSarah Broadie"]}, {"page": "List of Somerville College, Oxford, people", "response": ["*Sarah Broadie OBE FBA FRSE, professor at the University of St Andrews; specialises in ancient philosophy, with a particular emphasis on Aristotle and Plato"]}, {"page": "Sarah Waterlow Broadie", "response": ["#REDIRECT Sarah Broadie"]}, {"page": "Deaths in August 2021", "response": ["*Sarah Broadie, 79, British philosopher.Sarah Broadie (1941-2021)"]}, {"page": "2021 in philosophy", "response": ["*August 8 - Sarah Broadie, British philosopher specializing in ancient philosophy, metaphysics, and ethics."]}]}}