{"wiki_id": "http://www.wikidata.org/entity/Q1314450", "itemLabel": "Sir George Elliot, 1st Baronet", "itemDescription": "British politician (1814-1893)", "wikipedia_url": "https://en.wikipedia.org/wiki/Sir_George_Elliot,_1st_Baronet", "wikipedia_page": {"main": "Sir George Elliot, 1st Baronet, JP (18 March 1814 – 23 December 1893) was a mining engineer and self-made businessman from Gateshead in the North-East of England. A colliery labourer who went on to own several coal mines, he later bought a wire rope manufacturing company which manufactured the first Transatlantic telegraph cable. He was also a Conservative Party Member of Parliament (MP).", "link_mentions": [{"page": "West Rainton", "response": ["Saint Mary's church built 1864 has a  spire added in 1877 that is a prominent feature of the area visible for many miles. The spire was gifted by Sir George Elliot, 1st Baronet in memory of his daughter Elizabeth.  A large granite tablet was used to record this donation and was of special interest being taken from the Great Pyramid of Giza, obtained in 1876 with the permission of the Egyptian Khedive, Isma'il Pasha; Elliot was a financial adviser to the Khedive. The church is a substantial Grade II* listed building, able to seat 500 worshippers. It contains a reredos by Antonio Salviati. Previously an ancient chapel stood nearby."]}, {"page": "Shiney Row", "response": ["Shiney Row is a village in Houghton-le-Spring, Tyne and Wear, England. One of the most notable people who was born in Shiney Row is Sir George Elliot, 1st Baronet, owner of the factory that produced the first Transatlantic telegraph cable."]}, {"page": "George Elliot", "response": ["*Sir George Elliot, 1st Baronet (1814–1893), British businessman and Conservative Member of Parliament 1868–1880, 1886–1892"]}, {"page": "Elliot baronets", "response": ["*Sir George Elliot, 1st Baronet (1814–1893)"]}, {"page": "1893 in Wales", "response": ["*23 December – Sir George Elliot, 1st Baronet, MP and founder of the Elliot Home for Seamen in NewportSir George Elliot Bart MP Houghton Heritage Accessed 18 June 2016. 79"]}, {"page": "List of Conservative Party MPs (UK)", "response": ["*Sir George Elliot, 1st Baronet"]}, {"page": "1st Baronet of Penshaw", "response": ["#REDIRECT Sir George Elliot, 1st Baronet"]}, {"page": "1st Bt of Penshaw", "response": ["#REDIRECT Sir George Elliot, 1st Baronet"]}, {"page": "Alexander Mackenzie (civil servant)", "response": ["Mackenzie was twice married. His first wife from 1863 was Georgina Louisa Huntly Bremner (born 1838 India,FIBIS East India Register Birth Announcements, April 2009. and died 1892 Birmingham), youngest daughter of Colonel Bremner; and after her death he remarried as second wife in 1893 Mabel Elizabeth Elliot, youngest daughter of Ralph Elliot (1839–1874) and a granddaughter of Sir George Elliot, 1st Baronet. Lady Mackenzie survived him, and married another civil servant, the Hon. Noel Farrer, son of the 1st Baron Farrer.‘FARRER, Hon. Noel (Maitland)’, Who Was Who, A & C Black, an imprint of Bloomsbury Publishing plc, 1920–2007; online edn, Oxford University Press, December 2007 accessed 15 December 2013 With his second wife, he had two children:Debrett′s Peerage, Baronetage and Knightage, 1903"]}, {"page": "Sir George Elliot, 2nd Baronet", "response": ["Elliot was born at Houghton-le-Spring, the son of Sir George Elliot, 1st Baronet and his wife Margaret Green, daughter of George Green. His father had been MP for North Durham.Debretts House of Commons and the Judicial Bench 1881  Elliot was educated at Edinburgh and at Trinity College, Cambridge. He was an athletics blue in 1865 and 1866. He was the owner of a colliery."]}, {"page": "Edmund Mills Hann", "response": ["Hann's mining apprenticeship was served in County Durham.retrieved 7 January 2014 from Welsh Newspapers On line from the Aberdare Leader of 14 March 1914.  He was elected a member of the North of England Institute of Mining and Mechanical Engineers on 5 September 1868. He was then described as a Graduate member located at \"Hetton Colliery, Fencehouses\".Transactions North of England Institute of Mining Engineers Volume 18 1868–1869 report of meeting 5 September 1868 page 1. There are Hann's buried in the nearly Hillside Cemetery of Houghton-Le-Spring. His route to South Wales was via Sir George Elliot, 1st Baronet."]}, {"page": "Edward Fenwick Boyd", "response": ["Similar to the disaster at St Hilda’s, an explosion at Seaton Colliery on 9 June 1852 acted as a catalyst for the founding of the NEIMME. Leading figures such as Nicholas Wood, T.E. Forster, Sir George Elliot, 1st Baronet and Edward Sinclair (all of which were present at the inquest of the Seaton explosion) joined forty four coal owners and subsequently founded ‘The North of England Society for the Prevention of Accidents and for other Purposes Connected with Mining’. At a second meeting the society changed its name to the more pointed ‘The North of England Institute of Mining Engineers’ and it was not until 1870 when it opened its doors to Engineers that its title was adapted again to ‘The North of England Institute of Mining & Mechanical Engineers’. The aims of the society ultimately were to search for the causes of mining accidents exemplified at Seaton and St. Hilda’s, improve the ventilation of mines and to generally improve the safety and conditions of mines."]}, {"page": "George Elliot, 1st Baronet", "response": ["#REDIRECT Sir George Elliot, 1st Baronet"]}]}}