{"wiki_id": "http://www.wikidata.org/entity/Q132616", "itemLabel": "Naomi Watts", "itemDescription": "British actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Naomi_Watts", "wikipedia_page": {"main": "Naomi Ellen Watts (born 28 September 1968) is a British actress. She made her film debut in the Australian drama For Love Alone (1986) and then appeared in the Australian television series Hey Dad..! (1990), Brides of Christ (1991), Home and Away (1991), and the film Flirting (1991). After moving to the United States, Watts initially struggled as an actress, with roles in small-scale films, until she appeared in David Lynch's psychological thriller Mulholland Drive in 2001, playing an aspiring actress, by which she rose to international prominence.\nShe then played a tormented journalist in the horror remake The Ring (2002), and received a nomination for the Academy Award for Best Actress for her performance as a grief-stricken mother in Alejandro González Iñárritu's film 21 Grams (2003). Her profile continued to grow with starring roles in I Heart Huckabees (2004), King Kong (2005), Eastern Promises (2007), and The International (2009).\nFor her role as Maria Bennett in the disaster film The Impossible (2012), Watts received another Academy Award nomination for Best Actress. In the 2010s, she starred in such films as Birdman, St. Vincent (both 2014), While We're Young (2015),  The Glass Castle (2017), and Luce (2019). Watts also continued to act in blockbusters, with appearances in the Divergent franchise (2015–2016), and ventured into television with the Showtime mystery drama series Twin Peaks (2017) and the biographical limited series The Loudest Voice (2019).\nWatts is particularly known for her work in remakes and independent productions with dark or tragic themes, as well as portrayals of characters that endure loss or suffering. Magazines such as People and Maxim have included her on their lists of the world's most beautiful women. She has been an ambassador for Joint United Nations Programme on HIV/AIDS and Pantene's Beautiful Lengths. Despite significant media attention, Watts is reticent about her personal life. She was in a relationship with American actor Liev Schreiber from 2005 to 2016, with whom she has two sons.\n\n", "link_mentions": [{"page": "David Lynch", "response": ["The same year, Lynch approached ABC again with ideas for a television drama. The network gave Lynch the go-ahead to shoot a two-hour pilot for the series Mulholland Drive, but disputes over content and running time led to the project being shelved indefinitely. But with $7 million from the French production company StudioCanal, Lynch completed the pilot as a film, Mulholland Drive. The film, a non-linear narrative surrealist tale of Hollywood's dark side, stars Naomi Watts, Laura Harring and Justin Theroux. It performed relatively well at the box office worldwide and was a critical success, earning Lynch Best Director at the 2001 Cannes Film Festival (shared with Joel Coen for The Man Who Wasn't There) and Best Director from the New York Film Critics Association. He also received his third Academy Award nomination for Best Director. In 2016, the film was named the best film of the 21st century in a BBC poll of 177 film critics from 36 countries.", "With the rising popularity of the Internet, Lynch decided to use it as a distribution channel, releasing several new series he had created exclusively on his website, davidlynch.com, which went online on December 10, 2001. In 2002, he created a series of online shorts, DumbLand. Intentionally crude in content and execution, the eight-episode series was later released on DVD. The same year, Lynch released a surreal sitcom, Rabbits, about a family of humanoid rabbits. Later, he made his experiments with Digital Video available in the form of the Japanese-style horror short Darkened Room. In 2006, Lynch's feature film Inland Empire was released. At three hours, it is the longest of his films. Like Mulholland Drive and Lost Highway, it does not follow a traditional narrative structure. It stars Lynch regulars Laura Dern, Harry Dean Stanton and Justin Theroux, with cameos by Naomi Watts and Laura Harring as the voices of Suzie and Jane Rabbit, and a performance by Jeremy Irons. Lynch has called Inland Empire \"a mystery about a woman in trouble\". In an effort to promote it, he made appearances with a cow and a placard bearing the slogan \"Without cheese there would be no Inland Empire\".", "Lynch also tends to feature his leading female actors in \"split\" roles, so that many of his female characters have multiple, fractured identities. This practice began with his casting Sheryl Lee as both Laura Palmer and her cousin Maddy Ferguson in Twin Peaks and continued in his later works. In Lost Highway, Patricia Arquette plays the dual role of Renee Madison/Alice Wakefield; in Mulholland Drive Naomi Watts plays Diane Selwyn/Betty Elms and Laura Harring plays Camilla Rhodes/Rita; in Inland Empire Laura Dern plays Nikki Grace/Susan Blue. The numerous alternative versions of lead characters and fragmented timelines may echo and/or reference the many worlds interpretation of quantum physics and perhaps Lynch's broader interest in quantum mechanics. Some have suggested that Lynch's love for Hitchcock's Vertigo, which employs a split lead character (the Judy Barton and Madeleine Elster characters, both portrayed by Kim Novak) may have influenced this aspect of his work.", "Lynch is also widely noted for his collaborations with various production artists and composers on his films and other productions. He frequently works with Angelo Badalamenti to compose music for his productions, former wife Mary Sweeney as a film editor, casting director Johanna Ray, and cast members Harry Dean Stanton, Jack Nance, Kyle MacLachlan, Naomi Watts, Isabella Rossellini, Grace Zabriskie, and Laura Dern."]}, {"page": "Helen Gandy", "response": ["Gandy has been portrayed by actresses Lee Kessler in J. Edgar Hoover (1987), Naomi Watts in J. Edgar (2011), and Rebecca Toolan in Bad Times at the El Royale (2018)."]}, {"page": "Leslie Caron", "response": ["Caron returned to France in the early 1970s, which she later said was a mistake. \"They adore someone who's really British or really American\", Caron said, \"but somebody who's French and has made it in Hollywood – and I was the only one who had really made it in a big way – they can't forgive\". During the 1980s, she appeared in several episodes of the soap opera Falcon Crest as Nicole Sauguet. Caron is one of the few actresses from the classic era of MGM musicals who are still active in film — a group that includes Rita Moreno, Margaret O'Brien and June Lockhart. Caron's later credits include Funny Bones (1995) with Jerry Lewis and Oliver Platt; The Last of the Blonde Bombshells (2000) with Judi Dench and Cleo Laine; Chocolat (2000) and Le Divorce (2003), directed by James Ivory, with Kate Hudson and Naomi Watts."]}, {"page": "List of Buddhists", "response": ["* Naomi Watts, British-Australian actress and film producer"]}, {"page": "Mulholland Drive (film)", "response": ["Mulholland Drive (stylized as Mulholland Dr.) is a 2001 surrealist neo-noir mystery film written and directed by David Lynch and starring Naomi Watts, Laura Harring, Justin Theroux, Ann Miller, Mark Pellegrino, and Robert Forster. It tells the story of an aspiring actress named Betty Elms (Watts), newly arrived in Los Angeles, who meets and befriends an amnesiac woman (Harring) recovering from a car accident. The story follows several other vignettes and characters, including a Hollywood film director (Theroux).", "Lynch cast Naomi Watts and Laura Harring by their photographs. He called them in separately for half-hour interviews and told them that he had not seen any of their previous works in film or television. Harring considered it fateful that she was involved in a minor car accident on the way to the first interview, only to learn her character would also be involved in a car accident in the film. Watts arrived wearing jeans for the first interview, direct from the airplane from New York City. Lynch asked her to return the next day \"more glammed up\". She was offered the part two weeks later. Lynch explained his selection of Watts, \"I saw someone that I felt had a tremendous talent, and I saw someone who had a beautiful soul, an intelligence—possibilities for a lot of different roles, so it was a beautiful full package.\" Justin Theroux also met Lynch directly after his airplane flight. After a long flight with little sleep, Theroux arrived dressed all in black, with untidy hair. Lynch liked the look and decided to cast Adam wearing similar clothes and the same hairstyle.", "This interpretation was similar to what Naomi Watts construed, when she said in an interview, \"I thought Diane was the real character and that Betty was the person she wanted to be and had dreamed up. Rita is the damsel in distress and she's in absolute need of Betty, and Betty controls her as if she were a doll. Rita is Betty's fantasy of who she wants Camilla to be.\" Watts's own early experiences in Hollywood parallel those of Diane's. She endured some professional frustration before she became successful, auditioned for parts in which she did not believe, and encountered people who did not follow through with opportunities. She recalled, \"There were a lot of promises, but nothing actually came off. I ran out of money and became quite lonely.\" Michael Wilmington, writing for The Chicago Tribune found \"everything in \"Mulholland Drive\" is a nightmare. It's a portrayal of the Hollywood golden dream turning rancid, curdling into a poisonous stew of hatred, envy, sleazy compromise and soul-killing failure\", with noting that \"this is the underbelly of our glamorous fantasies, and the area Lynch shows here is realistically portrayed\".", "Media portrayals of Naomi Watts's and Laura Elena Harring's views of their onscreen relationships were varied and conflicting. Watts said of the filming of the scene, \"I don't see it as erotic, though maybe it plays that way. The last time I saw it, I actually had tears in my eyes because I knew where the story was going. It broke my heart a little bit.\"Dennis Hensley, \"Lust Highway\", Total Film 61 (February 2002): 72–74. However, in another interview Watts stated, \"I was amazed how honest and real all this looks on screen. These girls look really in love and it was curiously erotic.\" While Harring was quoted saying, \"The love scene just happened in my eyes. Rita's very grateful for the help Betty's given [her] so I'm saying goodbye and goodnight to her, thank you, from the bottom of my heart, I kiss her and then there's just an energy that takes us [over]. Of course I have amnesia so I don't know if I've done it before, but I don't think we're really lesbians.\"Lawrence Ferber, \"Sapphic Strangeness\", Watermark, October 11, 2001, 31. Heather Love agreed somewhat with Harring's perception when she stated that identity in Mulholland Drive is not as important as desire: \"who we are does not count for much—what matters instead is what we are about to do, what we want to do.\"", "Betty Elms (Naomi Watts) is the bright and talented newcomer to Los Angeles, described as \"wholesome, optimistic, determined to take the town by storm\", and \"absurdly naïve\".Amy Taubin, \"In Dreams,\" Film Comment 5, no. 37 (September 2001): 51–55. Her perkiness and intrepid approach to helping Rita because it is the right thing to do is reminiscent of Nancy Drew for reviewers.Roger Ebert, \"Mulholland Drive,\" Chicago Sun-Times, June 2001. Her entire persona at first is an apparent cliché of small-town naïveté. But it is Betty's identity, or loss of it, that appears to be the focus of the film. For one critic, Betty performed the role of the film's consciousness and unconscious. Watts, who modeled Betty on Doris Day, Tippi Hedren and Kim Novak, observed that Betty is a thrill-seeker, someone \"who finds herself in a world she doesn't belong in and is ready to take on a new identity, even if it's somebody else's\". This has also led one theorist to conclude that since Betty had naïvely, yet eagerly entered the Hollywood system, she had become a \"complicit actor\" who had \"embraced the very structure that\" destroyed her. In an explanation of her development of the Betty character, Watts stated:", "thumb|left|300px|alt=Naomi Watts and Laura Elena Harring arguing on two sides of an open door|An emotionally troubled Diane exchanges words with Camilla. Diane's scenes were characterized by different lighting to symbolize her physical and spiritual impoverishment.", "Since its release, Mulholland Drive has received \"both some of the harshest epithets and some of the most lavish praise in recent cinematic history\". On review aggregator website Rotten Tomatoes, the film has an approval rating of 84% based on 184 reviews, with an average rating of 7.62/10. The website's critical consensus reads, \"David Lynch's dreamlike and mysterious Mulholland Drive is a twisty neo-noir with an unconventional structure that features a mesmerizing performance from Naomi Watts as a woman on the dark fringes of Hollywood.\" On Metacritic, which assigns a normalized rating to reviews, the film has a weighted average score of 85 out of 100 based on 35 critics, indicating \"universal acclaim\".", "| Naomi Watts", "| Naomi Watts", "| Naomi Watts", "|rowspan=2| Naomi Watts"]}, {"page": "Nicole Kidman", "response": ["She initially studied at the Phillip Street Theatre in Sydney, alongside Naomi Watts who had attended the same high school. She also attended the Australian Theatre for Young People. Here, she took up drama, mime and performing in her teens, finding acting to be a refuge. Owing to her fair skin and naturally red hair, the Australian sun forced the young Kidman to rehearse in the halls of the theatre. A regular at the Phillip Street Theatre, she received praise and encouragement to pursue acting full time.", "In 1991, Kidman co-starred alongside Thandiwe Newton and former classmate Naomi Watts in the Australian independent film Flirting. They portrayed high school girls in this coming of age story, which won the Australian Film Institute Award for Best Film. That same year, her work in the film Billy Bathgate earned Kidman her first Golden Globe Award nomination, for Best Supporting Actress. The New York Times, in its film review, called her \"a beauty with, it seems, a sense of humor\". The following year, she and Cruise re-teamed for Ron Howard's Irish epic Far and Away (1992), which was a modest critical and commercial success. In 1993, she starred in the thriller Malice opposite Alec Baldwin and the drama My Life opposite Michael Keaton."]}, {"page": "Diana, Princess of Wales", "response": ["Actresses who have portrayed Diana include Serena Scott Thomas (in Diana: Her True Story, 1993), Julie Cox (in Princess in Love, 1996), Amy Seccombe (in Diana: A Tribute to the People's Princess, 1998), Michelle Duncan (in Whatever Love Means, 2005), Genevieve O'Reilly (in Diana: Last Days of a Princess, 2007), Nathalie Brocker (in The Murder of Princess Diana, 2007), Naomi Watts (in Diana, 2013), Jeanna de Waal (in Diana: The Musical, 2019 & 2021), Emma Corrin and Elizabeth Debicki (in The Crown, 2020 & 2022), and Kristen Stewart (in Spencer, 2021). In 2021, Corrin won a Golden Globe Award for her portrayal of the younger Diana Spencer."]}, {"page": "September 28", "response": ["*  1968   – Naomi Watts, English-Australian actress and producer"]}, {"page": "Twin Peaks", "response": ["Most of the original cast returns, including Kyle MacLachlan, Mädchen Amick, Sherilyn Fenn, Sheryl Lee, Ray Wise, and several others. Additions include Jeremy Davies, Laura Dern, Robert Forster, Tim Roth, Jennifer Jason Leigh, Amanda Seyfried, Matthew Lillard, and Naomi Watts."]}, {"page": "Woody Allen", "response": ["You Will Meet a Tall Dark Stranger, filmed in London, stars Antonio Banderas, Josh Brolin, Anthony Hopkins, Anupam Kher, Freida Pinto and Naomi Watts. Filming started in July 2009. It was released theatrically in the US on September 23, 2010, following a Cannes debut in May 2010, and a screening at the Toronto International Film Festival on September 12, 2010."]}, {"page": "Werner Herzog", "response": ["In 2011, Herzog competed with Ridley Scott for making a film based around the life of explorer Gertrude Bell. In 2012, it was confirmed that Herzog would start production on his long-in-development project in March 2013 in Morocco with Naomi Watts to play Gertrude Bell along with Robert Pattinson to play T. E. Lawrence and Jude Law to play Henry Cadogan. The film was completed in 2014 with a different cast: Nicole Kidman as Gertrude Bell, James Franco as Henry Cadogan, Damian Lewis as Charles Doughty-Wylie, and Robert Pattinson as a 22-year-old archaeologist T. E. Lawrence. Queen of the Desert had its world premiere at the 2015 Berlin International Film Festival."]}, {"page": "W. Somerset Maugham", "response": ["* The Painted Veil (2006), with Naomi Watts and Edward Norton.  Based on the novel of the same name."]}, {"page": "1968", "response": ["** Naomi Watts, British actress and film producer"]}, {"page": "Dustin Hoffman", "response": ["In 2009, Hoffman received an Honorary Cesar Medal at the César Awards. In 2012, Dustin Hoffman received Kennedy Center Honors, with the following commendation: \"Dustin Hoffman's unyielding commitment to the wide variety of roles he plays has made him one of the most versatile and iconoclastic actors of this or any other generation\". Those who honored him at the ceremony included Robert De Niro, Liev Schreiber, Naomi Watts, and Billy Connolly\"Dustin Hoffman, David Letterman, Natalia Makarova, Buddy Guy, Led Zeppelin Are Kennedy Center Honorees\" , by Andrew Gans, September 12, 2012"]}, {"page": "The Dark Side of the Moon", "response": ["Snippets of voices between and over the music are another notable feature of the album. During recording sessions, Waters recruited both the staff and the temporary occupants of the studio to answer a series of questions printed on flashcards.  The interviewees were placed in front of a microphone in a darkened Studio 3, and shown such questions as \"What's your favourite colour?\" and \"What's your favourite food?\", before moving on to themes more central to the album (such as madness, violence, and death).  Questions such as \"When was the last time you were violent?\", followed immediately by \"Were you in the right?\", were answered in the order they were presented. Roger \"The Hat\" Manifold proved difficult to find, and was the only contributor recorded in a conventional sit-down interview, as by then the flashcards had been mislaid.  Waters asked him about a violent encounter he had had with another motorist, and Manifold replied \"... give 'em a quick, short, sharp shock ...\" When asked about death he responded \"live for today, gone tomorrow, that's me ...\" Another roadie, Chris Adamson, who was on tour with Pink Floyd, recorded the snippet which opens the album: \"I've been mad for fucking years absolutely years\". The band's road manager Peter Watts (father of actress Naomi Watts) contributed the repeated laughter during \"Brain Damage\" and \"Speak to Me\".  His second wife, Patricia \"Puddie\" Watts (now Patricia Gleason), was responsible for the line about the \"geezer\" who was \"cruisin' for a bruisin used in the segue between \"Money\" and \"Us and Them\", and the words \"I never said I was frightened of dying\" heard halfway through \"The Great Gig in the Sky\"."]}, {"page": "Leonardo DiCaprio", "response": ["After playing demanding roles in Shutter Island and Inception, DiCaprio took a break from acting to have some time for himself. In 2011, he starred alongside Armie Hammer and Naomi Watts in Clint Eastwood's J. Edgar, a biopic about J. Edgar Hoover. The film focuses on the career of the FBI director from the Palmer Raids onward, including an examination of his private life as an alleged closeted homosexual. Critics felt that that the film lacked coherence overall but commended DiCaprio's performance. Roger Ebert praised DiCaprio's \"fully-realized, subtle and persuasive performance, hinting at more than Hoover ever revealed, perhaps even to himself\". Also in 2011, he produced Catherine Hardwicke's romantic horror film Red Riding Hood, very loosely based on the folk tale Little Red Riding Hood. Although it was poorly received by critics—Mary Pols of Time magazine named it one of the ten worst films of 2011—it had moderate box-office returns. He was also an executive producer for George Clooney's political drama The Ides of March, an adaptation of Beau Willimon's 2008 play Farragut North."]}, {"page": "Stand-in", "response": ["Stand-ins are distinguished from doubles, who replace actors on camera from behind, in makeup, or during dangerous stunts. Stand-ins do not appear on camera. However, on some productions the jobs of stand-in and double may be done by the same person. In rare cases, a stand-in will appear on screen, sometimes as an in-joke. For instance, the actress who pretends to be Ann Darrow in the stage show during the final act of King Kong (2005) is played by Naomi Watts' stand-in, Julia Walshaw."]}, {"page": "The Ring (2002 film)", "response": ["The Ring is a 2002 American supernatural horror film directed by Gore Verbinski from a screenplay by Ehren Kruger, starring Naomi Watts, Martin Henderson, David Dorfman, Brian Cox, and Daveigh Chase. It is a remake of Hideo Nakata's 1998 Japanese horror film Ring, based on Koji Suzuki's 1991 novel of the same name. Watts portrays a journalist who investigates a cursed videotape that seemingly kills the viewer seven days after watching it.", "On review aggregator website Rotten Tomatoes, the film has an approval rating of 71% based on 207 reviews, with an average rating of 6.60/10. The site's critics consensus reads, \"With little gore and a lot of creepy visuals, The Ring gets under your skin, thanks to director Gore Verbinski's haunting sense of atmosphere and an impassioned performance from Naomi Watts.\" Metacritic assigned the film a weighted average score of 57 out of 100, based on 36 critics, indicating \"mixed or average reviews\". Audiences polled by CinemaScore gave the film an average grade of \"B–\" on an A+ to F scale.", "|Naomi Watts"]}, {"page": "Jessica Lange", "response": ["In 2018, Lange was also honored with the Jason Robards Award for Excellence in Theater by the Roundabout Theater Company. Lange also reprised her role of Constance Langdon in American Horror Story: Apocalypse on episodes6 and10. Lange has been cast opposite Gwyneth Paltrow in the Netflix series The Politician. Lange is also lined up to star opposite Naomi Watts in Gia Coppola's second film, The Lonely Doll, adapted from Jean Nathan's memoir, The Search for Dare Wright: The Secret Life of the Lonely Doll, which chronicled the life of Dare Wright and her tempestuous relationship with her mother, Edith Stevenson Wright."]}, {"page": "Cinema of Australia", "response": ["George Miller's Babe (1995) employed new digital effects to make a barnyard come alive and went on to become one of Australia's highest-grossing films. The 1996 drama Shine achieved an Academy Award for Best Actor award for Geoffrey Rush and Gregor Jordan's 1999 film Two Hands gave Heath Ledger his first leading role. After Ledger's successful transition to Hollywood, Jordan and Ledger collaborated again in 2003, with Ledger playing the iconic bushranger title role in the film Ned Kelly, co-starring British actress Naomi Watts.", "* Naomi Watts"]}]}}