{"wiki_id": "http://www.wikidata.org/entity/Q132399", "itemLabel": "James Inglis", "itemDescription": "British man executed for murder", "wikipedia_url": "https://en.wikipedia.org/wiki/James_Inglis_(murderer)", "wikipedia_page": {"main": "James Inglis (c. 1922 – 8 May 1951) was a Scottish man executed for murder, at the age of 29.\nHaving confessed to strangling Alice Morgan, a 50-year-old woman who was working as a prostitute in Kingston upon Hull on 1 February 1951 after a quarrel over payment, Inglis opted to plead insanity at his trial. The jury did not believe his version of events, and on 20 April he was sentenced by Justice Ormerod to be hanged. He was gaoled at Strangeways Prison to await execution. Because Inglis did not appeal against his sentence, execution was scheduled to take place only three weeks after the trial ended (according to law, after the passage of three Sundays).On the morning of 8 May 1951, the executioner, Albert Pierrepoint and his assistant, Syd Dernley, escorted Inglis from his cell to the gallows immediately adjacent, and hanged him without delay. This was the fastest British hanging on record, taking just seven seconds from the time that Inglis was removed from his cell to the moment that the trapdoor opened.  Dernley later related that Inglis practically ran to his execution, following the prison guard's advice to go quickly and \"without fuss\".\nInglis's execution is featured in the 2006 film Pierrepoint; although Inglis's name is not mentioned, the character \"Markovsky\" was supposed to represent him.", "link_mentions": [{"page": "HM Prison Manchester", "response": ["Twenty-nine hangings took place over the next twenty years and 71 took place in the 20th century, bringing the total number to 100. During the second half of the century, the number of executions decreased, with no hangings between 1954 and 28 November 1962, when James Smith was executed. John Robson Walby (alias Gwynne Owen Evans), one of the last two people to be hanged in England, was executed here on 13 August 1964. Out of the 100 hangings, four were double hangings, while the rest were done individually. The \"quickest hanging\" of James Inglis, in seven seconds, carried out by Albert Pierrepoint, took place here.", "| 8 May 1951 || James Inglis || murder of Aice Morgan", "* James Inglis, the world's fastest hanging."]}, {"page": "Syd Dernley", "response": ["In 1950, he assisted Albert Pierrepoint in the hanging of the innocent Timothy Evans for the murder of his family, although John Christie (who was himself executed by Pierrepoint in 1953) committed the murders. On 8 May 1951, Pierrepoint and Dernley escorted convicted murderer James Inglis to the gallows immediately adjacent, and hanged him without delay — the fastest hanging on record, taking only seven seconds from the time his cell door was opened until his fatal 'long drop'."]}, {"page": "Locations of executions conducted by Albert Pierrepoint", "response": ["* James Inglis, on 8 May 1951, the fastest hanging on record a total of seven seconds elapsed from the time that Inglis left the Condemned Cell."]}, {"page": "Alice Morgan", "response": ["*Alice Morgan (–1951), British woman murdered by James Inglis"]}, {"page": "James Inglis", "response": ["*James Inglis (evangelist) (1813–1872), American preacher and editor", "*James Inglis (murderer) (1922–1951), Scottish man executed for murder", "*James Inglis (physician) (1813–1851), Scottish physician, author and geologist", "*James Inglis (politician) (1845–1908), writer and politician in colonial New South Wales", "*James Inglis, of the Inglis baronets", "*James Inglis (rugby union) (born 1986), English rugby union player for Harlequins", "*James Inglis (tailor), Scottish tailor who served James VI of Scotland"]}, {"page": "Inglis (surname)", "response": ["*Colin James Inglis (1928–2005), English Chief Scout", "*James Inglis (physician) (1813-1851), Scottish physician, author and geologist", "*James Inglis  (c. 1922–1951), Scottish murderer"]}, {"page": "Inglis, James", "response": ["#REDIRECT James Inglis (murderer)"]}, {"page": "James Inglis (criminal)", "response": ["#REDIRECT James Inglis (murderer)"]}]}}