{"wiki_id": "http://www.wikidata.org/entity/Q1321745", "itemLabel": "Tom Pocock", "itemDescription": "British writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Tom_Pocock", "wikipedia_page": {"main": "Thomas Allcot Guy Pocock, writing under the name Tom Pocock, (18 August 1925, London – 7 May 2007, London) was an English biographer, war correspondent, journalist and naval historian.", "link_mentions": [{"page": "Mervyn Peake", "response": ["A book of nonsense poems, Rhymes Without Reason, was published in 1944 and was described by John Betjeman as \"outstanding\". Shortly after the war ended in 1945, Edgar Ainsworth, the art editor of Picture Post, commissioned Peake to visit France and Germany for the magazine. With writer Tom Pocock he was among the first British civilians to witness the horrors of the Nazi concentration camp at Belsen, where the remaining prisoners, too sick to be moved, were dying before his very eyes. He made several drawings, but not surprisingly he found the experience profoundly harrowing, and expressed in deeply felt poems the ambiguity of turning their suffering into art."]}, {"page": "Master and Commander", "response": ["Several UK press reviewers were also impressed. The Sunday Mirror said \"Nothing is glamourised. The press gangings, the squalor are all here....The battle scenes are tremendous...This is not secondhand Forester, but a really fine piece of writing\",Sunday Mirror, 18 January 1970, quoted in  while Benedict Nightingale writing in The Observer called the book \"Dashing, well-timbered, pickled in the period, and with strong human tensions and cross-currents\".Nightingale, Benedict, Observer, 18 January 1970, quoted in  According to Tom Pocock in The Evening Standard \"It is as though, under Mr O'Brian's touch, those great sea-paintings at Greenwich had stirred and come alive\".Pocock, Tom, London Evening Standard, 20 January 1970, quoted in "]}, {"page": "Andreas Hofer", "response": ["Andreas Hofer was executed by a firing squad on February 20, 1810. He refused a blindfold or to kneel, and gave money to a corporal in charge, telling him to \"shoot straight\". He gave the order to fire himself.Tom Pocock. Stopping Napoleon: War and Intrigue in the Mediterranean (Kindle Locations 2357-2359). Thistle Publishing. Kindle Edition. Hofer became a martyr in Germany and Austria and a rallying symbol against the power of Napoleon.", "* Tom Pocock - Stopping Napoleon (2004)"]}, {"page": "Pocock", "response": ["*Tom Pocock (1925–2007), British naval historian"]}, {"page": "Alan Moorehead", "response": ["*Tom Pocock. Alan Moorehead. London: The Bodley Head, 1990."]}, {"page": "Mountbatten Maritime Prize", "response": ["* 2004 Tom Pocock, Stopping Napoleon - War and Intrigue in the Mediterranean"]}, {"page": "Horatia Nelson", "response": ["*Tom Pocock, Nelson's Women, Andre Deutsch, 1999, chapters 10 and 11"]}, {"page": "Sailor King", "response": ["** Sailor King: The Life of King William IV by Tom Pocock"]}, {"page": "Thomas Pocock", "response": ["* Tom Pocock (1925–2007), English biographer, war correspondent, journalist and naval historian"]}, {"page": "Index of World War II articles (T)", "response": ["# Tom Pocock"]}, {"page": "1805 Club", "response": ["* Nelson and the Campaign in Corsica, by Tom Pocock. "]}, {"page": "Horatio Nelson, 1st Viscount Nelson", "response": ["Nelson returned briefly to Merton to set his affairs in order, and bid farewell to Emma, before travelling back to London and then on to Portsmouth; arriving there early on the morning of 14 September. He breakfasted at the George Inn with his friends George Rose, the Vice-President of the Board of Trade, and George Canning, the Treasurer of the Navy. During the breakfast, word spread of Nelson's presence at the inn and a large crowd of well-wishers gathered. They accompanied Nelson to his barge and cheered him off, which Nelson acknowledged by raising his hat. He was recorded as having turned to his colleague and stated: \"I had their huzzas before; I have their hearts now.\"Nicolas, The Despatches and Letters of Lord Nelson, Vol, VII p. 35 idem p. 36Tom Pocock, Horatio Nelson p. 316Hibbert 1994, p. 356 Robert Southey reported on the onlookers for Nelson's walk to the dock: \"Many were in tears and many knelt down before him and blessed him as he passed.\"Southey 1922, The Life of Nelson, (1922 edition) p. 296"]}]}}