{"wiki_id": "http://www.wikidata.org/entity/Q1321301", "itemLabel": "Clint Hill", "itemDescription": "professional footballer (born 1978)", "wikipedia_url": "https://en.wikipedia.org/wiki/Clint_Hill_(footballer)", "wikipedia_page": {"main": "Clinton Scott Hill (born 19 October 1978) is an English former professional footballer who played as a defender. He is currently assistant manager of National League side Stockport County.\nHill began his career with local side Tranmere Rovers in 1997. He broke into the first team and became a regular as Rovers reached the League Cup final in 2000. Hill was sent-off however as Tranmere lost 2–1. He remained at Prenton Park until 2002 when he joined Oldham Athletic and after impressing there he was signed by Championship side Stoke City. His first season with Stoke was cut down due to injuries which hampered his time at the club. He left for Crystal Palace after making 84 appearances for Stoke in five years.\nAt Palace he played well despite the club struggling financially and when manager Neil Warnock joined Queens Park Rangers Hill followed him in July 2010. In his first season at Loftus Road QPR won the Championship and gained promotion to the Premier League. They went on to ensure survival on the final day of the season, Hill winning the supporters player of the year award for his performances this despite playing 25 matches and also spending a short time on loan at Nottingham Forest.", "link_mentions": [{"page": "Tranmere Rovers F.C.", "response": ["In the 1999–2000 season, despite severe financial constraints, victories over a succession of Premiership sides led not only to a place in the sixth round of the FA Cup but a place in the 2000 Football League Cup Final against Leicester City – the first time Rovers had ever reached a major final. Matt Elliott scored Leicester's opening goal, before Tranmere's Clint Hill was sent off for a second bookable offence. Despite being reduced to ten men, David Kelly equalised; but Elliot soon netted Leicester's second goal and Tranmere lost the match 2–1. It was the last League Cup game to be played at the original Wembley stadium."]}, {"page": "Huyton", "response": ["*Clint Hill footballer."]}, {"page": "Stockport County F.C.", "response": ["| Assistant Manager|| Clint Hill"]}, {"page": "John Aldridge", "response": ["Tranmere were involved in some memorable runs and giant-killing acts in cup competitions, including reaching the 2000 Football League Cup Final (which they lost to Leicester City) and consecutive FA Cup quarter-finals in 2000 and 2001. During the 2000 League Cup Final, Aldridge slapped the face of Leicester's Theo Zagorakis after he applauded the referee's decision to send off Clint Hill. The slap was seen by FA officials and he was charged with misconduct; Aldridge said about the slapping incident: \"I felt he [Zagorakis] had disrespected Clint on one of the biggest occasions of his career so I slapped him\". Tranmere were relegated into English football's third tier in 2001. Aldridge resigned in March 2001 just before Rovers went down, and almost 20 years on has not returned to management."]}, {"page": "Julián Speroni", "response": ["Ahead of the 2008–09 season, Speroni reverted to wearing his number one shirt, which he kept throughout his Crystal Palace's career. Speroni continued to be the club's first choice goalkeeper despite facing competition from Darryl Flahavan. At the start of the 2008–09 season, he continued to stand out as Crystal Palace's key players despite the club's poor start. He helped Crystal Palace keep three consecutive clean sheets between 30 September 2008 and 18 October 2008. Speroni started in every match until he missed one match, due to a leg injury sustained during a 2–0 win against Coventry City on 8 November 2008. Despite missing one match and facing risk over his return from a leg injury, Speroni returned to the starting line–up from injury against Bristol City on 22 November 2008 and helped the club win 4–2.} Since his return from injury, he helped Crystal Palace go on an eight match unbeaten run between 22 November 2008 and 26 December 2008. Speroni continued to regain his first team place as the club's first choice goalkeeper for the rest of the 2008–09 season. During a 1–0 loss against Southampton on 13 April 2009, he suffered a gash on his face in the 80th minute of the match that required him stitches and had Clint Hill stand by in goal for the rest of the match, with all three substitutes were used. But Speroni quickly recovered from injury, returning to the starting line–up against Derby County on 18 April 2009 and helped Crystal Palace keep a clean sheet, in a 1–0 win. At the end of the 2008–09 season, he went on to make forty–eight appearances in all competitions. For the second time in a row, Speroni was named the club's \"Player of the Year\" award."]}, {"page": "Nedum Onuoha", "response": ["Onuoha scored his first goal for the club on 3 August 2013, against Sheffield Wednesday, in the opening fixture of the 2013–14 season. He then quickly regained his first team place, playing in the centre–back position. He then helped the side keep four clean sheets throughout August and mid–September. However, during a 1–0 win over Brighton & Hove Albion on 18 September 2013, Onuoha suffered a hamstring injury and was sidelined for two months. It wasn't until on 9 November 2013 that he made his return from injury, coming on as a second-half substitute, in a 1–1 draw against Reading. However, his return was short–lived when Onuoha was sidelined once again with a hamstring injury. But he made his return three weeks later on 14 December 2013, coming on as a second-half substitute, in a 2–0 win over Blackpool. After returning, Onuoha found himself in and out of the first team for the next two months, as he was placed on the substitute bench in a number of matches, due to Richard Dunne and Clint Hill being preferred as the first choice centre–backs, before returning to the starting eleven permanently for the remaining matches of the 2013–14 season. This continued despite suffering from injuries along the way. Onuoha then scored on his return from injury, in a 5–2 win over Nottingham Forest on 12 April 2014. In the Championship play-offs, Onuoha played in both legs against Wigan Athletic, as they won 2–1 on aggregate. He was a member of the Queens Park Rangers side which won the 2014 Championship play-off Final 1–0 against Derby County on 24 May 2014 at Wembley Stadium. At the end of the 2013–14 season, Onuoha went on to make thirty–one appearances, scoring two times in all competitions."]}, {"page": "Danny Higginbotham", "response": ["Higginbotham joined Southampton's Championship rivals Stoke City on 3 August 2006 for an initial £225,000 fee, and quickly cemented a regular place in Tony Pulis's starting line-up. He began 2006–07 at left-back, but soon established himself at centre-back after initially filling in for Clint Hill following Hill's sending off at Wolverhampton Wanderers on 23 September 2006. Pulis gave Stoke a reputation as a \"Battersea Dogs Home\" club, and Higginbotham proved to be a typical signing in this regard as he felt unwanted at Southampton and said that his career had been reinvigorated by the move to the Britannia Stadium. Stoke went seven games without conceding a goal, and during this run Higginbotham scored the only goal of the game against local rivals West Bromwich Albion after deposing Carl Hoefkens as the club's penalty taker. In February 2007, he was awarded the club captaincy following Michael Duberry's departure to Reading. Over the course of the season he scored a career-high seven goals in his 46 appearances. Though Stoke narrowly missed out on the play-offs, a successful personal campaign culminated in Higginbotham being voted the club's Player of the Year."]}, {"page": "Shaun Derry", "response": ["Derry departed from Selhurst Park at the end of the season to reunite with Warnock at his new club Queens Park Rangers signing a two-year contract, on a free transfer, after his contract at Palace had expired. On 21 March 2012 Derry scored his first league goal for the club, and his only in the Premier League, in the 3–2 win over Liverpool. Derry, alongside his former Crystal Palace teammate Clint Hill, won much respect from QPR fans for his tireless work ethic and leadership on the pitch throughout the Championship title-winning season and the subsequent 2 years in the Premier League."]}, {"page": "Leon Cort", "response": ["He joined Crystal Palace in the summer of 2006 before joining Stoke City in October 2007 in a swap deal with Clint Hill. Cort formed a strong defensive partnership with Ryan Shawcross at the Britannia Stadium as Stoke gained promotion to the Premier League. Cort was unable to hold on to his place in the top flight and joined Burnley in January 2010 for a fee of £1.5 million. He then had a short loan spell with Preston North End before ending his career at Charlton Athletic."]}, {"page": "Andy Mangan", "response": ["On 22 February 2021, Mangan followed Barton and Clint Hill from Fleetwood to Bristol Rovers, taking on the role as a first-team coach. "]}]}}