{"wiki_id": "http://www.wikidata.org/entity/Q1333440", "itemLabel": "Eric Campbell", "itemDescription": "British actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Eric_Campbell_(actor)", "wikipedia_page": {"main": "Alfred Eric Campbell (26 April 1879 – 20 December 1917), was a Scottish actor. He was a key member of Charlie Chaplin's film ensemble, invariably playing an intimidating bully, and appeared in eleven of Chaplin's films before he was killed in a car crash at the age of 38. He is the subject of a documentary by filmmaker Kevin Macdonald.\n\n", "link_mentions": [{"page": "April 26", "response": ["*1879 – Eric Campbell, British actor (d. 1917)"]}, {"page": "Charlie Chaplin", "response": ["Mutual gave Chaplin his own Los Angeles studio to work in, which opened in March 1916. He added two key members to his stock company, Albert Austin and Eric Campbell, and produced a series of elaborate two-reelers: The Floorwalker, The Fireman, The Vagabond, One A.M., and The Count. For The Pawnshop, he recruited the actor Henry Bergman, who was to work with Chaplin for 30 years. Behind the Screen and The Rink completed Chaplin's releases for 1916. The Mutual contract stipulated that he release a two-reel film every four weeks, which he had managed to achieve. With the new year, however, Chaplin began to demand more time. He made only four more films for Mutual over the first ten months of 1917: Easy Street, The Cure, The Immigrant, and The Adventurer. With their careful construction, these films are considered by Chaplin scholars to be among his finest work. Later in life, Chaplin referred to his Mutual years as the happiest period of his career. However, Chaplin also felt that those films became increasingly formulaic over the period of the contract, and he was increasingly dissatisfied with the working conditions encouraging that."]}, {"page": "1917", "response": ["* December 20 – Eric Campbell, Scottish actor (accident) (b. 1879)"]}, {"page": "The Immigrant (1917 film)", "response": ["The Immigrant is a 1917 American silent romantic comedy short. The film stars Charlie Chaplin's Tramp character as an immigrant coming to the United States who is accused of theft on the voyage across the Atlantic Ocean and falls in love with a beautiful young woman along the way. It also stars Edna Purviance and Eric Campbell.", "* Eric Campbell - The head waiter", "thumb|right|The huge waiter (played by Eric Campbell) glowers at the immigrant (Charlie Chaplin). To his right are Edna Purviance playing another immigrant and Henry Bergman as a bearded artist.", "This plot was abandoned almost immediately, before Chaplin's character was introduced, the documentary states, and Chaplin began again, with a story, still set in a cafe, about a man who has never been in a restaurant before displaying terrible table manners before meeting a lovely girl (Purviance) and shaping up. Initially, Henry Bergman played the bully-ish head waiter, but Chaplin eventually replaced him with Eric Campbell."]}, {"page": "Oliver Hardy", "response": ["The next year, he made his first movie, Outwitting Dad (1914), for the Lubin studio, billed as O. N. Hardy. In his personal life, he was known as \"Babe\" Hardy and was billed as \"Babe Hardy\" in many of his later films at Lubin, such as Back to the Farm (1914). He was a big man, standing 6 feet 1 inch (1.85 m) and weighing up to 300 pounds ( kg), and his size placed limits on the roles that he could play. He was most often cast as the villain, but he also had roles in comedy shorts, his size complementing the character. By 1915, Hardy had made 50 short one-reel films at Lubin. He moved to New York and made films for the Pathé, Casino and Edison Studios. He returned to Jacksonville, where he made films for the Vim Comedy Company. That studio closed after Hardy discovered that the owners were stealing from the payroll. He then worked for the King Bee studio, which bought Vim, and worked with Billy Ruge, Billy West (a Charlie Chaplin imitator), and comedic actress Ethel Burton Palmer. He continued playing the villains for West well into the early 1920s, often imitating Eric Campbell to West's Chaplin."]}, {"page": "1917 in film", "response": ["* December 20 – Eric Campbell, 38, Scottish actor, The Immigrant, Behind the Screen, The Count, Easy Street, The Adventurer(short), The Cure(short)"]}, {"page": "List of people who died in traffic collisions", "response": ["| align=\"left\"| Eric Campbell"]}, {"page": "Angelus-Rosedale Cemetery", "response": ["* Eric Campbell (1879–1917), actor"]}, {"page": "Behind the Screen", "response": ["Behind the Screen is a 1916 American silent short comedy film written by, directed by, and starring Charlie Chaplin, and also starring Eric Campbell and Edna Purviance. The film is in the public domain.", "The film takes place in a silent movie studio. Charlie Chaplin plays stagehand named David who has an enormous supervisor named Goliath (Eric Campbell). David is overworked but is still labelled as a loafer by the lazy Goliath and his supervisor. A country girl (Edna Purviance) arrives at the studio in hopes of becoming an actress, but is quickly turned away by Goliath. Most of the other stagehands go on wildcat strike to protest their sleep being interrupted during their lunch break. Only David and Goliath remain on the job.The girl returns and stealthily dresses in one of the striking stagehand's work clothes. Disguised as a man, she gets a job as a stagehand too. David discovers that the new stagehand is actually a female. When he gives her a series of quick kisses, the action is seen by Goliath who makes effeminate gestures at David. Edna overhears the strikers' plans to blow up the studio with dynamite and helps thwart their villainous plot.", "* Eric Campbell as Goliath (a stagehand)"]}, {"page": "Norio Wakamoto", "response": ["| The Cure || The Man with the Gout || Eric Campbell || 2014 Star Channel edition || ", "| The Rink || Mr. Stout || Eric Campbell || 2014 Star Channel edition || "]}, {"page": "Eric Campbell", "response": ["Eric Campbell may refer to:", "* Eric Campbell (actor) (1880–1917), Scottish silent film star", "* Eric Campbell (baseball) (born 1987), American baseball player", "* Eric Campbell (basketball) (born 1977), American basketball player", "* Eric Campbell (political activist) (1893–1970), Australian political activist, leader of the New Guard Fascist movement", "* Eric Campbell (reporter), Australian foreign correspondent ", "* Eric Campbell Geddes (1875–1937), British Conservative politician"]}, {"page": "Kevin Macdonald (director)", "response": ["* Chaplin's Goliath (1996), about the actor Eric Campbell"]}, {"page": "The Pawnshop", "response": ["The Pawnshop was Charlie Chaplin's sixth film for Mutual Film Corporation. Released on October 2, 1916, it stars Chaplin in the role of assistant to the pawnshop owner, played by Henry Bergman. Edna Purviance plays the owner's daughter, while Albert Austin appears as an alarm clock owner who watches Chaplin in dismay as he dismantles the clock; the massive Eric Campbell's character attempts to rob the shop.", "*Eric Campbell: Thief"]}, {"page": "The Floorwalker", "response": ["The Floorwalker is a 1916 American silent comedy film, Charlie Chaplin's first Mutual Film Corporation film. The film stars Chaplin, in his traditional Tramp persona, as a customer who creates chaos in a department store and becomes inadvertently entangled in the nefarious scheme of the store manager, played by Eric Campbell, and the store's floorwalker, played by Lloyd Bacon, to embezzle money from the establishment.Simon Louvish (2009) Chaplin: The Tramp's Odyssey. London, Faber and Faber: 105 ", "The Floorwalker was the first film Chaplin made for the Mutual Company. It also marked the first Chaplin comedy in which Eric Campbell played the huge, menacing villain. This film also marked Henry Bergman's first of numerous appearances in Chaplin films. Bergman would typically play an authority figure or an upper-crust society gentleman—the perfect comic foil for Charlie's Tramp character. Bergman would work closely with Chaplin until his death from a heart attack in 1946.", "* Eric Campbell as Store manager"]}, {"page": "The Count (film)", "response": ["The Count is Charlie Chaplin's fifth film for Mutual Film Corporation in 1916. Released on September 4, it co-starred Eric Campbell and Edna Purviance.", "* Eric Campbell - Tailor"]}, {"page": "The Rink (film)", "response": ["The Rink, a silent film from 1916, was Charlie Chaplin's eighth film for Mutual Films. The film co-starred Edna Purviance, Eric Campbell, Henry Bergman, and Albert Austin, and is best known for showcasing Chaplin's roller skating skills.", "* Eric Campbell - Mr. Stout, Edna's Admirer"]}, {"page": "The Vagabond (1916 film)", "response": ["The Vagabond is a 1916 American silent romantic comedy film by Charlie Chaplin and his third film with Mutual Films. Released to theaters on July 10, 1916, it co-starred Edna Purviance, Eric Campbell, Leo White and Lloyd Bacon. This film echoed Chaplin's work on The Tramp, with more drama and pathos mixed in with the comedy.", "Wandering off into the vicinity of a gypsy caravan in the country, he encounters the beautiful, though bedraggled, Edna. He entertains her with his violin. She has been abducted and abused by the gypsies, chief among them Eric Campbell, who whips her mercilessly. Charlie comes to her rescue and knocks her tormentors over the head with a stick before riding off with her in a commandeered cart. Love develops between them as Charlie washes Edna's face in a bowl and combs her hair. He makes breakfast while she goes to fetch water. On the way Edna meets an artist who lacks inspiration. Edna is his muse and he paints her, including her unique shamrock-shaped birthmark. Edna falls for him and brings him back to the cart where the two talk, while Charlie is ignored. The artist leaves and she is stuck with Charlie.", "* Eric Campbell as Gypsy Chieftain"]}, {"page": "Easy Street (1917 film)", "response": ["*Eric Campbell ... The Bully"]}, {"page": "The Adventurer (1917 film)", "response": ["thumb|200px|From left to right are Henry Bergman, Marta Golden, Edna Purviance, Eric Campbell and Charlie Chaplin in a scene still from the film", "The scene cuts towards a girl and her lover (Edna Purviance and Eric Campbell). They realize Edna's mother (Marta Golden) is drowning. They go over to help her. Edna begs Campbell to help, but he refuses because of his fatness. She jumps in, while Campbell leans against the fence and hawks at her. However, this man's sheer weight contributes to the fence giving away, and, of course, Campbell goes ker-plam! into the water.  ", "* Eric Campbell - The Suitor"]}, {"page": "The Fireman (1916 film)", "response": ["* Eric Campbell as Foreman of the Brigade"]}, {"page": "The Cure (1917 film)", "response": ["An alternative introduction which was added to the film (during prohibition) explains that in 1917 drunkenness was a serious problem in the working class, so to keep it funny Chaplin changed from his \"Little Tramp\" character to an upper-class fop. Gout was at the time believed to be a disease of the wealthy, which is why Eric Campbell's character has it.", "* Eric Campbell as The Man with the Gout"]}, {"page": "Katsuhisa Hōki", "response": ["*The Count (Tailor (Eric Campbell))", "*The Vagabond (Gypsy Chieftain (Eric Campbell))"]}, {"page": "Billy West (silent film actor)", "response": ["In 1917 movie theaters could not get enough Charlie Chaplin comedies, and an enterprising producer hired West, who had been doing comic pantomimes on the vaudeville stage, to make imitation-Chaplin subjects to meet the demand. West, wearing the identical \"tramp\" costume and makeup, copied Chaplin's movements and gestures so accurately that he is often mistaken for the genuine performer. Reportedly, Chaplin himself saw the Billy West company filming on a Hollywood street once, and told West, \"You're a damned good imitator.\" Some West comedies were later re-released on the home-movie market as \"Charlie Chaplin\" pictures. Most of the West comedies of 1917–18 resembled the Chaplin comedies of 1916–17, with Oliver Hardy approximating the villainy of Eric Campbell, and Leatrice Joy in the Edna Purviance ingenue role."]}, {"page": "October 1917", "response": ["* The Charlie Chaplin-directed film The Adventurer, starring Chaplin regulars Edna Purviance and Eric Campbell, was released through Mutual Film. It was the last film by Campbell before his death in a car accident two months later."]}, {"page": "1878 in the United Kingdom", "response": ["* 26 April – Eric Campbell, silent film star (died 1917)"]}, {"page": "List of American films of 1917", "response": ["|The Cure|| Charlie Chaplin ||Charlie Chaplin, Edna Purviance, Eric Campbell || Comedy ||"]}, {"page": "List of American films of 1916", "response": ["|Behind the Screen|| Charlie Chaplin || Charlie Chaplin, Edna Purviance, Eric Campbell ||Comedy ||", "|The Count||Charlie Chaplin ||Charlie Chaplin, Edna Purviance, Eric Campbell ||Comedy ||", "|The Floorwalker||Charlie Chaplin ||Charlie Chaplin, Edna Purviance, Eric Campbell, Lloyd Bacon ||Short comedy ||Chaplin's first film for Mutual Films"]}, {"page": "List of comedy films before 1920", "response": ["|Behind the Screen|| Charlie Chaplin|| Charlie Chaplin, Eric Campbell, and Edna Purviance|| United States||", "|The Floorwalker|| Charlie Chaplin||Charlie Chaplin, Eric Campbell, and Lloyd Bacon", "|The Pawnshop|| Charlie Chaplin || Charlie Chaplin, Henry Bergman, Edna Purviance, Albert Austin, and Eric Campbell|| United States||", "|The Vagabond|| Charlie Chaplin|| Charlie Chaplin, Edna Purviance, Eric Campbell, Leo White, and Lloyd Bacon|| United States||", "|The Adventurer|| Charlie Chaplin|| Charlie Chaplin, Edna Purviance, and Eric Campbell  || United States||", "|Easy Street|| Charlie Chaplin|| Charlie Chaplin, Edna Purviance, and Eric Campbell  || United States||", "|The Immigrant|| Charlie Chaplin|| Charlie Chaplin, Edna Purviance, and Eric Campbell  || United States||"]}, {"page": "The Rogue", "response": ["The main character is a carbon copy of Charlie Chaplin's Tramp down even to the details of the bent shoes, thin cane and matching hat. Moreover, the cafe owner played by Hardy is clearly modelled on Eric Campbell.https://www.mentalfloss.com/article/66364/charlie-chaplin-once-sued-imposter-named-charlie-aplin"]}, {"page": "Dick Whittington and His Cat", "response": ["*1909, starring Tom Foy, Lupino Lane and Eric Campbell at the Shakespeare Theatre, Liverpool."]}, {"page": "List of people from Trafford", "response": ["*Eric Campbell (1879/80–1917): actor, villain in several Charlie Chaplin films."]}, {"page": "Wayland Trask Jr.", "response": ["Wayland Trask Jr. (July 16, 1887 - November 18, 1918) was a silent film comedian who was a member of Mack Sennett's stock company of actors. Trask also had a theatrical background appearing in at least two Broadway plays before turning to screen comedy. He died at the end of 1918 in the Spanish Influenza pandemic eleven months after the disease had taken his mother. Trask's father was a stockbroker who died in 1905.Silent Film Necrology 2nd Edition by Eugene Michael Vazzana, c.2001 Trask also had two sisters. In looks he was tall like Chaplin's co-star Eric Campbell and resembled the later Sennett comedian Kewpie Morgan. Some of his performances in Sennett comedies survive such as Bombs (aka Bombs and Brides).Wayland Trask; findagrave.com databaseWho Was Who on Screen, 3rd Edition; c.1983, by Evelyn Mack Truitt"]}, {"page": "Alfred Campbell", "response": ["*Alfred Eric Campbell, a British-born early Hollywood actor"]}, {"page": "List of LGBT-related films pre-1920", "response": ["|Behind the Screen|| 1916 ||  || United States || Comedy, romance || Charlie Chaplin, Edna Purviance, Eric Campbell || After Chaplin's prophand character kisses Edna Purviance's character in drag, villain Eric Campbell sees this and begins doing an effeminite dance to mock Chaplin's character."]}, {"page": "December 1917", "response": ["* Died: Eric Campbell, Scottish actor, best known for co-starring with Charlie Chaplin in several comedies including The Floorwalker, Easy Street and The Immigrant (killed in a car accident) (b. 1879); Frederick McCubbin, Australian painter, member of the Heidelberg School (b. 1855); Lucien Petit-Breton, French cyclist, winner of the Tour de France in 1907 and 1908 (killed in action) (b. 1882)"]}]}}