{"wiki_id": "http://www.wikidata.org/entity/Q1337848", "itemLabel": "Henry Eckford", "itemDescription": "Scottish/American shipbuilder (1775-1832)", "wikipedia_url": "https://en.wikipedia.org/wiki/Henry_Eckford_(shipbuilder)", "wikipedia_page": {"main": "Henry Eckford (12 March 1775 – 12 November 1832) was a Scottish-born American shipbuilder, naval architect, industrial engineer, and entrepreneur who worked for the United States Navy and the navy of the Ottoman Empire in the early 19th century. After building a national reputation in the United States through his shipbuilding successes during the War of 1812, he became a prominent business and political figure in New York City in the 1810s, 1820s, and early 1830s.", "link_mentions": [{"page": "1832", "response": ["** Henry Eckford, Scottish-born American shipbuilder, naval architect, industrial engineer, and entrepreneur (b. 1775)"]}, {"page": "1775", "response": ["** Henry Eckford, Scottish-born American shipbuilder, naval architect, industrial engineer, entrepreneur (d. 1832)"]}, {"page": "Sackets Harbor, New York", "response": ["Most importantly, by 1813 the village became the US Naval Headquarters on the Great Lakes. Working at the Navy Point shipyard were 3,000 highly skilled men, including hundreds of shipbuilders and carpenters brought from New York City because of a lack of locally skilled craftsmen. The yard was constructed and supervised during the war by New York City naval architect and shipbuilder Henry Eckford. They rapidly built eleven warships to establish control over the Great Lakes."]}, {"page": "USS Ohio (1812)", "response": ["USS Ohio was a merchant schooner purchased by the US Navy in 1812; converted to a warship by Henry Eckford; and commissioned prior to 13 June 1813, with Sailing Master Daniel Dobbins in command."]}, {"page": "USS Ohio (1820)", "response": ["The second USS Ohio was a ship of the line of the United States Navy, rated at 74 guns, although her total number of guns was 104. She was designed by Henry Eckford, laid down at Brooklyn Navy Yard in 1817, and launched on 30 May 1820. She went into ordinary and in the ensuing years decayed badly. Refitted for service in 1838, Ohio sailed on 16 October 1838 to join the Mediterranean Squadron under Commodore Isaac Hull. Acting as flagship for two years, she protected commerce and suppressed the slave trade off the African coast. Ohio proved to have excellent performance under sail, repeatedly making more than . One of her officers stated, \"I never supposed such a ship could be built—a ship possessing in so great a degree all the qualifications of a perfect vessel.\" In 1840, Ohio returned to Boston, where she again went into ordinary. From 1841 to 1846, Ohio served as receiving ship."]}, {"page": "Joseph Rodman Drake", "response": ["Born in New York City, he was orphaned when young and entered a mercantile house. While still a child, he showed a talent for writing poems. He was educated at Columbia College. In 1813 he began studying in a physician's office. In 1816 he began to practice medicine and in the same year married Sarah, daughter of Henry Eckford, a naval architect."]}, {"page": "John Galt (novelist)", "response": ["Born in Irvine, in Ayrshire, Galt was the son of a naval captain involved in the West Indies trade. He was a first cousin of Captain Alexander Allan. His father moved to Greenock in 1780. The family visited regularly but did not permanently rejoin him until 1789. John was educated at Irvine Grammar School alongside Henry Eckford, who was a lifetime friend, and William Spence.Annals of the Parish: The Life of John Galt"]}, {"page": "USS Grampus (1821)", "response": ["Grampus was built at the Washington Navy Yard under the supervision of naval constructor William Doughty, based on a design by Henry Eckford. Her  keel was laid down in 1820. She was launched in early August 1821. The need to suppress piracy and to maintain ships to catch slavers led to the building of five such schooners, the largest of which was Grampus. This was the first building program undertaken by the Navy since the War of 1812."]}, {"page": "Kilwinning", "response": ["*Henry Eckford, shipbuilder"]}, {"page": "USS Sylph (1813)", "response": ["Built to strengthen Commodore Isaac Chauncey's squadron on Lake Ontario, Sylph was laid down on 26 July 1813 at Sackett's Harbor, New York, by Henry Eckford; and launched on 18 August 1813."]}, {"page": "USS Oneida (1809)", "response": ["Oneida was built at Oswego, New York 1808–1809, under contract awarded by her first commanding officer, Lieutenant M. T. Woolsey, to Henry Eckford and Christian Bergh. Although her displacement was 243 tons by carpenter's measurement, her draft could compare with a sloop of 80 tons. This enabled her to enter the rivers feeding Lake Ontario without fear of grounding. She was delivered by the contractors in the spring of 1809, but was not equipped and sent upon the lake until the fall of 1810."]}, {"page": "Thurlow Weed", "response": ["Weed was born on November 15, 1797, in the hamlet of Acra, part of the town of Cairo in Greene County, New York.  His father, Joel Weed (1773-1819) and mother Mary (Ellis) Weed (1771-1841) were Connecticut natives who moved to New York to farm, and Weed was the eldest of five siblings, three brothers and two sisters.  Neither of his sisters reached adulthood. His brother Orrin was apprenticed to a New York City shipbuilder, Henry Eckford, and died in 1823 during a yellow fever epidemic.  His brother Osborn moved to Tennessee, where he was a successful merchant and hotelier before he died in 1851.  Weed was christened Edward Thurlow Weed, named for a presumed family connection to Edward Thurlow, England's Lord Chancellor.  As a boy, Weed dropped his first name; as an adult, he attempted to document the family connection during a visit to England, but was unsuccessful."]}, {"page": "United States naval architect", "response": ["Henry Eckford 1817 to 1820"]}, {"page": "Henry Eckford", "response": ["Henry Eckford may refer to:", "*Henry Eckford (horticulturist) (1823–1905), British horticulturist", "*Henry Eckford (shipbuilder) (1775–1832), Scottish-born American shipbuilder and naval architect", "*Henry Eckford (steamboat), American commercial steamboat in service from 1824 to 1841; the first steam vessel to be powered by a compound engine"]}, {"page": "USS Trippe (1812)", "response": ["Originally named Contractor, she was purchased by the Navy on the Niagara River in New York in 1812 — was converted to a warship by Henry Eckford of New York; renamed Trippe; and placed in commission soon thereafter, Lieutenant Thomas Holdup Stevens in command."]}, {"page": "James Ellsworth De Kay", "response": ["After his return to the United States, he married Janet Eckford, a daughter of Henry Eckford, a ship builder. He then traveled with his father-in-law to Turkey as a ship's physician, and published a book, Sketches of Turkey in 1831 and 1832, about these travels.  Although well received as an entertaining travelogue, his book has been criticized as being very anti-HellenicFairfield, p. 73.Wilson and Fiske. as well as sometimes naive about Turkish customs.Ze'evi, p. 197. He was entrusted by Eckford with negotiations with Brazil and other South American powers, relative to the ships of war that had been ordered by the latter.Wilson and Fiske. In 1830, he was elected into the National Academy of Design as an honorary academician."]}, {"page": "Eckford", "response": ["* Henry Eckford (horticulturist) (1823–1905), British plant breeder", "* Henry Eckford (shipbuilder) (1775–1832), Scottish-born American naval architect and shipbuilder", "* PS Henry Eckford, an American commercial steamship in service from 1824 to 1841, the first steamship with a compound engine"]}, {"page": "USS Lady of the Lake (1813)", "response": ["USS Lady of the Lake was a small schooner in the United States Navy during the War of 1812. She was built by Henry Eckford of Sacketts Harbor, New York, during the summer and winter of 1812-13, launched 6 April 1813 and entered service 13 days later, Sailing Master Flinn in command."]}, {"page": "USS General Pike (1813)", "response": ["She was named for Brigadier General Zebulon Pike, who was killed by an exploding enemy magazine at the Battle of York on 26 April 1813. The ship was laid down on 9 April 1813 at Sackets Harbor, New York, by Henry Eckford, a New York City shipbuilder who supervised the construction of warships on Lake Ontario. The ship was roughly the same dimensions as the frigate , and the largest yet built on any of the Great Lakes."]}, {"page": "William H. Webb", "response": ["William Henry Webb was born in New York on June 19, 1816. His father Isaac trained at the shipyard of New York shipbuilder Henry Eckford before opening his own shipyard, Isaac Webb & Co., near Corlears Hook in about 1818, later relocating to Stanton Street. Isaac eventually took on a partner and the firm was renamed Webb & Allen."]}, {"page": "1832 in the United States", "response": ["* November 12 – Henry Eckford, shipbuilder, naval architect, industrial engineer and entrepreneur (born 1775 in Scotland)"]}, {"page": "Eckford of Brooklyn", "response": ["Formally organized on June 27, 1855, the Eckford Base Ball Club was named for shipbuilder Henry Eckford whose base of operations from the late 1790s until the early 1830s was Brooklyn, New York. He designed many American warships that participated in the War of 1812. The team's first president was Frank Pidgeon, who was one of Eckford's founding members.Ryczek and Morris, p. 180.", "Eckford of Brooklyn may be another latterday coinage. Contemporary readers would probably understand it as an abbreviation for something like Eckford Base Ball Club, of Brooklyn in contrast to \"Eckford\" clubs in other cities. \"Eckford\" was not common as the root of a ballclub name — in contrast to \"Athletic\", \"Atlantic\", and \"Mutual\" — so there must have been little need to distinguish the Brooklyn rendition. (Wright (2000) mentions \"Eckford\" clubs in Albany 1864-1867, Syracuse 1870, and Newark 1870, as well as the distinctly named \"Henry Eckford\" club in New York 1860-1864. Due to internal turmoil, the Henry Eckfords organized on August 23, 1859, headed by Dr. William Bell and consisted of Eckford players who were from New York, today referred to as Manhattan.  The other Eckfords were not prominent and did not travel so there must little occasion to qualify the \"Eckford\" name except locally.)"]}, {"page": "Engagements on Lake Ontario", "response": ["To redress matters, on 3 September, the United States Navy appointed Commodore Isaac Chauncey, then commanding the New York Navy Yard, to command on the lakes. Although Chauncey was nominally in charge of the naval force on Lake Erie also, he took little part in its construction or operations there but concentrated his attention on Lake Ontario. To supplement Oneida, he first purchased or commandeered several trading vessels (including some captured Canadian schooners), but he also dispatched thousands of carpenters, shipwrights and so on to Sacket's Harbor to construct proper fighting ships. The chief architects were Adam Brown, his brother Noah, and Henry Eckford. They launched their first new ship, the corvette , on 26 November. The trees from which it was constructed had still been standing in September.Forester, p. 122"]}, {"page": "Henry Eckford (horticulturist)", "response": ["Henry Eckford (17 May 1823 – 5 December 1905) was a Scots horticulturist and reputedly the most famous breeder of sweet peas, transforming the plant from a minor horticultural subject into the queen of annuals. U.S. horticulturist Liberty Hyde Bailey called him \"the prince of specialists\". In 1888 he moved to the town of Wem in Shropshire, England. It was in Wem that he perfected the breeding of his Grandiflora sweet peas, which in size of bloom and general performance were a great improvement over previous varieties.", "Henry Eckford was a Fellow of the Royal Horticultural Society. From horticultural shows he gained \"upwards of 85 gold and silver medals\" among his prizes.", "In honour of Henry Eckford the town of Wem (specifically the Eckford Sweet Pea Society of Wem) holds each year in July a sweet pea show. In this there is a section for old fashioned varieties, always including many bred by Henry Eckford."]}, {"page": "USS Superior (1814)", "response": ["USS Superior was built for the War of 1812, and was named after one of the Great Lakes. Superior was a U.S. Navy frigate built in 1814 at Sackets Harbor, New York, by Henry Eckford, and was laid down in February 1814 and launched on 2 May of the same year."]}, {"page": "USNS Henry Eckford (T-AO-192)", "response": ["United States Naval Ship USNS Henry Eckford (T-AO-192) was a Henry J. Kaiser-class fleet replenishment oiler of the United States Navy. She was never completed.", "Henry Eckford, the sixth Henry J. Kaiser-class ship, was laid down by the Pennsylvania Shipbuilding Company in Chester, Pennsylvania, on 22 January 1987. Her construction encountered numerous problems. Although she was launched on 22 July 1989, her construction contract with Pennsylvania Shipbuilding was cancelled on 31 August 1989. Along with her unfinished sister ship USNS Benjamin Isherwood (T-AO-191), the incomplete Henry Eckford was towed to the Philadelphia Naval Shipyard in Philadelphia on 27 October 1989 for lay-up.", "A new contract was awarded on 16 November 1989 to the Tampa Shipbuilding Company of Tampa, Florida, to complete Henry Eckford, and she was towed from Philadelphia to Tampa. However, construction problems continued, and that contract also was canceled, on 15 August 1993, when the ship was 84 percent complete. Cost overruns had run into the millions of U.S. dollars.", "The Navy decided that completion of Henry Eckford as an oiler was no longer necessary, and considered converting her into an ammunition ship, but the conversion was found to be cost-prohibitive. Instead, the nearly complete Henry Eckford was turned over to the Maritime Administration and towed up the James River in Virginia, where she remained in reserve in the National Defense Reserve Fleet as part of the United States Navy's James River Reserve Fleet at Lee Hall, Virginia. She was struck from the Navy List on 10 November 1997, and her title was transferred to the Maritime Administration on 2 February 1998. She and Benjamin Isherwood were the only units of the 18-ship Henry J. Kaiser class not to be completed.", "On 19 July 2011, Henry Eckford departed for Brownsville, Texas, to be recycled by International Shipbreaking Limited.", "* Jampoler, Andrew C.A. \"Who Was Henry Eckford?\" Naval History, December 2007, Pages 38–45.", "* NavSource Online: Service Ship Photo Archive: T-AO-192 Henry Eckford", "* USNS Henry Eckford (T-AO 192)"]}, {"page": "USS New Orleans (1815)", "response": ["New Orleans was laid down on 15 December 1814 by Henry Eckford and Adam and Noah Brown at Sackets Harbor, New York. She was intended for U.S. Navy use on Lake Ontario during the War of 1812 and was the largest of the ships Eckford built at Sackets Harbor. If completed, she would have been the first U.S. Navy ship named New Orleans, but her construction was halted in March 1815 after the conclusion of peace with the United Kingdom. She remained on the stocks, housed over, until sold for salvage on 24 September 1883 to H. Wilkinson, Jr., of Syracuse, New York.", "*Jampoler, Andrew C. A. \"Who Was Henry Eckford?\" Naval History, December 2007, Pages 38–45."]}, {"page": "USS Madison (1812)", "response": ["USS Madison was built at Sackets Harbor, New York by Henry Eckford. She was launched on Lake Ontario on 26 November 1812, Lieutenant Jesse D. Elliot in command. She was the first U.S. corvette launched on the lake.", "*Jampoler, Andrew C. A. \"Who Was Henry Eckford?\" Naval History, December 2007, Pages 38–45."]}, {"page": "USS Mohawk (1814)", "response": ["Mohawk, a 42-gun frigate, was laid down 8 May 1814 by shipbuilder Henry Eckford at Sackets Harbor, New York, launched on 11 June 1814, and acquired by the U.S. Navy and placed in service shortly thereafter with Captain Jacob Jones in command. She was built very quickly, having been on the ways only 34 days when she was launched, and was large for her class of warship.Chapelle, p.294", "* Jampoler, Andrew C. A. \"Who Was Henry Eckford?\" Naval History, December 2007, Pages 38–45."]}, {"page": "Eckford chain", "response": ["The Eckford Chain of lakes is composed of Blue Mountain Lake, Eagle Lake, and Utowana Lake in the Adirondack Mountains in New York.  The chain was named for Henry Eckford, a noted engineer and ship builder who made a survey of the lakes in 1811.Donaldson, Alfred L. History of the Adirondacks, New York: The Century Co., 1921, p. 103 All of the lakes are located in the town of Indian Lake, in Hamilton County."]}, {"page": "Allaire Iron Works", "response": ["| align=\"left\" |  || 1816 || align=\"left\" | Henry Eckford || align=\"right\" | 495 || align=\"left\" | Hudson River || 1 || 44 || 5 || C || align=\"left\" | ", "| align=\"left\" | Robert Fulton || 1819 || align=\"left\"| Henry Eckford ||align=\"right\" | 702 || align=\"left\"| Atlantic coast || 1 || 44 || 5 || C || align=\"left\" | ", "| align=\"left\" | Henry Eckford || 1824 || align=\"left\"| Lawrence & Sneden ||align=\"right\" | 150 || align=\"left\"| Hudson River || 1 || 12, 24 || 4 || Cm/C || align=\"left\" | Treasury Dept. 1838. p.  96. Worlds first steam vessel powered by a compound engine. "]}, {"page": "Henry Eckford (steamboat)", "response": ["thumb|300px|1825 advertisement for the services of Henry Eckford.", "Henry Eckford was a small passenger-cargo steamboat built in New York in 1824. She was the first steam vessel in the world to be installed with a compound engine, almost fifty years before the technology would become widely adopted for marine use.", "Henry Eckford, named in honor of the renowned New York shipbuilder of the era, was built for Mowatt Brothers & Co. by Lawrence & Sneden of Manhattan, New York, in 1824. The machinery for the vessel was subcontracted to the Allaire Iron Works of James P. Allaire, who installed a compound engine (commonly known at the time as a \"Woolf double cylinder\" engine). Although the compound engine with its greater efficiencyCompound engines of this era could typically reduce fuel consumption by about a third. was already a well established technology, having been patented by British inventor Arthur Woolf almost twenty years earlier, such an engine had never before been used to power a ship. ", "Henry Eckford's compound engine was of the vertical crosshead type.Marine Engineering, p. 7. It had two cylinders—a high-pressure cylinder 12 inches in diameter and a 24 inch low-pressure cylinder—and a stroke of 4 feet.Morrison, p. 48. The engine operated at a pressure of about , well above the  common to marine steam engines of the period.", "While the higher pressure was necessary for the compound engine to fully utilize its greater efficiency, it may account for the fact that this type of engine remained unpopular in marine applications long after its invention, as boiler explosions were not uncommon on early steamboats and higher pressures made for more violent explosions. After Henry Eckford, Allaire would go on to install several more steamboats with compound engines, decades before the technology was to achieve widespread acceptance in marine applications.", "Henry Eckford was initially employed as a passenger-and-freight steamer, running on the Hudson River between Rector St., North River, New York City and Albany, New York. Advertised as a \"very fast\" boat, the steamer had a speed of around , and could complete a one-way trip in about 14 hours. The price of a full ticket was $3, with intermediate stops charged in proportion to distance travelled.Dwight, p. 191.", "In 1825, the Mowatts decided to try using the boat to tow barges. Since no steamboat had previously been utilized in such a role, the proposal was widely greeted with scepticism, but in the first attempt, Henry Eckford pulled two barges from New York to Albany in 24 hours, a commercially viable time.Haswell, Chapter VIII. The principle having been established, other steamboat owners quickly followed suit, and steam towboats soon became a commonplace. Henry Eckford herself would thereafter spend much of her career as a towboat. However, she also continued to carry passengers, and in 1826 the steamer's cabin was converted to passenger accommodation. By this time, the fare from New York to Albany had dropped to a dollar.The Repository, 1826 (scan).", "In the 1830s, Henry Eckford was placed on the route between New York and Norwich, Connecticut.Morrison, p. 327. Eventually superseded by newer, faster steamboats, Henry Eckford spent her later years as a towboat in New York Harbor.Munsell, p. 39.", "On April 27, 1841, while getting up steam in dock at the foot of Cedar St., New York, to tow a canal boat, Henry Eckford suffered a boiler explosion.Jones, p. 7. The two  x 30 inch (5.8 by 0.76 m) wrought-iron boilers, with an aggregate weight of about 4 tons, were thrown  toward the stern, wrecking the engine in their path, parts of which were thrown an additional twenty feet.Jones, pp. 11-12. The ship's engineer and firemen were hurled from the vessel by the force of the blast but escaped serious injury; however, a worker on board the canal boat, which was in the process of being secured to the steamer, was killed by a piece of flying metal.Jones, pp. 7-8.", "After the explosion, Henry Eckford's wrecked machinery was removed and the hull was converted into a coal barge, which was still in service as late as 1851. The barge was eventually broken up."]}]}}