{"wiki_id": "http://www.wikidata.org/entity/Q133698", "itemLabel": "Jo Whiley", "itemDescription": "English television and radio personality", "wikipedia_url": "https://en.wikipedia.org/wiki/Jo_Whiley", "wikipedia_page": {"main": "Joanne Whiley-Morton (born 4 July 1965), better known by her professional name Jo Whiley, is an English radio DJ and television presenter. She was the host of the long-running weekday later weekend Jo Whiley Show on BBC Radio 1. She now currently presents her weekday evening Radio 2 show.\n\n", "link_mentions": [{"page": "Craig Charles", "response": ["From January until November 2014, Charles also broadcast the Funk and Soul Show live on BBC Radio 2, immediately after his 6 Music show. He regularly sits in for Janice Long, Steve Wright and Jo Whiley, and has presented numerous programmes on the station, including The Craig Charles Soul All-Nighter (2011), which he hosted continuously for 12 hours, and the Beatleland (2012) documentary on The Beatles. Charles has also chosen music as a guest of other broadcasters such as Ken Bruce on Radio 2 and Liz Kershaw on 6 Music.  Charles covered for Graham Norton on Radio 2's Saturday mid-morning show during Norton's 10-week 2015 summer break."]}, {"page": "Blue Jam", "response": ["Morris included a series of 'radio stings', bizarre sequences of sounds and prose as a parody of modern DJs' own soundbites and self-advertising pieces. Each one revolves around a contemporary DJ, such as Chris Moyles, Jo Whiley and Mark Goodier, typically involving each DJ dying in a graphic way or going mad in some form – for example, Chris Moyles covering himself in jam and hanging himself from the top of a building."]}, {"page": "Robyn", "response": ["The second single from the UK release was \"With Every Heartbeat\", which was released in late July 2007 and reached number one on the UK singles chart. Robyn appeared on Jo Whiley's BBC Radio 1 showcase show, Live Lounge. In Australia, where Robyn reached the top ten of the iTunes Store's album chart, \"With Every Heartbeat\" received attention on radio and video networks. Robyn contributed vocals to Fleshquartet's single, \"This One's for You\", from their Voices of Eden album that year. Konichiwa Records signed an international licensing deal with Universal Music Group to distribute Robyn's music globally, and her UK recordings are released by Island Records. The Rakamonie EP was released in January 2008 by Cherrytree Records (a subsidiary of Interscope Records), and the US version of Robyn was released in April of that year. \"With Every Heartbeat\", \"Handle Me\" and \"Cobrastyle\" were top-10 club singles, and \"With Every Heartbeat\" received airplay on US pop and dance radio stations. Robyn provided backing vocals on Britney Spears' 2007 single, \"Piece of Me\", and appeared on the Fyre Department remix of \"Sexual Eruption\" by rapper Snoop Dogg. She made a brief US tour to promote Robyn, and was the supporting act for Madonna's Sticky & Sweet Tour on European dates in 2008. In January 2009, Robyn received a 2008 Swedish Grammis Award for Best Live Act."]}, {"page": "Coldplay", "response": ["On 4 December 2014, Chris Martin announced in an interview with Zane Lowe on BBC Radio 1 that Coldplay were in the middle of working on their seventh studio album, A Head Full of Dreams.\"Coldplay reveal new album title\". BBC. Retrieved 4 December 2014 Martin stated it might be the band's final album and compared it to Harry Potter; \"It's our seventh thing, and the way we look at it, it's like the last Harry Potter book or something like that.\" He added that, unlike their promotion efforts for Ghost Stories, the band will tour for the seventh record. In an interview with Jo Whiley on BBC Radio 2, Martin hinted at the style of the album by saying that the band were trying to make something colourful and uplifting, yet not bombastic. He also stated that it will be something to \"shuffle your feet\" to."]}, {"page": "The Verve", "response": ["Ashcroft had been adamant that The Verve would not re-form, once remarking: \"You're more likely to get all four Beatles on stage\". However, after Ashcroft learned that Salisbury was in contact with McCabe over a possible side project, Ashcroft contacted McCabe and Jones, making peace with them, and the band re-formed. Tong was not asked to rejoin, so as to keep the internal issues that split the band up a decade ago to an absolute minimum. Jones explained this decision by stating: \"It would have been too hard, it's hard enough for the four of us. If you bring more people to it, it's harder to communicate and communication has always been our difficulty\". Paradoxically, Nick McCabe would state years later on his Twitter account, that he intended to include Davide Rossi (violist) as a new member of the group. On 26 June 2007, the band's reunion was announced by Jo Whiley on BBC Radio 1. The band, reuniting in their original line-up, announced they would tour in November 2007, and release an album in 2008. The band stated: \"We are getting back together for the joy of music\", though they turned down a multi-album deal offer \"because the 'treadmill' of releasing albums and touring marked the beginning of the end for the band a decade ago\"."]}, {"page": "1965 in music", "response": ["*July 4 – Jo Whiley, British radio DJ"]}, {"page": "Simon Armitage", "response": ["In March 2020 Armitage launched a podcast, The Poet Laureate Has Gone To His Shed, also broadcast on BBC Radio 4. While working on the medieval poem The Owl and the Nightingale he invited a series of guests to visit him in his garden writing-shed. His guests were Guy Garvey, Kae Tempest, Testament, Maxine Peake, Antony Gormley, Lily Cole, Sam Lee, Melanie Plimmer, Jackie Kay, Laura Ashe, and Chris Packham; the programme broadcast on 27 May was made while self-isolating during the COVID-19 pandemic, and was the last of the first series. A second series started on 3 July 2021, featuring Johnny Marr, Amanda Owen, Imtiaz Dharker, J. K. Rowling, Jo Whiley, Gillian Burke, John Tiffany,  Sabrina Verjee and Prince Charles."]}, {"page": "GHV2", "response": ["A sequel to her first greatest hits album, The Immaculate Collection (1990), GHV2 included fifteen singles released during Madonna's second decade in the recording industry, starting from \"Erotica\" (1992) to \"What It Feels Like for a Girl\" (2001). Unlike the former release, GHV2 did not feature any new material. In an interview with BBC's Jo Whiley, Madonna spoke about the selection of the tracks stating, \"I like \"Fever\" alright. But the thing is they had to have listening power for me. I had to be able to listen to them five times in a row and think this is really good, this is a well written song, it's really well produced.\" She also added that \"If you listen to the record, you can really see my evolution as a singer, songwriter, and, more important, a human being.\" Madonna felt that because it was a \"greatest hits\", it should only contain previously released hit songs. Alt URL  Several of her popular singles of that period were excluded from the album. Despite being a worldwide number-one hit in 2000, \"American Pie\" was not included because Madonna had regretted putting it on her eighth studio album, Music (2000). \"It was something a certain record company executive twisted my arm into doing, but it didn't belong on the album so now it's being punished... My gut told me not to [put the song on Music], but I did it and then I regretted it so just for that reason it didn't deserve a place on GHV2.\" she said. Other notable exclusions were \"This Used to Be My Playground\", \"Rain\", \"I'll Remember\" and \"You'll See\"—all of which had been included on her ballads compilation Something to Remember (1995)."]}, {"page": "Steve Lamacq", "response": ["Between 1995 and 1997, Lamacq occasionally presented Top of the Pops on BBC One with fellow Radio 1 DJ Jo Whiley.", "Between 1993 and 1997 Lamacq presented The Evening Session with Jo Whiley, and then on his own until December 2002, when the programme was cancelled. Colin Murray served as a temporary replacement for six months until Zane Lowe's contract with the London station XFM ended in June 2003, where he took up a permanent position.  On 28 September 2007, both he and Whiley reunited to recreate The Evening Session on the latter's show as part of Radio 1's 40th Anniversary celebrations.", "In March 2010 it was announced that Lamacq and fellow Radio 1 presenter Jo Whiley would present a one-off Evening Session (the first in 13 years) on Good Friday (2 April) for BBC Radio 6 Music."]}, {"page": "Derren Brown", "response": ["In January 2011, to celebrate 10 years since his first television appearance, Channel 4 held a special \"Derren Brown Night\". As well as re-showing The Heist (which had won a recent poll of favourite Brown specials) and one of his Enigma live shows, the channel screened a special documentary called Derren Brown: Behind the Mischief. It was a personal and candid film about Brown which included the story of how he met his co-writer (who was featured in Seance), his mother's feelings about his involvement in the Russian Roulette special, and an emotional visit back to his old school, university, and bars/pubs where he first began his career. Celebrity contributors included Matt Lucas, Jo Whiley, Stephen Merchant, and Simon Pegg. In January 2013, he was featured in a Channel 4 Deal or No Deal special, where he appeared to have predicted all the correct boxes to win the big jackpot of £250,000. That same year, he appeared in a comedy sketch at the beginning of an 8 Out of 10 Cats Does Deal or No Deal special."]}, {"page": "Top of the Pops", "response": ["The last remnants of the Year Zero revamp were replaced in 1995, when a new title sequence, logo and theme tune were introduced (the logo having first been introduced on the new programme Top of the Pops 2 some months previously), coinciding with the introduction of a new set. Blaxill also increasingly experimented with handing presenting duties to celebrities, commonly contemporary comedians and pop stars who were not in the charts at that time. In an attempt to keep the links between acts as fresh as the performances themselves, the so-called \"golden mic\" was used by, amongst others, Kylie Minogue, Meat Loaf, Des Lynam, Chris Eubank, Damon Albarn, Harry Hill, Jack Dee, Lulu, Björk, Jarvis Cocker, Stewart Lee and Richard Herring. Radio1 DJs still presented occasionally, including Lisa I'Anson, Steve Lamacq, Jo Whiley and Chris Evans.", "In 1997, incoming producer Chris Cowey phased out the use of celebrities and established a rotating team (similar to the 1991 revamp, although much more warmly received) of former presenters of youth music magazine The O-Zone Jayne Middlemiss and Jamie Theakston as well as Radio1 DJs Jo Whiley and Zoe Ball. The team was later augmented by Kate Thornton and Gail Porter."]}, {"page": "Geri Halliwell", "response": ["On 31 May 1998, Halliwell announced through her solicitor that she had left the Spice Girls due to depression and differences between the group. Her action aroused controversy, her former group being due to embark on a North American tour, which they eventually completed without her.\"Spice Girls will do U.S. tour, with or without Ginger\" . London (AP). Saturday, 30 May 1998. Aallpop.canoe.ca. Although she had already left the group, the Spice Girls released \"Viva Forever\", the final music video to feature Halliwell's likeness, plus a one-off supergroup called England United for the official England FC song (Jo Whiley introduced the band saying \"...plus Geri as a substitute\"). After she left, the other girls co-wrote a few songs about her, which appeared on their album Forever: \"Goodbye\", \"Tell Me Why\" and \"Let Love Lead the Way\". The group is among the best-selling girl groups of all time, selling over 75 million albums."]}, {"page": "Zoe Ball", "response": ["Ball began her television career as a runner at Granada Television and researcher for the Cool Cube on BSkyB. She then worked as a researcher for quiz shows for two years. Her presenting jobs have included hosting The Big Breakfast and The Priory on Channel 4, BBC One's Saturday morning children's programme Live & Kicking, and the pre-school programme Playdays. In 1994, Ball presented SMart with Mark Speight and Jay Burridge until she left in 1996. In 1995, Ball hosted Fully Booked for the first series. Between 1996 and 1998, she was a regular presenter on Top of the Pops, usually alternating with fellow presenters and DJs Jayne Middlemiss and Jo Whiley. "]}, {"page": "The Mighty Boosh", "response": ["On 15 November 2007, as part of the publicity for the premier of their third series the same day, Julian Barratt and Noel Fielding returned to Radio 1, this time on Jo Whiley's Live Lounge.Jo Whiley. Mighty Boosh in the Live Lounge, BBC Radio 1, 15 November 2007."]}, {"page": "Ross Noble", "response": ["Noble's stand-up routine is a largely improvised and surreal performance with a stream of consciousness delivery. He is often referred to as a randomist. Often, a large percentage of his set becomes based around heckles and conversations with members of the audience. Although he does often have a few set topics which he performs throughout a tour, he describes the planning for the entire show as \"about four words on a piece of scrap paper\".Ross Noble interview , Jo Whiley on BBC Radio 1 on 6 November 2006"]}, {"page": "Through the Keyhole", "response": ["| 4 || Marvin HumesKate GarrawayJimmy Carr || Jo WhileyJamie LaingAbz Love || 21 January 2017 || 3.58"]}, {"page": "Liza Tarbuck", "response": ["Tarbuck stood in for Simon Mayo on his BBC Radio 2 Drivetime Show for three weeks in July/August 2010 also covering the show on 18–22 April in 2011, 1–19 August in 2011, 4–8 June 2012, 14–18 February 2013, 15 July 2013, 26–30 May 2014, 6–10 April 2015 and 14 June 2016. On 9 October 2018, she presented the Drivetime show (5pm–8pm) with Simon Mayo while Jo Whiley was away from the station."]}, {"page": "Dizzee Rascal", "response": ["The single \"Dance Wiv Me\", featuring Calvin Harris and Chrome, was released through the label on 7 July 2008; the track became Jo Whiley's Pet Sound for the Week beginning 2 June 2008, thus gaining a large amount of radio airtime. The single charted at Number 1 on download sales alone, a week before its physical release. Dizzee's next two singles, \"Bonkers\" and \"Holiday\", were also released under the record label, and these two again charted at Number 1. Dizzee then released his 4th album on the label (Tongue N' Cheek) which along with three number ones spawned the top 10 hit Dirtee Cash."]}, {"page": "Wanker", "response": ["In February 2009, U2 member Bono called Chris Martin a wanker live on air during Jo Whiley's Radio 1 show."]}, {"page": "Cognoscenti vs. Intelligentsia", "response": ["This last line, usually omitted on radio play, is itself a sample from Kermit Schafer's 1950s \"recreation\" of a supposed on-air blooper by 1920s children's radio presenter, \"Uncle Don\". In fact, this faux pas is an urban legend.Snopes: That oughta hold the little bastards! The sample caused many complaints to the band's label EMI, enough for a Parental Advisory sticker to be included on the single by the end of the single's first week of release, presumably by those assuming the song to be aimed at children. Additionally, the sample was left unedited when the song was played by Jo Whiley on BBC Radio 1 in November, the broadcast of the song which eventually greenlit the single's release by EMI, the sample was again unedited, causing much controversy.", "Unlike the later single \"The Hampsterdance Song\", \"Cognoscenti vs. Intelligentsia\" was released without the involvement of the owner of the original website, Deidre LaCarte. LaCarte accused the Cuban Boys of stealing in an article in the Mail on Sunday Originally scheduled for release as a single in November 1999, the release date was threatened to be pushed back to some time in January 2000 until the song was played on Jo Whiley's afternoon radio show. It received the same amount of attention as when it had been played on Peel's show. The decision was made to move the release to December 13 to put it in line for the Christmas number-one slot. It managed to get to number four on the Christmas chart week, being beaten by Westlife's \"I Have a Dream\". The song did, however, top John Peel's Festive Fifty for that year. In Ireland, the song peaked at number 19 on the week of Christmas. In March 2000, it made a brief appeared on the New Zealand Singles Chart, peaking at number 27."]}, {"page": "Ocean Colour Scene", "response": ["During their peak (around the time of the Moseley Shoals release) OCS also regularly performed on stage with Noel and Liam Gallagher of Oasis, with whom they were on tour at the time. One particular performance of note with the Gallaghers was a rendition of The Beatles' \"Day Tripper\", which was included as a live B-side to \"The Circle\". The song was also included on the B-side compilation album, B-sides, Seasides and Freerides. Noel Gallagher previewed an advance copy of the song during an interview on BBC Radio 1 with DJ Jo Whiley. The interview mainly focused on Oasis's then forthcoming gig in the grounds of Knebworth House, where Ocean Colour Scene were one of the supporting acts. Over 2.6 million people applied for tickets for the shows, making it the most in-demand concert in UK history. There was a combined audience of over 250,000 people."]}, {"page": "Sara Cox", "response": ["On 17 February 2008 Cox presented her last show for six months before leaving for maternity leave to have her second child. Annie Mac presented the show during her absence until Cox's return in September 2008. Cox and Annie Mac both later covered for Jo Whiley who was on maternity leave between 29 September 2008 to 20 February 2009. Following Whiley's return, Cox returned to weekends to present a Sunday mid-morning show, broadcasting between 10:00 and 13:00."]}, {"page": "Radio Academy Awards", "response": ["|Jo Whiley, for Lunchtime Social"]}, {"page": "Snow Patrol", "response": ["On 25 November 2007, Snow Patrol performed an acoustic session for the charity Mencap at Union Chapel, Islington. They were one of the main bands to take part in the project, called \"Little Noise Sessions\", which was curated by Jo Whiley."]}, {"page": "Dreamland Margate", "response": ["Jo Whiley."]}, {"page": "Liz Kershaw", "response": ["It was subsequently revealed by journalists and listeners that other shows presented by Russell Brand, Jo Whiley, Tony Blackburn and Dermot O'Leary were also involved in the same endemic production practices."]}, {"page": "Liquid News", "response": ["Liquid News was originally a vehicle for presenter Christopher Price. Following his death on 21 April 2002, the show continued with a variety of presenters including Colin Paterson, Claudia Winkleman, Julia Morris, Iain Lee, Jasmine Lowson, Paddy O'Connell, Jo Whiley, Joe Mace and Amanda Byram."]}, {"page": "High Contrast", "response": ["In 2007, he delivered his second effort, selected as 'Essential Mix of the Year' by Pete Tong. His third album Tough Guys Don't Dance was released in October 2007. The second single from the album, \"If We Ever\", was supported on Radio 1 by Annie Mac, Zane Lowe and Jo Whiley helping it to reach number 1 in the DnB chart, number 1 in the dance chart and number 4 in the Indie chart."]}, {"page": "The Word (TV series)", "response": ["Paul Ross was the series editor on series 3 and 4, and became executive producer for series 5. Jo Whiley worked as a researcher/band booker on series 2 and half of series 3 and is credited as having given Nirvana their historic and notorious first TV appearance."]}, {"page": "Student Radio Association", "response": ["The Student Radio Awards (SRAs) is an awards scheme celebrating talent within the UK student radio industry, held annually since 1995 and supported by BBC Radio 1, the ASRA and Global Radio. The awards are announced in a ceremony in November, with past presenters including well-known radio personalities, such as Fearne Cotton, Scott Mills, and Nick Grimshaw. The first awards took place at the University of London Union. Due to the increased popularity of the event, the SRAs moved to The indigO2 in London in 2008. The awards on offer range from Best Newcomer, Best Interview, and Best Live Event, up to the most prestigious, Best Student Station of the Year. The current Awards Chairperson is Stephanie Hirst. Previous chairs have included Huw Stephens, Steve Lamacq, and Jo Whiley."]}, {"page": "L.S.F. (song)", "response": ["* The song was recorded live for Jo Whiley's BBC Radio 1 Live Lounge and appears on the Live Lounge 3 CD."]}, {"page": "Simon Mayo", "response": ["Mayo has presented across three BBC stations for extended periods. From 1986 to 2001 he worked for Radio 1, including a five-year stint on the Radio 1 Breakfast Show. Since 2001 he has presented on   BBC Radio 5 Live: from his debut until 2009 on a daily afternoon programme, and since then with weekly Kermode and Mayo's Film Review on Fridays. Between January 2010 and December 2018 he was the presenter of Simon Mayo Drivetime on BBC Radio 2, for the final six months with co-host Jo Whiley. Since March 2021, Simon Mayo Drivetime has appeared on Greatest Hits Radio.", "Mayo remained on the mid-morning slot until he left BBC Radio 1 in 2001, seeing breakfast-show presenters Mark Goodier, Steve Wright, Chris Evans, Mark and Lard, Kevin Greening, Zoe Ball, and Sara Cox, come and go from the slot, but the slot went to Jo Whiley.", "In January 2010, Mayo took over from Chris Evans on the Drivetime show, noting he was \"very lucky to be given a second chance in such a high-profile slot.\" The programme included a number of regular daily features including a \"Nigel's Recipes\", \"Confessions\", \"Homework Sucks\" and \"The Showstopper\". Every Friday he hosted \"All-Request Friday\" where listeners rang the show and had their favourite song played on the radio after a short interview. The show ended on 4 May 2018 after 8 years, as Mayo was to begin hosting a revamped drivetime show with co-host Jo Whiley from 14 May 2018. On 22 October that year, the station announced that Mayo would be leaving BBC Radio 2 altogether after a backlash against the change, with Whiley moving back to an evening slot. Their last show together aired on 20 December, with Mayo presenting his last show after 17 years with the station the following day.", "**  Jo Whiley & Simon Mayo – Monday – Thursday 5pm8pm; Friday 5pm7pm, 14 May 2018 21 December 2018"]}, {"page": "Egton House", "response": ["Radio 1 moved to Yalding House on Great Portland Street in 1996, and Egton House was demolished in 2003 to make way for the Egton Wing of BBC Broadcasting House, later renamed the John Peel Wing.BBC Media Centre: \"BBC to name wing of new Broadcasting House after John Peel\", accessed 2012-03-02. Jo Whiley was the last presenter to broadcast from Egton House (12pm-2pm on Wednesday 9th October 1996).Radio Rewind: History of Egton House, accessed 2012-10-19."]}, {"page": "Ana Matronic", "response": ["From July 24–27, 2017, she covered for Jo Whiley and presented a special programme alongside Scott Mills on July 29 celebrating the 50th anniversary of the decriminalisation of male homosexual activity in the UK."]}, {"page": "Lauren Laverne", "response": ["Laverne replaced radio DJ Jo Whiley on the talent show Orange Mobile Act Unsigned, which searches for the top unsigned acts in the country."]}, {"page": "Ashes (Embrace song)", "response": ["\"Ashes\" is the second single from English rock band Embrace's fourth studio album, Out of Nothing. This release was publicised by a fan campaign called G.A.T.N.O (Get Ashes to Number One). The song reached number 11. \"Ashes\" was released to American radio on 1 March 2005. The B-side, \"Flaming Red Hair\", started life as a cover version of Michael Jackson's \"Thriller\". Another B-side, \"How Come\", a cover of the D12 song, was originally performed on Jo Whiley's BBC Radio 1 show."]}, {"page": "Great Brington", "response": ["* The disc jockey and television presenter Jo Whiley is from the village."]}, {"page": "Bootylicious", "response": ["English rock band Keane performed a medley consisting of \"Bootylicious\" and Christina Aguilera's \"Dirrty\" on Jo Whiley's Live Lounge. An audio recording is available on Radio 1's Live Lounge – Volume 2. The cast of the Fox television show Glee performed a cover version in the episode \"Hairography\". The Green Bay Packers covered the song in Pitch Perfect 2."]}, {"page": "James King (film critic)", "response": ["He presented the BBC Radio 1 show OneClick/Film from 2004 to 2006. In 2004, the BBC Radio 1 show James King's Movie News was nominated for a Sony Radio Academy Award in the Information Award category. In the past at BBC Radio 1 he has worked alongside Jo Whiley, has presented the Early Breakfast show, numerous Christmas Film Specials and one-off documentary programmes and has also stood-in for fellow film critic and friend Mark Kermode on Kermode and Mayo's Film Review on BBC Radio 5 Live. He also presented a weekly DVD review slot for BBC Radio 7. In 2005 he presented Homegrown Hollywood, a late-night television show on BBC2."]}, {"page": "Yellow (Coldplay song)", "response": ["A live acoustic version performed on Jo Whiley's The Lunchtime Social was included on the Acoustic EP. Another live version featuring only piano and vocals performed and broadcast in Los Angeles on KCRW's Morning Becomes Eclectic was included on the Japanese Clocks EP. Most recently an acoustic piano version the song was recorded in the studio for Starbucks charity compilation album Every Mother Counts 2012."]}, {"page": "The Scientist (song)", "response": ["\"The Scientist\" has been featured on two of Coldplay's live albums, in 2003 it was featured on Live 2003, in 2018, it was featured on the album Live in Buenos Aires. The song was covered live by Aimee Mann and released on a special edition of her album Lost in Space. Natasha Bedingfield, Alex Band, Eamon, and Avril Lavigne covered the song on Jo Whiley's Live Lounge radio show. Also, Belinda Carlisle did a live rendition on the ITV1 reality show Hit Me Baby One More Time. The British female quartet All Angels did a choral arrangement of the song on their album Into Paradise which was released in 2007. The chords to this song are replicated by Sum 41 in their song \"Pieces.\" In addition, the American television show MADtv did a parody of the video, called \"The Narcissist.\" Coldplay's original version plus a cover of the track performed by Johnette Napolitano and Danny Lohner were featured in the 2004 film Wicker Park. Allison Iraheta and Kris Allen performed an acoustic duet of the song at Oprah Winfrey's \"No Phone Zone\" rally in Los Angeles."]}, {"page": "Janice Long", "response": ["With the announcement of the new After Midnight programme on Radio 2 from October 2014, the show was on Mondays to Thursdays, midnight to 3 am. Long left her regular BBC Radio 2 slot after further changes to its schedule. Her final After Midnight show was on 26 January 2017. She returned to BBC Radio 2 standing in for Jo Whiley for a week commencing 10 April 2017 and was given her own series called A Long Walk With...https://www.bbc.co.uk/programmes/b09v5qp9/episodes/guide which went out between 2017-2018. "]}, {"page": "The Optimist LP", "response": ["Championed by radio DJs such as Jo Whiley (BBC Radio 1), the band provided a respite from the pop groups that dominated radio airplay at the time."]}, {"page": "Terry Christian", "response": ["Christian presented Barbed Wireless between 1982 and 1988. The show won Sony Awards in the Best Specialist Music category in 1985 and again in 1986. He also contributed regularly to Saturday Live on BBC Radio 1. From 1986 to 1988 he presented Radio 4's programme Wavelength, which became Wavelength Plus or WPFM, on which Jo Whiley was his researcher."]}, {"page": "Jayne Middlemiss", "response": ["Middlemiss worked for Noel Edmonds and Chris Evans before briefly working as a nanny, a shop assistant and a waitress. She worked for only two weeks as a trainee researcher on GMTV with Peter McHugh, before gaining her first presenting job on music show The O-Zone with Jamie Theakston from 1995. She got the audition for The O-Zone after she met presenter Toby Anstis at a party and he gave her tape to the producer. She then presented the Smash Hits Awards, The Phone Zone and Top of the Pops and its spin-off radio show on BBC Radio 1. She also regularly covered Jo Whiley's show and various other programmes on the same station."]}]}}