{"wiki_id": "http://www.wikidata.org/entity/Q1334680", "itemLabel": "Mel Sterland", "itemDescription": "English footballer and manager (born 1961)", "wikipedia_url": "https://en.wikipedia.org/wiki/Mel_Sterland", "wikipedia_page": {"main": "Melvyn Sterland (born 1 October 1961 in Sheffield) is an English former professional footballer who played in the Football League for Sheffield Wednesday and Leeds United and in the Scottish Football League Premier Division for Rangers, and was capped once for England.", "link_mentions": [{"page": "Hillsborough Stadium", "response": ["It hosted two England under-21 internationals. The first was a 1984 UEFA European Under-21 Championship Qualifying Group 3 match against France's under-21s on 28 February 1984. The hosts thrashed the visitors 6 – 1 with Mark Hateley scoring four goals as well as single goals from Dave Watson and Mel Sterland. The other was a 2006 UEFA European Under-21 Championship qualification Group 6 match against Poland's under-21s on 11 October 2005. The hosts thrashed the visitors 4 – 1 with Steven Taylor scoring twice as well as single goals from Carlton Cole and Jerome Thomas while Marcin Kikut scored for the visitors with 23,110 in attendance."]}, {"page": "Jack Charlton", "response": ["As the 1980–81 season came around Wednesday had young talent such as Mark Smith, Kevin Taylor, Peter Shirtliff and Mel Sterland breaking into the first team. The club were comfortable in the Second Division, finishing in tenth position."]}, {"page": "Dronfield", "response": ["* Mel Sterland, ex-Sheffield Wednesday F.C., Leeds United A.F.C and Rangers F.C. footballer"]}, {"page": "Boston United F.C.", "response": ["| Mel Sterland"]}, {"page": "Howard Wilkinson", "response": ["Wilkinson's greatest success as a manager came after moving to Wednesday's Yorkshire rivals Leeds United in October 1988. He soon drilled discipline into a lacklustre squad and earned the affectionate nickname \"Sergeant Wilko\", a play on the old TV character Sergeant Bilko. The team won the Second Division in 1989–90 after the signings of Gordon Strachan who became captain, hardman Vinnie Jones (who Wilkinson guided to a whole season with only three yellow cards), Mel Sterland, Chris Fairclough and Lee Chapman. Following the promotion, Wilkinson immediately offloaded Jones and brought in Gary McAllister from Leicester City and John Lukic was brought back from Arsenal. He also helped players who had come up through the youth team, Gary Speed and David Batty, to mature to the new level of football."]}, {"page": "List of people from Sheffield", "response": ["*Mel Sterland, footballer"]}, {"page": "Gary Kelly (footballer, born 1974)", "response": ["Kelly made his debut for Leeds in the 1991–92 season, although he did not become a regular in the side until the 1993–94 season, when Wilkinson made him his first choice right-back following the injury-induced retirement of Mel Sterland, occasionally filing in at centre back when needed."]}, {"page": "When Saturday Comes (film)", "response": ["*Mel Sterland – Captain Sheffield United"]}, {"page": "1988–89 in English football", "response": ["3 March 1989 – Rangers sign defender Mel Sterland from Sheffield Wednesday on a free.Mel Sterland: Career statistics. soccerbase. Retrieved 17 June 2013"]}, {"page": "1989–90 in English football", "response": ["6 July 1989 – After just four months at Glasgow Rangers, Mel Sterland leaves the Scottish league champions and returns to England in a move to Second Division Leeds United for £600,000."]}, {"page": "1991–92 in English football", "response": ["5 October 1991 – Leeds United get their title challenge back on track with a 4–3 home win over struggling Sheffield United, although they are still three points behind leaders Manchester United, who have two games in hand. Steve Hodge and Mel Sterland both score twice. Luton Town's struggles continue when they lost 4-0 at Aston Villa in a welcome victory for Ron Atkinson's team after a slow start to his first season in charge. Sheffield Wednesday move fourth with a 4-1 home win over Crystal Palace. Terry Butcher, at 32 the youngest manager in the league, has got off to a good start to his second season as manager of Coventry City, who occupy fifth place after a 1-0 win at West Ham.Tony Cottee becomes Everton's second hat-trick scorer of the league campaign, scoring all three goals in a 3-1 home win over Tottenham."]}, {"page": "1993–94 in English football", "response": ["21 January 1994: Mel Sterland, 32-year-old Leeds United defender, retires after failing to overcome an achilles injury suffered more than a year ago."]}]}}