{"wiki_id": "http://www.wikidata.org/entity/Q13377500", "itemLabel": "Clara Winsome Muirhead", "itemDescription": "Scottish botanist (1915–1985)", "wikipedia_url": "https://en.wikipedia.org/wiki/Clara_Winsome_Muirhead", "wikipedia_page": {"main": "Clara Winsome Muirhead (6 January 1916 – 7 March 1985) was a Scottish botanist and plant collector who spent most of her career at the Royal Botanic Garden in Edinburgh and was an expert on mosses, cacti, and succulents.", "link_mentions": [{"page": "Tullie House Museum and Art Gallery", "response": ["The museum has large and eclectic collections of zoological, botanical and geological material. The plant collector, Clara Winsome Muirhead worked at the museum in the 1940s and donated a large collection of botanical specimens to the museum. The fine and decorative arts collections include works by Burne-Jones and other Pre-Raphaelite artists, as well as Stanley Spencer, Winifred Nicholson, Sheila Fell and Phil Morsman."]}, {"page": "Garvellachs", "response": ["The area is part of the Scarba, Lunga and the Garvellachs National Scenic Area, one of 40 such areas in Scotlands, which are defined so as to identify areas of exceptional scenery and to ensure its protection by restricting certain forms of development. The Scottish plant collector, Clara Winsome Muirhead surveyed the plant life of the islands and published The Flora of  Easdale and the Garvellachs in 1962."]}, {"page": "Easdale", "response": ["By the early 1960s, the population had dwindled to only four people and the island appeared doomed. The island now has a population of around sixty people and is the smallest permanently inhabited island of the Inner Hebrides.This is true only if bridged and tidal islands are excluded. Eilean Bàn, which is part of the Skye Bridge and Eilean Donan, which is tidal, were both inhabited at the time of the 2001 Census and smaller.General Register Office for Scotland (28 November 2003) Occasional Paper No 10: Statistics for Inhabited Islands  The Scottish plant collector Clara Winsome Muirhead surveyed the plant life of the island and published The Flora of Easdale and the Garvellachs in 1962."]}, {"page": "Studley College", "response": ["The college offered a Diploma in Horticulture from 1924 and this was a three year course. In 1934 the college offered a degree course  of the University of London leading to a BSc in horticulture. Ekins was to serve as warden until 1946, when Mrs. K.G.Woolacott, became the new warden. The plant collector, Clara Winsome Muirhead studied horticulture at Studley between 1933 and 1935."]}, {"page": "List of botanists by author abbreviation (M)", "response": ["* Muirhead – Clara Winsome Muirhead (1915–1985)"]}, {"page": "Muirhead (surname)", "response": ["* Clara Winsome Muirhead (1916-1985), Scottish botanist"]}]}}