{"wiki_id": "http://www.wikidata.org/entity/Q1337729", "itemLabel": "Wayne McCullough", "itemDescription": "American boxer", "wikipedia_url": "https://en.wikipedia.org/wiki/Wayne_McCullough", "wikipedia_page": {"main": "Wayne Pocket Rocket McCullough (born Wayne William McCullough; 7 July 1970) is a former professional boxer from Northern Ireland who competed from 1993 to 2008. He held the WBC bantamweight title from 1995 to 1997, and challenged six times for world titles at super-bantamweight and featherweight. As an amateur, McCullough represented Ireland at the 1992 Summer Olympics, winning a bantamweight silver medal. He also won flyweight gold at the 1990 Commonwealth Games, representing Northern Ireland.\nIn addition to McCullough's dogged, relentless attacking style, he was renowned for his durable chin, having fought two of boxing's biggest punchers in Naseem Hamed and Érik Morales, and gone the full distance with both of them. During his bout with Morales in 1999, HBO commentator Larry Merchant joked, \"If you look in the dictionary, under 'Tough Irishman', you'll find a picture of Wayne McCullough\". McCullough was never once knocked down in his professional career. He also stopped the late Arturo Gatti as an amateur.", "link_mentions": [{"page": "Boxing", "response": ["Notable in-fighters include Henry Armstrong, Aaron Pryor, Julio César Chávez, Jack Dempsey, Shawn Porter, Miguel Cotto, Gennady Golovkin, Joe Frazier, Danny García, Mike Tyson, Manny Pacquiao, Rocky Marciano,James Roberts and Alexander Skutt, The Boxing Register, 1999, p.75 Wayne McCullough, James Braddock, Gerry Penalosa, Harry Greb,James Roberts, Alexander Skutt, The Boxing Register, 1999, p.98, 99James Roberts and Alexander Skutt, The Boxing Register, 1999, p.339, 340 David Tua, James Toney and Ricky Hatton. This style was also used by the Street Fighter character Balrog."]}, {"page": "Belfast", "response": ["Other significant sportspeople from Belfast include double world snooker champion Alex \"Hurricane\" Higgins and world champion boxers Wayne McCullough, Rinty Monaghan and Carl Frampton.", "* Wayne McCullough, WBC World Champion Boxer, Olympic Games Silver Medalist"]}, {"page": "July 7", "response": ["*1970 – Wayne McCullough, Northern Irish boxer"]}, {"page": "1970", "response": ["** Wayne McCullough, Northern Irish boxer"]}, {"page": "List of Irish people", "response": ["* Wayne McCullough – Olympic silver medalist; WBC World Boxing Champion"]}, {"page": "Ireland", "response": ["Amateur boxing on the island of Ireland is governed by the Irish Athletic Boxing Association. Ireland has won more medals in boxing than in any other Olympic sport. Michael Carruth won a gold medal and Wayne McCullough won a silver medal in the Barcelona Olympic Games. In 2008 Kenneth Egan won a silver medal in the Beijing Games. Paddy Barnes secured bronze in those games and gold in the 2010 European Amateur Boxing Championships (where Ireland came 2nd in the overall medal table) and 2010 Commonwealth Games. Katie Taylor has won gold in every European and World championship since 2005. In August 2012 at the Olympic Games in London, Taylor created history by becoming the first Irish woman to win a gold medal in boxing in the 60kg lightweight. More recently, Kellie Harrington won a gold medal at the 2020 Tokyo Olympics."]}, {"page": "Willie Jorrín", "response": ["Jorrín holds an amateur win over Wayne McCullough in McCullough's home country of Northern Ireland."]}, {"page": "Érik Morales", "response": ["In October 1999, Morales fought and defeated former WBC Bantamweight Champion Wayne McCullough of Northern Ireland, saying that McCullough gave him one of the toughest three fights of his career.", "|style=\"text-align:left;\"| Wayne McCullough"]}, {"page": "Shankill Road", "response": ["Secondary schools serving the Shankill area include the Belfast Boys' Model School and Belfast Model School for Girls due to their location in the Ballysillan area of the neighbouring Crumlin Road. Pupils from the area also attend Hazelwood College or Malone College which are both integrated schools, as well as Victoria College and the Royal Belfast Academical Institution both of which are grammar schools. Prior to its closure, and before several changes of name, Cairnmartin Secondary School also served the greater Shankill area. Famous pupils include footballer Norman Whiteside and boxer Wayne McCullough. The school, by then known as Mount Gilbert Community College, closed permanently in 2007 after a fall in pupil numbers.", "Wayne McCullough, a gold medalist at the Commonwealth Games and a world champion in the Bantamweight division and an olympic silver medalist at the 1992 Summer Olympics representing Ireland is a native of the Shankill. He is one of a number of boxers from the area to be featured on a mural on Gardiner Street celebrating the area's strong heritage in boxing. The image has since been moved to Hopewell Crescent. McCullough trained in the Albert Foundry boxing club, located in the Highfield estate where he grew up. Other locals to make an impact in the sport have included Jimmy Warnock, a boxer from the 1930s who beat world champion Benny Lynch twice, and his brother Billy.", "|Wayne McCullough"]}, {"page": "Michael Carruth", "response": ["Carruth's medal was Ireland's first ever gold medal in boxing, only a couple of hours after teammate Wayne McCullough had to settle for the silver in bantamweight. It was also the first Olympic gold medal for Ireland since Ronnie Delaney won the Men's 1500m event at the 1956 Olympic Games in Melbourne."]}, {"page": "1992 in Ireland", "response": ["*8 August – Michael Carruth wins Ireland's first gold medal in 36 years at the Olympic Games in Barcelona.  Wayne McCullough wins a silver medal."]}, {"page": "Culture of Northern Ireland", "response": ["* Wayne McCullough"]}, {"page": "List of WBC world champions", "response": ["|align=\"left\"| Wayne McCullough"]}, {"page": "Ireland at the 1988 Summer Olympics", "response": ["* Wayne McCullough"]}, {"page": "Canada at the 1988 Summer Olympics", "response": ["** Third Round — Defeated Wayne McCullough (Ireland), 5:0"]}, {"page": "Cuba at the 1992 Summer Olympics", "response": ["** Final – Defeated Wayne McCullough (IRL), 16:8"]}, {"page": "Joel Casamayor", "response": ["**Defeated Wayne McCullough (Ireland) points"]}, {"page": "Nigeria at the 1992 Summer Olympics", "response": [":* Quarterfinals – Lost to Wayne McCullough (IRL), 13:31"]}, {"page": "Eddie Futch", "response": ["Eddie Futch (August 9, 1911 – October 10, 2001) was an American boxing trainer.  Among the fighters he trained are Joe Frazier, Ken Norton, Larry Holmes, and Trevor Berbick, four of the five men to defeat Muhammad Ali. Futch also trained Riddick Bowe and Montell Griffin when they handed future Hall of Fame fighters Evander Holyfield and Roy Jones Jr. their first professional defeats. In Baltimore, Maryland, the Futch Gym boxing gymnasium is named after the trainer. He also trained Ireland’s first ever WBC World Champion, Wayne McCullough. Eddie Futch married Eva Marlene Futch March 21,1996 until his death. Futch often called her \"The love of his life.\"", "Eddie Futch was an outstanding trainer.  He prepared fighters to perform at the  highest levels of the sport for several decades.  Champions who worked under Futch's tutelage include Joe Frazier, Larry Holmes, Riddick Bowe, Michael Spinks, Alexis Arguello, Marlon Starling, Wayne McCullough, Montell Griffin, and his first world champion fighter, Don Jordan, who was crowned world welterweight champion in 1958."]}, {"page": "List of people from Belfast", "response": ["* Wayne McCullough, former world champion boxer and Olympic medalist"]}, {"page": "Point Theatre", "response": ["The Point has hosted many boxing fights featuring local fighter Bernard Dunne most notabally his fight for the EBU Super-Bantamweight title against Kiko Martinez. Other boxing events at the venue have been headlined by world champions Lennox Lewis, Naseem Hamed, Steve Collins and Wayne McCullough."]}, {"page": "Ri Gwang-sik", "response": ["*Lost to Wayne McCullough (Ireland) 16-21"]}, {"page": "Scott Harrison (boxer)", "response": ["Harrison made his first world title defense against Wayne McCullough in March 2003 at Braehead Arena. Harrison comprehensively outpointed McCullough winning on the judges' scorecards 119–109, 119-108 and 120–108. After the fight McCullough said Harrison was the strongest boxer he had faced.", "|style=\"text-align:left;\"| Wayne McCullough"]}, {"page": "McCullough", "response": ["* Wayne McCullough (born 1970), Northern Irish boxer"]}, {"page": "Chin (combat sports)", "response": ["* Wayne McCullough"]}, {"page": "Freddie Roach (boxing)", "response": ["| United Kingdom ||style=\"background:#faecc8;\"|−Wayne McCullough ||Featherweight ||"]}, {"page": "Óscar Larios", "response": ["Larios went on to defend his title 7 times (along with 3 non-title fights), including a victory over Nedal Hussein and two wins over fan favorite Wayne McCullough. He then took on Vázquez yet again but was dominated this time, dropping the trilogy capper by KO 3 and thus losing his title.  In July 2006, Larios moved up to Super Featherweight to take on then three-division world champion Manny Pacquiao, a Filipino boxer highly capable of besting opponents by KO. Larios fought bravely, but was dominated by the bigger Pacquiao and was dropped twice en route to losing a 12 round decision.", "|align=left| Wayne McCullough\t", "|align=left| Wayne McCullough\t"]}, {"page": "Fred Mutuweta", "response": ["Fredrick \"Fred\" Muteweta (born November 4, 1971 in Kampala) is a retired boxer from Uganda, who represented his native country at the 1988 Summer Olympics in Seoul, South Korea in the light-flyweight class. There he was defeated in the second round by Wayne McCullough of Ireland. In the bantamweight class at the 1992 Summer Olympics, he was once again defeated in his opening bout, once again by Wayne McCullough."]}, {"page": "Super bantamweight", "response": ["Notable fighters to hold championship titles at this weight have been Wayne McCullough, Guillermo Rigondeaux, Scott Quigg, Wilfredo Gómez,  Lupe Pintor, Jeff Fenech, Fabrice Benichou, Daniel Zaragoza, Kennedy McKinney, Érik Morales, Marco Antonio Barrera, Manny Pacquiao, Rafael Márquez, Toshiaki Nishioka, Carl Frampton, Bernard Dunne, Leo Santa Cruz,  Isaac Dogboe and Israel Vázquez. Gómez holds the record for longest title reign, at five years and ten months."]}, {"page": "Daniel Zaragoza", "response": ["This began a late-career surge for Zaragoza who was able to defend the title four times, including two wins against former and future champion Joichiro Tatsuyoshi in Japan, a tko win over Tsuyoshi Harada (20-1-0) also in Japan, and an upset win against undefeated bantamweight champion Wayne McCullough who had recently moved up in weight. On Sep 6, 1997, he lost his title to then-undefeated 21-year-old Erik Morales, who knocked out Zaragoza in the 11th round. Zaragoza retired after the bout at the age of 39 with a record of 55-8-3.", "|align=left| Wayne McCullough"]}, {"page": "List of world bantamweight boxing champions", "response": ["| Wayne McCullough"]}, {"page": "Oisin Fagan", "response": ["After Fagan's first nine pro fights he had a patchy record of six wins and three losses including a points defeat to Julio César Chávez Jr. Following this mediocre start to his career and a defeat to Derrick Moon in October 2004, Fagan had considered quitting boxing but was encouraged to continue by former world champion Wayne McCullough. Fagan then went to train with McCullough and found a new drive behind his boxing and decided to give boxing one final chance."]}, {"page": "1970 in the United Kingdom", "response": ["* 7 July – Wayne McCullough, boxer"]}, {"page": "List of Superstars competitors", "response": ["*Wayne McCullough"]}, {"page": "Template talk:Country data Ireland", "response": ["Is it possible to get a template for Olympic Council of Ireland, there are many olympic sports which are organised on an all Ireland basis. I was looking at the Wayne McCullough article, and I think it would be more appropriate to say he represented the Olympic Council of Ireland rather than to say he represented the Republic. Fasach Nua (talk) 17:14, 14 December 2007 (UTC)", ":Also, the Olympic articles use an entirely different set of flag templates.  For example, if you look at Athletics at the 2004 Summer Olympics - Women's 10000 metres, the flag icon and wikilink next to Marie Davenport's name (14th place) are generated from .  Notice that the wikilink points to Ireland at the 2004 Summer Olympics, not to Republic of Ireland.  This is probably close to what you are thinking of, as that article mentions the Olympic Council of Ireland (in the infobox, at least).  With respect to Wayne McCullough, I'd suggest replacing  in the medal box with , which will have the same visual appearance but will wikilink to Ireland at the Olympics.  Is that what you are thinking of?", ":The other comment worth mentioning here is that Wikipedia:WikiProject Olympics members have not completely installed the flagIOC set of templates on all past results pages, so if you reach Boxing at the 1992 Summer Olympics via the Wayne McCullough medal box, you won't be able to reach Ireland at the 1992 Summer Olympics from the bantamweight results, because we haven't got around to it yet.  Andrwsc (talk) 18:11, 14 December 2007 (UTC)", ":There is no doubt whatsoever that the tricolour should be used for every Olympic result for the Ireland (\"IRL\") team, and the Union Flag for every single \"GBR\" instance.  I don't think that is in dispute, nor should it be.  Most of the official reports show photographs of each team marching in the opening ceremonies, so there is easily verifiable sources to demonstrate that.  I am not completely certain of Fasach Nua's request, but my interpretation was that the wikilink to Republic of Ireland (via Template:IRL) in the Wayne McCullough article was problematic, which is why I suggested using an existing template to link to Ireland at the Olympics, which should solve the problem.  There is no doubt whatsoever that McCullough competed under the tricolour flag in 1992.  Andrwsc (talk) 00:33, 15 December 2007 (UTC)"]}, {"page": "1995 in Northern Ireland", "response": ["*Wayne McCullough wins WBC Bantamweight title."]}, {"page": "1970 in Northern Ireland", "response": ["*7 July – Wayne McCullough, boxer."]}, {"page": "Boxing at the 1990 Commonwealth Games", "response": ["|Wayne McCullough"]}]}}