{"wiki_id": "http://www.wikidata.org/entity/Q1335105", "itemLabel": "John Sessions", "itemDescription": "British comedian", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Sessions", "wikipedia_page": {"main": "John Gibb Marshall (11 January 1953 – 2 November 2020), better known by the stage name John Sessions, was a Scottish actor and comedian. He was known for comedy improvisation in television shows such as Whose Line Is It Anyway?, as a panellist on QI, and as a character actor in numerous films, both in the UK and Hollywood.", "link_mentions": [{"page": "Beachcomber (pen name)", "response": ["In 1989, BBC Radio 4 broadcast the first of three series based on Morton's work. This featured Richard Ingrams as Beachcomber, John Wells as Prodnose, Patricia Routledge and John Sessions. The compilations prepared by Mike Barfield.  Series 1 was also made available as a 2-cassette set."]}, {"page": "Joseph McCarthy", "response": ["McCarthy was portrayed by Peter Boyle in the 1977 Emmy-winning television movie Tail Gunner Joe, a dramatization of McCarthy's life. Archival footage of McCarthy himself was used in the 2005 movie Good Night, and Good Luck about Edward R. Murrow and the See It Now episode that challenged McCarthy.  McCarthy was also portrayed by Joe Don Baker in the 1992 HBO film Citizen Cohn. In the German-French docu-drama The Real American – Joe McCarthy (2012), directed by Lutz Hachmeister, McCarthy is portrayed by the British actor and comedian John Sessions.Dorothy Rabinowitz. \"A Name That Lives in Infamy\", Wall Street Journal, 23. November 2012 In Lee Daniels' 2020 film, The United States vs. Billie Holiday, McCarthy is portrayed by actor Randy Davison."]}, {"page": "Mervyn Peake", "response": ["In 2000, the BBC and WGBH Boston co-produced a lavish miniseries, titled Gormenghast, based on the first two books of the series. It starred Jonathan Rhys-Meyers as Steerpike, Neve McIntosh as Fuchsia, June Brown as Nannie Slagg, Ian Richardson as Lord Groan, Christopher Lee as Flay, Richard Griffiths as Swelter, Warren Mitchell as Barquentine, Celia Imrie as Countess Gertrude, Lynsey Baxter and Zoë Wanamaker as the twins Cora and Clarice, and John Sessions as Dr Prunesquallor. The supporting cast included Olga Sosnovska, Stephen Fry and Eric Sykes, and the series is also notable as the last screen performance by comedy legend Spike Milligan (as the Headmaster)."]}, {"page": "Die Fledermaus", "response": ["|John Sessions"]}, {"page": "Antonio Gramsci", "response": ["* Gramsci – Everything That Concerns People – John Sessions plays Gramsci in the 1984 Channel 4 film. Brian Cox narrates."]}, {"page": "Fish (singer)", "response": ["His first acting role was as a guest star in an episode of Zorro called \"The Newcomers\" (aired 10 February 1991) but a more prominent role was as the thug Ferguson alongside John Sessions in Jute City, a four-part 1991 BBC drama based on a group of Masonic ruffians."]}, {"page": "James Boswell", "response": ["Boswell was played by John Sessions in Boswell & Johnson's Tour of the Western Isles, a 1993 BBC 2 play."]}, {"page": "Stephen Fry", "response": ["Fry was cast in Simon Gray's The Common Pursuit for its first staging in the West End on 7 April 1988, with Rik Mayall, John Sessions, Sarah Berger, Paul Mooney and John Gordon Sinclair, directed by Simon Gray.The Common Pursuit: other productions on the Simon Gray website Retrieved 18 August 2010  He was also cast in a lead role in Simon Gray's 1995 play Cell Mates, which he left three days into the West End run, pleading stage fright. He later recalled the incident as a hypomanic episode in his documentary about bipolar disorder, The Secret Life of the Manic Depressive. In 2007, Fry wrote a Christmas pantomime, Cinderella, which ran at London's Old Vic Theatre."]}, {"page": "Whose Line Is It Anyway? (British TV series)", "response": ["During its history, the programme featured a variety of noted comedians from Britain, Canada and the United States. While initial series were frequented with performances by John Sessions, Stephen Fry, Paul Merton, Mike McShane, and Josie Lawrence, its popularity grew with the introduction of Ryan Stiles and Colin Mochrie, who became firm regulars towards the later series. The programme itself was mainly recorded in Britain, though two series had some episodes made in New York, and its final series was shot entirely in California before the programme was cancelled due to falling viewing figures.", "In 1988, Dan Patterson and Mark Leveson approached the BBC with a concept for a new comedy programme, involving a group of performers conducting games that encompassed improvisational comedy. The title of their concept was a comedic riposte to the radio programme What's My Line, which had recently moved to a television format, merged to the title of a 1972 play, Whose Life Is It Anyway?. Their pitch was well liked by the broadcaster, who green-lighted a radio programme for broadcast on BBC Radio 4, commissioning six episodes. Both Patterson and Leveson opted for it to be presented by Clive Anderson, with both John Sessions and Stephen Fry joining him as regular performers in each episode, and music being provided by Colin Sell."]}, {"page": "Improvisation", "response": ["Notable pioneers in the field of improvisation, comedic or otherwise, include Mike Myers, Neil Mullarkey, Paul Merton, Stephen Fry, John Sessions, Josie Lawrence, Viola Spolin, Paul Sills, David Shepherd, Del Close, Josephine Forsberg, Gary Austin, Martin de Maat, and Keith Johnstone. Notable performers include: Paul Merton, Stephen Colbert, Steve Carell, Bill Murray, Harold Ramis, Robert Townsend, Colin Mochrie, Ryan Stiles, Ross Noble, Eddie Izzard, Tony Slattery, Mike McShane, Sandi Toksvig, Wayne Brady, Jonathan Winters, T. J. Jagodowski, Robin Williams, Conan O'Brien and David Pasquesi."]}, {"page": "Surbiton", "response": ["Surbiton is popularly remembered as an icon of suburbia in such British television programmes as The Good Life (starring Richard Briers, Penelope Keith, Paul Eddington and Felicity Kendal), though location filming was done in Northwood, North-West London,The Good Life house for sale and John Sessions and Phil Cornwell's comedy series Stella Street."]}, {"page": "Jonathan Pryce", "response": ["Pryce worked once again with Gilliam in The Adventures of Baron Munchausen (1988), playing \"The Right Ordinary Horatio Jackson\". The film was a notorious financial fiasco,Robert Parish, James (2006). Fiasco: A History of Hollywood's Iconic Flops. Wiley.  with production costing more than $40 million, when the original budget was $23.5 million.\"Losing The Light – Terry Gilliam & The Munchausen Saga (a summary)\". Hal Leonard Online. Retrieved 6 November 2007.\"The Adventures of Baron Munchausen\". Box Office Mojo. Retrieved 6 November 2007. The following year Pryce appeared in three of the earliest episodes of the improvisation show Whose Line Is It Anyway?, alongside Paul Merton and John Sessions,\"\"Whose Line is it Anyway?\" – Episode Guide – Series one (1988)\". WhoseLine.net. Retrieved 26 November 2007. and in Uncle Vanya, again a play by Chekhov,  at the Vaudeville Theatre."]}, {"page": "The Bounty (1984 film)", "response": ["* John Sessions as John Smith"]}, {"page": "2002 in film", "response": ["| Gangs of New York || Miramax Films || Martin Scorsese (director); Jay Cocks, Steven Zaillian, Kenneth Lonergan (screenplay); Leonardo DiCaprio, Daniel Day-Lewis, Cameron Diaz, John C. Reilly, Henry Thomas, Jim Broadbent, Liam Neeson, Brendan Gleeson, Gary Lewis, Stephen Graham, Eddie Marsan, Alec McCowen, David Hemmings, Lawrence Gilliard Jr., Cara Seymour, Roger Ashton-Griffiths, Barbara Bouchet, Michael Byrne, John Sessions, Richard Graham, Giovanni Lombardo Radice || Period, Drama || Live Action"]}, {"page": "1996 in film", "response": ["| A Midwinter's Tale || Rank Film Distributors / Castle Rock Entertainment || Kenneth Branagh (director/screenplay); Michael Maloney, Richard Briers, Hetta Chamley, Joan Collins, Nicholas Farrell, Mark Hadfield, Gerard Horan, Celia Imrie, Jennifer Saunders, Julia Sawalha, John Sessions, Ann Davies, James D. White, Robert Hines, Allie Byrne, Adrian Scarborough, Brian Pettifer, Patrick Doyle, Shaun Prendergast, Carol Starks, Edward Jewesbury, Katy Carmichael, Paul Randles || Romance, Comedy || Live action", "| The Adventures of Pinocchio || New Line Cinema / Savoy Pictures || Steve Barron (director/screenplay); Sherry Mills, Tom Benedek, Barry Berman (screenplay); Martin Landau, Jonathan Taylor Thomas, Genevieve Bujold, Udo Kier, Bebe Neuwirth, Rob Schneider, Corey Carrier, Dawn French, Richard Claxton, Joe Swash, John Sessions, Jerry Hadley, Jean-Claude Dreyfus, David Doyle (voice) || Fantasy, Family || Live action"]}, {"page": "1999 in film", "response": ["| A Midsummer Night's Dream || Fox Searchlight Pictures / Regency Enterprises || Michael Hoffman (director/screenplay); Kevin Kline, Michelle Pfeiffer, Rupert Everett, Stanley Tucci, Calista Flockhart, Anna Friel, Christian Bale, Dominic West, David Strathairn, Sophie Marceau, Roger Rees, Max Wright, Gregory Jbara, Bill Irwin, Sam Rockwell, Bernard Hill, John Sessions || Romance || Live action"]}, {"page": "1994 in film", "response": ["| Princess Caraboo || TriStar Pictures / Beacon Pictures || Michael Austin (director/screenplay); John Wells (screenplay); Phoebe Cates, Jim Broadbent, Wendy Hughes, Kevin Kline, John Lithgow, Stephen Rea, Peter Eyre, Jacqueline Pearce, John Wells, John Lynch, John Sessions, Arkie Whiteley, Jerry Hall, Anna Chancellor || Historical, Comedy, Drama || Live action"]}, {"page": "1989 in film", "response": ["| Henry V || The Samuel Goldwyn Company / BBC Films || Kenneth Branagh (director/screenplay); Kenneth Branagh, Paul Scofield, Derek Jacobi, Ian Holm, Emma Thompson, Alec McCowen, Judi Dench, Christian Bale, James Larkin, Simon Shepherd, Brian Blessed, Charles Kay, Nicholas Ferguson, Edward Jewesbury, Danny Webb, Ian Holm, Jimmy Yuill, John Sessions, Shaun Prendergast, Patrick Doyle, Michael Williams, Robbie Coltrane, Richard Briers, Geoffrey Hutchings, Robert Stephens, Michael Maloney, Nigel Greaves, Harold Innocent, Richard Easton, Colin Hurley, Geraldine McEwan, David Lloyd Meredith, Christopher Ravenscroft, David Parfitt, James Simmons, Paul Gregory, Tom Whitehouse, Fabian Cartwright, Stephen Simms, Jay Villiers, Richard Clifford, Julian Gartside || Drama || Live action"]}, {"page": "1992 in film", "response": ["| Freddie as F.R.O.7 || Miramax Films / J&M Entertainment || Jon Acevski (director/screenplay); Ben Kingsley, Jenny Agutter, Brian Blessed, Nigel Hawthorne, Sir Michael Hordern, James Earl Jones, Edmund Kingsley, Phyllis Logan, Victor Maddern, Jonathan Pryce, Prunella Scales, John Sessions, Billie Whitelaw, Adrian De La Touche, David Ashton, Jenny Funnell || Adventure, Fantasy, Musical || Animation"]}, {"page": "1984 in film", "response": ["| The Bounty || Orion Pictures Corporation / Thorn EMI Screen Entertainment || Roger Donaldson (director); Robert Bolt (screenplay); Mel Gibson, Anthony Hopkins, Laurence Olivier, Edward Fox, Daniel Day-Lewis, Bernard Hill, Philip Davis, Liam Neeson, Wi Kuki Kaa, Tevaite Vernette, Philip Martin Brown, Simon Chandler, Malcolm Terris, John Sessions, Andrew Wilde, Neil Morrissey, Richard Graham, Dexter Fletcher, Pete Lee-Wilson, Jon Gadsby, Barry Dransfield, Steve Fletcher, Jack May || History, Drama || Live action"]}, {"page": "University Challenge", "response": ["*John Sessions – reserve for UCNW Bangor, 1973"]}, {"page": "Gangs of New York", "response": ["* John Sessions as Harry Watkins"]}, {"page": "All Gas and Gaiters", "response": ["In April 2016 the radio drama based on the story behind the making of the series, All Mouth and Trousers by Mark Burgess, was aired by BBC Radio 4. The production featured John Sessions as Frank Muir, Nicholas Boulton as Stuart Allen, Gareth Williams as William Mervyn, Trevor Littledale as Robertson Hare, Zeb Soanes as Derek Nimmo and David Collings as John Barron."]}, {"page": "Spitting Image", "response": ["*John Sessions (1986)", "During 2004, the idea of the series coming back started to appear after John Lloyd held talks with ITV executives about the show's return. John Lloyd also held talks with a number of people who voiced the Spitting Image puppets, including John Sessions, Harry Enfield and Rory Bremner, with all responding positively."]}, {"page": "Jackanory", "response": ["In November 2006 Jackanory briefly returned with comedian John Sessions as the revived programme's first narrator reading the Lord of the Rings parody Muddle Earth, written by Paul Stewart (and illustrator Chris Riddell). The second narrator was Sir Ben Kingsley, reading The Magician of Samarkand by Alan Temperley. They were broadcast in three 15-minute slots on CBBC and BBC One and later repeated in their entirety on BBC One on consecutive Sundays. The readings of Muddle Earth were heavily accompanied by animation and featured John Sessions speaking the lines of all the animated characters (and occasionally reading those of Joe whenever he was not on-screen), leading to criticism that the spirit of the original programme, a single voice telling a tale with minimal distractions, had been lost. (The original series had occasionally included dramatised material, in e.g. 1984's Starstormers by Nicholas Fisk, and increasingly so towards the end of its run in the mid-1990s.) The Magician of Samarkand was a similar production, albeit without the actors speaking additional lines; Ben Kingsley read both the story and the lines of all the characters. Both of these stories were produced and directed by Nick Willing.", "*John Sessions "]}, {"page": "Arthur Lowe", "response": ["Robert Daws portrayed Lowe in the BBC Radio 4 drama Dear Arthur, Love John by Roy Smiles, first broadcast in 2012. The play charts the relationship between Lowe and John Le Mesurier. John Sessions played him in the 2015 television movie We're Doomed! The Dad's Army Story."]}, {"page": "Mycroft Holmes", "response": ["* In the 2015 film Mr. Holmes, set in 1947, though it is revealed that Mycroft died a year or so earlier, he appears briefly, played by John Sessions."]}, {"page": "QI", "response": ["* John Sessions"]}, {"page": "Largs", "response": ["* John Sessions comedian, most known for regular appearances on Whose Line is it Anyway and QI."]}, {"page": "Professor Challenger", "response": ["* Professor William Rutherford, the real-life model for Challenger, is portrayed by actor John Sessions in one of the series of BBC Films titled Murder Rooms: The Dark Beginnings of Sherlock Holmes. The episode by Stephen Gallagher opens with the young Conan Doyle's attendance at a lantern slide lecture by famed explorer Everard im Thurn featuring the 'Lost World' plateau of Mount Roraima. The story goes on to hint at experiences that Doyle would later draw upon for the novel."]}, {"page": "Peter Richardson (British director)", "response": ["Although he did not reach the same level of public recognition as some of his contemporaries, Richardson was influential on British television comedy throughout the 1980s as the driving force behind The Comic Strip Presents... films, one of the first examples of alternative comedy to appear on British television. Richardson has been involved in the production of over 40 Comic Strip films and has directed 17 of them. The series won a Rose D'Or for The Strike in 1988. He developed the series into feature films; The Supergrass, Eat the Rich, The Pope Must Die, and Churchill: The Hollywood Years, none of which achieved great box office success. In the 1990s, Richardson introduced a new generation of performers, Doon Mackichan, Mark Caven, Phil Cornwell, Sara Stockbridge, George Yiasoumi and Gary Beadle, who appeared in his productions. He co-wrote and also directed the 1990s cult mockumentary comedy series Stella Street with Phil Cornwell and John Sessions. In 2004, Richardson co-founded the production company Great Western Features with Nick Smith, which is based in Totnes, Devon. In 2005, he directed the Comic Strip film Sex Actually. In the 2010s, Richardson wrote and directed two more Comic Strip films, 2011's The Hunt for Tony Blair and 2012's Five Go To Rehab.", "Apart from the Comic Strip, Richardson's best-known work is the sitcom Stella Street, which he directs and co-writes with impressionists John Sessions and Phil Cornwell. A Stella Street feature film was released in 2004. He also directed the mock documentary Lust for Glorious about comedian Eddie Izzard with Mark Caven and Phil Kay."]}, {"page": "List of Have I Got News for You episodes", "response": ["|John Sessions", "|John Sessions"]}, {"page": "The Lost Prince", "response": ["* John Sessions – Henry Hansell"]}, {"page": "Doctor Who (film)", "response": ["Casting sessions took place in March 1994; actors who actually auditioned for the role include Liam Cunningham, Mark McGann, Robert Lindsay, Tim McInnerny, Nathaniel Parker, Peter Woodward, John Sessions, Anthony Head, and Tony Slattery. Paul McGann was first considered around the time of these auditions, but did not formally audition for the part until later.", "*John Sessions guest-starred in the Series 8 episode \"Mummy on the Orient Express\" as the voice of the homicidal computer GUS."]}, {"page": "William Boyd (writer)", "response": ["Boyd adapted two Anton Chekhov short stories – \"A Visit to Friends\" and \"My Life (The Story of a Provincial)\" – to create the play Longing. The play, directed by Nina Raine and performed at London's Hampstead Theatre, starred Jonathan Bailey, Tamsin Greig, Natasha Little, Eve Ponsonby, John Sessions and Catrin Stewart. Previews began on 28 February 2013; the press night was 7 March 2013. Boyd, who was theatre critic for the University of Glasgow in the 1970s and has many actor friends, refers to his ambition to write a play as finally getting \"this monkey off my back\". A further play by Boyd, The Argument, described as a Strindberg-like take on human dynamics, was performed at Hampstead Theatre Downstairs in March 2016. Both plays have been published."]}, {"page": "Absolute Power (radio and TV series)", "response": ["*John Sessions"]}, {"page": "The Adventures of Pinocchio (1996 film)", "response": ["* John Sessions as the Professor, an irritable teacher who Pinocchio inadvertently annoys while attending one of his classes."]}, {"page": "In the Bleak Midwinter (film)", "response": ["* John Sessions as Terry Du Bois (Queen Gertrude), a flamboyantly gay theatrical actor with an estranged son and a preoccupation with costume."]}, {"page": "Michael Berkeley", "response": ["Since 1995 Berkeley has presented BBC Radio 3's Private Passions, in which celebrities are invited to choose and discuss several pieces of music. In December 1997, one of his guests was a 112-year-old Viennese percussionist called Manfred Sturmer, who told anecdotes about Brahms, Clara Schumann, Richard Strauss, Arnold Schoenberg and others so realistically that some listeners did not realise that the whole thing was a hoax perpetrated by Berkeley and John Sessions. On 30 December 2018, the Prince of Wales was the guest on Private Passions, in order to mark the passing of over one thousand editions of the programme, and to celebrate the prince's 70th birthday."]}, {"page": "Bernard Levin", "response": ["In 1981 Levin took a sabbatical from The Times after Rupert Murdoch bought the paper and Harold Evans succeeded Rees-Mogg as editor. Evans and Levin were friends,Levin (1985), p. 209 but Levin had publicly stated his preference that Charles Douglas-Home should be appointed. Within a year Evans and Murdoch fell out and Evans left in 1982; Douglas-Home became editor, and coaxed Levin back, to write two columns a week. On returning to the paper in October 1982, he began his column with the words, \"And another thing\".Levin, Bernard, \"A noble dream, but I won't see it and nor will you\", The Times, 22 October 1982, p. 12 This mirrored his opening gambit when publication of The Times resumed in 1979 after a printers' strike lasting nearly a year: his first column then had begun with the word \"Moreover\".Levin, Bernard, \"Of cripplers, halt-bringers and working men\", The Times, 13 November 1976, p. 16 By the 1980s Levin was sufficiently well known to be the subject of satire himself. The satirical ITV show Spitting Image caricatured him in high-flown discussion with another well-known intellectual in a sketch entitled \"Bernard Levin and Jonathan Miller Talk Bollocks\".Jackson, Lawrence. \" Radio: Revamped Radio 4 takes flight with angels and insects\", The Independent, 12 April 1998. The voice of the Levin figure was provided by Jon Glover and that of Miller by John Sessions. By now, Levin's political views were moving to the right, and he was no longer writing so much against the grain of his newspaper. He had come to admire Margaret Thatcher, though not the rest of her party: \"But there is one, and only one, political position that, through all the years and all my changing views and feelings, has never altered, never come into question, never seemed too simple for a complex world. It is my profound and unwavering contempt for the Conservative Party\".Levin, Bernard. \"Sit down, gentlemen, and be counted\", The Times, 19 March 1990"]}, {"page": "Kevin Eldon", "response": ["Eldon occupies half a page in Oliver Gray's book called Volume - A Cautionary Tale of Rock and Roll Obsession; this includes coverage of punk-era Hampshire where, in late 1978, with two schoolmates from Bay House School, Gosport, Eldon started a band named Virginia Doesn't. Virginia Doesn't's career peaked with a session broadcast on Radio One's John Peel Show on 18 October 1979. In early 1980, Virginia Doesn't morphed into The Time, in which Eldon was again the front man. The Time recorded and performed from April 1980 until August 1982, during which time the band gigged extensively and played support slots with The Jam, Joe Jackson's Jumpin' Jive and Bad Manners. The Time had songs included on several self-released tape compilations, although they never secured a recording contract. In August 1982, The Time became Gerry Hackett & The Fringes, a spoof Sixties revival band. On 6 November 1983 Gerry Hackett & The Fringes appeared on BBC South's 'The Cellar Show' presented by John Sessions. Eldon started on the stand-up circuit in the early 1990s performing an act in-character as the political poet Paul Hamilton, but has also, on occasion, done stand-up as himself."]}, {"page": "Josie Lawrence", "response": ["In 2018, she played the lover of a married man portrayed by former \"Whose Line\" castmate John Sessions in the feature film Finding Your Feet."]}, {"page": "Tartuffe", "response": ["A translation by Ranjit Bolt was staged at London's Playhouse Theatre in 1991 with Abigail Cruttenden, Paul Eddington, Jamie Glover, Felicity Kendal, Nicholas Le Prevost, John Sessions and Toby Stephens. Bolt's translation was later staged at London's National Theatre in 2002 with Margaret Tyzack as Madame Pernelle, Martin Clunes as Tartuffe, Clare Holman as Elmire, Julian Wadham as Cleante and David Threlfall as Orgon."]}, {"page": "Lenin of the Rovers", "response": ["Lenin of the Rovers was a BBC Radio 4 comedy series from 1988 written by Marcus Berkmann, produced by Harry Thompson and starring comedian Alexei Sayle as Ricky Lenin, Russian captain of Felchester Rovers - Britain's only communist football team.  Other regular players in the team were Stevie Stalin (played by Andrew McClean) and Terry Trotsky (played by Keith Allen in series 1 and by Phil Cornwell in series 2).  The team was managed by Ray Royce and Colonel Brace-Cartwright (played by veteran actor Ballard Berkeley for Series 1 episodes 1 and 2. Berkeley died during recordings for the series and the part was then played by Donald Hewlett thereafter) who were frequently interviewed by Frank Lee Brian (played by real-life football commentator Kenneth Wolstenholme). John Sessions and Jim Broadbent made character appearances in Series 2.  The title is a parody of the long-running football-themed comic strip, Roy of the Rovers."]}, {"page": "Richard J. Evans", "response": ["Evans' involvement in the trial was included in the 2016 film Denial, in which he was played by British actor John Sessions."]}, {"page": "L'Illusion Comique", "response": ["Ranjit Bolt's translation was dramatized and broadcast on BBC Radio 3 on 25 September 2011 directed by Peter Kavanagh with original music composed and performed by Russell Taylor and Steve Cooke. The cast included: Richard Johnson as Alcandre, Michael Maloney as Clindor, John Sessions as Matamore, Hattie Morahan as Isabelle, Benjamin Whitrow as Géronte, Pip Torrens as Adraste, Rosie Fellner as Lyse, Paul Moriarty as Pridamant, Simon Bubb as Dorante and Victoria Inez-Hardy as Empress/Queen."]}, {"page": "Liz Lochhead", "response": ["| Sophie Thompson, John Sessions, Greg Wise, Peter Forbes, David McKay, Angela Darcy, Siobhan Redmond, Phoebe Waller-Bridge and Maynard Eziashi"]}, {"page": "J. B. Morton", "response": ["A BBC radio programme Beachcomber by the Way, based on the column, was broadcast for 18 episodes from 1989 to 1994, with Richard Ingrams playing the voice of Beachcomber. John Wells, John Sessions and Patricia Routledge played supporting parts, in particular Wells as the impertinent questioner Prodnose forever asking Beachcomber what he meant by what he said."]}, {"page": "The Man Who Came to Dinner", "response": ["For Christmas Day, 2000, BBC Radio 4 broadcast a Marcy Kahan adaptation of The Man Who Came to Dinner approved by the Hart and Kaufman estates which starred Simon Callow as Whiteside, Elizabeth McGovern as Maggie, with Conleth Hill as Bert Jefferson, Cheryl Campbell as Lorraine Sheldon, John Sessions as Banjo and Professor Metz, Colin Stinton as Mr. Stanley, and Malcolm Sinclair as Beverley Carlton. Moira Petty, writing in The Stage, said, \"\"Director Ned Chaillet elicited from his cast ... a smart, gag-telling pace, which gave it a sensational period flavour.\""]}]}}