{"wiki_id": "http://www.wikidata.org/entity/Q1330103", "itemLabel": "William Henry Sleeman", "itemDescription": "British colonial administrator", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Henry_Sleeman", "wikipedia_page": {"main": "Major-general Sir William Henry Sleeman KCB (8 August 1788 – 10 February 1856) was a British soldier and administrator in British India. He is best known for his work from the 1830s in suppressing the organized criminal gangs known as Thuggee. He also discovered the holotype specimen of the sauropod dinosaur Titanosaurus indicus in Jabalpur in 1828.\n\n", "link_mentions": [{"page": "Thuggee", "response": ["To take advantage of their victims, the thugs would join travellers and gain their confidence, which would allow them to surprise and strangle the travellers with a handkerchief or noose. They would then rob and bury their victims. This led to the thugs being called Phansigar (\"using a noose\"), a term more commonly used in southern India. During the 1830s, the thugs were targeted for eradication by the Governor-General of India, Lord William Bentinck, and his chief captain, William Henry Sleeman.", "thumb|alt=Portrait of a middle-aged man in uniform|William Henry Sleeman, superintendent of the Thuggee and Dacoity Department", "In Following the Equator, Mark Twain wrote about an 1839 government report by William Henry Sleeman:", "* Firingi Thagi (2015), a Bengali novel by Himadrikishore Dasgupta, is a fictionalized rendering of Sir William Henry Sleeman's operations against the Thugs."]}, {"page": "1830s", "response": ["In 1835, William Henry Sleeman captured \"Feringhea\" in his efforts to suppress the Thuggee secret society.  Sleeman's work led to his appointment as General Superintendent of the operations for the Suppression of Thuggee.  In February 1839, he assumed charge of the office of Commissioner for the Suppression of Thuggee and Dacoity. During these operations, more than 1400 Thugs were hanged or transported for life."]}, {"page": "Human sacrifice", "response": ["Thuggees, tuggees or thugs, were a religious cult devoted to Kali and an organized gang of professional robbers and murderers who traveled in groups across the Indian subcontinent for several hundred years. They were first mentioned in Ẓiyā'-ud-Dīn Baranī's  () dated around 1356. In the 1830s British Governor-General of India William Bentinck, along with his chief captain William Henry Sleeman made a concerted effort to put an end to the activities of the Thuggee. The effort proved successful, with the cult's activities being fully eradicated in the span of a few decades. Thugs would join travellers and gain their confidence. This would allow them to then surprise and strangle them by tossing a handkerchief or noose around their necks. The killings were performed in honour of the goddess Kali and were very ritualistic. They would then rob the bodies of valuables and bury them. This led them to also be called Phansigar (), a term more commonly used in southern India."]}, {"page": "Taj Mahal", "response": ["Another such unsupported theory is that the Taj Mahal was designed by an Italian, Geronimo Vereneo, held sway for a brief period after it was first promoted by Henry George Keene in 1879 who went by a translation of a Spanish work Itinerario, (The Travels of Fray Sebastian Manrique, 1629–1643). Another theory that a Frenchman, Austin of Bordeaux designed the Taj was promoted by William Henry Sleeman based on the work of Jean-Baptiste Tavernier. These ideas were revived by Father Hosten and discussed again by E.B. Havell and served as the basis for subsequent theories and controversies."]}, {"page": "Lord William Bentinck", "response": ["Lieutenant General Lord William Henry Cavendish-Bentinck  (14 September 177417 June 1839), known as Lord William Bentinck, was a British soldier and statesman. He served as Governor-General of India from 1828 to 1835. He has been credited for significant social and educational reforms in India, including abolishing sati, suppressing female infanticide and human sacrifice. Bentinck said that \"the dreadful responsibility hanging over his head in this world and the next, if… he was to consent to the continuance of this practice (sati) one moment longer.\" Bentinck after consultation with the army and officials passed the Bengal Sati Regulation, 1829 there was little opposition. The only challenge came from the Dharma Sabha which appealed in the Privy Council, however the ban on Sati was upheld. He ended lawlessness by eliminating thuggee – which had existed for over 450 years – with the aid of his chief captain, William Henry Sleeman. Along with Thomas Babington Macaulay he introduced English as the language of instruction in India."]}, {"page": "Titanosaurus", "response": ["The holotype vertebrae were discovered during an exploration to Jabalpur in 1828 by Capt William Henry Sleeman of the East India Company army. His was one among many explorations for fossils initially carried out by army personnel, medical doctors and priests who chanced upon them just by being “fairly literate and mobile at the time”. He stumbled across the vertebrae on Bara Simla Hill near a British Army gun carriage workshop while searching for petrified wood. Sleeman, employed by the Bengal Army, regarded the bones as curiosities. He gave two vertebral pieces to surgeon G. G. Spilsbury, who had a practice in Japalpur and who also excavated a bone himself. Spilsbury sent the fossils in 1832 to the antiquarian James Prinsep in Calcutta, who realised that they were fossilised bones and then sent them back to Sleeman.Sleeman, W. H, 1844. Rambles and recollections of Indian official, Vol. I , London, J. Hatchard & Son, 478 pp. In 1862, Thomas Oldman, the first director of the newly established Geological Survey of India, transferred the vertebrae from Japalpur to Calcutta and added them to the collection of the Indian Museum. There, the bones were studied by the Survey's supervisor, Hugh Falconer, who concluded that they were reptilian bones.Falconer, H., (1868). \"Notes on fossil remains found in the Valley of the Indus below Attock, and at Jubbulpoor\". 414–419 in: Murchison, C. (ed.) Palaeontological Memoirs and Notes of the late Hugh Falconer, vol. I. Fauna Antiqua Sivalensis. Robert Hardwicke, London After Falconer's death, Richard Lydekker described the vertebrae as a new species of reptile known as Titanosaurus indicus."]}, {"page": "Saugor and Nerbudda Territories", "response": ["In 1842–1843, during the Bundela rising, two Bundela landlords rebelled against the British in Sagar district, spreading the unrest to Jabalpur District. Following the uprising the territory was placed again under the administration of an Agent to the Governor-General, Sir William Henry Sleeman, but the arrangement did not work well and in 1853 the Saugor and Nerbudda Territories were reattached to the North-Western Provinces.Shiri Ram Bakshi, S.R. Bakshi & O.P. Ralhan eds., Madhya Pradesh Through the Ages. Sarup & Sons. p. 12"]}, {"page": "Raebareli district", "response": ["Woodlands once covered a large area in Raebareli district, but this has mostly been cleared to make room for agriculture. In the 1800s, William Henry Sleeman described a large jungle stretching out for 12 miles on either side of the Sai, which historically formed a stronghold of the Nain Kanhpurias; after their participation in the Indian Rebellion of 1857, the British cut down parts of it to break it up. Patches of dhak jungle remain throughout the areas with stiff soils, as well as along the Sai, but their total area is negligible."]}, {"page": "William Sleeman", "response": ["#REDIRECT William Henry Sleeman"]}, {"page": "Colin Sleeman", "response": ["Sleeman was born in Bristol, where his father was a solicitor.  He was related to Sir William Henry Sleeman, an administrator in India in the first half of the 19th century who was responsible for suppressing the Thuggee sect. Sleeman was educated at Clifton College,\"Clifton College Register\" Muirhead, J.A.O. p191: Bristol; J.W Arrowsmith for Old Cliftonian Society; April, 1948 and then read Jurisprudence at Merton College, Oxford."]}, {"page": "Ghazi Saiyyad Salar Masud", "response": ["In the 19th century, the British administrators were bewildered at the Hindu veneration of Masud. William Henry Sleeman, the British Resident in Awadh, remarked:"]}, {"page": "Sleemanabad", "response": ["Sleemanabad, literally \"Sleeman's town\", was named after William Henry Sleeman, a British soldier and administrator during the colonial period Sleeman was one of the key figures responsible for bringing an end to the Thuggee Cult..Dash, Mike Thug: the true story of India's murderous cult , 2005"]}, {"page": "Vincent Arthur Smith", "response": ["* Smith, Vincent Arthur (1893). Editor of  William Henry Sleeman's Rambles and Recollections of an Indian official Volume 1, Rambles and Recollections of an Indian official Volume 2 Westminster Reprint edition of the 1893 (2 volumes)"]}, {"page": "Joseph Fox the younger", "response": ["#Emily (after March 1792 – Newton Abbott, South Devon, 8 March 1866) married Philip Sleeman (1791/2 – 31 Mar 1869), brother of William Henry Sleeman."]}, {"page": "Inland Customs Line", "response": ["Despite its scale, the customs line and associated hedge were not widely known in either Britain or India, the standard histories of the period neglecting to mention them.. Roy Moxham, a conservator at the University of London library, wrote a book on the customs line and his search for its remains that was published in 2001.  This followed his finding, in 1995, of a passing mention of the hedge in Major-General Sir William Henry Sleeman's work Rambles and Recollections of an Indian Official.  Moxham looked up the hedge in the India Office Records of the British Library and determined to locate its remnants.."]}, {"page": "Babaria", "response": ["British authorities in Punjab Province became frustrated by the criminal behaviour they perceived to be exhibited by some nomadic and semi-itinerant communities, including the Babaria, some of whom had developed a tactic of raiding British-controlled territories and then seeking refuge in areas controlled by native princes. The authorities thought that limiting the movement of these groups would minimise this as well as allowing for better monitoring of their activities and encouraging them to switch from criminality to agricultural pursuits. Inspired by the reported successes of William Henry Sleeman in controlling the Thuggees of the North-Western Provinces, they initially attempted to restrict movement by imposing a system of compulsory registration at police stations, insisting on the targeted people being in their own village overnight unless they had permission for absence, and loading of responsibility for their location and actions on to the village headmen. These measures were easily evaded by many nomads, who just dispersed or proffered different identities."]}, {"page": "Oudh State", "response": ["| Sir William Henry Sleeman || 1849 || 1854 "]}, {"page": "1839 in India", "response": ["*Major-General William Henry Sleeman heads the Thuggee and Dacoity Department from February 1839"]}, {"page": "Sleeman (surname)", "response": ["* William Henry Sleeman (1788–1856), British colonial administrator"]}, {"page": "Sataon", "response": ["Along with Korihar, Sataon historically gave its name to a large taluqdari estate called Korihar Sataon, which was held by a branch of the Bais Rajputs. This branch was founded by Pahar Singh, one of the eight sons of Rana Doman Deo of Khajurgaon. Along with his brother Mitrajit Singh, ancestor of the taluqdars of Pahu, Pahar Singh accompanied Aurangzeb on his expedition to Kandahar, and both brothers died in an avalanche in 1647. Ten generations later, the taluqdar Gur Bakhsh Singh died childless, and his territories were seized by Rana Raghunath Singh of Khajurgaon until 1832. At that point, Gur Bakhsh Singh's adopted son Fateh Bahadur was able to recover the taluqa with the aid of Beni Madho Bakhsh of Shankarpur. Beni Madho Bakhsh himself then attempted to take over the taluqa via security interest, but the British agent William Henry Sleeman interfered and Fateh Bahadur ended up again recovering the taluqa by paying off a debt of Rs. 40,000. His descendants maintained possession of the estate into the 20th century."]}, {"page": "Korihar", "response": ["Korihar was historically the seat of the taluqdari estate called Korihar Sataon, which was held by a branch of the Bais Rajputs. This branch was founded by Pahar Singh, one of the eight sons of Rana Doman Deo of Khajurgaon. Along with his brother Mitrajit Singh, ancestor of the taluqdars of Pahu, Pahar Singh accompanied Aurangzeb on his expedition to Kandahar, and both brothers died in an avalanche in 1647. Ten generations later, the taluqdar Gur Bakhsh Singh died childless, and his territories were seized by Rana Raghunath Singh of Khajurgaon until 1832. At that point, Gur Bakhsh Singh's adopted son Fateh Bahadur was able to recover the taluqa with the aid of Beni Madho Bakhsh of Shankarpur. Beni Madho Bakhsh himself then attempted to take over the taluqa via security interest, but the British agent William Henry Sleeman interfered and Fateh Bahadur ended up again recovering the taluqa by paying off a debt of Rs. 40,000. His descendants maintained possession of the estate into the 20th century."]}]}}