{"wiki_id": "http://www.wikidata.org/entity/Q13479530", "itemLabel": "Joseph Gatt", "itemDescription": "English actor and model", "wikipedia_url": "https://en.wikipedia.org/wiki/Joseph_Gatt", "wikipedia_page": {"main": "Joseph Gatt (born 3 December 1974) is an English actor and model. He is best known for his roles in the films Thor (2011), Star Trek Into Darkness (2013), and Dumbo (2019).", "link_mentions": [{"page": "2000 in film", "response": ["| Jason and the Argonauts || NBC / Hallmark Entertainment / Panfilm || Nick Willing (director); Matthew Faulk (screenplay); Jason London, Frank Langella, Natasha Henstridge, Derek Jacobi, Olivia Williams, Angus Macfadyen, Dennis Hopper, Jolene Blalock, James Callis, Brian Thompson, Adrian Lester, Ciarán Hinds, Diana Kent, David Calder, Mark Lewis Jones, Hugh Quarshie, Olga Sosnovska, Kieran O'Brien, Tom Harper, Omid Djalili, John Sharian, Elliot Levey, Norman Roberts, Greg Hicks, Adam Cooper, John Bennett, Richard Bonehill, Freda Dowie, Zoë Eeles, Andrew Scarborough, Joseph Gatt, Rhys Miles Thomas, Mark Folan Deasy, Xavier Anderson, Charles Cartmell, Dodger Phillips, Peter Gevisser, Mickey Churchill, Andrew Tansey, Zeta Graff, Alit Kreiz, Alan Stocks, Suzanne Harbison, Freya Archard, Mike Savva || Adventure, Fantasy || Live action"]}, {"page": "Dumbo", "response": ["On July 8, 2014, Walt Disney Pictures announced that a live-action adaptation of Dumbo was in development. In the same announcement, Ehren Kruger was confirmed as the screenwriter, as well as co-producer with Justin Springer. On March 10, 2015, Tim Burton was announced as the director. On January 11, 2017, it was reported that Will Smith was in talks to star in the remake as the father of some children who befriend Dumbo. That same day, it was revealed that Tom Hanks had reportedly been offered to play the film's villain. The following month, it was announced that Smith would not be starring in the film. Smith had apparently passed on the project due to a disagreement over salary and scheduling as well as to star in Bad Boys for Life, however, went on to play the role of the Genie in the 2019 live-action remake of Aladdin. In March 2017, it was reported that Eva Green was in talks to play a trapeze artist. Following this announcement, Danny DeVito was cast as a ringleader named Medici. Two weeks later, it was reported that Colin Farrell had entered negotiations to play the role of Holt, which was originally offered to Will Smith. On April 4, 2017, Michael Keaton, Burton's former frequent collaborator, entered talks to star as the villain. Keaton confirmed his involvement with the film on June 26, 2017. Filming took place at Cardington Studios in Bedfordshire, England. On July 15, 2017, Disney announced the casting for all of the principal roles and that the film would be released on March 29, 2019. DeObia Oparei, Joseph Gatt and Alan Arkin also play new characters created for the film."]}, {"page": "List of Maltese people", "response": ["* Joseph Gatt (born 1974) actor, model, voice artist"]}, {"page": "Star Trek Online", "response": ["Agents of Yesterday is Star Trek Onlines third expansion, announced on May 5, 2016, as the game's contribution to the 50th anniversary of Star Trek. The expansion allows for the creation of Starfleet player characters from the era of the original series who become involved in an ongoing \"Temporal Cold War\" (a storyline that was introduced in Enterprise, and brought into STO with the \"Future Proof\" missions in Season 11) with the Na'kuhl species. Matt Winston reprised his role as Daniels, the temporal agent who fought alongside Captain Jonathan Archer to stop the Na'kuhl in several episodes of Enterprise. He was also joined by Walter Koenig, reprising his role as Pavel Chekov, and Chris Doohan as Montgomery Scott, filling in for his late father, James Doohan. The expansion also intersects with the alternate timeline from the reboot series begun in 2009 by J. J. Abrams; Joseph Gatt reprises his role as the cyborg science officer 0718, who appeared in Star Trek Into Darkness."]}, {"page": "Pulse (2006 film)", "response": ["* Joseph Gatt as Über Phantom"]}, {"page": "Jason and the Argonauts (miniseries)", "response": ["*Joseph Gatt (uncredited) as Atlas"]}, {"page": "Shūhei Sakaguchi", "response": ["*Dumbo (Neils Skellig (Joseph Gatt))"]}, {"page": "Thor (film)", "response": ["Additionally, Clark Gregg reprises his role as S.H.I.E.L.D. agent Phil Coulson from the Iron Man films. Maximiliano Hernández appears as S.H.I.E.L.D. agent Jasper Sitwell, Adriana Barraza plays diner owner Isabella Alvarez and Isaac Kappy plays a pet store clerk. Joseph Gatt, Joshua Cox, and Douglas Tait portray Frost Giants. Stan Lee and J. Michael Straczynski have cameo appearances as pick-up truck drivers, Walter Simonson has a cameo appearance as one of the guests at a large Asgardian banquet, and Samuel L. Jackson and Jeremy Renner have uncredited cameos as Nick Fury and Clint Barton, respectively.", "In December 2009, Rene Russo was cast as Frigga, Thor's mother and Odin's wife. Later that month, actors Joseph Gatt, Troy Brenna, and Joshua Cox had been cast in the film, though none of their roles were revealed. In January 2010, Adriana Barraza had joined the film's cast, in a supporting capacity. Only days before filming began, Stuart Townsend was replaced by Joshua Dallas as Fandral, citing \"creative differences\". When Spider-Man 4s production stalled, Paramount and Marvel Entertainment pushed up the release of Thor by two weeks to May 6, 2011."]}, {"page": "Comicpalooza", "response": ["Comicpalooza 2013 was held on May 24–26, 2013. It was the year it made media history that was featured in numerous publications all over the world for the Guest panel featuring Sir Patrick Stewart and his emotional response to a question by a fan regarding domestic violence. Other guests included Michael Golden, Scott Steiner, Danny Trejo, Tom Kane, Benjamin Percy, Rachel Caine, Joseph Gatt, Michelle Rodriguez, Armin Shimerman, Rene Auberionois, Avery Brooks, Kris Holden-Ried, Zoie Palmer, Sam Huntington, Tabith St. Germain, Andrea Libman, Craig Parker, Richard Horvitz, Bernie Wrightson, Abney Park, Alan Dean Foster, George Perez, Jacqueline Carey, Chris Claremont, Julie Bell, Boris Vallejo."]}, {"page": "List of Game of Thrones characters", "response": ["| Joseph Gatt || Thenn Warg || colspan=3  ||  || colspan=4 "]}, {"page": "List of American films of 2011", "response": ["| Thor || Paramount Pictures / Marvel Studios || Kenneth Branagh (director); Mark Protosevich, Zack Stentz, Ashley Edward Miller, Don Payne (screenplay); Chris Hemsworth, Natalie Portman, Tom Hiddleston, Stellan Skarsgård, Colm Feore, Ray Stevenson, Idris Elba, Kat Dennings, Rene Russo, Anthony Hopkins, Tadanobu Asano, Josh Dallas, Jaimie Alexander, Adriana Barraza, Clark Gregg, Maximiliano Hernández, Joseph Gatt, Douglas Tait, Jamie McShane, Dale Godboldo, Patrick O'Brien Demsey, J. Michael Straczynski, Matt Battaglia, Stan Lee, Joel McCrary, Isaac Kappy, Samuel L. Jackson, Jeremy Renner, Walter Simonson || Superhero, Action, Adventure, Fantasy || "]}, {"page": "Banshee (TV series)", "response": ["* Joseph Gatt as \"The Albino\": A prisoner who served time with Hood and was granted custody of him. (recurring seasons 1–2, guest season 4)"]}, {"page": "Star Trek Into Darkness", "response": ["Additional members of the Enterprise crew include Amanda Foreman as Ensign Brackett, Jay Scully as Lieutenant Chapin, Jonathan Dixon as Ensign Froman, Aisha Hinds as Navigation Officer Darwin, and Joseph Gatt as Science Officer 0718. Deep Roy and Jason Matthew Smith reprise their roles as Keenser and Hendorff from the first film. Anjini Taneja Azhar, Nolan North, and Sean Blakemore also appear in the film, with Azhar as Lucille Harewood, the terminally ill daughter of Thomas Harewood; North portraying a Vengeance helmsman; and Blakemore playing a Klingon. Heather Langenkamp portrays Moto, a character she describes as a small role. Meanwhile, Ser'Darius Blain portrays a security lieutenant aboard the Enterprise."]}, {"page": "Game of Thrones (season 4)", "response": ["* Joseph Gatt as a Thenn warg"]}, {"page": "From Dusk till Dawn: The Series", "response": ["* Joseph Gatt as Skull Keeper"]}, {"page": "Z Nation", "response": ["* Joseph Gatt as The Man (season 3)  The Man first appears in the first episode of season 3, \"No Mercy\". Following a list created by his Zona employer, it is his job to collect people by any means necessary and ship them to Zona. He is ruthless and will take out anyone in his way. He is known to have completely decimated at least two survivor communities to obtain the people on his list. He has a perfect success rate and has yet to lose a target. As of the second episode of season 3, \"A New Mission\", The Man's current list contains only one name: \"Alvin Bernard Murphy\". He was later killed by Addy when both fell from a cliff in the Zona base in order to prevent Lucy from being captured by the Zona forces. "]}, {"page": "Star Trek Beyond", "response": ["The first film's major cast members signed on for two sequels as part of their original deals. In 2014, early in the film's development, William Shatner said that he was contacted by producer Abrams to see if he would be interested in a possible role, but as the process continued and the script changed hands, the role never materialized. Alice Eve was not included in the film despite her character having joined the Enterprise crew at the end of the last installment, because Pegg, in writing the script, did not have anything meaningful for her to do; however, he stressed that Eve could appear in a later installment. Joseph Gatt's cyborg Science Officer 0718 was dropped from the film after a rewrite. In March 2015, Idris Elba was in early talks to play the villain, and he was confirmed for the role in the following months. Pegg noted that the villain would be an original one, rather than a known antagonist from past stories in the Star Trek franchise. In April, Sofia Boutella joined the cast in a lead role, and in early July, Deep Roy was confirmed to reprise his role of Keenser. That month, Joe Taslim was added to the cast opposite Elba's villain, and by August, Lydia Wilson joined as well. In March 2016, Shohreh Aghdashloo was cast as Commodore Paris for reshoots on the film."]}, {"page": "List of The 100 characters", "response": ["* Joseph Gatt as Tristan (seasons 1–2): A military leader of the Grounders who takes command of the attack against the 100's camp at the end of the first season. Though heavily scarred, Tristan is one of the few to survive the ring of fire that kills most of the Grounder's army and hunts the few delinquents that escaped Mount Weather's roundup. He is ultimately shot and killed by Marcus Kane to save the captured delinquents."]}, {"page": "Dumbo (2019 film)", "response": ["* Joseph Gatt as Neils Skellig, a South African hunter and Vandevere's right-hand man.", "In March 2017, Burton's frequent collaborators, Eva Green and Danny DeVito, joined the cast as Colette, a trapeze artist, and Max Medici, the circus' ringmaster, respectively. Due to her fear of heights, Green trained with aerialist Katherine Arnold and choreographer Fran Jaynes in order to prepare for the role. In April 2017, another veteran of Burton's films, Michael Keaton, joined Dumbo, to complete the casting of prominent \"adult\" roles. Tom Hanks was reportedly in discussions for the role before Keaton's casting. Hanks would instead sign on for the role of Geppetto in Disney's 2022 live-action film adaptation of Pinocchio. In the summer of 2017, DeObia Oparei, Joseph Gatt, and Alan Arkin joined the cast. DeVito said that \"[he loves] Tim and [he] would do anything to be in a movie with him.\" He also said that Burton is \"[a]lways spirited, always an artist, always thinking about the craft, always painting with his mind,\" and that he felt like \"part of some kind of palette, a color scheme\" while filming the movie."]}, {"page": "Strike Back: Legacy", "response": ["Other guest stars included Dustin Clare, James Wilby, Adrian Paul, Joseph Gatt, Christian Antidormi, Michael McElhatton, Leo Gregory, Mark Griffin, Wolf Kahler, Andrew Pleavin, Eliza Bennett, Masa Yamaguchi, and British mixed martial artist Michael Bisping. Stephanie Vogt is set to reprise her role as Christy Bryant from Strike Back: Vengeance. Of the guest cast, particularly Beesley and Yeoh, head of drama for Sky Cameron Roach said \"it's fantastic to have Michelle and Max join the cast of Strike Back for its final season, which will be its biggest ever.\""]}, {"page": "Stan Lee's Lucky Man", "response": ["* Joseph Gatt as Yury Becker; a hitman hired by Golding (Series 1)"]}, {"page": "Gatt (surname)", "response": ["*Joseph Gatt (born 1974), English actor"]}, {"page": "List of people with color blindness", "response": ["! scope=\"row\" |Joseph Gatt"]}, {"page": "List of Z Nation characters", "response": ["| scope=\"row\" | Joseph Gatt", "The Man (Joseph Gatt; season 3) first appears in One Punch Man. Following a list created by his Zona employer, it is his job to collect people by any means necessary and ship them to Zona. He is ruthless and will take out anyone in his way. He is known to have completely decimated at least two survivor communities to obtain the people on his list. He has a perfect success rate and has yet to lose a target. As of the second episode of season 3, \"A New Mission\", The Man's current list contains only one name: \"Alvin Bernard Murphy\". His fate is unknown to the group following the season 3 finale, as he is not mentioned again."]}, {"page": "List of Teen Wolf secondary characters", "response": ["| id=\"Mute\" | \"The Mute\" || Joseph Gatt || 4 || Unknown"]}, {"page": "Gatt, Joseph", "response": ["#redirectJoseph Gatt"]}]}}