{"wiki_id": "http://www.wikidata.org/entity/Q1340803", "itemLabel": "Garry Monk", "itemDescription": "English footballer (born 1979)", "wikipedia_url": "https://en.wikipedia.org/wiki/Garry_Monk", "wikipedia_page": {"main": "Garry Alan Monk (born 6 March 1979) is an English football manager and former professional player who played as a centre back, and was most recently the manager of Championship club Sheffield Wednesday. His managerial career includes spells at Swansea City, Leeds United, Middlesbrough and Birmingham City.\nMonk played for Swansea City in all four divisions of professional football from 2004 to 2014, for the majority of that time as captain. He played 270 matches for Swansea in all competitions over ten seasons, and was part of their team which won the 2013 Football League Cup Final.", "link_mentions": [{"page": "Sheffield Wednesday F.C.", "response": ["On 6 September 2019, the club appointed former Birmingham City manager Garry Monk as the new manager, who achieved a 16th-place finish in a season that was interrupted from March to June by the COVID-19 pandemic. On 31 July 2020, Sheffield Wednesday were found guilty of breaking EFL spending rules and began the 2020–21 season on –12 points, though the deficit was later reduced to –6 upon appeal. On 9 November 2020, Monk was sacked after a poor start to the season and was replaced by Tony Pulis. However, Pulis was also dismissed after only 45 days in charge on 28 December 2020. After a few months with Neil Thompson as caretaker manager, Darren Moore was appointed as the club's third permanent manager of the season in March 2021. Despite taking the fight to the final day, Moore could not prevent relegation come the end of the season, bringing Wednesday's 9-year spell in the Championship to an end."]}, {"page": "Birmingham City F.C.", "response": ["Two wins from 24 matches under Zola left Birmingham needing two wins from the last three games to stay up, which they achieved under the managership of Harry Redknapp. Redknapp lasted another month, his former assistant Steve Cotterill five months, leaving successor Garry Monk anotherultimately successfulrelegation battle. Despite budgetary restrictions and a nine-point deduction for breaches of the League's Profitability and Sustainability (P&S) rules, the team finished 17th in 2018–19; however, Monk was sacked in June after conflict with the board. He was succeeded by his assistant, Pep Clotet, initially as caretaker. In the 2019–20 season, a season that was suspended from March to June 2020 due to the COVID-19 pandemic, the club once again avoided relegation despite a 14-match winless run at the end of the season and the threat of a further points deduction. Academy product Jude Bellingham was sold to Borussia Dortmund in the summer for a club-record deal reported to be worth up to £30 million, after which Aitor Karanka lasted eight months as head coach before being replaced by former Birmingham player Lee Bowyer."]}, {"page": "Middlesbrough F.C.", "response": ["The club appointed former Leeds United manager Garry Monk as manager in the off-season. Expectations at the club were high, having spent close to £50 million in the transfer window on player purchases, in order to mount an immediate promotion challenge back to the Premier League. Monk left in December, with Middlesbrough ninth in the Championship and underachieving, and Tony Pulis was appointed as his replacement. Pulis led the side to finish 5th in the table to qualify for the playoffs, but lost in the semi-final to Aston Villa. The following season Pulis looked to secure the playoffs once again, but a poor finish to the season caused them to finish 7th and miss out on the playoffs by one point. Pulis subsequently left his position at the club after his contract expired on 17 May 2019.", "| 2017 || Garry Monk"]}, {"page": "Swansea City A.F.C.", "response": ["Swansea enjoyed initial success in Europe, beating Spanish side Valencia 3–0 at the Mestalla Stadium in September 2013. On 3 November 2013, Swansea lost the first Welsh derby in the Premier League to Cardiff City following a 1–0 defeat. In February 2014, Laudrup was dismissed from the club after a poor run of form. Defender Garry Monk, a Swansea player since 2004, was named as his replacement. In Monk's first game in charge, Swansea beat Cardiff 3–0 at the Liberty Stadium on 8 February 2014. Despite holding Rafael Benítez's Napoli to a 0–0 draw in the first leg of the Europa League Round of 32, Swansea exited the competition after losing 3–1 in the second leg at the Stadio San Paolo on 27 February 2014.", "On 9 December 2015, manager Garry Monk was sacked after one win in eleven matches. The club, after a period with Alan Curtis as caretaker manager for the third time, chose the Italian former Udinese Calcio coach Francesco Guidolin. During the 2016–17 preseason, Swansea City came under new ownership by an American consortium led by Jason Levien and Steven Kaplan, who bought a controlling interest in the club in July 2016. Chairman Huw Jenkins remained at the club. On 3 October 2016, Guidolin was sacked and replaced by American coach Bob Bradley. The selection of Bradley marked the first time a Premier League club had ever hired an American manager. Bradley himself was sacked after just 85 days in charge; he won only two of his 11 games, conceded 29 goals, and left with a win percentage of just 18.1%.", "Following Swansea's promotion to the Premier League at the end of the 2010–11 season, the South Wales derby was again put on hiatus. It would be two seasons before the sides met once more, this time on the worldwide stage of the Premier League. On 3 November 2013, Cardiff took the bragging rights in the first ever Premier League South Wales derby, enjoying a 1–0 win courtesy of ex-Swan Steven Caulker at the Cardiff City Stadium. The return fixture for that season took place on 8 February 2014 at Swansea's Liberty Stadium, a match in which interim player-manager Garry Monk would make his managerial debut following the sacking of Michael Laudrup. The Swans took revenge for the defeat earlier in the season with a convincing 3–0 win."]}, {"page": "Louis van Gaal", "response": ["On 4 February 2015, Van Gaal was charged by The Football Association (FA) over comments he made about the referee Chris Foy, saying, \"Every aspect of a match is against us – the pitch, the referee\" during United's goalless draw with Cambridge United. After a requested hearing with the FA, Van Gaal was cleared of his charges, but was warned of future conduct. On 8 February, Van Gaal was criticised by West Ham United manager Sam Allardyce for his long ball tactics after the Hammers conceded a late equaliser to United. Van Gaal responded to the criticism with statistics which seem to show that West Ham have played more long balls than his side. His tactics were defended by fellow managers Arsène Wenger and Garry Monk."]}, {"page": "James Beattie (footballer)", "response": ["He was previously a part of Garry Monk's backroom staff, working with him at Birmingham City, Middlesbrough, Leeds United, Swansea City and Sheffield Wednesday.", "On 16 June 2015, Beattie was appointed as a first-team coach at Premier League club Swansea City, coaching the team's forwards. He joined former teammate Garry Monk's coaching staff. In December 2015, following Monk's dismissal as manager, Beattie left Swansea City alongside Pep Clotet and Kristian O'Leary."]}, {"page": "Jonathan Woodgate", "response": ["After a brief spell as an international scout for Liverpool in Spain and Portugal, on 31 March 2017, Woodgate was appointed as an assistant coach to newly appointed Middlesbrough caretaker manager Steve Agnew, following the dismissal of Aitor Karanka, with Woodgate becoming one of three new arrivals in the club's coaching staff alongside fellow part-timers Joe Jordan and Paul Jenkins. After the club were relegated from the Premier League at the end of the season, Woodgate vacated his position after new manager Garry Monk brought in his own coaching staff, with him being replaced by James Beattie."]}, {"page": "Tony Pulis", "response": ["On 26 December 2017, Pulis was appointed as manager of Championship club Middlesbrough, replacing the sacked Garry Monk, who left the club ninth in the Championship table, after an indifferent first half to their season. On that same day as his appointment, Pulis was present in the stands to watch Middlesbrough, managed by Academy manager Craig Liddle in the interim period, defeat Bolton Wanderers 2–0 at the Riverside Stadium. Pulis' first match in charge of Middlesbrough ended in a 1–0 home defeat to Aston Villa.", "On 13 November 2020, Pulis returned to management after over a year out of football, joining Championship club Sheffield Wednesday, the second consecutive appointment for which he had replaced Garry Monk. He brought in Mike Trusson as his assistant manager and Craig Gardner as first-team coach during his first week. His first match in charge ended in a 1–0 defeat against Preston North End after Josh Windass was sent off, after 17 minutes. He got his first point the following game in another away game, a 1–1 draw against Swansea City, with Adam Reach getting the first goal of his reign. After the 2–0 defeat to Nottingham Forest, he broke the record for worst start for any manager at Sheffield Wednesday, getting 3 points from a possible 24. He won his first game as manager at the ninth time of asking against Coventry City in a 1–0 win, with Tom Lees getting the winning goal. On 28 December 2020, Pulis was sacked as Wednesday manager after having secured just one victory from ten league games. Sky Sports reported that major disagreements between Pulis and club owner Dejphon Chansiri over transfer plans for the upcoming January transfer window were the main cause of Pulis's dismissal. Chansiri later described his appointment of Pulis as a \"mistake\"."]}]}}