{"wiki_id": "http://www.wikidata.org/entity/Q13420582", "itemLabel": "Mildred Cooke", "itemDescription": "English noblewoman and translator", "wikipedia_url": "https://en.wikipedia.org/wiki/Mildred_Cooke", "wikipedia_page": {"main": "Mildred Cecil (née Cooke), Lady Burghley (1526 – 4 April 1589) was an English noblewoman and translator in the sixteenth century. She was the wife of William Cecil, 1st Baron Burghley, the most trusted adviser of Elizabeth I, and the mother of Robert Cecil, 1st Earl of Salisbury, adviser to James I.", "link_mentions": [{"page": "William Cecil, 1st Baron Burghley", "response": ["William, the only son, was put to school first at The King's School, Grantham, and then Stamford School, which he later saved and endowed. In May 1535, at the age of fourteen, he went to St John's College, Cambridge, where he was brought into contact with the foremost scholars of the time, Roger Ascham and John Cheke, and acquired an unusual knowledge of Greek. He also acquired the affections of Cheke's sister, Mary, and was in 1541 removed by his father to Gray's Inn, without having taken a degree, as was common at the time for those not intending to enter the Church. The precaution proved useless and four months later Cecil committed one of the rare rash acts of his life in marrying Mary Cheke. The only child of this marriage, Thomas, the future Earl of Exeter, was born in May 1542, and in February 1543 Cecil's first wife died. Three years later, on 21 December 1546 he married Mildred Cooke, who was ranked by Ascham with Lady Jane Grey as one of the two most learned ladies in the kingdom, (aside from another of Ascham's pupils, Elizabeth Tudor, who was later Elizabeth I)  and whose sister, Anne, was the wife of Sir Nicholas Bacon, and later the mother of Sir Francis Bacon.", "Secondly, he married Mildred Cooke, eldest daughter of Sir Anthony Cooke of Gidea, Essex and Anne Fitzwilliam, and they had the following issue:"]}, {"page": "Robert Cecil, 1st Earl of Salisbury", "response": ["Cecil (created Earl of Salisbury in 1605) was the younger son of The 1st Baron Burghley by his second wife, Mildred Cooke, eldest daughter of Sir Anthony Cooke of Gidea, Essex. His elder half-brother was The 1st Earl of Exeter, and philosopher Francis Bacon was his first cousin."]}, {"page": "Anthony Cooke", "response": ["*Mildred Cooke (1526–89), who in December 1545 married, as his second wife, William Cecil, 1st Baron Burghley, by whom she was the mother of Robert Cecil, 1st Earl of Salisbury."]}, {"page": "George Ballard (biographer)", "response": ["*Mildred Cooke, Mildred Cecil, 'Lady Burleigh' (1526–1689), daughter of Sir Anthony Cooke, married William Cecil, 1st Baron Burghley"]}, {"page": "Thomas Stanhope", "response": ["Thomas Stanhope was the eldest son of Sir Michael Stanhope and Anne Rawson (c.1515 – 20 February 1588), the daughter of Nicholas Rawson, of Aveley, Essex, and Beatrix Cooke (d. 14 January 1554), daughter of Sir Philip Cooke (d. 7 December 1503) and Elizabeth Belknap (died c. 6 March 1504),; .Sir Philip Cooke and Elizabeth Belknap were the great-grandparents of Mildred Cooke, Lady Burghley."]}, {"page": "Michael Stanhope (died 1552)", "response": ["At some time before November 1537, Stanhope married Anne Rawson (c. 1515 – 20 February 1588), a daughter of Nicholas Rawson of Aveley in Essex, by his wife Beatrix Cooke (d. 14 January 1554), a daughter of Sir Philip Cooke (d. 7 December 1503) by his wife Elizabeth Belknap (died c. 6 March 1504)..Sir Philip Cooke and Elizabeth Belknap were the great-grandparents of Mildred Cooke, Lady Burghley. Beatrix was the aunt of Sir Anthony Cooke. By his wife he had seven sons and four daughters as follows, as recorded in the inscription on her monument in St. Peter and St. Paul's Church, Shelford:.; .Monuments in Shelford church, Shelford & Nottingham Church History Project Retrieved 3 April 2013."]}, {"page": "Roger Townshend (courtier, died 1590)", "response": ["Townshend married secondly, Jane Stanhope (c. 1547–1618), the daughter of Sir Michael Stanhope (died 1552) of Shelford, Nottinghamshire, by his wife, Anne Rawson (c. 1515 – 20 February 1588), the daughter of Nicholas Rawson, of Aveley, Essex, and Beatrix Cooke (d. 14 January 1554), daughter of Sir Philip Cooke (d. 7 December 1503) by Elizabeth Belknap (died c. 6 March 1504).; ; .Sir Philip Cooke and Elizabeth Belknap were the great-grandparents of Mildred Cooke, Lady Burghley."]}, {"page": "William Cooke (of Highnam)", "response": ["Cooke's father's eldest sister, Mildred Cooke, had married Lord Burghley, and Cooke received patronage from both Burghley and Sir Robert Cecil, his own first cousin. Cecil's influence may have secured him his seats in Parliament. In 1597 he was elected a Member of Parliament for Helston. By January 1599 he was Purveyor to the Stable and had sufficient property to offer himself, with six men and horses, for service to Queen Elizabeth I. In 1601 he was elected an MP for Westminster. He was knighted at Theobalds House on 7 May 1603. In 1604 he was elected an MP for Wigan. He enhanced his estates by purchasing further land in and around Gloucester, and also owned Ribbesford Manor and other property in Worcestershire. In the reign of King James I he was keeper of the lodge and herbage of Hartwell Park, Northamptonshire. By 1605 he was a JP for Gloucestershire. He was steward of the manor of Bury St. Edmunds by 1614. In 1614 he was elected as an MP for Gloucestershire."]}, {"page": "Elizabeth Stanley, Countess of Derby", "response": ["Elizabeth Vere was born on 2 July 1575 at Theobalds House, Hertfordshire, the eldest surviving daughter of Edward de Vere, 17th Earl of Oxford, and Anne Cecil, the daughter of statesman William Cecil, 1st Baron Burghley, Queen Elizabeth I's chief advisor and leading member of her Privy Council. Anne's mother was Mildred Cooke, Burghley's second wife, and Elizabeth was baptised on 10 July."]}, {"page": "Anne Cecil", "response": ["Anne de Vere (née Cecil), Countess of Oxford (5 December 1556 – 5 June 1588) was the daughter of the statesman William Cecil, 1st Baron Burghley, chief adviser to Queen Elizabeth I of England, and the translator Mildred Cooke. In 1571 she became the first wife of Edward de Vere, 17th Earl of Oxford. She served as a Maid of Honour to Queen Elizabeth before her marriage.", "Anne was born 5 December 1556, the elder daughter of William Cecil, later created 1st Baron Burghley, the leading member of Queen Elizabeth's Privy Council, by his second wife, Mildred Cooke, a woman noted for her learning and translations from the Greek. Anne was an intelligent, well-educated child. She is thought to have been tutored by William Lewin. She knew French, Latin and possibly Italian.Moody, Ellen. Six Elegiac Poems, Possibly by Anne Cecil de Vere, Countess of Oxford, published in English Literary Renaissance, 19, 1989, pp.152-70 A letter from the German scholar Johannes Sturm referred to her knowledge of Latin. Her father affectionately called her 'Tannakin'.Moody"]}, {"page": "List of English chief ministers", "response": ["| 1 June 1563, WestminsterSon of William Cecil, 1st Baron Burghleyand Mildred Cooke"]}, {"page": "Timothie Bright", "response": ["His first medical work (dated 1584) is in two parts: 'Hygieina, on preserving health', and 'Therapeutica, on restoring health.' In the part on poisons, where the flesh of the chameleon, that of the newt, and that of the crocodile are treated as three several varieties of poison, each requiring a peculiar remedy. Bright's preface implies that he lectured at Cambridge; he dedicates both parts to William Cecil, 1st Baron Burghley, as chancellor of the university, and speaks as if he knew him and his family, and he praises the learning of Mildred Cooke, Lady Burghley."]}, {"page": "Mary de Vere", "response": ["No records exist for the date or place of birth of Mary, second child of John de Vere and his second wife, Margery Golding. She was born in late 1554 at the earliest, according to Professor Alan H. Nelson, her brother's biographer. He notes there's no mention of a pregnancy or sibling to Edward in the codicil to her father's will dated 28 Jan 1554. Mary's birthplace might thus be Hedingham Castle, Veer House in London, or one of her father's ten additional vast Essex estates. Mary's half-uncle was Arthur Golding, a translator of the classics and John Calvin. Shakespeare relied on Golding's translation of Ovid's Metamorphosis as a frequent source for his long poems and plays. Mary's brother Edward de Vere, 17th Earl of Oxford, married Anne Cecil, daughter of William Cecil, Lord Burghley, and the translator Mildred Cooke. "]}, {"page": "Mildred Burghley", "response": ["#REDIRECT Mildred Cooke"]}, {"page": "Mildred Cecil", "response": ["#REDIRECT Mildred Cooke"]}, {"page": "Mildred, Lady Burghley", "response": ["#REDIRECT Mildred Cooke"]}, {"page": "Mildred (name)", "response": ["* Mildred Cooke (c.1525–1589), English noblewoman"]}, {"page": "Margery Golding", "response": ["*Edward de Vere, 17th Earl of Oxford; married firstly Anne Cecil, daughter William Cecil, 1st Baron Burghley, and Mildred Cooke. He married secondly Elizabeth Trentham, daughter of Thomas Trentham. He had children from both marriages."]}, {"page": "Richard Cooke (MP for Lymington)", "response": ["He was the son of William Cooke and Frances Grey,  daughter of Lord John Grey and Mary Browne,  and grandson of Sir Anthony Cooke, of Gidea Hall and Anne Fitzwilliam.  Educated at Oxford University, his rise in politics was mainly due to  his  family  connection  to William Cecil, 1st Baron Burghley, who had married his aunt, Mildred Cooke. He sat in the Parliament of 1584 as member for Lymington.  As an MP he was embarrassed by a lawsuit brought against him in the Court of Chancery  by Margery  Dyke, but   he was  able to plead  Parliamentary privilege   to defeat  her  claim."]}, {"page": "Hermit's Welcome at Theobalds", "response": ["The entertainment involved a mock charter, dated 10 May 1591 and signed by Christopher Hatton, from the \"disconsolate and retired spirit, the Heremite of Tyboll\", who was leaving after two years and two months at Theobalds to retire to his old cave.John Strype, Annals of the Reformation, vol. 4 (London, 1731), p. 77-8: (1824), pp. 108-9 The mock charter still exists and is owned by the Elizabethan Club at Yale University.Mock Charter, Elizabethan Club, Yale Orbis The elapse of time may refer to the death of Burghley's wife, Mildred Cooke in 1589.Marion Colthorpe, 'The Theobalds entertainment for Queen Elizabeth I in 1591, with a transcript of the Gardener's Speech', REED Newsletter, 12:1 (1987), p. 2."]}, {"page": "Mildred Cooke Cecil", "response": ["#REDIRECT Mildred Cooke"]}]}}