{"wiki_id": "http://www.wikidata.org/entity/Q1346919", "itemLabel": "Epic Soundtracks", "itemDescription": "British musician (1959-1997)", "wikipedia_url": "https://en.wikipedia.org/wiki/Epic_Soundtracks", "wikipedia_page": {"main": "Epic Soundtracks was the stage name of the British musician Kevin Paul Godfrey (23 March 1959 – 6 November 1997). Born in Croydon, Surrey, he was brought up in Solihull, Midlands with his brother Adrian Nicholas Godfrey, who was known as Nikki Sudden (1956–2006).\nIn 1972, Kevin and Adrian formed the nucleus of what was to become the post-punk rock group Swell Maps, with \"Soundtracks\" on drums and piano, and \"Sudden\" on guitar and vocals.\nSoundtracks later played drums for Crime & the City Solution and These Immortal Souls. In 1991, Soundtracks decided to focus on his own songwriting career, and began the series of recordings that comprised his three solo records. As a vocalist and multi-instrumentalist he released three critically acclaimed solo albums, and two more were released posthumously.Notable fans of Soundtracks' solo work include Evan Dando and Thurston Moore. Dave Graney paid tribute to Soundtracks with the song \"A Boy Named Epic\" on The Royal Dave Graney Show's 2003 album The Brother Who Lived.  Arthur Lee's backing band, Baby Lemonade, paid tribute as well, with a song off their 2001 High Life Suite LP called,\"Song for Epic\".Epic Soundtracks died in his sleep on 6 November 1997, at his flat in West Hampstead, London. His funeral took place in Leamington Spa Baptist Church on 1 December. The official cause of death was ruled as inconclusive.", "link_mentions": [{"page": "1997 in music", "response": ["*November 6 – Epic Soundtracks, English singer-songwriter, drummer of Swell Maps, Crime and the City Solution and These Immortal Souls, 38"]}, {"page": "Car Button Cloth", "response": ["# \"C'mon Daddy\" (Dando, Epic Soundtracks) – 3:32"]}, {"page": "Mick Harvey", "response": ["After the breakup of The Birthday Party while initiating the early recordings of what would become The Bad Seeds with Nick Cave, Harvey contacted his friend Simon Bonney, with whom he reformed Bonney's old Australian band Crime & the City Solution. Rowland S. Howard, Harry Howard (bass) and Epic Soundtracks (drums), all of whom a few years later would form the basis of These Immortal Souls, also participated. This line-up of the band found its peak and demise with its appearance in the Wim Wenders film Wings of Desire. Bonney then stayed in Berlin and formed the next line-up of the band with his partner Bronwyn Adams, Harvey (drums), Alexander Hacke of Einstürzende Neubauten (guitar), Chrislo Haas of Liaisons Dangereuses and D.A.F. (synthesiser), and Thomas Stern (bass). This line-up made three studio albums and toured until 1991."]}, {"page": "Swell Maps", "response": ["Although it had existed in various forms since 1972, Swell Maps formed into a coherent musical entity after the beginning of British punk. The band consisted of Solihull teenagers Epic Soundtracks (real name Kevin Paul Godfrey), his brother Nikki Sudden (real name Adrian Nicholas Godfrey), Jowe Head (Stephen Bird), Biggles Books (Richard Scaldwell), Phones Sportsman (David Barrington) and John \"Golden\" Cockrill. The band released the single \"Read About Seymour\" in 1977. It is widely considered to be a classic punk era single, and is referenced in the song \"Part Time Punks\" by Television Personalities.\"Then they go to Rough Trade To buy Siouxsie and the Banshees They heard John Peel play it Just the other night They'd like to buy the O Level single or Read about Seymour But they're not pressed in red So they buy The Lurkers instead\" - 'Part Time Punks' - Television Personalities. ", "Soon after the band's split Soundtracks and Head released a single, \"Rain, Rain, Rain\", on Rough Trade,Henderson, Dave. \"The Jowe Head Top 20\". Fire Records. Retrieved 11 October 2020 intended to be the first release from a forthcoming album, Daga Daga Daga, which was not completed. Richard Scaldwell (Biggles Books) released an album in 1981, The Egg Store Ilk, under the name \"Richard Earl\", but retired from music thereafter. Other members of the band continued to make music; Nikki Sudden began a solo career as well as working with Dave Kusworth. Epic Soundtracks was a member of Crime and the City Solution and also released solo material. Jowe Head has led a career as a musician and visual artist, and was also a member of the Television Personalities for many years.", "Epic Soundtracks died of unknown causes at the age of 38 in 1997, and Nikki Sudden died at the age of 49 in March 2006, in a hotel room in New York City.", "*Epic Soundtracks' Homepage"]}, {"page": "1997 in British music", "response": ["*6 November – Epic Soundtracks, singer-songwriter and drummer, 38 (cause unknown)"]}, {"page": "Rowland S. Howard", "response": ["The Birthday Party's early records were released by Missing Link Records in Australia and 4AD Records in the UK. They later became associated with Mute Records in Europe. Howard was also a member of the short-lived project, Tuff Monks with Birthday Party bandmates, Nick Cave and Mick Harvey. However, Howard and singer Nick Cave suffered 'creative differences', and Howard left the Birthday Party as they transformed into The Bad Seeds. He soon became a member of Crime & the City Solution, a band led by Simon Bonney. Howard and his Band Crime & the City Solution appeared in the 1987 movie Wings of Desire by German filmmaker Wim Wenders playing the song \"Six Bells Chime\" in a Berlin Club. Later he formed These Immortal Souls with girlfriend Genevieve McGuckin, brother, Harry Howard, and Epic Soundtracks.", "Paul Godfrey a.k.a. Epic Soundtracks, the UK drummer for These Immortal Souls, was found dead in his London apartment on 5 November 1997. These Immortal Souls played their last show, at the Greyhound Hotel in St Kilda, with Lydia Lunch in 1998.", "*Crime & the City Solution, with band members Simon Bonney, Bronwyn Adams, Mick Harvey, Alexander Hacke, Epic Soundtracks, Harry Howard", "*These Immortal Souls, with band members Genevieve McGuckin, Harry Howard, Epic Soundtracks"]}, {"page": "Ball-Hog or Tugboat?", "response": ["* Epic Soundtracks\t\t-\tTambourine", "||Epic Soundtracks||Tambourine"]}, {"page": "Crime & the City Solution", "response": ["In late 1983 Bonney moved to London and reconnected with members of The Birthday Party. In 1985 he formed another version of Crime & the City Solution in London with Mick Harvey on drums, keyboards and bass guitar and Rowland S. Howard on guitar and backing vocals. Howard's younger brother, Harry, soon joined on bass guitar. In June 1985 the group's debut four-track EP, The Dangling Man, was released by Mute Records in the UK and Possum Records in Australia. McFarlane found the EP provided \"a gloomy, stripped-down, blues-flavoured sound\". A six-track EP, Just South of Heaven, followed in September for UK release only. It was \"cleaner, more powerful set of songs dominated by Bonney's dramatic vocals and chilling instrumentation\". After the release Epic Soundtracks (aka Kevin Godfrey, ex-Swell Maps) joined on drums which freed Harvey to concentrate on keyboards and guitar. In 1986 Bronwyn Adams, Bonney's domestic partner, joined on violin and backing vocals.", "*Epic Soundtracks – drums (deceased)"]}, {"page": "Red Krayola", "response": ["Mayo Thompson continued to make music, both under his own name and as The Red Crayola (reverting to the original name in Europe). The next incarnation of the group was a duo: Thompson and American drummer Jesse Chamberlain. The two recorded the single \"Wives in Orbit\" and the album Soldier Talk, with the latter featuring cameos by Lora Logic and members of Pere Ubu, both of which could be seen as musical responses to punk rock. Radar Records reissued Parable of Arable Land in 1978 in the UK, accompanied by a flexi-disc, on which was an up-tempo version of Hurricane Fighter Plane recorded in July 1978, with an apparent punk rock influence as well.  His collaborations in the 1970s and 1980s read like a roll-call of the avant-garde and experimental artists and musicians of the era. The Red Crayola teamed up with the British-American conceptual art collective Art & Language,John Walker. (1987). \"Art-Language & Red Crayola\" . In Cross-Overs: Art into Pop, Pop into Art. London/New York: Comedia/Methuen, 1987. artdesigncafe. Retrieved 07 January 2011. who Thompson described as \"the baddest bastards on the block\", for three LPs: 1976's Corrected Slogans, 1981's Kangaroo? (also featuring The Raincoats' Gina Birch, Lora Logic of Essential Logic and Swell Maps' Epic Soundtracks) and 1983's Black Snakes. Thompson joined Pere Ubu for a period in the early 1980s, performing on their albums The Art of Walking and Song of the Bailing Man, and provided soundtrack music for Derek Jarman. Throughout this time he was prolific as a producer for many other seminal experimental and alternative rock acts, including The Fall (1980's Grotesque (After the Gramme)), The Raincoats, Scritti Politti, Blue Orchids, Cabaret Voltaire, Stiff Little Fingers, Kleenex/LiLiPUT, The Chills and Primal Scream."]}, {"page": "Mayo Thompson", "response": ["Working at Rough Trade also led him to reform the Red Crayola with new members from the bands he was working with. The resulting line-up (1979–1983) included a number of important post-punk musicians: Gina Birch of The Raincoats, Lora Logic of X-Ray Spex and Essential Logic, Epic Soundtracks of the Swell Maps, and Allen Ravenstine of Pere Ubu. All members of Pere Ubu, aside from drummer Scott Krauss, contributed to the Soldier Talk album. The band continued its association with Art & Language, who often contributed lyrics to songs such as A Portrait of V.I. Lenin in the Style of Jackson Pollock which references their well-known painting. The song Born in Flames was written for the soundtrack of Lizzie Borden's 1983 radical feminist film of the same name."]}, {"page": "These Immortal Souls", "response": ["These Immortal Souls were an Australian post-punk band formed in London in 1987 by Harry Howard on bass guitar, his older brother Rowland S. Howard on guitar and vocals, Epic Soundtracks (a.k.a. Kevin Godfrey) on drums (all three ex-Crime & the City Solution) and Genevieve McGuckin on keyboards (Rowland's long time girlfriend). They issued two albums on Mute Records, Get Lost (Don't Lie)  1987 and I'm Never Gonna Die Again 1992. The group relocated to Australia in 1995 and played less frequently before disbanding there in mid-1998. Soundtracks died in November 1997 and Rowland died in December 2009.", "Late in 1986 Australian-born brothers Harry on bass guitar and Rowland S. Howard on guitar, and United Kingdom-born Epic Soundtracks (a.k.a. Kevin Godfrey) on drums were not invited to the recording sessions for Crime and the City Solutions Shine LP. As they had already been rehearsing and recording with Genevieve McGuckin for what was seen at the time as a solo outlet for Rowland they then became a permanent band. Crime & the City Solution.McFarlane, 'Crime & the City Solution' entry. Archived from the original on 16 June 2004. Retrieved 6 November 2015. With Rowland's then-girlfriend, Genevieve McGuckin on keyboards, Harry, Rowland (on lead vocals and guitar) and Soundtracks formed another rock band, These Immortal Souls, in London in 1987. Rowland explained why he formed the group, \"I had lots of songs I really liked... songs that would never have been done if I hadn't said, 'Right, I'm going to sing them,' because you can't give somebody a set of lyrics and tell them what to sing if you want any kind of sincerity.\"", "Kevin Godfrey a.k.a. Epic Soundtracks was found dead in his London apartment on 5 November 1997; his cause of death was not identified, despite an autopsy. Rowland S. Howard died as the result of liver cancer on 30 December 2009."]}, {"page": "Genevieve McGuckin", "response": ["In 1984 both McGuckin, on keyboards, piano and organ, and Howard on guitar were founding members of a post-punk group, These Immortal Souls.McFarlane, 'Crime & the City Solution' entry. Archived from the original on 16 June 2004. Retrieved 23 September 2017.Spencer et al, (2007) \"McGuckin, Genevieve\" entry. Other founders were Rowland's brother, Harry on bass guitar and Epic Soundtracks (a.k.a. Kevin Godfrey) on drums. They issued two albums, Get Lost (Don't Lie) in October 1987 and I'm Never Gonna Die Again in October 1992, before relocating to Melbourne in 1994. While in the group she also wrote music and lyrics on both their albums and a single."]}, {"page": "Nikki Sudden", "response": ["Adrian Nicholas Godfrey (19 July 195626 March 2006), known as Nikki Sudden, was a prolific English singer-songwriter and guitarist. He co-founded the post-punk band Swell Maps with his brother, Epic Soundtracks, while attending Solihull School in Solihull.", "* \"The Pacific and Eddy\" (2006, US – Director: Matthew Nourse, Music: Jacobites, Nikki Sudden, Epic Soundtracks) – Nikki Sudden as Silhouette"]}, {"page": "Harbury", "response": ["*Nikki Sudden and brother Epic Soundtracks, both musicians in the band Swell Maps and Nikki in Jacobites, lived in the village.Sudden, Nikki. \"In Case Of Fire\", The Times, London, December 1986. Retrieved on 14 June 2017."]}, {"page": "Hi Fi Way", "response": ["*Epic Soundtracks – keyboards on \"Gray\""]}, {"page": "Victor Van Vugt", "response": ["* 1992 Epic Soundtracks: Rise Above"]}, {"page": "A Trip to Marineville", "response": ["* Epic Soundtracks (Kevin Godfrey) – drums (tracks A1–5, A7, A8, B1–5, C1 and D2), piano (tracks A1, A5, A8 and B3), backing vocals (tracks A1, A2, A7 and D2), handclaps (tracks A1, A2, A7), \"voice\" (tracks A6, B4), synth bass (track A7), alarm bell (track A7), xylophone (track A8), organ (track B4), \"balloons\" (track B4), \"microphone damage\" (track B5), violin (track D2), chanting (track A3), \"aquatics\" (track A5), toy saxophone (track A6), production, album cover design"]}, {"page": "Jane from Occupied Europe", "response": ["# \"Robot Factory\" (Epic Soundtracks, Richard Earl) – 2:27", "* Epic Soundtracks - Drums (1-7,9-12), Organ (1,10), Toys (1,6,7), Backing Vocals (2,5,10,11), Piano (3,6,9,13), Handclaps (5,9), Violin (6), Mumbling (6,13), Guitar (7), Saxophone (7), Concrete (8), Typewriter (8)"]}, {"page": "Kevin Godfrey", "response": ["* Epic Soundtracks (1959–1997), British musician"]}, {"page": "Thirteen (song)", "response": ["| Epic Soundtracks"]}, {"page": "Jacobites (band)", "response": ["The two had met in early 1980, and first performed together in May 1982 under the name Six Hip Princes,According to Sudden, \"A local music paper reviewed the show and wrote, 'There were only four of them, they weren't hip and they certainly weren't princes...' Well, some people are hard to please.\" but it was not until 1984, after Sudden had already issued two solo releases, that the duo adopted the name Jacobites (after the rebel movement to restore the Stuart line to the British thrones) and completed the lineup by adding Nikki's brother Epic Soundtracks, also formerly of the Swell Maps, and bassist Mark Lemon.  The Jacobites were a more traditional, song-oriented outfit than the Swell Maps had been.  Sudden and Kusworth were both strongly influenced by The Faces, Bob Dylan, glam rock, and, most vitally, The Rolling Stones. Sudden considered the Stones \"the best band there has ever been\" and was working on a Ronnie Wood biography at the time of his death. The group's velvet-and-scarves style of dressing and their girls-and-drugs style of living presented a natural comparison with Mick Jagger and Keith Richards."]}, {"page": "Jowe Head", "response": ["Jowe Head (the stage name derived from Birmingham slang for \"weirdo\")\"An Interview with Jowe Head\", The Big Untidy, July 2009  was born Stephen John Bird in 1956 in Kidderminster, Worcestershire, and moved to Solihull at an early age. He started playing in 1973 with Nikki Sudden, Epic Soundtracks and Phones Sportsman in a loose collective that later became known as Swell Maps.  He also played with Epic Soundtracks and Ken Spiers (later better known as Spizz) in another local band.Thompson, Dave (2000) Alternative Rock, Miller Freeman, , p.671 With Swell Maps he recorded numerous singles (some under the guise of the Phones Sportsman Band and also backing The Cult Figures) and two albums, before the band split up in 1980."]}, {"page": "Rise Above (Epic Soundtracks album)", "response": ["Rise Above is the 1992 solo full-length debut album by singer-songwriter Epic Soundtracks (stage name of Kevin Paul Godfrey). He had previously been known as the drummer/pianist with the bands Swell Maps, Jacobites, Crime & the City Solution and These Immortal Souls. It was released by American label Bar/None Records in 1993.", "All tracks composed and arranged by Epic Soundtracks", "*Epic Soundtracks - vocals, piano, bass, drums, organ, guitar"]}, {"page": "List of Rough Trade artists", "response": ["* Epic Soundtracks"]}, {"page": "Runt Distribution", "response": ["* Epic Soundtracks"]}, {"page": "Kangaroo?", "response": ["*Epic Soundtracks – instruments, production"]}, {"page": "Just South of Heaven", "response": ["*Epic Soundtracks – drums"]}, {"page": "Room of Lights", "response": ["*Epic Soundtracks – drums, piano on \"No Money, No Honey\" and \"Hey Sinkiller\""]}, {"page": "Popular music of Birmingham", "response": ["Birmingham's earliest punk rock bands preceded the late 1976 emergence of the Sex Pistols and mainstream British punk, instead being influenced directly by the proto-punk of British glam-rock, American garage rock and German krautrock. The earliest were the Swell Maps, formed in 1972 by brothers Epic Soundtracks and Nikki Sudden, inspired by T. Rex, The Stooges and Can. The group produced hours of home recordings on reel-to-reel tapes over the course of the early and mid 1970s with Sudden later recalling that when he first saw the Sex Pistols in April 1976 \"my reaction was that they sounded the same as what we were doing\". Swell Maps \"took punk's no-rules, do-it-yourself, destruction-of-rock promises literally\" and \"proceeded to create some of the most challenging, foreign, distinctive, and truly rebellious music of recent decades\". Although never more than a cult success, they were to be highly influential in the emergence of the next generation of alternative rock, with Dinosaur Jr., REM and Pavement all citing the group as an influence, and Sonic Youth's Thurston Moore writing that \"The Swell Maps had a lot to do with my upbringing\"."]}]}}