{"wiki_id": "http://www.wikidata.org/entity/Q1349316", "itemLabel": "Rob Overseer", "itemDescription": "British disc jockey", "wikipedia_url": "https://en.wikipedia.org/wiki/Rob_Overseer", "wikipedia_page": {"main": "Rob Overseer is an English DJ/producer whose works have been included in soundtracks for Blade: Trinity,  The Animatrix, Snatch, Any Given Sunday and The Girl Next Door, as well as video games like  Gran Turismo 3, Edgar Torronteras` Extreme Biker,  Need for Speed: Underground, SSX 3, NFL Gameday 2004, several Matchstick Productions ski films, Stuntman, Twin Caliber (Rage Software, 2002) which was used to promote his then new EP \"Force Multiply\" in game's manual, and Ridge Racer Unbounded. His songs are also frequently used in TV commercials such as \"Hairdo\" for Vodafone which featured his song Velocity Shift or the Endeavor commercial for Mitsubishi, which featured \"Horndog\". Also, the MTV show Maui Fever features his single Horndog in the opening credits.\nOverseer also records with singer/songwriter Rachael Gray. They first worked together on the track \"Sparks\" which appeared on the Overseer album \"Wreckage\" on the Columbia label. Following the success of \"Sparks\", work began on a full album project under the name Kanute. Also, former UFC fighter Ken Shamrock used Rob's \"Slayed\" as his entrance theme on his last two fights. In addition, Mauricio \"Shogun\" Rua used this song as his entrance song for UFC 76 as well as Keith Jardine for UFC 89.  On 27 September 2018, Howes announced a new album and change of name stating \"Overseer is no more, I am now trading as FATLANTIC\" on his personal Facebook page.Overseer's style is most frequently described as big beat.", "link_mentions": [{"page": "When", "response": ["* When! Records, a UK record label whose artists include Rob Overseer"]}, {"page": "Wreckage (album)", "response": ["Category:Rob Overseer albums"]}, {"page": "Supermoves", "response": ["#REDIRECT Rob Overseer"]}, {"page": "Overseer", "response": ["*Rob Overseer, British music producer"]}, {"page": "Overseer (DJ)", "response": ["#REDIRECT Rob Overseer"]}]}}