{"wiki_id": "http://www.wikidata.org/entity/Q1349206", "itemLabel": "Mark Simpson", "itemDescription": "British writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Mark_Simpson_(journalist)", "wikipedia_page": {"main": "Mark Simpson is an English journalist, writer, and broadcaster specialising in popular culture, media, and masculinity. Simpson is the originator of the term and concept metrosexual. He has been described by one critic as \"the skinhead Oscar Wilde\".Simpson has written for numerous publications around the world, including The Times, The Guardian, Salon, Arena Homme +, GQ Style, Vogues Hommes International, The Independent on Sunday, Têtu, the Seattle Stranger, and Dutch Playboy. In December 2007, GQ Russia placed him in their 'Top Ten Things That Changed Men's Lives'.", "link_mentions": [{"page": "The Smiths", "response": ["The \"Britpop movement pre-empted by the Stone Roses and spearheaded by groups like Oasis, Suede and Blur drew heavily from Morrissey's portrayal of and nostalgia for a bleak urban England of the past.\"Chloe Veltman, \"The Passion of the Morrissey\" , The Believer. Retrieved 8 January 2012. Blur formed as a result of seeing the Smiths on The South Bank Show in 1987. Yet even while leading bands from the Britpop movement were influenced by the Smiths, they were at odds with the \"basic anti-establishment philosophies of Morrissey and the Smiths\", since Britpop \"was an entirely commercial construct\".Veltman, \"The Passion\". Mark Simpson has suggested that \"the whole point of Britpop was to airbrush Morrissey out of the picture ... Morrissey had to become an 'unperson' so that the Nineties and its centrally-planned and coordinated pop economy could happen.\"Mark Simpson, Saint Morrissey: A Portrait of This Charming Man by an Alarming Fan (New York: Simon and Schuster, rev. edn. 2006).", "* Mark Simpson. Saint Morrissey (SAF, 2003, 2006, 978–0946719754)"]}, {"page": "LGBT", "response": ["The portrayal of an all-encompassing \"LGBT community\" or \"LGB community\" is also disliked by some lesbian, gay, bisexual, and transgender people. Some do not subscribe to or approve of the political and social solidarity, and visibility and human rights campaigning that normally goes with it including gay pride marches and events. Some of them believe that grouping together people with non-heterosexual orientations perpetuates the myth that being gay/lesbian/bi/asexual/pansexual/etc. makes a person deficiently different from other people. These people are often less visible compared to more mainstream gay or LGBT activists. Since this faction is difficult to distinguish from the heterosexual majority, it is common for people to assume all LGBT people support LGBT liberation and the visibility of LGBT people in society, including the right to live one's life in a different way from the majority. In the 1996 book Anti-Gay, a collection of essays edited by Mark Simpson, the concept of a 'one-size-fits-all' identity based on LGBT stereotypes is criticized for suppressing the individuality of LGBT people."]}, {"page": "Biphobia", "response": ["* Curiouser and curiouser by Mark Simpson"]}, {"page": "XY (magazine)", "response": ["XY was founded by Peter Ian Cummings in San Francisco in 1996, and moved its operations to San Diego, California in 2001, and West Hollywood, California in 2004.  It published roughly four editions a year until 2008; the Fall 2016 is Issue 50, the Wonderland Issue.  The magazine contains political and cultural articles, pictures, and submissions by readers. Featured photographers included Steven Underhill (cover of issue 1, 1996), Bradford Noble, James Dawson, and many others.  Featured comic series included Tough Love by Abby Denson (who still appears in Issue 50) and Joe Boy by Joe Phillips. Issue 50, “Wonderland,” which looks at the future of the U.S., includes well-known writers Douglas Rushkoff, Scott Santens writing about Basic Income, David Leddick, and Mark Simpson."]}, {"page": "Out (magazine)", "response": ["* Mark Simpson"]}, {"page": "New Queer Cinema", "response": ["* Mark Simpson (ed.): Anti-Gay (1996), "]}, {"page": "GQ", "response": ["GQ has been closely associated with metrosexuality. The writer Mark Simpson coined the term in an article for British newspaper The Independent about his visit to a GQ exhibition in London: \"The promotion of metrosexuality was left to the men's style press, magazines such as The Face, GQ, Esquire, Arena and FHM, the new media which took off in the Eighties and is still growing ... They filled their magazines with images of narcissistic young men sporting fashionable clothes and accessories. And they persuaded other young men to study them with a mixture of envy and desire.\" The magazine has expanded its coverage beyond lifestyle issues. For example, in 2003, journalist Sabrina Erdely wrote an eight-page feature story in GQ on famous con man Steve Comisar. GQ has been called the \"holy text of woke capital\" by The Spectator."]}, {"page": "St Peter's School, York", "response": ["*Mark Simpson – journalist, writer, and broadcaster specialising in pop culture, media, and masculinity credited with coining the word metrosexual"]}, {"page": "Mark Simpson", "response": ["Mark Simpson may refer to:", "* Mark Simpson (basketball) (born 1961), American basketball player", "* Mark Simpson (soccer) (born 1966), American soccer player", "* Mark Simpson (clarinetist) (born 1988), winner of the BBC Young Musician of the Year, 2006", "* Mark Simpson (comics), British comic artist under the pseudonym \"Jock\"", "* Mark Simpson (Ireland correspondent), journalist and BBC Ireland correspondent", "* Mark Simpson (journalist), British journalist and broadcaster"]}, {"page": "LGBT culture", "response": ["British journalist Mark Simpson's 1996 book, Anti-Gay, describes forms of intolerance by the mainstream gay community towards subgroups. The Times wrote that Simpson succeeded in \"pointing out that oppression and prejudice do not become legitimate just because they happen to be practiced by the previously oppressed\". Aiden Shaw of Time Out New York wrote that \"Thank fucking God someone did this, because...whatever happened to our individuality, our differences?\" Other commentators harshly criticized Simpson's argument, with Boyz declaring that \"Simpson is a cunt.\""]}, {"page": "Attitude (magazine)", "response": ["Contributors to the magazine have included Julie Burchill, David Furnish, Mark Simpson (the magazine's leading columnist in its early years), Tim Teeman, Simon Fanshawe, Will Self, Augusten Burroughs, Andrew M. Potts, Anthony Crank, Jackie Collins, Matt Lucas, Boy George, Russell T Davies, Graham Norton, Preston from The Ordinary Boys, Bruce LaBruce and photographer Wolfgang Tillmans."]}, {"page": "3:AM Magazine", "response": ["An anthology covering its first five years of publishing, The Edgier Waters, was published in Britain by Snowbooks in June 2006, featuring writers Steve Almond, Bruce Benderson, Michael Bracewell, Tom Bradley, Billy Childish, Steven Hall, Ben Myers, Tim Parks, Mark Simpson, HP Tinker and Kenji Siratori, as well as poetry pieces arranged by Sonic Youth's Thurston Moore and Lee Ranaldo alongside Tyondai Braxton."]}, {"page": "Chris Morris (activist)", "response": ["In 1998, Morris became a member of OutRage! and in 1999 he founded and became editor of the gay rights magazine Outcast. Contributors included left-wing Mayor of London Ken Livingstone, Lib Dem leader Charles Kennedy, Foreign Office minister Ben Bradshaw, Anti-Gay author Mark Simpson and veteran activist Peter Tatchell. The magazine satirised and was critical of many gay activists and businesses and Morris was criticised for \"biting the hand that fed him\" during his age of consent campaign.Whatever happened to Chris Morris?"]}, {"page": "Outcast (magazine)", "response": ["Contributors included Mayor Ken Livingstone, Lib Dem leader Charles Kennedy, Foreign Office minister Ben Bradshaw, Mark Simpson, John Hein, David Borrow and Peter Tatchell (amongst many others)."]}, {"page": "Glenn Belverio", "response": ["*Anti-Gay by Mark Simpson (1996) (transcript of A Case for the Closet, co-written by Belverio and Bruce LaBruce)"]}, {"page": "Ritch Savin-Williams", "response": ["Commenting on the article, Mark Simpson the UK journalist wrote:"]}, {"page": "Paul Burston", "response": ["* 'Confessions of A Gay Film Critic' in Anti-Gay Freedom Editions, 1996 (ed. Mark Simpson)"]}, {"page": "List of gay, lesbian or bisexual people: Sd–Si", "response": ["| Mark Simpson"]}, {"page": "Simpson (name)", "response": ["* Mark Simpson (disambiguation), multiple people", "** Mark Simpson (soccer) (born 1966), American soccer player", "** Mark Simpson (Ireland correspondent) (born c.1968), journalist and BBC Ireland correspondent", "** Mark Simpson (comics) (born 1972), British comic artist under the pseudonym \"Jock\"", "** Mark Simpson (clarinetist) (born 1988), winner of the BBC Young Musician of the Year, 2006", "** Mark Simpson (journalist) (born 19??), British journalist, broadcaster and author"]}, {"page": "Sporno", "response": ["#REDIRECT Mark Simpson (journalist)#The term metrosexual"]}, {"page": "Metrosexual", "response": ["The term metrosexual originated in an article by Mark Simpson published on November 15, 1994, in The Independent. Simpson wrote:", "Female metrosexuality is a concept that Simpson explored with American writer Caroline Hagood.Huffington Post Mark Simpson and Caroline Hagood on Wo-Metrosexuality and the City April 13, 2010  They employed the female characters from the HBO series Sex and the City in order to illustrate examples of wo-metrosexuality, a term Hagood coined to refer to the feminine form of metrosexuality. The piece implied that, although this phenomenon would not necessarily empower women, the fact that the metrosexual lifestyle de-emphasizes traditional male and female gender roles could help women out in the long run. However, it is debatable whether the characters made famous by Sex and the City truly de-emphasized female gender roles, given that the series focused a high amount of attention on stereotypically feminine interests like clothing, appearance, and romantic entanglements.", "In its soundbite diffusion through the channels of marketeers and popular media, who eagerly and constantly reminded their audience that the metrosexual was straight, the metrosexual has congealed into something more digestible for consumers: a heterosexual male who is in touch with his feminine side — he color-coordinates, cares deeply about exfoliation, and has perhaps manscaped.Mark Simpson in The Guardian January 2012", "* 'Metrodaddy Speaks!' Mark Simpson answers questions from the global media in 2004"]}, {"page": "Bryan Malessa", "response": ["In Financial Times, Mark Simpson wrote \"Billed as 'an epic investigation into America's underbelly,' The War Room has a Catcher in the Rye quality to it, but without the toxicity.\""]}, {"page": "Marian Salzman", "response": ["The New York Times published a Sunday feature, “Metrosexuals Come Out,” which quoted Salzman regarding metrosexuals.Warren St. John,\"New York Times\", June 22, 2003,\"\", In 2003 the UK Observer apologized for incorrectly attributing the first use of the term to Salzman, and gave credit to Mark Simpson (journalist) for the term."]}, {"page": "Fabulous (band)", "response": ["Their Austin Maxi motor (left), dubbed the \"Fab Mobile\", was painted by Paul Cannell and was featured in a lengthy TV feature about Fabulous on the BBC2 music show Rapido. Razorlight manager Roger Morton gave them their first live review in the NME on  27 July 1991 - their first ever gig — \"the least dour group you will ever see\". They featured heavily in i-D, The Face, The Wire, Select, and Melody Maker. Author Mark Simpson (journalist) profiled them in The Guardian, and featured the group in his first book Male Impersonators. Radio broadcaster and author Stuart Bailie strongly supported them at the NME, making their debut single \"single of the week\" and, in a January 1992 cover story, writing: \"They terrify the Manics. They flaunt porno t-shirts. They steal carpets, and erm, Santas. They are a sick NME joke. They are a daft, manipulative group, noisy, reckless, exciting.\""]}, {"page": "Metrosexy", "response": ["#REDIRECT Mark Simpson (journalist)#Metrosexy"]}, {"page": "Morrissey", "response": ["Mark Simpson characterised Morrissey as \"the anti-pop idol\", representing \"the last, greatest and most gravely worrying product of an era when pop music was all there was\". Music journalist and biographer Johnny Rogan stated that Morrissey's œuvre seems based on \"endlessly re-examining a lost, painful past\". Morrissey's lyrics have been described as \"dramatic, bleak, funny vignettes about doomed relationships, lonely nightclubs, the burden of the past and the prison of the home\". According to Mark Simpson, there is a common feeling that his music's emphasis on the sadness of life is depressing.", "Journalist Mark Simpson calls Morrissey \"one of the greatest pop lyricists—and probably the greatest-ever lyricist of desire—that has ever moaned\" and observes that \"he is fully present in his songs as few other artists are, in a way that fans of most other performers ... wouldn't tolerate for a moment.\" Simpson also argues that \"After Morrissey there could be no more pop stars. His was an impossible act to follow ... [his] unrivalled knowledge of the pop canon, his unequaled imagination of what it might mean to be a pop star, and his breathtakingly perverse ambition to turn it into great art, could only exhaust the form forever\"."]}, {"page": "Spornosexual", "response": ["Spornosexual is a blend of sports and the clipping porno, compounded with sexual. The term was coined by Mark Simpson in 2014 to describe a man \"who is influenced in his appearance by the stars of sport and pornography\". It recognises young men who use \"their toned bodies on social media as a means of feeling valuable in society.\" Jamie Hakim has described this as a \"power-shift of a segment of society who have historically defined themselves through their mind, whilst at the same time defining those they have subordinated - such as women - through their bodies\".", "The term originated in an article by cultural commentator Mark Simpson in 2014; Simpson's metrosexual is a portmanteau of metropolitan and heterosexual. He describes spornosexuals as frequently working class men who exercise at a gym in order to share eroticised selfies of their toned bodies on social media. Simpson considers spornosexuality as the second, more extreme, generation of metrosexuality, since the \"uptake by men of products, practises and pleasures previously ring-fenced for women and gay men\" has become normalised. Instead, Simpson claims, spornosexual men want to be recognised for their bodies rather than their clothes. Examples of such men include Dan Osborne, Thom Evans, David McIntosh and Cristiano Ronaldo."]}]}}