{"wiki_id": "http://www.wikidata.org/entity/Q13422517", "itemLabel": "Walter Langdon-Brown", "itemDescription": "British doctor", "wikipedia_url": "https://en.wikipedia.org/wiki/Walter_Langdon-Brown", "wikipedia_page": {"main": "Sir Walter Langdon-Brown (13 August 1870 – 3 October 1946) was a British medical doctor and writer.\n\n", "link_mentions": [{"page": "W. H. R. Rivers", "response": ["At Bart's, Rivers had been a physician to Dr. Samuel Gee. Those under Gee were conscious of his indifference towards, if not outright dislike of, the psychological aspects of medicine. Walter Langdon-Brown surmises that Rivers and his fellow Charles S. Myers devoted themselves to these aspects in reaction to Gee."]}, {"page": "Regius Professor of Physic (Cambridge)", "response": ["* Sir Walter Langdon-Brown (1932)"]}, {"page": "Florence Ada Keynes", "response": ["Keynes was the daughter of Rev. John Brown of Bunyan's Chapel, Bedford, and schoolteacher Ada Haydon, née Ford (1837–1929). Her brother Sir Walter Langdon-Brown was the Regius Professor of Physic (medicine) at the University of Cambridge."]}, {"page": "John Brown (writer)", "response": ["Brown married Ada Haydon Ford (1837–1929) in 1859. Their children included Walter Langdon-Brown, the physician and  professor of medicine; and Florence Ada Brown, a political activist combating poverty and eventual mayor of Cambridge, England. He is the grandfather of John Maynard Keynes."]}, {"page": "Harveian Oration", "response": ["*1936 Walter Langdon-Brown, The Background to HarveyBMA book."]}, {"page": "Lennox Broster", "response": ["Broster supported Raymond Greene's efforts in the mid-1940s to establish a Section of Endocrinology of the Royal Society of Medicine and made the case to the Society's Council. Greene and Broster had to contend with opposition to the creation of a new medical specialism and with doubts about the scientific basis of endocrinology. According to the endocrinologist P. M. F. Bishop, it was \"almost entirely due to these two enthusiastic pioneers\" that the Section was established in January 1946. Broster became one of the Section's two vice-presidents and then president after the death of the post's initial holder, Walter Langdon-Brown."]}, {"page": "List of people educated at Bedford School", "response": ["*Professor Sir Walter Langdon-Brown (1870–1946), Regius Professor of Physic, University of Cambridge, 1932–1935"]}, {"page": "1935 New Year Honours", "response": ["*Professor Walter Langdon-Brown  Regius Professor of Physics, University of Cambridge."]}, {"page": "List of presidents of the History of Medicine Society", "response": ["| 1942–1944 || Sir Walter Langdon-Brown ||  || "]}, {"page": "Ronald Bodley Scott", "response": ["After education at Marlborough College, he matriculated at Brasenose College, Oxford, where in 1928 he graduated BA in natural sciences. He then studied at the medical college of St Bartholomew's Hospital, where he was influenced by Walter Langdon-Brown, Thomas Horder, and Francis Fraser. He graduated BM BCh in 1931 from the University of Oxford. He qualified MRCP in 1933. He first joined his father, Dr Maitland Bodley Scott, in his medical practice in Bournemouth, but soon returned to St Bartholomew's Hospital as chief assistant to Alexander Edward Gow (1884–1952). R. Bodley Scott's work on bone marrow aspiration formed the basis of his higher DM thesis in 1937 at the University of Oxford. In 1939 he, in collaboration with A. H. T. Robb-Smith, described the clinical manifestations of malignant histiocytosis."]}, {"page": "List of York Medical Society orators", "response": ["* 1925 Walter Langdon-Brown, London"]}, {"page": "Christopher Bunker", "response": ["Bunker was educated at Wycliffe College, Gloucestershire, St Catharine's College, Cambridge and Westminster Hospital Medical School, London. He was trained in general medicine in London, Derby and Oxford, and received his dermatology training in London. In 1992, he received the Cambridge University Sir Walter Langdon-Brown Prize for his postgraduate MD research on CGRP in Raynaud's phenomenon."]}]}}