{"wiki_id": "http://www.wikidata.org/entity/Q1342123", "itemLabel": "Peter Hopkirk", "itemDescription": "British author (1930-2014)", "wikipedia_url": "https://en.wikipedia.org/wiki/Peter_Hopkirk", "wikipedia_page": {"main": "Peter Stuart Hopkirk (15 December 1930 – 22 August 2014) was a British journalist, author and historian who wrote six books about the British Empire, Russia and Central Asia.", "link_mentions": [{"page": "Mohammad Najibullah", "response": ["Not long before Kabul's fall, Najibullah appealed to the UN for protection after his guards fled, which was rejected. However, his attempt to flee to the airport was thwarted by troops of Abdul Rashid Dostum – once loyal to him, but now allied with Ahmad Shah Massoud – who controlled the airport. At the UN compound in Kabul, while waiting for the UN to negotiate his safe passage to India, he occupied himself by translating Peter Hopkirk's book The Great Game into his mother tongue Pashto. India was placed in a difficult position by deciding to allow Najibullah political asylum and safely escorting him out of the country. Supporters claimed he had always been close to India and should not be denied asylum, but others said doing so would risk antagonizing India's relationship with the new mujahideen government formed under the Peshawar Accord."]}, {"page": "Silk Road", "response": ["* von Le Coq, Albert, 1928. Buried Treasures of Turkestan. Reprint with Introduction by Peter Hopkirk, Oxford University Press. 1985."]}, {"page": "Kim (novel)", "response": ["* The Jang-i-Lat sahib (Urdu: War Lord/Commander-in-Chief) who comes to dinner to Col. Creighton's house, is in fact based on the real British Indian Army general, Field Marshal Lord Roberts of Kandahar, who was known to both John Lockwood and Rudyard Kipling.Peter Hopkirk in Quest for Kim: In Search of Kipling's Great Game London:J Murray, 1996"]}, {"page": "Sochi", "response": ["The coastline was ceded to Russia in 1829 as a result of the Russo-Circassian War and the Russo-Turkish War, 1828–1829; however, the Circassians did not accept the Russian control over Circassia and kept resisting the newly established Russian outposts along the Circassian coast ().Exposition of the Historical Museum of Sochi, partly reflected in Russian in (History of Sochi) at the official site of the citySochi – from ancient sites to 2014 Olympics, information from the Historical Museum of Sochi Provision of weapons and ammunition from abroad to the Circassians caused a diplomatic conflict between the Russian Empire and the British Empire that occurred in 1836 over the mission of the Vixen.Peter Hopkirk The great game: On Secret Service in High Asia, Chapter 12 \"The Greatest Fortress in the World\", pp. 158–159, Oxford University Press, 2001 "]}, {"page": "Royal Society for Asian Affairs", "response": ["* Peter Hopkirk (died August 2014), writer and traveller"]}, {"page": "Indian March of Paul", "response": ["In his book about the Great Game, Peter Hopkirk narrates that Paul had not been able to obtain a detailed map of India until the Cossacks' departure from Orenburg. He quotes the Tsar as instructing Orlov: \"My maps only go as far as Khiva and the River Oxus. Beyond these points it is your affair to gain information about the possessions of the English, and the condition of the native population subject to their rule\"."]}, {"page": "Father Hendricks", "response": ["Father Hendricks (March 17, 1846 in Venlo – June 22, 1906 in Kashgar) was a Dutch Roman Catholic missionary.Peter Hopkirk, Foreign Devils on the Silk Road: The Search for the Lost Cities and Treasures of Chinese Central Asia. Amherst: The University of Massachusetts Press. , 1980Oscar Terry Crosby, TIBET AND TURKESTAN – A JOURNEY THROUGH OLD LANDS AND A STUDY OF NEW CONDITIONS, 1905"]}, {"page": "Albert von Le Coq", "response": ["With the help of Theodor Bartus and his other assistants, Le Coq carved and sawed away over 360 kilograms (or 305 cases) of artifacts, wall-carvings, and precious icons, which were subsequently shipped to the museum. In Buried Treasures ..., Le Coq defends these \"borrowings\" as a matter of necessity, citing the turbulent nature of Chinese Turkestan at the time of the expeditions. Chinese consider this seizure a \"colonial rapacity\" comparable to the taking of the Elgin Marbles or the Koh-i-Noor diamond. The collections from the German expeditions were initially kept at the Indian Department of the Ethnological Museum of Berlin (Ethnologisches Museum Berlin). The artifacts were put on display at the museum and were open to the public until 1944 when the relics were destroyed in British bombing raids during World War II. The Ethnological Museum was bombed seven times in Allied bombing raids, destroying the larger wall murals which had been cemented into place and could not be moved; 28 of the finest paintings were totally destroyed. Smaller pieces were hidden in bunkers and coal mines at the outbreak of war and survived the bombings. When the Russians arrived in 1945 they looted at least 10 crates of treasures that they discovered in a bunker under the Berlin Zoo which have not been seen since. The remaining items have been collected together and are housed in a new museum in Dahlem, a suburb of Berlin,From the Introduction by Peter Hopkirk in the 1985 edition of Von Le Coq's Buried Treasures of Chinese Turkestan, p. ix-x. the Museum of Indian Art (Museum für Indische Kunst) from 1963 and finally combined into a single location at the Berlin-Brandenburg Academy of Sciences and Humanities (Berlin-Brandenburgische Akademie der Wissenschaften, BBAW), since 1992. "]}, {"page": "Greenmantle", "response": ["Peter Hopkirk's nonfiction work Like Hidden Fire, published in 1997, follows actual German plots to destabilise the region during World War I.  While Hopkirk draws various connections between Buchan's work and the historical events, there is no indication that Buchan had knowledge of the actual events or used them as the basis for his story. However, Lewis Einstein's book Inside Constantinople: A Diplomatist's Diary During the Dardanelles Expedition, April to September, 1915 refers to a German woman agitating the Muslim population in Constantinople, in the mode of Hilda von Einem, so this element of the story may have some factual basis."]}, {"page": "Rudolf Hoernlé", "response": ["The first forged manuscript came from Islam Akhun, purchased by George Macartney and sent to Hoernle in 1895. Thereafter several more Akhun manuscripts followed. According to Peter Hopkirk, Backlund stationed in Central Asia wrote to Hoernle, informing him of his suspicions about Akhun's forgery, and reasons to doubt purchases from Akhun. However, Hoernle found reasons to dismiss Backlund's concerns and continue his analysis of manuscripts sold by Akhun, stating \"if these are copies freshly produced, then they are copies of ancient manuscripts\" just like reprints of old books.", "Thereafter, he published A Collection of Antiquities from Central Asia: Part 1 on them. The truth about the forged manuscripts by Islam Akhun was confirmed during a site visit to Khotan by the explorer and long term collaborator Sir Aurel Stein and revealed to Hoernle.Susan Whitfield (editor), Dunhuang Manuscript Forgeries (2002), British Library, pp. 5–8. Stein found many manuscript fragments similar to the Bower and Weber manuscripts in different parts of Central Asia but found nothing remotely similar to those sold by Islam Akhun and ultimately delivered through Macartney to Hoernle since 1895. Stein visited Akhun in person, wasn't able to verify any of the sites Akhun had previously claimed to be the source of his elaborate manuscripts. Akhun first tried to offer alternative explanations, but his workers and he ultimately confessed to the fraud. Stein saw the forgery operations and discovered that Hoernle's good faith was wrong. Akhun and his workers never had any ancient manuscripts they were making copies from. Stein reported his findings to Hoernlé, who was deeply dismayed by the forgeries and his error, and upset. He considered acquiring and destroying Part 1 of his report. It had already been widely distributed after being published as a special number of the Journal of the Asiatic Society of Bengal, and Stein had already disclosed the forgery that formed that collection. Hoernle went ahead and published Part 2, glossing over his personal errors in Part 1, according to Peter Hopkirk. Hoernle did include a note for the benefit of all scholars, stating: "]}, {"page": "Bower Manuscript", "response": ["The discovery of the Bower Manuscript, its antiquity, and its decipherment by Hoernle triggered \"enormous excitement\" in the 1890s, states Wujastyk. Famous explorers were commissioned by some of the world's major powers of the era – such as Britain, Germany, Japan, France, Russia – to go on a Central Asia and Xinjiang expedition. They were to seek manuscripts and other ancient treasures. These expeditions yielded major discoveries such as the Dunhuang manuscripts,On the Trail of Texts Along the Silk Road. Russian Expeditions Discoveries of Manuscripts in Central Asia, I. Popova and Takata Tokio (2009), Kyoto National Museum, Japan and The Institute of Oriental Manuscripts of the Russian Academy of Sciences, Russia as well as famous forgeries such as those of Islam Akhun, in the decades that followed.Peter Hopkirk (1980), Foreign Devils on the Silk Road: The Search for the Lost Cities and Treasures of Chinese Central Asia, University of Massachusetts Press, ", "* Peter Hopkirk, Foreign Devils on the Silk Road: The Search for the Lost Cities and Treasures of Chinese Central Asia (Amherst: The University of Massachusetts Press, 1980) "]}, {"page": "Frederick Burnaby", "response": ["(both with an introduction by Peter Hopkirk)"]}, {"page": "Mary, Turkmenistan", "response": ["A force of the British Indian Army consisting of a machine gun detachment comprising 40 Punjabi troops and a British officer resisted the Bolsheviks near Merv in August 1918 in what was the first direct confrontation between British and Russian troops since the Crimean War.On Secret Service East of Constantinople by Peter Hopkirk, John Murray, 1994"]}, {"page": "Anti-Russian sentiment", "response": ["Though Anglo-Russian relations were traditionally warm since the 15th and 16th centuries, by the beginning of the 19th centuries Russophobia started to become appear in the media.John Howes Gleason, The Genesis of Russophobia in Great Britain: A Study of the Interaction of Policy and Opinion, 1971, p.1 Depictions of Russia by British travel writers and newspaper correspondents described the country \"as a semi-barbaric and despotic country\", an image which ingrained itself in the British public consciousness as such depictions were frequently published in the UK media; these depictions had the effect of increasing Russophobia in Britain despite growing economic and political ties between the two countries.Iwona Sakowicz, \"Russia and the Russians opinions of the British press during the reign of Alexander II (dailies and weeklies).\" Journal of European studies 35.3 (2005): 271-282. The Russian conquest of Central Asia was perceived in Britain as being a precursor to an attack on British India and led to the \"Great Game\", while the Crimean War between the two countries also had the effect of deepening Russophobia in Britain. In 1874, tension lessened as Queen Victoria's second son Prince Alfred married Tsar Alexander II's only daughter Grand Duchess Maria Alexandrovna, followed by a state visit to Britain by the tsar. The goodwill lasted no more than three years, when structural forces again pushed the two nations to the verge of war, leading to a re-emergence of Russophobia in Britain. Large outbursts of Russophobia in Britain typically occurred during periods of tense political standoffs, such as the 1904 Dogger Bank incident, when the Baltic Fleet of the Imperial Russian Navy attacked a group of British fishing trawlers in the mistaken belief they were Japanese warships; outrage in Britain led to the Russian government paying compensation to the fishermen involved.Peter Hopkirk. The Great Game, Kodansha International, 1992, pg.38 "]}, {"page": "Langdon Warner", "response": ["Langdon Warner's work in China is the subject of much controversy among art historians. On the one side, there are those who say that he pillaged sites in Asia of their art, in particular, frescos from the Mogao caves at Dunhuang.Peter Hopkirk: Foreign Devils on the Silk Road. Amherst : University of Massachusetts Press, 1984, c1980Sanchita  Balachandran: Object Lessons: The Politics of Preservation and Museum Building in Western China in the Early Twentieth Century. International Journal of Cultural Property  (2007), 14 : 1-32 Cambridge University Press In 1922, the Fogg Museum sent Warner to China to explore western China.  He arrived at the Mogao Caves in Dunhuang in January 1924 and, armed with a special chemical solution for detaching wall-paintings, he removed twenty-six Tang dynasty masterpieces from caves 335, 321, 323 & 320. Warner first applied the chemical solution (strong glue) to the painting on the cave wall. He then placed a cloth against it. The cloth was then pulled away from the fresco and then he applied plaster of Paris on the back of the painting and transferred the painting to the plaster surface. Warner had found evidence that the caves were the object of vandalism by Russian soldiers and reached an agreement with the local people to purchase the frescoes and remove them in order to save them for posterity. Unfortunately, the removal process resulted in some damage to the site itself. Luckily, frescoes he framed with glue but were unable to remove are still on display in the  caves today. Only five of the 26 fragments of murals that he removed are in good enough condition to be exhibited now in the Harvard Art Museums, Cambridge, Massachusetts."]}, {"page": "Aubrey Herbert", "response": ["Unclear policy led to nationalist criticism from imperial bases such as EgyptKeith Jeffery, The British army and the crisis of empire 1918–22, Manchester University Press, Studies in Military History, 1984;  (see Saad Zaghlul, 1919) at the Paris Peace Conference, 1919, nor was the resulting political handling cause for much optimism to privileged witnesses such as Aubrey, T. E. Lawrence or Gertrude Bell. At the conference, there was a glimpse of further prospect for Aubrey Herbert when the Italian delegates proposed to assume shared responsibilityChapter 8: Persia and Mesopotamia, p. 136 over the Caucasus, an area of vital strategic importancePeter Hopkirk, On Secret Service East of Constantinople, Oxford University Press, 1995; . – the Baku oilfields, access from the north to Mosul and Kirkuk. By May 1919, the proposal appeared to be quite empty."]}, {"page": "Foreign relations of the Soviet Union", "response": ["Lenin's plans failed, although Russia did manage to hold onto the Central Asian and Caucasian domains that had been part of the Russian Empire.Peter Hopkirk, Setting the East Ablaze: Lenin's Dream of an Empire in Asia 1984 (1984) The revolutionary stage ended after the Soviet defeat in the Battle of Warsaw during the Soviet-Polish War of 1920-21.Adam Zamoyski, Lenin's Failed Conquest of Europe (2008) As Europe's revolutions were crushed and revolutionary zeal dwindled, the Bolsheviks shifted their ideological focus from the world revolution and building socialism around the globe to building socialism inside the Soviet Union, while keeping some of the rhetoric and operations of the Comintern continuing. In the mid-1920s, a policy of peaceful co-existence began to emerge, with Soviet diplomats attempting to end the country's isolation, and concluding bilateral arrangements with capitalist governments. An agreement was reached with Germany, Europe's other pariah, in the Treaty of Rapallo in 1922.Aleksandr M. Nekrich, Pariahs, Partners, Predators: German–Soviet Relations, 1922–1941 (1993) At the same time the Rapallo treaty was signed it set up a secret system for hosting large-scale training and research facilities for the German army and air force, despite the strict prohibitions on Germany in the Treaty of Versailles. These facilities operated until 1933.Gordon H. Mueller, \"Rapallo Reexamined: a new look at Germany's secret military collaboration with Russia in 1922.\" Military Affairs (1976): 109-117. online"]}, {"page": "John Lockwood Kipling", "response": ["During 1875, Kipling was appointed the Principal of Mayo School of Arts, Lahore, British India (present day National College of Arts, Pakistan) and also became curator of the old original Lahore Museum which figured as the Wonder House or Ajaib Ghar in Kim,Tarin, O, in 'The Kipling Journal', June 2008, pp 10–21 not to be confused with the present one.For details see Peter Hopkirk, Quest for Kim:In Search of Kipling's Great Game London: J Murray, 1996 He retired back to England in 1893."]}, {"page": "William Moorcroft (explorer)", "response": ["*Peter Hopkirk,  The Great Game: On Secret Service in High Asia, John Murray, 1990, "]}, {"page": "Lahore Museum", "response": ["Lahore Museum was originally established in 1865–66 on the site of the current Tollinton Market – a hall built for the 1864 Punjab Exhibition.Which later became the Tollinton Market after the completion of the new/present museum building, see \"Murray's Handbook of the Punjab\", pub. 1883. Mention also made in Peter Hopkirk, \"Quest for Kim\", London, 1996, pp.46–47  The present building was constructed as a memorial of Golden Jubilee of Queen Victoria held in 1887, and financed through a special public fund raised on the occasion. The foundation stone of the new museum was laid on 3 February 1890 by Prince Albert Victor, Duke of Clarence and Queen Victoria's grandson.  On its completion in 1894, the entire museum collection was transferred to present building with its new name as Jubilee Museum."]}, {"page": "Trans-Caspian railway", "response": ["Both railway and workers also played an important role in the Russian Civil War. Troops of the British Indian Army participated in some of the battles along the railway line. Tashkent was an important bastion for the Red Army.On Secret Service East of Constantinople, by Peter Hopkirk, John Murray 1994"]}, {"page": "Frederick Marshman Bailey", "response": ["*Bailey F. M. Mission to Tashkent (London: Jonathan Cape, 1946; republished by Oxford University Press, 1992 and 2002, Peter Hopkirk, ed.)"]}, {"page": "Charles Stoddart", "response": ["*Peter Hopkirk, The Great Game, Kodansha International, 1992, , p. 565The timeline of the Great Game is available online."]}]}}