{"wiki_id": "http://www.wikidata.org/entity/Q134942", "itemLabel": "William Somerset Maugham", "itemDescription": "English playwright, novelist, short story writer (1874-1965)", "wikipedia_url": "https://en.wikipedia.org/wiki/W._Somerset_Maugham", "wikipedia_page": {"main": "William Somerset Maugham  ( MAWM; 25 January 1874 – 16 December 1965) was an English playwright, novelist, and short-story writer. He was among the most popular writers of his era and reputedly the highest-paid author during the 1930s.Both Maugham's parents died before he was 10, and the orphaned boy was raised by a paternal uncle, who was emotionally cold. He did not want to become a lawyer like other men in his family, so he trained and qualified as a physician. His first novel Liza of Lambeth (1897) sold out so rapidly that Maugham gave up medicine to write full-time.\nDuring the First World War, he served with the Red Cross and in the ambulance corps before being recruited in 1916 into the British Secret Intelligence Service. He worked for the service in Switzerland and Russia before the October Revolution of 1917 in the Russian Empire. During and after the war, he travelled in India, Southeast Asia and the Pacific. He drew from those experiences in his later short stories and novels.", "link_mentions": [{"page": "1874", "response": ["* January 25 – William Somerset Maugham, English author (d. 1965)"]}, {"page": "Pago Pago", "response": ["English author W. Somerset Maugham and his secretary Gerald Haxton visited Pago Pago from December 16, 1916, to January 30, 1917 on their way from Hawaii to Tahiti. Also on board the ship was a passenger named Miss Sadie Thompson, who had been evicted from Hawaii for prostitution. She was later the main character in the popular short story, Rain (1921), a story of a prostitute arriving in Pago Pago. Delayed because of a quarantine inspection, they checked into what is now known as Sadie Thompson Inn. Maugham also met an American sailor here, who later appeared as the title character in another short story, Red (1921).Rogal, Samuel J. (1997). A William Somerset Maugham Encyclopedia. Greenwood Publishing Group. Page 244. . The Sadie Thompson Inn was added to the U.S. National Register of Historic Places in 2003."]}]}}