{"wiki_id": "http://www.wikidata.org/entity/Q1341518", "itemLabel": "Ugo Ehiogu", "itemDescription": "English association football player (1972-2017)", "wikipedia_url": "https://en.wikipedia.org/wiki/Ugo_Ehiogu", "wikipedia_page": {"main": "Ugochuku Ehiogu (; 3 November 1972 – 21 April 2017) was an English professional footballer who played as a centre back from 1989 to 2009. He was the coach of the Tottenham Hotspur U23 team until his death in April 2017.\nHe played in the Premier League with lengthy spells at Aston Villa and Middlesbrough. He also played in the Football League for West Bromwich Albion, Leeds United and Sheffield United, as well as a spell in the Scottish Premier League with Rangers. He won two Football League Cups, with Aston Villa in 1996 and then with Middlesbrough in 2004. Ehiogu was an England international, with a record of 4 caps and 1 goal. In 1993, playing for the England under-21 team, he became the first black player to captain an England team in a competitive match. In 2012, he came out of brief retirement by signing for non-league side Wembley to participate in the club's FA Cup games alongside other retired veteran players.\nEhiogu died on 21 April 2017 after suffering a cardiac arrest at Tottenham Hotspur's training ground.", "link_mentions": [{"page": "April 21", "response": ["*2017 – Ugo Ehiogu, English footballer (b. 1972)"]}, {"page": "November 3", "response": ["*1972 – Ugo Ehiogu, English footballer and manager (d. 2017)"]}, {"page": "Highgate Cemetery", "response": ["* Ugo Ehiogu, footballer"]}, {"page": "Ole Gunnar Solskjær", "response": ["Solskjær made his long-awaited return to action on 5 December 2005, playing for United's reserves against Liverpool. Spectators numbering 2,738 showed up to witness the comeback of the popular Norwegian – an above-average turn-out for a reserve team match. He made his first-team return as a substitute in the match against Birmingham City on 28 December. He then finally made his first start in January 2006 in an FA Cup match against Burton Albion, before playing a full game as a captain in the third round replay. His return to full fitness slowly continued with regular appearances in the reserves, until on 8 March 2006 when, during a game against Middlesbrough, he was accidentally caught by Ugo Ehiogu, breaking his cheekbone. While facing the possibility of missing the rest of the season, he nevertheless appeared as a substitute against Sunderland on Good Friday. Solskjær had a successful pre-season tour in the summer of 2006 gaining Ferguson's praise who also said he would reconsider his plan to buy a new striker."]}, {"page": "Ugo", "response": ["* Ugo Ehiogu, English football player"]}, {"page": "Little Aston", "response": ["*Ugo Ehiogu, Premier League and international footballer, lived in Little Aston during his English career."]}, {"page": "Paddy Power", "response": ["In September 2017, Paddy Power offered odds on a dead footballer, Ugo Ehiogu, to become the new manager of Birmingham City F.C. The company said it had made an error. For the 2018 FIFA World Cup, Paddy Power was criticised for its controversial polar bear graffiti stunt, with a Russian polar bear being emblazoned with an England flag. Paddy Power claims the stunt is for awareness of the plight of polar bears in the Russian Arctic."]}, {"page": "Brian Little", "response": ["Under Little, young players like Mark Bosnich and Ugo Ehiogu were now getting more first team chances, but Villa also made a large number of new signings between November 1994 and August 1995, including Gary Charles, Ian Taylor, Mark Draper and Savo Milošević. The new look Villa team gelled well, and 1995–96 was a successful season at Villa Park. The club finished fourth in the Premiership, reached the FA Cup semi-finals and won the Football League Cup with a 3–0 win over Leeds United at Wembley. Trinidad and Tobago striker Dwight Yorke had now firmly established himself as a potent goalscorer."]}, {"page": "1995–96 FA Premier League", "response": ["| colspan=\"3\" align=\"center\" |  Ugo Ehiogu (Aston Villa)"]}, {"page": "Sam Allardyce", "response": ["Looking to avoid another relegation battle, Allardyce made a number of signings in preparation for the 2003–04 season, the most significant of which were Brazilian defender Emerson Thome, Greece international Stelios Giannakopoulos, and target-man striker Kevin Davies. Allardyce's side finished eighth in the league and reached the League Cup final, in what was his first major domestic final appearance as a player or manager. Bolton lost 2–1 to Middlesbrough in the final, though Allardyce blamed referee Mike Riley for not giving a late penalty for an alleged handball by Ugo Ehiogu."]}, {"page": "Chris Riggott", "response": ["Riggott immediately became popular among the fans, scoring twice on his second appearance in the Tees-Wear derby against Sunderland at the Stadium of Light, which Middlesbrough won 3–1. He was also part of the 2004 League Cup final squad but did not play in the final. In the 2004–05 season he made 32 appearances, mostly covering for the much injured Ugo Ehiogu, contributing to the team's most successful season since the Premier League was established."]}, {"page": "Shaun Teale", "response": ["He was a central defender who joined AFC Bournemouth from non-league Weymouth for £50,000 in 1989. He spent three seasons at Bournemouth before moving to Aston Villa in July 1991. He helped them finish runners-up in the Premier League in 1993 and win the Football League Cup a year later, before losing his place in the first team to Ugo Ehiogu."]}, {"page": "Emmanuel Adebayor", "response": ["Adebayor was also eligible to play for Nigeria but chose to represent the country of his birth, Togo.The list of Nigeria qualified players who, for various reasons, preferred to play for foreign countries is endless. Among them are Emmanuel Olisadebe, Ugo Ehiogu, Gabriel Agbonlahor, Patrick Owomoyela, Ugochukwu Onyewu, Stefano Okaka and Emmanuel Adebayor. ngrguardiannews, 12 April 2009 Adebayor helped Togo qualify for the 2006 Africa Cup of Nations after scoring 11 goals in the qualifiers, more than any other player in the African qualifiers. On 10 February 2009, the Confederation of African Football (CAF) picked Adebayor as the African Footballer of the Year for 2008 at an awards ceremony held in Lagos, Nigeria. Adebayor beat final nominees Mohamed Aboutrika of Egypt and Ghana's Michael Essien in a vote that involved the national team coaches of CAF's 54 member-nations. It was the first time a Togolese won the award as Africa's best player."]}, {"page": "2000–01 in English football", "response": ["*20 September – Ugo Ehiogu from Aston Villa to Middlesbrough, £8m"]}, {"page": "Wembley F.C.", "response": ["On 21 June 2012 it was announced the club had recruited former internationals Ray Parlour, Martin Keown, Graeme Le Saux, Claudio Caniggia and Brian McBride to play in their FA Cup campaign that season. Tobias Piers Webb remained in the side despite calls for him to step down due to a string of poor performances along side Martin Parry, Christopher Lidstone, Stephen Garner, Cliff Darby, Liam Connolly, Rob Collins, Ross Mackiewicz, Pardeep Rai, Paddy Barron and Colin O’Connor. The north London side also hired David Seaman as goalkeeping coach. Ugo Ehiogu was drafted in later for the preliminary qualifying game against Uxbridge, but could not prevent Wembley from being knocked out. At the end of the 2020–21 season the club were transferred to the Premier Division North of the Combined Counties League.", "*Ugo Ehiogu (Played one match in the FA Cup for the club)"]}, {"page": "History of Rangers F.C.", "response": ["On 10 January 2007, it was announced that Walter Smith was the new manager of Rangers, with Ally McCoist confirmed as assistant manager and Kenny McDowall as first team coach. Smith and his team undertook some serious surgery to the side. He signed experienced defenders David Weir, Ugo Ehiogu and Andy Webster to shore up the rocky backline. This proved to be a steadying influence on the team and they only lost three times until the end of the season, although Webster injured himself during his first training session at the club and did not make his debut until September 2007."]}, {"page": "1991–92 in English football", "response": ["12 July 1991 – Ron Atkinson looks to the future when he signs 18-year-old defender Ugo Ehiogu for Aston Villa from West Bromwich Albion for £40,000. Former Tottenham Hotspur manager Peter Shreeves leaves Watford to return to White Hart Lane as a coach, having worked at Vicarage Road on the coaching staff of former Tottenham player Steve Perryman."]}, {"page": "1995–96 in English football", "response": ["28 May 1996: Leicester City win promotion back to the Premier League with a 2–1 win against Crystal Palace at Wembley Stadium, with Steve Claridge scoring the winner during the final minute of extra time. England's Euro 96 squad is announced, but does not include Peter Beardsley, Ugo Ehiogu, Dennis Wise, Robert Lee and Jason Wilcox. Stuart Pearce, who is the oldest player in the England squad at 34, signs a three-year contract with Nottingham Forest."]}, {"page": "2006–07 in Scottish football", "response": ["Celtic further strengthened their squad with the signings of Paul Hartley from Hearts and Mark Brown from Inverness, while Steven Pressley was also signed after being released by Hearts. Shaun Maloney joined Aston Villa after contract negotiations broke down. New Rangers manager Walter Smith brought in defenders David Weir, Andy Webster and Ugo Ehiogu and spent £2m on Hibs' highly rated midfielder Kevin Thomson. Hearts looked to boost their European qualification hopes with the signing of a further four players on loan from FBK Kaunas as well as Laryea Kingston from Terek Grozny. New Dunfermline boss Stephen Kenny brought in loan signings James O'Brien from Celtic, Adam Hammill from Liverpool and Stephen Glass from Hibs with the club bottom of the SPL.", "*25 January 2007 – Ugo Ehiogu from Middlesbrough to Rangers, Free"]}, {"page": "2006–07 Rangers F.C. season", "response": ["Immediately Smith began an overhaul at the club. He deemed the defence to be the main reason for Rangers poor season. The signings of defenders David Weir and Ugo Ehiogu soon followed, along with young midfielder Kevin Thomson from Hibernian. The side's form picked up and they ended the season in second place in the Scottish Premier League and recorded a brace of Old Firm wins over Celtic.", "|Ugo Ehiogu", "|Ugo Ehiogu"]}, {"page": "2000 FA Cup Final", "response": ["|DF ||5|| Ugo Ehiogu"]}, {"page": "Gianluca Festa", "response": ["When many of Middlesbrough's players left following relegation, Festa stayed and helped win promotion back to the top flight. His performances earned him the Middlesbrough player of the year award in 1998. Festa was squeezed out by the arrivals of England internationals Gareth Southgate and Ugo Ehiogu but remained as a squad player. In his final season at Boro they again reached the FA Cup semi finals. This time they faced Arsenal. Festa came on as a substitute for the injured Ehiogu with the score poised at 0–0. However, he unfortunately scored an own goal which proved to be decisive, as Arsenal reached the final with a narrow 1–0 win. Other memorable moments for Festa include scoring a late equaliser in a 3–3 draw with Southampton despite his team being reduced to 9 men, and an equaliser against North East rivals Newcastle United."]}, {"page": "Tottenham Hotspur F.C. Under-23s and Academy", "response": ["As of the 2013 – 2014 season the Development Squad have played in the Barclays U21 Premiership League. In July 2014, former Aston Villa and Middlesbrough defender Ugo Ehiogu was appointed Under-21 Team Coach following a period of part-time work within the Academy.Under 21s Appointment THFC website, Accessed 25 July 2014 However, on 20 April 2017, Ehiogu went into cardiac arrest after collapsing at Tottenham's training ground; he died the following day at the age of 44. Two months later, Tottenham announced that they had appointed former Dagenham and Redbridge manager Wayne Burnett as Ehiogu's successor, with former player Scott Parker taking charge of the Under-18s."]}, {"page": "Matt Heath", "response": ["On 9 November 2006 he joined Leeds United on loan. He made his Leeds debut in the 3–0 victory over Colchester United on 11 November 2006. Heath played in nearly all of Leeds matches during his loan spell playing in central defence with the likes of Ugo Ehiogu and Matthew Kilgallon. Heath was not eligible to play in Leeds' 2–1 victory against Coventry City due to a clause in his loan contract. Heath's loan spell at Leeds came to an end on 1 January 2007 and returned to Coventry City, but the following day he was free transferred to Leeds United, with a permanent contract until the end of the season. Heath's contract came to an end in June 2007 and was released, however, he re-signed a new contract at Elland Road shortly after with wages of £2,200 per week."]}, {"page": "1996 Football League Cup Final", "response": ["|CB ||6|| Ugo Ehiogu"]}, {"page": "2004 Football League Cup Final", "response": ["The second half had fewer incidents. Schwarzer saved a header from Nolan, while Juninho had two opportunities for Middlesbrough. In the final few minutes, Thome made a crucial block against Mendieta, and at the other side of the pitch Ugo Ehiogu did the same to thwart Stelios.", "|CB ||4 || Ugo Ehiogu"]}, {"page": "British Nigerian", "response": ["*Ugo Ehiogu, footballer"]}, {"page": "Steve Dunn (referee)", "response": ["Dunn's first ever Premiership match was on 23 August 1995, when Tottenham lost 1–0 at home to Aston Villa, the only goal coming from Ugo Ehiogu.First Premier League Appointment, Spurs v. Aston Villa: soccerbase.com website."]}, {"page": "History of Middlesbrough F.C.", "response": ["Lee Dong-Gook arrived from Pohang Steelers in the January transfer window, while Ray Parlour, Ugo Ehiogu and Massimo Maccarone all left the club for free."]}, {"page": "2006 UEFA Cup Final", "response": ["|DF ||4 || Ugo Ehiogu"]}, {"page": "2006–07 Middlesbrough F.C. season", "response": ["Lee Dong-Gook arrived from Pohang Steelers in the January transfer window, while Ray Parlour, Ugo Ehiogu and Massimo Maccarone all left the club for free.", "|25 January 2007|| Ugo Ehiogu|| Rangers||Free||", "|23 November 2006|| Ugo Ehiogu||Leeds United||To 2007-01-01||"]}]}}