{"wiki_id": "http://www.wikidata.org/entity/Q1344250", "itemLabel": "Peter Cheyney", "itemDescription": "British writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Peter_Cheyney", "wikipedia_page": {"main": "Reginald Evelyn Peter Southouse-Cheyney (22 February 1896 – 26 June 1951), known as Peter Cheyney, was a British crime fiction writer who flourished between 1936 and 1951. Cheyney is perhaps best known for his short stories and novels about agent/detective Lemmy Caution, which, starting in 1953, were adapted into a series of French movies, all starring Eddie Constantine (however, the best known of these – the 1965 science fiction film Alphaville – was not directly based on a Cheyney novel). Another popular creation was the private detective Slim Callaghan who also appeared in a series of novels and subsequent film adaptations.\nAlthough out of print for many years, Cheyney's novels have never been difficult to find second-hand. Several of them have recently been made available as e-books.", "link_mentions": [{"page": "From Russia, with Love (novel)", "response": ["From Russia, with Love received mainly positive reviews from critics. Julian Symons, in The Times Literary Supplement, considered that it was Fleming's \"tautest, most exciting and most brilliant tale\", that the author \"brings the thriller in line with modern emotional needs\", and that Bond \"is the intellectual's Mike Hammer: a killer with a keen eye and a soft heart for a woman\". The critic for The Times was less persuaded by the story, suggesting that \"the general tautness and brutality of the story leave the reader uneasily hovering between fact and fiction\". Although the review compared Fleming in unflattering terms to Peter Cheyney, a crime fiction writer of the 1930s and 1940s, it concluded that From Russia, with Love was \"exciting enough of its kind\"."]}, {"page": "Whitechapel", "response": ["* Peter Cheyney, mystery writer and journalist, 1896–1951"]}, {"page": "Alphaville (film)", "response": ["Expatriate American actor Eddie Constantine plays Lemmy Caution, a trenchcoat-wearing secret agent. Constantine had already played this or similar roles in dozens of previous films; the character was originally created by British pulp novelist Peter Cheyney. However, in Alphaville, director Jean-Luc Godard moves Caution away from his usual twentieth-century setting and places him in a futuristic sci-fi dystopia, the technocratic dictatorship of Alphaville."]}, {"page": "1936 in literature", "response": ["*Peter Cheyney – This Man Is Dangerous"]}, {"page": "1938 in literature", "response": ["*Peter Cheyney "]}, {"page": "1939 in literature", "response": ["*Peter Cheyney – Dangerous Curves"]}, {"page": "1940 in literature", "response": ["*Peter Cheyney "]}, {"page": "1941 in literature", "response": ["*Peter Cheyney "]}, {"page": "1942 in literature", "response": ["*Peter Cheyney "]}, {"page": "1943 in literature", "response": ["*Peter Cheyney – You Can Always Duck"]}, {"page": "1944 in literature", "response": ["*Peter Cheyney "]}, {"page": "1945 in literature", "response": ["*Peter Cheyney "]}, {"page": "1946 in literature", "response": ["*Peter Cheyney "]}, {"page": "1947 in literature", "response": ["*Peter Cheyney "]}, {"page": "1948 in literature", "response": ["* Peter Cheyney – Dark Wanton"]}, {"page": "1949 in literature", "response": ["*Peter Cheyney "]}, {"page": "1950 in literature", "response": ["* Peter Cheyney"]}, {"page": "1951 in literature", "response": ["*Peter Cheyney – Ladies Won't Wait"]}, {"page": "Pevensey", "response": ["*Pevensey, and in particular Pevensey Bay, feature in the 1946 crime novel Uneasy Terms by best selling author Peter Cheyney. In Chapter 7 the hero, a private detective called Slim Callaghan, goes for a ride out on Pevensey Bay with the alluring murder suspect, Corinne Alardyse."]}, {"page": "Berkeley Square", "response": ["*One of Peter Cheyney's main characters, private detective Slim Callaghan, had his office on Berkeley Square"]}, {"page": "Lemuel", "response": ["* Lemuel \"Lemmy\" Caution, special agent / private detective created by Peter Cheyney"]}, {"page": "List of fiction set in Chicago", "response": ["*Peter Cheyney, Dark Hero"]}, {"page": "Poison ivy (disambiguation)", "response": ["* La môme vert-de-gris or Poison Ivy, a 1953 French film by Bernard Borderie, based on Peter Cheyney's novel", "* Poison Ivy, a 1937 novel by Peter Cheyney that was adapted as a 1953 French film"]}, {"page": "Eddie Constantine", "response": ["In the 1950s Constantine was a star in France because of his role as the hard-boiled detective/secret agent Lemmy Caution (from Peter Cheyney's novels) in a series of French B-pictures, including La môme vert-de-gris (1953), This Man Is Dangerous, Ça va barder (1953), Je suis un sentimental (1955), Lemmy pour les dames (1961) and Your Turn, Darling (1963)."]}, {"page": "Alfriston", "response": ["The 1946 novel Uneasy Terms by crime and thriller writer Peter Cheyney is set mainly in and around Alfriston. The private detective Slim Callaghan stays in one of the pubs in Alfriston, which in the novel is called 'The Two Friars', whilst solving a murder at the nearby house 'Dark Spinney', home of the Alardyse family. The author describes the village thus: \"Callaghan walked slowly through the open space at the end of Alfriston High Street. The afternoon sun shone on the old houses, and the tree in the middle of the little square threw a pleasant shadow.\" Several other local places are mentioned in the novel, among them Brighton, Eastbourne, Herstmonceux, Pevensey Bay, Rottingdean and Polegate. The book was made into a film in 1948, starring Moira Lister and Michael Rennie. Cheyney also mentions Alfriston in several other of his novels, including Dance without Music (1947)."]}, {"page": "The Lady in the Morgue", "response": ["*Peter Cheyney's Can Ladies Kill? (1938) for another lady in a morgue"]}, {"page": "List of fictional secret agents", "response": ["*Lemmy Caution, in Peter Cheyney's novels"]}, {"page": "Federal Bureau of Investigation portrayal in media", "response": ["* In 1936, British crime writer Peter Cheyney introduced G Man Lemmy Caution in his novel, This Man Is Dangerous. Another novel featuring Caution is Can Ladies Kill? (1938)."]}, {"page": "Pan Books", "response": ["Pan specialised in publishing paperback fiction and, along with Penguin Books, was one of the first popular publishers of this format in the UK. Many popular authors saw their works given paperback publication through Pan, including Ian Fleming, whose James Bond series first appeared in paperback in the UK as Pan titles. So too did Leslie Charteris's books about The Saint, Peter O'Donnell's Modesty Blaise, and numerous novels by Edgar Wallace, Agatha Christie, Erle Stanley Gardner, Peter Cheyney, Georgette Heyer, Neville Shute, John Steinbeck, Josephine Tey and Arthur Upfield. Pan also published paperback editions of works by classic authors such as Jane Austen and Charles Dickens.The First Twenty Five Years of PAN Paperback Books: 1945 to 1970, tikit.net. Retrieved 13 October 2017. Another notable title was The Hitchhiker's Guide to the Galaxy by Douglas Adams."]}, {"page": "Série noire", "response": ["Anglo-American literature forms the bulk of their collection: it features especially Raymond Chandler, Dashiell Hammett, Horace McCoy, William R. Burnett, Ed McBain, Chester Himes, Lou Cameron, Jim Thompson, Rene Brabazon Raymond (under his pseudonym James Hadley Chase) and Peter Cheyney. Books from the series were adapted into episodes on the 1984 television series of the same name."]}, {"page": "Marcel Duhamel", "response": ["In 1953 he was credited as screenplay writer for This Man Is Dangerous, a French film adaptation of Peter Cheyney's novel of the same name."]}, {"page": "Live and Let Die (novel)", "response": ["Philip Day of The Sunday Times noted \"How wincingly well Mr Fleming writes\"; the reviewer for The Times thought that \"[t]his is an ingenious affair, full of recondite knowledge and horrific spills and thrills—of slightly sadistic excitements also—though without the simple and bold design of its predecessor\". Elizabeth L Sturch, writing in The Times Literary Supplement, observed that Fleming was \"without doubt the most interesting recent recruit among thriller-writers\" and that Live and Let Die \"fully maintains the promise of ... Casino Royale.\" Tempering her praise of the book, Sturch thought that \"Mr Fleming works often on the edge of flippancy, rather in the spirit of a highbrow\", although overall she felt that the novel \"contains passages which for sheer excitement have not been surpassed by any modern writer of this kind\". The reviewer for The Daily Telegraph felt that \"the book is continually exciting, whether it takes us into the heart of Harlem or describes an underwater swim in shark-infested waters; and it is more entertaining because Mr Fleming does not take it all too seriously himself\". George Malcolm Thompson, writing in The Evening Standard, believed Live and Let Die to be \"tense; ice-cold, sophisticated; Peter Cheyney for the carriage trade\"."]}, {"page": "Robert Stiller", "response": ["Stiller translated, into Polish, works by Peter Cheyney, Frank Norris, Vachel Lindsay, Lewis Carroll, Eric Hoffer, Ayn Rand, John le Carré, Edward Lear, Farley Mowat, Anthony Hope, Anthony Burgess, David Morrell, Vladimir Nabokov, Robert Alley, Herman Wouk, Hilaire Belloc, Ian Fleming, John Lennon, Lynn Barber, Angel Smith, Joshua Trachtenberg, Todd Strasser, Ron Hansen, Wesley O. Hagood, Ronald Brownrigg, William Manchester, James Webb, and Andrew Holmes."]}, {"page": "Cheyney", "response": ["*Peter Cheyney (1896–1951), British writer"]}, {"page": "A Mysterious Affair of Style", "response": ["Clearly Adair is taking liberties when he makes Evadne Mount president of the Detection Club (which at the time was headed by E. C. Bentley). While there are references to British followers of the \"thick-ear school\"—the hardboiled style of crime writing— such as Peter Cheyney and James Hadley Chase, Evadne Mount's major worry is Agatha Christie herself, \"the rival in whose shadow it would seem she was eternally condemned to languish\" A Mysterious Affair of Style, p.97. despite the more than twenty successful whodunits she has published herself. Mount's long-running stage play, The Tourist Trap, anachronistically echoes Christie's The Mousetrap, which has been running in the West End since 1952."]}, {"page": "Can Ladies Kill?", "response": ["Can Ladies Kill? is a crime novel by British author Peter Cheyney first published in 1938 by William Collins, Sons & Co. Ltd. Set in San Francisco and featuring Cheyney's creation, G-Man Lemmy Caution, it belongs to the hardboiled school of crime writing.", "Category:Novels by Peter Cheyney"]}, {"page": "Lemmy Caution", "response": ["Lemmy Caution  is a fictional character created by British writer Peter Cheyney (1896–1951). Caution was first portrayed as a Federal Bureau of Investigation (FBI) agent, and in later stories as a private detective. Cheyney's first book with the character was published in 1936. When This Man Is Dangerous was released, Cheyney was working as a policeman, but the novel's success enabled him to become a professional author. Cheyney wrote eleven Lemmy Caution novels between 1936 and 1946. The Lemmy Caution radio series was broadcast in the 1940s in Australia and New Zealand.", "The film adaptions of Peter Cheyney's book showed Lemmy Caution as a strong and optimistic character who would win even when totally outnumbered, so it came as a shock to many fans when they saw Eddie Constantine's portrayal of Lemmy Caution in Alphaville (1965). In this film he appeared as a tired, elderly, gloomy-looking man, due to Jean-Luc Godard not allowing Constantine to wear make up in harshly lit scenes,p. 229 Brody, Richard Everything Is Cinema: The Working Life of Jean-Luc Godard Macmillan 13 May 2008 with Constantine wearing the kind of trenchcoat associated with Humphrey Bogart and looking as if he was spaced out and lost in a future world.", "In 1988 a French TV movie called Le retour de Lemmy Caution appeared, with Lemmy Caution once again as the leading character, but this Lemmy was far away from that of Peter Cheyney."]}]}}