{"wiki_id": "http://www.wikidata.org/entity/Q1341329", "itemLabel": "Paul Lawrie", "itemDescription": "professional golfer", "wikipedia_url": "https://en.wikipedia.org/wiki/Paul_Lawrie", "wikipedia_page": {"main": "Paul Stewart Lawrie  (born 1 January 1969) is a Scottish professional golfer who is best known for winning The Open Championship in 1999. He was a vice-captain for the European Ryder Cup team in 2016.", "link_mentions": [{"page": "Aberdeen", "response": ["The Royal Aberdeen Golf Club, founded in 1780 is the sixth oldest golf club in the world, and hosted the Senior British Open in 2005, and the amateur team event the Walker Cup in 2011. Royal Aberdeen also hosted the Scottish Open in 2014, won by Justin Rose. The club has a second course, and there are public golf courses at Auchmill, Balnagask, Hazlehead and King's Links. The 1999 winner of The Open Championship, Paul Lawrie, is from Aberdeen.", "* Paul Lawrie, golfer, winner of the 1999 Open Championship."]}, {"page": "List of Scots", "response": ["* Paul Lawrie (born 1969), golfer, winner 1999 Open Championship"]}, {"page": "The Open Championship", "response": ["Every year between 1994 and 2004 had a first-time winner. In 1999, the Open at Carnoustie was famously difficult, and Frenchman Jean van de Velde had a three-shot lead teeing off on the final hole. He ended up triple bogeying after finding the Barry Burn, and Scotman Paul Lawrie, ranked 241st in the world, ended up winning in a playoff. He was 10 strokes behind the leader going into the final round, a record for all majors. He was not the only unheralded champion during this span, as 396th-ranked Ben Curtis and 56th-ranked Todd Hamilton won in 2003 and 2004, respectively.", "|align=\"center\" | 128th || align=center|1999 ||  Paul Lawrie || align=\"center\" | 290 || align=\"center\" | +6 || Playoff ||  Justin Leonard Jean van de Velde || align=\"center\" | 2,000,000 || align=\"center\" | 350,000 || Carnoustie"]}, {"page": "1999 in sports", "response": ["* British Open – Paul Lawrie This Open is also remembered for the epic collapse of French golfer Jean van de Velde, who threw away a three–shot lead on the final hole, finding himself in a playoff which Lawrie won."]}, {"page": "Jack Nicklaus", "response": ["In 2000, Nicklaus played in his 44th and final U.S. Open. He shot 73-82 and missed the cut at Pebble Beach Golf Links. This was the same tournament where Tiger Woods won his first Open when he outclassed the nearest competitors by a 15-shot margin. During the tournament, after defending champion Payne Stewart had died in an airplane crash the previous October, Nicklaus was given Stewart's place in the traditional opening pairings alongside the Open Championship winner (Paul Lawrie) and the U.S. Amateur winner (David Gossett), and Nicklaus asked for a moment of silence in Stewart's honor before his opening tee shot.2000 US Open Film: \"Tiger's Roar\" United States Golf Association on YouTube"]}, {"page": "Payne Stewart", "response": ["In 2000, the PGA Tour established the Payne Stewart Award, given each year to a player who shows respect for the traditions of the game, commitment to uphold the game's heritage of charitable support and professional and meticulous presentation of himself and the sport through his dress and conduct. A bronze statue of Stewart celebrating his winning putt in 1999 at Pinehurst overlooks the 18th green of the No. 2 course. Also, at that year's U.S. Open at Pebble Beach, where he would have been the defending champion, further tributes were paid. Firstly, on the eve of the tournament, there was another memorial at the 18th hole where speakers again included Tracey Stewart and Azinger. This time, the attendees included Stewart's old caddy Mike Hicks plus other professionals due to compete in the tournament such as Mickelson, Love, David Duval, Tom Lehman, Lee Janzen and Sergio García, and it concluded with shots being hit into Stillwater Cove in a golf version of a 21-gun salute. The next day, when Stewart's defending champion spot in the traditional initial pairings alongside the Open Championship winner (Paul Lawrie) and U.S. Amateur winner (David Gossett) was given to Nicklaus playing in his 44th consecutive and final U.S. Open, Nicklaus asked for a moment of silence before his opening tee shot.2000 US Open Film: \"Tiger's Roar\" United States Golf Association on YouTube (co-produced and originally broadcast by NBC) García also wore Stewart's trademark navy plus fours in his honor during his first round."]}, {"page": "Robert Gordon University", "response": ["* Paul Lawrie, Golfer (Doctor of Laws 1999)"]}, {"page": "Carnoustie", "response": ["Carnoustie Golf Links is one of the venues in The Open Championship's rotation. The course first played host to The Open in 1931, when it was won by Tommy Armour of the US. Subsequent winners have included Henry Cotton of England in 1937, Ben Hogan of the US in 1953, Gary Player of South Africa in 1968, Tom Watson of the US in 1975, Paul Lawrie of Scotland in 1999, Pádraig Harrington of Ireland in 2007, and Francesco Molinari of Italy in 2018.", "The 1999 Open Championship is best remembered for the epic collapse of French golfer Jean van de Velde, who needed only a double-bogey six on the 72nd hole to win the Open—and proceeded to shoot a triple-bogey seven, tying with Paul Lawrie and 1997 champion Justin Leonard at 290, six over par. Lawrie won the playoff and the championship. With several experienced players running into difficulties on the course that year, the media responded by dubbing the course 'Carnasty'."]}, {"page": "Official World Golf Ranking", "response": ["|1999 ||  José María Olazábal || align=center|34 ||  Payne Stewart || align=center|13 ||  Paul Lawrie || align=center|159 ||  Tiger Woods || align=center|2"]}, {"page": "Paul McGinley", "response": ["| Paul Lawrie,  Daren Lee", "| Paul Lawrie,  Daren Lee"]}, {"page": "BMW PGA Championship", "response": ["| 2012 || Luke Donald (2) || align=\"center\" |273 || align=center|−15 || 4 strokes ||  Paul Lawrie Justin Rose ||Wentworth Club|| align=\"center\" |750,000", "| 1996 || Costantino Rocca|| align=\"center\" |274 || align=center|−14 || 2 strokes ||  Nick Faldo Paul Lawrie ||Wentworth Club|| align=\"center\" |233,324"]}, {"page": "Justin Leonard", "response": ["| Paul Lawrie,  Jean van de Velde"]}]}}