{"wiki_id": "http://www.wikidata.org/entity/Q1344901", "itemLabel": "Holmes Herbert", "itemDescription": "English actor (1882-1956)", "wikipedia_url": "https://en.wikipedia.org/wiki/Holmes_Herbert", "wikipedia_page": {"main": "Holmes Herbert (born Horace Edward Jenner; 30 July 1882 – 26 December 1956) was an English character actor who appeared in Hollywood films from 1915 to 1952, often as a British gentleman.", "link_mentions": [{"page": "Fu Manchu", "response": ["* Holmes Herbert in Daughter of the Dragon (1931)"]}, {"page": "1956", "response": ["* December 26 – Holmes Herbert, English actor (b. 1882)"]}, {"page": "The House of Rothschild", "response": ["* Holmes Herbert as Rowerth"]}, {"page": "The Adventures of Robin Hood", "response": ["* Holmes Herbert as the archery referee at the tournament"]}, {"page": "Foreign Correspondent (film)", "response": ["* Holmes Herbert as Asst. Commissioner"]}, {"page": "Dr. Jekyll and Mr. Hyde (1931 film)", "response": ["Dr. Henry Jekyll (Fredric March), a kind English doctor in Victorian London, is certain that within each man lurks impulses for both good and evil. He is desperately in love with his fiancée Muriel Carew (Rose Hobart) and wants to marry her immediately. But her father, Brigadier General Sir Danvers Carew (Halliwell Hobbes), orders them to wait. One night, while walking home with his colleague, Dr. John Lanyon (Holmes Herbert), Jekyll spots a bar singer, Ivy Pierson (Miriam Hopkins), being attacked by a man outside her boarding house. Jekyll drives the man away and carries Ivy up to her room to attend to her. Ivy tries to seduce Jekyll but, though he is tempted, he leaves with Lanyon.", "* Holmes Herbert as Dr. John Lanyon"]}, {"page": "The Letter (1940 film)", "response": ["* Holmes Herbert as Robert's Friend (uncredited)"]}, {"page": "1956 in film", "response": ["* December 26 – Holmes Herbert, 74, British actor, Dr. Jekyll and Mr. Hyde, The Invisible Man"]}, {"page": "1923 in film", "response": ["*I Will Repay directed by Henry Kolker; starring Holmes Herbert, Flora Le Breton – (GB)"]}, {"page": "Mark of the Vampire", "response": ["Sir Karell Borotyn (Holmes Herbert) is found murdered in his house, with two tiny pinpoint wounds on his neck. The attending doctor, Dr. Doskil (Donald Meek), and Sir Karell's friend Baron Otto von Zinden (Jean Hersholt) are convinced that he was killed by a vampire. They suspect Count Mora (Bela Lugosi) and his daughter Luna (Carroll Borland), while the Prague Police Inspector Neumann (Lionel Atwill) refuses to believe them.", "*Holmes Herbert as Sir Karell Borotyn"]}, {"page": "List of fictional doctors", "response": ["|Dr. Jekyll and Mr. Hyde || Dr. Henry JekyllDr. Hastie Lygate || Fredric MarchHolmes Herbert"]}, {"page": "The Private Lives of Elizabeth and Essex", "response": ["* Holmes Herbert as Majordomo (uncredited)"]}, {"page": "Pola Negri", "response": ["| Co-stars: Charles Emmett Mack, Holmes Herbert, Chester Conklin  "]}, {"page": "Juarez (film)", "response": ["* Holmes Herbert as Marshal Randon (uncredited) "]}, {"page": "Whitestone, Queens", "response": ["* Holmes Herbert (1882–1956), actor"]}, {"page": "Kidnapped (1938 film)", "response": ["* Holmes Herbert as Judge "]}, {"page": "Lloyd's of London (film)", "response": ["* Holmes Herbert as Spokesman"]}, {"page": "The Pearl of Death", "response": ["* Holmes Herbert as James Goodram"]}, {"page": "Daughter of the Dragon", "response": ["*Holmes Herbert as Sir John Petrie"]}, {"page": "The Little Princess (1939 film)", "response": ["* Holmes Herbert as a Doctor"]}, {"page": "The Mummy's Curse", "response": ["Ananka is soon found lying unconscious beside the road by Halsey and Betty Walsh (Kay Harding), the niece of Pat Walsh. While in their care, and although apparently suffering from amnesia, the girl displays an incredible knowledge of ancient Egypt. Her stay at Halsey's camp is again interrupted by the appearance of Kharis, and the kindly physician, Dr. Cooper (Holmes Herbert), is killed. She again takes flight, and Halsey and the others go in search of her.", "*Holmes Herbert as Dr. Cooper"]}, {"page": "Dressed to Kill (1946 film)", "response": ["* Holmes Herbert as Ebenezer Crabtree"]}, {"page": "Untamed (1929 film)", "response": ["Untamed is a 1929 American pre-Code Metro-Goldwyn-Mayer drama/comedy/romance film directed by Jack Conway and starring Joan Crawford, Robert Montgomery, Ernest Torrence, Holmes Herbert, Gwen Lee, and Lloyd Ingraham.Untamed at silentera.com The script was adapted by Sylvia Thalberg and Frank Butler, with dialogue by Willard Mack, from a story by Charles E. Scoggins.", "An oil prospector, Henry \"Hank\" Dowling (Lloyd Ingraham), has raised his free-spirited daughter, Alice \"Bingo\" Dowling (Joan Crawford), in the jungle of South America. He asks his friend, Ben Murchison (Ernest Torrence), to come work with him on oil wells that have made him rich. Just as Ben arrives with his friend, Howard Presley (Holmes Herbert), Hank is killed by a transient oil worker who has designs on Bingo."]}, {"page": "The Count of Monte Cristo (1934 film)", "response": ["*Holmes Herbert as Judge "]}, {"page": "Stanley and Livingstone", "response": ["*Holmes Herbert as Sir Frederick Holcomb"]}, {"page": "The Verdict (1946 film)", "response": ["* Holmes Herbert as Sir William Dawson"]}, {"page": "The Adventures of Sherlock Holmes (film)", "response": ["* Holmes Herbert as Justice of the Court"]}, {"page": "Elinor Kershaw", "response": ["She married actor Holmes Herbert in 1930; they later divorced."]}, {"page": "The House of Fear (1945 film)", "response": ["* Holmes Herbert as Alan Cosgrave"]}, {"page": "Confidential Agent", "response": ["In the midst of the Spanish Civil War, Luis Denard (Charles Boyer), a former concert pianist and composer, travels to England as a confidential agent of the  Republican government. His mission is to buy coal or to deny it to the Fascist rebels. On the ship, he meets bored rich girl Rose Cullen (Lauren Bacall), whose father, Lord Benditch (Holmes Herbert), heads the firm with which Denard will negotiate.", "* Holmes Herbert as Lord Benditch"]}, {"page": "15 Maiden Lane", "response": ["* Holmes Herbert as Harold Anderson"]}, {"page": "The Buccaneer (1938 film)", "response": ["* Holmes Herbert as Captain McWilliams"]}, {"page": "Man Hunt (1941 film)", "response": ["* Holmes Herbert as Saul Farnsworthy"]}, {"page": "Sherlock Holmes and the Secret Weapon", "response": ["Tobel successfully demonstrates the bombsight for Sir Reginald Bailey (Holmes Herbert) and observers from Bomber Command. Tobel, now under the protection of Inspector Lestrade (Dennis Hoey) and Scotland Yard, tells Sir Reginald that, although willing to provide the British with his bombsight, only he will know its secret and has a complex plan for its manufacture to keep the secret safe. He separates his invention into four parts and gives one to each of four Swiss scientists, known only to him, to construct separately and whose names are unknown to each other. Soon after, Holmes receives a call from Lestrade telling him that Tobel has disappeared. Holmes goes to Charlotte's flat, where he receives Tobel's envelope. Rather than the coded message, the message inside is from Holmes' nemesis, master criminal Professor Moriarty (Lionel Atwill), who is now working for the Germans.", "* Holmes Herbert as Sir Reginald Bailey"]}, {"page": "Sherlock Holmes in Washington", "response": ["* Holmes Herbert as Mr. Ahrens "]}, {"page": "List of American films of 1932", "response": ["|Shop Angel || E. Mason Hopper || Marion Shilling, Holmes Herbert || Drama || Independent", "| Sister to Judas || E. Mason Hopper || Claire Windsor, Holmes Herbert || Drama || Independent"]}, {"page": "List of American films of 1934", "response": ["| The Curtain Falls || Charles Lamont || Dorothy Lee, Holmes Herbert || Mystery || Chesterfield"]}]}}