{"wiki_id": "http://www.wikidata.org/entity/Q1345546", "itemLabel": "Timothie Bright", "itemDescription": "British doctor", "wikipedia_url": "https://en.wikipedia.org/wiki/Timothie_Bright", "wikipedia_page": {"main": "Timothie Bright, M.D. (1551?–1615) was an Early Modern English physician and clergyman, the inventor of modern shorthand.", "link_mentions": [{"page": "Robert Burton", "response": ["The book was printed in 1621 and, despite Burton's indication in the Anatomy of troubles finding a publisher, it quickly sold well. Wood wrote that the publisher, Henry Cripps, made such a \"great profit\" off the book that he \"got an estate by it\". Burton's subject was well chosen; similar treatises by Timothie Bright and Thomas Wright had gone through several editions soon after their publication. Though Burton never divulged the extent of his profits, the size of his estate and library at death suggests they were considerable. Burton printed the Anatomy under the pseudonym of \"Democritus Junior\", alluding to the Greek pre-Socratic philosopher, Democritus, sometimes known as the Laughing Philosopher. The use of an established classical figure in a pseudonym was common practice in Burton's time, used to ensure the reader held no negative preconceptions about the author. Burton did not resolutely stick to this pseudonymity; the first edition betrayed it as he signed the \"Conclusion to the Reader\" with his real name, and though this was removed in later editions, the portrait of Burton added from the third edition onwards hardly preserved his anonymity."]}, {"page": "Geoffrey Keynes", "response": ["* Dr. Timothie Bright 1550—1615. A Survey of his Life with a Bibliography of his Writings (1962)"]}, {"page": "Rudolph Goclenius", "response": ["Goclenius’ major contributions also included publications which led to the term psychology. In two academic disputations presided by Goclenius at Marburg University in 1586 the word \"psychology\" appears as an adjective (\"psychologicae\").Disputatio Philosophica, resp. Tolmerobulus Thalassidius, Marburg 1586; Theses Philosophicae, resp. Iohannes Grimmaeus jun., Marburg 1586 His anthology Psychologia: hoc est, de hominis perfectione, animo, et in primis ortu hujus published in 1590 is the first book to contain the word \"psychology\" in the title.Hatfield, G. (2019). Rationalist roots of modern psychology. In Robins, S., Symons, J. & Calvo, P. (eds.) The Routledge Companion to Philosophy of Psychology. London, p. 4 The Psychologia of 1590 (a second printing was issued in 1594) contains mostly excerpts from treatises written between 1579 and 1589.Specifically, François Du Jon, Protoktisia (1589, pp. 73-95); Johann Jakob Grynaeus, Synopsis historiae hominis (1579, pp. 125-142); Johann Jacob Coler, Quaestio theologica et philosophica (1586, pp. 5-30); Aegidius Hunnius, Praelectiones in viginti et unum priora capita Geneseos (1589, pp. 30-31); Laskói Csókás Péter, De homine (1585, pp. 176-253); Rudolf Hospinian, Oratio in genere didascalico (1586, complete; added to Coler's Quaestio theologica et philosophica, pp. 30ff.); Timothie Bright, In Physicam Gulielmi Adolphi Scribonii (1584, pp. 15-32). See, Schüling (1967, p. 88), Stiening (1999, p. 323), Mengal (2005, p. 165, fn. 109), Vidal (2011, p. 52, fn. 78). Johann Ludwig Havenreuter's text is almost identical with a portion of his commentary to the third book of Aristotle's de anima published later at Frankfurt (1605, pp. 333-339). On the textual background of Caspar Peucer's De essentia, natura et ortu animi hominis, see Roebel (2012, p. 258). The book's full title translates to English as, \"Psychology: that is, on the perfection of man, his mind, and especially its origin, the comments and discussions of certain theologians & philosophers of our time who are shown on the turned page.\" Here, the term psychology refers to both a subject of inquiry (\"the perfection of man, his mind, and especially its origin\") and the inquiry itself (\"the comments and discussions of certain theologians & philosophers of our time\"). In the 17th century, Goclenius' Psychologia was read and quoted by scholars like Robert Burton,The anatomy of melancholy (1621). Part. 1, Sect. 1, Subsec. 9: \"Of the Rationall Soule\", p. 39 Daniel SennertDe origine et natura animarum in brutis (1638, pp. 117, 189f.) and Jakob Thomasius.Disputatio physica de origine animae humanae (1669, pp. 3, 43, 51). Multiple references are also found in a doxographical work by Thomasius' pupil Johann Vake, \"Vom Ursprung Menschlicher Seelen unter Vielen Meynungen die Beste\" [The best among many opinions on the origin of human souls] (1692, pp. 94, 98, 102, 105, 106, 111-112). Goclenius himself returned to his Psychologia in a textbook on natural science of 1604Physicae completae speculum, p. 69 and in some philosophical disputations.Progymnasma Philosophicum. De Hominis Anima, resp. Henricus Kräudter, Marburg 1604, Thesis Prima; Disputatio philosophica continens duas definitionum disquisitiones, resp. Valentinus Rimer, Marburg 1606, p. 8"]}, {"page": "Peter Osborne (Keeper of the Privy Purse)", "response": ["In 1568 John Bernard's Oratio pia, religiosa, et solatii plena, de vera animi tranquillitate was published with a dedication by Thomas Bernard to Peter Osborne;A. à Wood, Athenae Oxonienses, and Fasti Oxonienses I (Thomas Bennett, London 1691), p. 725. (Google)J. Bernard, Oratio pia, religiosa, et solatii plena, de vera animi tranquillitate (London: William Seres, London 1568). Abraham Fleming's first English verse translation of Virgil's Bucolics, published 1575, was also dedicated to him.The Bukolikes of P. Virgilius Maro, with alphabeticall Annotations, &c. Drawne into plaine and familiar Englishe verse by Abr. Fleming student (John Charlewood, &c., London 1575). See T. Wharton, The History of English Poetry, from the Close of the Eleventh to the Commencement of the Eighteenth Century (J. Dodsley, etc., London 1781). The physician of St Bartholomew-the-Less, Timothie Bright, published his Treatise of Melancholy (the forerunner of Robert Burton's more famous work)Timothie Bright, A Treatise of Melancholy: Containing the Causes thereof, and reasons of the straunge effects it worketh in our minds and bodies (John Windet, London 1586). with a dedication to Osborne in 1586.G. Keynes, Dr. Timothie Bright, 1550-1615:a Survey of his Life, with a Bibliography of his Writings, (Wellcome Historical Medical Library, London 1962), p. 8. He wrote, \"This my slender endeuour I dedicate to your name right worshipfull M. Osbourne, to whom besides I am particularly beholdinge, your good fauouringe of vertue and learning in certaine of my acquaintance of the best marke hath moued me to geue this signification howe readie learning is to honor her fauorers: she hath many daughters, and they be all knit in loue.\" (sic)W.J. Carlton, Timothe Bright, Doctor of Phisicke: A Memoir of \"The Father of Modern Shorthand\" (Elliot Stock, London 1911), p. 45 (Internet archive) The copy of Bright's Characterie (his system of shorthand published in 1588Characterie. An Arte of Shorte, Swifte and Secrete Writing by Character. Inuented by Timothe Bright, Doctor of Phisike. Imprinted at London by I. Windet, the Assigne of Tim. Bright. 1588. Cum Privilegio Regiae Majestatis.) now in the Bodleian Library was Osborne's, and has his autograph on the title page.Carlton, Timothe Bright, p. 86 (Internet archive)."]}, {"page": "William Segar", "response": ["William Segar had a brother Francis Segar, and a sister Jane Segar, who were also artists. Jane Segar, who sometimes spelled her surname \"Seagar\", made a manuscript of poems in 1589, giving it the title, The Prophecies of the Ten Sibills upon the Birth of Christ. She made covers for her manuscript from glass decorated with the verre églomisé technique. The work was apparently intended as a gift to Elizabeth I to gain her royal patronage and further commissions. She acknowledged her debt to Timothie Bright, a contemporary writing master and inventor of a form of shorthand with an anagram. Apart from this manuscript, comparable with the works of Esther Inglis, little is known of her career. William Segar wrote that she married a Lionel Plumtree, perhaps a man connected with the Muscovy trade, and that she was in Russia in 1603.Susan Frye, Pins and Needles: Women's Textualities in Early Modern England (Philadelphia, 2010), pp. 76, 87-102."]}, {"page": "Timothy Bright", "response": ["#REDIRECT Timothie Bright"]}, {"page": "Edmund Deane", "response": ["Deane published: Spadacrene Anglica, or the English Spa Fountain (1626). This work on the spring waters at Harrogate was connected with Deane's relatively short acquaintance with Timothie Bright (Bright died in 1615, Deane moved back to York in 1614). The local spring waters were sulphurous, and were recommended by a number of medical men: Bright, Deane, then Michael Stanhope, and John French."]}]}}