{"wiki_id": "http://www.wikidata.org/entity/Q1352190", "itemLabel": "Harold MacMichael", "itemDescription": "British colonial administrator", "wikipedia_url": "https://en.wikipedia.org/wiki/Harold_MacMichael", "wikipedia_page": {"main": "Sir Harold Alfred MacMichael  (15 October 1882 – 19 September 1969) was a British colonial administrator.", "link_mentions": [{"page": "Irgun", "response": ["In late 1943 a joint Haganah – Irgun initiative was developed, to form a single fighting body, unaligned with any political party, by the name of עם לוחם (Fighting Nation). The new body's first plan was to kidnap the British High Commissioner of Palestine, Sir Harold MacMichael and take him to Cyprus. However, the Haganah leaked the planned operation and it was thwarted before it got off the ground. Nevertheless, at this stage the Irgun ceased its cooperation with the British. As Eliyahu Lankin tells in his book:"]}, {"page": "Malayan Union", "response": ["The idea of the Union was first expressed by the British in October 1945 (plans had been presented to the War Cabinet as early as May 1944)CAB 66/50 'Policy in Regard to Malaya and Borneo' in the aftermath of the Second World War by the British Military Administration. Sir Harold MacMichael was assigned the task of gathering the Malay state rulers' approval for the Malayan Union in the same month. In a short period of time, he managed to obtain all the Malay rulers’ approval. The reasons for their agreement, despite the loss of political power that it entailed for the Malay rulers, has been much debated; the consensus appears to be that the main reasons were that as the Malay rulers were of course resident during the Japanese occupation, they were open to the accusation of collaboration, and that they were threatened with dethronement.Ariffin Omar, Bangsa Melayu: Malay Concepts of Democracy and Community, 1945–1950 (Kuala Lumpur: Oxford University Press, 1993), p. 46. Cited in Ken'ichi Goto, Tensions of Empire: Japan and Southeast Asia in the Colonial and Postcolonial World (Athens: Ohio University Press, 2003), p. 222 Hence the approval was given, though it was with utmost reluctance.", "The Malays generally opposed the creation of the Union. The opposition was due to the methods Sir Harold MacMichael used to acquire the Sultans' approval, the reduction of the Sultans' powers, and easy granting of citizenship to immigrants. The United Malays National Organisation or UMNO, a Malay political association formed by Dato' Onn bin Ja'afar on 1 March 1946, led the opposition against the Malayan Union. Malays also wore white bands around their heads, signifying their mourning for the loss of the Sultans' political rights."]}, {"page": "Tunku Abdul Rahman", "response": ["Sir Harold MacMichael, representing the British Government, arrived in Kuala Lumpur on 11 October 1945. He came to Alor Setar after visiting the Sultans of Johor, Selangor, Pahang, and Perak and securing their signatures to a new treaty. In Kedah, MacMichael was told that the Ruler would consult his Council of State before discussing with him. With these consultations proceeded, rallies and processions in opposition to the treaty were held in every district and the center of Alor Setar. Tunku was one of the most popular speakers in Alor Setar, Sungai Petani, and Kulim, but he was not invited to take part in any of the discussions convened by his half-brother, Sultan Badlishah. After three days of negotiations, the Sultan followed the example of his brother rulers. The Sultan's surrender was vigorously criticised by the public and by Tunku. MacMichael flew back to London after securing all the signatures from the rulers for the new treaty. Then the British Prime Minister announced that the Malayan Union would come into effect on 1 April 1946."]}, {"page": "Ibrahim of Johor", "response": ["Willan made further interviews with other Malay rulers over the next few days, and made assessments of the political situation in each state. His studies were forwarded to the military administration, and Sir Harold MacMichael, the former high commissioner of Palestine was empowered to sign official treaties with the Malay rulers over the Malayan Union proposal scheme. MacMichael made several visits to the Malay rulers, beginning with Sultan Ibrahim in October 1945. The Sultan quickly consented to MacMichael's proposal scheme, which was motivated by his strong desire to visit England at the end of the year. MacMichael paid further visits to other Malay rulers over the proposal, and sought their consent over the proposal scheme. Many Malay rulers expressed strong reluctance in signing the treaties with MacMichael, partly because they feared losing their royal status and the prospect of their states falling into Thai political influence.Bayly, Harper, Forgotten wars: Freedom and Revolution in Southeast Asia, pg 133-4"]}, {"page": "Ismail of Johor", "response": ["Tunku Ismail returned to Johor after the war and was confronted with Malay nationalist movements which had erupted as a result of the rulers' dissatisfaction with the Malayan Union scheme. While Sultan Ibrahim faced widespread criticisms from the Malay grassroots and nationalist leaders due to his initial willingness to sign the Malayan Union scheme treaties with Sir Harold MacMichael, Tunku Ismail maintained a neutral relations between the British government and the Malay nationalist leaders.Kratoska (2001), pg 127 Nevertheless, Tunku Ismail officiated the opening ceremony of the United Malays National Organisation's (UMNO) first congress which was held at Istana Besar in May 1946 while Sultan Ibrahim was residing in London.Istana Besar, birthplace of Umno , 22 March 2009, Fauziah Ismail, New Straits Times"]}, {"page": "Hawazma tribe", "response": ["According to British colonial administrator Harold MacMichael, in the mid-eighteenth century in the days of the Funj, heads of families from six tribes, finding themselves unable to stand alone, came to the Hawazma and asked for protection and agreed to join the Hawazma. The leaders of these groups swore an oath binding themselves to the Hawazma, and they were referred to henceforth as the Halafa. The six tribes that formed the Halafa subgroup of the Hawazma: the Bedaria, Takarir, Jellaba Howara, Gawama’a, Zenara and Nuba. "]}, {"page": "Onn Jaafar", "response": ["The Malayan Union proposal provided that United Kingdom had full administrative powers over the Malay states except in areas pertaining spiritual and moral authority of the Malay rulers, which the Malays held high esteem over it. Communal tensions between the Malays and Chinese were high, and the prospect of granting citizenship to non-Malays was deemed unacceptable to the Malays.Bayly, Harper, Forgotten wars: Freedom and Revolution in Southeast Asia, pg 133-4 In particular, politicians in Johor were extremely unhappy with the willingness of Sultan Ibrahim to sign the treaties with Harold MacMichael, and voiced out that the Sultan had violated the terms in the Johor state constitution which explicitly forbade any foreign powers to assume legitimate control over the state."]}, {"page": "Eliyahu Hakim", "response": ["As a member of Lehi, he participated in an assassination attempt against Harold MacMichael, the British High Commissioner for Palestine, in 1944. His team ambushed MacMichael's car, slightly wounding him and his driver and severely wounding his adjutant, but failing to kill anyone."]}, {"page": "Patria disaster", "response": ["The British High Commissioner for Palestine, Sir Harold MacMichael, issued a deportation order on 20 November, ordering that the refugees be taken to the British Indian Ocean territory of Mauritius and the Caribbean territory of Trinidad."]}, {"page": "Toby Low, 1st Baron Aldington", "response": ["Aldington married (Felicité Ann) Araminta MacMichael (died 2012), a daughter of Sir Harold MacMichael, on 10 April 1947. They had a son, Charles Low, 2nd Baron Aldington, and two daughters, (Priscilla) Jane Stephanie, Lady Roberts (Curator of the Print Room at Windsor Castle and Royal Librarian; married Sir Hugh Roberts), and Hon. Lucy Ann Anthea (married Alasdair Laing)."]}, {"page": "Gawamaa", "response": ["Gawamaa or Gawám'a is a Sudanese ethnic group. They are a large sedentary tribe in North Kordofan, and sections of them also helped form the Halafa sub-group of the Hawazma tribe, itself a sub-group of the larger Baggara group. According to British colonial administrator Harold MacMichael, the Gawamaa were one of six non-Hawazma tribes integrated into the Hawazma tribe in the mid-eighteenth century by way of an oath."]}, {"page": "Index of Tanzania-related articles", "response": ["* Harold MacMichael"]}, {"page": "List of ambassadors of the United Kingdom to Israel", "response": ["*1938–1944: Sir Harold MacMichael"]}, {"page": "British Military Administration (Malaya)", "response": ["The proposal was announced on 10 October 1945 by George Hall, Secretary of State for the Colonies. Sir Harold MacMichael was empowered to sign revised treaties with the Malay Sultan's to enable the Union to proceed. MacMichael made several visits to the Malay rulers, beginning with Sultan Ibrahim of Johor in October 1945. The Sultan quickly consented to MacMichael's proposal scheme, which was motivated by his strong desire to visit England at the end of the year. MacMichael paid further visits to other Malay rulers over the proposal, and sought their consent over the proposal scheme. Many Malay rulers expressed strong reluctance in signing the treaties with MacMichael, partly because they feared losing their royal status and the prospect of their states falling into Thai political influence.Bayly, Harper, Forgotten wars: Freedom and Revolution in Southeast Asia, pg 133-4"]}, {"page": "Allied leaders of World War II", "response": ["* Harold MacMichael was a British colonial administrator who was appointed as the High Commissioner of the British Mandate of Palestine from 1937 until 1944 year. During this era he attempted to suppress Zionist and Arab nationalists but had to change this policy during the war."]}, {"page": "Jewish insurgency in Mandatory Palestine", "response": ["On August 8, 1944, Lehi ambushed the car of British High Commissioner Harold MacMichael in an attempt to assassinate him. Although two others in the car were wounded, MacMichael escaped serious injury. The authorities subsequently imposed a collective fine of £500 on the nearby Jewish settlement of Givat Shaul over the assassination attempt. On August 23, the Irgun mounted arms raids on the CID barracks at Jaffa, Abu Kabir, and Neve Sha'anan, seizing fourteen rifles. The British Army mounted its first cordon and search operation in Palestine on September 5 in Petah Tikva, which was known as an insurgent hotbed. The British arrested 46 people in the operation but failed to find Menachem Begin, who was hiding in Petah Tikva under an assumed name, after failing to search the area where he was hiding. Begin subsequently moved to Tel Aviv."]}, {"page": "Index of World War II articles (H)", "response": ["# Harold MacMichael"]}, {"page": "Nairobi Railway Museum", "response": ["| Sir Harold MacMichael"]}, {"page": "Harold Alfred MacMichael", "response": ["#REDIRECT Harold MacMichael"]}, {"page": "Hermione, Countess of Ranfurly", "response": ["In April 1941, Dan Ranfurly was reported missing after the Battle of Tobruk, and Hermione had no knowledge about whether he was living or dead until she received a letter from him five months later. He remained a prisoner of war in Italy for three years, escaping in 1944 following the Italian armistice. In the interim, Lady Ranfurly received special permission to remain in the Middle East from General Wavell, and worked first as a personal assistant to Sir Harold MacMichael, the High Commissioner in Palestine, and later to General Henry Maitland Wilson, the Supreme Allied commander in the Mediterranean. She was renowned for the tenacity of her desire not to return to England, and General Wilson described Hermione as having \"outmanoeuvred every general in the Middle East\" to achieve her goal.Ranfurly (1994), p. 103"]}, {"page": "Yaakov Banai", "response": ["Banai participated in a long list of combat missions including the preparations and attack on the British high commissioner in Palestine, Sir Harold MacMichael. This attack was claimed to be retaliation for the Struma disaster. He also took part in the assassination of Thomas Wilkin, the head of the Criminal Investigation Department (CID) Jewish Affairs Bureau.http://fr.jpost.com/servlet/Satellite?pagename=JPost/JPArticle/ShowFull&cid=1189411495987 Wilkin was assassinated for his involvement in the killing of Abraham Stern.  In his memoirs, Banai recalled that the order to assassinate Wilkin came directly from Yitzhak Shamir, the head of Lehi who eventually became the Prime Minister of Israel."]}, {"page": "MacMichael", "response": ["* Harold MacMichael (1882–1969), British colonial administrator"]}, {"page": "Yehoshua Cohen", "response": ["After the attack, Cohen was also involved in planning an attack on Harold MacMichael that failed. Shortly thereafter, Cohen was apprehended by the British and sent to a detention centre in Africa.  On July 6, 1948, the British released Cohen, along with a large number of other detainees in response to Israel's independence."]}, {"page": "Rambam Health Care Campus", "response": ["Rambam Hospital was established in 1938 during the British Mandate. It was inaugurated by the High Commissioner of Palestine Sir Harold MacMichael as a 225-bed facility. It was originally known as the British Government Hospital of Haifa. The Bauhaus architect Erich Mendelsohn was commissioned to design the building on a half-moon shaped headland  at the foot of Mount Carmel, northwest of Haifa Port.  After the establishment of the State of Israel in 1948, the hospital was renamed Rambam in 1952, the acronym for Rabbi Mosheh Ben Maimon (Maimonides)."]}, {"page": "Mordechai Schwarcz", "response": ["Schwarcz was one of the policemen stationed at the High Commissioner's summer camp in Atlit to guard against bandits. On the night of September 1, 1937, he shot dead Mustafa Khoury, an Arab policeman with whom he shared a tent. He was arrested a week after Khoury was found dead. At his trial, he claimed that he had heard gunfire and rushed outside the tent, only to find Khoury dead upon returning. The court rejected his testimony. One of Schwarcz's friends testified that Khoury had entered drunk, boasting about having raped and murdered Jews, and telling Schwarcz his time would come. Schwarcz was convicted of murder and sentenced to death by a Haifa court. The Palestine Supreme Court approved the sentence, the Privy Council in London refused to look at the case, and the High Commissioner confirmed the sentence.Hanged After Plea to London Fails Appeals for clemency came from American and international Jewish organizations, a petition with 70,000 signatures, and Moshe Sharett, the director of the Jewish Agency's Political Department, wrote a letter to High Commissioner Harold MacMichael requesting a pardon, but to no avail."]}, {"page": "High Commissioners for Palestine and Transjordan", "response": ["| 70px || Sir Harold MacMichael || 3 March 1938 || 30 August 1944"]}, {"page": "1944 in Mandatory Palestine", "response": ["* High Commissioner – Sir Harold MacMichael until 30 August; John Vereker, 6th Viscount Gort", "* 8 August – Lehi members attempt to assassinate the High Commissioner, Sir Harold MacMichael."]}, {"page": "1943 in Mandatory Palestine", "response": ["* High Commissioner – Sir Harold MacMichael"]}, {"page": "1942 in Mandatory Palestine", "response": ["* High Commissioner – Sir Harold MacMichael"]}, {"page": "1941 in Mandatory Palestine", "response": ["* High Commissioner – Sir Harold MacMichael"]}, {"page": "1940 in Mandatory Palestine", "response": ["* High Commissioner – Sir Harold MacMichael"]}, {"page": "1939 in Mandatory Palestine", "response": ["* High Commissioner – Sir Harold MacMichael"]}]}}