{"wiki_id": "http://www.wikidata.org/entity/Q13529945", "itemLabel": "Thomas Horsfall", "itemDescription": "British politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Thomas_Horsfall_(politician)", "wikipedia_page": {"main": "Thomas Berry Horsfall (20 August 1805 – 22 December 1878) was a Conservative Party politician in England. He was a Member of Parliament (MP) for over 15 years, and was Lord Mayor of Liverpool from 1847 to 1848.Horsfall was born in Liverpool to Dorothy Hall Berry (1784–1846) and Charles Horsfall (1776–1846), a former Mayor of Liverpool. He married three times, firstly Jane Anne Marsh in 1834, then Mary Cox in 1847 and latterly Sophia Leeke, daughter of William Leeke, the Waterloo historian in 1863..\nHe became a magistrate for Lancashire, and also Mayor of Liverpool in 1847 and 1848. In 1848 he was the Head of the Liverpool Architectural and Archaeological Society. He was also elected President of the Liverpool Chamber of Commerce on its foundation in 1849.\nHe was elected in 1852 as the MP for Derby, but the election was declared void in March 1853. In 1853 he was elected as Member of Parliament for Liverpool, and held the seat until 1868. A Conservative, he was opposed to the re-imposition of a duty on foreign corn, and generally all duties on \"the necessaries of life\". He opposed the Maynooth Grant and taxes upon income, but not on property. He was in favour of remodelling the Boards of Custom and Excise, extensive Chancery reform and a moderate Parliamentary reform.\nIn later years Horsfall owned and resided at Bellamour Hall, Colton, Staffordshire. During his lifetime Horsfall made considerable additions to the estate and improved its general appearance. In the village he was esteemed for the interest he took in its inhabitants. The village schools were erected at his expense and were endowed by him. The cemetery adjoining, known as the Closed Burial Ground, was presented by him to the village as a free gift and he also took a very active part in the erection of the District Hospital in Rugeley. Horsfall also built the Reading Room in the village. Bellamour hall was demolished in the 1920s.\nHe died on 22 December 1878 in Newton Abbot, Devon, of \"a softening of the brain, paralysis arthesis\" and was buried in St. Mary's Church, Colton, Staffordshire.\n\n", "link_mentions": {}}}