{"wiki_id": "http://www.wikidata.org/entity/Q13530058", "itemLabel": "John Tilney", "itemDescription": "British businessman and Conservative politician", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Tilney", "wikipedia_page": {"main": "Sir John Dudley Robert Tarleton Tilney,  (19 December 1907 – 26 April 1994) was a  British Conservative politician. He was Member of Parliament (MP) for Liverpool Wavertree from 1950 until his retirement at the February 1974 general election. He was Under-Secretary of State for Commonwealth Relations from 1962 to 1964.He was the great grandson of the founder of RJ Tilney & Co. John Tilney was educated at Eton College. He was persuaded by John Brocklebank, the co-head of RJ Tilney & Co to begin with the firm in October 1928 before he had finished his degree course at Magdalen College, Oxford. He became a member of the Stock Exchange in December 1932 and was admitted to the partnership in April 1933.", "link_mentions": [{"page": "List of MPs elected in the 1950 United Kingdom general election", "response": ["|John Tilney"]}, {"page": "List of MPs elected in the 1951 United Kingdom general election", "response": ["|John Tilney"]}, {"page": "Liverpool Wavertree (UK Parliament constituency)", "response": ["| 1950 || John Tilney "]}, {"page": "List of MPs elected in the 1970 United Kingdom general election", "response": ["| John Tilney"]}, {"page": "List of MPs elected in the 1955 United Kingdom general election", "response": ["| John Tilney"]}, {"page": "List of MPs elected in the 1959 United Kingdom general election", "response": ["| Sir John Tilney"]}, {"page": "List of MPs elected in the 1964 United Kingdom general election", "response": ["| John Tilney"]}, {"page": "List of MPs elected in the 1966 United Kingdom general election", "response": ["| John Tilney"]}, {"page": "Conservative government, 1957–1964", "response": ["|John Tilney||16 July 1962 – 16 October 1964|| "]}, {"page": "Under-Secretary of State for Commonwealth Relations", "response": ["*1962: John Tilney (to 1964)"]}, {"page": "Dame Guinevere Tilney", "response": ["#REDIRECT John Tilney"]}, {"page": "Guinevere Tilney", "response": ["#REDIRECT John Tilney"]}, {"page": "Guinevere Hunter", "response": ["#REDIRECT John Tilney"]}, {"page": "List of University of Oxford people in British public life", "response": ["| John Tilney"]}, {"page": "List of Conservative Party MPs (UK)", "response": ["*John Tilney"]}, {"page": "Statue of Winston Churchill, Parliament Square", "response": ["In the 1950s, David Eccles, then Minister of Works, showed Churchill plans for the redevelopment of Parliament Square. Churchill drew a circle in the north-east corner and declared: \"That is where my statue will go.\" The statue that was eventually installed was first suggested by John Tilney, Member of Parliament for Liverpool Wavertree, in a parliamentary question in 1968. Initial estimates by the sponsors of the Winston Churchill Statue Appeal put the cost of the statue at £30,000. The sponsors of the appeal included Edward Heath, Lord Mountbatten, Lord Portal, and Baroness Elliot. The sum of £32,000 was raised by 4,500 individuals who are listed in a book which was deposited in the library at Chartwell on Churchill's birthday, 30 November 1973. The statue was cast by the Meridian Foundry of Peckham Rye, London."]}, {"page": "Tilney", "response": ["*John Tilney (190794), British businessman and politician"]}, {"page": "Tilney, John", "response": ["#redirectJohn Tilney"]}, {"page": "List of United Kingdom MPs who died in the 1990s", "response": ["|Sir John Tilney"]}]}}