{"wiki_id": "http://www.wikidata.org/entity/Q1356254", "itemLabel": "Ernest Belfort Bax", "itemDescription": "British barrister and journalist", "wikipedia_url": "https://en.wikipedia.org/wiki/Ernest_Belfort_Bax", "wikipedia_page": {"main": "Ernest Belfort Bax (; 23 July 1854 – 26 November 1926) was an English barrister, journalist, philosopher, men's rights advocate, socialist, and historian.", "link_mentions": [{"page": "William Morris", "response": ["In 1884 the DF renamed itself the Social Democratic Federation (SDF) and underwent an internal reorganisation. However, the group was facing an internal schism between those (such as Hyndman), who argued for a parliamentary path toward socialism, and those (like Morris) who deemed the Houses of Parliament intrinsically corrupt and capitalist. Personal issues between Morris and Hyndman were exacerbated by their attitude to British foreign policy; Morris was staunchly anti-imperialist while Hyndman expressed patriotic sentiment encouraging some foreign intervention. The division between the two groups developed into open conflict, with the majority of activists sharing Morris's position. In December 1884 Morris and his supporters – most notably Ernest Belfort Bax and Edward Aveling – left the SDF; the first major schism of the British socialist movement."]}, {"page": "François-Noël Babeuf", "response": ["* Ernest Belfort Bax, Last Episodes of the French Revolution, Haskell House Pub Ltd (1911; reprinted 1971), "]}, {"page": "History of Freemasonry", "response": ["According to Ernest Belfort Bax, Freemasons were responsible for the last serious attempt at conciliation between Versailles and the Paris Commune on 21 April 1871. They were received coldly by Adolphe Thiers, who assured them that, though Paris was given over to destruction and slaughter, the law should be enforced, and he kept his word. A few days after they decided, in a public meeting, to plant their banner on the ramparts and throw in their lot with the Commune. On the 29th, accordingly, 10,000 of the brethren met (55 lodges being represented), and marched to the Hôtel de Ville, headed by the Grand Masters in full insignia and the banners of the lodges. Amongst them the new banner of Vincennes was conspicuous, bearing the inscription in red letters on a white ground, \"Love one another.\" A balloon was then sent up, which let fall at intervals, outside Paris, a manifesto of the Freemasons. The procession then wended its way through the boulevards and the Champs Elysées to the Arc de Triomphe, where the banners were planted at various points along the ramparts. On seeing the white flag on the Porte Maillot the Versaillese ceased firing, and the commander, himself a Freemason, received a deputation of brethren, and suggested a final appeal to Versailles, which was agreed to. The \"chief of the executive\" hardly listened to the envoys, and declined to further discuss the question of peace with anyone. This last formal challenge having been made and rejected, the Freemasons definitely took their stand as combatants for the Commune.The Paris Commune – IX. The Freemasons, the Committee of Public Safety, and Rossel, byE. Belfort Bax.  Found at www.marxists.org."]}, {"page": "Eduard Bernstein", "response": ["Bernstein rejected reactionary bourgeois nationalism and called instead for a cosmopolitan-libertarian nationalism. He recognized the historical role of the national factor and said that the proletariat must support their country against external dangers. He called on workers to assimilate themselves within nation-states, which entailed support for colonial policies and imperial projects. Bernstein was sympathetic to the idea of imperial expansions as a positive and civilizing mission, which resulted in a bitter series of polemics with the anti-imperialist Ernest Belfort Bax. Bernstein supported colonialism as he believed it uplifted backward peoples and it worked well for both Britain and Germany. Bernstein supported such policies in an intensely racialised manner, arguing in 1896 that \"races who are hostile to or incapable of civilisation cannot claim our sympathy when they revolt against civilisation\" and that the \"savages [must] be subjugated and made to conform to the rules of higher civilisation\".Mcgeever, Brendan, and Satnam Virdee. \"Antisemitism and Socialist Strategy in Europe, 1880–1917: An Introduction.\" Patterns of Prejudice 51.3-4 (2017): 229 However, he was disturbed by the Kaiser's reckless policies. He wanted strong friendship especially with Britain and France and protection against the Russian threat to Germany. He envisioned a sort of league of nations.Roger Fletcher, \"Revisionism ad Wilhelmine Imperialism\" Journal of Contemporary History (11988) 23#3 pp 347-366.Roger Fletcher, \"An English Advocate in Germany. Eduard Bernstein’s Analysis of Anglo-German Relations 1900-1914.\" Canadian Journal of History 13.2 (1978) pp: 209-236."]}, {"page": "Men's rights movement", "response": ["The term \"men's rights\" was used at least as early as February 1856 when it appeared in Putnam's Magazine. The author was responding to the issue of women's rights, calling it a \"new movement for social reform, and even for political revolution\", which the author proposed to counter with men's rights. Ernest Belfort Bax wrote The Legal Subjection of Men in 1896, deriding the women's rights movement as a farcical effort by women—the \"privileged sex\"—to prove they were \"oppressed.\""]}, {"page": "Ernest Bax", "response": ["#REDIRECT Ernest Belfort Bax"]}, {"page": "Harry Quelch", "response": ["Circumstances forced the eldest child, Harry, into the world to contribute to the family's maintenance from a very young age, with Harry taking his first job at the age of 10. He worked variously in an upholsterer's shop and later for a local dairyman and cattle dealer. At the age of 14 he left Berkshire for good to make his way in the big city of London.Ernest Belfort Bax, \"Introduction\" to Harry Quelch: Literary Remains. E. B. Bax, editor. London: Grant Richards, 1914. Transcribed by Ted Crawford for Marxists Internet Archive.  Retrieved 2 September 2009."]}, {"page": "Eleanor Marx", "response": ["Other leaders of the Socialist League were Ernest Belfort Bax, Sam Mainwaring, and Tom Mann, the latter two being representatives of the working class. Annie Besant was also an active member."]}, {"page": "Grand Orient de France", "response": ["According to the Marxist author Ernest Belfort Bax, Freemasons had a considerable involvement in the Paris Commune after a couple of unsuccessful attempts at reconciling the Commune with the French Government.E. Belfort Bax, The Paris Commune, \"IX. The Freemasons, the Committee of Public Safety, and Rossel\",  (1894) www.marxists.org. Retrieved 26 May 2014."]}, {"page": "National Liberal Club", "response": ["*Ernest Belfort Bax, socialist journalist and philosopherHenry Tudor and J.M. Tudor (eds.), \"The Movement and the Final Goal: Bernstein's Second Exchange With Belfort Bax\", Marxism and Social Democracy: The Revisionist Debate, 1896–1898 (Cambridge University Press, Cambridge, 1988), p. 172."]}, {"page": "The Peasant War in Germany", "response": ["*Ernest Belfort Bax (1899). The Peasants War in Germany, 1525-1526, from Internet Archive. HTML source."]}, {"page": "E. B. Bax", "response": ["#REDIRECT Ernest Belfort Bax"]}, {"page": "Ernest B. Bax", "response": ["#REDIRECT Ernest Belfort Bax"]}, {"page": "E. Belfort Bax", "response": ["#REDIRECT Ernest Belfort Bax"]}, {"page": "Category talk:British journalists", "response": ["Ernest Belfort Baxnot yet classified"]}, {"page": "List of names in A Biographical Dictionary of Modern Rationalists", "response": ["* Ernest Belfort Bax"]}, {"page": "Justice (newspaper)", "response": ["The paper was initially edited by C. L. Fitzgerald, G. D. H. Cole, British Working-Class Politics, 1832-1914, p.92 and later by H. M. Hyndman, Henry Hyde Champion, Ernest Belfort Bax, then Harry Quelch for many years, and finally Henry W. Lee.  It attempted to present scholarly ideas in a serious fashion, featuring work by William Morris, Peter Kropotkin, Edward Aveling and Alfred Russel Wallace."]}, {"page": "Sam Mainwaring", "response": ["In 1885, there came a split in which Mainwaring joined with Eleanor Marx, Ernest Belfort Bax and his friend William Morris in forming the Socialist League."]}, {"page": "Zelda Kahan", "response": ["Born into a Jewish family in Russia in 1886, Kahan's family were forced to emigrate, and she moved to Britain at an early age.Henry Pelling, The British Communist Party: A Historical Profile The Kahans lived at 6 Clapton Square in Hackney, London. She became an active socialist and joined the Social Democratic Federation (SDF).  Within the SDF, she was a leading opponent of Ernest Belfort Bax's anti-feminism, and an ardent anti-militarist.  After a resolution she proposed to the conference of the SDF's successor, the British Socialist Party, was approved against the wishes of the party leadership, she was elected to its executive.  She worked alongside Theodore Rothstein in opposition to World War I, and supported the foundation of the Communist Party of Great Britain (CPGB).Karen Hunt, Equivocal Feminists: The Social Democratic Federation and the Woman Question 1884-1911 "]}, {"page": "Belfort Bax", "response": ["#REDIRECT Ernest Belfort Bax"]}, {"page": "Bax", "response": ["*Ernest Belfort Bax (1854–1926), British socialist"]}, {"page": "International Socialist Bureau", "response": ["| Henry Hyndman; Ernest Belfort Bax"]}, {"page": "Commonweal (newspaper)", "response": ["William Morris, founder of the League, was its chief writer, money finder and \"responsible head\". John Turner, Ernest Belfort Bax and Eleanor Marx also regularly contributed articles.  Its publishing office was at Great Queen Street, London."]}, {"page": "Socialist League (UK, 1885)", "response": ["The anti-Hyndman members of the Executive Council chose to leave the SDF altogether, abandoning Justice to Hyndman and his allies. Those departing included such leading lights of the SDF organisation as William Morris, Eleanor Marx, Ernest Belfort Bax, Sam Mainwaring, and Edward Aveling.", "* Ernest Belfort Bax"]}, {"page": "The Fraud of Feminism", "response": ["#REDIRECT Ernest Belfort Bax"]}, {"page": "Henry Nicholis", "response": ["Most of his writings come from his time at Emden. His primary work was Den Spegel der Gherechticheit dorch den Geist der Liefden unde den vergodeden Menscit I-IN. uth de hernmelisc tie Warheit betuget. It appeared in an English form—with Nicholis's revisions—as An introduction to the holy Understanding of the Glasse of Righteousness (c.1575; reprinted in 1649). The list of Nicholis's works occupies nearly six columns in the Dictionary of National Biography.See also Ernest Belfort Bax, Rise and Fall of the Anabaptists, pp. 327–380 (1903); and John Strype's Works, General Index."]}, {"page": "List of people from Hampstead", "response": ["*Ernest Belfort Bax (British Marxist journalist and philosopher)"]}, {"page": "E B Bax", "response": ["#REDIRECT Ernest Belfort Bax"]}, {"page": "C. L. Fitzgerald", "response": ["Fitzgerald worked with James MacDonald to form the Socialist Union, but it made little impact and dissolved two years later.  He then disappeared from the socialist movement.  Ernest Belfort Bax claimed that he went to the Balkans as a journalist and was murdered by agents of the Ottoman Empire.  However, H. W. Lee claimed that he emigrated to the Western United States in the early 1890s and lived there until his death in about 1930.Norman Kelvin, The Collected Letters of William Morris, Volume II, Part A: 1881-1884, p.253"]}]}}