{"wiki_id": "http://www.wikidata.org/entity/Q1359140", "itemLabel": "William Henry Hudson", "itemDescription": "British ornithologist", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Henry_Hudson", "wikipedia_page": {"main": "William Henry Hudson (Quilmes, 4 August 1841 – Kensington, 18 August 1922) – known in Argentina as Guillermo Enrique Hudson –  was an Anglo-Argentine author, naturalist and ornithologist.", "link_mentions": [{"page": "Hollow Earth", "response": ["In William Henry Hudson's 1887 romance, A Crystal Age, the protagonist falls down a hill into a Utopian paradise; since he falls into this world, it is sometimes classified as a hollow Earth story; although the hero himself thinks he may have traveled forward in time by millennia."]}, {"page": "The Dispossessed", "response": ["In Le Guin's book-writing process, the story always came to her through a character rather than an event, idea, plot, or society. The story behind The Dispossessed first occurred to Le Guin through a vision, revealed as if seen from a distance, first as a male physicist, his thin face, clear eyes, large ears, possibly recalling a memory of Robert Oppenheimer, and a vivid personality. She attempted to capture the character in a short story in what she recalled as one of her worst in 30 years of writing, in which the physicist escapes a gulag planet for a nearby wealthy sister planet, where he has a love affair but likes the planet even less, and so nobly returns to the gulag. She proceeded to rewrite the story, beginning with his name and origin—Shevek, from Utopia—which she considered reasonable based on his intelligence and disarming naivety. Knowing only bits of Thomas More (Utopia), William Morris (News from Nowhere), William Henry Hudson (A Crystal Age), and H. G. Wells (A Modern Utopia), Le Guin's reading of modern libertarian socialists rounded Shevek's prison planet into a place where she saw he would want to return: Marx and Engels, William Godwin, Emma Goldman, Paul Goodman and, foremost, Peter Kropotkin and Mary Shelley."]}, {"page": "Edgar the Peaceful", "response": ["In 963, Edgar allegedly killed Earl Æthelwald, his rival in love, near present-day Longparish, Hampshire. The event was commemorated by the Dead Man's Plack, erected in 1825. In 1875, Edward Augustus Freeman debunked the story as a \"tissue of romance\" in his book, Historic Essays; however, his arguments were rebutted by naturalist William Henry Hudson in his 1920 book Dead Man's Plack and an Old Thorn."]}, {"page": "Sussex", "response": ["Sussex's rich musical heritage encompasses folk, classical and popular genres amongst others.  Composed by William Ward-Higgs, Sussex by the Sea is the county's unofficial anthem.  Passed on through oral tradition, many of Sussex's traditional songs may not have changed significantly for centuries, with their origins perhaps dating as far back as the time of the South Saxons. William Henry Hudson compared the singing of the Sussexians with that of the Basques and the Tehuelche people of Patagonia, both peoples with ancient cultures. The songs sung by the Copper Family, Henry Burstow, Samuel Willett, Peter and Harriett Verrall, David Penfold and others were collected by John Broadwood and his niece Lucy Broadwood, Kate Lee and composers Ralph Vaughan Williams and George Butterworth. Sussex also played a major part in the folk music revival of the 1960s and 1970s with various singers including George 'Pop' Maynard, Scan Tester, Tony Wales and the sisters"]}, {"page": "List of biologists", "response": ["*William Henry Hudson (1841–1922), Argentinian-British ornithologist, advocate of Lamarckian evolution, critic of Darwinism and vitalist "]}, {"page": "Patagonia", "response": ["*Idle Days in Patagonia by William Henry Hudson, Chapman and Hall Ltd, London, 1893"]}, {"page": "Cougar", "response": ["Pumas in the southern cone of America – often called Argentine cougars by North Americans – are reputed to be extremely reluctant to attack man; in legend, they defended people against jaguars. The nineteenth century naturalists Félix de Azara and William Henry Hudson thought that attacks on people, even children or sleeping adults, did not happen. Hudson, citing anecdotal evidence from hunters, claimed that pumas were positively inhibited from attacking people, even in self-defense. In fact, attacks on humans, although exceedingly rare, have occurred."]}, {"page": "Tiki culture", "response": ["There are two primary strains of this kind of exotica: jungle exotica and tiki exotica. Jungle exotica was a Hollywood creation, with its roots in Tarzan movies (and further back to William Henry Hudson's novel Green Mansions). Les Baxter was the king of jungle exotica. Tiki exotica on the other hand was introduced in Martin Denny's Waikiki nightclub jungle noises arrangement in Baxter's Quiet Village song."]}, {"page": "Royal Society for the Protection of Birds", "response": ["* William Henry Hudson – Chairman of Committee 1894"]}, {"page": "Aphra Behn", "response": ["After her death in 1689, Behn's literary work was marginalised and often dismissed outright, notwithstanding the 1700 publication of her Histories, Novels, and Translations which preserved her literary production for future re-discovery.Cox, Michael, ed. (2004). The Concise Oxford Chronology of English Literature. Oxford University Press. . Until the mid-20th century Behn was repeatedly dismissed as a morally depraved minor writer. In the 18th century her literary work was scandalised as lewd by Thomas Brown, William Wycherley, Richard Steele and John Duncombe. Alexander Pope penned the famous lines \"The stage how loosely does Astrea tread, Who fairly puts all characters to bed!\". In the 19th century Mary Hays, Matilda Betham, Alexander Dyce, Jane Williams and Julia Kavanagh decided that Behn's writings were unfit to read, because they were corrupt and deplorable. Among the few critics who believed that Behn was an important writer were Leigh Hunt, William Forsyth and William Henry Hudson."]}, {"page": "Richmond Park", "response": ["A Hind in Richmond Park by William Henry Hudson, published in 1922 and republished in 2006, is an extended natural history essay. It includes an account of his visits to Richmond Park and a particular occasion when a young girl was struck by a red deer when she tried to feed it an acorn."]}, {"page": "Willa Cather", "response": ["As late as 1920, Cather became dissatisfied with the performance of her publisher Houghton Mifflin—My Ántonia received an advertising budget of only $300, they refused to pay for all of the illustrations she commissioned for the book from Władysław T. Benda, and the physical quality of the books were poor. That year, she turned to the young publishing house, Alfred A. Knopf, which had a reputation for supporting its authors through advertising campaigns. She also liked the look of its books and had been impressed with its edition of Green Mansions by William Henry Hudson. She so enjoyed their style that all her Knopf books of the 1920s—save for one printing of her short story collection Youth and the Bright Medusa—matched in design on their second and subsequent printings."]}, {"page": "1904 in literature", "response": ["*William Henry Hudson – Green Mansions"]}, {"page": "1841 in literature", "response": ["*August 4 – William Henry Hudson, Argentinian-born English writer and naturalist (died 1922)"]}, {"page": "Hyde Park, London", "response": ["An assortment of unusual sculptures are scattered around the park, including: Still Water, a massive horse head lapping up water; Jelly Baby Family, a family of giant Jelly Babies standing on top of a large black cube; and Vroom Vroom, which resembles a giant human hand pushing a toy car along the ground. The sculptor Jacob Epstein constructed several works in Hyde Park. His memorial to the author William Henry Hudson, featuring his character Rima caused public outrage when it was unveiled in 1925."]}, {"page": "Edward Augustus Freeman", "response": ["The naturalist William Henry Hudson was dismissive of Freeman's style of argument in his 1920 book Dead Man's Plack and an Old Thorn."]}, {"page": "South Downs", "response": ["The naturalist-writer William Henry Hudson wrote that \"during the whole fifty-three mile length from Beachy Head to Harting the ground never rises above a height of 850 feet, but we feel on top of the world\".."]}, {"page": "Worthing", "response": ["* William Henry Hudson, writer and naturalist born in Argentina."]}, {"page": "List of ornithologists", "response": ["*William Henry Hudson – Argentina/England"]}, {"page": "Gaucho", "response": ["The naturalist William Henry Hudson, who was born on the Pampas of Buenos Aires province, recorded that the gauchos of his childhood used to say that a man without a horse was a man without legs. He described meeting a blind gaucho who was obliged to beg for his food yet behaved with dignity and went about on horseback. Richard W. Slatta, the author of a scholarly work about gauchos, notes that the gaucho used horses to collect, mark, drive or tame cattle, to draw fishing nets, to hunt ostriches, to snare partridges, to draw well water, and even—with the help of his friends—to ride to his own burial."]}, {"page": "Luis Federico Leloir", "response": ["Leloir published a short autobiography, entitled \"Long Ago and Far Away\" in the 1983 Annual Review of Biochemistry. The title, Leloir claims, is derived from one of William Henry Hudson's novels that depicted the country wildlife and scenery of Leloir's childhood."]}, {"page": "List of geological features on Ariel", "response": ["| Rima || Rima (William Henry Hudson's Green Mansions) || 41 || "]}, {"page": "Sheena, Queen of the Jungle", "response": ["Sheena, Queen of the Jungle, is a fictional American comic book jungle girl heroine, originally published primarily by Fiction House during the Golden Age of Comic Books. She was the first female comic book character with her own title, with her 1938 premiere preceding Wonder Woman #1 (cover-dated Dec. 1941). Sheena inspired a wealth of similar comic book jungle queens. She was predated in literature by Rima, the Jungle Girl, introduced in the 1904 William Henry Hudson novel Green Mansions."]}, {"page": "W. H. Hudson", "response": ["#REDIRECT William Henry Hudson"]}, {"page": "Green Mansions", "response": ["Green Mansions: A Romance of the Tropical Forest (1904) is an exotic romance by William Henry Hudson about a traveller to the Guyana jungle of southeastern Venezuela and his encounter with a forest-dwelling girl named Rima.", "In the Classics Illustrated comic book adaptation, the editor says, \"We also feel that Hudson wants to tell us in this story that, long before this present meat-eating and destructive race took over all the world, there was a race of beings on the earth – beautiful, innocent, and bird-like, who lived in peace with nature and themselves, and of whom Rima and her mother were the last\".Classics Illustrated No. 90, \"William Henry Hudson\"."]}, {"page": "William Hudson", "response": ["*William Henry Hudson (1841–1922), Anglo-Argentine writer and naturalist"]}, {"page": "Little Boy Lost", "response": ["*A Little Boy Lost, a 1905 novel by William Henry Hudson"]}, {"page": "Guillermo Enrique Hudson", "response": ["#REDIRECT William Henry Hudson"]}, {"page": "Louis Gruenberg", "response": ["* Green Mansions (radio opera), libretto after a novel by William Henry Hudson (1937)"]}, {"page": "English Argentines", "response": ["*William Henry Hudson – author and naturalist"]}, {"page": "The Purple Land", "response": ["The Purple Land is a novel set in 19th-century Uruguay by William Henry Hudson, first published in 1885 under the title The Purple Land that England Lost. Initially a commercial and critical failure, it was reissued in 1904 with the full title The Purple Land, Being One Richard Lamb's Adventures in the Banda Orientál, in South America, as told by Himself. Towards the end of the novel, the narrator explains the title, \"I will call my book The Purple Land. For what more suitable name can one find for a country so stained with the blood of her children?\""]}, {"page": "List of Argentine Americans", "response": ["* William Henry Hudson - Argentine-British author, naturalist and ornithologist"]}, {"page": "Hudson, Buenos Aires", "response": ["The town is named after writer William Henry Hudson using the Spanish translation of his name."]}, {"page": "Green Mansions (film)", "response": ["Green Mansions is a 1959 American adventure romance film directed by Mel Ferrer. It is based upon the 1904 novel Green Mansions by William Henry Hudson. The film starred Audrey Hepburn (who at the time was married to Ferrer) as Rima, a jungle girl who falls in love with a Venezuelan traveller played by Anthony Perkins. Also appearing in the film were Lee J. Cobb, Sessue Hayakawa and Henry Silva. The score was by Heitor Villa-Lobos and Bronislau Kaper."]}, {"page": "Broadwater, West Sussex", "response": ["At the southern end of the parade of shops is Broadwater Church. Two well-known authors and naturalists, William Henry Hudson and Richard Jefferies are buried in Worthing and Broadwater Cemetery off South Farm Road. The eccentric philanthropist Ann Thwaytes lived at the now-demolished mansion of Charmandean from 1841 to 1866. Former Chief Inspector Walter Dew, CID of Scotland, was married in the church to Florence Idle in 1928: he was the chief investigator in the Crippen murder case, having previously investigated the Whitechapel murders ('Jack the Ripper').Bundock, Mike (2000). Herne Bay Clock Tower: A descriptive history. Herne Bay: Pierhead Publications. Friends of Broadwater and Worthing Cemetery: Broadsheet, Issue 10, Spring 2011 \"Ann Thwaytes\" by Rosemeary Pearson, p.11.The Annotated I Caught Crippen: Memoirs of Ex-Chief Inspector Walter Dew, CID of Scotland Yard, ed. with an introduction by Nicholas Connell (Mango Books, 2018), n. 108."]}, {"page": "List of Worthing inhabitants", "response": ["* William Henry Hudson, author and naturalist, lived in the town."]}, {"page": "Timothy L. Pflueger", "response": ["For the 3,200-seat design, Pflueger took his inspiration from Green Mansions, a romantic fantasy novel by William Henry Hudson set in the Guyana jungle of Venezuela. Tropical rain forest motifs were used throughout the theater, including climbing vines, waterfalls, parrots and emerald green lighting. As with his other works, Pflueger mixed together sources from around the world, adding images of Greek and Egyptian gods and goddesses as well as Egyptian lotuses to the primarily jungle theme. Plans were complete in November and in December 1930 ground was broken in a ceremony that called for \"prosperity celebration\"."]}]}}