{"wiki_id": "http://www.wikidata.org/entity/Q1356792", "itemLabel": "Richard K. Guy", "itemDescription": "British mathematician (1916-2020)", "wikipedia_url": "https://en.wikipedia.org/wiki/Richard_K._Guy", "wikipedia_page": {"main": "Richard Kenneth Guy (30 September 1916 – 9 March 2020) was a British mathematician. He was a professor in the Department of Mathematics at the University of Calgary. He is known for his work in number theory, geometry, recreational mathematics, combinatorics, and graph theory. He is best known for co-authorship (with John Conway and Elwyn Berlekamp) of Winning Ways for your Mathematical Plays and authorship of Unsolved Problems in Number Theory. He published more than 300 scholarly articles. Guy proposed the partially tongue-in-cheek \"strong law of small numbers\", which says there are not enough small integers available for the many tasks assigned to them – thus explaining many coincidences and patterns found among numerous cultures. For this paper he received the MAA Lester R. Ford Award.", "link_mentions": [{"page": "John Horton Conway", "response": ["* 1982 – Winning Ways for your Mathematical Plays (with Richard K. Guy and Elwyn Berlekamp). Academic Press, .", "* 1996 – The Book of Numbers (with Richard K. Guy). Copernicus, New York, 1996, ."]}, {"page": "Martin Gardner", "response": ["* Richard K. Guy", "A second such get-together was held in 1996, again with Gardner in attendance.  A video was made for the CBC Television program The Nature of Things with David Suzuki.Suzuki (1996) It featured Gardner along with many members of his circle and was called \"Martin Gardner: Mathemagician\" and broadcast on March 14, 1996.  At this point Rogers and his friends decided to make the gathering a regular, bi-annual event. Participants over the years have ranged from long-time Gardner friends such as John Horton Conway, Elwyn Berlekamp,  Ronald Graham, Donald Coxeter, and Richard K. Guy, to newcomers like mathematician and mathematical artist Erik Demaine, mathematical video maker Vi Hart, and  Fields Medalist Manjul Bhargava.Gathering 4 Gardner's G4G13 Presents \"Poetry, Drumming, and Mathematics\" with Professor Manjul Bhargava The Atlanta Journal-Constitution, April 15, 2018", "* Berlekamp, Elwyn R.,  John H. Conway, and Richard K. Guy (1982). Winning Ways for your Mathematical Plays Academic Press,  ."]}, {"page": "Phutball", "response": ["Phutball (short for Philosopher's Football) is a two-player abstract strategy board game described in Elwyn Berlekamp, John Horton Conway, and Richard K. Guy's Winning Ways for your Mathematical Plays."]}, {"page": "Sprouts (game)", "response": ["* Elwyn R. Berlekamp, John Conway and Richard K. Guy, Winning Ways for your Mathematical Plays, 1992."]}, {"page": "Divisor", "response": ["*Richard K. Guy, Unsolved Problems in Number Theory (3rd ed), Springer Verlag, 2004 ; section B."]}, {"page": "Straightedge and compass construction", "response": ["In this expanded scheme, we can trisect an arbitrary angle (see Archimedes' trisection) or extract an arbitrary cube root (due to Nicomedes). Hence, any distance whose ratio to an existing distance is the solution of a cubic or a quartic equation is constructible. Using a markable ruler, regular polygons with solid constructions, like the heptagon,  are constructible; and John H. Conway and Richard K. Guy give constructions for several of them.Conway, John H. and Richard Guy: The Book of Numbers"]}, {"page": "Nuneaton", "response": ["* Richard K. Guy (1916–2020), British mathematician and author"]}, {"page": "Winning Ways for Your Mathematical Plays", "response": ["Winning Ways for Your Mathematical Plays (Academic Press, 1982) by Elwyn R. Berlekamp, John H. Conway, and Richard K. Guy is a compendium of information on mathematical games.  It was first published in 1982 in two volumes."]}, {"page": "Combinatorial game theory", "response": ["In the 1960s, Elwyn R. Berlekamp, John H. Conway and Richard K. Guy jointly introduced the theory of a partisan game, in which the requirement that a play available to one player be available to both is relaxed. Their results were published in their book Winning Ways for your Mathematical Plays in 1982. However, the first work published on the subject was Conway's 1976 book On Numbers and Games, also known as ONAG, which introduced the concept of surreal numbers and the generalization to games. On Numbers and Games was also a fruit of the collaboration between Berlekamp, Conway, and Guy."]}]}}