{"wiki_id": "http://www.wikidata.org/entity/Q13522471", "itemLabel": "Mark Ellen", "itemDescription": "British television presenter and journalist", "wikipedia_url": "https://en.wikipedia.org/wiki/Mark_Ellen", "wikipedia_page": {"main": "Mark Ellen (born 16 September 1953) is a British magazine editor, journalist and broadcaster who lives in West London.", "link_mentions": [{"page": "Sgt. Pepper's Lonely Hearts Club Band", "response": ["According to Riley, the album \"drew people together through the common experience of pop on a larger scale than ever before\". In MacDonald's description, an \"almost religious awe surrounded the LP\"; he says that its impact was cross-generational, as \"Young and old alike were entranced\", and era-defining, in that the \"psychic shiver\" it inspired across the world was \"nothing less than a cinematic dissolve from one Zeitgeist to another\". In his view, Sgt. Pepper conveyed the psychedelic experience so effectively to listeners unfamiliar with hallucinogenic drugs that \"If such a thing as a cultural 'contact high' is possible, it happened here.\" Music journalist Mark Ellen, a teenager in 1967, recalls listening to part of the album at a friend's house and then hearing the rest playing at the next house he visited as if the record was emanating communally from \"one giant Dansette\". He says the most remarkable thing was its acceptance by adults who had turned against the Beatles when they became \"gaunt and enigmatic\", and how the group, recast as polished \"masters of ceremony\", were now \"the very family favourites they'd sought to satirise\"."]}, {"page": "Rubber Soul", "response": ["Author George Case, writing in his book Out of Our Heads, identifies Rubber Soul as \"the authentic beginning of the psychedelic era\". Music journalist Mark Ellen similarly credits the album with having \"sow[ed] the seeds of psychedelia\", while Christgau says that \"psychedelia starts here.\" Writing in The Sydney Morning Herald in July 1966, Lillian Roxon reported on the new trend for psychedelia-themed clubs and events in the US and said that Rubber Soul was \"the classic psychedelic album now played at all the psychedelic discotheques\". She attributed pop's recent embrace of psychedelia and \"many of the strange new sounds now in records\" to the LP's influence. Available at Rock's Backpages (subscription required)."]}, {"page": "Live Aid", "response": ["The concert was the most ambitious international satellite television venture that had ever been attempted at the time. In Europe, the TV feed was supplied by the BBC, whose broadcast was presented by Richard Skinner, Andy Kershaw, Mark Ellen, David Hepworth, Andy Batten-Foster, Steve Blacknell, Paul Gambaccini, Janice Long and Mike Smith and included numerous interviews and chats in between the various acts. The BBC's television sound feed was mono, as was all UK TV audio before NICAM was introduced, but the BBC Radio 1 feed was stereo and was simulcast in sync with the TV pictures. Unfortunately, in the rush to set up the transatlantic feeds, the sound feed from Philadelphia was sent to London via transatlantic cable, while the video feed was via satellite, which meant a lack of synchronisation on British television receivers. Due to the constant activities in both London and Philadelphia, the BBC producers omitted the reunion of Crosby, Stills, Nash & Young from their broadcast. The BBC, however, did supply a 'clean feed' to various television channels in Europe."]}, {"page": "The Old Grey Whistle Test", "response": ["Following the departure of Nightingale in 1982, Mark Ellen, David Hepworth and Richard Skinner also took turns as presenters. In 1983, the programme was moved to a live mid-evening slot. The title was abridged to Whistle Test and the title credits and music were changed. Andy Kershaw joined the series as a presenter in 1984. The same four presenters co-presented the BBC's television coverage of Live Aid in 1985."]}, {"page": "Cultural impact of the Beatles", "response": ["Music critics Robert Christgau and Mark Ellen each identify Rubber Soul as the album that laid the foundations for psychedelia. Citing a quantitative study of tempos in music from the era, Everett identifies it as a work that was \"made more to be thought about than danced to\", and an album that \"began a far-reaching trend\" in its slowing-down of the tempos typically used in pop and rock music. Many baroque-rock works appeared soon afterwards, particularly due to Martin's harpsichord-like solo on the track \"In My Life\", while the album also marked the introduction into pop of the pump organ or harmonium. Revolver ensured that psychedelic pop emerged from its underground roots and into the mainstream, while \"Rain\" originated British psychedelic rock. The chamber-orchestrated \"Eleanor Rigby\" is cited by Simonelli as an example of the Beatles' influence being such that, whatever the style of song, it helped to define the parameters of rock music."]}, {"page": "Ugly Rumours (band)", "response": ["Ugly Rumours was the name of a rock band founded in part by future UK prime minister Tony Blair, while studying law at St John's College, Oxford during the early 1970s; he sang and played guitar. The band's name came from the cover of the Grateful Dead's album From the Mars Hotel.'He even wanted to rehearse' by Mark Ellen, The Observer, 27 April 2003, Retrieved 21 October 2010.", "Other members of the band were Mark Ellen, who later went on to present BBC TV's The Old Grey Whistle Test music show and become the founding editor of British music magazine Q and Adam Sharples, currently Director General, Employment Group at the Department for Work and Pensions.", "*Interview with Mark Ellen: bassist, The Guardian"]}, {"page": "Ghost in the Machine (album)", "response": ["The reception for Ghost in the Machine was mostly positive. Rolling Stones Debra Rae Cohen found that the Police \"display more commitment, more real anger, on Ghost in the Machine than ever before.\" In Record Mirror, Robin Smith praised the album as \"the best thing they've ever done\", noting its \"overall sense of dedication and quality\" and more varied range of musical styles. Robert Christgau of The Village Voice remarked: \"It's pointless to deny that they make the chops work for the common good—both their trickiness and their simplicity provide consistent pleasure here.\" Smash Hits critic Mark Ellen was less receptive, deeming it a \"patchy\" album with both \"dazzling singles\" and filler tracks reminiscent of the band's earlier material. Ghost in the Machine was voted the 24th best album of 1981 in The Village Voices Pazz & Jop critics' poll."]}, {"page": "Fleet, Hampshire", "response": ["*The magazine editor, journalist and broadcaster Mark Ellen grew up in Fleet."]}, {"page": "Q (magazine)", "response": ["Q was a popular music magazine published monthly in the United Kingdom. It was founded in 1986 by broadcast journalists Mark Ellen and David Hepworth, who were presenters of the BBC television music series The Old Grey Whistle Test. Q's final issue was published in July 2020."]}, {"page": "Smash Hits", "response": ["Smash Hits launched the career of many journalists, including Radio Times editor Mark Frith. Other well-known writers have included Dave Rimmer, Mark Ellen (who went on to launch Q, Mojo and Word), Steve Beebee, Chris Heath, Tom Hibbert and Miranda Sawyer. Neil Tennant of the Pet Shop Boys also worked as a writer and assistant editor, and once claimed that had he not become a pop star, he would likely have pursued his ambition to become editor.", "*Mark Ellen"]}, {"page": "David Hepworth", "response": ["David Hepworth (born 27 July 1950) is a British music journalist, writer and publishing industry analyst who was instrumental in the foundation of a number of popular magazines in the 1980s, 1990s and 2000s. Along with the journalist, editor  and broadcaster Mark Ellen, he turned the pop magazine Smash Hits into one of the most popular UK music magazines of the 1980s. He co-presented the BBC broadcast of Live Aid on 13 July 1985, when he was the presenter told by Bob Geldof to \"fuck the address\" when pleading with viewers to send in their \"fucking money\".Dylan, Jones. \"The Eighties: One Day, One Decade\". Random House, 6 Jun 2013", "In the early 1980s he presented the BBC television show The Old Grey Whistle Test\"Old Grey Whistle Test to return to BBC\". telegraph.co.uk, 06 Jul 2011. Retrieved 21 June 2014 and was one of the presenters covering Live Aid.  On both of these he worked with long-term friend Mark Ellen. Hepworth famously provoked Bob Geldof to repeatedly use the word \"fuck\" live on air. Hepworth is featured in a podcast promoting the \"Top of the Pops\" boxset alongside Mark Goodier, Miles Leonard and Malcolm McLaren. He has written for The Guardian and for the UK trade magazine InPublishing.", "He now concentrates on publishing books on music nostalgia, his read \"David Hepworth's blog\", and collaborations with Mark Ellen on Word In Your Ear, a series of podcasts and music-themed live events."]}, {"page": "All You Need Is Love", "response": ["In Granada Television's 1987 documentary It Was Twenty Years Ago Today, commemorating two decades since Sgt. Pepper and the Summer of Love, several of the interviewees were asked whether they still believed that \"Love is all you need\". Harrison was the only one who unequivocally agreed with the sentiment. Asked why this was, he told Mark Ellen of Q magazine: \"They all said All You Need Is Love but you also need such-and-such else. But … love is complete knowledge. If we all had total knowledge, then we would have complete love and, on that basis, everything is taken care of. It's a law of nature.\""]}, {"page": "Physical (Olivia Newton-John song)", "response": ["\"Physical\" was described by Mark Ellen of Smash Hits as \"one of the most successful career-revivers in living memory\". It is the most successful single of Newton-John's career and became her fifth number-one single on the US Billboard Hot 100 (and last, to date). \"Physical\" stayed for 10 weeks on the top of Hot 100, from 21 November 1981 through 23 January 1982. It was the largest permanence at the time, becoming the most successful song on the Billboard in the 1980s. The song was very controversial due to the implied sexual content, being innovative and somewhat provocative for the time."]}, {"page": "Carnival of Light", "response": ["With their August 1966 album Revolver, the Beatles broke new ground in pop by departing from the genre's conventional notions of compositional form, instrumentation and engineering; in musicologist Walter Everett's description, it was also \"an innovative example of electronic music\".  Around December, Vaughn painted a psychedelic design on a piano owned by Paul McCartney. When delivering the piano to McCartney's home in St John's Wood, he asked McCartney to contribute a musical piece for The Million Volt Light and Sound Rave. To Vaughan's surprise, McCartney agreed. This is the story offered in Barry Miles' 1997 biography Paul McCartney: Many Years from Now. Alternatively, McCartney later told music journalist Mark Ellen that it was Miles who asked him to contribute to the event, while author Howard Sounes said that Edwards of BEV asked McCartney for a musical contribution from the Beatles and received a tape of \"Carnival of Light\" soon afterwards."]}, {"page": "Whatever Happened to Jugula?", "response": ["'Jugula' exposed Harper to a new and wider audience through this connection to Jimmy Page, their appearances at the Cambridge Folk Festival in 1984, the album tour (of which four performances were filmed and exist on archive footage) and a 15-minute televised interview by Mark Ellen on the Old Grey Whistle Test (16 November 1984). The interview featured Harper and Page playing acoustic guitars on the side of Side Pike in the English Lake District, a somewhat different and unusual interview for the time. Songs played included \"Hangman\" and a section from \"The Same Old Rock\"."]}, {"page": "Licorice McKechnie", "response": ["She visited Edinburgh in 1986 to see her family, but her whereabouts have been unknown since 1990, when, according to her sister, she was in Sacramento, California, apparently recovering from surgery. The music journalist Mark Ellen wrote in Mojo magazine in 2000 that she was \"last seen in 1987 hitchhiking across the Arizona Desert. Not even her family has heard from her since.\" Fellow former Incredible String Band member Rose Simpson was quoted as saying: \"There's a possibility she may be dead.\"Ellen, Mark (2000). \"Supertroupers—The Incredible String Band\". MOJO. August 2000, issue 81, EMAP Metro, London. p. 46."]}, {"page": "Swoon (Prefab Sprout album)", "response": ["The album's music has been described as idiosyncratic. According to David S. Mordoh of Rockdelux, Swoon is \"a collection of breathless verses and crisp rhythms, with lively acoustic guitar strummed funk – a fluid combination – and bossa nova beats draped in symphonic keyboards\". Creem Magazines Karen Schoemer similarly observed how the album's \"jumpy playful melodies are fenced in by acoustic guitars and light piano arrangements\". while Mark Ellen of Smash Hits described \"twisting rhythms and strange wistful chords for scenery\". Paul Lester of The Guardian has summarised the album sound as \"the lush sweep of George Gershwin and complex musicality of Stephen Sondheim, only played with the awkward angularity of Captain Beefheart's Magic Band\". Sondheim, admired by McAloon for his precise emotional and melodic content, was an influence on the album. McAloon considered him one of the \"real greats\", along with Burt Bacharach and Paul McCartney, and favoured artists who can successfully combine being adventurous with being commercial. Other formative influences include Igor Stravinsky, David Bowie, Karlheinz Stockhausen, Steely Dan and Television. Sam Sodomsky of Pitchfork made note of the album's \"post-punk edge\" – which would be abandoned in the band's subsequent work – and highlighted McAloon balancing themes of heartbreak and adulthood with \"questions that most songwriters might find trivial,\" while noting Smith's \"wordless refrains and non-sequitur exclamations that took pleasure in twisting expectations.\"", "Swoon earned critical acclaim upon release. Melody Maker's Ian Pye commended the \"magnificent\" album's production despite its humble budget, and felt the songs had a \"remarkable continuity\" despite being written over a period of years. He commented \"it’s hard to imagine any album topping its achievements in 1984\". Graham K. Smith of Record Mirror described Swoon as \"lightly magniﬁcent, a touch glorious, a little bit heavenly\" and \"the best record since Imperial Bedroom,\" while Joe Breen of The Irish Times called it \"one of the most arresting and interesting sets released this year\" and highlighted the \"emotional strength\" of \"Cruel\" and \"I Couldn’t Bear To Be Special\". Jan-Olov Andersson of Sweden's Aftonbladet declared Swoon \"without a doubt one of the best debut albums in recent years; a record full of intelligent, sophisticated pop music with elegant arrangements and artful lyrics\". Writing in Debut Magazine, Kathryn Nichols commented \"a Prefab song does take quite a few listenings with its unorthodox arrangements and chord changes, but it’s fresh, interesting and certainly worth persevering with\" Dave McCullough of Sounds felt the album sounded indie and \"would have been better with a big production and a big sound\". Writing in Smash Hits, Mark Ellen summarised the album as \"marvellous stuff, though just a little pretentious\"."]}, {"page": "She's Got Claws", "response": ["Like much of its parent album, the song was inspired by the betrayal of a former lover. According to Numan, \"There was a 'little incident' in February that involved one particular person who thought she could make an awful lot of money out of saying what it was like to be with me for six months. You don't expect that. I was all set for, y'know, the ring – the lot! Then it turns round and hits you like an atom bomb.\"Mark Ellen (1981). \"Cash of the Titan\". Smash Hits (September 17–30, 1981, Vol. 3, No. 19): p.5 The music video, filmed at Southam Zoo literalised the idea of a predatory woman by showing the singer on the run from a panther in scenes that prefigured the remake of Cat People, released the following year."]}, {"page": "The Wombles (band)", "response": ["Although Batt was sensitive about the legacy of the band for a long time, more recently he has talked of their music with pride. In a 2008 interview, he said: \"It is hard to be taken seriously with the Wombles hanging around my neck like a furry anvil.\" In a programme with Aled Jones on the BBC in 2010 Batt pointed out that, in balance, the Wombles also served as a \"furry balloon\" as it gave him his first chart success. In 2021, interviewed by Mark Ellen and David Hepworth, Batt stated: \"I kept the momentum going by changing the style of the records. I used it as an exercise in teaching myself to arrange music...The Wombles were perfect for me because the very necessity to have to change from single to single, style to style...meant I could be as adventurous as I wanted. It was uncool but it was fun, and fun is often uncool...People remember it now with a lot more affection than I got for it at the time.\""]}, {"page": "The Word (UK magazine)", "response": ["The Word was launched in February 2003. It was the first magazine to come from Development Hell Ltd, an independent publishing venture set up by David Hepworth and Jerry Perkins, two former EMAP executives with more than 35 years combined experience devising, editing and publishing titles such as Q, Empire, Mojo and Heat. The company also produce the dance music and clubbing title Mixmag and owns the dance music networking site Don't Stay In. The Guardian Media Group owned 29.5% of the Development Hell Ltd. The Word was edited by Mark Ellen, former editor of Smash Hits, Q and Select, launch managing editor of Mojo, and former editor-in-chief of EMAP Metro.", "Regular features included 'Diary' (Mark Ellen discussing recent events) 'Face Time' (an interview feature), 'Word of Mouth' (People we like & the things they like) 'Departure Lounge' (obituaries), 'Word to the Wise' (an interview) 'InBox' (letters to the editor), and 'The Last Word', the reviews section. Latterly, this included 'The Massive Attacks', a section devoted to reader reviews taken from the magazine's website.", "The Word's weekly podcast was an informal, unscripted broadcast of irregular length, and featured regular contributors Mark Ellen, David Hepworth, Andrew Harrison, Fraser Lewry and Kate Mossman. Guests included Nick Lowe, Andrew Collins, Barry McIlheney, Clare Grogan, Supergrass, Danny Baker, CW Stoneking, Neil Hannon, Robin Ince, Devon Sproule & Paul Curreri, Dom Joly, Wilko Johnson, Van Dyke Parks, Bob Harris, Pugwash, Robert Forster, Jac Holzman, Darrell Scott and Chris Difford. One popular section was the telling of the HORA (Hoary Old Rock Anecdote). It ran for 217 episodes between October 2006 and June 2012."]}, {"page": "British Music Experience", "response": ["Many of these interactive exhibits have been developed by specialist software suppliers Clay Interactive Ltd, iso design and Studio Simple with consultation from a curatorial team including Robert Santelli, who worked on other major music exhibits such as The Rock and Roll Hall of Fame in Cleveland, Ohio and The Grammy Museum in Los Angeles.Times Online, January 2008 The initial BME curator Paul Lilley, with Sarah Clark and Laura Bailey, were responsible for the extensive number of artefacts and exhibits on view and the rest of the BME content team was made up of music consultants Rob Dickins, David Roberts and Mark Ellen."]}, {"page": "A Genuine Freakshow", "response": ["The focal point of the band's musical style has been a self described \"pop-infused post-rock cannonade\", using the rich sounds of the cello, trumpet and violin, as well as more traditional rock instruments. On top of this, Timothy Sutcliffe's falsetto vocals are interwoven with orchestral arrangements, the like of which are more commonly seen in post-rock acts such as Godspeed You! Black Emperor. In later releases, however – in particular the debut album Oftentimes – the band's sound has become more pop orientated. Mark Ellen of The Word describes the band as \"A Bombastic Nu-Metal power house, writing a compelling tome on Jean Paul Sartre...with a String section, and trenchant sheets of Pink Floyd and Sigur Rós fed through the Radiohead filter\"Ellen, Mark. The Word, January 2010, p. 111."]}, {"page": "I'll Still Love You", "response": ["In late 1969, George Harrison's song \"Something\" was issued on the A-side of a single by the Beatles – the first time that one of his compositions had been given that honour.The Editors of Rolling Stone, p. 39. Discussing the song, Harrison remarked in an interview: \"There's a lot of songs like that in my head. I must get them down. Maybe even other people would like to sing them.\"Mark Lewisohn, \"Something Else\", in Mojo Special Limited Edition: 1000 Days of Revolution (The Beatles' Final Years – Jan 1, 1968 to Sept 27, 1970), Emap (London, 2003), p. 118.Alan Smith, \"Beatles Single – By George!\", NME, 1 November 1969, p. 3. In the summer of 1970, \"Something\" gave Welsh singer Shirley Bassey her biggest UK hit in nine years,\"Shirley Bassey\", Official Charts Company (retrieved 18 July 2015). an achievement that led her to tell the press that she and Harrison could become a singer-and-songwriter pairing on the scale of Dionne Warwick and Burt Bacharach.Harrison, p. 228. Although he would later be dismissive of Bassey's version of \"Something\",Paul Du Noyer, \"George's Uncertain Something\" , Mojo, January 2002 (retrieved 18 July 2015).Mark Ellen, \"A Big Hand for the Quiet One\", Q, January 1988, p. 59. Harrison wrote a new song for her to record after reading these comments. Originally titled \"Whenever\", it became \"When Every Song Is Sung\" and later \"I'll Still Love You\".Clayson, George Harrison, p. 332."]}, {"page": "Ellen (surname)", "response": ["* Mark Ellen (born 1953), English magazine editor, journalist and broadcaster"]}, {"page": "HyMag", "response": ["as well as TV & Radio including ITV News, BBC Radio 2's Jeremy Vine Show, BBC London Live with Vanessa Feltz, TalkRadio with James Max and 'Word In Your Attic' hosted by David Hepworth & Mark Ellen."]}, {"page": "Ellen, Mark", "response": ["#redirectMark Ellen"]}]}}