{"wiki_id": "http://www.wikidata.org/entity/Q13529994", "itemLabel": "Iain Mills", "itemDescription": "Worlds Largest 18 incher", "wikipedia_url": "https://en.wikipedia.org/wiki/Iain_Mills", "wikipedia_page": {"main": "Iain Campbell Mills (21 April 1940 – 16 January 1997) was a Conservative Party politician in the United Kingdom.\nMills was educated in southern Africa and subsequently worked as a Market Planning Executive for Dunlop.  He served as a councillor on Lichfield District Council from 1974 until 1976.\nHe entered the House of Commons at the 1979 general election as Member of Parliament (MP) for the constituency of Meriden, and held the constituency until his death shortly before the general election of 1997.  His successor was Caroline Spelman.\nThe death of Mills from alcohol poisoning at Dolphin Square, London, caused the government of John Major to lose its parliamentary majority. This, along with the Wirral South by-election held a month later, resulted in Major announcing the 1997 general election less than 4 months later.", "link_mentions": [{"page": "1997 United Kingdom general election", "response": ["* 1997 Iain Mills (Meriden) died, no by-election held due to imminent general election"]}, {"page": "1979 United Kingdom general election", "response": ["|Iain Mills"]}, {"page": "1983 United Kingdom general election", "response": ["|Iain Mills"]}, {"page": "Mills (surname)", "response": ["*Iain Mills, British politician"]}, {"page": "Richard Burden", "response": ["He contested the parliamentary seat of Meriden at the 1987 general election, where he was defeated by the sitting Conservative MP Iain Mills by a margin of 16,820. He was then selected to fight the Conservative-held marginal seat of Birmingham Northfield at the 1992 general election. Burden defeated the sitting Tory MP Roger King by just 630 votes and became a Labour MP. He made his maiden speech on 19 May 1992."]}, {"page": "List of MPs elected in the 1992 United Kingdom general election", "response": ["|Iain Mills", "*Meriden: Iain Mills (Con) died 13 January 1997"]}, {"page": "List of MPs elected in the 1987 United Kingdom general election", "response": ["|Iain Mills"]}, {"page": "List of MPs elected in the 1983 United Kingdom general election", "response": ["|Iain Mills"]}, {"page": "List of MPs elected in the 1979 United Kingdom general election", "response": ["|Iain Mills"]}, {"page": "Dolphin Square", "response": ["Politicians who have lived in the development include Harold Wilson, David Steel, William Hague, Estelle Morris, Beverley Hughes, Michael Mates, John Langford-Holt and Iain Mills. (Mills died in his flat in the square's Duncan House.)"]}, {"page": "List of United Kingdom by-elections (1979–2010)", "response": ["At the dissolution of Parliament in 1997 there were two vacancies: Meriden, caused by the death of its Conservative member Iain Mills, and Don Valley, caused by the death of its Labour member Martin Redmond. With the close proximity of the 1997 general election, by-elections were not held in these seats. They were held by Caroline Spelman and Caroline Flint respectively."]}, {"page": "Meriden (UK Parliament constituency)", "response": ["| Iain Mills", "The 1983 boundary changes and landslide electoral success of Margaret Thatcher that year transformed the constituency into a Conservative safe seat, with the Labour-leaning areas becoming part of the new Warwickshire North constituency (which was also won by the Conservatives). Iain Mills held this seat until he died in office in January 1997, with the seat remaining vacant until the dissolution of Parliament that March (and therefore no by-election being held). Caroline Spelman was victorious in the 1997 general election, though on that occasion only by a marginal majority, and held the seat until her retirement in 2019, with the challenge from Labour becoming more distant."]}, {"page": "John Tomlinson, Baron Tomlinson", "response": ["Tomlinson stood for Parliament without success in 1966 at Bridlington and in 1970 at Walthamstow East. He was elected to the House of Commons as Labour Member of Parliament for Meriden in the February 1974 general election, defeating the sitting Conservative MP Keith Speed. In the October 1974 General Election he retained the seat, defeating a new Conservative candidate, the former  Chairman of the Highway Planning Committee in the London Borough of Hammersmith, and Chairman of the Hyde Park Tories (the Conservative Party's open air speakers) Christopher Horne. He lost his seat in the 1979 general election to the Conservative candidate, Iain Mills."]}, {"page": "1997 in the United Kingdom", "response": ["** The Conservative Party government loses its majority in the House of Commons after the death of Iain Mills, MP for Meriden.", "* 13 January – Iain Mills, Member of Parliament (born 1940)"]}, {"page": "Iain Campbell Mills", "response": ["#REDIRECTIain Mills"]}, {"page": "United Kingdom general election records", "response": ["|Iain Mills and John Sever"]}, {"page": "List of Conservative Party MPs (UK)", "response": ["*Iain Mills"]}, {"page": "1997 in England", "response": ["* 16 January – The Conservative Party government loses its majority in the House of Commons after the death of Iain Mills, MP for Meriden."]}, {"page": "Deaths in January 1997", "response": ["*Iain Mills, 56, English politician."]}, {"page": "List of United Kingdom MPs who died in the 1990s", "response": ["|Iain Mills (in office)"]}]}}