{"wiki_id": "http://www.wikidata.org/entity/Q13529917", "itemLabel": "Harry Greer", "itemDescription": "British politician (1876-1947)", "wikipedia_url": "https://en.wikipedia.org/wiki/Harry_Greer", "wikipedia_page": {"main": "Sir Harry Greer (18 September 1876 – 20 March 1947) was a British businessman and Conservative politician.\nHe was elected Member of Parliament for Clapham in a by-election in 1918. However, in the general election of that year he contested, and won, the constituency of Wells. He held the seat until the next election in 1922. He was knighted in the 1922 New Years Honours List.\nHe later became chairman of the Lord Roberts Memorial Workshops, an organisation set up to create employment for wounded ex-servicemen and named after Field Marshal Lord Roberts. In the 1930s, he joined the board of the Baird Television company, and soon became its chairman. In 1934 his speech to shareholders was delivered by television from Crystal Palace to a meeting in Film House, Wardour Street, London, seven miles away. Until his death he was chairman of the Scottish Machine Tool Corporation.\nHe married in 1906 and had three daughters.", "link_mentions": [{"page": "Wells (UK Parliament constituency)", "response": ["| Harry Greer"]}, {"page": "List of MPs elected in the 1918 United Kingdom general election", "response": ["|Harry Greer"]}, {"page": "Clapham (UK Parliament constituency)", "response": ["| Harry Greer"]}, {"page": "List of United Kingdom by-elections (1900–1918)", "response": ["|Harry Greer"]}, {"page": "1918 Clapham by-election", "response": ["The Unionist (Conservative) candidate was Harry Greer. With the wartime (set to become postwar) coalition in office, there was no other candidate from the major parties. Henry Hamilton Beamish, a writer for the pro-War, conspiracy theory penning Vigilance or Vigilante Society, ran as an independent with the support of populist MP Noel Pemberton Billing, whose very prominent libel case of the century, whereby he defended various accusations of German blackmail and depravity, was a staged exercise in propaganda."]}, {"page": "Robert Bruford", "response": ["He was already very well known when the sitting Conservative MP for Wells, Sir Harry Greer, announced he would not contest the 1922 general election. Bruford was nominated as a Conservative, but was also one of four Conservative candidates to be sponsored by the National Farmers Union.\"Ministry And Farmers\", The Times, 28 October 1922, p. 11. In his election address, Bruford decried \"hasty\" legislation and said that he wanted \"not more legislation, but less legislation\". He also called for a return to the freedom and liberty of the subject enjoyed in pre-war years.\"Who's Who in the New Parliament\" ed. by T. W. Walding, Phillip Gee, 1922, p. 46. He was elected with a majority of 3,054 over Liberal candidate Arthur Hobhouse."]}, {"page": "Greer (surname)", "response": ["*Harry Greer (1876–1947), British businessman and Conservative politician"]}, {"page": "Henry Greer", "response": ["*Harry Greer (1876–1947), British businessman and politician"]}, {"page": "1922 New Year Honours", "response": ["* Harry Greer, . Member for the Wells Division of Somerset. Formerly Member for Clapham. Chairman of Board of Trade Committee, Merchandise Marks Act. Chairman of Lord Roberts Memorial Workshops."]}]}}