{"wiki_id": "http://www.wikidata.org/entity/Q1350728", "itemLabel": "James Wyatt", "itemDescription": "English architect", "wikipedia_url": "https://en.wikipedia.org/wiki/James_Wyatt", "wikipedia_page": {"main": "James Wyatt  (3 August 1746 – 4 September 1813) was an English architect, a rival of Robert Adam in the neoclassical and neo-Gothic styles. He was elected to the Royal Academy in 1785 and was its president from 1805 to 1806.\n\n", "link_mentions": [{"page": "Georgian architecture", "response": ["The styles that resulted fall within several categories. In the mainstream of Georgian style were both Palladian architecture—and its whimsical alternatives, Gothic and Chinoiserie, which were the English-speaking world's equivalent of European Rococo. From the mid-1760s a range of Neoclassical modes were fashionable, associated with the British architects Robert Adam, James Gibbs, Sir William Chambers, James Wyatt, George Dance the Younger, Henry Holland and Sir John Soane. John Nash was one of the most prolific architects of the late Georgian era known as The Regency style, he was responsible for designing large areas of London.Summerson, see index on all these; Jenkins (2003), xv–xiv; Musson, 28–35 Greek Revival architecture was added to the repertory, beginning around 1750, but increasing in popularity after 1800. Leading exponents were William Wilkins and Robert Smirke."]}, {"page": "Hertfordshire", "response": ["* Ashridge – the estate surrounding the neo-Gothic house by James Wyatt (not open to the public) is National Trust land."]}, {"page": "Josiah Wedgwood", "response": ["Sir George Strickland, 6th Baronet, was asked for advice on getting models from Rome.McKendrick 1982, p. 110-111. Gilding was to prove unpopular, and around 1772, Wedgwood reduced the amount of \"offensive gilding\" in response to suggestions from Sir William Hamilton.The Art of Ceramics. European Ceramic Design 1500–1830, Howard Coutts, p. 181. When English society found the uncompromisingly naked figure of the classics \"too warm\" for their taste, and the ardor of the Greek gods too readily apparent, Wedgwood was quick to cloak their pagan immodesty – gowns for the girls and fig leaves for the gods were usually sufficient.McKendrick 1982, p. 113. Just as he felt that his flowerpots would sell more if they were called \"duches of Devonshire flowerpots\", his creamware more if called Queensware, so he longed for Brown, James Wyatt, and the brothers Adam to lead the architect in the use of his chimney pieces and for George Stubbs to lead the way in the use of Wedgwood plaques."]}, {"page": "Palace of Westminster", "response": ["The Palace of Westminster as a whole underwent significant alterations from the 18th century onwards, as Parliament struggled to carry out its business in the limited available space of ageing buildings. Calls for an entirely new palace went unheeded – instead more buildings of varying quality and style were added. A new west façade, known as the Stone Building, facing onto St Margaret's Street, was designed by John Vardy and built in the Palladian style between 1755 and 1770, providing more space for document storage and for committee rooms. The House of Commons and House of Lords Engrossing Office of Henry (Robert) Gunnell (1724–1794) and Edward Barwell was on the lower floor beside the corner tower at the west side of Vardy's western façade. It was here where the Tax Laws for the American Colonies were put together. A new official residence for the Speaker of the House of Commons was built adjoining St Stephen's Chapel and completed in 1795. The neo-Gothic architect James Wyatt carried out works both on the House of Lords and on the House of Commons between 1799 and 1801, including alterations to the exterior of St Stephen's Chapel and a much-derided new neo-Gothic building (referred to by Wyatt's critics as \"The Cotton Mill\") adjoining the House of Lords and facing onto Old Palace Yard."]}, {"page": "List of castles in England", "response": ["|Restored and extended by James Wyatt and Jeffry Wyattville, 1800–30.\"Windsor Castle\"  BLB.", "|Built in 1633, remodelled by James Wyatt in 19th century, now within country park. Building At Risk.\"Elvaston Castle\"  PSC.", "|On the Isle of Portland, built for John Penn to designs by James Wyatt.\"Pennsylvania Castle\"  PSC.", "|Gothic Revival, by James Wyatt.\"Norris Castle\"  PSC."]}, {"page": "List of architects", "response": ["*James Wyatt (1746–1813), English"]}, {"page": "Henley-on-Thames", "response": ["*Fawley Court, a red-brick building designed by Christopher Wren for William Freeman (1684) with subsequent interior remodelling by James Wyatt and landscaping by Lancelot \"Capability\" Brown."]}, {"page": "J. M. W. Turner", "response": ["Many early sketches by Turner were architectural studies or exercises in perspective, and it is known that, as a young man, he worked for several architects including Thomas Hardwick, James Wyatt and Joseph Bonomi the Elder. By the end of 1789, he had also begun to study under the topographical draughtsman Thomas Malton, who specialised in London views. Turner learned from him the basic tricks of the trade, copying and colouring outline prints of British castles and abbeys. He would later call Malton \"My real master\". Topography was a thriving industry by which a young artist could pay for his studies."]}, {"page": "Salisbury Cathedral", "response": ["Significant changes to the cathedral were made by the architect James Wyatt in 1790, including the replacement of the original rood screen and demolition of a bell tower which stood about  northwest of the main building. Salisbury is one of only three English cathedrals to lack a ring of bells, the others being Norwich Cathedral and Ely Cathedral. However, its medieval clock does strike the time with bells every 15 minutes."]}, {"page": "Woolwich", "response": ["Elsewhere, monumental buildings testify of Woolwich's rich military history. Woolwich Common with its surrounding buildings has been designated a conservation area. The Neoclassical façade of the Royal Artillery Barracks (James Wyatt, 1776–1802) is the longest façade in London, stretching along the north end of the common. Across the road, Government House (1781), was the quarters of the Garrison Commandant from 1855 to 1995. Of the nearby Garrison Church of St George only the shell remains after it was bombed during the Second World War. Its Neo-Romanesque architecture and remnants of mosaics are still impressive. John Nash's Rotunda, a round brick building with a leaded tent roof, until 2001 housed the Royal Artillery Museum and now serves as a boxing ring for the King's Troop, Royal Horse Artillery in nearby Napier Lines Barracks.", "The Royal Military Academy at the south end of Woolwich Common was also designed by James Wyatt and has an almost equally long façade in Mock Tudor style. Other military buildings that survive include Connaught Barracks (built as the Royal Artillery Hospital in 1780), Green Hill Military School and Royal Herbert Hospital on Shooters Hill. The Royal Engineers' HQ was moved to Chatham in 1856, but a small detachment remained in Woolwich, quartered in what is now Engineer House on Mill Hill, just off the Common. Several listed buildings were demolished in the 1970s, including James Wyatt's Engineers Barracks (built for the Royal Military Artificers in 1803), Lewis Wyatt's Grand Depot Barracks (begun in 1805-6 for the Field Train department), Cambridge Barracks (1842, of which the gatehouse still stands) and Red Barracks (1858, only the boundary wall and entrance gate remain). The latter two, on Frances Street, were originally built as the Royal Marine Barracks, Woolwich for the Woolwich Division of the Royal Marines, and each was considered an innovative and influential design. The Marines departed with the closure of the Dockyard, whereupon the buildings were converted into barracks accommodation for various military corps. Rushgrove House (1806) housed the Colonel Commandant of the Marine Barracks (later Cambridge Barracks) from 1855."]}, {"page": "Victoria and Albert Museum", "response": ["Not only are all the major British architects of the last four hundred years represented, but many European (especially Italian) and American architects' drawings are held in the collection. The RIBA's holdings of over 330 drawings by Andrea Palladio are the largest in the world;Douglas Lewis, The Drawings of Andrea Palladio, 2nd edition, 2000. other Europeans well represented are Jacques GentilhatreRosalys Coope, Catalogue of the Drawings Collection of the RIBA: Jacques Gentilhatre, 1972. and Antonio Visentini.John McAndrew, Catalogue of the Drawings Collection of the RIBA: Antonio Visentini, 1974. British architects whose drawings, and in some cases models of their buildings, in the collection, include: Inigo Jones,John Harris & Gordon Higgott, Inigo Jones Complete Architectural Drawings, 1989. Sir Christopher Wren, Sir John Vanbrugh, Nicholas Hawksmoor, William Kent, James Gibbs, Robert Adam,Alister Rowan, Catalogues of Architectural Drawings in the V&A: Robert Adam, 1988. Sir William Chambers,Michael Snodin (ed.), Catalogues of Architectural Drawings in the V&A: Sir William Chambers, 1996. James Wyatt, Henry Holland, John Nash, Sir John Soane,Pierre de la Ruffuniere du Prey, Catalogues of Architectural Drawings in the V&A: Sir John Soane, 1985. Sir Charles Barry, Charles Robert Cockerell, Augustus Welby Northmore Pugin,Alexandra Wedgwood, Catalogues of Architectural Drawings in the V&A: A. W. N. Pugin and the Pugin Family, 1985. Sir George Gilbert Scott, John Loughborough Pearson, George Edmund Street, Richard Norman Shaw, Alfred Waterhouse, Sir Edwin Lutyens, Charles Rennie Mackintosh, Charles Holden, Frank Hoar, Lord Richard Rogers, Lord Norman Foster, Sir Nicholas Grimshaw, Zaha Hadid and Alick Horsnell.", "The collection includes pieces by William Kent, Henry Flitcroft, Matthias Lock, James Stuart, William Chambers, John Gillow, James Wyatt, Thomas Hopper, Charles Heathcote Tatham, Pugin, William Burges, Charles Voysey, Charles Robert Ashbee, Baillie Scott, Edwin Lutyens, Edward Maufe, Wells Coates and Robin Day. The museum also hosts the national collection of wallpaper, which is looked after by the Prints, Drawings and Paintings department."]}, {"page": "Great Yarmouth", "response": ["From 1808 to 1814 the Admiralty in London could communicate with its ships in Yarmouth by a shutter telegraph chain. Ships were routinely anchored offshore during the Napoleonic Wars and the town served as a supply base for the Royal Navy. Part of an Ordnance Yard survives from this period on Southtown Road, probably designed by James Wyatt: a pair of roadside lodges (which originally housed senior officers) frame the entrance to the site, which contains a sizeable armoury of 1806, a small barracks block and other ancillary buildings. Originally the depot extended down to a wharf on the River Yare and was flanked by a pair of storehouses, but these and other buildings were destroyed in The Blitz. A grander survival is the former Royal Naval Hospital designed by William Pilkington, begun in 1806 and opened in 1811. Consisting of four colonnaded blocks around a courtyard, it served as a naval psychiatric hospital, then as a barracks. The barrack-master was Captain George Manby, during his time in post he invented the Manby mortar. The premises was transferred to the NHS in 1958. After its closure in 1993, the buildings were turned into private residences."]}, {"page": "John Nash (architect)", "response": ["He went on to design the prisons at Cardigan (1791–96)Suggett 1995, p. 25 and Hereford (1792–96). It was at Hereford that Nash met Richard Payne Knight,Tyack 2013, p. 19 whose theories on the picturesque as applies to architecture and landscape would influence Nash. The commission for Hereford Gaol came after the death of William Blackburn, who was to have designed the building, Nash's design was accepted after James Wyatt approved of the design.Tyack 2013, p. 20", "Together with Robert Smirke and Sir John Soane, he became an official architect to the Office of Works in 1813Summerson 1980, p. 96 (although the appointment ended in 1832) at a salary of £500 per annum (£57,810 in 2020 money).Page 98, Sir John Soane Architect, Dorothy Stroud, 1984, Faber & Faber I.S.B.N. 0-571-13050-X Following the death in September of that year of James Wyatt, this marked the high point in his professional life. As part of Nash's new position, he was invited to advise the Parliamentary Commissioners on the building of new churches from 1818 onwards.Port 2006, p. 59 Nash produced ten church designs, each estimated to cost around £10,000 (£1.2 million in 2020 money) with seating for 2000 people;Port 2006, p. 65 the style of the buildings were both classical and gothic. In the end, Nash only built two churches for the Commission: the classical All Souls Church, Langham Place (1822–24), terminating the northern end of Regent Street, and the gothic St. Mary's Haggerston (1825–27),Port 2006, p. 81 bombed during The Blitz in 1941."]}, {"page": "Berkhamsted", "response": ["thumb|Spire of chapel at the Grade 1 Ashridge House, showing the Natural Trust Ashridge Estate behind Ashridge Executive Education  is located in the Grade I listed Ashridge House, the former stately home of the Duke of Bridgewater, set in 190 acres (77 hectares) of rolling parkland, 2 miles outside Berkhamsted. The house occupies the site of the earlier Ashridge Priory, a college of the monastic order of Bonhommes founded in 1283 by Edmund, 2nd Earl of Cornwall, who resided in the castle. After the Dissolution of the Monasteries, Henry VIII bequeathed the property to his daughter, Elizabeth. In 1800, it was the home of Francis Egerton, 3rd Duke of Bridgewater, affectionately known as the Father of Inland Navigation.Ashridge House  was constructed between 1808 and 1814 to a design by James Wyatt with later work by his nephew Jeffrey Wyattville. Architecture critic Nikolaus Pevsner described it as the \"largest of the romantic palaces near London ... a spectacular composition\". In 1928 Urban Hanlon Broughton purchased the house as a gift for the Conservative Party intended to commemorate Bonar Law. For its first 15 years, it became a \"College of Citizenship\" established to help the party develop its intellectual forces in struggles with socialist organisations such as the Fabian Society. It became a cross between a think-tank and a training centre, and Arthur Bryant was its educational adviser."]}, {"page": "Magdalen College, Oxford", "response": ["The chapel itself is a grade I listed building built between 1474 and 1480. The roof, giving the impression of a stone vaulted ceiling, is in fact a facsimile made from plaster added in 1790 by James Wyatt. Wyatt's redevelopment of the chapel included a number of modifications to make it more Gothic in character, but other than the ceiling, Wyatt's contributions were removed during a later redesign in 1828.", "It was conceived as one side of a new \"Great Quadrangle\", and in anticipation of this the building's ends had been left unfinished. However, Holdsworth's full vision was never completed. The idea was revisited several times by later architects, including by architects James Wyatt—whose plans (never realised) included partially demolishing the existing, Medieval quad (the Cloister) and refinishing the neoclassical New Building in a Georgian Gothic style—and John Buckler. In the 19th century, John Nash and Humphrey Repton both submitted designs for new, open quadrangles that incorporated the New Building."]}, {"page": "Merton College, Oxford", "response": ["The hall is the oldest surviving college building, but apart from the door which has medieval ironwork almost no trace of the ancient structure has survived the successive reconstruction efforts, first by James Wyatt in the 1790s and then again by Gilbert Scott in 1874. The hall is still used daily for meals and houses a number of portraits. It is not usually open to visitors."]}, {"page": "Oriel College, Oxford", "response": ["right|thumb|On the first floor of James Wyatt's building, the senior library, looking east", "The north range houses the library and senior common rooms; designed in the Neoclassical style by James Wyatt, it was built between 1788 and 1796 to accommodate the books requested by Edward, Baron Leigh, formerly High Steward of the University and an Orielensis, whose gift had doubled the size of the library. The two-storey building has rusticated arches on the ground floor and a row of Ionic columns above, dividing the façade into seven bays — the ground floor contains the first purpose-built senior common rooms in Oxford, above is the library."]}, {"page": "Worcester College, Oxford", "response": ["Owing to lack of funds, Worcester's eighteenth-century building programme proceeded by fits and starts. The west end of the Terrace and the Provost's Lodgings were added in 1773–1776 (architect: Henry Keene). The medieval cottages were to have been replaced by a further classical range, but survived because money for this purpose was never available; the Hall and Chapel, by James Wyatt, were not completed until the 1770s.", "The College Chapel was built in the 18th century. Dr George Clarke, Henry Keene and James Wyatt were responsible for different stages of its lengthy construction (1720–1791), owing to shortage of funds. The interior columns and pilasters, the dome and the delicate foliage plastering are all Wyatt's work. His classical interior was insufficiently emphatic for the tastes of militant Victorian churchmen, and between 1864 and 1866 the chapel was redecorated by William Burges. It is highly unusual and decorative; being predominantly pink, the pews are decorated with carved animals, including kangaroos and whales, and the walls are riotously colourful, and include frescoes of dodos and peacocks. Its stained glass windows were to have been designed by John Everett Millais, but Burges rejected his designs and entrusted the work to Henry Holiday. Oscar Wilde said of the Chapel, \"As a piece of simple decorative and beautiful art it is perfect, and the windows very artistic.\""]}, {"page": "Chiswick House", "response": ["After the death of Lady Burlington in 1758, the villa and gardens passed to the Cavendish family. William Cavendish died in 1764, leaving the property to his son William, the 5th Duke of Devonshire. In 1774, William married Lady Georgiana Spencer, the Duchess of Devonshire, who enjoyed spending time at Chiswick which she referred to as her \"earthly paradise\". She regularly invited members of the Whig party to the house for tea parties in the garden. In 1788 the Cavendish family demolished the Jacobean house and hired architect John White to add two wings to the villa to increase the amount of accommodation. The duchess was responsible for the building of the Classical Bridge in 1774, designed by the architect James Wyatt, and the planting of roses on the walls of the new wings and the sides of the buildings. She died in 1806.", "The Classic Bridge located beyond the Orange Tree Garden was built for Georgiana Spencer. It was constructed in 1774 to the designs of James Wyatt. Alterations were made to the gardens in 1778 by the fifth Duke of Devonshire and included the demolition of the Casina in 1778 and the pulling down of the Gibbs Pagan Temple by 1784.Richard Hewlings, Chiswick House and Gardens, London: English Heritage guide book, 1998, p.53. Richard Hewling's states the reason for such actions was not neglect but rather: \"it was a change of taste, away from artificial temples located within a geometrically ordered plan\". In 1784 the Duke engaged Samuel Lapidge, a landscape designer who had previously worked under Lancelot 'Capability' Brown, to make further changes to the garden, including the filling in of the northern rectangular pond. The Sixth Duke of Devonshire (the 'Bachelor' Duke) obtained permission in 1813 to relocate Burlington Road beyond the two piers at the front of the forecourt to its present position."]}, {"page": "William Chambers (architect)", "response": ["*Abbeyleix House, managing the construction of the house which had earlier been designed by James Wyatt"]}, {"page": "Belton House", "response": ["One of the most Carolean features of the house is the balustrade and cupola surmounting the roof, another element introduced to English architecture by Roger Pratt. The cupola at Belton does not light a lofty domed hall, as is often the case in Europe, but houses a staircase which gives access to a large viewing platform on top of a lead roof, concealed from the ground by the balustrade which tops the more conventional and visible hipped roof. From this vantage point, the owners of Belton could admire the perfect symmetry of their avenues and formal gardens spreading from the house. This feature of the house was removed by the architect James Wyatt when he modernised the house in the 18th century.Tinniswood (1999), 21–22. It was restored to its original form in the 1870s by the 3rd Earl Brownlow.Tinniswood (1999), 30.", "Either side of the Marble Hall, lie the Great Staircase (2) and the Tapestry Room (11), which contains a collection of early eighteenth century Mortlake tapestries. The Great Staircase to the east of the Marble Hall is unusually placed at Belton, as in a house of this period one would expect to find the staircase in the hall. The stairs rise in three flights around the west, north, and east walls to the former Great Dining Room above the Marble Hall. Thus the staircase served as an important state procession link between the three principal reception rooms of the house. The Great Dining Room, now the Library, has been greatly altered and all traces of Carolean decoration removed, first by James Wyatt in 1778 when it was transformed into a drawing room with a vaulted ceiling, and again in 1876, when its use was again changed, this time to a library. The room contains some 6000 volumes, a superb example of book collecting over 350 years.Tinniswood (2006), 17. When Lord Tyrconnel died in 1754 a catalogue of his library identified almost 2,300 books. Almost all of these remain in the Belton library today. Rupert Gunnis attributed the carved marble chimneypiece depicting two Roman goddesses to Sir Richard Westmacott.Marsden, 28."]}, {"page": "Benjamin Henry Latrobe", "response": ["The book, The Domestic Architecture of Benjamin Henry Latrobe, lists buildings he designed in England, including Grade II* listed Alderbury House (late 1800s) in Wiltshire. This structure had previously been misattributed to James Wyatt. It has been described as \"one of Wiltshire’s most elegant Georgian country houses\".  Eight of the biggest country house sales in Britain in 2020"]}, {"page": "River Avon, Hampshire", "response": ["*Wilton House (including orangery, loggietta, whispering seat, classical bridges, follies, columns, Holbein porch, James Wyatt architecture)"]}, {"page": "Belvoir Castle", "response": ["In 1799, the 5th Duke of Rutland married Lady Elizabeth Howard. The new Duchess of Rutland soon chose architect James Wyatt to rebuild the castle in the romantic Gothic Revival style. The Duke, one of the wealthiest landholders in the United Kingdom of Great Britain and Ireland, sold seven assorted villages and their surrounding lands to fund the massive project. The project was nearing completion when, on 26 October 1816, it was almost destroyed by a fire. The loss - including pictures by Titian, Rubens, van Dyck, and Reynolds - was estimated at £120,000 (£ million today)."]}, {"page": "Shute Barrington", "response": ["Barrington was a great patron of architecture and education in the diocese of Durham. One school, Bishop Barrington School, still exists today in Bishop Auckland. To mark his fiftieth year in the prelacy, the diocese of Durham built the Clergy Jubilee School in Newcastle and arranged that Dame Allan's Schools should be housed there. In architecture he employed James Wyatt to remodel Salisbury Cathedral, as well as the Georgian Gothic interiors of Auckland Castle, his favoured residence."]}, {"page": "Prince Edward, Duke of Kent and Strathearn", "response": ["The Duke of Kent purchased a house of his own from Maria Fitzherbert in 1801. Castle Hill Lodge on Castlebar Hill, Ealing (West London), was then placed in the hands of architect James Wyatt and more than £100,000 spent (£ in ).T F T Baker, C R Elrington (Editors)"]}, {"page": "East Grinstead", "response": ["The High Street contains one of the longest continuous runs of 14th-century timber-framed buildings in England. Other notable buildings in the town include Sackville College, the sandstone almshouse, built in 1609, where John Mason Neale wrote the Christmas carol \"Good King Wenceslas\". The college has sweeping views towards Ashdown Forest. The adjacent St Swithun's Church stands on the highest ground in the town and was rebuilt in the eighteenth century (the tower dating from 1789) to a perpendicular design by James Wyatt. The imposing structure dominates the surrounding countryside for many miles around. In the churchyard are commemorated the East Grinstead Martyrs, and in the south-east corner is the grave of John Mason Neale.", "The Church of England has four places of worship in the town. St Swithun's Church was founded in the 11th century. Architect James Wyatt rebuilt it in local stone in 1789 after it became derelict and collapsed.  Near the entrance to the church, three stones mark the supposed ashes of Anne Tree, Thomas Dunngate and John Forman who were burned as martyrs on 18 July 1556 because they would not renounce the Protestant faith. John Foxe wrote about them in his 1,800-page Foxe's Book of Martyrs.  Two other churches are in St Swithun's parish."]}, {"page": "Durham Cathedral", "response": ["In 1794 the architect James Wyatt drew up extensive plans which would have drastically transformed the building, including the demolition of the Galilee Chapel, but the Chapter changed its mind just in time to prevent this happening.  Wyatt renewed the 15th-century tracery of the Rose Window, inserting plain glass to replace what had been blown out in a storm."]}, {"page": "Lichfield Cathedral", "response": ["Although the 18th century was a golden age for the City of Lichfield, it was a period of decay for the cathedral. The 15th-century library, on the north side of the nave, was pulled down and the books moved to their present location above the Chapter House. Most of the statues on the west front were removed and the stonework covered with Roman cement. At the end of the century James Wyatt organised some major structural work, removing the High Altar to make one worship area of Choir and Lady Chapel and adding a massive stone screen at the entrance to the Choir. Francis Eginton painted the east window and was commissioned by the chapter to do other work in the cathedral."]}, {"page": "William Beckford (novelist)", "response": [" The opportunity to purchase the complete library of Edward Gibbon gave Beckford the basis for his own library, and James Wyatt built Fonthill Abbey in which to house this and the owner's art collection. Lord Nelson visited Fonthill Abbey with the Hamiltons in 1800. The house was completed in 1807. Beckford entered parliament as member for Wells and later for Hindon, quitting by taking the Chiltern Hundreds; but he lived mostly in seclusion, spending much of his father's wealth without adding to it."]}, {"page": "Regent Street", "response": ["Immediately north of Regent Street is the BBC's headquarters, Broadcasting House, whose front entrance is in Langham Place. Several national radio stations are broadcast from this building. The site had formerly been a building on the gardens of Foley House designed by James Wyatt and called Wyatt's House. It was demolished in 1928 (with much of the fixtures ending up in the Victoria and Albert Museum) to construct Broadcasting House. Construction was challenging because the building had to be visually similar to other properties on Regent Street, yet also contain over twenty soundproofed studios. The exterior is built of Portland stone and above the front entrance is a sculpture by Eric Gill."]}, {"page": "Culture of the United Kingdom", "response": ["In the early 18th century Baroque architecture – popular in Europe – was introduced, and Blenheim Palace was built in this era. However, Baroque was quickly replaced by a return of the Palladian form. The Georgian architecture of the 18th century was an evolved form of Palladianism. Many existing buildings such as Woburn Abbey and Kedleston Hall are in this style. Among the many architects of this form of architecture and its successors, neoclassical and romantic, were Robert Adam, Sir William Chambers, and James Wyatt."]}, {"page": "Gothic Revival architecture", "response": ["German Romanticists (including philosopher and writer Goethe and architect Karl Friedrich Schinkel), began to appreciate the picturesque character of ruins—\"picturesque\" becoming a new aesthetic quality—and those mellowing effects of time that the Japanese call wabi-sabi and that Horace Walpole independently admired, mildly tongue-in-cheek, as \"the true rust of the Barons' wars\". The \"Gothick\" details of Walpole's Twickenham villa, Strawberry Hill House begun in 1749, appealed to the rococo tastes of the time, and were fairly quickly followed by James Talbot at Lacock Abbey, Wiltshire. By the 1770s, thoroughly neoclassical architects such as Robert Adam and James Wyatt were prepared to provide Gothic details in drawing-rooms, libraries and chapels and, for William Beckford at Fonthill in Wiltshire, a complete romantic vision of a Gothic abbey."]}, {"page": "Burning of Parliament", "response": ["By 1834 the palace complex had been further developed, firstly by John Vardy in the middle of the eighteenth century, and in the early nineteenth century by James Wyatt and Sir John Soane. Vardy added the Stone Building, in a Palladian style to the West side of Westminster Hall;  Wyatt enlarged the Commons, moved the Lords into the Court of Requests and rebuilt the Speaker's House. Soane, taking on responsibility for the palace complex on Wyatt's death in 1813, undertook rebuilding of Westminster Hall and constructed the Law Courts in a Neoclassical style. Soane also provided a new royal entrance, staircase and gallery, as well as committee rooms and libraries."]}, {"page": "John Soane", "response": ["A growing sign of Soane's success was an invitation to become a member of the Architects' Club that was formed on 20 October 1791.  Practically all the leading practitioners in London were members, and it combined a meeting to discuss professional matters, at 5:00 pm on the first Thursday of every month with a dinner.Stroud, 1984, p. 70 The four founders were Soane's former teachers George Dance and Henry Holland with James Wyatt and Samuel Pepys Cockerell. Other original members included: Sir William Chambers, Thomas Sandby, Robert Adam, Matthew Brettingham the Younger, Thomas Hardwick and Robert Mylne. Members who later joined included Sir Robert Smirke and Sir Jeffrey Wyattville.", "In October 1791 Soane was appointed Clerk of Works with responsibility for St James's Palace, Whitehall and The Palace of Westminster.Darley, p. 117 Between 1795 and 1799 Soane was Deputy Surveyor of His Majesty's Woods and Forest, on a salary of £200 per annum.Stroud, 1984, pp. 69–70 James Wyatt's death in 1813 led to Soane together with John Nash and Robert Smirke, being appointed official architect to the Office of Works in 1813, the appointment ended in 1832, at a salary of £500 per annum.Stroud, 1984, p. 98 As part of this position he was invited to advise the Parliamentary Commissioners on the building of new churches from 1818 onward.Port, 2006, p. 59 He was required to produce designs for churches to seat 2000 people for £12,000 or less though Soane thought the cost too low,Port, 2006, p. 74 of the three churches he designed for the Commission all were classical in style. The three churches were: St Peter's Church, Walworth (1823–24), for £18,348; Holy Trinity Church, Marylebone (1826–27), for £24,708; St John on Bethnal Green (1826–28), for £15,999.Port, 2006, pp. 74–79"]}, {"page": "Royal Military College, Sandhurst", "response": ["In 1812, the College's Junior Department moved from Great Marlow into purpose-built buildings at Sandhurst designed by James Wyatt,Sandhurst – Royal Berkshire History at berkshirehistory.com and was soon joined there by the Senior Department, migrating from High Wycombe. In 1858 this became a separate institution, the Staff College."]}, {"page": "Soho House", "response": ["In 1766, Boulton became one of the founders of the Lunar Society. In 1789, Boulton commissioned Samuel Wyatt to extend the buildings and fully revamp it and the gardens. Work on extending the building was completed in 1796 following the submission of designs by James Wyatt, Samuel's brother, for the additions of a main entrance front. Wyatt was also responsible for the large dining room, the regular venue for meetings of the Lunar Society. It is a Grade II* listed building."]}, {"page": "Wilton House", "response": ["==19th century and James Wyatt==", "The 11th Earl (1759–1827) called upon James Wyatt in 1801 to modernise the house, and create more space for pictures and sculptures. The final of the three well-known architects to work at Wilton (and the only one well documented) was to prove the most controversial. His work took eleven years to complete.", "James Wyatt was an architect who often employed the neo-classical style, but at Wilton for reasons known only to architect and client he used the Gothic style. Since the beginning of the 20th century his work at Wilton has been condemned by most architectural commentators. The negative points of his 'improvements' to modern eyes are that he swept away the Holbein porch, reducing it to a mere garden ornament, replacing it with a new entrance and forecourt. This entrance forecourt created was entered through an 'arc de triumph' which had been created as an entrance to Wilton's park by Sir William Chambers circa 1755. The forecourt was bounded by the house on one side, with wings of fake doors and windows extending to form the court, all accessed by Chambers's repositioned arch, crowned by a copy of the life-size equestrian statue of Marcus Aurelius. While not altogether displeasing as an entrance to a country house, the impression created is more of a hunting estate in Northern France or Germany.", "thumb|left|James Wyatt's Gothic revival cloisters display the 8th Earl of Pembroke's collection of statuary assembled between 1690 and 1730"]}, {"page": "Georgian era", "response": ["Georgian society and its preoccupations were well portrayed in the novels of writers such as Daniel Defoe, Jonathan Swift, Samuel Richardson, Henry Fielding, Laurence Sterne, Mary Shelley and Jane Austen, characterised by the architecture of Robert Adam, John Nash and James Wyatt and the emergence of the Gothic Revival style, which hearkened back to a supposed golden age of building design."]}, {"page": "Wrexham", "response": ["Acton Park was originally the landscaped grounds of Acton Hall. It was laid out in 1785 by James Wyatt on the instructions of the owner Sir Foster Cunliffe. "]}, {"page": "Benjamin West", "response": ["Though initially snubbed by Sir Joshua Reynolds, founding President of the Royal Academy, and by some other Academicians who felt he was over-ambitious, West was elected President of the Royal Academy on the death of Reynolds in 1792. He resigned in 1805, to be replaced by a fierce rival, architect James Wyatt. However West was again elected president the following year, and served until his death."]}, {"page": "Fonthill Abbey", "response": ["Fonthill Abbey—also known as Beckford's Folly—was a large Gothic Revival country house built between 1796 and 1813 at Fonthill Gifford in Wiltshire, England, at the direction of William Thomas Beckford and architect James Wyatt.For a short, comprehensive historical account see For more in-depth accounts see Brockman, H. A. N., (1956), The Caliph of Fonthill, London: Werner Laurie, or Fothergill, B. (1979), Beckford of Fonthill, London: Faber and Faber) It was built near the site of the Palladian house, later known as Fonthill Splendens, which had been constructed by his father William Beckford. This, in turn, had replaced the Elizabethan house that Beckford The Elder had purchased in 1744 and which had been destroyed by fire in 1755. The abbey's main tower collapsed several times, lastly in 1825 damaging the western wing. The entire abbey was later almost completely demolished.", "Fonthill Abbey was the brainchild of William Thomas Beckford, son of wealthy English plantation owner William Beckford and a student of architect Sir William Chambers, as well as of James Wyatt, architect of the project.", "Construction of the abbey began in earnest 1796 on Beckford's estate of Fonthill Gifford near Hindon in southern Wiltshire. He hired James Wyatt, one of the most popular and successful architects of the late 18th-century, to lead the works. Wyatt was often accused of spending a good deal of his time on women and drink.Dale, Anthony, James Wyatt: Architect 1746–1813, see the chapter entitled \"Character\" Consequently, he also angered many of his clients—including Beckford—because of his all too common absences from client meetings, for a general disregard for supervising the construction works he was in charge of, and for not delivering the promised results in time, with clients accusing him — in certain instances — of years of delay.", "Category:James Wyatt buildings"]}, {"page": "Royal Military Academy, Woolwich", "response": ["The possibility of moving the Royal Military Academy out of the Warren was mooted as early as 1783, as it was fast outgrowing the available accommodation. At first costs precluded this possibility, but (with the Academy continuing to grow) James Wyatt, the Board of Ordnance Architect, was commissioned to design a new complex of buildings to stand, on a site facing the Royal Artillery Barracks, at the southern edge of Woolwich Common; it was built between 1796 and 1805 and opened for use the following year.", "Category:James Wyatt buildings"]}, {"page": "Frogmore", "response": ["Frogmore House was built in the 1680s and in 1792 the house and estate were bought by George III for his wife Queen Charlotte, although the land had formed part of the Windsor royal hunting ground since the reign of Henry VIII. Charlotte engaged James Wyatt to redesign the house and sought the advice of her Vice-Chamberlain, William Price, regarding the redevelopment of the grounds. Price’s brother Uvedale, an early exponent of the Picturesque, clearly influenced the design. In 1840, Frogmore was inherited by the Duchess of Kent and, following her death in 1861, by her daughter, Queen Victoria. The estate became a favoured, almost sacred, retreat; after burying her mother in a mausoleum overlooking the lake, the Queen commissioned  another, the Royal Mausoleum, for her husband Albert, Prince Consort and for herself, after Albert’s death in 1861.", "Various other structures stand in the grounds including the 'Gothic Ruin' (1793), 'Queen Victoria's Teahouse' (a brick pavilion of 1869) and the Indian Kiosk. Constructed of marble, the kiosk was taken from the Qaisar Bagh in Lucknow following the looting of the city, by the Viceroy of India, Charles Canning, 1st Earl Canning in 1858. The kiosk is octagonal with an onion dome with round arches and deep eaves. It is a  Grade II listed structure. Teulon’s Teahouse also has a Grade II listing while James Wyatt’s nearby Gothic Ruin is designated Grade II*.", "Gothic Ruin, Frogmore House Geograph-3503907-by-David-Hillas.jpg|The Gothic Ruin by James Wyatt"]}, {"page": "Royal Arsenal", "response": ["Between 1805 and 1813 the massive Grand Stores complex was constructed alongside new wharves by the river; though celebrated as a landmark of size and dignity befitting the Arsenal, the buildings were immediately, and for many years afterwards, vulnerable to subsidence due to their proximity to the river (this was caused in no small part by on-site supervisors directing the use of cheaper wooden piles in place of the stone foundations specified by the architect, James Wyatt). The buildings formed a three-sided quadrangle of warehouses facing the river, with the central open space used as a shot-yard. (The main range of buildings was flanked by smaller quadrangles to the east and west, only fragments of which survive.) The Grand Store was not uniquely, or even primarily, designed as an artillery store, but rather as warehousing for all kinds of military equipment: an early example of a planned integrated military stores complex.", "Several early 18th-century buildings on the site have been attributed to the architects Sir John Vanbrugh or Nicholas Hawksmoor (both of whom are known to have designed buildings for the Board of Ordnance), including the Royal Brass Foundry, Dial Arch and the Royal Military Academy; but whilst acknowledging their influence (direct or indirect), the Survey of London credits Brigadier-General Michael Richards (Surveyor-general for the Ordnance board at the time) as having played the leading part in their design. In the late-18th and early-19th centuries James Wyatt, as Architect of the Ordnance, was responsible for several buildings on the site, including the Main Guardhouse (1787), the Grand Store (1805) and Middlegate House (1807). More often than not, though, it was the on-site Engineers and Clerks of the Works who were responsible for the design of buildings and other structures within the working Arsenal."]}, {"page": "Ringshall, Berkhamsted", "response": ["Ringshall is close to Ashridge House, a former stately home that is now in use as a management college. A crenellated Gothic Revival stone gatehouse stands in Ringshall at an entrance to the Ashridge estate which was  probably designed 1808-1813 by James Wyatt, architect of Ashridge House."]}, {"page": "Stoke Poges", "response": ["Gray is buried at St Giles'. John Penn \"of Stoke\" had a large monument built by James Wyatt, displaying verses from the Elegy. It is adjacent to St Giles' and owned by the National Trust.", "A gothic style rectory having a battlemented parapet was built by James Wyatt, 1802–1804 for John Penn of Stoke Park. It is now a private residence called Elegy House."]}]}}