{"wiki_id": "http://www.wikidata.org/entity/Q13530047", "itemLabel": "Marshall Stevens", "itemDescription": "British politician (1852-1936)", "wikipedia_url": "https://en.wikipedia.org/wiki/Marshall_Stevens", "wikipedia_page": {"main": "Marshall Stevens (18 April 1852 – 12 August 1936) was an English property developer. His work with Daniel Adamson and others led to the construction of the Manchester Ship Canal, completed in 1894.", "link_mentions": [{"page": "Manchester Ship Canal", "response": ["With the predicted traffic for the canal slow to materialise, Hooley and Marshall Stevens (the general manager of the Ship Canal Company) came to see the benefits that the industrial development of Trafford Park could offer to both the ship canal and the estate. In January 1897 Stevens became the managing director of Trafford Park Estates, where he remained until 1930, latterly as its joint chairman and managing director."]}, {"page": "Eccles (UK Parliament constituency)", "response": ["| Marshall Stevens", "thumb|120px|Marshall Stevens"]}, {"page": "Barton upon Irwell", "response": ["The de Traffords believed in religious freedom and paid for churches and chapels of other denominations. Between 1865 and 1868, the Church of England St Catherine's Church was built at their expense to the rear of All Saints' Church. It was demolished in the late 1970s. The graveyard remains and is the last resting place of Marshall Stevens.http://www.canalarchive.org.uk/Tpages/html/T2010.html"]}, {"page": "List of MPs elected in the 1918 United Kingdom general election", "response": ["| Marshall Stevens"]}, {"page": "Trafford Park", "response": ["On 17 August, Hooley formed Trafford Park Estates Ltd, transferring his ownership of the park to the new company – of which he was the chairman and a significant shareholder – at a substantial profit. The initial plans for the estate included a racetrack, exclusive housing and a cycle works, along with the development of the ship canal frontage for \"all types of trade including timber\". By that time the ship canal had been open for two years, but the predicted traffic had yet to materialise. Hooley met with Marshall Stevens, the general manager of the Ship Canal Company, and both men recognised the benefit that the industrial development of Trafford Park could offer to the ship canal, and the ship canal to the estate. In January 1897 Stevens became the managing director of Trafford Park Estates. He remained with the company, latterly as its joint chairman and managing director, until 1930."]}, {"page": "United Kingdom general election records", "response": ["|Marshall Stevens", "*Marshall Stevens, 1918: 66"]}, {"page": "List of Conservative Party MPs (UK)", "response": ["*Marshall Stevens"]}, {"page": "John Buckle", "response": ["In the general election of 1922 he was elected to the Commons as Member of Parliament for the Eccles Division of Lancashire, unseating the Conservative incumbent, Marshall Stevens. He held the seat when a further election was held in 1923. Although his total number of votes fell from 14,354 to 12,227 he was able to increase his majority over Stevens from 1,803 to 1,863 with the anti-Labour vote split by the presence of a Liberal Party candidate. A minority Labour government that was formed following the election collapsed in October 1924, necessitating a further general election. Although he managed to increase his vote, Buckle was defeated in a straight fight by the Conservative candidate Albert Bethel by over 2,000 votes. He died in the following year."]}, {"page": "Science and engineering in Manchester", "response": ["With the predicted traffic for the canal slow to materialise, Hooley and Marshall Stevens (the general manager of the Ship Canal Company) came to see the benefits that the industrial development of Trafford Park could offer to both the ship canal and the estate. In January 1897 Stevens became the managing director of Trafford Park Estates, where he remained until 1930, latterly as its joint chairman and managing director."]}, {"page": "List of Vanity Fair (British magazine) caricatures (1910–1914)", "response": ["|1910-09-14 14 Sep 1910||Stevens Marshall Marshall Stevens||Manchester Ship Canal||ELF||M 1244||"]}]}}