{"wiki_id": "http://www.wikidata.org/entity/Q1351592", "itemLabel": "Eric Robertson", "itemDescription": "Scottish composer and musician in Canada", "wikipedia_url": "https://en.wikipedia.org/wiki/Eric_Robertson_(composer)", "wikipedia_page": {"main": "Eric Nathan Robertson (born 6 April 1948) is a Scottish composer, organist, pianist, and record producer who has been primarily active in Canada. A two time Gemini Award winner, he has composed more than 60 film scores and written music for a number of television series in Canada and the United States. He has also written a considerable amount of choral and organ music, sometimes with instrumental or symphonic accompaniment. His works display a strong influence of Ralph Vaughan Williams, Charles Wood, and William O. Minay, the latter of whom he studied with for over 30 years. He has also produced and played on numerous commercial albums by a variety of artists and released several of his own albums of popular songs and film themes under the name Magic Melodies.", "link_mentions": [{"page": "Millennium (film)", "response": ["Category:Films scored by Eric Robertson (composer)"]}, {"page": "A Muppet Family Christmas", "response": ["Category:Films scored by Eric Robertson (composer)"]}, {"page": "Music Box Dancer", "response": ["\"Music Box Dancer\" has been recorded by such pianists as Floyd Cramer, Richard Clayderman, Roger Williams and Eric Robertson, and by orchestral artists such as James Last and 101 Strings. Bandleader Ray Conniff added lyrics and titled the song on his album I Will Survive in 1979. Germany's Roberto Delgado recorded a calypso version, and an accordion version was released in Sweden. The band PePe produced a techno version. It was also recorded by Enormous Richard for the Pravda Records compilation 20 More Explosive Fantastic Rockin' Mega Smash Hit Explosions!. German singer Marion Maerz made a German vocal version of the song, and The Wiggles covered it on the video/album Racing to the Rainbow. In 1980, famous Hong Kong songstress Paula Tsui (Xu Xiaofeng) released a version of this song with the same melody and added Cantonese lyrics inspired by Frank Mills' Official music video, it was arranged by Paulino Chris Babida and with lyrics by Cheng Kwok Kong (Zheng Guojiang)."]}, {"page": "Canadian classical music", "response": ["Other string players include violist Rivka Golani and cellists Donald Whitton (a founding member of NACO), Ottawa-based chamber musician Julian Armour (also a chamber music festival organizer), and soloist Ofra Harnoy. Well-known wind players include bassoonists such as William Douglas and Nadina Mackie Jackson; flautists Timothy Hutchins and Alexander Zonjic; and oboists such as James Mason and Marc Rogers. Notable Canadian organists include Eric Robertson, Gerald Bales, François Brassard, and Healey Willan. There are also several well-known Canadian organ builders, including Casavant Frères and Gabriel Kney. Two classical guitarists from Canada have become well known: Liona Boyd and Norbert Kraft. Well-known brass players from Canada include Jens Lindemann (trumpet), James Sommerville (horn) and Alain Trudel (trombone)."]}, {"page": "Street Legal (Canadian TV series)", "response": ["The series is distinctively Canadian, in the use of Canadian court customs and procedures. Much of the show's music was composed by Eric Robertson who was nominated for a Gemini Award in 1987 for his work on the show."]}, {"page": "Spasms", "response": ["The film's score was composed by Eric Robertson. Tangerine Dream contributed the original theme over the end credits.", "Category:Films scored by Eric Robertson (composer)"]}, {"page": "If You Could See What I Hear", "response": ["Category:Films scored by Eric Robertson (composer)"]}, {"page": "Full Disclosure (2001 film)", "response": ["Category:Films scored by Eric Robertson (composer)"]}, {"page": "Read All About It! (TV series)", "response": ["Read All About It! is a Canadian educational television series that was produced from 1979 to 1981 by TVOntario. It starred David Craig Collard as Chris, Lydia Zajc as Lynne, Stacey Arnold as Samantha, and Sean Hewitt as Duneedon, ruler of the galaxy Trialviron.  In the second season Michael Dwyer joined the cast as Alex.  The main goal of the show was to educate viewers in reading, writing and history. Each episode ran for approximately 15 minutes. Eric Robertson composed the music for the show being filmed in Brampton, Ontario."]}, {"page": "Readalong", "response": ["The Granny, Boot, and Pretty puppets are now housed at the Canadian Museum of History. Noreen Young, who designed the puppets, also created puppets for other programs, including Under the Umbrella Tree. The characters were developed by Ken Sobol, who also wrote all the scripts for the series. The show's music was composed by Eric Robertson.", "* Music: Eric Robertson"]}, {"page": "List of Scottish musicians", "response": ["*Eric Robertson, composer"]}, {"page": "Longer Fuse", "response": ["* Eric Robertson – Fender Rhodes (10)"]}, {"page": "Frederick C. Silvester", "response": ["Silvester wrote a number of short choral works (published by Harris) and songs (published by Western). His chorale Prelude on Rockingham has been recorded by Eric Robertson."]}, {"page": "Royal Canadian College of Organists", "response": ["*Eric Robertson"]}, {"page": "That's My Baby! (1984 film)", "response": ["Category:Films scored by Eric Robertson (composer)"]}, {"page": "The Challengers (film)", "response": ["Category:Films scored by Eric Robertson (composer)"]}, {"page": "Shocktrauma", "response": ["Dick Atkins and Michael Lepiner were the executive producers, with Christopher Dalton and Wayne Fenske as producers. The production stars William Conrad as Dr. R Adams Cowley, the heart surgeon who pioneered trauma care. The film's score was composed by Eric Robertson.", "Category:Films scored by Eric Robertson (composer)"]}, {"page": "Rocket Science (miniseries)", "response": ["The series was produced, written and directed by Canadian filmmaker Michael Lennick for The Discovery Channel (Canada), and narrated by actor Graham Greene. Music was composed by Eric Robertson. Lennick filmed a pilot episode named \"The Highest Step\" about the high-altitude balloon flights of Project Manhigh and the rocket sled tests of Colonel John Paul Stapp."]}, {"page": "The Mighty Pope", "response": ["After fronting minor combos Ram (one 45 for the Tuesday label, \"Love Is The Answer\", which also appeared on the \"Jamaica to Toronto\" compilation) and the Wild Oats (unrecorded), Pope eventually went solo and saw greater commercial success. Thanks to non-stop touring, Pope continued to gain recognition and adoration. By the mid-seventies, his dynamic stage act caught the attention of management and subsequently RCA Records Canada, who released his self-titled The Mighty Pope soul LP in 1977. It contained the single, \"Heaven On The 7th Floor,\" a #14 hit single in Canada.  Harry Hinde (Tundra, Charity Brown, Shania Twain) produced the disc with arrangements from Eric Robertson (The Majestics, Moe Koffman, Roger Whittaker) and most impressively, Motown and Detroit music legend David Van De Pitte (Marvin Gaye's \"What's Going On\" to name but one). Four 7\" singles from the long player were released altogether. \"Heaven On The Seventh Floor\" broke the Canadian Top 20, while \"If You Want A Love Affair\" received worship from the UK's dance-fuelled Northern Soul scene. \"Heaven on the 7th Floor\" was covered by The Mighty Pope, and charted concurrently with Paul Nicholas's version. In Canada, his version was the bigger hit. It was issued by RCA Records on the Private Stock label, and reached #14. It also reached number 83 on the U.S. Cash Box chart.[12]"]}, {"page": "A Holiday to Remember", "response": ["A Holiday to Remember is a 1995 American made-for-television Christmas romantic-drama film starring Connie Sellecca and Randy Travis. It premiered on CBS on December 12, 1995.  As of 2009, it was shown in the 25 Days of Christmas programming block on ABC Family, but it was not part of the block in 2010 and re-emerged on the competing AMC Best Christmas Ever block in 2019. The film's score was composed by Eric Robertson."]}, {"page": "Robertson (surname)", "response": ["*Eric Robertson (literary critic), professor at Royal Holloway, University of London", "*Eric Robertson (athlete) (1892–1975), British athlete", "*Eric Robertson (composer) (born 1948), Scottish composer, organist, pianist, and record producer"]}, {"page": "Eric Robertson", "response": ["Eric Robertson may refer to:", "* Eric Robertson (literary critic), professor at Royal Holloway, University of London", "* Eric Robertson (athlete) (1892–1975), British athlete", "* Eric Robertson (composer) (born 1948), Scottish composer, organist, pianist, and record producer", "* Eric Robertson (politician), American law enforcement officer and politician from Washington, U.S."]}, {"page": "Samuel Dolin", "response": ["Dolin's teaching career at the RCMT produced an impressive roster of composers. The success of his students is attributed to not only his pedagogical methods but also to his advocacy of their work. Dolin often performed his students' compositions in faculty recitals or arranged public concerts exhibiting their work at the conservatory. The compositional style of his pupils is highly varied, which demonstrates Dolin's remarkable ability to adapt his teaching to the interests of each individual student. Some of his notable pupils are: Milton Barnes, Stuart Broomer, Brian Cherney, Steven Gellman, Herbie Helbig, Jim Hiscott, Paul Hoffert, Scott Irvine, Lorraine Johnson, Moe Koffman, Gary Kulesha, Larysa Kuzmenko, Joseph Lerner, Michel Longtin, Gene Martynec, John Mills-Cockell, Michael Pepa, Allan Rae, Eric Robertson, John Robertson, Clark Ross, Ann Southam, Ben Steinberg, Timothy Sullivan, Roman Toi, Alan Torok, Ben Trowell, Ruth Watson Henderson, John Welsman, Wes Wraggett, and Jack Zaza."]}, {"page": "Eric N. Robertson", "response": ["#REDIRECT Eric Robertson (composer)"]}, {"page": "Eric Nathan Robertson", "response": ["#REDIRECT Eric Robertson (composer)"]}]}}