{"wiki_id": "http://www.wikidata.org/entity/Q1351418", "itemLabel": "Eric Trist", "itemDescription": "British scientist", "wikipedia_url": "https://en.wikipedia.org/wiki/Eric_Trist", "wikipedia_page": {"main": "Eric Lansdown Trist (11 September 1909 – 4 June 1993) was an English scientist and leading figure in the field of organizational development (OD). He was one of the founders of the Tavistock Institute for Social Research in London.", "link_mentions": [{"page": "Sociotechnical system", "response": ["The term sociotechnical systems was coined by Eric Trist, Ken Bamforth and Fred Emery, in the World War II era, based on their work with workers in English coal mines at the Tavistock Institute in London. Sociotechnical systems pertains to theory regarding the social aspects of people and society and technical aspects of organizational structure and processes. Here, technical does not necessarily imply material technology. The focus is on procedures and related knowledge, i.e. it refers to the ancient Greek term techne. \"Technical\" is a term used to refer to structure and a broader sense of technicalities. Sociotechnical refers to the interrelatedness of social and technical aspects of an organization or the society as a whole.For the latter, see the use of sociotechnical in the works of sociologist Niklas Luhmann and philosopher Günter Ropohl.", "Some of the central principles of sociotechnical theory were elaborated in a seminal paper by Eric Trist and Ken Bamforth in 1951. This is an interesting case study which, like most of the work in sociotechnical theory, is focused on a form of 'production system' expressive of the era and the contemporary technological systems it contained.  The study was based on the paradoxical observation that despite improved technology, productivity was falling, and that despite better pay and amenities, absenteeism was increasing.  This particular rational organisation had become irrational.  The cause of the problem was hypothesized to be the adoption of a new form of production technology which had created the need for a bureaucratic form of organization (rather like classic command-and-control).  In this specific example, technology brought with it a retrograde step in organizational design terms.  The analysis that followed introduced the terms \"socio\" and \"technical\" and elaborated on many of the core principles that sociotechnical theory subsequently became.", "* Eric Trist and H. Murray ed. (1993).The Social Engagement of Social Science, Volume II: The Socio-Technical Perspective. Philadelphia: University of Pennsylvania Press.http://www.moderntimesworkplace.com/archives/archives.html"]}, {"page": "Fred Emery", "response": ["He left Australia in 1957 and went to London to join the staff of the Tavistock Institute, where the majority of his early work was then done.  He had worked with Eric Trist on the recently discovered concept of sociotechnical systems in 1951–52 when he was UNESCO Research Fellow. This was where he wished to be and he returned to the Tavistock Institute to continue to work with Trist. He subsequently published 'The Characteristics of Sociotechnical Systems' in 1959. ", "Constantly drawn towards testing social science theory in field settings, he and Eric Trist, one of his closest intellectual collaborators, and other colleagues, established \"open socio-technical systems theory\" as an alternative paradigm for organisational design – field-tested on a national scale in Norway, in partnership with Einar Thorsrud. ", "In 1979 when his CCE Fellowship expired, efforts were made by some of his colleagues to find a permanent post for him at the ANU, but to no avail. Thus, long before their numbers swelled and their own association was formed, Emery became one of Australia's outstanding Independent Scholars. By 1985 he had published at least another 15 journal articles (a flow which continued to his last year), and governments, enterprises, students, universities, and many others, from this country and elsewhere, continued to seek his expertise, and later continued as a consultant. In this later period, he and Merrelyn Emery refined the Search Conference participative planning process (designed by Fred Emery and Eric Trist in 1958). In the final two years of his life, he co-edited the third and final volume of the \"Tavistock anthology\" being published by the University of Pennsylvania Press – The Social Engagement of Social Science.", "The three books that perhaps best convey his thinking are Toward a Social Ecology from 1972 with Eric Trist, On purposeful systems from 1972 with Russell Ackoff, and Futures We're In from 1977. He also edited for Penguin two volumes of readings called Systems Thinking (the initial volume was reprinted six times), which will long remain a staple resource on the origins and development of open systems thinking throughout the life sciences."]}, {"page": "Social structure", "response": ["* Eric Trist"]}]}}