{"wiki_id": "http://www.wikidata.org/entity/Q13518580", "itemLabel": "John Caldecott", "itemDescription": "English businessman, astronomer and meteorologist", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Caldecott", "wikipedia_page": {"main": "John Caldecott (16 September 1801 – 16 December 1849, Trivandrum) was an East India Company commercial agent, meteorologist and astronomer who worked in the court of the Raja of Travancore at the Trivandrum Observatory.\nCaldecott was born in Finsbury in London where his father, also John, and mother Susannah lived. He was christened on 1 November 1801 at St Luke's Church. John Caldecott (junior) went to India in 1820 on the Mulgrave Castle and reached Bombay in May 1821. He worked at Apollo Cotton as an assistant to Daniel West who was a family friend. A relative, William West had an interest in telescopes and microscopes as an evening amusement and this sparked off a scientific interest in John Caldecott. In 1832 he was posted as a commercial agent at the Indian port of Allepey (now Alappuzha) and he saw the need for an astronomical observatory there. This idea was aired in 1836, supported by the Resident Colonel James Stuart Fraser and approved by Raja Swathi Thirunal Rama Varma of Travancore. An observatory was constructed at Trivandrum. The building was constructed by Captain Horsley of the Madras Engineers. Opened in 1837, Caldecott was appointed as director. Two mural circles, a transit and equatorial telescopes were installed at the observatory. In April 1841, he also brought in instruments to measure the magnetic field of the Earth. He was interested in examining the magnetic field of the Earth at various parts, a scheme inspired by Alexander von Humboldt. He was also very interested in matters of the temperature of the core of the Earth. He published his observations extensively and pursued these ideas until his death.\n\nHis measurements of the temperature of the ground at different depths in Trivandrum allowed him (and J.D. Forbes who commented on his observations) to point out errors in the assertions of Professor A. Kupffer, of the Imperial Academy of St. Petersburg who said that the Earth is about 6 degrees cooler than the air (based on measurements in Russia) and pointed out that Bossingault was wrong in assuming that the temperature underground below a depth of one foot was constant. He made observations on the solar eclipse of 21 December 1843 at Parrat near the origin of the Mahé river and noticed Baily's beads. He made observations of several comets. He also collaborated with Thomas Glanville Taylor of Madras and examined the magnetic field variations in southern India.Caldecott married Selina, daughter of James Somerville Darby of Dublin on 8 November 1825 at Bombay. This however did not work out well and she returned to England  in 1827. He married again in 1835 to Sophia Rodgers at Allepey. Caldecott was elected to the Royal Society as well as the Royal Astronomical Society in 1840. Caldecott died in 1849 at Trivandrum and his work was continued by Reverend Josiah Sperschneider until his position was succeeded by John Allan Broun at the Trivandrum observatory.", "link_mentions": [{"page": "John Allan Broun", "response": ["From 1852, Broun was director of Trivandrum Observatory, in Trivandrum, in Travancore, India. Trivandrum is today known as Thiruvananthapuram, and is the capital of the Indian State of Kerala, but then it was the capital of the princely state of Travancore, a territory in a subsidiary alliance with British India. The observatory had been founded in 1836 by Swathi Thirunal Rama Varma, the Maharajah of Tranvacore. The first director of the observatory was John Caldecott (1800-1849). The observatory is now part of the University of Kerala, and is one of the oldest of its kind in India. The rulers of Tranvacore during the time of Broun were Uthradom Thirunal (until 1860) and his successor Ayilyam Thirunal. Broun was sent to study geomagnetism at a period when the British Academy was interested in studying it on a global scale. Trivandrum was close to where the magnetic equator lay at the time of Broun."]}, {"page": "List of fellows of the Royal Society A, B, C", "response": ["| John Caldecott||20/02/1840||1800 – 16 December 1849"]}, {"page": "Caldecott (surname)", "response": ["* John Caldecott (1800–1849), English astronomer"]}, {"page": "William Cullen (Resident)", "response": ["Cullen interacted mainly with the Maharajas of Travancore Swathi Thirunal Rama Varma and Uthram Thirunal Marthanda Varma and took considerable interest in scholarly and cultural pursuits. He appears to have prepared a dictionary of English and Malayalam which is briefly mentioned by Reverend B. Bailey in his 1849 dictionary, and promoted the idea of a museum that was to become the Trivandrum Museum (now Napier Museum). The idea for the museum originated in 1843 when he wrote a memorandum to the Madras Government that local museums would aid natives in gaining practical knowledge while also helping to preserve antiquities from the region. The idea was approved in 1854 and a museum was set up in 1857. He also donated his own collection of geological specimens to this museum. About 3000 visitors were recorded in the first year of which 10% were women. The museum project was aided by John Allan Broun, an astronomer and geologist who also maintained careful meteorological records around Trivandrum. Cullen was however critical of the magnetic observations at the observatory as conducted by John Caldecott. Christian missionaries in the region found Cullen to support local culture and disapproving of missionary activities to the point that some claimed that he had become a Hindu (\"thoroughly Hindooized by an uninterrupted residence of nearly fifty years in India\"). Cullen wrote regularly in the Madras journal of literature and science and took part in discussions on a range of topics. He made a critical commentary on an enquiry into the idea that the destruction of forests was leading to a reduction in rainfall. His notes on the topic which were compiled by Edward Balfour questioned the premise and pointed out the lack of precise data (\"facts\") in the claims (\"opinions\") made by Alexander von Humboldt on deforestation leading to desiccation.  Cullen was greatly interested in applying science to economic pursuits and his interest in geology led to the discovery of graphite deposits in Kerala. Cullen also helped obtain specimens for museums in Britain. William Henry Sykes requested him to send samples of Roman gold coins discovered in 1851 at a village on a hill about ten miles east of Cannanore. These gold coins were deposited in the Museum of the East India Company.Parliamentary discussions 10 June 1864 Cullen was responsible for the introduction of tea cultivation in the Ashambu and Velimala hills. This plantation was later continued by Grant and Fraser who set up commercial operations in 1864-65."]}, {"page": "Thomas Glanville Taylor", "response": ["Taylor was appointed director of the East India Company's observatory at Madras, arriving there on 15 September 1830. He brought with him  new equipment including transit telescopes and a mural circle. He worked with four Indian assistants, who took observations when he went to join the Great Trigonometrical Survey. Taylor collaborated with John Caldecott of the Travancore observatory to make observations on the magnetic field, especially the magnetic equator, of the earth around 1837."]}, {"page": "Alexander Crichton Mitchell", "response": ["In 1890, he went to Trivandrum, in India, where he taught physics at the Maharaja's College. He also took up the position of director of the Trivandrum Observatory which had been established by John Caldecott and later headed by John Allan Broun before it fell into disuse. He married Agnes Farquharson Robertson (d. 1948) on 2 May 1892 and the couple had three children, all of whom were born in Trivandrum."]}, {"page": "Trivandrum Observatory", "response": ["The Trivandrum Observatory or Thiruvananthapuram Astronomical Observatory is a scientific and astronomical observation station that was established by the Raja of Travancore Swathi Thirunal Rama Varma in 1836-37. The Raja wrote to the British Resident, Colonel James Stuart Fraser, an amateur scientist proposing the establishment of an astronomical observatory. This led to John Caldecott who earlier ran a small personal observatory at Allepey being appointed as the royal astronomer. The observatory was located on the highest point in the city and opposite the palace and was considered important as the magnetic equator at that time passed through Trivandrum. The observatory was designed by Lieutenant W H Horsley of the Madras Engineers."]}, {"page": "Caldecott, John", "response": ["#redirectJohn Caldecott"]}]}}