{"wiki_id": "http://www.wikidata.org/entity/Q1356381", "itemLabel": "Ernest Henry Wilson", "itemDescription": "botanist (1876-1930)", "wikipedia_url": "https://en.wikipedia.org/wiki/Ernest_Henry_Wilson", "wikipedia_page": {"main": "Ernest Henry \"Chinese\" Wilson (15 February 1876 – 15 October 1930), better known as E. H. Wilson, was a notable British plant collector and explorer who introduced a large range of about 2000 Asian plant species to the West; some sixty bear his name.", "link_mentions": [{"page": "List of explorers", "response": ["|Ernest Henry Wilson"]}, {"page": "List of botanists", "response": ["*Ernest Henry Wilson"]}, {"page": "Aston University", "response": ["*Ernest Henry Wilson, notable plant collector and explorer"]}, {"page": "Yakushima", "response": ["* Ernest Henry Wilson - Wilson stump"]}, {"page": "Taxaceae", "response": ["Taxaceae is now generally included with all other conifers in the order Pinales, as DNA analysis has shown that the yews are phylogenetically nested in the Pinales, a conclusion supported by micromorphology studies. Formerly they were often treated as distinct from other conifers by placing them in a separate order Taxales.  Ernest Henry Wilson referred to Taxaceae as \"taxads\" in his 1916 book. Taxaceae is thought to be the sister group to Cupressaceae, from which it diverged during the early-mid Triassic. The clade comprising both is sister to Sciadopityaceae, which diverged from them during the early-mid Permian."]}, {"page": "Birmingham Botanical Gardens, England", "response": ["*Ernest Henry Wilson"]}, {"page": "Japan–United Kingdom relations", "response": ["*Ernest Henry Wilson - Plant Collector who brought 63 sakura to the West from 1911 - 1916, the  also has his namesake"]}, {"page": "Charles Sprague Sargent", "response": ["In 1913, botanists Alfred Rehder & Ernest Henry Wilson published Sargentodoxa, a genus of flowering plants from China and Indo-China, belonging to the family Lardizabalaceae and was named in Charles Sprague Sargent's honour."]}, {"page": "Arnold Arboretum", "response": ["The Arboretum has a long history of supporting plant exploration in North America, East Asia, and elsewhere. Ernest Henry Wilson was among the Arboretum's most prolific collectors in the first fifty years. He led six collecting expeditions to Eastern Asia (primarily China, Japan, and Korea) between 1899 and 1919. Many of Wilson's plants still grow in the Arboretum landscape today. In 2015, the Arboretum staff launched a 10-year collecting campaign, prioritizing the collection of nearly 400 species, of which 177 have never been cultivated at the Arboretum.thumb|right|General view of Arnold ArboretumFrom 1946 to 1950 the landscape architect Beatrix Farrand was the landscape design consultant for the Arboretum. Her early training in the 1890s included time with Charles Sprague Sargent and Jackson Thornton Dawson, the chief propagator and superintendent .Nolan 1995. pp.34-37, 204-09, 213 Today the Arboretum occupies  of land divided between four parcels, viz. the main Arboretum and the Peters Hill, Weld-Walter and South Street tracts. The collections are located primarily in the main Arboretum and on the Peters Hill tract. The Arboretum remains one of the finest examples of a landscape designed by Frederick Law Olmsted. Olmsted's office, now known as the Frederick Law Olmsted National Historic Site, is located in nearby Brookline.", "At present, the living collections include 14,980 individual plants (including nursery holdings) belonging to 10,117 accessions representing 3,924 taxa; with particular emphasis on the ligneous species of North America and eastern Asia. Historic collections include the plant introductions from eastern Asia made by Charles Sprague Sargent, Ernest Henry Wilson, William Purdom, Joseph Hers, and Joseph Rock. Recent introductions from Asia have resulted from the 1977 Arnold Arboretum Expedition to Japan and Korea, the 1980 Sino-American Botanical Expedition to western Hubei Province, and more recent expeditions to China and Taiwan.", "The inventory of living collections is updated periodically and made available to sister botanical gardens and arboreta on request; it is also available on the Arboretum's website (searchable inventory ). Arnoldia, the quarterly magazine of the Arnold Arboretum, frequently publishes articles relating to the living collections. Publication of a journal targeting more scientific audience, Journal of the Arnold Arboretum, established in 1919 with Charles Sprague Sargent as editor-in-chief, was suspended in 1990, when it was incorporated into Harvard Papers in Botany (HPB). The 71 volumes are available online at the Biodiversity Heritage Library. The Journal of the Arnold Arboretum published \"notes on trees and shrubs with descriptions of new species and their relationships, letters from correspondents, and notes on the vegetation of countries visited by officers and agents of the Arboretum.\" Other editors of the journal include Albert Charles Smith, Clarence Emmeren Kobuski, Bernice Giduz Schubert, and Carroll Emory Wood Jr. (The first issue of the Journal of the Arnold Arboretum contained contributions by Camillo Karl Schneider, Ernest Henry Wilson, Alfred Rehder, and C. S. Sargent.)"]}, {"page": "Highdown Gardens", "response": ["The gardens were created during a period when expeditions were going to China and the Himalayas collecting rare and interesting plants. Many of the original plants from the early collections are in the garden today, particularly plants collected by Reginald Farrer and Ernest Henry Wilson."]}, {"page": "Acer griseum", "response": ["Acer griseum was introduced to cultivation in Europe in 1901 by Ernest Henry Wilson for the Veitch Nurseries in the UK, and to North America shortly after. It is one of many species of maples widely grown as ornamental plants in temperate regions. It is admired for its decorative exfoliating bark, translucent pieces of which often stay attached to the branches until worn away. It also has spectacular autumn foliage which can include red, orange and pink tones. Cultivars include the columnar Copper Rocket."]}, {"page": "Berberis verruculosa", "response": ["Berberis verruculosa is a shrub up to 100 cm tall, with yellow spines along the twigs. Leaves are 1.5–2 cm long, hard, leathery, glossy dark green above, vivid white below with stomatal wax; in cold winter weather, the leaves may turn purplish-green above on exposed shoots. The flowers are small, yellow, and mature into dark purple berries 6–10 mm long.William Botting Hemsley & Ernest Henry Wilson. 1906. Bulletin of Miscellaneous Information Kew 1906(5): 151."]}, {"page": "Lilium regale", "response": ["Lilium regale, called the regal lily, royal lily, king's lily, or, in New Zealand, the Christmas lily, is a species of flowering plant in the lily family Liliaceae, with trumpet-shaped flowers. It is native to the western part of Sichuan Province in southwestern China,Kew World Checklist of Selected Plant FamiliesFlora of China, Vol. 24 Page 147 岷江百合 min jiang bai he Lilium regale E. H. Wilson, Gard. Chron. ser. 3, 53: 416. 1913.  and cultivated elsewhere as an ornamental. It was introduced to England in 1903 by Ernest Henry Wilson.Wilson, Ernest Henry 1905.  Flora et Silva 3: 330, plate 1, as Lilium myriophyllumWilson, Ernest Henry. 1913. Lilium regale. Gardeners' Chronicle: a weekly illustrated journal of horticulture and allied subjects. ser. 3 53: 416 description and commentary in English; photograph of flowering specimen"]}, {"page": "Alfred Rehder", "response": ["Collaborating closely with Charles Sprague Sargent, Rehder launched the Journal of the Arnold Arboretum, which appeared as a quarterly from 1919 to 1990. The journal had a particular focus on dendrology but also covered other botanical fields. He was instrumental in systematizing the thousands of plants collected by Ernest Henry Wilson in China.", "Rehder also produced The Bradley Bibliography: A Guide to the Literature of the Woody Plants of the World Published Before the Beginning of the Twentieth Century (5 vols., 1911–18).The Bradley Bibliography online; see also Howard, Richard A. (1975) The Arnold Arboretum. Botanical Society of America Plant Science Bulletin. June, 1975. Vol. 21 No. 2  – URL retrieved February 26, 2006 He was co-author, with Ernest Henry Wilson, of Plantae Wilsonianae: An Enumeration of the Woody Plants Collected in Western China for the Arnold Arboretum of Harvard University During the Years 1907, 1908, and 1910 (3 vols., 1913, 1916–17) and A Monograph of Azaleas: Rhododendron subgenus Anthodendron (1921).History of Horticulture – Ernest Henry Wilson  – URL retrieved February 26, 2006  Finally, he authored Synopsis of the Genus Lonicera (1903)."]}, {"page": "Maxwell T. Masters", "response": ["His most famous works are perhaps Vegetable Teratology, which dealt with teratology (abnormal mutations) of vegetable species, and several works on Chinese plants (particularly conifers), describing many of the new species discovered by Ernest Henry Wilson."]}, {"page": "E. H. Wilson", "response": ["#redirect Ernest Henry Wilson"]}, {"page": "E.H. Wilson", "response": ["#redirect Ernest Henry Wilson"]}, {"page": "Victoria Medal of Honour", "response": ["**Ernest Henry Wilson (1876–1930) "]}, {"page": "Harry Veitch", "response": ["In 1898 the firm of James Veitch & Sons was formed into a limited company, of which Harry's nephew, James Herbert Veitch became managing director. One of the first steps taken by the new company, in accordance with the firm's earlier practice, was to send out Ernest Henry Wilson to China and Tibet to collect plants.thumb|right", "The gardens at Caerhays Castle, Cornwall, the home of John Charles Williams, (M.P. for Truro), was planted with seeds donated by Harry Veitch from those brought back from China by Ernest Henry Wilson in 1903."]}, {"page": "List of Trinity College (Connecticut) people", "response": ["* Ernest Henry Wilson, botanist"]}, {"page": "List of authors of South African botanical taxa", "response": ["*Ernest Henry Wilson (1876–1930) S ........ E.H.Wilson"]}, {"page": "Prunus × yedoensis", "response": ["In 1900,  gave the Yoshino cherry the name Somei-yoshino after the famous place of cultivation, Somei village (current day Toshima) and famous place of Prunus jamasakura, Mount Yoshino. In 1901, Yoshino cherry was given a scientific name Prunus yedoensis by Jinzō Matsumura. However, after Ernest Henry Wilson suggested Yoshino cherry is a hybrid between Prunus subhirtella var. ascendens (Edo higan) and Prunus lannesiana (Oshima zakura) in 1916, Yoshino cherry came to be called Prunus × yedoensis. As for the Korean native cherry called King cherry which was given a scientific name Prunus yedoensis var. nudiflora by a German botanist Bernhard Adalbert Emil Koehne in 1912 continues to be called Prunus yedoensis.", "*In 1916, Ernest Henry Wilson concluded that Yoshino cherry strongly suggests a hybrid between Prunus subhirtella var. ascendens Wilson (Edo higan) and Prunus lannesiana Wilson (Oshima zakura). It has many characters of the latter and in its venation, pubescence and shape of the cupula resembles the former"]}, {"page": "Ernest Wilson", "response": ["*Ernest Henry Wilson (1876–1930), English botanist, best known as E. H. Wilson"]}, {"page": "Hōkō-ji (Kyoto)", "response": ["*Ernest Henry Wilson – "]}, {"page": "Paeonia obovata", "response": ["Karl Maximovich in 1859 was the first to describe this species, based on a specimen collected in the Amur Oblast, and it had rose-purple flowers. In 1879, Spencer Le Marchant Moore created P. oreogeton, and his type came from Kuandian. A variety with white petals was discovered on Honshu by Tomitaro Makino and named P. obovata var. japonica in 1898, but Hisayoshi Takeda thought it in 1910 deserving to be recognised as its own species, P. japonica. Otto Stapf described P. willmottiae in 1916 based on a specimen from the garden of Miss Willmott, that was raised from seed that had been collected by Ernest Henry Wilson in China. P. vernalis, from Far East Russia (Nikolsk-Ussuria), was described by Karl Mandle in 1921. Nikolai Schipczinsky thought only four species to be present in Russia: P. obovata, P. japonica, P. oreogeton and P. vernalis. F.C. Stern revised this group of names in 1946, and suggested to merge P. oreogeton and P. vernalis with P. obovata, and to reduce P. willmottiae to a variety, but retained P. japonica. Wen-Pei Fang in 1958 disagreed and thought P. willmottiae needed to be retained as a species. Nearly all Japanese authors, such as Jisaburo Ohwi in 1978, thought there were two species in Japan, each with two subtaxa: P. obovata var. obovata and var. glabra, and P. japonica var. japonica and var. pilosa. More recently however, Chinese botanists regarded all these types as belonging to the same species (or conspecific).", "The plant hunter Ernest Henry Wilson introduced Paeonia obovata in Europe in 1900 and it has since been cultivated, initially in botanical gardens, but lately it has become available for gardeners."]}]}}