{"wiki_id": "http://www.wikidata.org/entity/Q13530024", "itemLabel": "James Pitman", "itemDescription": "British politician (1901-1985)", "wikipedia_url": "https://en.wikipedia.org/wiki/James_Pitman", "wikipedia_page": {"main": "Sir Isaac James Pitman, KBE (14 August 1901 – 1 September 1985) was a British businessman, civil servant, publisher, politician and spelling reformer.\nPitman was closely involved in the theory of teaching children to write the English language. His analysis of the teaching of handwriting to students, both in school by professional teachers, and at home by parents has several strong pedagogical theories in its intellectual background. Along with his analysis Pitman created a system of spelling that allows students to spell as words are pronounced (according to an alternative orthography for an English-language teaching alphabet). His major work on this topic is Alphabets and Reading: The Initial Teaching Alphabet (1965).\nHis thorough work has been adapted for several other uses: teaching English as a second language to adults for pronunciation and handwriting purposes, use on the Internet by alternative orthographers of English (an alternative most realisable by use of crossover systems adapted to the standard keyboard), and aesthetic uses where the writer wants to play at the conjunction of signs or symbols, and alphabet-based writing. This latter use gives rise to an aesthetics and poetics of its own, as in the Owlbirdbet Crossover system adapted to the standard keyboard, where it is more widely accessible to Internet users.\nOverall, the Pitman initial teaching alphabet (ita) points the way to the needed overall reform of English spelling, such as the Dutch accomplished in regard the writing of their own tongue some two decades ago.\nPitman was the son of Ernest Pitman and grandson of Sir Isaac Pitman, who developed the most widely used system of shorthand, known now as Pitman Shorthand. James Pitman was to become chairman and joint managing director of the Pitman Press and Pitman Publishing.\nPitman was educated at Summer Fields School, Eton College and Christ Church, Oxford. He excelled in athletics, won the Public Schools middleweight boxing championship of 1919 and gained his 'blue' at Oxford University in rugby union which he also played for England against Scotland.\nIn 1934 he became chairman of Sir Isaac Pitman & Sons, a post he held until 1966. He was a director of Boots Pure Drug, Bovril and the Equity and Law Life Assurance Society. He wrote several books on the teaching of English and is best known as the inventor of the Initial Teaching Alphabet. The educational institutes with which he was involved, often as president or chairman, included the British and Foreign School Society, the British Association for Commercial and Industrial Education, the National Association for the Advancement of Education for Commerce, the Committee of the Simplified Spelling Society and the Initial Teaching Alphabet Foundation.\nDuring World War II Pitman was a Squadron Leader in the RAFVR. He became a Director of the Bank of England in 1941 until after 1945 and was Director of Organization and Methods at HM Treasury 1943–5.\nAt the 1945 general election, Pitman was elected as Conservative Member of Parliament (MP) for Bath. In the House of Commons, he championed spelling reform, working with the Labour MP, Mont Follick, to promote the cause of the Simplified Spelling Society.\nPitman retired from Parliament in 1964. He continued to serve on several company boards. He also served as chairman of the management committee of the University of London Institute of Education. He was pro-chancellor of the University of Bath 1972–81 and ensured that the Pitman papers would reside with the university. The university had awarded him an Honorary Degree (Doctor of Letters) in 1970.Pitman married the Hon. Margaret Beaufort Johnston, the daughter of George Lawson Johnston, 1st Baron Luke, in 1927 and had three sons and a daughter.", "link_mentions": {}}}