{"wiki_id": "http://www.wikidata.org/entity/Q13529989", "itemLabel": "Michael Mates", "itemDescription": "British politician (born 1934)", "wikipedia_url": "https://en.wikipedia.org/wiki/Michael_Mates", "wikipedia_page": {"main": "Michael John Mates (born 9 June 1934) is a Conservative Party politician who was the Member of Parliament (MP) for the constituency of East Hampshire from 1974 to 2010. He was a minister at the Northern Ireland Office from 1992 to 1993, resigning after his support for failed businessman Asil Nadir damaged his reputation. After his long career at Westminster, Mates lost the election for police commissioner in Hampshire in August 2012.\n\n", "link_mentions": [{"page": "List of political scandals in the United Kingdom", "response": ["* Michael Mates gift of a watch (\"Don't let the bastards grind you down\") to Asil Nadir (1993)"]}, {"page": "June 9", "response": ["*1934 – Michael Mates, English colonel and politician"]}, {"page": "Michael Heseltine", "response": ["During this period Heseltine enjoyed excellent relations with the media: among TV journalists he was in regular touch with Elinor Goodman of Channel 4 News (herself a former Haymarket employee), James Mates of ITN (son of his lieutenant Michael Mates) and John Cole, whilst among print journalists he was close to his old friend Anthony Howard (Deputy Editor of the Observer), Peter Jenkins, and especially close to Anthony Bevins of The Independent and the young Alastair Campbell of the Daily Mirror.Crick 1997, p. 317.", "Heseltine's resignation in January 1986 had been just before the only occasion on which the Poll Tax was discussed in Cabinet. He spoke against the tax when it was enacted into law in 1987–1988, but abstained rather than voting against as Edward Heath  did, although he voted for Michael Mates' amendment which tried to introduce an element of banding according to ability to pay. Heseltine remained aloof from factional plotting in the Commons, and voted with the left-wing Lollard faction in backbench committee elections.Crick 1997, pp. 306–7. Heseltine later said that he regretted resigning from the Cabinet in 1986, as he subsequently often wondered if he and Nigel Lawson might have been able to persuade Thatcher to abandon the tax.", "Heseltine disappointed many of his supporters by not pushing for them to get jobs in Major's new administration. Ian Grist was sacked from the Welsh Office and Michael Mates was eventually given a Minister of State position after the 1992 election. There were suggestions that Heseltine might be appointed Home Secretary, but Heseltine advertised his lack of interest in the position, and Major insisted that he had not offered it to him. By contrast, his enthusiasm for industrial policy made it impossible for him to be appointed Secretary of State for Trade and Industry, the job he most coveted.Crick 1997, p. 362.", "In mid-1995 Major challenged his critics to \"put up or shut up\" by resubmitting himself to a leadership election in which he was unsuccessfully opposed by John Redwood the Secretary of State for Wales. There was speculation that Heseltine's supporters would engineer Major's downfall in the hope that their man would take over, but they stayed loyal to Major. Heseltine had been listening to regular reports about his potential support from his lieutenants Keith Hampson, Richard Ottaway, Michael Mates and Peter Temple-Morris, and in the event of a second ballot hoped to receive Major's endorsement. Peter Tapsell refused to support him because of the European issue. Hampson believed that Heseltine might have won, as did Philip Stephens of the Financial Times. Michael Crick does not agree, pointing out that many of Heseltine's supporters from 1990 had retired from the Commons and the 1992 intake was more right-wing and eurosceptic.Crick 1997, pp. 414–7."]}, {"page": "List of MPs elected in the 2001 United Kingdom general election", "response": ["| Michael Mates", "| Michael Mates"]}, {"page": "List of current members of the British Privy Council", "response": ["| Michael Mates"]}, {"page": "List of MPs elected in the 1992 United Kingdom general election", "response": ["|Michael Mates"]}, {"page": "List of MPs elected in the 1997 United Kingdom general election", "response": ["|Michael Mates"]}, {"page": "Paul Goodman (politician)", "response": ["In 1977 he worked for a year as a researcher to the Conservative MP at Petersfield, Michael Mates. In 1983 he was the chairman for the Federation of Conservative Students, and was appointed as a director of public affairs at Extel Consultancy in 1984, before becoming a researcher for two years to Tom King, the Secretary of State for Northern Ireland and MP for Bridgwater in 1985. He was a briefly a member of the policy unit at the City of Westminster Council in 1988 before training as a novice monk at Quarr Abbey in Ryde on the Isle of Wight. He left the abbey in 1990 to take up the position of news editor with the Catholic Herald, before becoming a lead writer with The Daily Telegraph in 1991, moving to be a reporter with The Sunday Telegraph in 1992, before returning to The Daily Telegraph as a comment editor in 1995, remaining as a leader writer since his election to Westminster."]}, {"page": "List of MPs elected in the 1987 United Kingdom general election", "response": ["|Michael Mates"]}, {"page": "List of MPs elected in the 1983 United Kingdom general election", "response": ["| Michael Mates"]}, {"page": "List of MPs elected in the 1979 United Kingdom general election", "response": ["|Lt.-Col. Michael Mates"]}, {"page": "List of MPs elected in the October 1974 United Kingdom general election", "response": ["|Lt.-Col. Michael Mates"]}, {"page": "Dolphin Square", "response": ["Politicians who have lived in the development include Harold Wilson, David Steel, William Hague, Estelle Morris, Beverley Hughes, Michael Mates, John Langford-Holt and Iain Mills. (Mills died in his flat in the square's Duncan House.)"]}, {"page": "List of Privy Counsellors (1952–present)", "response": ["*Michael Mates (b. 1934)"]}, {"page": "Blundell's School", "response": ["*Michael Mates, former MP (constituency of East Hampshire)"]}, {"page": "List of MPs elected in the 2005 United Kingdom general election", "response": ["| East Hampshire || Michael Mates || Conservative || Michael Mates || Conservative"]}, {"page": "Back to Basics (campaign)", "response": ["* In May 1993 Michael Mates, a junior minister in the Northern Ireland office, resigned over his links to Asil Nadir, a UK-based Northern Cypriot businessman who later fled the country after an indictment by the Serious Fraud Office."]}, {"page": "Michael Crick", "response": ["In Summer 2013, he reported that a file on the Conservative politician Michael Mates had been sent to the Crown Prosecution Service concerning alleged offences committed during his candidacy in the Police and Crime Commissioner elections in 2012 for the post in Hampshire and the Isle of Wight.Michael Crick \"Police send election file on Michael Mates to CPS\", Channel 4 News, 14 June 2013"]}, {"page": "1990 Conservative Party leadership election", "response": ["Heseltine was proposed by Neil Macfarlane (who had been a leading Thatcher backer in the 1975 contest) and Peter Tapsell. His campaign was run by Keith Hampson, Michael Mates and Peter Temple-Morris. He proposed a complete review of the poll tax but rejected Thatcher's proposal of a referendum on British membership of the mooted single European currency. Thatcher gave an interview to The Times in which she attacked his corporatist views, which made her appear extreme. Heseltine canvassed hard around Parliament whilst Thatcher was away at the Fontainebleau summit.", "The Cabinet agreed that if Heseltine became party leader, it would divide the party even further; and that one of its present members should succeed Thatcher. The only Cabinet member to endorse Heseltine for the second ballot was the Welsh Secretary, David Hunt, who had not been party to the agreement as he had been away in Tokyo. Four junior ministers openly backed Heseltine: the Welsh Office ministers Wyn Roberts and Ian Grist, and David Trippier and David Leigh. Heseltine was also endorsed by a number of senior ex-ministers including: Sir Geoffrey Howe, Nigel Lawson, Lord Carrington (who as a peer had no vote), Peter Walker, David Howell, Ian Gilmour, Norman Fowler, Geoffrey Rippon, Jim Prior, Norman St John-Stevas and Paul Channon, but he had less support among younger MPs amongst whom he had done little to canvass support. Heseltine's campaign chairman Michael Mates was away for five days in the Middle East with the Defence Select Committee, of which he was chairman, so Heseltine's campaign did not have the cohesion of Major's, which was run by Norman Lamont. Heseltine's supporters, besides being older than those of the other candidates, tended to be pro-Europeans with a few populist backbenchers like David Evans, Tony Marlow and John Wilkinson."]}, {"page": "List of United Kingdom MPs: M", "response": ["*Michael Mates"]}, {"page": "Corporals killings", "response": ["Northern Ireland Secretary Tom King acknowledged that the Milltown Cemetery attack and the killing of Wood and Howes were \"wholly unacceptable and do require immediate review in regard to policing to be followed at any future funeral.\" Conservative MP Michael Mates nonetheless defended the \"hands off\" policy, saying \"A return to heavy-handed policing could provoke riots, which is what the IRA want so they can say to the world 'They won't even let us bury our dead in peace.'\" Fine Gael leader Alan Dukes, Labour leader Dick Spring and Taoiseach Charlie Haughey all condemned the killings. The British prime minister at the time, Margaret Thatcher, called the killings \"an act of appalling savagery\"."]}, {"page": "Hope and Homes for Children", "response": ["In 2010, former Defence Minister The Rt. Hon. Michael Mates with William Godfree performed Flanders and Swann songs in aid of the charity."]}, {"page": "East Hampshire (UK Parliament constituency)", "response": ["The first MP was (by election) Michael Mates, who held it from 1983 until the calling of the 2010 election when he retired.", "| Michael Mates"]}, {"page": "James Mates", "response": ["Amongst his first assignments on becoming a reporter was to cover the Zeebrugge ferry disaster. He spent five weeks in Zeebrugge in 1987 during the operation to raise the capsized ferry 'Herald of Free Enterprise'. Another major assignment was to cover the UK's failed extradition attempt from the Republic of Ireland of Father Patrick Ryan in 1989. The failure was attributed to prejudicial comments made in Parliament by his father, Lieutenant Colonel Michael Mates, MP, which implied that Ryan was a terrorist. Prime Minister Margaret Thatcher compounded the damage done by Mates' comments at PMQs on 29 November 1988.PM \"abused Question Time\" to make a statement on the extradition of Father Patrick Ryan In October 1989, the Irish government refused the extradition request on the grounds that Ryan would not get a fair trial in Britain.Irish Republic refuses Patrick Ryan's extradition", "Mates is the son of Conservative party politician Michael Mates. He lives in London with his wife Fiona and three children (Leo, Flora and Charlie). He married in May 1991. Mates enjoys playing bridge and plays mostly at the Andrew Robson Bridge Club in West London."]}, {"page": "1993 in the United Kingdom", "response": ["** Northern Ireland Minister Michael Mates resigns over links with fugitive tycoon Asil Nadir."]}, {"page": "Keith Hampson", "response": ["He was elected the MP for Ripon in February 1974, a seat that the Liberals had gained in a by-election the previous year. The constituency was abolished for the 1983 general election, and Hampson was then elected for Leeds North West. Hampson was PPS to Michael Heseltine, then Defence Secretary, when he was involved in a May 1984 incident in a gay theatre club in Soho where Hampson \"accidentally brushed\" the thigh of an undercover police officer. Although the court case against him was dropped, Hampson was forced to resign as PPS. In 1990, with Michael Mates, Hampson ran Heseltine's Conservative Party leadership campaign.Donald MacIntyre and Nick Cohen \"Sleaze, smears, Saudis, leaks and dodgy money\", The Independent, 27 June 1993 At the 1997 general election he was defeated by Labour candidate Harold Best."]}, {"page": "Malaysian Service Medal", "response": ["A second Early day motion by Michael Mates, MP was made the next day. \"That this House applauds the generous gesture by the King and Government of Malaysia in the award of the Pingat Jasa Malaysia medal to British citizens for service in the Malayan Emergency; notes that Her Majesty The Queen has been graciously pleased to approve the recommendation of the Committee on the Grant of Honours, Decorations and Medals that British citizens may accept the award; is, however, surprised that the Committee did not recommend that British citizens receiving the award should also be able to wear it; is deeply embarrassed that the Australian and New Zealand veterans of the Emergency may both receive and wear the medal; invites the Committee to reconsider the matter, bearing in mind the diminishing number of those who gave valuable service between 31 August 1950 and 12 August 1966; believes that this is a pre-eminent case for an exception to the long-standing Government policy enunciated in the written Ministerial Statement of 31 January 2006; and urges Her Majesty's Ministers to ensure that a further recommendation is made to Her Majesty, but this time one which takes full account of the generosity of a fellow Commonwealth country, the merits of the case, and the deep sense of hurt felt by British veterans, rather than being based upon a slavish observance of precedent.\""]}, {"page": "Defence Select Committee", "response": ["|Michael Mates"]}, {"page": "Petersfield (UK Parliament constituency)", "response": ["| Michael Mates"]}, {"page": "Polly Peck", "response": ["A government minister, Michael Mates, resigned in 1993 following persistent press coverage of his close links to Asil Nadir which had led to Mates writing to the attorney general questioning the handling of the investigation by the Serious Fraud Office. Asil Nadir has persistently claimed that the charges that he stole more than £30m from the company are \"baseless\" and has claimed that the SFO abused its powers, making a fair trial impossible. In 2002 the accounting disciplinary body, the Joint Disciplinary Tribunal, fined Stoy Hayward £75,000 for its role as group auditor to Polly Peck. Erdal & Co, the north Cypriot accounting firm was also fined for its audit of the north Cypriot subsidiaries of Polly Peck in 1988 and 1999. In July 2010 it was reported that Asil Nadir intended to seek bail to return to the United Kingdom to face the 66 counts of theft."]}, {"page": "Dispatches (TV programme)", "response": ["Dispatches also covered the Israel Lobby's alleged influence on the BBC and other British media and further claimed that many media outlets were frightened of broaching the lobby.  The Conservative MP Michael Mates said: \"The pro-Israel lobby … is the most powerful political lobby. There's nothing to touch them.\""]}, {"page": "1993 in Northern Ireland", "response": ["* 24 June - Northern Ireland Minister Michael Mates resigns over links with tycoon Asil Nadir."]}, {"page": "Damian Hinds", "response": ["At the 2010 general election, Hinds was elected Member of Parliament for East Hampshire, getting 56.8% of the vote (an increase of 9.7%) and achieving a swing from the Liberal Democrats to the Conservative Party of 6.6%. The previous Conservative MP, Michael Mates, had stood down at the election."]}]}}