{"wiki_id": "http://www.wikidata.org/entity/Q13563118", "itemLabel": "Mary Soon Lee", "itemDescription": "British writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Mary_Soon_Lee", "wikipedia_page": {"main": "Mary Soon Lee (born 1965) is a British speculative fiction writer and poet.", "link_mentions": [{"page": "List of science-fiction authors", "response": ["*Mary Soon Lee (born 1965)"]}, {"page": "List of fantasy authors", "response": ["* Mary Soon Lee, (born 1965) author of The Sign of the Dragon"]}, {"page": "Sword and Sorceress series", "response": ["* \"The Hollow Dancer\"—Mary Soon Lee", "* \"The Fall of the Kingdom\"—Mary Soon Lee", "* \"Shen's Daughter\"—Mary Soon Lee"]}, {"page": "Rhysling Award", "response": ["*2014: Mary Soon Lee,  Interregnum", "*2018: Mary Soon Lee, \"Advice to a Six-year-old\""]}, {"page": "Eclectica Magazine", "response": ["Eclectica has published stories by nominees for the Pulitzer Prize (Teresa White),Oct/Nov 2007 Contributor's Notes the Nebula Award (Mary Soon Lee)Vol. 1, No. 5 and the Pushcart Prize."]}, {"page": "Tachyon Publications", "response": ["From 1992-1994, Weisman also published Thirteenth Moon magazine, which featured short stories, poetry and essays by authors including Vicki Aron, Michael Astrov, M.J. Atkins, Simon Baker, Michael Bishop, Fred Branfman, Lela E. Buis, Paul Di Filippo, Linda Dunn, Alma Garcia, Lisa Goldstein, Brice Gorman, John Grey, Eva Hauser, Deborah Hunt, Knute Johnson, Lewis Jordan, Ursula K. Le Guin, Mary Soon Lee, Pamela Lovell, David Nemec, Lyn Nichols, Robert Patrick, David Sandner, Brian Skinner, Lia Smith, P. Stillman, Rob Sullivan, Pat Toomay, Inti Valverde, Peter Weverka and Wayne Wightman."]}, {"page": "Year's Best SF 4", "response": ["*Mary Soon Lee: \"The Day Before They Came\" (First published in Interzone, 1998)"]}, {"page": "Year's Best SF 5", "response": ["*Mary Soon Lee: \"Lifework\" (First published in Interzone, 1999)"]}, {"page": "Mary Lee", "response": ["*Mary Soon Lee (born 1965), British speculative fiction writer and poet"]}, {"page": "Kenneth Chiacchia", "response": ["He is also a dog handler in Allegheny Mountain Rescue League, a Pittsburgh-based volunteer organization that assists authorities in civilian lost-person searches.http://www.amrg.info/ His work has been noted in local newspapers.http://search.post-gazette.com/redir.asp?path=/pg/06239/716761-85.stm&date=8/27/2006+7:01:00+AM http://search.post-gazette.com/redir.asp?path=/neigh_north/20020406rescue0408p2.asp&date=4/8/2002+4:48:27+AM He has written on the science of olfaction for search and rescue workers. In 1993, Chiacchia joined the Pittsburgh Worldwrights Writers' Workshop founded by Pittsburgh science-fiction and fantasy writer Mary Soon Leehttps://www.cs.cmu.edu/~mslee/cr.html. and continued by Pittsburgh author Barton Paul Levenson and others. Chiacchia won the 2008 Carnegie Science Center Journalism Award."]}, {"page": "Elizabeth Humphreys Penrose", "response": ["Elizabeth Humphreys Penrose (born December 30, 1960) is an American writer of poetry in the science fiction genre. She is a long-standing member of one of Pittsburgh's oldest Science-Fiction and Fantasy Writer's Workshops, Carnegie-Mellon University-based Pittsburgh Worldwrights, which was founded by Mary Soon Lee and includes Pittsburgh science fiction writers Barton Paul Levenson and Kenneth Chiacchia among its members, see Pittsburgh#Writing. Penrose was raised in Pittsburgh, Pennsylvania. She is a graduate of the University of Pittsburgh with a Bachelor's in English and Master's in English Literature."]}, {"page": "Dark Regions Press", "response": ["*Mary Soon Lee"]}, {"page": "Spectrum SF", "response": ["The magazine published work by Charles Stross, Eric Brown, Mary Soon Lee, Alastair Reynolds, and Stephen Baxter. Spectrum SF published the first appearance of the Laundry Files in The Atrocity Archive from Stross."]}]}}