{"wiki_id": "http://www.wikidata.org/entity/Q1359926", "itemLabel": "Tebbs Lloyd Johnson", "itemDescription": "British racewalker", "wikipedia_url": "https://en.wikipedia.org/wiki/Tebbs_Lloyd_Johnson", "wikipedia_page": {"main": "Terence Lloyd \"Tebbs Lloyd\" Johnson  ('7 April 1900, Melton Mowbray, Leicestershire – 26 December 1984, Coventry, West Midlands) was a British speed-walker.\nLloyd-Johnson won the bronze medal in the 50-kilometre walk at the 1948 Summer Olympics in London at the age of 48 years and 115 days, becoming the oldest Olympic medal-winning athlete.  He had also competed in the same event at the 1936 Summer Olympics, finishing 17th behind younger teammate Harold Whitlock.\nJohnson and Whitlock crossed paths in their career many times.  Earlier in 1936, Johnson defeated Whitlock in the British Racewalking Association 50K walk by a mere 4 seconds only to be disqualified for loss of contact in the final stages of the race.  Johnson had won the championship in 1931, 1934 and again in 1949.  After losing to Johnson in 1931, Whitlock won in 1933 and 1935-1939 (including the 1936 race) until the outbreak of World War II when the race was discontinued.  Whitlock's official time from that 1936 race 4:30:38 was the British record for 20 years, which would have been Johnson's had he not been DQed.  Johnson had also won the RWA 20 mile walk in 1927, 1931 and 1934.  Johnson succeeded Whitlock as the national coach.  He also served as RWA president.\nJohnson continued walking until he was 70.\n\n", "link_mentions": [{"page": "April 7", "response": ["*  1900   – Tebbs Lloyd Johnson, English race walker (d. 1984)"]}, {"page": "Great Britain at the 1948 Summer Olympics", "response": ["|align=left|Tebbs Lloyd Johnson"]}, {"page": "Harold Whitlock", "response": ["His main achievement came in 1936, where he won the gold medal in the 50 kilometre walk at the Summer Olympics held in Berlin, Germany, representing Great Britain, finishing in a time of 4 hours, 30 minutes, 41.4 seconds. He gained this victory despite being affected by sickness about 38 kilometres into the race. This sickness, apparently food-related, also affected his fellow British competitors Tebbs Lloyd Johnson and Joe Hopkins."]}, {"page": "List of masters athletes", "response": ["* Tebbs Lloyd Johnson "]}, {"page": "Athletics at the 1936 Summer Olympics – Men's 50 kilometres walk", "response": ["| 17||align=left| Tebbs Lloyd Johnson ||align=left|  || 4:54:56.0 ||"]}, {"page": "Athletics at the 1948 Summer Olympics – Men's 50 kilometres walk", "response": ["|  ||align=left|Tebbs Lloyd Johnson || align=left|  || 4:48:31 || "]}, {"page": "Tebbs Lloyd-Johnson", "response": ["#REDIRECT Tebbs Lloyd Johnson"]}, {"page": "Lloyd Johnson", "response": ["*Tebbs Lloyd Johnson (1900–1984), British speedwalker"]}, {"page": "Terence Lloyd Johnson", "response": ["#REDIRECT Tebbs Lloyd Johnson"]}, {"page": "Terence \"Tebbs\" Lloyd Johnson", "response": ["#REDIRECT Tebbs Lloyd Johnson"]}, {"page": "Terence Tebbs Lloyd Johnson", "response": ["#REDIRECT Tebbs Lloyd Johnson"]}, {"page": "Tebbs", "response": ["* Tebbs Lloyd Johnson (1900–1984), British speed-walker"]}]}}