{"wiki_id": "http://www.wikidata.org/entity/Q1353724", "itemLabel": "John Hunter", "itemDescription": "Royal Navy officer and governor (1737-1821)", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Hunter_(Royal_Navy_officer)", "wikipedia_page": {"main": "Vice Admiral John Hunter (29 August 1737 – 13 March 1821) was an officer of the Royal Navy, who succeeded Arthur Phillip as the second Governor of New South Wales, serving from 1795 to 1800.Both a sailor and a scholar, he explored the Parramatta River as early as 1788, and was the first to surmise that Tasmania might be an island. As governor, he tried to combat serious abuses by the military in the face of powerful local interests led by John MacArthur. Hunter's name is commemorated in historic locations such as Hunter Valley and Hunter Street, Sydney.\n\n", "link_mentions": [{"page": "Arthur Phillip", "response": ["On 25 October 1786 the 20 gun , lying in the dock at Deptford, was commissioned, and the command given to Phillip. The armed tender  under command of Lieutenant Henry Lidgbird Ball was also commissioned to join the expedition. On 15 December, Captain John Hunter was assigned as second captain to Sirius to command in the absence of Phillip, whose preference, it was to be supposed, would be requisite at all times wherever the seat of government in that country might be fixed.", "The Governor also expanded the settlements knowledge of the landscape, two officers from Sirius Captain John Hunter and Lieutenant William Bradley conducted a thorough survey of the harbour at Sydney Cove. Phillip later joined them on an expedition to survey Broken Bay."]}, {"page": "Governor of New South Wales", "response": ["In addition to the primary Sydney vice-regal residence, many governors had also felt the need for a 'summer retreat' to escape the hard temperatures of the Sydney summers. In 1790, Governor Phillip had a secondary residence built in the township of Parramatta. In 1799 the second governor, John Hunter, had the remains of Arthur Phillip's cottage cleared away, and a more permanent building erected on the same site. This residence remained occupied until the completion of the primary Government House in 1845, however the hard summers and growing size of Sydney convinced successive governors of the need for a rural residence.", "|2|| 80px|| Captain John Hunter || 11 September 1795|| 27 September 1800 || "]}, {"page": "Koala", "response": ["The first written reference of the koala was recorded by John Price, servant of John Hunter, the Governor of New South Wales. Price encountered the \"cullawine\" on 26 January 1798, during an expedition to the Blue Mountains, although his account was not published until nearly a century later in Historical Records of Australia.Moyal, p. 8 . In 1802, French-born explorer Francis Louis Barrallier encountered the animal when his two Aboriginal guides, returning from a hunt, brought back two koala feet they were intending to eat. Barrallier preserved the appendages and sent them and his notes to Hunter's successor, Philip Gidley King, who forwarded them to Joseph Banks. Similar to Price, Barrallier's notes were not published until 1897.Moyal, pp. 9–10 . Reports of the first capture of a live \"koolah\" appeared in The Sydney Gazette in August 1803.The Sydney Gazette, 21 August 1803, p.3 Within a few weeks Flinders' astronomer, James Inman, purchased a specimen pair for live shipment to Joseph Banks in England. They were described as 'somewhat larger than the Waumbut (Wombat)'. These encounters helped provide the impetus for King to commission the artist John Lewin to paint watercolours of the animal. Lewin painted three pictures, one of which was subsequently made into a print that was reproduced in Georges Cuvier's Le Règne Animal (The Animal Kingdom) (first published in 1817) and several European works on natural history.Moyal, pp. 12–13, 45 ."]}, {"page": "1821", "response": ["* March 13 – John Hunter, second Governor of New South Wales (b. 1737)"]}, {"page": "Blue Mountains (New South Wales)", "response": ["The first documented use of the name Blue Mountains appears in Captain John Hunter's account of Phillip's 1789 expedition up the Hawkesbury River. Describing the events of about 5 July, Hunter wrote: \"We frequently, in some of the reaches which we passed through this day, saw very near us the hills, which we suppose as seen from Port Jackson, and called by the governor the Blue Mountains.\"Hunter, J. (1793) An Historical Journal of the Transactions at Port Jackson and Norfolk Island. John Stockdale, London. During the nineteenth century the name was commonly applied to the portion of the Great Dividing Range from about Goulburn in the south to the Hunter Valley in the north, but in time it came to be associated with a more limited area."]}, {"page": "History of Victoria", "response": ["To clear up the question, Governor John Hunter sent George Bass to explore thoroughly the coast in a whaleboat. After reaching Wilsons Promontory and Western Port in January 1798 bad weather and lack of provisions forced him to return to Sydney. Bass returned with Matthew Flinders in December 1798 in Norfolk and sailed through the strait, proving its existence."]}, {"page": "First Fleet", "response": ["On 25 October 1786 the 20 gun , lying in the dock at Deptford, was commissioned, and the command given to Phillip. The armed tender  under command of Lieutenant Henry Lidgbird Ball was also commissioned to join the expedition. On 15 December, Captain John Hunter was assigned as second captain to Sirius to command in the absence of Phillip, whose prefence, it was to be supposed, would be requisite at all times wherever the seat of government in that country might be fixed.", "| John Hunter", "* Captain John Hunter, commander of HMS Sirius", "In September 1786 Captain Arthur Phillip was chosen to lead the expedition to establish a colony in New South Wales. On 15 December, Captain John Hunter, was appointed Phillip’s second. By now  had been nominated as flagship, with  Hunter holding command. The armed tender  under command of Lieutenant Henry Lidgbird Ball had also joined the fleet.", "On 21 January, Phillip and a party which included John Hunter, departed the Bay in three small boats to explore other bays to the north.Parker 2009, pp.115–116 Phillip discovered that Port Jackson, about 12 kilometres to the north, was an excellent site for a colony with sheltered anchorages, fresh water and fertile soil. Cook had seen and named the harbour, but had not entered it. Phillip's impressions of the harbour were recorded in a letter he sent to England later: \"the finest harbour in the world, in which a thousand sail of the line may ride in the most perfect security ...\". The party returned to Botany Bay on 23 January."]}, {"page": "Circumnavigation", "response": ["* John Hunter commanded the first ship to circumnavigate the World starting from Australia, between 2 September 1788 and 8 May 1789, with one stop in Capetown to load supplies for the colony of New South Wales.Hunter, John, An Historical Journal of the Transactions at Port Jackson and Norfolk Island, John Stockdale, London, 1793"]}, {"page": "Glass House Mountains National Park", "response": ["The first European description of the Glass House Mountains was by Lieutenant (later Captain) James Cook, when he sailed north up the east coast of Australia on his voyage of discovery in the ship HM Bark Endeavour in 1770. The shape of the mountains reminded him of the huge glass furnaces (glasshouses) back in his native Yorkshire and he named them accordingly.History of the Glasshouse Mountains In his log for 17 May 1770 he wrote:this place may always be found by three hills which lay to the northward of it in the latitude of 26 degrees 53 minutes south. These hills lay but a little way inland and not far from each other; they are very remarkable on account of their singular form of elevation which very much resembles glass houses which occasioned me giving them that name: the northernmost of the three is the highest and largest. There are likewise several other peaked hills inland to the northward of these but they are not nearly so remarkable.Nearly thirty years later, Lieutenant (later Captain) Matthew Flinders sailed up the coast in the sloop Norfolk. In his report to the Governor of New South Wales, Captain John Hunter, dated 14 July 1799 he wrote:At dusk Cape Moreton bore west two or three miles, and the highest glass house, whose peak was just topping over the distant land, had opened around it at 3 degrees west or 4 degrees north. Two Haycock like hummocks distinct from any other land opened soon after a few degrees to the southward.On 26 July Flinders took two sailors and the Aborigine Bungaree and landed on the shore with the intention of climbing Mount Tibrogargan. They climbed Mount Beerburrum before setting off for Tibrogargan, which they reached the next day, but which they did not climb."]}, {"page": "List of people on the postage stamps of Australia", "response": ["* Captain John Hunter, second governor of New South Wales (1986)"]}, {"page": "John Hunter", "response": ["John Hunter may refer to:", "*John Hunter (British politician) (1724–1802), British Member of Parliament for Leominster", "*John Hunter (Canadian politician) (1909–1993), Canadian Liberal MP for Parkdale, 1949–1957", "*John Hunter (Consul-General) (died 1816), British Consul-General in Spain", "*John Hunter (Northern Ireland politician), Ulster unionist member of the Northern Ireland Forum", "*John Hunter (Royal Navy officer) (1737–1821), Governor of New South Wales", "*John Hunter (South Carolina politician) (c. 1750–1802), American politician", "*John Hunter (Westchester County, New York) (1778–1852), New York politician", "* Ian Hunter (Scottish footballer) (born John Hunter, fl. 1960s), Scottish footballer (Falkirk)", "*John Hunter (American football), American football player", "*John Hunter (Australian footballer), Scottish-born Australian former footballer and coach", "*John Hunter (Falkirk footballer) (fl. 1920s), Scottish footballer (Falkirk, Reading, Guildford)", "*John Hunter (footballer, born 1878) (1878–1966), known as 'Sailor', Scottish football player and manager (Motherwell)", "*John Hunter (golfer) (1871–1946), Scottish professional golfer", "*John Hunter (rower) (born 1943), New Zealand rower", "*John Hunter (Third Lanark footballer) (died 1891), Scottish football player", "*John Hunter (scientist) (born 1955), projectile researcher", "*John Hunter (screenwriter) (born 1911), American award-winning screenwriter", "*John Hunter (classicist) (1746–1837), joint founder of the Royal Society of Edinburgh", "*John Hunter (surgeon) (1728–1793), surgeon and anatomist", "*John Hunter (physician) (1754–1809), physician", "*John Hunter (bishop) (1897–1965), former bishop of Kimberley and Kuruman", "*Jackie Hunter (John Hunter) (1903–1951), Canadian entertainer", "*John Hunter (performer), New Zealand female impersonator", "*John Hunter (singer), American singer and musician", "*John Hunter Nemechek (born 1997), American racing driver"]}, {"page": "HMS Sirius (1786)", "response": ["Sirius sailed from The Motherbank, Ryde, Isle of Wight on 13 May 1787 as the flagship of the eleven-vessel First Fleet, under the command of Captain Arthur Phillip (Governor-designate of the new colony).  Phillip transferred to the Armed Tender HMS Supply at Cape Town, with Second Captain John Hunter remaining in command of Sirius.  Also on board were Royal Marine Major Robert Ross, who would be responsible for colony security and surgeons George Bouchier Worgan and Thomas Jamison.  Midshipman Daniel Southwell recorded that Sirius was carrying the Larcum Kendall K1 chronometer used by Captain James Cook on his second and third voyages around the world.Correspondence, Daniel Southwell, Midshipman HMS Sirius, 12 July 1788. Cited in Bladen (ed.) 1978, p.685  She arrived in Botany Bay on 20 January 1788, two days after Supply, according to the journals of Hunter Digitised image of page 61 and First Lieutenant (later Rear Admiral) William Bradley Digitised images of page 57 and page 58  The 252-day voyage had gone via Rio de Janeiro and the Cape of Good Hope and covered more than . It was quickly decided that Botany Bay was unsuitable for a penal settlement and an alternative location was sought.  While waiting to move, a large gale arose preventing any sailing; during this period the French expeditionary fleet of Jean-François de Galaup, comte de Lapérouse arrived in Botany Bay.  The colony was established at Sydney Cove in Port Jackson when Governor Phillip arrived on 26 January aboard Supply.  Sirius arrived the following day. "]}, {"page": "Philip Gidley King", "response": ["Suffering from gout, King returned to England in October 1796, and after regaining his health, and resuming his naval career, he was appointed to replace Captain John Hunter as the third Governor of New South Wales. King became governor on 28 September 1800. He set about changing the system of administration, and appointed Major Joseph Foveaux as Lieutenant-Governor of Norfolk Island. His first task was to attack the misconduct of officers of the New South Wales Corps in their illicit trading in liquor, notably rum. He tried to discourage the importation of liquor, and began to construct a brewery. However, he found the refusal of convicts to work in their own time for other forms of payment, and the continued illicit local distillation, increasingly difficult to control. He continued to face military arrogance and disobedience from the New South Wales Corps. He failed to receive support in England when he sent an accused officer John Macarthur back to face a court-martial.", "King is also remembered for his art works, several of which survive. An engraving by William Blake, entitled A Native Family of New South Wales, and published in John Hunter's Historical Journal of the Transactions at Port Jackson and Norfolk Island (1793) was made from one of his watercolors. The original sketch is among the Banks Papers held by the Mitchell Library, Sydney, along with several others, unsigned but clearly by the same artist."]}, {"page": "George Bass", "response": ["Also on the voyage were Matthew Flinders, John Hunter, Bennelong, and his surgeon's assistant William Martin.", "In 1798, this theory was confirmed when Bass and Flinders, in the sloop Norfolk, circumnavigated Van Diemen's Land. In the course of this voyage Bass visited the estuary of the Derwent River, found and named by Captain John Hayes in 1793, where the city of Hobart would be founded on the strength of his report in 1803. When the two returned to Sydney, Flinders recommended to Governor John Hunter that the passage between Van Diemen's Land and the mainland be called Bass Strait."]}, {"page": "Australian art", "response": ["Despite Banks' suggestions, no professional natural-history artist sailed on the First Fleet in 1788. Until the turn of the century all drawings made in the colony were crafted by soldiers, including British naval officers George Raper and John Hunter, and convict artists, including Thomas Watling.James Gleeson, Australian Painting. Edited by John Henshaw. 1971. However, many of these drawings are by unknown artists, most notably the Port Jackson Painter. Most are in the style of naval draughtsmanship, and cover natural history topics, specifically birds, and a few depict the infant colony itself."]}, {"page": "La Perouse, New South Wales", "response": ["Lapérouse's two ships sailed to New South Wales after 12 of his men had been attacked and killed in the Navigator Islands (Samoa). Astrolabe and Boussole arrived off Botany Bay on 24 January just six days after Captain Arthur Phillip (1738–1814) had anchored just west of Bare Island, in . On 26 January 1788, as Captain John Hunter was moving the First Fleet around to Port Jackson after finding Botany Bay unsuitable for a Settlement, Lapérouse was sailing into Botany Bay,Peter Dillon's report 1826Captain John Hunter's Journal 1793The voyage of Governor Phillip to Botany Bay-printed for John Stockdale 1789 anchoring there just eight days after the British had."]}, {"page": "Lord Howe Island", "response": ["Watercolour sketches of native birds including the Lord Howe woodhen (Gallirallus sylvestris), white gallinule (Porphyrio albus), and Lord Howe pigeon (Columba vitiensis godmanae), were made by artists including George Raper and John Hunter. As the latter two birds were soon hunted to extinction, these paintings are their only remaining pictorial record.See  Over the next three years, the Supply returned to the island several times in search of turtles, and the island was also visited by ships of the Second and Third Fleets. Between 1789 and 1791, the Pacific whale industry was born with British and American whaling ships chasing sperm whales (Physeter macrocephalus) along the equator to the Gilbert and Ellice archipelago, then south into Australian and New Zealand waters. The American fleet numbered 675 ships and Lord Howe was located in a region known as the Middle Ground noted for sperm whales and southern right whales (Eubalaena australis)."]}, {"page": "White swamphen", "response": ["One other white swamphen specimen is in Liverpool's World Museum, where it is catalogued as specimen WML D3213. Obtained by the naturalist Sir Joseph Banks, it later entered the collection of the traveller William Bullock and was purchased by Lord Stanley; Stanley's son donated it to Liverpool's public museums in 1850. Although White said that the first specimen was obtained from Lord Howe Island, the provenance of the second has been unclear; it was originally said to have come from New Zealand, resulting in taxonomic confusion. Phillip wrote that the bird could also be found on Norfolk Island and elsewhere, but Latham said it could be found only on Norfolk Island. When the first specimen was sold by the Leverian Museum, it was listed as coming from New Holland (which Australia was called at the time)—perhaps because it was sent from Sydney. A note by the naturalist Edgar Leopold Layard on a contemporary illustration of the bird by Captain John Hunter inaccurately stated that it only lived on Ball's Pyramid, an islet off Lord Howe Island."]}, {"page": "Georges Hall", "response": ["For their exploration efforts Bass was given a   grant by Governor John Hunter  (in the area of present day Hazel Street and Flinders Road, alongside Prospect Creek) in 1798, neighbouring suburb Bass Hill honours his name. This grant later reverted to the Crown. Bass's fellow explorer, Mathew Flinders, received a grant south of Bass's (bounded by present day Marion St, Bellevue Ave, Flinders Rd and Prospect Creek). He bought more land until he had , but he did not farm it."]}, {"page": "New South Wales Corps", "response": ["Due to poor health Grose returned to England in December 1794 and Captain William Paterson assumed temporary command until a permanent replacement, Governor John Hunter, arrived in September 1795. Paterson had obtained his commission with the backing of Sir Joseph Banks because he was interested in natural history and would explore and collect samples for Banks and the Royal Society."]}, {"page": "Palm Beach, New South Wales", "response": ["* 1788-1789- area explored by Governor Arthur Phillip and Captain John Hunter"]}]}}