{"wiki_id": "http://www.wikidata.org/entity/Q1354893", "itemLabel": "Sam Hollis", "itemDescription": "English football manager (1866-1942)", "wikipedia_url": "https://en.wikipedia.org/wiki/Sam_Hollis", "wikipedia_page": {"main": "Sam Hollis (1866 – 17 April 1942) was an English football trainer and manager.\nBorn in Nottingham as Samuel Woodroffe Moore, he had comparatively little football experience, having previously worked in the local registry and as a landlord in a pub. He joined Woolwich Arsenal in 1894 as first team trainer.\nIn April 1897, Hollis was tempted away by newly formed Bristol City, where he became manager; he ended up spending three separate spells with the Robins. His first ended in March 1899 when he left to become secretary-manager of Bedminster. Bedminster merged with Bristol City in 1900 and Hollis lost his job. However, in 1901, he returned to manage Bristol City. During this second and most successive spell, City finished as Southern League runners-up and were promoted to the Football League.\nHe left in March 1905, and managed a hotel between 1905 and 1911, having previously run a pub between 1899 and 1909. He took over as Bristol City manager for the third time in January 1911, and oversaw the club's relegation from the First Division back to the Second. He left Ashton Gate in April 1913, and in July that year took over as manager of Southern League Newport County where he remained until 1917. After that, he left football management altogether, though he spent a number of years as chairman of Bristol City's shareholders. He died in Bristol in April 1942.", "link_mentions": [{"page": "Bristol City F.C.", "response": ["| Sam Hollis", "| Sam Hollis", "| Sam Hollis"]}, {"page": "Thomas Mitchell (football manager)", "response": ["Mitchell joined Woolwich Arsenal, after the club decided to appoint a professional manager following their defeat at the hands of Millwall in the FA Cup. There is some doubt over whether he was Arsenal's first- or second-ever manager; Sam Hollis is credited on the club's official website as being the club's first manager, other historical sources claim Hollis was only the club's trainer and thus Mitchell was the club's first manager – a view reinforced by the club's own official history, amongst other sources."]}]}}