{"wiki_id": "http://www.wikidata.org/entity/Q13522515", "itemLabel": "Adrian Room", "itemDescription": "British toponymist", "wikipedia_url": "https://en.wikipedia.org/wiki/Adrian_Room", "wikipedia_page": {"main": "Adrian Richard West Room (27 September 1933, Melksham – 6 November 2010, Stamford, Lincolnshire) was a British toponymist and onomastician, a Fellow of the Royal Geographical Society and a prolific author of reference works relating primarily to the origins of word and place-names.Between 1952 and 1979, Room served in the Royal Naval Reserve, Special Branch, retiring as a Lieutenant Commander.   Before becoming a full-time author, he was employed at King's College School, Cambridge, where he taught modern languages and was a senior house master.   He later, until 1984, worked as a senior lecturer in Russian for the Ministry of Defence.", "link_mentions": [{"page": "Room (disambiguation)", "response": ["* Adrian Room (1933–2011), a British toponymist and onomastician "]}, {"page": "Harpy", "response": ["The harpies seem originally to have been wind spirits (personifications of the destructive nature of wind). Their name means \"snatchers\" or \"swift robbers\"Adrian Room, Who's Who in Classical Mythology, p. 147  and they steal food from their victims while they are eating and carry evildoers (especially those who have killed their families) to the Erinyes. When a person suddenly disappeared from the Earth, it was said that he had been carried off by the harpies.Homer, Odyssey 1.241 & 14.371 Thus, they carried off the daughters of King Pandareus and gave them as servants to the Erinyes.Homer, Odyssey 20.78 In this form they were agents of punishment who abducted people and tortured them on their way to Tartarus. They were vicious, cruel, and violent."]}, {"page": "Toponymy", "response": ["*Adrian Room (1933-2010), British toponymist and onomastician"]}, {"page": "Zenaga language", "response": ["The name \"Zenaga\" comes from that of a much larger ancient Berber tribe, the Iznagen (Iẓnagen), who are known in Arabic as the Sanhaja. Adrian Room's African PlacenamesRoom, Adrian, African Placenames, McFarland & Co. Jefferson, North Carolina. 1994. gives Zenaga derivations for some place-names in Mauritania."]}, {"page": "Mount Etna", "response": ["One view is that the word Etna is from the Greek αἴθω (aithō), meaning \"I burn\", through an iotacist pronunciation. Another view is that the name is derived from the Phoenician word  meaning \"furnace\" or \"chimney\".According to Adrian Room's book Place-names of the World, the name \"Etna\" originated from the Phoenician word  meaning \"furnace\" or \"chimney\". He dismisses the hypothesis that 'Etna' has a Greek derivation.  In Classical Greek, it is called  (Aítnē), a name given also to Catania and the city originally known as Inessa. In Latin it is called Aetna. In Arabic, it is called   ('the Mountain of Fire')."]}, {"page": "Ron \"Pigpen\" McKernan", "response": ["McKernan began spending time around coffeehouses and music stores, and worked at Dana Morgan's Music Store in Palo Alto with Garcia. One night Garcia invited McKernan on stage to play harmonica and sing the blues. Garcia was impressed and McKernan became the blues singer in local jam sessions. He was initially nicknamed \"Blue Ron\" before settling on \"Pigpen\". Onomastician Adrian Room has suggested McKernan was given the name due to his untidy and unclean habits and band biographies say he got the nickname owing to his similarity to Pig-Pen, the permanently-dirty character in the comic-strip Peanuts."]}, {"page": "Brewer's Dictionary of Phrase and Fable", "response": ["* 15th (1995): Adrian Room. ", "* 16th \"Millenium Edition\" (1999) : Adrian Room.  ", "This retitled and updated version, initially edited by Adrian Room, was first published in 2000 ().  A second edition (), edited by Ian Crofton and John Ayto, was published on 30 November 2010.publisher's site  While this title is based on the structure of Brewer's Dictionary of Phrase and Fable, it contains entries from 1900 onwards and exists alongside its parent volume as a separate work."]}, {"page": "William Fox (producer)", "response": ["Fox was born in Tolcsva, Hungary, and originally named Wilhem Fuchs.\"Fried Fuchs\" is give by Britannica, cited in , and by Adrian Room in  His parents, Michael Fuchs and Hannah Fried, were both Hungarian Jews. The family immigrated to the United States when William was nine months old and settled in New York City, where they had twelve more children, of whom only six survived. William once sold candy in Central Park, worked as a newsboy, and worked in the fur and garment industry as a youth."]}, {"page": "Bejam", "response": ["* Adrian Room, Corporate Eponymy: A Biographical Dictionary of the Persons Behind the Names, Page 17, McFarland & Co, 1992, ", "* Adrian Room, Dictionary of Trade Name Origins, Page 38, Routledge, 1982, "]}, {"page": "Folk etymology", "response": ["* Adrian Room (1986). Dictionary of True Etymologies. Routledge & Kegan Paul. ."]}, {"page": "Kinneret (archaeological site)", "response": ["Adrian Room sees the origin of 'Ginosar' in a combination of Hebrew words,  ('valley') and either  ('branch') or  ('to guard', 'to watch')."]}, {"page": "Marie Rambert", "response": ["Born to a liberal Lithuanian Jewish family in Warsaw, Congress Poland, she was originally named Cyvia (Cesia) Rambam. Her father and two of his brothers later changed their last names to make them seem only children in order to escape military service in the Imperial Russian Army;\"Marie Rambert,\" in: Adrian Room, Dictionary of Pseudonyms, 5th ed., Jefferson, NC: McFarland, 2010, p. 396. This was not an uncommon practice among Jews in the Russian Empire. and so, while one brother retained the name Rambam, her father changed his to Ramberg, another of his brothers went to Rambert, and the last changed his name to Warszawski. She changed her name to Myriam Ramberg, and finally left it in the French form Marie Rambert. In later years she was known to friends and dancers as Mim."]}, {"page": "Balla, County Mayo", "response": ["Balla (pronounced Bal) (A Dictionary of Irish Place Names by Adrian Room, published by Appletree Press 1988), is a village in County Mayo, Ireland on the N60 National secondary road, the main road between Castlebar and Claremorris. The economy of the village survives mainly on passing trade, from the busy N60 which carries over 7,000 vehicles through the village every day. It is notable for its round tower. It used to be a significant shop and market centre. It fell into decline and lost its railway station, but has enjoyed something of a revival as a residential area for people working in Castlebar.", "According to Adrian Room in A Dictionary of Irish Placenames, the name refers to the Tobar Mhuire, known in English as the Blessed Well, i.e., of the Blessed Virgin Mary) to the west of Balla. This was enclosed by a wall in the 7th century, traditionally by St. Mo Chua.A Dictionary of Irish Place Names by Adrian Room published by Appletree Press 1988 page 19"]}, {"page": "Sompting", "response": ["The village's name comes from the Old English *sumpt + -ingas, meaning \"(settlement of) the dwellers at the marsh\".  Its earliest recorded form is Suntinga, in a document of 956, but Domesday Book (1086) renders the name as Sultinges, its Norman-speaking clerks being unfamiliar with the consonant-cluster -mpt.  As the toponymist Adrian Room noted, there is no obviously marshy land there nowadays, but it is low-lying and near the sea."]}]}}