{"wiki_id": "http://www.wikidata.org/entity/Q13636005", "itemLabel": "William P. Carleton", "itemDescription": "Anglo-American silent film actor (1872-1947)", "wikipedia_url": "https://en.wikipedia.org/wiki/William_P._Carleton", "wikipedia_page": {"main": "William P. Carleton (October 3, 1872 – April 6, 1947) was a silent film actor who appeared in 40 films between 1919 and 1944. He is sometimes billed as William Carleton Jr.. Carleton was born in London and was briefly married to actress Toby Claude; they divorced in 1903. He was a distant cousin of Sir Guy Standing and other Standing acting family members.On April 6, 1947, Carleton died in Hollywood, California, as a result of injuries from an automobile accident. He was 74.", "link_mentions": [{"page": "William Carleton (disambiguation)", "response": ["* William P. Carleton (1872–1947), Anglo-American film actor, sometimes billed as William Carleton Jr."]}, {"page": "The Bohemian Girl (1936 film)", "response": ["Stanley Laurel and Oliver Hardy are the misfit pair of Gypsies in the group. When hen-pecked Oliver is out pickpocketing, fortune-telling or attending his zither lessons, his wife (Mae Busch) has an affair with Devilshoof (Antonio Moreno). A cruel nobleman, Count Arnheim (William P. Carleton), persecutes the Gypsies, who are forced to flee, but Mrs Hardy, in revenge for Devilshoof being lashed by the count's orders, kidnaps his daughter, Arline (Darla Hood), and Mrs. Hardy fools Hardy into thinking she is their daughter since he believes everything she tells him. She soon elopes with Devilshoof, and leaves Oliver and \"Uncle\" Stanley holding the toddler. Arline is too young to remember her old life.", "* William P. Carleton as Count of Arnheim "]}, {"page": "The Flapper", "response": ["Despite the strictness there, the girls have fun getting into flapper-lifestyle trouble including flirting. Richard Channing (William P. Carleton), an older man, rides past the seminary every day, prompting romantic fantasies among the schoolgirls. When Ginger connives a sleigh ride with Channing, she lies to him about her age, saying she is \"about twenty\". Ginger is quickly charmed and becomes enamored with him. Ginger soon gets into trouble with the headmistress by sneaking out to the local country club where Channing is having a party. One of her schoolmates, Hortense (Katherine Johnston), who is described as “a moth among the butterflies”, informs on her. Hortense’s actual motive for doing this is to get the headmistress out of the way so she can rob the school's safe and flee with her crooked boyfriend Thomas Morran (Arthur Housman).Quotation is transcription from one of the intertitles in The Flapper. “Bill Sprague Collection -THE FLAPPER-Olive Thomas-PUBLIC DOMAIN”, Internet Archive, San Francisco, California. Retrieved August 27, 2018. Acting on a vaguely worded note she receives, Ginger—while traveling home from school—goes to a hotel in New York City where Hortense and Thomas are staying. They force her to take some suitcases for safekeeping, cases that contain stolen valuables, including fancy clothes and jewelry.", "* William P. Carleton as Richard Channing"]}, {"page": "List of American films of 1920", "response": ["| The Amateur Wife || Edward Dillon || Irene Castle, William P. Carleton || Drama || Paramount"]}, {"page": "List of American films of 1922", "response": ["| Domestic Relations || Chester Withey || Katherine MacDonald, William P. Carleton || Drama || First National", "| The Law and the Woman || Penrhyn Stanlaws || Betty Compson, William P. Carleton || Drama || Paramount"]}, {"page": "List of American films of 1923", "response": ["| Sinner or Saint || Lawrence C. Windom || Betty Blythe, William P. Carleton || Drama || Selznick"]}, {"page": "List of American films of 1924", "response": ["|Half-A-Dollar-Bill || W.S. Van Dyke || Anna Q. Nilsson, William P. Carleton || Drama || Metro"]}, {"page": "Boys' Reformatory", "response": ["* William P. Carleton as Superior Judge Robert A. Scott  "]}, {"page": "The Border Patrolman", "response": ["*William P. Carleton as Jeremiah Huntley"]}, {"page": "Morals (film)", "response": ["Morals is a 1921 American silent drama film directed by William Desmond Taylor and starring May McAvoy, William P. Carleton, and Marian Skinner. It is based on a 1905 novel, The Morals of Marcus Ordeyne by William J. Locke, which was produced as a 1907 Broadway play starring Marie Doro who later made her screen debut in a 1915 film version.", "* William P. Carleton as Sir Marcus Ordeyne"]}, {"page": "The Copperhead", "response": ["*William P. Carleton as Lt. Tom Hardy"]}, {"page": "His House in Order (1920 film)", "response": ["*William P. Carleton as undetermined role"]}, {"page": "Carleton (surname)", "response": ["*William P. Carleton (1872–1947), American actor"]}, {"page": "The Riddle: Woman", "response": ["*William P. Carleton as Eric Helsingor"]}, {"page": "Half-A-Dollar-Bill", "response": ["* William P. Carleton as Captain Duncan McTeague"]}, {"page": "The Woman in the Case (play)", "response": ["* In 1922 as The Law and the Woman, an American film starring Betty Compson and William P. Carleton"]}, {"page": "The Inside of the Cup", "response": ["In January 1921 a film adaptation of the novel was released, directed by Albert Capellani, and featuring William P. Carleton as John Hodder, David Torrence as Eldon Parr, and Edith Hallor as Alison Parr.American Film Institute Catalog: Feature Films 1921-1930, p. 381 (1971)(January 16, 1921).  Brought Into Focus, The New York Times (movie review) As of April 2013, the movie is reported to have survived but without a projection print as of yet.(April 21, 2013). Silent films, old and new, DavidBordwell.net"]}, {"page": "The Law and the Woman", "response": ["*William P. Carleton as Julian Rolfe"]}, {"page": "The Amateur Wife", "response": ["The Amateur Wife is a 1920 American silent drama film directed by Edward Dillon and written by Nalbro Bartley and Jane Murfin. The film stars Irene Castle, William P. Carleton, Arthur Rankin, S.J. Warrington, Alex Saskins and Augusta Anderson. The film was released on February 22, 1920, by Paramount Pictures.Progressive Silent Film List: The Amateur Wife at silentera.com", "*William P. Carleton as Cosmo Spotiswood"]}, {"page": "The Inside of the Cup (film)", "response": ["The Inside of the Cup is a surviving 1921 American silent drama film directed by Albert Capellani and written by Albert Capellani and George DuBois Proctor based upon the best-selling novel of the same name by Winston Churchill. The film stars William P. Carleton, David Torrence, Edith Hallor, John Bohn, Marguerite Clayton, Richard Carlyle and Margaret Seddon. The film was released January 16, 1921, by Paramount Pictures.", "*William P. Carleton as John Hodder"]}, {"page": "Behind Masks", "response": ["Behind Masks is a 1921 American silent drama film directed by Frank Reicher. It was written by Kathryn Stuart based upon the 1909 novel Jeanne of the Marshes by E. Phillips Oppenheim.Progressive Silent Film List: Behind Masks at silentera.com The film stars Dorothy Dalton, Frederick Vogeding, William P. Carleton, Julia Swayne Gordon, Gladys Valerie, and Kempton Greene. The film was released on July 24, 1921, by Paramount Pictures.", "*William P. Carleton as Major Nigel Forrest"]}, {"page": "Our Leading Citizen (1922 film)", "response": ["Our Leading Citizen is a 1922 American silent comedy film directed by Alfred E. Green and written by George Ade and Waldemar Young. The film stars Thomas Meighan, Lois Wilson, William P. Carleton, Theodore Roberts, Guy Oliver, Larry Wheat, and James Neill. The film was released on June 14, 1922, by Paramount Pictures.", "*William P. Carleton as Oglesby Fendle"]}, {"page": "Homeward Bound (1923 film)", "response": ["Homeward Bound is a 1923 American silent drama film directed by Ralph Ince and written by Peter B. Kyne, Jack Cunningham, and Paul Sloane. The film stars Thomas Meighan, Lila Lee, Charles S. Abbe, William P. Carleton, Hugh Cameron, and Gus Weinberg. The film was released on July 29, 1923, by Paramount Pictures."]}, {"page": "The Return of Jimmy Valentine", "response": ["*William P. Carleton as Warden Keeley"]}, {"page": "Rendezvous at Midnight", "response": ["*William P. Carleton as Judge "]}, {"page": "What No Man Knows", "response": ["*William P. Carleton as Drake Blackly"]}, {"page": "Star of Bengal", "response": ["In 1929, Joan Lowell's husband, Thompson Buchanan, wrote a play titled Star of Bengal, which is set on the ship. The play was produced by Christopher Morley and opened in late September, starring Charles Starrett, Joan Lowell, and William P. Carleton. This \"consciously superannuated\" melodrama features a love affair between the captain's daughter (Lowell) and a sailor (Starrett) that leads to their elopement. The runaways are caught, and the captain (Carleton) is about to hang the sailor; however, upon learning that his daughter is pregnant, the captain turns magnanimous. The play lasted only until November and was generally regarded as unsuccessful. Its failure was rumored to be a contributing factor in Buchanan's and Lowell's subsequent divorce."]}, {"page": "Toby Claude", "response": ["Toby Claude married fellow actor William P. Carleton; they divorced in 1903.\"Tiny Toby Claude Seeks a Divorce\" Boston Daily Globe (May 21, 1903): 1. In 1915 she was involved in a scandal when she was found leaving America with another actress's husband and young child.\"Toby Claude and Actor Disappear with his Child\" St. Louis Post-Dispatch (August 12, 1915): 9.  via Newspapers.com\"Actress Practiced Wiles on Partner\" Quad-City Times (July 11, 1915): 6. via Newspapers.com She died on October 27, 1962, in Los Angeles, California, USA."]}, {"page": "Bobbed Hair (1922 film)", "response": ["*William P. Carleton as Paul Lamont"]}, {"page": "The Tie That Binds (1923 film)", "response": ["The Tie That Binds is a 1923 American silent drama film directed by Joseph Levering and starring Walter Miller, Barbara Bedford, Raymond Hatton, William P. Carleton, and Robert Edeson. It is based on a novel of the same name by Frank R. Adams. The film was released by Warner Bros. on March 15, 1923.", "*William P. Carleton as Daniel Kenyon"]}, {"page": "The Perfect Clue", "response": ["* William P. Carleton as Jerome Stewart  "]}, {"page": "Domestic Relations (film)", "response": ["Domestic Relations is a 1922 American drama film directed by Chester Withey and written by Violet Clark. The film stars Katherine MacDonald, William P. Carleton, Frank Leigh, Barbara La Marr, Gordon Mullen, and George Fisher. The film was released on June 4, 1922, by Associated First National Pictures.", "*William P. Carleton as Judge James Benton"]}, {"page": "Mystery Plane", "response": ["* William P. Carleton as Navy Commander "]}, {"page": "William T. Carleton", "response": ["William T. Carleton (1859–1930) was an English-born actor, and producer.American and British Theatrical Biography, p.182 c.1979 by J.P. Wearing .. He died in Saint John, New Brunswick, Canada, in 1930. Some sources erroneously list him as being related to William P. Carleton, another actor. He is also not to be mistaken for another William T. Carleton, opera singer, who died in 1922.Who Was Who on Screen, p.69 2nd Edition c.1977 by Evelyn Mack Truitt .."]}, {"page": "Sinner or Saint (film)", "response": ["Sinner or Saint is a 1923 American silent drama film directed by Lawrence C. Windom and starring Betty Blythe, William P. Carleton and Gypsy O'Brien.Connelly p.410", "* William P. Carleton as Paul Reynolds"]}, {"page": "The Truth About Wives", "response": ["The Truth About Wives is a 1923 American silent drama film directed by Lawrence C. Windom and starring Betty Blythe, Tyrone Power Sr. and William P. Carleton.Connelly p.424", "* William P. Carleton as Alfred Emerson"]}]}}