{"wiki_id": "http://www.wikidata.org/entity/Q1363193", "itemLabel": "Graeme Murty", "itemDescription": "association football player and manager (born 1974)", "wikipedia_url": "https://en.wikipedia.org/wiki/Graeme_Murty", "wikipedia_page": {"main": "Graeme Stuart Murty (born 13 November 1974) is an English-born Scottish professional football coach and former player. He made 437 appearances in the Football League and Premier League, playing for York City, Reading, Charlton Athletic and Southampton. Though born in Saltburn, North Yorkshire, England, Murty qualified for Scotland through his family who were Scottish, and won four full caps. Murty joined Rangers as a development squad coach in 2016. He was twice placed in caretaker charge of the Rangers first team during 2017, and was subsequently full-time manager from December 2017 to April 2018.", "link_mentions": [{"page": "Rangers F.C.", "response": ["In June 2015 it was announced that Mark Warburton had been appointed manager on a three-year deal. Rangers went on to win the 2015–16 Scottish Championship and automatic promotion to the Scottish Premiership, ending their four-year stint in the lower divisions. The club also reached the 2016 Scottish Cup Final, beating Old Firm rivals Celtic in the semi-final at Hampden, before losing to Hibernian in the final. After a poor first half of the 2016–17 season, Mark Warburton and David Weir left Rangers on 10 February 2017, and Graeme Murty was placed in caretaker control of the Rangers first team. Pedro Caixinha eventually took over as permanent manager.", "Caixinha's first full season started with Rangers suffering one of the worst results in their history. After winning 1–0 at Ibrox, Rangers lost 2–0 to Luxembourg minnows Progrès Niederkorn, resulting in Rangers being knocked out 2–1 on aggregate in the first qualifying round of the 2017–18 Europa League. Progrès had never before won a tie and had only ever scored once before in European competition. After that disappointing start to the season the form did not improve, with notable results including a 2–0 reverse to Celtic at home in the league and defeat to Motherwell in the Scottish League Cup semi-final by the same scoreline. On 26 October, a day after a 95th-minute equaliser at Ibrox by last-placed Kilmarnock saw Rangers draw 1–1, Caixinha was sacked and Graeme Murty took over as caretaker manager again. The Portuguese manager's reign was described as \"a desperate mess from start to finish\"."]}, {"page": "Reading F.C.", "response": ["|  Graeme Murty"]}, {"page": "Steven Gerrard", "response": ["In late April 2018, Gerrard entered talks to become the new manager of Scottish Premiership club Rangers. On 1 May, incumbent manager Graeme Murty was dismissed, with the club confirming three days later that Gerrard would succeed him from 1 June, ahead of the 2018–19 season, signing a four-year contract. He made his senior managerial debut on 12 July, when he led Rangers to a 2–0 UEFA Europa League win over Macedonian team Shkupi. Gerrard's first game in charge in the domestic league was a 1–1 draw against Aberdeen, away from home. Under Gerrard's management, Rangers went twelve matches unbeaten in all competitions from the start of the season before finally suffering defeat on 2 September, losing 1–0 to rivals Celtic in the Old Firm derby. On 29 December, in the reverse fixture, Gerrard guided Rangers to their first win over Celtic since 2012, in a game that ended with a 1–0 scoreline."]}, {"page": "Saltburn-by-the-Sea", "response": ["*Professional footballers and football managers George Hardwick, Tony Mowbray and Graeme Murty were all born in Saltburn."]}, {"page": "Tommy Burns (footballer)", "response": ["Burns remained in this position until 16 September 1999, when he was dismissed following a poor sequence of results, after Reading's failure to win promotion from Division Two the previous year. He left an impression on some of the club's personnel, including future club captain Graeme Murty and youth coach Brendan Rodgers who later also managed Celtic."]}, {"page": "Alexander Hleb", "response": ["Despite a hamstring injury, Hleb made 48 appearances in the 2006–07 season and scored three goals. In 2007–08, he was moved from the right wing and played behind Robin van Persie as a withdrawn striker. When strikers Emmanuel Adebayor and Eduardo recovered from injuries Arsène Wenger reverted to a 4–4–2 formation and Hleb returned to playing on the wing. His season was cut short after he was banned for three games by the FA after he was charged with violent conduct in an incident with Graeme Murty of Reading during their 2–0 win. Hleb admitted his offence, ending his season."]}, {"page": "Jimmy Nicholl", "response": ["While still at Cowdenbeath, Nicholl had also become assistant manager to Michael O'Neill with the Northern Ireland national team in March 2015. He was appointed as assistant to new Falkirk manager Paul Hartley in October 2017, while also continuing in his role with Northern Ireland. He became assistant manager at Rangers in January 2018, assisting Graeme Murty. After Murty left Rangers on 1 May, Nicholl and Jonatan Johansson were placed in interim charge until the appointment of Steven Gerrard on 1 June."]}, {"page": "Kenny Miller", "response": ["Miller scored the opening goal in Rangers' 2017–18 season against Progrès Niederkorn in the Europa League on 29 June 2017. Despite his goal, Rangers went on to lose 2–1 on aggregate, giving Progrès their first ever European win. Miller was dropped from the Rangers first team in September 2017. This came after Pedro Caixinha had criticised some of the team's Scottish players in a meeting after a 2–0 defeat by Celtic. Caixinha then suggested that a Rangers player had leaked team information to opponents, which led journalists to surmise that Miller had been the source. Caixinha was sacked in late October, and Miller was reinstated to the Rangers team by caretaker manager Graeme Murty; in his first game back, Miller scored two goals in a 3–1 win against Hearts."]}, {"page": "Leroy Lita", "response": ["Sheffield United had a seven figure sum accepted by Reading for Lita on 13 January 2009, but the club later withdrew from proceedings after they were not willing to pay the £1.2m signing-on fee being requested by Lita. On 15 May, Lita, Michael Duberry, Marcus Hahnemann and club captain Graeme Murty were told that their contracts would not be renewed."]}, {"page": "Ívar Ingimarsson", "response": ["Following the release of Graeme Murty from Reading, and the arrival of new manager Brendan Rodgers, Ívar was announced as Reading's new club captain on 7 August 2009."]}, {"page": "Leroy Rosenior", "response": ["Rosenior works as a presenter and pundit on G-Sports, an African Pay-Per-View channel, and for the BBC's coverage of the 2008 Africa Cup of Nations. Other punditry work has included BBC Radio 5 Live as well as The Football League Show and The League Cup Show on BBC television. He also appeared alongside fellow ex-pro Graeme Murty and presenter James Richardson in the BBC South, BBC South West and BBC West local Monday night football round-up show Late Kick Off."]}, {"page": "History of Rangers F.C.", "response": ["In June 2016, it was announced by the SPFL that the Challenge Cup would be expanded to include teams from the Welsh Premier League, Northern Irish Premiership and an under-20s side from each Scottish Premiership club. On the same day as this announcement, the under-20s team coach Ian Durrant was relieved of his duties in a coaching reshuffle, with Rangers appointing Graeme Murty as Head Development Squad Coach on 17 August, to replace him. The draw for the first round of the 2016–17 Challenge Cup was made with Rangers under-20s side paired with Stirling University F.C. who play in the Lowland Football League. The U20 side progressed conformably beating Stirling University 4–0 at Forthbank Stadium with Josh Jeffries scoring a brace. A second round tie with Scottish League One side Stenhousemuir was set-up, again played at Forthbank, however, the side could not match its previous performance and went down 3–1 with Ryan Hardie netting the Rangers goal.", "On 10 February 2017, manager Warburton, assistant manager David Weir and McParland left Rangers, with the former being replaced by Graeme Murty who was placed in caretaker control of the first-team. Several reasons for the trio departure were highlighted by the media, as well as the club. The first-team's poor performance in the first half of the season a prominent cause, which crystallised after an embarrassing 4–1 defeat away to Heart of Midlothian on 1 February and an insipid 1–1 draw at home to Ross County three days later, a match which proved to be Warburtons last game in charge of Rangers. The poor signing policy was mooted, however, the club also stated that the management team were not committed to the job and reported the team had tendered their resignations five days before being replaced which Warburton later disputed. Early contenders for the role included former Rangers manager Alex McLeish and former Rangers defender Frank de Boer. On Valentine's Day 2017, Managing director Stewart Robertson announced that the club would seek to appoint a Director of Football to work alongside a new first-team manager.", "Graeme Murty's time in charge began with a fourth round Scottish cup win over Greenock Morton, however, league formed remained indifferent his first two league matches ende in away defeats to Dundee and Inverness CT. This left the side in third place, six points adrift of Aberdeen, at the beginning of March. A dramatic 3–2 win of St Johnstone saw Murty register his only league win in his six-game spell as manager with his last two games in charge seeing him set up to a Scottish Cup semi-final against Celtic after a 6–0 win over Hamilton Academical, the team's largest win of the season, before drawing the third league Old Firm match. On 11 March, Rangers confirmed Pedro Caixinha as the club's sixteenth manager with the Portuguese coach appointed two days later. However, the pursuit of a Director of Football was not as successful as the Boards first choice, Southampton's Ross Wilson, turning down the offer of the role."]}, {"page": "Nunthorpe", "response": ["*Graeme Murty – footballer who went to school in Nunthorpe."]}]}}