{"wiki_id": "http://www.wikidata.org/entity/Q1369864", "itemLabel": "Tom Hurndall", "itemDescription": "British activist", "wikipedia_url": "https://en.wikipedia.org/wiki/Tom_Hurndall", "wikipedia_page": {"main": "Thomas Hurndall (27 November 1981 – 13 January 2004) was a British photography student, a volunteer for the International Solidarity Movement (ISM), and an activist against the Israeli occupation of the Palestinian territories. On 11 April 2003, he was shot in the head in the Gaza Strip by an Israel Defense Forces (IDF) sniper, Taysir Hayb. Hurndall was left in a coma and died nine months later.\nHayb was convicted of manslaughter and obstruction of justice by an Israeli military court in April 2005 and sentenced to eight years in prison. On 10 April 2006, a British inquest jury returned a verdict of unlawful killing.Tom's mother Jocelyn Hurndall has written a biography of him called Defy the Stars: The Life and Tragic Death of Tom Hurndall, published in April 2007 and reprinted in May 2008 with the alternative title My Son Tom: The Life and Tragic Death of Tom Hurndall. His sister, Sophie, works for Medical Aid for Palestinians.", "link_mentions": [{"page": "Human shield", "response": ["Rabbis for Human Rights agreed to act as “human shields” during the annual olive harvest to protect Palestinian villages from settlers.\"Settlers clash with rabbis guarding Palestinian olive harvest near Hebron\"  Haaretz, October 13, 2008 Associated Press. Rachel Corrie and Tom Hurndall, Western International Solidarity Movement (ISM) volunteers in the Palestinian territories, who died in 2003 and 2004 respectively have been described as “human shields” campaigning against house demolition. ISM, however, strongly takes offence at the use of the term human shield to describe their work, preferring it be used only to refer to when armed combatants uses civilians as shields.\"ISM report \", May 5, 2003. Not even Amnesty International defines volunteer activist's actions or activist's actions for non-military property as “human shields”, and regards only the direction of \"specific civilians to remain in their homes as “human shields” for fighters, munitions, or military equipment\" as “human shields”. According to the 3 definitions in the header of this article the 'volunteers to protect Palestinians' make them not “human shields outside the battlefield” but protesters or ordinary pro-Palestinian demonstrants."]}, {"page": "Timeline of the Israeli–Palestinian conflict in 2003", "response": ["*11 April: Tom Hurndall, a British member of the International Solidarity Movement, was shot in the head by an Israel Defense Forces sniper. He died after almost a year in coma 13 January 2004."]}, {"page": "International Solidarity Movement", "response": ["=====Tom Hurndall=====", "On April 11, 2003 Israel Defense Forces(IDF) soldier Sergeant Taysir Hayb shot International Solidarity Movement(ISM) volunteer Tom Hurndall in the head. Hurndall, who had been aiding Palestinians in Gaza, died of his wound in January 2004. Hurndall was unarmed, dressed in the bright orange jacket of the ISM, and steering two Palestinian children away from an Israeli tank-mounted machine gun shooting in their direction.ISM: Israeli soldier shoots British ISM activist Tom Hurndall in Gaza (11 April 2003)ISM Rafah: Statement on the shooting of Thomas Hurndall (12 April 2003)\"As IDF rifle fire hit the mound, the children fled. But three, aged between four and seven, were paralysed by fear\". The Guardian Obituary, January 22, 2004.Soldier jailed for activist death, BBC News, August 11, 2005.Simon Atkinson, British peace activist was 'intentionally killed', The Guardian, April 10, 2006.", "Subsequently, Hayb admitted fabricating his account of events. On 10 May 2004, Hayb's trial commenced on one charge of manslaughter in the death of Tom Hurndall, two counts of obstruction of justice, one count each of submitting false testimony, obtaining false testimony, and unbecoming behaviour. Hurndall's family pressed for a murder charge through the Israeli courts. In August 2005, Taysir Hayb was convicted of manslaughter and sentenced to a total of eight years imprisonment, seven years for the manslaughter of Hurndall and one year for obstruction of justice.BBC: Soldier jailed for activist death (11 August 2005)"]}, {"page": "Thomas Hurndall", "response": ["#REDIRECTTom Hurndall"]}, {"page": "Attacks on humanitarian workers", "response": ["* Gaza Strip - April 11, 2003 - Tom Hurndall was a British photography student and member of ISM who was killed by an Israel Defense Forces (IDF) sniper. Hurndall was left in a coma and died nine months later. His killer Taysir Hayb was sentenced to eight years imprisonment for manslaughter and obstruction of justice but was released after serving six and a half years of his sentence."]}, {"page": "Cosmopolitanism", "response": ["For Gilroy, being cosmopolitan seems to involve both a social, ethical enterprise and a cultural enterprise. In \"The Planet\", Gilroy describes the cases of Tom Hurndall and Rachel Corrie; each seems to exemplify what might be considered Gilroy's figure of the cosmopolitan. Both Hurndall and Corrie removed themselves (geographically) from their home cultures, presumably both physically and mentally estranging themselves from their own cultures and histories. Hurndall and Corrie were both killed in 2003 (in separate incidents). Gilroy's model of estrangement might actually undermine itself through its examples; this might be construed as a failure of Gilroy's theory to address the practical difficulties of estranging oneself from the familiar."]}, {"page": "2004 in the United Kingdom", "response": ["**Tom Hurndall, political activist (murdered) (born 1981)"]}, {"page": "James Miller (filmmaker)", "response": ["* Tom Hurndall – British ISM volunteer fatally shot in the head in Gaza by IDF sniper, 11 April 2003."]}, {"page": "Human shield action to Iraq", "response": ["At its peak the total of shield volunteers in Baghdad numbered about 500, but the realization that the thousands needed to have a chance of stopping attacks on Baghdad had not materialized, combined with the failure of the United Nations to forestall war, meant that bombing was imminent. Many of the shields chose to stay; many others chose to leave. Still others, like O’Keefe, were ordered out by the Iraqi government. One 21-year-old human shield, Tom Hurndall, left Baghdad for reasons of safety. He went to the Palestinian territories where he was shot by an Israeli soldier while working with the International Solidarity Movement."]}, {"page": "November 1981", "response": ["*Born: Tom Hurndall, British photographer and murder victim, in London (killed 2004)"]}, {"page": "Brian Avery (activist)", "response": ["*Tom Hurndall"]}, {"page": "Taysir Hayb", "response": ["Idier Wahid Taysir Hayb (or al-Heib) (; ) is a Bedouin Israeli sergeant in the Israel Defense Forces, who shot International Solidarity Movement civilian activist Tom Hurndall, while on duty in Gaza on April 11, 2003. Hurndall died in January 2004, after a nine-month coma. Hayb was sentenced to eight years for manslaughter.Soldier jailed for activist death, BBC News, 11 August  2005.Simon Atkinson, British peace activist was ‘intentionally killed’, The Guardian, 10 April 2006. His sentence was reduced in July 2010. He is the brother of Amira al Hayb, the first Bedouin Israeli female to join the IDF.", "In May 2004, Taysir Hayb went on trial for manslaughter in the death of Tom Hurndall, obstruction of justice and unbecoming behaviour. In August 2005, he was convicted of manslaughter and obstruction of justice and sentenced to a total of eight years' imprisonment."]}, {"page": "Unlawful killing", "response": ["* Tom Hurndall, shot by an Israeli sniper in the Gaza Strip in 2003."]}, {"page": "1981 in the United Kingdom", "response": ["* 29 November – Tom Hurndall, photographer (died 2004)"]}, {"page": "Dispatches (TV programme)", "response": ["This episode, broadcast in May 2003, follows five weeks in the lives of those living in the Gaza Strip. Beginning two days after the killing of an American member of the International Solidarity Movement Rachel Corrie by an IDF bulldozer, the film includes footage of the aftermath of an Israeli flechette attack in a densely populated area and documents the deaths of Tom Hurndall, a British ISM activist, and James Miller, the Channel 4 cameraman who was shot as he filmed Israeli troops bulldozing Palestinian homes."]}, {"page": "Newham Monitoring Project", "response": ["Other projects included involvement in organising discussion based events for the local community alongside Newham Bookshop with authors such as Moazzam Begg, Rageh Omaar, Gary Younge, Jocelyn Hurndall, who is the mother of Tom Hurndall, and Clive Stafford Smith <REF NAME=\"bbc london\"></ref> to highlight related issues of public concern that engage with similar themes of the organisation's work around racism, human rights, policing and justice."]}, {"page": "Amira al Hayb", "response": ["Amira's brother, Taysir Hayb, received an 8-year prison sentence for manslaughter in the death of International Solidarity Movement activist Tom Hurndall, but was released after five years."]}, {"page": "Civilian casualties in the Second Intifada", "response": ["*Tom Hurndall – English ISM volunteer fatally shot by an IDF sniper in Gaza, April 11, 2003. Ruled accidental."]}, {"page": "Menachem Finkelstein", "response": ["Finkelstein was born in 1951 and received an Orthodox Jewish upbringing.  He passed the Israeli bar exam in 1976. He served in the Judge Advocate General's office in the IDF from 1973 to 2004, becoming a Major-General. He presided over the judgment that targeted killings were a legal part of the war on terror. In 2004 Hamas's Sheikh Yassin was killed under the policy. In July 2003 Finkelstein decided not to open a criminal investigation into the death International Solidarity Movement activist Rachel Corrie, but he did open an investigation into the death of Tom Hurndall in October 2003.International Solidarity Movement » Haaretz: Army decides to close file on death of U.S. peace activist In 2004 he testified before the Knesset's Law and Constitution committee and noted that \"In all the fatality cases we have investigated, there has never been a single incident of deliberate shooting [of civilians by the IDF].\"IDF Chief Judge: Hundreds of Inquiries, Groundless – Politics & Government – Israel News – Arutz Sheva He retired from the army in 2004 and became a district judge."]}, {"page": "Iain Hook", "response": ["*Tom Hurndall – British ISM volunteer fatally wounded in Gaza by IDF sniper, 11 April 2003."]}, {"page": "The Skies are Weeping", "response": ["The Skies are Weeping is a cantata by composer Philip Munger. The cantata memorializes Rachel Corrie and Tom Hurndall.", "==Rachel Corrie and Tom Hurndall==", "Tom Hurndall, a British photography student and ISM activist, was shot in the head in the Gaza Strip by an IDF sniper on April 11, 2003. Hurndall later died without regaining consciousness after nine months in a coma. His death was also ruled accidental by Israel.", "It is composed of seven movements for a soprano soloist, chamber choir, and percussion ensemble.Bryson, George. (2004-04-25). \"Flashpoint cantata: Alaska composer's tribute to a dead American activist exposes sharp conflict over art, balance and freedom of expression.\"  Anchorage Daily News. Six of the seven movements have accompanying text. Section one, the choral prelude, is a rare complete setting of the King James version of Psalm 137. Section two is a Dance for Tom Hurndall. Section three is a poem, Rachel, written for Corrie by San Francisco poet Phil Goldvarg on March 18, 2003. Section four is another poem, God the Synecdoche in His Holy Land, written in memory of Rachel Corrie by Alaskan poet Linda McCarriston. Section five is a recitative, I Had No Mercy For Anybody, excerpted from the Gush Shalom translation of Moshe (\"Kurdi Bear\") Nissim's May 31, 2002 interview (\"Jenin, A Soldier's Story\") conducted in Hebrew by journalist Tsadok Yeheskeli for Israel's best-selling tabloid newspaper, Yediot Aharonot. Section six is another poem, The Skies Are Weeping, written for Corrie by Sri Lankan poet Thushara Wijeratna. Section seven, Rachel's Words, is excerpted from Corrie's last e-mails to her mother as edited by the composer.Protest Music of Philip Munger The Skies Are Weeping - The November 1, 2005 London Performance Lyrics and Recordings available at official blog, Munger, Philip. (2004-04-25), \"Text to 'The Skies Are Weeping,' a cantata by Philip Munger.\"  Anchorage Daily News"]}, {"page": "Avigdor Feldman", "response": ["He has appeared before the bench in many of the significant petitions presented to the Israeli High Court of Justice (Bagatz) regarding the settlements. He has also represented Mordechai Vanunu and the family of Tom Hurndall. In another notable case he acted as the advocate in a joint petition to the Israeli High Court of Justice by Director Mohammed Bakri and Indymedia Israel over the censorship of Bakri's film \"Jenin, Jenin\".", "In the Tom Hurndall case, a 23-year-old British volunteer for the International Solidarity Movement who was shot and killed by an Israel Defense Forces sniper, Feldman represented Hurndall's brother in an appeal to allow him to enter Israel.IDF Soldier Convicted of Manslaughter of British Activist"]}]}}