{"wiki_id": "http://www.wikidata.org/entity/Q1364819", "itemLabel": "Richard Leacock", "itemDescription": "British film director", "wikipedia_url": "https://en.wikipedia.org/wiki/Richard_Leacock", "wikipedia_page": {"main": "Richard Leacock (18 July 1921 – 23 March 2011) was a British-born documentary film director and one of the pioneers of direct cinema and cinéma vérité.", "link_mentions": [{"page": "Documentary film", "response": ["Although the terms are sometimes used interchangeably, there are important differences between cinéma vérité (Jean Rouch) and the North American \"Direct Cinema\" (or more accurately \"Cinéma direct\"), pioneered by, among others, Canadians Allan King, Michel Brault, and Pierre Perrault, and Americans Robert Drew, Richard Leacock, Frederick Wiseman, and Albert and David Maysles."]}, {"page": "July 18", "response": ["*  1921   – Richard Leacock, English-French director and producer (d. 2011)"]}, {"page": "Massachusetts Institute of Technology", "response": ["In late 1960s and early 1970s, student and faculty activists protested against the Vietnam War and MIT's defense research. In this period MIT's various departments were researching helicopters, smart bombs and counterinsurgency techniques for the war in Vietnam as well as guidance systems for nuclear missiles.MIT Review Panel on Special Laboratories Final Report; S.Leslie, The Cold War and American Science. The military-industrial complex at MITand Stanford; M.Albert, Remembering Tomorrow, pp. 97–99; 'MIT may be dangerous to the world', The Tech, 28/4/72, p. 5; 'Why Smash MIT?' in I. Wallerstein, University Crisis Reader, vol. 2, pp. 240–3; The Technology Review, December 1969. The Union of Concerned Scientists was founded on March 4, 1969 during a meeting of faculty members and students seeking to shift the emphasis on military research toward environmental and social problems. MIT ultimately divested itself from the Instrumentation Laboratory and moved all classified research off-campus to the MIT Lincoln Laboratory facility in 1973 in response to the protests. The student body, faculty, and administration remained comparatively unpolarized during what was a tumultuous time for many other universities. Johnson was seen to be highly successful in leading his institution to \"greater strength and unity\" after these times of turmoil. However six MIT students were sentenced to prison terms at this time and some former student leaders, such as Michael Albert and George Katsiaficas, are still indignant about MIT's role in military research and its suppression of these protests.'Battering Ram: The occupation of the president's office', The Tech, 14/12/71 p. 4 and The Tech, 4/8/72; M.Albert, Remembering Tomorrow pp. 9, 97–99; 'Michael Albert interview', 17/4/07; G.Katsiaficas, 'Review of Howard Johnson's Holding the Center; S.Shalom, 'A flawed political biography' , New Politics, Issue 23. (Richard Leacock's film, November Actions, records some of these tumultuous events.November Actions youtube extract'. See also: MIT Museum photos of student activism, 1960s/1970s.)"]}, {"page": "Robert J. Flaherty", "response": ["Louisiana Story (1948) was a Flaherty documentary shot by himself and Richard Leacock, about the installation of an oil rig in a Louisiana swamp. The film stresses the rig's peaceful and unproblematic coexistence with the surrounding environment, and it was in fact funded by Standard Oil, a petroleum company. The main character of the film is a Cajun boy. The poetry of childhood and nature, some critics argue, is used to make the exploration of oil look beautiful. Virgil Thomson composed the music for the film."]}, {"page": "1921", "response": ["** Richard Leacock, British-born documentary filmmaker, pioneer of Cinéma Vérité (d. 2011)"]}, {"page": "David Holzman's Diary", "response": ["I entered the world of movies when cinema vérité work like the Maysles brothers' and Richard Leacock's and D. A. Pennebaker's was new and exciting, and when a lot of underground filmmakers were trying to use the medium in a more poetic way, as an exercise in different kinds of liberation—you know, from personal liberation to liberation from the classical forms of filmmaking. So there were a lot of alternatives to Hollywood moviemaking then. These movies were all trying to find a new way of looking at life. And I was a young, idealistic filmmaker dealing with these same questions. You know: what is one supposed to be trying to do in the movies and how ought one go about doing it? My film, David Holzman's Diary, was about this guy who makes a diary of his own life to try to find some truth that he can't perceive in real time. It was meant to be kind of an ironical formula, let's say, to explore a lot of those ideas.", "Many writers have described David Holzman's Diary as a satire of documentary films or filmmakers. For example, that the film \"takes funny jabs\" at the self-importance or seriousness of practitioners of the new \"personal cinema.\" These were filmmakers who \"established a new relationship with their subjects: intimate, revelatory and personal, countering a documentary tradition in which human beings were primarily used to illustrate various social themes.\" Filmmakers including Richard Leacock, D.A. Pennebaker, Andrew Noren, and the Maysles brothers. Regarding the extent to which his film mocks such filmmakers, McBride says he was not criticizing specific works or people; instead, he was jabbing at ideas—popular ideas about film and truth:"]}, {"page": "Louisiana Story", "response": ["The boy, named in the film as Alexander Napoleon Ulysses Le Tour, but in the credits just identified as \"the boy\", was played by Joseph Boudreaux. The film was photographed by Richard Leacock and edited by Helen van Dongen, who were also the associate producers. Its original release was through independent film distributor Lopert Films."]}, {"page": "Man of Aran", "response": ["Richard Leacock, who went to school with the Flaherty's daughters and later worked as the cinematographer on Louisiana Story, says that Flaherty taught him to concentrate on finding images: “You look, you search. You think of the image not merely as a way of showing something but also as a way of withholding information, of creating tension in the viewer. Of not revealing too much. Of seeing things with different perspectives by using different focal-length lenses.”Leacock, Richard; On Working With Robert and Frances Flaherty April 26, 1990 Flaherty says he owes almost everything to these long lenses and with them captured some of the most memorable sea footage ever recorded.Barsam Corliss says Man of Aran was very different from his earlier work, “…the chiaroscuro compositions, charcoal rock, black-clad figures against a gray sky, are light-years removed from the natural grandeur of Nanook of the North or the easy elegance of Moana.Corliss, R; The Man in the Iron Myth, Film comment, Nov-Dec 1973 Corliss suggests there are enough similarities between Flaherty and John Ford, Chaplin, Borzage, even Disney that place him firmly in a tradition of the romantic visionary American.Corliss  Winston sees the influence of Flaherty in Leni Riefenstahl films, arguing that her aesthetics of manipulation owed much to his pioneering work.Winston  McLoon goes further, suggesting “the cult of beauty, and fetishism of courage” in Man of Aran are the tropes of Fascism.  He goes on to exonerate Flaherty of any Nazi connection saying “it is a measure of the apolitical nature of Flaherty’s vision that he was unaware of this problem inherent in his nineteenth-century primitive sensibility.”McLoon"]}, {"page": "Moana (1926 film)", "response": ["The youngest of the children Robert and Frances Flaherty brought with them to Samoa was their then-three-year-old daughter Monica. In 1975, Monica Flaherty returned to Savai'i to create a soundtrack for her parents' hitherto-silent film, including recording ambient sounds of village life, dubbed Samoan dialogue and traditional singing. The resulting \"Moana with Sound\" was completed in 1980, with help from filmmakers Jean Renoir and Richard Leacock, and first shown publicly in Paris in 1981. At that stage, however, with the original negative no longer in existence, the visual quality of Monica Flaherty's 16 mm print (a copy of a copy of her father's original 35 mm nitrate film) left much to be desired, and it was to suffer further degradation with time. More recently, however,  preservationist and curator Bruce Posner and Finnish filmmaker Sami van Ingen, a great-grandson of the Flahertys, drew on the best surviving 35 mm copies of the film to prepare, with the assistance of restorer Thomas Bakels, a digitally restored print, which was matched by sound expert Lee Dichter to Monica Flaherty’s soundtrack. The restored \"Moana with Sound\" was shown at the New York Film Festival on September 30, 2014, and has also appeared, among other showings, at the National Archives in Washington DC (January 2015). The program for the New York Film Festival describes the restored version as \"absolutely wondrous\".Film Society, Lincoln Center, The 52nd New York Film Festival, \"Moana with Sound\" (2014). National Gallery of Art (Washington DC), Film Programs, Special Events, Winter 2015, \"Moana with Sound\".  Smith, Nicola.  \"A Lost Documentary Restored\". Valley News, W. Lebanon, NH, October 3, 2014."]}, {"page": "Ross McElwee", "response": ["After graduating, McElwee lived for a year in Brittany, France, where he worked for a while as a wedding photographer's assistant.  Upon returning to the US,  he was admitted into MIT's new graduate filmmaking program, and graduated in 1977 with an M.S. While at MIT, he studied under documentarians Richard Leacock and Ed Pincus, both pioneers of the cinéma vérité movement, with whom he refined his first-person narrative approach. \"It was a new way of making films, to eliminate the film crew. You lose some technical polish, but it's much more intimate and less intimidating to your subjects. It allows you to shoot with the autonomy and flexibility of a photojournalist.\"Ken Gewertz. \"The world according to McElwee: A documentary filmmaker's unique personal vision\"   by Ken Gewertz, Harvard News Office, Harvard Gazette, 21 Apr 2005."]}, {"page": "Louise Brooks", "response": ["In her later years, Brooks rarely granted interviews, yet had special relationships with film historians John Kobal and Kevin Brownlow. In the 1970s, she was interviewed extensively on film for the documentaries Memories of Berlin: The Twilight of Weimar Culture (1976), produced and directed by Gary Conklin, and Hollywood (1980), by Brownlow and David Gill. Lulu in Berlin (1984) is another rare filmed interview, produced by Richard Leacock and Susan Woll, released a year before her death but filmed a decade earlier. In 1979, she was profiled by the film writer Kenneth Tynan in his essay \"The Girl in the Black Helmet\", the title an allusion to her bobbed hair, worn since childhood. In 1982, writer Tom Graves was allowed into Brooks's small apartment for an interview, and later wrote about the often awkward and tense conversation in his article \"My Afternoon with Louise Brooks\"."]}, {"page": "Dartington Hall", "response": ["With time more academic rigour was imposed, but it remained progressive and had mixed success educating the children, sometimes the more wayward ones, of the fee-paying parents. A noted alumnus was Lord Young, a founder of Which? and the Open University. Lucian Freud attended the school for two years and his brother Clement Freud was also a pupil there. Other noted alumni include Eva Ibbotson, songwriter Kit Hain, Ivan Moffat, Jasper Fforde, Sheila Ernst, Lionel Grigson, Miriam Gross, Martin Bernal, Matthew Huxley, Max Fordham, Oliver Postgate, Richard Leacock and the sculptor Sokari Douglas Camp."]}, {"page": "Cinéma vérité", "response": ["* Richard Leacock"]}, {"page": "Pilottone", "response": ["The new technology of pilottone was brought to international attention by its use by Richard Leacock, former cameraman of filmmaker Robert Flaherty, in his documentary feature Primary (1960), documenting the competing Democratic presidential nominee candidates Hubert Humphrey and John F. Kennedy. Diercks himself helped the spread of pilottone in the USA when he was the only Western reporter allowed to shoot in Havana during the Bay of Pigs Invasion in April 1961. CBS secured the licensing rights to Diercks's material via Norddeutscher Rundfunk (NWDR had split in 1956 into NDR and WDR), and brought it on air on May 14, 1961, ten days prior to the German broadcast of the same material. At a time when North-American TV program gathering was dominated by either Movietone (see also Movietone News) or magnetic pre-striping for live-sound recording, and the use of pilottone was still unheard of, according to Diercks the US TV networks were impressed with the system demonstrated by the 60-minute documentary feature."]}, {"page": "George Plimpton", "response": ["*Hickory Hill (1968) – narrator in Richard Leacock's documentary on the Annual Spring Pet Show at Robert F. Kennedy's Virginia estate, Hickory Hill (McLean, Virginia)"]}, {"page": "Aspen Movie Map", "response": ["Many people were involved in the production, most notably: Nicholas Negroponte, founder and director of the Architecture Machine Group, who found support for the project from the Cybernetics Technology Office of DARPA; Andrew Lippman, principal investigator; Bob Mohl, who designed the map overlay system and ran user studies of the efficacy of the system for his PhD thesis; Richard Leacock (Ricky), who headed the MIT Film/Video section and shot along with MS student Marek Zalewski the Cinéma vérité interviews placed behind the facades of key buildings; John Borden, of Peace River Films in Cambridge, Massachusetts, who designed the stabilization rig; Kristina Hooper Woolsey  of UCSC; Rebecca Allen; Scott Fisher, who matched the photos of Aspen in the silver-mining days from the historical society to the same scenes in Aspen in 1978 and who experimented with anamorphic imaging of the city (using a Volpe lens); Walter Bender, who designed and built the interface, the client/server model, and the animation system; Steve Gregory; Stan Sasaki, who built much of the electronics; Steve Yelick, who worked on the laserdisc interface and anamorphic rendering; Eric \"Smokehouse\" Brown, who built the metadata encoder/decoder; Paul Heckbert worked on the animation system; Mark Shirley and Paul Trevithick, who also worked on the animation; Ken Carson; Howard Eglowstein; and Michael Naimark, who was at the Center for Advanced Visual Studies and was responsible for the cinematography design and production."]}, {"page": "Primary (film)", "response": ["Produced by Robert Drew and shot by Richard Leacock, D. A. Pennebaker, Terence Macartney-Filgate, and Albert Maysles, the film was a breakthrough in documentary film style. Most importantly, through the use of mobile cameras and lighter sound equipment, the filmmakers were able to follow the candidates as they wound their way through cheering crowds, cram with them into cars and crowded hotel rooms, and hover around their faces as they awaited polling results. This resulted in a greater intimacy than was possible with the older, more classical techniques of documentary filmmaking, and it established what has since become the standard style of video reporting."]}, {"page": "D. A. Pennebaker", "response": ["In 1959, Pennebaker joined the equipment-sharing Filmakers’ Co-op and co-founded Drew Associates with Richard Leacock and former LIFE magazine editor and correspondent Robert Drew. A crucial moment in the development of direct cinema, the collective produced documentary films for clients like ABC News (for their television series, Close-up) and Time-Life Broadcast (for their syndicated television series, Living Camera). Their first major film, Primary (1960), documented John F. Kennedy and Hubert Humphrey's respective campaigns in the 1960 Wisconsin Democratic Primary election. Drew, Leacock and Pennebaker, as well as photographers Albert Maysles, Terrence McCartney Filgate and Bill Knoll, all filmed the campaigning from dawn to midnight over the course of five days. Widely considered to be the first candid and comprehensive look at the day-by-day events of a Presidential race, it was the first film in which the sync sound camera could move freely with characters throughout a breaking story, a major technical achievement that laid the groundwork for modern-day documentary filmmaking. It would later be selected as an historic American film for inclusion in the Library of Congress' National Film Registry in 1990.", "* D.A. Pennebaker, Robert Drew, Hope Ryden and James Lipscomb discuss Mooney vs. Fowle and Richard Leacock"]}, {"page": "Sync sound", "response": ["This method was developed in the 1960s by pioneering filmmaker Richard Leacock. It was called Direct Cinema. Filmmakers abandoned the studio and went out on location to film, often with hand-held cameras. Cinema verite/Direct Cinema – description at Berkley University "]}, {"page": "Claude Fournier (filmmaker)", "response": ["Claude Fournier began his career in journalism then moved to the Radio-Canada as a news cameraman. He joined the National Film Board of Canada in 1957 as a writer and director, and he worked on early cinéma-vérité films such as À Saint-Henri le cinq septembre and La lutte. He left the Board to work in the United States with famed documentary filmmakers Richard Leacock and D.A. Pennebaker, then returned to Montreal in 1963 to set up his own production company, Rose Films."]}, {"page": "Squat Theatre", "response": ["The six founding members of Squat Theatre (shown left to right in the 1976 Paris photograph) are Peter (Breznyik) Berg, Marianne Kollar (3rd), Péter Halász, Anna Koós, Stephan Balint and Eva Buchmuller.PLACE DES ABBESSES, PARIS, photo_Eva Buchmuller_Buchmuller, Koós. Squat Theatre. Artist Space, 1996, p.48-49. Other members of Squat Theatre were: Eric Daillie, Agnes Santha, Klara Palotai, Eszter Balint, Boris Major, Rebecca Major, and Judith Galus Halasz. Important contributing actors were Sheryl Sutton, Sandi Fiddler, Kathleen Kendall, Nico, Yossi Gutmann (viola), Shirley Clarke, Richard Leacock, August Darnell, Mark Boone Junior, Sue Williams, Jane Smith, Larry Solomon, Ivan Jakovits and Jan Gontarczyk. Boris and Rebecca Major are the daughters of János Major. ", "* Let Me Love You, (1985), 36 minutes, B&W, 16mm. Directed by Stephan Balint. Part of the play Dreamland Burns. Exhibited at Montreal, International Festival of New Cinema & Video. (Festival du nouveau cinéma). With Shirley Clarke, Richard Leacock and August Darnell."]}, {"page": "Richard Pearce (director)", "response": ["He attended Yale University, where he earned a B.A., English in 1965 where he met D.A. Pennebaker; afterwards he moved to New York City working with Pennebaker and Richard Leacock on several documentaries. The Blues·The Road to Memphis·Biography-PBS"]}, {"page": "Leacock", "response": ["*Richard Leacock (1921–2011), British-born documentary film director, pioneer of Direct Cinema and Cinéma vérité"]}, {"page": "Philip Leacock", "response": ["Philip David Charles Leacock (8 October 1917 – 14 July 1990) was an English television and film director and producer. His brother was documentary filmmaker Richard Leacock."]}, {"page": "Bedales School", "response": ["*Richard Leacock (born 1921), documentary film director"]}, {"page": "The Good War", "response": ["*\"Up Front with Pen, Camera, and Mike\" -- John Houseman, Herman Kogan, Henry Hatfield, Alfred Duckett, Milton Caniff, Garson Kanin, Bill Mauldin, Richard Leacock, Walter Rosenblum"]}, {"page": "Direct cinema", "response": ["In the United States, Robert Drew, a journalist with Life magazine after the war, decided to apply the photojournalist method to movies. He founded Drew Associates, which included Richard Leacock, D.A. Pennebaker, Terence Macartney-Filgate, and Albert and David Maysles.\"The Hollywood film is an escape of one sort or another. But our films make it damn near impossible to escape. We're interested in what you can't escape from and presenting it... Some people get a little edgy when they see something that is so personal. They don't know where to turn to look for the kind of buffer that most movies give them. In fiction you can say 'it's only a movie' and forget it. You can't do that with reality.\" —Albert Maysles to The New York Times, 18 October 1987)  They started experimenting with technology, syncing camera and sound with the parts of a watch. In 1960, this group produced three films for Time-Life Broadcast:  Yanqui, No!, Eddie (On the Pole), and Primary.", "* Chiefs – Richard Leacock, 1968", "* Tread – Richard Leacock, 1972"]}, {"page": "Monterey Pop", "response": ["Monterey Pop is a 1968 American concert film by D. A. Pennebaker that documents the Monterey Pop Festival of 1967. Among Pennebaker's several camera operators were fellow documentarians Richard Leacock and Albert Maysles. The painter Brice Marden has an \"assistant camera\" credit, and Bob Neuwirth, who figured prominently in Pennebaker's Bob Dylan documentary Dont Look Back, acted as stage manager. Titles for the film were by the illustrator Tomi Ungerer. Featured performers include Big Brother and the Holding Company with Janis Joplin, Jefferson Airplane, Hugh Masekela, Otis Redding, Ravi Shankar, the Mamas & the Papas, The Who and The Jimi Hendrix Experience, whose namesake set his guitar on fire, broke it on the stage, then threw the neck of his guitar in the crowd at the end of \"Wild Thing\"."]}, {"page": "Albert and David Maysles", "response": ["By 1960, the Maysles brothers had joined Drew Associates, the documentary film company founded by photojournalist Robert Drew which also included Richard Leacock and D. A. Pennebaker. Albert would film, while David would handle sound. During this time, the brothers worked on Drew Associates films such as Primary and Adventures on the New Frontier. In 1962, Albert and David left Drew Associates to form their own production company, Maysles Films, Inc."]}, {"page": "Sara Dylan", "response": ["After Hans and Sara separated, Sara went to work as a secretary for the film production division of the Time Life company, where filmmakers such as Richard Leacock and D. A. Pennebaker were impressed with her resourcefulness. \"She was supposed to be a secretary,\" said Pennebaker, \"but she ran the place.\" Sara introduced Bob Dylan and Albert Grossman to Pennebaker, the director who would make the film Dont Look Back, about Dylan's UK tour in April 1965."]}, {"page": "List of directors and producers of documentaries", "response": ["*Richard Leacock"]}, {"page": "Full Frame Documentary Film Festival", "response": ["* 2006: Richard Leacock"]}, {"page": "Hot Docs Canadian International Documentary Festival", "response": ["Each year, the Hot Docs Board of Directors celebrates a distinguished filmmaker and their career with the Hot Docs Outstanding Achievement Award. Recipients include: Barbara Kopple (2018), Tony Palmer (2017), Steve James (2016), Patricio Guzmán (2015), Adam Curtis (2014), Les Blank (2013), Michel Brault (2012), Terence Macartney-Filgate (2011), Kim Longinotto (2010), Alanis Obomsawin (2009), Richard Leacock (2008), Heddy Honigmann (2007), Werner Herzog (2006), Errol Morris (2005), Michael Maclear (2004), Nick Broomfield (2003), Frederick Wiseman (2002), D. A. Pennebaker and Chris Hegedus (2000) and Albert Maysles (1999)."]}, {"page": "Nelo Risi", "response": ["Born in Milan, Risi graduated in medicine, as did his brother Dino, then with the outbreak of the Second World War he fought on the Russian front and was interned in Switzerland. He started his poetical production in 1941, with the collection Le opere e i giorni. With the end of the war he moved to Paris where he joined a group of filmmakers, led by the Americans Richard Leacock and John Ferno, engaged in documenting the disaster of the war in Europe through a series of human-geography documentary films.  During this time Risi also published his second collection of poems (L'esperienza, 1948) and worked as a translator of poetry works by Pierre Jean Jouve, Constantine P. Cavafy, Sophocles, Jules Laforgue and others."]}, {"page": "Robert Drew", "response": ["He formed Drew Associates around this time. Some of his early experiments premiered on The Ed Sullivan Show and The Jack Paar Show. Drew recruited like-minded filmmakers including Richard Leacock, D.A. Pennebaker, Terence Macartney-Filgate, and Albert Maysles, who all have had internationally renowned careers. They experimented with technology, syncing camera and sound with the parts of a watch. For Primary, Drew had Mitch Bogdanovich make smaller 16mm cameras that allowed for handheld use Issa, 2016", "* Richard Leacock, \"The Feeling of Being There: a filmmaker's memoir,\" Semeion Editions, 2011"]}, {"page": "Highlander: The Series (season 3)", "response": ["* Richard Leacock ... Jamal "]}, {"page": "Hand-held camera", "response": ["This trend, led by Michel Brault, was followed by Raoul Coutard's work in the French New Wave and the cinéma vérité, \"fly-on-the-wall\" documentary film aesthetic. In the case of the latter, Richard Leacock and D.A. Pennebaker actually had to force the 16 mm technology forward themselves through a number of extensive camera and audio recording equipment modifications in order to achieve longer-take, sync sound, observational films, beginning with Primary (1960)."]}, {"page": "Joyce Chopra", "response": ["* A Happy Mother's Day (1963) co-directed with Richard Leacock"]}, {"page": "List of Canadian films", "response": ["| Frames of Reference || Richard Leacock || || Documentary ||"]}, {"page": "Eleanor Leacock", "response": ["Leacock attended New York public schools during her childhood until her teenage years, when she got a scholarship to the prestigious private high school Dalton School. Also on scholarship, she started undergraduate courses in anthropology at Radcliffe College in 1939. At Radcliffe, she was introduced by Carleton S. Coon to the neo-evolutionary thought of V. Gordon Childe and C. Daryll Forde. She also became involved in studying Lewis H. Morgan and Karl Marx and in radical student politics. There she also met filmmaker Richard Leacock, whom she married in 1941. After curfew violations, Radcliffe authorities asked her to leave and she transferred to Barnard College in 1942. She studied under Gladys Reichard, graduating from Barnard in 1944 with a bachelor of arts degree in anthropology."]}, {"page": "Ingeborg Fülepp", "response": ["She studied film editing and film analysis at the Academy for Theatre, Film and Television at the University of Zagreb and later education, video and interactive media between others by ptof. Carol Chomsky, and prof. Howard Gardner at Harvard University in Cambridge, (the USA) and with prof. Richard Leacock  and prof. Glorianna Davenport at the Massachusetts Institute of Technology  - MIT Media Lab in Boston (the USA)."]}, {"page": "Noel Parmentel", "response": ["Parmentel collaborated with his friend Richard Leacock, the pioneer in modern documentary filmmaking, on several films that became lasting classics, including Campaign Manager, following the activities of the manager of the 1964 Goldwater campaign;HRWIFF: Film Archive - Campaign Manager Chiefs, about a police chiefs' convention in 1968 in Hawaii; and the Emmy-winning Ku Klux Klan - the Invisible Empire, broadcast on CBS in 1965. He was involved in several feature film projects, none of which reached the screen, including a film adaptation of Robert Penn Warren's novel Night Rider; a film adaptation of Walker Percy's philosophical novel The Moviegoer, which was to have featured Blythe Danner;And Next Sunday She's Getting Married, New York Times, December 7, 1969, http://select.nytimes.com/mem/archive/pdf?res=F30B16FE345E1A7B93C5A91789D95F4D8685F9 a film adaptation of Ole Edvart Rølvaag's classic Giants in the Earth; Mallory, about a character strongly reminiscent of Joseph P. Kennedy; and Missy, about a character strongly reminiscent of a prominent apostle of Women's Lib.  The director Jim McBride borrowed Parmentel's surname, and some perceived personal characteristics, for the character played by Charles Ludlam in McBride's film The Big Easy.Roger Ebert review, http://rogerebert.suntimes.com/apps/pbcs.dll/article?AID=/19870821/REVIEWS/708210302/1023"]}]}}