{"wiki_id": "http://www.wikidata.org/entity/Q1365832", "itemLabel": "Tony Hancock", "itemDescription": "English comedy actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Tony_Hancock", "wikipedia_page": {"main": "Anthony John Hancock (12 May 1924 – 25 June 1968) was an English comedian and actor.High-profile during the 1950s and early 1960s, he had a major success with his BBC series Hancock's Half Hour, first broadcast on radio from 1954, then on television from 1956, in which he soon formed a strong professional and personal bond with comic actor Sid James. Although Hancock's decision to cease working with James, when it became known in early 1960, disappointed many at the time, his last BBC series in 1961 contains some of his best-remembered work (including \"The Blood Donor\" and \"The Radio Ham\"). After breaking with his scriptwriters Ray Galton and Alan Simpson later that year, his career declined.\n\n", "link_mentions": [{"page": "List of comedians", "response": ["* Tony Hancock (1924–1968)"]}, {"page": "Dalek", "response": ["Before he wrote the first Dalek serial, Nation was a scriptwriter for the comedian Tony Hancock. The two men had a falling out and Nation either resigned or was fired.Miles (2006), p. 40 Hancock worked on several series proposals, one of which was called From Plip to Plop, a comedic history of the world that would have ended with a nuclear apocalypse, the survivors being reduced to living in dustbin-like robot casings and eating radiation to stay alive. According to Hancock's biographer Cliff Goodwin, when Hancock saw the Daleks he allegedly shouted at the screen, \"That bloody Nation — he's stolen my robots!\""]}, {"page": "Elvis Costello", "response": ["Declan Patrick MacManus, OBE (born 25 August 1954),His full given name is sometimes inaccurately listed as Declan Patrick Aloysius MacManus, including as published in the Birthday Honours List 2019, in which he received his OBE and which is often considered authoritative of such matters, but Aloysius was not one of his names at birth. Costello began using the name \"Declan Patrick Aloysius MacManus\" (or sometimes, \"D.P.A. MacManus\") in both the writing and production credits of his albums in 1986, although this was largely phased out by the mid-1990s. It has been suggested that Aloysius could be his confirmation name, or that the use of the name Aloysius is a reference to English comedian Tony Hancock, born Anthony John Hancock, who became famous in the UK playing a comic character who went by the name Anthony Aloysius St. John Hancock. In addition, his father's surname was originally McManus 'before my Dad added an a to make it \"MacManus\" because it looked posher and better in print'. (See the autobiography Unfaithful Music & Disappearing Ink, Chapter One, pp. 1-2, Penguin Random House UK, .) known professionally as Elvis Costello, is an English singer-songwriter. He has won multiple awards in his career, including Grammy Awards in 1999 and 2020,Grammy Award Winners 2020 List by Zoe Haylock, Vulture.com, 26 January 2020. and has twice been nominated for the Brit Award for Best British Male Artist.Elvis Costello BRITS Profile  BRIT Awards Ltd In 2003, he was inducted into the Rock and Roll Hall of Fame.Elvis Costello and the Attractions  Rockhall.com. In 2004, Rolling Stone ranked Costello number 80 on its list of the 100 Greatest Artists of All Time.100 Greatest Artists: Elvis Costello Rolling Stone."]}, {"page": "Harry Secombe", "response": ["Secombe met Michael Bentine at the Windmill Theatre, and he was introduced to Peter Sellers by his agent Jimmy Grafton. Both Milligan and Sellers credited him with keeping the act on the bill when club owners had wanted to sack them. Together with Spike Milligan, the four wrote a comedy radio script, and Those Crazy People was commissioned\"Comedy The Goon Show\", BBC website and first broadcast on 28 May 1951. Produced by Dennis Main Wilson, this soon became The Goon Show and the show remained on the air until 1960. Secombe mainly played Neddie Seagoon, around whom the show's absurd plots developed. In 1955, whilst appearing on The Goon Show, Secombe was approached by the BBC to step in at short notice to take the lead in the radio comedy Hancock's Half Hour. The star of the show, Tony Hancock, had decided to take an unannounced break abroad the day before the live airing of the second season. Secombe appeared in the lead for the first three episodes and had a guest role in the fourth after Hancock's return. All four episodes are lost, but following the discovery of the original scripts the episodes were rerecorded in 2017, with Andrew Secombe performing the role held by his late father."]}, {"page": "June 25", "response": ["*1968 – Tony Hancock, English comedian and actor (b. 1924)"]}, {"page": "May 12", "response": ["*  1924   – Tony Hancock, English actor, producer, and screenwriter (d. 1968)"]}, {"page": "Peter Sellers", "response": ["In 1951 the Goons made their feature film debut in Penny Points to Paradise. Sellers and Milligan then penned the script to Let's Go Crazy, the earliest film to showcase Sellers's ability to portray a series of different characters within the same film, and he made another appearance opposite his Goons co-stars in the 1952 flop, Down Among the Z Men. In 1954, Sellers was cast opposite Sid James, Tony Hancock, Raymond Huntley, Donald Pleasence and Eric Sykes in the British Lion Film Corporation comedy production, Orders Are Orders. John Grierson believes that this was Sellers's breakthrough role on screen and credits this film with launching the film careers of both Sellers and Hancock."]}, {"page": "Sid James", "response": ["Appearing in British films from 1947, he was cast in numerous small and supporting roles into the 1950s. In 1951 he starred alongside Alec Guinness in The Lavender Hill Mob, ranked 17th out of the 100 best British films by the British Film Institute. His profile was raised as Tony Hancock's co-star in Hancock's Half Hour, first in the radio series and later when it was adapted for television and ran from 1954 to 1960. Afterwards, he became known as a regular performer in the Carry On films, appearing in nineteen films of the series, with the top billing role in 17 (in the other two he was cast below Frankie Howerd). Meanwhile, his starring roles in television sitcoms continued for the rest of his life. He starred alongside Diana Coupland in the 1970s sitcom Bless This House until his death in 1976.", "His first major comedy role was in The Lavender Hill Mob (1951): with Alfie Bass, he made up the bullion robbery gang headed by Alec Guinness and Stanley Holloway. He also appeared in Lady Godiva Rides Again and The Galloping Major, both films were released in 1951, and as Harry Hawkins in The Titfield Thunderbolt (1953), and also had a lead role in The Wedding of Lilli Marlene. He featured in another Alec Guinness film, Father Brown (US: The Detective, 1954) and in Trapeze (1956) as Harry the snake charmer, a circus film which was one of the most successful films of its year, and he played Master Henry in \"Outlaw Money\" (also 1956), an episode of The Adventures of Robin Hood. James had a supporting part as a TV advertisement producer in Charlie Chaplin's A King in New York, a non-comic supporting role as a journalist in the science-fiction film Quatermass 2, and he performed in Hell Drivers (all 1957), a film with Stanley Baker. The next year, James starred with Miriam Karlin in East End, West End by Wolf Mankowitz, a half-hour comedy series for the ITV company Associated Rediffusion. Set within the Jewish community of London's East End, the series of six episodes was transmitted in February and March 1958, but plans for further episodes were abandoned after a disappointing response. For a while though, it had looked as if his commitment elsewhere might end his work with Tony Hancock, one of the most popular television comedians of the time.Cliff Goodwin Sid James: A Biography, London: Virgin Books, 2001, p.121-22", "In 1954, he had begun working with Tony Hancock in his BBC Radio series Hancock's Half Hour. Having seen him in The Lavender Hill Mob, it was the idea of Hancock's writers, Ray Galton and Alan Simpson, to cast James. He played a character with his own name (but having the invented middle name Balmoral) who was a petty criminal and would usually manage to con Hancock in some way, although the character eventually ceased to be Hancock's adversary. With the exception of James, the other regular cast members of the radio series were dropped when the series made the transition to television. His part in the show now greatly increased and many viewers came to think of Hancock and James as a double act."]}, {"page": "1950s", "response": ["* Tony Hancock"]}, {"page": "1968", "response": ["* June 25 – Tony Hancock, English comedian and actor (b. 1924)"]}, {"page": "1924", "response": ["** Tony Hancock, English comedian (d. 1968)"]}, {"page": "Kenneth Williams", "response": ["Kenneth Charles Williams (22 February 1926 – 15 April 1988) was an English actor. He was best known for his comedy roles and in later life as a raconteur and diarist. He was one of the main ensemble in 26 of the 31 Carry On films, and appeared in many British television programmes and radio comedies, including series with Tony Hancock and Kenneth Horne, as well as being a regular panellist on BBC Radio 4's comedy panel show Just a Minute from its second series in 1968 until his death 20 years later.", "Williams's professional career began in 1948 in repertory theatre. Failure to become a serious dramatic actor disappointed him, but his potential as a comic performer gave him his break when he was spotted playing the Dauphin in Bernard Shaw's St Joan in the West End, in 1954 by radio producer Dennis Main Wilson. Main Wilson was casting Hancock's Half Hour, a radio series starring Tony Hancock. Playing mostly funny voice roles, Williams stayed in the series almost to the end, five years later. His nasal, whiny, camp-cockney inflections (epitomised in his \"Stop messing about ... !\" catchphrase) became popular with listeners. Despite the success and recognition the show brought him, Williams considered theatre, film and television to be superior forms of entertainment. In 1955 he appeared in Orson Welles's London stage production Moby Dick—Rehearsed. The pair fell out after Williams became annoyed with Welles's habit of continually changing the script."]}, {"page": "Soho", "response": ["The Windmill Theatre was based on Great Windmill Street, and was named after a windmill at this location that was demolished in the 18th century. It initially opened as the Palais de Luxe in 1910 as a small cinema, but was unable to compete with larger venues and was converted into a theatre by Howard Jones. It re-opened in December 1931, but was still unsuccessful. In 1932, the general manager Vivian Van Damm introduced a non-stop variety show throughout the afternoon and evening. It was famous for its nude tableaux vivants, in which the models had to remain motionless to avoid the censorship laws then in place. The theatre claimed that, aside from a compulsory closure between 4 and 16 September 1939, it was the only theatre in London which did not close during World War II, leading to the slogan \"We never closed\". Several prominent comedians including Harry Secombe, Jimmy Edwards and Tony Hancock began their careers at the Windmill. It closed on 31 October 1964 and was again turned into a cinema."]}, {"page": "British sitcom", "response": ["Some of the scripts written for Hancock by the wining partnership, Ray Galton and Alan Simpson, almost repudiated a narrative structure altogether and attempted to reproduce an everyday environment with the intention of also reproducing its comedy. Both the character played by Tony Hancock in Hancock's Half Hour, and Harold Steptoe played by Harry H. Corbett (1962–1965, 1970–1974), are pretentious, would-be intellectuals who find themselves trapped by the squalor of their lives. The Galton and Simpson comedies are often characterised by a bleak and somewhat fatalistic tone. Steptoe and Son in particular is, at times, extremely black comedy, and close in tone to Social realism drama.", "Hancock's Half Hour (1956–1961) by Galton and Simpson was transferred to television in 1956 after 48 episodes on BBC radio beginning in 1954. It was the first such series in TV sitcom's modern form. While moving away from audio variety towards emphasis on character development, the radio series had been influential in the development of TV situation comedy. The radio series continued to overlap with its TV version. Apart from Tony Hancock, who plays a fictionalised version of himself: a loser whose plans and aspirations are continually ruined by bad luck, its only other regular cast member was the more worldly sidekick played by Sid James later of Carry On fame. Other occasional participants included  , Kenneth Williams Carry On, and Patricia Hayes known for her parts in comedies such as The Arthur Askey Show, The Benny Hill Show, Bootsie and Snudge, Hugh and I and Till Death Us Do Part.Dennis Barker, \"Hayes, Patricia Lawlor (1909–1998)\", Oxford Dictionary of National Biography, Oxford University Press, Sept 2004 available online. Retrieved 18 June 2020. Hancock's biographer John Fisher dates the first use of the term 'situation comedy' in British broadcasting to a BBC memo dated 31 March 1953 from radio comedy producer Peter Eton, suggesting the format as the ideal vehicle for Hancock's comedic style.John Fisher Tony Hancock. The Definitive Biography, London: Harper Collins, 2008, p. 138 \"Hancock's persona of the pompous loser out of his depth in an uncomprehending society still informs many programmes today\", according to Phil Wickham.Phil Wickham \"Sitcom\", BFI screenonline The final series of this show was broadcast under the shorter title Hancock. Following the end of the BBC series, changed his writers and moved to the ITV in 1963 for a further series also named Hancock for 13 episodes. The series, though relatively well received, greatly lacked the quality of the BBC productions."]}, {"page": "Queen Elizabeth The Queen Mother", "response": ["In March 2011, her eclectic musical taste was revealed when details of her small record collection kept at the Castle of Mey were made public. Her records included ska, local folk, Scottish reels and the musicals Oklahoma! and The King and I, and artists such as yodeller Montana Slim, Tony Hancock, The Goons and Noël Coward."]}, {"page": "Kenneth Horne", "response": ["Before the planned fifth series of Round the Horne began recording, Horne died of a heart attack while hosting the annual Guild of Television Producers' and Directors' Awards; Round the Horne could not continue without him and was withdrawn. The series has been regularly re-broadcast since his death. A 2002 BBC radio survey to find listeners' favourite British comedian placed Horne third, behind Tony Hancock and Spike Milligan.", "Horne has been the subject of two biographies, Norman Hackforth's Solo for Horne in 1976 and Barry Johnston's Round Mr Horne: The Life of Kenneth Horne in 2006. In 1998 Ernie Wise unveiled a blue plaque to Horne at BBC Broadcasting House. Editions of Beyond Our Ken and Round the Horne are regularly broadcast on the digital radio service BBC Radio 4 Extra, and by 2006 over half a million copies of tapes and CDs of Round the Horne had been sold by the BBC. In a 2002 survey conducted by the BBC to find listeners' favourite British comedian, Horne appeared third, behind Tony Hancock and Spike Milligan."]}, {"page": "The Archers", "response": ["Tony Hancock starred in the Galton and Simpson spoof \"The Bowmans\" in an episode of BBC Television's Hancock's Half Hour.\"The Bowmans\" , Hancock's Half Hour"]}, {"page": "Willie Rushton", "response": ["During the late 1960s, Rushton spent much of his time in Australia, following Dorgan back to her homeland. He married her in 1968. He also had several series of his own on Australian television, Don’t Adjust Your Set – The Programme is at Fault and From Rushton with Love. He said of Australia, \"They've got their priorities right, they're dedicated to lying in the sun, knocking back ice-cold beer\". During this period he found time to model for She magazine and also appear in a 1967 stage production of Treasure Island as Squire Trelawney, alongside Spike Milligan and Barry Humphries, at the Mermaid Theatre in London. It was on one of his return visits to the UK in 1968 that he also brought back the late Tony Hancock's ashes to the UK in an Air France bag – \"My session with the Customs was a Hancock's Half Hour in itself.\""]}, {"page": "List of British comedians", "response": ["*Tony Hancock (1924–1968), Hancock's Half Hour", "*Tony Hancock (1924–1968), Hancock's Half Hour"]}, {"page": "The Magic Roundabout", "response": ["The English version of Dougal was generally disparaging and had similarities with the television character of Tony Hancock, an actor and comedian. Ermintrude was rather matronly and fond of singing. Dylan was a hippy-like, guitar-playing rabbit, and rather dopey. Florence was portrayed as courteous and level-headed. Brian was unsophisticated but well-meaning."]}, {"page": "Eric Sykes", "response": ["Eric Sykes  (4 May 1923 – 4 July 2012) was an English radio, stage, television and film writer, comedian, actor, and director whose performing career spanned more than 50 years. He frequently wrote for and performed with many other leading comedy performers and writers of the period, including Tony Hancock, Spike Milligan, Tommy Cooper, Peter Sellers, John Antrobus, and Johnny Speight. Sykes first came to prominence through his many radio credits as a writer and actor in the 1950s, most notably through his collaboration on The Goon Show scripts. He became a TV star in his own right in the early 1960s when he appeared with Hattie Jacques in several popular BBC comedy television series.", "Sykes had begun to write for television as early as 1948, but from the early 1950s Sykes began to make an ultimately successful transition from radio to TV, writing a number of series episodes and one-off shows for the BBC. His credits in this period include The Howerd Crowd (1952), Frankie Howerd's Korean Party, Nuts in May, and The Frankie Howerd Show, as well as The Big Man (1954) starring Fred Emney and Edwin Styles. Sykes also made his first screen appearance at this time in the army film comedy Orders Are Orders (1954), which also featured Sid James, Tony Hancock, Peter Sellers, Bill Fraser, and Donald Pleasence.", "In 1956, Sykes performed, wrote scripts, and acted as script editor for the pioneering Rediffusion TV comedy The Idiot Weekly, Price 2d, the first attempt to translate the humour of the Goons to television. It starred Peter Sellers, with Sykes, Kenneth Connor, and Valentine Dyall. During this year he also made his second film appearance, playing a minor role in the Max Bygraves film Charley Moon, which also featured Bill Fraser, Peter Jones, Dennis Price, and (as a child) Jane Asher. During 1956–57, Sykes also wrote for and performed in The Tony Hancock Show, where he again worked with Hattie Jacques.", "At the turn of the decade Eric Sykes and his old friend and colleague Hattie Jacques co-starred in a new 30-minute BBC TV sitcom, Sykes and a..., which Sykes created in collaboration with writer Johnny Speight, who had worked with him earlier in the 1950s on the two Tony Hancock series for ITV. The original concept for the new series had Eric living in suburbia with his wife, with simple plots centring on everyday problems, but Sykes soon realised that by changing the house-mate from wife to sister it offered more scope for storylines and allowed either or both to become romantically entangled with other people."]}, {"page": "June Whitfield", "response": ["Her big break was a lead in the radio comedy Take It from Here, which aired on the BBC Light Programme in 1953. Television roles soon followed, including appearances with Tony Hancock throughout his television career. In 1966, Whitfield played the leading role in the television sitcom Beggar My Neighbour, which ran for three series. She also appeared in four Carry On films: Carry On Nurse (1959), Carry On Abroad (1972), Carry On Girls (1973), and Carry On Columbus (1992).", "Her big break came in 1953 when she replaced Joy Nichols in the successful Frank Muir and Denis Norden radio comedy Take It from Here, co-starring Jimmy Edwards and Dick Bentley. In the portion of the show known as \"The Glums\" she played Eth, fiancée of the dim Ron Glum (played by Bentley). During the next fifteen years Whitfield had many supporting roles on television, including in Dixon of Dock Green, Arthur's Treasured Volumes, The Arthur Askey Show, Faces of Jim, The Benny Hill Show, Steptoe and Son and Frankie Howerd. She played the nurse in the opening scene of \"The Blood Donor\" (Hancock, 1961). June's daughter Suzy Aitchison would play the same role in the 2009 re-recording  with Paul Merton portraying Tony Hancock.", "| The Tony Hancock Show"]}, {"page": "British comedy", "response": ["In the 1940s and 1950s, variety dominated the schedules, and popular series included ITMA and Much Binding in the Marsh. In the mid-1950s, however, two notable series emerged which would help to shape the future of radio and television comedy in Britain. The Goons (Peter Sellers, Spike Milligan and Harry Secombe) starred in their own anarchic series The Goon Show which ran throughout the 1950s. At the same time, the BBC was also running Hancock's Half Hour starring Tony Hancock, the first of a new generation of comedies based on believable characters and situations. Hancock's Half Hour later transferred to TV and was phenomenally successful throughout the 1950s, running concurrently on radio and television until 1960."]}, {"page": "12 Angry Men (1957 film)", "response": ["The film has also been subject to parody. In 2015, the Comedy Central TV series Inside Amy Schumer aired a half-hour parody of the film titled \"12 Angry Men Inside Amy Schumer\". The BBC Television comedy Hancock's Half Hour, starring Tony Hancock and Sid James, and written by Ray Galton and Alan Simpson, was parodied in the episode broadcast on October 16, 1959. Family Guy paid tribute to the film with its Season 11 episode titled \"12 and a Half Angry Men\", and King of The Hill acknowledged the film with their parody \"Nine Pretty Darn Angry Men\" in season 3. "]}, {"page": "Addiscombe", "response": ["Addiscombe railway station, located about circa 500 metres west of Addiscombe's main shopping parade, closed in 1997 following the withdrawal of services from Elmers End and was then demolished, being replaced by housing. Part of the old track between Woodside and Addiscombe railway stations is now Addiscombe Railway Park and part, the former Station area, has been redeveloped for housing as East India Way. Bingham Road station also formerly served the area; it was located roughly where Addiscombe tram stop now is, before closing in 1983. The former rail station featured in the opening scenes of the 1961 Tony Hancock film The Rebel. The nearest train station is now East Croydon."]}, {"page": "Cheam", "response": ["In the comedy show Hancock's Half Hour, Tony Hancock lived in the fictional road Railway Cuttings, in East Cheam. Though not in existence today, the census of 1841 includes the place-names East Cheam, North Cheam, Garden Green and Cheam Common, which indicates that East Cheam did exist officially in name and was not fictional.", "* Tony Hancock (1924–1968), comedian, lived in and set his sketches in Cheam"]}, {"page": "List of suicides", "response": ["* Tony Hancock (1968), English comedian, overdose by vodka and amphetamines."]}, {"page": "Paul Merton", "response": ["Merton's breakthrough as a television performer came in 1988 with Channel 4's improvised comedy show Whose Line Is It Anyway?, which moved to TV from BBC Radio 4, though he had previously performed on the channel's Saturday Live and compered its series Comedy Wavelength in 1987. He remained on Whose Line until 1993. Have I Got News for You began in 1990, and two series of his own sketch show, Paul Merton: The Series, followed soon after. In 1995 he presented a documentary series celebrating the history of the London Palladium, entitled Paul Merton's Palladium Story. In 1996, Merton performed updated versions of fifteen of Ray Galton and Alan Simpson's old scripts for an ITV series, Paul Merton in Galton & Simpson's.... Six of these scripts were previously performed by Tony Hancock. These were very badly received by critics, and although a selection of episodes was initially released on VHS, it was not until June 2007 that the complete series was released on DVD."]}, {"page": "Mark Thomas", "response": ["After graduating, Thomas subsequently embarked on his comedy career, initially supporting himself through working on building sites with his father. Thomas' early exposure to comedy was through watching and listening to Dave Allen, Steptoe and Son, The Goon Show and Tony Hancock; his biggest influence was hearing a recording of Alexei Sayle: \"It was like someone had kicked the door in – just listening to that tape and thinking that someone could do this stuff\". He also cited the playwright Trevor Griffiths as an early influence, describing him as \"an absolute genius\". He went on to write material for Dave Allen."]}, {"page": "John Junkin", "response": ["In 1960 Junkin joined Joan Littlewood's Stratford East Theatre Workshop and played the lead in the original production of Sparrers Can't Sing. A few years later he joined the Royal Court Theatre company and was the foil to Tony Hancock in some of Hancock's last work for British television. He played a diverse range of roles on the small screen; however, he is best remembered for his comedy roles and his appearances as a television quiz master. Worldwide filmgoers will remember him best for playing \"Shake\", the assistant to Norman Rossington, in the Beatles film A Hard Day's Night. In comedy roles, Junkin was rarely short of work, on account of his ability to play the stony-faced symbol of low level, petty-minded and unquestioning authority, whether the army sergeant, police constable or site foreman.", "*The Blackpool Show (1966 series with Tony Hancock). – Himself"]}, {"page": "Harry Worth", "response": ["He was a variety act for many years before he became well known and was often at the bottom of any 'bill'. Having left the RAF, and adamant he would never go down the mines again, he started in show business with his first booking at the Bradford Mechanics' Institute in 1946. In 1947 he married his wife Kay and in 1948, like many other comedians from the forces, he got an audition at London's Windmill Theatre. Of 40 in the audition, he passed, along with Morecambe and Wise and Tony Hancock. He did six shows a day as comedian between fan dancers. In 1948 he also made his first radio appearance in a show New to You. He now had two dummies for his ventriloquist act, Fotheringay and Clarence, but meanwhile developed his performing voice."]}, {"page": "Hattie Jacques", "response": ["Jacques started her career in 1944 with an appearance at the Players' Theatre in London, but came to national prominence through her appearances on three highly popular radio series on the BBC: with Tommy Handley on It's That Man Again; with ventriloquist Peter Brough on Educating Archie; and then with Tony Hancock on Hancock's Half Hour. After the Second World War Jacques made her cinematic debut in Green for Danger (1946), in which she had a brief, uncredited role. From 1958 to 1974 she appeared in 14 Carry On films, playing various roles including the formidable hospital matron. On television she had a long professional partnership with Eric Sykes, with whom she co-starred in his long-running series Sykes and Sykes and a....  The role endeared her to the public and the two became staples of British television.", "On 6 June 1950 Jacques was cast in the first episode of the weekly radio show Educating Archie as Agatha Dinglebody. The \"Archie\" of the title was the ventriloquist's dummy Archie Andrews, operated by Peter Brough. The first series ran for 29 weeks until 19 December. In the show Jacques appeared alongside Max Bygraves, Julie Andrews, Beryl Reid and—in the second series—Tony Hancock. It was on this programme that she first worked with Eric Sykes, who was providing scripts for the series. Sykes had been impressed with Jacques since he visited the Players' in 1948. He later wrote that she \"moved about the stage with an elegance and grace as if she owned it. At the end of her act, to great applause, she leapt in the air, finishing in the splits, landing as softly as a snowflake in July\". After the show Sykes was introduced to Jacques backstage and thought that the meeting was \"the beginning of a new flight\" in his professional life. At the end of the series Jacques returned to the Players' to appear in the Christmas pantomime, Ali Baba and the Thirty-nine Thieves, which she and Joan Sterndale-Bennett had adapted after they had copied it out long-hand at the British Museum. The reviewer in The Times thought that Jacques was \"as appealing as last year\", in her performance as Ali Baba's wife, Cogia.", "A second pregnancy led to the birth of a son, Kim, \"who came rollicking and laughing into the world in October 1956, a trifle before his allotted time\", according to Le Mesurier. In June 1956 Jacques appeared in an episode of The Tony Hancock Show on ITV; this led to the role of Hancock's secretary, Griselda Pugh, in the BBC radio series Hancock's Half Hour. She appeared in 16 episodes from November 1956 to February 1957, alongside Hancock and regulars Sidney James, Bill Kerr and Kenneth Williams. Jacques's arrival on Hancock \"provided an additional boost to the series\", according to television historian Richard Webber. She appeared again in five further episodes of Hancock's Half Hour between April and June 1957, and again for a further 20 episodes between January and June 1958, before a special edition on Christmas Day 1958. She spent much of 1958 at the London Palladium, undertaking 380 performances of the revue Large as Life, alongside Terry-Thomas, Eric Sykes and Harry Secombe. She appeared in the sketches \"Concerto for Three Buffoons\" with Secombe and Sykes, \"The Good Old Days\", and the two full company numbers that closed each of the two halves of the show.", "Jacques's private life became complicated in 1963. The previous year she had met John Schofield, a cockney used-car dealer, who chauffeured her to a Leukaemia Research Fund event. The couple became romantically involved after the driver gave her the attention and support that Le Mesurier did not. When Jacques decided to move Schofield into the family home, Le Mesurier moved into a separate room. He later commented about this period: \"I could have walked out, but, whatever my feelings, I loved Hattie and the children and I was certain—I had to be certain—that we could repair the damage\". During these upheavals in her personal life, Jacques was surprised to be the subject of This Is Your Life in February 1963, when she was approached by Eamonn Andrews during rehearsal for the sixth series of Sykes and a.... Although Le Mesurier did not mention the marital situation when being questioned by Andrews, he made the comment that for Jacques \"the home comes first\", which Merriman considered had been said \"rather pointedly\". Despite the matrimonial upsets, Jacques and Le Mesurier both appeared in the 1963 Tony Hancock film, The Punch and Judy Man. In 1964 Le Mesurier moved out of the marital home, made a decision to protect Jacques from any negative publicity, and allowed her to bring a divorce suit on grounds of his own infidelity.  This ensured that the press blamed him for the break-up, casting Jacques as the victim in the matter.", "A memorial plaque to Jacques is situated in St Paul's, Covent Garden. In November 1995 a blue plaque was unveiled by Eric Sykes and Clive Dunn—a colleague from her Players' Theatre days—at her former house: 67 Eardley Crescent, Earls Court, London. In 2002 plaques were unveiled for Jacques, Sid James and Tony Hancock at BBC Broadcasting House in London."]}, {"page": "1962 in music", "response": ["*Hancock – Tony Hancock"]}, {"page": "John Le Mesurier", "response": ["Le Mesurier had a prolific film career, appearing mostly in comedies, usually in roles portraying figures of authority such as army officers, policemen and judges. As well as Hancock's Half Hour, Le Mesurier appeared in Tony Hancock's two principal films, The Rebel and The Punch and Judy Man. In 1971, Le Mesurier received his only award: a British Academy of Film and Television Arts \"Best Television Actor\" award for his lead performance in Dennis Potter's television play Traitor; it was one of his few lead roles.", "Le Mesurier undertook several roles on television in 1951, including that of Doctor Forrest in The Railway Children, the blackmailer Eduardo Lucas in Sherlock Holmes: The Second Stain, and Joseph in the nativity play A Time to be Born. The same year Tony Hancock joined Le Mesurier's second wife, Hattie Jacques (the couple had married in 1949 following his divorce from June Melville earlier that year) in the radio series Educating Archie. Le Mesurier and Hancock became friends; they would often go for drinking sessions around Soho, where they ended up in jazz clubs. After Hancock left Educating Archie in 1952 after one season,  the friendship continued, and Jacques joined the cast of Hancock's Half Hour during the fourth radio series in 1956.", "Le Mesurier's friendship with Tony Hancock provided a further source of work when Hancock asked him to be one of the regular supporting actors in Hancock's Half Hour, when it moved from radio to television. Le Mesurier subsequently appeared in seven episodes of the show between 1957 and 1960, and then in an episode of a follow-up series entitled Hancock. In 1958 he appeared in ten films, among them Roy Boulting's comedy Happy Is the Bride, about which Dilys Powell wrote in The Sunday Times: \"[M]y vote for the most entertaining contributions ... goes to the two fathers, John Le Mesurier and Cecil Parker\". In 1959, the busiest year of his career, Le Mesurier took part in 13 films, including I'm All Right Jack, which was the most successful of Le Mesurier's credited films that year; he also had an uncredited role as a doctor in Ben-Hur.", "Le Mesurier appeared in nine films in 1960, as well as nine television programmes, including episodes of Hancock's Half Hour, Saber of London and Danger Man. His work the following year included a part in Peter Sellers's directorial debut Mr. Topaze, a film which failed both critically and commercially. He provided the voice of Mr. Justice Byrne in a recording of excerpts from the transcript of R v Penguin Books Ltd.—the court case concerning the publication of D. H. Lawrence's Lady Chatterley's Lover—which also featured Michael Hordern and Maurice Denham. J.W. Lambert, reviewing for The Sunday Times, wrote that Le Mesurier gave \"precisely the air of confident incredulity which the learned gentleman exhibited in court\". Later that year he played Hancock's office manager in the first of Tony Hancock's two principal film vehicles, The Rebel.", "In 1962 he appeared in Wendy Toye's comedy film We Joined the Navy before reuniting with Peter Sellers in Only Two Can Play, Sidney Gilliat's film of the novel That Uncertain Feeling by Kingsley Amis; Powell noted with pleasure \"the armour of his gravity pierced by polite bewilderment\". She compared Le Mesurier with the well-known American straight-face comedian, John McGiver. After appearing in another Sellers film in 1962—Waltz of the Toreadors—Le Mesurier joined him in the 1963 comedy The Wrong Arm of the Law. Powell again reviewed the pair's film, commenting that \"I thought I knew by now every shade in the acting of John Le Mesurier (not that I could ever get tired of any of them); but there seems a new shade here\". The same year, he appeared in a third Sellers film, The Pink Panther, as a defence lawyer, and in the second and last of Tony Hancock's starring vehicles, The Punch and Judy Man. Le Mesurier played Sandman in the latter film; Powell wrote that the role \"allowed a gentler and subtler character than usual\". He also appeared in a series of advertisements for Homepride flour in 1964, providing the voice-over for the animated character Fred the Flourgrader; he continued as the voice until 1983.", "During the final stages of the breakdown of his marriage, Le Mesurier met Joan Malin at the Establishment club in Soho in 1963. The following year he moved out of his marital house, and that day proposed to Joan, who accepted his offer. Le Mesurier allowed Jacques to bring a divorce suit on grounds of his own infidelity, to ensure that the press blamed him for the break-up, thus avoiding any negative publicity for Jacques. Le Mesurier and Malin married in March 1966.General Register Office, England and Wales Civil Registration Indexes, volume 5b, p. 1040. A few months after they were married, Joan began a relationship with Tony Hancock, and left Le Mesurier to move in with the comedian. Hancock was a self-confessed alcoholic by this time, and was verbally and physically abusive to Joan during their relationship.", "Le Mesurier's second and third marriages have been the subject of two BBC Four biographical films, the 2008 Hancock and Joan on Joan Le Mesurier's affair with Tony Hancock—with Le Mesurier played by Alex Jennings—and the 2011 Hattie on Jacques's affair with John Schofield—with Le Mesurier played by Robert Bathurst. In We're Doomed! The Dad's Army Story, a 2015 comedy drama about the making of Dad's Army, Le Mesurier was portrayed by Julian Sands."]}, {"page": "Bournemouth", "response": ["A number of famous people came from Bournemouth. Tony HancockBirmingham City Council Website  retrieved 28 September 2017The Tony Hancock Archives website  retrieved 28 September 2017 lived for most of his early life in hotels in Bournemouth run by his parents."]}, {"page": "1968 in film", "response": ["*June 24 – Tony Hancock, 44, British comedian, Call Me Genius, The Punch and Judy Man"]}, {"page": "1963 in film", "response": ["*The Punch and Judy Man, starring Tony Hancock – (U.K.)"]}, {"page": "1961 in film", "response": ["* The Rebel, starring Tony Hancock – (U.K.)"]}, {"page": "Steptoe and Son", "response": ["The show had its roots in a 1962 episode of Galton & Simpson's Comedy Playhouse. Galton and Simpson's association with comedian Tony Hancock, for whom they had written Hancock's Half Hour, had ended and they had agreed to a proposal from the BBC to write a series of 10 comedy shows. The fourth in the series, \"The Offer\", was born both out of writer's block and budgetary constraints. Earlier shows in the series had cost more than expected, so the writers decided to write a two-hander set in one room. The idea of two brothers was considered but father and son worked best. Ronald Fraser was second choice for Harold."]}, {"page": "Victor Lewis-Smith", "response": ["Lewis-Smith's documentary, The Undiscovered Peter Cook, was the first in a series transmitted on BBC Four in November 2016. In December 2018, Lewis-Smith made three more documentaries in the style of The Undiscovered Peter Cook for Sky Arts, this time concerning Peter Sellers, Kenneth Williams and Tony Hancock.  Lewis-Smith was executive producer of a series of controversial documentaries presented by Keith Allen for Channel 4. This included biographies of  Nick Griffin, then leader of the British National Party, Lottery winner Michael Carroll, the TV Cook Keith Floyd (who died 2 hours before the programme was transmitted), and the \"child prodigy\" Lauren Harries."]}, {"page": "Sabrina (actress)", "response": ["In \"The Scandal Magazine\", an episode of the radio programme Hancock's Half Hour, Sid James plays the editor of a sleazy gossip magazine that has carried an embarrassing story about Tony Hancock. James tells Hancock that his readers \"will believe anything. ... If I told them that Sabrina was Arthur Askey's mother, they'd believe me.\" Hancock replies, \"Well, I don't\", pauses and asks, \"She's not, is she?\" James says emphatically \"No\", but Hancock reflects, \"Mind you, there is a resemblance ...\""]}, {"page": "Galton and Simpson", "response": ["Ray Galton OBE (17 July 1930 – 5 October 2018) and Alan Simpson OBE (27 November 1929 – 8 February 2017) were English comedy scriptwriters whose partnership lasted over 50 years. They met in 1948 whilst recuperating from tuberculosis at the Milford Sanatorium, near Godalming in Surrey. They are best known for their work with comedian Tony Hancock on radio and television between 1954 and 1961 and their long-running television situation comedy, Steptoe and Son, eight series of which were aired between 1962 and 1974.", "Their comedy is characterised by a bleak and somewhat fatalistic tone. Steptoe and Son in particular is, at times, extremely black comedy, and close in tone to social realist drama. Both the character played by Tony Hancock in Hancock's Half Hour and Harold Steptoe (Harry H. Corbett) are pretentious, would-be intellectuals who find themselves trapped by the squalor of their lives. This theme had been expanded upon in their script for Tony Hancock's film The Rebel (1961), about a civil servant who moves to Paris to become an artist. Gabriel Chevallier's novel Clochemerle (1934) was adapted by Galton and Simpson as a BBC/West German co-production in 1972. They contributed the book to Jacob's Journey, a musical accompaniment to a 1973 production of Joseph and the Amazing Technicolor Dreamcoat, which was however soon dropped. Around this time an unbroadcast television pilot entitled Bunclarke With an E was recorded based on a Hancock's Half Hour script, with Arthur Lowe and James Beck, but Beck died before the project could be developed as a series. Another series from this period, Casanova '73 (1973) with Leslie Phillips in the lead, was described by The Times in its obituary of Galton as \"disappointingly typical of their later work.\""]}, {"page": "Anthony Hancock", "response": ["*Tony Hancock (1924–1968),  British comedian", "*Tony Hancock (footballer)"]}, {"page": "Hancock's Half Hour", "response": ["Hancock's Half Hour was a BBC radio comedy, and later television comedy series, broadcast from 1954 to 1961 and written by Ray Galton and Alan Simpson. The series starred Tony Hancock, with Sidney James; the radio version also co-starred, at various times, Moira Lister, Andrée Melly, Hattie Jacques, Bill Kerr and Kenneth Williams. The final television series, renamed simply Hancock, starred Hancock alone.", "Comedian Tony Hancock starred in the show, playing an exaggerated and much poorer version of his own character and lifestyle, Anthony Aloysius St John Hancock, a down-at-heel comedian living at the dilapidated 23 Railway Cuttings in East Cheam.", "Roger Wilmut, in his 1978 biography of Tony Hancock as a performer, credits two British radio comedy shows, already running in 1954, with establishing an uninterrupted 30-minute sitcom format: A Life of Bliss, written by Godfrey Harrison and starring George Cole, and Life with the Lyons, a programme heavily based on the US tradition of sitcoms; he therefore dismisses the notion that Galton and Simpson invented the genre.", "* Anthony Aloysius St John Hancock,Sommerlad, J. \"Tony Hancock 50 years on: How the legendary British comedian paved the way for Alan Partridge and David Brent\" The Independent, 25 June 2018. principal character.", "Galton and Simpson never gave titles to any of their Hancock scripts, for radio or television; this was usually left to the girl who filed the scripts at their office, who gave them names that were a reminder of what the script was about. So when Roger Wilmut came to write his book Tony Hancock – Artiste (first published 1978) he took the liberty of inventing titles where necessary and these titles, a combination of the file names and Wilmut's own, have become the accepted ones ever since, with the approval of Galton and Simpson and the BBC.", "* Regular cast: Tony Hancock, Bill Kerr, Moira Lister, Sid James, Alan Simpson (uncredited)", "Episodes 2, 5, 7, 8, 9 and 15 no longer exist. However, in April 2014 the BBC re-recorded \"The Hancock Festival\", selected by and recorded in the presence of Galton and Simpson, with Kevin McNally as Tony Hancock. The episode aired in November 2014, the sixtieth anniversary of its first airing. \"The Marriage Bureau\" was re-recorded in September 2015 and broadcast on 7 December 2015. \"The Department Store Santa\" was re-recorded on 3 September 2017 and broadcast in December 2018 as the first part of a fourth series of The Missing Hancocks. On 24 September 2017 \"Christmas at Aldershot\" was re-recorded for broadcast on Christmas Day 2019 along with \"The Christmas Eve Party\" which was broadcast on 21 December 2021. \"The Diamond Ring\" was re-recorded on 11 January 2019 and broadcast (in keeping with its Guy Fawkes theme) on 5 November 2019.", "* Regular cast: Harry Secombe (Episodes 1–4), Tony Hancock (Episodes 4–12), Bill Kerr, Sid James, Andrée Melly, Kenneth Williams, Alan Simpson (uncredited)", "Episodes 1, 2, 3, 4, 7, 10 and 12 (more than half the series, including all four of Harry Secombe's guest appearances) no longer exist. However, in April 2014 the BBC re-recorded \"The Matador\", selected by and recorded in the presence of Galton and Simpson with Kevin McNally as Tony Hancock, for broadcast around the sixtieth anniversary of its first airing.) On 2 December 2016 the BBC re-recorded \"A Holiday in France\" followed by \"The Race Horse\" and \"The Crown Jewels\" with Andy Secombe as his late father Harry. On 13 January 2019 \"Prime Minister Hancock\" was re-recorded for broadcast on 18 December that year. Also re-recorded was \"A Visit To Swansea\" which featured Tony being forced to go and thank Harry Secombe who'd returned to Wales.  The episode was littered with references to how good Secombe had been.  ", "Shortly before the series was due to be recorded Hancock walked out on a theatre performance suffering from \"nervous exhaustion\" and flew to Rome.  Harry Secombe was brought in at short notice to replace Hancock and starred in the first three episodes, and made a guest appearance in the fourth. Hancock himself returned for the fourth episode and completed the series as scheduled.  Had Hancock not returned for the 4th  episode, then Galton and Simpson planned to continue with Harry Secombe replacing Tony Hancock with the series renamed Secombe's Half Hour.", "* Regular cast: Tony Hancock, Bill Kerr, Sid James, Andrée Melly, Kenneth Williams, Alan Simpson (uncredited).", "Episodes 4, 5, 7, 9, 10, 11, 15 and 17 no longer exist. Only a short extract from episode 12 survives; this plus episodes 8 and 16 only survive in poor sound quality. However, in April 2014 the BBC re-recorded \"The New Neighbour\", \"The Breakfast Cereal\" and \"The Newspaper\", selected by and recorded in the presence of Galton and Simpson, with Kevin McNally as Tony Hancock. The episodes were broadcast in October & November 2014 to celebrate the sixtieth anniversary of their first airing. Episode 4 was rerecorded in August 2016.", "* Regular cast: Tony Hancock, Sid James, Hattie Jacques (debut in Episode 5), Bill Kerr, Kenneth Williams.", "* Regular cast: Tony Hancock, Sid James, Hattie Jacques, Bill Kerr, Kenneth Williams.", "Welcome to London was broadcast live on 3 August 1958 on the BBC Light Programme from the London Coliseum to commemorate the Cardiff British Empire and Commonwealth Games. It features a nine-minute sketch with Hancock, James and Kerr.\"Radio Specials\", Tony Hancock Appreciation Society A recording of the whole 90-minute programme was discovered in the collection of Bob Monkhouse after his death. The Hancock sketch has been broadcast on BBC Radio 4 Extra.John Plunkett \"London 2012 Olympics: Tony Hancock show to be re-broadcast\", The Guardian, 27 July 2012", "* Cast: Tony Hancock, Sid James, Hattie Jacques, Bill Kerr, Warren Mitchell", "* Regular cast: Tony Hancock, Sid James, Hattie Jacques, Bill Kerr, Kenneth Williams.", "* Regular cast: Tony Hancock, Sid James, Bill Kerr (except episode 13), Kenneth Williams (episodes 1 and 2 only)", "thumb|200px|Tony Hancock (right) and Sid James", "* The Tony Hancock Show, Series 1 (Associated-Rediffusion for ITV): 4 April – 1 June 1956", "* The Tony Hancock Show, Series 2: 16 November 1956 – 25 January 1957", "Information on series dates taken from the book Tony Hancock: Artiste (1978) by Roger Wilmut, Eyre Methuen  (subsequent reprints in 1983 and 1986 contain additional details). Information on lost radio episodes taken from the CD box sets (BBC Worldwide, 2000–2003).", "Four episodes of the TV series were re-recorded before studio audiences, in the style of radio programmes, and released on LP format, two by Pye on the 1961 album Hancock (\"The Blood Donor\" and \"The Radio Ham\") and two by Decca on the 1965 album It's Hancock (\"The Missing Page\" and \"The Reunion Party\"), which was reissued as The World of Tony Hancock in 1975. The re-recordings entailed the rewriting of a number of visual gags; for instance, at the end of the TV version of \"The Radio Ham\", Hancock smashes his radio equipment, whereas in the LP version he holds an on-air auction for it. These recordings have been reissued several times on LP, cassette and CD, and have also appeared on comedy compilation CDs.", "The first DVD to be released was in 2001, which was a re-release of \"The Very Best of Hancock\" video. The next DVD was to be released in 2004, containing the first five episodes and the rarely seen \"Hancock's Forty-Three Minutes.\" However, 2 Entertain released a box set in 2007 called The Tony Hancock Collection, containing every existing episode and new bonus features, including Hancock's interview in the Face to Face from 1960.", "* The Tony Hancock Appreciation Society", "* The Tony Hancock Archives"]}, {"page": "Bill Kerr", "response": ["From 1954 to 1959, he had a regular role as an Australian lodger in the BBC radio comedy series Hancock's Half Hour. (b)p.158 The series, with comedian Tony Hancock as the eponymous lead and also featuring Sid James, ran for six series. Initially sharper than Hancock's characterisation, Kerr's portrayal eventually developed into a more dim-witted character who became the butt of Hancock's jokes. Unlike James, Kerr did not feature in the television version of the Hancock series. Kerr also starred in the highly entertaining radio drama series \"The Flying Doctor\" (1958–63) regularly flying in and out of the fictitious Wollumboola base as he and his \"doctor\" colleague brought reprobates to justice in the outback.  Later, after Sid James had ended his professional partnership with Hancock, Kerr briefly resumed working with him in the first series of the television comedy Citizen James (1960).Citizen James, BBC Comedy Kerr's other television appearances in Britain include a Doctor Who serial called The Enemy of the World (1968), with Patrick Troughton, and a long-running part in the early 1960s BBC-TV soap, Compact.", "Kerr had much theatrical success in Britain, playing the Devil disguised as Mr Applegate in the first West End production of Damn Yankees, directed by Bob Fosse and first performed in March 1957.Adrian Wright West End Broadway: The Golden Age of the American Musical in London, Woodbridge: The Boydell Press, 2012, p.130 He appeared in a touring production of the play The Teahouse of the August Moon in 1956. He also worked with Spike Milligan and appeared in Milligan and John Antrobus's stage play The Bed-Sitting Room,Milligan, Spike, & Antrobus, John (1973) The Bedsitting Room. Tandem: London. First published in Great Britain by Margaret & Jack Hobbs, 1970. Published by Universal-Tandem, 1972. which opened at the Mermaid Theatre on 31 January 1963. (a)pp.203–204, (b)pp.242–243 A subsequent production opened on 3 May 1967 at the Saville Theatre, and \"a cast containing an unusually high proportion of Australian actors including Bill Kerr and David Nettheim.\" In the 1969 London production of Play It Again, Sam at the Globe Theatre, Kerr played Humphrey Bogart.Simon Farquhar \"Bill Kerr: Comedian and actor who began as a child star and became best known working with the Goons and Tony Hancock\", The Independent, 3 September 2014"]}]}}