{"wiki_id": "http://www.wikidata.org/entity/Q13638763", "itemLabel": "Jack Jones", "itemDescription": "British Trade Union leader", "wikipedia_url": "https://en.wikipedia.org/wiki/Jack_Jones_(trade_unionist)", "wikipedia_page": {"main": "James Larkin Jones  (29 March 1913 – 21 April 2009), known as Jack Jones, was a British trade union leader and General Secretary of the Transport and General Workers' Union.", "link_mentions": [{"page": "Roy Jenkins", "response": ["The Listener reprinted the text along with assessments by Enoch Powell, Paul Johnson, Jack Jones, J. A. G. Griffith, Bernard Crick, Neil Kinnock and Jo Grimond. They were all critical; Kinnock thought him misguided as Britain had already suffered from centrist rule for thirty years and Grimond complained that Jenkins' clarion call had come 20 years too late.Campbell, Roy Jenkins: A Well-Rounded Life, p. 515."]}, {"page": "Camberwell", "response": ["Residents of the area have included children's author Enid Mary Blyton, who was born at 354 Lordship Lane, East Dulwich, on 11 August 1897 (though shortly afterwards the family moved to Beckenham), and the former leader of the TGWU, Jack Jones, who lived on the Ruskin House Park estate. Karl Marx initially settled with his family in Camberwell when they moved to London in 1849. Others include the former editor of The Guardian Peter Preston. The Guardian columnist Zoe Williams is another resident, whilst Florence Welch of the rock band Florence + the Machine also lives in the area, as do actresses Lorraine Chase and Jenny Agutter. Syd Barrett, one of the founders of Pink Floyd, studied at Camberwell College of Arts from 1964. Clifford Harper, illustrator and anarchist, has lived in Camberwell since 1974."]}, {"page": "Winter of Discontent", "response": ["Within unions, power was also devolving to the rank and file. The political upheavals of the late 1960s in Europe and the United States had brought participatory democracy to the fore, and workers felt they should be taking decisions, including about when and whether to strike, that had hitherto been the province of union leadership. Hugh Scanlon, who took over as head of the Amalgamated Union of Engineering Workers (AUEW) in 1967, and Jack Jones, general secretary of the Transport and General Workers' Union (TGWU) from shortly afterward, were known among union leaders as \"the dubious duo\" for their advocacy for devolution.", "By the middle of November it was clear that Ford would offer an increase substantially over the 5 per cent limit. The government subsequently entered into intense negotiations with the TUC, hoping to produce an agreement on pay policy that would prevent disputes and show political unity in the run-up to the general election. A limited and weak formula was eventually worked out and put to the General Council of the TUC on 14 November, but its General Council vote was tied 14–14, with the formula being rejected on the chair's casting vote. One important personality on the TUC General Council had changed earlier in 1978 with Moss Evans replacing Jack Jones at the TGWU. Evans proved a weak leader of his union, although it is doubtful whether Jones could have restrained the actions of some of the TGWU shop stewards."]}, {"page": "Bob Crow", "response": ["During his formative years, the British trade union movement was dominated by such prominent figures as Jack Jones, Hugh Scanlon, Joe Gormley, and Len Murray. As a result, he commented that \"Starting my career with these people in charge of unions, and working in a nationalised industry with people who had put in 30 or even 40 years of service helped shape my views.\""]}, {"page": "Jack Jones", "response": ["Jack Jones may refer to:", "*Jack Jones (American singer) (born 1938), American jazz and pop singer", "*Jack Jones, stage name of Australian singer Irwin Thomas (born 1971)", "*Jack Jones (Welsh musician) (born 1992), Welsh musician, songwriter and poet", "*Jack Jones (novelist) (1884–1970), Welsh novelist and playwright", "*Jack Jones (journalist) (1924–2011), American journalist", "*Jack Jones (TV journalist) (1949–1991), American television journalist", "*Lance-Corporal Jack Jones, a character in the sitcom Dad's Army", "*Jack Jones, a banker in the Oliver Stone film Nixon", "*Jack Jones (Silvertown MP) (John Joseph Jones, 1873–1941), British Labour MP for Silvertown", "*Jack Jones (Rotherham MP) (John Henry Jones, 1894–1962), British Labour MP for Bolton, later MP for Rotherham", "*Jack Jones (Australian politician) (John Joseph Jones, 1907–1997), member of the Victorian Legislative Council for Ballarat", "*Jack Jones (trade unionist) (1913–2009), British trade union leader", "*Jack Jones (footballer, born 1869) (1866–1931), Wales international footballer who played for Grimsby Town, Sheffield United and Tottenham", "*Jack Jones (footballer, born 1874) (1874–1904), English football forward for Small Heath, Bristol Rovers and Tottenham ", "*Jack Jones (footballer, born 1891) (1891–1948), English football defender for Birmingham, Nelson and Crewe", "*Jack Jones (1920s Welsh footballer), footballer for Wrexham and Crewe Alexandra", "*Jack Jones (footballer, born 1907), Irish football defender for Linfield, Hibernian, Glenavon, Bath City and Ireland (IFA)", "*Jack Jones (footballer, born 1913) (1913–1995), English football player for Everton and Sunderland", "*Jack Jones (footballer, born 1916) (1916–1999), Scottish footballer", "*Jack Jones (footballer, born 1921) (1921–2001), Welsh footballer for Wrexham, Doncaster Rovers and New Brighton", "*Jack Jones (soccer, born 1987) (born 1987), American soccer player", "*Jack Jones (footballer, born 1887) (1887–1964), Australian rules footballer for South Melbourne", "*Jack Jones (footballer, born 1888) (1888–1960), Australian rules footballer for University", "*Jack Jones (footballer, born 1924) (1924–2020), Australian rules footballer for Essendon", "*Jack Jones (rugby union, born 1886) (1886–1951), Welsh international rugby union player", "*Jack Jones (rugby, born 1890) (1890–?), rugby union and league footballer for Wales (RU), Abertillery, and Oldham (RL)", "*Jack Jones (Australian rugby league) (fl. 1925–1933), Australian rugby league player", "*Jumping Jack Jones (1860–1936), American baseball pitcher", "*Jack Jones (cricketer) (1899–1991), cricketer for Western Australia and Australian rules football player and coach", "*Jack Jones (water polo) (1925–2016), English Olympic water polo player"]}, {"page": "Transport and General Workers' Union", "response": [":1969: Jack Jones"]}, {"page": "Ian Mikardo", "response": ["The Mikardo Committee on the docks was set up by the Labour Party. Mikardo served on it, along with Andrew Cunningham, leader of the General, Municipal, Boilermakers and Allied Trade Union (GMB) in north-east England, John Hughes, of Ruskin College, Oxford, Jack Jones, later general secretary of the Transport and General Workers Union then directly responsible for dockers, Michael Montague, later of the English Tourist Board, and Peter Shore MP."]}, {"page": "James Larkin", "response": ["The Transport and General Workers' Union activist Jack Jones, whose full name was James Larkin Jones, was named in honour of his fellow Liverpudlian."]}, {"page": "Rodney Bickerstaffe", "response": ["He retired from UNISON in 2001 and succeeded Jack Jones as president of the National Pensioners Convention in April 2001. The organisation champions the rights and voice of Britain's 11 million pensioners and campaigns for better pensions and healthcare. Bickerstaffe stood down in 2005 to focus on his international commitments and was succeeded by Frank Cooper. He chaired the Global Network which works with organisations in Asia, Africa and Latin America and was President of War on Want. He also chaired the Ken Gill Memorial Fund, a non-charitable trust established to commemorate his late friend, the British trade unionist and internationalist Ken Gill. In 2007 he refused a peerage."]}, {"page": "Roy Boulter", "response": ["Boulter is a founder member and director of The Jack Jones Trust – a collaboration set up between film-makers and Trade Unions to produce documentaries."]}, {"page": "Ron Todd (trade unionist)", "response": ["Not long after starting work at the Ford plant Todd became a shop steward and soon deputy convener of shop stewards. In 1962, he became a full-time T&G officer based at the Edmonton office and was responsible for chemical, engineering and metal groups. The General Secretary of the T&G, Jack Jones, moved Todd to the Stratford office, so that he could take charge of the interests of workers at the Dagenham plant. Todd was made Regional Secretary for London and the South-East in 1975 and responsible for half a million or more members. He became friendly with Moss Evans, then responsible for the motor industry and who succeeded Jones in 1978 as General Secretary. Evans appointed Todd as National Organiser, at the centre of the T&G high command."]}]}}