{"wiki_id": "http://www.wikidata.org/entity/Q1360466", "itemLabel": "Sam Torrance", "itemDescription": "professional golfer", "wikipedia_url": "https://en.wikipedia.org/wiki/Sam_Torrance", "wikipedia_page": {"main": "Samuel Robert Torrance  (born 24 August 1953) is a Scottish professional golfer and sports commentator. He was one of the leading players on the European Tour from the mid-1970s to the late 1990s, with 21 Tour wins. Torrance was a member of European Ryder Cup teams on eight occasions consecutively; on Cup-winning teams four times. He was also part of the winning Scotland team at the 1995 Dunhill Cup.  He was the winning non-playing captain of the European Ryder Cup team in 2002. Torrance was honoured with the MBE (1996) and OBE (2003), for his outstanding contributions to golf.", "link_mentions": [{"page": "August 24", "response": ["*  1953   – Sam Torrance, Scottish golfer and sportscaster"]}, {"page": "List of Scots", "response": ["* Sam Torrance (born 1953), golfer"]}, {"page": "Ayrshire", "response": ["* Sam Torrance (1953–), professional golfer, born in Largs"]}, {"page": "Ryder Cup", "response": ["There was considerable bad blood after the event, with some of the European players complaining about the behavior of the American galleries throughout the match. Sam Torrance branded it \"disgusting\", while European captain Mark James referred to it as a \"bear pit\" in a book recounting the event. There were also reports that a spectator spat at James' wife. Payne Stewart had conceded his singles match to Colin Montgomerie with both players level and on the last green in 2 shots as a response to the abuse Montgomerie had received throughout the match.", "If one of the golfers is injured and cannot play his singles match, the opposing captain can select one player from his team that he would like to not compete. The nominated player is then matched up against the injured player and the match recorded as a half. There is one stipulation – each captain must place the name of their nominated player in an envelope prior to the start of the matches. The \"envelope rule\", as it has known, has come into play three times since 1979, including most recently in 1993 when Europe's Sam Torrance suffered a sore left foot. Lanny Wadkins offered to be the player that American captain Tom Watson placed in the envelope, and their match was recorded as halved."]}, {"page": "List of sports announcers", "response": ["* Sam Torrance – BBC Sport 2002–2011, Sky Sports 2014–present"]}, {"page": "Colin Montgomerie", "response": ["| Niclas Fasth,  Sam Torrance", "| Sam Torrance", "| Sam Torrance"]}, {"page": "Torrance", "response": ["*Sam Torrance (born 1953), Scottish golfer"]}, {"page": "Largs", "response": ["* Sam Torrance golfer, was born in Largs."]}, {"page": "Seve Ballesteros", "response": ["| Eamonn Darcy,  David Gilford, Tony Johnstone,  Sam Torrance, Keith Waters"]}, {"page": "Skibo Castle", "response": ["The Carnegie Club hosted Madonna's wedding to Guy Ritchie on 22 December 2000. In 1995, it had hosted the marriage of golfer Sam Torrance and actress Suzanne Danielle.Ryan Parry, Secret weapon won us Ryder glory at thefreelibrary.com On 28 December 1997 it hosted the marriage of actor Robert Carlyle and Anastasia Shirley."]}, {"page": "PGA European Tour", "response": ["|align=center|1972 ||  ||  Sam Torrance ||"]}, {"page": "Question of Sport", "response": ["* Sam Torrance, golfer (1997-98 and 2003)"]}, {"page": "Sandy Lyle", "response": ["Lyle partnered with Sam Torrance for Scotland to finish runner-up at the World Cup of Golf team event in both 1979 and 1980; in the latter year Lyle captured the low individual trophy in that event.", "| Sam Torrance", "| Sam Torrance"]}, {"page": "Suzanne Danielle", "response": ["Danielle was in a relationship with the actor Patrick Mower for seven years.Robert Ross, The Carry On Companion (2002), p. 127 In 1986, she met golfer Sam Torrance, who proposed to her in 1987 on a Concorde flight on the way to play in the Ryder Cup in Columbus, Ohio. They were married in 1988, a surprise marriage that was arranged at Skibo Castle. She and Torrance have four children.Ryan Parry, Secret weapon won us Ryder glory, thefreelibrary.com; retrieved 24 January 2014."]}, {"page": "Ian Woosnam", "response": ["| Sam Torrance", "| Paul Broadhurst,  Johan Ryström, Sam Torrance", "| David Feherty,  Sam Torrance", "| − Sandy Lyle and Sam Torrance", "| − Sandy Lyle and Sam Torrance"]}, {"page": "1995 in Ireland", "response": ["* Murphy's Irish Open was won by Sam Torrance (Scotland)."]}, {"page": "1981 in Ireland", "response": ["*The Irish Open was won by Sam Torrance (Scotland)."]}, {"page": "Don Panoz", "response": ["Don and Nancy Panoz founded Château Élan Winery & Resort in Braselton, Georgia, in 1992. At the time of Don's death on 2018 the couple still owned the resort, which has since grown to . The Panozes sold a portion of their businesses to three partners in 2004. Similarly in Patterson, California, 35 miles east of San Jose, the Panozes developed Diablo Grande gated community and the Diablo Grande Winery and Resort, which was sold In 2005; and later they founded the St. Andrews Bay Resort and Spa in Scotland. This venue has since been sold and is now managed by Fairmont Hotels and Resorts as the Fairmont St Andrews. These venues feature golf course designs and collaborations from Bruce Devlin, Denis Griffiths, Jack Nicklaus, Gene Sarazen, and Sam Torrance."]}, {"page": "Ronan Rafferty", "response": ["After knocking on the door for years, Rafferty would finally win in Europe in 1989. He avenged his 1986 playoff loss at the Italian Open with a one stroke win over Sam Torrance. This would be Rafferty's best season, as he would win an additional two events and record a 15 top-10 finishes. At the end of the year he won the Volvo Masters, the most prestigious win of his career, defeating Nick Faldo by one shot. He would go on to win the European Tour Order of Merit. He would also finish atop the 1989 Ryder Cup standings and play in his only Ryder Cup that year at The Belfry. Although Rafferty did not play great (he lost both team matches he played) he won his singles match against defending Open Championship winner Mark Calcavecchia on the 18th hole for a 1up win. This tight win proved indispensable as the European team struggled on the last day and only barely retained the cup with a 14–14 tie.", "| Sam Torrance"]}, {"page": "European Senior Tour", "response": ["|2009 || Sam Torrance ||  || align=right|170,696", "|2006 || Sam Torrance ||  || align=right|347,525", "|2005 || Sam Torrance ||  || align=right|277,421", "|align=center|8 || Sam Torrance ||  || align=right|1,560,985"]}, {"page": "Corey Pavin", "response": ["He quickly established himself as a professional, with three international victories in 1983. Playing 10 events on the 1983 European Tour, much fewer than all top European players that year, he finished 13th on the Order of Merit. After finishing lone 3rd, behind Sam Torrance and Craig Stadler, at the Scandinavian Enterprise Open in the beginning of July, Pavin won the German Open less than a month later, three strokes ahead of joint runner-up Seve Ballesteros, who at the time was the recent winner of The Masters Tournament. Pavin did not return to defend his German Open title the year after."]}, {"page": "Volvo Masters", "response": ["| 1996 ||  Mark McNulty || align=center|276 || align=center|−8 || 7 strokes ||  José Cóceres Sam Torrance Wayne Westner Lee Westwood", "| 1990 ||  Mike Harwood || align=center|286 || align=center|+2 || 1 stroke ||  Steven Richardson Sam Torrance"]}, {"page": "Alfred Dunhill Links Championship", "response": ["| 2003 ||  Lee Westwood || align=center|267 || align=center|−21 || 1 stroke ||  Ernie Els || Sam Torrance andDaniel Torrance"]}, {"page": "Seve Trophy", "response": ["| style=\"text-align:center;\"| 2013 || Golf de Saint-Nom-la-Bretèche, France ||  Continental Europe || style=\"text-align:center;\"| 15–13 || Sam Torrance || José María Olazábal"]}, {"page": "World Cup (men's golf)", "response": ["|1987||||David Llewellyn and Ian Woosnam||Maui, Hawaii, United States|| – Sandy Lyle and Sam Torrance", "|1984||||José María Cañizares and José Rivero||Rome, Italy|| – Gordon Brand Jnr and Sam Torrance – Hsieh Min-Nan and Chen Tze-chung"]}, {"page": "Alfred Dunhill Cup", "response": ["| 1995 ||  || Andrew Coltart, Colin Montgomerie, Sam Torrance"]}, {"page": "Miguel Ángel Jiménez", "response": ["At the 2020 Hero Open, Jiménez passed Sam Torrance for most starts on the European Tour, with 707."]}, {"page": "2005 in golf", "response": ["*European Seniors Tour - Sam Torrance topped the Order of Merit with earnings of €277,420.76.Full list"]}, {"page": "Mark McNulty", "response": ["| Sam Torrance", "| José Cóceres,  Sam Torrance, Wayne Westner,  Lee Westwood", "| Sam Torrance"]}, {"page": "Paul Broadhurst", "response": ["| Johan Ryström,  Sam Torrance, Ian Woosnam"]}, {"page": "PGA Tour (video game series)", "response": ["Developed by Exient Entertainment and published by Electronic Arts under the EA Sports branding on April 23, 2009 for iOS. The game features commentary by Sam Torrance and Kelly Tilghman. The game offers five golfers: Tiger Woods, Vijay Singh, Retief Goosen, Annika Sörenstam, and Natalie Gulbis. For courses, it has Pebble Beach Golf Links, Old Course at St Andrews, TPC Sawgrass, The K Club, Doral Golf Resort & Spa, Fancourt Links, and TPC Boston."]}, {"page": "European Open (golf)", "response": ["| 1982 ||  Manuel Piñero || align=center|266 || align=center|−14 || 2 strokes ||  Sam Torrance || Sunningdale"]}, {"page": "Irish Open (golf)", "response": ["| align=center|1995 ||  Sam Torrance (2) || align=center|277 || align=center|−11 || Playoff ||  Stuart Cage Howard Clark || align=center|155,550 || Mount Juliet", "| align=center|1981 ||  Sam Torrance || align=center|276 || align=center|−12 || 5 strokes ||  Nick Faldo || align=center|18,659 || Portmarnock", "| align=\"left\" |  Sam Torrance"]}, {"page": "British Masters", "response": ["| 1995 ||  Sam Torrance || align=center|270 || align=center|−18 || 1 stroke ||  Michael Campbell || Collingtree Park || ", "| 1991 ||  Seve Ballesteros (2) || align=center|275 || align=center|−13 || 3 strokes ||  Eamonn Darcy David Gilford Tony Johnstone Sam Torrance Keith Waters || Woburn || "]}]}}