{"wiki_id": "http://www.wikidata.org/entity/Q1367505", "itemLabel": "Tom Soares", "itemDescription": "English association football player (born 1986)", "wikipedia_url": "https://en.wikipedia.org/wiki/Tom_Soares", "wikipedia_page": {"main": "Thomas James Soares (born 10 July 1986) is an English professional footballer who plays as a midfielder for Dorchester Town F.C.. He has previously played for Crystal Palace, Stoke City, Bury, AFC Wimbledon and Stevenage.", "link_mentions": [{"page": "Soares", "response": ["*Tom Soares, English footballer."]}, {"page": "What It Meant: The Complete Discography", "response": ["::Produced by Tom Soares and Porcell", "::Engineered by Tom Soares"]}, {"page": "Antony Kay", "response": ["On 19 June 2016, Kay joined League One club Bury on a two-year contract. Six weeks later he was appointed as club captain by manager David Flitcroft. However, Bury endured a poor start to the season, leaving tensions high as Kay and teammate Tom Soares had to be separated from each other after exchanging heated words following a 5–1 defeat to AFC Wimbledon at the Kingsmeadow on 19 November. Bury's form did turn around over the new year though, and Kay praised manager Chris Brass for changing to a 5–3–2 formation and halting a club record 12-match losing streak and 17-match winless run."]}, {"page": "Subzero (band)", "response": ["*Happiness Without Peace re-issue (remixed/remastered) by Tom Soares at Normandy Sound - 1997 Century Media Records"]}, {"page": "List of association football families", "response": ["* Louie Soares,  Tom Soares (brother)http://world.grimsby-townfc.co.uk/page/ProfilesDetail/0,,10417~33435,00.html"]}, {"page": "2007–08 Barnsley F.C. season", "response": ["Barnsley were unable to continue their winning form against playoff-chasers Crystal Palace, and they've still only won a single away game in the league all season. No goals at either end in the first half, but Tom Soares put the home side in front in the first minute of the second half then a late goal from James Scowcroft wrapped up all three points for Palace."]}, {"page": "2008–09 Stoke City F.C. season", "response": ["Juande Ramos's Tottenham travelled to Stoke in what turned out to be a match full of incident. The first came after 17 minutes when Gareth Bale fouled Tom Soares in the area and received a red card, Higginbotham scored from the spot after having to reset the ball four times due to strong winds. Spurs then equalised through Darren Bent before Delap gave City the lead early in the second half. Goalkeeper Sorensen was then forced off due to injury and also Vedran Corluka who collided with his own keeper Gomes. Due to these injuries 11 minutes of stoppage time would be required, Stoke had the chance to end the match when Soares was again brought down in the box but Fuller's spot kick hit both posts and Delaps rebound hit the cross bar. Spurs were reduced to nine men when Michael Dawson lunged nastily at Sidibé.", "Stoke were drawn against League One Hartlepool United in the third round of the FA Cup. Manager Pulis decided to field a largely reserve side with the likes of Andy Davies, Ibrahima Sonko, Tom Soares, Michael Tonge all getting rare run outs. However that decision backfired as Stoke were awful and Hartlepool claimed a shock 2–0 victory with goals from Michael Nelson and a wonder goal from David Foley.", "|align=\"left\"|8||align=\"left\"|MF||align=\"left\"| Tom Soares", "| Tom Soares ", "| Tom Soares"]}, {"page": "Mario Marinică", "response": ["During 2002–2003, he became a development coach at the Crystal Palace FC Academy. He managed the U15 side, and coached from U14 to U19 levels.  He worked with a number of players who have since turned professional and received International honours: Wayne Routledge, Gary Borrowdale, Ben Watson, Tom Soares, Sam Togwell, Lewis Grabban, Rhoys Wiggins, Andrew Julius, David Hunt, Gavin Heeroo, Teerathep Winothai, Will Antwi and Craig Dobson."]}, {"page": "List of Crystal Palace F.C. players", "response": ["|align=\"left\"|Tom Soares||||CM||2003–2008||162||12||||", "*  Tom Soares – 2005"]}, {"page": "2009–10 Stoke City F.C. season", "response": ["|align=\"left\"|8||align=\"left\"|MF||align=\"left\"| Tom Soares", "| Tom Soares"]}, {"page": "2010–11 Stoke City F.C. season", "response": ["|align=\"left\"|8||align=\"left\"|MF||align=\"left\"| Tom Soares "]}, {"page": "2004–05 Crystal Palace F.C. season", "response": ["|align=\"left\"|19||align=\"left\"|MF||align=\"left\"| Tom Soares"]}, {"page": "South London derby", "response": ["* Tom Soares"]}, {"page": "2011–12 Hibernian F.C. season", "response": ["| Tom Soares"]}, {"page": "2011–12 Stoke City F.C. season", "response": ["|align=\"left\"|8||align=\"left\"|MF||align=\"left\"| Tom Soares ", "| Tom Soares"]}, {"page": "2012 Scottish Cup Final", "response": ["Hearts started the match as the brighter of the two teams. Rudi Skácel headed wide early on from an Andrew Driver cross. Hearts took the lead through Darren Barr in the 15th minute, scoring from close range. Hearts continued to control the match and Pa Kujabi picked up a booking for fouling Suso Santana. Skácel then doubled Hearts' lead after receiving the ball on the edge of the area and turning to hit a shot which deflected off James McPake before going in. Hibs then had an opportunity as Kujabi's cross came to Garry O'Connor, but he hit his shot over the bar. McPake then made a goal-line clearance from a Suso shot which had beaten Hibs' keeper Mark Brown. McPake got Hibs back into the game from a corner. Tom Soares' initial delivery was cleared but he got the ball back out on the wing and put in a low cross which McPake converted.", "|MF ||13 ||  Tom Soares || || "]}]}}