{"wiki_id": "http://www.wikidata.org/entity/Q1360030", "itemLabel": "James Stirling", "itemDescription": "British naval officer and colonial administrator (1791-1865)", "wikipedia_url": "https://en.wikipedia.org/wiki/James_Stirling_(Royal_Navy_officer)", "wikipedia_page": {"main": "Admiral Sir James Stirling (28 January 1791 – 22 April 1865) was a Scottish naval officer and colonial administrator.  His enthusiasm and persistence persuaded the British Government to establish the Swan River Colony and he became the first Governor and Commander-in-Chief of Western Australia. In 1854, when Commander-in-Chief, East Indies and China Station, Stirling on his own initiative signed Britain's first Anglo-Japanese Friendship Treaty. Throughout his career Stirling showed considerable diplomatic skill and was selected for a number of sensitive missions.  Paradoxically, this was not reflected in his personal dealings with officialdom and his hopes for preferment received many rebuffs. Stirling also personally led the attack in Western Australia on a group of approximately seventy Bindjareb men, women and children now known as the Pinjarra massacre.Stirling entered the Royal Navy at age 12 and as a midshipman saw action in the Napoleonic Wars.  Rapid promotion followed and when he was 21 he received his first command, the 28-gun sloop HMS Brazen, and, in the War of 1812 between the US and the UK, seized two prizes. The Brazen carried the news of the end of that war to Fort Bowyer and took part in carrying to England the British troops that had captured the fort.  On return to the West Indies, Stirling made two surveys of the Venezuelan coast and reported on the strengths, attitudes and dispositions of the Spanish government and various revolutionary factions, later playing a role in the British negotiations with these groups.\nIn his second command, HMS Success, he carried supplies and coinage to Australia, but with a covert mission to assess other nations' interest in the region and explore opportunities for British settlements.  He is chiefly remembered for his exploration of the Swan River, followed by his eventual success in lobbying the British Government to establish a settlement there.  On 30 December 1828, he was made Lieutenant-Governor of the colony-to-be. He formally founded the city of Perth and the port of Fremantle and oversaw the development of the surrounding area and on 4 March 1831 he was confirmed as Governor and Commander-in-Chief of the new territory, Western Australia, in which post he remained until in 1838 he resumed his naval career.\nIn October 1834 Stirling personally led a group of twenty-five police, soldiers and settlers in a punitive expedition against approximately seventy Bindjareb men, women and children camped on the Murray River partly in retaliation for several murders and thefts. This bloody attack involving rifles and bayonets against spears is known as the Pinjarra Massacre – and sometimes still; the Battle of Pinjarra. An uncertain number of Aboriginal men, women and children were killed during this encounter; Stirling reported 15 males killed, John Septimus Roe 15–20, and an unidentified eyewitness 25–30 including 1 woman and several children with probably more floating down with the stream. One of Stirling's party was injured and one was injured and died about two weeks later, although it is uncertain if from existing injuries, injuries suffered during the massacre, poor medical treatment after the massacre, or a combination thereof. An uncertain number of Bindjareb were injured, and an uncertain number died of their injuries.\nFrom 1840 to 1844, in command of the 80-gun HMS Indus, he patrolled the Mediterranean with instructions to 'show the flag' and keep an eye on the French. In 1847, he was given command of the 120-gun first rate ship of the line HMS Howe and his first commission was to conduct Her Majesty, the Dowager Queen Adelaide on trips to Lisbon and Madeira and then back to Osborne House on the Isle of Wight. After that, the Howe was assigned to the eastern Mediterranean, where she reinforced the squadron led by Vice Admiral Parker using gunboat diplomacy to secure an uneasy peace in the region.\nStirling's fifth and final command was as Commander in Chief, China and the East Indies Station, and his flag, as Rear Admiral of the White, was hoisted on HMS Winchester on 11 May 1854.  Shortly afterwards news arrived that war had been declared on Russia. Stirling was anxious to prevent Russian ships from sheltering in Japanese ports and menacing allied shipping and, after lengthy negotiations through the Nagasaki Magistrate, concluded a Treaty of Friendship with the Japanese.  The treaty was endorsed by the British Government, but Stirling was criticised in the popular press for not finding and engaging with the Russian fleet.", "link_mentions": [{"page": "List of Scots", "response": ["* James Stirling (1926–1992)", "* James Stirling (1800–1876), builder of steam locomotives, brother of Robert Stirling", "* Peter Belches (1796–1890), Royal Navy Lieutenant who explored the Swan River and its surrounding area while aboard Admiral Sir James Stirling's ", "* Sir James Stirling (1791–1865), colonial administrator and Royal Navy Admiral who established the Swan River Colony and became the first Governor of Western Australia", "* Sir James Stirling (1791–1865), 1st Governor of Western Australia, Admiral in the Royal Navy"]}, {"page": "Perth", "response": ["Captain James Stirling founded Perth in 1829 as the administrative centre of the Swan River Colony. It was named after the town of Perth in Scotland, due to the influence of Stirling's patron Sir George Murray, who had connections with the area. It gained city status in 1856, although the Perth City Council currently governs only a small area around the central business district. The city's population increased substantially as a result of the Western Australian gold rushes in the late 19th century. It has grown steadily since World War II due to a high net migration rate. Post-war immigrants were predominantly from Britain and Southern Europe, while more recent arrivals have led to a large population of Asian descent. Several mining booms in other parts of Western Australia in the late 20th and early 21st centuries saw Perth become the regional headquarters for large mining operations.", "On 4 June 1829, newly arriving British colonists had their first view of the mainland, and Western Australia's founding has since been recognised by a public holiday on the first Monday in June each year. Captain James Stirling, aboard Parmelia, said that Perth was \"as beautiful as anything of this kind I had ever witnessed\". On 12 August that year, Helen Dance, wife of the captain of the second ship, Sulphur, cut down a tree to mark the founding of the town.", "It is clear that Stirling had already selected the name Perth for the capital well before the town was proclaimed, as his proclamation of the colony, read in Fremantle on 18 June 1829, ended \"given under my hand and Seal at Perth this 18th Day of June 1829. James Stirling Lieutenant Governor\". The only contemporary information on the source of the name comes from Fremantle's diary entry for 12 August, which records that they \"named the town Perth according to the wishes of Sir George Murray\". Murray was born in Perth, Scotland, and was in 1829 Secretary of State for the Colonies and Member for Perthshire in the British House of Commons. The town was named after the Scottish Perth, in Murray's honour. Beginning in 1831, hostile encounters between the British settlers and the Noongar people – both large-scale land users, with conflicting land value systems – increased considerably as the colony grew. The hostile encounters between the two groups of people resulted in multiple events, including the execution of the Whadjuk elder Midgegooroo, the death of his son Yagan in 1833, and the Pinjarra massacre in 1834."]}, {"page": "Stirling Range National Park", "response": ["Stirling Range was named by the surveyor John Septimus Roe in 1835 after the Governor of the Swan River Colony, James Stirling, even though Stirling never actually visited the area."]}, {"page": "Walpole-Nornalup National Park", "response": ["The park is named after the nearby town of Walpole which in turn honours William Walpole, who served alongside James Stirling on HMS Warspite in 1809. The Noongar peoples know the area as Nor-Nor-Nup, meaning the place of the black snake, which was anglicised as Nornalup."]}, {"page": "Bunbury, Western Australia", "response": ["Located at the south of the Leschenault Estuary, Bunbury was established in 1836 on the orders of Governor James Stirling, and named in honour of its founder, Lieutenant (at the time) Henry Bunbury. A port was constructed on the existing natural harbour soon after, and eventually became the main port for the wider South West region. Further economic growth was fuelled by completion of the South Western Railway in 1893, which linked Bunbury with Perth.", "In 1829, Dr Alexander Collie and Lieutenant Preston explored the area of Bunbury on land. In 1830 Lieutenant Governor Sir James Stirling visited the area and a military post was subsequently established; it only lasted six months. The area was renamed Bunbury by the Governor in recognition of Lieutenant Henry William St Pierre Bunbury, who developed the very difficult inland route from Pinjarra to Bunbury.Reed, A. W. (1973) Place Names of Australia, p. 48 Sydney, NSW: A. H. & A. W. Reed,  Bunbury's first settlers were John and Helen Scott, theirs sons Robert, William and John Jr, and step-son Daniel McGregor, who arrived in January 1838. Bunbury township was mentioned in the Government Gazette in 1839, but lots in the township were not surveyed until 1841. In March 1841 lots were declared open for selection."]}, {"page": "James Stirling", "response": ["James Stirling may refer to:", "*James Stirling (mathematician) (1692–1770), Scottish mathematician", "*Sir James Stirling, 1st Baronet (c.1740?–1805), Scottish banker and lord provost of Edinburgh", "*Sir James Stirling (Royal Navy officer) (1791–1865), Governor of Western Australia", "*James Stirling (1800–1876), Scottish engineer", "*James Stirling (1835–1917), Scottish locomotive engineer", "*Sir James Stirling (judge) (1836–1916), British jurist", "*Sir James Stirling (architect) (1926–1992), architect", "*James Stirling (physicist) (1953–2018), Provost of Imperial College London", "*James Stirling (footballer), Scottish association football player"]}, {"page": "Perth Airport", "response": ["Site selection and preparation of the original plans was undertaken by Mr N M Fricker of the Department of Civil Aviation. In 1938, land was selected and purchased for the new aerodrome. The site selected in what was at the time Guildford, was an area of land granted by Governor James Stirling to local man John Scott, which later became the long disused Dunreath Golf Course."]}, {"page": "Rennell Rodd, 1st Baron Rennell", "response": ["On 27 October 1894, Rennell Rodd was married to Lilias Georgina Guthrie (1864–1951) at St George's Hanover Square Church. She was the fourth daughter of James Alexander Guthrie, 4th Baron of Craigie and the former Elinor Stirling (a daughter of Adm. Sir James Stirling, Governor of Western Australia from 1834 to 1838). Lilias' sister, Rose Ellinor Guthrie, was the wife of Maj.-Gen. The Hon. Sir Cecil Edward Bingham (a younger son of Charles Bingham, 4th Earl of Lucan). They had four sons and two daughters, including:"]}, {"page": "History of Western Australia", "response": ["*1829 – James Stirling explored the Swan River area. Captain Charles Fremantle again took possession of the western side of New Holland for the British crown on 2 May.", "In March 1831 the penal settlement was withdrawn, and the control of King George's Sound was transferred from New South Wales to the Swan River Colony. Captain James Stirling decreed that the settlement would be named \"Albany\" from 1 January 1832.", "The first significant European settlements were established on the Swan River by James Stirling in 1829. The colonists first sighted land on 1 June, an official Proclamation was made on 18 June and the foundation of the colony took place on 12 August. As Lieutenant Governor, Stirling had sole authority to draft laws and decide day-to-day affairs. On 6 February 1832, the colony was renamed Western Australia."]}, {"page": "Swan River Colony", "response": ["The name was a pars pro toto for Western Australia. On 6 February 1832 the colony was renamed the Colony of Western Australia, when the colony's founding lieutenant-governor, Captain James Stirling, belatedly received his commission. However, the name \"Swan River Colony\" remained in informal use for many years afterwards.", "The founding father of Western Australia was Captain James Stirling who, in 1827, explored the Swan River area in  which first anchored off Rottnest, and later in Cockburn Sound. He was accompanied by Charles Fraser, the New South Wales botanist."]}, {"page": "Gage Roads", "response": ["thumb|right|Bulk carrier Iran Yazo anchored in Gage RoadsGage Roads was named after Rear-Admiral Sir William Hall Gage who was the Royal Navy Commander-in-Chief, East Indies, when James Stirling was surveying the Swan River in 1826.Gage Roads – named by Captain Stirling in 1827 after Rear Admiral Gage – The Sunday Times (Perth), 4 Jan. 1987, p.32d"]}, {"page": "Cockburn Sound", "response": ["The sound was named in 1827 by Captain James Stirling, probably after Admiral Sir George Cockburn."]}, {"page": "Thomas Peel", "response": ["In October 1834, Peel was a part of the force, which also included James Stirling and John Septimus Roe, that were involved in the Pinjarra massacre that resulted in the deaths of an uncertain number of Binjareb people. Peel's involvement in the massacre was so that he could attract settlers into his land at Mandurah and to take revenge for the killing of his servant Hugh Nesbitt. In later years, he at one point described the local Binjareb people as a \"nest of hornets\"."]}, {"page": "Governors of the Australian states", "response": ["* Western Australia: Captain James Stirling (6 February 1832)"]}, {"page": "Governor of Western Australia", "response": ["| Captain Sir James Stirling RN ", "| Captain Sir James Stirling RN "]}, {"page": "List of colonial governors in 1829", "response": ["** Captain James Stirling, Lieutenant-Governor of Western Australia (1828–1839)"]}, {"page": "List of colonial governors in 1830", "response": ["* Western Australia – Captain James Stirling, Lieutenant-Governor of Western Australia (1828–1839)"]}, {"page": "List of colonial governors in 1831", "response": ["* Western Australia – Captain James Stirling, Lieutenant-Governor of Western Australia (1828–1839)"]}, {"page": "List of colonial governors in 1833", "response": ["* Western Australia – Captain James Stirling, Governor of Western Australia (1828–1839)"]}, {"page": "List of colonial governors in 1834", "response": ["* Western Australia – Captain James Stirling, Governor of Western Australia (1828–1839)"]}, {"page": "List of colonial governors in 1835", "response": ["* Western Australia – Captain James Stirling, Governor of Western Australia (1828–1839)"]}, {"page": "List of colonial governors in 1836", "response": ["*Western Australia – Captain James Stirling, Governor of Western Australia (1828–1839)"]}, {"page": "List of colonial governors in 1837", "response": ["* Western Australia – Captain James Stirling, Governor of Western Australia (1828–1839)"]}, {"page": "List of colonial governors in 1838", "response": ["* Western Australia – Captain James Stirling, Governor of Western Australia (1828–1839)"]}, {"page": "List of colonial governors in 1839", "response": ["*# Captain James Stirling, Governor of Western Australia (1828–1839)"]}, {"page": "City of Stirling", "response": ["At a meeting of electors in May 2021, electors passed a motion that the City of Stirling be renamed, causing it be considered at the next council meeting. The rationale was that the namesake of the city is James Stirling, the first governor of Western Australia, who is known for playing a leading role in the 1834 Pinjarra massacre of between 15 and 80 indigenous people. The motion made national news, and sparked a barrage of hateful messages towards the City of Stirling. Among suggestions was for a dual name to be adopted, involving a Noongar name. A report released by the city two weeks later stated that the name change was not a priority, and that there were significant costs associated with any name change. At the council meeting on 8 June, arguments were put forth either way, but no motions regarding changing the name were carried. The meeting was attended by over 100 people, an unusually high number."]}, {"page": "William Preston", "response": ["*William Preston (Royal Navy officer), captain in the British Royal Navy who, along with James Stirling, was responsible for the foundations of Perth and Fremantle in Western Australia"]}, {"page": "John Rodgers (1772–1838)", "response": ["Several years before Rodgers retired from the Board of Naval Commissioners his health began to decline, it is believed from a case of cholera. On advice that his condition would benefit from a leave of absence he was persuaded to take a trip across the Atlantic to England. Rodgers subsequently resigned his commission with the blessing of President Andrew Jackson and Secretary Mahlon Dickerson of the Navy. On May 10 he sailed for London, embarking from New York on the packet ship Montreal and spent several weeks in London. He also visited the towns of Plymouth and Portsmouth and was escorted and given much attention by the Admiralty of the Royal Navy and many notable people. He was the guest of two close friends, Admiral Sir James Stirling and Lady Hillyarm who were with the Mediterranean Fleet while Rodgers was serving there,  dealing with the piracy of the Barbary states.Paullin, 1910 pp.394-396"]}, {"page": "Divisions of the Australian House of Representatives", "response": ["|James Stirling"]}, {"page": "John Hutt", "response": ["Along with his brother William Hutt, John Hutt was heavily involved in the arrangements for the establishment of the colony of South Australia.  He was recommended to the position of first Governor of South Australia, but was instead appointed to succeed Sir James Stirling as Governor of Western Australia. He took office on 1 January 1839, holding the position until resigning his commission on 19 February 1846."]}, {"page": "Frederick Irwin", "response": ["In 1828, the British government decided to establish a colony on the western coast of Australia, and a cousin of Irwin's, James Stirling, was appointed its first Lieutenant-Governor.  Irwin was subsequently sent to the colony as a major in command of a detachment of the 63rd Regiment of Foot, whose mission was to protect and help establish the colony.  He arrived with his men on board HMS Sulphur in June 1829, six days after the arrival of the first settlers and Stirling on the Parmelia."]}]}}