{"wiki_id": "http://www.wikidata.org/entity/Q1368925", "itemLabel": "Simon Starling", "itemDescription": "British artist", "wikipedia_url": "https://en.wikipedia.org/wiki/Simon_Starling", "wikipedia_page": {"main": "Simon Starling (born 1967) is an English conceptual artist and won the Turner Prize in 2005.", "link_mentions": [{"page": "Turner Prize", "response": ["A great deal was made in the press about the winning entry by Simon Starling, which was a shed that he had converted into a boat, sailed down the River Rhine and turned back into a shed again. Two newspapers bought sheds and floated them to parody the work. The prize was presented by Culture Minister, David Lammy. Before introducing him, Sir Nicholas Serota, in an \"unusual, possibly unprecedented\" move, took the opportunity to make \"an angry defence\" of the Tate's purchase of The Upper Room.Notebook by Andrew Marr (2nd item), The Daily Telegraph, 7 December 2005 Retrieved 24 March 2006\"It's a shed, it's collapsible, it floats and (with help from a bike) it's the winner\", The Guardian, 6 December 2005. Retrieved 24 March 2006."]}, {"page": "Conceptual art", "response": ["* 2005: Simon Starling wins the Turner Prize for Shedboatshed, a wooden shed which he had turned into a boat, floated down the Rhine and turned back into a shed again."]}, {"page": "Glasgow School of Art", "response": ["The school has produced most of Scotland's leading contemporary artists including, since 2005, 30 per cent of Turner Prize nominees and five recent Turner Prize winners: Simon Starling in 2005, Richard Wright in 2009, Martin Boyce in 2011, Duncan Campbell in 2014 and Charlotte Prodger in 2018."]}, {"page": "Nottingham Trent University", "response": ["* Simon Starling – Turner Prize Winner, 2005"]}, {"page": "Hugo Boss Prize", "response": ["* Simon Starling (United Kingdom)"]}, {"page": "Sevenoaks School", "response": ["* Simon Starling, winner of the 2005 Turner Prize"]}, {"page": "Massachusetts Museum of Contemporary Art", "response": ["=== Simon Starling ===", "Simon Starling's The Nanjing Particles opened in December 2008. Based on small stereoscopic photograph depicting a large group of Chinese workers in front of Sampson Shoe Factory. Sampson had brought them east from California to break a strike. As a result, North Adams had the largest population of Chinese workers this side of the Mississippi. He viewed the stereograph image underneath a one-million-volt electron microscope, allowing him to see individual metal particles that comprise the photograph and allowing that to propel him towards the creation of two large-scale sculptures that were manufactured by hand in Nanjing, China."]}, {"page": "2005 in art", "response": ["*Turner Prize – Simon Starling, Shedboatshed"]}, {"page": "The Showroom", "response": ["Solo shows at The Showroom in the former East End space included Mona Hatoum, Sam Taylor-Wood, Simon Starling, Christina Mackie, Jim Lambie, Claire Barclay, and Eva Rothschild."]}, {"page": "Camden Arts Centre", "response": ["Central to its programme is the artist residency programme, which aims to develop artists' practices with practical support, resulting in new work and public participation. Past residency artists include: Salvatore Arancio, David Raymond Conroy, Caroline Achaintre, Jesse Wine, Phoebe Cummings, Anne Hardy, Alexandre da Cunha, Emma Hart, Veronica Ryan, Sally O'Reilly, Francis Upritchard, Jonathan Baldock, Mike Nelson, Graham Gussin, Martin Creed, Vivien Blackett, Simon Starling, Adam Chodzko, Athanasios Argianas and Walter Price. More recently, exhibitions including: Olga Balema and Elizabeth Murray. "]}, {"page": "Fabrice Hybert", "response": ["On the other hand, some of his projects look like exercises in visual language, his square football is not especially bewildering. It is quite simply a functional object that is turned into an ideal form (the cube). His idealised, cubed football maps onto the  horror of function that characterises post-Duchampian fine art that rose into dominance in the international art world in the 1960s. Fabrice ironically refers to such functionless objects as Prototypes d'objects en fonctionnement (prototypes of working objects), or POF. Another instance of connecting the previously unconnected (cf. Simon Starling) is Hyber's Swing (POF No 3), 1990. This is a playground swing with the addition of ‘two phallic protuberances on the seat, one hard, one soft’ (Eyestorm 2007)."]}, {"page": "Gillian Carnegie", "response": ["Nominated to the 2005 Turner Prize shortlist at London's Tate Britain gallery, her apparently traditional use of the oil medium prompted the Daily Telegraph headline: 'Turner Prize shocker: the favourite is a woman who paints flowers. Whatever next?' – in allusion to the medium-combative nature of the prize. She was beaten to the prize by Simon Starling's Shedboatshed."]}, {"page": "Louisa Buck", "response": ["In 2005, she was a member of the Turner Prize jury, which awarded the prize to Simon Starling, whose main exhibit Shedboatshed was a wooden shed he had converted into a boat, sailed down the River Rhine and then turned back into the original shed.\"One Man and His Boat Shed Sail into a Storm over the Turner\", The Times, 6 December 2005. Retrieved 27 March 2006"]}, {"page": "MIT Program in Art, Culture and Technology", "response": ["In 1974, Otto Piene succeeded Kepes as the director of the CAVS. Piene retired in 1994 and the CAVS was taken over by Krzysztof Wodiczko, who, after a hiatus, continued as director. In 2004, Wodiczko brought on board a new staff including Associate Director Larissa Harris, Meg Rotzel, and Joe Zane. The CAVS began a revitalization program which included numerous site visits by international artists, long-term residencies, and the commissioning of new artistic projects. Some of the later visitors included Marjetica Potrč, Miranda July, Vito Acconci, Simon Starling, Harrell Fletcher, John Malpede, David Robbins, Fritz Haeg, and Mel Chin."]}, {"page": "Stuckist demonstrations", "response": ["The Stuckists were included in reports on the Prize by the four UK broadsheets and in a Reuters syndication internationally, where Thomson commented, \"The Tate is run by a self-serving clique who hide behind secretiveness\" and \"The real prize at the Tate is becoming a trustee. It's worth far more money.\" The winner, Simon Starling had converted a shed into a boat and back again; The Times quoted Thomson that \"The Turner should be renamed the B&Q diy prize.\"\"One Man and His Boat Sail into a Storm over the Turner\", The Times, December 6, 2006 Retrieved March 28, 2006"]}, {"page": "Dundee Contemporary Arts", "response": ["* Art Gallery: presents a programme of contemporary Scottish, British and international art. Notable exhibitions include Mark Wallinger, Jane and Louise Wilson, Clare Woods, Beck's Futures prize winner Roderick Buchanan, Turner Prize winner Simon Starling, Turner Prize nominee Fiona Banner, acclaimed video artist Eija-Liisa Ahtila, and illustrator and textile designer Johanna Basford."]}, {"page": "Classificatory disputes about art", "response": ["Simon Starling wins the Turner Prize for Shedboatshed. Starling presented a wooden shed which he had converted into a boat, floated down the Rhine, then remade into a shed.The Times"]}, {"page": "Neo-conceptual art", "response": ["The Young British Artists (YBAs), led by Damien Hirst, came to prominence in the 1990s and their work was described at the time as neo-conceptual,Scott Lash and Celia Lury, Global Culture Industries: The Mediation of Things, Polity, 2007, p211.  even though it relies very heavily on the art object to make its impact. The term is used in relation to them on the basis that the object is not the artwork, or is often a found object, which has not needed artistic skill in its production. Tracey Emin is seen as a leading YBA and a neo-conceptualist, even though she has denied that she is and has emphasised personal emotional expression. Charles Harrison, a member of the conceptual art group Art and Language in the 1970s, criticizes the neo-conceptual art of the 1990s as conceptual art \"without threat or awkwardness\"Charles Harrison, Essays on Art & Language, MIT Press, 2001, p29.  and a \"vacant\" prospect.Charles Harrison, Essays on Art & Language, MIT Press, 2001, p241.  Other notable artists associated with neo-conceptualism in the UK include Martin Creed, Liam Gillick, Bethan Huws, Simon Patterson, Simon Starling and Douglas Gordon.", "2005: Simon Starling wins the Turner Prize for Shedboatshed, a wooden shed which he had turned into a boat, floated down the Rhine and turned back into a shed again."]}, {"page": "Decima Gallery", "response": ["*1998: June:Lost and Found - a group show including Simon Starling. Curated by Annalise Hollis by invitation of Matthew John Andrew.", "Adam Dant • Art of the United Kingdom • Contemporary art • David Shayler • Gary Hart • Harry Pye • Little Artists • Louise Camrass • Mark McGowan • Matt Calderwood • Micalef • Neil Zakiewicz • Paloma Faith • Piers Wardle • Sadie Frost • Simon Starling • Stephen Gill (photographer) • Tymon Dogg • Vic Reeves • Young British Artists"]}, {"page": "List of people from Epsom", "response": ["*Simon Starling, Turner Prize 'Shedboatshed' winner, born 1967"]}, {"page": "Post-YBAs", "response": ["According to Matthew Higgs, Simon Starling's winning of the Turner Prize in 2005 reflected a post-YBA sensibility which is more modestly material and formal than spectacle-driven.artnet Magazine, 6 Dec 2005 Enrico David tapped into a post-YBA vogue for craft.timeout.com , accessed 7 December 2007. The post-YBA generation has also been associated with neo-conceptual art with a political edge.Jonathan Jones, The Guardian, 30 September 2000."]}, {"page": "The Power Plant", "response": ["* Simon Starling: Infestation Piece (Musselled Moore) (2008)"]}, {"page": "Francis McKee", "response": ["Francis McKee has written extensively on the work of artists linked to Glasgow such as Christine Borland, Ross Sinclair, Douglas Gordon, Simon Starling and other international artists including Minerva Cuevas, Matthew Barney, Pipilotti Rist, Willie Doherty, Joao Penalva, Abraham Cruzvillegas, Beatriz Santiago Muñoz and co-published books on the Icelandic Love Corporation and Salla Tykkä in collaboration with NIFCA (Nordic Institute for Contemporary Art)."]}, {"page": "Outset Contemporary Art Fund", "response": ["100 works of art were acquired over ten years from artists including: Pawel Althamer, Hurvin Anderson, Fikret Atay, Martin Boyce, Jeremy Deller, Alexandre de Cunha, Jimmie Durham, Olafur Eliasson, Andrea Fraser, Thomas Hirschhorn, Jesper Just, Alan Kane, Bela Kolárová, Mark Leckey, Daria Martin, Jan Mot, Scott Myles, Frank Nitsche, Henrik Olesen, Walid Raad, Anri Sala, David Shrigley, Lorna Simpson, Simon Starling, Tris Vonna-Michell, Pae White, Akram Zaatari."]}, {"page": "Francesca Thyssen-Bornemisza", "response": ["Thyssen-Bornemisza regularly participates in biennales by commissioning new works of contemporary art through a foundation called Thyssen-Bornemisza Art Contemporary (TBA21) which she founded in 2002 in Vienna. She has built up her own art collection with around 700 works of contemporary video and digital art, by artists such as John Akomfrah,Angelica Villa (10 December 2021), Thyssen-Bornemisza Art Contemporary Teams Up with Córdoba to Revitalize Spanish City ARTnews. Kutluğ Ataman, Candice Breitz,Gareth Harris (May 30, 2017), Final show in Vienna for Thyssen-Bornemisza Art Contemporary as organisation relocates to Prague The Art Newspaper. Olafur Eliasson,Angelica Villa (10 December 2021), Thyssen-Bornemisza Art Contemporary Teams Up with Córdoba to Revitalize Spanish City ARTnews. Simon StarlingGareth Harris (May 30, 2017), Final show in Vienna for Thyssen-Bornemisza Art Contemporary as organisation relocates to Prague The Art Newspaper. and Ai Weiwei.Angelica Villa (10 December 2021), Thyssen-Bornemisza Art Contemporary Teams Up with Córdoba to Revitalize Spanish City ARTnews."]}, {"page": "Nuclear Energy (sculpture)", "response": ["The British conceptual artist Simon Starling's Project for a Masquerade (Hiroshima) tells the story of Moore's Nuclear Energy, focusing on the working model in Hiroshima and the full-scale work in Chicago, and the different meaning the work carries in the two places. The work consists of eight masks, each simultaneously representing a figure in the story of the Moore sculpture and in the sixteenth-century Noh play Eboshi-ori."]}, {"page": "Mexico–United Kingdom relations", "response": ["In Mexico, a special drama series, \"Los británicos\" (The British), production of the BBC and British Council, aired on Canal 22 in February–April. Art exhibitions include artists such as Michael Landy, Stephen Willats and Simon Starling. The UK will be the guest of honor at the Feria de las Culturas Amigas held in Mexico City and the Guadalajara International Book Fair."]}, {"page": "Catalyst Arts", "response": ["Catalyst Arts was founded on a constitution that provides a structure in which power flows from the roots of its membership to the committee of directors. Catalyst Arts boasts an archive of over 2000 unique documents of Northern Irish art history, which it is currently preparing to make publicly accessible. Catalyst Arts has also organised projects internationally. Catalyst has strong links with the University of Ulster. Catalyst Arts has shown works of David Shrigley, Ross Sinclair, Susan Phillipz, Phil Collins, Michelle D Hannah, Roddy Buchanan, Simon Starling, Bill Drummond to name a few, and has turned the gallery into a sauna with Joanna Karolini. They have also worked on exchanges with 126 in Galway."]}, {"page": "Karriere Bar", "response": ["Simon Starling,"]}, {"page": "Loch Long One Design", "response": ["There are active racing fleets at Cove Sailing Club on the Clyde and Aldeburgh Yacht Club on the River Alde. In the past there have been fleets at Gourock, Tighnabruaich, Fairlie and Largs on the Clyde, and Granton on the Firth of Forth. A few Loch Longs have escaped the straitjacket of racing and may be found elsewhere. They have been seen as far afield as Kyle of Lochalsh, Falmouth and even across the Atlantic; at least one was exported to the USA, and another was transported to Brazil by the artist Simon Starling and features as a piece of installation art!", "* Art Tattler article on the art of Simon Starling"]}, {"page": "Casey Kaplan", "response": ["The gallery was founded in 1995 in a , one-room space located on the upper floor of a cast iron loft building on Broadway, before moving to Greene Street in 1997. The gallery relocated in 2000 to a store-front gallery space in Chelsea / Meatpacking District on 14th Street. During this time, Casey Kaplan hosted the first ever New York solo exhibitions of many now canonized contemporary artists, such as Jason Dodge, Trisha Donnelly, Carsten Höller, Jonathan Monk and Simon Starling, in addition to staging solo shows with Liam Gillick and curatorial collaborations with Daniel Birnbaum and artist Douglas Gordon.", "* Simon Starling"]}, {"page": "New Contemporaries", "response": ["In 1987, the Arts Council of Great Britain commissioned a feasibility report on New Contemporaries to look into the future viability of the exhibition. Published by Richard Shone, who has since become the Chair of a Volunteer Board of Directors, the report proposed a new structure and constitution for the organisation. For the first time, the exhibition was made independent from the art colleges, and supported by professional administration, inviting a panel of selectors each year to pick contributors. The exhibition was relaunched at the ICA in 1989 and toured to four regional centres. From 1989-1994, the exhibition was sponsored by British Telecom and since 2000 has been sponsored by Bloomberg. In 1996, the exhibition was invited to become an component of the Liverpool Biennial of Contemporary Art and has since been staged in the city every two years. New Contemporaries is also supported by the Arts Council England. During this recent period participants have included Damien Hirst, Glen Brown (both 1989), Simon Starling (1994) and Hardeep Pandhal (2013)."]}, {"page": "Inhotim", "response": ["File:Inhotim Simon Starling 02.jpg|Simon Starling"]}, {"page": "Starling (name)", "response": ["*Simon Starling (born 1967), English artist"]}, {"page": "Beto Shwafaty", "response": ["Shwafaty is an artist and researcher based in Brazil. He has a bachelor's degree from UNICAMP (Campinas, 2001), obtained a master's degree in visual arts and curatorial studies from Nuova Accademia di Belle Arti–NABA (Milan, 2010) and attended  Simon Starling's classes at the Staedelschule (Frankfurt am Main, 2010–2011). Shwafaty has been involved with collective, research-based, curatorial and spatial practices since early 2000s, and as a result, his own practice explores the converging spheres of critical design, spatial politics, knowledge economy, and visual culture in ways that assume art as a productive system able to stimulate changes and reflections on social behavior and cognition when related to historical, interdisciplinary, and public issues."]}, {"page": "Sculpture in Scotland", "response": ["Ideas-based art began to dominate Scottish sculpture from the mid 1980s. A number of women sculptors, public artists and installation artists rose to prominence in what had been a male dominated area. These included Kirsty McGhie (b. 1959), Sybille von Halem (b. 1963) and Claire Barclay (b. 1968), all of whom were graduates of Environmental Art at Glasgow.A. Patrizio, Contemporary Sculpture in Scotland (Sydney: Craftsman House, 1999), , p. 13. Particularly significant were artists involved with the Transmission Gallery and Variant magazine in Glasgow. Of these Douglas Gordon went on to win the Turner Prize in 1996 and Christine Borland (b. 1965) was short-listed the following year. Contemporary sculptors that have emerged since the 1980s include David Mach (b. 1960), working in the mediums of sculpture and installation art. He has produced work including his Big Heids (1997), which provided a commentary on the declining iron industry.P. Küppers, The Scar of Visibility: Medical Performances And Contemporary Art (Minneapolis, MN: University of Minnesota Press, 2007), , p. 61. James Lambie (b. 1965) specialises in colourful sculptural installations.C. Richardson, Scottish Art Since 1960: Historical Reflections and Contemporary Overviews (Aldershot: Ashgate, 2011), , p. 177. Simon Starling's conceptual art includes Shedboatshed, which won the Turner Prize in 2003.R. Pooler, The Boundaries of Modern Art (Arena, 2013), , p. 67. In 2003, Lambing, Starling and Barclay were chosen to represent the newly devolved-Scotland at the Venice Biennale, marking the place of Scotland, and particularly Glasgow, as a hub of European art culture.C. Richardson, Scottish Art Since 1960: Historical Reflections and Contemporary Overviews (Aldershot: Ashgate, 2011), , pp. 165–6. A group that emerged from Glasgow School of Art in the early 1990s, and later described as \"The Irascibles\", included sculptor Martin Boyce (b. 1967),N. Mulholland, The Cultural Devolution: Art in Britain in the Late Twentieth Century (Aldershot: Ashgate, 2003), , p. 144. who won the Turner Prize in 2011 for his installation Do Words Have Voices."]}, {"page": "GENERATION: 25 Years of Contemporary Art in Scotland", "response": ["* Simon Starling"]}, {"page": "Gregory Burke (curator)", "response": ["Burke has published over 100 texts and curated over 90 exhibitions since the late 1980s, including solo exhibitions for artists Michael Snow, Rosemarie Trockel, Thomas Hirschhorn, Lawrence Weiner, Ian Wallace, Christopher Williams, Goldin+Senneby, Pae White, Sam Durant, Simon Starling, Candice Breitz, Scott Lyall, Derek Sullivan and Len Lye. Burke has organized major exhibitions of Asian art, such as Mediarena: Contemporary Art from Japan (2004) and Transindonesia (2005). In 2009, he curated Universal Code: Art and Cosmology in the Information Age (2009), which won the Ontario Association of Art Galleries’s \"Exhibition of the Year\" award."]}, {"page": "Chris Harrison (photographer)", "response": ["In 1985, he took up photography and in June 1990, Harrison graduated alongside Simon Starling and Nick Waplington with an honours degree in photographic studies from Trent Polytechnic, Nottingham."]}]}}