{"wiki_id": "http://www.wikidata.org/entity/Q1361189", "itemLabel": "Thomas Campbell", "itemDescription": "Scottish poet", "wikipedia_url": "https://en.wikipedia.org/wiki/Thomas_Campbell_(poet)", "wikipedia_page": {"main": "Thomas Campbell (27 July 1777 – 15 June 1844) was a Scottish poet. He was a founder and the first President of the Clarence Club and a co-founder of the Literary Association of the Friends of Poland; he was also one of the initiators of a plan to found what became University College London. In 1799 he wrote \"The Pleasures of Hope\", a traditional 18th-century didactic poem in heroic couplets. He also produced several patriotic war songs—\"Ye Mariners of England\", \"The Soldier's Dream\", \"Hohenlinden\" and, in 1801, \"The Battle of the Baltic\", but was no less at home in delicate lyrics such as \"At Love's Beginning\".", "link_mentions": [{"page": "List of English-language poets", "response": ["*Thomas Campbell (1774–1844, S/E)"]}, {"page": "July 27", "response": ["*1777 – Thomas Campbell, Scottish-French poet and academic (d. 1844)"]}, {"page": "June 15", "response": ["*1844 – Thomas Campbell, Scottish poet and academic (b. 1777)"]}, {"page": "Wyoming", "response": ["The region acquired the name Wyoming by 1865, when Representative James Mitchell Ashley of Ohio introduced a bill to Congress to provide a \"temporary government for the territory of Wyoming\". The territory was named after the Wyoming Valley in Pennsylvania, made famous by the 1809 poem Gertrude of Wyoming by Thomas Campbell, based on the Battle of Wyoming in the American Revolutionary War. The name ultimately derives from the Munsee word , meaning 'at the big river flat'."]}, {"page": "Washington Irving", "response": ["Irving was one of the first American writers to earn acclaim in Europe, and he encouraged other American authors such as Nathaniel Hawthorne, Henry Wadsworth Longfellow, Herman Melville and Edgar Allan Poe. He was also admired by some British writers, including Lord Byron, Thomas Campbell, Charles Dickens, Mary Shelley, Francis Jeffrey and Walter Scott. He advocated for writing as a legitimate profession and argued for stronger laws to protect American writers from copyright infringement."]}, {"page": "1844", "response": ["* June 15 – Thomas Campbell, Scottish poet (b. 1777)"]}, {"page": "1777", "response": ["** Thomas Campbell, Scottish poet (d. 1844)"]}, {"page": "Thomas Telford", "response": ["Telford's reputation as a man of letters may have preceded his fame as an engineer: he had published poetry between 1779 and 1784, and an account of a tour of Scotland with Robert Southey. His will left bequests to Southey (who would later write Telford's biography), the poet Thomas Campbell (1777–1844) and to the publishers of the Edinburgh Encyclopædia (to which he had been a contributor)."]}, {"page": "Charles Badham", "response": ["Badham was born at Ludlow, Shropshire, the fourth son of Charles Badham senior, a classical scholar and regius professor of physic at Glasgow; and Margaret Campbell, a cousin of Thomas Campbell, the poet. His elder brother, Rev. Dr Charles David Badham, became a physician and popular writer."]}, {"page": "List of poets", "response": ["*Thomas Campbell (1777–1844), Scottish poet"]}, {"page": "Apocalyptic and post-apocalyptic fiction", "response": ["Lord Byron's 1816 poem \"Darkness\", included in The Prisoner of Chillon collection, on the apocalyptic end of the world and one man's survival, was one of the earliest English-language works in this genre. The sun was blotted out, leading to darkness and cold which kills off mankind through famine and ice-age conditions. The poem was influential in the emergence of \"the last man\" theme which appeared in the works of several poets, such as \"The Last Man\" by Thomas Campbell (1824) and \"The Last Man\" (1826) by Thomas Hood, as well as \"The Last Man\" by Thomas Lovell Beddoes. The year 1816 was known as the Year Without a Summer because Mount Tambora had erupted in the Dutch East Indies in 1815 that emitted sulphur into the atmosphere which lowered the temperature and altered weather patterns throughout the world. This was the source for Byron's poem."]}, {"page": "Thomas Lawrence", "response": ["Lawrence's friends asked the Scottish poet Thomas Campbell to write the artist's biography, but he passed the task on to D.E. Williams whose two rather inaccurate volumes were published in 1831.Levey 2005: 302–3 It would be nearly 70 years later, in 1900, before another biography of Lawrence appeared, this time by Lord Ronald Gower. In 1913 Sir Walter Armstrong, who was not a great admirer of Lawrence, published a monograph. The 1950s saw the publication of two further works: Douglas Goldring's Regency portrait painter, and Kenneth Garlick's catalogue of Lawrence's paintings (a further edition was published in 1989). Sir Michael Levey, curator of the National Portrait Gallery's 1979–80 Lawrence exhibition, produced books on the artist in 1979 and 2005. Lawrence's entanglements with the Siddons family has been the subject of three books (by Oswald Knapp, André Maurois, and Naomi Royde-Smith) and a recent radio play.", "File:Thomas Campbell by Sir Thomas Lawrence.jpg|Thomas Campbell, circa 1810"]}, {"page": "Universities in the United Kingdom", "response": ["Very soon after news of the York scheme broke, Thomas Campbell wrote to The Times proposing a university be founded in London. This would become UCL, founded in 1826 as a joint stock company under the name of London University. Due to its lack of theology teaching, its willingness to grant degrees (if it were given this power) to non-Anglicans, and its unauthorised assumption of the title of \"university\", this inspired calls in 1827 for the foundation of a 'true and genuine \"London University\"' by royal charter, to be known (in the same manner as Edinburgh was officially known as the College of King James VI) as \"The College of King George IV in London\". This became King's College London, granted a royal charter in 1829 – but as a college rather than a university."]}, {"page": "Dulwich", "response": ["By 1815 the Green Man had become a school known as Dr. Glennie's academy in Dulwich Grove, although it was demolished about ten years later. Among the pupils here there were a few who became well known, Lord Byron, General Le Marchant and Captain Barclay. Dr Glennie held Saturday evening concerts which attracted visitors from outside the family circle, such as the poet Thomas Campbell, then living in nearby Sydenham, and Robert Barker, inventor of the panorama. Following the closure of the school, the building reverted to its original use and was known as the Grove Tavern. The building has now been boarded up and neglected for many years by owners the Dulwich Estate. In 1803, Samuel Matthews – known as the \"Dulwich Hermit\" – was also murdered in Dulwich Woods; he was buried in Dulwich Old Cemetery. 1811–1814 saw the building of the Dulwich Picture Gallery."]}, {"page": "Sydenham, London", "response": ["*Thomas Campbell — poet"]}, {"page": "Scottish Enlightenment", "response": ["* Thomas Campbell (1777–1844) poet "]}, {"page": "Glen Ullin, North Dakota", "response": ["Glen Ullin was founded in 1883 along the transcontinental route of the Northern Pacific Railway. The name was created by Major Alvan E. Bovay, a Northern Pacific land agent at the time.  Glen, the Scottish Gaelic word for \"valley,\" was chosen because of the city's location within a valley, while Ullin was taken from the Thomas Campbell poem Lord Ullin's Daughter. Glen Ullin was originally built up chiefly by Germans from Russia."]}, {"page": "Lynden, Washington", "response": ["Lynden was begun in 1871 and established in 1874 by Holden and Phoebe Judson near the site of the Nooksack Indian village Squahalish (Nooksack: Sqwehálich). It was named by Phoebe Judson after the riverside town in Hohenlinden, a poem by Thomas Campbell. According to her book, A Pioneer's Search for an Ideal Home, she changed the spelling of \"Linden\" to be more visually appealing. Lynden was officially incorporated as a city on March 16, 1891."]}, {"page": "Battle of Hohenlinden", "response": ["The battle is the subject of a poem Hohenlinden by Thomas Campbell (1777–1844). The first verse is:"]}, {"page": "William Hazlitt", "response": ["His praise of the poet Thomas Campbell has been cited as one major instance where Hazlitt's critical judgement proved wrong. Hazlitt can scarcely conceal his enthusiasm for such poems as Gertrude of Wyoming, but neither the poems nor Hazlitt's judgement of them have withstood the test of time.\"The subjects of some [of these essays], like Thomas Campbell, seem hardly to deserve the praise which Hazlitt accords them\", wrote Ralph Wardle (p. 406), in 1971. His friends Hunt and Lamb get briefer coverage, and—Hazlitt was never one to mince words—they come in for some relatively gentle chiding amid the praise. One American author makes an appearance, Washington Irving, under his pen name of Geoffrey Crayon."]}, {"page": "Tyrtaeus", "response": ["There are English verse translations by Richard Polwhele (1792) and imitations by the English poet laureate H. J. Pye (1795), and an Italian version by F. Cavallotti, with text, introduction and notes (1898). The fragment that begins with  (fr. 10 West) has been translated by the poet Thomas Campbell. The edition by C. A. Klotz (1827) contains a dissertation on the war-songs of different countries."]}, {"page": "Massacre of Glencoe", "response": ["Glencoe was a popular topic with 19th-century poets, the best-known work being Sir Walter Scott's \"Massacre of Glencoe\". It was used as a subject by Thomas Campbell and George Gilfillan, whose main claim to modern literary fame is his sponsorship of William McGonagall, allegedly the worst poet in British history. Other poetic references include Letitia Elizabeth Landon's \"Glencoe\" (1823), T. S. Eliot's \"Rannoch, by Glencoe\" and \"Two Poems from Glencoe\" by Douglas Stewart.Stewart Douglas. Two Poems from Glencoe , at Australian Poetry Library. Accessed 5 October 2015"]}, {"page": "Culdees", "response": ["The term Culdee has been improperly applied to the whole Celtic church, and a superior purity has been claimed for it. It has also been asserted, that the Kelts or Culdees were the forerunners of Protestantism. Protestant writers alleged that the Culdees had preserved Celtic Christianity, free from supposed Roman corruptions, in one remote corner of western Europe. This view was enshrined in Thomas Campbell's Reullura:"]}, {"page": "James Mackintosh", "response": ["The poet Thomas Campbell claimed that had it not been for Mackintosh's book, Burke's anti-revolutionary opinions would have become universal amongst the educated classes and that he ensured that he became \"the apostle of liberalism\".O'Leary, p. 22."]}, {"page": "1844 in literature", "response": ["*June 15 – Thomas Campbell, Scottish poet (born 1777)"]}, {"page": "1824 in literature", "response": ["*Thomas Campbell – Theodric; a domestic tale; and other poems Theodric; a domestic tale; and other poems."]}, {"page": "1823 in literature", "response": ["*Thomas Campbell – The Last Man"]}, {"page": "1819 in literature", "response": ["*Thomas Campbell – Specimens of the British Poets"]}, {"page": "1811 in literature", "response": ["*November 4 – Lord Byron meets Thomas Campbell and Thomas Moore at the home of Samuel Rogers, where the company discusses literary topics."]}, {"page": "William Harrison Ainsworth", "response": ["Besides Crossley, another close friend to Ainsworth was John Aston, a clerk who worked in his father's legal firm. In 1823, Ainsworth and Crossley began to write many works together, including the first novel Sir John Chiverton that was based around Hulme Hall in Manchester. Ainsworth wrote to Thomas Campbell, editor of The New Monthly Magazine, about publishing the work: but Campbell lost the letter. At the request of Ainsworth, Crossley travelled to London to meet Campbell and discuss the matter before visiting in November. Although the novel was not yet published, in December 1823, Ainsworth was able to get G. and W. Whittaker to publish a collection of his stories as December Tales. During 1824, Ainsworth set about producing his own magazine, The Boeotian, which was first published on 20 March but ended after its sixth issue on 24 April.Ellis 1979 pp. 93–111"]}, {"page": "1809 in literature", "response": ["*Thomas Campbell – Gertrude of Wyoming"]}, {"page": "Samuel Rogers", "response": ["In 1788 his elder brother Thomas died, and Samuel's business responsibilities were increased. In the next year he paid a visit to Scotland, where he met Adam Smith, Henry Mackenzie, Hester Thrale and others. In 1791 he was in Paris, and enjoyed the Orleans Collection of art at the Palais Royal, many of the treasures of which were later to pass into his possession. With Gray as his model, Rogers took great pains in polishing his verses, and six years elapsed after the publication of his first volume before he printed his elaborate poem on The Pleasures of Memory (1792) – regarded by some as the last embodiment of the poetic diction of the 18th century. The theory of elevating and refining familiar themes by abstract treatment and lofty imagery is taken to extremes. In this art of \"raising a subject\", as the 18th century phrase was, the Pleasures of Memory is much more perfect than Thomas Campbell's Pleasures of Hope, published a few years later in imitation. Byron said of it, \"There is not a vulgar line in the poem.\""]}, {"page": "Thomas Phillips", "response": ["Phillips also painted portraits of Walter Scott, Robert Southey, George Anthony Legh Keck (1830), Thomas Campbell (poet), Joseph Henry Green, Samuel Taylor Coleridge, Henry Hallam, Mary Somerville, Sir Edward Parry, Sir John Franklin, Dixon Denham, the African traveller, and Hugh Clapperton. Besides these he painted two portraits of Sir David Wilkie, the Duke of York (for the town-hall, Liverpool), Dean William Buckland, Sir Humphry Davy, Samuel Rogers, Michael Faraday (engraved in mezzotint by Henry Cousins), John Dalton, and a head of Napoleon I, painted in Paris in 1802, not from actual sittings, but with Empress Josephine's consent, who afforded him opportunities of observing the First Consul while at dinner. Years later in Paris, he was to portray his younger colleague Ary Scheffer (c. 1835, Musée de la Vie romantique, Paris)."]}, {"page": "1799 in literature", "response": ["*Thomas Campbell – The Pleasures of Hope"]}, {"page": "1777 in literature", "response": ["*July 27 – Thomas Campbell, Scottish poet (died 1844)"]}, {"page": "Lewis Campbell (classicist)", "response": ["Campbell was born in Edinburgh. His father, Robert Campbell, RN, was a first cousin of Thomas Campbell, the poet. His mother was the author Eliza Constantia Campbell. His father died when he was two years of age. In 1844 his mother married Colonel Morrieson."]}, {"page": "Richard Heber", "response": ["After ransacking England for books, Heber travelled extensively on the Continent, purchasing everywhere, and leaving large depots of books in Paris, Antwerp, Brussels, Ghent, and elsewhere in the Netherlands and Germany. At booksales he sometimes purchased single volumes, sometimes whole libraries. Sir Walter Scott classed Heber's library as \"superior to all others in the world\"; Thomas Campbell described him as \"the fiercest and strongest of all the bibliomaniacs.\" He did not confine himself to the purchase of a single copy of a work which took his fancy. \"No gentleman,\" he remarked, \"can be without three copies of a book, one for show, one for use, and one for borrowers.\" To such a size did his library grow that it overran eight houses, some in England, some on the Continent."]}, {"page": "Francis Jeffrey, Lord Jeffrey", "response": ["Jeffrey's own contributions numbered two hundred, all except six being written before his resignation of the editorship. He wrote quickly, at odd moments of leisure and with little special preparation. Great fluency and ease of diction, considerable warmth of imagination and moral sentiment, and a sharp eye to discover any oddity of style or violation of the accepted canons of good taste, made his criticisms pungent and effective. But the essential narrowness and timidity of his general outlook prevented him from detecting and estimating latent forces, either in politics or in matters strictly intellectual and moral; and this lack of understanding and sympathy accounts for his distrust and dislike of the passion and fancy of Shelley and Keats, and for his praise of the half-hearted and elegant romanticism of Samuel Rogers and Thomas Campbell."]}, {"page": "Scottish literature", "response": ["Scottish poetry is often seen as entering a period of decline in the nineteenth century,L. Mandell, \"Nineteenth-century Scottish poetry\", in I. Brown, ed., The Edinburgh History of Scottish Literature: Enlightenment, Britain and empire (1707–1918) (Edinburgh: Edinburgh University Press, 2007), , pp. 301–07. with a descent of into infantalism as exemplified by the highly popular Whistle Binkie anthologies (1830–90).G. Carruthers, Scottish Literature (Edinburgh: Edinburgh University Press, 2009), , pp. 58–9. However, Scotland continued to produce talented and successful poets, including weaver-poet William Thom (1799–1848), Lady Margaret Maclean Clephane Compton Northampton (d. 1830), William Edmondstoune Aytoun (1813–65) and Thomas Campbell (1777–1844), whose works were extensively reprinted in the period 1800–60. Among the most influential poets of the later nineteenth century were James Thomson (1834–82) and John Davidson (1857–1909), whose work would have a major impact on modernist poets including Hugh MacDiarmid, Wallace Stevens and T. S. Eliot.M. Lindsay and L. Duncan, The Edinburgh Book of Twentieth-century Scottish Poetry (Edinburgh: Edinburgh University Press, 2005), , pp. xxxiv–xxxv. The Highland Clearances and widespread emigration significantly weakened Gaelic language and culture and had a profound impact on the nature of Gaelic poetry. The best poetry in this vein contained a strong element of protest, including Uilleam Mac Dhun Lèibhe's (William Livingstone, 1808–70) protest against the Islay and Seonaidh Phàdraig Iarsiadair's (John Smith, 1848–81) condemnation of those responsible for the clearances. The best known Gaelic poet of the era was Màiri Mhòr nan Óran (Mary MacPherson, 1821–98), whose evocation of place and mood has made her among the most enduring Gaelic poets."]}, {"page": "Robert Blake (admiral)", "response": ["Blake is also mentioned in the poem Ye Mariners of England by Thomas Campbell, and is the subject of the poem  by Letitia Elizabeth Landon (1836)."]}, {"page": "Onalaska, Wisconsin", "response": ["The name for the city comes from the poem \"The Pleasures of Hope\", by the Scottish poet Thomas Campbell. The original spelling of the name in Campbell's poem was \"Oonalaska\" (an Aleutian island and fishing village).", "Other places named Onalaska are in Arkansas (now defunct), Texas and Washington; they are historically linked to one another through the lumber industry. In Alaska, the modern day city of Unalaska and Unalaska Island are linked to the Onalaskas through Thomas Campbell's poem. Unalaska is the original Oonalaska or Onalaska or \"Ounalashka\" (Russian spelling) immortalized by Campbell."]}, {"page": "George Crabbe", "response": ["His two sons followed him, as soon as their existing engagements allowed them to leave Leicestershire. The younger, John, who married in 1816, became his father's curate, and the elder, who married a year later, became curate at Pucklechurch, also nearby. Crabbe's reputation as a poet continued to grow in these years. His growing reputation soon made him a welcome guest in many houses to which his position as vicar of Trowbridge might not have admitted him. Nearby was the poet William Lisle Bowles, who introduced Crabbe to the noble family at Bowood House, home of the Marquess of Lansdowne, who was always ready to welcome those distinguished in literature and the arts. It was at Bowood House that Crabbe first met the poet Samuel Rogers, who became a close friend and had an influence on Crabbe's poetry. In 1817, on the recommendation of Rogers, Crabbe stayed in London from the middle of June to the end of July in order to enjoy the literary society of the capital. While there he met Thomas Campbell, and through him and Rogers was introduced to his future publisher John Murray."]}, {"page": "Palgrave's Golden Treasury", "response": ["William Blake – Lord Byron – Thomas Campbell – Hartley Coleridge – Samuel Taylor Coleridge – Allan Cunningham – Thomas Hood – John Keats – Charles Lamb – Mary Lamb – H. F. Lyte – Thomas Moore – Percy Bysshe Shelley – Sir Walter Scott – Robert Southey – Charles Wolfe – William Wordsworth", "Dannie Abse – Fleur Adcock – William Alexander, Earl of Stirling – Kingsley Amis – Simon Armitage – Matthew Arnold – W. H. Auden – Francis Bacon, Lord Verulam – Anna Laetitia Barbauld – George Barker – Richard Barnfield – Francis Beaumont – Patricia Beer – John Betjeman – Laurence Binyon – Thomas Blackburn – Edmund Blunden – Eavan Boland – Ronald Bottrall – Robert Bridges – George Mackay Brown – Elizabeth Barrett Browning – Robert Browning – Alan Brownjohn – Robert Burns – George Gordon Noel, Lord Byron – Norman Cameron – Roy Campbell – Thomas Campbell – Thomas Campion – Thomas Carew – Henry Carey – Lewis Carroll – Charles Causley – Colley Cibber – John Clare – Austin Clarke – Jack Clemo – Arthur Hugh Clough – Hartley Coleridge – Samuel Taylor Coleridge – John Collins – William Collins – Tony Connor – Henry Constable – David Constantine – Abraham Cowley – William Cowper – Richard Crashaw – Robert Crawford – Allan Cunningham – Samuel Daniel – George Darley – Donald Davie – W. H. Davies – Dick Davis – Thomas Dekker – Walter de la Mare – Lord De Tabley – Richard Watson Dixon – Keith Douglas – Ernest Dowson – Michael Drayton – William Drummond – John Dryden – Carol Ann Duffy – Helen Dunmore – Douglas Dunn – Lawrence Durrell – Thomas Stearns Eliot – Alistair Elliot – Jean Elliot – William Empson – D. J. Enright – Gavin Ewart – James Fenton – Roy Fisher – Edward FitzGerald – John Fletcher – Veronica Forrest-Thomson – John Fuller – Roy Fuller – Elizabeth Garrett – David Gascoyne – John Gay – Oliver Goldsmith – Robert Graham – Robert Graves – Thomas Gray – Thom Gunn – Michael Hamburger – Ian Hamilton – Thomas Hardy – Tony Harrison – Seamus Heaney – John Heath-Stubbs – George Herbert – Robert Herrick – Thomas Heywood – Geoffrey Hill – Ralph Hodgson – David Holbrook – Molly Holden – Thomas Hood – Gerard Manley Hopkins – A. E. Housman – Ted Hughes – T. E. Hulme – Elizabeth Jennings – Lionel Johnson – Ben Jonson – Patrick Kavanagh – John Keats – Sidney Keyes – Thomas Kinsella – Rudyard Kipling – James Kirkup – Charles Lamb – Walter Savage Landor – Philip Larkin – D. H. Lawrence – Edward Lear – Laurie Lee – Alun Lewis – Cecil Day-Lewis – Lady Anne Lindsay – Thomas Lodge – John Logan – Michael Longley – Richard Lovelace – Edward Lowbury – John Lyly – George MacBeth – Norman MacCaig – Hugh MacDiarmid – Louis MacNeice – Derek Mahon – Christopher Marlowe – Andrew Marvell – John Masefield – George Meredith – William Julius Mickle – John Milton – Thomas Moore – William Morris – Andrew Motion – Edwin Muir – Paul Muldoon – Carolina, Lady Nairne – Thomas Nash – Robert Nichols – Norman Nicholson – Bernard O'Donoghue – Wilfred Owen – Coventry Patmore – Tom Paulin – Ambrose Philips – Alexander Pope – Peter Porter – Jonathan Price – F. T. Prince – Matthew Prior – Craig Raine – Peter Redgrove – Henry Reed – Anne Ridler – Michael Riviere – W. R. Rodgers – Samuel Rogers – Isaac Rosenberg – Alan Ross – Christina Georgina Rossetti – Dante Gabriel Rossetti – Carol Rumens – Lawrence Sail – Siegfried Sassoon – Vernon Scannell – Sir Walter Scott – Peter Scupham – Sir Charles Sedley – George Sewell – William Shakespeare – Percy Bysshe Shelley – James Shirley – Sir Philip Sidney – Jon Silkin – C. H. Sisson – Edith Sitwell – Iain Crichton Smith – Stevie Smith – Robert Southey – Bernard Spencer – Stephen Spender – Edmund Spenser – Jon Stallworthy – Anne Stevenson – Sir John Suckling – Algernon Charles Swinburne – Joshua Sylvester – Alfred, Lord Tennyson – Dylan Thomas – Edward Thomas – R. S. Thomas – Francis Thompson – James Thomson (The Seasons) – James Thomson (B.V.) – Anthony Thwaite – Terence Tiller – Charles Tomlinson – The Shepherd Tony – Henry Vaughan – Edward Vere, Earl of Oxford – John Wain – Ted Walker – Edmund Waller – Vernon Watkins – John Webster – Robert Wells – Lawrence Whistler – Hugo Williams – George Wither – Charles Wolfe – William Wordsworth – Sir Henry Wotton – David Wright – Kit Wright – Sir Thomas Wyat – William Butler Yeats – Andrew Young"]}, {"page": "Jude Law", "response": ["Law is a featured artist on Vampire Weekend's 2019 album, Father of the Bride, in which he recites Thomas Campbell's poem \"Lord Ullin's Daughter\" during the song of the same name."]}, {"page": "George Square", "response": ["The  column in the centre of the square celebrates author Sir Walter Scott. It was erected in 1837. Eleven of Glasgow's many other public statues are situated around the square: the only known equestrian statues of a young Queen Victoria 1854 in St Vincent Place at Buchanan Street and moved to George Square in 1866 beside her husband Prince Albert 1866 both sculpted by Carlo Marochetti, erected in 1865 and 1866 respectively; poets Robert Burns sculpted by George Edwin Ewing, 1877, and Thomas Campbell sculpted by William Bodie, 1877; inventor James Watt sculpted by Francis Leggatt Chantrey, 1832; chemist Thomas Graham sculpted by William Brodie, 1872; General Sir John Moore sculpted by John Flaxman, 1819, and Field Marshall Lord Clyde sculpted by John Henry Foley, 1868; and politicians William Ewart Gladstone sculpted by William Hamo Thornycroft, 1902, Robert Peel sculpted by John Mossman, 1859, and James Oswald sculpted by Carlo Marochetti., 1856 at Charing Cross and moved to George Square in 1875."]}]}}