{"wiki_id": "http://www.wikidata.org/entity/Q1365850", "itemLabel": "Paul Telfer", "itemDescription": "Scottish footballer (born 1971)", "wikipedia_url": "https://en.wikipedia.org/wiki/Paul_Telfer_(footballer)", "wikipedia_page": {"main": "Paul Norman Telfer (born 21 October 1971) is a Scottish football coach and former professional footballer.\nTelfer made over 300 league appearances in the Premier League for Coventry City and Southampton between 1995 and 2005. He previously played over 150 times for Luton Town. In 2005, he signed for Scottish Premier League side Celtic where he made 57 appearances in two seasons in his native country. He has since gone on to feature for AFC Bournemouth and Leeds United before finishing his career with non-league side Slough Town in 2009. He was capped once by Scotland in 2004, having previously been capped at U21 and B team level.\nIn 2011, he joined the coaching staff at Sutton United and also agreed to make a return to the playing side of the game. He has also had a spell with North American Soccer League team Indy Eleven as assistant coach.", "link_mentions": [{"page": "October 21", "response": ["*  1971   – Paul Telfer, Scottish footballer and coach"]}, {"page": "Paul Telfer", "response": ["Paul Telfer is the name of:", "* Paul Telfer (footballer) (born 1971), Scottish footballer", "* Paul Telfer (actor) (born 1979), Scottish actor"]}, {"page": "2005–06 in Scottish football", "response": ["*21 July 2005 – Paul Telfer from Southampton to Celtic, Undisclosed fee"]}, {"page": "2005–06 Celtic F.C. season", "response": ["| Paul Telfer", "| Paul Telfer ||  Southampton || £200,000"]}, {"page": "1992–93 in English football", "response": ["* Darren Salton, retired after being badly injured in a car crash in November. Had played 18 times in the league for Luton Town and was capped six times by the Scotland under-21 side. His teammate Paul Telfer was also in the car but suffered only minor injuries."]}, {"page": "Darren Salton", "response": ["Darren Salton joined Luton Town as a trainee in 1988, along with a friend from Edinburgh, Paul Telfer. Salton signed professionally in March 1989, and made his league debut at Elland Road against Leeds United on 29 February 1992 in the Football League First Division. However, Luton were relegated at the end of that season and were denied a place in the new FA Premier League."]}, {"page": "Eamonn Bannon", "response": ["His nephew, Paul Telfer, also played for Scotland."]}, {"page": "2003 FA Cup Final", "response": ["After the break, Southampton applied pressure and a poor clearance by Seaman invited a chance for Paul Telfer to shoot the ball from \"35 yards out\"; his pass found Ormerod, but was eventually intercepted by Luzhnyi. Minutes after, Beattie failed to take advantage from Oakley's cross, as the ball drifted wide. Arsenal regained possession and in the 52nd minute went close to doubling their lead. In Southampton's penalty box, Bergkamp turned and beat Ormerod before curling a shot which Niemi palmed off; it fell to the feet of Ljungberg, who shot the ball into the side-netting. Telfer misguided his header from a Southampton corner, before Niemi denied Henry again. In the 65th minute, Niemi injured himself, in an attempt to clear the ball and was replaced by substitute Paul Jones. Both clubs made substitutions in the final third of the game, with Wiltord coming on for Bergkamp and Tessem replacing Svensson. Ormerod's goal-bound effort was saved by Seaman with 10 minutes remaining of the match. In the fourth minute of injury time, Southampton earned themselves a corner. Beattie's on-target header was cleared off the line by Ashley Cole and out for another corner, which Pires kicked out in the final action of the game. In which Arsenal won their 10th FA Cup trophy.", "|RM ||33|| Paul Telfer || "]}, {"page": "Marvin Williams (footballer)", "response": ["Ahead of the 2012–13 season, Williams signed for Eastleigh, also of the Conference South, on an initial two-year contract. After making eleven appearances, scoring once in a 3–0 away win against Havant & Waterlooville, he was released from his Eastleigh contract in October 2012, and subsequently signed for Sutton United. Williams made his debut for Sutton in the club's 2–1 victory over Truro City on 27 October 2012, playing the first 75 minutes of the match before being replaced by Paul Telfer. He scored his first goal for Sutton on 1 January 2013, netting from a tight angle in the club's 2–0 away victory over Bromley. Having scored twice in his first five months at Sutton, Williams hit a rich vein of goalscoring form in April 2013 to end the 2012–13 season. This run included three separate braces in convincing victories against Farnborough, Hayes & Yeading United and Bath City respectively and meant that Williams ended the season with nine goals in seven matches, with Sutton narrowly missing out on a play-off place despite winning their last eight league games. In his opening season with the club, he scored 11 times in 30 matches. The following season, Williams was limited to 16 appearances due to injury, scoring once."]}, {"page": "List of Leeds United F.C. players", "response": ["|2008||2009||Frazer Richardson||Paul Telfer Richard Naylor ||"]}, {"page": "Telfer", "response": ["*Paul Telfer (actor) (born 1979), Scottish actor", "*Paul Telfer (footballer) (born 1971), Scottish footballer"]}, {"page": "2006 Scottish League Cup Final", "response": ["|RB ||2 || Paul Telfer "]}, {"page": "List of Coventry City F.C. international footballers", "response": ["|Paul Telfer"]}, {"page": "List of Southampton F.C. seasons", "response": ["|James BeattiePaul Telfer"]}, {"page": "History of Luton Town F.C. (1970–present)", "response": ["With Luton's spell in the top flight finally over, it was always going to be difficult to keep hold of prize assets. So it proved when Mick Harford signed for Chelsea for £300,000. The first season in the new, three-division Football League almost saw Luton drop into the third tier of English football. The team was not helped by the involvement of Scottish duo Paul Telfer and Darren Salton in a motor accident early on in the season – under-21 international defender Salton was nearly killed, and never played again. Luton were bottom of the table shortly into the New Year, and Pleat reacted by procuring a loan deal to bring Luton-born England international Kerry Dixon to the club on loan from Southampton. Dixon gelled well alongside Phil Gray up front, and Luton stayed up."]}, {"page": "1991–92 Luton Town F.C. season", "response": ["|align=\"left\"|MF||align=\"left\"| Paul Telfer"]}, {"page": "2002–03 Southampton F.C. season", "response": ["|align=\"left\"| Paul Telfer"]}, {"page": "2004–05 Southampton F.C. season", "response": ["|align=\"left\"|33||align=\"left\"|MF||align=\"left\"| Paul Telfer"]}, {"page": "List of Coventry City F.C. seasons", "response": ["|align=left| Darren Huckerby Eoin Jess Paul Telfer Noel Whelan", "|align=left| Kevin Richardson Paul Telfer", "|align=left| Gary McAllister Steve Ogrizovic Kevin Richardson Paul Telfer Noel Whelan"]}, {"page": "2001–02 Southampton F.C. season", "response": ["| Paul Telfer"]}]}}