{"wiki_id": "http://www.wikidata.org/entity/Q1364488", "itemLabel": "Randolph Caldecott", "itemDescription": "British artist and illustrator (1846-1886)", "wikipedia_url": "https://en.wikipedia.org/wiki/Randolph_Caldecott", "wikipedia_page": {"main": "Randolph Caldecott (; 22 March 1846 – 12 February 1886) was a British artist and illustrator, born in Chester. The Caldecott Medal was named in his honour. He exercised his art chiefly in book illustrations. His abilities as an artist were promptly and generously recognised by the Royal Academy. Caldecott greatly influenced illustration of children's books during the nineteenth century. Two books illustrated by him, priced at a shilling each, were published every Christmas for eight years.\nCaldecott also illustrated novels and accounts of foreign travel, made humorous drawings depicting hunting and fashionable life, drew cartoons and he made sketches of the Houses of Parliament inside and out, and exhibited sculptures and paintings in oil and watercolour in the Royal Academy and galleries.\n\n", "link_mentions": [{"page": "Beatrix Potter", "response": ["Potter's artistic and literary interests were deeply influenced by fairy tales and fantasy. She was a student of the classic fairy tales of Western Europe. As well as stories from the Old Testament, John Bunyan's The Pilgrim's Progress and Harriet Beecher Stowe's Uncle Tom's Cabin, she grew up with Aesop's Fables, the fairy tales of the Brothers Grimm and Hans Christian Andersen, Charles Kingsley's The Water Babies,Lear 2007, pp. 30–1 the folk tales and mythology of Scotland, the German Romantics, Shakespeare,Lear 2007, p. 95. She liked to memorise his plays by heart. and the romances of Sir Walter Scott.Lear 2007, p. 35. Beatrix said she learnt to read \"on\" Scott As a young child, before the age of eight, Edward Lear's A Book of Nonsense, including the much loved The Owl and the Pussycat, and Lewis Carroll's Alice in Wonderland had made their impression, although she later said of Alice that she was more interested in Tenniel's illustrations than what they were about.Lear 2007, p. 34 The Brer Rabbit stories of Joel Chandler Harris had been family favourites, and she later studied his Uncle Remus stories and illustrated them.Lear 2007, p.131. She began eight Uncle Remus drawings in the same year 1893 she began writing the Peter Rabbit picture letters to Noel Moore, completing the last in 1896. She studied book illustration from a young age and developed her own tastes, but the work of the picture book triumvirate Walter Crane, Kate Greenaway and Randolph Caldecott, the last an illustrator whose work was later collected by her father, was a great influence.Lear 2007, p. 33 When she started to illustrate, she chose first the traditional rhymes and stories, \"Cinderella\", \"Sleeping Beauty\", \"Ali Baba and the Forty Thieves\", \"Puss-in-boots\", and \"Red Riding Hood\".Lear 2007, pp. 127–8 However, most often her illustrations were fantasies featuring her own pets: mice, rabbits, kittens, and guinea pigs.Taylor, et al., The Artist and her World, pp. 49–70;  Potter, Journal, 1884–1897; Humphrey Carpenter (1985), Secret Gardens: The Golden Age of Children's Literature."]}, {"page": "February 12", "response": ["*1886 – Randolph Caldecott, English-American painter and illustrator (b. 1846)"]}, {"page": "March 22", "response": ["*1846 – Randolph Caldecott, English illustrator and painter (d. 1886)"]}, {"page": "Nursery rhyme", "response": ["The early years of the 20th century are notable for the illustrations to children's books including Randolph Caldecott's Hey Diddle Diddle Picture Book (1909) and Arthur Rackham's Mother Goose (1913). The definitive study of English rhymes remains the work of Iona and Peter Opie."]}, {"page": "Children's literature", "response": ["Rudyard Kipling published The Jungle Book in 1894. A major theme in the book is abandonment followed by fostering, as in the life of Mowgli, echoing Kipling's own childhood. In the latter years of the 19th century, precursors of the modern picture book were illustrated books of poems and short stories produced by English illustrators Randolph Caldecott, Walter Crane, and Kate Greenaway. These had a larger proportion of pictures to words than earlier books, and many of their pictures were in colour. Some British artists made their living illustrating novels and children's books, among them Arthur Rackham, Cicely Mary Barker, W. Heath Robinson, Henry J. Ford, John Leech, and George Cruikshank. In the 1890s, some of the best known fairy tales from England were compiled in Joseph Jacobs' English Fairy Tales, including Jack and the Beanstalk, Goldilocks and the Three Bears, The Three Little Pigs, Jack the Giant Killer and Tom Thumb.", "Another method of creating illustrations for children's books was etching, used by George Cruikshank in the 1850s. By the 1860s, top artists were illustrating for children, including Crane, Randolph Caldecott, Kate Greenaway, and John Tenniel. Most pictures were still black-and-white, and many color pictures were hand colored, often by children. The Essential Guide to Children's Books and Their Creators credits Caldecott with \"The concept of extending the meaning of text beyond literal visualization\"."]}, {"page": "Paul Gauguin", "response": ["That summer, he executed some pastel drawings of nude figures in the manner of Pissarro and those by Degas exhibited at the 1886 eighth Impressionist exhibition. He mainly painted landscapes such as La Bergère Bretonne (\"The Breton Shepherdess\"), in which the figure plays a subordinate role. His Jeunes Bretons au bain (\"Young Breton Boys Bathing\"), introducing a theme he returned to each time he visited Pont-Aven, is clearly indebted to Degas in its design and bold use of pure color. The naive drawings of the English illustrator Randolph Caldecott, used to illustrate a popular guide-book on Brittany, had caught the imagination of the avant-garde student artists at Pont-Aven, anxious to free themselves from the conservatism of their academies, and Gauguin consciously imitated them in his sketches of Breton girls.Blackburn (1880) These sketches were later worked up into paintings back in his Paris studio. The most important of these is Four Breton Women, which shows a marked departure from his earlier Impressionist style as well as incorporating something of the naive quality of Caldecott's illustration, exaggerating features to the point of caricature."]}, {"page": "Cicely Mary Barker", "response": ["Barker was born the second daughter and youngest child of Walter Barker, a partner in a seed supply company and an amateur artist, and his wife Mary Eleanor (Oswald) Barker on 28 June 1895 at home at 66 Waddon Road in Croydon, Surrey, England. Barker was an epileptic as a child and cared for at home by her parents. Later, her sister and elder by two years, Dorothy Oswald Barker, continued the care. Her middle-class family of four was moderately prosperous. A nanny, a governess, and a cook to prepare special meals for Barker were hired. She spent much time in bed at home amusing herself with painting books and a nursery library that included the works of Kate Greenaway and Randolph Caldecott – two artists who exerted strong influences on her later art."]}, {"page": "Bloomsbury", "response": ["*Randolph Caldecott (1846–1886), illustrator, lived at 46 Great Russell Street."]}, {"page": "Chester", "response": ["* Randolph Caldecott (1846–86), artist and book illustrator, was born in Bridge Street, Chester"]}, {"page": "Distributed Proofreaders", "response": ["| History of the World War for Human Rights, Kelly Miller; Poems, Christina Rossetti; Hey Diddle Diddle and Baby Bunting, Randolph Caldecott", "* R. Caldecott's First Collection of Pictures and Songs by Randolph Caldecott [Illustrator] (English)"]}, {"page": "Woodcut", "response": ["A number of different methods of colour printing using woodcut (technically Chromoxylography) were developed in Europe in the 19th century. In 1835, George Baxter patented a method using an intaglio line plate (or occasionally a lithograph), printed in black or a dark colour, and then overprinted with up to twenty different colours from woodblocks. Edmund Evans used relief and wood throughout, with up to eleven different colours, and latterly specialized in illustrations for children's books, using fewer blocks but overprinting non-solid areas of colour to achieve blended colours. Artists such as Randolph Caldecott, Walter Crane and Kate Greenaway were influenced by the Japanese prints now available and fashionable in Europe to create a suitable style, with flat areas of colour."]}, {"page": "Kate Greenaway", "response": ["Greenaway's paintings were reproduced by chromoxylography, by which the colours were printed from hand-engraved wood blocks by the firm of Edmund Evans.Color Printing in the 19th century. University of Delaware.Retrieved September 18, 2017 Through the 1880s and 1890s, her only rivals in popularity in children's book illustration were Walter Crane and Randolph Caldecott."]}, {"page": "Picture book", "response": ["Toy books were introduced in the latter half of the 19th century, small paper bound books with art dominating the text. These had a larger proportion of pictures to words than earlier books, and many of their pictures were in color. The best of these were illustrated by the triumvirate of English illustrators Randolph Caldecott, Walter Crane, and Kate Greenaway whose association with colour printer and wood engraver Edmund Evans produced books of great quality.Hunt, p. 674 In the late 19th and early 20th century a small number of American and British artists made their living illustrating children's books, like Rose O'Neill, Arthur Rackham, Cicely Mary Barker, Willy Pogany, Edmund Dulac, W. Heath Robinson, Howard Pyle, or Charles Robinson. Generally, these illustrated books had eight to twelve pages of illustrated pictures or plates accompanying a classic children's storybook."]}, {"page": "Caldecott Medal", "response": ["The Randolph Caldecott Medal, frequently shortened to just the Caldecott, annually recognizes the preceding year's \"most distinguished American picture book for children\". It is awarded to the illustrator by the Association for Library Service to Children (ALSC), a division of the American Library Association (ALA). The Caldecott and Newbery Medals are considered the most prestigious American children's book awards. Beside the Caldecott Medal, the committee awards a variable number of citations to runners-up they deem worthy, called the Caldecott Honor or Caldecott Honor Books.", "The Caldecott Medal was first proposed by Frederic G. Melcher, in 1937. The award was named after English illustrator Randolph Caldecott. Unchanged since its founding, the medal, which is given to every winner, features two of Caldecott's illustrations. The awarding process has changed several times over the years, including in 1971 which began use of the term \"Honor\" for the runner-ups. There have between one and five honor books named each year.", "The award is named for Randolph Caldecott, a nineteenth-century English illustrator. Rene Paul Chambellan designed the Medal in 1937. The obverse scene is derived from Randolph Caldecott's front cover illustration for The Diverting History of John Gilpin (Routledge, 1878, an edition of the 1782 poem by William Cowper), which depicts Gilpin astride a runaway horse. The reverse is based on \"Four and twenty blackbirds baked in a pie\", one of Caldecott's illustrations for the nursery rhyme \"Sing a Song of Sixpence\". Each illustrator receives a bronze copy of the medal, which, despite being awarded by the Association for Library Service to Children (ALSC), lists Children's Librarian's Section, the original awarding group, for historical reasons."]}, {"page": "1878 in literature", "response": ["*Randolph Caldecott – The House that Jack Built"]}, {"page": "Henry Austin Dobson", "response": ["Dobson, who had already made successful use of the triolet, was at the head of this movement, and in May 1876 he published in The Prodigals the first original ballade written in English. This he followed by English versions of the rondel, rondeau and villanelle. An article in The Cornhill Magazine by Edmund Gosse, \"A Plea for Certain Exotic Forms of Verse\", appearing in July 1877, simultaneously with Dobson's second volume, Proverbs in Porcelain, drew the general eye to the possibilities and achievements of the movement. The experiment was deemed a success. In 1883 Dobson published Old-World Idylls, which contained some of his most characteristic work. By this time his taste was gradually settling on the period with which it has since become almost exclusively associated; and the spirit of the 18th century was revived in \"The Ballad of Beau Brocade\" and in \"The Story of Rosina\", as nowhere else in modern English poetry. In \"Beau Brocade\", the pictorial quality of his work is at its very best. He has been compared with Randolph Caldecott, with which it has much in common; but Dobson's humour was not so \"rollicking\" and his portraiture not so broad as that of the illustrator of John Gilpin. His appeal was more intellectual."]}, {"page": "Culture of the United Kingdom", "response": ["Randolph Caldecott, Walter Crane, Kate Greenaway, John Tenniel, Aubrey Beardsley, Roger Hargreaves, Arthur Rackham, John Leech, George Cruikshank and Beatrix Potter were notable book illustrators. Posters have played a significant role in British culture. Designed by Alfred Leete in 1914 as a recruitment poster for the British Army, \"Lord Kitchener Wants You\" is the most famous British recruitment poster ever produced and an iconic and enduring image of World War I. Retrieved 31 March 2011 Produced by the British government in 1939 for World War II, the Keep Calm and Carry On motivational poster is now seen as \"not only as a distillation of a crucial moment in Britishness, but also as an inspiring message from the past to the present in a time of crisis\"."]}, {"page": "British literature", "response": ["Literature for children developed as a separate genre during the Victorian era, and some works became internationally known, such as Lewis Carroll, Alice's Adventures in Wonderland (1865). At the end of nineteenth-century, the author and illustrator Beatrix Potter was known for her children's books, which featured animal characters, including The Tale of Peter Rabbit (1902). In the latter years of the 19th century, precursors of the modern picture book were illustrated books of poems and short stories produced by illustrators Randolph Caldecott, Walter Crane, and Kate Greenaway. These had a larger proportion of pictures to words than earlier books, and many of their pictures were in colour. Vice Versa (1882) by F. Anstey, sees a father and son exchange bodies — body swaps have been a popular theme in various media since the book was published."]}, {"page": "Whitchurch, Shropshire", "response": ["Whitchurch is a market town in the north of Shropshire, England. It lies  east of the Welsh border, 2 miles south of the Cheshire border,  north of the county town of Shrewsbury,  south of Chester, and  east of Wrexham. At the 2011 Census, the population of the town was 9,781. Whitchurch is the oldest continuously inhabited town in Shropshire. Notable people who have lived in Whitchurch include the composer Sir Edward German, and illustrator Randolph Caldecott.", "* Randolph Caldecott (1846–1886), illustrator, lived in the town, the town's buildings feature in his work."]}, {"page": "Caldecott", "response": ["* The Caldecott Medal, an award for children's book illustration named after Randolph Caldecott"]}, {"page": "Walter Crane", "response": ["Walter Crane (15 August 184514 March 1915) was a British artist and book illustrator. He is considered to be the most influential, and among the most prolific, children's book creators of his generation and, along with Randolph Caldecott and Kate Greenaway, one of the strongest contributors to the child's nursery motif that the genre of English children's illustrated literature would exhibit in its developmental stages in the later 19th century."]}, {"page": "Color printing", "response": ["In the 19th century a number of different methods of color printing, using woodcut (technically Chromoxylography) and other methods, were developed in Europe, which for the first time achieved widespread commercial success, so that by the later decades the average home might contain many examples, both hanging as prints and as book illustrations. George Baxter patented in 1835 a method using an intaglio line plate (or occasionally a lithograph), printed in black or a dark color, and then overprinted with up to twenty different colors from woodblocks. Edmund Evans used relief and wood throughout, with up to eleven different colors, and latterly specialized in illustrations for children's books, using fewer blocks but overprinting non-solid areas of color to achieve blended colors. English Artists such as Randolph Caldecott, Walter Crane and Kate Greenaway were influenced by the Japanese prints now available and fashionable in Europe to create a suitable style, with flat areas of color."]}, {"page": "Frederick Locker-Lampson", "response": ["Chronic ill-health debarred Locker from any active part in life, but it did not prevent his delighting a wide circle of friends by his gifts as a host and raconteur, and from accumulating many treasures as a connoisseur. He was acquainted with practically all the major literary figures of the age, including Matthew Arnold, the Brownings, Carlyle, Dickens, George Eliot, Leigh Hunt, Ruskin, Tennyson, Thackeray and Trollope. He was also a mentor to the illustrator artists Randolph Caldecott and Kate Greenaway."]}, {"page": "Juliana Horatia Ewing", "response": ["A talented artist herself, Ewing's works were frequently illustrated by such notable figures as George Cruikshank and Randolph Caldecott. She was also the editor of a number of magazines which published short stories for children, such as the Nursery Magazine from 1856 onwards, the Monthly Packet, and the monthly Aunt Judy's Magazine from 1866."]}]}}