{"wiki_id": "http://www.wikidata.org/entity/Q1365387", "itemLabel": "Stuart Freeborn", "itemDescription": "make-up artist", "wikipedia_url": "https://en.wikipedia.org/wiki/Stuart_Freeborn", "wikipedia_page": {"main": "Stuart Freeborn (5 September 1914 – 5 February 2013) was a British motion picture make-up artist. He has been referred to as the \"grandfather of modern make-up design\" and is perhaps best known for his work on the original Star Wars trilogy, most notably the design and fabrication of Yoda.", "link_mentions": [{"page": "Jim Henson", "response": ["Henson also aided others in their work. The producers of The Empire Strikes Back (1980) asked him to aid make-up artist Stuart Freeborn in the creation and articulation of Yoda. He suggested that George Lucas use Frank Oz as the puppeteer and voice of Yoda, and Oz did so in it and the five subsequent Star Wars films. Lucas lobbied unsuccessfully to have Oz nominated for an Academy Award for Best Supporting Actor."]}, {"page": "Patterson–Gimlin film", "response": ["Bill Munns, retired, was a special effects and make-up artist,Munns, passim cameraman, and film editor.Munns, 54–55 He argues that Universal and Disney were not the most knowledgeable studios to consult with. He says that Fox, MGM, and special effects artist Stuart Freeborn in England, \"who had just completed his groundbreaking ape suits for 2001: A Space Odyssey\", would have been preferable.Munns, 16–20"]}, {"page": "September 5", "response": ["*1914 – Stuart Freeborn, English make up artist (d. 2013)"]}, {"page": "Return of the Jedi", "response": ["At the 56th Academy Awards in 1984, Richard Edlund, Dennis Muren, Ken Ralston, and Phil Tippett received the \"Special Achievement Award for Visual Effects.\" Norman Reynolds, Fred Hole, James L. Schoppe, and Michael Ford were nominated for \"Best Art Direction/Set Decoration\". Ben Burtt received a nomination for \"Best Sound Effects Editing\". John Williams received the nomination for \"Best Music, Original Score\". Burtt, Gary Summers, Randy Thom and Tony Dawe all received the nominations for \"Best Sound\". At the 1984 BAFTA Awards, Edlund, Muren, Ralston, and Kit West won for \"Best Special Visual Effects\". Tippett and Stuart Freeborn were also nominated for \"Best Makeup\". Reynolds received a nomination for \"Best Production Design/Art Direction\". Burtt, Dawe, and Summers also received nominations for \"Best Sound\". Williams was also nominated \"Best Album of Original Score Written for a Motion Picture or Television Special\". The film also won for \"Best Dramatic Presentation\", the older award for science fiction and fantasy in film, at the 1984 Hugo Awards.", "| Stuart Freeborn", "| Stuart Freeborn"]}, {"page": "Star Wars: Episode I – The Phantom Menace", "response": ["* Frank Oz as the voice of Yoda, the centuries-old Jedi Grandmaster and head of the Jedi Council who is apprehensive about allowing Anakin to be trained. Yoda was mostly portrayed as a puppet designed by Nick Dudman based on Stuart Freeborn's original design. Oz controlled the puppet's mouth, and other parts were controlled by puppeteers using remote controls. Lucas fitted Yoda's filming around Oz's schedule as he finished and promoted In & Out. A computer-generated Yoda is featured in two distant shots. Warwick Davis (who played the part of the Ewok Wicket W. Warrick in Return of the Jedi in 1983) portrays him in the scene where Obi-Wan becomes a Jedi Knight. Lucas said he originally wanted to use a full-time digital Yoda, but the attempts did not work well enough at the time. Beginning with the 2011 Blu-ray release of The Phantom Menace, which was also used for the 3D reissue, a CG Yoda replaced the puppet entirely."]}, {"page": "Star Wars (film)", "response": ["The film also received twelve nominations at the Saturn Awards, winning nine: Best Science Fiction Film, Best Direction and Best Writing for George Lucas, Best Supporting Actor for Alec Guinness, Best Music for John Williams, Best Costume for John Mollo, Best Make-up for Rick Baker and Stuart Freeborn, Best Special Effects for John Dykstra and John Stears, and Outstanding Editing for Paul Hirsch, Marcia Lucas and Richard Chew.", "| Rick Baker and Stuart Freeborn"]}, {"page": "The Empire Strikes Back", "response": ["Lucas considered replacing producer Gary Kurtz with Howard Kazanjian because of issues that arose while filming Star Wars in which Kurtz had not fulfilled his role and left problems unresolved. Kurtz convinced him otherwise by trading on his long-time loyalty to Lucas and his existing knowledge of the Star Wars property. Lucas took an executive producer role, enabling him to focus on his businesses and the development of Raiders of the Lost Ark (1981). By late 1977, Kurtz began hiring key crew members including production designer Norman Reynolds, consultant John Barry, makeup artist Stuart Freeborn, and first assistant director David Tomblin. Lucas re-hired artists Ralph McQuarrie and Joe Johnston to maintain visual consistency with Star Wars, and the three began conceptualizing the Hoth battle in December. By this point, the budget had increased to $10million. Lucas wanted a director who would support the material and accept that he was ultimately in charge. Lucas considered around 100 directors, including Alan Parker and John Badham, before hiring his old acquaintance Irvin Kershner in February 1978. Kershner was reluctant to direct the sequel to a film as successful as Star Wars, and his friends warned him against taking the job believing he would be blamed if it failed. Lucas convinced Kershner it was not so much a sequel but rather a chapter in a larger story; he also promised him he could make the film his own way.", "The crew, supervised by Richard Edlund and Brian Johnson, included Dennis Muren, Bruce Nicholson, Lorne Peterson, Steve Gawley, Phil Tippett, Tom St. Amand, and Nilo Rodis-Jamero. Up to 100 people worked on the project daily, including Stuart Freeborn, who was responsible mainly for crafting the Yoda puppet. Various techniques, including miniatures, matte paintings, stop motion, articulated models and full-size vehicles were used to create Empires various effects."]}, {"page": "Yoda", "response": ["According to the make-up artist Stuart Freeborn, Yoda's face is based on his own and Albert Einstein's (particularly the eye wrinkles of the latter).Empire of Dreams: The Story of the Star Wars Trilogy (2004). 20th Century Fox Television. Event occurs at 1 hour and 40 minutes. For The Phantom Menace, he was redesigned to look younger. He was created using computer-generated imagery (CGI) for two distant shots in the 1999 release but remained mostly a puppet, with Stuart Freeborn's original design reinterpreted by Nick Dudman."]}, {"page": "Leytonstone", "response": ["*Stuart Freeborn (1914–2013), Star Wars make-up artist who was most famous as the designer of Yoda; born in Grove Green Road, had a Blue Heritage Plaque placed on his former home in December 2015."]}, {"page": "Superman (1978 film)", "response": ["Principal photography began on March 28, 1977 at Pinewood Studios for Krypton scenes, budgeted as the most expensive film ever made at that point. Since Superman was being shot simultaneously with Superman II, filming lasted nineteen months, until October 1978. Filming was originally scheduled to last between seven and eight months, but problems arose during production. John Barry served as production designer, while Stuart Craig and Norman Reynolds worked as art directors. Derek Meddings and Les Bowie were credited as visual effects supervisors. Stuart Freeborn was the make-up artist, while Barry, David Tomblin, John Glen, David Lane, Robert Lynn and an uncredited Peter Duffell and André de Toth directed second unit scenes. Vic Armstrong was hired as the stunt coordinator and Reeve's stunt double; his wife Wendy Leech was Kidder's double. Superman was also the final complete film by cinematographer Geoffrey Unsworth, who died during post-production while working on Tess for director Roman Polanski. The Fortress of Solitude was constructed at Shepperton Studios and at Pinewood's 007 Stage.Making Superman: Filming The Legend, 2001, Warner Home Video Upon viewing the footage of Krypton, Warner Bros. decided to distribute in not only North America, but also in foreign countries. Due to complications and problems during filming, Warner Bros. also supplied $20 million and acquired television rights."]}, {"page": "Saturn Award for Best Make-up", "response": ["|style=\"background:#ddddff\"|Rick Baker and Stuart Freeborn", "|style=\"background:#ddddff\"|Phil Tippett and Stuart Freeborn"]}, {"page": "Oliver Twist (1948 film)", "response": ["Although critically acclaimed, Alec Guinness's portrayal of Fagin and his make-up was considered anti-semitic by some as it was felt to perpetuate Jewish racial stereotypes. Guinness wore heavy make-up, including a large prosthetic nose, to make him look like the character as he appeared in George Cruikshank's illustrations in the first edition of the novel. At the start of production, the Production Code Administration had advised David Lean to \"bear in mind the advisability of omitting from the portrayal of Fagin any elements or inference that would be offensive to any specific racial group or religion.\" Lean commissioned the make-up artist Stuart Freeborn to create Fagin's features; Freeborn (himself part-Jewish) had suggested to David Lean that Fagin's exaggerated profile should be toned down for fear of causing offence, but Lean rejected this idea. In a screen test featuring Guinness in toned-down make-up, Fagin was said to resemble Jesus Christ. On this basis, Lean decided to continue filming with a faithful reproduction of Cruikshank's Fagin, pointing out that Fagin was not explicitly identified as Jewish in the screenplay."]}, {"page": "Bib Fortuna", "response": ["The role of Bib Fortuna was cast very early in the production process for Return of the Jedi because makeup artist Stuart Freeborn wanted to get started on creating the character's look as quickly as possible. Michael Carter came to the attention of Return of the Jedi casting director Mary Selway saw him perform in a musical in the West End theatre section of London in the early 1980s. Director Richard Marquand had also seen and enjoyed Carter's theater work, and wanted to cast him as Fortuna; Marquand described him as a \"terrific actor\". He was also drawn to Carter for the role because he wanted Fortuna to be very tall, and Carter was about six feet tall."]}, {"page": "Sarlacc", "response": ["Special effects artists Stuart Freeborn, Phil Tippett, and the crew of Industrial Light & Magic (ILM) constructed a pit in the desert sands of Yuma, Arizona, that contained a gaping mouth with jagged teeth and tentacles. At the time, the pit (with Jabba the Hutt's sail barge) constituted one of the largest motion picture sets ever constructed.From Star Wars to Jedi: The Making of a Saga, narrated by Mark Hamill (1985; VHS, CBS Fox Video, 1992). A hydraulic system was designed to animate the creature, but the blowing sand clogged the mechanism. The film crew instead used poles and wires to move the creature's tentacles. Lucas was not satisfied with the effect, complaining, \"There was nothing alive about the whole thing.\"George Lucas, commentary, Star Wars Episode VI: Return of the Jedi Special Edition (VHS, 20th Century Fox, 1997)."]}, {"page": "Empire of Dreams: The Story of the Star Wars Trilogy", "response": ["*Stuart Freeborn (makeup and special creature design)"]}, {"page": "Wendy Froud", "response": ["While working closely with Jim Henson and Frank Oz on various projects at the Henson Studios, Froud was asked by the pair to join the team responsible for developing and building the character Yoda for the 1980 Star Wars film The Empire Strikes Back. Her contribution included sculpting the prototype puppet for Yoda. Nick Maley, who worked on Yoda with Froud under Stuart Freeborn, recalled that \"Wendy’s contribution creating the character was second only to Stuart who was overseeing ALL the creatures. She single handedly formed the body out of 1 inch sheet foam. She constructed the puppet armature from wooden dowel which gave structure to Yoda’s arms and legs. If I remember correctly, she modeled Yoda’s hands and feet and single handedly fabricated the “stand-in Yoda”, made entirely from cut foam, which was used to line up shots during camera setup. I do remember her spending some time working on the clay model of Yoda's head too.\" Froud later became referred to as \"the mother of Yoda\". She also assisted in Yoda's puppeteering, controlling the puppet's pointy ears."]}, {"page": "Alice's Adventures in Wonderland (1972 film)", "response": ["In 1973, the film won the BAFTA Film Award at the BAFTA Awards Ceremony for Best Cinematography, won by Geoffrey Unsworth, and Best Costume Design, won by Anthony Mendleson. Stuart Freeborn created make-up for the film based closely on the original John Tenniel drawings in the first edition of the novel."]}, {"page": "Fagin", "response": ["Numerous prominent actors have played the character of Fagin. Lon Chaney portrayed Fagin in a silent film version Oliver Twist (1922 film). Alec Guinness portrayed Fagin in David Lean's 1948 film adaptation of Oliver Twist, with controversial make-up by Stuart Freeborn which exaggerated stereotypical Jewish facial features. The release of the film in the USA was delayed for three years on charges of being antisemitic by the Anti-Defamation League of B'nai B'rith and the New York Board of Rabbis. It was finally released in the United States in 1951, with seven minutes of profile shots and other parts of Guinness' performance cut."]}, {"page": "List of celebrity inventors", "response": ["**  — Toy figure (co-inventor, with Stuart Freeborn, McQuarrie). The ornamental design for a toy figure."]}, {"page": "1914 in the United Kingdom", "response": ["* 5 September – Stuart Freeborn, make-up artist (died 2013)"]}, {"page": "John Mollo", "response": ["Mollo subsequently moved into costume design. For his first film, Mollo unexpectedly found himself working not on a historical military drama but in a genre he had no knowledge of: science fiction. He was commissioned in 1975 by a young filmmaker named George Lucas to devise uniforms and outfits for a fantasy space war film, Star Wars. When asked at the time by a friend about the project, Mollo said that he thought it was a \"sort of a space western and one of the heroes is a dustbin\". Lucas's project envisioned a cast of heroes battling an evil Galactic Empire, and he briefed Mollo to design costumes that would not resemble the stereotypical \"spacey\" look of earlier science fiction productions such as Flash Gordon — \" I don't want the audience to notice any of the costumes. I just want to see light versus dark.\" The aim was to make Lucas's fantasy universe appear authentic – Mollo considered that his total ignorance of science fiction was advantageous in achieving this. Lucas provided Mollo with sketches and concept art by Ralph McQuarrie to work from, working McQuarrie's designs for Imperial stormtroopers and the malevolent character of Darth Vader into functional costumes for actors to wear. McQuarrie's image of Darth Vader had developed from Samurai armour, and Mollo built up a costume using a combination of clerical robes, a motorcycle suit, a German military helmet and a gas mask from Bermans and Nathans costumiers in Camden Town. Mollo intentionally designed the uniforms of Imperial officers to resemble German Nazi officers' uniforms; by contrast, the heroes of the film were dressed in costumes resembling Wild West outfits. One of Mollo's biggest challenges on Star Wars was to create a plethora of exotic aliens to feature in the Mos Eisley Cantina scene. Mollo worked with George Lucas to compile a chart of visual designs for a range of character types. He collaborated with make-up artist Stuart Freeborn, who designed the masks and prosthetics to match each of the costumes, along with Doug Beswick, Rick Baker and Phil Tippett."]}, {"page": "2013 in film", "response": ["| style=\"text-align:center;\"| 5 || Stuart Freeborn || style=\"text-align:center;\"| 98 || style=\"text-align:center;\"| English || style=\"text-align:center;\"| Make-Up Artist || "]}, {"page": "37th British Academy Film Awards", "response": ["* Return of the Jedi – Phil Tippett and Stuart Freeborn"]}, {"page": "Ewok", "response": ["As Wookiees were tall, Lucas wanted the new species short.George Lucas, commentary track on the Return of the Jedi DVD. Using the image of the Griffon Bruxellois, a dog breed which Lucas owned, the Ewok was developed by renowned make-up artist Stuart Freeborn.\"Star Wars Make-Up Artist Stuart Freeborn Dies\". Sky News. Retrieved February 8, 2013\"Makeup master Stuart Freeborn of 'Star Wars' dead at age 98\". CNN. Retrieved February 8, 2013 As presented in the films, Ewoks appear as stocky, sapient bipeds which stand about one metre tall. They have flat faces, are completely covered in fur, and have large jewel-like eyes. Both their fur and their eyes come in a variety of earth tones, primarily brown, white, grey, gold, and black. Only the costume of the Ewok portrayed by Warwick Davis had moving facial features, though the 2012 Blu-ray release of Return of the Jedi added eye blinks to all of the Ewoks. Despite their small size, the critters are strong; in the climactic battle scene of the film, they are shown physically overpowering and once even throwing Imperial stormtroopers, though this detail is not consistent throughout the film. Ewoks live high among the trees of their home moon's forests, in villages built on platforms between the closely spaced trees."]}, {"page": "BAFTA Award for Best Makeup and Hair", "response": ["| Return of the Jedi || Phil Tippett and Stuart Freeborn"]}, {"page": "Toby Philpott", "response": ["It took about three weeks to film the Jabba's Palace scenes, and an additional week to film the Sail Barge scenes; Philpott and the puppeteers said they experienced few problems operating Jabba due to the effective design work of Phil Tippett, Stuart Freeborn and John Coppinger. Philpott's previous experience with The Dark Crystal helped prepare Philpott for the role of Jabba, although as a result, he later said he wasn't as \"overawed\" by the experience as he might have been. Nevertheless, he described the experience as \"great fun\" and said he enjoyed being the center of attention among the many other puppets and live actors in Jabba's Palace."]}, {"page": "Jabba the Hutt", "response": ["In Return of the Jedi, Jabba is portrayed by a one-ton puppet that took three months and half a million dollars to construct. While filming the movie, the puppet had its own makeup artist. The puppet required three puppeteers to operate, making it one of the largest ever used in a motion picture. Stuart Freeborn designed the puppet, while John Coppinger sculpted its latex, clay, and foam pieces. Puppeteers included David Alan Barclay, Toby Philpott, and Mike Edmonds, who were members of Jim Henson's Muppet group. Barclay operated the right arm and mouth and read the character's English dialogue, while Philpott controlled the left arm, head, and tongue. The tongue was a light beige color and came out of Jabba’s mouth several times. When he encountered Leia Organa for the first time and enslaved her, he extended his tongue and licked at her face. The reason Leia reacted with such disgust upon seeing the tongue, was because in one take, Philpott moved the tongue closer than Carrie Fisher was comfortable with, and it licked her unintentionally. Edmonds, the shortest of the three men (he also played the Ewok Logray in later scenes) was responsible for the movement of Jabba's tail. Tony Cox, who also played an Ewok, would assist as well. The eyes and facial expressions were operated by radio control."]}, {"page": "Chewbacca", "response": ["The original costume was created by Stuart Freeborn and his wife Kay Freeborn, who hand knitted the torso section. During preproduction of The Force Awakens, Creature Effects Supervisor Neal Scanlan commented that the original suit was far more sophisticated than they had originally realized, leading him to entirely scrap their first attempt at making the new suit, go back and study Freeborn's work in order to better appreciate how it worked, and attempt to emulate it."]}]}}