{"wiki_id": "http://www.wikidata.org/entity/Q1373357", "itemLabel": "G. M. Trevelyan", "itemDescription": "historian", "wikipedia_url": "https://en.wikipedia.org/wiki/G._M._Trevelyan", "wikipedia_page": {"main": "George Macaulay Trevelyan  (16 February 1876 – 21 July 1962) was a British historian and academic. He was a Fellow of Trinity College, Cambridge, from 1898 to 1903. He then spent more than twenty years as a full-time author. He returned to the University of Cambridge and was Regius Professor of History from 1927 to 1943. He served as Master of Trinity College from 1940 to 1951. In retirement, he was Chancellor of Durham University.\nTrevelyan was the third son of Sir George Otto Trevelyan, 2nd Baronet, and great-nephew of Thomas Babington Macaulay, whose staunch liberal Whig principles he espoused in accessible works of literate narrative avoiding a consciously dispassionate analysis, that became old-fashioned during his long and productive career. The noted historian E. H. Carr considered Trevelyan to be one of the last historians of the Whig tradition.Many of his writings promoted the Whig Party, an important aspect of British politics from the 17th century to the mid-19th century, and its successor, the Liberal Party. Whigs and Liberals believed the common people had a more positive effect on history than did royalty and that democratic government would bring about steady social progress.Trevelyan's history is engaged and partisan. Of his Garibaldi trilogy, \"reeking with bias\", he remarked in his essay \"Bias in History\", \"Without bias, I should never have written them at all. For I was moved to write them by a poetical sympathy with the passions of the Italian patriots of the period, which I retrospectively shared.\"", "link_mentions": [{"page": "February 16", "response": ["*1876 – G. M. Trevelyan, English historian and academic (d. 1962)"]}, {"page": "History of Europe", "response": ["The War of the Spanish Succession (1701–1715) was a major war with France opposed by a coalition of England, the Netherlands, the Habsburg Monarchy, and Prussia. Duke of Marlborough commanded the English and Dutch victory at the Battle of Blenheim in 1704. The main issue was whether France under King Louis XIV would take control of Spain's very extensive possessions and thereby become by far the dominant power, or be forced to share power with other major nations. After initial allied successes, the long war produced a military stalemate and ended with the Treaty of Utrecht, which was based on a balance of power in Europe. Historian Russell Weigley argues that the many wars almost never accomplished more than they cost.Russell Weigley,  The Age of Battles: The Quest for Decisive Warfare from Breitenfeld to Waterloo (1991). British historian G. M. Trevelyan argues:"]}, {"page": "Henry Fielding", "response": ["According to the historian G. M. Trevelyan, the Fieldings were two of the best magistrates in 18th-century London, who did much to enhance judicial reform and improve prison conditions. Fielding's influential pamphlets and enquiries included a proposal for abolishing public hangings. This did not, however, imply opposition to capital punishment as such – as is evident, for example, in his presiding in 1751 over the trial of the notorious criminal James Field, finding him guilty in a robbery and sentencing him to hang. John Fielding, despite being blind by then, succeeded his older brother as chief magistrate, becoming known as the \"Blind Beak of Bow Street\" for his ability to recognise criminals by their voices alone.."]}, {"page": "Jawaharlal Nehru", "response": ["Nehru became an ardent nationalist during his youth. The Second Boer War and the Russo-Japanese War intensified his feelings. Of the latter he wrote, \"[The] Japanese victories [had] stirred up my enthusiasm. ...Nationalistic ideas filled my mind. ... I mused of Indian freedom and Asiatic freedom from the thraldom of Europe.\" Later, in 1905, when he had begun his institutional schooling at Harrow, a leading school in England, G. M. Trevelyan's Garibaldi books, which he had received as prizes for academic merit, influenced him greatly. He viewed Garibaldi as a revolutionary hero. He wrote: \"Visions of similar deeds in India came before, of [my] gallant fight for [Indian] freedom and in my mind, India and Italy got strangely mixed together.\""]}, {"page": "History of the United Kingdom", "response": ["Meanwhile, the long War of the Spanish Succession against France (1701–1714) was underway. It see-sawed back and forth until a more peace-minded government came to power in London and the treaties of Utrecht and Rastadt in 1713–1714 ended the war. British historian G. M. Trevelyan argues: "]}, {"page": "Trinity College, Cambridge", "response": ["Members of Trinity have won 34 Nobel Prizes out of the 121 won by members of Cambridge University, the highest number of any college at either Oxford or Cambridge. Members of the college have won five Fields Medals, one Turing Award and one Abel Prize. Trinity alumni include the father of the scientific method (or empiricism) Francis Bacon, six British prime ministers (the highest of any Cambridge college), physicists Isaac Newton, James Clerk Maxwell, Ernest Rutherford and Niels Bohr, mathematicians Srinivasa Ramanujan and Charles Babbage, poets Lord Byron and Lord Tennyson, English jurist Edward Coke, writers Vladimir Nabokov and A. A. Milne, historians Lord Macaulay and G. M. Trevelyan and philosophers Ludwig Wittgenstein and Bertrand Russell (whom it expelled before reaccepting). "]}, {"page": "Victorian era", "response": ["Michael Sadleir was insistent that \"in truth, the Victorian period is three periods, and not one\".M Sadleir, Trollope (London 1945) p. 17 He distinguished early Victorianism – the socially and politically unsettled period from 1837 to 1850M Sadleir, Trollope (London 1945) p. 18-19 – and late Victorianism (from 1880 onwards), with its new waves of aestheticism and imperialism,M Sadleir, Trollope (London 1945) p. 13 and p. 32 from the Victorian heyday: mid-Victorianism, 1851 to 1879. He saw the latter period as characterized by a distinctive mixture of prosperity, domestic prudery, and complacencyM Sadleir, Trollope (London 1945) pp. 25–30 – what G. M. Trevelyan similarly called the \"mid-Victorian decades of quiet politics and roaring prosperity\".G M Trevelyan, History of England (London 1926) p. 650"]}, {"page": "1962", "response": ["* July 21 – G. M. Trevelyan, English historian (b. 1876)"]}, {"page": "1876", "response": ["** G. M. Trevelyan, British historian (d. 1962)"]}, {"page": "Reform Act 1832", "response": ["Many historians credit the Reform Act 1832 with launching modern democracy in the United Kingdom. G. M. Trevelyan hails 1832 as the watershed moment at which the sovereignty of the people' had been established in fact, if not in law\".Trevelyan (1922), p. 242. Sir Erskine May notes that the \"reformed Parliament was, unquestionably, more liberal and progressive in its policy than the Parliaments of old; more vigorous and active; more susceptible to the influence of public opinion; and more secure in the confidence of the people\", but admitted that \"grave defects still remained to be considered\".May (1896), vol. I, p. 431. Other historians have argued that genuine democracy began to arise only with the Second Reform Act in 1867, or perhaps even later. Norman Gash states that \"it would be wrong to assume that the political scene in the succeeding generation differed essentially from that of the preceding one\".Gash (1952), p. xii."]}, {"page": "Andrew Marvell", "response": ["Marvell's pamphlet An Account of the Growth of Popery and Arbitrary Government in England, published in late 1677, alleged that: \"There has now for diverse Years, a design been carried on, to change the Lawfull Government of England into an Absolute Tyranny, and to convert the established Protestant Religion into down-right Popery\".Andrew Marvell, An Account of the Growth of Popery and Arbitrary Government in England (Gregg International Publishers Limited, 1971), p. 3. John Kenyon described it as \"one of the most influential pamphlets of the decade\"John Kenyon, The Popish Plot (Phoenix, 2000), p. 24. and G. M. Trevelyan called it: \"A fine pamphlet, which throws light on causes provocative of the formation of the Whig party\".G. M. Trevelyan, England under the Stuarts (Routledge, 2002), p. 513."]}, {"page": "Peasants' Revolt", "response": ["At the end of the 19th century there was a surge in historical interest in the Peasants' Revolt, spurred by the contemporary growth of the labour and socialist movements. Work by Charles Oman, Edgar Powell, André Réville and G. M. Trevelyan established the course of the revolt.; ; ; ;  By 1907 the accounts of the chroniclers were all widely available in print and the main public records concerning the events had been identified. Réville began to use the legal indictments that had been used against suspected rebels after the revolt as a fresh source of historical information, and over the next century extensive research was carried out into the local economic and social history of the revolt, using scattered local sources across south-east England.; "]}, {"page": "The Spectator", "response": ["*G. M. Trevelyan"]}, {"page": "Ralph Vaughan Williams", "response": ["Among those with whom Vaughan Williams became friendly at Cambridge were the philosophers G. E. Moore and Bertrand Russell, the historian G. M. Trevelyan and the musician Hugh Allen.Cobbe, p. 8 He felt intellectually overshadowed by some of his companions, but he learned much from them and formed lifelong friendships with several.Kennedy (1980), pp. 37–38 Among the women with whom he mixed socially at Cambridge was Adeline Fisher, the daughter of Herbert Fisher, an old friend of the Vaughan Williams family. She and Vaughan Williams grew close, and in June 1897, after he had left Cambridge, they became engaged to be married.Cobbe, p. 9"]}, {"page": "Arthur Balfour", "response": ["Balfour's reputation among historians is mixed. There is agreement about his achievements, as represented by G. M. Trevelyan:", ":As the prime author of the Education Act, the Licensing Act, Irish Land Purchase and the Committee of Imperial Defence, Balfour has a strong claim to be numbered among the successful Prime Ministers.G. M. Trevelyan, British history in the 19th century and after: 1792–1919 (1937) p 432."]}, {"page": "Robert Stewart, Viscount Castlereagh", "response": ["Historian G. M. Trevelyan argues:"]}, {"page": "Isaac Deutscher", "response": ["In the 1960s, the upsurge of left-wing sentiment that accompanied the Vietnam War made Deutscher a popular figure on university campuses in both Britain and the United States. By this time Deutscher had broken with conventional Trotskyism, although he never repudiated Trotsky himself and remained a committed Marxist. In 1965, Deutscher took part in the first \"Teach-In\" on Vietnam at the University of California, Berkeley, where thousands of students listened to his indictment of the Cold War. He was G. M. Trevelyan Lecturer at the University of Cambridge for 1966–67 and also lectured for six weeks at the State University of New York. In spring 1967, he guest-lectured at New York University, Princeton, Harvard and Columbia. The G. M. Trevelyan Lectures, under the title The Unfinished Revolution, were published after Deutscher's sudden and unexpected death in Rome in 1967, where he went for an Italian TV broadcast. It was a play about the fall of Trotsky, written and directed by Marco Leto, starring Franco Parenti as Trotsky and Renzo Giovampietro as Stalin. A memorial prize honouring Deutscher, called the Deutscher Memorial Prize, is awarded annually to a book \"which exemplifies the best and most innovative new writing in or about the Marxist tradition\". In his works Deutscher made the distinction between classical Marxism and vulgar Marxism.Deutscher lecture 1965.", "*The Unfinished Revolution: Russia 1917–1967 (G. M. Trevelyan lectures) (1967)"]}, {"page": "Kingdom of Great Britain", "response": ["During the War of the Spanish Succession (1702–14) England continued its policy of forming and funding alliances, especially with the Dutch Republic and the Holy Roman Empire against their common enemy, King Louis XIV of France. Queen Anne, who reigned 1702–1714, was the central decision maker, working closely with her advisers, especially her remarkably successful senior general, John Churchill, 1st Duke of Marlborough. The war was a financial drain, for Britain had to finance its allies and hire foreign soldiers. Stalemate on the battlefield and war weariness on the home front set in toward the end. The anti-war Tory politicians won control of Parliament in 1710 and forced a peace. The concluding Treaty of Utrecht was highly favourable for Britain. Spain lost its empire in Europe and faded away as a great power, while working to better manage its colonies in the Americas. The First British Empire, based upon the English overseas possessions, was enlarged. From France, Great Britain gained Newfoundland and Acadia, and from Spain Gibraltar and Menorca. Gibraltar became a major naval base which allowed Great Britain to control the entrance from the Atlantic to the Mediterranean. The war marks the weakening of French military, diplomatic and economic dominance, and the arrival on the world scene of Britain as a major imperial, military and financial power. British historian G. M. Trevelyan argued:"]}, {"page": "Thomas Babington Macaulay", "response": ["Macaulay's nephew, Sir George Trevelyan, Bt, wrote a best-selling \"Life and Letters\" of his famous uncle, . His great-nephew was the Cambridge historian G. M. Trevelyan."]}, {"page": "Peace of Utrecht", "response": ["The treaties between several European states, including Spain, Great Britain, France, Portugal, Savoy and the Dutch Republic, helped end the war.  The treaties were concluded between the representatives of Louis XIV of France and of his grandson Philip on one hand, and representatives of Queen Anne of Great Britain, King Victor Amadeus II of Sardinia, King John V of Portugal and the United Provinces of the Netherlands on the other. Though the king of France ensured the Spanish crown for his dynasty, the treaties marked the end of French ambitions of hegemony in Europe expressed in the continuous wars of Louis XIV, and paved the way to the European system based on the balance of power.R.R. Palmer, A History of the Modern World 2nd ed. 1961, p. 234.   British historian G. M. Trevelyan argued that: ", "In a major coup for the British delegation, the British government emerged from the treaty with the Asiento de Negros, which referred to the monopoly contract granted by the Spanish government to other European nations to supply slaves to Spain's colonies in the Americas. The Asiento de Negros had come about due to the fact that the Spanish Empire rarely engaged in the transatlantic slave trade itself, preferring to outsource this to foreign merchants. Bourbon France had previously held the Asiento de Negros, allowing French slave traders to supply 5,000 slaves to the Spanish Empire each year; France had gained control over this contract after Philip V had become King of Spain. After the British government gained access to the Asiento de Negros, the economic prominence held by Dutch Sephardic Jewish slaveowners began to fade, while the South Sea Company was established in hopes of gaining exclusive access to the contract. The British government sought to reduce its debt by increasing the volume of trade it had with Spain, which required gaining access to the Asiento de Negros; as historian G.M. Trevelyan noted: \"The finances of the country were based in May 1711 on the assumption that the Asiento, or monopoly of the slave trade with Spanish America, would be wrested from France as an integral part of the terms of peace\". Following the passage of the treaty, the British government gained a thirty-year access to the Asiento de Negros.Drescher: JANCAST (p 451): \"Jewish mercantile influence in the politics of the Atlantic slave trade probably reached its peak in the opening years of the eighteenth century ... the political and the economic prospects of Dutch Sephardic [Jewish] capitalists rapidly faded, however, when the British emerged with the asiento [permission to sell slaves in Spanish possessions] at the Peace of Utrecht in 1713\". England Under Queen Anne Vol III, by G. M. Trevelyan, p. 123Africa, Its Geography, People, and Products, by W. E. B. Du BoisSlavery and Augustan LiteratureCapitalism and Slavery, p. 40A History of Colonial America, by Oliver Perry Chitwood, p. 345"]}, {"page": "1914 in literature", "response": ["*September 2 – Charles Masterman invites 25 \"eminent literary men\" to Wellington House in London to form a secret British War Propaganda Bureau. Those who attend include William Archer, Arnold Bennett, Hall Caine, G. K. Chesterton, Arthur Conan Doyle, Ford Madox Hueffer, John Galsworthy, Thomas Hardy, Rudyard Kipling, John Masefield, Henry Newbolt, Gilbert Parker, G. M. Trevelyan and H. G. Wells. Kipling soon afterwards writes the poem \"For all we have and are\". W. B. Yeats, however, refuses to sign a letter of support for the War signed by most of the participants and published in The Times on September 18."]}, {"page": "1920 in literature", "response": ["*James Tait Black Memorial Prize for biography: G. M. Trevelyan, Lord Grey of the Reform Bill"]}, {"page": "1922 in literature", "response": ["*G. M. Trevelyan – British History in the Nineteenth Century, 1782–1901"]}, {"page": "1944 in literature", "response": ["*G. M. Trevelyan – English Social History: a survey of six centuries from Chaucer to Queen Victoria"]}, {"page": "1962 in literature", "response": ["*July 21 – G. M. Trevelyan, English historian (born 1876)"]}, {"page": "George Canning", "response": ["Canning subsequently served under new Prime Minister the Earl of Liverpool as British Ambassador to Portugal (1814–1816), President of the Board of Control (1816–1821), and Foreign Secretary and Leader of the House of Commons (1822–1827). King George IV disliked Canning and there were efforts to frustrate his foreign policies. Canning, however, successfully built wide public support for his policies. Historian Paul Hayes argues that he scored major achievements in diplomatic relations regarding Spain and Portugal, by helping to guarantee the independence of the American colonies of Portugal and Spain. His policies ensured a major trading advantage to British merchants and supported the Americans' Monroe Doctrine. Historian G. M. Trevelyan says:"]}, {"page": "Reform movement", "response": ["Reformers also used the scientific methodology of Jeremy Bentham and the utilitarians to design specific reforms, and especially to provide for government inspection to guarantee their successful operation.Philip Schofield, Bentham: A Guide for the Perplexed (2009). The greatest success of the Reformers was the Reform Act 1832.Michael Brock, The Great Reform Act (1973) pp 15-85 It gave the rising urban middle classes more political power, while sharply reducing the power of the low-population districts controlled by rich families.G. M. Trevelyan, Lord Grey of the Reform Bill: Being the Life of Charles, Second Earl Grey (1913) Despite determined resistance from the House of Lords to the Bill, this Act gave more parliamentary power to the liberals, while reducing the political force of the working class, leaving them detached from the main body of middle class support on which they had relied. Having achieved the Reform Act of 1832, the Radical alliance was broken until the Liberal-Labour alliance of the Edwardian period.G. D. H. Cole, Short History of the British Working Class Movement, 1787-1947. London, George Allen & Unwin (1948), pp. 63-69. \"The Reform Movement\""]}, {"page": "1876 in literature", "response": ["*February 16 – G. M. Trevelyan, English historian (died 1962)"]}, {"page": "Convention Parliament (England)", "response": [":::G. M. Trevelyan England under the Stuarts 1946 edition p 298"]}]}}