{"wiki_id": "http://www.wikidata.org/entity/Q1378128", "itemLabel": "William Henry Harvey", "itemDescription": "Irish botanist (1811-1866)", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Henry_Harvey", "wikipedia_page": {"main": "William Henry Harvey, FRS FLS (5 February 1811 – 15 May 1866) was an Irish botanist and phycologist who specialised in algae.", "link_mentions": [{"page": "Algae", "response": ["Jean Pierre Étienne Vaucher (1803) was perhaps the first to propose a system of classification of algae, and he recognized three groups, Conferves, Ulves, and Tremelles. While Johann Heinrich Friedrich Link (1820) classified algae on the basis of the colour of the pigment and structure, William Henry Harvey (1836) proposed a system of classification on the basis of the habitat and the pigment. J. G. Agardh (1849–1898) divided algae into six orders: Diatomaceae, Nostochineae, Confervoideae, Ulvaceae, Floriadeae and Fucoideae. Around 1880, algae along with fungi were grouped under Thallophyta, a division created by Eichler (1836). Encouraged by this, Adolf Engler and Karl A. E. Prantl (1912) proposed a revised scheme of classification of algae and included fungi in algae as they were of opinion that fungi have been derived from algae. The scheme proposed by Engler and Prantl is summarised as follows:"]}, {"page": "List of biologists", "response": ["*William Henry Harvey (1811–1866),Abbreviation in botany: Harv. Irish botanist and phycologist who specialised in algae"]}, {"page": "List of botanists", "response": ["*William Henry Harvey"]}, {"page": "Phycology", "response": ["While both the ancient Greeks and Romans knew of algae, and the ancient ChinesePorterfield, William M. (1922) \"References to the algae in the Chinese classics\" Bulletin of the Torrey Botanical Club 49: pp. 297–300 even cultivated certain varieties as food, the scientific study of algae began in the late 18th century with the description and naming of Fucus maximus (now Ecklonia maxima) in 1757 by Pehr Osbeck. This was followed by the descriptive work of scholars such as Dawson Turner and Carl Adolph Agardh, but it was not until later in the 19th century that efforts were made by J.V. Lamouroux and William Henry Harvey to create significant groupings within the algae. Harvey has been called \"the father of modern phycology\"\"About Phycology\" Lance Armstrong Foundation in part for his division of the algae into four major divisions based upon their pigmentation."]}, {"page": "1859 in literature", "response": ["*William Henry Harvey – Phycologia Australica"]}, {"page": "Robert Brown (botanist, born 1773)", "response": ["Investigator sailed from London on 18 July. They made brief landfalls at Bugio Island (Desertas Islands) and Madeira, but Brown was disappointed to collect almost nothing of note from either site. They arrived at the Cape of Good Hope on 16 October, staying a little over two weeks, during which time Brown made extensive botanical expeditions, and climbed Table Mountain at least twice. Many years later he would write to William Henry Harvey, who was considering emigrating there, that \"some of the pleasantest botanizing he ever had was on Devil's Mountain, near Cape Town, and he thought I could not pitch on a more delightful field of study.\" Amongst the plants collected at the Cape were two new species of Serruria (Proteaceae), S. foeniculacea and S. flagellaris.Mabberley (1985), pp. 73–79."]}, {"page": "Asa Gray", "response": ["By June 1848 many of the specimens from the Wilkes Expedition had been damaged or lost. Many were still not classified or published, as the mismanagement and bungling that had plagued the expedition before it ever departed continued. While on a trip to Washington, D.C., that month with his new bride, Gray was hired to study the botanical specimens for five years. This included a year in Europe, with his wife, using the facilities at the herbariums in Europe. Mr.and Mrs.Gray departed for England on June 11, 1850. They spent the summer traveling to Belgium, Switzerland, Germany, and the Netherlands. Gray then set down to work on the expedition's plant sheets at the estate of botanist George Bentham, whom he had met eleven years earlier, and then with William Henry Harvey in Ireland. Gray returned to England and settled into a routine at the Royal Botanic Gardens, Kew. The couple was back in America on September 4, 1851. In the meantime, a dispute had arisen between Wilkes and the team of Torrey and Gray about the format of the books resulting from the expedition. Gray almost hired his father-in-law to break the contract. This dispute largely centered on the use of Latin and English. Wilkes wanted a literal Latin to English translation while Torrey and Gray wanted a looser one because they felt that technical English terms were equally incomprehensible to the public. Much of the work was stymied or burned in fires."]}, {"page": "Margaret Gatty", "response": ["Gatty became fascinated by marine biology through contact with a second cousin, Charles Henry Gatty, a Royal Society member.Felbridge and District History Group Retrieved 6 August 2017. There may also have been influence from William Henry Harvey, whom she met while convalescing in Hastings in 1848. She corresponded with many great marine biologists of her day including George Busk and Robert Brown. She wrote British Sea Weeds, a book that was more accessible than previous ones on the subject. This illustrated book, published in 1872, was the outcome of 14 years' work and described 200 species. It continued to be used into the 1950s."]}, {"page": "Ulster Museum", "response": ["* William Henry Harvey (1811–1866) (algae)."]}, {"page": "List of Trinity College Dublin people", "response": ["*William Henry Harvey, botanist"]}, {"page": "Alexander Henry Haliday", "response": ["*1857 with William Henry Harvey, Review. Retrospect of various works published during the last year, new editions and new works in process. Natural History Review (Proc.) 4: 27-42."]}, {"page": "William Thompson (naturalist)", "response": ["In 1834 Thompson began studying the distribution of marine animals in space (depth range) and time (seasonality). His first research was with Edward Forbes conducting dredging in the Irish Sea. Other participants were Robert MacAndrew, John Gwyn Jeffreys, the Yoxford, Suffolk shell collector George Barlee (1794-1861) and his fellow Irishmen Robert Ball, Edmund Getty and George Crawford Hyndman. In 1835 he travelled in France, Switzerland and Germany with Forbes. Then in 1841 he joined Forbes and Thomas Abel Brimage Spratt on the Beacon commanded by Thomas Graves and working in the Mediterranean and Aegean. The expedition lasted eighteen months and conducted more than one hundred dredging operations at depths varying from 1 to 130 fathoms, as well as shore-based studies.Forbes E. (1844). Report on the Mollusca and Radiata of the Aegean sea, and on their distribution, considered as bearing on geology. Reports of the British Association for the Advancement of Science for 1843. 130-193. online Thompson focused on the depth range of algae, his main collection of which is in the Ulster Museum herbarium and consists of five large albumsAlgae collection. Ulster Museum (BEL) catalogue numbers: F7953 — F8151, F8182 — F8393, F8394 — F8595, F8580 — F8847 and F8848 — F8937. containing specimens collected by Thompson himself, William Henry Harvey, Moon, D. Landsborough, Robert Ball, Thomas Coulter, George Crawford Hyndman, William McCalla and many others. His records are also reported by others such as Gifford (1853):- Griffithsia simplicifilum from \"...Isle of Wight, in August, 1841, by Messers. R.Ball. and W. Thompson.\" Gifford, I. 1853. The Marine Botanist; an Introduction to the Study of the British Sea-weeds;... Third edition. Brighton, London."]}, {"page": "Backhousia", "response": ["In 1845 in the European science publication the Botanical Magazine William Jackson Hooker and William Henry Harvey first published this genus's formal description and name, after botanist James Backhouse from England and Australia."]}, {"page": "Otto Wilhelm Sonder", "response": ["Sonder published several significant botanical works. He co-authored the multi-volume Flora Capensis (7 vol. in 11, 1859–1933) with William Henry Harvey (1811–1866), and was author of an 1851 botanical treatise called Flora Hamburgensis."]}, {"page": "Harv.", "response": ["#redirect William Henry Harvey"]}, {"page": "Xymalos", "response": ["Category:Taxa named by William Henry Harvey"]}, {"page": "Jacob Whitman Bailey", "response": ["The genus Baileya, a North American genus of sun-loving wildflowers native to the deserts of northern Mexico and the Southwestern United States was named by botanists William Henry Harvey and Asa Gray in honor of their colleague Jacob Whitman Bailey."]}, {"page": "Phycologia Britannica", "response": ["#REDIRECT William Henry Harvey"]}, {"page": "William McCalla", "response": ["He was the discoverer in 1835 of Erica mackaiana, which he transmitted to Mackay. This plant is found only in Roundstone district (Ireland) and the mountains of Castile and Asturia. The seaweed Cladophora macallana (now referred to as Cladophora lehmanniana (Lindenberg) Kützing) was named after him by William Henry Harvey."]}, {"page": "Harry Bolus", "response": ["Bolus was born in Nottingham, England. He was educated at Castle Gate School, Nottingham. The headmaster George Herbert regularly corresponded with and received plant specimens from William Kensit of Grahamstown, South Africa. Kensit requested that the headmaster send him one of his pupils as an assistant; Harry Bolus duly landed at Port Elizabeth from the ship Jane in March 1850. He spent two years with Kensit and then moved to Port Elizabeth. Following a short visit to England, he settled in Graaff-Reinet, where he would live for the next 19 years. In 1857 he married Sophia Kensit, the sister of William Kensit. Between 1858 and 1870 they had 3 sons and a daughter. In 1864 he lost his eldest son of six years, and Francis Guthrie who had become a close friend, suggested his taking up botany to ameliorate his loss. He started his botanical collection in 1865 and was soon corresponding with Joseph Hooker at Kew, William Henry Harvey in Dublin and Peter MacOwan in Grahamstown. One of his most treasured gifts was a copy of De Candolle's Prodromus received from Guthrie in 1869. In 1875, he joined his brother Walter in Cape Town, settling in the suburb of Kenilworth, where they founded a stockbroking firm called Bolus Bros. The following year he and Guthrie made their first visit to Kew, taking with them a large number of plant specimens for naming. Bolus described the period as 'forty happy days'. Returning in the Windsor Castle in October 1876, the ship struck a reef off Dassen Island with the loss of his specimens and notes. Not daunted, he set about the collection of new specimens and organised expeditions to various corners of South Africa. He was an excellent field botanist and published numerous books on his observations. Although adventurous by nature, he was also quiet and unassuming."]}, {"page": "Phycologia Australica", "response": ["Phycologia Australica, written by William Henry Harvey, is one of the most important works on phycology of the 19th century."]}, {"page": "Kalanchoe thyrsiflora", "response": ["The name Kalanchoe thyrsiflora was first validly published for this southern African species by William Henry Harvey in 1862. Based on an error introduced in The Plant List in 2012, the name K. thyrsiflora has been treated by some as a synonym of K. tetraphylla. However, these two names apply to two distinct species. The name K. tetraphylla dates from 1923 and applies to a different species confined to Madagascar."]}, {"page": "Codium", "response": ["There are other species of \"doubtful validity\":- Codium amphibium is included in William Henry Harvey's Phycologia Britannica Pl.xxxv. and noted as: \"spreading in patches of great extent along the edge of the sea, over the surface of a turf-bog which meets the shore at Roundstone Bay\" (Ireland)."]}, {"page": "List of Irish plant collectors", "response": ["* William Henry Harvey (1811–1866), born in Limerick, collected plants in South Africa 1848–66"]}, {"page": "List of Irish botanical illustrators", "response": ["*William Henry Harvey (1811–1866 Torquay)"]}, {"page": "W.H.Harvey", "response": ["#REDIRECT William Henry Harvey"]}, {"page": "Francis Wall Oliver", "response": ["He edited a book titled Makers of British Botany which contained biographies of British botanists Robert Morison, John Ray, Nehemiah Grew, Stephen Hales, John Hill, Robert Brown, William Hooker, John Stevens Henslow, John Lindley, William Griffith, Arthur Henfrey, William Henry Harvey, Miles Joseph Berkeley, Joseph Henry Gilbert, William Crawford Williamson, Harry Marshall Ward and Joseph Dalton Hooker."]}, {"page": "John Rutty", "response": ["John Rutty (1697–1775) was a Dublin Quaker physician and naturalist born in Melksham, Wiltshire, England. He was the author of many texts including A methodical synopsis of the Mineral Waters of Ireland (1757) and An Essay towards the Natural History of the County of Dublin (1772). After his death his spiritual diary was published, and the botanist William Henry Harvey named the genus Acanthaceae Ruttya after him."]}, {"page": "Willian Henry Harvey", "response": ["#REDIRECT William Henry Harvey"]}, {"page": "History of phycology", "response": ["The real awakening of interest in American algae resulted from a visit by William Henry Harvey in 1849–1850 when he visited areas from Florida to Nova Scotia and produced three volumes of Nereis Boreali-Americana. These gave an incentive to others to study algae (Taylor, 1972 p. 21).Taylor,W.R. 1972 Marine Algae of the Northeastern Coast of North America. Ann Arbor, Mich ", "Sir William Jackson Hooker (1785–1865) was a lifelong friend of Harvey (Papenfuss, 1976 p. 26), he was appointed Professor of Botany at Glasgow University in 1820 and became Director in Kew 1841–1865. Hooker recognized the talent in Harvey and lent him books, encouraged and invited him to write the section on algae in his British Flora. as well as the section on algae for The Botany of Captain Beechey's Voyage (Papenfuss, 1976). Margaret Gatty (1809–1873) (née Margaret Scott) (author of British Seaweeds, 1863), and others, corresponded with William Henry Harvey (Desmond, 1977 and Evans, 2003).Desmond,R. 1977. Dictionary of British and Irish Botanists and Horticulturists. Taylor and Francis Ltd., London Evans, F. 2003. Mrs Alfred Gatty (1809–1873), author of British Seaweeds The Phycologist No.65: 14–17"]}, {"page": "Natural History Review", "response": ["Natural History Review, and quarterly journal of science. Edited by Edward Percival Wright, William Henry Harvey, Joseph Reay Greene, Samuel Haughton and Alexander Henry Haliday  London, Vols 5-7, 1858-60."]}]}}