{"wiki_id": "http://www.wikidata.org/entity/Q1377022", "itemLabel": "Paweł Pawlikowski", "itemDescription": "Polish film director and screenwriter", "wikipedia_url": "https://en.wikipedia.org/wiki/Pawe%C5%82_Pawlikowski", "wikipedia_page": {"main": "Paweł Aleksander Pawlikowski (Polish: [ˈpavɛw alɛˈksandɛr pavliˈkɔfskʲi]; born 15 September 1957) is a Polish filmmaker, who has lived and worked most of his life in the United Kingdom. He garnered early praise for a string of documentaries in the 1990s and for his award-winning feature films of the 2000s, Last Resort (2000) and My Summer of Love (2004). His success continued into the 2010s with Ida (2013), which won the Academy Award for Best Foreign Language Film, and Cold War (2018), for which Pawlikowski won the Best Director prize at the Cannes Film Festival and was nominated for the Academy Award for Best Director, while the film received a nomination for Best Foreign Language Film.", "link_mentions": [{"page": "Cinema of Poland", "response": ["The change in political climate gave rise to the Polish Film School movement, a training ground for some of the icons of the world cinematography, e.g., Roman Polanski (Knife in the Water, Rosemary's Baby, Frantic, The Pianist) and Krzysztof Zanussi (a leading director of the so-called cinema of moral anxiety of the 1970s). Andrzej Wajda's films offer insightful analyses of the universal element of the Polish experience - the struggle to maintain dignity under the most trying circumstances. His films defined several Polish generations. In 2000, Wajda was awarded an honorary Oscar for his overall contribution to cinema. Four of his films were nominated for Best Foreign Language Film award at Academy Awards with six other Polish directors receiving one nomination each: Roman Polański, Jerzy Kawalerowicz, Jerzy Hoffman, Jerzy Antczak, Agnieszka Holland and Jan Komasa. In 2015, Polish filmmaker Paweł Pawlikowski received this award for his film Ida. In 2019, he was also nominated to the award for his next film Cold War in two categories - Best Foreign Language Film and Best Director.", "File:Pawel Pawlikowski (cropped).jpg|Paweł Pawlikowski", "*2018 Best Director (Cold War, Paweł Pawlikowski)", "*2015 Academy Award for Best Foreign Language Film (Ida, Paweł Pawlikowski)", "*2014 European Film Award for Best Film (Ida, Paweł Pawlikowski)", "*2014 European Film Award for Best Director (Paweł Pawlikowski, Ida)", "*2014 European Film Award for Best Screenwriter (Paweł Pawlikowski, Ida)", "*2014 People's Choice Award for Best European Film (Paweł Pawlikowski, Ida)", "*2018 European Film Award for Best Film (Cold War, Paweł Pawlikowski)", "*2018 European Film Award for Best Director (Paweł Pawlikowski, Cold War)", "*2018 European Film Award for Best Screenwriter (Paweł Pawlikowski, Cold War)", "*2018 People's Choice Award for Best European Film (Cold War, Paweł Pawlikowski)"]}, {"page": "Poland", "response": ["In 2015, Ida by Paweł Pawlikowski won the Academy Award for Best Foreign Language Film. In 2019, Pawlikowski received an Academy Award for Best Director nomination for his historical drama Cold War. Other well-known Polish Oscar-winning productions include The Pianist (2002) by Roman Polański."]}, {"page": "Łódź", "response": ["Three major novels depict the development of industrial Łódź: Władysław Reymont's The Promised Land (1898), Joseph Roth's Hotel Savoy (1924) and Israel Joshua Singer's The Brothers Ashkenazi (1937). Roth's novel depicts the city on the eve of a workers' riot in 1919. Reymont's novel was made into a film by Andrzej Wajda in 1975. In the 1990 film Europa Europa, Solomon Perel's family flees pre-World War II Berlin and settles in Łódź. Scenes of David Lynch's 2006 film Inland Empire were shot in Łódź. Paweł Pawlikowski's film Ida was partially shot in Łódź. Sections of Harry Turtledove's Worldwar alternate history series take place in Łódź, and, in John Birmingham's Axis of Time alternate history trilogy, Łódź gains the unfortunate historical notoriety of becoming the first city to be destroyed by an Atomic Bomb when the USSR destroys the city on 5 June 1944. Łódź. Chava Rosenfarb’s Yiddish trilogy “The Tree of Life” (1972; English translation 1985) portrays life within the Łódź Ghetto."]}, {"page": "Academy Award for Best Director", "response": ["* 2018 –  Paweł Pawlikowski for Cold War, Polish"]}, {"page": "Ebertfest", "response": ["| Paweł Pawlikowski", "| Paweł Pawlikowski"]}, {"page": "List of Polish people", "response": ["* Paweł Pawlikowski, film director"]}, {"page": "Ethan Hawke", "response": ["In 2010, Hawke starred as a vampire hematologist in the science fiction horror film Daybreakers. Filmed in Australia with the Spierig brothers, the feature received reasonable reviews, and earned US$51 million worldwide. His next role was in Antoine Fuqua's Brooklyn's Finest as a corrupt narcotics officer. The film opened in March to a mediocre reception, yet his performance was well received, with the New York Daily News concluding, \"Hawke—continuing an evolution toward stronger, more intense acting than anyone might've predicted from him 20 years ago—drives the movie.\" In the 2011 television adaptation of Herman Melville's Moby-Dick, Hawke played the role of Starbuck, the first officer to William Hurt's Captain Ahab. He then starred opposite Kristin Scott Thomas in Paweł Pawlikowski's The Woman in the Fifth, a \"lush puzzler\" about an American novelist struggling to rebuild his life in Paris."]}, {"page": "Serbian epic poetry", "response": ["Modern example of Serbian epics as recorded in 1992 by film director Paweł Pawlikowski in a documentary for the BBC Serbian epics; an anonymous gusle singer compares Radovan Karadžić, as he prepares to depart for Geneva for peace talk, to Karađorđe, who had led the First Serbian Uprising against the Turks in 1804:"]}]}}