{"wiki_id": "http://www.wikidata.org/entity/Q1376846", "itemLabel": "Matthew Selt", "itemDescription": "English snooker player", "wikipedia_url": "https://en.wikipedia.org/wiki/Matthew_Selt", "wikipedia_page": {"main": "Matthew Selt (born 7 March 1985) is an English professional snooker player originally from Romford, east London and now living in Atherstone, North Warwickshire, playing out of the Atack Snooker Centre in Nuneaton. He qualified for the professional tour by finishing seventh on the Pontin's International Open Series in 2006/2007. Selt played in his first professional final in 2014 at the minor-ranking Lisbon Open, which he lost to Stephen Maguire, and has reached five quarter-finals in full ranking events. Selt won his first ranking title when he beat Lyu Haotian in the 2019 Indian Open final.", "link_mentions": [{"page": "Jimmy White", "response": ["He had a better result in the EPTC Event 3 where he progressed to the last 16 before losing 0–4 to Shaun Murphy, and in the APTC Event 2 where he made it to another last 16 before once again losing 0–4 to Matthew Selt. He also qualified for the International Championship where he lost 4–6 to Barry Hawkins."]}, {"page": "Pankaj Advani (billiards player)", "response": ["The 2013–14 season saw the introduction of a ranking event in Advani's home country of India for the first time which he qualified for by beating Matthew Selt 4–0. At the tournament in New Delhi Advani defeated Marcus Campbell 4–1 and Mark Allen 4–2. His match with Allen finished at 11 pm local time, with Advani back in last 16 action at 10 am the next morning to play Stuart Bingham. The match went to a deciding frame and when Bingham broke down on a break of 30, Advani stepped in to compose a match winning 86. Advani played compatriot Aditya Mehta in the quarter-finals in an iconic match in Indian snooker as the winner would be the country's first ranking event semi-finalist. The match was heavily focused on safety and it was Mehta who advanced with a 4–3 win. His best run in a ranking event during the rest of the season was at the World Open, where he narrowly beat Xiao Guodong 5–4 to set up a last 32 meeting with Ding Junhui. Advani had a lead of 4–2 in the best of nine frame match and was 35 points to 0 ahead in the seventh frame to be on the cusp of a shock result against the player who had already won four ranking events this season. However, Ding made a break of 52 to win the frame, compiled a 136 to draw level and won the deciding frame in one visit to defeat Advani. Advani's successful season saw him finish inside the top 64 in the world rankings for the first time as he was placed 56th."]}, {"page": "Ken Doherty", "response": ["Doherty began the 2012–13 season by losing 4–5 to Stuart Bingham in the second round of the Wuxi Classic and 3–5 to Martin Gould in the first round of the Australian Goldfields Open. He finally compiled the first official 147 break of his career at the minor-ranking 2012 Paul Hunter Classic in Germany during a first round win against Julian Treiber. He went on to reach the quarter-finals of the event, losing 0–4 to Mark Selby. Doherty was defeated in qualifying for the Shanghai Masters and the 2012 UK Championship and failed to advance beyond the wildcard round of the International Championship. At the fifth European Tour Event, the Scottish Open, he saw off the likes of Luca Brecel and Ryan Day to reach the semi-finals where he lost 2–4 against Ding Junhui. Doherty was eliminated in the first round of the German Masters by Peter Lines, but then had his best run of the season at the Welsh Open. He beat four-time world champion John Higgins 4–1 and Tom Ford 4–3 to make it through to the quarter-finals. He led Stuart Bingham 2–0, but a series of missed pots saw Doherty lose his confidence and he went on to lose 3–5. His aforementioned run to the semi-finals of the Scottish Open helped him finish 16th on the PTC Order of Merit to qualify as one of the top 26 players for the Finals, but he lost 2–4 to Kurt Maflin in the first round. Doherty almost pulled off one of his trademark comebacks against Matthew Selt in the final round of World Championship qualifying as from 4–9 down he levelled at 9–9, but lost the deciding frame. The result meant that this was the first season where Doherty had not featured in any of snooker's Triple Crown events. Doherty increased his ranking by eight spots during the season to finish it ranked world number 27."]}, {"page": "Mark Williams (snooker player)", "response": ["After defeating Thepchaiya Un-Nooh in the first round of the Players Championship Grand Final, Williams produced back-to-back comebacks from 1–3 down to knock out both Mark Selby and Matthew Selt 4–3. He then reached his first major ranking event final in over three years with a 4–2 win over Judd Trump and raced into a 3–0 lead against Joe Perry. However, his highest break in the next four frames was 14 as Perry fought back to triumph 4–3. In a rematch of the 2000 final, Williams played Matthew Stevens in the first round of the World Championship and was thrashed 10–2.", "Having beaten Oliver Lines 5–1 and Matthew Stevens 5–3 to qualify for the 2018 German Masters, Williams lost the first two frames of his first-round match against Fergal O'Brien but went on to beat O'Brien 5–3, later overcoming Matthew Selt 5–2 and Jimmy Robertson 5–3 to reach the semi-finals. There, he recorded breaks of 109, 68 and 51 in defeating Judd Trump 6–1 to reach the final, where he would face Graeme Dott. In the final, Williams was dominant, making six breaks over 50 and one century, a 110 in the eighth frame. Dott won the third frame to trail 1–2, compiling a break of 64 after an earlier 56 by Williams, but did not win another, as Williams ran out a 9–1 victor."]}, {"page": "Stephen Hendry", "response": ["In 2020, Hendry accepted an invitational tour card to play on the main World Snooker Tour for two seasons, citing improved play in practice with coach Steve Feeney. After delaying his return to competition several times, he played his first professional match in nine years at the Gibraltar Open in March 2021, losing 1–4 to Matthew Selt in the first round. He then played Jimmy White in the first round of World Championship qualifying, winning 6–3, although he lost 1–6 to Xu Si in the second qualifying round, ending his hopes of reaching the Crucible in his first season back on the tour."]}, {"page": "Alan McManus", "response": ["McManus would lose in the first round of the UK Championship to Joel Walker. He won his first qualifier for the 2015 German Masters against Zak Surety but was then defeated in the final qualifying round by Matthew Selt. McManus had a good run in the Welsh Open, reaching the last 16 before losing to Maguire. He performed well in the season's European Tour Events, finishing 18th on the Order of Merit. He played in four of the six events, reaching one quarter-final with a further three last 16 appearances. This gave him entry into the Grand Final where he was defeated 1–4 by Bingham in the first round. McManus won all three of his World Championship qualifying matches, defeating Michael Wasley, Andrew Pagett and Mitchell Mann to reach the main draw at the Crucible. However, an inconsistent performance against Ali Carter saw McManus bow out 5–10 in the first round."]}, {"page": "Marco Fu", "response": ["Fu qualified for four of the eight ranking tournaments of the 2011–12 season. At the Welsh Open he lost in the first round 1–4 to Ronnie O'Sullivan and lost in the first round of the World Open following a 3–5 defeat to John Higgins. Fu had earlier made the second maximum break of his career during the final qualifying round for the World Open in a match against Matthew Selt. Fu's best performance of the season came at the 2011 UK Championship. He qualified by beating Anthony Hamilton 6–5 and then saw off Stuart Bingham 6–4 in the first round to set up a last 16 clash with world number one, Mark Selby who he defeated 6–3 and then played Mark Allen in the quarter-finals. Fu led 5–4 in the match, but lost the last two frames to lose 5–6. Fu qualified for the 2012 World Snooker Championship with a 10–4 win over Shailesh Jogia, but lost in the first round of the event 3–10 to Matthew Stevens. As a result, he finished the season ranked world number 28, his lowest position since 2000."]}, {"page": "List of snooker players", "response": ["*Matthew Selt"]}, {"page": "Dominic Dale", "response": ["At the International Championship, Dale defeated Matthew Selt 6–1 and then lost 6–3 to Joe Perry in the second round. His second round match with Peter Ebdon at the UK Championship finished at 1:30am as Dale relinquished a 5–4 advantage to be beaten 6–5. Breaks of 72, 73, 82 and 61 saw Dale sneak past Mark Williams in the opening round of the Players Championship Finals 4–3, before he lost 4–1 to Shaun Murphy. Dale won more than one match at a ranking event for the only time this season when he knocked out Jamie Jones and Darryl Hill at the China Open, but then was beaten 6–1 by Stephen Maguire in the third round."]}, {"page": "Stephen Maguire", "response": ["In June 2014, Maguire whitewashed Judd Trump 5–0 to reach the quarter-finals of the Wuxi Classic where he lost 4–5 against Martin Gould, despite making the tournament's highest break of 145. Three months later, he won the Six-red World Championship, defeating Ricky Walden 8–7 in the final. However, he failed to advance beyond the second round in the three major ranking events following Wuxi. After losing 1–4 to Trump in the opening round of the Champion of Champions, Maguire hinted at retiring from the game. When he came back from 0–3 down against Yu Delu to win 6–4 in the second round of the UK Championship, he remarked that he might seek the help of a sports psychologist in the future. He then beat Mark Williams 6–2, David Morris 6–3 and Marco Fu 6–4 to play in his first major ranking event semi-final in over a year. He again faced Trump and lost the first four frames, as well as being 1–5 behind. Maguire pulled the deficit back to a single frame and had chances to send the match into a deciding frame, but went  when escaping a snooker on the colours and lost 4–6. A week later, Maguire continued his resurgence of form to win the inaugural Lisbon Open, defeating Matthew Selt 4–2 in the final. During the German Masters, he stated that he had regained his confidence and it would take \"something special to stop him\". He needed two snookers in the deciding frame of his quarter-final match with Neil Robertson, which he managed after Robertson accidentally potted the black. In his second consecutive ranking event semi-final, Maguire was defeated 2–6 by Mark Selby. He advanced to the quarter-finals of the Welsh Open without facing a top-16 player, and lost 1–5 to John Higgins."]}, {"page": "Ali Carter", "response": ["Carter missed the start of the 2014–15 season due to receiving treatment for a recurrence of testicular cancer metastasising to his lung. He returned in October at the non-ranking General Cup and won the title by defeating Shaun Murphy 7–6 in the final. In October, World Snooker and the WPBSA announced that Carter's seeding for the remainder of the 2014–15 season would be based on a world ranking of 13. His first match back in a ranking event was a 5–6 loss to Zhang Anda in the opening round of the UK Championship. Carter received a standing ovation at the Masters and beat Barry Hawkins 6–1, before Neil Robertson defeated him by a reversal of this scoreline in the quarter-finals. Afterwards Carter said he was nowhere near match sharp and was targeting the World Championship as the place to rediscover his best form. He won his first matches at the venue stage of a ranking event this year at the Welsh Open with victories over Fraser Patrick, Mark King and Matthew Selt, before losing 2–4 to Ben Woollaston in the last 16 and was knocked out in the first round of the China Open 5–4 by Kurt Maflin.", "In October, Carter reached the quarter final of the English Open after wins over Rory McLeod, Luca Brecel, Matthew Selt, and Daniel Wells, before losing 5–2 to Stuart Bingham. He then reached another quarter final of a ranking event, this time at the International Championship, but was whitewashed by Mark Allen 6–0. The best result of the season for Carter came in the World Grand Prix in February. He defeated Martin O'Donnell, Mark Allen, David Gilbert, and Xiao Guodong to reach the final, but eventually lost 10–6 to Judd Trump."]}, {"page": "Barry Hawkins", "response": ["His next ranking event was the Australian Goldfields Open in Bendigo, where he defeated Xiao Guodong (5–1), Matthew Stevens (5–2), Matthew Selt (5–3), and Mark Davis (6–4) to reach the first ranking event final of his 16-year professional career. He faced Peter Ebdon and finished the first session of the match leading 5–3, which included a spell of four successive frames that meant Ebdon had not potted a ball for over an hour. In the evening session Hawkins won all four frames played to take the title with a 9–3 victory. He made three centuries in the final and climbed to world number 20 thanks to the win, as well as earning praise from Ebdon himself.", "Hawkins looked to be cruising into the second round of the World Championship after he took the opening session of his match with Matthew Selt 7–2 and extended it to 9–4. However, Selt won five frames on the trot to take the match into a deciding frame which Hawkins won.https://www.bbc.co.uk/programmes/p02p8f8n Hawkins produced a great comeback in the next round against Mark Allen by winning five frames in a row to triumph 13–11 and stated that the unique atmosphere of the Crucible Theatre helps him focus harder and is the reason for his recent good form in the event. In the quarter-finals, Hawkins won six frames from 3–1 behind, restricting his opponent Neil Robertson to just eight points in the process. The tie would eventually go into a deciding frame which Hawkins won with a 61 break to reach the semi-finals for the third year in a row. It was an extremely high quality encounter, during which both players made four centuries each to equal a World Championship record for a best of 25 frame match. Hawkins endured a tough semi-final as he fell 14–3 behind Shaun Murphy and only just avoided losing with a session to spare, as he returned to be defeated 17–9."]}, {"page": "Mark Selby", "response": ["At the China Open, Selby became only the fourth player in history to miss the final black on a 147 attempt, and only the second – after Ken Doherty – to do so in a televised match, in a 5–1 defeat of Mark King. He then reached the final by defeating Ricky Walden 5–2, Williams 5–1 and Murphy 6–2, but lost 6–10 against Robertson. After the event he regained the number one spot from Trump. He finished off the season at the World Championship, where he beat Matthew Selt 10–4 in the first round, before losing 10–13 to Hawkins in the second round.", "At the 2015 International Championship, Selby reached the semi-finals but then lost 4–9 to John Higgins. He did not drop a frame in reaching the third round of the UK Championship where he defeated Jamie Jones 6–5, later acknowledging that his opponent had deserved to win the match. He then eliminated Dechawat Poomjaeng and Matthew Selt both 6–1, before being whitewashed 6–0 by Neil Robertson in the semi-finals. In early 2016, Selby lost to Ronnie O'Sullivan in the quarter-finals of both the Masters and Welsh Open, but won the Gdynia Open with a 4–1 victory over Martin Gould."]}, {"page": "Stuart Bingham", "response": ["He won the first two non-ranking tournaments beginning with the Pink Ribbon Pro-Am charity tournament where he whitewashed Peter Lines 4–0 in the final. Bingham followed this up by claiming the first Asian Players Tour Championship with a 4–3 victory over Stephen Lee. Bingham won deciding frames in each of his matches to reach the final of the Wuxi Classic, overcoming Peter Ebdon, Ken Doherty, world number one Mark Selby and Mark Davis. He played Ricky Walden but trailed 1–7 at the conclusion of the afternoon's play, before eventually losing 4–10. This ended Bingham's winning start to the season, which had seen him take 16 matches in a row. He was unable to defend his Australian Goldfields Open title losing to Matthew Selt in the first round 4–5.", "| Matthew Selt "]}, {"page": "Ryan Day (snooker player)", "response": ["Day lost in qualifying for the opening ranking event of the 2012–13 season the Wuxi Classic 0–5 to Robert Milkins. He was then beaten in the second round of the Australian Goldfields Open and the Shanghai Masters, 3–5 to Matthew Selt and 0–5 to John Higgins respectively. Day was defeated 3–6 by Neil Robertson in the opening round of the International Championship, but then came perhaps the best result of his season at the UK Championship. He beat Ding Junhui 6–4 in a high quality first round encounter, before letting a 3–0 lead against world number two Mark Selby slip to lose 4–6. Day played in nine of the ten minor-ranking Players Tour Championship events during the season with his best results being two quarter-final defeats to be ranked 32nd on the Order of Merit, just outside the top 26 who qualified for the Finals. Day struggled in the second half of the season as he failed to qualify for four of the remaining five ranking events, losing 2–5 in the first round of the World Open to Mark Allen in the one he did reach. He failed to qualify for the World Championship for the first time since 2006, narrowly losing to Ben Woollaston 9–10 in the fourth and final qualifying round. He finished the season ranked world number 31."]}, {"page": "Rory McLeod (snooker player)", "response": ["McLeod was beaten 5–4 by Michael Holt after having been 4–2 ahead in the first round of the 2014 Wuxi Classic. He defeated Lee Walker, Andrew Pagett and Ken Doherty on his way to qualifying for the Australian Goldfields Open and lost 5–2 to Judd Trump in the opening round. McLeod failed to qualify for the next two ranking events, before knocking out Ian Burns 6–2 and Zhang Anda 6–5 at the UK Championship. His second last 32 match of the season went into the early hours and it was Matthew Selt who ended McLeod's tournament with a 6–4 win. McLeod met Ronnie O'Sullivan in the second round of the Welsh Open after seeing off Andrew Pagett 4–2. He led 2–0, before O'Sullivan won four unanswered frames. The final ranking event McLeod could qualify for this year was the Indian Open where he lost 4–1 to Ricky Walden in the first round. McLeod kept a hold of his tour place at the end of the season as he was the world number 62, just inside the top 64 who remain."]}, {"page": "Rod Lawler", "response": ["In 2010 however, Lawler did reach the last 32 of the China Open, winning three qualifying matches against Matthew Selt, Dominic Dale, and Ricky Walden. Also defeating wildcard Supoj Saenla 5–3, before losing to then number 8 seed Mark Selby"]}, {"page": "Andrew Higginson", "response": ["After winning three matches to qualify for the Australian Goldfields Open, Higginson lost 5–3 to Ricky Walden in the first round and he was knocked out in the same stage of the International Championship 6–4 by Liang Wenbo. Another opening round defeat in a ranking came at the UK Championship 6–1 to David Grace. At the Gdynia Open, Higginson defeated five players to reach the semi-finals, but lost 4–2 to Mark Selby. This saw him finish 15th on the Order of Merit and qualify for the Grand Final, where he was knocked out 4–1 by Matthew Selt. Higginson failed to win a match at a ranking event for the sixth time this season when he suffered a 5–3 loss to Yuan Sijun in the wildcard round of the China Open. His ranking slump continued as he was placed 56th in the world."]}, {"page": "David Gilbert (snooker player)", "response": ["Gilbert was eliminated in the qualifying rounds of the opening two ranking events of the season. At the minor-ranking Ruhr Open he won four matches to play in the quarter-finals where he beat Barry Hawkins 4–2, before losing 4–3 to Tian Pengfei in the semis. Gilbert's form continued later in to the month at the International Championship as he knocked out Xiao Guodong 6–5, Oliver Lines 6–4 and Ryan Day 6–4 to play in the first ranking event quarter-final of his career. He came back from 4–2 down against Marco Fu to edge it 6–5 which included a 130 break and then saw off Thepchaiya Un-Nooh 9–5. In the final, Gilbert was level with John Higgins at 4–4, but would lose 9–5. The £65,000 runner-up's cheque is by far the biggest of his career and he moved up to 21st in the world rankings afterwards. Gilbert stated that his newfound form was down to a new cue he acquired from fellow professional Matthew Selt six weeks previously. Gilbert was knocked out in the third round of both the UK Championship and China Open 6–3 to Marco Fu and 5–3 to Higgins respectively. Gilbert won three matches to qualify for the World Championship and faced Ronnie O'Sullivan in the first round. He was defeated 10–7, but said it was the best he had ever played without winning a match. He moved up to world number 22 at the end of the season."]}, {"page": "Shailesh Jogia", "response": ["On 30 May 2012, it was announced by World Snooker that Jogia had been suspended from playing on the tour because of unusual betting patterns on his match against Matthew Selt in the Snooker Shoot-Out, which was due to take place on 28 January 2012. A high number of bets were placed on Jogia to lose the match, which he claimed was because of an injury to his knee and the assumption that he would be unable to play to an adequate standard. Jogia withdrew from the event the day before it started, but faced a formal hearing of the World Snooker Disciplinary Committee in July. At the hearing it was revealed that Jogia had been in repeated communication with two people who placed 19 bets on the match and that 11 of these bets had been placed before he sought medical attention regarding his knee injury. Jogia was banned from snooker until after the 2014 World Championship and fined £2,000 as a contribution to the cost of the investigation."]}, {"page": "2007 Grand Prix (snooker)", "response": ["**Matthew Selt 3–4 Joe Jogia", "**Matthew Selt 4–3 Rodney Goggins", "**David Roe 4–2 Matthew Selt", "**Fergal O'Brien 4–2 Matthew Selt", "**Matthew Selt 4–1 Kevin Van Hove", "**Michael Judge 4–1 Matthew Selt", "**Drew Henry 0–4 Matthew Selt", "*106  Matthew Selt"]}, {"page": "Mark Joyce", "response": ["Joyce opened the season with three wins to qualify for the Australian Goldfields Open and beat Mark Allen 5–2, before losing 5–4 to Matthew Selt. A first round defeat to Ryan Day in the International Championship was followed by defeating Barry Pinches and Sydney Wilson at the UK Championship. Joyce built a 5–0 lead over Dechawat Poomjaeng, but lost six frames in a row to be eliminated in the third round. He bounced back to win two matches and qualify for the German Masters and recorded his second 5–2 first round triumph of the season over Allen. Joyce reached his third career quarter-final after overcoming Mark King 5–2 and led Luca Brecel 4–2, but would lose 5–4. He lost in the second round of the Welsh Open and China Open 4–1 to Alan McManus and 5–1 to John Higgins respectively."]}, {"page": "Tom Ford (snooker player)", "response": ["Ford qualified for the Australian Goldfields Open for the fourth year in a row and lost 3–5 to John Higgins in the first round. He had five defeats in a row after this until beating Barry Pinches 6–4 in the opening round of the UK Championship, his first win in the event after six prior losses. Ford was beaten 3–6 by Joel Walker in the second round. He had a resurgence of form at the Asian Tour event, the Xuzhou Open by knocking out five players to reach the semi-finals, where he lost the last two frames in a 3–4 defeat to Joe Perry. Ford entered the qualifying rounds of the World Championship needing wins to ensure his survival on the tour as he was close to ending the season outside the top 64 in the world rankings. He did so by seeing off Andrew Norman 10–2 and David Gilbert 10–8 to meet Matthew Selt in the final round, where he lost 8–10. Ford ended up 59th in the world rankings, a drop of 27 places during the year.", "Ford began the 2015–16 season by reaching the third final carrying ranking points of his career after overcoming the likes of Joe Perry, Matthew Selt and Ben Woollaston at the Riga Open. Ford won the first frame against Barry Hawkins, but could not capture another to be beaten 1–4. He defeated Scott Donaldson 6–1 and then beat Mark Williams for the first time by recovering from 3–5 down to win 6–5. He followed that up by easing past Kyren Wilson 6–1, but accused his opponent Liang Wenbo of boring him off the table in the fourth round after it was Ford who lost 5–6 having been 5–3 up. Ford failed to build upon this during the rest of the season as he could not get beyond the second round of any ranking event. However, he was able to build on his world ranking to finish as the world number 43, an increase of 16 spots during the year."]}, {"page": "Martin Gould", "response": ["Gould's season began at the Australian Goldfields Open, where he beat Marco Fu 5–4, Michael Holt 5–3 and Matthew Selt 5–1. He then eased past Stephen Maguire 6–1 in the semi-finals to play in the second ranking event final of his career, in which he made two centuries and came back from 5–7 down to level John Higgins at 8–8. Gould had the first chance in the deciding frame, but could only score eight points as an 89 break from Higgins denied him the title. Gould qualified for the Shanghai Masters by beating Liam Highfield 5–2 in the final round of qualifying, and beat Barry Hawkins 5–1 in the last 32, before getting revenge on John Higgins for the defeat in Australia by beating him 5–3. He crashed out to Stuart Bingham 4–5 in the quarter-finals despite leading 4–2. Gould would also suffer disappointment at the UK Championship as he let a 5–1 lead slip against underdog David Grace in the quarter-finals, losing 5–6 after having several chances to close out the victory.Gould stunned by Grace comeback in epic quarter-final"]}, {"page": "List of people from the London Borough of Havering", "response": ["*Matthew Selt – snooker player"]}, {"page": "Xiao Guodong", "response": ["At the Australian Goldfields Open, Xiao recorded wins over Liam Highfield, Peter Ebdon and Matthew Stevens to reach the semi-finals of a ranking event for the second time, where Judd Trump defeated him 6–3. He beat Eden Sharav and Noppon Saengkham at the International Championship, but lost 6–4 to Robert Milkins in the third round and was knocked out by the same scoreline in the second round of the UK Championship against Matthew Selt. After edging Highfield 5–4 in the first round of the German Masters, Xiao was thrashed 5–0 by Neil Robertson. Xiao won five matches at the Shoot-Out, the tournament where every match is decided by one ten-minute frame, to reach the final. Xiao lost the lead with just six seconds remaining against Michael White. He progressed through to the final qualifying round of the World Championship and his match against Jimmy Robertson went into a deciding frame which Robertson won on the final pink."]}, {"page": "Matthew selt", "response": ["#REDIRECT Matthew Selt "]}, {"page": "2008 China Open (snooker)", "response": ["*103, 103, 102  Matthew Selt"]}, {"page": "Paul Davison", "response": ["Davison played in all six of the minor-ranking European Tour events during the 2014–15 season. His best performance came at the Riga Open, where he reached the last 32 with 4–3 and 4–1 wins over Jack Lisowski and Gerard Greene respectively, but he then lost 4–2 to Matthew Selt. A 4–3 victory against Kyren Wilson at the Paul Hunter Classic was his only other win in a European Tour event, with Davison losing 4–3 to Dechawat Poomjaeng in the subsequent round. He had two chances to rejoin the professional tour. The first came at the EBSA Play-offs where Davison was knocked out 4–3 by Martin O'Donnell in round two. His second came at Q School and in event two Davison won six games, concluding with a 4–3 victory over Luke Simmonds to earn a two-year tour card."]}, {"page": "Ben Woollaston", "response": ["Woollaston lost 4–1 in the semi-finals of the Riga Open to Tom Ford and reached the quarter-finals of the Haining Open, but was beaten 4–2 by Robert Milkins. Two deciding frame victories over Robbie Williams and Yu Delu saw him reach the third round of the International Championship. After recovering from 5–2 down to Joe Perry, he almost won 6–5 for the third time in the week but this time lost the decider. Woollaston was beaten 6–2 in third round of the UK Championship by Shaun Murphy. He reached the quarter-finals of the Welsh Open for the second year in a row, but was defeated 5–1 by Joe Perry. Another came at the PTC Finals with wins over Jimmy Robertson and Matthew Selt and, though he had multiple chances to win the last frame, he lost 4–3 to Murphy. Woollaston lost 10–9 to Chris Wakelin in the first round of World Championship qualifying. He recorded a new career-high end of season world ranking of 27."]}, {"page": "Snooker world ranking points 2007/2008", "response": ["| 71 ||  || style=\"text-align:left;\"| Matthew Selt"]}, {"page": "Snooker world ranking points 2008/2009", "response": ["| 67 || 1 || style=\"text-align:left;\"| Matthew Selt"]}, {"page": "2009 World Snooker Championship", "response": ["*134, 103  Matthew Selt"]}, {"page": "2008 UK Championship", "response": ["*143  Matthew Selt"]}, {"page": "2008 Shanghai Masters", "response": ["*112  Matthew Selt"]}]}}