{"wiki_id": "http://www.wikidata.org/entity/Q137808", "itemLabel": "Oona O'Neill", "itemDescription": "American actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Oona_O%27Neill", "wikipedia_page": {"main": "Oona O'Neill, Lady Chaplin (14 May 1925 – 27 September 1991) was an actress who was the daughter of American playwright Eugene O'Neill and English-born writer Agnes Boulton, and the fourth and last wife of English actor and filmmaker Charlie Chaplin.\nO'Neill's parents divorced when she was four years old, after which she was raised by her mother in Point Pleasant, New Jersey, and rarely saw her father. She first came to the public eye during her time at the Brearley School in New York City between 1940 and 1942, when she was photographed attending fashionable nightclubs with her friends Carol Marcus and Gloria Vanderbilt. In 1942, she received a large amount of media attention after she was chosen as \"The Number One Debutante\" of the 1942–1943 season at the Stork Club. Soon after, she decided to pursue a career in acting and, after small roles in two stage productions, headed for Hollywood.\nIn Hollywood, O'Neill was introduced to Chaplin, who considered her for a film role. The film was never made, but O'Neill and Chaplin began a romantic relationship and married in June 1943, a month after she had turned 18. The 36-year age gap between them caused a scandal, and severed O'Neill's relationship with her father, who was only six months older than Chaplin and who had already strongly disapproved of her wish to become an actress. Following the marriage, O'Neill gave up her career plans. She and Chaplin had eight children together and remained married until his death. The first decade of their marriage was spent living in Beverly Hills, but after Chaplin's re-entry permit to the United States was cancelled during a voyage to London in 1952, they moved to Manoir de Ban in the Swiss village of Corsier-sur-Vevey. In 1954, O'Neill renounced her US citizenship and became a British citizen. Following Chaplin's death in 1977, she split her time between Switzerland and New York. She died of pancreatic cancer at the age of 66 in Corsier-sur-Vevey in 1991. Her daughter Geraldine Chaplin named her own daughter after Oona in 1986.", "link_mentions": [{"page": "Charlie Chaplin", "response": ["====Legal troubles and Oona O'Neill====", "The controversy surrounding Chaplin increased whentwo weeks after the paternity suit was filedit was announced that he had married his newest protégée, 18-year-old Oona O'Neill, the daughter of American playwright Eugene O'Neill. Chaplin, then 54, had been introduced to her by a film agent seven months earlier. In his autobiography, Chaplin described meeting O'Neill as \"the happiest event of my life\", and claimed to have found \"perfect love\". Chaplin's son, Charles Jr., reported that Oona \"worshipped\" his father. The couple remained married until Chaplin's death, and had eight children over 18 years: Geraldine Leigh (b. July 1944), Michael John (b. March 1946), Josephine Hannah (b. March 1949), Victoria (b. May 1951), Eugene Anthony (b. August 1953), Jane Cecil (b. May 1957), Annette Emily (b. December 1959), and Christopher James (b. July 1962)."]}, {"page": "1991", "response": ["* September 27 – Oona O'Neill, English actress (b. 1925)"]}, {"page": "1925", "response": ["** Oona O'Neill, American actress (d. 1991)"]}, {"page": "Eugene O'Neill", "response": ["| Oona O'Neill"]}, {"page": "Nashville (film)", "response": ["As with most of Altman's feature films, he cast the roles using unorthodox methods, forgoing standard auditions and instead basing his decisions off meetings with individual actors. Geraldine Chaplin, daughter of Charlie Chaplin and Oona O'Neill, was the first to be cast, appearing in the role of Opal, the chatty journalist who has arrived from out of town to cover the gala. Screenwriter Tewkesbury, who had based the character of Opal on herself, selected Chaplin for the role long before the production had even secured funding. Altman flew Chaplin from her residence in Switzerland to Nashville, and she toured the city with Tewkesbury in preparation for the role."]}, {"page": "Point Pleasant, New Jersey", "response": ["* Oona O'Neill (1925–1991), daughter of Eugene O'Neill and writer Agnes Boulton, and the fourth and last wife of comic and filmmaker Charlie Chaplin.Scovell, Jane. Oona Living in the Shadows: A Biography of Oona O'Neill Chaplin p. 7. Hachette Digital, 2009. . \"When at last Agnes returned to Point Pleasant, Oona was thrilled and so was Jim Delaney.\""]}, {"page": "Chaplin (film)", "response": ["Chaplin finally settles down and marries Oona O'Neill, an actress who strikingly resembles Hett. However, it is alleged that he is the father of the child of former lover Joan Barry. Despite a blood test proving that the child is not his, Chaplin is ordered to provide financial support. With his reputation severely damaged, he stays out of the public eye for over seven years until producing Limelight. During the height of McCarthyism, Chaplin leaves America with Oona on a visit to Britain, but the United States Attorney General revokes his permit to re-enter the United States."]}, {"page": "Hedda Hopper", "response": ["Charlie Chaplin was another target of Hedda Hopper's vitriol because of his alleged Communist sympathies and his relationships with much younger women, which she considered immoral despite her own marriage to a man 27 years her senior. She also objected to him for remaining a British citizen and not becoming an American, which she considered an act of ingratitude towards a country which had given him so much. When in 1943, he denied that he was the father of 22-year old actress Joan Barry's child, Hopper assisted Barry in filing a paternity suit against Chaplin, launching a campaign of attrition against him through her column, and calling for him to be deported for his \"moral turpitude\". She defended her behavior by stating that she wished to make an example of Chaplin as \"a warning to others involved in dubious relationships.\" Her grudge deepened when, later in the year, Chaplin married 18-year old Oona O'Neill and gave the scoop to Louella Parsons out of dislike for Hopper. For years after the paternity trial, Hopper cooperated with the FBI to destabilize Chaplin's career. This involved her printing damaging information leaked by the FBI concerning Chaplin's past Communist affiliations, while Hopper in turn provided the agency with unsavory gossip about Chaplin's personal life gleaned from her informants. Her sustained criticism of Chaplin was one of the factors which contributed to him being denied re-entry to the United States in 1952."]}, {"page": "Mariano Fortuny (designer)", "response": ["His clients were Élisabeth, Countess Greffulhe and her daughter Élaine Greffulhe, Eleonora Duse, Ellen Terry and Oona O'Neill."]}, {"page": "Geraldine Chaplin", "response": ["Geraldine Leigh Chaplin (born July 31, 1944) is an American actress. She is the daughter of Charlie Chaplin, the first of eight children with fourth wife Oona O'Neill. After beginnings in dance and modeling, she turned her attention to acting, and made her English-language acting debut (and came to prominence in what would be a Golden Globe-nominated role) in her portrayal of Tonya in David Lean's Doctor Zhivago (1965). She made her Broadway acting debut in Lillian Hellman's The Little Foxes in 1967, and played the role of ancient Egyptian Queen Nefertiti in Raúl Araiza's Nefertiti and Akhenaton (1973) with Egyptian famous actor Salah Zulfikar. Chaplin received her second Golden Globe nomination for Robert Altman's Nashville (1975). She received a BAFTA nomination for her role in Welcome to L.A. (1976). She played her grandmother Hannah Chaplin in the biopic, Chaplin (1992) for which she received her third Golden Globe nomination.", "Geraldine Leigh Chaplin was born on July 31, 1944, in Santa Monica, California, the fourth child of actor and filmmaker Charlie Chaplin, and the first child of his fourth wife, Oona O'Neill, whom he married in 1943. Charlie Chaplin was 55 when Geraldine Chaplin was born and Oona was 19 years old. Geraldine was the first of their eight children. Her paternal grandparents were English Charles Chaplin Sr. and Hannah Chaplin (born Hannah Harriet Pedlingham Hill), and her maternal grandparents were Nobel- and Pulitzer-Prize-winning American playwright Eugene O'Neill and English-born writer Agnes Boulton."]}, {"page": "Claire Bloom", "response": ["The film had personal meaning for Chaplin as it contained numerous references to his life and family: the theatre where he and Bloom performed in the film was the same theatre where his mother gave her last performance; Bloom was directed by Chaplin to wear dresses similar to those his mother used to wear; Chaplin's sons and his half-brother all had parts. Bloom states that she felt one of the reasons she got the part was because she closely resembled his young wife, Oona O'Neill. In his autobiography, Chaplin writes that he had no doubt the film would be a success: \"I had fewer qualms about its success than any picture I had ever made.\" Chaplin explains his decision to make Bloom co-star despite this being her first film:"]}, {"page": "Moira Kelly", "response": ["Moira Kelly (born March 6, 1968) is an American actress. She is known for portraying Kate Moseley in the 1992 film The Cutting Edge as well as single mother Karen Roe on the teen drama One Tree Hill. She is also known for playing the role of Donna Hayward in Twin Peaks: Fire Walk with Me, replacing Lara Flynn Boyle in the prequel to the 1990 TV series Twin Peaks. Other roles include Dorothy Day in Entertaining Angels: The Dorothy Day Story, White House media consultant Mandy Hampton in the first season of The West Wing, and the voice of Simba's love interest Nala in The Lion King and its direct-to-video sequels The Lion King II: Simba's Pride and The Lion King 1½. She also played Hetty Kelly and Oona O'Neill in Chaplin.", "|Hetty Kelly / Oona O'Neill"]}, {"page": "Little Tramp", "response": ["Little Tramp received its first staging in 1995 at the prestigious Eugene O'Neill Theater Festival in Waterford, Connecticut (Eugene O'Neill having been the father of Chaplin's wife, Oona O'Neill). The following year, a concert version was presented in St. Petersburg, Russia to inaugurate the world's first East/West Musical Theater Conference."]}, {"page": "Christopher Chaplin", "response": ["Christopher James Chaplin (born 8 July 1962) is a Swiss-born English composer and actor. He is the youngest son of film comedian Charlie Chaplin and his fourth wife Oona O'Neill.", "Christopher Chaplin was born on 8 July 1962 at Clinique de Mont Choisi in Lausanne, Switzerland. He is the youngest child of film actor Charlie Chaplin and his fourth wife Oona O'Neill: when Chaplin was born, his father was 73 years old. Chaplin's father died in 1977, when he was aged 15."]}, {"page": "Josephine Chaplin", "response": ["Josephine Hannah Chaplin (born March 28, 1949) is an American actress and the daughter of filmmaker Charlie Chaplin and his fourth wife, Oona O'Neill. She had a featured role in Pier Paolo Pasolini's The Canterbury Tales (1972) as May, the adulterous wife of the elderly Sir January."]}, {"page": "Michael Chaplin (actor)", "response": ["Michael John Chaplin (born March 7, 1946) is an American actor born in Santa Monica, California. He is the second child and eldest son from Charlie Chaplin's fourth and final marriage to Oona O'Neill."]}, {"page": "Charles Chaplin Jr.", "response": ["Chaplin was born in Beverly Hills, California. He was the elder son of actors Charlie Chaplin and Lita Grey. His half-siblings from his father's last marriage to Oona O'Neill are Geraldine, Michael, Josephine, Victoria, Eugene, Jane, Annette, and Christopher. His elder half-brother Norman died as an infant."]}, {"page": "July 1944", "response": ["*Born: Geraldine Chaplin, actress and daughter of Charlie Chaplin and Oona O'Neill, in Santa Monica, California; Robert C. Merton, economist and Nobel laureate, in New York City"]}, {"page": "Sydney Chaplin (American actor)", "response": ["Born in 1926 in Beverly Hills, California, Chaplin was the second son of Charlie Chaplin and Lita Grey. His parents had married in November 1924 when Lita became pregnant with Sydney's elder brother Charles. Sydney was born five weeks prematurely, 10 months after the birth of his older brother. He was named for his father's half-brother, Sydney Chaplin. His parents divorced a year after his birth. The boys later had eight half-siblings from their father's fourth marriage to Oona O'Neill."]}, {"page": "Bad (tour)", "response": ["Jackson began his European tour in Rome at the Flaminio Stadium on May 23, 1988. Police and security guards rescued hundreds of fans from being crushed in the crowd of 35,000. Police reported 130 women fainted at the concert in Vienna on June 2. On June 17, Jackson travelled to the town of Vevey to meet Oona O'Neill, the widow of comic actor Charlie Chaplin. \"I have fulfilled my biggest childhood dream\", said Jackson after the visit. The most successful of the European dates were those in London at Wembley Stadium. Ticket demand for the five July dates exceeded 1.5 million, enough to fill the 72,000 capacity venue 20 times.Campbell 1993, p. 216. Jackson performed seven sold out shows, beating the previous record held by Madonna, Bruce Springsteen and Genesis. More shows could have been added, but the venue had reached its quota for live performances. The third concert on July 16 was attended by Diana, Princess of Wales and Prince Charles.Campbell 1993, p. 217. On September 8, Jackson was entered into the Guinness World Records, the first of three times from the tour alone. The Wembley shows were attended by a record 504,000 people. Management also presented him with a special award.Halstead 2003, p. 80. On July 30, NBC aired Michael Jackson Around the World, a 90-minute special documenting the singer on tour. On August 29, after a birthday performance in Leeds, Jackson donated $130,000 to Give For Life. The final European show was held in Liverpool on September 11, staged at Aintree Racecourse. 1,550 fans were reported injured among the crowd of 125,000."]}, {"page": "Victoria Chaplin", "response": ["Victoria Thierrée-Chaplin (born May 19, 1951) is a British-American circus performer. She is the daughter of film actor and comedian Charlie Chaplin from his fourth wife, Oona O'Neill, and the granddaughter of playwright Eugene O'Neill."]}, {"page": "Hollywood Canteen", "response": ["*Oona O'Neill"]}, {"page": "Oona O'Neill Chaplin", "response": ["#REDIRECT Oona O'Neill"]}, {"page": "Woodbury Soap Company", "response": ["In 1936, Woodbury was one of the first companies to use nudity in its advertisements. The ad, known as \"The Sun Bath\", was photographed by Edward Steichen and showed a nude woman lying on stairs on her side with her back to the camera. The text advertised that Woodbury Soap was now enriched with \"filter sunshine\". Several celebrities also appeared in advertisements for Woodbury Soap. In 1938, debutante Brenda Frazier appeared in and for the company's soap which included a testimonial from the gossip columnist who was largely responsible for her fame, Cholly Knickerbocker). Future actress Oona O'Neill, who was then known as \"New York's No. 1 \"Deb\", appeared in ads for the company's soap in 1943. In the 1940s and 1950s, actresses  Lucille Ball, Virginia Bruce, Leslie Caron, Linda Darnell, Gloria De Haven, Ava Gardner, Judy Garland, Veronica Lake, Myrna Loy, Marie McDonald, Merle Oberon, Donna Reed, Elizabeth Taylor (who also appeared in ads for the company's soap) Gene Tierney, and Esther Williams also appeared in ads for the company's cosmetics line."]}]}}