{"wiki_id": "http://www.wikidata.org/entity/Q1376016", "itemLabel": "Richard Overy", "itemDescription": "British historian", "wikipedia_url": "https://en.wikipedia.org/wiki/Richard_Overy", "wikipedia_page": {"main": "Richard James Overy,  (born 23 December 1947) is a British historian who has published on the history of World War II and Nazi Germany. In 2007, as The Times editor of Complete History of the World, he chose the 50 key dates of world history.", "link_mentions": [{"page": "Battle of Stalingrad", "response": ["A significant historical debate concerns the degree of terror in the Red Army. The British historian Antony Beevor noted the \"sinister\" message from the Stalingrad Front's Political Department on 8 October 1942 that: \"The defeatist mood is almost eliminated and the number of treasonous incidents is getting lower\" as an example of the sort of coercion Red Army soldiers experienced under the Special Detachments (later to be renamed SMERSH). On the other hand, Beevor noted the often extraordinary bravery of the Soviet soldiers in a battle that was only comparable to Verdun, and argued that terror alone cannot explain such self-sacrifice. Richard Overy addresses the question of just how important the Red Army's coercive methods were to the Soviet war effort compared with other motivational factors such as hatred for the enemy. He argues that, though it is \"easy to argue that from the summer of 1942 the Soviet army fought because it was forced to fight,\" to concentrate solely on coercion is nonetheless to \"distort our view of the Soviet war effort.\"Overy, Richard. Russia's War (New York: 1997), 201. After conducting hundreds of interviews with Soviet veterans on the subject of terror on the Eastern Front – and specifically about Order No. 227 (\"Not a step back!\") at Stalingrad – Catherine Merridale notes that, seemingly paradoxically, \"their response was frequently relief.\" Infantryman Lev Lvovich's explanation, for example, is typical for these interviews; as he recalls, \"[i]t was a necessary and important step. We all knew where we stood after we had heard it. And we all – it's true – felt better. Yes, we felt better.\""]}, {"page": "Blitzkrieg", "response": ["Other historians wrote that blitzkrieg was an operational doctrine of the German armed forces and a strategic concept on which the leadership of the Third Reich based its strategic and economic planning. Military planners and bureaucrats in the war economy appear rarely, if ever, to have employed the term blitzkrieg in official documents. That the German army had a \"blitzkrieg doctrine\" was rejected in the late 1970s by Matthew Cooper. The concept of a blitzkrieg Luftwaffe was challenged by Richard Overy in the late 1970s and by Williamson Murray in the mid-1980s. That the Third Reich went to war on the basis of \"blitzkrieg economics\" was criticised by Richard Overy in the 1980s and George Raudzens described the contradictory senses in which historians have used the word. The notion of a German blitzkrieg concept or doctrine survives in popular history and many historians still support the thesis.", "After the war, Albert Speer claimed that the German economy achieved greater armaments output, not because of diversions of capacity from civilian to military industry but through streamlining of the economy. Richard Overy pointed out some 23 percent of German output was military by 1939. Between 1937 and 1939, 70 percent of investment capital went into the rubber, synthetic fuel, aircraft and shipbuilding industries. Hermann Göring had consistently stated that the task of the Four Year Plan was to rearm Germany for total war. Hitler's correspondence with his economists also reveals that his intent was to wage war in 1943–1945, when the resources of central Europe had been absorbed into the Third Reich."]}, {"page": "Joachim von Ribbentrop", "response": ["On the morning of 3 September 1939, Chamberlain followed through with his threat of a British declaration of war if Germany attacked Poland, a visibly-shocked Hitler asked Ribbentrop \"Now what?\", a question to which Ribbentrop had no answer except to state that there would be a \"similar message\" forthcoming from French Ambassador Robert Coulondre, who arrived later that afternoon to present the French declaration of war.Bloch, p. 260. Weizsäcker later recalled, \"On 3 Sept., when the British and French declared war, Hitler was surprised, after all, and was to begin with, at a loss\". The British historian Richard Overy wrote that what Hitler thought he was starting in September 1939 was only a local war between Germany and Poland and that his decision to do so was largely based on a vast underestimate of the risks of a general war.Overy, pp. 125–126, in The Third Reich. Ribbentrop's influence caused it to have been often observed that Hitler went to war in 1939 with the country he wanted as his ally, the United Kingdom, as his enemy and the country he wanted as his enemy, the Soviet Union, as his ally.Rees, p. 87."]}, {"page": "Martin Bormann", "response": ["Richard Overy describes Bormann as an atheist."]}, {"page": "Nazi Germany", "response": ["Estimates of the total German war dead range from 5.5 to 6.9 million persons. A study by German historian Rüdiger Overmans puts the number of German military dead and missing at 5.3 million, including 900,000 men conscripted from outside of Germany's 1937 borders. Richard Overy estimated in 2014 that about 353,000 civilians were killed in Allied air raids. Other civilian deaths include 300,000 Germans (including Jews) who were victims of Nazi political, racial, and religious persecution and 200,000 who were murdered in the Nazi euthanasia program. Political courts called Sondergerichte sentenced some 12,000 members of the German resistance to death, and civil courts sentenced an additional 40,000 Germans. Mass rapes of German women also took place.", "The Nazi war economy was a mixed economy that combined a free market with central planning. Historian Richard Overy describes it as being somewhere in between the command economy of the Soviet Union and the capitalist system of the United States."]}, {"page": "Battle of Britain", "response": ["Richard Overy agrees with Dye and Bungay. Overy asserts only one airfield was temporarily put out of action and \"only\" 103 pilots were lost. British fighter production produced 496 new aircraft in July and 467 in August, and another 467 in September (not counting repaired aircraft), covering the losses of August and September. Overy indicates the number of serviceable and total strength returns reveal an increase in fighters from 3 August to 7 September, 1,061 on strength and 708 serviceable to 1,161 on strength and 746 serviceable. Moreover, Overy points out that the number of RAF fighter pilots grew by one-third between June and August 1940. Personnel records show a constant supply of around 1,400 pilots in the crucial weeks of the battle. In the second half of September it reached 1,500. The shortfall of pilots was never above 10%. The Germans never had more than between 1,100 and 1,200 pilots, a deficiency of up to one-third. \"If Fighter Command were 'the few', the German fighter pilots were fewer\"."]}, {"page": "Flight and expulsion of Germans (1944–1950)", "response": ["Richard Overy cites an approximate total of 7.5 million Germans evacuated, migrated, or expelled from Poland between 1944 and 1950.Overy, ibid. as: from East Prussia – 1.4 million to West Germany, 609,000 to East Germany; from West Prussia – 230,000 to West Germany, 61,000 to East Germany; from the former German provinces east of the Oder-Neisse line, encompassing most of Silesia, Pomerania and East Brandenburg – 3.2 million to West Germany, 2 million to East Germany. Tomasz Kamusella cites estimates of 7 million expelled in total during both the \"wild\" and \"legal\" expulsions from the recovered territories from 1945 to 1948, plus an additional 700,000 from areas of pre-war Poland."]}, {"page": "Bombing of Dresden in World War II", "response": ["During the Yalta Conference on 4 February, the Deputy Chief of the Soviet General Staff, General Aleksei Antonov, raised the issue of hampering the reinforcement of German troops from the western front by paralyzing the junctions of Berlin and Leipzig with aerial bombardment. In response, Portal, who was in Yalta, asked Bottomley to send him a list of objectives to discuss with the Soviets. Bottomley's list included oil plants, tank and aircraft factories and the cities of Berlin and Dresden. However according to Richard Overy, the discussion with the Soviet Chief of Staff, Aleksei Antonov, recorded in the minutes, only mentions the bombing of Berlin and Leipzig. The bombing of Dresden was a Western plan, but the Soviets were told in advance about the operation."]}, {"page": "Bushido", "response": ["During interbellum and Second World War Shōwa Japan, bushido was pressed into use for militarism\"No Surrender: Background History \" to present war as purifying, and death a duty.David Powers, \"Japan: No Surrender in World War Two \" Bushido was pitched as revitalizing traditional values and \"transcending the modern\".John W. Dower, War Without Mercy:  Race & Power in the Pacific War p1  Bushido would provide a spiritual shield to let soldiers fight to the end.Richard Overy, Why the Allies Won p 6  When giving orders, General Hideki Tojo routinely slapped the faces of the men under his command, saying face-slapping was a \"means of training\" men who came from families that were not part of the samurai caste, and for whom bushido was not second nature. Tojo wrote a chapter in the book Hijōji kokumin zenshū (Essays in time of national emergency) which the Army Ministry published in March 1934. It called for Japan to become a totalitarian \"national defense state\". It included 15 essays by senior generals and argued Japan defeated Russia in the Russo–Japanese War because bushido gave the Japanese superior willpower: they did not fear death, unlike the Russians who wanted to live."]}, {"page": "Lebensraum", "response": ["As official policy,  Heinrich Himmler said that no drop of German blood would be lost or left behind to mingle with any alien races;Richard Overy, The Dictators: Hitler's Germany, Stalin's Russia, p 543  and that the Germanisation of Eastern Europe would be complete when \"in the East dwell only men with truly German [and] Germanic blood\".Mark Mazower, Hitler's Empire: How the Nazis Ruled Europe, p. 181. In the secret memorandum Reflections on the Treatment of Peoples of Alien Races in the East (25 May 1940) Himmler outlined the future of the Eastern European peoples; (i) division of native ethnic groups found in the new living-space; (ii) limited, formal education of four years of elementary school (to teach them only how to write their names and to count to five hundred), and (iii) obey the orders of Germans.Himmler, Heinrich. (25 May 1940). Reflections on the Treatment of Peoples of Alien Races in the East. Trials of War Criminals Before the Nuernberg Military Tribunals Under Control Council Law (US Government Printing Office, District of Columbia). pp. 147–150, No. 10. Vol. 13. Nonetheless, despite Nazi Germany's official racism, the extermination of the native populations of the countries of Eastern Europe was not always necessary, because the Racial policy of Nazi Germany regarded some Eastern European peoples as being of Aryan-Nordic stock, especially the local leaders.Hitler's plans for Eastern Europe On March 4, 1941, Himmler introduced the German People's List (), the purpose of it being to segregate the inhabitants of German-occupied territories into categories of desirability according to criteria.Richard Overy, The Dictators: Hitler's Germany, Stalin's Russia, p. 543–4  In the same memorandum, Himmler advocated the kidnapping of children who appeared to be Nordic because it would \"remove the danger that this subhuman people () of the East through such children might acquire a leader class from such people of good blood, which would be dangerous for us because they would be our equals.\"Vejas Gabriel Liulevicius. The German Myth of the East: 1800 to the Present. Oxford: Oxford University Press, 2011, p. 187Lynn H. Nicholas. Cruel World: The Children of Europe in the Nazi Web. New York: Vintage, 2006, p. 241. According to Himmler, the destruction of the Soviet Union would have led to the exploitation of millions of peoples as slave labor in the occupied territories and the eventual re-population of the areas with Germans.Peter Longerich Heinrich Himmler: A Life (2012), p. 515"]}, {"page": "List of historians", "response": ["*Richard Overy (born 1947), World War II"]}, {"page": "A. J. P. Taylor", "response": ["Alan John Percivale Taylor  (25 March 1906 – 7 September 1990) was a British historian who specialised in 19th- and 20th-century European diplomacy. Both a journalist and a broadcaster, he became well known to millions through his television lectures. His combination of academic rigour and popular appeal led the historian Richard Overy to describe him as \"the Macaulay of our age\". In a 2011 poll by History Today magazine, he was named the fourth most important historian of the previous 60 years."]}, {"page": "Munich Agreement", "response": ["Though the British and French were pleased, a British diplomat in Berlin claimed he had been informed by a member of Hitler's entourage that soon after the meeting with Chamberlain Hitler had furiously said: \"Gentlemen, this has been my first international conference and I can assure you that it will be my last\". On another occasion, he had been heard saying of Chamberlain: \"If ever that silly old man comes interfering here again with his umbrella, I'll kick him downstairs and jump on his stomach in front of the photographers.\"Richard Overy, 'Germany, \"Domestic Crisis\" and War in 1939', Past & Present No. 116 (Aug., 1987), p. 163, n. 74.Robert Rothschild, Peace For Our Time (Brassey's Defence Publishers, 1988), p. 279. In one of his public speeches after Munich, Hitler declared: \"Thank God we have no umbrella politicians in this country\".Roger Parkinson, Peace For Our Time: Munich to Dunkirk—The Inside Story (London: Hart-Davis, 1971), p. 78."]}, {"page": "Diplomatic history", "response": ["A notable example of the Primat der Innenpolitik approach was the claim by the British Marxist historian Timothy Mason who claimed that the launch of World War II in 1939 was best understood as a “barbaric variant of social imperialism”.Kaillis, Aristotle Fascist Ideology, London: Routledge, 2000  page 7 Mason argued that “Nazi Germany was always bent at some time upon a major war of expansion”.Kaillis, Aristotle Fascist Ideology, London: Routledge, 2000  page 165 However, Mason argued that the timing of such a war was determined by domestic political pressures, especially as relating to a failing economy, and had nothing to do with what Hitler wanted. In Mason's view in the period between 1936 and 1941, it was the state of the German economy, and not Hitler's \"will\" or \"intentions\" that was the most important determinate on German decision-making on foreign policy.Kershaw, Ian The Nazi Dictatorship London : Arnold 2000 page 88. Mason argued that the Nazi leaders were deeply haunted by the November Revolution of 1918, and was most unwilling to see any fall in working class living standards out of the fear that it might provoke another November Revolution. According to Mason, by 1939, the “overheating” of the German economy caused by rearmament, the failure of various rearmament plans produced by the shortages of skilled workers, industrial unrest caused by the breakdown of German social policies, and the sharp drop in living standards for the German working class forced Hitler into going to war at a time and place not of his choosing.Kaillis, Aristotle Fascist Ideology, London: Routledge, 2000  pages 165-166 Mason contended that when faced with the deep socio-economic crisis the Nazi leadership had decided to embark upon a ruthless “smash and grab” foreign policy of seizing territory in Eastern Europe which could be pitilessly plundered to support living standards in Germany.Kaillis, Aristotle Fascist Ideology, London: Routledge, 2000  page 166 Mason's theory of a \"Flight into war\" being imposed on Hitler generated much controversy, and in the 1980s he conducted a series of debates with economic historian Richard Overy over this matter.  Overy maintained the decision to attack Poland was not caused by structural economic problems, but rather was the result of Hitler wanting a localized war at that particular time in history. For Overy, a major problem with the Mason thesis was that it rested on the assumption that in a way unrecorded by the records, that information was passed on to Hitler about the Reich economic problems.Mason, Tim & Overy, R.J. “Debate: Germany, `domestic crisis’ and the war in 1939” from The Origins of The Second World War edited by Patrick Finney, Edward Arnold: London, United Kingdom, 1997 page 102 Overy argued that there was a major difference between economic pressures inducted by the problems of the Four Year Plan, and economic motives to seize raw materials, industry and foreign reserve of neighboring states as a way of accelerating the Four Year Plan.Overy, Richard “Germany, ‘Domestic Crisis’ and War in 1939” from The Third Reich edited by Christian Leitz,  Blackwell: Oxford, 1999 pages 117-118 Moreover, Overy asserted that the repressive capacity of the German state as a way of dealing with domestic unhappiness was somewhat downplayed by Mason."]}, {"page": "World War II casualties", "response": ["|| 3,760,000 to 4,456,000|| 353,000(1942 borders)Richard Overy,  The Bombers and the Bombed: Allied Air War Over Europe 1940–1945 (2013) pp. 304–7 (Overy noted that \"No doubt this does not include all those who were killed or died of wounds, but it does include uniformed personnel, POWs, and foreign workers, and it applies to the Greater German area\". Using the United States Strategic Bombing Survey data Overy calculated an average monthly death toll of 18,777 from September 1944 to January 1945, taking this monthly average he estimated losses of 57,000 from February to April 1945 to which he adds an additional 25,000 killed in Dresden for total deaths of 82,000 from February to April 1945. The figures up until the end of January 1945 of 271,000 and the 82,000 from February to April 1945 give an overall figure of 353,000 air war deaths. Overy summarizes: \"Detailed reconstruction of deaths caused by the Royal Air Force bombing from February to May 1945, though incomplete, suggests a total of at least 57,000. If casualties inflicted by the American air forces are assumed to be lower, since their bombing was less clearly aimed at cities, an overall death toll of 82,000 is again statistically realistic. In the absence of unambiguous statistical evidence, the figure of 353,000 gives an approximate scale consistent with the evidence\".) to 410,000Wirtschaft und Statistik October 1956|| 300,000Germany reports. With an introd. by Konrad Adenauer. Germany (West). Presse- und Informationsamt. Wiesbaden, Distribution: F. Steiner, 1961, pp. 31–33 (figure includes 170,000 German Jews). The West German government did not list euthanasia victims along with the war dead. to 500,000Germany reports. With an introd. by Konrad Adenauer. Germany (West). Presse- und Informationsamt. Wiesbaden, Distribution: F. Steiner, 1961 pp. 31–33 (they give figure of 300,00 German deaths due to racial, religious and political persecution including 170,000 Jews. Figure does not include the Nazi euthanasia programBundesarchiv Euthanasie\" im Nationalsozialismus  2003 report by German Federal Archive puts the dead toll in the Nazi euthanasia program at over 200,000 || 400,000German Federal Archive, Siegel, Silke Vertreibung und Vertreibungsverbrechen 1945–1948. Bericht des Bundesarchivs vom 28. Mai 1974. Archivalien und ausgewählte Erlebnisberichte. Bonn 1989 P.41(100,000 during wartime flight; 200,000 in USSR as forced labor and 100,000 in internment camps) to 1,225,000|| 5,700,000Wirtschaft und Statistik October 1956, Journal published by Statistisches Bundesamt Deutschland. (German government Statistical Office)||  8.23", "#:(a) Official German and Austrian sources from the 1950s cite 434,000 air raid dead (410,000 in Germany, 24,000 in) AustriaStatistisches Jahrbuch für die Bundesrepublik Deutschland 1960 Bonn 1961 p. 78, available online at . The figure cited by Overy (2013) is 353,000 air raid dead.Richard Overy,  The Bombers and the Bombed: Allied Air War Over Europe 1940–1945 (2013) pp. 304–7", "* Historian Richard Overy in 2014 published a study of the air war The Bombers and the Bombed: Allied Air War Over Europe 1940–1945 in which he disputed the official German figures of air war dead. He estimated total air raid deaths at 353,000. Overy maintains that the German estimates are based on incorrect speculations for losses during the last three months of the war when there was a gap in the record keeping system. He points out that the figures for air raid dead in the last three months of the war were estimated in the West German figures from 1956 at 300,000 people which he believes is not plausible. The official figures include an inflated total of 60,000 in the Bombing of Dresden and the inclusion of refugees fleeing westward."]}, {"page": "History of Berlin", "response": ["*March 1945: The RAF begins 36 consecutive nights of bombing by its fast de Havilland Mosquito medium bombers (from around 40 to 80 each night). British bombers dropped 46,000 tons of bombs; the Americans dropped 23,000 tons. By May 1945, 1.7 million people (40%) had fled.Richard Overy, The Bombers and the Bombed: Allied Air War Over Europe 1940-1945 (2014) pp 301, 304"]}, {"page": "Melodrama", "response": ["* Politics at the time calls on melodrama to articulate a world-view.  Thus Richard Overy argues that 1930s Britain saw civilization as melodramatically under threat -  \"In this great melodrama Hitler's Germany was the villain; democratic civilization the menaced heroine\";Quoted in J. Rose, The Literary Churchill (Yale 2015) p. 291 - while Winston Churchill provided the necessary larger-than-life melodramatic hero to articulate back-to-the-wall resistance during The Blitz.J. Webb, I Heard My Country Calling (2014) p. 68"]}, {"page": "The Annual Register", "response": ["The Annual Register begins with an overview of the year, a thought-provoking essay by an established modern historian. In recent years, the authors of this article have included Paul Rogers, Anatol Lieven, Philip M.H. Bell, M.R.D. Foot, Richard Overy, and J.M. Roberts. There then follow articles on each country (or group of countries) in the world, ranging from a few hundred to 10,000 words in length. The second half of the book contains articles on major international and regional organisations, and essays on various topics. These include developments in the international economy, science and the environment, law and religion, and the arts and sport. The final sections of the book contain selected documents and statistics, an obituary section, and a day-by-day chronicle of the year’s events. A number of maps and colour photographs are included to illustrate the year’s key stories."]}]}}