{"wiki_id": "http://www.wikidata.org/entity/Q1375864", "itemLabel": "Robert Wight", "itemDescription": "Scottish botanist (1796-1872)", "wikipedia_url": "https://en.wikipedia.org/wiki/Robert_Wight", "wikipedia_page": {"main": "Robert Wight MD FRS FLS (6 July 1796 – 26 May 1872) was a Scottish surgeon in the East India Company, whose professional career was spent entirely in southern India, where his greatest achievements were in botany – as an economic botanist and leading taxonomist in south India. He contributed to the introduction of American cotton. As a taxonomist he described 110 new genera and 1267 new species of flowering plants. He employed Indian botanical artists to illustrate many plants collected by himself and Indian collectors he trained. Some of these illustrations were published by William Hooker in Britain, but from 1838 he published a series of illustrated works in Madras including the uncoloured, six-volume Icones Plantarum Indiae Orientalis (1838–53) and two hand-coloured, two-volume works, the Illustrations of Indian Botany (1838–50) and Spicilegium Neilgherrense (1845–51). By the time he retired from India in 1853 he had published 2464 illustrations of Indian plants. The standard author abbreviation Wight is used to indicate this person as the author when citing a botanical name.\n\n", "link_mentions": [{"page": "WT", "response": ["* Robert Wight (1796–1872), in botanical taxonomy, abbreviated Wt"]}, {"page": "Thomas C. Jerdon", "response": ["His work on the reptiles of India was not completed and it was only after his death that the proofs were sent to his home. In 1874 several volumes with his original drawings of reptiles were auctioned by Messrs. Sotheby, Wilkinson and Hodge. Some of these illustrations were purchased by Lord Lilford. Apart from zoology, he also took an interest in botany, although he did not publish on the topic and instead communicated notes to botanists such as Robert Wight. Wight notes that:"]}, {"page": "Nathaniel Wallich", "response": ["The three volumes of Plantae Asiaticae Rariores made use of artists employed by the Calcutta Botanic Garden: 146 drawings by Gorachand, 109 by Vishnupersaud and one work by Rungiah (the artist employed by Robert Wight); the rest of the plates were by John Clark and three by William Griffith. Two hundred and fifty copies of the work were printed, of which 40 were purchased by the East India Company.Desmond, Ray 1994. The European Discovery of the Indian Flora. Oxford University Press."]}, {"page": "Robert White", "response": ["* Robert Wight (1796–1872), Scottish surgeon and botanist"]}, {"page": "Indian natural history", "response": ["The forests of India were some of the richest resources in the British colonies. The value of forests was realised very early and forest management was introduced early on the sub-continent. The links between water, climate and forest cover were noted particularly early and warnings on deforestation were sounded as early as 1840 by surgeons in the East India Company like Edward Balfour.Grove, Richard. 1995 Green Imperialism: Colonial Expansion, Tropical Island Edens and the Origins of Environmentalism, 1600–1860. Cambridge University Press.  This was to lead to forest conservation measures although the later policies of forest management were aimed at the production of commercial products such as teak timber. The post of a conservationist was created and this term was related to the patches of forests that they managed, called conservancies, and was not related to biodiversity conservation. Even today, vast tracts of Indian forests are covered with teak plantations, low in biodiversity and seasonally ravaged by forest fires. The first foresters in India were highly influenced by forest management in Germany and many forest officers in India were trained in the German school of thought brought into India by Dietrich Brandis (1824–1907)-the father of tropical forestry.Barton, Gregory Allen (2002) Empire Forestry and the Origins of Environmentalism. Cambridge University Press  Numerous officers including James Sykes Gamble (1847–1925), Alexander Gibson and Hugh Francis Cleghorn in the Indian Forest service added information on the flora of India. Several amateurs also worked alongside from other civil services and they were assisted by professional botanists such as Joseph Dalton Hooker (1817–1911), John Gerard Koenig (1728–1785), Robert Wight (1796–1872), Nathaniel Wallich (1786–1854) and William Roxburgh (1751–1815), the Father of Indian Botany.Bole, P. V. 1976. Review of Flora Indica or Descriptions of Indian Plants by William Roxburgh, William Carey. The Quarterly Review of Biology. 51(3):442–443 Another area of interest was the introduction of plants of economic importance to India. Many of these introductions were tried in botanical gardens at Sibpur, Poona, Madras and Saharanpur.Sharma, Jayeeta (2006) British science, Chinese skill and Assam tea: Making empire's garden. Indian Economic and Social History Review 43; 429 The Chinese monopoly on tea was ended when tea was introduced in Darjeeling and Sri Lanka through the work of Robert Fortune (1812–1880). The botanical garden at Sibpur in Calcutta was started in 1787 by Col. Robert Kyd (1746–1793). Sir George King (1840–1904) who was in charge of the garden from 1871 was instrumental in the creation of a herbarium at the garden and founded the Botanical Survey of India in 1890. Later botanical workers include the paleobotanist Birbal Sahni (1891–1949).", "File:RobertWight.jpg|Robert Wight (1796–1872)"]}, {"page": "Silent Valley National Park", "response": ["Silent Valley National Park is a national park in Kerala, India. It is located in the Nilgiri hills, has a core area of , which is surrounded by a buffer zone of . This national park has some rare species of flora and fauna. This area was explored in 1847 by the botanist Robert Wight. It is located in the border of Mannarkkad Taluk of Palakkad district, Nilambur Taluk of Malappuram district, Kerala, and Nilgiris district of Tamil Nadu.", "The first Western investigation of the watersheds of the Silent Valley area was in 1857 by the botanist Robert Wight. The British named the area Silent Valley because of a perceived absence of noisy cicadas. Another story attributes the name to the anglicisation of Sairandhri. A third story refers to the presence of many lion-tailed macaques Macaca silenus. "]}, {"page": "Ipsea", "response": ["A similar species was found by Jerdon and was doubtfully considered as a new species by Robert Wight. This was later described as Ipsea malabarica, restricted to Silent Valley in northern Kerala. This endangered species with a very narrow distribution range grows on steep mountain slopes in moist rocky and sunny areas in association with Tripogon bromoides, "]}, {"page": "George Arnott Walker-Arnott", "response": ["Walker-Arnott became a botanist, holding the position of Regius Professor of Botany in the University of Glasgow from 1845 to 1868. He studied the botany of North America with Sir William Hooker and collaborated with Robert Wight in studies of Indian botany."]}, {"page": "List of authors of South African botanical taxa", "response": ["*Robert Wight (1796–1872) S ........ Wight"]}, {"page": "Sispara", "response": ["Robert Wight, a surgeon turned botanist, ventured into this area in the middle of the 19th century. In the process, Wight discovered seven new species from Sispara and the adjoining jungles and as many as 122 Indian plants have been named after him.\"Silent Valley: Trekking through the Amazon of India\" Corporate House Journal of Indian Oil Corporation Limited Vol. XXXXI No. 8 August 2004 Silent Valley: Trekking through the Amazon of India "]}, {"page": "Millettia", "response": ["In 1834, in Prodromus Florae Peninsulae Indiae Orientalis Robert Wight and George Arnott Walker-Arnott describe Millettia as:", "In the 1820s-1830s Charles Millett, a plant collector and an official with the East India Company, collected many samples of Millettia while living in Canton and Macao. He sent them to the University of Glasgow's Botanical Garden. In 1834, Robert Wight and George Arnott Walker-Arnott, both Scottish botanists, published Prodromus Florae Peninsulae Indiae Orientalis where the genus Millettia is first mentioned. The authors named the genus after Charles Millett, incorrectly referring to him as Dr. Charles Millett. Charles Millett of the East India Company has often been confused with Charles Millet, a French ichthyologist, who was active around the same time. In addition J. A. Millet, a French botanist from the 18th century, is often misattributed as the source."]}, {"page": "Elaeocarpus munroi", "response": ["Elaeocarpus munroi is a species of flowering plant in the Elaeocarpaceae family and is endemic to India. It was first formally described in 1838 by Robert Wight who gave it the name Monocera munroii in his book Illustrations of Indian Botany. In 1874, Maxwell T. Masters changed the name to Elaeocarpus munroi in the Hooker's Flora of British India. The specific epithet (munroi) honours the botanist, William Munro.", "Category:Taxa named by Robert Wight"]}]}}