{"wiki_id": "http://www.wikidata.org/entity/Q1370451", "itemLabel": "Kyel Reid", "itemDescription": "British footballer (born 1987)", "wikipedia_url": "https://en.wikipedia.org/wiki/Kyel_Reid", "wikipedia_page": {"main": "Kyel Romane Reid (born 26 November 1987) is an English professional footballer who plays as a winger for Cray Wanderers.", "link_mentions": [{"page": "West Ham United F.C. Under-23s and Academy", "response": ["| Kyel Reid || FW || 9 || 1 ||  Billericay Town ||  Deptford || || Age 18 vs. West Bromwich Albion, Premier League, 1 May 2006 || align=\"center\"| Alan Pardew", "*Kyel Reid – England U17/U18/U19 International"]}, {"page": "Tony Stokes", "response": ["Stokes came up through the West Ham United academy along with Mark Noble and Kyel Reid. He made his first team debut and only appearance for West Ham at the age of 18 in September 2005 as a replacement for Tomáš Řepka in the League Cup match against Sheffield Wednesday."]}, {"page": "Dimitrios Konstantopoulos", "response": ["Three days after returning to Coventry, Konstantopoulos was again loaned out, this time to Swansea's local rivals Cardiff City until the end of the season as cover for Finland international Peter Enckelman who was ruled out for up to two months after undergoing knee surgery. With second choice goalkeeper Tom Heaton also being ruled out through injury, Konstantopoulos was handed his debut on 22 February against Wolverhampton Wanderers, a match which ended in a 2–2 draw after Konstantopoulos scored an own goal after dropping a cross from Wolves midfielder Kyel Reid into his own net. Konstantopoulos remained in goal for the following games, but made another error in a 2–0 defeat to Norwich City, when he failed to clear a long pass and was tackled by Dave Mooney to concede the first goal of the game. After Konstantopoulos suffered a foot injury in March, Cardiff manager Dave Jones signed Stuart Taylor on loan from Aston Villa; although Konstantopoulos remained with Cardiff for the rest of the season, he did not play again for the club, and he returned to Coventry at the end of the season having made a total of six appearances."]}, {"page": "John McGreal", "response": ["Needing to find a new goalscorer for the 2017–18 season, McGreal signed Mikael Mandron from Wigan Athletic for an undisclosed fee. He also brought in goalkeeper Rene Gilmartin and midfielder Ryan Jackson. He made a series of loan signings to bolster the squad, which included the arrivals of Ryan Inniss, Brandon Comley, Kyel Reid and Brandon Hanlan. Colchester got off to a poor start, but improved and collected ten points from five games to earn McGreal another Manager of the Month nomination in October. The young side's good form continued into December, where they picked up 11 points from a possible 15 to earn him yet another Manager of the Month nomination. However they struggled in the second half of the campaign, despite holding on to top-scorer Sammie Szmodics in the January transfer window, and ended the season in 13th-place. McGreal released four senior players and seven from the U-23 team. Sam Walker and Sean Murray also departed after failing to agree new deals."]}, {"page": "List of Bradford City A.F.C. players", "response": ["|Kyel Reid||||2011–2014, 2015–2016||131||12||"]}, {"page": "2008 MLS All-Star Game", "response": ["|MF ||28|| Kyel Reid || || "]}, {"page": "2008–09 West Ham United F.C. season", "response": ["||MF||28||||data-sort-value=\"Reid, Kyel\"|Kyel Reid||0||0||1||1"]}, {"page": "Kyle Reid", "response": ["#REDIRECT Kyel Reid"]}, {"page": "2008–09 Blackpool F.C. season", "response": ["|align=\"left\"|20||align=\"left\"|MF||align=\"left\"| Kyel Reid", "| 27 November 2008 || W ||  || Kyel Reid || West Ham United || 30 December 2008 || "]}, {"page": "2009–10 West Ham United F.C. season", "response": ["|MF|| Kyel Reid ||  Sheffield United || Free || 1 July 2009 ||"]}, {"page": "Marvin Sordell", "response": ["He made his debut on 6 August as the season began with a 1–0 loss at Swindon Town, in which he was substituted at half time for Kyel Reid. On 10 September, he scored his first goal for the Sky Blues, a 25-yard strike to open their 1–1 draw at Millwall. Sordell totalled seven goals in 26 games for Coventry, including both in their 2–1 home win over Morecambe in the first round of the FA Cup on 15 November, and the sole strike of a win at the Ricoh Arena against Crawley Town on 7 December in the second round of the EFL Trophy, which the team ended up winning."]}, {"page": "Jack Compton", "response": ["On 29 July 2011 it was reported on the Falkirk website that Compton had joined Bradford City on loan, becoming the third man joining Bradford from Falkirk along with Mark Stewart and Chris Mitchell. This was after initially not earning a permanent deal at the West Yorkshire club following a trial. On 6 August 2011, Compton made his league debut for the club in a 2–1 loss against Aldershot Town and setting up a goal for James Hanson. On 9 August 2011, he scored his first goal for the club in a 3–2 defeat to local rivals Leeds United. Nearing the ending of his loan spell at Bradford, the club was keen to extend a loan on Compton following Kyel Reid injury."]}, {"page": "2008–09 Wolverhampton Wanderers F.C. season", "response": ["After drawing their final two fixtures of 2008, Wolves endured a dismal start to 2009, winning just once in eleven league fixtures. Trying to arrest this slump, the January transfer window saw the arrival of three new faces: Kyel Reid and Nigel Quashie on loan for the remainder of the season from West Ham United; defender Christophe Berra also joined from Scottish club Hearts for £2.3million. The FA Cup had brought some cheer with a fringe squad winning 2–0 at local rivals Birmingham in the 3rd Round, before the club exited the competition with a 2–1 home defeat to Premier League side Middlesbrough.", "| 15 January 2009 ||  Kyel Reid ||align=\"center\"| West Ham United ||align=\"center\"|  End of season"]}, {"page": "2011–12 Football League Two", "response": ["|align=\"left\"|Kyel Reid"]}, {"page": "2011–12 Bradford City A.F.C. season", "response": ["| Kyel Reid", "|align=\"center\"| Telegraph & Argus' Most Consistent Player of the Year ||align=\"center\"| Kyel Reid", "|align=\"center\"| Bradford City Supporters Trust Under 25's Player of the Year ||align=\"center\"| Kyel Reid"]}, {"page": "2011–12 Charlton Athletic F.C. season", "response": ["| Kyel Reid"]}]}}