{"wiki_id": "http://www.wikidata.org/entity/Q1370677", "itemLabel": "Thomas Bridges", "itemDescription": "British missionary", "wikipedia_url": "https://en.wikipedia.org/wiki/Thomas_Bridges_(Anglican_missionary)", "wikipedia_page": {"main": "Thomas Bridges (c. 1842 – 1898) was an Anglican missionary and linguist, the first to set up a successful mission to the indigenous peoples in Tierra del Fuego, an archipelago shared by Argentina and Chile. Adopted and raised in England by George Pakenham Despard, he accompanied his father to Chile with the Patagonian Missionary Society. After an attack by indigenous people, in 1869 Bridges' father, Despard, left the mission at Keppel Island of the Falkland Islands, to return with his family to England. At the age of 17, Bridges stayed with the mission as its new superintendent. In the late 1860s, he worked to set up a mission at what is now the town of Ushuaia along the southern shore of Tierra del Fuego Island.\nOrdained and married during a trip to Great Britain in 1868-1869, Bridges returned to the Falkland Islands with his wife. They settled at the mission at Ushuaia, where four of their six children were born. He continued to work with the Selk'nam (Ona) and Yaghan peoples for nearly 20 more years. On Bridges' retirement from missionary service in 1886, the Argentine government gave him a large grant of land. He became a sheep and cattle rancher.\nAs a young man, Bridges had learned the indigenous language of Yamana and closely studied the culture over his lifetime. Over more than a decade, he compiled a grammar and dictionary in Yamana-English of more than 30,000 words. His son Lucas Bridges donated the work to the British Library of London in 1930. Part of the dictionary was published in 1933, then consisting only of the Yamana-English portion. That was edited and published commercially in 1987, since reprinted in 2011. An English-Yamana manuscript, dated 1865, was discovered in the British Library by Alfredo Prieto. The two portions have been published together online at the Patagonian Bookshelf website to provide free access.", "link_mentions": {}}}