{"wiki_id": "http://www.wikidata.org/entity/Q1389946", "itemLabel": "Philip Jourdain", "itemDescription": "British logician", "wikipedia_url": "https://en.wikipedia.org/wiki/Philip_Jourdain", "wikipedia_page": {"main": "Philip Edward Bertrand Jourdain (16 October 1879 – 1 October 1919) was a British logician and follower of Bertrand Russell.\nHe was born in Ashbourne in Derbyshire one of a large family belonging to Emily Clay and his father Francis Jourdain (who was the vicar at Ashbourne). He was partly disabled by Friedreich's ataxia. He corresponded with Georg Cantor and Gottlob Frege, and took a close interest in the paradoxes related to Russell's paradox, formulating the card paradox version of the liar paradox. He corresponded with Ludwig Wittgenstein, meeting with him in Cambridge to discuss Frege's book Grundgesetze der Arithmetik, parts of which Jourdain had prepared a translation. He also worked on algebraic logic, and the history of science with Isaac Newton as a particular study. He was London editor for The Monist. Near the end of his life he became increasingly obsessed by trying to prove the axiom of choice, and published several incorrect proofs of it. Littlewood (1986, p.129) describes Jourdain on his deathbed still arguing with him about his (incorrect) proof of the axiom of choice.\nHis sister Eleanor Jourdain was an English academic and author. Another sister, Margaret (1876–1951), was an authority on the history of fine English home-furnishings, and the life-long companion of the novelist Ivy Compton-Burnett.", "link_mentions": [{"page": "Continuum hypothesis", "response": ["The beth numbers provide an alternate notation for this condition: \\aleph_\\alpha=\\beth_\\alpha for every ordinal \\alpha. The continuum hypothesis is the special case for the ordinal \\alpha=1. GCH was first suggested by Philip Jourdain. For the early history of GCH, see Moore."]}, {"page": "Georg Cantor", "response": ["The Continuum hypothesis, introduced by Cantor, was presented by David Hilbert as the first of his twenty-three open problems in his address at the 1900 International Congress of Mathematicians in Paris. Cantor's work also attracted favorable notice beyond Hilbert's celebrated encomium. The US philosopher Charles Sanders Peirce praised Cantor's set theory and, following public lectures delivered by Cantor at the first International Congress of Mathematicians, held in Zurich in 1897, Adolf Hurwitz and Jacques Hadamard also both expressed their admiration. At that Congress, Cantor renewed his friendship and correspondence with Dedekind. From 1905, Cantor corresponded with his British admirer and translator Philip Jourdain on the history of set theory and on Cantor's religious ideas. This was later published, as were several of his expository works."]}, {"page": "Sense and reference", "response": ["Second, sentences that contain proper names with no reference cannot have a truth value at all. Yet the sentence 'Odysseus was set ashore at Ithaca while sound asleep' obviously has a sense, even though 'Odysseus' has no reference. The thought remains the same whether or not 'Odysseus' has a reference. Furthermore, a thought cannot contain the objects that it is about. For example, Mont Blanc, 'with its snowfields', cannot be a component of the thought that Mont Blanc is more than 4,000 metres high. Nor can a thought about Etna contain lumps of solidified lava.See Frege's undated letter to Philip Jourdain, published in Frege's Philosophical and Mathematical Correspondence, ed. Gottfried Gabriel, Hans Hermes, Friedrich Kanbartel, Christian Thiel and Albet Veraart, transl. Hans Kaal, Oxford: Blackwell 1980. (See also Frege's letter to Russell dated 1904, in the same collection.)"]}, {"page": "List of logicians", "response": ["* Philip Jourdain (UK, 1879–1919)"]}, {"page": "Index of philosophy articles (I–Q)", "response": ["* Philip Jourdain"]}, {"page": "Gyula Kőnig", "response": ["At first Georg Cantor highly esteemed Kőnig. In a letter to Philip Jourdain in 1905 he wrote: "]}, {"page": "Margaret Jourdain", "response": ["Born in Ashbourne, Derbyshire, on 15 August 1876, Jourdain's father was Francis Jourdain (1834–1898), a vicar and her mother, Emily, was the daughter of the surgeon and pioneer of ovariotomy, Charles Clay. One of ten children, her siblings included the writer and academic Eleanor Jourdain, the ornithologist Francis Charles Robert Jourdain and the mathematician Philip Jourdain."]}, {"page": "Philip Edward Bertrand Jourdain", "response": ["#REDIRECT Philip Jourdain"]}, {"page": "P. E. B. Jourdain", "response": ["#REDIRECT Philip Jourdain"]}, {"page": "Limitation of size", "response": ["In the philosophy of mathematics, specifically the philosophical foundations of set theory, limitation of size is a concept developed by Philip Jourdain and/or Georg Cantor to avoid Cantor's paradox. It identifies certain \"inconsistent multiplicities\", in Cantor's terminology, that cannot be sets because they are \"too large\". In modern terminology these are called proper classes."]}, {"page": "Philip jourdain", "response": ["#REDIRECT Philip Jourdain "]}, {"page": "Jourdain", "response": ["* Philip Jourdain (1879–1919), English logician"]}, {"page": "Moberly–Jourdain incident", "response": ["Jourdain, born in 1863, was the eldest of ten children.. Her father, the Reverend Francis Jourdain, was the vicar of Ashbourne in Derbyshire. She was the sister of art historian Margaret Jourdain and mathematician Philip Jourdain.. She went to school in Manchester, unlike most girls of the time who were educated at home.."]}, {"page": "Eleanor Jourdain", "response": ["Born in Ashbourne, Derbyshire on 16 November 1863, Jourdain's father was Francis Jourdain (1834–1898), a vicar and her mother, Emily, was the daughter of Charles Clay. Jourdain was the first of ten children. There were at least two sisters: Charlotte, who had been one of St Hugh's College's first four students, and Margaret, a writer on English furniture and decoration. Her brother Philip Jourdain was a prolific editor for The Monist."]}, {"page": "The Principles of Mathematics", "response": ["Ivor Grattan-Guinness made an in-depth study of Principles. First he published Dear Russell – Dear Jourdain (1977),Ivor Grattan-Guinness (1977) Dear Russell – Dear Jourdain: a commentary on Russell’s logic, based on his correspondence with Philip Jourdain, Duckworth Overlook  which included correspondence with Philip Jourdain who promulgated some of the book’s ideas. Then in 2000 Grattan-Guinness published The Search for Mathematical Roots 1870 – 1940, which considered the author’s circumstances, the book’s composition and its shortcomings.Ivor Grattan-Guinness (2000) The Search for Mathematical Roots 1870–1940: Logics, Set Theories, and the Foundations of Mathematics from Cantor through Russell to Gödel, Princeton University Press . See pages 292–302 and 310–326"]}, {"page": "Peb jourdain", "response": ["#redirect Philip Jourdain"]}, {"page": "Card paradox", "response": ["The card paradox is a variant of the liar paradox constructed by Philip Jourdain. It is also known as the postcard paradox, Jourdain paradox or Jourdain's paradox."]}, {"page": "List of International Congresses of Mathematicians Plenary and Invited Speakers", "response": ["*Philip Jourdain"]}, {"page": "Analytical Dynamics of Particles and Rigid Bodies", "response": ["The second and third editions received several reviews, including another one from George H. Bryan as well as Philip Jourdain, George David Birkhoff, and Thomas MacFarland Cherry. Jourdain published two similar reviews of the second edition in different journals, both in 1917. The more detailed of the two, published in The Mathematical Gazette, summarises the book's topics before making several criticisms of specific parts of the book, including the \"neglect of work published from 1904 to 1908\" on research over Hamilton's principle and the principle of least action. After listing several other problems, Jourdain ends the review by stating that \"all these criticisms do not touch the very great value of the book which has been and will be the chief path by which students in English speaking countries have been and will be introduced to modern work on the general and special problems of dynamics.\" Bryan also reviewed the second edition of the book in 1918 in which he criticises the book for not including the dynamics of aeroplanes, a lapse Bryan believes was acceptable for the first but not for the second edition of the book. After discussing more about aeroplanes and the development of their dynamics, Bryan closes the review by stating that the book \"will be found of much use by such students of a future generation as are able to find time to extend their study of particle and rigid dynamics outside the requirements of aerial navigation\" and that it would serve as \"a valuable source of information for those who are in search of new material of a theoretical character which they can take over and apply to any particular class of investigation.\" George David Birkhoff wrote a review in 1920 stating that the book is \"invaluable as a condensed and suggestive presentation of the formal side of analytical dynamics\". Birkhoff also includes several criticisms of the book, including stating it was incomplete in some respects, pointing to the methods used in chapter sixteen on trigonometric series."]}, {"page": "Bibliography of E. T. Whittaker", "response": ["Whittaker was the original author of the textbook A Course of Modern Analysis, first published in 1902. The book was reviewed by George Ballard Mathews, Arthur Stafford Hathaway, and Maxime Bôcher, among others. The book's later editions were written in collaboration with Whittaker's former student George Neville Watson, resulting in the textbook taking the famous colloquial name Whittaker & Watson, published in 1915, 1920, and 1927. Reviewers of the book's later editions include Philip Jourdain, Eric Harold Neville, and Dorothy Maud Wrinch. The book is subtitled an introduction to the general theory of infinite processes and of analytic functions; with an account of the principal transcendental functions and is a classic textbook in mathematical analysis."]}]}}