{"wiki_id": "http://www.wikidata.org/entity/Q1381032", "itemLabel": "Phil Bennett", "itemDescription": "Welsh rugby union player", "wikipedia_url": "https://en.wikipedia.org/wiki/Phil_Bennett", "wikipedia_page": {"main": "Philip Bennett  (born 24 October 1948) is a former Welsh international rugby union fly half from 1969 to 1978. His flair and range of tricks, including his famous sidestep and swerve, meant he was a firm favourite with crowds.", "link_mentions": [{"page": "British & Irish Lions", "response": ["| Phil Bennett, 26", "| Phil Bennett", "| Phil Bennett, 18", "|align=\"left\"| Phil Bennett"]}, {"page": "Cardiff Arms Park", "response": ["Barbarians: Tries: Gareth Edwards, Fergus Slattery, John Bevan, J P R Williams; Conversions: Phil Bennett (2); Penalty: Phil Bennett."]}, {"page": "October 24", "response": ["*1948 – Phil Bennett, Welsh rugby player"]}, {"page": "Culture of the United Kingdom", "response": ["In 1845, rugby union was created when the first rules were written by pupils at Rugby School, Warwickshire.\"Six ways the town of Rugby helped change the world\". BBC. Retrieved 29 January 2015 A former pupil of the school William Webb Ellis, is often fabled with the invention of running with the ball in hand in 1823. The first rugby international took place on 27 March 1871, played between England and Scotland.Godwin, Terry; Rhys, Chris (1981).The Guinness Book of Rugby Facts & Feats. p.10. Enfield: Guinness Superlatives Ltd By 1881 both Ireland and Wales had teams, and in 1883 the first international competition the annual Home Nations Championship took place. In 1888, the Home Nations combined to form what is today called the British and Irish Lions, who now tour every four years to face a Southern Hemisphere team. The Wales team of the 1970s, which included a backline consisting of Gareth Edwards, J. P. R. Williams and Phil Bennett who were known for their feints, sidesteps and attacking running rugby, are regarded as one of the greatest teams in the game – all three players were involved in The greatest try ever scored in 1973. Jonny Wilkinson scored the winning drop goal for England in the last minute of extra time in the 2003 Rugby World Cup Final. The major domestic club competitions are the Premiership in England and the Celtic League in Ireland, Scotland, Wales and (since 2010) Italy. Of Cornish origin, the chant “Oggy Oggy Oggy, Oi Oi Oi!” is associated with rugby union (and its personalised variant with football); it inspired the “Maggie Maggie Maggie, Out Out Out!\" chant by opponents of Prime Minister Margaret Thatcher in the 1980s. In 1895, rugby league was created in Huddersfield, West Riding of Yorkshire, as the result of a split with the other Rugby code. The Super League is the sports top-level club competition in Britain, and the sport is especially popular in towns in the northern English counties of Yorkshire, Lancashire and Cumbria. The Challenge Cup is the major rugby league cup competition."]}, {"page": "Barry John", "response": ["During the 1966/67 season John was again chosen to trial for Wales. One of the trials forced him to miss the second Swansea encounter of the season, played away on 12 November 1966; his place in the Llanelli team was given to a youth debutant from the Felinfoel club, Phil Bennett.Hughes (1986) p. 199 Bennett became one of the greatest fly-halves produced by Wales, but he was kept from the Wales squad in his early career by the presence of John.Thomas (1979) p. 182 In 1966, John was awarded his first international cap for Wales, taking David Watkins place at fly-half for the match against the touring Australia team.Thomas (1979) p. 154 This was seen as a surprise move by the Welsh Rugby Union selectors, as Watkins had recently returned from a British Lions tour where he was team captain. Wales lost to Australia 11–4, the first time the Welsh had been beaten by the 'Wallabies', due to poor form in the midfield, with the criticism aimed at John, Gerald Davies and John Dawes.Sports historian Wayne Thomas in his 1979 book A Century of Welsh Rugby Players (p. 162) places criticism for this loss on the midfield players. Stating \"John himself escaped the worst criticism even though guilty of poor positioning to take Allan Lewis's long pass\". Conversely, John's play during this game is praised by other sources. David Watkins in his 1979 autobiography \"The David Watkins Story\" (p. 101) wrote: \"He [John] played very well and I knew he would retain his place against Scotland,\". John himself, in his 1974 autobiography (p. 69-70), wrote that he \"...hadn't played a blinder... but I hadn't made a lot of mistakes\", and follows this up with an extract from Cliff Morgan's after-match report which stated: \"Barry John had a grand first international and looked as if he could beat the defence at any time.\" Although experiencing defeat in his first international, John managed to gain revenge over Australia just over a month later when the same team faced Llanelli at Stradey Park. Llanelli beat the Wallabies 11–0 after a bruising forward contest. John himself scored a try, and then added to his tally with a dropped goal.", "With the end of the 1968/69 season, the Welsh Rugby Union sent a team to tour New Zealand and Australia. At half-back, Wales sent John, Edwards, Phil Bennett and Chico Hopkins, but in all three Tests, two against the New Zealand \"All Blacks\" and one against Australia, Welsh coach Clive Rowlands kept faith with John and Edwards. The Welsh team were completely overwhelmed by the All Blacks, losing both Tests, 0–19 and 12–33.Griffiths (1987) p. 4:38 A change of tactics by Rowlands, by switching Gerald Davies to the right wing, gave Wales a victory over Australia, and a six try victory over Fiji (in which John was replaced by Bennett) on their return to Britain, helped the team gain a warm reception on their return.Smith (1980) p. 399", "There was little rest for the two Cardiff half-backs when on 7 February 1970 they were called back into the Wales team for the first match of the 1970 Five Nations Championship, a home encounter at the Cardiff Arms Park against Scotland. Despite Scotland being 9–0 ahead at one point, Wales took the initiative and scored four tries without reply, winning 18–9.Godwin (1984) p. 346 The England game was John and Edwards' fifteenth Wales international together, in an away match which recorded the largest haul of tries for the Welsh team in England since 1908.Godwin (1984) p. 347 John scored one of the tries along with a dropped goal. Due to an injury to Edwards, John finished the game alongside Chico Hopkins. With only Ireland standing in front of a Welsh Triple Crown win, hopes were high, but Ireland, made John and Edwards look ordinary in a 0–14 defeat.Godwin (1984) pp. 348–349 John was unavailable for the final game of the tournament to France, his place taken by Phil Bennett. Wales beat France and shared the Championship with the French."]}, {"page": "Llanelli", "response": ["*Phil Bennett (born 1948), Wales and British Lions"]}, {"page": "Gareth Edwards", "response": ["Edwards is Wales's youngest ever captain, first taking the captaincy at the age of 20 in February 1968 against Scotland – a game which the Welsh side won 5–0. Edwards was very fortunate in playing with two of the best outside halves the game has ever seen: Barry John and Phil Bennett. In the early part of his career, Edwards and his club team mate Barry John appeared inseparable, always knowing what the other was doing. During his era the Welsh side dominated the Five Nations Championship, winning the title seven times, including three grand slams. In 1969, Edwards was named Player of the Year in Wales.", "Edwards' try for the Barbarians against the All Blacks in 1973 at Cardiff Arms Park, often referred to simply as \"that try\", is regarded as the greatest try ever. The move starts with a deep kick from the New Zealand winger. The ball dropped towards Phil Bennett near to his goal line. Bennett sidestepped and evaded three tackles, in turn passing the ball to JPR Williams. It next passed through four pairs of hands (Pullin, Dawes, David and Quinnell) before Edwards, slipping between two teammates and seemingly intercepting the last pass, finished with a diving try in the left-hand corner."]}, {"page": "Terry Griffiths", "response": ["Terence Martin Griffiths was born in Llanelli on 16 October 1947. He gained a place at a grammar school but was expelled for truancy and then became a student at a secondary modern, where he played rugby union with future Welsh national team members Phil Bennett and Derek Quinnell. Griffiths started playing snooker when he was 14. After leaving school, he worked in a coal mine, and he became the youngest winner of the Llanelli and District snooker championship when he was 16. Griffiths won the West Wales snooker championship, and having changed his employment to become a bus conductor, had more time available to practise snooker. He later worked as a postman, and as an insurance salesman."]}, {"page": "Wales national rugby union team", "response": ["Wales next won the Five Nations outright in 1975, and in 1976, Wales won their second Grand Slam of the decade. Just like the first in 1971, they used only 16 players over their four matches. They repeated the feat in 1978 and, in the process, became the first team to win three consecutive Triple Crowns. Following their final Five Nations match of 1978, both Phil Bennett and Gareth Edwards retired from rugby.", "* 2007 – Arthur Gould, Phil Bennett"]}, {"page": "Rugby union positions", "response": ["Fly-halves in the International Rugby Hall of Fame include Cliff Morgan, as well as fellow Welshman Phil Bennett, the latter of whom unleashed two great sidesteps to set up what some have described as \"the greatest try of all time\". South African Naas Botha scored 312 points (including a record 17 drop goals) despite playing most of his career when the Springboks were boycotted. Australia's Mark Ella used his vision, passing skills and game management to orchestrate a new flat-back attacking style. Grant Fox was one of the most respected goal-kickers who scored more than 1,000 points in all matches for New Zealand. Barry John was known simply as \"the king\" to Welsh rugby fans and was rated third in the 1971 BBC Sports Personality of the Year Award. Jack Kyle is widely considered Ireland's greatest player. Michael Lynagh took over fly-half from Ella and in his first test in that position scored an Australian record of 23 points against Canada. Bennie Osler played for South Africa from 1924 until 1933, during which he played a South African record of 17 consecutive games and scored a then world record of 14 points in one game against New Zealand. Hugo Porta is regarded as one of the finest players that Argentina has produced and has been a member of the Laureus World Sports Academy since 2000."]}, {"page": "Neil Jenkins", "response": ["Jenkins' main strength was his kicking, although he was deceptively quick in his early career. Despite this, he still received tremendous criticism and many felt that he was not worthy enough to inherit the Welsh number 10 shirt of Barry John, Phil Bennett and Cliff Morgan, leading Jenkins to tailor his game to the demands of the modern game. He developed his tackling, passing and running skills, especially under the coaching of Graham Henry, and became an excellent distributor of the ball, notably his excellent flat passes, and also a strong runner.  In November 1993 he managed an international record eight successful penalty kicks at goal in Wales's 24-26 defeat to Canada. At the age of just 23, he passed Paul Thorburn to become Wales's record Test point scorer in a 29-19 win against Italy, in which he also equalled the record of 24 points in a game he had set against Canada."]}, {"page": "Scarlets", "response": ["The Scarlets moved from Stradey Park at the end of November 2008 to a new ground at Pemberton called Parc y Scarlets. The final Scarlets match played at Stradey Park was on 24 October 2008, against Bristol in the group stage of the Anglo-Welsh Cup. The Scarlets won 27–0 in front of a capacity crowd, which included former Llanelli captains such as Delme Thomas and Phil Bennett."]}, {"page": "Rugby union in Wales", "response": ["The zenith of Welsh rugby was the 1970s, when Wales had players such as Barry John, Gareth Edwards, Phil Bennett and JPR Williams. Wales won four consecutive Triple Crowns. The strong Pontypool front row of Graham Price, Bobby Windsor & Charlie Faulkner were all manual workers, and Robin McBryde was formerly the holder of the title of Wales's strongest man.", "There has always been an element of class warfare to rugby union in Wales. In 1977 Phil Bennett's pre-game pep talk before facing England produced a memorable quote:"]}, {"page": "Japanese Story", "response": ["* Phil Bennett – Barman"]}]}}