{"wiki_id": "http://www.wikidata.org/entity/Q1382113", "itemLabel": "Margaret Gatty", "itemDescription": "British writer and botanist (1809-1873)", "wikipedia_url": "https://en.wikipedia.org/wiki/Margaret_Gatty", "wikipedia_page": {"main": "Margaret Gatty (née Scott, 3 June 1809 – 4 October 1873) was an English children's author and writer on marine biology. In some writings she argues against Charles Darwin's Origin of Species. She became a popular writer of tales for young people, which she hoped would influence adult minds as well. Among her other books are Parables from Nature, Worlds not Realized, Proverbs Illustrated, and Aunt Judy's Tales. She edited Aunt Judy's Magazine, a family publication written by various family members.", "link_mentions": [{"page": "List of children's literature writers", "response": ["*Margaret Gatty (1809–1873) – Parables from Nature, Aunt Judy's Tales"]}, {"page": "1873 in literature", "response": ["*October 4 – Margaret Gatty, English children's author (born 1809)"]}, {"page": "1809 in literature", "response": ["*June 3 – Margaret Gatty, English children's writer (died 1873)"]}, {"page": "Juliana Horatia Ewing", "response": ["Known as Julie, she was the second of ten children of the Rev. Alfred Gatty, Vicar of Ecclesfield in Yorkshire, and Margaret Gatty, who was herself a children's author. Their children were educated mainly by their mother, but Julie was often the driving force behind their various activities: drama, botany and so on. Later she was responsible for setting up a village library in Ecclesfield and helped out in the parish with her three sisters. Early stories of hers appeared in Charlotte Mary Yonge's magazine The Monthly Packet."]}, {"page": "Alfred Gatty", "response": ["With Margaret Gatty:"]}, {"page": "Mrs Gatty", "response": ["#REDIRECT Margaret Gatty"]}, {"page": "John Parkinson (botanist)", "response": ["Parkinson died in the summer of 1650, and was buried at St Martin-in-the-Fields, London, on 6 August.There is no extant memorial to Parkinson at St Martin-in-the-Fields. The present church was completed in 1726 and in the process records of the locations of all original burials were lost. Ledger slabs from earlier memorials exist, but James Gibbs, the architect of the new church building, used them as paving stones and there is no clear record of which slab is where: personal e-mail communication between Jacklee and Mr. Chris Brooker, Parish Clerk of St Martin-in-the-Fields, on 3 December 2007. He is commemorated in the Central American genus of leguminous trees Parkinsonia. Paradisi in Sole also inspired the children's writer Juliana Horatia Ewing (1841–1885) to write the story Mary's Meadow,Later republished in book form as  See  which was first published from November 1883 to March 1884 in Aunt Judy's Magazine (1866–1885), produced by her mother Margaret Gatty. In the story, some children read Paradisi in Sole and are inspired to create their own garden. The magazine received much favourable correspondence about the story, and in July 1884 it was suggested that a Parkinson Society should be formed. The objects of the society were to \"search out and cultivate old garden flowers which have become scarce; to exchange seeds and plants; to plant waste places with hardy flowers; to circulate books on gardening amongst the Members... [and] to try to prevent the extermination of rare wild flowers, as well as of garden treasures.\""]}, {"page": "George Bell & Sons", "response": ["In the mid-1850s, Bell expanded again, printing the children's books of Margaret Gatty (Parables from Nature) and Juliana Horatia Ewing (the Nursery Magazine). Around the same time, in 1854, he acquired J. & J.J. Deighton, a bookseller's outfit in Cambridge, which thereupon changed its name to Deighton, Bell & Co.. Then, in 1856, Bell brought on board as a partner Frederick Daldy, and renamed the company Bell & Daldy."]}, {"page": "William Henry Harvey", "response": ["George Clifton (1823–1913) Mr G. Clifton is mentioned in Harvey's Memoirs, as the Superintendent of the Water Police in Perth, West Australia whose boat Harvey used when collecting in Fremantle (Blackler, 1977).Blackler, H. 1977. Harvey's Australian Algae in the Herbarium of Mrs, Margaret Gatty in the Department of Botany of the University of St Andrew's (STA), Scotland. Taxon 26: 495–496 Some of his specimens are in the Ulster Museum Herbarium: BEL: F2195; F2196 from \"W.Australia.\"", "* Blackler, H. 1977. Harvey's Australian Algae in the Herbarium of Mrs Margaret Gatty in the Department of Botany of the University of St Andrew's (STA), Scotland. Taxon 26: 495 – 496."]}, {"page": "1809 in poetry", "response": ["* June 3 – Margaret Gatty  (died 1873), English writer of children's literature, poet and editor"]}, {"page": "Mary Agnes Tincker", "response": ["*The Life Beyond(1892)\"But I followed a frog just now, as he went upwards, and all at once he went to the side of the water, and began to disappear, and presently he was gone. Did he leave this world, do you think? And what can there be beyond ?\" adapted from the work of Margaret Gatty"]}, {"page": "Church of St Mary, Ecclesfield", "response": ["The grave of Joseph Hunter (1783–1861), a prominent antiquarian and archivist, and author of the important local history Hallamshire (1819), can be found in the churchyard, at plot 3, grave 1125. Also buried in the churchyard are Alexander John Scott, chaplain to Horatio Nelson, who was present at his death at the Battle of Trafalgar and his daughter Margaret Gatty, a writer and botanist."]}, {"page": "Mrs. Alfred Gatty", "response": ["#REDIRECT Margaret Gatty"]}, {"page": "Alexander John Scott", "response": ["Scott's daughter Margaret became a best selling author under her married name of Margaret Gatty.Margaret Gatty She authored a memoir about his life Recollections of the Life of the Rev. A. J. Scott."]}, {"page": "Aunt Judy's Magazine", "response": ["Aunt Judy's Magazine was a British magazine for young people founded in 1866 by Margaret Gatty. After her death in 1873, publishing was continued by her daughter Horatia Eden until 1885.  The magazine is named after Gatty's daughter, Juliana Horatia Ewing's childhood nickname, “Judy”."]}, {"page": "Gatty", "response": ["* Margaret Gatty (1809–1873), English writer of children's literature and naturalist"]}, {"page": "Margaret Scott-Gatty", "response": ["#REDIRECT Margaret Gatty"]}, {"page": "Margaret Scott Gatty", "response": ["#REDIRECT Margaret Gatty"]}, {"page": "Aunt Judy", "response": ["#redirect Margaret Gatty"]}, {"page": "List of women botanists", "response": ["| Margaret Gatty"]}, {"page": "Charles Henry Gatty", "response": ["Gatty never married; he shared much time with his older second cousin, Margaret Gatty, inspiring her to publish a book on British Seaweeds in 1863."]}, {"page": "Charles Tindal Gatty", "response": ["Charles Tindal Gatty was the son of the Rev. Alfred Gatty, D.D. vicar of Ecclesfield; his mother, Margaret Gatty, was the daughter of the Rev. Alexander John Scott a chaplain in the Royal Navy who served under and was a friend of Lord Nelson on board  during the Battle of Trafalgar.\" Charles Tindal Gatty was educated at the Charterhouse School until he was 13 and from then on by a private tutor. Gatty converted to Catholicism and became a well known political spokesman for his adopted faith."]}, {"page": "St Andrews Botanic Garden", "response": ["The gardens also house an algal herbarium based on the collection of seaweed specimens gathered originally by the phycologist Margaret Gatty (1809-1873)  and enlarged since her death."]}]}}