{"wiki_id": "http://www.wikidata.org/entity/Q1386053", "itemLabel": "Michael O'Moore Creagh", "itemDescription": "British Army general", "wikipedia_url": "https://en.wikipedia.org/wiki/Michael_O%27Moore_Creagh", "wikipedia_page": {"main": "Major General Sir Michael O'Moore Creagh KBE, MC (16 May 1892 – 14 December 1970) was a British Army officer who served in both the world wars. He commanded the 7th Armoured Division, the Desert Rats, between 1939 and 1941.", "link_mentions": [{"page": "7th Armoured Division (United Kingdom)", "response": ["By September 1939 the artillery was equipped with 25-pounder gun-howitzers and 37 mm anti-tank guns and, in December 1939, Major-General Michael O'Moore Creagh took command.", "The first divisional commander, Major-General Percy Hobart, found inspiration in the pet jerboa, or \"desert rat\" of Rea Leakey, then GSO 3 Intelligence. Hobart took to the animal and decided to adopt \"The Desert Rats\" as a nickname for the division. The shoulder flash was designed by the wife of his successor, Major-General Michael O'Moore Creagh, using a jerboa from Cairo Zoo as a model. The resulting shoulder patches were made of scarlet thread. These were unofficial; the War Office did not adopt the flashes until the summer of 1943 and then redesigned them to look, in the opinion of Leakey, more like a kangaroo than a jerboa. The colour was also changed to black.Rea Leakey, Leakey’s Luck, paperback edition 2002, pp 23–25n; photographs of original and redesigned flashes between pp. 102–103.", "|Major-General Michael O'Moore Creagh", "|Major-General Michael O'Moore Creagh(replaced after failure of Battleaxe)"]}, {"page": "Operation Compass", "response": ["Middle East Command under General Archibald Wavell had about  some outside Egypt,  and . The RAF had  in two squadrons of Hurricanes, one of Gloster Gladiators, three of Bristol Blenheims, three of Vickers Wellingtons and one of Bristol Bombays, about  and  The Western Desert Force (WDF) was commanded by Lieutenant-General Richard O'Connor with the 4th Indian Infantry Division (Major-General Noel Beresford-Peirse) and the 7th Armoured Division (Major-General Sir Michael O'Moore Creagh). From 14 December, troops of the 6th Australian Infantry Division (Major-General Iven Giffard Mackay), replaced the 4th Indian Division, which was sent to East Africa, less one brigade. The British had some fast Cruiser Mk I, Cruiser Mk II and Cruiser Mk III tanks with Ordnance QF 2-pounder guns, which were superior to Fiat M11/39 tanks. The British also had a battalion of Matilda II infantry tanks that while slow, were also equipped with the 2-pounder; the armour of the Matildas could not be penetrated by Italian anti-tank guns or field guns.", "** 7th Armoured Division (Major General Michael O'Moore Creagh)"]}, {"page": "Operation Battleaxe", "response": ["Churchill was displeased with the results of Operation Battleaxe. He had been expecting nothing less than complete success and had instead received news that the operation had failed and the tanks sent for it had been lost. Churchill sacked Wavell but could not have it look as though he was being punished or have Wavell return to England, as embarrassing questions could be raised. Churchill had Wavell exchange duties with General Claude Auchinleck, Commander-in-Chief, India.Crucible, p. 309 Along with Wavell went Michael O'Moore Creagh, who was replaced by Gott.Harding of Petherton: Field Marshal, p. 73", "** 7th Armoured Division (Major-General Sir Michael O'Moore Creagh)"]}, {"page": "Siege of Tobruk", "response": ["At the end of 15 June only  tanks remained operational and next day, a German counter-attack forced back the Allies on the western flank but was repulsed in the centre; the Allies were reduced to  and  On 17 June, the Allies evaded encirclement by two Panzer regiments and ended the operation. The Allies had   and  were knocked out or broke down and lost; the RAF lost  German losses were  (Italian losses are unknown), twelve tanks and ten aircraft. General Wavell, the XIII Corps commander, Lieutenant-General Noel Beresford-Peirse and Major-General Michael O'Moore Creagh the 7th Armoured Division commander were sacked and Auchinleck took over as Commander-in-Chief of the Middle East."]}, {"page": "Western Desert campaign", "response": ["In late January, the British learned that the Italians were evacuating Cyrenaica along the Via Balbia from Benghazi. The 7th Armoured Division, under Major-General Sir Michael O'Moore Creagh, was dispatched to intercept the remnants of the 10th Army by cutting through the desert south of the Jebel Akhdar via Msus and Antelat, as the 6th Australian Division pursued the Italians along the coast road north of the Jebel Akhdar. The terrain was hard going for the British tanks and Combeforce (Lieutenant-Colonel John Combe), a flying column of wheeled vehicles, was sent on ahead."]}, {"page": "10th Army (Italy)", "response": ["At the Battle of Beda Fomm (6–7 February 1941), most of the remainder of the retreating 10th Army was isolated by Combeforce (Lieutenant-Colonel John Combe) a small advance guard of the 7th Armoured Division (Major-General Michael O'Moore Creagh). Combeforce took a shortcut across the desert, to block the Italian army's retreat, while the 6th Australian Division continued the coastal pursuit. The force was delayed by the harsh terrain, so Combeforce was divided and the lighter, faster elements were detached to complete the interception, leaving the tracked vehicles to follow."]}, {"page": "Battle of Beda Fomm", "response": ["The rapid British advance during Operation Compass (9 December 1940 – 9 February 1941) forced the Italian 10th Army to evacuate Cyrenaica, the eastern province of Libya. In late January, the British learned that the Italians were retreating along the Litoranea Balbo () from Benghazi. The 7th Armoured Division (Major-General Sir Michael O'Moore Creagh) was dispatched to intercept the remnants of the 10th Army by moving through the desert, south of the Jebel Akhdar (Green Mountain) via Msus and Antelat as the 6th Australian Division pursued the Italians along the coast road, north of the jebel. The terrain was hard going for the British tanks and Combeforce (Lieutenant-Colonel John Combe), a flying column of wheeled vehicles, was sent ahead across the chord of the jebel.", "The area east of the Jebel Akhdar mountains was garrisoned by the XX Motorised Corps (Lieutenant-General Annibale Bergonzoli) with the 60th Infantry Division \"Sabratha\" and the Babini Group (General Valentino Babini), which had already lost some of its tanks in the British capture of Tobruk. The Babini Group had an establishment of  but these included  had landed recently at Benghazi. The new tanks needed ten days to be made battle worthy and a three-day journey to reach Mechili but in the crisis, tanks had been rushed forward, which reduced the serviceability of the vehicles. A defensive position was established by the 60th Infantry Division \"Sabratha\" on a line from Derna along Wadi Derna, with the Babini Group concentrating at Mechili Fort inland and slightly south-west of Derna where several desert tracks converged, Giovanni Berta and Chaulan, to guard the flank and rear of the infantry. On 22 January, the British advanced towards Derna with the 19th Australian Brigade (Brigadier Horace Robertson) and sent another Australian brigade to reinforce the 4th Armoured Brigade (Brigadier John Caunter) of the 7th Armoured Division (Major-General Michael O'Moore Creagh), south of the Jebel Akhdar, for an advance on Mechili."]}, {"page": "List of military figures by nickname", "response": ["**Michael O'Moore Creagh, British general"]}, {"page": "Sir Michael O'Moore Creagh", "response": ["#REDIRECT Michael O'Moore Creagh"]}, {"page": "Operation Battleaxe order of battle", "response": ["**7th Armoured Division - Major-General Michael O'Moore Creagh"]}, {"page": "Alfred Reade Godwin-Austen", "response": ["He attended the Staff College, Camberley as a student, from 1924 to 1925, alongside fellow students such as Ivor Thomas, Noel Beresford-Peirse, Vyvyan Pope, Douglas Graham, Michael O'Moore Creagh, Daril Watson, Archibald Nye, Humfrey Gale and Noel Irwin, all of whom rose to high command in the next war. He served in numerous staff positions at the War Office until receiving a position as an instructor at the Royal Military College, Sandhurst. Due to a lack of promotion in his own regiment, Godwin-Austen transferred to the Duke of Cornwall's Light Infantry (DCLI) and commanded the 2nd Battalion, from 1936 to 1937, before being employed with the British Military Mission to the Egyptian Army, from 1937 to 1938. His next appointment, during the Arab revolt in Palestine, in successive command of the 13th and 14th Infantry Brigades, the latter post being held until August 1939, shortly before the Second World War began. While in Palestine Godwin-Austen gained a reputation for being very sympathetic towards and supportive of the Zionist movement. In the conflict between Jewish and Arab residents he believed the Arabs were \"clearly the aggressors\" and the Jewish residents of the territory needed to be protected, Godwin-Austen advocated that the British army provide said protection.The American Historical Review, Vol. 45, No. 4 (Jul., 1940), pp. 998-1011"]}, {"page": "Longford Castle", "response": ["* In the 1939–45 war the castle was occupied by British and American troops and entertained Field Marshal Bernard Montgomery, Gen. Mark Clark and Maj. Gen. Sir Michael O'Moore Creagh."]}, {"page": "Index of World War II articles (M)", "response": ["# Michael O'Moore Creagh"]}, {"page": "Combeforce", "response": ["Combeforce or Combe Force was an  flying column of the British Army during the Second World War, commanded by Lieutenant-Colonel John Combe. It comprised parts of the 7th Armoured Division (Major-General Sir Michael O'Moore Creagh) of the Western Desert Force. The rapid British advance during Operation Compass (9 December 1940 – 9 February 1941) forced the Italian 10th Army () to evacuate Cyrenaica, the eastern province of Libya. In late January, the British learned that the Italians were retreating from Benghazi, along the coast road (the  recently renamed the  after the death of Italo Balbo, the Governor General of Libya). The 7th Armoured Division was dispatched to intercept the remnants of the 10th Army by moving through the desert, south of the  (Green Mountain) via Msus and Antelat, as the 6th Australian Division pursued the Italians along the coast road, north of the jebel."]}, {"page": "Creagh (disambiguation)", "response": ["* Michael O'Moore Creagh, British officer"]}, {"page": "Attack on Nibeiwa", "response": ["The British Middle East Command (General Archibald Wavell) had in Egypt and Palestine about  Commonwealth and Free French soldiers,   and  in two squadrons of Hurricanes, one of Gloster Gladiators, three of Bristol Blenheims, three of Vickers Wellingtons and one of Bristol Bombays, about  and  The Western Desert Force (WDF, Lieutenant-General Richard O'Connor) comprised the 4th Indian Infantry Division (Major-General Noel Beresford-Peirse) and the 7th Armoured Division (Major-General Sir Michael O'Moore Creagh). The British had some fast Cruiser Mk I, Cruiser Mk II and Cruiser Mk III tanks with 2-pounder guns, which were superior to Italian M11/39 tanks. The British also had a battalion Matilda II infantry tanks that, while slow, carried the 2-pounder and armour that was impervious to Italian anti-tank guns and field guns."]}, {"page": "Michael Creagh", "response": ["* Sir Michael O'Moore Creagh, British Army officer "]}, {"page": "General Creagh", "response": ["*Michael O'Moore Creagh (1892–1970), British Army major general"]}]}}