{"wiki_id": "http://www.wikidata.org/entity/Q1383568", "itemLabel": "Jan Le Witt", "itemDescription": "Polish painter (1907-1991)", "wikipedia_url": "https://en.wikipedia.org/wiki/Jan_Le_Witt", "wikipedia_page": {"main": "Jan Le Witt (1907–1991) was a Polish-born British abstract artist, graphic designer and illustrator. He had a long professional partnership with George Him. As a design company, Lewitt-Him brought an innovative use of colour, abstraction and symbolism to commercial design. They established a reputation for fine poster work during World War Two and for exhibition displays, most notably with the Guinness clock for the Festival of Britain. The partnership dissolved in 1955 when Le Witt decided to concentrate upon his own, often abstract, art.", "link_mentions": [{"page": "Battersea Park", "response": ["Popular attractions included the Guinness Clock, designed by Jan Le Witt and George Him, and the Far Tottering and Oyster Creek Branch Railway."]}, {"page": "Diana Ross (author)", "response": ["Beginning with The Little Red Engine Gets a Name (1942), followed by The Story of the Little Red Engine (1945) and seven more volumes, Ross created a series of picture books which followed the adventures of the same character. Jan Le Witt and George Him provided the illustrations for the first volume and Leslie Wood its sequels."]}, {"page": "David Tartakover", "response": ["Tartakover designed Peace Now's logo in 1978. The logo emerged from a poster created by Tartakover for a mass rally, held in what is now Rabin Square in Tel Aviv on April 1, 1978, titled \"Peace Now.\" It became the name of the organization, the first political bumper sticker in Israel and it is still one of Israel's most popular stickers. Tartakover, commenting in 2006, said \"The movement activists liked the logo, [b]ut they thought there should also be a symbol. I told them it wasn't needed - this is the symbol. It took time until they understood that this was the first political sticker in Israel.\" The logo combines two typefaces, \"Shalom\" (peace) in black traditional Koren Bible Type (designed by Eliyahu Koren) and \"Achshav\" (now) in the red headline-style Haim Type (designed by Jan Le Witt)."]}, {"page": "Jean Cassou", "response": ["*Jan Le Witt, by Sir Herbert Read and Jean Cassou, 1971"]}, {"page": "George Him", "response": ["Him was born Jerzy Himmelfarb in 1900 to  a Polish-Jewish family in Lodz, which was then in the Russian Empire and is now in Poland. After  schooling and further education  in Warsaw Him studied Roman Law in Moscow but left in 1917 when the Russian Revolution forced the closure of the university he was attending. He moved to Bonn and by 1924 had completed a PhD at the University of Bonn on the comparative history of religions before deciding to study graphic art in Leipzig. Him studied at the Leipzig Academy of Graphic Art but even before he graduated in 1928 was already undertaking commercial commissions. Him returned to Poland where, in 1933, he changed his name and also established a design partnership with Jan Le Witt. Working as Lewitt-Him, the two established a distinctive design style which combined cubist and surrealist elements, often in a humorous context. Their most notable work in Poland were illustrations for an experimental poetry group known as Skamander."]}, {"page": "Lewitt-Him", "response": ["#REDIRECT Jan Le Witt"]}]}}