{"wiki_id": "http://www.wikidata.org/entity/Q1386232", "itemLabel": "Owen Chadwick", "itemDescription": "English academic, priest and rugby union player (1916-2015)", "wikipedia_url": "https://en.wikipedia.org/wiki/Owen_Chadwick", "wikipedia_page": {"main": "William Owen Chadwick  (20 May 1916 – 17 July 2015) was a British Anglican priest, academic, rugby international, writer and prominent historian of Christianity. As a leading academic, Chadwick became Dixie Professor of Ecclesiastical History from 1958 to 1968 and Regius Professor of History from 1968 to 1983. From 1956 to 1983, Chadwick was elected and served as the Master of Selwyn College, Cambridge.\nIn his obituaries, Chadwick was described as \"one of the great religious historians of our time\" by The Independent, and as \"one of the most remarkable men of letters of the 20th century\" by The Guardian.", "link_mentions": [{"page": "July 17", "response": ["*  2015   – Owen Chadwick, English rugby player, historian, and academic (b. 1916)"]}, {"page": "May 20", "response": ["*1916 – Owen Chadwick, English rugby player, historian, and academic (d. 2015)"]}, {"page": "Pope Pius XII", "response": ["Several authors have alleged a plot to kidnap Pius XII by the Nazis during their occupation of Rome in 1943 (Vatican City itself was not occupied); British historian Owen Chadwick and the Jesuit ADSS editor Rev. Robert Graham each concluded such claims were an intentional creation of the Political Warfare Executive.Chadwick, 1988, pp. 256–257.Alvarez and Graham, 1997, pp. 86–88. However, in 2007, subsequent to those accounts, Dan Kurzman published a work which he maintains establishes that the plot was a fact.Kurzman, 2007, p. 12"]}, {"page": "Victorian era", "response": ["Religion was a battleground during this era, with the Nonconformists fighting bitterly against the established status of the Church of England, especially regarding education and access to universities and public office. Penalties on Roman Catholics were mostly removed. The Vatican restored the English Catholic bishoprics in 1850 and numbers grew through conversions and immigration from Ireland.Owen Chadwick, The Victorian church (1966) 1:7–9, 47–48.  The Oxford Movement was also occurring around this time, which would draw in new converts to the Catholic Church; among these was John Henry Newman.  Secularism and doubts about the accuracy of the Old Testament grew as the scientific outlooked rapidly gained ground among the better educated. Walter E. Houghton argues, \"Perhaps the most important development in 19th-century intellectual history was the extension of scientific assumptions and methods from the physical world to the whole life of man.\"Walter E. Houghton, The Victorian Frame of Mind, 1830–1870 (1957) p 33.", "The abstract theological or philosophical doctrine of agnosticism, whereby it is theoretically impossible to prove whether or not God exists, suddenly became a popular issue around 1869, when T. H. Huxley coined the term. It was much discussed for several decades, and had its journal edited by William Stewart Ross (1844–1906) the Agnostic Journal and Eclectic Review. Interest petered out by the 1890s, and when Ross died the Journal soon closed. Ross championed agnosticism in opposition not so much to Christianity, but to atheism, as expounded by Charles BradlaughAlastair Bonnett 'The Agnostic Saladin' History Today (2013), 63#2, pp. 47–52 The term \"atheism\" never became popular. Blasphemy laws meant that promoting atheism could be a crime and was vigorously prosecuted.Owen Chadwick, The Victorian Church: Vol 1 1829–1859 (1966) pp 487–89. Charles Southwell was among the editors of an explicitly atheistic periodical, Oracle of Reason, or Philosophy Vindicated, who were imprisoned for blasphemy in the 1840s.Edward Royle, Victorian Infidels: the origins of the British secularist movement, 1791–1866 (1972) pp 86–88.  online"]}, {"page": "1916", "response": ["** Owen Chadwick, British author and historian (d. 2015)"]}, {"page": "University of East Anglia", "response": ["* Owen Chadwick (1984–1994)"]}, {"page": "British Academy", "response": ["*Owen Chadwick 1981–1985"]}, {"page": "Gifford Lectures", "response": ["*1973–74  Owen Chadwick  The Secularisation of the European Mind in the 19th Century, "]}, {"page": "Bromley", "response": ["Owen Chadwick was born in Bromley in 1916. He was awarded the Order of Merit, was Vice Chancellor of University of Cambridge, Master of Selwyn Cambridge, Regius Professor of Modern History, Dixie Professor of Ecclesiastical History, Chancellor of University of Anglia, President of the British Academy, and was a Rugby Union International."]}, {"page": "List of members of the Order of Merit", "response": ["| 145. ||  ||  || The Reverend Owen Chadwick || 11 November 1983 || 20 May 1916 – 17 July 2015 || Priest, Historian"]}, {"page": "Michael Ramsey", "response": ["*Owen Chadwick. Michael Ramsey: A Life. Oxford: Clarendon Press, 1990. "]}, {"page": "Eamon Duffy", "response": ["Duffy was born on 9 February 1947, in Dundalk, Ireland.\"Confessions of a Cradle Catholic\" He describes himself as a \"cradle Catholic\". He was educated at St Philip's School and the University of Hull. He undertook postgraduate research at the University of Cambridge, where his doctoral advisers were Owen Chadwick and Gordon Rupp."]}, {"page": "David Sheppard", "response": ["Sheppard was converted to evangelical Christianity whilst at Cambridge, influenced by Donald Grey Barnhouse, and trained for the ministry at Ridley Hall, Cambridge from 1953 to 1955, where he attended the lectures of Owen Chadwick and Maurice Wiles, and was much impressed by a visiting lecturer, Donald Soper. He was involved with the ministry of E. J. H. Nash.Manwaring, Randle (2002) From Controversy to Co-Existence: Evangelicals in the Church of England 1914–1980. Cambridge: Cambridge University Press. p. 58.  He was ordained in 1955, serving his title as curate at St Mary's Church, Islington, but continued to play Test cricket sporadically until 1963, being the first ordained minister to do so.  From early 1958, he and his wife lived in Canning Town, working at the Mayflower Family Centre."]}, {"page": "Romanes Lecture", "response": ["* 1983  Owen Chadwick — Religion and Society"]}, {"page": "Category talk:English historians", "response": ["List of all pages in category English historians retrieved by PockBot.PockBot is currently Undergoing Trials. If you have any comments on its performance please leave them at Wikipedia:Bots/Requests_for_approval/PockBotArticleClass / StatusPeter Ackroydnot yet classifiedHarold Actonnot yet classifiedJohn Dalberg-Acton, 1st Baron Actonnot yet classifiedAethelweardnot yet classifiedGrace Aguilarnot yet classifiedLucy Aikinnot yet classifiedAilred of Rievaulxnot yet classifiedGeoffrey Aldermannot yet classifiedSir Archibald Alisonnot yet classifiedAndrew Allamnot yet classifiedGeorge Allan (antiquary)not yet classifiedWilliam Edward David Allennot yet classifiedAlured of Beverleynot yet classifiedJames Pettit Andrewsnot yet classifiedWilliam Archer (critic)not yet classifiedGeoffrey Ashenot yet classifiedHarold Brakspearnot yet classifiedRichard Baker (chronicler)not yet classifiedJohn Baker (legal historian)not yet classifiedAdolphus Ballardnot yet classifiedJoshua Barnesnot yet classifiedCorrelli BarnettStartHugh Bichenonot yet classifiedRobert Blake, Baron Blakenot yet classifiedWilliam Henry Blissnot yet classifiedRichard Bonneynot yet classifiedGerald Brenannot yet classifiedFrancis Brinkleynot yet classifiedOscar Browningnot yet classifiedKevin Brownlownot yet classifiedHenry Thomas Bucklenot yet classifiedJames Burneynot yet classifiedWilliam Camdennot yet classifiedJohn Capgravenot yet classifiedEdward Cardwellnot yet classifiedGeorge Carewnot yet classifiedThomas Cartenot yet classifiedPaul Cartledgenot yet classifiedChristopher Catherwoodnot yet classifiedWilliam Cavenot yet classifiedHector Munro Chadwicknot yet classifiedOwen Chadwicknot yet classifiedAllan Chapmannot yet classifiedWinston Churchill14px GAEdward Hyde, 1st Earl of Clarendonnot yet classifiedAlan Clarknot yet classifiedKenneth Clarknot yet classifiedBob Clarke (historian)not yet classifiedRobert Conquestnot yet classifiedCharles Henry Coopernot yet classifiedWilliam Coxenot yet classifiedMandell Creightonnot yet classifiedAndrew Dalbynot yet classifiedSamuel Danielnot yet classifiedBasil Davidsonnot yet classifiedGodfrey Daviesnot yet classifiedChristopher Dawsonnot yet classifiedGoldsworthy Lowes Dickinsonnot yet classifiedDavid Diringernot yet classifiedJohn Andrew Doylenot yet classifiedWilliam Dugdalenot yet classifiedAlfred Duggannot yet classifiedThomas Henry Dyernot yet classifiedBryan Edwardsnot yet classifiedLeonard Elliott Elliot-Binnsnot yet classifiedThomas Elmhamnot yet classifiedGeorge Finlaynot yet classifiedMoses I. Finleynot yet classifiedPercy Hethrington Fitzgeraldnot yet classifiedRobin Lane Foxnot yet classifiedJames Anthony Froudenot yet classifiedFrancis Aidan Cardinal Gasquetnot yet classifiedGeoffrey the Bakernot yet classifiedEdward GibbonStartMartin Gilbertnot yet classifiedRobert Gildeanot yet classifiedMary Anne Everett Greennot yet classifiedVivian H. H. Greennot yet classifiedHenry Melvill Gwatkinnot yet classifiedE. E. Y. Halesnot yet classifiedEdward Hallnot yet classifiedHenry Hallamnot yet classifiedJohn Hardyngnot yet classifiedEdward Hastednot yet classifiedPeter Hennessynot yet classifiedHenry of Huntingdonnot yet classifiedChristopher Hibbertnot yet classifiedAndrew Hignellnot yet classifiedChristopher Hill (historian)not yet classifiedHarry Hinsleynot yet classifiedPatricia Hollis, Baroness Hollis of Heighamnot yet classifiedJ. C. Holtnot yet classifiedW. G. Hoskinsnot yet classifiedWilliam Howittnot yet classifiedBettany Hughesnot yet classifiedWilliam Hutton (Birmingham historian)not yet classifiedDavid Irvingnot yet classifiedCatherine Jacksonnot yet classifiedJohn Heneage Jessenot yet classifiedJohn S. Conwaynot yet classifiedJohn of Hexhamnot yet classifiedJohn Jortinnot yet classifiedJohn Keaynot yet classifiedIan Kershawnot yet classifiedAlexander William Kinglakenot yet classifiedHenry Knightonnot yet classifiedRichard Knollesnot yet classifiedPeter Laslettnot yet classifiedBernard Lewisnot yet classifiedJohn Lingardnot yet classifiedCatherine Macaulaynot yet classifiedThomas Babington Macaulay, 1st Baron Macaulaynot yet classifiedDiarmaid MacCullochnot yet classifiedJohn Maddicottnot yet classifiedHenry James Sumner Mainenot yet classifiedFrederic William Maitlandnot yet classifiedNoel Malcolmnot yet classifiedGeorge Bruce Mallesonnot yet classifiedTheodore Augustine Mannnot yet classifiedThomas Maynot yet classifiedCharles Merivalenot yet classifiedWilliam Nassau Molesworthnot yet classifiedPhilip Morantnot yet classifiedJames Augustus Cotter Morisonnot yet classifiedLewis Bernstein Namiernot yet classifiedJohn Julius Norwichnot yet classifiedDimitri Obolenskynot yet classifiedRichard Ollardnot yet classifiedRobin Osbornenot yet classifiedHenry Nutcombe Oxenhamnot yet classifiedFrancis Palgravenot yet classifiedMatthew Parisnot yet classifiedC. Northcote Parkinsonnot yet classifiedMichael Pearsonnot yet classifiedLiza Picardnot yet classifiedCharles Plummernot yet classifiedAlbert Pollardnot yet classifiedFrederick York Powellnot yet classifiedF. M. Powickenot yet classifiedJohn Prebblenot yet classifiedH. F. M. Prescottnot yet classifiedAnthony Preston (naval historian)not yet classifiedJames Rennellnot yet classifiedRicardian (Richard III)not yet classifiedRichard of Hexhamnot yet classifiedAndrew Robertsnot yet classifiedMichael Roberts (historian)not yet classifiedJohn C. G. Röhlnot yet classifiedFrederick Rolfenot yet classifiedJohn Holland Rosenot yet classifiedEmma Georgina Rothschildnot yet classifiedMichael Ernest Sadlernot yet classifiedJohn Saltmarshnot yet classifiedDominic Sandbrooknot yet classifiedNigel Saulnot yet classifiedSimon Schamanot yet classifiedJohn Robert Seeleynot yet classifiedMartin Sharp (journalist)not yet classifiedJane Shawnot yet classifiedWalter Sichelnot yet classifiedRaleigh Ashlin Skeltonnot yet classifiedDavid Smith (historian)not yet classifiedRichard Southernnot yet classifiedGeorge Speaightnot yet classifiedJohn Spelmannot yet classifiedDavid Starkeynot yet classifiedLawrence Stonenot yet classifiedAgnes Stricklandnot yet classifiedJohn Strypenot yet classifiedWilliam Stubbsnot yet classifiedRichard Talbertnot yet classifiedWilliam Woodthorpe Tarnnot yet classifiedAlasdair and Hettie Taylernot yet classifiedA. J. P. Taylornot yet classifiedArnold Fitz Thedmarnot yet classifiedConnop Thirlwallnot yet classifiedThomas Wykesnot yet classifiedE. P. Thompsonnot yet classifiedEmma Elizabeth Thoytsnot yet classifiedH. W. Timperleynot yet classifiedHugh Tootellnot yet classifiedJoshua Toulminnot yet classifiedMichael Trappes-Lomaxnot yet classifiedG. M. Trevelyannot yet classifiedSir George Trevelyan, 2nd Baronetnot yet classifiedHugh Trevor-Roper, Baron Dacre of Glantonnot yet classifiedAndrew White Tuernot yet classifiedSharon Turnernot yet classifiedKenneth Turpinnot yet classifiedRobert Vaughannot yet classifiedOrderic Vitalisnot yet classifiedAndrew Wallace-Hadrillnot yet classifiedSpencer Walpolenot yet classifiedAdolphus William Wardnot yet classifiedVeronica Wedgwoodnot yet classifiedJohn Wheeler-Bennettnot yet classifiedThomas Abingtonnot yet classifiedArthur Agardenot yet classifiedJohn Yonge Akermannot yet classifiedAnthony Allennot yet classifiedJohn Anstisnot yet classifiedJohn Anstis, youngernot yet classifiedElias Ashmolenot yet classifiedJohn Aubreynot yet classifiedJoseph Ayloffenot yet classifiedThomas Baker (antiquarian)not yet classifiedChristopher Barkernot yet classifiedDaines Barringtonnot yet classifiedJohn Thomas Blightnot yet classifiedMatthew Bloxamnot yet classifiedWilliam Copeland Borlasenot yet classifiedJohn Brandnot yet classifiedEdward Wedlake Brayleynot yet classifiedWilliam Bright, D.D.not yet classifiedJohn Britton (antiquary)not yet classifiedGeorge Bucknot yet classifiedWilliam Bullock (collector)not yet classifiedRichard Burnnot yet classifiedRichard Carewnot yet classifiedRichard Chandlernot yet classifiedSimonds d'Ewesnot yet classifiedJohn Evans (archaeologist)not yet classifiedLewis Evans (collector)not yet classifiedFrederick William Fairholtnot yet classifiedThomas Dudley Fosbrokenot yet classifiedAugustus Wollaston Franksnot yet classifiedJohn Frerenot yet classifiedRichard Gough (antiquarian)not yet classifiedEdwin Guestnot yet classifiedJohn Guillimnot yet classifiedRobert Stephen Hawkernot yet classifiedThomas Hearnenot yet classifiedJoseph Hunternot yet classifiedKenneth Hamilton Jenkinnot yet classifiedJohn Battelynot yet classifiedWilliam Lambardenot yet classifiedAshton Levernot yet classifiedCharles Herbert Mayonot yet classifiedWilliam Nicolsonnot yet classifiedWilliam Oldysnot yet classifiedFrancis Pecknot yet classifiedMargaret Bentinck, Duchess of Portlandnot yet classifiedJames Prinsepnot yet classifiedGerald Henry Rendallnot yet classifiedJoseph Ritsonnot yet classifiedJohn Seldennot yet classifiedCharles Hamilton SmithStubHenry Spelmannot yet classifiedJohn Stownot yet classifiedWilliam Stukeleynot yet classifiedMerlin Hanbury-Tracy, 7th Baron Sudeleynot yet classifiedJohn Timbsnot yet classifiedRoger Twysdennot yet classifiedGeorge Vertuenot yet classifiedJohn Weevernot yet classifiedAnthony Woodnot yet classifiedThomas Wrightnot yet classifiedJohn Aylmer (English constitutionalist)not yet classifiedWalter Bagehotnot yet classifiedA. V. Diceynot yet classifiedGeoffrey Rudolph Eltonnot yet classifiedStephen Gardinernot yet classifiedJohn Hooker (English constitutionalist)not yet classifiedJames I of Englandnot yet classifiedErskine May, 1st Baron Farnboroughnot yet classifiedWilliam Stoughton (English constitutionalist)not yet classifiedEdward Aglionbynot yet classifiedEdward Bellasisnot yet classifiedWalter Blountnot yet classifiedJohn Brooke-Littlenot yet classifiedWilliam Brugesnot yet classifiedSamuel Egerton Brydgesnot yet classifiedBernard Burkenot yet classifiedAlfred Butlernot yet classifiedClive Cheesmannot yet classifiedPeter Wilson Coldhamnot yet classifiedRodney Dennysnot yet classifiedGilbert Dethicknot yet classifiedWilliam Dethicknot yet classifiedAlan Dickinsnot yet classifiedPatric Laurence Dickinsonnot yet classifiedArthur Charles Fox-Daviesnot yet classifiedJames Frerenot yet classifiedRichard Graham-Viviannot yet classifiedEverard Greennot yet classifiedPeter Gwynn-Jonesnot yet classifiedIsaac Heardnot yet classifiedCecil Humphery-Smithnot yet classifiedWilliam Hunt (officer of arms)not yet classifiedThomas Joseph-Watkinnot yet classifiedGregory Kingnot yet classifiedHenry Lane (officer of arms)not yet classifiedEdmund Lodgenot yet classifiedRoger Machado (officer of arms)not yet classifiedMichael Maclagannot yet classifiedHenry Robert Charles Martinnot yet classifiedRobin de la Lanne-Mirrleesnot yet classifiedNicholas Harris Nicolasnot yet classifiedPeter O'Donoghuenot yet classifiedHenry Paston-Bedingfeldnot yet classifiedJohn Philipotnot yet classifiedLeslie Pinenot yet classifiedJames Planchénot yet classifiedArchibald Russellnot yet classifiedAlfred Scott-Gattynot yet classifiedWilfrid Scott-Gilesnot yet classifiedRichard St Georgenot yet classifiedFrancis Thynnenot yet classifiedAubrey Toppinnot yet classifiedCharles Townley (officer of arms)not yet classifiedWilliam Barclay Turnbullnot yet classifiedArthur Vicarsnot yet classifiedAnthony Wagnernot yet classifiedJohn Walker (officer of arms)not yet classifiedJohn Warburton (officer of arms)not yet classifiedDavid White (officer of arms)not yet classifiedCharles Wriothesleynot yet classifiedThomas Wriothesleynot yet classifiedJohn Writhenot yet classifiedLionel Barnettnot yet classifiedRichard Francis Burtonnot yet classifiedJoseph Dacre Carlylenot yet classifiedBasil Hall Chamberlainnot yet classifiedDuncan Forbesnot yet classifiedNathaniel Brassey Halhednot yet classifiedThomas Hydenot yet classifiedWilliam Jones (philologist)not yet classifiedEdward William Lanenot yet classifiedSamuel Leenot yet classifiedWilliam Marsden (orientalist)not yet classifiedReynold A. Nicholsonnot yet classifiedE. A. Wallis Budgenot yet classifiedCharles Wilkinsnot yet classifiedEdit by PockBot (on behalf of PocklingtonDan)"]}, {"page": "John Cassian", "response": ["For instance, Anglican priest and historian Owen Chadwick stated that Cassian held that man can come to God without the intervention of divine grace first; and the Presbyterian theologian B. B. Warfield called Cassian the leader of the monastics in southern Gaul who asserted that men begin their turning to God and that God assists that beginning."]}, {"page": "Hethersett", "response": ["In Victorian Miniature, Owen Chadwick gives us a detailed account of life in the area in the middle of the 19th century. The Rev William Waite Andrew, the Vicar of Ketteringham and one of the two central characters in the book, lived at Woodhall which he bought for £3,600 in 1841, and to which he added a new western extension."]}, {"page": "John Cornwell (writer)", "response": ["In 1999, Cornwell published Hitler's Pope, in which he accuses Pope Pius XII of assisting in the legitimisation of the Nazi regime in Germany through the pursuit of a Reichskonkordat in 1933 and of remaining silent, like the Allies, after  information about the Holocaust was released to the public in late 1942 and early 1943. Owen Chadwick praised the book's scholarly approach and the abundance of new information Cornwell had managed to unearth."]}, {"page": "Edward King (bishop of Lincoln)", "response": ["In 1888, a complaint by a churchwarden from Cleethorpes, funded by the Church Association, concerning a service conducted at St Peter at Gowts church in Lincoln, was brought against King. He stood accused of tolerating six ritualistic practices. To avoid King's prosecution in a lay court under the Public Worship Regulation Act 1874, Benson revived his own archiepiscopal court (inactive since 1699).Owen Chadwick, The Victorian Church, Part 2, Adam & Charles Black: place, 1980, p. 354. In his \"Lincoln Judgment\", he found against King on two counts and also required him to conduct the manual acts during the prayer of consecration in the service of Holy Communion in such a way that the people could see them. Benson specifically allowed the use of lighted candles, and mixing of elements, as well as the eastward position during the service."]}, {"page": "William Owen Chadwick", "response": ["#REDIRECT Owen Chadwick"]}, {"page": "The Newman Society", "response": ["thumb|280px|The founders of the Catholic Club, 1878; second-from-right, Gerard Manley HopkinsFounded as the Catholic Club in 1878, it was not until 1888 that the club was renamed the Newman Society. At the time, the renaming of the society was not uncontroversial; Lord Acton, whose son Dick was amongst those involved in the changing of the name, counselled him to be careful. Owen Chadwick describes his letter of advice thus:"]}, {"page": "Under His Very Windows", "response": ["In his review in The Tablet, historian Owen Chadwick whose work focuses on Christianity and the Papacy, calls Under His Very Windows, \"not history but guesswork.\"  Chadwick's review states, \"when the Germans occupied Italy she [Zucotti] thinks that the Pope could have informed church leaders that he would look favourably on help to the Jewish fugitives, and could have warned the Germans that he would protest forcibly and publicly at any deportations of Jews from Rome. All this is not history but guesswork, and one or two guesses have a more than minuscule improbability. \"Faced with the certainty of papal condemnation, the Germans might possibly have postponed anti-Jewish actions in Italy\", she suggests. Imagination boggles at what would have been said when such a message from the Pope was read at Hitler's headquarters, if it ever reached that height and if anyone round the table bothered to do more than laugh. Anyone who thinks otherwise should read the devastatingly uncompromising speech which Himmler made to SS leaders at Posen on a vital date for Italy, the beginning of October 1943.\"Pius XII's terrifying dilemma"]}, {"page": "D'Arcy Osborne, 12th Duke of Leeds", "response": ["Using the code name \"Mount\", he was one of the group, which he supported with his own money, led by Monsignor Hugh O'Flaherty and a French diplomat François de Vial who helped conceal some 4,000 escapees, whether Jews or Allied soldiers, from the Nazis: 3,925 survived the war. Their story was portrayed in the 1983 film The Scarlet and the Black, starring Gregory Peck. He also played a key part in a plot in 1940, which involved the Pope and certain German generals, to overthrow Hitler.Owen Chadwick's Britain and the Vatican During the Second World War, (1988, Cambridge University Paperback Library), p. 86 et seq. Major Sam Derry, in his book The Rome Escape Line, described meeting Sir D'Arcy in the Vatican in 1943:Unruffled poise... Seldom have I met any man in whom I had such immediate confidence. He welcomed us warmly, yet I found it impossible to behave with anything but strict formality. Apart from the restraining influence of my clothing [he was disguised as a monsignor] I was almost overwhelmed by an atmosphere of old-world English courtliness and grace which I had thought belonged only to the country-house parties of long ago. Sir D'Arcy was spry, trim, a young sixty, but he had spent years enough in the diplomatic service to develop an astonishing aptitude for creating around himself an aura of all that was most civilized in English life. I felt as though I had returned home after long travels, to find that royalty had come to dinner, and I had to be on my best behaviour.Sam Derry (1960), The Rome Escape Line, New York: Norton, (Retrieved 1 November 2017), p. 43.", "Osborne kept an extensive diary, portions of which were used by Owen Chadwick as the basis of his 1980 Ford Lectures and his 1988 book, Britain and the Vatican during the Second World War. Chadwick's quotations from Osborne's diary included: \"I reached the grave conclusion during the Mass that I am nothing but a pencilled marginal note in the Book of Life. I am not in the main text at all.\"Owen Chadwick, Britain and the Vatican during the Second World War, Cambridge: Cambridge University Press, p. 128. Retrieved 1 November 2017. The diary is in the collections of the British Library."]}]}}