{"wiki_id": "http://www.wikidata.org/entity/Q1380014", "itemLabel": "Laurie Baker", "itemDescription": "English architect", "wikipedia_url": "https://en.wikipedia.org/wiki/Laurie_Baker", "wikipedia_page": {"main": "Lawrence Wilfred \"Laurie\" Baker (2 March 1917 – 1 April 2007) was a British-born Indian architect, renowned for his initiatives in cost-effective energy-efficient architecture and designs that maximized space, ventilation and light and maintained an uncluttered yet striking aesthetic sensibility. Influenced by Mahatma Gandhi and his own experiences in the remote Himalayas, he promoted the revival of regional building practices and use of local materials; and combined this with a design philosophy that emphasized a responsible and prudent use of resources and energy. He was a pioneer of sustainable architecture as well as organic architecture, incorporating in his designs even in the late 1960s, concepts such as rain-water harvesting, minimizing usage of energy-inefficient building materials, minimizing damage to the building site and seamlessly merging with the surroundings. Due to his social and humanitarian efforts to bring architecture and design to the common man, his honest use of materials, his belief in simplicity in design and in life, and his staunch Quaker belief in non-violence, he has been called the \"Gandhi of architecture\".He moved to India in 1945 in part as an architect associated with a leprosy mission and continued to live and work in India for over 50 years. He became an Indian citizen in 1989 and resided in Thiruvananthapuram (Trivandrum), Kerala from 1969 and served as the Director of COSTFORD (Centre of Science and Technology for Rural Development), an organisation to promote low-cost housing.\nIn 1981, the Royal University of the Netherlands conferred an honour (the previous recipient of this honour, in 1980, was Hassan Fathy of Egypt) upon him for outstanding work in a Third World country. In 1983 he was conferred with an MBE (Member of the Order of the British Empire) at Buckingham Palace. In 1990, the Government of India awarded him the Padma Shri for his meritorious service in the field of architecture. In 1992, he was awarded the Roll of Honour by the United Nations. In 1988, he was granted Indian citizenship, the only honour he actively pursued in his life.", "link_mentions": [{"page": "1917", "response": ["** Laurie Baker, English architect (d. 2007)"]}, {"page": "Thiruvananthapuram", "response": ["Apart from the famous Padmanabhaswamy Temple, the city's architecture is championed by the Napier Museum and Thiruvananthapuram Zoo, one of the oldest zoos in India. Other architectural landmarks include Kuthira Malika Palace, Kowdiar Palace, Attukal temple, Beemapally Mosque, Connemara Market, and the Mateer Memorial Church. Thiruvananthapuram was the main centre of Laurie Baker's architecture."]}, {"page": "List of architects", "response": ["*Laurie Baker (1917–2007), UK/India"]}, {"page": "Appropriate technology", "response": ["B.V. Doshi,see http://www.indiaenvironmentportal.org.in/node/5799 and http://www.auroville.org/thecity/architecture/two_at_once.htm  BV Doshi as AT founder Buckminster Fuller, William Moyer (1933–2002), Amory Lovins, Sanoussi Diakité, Albert Bates, Victor Papanek, Giorgio Ceragioli (1930–2008), Frithjof Bergmann, Arne Næss, (1912–2009), Mansur Hoda, and Laurie Baker."]}, {"page": "Paisley (design)", "response": ["Paisley was a favorite design element of British-Indian architect Laurie Baker. He has made numerous drawings and collages of what he called \"mango designs\". He used to include the shape in the buildings he designed also."]}, {"page": "Birmingham City University", "response": ["Notable graduates of the University and its predecessor institutions working in broadcasting include children's television presenter Kirsten O'Brien,  sports TV presenter Mary Rhodes, radio and TV presenters Fiona Phillips, Zoë Ball, Margherita Taylor and Phil Upton, investigative journalist Mark Williams-Thomas. Laurie Baker (1917–2007), British-born architect, Patrick le Quément, Chief of Design, Renault, Saiman Miah, designer of the £5 Olympic coins for London 2012 Games and Yemisi Akinbobola, founder IQ4News and African Women in the Media. Several work in broadcast journalism, such as Sky News news presenter Marverine Cole  and BBC news presenter Charlie Stayt."]}, {"page": "2007 in India", "response": ["* 1 April – Laurie Baker, English-born architect (b. 1917)"]}, {"page": "Hassan Fathy", "response": ["*Laurie Baker"]}, {"page": "1917 in architecture", "response": ["* March 2 – Laurie Baker, British-born Indian architect, known for his initiatives in cost-effective energy-efficient architecture (died 2007)"]}, {"page": "Vernacular architecture", "response": ["* Laurie Baker"]}, {"page": "Friends' Ambulance Unit", "response": ["*Laurie Baker (1917–2007), architect"]}, {"page": "Loyola School, Thiruvananthapuram", "response": ["The Loyola crest is in the form of a red shield with seven red bars on the top, a Nilavilakku in the center, and at the bottom the Christogram IHS (the first three letters of \"Jesus\" in Greek). The seven red bars at the top are from the shield of Oñaz-Loyola, the family of Ignatius of Loyola, the founder of the Society of Jesus. The Nilavilakku, a traditional lamp used in Kerala, symbolizes the culture of Kerala where the school is located, and also light, wisdom, and education. Taken as a whole, the school crest means: Loyola School where Jesuits are serving the people of Kerala in education. The renowned architect Laurie Baker, whose son Tilak studied in Loyola, designed the crest.The Principal's Annual Report, The Loyolite, 1974"]}]}}