{"wiki_id": "http://www.wikidata.org/entity/Q1382109", "itemLabel": "Nicholas Kemmer", "itemDescription": "British physicist", "wikipedia_url": "https://en.wikipedia.org/wiki/Nicholas_Kemmer", "wikipedia_page": {"main": "Nicholas Kemmer  (7 December 1911 – 21 October 1998) was a Russian-born nuclear physicist working in Britain, who played an integral and leading edge role in United Kingdom's nuclear programme, and was known as a mentor of Abdus Salam – a Nobel laureate in physics.", "link_mentions": [{"page": "Cavendish Laboratory", "response": ["In World War II the laboratory carried out research for the MAUD Committee, part of the British Tube Alloys project of research into the atomic bomb. Researchers included Nicholas Kemmer, Alan Nunn May, Anthony French, Samuel Curran and the French scientists including Lew Kowarski and Hans von Halban. Several transferred to Canada in 1943; the Montreal Laboratory and some later to the Chalk River Laboratories."]}, {"page": "List of theoretical physicists", "response": ["* Nicholas Kemmer (1911–1998)"]}, {"page": "Tube Alloys", "response": ["This new development was also confirmed in independent work by Edwin M. McMillan and Philip Abelson at Berkeley Radiation Laboratory also in 1940. Nicholas Kemmer of the Cambridge team proposed the names neptunium for the new element 93 and plutonium for 94 by analogy with the outer planets Neptune and Pluto beyond Uranus (uranium being element 92). The Americans fortuitously suggested the same names. The production and identification of the first sample of plutonium in 1941 is generally credited to Glenn Seaborg, using a cyclotron rather than a reactor at the University of California. In 1941, neither team knew of the existence of the other."]}, {"page": "Max Planck Medal", "response": ["*1983 Nicholas Kemmer"]}, {"page": "John Clive Ward", "response": ["With his Harmsworth scholarship expiring, and seeing few prospects at Oxford, Ward responded to a job advertisement from the University of Sydney. He was offered a position, but when he arrived, found that it was for a tutor, and not a lecturer. He therefore served out the year, then returned to Oxford to complete his Doctor of Philosophy (D.Phil.) thesis on \"Some Properties of the Elementary Particles\". Ward expected that his thesis, an elaboration of his 1947 paper, would be easily approved by the external examiner, Nicholas Kemmer, but at the last minute Kemmer's place was taken by Rudolf Peierls, who refused to accept it. Only after a forceful argument by the internal examiner, J. de Witt, was the thesis awarded."]}, {"page": "MAUD Committee", "response": ["The division of the MAUD Committee at Cambridge was jointly led by Bragg and Cockcroft. It included Bretscher, Feather, Halban, Kowarski, Herbert Freundlich and Nicholas Kemmer. Paul Dirac assisted as a consultant, although he was not formally part of the team. On 19 June 1940, following the German invasion of France, Halban, Kowarski and other French scientists and their families, along with their precious stock of heavy water, were brought to England by the Earl of Suffolk and Major Ardale Golding on the steamer . The heavy water, valued at £22,000, was initially kept at HM Prison Wormwood Scrubs, but was later secretly stored in the library at Windsor Castle. The French scientists moved to Cambridge, where they conducted experiments that conclusively showed that a nuclear chain reaction could be produced in a mixture of uranium oxide and heavy water."]}, {"page": "Richard Dalitz", "response": ["Born in the town of Dimboola, Victoria, Dalitz studied physics and mathematics at Melbourne University before moving to the United Kingdom in 1946, to study at the University of Cambridge. His PhD was awarded in 1950 for research on zero-zero transitions in the atomic nucleus supervised by Nicholas Kemmer.", "His research collaborators included Hans Bethe, Frank Close, F. J. Duarte, Freeman Dyson, Nicholas Kemmer, Rudolf Peierls, Christopher Llewellyn Smith and John Clive Ward."]}, {"page": "Plutonium", "response": ["McMillan had recently named the first transuranic element neptunium after the planet Neptune, and suggested that element 94, being the next element in the series, be named for what was then considered the next planet, Pluto. Nicholas Kemmer of the Cambridge team independently proposed the same name, based on the same reasoning as the Berkeley team. Seaborg originally considered the name \"plutium\", but later thought that it did not sound as good as \"plutonium\"."]}, {"page": "Egon Bretscher", "response": ["Born near Zurich, Switzerland and educated at the Eidgenössische Technische Hochschule (ETH) there, Bretscher gained a PhD degree in organic chemistry at Edinburgh in 1926. He returned to Zurich as privat docent to Peter Debye, later moving in 1936 to work in Rutherford’s laboratory at the Cavendish in Cambridge as a Rockefeller Scholar. Here he switched to research in nuclear physics, proposing (with Norman Feather) in 1940 that the 239 isotope of element 94 could be produced from the common isotope of uranium-238 by neutron capture and that, like U-235, this should be able to sustain a nuclear chain reaction. A similar conclusion was independently arrived at by Edwin McMillan and Philip Abelson at Berkeley Radiation Laboratory. In addition, he devised theoretical chemical procedures for purifying this unknown element away from the parent uranium; this element was named plutonium by Nicholas Kemmer."]}, {"page": "Norman Feather", "response": ["Bretscher and Feather showed theoretically feasible grounds that element 94 would be readily 'fissionable' by both slow and fast neutrons, and had the added advantage of being chemically different from uranium and therefore could easily be separated from it. This was confirmed independently in 1940 by Edwin M. McMillan and Philip Abelson at the Berkeley Radiation Laboratory. Nicholas Kemmer of the Cambridge team proposed the names Neptunium for the new element 93 and Plutonium for 94 by analogy with the outer planets Neptune and Pluto beyond Uranus (uranium being element 92). The Americans fortuitously suggested the same names. The production and identification of the first sample of plutonium in 1941 is generally credited to Glenn Seaborg, who used a cyclotron rather than a reactor."]}, {"page": "List of fellows of the Royal Society J, K, L", "response": ["| Nicholas Kemmer||15 March 1956||7 December 1911 – 21 October 1998"]}, {"page": "Beatrice Worsley", "response": ["Worsley then began her PhD at Newnham College. While working at the Lab, she attended courses on quantum physics with Paul Dirac, John Lennard-Jones and Nicholas Kemmer, number theory with Albert Ingham, and perhaps most importantly, numerical analysis with Douglas Hartree. She began writing her dissertation under Hartree, who coincidentally also supervised another Canadian woman, Charlotte Fischer."]}, {"page": "Duffin–Kemmer–Petiau algebra", "response": ["In mathematical physics, the Duffin–Kemmer–Petiau algebra (DKP algebra), introduced by R.J. Duffin, Nicholas Kemmer and G. Petiau, is the algebra which is generated by the Duffin–Kemmer–Petiau matrices. These matrices form part of the Duffin–Kemmer–Petiau equation that provides a relativistic description of spin-0 and spin-1 particles."]}, {"page": "Index of physics articles (N)", "response": ["*Nicholas Kemmer"]}, {"page": "Kemmer", "response": ["*Nicholas Kemmer (1911–1998), Russian-born British physicist"]}, {"page": "List of fellows of the Royal Society elected in 1956", "response": ["#Nicholas Kemmer"]}, {"page": "J. Robert Oppenheimer Memorial Prize", "response": ["*1975 – Nicholas Kemmer"]}, {"page": "Deaths in October 1998", "response": ["*Nicholas Kemmer, 86, Russian-British nuclear physicist."]}, {"page": "Edward Eisner", "response": ["In 1977 he was elected a Fellow of the Royal Society of Edinburgh. His proposers were Kenneth Jack Standley, Nicholas Kemmer, Simon G G MacDonald, and William Cochran."]}, {"page": "Kenneth Le Couteur", "response": ["After the war ended in 1945, Le Couteur returned to Cambridge as a Fellow of St John's College, where he worked on his doctorate. His academic supervisor initially was  Maurice Pryce, but he became the Wykeham Professor of Physics at Oxford University in 1946, and Nicholas Kemmer took over. Le Couteur was awarded a Turner and Newall Fellowship to study at the University of Manchester, where he completed his doctorate in 1948–49 under the supervision of Léon Rosenfeld. His thesis, on Meson Theory, was submitted in 1949, and he was awarded his PhD from Cambridge. At Manchester, he began investigation of the evaporation theory of nuclear disintegration. He also met Enid Margaret Domville, who worked there as a librarian. They were married on 14 July 1950. They had three children, all daughters: Caroline, Penelope and Mary (Avinashi), and a foster daughter, Marion Chesher."]}, {"page": "Lalit Mohan Nath", "response": ["Nath obtained his B.Sc.(Hons.) degree in physics standing first in the First Class in order of merit and his M.Sc. degree in physics standing second in the First Class in order of merit. He then went to the University of Edinburgh to undertake work on electromagnetic interactions of charged particles in the quantum theory of fields of spin-one and -two particles, under the supervision of Nicholas Kemmer and Peter W. Higgs, and obtaining his Ph.D. in theoretical physics in 1964."]}, {"page": "Kemmer, Nicholas", "response": ["#redirectNicholas Kemmer"]}, {"page": "Sidney Michaelson", "response": ["In 1969 he was elected a Fellow of the Royal Society of Edinburgh. His proposers were Nicholas Kemmer, David Finney, Sir Michael Swann and Arthur Erdelyi."]}, {"page": "Gunning Victoria Jubilee Prize", "response": ["*1984: Nicholas Kemmer, for his contributions to the theory of elementary particles"]}, {"page": "Alan Ernest Owen", "response": ["In 1981 he was elected a Fellow of the Royal Society of Edinburgh. His proposers were William Cochran, William Farvis, Robert Allan Smith, Gordon Craig, Nicholas Kemmer and Richard Sillitto."]}, {"page": "List of German physicists", "response": ["* Nicholas Kemmer"]}]}}