{"wiki_id": "http://www.wikidata.org/entity/Q1380129", "itemLabel": "John Cadbury", "itemDescription": "British businessman", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Cadbury", "wikipedia_page": {"main": "John Cadbury (12 August 1801 – 11 May 1889) was a Quaker and English proprietor and founder of Cadbury, the chocolate business based in Birmingham, England.\n\n", "link_mentions": [{"page": "May 11", "response": ["*1889 – John Cadbury, English businessman and philanthropist, founded the Cadbury Company (b. 1801)"]}, {"page": "Cadbury", "response": ["Cadbury was established in Birmingham, England in 1824, by John Cadbury, a Quaker who sold tea, coffee and drinking chocolate. Cadbury developed the business with his brother Benjamin, followed by his sons Richard and George. George developed the Bournville estate, a model village designed to give the company's workers improved living conditions. Dairy Milk chocolate, introduced in 1905, used a higher proportion of milk within the recipe compared with rival products. By 1914, the chocolate was the company's best-selling product. Cadbury, alongside Rowntree's and Fry's, were the big three British confectionery manufacturers throughout much of the 19th and 20th centuries.Richardson, Tim (2002). \"Sweets: A History of Temptation\". p. 255. Bantam Press", "In 1824, John Cadbury, a Quaker, began selling tea, coffee and drinking chocolate in Bull Street in Birmingham, England. From 1831 he moved into the production of a variety of cocoa and drinking chocolates, made in a factory in Bridge Street and sold mainly to the wealthy because of the high cost of production. In 1847, John Cadbury became a partner with his brother Benjamin and the company became known as \"Cadbury Brothers\". In 1847, Cadbury's competitor Fry's of Bristol produced the first chocolate bar (which would be mass-produced as Fry's Chocolate Cream in 1866). Cadbury introduced his brand of the chocolate bar in 1849, and that same year, Cadbury and Fry's chocolate bars were displayed publicly at a trade fair in Bingley Hall, Birmingham.\"Chocolate principles to live by\". p. 159. MJF Books/Fine Communications, 2005 The Cadbury brothers opened an office in London, and in 1854 they received the Royal Warrant as manufacturers of chocolate and cocoa to Queen Victoria. The company went into decline in the late 1850s.", "John Cadbury's sons Richard and George took over the business in 1861. At the time of the takeover, the business was in rapid decline: the number of employees had reduced from 20 to 11, and the company was losing money. By 1866, Cadbury was profitable again. The brothers had turned around the business by moving the focus from tea and coffee to chocolate, and by increasing the quality of their products.", "Located  south of Birmingham in England, the Cadbury plant in Bournville was opened in 1879 by company founder John Cadbury's son George, whose aim was that one-tenth of the Bournville estate should be \"laid out and used as parks, recreation grounds and open space.\" It subsequently became known as \"the factory in a garden\". Cadbury's dark chocolate bar, Bournville, is named after the model village, and was first sold in 1908."]}, {"page": "Chocolate bar", "response": ["In 1847, Joseph Fry discovered a way to mix the ingredients of cocoa powder, sugar and cocoa to manufacture a paste that could then be molded into a solid chocolate bar for consumption. Inspired by Fry, John Cadbury, founder of Cadbury, introduced his brand of the chocolate bar in 1849. That same year, Fry and Cadbury chocolate bars were displayed publicly at a trade fair in Bingley Hall, Birmingham.\"Chocolate principles to live by\". p. 159. MJF Books/Fine Communications, 2005"]}, {"page": "Bull Ring, Birmingham", "response": ["In the centre of the  long,  wide and  tall hall was an ornate bronze fountain, given by the Street Commissioners upon their retirement in 1851. The base was made from Yorkshire sandstone and was  in diameter. It was in the form of a Greek tazza and cost £900. On the inside of the bowl were eight lions' heads from which water was ejected. The entire fountain was  tall and in the centre was a  tall statue called the Messenger and Sons. The statue consisted of four children representative of each of Birmingham's main four industries; gun making, glass-blowing, bronzing and engineering. The fountain was inaugurated by the Chairman of the Market Committee, John Cadbury, on 24 December 1851. The fountain was removed in 1880 with the intention of re-erecting it in Highgate Park later that year but this did not happen and it was destroyed in 1923."]}, {"page": "Cadbury (disambiguation)", "response": ["* John Cadbury (1801–1889), family patriarch, founder of Cadbury plc"]}, {"page": "List of companies named after people", "response": ["* Cadbury – John Cadbury"]}, {"page": "Bournville", "response": ["Having taken over their father John Cadbury's expanding business in 1861, the Quakers George and Richard Cadbury needed to move their cocoa and chocolate factory from Bridge Street in central Birmingham to a greenfield site to allow for expansion.", "* John Cadbury, (1801-1881), founder of Cadbury's chocolate"]}, {"page": "List of people from Birmingham", "response": ["*George Cadbury – Son of John Cadbury, Founder of the Cadbury chocolate company", "*John Cadbury – Founder of the Cadbury chocolate company", "*Richard Cadbury – Son of John Cadbury, Founder of the Cadbury chocolate company"]}, {"page": "George Cadbury", "response": ["George Cadbury (19 September 1839 – 24 October 1922) was the third son of John Cadbury, a Quaker who founded Cadbury's cocoa and chocolate company in Britain. He was the husband of Dame Elizabeth Cadbury."]}, {"page": "List of eponyms (A–K)", "response": ["* John Cadbury, British businessman – Cadbury"]}, {"page": "Richard Cadbury", "response": ["Richard Barrow Cadbury (29 August 1835 – 22 March 1899) was an English entrepreneur, chocolate-maker and philanthropist. He was the second son of the Quaker John Cadbury, founder of Cadbury's cocoa and chocolate company."]}, {"page": "Coenraad Johannes van Houten", "response": ["In 1835 Coenraad van Houten married Hermina van Houten (unrelated) from Groningen. In 1850 he moved his production from a windmill in Leiden to a steam factory in Weesp. By that time he was exporting chocolate to England, France, and Germany. In 1866 John Cadbury traveled to Weesp to buy a Van Houten press, but did not use it in his manufacturing until 1875."]}, {"page": "Science and invention in Birmingham", "response": ["1824: John Cadbury begins selling tea, coffee, and drinking chocolate, which he produces himself, at Bull Street. He later moves into the production of a variety of cocoa and drinking chocolates, made in a factory in Bridge Street and sold mainly to the wealthy because of the high cost of production. John Cadbury becomes a partner with his brother Benjamin and the company they form is called 'Cadbury Brothers of Birmingham'."]}, {"page": "History of the Quakers", "response": ["In the realm of industry Edward Pease opened the Stockton and Darlington Railway in northern England in 1825. It was the first modern railway in the world, and carried coal from the mines to the seaports. Henry and Joseph Rowntree owned a chocolate factory in York, England. When Henry died, Joseph took it over. He provided the workers with more benefits than most employers of his day. He also funded low-cost housing for the poor. John Cadbury founded another chocolate factory, which his sons George and Richard eventually took over. A third chocolate factory was founded by Joseph Storrs Fry in Bristol. The shipbuilder John Wigham Richardson was a prominent Newcastle upon Tyne Quaker. His office at the centre of the shipyard was always open to his workers for whom he cared greatly and he was a founder of the Workers’ Benevolent Trust in the region, (a forerunner to the trades’ union movement). Swan Hunter and Wigham Richardson, the builders of the RMS Mauretania, refused to build war ships on account of his pacifist beliefs."]}]}}