{"wiki_id": "http://www.wikidata.org/entity/Q1385023", "itemLabel": "Harold Davenport", "itemDescription": "English Mathematician (1907-1969)", "wikipedia_url": "https://en.wikipedia.org/wiki/Harold_Davenport", "wikipedia_page": {"main": "Harold Davenport FRS (30 October 1907 – 9 June 1969) was an English mathematician, known for his extensive work in number theory.\n\n", "link_mentions": [{"page": "Enrico Bombieri", "response": ["Bombieri published his first mathematical paper in 1957 when he was 16 years old. In 1963 at age 22 he earned his first degree (Laurea) in mathematics from the Università degli Studi di Milano under the supervision of Giovanni Ricci and then studied at Trinity College, Cambridge with Harold Davenport."]}, {"page": "John Horton Conway", "response": ["Conway was awarded a BA in 1959 and, supervised by Harold Davenport, began to undertake research in number theory. Having solved the open problem posed by Davenport on writing numbers as the sums of fifth powers, Conway began to become interested in infinite ordinals. It appears that his interest in games began during his years studying the Cambridge Mathematical Tripos, where he became an avid backgammon player, spending hours playing the game in the common room. He was awarded his doctorate in 1964 and was appointed as College Fellow and Lecturer in Mathematics at Sidney Sussex College, Cambridge. After leaving Cambridge in 1986, he took up the appointment to the John von Neumann Chair of Mathematics at Princeton University."]}, {"page": "Birthday problem", "response": ["The problem is generally attributed to Harold Davenport in about 1927, though he did not publish it at the time. Davenport did not claim to be its discoverer \"because he could not believe that it had not been stated earlier\".David Singmaster, Sources in Recreational Mathematics: An Annotated Bibliography, Eighth Preliminary Edition, 2004, section 8.BH.S.M. Coxeter, \"Mathematical Recreations and Essays, 11th edition\", 1940, p 45, as reported in I. J. Good, Probability and the weighing of evidence, 1950, p. 38 The first publication of a version of the birthday problem was by Richard von Mises in 1939.Richard Von Mises, \"Über Aufteilungs- und Besetzungswahrscheinlichkeiten\", Revue de la faculté des sciences de l'Université d'Istanbul 4:145-163, 1939, reprinted in "]}, {"page": "John Edensor Littlewood", "response": ["Among his own PhD students were Sarvadaman Chowla, Harold Davenport, and Donald C. Spencer. Spencer reported that in 1941 when he (Spencer) was about to get on the boat that would take him home to the United States, Littlewood reminded him: \"n, n alpha, n beta!\" (referring to Littlewood's conjecture)."]}, {"page": "Geometry of numbers", "response": ["In 1930-1960 research on the geometry of numbers was conducted by many number theorists (including Louis Mordell, Harold Davenport and Carl Ludwig Siegel). In recent years, Lenstra, Brion, and Barvinok have developed combinatorial theories that enumerate the lattice points in some convex bodies.Grötschel et alii, Lovász et alii, Lovász, and Beck and Robins."]}, {"page": "D. H. Lehmer", "response": ["The year 1938-1939 was spent in England on a Guggenheim Fellowship visiting both the University of Cambridge and the University of Manchester, meeting G. H. Hardy, John Edensor Littlewood, Harold Davenport, Kurt Mahler, Louis Mordell, and Paul Erdős. The Lehmers returned to America by ship with second child Donald just before the beginning of the Battle of the Atlantic."]}, {"page": "Exponential sum", "response": ["Auxiliary types of sums occur in the theory, for example character sums; going back to Harold Davenport's thesis. The Weil conjectures had major applications to complete sums with domain restricted by polynomial conditions (i.e., along an algebraic variety over a finite field)."]}, {"page": "Béla Bollobás", "response": ["With Erdős's recommendation to Harold Davenport and a long struggle for permission from the Hungarian authorities, Bollobás was able to spend an undergraduate year in Cambridge, England. However, the authorities denied his request to return to Cambridge for doctoral study. A similar scholarship offer from Paris was also quashed. He wrote his first doctorate in discrete geometry under the supervision of László Fejes Tóth and Paul Erdős in Budapest University, 1967, after which he spent a year in Moscow with Israïl Moiseevich Gelfand. After spending a year at Christ Church, Oxford, where Michael Atiyah held the Savilian Chair of Geometry, he vowed never to return to Hungary due to his disillusion with the 1956 Soviet intervention. He then went to Trinity College, Cambridge, where in 1972 he received a second PhD in functional analysis, studying Banach algebras under the supervision of Frank Adams. In 1970, he was awarded a fellowship to the college."]}, {"page": "Rouse Ball Professor of Mathematics", "response": ["* 1958–1969 Harold Davenport"]}, {"page": "Carl Ludwig Siegel", "response": ["*Harold Davenport: Reminiscences on conversations with Carl Ludwig Siegel, Mathematical Intelligencer 1985, Nr.2"]}, {"page": "Helmut Hasse", "response": ["He collaborated with many mathematicians, in particular with Emmy Noether and Richard Brauer on simple algebras, and with Harold Davenport on Gauss sums (Hasse–Davenport relations), and  with Cahit Arf on the Hasse–Arf theorem."]}, {"page": "Klaus Roth", "response": ["On the recommendation of Harold Davenport, he was accepted in 1946 to a master's program in mathematics at University College London, where he worked under the supervision of Theodor Estermann. He completed a master's degree there in 1948, and a doctorate in 1950. His dissertation was Proof that almost all Positive Integers are Sums of a Square, a Positive Cube and a Fourth Power.", "During this period, he continued to work closely with Harold Davenport.", "Roth was known as a problem-solver in mathematics, rather than as a theory-builder. Harold Davenport writes that the \"moral in Dr Roth's work\" is that \"the great unsolved problems of mathematics may still yield to direct attack, however difficult and forbidding they appear to be, and however much effort has already been spent on them\". His research interests spanned several topics in number theory, discrepancy theory, and the theory of integer sequences.", "In 1955, Roth published what is now known as Roth's theorem, completely settling this question. His theorem falsified the supposed connection between approximation exponent and degree, and proved that, in terms of the approximation exponent, the algebraic numbers are the least accurately approximated of any irrational numbers. More precisely, he proved that for irrational algebraic numbers, the approximation exponent is always exactly two. In a survey of Roth's work presented by Harold Davenport to the International Congress of Mathematicians in 1958, when Roth was given the Fields Medal, Davenport called this result Roth's \"greatest achievement\"."]}, {"page": "Louis J. Mordell", "response": ["He took British citizenship in 1929. In Manchester he also built up the department, offering posts to a number of outstanding mathematicians who had been forced from posts on the continent of Europe. He brought in Reinhold Baer, G. Billing, Paul Erdős, Chao Ko, Kurt Mahler, and Beniamino Segre. He also recruited J. A. Todd, Patrick du Val, Harold Davenport and Laurence Chisholm Young, and invited distinguished visitors."]}, {"page": "Normal basis", "response": ["A primitive normal basis of an extension of finite fields E/F is a normal basis for E/F that is generated by a primitive element of E, that is a generator of the multiplicative group K^\\times. (Note that this is a more restrictive definition of primitive element than that mentioned above after the general Normal Basis Theorem: one requires powers of the element to produce every non-zero element of K, not merely a basis.)  Lenstra and Schoof (1987) proved that every finite field extension possesses a primitive normal basis, the case when F is a prime field having been settled by Harold Davenport."]}, {"page": "List of University of Cambridge people", "response": ["*Harold Davenport (Trinity)"]}, {"page": "Hardy–Littlewood circle method", "response": ["The initial idea is usually attributed to the work of Hardy with Srinivasa Ramanujan a few years earlier, in 1916 and 1917, on the asymptotics of the partition function. It was taken up by many other researchers, including Harold Davenport and I. M. Vinogradov, who modified the formulation slightly (moving from complex analysis to exponential sums), without changing the broad lines. Hundreds of papers followed, and  the method still yields results. The method is the subject of a monograph  by R. C. Vaughan."]}, {"page": "List of people associated with University College London", "response": ["* Harold Davenport – Astor Professor of Mathematics, number theory"]}, {"page": "Covering system", "response": ["The Mirsky–Newman theorem, a special case of the Herzog–Schönheim conjecture, states that there is no disjoint distinct covering system. This result was conjectured in 1950 by Paul Erdős and proved soon thereafter by Leon Mirsky and Donald J. Newman. However, Mirsky and Newman never published their proof. The same proof was also found independently by Harold Davenport and Richard Rado."]}, {"page": "Smith's Prize", "response": ["* 1930 Harold DavenportDavenport biography"]}, {"page": "List of Cambridge mathematicians", "response": ["*Harold Davenport"]}, {"page": "Herzog–Schönheim conjecture", "response": ["In this case, the Herzog–Schönheim conjecture states that every covering system, a family of arithmetic progressions that together cover all the integers, must either cover some integers more than once or include at least one pair of progressions that have the same difference as each other. This result was conjectured in 1950 by Paul Erdős and proved soon thereafter by Leon Mirsky and Donald J. Newman. However, Mirsky and Newman never published their proof. The same proof was also found independently by Harold Davenport and Richard Rado.."]}, {"page": "Hans Heilbronn", "response": ["Heilbronn fled Germany for Britain in 1933 due to the rise of Nazism. He arrived in Cambridge, then found accommodation in Manchester and eventually was offered a position at Bristol University, where he stayed for about one and a half years. There he proved that the class number of the number field \\mathbb{Q}(\\sqrt{-d}) tends to plus infinity as d does, as well as, in collaboration with Edward Linfoot, that there are at most ten quadratic number fields  of the form \\mathbb{Q}(\\sqrt{-d}), d a natural number, with class number 1. On invitation of Louis Mordell he moved back to Manchester in 1934, but left again only one year later, accepting the Bevan Fellowship at Trinity College, Cambridge. In Cambridge Heilbronn published several joint papers with Harold Davenport, in one of which they devised a new variant of the Hardy-Littlewood circle method, now sometimes referred to as the Davenport-Heilbronn method, proving that for any indefinite diagonal form f of degree k in more than n=2^k variables whose coefficients are not all in rational ratio there exists x in \\mathbb{Z}^n such that |f(x)| is arbitrarily small. During the Second World War he was briefly interned as an enemy alien but released to serve in the British Army.  In 1946 he returned to Bristol, becoming Henry Overton Wills Professor of Mathematics. He was elected a Fellow of the Royal Society in 1951 and was president of the London Mathematical Society from 1959 to 1961."]}, {"page": "Harold davenport", "response": ["#REDIRECT Harold Davenport "]}, {"page": "Bryan John Birch", "response": ["As a doctoral student at the University of Cambridge, he was officially working under J. W. S. Cassels. More influenced by Harold Davenport, he proved Birch's theorem, one of the results to come out of the Hardy–Littlewood circle method; it shows that odd-degree rational forms in a large enough set of variables must have zeroes.", "*The Collected Works of Harold Davenport. (editor). London: Academic Press, 1977."]}, {"page": "Oppenheim conjecture", "response": ["In Diophantine approximation, the Oppenheim conjecture concerns representations of numbers by real quadratic forms in several variables. It was formulated in 1929 by Alexander Oppenheim and later the conjectured property was further strengthened by Harold Davenport and Oppenheim. Initial research on this problem took the number n of variables to be large, and applied a version of the Hardy-Littlewood circle method. The definitive work of Margulis, settling the conjecture in the affirmative, used methods arising from ergodic theory and the study of discrete subgroups of semisimple Lie groups.", "Several versions of the conjecture were formulated by Oppenheim and Harold Davenport."]}, {"page": "Martin Huxley", "response": ["He was awarded a PhD from the University of Cambridge in 1970, the year after his supervisor Harold Davenport had died. He is a professor at Cardiff University."]}]}}