{"wiki_id": "http://www.wikidata.org/entity/Q1384256", "itemLabel": "Newton Faulkner", "itemDescription": "English singer-songwriter", "wikipedia_url": "https://en.wikipedia.org/wiki/Newton_Faulkner", "wikipedia_page": {"main": "Sam Newton Battenberg Faulkner (born 11 January 1985) is an English singer-songwriter and musician from Reigate, Surrey. He is known for his percussive style of guitar playing.\nIn 2007 Faulkner's debut studio album Hand Built by Robots was certified double platinum in the United Kingdom. The album topped the UK Albums Chart in August 2007. It was promoted by three singles, \"Dream Catch Me\", \"I Need Something\" and \"Teardrop\". \"Dream Catch Me\" reached number seven on the UK Singles Charts.Faulkner's second studio album, Rebuilt by Humans, was released in 2009 and charted at number 3 on the UK Albums Chart. After an accident to his right wrist, he said that he had \"been put back together again by humans\". An EP titled Sketches was released in April 2012, followed by a third studio album Write It On Your Skin, which was released in July 2012 and reached number one on the UK Albums Chart. Faulkner's fourth album, Studio Zoo, was released in 2013 and reached number ten on the chart; the recording of the album was displayed through a live stream. His fifth studio album, Human Love, was released in November 2015; Faulkner removed his dreadlocks during the creation of the album to re-invent his appearance.\nIn 2016, Faulkner was cast as Johnny in the musical American Idiot, which is based on songs from the band Green Day. He played the role on the UK Tour, and continued in the role when the show returned to the West End at the Arts Theatre in July 2016. This was followed by the release of his sixth album, Hit the Ground Running, in 2017. In November and December 2018, Faulkner starred as the Sung Thoughts of the Journalist in the 40th anniversary musical version of Jeff Wayne's War of the Worlds.On December 10, 2018, Faulkner announced through social media channels the forthcoming release of The Very Best of Newton Faulkner...So Far, featuring 31 songs: selected songs from his six studio albums, three new tracks, and recordings of \"all the covers I play live, from 'Bohemian Rhapsody' to ’Send Me On My Way' and a track I promised myself I'd never record!\" A new Christmas-themed track called \"Wake Up\" was previewed on his website to promote the album. Faulkner later released his seventh album, The Interference (Of Light) in 2021. The album was recorded in isolation during the COVID-19 pandemic and through a live stream, similar to Studio Zoo.\n\n", "link_mentions": [{"page": "January 11", "response": ["*1985 – Newton Faulkner, English singer-songwriter and guitarist"]}, {"page": "Sketch", "response": ["* Sketches, a 2012 EP by Newton Faulkner"]}, {"page": "Jeff Wayne's Musical Version of The War of the Worlds", "response": ["*Newton Faulkner – vocals (The Sung Thoughts of The Journalist) (2018 40th Anniversary tour)"]}, {"page": "Greenbelt Festival", "response": ["| rowspan=\"3\" | Newton Faulkner, Kate Rusby, Luke Sital-Singh, Wildwood Kin, Sound of the Sirens, Jess Morgan, Martyn Joseph, Joanne Shaw Taylor, Clean Cut Kid, CC Smugglers, Dan Donovan, King Porter Stomp, Lee Bains III & the Glory Fires, Jasmine Kennedy, The Rubber Wellies, Will Varley, Jasper in the Company of Others, Zoe Lyons, Paul Kerensa"]}, {"page": "List of singer-songwriters", "response": ["*Newton Faulkner"]}, {"page": "Street performance", "response": ["*Newton Faulkner has been known to busk and video footage of him busking has been made available on YouTube, including a full acoustic cover of Queen's \"Bohemian Rhapsody\"."]}, {"page": "Peace One Day", "response": ["The 2011 concert at the O2 Arena announced a new Peace One Day initiative Global Truce 2012, Razorlight and Eliza Doolittle headlined. On 21 June 2012 a Peace One Day concert at Derry, in the spirit of the Olympic Truce marked the start of the London 2012 Festival and was also a three-month countdown to Global Truce 2012, some of the musicians that performed were Pixie Lott, Newton Faulkner and Imelda May."]}, {"page": "Oxegen", "response": ["Kings of Leon were the first band to be announced on 27 November 2007 at 5:00 pm They headlined the opening night of the festival. On 15 February 2008 R.E.M. were confirmed for Oxegen 2008, headlining the Saturday night. On 19 February at 16:29, Kaiser Chiefs, The Raconteurs and Ian Brown were announced on the official website, followed by The Fratellis, Interpol and Counting Crows the next day. The Chemical Brothers and Justice were amongst those added on 21 February, whilst on 22 February Rage Against the Machine were the last of the headliners to be confirmed. On Sunday 24 February, The Verve were confirmed on the official website for an appearance at Oxegen 2008, performing last on the Main Stage on the Saturday. In the following months more bands were announced including Stereophonics, The Prodigy, Panic! at the Disco, The Feeling, Editors, Kate Nash, Bowling for Soup, The Hoosiers, Newton Faulkner, Scouting for Girls, The Zutons, Battles, The Wombats, The Subways, Ben Folds, The Stranglers, Amy Macdonald, Alphabeat, Amy Winehouse, The Pogues, The Charlatans, The Swell Season, Manic Street Preachers, Echo & the Bunnymen, The Ting Tings, Black Kids, MGMT, The Kooks, Groove Armada, The National, Tricky, The Go! Team, Feeder, The Pigeon Detectives, The Enemy and One Night Only. Irish performers to play the festival included The Blizzards, Republic of Loose, Róisín Murphy, Bell X1, Mundy, Aslan, Paddy Casey, The Coronas, The Saw Doctors, The Kinetiks, Dirty Epics, Declan O'Rourke, Delorentos, Future Kings of Spain, Concerto For Constantine, God Is an Astronaut, The Script, Fight Like Apes, Codes and Oppenheimer.", "* Newton Faulkner", " Eminem, Muse, Arcade Fire, Jay-Z, The Black Eyed Peas, Kasabian, The Prodigy, Fatboy Slim, Florence and the Machine, Paolo Nutini, Faithless, Editors, Bell X1, Stereophonics, David Guetta, Dizzee Rascal, Doves, Julian Casablancas, The Stranglers, Earth, Wind & Fire, Echo & the Bunnymen, The Cribs, The Overview, Hot Chip, Calvin Harris, Republic of Loose, Newton Faulkner, The Temper Trap, Empire of the Sun, Goldfrapp, Gossip, La Roux, Rise Against, Ocean Colour Scene, The Coral, The Coronas, The Courteeners, Broken Social Scene, Vampire Weekend, Mumford & Sons, Ellie Goulding, Laura Marling, Two Door Cinema Club, Scouting for Girls, The Middle East, Armand Van Helden, Steve Angello, Simian Mobile Disco, Erol Alkan, Jamie T, Steve Aoki, A-Trak and Aeroplane are among the acts set to perform.", "*Newton Faulkner"]}, {"page": "Towersey Festival", "response": ["2017: Jon Boden, KT Tunstall, Eliza Carthy and The Wayward Band, Newton Faulkner, Show Of Hands, Lindisfarne, Demon Barbers XL, Coope Boyes and Simpson 'Towersey Line Up 2017' eFestivals", "2019: The Selecter, Hothouse Flowers, Newton Faulkner, Seth Lakeman, From The Jam, The Unthanks, Steve Harley, Oysterband, The Bar-Steward Sons of Val Doonican and a special tribute to Roy Bailey with Tom Robinson, Martin Simpson and guests.'More Acts Announced For Towersey 2019' ThameHub, accessed 24 April 2019."]}, {"page": "Byron Bay Bluesfest", "response": ["Artists in 2008 included Buddy Guy, Eskimo Joe, The John Butler Trio, Gotye, The Beautiful Girls, Newton Faulkner, Seasick Steve, Charlie Musselwhite, Mavis Staples, John P. Hammond, John Hiatt, Ray Davies, Maceo Parker, Loudon Wainwright III, Ozomatli, Ruthie Foster, Jake Shimabukuro, Keith Urban, Amali Ward, Lior, MOFRO, Dan Sultan, Jeff Lang, The Cat Empire, Clare Bowditch, Raul Midon and Xavier Rudd.", "*Newton Faulkner", "*Newton Faulkner ", "*Newton Faulkner "]}, {"page": "Longpigs", "response": ["Hunt has also worked as a songwriter and record producer for Ellie Goulding, Penguin Prison, Midnight Lion, Florence and the Machine, Newton Faulkner, Kiko Bun, Natalie Imbruglia, Gabriella Cilmi, Lisa Mitchell, Lissie, Richard Walters, Josephine Oniyama, Clare Maguire, Liam Frost, Ron Sexsmith, Kate Walsh, Jake Bugg, Misty Miller, Eliza and the Bear and JP Cooper."]}, {"page": "David Sneddon", "response": ["(\"National Anthem\"), Newton Faulkner (\"Pick Up Your Broken Heart\", \"Soon\"), Charlie Brown (\"Dependency\"), Greyson Chance (\"Sunshine City Lights\"), David Archuleta (\"Don't Run Away\"), Shane Filan (\"Everytime\",  \"Today's Not Yesterday\") and Jessica Mauboy (\"This Ain't Love\").", "Newton Faulkner's Write It on Your Skin contained three Nexus songs – \"Pick Up Your Broken Heart\", \"Soon\" and \"Feel\" – made No.1 in 2012 UK Albums Chart. In April 2013 The Nexus became part of 365 Artists. They have built strong reputations as songwriters and they have worked and released with artists such as Hurts, Lana Del Rey, Newton Faulkner, Morten Harket, Will Young, Nicole Scherzinger, Olly Murs, Pixie Lott and Kristina Train. Shane Filan, formerly lead singer with Westlife released EP \"Everything to Me\" August 2013 which included, \"Everytime\" and \"Today's Not Yesterday\", produced by The Nexus.", "In 2003, Sneddon worked with producer and guitarist James Bauer-Mein when touring and recording his debut album. Since then, Sneddon and Mein have formed a partnership, working together in a London recording studio discovering, producing and writing with new talent in both the US and the UK. Sneddon and Mein have built up strong reputations as songwriters, having written music chart songs for other artists such as Hurts, Morten Harket of A-ha, X Factor winner Matt Cardle, Newton Faulkner and number one selling American singer Lana Del Rey. In 2009 they decided to call themselves \"The Nexus\".", "Newton Faulkner's third studio album Write It on Your Skin, which contained two Nexus songs – \"Pick Up Your Broken Heart\", \"Soon\" and \"Feel\" – was released in July 2012 and reached No.1 UK Albums Chart. As well as developing their own artists in 2012, Sneddon and Mein worked with Greyson Chance, Eliza Doolittle, and Dionne Bromfield. He is one of the more successful graduates from a reality TV show and has built a long career in the music business.", "(\"National Anthem\"), Newton Faulkner (\"Pick Up Your Broken Heart\", \"Soon\", \"Feel\"), Charlie Brown (\"Dependency\"), Greyson Chance (\"Sunshine City Lights\"), David Archuleta (\"Don't Run Away\"), Shane Filan (\"Everytime\",  \"Today's Not Yesterday\").", "In April 2013, The Nexus joined the roster of music producers and writers at 365 Artists. The Nexus have worked and released with artists such as Hurts, Lana Del Rey, Newton Faulkner, Morten Harket, Will Young, Nicole Scherzinger, Olly Murs, Pixie Lott and Kristina Train."]}, {"page": "Don Spencer", "response": ["In December 2010 the ACMF sponsored a supergroup, Peacebeliever, which recorded a cover version of Plastic Ono Band's 1969 single, \"Give Peace a Chance\", for the charity. Alongside Spencer fellow vocalists were Katie Noonan, Blue King Brown, Tim Freedman, Newton Faulkner and Omara Portuondo. In July 2013 Spencer announced the ACMF's 11th annual National Kids Songwriting Competition, which is open to school aged children from four to eighteen years-old: \"We want kids to unleash their creativity and engage with learning in a fun way ... Music can give kids really positive self expression and is a great tool for improving literacy levels\"."]}, {"page": "V Festival", "response": ["* Newton Faulkner", "* Newton Faulkner", "* Newton Faulkner", "* Newton Faulkner"]}, {"page": "Tubridy Tonight", "response": ["| 27 October 2007 || Hector and Risteárd, Gino D'Acampo, Andrew Maxwell || || Newton Faulkner || \"I Need Something\" || Details "]}, {"page": "Spicks and Specks (TV series)", "response": ["| Newton Faulkner & Jason Byrne"]}, {"page": "Faulkner (surname)", "response": ["* Newton Faulkner (born 1985), British musician"]}, {"page": "Sir William Borlase's Grammar School", "response": ["* Newton Faulkner - musician"]}, {"page": "Summer Sundae", "response": ["*Newton Faulkner"]}, {"page": "Nick Harper", "response": ["Harper hosted his own Love Hope Strength fundraiser, Avebury Rocks, which first took place on 9 July 2011 and ran until 2019. Funds were also raised for The Prospect Hospice in Wroughton, Wiltshire where Harper's mother died. The events included 20-mile walks starting and ending at Avebury Stone Circle, in the day and a concert in the evening. Headliners at the concerts included Newton Faulkner, Mike Peters of The Alarm, Cy Curnin and Jamie West-Oram of The Fixx, Levellers, Gabby Young and Other Animals, The Correspondents  and Harper himself."]}, {"page": "List of guitarists", "response": ["*Newton Faulkner"]}, {"page": "INTRO Festival", "response": ["Newton Faulkner,"]}, {"page": "Brandi Carlile", "response": ["In 2007, Carlile performed at the Borderline in London and as guest on Newton Faulkner's UK tour. She was the opening act for Maroon 5 and OneRepublic during their Australia tour.Frontiertouring.com.au    In April 2008, she performed on the BBC2 show Later... with Jools Holland."]}, {"page": "Gold Digger (Kanye West song)", "response": ["On July 24, 2006, Welsh rock band the Automatic performed a cover of \"Gold Digger\" at the University of London Union, London. Member Alex Pennie delivered the vocals, whereas support band Viva Machine were wrapped in bandages and body–popped into the mosh pit. On August 29, 2006, the Automatic, Capdown, Adequate Seven, and GLC performed the cover at the Reading Festival. In September, it was reported that the band were awaiting permission to include the cover as the B-side to a single. During the first US headlining show of the Automatic's Not Accepted Anywhere album tour at Bowery Ballroom in New York City on July 26, 2007, they performed the cover in a punk style. Pennie returned for the performance after being absent for two songs, shouting the vocals. At the 2007 Get Loaded in the Park festival, the band performed the cover with English musician Newton Faulkner, who contributed vocals and percussive guitar. That same year, a limited edition 7\" vinyl was released across the UK for their single \"Raoul\", featuring a performance of \"Gold Digger\" from the 2006 Leeds Festival as the B-side. In 2009, characters Will Schuester and New Directions covered the song for American TV series Glees second episode \"Showmance\". The cover was released on the soundtrack album Glee: The Music, Volume 1 on November 3 of that year, and it reached number 59 on the ARIA Singles Chart."]}, {"page": "Jeremy Gilley", "response": ["The 2011 concert at the O2 Arena announced a new Peace One Day initiative Global Truce 2012, Razorlight and Eliza Doolittle headlined. On 21 June 2012 a Peace One Day concert at Derry, in the spirit of the Olympic Truce marked the start of the London 2012 Festival and was also a three-month countdown to Global Truce 2012, some of the musicians that performed were Pixie Lott, Newton Faulkner and Imelda May."]}, {"page": "The Automatic", "response": ["The band have collaborated on a number of occasions for live shows, notably for Reading and Leeds festivals in 2006 during the performances of \"Gold Digger\" where the band performed with Goldie Lookin Chain,GLC and The Automatic To Unite At Carling Weekend festivalwise, July 2009 similarly in 2007 at T in the Park the band performed the track with singer-guitarist Newton Faulkner,The Automatic with Newton Faulkner at T in the Park  theautomatic.co.uk, video blogs, 31 August 2007, Newton Faulkner with The Automatic: \"Gold Digger\" YouTube, johnbownas, 30 August 2007 during the live performance of \"Gold Digger\", former guitar technician for The Automatic Jamie Allen would perform bass guitar, as Rob played flute.Radio 1 Live Lounge; June 2006  peterhill.net, July 2009 In 2008 with album and track \"This Is A Fix\" an additional bass player was required for its performance as Rob would be providing synthesisers in the track, during club tour Tom Stephens of Viva Machine provided bass, whilst in later tours Peter Hill stood in as bassist on the track. Notable on many of the band's tours have featured James \"Jizz\" Lawrenson as the band's sound engineer,'Spicy' Geoff Cattani as Keyboard Tech & Drum tech & sometimes Driver from February 2006 – November 2006, Stan Saunders as band's monitor engineer and Mike Doyle as tour manager, a position Peter Hill also took in 2008/09 touring, Mike was also featured during a live cover of Talking Heads single \"Life During Wartime\" on the 2007 NME Tour."]}, {"page": "Academy of Contemporary Music", "response": ["* Newton Faulkner, guitarist/singer/songwriter whose album Hand Built By Robots went to number one in the UK Album Charts."]}, {"page": "Eric Roche", "response": ["Roche was born in New York City, after which his family moved to Tralee, County Kerry, Ireland. He was an accountant, but practised only for a short time before enlisting for classical guitar at the London Musician's Institute in 1992. After his degree he became head of its guitar department in 1996 and released his first CD The Perc U Lator three years later. In 2000 he became head of guitar at Academy of Contemporary Music in Guildford, where his pupils included Newton Faulkner. In 2001 his second CD Spin was released. In 2004 Roche issued his third album With These Hands and released his book The Acoustic Guitar Bible, a guide to acoustic guitar playing with a foreword by Tommy Emmanuel. Roche was a regular columnist for the magazines Guitar Techniques and Acoustic Guitar and did international master classes and workshops.", "For Eric, a tribute CD, was released shortly after his death in 2005, containing 20 tracks from different artists. In 2006, the Guitar School of the Academy of Contemporary Music in Guildford was renamed to \"ACM Eric Roche Guitar School\". Guthrie Govan dedicated a song called \"Eric\" in his 2006 album Erotic Cakes to him. Newton Faulkner's song 'So Much' was written as a token of respect for the influence Roche had had in his life. In 2006 Roche's Tablature Collection #1 was published, jointly produced by Roche and his close friend Thomas Leeb, who dedicated his work to Roche and his part of possible income to the benefit of Roche's children.YouTube guitarist, 'Robert Castellani', wrote a song in tribute to Roche entitled, 'Song for Eric'."]}, {"page": "Cities 97 Sampler", "response": ["#Newton Faulkner – \"Teardrop\""]}, {"page": "Sasquatch! Music Festival", "response": ["*Newton Faulkner"]}, {"page": "Glastonbury Festival line-ups", "response": ["* Newton Faulkner", "* Newton Faulkner", "* Newton Faulkner", "* Newton Faulkner"]}, {"page": "Latitude Festival", "response": ["The fourth edition took place on 16–19 July 2009. Acts that played include Nick Cave and the Bad Seeds, Thom Yorke, Grace Jones and Pet Shop Boys as the main headliners, alongside Editors, Doves, and Bat for Lashes. The headliners and ticket details were announced on the Latitude Festival official site on 23 March 2009, at 7pm and sold out near to the event. More acts were confirmed at around 12:00 pm on the following day. These acts had already been previously reported on BBC Radio 1, but denied by festival organisers. Also announced in the press were The Gossip. On 3 April 2009 the official Latitude website confirmed Magazine, Spiritualized and Newton Faulkner to be playing. In June, it was announced that Thom Yorke would play an exclusive solo set as the festival's special guest (a role taken by Joanna Newsom in 2008).", "*Newton Faulkner"]}, {"page": "BBC Radio 1's Big Weekend", "response": ["| Newton Faulkner || Pendulum || Basshunter || Kate Goes"]}, {"page": "Godiva Festival", "response": ["*Newton Faulkner", "*Newton Faulkner"]}, {"page": "List of Live Lounge cover versions", "response": ["|Newton Faulkner || \"Foundations\" by Kate Nash  \"Mama Do (Uh Oh Uh Oh)\" by Pixie Lott\"Payphone\" by Maroon 5 feat. Wiz Khalifa ||19 October 200726 September 20094 July 2012"]}, {"page": "1985 in the United Kingdom", "response": ["* 11 January – Newton Faulkner, rock musician"]}, {"page": "Lisa Mitchell", "response": ["In August \"Coin Laundry\" was featured in a Bell Canada ad for the Palm Pre. \"Neopolitan Dreams\" was also used in the game LittleBigPlanet (2009) and is the song of the customer service of Chilean telco VTR. In October Mitchell supported Newton Faulkner (aka Crispin Hunt) on his Rebuilt by Humans Tour across the UK and Republic of Ireland which included shows in Dublin, Belfast, Glasgow, and Newcastle. At the ARIA Music Awards of 2009 Mitchell was nominated in three categories: Best Female Artist, Breakthrough Artist – Album for Wonder, and Breakthrough Artist – Single for \"Coin Laundry\". \"Coin Laundry\" was placed at No. 7 in the Triple J Hottest 100, 2009."]}, {"page": "St George's Market", "response": ["The market also regularly holds music concerts. Acts including Duffy, Newton Faulkner, Deep Purple, Kasabian, Biffy Clyro and Mark Ronson have played the venue."]}, {"page": "List of Never Mind the Buzzcocks episodes", "response": ["|Newton Faulkner and Holly Walsh"]}, {"page": "It Must Be Love (Labi Siffre song)", "response": ["*In 2011, a cover by Newton Faulkner was featured in a UK advertisement for the Samsung Galaxy S II."]}, {"page": "Micky Moody", "response": ["Besides this, Moody has also toured with Roger Chapman, Frankie Miller and Chris Farlowe. He has also performed live alongside the likes of Eric Clapton, Alvin Lee, Mick Taylor, Bruce Dickinson, Sam Brown, Gary Brooker, Suggs, Dennis Locorriere, Paul Jones, P. P. Arnold, James Hunter, Rick Wakeman, Jon Lord, Newton Faulkner, Uriah Heep, Alice Cooper, Mark King, Alfie Boe, Sandi Thom, Brian Auger, Paul Weller, Eric Bibb, Meat Loaf, Boy George, Elkie Brooks, Nona Hendryx, Mud Morganfield and one of his early guitar heroes, Duane Eddy. Since 2000 he has released several solo albums: I Eat Them For Breakfast (2000), Don't Blame Me  (2006), Acoustic Journeyman (2007) and Electric Journeyman (2009). A versatile guitarist, Moody has been an active session musician and his own website lists over 100 albums to which he has contributed musically. 2006 saw the release of the autobiographical Playing With Trumpets – A Rock 'n' Roll Apprenticeship, a memoir about his early days on the music scene. Another book of memoirs, Snakes and Ladders, was released in 2016. His library music has been featured on such TV programmes as Waking the Dead, Bo' Selecta!, America's Next Top Model, How to Look Good Naked, Top Gear, Horizon, Jersey Shore, Mad Men, Wife Swap and Paul Hollywood's Bread."]}, {"page": "Aware Records", "response": ["* Newton Faulkner"]}, {"page": "Teardrop (song)", "response": ["===Newton Faulkner===", "Newton Faulkner covered the song on his album Hand Built by Robots, which was produced by Mike Spencer. On downloads alone, Faulkner's version reached number 60 on the UK Singles Chart in August 2007. It was released as an official single on 10 December 2007, and reached number 57 on the chart the following week. The version of the album available from the Australian iTunes Music Store also incorporates an acoustic version.Newton Faulkner – Teardrop (Acoustic Version), Australian iTunes Music Store. Phobos.apple.com (17 December 2007). Retrieved on 19 December 2011."]}, {"page": "Little Noise Sessions", "response": ["* 26 November 2006 - James Morrison / The Automatic / Newton Faulkner / Lily Allen", "*22 November 2007 - Will Young / David Jordan / Adele / Newton Faulkner", "*24 November 2009 - Newton Faulkner / Scouting for Girls / Little Comets / Stornoway", "*25 November 2012 - Amy Macdonald / Newton Faulkner / Karin Park"]}, {"page": "Angus & Julia Stone", "response": ["They welcomed in 2008 by performing at the New Year's Eve Falls Festival in Australia before heading back to the UK to support Newton Faulkner and David Gray, as well as playing their own sold-out London shows at Scala. Two of their tracks were listed on the Triple J Hottest 100, 2007, with \"Wasted\" at No. 31 and \"The Beast\" at No. 45. A Book Like This was released in the UK in March 2008. In May they performed at the Woodford Folk Festival. The UK press lauded the duo: Uncut magazine said they performed \"Fragile, beautiful songs\"; a reviewer for The Guardian said \"[they] fill [my] heart to bursting point with joy\". The second half of that year was filled with more touring including a support spot with Martha Wainwright across the UK and into continental Europe playing gigs to over 25,000 people. In October they issued another four-track EP, Hollywood, which included re-recorded versions from A Book Like This with lead vocals swapped from Julia to Angus for \"All the Colours\" (aka \"Wasted\") and \"Johnny and June\" (\"Hollywood\"), and from Angus to Julia for \"Lonely Hands\" (\"Just a Boy\") – a three-track version was released for the US market."]}]}}