{"wiki_id": "http://www.wikidata.org/entity/Q1387148", "itemLabel": "Adam Faith", "itemDescription": "English singer, actor and financial journalist", "wikipedia_url": "https://en.wikipedia.org/wiki/Adam_Faith", "wikipedia_page": {"main": "Terence Nelhams Wright (23 June 1940 – 8 March 2003), known as Adam Faith, was an English singer, actor and financial journalist. A teen idol, he scored consecutive No. 1 hits on the UK Singles Chart with \"What Do You Want?\" (1959) and \"Poor Me\" (1960). He became the first UK artist to lodge his initial seven hits in the top 5, and was ultimately one of the most charted acts of the 1960s. He was also one of the first UK acts to record original songs regularly. Faith also maintained a successful acting career, notably appearing as Dave in the teen exploitation film Beat Girl (1960), the eponymous lead in the ITV television series Budgie and Frank Carver in the BBC comedy drama Love Hurts. \n\n", "link_mentions": [{"page": "June 23", "response": ["*1940 – Adam Faith, English singer (died 2003)"]}, {"page": "March 8", "response": ["*2003 – Adam Faith, English singer (b. 1940)"]}, {"page": "Rock and roll", "response": ["The initial response of the British music industry was to attempt to produce copies of American records, recorded with session musicians and often fronted by teen idols. More grassroots British rock and rollers soon began to appear, including Wee Willie Harris and Tommy Steele. During this period American Rock and Roll remained dominant; however, in 1958 Britain produced its first \"authentic\" rock and roll song and star, when Cliff Richard reached number 2 in the charts with \"Move It\".D. Hatch, S. Millward, From Blues to Rock: an Analytical History of Pop Music (Manchester: Manchester University Press, 1987), p. 78. At the same time, TV shows such as Six-Five Special and Oh Boy! promoted the careers of British rock and rollers like Marty Wilde and Adam Faith. Cliff Richard and his backing band, the Shadows, were the most successful home grown rock and roll based acts of the era.A. J. Millard, The electric guitar: a history of an American icon (JHU Press, 2004), p. 150. Other leading acts included Billy Fury, Joe Brown, and Johnny Kidd & the Pirates, whose 1960 hit song \"Shakin' All Over\" became a rock and roll standard."]}, {"page": "1940", "response": ["** Adam Faith, English singer, actor (d. 2003)"]}, {"page": "2003", "response": ["* March 8 – Adam Faith, English singer and actor (b. 1940)"]}, {"page": "John Thaw", "response": ["Soon after leaving RADA, Thaw made his formal stage début in A Shred of Evidence at the Liverpool Playhouse and was awarded a contract with the theatre. His first film role was a bit part in the adaptation of The Loneliness of the Long Distance Runner (1962) starring Tom Courtenay and he also acted on-stage opposite Sir Laurence Olivier in Semi-Detached (1962) by David Turner. He appeared in several episodes of the BBC police series Z-Cars in 1963–64 as a detective constable. Between 1964 and 1966, he starred in two series of the ABC Weekend Television/ITV production Redcap, playing the hard-nosed military policeman Sergeant John Mann. He was also a guest star in an early episode of The Avengers. In 1967 he appeared in Bat Out of Hell. In 1967 he appeared in the Granada TV/ITV series, Inheritance, alongside James Bolam and Michael Goodliffe, as well as appearing in TV plays such as The Talking Head and episodes of series such as Budgie, where he played against type (opposite Adam Faith) as the son of an elderly prostitute Budgie is \"noncing\" for: an effeminate failed playwright with a full beard and a Welsh accent."]}, {"page": "Cliff Richard", "response": ["Richard's fifth single \"Living Doll\" triggered a softer, more relaxed, sound. Subsequent hits, the No. 1s \"Travellin' Light\" and \"I Love You\" and also \"A Voice in the Wilderness\", lifted from his film Expresso Bongo, and \"Theme for a Dream\" cemented Richard's status as a mainstream pop entertainer along with contemporaries such as Adam Faith and Billy Fury. Throughout the early 1960s, his hits were consistently in the top five.", "At the age of 22, a year after his relationship with Delia Wicks ended, Richard had a brief romance with the actress Una Stubbs. Later in the 1960s, Richard considered marriage to the dancer Jackie Irving. Richard described Irving as \"utterly beautiful\" and says for a time they were \"inseparable\". Irving went on to marry Adam Faith.", "Cliff Richard's 1958 hit \"Move It\" is widely regarded as the first authentic British rock and roll record, and \"laid the foundations\" for the Beatles and Merseybeat music. John Lennon reportedly said of Richard that before Cliff and the Shadows, there had been nothing worth listening to in British music. In contrast to contemporaries such as Marty Wilde, Billy Fury and Adam Faith, his successful performing and recording career in the UK has extended over six decades."]}, {"page": "Zoë Wanamaker", "response": ["Television series have included Paradise Postponed (as Charlotte Fanner-Titmuuss, 1986) and Love Hurts (1992–94) with Adam Faith. She appeared with Wendy Hiller in The Countess Alice in 1992, playing a rebellious woman searching for the truth about her past in war-torn Germany."]}, {"page": "Parlophone", "response": ["Parlophone Records Limited (also known as Parlophone Records and Parlophone) is a German–British record label founded in Germany in 1896 by the Carl Lindström Company as Parlophon. The British branch of the label was founded on 8 August 1923 as the Parlophone Company Limited (the Parlophone Co. Ltd.), which developed a reputation in the 1920s as a jazz record label. On 5 October 1926, the Columbia Graphophone Company acquired Parlophone's business, name, logo, and release library, and merged with the Gramophone Company on 31 March 1931 to become Electric & Musical Industries Limited (EMI). George Martin joined Parlophone in 1950 as assistant label manager, taking over as manager in 1955. Martin produced and released a mix of recordings, including by comedian Peter Sellers, pianist Mrs Mills, and teen idol Adam Faith.", "A consistently successful act for Parlophone was teen idol Adam Faith, who was signed to the label in 1959. The label gained significant popularity in 1962 when Martin signed Liverpool band the Beatles. Parlophone gained more attention after signing the Hollies, Ella Fitzgerald, and Gerry and the Pacemakers in the 1960s. Martin left EMI/Parlophone to form Associated Independent Recording (AIR) Studios in 1965."]}, {"page": "Acton, London", "response": ["*Adam Faith, singer, actor and financial journalist was born and grew up in Acton."]}, {"page": "Hayes, Hillingdon", "response": ["Hayes has had six cinemas in its history. (1.) The town's first cinema, in the silent era, opened in 1913, and was named simply The Hayes Cinema. It was situated at 53–55 Station Road, Hayes – now the site of a branch of Poundland (formerly Woolworths). The Hayes Cinema was renamed Gem Cinema before its closure in the middle of World War I, in 1916. (2.) The Regent Cinema stood between 1924 and 1938 at 16 Station Road, Hayes – now the site of a branch of NatWest bank. The Regent Cinema subsequently became The Regent Theatre (1948–54). Playwright John Osborne performed at the theatre as a young actor, and stars including Kenneth Williams, Diana Dors and John Le Mesurier performed there also early in their careers. Sylvia Rayman's groundbreaking \"all-women play\" Women of Twilight (1951) was premiered at Hayes's Regent Theatre. (3.) The Corinth Cinema opened in 1933 at 1040 Uxbridge Road. Renamed The Essoldo in 1949, it was the first cinema in the area to be equipped with CinemaScope and stereophonic sound. After purchasing an alternative building nearby in 1957 (infra), the Essoldo chain closed this cinema in 1961. The address is now the site of the town's Point West Building. (4.) The Ambassador Theatre existed between 1938 and 1961 on the area of East Avenue, Hayes which is now occupied by the British Telecommunications Centre (formerly a GPO telephone exchange). Actress Valerie Hobson made a personal appearance on the occasion of the Ambassador Theatre's opening on 19 December 1938; she starred in the film screened for the occasion: This Man Is News. (5.) The Savoy Cinema existed from 1939 to 1957 at 466 Uxbridge Road, Hayes. The building was designed by noted cinema architect George Coles. Some famous artists performed on stage at Hayes's Savoy Cinema over the years – Max Miller, Josephine Baker and Adam Faith among them. The Essoldo chain bought the Savoy in 1957, renaming it The Essoldo in 1962 (after closing its nearby namesake in 1961). This incarnation of the Essoldo closed in 1967. Coles' building was converted into an Essoldo Bingo Club; it became a Ladbrokes Lucky 7 Club, and is now a branch of Mecca Bingo. (6.) The Classic Cinema (1972–1986) was located above a Waitrose supermarket, at 502 Uxbridge Road, Hayes. Subsequently, demolished, its entrance was immediately to the left of the former Savoy (see 5, above)."]}, {"page": "The Best... Album in the World...Ever!", "response": ["#\"Lonely Pup (In a Christmas Shop)\" – Adam Faith", "#\"Lonely Pup (In a Christmas Shop)\" – Adam Faith"]}, {"page": "Des O'Connor", "response": ["O'Connor had a successful career as a singer, recording 36 albums, five of which reached the Top 40 of the UK Albums Chart. O'Connor appeared with Morecambe and Wise on several of their Christmas Shows. He worked with many pop stars, including Adam Faith, Shirley Bassey, Barbra Streisand, and Cilla Black. He toured with Buddy Holly (during Holly's 1958 stay in Britain) and Jason Donovan."]}, {"page": "1962 in music", "response": ["*Adam Faith – Adam Faith"]}, {"page": "2003 in music", "response": ["*March 8 – Adam Faith (62), singer, actor (heart attack) "]}, {"page": "Lionel Bart", "response": ["Some of his other compositions include the theme song to the James Bond film From Russia with Love, and the songs \"Living Doll\" by Cliff Richard, \"Far Away\" by Shirley Bassey, \"Do You Mind?\" (recorded by both Anthony Newley and Andy Williams), \"Big Time\" (a 1961 cover by Jack Jones of his show tune from Fings Ain't Wot They Used T'Be), \"Easy Going Me\" by Adam Faith, \"Always You And Me\" by Russ Conway, and several songs recorded by Tommy Steele (\"A Handful of Songs\", \"Butterfingers\" and \"Little White Bull\"). By the mid 1960s he was as well known for his outlandish lifestyle, his celebrity friends, his excesses and his parties, as he was for his work.", "He first gained widespread recognition through his pop songwriting, penning numerous hits for the stable of young male singers promoted by artist manager and music publisher Larry Parnes. Bart's pop output in this period includes the hits \"Living Doll\" (written for Cliff Richard) and \"Rock with the Cavemen\", \"Handful of Songs\", \"Butterfingers\" and \"Little White Bull\" (all for Tommy Steele). During this period, Steele and Mike Pratt were his songwriting partners. He won three Ivor Novello Awards in 1957, a further four in 1958, and two in 1960. He wrote the theme song for the 1963 James Bond film From Russia with Love. His other hits include \"Do You Mind\", recorded by both Andy Williams and Anthony Newley, whose recording reached number one on the UK charts on 30 March 1960 and was the 100th song to do so, \"Big Time\" (a 1961 cover by Jack Jones of his show tune from Fings Ain't Wot They Used T'Be), \"Easy Going Me\" (Adam Faith), and \"Always You And Me\" (with Russ Conway)."]}, {"page": "1940 in music", "response": ["**Adam Faith, singer and actor (d. 2003)"]}, {"page": "Barry Gibb", "response": ["Around the same time, the Gibb brothers contributed backing vocals on the track \"Cowman, Milk Your Cow\" a song written by Gibb and Robin sung by singer Adam Faith."]}, {"page": "2003 in film", "response": ["| style=\"text-align:center;\"| 8 || Adam Faith || style=\"text-align:center;\"| 62 || style=\"text-align:center;\"|UK || style=\"text-align:center;\"| Actor, Singer || "]}, {"page": "1980 in film", "response": ["*Foxes, directed by Adrian Lyne, starring Jodie Foster, Cherie Currie, Scott Baio and Adam Faith", "*McVicar, directed by Tom Clegg, starring Roger Daltrey, Adam Faith, Cheryl Campbell – (U.K.)", "| Foxes || United Artists / PolyGram Pictures / Casablanca Records & Filmworks || Adrian Lyne (director); Gerald Ayres (screenplay); Jodie Foster, Scott Baio, Sally Kellerman, Randy Quaid, Cherie Currie, Lois Smith, Laura Dern, Robert Romanus, Adam Faith, Marilyn Kagan, Kandice Stroh || Coming-of-Age, Drama || Live action", "| McVicar || Crown International Pictures / The Who Films / Polytel || Tom Clegg (director/screenplay); John McVicar (screenplay); Roger Daltrey, Adam Faith, Cheryl Campbell, Billy Murray, Georgina Hale, Steven Berkoff, Brian Hall, Matthew Scurfield, Harry Fielder, Ian Hendry, Malcolm Tierney, Robert Walker Jr., James Marcus, Tony Haygarth, Anthony May, Peter Jonfield, Leonard Gregory, Joe Turner, Jeremy Blake, Anthony Trent, Terence Stuart, Charles Cork, Paul Kernber, Ronald Herdman, Tony Rohr, Michael Feast, Richard Simpson, Ricky Parkinson || Drama || Live action"]}, {"page": "1979 in film", "response": ["*Yesterday's Hero, directed by Neil Leifer, starring Ian McShane, Suzanne Somers, Adam Faith and Paul Nicholas – (U.K.)", "| Yesterday's Hero || Columbia Pictures || Neil Leifer (director); Jackie Collins (screenplay); Ian McShane, Suzanne Somers, Adam Faith, Paul Nicholas, Sam Kydd, Glynis Barber, Trevor Thomas, Sandy Ratcliff, Alan Lake, Matthew Long, Paul J. Medford, Paul Desbois, Eric Deacon, George Moon, Jack Haig, Damian Elwes, Cary Elwes, John Motson || Drama || Live Action"]}, {"page": "1974 in film", "response": ["*Stardust, directed by Michael Apted, starring David Essex, Adam Faith and Larry Hagman – (U.K.)"]}, {"page": "1962 in film", "response": ["*Mix Me a Person, directed by Leslie Norman, starring Anne Baxter, Donald Sinden and Adam Faith – (U.K.)"]}, {"page": "1961 in film", "response": ["*What A Whopper, directed by Gilbert Gunn, starring Adam Faith, Sidney James, Carole Lesley and Terence Longdon – (U.K.)"]}, {"page": "1960 in film", "response": ["*Beat Girl, starring David Farrar, Gillian Hills, Adam Faith, Christopher Lee – (U.K.)", "*Never Let Go, directed by John Guillermin, starring Richard Todd, Peter Sellers, Elizabeth Sellars and Adam Faith – (U.K.)"]}, {"page": "1940 in film", "response": ["*June 23 – Adam Faith, English actor and singer (died 2003)"]}, {"page": "John Rhys-Davies", "response": ["Rhys-Davies appeared sporadically on UK television in the early 1970s, including his role as the gangster Laughing Spam Fritter opposite Adam Faith in Budgie. Later he played Praetorian officer Naevius Sutorius Macro in I, Claudius. He then began to appear more frequently, and not just in the UK, with roles as a Portuguese navigator Rodrigues in the 1980 television miniseries Shogun, based on the novel by James Clavell, and as Sallah in two of the Indiana Jones films. In 1989, he played Marvel Comics character Kingpin in The Trial of the Incredible Hulk. Rhys-Davies also starred in another Clavell adaption, Noble House, set in Hong Kong, in which he plays Ian Dunross' corporate enemy, Quillian Gornt. He has since appeared in numerous television shows and miniseries, including Agent Michael Malone in the 1993 remake of the 1950s television series The Untouchables as well as a leading role in the television series Sliders as Professor Maximillian Arturo from 1995 to 1997."]}, {"page": "John Barry (composer)", "response": ["By 1959 Barry was gaining commissions to arrange music for other acts, starting with a young trio on Decca, coincidentally called the Three Barry Sisters, though unrelated both to Barry and the more famous The Barry Sisters duo in America.Pete Frame The restless generation: how rock music changed the face of 1950s Britain 0952954079 2007 - Page 414 \"Meanwhile, Barry was winning commissions to arrange music for other acts, starting with a young trio on Decca, the unrelated (to him) Barry Sisters. Together, they cut two singles, Tall Paul and Jo Jo The Dog-faced Boy, which had been consecutive American hits for Annette Funicello. Neither excited retail interest - and nor did any of the three singles he made with Larry Page\" The career breakthrough for Barry was the BBC television series Drumbeat, when he appeared with the John Barry Seven. He was employed by EMI from 1959 until 1962 arranging orchestral accompaniments for the company's singers, including Adam Faith. He also composed songs (along with Les Vandyke) and scores for films in which Faith was featured. When Faith made his first film, Beat Girl (1960), Barry composed, arranged and conducted the film score, his first. His music was later released as the UK's first soundtrack album.Firth, Simon Music for Pleasure: Essays in the Sociology of Pop Routledge, 1988, p.147", "These achievements caught the attention of the producers of a new film called Dr. No (1962) who were dissatisfied with a theme for James Bond given to them by Monty Norman. Barry was hired and the result was one of the most famous signature tunes in film history, the \"James Bond Theme\". (Credit goes to Monty Norman, see here.) When the producers of the Bond series engaged Lionel Bart to score the next James Bond film From Russia with Love (1963), they discovered that Bart could neither read nor write music. Though Bart wrote a title song for the film, the producers remembered Barry's arrangement of the James Bond Theme and his composing and arranging for several films with Adam Faith. Lionel Bart also recommended Barry to producer Stanley Baker for his 1964 film Zulu.Hall, Dr Sheldon Zulu: With Some Guts Behind It: The Making of the Epic Movie 2005 Tomahawk Press That same year Bart and Barry collaborated on the film Man in the Middle; and then, in 1965, Barry worked with director Bryan Forbes in scoring the World War II prison-camp drama King Rat."]}, {"page": "Chris Evert", "response": ["In 1979, Evert married the British tennis player John Lloyd and changed her name to Chris Evert Lloyd. After her affair with British singer and actor Adam Faith, the couple separated, but reconciled and chronicled their marriage in a biography Lloyd On Lloyd co-authored by Carol Thatcher.Lloyd on Lloyd. Chris Evert & John Lloyd with Carol Thatcher. Beaufort Books 1986.  The couple divorced in April 1987."]}, {"page": "Clodagh Rodgers", "response": ["Rodgers was born in Warrenpoint and began her professional singing career at 13 when she opened for Michael Holliday. Her father, a dancehall tour promoter, helped her sign with Decca in 1962, where her earliest singles were produced by Shel Talmy. Her UK TV debut came on 26 September 1962, appearing as a guest on BBC TV's Adam Faith Show performing Let's Jump the Broomstick. She made four singles with Decca, before moving to EMI's Columbia label in 1965, where 'Cloda Rogers' made the 1966 single \"Stormy Weather\"/\"Lonely Room\".Sleeve notes, Backcomb 'n' Beat: Dream Babes Volume Three (RPM CD, 2001) Although none of her Decca or Columbia singles made the UK Singles Chart, Rodgers became a regular face on British television and appeared in the musical films Just for Fun (1963) and It's All Over Town (1964). She also appeared in various song festivals, finishing third in the European Song Cup competition in Greece with  \"Powder Your Face With Sunshine\". In November 1963 she flew to Nashville, Tennessee at the invitation of the American singer Jim Reeves, to perform at the Grand Ole Opry. On his Irish tour earlier that year he had recognised that Rodgers was a promising artist with a bright future.", "*26 September 1962 - BBCtv: Adam Faith Show", "*10 November 1962 - BBCtv: Adam Faith Show"]}, {"page": "Jim Capaldi", "response": ["Back in Worcester, the Hellions provided backing to visiting performers including Adam Faith and Dave Berry. By the end of 1964, they had a London residency at the Whisky a Go Go Club. In 1964–65 the band released three singles, but none charted.Joynson, Vernon (1995). The Tapestry of Delights . London: Borderline Books. See entry on \"The Hellions\". Later that year John \"Poli\" Palmer joined the band on drums and Capaldi became the lead vocalist.(2011). In Dear Mr Fantasy: The Jim Capaldi Story (pp.32–43) [CD booklet]. London: Freedom Songs Ltd."]}, {"page": "Sunbury-on-Thames", "response": ["|Adam Faith – singer and actor||Elizabeth Gardens||1960s"]}, {"page": "Peter Grant (music manager)", "response": ["Grant was soon attracted to the entertainment industry, and worked as a stagehand for the Croydon Empire Theatre until 1953, when he was called up for national service in the RAOC, reaching the rank of corporal.Led Zeppelin In Their Own Words compiled by Paul Kendall (1981), London: Omnibus Press. , pp. 17–18. He worked briefly as an entertainment manager at a hotel in Jersey before being employed as a bouncer and doorman at London's famous 2i's Coffee Bar, where Cliff Richard, Adam Faith, Tommy Steele and others got their start.Mick Wall (2008), When Giants Walked the Earth: A Biography Of Led Zeppelin, London: Orion Co-owner of the 2i's bar, professional wrestler Paul Lincoln, suggested and assisted Grant appear on television as a wrestler under the titles \"Count Massimo\" and \"Count Bruno Alassio of Milan,\" using his 6 ft 2 in frame to good effect. This kindled his enthusiasm for acting, and he was hired by film studios as a bit part actor, stuntman and body double."]}, {"page": "Jonathan King", "response": ["In 1958, King became a boarder at Charterhouse in Godalming, Surrey. He wrote that he \"loved Charterhouse immediately\", with its history and \"every possible area of encouragement from sport to intellectual pursuits.\" Unlike at Stoke House, there were other boys there who appreciated pop music. He bought a transistor radio and earphones and joined the \"under the bedclothes\" club, listening to Tony Hall, Jimmy Savile, Don Moss and Pete Murray on Radio Luxembourg, and keeping track of the New Musical Express charts. The music, particularly Buddy Holly, Adam Faith, Roy Orbison and Gene Pitney, made him \"ache with desire\":"]}, {"page": "Chislehurst Caves", "response": ["Mid 50s to early 60s, Lonnie Donegan played there along with other early British rockers such as Adam Faith, Marty Wilde and The Rolling Stones."]}, {"page": "Faith (disambiguation)", "response": ["* Adam Faith (1940–2003), English pop singer"]}, {"page": "Dave Allen (comedian)", "response": ["Allen's first television appearance was on the BBC talent show New Faces in 1959.\"Great Irish Comedians\", BBC Comedy   He hosted pop music shows in the early 1960s, including tours by Adam Faith and Helen Shapiro, and in early 1963 was the compere of a tour of Britain, headlined by Shapiro, that also included The Beatles. In 1962 he toured South Africa with American vaudeville star Sophie Tucker, whom he described as \"one of the most charming and delightful performers with whom I have ever worked\". Tucker was impressed with him and suggested that he try his luck in Australia. Moving there, he worked with Digby Wolfe on Australian television, becoming Wolfe's resident comedian."]}, {"page": "Adam (given name)", "response": ["* Adam Faith (1940–2003), British teen idol and financial journalist"]}, {"page": "Budgie (TV series)", "response": ["Budgie is a British television series starring popstar Adam Faith which was produced by ITV company London Weekend Television and broadcast on the ITV network between 1971 and 1972.Budgie | A Television Heaven Review ", "The title role, a chirpy cockney petty criminal newly out of prison, was played by pop singer Adam Faith; it was his first starring role for television.Budgie | A Television Heaven Review  The character's name was Ronald 'Budgie' Bird, nicknamed after the budgerigar birds sometimes kept as pets in England.", "A further series may have been planned for 1973, although this coincided with Adam Faith being seriously injured in a car crash, and announcing his retirement from acting as a result. Despite a full recovery by Faith and his eventual return to acting, a further series was never commissioned. Retrieved 31/08/07", "A musical based on the characters of the series (but featuring only Adam Faith from the original TV cast), with a book by the scriptwriters of the original series, opened at the Cambridge Theatre in London on 18 October 1988, and ran for three months."]}, {"page": "Tessa Sanderson", "response": ["In March 1987, Sanderson announced that she would switch focus from the javelin throw to the heptathlon. Shortly before that, she had moved to London, and was looking for a career change to television or promotional work. She later threatened to boycott athletics events, for which she was being paid £1,000 each by British Athletics whilst Whitbread was being paid £10,000 per event. Sanderson agreed a new deal at the start of June. At the Dairy Crest Games in August, Whitbread, who had been undefeated during the season, injured her shoulder whilst Sanderson won the event. Sanderson then announced that she would be training with Mick Hill in Italy for the world championships. Whitbread won the World Championship gold, while Sanderson finished fourth. By this time, former pop star Adam Faith had been engaged by Sanderson as her agent."]}, {"page": "British rock music", "response": ["The initial response of the British music industry was to attempt to produce copies of American records, recorded with session musicians and often fronted by teen idols. British rock and rollers soon began to appear, including Wee Willie Harris and Tommy Steele. The bland or wholly imitative form of much British rock and roll in this period meant that the American product remained dominant. However, in 1958 Britain produced its first \"authentic\" rock and roll song and star, when Cliff Richard reached number 2 in the charts with \"Move It\".D. Hatch, S. Millward, From Blues to Rock: an Analytical History of Pop Music (Manchester: Manchester University Press, 1987), p. 78. British impresario Larry Parnes fashioned young singers to the new trend, giving them corny names such as Billy Fury, Marty Wilde and Vince Eager.  At the same time, TV shows such as Six-Five Special and Oh Boy!, both produced by Jack Good, promoted the careers of British rock and rollers like Marty Wilde and Adam Faith. Cliff Richard and his backing band The Drifters, who quickly changed their name to The Shadows, were the most successful home grown rock and roll based acts of the era.A. J. Millard, The electric guitar: a history of an American icon (JHU Press, 2004), p. 150. Other leading acts included Joe Brown, and Johnny Kidd & The Pirates, whose 1960 hit song \"Shakin' All Over\" became a rock and roll standard. The first American rock and roll artist to hit British stages and appear on television was Charlie Gracie, quickly followed by Gene Vincent in December 1959, soon joined on tour by his friend Eddie Cochran. The producer Joe Meek was the first to produce sizeable rock hits in England, culminating with The Tornados' instrumental \"Telstar\", which went to number one in both the UK and USA."]}, {"page": "Jamie Theakston", "response": ["As an actor, Theakston has appeared in shows such as Agatha Christie's Marple and Little Britain. Theakston has acted with Amanda Holden in Mad About Alice (2004) and worked with Adam Faith on the series Murder in Mind in 2003, shortly before Faith's death. He has also starred in the West End in the plays 'Art' and Home and Beauty at the Lyric Theatre, Shaftesbury Avenue."]}, {"page": "Leo Sayer", "response": ["Sayer launched his career in the United Kingdom in the early 1970s, and he became a top singles and album act on both sides of the Atlantic in the 1970s. His first seven hit singles in the United Kingdom all reached the Top 10 – a feat first accomplished by his first manager, Adam Faith. His songs have been sung by other notable artists, including Cliff Richard (\"Dreaming\"), Roger Daltrey, and Three Dog Night.", "He was initially discovered by musician David Courtney, who then co-managed and co-produced him with former pop singer turned manager, Adam Faith.Rice, Jo. The Guinness Book of 500 Number One Hits (1st edition), Guinness Superlatives Ltd, Middlesex, UK, p. 181;  In January 1967, while 18-year-old Sayer was working as a hall porter at the King's Hotel in Hove, he assisted in the rescue of elderly guests from a serious fire that damaged the hotel's first floor. He himself was rescued from the blazing hotel by builders working on a block of flats beside the hotel.", "Sayer began his music career co-writing songs with David Courtney, including \"Giving It All Away\", which gave Roger Daltrey of the Who his first solo hit in 1973. The same year, Sayer began his career as a recording artist under the management of Adam Faith, who signed Sayer to the Chrysalis label in the United Kingdom and Warner Bros. Records in the United States.", "His debut single, \"Why Is Everybody Going Home\", failed to chart, but he achieved national prominence in the United Kingdom with his second single, the music hall styled song \"The Show Must Go On\", which Sayer performed on British television wearing a pierrot costume and makeup. The single went to No. 2 on the United Kingdom singles chart, as did his debut album, Silverbird, co-written with David Courtney who also co-produced the album with Adam Faith. Three Dog Night's cover, the group's last Billboard Hot 100 top 10 record, reached No. 4 on 25 May 1974.", "After a decade of success, Sayer's career suffered repeated setbacks due to a series of financial and legal problems. When Sayer and his first wife Janice divorced in 1985, subsequent financial disclosure revealed Adam Faith had badly mishandled his business affairs and that much of the millions of pounds he had earned over the previous decade had been lost through Faith's questionable investments and business expenses."]}, {"page": "Liverpool Empire Theatre", "response": ["Performers in the original theatre included George Formby Sr., Harry Tate, Dan Leno, Florrie Forde, The Two Bobs, and Wilson, Keppel and Betty. The first production in the present theatre was Better Days, starring Stanley Lupino, Maisie Gay and Ruth French. Subsequent performers have included Frank Sinatra, Judy Garland, Bing Crosby, Mae West, Laurel and Hardy, Roy Rogers and Trigger, Charlton Heston, Sarah Bernhardt, Henry Irving, Vesta Tilley, and Arthur Askey. More recent artists include Johnny Mathis, The Carpenters, Neil Sedaka, The Osmonds, Tommy Steel, Adam Faith, Bruce Forsyth, Victoria Wood, Morecambe and Wise, Ken Dodd, Shirley Bassey, Kylie Minogue, Kate Bush, Elton John, Cilla Black, AC/DC, Aerosmith, Chuck Berry, Black Sabbath, Lynyrd Skynyrd, Rush, Wishbone Ash, The Police, Queen, Santana, Iron Maiden, Genesis, Steve Hillage, Steve Harley and Cockney Rebel (the band's 1976 concert at the theatre is frequently alluded to by Steve Harley when he plays concerts in the North of England, since, during the extended instrumental in his song 'Death Trip' (track 10 of 1973's 'The Human Menagerie' album), he fell off the stage and into the orchestra pit, but continued performing as though nothing had happened, despite breaking 3 ribs and as a result having to cancel the rest of the tour). The Shadows (1989). In 1957 a local pop group called The Quarrymen appeared at the theatre. They returned in 1959, having changed their name to \"Johnny and the Moondogs\". They returned to the Empire again in 1962, now named The Beatles. The Beatles played the Empire for the last time on 5 December 1965. During the 1970s, two Royal Command Performances were held in the Empire, and in 2007 the theatre was the venue for the Royal Variety Performance in recognition of Liverpool being made the European Capital of Culture the following year."]}, {"page": "Juke Box Jury", "response": ["* 21 October 1961 – Adam Faith, Alan Freeman, Helen Shapiro and a 'surprise guest'", "* 8 December 1962 - Carole Carr, Adam Faith, Edmund Purdom and a 'surprise guest' Linda Ludgrove", "* 21 September 1963 - Dora Bryan, Alan Dell, Adam Faith and a 'surprise guest'", "* 25 January 1964 – Adam Faith, Carole Ann Ford, Jean Metcalfe and a 'surprise guest' Phil Spector", "* 13 June 1964 – Adam Faith, Zsa Zsa Gabor, Des O'Connor, Juliet Prowse", "* 19 September 1964 - Honor Blackman, Arthur Askey, Adam Faith, Lulu", "* 3 April 1965 – Katie Boyle, Adam Faith, Sue Lloyd, David Tomlinson", "* 4 September 1965 - Victor Borge, Helen Cherry, Adam Faith, Sandie Shaw", "* 19 March 1966 - Adam Faith, Shirley Anne Field, Jeannie Carson, Jimmy Young", "* 29 October 1966 - Rita Tushingham, Moira Lister, Adam Faith, Johnny Devlin", "* 15 July 1967 - Adam Faith, Annette Andre, Ray Fell, Salena Jones"]}, {"page": "Shindig!", "response": ["*Adam Faith"]}, {"page": "Beat Girl", "response": ["The title character of Beat Girl was played by starlet Gillian Hills, who later went on to have numerous small roles in 1960s and 1970s films, such as Blowup and A Clockwork Orange, and became a successful \"ye-ye\" singer in France.Deluxe, Jean-Emmanuel, Ye-Ye Girls of '60s French Pop. Feral House, 2013. .Gallagher, Paul. \"Gillian Hills: Keeping Time With the Beat Girl.\" dangerousminds.net, 28 June 2011, accessed 12 Mar. 2015.Cotter, Robert Michael \"Bobb\". The Women of Hammer Horror: A Biographical Dictionary and Filmography. McFarland & Co., 2013, p. 102. .Hennessey, Mike. \"News from the Music Capitals of the World: Paris.\" Billboard, 3 Apr. 1965, p. 22. Beat Girl marked the first film roles of British pop idol Adam Faith and actor Peter McEnery, although it was not released until after other films featuring Faith (Never Let Go)Glynn, Stephen. The British Pop Music Film: The Beatles and Beyond. Palgrave MacMillan, 2013, p. 40. . and McEnery (Tunes of Glory)According to the Internet Movie Database, Tunes of Glory in which McEnery played \"2nd. Lt. David MacKinnon\" was released in UK in August 1960, while Beat Girl, in which McEnery made his cinema film debut, was released in Finland and West Germany on 9 Sept. 1960, and in UK on 28 October 1960. had already come out. The film also features Christopher Lee and Nigel Green as strip joint operators, and Oliver Reed in a small role as one of the \"beat\" youth.", "The original music was composer John Barry's first film commission, and was performed by the John Barry Seven and Orchestra, Adam Faith, and Shirley Anne Field.Perone, James E. Mods, Rockers, and the Music of the British Invasion. Praeger Publishers, 2009, p.31. .Fiegel, Eddi. John Barry: A Sixties Theme: From James Bond to Midnight Cowboy. Faber & Faber, 2012, p. 71-72.Davis, Sharon. Every Chart Topper Tells a Story. Mainstream Pubs. Co., 1997, p. 1912. . The Beat Girl soundtrack was the first British soundtrack to be released on a vinyl LP.Film music had been released on shellac 78s as far back at Things to Come in 1936. It reached number 11 on the UK Albums Chart, paving the way for the release of other film soundtrack albums.", "Paul Linden (David Farrar), a wealthy and prominent architect, returns home to Marylebone, London. He brings his new wife: beautiful, French, 24-year-old Nichole (Noelle Adam), whom he has just married in Paris. Paul is anxious to introduce Nichole to his teenage daughter Jennifer (Gillian Hills), but Jennifer appears less than happy about her father's remarriage and coldly rejects Nichole's friendly overtures all evening. After Paul and Nichole go to bed, Jennifer sneaks out to the Off-Beat café in Soho for an evening of rock music and dancing with her friends, including Dave (Adam Faith), a youth from a working-class background who plays guitar and writes songs; Tony (Peter McEnery), a general's son whose mother was killed in the Blitz and who has a drinking problem (although beatniks frown on alcohol); and Dodo (Shirley Anne Field), Tony's well-bred girlfriend. Dave and Jennifer are attracted to each other.", "* Adam Faith as Dave", "After Adam Faith was cast, John Barry was asked to compose the film soundtrack, because he had already been collaborating with Faith as an arranger. Barry was subsequently hired to score Faith's next films, Never Let Go and Mix Me a Person, leading to Barry's successful career as a composer and arranger of film music. In addition to the Beat Girl soundtrack LP reaching number 11 in the album charts, the song \"Made You,\" composed by John Barry and Trevor Peacock and performed in the film by Faith, achieved minor hit status before being banned by the BBC for suggestive lyrics.Fiegel, p. 72-73. A sample from the title track is used in The Rockafeller Skank, a 1998 single by Fatboy Slim, for which Barry receives a co-writer credit."]}, {"page": "Carl Giles", "response": ["Most of the annuals included a foreword from an editor of the Express newspapers or a celebrity fan, including Margot Fonteyn (ballet dancer), Adam Faith (singer), Spike Milligan (comedian), Sir Malcolm Sargent (conductor), Jim Clark (F1 champion), Sean Connery (actor), Frank Sinatra (singer) and Tommy Cooper (comedian and magician)."]}, {"page": "Bobby Vee", "response": ["Vee's follow-up single, a cover of Adam Faith's UK number-one \"What Do You Want?\", charted in the lower reaches of the Billboard pop chart in early 1960. His fourth release, a revival of the Clovers' doo-wop ballad \"Devil or Angel\" (U.S. number six), brought him into the big time with U.S. buyers. His next single, \"Rubber Ball\" (1961, U.S. number six, Australia number one), made him an international star. He has cited as influences, producer Snuff Garrett and his personal manager, Arnold Mills. Vee's recording of \"Take Good Care of My Baby\" went to number one on Billboard magazine's U.S. pop chart in the summer of 1961 and number three in the UK Singles Chart. "]}]}}