{"wiki_id": "http://www.wikidata.org/entity/Q1388488", "itemLabel": "Noel Edmonds", "itemDescription": "English television presenter and executive", "wikipedia_url": "https://en.wikipedia.org/wiki/Noel_Edmonds", "wikipedia_page": {"main": "Noel Ernest Edmonds (born 22 December 1948) is an English television presenter, radio DJ, writer, producer, and businessman. Edmonds first became known as a disc jockey on Radio Luxembourg before moving to BBC Radio 1 in the UK. He has presented various radio shows and light-entertainment television programmes across 50 years, originally working for the BBC, later Sky UK and Channel 4. His television work includes Top of the Pops (1972–1978), Multi-Coloured Swap Shop (1976–1982), Top Gear (1979–1980), The Late, Late Breakfast Show (1982–1986), Telly Addicts (1985–1998), The Noel Edmonds Saturday Roadshow (1988–1990), Noel's House Party (1991–2000), and Deal or No Deal (2005–2016).", "link_mentions": [{"page": "ABBA", "response": ["The group travelled to London to promote The Singles: The First Ten Years in the first week of November 1982, appearing on Saturday Superstore and The Late, Late Breakfast Show, and also to West Germany in the second week, to perform on Show Express. On 19 November 1982, ABBA appeared for the last time in Sweden on the TV programme Nöjesmaskinen, and on 11 December 1982, they made their last performance ever, transmitted to the UK on Noel Edmonds' The Late, Late Breakfast Show, through a live link from a TV studio in Stockholm."]}, {"page": "BBC Radio 1", "response": ["On air, 1978 was the busiest year of the decade. David Jensen replaces Dave Lee Travis as host of the weekday drivetime programme so that DLT can replace Noel Edmonds as presenter of the Radio 1 Breakfast show. Later in the year, the Sunday teatime chart show is extended from a Top 20 countdown to a Top 40 countdown, Tommy Vance, one of the station's original presenters, rejoins the station to present a new programme, The Friday Rock Show. and on 23 November Radio 1 moves from 247m (1214 kHz) to 275 & 285m (1053 & 1089 kHz) medium wave as part of a plan to improve national AM reception, and to conform with the Geneva Frequency Plan of 1975."]}, {"page": "Official Monster Raving Loony Party", "response": ["In the run-up to the 2011 Alternative Vote referendum, the party adopted an equivocal stance, advising its supporters, on 8 April, to \"vote as you see fit\". In response to mainstream parties debating Brexit, the OMRLP suggested sending Noel Edmonds to the European Parliament \"because he understands Deal or No Deal\". They have advocated an \"Al dente Brexit\" rather than a hard or soft Brexit."]}, {"page": "Viz (comics)", "response": ["Occasionally, celebrities are granted the 'honour' of strips all to themselves. Billy Connolly has had more than one about him trying to ingratiate himself with the Queen and Bob Hope had a strip featuring the comedian trying to think up amusing last words to utter on his deathbed (but ended up with a torrent of swearing). The singer Elton John has also appeared frequently in recent issues as a double-dealing Del Boy-type character attempting to pull off small-time criminal scams such as tobacco smuggling, benefit fraud and cheating on fruit machines. Most recently, he was seen posing as a window cleaner and conning customers to pay him, before being mistaken for a Peeping Tom and given a thorough hiding. The strips always end with Elton being beaten at his own game by one or more of his musical contemporaries from the 1970s and 1980s. Other celebs to have been featured in their own strips include Jonathan Ross, Russell Brand, Esther Rantzen, Stephen Fry, Noel Edmonds, Jimmy Savile (as the headmaster of \"Pop School\", as \"Sir Jimmy Savile, the Owl\" and in \"Jimmy Savile's Haunted Head\"), Johnny Vaughan, Adam Ant, Jimmy Hill, Noddy Holder, Boy George, Freddie Garrity, Steve McFadden, Morrissey (constantly finding daffodils stuck into the seat of his trousers, parodying his appearances on Top of the Pops), Busted, Eminem, Big Daddy, Danny Baker and plenty more."]}, {"page": "1948", "response": ["** Noel Edmonds, English TV presenter, DJ"]}, {"page": "Buckinghamshire", "response": ["* Noel Edmonds, television presenter, once lived in Weston Turville"]}, {"page": "Comic Relief", "response": ["Comic Relief was launched live on Noel Edmonds' Late, Late Breakfast Show on BBC1, on Christmas Day 1985 from a refugee camp in Sudan. The idea for Comic Relief came from the charity worker Jane Tewson, who established it as the operating name of Charity Projects, a registered charity in England and Scotland."]}, {"page": "Live Aid", "response": ["Phil Collins performed at both Wembley Stadium and JFK, travelling from Wembley by helicopter (piloted by UK TV personality Noel Edmonds) to London Heathrow Airport, then took a British Airways Concorde flight to New York City, before taking another helicopter to Philadelphia. As well as his own set at both venues, he also played the drums for Eric Clapton, and played with the reuniting surviving members of Led Zeppelin at JFK. On the Concorde flight, Collins encountered actress and singer Cher, who was unaware of the concerts. Upon reaching the US, she attended the Philadelphia concert and can be seen performing as part of the concert's \"We Are the World\" finale. In a 1985 interview, singer-songwriter Billy Joel stated that he had considered performing at the event, but ultimately chose not to because he had difficulties getting his band together and didn't want to perform by himself.", "* Andy Peebles—introduced Spandau Ballet, Elvis Costello, Noel Edmonds, Howard Jones, Bryan Ferry, Paul Young, Griff Rhys Jones with Mel Smith and David Bowie", "* Noel Edmonds—introduced Sting with Phil Collins"]}, {"page": "British Academy Film Awards", "response": ["| Noel Edmonds"]}, {"page": "Countdown (game show)", "response": ["Richard Whiteley was the victim of a practical joke while presenting the show in 1998. The contestants and rounds had been planted as part of a \"Gotcha!\", a regular prank feature on the light entertainment show Noel's House Party. In the prank, both the two contestants and Dictionary Corner missed the word \"something\" from the letters OMETHINGS, and from another selection, both of the contestants declared \"I've got diarrhoea\" referring to the selection. In the numbers round that followed, the male contestant \"answered\" the puzzle by concatenating 6, 2, and 3 to make the target of 623. Whiteley did not uncover the joke until House Party presenter Noel Edmonds appeared on the set, having revealed the unusually short conundrum of HOGCAT to be \"gotcha\" at the end of the programme.Channel 4 Community webchat with Richard Whiteley, explaining his Gotcha!—Retrieved 21 June 2006. "]}, {"page": "Sharon Osbourne", "response": ["In 2006, UK TV network ITV commissioned a new chat show, initially to be called Mrs Osbourne Presents, but eventually just named The Sharon Osbourne Show. Osbourne signed a deal with ITV for a reputed £2 million. The show began on Tuesday 29 August 2006, and was scheduled to run for six weeks in the 5 pm weekday timeslot. The premiere episode proved a close competition as the show received 1.9 million viewers with 17% share – 400,000 viewers (and 3% share) ahead of Richard & Judy on Channel 4. Her second show attracted 2.1 million viewers. However, ratings appeared to decrease after Channel 4 moved its game show Deal Or No Deal, hosted by Noel Edmonds, into the timeslot, with Osbourne managing 1.2 million viewers compared to Deal Or No Deal's 2.9m."]}, {"page": "1948 in television", "response": ["|Noel Edmonds"]}, {"page": "Cilla Black", "response": ["In the days following her death, a book of condolence was opened at the Liverpool Town Hall. Then-Prime Minister David Cameron stated, \"Cilla Black was a huge talent who made a significant contribution to public life in Britain. My thoughts are with her family.\" Paul McCartney, Ringo Starr, Sheridan Smith, Holly Johnson, Cliff Richard, and Paul O'Grady were among friends and colleagues in the entertainment industry who expressed their sorrow at Black's death. Comedian Jimmy Tarbuck, who had been a friend for decades, said, \"She was the girl next door that everybody loved and would have loved as a daughter, a daughter-in-law.\" Songwriter Burt Bacharach said, \"It will always be a most special memory for me of recording her on Alfie in Abbey Road Studios in 1965.\" Broadcaster Noel Edmonds said that she \"captured the hearts of the British people\" because \"she was our Cilla—there were no airs and graces\"."]}, {"page": "Tiswas", "response": ["Lenny Henry appeared on the BBC's It Started With Swap Shop programme in 2006, in which he spoke to Noel Edmonds about Tiswas being the rival of Swap Shop during the entire era."]}, {"page": "Eurovision Song Contest 1980", "response": ["* Noel Edmonds"]}, {"page": "Uri Geller", "response": ["Television presenter Noel Edmonds often used hidden cameras to record celebrities in Candid Camera-like situations for his television programme, Noel's House Party. In 1996, Edmonds planned a stunt in which shelves would fall from the walls of a room while Geller was in it. The cameras recorded footage of Geller from angles he was not expecting, and they showed Geller grasping a spoon firmly with both hands as he stood up to display a bend in it."]}, {"page": "Child Is Father to the Man", "response": ["The album was re-released in the UK in 1973, entitled \"The First Album\" on Embassy Records, a subsidiary of Columbia Records (catalogue number EMB 31028) with an identical track listing and the same picture on the front of the sleeve. The rear had new sleeve notes written by English DJ, Noel Edmonds."]}, {"page": "Toyah Willcox", "response": ["After appearing as an extra in a drama being made at the BBC Pebble Mill studios in Birmingham, an opening came to take a role in Glitter, a play in the BBC \"Second City Firsts\" series, alongside Noel Edmonds and Phil Daniels. Recommended to the play's director by a member of the wardrobe department because of her distinctive appearance and oddball character, Willcox was given the role of Sue, a girl who sang with a band called Bilbo Baggins and who dreamed of appearing on Top of the Pops. In the course of the 30-minute play, Willcox performed two songs she had co-written: \"Floating Free\" (an acoustic ballad, with Phil Daniels accompanying her on guitar) and \"Dream Maker\".Glitter, Toyah Willcox official website. Accessed 2021-07-18. The play was seen by Kate Nelligan and Maximilian Schell, who offered her work with the National Theatre in London, where she got the part of Emma in Tales from the Vienna Woods, directed by Schell. The opening led to her relocating to London."]}, {"page": "John Snagge", "response": ["Snagge retired in 1965, but continued to provide commentaries for the Boat Race until 1980. The same year his wife Eileen died. Around this time he also appeared on Noel Edmonds's Radio 1 show on Sunday mornings, a role subsequently taken up by Brian Perkins."]}, {"page": "Tony Blackburn", "response": ["At first he was associated mainly with mainstream pop, but he later championed soul music. It was largely due to him that \"I'm Still Waiting\" by Diana Ross, which was initially just an album track, was released as a single in the UK in 1971 and reached number one. He was a regular host of Top of the Pops for a decade until 1979 and he appeared with fellow DJ's Noel Edmonds and Kenny Everett on the 500th anniversary show where he performed the spoken part of \"Won't Somebody Dance With Me\" and then danced with singer Lynsey de Paul. In 1968, he fronted his own show, Time For Blackburn, produced by Southern Television for the ITV network. \"The Radio 1 DJs were a massive attraction. We were mobbed everywhere we went\", Blackburn told Simon Hattenstone, referring to personal appearances. \"It was all a bit mad, but great fun\", he told Judith Woods in 2014. We \"were built up to be stars in our own right, and as a result we were as famous as the artists we played.\"", "In 1972 he released a self named album on the RCA label. Two of the tracks were released as singles: \"Chop Chop\", written by Nicky Chinn and Mike Chapman, and \"House of Cards\", written by Lynsey de Paul and Barry Green. His version of Doris Troy's \"I'll Do Anything\" was recorded in 1969 for his second album, Tony Blackburn, which was released on Polydor label. This version of the Gamble and Huff song was re-discovered by Northern soul fans when it was pressed up as a white labelKeep on Burning - a Northern soul documentary produced by Outta Sight Records on Talking Pictures TV between 12:05pm-2:05pm on 19 October 2021 with Tony Blackburn, Marc Almond and Ian Levine and became a hit on the scene's dancefloors. The single was re-released as a  single under the pseudonym Lenny Gamble on Casino Classics in June 1978, with the pseudonym being a portmanteau of songwriters Leon Huff and Kenny Gamble. Blackburn was allegedly furious when Noel Edmonds revealed the alias on air. Nevertheless, Blackburn and Edmonds became close friends. All of the Blackburn's singles, including \"I'll Do Anything\" and \"House of Cards\" were finally released in 2012 on a CD compilation album The Singles Collection 1965–1980 on the Cherry Red label.", "Blackburn began presenting the Breakfast show for Classic Gold Digital, a station based in Bedfordshire, in late 2003. He was suspended in late June 2004 for featuring too many Cliff Richard records. The singer was not on the station's playlist. Noel Edmonds, whose company owned a majority shareholding, thought Blackburn would soon return to broadcasting for the station.  The suspension was short lived. Blackburn won his dispute with management over the playlist a few days later, and Cliff Richard was added to it. \"We should be playing him as much as The Beatles\", said the station head. Whilst doing the Breakfast show, he quit his Monday evening slot from 8-10pm on BBC Radio London, but still continued with Saturday Lunchtime."]}, {"page": "Enn Reitel", "response": ["He also played two roles in different episodes of long-running sitcom One Foot in the Grave. In the first Christmas special, he played \"Mr. Starkey\", a down and out who holds Victor Meldrew (Richard Wilson) and his neighbour Pippa's father, Reverend Croker (Geoffrey Chater) at gunpoint to wait for Armageddon on Christmas Day. In the second episode of series 3, \"Dreamland\", he played a tramp who took a fancy to Victor's shoes, but drew the line at his Noel Edmonds-esque sweater."]}, {"page": "Anthea Turner", "response": ["Turner was also a host on the first National Lottery draw on BBC One on 19 November 1994 with Noel Edmonds and Gordon Kennedy. She remained as sole host of the National Lottery Live until 20 April 1996, when she joined ITV and the travel show Wish You Were Here...?, becoming the second-highest-paid female television presenter in the UK, after Cilla Black. She was replaced on The National Lottery Live by Bob Monkhouse."]}, {"page": "Brentwood School, Essex", "response": ["*Noel Edmonds (born 1948), disc jockey and broadcaster"]}, {"page": "Mastermind (British game show)", "response": ["In the late 1970s, Noel Edmonds' radio Sunday lunchtime show featured a send-up called \"Musty Mind\" where a phone-in contestant would be asked ludicrous questions on a parody of a serious subject, such as the \"Toad Racing\" or, on another occasion, \"The Cultural and Social History of Rockall\" – Rockall being a bald lump of uninhabited rock in the eastern Atlantic."]}, {"page": "Exeter City F.C.", "response": ["Famous fans include Coldplay frontman Chris Martin,Coldplay guitarist: 'I'd give it all up for Tottenham Hotspur' – NME News. Retrieved 3 June 2010 Adrian Edmondson,It’s fun down here... life outside the Premier League – The Independent (London). Retrieved 3 June 2010 Mark Nicol, Noel Edmonds, swimmer Liam Tancock,Liam Tancock: 'I would always be in the fields looking for slow worms – The Guardian. Retrieved 17 August 2016 and Hoosiers drummer Alan Sharland. Singer Joss Stone signed up as a member of the supporters trust, being introduced to fans on the pitch as a new member during a League Cup match against Liverpool.Pride in defeat for Exeter City  – Exeter Express and Echo (This Is Devon). Retrieved 25 August 2011Joss Stone Joins The Trust  – Exeter City Football Club, The Official Website. Retrieved 26 August 2011"]}, {"page": "Brit Awards", "response": ["| rowspan=\"2\" |Noel Edmonds", "| Noel Edmonds"]}, {"page": "Dimensions in Time", "response": ["* Part One was broadcast as part of the 1993 Children in Need telethon. It was introduced by Noel Edmonds in a short live sketch with Jon Pertwee, in character as the Third Doctor."]}, {"page": "Hackney carriage", "response": ["Ghosthunting With... featured a black cab owned by host of the show, Yvette Fielding. Bez of the Happy Mondays owns one, shown on the UK edition of Pimp My Ride. Noel Edmonds used a black cab to commute from his home to the Deal or No Deal studios in Bristol.  He placed a dressed mannequin in the back so that he could use special bus/taxi lanes, and so that people would not attempt to hail his cab."]}, {"page": "Come Dancing", "response": ["The many presenters over the years included Peter West, McDonald Hobley, Charles Nove, Terry Wogan, Brian Johnston, Angela Rippon, Michael Aspel, Noel Edmonds, David Jacobs, Judith Chalmers, Pete Murray and Rosemarie Ford. Commentators included Ray Moore and Bruce Hammal."]}, {"page": "List of game show hosts", "response": ["| Noel Edmonds || United Kingdom || Come Dancing, Juke Box Jury (1979), Telly Addicts (1985–98), Deal or No Deal (2005–16), Are You Smarter than a 10 Year Old? (2007–10), Cheap Cheap Cheap (2017–present)"]}, {"page": "Weston Turville", "response": ["A notable resident of the village in the 16th century was Dr John Colet. It is after him that the John Colet School in nearby Wendover is named. At one time, the UK TV presenter and Radio DJ Noel Edmonds had a home in Weston Turville. Currently former Arsenal defender Nigel Winterburn and Richard Lapthorne, Chairman of Cable & Wireless Communications, live in the village."]}, {"page": "Keith Chegwin", "response": ["In the mid 1970s, Chegwin moved away from acting, becoming a household name presenting programmes such as Multi-Coloured Swap Shop (1976–82), Cheggers Plays Pop (1978–86) and, in the 1980s, Saturday Superstore. As Brown Sauce, he and Swap Shop co-presenters Noel Edmonds and Maggie Philbin released the pop single \"I Wanna Be a Winner\", which reached number 15 in January 1982, and a follow-up single as the Saucers called \"Spring Has Sprung\". On Swap Shop and Superstore, he was featured in outside broadcasts; on Swap Shop they were called Swaparama, appearing at outdoor venues around Britain, where he helped children swap their toys. On Superstore, Chegwin had a similar role."]}, {"page": "Bad Manners", "response": ["After becoming popular in their native London, Bad Manners signed to Magnet Records in 1980, and became regular guests on television shows such as Tiswas. The band also appeared on The British Music Awards (1981) and Cheggers Plays Pop. In 1985, they also appeared on The Time of Your Life, hosted by Noel Edmonds. Being closely associated with the 2 Tone movement (though never signed to 2 Tone Records itself), they were one of six bands featured in the 1981 documentary film Dance Craze."]}, {"page": "Dick & Dom in da Bungalow", "response": ["* Game or No Game in which Little Noely (a parody of Noel Edmonds played by Ian Kirkby who appeared in the Bungalow on two occasions) presents a parody of Deal or No Deal in order to determine whether or not a game will be shown or not. Little Noely invited viewers to pick one of two boxes. We are led to believe that if the \"No Game\" box is picked the show will end. If the \"Game\" box is picked the name of the game shown in the box is played."]}, {"page": "The Adventure Game", "response": ["Notable contestants included Keith Chegwin, Sue Cook, astronomer Heather Couper, John Craven, Paul Darrow, Noel Edmonds, Sarah Greene, Bonnie Langford, James Burke, Elizabeth Estensen, Janet Fielding and Richard Stilgoe.", "| 6 || 8 March 1984 || 10 October 1985 || 45 || Fern Britton, Noel Edmonds, Ray Virr"]}, {"page": "Jeremy Beadle", "response": ["In 1973, as an early member of the Campaign for Real Ale, he was elected to their National Executive and secured the campaign's first television or radio coverage in a one-hour programme on BBC Radio London, which he hosted.\"What's Brewing\", March 2008 edition. It was during this period that his talent for practical jokes became evident, although occasionally this rebounded on him, such as when colleagues left him naked in front of 400 women arriving for their shift. He then started writing for radio and television, going on to provide material for stars such as Sir Terry Wogan, Michael Aspel, Noel Edmonds and Kenny Everett."]}, {"page": "British Comedy Awards", "response": ["* Best BBC entertainment presenter: Noel Edmonds", "* Best BBC entertainment presenter: Noel Edmonds"]}, {"page": "Melinda Messenger", "response": ["Messenger released her Back into Shape Workout DVD, which was a six-week fitness programme designed to help new mothers recover their fitness. She appeared on Noel Edmonds – Gotcha! in which she was one of the subjects to receive the treatment from Noel and his team."]}, {"page": "1948 in radio", "response": ["*22 December – Noel Edmonds, English broadcast presenter and producer."]}, {"page": "Noel Edmunds", "response": ["#REDIRECT Noel Edmonds"]}, {"page": "Baddiel and Skinner Unplanned", "response": ["| 2 || 11 || 31/01/2001 || Gareth - Advertising || The 'In' Crowd (Orange Book, Song 12) || Cat therapist, Noel Edmonds, Tax, \"when ur hand is hard ur meat is done\""]}, {"page": "Mah Nà Mah Nà", "response": ["At the BBC's Children in Need 2011 telethon, Kermit and Miss Piggy introduced a performance of the song, which featured many stars of British television, including Harry Hill, Noel Edmonds and Gary Lineker."]}, {"page": "New Faces", "response": ["Winners went on to have careers in television entertainment, such as Lenny Henry the 1975 competition winner. Many top entertainers began their careers with a performance on this programme. The acts were evaluated by a panel of experts, including Tony Hatch, Mickie Most, Clifford Davis, Arthur Askey, Ted Ray, Ed Stewart, Jack Parnell, Alan A. Freeman, Muriel Young, Lonnie Donegan, Lionel Blair, Ingrid Pitt, Shaw Taylor, Terry Wogan and Noel Edmonds."]}, {"page": "Noel's House Party", "response": ["Noel's House Party was a BBC light entertainment series that was hosted by Noel Edmonds. Set in a large house in the fictional village of Crinkley Bottom, leading to much innuendo, it ran from 23 November 1991 to 26 March 2000 on BBC One, and for 8 series was broadcast live on Saturday evenings. The show, once described by a senior corporation executive as \"the most important show on the BBC\", was cancelled in February 1999 due to declining ratings, although two further compilation specials were shown in March 2000. In 2010, Noel's House Party was voted the best Saturday night TV show of all time.", "Noel's House Party was the successor to The Noel Edmonds Saturday Roadshow, carrying over some of its regular features such as the 'Gunge Tank', the 'Gotcha Oscar' and 'Wait Till I Get You Home'.", "In series 1, celebrity duos competed against one another to complete the lyrics of a song after being given the first line. This feature was originally in The Noel Edmonds Saturday Roadshow. In series 2 members of the public had to guess the name of the song from the lyrics, but this was replaced in series 3 with the panel game.", "Carried over from The Noel Edmonds Saturday Roadshow, the gunge tank was put to various uses, usually gunging celebrities or unpopular members of the public after a phone vote was carried out during the show. Gunging usually took place in the final minutes of the show. Gunged guests/celebrities include Jenny Hull, Jilly Goolden, Mary Peters, Frank Carson, Keith Floyd, Lynn Faulds Wood, Kristian Schmid, Mat Stevenson, Anthea Turner, Nigel Mansell, Richard Whiteley, Carol Vorderman, Adam Woodyatt, Piers Morgan, Edwina Currie, Garry Bushell, Mr Motivator, Richard Clayderman, Gloria Hunniford, Jeremy Clarkson, Gary Olsen, Samantha Janus, Keith Harris and Orville, David Hasselhoff, Graham Cole, Anneka Rice, John Leslie, Paul McKenna, Annabel Giles, Nicola Stapleton, Bodger & Badger, Phillip Schofield, Andi Peters, The Chuckle Brothers, Robert Kilroy-Silk, John Virgo, Pat Sharp, Eamonn Holmes, Ulrika Jonsson, Ross King, Katie Boyle, Annabel Croft, Tony Blackburn, Bruno Brookes, Victor Kiam, Timmy Mallett and Liz Kershaw.", "In 1992, during series two of House Party, the character Mr Blobby was introduced as a way for Noel Edmonds to play practical jokes on celebrities. The success of the character resulted in a large amount of merchandise, public appearances and even theme parks based around the character. Mr Blobby was portrayed by Barry Killerby, except for a performance in November 1994, when, due to illness, Mr Blobby was portrayed by Kevin Hall, a performer from the Crinkley Bottom theme park in Morecambe."]}, {"page": "Dave Lee Travis", "response": ["In 1976, Travis took over the weekday teatime slot, 4:305:45pm (extended to run 4:307pm in 1977). He then took over The Radio 1 Breakfast Show from Noel Edmonds in May 1978 and continued in this slot until December 1980. He nicknamed himself \"the Hairy Cornflake\" during his time as the Radio 1 Breakfast Show host.", "From 1981 to 2001, Travis presented the BBC World Service music request programme A Jolly Good Show, having taken over from Noel Edmonds. In June 2011, Burmese pro-democracy leader Aung San Suu Kyi said the programme had given her a lifeline.  The Nobel Peace Prize winner, who had spent 15 years under house arrest from 1989, told the BBC that A Jolly Good Show had made her \"world much more complete\". Travis said he was \"touched\" but \"not surprised\" that she had remembered it."]}, {"page": "Smashie and Nicey", "response": ["They are parodies of a certain style of ageing celebrity BBC Radio 1 disc jockey who started out with the station in the 1960s and stayed there until the mid-1990s. The characters incorporated the personalities, character traits and lifestyles of several different real-life DJs. The characters reference such DJs as Tony Blackburn, Dave Lee Travis, Simon Bates, Alan Freeman, Mike Read, Peter Powell, Noel Edmonds and Jimmy Savile amongst others.", "Mike Smash, played by Whitehouse, was loosely based on Tony Blackburn, although he resembled Noel Edmonds and Mike Read in appearance, his vocalisation had similarities to Mike Read and pop star Cliff Richard. His DJ persona is shown as more lightweight and chirpy than Nice, although he is revealed as a troubled individual in private. The television special introduced elements of Noel Edmonds and Jimmy Savile into Smashie's character, with the Nice character played out similar stories to those from the lives of Mike Read, Bill Grundy and Kenny Everett. In the 1994 TV special, reflecting real events at Radio 1, the DJs were sacked from Fab FM, in a manner that deliberately mirrored Simon Bates' and Dave Lee Travis' departures from Radio 1, being replaced with young, \"irreverent\" DJs. They were banished to \"Radio Quiet\" and left to reminisce about the good old days and pretend to themselves that they were still a powerful cultural force. One notable catchphrase used by Smash was \"lodda work for charidee\" (although he doesn't like talking about it). He also describes things \"quite lidderally\" (literally) and as \"poptastic\", \"pop-a-doodle-doo\", \"popadopoulos\" and other words beginning with \"pop\", which Nicey will change to \"rock\"."]}, {"page": "Juke Box Jury", "response": ["The programme has been revived twice, first in 1979 with Noel Edmonds as presenter, and then with Jools Holland for two seasons in 1989/1990, ending on 25 November 1990.Holland, Jools and Vyner, Harriet – Barefaced Lies and Boogie-Woogie Boasts (Penguin UK, 2008)  Frequent jurors from the original run Katie Boyle & Lulu both returned for the Jools Holland era, which also included impressionist Steve Nallon on the panel impersonating the sitting Prime Minister Margaret Thatcher. The 1979 series was most notable for a panel containing Johnny Rotten (John Lydon), who gave a characteristically acerbic performance before walking out before the end of 30 June 1979 programme.Lydon's comment on the show was featured in the music press a few weeks later:  \"Cos it was a racket!\" he beams. \"Quite frankly, it's the most awful goddamn programme in the world, and it's about time someone said so!\" – 'JR wants you for a sunbeam' Record Mirror 28 July 1979", "* 26 September 1964 - Roy Castle, Pete Murray, Adrienne Posta and 'surprise guest' Sandie Shaw (This jury was reunited in 1983 for the BBC's The Time of Your Life hosted by Noel Edmonds, when Shaw was again a surprise for the three jurors who had just (accurately as it transpired) judged her single Wish I Was as a 'miss'.", "Hosted by Noel Edmonds. Each show featured a jury of four celebrities and one or two surprise guests whose records were judged by the jury."]}]}}