{"wiki_id": "http://www.wikidata.org/entity/Q1380938", "itemLabel": "Stephen Jones", "itemDescription": "Welsh rugby union footballer and coach", "wikipedia_url": "https://en.wikipedia.org/wiki/Stephen_Jones_(rugby_union)", "wikipedia_page": {"main": "Stephen Michael Jones (born 8 December 1977) is a Welsh rugby union coach and former player who played primarily at fly-half. He played more than 100 times for Wales and six times for the British & Irish Lions.\nJones was the record cap holder for Wales until he was overtaken by Gethin Jenkins on 15 March 2014. He remains as Wales most-capped back. With more than 900 points, Jones is sixth in the List of leading rugby union test point scorers, and the second-highest Wales player on the list behind Neil Jenkins.\nAt the end of the 2012–13 season, Jones retired from playing professional rugby to take up a coaching position at London Wasps and in August 2015 he joined the Scarlets as backs coach.\n\n", "link_mentions": [{"page": "Carmarthen", "response": ["*Stephen Jones (born 1977), Wales rugby captain"]}, {"page": "Wales national rugby union team", "response": ["Alun Wyn Jones is the nation's most capped player with 149 Welsh caps. Five other players have earned 100 caps or more: Gethin Jenkins, Stephen Jones, Gareth Thomas, Martyn Williams and George North. The record for most matches as captain is held by Alun Wyn Jones with 52. The record for the most consecutive appearances is held by Gareth Edwards who played all 53 of his matches for Wales consecutively between 1967 and 1978. Edwards is also Wales' youngest ever captain at the age of 20."]}, {"page": "2005 British & Irish Lions tour to New Zealand", "response": ["|Stephen Jones", "Three players did not travel to New Zealand with the bulk of the touring party. Jason Robinson was excused to spend time with his pregnant wife. Stephen Jones and Gareth Thomas were forced to delay their departures due to commitments to their French clubs. Jones arrived in New Zealand on 31 May, before the Lions played their first tour match, while Robinson arrived on 7 June. For a time, it was doubtful whether Thomas would be able to contend for a spot in the first Test, as he had not been released by his club, Toulouse. However, Toulouse lost in the Top 14 semi-finals, allowing Thomas to leave for New Zealand. Thomas also arrived in New Zealand on 7 June. Thomas later replaced Brian O'Driscoll as tour captain after O'Driscoll suffered a dislocated shoulder.", "Just before the break, Lions prop Andrew Sheridan was sin-binned for punching Māori fly-half Luke McAlister. When the sin-bin period ended, Sheridan was replaced by Gethin Jenkins. A McAlister penalty shortly afterwards, a Leon MacDonald try (converted by McAlister) and then a second McAlister penalty gave the Maori a 19–6 lead. The last 15 minutes were the Lions' best period, rewarded by a Brian O'Driscoll try, which was converted by Stephen Jones. The Lions threatened strongly, but the Māori, inspired by their replacement fly-half Carlos Spencer and stalwart captain Jono Gibbes held on for an historic 19–13 win – their first ever over the Lions.", "Following two early penalties by Stephen Jones, the Lions led 6–0 and things looked promising for them. All Black captain Tana Umaga was sin-binned for killing the ball, but even without their captain, the All Blacks managed to score two tries, by Conrad Smith and Ali Williams, both converted by Luke McAlister. The Lions were awarded two more penalties, which Stephen Jones kicked, but just before the break, Umaga scored a try to give the All Blacks a half-time lead of 24–12."]}, {"page": "Stephen Jones", "response": ["Stephen Jones may refer to:", "*Stephen Jones (milliner) (born 1957), British milliner", "*Stephen Jones (attorney) (born 1940), American attorney and activist", "*Stephen Jones (editor) (1763–1827), English magazine editor", "*Stephen Jones (musician) (born 1951), Australian music and video artist", "*Stephen Jones (author) (born 1953), British editor and author", "*Stephen Jones (Babybird) (born 1962), British musician and novelist", "*Stephen Jones (American football) (born 1964), American executive", "*Stephen Jones (Canadian football) (born 1960), Canadian football player", "*Stephen Jones (cricketer) (born 1955), South African cricketer", "*Stephen Jones (hurdler) (born 1978), Barbadian Olympic hurdler", "*Stephen Jones (journalist), British journalist", "*Stephen Jones (rower) (born 1993), New Zealand rower", "*Stephen Jones (rugby union) (born 1977), Welsh rugby union player", "*Stephen Jones (Australian politician) (born 1965), Australian politician", "*Stephen Jones (administrator) (born 1969), President of Bob Jones University", "*Stephen Jones (Wisconsin politician), American politician", "*Stephen Jones, defense attorney of Timothy McVeigh"]}, {"page": "Gareth Thomas (rugby)", "response": ["Gareth Thomas  (born 25 July 1974),Gareth Thomas retires from rugby, BBC Sport, 25 October 2011. Retrieved 6 January 2012 nicknamed \"Alfie\", is a Welsh former professional rugby union and rugby league player, who represented Wales in both sports. With 100 test match appearances he was the most capped Welsh rugby union player until he was overtaken by Stephen Jones in September 2011. He is currently ranked 14th among international try scorers, and is the third highest Wales try scorer behind Shane Williams & George North. He also won four rugby league caps for Wales, scoring three tries.", "Thomas was named as captain for Wales' final match in the 2007 Six Nations against England after current captain Stephen Jones was ruled out with a broken wrist. When Thomas took the field, he equalled Gareth Llewellyn's Wales record of 92 caps. He broke Llewellyn's record when he led Wales out against Australia at Telstra Stadium in Sydney on 26 May 2007, a match that Wales lost 29–23 on a Wallabies try after the siren."]}, {"page": "Gethin Jenkins", "response": ["He captained Wales in their last game of the 2013 six nations championship in Cardiff. Wales defeated England 30-3 to win the Championship. On 30 November 2013 versus Australia Jenkins became the most capped forward for Wales, surpassing Pontypridd and Cardiff team-mate Martyn Williams record of 100 caps. On 15 March 2014 versus Scotland he became the most capped player for Wales, overtaking the record of 104 caps held by Stephen Jones."]}, {"page": "Ryan Jones", "response": ["His father, Stephen Jones, was a police officer in the Gwent Constabulary, based in Cwmbran."]}, {"page": "Records and statistics of the Rugby World Cup", "response": ["| Stephen Jones ||  || style=\"text-align:center\"| 1999–2011"]}, {"page": "2007 Six Nations Championship", "response": ["|Stephen Jones", "|FH ||10||Stephen Jones", "|FH ||10||Stephen Jones"]}, {"page": "James Hook (rugby union)", "response": ["Hook made his home debut for Wales against Australia on 4 November 2006 as a substitute for the injured Stephen Jones. He showed great composure in scoring 13 points as Wales drew the match 29–29 and was named as Wales' Man of the Match. Hook played against the Pacific Islands, scoring a try, and against Canada where he scored 16 points.", "On 10 February 2008, Hook was selected at fly-half for the 30–15 win over Scotland in the 2008 Six Nations Championship. Hook scored a try and kicked two conversions and a penalty, before being replaced by Stephen Jones in the 58th minute. He was a member of the Wales side that completed the Grand Slam with victory against France."]}, {"page": "Steve Hansen", "response": ["| Stephen Jones"]}, {"page": "Duncan Jones (rugby union)", "response": ["In 2005–06, Jones started in all but one of Wales's Autumn Internationals (he missed the game against ) and in all their 2006 Six Nations Championship matches, following which he was chosen by new coach Gareth Jenkins to captain the side during a mid-year two-Test tour of Argentina. In October 2006, Jenkins appointed Stephen Jones to captain Wales through to the 2007 Rugby World Cup,", " but when Stephen Jones was rested for the Autumn International against the Pacific Islanders, Duncan Jones returned to captain Wales at home for the first time. He played, as starter or substitute, in all four Autumn Internationals and all five matches in the 2007 Six Nations Championship, but was rested for the mid-year tour to Australia."]}]}}