{"wiki_id": "http://www.wikidata.org/entity/Q1392544", "itemLabel": "William John Wills", "itemDescription": "Explorer of Australia", "wikipedia_url": "https://en.wikipedia.org/wiki/William_John_Wills", "wikipedia_page": {"main": "William John Wills (5 January 1834 – c. 28 June 1861) was a British surveyor who also trained as a surgeon. Wills achieved fame as the second-in-command of the ill-fated Burke and Wills expedition, which was the first expedition to cross Australia from south to north, finding a route across the continent from the settled areas of Victoria to the Gulf of Carpentaria.\n\n", "link_mentions": [{"page": "List of explorations", "response": ["| Robert O'Hara Burke and William John Wills"]}, {"page": "Totnes", "response": ["* The explorer William John Wills of Burke and Wills expedition fame was born in Totnes. A memorial to Wills was erected using money from public subscriptions in 1864. It can still be seen on the Plains. There were originally two gas lamps attached to the monument, but both have since been removed."]}, {"page": "Georg von Neumayer", "response": ["William John Wills, second-in-command of the Burke and Wills expedition succeeded J. W. Osborne as Neumayer's assistant at the Flagstaff Observatory until the expedition departed from Melbourne on 20 August 1860. Neumayer was a member of the Exploration Committee of the Royal Society of Victoria which organised the Expedition. Neumayer joined the Expedition at Swan Hill in order to conduct his magnetic observations. He remained with Burke and Wills as far as the Darling River at Bilbarka, before returning to the settled districts of Victoria."]}, {"page": "List of people on the postage stamps of Australia", "response": ["* William John Wills, explorer (1983, 2010)"]}, {"page": "Burke and Wills expedition", "response": ["The Burke and Wills expedition was organised by the Royal Society of Victoria in Australia in 1860–61. It consisted of 19 men led by Robert O'Hara Burke and William John Wills, with the objective of crossing Australia from Melbourne in the south, to the Gulf of Carpentaria in the north, a distance of around 3,250 kilometres (approximately 2,000 miles). At that time most of the inland of Australia had not been explored by non-Indigenous people and was largely unknown to the European settlers.", "The Exploration Committee called for offers of interest for a leader for the Victorian Exploring Expedition. Only two members of the Committee, Ferdinand von Mueller and Wilhelm Blandowski, had any experience in exploration but due to factionalism both were consistently outvoted. Several people were considered for the post of leader and the Society held a range of meetings in early 1860. Robert O'Hara Burke was selected by committee ballot as the leader, and William John Wills was recommended as surveyor, navigator and third-in-command. Burke had no experience in exploration and it is strange that he was chosen to lead the expedition. Burke was an Irish-born ex-officer with the Austrian army, and later became police superintendent with virtually no skills in bushcraft. Wills was more adept than Burke at living in the wilderness, but it was Burke's leadership that was especially detrimental to the mission.", "* William John Wills, the official date of death adopted by the Exploration Committee was Wednesday, 28 June 1861, but Wills probably died around Friday, 30 June or Saturday, 1 July 1861 at Breerily Waterhole, Cooper Creek.", "* The [Melbourne] Argus, 1861. \"The Burke and Wills exploring expedition: An account of the crossing the continent of Australia from Cooper Creek to Carpentaria, with biographical sketches of Robert O'Hara Burke and William John Wills.\" Melbourne: Wilson and Mackinnon.", "*Van der Kiste, John, 2011. William John Wills: Pioneer of the Australian outback. Stroud: History Press. .", "* Victoria: Parliament, 1862. Burke and Wills Commission. Report of the Commissioners appointed to enquire into and report upon the circumstances connected with the sufferings and death of Robert O'Hara Burke and William John Wills, the Victorian Explorers. Melbourne: John Ferres Government Printer. ", "* The Diary of William John Wills. The diary written by Wills while at the Cooper from 23 April 1861 to 28 June 1861, which is held at the National Library of Australia, Canberra.", "* The Diary of William John Wills. Images of the diary at the National Library of Australia."]}, {"page": "South Melbourne, Victoria", "response": ["*William John Wills (1834–1861), pioneering explorer-surveyor and eponymous member of 'the Burke and Wills expedition'\"Wills, William John (1834–1861)\" Australian Dictionary of Biography, Australian National University"]}, {"page": "List of people who died of starvation", "response": ["| William John Wills"]}, {"page": "Gulf of Carpentaria", "response": ["The first overland expedition to reach the Gulf was the Burke and Wills expedition, led by Robert O'Hara Burke and William John Wills which left Melbourne, Victoria in August 1860 and reached the mouth of the Bynoe River in February 1861."]}, {"page": "John Macadam", "response": ["In 1860–61, Robert O'Hara Burke and William John Wills led the expedition of 19 men with that intention, crossing Australia from Melbourne in the south, to the Gulf of Carpentaria in the north, a distance around 2,000 miles."]}, {"page": "State funeral", "response": ["State funerals are generally offered to former governors, premiers and other senior public officials. At the discretion of the premier, a state funeral can be offered to other prominent Victorians, for example broadcaster Peter Evans (1985), Australian Rules football player Ted Whitten (1995), race-car driver Peter Brock (2006), actor Charles 'Bud' Tingwell (2009), and former Australian Rules football player and charity worker Jim Stynes (2012). Explorers Robert O'Hara Burke and William John Wills received Victoria's first (and Australia's second) state funeral on 21 January 1863."]}, {"page": "National Library of Australia", "response": ["The Australian manuscript collections date from the period of maritime exploration and settlement in the 18th century until the present, with the greatest area of strength dating from the 1890s onwards. The collection includes a large number of outstanding single items, such as the 14th century Chertsey Cartulary, the journal of James Cook on HM Bark Endeavour, inscribed on the Memory of the World Register in 2001, the diaries of Robert O'Hara Burke and William John Wills from the Burke and Wills expedition, and Charles Kingsford Smith's and Charles Ulm's log of the Southern Cross."]}, {"page": "Divisions of the Australian House of Representatives", "response": ["|William John Wills"]}, {"page": "Carlton North, Victoria", "response": ["Melbourne General Cemetery is a large (43 hectare) necropolis which is notable for containing the graves of four Australian Prime Ministers: James Scullin, Sir Robert Menzies, Harold Holt and Sir John Gorton.https://www.findagrave.com/memorial/8535779| Retrieved 20 February 2010 Holt's stone is a memorial as his body was never recovered after he disappeared at sea. The tomb of famous Australian explorers Robert O'Hara Burke and William John Wills (see Burke and Wills expedition) is also located in the cemetery, with an inscription reading \"Comrades in a great achievement and companions in "]}, {"page": "Burke & Wills", "response": ["The film follows Robert O'Hara Burke and William John Wills in their crossing of Australia's interior in 1860–1. The film's account of the story changes the expedition's ending by having the explorers actually reach the northern coast. This upbeat idea was vehemently criticised by Australian reviewers. The film was released a week after the similarly themed comedy Wills & Burke.", "This film tells the story of Irish explorer Robert O'Hara Burke (Thompson) and British scientist William John Wills (Havers), both of whom set out to make the first maps of the interior region of the Australian continent in 1860. During their journey, they and their compatriots run low on food and suffer from heat exhaustion until there is only one survivor.", "*Nigel Havers as William John Wills"]}, {"page": "Flagstaff Gardens", "response": ["* 1857–1863 – A Magnetic Observatory and Weather Station was established by Georg von Neumayer on the hilltop. William John Wills worked here as an assistant before being appointed to the Burke and Wills expedition. The observatory moved to the Kings Domain when the Melbourne Observatory was established, as iron in the buildings surrounding Flagstaff Hill were affecting Neumayer's magnetic observations."]}, {"page": "Division of Wills", "response": ["The division was named after William John Wills of Burke and Wills fame. It was created in the 1949 redistribution."]}, {"page": "Flinders River", "response": ["Robert O'Hara Burke, William John Wills and Charles Gray reached the river delta in 1861, completing the goal of their expedition to cross the continent from south to north. Gray died on the journey back to Cooper Creek, and both Burke and Wills died after reaching the creek to find their depot abandoned."]}, {"page": "Robert O'Hara Burke", "response": ["In June 1860, Burke was appointed to lead the Victorian Exploring Expedition with William John Wills, his third-in-command, as surveyor and astronomical observer.", "* William John Wills", "*The [Melbourne] Argus, 1861. \"The Burke and Wills exploring expedition: An account of the crossing the continent of Australia from Cooper's Creek to Carpentaria, with biographical sketches of Robert O'Hara Burke and William John Wills\". Melbourne: Wilson and Mackinnon.", "*Victoria: Parliament, 1862. Burke and Wills Commission. Report of the Commissioners appointed to enquire into and report upon the circumstances connected with the sufferings and death of Robert O'Hara Burke and William John Wills, the Victorian Explorers. Melbourne: John Ferres Government Printer.", "*Wills, William John, & Wills, Dr William, 1863. A successful exploration through the interior of Australia, from Melbourne to the Gulf of Carpentaria: from the journals and letters of William John Wills. London: Richard Bentley."]}, {"page": "William Wills", "response": ["* William John Wills (1834–1861), English explorer and second-in-command of the Burke and Wills expedition"]}, {"page": "John King (explorer)", "response": ["Robert O'Hara Burke was appointed leader of the Victorian Exploring Expedition with Landells as second-in-command. William John Wills was surveyor and astronomical observer and King was appointed as one of the Expedition Assistants on a salary of £120 a year.", "*The [Melbourne] Argus, 1861. \"The Burke and Wills exploring expedition: An account of the crossing the continent of Australia from Cooper Creek to Carpentaria, with biographical sketches of Robert O'Hara Burke and William John Wills\". Melbourne: Wilson and Mackinnon.", "*Victoria: Parliament, 1862. Burke and Wills Commission. Report of the Commissioners appointed to enquire into and report upon the circumstances connected with the sufferings and death of Robert O'Hara Burke and William John Wills, the Victorian Explorers. Melbourne: John Ferres Government Printer.", "*Wills, William John, & Wills, Dr William, 1863. A successful exploration through the interior of Australia, from Melbourne to the Gulf of Carpentaria: from the journals and letters of William John Wills. London: Richard Bentley."]}, {"page": "Innamincka, South Australia", "response": ["The Victorian Contingent Party under Alfred Howitt was sent by the Victorian government to establish the fate of the expedition. Howitt found the remains of both leaders, Robert O'Hara Burke and William John Wills and buried them close to where the town is located today. He also found the sole survivor, John King living amongst and cared for by the Yawarrawarrka/Yandruwandha aboriginals, and returned him to Melbourne."]}, {"page": "Kym Gyngell", "response": ["In 1985, Gyngell starred in his first film Wills & Burke playing William John Wills. In 1988, he played Ian McKenzie in Boulevard of Broken Dreams, which earned him an AFI award for Best actor. In 1988, he appeared in Bachelor Girl (1988) and in Grievous Bodily Harm. In 1990, he was in What the Moon Saw, and starred in Heaven Tonight which earned him an AFI nomination.", "* Wills & Burke (1985) – William John Wills"]}, {"page": "Desert exploration", "response": ["** Burke and Wills (Robert O'Hara Burke and William John Wills) – south-north crossing of Australia 1860–1861 where both died on the return journey"]}, {"page": "Mount Hopeless (South Australia)", "response": ["Robert O'Hara Burke tried several times to reach this outpost in 1861 when he became stranded with William John Wills and John King on Cooper Creek but he failed and returned to Cooper Creek, where he and Wills died shortly after."]}, {"page": "Burketown", "response": ["Burketown, or \"Burke Town\", was named in honour of explorer Robert O'Hara Burke, who died shortly after making the first recorded successful south-north crossing of the continent in 1860-1. The first European settlers arrived in the local region not long after Burke and partner William John Wills' expedition. By the mid-1860s, several cattle stations - including Gregory Downs, Floraville, and Donors Hill - had been founded inland from the present site of Burketown. Burketown was formally established in 1865 by Robert Towns, chiefly to serve as a port and supply centre for his extensive properties in the Gulf country. Towns chartered a small vessel the Jacmel Packet and on 12 June 1865 it arrived off the mouth of the Albert River. The goods were eventually landed on the present site of Burketown. Towns, a prominent Sydney pastoralist and financier, also established Townsville in the same year."]}, {"page": "1834 in Australia", "response": ["*William John Wills"]}, {"page": "John McKinlay", "response": ["McKinlay was chosen by the South Australian House of Assembly in August 1861 to lead an expedition to search for the Burke and Wills expedition party, whose fate was unknown. McKinlay left Adelaide on 16 August 1861 with nine other men, 70 sheep, two packhorses and four camels. On 20 October 1861 the grave of a European, supposed to be Charles Gray, was found near Cooper Creek. However, after John King, the sole survivor of the Burke and Wills expedition, had recounted the events it was discovered that Charles Gray died north of Cooper Creek, near what is today known as Coongie Lake. The remains that McKinlay found are still unidentified to this day. McKinlay reported this to the government, and soon afterwards learned that the remains of Robert O'Hara Burke and William John Wills had also been found. McKinlay decided to explore in the direction of Central Mount Stuart, but was driven back by heavy rains and floods. McKinlay then decided to make for the Gulf of Carpentaria, hoping to find HMVS Victoria which had been sent to meet Burke's party. By 20 May 1862 the shore of the Gulf was thought to be only around five miles (8 km) away, but the intervening country was very difficult, and it was decided to turn east and make for Port Denison on the north Queensland coast. A station on the Bowen River near Port Denison was reached on 2 August 1862, and after resting a few days the expedition reached Port Denison. The party then returned by sea to Adelaide. McKinlay received a grant of £1000 from the government and a gold watch from the Royal Geographical Society of England."]}, {"page": "1861 in Australia", "response": ["* 28 June (estimated) – William John Wills (b. 1834) and Robert O'Hara Burke (b. 1821), explorers"]}, {"page": "Ipplepen", "response": ["*William John Wills (1834–1861) - explorer of Australia"]}, {"page": "List of people from Devon", "response": ["*William John Wills, explorer"]}, {"page": "Franklin's lost expedition", "response": ["Franklin had been Lieutenant-Governor of Van Diemen's Land (now Tasmania, Australia) from 1837 to 1843. The crew included two members with close family connections to explorers of Australia who later died on expedition. Commander Henry Le Vesconte was the first cousin of William John Wills, the co-leader of the 1861 Burke and Wills expedition, the first European to cross the Australian mainland from south to north; both Burke and Wills perished on the return journey.Wills Family History. Retrieved 6 June 2016BurkeandWills.net. Retrieved 6 June 2016 William Gibson, a steward on Terror, was the elder brother of Alfred Gibson, who disappeared on an 1874 expedition led by Ernest Giles to cross the deserts of Western Australia from east to west, and was honoured in the naming of the Gibson Desert.Arctic Website. Retrieved 6 June 2016William Battersby, James Fitzjames: The Mystery Man of the Franklin Expedition, p. 188. Retrieved 6 June 2016 Giles recorded the connection in his journal entry of 21 April 1873:"]}, {"page": "January 5", "response": ["*1834 – William John Wills, English surgeon and explorer (d. 1861)"]}, {"page": "Burke River (New Zealand)", "response": ["The river was named by Julius von Haast when he searched for a crossing from Otago to the West Coast. It is named for Robert O'Hara Burke of the Burke and Wills expedition. The nearby Wills River is named for William John Wills."]}, {"page": "Wills River", "response": ["The river was named by Julius von Haast when he searched for a crossing from Otago to the West Coast. It is named for William John Wills of the Burke and Wills expedition. The nearby Burke River is named for Robert O'Hara Burke."]}]}}