{"wiki_id": "http://www.wikidata.org/entity/Q1395145", "itemLabel": "Michelle Duncan", "itemDescription": "British actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Michelle_Duncan", "wikipedia_page": {"main": "Michelle Duncan (born 14 April 1978) is a Scottish actress, known for Driving Lessons (2006), Atonement (2007) and The Broken (2008). She portrayed Shelley Stern in the biographical drama film Bohemian Rhapsody (2018).", "link_mentions": [{"page": "Diana, Princess of Wales", "response": ["Actresses who have portrayed Diana include Serena Scott Thomas (in Diana: Her True Story, 1993), Julie Cox (in Princess in Love, 1996), Amy Seccombe (in Diana: A Tribute to the People's Princess, 1998), Michelle Duncan (in Whatever Love Means, 2005), Genevieve O'Reilly (in Diana: Last Days of a Princess, 2007), Nathalie Brocker (in The Murder of Princess Diana, 2007), Naomi Watts (in Diana, 2013), Jeanna de Waal (in Diana: The Musical, 2019 & 2021), Emma Corrin and Elizabeth Debicki (in The Crown, 2020 & 2022), and Kristen Stewart (in Spencer, 2021). In 2021, Corrin won a Golden Globe Award for her portrayal of the younger Diana Spencer."]}, {"page": "Driving Lessons", "response": ["* Michelle Duncan as Bryony"]}, {"page": "Romola Garai", "response": ["In 2012 she wrote and directed the short film Scrubber, casting Amanda Hale, Michelle Duncan, Honor Kneafsey and Steven Robertson. The film was shown at the Edinburgh film festival where it was nominated for Best British Short Film, at Sundance film festival where it was nominated for Best International Short Film, at London Short Film Festival where it won the Underwire Award for Best Female Character, and at Cannes where it screened in the Short Film Corner. The film was released as part of a short film collection, The Joy of Six, a Soda Pictures Release."]}, {"page": "Tooth and Claw (Doctor Who)", "response": ["Filming took place between 26 September and 27 October 2005. In the scene where the Doctor and Rose meet the Queen's guards, the Doctor slips into a Scottish accent, which is a reference to actor David Tennant's heritage. Michelle Duncan and Jamie Sives were unable to attend the readthrough for this story, and their parts were read by Tennant's parents, who happened to be visiting the Doctor Who set. Tennant told reporters at the series' press launch, \"Because it's set in Scotland they were delighted to be asked to read in. My mum played Lady Isobel and my dad played Captain Reynolds and they were in seventh heaven. And they were genuinely cheesed off when they didn't get asked to play the parts for real! I was like, 'Chill-out, Mum and Dad, back in your box!'\""]}, {"page": "Atonement (2007 film)", "response": ["* Michelle Duncan as Fiona Maguire, Briony's nursing friend at St Thomas' Hospital."]}, {"page": "Patricia Acevedo", "response": ["*Bryony (voiceover for Michelle Duncan) in Driving Lessons (2006)"]}, {"page": "List of American films of 2007", "response": ["| Atonement ‡ || Focus Features / StudioCanal / Relativity Media / Working Title Films || Joe Wright (director); Christopher Hampton (screenplay); James McAvoy, Keira Knightley, Saoirse Ronan, Romola Garai, Vanessa Redgrave, Brenda Blethyn, Juno Temple, Benedict Cumberbatch, Patrick Kennedy, Harriet Walter, Peter Wight, Daniel Mays, Nonso Anozie, Gina McKee, Jérémie Renier, Michelle Duncan, Alfie Allen, Anthony Minghella || Romance, War, Drama"]}, {"page": "List of Scottish actors", "response": ["*Michelle Duncan (born 1978)"]}, {"page": "Lost in Austen", "response": ["* Michelle Duncan as Charlotte Lucas"]}, {"page": "The Broken (film)", "response": ["*Michelle Duncan as Kate Coleman"]}, {"page": "Perth Academy", "response": ["* Michelle Duncan, actress"]}, {"page": "1978 in Scottish television", "response": ["*14 April - Michelle Duncan, actress"]}, {"page": "Whatever Love Means", "response": ["In 1971, Camilla Shand (Olivia Poulet) meets Charles, Prince of Wales (Laurence Fox) at a polo match. They get to know each other and begin dating. The relationship fizzles out when Charles travels overseas to join the Royal Navy in early 1973. Camilla immediately marries her ex-boyfriend Andrew Parker Bowles (Simon Wilson). Though Charles is hurt upon hearing about her marriage, they remain friends. Throughout their friendship Charles and Camilla hide their feelings for each other until 1979 when Lord Mountbatten (Richard Johnson) is murdered and Charles visits her more for emotional support. They re-ignite their romantic relationship during this period. Charles is now in his early 30s and his family and the British media begins calling him out to find a suitable bride. He meets Lady Diana Spencer (Michelle Duncan) who the media falls in love with and they eventually get engaged. Although everyone is happy Charles is about to settle down, Charles and Camilla are not due to their feelings for each other, however, they end their relationship. The story ends with Charles and Camilla getting ready for his wedding in 1981, both looking grim while dressing up for the occasion.", "* Michelle Duncan as Lady Diana Spencer"]}, {"page": "Hanna (TV series)", "response": ["* Michelle Duncan as False Marissa (season 1, 3)"]}, {"page": "Duncan, Michelle", "response": ["#redirectMichelle Duncan"]}, {"page": "Elizabeth Is Missing", "response": ["*Michelle Duncan as Mrs Palmer, Maud and Sukey's mother"]}]}}