{"wiki_id": "http://www.wikidata.org/entity/Q1392021", "itemLabel": "Timothy Mo", "itemDescription": "novelist", "wikipedia_url": "https://en.wikipedia.org/wiki/Timothy_Mo", "wikipedia_page": {"main": "Timothy Peter Mo (born 30 December 1950) is a British Asian novelist. Born to a British mother and a Hong Kong father, Mo lived in Hong Kong until the age of 10, when he moved to Britain. Educated at Mill Hill School and St John's College, Oxford, Mo worked as a journalist before becoming a novelist.His works have won the Geoffrey Faber Memorial Prize, the Hawthornden Prize, and the James Tait Black Memorial Prize (for fiction), and three of his novels were shortlisted for the Booker Prize for Fiction. Mo was also the recipient of the 1992 E. M. Forster Award. His novel An Insular Possession (1986) was among the contenders in The Telegraph's list of the 10 all-time greatest Asian novels.In the early 1990s Mo became increasingly mistrustful of his publishers and increasingly outspoken about the publishing industry in general. Since 1994 when he rejected a £125,000 advance from Random House for his next novel, he has self-published his books under the label \"Paddleless Press\". His first novel to be self-published was Brownout on Breadfruit Boulevard.", "link_mentions": [{"page": "December 30", "response": ["*1950 – Timothy Mo, Chinese-English author"]}, {"page": "List of winners and shortlisted authors of the Booker Prize", "response": ["|Timothy Mo || Sour Sweet  || Deutsch", "|Timothy Mo || An Insular Possession || Chatto & Windus", "|Timothy Mo || The Redundancy of Courage || Chatto & Windus", "*Timothy Mo"]}, {"page": "Congreve rocket", "response": ["* In Timothy Mo's novel about the foundation of Hong Kong, An Insular Possession, Congreve rockets are used by Captain Elliot from the steamer Nemesis against Chinese forts on the Pearl River."]}, {"page": "First Opium War", "response": ["* Timothy Mo, An Insular Possession (Chatto and Windus, 1986; Paddleless Press, 2002)"]}, {"page": "List of Chinese writers", "response": ["* Timothy Mo (born 1950)", "* Timothy Mo (born 1950)"]}, {"page": "1999 in literature", "response": ["*James Tait Black Memorial Prize for fiction: Timothy Mo, Renegade, or Halo2"]}, {"page": "1991 in literature", "response": ["*Timothy Mo – The Redundancy of Courage"]}, {"page": "1982 in literature", "response": ["*Timothy Mo – Sour Sweet"]}, {"page": "1978 in literature", "response": ["*Timothy Mo – The Monkey King"]}, {"page": "1950 in literature", "response": ["*December 30 – Timothy Mo, Hong Kong British novelist"]}, {"page": "List of historical novels", "response": ["*An Insular Possession by Timothy Mo (Canton, Macau, and Hong Kong) (1833-1841)"]}, {"page": "The Mauritius Command", "response": ["O'Brian's British fans include T. J. Binyon, Iris Murdoch, A. S. Byatt, Timothy Mo and the late Mary Renault, but, until recently, this splendid saga of two serving officers in the British Royal Navy during the Napoleonic Wars was unavailable in this country, apart from the first few installments which went immediately out of print. Last year, however, W. W. Norton decided to reissue the series in its entirety, and so far nine of the 14 have appeared here, including the most recent chapter, The Nutmeg of Consolation."]}, {"page": "The Nutmeg of Consolation", "response": ["O'Brian's British fans include T. J. Binyon, Iris Murdoch, A. S. Byatt, Timothy Mo and the late Mary Renault, but, until recently, this splendid saga of two serving officers in the British Royal Navy during the Napoleonic Wars was unavailable in this country, apart from the first few installments which went immediately out of print. Last year, however, W. W. Norton decided to reissue the series in its entirety, and so far nine of the 14 have appeared here, including the most recent chapter, The Nutmeg of Consolation."]}, {"page": "HMS Surprise (novel)", "response": ["O'Brian's British fans include T. J. Binyon, Iris Murdoch, A. S. Byatt, Timothy Mo and the late Mary Renault, but, until recently, this splendid saga of two serving officers in the British Royal Navy during the Napoleonic Wars was unavailable in this country, apart from the first few instalments which went immediately out of print. Last year, however, W. W. Norton decided to reissue the series in its entirety, and so far nine of the 14 have appeared here, including the most recent chapter, The Nutmeg of Consolation."]}, {"page": "Post Captain (novel)", "response": ["O'Brian's British fans include T. J. Binyon, Iris Murdoch, A. S. Byatt, Timothy Mo and the late Mary Renault, but, until recently, this splendid saga of two serving officers in the British Royal Navy during the Napoleonic Wars was unavailable in this country, apart from the first few installments which went immediately out of print. Last year, however, W. W. Norton decided to reissue the series in its entirety, and so far nine of the 14 have appeared here, including the most recent chapter, The Nutmeg of Consolation."]}, {"page": "Desolation Island (novel)", "response": ["O'Brian's British fans include T. J. Binyon, Iris Murdoch, A. S. Byatt, Timothy Mo and the late Mary Renault, but, until recently, this splendid saga of two serving officers in the British Royal Navy during the Napoleonic Wars was unavailable in this country, apart from the first few installments which went immediately out of print. Last year, however, W. W. Norton decided to reissue the series in its entirety, and so far nine of the 14 have appeared here, including the most recent chapter, The Nutmeg of Consolation."]}, {"page": "The Fortune of War", "response": ["O'Brian's British fans include T. J. Binyon, Iris Murdoch, A. S. Byatt, Timothy Mo and the late Mary Renault, but, until recently, this splendid saga of two serving officers in the British Royal Navy during the Napoleonic Wars was unavailable in this country, apart from the first few installments which went immediately out of print. Last year, however, W. W. Norton decided to reissue the series in its entirety, and so far nine of the 14 have appeared here, including the most recent chapter, The Nutmeg of Consolation."]}, {"page": "List of fictional countries", "response": ["| Based on East Timor, the setting of the novel by Timothy Mo."]}, {"page": "List of overseas Chinese", "response": ["*Timothy Mo, author, United Kingdom"]}, {"page": "TES (magazine)", "response": ["Staff journalists at TES have included Simon Jenkins, who became editor of the Evening Standard and The Times; novelist, literary historian, and biographer Valerie Grosvenor Myer; and Timothy Mo and Frances Hill, who both became novelists."]}, {"page": "James Tait Black Memorial Prize", "response": ["| 1999 || Timothy Mo, Renegade, or Halo2 || Kathryn Hughes, George Eliot: The Last Victorian (George Eliot) || "]}, {"page": "The Thirteen-Gun Salute", "response": ["O'Brian's British fans include T. J. Binyon, Iris Murdoch, A. S. Byatt, Timothy Mo and Mary Renault, but, until recently, this splendid saga of two serving officers in the British Royal Navy during the Napoleonic Wars was unavailable in this country, apart from the first few installments which went immediately out of print. Last year, however, W. W. Norton decided to reissue the series in its entirety,."]}, {"page": "Monkey (novel)", "response": ["Waley's translation was for many years the most popular version of Journey to the West in the English language and therefore cited by Western scholars of Chinese literature. Professor of Chinese literature David Lattimore described it as a \"minor landmark of 20th-century English translation\" but with the publication of Anthony C. Yu's four-volume, unabridged translation it must now \"relinquish its always slender claim to represent, with any degree of substantiality, the Chinese original\".  In 2000, Elaine Yee Lin Ho, in her study of the British writer Timothy Mo, says Monkey remains \"the most popular and textually accessible translation\" of Journey to the West.Elaine Yee Lin Ho, \"Timothy Mo\", (New York, NY:Manchester University Press, 2000), p. 154."]}, {"page": "The Redundancy of Courage", "response": ["The Redundancy of Courage is a novel by Timothy Mo published in 1991.  It is set in the fictitious country of Danu in Southeast Asia, which is based on East Timor.  It is narrated by Adolph Ng, an ethnic Chinese businessman educated in Canada.Ng, John Lanchester, London Review of Books, Vol. 13 No. 9, 9 May 1991  It was shortlisted for the Booker Prize for Fiction.", "Like East Timor, Danu is a former Portuguese colony north of Australia.Eugene Benson, Encyclopedia of Post-Colonial Literatures in English, Routledge, 2004, p. 1032. It is invaded and occupied by its giant neighbour, which is not named, but is based on Indonesia.  The people of the occupying country are referred to throughout the book as the malai.  This similar to malae, the word for foreigner in Tetum, East Timor's main language.  Danu is annexed by the malai and declared their 'fifty-eighth province',Timothy Mo,  The Redundancy of Courage, Vintage, 1992, p. 361. over which their green and white flag is raised.Mo,  The Redundancy of Courage, 1992, p. 343.", "Although the characters are fictional, they are closely based on people involved in events in East Timor during 1975.Timothy Mo's The Redundancy of Courage: An Outsider's View of Identity, The Journal of Commonwealth Literature, June 1, 1993, page 28 Osvaldo Oliveira, commander of the FAKINTIL guerilla army, is based on Nicolau Lobato, who became Prime Minister following the unilateral declaration of independence in 1975, and Xanana Gusmão, who later became the first President of East Timor in 2002.Tapol Bulletin, Issue 105, June 1991, p. 24. FAKOUM, the pro-independence party, is based on Fretilin.Susanne Hagemann, Terranglian territories: proceedings of the Seventh International Conference on the Literature of Region and Nation, Peter Lang, 2000, p. 547. FAKINTIL is similarly based on Falintil.Inside Indonesia: Bulletin of the Indonesia Resources and Information Programme (IRIP), Issues 22-33, 1990, p. 33.Frédéric Durand, Timor, 1250-2005: 750 ans de cartographie et de voyages, Arkuiris, 2006, p. 462.", "*Timothy Mo's The Redundancy of Courage, Meridian, BBC World Service, 25 April 1991"]}, {"page": "Hawthornden Prize", "response": ["* 1982\tTimothy Mo: Sour Sweet"]}, {"page": "Roger East (journalist)", "response": ["In Timothy Mo's novel The Redundancy of Courage, the character Bill Mabbely is based upon Roger East."]}, {"page": "Maurice Leitch", "response": ["While the novels are at the centre of Leitch's achievement, his work in broadcasting was significant, and contributed to his MBE. Among the dramas he produced were plays by James FollettJames Follett at dswilliams.co.uk and a dramatisation of Seán O'Casey's great autobiography, I Knock at the Door.I Knock at the Door, Radio 3, 1979, Radio Times A breadth of interest saw writers such as Vladimir Nabokov and B. Traven, Edna O'Brien, Carson McCullers, V. S. Naipaul, Katherine Mansfield and F. Scott Fitzgerald figure in the Book at Bedtime under his editorship, and he introduce new writers such as Timothy Mo – although after leaving the BBC he was to say: 'Most writers do all their serious reading before the age of thirty-five. After that I just read for purposes of research. Writing is hard enough as it is anyway, and enough to be going on with.'l Profile Books Q&A, 2013 Despite this he went on to produce over 30 readings of Terry Pratchett's Discworld novels, abridged for Corgi Audio with Tony Robinson as the reader."]}, {"page": "E. M. Forster Award", "response": ["*Timothy Mo 1992"]}, {"page": "Geoffrey Faber Memorial Prize", "response": ["| 1979 || Timothy Mo || The Monkey King || Fiction ||  ||Ray 2007, p. 373."]}, {"page": "List of fictional countries by region", "response": ["*Danu: setting of Timothy Mo's 1991 novel The Redundancy of Courage, based on East Timor"]}, {"page": "List of British Chinese people", "response": ["* Timothy Mo, British novelist"]}, {"page": "Eat a Bowl of Tea", "response": ["#By: Oakes, Pamela J. \"Filial Duty and Family Survival in Timothy Mo's The Monkey King and Sour Sweet.\" Bearing Dream, Shaping Visions: Asian Pacific American Perspectives. Ed. Linda A. Revilla, Gail M. Nomura, Shawn Wong and Shirley Hune. Pullman, WA: Washington State UP; 1993. pp. 141–52"]}, {"page": "List of British films of 1988", "response": ["|Soursweet||Mike Newell||Sylvia Chang, Danny Dun||Drama|| Based on Timothy Mo's novel Sour Sweet"]}, {"page": "List of media adaptations of Journey to the West", "response": ["* The Monkey King is the 1978 debut novel of British novelist Timothy Mo, whose protagonist mirrors the personality of Sun Wukong, the Monkey King."]}, {"page": "Sour Sweet", "response": ["Sour Sweet is a 1982 novel by Timothy Mo. Written as a 'sour sweet' comedy the story follows the tribulations of a Hong Kong Chinese immigrant and his initially reluctant wife as they attempt to make a home for themselves in 1960s London. It was awarded the Hawthornden Prize for 1982, and shortlisted for the Booker Prize for Fiction."]}, {"page": "Luís Cardoso", "response": ["* Timothy Mo's review of The Crossing in The Guardian"]}]}}