{"wiki_id": "http://www.wikidata.org/entity/Q1395948", "itemLabel": "Louisa Martin", "itemDescription": "Irish tennis player", "wikipedia_url": "https://en.wikipedia.org/wiki/Louisa_Martin", "wikipedia_page": {"main": "Mary Louisa \"Mollie\" Martin (3 September 1865 – 24 October 1941) was a tennis player from Ireland. She was considered the leading Irish female player of her time.\nMartin started playing tennis in 1885 and early on was successful at the tournaments in Bath and Buxton.  In 1898 she entered the Wimbledon Championships for the first time and, after two wins and two byes, reached the All-comers' final, but was beaten in two sets by Charlotte Cooper. She did not play Wimbledon in 1899 but the following year, 1900, she again reached the All-comer's final to face Cooper and was again defeated but managed to win the second set. Her third and final entry at Wimbledon, in 1901, also ended with a loss in the All-comers' final against Cooper, now playing under her married name Charlotte Sterry.Martin won nine singles titles at the Irish Lawn Tennis Championships between 1889 and 1903 and was a runner-up three times. She won six singles titles at the Northern Championships which was then held alternately in Liverpool and Manchester.With Sydney H. Smith she won two All England Championships mixed doubles titles.She was a member of the Fitzwilliam Lawn Tennis Club in Dublin, who staged the Irish Championships.", "link_mentions": [{"page": "Charlotte Cooper (tennis)", "response": ["| style=\"background:#98fb98;\"|Win ||1898 || Wimbledon (3)|| Grass ||  Louisa Martin || 6–4, 6–4"]}, {"page": "1898 in sports", "response": ["* Wimbledon Women's Singles Championship – Charlotte Cooper Sterry (GB) defeats Louisa Martin (GB) 6–4 6–4"]}, {"page": "Lottie Dod", "response": ["In 1886 Dod won the singles title at the West of England Championships in Bath where she defeated Watson in the final, ending the latter's run of 55 consecutive victories. That year she played tournaments in Liverpool (Northern), Cheltenham and Derbyshire but won no further singles titles. In 1887 Dod became an established first-class player, illustrated by the fact she partnered the then seven-time Wimbledon doubles winner Ernest Renshaw at the mixed doubles event of the Irish Championships. She won the singles in Dublin defeating Watson in the final in straight sets. She again won the singles title at the Northern, defeating leading players Louisa Martin, May Langrishe and Watson without losing a set and conceding no more than two games per set.", "After failing to do so in 1889, Dod was determined to win Wimbledon three times in a row, starting in 1891. Although it was her only competitive appearance of that season, she won her third Wimbledon title by defeating Hillyard (6–2, 6–1) in the final of the All-Comers tournament. The reigning champion Lena Rice did not defend her title. 1892 saw Dod's first singles defeat in an open tournament since 1886 when she lost to Louisa Martin of Ireland in the second round of the Irish Championships. It was the last of only five losses in her entire tennis career and her only defeat after the age of 15. She continued the year strongly, culminating in another easy straight-set Wimbledon victory over Hillyard. Dod's last tennis season as a competitive player was 1893, and she played in just two tournaments, The Northern in Manchester and Wimbledon, winning both. On both occasions, she defeated Blanche Hillyard in three sets, despite a heavy fall in the Wimbledon final. Her record of five Wimbledon titles would not last for long, as Hillyard, after losing in the final to Dod five times, won her sixth title in 1900. Suzanne Lenglen broke Dod's record of three consecutive singles wins by winning from 1919 to 1923."]}, {"page": "Dorothea Douglass Lambert Chambers", "response": ["In 1900 Douglass made her singles debut at Wimbledon and, after a bye in the first round, lost her second round match to Louisa Martin. Three years later, she won her first of seven ladies singles titles. On 6 April 1907 she married Robert Lambert Chambers and was thereafter known by her married surname Lambert Chambers."]}, {"page": "1898 Wimbledon Championships", "response": [" Charlotte Cooper defeated  Louisa Martin, 6–4, 6–4 "]}, {"page": "Bristol Open", "response": ["|1889 ||  Louisa Martin  ||  Florence Stanuell || 4–6, 6–1, 6–2", "|1890 ||  Louisa Martin  ||  N. Pope || 6–3, 8–6"]}, {"page": "List of British singles finalists at Grand Slam tennis tournaments", "response": ["| Louisa Martin || 1898 || || ||"]}, {"page": "Irish Open (tennis)", "response": ["|1885 ||  Maud Watson ||  Louisa Martin || 6–2, 4–6, 6–3", "|1886 ||  May Langrishe ||  Louisa Martin || 6–3, 6–4", "|1889 ||  Louisa Martin ||  Blanche Bingley Hillyard || 7–5, 6–0", "|1890 ||  Louisa Martin ||  Lena Rice || 9–7, 6–4", "|1891 ||  Louisa Martin ||  Florence Stanuell || 6–2, 5–7, 6–0", "|1892 ||  Louisa Martin ||  G. Crofton || 6–1, 6–0", "|1896 ||  Louisa Martin ||  Charlotte Cooper || 6–0, 3–6, 6–2", "|1898 ||  Charlotte Cooper ||  Louisa Martin || 6–4, 9–7", "|1899 ||  Louisa Martin ||  Ruth Dyas Durlacher || 6–1, 6–2", "|1900 ||  Louisa Martin ||   Charlotte Cooper || 2–6, 6–1, 6–2", "|1902 ||  Louisa Martin ||  Ruth Dyas Durlacher || 6–8, 6–4, 7–5", "|1903 ||  Louisa Martin ||  Maude Garfit || 6–2, 4–6, 6–1"]}, {"page": "Tennis tournament records and statistics", "response": ["| Louisa Martin"]}, {"page": "1898 Wimbledon Championships – Ladies' Singles", "response": ["Charlotte Cooper defeated Louisa Martin 6–4, 6–4 in the All Comers' Final to win the Ladies' Singles tennis title at the 1898 Wimbledon Championships. The reigning champion Blanche Hillyard did not defend her title.100 Years of Wimbledon by Lance Tingay, Guinness Superlatives Ltd. 1977"]}, {"page": "1900 Wimbledon Championships – Women's Singles", "response": ["Charlotte Cooper defeated Louisa Martin 8–6, 5–7, 6–1 in the All Comers' Final, but the reigning champion Blanche Hillyard defeated Cooper 4–6, 6–4, 6–4 in the Challenge Round to win the Ladies' Singles tennis title at the 1900 Wimbledon Championships.100 Years of Wimbledon by Lance Tingay, Guinness Superlatives Ltd. 1977 Marion Jones (USA) was the first female competitor from overseas."]}, {"page": "1901 Wimbledon Championships – Ladies' Singles", "response": ["Charlotte Sterry defeated Louisa Martin 6–3, 6–4 in the All Comers' Final, and then defeated the reigning champion Blanche Hillyard 6–2, 6–2 in the Challenge Round to win the Ladies' Singles tennis title at the 1901 Wimbledon Championships.100 Years of Wimbledon by Lance Tingay, Guinness Superlatives Ltd. 1977"]}, {"page": "Isabel Aboy", "response": ["Since then, she has devoted herself to her studies in psychology, a career in which she is licensed, as well as small modelling jobs until she got her first chance in theatre. She was in Médico de familia (Family Doctor) in 2004 through the efforts of one of her colleagues, Louisa Martin (remembered from the Juani series). Together they starred in Historia de una vida (Life Story)."]}, {"page": "Ruth Durlacher", "response": ["Durlacher came runner up four times within the women singles in the Irish Open (tennis) taking place is Fitzwilliam Lawn Tennis Club. In 1897, Blanche Bingley successfully beat Durlacher with the result ending in 7–5, 2–6, 6–3. Following two years’ time, Louisa Martin triumphally won the singles tournament 6-1, 6-2 against her opponent Durlacher. Again, two years preceding Muriel Robb came against Durlacher in the final with the result ending in her favour, 9-7, 6-1. Subsequently, Louisa Martin would reach Ruth Durlacher in the final yet again in 1902, with a second win under her, 6-8, 6-4, 7-5.", "Durlacher played at the Wimbledon Championships between 1897 and 1907. In 1899 she won the doubles tournament.Dorothea Chambers (1910): Lawn Tennis for Ladies. Methuen & Co. Ltd., London. (online) In singles, Durlacher reached the finals of the all-comers-competition, losing to the later champion Blanche Bingley. She won the Irish Championships mixed doubles title along with Harold Nisbet in 1898, and with Laurence Doherty 1901 and 1902. In the singles event, she was a runner-up in 1897, 1899, 1901 and 1902. In the 1902 final she was unable to convert a matchpoint against Louisa Martin."]}, {"page": "Mollie Martin", "response": ["#REDIRECt Louisa Martin"]}, {"page": "Tennis performance timeline comparison (women) (1884–1977)", "response": ["|align=\"left\"|  Louisa Martin"]}]}}