{"wiki_id": "http://www.wikidata.org/entity/Q1398003", "itemLabel": "Alex Jackson", "itemDescription": "footballer born in 1905", "wikipedia_url": "https://en.wikipedia.org/wiki/Alex_Jackson_(footballer,_born_1905)", "wikipedia_page": {"main": "Alexander Skinner Jackson (12 May 1905 – 15 November 1946) was a Scottish footballer who played for clubs including Dumbarton, Bethlehem Steel, Aberdeeen, Huddersfield Town, Chelsea and Nice; he won the English Football League title with Huddersfield in 1925–26. Jackson received 17 international caps for Scotland over a five-year period, and was a member of the 1928 team that became known as the 'Wembley Wizards' after defeating England 5–1 in London, scoring three of those goals.\n\n", "link_mentions": [{"page": "Huddersfield Town A.F.C.", "response": ["In March 1928, an international match between England and Scotland featured five Town players. Tom Wilson, Bob Kelly, Billy Smith, and Roy Goodall started for England; Alex Jackson played for Scotland. Jackson scored a hat-trick as Scotland, later nicknamed \"The Wembley Wizards\", defeated England 5–1.", "* Alex Jackson"]}, {"page": "British Home Championship", "response": ["|  Alex Jackson"]}, {"page": "Pittodrie Stadium", "response": ["Increasing popularity of the team and rising attendances led to major developments at Pittodrie in the 1920s. The club purchased the ground, which they had been leasing, with the final payment made on 1 December 1920. The Main Stand, where the club offices, dressing rooms and trophy room are located, was constructed in 1925. This was partly funded by the sale of Alex Jackson to Huddersfield Town. Also in the 1920s, the dugout was introduced to football by Aberdeen coach Donald Colman, who was interested in sitting lower to the pitch in order to inspect the players' footwork."]}, {"page": "Bethlehem Steel F.C. (1907–1930)", "response": ["Legendary Scottish football player Alex Jackson, played for Bethlehem Steel."]}, {"page": "Hughie Gallacher", "response": ["Gallacher joined David Calderhead's Chelsea as part of a £25,000 spending spree which also saw the club sign his fellow Scottish forwards Alex Jackson and Alec Cheyne; such was his popularity at Newcastle, when Chelsea visited St James' Park, the home of Newcastle United, that season the attendance was a record 68,386 with several thousand more locked out. Gallacher scored 81 goals in 144 games and was Chelsea's top scorer in each of his four seasons in west London. The team sometimes clicked, such as in a 6–2 win over Manchester United and a 5–0 win over Sunderland but trophies remained elusive."]}, {"page": "1925–26 in Scottish football", "response": ["|Alex Jackson"]}, {"page": "1926–27 in Scottish football", "response": ["|Alex Jackson (2), Hughie Gallacher "]}, {"page": "1927–28 in Scottish football", "response": ["|Alex Jackson (3), Alex James (2)"]}, {"page": "1928–29 in Scottish football", "response": ["|Hughie Gallacher (4), Alex Jackson (2), Alex James"]}, {"page": "Andrew Wilson (footballer, born 1896)", "response": ["He made 253 appearances for Chelsea and scored 52 goals in the next eight years. In that time he lined up beside compatriots such as Willie Ferguson, Tommy Law, Hughie Gallacher, Alex Jackson and Alec Cheyne."]}, {"page": "1931 FA Cup Final", "response": ["Chelsea provided stiffer opposition for the Birmingham team, a number of whose players were still recovering from influenza, on a St Andrew's pitch treacherous after overnight sleet. The visitors had much the better of the first half. Alex Jackson gave them the lead, and, in blizzard conditions, George Mills appeared to have scored in a goalmouth scramble, only for the goal to be disallowed after the Birmingham players drew the referee's attention to his linesman who had flagged for the ball having gone out of play. Six minutes into the second half, the lead had changed hands. First George Briggs crossed for a Bradford header, then the same pair combined for Curtis to put Birmingham ahead. Birmingham's defence held out until a misplaced clearance by Bob Gregg allowed Jackie Crawford to equalise. The replay at Chelsea's Stamford Bridge attracted a crowd of 74,365, then a ground record, with 6,000 locked out; spectators broke through the barriers and sat round the edge of the pitch. Briggs, in front of an empty goal,  allowed a centre from Curtis to pass between his legs – \"an amazing miss\" – before Chelsea centre-half John Townrow sustained an injury which forced him to leave the field. Chelsea reorganised their personnel, but early in the second half, right-half Sid Bishop was hurt twice in quick succession, leaving him in a worse condition than Townrow and his team short of numbers – no substitutes were permitted – with players in unaccustomed positions. Though they held out well, a goal from Jack Firth and two from Bradford, the second of which scored from an offside position, gave Birmingham a 3–0 victory."]}, {"page": "History of Aberdeen F.C.", "response": ["One of the Wembley Wizards, Scottish international Alex Jackson, played for Aberdeen from 1924 to 1925."]}, {"page": "Jackson (name)", "response": ["*Alex Jackson (footballer, born 1905) (died 1946), Scottish footballer"]}, {"page": "Scotland national football team results (1920–1939)", "response": ["|Alex Jackson", "|Hughie Gallacher, Alex Jackson (2)", "|Alex Jackson (2), Alex James (3)", "|Hughie Gallacher (4), Alex Jackson (2), Alex James"]}, {"page": "Timeline of Scottish football", "response": ["*Scotland defeat England 5–1 at Wembley, during which Alex Jackson scores the first ever hat-trick at Wembley. The Scotland team become popularly known as the Wembley Wizards."]}, {"page": "List of Huddersfield Town A.F.C. records and statistics", "response": ["|7||Alex Jackson||||70||19||0||0||89||1925–1930"]}, {"page": "List of Huddersfield Town A.F.C. seasons", "response": ["|align=left|Alex Jackson"]}, {"page": "List of England national football team hat-tricks", "response": ["England have conceded eleven hat-tricks since 1872, the most recent being scored by Zlatan Ibrahimović who scored four goals in a 4–2 defeat by Sweden in a friendly match in November 2012.  Richard Hofmann was the first player from outside the Home Nations to score a hat-trick against England, scoring three times for Germany in a friendly match in May 1930. Previously only the Scottish players John McDougall, George Ker, John Smith, Robert Smyth McColl and Alex Jackson had scored hat-tricks against England."]}, {"page": "1930–31 Huddersfield Town A.F.C. season", "response": ["Huddersfield Town's 1930–31 campaign was a season that saw Town start a revival in form, which saw them finish in the top 5 thanks primarily to the emergence of 2 new striking talents, Joe Robson, who was bought from Grimsby Town following Alex Jackson's departure to Chelsea and Town's own young prodigy Dave Mangnall. The season is also noted for Town's biggest ever win in a league match, 10–1 over Blackpool in December.", "The previous 2 seasons were only memorable for Town's 4th appearance in an FA Cup Final. Luckily, Clem Stephenson was on hand to turn the tide of failure back to success. There was a slight hiccup early on the season, when Alex Jackson left Leeds Road for Chelsea, just 4 games into the season. He had already scored 7 goals during the season including a hat-trick in his last match, a 6-0 win over Manchester United at Old Trafford.", "|Alex Jackson||||FW||4||7||0||0||4||7"]}, {"page": "1929–30 Huddersfield Town A.F.C. season", "response": ["The season is most noted for the team's FA Cup run, which saw the team reach their 4th final, mainly thanks to the 9 cup goals scored by Alex Jackson. Unfortunately, the final was against an Arsenal side led by Town's managerial legend Herbert Chapman. The Gunners beat the Terriers 2-0 at Wembley to win their first ever title. That wouldn't be the last title they would win under Chapman.", "|Alex Jackson||||FW||30||8||7||9||37||17"]}, {"page": "1928–29 Huddersfield Town A.F.C. season", "response": ["|Alex Jackson||||FW||35||14||6||5||41||19"]}, {"page": "1927–28 Huddersfield Town A.F.C. season", "response": ["|Alex Jackson||||FW||39||19||8||5||47||24"]}, {"page": "1926–27 Huddersfield Town A.F.C. season", "response": ["|Alex Jackson||||FW||32||6||1||0||33||6"]}, {"page": "1925–26 Huddersfield Town A.F.C. season", "response": ["Following the sudden resignation of Herbert Chapman, who joined Arsenal as their new manager, Town brought in Cecil Potter to steer the ship. Town continued their brilliant run of form with Charlie Wilson and George Brown being joined in the strikeforce department by Chapman's last signing Alex Jackson. Unfortunately injury cost Wilson his season and he moved to Stoke City by the end of the season. However, George Cook joined Jackson and Brown up front and between them scored 65 of Town's 92 league goals during the season.", "|Alex Jackson||||FW||39||16||2||0||41||16"]}, {"page": "List of Huddersfield Town A.F.C. players", "response": ["|Alex Jackson||||1925–1930||179||70||24||19||0||0||0||0||0||0||203||89"]}, {"page": "Bert Jepson", "response": ["Jepson was born in Glasshoughton, near Castleford in West Yorkshire and after leaving school worked in the coalmines, playing football with Frickley Colliery F.C. in the Midland League. He was a late-comer to professional football and it was just after his 25th birthday that he was taken on by Huddersfield Town in May 1927. At that time Huddersfield were one of the top English football clubs, having won the Football League for three consecutive seasons in the mid-1920s, finishing as runners-up in 1926–27. With Scottish international Alex Jackson well-established at No. 7, Jepson had to content himself with a year in the reserves as Huddersfield again finished the season as League runners-up, coupled with a trip to Wembley for the 1928 FA Cup Final, where they were defeated 3–1 by Blackburn Rovers."]}, {"page": "History of Huddersfield Town A.F.C.", "response": ["Cecil Potter was brought in as the successor of Chapman and highly rated Scottish winger Alex Jackson was bought (by Chapman days before he left for Arsenal) for a record £5,000. Injury to Wilson saw George Cook being placed up front with Brown and Jackson. The new front three scored more than two-thirds of Town's league goals during the season. Under Potter, Huddersfield completed a historical and a (to date) unbroken hat-trick of league titles. Runners-up were Chapman's Arsenal, as The Terriers finished 5 points clear of The Gunners.", "In March 1928, an international match between England and Scotland in the 1928 British Home Championship at Wembley featured five Town players. Tom Wilson, Bob Kelly, Billy Smith and Roy Goodall started for England, while Alex Jackson played for Scotland. Jackson scored a hat-trick as Scotland, nicknamed \"The Wembley Wizards\" after the match, trashed England 5–1."]}, {"page": "List of footballers killed during World War II", "response": ["* Alex Jackson – Scotland football international 1925–30. Played for Huddersfield Town (1925–1930) and Chelsea (1930–1932). He survived the war, but was killed in a road incident in Egypt on 15 November 1946 aged 41 while serving as a major in the Royal Pioneer Corps."]}, {"page": "Ashton National F.C.", "response": ["Although a non-league side, in 1932, Ashton National, funded by the National Gas and Oil Engine Company which was based in the town, signed Scotland international Alex Jackson from First Division Chelsea. His move to Ashton was based on the fact that while they could pay Jackson £15 a week, Chelsea as a Football League club were bound by rules of a maximum wage of £8 per week. Other notable players included former Port Vale and West Bromwich Albion forward Bobby Blood, former Chesterfield and later Manchester United forward Samuel Hopkinson, former Huddersfield Town and Birmingham City forward Ernie Islip, former Bolton Wanderers forward Jimmy Currier, former Brighton & Hove Albion and Swansea Town forward Jack Cheetham, and Fred Smith the former Stockport County player who later played for Darlington, Exeter City and Gillingham. Australian goalkeeper Walter Cornock also played for Ashton National, later playing in the Football League for Oldham Athletic and Rochdale and also playing county cricket for Leicestershire. George Capper, a Manchester United player in the Wartime League & a National Gas Employee played for Ashton National in the 1950s after serving five years in the Army ( personal testimony )."]}, {"page": "1924–25 Aberdeen F.C. season", "response": ["|align=left|Alex Jackson, Wattie Jackson (2, 1 pen))", "|align=left|Alex Jackson (2), Wattie Jackson (2)", "|align=left|Alex Jackson, Rankin", "|align=left|Alex Jackson (2), Smith", "|align=left|Alex Jackson, Bruce, Pirie", "|align=left|Alex Jackson, Smith"]}, {"page": "Alex Jackson", "response": ["*Alex Jackson (footballer, born 1905) (1905–1946), Scottish international footballer (Aberdeen, Huddersfield Town, Chelsea)", "*Alex Jackson (footballer, born 1935), Scottish footballer (Birmingham City)", "*Alex Jackson (baseball) (born 1995), baseball player"]}, {"page": "Alex Jackson (footballer born 1905)", "response": ["#REDIRECT Alex Jackson (footballer, born 1905)"]}, {"page": "1922–23 Dumbarton F.C. season", "response": ["|  Alex Jackson"]}, {"page": "1924–25 Dumbarton F.C. season", "response": ["|  Alex Jackson"]}, {"page": "Wandsworth Stadium", "response": ["The local Borough News reported that a former Chelsea player Alex Jackson had bought a greyhound called Jovial Honey and was keen for the Wandsworth management to consider allowing football to be played at the stadium. The stadium was reputed to have created dozens of jobs for Wandsworth residents during a difficult time that was known as the Great Depression in the United Kingdom."]}]}}