{"wiki_id": "http://www.wikidata.org/entity/Q1390350", "itemLabel": "John Balleny", "itemDescription": "British explorer", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Balleny", "wikipedia_page": {"main": "John Balleny (died 1857) was the English captain of the sealing schooner Eliza Scott, who led an exploration cruise for the English whaling firm Samuel Enderby & Sons to the Antarctic in 1838–1839. During the expedition of 1838–1839, Balleny, sailing in company with Thomas Freeman and HMS Sabrina, sailed into the Southern Ocean along a corridor of longitude centering on the line of 175°E., south of New Zealand.", "link_mentions": [{"page": "Balleny Islands", "response": ["The English sealing captains John Balleny and Thomas Freeman first sighted the group in 1839. Balleny named the island group after himself and the individual islands after the London merchants whose financial backing had made the expedition possible. Freeman was the first person to land on any of the islands on 9 February 1839, and this was the first human landfall south of the Antarctic Circle. "]}, {"page": "Brown Peak (Sturge Island)", "response": ["John Balleny discovered Brown Peak in February 1839, and named it for W. Brown, a merchant who provided financial support to the Enderby Brothers' expedition. In 1841, Captain James Clark Ross, who sighted the islands on his own expedition to Antarctica, gave it the name Russell Peak."]}, {"page": "Sturge Island", "response": ["The Balleny Islands were discovered by British mariner John Balleny in 1839. Sturge Island was named after Thomas Sturge, one of the London merchants who had financed Balleny's expedition."]}, {"page": "Île Amsterdam", "response": ["John Balleny in command of the exploration and sealing vessel Eliza Scott (154 tons) visited the island in November 1838 in search of seals. He returned with a few fish and reported having seen the remains of a hut and the carcass of a whale.Jones, A,G.E., “John Balleny and Amsterdam Island,” The Great Circle, 8 (2) October 1886, pp.73-4"]}, {"page": "Sabrina Island (Antarctica)", "response": ["Sabrina Island is the largest of three small islets lying  south of Buckle Island in the Balleny Islands of Antarctica. Sabrina Island was named after Thomas Freeman's cutter when John Balleny's squadron discovered the islands in 1839.  A pair of islets called The Monolith are located off of the island's southern tip."]}, {"page": "Sabrina Coast", "response": ["Sabrina Coast () is that portion of the coast of Wilkes Land, Antarctica, lying between Cape Waldron, at 115° 33' E, and Cape Southard, at 122° 05' E. John Balleny has long been credited with having seen land in March 1839 at about 117° E."]}, {"page": "List of Antarctic expeditions", "response": ["* 1838–1839 – John Balleny discovers Balleny Islands ()"]}, {"page": "Heroic Age of Antarctic Exploration", "response": ["Interest was renewed again between 1819 and 1843. As Europe settled after a period of war and unrest, explorers Fabian Gottlieb von Bellingshausen, John Biscoe, John Balleny, Charles Wilkes, Jules Dumont d'Urville, and James Clark Ross sought greater knowledge of the Antarctic regions. The primary goal of these explorers was to penetrate the vast barriers of sea ice that hid Antarctica proper, beginning with Bellingshausen and Mikhail Lazarev's circumnavigation of the region in 1819–1821, during which they became the first to sight and therefore officially discover mainland Antarctica, and culminating in Wilkes' discovery of Victoria Land and naming of the volcanoes now known as Mount Terror and Mount Erebus in 1840. Much early knowledge of the lands south of the Antarctic Circle was also derived from economic pursuits by sealers and whalers, including the probable first landing on mainland Antarctica by an American sealer in 1821, though whether this landing was truly the first is disputed by historians. These explorers, despite their impressive contributions to South Polar exploration, were nonetheless unable to penetrate the interior of the continent, and their discoveries instead formed a broken line of newly discovered lands along the coastline of Antarctica."]}, {"page": "Balleny", "response": ["* John Balleny (d. 1857), an English captain and explorer of the Antarctic"]}, {"page": "Samuel Enderby & Sons", "response": ["From 1838-1839, Captain John Balleny led another expedition to the Southern Ocean. Commanding the Eliza Scott, another whaling schooner, this expedition led to the discovery of the Balleny Islands."]}, {"page": "Charles Enderby", "response": ["Also in 1830, Charles became a founding member of the Royal Geographical Society (RGS). He served on the council of the RGS on several occasions between 1842 and 1847. Charles encouraged masters of Enderby vessels to report geographical discoveries and had notable successes with John Biscoe and John Balleny, who between them discovered Enderby Land, Graham Land, the Balleny Islands and the Sabrina Coast. Another Enderby captain, Abraham Bristow, discovered the Auckland Islands in 1806, naming one of the islands Enderby Island. In January, 1841 he was elected a Fellow of the Royal Society"]}, {"page": "Timeline of European exploration", "response": ["*1839 – John Balleny discovers the Balleny Islands and sights the Sabrina Coast (121° E)."]}, {"page": "Borradaile Island", "response": ["Borradaile Island was discovered in February 1839 by John Balleny, who named it for W. Borradaile, one of the merchants who united with Charles Enderby in sending out the expedition. The first landing on the island was by Captain Freeman of the cutter Sabrina on February 12, 1839, who landed briefly on a spit at the islands north-west corner. This was the first time a human set foot south of the Antarctic Circle. The island was not visited again until February 29, 1948, when a party of Australians, including Phillip Law and Stuart Campbell, landed at the same point from .", "Borradaile Island is about  long and  wide, lying  southeastward of Young Island. Cape Scoresby () is a high bluff marking the north end of Borradaile Island. It was charted by personnel on the RRS Discovery II who made running surveys of the northern portion of the Balleny Islands in 1936–1938. Cape Scoresby is named after the RSS William Scoresby, a companion research ship of Discovery II in carrying out oceanographic work in Antarctic waters at that time, which is in turn named after the Arctic explorer William Scoresby. Beale Pinnacle () is a boot-shaped rock pinnacle, 60 m high, lying close off Cape Beale, a steep bluff on the south-east side of the island. Both are named after W. Beale, another of the merchants who joined with Charles Enderby in sending out the John Balleny expedition of 1839."]}, {"page": "Eliza Cone", "response": ["Eliza Cone () is a rock with an archway through it standing  west of Cape McNab on the south end of Buckle Island, in the Balleny Islands. It is located adjacent to Scott Cone, the two features appear to have been named after John Balleny's schooner, the Eliza Scott, in which he discovered the Balleny Islands in February 1839."]}, {"page": "Cape McNab", "response": ["Cape McNab () is a cape,  high, which forms the south end of Buckle Island in the Balleny Islands of Antarctica. It was named for John McNab, second mate of the schooner Eliza Scott, who made a sketch of the Balleny Islands when they were discovered by John Balleny in 1839."]}, {"page": "Scott Cone", "response": ["Scott Cone () is a conical hill about 2 nautical miles (3.7 km) north-northeast of Cape McNab on the south end of Buckle Island, in the Balleny Islands. Located adjacent to Eliza Cone, the two features appear to have been named after John Balleny's schooner, the Eliza Scott, in which he discovered the Balleny Islands in February 1839."]}, {"page": "Row Island", "response": ["Row Island () is a small island, less than 1 nautical mile (1.9 km) in diameter, which lies just off the southeast end of Young Island in the Balleny Islands. John Balleny assigned the name in 1839 to an island which he reported to be 10 nautical miles (18 km) north of Young Island, naming it for J. Row, one of the merchants who united with Charles Enderby in sending out the expedition. Since the island reported by Balleny could not be found by other explorers in the vicinity, the name was assigned to this island discovered by the British ship Discovery II in 1936."]}, {"page": "Thomas Sturge", "response": ["thumb|left|The Balleny Islands from a NASA satellite, December 2007. Sturge Island is the lower of the three main islands. In 1838 Sturge joined a group of London shipowners to purchase two vessels, the schooner Eliza Scott (154 tons) and the cutter Sabrina (54 tons). These were sent to the Antarctic, under the overall command of Captain John Balleny, to search for undiscovered offshore islands that might host seal colonies that could be harvested.\"Discoveries in the Antarctic Ocean, in February 1839. Extracted from the Journal of the schooner Eliza Scott, commanded by Mr John Balleny, communicated by Charles Enderby, Esq., Journal of the Royal Geographical Society of London, 9 (1839) pp.526-7. Among the discoveries made was a cluster of five previously unknown islands. They were given the collective name of the  Balleny Islands with individual islands named after those who had funded the expedition. Sturge Island is 23 miles long and 6 miles wide and permanently covered in a mantle of snow and ice."]}, {"page": "Balleny, John", "response": ["#redirectJohn Balleny"]}]}}