{"wiki_id": "http://www.wikidata.org/entity/Q1396970", "itemLabel": "Marie Purvis", "itemDescription": "British cyclist", "wikipedia_url": "https://en.wikipedia.org/wiki/Marie_Purvis", "wikipedia_page": {"main": "Marie Purvis (born 24 September 1961), now known as Marie Morgan, is an English former racing cyclist who represented Great Britain at the 1992 and 1996 Summer Olympics. She won the British National Road Race Championships on five occasions.\nPurvis had excelled as a runner in her school years, scoring a top 15 finish in the English Schools National Cross-Country Championship, but gave up the sport after suffering a serious calf injury at the age of 19.She subsequently married John Purvis, a Manx cyclist who had finished fourth in the road race at the 1978 Commonwealth Games. Marie initially took up cycling at the age of 26 to improve her fitness, but soon progressed into competition, twice breaking the Isle of Man women's 10-mile time trial record in 1988. She was selected to represent the Isle of Man at the 1990 Commonwealth Games, and in the same year won her first British Road Racing title - she dominated the event in the first half of the 1990s, winning five out of six editions of the national championships from 1990 to 1995, taking her final title in 1995 on the Isle of Man. She finished fourth in the road race at the 1994 Commonwealth Games.She became the first British rider to win a stage of the modern Tour de France Féminin since its establishment in 1984 when she won a stage of the 1993 race, following it up with another stage win in the 1995 edition.Purvis set a new British hour record at Manchester Velodrome on 10 March 1995, beating Mandy Jones' previous mark set in 1981 by over two kilometres.She scored her best result at the Olympics in the 1996 Games road race, when she finished 11th. She retired from international competition the same year.In 2001, she returned to her roots in athletics when she won gold in the half-marathon at the 2001 Island Games.", "link_mentions": [{"page": "Great Britain at the 1992 Summer Olympics", "response": ["|Marie Purvis"]}, {"page": "Great Britain at the 1996 Summer Olympics", "response": ["*Marie Purvis"]}, {"page": "Cycling at the 1996 Summer Olympics – Women's individual road race", "response": ["|Marie Purvis"]}, {"page": "British National Road Race Championships", "response": ["| 1990 || Marie Purvis || Alison Butler || Maxine Johnson", "| 1991 || Marie Purvis || Clare Greenwood || Linda Gornall", "| 1992 || Marie Purvis || Sarah Phillips || Clare Greenwood", "| 1993 || Marie Purvis || Maxine Johnson || Sarah Phillips", "| 1995 || Marie Purvis || Ann Plant || Jenny Kershaw"]}, {"page": "Vaujany", "response": ["| Marie Purvis"]}, {"page": "1992 UCI Road World Championships – Women's team time trial", "response": ["|Marie PurvisLouise JonesSarah PhilipsSally Hodge"]}, {"page": "Marie Morgan", "response": ["#REDIRECT Marie Purvis"]}, {"page": "Peter Keen (cyclist)", "response": ["He was UK national track cycling coach from 1989 to 1992 and was Chris Boardman’s coach when he became Olympic champion in the individual pursuit at the 1992 Summer Olympics, Britain's first Olympic gold medal in cycling for 72 years. Keen continued to work with Boardman as he started his professional career on to the continent where Boardman would win the prologue at the Tour de France three times and broke the world hour record three times. Other riders he coached include Yvonne McGregor, who he guided to Olympic and World Championship medals as well as the world hour record, Caroline Alexander, who won a European Mountain Bike title, and Marie Purvis, who he coached to the British hour record."]}]}}