{"wiki_id": "http://www.wikidata.org/entity/Q139712", "itemLabel": "John Le Mesurier", "itemDescription": "English actor (1912-1983)", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Le_Mesurier", "wikipedia_page": {"main": "John Le Mesurier (, born John Elton Le Mesurier Halliley; 5 April 1912 – 15 November 1983) was an English actor. He is perhaps best remembered for his comedic role as Sergeant Arthur Wilson in the BBC television situation comedy Dad's Army (1968–1977). A self-confessed \"jobbing actor\", Le Mesurier appeared in more than 120 films across a range of genres, normally in smaller supporting parts.\nLe Mesurier became interested in the stage as a young adult and enrolled at the Fay Compton Studio of Dramatic Art in 1933. From there he took a position in repertory theatre and made his stage debut in September 1934 at the Palladium Theatre in Edinburgh in the J. B. Priestley play Dangerous Corner. He later accepted an offer to work with Alec Guinness in a John Gielgud production of Hamlet.\nHe first appeared on television in 1938 as Seigneur de Miolans in the BBC broadcast of The Marvellous History of St Bernard. During the Second World War Le Mesurier was posted to British India, as a captain with the Royal Tank Regiment. Following the war, he returned to acting and made his film debut in 1948, starring in the second feature comedy short Death in the Hand, opposite Esme Percy and Ernest Jay.\nLe Mesurier had a prolific film career, appearing mostly in comedies, usually in roles portraying figures of authority such as army officers, policemen and judges. As well as Hancock's Half Hour, Le Mesurier appeared in Tony Hancock's two principal films, The Rebel and The Punch and Judy Man. In 1971, Le Mesurier received his only award: a British Academy of Film and Television Arts \"Best Television Actor\" award for his lead performance in Dennis Potter's television play Traitor; it was one of his few lead roles.\nHe took a relaxed approach to acting and felt that his parts were those of \"a decent chap all at sea in a chaotic world not of his own making.\" Le Mesurier was married three times, most notably to the actress Hattie Jacques. A heavy drinker of alcohol for most of his life, Le Mesurier died in 1983, aged 71, from a stomach haemorrhage, brought about as a complication of cirrhosis of the liver. After his death, critics reflected that, for an actor who normally took minor roles, the viewing public were \"enormously fond of him\".", "link_mentions": {}}}