{"wiki_id": "http://www.wikidata.org/entity/Q1408121", "itemLabel": "Colin Pillinger", "itemDescription": "Professor of Planetary science (1943-2014)", "wikipedia_url": "https://en.wikipedia.org/wiki/Colin_Pillinger", "wikipedia_page": {"main": "Colin Trevor Pillinger,  (; 9 May 1943 – 7 May 2014) was an English planetary scientist. He was a founding member of the Planetary and Space Sciences Research Institute at Open University in Milton Keynes, he was also the principal investigator for the British Beagle 2 Mars lander project, and worked on a group of Martian meteorites.", "link_mentions": [{"page": "May 9", "response": ["*  1943   – Colin Pillinger, English astronomer, chemist, and academic (d. 2014)"]}, {"page": "May 7", "response": ["*  2014   – Colin Pillinger, English astronomer, chemist, and academic (b. 1943)"]}, {"page": "Mars Society", "response": ["The Mars Society UK is the oldest Mars Society outside the United States. It held its first public meeting on July 4, 1998, in London. Professor Colin Pillinger, head of the Beagle 2 project, was the Guest Speaker, and the event marked the first time Beagle 2 had been presented to the general public in the UK. From 1998 through to 2003, the Mars society UK (MSUK) continued to support Beagle 2, providing numerous public events at which members of the Beagle 2 project team could speak, and the Beagle 2 model be displayed."]}, {"page": "Bristol", "response": ["The city has produced a number of scientists, including 19th-century chemist Humphry Davy (who worked in Hotwells). Physicist Paul Dirac (from Bishopston) received the 1933 Nobel Prize for his contributions to quantum mechanics. Cecil Frank Powell was the Melvill Wills Professor of Physics at the University of Bristol when he received the 1950 Nobel Prize for, among other discoveries, his photographic method of studying nuclear processes. Colin Pillinger was the planetary scientist behind the Beagle 2 project, and neuropsychologist Richard Gregory founded the Exploratory (a hands-on science centre which was the predecessor of At-Bristol/We The Curious)."]}, {"page": "Martian meteorite", "response": ["* Colin Pillinger "]}, {"page": "Open University", "response": ["File:Colin Pillinger.jpg|Colin Pillinger was a founding member of the Planetary and Space Sciences Research Institute at OU.", "* Colin Pillinger – planetary scientist"]}, {"page": "Journey into Space", "response": ["Fans of Journey Into Space included Colin Pillinger,"]}, {"page": "The Sky at Night", "response": ["Many of the world's leading astronomers have appeared on the show through the years, including Harlow Shapley (the first to measure the size of the Milky Way galaxy), Fred Hoyle, Carl Sagan, Jocelyn Bell Burnell, Samuel Tolansky, Harold Spencer Jones, Martin Ryle, Richard Ellis, Carlos Frenk and Bart Bok. Other guests have included Arthur C. Clarke, Astronomer Royal Sir Martin Rees, Arnold Wolfendale, Allan Chapman, Sir Bernard Lovell, Michael Bentine, Wernher von Braun and Open University professors John Zarnecki, Monica Grady, Edwin Maher and Colin Pillinger."]}, {"page": "Beagle 2", "response": ["The Beagle 2 was conceived by a group of British academics headed by Professor Colin Pillinger of the Open University in collaboration with the University of Leicester. The project was designed and developed by several U.K. academics and companies. The spacecraft's name reflected its goal of searching for signs of past or present life on Mars, as explained by Pillinger:", "The Principal Investigator, Colin Pillinger, set up a consortium to design and build the Beagle 2. The principal members and their initial responsibilities were:", "Pillinger speculatedPrivate conversation with Colin Pillinger, 2007. that higher than expected levels of dust in the Martian atmosphere, which captures heat, caused it to expand and reduce in density, so that the parachutes were not able to slow the probe sufficiently. This would cause the landing to be too hard, damaging or destroying the probe. A number of other failure hypotheses were produced at the time. If the Martian atmosphere was thinner than expected, that would have reduced the parachute's effectiveness and therefore caused the lander to \"plummet\" and hit the surface with enough speed to destroy it. Turbulence in the atmosphere, which would affect the parachute, was also examined.", "The location of Beagle 2 on Mars was unknown from late 2003 to early 2015. On 16 January 2015, more than eleven years after its loss and eight months after its pioneer Colin Pillinger died, news sources confirmed that the lander had been located intact on the surface of Mars by NASA's Mars Reconnaissance Orbiter, lying on the surface of Isidis Planitia at , about 5 km from the planned center of its landing zone."]}, {"page": "Swansea University", "response": ["* Colin Pillinger CBE, planetary scientist"]}, {"page": "1943 in science", "response": ["* May 9 – Colin Pillinger (died 2014), English astrophysicist."]}, {"page": "Beagle 3", "response": ["Beagle 3Scientists lift veil on Beagle 3Beagle 3 To The Moon? No Chance. (also called Beagle 2: Evolution) was a proposed Mars lander mission to search for life on Mars, past or present. Beagle 3 was the proposed successor to the failed British Beagle 2 Mars lander, with which communication was lost. Beagle 3 was promoted by Professor Colin Pillinger, lead scientist on the Beagle 2. EADS Astrium also played a part in funding and early development of the project. Pillinger dreamed of launching up to two landing craft from an orbiter in 2009 as part of the European Space Agency's Aurora Programme.  The putative Beagle 3 would be named after the ship HMS Beagle that took Charles Darwin around the world."]}, {"page": "Department of Earth Sciences, University of Cambridge", "response": ["* Colin Pillinger FRS CBE"]}, {"page": "Gresham Professor of Astronomy", "response": ["|  32 ||Colin Pillinger FRS ||1 September 1996"]}, {"page": "British Rail flying saucer", "response": ["When the patent was rediscovered in 2006, it gained widespread publicity in the British press.  A group of nuclear scientists examined the designs and declared them to be unworkable, expensive and very inefficient. Michel van Baal of the European Space Agency claimed \"I have had a look at the plans, and they don't look very serious to me at all\", adding that many of the technologies used in the craft, such as nuclear fusion and high temperature superconductors, had not yet been discovered, while Colin Pillinger, the scientist in charge of the Beagle 2 probe, was quoted as saying \"If I hadn't seen the documents I wouldn't have believed it\"."]}, {"page": "Sir Arthur Clarke Award", "response": ["| Lifetime Achievement || Colin Pillinger, Open University", "| Outreach Award for the Public Promotion of Space || Colin Pillinger"]}, {"page": "Monica Grady", "response": ["Grady graduated from the University of Durham in 1979, where she was a student at St Aidan's College then went on to complete a PhD on carbon in stony meteorites at Darwin College, Cambridge in 1982 where she studied under Professor Colin Pillinger and also met her husband."]}, {"page": "Education in Bristol", "response": [" Cecil Frank Powell was the Melvill Wills Professor of Physics at the University of Bristol when he received the 1950 Nobel Prize for, among other discoveries, his photographic method of studying nuclear processes. Colin Pillinger"]}, {"page": "Cheltenham Festivals", "response": ["The festival has many free activities for adults and children, including the Discover Zone in Town Hall which is full of hands-on activities. The excellent education programme includes a series of free Christmas lectures for local schools.  Guests in previous years have included Robert Winston, Richard Dawkins, Steve Backshall, Brian Cox, Richard Hammond, Tony Robinson, Jonathon Porritt, Kevin Conrad, Colin Pillinger and Adam Hart-Davis, Peter Higgs and James Watson."]}, {"page": "Mars landing", "response": ["The orbiter entered Mars orbit on 25 December 2003, and Beagle 2 should have entered Mars' atmosphere the same day. However, attempts to contact the lander failed. Communications attempts continued throughout January, but Beagle 2 was declared lost in mid-February, and a joint inquiry was launched by the UK and ESA that blamed principal investigator Colin Pillinger's poor project management. Nevertheless, Mars Express Orbiter confirmed the presence of water ice and carbon dioxide ice at the planet's south pole. NASA had previously confirmed their presence at the north pole of Mars."]}, {"page": "Colin (given name)", "response": ["*Colin Pillinger, British planetary scientist"]}, {"page": "Odyssey Moon", "response": ["Colin Pillinger, a scientist with a background in studying meteorites, led the European Space Agency's failed Beagle 2 Mars lander project in 2003. In 2009 he was in discussion with Odyssey Moon regarding the use of an identical version of Beagle's most powerful instrument on their lander."]}]}}