{"wiki_id": "http://www.wikidata.org/entity/Q14190168", "itemLabel": "Josef Locke", "itemDescription": "Irish singer", "wikipedia_url": "https://en.wikipedia.org/wiki/Josef_Locke", "wikipedia_page": {"main": "Joseph McLaughlin (23 March 1917 – 15 October 1999), known professionally as Josef Locke, was an Irish tenor. He was successful in the United Kingdom and Ireland in the 1940s and 1950s.\n\n", "link_mentions": [{"page": "October 15", "response": ["*1999 – Josef Locke, British-Irish soldier, policeman, tenor and actor (b. 1917)"]}, {"page": "List of Irish people", "response": ["* Josef Locke – singer"]}, {"page": "1999 in music", "response": ["*October 15 – Josef Locke (82), Irish tenor"]}, {"page": "1917 in music", "response": ["**Josef Locke, tenor (d. 1999)"]}, {"page": "Music of Ireland", "response": ["Performers of note in classical music include Catherine Hayes (1818–1861), Ireland's first great international prima donna and the first Irish woman to perform at La Scala in Milan; tenor Barton McGuckin (1852–1913), a much-demanded singer in the late 19th century; tenor Joseph O'Mara (1864–1927), a very prominent singer around the turn of the century; tenor John McCormack (1884–1945), the most celebrated tenor of his day; opera singer Margaret Burke-Sheridan (1889–1958); pianist Charles Lynch (1906–1984); tenor Josef Locke (1917–1999) achieved global success and was the subject of the 1991 film Hear My Song; the concert flautist Sir James Galway and pianist Barry Douglas.Niall O'Loughlin/Richard Wigmore, 'Galway, Sir James', Grove Music Online, . Retrieved 12 August 2007. Douglas achieved fame in 1986 by claiming the International Tchaikovsky Competition gold medal. Mezzo-sopranos Bernadette Greevy and Ann Murray have also had success internationally.\"A Remarkable Voice of Remarkable Longevity\", in: The Irish Times, 30 September 2008."]}, {"page": "Harry Graham (poet)", "response": ["His best known lyrics were \"You are my heart's delight\", his English version of \"Dein ist mein ganzes Herz\", from The Land of Smiles, composed by Franz Lehár (and made famous by the popular tenor Richard Tauber), and \"Goodbye\", from his English adaptation of The White Horse Inn (originally \"Adieu, mein kleiner Gardeoffizier\" from Robert Stolz's operetta Die lustigen Weiber von Wien, a song which later achieved great popularity as sung by Josef Locke)."]}, {"page": "Ned Beatty", "response": ["Entering the 1990s, Beatty gained his third nomination for an Emmy Award for Outstanding Supporting Actor in a Miniseries or a Special category for Last Train Home (1990). A year later, he appeared in the British film Hear My Song (1991), in which he portrayed tenor Josef Locke, for which he was nominated for a Golden Globe Award for Best Supporting Actor – Motion Picture.", "| Josef Locke", "During his career, Beatty got his first nomination for an Academy Award in Best Supporting Actor category for Network (1976), portraying Arthur Jensen. His second nomination, an Emmy Award, came for Friendly Fire (1979) in 'Outstanding Lead Actor in a Miniseries or a Special' category and the third nomination is another Emmy Award for 'Outstanding Supporting Actor in a Miniseries or a Special' category for Last Train Home (1990). He got the fourth major award nomination for a Golden Globe Award in category Best Supporting Actor – Motion Picture for Hear My Song (1990), portraying the Irish tenor Josef Locke and his fifth nomination for a MTV Movie Award in Best Villain category in the voice of antagonist Lots-O'-Huggin' Bear in Toy Story 3 (2010)."]}, {"page": "Kilcock", "response": ["The town's library features mementos of the poet Teresa Brayton who was born in Kilbrook. The Old Bog Road, 4.5 km west of the town, was the subject of her most successful verse. It was set to music by Madeline King O'Farrelly and recorded by Eileen Donaghy, Josef Locke, Johnny McEvoy, Hank Locklin, Finbar Furey, Anthony Kearns, Daniel O'Donnell, Finbar Wright and many other artists up to the present day."]}, {"page": "1999 in Ireland", "response": [":15 October – Josef Locke, tenor (b. 1917)"]}, {"page": "1917 in Ireland", "response": ["*23 March – Josef Locke, born Joseph McLaughlin, tenor (died 1999)."]}, {"page": "1999 in British music", "response": ["*15 October – Josef Locke, tenor, 82"]}, {"page": "Norman Newell", "response": ["Newell joined EMI's Columbia label as a staff producer in 1949, and was head of the label for its most successful years. During this period, he produced records by Petula Clark, the French male voice choir Les Compagnons de la Chanson, Josef Locke, Ronnie Ronalde, The Beverley Sisters, Dorothy Squires and the bandleader Victor Silvester. He also discovered the singer Steve Conway, who recorded Newell's \"My Thanks To You\" (with music by Noel Gay)."]}, {"page": "Mancunian Films", "response": ["Escalating costs and a desire to cater for the robust tastes of northern industrial audiences led to the establishment of the two-stage facility in a former Methodist Chapel on Dickenson Road, Rusholme, the only film studio outside the South East. The buildings were converted at a cost of £70,000 in 1947. Starting with Cup-tie Honeymoon (1948) starring Sandy Powell, over the next six years the films went on to feature northern favourites Frank Randle, Josef Locke, Diana Dors, and Jimmy Clitheroe. The studio, though it often worked on a shoestring, was successful and profitable but Blakely decided to retire when he reached 65."]}, {"page": "Cara Mia", "response": ["*Josef Locke"]}, {"page": "Kilcoole", "response": ["* Josef Locke, tenor singer, lived at Calary House on Sea Road. "]}, {"page": "Frank Patterson", "response": ["Frank Patterson (5 October 1938 – 10 June 2000) was an internationally renowned Irish tenor following in the tradition of singers such as Count John McCormack and Josef Locke. He was known as \"Ireland's Golden Tenor\"."]}, {"page": "Edenderry", "response": ["* Josef Locke, entertainer"]}, {"page": "Hear My Song", "response": ["Hear My Song is a 1991 comedy film written by the actors Peter Chelsom (who also directed) and Adrian Dunbar (who plays the lead) based on the story of Irish tenor Josef Locke. It was nominated for Best Original Screenplay at the 1993 BAFTA awards.", "The story follows Micky O'Neill (Dunbar) as he tries to revive the fortunes of his Liverpool nightclub by promising his patrons he will present a performance by the legendary Irish tenor Josef Locke. After a series of unfortunate bookings (including Franc Cinatra, a Sinatra impersonator), Micky books the mysterious Mr. X, a man who insists he cannot be booked as Joe Locke due to the legal issues that would invariably ensue. The elusive Locke left England during the 1950s to avoid paying taxes, leaving behind \"a beauty queen, a Jaguar sportscar, and a pedigree dalmatian, all of them pining.\" O'Neill's personal and professional life are left in ruin after the beauty queen, Kathleen Doyle, exposes his Mr. X as a fraud. O'Neill returns to Ireland to find the true Josef Locke and bring him back."]}, {"page": "Clane", "response": ["* Josef Locke, tenor"]}, {"page": "William Hootkins", "response": ["Hootkins appeared in many roles that made him a welcome figure at fan conventions, particularly for Star Wars in his role of Jek Tono Porkins. He also appeared in significant parts in films such as Hardware (1990), Like Father, Like Santa (as Santa Claus), and Hear My Song (1991), where he was the Mr. X who was presumed to be the Irish tenor Josef Locke under a false name. He portrayed Fatty Arbuckle in Ken Russell's infamous 1977 flop Valentino, and played Hans Zarkov's assistant in the 1980 Flash Gordon. He also made appearances in such films as Raiders of the Lost Ark and Tim Burton's Batman (the latter as Lt. Eckhardt)."]}, {"page": "When You Were Sweet Sixteen", "response": ["*Josef Locke (April 16, 1948, UK Columbia D.B. 2409)"]}, {"page": "I'll Take You Home Again, Kathleen", "response": ["*Irish tenor Josef Locke recorded a version around the late 1940s."]}, {"page": "Vernon Midgley", "response": ["For some considerable time in the early 1960s he played Freddie in the stage production of My Fair Lady at Drury Lane. In the United States, he is perhaps best known as the singing voice of Josef Locke, who was played by Ned Beatty in the film Hear My Song.Gritten (5 March 1992)"]}, {"page": "Charmaine (song)", "response": ["*Josef Locke"]}, {"page": "RT- The Life and Music of Richard Thompson", "response": ["# \"Josef Locke\""]}, {"page": "1999 in the United Kingdom", "response": ["* 15 October – Josef Locke, tenor (born 1917 in Northern Ireland); died in Ireland"]}, {"page": "While the Angelus Was Ringing", "response": ["*Josef Locke"]}, {"page": "Joseph Locke (disambiguation)", "response": ["* Josef Locke (1917–1999), Irish popular singer of the 1940s and 1950s"]}, {"page": "Ronnie Ronalde", "response": ["Across this decade Ronalde was a headliner, and broke box office records all over the world: he was a big name in the UK, US, Australasia, Scandinavia, Africa, South America and Europe. Such was his success in the US in the 1950s, he was seen as serious competition to Frank Sinatra and Bing Crosby, and others such as Richard Tauber and Josef Locke."]}, {"page": "List of films based on actual events", "response": ["* Hear My Song (1991) – comedy film based on the story of Irish tenor Josef Locke"]}, {"page": "Galway Bay (song)", "response": ["* Josef Locke"]}, {"page": "1917 in the United Kingdom", "response": ["** Josef Locke, born Joseph McLaughlin, Irish tenor (died 1999)"]}, {"page": "1999 in Northern Ireland", "response": ["*15 October - Josef Locke, tenor (b.1917)."]}, {"page": "Palestine Police Force", "response": ["*Josef Locke, Sergeant.Derek B. Scott, ‘Locke, Josef (1917–1999)’, Oxford Dictionary of National Biography, Oxford University Press, 2004 accessed 29 May 2007"]}, {"page": "List of films and television shows set or shot in Liverpool", "response": ["|Drama based on the life of tenor Josef Locke. Partially set and filmed in Liverpool."]}, {"page": "Bless This House (song)", "response": ["Other singers to record it include Gracie Fields, Peter Dawson, Jan Peerce, Beniamino Gigli, Josef Locke, Benjamin Luxon, Leontyne Price, Steve Conway, Harry Secombe (for his album Sacred Songs), Rosemary Clooney, Lesley Garrett and Bryn Terfel."]}, {"page": "Joseph McLaughlin", "response": ["* Joseph McLaughlin (1922–1999), Irish tenor better known as Josef Locke"]}, {"page": "List of British films of 1991", "response": ["|Hear My Song||Peter Chelsom ||Adrian Dunbar, Tara Fitzgerald, Ned Beatty ||Drama/comedy ||Based on the story of the Irish tenor Josef Locke"]}, {"page": "Locke (surname)", "response": ["*Josef Locke (1917–1999), an Irish tenor"]}, {"page": "Next Door's Baby", "response": ["It is Thursday afternoon. The play opens with a Josef Locke record playing on the wireless as Mrs O'Brien enters her kitchen and turns the radio off abruptly. As she makes pastry she sings about the rigours of being sole head of the house. (HOLD IT ALL TOGETHER) During the song, her children - Larry, Sheila, Dickie, Orla and Conor - enter boisterously. At the end of the number, they are seated, ready for dinner. They disapprovingly discuss their next door neighbours, the Hennessy family, who are seen lit in a separate space, eating their own dinner. Mrs O'Brien mentions Miriam having been recently widowed and moving back from New York. The local newspaper arrives in the O'Brien kitchen and Sheila reads it aloud. She reads out an item about a baby competition and Mrs O'Brien is suddenly transfixed, determined to enter little Conor. Dickie's fiancé, Dymphna, arrives with news that baby Max Hennessy from next door (Miriam's son) is to be entered for it. Mrs O'Brien is roused and commands Sheila to complete an entry letter for Conor immediately. The family disperses and Dymphna nags Dickie to set a wedding date. Mrs O'Brien sets off to post Conor's entry to the competition.", "Two months later Mrs O'Brien is soldiering on in the kitchen. With Josef Locke playing on the wireless, the family drifts away one by one. Dickie pops back in to remind her that a letter from Orla in London is still waiting to be read. She claims to be too busy and continues with her work. Once alone, she stares at unopened letter before finishing her chores and exiting. (HOLD IT ALL TOGETHER II)"]}, {"page": "When You and I Were Young, Maggie", "response": ["It was also recorded by De Dannan on the album \"Star-Spangled Molly\", by Josef Locke on \"Let there be Peace\", and by James Galway and The Chieftains on \"In Ireland\". The Statler Brothers also recorded their harmonious rendition. In addition to Henry Burr and Harry MacDonough, other Canadian performers such as Hank Snow, The Climax Jazz Band and Murray McLaughlin have also recorded it. Tom Rush recorded a version on his CBS release \"Ladies Love Outlaws\" in 1974. American psychedelic rock band Magic Fern from Seattle (who wrote and performed together in the mid to late 1960s) recorded a version of this song entitled \"Maggie\" and that version is on the soundtrack for Adam Sandler's film Strange Wilderness. The Hot Sardines have it on their debut album released in 2014.The Hot Sardines Irish band The Fureys & Davey Arthur also released \"Maggie\" as the eleventh track on their album \"Golden Days\" in 1984."]}, {"page": "Nat Jackley", "response": ["* Singing in the Reign (1952), summer revue at the Queen's Theatre, Blackpool with Josef Locke"]}, {"page": "List of people from Derry", "response": ["* Josef Locke - tenor singer, popular in the 1940s and 1950s"]}, {"page": "List of incomplete or partially lost films", "response": ["|| 1949 || Somewhere in Politics || John E. Blakeley || Frank Randle, Tessie O'Shea, Josef Locke || According to the British Film Institute, only a print of an \"18-minute short from the film, entitled Full House\", is known to exist. ||"]}, {"page": "The Kaye Sisters", "response": ["The trio were headliners in top London cabaret clubs such as Churchill's and the Colony Club, and in variety supported such leading stars as Frankie Howerd, Tommy Cooper and Ken Dodd. They were popular in Blackpool summer seasons throughout the 1960s and 1970s, where they co-starred with Josef Locke, Dick Emery and, in two seasons, with Larry Grayson. In 1992, they returned to the resort to top the bill of the South Pier's Golden Showstoppers."]}, {"page": "Peter Chelsom", "response": ["His first full-length feature was the 1991 romantic comedy, Hear My Song. The film was inspired by the life of the Irish tenor, Josef Locke, played in the film by Ned Beatty. The Evening Standard British Film Awards named Chelsom Best Newcomer for his work on the film. Roger Ebert complimented it as \"the very soul of a great small film.\""]}, {"page": "Tommie Connor", "response": ["| Josef Locke"]}]}}