{"wiki_id": "http://www.wikidata.org/entity/Q1418223", "itemLabel": "Thomas Bensley", "itemDescription": "English printer", "wikipedia_url": "https://en.wikipedia.org/wiki/Thomas_Bensley", "wikipedia_page": {"main": "Thomas Bensley (1759–1835) was an English printer known for fine work, and as a collaborator of Friedrich Koenig. He was an innovator in the fields of steam-powered printing presses, and lithography for book illustration.", "link_mentions": [{"page": "Printing press", "response": ["Two ideas altered the design of the printing press radically: First, the use of steam power for running the machinery, and second the replacement of the printing flatbed with the rotary motion of cylinders. Both elements were for the first time successfully implemented by the German printer Friedrich Koenig in a series of press designs devised between 1802 and 1818. Having moved to London in 1804, Koenig soon met Thomas Bensley and secured financial support for his project in 1807. Patented in 1810, Koenig had designed a steam press \"much like a hand press connected to a steam engine.\" The first production trial of this model occurred in April 1811. He produced his machine with assistance from German engineer Andreas Friedrich Bauer."]}, {"page": "Friedrich Koenig", "response": ["In August 1817 Koenig returned to Germany because of a disagreement with Thomas Bensley, a London book printer partner, who Koenig believed sought sole rights to the new machine. After consideration he chose an abandoned monastery in Würzburg for the premises of the factory. The firm was called Koenig & Bauer."]}, {"page": "Pierce the Ploughman's Crede", "response": ["The Crede was first printed in London by Reyner Wolfe,1553 (STC 19904) and then reprinted for inclusion with Owen Rogers's 1561 reprint of Robert Crowley's 1550 edition of Piers Plowman.STC 19908 The Crede was not printed again until Thomas Bensley's edition in 1814, based on that of 1553, and Thomas Wright's of 1832.1832, reprinted 1856 The 1553 and 1561 editions were altered to include more anticlericalism and to attack an \"abbot\" where the original text had \"bishop\". This latter revision is a conservative one, undoubtedly motivated by the security of attacking a defunct institution following the Dissolution of the Monasteries rather than an aspect of Catholicism which survived in the Church of England. Nearly all modern critics have agreed that several lines about transubstantiation were removed. This excision was covered with a (perhaps interpolated) passage not found in any of the manuscripts."]}, {"page": "Robert Bensley", "response": ["He was at one time mistakenly associated with the family of printers of whom Thomas Bensley (died 1833) was the chief representative. On the stage he was simply Mr Bensley, but though he is named William and even Richard in some accounts, Mr Knight shows that his name was certainly Robert."]}, {"page": "History of printing", "response": ["The Gutenberg press was much more efficient than manual copying. It remained largely unchanged in the eras of John Baskerville and Giambattista Bodoni, over 300 years later.Meggs, Philip B. A History of Graphic Design. John Wiley & Sons, Inc. 1998. (pp 130–133)  By 1800, Lord Stanhope had constructed a press completely from cast iron, reducing the force required by 90% while doubling the size of the printed area. While Stanhope's \"mechanical theory\" had improved the efficiency of the press, it was only capable of 250 sheets per hour. German printer Friedrich Koenig was the first to design a non-manpowered machine—using steam. He moved to London in 1804, and met Thomas Bensley; he secured financial support for his project in 1807. With a patent in 1810, Koenig designed a steam press \"much like a hand press connected to a steam engine.\" The first production trial of this model occurred in April 1811."]}, {"page": "John Anderson (engraver)", "response": ["Anderson cut (after drawings by George Samuel) the blocks which illustrate Grove Hill, a 1799 poem by Thomas Maurice.spenserians.cath.vt.edu, Thomas Maurice It was sumptuously issued by Thomas Bensley in 1799, in a book that has been compared with William Somervile's The Chace. Anderson, with Shakespeare's Walk in the book, almost equals Bewick, according to Ernest Radford writing in the Dictionary of National Biography, and his treatment of foliage is reminiscent of the prints in Robert Bloomfield's Farmer's Boy, where the first edition of 1800 notes \"with ornaments engraved by Anderson.\" These wood-engravings have been erroneously ascribed to Bewick."]}, {"page": "Vincent Figgins", "response": ["An early commission was to make a facsimile type for Macklin's Bible, commissioned by Thomas Bensley. The original type for the book was cut by Jackson, and Bensley decided to buy new type which matched the original. Instead of going to Caslon, who had Jackson's matrices, he asked Figgins. Figgins was able to make a perfect recreation of the type. He then worked on a similar job to finish the Double Pica (24-point size) type in Robert Bowyer’s edition of David Hume's The History of England which was being worked on by Jackson at the time of his death."]}, {"page": "James Dallaway", "response": ["* Statuary and Sculpture among the Ancients, with some account of Specimens preserved in England (London, 1816) (Three hundred and fifty copies of this work were printed, but two hundred of them were destroyed by fire at Thomas Bensley's printing-office.)"]}, {"page": "George Woodfall", "response": ["When Friedrich König, inventor of the steam printing-press, was in London in 1806, Thomas Bensley brought his fellow-printers Woodfall and Richard Taylor into a consortium to develop a press. Woodfall, however, failed to see the potential."]}, {"page": "John Hatchard", "response": ["Hatchard had a trial at the works of the printer Thomas Bensley. He then served on apprenticeship, with John Ginger of College Street, Westminster. He later became an assistant to Thomas Payne of Mews Gate, and went into business on his own account at 173 Piccadilly, London. Starting there in 1797, he had the largest business in the retail book trade in London after four years. "]}, {"page": "Bensley, Thomas", "response": ["#redirectThomas Bensley"]}, {"page": "Clara Barthold Mayer", "response": ["In 1794, she and Luigi moved to England, where they continued to produce watercolors designed for engraving. Clara concentrated on landscapes and her first works were published by J. Harris of London that same year. Luigi painted her portrait in Turkish clothes. A series of twenty-seven views of Istanbul and its environs were engraved by Thomas Milton and published by Thomas Bensley of Fleet Street, for the Bowyer Historic Gallery, Pall Mall, in 1801."]}]}}