{"wiki_id": "http://www.wikidata.org/entity/Q1423151", "itemLabel": "A. C. Ewing", "itemDescription": "British philosopher (1899-1973)", "wikipedia_url": "https://en.wikipedia.org/wiki/A._C._Ewing", "wikipedia_page": {"main": "Alfred Cyril Ewing (; 11 May 1899 – 14 May 1973), usually cited as A. C. Ewing, was an English philosopher and a sympathetic critic of idealism.", "link_mentions": [{"page": "Karl Popper", "response": ["In 1928, Popper earned a doctorate in psychology, under the supervision of Karl Bühler—with Moritz Schlick being the second chair of the thesis committee. His dissertation was titled Zur Methodenfrage der Denkpsychologie (On Questions of Method in the Psychology of Thinking). In 1929, he obtained an authorisation to teach mathematics and physics in secondary school, and began doing so. He married his colleague Josefine Anna Henninger (1906–1985) in 1930. Fearing the rise of Nazism and the threat of the Anschluss, he started to use the evenings and the nights to write his first book Die beiden Grundprobleme der Erkenntnistheorie (The Two Fundamental Problems of the Theory of Knowledge). He needed to publish a book to get an academic position in a country that was safe for people of Jewish descent. In the end, he did not publish the two-volume work; but instead, a condensed version with some new material, as Logik der Forschung (The Logic of Scientific Discovery) in 1934. Here, he criticised psychologism, naturalism, inductivism, and logical positivism, and put forth his theory of potential falsifiability as the criterion demarcating science from non-science. In 1935 and 1936, he took unpaid leave to go to the United Kingdom for a study visit.A. C. Ewing was responsible for Karl Popper's 1936 invitation to Cambridge (Edmonds and Eidinow 2001, p. 67)."]}, {"page": "Index of philosophy articles (A–C)", "response": ["* A. C. Ewing"]}, {"page": "Coherentism", "response": ["In contemporary philosophy, epistemologists who have significantly contributed to epistemic coherentism include: A. C. Ewing, Brand Blanshard, C. I. Lewis, Nicholas Rescher, Laurence BonJour, Keith Lehrer, and Paul Thagard. Otto Neurath is also sometimes thought to be an epistemic coherentist.Otto Neurath (Stanford Encyclopedia of Philosophy) (Stanford Encyclopedia of Philosophy)"]}, {"page": "Objective idealism", "response": ["A. C. Ewing is an analytic philosopher influenced by the objective idealist tradition. His approach has been termed analytic idealism.Michael Beaney (ed.), The Oxford Handbook of the History of Analytic Philosophy, Oxford University Press, 2013, p. 5. n. 6.", "*A. C. Ewing"]}, {"page": "A.C. Ewing", "response": ["#redirect A. C. Ewing"]}, {"page": "Roger Scruton", "response": ["Having intended to study natural sciences at Cambridge, where he felt \"although socially estranged (like virtually every grammar-school boy), spiritually at home\", Scruton switched on the first day to moral sciences (philosophy); his supervisor was A. C. Ewing.Scruton, Roger (2012). \"Working toward Art\". In Hamilton, Andy; Zangwill, Nick (eds.). Scruton's Aesthetics. London: Palgrave Macmillan, 1. He graduated with a double first in 1965, then spent time overseas, some of it teaching at the University of Pau and Pays de l'Adour in Pau, France, where he met his first wife, Danielle Laffitte. He also lived in Rome.\"Working toward Art\", Scruton's Aesthetics, 2. His mother died around this time; she had been diagnosed with breast cancer and had undergone a mastectomy just before he went to Cambridge.Gentle Regrets, 104ff."]}, {"page": "Schema (Kant)", "response": ["A. C. Ewing claimed that the reason that Kant did not use space as a transcendental schema was because space is not needed in order to understand the relational concepts of substance or causality.\"It might be asked why Kant schematized the categories in terms of time only and not of space, since space was also both sensible and a priori. The answer is perhaps simply that the second method [that of using space] would not work out so well, for time seems essential for the formulation of any tolerably clear idea of substance or causality in a way in which space is not.\"(A. C. Ewing, A Short Commentary on Kant’s Critique of Pure Reason, Chicago: University of Chicago Press, 1967, chapter IV, p. 146) According to Professor Ewing, Kant did intend to use space as a transcendental schematic mediator between a category and a sensible intuition.\"…in a note written for his private use he proposes to schematize the categories in terms of space as well as time.\" (A. C. Ewing, A Short Commentary on Kant’s Critique of Pure Reason, Chicago: University of Chicago Press, 1967, chapter IV, p. 146) Kant, according to Professor Ewing, for one category did use space as a transcendental schema to unify a pure concept with a sensible intuition.\"…the nearest he ever came to this [schematization] was to add the words 'in space' to the definition of [the relational category of] community [reciprocity] in the second edition [of the Critique of Pure Reason B 256].\"(A. C. Ewing, A Short Commentary on Kant’s Critique of Pure Reason, Chicago: University of Chicago Press, 1967, chapter IV, p. 146) Even though space is not needed in order to understand the relations of substance and causality, it is required in order to understand the conceptual relation of community or reciprocity.A. C. Ewing refers to the category of community as \"…a two-sided relation between different co-existing substances….\" (A. C. Ewing, A Short Commentary on Kant’s Critique of Pure Reason, Chicago: University of Chicago Press, 1967, chapter IV, p. 166) He relates that particular category to space as its transcendental schema. He wrote that \"…except under spatial conditions we cannot conceive how different substances could interact….\" (p. 175) and \"…before we can apply it [the category of community or reciprocity] we must understand it in terms of space….\" (p. 175)"]}, {"page": "Faculty of Philosophy, University of Cambridge", "response": ["*A. C. Ewing"]}, {"page": "1973 in the United Kingdom", "response": ["* 14 May – A. C. Ewing, British philosopher (born 1899)"]}, {"page": "Ian Ramsey", "response": ["Ramsey was born in Kearsley, near Bolton, Lancashire, an area noted for small industries and factories. He was the sole child born to Arthur and Mary Ramsey, and was raised by them in the Christian faith. He attended primary school at St John's Church in Farnworth, Bolton, and then proceeded on a scholarship to Farnworth Grammar School where he studied Latin, mathematics, physics and chemistry. He won a scholarship that enabled him to study at Cambridge University in the 1930s and graduated with an MA in 1940. At Cambridge, he was influenced by Charles E. Raven (Regius Professor of Divinity) and A. C. Ewing. Raven spurred Ramsey's interests in the relationship between science and religion, while Ewing guided him into studying metaphysics."]}, {"page": "Alfred Cyril Ewing", "response": ["#REDIRECT A. C. Ewing"]}, {"page": "A C Ewing", "response": ["#REDIRECT A. C. Ewing "]}, {"page": "AC Ewing", "response": ["#REDIRECT A. C. Ewing "]}, {"page": "List of alumni of University College, Oxford", "response": ["* A. C. Ewing, philosopher"]}, {"page": "List of British philosophers", "response": ["* A. C. Ewing"]}, {"page": "Philosophical theism", "response": ["*A. C. Ewing (1899–1973) was an English philosopher who authored Value and Reality: The Philosophical Case for Theism in 1973."]}, {"page": "List of fellows of the British Academy elected in the 1940s", "response": ["* Dr A. C. Ewing"]}, {"page": "Ethics Since 1900", "response": ["A. C. Ewing, Paul Welsh and James D. Bastable have reviewed the book."]}]}}