{"wiki_id": "http://www.wikidata.org/entity/Q1439779", "itemLabel": "Rosemary Byrne", "itemDescription": "Scottish politician (born 1948)", "wikipedia_url": "https://en.wikipedia.org/wiki/Rosemary_Byrne", "wikipedia_page": {"main": "Rosemary Byrne (born 3 March 1948, Irvine, North Ayrshire) is a Scottish politician who served as co-convenor of Solidarity from 2006 to 2019.\nShe is a former Member of the Scottish Parliament (MSP) for the South of Scotland region 2003–2007.  She was elected as a Scottish Socialist Party MSP but in September 2006, together with Tommy Sheridan, she left that party to form Solidarity.\nByrne lives in Irvine, and was a teacher and a trade union activist for several years. At one time she was president of Irvine Trades Council.", "link_mentions": [{"page": "Land value tax", "response": ["In 2004 a letter of support was sent from members of the Scottish Parliament to the organisers and delegates of the IU's 24th international conference—including members of the Scottish Greens, the Scottish Socialist Party and the Scottish National Party.\"Scotland is in the throes of releasing itself from the shackles of a historical inheritance of landed privilege.... On a global scale, the failure to share equitably the value of our common birthrights can grow awful grievances, which bring terrible consequences, such as was visited upon your host city [eleven weeks earlier].... [W]e must make practical changes to our social systems. We believe that the taxing of land values will be a key policy reform for the twenty-first century. Scotland must adopt it...\" Letter dated (fax) 29 May, signed by members Mark Ballard, Robin Harper, Shiona Baird, Mark Ruskell, Chris Balance, Eleanor Scott, Patrick Harvie, Rosie Kane, Rosemary Byrne, and Rob Gibson"]}, {"page": "Tommy Sheridan", "response": ["Eleven members, including four of the party's MSPs, stated they heard Sheridan admit to visiting the swingers' club at that meeting. Rosemary Byrne MSP and two other members of the executive committee, Graham McIver and Pat Smith, gave evidence that Sheridan made no such statement. The minutes record that Sheridan left the meeting early, but before leaving, \"he repeated that he did not believe there was any evidence which would prove him to be lying. He did not accept that he should admit the visits to the club and felt that no-one should comment on private lives\".", "In September 2006, Tommy Sheridan formed a new political party in Scotland named Solidarity, with himself and fellow MSP Rosemary Byrne as joint convenors. Sheridan narrowly failed to be re-elected in the 2007 Holyrood election as top of his party's list nominees for Glasgow. The party also stood a candidate in by-elections in 2008 in Glasgow East and the Glenrothes, and Sheridan himself stood in the 2009 Glasgow North East by-election.", "On 16 December 2007, Sheridan was charged with perjury in relation to the News of the World case. In a public statement outside the police station he attributed his arrest to the \"powerful reach\" of the Murdoch press. During February 2008, his wife Gail, former SSP MSP Rosemary Byrne, former members of the SSP Executive Committee, Patricia Smith, Graeme McIver, Jock Penman, and Sheridan's father-in-law, Angus Healey were also charged with perjury."]}, {"page": "South of Scotland (Scottish Parliament electoral region)", "response": ["|rowspan=\"2\"|Rosemary Byrne(Socialist)", "*Rosemary Byrne resigned from the Scottish Socialist Party in September 2006 and then sat as a member of Solidarity."]}, {"page": "Byrne", "response": ["*Rosemary Byrne, Member of the Scottish parliament"]}, {"page": "Sheridan v News Group Newspapers Ltd", "response": ["On 16 December 2007 Tommy Sheridan was charged with perjury.Sheridan faces perjury charges During February 2008 six more people were charged with perjury; they were Graeme McIver, Jock Penman, Pat Smith and Rosemary Byrne (all members of Sheridan's new party Solidarity who had been at the disputed SSP EC meeting of November 2004) plus Sheridan's wife, Gail and her father, Angus Healy.Sheridan wife charged with perjury"]}, {"page": "Solidarity (Scotland)", "response": ["Solidarity – Scotland's Socialist Movement was a political party in Scotland.  The party launched on 3 September 2006, founded by two Scottish Socialist Party MSPs, Tommy Sheridan and Rosemary Byrne, in the aftermath of Sheridan's libel action.", "The Scottish Socialist Party returned six MSPs in the 2003 Scottish Parliament election. At the end of August 2006, the SSP's leader Tommy Sheridan and Rosemary Byrne, a SSP MSP for South of Scotland led a breakaway. Solidarity launched on 3 September with 600 people attending the first meeting in Glasgow. Most SSP members and branches in the Highlands and Islands defected to the new party, while the Shetland membership voted unanimously to stay in the SSP. 250 people attended the founding conference on Saturday 5 November 2006.", "The new party was backed by the Socialist Workers Party and Socialist Party Scotland (part of the Committee for a Workers' International). The two groups clashed at the first Solidarity conference on the political orientation of the party. After a close vote the interim title of \"Solidarity - Scotland's Socialist Movement\" was adopted as the name of the party, and Rosemary Byrne and Tommy Sheridan were unanimously endorsed as co-convenors.Solidarity Website - Solidarity Conference Elects Co-Convenors, Tommy Sheridan and Rosemary Byrne 4 November 2006 "]}, {"page": "History of the Scottish Socialist Party", "response": ["The 2003 elections to the Scottish Parliament took place shortly after the decision of the UK parliament to invade Iraq and the UK firefighter dispute 2002–2003. The SSP had been active in the anti-war movement and the firefighters' dispute, and fielded candidates in all seats. They gained five additional regional list MSPs across Scotland: Frances Curran; Rosie Kane; Carolyn Leckie; Colin Fox; and Rosemary Byrne.", "By early August 2006, Sheridan was looking to become leader of the Scottish Socialist Party again but on 29 August 2006, before the election had taken place, Sheridan announced his intention to leave and found a new political party which he called Solidarity.\"New socialist party for Sheridan\", BBC News, 29 August 2006, (retrieved 10 September 2006) His move was supported by Rosemary Byrne MSP. Sheridan hoped his splinter group would attract as many as 700 SSP members."]}, {"page": "2007 Scottish Parliament election", "response": ["*Rosemary Byrne, South of Scotland - originally elected as Scottish Socialist Party"]}, {"page": "List of political parties in the United Kingdom by representation", "response": ["|Rosemary Byrne; Tommy Sheridan"]}, {"page": "Rosemary (given name)", "response": ["*Rosemary Byrne (born 1948), Scottish politician and co-convenor of Solidarity"]}, {"page": "HM Advocate v Sheridan and Sheridan", "response": ["In December 2007, Tommy Sheridan was charged with perjury.  During February 2008, six more people were charged with perjury: Graeme McIver, John Penman, Pat Smith and Rosemary Byrne (all members of Sheridan's new party Solidarity who had been at the disputed SSP executive meeting of November 2004) plus Sheridan's wife, Gail and her father, Angus Healy.", "The defence opened its case on 3 December. Both Sheridans declined to act as witnesses themselves.  Many of the witnesses called by Sheridan were members of Solidarity, his own party, including Hugh Kerr, Rosemary Byrne and Mike Gonzalez.  He also called Andy Coulson, Downing Street director of communications and former News of the World editor, who denied that he had any knowledge of phone hacking at the News of the World, or that he knew Glenn Mulcaire, the private detective at the centre of controversy.https://www.theguardian.com/media/2010/dec/09/andy-coulson-phone-hacking-sheridan Guardian 9 December  Tom Watson had briefed Sheridan's team about alleged phone hacking a few days earlier."]}, {"page": "List of elected British politicians who have changed party affiliation", "response": ["|Rosemary Byrne"]}, {"page": "South Scotland (Scottish Parliament electoral region)", "response": ["|rowspan=\"2\"|Rosemary Byrne(Socialist)"]}, {"page": "1948 in Scotland", "response": ["* 3 March – Rosemary Byrne, Scottish Socialist Party then Solidarity MSP (2003–2007)"]}, {"page": "2005 Scottish Socialist Party leadership election", "response": ["Sheridan initially refused to name his preferred successor, but later emerged as one of Fox's backers. Fox was supported by two of the party's other MSPsSheridan and Rosemary Byrnewhile McCombes was backed by three: Rosie Kane, Carolyn Leckie, and Frances Curran."]}, {"page": "List of female members of the Scottish Parliament", "response": ["|data-sort-value=\"Byrne, Rosemary\" rowspan=\"2\"|Rosemary Byrne"]}, {"page": "List of Scottish Socialist Party Members of the Scottish Parliament", "response": ["| data-sort-value=\"Byrne, Rosemary\"| Rosemary Byrne", "| Left the SSPRosemary Byrne and Tommy Sheridan both reigned from the SSP in August 2006.  In September 2006 they launched the new Solidarity party."]}]}}