{"wiki_id": "http://www.wikidata.org/entity/Q1438821", "itemLabel": "Richard Quest", "itemDescription": "English television journalist", "wikipedia_url": "https://en.wikipedia.org/wiki/Richard_Quest", "wikipedia_page": {"main": "Richard Austin Quest (born 9 March 1962) is a British journalist and non-practising barrister working as a news anchor for CNN International. He is also an editor-at-large of CNN Business.\nHe anchors Quest Means Business, the five-times-weekly business program and fronts the CNN shows Business Traveller, The Express and Quest's World of Wonder.", "link_mentions": [{"page": "BBC World News", "response": ["*Richard Quest"]}, {"page": "Jens Stoltenberg", "response": ["On Sunday 24 July, Stoltenberg spoke at the church service in the Oslo Cathedral. He named two of the victims at Utøya, Monica Bøsei, who was the camp's leader, and Tore Eikeland, who was the leader of the youth chapter in Hordaland. He again vowed to work for more democracy, openness, and humanity, but without naïveté. He also said that \"No one has said it better than the AUF girl who was interviewed by CNN: If one man can show so much hate, think how much love we could show, standing together.\" The AUF girl mentioned is Stine Renate Håheim interviewed by CNN's Richard Quest on 23 July 2011. Håheim again quoted her friend Helle Gannestad, who had tweeted this from home, watching events unfold on TV."]}, {"page": "University of Leeds", "response": ["Alumni from the media and related areas include the former Editor of the Daily Mail newspaper, Paul Dacre, world music broadcaster and DJs Andy Kershaw and Liz Kershaw, Moda Operandi editor Tatiana Hambro, IMDb founder Col Needham as well as CNN International news presenter, Richard Quest. Founder Carrie Rose, BBC News Editorial Director Kamal Ahmed, political cartoonist Steve Bell, foreign correspondent Mark Brayne, television presenters Jenni Falconer and Georgie Thompson, BBC News royal correspondent Nicholas Witchell and former BBC executive Alan Yentob."]}, {"page": "Vanderbilt University", "response": ["Alumni have made significant contributions to literature. Most notably, the Southern Agrarians and Fugitive Poets were two overlapping groups of influential American poets and writers in the early 1900s based at Vanderbilt. Three U.S. Poets Laureate are alums: Allen Tate, Robert Penn Warren, and Randall Jarrell. Warren later won the Pulitzer Prize twice for poetry and for All the King's Men. Other important novelists include James Dickey (Deliverance), James Still (River of Earth), Elizabeth Spencer (The Light in the Piazza), and James Patterson, who topped Forbes list of global highest grossing authors in multiple years. Journalists who have attended Vanderbilt include Pulitzer Prize winners Ralph McGill and Wendell Rawls Jr., Morning Joe host Willie Geist, Vogue Director of Communications Hildy Kuryk, NBC newscaster David Brinkley, CNN International anchor Richard Quest, and head writer of The Daily Show Zhubin Parang."]}, {"page": "List of twins", "response": ["* Richard Quest, twin sister"]}, {"page": "List of game show hosts", "response": ["| Richard Quest || United Kingdom || 500 Questions (2015) (United States)"]}, {"page": "Gordon Ramsay", "response": ["In September 2005, Ramsay, along with Jamie Oliver, Heston Blumenthal, Wolfgang Puck and Sanjeev Kapoor, were featured in CNN International's Quest, in which Richard Quest stepped into the shoes of celebrity chefs."]}, {"page": "Kim Peek", "response": ["*CNN interview by Richard Quest"]}, {"page": "CNN International", "response": ["* CNN Business Traveller – presented by Richard Quest", "* Richard Quest – anchor of Quest Means Business, Marketplace Europe and Business Traveller"]}, {"page": "List of people from Merseyside", "response": ["* Richard Quest: CNN TV presenter and journalist"]}, {"page": "Quest (disambiguation)", "response": ["* Richard Quest (born 1962), English television journalist"]}, {"page": "List of Vanderbilt University people", "response": ["* Richard Quest – British reporter, anchor for CNN International"]}, {"page": "CNN Business Traveller", "response": ["CNN Business Traveller is a monthly television program on CNN International hosted by Richard Quest."]}]}}