{"wiki_id": "http://www.wikidata.org/entity/Q1445772", "itemLabel": "Tania Strecker", "itemDescription": "UK based Danish model (person) and TV presenter", "wikipedia_url": "https://en.wikipedia.org/wiki/Tania_Strecker", "wikipedia_page": {"main": "Tania Strecker (born 26 June 1973) is a Danish model and television presenter in the United Kingdom.\nHer break into TV began with Channel 4's Naked Elvis, and she then co-hosted MTV's SELECT with Richard Blackwood. After several further presenting jobs, she joined The Big Breakfast with Richard Bacon, and then Beachmate.", "link_mentions": [{"page": "Pet Shop Boys", "response": ["On 3 October 2006, the long-delayed U.S. release of their PopArt hits package was issued by Capitol Records. During 2006, Pet Shop Boys worked with Robbie Williams on his then-new album, Rudebox, producing two tracks: a cover version of \"We're the Pet Shop Boys\", written by My Robot Friend (which they have also recorded themselves and released as a B-side to \"Miracles\", in 2003) and \"She's Madonna\", a duet with Tennant, allegedly about Guy Ritchie's affair with Tania Strecker, prior to his relationship with Madonna. On 10 October 2006, Pet Shop Boys embarked on the North and Central American leg of their world tour, which took them through Canada, the United States and Mexico, concluding on 16 November. A DVD of the show in Mexico City was released on 21 May 2007, titled Cubism. It was recorded on 14 November 2006, in the Auditorio Nacional, and was directed by David Barnard."]}, {"page": "List of Danes", "response": ["* Tania Strecker, model"]}, {"page": "Naked Elvis", "response": ["Naked Elvis was a late-night British television quiz show on Channel 4 from 10 August to 3 December 1999 hosted by Tania Strecker. Two teams of students would answer general knowledge questions. There was a scoremaster dressed as Elvis Presley played by Marc Fossey, Sam Cullingworth and two others who would remove one item of clothing between each round until he was naked."]}, {"page": "Anthony James de Rothschild", "response": ["He is married to Danish model and UK TV presenter Tania Strecker.Stewart-Liberty, Olivia (17 March 2006) \"Social adventurer\" The Evening Standard London, UK, (March 17, 2006 Friday) ES Magazine p. 51"]}, {"page": "Evelyn de Rothschild", "response": ["# Anthony James de Rothschild (30 January 1977) - married Danish model and UK TV presenter Tania Strecker in 2006.Stewart-Liberty, Olivia (17 March 2006) \"Social adventurer\" The Evening Standard London, UK, (17 March 2006 Friday) ES Magazine p. 51"]}, {"page": "List of Never Mind the Buzzcocks episodes", "response": ["|Tania Strecker and Brian Harvey (East 17)"]}, {"page": "She's Madonna", "response": ["\"She's Madonna\" is a song recorded by British singer Robbie Williams with the duo Pet Shop Boys, for his seventh studio album Rudebox (2006). The track was released as its third and final international single on 5 March 2007 by Chrysalis Records. The subject matter of the song is a reference to the conversation Williams had with his ex-girlfriend Tania Strecker, over the reason her former boyfriend Guy Ritchie gave, for leaving her for American singer Madonna. Williams had played the recording to Madonna shortly after writing it, receiving a positive reaction.", "\"She's Madonna\" is a collaboration between Williams and Pet Shop Boys, and served as the fifth and final single from Williams' seventh studio album, Rudebox (2006). By the time the single was supposed to be released, he had just come out from rehab following his addiction problems. \"She's Madonna\" was inspired by a conversation Williams had with his ex-girlfriend Tania Strecker, who told the story of how her boyfriend, British director Guy Ritchie, left her for American singer Madonna. Strecker quoted Ritchie as saying, \"Look, you know I really love you, but she's Madonna.\" Williams considered the song to be one of Rudeboxs lighter moments, clarifying that the track did not have a tongue in cheek connotation about it. Rather it literally spoke about his fantasies for Madonna and he was happy with the song's outcome. According to Contactmusic.com, Williams had played the song to Madonna shortly after writing it, receiving a positive reaction."]}, {"page": "Tanya Strecker", "response": ["#REDIRECT Tania Strecker"]}, {"page": "List of Shooting Stars episodes", "response": ["|Nicky Clarke and Tania Strecker"]}, {"page": "Road Raja", "response": ["* Tania Strecker", "* 2nd - Tania Strecker"]}, {"page": "Streetmate", "response": ["A spin-off version called Beachmate aired for 5 episodes in 2001, hosted by Tania Strecker.", "| 1 || 13 April 2001 || 11 May 2001 || 5 || Channel 4 || Tania Strecker"]}, {"page": "Strecker", "response": ["* Tania Strecker, Danish model and television presenter in the UK"]}, {"page": "Genealogy of the Rothschild family", "response": ["      │                   │    ∞ 2006 : Tania Strecker (1973–), model"]}, {"page": "Cultural impact of Madonna", "response": ["Madonna has been a subject of music collectors and was classified at number one in the 100 Most Collectable Divas by Record Collector in 2008. Her songs have been covered by numerous performers in multiple languages and various artists have released tribute albums. She also inspired the creation of new musical singles. In 2002, Australian rock band The Androids scored a top-five hit single on the ARIA Chart with \"Do It with Madonna\". English singer Robbie Williams released \"She's Madonna\" in 2006, which reached the top five in many European countries. The song talks about his fascination with Madonna, and is a reference to Guy Ritchie who left his ex-girlfriend Tania Strecker for Madonna. In 2010, South Korean girl group Secret reached number one on the Gaon Singles Chart with the song \"Madonna\" from the EP of the same name. According to its songwriters, the song is about \"living with confidence by becoming an icon in this generation, like the American star Madonna\"."]}]}}