{"wiki_id": "http://www.wikidata.org/entity/Q1445910", "itemLabel": "Alberico Gentili", "itemDescription": "Italian jurist (1552-1608)", "wikipedia_url": "https://en.wikipedia.org/wiki/Alberico_Gentili", "wikipedia_page": {"main": "Alberico Gentili (14 January 1552 – 19 June 1608) was an Italian-English jurist, a tutor of Queen Elizabeth I, and a standing advocate to the Spanish Embassy in London, who served as the Regius professor of civil law at the University of Oxford for 21 years. He is heralded as the founder of the science of international law alongside Francisco de Vitoria and Hugo Grotius, and thus known as the \"Father of international law\". Gentili has been the earliest writer on public international law. In 1587, he became the first non-English person to be a Regius Professor.Gentili authored several books, which are recognized to be among the most essential for international legal doctrines, yet that also include theological and literary subjects.", "link_mentions": [{"page": "Assassination", "response": ["During the 16th and 17th century, international lawyers began to voice condemnation of assassinations of leaders. Balthazar Ayala has been described as \"the first prominent jurist to condemn the use of assassination in foreign policy\". Alberico Gentili condemned assassinations in a 1598 publication where he appealed to the self-interest of leaders: (i) assassinations had adverse short-term consequences by arousing the ire of the assassinated leader's successor, and (ii) assassinations had the adverse long-term consequences of causing disorder and chaos. Hugo Grotius's works on the law of war strictly forbade assassinations, arguing that killing was only permissible on the battlefield."]}, {"page": "June 19", "response": ["*1608 – Alberico Gentili, Italian lawyer and jurist (b. 1551)"]}, {"page": "January 14", "response": ["*1552 – Alberico Gentili, Italian-English academic and jurist (d. 1608)"]}, {"page": "Natural law", "response": ["The English cleric Richard Cumberland wrote a lengthy and influential attack on Hobbes's depiction of individual self-interest as the essential feature of human motivation. Historian Knud Haakonssen has noted that in the eighteenth century, Cumberland was commonly placed alongside Alberico Gentili, Hugo Grotius and Samuel Pufendorf \"in the triumvirate of seventeenth-century founders of the 'modern' school of natural law.\"Knud Haakonssen, \"The Character and Obligation of Natural Law according to Richard Cumberland\", in English Philosophy in the Age of Locke, ed. M.A. Stewart (Oxford, 2000), 29. The eighteenth-century philosophers Shaftesbury and Hutcheson \"were obviously inspired in part by Cumberland.\"Haakonssen, Natural Law and Moral Philosophy: From Grotius to the Scottish Enlightenment (Cambridge, 1996), 51. Historian Jon Parkin likewise describes Cumberland's work as \"one of the most important works of ethical and political theory of the seventeenth century.\"Jon Parkin, Science, Religion and Politics in Restoration England: Richard Cumberland's De Legibus Naturae (Bury St. Edmunds, United Kingdom, 1999), 8. Parkin observes that much of Cumberland's material \"is derived from Roman Stoicism, particularly from the work of Cicero, as \"Cumberland deliberately cast his engagement with Hobbes in the mould of Cicero's debate between the Stoics, who believed that nature could provide an objective morality, and Epicureans, who argued that morality was human, conventional and self-interested.\"Parkin, 8. In doing so, Cumberland de-emphasized the overlay of Christian dogma (in particular, the doctrine of \"original sin\" and the corresponding presumption that humans are incapable of \"perfecting\" themselves without divine intervention) that had accreted to natural law in the Middle Ages.", "Sir Alberico Gentili and Hugo Grotius based their philosophies of international law on natural law. In particular, Grotius's writings on freedom of the seas and just war theory directly appealed to natural law. About natural law itself, he wrote that \"even the will of an omnipotent being cannot change or abrogate\" natural law, which \"would maintain its objective validity even if we should assume the impossible, that there is no God or that he does not care for human affairs.\" (De iure belli ac pacis, Prolegomeni XI). This is the famous argument etiamsi daremus (non esse Deum), that made natural law no longer dependent on theology. However, German church-historians Ernst Wolf and M. Elze disagreed and claimed that Grotius' concept of natural law did have a theological basis.Ernst Wolf, Naturrecht, in Die Religion in Geschichte und Gegenwart, 3. Auflage, Band IV (1960), Tübingen (Germany), col. 1357 In Grotius' view, the Old Testament contained moral precepts (e.g. the Decalogue) which Christ confirmed and therefore were still valid. Moreover, they were useful in explaining the content of natural law. Both biblical revelation and natural law originated in God and could therefore not contradict each other.M. Elze, Grotius, Hugo, in Die Religion in Geschichte und Gegenwart, 3. Auflage, Band II (1958), col. 1885"]}, {"page": "16th century", "response": ["The Protestant Reformation in central and northern Europe gave a major blow to the authority of the papacy and the Catholic Church. In England, the British-Italian Alberico Gentili wrote the first book on public international law and divided secularism from canon law and Catholic theology. European politics became dominated by religious conflicts, with the groundwork for the epochal Thirty Years' War being laid towards the end of the century."]}, {"page": "1608", "response": ["**Alberico Gentili, Italian jurist (b. 1551)"]}, {"page": "1552", "response": ["* January 14 – Alberico Gentili, Italian jurist (d. 1608)"]}, {"page": "Henry V (play)", "response": ["In recent years, there has been scholarly debate about whether or not Henry V can be labeled a war criminal.Watts, Cedric and John Sutherland, Henry V, War Criminal?: And Other Shakespeare Puzzles. Oxford: Oxford University Press, 2000. Some denounce the question as anachronistic, arguing that contemporary legal terminology cannot be applied to historical events or figures like those depicted in the play.Condren, Conal. \"Understanding Shakespeare’s Perfect Prince: Henry V, the Ethics of Office and the French Prisoners\" in The Shakespearean International Yearbook, ed. Graham Bradshaw, Tom Bishop, and Laurence Wright, Ashgate, 2009, pp. 195–213. However, other scholars have supported the proposed viewpoint. For instance, Christopher N. Warren looks to Alberico Gentili's De armis Romanis, along with Henry V itself, to show how early modern thinkers (including Shakespeare) were themselves using juridical approaches to engage with the past.Warren, Christopher. “Henry V, Anachronism, and the History of International Law” in The Oxford Handbook to English Law and Literature, 1500–1625. As a result, Warren argues, the question of whether Henry V was a war criminal is not only legitimate, but also \"historically appropriate\".Warren, Christopher. “Henry V, Anachronism, and the History of International Law” in The Oxford Handbook to English Law and Literature, 1500–1625. p. 27."]}, {"page": "Robert Dudley, 1st Earl of Leicester", "response": ["Apart from their legal function the Inns of Court were the Tudor equivalents of gentlemen's clubs.Wilson 1981 p. 169 In 1561, grateful for favours he had done them, the Inner Temple admitted Dudley as their most privileged member, their \"Lord and Governor\".Adams 2002 p. 250 He was allowed to build his own apartments on the premises and organised grand festivities and performances in the Temple.Wilson 1981 pp. 131–132, 168–169 As Chancellor of Oxford University Dudley was highly committed.Chamberlin 1939 pp. 177–178 He enforced the Thirty-nine Articles and the oath of royal supremacy at Oxford, and obtained from the Queen an incorporation by Act of Parliament for the university.Haynes 1987 pp. 75–76; Jenkins 2002 p. 178 Leicester was also instrumental in founding the official Oxford University Press,Rosenberg 1958 pp. 295–296 and installed the pioneer of international law, Alberico Gentili, and the exotic theologian, Antonio del Corro, at Oxford. Over del Corro's controversial case he even sacked the university's Vice-Chancellor.Rosenberg 1958 p. 137; Haynes 1987 p. 77"]}, {"page": "Richard Zouch", "response": ["In virtue of the last two he has the distinction of being one of the earliest systematic writers on international law. According to Thomas Erskine Holland writing in the Dictionary of National Biography, Jeremy Bentham's coinage \"international law\" derives from the phrase jus inter gentes implied by Zouch's 1650 choice of title. Holland also identifies both Zouch and Arthur Duck as pupils of distinction of the civilian John Budden, in the Oxford tradition founded by Alberico Gentili."]}, {"page": "Hugo Grotius", "response": ["Hugo Grotius was a major figure in the fields of philosophy, political theory and law during the sixteenth and seventeenth century. Along with the earlier works of Francisco de Vitoria and Alberico Gentili, he laid the foundations for international law, based on natural law in its Protestant side. Two of his books have had a lasting impact in the field of international law: De jure belli ac pacis [On the Law of War and Peace] dedicated to Louis XIII of France and the Mare Liberum [The Free Seas]. Grotius has also contributed significantly to the evolution of the notion of rights. Before him, rights were above all perceived as attached to objects; after him, they are seen as belonging to persons, as the expression of an ability to act or as a means of realizing something."]}, {"page": "Advocate", "response": ["\"Advocate\" is in some languages an honorific for lawyers, such as \"Adv. Sir Alberico Gentili\". \"Advocate\" also has the everyday meaning of speaking out to help someone else, such as patient advocacy or the support expected from an elected politician; this article does not cover those senses."]}, {"page": "Hermeneutics", "response": ["In the Middle Ages and Italian Renaissance, the schools of glossatores, commentatores, and usus modernus distinguished themselves by their approach to the interpretation of \"laws\" (mainly Justinian's Corpus Juris Civilis). The University of Bologna gave birth to a \"legal Renaissance\" in the 11th century, when the Corpus Juris Civilis was rediscovered and systematically studied by men such as Irnerius and Johannes Gratian. It was an interpretative Renaissance. Subsequently, these were fully developed by Thomas Aquinas and Alberico Gentili."]}, {"page": "World government", "response": ["Spanish philosopher Francisco de Vitoria (c. 1483–1546) is considered one of the founders of \"global political philosophy\" and international law, along with Alberico Gentili and Hugo Grotius. De Vitoria conceived of the res publica totius orbis, or the \"republic of the whole world\". This came at a time when the University of Salamanca was engaged in unprecedented thought concerning human rights, international law, and early economics based on the experiences of the Spanish Empire."]}, {"page": "Just war theory", "response": ["The first work dedicated specifically to just war was De bellis justis of Stanisław of Skarbimierz (1360–1431), who justified war by the Kingdom of Poland with Teutonic Knights. Francisco de Vitoria criticized the conquest of America by the Kingdom of Spain on the basis of just war theory. With Alberico Gentili and Hugo Grotius just war theory was replaced by international law theory, codified as a set of rules, which today still encompass the points commonly debated, with some modifications.Gutman R, Rieff D. Crimes of War: What the Public Should Know. New York, NY: W. W. Norton & Company; 1999 The importance of the theory of just war faded with the revival of classical republicanism beginning with works of Thomas Hobbes.", "* Alberico Gentili (1552–1608)"]}, {"page": "1608 in literature", "response": ["**Alberico Gentili, Italian legal writer (born 1552)"]}, {"page": "Henry Wotton", "response": ["The son of Thomas Wotton (1521–1587) and his second wife, Elionora Finch, Henry was the youngest brother of Edward Wotton, 1st Baron Wotton, and grandnephew of the diplomat Nicholas Wotton.Wotton, Henry, Reliquiae Wottonianae, (1672), unpaginated. Henry was born at Bocton Hall in the parish of Bocton or Boughton Malherbe, Kent.  He was educated at Winchester College and at New College, Oxford, where he matriculated on 5 June 1584,  'Alumni Oxonienses, 1500–1714: Woodall-Wyvill', Alumni Oxonienses 1500–1714 (1891), pp. 1674–1697. Date accessed: 8 May 2012 alongside John Hoskins. Two years later he moved to Queen's College, graduating in 1588. At Oxford he was the friend of Alberico Gentili, then professor of Civil Law, and of John Donne. During his residence at Queen's he wrote a play, Tancredo, which has not survived, but his chief interests appear to have been scientific. In qualifying for his M.A. degree he read three lectures De oculo, and to the end of his life he continued to interest himself in physical experiments."]}, {"page": "List of jurists", "response": ["* Alberico Gentili"]}, {"page": "Italians", "response": ["Since the Roman Empire, most western contributions to Western legal culture was the emergence of a class of Roman jurists. During the Middle Ages, Thomas Aquinas, the most influential Western scholar of the period, integrated the theory of natural law with the notion of an eternal and Biblical law.Code of Canon Law, Can. 252, § 3   During the Renaissance, Prof. Alberico Gentili, the founder of the science of international law, authored the first treatise on public international law and separated secular law from canon law and Catholic theology. Enlightenment's greatest legal theorists, Cesare Beccaria, Giambattista Vico and Francesco Mario Pagano, are well remembered for their legal works, particularly on criminal law.", "File:Dr Sir Albericus Gentilis (Father of international law).png|Alberico Gentili"]}, {"page": "Crusading movement", "response": ["By the 15thcentury, political concerns provoked self-interested polemics that mixed the legendary and evidential past. It was through humanist scholarship and theological hostility that an independent historiography emerged. The rise of the Ottoman Turks, the French Wars of Religion, and the Protestant Reformation in the 16thcentury encouraged the study of the crusades. Traditionalist wars of the cross presented military, spiritually penitent and redemptive solutions while also being examples of papist superstition and corruption of religion. The crusades provided evidence for the English martyrologist John Foxe in his 1566 History of the Turks of papal idolatry and profanation. He blamed the sins of the Roman church for the failure of the crusades. War against the infidel was laudable, but crusading based on doctrines of papal power and indulgences was not. This was true when directed against Christian religious dissidents, such as the Albigensian and Waldensians. Some Roman Catholic writers considered the crusades gave precedents for dealing with heretics. Both strands thought the crusaders were sincere and were increasingly uneasy in considering war a religious exercise instead of for territory. This secularisation was based on juristic ideas of just war that Lutherans, Calvinists and Roman Catholics could all subscribe. Roman Catholics diminished the role of Indulgences in tracts on the wars against the Turks. Alberico Gentili and Hugo Grotius developed secular international laws of war that discounted religion as a legitimate cause in contrast to popes, who persisted in issuing crusade bulls for generations."]}, {"page": "Sexual violence", "response": ["The European Middle Ages strongly reflected a patriarchal view of sexual violence. During times of peace, female spouses had no right to refuse sex with their husbands. Even though laws punishing rapes existed, sexual violence was usually considered as justified or inconsequential. Usually, depending on the elite's views, which perceived sexual violence as a minor issue, sexual violence was not prosecuted. This view was also transferred to the colonies. In Alta California, for example, the Catholic clergy relied heavily on corporal punishment such as flogging, placing in the stocks or shackling of Amerindian women within their programs of Christianization. Within this context of trying to restore a certain social order, women were often the victims of sexual violence if politically active and posing a threat to the existing order. With regard to times of war, jurists, writers and scholars argued that as soon as war is just, no boundaries would be set towards methods used in order to achieve victory. However, with Alberico Gentili (1552–1608) discussions started that suffering of women should be reduced and rape prohibited during peace and war times. However, this view was not accepted for a long time, as women and children not participating in the fighting were still considered as being the enemy and the patriarchal view on women prevailed during peace and war times."]}, {"page": "List of Renaissance figures", "response": ["* Alberico Gentili"]}, {"page": "Francisco de Vitoria", "response": ["Francisco de Vitoria  ( – 12 August 1546; also known as Francisco de Victoria) was a Spanish Roman Catholic philosopher, theologian, and jurist of Renaissance Spain. He is the founder of the tradition in philosophy known as the School of Salamanca, noted especially for his contributions to the theory of just war and international law. He has in the past been described by some scholars as one of the \"fathers of international law\", along with Alberico Gentili and Hugo Grotius, though contemporary academics have suggested that such a description is anachronistic, since the concept of international law did not truly develop until much later. American jurist Arthur Nussbaum noted Vitoria's influence on international law as it pertained to the right to trade overseas. Later this was interpreted as \"freedom of commerce\"."]}, {"page": "Frank Frost Abbott", "response": ["He also translated Alberico Gentili's Hispanicae Advocationis Libri Dvo (\"Two Books of Advocacy in the Service of Spain\")."]}, {"page": "Bartolus de Saxoferrato", "response": ["He influenced civilian writers such as Alberico Gentili and Richard Zouch."]}, {"page": "Alberic", "response": ["*Alberico Gentili (1552–1608), Italian lawyer"]}, {"page": "Scipione Gentili", "response": ["Scipione Gentili (; 1563 – August 7, 1616) was an Italian law professor and a legal writer. One of his six brothers was Alberico Gentili, one of the fathers of international law.", "While Alberico Gentili was, at least at the outset of his career, a staunch supporter of the traditional bartolist method of legal interpretation, Scipione was influenced by French jurists like Doneau and Jacques Cujas, who applied the methods of humanist philology to legal texts. Gentili's works, which fills eight quarto volumes in the 1763 edition, have not only legal writings but also wrote commentaries on St. Paul's Epistle to Philemon and on the Apologia of Lucius Apuleius as well as a translation into Latin of and Annotazioni (in Italian) on Torquato Tasso's epic Gerusalemme liberata. Among his legal works are two voluminous treatises De donationibus inter virum et uxorem (on donations between husband and wife, which were illegal and void under Roman law) and De jurisdictione (on jurisdiction). Gentili also edited the final part of Doneau's Commentarii de Iure Civili, thereby securing the completion of the influential work, which the author had not been able to finish before his death. Gentili rendered a similar service to his brother Alberico, whose Hispanica Advocatio he edited in 1613."]}, {"page": "St Helen's Church, Bishopsgate", "response": ["*Sir Alberico Gentili"]}, {"page": "History of international law", "response": ["* Alberico Gentili"]}, {"page": "New Inn Hall, Oxford", "response": ["As the Inns developed into teaching establishments, New Inn Hall became noted for its jurists such as Alberico Gentili, Regius Professor of Civil Law, Sir Daniel Donne, the first MP for Oxford University in Parliament and Dr John Budden, Regius Professor of Civil Law."]}, {"page": "San Ginesio", "response": ["*Former Convent of the Augustinians: It dates back to the 13th century, but the current buildings are from 1615 and later. The cloister contains frescoes with scenes from the life of Augustine, made between 1630 and 1640 by Domenico Malpiedi. The convent is home to the Institute of Higher Education Alberico Gentili.", "* Statue of Alberico Gentili: Statue made in bronze by the sculptor Giuseppe Guastalla in 1905. Located in the town square dedicated to him, like the statue, it stands in front of Corso Scipione Gentili."]}, {"page": "International law", "response": ["The Italian peninsula, divided among various city-states with complex and often fractious relationships, was subsequently an early incubator of international law theory. Jurist and law professor Bartolus da Saxoferrato (1313–1357), who was well versed in Roman and Byzantine law, contributed to the increasingly relevant area of \"conflicts of law\", which concerns disputes between private individuals and entities in different sovereign jurisdictions; he is thus considered the founder of private international law. Another Italian jurist and law professor, Baldus de Ubaldis (1327–1400), provided voluminous commentaries and compilations of Roman, ecclesiastical, and feudal law, thus creating an organized source of law that could be referenced by different nations. The most famous contributor from the region, Alberico Gentili (1552–1608), is considered a founder of international law, authoring one of the earliest works on the subject, De Legationibus Libri Tres, in 1585. He wrote several more books on various issues in international law, notably De jure belli libri tres (Three Books on the Law of War), which provided comprehensive commentary on the laws of war and treaties, thumb|Hugo Grotius' De jure belli ac pacis, is considered one of the foundational texts of international law. (Pictured is the title page from the second edition of 1631).", "The early positivist school emphasized the importance of custom and treaties as sources of international law. 16th-century Alberico Gentili used historical examples to posit that positive law (jus voluntarium) was determined by general consent. Cornelius van Bynkershoek asserted that the bases of international law were customs and treaties commonly consented to by various states, while John Jacob Moser emphasized the importance of state practice in international law. The positivism school narrowed the range of international practice that might qualify as law, favouring rationality over morality and ethics. The 1815 Congress of Vienna marked the formal recognition of the political and international legal system based on the conditions of Europe."]}, {"page": "Alberico Gentile", "response": ["#REDIRECT Alberico Gentili"]}, {"page": "Gentili", "response": ["* Alberico Gentili (1552–1608), Italian jurist"]}, {"page": "List of alumni of Jesus College, Oxford", "response": ["|Academic and translator who matriculated from Christ Church at the age of eight, graduated at the age of twelve and became a Fellow of All Souls at seventeen; eldest son of Alberico Gentili, the Italian jurist and Regius Professor of Civil Law"]}, {"page": "Regius Professor of Civil Law (Oxford)", "response": ["*1587–1608: Alberico GentiliAston, op. cit., pp. 360–361English Universities, Schools and Scholarship in the Sixteenth Century : Civil law at the universities at bartleby.com (accessed 22 February 2008)"]}, {"page": "Wartime sexual violence", "response": ["Rape and pillage were prohibited by some army codes as early as the 14th century because of the tendency to create strong hostility in civilian populations and the detrimental effects to army discipline.Inal, Tuba. Looting and Rape in Wartime: Law and Change in International Relations. United States: University of Pennsylvania Press, Incorporated, 2013. Despite early efforts to systematize the laws of war, rape continued to be a problem in the 15th and 16th centuries. The influential writer Francisco de Vitoria stood for a gradual emergence of the notion that glory or conquest were not necessarily acceptable reasons to start a war. The jurist Alberico Gentili insisted that all women, including female combatants, should be spared from sexual assault in wartime."]}]}}