{"wiki_id": "http://www.wikidata.org/entity/Q1443103", "itemLabel": "Frank Costin", "itemDescription": "Automotive engineer (1920-1995)", "wikipedia_url": "https://en.wikipedia.org/wiki/Frank_Costin", "wikipedia_page": {"main": "Francis Albert Costin (8 June 1920 – 5 February 1995) was a British automotive engineer who advanced monocoque chassis design and was instrumental in adapting aircraft aerodynamic knowledge for automobile use.", "link_mentions": [{"page": "Lotus Elite", "response": ["Advanced aerodynamics also contributed to the car's low drag coefficient of  considering the engineers did not enjoy the benefits of computer-aided design or wind tunnel testing. The original Elite drawings were by Peter Kirwan-Taylor. Frank Costin (brother of Mike, one of the co founders of Cosworth), at that time Chief Aerodynamic Engineer for the de Havilland Aircraft Company, contributed to the final design."]}, {"page": "Vanwall", "response": ["The new 1956 cars designed by Chapman (along with the aerodynamicist Frank Costin) were of space frame construction, the De Dion rear axle's unsprung weight reduced and front torsion bar added. (None of these ideas were revolutionary, but Chapman was happy simply to be meticulous.)Setright, L.J.K. \"Lotus: The Golden Mean\", in Northey, Volume 11, p.1230. Furthermore, a fifth gear and Porsche synchromesh were added to the transmission. The driving seat was placed above this and could not be reduced below  above the road, making the height very problematic  (the top of the driver's helmet was fully  from the road surface, while the vertically mounted engine made a reduction impractical in any case), and the handling was suspect despite Chapman's best efforts. The solution which today is obvious, mounting the engine behind the driver, would take two more years to be accepted. Costin made the most of it, and produced a car \"much faster in a straight line than any of its rivals\".Setright, p.2463."]}, {"page": "Marcos Engineering", "response": ["Marcos Engineering was a British sports car manufacturer. The name derives from the surnames of founders Jem Marsh and Frank Costin.", "Marcos was founded in Dolgellau, North Wales, in 1959, by Speedex cars' Jem Marsh with aerodynamicist Frank Costin. Costin had earlier worked on the de Havilland Mosquito fighter-bombers and from there he got the idea to use plywood for the chassis. The company moved to a converted mill in Bradford on Avon, Wiltshire, in 1963; in 1971 they relocated to a £125,000 purpose-built factory at nearby Westbury."]}, {"page": "March Engineering", "response": ["For the 1971 Formula One season March Engineering came up with the remarkable 711 chassis, which had aerodynamics by Frank Costin and an ovoid front wing described as the Spitfire (for its shape) or \"tea-tray\" (for its elevation from the car) wing. The car took no wins, but Peterson finished second on four occasions, ending as runner-up in the World Championship. Alfa Romeo V8 powered cars were occasionally entered, to little avail (following on from an equally unsuccessful Alfa program with McLaren)."]}, {"page": "Lister Motor Company", "response": ["thumb|The Lister-Chevrolet, designed by Frank Costin", "For 1959, Lister hired aerodynamicist Frank CostinSetright, p. 1204 who produced entirely new bodywork built around a new Chevrolet Corvette power plant.  However, the front-engine layout of the new Lister-Chevrolet was quickly eclipsed by the rear-engine layout of the new Cooper sports car.  By the end of 1959 Lister withdrew from competition although production of sports cars continued for customers."]}, {"page": "Weslake", "response": ["From the start of the Vanwall Motor racing team, Weslake worked as a consultant, initially developing a new head for the Ferrari engines used. During 1956, Weslake worked with Leo Kuzmicki, Colin Chapman and Frank Costin to develop a new Vanwall car, which Stirling Moss drove to a win in a non championship F1 race, and convinced him to join the team in 1957. The car would go onto win the first constructors championship title in 1958. Weslake would go on to work as a consultant for Coventry-Climax, by advising them on port design for their FPF engine that was used by Cooper and Lotus Formula One teams."]}, {"page": "Lotus 25", "response": ["An early brainchild of Chapman's fertile mind, the original sketches for the car were made on napkins while Chapman discussed his idea while dining out with Frank Costin (designer of Vanwall, Lotus Mk.8, 9, 10, 11 and Lotus 16 bodies, later of Marcos fame). The unveiling of the 25 at Zandvoort in 1962 was a shock for the competition, and particularly for teams like Brabham and UDT/Laystall who had recently purchased 24s from Lotus, with the understanding that they would be \"mechanically identical\" to the works cars - Chapman reserved the right to alter the bodywork of the cars."]}, {"page": "Unipower GT", "response": ["At Goodwood in 1963 Unger and Valerian Dare-Bryan talked about their shared views on car design. Dare-Bryan was a free-lance automotive designer who had previously worked at Lotus alongside Colin Chapman, and with aerodynamicist Frank Costin. In 1964 and 1965 Dare-Bryan designed the Attila series of racing sports cars for Racing Developments of North London. By the late 1960s he was running Roy Pierpoint's Ford Falcon team. Dare-Bryan partnered with Unger to handle mechanical development of Unger's concept."]}, {"page": "1967 24 Hours of Le Mans", "response": ["After bring the Mini-Marcos to Le Mans in 1966, this year Frank Costin came up with an unusual aerodynamic design for privateer racer Roger Nathan. With a plywood frame, fibreglass bodywork, it had a 1-litre Hillman Imp engine mounted at a 54° angle, putting out 97 bhp.Spurring 2010, p.263 And making up the class were the returning entries from CD-Peugeot, Marcos and Austin-Healey."]}, {"page": "TMC Costin", "response": ["Peter asked engineer and aerodynamicist Frank Costin to design the company's first automobile. In addition to designing the car itself, Costin was to develop the tooling and jigs needed to build it in exchange for a 10% royalty on each car sold. This design became Costin's Auto Project XXIV. Conceptually, it was intended to be an improvement on the Lotus Seven. It was also a further development of ideas Costin had explored in his earlier Marcos Xylon. It is described as the first road racing car built in Ireland."]}, {"page": "1963 24 Hours of Le Mans", "response": ["Austin-Healey had a new body designed by Frank Costin for their Sebring Sprite. The 1100cc BMC engine developed 95 bhp.Spurring 2010, p.131 Another British boutique sports-car manufacturer, Deep Sanderson, arrived with its new 301 prototype."]}, {"page": "1959 24 Hours of Le Mans", "response": ["With no Maseratis this year, the remaining five cars in the S-3000 category all had Jaguar-engines: Lister Engineering brought two of their new Frank Costin-designed cars (joined by Jaguar's former team manager, Lofty EnglandSpurring 2011, p.361), with another for the Equipe Nationale Belge, while the previously successful Ecurie Ecosse team this year entered both a Jaguar D-Type (for Masten Gregory and Innes Ireland) and a Tojeiro-Jaguar (for Ron Flockhart and Jock Lawrence)."]}, {"page": "1958 24 Hours of Le Mans", "response": ["After its success in the previous year, Lotus returned with four works cars and two private entries. It was only a month after Cliff Allison came sixth after the team's auspicious F1 début at the Monaco Grand Prix. For this race, they put at least one car in 4 classes. The new Lotus 15 was designed by Frank Costin and carried several Coventry-Climax engine options: a 2-litre, 1.5-litre or even 750cc (for the affiliated Equipe Lotus France privateer team). Colin Chapman also got Coventry Climax to develop a new 741cc engine based on their 650cc lightweight boat engine. Finally, there were also a pair of older Lotus 11 models to contest the S-1100 class"]}, {"page": "1957 24 Hours of Le Mans", "response": ["Maserati also turned up with confidence this year: Stirling Moss was now a Maserati works driver, and was to drive the coupé version (designed by Vanwall’s Frank Costin) of the 450S with French-American Harry Schell, while the spyder version was run by Jean Behra / André Simon. Its 4.5L V8 developed 420 bhp (being the biggest engine in this year’s race) although the cars still used big, obsolete drum brakes. Along with these were a 3.0L car and a pair of smaller 2.0L cars. Juan Manuel Fangio (who had won at Sebring with Behra in a 450 spyder) was present in the pit, as a ‘reserve driver’ to put concern in the opposition teams.Spurring 2011, p.294Moity 1974, p.66 "]}, {"page": "Maserati 450S", "response": ["4501 was later entered at the 1957 Buenos Aires 1,000 km driven by Stirling Moss and Juan Manuel Fangio. A clutch failure after a very promising start prevented the car from commencing the season with a win. The car was redesigned as a coupé by Frank Costin of England, constructed by Zagato, and raced once again by Moss at Le Mans where it failed to finish due to major design flaws. The car was restored by Medardo Fantuzzi of Maserati (given a new chassis number 4512); and subsequently received another restoration by Faralli & Mazzanti being converted into a road car.", "thumb|right|A 450S was converted to a coupe designed by Frank Costin with the body built by Zagato"]}, {"page": "Lotus Eleven", "response": ["The Eleven was designed by Colin Chapman and fitted with a sleek body designed by aerodynamicist Frank Costin. Its top version, dubbed Le Mans, was generally fitted with a 1100 cc (67ci) Coventry Climax FWA engine and occasionally with a 1500 cc (92ci)Setright, L.J.K, \"Lotus: The golden mean\", in Northey, Tom, ed. World of Automobiles (London: Orbis, 1974), Volume 11, p.1224. Coventry Climax FWB engine mounted in the front of a tubular space frame and featured a De Dion rear axle and Girling disc brakes. Fully loaded, the car weighed only about . Versions for a 1100 cc (67ci)Setright, p.1224. Climax engine (Club) and a 1172 cc (72ci) Ford engine (Sport) were also produced; both featured a live rear axle and drum brakes. Several cars were fitted with alternative engines by their owners, these included Coventry Climax 1500cc (92ci) FWB and FPF and 1200 cc (73ci) FWE, Maserati 150S 1500cc (92ci), DKW 1000cc (61ci) SAAB 850cc (52ci) and 750cc (46ci) engines. There were two main body styles: one with a headrest and the other with no headrest, just two small fins.  Some cars were later fitted with a closed body with gullwing doors to meet GT specifications."]}, {"page": "Panoz Roadster", "response": ["Panoz had purchased the rights to a frame designed by Frank Costin used in a defunct Irish sportscar called the TMC Costin. Panoz had Freeman Thomas design a new body for the car. Aluminum body panels were produced by Superform USA, resulting in bodywork both light and strong. Ford Mustang running gear, engine, and transmission were used, as was a solid rear axle and independent front suspension. A seven-man crew built the first ten cars, and other workers were added later to the production team. The Costin chassis was never put under a production car, instead the early Roadsters featured a TIG welded stainless steel tubing frame, and extensive use of CNC machined and stamped parts."]}, {"page": "Maserati Tipo 151", "response": ["The aluminium body was designed by Giulio Alfieri and refined using a wind tunnel at Milan University. It was reminiscent of the Frank Costin designed Zagato bodied 450S, but with an accentuated Kamm Tail. The mandatory doors opened halfway up the side due to the longitudinal tubes of the frame and the lateral fuel tanks. The chassis was designed by Giorgio Molinari while the suspension was designed by Gianpaolo Dallara who had recently joined Maserati."]}, {"page": "Jem Marsh", "response": ["Jeremy George Weston \"Jem\" Marsh (15 April 1930 – 2 March 2015) was a British engineer, motor manufacturer and race driver, born in Clifton, Bristol, England. He entered the motor industry through his company Speedex Castings and Accessories Ltd., based in Luton, that manufactured and sold tuning parts for Austin Sevens, based on Marsh's successful Speedex750 racing special. Marsh is perhaps best known as a co-founder of the sports-car manufacturer Marcos, the name being derived from a contraction of his and fellow founder Frank Costin's surnames. Founded in 1959, the company was continued by Jem's son Chris Marsh, until it was taken over by Canadian Tony Stellinga, and continued to produce automobiles until 2008 when it ceased production."]}, {"page": "Costin Sports Roadster", "response": ["The original Costin Cars were designed by the aerodynamicist Frank Costin. Costin had previous associations with Vanwall, Lotus, Maserati, and Dealer Team Vauxhall (DTV) for race car chassis designs. A modern design update of the original Costin Sports Roadster, was designed and hand sculpted full size in wood and plastic filler by William P. (Bill) Barranco in 1994 in London UK. In absit 1995, the first two (2) prototypes were built in the mid nineties with revised body styling but was not road registered until recently. In total 6 chassis were constructed and 2 bodies were produced from the FRP molds. The company Costin Ltd went into liquidation following unsuccessful attempts to find funding for the venture."]}, {"page": "Tony Vandervell", "response": ["In 1956 Vandervell drafted in Colin Chapman, Frank Costin and Harry Weslake on the engineering side. Even over the brief duration of his involvement with the sport, it was this ability to spot new talent that marked Vandervell out as one of the most successful and influential F1 team owners. The 1956 car, built fully in-house, took Vanwall's first major victory in the International Trophy early in the year, in the hands of Stirling Moss. Unfortunately, the rest of the season failed to live up to this early promise. Moss was joined by Tony Brooks for the 1957 Formula One season, and the pair shared Vanwall's first World Championship victory in the 1957 British Grand Prix. Moss took two further victories that season, laying a foundation for the team's zenith year: 1958."]}, {"page": "Eric Broadley", "response": ["Eric Broadley was indentured to a building company as a young man in the late 1940s,Diane Broadley and after completing his studies took a job as a quantity surveyor.Williams (2017) In his spare time Broadley was heavily involved in motor racing with the 750 Motor Club. In common with the majority of other competitors – including Colin Chapman, Frank Costin and Brian Hart – he built his own cars around Austin 7 chassis, using home-made and proprietary parts. His first car, the Broadley Special)Twite, Mike, \"Lola: A prolific racing builder\", in Northey, Tom, ed. World of Automobiles (London: Orbis, 1974), Volume 11, p.1213, calls her Lola Special. was built in 1956Twite, p.1213. to comply with rules governing the \"Ford Ten Special\" (or \"1172 Special\") class, using an 1172cc (72ci) side valve engine, originally introduced for the pre-war Ford Model C."]}, {"page": "Costin Amigo", "response": ["The Costin Amigo is a lightweight sports car built in the United Kingdom from 1970 to 1972. The Amigo was designed by Frank Costin and built by Costin Automotive Racing Products Ltd. The car's chassis was made of wood and plywood.", "Frank Costin was an engineer who started his career in aviation design and later moved into automobiles and auto racing. He is considered to have been one of the preeminent aerodynamicists of his time. In Costin's personal history of automotive designs, the Amigo was Auto Project XVIII. The name was chosen to denote a car that was driver friendly."]}, {"page": "Lotus Mark VIII", "response": ["The Lotus Mark VIII car was Colin Chapman’s first fully enclosed aerodynamic design.  Chapman's basic requirements for the design were for a car of 1100 lbs powered by an 85 bhp engine and a maximum speed of 125 mph. Work began on this design in late 1953 and Chapman was assisted in the design of the body by the aerodynamicist Frank Costin, who was the brother of Mike Costin, his main collaborator."]}, {"page": "750 Motor Club", "response": ["750 Motor Club is a motor racing club in the UK. It was founded in 1939 to promote the sporting use of the Austin 7. '750' refers to the near-750cc Austin 7 engine. It later led to racing and the 750 Formula where specials are raced. Famous members include Colin Chapman, Eric Broadley, Adrian Reynard, Arthur Mallock, Derek Bennett, Tony Southgate, Brian Hart, Gordon Murray, Jem Marsh, Frank Costin and Mike Pilbeam. These engineers and designers produced the first Lotus, Lola, Chevron, Speedex, Marcos, Pilbeam and other sports and racing cars between the 1940s and 1960s.  "]}, {"page": "Protos (constructor)", "response": ["The Protos was a wingless Formula 2 racing car that appeared in 1967. Powered by the then-standard Ford-Cosworth 1600cc FVA-engine, it was noticeable for its slippery aerodynamic Frank Costin design, with an almost-enclosed 'bubble' canopy over the cockpit and a chassis partially made of the very light but fragile plywood. Although fairly quick on fast tracks, it did not become a front runner and did not score wins during the European F2 season. Drivers included Brian Hart and Pedro Rodríguez."]}, {"page": "Lotus 16", "response": ["That the bodywork enclosing all of Chapman's innovative technology was similar in appearance to the Vanwall Grand Prix cars was no accident, as both cars had been sculpted by pioneer automotive aerodynamacist Frank Costin. As with many of Lotus's competition cars, the aluminium used to construct the bodywork was extremely thin and offered little in the way of support for the underlying chassis members. The car was extremely low and compact, with the bonnet barely reaching the same height as the tops of the front wheels, despite the smaller diameters used from the 1959 season onward. The driver sat in a slightly reclined position — nowhere near as extremely inclined as Chapman would later inflict upon his pilots but still unusual for its day — and behind the driver rose a stubby rear fin, incorporating the fuel tank."]}, {"page": "Mike Costin", "response": ["Mike Costin is the younger brother of Frank Costin, an aerodynamics and race car designer for Lotus, Lister and Maserati, and co-founder of Marcos Cars."]}, {"page": "Lotus 15", "response": ["The larger body of \"English rolled\" aluminum was also similar in appearance to the smaller and successful Lotus 11, with a major difference of a full-width windscreen, and the lower scuttle/screen height. Unlike the 11 which was designed by Frank Costin, the body design was a result of the collaboration between Chapman and the coachbuilder Williams & Pritchard.Mike Lawrence, The Coachbuilders Williams & Pritchard, Classic and Sportscar magazine, p.p. 82-88, March 1989. Interview with Len Pritchard."]}, {"page": "Costin", "response": ["*Frank Costin (1920–1995), British automotive engineer"]}, {"page": "Deaths in February 1995", "response": ["*Frank Costin, 74, British automotive engineer."]}, {"page": "Mike Beckwith", "response": ["The Brabham was replaced by a Gemini-DAF for 1967 and was slightly more successful with a win as well as other podium finishes. Four entries were also made by Bob Gerard using a Cooper T82. The same year, Beckwith participated in the Le Mans 24 hour race, competing in the P1.5 class using a Costin-Nathan GT, designed by Frank Costin and Roger Nathan. Co-driven by Nathan, the car retired after five hours with an electrical fault."]}, {"page": "Speedex", "response": ["Marsh went on to set up the Marcos Car Company with Frank Costin in 1962. The remaining Speedex bodies were purchased by Kew-based Cambridge Engineering who marketed the cars during 1962–3.https://www.allcarindex.com/production/united-kingdom/speedex/"]}, {"page": "Briggs Cunningham", "response": ["In 1959 Cunningham upgraded to the Lister-Costin, still Jaguar-powered but with revised bodywork by aerodynamicist Frank Costin. The result was another SCCA C Modified championship."]}]}}