{"wiki_id": "http://www.wikidata.org/entity/Q1441580", "itemLabel": "Francis J. Haverfield", "itemDescription": "British historian and archaeologist", "wikipedia_url": "https://en.wikipedia.org/wiki/Francis_J._Haverfield", "wikipedia_page": {"main": "Francis John Haverfield,  (8 November 1860 at Shipston-on-Stour – 1 October 1919) was an English ancient historian, archaeologist, and academic. From 1907 to 1919 he held the Camden Professorship of Ancient History at the University of Oxford.\n\n", "link_mentions": [{"page": "Shipston-on-Stour", "response": ["* Francis J. Haverfield - 19th-century archaeologist, born in Shipston. "]}, {"page": "1905 in archaeology", "response": ["* Francis J. Haverfield publishes \"The Romanization of Roman Britain\" in Proceedings of the British Academy."]}, {"page": "Ribchester", "response": ["A report on Roman remains at Ribchester was published by Francis J. Haverfield in Roman Britain in 1914: Haverfield, 1915"]}, {"page": "1860 in archaeology", "response": ["* November 8 - Francis J. Haverfield, English Romano-British archaeologist (d. 1919)."]}, {"page": "1919 in archaeology", "response": ["* 1 October: Francis J. Haverfield, English Romano-British archaeologist (born 1860)."]}, {"page": "F. Haverfield", "response": ["#REDIRECT Francis J. Haverfield"]}, {"page": "Haverfield", "response": ["#REDIRECT Francis J. Haverfield"]}, {"page": "Francis John Haverfield", "response": ["#REDIRECT Francis J. Haverfield"]}, {"page": "Port Way", "response": ["From Cottington Hill, the road takes on the heading of Quarley Hill, near the present Hampshire–Wiltshire border, passes through St Mary Bourne and crosses the Bourne Rivulet. Beyond St Mary Bourne, near Finkley and East Anton, Port Way was crossed by Margary route 43, the road from Venta Belgarum to Cunetio (Mildenhall) sometimes described as being part of the Icknield Way. Approximately  east of this crossroads was a mansio, the only significant settlement on the Port Way other than its termini. Hoare believed that this was the settlement of Vindomis, and the Ordnance Survey's 25 inch to the mile map of 1895 marks it as \"ROMAN STATION / Supposed to be VINDOMIS\". Charles Roach Smith wrote that the distance of Vindomis from Calleva Atrebatum given in the Antonine Itinerary –  – did not \"materially clash\" with the idea that Vindomis was the settlement at this intersection. Despite this, Francis J. Haverfield wrote in 1915 that \"there was no town or village at the crossing; so far as we know, there was not even a house at all\". Contrary to Hoare's belief that this was the site of Vindomis, the discovery of the Calleva Atrebatum to Noviomagus Reginorum (Chichester) road led to the consensus that the settlement was in the area of present-day Neatham near Alton. No later than the 1730s, John Horsley had suggested that Vindomis was in the vicinity of Farnham (some  from Neatham). If not Vindomis, the settlement at the East Anton crossroads may have been Leucomagus."]}, {"page": "Coria (Corbridge)", "response": ["Between 1906 and 1914, the site was excavated following a desire by the Northumberland County History Committee to assess the Roman remains at Corbridge ahead of a book on the history of the parish, overseen by Francis J. Haverfield. During that time, a number of scholars from Oxford University were sent by Haverfield to supervise local labourers tasked with the actual excavation, including J.P. Bushe-Fox and Leonard Woolley, making it one of the first training excavations in British archaeology. Brian Dobson later ran adult training excavations at Corbridge in the 1960s and 1970s."]}, {"page": "List of Old Wykehamists", "response": ["*  Francis J. Haverfield, historian of Roman BritainSabben-Clare, 1981. p. 187"]}, {"page": "List of Brasenose College, Oxford people", "response": ["* Francis J. Haverfield, British historian and archaeologist"]}, {"page": "Francis Haverfield", "response": ["#Redirect Francis J. Haverfield"]}, {"page": "Roman Inscriptions of Britain", "response": ["Roman Inscriptions of Britain is a 3-volume corpus of inscriptions found in Britain from the Roman period. It is an important reference work for all scholars of Roman Britain. This monumental work was initiated by Francis J. Haverfield, whose notebooks were bequeathed to the University of Oxford. The first volume, Inscriptions on Stone, was then edited by R.G. Collingwood and R.P. Wright with an addendum by R.S.O. Tomlin. It was first published in 1965, with a new edition in 1995."]}, {"page": "Christianity in Roman Britain", "response": ["In the early eighteenth century, archaeology began to develop as a discipline in Britain. A number of Romano-British Christian artefacts were discovered at this time, although their origins were not always recognised. In some cases items were recognised as being Romano-British, but not as Christian; in others they were recognised as being Christian, but not Romano-British. For example, the ploughing of a field in Risley, Derbyshire in 1729 revealed a lanx plate featuring a Chi-Rho symbol. It was investigated by the antiquarian William Stukeley, who noted its Christian symbolism but who thought that it had likely originated in France and been brought to England by fifteenth-century soldiers. In another instance, a Romano-British beaker decorated with Biblical scenes was discovered in a child's grave within the Anglo-Saxon cemetery at Long Wittenham, Oxfordshire during excavations led by John Yonge Akerman in the 1850s. Akerman regarded it as being early medieval and of Gaulish origin. The first attempt to synthesise archaeological and historical material to understand Romano-British Christianity was an academic paper published in the English Historical Review; written by Francis J. Haverfield in 1896, it remained little known among scholars."]}]}}