{"wiki_id": "http://www.wikidata.org/entity/Q1453055", "itemLabel": "Frederick W. Lanchester", "itemDescription": "British polymath", "wikipedia_url": "https://en.wikipedia.org/wiki/Frederick_W._Lanchester", "wikipedia_page": {"main": "Frederick William Lanchester LLD, Hon FRAeS, FRS (23 October 1868 – 8 March 1946), was an English polymath and engineer who made important contributions to automotive engineering and to aerodynamics, and co-invented the topic of operations research.\nLanchester became a pioneer British motor-car builder, a hobby which resulted in his developing a successful car company, and is considered one of the \"big three\" English car engineers - alongside Harry Ricardo and Henry Royce.", "link_mentions": [{"page": "Aerodynamics", "response": ["During the time of the first flights, Frederick W. Lanchester, Martin Kutta, and Nikolai Zhukovsky independently created theories that connected circulation of a fluid flow to lift. Kutta and Zhukovsky went on to develop a two-dimensional wing theory. Expanding upon the work of Lanchester, Ludwig Prandtl is credited with developing the mathematics behind thin-airfoil and lifting-line theories as well as work with boundary layers."]}, {"page": "Operations research", "response": ["* Frederick W. Lanchester"]}, {"page": "Local Heroes (British TV series)", "response": ["#*\t\tFrederick W. Lanchester: built the first all-British four-wheel petrol-driven car"]}, {"page": "Moseley", "response": ["*Frederick W. Lanchester, Pioneer of the motor car"]}, {"page": "Wingtip device", "response": ["The initial concept dates back to 1897, when English engineer Frederick W. Lanchester patented wing end-plates as a method for controlling wingtip vortices. In the United States, Scottish-born engineer William E. Somerville patented the first functional winglets in 1910. Somerville installed the devices on his early biplane and monoplane designs. Vincent Burnelli received US Patent no: 1,774,474 for his \"Airfoil Control Means\" on August 26, 1930."]}, {"page": "Lewis Fry Richardson", "response": ["* Frederick W. Lanchester"]}, {"page": "1868 in science", "response": ["* October 23 – Frederick W. Lanchester (died 1946), English automotive engineer."]}, {"page": "1946 in science", "response": ["* March 8 – Frederick W. Lanchester (born 1868), English automotive engineer."]}, {"page": "Lanchester", "response": ["*Frederick W. Lanchester (1868–1946), engineer who devised Lanchester's laws and founded Lanchester Motor Company"]}, {"page": "Nikolay Zhukovsky (scientist)", "response": ["He published a derivation for the maximum energy obtainable from a turbine in 1920, at the same time as German scientist Albert Betz.Gijs A.M. van Kuik, The Lanchester-Betz-Joukowsky Limit , Wind Energ. 2007; 10:289–291 This is known controversially as Betz's law, as this result was also derived by British scientist Frederick W. Lanchester. This is a famous example of Stigler's law of eponymy."]}, {"page": "Benz Velo", "response": ["Many British Inventors also used Benz's patents and automobiles as starting points for their own innovations. Frederick W. Lanchester, of Birmingham, built a four-wheeled petrol-driven automobile, similar to units previously designed by Benz, which had utilized an electric starter (an adaption first seen in the Benz Velo)."]}, {"page": "Frederick William Lanchester", "response": ["#REDIRECT Frederick W. Lanchester"]}, {"page": "Frederick W Lanchester", "response": ["#REDIRECT Frederick W. Lanchester"]}, {"page": "F W Lanchester", "response": ["#REDIRECT Frederick W. Lanchester"]}, {"page": "F. W. Lanchester", "response": ["#REDIRECT Frederick W. Lanchester"]}, {"page": "FW Lanchester", "response": ["#REDIRECT Frederick W. Lanchester"]}, {"page": "Frederik Lanchester", "response": ["#REDIRECT Frederick W. Lanchester"]}, {"page": "Balance shaft", "response": ["The balance shaft was invented and patented by British engineer Frederick W. Lanchester in 1907. It is most commonly used in inline-four and V6 engines used in automobiles and motorcycles."]}, {"page": "Phugoid", "response": ["The term \"phugoid\" was coined by Frederick W. Lanchester, the British aerodynamicist who first characterized the phenomenon. He derived the word from the Greek words  and  to mean \"flight-like\" but recognized the diminished appropriateness of the derivation given that  meant flight in the sense of \"escape\" (as in the word \"fugitive\") rather than vehicle flight.Frederick William Lanchester, Aerodonetics: Constituting the second volume of a complete work on aerial flight, (London, England: Archibald Constant Co. Ltd., 1908), p. viii and p. 348."]}, {"page": "List of English inventions and discoveries", "response": ["* 1902: Disc brakes patented by Frederick W. Lanchester (1868–1946)."]}, {"page": "Sidney Stringer Academy", "response": ["The inspiration of the house name is Frederick W. Lanchester and the house encourages the students to be passionate and driven in their studies as Lanchester was."]}, {"page": "Force concentration", "response": ["During the First World War Frederick W. Lanchester formulated Lanchester's laws that calculated that the combat power of a military force is the square of the number of members of that unit so that the advantage a larger force has is the difference of the squares of the two forces,Lanchester, F.W., \"Mathematics in Warfare\" in The World of Mathematics, Vol. 4 (1956) Ed. Newman, J.R., Simon and Schuster, 2138–2157 i.e."]}, {"page": "1946 in the United Kingdom", "response": ["* 8 March – Frederick W. Lanchester, automotive engineer (born 1868)"]}, {"page": "Betz's law", "response": ["British scientist Frederick W. Lanchester derived the same maximum in 1915. The leader of the Russian aerodynamic school, Nikolay Zhukowsky, also published the same result for an ideal wind turbine in 1920, the same year as Betz did.Gijs A. M. van Kuik, The Lanchester–Betz–Joukowsky Limit. , Wind Energ. 2007; 10:289–291. It is thus an example of Stigler's law, which posits that no scientific discovery is named after its actual discoverer."]}, {"page": "Daniel Guggenheim Medal", "response": ["| align=\"center\" | Frederick W. Lanchester", "| align=\"center\" | Frederick W. Lanchester - 1931 Medalist"]}, {"page": "Frederick Lanchester", "response": ["#REDIRECT Frederick W. Lanchester"]}, {"page": "1868 in the United Kingdom", "response": ["** Frederick W. Lanchester, automotive engineer (died 1946)"]}, {"page": "List of blue plaques", "response": ["| Frederick W. Lanchester"]}, {"page": "Lifting-line theory", "response": ["The theory was expressed independently by Frederick W. Lanchester in 1907, and by Ludwig Prandtl in 1918–1919 after working with Albert Betz and Max Munk."]}]}}