{"wiki_id": "http://www.wikidata.org/entity/Q1452917", "itemLabel": "Frederick Irwin", "itemDescription": "British military officer", "wikipedia_url": "https://en.wikipedia.org/wiki/Frederick_Irwin", "wikipedia_page": {"main": "Lieutenant-Colonel Frederick Chidley Irwin, KH (22 March 1794 – 31 March 1860) was acting Governor of Western Australia from 1847 to 1848.\nBorn in 1794 in Drogheda, Ireland, Frederick Chidley Irwin was the son of Reverend James Irwin. Some sources give the year 1788 as his birthyear. In 1808, he was commissioned into the 83rd (County of Dublin) Regiment of Foot. He saw service in Spain and Portugal, and took part in several major battles of the Peninsula War, for which he was awarded a medal. In 1816-17 he was stationed in Cape of Good Hope, and later in Ceylon.In 1828, the British government decided to establish a colony on the western coast of Australia, and a cousin of Irwin's, James Stirling, was appointed its first Lieutenant-Governor.  Irwin was subsequently sent to the colony as a major in command of a detachment of the 63rd Regiment of Foot, whose mission was to protect and help establish the colony.  He arrived with his men on board HMS Sulphur in June 1829, six days after the arrival of the first settlers and Stirling on the Parmelia.Irwin's position as officer commanding the troops afforded him the further position of vice chairman of the Legislative Council appointed by Stirling in January 1831. From September 1832 until September 1833, Irwin was temporarily appointed to act as administrator of the colony while Stirling was in England.During Irwin's period in charge the colony experienced difficulty in its relations with the Aboriginal people, and both colonists and Aboriginals were killed in different encounters such as the Pinjarra Massacre. After the killing of several settlers Irwin placed a bounty on the heads of the most aggressive Noongar warriors, including Yagan and Midgegooroo.  This was to be among the most controversial of Irwin's initiatives during his tenure in the Swan River Colony. According to his account, immediately after a series of skirmishes Irwin conferred with his Executive Council 'to take such steps for a prompt and summary retaliation, as the means at my disposal admitted.' A proclamation was issued and published in the Perth Gazette offering a reward of 30 pounds for the capture 'dead or alive' of Yagan, and 20 pounds of 'Midgigooroo' and Munday. The proclamation declared Yagan, Midgegooroo and Munday to be outlaws 'deprived of the protection of British laws, and I do hereby authorize and command all and every His Majesty's subjects residents in any part of this colony to capture, or aid or assist in capturing the body of the said 'Egan' DEAD OR ALIVE, and to produce the said body forthwith before the nearest Justice of the Peace.'  Frederick Irwin rationalized his actions to the Secretary of State in the following terms: This pecuniary stimulus has had the hoped for effect, by bringing forward some efficient volunteers among the Settlers whose ----- and occupations have necessarily given them a more intimate knowledge of the haunts of the natives in the neighbourhood of the settled district than is possessed by the Military, but no volunteers have received permission to act unless headed by a Magistrate or a Constable. Parties of the Military have also been in constant movement, traversing the bush is such directions as reports or conjecture rendered most likely to lead to a discovery of the lurking place of the offending tribes. These parties have all received express instructions to attempt the lives of no other than the three outlaws, unless hostility on the part of others of the tribe should render it necessary in self defense. I am happy to say these measures have already been attended with considerable effect. The whole of this hostile tribe have been harassed by the constant succession of parties sent against them, and in some instances have been hotly pursued to a considerable distance in different directions.\nBy the time Irwin's dispatch had been received in London, Midgegooroo had been captured and executed. Despite his efforts to convince his superiors that his actions were justified, Irwin was criticized by the Secretary of State, who would have preferred a sentence of imprisonment, believing that execution would do little to improve relationships between the traditional owners and the colonists. But as Irwin intended, the search for Midgegooroo, Yagan and Munday proceeded quickly as the military and private settlers combed the region. One volunteer party led by a colonist named Thomas Hunt (according to G.F. Moore, 'a most appropriate name' who had previously been a constable in London) headed south 'in the direction of the Murray' and came across a number of 'native huts' not far from the south shore of the Swan. They 'routed' the Aboriginal people there, and pursued a group south, shooting and killing one man who was believed to be the brother of Midgegooroo and according to Moore, bringing his ears home 'as a token.' According to the Perth Gazette, throughout the period immediately after the proclamation, Midgegooroo remained near the property of the Drummonds on the Helena River 'employed as he usually had been of late in taking care of the women and children of the tribe' and clearly unaware of his outlaw status and his impending doom. On Thursday 16 May, a military party led by Captain Ellis, acting on information that Midgegooroo was in the area, joined forces with a number of civilians, including Thomas Hardey and J. Hancock. After camping overnight, the next morning they came across Midgegooroo and his young son: The old man finding a retreat impossible, became desperate; Jeffers, a private of the 63rd ... rushed forward and seized him by the hair, Captain Ellis seized his spears and broke them in his hand, he still retained the barbed ends, with which he struck at Jeffers repeatedly; the alarm he created by crying out for Yagan, and the apprehensions of his escaping, required the exercise of the greatest firmness on the part of Captain Ellis to accomplish his being brought in alive. The capture of this man as effected in a masterly manner, and redounds highly to the credit of Captain Ellis. ... Midgegooroo in his dungeon presents a most pitiable object. In the same issue, the Perth Gazette went on to invite citizens to 'forward the ends of justice' by coming forward with their evidence of Midgegooroo's wrongdoings, indicative of the close relationship between the early colonial media, the Government and the nascent system of justice. The Perth Gazette constitutes one of the principle records of the events over the next few days, and it is difficult to be definite about the chronological sequence between Midgegooroo's capture on 17 May and execution on the 22nd. It appears likely that Irwin spent the period weighing up his alternatives, consulting with the Executive Council as well as men such as G.F. Moore who, as well as being a private colonist, held the official post of Commissioner of the Civil Court. On Monday 20 May, Moore records a meeting with Irwin and hints that his personal view was that Midgegooroo should be transported but there was a strong public sentiment that he should be executed; 'there is a great puzzle to know what to do with him. The populace cry loudly for his blood, but it is a hard thing to shoot him in cold blood. There is a strong intention of sending him into perpetual banishment in some out of the way place.' Irwin told the Secretary of State he had conducted a 'patient examination' and had received statements from 'several credible witnesses', twelve-year-old Ralph Entwhistle, John Staunton of the 63rd Regiment of Foot, Charles Bourne, constable Thomas Hunt, James Lacey, Thomas Yule (sworn before Magistrates at Fremantle) and John Ellis. Each gave brief details of Midgegooroo's alleged crimes, and identified the prisoner as the same man. Irwin reported that he gave 'much anxious consideration' to Midgegooroo's punishment: \"The experiment of confinement, which had been tried to some extent in the case of the three Natives whose transportation to Carnac Island and ultimate escape I have reported to your Lordship in a former dispatch appeared to have produced no good effect on the subjects of that trial, and the age of the prisoner in question apparently exceeding fifty years, forbad any sanguine hopes from such an experiment in his case.\" \nThere was no trial, even in the sense of an informal hearing. Midgegooroo was clearly not allowed the opportunity to give evidence or defend himself and indeed it is probable that he did not understand what was being alleged.\nBy 22 May, Irwin had made up his mind: \"With the unanimous advice of the Council, I therefore decided on his execution as the only sure mode of securing the Colony from an enemy, who was doubly dangerous from his apparently implacable hostility and from his influence as an acknowledged Chief. The latter circumstance being also calculated to render his death a more striking example.\" The Perth Gazette recorded the execution as follows: \"In the absence of a Sherriff, the warrant was directed to the Magistrates of the District of Perth, the duty therefore devolved upon J. Morgan Esq., as Government Resident, who immediately proceeded to carry the sentence into execution. The death warrant was read aloud to the persons assembled who immediately afterwards went inside the Jail, with the Constables and the necessary attendants, to prepare the Prisoner for his fate. Midgegooroo, on seeing that preparations were making [sic.] to punish him, yelled and struggled most violently to escape. These efforts availed him little, in less than five minutes he was pinioned and blindfolded, and bound to the outer door of the Jail. The Resident then reported to his Honor the Lieutenant Governor (who was on the spot accompanied by the Members of the Council), that all was prepared, – the warrant being declared final – he turned around and gave the signal to the party of the 63rd [which had volunteered] to advance and halt at 6 paces, – they then fired – and Midgegooroo fell. – The whole arrangement and execution after the death warrant had been handed over to the Civil Authorities, did not occupy half an hour.\" \nIrwin reported simply: 'He was accordingly shot, in front of the jail at Perth on the 22 Ultimo.' Moore also recorded the execution although it is not clear whether he was a witness: 'The native Midgegoroo, after being fully identified as being a principal in 3 murders at least, was fastened to the gaol door & fired on by a Military party, receiving 3 balls in his head, one in his body.' According to the Perth Gazette, the execution was witnessed by a 'great number of persons ... although the Execution was sudden and the hour unknown.' \"The feeling which was generally expressed was that of satisfaction at what had taken place, and in some instances loud and vehement exaltation, which the solemnity of the scene, – a fellow human being – although a native – launched into eternity – ought to have suppressed.\"\nThe aftermath it appears from the extant record that, while there was a crowd in attendance at the execution, few if any Aboriginal people were present. The boy who was captured along with Midgegooroo, who was identified as his son 'Billy' (later referred to also as 'young Midgegooroo') was estimated to be between five and eight years old. He was removed 'out of sound and hearing of what was to happen to his father and has since been forwarded to the Government Schooner, Ellen, now lying off Garden Island, with particular instructions from the Magistrates to ensure him every protection and kind treatment.' Irwin informed the Secretary of State that 'the child has been kept in ignorance of his father's fate, and it is my present intention to retain him in confinement, and by kind treatment I am in hope from his tender age he may be so inured to civilized habits as to make it improbable he will revert to a barbarous life when grown up.' The Noongar population appears to have remained unaware of Midgegooroo's fate, possibly to ensure that the news would not reach the feared Yagan. Four days after the execution, G. F. Moore recorded an encounter with Yagan near his homestead when he arrived with Munday, Migo and seven others, possibly with the aim of finding out from Moore what had happened to his father. Moore, caught by surprise, decided to conceal the truth from Yagan, whereupon Yagan told him that if Midgegooroo's life was taken, he would retaliate by killing three white men. Six days later, it appears that news of the killing had still not penetrated the Noongar community for, when Moore was visited on 2 June by Weeip, Yagan's son Narral, and some women, they asked him again about Midgegooroo and his young son. Moore again concealed the execution but assured them that his son 'would come back again by & bye.' Two days later, Moore recorded that thefts of sheep and goats continued on the Canning River, and expressed his despair at the prospects for a people in whom he felt 'a very great interest': 'These things are very dispiriting. I fear it must come to an act of extermination between us at last if we cannot graze our flocks in safety.' It was not until 11 July that the colonists succeeded in killing Yagan, his death at the hands of sixteen-year-old James Keats on the Upper Swan, who duly collected his reward and left the colony.\nThe Perth Gazette recorded its satisfaction at the deaths and believed that most of the citizenry supported the ruthless actions of the Government. Midgegooroo's execution, it claimed, met with 'general satisfaction ... his name has long rung in our ears, associated with every enormity committed by the natives; we therefore join cordially in commending this prompt and decisive measure.' On the other hand, it is clear that a number of colonists were unhappy with the actions of the government. Robert Lyon, who published his account of the period in 1839 after he had left the colony, wrote that while the killing of Midgegooroo and Yagan was 'applauded by a certain class', they were 'far from being universally approved. Many were silent, but some of the most respectable of the settlers loudly expressed their disapprobation.' There was criticism also from other Australian colonies about the execution of Midgegooroo. The Hobart Town Review of 20 August 1833 was full of vitriol for Irwin's actions: \"It is hard to conceive any offence on the part of the poor unfortunate wretch that could justify the putting him to death, even in the open field, but to slay him in cool blood to us appears a cruel murder without palliation.\"\nIrwin, however, was convinced that his actions were merited. Writing in England about two years after the events of 1833, he asserted that 'these acts of justice so completely succeeded in their object of intimidating the natives on the Swan and Canning Rivers that recent accounts from the colony represent the shepherds and others in the habit of going about the country, as having for a considerable laid aside their usual precaution of carrying firearms, so peaceable had the conduct of those tribes become.'\nIn September 1833, after more than four years in Western Australia,[1] Irwin returned to England, partly to give an account to the Colonial Office of the events that had occurred in the colony while it was under his charge.[2]  While there, he published The State and Position of Western Australia, the first published account of the colony. He also sought religious assistance for the colony, resulting in the arrival of the colony's first missionary, Louis Giustiniani, in 1836. He married his wife Elizabeth Courthope, sister of auditor-general of Western Australia in December 1836.[3] In 1837, having been promoted to Major, he returned to Western Australia, and was made permanent Commandant of the Western Australian Forces.  He was further promoted to Lieutenant-Colonel in 1845.\nOn the death of Governor Andrew Clarke in February 1847, Irwin took office as acting Governor until the arrival of the new governor, Charles Fitzgerald, in August 1848. His administration was extremely unpopular with the settlers of Western Australia, due to both the poor financial state of the colony and his stern character, and the arrival of Fitzgerald was widely celebrated. Irwin retired from the army in 1854 and returned to England in 1856, where he died in Cheltenham in 1860.\nIn 1839 the explorer George Grey named the Irwin River after him while on his second disastrous exploration expedition along the Western Australian coast.\nIn 1948 the Irwin Army Barracks in Karrakatta were named after him, in recognition of his place in Western Australia's military history.\nIn 1991 the Frederick Irwin Anglican School was opened and named in honour of his contributions to Western Australia.", "link_mentions": [{"page": "Enniskillen", "response": ["* Frederick Irwin, (Lieutenant-Colonel) (1788 – 31 March 1860) was acting Governor of Western Australia from 1847 to 1848"]}, {"page": "James Stirling (Royal Navy officer)", "response": ["On 31 December Murray wrote to Stirling confirming his title as Lieutenant-Governor of the new colony and on the same day his Under-Secretary, Robert Hay, confirmed the appointment of the members of the civil establishment including Colonial Secretary Peter Brown, Surveyor-General John Septimus Roe, Harbourmaster Mark John Currie, naturalist James Drummond, a surgeon, a storekeeper, a cooper, a blacksmith and a boatbuilder.  After hectic preparations, on 6 February 1829 these pioneers, with their assistants, families, servants and livestock, departed Plymouth in the Parmelia under Captain J H Luscombe out of Spithead in company with the Sulphur, carrying 100 men of the 63rd Regiment of Foot, under the command of Major Frederick Irwin, and three years' of army stores, 10,000 bricks and £1,000 to meet all expenses of government."]}, {"page": "Yagan", "response": ["For the killing of the Velvicks, the Lieutenant-Governor Frederick Irwin declared Yagan, Midgegooroo and Munday to be outlaws, offering rewards of £20 each for the capture of Midgegooroo and Munday, and a reward of £30 for Yagan's capture, dead or alive. Munday successfully appealed against his proscription. Midgegooroo, Yagan and their group immediately moved from their territory north towards the Helena Valley. On 17 May, Midgegooroo was captured on the Helena River. After a brief, informal trial, he was executed by firing squad. Yagan remained at large for over two months."]}, {"page": "Governor of Western Australia", "response": ["| Lieutenant Colonel Frederick Irwin (acting Governor)"]}, {"page": "List of colonial governors in 1847", "response": ["*# Lieutenant-Colonel Frederick Irwin, Acting Governor of Western Australia (1847–1848)"]}, {"page": "List of colonial governors in 1848", "response": ["*# Lieutenant-Colonel Frederick Irwin, Acting Governor of Western Australia (1847–1848)"]}, {"page": "George Fletcher Moore", "response": ["Under the acting governorship of Frederick Irwin, Moore's popularity waned further.  The government of Irwin and Moore was extremely unpopular; Battye (1924) writes \"every administrative act was viewed with suspicion. ... Long years of depression and struggle had made the colonists pessimistic, and ... they threw the blame on the Government of the day.\"  The eventual appointments of Madden and the new governor, Charles Fitzgerald, left Moore with almost no influence in the new government."]}, {"page": "Royal Guelphic Order", "response": ["* Frederick Irwin"]}, {"page": "Parkhurst apprentices", "response": ["Parkhurst apprentices were employed by a broad cross-section of Western Australia's businessmen and officials, including many of the colony's ruling class.  Among the long list of Parkhurst apprentice employers were Governor Andrew Clarke, Frederick Irwin, George Fletcher Moore, Anthony O'Grady Lefroy, William Locke Brockman, Thomas Brown, George Walpole Leake, Walter Padbury, Stephen Stanley Parker, Rosendo Salvado Thomas Peel JR and George Shenton Sr."]}, {"page": "Convict era of Western Australia", "response": ["For the first fifteen years, the people of the colony were generally opposed to accepting convicts, although the idea was in constant circulation almost from the start. Early in 1831, the Colonel Peter Latour asked permission to transport 300 Swing Riots convicts, but was refused. Nonetheless, the idea was under discussion later that year, with the Fremantle Observer editorialising on the need for convict labour,. Republished by Fremantle Arts Centre Press in 1991. . and George Fletcher Moore writing in his diary: Facsimile edition published in 1978 by Nedlands, Western Australia: University of Western Australia Press.  In 1834, Captain Frederick Irwin suggested that the colony take in some Indian convicts for use as labour for the construction of public works. Towards the end of that year, a meeting of settlers at King George Sound passed a motion, signed by sixteen persons, that convict labour was needed for land clearing and road works, but this was met with little support in other parts of the colony. Three years later, a similar motion was considered but defeated by the Western Australian Agricultural Society."]}, {"page": "1788 in Australia", "response": ["** Frederick Irwin, acting Governor of Western Australia (d. 1860)"]}, {"page": "The Causeway", "response": ["A committee was set up in October 1838 to investigate the viability of a causeway at the site. On 16 February 1839 plans which had been prepared by Roe were submitted by the committee's chairman to Henry Trigg, the Superintendent of Public Works. Trigg called for other plans and prepared estimates. At a meeting of the committee on 27 February 1839, Trigg submitted a plan designed by Major Frederick Irwin, which was estimated to cost £2,300. The committee cut the estimated figure to £1,800, and waited for Governor Hutt to specify how much could be funded by the government.Cygnet, p. 7"]}, {"page": "The Foundation of Perth 1829", "response": ["Other people depicted in the work include Lieutenant Governor James Stirling, Captain Charles Fremantle, Commander Mark John Currie, Major Frederick Irwin, Captain William Dance, the Colonial Secretary Peter Broun, Dr William Milligan and the Surveyor-General Lieutenant John Septimus Roe. Milligan, however, may not actually have been at the ceremony. While some records claim that Milligan arrived aboard  on 8 June 1829, others claim that he emigrated to Western Australia with his wife, child and a nephew, arriving aboard  on 30 January 1830. If Milligan arrived on 30 January 1830, more than five months after the foundation ceremony, he cannot have been present."]}, {"page": "Midgegooroo", "response": ["Midgegooroo was executed by firing squad and without trial under the authority of Lieutenant Governor Frederick Irwin in 1833.", "Nothing is known of Midgegooroo's life prior to the arrival of white settlers in 1829. At that time, Midgegooroo was the leader of his home country, Beeliar, which stretched  from the Indian Ocean to the Canning River, south of the Swan River. Robert Menli Lyon reported that the northernmost land in Beeliar adjoined \"Melville Water and the Canning\",Perth Gazette, 23 March 1833; 13 April 1833  and was bordered \"by the mountains on the east; by the sea on the west; and by a line, due east, from Mangles Bay, on the south\". Midgegooroo's main camp (\"headquarters\") was a place known as \"Mendyarrup, situated somewhere in Gaudoo\", suggesting that it was in the vicinity of Blackwall Reach and Point Walter.Robert Menli Lyon may have acquired most of this information from Yagan rather than Midgegooroo. In 1832, Lyon had intervened on behalf of Yagan and two of his countrymen, Domera and Ningina who had been captured and awaited sentence for spearing a colonist William Gaze in June. Lyon persuaded Lieutenant-Governor Frederick Irwin to allow him to accompany the three prisoners to Carnac Island to \"acquire a knowledge of their language and prevent that frightful state of things in which the deliberate shedding of blood will involve the settlement\". For a month, Lyon and the three Aboriginal men were alone on the island, during which time they taught him about the language and society of the people of the Swan River region, including the names of places.Bevan Carter Nyungah Land, p. 33Perth Gazette 23 March 1833; 13 April 1833 However, Midgegooroo's family had some rights to use resources on a large part of what is now metropolitan Perth, and were able to move freely about an even larger area, presumably due to kinship ties with neighbours. For example, he was seen on some occasions as far afield as near Lake Monger and the Helena River.", "In May 1832, Yagan was arrested for the murder of William Gaze on the Canning River, an incident that lead to his declaration as an outlaw, imprisonment on Carnac Island with Lyon, and subsequent escape. In March 1833, a number of Noongar men from King George's Sound visited Perth at the instigation of the Government. This was the second visit of King George's Sound people that year, apparently for the purpose of encouraging \"amicable relationships on the Swan like those at the Sound\".Hallam and Tilbrook, p. 334. See also Tiffany Shellam's detailed account of this episode in 2009 Shaking Hands on the Fringe, University of WA Press. Yagan and ten of his countrymen had met the first visitors at Lake Monger and, when the next group arrived, he was keen to present a corroboree for them in Perth before an \"overflowing audience\", which included the Lieutenant Governor Frederick Irwin.Stirling was absent from the colony at this time, in England. Yagan acted as \"master of ceremonies, and acquitted himself with infinite dignity and grace\".Perth Gazette, 16 May 1833  Although Yagan's group was referred to as \"Midgegooroo's group\", it is unclear whether the old man also attended.", "Frederick Irwin described the episode in his dispatch to the Secretary of State for Colonies:", "Frederick Irwin rationalized his actions to the Secretary of State in the following terms:"]}, {"page": "HMS Sulphur (1826)", "response": ["Sulphur was launched in 1826, and in 1829 carried Lieutenant-Colonel Frederick Irwin, officers, passengers and a detachment of troops from the 63rd Regiment of Foot to the Swan River Colony. On 23 July 1830 boats and men from  and Sulphur pulled  off the Parmelia Reef near the Swan River. Medina had grounded while delivering immigrants."]}, {"page": "Members of the Western Australian Legislative Council, 1832–1870", "response": ["|rowspan=\"14\"|Frederick Irwin80px"]}]}}