{"wiki_id": "http://www.wikidata.org/entity/Q14565913", "itemLabel": "Nicole Barber-Lane", "itemDescription": "British actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Nicole_Barber-Lane", "wikipedia_page": {"main": "Nicole Barber-Lane is a British actress known for playing Myra McQueen in the long-running teen soap Hollyoaks.", "link_mentions": [{"page": "List of former Hollyoaks characters", "response": ["| Myra McQueen || Nicole Barber-Lane || 2006–2019"]}, {"page": "Jack Osborne", "response": ["Jack's mother, Aggie, walked out on him and his brothers, Kenneth and Billy Brodie (Clive Russell), when they were young; his father died on Christmas Eve. Jack became a police officer in the 1980s and arrested Martin Brownlow, who later died in prison. Martin was the former love interest of Myra McQueen (Nicole Barber-Lane) and father to Niall Rafferty (Barry Sloane). Jack had an affair with Sandy Roscoe (Gillian Taylforth), which resulted in the birth of his son Darren Osborne (Ashley Taylor Dawson), and also cheated with 16-year-old Dawn Cunningham (Lisa Williamson), who then gave birth to his daughter, Bethany (Danielle Calvert)."]}, {"page": "Mandy Richardson", "response": ["Warren ends his affair with Mandy, who, devastated, tells Louise the truth. After slapping Mandy, Louise tells her that Warren had murdered her previous husband, Sean Kennedy (Matthew Jay Lewis). A shocked Mandy reluctantly agrees to set Warren up before stealing his money. However, unknown to Mandy, Louise plots to kill Warren and frame her. On the wedding day, CCTV footage of Warren and Mandy is shown to the wedding guests by Jacqui and Myra McQueen (Nicole Barber-Lane). Warren finds the gun Louise had planned to kill him with, resulting in him confronting and then suffocating her. Mandy decides to leave the village once more with Tony. Tony and Mandy go travelling, deciding to give their relationship another go. However, when Mandy tells Tony that she may not be able to have children of her own anymore, he is upset and returns to Hollyoaks, leaving Mandy stranded in a foreign country."]}, {"page": "The British Soap Awards", "response": ["| \"Best Comedy Performance\"Presented by Tommy Cannon and Bobby Ball|| Patti Clare (Mary Taylor in Coronation Street) || Ian Kelsey (Howard Bellamy in Doctors)Ricky Norwood (Fatboy in EastEnders)Dominic Brunt (Paddy Kirk in Emmerdale)Nicole Barber-Lane (Myra McQueen in Hollyoaks)", "| \"Best Comedy Performance\"Presented by Rebecca Front|| Dolly-Rose Campbell (Gemma Winter in Coronation Street) || Elisabeth Dermot Walsh (Zara Carmichael in Doctors)Tameka Empson (Kim Fox-Hubbard in EastEnders)Dominic Brunt (Paddy Kirk in Emmerdale)Nicole Barber-Lane (Myra McQueen in Hollyoaks)", "| \"Best Comedy Performance\"Presented by Sherrie Hewson and Tony Maudsley|| Ian Midlane (Al Haskey in Doctors) || Louiza Patikas (Moira Pollock in Coronation Street)Nitin Ganatra (Masood Ahmed in EastEnders)Sally Dexter (Faith Dingle in Emmerdale)Nicole Barber-Lane (Myra McQueen in Hollyoaks)"]}, {"page": "Jon Christos", "response": ["in October 2015 a Star Ball at the Hilton hotel Deansgate with guests including  Jorgie Porter Nicole Barber-Lane Tricia Penrose and Ray Quinn saw Christos appear as a surprise singing waiter. He also formed the duo to be known as Il Destino (Classical Crossover Duo) with musical theatre performer Adam Lacey."]}, {"page": "Tina Reilly", "response": ["Tina was born to Myra McQueen (Nicole Barber-Lane) following a one-night stand with a bingo caller called Marvin. Myra fell in love with Marvin, but after telling him she was pregnant with Tina, he gave her money to abort the child. Myra, however, did not use the money for an abortion and told Marvin she was keeping the baby. After this, Myra never heard from him again. She then gave birth to Tina, who she named after Tina Turner. In order to make Tina believe her father cared for her, Myra sent her birthday cards from Marvin every year, until Tina discovered the truth."]}, {"page": "Carmel McQueen", "response": ["Carmel is the fifth child of Myra McQueen (Nicole Barber-Lane), and eldest child of Ricky Bowen (Simon Cassidy). Carmel grew up alongside her older half-sisters, Jacqui (Claire Cooper), Mercedes (Jennifer Metcalfe) and Tina (Leah Hackett) and younger siblings, John Paul (James Sutton) and Michaela (Hollie-Jay Bowes). Carmel follows the Catholic religion. Darren Osborne (Ashley Taylor Dawson) notices Carmel's singing talents and gets her to perform for customers in the SU bar. She does so but is unaware that the audience expect an explicit performance. Mercedes discovers this and warns Carmel, who is determined to continue. After the deaths of Mel (Cassie Powney) and Sophie Burton (Connie Powney), Carmel begins working at Evissa. Carmel finds and steals money from Jacqui for breast implants, unaware the money is her criminal acquaintance's. Carmel is attracted to Jake Dean (Kevin Sacre) in Evissa and the pair go out for a meal, however the date is cut short when Jake's ex-wife Becca (Ali Bastian) arrives with fiancé Justin Burton (Chris Fountain) for a meal. During a confrontation, Carmel feels ignored and decides to leave."]}, {"page": "Myra McQueen", "response": ["Myra McQueen is a fictional character from the British Channel 4 soap opera Hollyoaks, played by Nicole Barber-Lane. She made her first screen appearance during the episode originally broadcast on 19 June 2006 and was introduced by producer Bryan Kirkwood as part of the McQueen family. The character is initially designed to play a supporting role in her family's stories. She is characterised as a no-nonsense matriarch who is \"fiercely protective\" of her family and puts her children first. Myra has a series of failed relationship, leading to her many children. One of her early stories introduces Niall Rafferty (Barry Sloane), Myra's abandoned son who returns for revenge on his mother. The story concludes in a stunt when Niall explodes a church, killing Myra's daughter Tina Reilly (Leah Hackett). Barber-Lane left the soap in 2013 and Myra fakes her death after being shot. "]}, {"page": "Mercedes McQueen", "response": ["Mercedes and Riley become engaged. Riley's brother Seth Costello (Miles Higson) discovered that she and his father had an affair, so she lied about falling pregnant to prevent the truth from coming out. On the advice from her mother Myra McQueen (Nicole Barber-Lane), Mercedes planned to fake a miscarriage, but Mercedes' sister Jacqui discovered the affair and Mercedes' intention to fake a miscarriage. Jacqui was \"disgusted\" and threatened to expose the affair; Metcalfe commented that this left Mercedes feeling like her \"world could collapse around her at any moment\". \"On eggshells\" after Jacqui's discovery, Mercedes believed Jacqui would expose the affair. Metcalfe described Jacqui's attitude towards Mercedes, stating, \"Jacqui knows what Mercedes is, she knows what she's like – but she resorts to judging her because she's just trying to support her\". Metcalfe explained that if Jacqui kept the affair secret Mercedes would be \"relieved\" that she still has Riley, and although she would not immediately think of Carl, Mercedes was worried that \"they could end up in bed together again\". Metcalfe went on to say that Mercedes \"loves Riley\" but \"can't help fancying Carl\", adding that for Mercedes \"there's a difference between love and lust\"."]}, {"page": "John Paul McQueen", "response": ["John Paul is the sixth of Myra McQueen's (Nicole Barber-Lane) eight children. He grew up around all women and was always the most level-headed of the group. John Paul meets Craig Dean (Guy Burnet) after saving him from a beating by Sonny Valentine (Devon Anderson). John Paul becomes close friends with Craig, Sarah Barnes, (Loui Batley), Hannah Ashworth (Emma Rigby), and Nancy Hayton (Jessica Fox)."]}, {"page": "Fletch (Hollyoaks)", "response": ["Fletch picked up heroin that dropped out of Michaela's mother, Myra McQueen's (Nicole Barber-Lane), bag in Drive 'n' Buy, and kept it in his school locker. Fletch was terrified when Mrs Webster did a spot check of lockers looking for drugs. Fletch pleaded with Sasha to help him but she couldn't understand why he even picked up heroin in the first place and ignored him. Just as the locker search was about to begin, Sasha set off the fire alarm and saved Fletch from getting caught with drugs. Fletch thanked Sasha but she demanded he got rid of the heroin. Later Sasha discovered heroin in Fletch's pocket again and was horrified that he had kept it. She lambastes Fletch, but her curiosity got the better of her and they both agreed to try the heroin just once. They started sleeping together and taking it more often."]}, {"page": "Mike Barnes (Hollyoaks)", "response": ["Michaela, her mother Myra (Nicole Barber-Lane) and sister Jacqui McQueen (Claire Cooper) temporarily move in to with Mike and Sarah after an infestation of rats in their house. Myra and Mike appear to become closer and she begins to have feelings for him. After Lucas' (William Hall) birth, Amy left to stay with her grandmother, leaving Ste to look after him. Abi (Elaine Glover) and Daniel Raven (Chris Hargreaves) befriend Ste but secretly plan to steal Lucas. Mike is suspicious over Abi and Daniel's interest. After finding Ste asleep while looking after Lucas, Mike takes him. Ste, Daniel and Abi approach Mike and confront him. Ste ends up taunting Mike about Kathy, Amy and Sarah. Angry, Mike punches Ste. The next day, Mike approaches Abi, who is looking after Lucas. Mike claims he deserves to look after Lucas, however Ste tells him he is seeing a solicitor to put an injunction against Mike."]}, {"page": "Sonny Valentine", "response": ["Sonny, now played by Aaron Fontaine, returns when his former sister-in-law Carmel Valentine (Gemma Merna) contacts him and tells him that his niece Kathleen-Angel (Nieve Grandison) is not safe with her mother, Theresa McQueen (Jorgie Porter). When he refuses to help, Carmel reveals that Theresa murdered his brother and Kathleen-Angel's father, Calvin. Sonny confronts Theresa in the village, revealing that he is now a Detective Sergeant in the police force and threatens her. When Carmel finds out, she confronts Sonny and he asks her to make a full written statement saying that Theresa killed Calvin, but she refuses. When Kathleen-Angel goes missing, Carmel tells Sonny about Theresa's plans to flee the village, so she gives in her statement. As Theresa is being pulled into a police car, Sonny arrives with Kathleen-Angel. When Sonny's superior, Sam Lomax (Lizzie Roper), is demoted to Detective Sergeant and is later killed in a car accident with her husband Danny Lomax (Stephen Billington), Sonny is promoted to Detective Inspector and leads the case into the deaths of Sam and Danny. It is revealed that Sonny is a bent copper and that he is working on both sides of the law, being paid by Grace Black (Tamara Wall) to set Big Bob (Vincent Ebrahim) up on a false charge. When Theresa's mother, Kathleen McQueen (Alison Burrows), returns to the village to help get Theresa released from prison, Sonny threatens her. When Kathleen reveals that Sonny is a recovering alcoholic and she tries to spike his drink with alcohol, he bribes her with money. When Kathleen later goes missing, it is revealed that Sonny has beaten her up and she is in hospital. When Kathleen's sister and Theresa's aunt, Myra McQueen (Nicole Barber-Lane), returns from Alicante to help with Theresa's escape plan, she knocks Sonny unconscious, but Theresa is caught and sent back to prison. Myra is livid when she finds out Sonny and Carmel are engaged and vows to show Sonny's true colours to Carmel. Carmel becomes suspicious of Sonny and follows him to the hospital, realising that he has beaten up Kathleen. Myra and Mercedes vow to deal with Sonny, but Kathleen warns the McQueens that they cannot win against Sonny and returns to Spain. Myra, Mercedes and Phoebe McQueen (Mandip Gill) handcuff Sonny in his car and drive him to a lake. When the McQueens are discussing what to do, Myra forgets to put the handbrake on and the car rolls into the lake with Sonny inside."]}, {"page": "Michaela McQueen", "response": ["A writer from the serial's official website described Michaela as always ready \"for a bit of McQueen scheming\" and said she has always had to fight to gain attention for herself. Hollyoaks international broadcaster, BBC America, described Michaela as \"a magnet for trouble\" because she has a penchant for thieving. Her \"favourite pastime\" of shoplifting has contributed to Michaela landing herself in trouble with the law. Most often her mother, Myra McQueen (Nicole Barber-Lane) is the only one \"who can put Michaela in her place\". They added that when Michaela is with her best friend and \"partner in-crime\", Amy Barnes (Ashley Slanina-Davies) - \"you'd better believe she's up to no good.\""]}, {"page": "Clare Devine", "response": ["Clare meets Dr. Paul Browning (Joseph Thompson) off-screen in Las Vegas when he begins flirting with her after he and Mercedes have an argument. Clare returned to Hollyoaks village shortly after Doctor Browning's return where he reveals to Myra McQueen (Nicole Barber-Lane) that Mercedes has gone missing in Las Vegas after their argument. Clare, claiming to be called \"Cassandra Knight\", tracks down Doctor Browning at his apartment and pretends to be just as shocked as Doctor Browning when he opens a letter addressed to him demanding \"£100,000 or Mercedes dies\". She informed Doctor Browning that she saw Mercedes getting into a limo with another man in Vegas, and Doctor Browning then correctly assumes Clare wrote the ransom note, however he soon discards this theory as he then suspects Mercedes probably wrote the letter herself. Clare returns to her hotel room where Mercedes is tied to a chair. Clare tells Mercedes that Doctor Browning suspects she wrote the ransom note, and that they need to work harder to get ransom money out of him before punching her in the face."]}, {"page": "Inside Soap Awards", "response": ["| Patti Clare (Mary Taylor in Coronation Street)Laura Norton (Kerry Wyatt in Emmerdale)Nicole Barber-Lane (Myra McQueen in Hollyoaks)", "| Tameka Empson (Kim Fox-Hubbard in EastEnders)Sally Dexter (Faith Dingle in Emmerdale)Nicole Barber-Lane (Myra McQueen in Hollyoaks)", "| Lysette Anthony and Nicole Barber-Lane (Marnie Nightingale and Myra McQueen in Hollyoaks)", "| Tameka Empson (Kim Fox-Hubbard in EastEnders)Lorraine Stanley (Karen Taylor in EastEnders)Nicole Barber-Lane (Myra McQueen in Hollyoaks)"]}, {"page": "Leo Valentine", "response": ["Leo arrives in Hollyoaks to look after his children after their mother's death. Leo is involved in several one-night stands with Myra McQueen (Nicole Barber-Lane). Leo is disappointed when Sonny leaves home to live with his aunt. On 6 September 2007, Leo's former mistress, Valerie, turns up with his illegitimate children Danny and Lauren. Valerie leaves her children with Leo and leaves for abroad. Calvin and Sasha are horrified to discover their father cheated on their mother and that they have two more siblings. A year later, Valerie returns and begins a short relationship with Leo until she kisses Calvin and leaves."]}, {"page": "Cindy Cunningham", "response": ["Cindy meets Alistair Longford (Terence Harvey), a rich pensioner who assumes Cindy saved him from choking to death, when it was actually Myra McQueen (Nicole Barber-Lane). Cindy accompanies Alistair on several dates, and after a couple of days with each other's knowledge, he proposes. Cindy is initially hesitant, but accepts upon discovering he is a multi-millionaire. However, Jacqui McQueen (Claire Cooper) blackmails Cindy, threatening to tell Alistair that it was Myra who saved his life. Jacqui and Myra plan Cindy's wedding. Steph is horrified to discover Cindy is marrying Alistair, who is in his seventies. Alistair's mother Blanche Longford (Georgina Hale) arrives in Hollyoaks after being called by his granddaughters India (Beth Kingston) and Texas (Bianca Hendrickse-Spendlove) in an attempt to sabotage the wedding. Blanche's plans fail, but she refuses to believe Cindy truly loves Alistair. Cindy is eventually made to tell Alistair that Myra had actually saved his life. However, this does not hinder Alistair's decision to marry her. On the day of the wedding, Darren tries to talk Cindy out of it and asks her to marry him, which she rejects. Blanche witnesses Darren and Cindy together and during the wedding, tells Alistair that they are having an affair. Darren and Cindy deny an affair and the wedding goes ahead. Before she leaves for her honeymoon, Cindy apologises to Steph and says goodbye, knowing it may be the last time she sees her as Steph is terminally ill with cancer. Cindy assures Holly she has only married Alistair to secure her a good life. Alistair and Cindy leave, although she seems displeased when he reveals he has bought viagra."]}, {"page": "Jacqui McQueen", "response": ["Jacqui meets divorcee Tony Hutchinson (Nick Pickard) and an attraction igniting, they have sex. Tony goes away on holiday and starts a relationship with Jacqui on his return. Jacqui violates her prison tag after staying at Tony's house overnight so she is sent back to prison. Sadly, Tony is forced to dump her because he cannot handle the pressure. Jacqui befriends Becca Dean (Ali Bastian) but Becca is later killed by another prisoner and Jacqui is devastated. Jacqui decides to make something of herself, not wanting to waste her life and is reunited with Tony and Davey returns with the favour. He forces Jacqui to marry Aleksander Malota (Jon Lolis). Jacqui and Aleksander manage to convince an immigration officer that their romance is genuine and they are married but Jacqui continues her affair with Tony secretly. The family uncover the truth about the marriage when Carmel and Aleksander's affair is revealed. Jacqui admits she married Aleksander to pay off her debt to Davey and is seeing Tony. Myra McQueen (Nicole Barber-Lane) is furious and orders Jacqui, Aleksander and Carmel to leave the house. Jacqui announces her pregnancy; Tony initially does not want the child, fearing that it may die like his previous child and their dreams are shattered when Jacqui miscarries and is left unable to have children of her own. Tony attacks Aleksander violently as he blames Aleksander as he cannot grieve for his baby publicly. Tony announces to the people in The Dog that the baby was his, not Aleksander and Jacqui asks Aleksander to return to Albania so she can live her life and he agrees. Carmel is shocked to discover Aleksander is leaving, leaving Carmel devastated. Depressed, Jacqui returns to her old habit of shoplifting, so Neville Ashworth (Jim Millea) gets her locked up for the night."]}, {"page": "Gemma Merna", "response": ["In 2017, Merna appeared in an episode in TV show Doctors.  She also joined former TV mum Nicole Barber-Lane as teammates on the 28 October 2017 \"Soaps\" episode of Pointless Celebrities."]}, {"page": "Danny Valentine", "response": ["When the hot water boiler in the Halls breaks, Jessica Harris (Jennifer Biddall) offers Danny £50 to fix the boiler. Despite telling her he has little experience fixing boilers, Danny agrees to help. While examining the box, he notices a hole which is causing the pilot light to go out. While Jessica's back is turned, Danny blocks up the hole with newspaper. Unfortunately, this causes a buildup of carbon monoxide. Later, at a house warming party for John Paul and Kris Fisher (Gerard McCarthy), the gas causes everyone to feel ill. Danny leaves with Mercedes before the others begin to lose consciousness. Danny and Mercedes go to the SU Bar and kiss, and were interrupted by a phonecall from Justin, saying that the party guests are unconscious. They rush back to the party and Danny helps Justin save the guests. Danny refuses a lift from Darren Osborne (Ashley Taylor Dawson), who suggests he ought to go to hospital to be checked, but Danny flees. Jessica visits him the following day, suggesting that the two of them keep a low profile. However, Danny cannot handle the guilt and confesses the truth to Mercedes. Jacqui McQueen (Claire Cooper) overhears, threatening to beat Danny up, but Mercedes protects him. Later, Jacqui and Myra McQueen (Nicole Barber-Lane) force Danny into confessing that Jessica was the one who allowed him to fix the boiler. Myra and Jacqui then threaten to sue Jessica. A few days later, Myra takes some money Jessica was given by Zoe Carpenter (Zoë Lister), resulting in the McQueens forgetting the incident."]}, {"page": "Newt (Hollyoaks)", "response": ["Newt, Lauren, Anita, Theresa begin revising at Lauren's house for exams. Theresa gets her cousin Michaela McQueen (Hollie-Jay Bowes) to buy bottles of apple cider for them to drink. Lauren appears in a bad mood and is annoyed when she feels the group are ganging up on her. They start to play truth or dare. After several turns, Theresa is dared to swap her normal glamorous clothes and make-up for Lauren's emo styled wear. Newt is then dared to dress in a track top, baseball cap and trainers, something that Lauren dislikes. Theresa compliments Newt for his appearance and the pair share a kiss. Feeling awkward, Newt and Theresa try to avoid each other. Theresa injures her ankle and Newt takes her home on his skateboard. The pair sit down against a wall, where they share another kiss and are seen by Ricky Campbell (Ashley Margolis), who is meeting Anita, who had used Theresa's picture, for a date. Ricky reveals to Anita he saw Theresa and Newt kissing, however they both convince her he is lying. Newt and Theresa succumb to their passion and have sex. They then carry on their secret relationship behind Lauren's back. They go off on a camping trip, which Anita, Ricky and Lauren end up coming along to. Finally, Lauren discovers Theresa and Newt's relationship and is hurt. Theresa invites Newt to the McQueens for dinner and introduces him as her boyfriend to Myra McQueen (Nicole Barber-Lane), who eventually gives Newt her approval."]}, {"page": "Niall Rafferty", "response": ["Niall Rafferty (born Matthew McQueen) is a fictional character from the British Channel 4 soap opera, Hollyoaks, played by Barry Sloane. He first appeared during an episode broadcast on 3 December 2007. Former Brookside actor Sloane was cast as the \"mysterious\" hairdresser Niall and was introduced by the series' producer Bryan Kirkwood. During Sloane's portrayal of Niall on-screen, he was central to a storyline involving the already-established McQueen family and it was revealed Niall was the illegitimate son of Myra McQueen (Nicole Barber-Lane). The storyline featured Niall seek revenge on the McQueens, which concluded in highly advertised episodes featuring Niall kidnapping his siblings and causing the death of his half-sister Tina Reilly (Leah Hackett). Niall was portrayed by upcoming actor Devon Jackson, the older brother of Hollyoaks actor Kieron Richardson, in flashback scenes depicting Niall's childhood.", "Niall arrives as a new hairdresser at beauty salon, Evissa. He helps Evissa owner Louise Summers (Roxanne McKee) and attacks her fiancé Warren Fox (Jamie Lomas), who assumes Niall is mugging her. Niall befriends co-worker Carmel McQueen (Gemma Merna) and her family. Jacqui McQueen (Claire Cooper) is suspicious of Niall, who claims to have two sisters. Niall soon becomes friends with Myra McQueen (Nicole Barber-Lane), who is unaware of his identity, and is invited for Christmas. Overwhelmed, Niall steals a picture from the McQueens and burns it. Niall attempts to become closer to his mother and begins encouraging her to be stricter with her youngest daughter, Michaela McQueen (Hollie-Jay Bowes). Niall gets Michaela drunk at a party and injects her with heroin, which causes her to overdose and makes the McQueens believe she is addicted. Niall continues his revenge on the McQueens by ruining their lives in small ways; reporting Myra for benefit fraud, pushing Carmel and boyfriend Calvin Valentine (Ricky Whittle) apart and attacking his grandmother, Nana McQueen (Diane Langton)."]}, {"page": "John Paul McQueen and Craig Dean", "response": ["John Paul McQueen and Craig Dean are fictional characters and a supercouple from the long-running British Channel 4 soap opera Hollyoaks. John Paul is portrayed by James Sutton, and Craig is portrayed by Guy Burnet. John Paul, is the son of Sally St. Claire (Annie Wallace) and Myra McQueen (Nicole Barber-Lane), while Craig is a son of Johnno Dean and Frankie Osborne (Helen Pearson). The character of Craig was introduced in 2002, while that of John Paul was introduced in September 2006; the supercouple relationship between the two slowly developed over a period of months, starting in 2006 and gaining intensity through 2007. Craig departs in September 2007, returning in September 2008 in a storyline which saw he and John Paul secure a happy \"sunset ending\", before Craig (and thus Burnet) left the Hollyoaks franchise."]}, {"page": "List of longest-serving soap opera actors", "response": ["|Nicole Barber-Lane || Myra McQueen || Hollyoaks || 2006–2013, 2014–2019 ||  years ||"]}, {"page": "List of British actors", "response": ["* Nicole Barber-Lane (born 1972)"]}, {"page": "Archie Carpenter", "response": ["Archie has been portrayed as a promiscuous character, one that doesn't think of the consequences of his hasty actions. At the time of joining the show, Beard said of his character: \"He is a bit of a womaniser, he's constantly on the look out for new talent but he gets shot down a lot too, I think he thinks far too highly of himself! He'll go to the point that not many blokes will, he will never give up.\" In an interview with media website Digital Spy he said of his character: \"He's definitely a wild one. People who have watched Living On The Edge may draw some comparisons. I go to a certain point in life, but Archie's definitely got bigger balls - he'll take things all the way. He's got no fear. At the same time, though, he has a sensitive side. He's like the big class clown but when he gets a knock, he really feels it. I think Archie's intended to bring a bit of light-hearted humour to the show.\" He has also been described as a wannabe entrepreneur coming up with wild ideas of how to make money fast. The character's promiscuous ways have been clearly portrayed on-screen through his many one-night stands with characters including: Sarah Barnes (Loui Batley), Hayley Ramsey (Kelly-Marie Stewart), India Longford (Beth Kingston) and Myra McQueen (Nicole Barber-Lane).", "In December 2008, Leila Roy (Lena Kaur) accused Archie of stealing chocolates from her advent calendar however it was later revealed she had been sleepwalking and stole them herself. He shares a kiss with Sarah Barnes (Loui Batley), who later witnesses Archie intimate with another girl. Archie attempts to reunite with Sarah occasionally, however she continuously rejected him. In a final attempt to regain her affection, he posts a billboard of himself half-nude. In February 2009, he kisses Sarah again. In March, Sarah succumbs to temptations and begins a relationship with him however Sarah dumps him as she notices his affection for her lesbian friend Lydia Hart (Lydia Kelly). Sarah revengefully dances with Lydia. In June, Archie endeavours to prevent his parents from uncovering Zoe's failed college course by \"collapsing\". Myra McQueen (Nicole Barber-Lane) resuscitates him and he verbally abuses by calling her a \"troll\", leading to Myra and Mercedes Fisher (Jennifer Metcalfe) trying to attack him. Later, Archie was undressed in bed, kissing an unseen person. He lay back and confesses to sleeping with Myra. Archie, along with Kris Fisher (Gerard McCarthy), Elliot Bevan (Garnon Davies) and Zak Ramsey (Kent Riley), move into Warren Fox's (Jamie Lomas) old flat after his death. While clearing out the attic, the boys found £100,000 of Warren's money and agree to keep the money safe for months, deciding if the money didn't belong to anyone, they would split it four ways. However, things become dangerous as Archie's greediness worsens. He calls his friend Jed to assist him in pretending to kidnap him in order for the other boys to give Jed the money, leading to Archie fleeing with it. However, Kris runs to Nancy Hayton's (Jessica Fox) house with the money and plans to go to the police. Jed actually kidnaps Archie seriously and gives him an ultimatum; either he receives the money or he would throw Archie over a roof. Elliot, Zak, Kris and Nancy salvaged him but, realising how the money affected their friendship, Kris abandoned it. After this, everyone neglected Archie, furious for Archie's betrayal."]}, {"page": "Theresa McQueen", "response": ["The character was announced in early November 2008. 20-year-old actress Jorgie Porter was cast as Myra McQueen's (Nicole Barber-Lane) 15-year-old niece, Theresa. She was described as a \"teen temptress\" and \"lolita type\". Porter, speaking of her new role, said: \"I'm thrilled to be joining not just Hollyoaks but one of soap's most notorious families. Although she's feisty with outsiders, Theresa's ranking within the family is low so she's eager to impress. I can’t wait to see how Theresa earns her stripes as part of the McQueen clan!\" Due to the departures of Tina McQueen (Leah Hackett) and John Paul McQueen (James Sutton) earlier in 2008, Hollyoaks producer Bryan Kirkwood added a new member to the McQueen family. Theresa was mentioned earlier before her entrance to the soap on-screen during a conversation between Myra and Nana McQueen (Diane Langton), her mother Kathleen McQueen (Alison Burrows) was also mentioned when it was revealed she was in prison.", "On 24 April 2014 - four months after her exit scenes aired - it was announced that Porter would be returning to Hollyoaks and that her return scenes would be air during the year. Theresa's return storyline would feature \"more twists and turns\" in the build-up to her trial. Of her return, Porter said: \"I am excited to be returning. Theresa is awaiting trial but has some serious unfinished business before then so I am thrilled to be able to come back and finish what we started.\" Meanwhile, the show added: \"Theresa is on a mission and she's got a secret that's going to shock a lot of people around the village.\" Fontaine also spoke about Theresa's return, stating that Sonny still wants justice for his brother's murder and is looking forward to the drama between Sonny and Theresa. He also stated that he expects to be involved in Porter's return, \"It'd be weird if Sonny wasn't involved in it, because obviously he still wants justice for his brother. If Theresa is released from prison so quickly, he'll feel that justice hasn't been served.\" Porter later expanded on her return and expressed that she would like Theresa to be nice upon her return to the village. Porter revealed that she would be filming within the summer and that she is unaware of her return storyline as well as that she would like to stay with soap for \"a while\". It was also announced in July 2014 that Nicole Barber-Lane would be returning to her role as Myra McQueen to tie in with Theresa's return. Porter's return scenes were previewed in the annual Hollyoaks: Six Weeks of Summer trailer that showed what would happen in the space of six weeks between 21 July and 29 August.", "Theresa is first mentioned by Myra McQueen (Nicole Barber-Lane) and Nana McQueen one month before her introduction. During her arrival, Theresa is attracted to Tony Hutchinson (Nick Pickard) while in The Loft, whom she meets during an educational-themed night. Sexual tension mounts between the pair and ultimately spend the night together, with Tony unaware that she is only fifteen. Theresa falls in love with Tony, who realises her deception, and destroys any chances of a future with him. A dejected Theresa turns to her family, the McQueens. Jacqui McQueen (Claire Cooper), who is still infuriated with Tony for his fling with her sister Mercedes McQueen (Jennifer Metcalfe), is angered with Tony for his night with Theresa. She immediately calls the police, who charge him. Theresa then moves in with the McQueens, sharing a room with cousin Michaela McQueen (Hollie-Jay Bowes), whom she previously had turned to for advice. Jacqui is not pleased at Theresa moving in but soon warms. Theresa then tells the police she was deceptive about spending the night with Tony, who is released. Theresa finds an unlikely friendship in Anita Roy (Saira Choudhry) and auditions for the part of The Virgin Mary in a nativity play produced by older cousin Carmel Valentine (Gemma Merna) and Cindy Cunningham (Stephanie Waring). However, she is heckled off the stage by some teenagers, who clearly know she is not a virgin. On Christmas Day, Anita finds a DVD containing CCTV footage of Warren Fox (Jamie Lomas) sleeping with Mandy Richardson (Sarah Jayne Dunn) and gives it to the McQueens, who set off to ruin Warren's wedding to Louise Summers (Roxanne McKee). Theresa begins battling against Lauren Valentine (Dominique Jackson) for friendship with Anita. When Lauren makes a comment about the McQueens, Theresa reminds her that Carmel is married to Lauren's brother Calvin. Theresa follows her family by using a fake pregnancy bump to shoplift. Having a proper relationship with Ste Hay (Kieron Richardson), Theresa is dumped by him, who wants to focus on son Lucas Hay (Jude)."]}, {"page": "List of Hollyoaks characters (2007)", "response": ["Father Raymond is the Catholic Priest that first appeared to console Myra McQueen (Nicole Barber-Lane) over the anguish she felt about her gay son John Paul McQueen (James Sutton). He also helped prepare for the double wedding of Russ Owen (Stuart Manning) and Mercedes McQueen (Jennifer Metcalfe) and Dominic Reilly (John Pickard) and Tina McQueen (Leah Hackett), he also took confession from Mercedes about her affair with Warren Fox (Jamie Lomas). He is a priest at St. Paul's Catholic Church. Father Raymond reappears when Kieron Hobbs (Jake Hendriks) chose to leave his position in the church and told him that he must do what is right for him. Father Raymond then took over again from Kieron and started working at a new Catholic Church, St. Timothy's, it was here that he performed the wedding of Carmel McQueen (Gemma Merna) and Calvin Valentine (Ricky Whittle). Father Raymond then returned to perform Tina's funeral service. He is due to reappear again for the funeral of Warren. Father Raymond is Irish and appears to be mostly bemused by the McQueens antics.", "Nana is first seen in July 2007 when flirting with Russ Owen (Stuart Manning) in The Dog in the Pond. She enters the McQueen household to find her granddaughters fighting. When the rest of the McQueens get back, she sees Russ and claims he was chatting her up at The Dog. Nana reappears in October 2007 when her grandchildren Carmel McQueen (Gemma Merna) and John Paul McQueen (James Sutton) nearly die from carbon monoxide poisoning. She stirs up trouble by lying to her granddaughter Mercedes McQueen (Jennifer Metcalfe) that she has seen Carmel and Russ kissing at the hospital. Nana's daughter, Myra McQueen (Nicole Barber-Lane), tries to get along with her, but after she realises Nana has tried to steal the compensation money the family have received for Carmel and John Paul, Myra throws Nana out. Nana reminds Myra that she is her mother, but Myra exclaims that she stopped being her mother at the age of 14. Nana vows to return before leaving. Nana returns for the family's Christmas and Boxing Day celebrations. Neither she nor the rest of the family realise their guest, Niall Rafferty (Barry Sloane), is the son Nana forced Myra to give up at birth. During the dinner, Nana toasts her granddaughter Tina McQueen (Leah Hackett) for being a surrogate mother for her half-sister Jacqui McQueen (Claire Cooper) and her boyfriend Tony Hutchinson (Nick Pickard). Myra gets upset and leaves the table. Nana finds her in the bathroom, weeping over old newspaper clippings of the child she had given up at birth. Myra tells Nana she could never forgive her, or herself. Nana tells her to stop complaining and that she was right to give up the child. Myra slaps Nana for her comment, but Nana slaps Myra right back, leaving as she refused to be treated in such a manner."]}, {"page": "Anita Roy", "response": ["Anita arrives with the Roy family in November 2008. They move into the Ashworths former home. Soon after her arrival, Anita befriends Lauren Valentine (Dominique Jackson) and Barry Newton (Nico Mirallegro). Anita feels she is different from her friends and begins to dress like them, however, is advised by sister Leila Roy (Lena Kaur) to be herself. After helping Bel Roy (Nila Alia) in Evissa, Anita begins to dislike Theresa McQueen (Jorgie Porter). However, the pair do eventually become friends. Anita discovers a CCTV DVD containing Warren Fox (Jamie Lomas) having sex in The Loft with Mandy Richardson (Sarah Jayne Dunn), which Ravi Roy (Stephen Uppal) accidentally left out. Anita then shows Michaela McQueen (Hollie Jay Bowes) and Theresa with Myra McQueen (Nicole Barber-Lane) and Jacqui McQueen (Claire Cooper) deciding to go to Warren's wedding to Louise Summers (Roxanne McKee) and show the wedding party. Gaz Bennett (Joel Goonan) begins to bully Anita, who makes racist comments towards her and he is later expelled from Hollyoaks High School. Lauren and Newt begin to use Anita to cover up their secret relationship with Newt pretending to be Anita's boyfriend. The pair eventually do go out after Lauren and Newt split up."]}, {"page": "Kathleen McQueen", "response": ["Kathleen McQueen is a fictional character from the British Channel 4 soap opera Hollyoaks, played by Alison Burrows. She first appeared during late-night spin-off Hollyoaks Later in September 2009 as the sister of Myra McQueen (Nicole Barber-Lane) and mother of Theresa McQueen (Jorgie Porter). Burrows reprised her role as Kathleen in August 2014, but left again in September."]}, {"page": "McQueen family", "response": ["The McQueen family are a fictional family in the Channel 4 soap opera Hollyoaks. The family first appeared in 2006 and the family have been involved in a number of the show's most high-profile storylines, most notably John Paul McQueen's (James Sutton) affair with Craig Dean (Guy Burnet); Jacqui McQueen's (Claire Cooper) whirlwind relationship with Tony Hutchinson (Nick Pickard); Myra McQueen's (Nicole Barber-Lane) long-lost son Niall Rafferty's (Barry Sloane) revenge on his family by holding them hostage in an abandoned church and blowing it up, ultimately killing his half-sister Tina Reilly (Leah Hackett); Theresa McQueen's (Jorgie Porter) pregnancy by her cousin Carmel McQueen's (Gemma Merna) fiancé Calvin Valentine (Ricky Whittle) and later shooting him dead on their wedding day; Mercedes McQueen's (Jennifer Metcalfe) affair with her fiancé Riley Costello's (Rob Norbuy) father Carl (Paul Opacic); being kidnapped by Riley's grandfather Silas Blissett (Jeff Rawle), Jacqui coping with the death of her husband Rhys Ashworth (Andrew Moss) in a bus crash, learning that he had been having an affair with Cindy Cunningham (Stephanie Waring) and that he got Sinead O'Connor (Stephanie Davis) pregnant; Mercedes stalking Mitzeee (Rachel Shenton) and stabbing herself and framing her; Carmel's facial disfigurement; Myra faking her own death to escape her daughter Mercedes' evil husband, Dr. Paul Browning (Joseph Thompson); Mercedes killing her husband Doctor Browning by striking him over the head with a shovel; John Paul's male rape at the hands of his pupil Finn O'Connor (Keith Rice); the train crash which ultimately killed Carmel; Mercedes faking her death to help Grace Black (Tamara Wall) get revenge on Freddie Roscoe (Charlie Clapham); Theresa donating her kidney to Nico Blake (Persephone Swales-Dawson); Porsche (Twinnie Lee Moore) and Cleo McQueen's (Nadine Rose Mulkerrin) sexual abuse at the hands of their mother Reenie McQueen's (Zöe Lucker) fiancé Pete Buchanan (Kai Owen); Phoebe McQueen's (Mandip Gill) murder in hospital by the Gloved Hand Killer; the stillbirth of Mercedes' baby Gabriel; John Paul's transgender boss Sally St. Claire (Annie Wallace) being revealed as his biological father, Mercedes being framed for drugs by Joanne Cardsley (Rachel Leskovac), Celine McQueen (Sarah George) and Diego Salvador Martinez Hernandez De La Cruz's (Juan Pablo Yepez) sham wedding for money; Celine being murdered by her ex-boyfriend and serial killer Cameron Campbell (Cameron Moore) after discover he causes the fire at the fair on Halloween 2016; Hunter affair with his teacher Neeta Kaur (Amrit Maghera), leads his feud with his fiance Mac Nightingale (David Easter); Prince marriage to Lily Drinkwell (Lauren McQueen) and Breda turning out to be a serial killer.", "In late 2008, Kirkwood introduced the cousin of the McQueen sisters, Theresa. It was announced she was to \"shake up Hollyoaks\". Actress Jorgie Porter stated \"I absolutely love the McQueens, I'm so glad I'm in that family! They're dead inviting, and they look after you. They took me under their wing, and they've taught me loads as well.\" Jorgie Porter was nominated for 'Best Newcomer' in the 2009 British Soap Awards. Hollyoaks producer, Lucy Allan stated that the McQueens are \"our favourite family of fun.\" As part of a Christmas special in 2008, the McQueens appeared together on All Star Family Fortunes, where Nicole Barber-Lane (Myra), Nick Pickard (Tony), Jennifer Metcalfe (Mercedes), Gemma Merna (Carmel) and Claire Cooper (Jacqui) played against the Dingle family from Emmerdale."]}, {"page": "List of Hollyoaks characters (2010)", "response": ["Trish Minniver, played by Paula Wolfenden from 2010 to 2012 and Denise Welch from 2021, is the mother of Mitzeee (Rachel Shenton) and Maxine Minniver (Nikki Sanderson), who arrives on her birthday to see her family. It is revealed that she has bitter feelings towards her niece \"that she treated like a sister\" Heidi Costello (Kim Tiddy), this is because Trish used to date Carl Costello (Paul Opacic) before he left her for Heidi. She appears to be using her daughter Mitzeee in her plan to make Carl and his family's life hell. Trish reappears at Christmas 2010 with Mitzeee and makes peace with Heidi and Carl, before befriending Myra McQueen (Nicole Barber-Lane). Trish encourages Heidi to be more accepting of her transgender son Jason Costello (Victoria Atkin).", "Alistair Longford, played by Terence Harvey, was a wealthy pensioner and grandfather of Texas (Bianca Hendrickse-Spendlove) and India Longford (Beth Kingston) who first appears when he chokes on food at Il Gnosh. He is saved by Myra McQueen (Nicole Barber-Lane) using the Heimlich maneuver. Myra tells Alistair that Cindy Cunningham (Stephanie Waring) was responsible for saving him, not realising his reward. Believing Cindy was responsible, Alistair gives Cindy a handful of £50 notes. This leaves Myra feeling insolent and upset. Alistair and Cindy grow closer until they begin a relationship.", "Carmel wanted the baby to be named Angel against Theresa's wishes. Theresa's mother, Kathleen McQueen (Alison Burrows), locked her sister Myra McQueen (Nicole Barber-Lane) in a room to prevent her from stopping her from naming the baby Kathleen-Angel to spite Carmel."]}, {"page": "Diane O'Connor", "response": ["For her portrayal of Diane, Fletcher was nominated for Best Soap Actor (Female) at the 2018 Digital Spy Reader Awards; she came in tenth place with 3.4% of the total votes. Daniel Kilkelly of Digital Spy said he was \"pleased\" about Fletcher's signing. Holy Soap have said Diane's most memorable moment is \"Getting her step-daughter Sinead to administer her IVF injection when husband Rob was tied up at work.\" The official Hollyoaks website ran a poll asking viewers which member of the O'Connor family was their favourite. Diane received the most votes, with 1,597 (34.13%) people voting for her. In another poll run by In a poll run by Hollyoaks official website to discover the best mum out of Diane, Myra McQueen (Nicole Barber-Lane) and Martha Kane (Carli Norris), Diane came first with over 3920 votes, over 51% of the total votes."]}, {"page": "Carl Costello", "response": ["After Riley disowns Carl, he decides that there is no future for him in Chester and decides to emigrate to America, and asks Jason and Seth if they would like to join him. Seth refuses, unable to forgive his father, but Jason decides that there is a better future for him out there and agrees to go with his father. After saying their goodbyes, and Carl makes an emotional apology to Riley, Jason and Carl leave for America, and are last seen boarding the aeroplane. Carl returns when he learns Mercedes and Riley are getting married and attempts to persuade Riley not to marry Mercedes. Mercedes hears a conversation between Riley and Carl in which Riley admits that he does not love Mercedes and that he recently had sex with Mitzeee. Bobby is abducted with Mitzeee as the prime suspect. Mercedes accuses Mitzeee of kidnapping Bobby later a letter is delivered to Riley asking for half a million pounds ransom money. Riley asks Carl for help and he says he can only give £200,000 as the rest of his money is tied up in investments. Riley discovers Mercedes kidnapped Bobby and she is arrested before she is taken to a psychiatric unit. Riley is shot and killed by Walker. Bobby is left without either parent so is left with Mercedes' mother Myra McQueen (Nicole Barber-Lane). Carl decides Myra is not the right guardian for Bobby and she agrees Bobby would be better living with Carl. Carl returns to America with Bobby."]}, {"page": "Heidi Costello", "response": ["When Riley becomes engaged to pregnant Mercedes McQueen (Jennifer Metcalfe) Heidi makes frenemies with Myra McQueen (Nicole Barber-Lane) as they often clashed on how to plan the wedding. During the wedding, it is revealed that Mercedes and Carl had a four-month affair, leaving Heidi devastated that he'd cheat on her again. She is comforted by Jason and Seth, and walks out keeping her head held high to retain some dignity. Heidi is unaware that after the wedding, Silas kidnapped Mercedes and is currently holding her hostage in the basement under the Dog in the Pond. Heidi tells Carl to move out of The Dog and Jason is devastated when Heidi tells him that her and Carl were getting a divorce and storms out."]}, {"page": "Mitzeee Minniver", "response": ["The police arrive arrest Warren and he insults Mitzeee. Days after the attack Mitzeee still bares bruises and starts realising the full consequence of what she has done and what could happen if Warren gets off. Nancy tells her not to think about the past - only the present. On Valentine's Day, Mitzeee receives a card to find that Joel has returned to Hollyoaks. Riley invites Mitzeee to attend an awards evening with him. A paparazzo photographs them together, while Riley is touching Mitzeee's face. At Riley's son's christening, Mercedes slaps Mitzeee. While they are in the car park, Riley and Mitzeee share a passionate kiss. To cut the tension in the flat, Mitzeee invites Darren and Nancy to move in while the pub undergoes a renovation. Mitzeee is interviewed by a journalist for an online blog. He tells her that he is only there because his company is now in association with her management. Riley asks Mitzeee pull the interview and she agrees, however, it is later published. Someone starts sending Mitzeee gifts and she discovers that it was Neil Cooper (Tosin Cole), who has a crush on her. Mitzeee continues to receive gifts and anonymous phone calls and discovers that the culprit is not Neil. Mitzeee appears in live TV and lashes out at a fan, incorrectly thinking she is behind the gifts. She is later sacked and is told she will never appear on TV again. Mitzeee continues to get creepy gifts when it is revealed that Mercedes is Mitzeee's stalker because Mercedes believes that Mitzeee and Riley are going out. Mitzeee is still in love with Riley when she gets a modelling gig to model for the grand prix. She asks Riley whether she should go and he says she should and so she does hoping that she can forget about Riley. When Mercedes begins messing with Mitzeee's mind, playing games and hiding things in her flat, Mitzeee begins to lose grip on reality and begins taking some new tablets for anxiety. During a confrontation with Mercedes, Mitzeee is knocked unconscious and Mercedes stabs herself in the stomach and lies that Mitzeee stabbed her. After trying to escape the country and failing, Mitzeee is arrested on suspicion of GBH and she is imprisoned awaiting trial. While in prison, Mitzeee is bullied by her cellmate and a gang of girls who demand Riley's money or they will kill her. Mitzeee asks Riley for £5,000, to which he reluctantly accepts and gives them the money. Coincidentally, Mercedes' mother Myra McQueen (Nicole Barber-Lane) is also in prison at the same time as Mitzeee, and warns her that she will pay for \"stabbing\" Mercedes.", "Mitzeee struggles in prison as she is tormented by other prisoners and Myra McQueen (Nicole Barber-Lane) is later transferred to Mitzeee's prison. Myra is convinced that Mitzeee stabbed her daughter and uses this opportunity to get revenge. Shenton told All About Soap: \"I think at that point Mitzeee just wonders if things could get any worse for her. She's already having a really rough time, and then Myra shows up. It's a very calculated decision on Myra's part to get moved to the same jail. Myra will battle tooth and nail for her daughter, and you can just imagine the fighting spirit she has. There's a lot of serious verbal scrapping between Myra and Mitzeee, which in some ways is worse than a punch-up.\" Shenton also said that Riley is not as supportive as Mitzeee would like him to be as he is dealing with his own problems back in the village. She added that it's devastating for Mitzeee as she is madly in love with Riley and hopes that he will have a change of heart. Shenton said in September 2012 that Mitzeee will play a big role in the fifth series of Hollyoaks Later. Speaking to Inside Soap, Shenton revealed \"So many horrible things have happened to Mitzeee - she's so far removed from the girl she was six months ago. This whole chain of events sends her into an even deeper depression. Her mum comes to visit her in jail, and that's the first point viewers will see something's really not quite right with Mitzeee now.\" She later added that Mitzeee's recent experiences will \"change her for the good\" and she will come out fighting. Shenton said that all of the latest trouble's in Mitzeee's life has ruled out any possibility of returning to her \"glamour past\" and that being framed for attempted murder has \"hardened her\". Speaking to a Daily Star reporter, Shenton said that \"When she first arrived a year ago, she was this ditzy glamour model with big hair. Now you've seen a different side to her. I think this has changed her forever. I'd like to see her go back to a version of herself but I don't think you can ever go right back when something like this has happened.\""]}, {"page": "Sinead O'Connor (Hollyoaks)", "response": ["While working at Price Slice she is held at gunpoint by Robbie Roscoe (Charlie Wernham) and her brother Finn, although they are wearing masks. Just in time Callum walks into the shop and attacks Robbie who accidentally shoots him. An ambulance is called and Sinead finds out her baby is okay. She is horrified when she learns her brother Finn was involved and slaps him, but she goes into labour. She gives birth in the back of a burnt out car with help from Esther. She is taken to hospital where the baby is checked to see if she is alright. Diane names the baby Katy and takes her home. Sinead decides she can't watch Diane raise her baby and moves in with Ste. She returns to working at Price Slice but soon decides to quit. After an argument with Mercedes McQueen (Jennifer Metcalfe) she accepts a job working for her at Chez Chez. Ste gets her into drug dealing, however, as Sinead is struggling for money and she starts dealing at Chez Chez. When she gives a man the wrong drugs, he angrily attacks her. Soon she gets arrested for drug dealing but is released as it's a first offence. Diane finds out about her drug dealing and makes Sinead move back in with her. She only stays for a few days before she decides to move out, taking Katy with her. She is also fired from Chez Chez. She falls out with Holly and Cindy, and Myra McQueen (Nicole Barber-Lane), when Myra finds out Bart is not the father of Sinead's baby."]}, {"page": "Bart McQueen", "response": ["Bart first appears at his stepmother's funeral, where he meets Myra McQueen (Nicole Barber-Lane) and his second cousins Michaela McQueen (Hollie-Jay Bowes) and Theresa McQueen (Jorgie Porter). After the funeral, Bart is caught shoplifting by policeman Dominic Reilly (John Pickard), and is brought back to the McQueen's home. Bart shocks Myra by revealing he has shoplifted before, has an anti-social behaviour order, burnt a school down – although not proven guilty – and other misdemeanours. Dominic is about to have Bart taken into custody, when Myra agrees to look after him, as Bart has no one to look after him. She immediately warns Bart not to get up to any trouble. After a day at the McQueens, Bart is roped into helping Carmel McQueen (Gemma Merna) at beauty salon Evissa. Heidi Costello (Kim Tiddy) arrives with her daughter Jasmine Costello (Victoria Atkin), who seems to dislike the idea of having a makeover. Bart strikes up a friendship with Jasmine. He then steals money from the till. Although Jasmine tells him to put it back, he does not, and is not seen by Carmel. Bart spends a day with Jasmine, but she runs off after he kisses her. When her father Carl Costello (Paul Opacic) is told about them from Mitzeee (Rachel Shenton), he is angry and confronts them both and Jasmine's half-sister Jem Costello (Helen Russell-Clark) interrupts, but defends them both that they have done nothing wrong. Bart becomes friends with Taylor Sharpe (Shaun Blackstock), and they plan to throw a party at the McQueen house. Duncan Button (Dean Aspen) agrees to bring alcohol to the party, but instead posts details of the party online. The McQueen house is trashed and Bart steals money. This causes an angry confrontation from Jacqui McQueen (Claire Cooper), who accuses Bart of stealing the money. However, Myra does not believe Jacqui's accusations. Jacqui then raids Bart's room, which annoys Myra, who tells Jacqui to calm down. After an argument, when Myra refuses to take Jacqui's side, Jacqui moves out. Bart, to his glee, tries to impress Jasmine with how he stole the money, however she is not impressed."]}, {"page": "Duncan Button", "response": ["Duncan asks Michaela McQueen (Hollie-Jay Bowes) for a massage at Evissa, but she realises he wants more than an average massage. Jacqui McQueen (Claire Cooper) is sickened by his suggestion and waxes his chest painfully for revenge. Duncan is sick over Theresa McQueen (Jorgie Porter) at the students Christmas party after drinking too much. To cheer Ricky up, Duncan persuades him to have a bogus raffle to help pay for their entry fee for a party. Duncan dresses up as Father Christmas and the tickets for the raffle sell fast making them a lot of money. Later, the scam is revealed by their teacher Des Townsend (Kris Deedigan) and Myra McQueen (Nicole Barber-Lane) demands the Harrods hamper they promised. Duncan decides to make his own Christmas goodwill and steals presents from under the McQueens' and Ashworths' tree. Ricky finds the presents and stolen gifts from the Secret Santa in the shack and they open them together. Duncan is infatuated with Theresa after landing in the village, and tries everything he can but nothing he can do can impress her. He gets Darren's advice and dresses like a pimp, and while this somehow works, as well as pretending to be gay, Theresa is not interested. Duncan wins a competition where he gets to have the 16th birthday party of his dreams paid for by a reality TV company. He invites Theresa, who is invited and excited as the prospect of being filmed. While Theresa is impressed, Duncan's hopes are shattered when rap artist Chipmunk performs, and Theresa only has eyes for him. Neville finds the presents and sends Duncan home early to his parents. Duncan steals Suzanne's underwear, but he is caught and lies to her saying he might be gay."]}, {"page": "Leanne Holiday", "response": ["Leanne finds out that Doug and Ste are leaving together so throws them a going away party. In the shop Leanne finds out that Dennis was paid to do a fake robbery for the McQueens and that Dennis gave her the ring of the late Myra McQueen (Nicole Barber-Lane). She later breaks up with Dennis and throws champagne in his face. Leanne decides to leave but then later sees in a book that Dennis had written 10 things he loves about her. Leanne then organizes a leaving party for Doug and Ste, who are planning to move away. A bomb that has accidentally been brought to the party, goes off, destroying the house. Dennis waits anxiously for news on his step-cousin Dodger (Danny Mac) and when a body is brought out, it is actually Leanne. In the ambulance Dennis and Leanne have a heart-to-heart and Leanne tells him that she wants to marry him after all and forgives him for the robbery. Leanne then stops breathing and is rushed quickly to hospital. Due to complications due to a head injury, Dennis tells her that he will marry her in hospital. Dennis and Leanne get married at the hospital. Leanne then passes away, a few hours after marrying Dennis, due to a bleed on the brain she suffered from the bomb blast."]}]}}