{"wiki_id": "http://www.wikidata.org/entity/Q1450202", "itemLabel": "Ramsay Richard Reinagle", "itemDescription": "English portrait, landscape, and animal painter, and son of Philip Reinagle (1775-1862)", "wikipedia_url": "https://en.wikipedia.org/wiki/Ramsay_Richard_Reinagle", "wikipedia_page": {"main": "Ramsay Richard Reinagle  (19 March 1775 – 17 November 1862) was an English portrait, landscape, and animal painter, and son of Philip Reinagle.", "link_mentions": [{"page": "1775", "response": ["* March 19 – Ramsay Richard Reinagle, English painter (d. 1862)"]}, {"page": "Royal Watercolour Society", "response": ["*Ramsay Richard Reinagle (1808–1812)"]}, {"page": "English Water Spaniel", "response": ["Paintings by Henry Bernard Chalon and Ramsay Richard Reinagle both show English Water Spaniels working with their masters  hunting ducks. An engraving by Henry Thomas Alken Snr. shows a slightly different looking English Water Spaniel, but also reinforces its area of work by again showing it while duck hunting. In The Sportsman's Repository (1820), the author advises that if an individual wishes to hunt ducks or any other type of waterfowl, then the hunter had best use an English Water Spaniel."]}, {"page": "Philip Reinagle", "response": ["Of the sons, Ramsay Richard Reinagle was also an artist, and followed his father's style. The other son, Philip, went to Trinidad where he held posts including Surveyor of Port of Spain. He was responsible for the design and construction of Holy Trinity Cathedral and the Cathedral Basilica of the Immaculate Conception there.Stark's Guide & History of Tr inidad (PDF)  at p. 45"]}, {"page": "George Philip Reinagle", "response": ["George Philip Reinagle (1802 – 6 December 1835) was an English marine painter, youngest son of Ramsay Richard Reinagle. "]}, {"page": "John Partridge (artist)", "response": ["In 1846, Partridge made the decision never to exhibit again at the Royal Academy, after two of his portraits were placed insultingly badly, probably in consequence of a dispute more than a decade earlier with fellow artist and Royal Academician, Ramsay Richard Reinagle, over Partridge altering one of Reinagle's pictures for the owner. He did not change his mind even when, two years later, Reinagle was discredited for claiming another artist's work as his own.Corley TAB. 'Reinagle, Ramsay Richard (1775–1862)', Oxford Dictionary of National Biography (Oxford University Press; 2004) (accessed 23 August 2007)"]}, {"page": "Oriental Club", "response": ["The club possesses a fine collection of paintings, including many early portraits of Britons in India such as Warren Hastings.Tully, Mark, Why Queen Victoria’s art reflects her true feelings about India, online at dawn.com (accessed 28 January 2008) The Bar is overlooked by a painting of Tippu Sultan, the Tiger of Mysore (1750–1799). There are portraits of the club's principal founders, the first Duke of Wellington (by H. W. Pickersgill) and Sir John Malcolm (by Samuel Lane). Other portraits include Lord Cornwallis (1738–1805), also by Samuel Lane, Sir Jamsetjee Jeejebhoy, 1st Baronet (1783–1859), by John Smart, Clive of India (1725–1774) by Nathaniel Dance-Holland, Major-General Stringer Lawrence by Sir Joshua Reynolds, Major General Sir Thomas Munro, 1st Baronet (1761–1827), by Ramsay Richard Reinagle, Edward Stratford, second Earl of Aldborough (died 1801) by Mather Brown, Mehemet Ali, Pasha of Egypt (c. 1769–1849) and General Sir William Nott, both by Thomas Brigstocke, Henry Petty-Fitzmaurice, 5th Marquess of Lansdowne (1845–1927) by Sydney P. Kenrick after John Singer Sargent, Lieutenant-General Sir Richard Strachey (1817–1908) by Lowes Dickinson (the bequest of his widow, Jane Maria Strachey), Charles Metcalfe, 1st Baron Metcalfe by F. R. Say, Thomas Snodgrass by an unknown artist, and a bust of the first Lord Lake.Forrest, op. cit., p. 8, pp 228–232"]}, {"page": "Robert Barker (painter)", "response": ["One of his sons, Henry Aston Barker, was also an artist and assisted with and then carried on his father's profession of painting and exhibiting panoramas. The eldest son, Thomas Edward Barker, though not an artist, also helped run the family's business, then, in 1801, set up a rival panorama exhibition with artist Ramsay Richard Reinagle at 168/9 The Strand, London.See Royal Strand Theatre."]}, {"page": "Animal painter", "response": ["* Ramsay Richard Reinagle (1775-1862)"]}, {"page": "The City Rooms, Leicester", "response": ["The design for the building involved a symmetrical main frontage of five bays facing the corner of Hotel Street and Market Place South; the central bay featured a porch with paired Tuscan order columns supporting an entablature; there was a large rounded headed window on the first floor flanked by two niches containing female musicians carved by John Charles Felix Rossi and two more large round headed windows beyond that. Internally, there was a large ballroom ( long,  wide and  high) on the first floor which was decorated with allegorical paintings by Ramsay Richard Reinagle and with statues based on models by John Bacon."]}, {"page": "Henry Aston Barker", "response": ["Barker died on 19 July 1856 at Bitton near Bristol. A list of most of the panoramas painted and exhibited by Henry and Robert Barker was published in The Art Journal (1857, p. 47). His brother, Thomas Edward Barker, although not an artist, was also involved in running the  family business, but later set up a rival panorama exhibition with the painter Ramsay Richard Reinagle at 168/9 The Strand, London.See Royal Strand Theatre."]}, {"page": "Reinagle", "response": ["*George Philip Reinagle (1802–1835), English marine painter, son of Ramsay Richard Reinagle", "*Ramsay Richard Reinagle (1775–1862), English portrait, landscape and animal painter, and son of Philip Reinagle"]}, {"page": "List of Royal Academicians", "response": ["| Ramsay Richard Reinagle   ||align=\"center\" |  1823  ||"]}, {"page": "List of graphic artists in the Web Gallery of Art", "response": ["*Ramsay Richard Reinagle (1775–1862), 1 drawing : Self-Portrait, British Museum, London (url)"]}, {"page": "Philip Dottin Souper", "response": ["During his time in Trinidad, Souper married Oriana Jane Reinagle (1804–1890), daughter of Ramsay Richard Reinagle, in 1827.London Evening Standard, Tuesday 16 October 1827 This was a marriage of first cousins."]}, {"page": "List of artists in the Web Gallery of Art (L–Z)", "response": ["*Ramsay Richard Reinagle (1775–1862), 4 paintings : Italian Landscape with Lake, Government Hospitality, Lancaster House, London (url)"]}]}}