{"wiki_id": "http://www.wikidata.org/entity/Q14518205", "itemLabel": "Forest Swords", "itemDescription": "UK music producer", "wikipedia_url": "https://en.wikipedia.org/wiki/Forest_Swords", "wikipedia_page": {"main": "Matthew Barnes, known by his stage name Forest Swords, is an English record producer, composer, DJ, and artist.", "link_mentions": [{"page": "Ninja Tune", "response": ["*Forest Swords"]}, {"page": "Lee \"Scratch\" Perry", "response": ["Perry remixed the \"Thor's Stone\" single by UK producer Forest Swords in November 2013."]}, {"page": "DJ-Kicks", "response": ["|  DJ-Kicks: Forest Swords", "| Forest Swords"]}, {"page": "Pitchfork Music Festival", "response": ["Wednesday: Julianna Barwick, The Dodos, Jackson Scott, Forest Swords"]}, {"page": "List of intelligent dance music artists", "response": ["*Forest Swords"]}, {"page": "Way Out West (festival)", "response": ["*Forest Swords"]}, {"page": "Off Festival", "response": ["The Stooges, Swans, Thurston Moore, Suicide, Death in Vegas, The House of Love, Converge, Bardo Pond, Battles, The Antlers Baroness, Atari Teenage Riot, Fennesz, Metronomy, Kurt Vile, Ty Segall, High Places, Charles Bradley, Baxter Dury, Kim Gordon & Ikue Mori, Nosowska, Akron/Family, Shabazz Palaces, Das Racist, Forest Swords, Andy Stott Apteka, Papa M, Other Lives, Josh T.Pearson Megafaun, Jacaszek, Colin Stetson Kirk, Africa Hitech, Connan Mockasin, Henry Rollins (spoken word), Spectrum, Retro Stefson, King Creosote & Jon Hopkins, Kanał Audytywny, Afro Kolektyw, Nerwowe Wakacje Iceage, Piętnastka, Dominique Young Unique, ANBB, ContaineR Mordy, Beneficjenci Splendoru, Mokołaj Trzaska, Shangaan Electro"]}, {"page": "Benjamin Millepied", "response": ["| Forest Swords: The Weight Of Gold"]}, {"page": "Mark Donne", "response": ["In December 2015 Donne collaborated with Robert Del Naja of Massive Attack for a second time (see features) writing a short satirical film \"La Fête est Finie\" (The Party is Over) to mark the historic Paris Climate change conference or COP21. The short, jointly directed with Joe Morris under the Brass Moustache moniker, was also scored by Del Naja and former Mercury Music Prize winning band Young Fathers and was produced by Forest Swords."]}, {"page": "Field Day (festival)", "response": ["Forest Swords"]}, {"page": "Villette Sonique", "response": ["* The Fall, Caribou, Half Japanese, Action Beat, Thurston Moore, Animal Collective, Glenn Branca, Yuri Landman (Home Swinger workshop & performance feat. Jad Fair and Action Beat), Suuns, James Pants, Connan Mockasin, OOIOO, Emeralds, Discodeine & Thomas Bloch, Group Doueh, Oxbow, Blondes, Julian Lynch, Ducktails, Rebolledo, Pilooski, Appleblim, Matias Aguayo, Comus, Current 93, Gouter Sonique, Cheveu, The Books (replacing Forest Swords), Mami Chan, Hype Williams, James Pants, Busy P, Sebastian, Carte Blanche, The Feeling of Love, Tensnake and others."]}, {"page": "Dagger Paths", "response": ["Dagger Paths is a 2010 studio EP by Forest Swords. It was released as an EP on March 1, 2010 by Olde English Spelling Bee and re-released later that year on November 22 by No Pain in Pop as the Dagger Paths EP (Expanded Edition), with two extra tracks from Rattling Cage 7\" single and a bonus disc containing six early Forest Swords songs, four remixes by other artists, and a lengthy Forest Swords mix.", "The six early Forest Swords songs found on the Dagger Paths EP (Expanded Edition) bonus disc were later officially released in 2011 as the Fjree Feather EP (in fact, they had first appeared on a 2009 self-released EP of the same name). Some digital versions of the Dagger Paths EP (Expanded Edition), such as that sold by Amazon.com, feature the EP's remastered and extra tracks, but do not include the bonus disc.", "Category:Forest Swords albums"]}, {"page": "Calday Grange Grammar School", "response": ["* Matthew Barnes – Musician, performing as Forest Swords"]}, {"page": "Trailer Trash Tracys", "response": ["The band has toured with The xx, The Vaccines and The Kills. Additionally, they have played with bands including The Pains of Being Pure at Heart, Forest Swords and Real Estate. They have played multiple music festivals around the world as well including The Great Escape, Hinterland Festival in Glasgow, South by Southwest in Austin."]}, {"page": "Bad Bonn Kilbi", "response": ["* Forest Swords"]}, {"page": "Total Loss (album)", "response": ["Total Loss is the second studio album by American musician How to Dress Well. It was released in September 2012 on Acephale Records in North America and Weird World Records in other regions. The track \"Cold Nites\", which was co-written and co-produced by Forest Swords, was released as a single."]}, {"page": "Laurel Halo", "response": ["| Forest Swords"]}, {"page": "Plisskën Festival", "response": ["Spanning a total line-up of more that 350 international artists and numerous local acts over its seven editions, the festival is noted for its genre-defying philosophy  by embracing music from a diversified background, as well as its concentration on showcasing some of the latest talent to emerge from the international music scene. Some of the acts that have appeared in previous line-ups include: Wild Beasts, 65daysofstatic, Black Lips, Mount Kimbie, Fuck Buttons, Nightmares on Wax, Vitalic, Shackleton, Death Grips, Peaches, These New Puritans, Ebo Taylor, King Krule, Fucked Up, King Khan and the Shrines, The Haxan Cloak, Dope Body, Egyptian Hip Hop, Girls Names, King Tuff, Triggerfinger, The Notwist, Andrew Weatherall, Shigeto, Forest Swords.", "Alan Braxe, Andrew Weatherall, Bong-Ra, Camera, College, Dead Skeletons, Drums of Death, Forest Swords, Joker, Junior Boys, Kid606, King Khan and the Shrines, Liquid, Male Bonding, Michael Rother, Montana Cruz, Peaches, Rita Maia, Son of Kick, Team Ghost, The Notwist, Triggerfinger, Villa, We Were Promised Jetpacks", "Amelie Lens, Ath Kids, Aurora Halal, Babyfather, Beatrice Dillon, Benton, Black Athena, Charlotte De Witte, Craves, Death In Vegas, Doc Daneeka, Elijah & Skilliam, Ellen Allien, error404, flökosH, Forest Swords, Holy Monitor, Hydroessa, Klein, Kooba Tercu, La Femme, Laolu, Lord Tusk, Menta, Mueran Humanos, Nalyssa Green, Negros Tou Moria, NTS Radio, Optimo,  Prefuse 73, Psychic Ills, Runner, Someone Who Isn't Me, Strange U, The Fog Ensemble, The Four Owls, The Vagina Lips, Tuxedomoon, Vatican Shadow, XXXY, Zomby"]}, {"page": "Engravings (album)", "response": ["Engravings is the debut album by English music producer Matthew Barnes under the stage name Forest Swords. It was released on 26 August 2013 by Tri Angle.", "Category:Forest Swords albums"]}, {"page": "Tri Angle (record label)", "response": ["Tri Angle was an English record label based in London and New York established by Robin Carolan in 2010. The label released albums by serpentwithfeet, The Haxan Cloak, Vessel, Forest Swords, Holy Other, and Clams Casino.", "*Forest Swords"]}, {"page": "Rewire Festival", "response": ["Adele Cutting / AGF & Kubra Khademi / Anni Nöps / Arca & Jesse Kanda / Aurora Halal / Baiba Yurkevich / Bertus Gerssen / Blanck Mass / CAO / Carla dal Forno / Cloud Becomes Your Hand / Concertzender Live / Croatian Amor / Daniel Lanois / Daniel Wohl + Slagwerk Den Haag + Matangi Quartet / Darien Brito / Das Ensemble Ohne Eigenschaften / David Housden / Dazion / DSR Lines / Forest Swords / Gábor Lázár / GAIKA / Greg Fox / Helena Hauff / HOEK & Dieter Vandoren / Horse Lords / Igor C Silva & Trash Panda Collective / Jace Clayton / Jace Clayton presents Uproot / Jameszoo Quintet / Jeff Mills & Tony Allen / Jessy Lanza / John Broomhall / Kassel Jaeger / Kassem Mosse / Kobe van Cauwenberghe / Lorenzo Senni / Moor Mother / N.M.O. / NAH / Nimbus 3000 / Oliver Coates / Paul Weir / Pete Harden & Ensemble Klang / Peter Zinovieff & Lucy Railton / Pharmakon / Pussy Mothers / Radian / 2017 DJ-team / Ryan Teague Ensemble / S.T. Cordell / Sarathy Korwar / Sex Swing / SHXCXCHCXSH / Slowdive / Smudged Toads / SØS Gunver Ryberg / SUMS: Kangding Ray & Barry Burns (Mogwai) / Swans / The Chi Factory/ Peter Zinovieff / These Hidden Hands / This Is Not This Heat / Tony Conrad / Torus & Nikki Hock / Wing / Waclaw Zimpel / Willem Marijs + Gert-Jan Prins + Peter van Bergen / Wolf Eyes / Zs"]}, {"page": "Hypnagogic pop", "response": ["In 2010, Pitchfork launched Altered Zones, effectively an online newsletter for hypnagogic acts. Beginning that July, Altered Zones aggregated its content from a collective of leading blogs specializing in the movement. By the end of the year, OESB, now known for its roster of hypnagogic acts such as Ferraro and Mehran, had grown to be one of the most prominent underground indie labels. In January 2011, Keenon wrote that OESB was \"the imprint most associated with H-pop\" and \"in many ways ... the label of 2010\", although he mused, \"It has been interesting to see how its demographic has morphed from an early underground/Noise audience to being embraced by the fringes of indie and dance culture, helped by groups like Forest Swords, who muddy the line between H-pop and dubstep.\""]}, {"page": "List of 2017 albums", "response": ["| Forest Swords"]}, {"page": "Day for Night (festival)", "response": ["| DJ Tennis || Tim Hecker || Forest Swords || BabyFather || G Jones || Shabazz Palaces"]}, {"page": "Compassion (Forest Swords album)", "response": ["Compassion is the second studio album by British electronic music artist Forest Swords, released on 5 May 2017. The album is Forest Swords' second, following 2013's Engravings.", "The first single from the album, \"The Highest Flood\", was released on 7 March 2017. Compassion was announced on 30 March 2017, and accompanied by another track from the album, \"Arms Out\", featuring a video directed by Sam Wiehl and Forest Swords himself. On 26 April 2017, a third track, \"Panic\", was released, again with a video directed by the artist.", "Category:Forest Swords albums"]}, {"page": "Liam Young", "response": ["Young's next film Renderlands, about the outsourced render farms and animation studios in India that produce most Hollywood films, was funded by the Graham Foundation and released in 2017.In 2019, he directed the film The Machine Air, which featured a scoree by Forest Swords.", "With British electronic producer Forest Swords Young developed In the Robot Skies, a live cinema performance of his short film of the same name. Against the backdrop of Forest Swords original soundscape and a film collage directed by Young he narrates the story of a lone drone flying across time and space. Beginning in WWI the performance tells the story of how drones have evolved across time to become the dominant infrastructure they are today. The performance premiered at the 60th London International FIlm Festival."]}, {"page": "Yakamoto Kotzuga", "response": ["* He published his debut album \"Usually Nowhere\" for La Tempesta International/Sugar, which gave him the chance to share the stage with artists, such as Forest Swords, Tycho, Plaid, Lone, Jhon Talabot, Legowelt and many others"]}]}}