{"wiki_id": "http://www.wikidata.org/entity/Q14623327", "itemLabel": "Peter Giles", "itemDescription": "countertenor", "wikipedia_url": "https://en.wikipedia.org/wiki/Peter_Giles_(countertenor)", "wikipedia_page": {"main": "Peter Giles (born 1939) is a British countertenor and writer of scientific books about countertenors. Giles began his career as a boy chorister in a traditional all-male choir in London. In the years from 1961 to 1966 his teacher was the celebrated countertenor John Whitworth.\nHe first was appointed as alto lay clerk at Ely Cathedral, then at Lichfield Cathedral, followed by Canterbury Cathedral, where he was senior lay clerk from 1978 until 1994.\nDuring his career he had numerous performances as a soloist singer within the UK, but also in the US and in Canada. Occasionally he can be seen on TV with solo performances and readings.\nHe took additional lessons by Arthur Hewlett and specialised on 'Sinus Tone Control', a sound technique by Ernest George White, which puts special emphasis for singers on using the resonances in the head. In this method he gives lessons for speakers and singers as a professional voice teacher.\nHe performed with the male trio Canterbury Clerkes for 25 years. In 2000, he founded the mixed voice quintet Quodlibet, with which he made three albums. Besides that he plays the organ at different churches and conducts and coaches choirs.\nGiles is also known for his publications on the subject of countertenor.", "link_mentions": [{"page": "Countertenor", "response": ["The vocal range of a countertenor is equivalent to that of the female contralto or mezzo-soprano voice types. A trained countertenor will typically have a vocal center similar in placement to that of a contralto or mezzo-soprano. Peter Giles, a professional countertenor and noted author on the subject, defines the countertenor as a musical part rather than as a vocal style or mechanism.  In modern usage, the term \"countertenor\" is essentially equivalent to the medieval term contratenor altus (see above).  In this way, a countertenor singer can be operationally defined as a man who sings the countertenor part, whatever vocal style or mechanism is employed. The countertenor range is generally equivalent to an alto range, extending from approximately G3 to D5 or E5.J. B. Steane, \"Countertenor\", in The New Grove Dictionary of Opera, I, p. 999. In comparison to female voices the male voice usually has an extended range towards the low notes, but the lowest parts of the range are usually not used.  In actual practice, it is generally acknowledged that a majority of countertenors sing with a falsetto vocal production for at least the upper half of this range, although most use some form of \"chest voice\" (akin to the range of their speaking voice) for the lower notes.  The most difficult challenge for such a singer is managing the lower middle range, for there are normally a few notes (around B3) that can be sung with either vocal mechanism, and the transition between registers must somehow be blended or smoothly managed."]}, {"page": "Peter Giles", "response": ["Peter Giles may refer to:", "*Peter Giles (countertenor) (born 1939), British countertenor and voice teacher", "*Peter Giles (musician) (born 1944), British bass player and vocalist", "*Peter Giles (philologist) (1860–1935), philologist and Master of Emmanuel College, Cambridge", "*Peter Giles (canoeist) (born 1970), Canadian sprint kayaker", "*Peter Giles (footballer) (born 1958), Australian footballer"]}, {"page": "John Whitworth (musician)", "response": ["While still at Westminster Abbey, Whitworth was organist of Christ Church, Chelsea, in 1964–1965 and of St Paul's, Covent Garden, from 1965 to 1970. In 1965 he was also appointed as a Professor at the Guildhall School of Music and Drama. Among the students he taught there was the countertenor Peter Giles.Peter Giles, A Basic Countertenor Method for Teacher and student (Kahn & Averill, London, 2005, ), p. viii"]}]}}