{"wiki_id": "http://www.wikidata.org/entity/Q1461338", "itemLabel": "George Whyte", "itemDescription": "British composer and dramatist", "wikipedia_url": "https://en.wikipedia.org/wiki/George_Whyte", "wikipedia_page": {"main": "George R. Whyte (born 11 July 1933 in Budapest; died 31 August 2012 in London) was an author, composer, dramatist and art collector. His early education was at Highgate Junior School. A British national of Hungarian Jewish extraction, the Holocaust and the loss of many members of his family in Auschwitz have influenced his creative works which have increasingly focused on the struggle against social injustices especially racism.", "link_mentions": [{"page": "Dreyfus affair", "response": ["* 1994  George Whyte, The Affair in Song; Bibliothèque de documentation internationale contemporaine; Paris, Flammarion.", "* 1996  George Whyte, The Dreyfus Trilogy, Inter Nationes.", "* 2006  George Whyte, The Dreyfus Affair, A Chronological History, Palgrave Macmillan.", "* 2007  George Whyte. Admission is not Acceptance – Reflections on the Dreyfus Affair. Antisemitism. London Valentine Mitchell, 2007; Paris Editions Le Manuscript/Unesco 2008, Buenos Aires Lilmod 2009, Moscow Xonokoct 2010.", "* 1994  Rage and Outrage, by George Whyte, French film – Produced by ARTE – Colour", "* 1992  AJIOM/Captain Dreyfus, Musical. Music and text by George Whyte.", "* 1994 (De En) The Dreyfus Trilogy by George Whyte (in collaboration with Luciano Berio, Jost Meier and Alfred Schnittke) comprising the opera Dreyfus-Die Affäre (Deutsche Oper Berlin, 8 May 1994; Theater Basle, 16 October 1994; The Dreyfus Affair New York City Opera, April 1996); the dance drama Dreyfus – J'accuse (Oper der Stadt Bonn, 4 September 1994) and the musical satire Rage et Outrage (Arte, April 1994; Zorn und Schande, Arte 1994; Rage and Outrage Channel 4, May 1994).", "* 2008 Dreyfus In time by George Whyte, Opernhaus Zurich, December 2008; Jüdisches Museum Berlin, May 2009. Also in German, English, French, Hungarian, Hebrew and Czech.", "* 1995  The Dreyfus Affair, interview with George Whyte, France Culture, 25 March 1995.", "* 1998  J'accuse, George Whyte, Canadian Broadcasting Service (CBS), 10 October 1998.", "* 2005  The Dreyfus Affair, interview with George Whyte, BBC Radio 3. By John Pilgrim, 28 October 2005."]}, {"page": "Alfred Dreyfus", "response": ["* George Whyte, an authority on the Dreyfus affair who has authored a large body of literary and stage works on Dreyfus and the Dreyfus affair."]}, {"page": "George White", "response": ["*George Whyte (1933–2012), English author, composer, dramatist and art collector", "*George Whyte (footballer) (1909–1992), Scottish professional footballer"]}, {"page": "Walter Buckley (footballer)", "response": ["He joined Lincoln City of the Third Division North ahead of the 1930–31 season, went straight into the starting eleven, and remained in it.  He scored his first Football League goal to open the scoring 20 minutes into a 3–0 win against Walsall on 12 September: after his free kick was blocked, \"he recovered possession and fired in from a crowd of players, the ball twisting over the goal-line a second before Riley dashed up to make sure.\" He was rested for a couple of matches in mid-December, apart from which he was ever-present as Lincoln City led the table for much of the season before dropping to second place in the last three games. He continued ever-present until 9 January 1932, when he injured a leg during the second half of a match against Rochdale, and played on at outside left despite the pain. The leg was X-rayed afterwards and revealed a broken fibula. He returned to reserve-team football after two months out, and resumed first-team duties afer another month, playing the last five matches of the season as Lincoln won the Third Division North title and gained promotion to the Second Division. He was retained for 1932–33, and began the season in the league eleven. He missed two games in September after the taxi in which he and four team-mates were travelling to Swansea Town's ground was in collision with a bus, \"broken glass inflicting deep cuts immediately above and below the left eyelid. Four stitches [were] inserted in each wound.\" George Whyte took over the left-half position in December, and Buckley played just twice more that season. He was listed as open to transfer, and signed for Rochdale in July 1933."]}, {"page": "Whyte, George", "response": ["#redirectGeorge Whyte"]}]}}