{"wiki_id": "http://www.wikidata.org/entity/Q14772822", "itemLabel": "Hugh Foss", "itemDescription": "British cryptographer", "wikipedia_url": "https://en.wikipedia.org/wiki/Hugh_Foss", "wikipedia_page": {"main": "Hugh Rose Foss (13 May 1902 – 23 December 1971) was a British cryptanalyst. At Bletchley Park during World War II he made significant contributions both to the breaking of the German Enigma code and headed the section tasked with breaking Japanese Naval codes.", "link_mentions": [{"page": "Bletchley Park", "response": ["By mid-1945, well over 100 personnel were involved with this operation, which co-operated closely with the FECB and the US Signal intelligence Service at Arlington Hall, Virginia. In 1999, Michael Smith wrote that: \"Only now are the British codebreakers (like John Tiltman, Hugh Foss, and Eric Nave) beginning to receive the recognition they deserve for breaking Japanese codes and cyphers\"."]}, {"page": "Enigma machine", "response": ["The Enigma C quickly gave way to Enigma D (1927). This version was widely used, with shipments to Sweden, the Netherlands, United Kingdom, Japan, Italy, Spain, United States and Poland. In 1927 Hugh Foss at the British Government Code and Cypher School was able to show that commercial Enigma machines could be broken, provided suitable cribs were available.Bletchley Park Trust Museum display Soon, the Enigma D would pioneer the use of a standard keyboard layout to be used in German computing. This layout was referred to as \"QWERTZ\" and is very similar to the standard American keyboard format of today."]}, {"page": "GCHQ", "response": ["During the Second World War, GC&CS was based largely at Bletchley Park, in present-day Milton Keynes, working on understanding the German Enigma machine and Lorenz ciphers. In 1940, GC&CS was working on the diplomatic codes and ciphers of 26 countries, tackling over 150 diplomatic cryptosystems. Senior staff included Alastair Denniston, Oliver Strachey, Dilly Knox, John Tiltman, Edward Travis, Ernst Fetterlein, Josh Cooper, Donald Michie, Alan Turing, Gordon Welchman, Joan Clarke, Max Newman, William Tutte, I. J. (Jack) Good, Peter Calvocoressi and Hugh Foss."]}, {"page": "Dilly Knox", "response": ["The Enigma machine became available commercially in the 1920s. In Vienna in 1925, Knox bought the Enigma 'C' machine evaluated by Hugh Foss in 1927 on behalf of GC&CS. Foss found \"a high degree of security\" but wrote a secret paper describing how to attack the machine if cribs — short sections of plain text — could be guessed. When — a decade later — Knox picked up this work, he developed a more effective algebraic system (rodding) based on the principles described by Foss.", "GC&CS began to discuss Enigma with France's Deuxième Bureau in 1938, obtaining from the Bureau details of Wehrmacht Enigma supplied by Asché and signal intercepts, some of which must have been made in Eastern Europe. This led the French to disclose their links with Polish cryptographers.  Knox, Hugh Foss and Alastair Denniston represented GC&CS at the first Polish-French-British meeting at Paris in January 1939. The Poles were under order to disclose nothing of importance at this time, leaving the British codebreakers disappointed. However Knox's description of his system of rodding impressed the Polish codebreakers, and they requested his presence at a second meeting.", "To break non-steckered Enigma machines (those without a plugboard), Knox (building on earlier research by Hugh Foss) developed a system known as 'rodding', a linguistic as opposed to mathematical way of breaking codes. This technique worked on the Enigma used by the Italian Navy and the German Abwehr. Knox worked in 'the Cottage', next door to the Bletchley Park mansion, as head of a research section, which contributed significantly to cryptanalysis of the Enigma."]}, {"page": "Banburismus", "response": ["The bigram tables themselves were not part of the capture, but Hut 8 were able to use the settings-lists to read retrospectively, all the Kriegsmarine traffic that had been intercepted from 22 to 27 April. This allowed them do a partial reconstruction of the bigram tables and start the first attempt to use Banburismus to attack Kriegsmarine traffic, from 30 April onwards. Eligible days were those where at least 200 messages were received and for which the partial bigram-tables deciphered the indicators. The first day to be broken was 8 May 1940, thereafter celebrated as \"Foss's Day\" in honour of Hugh Foss, the cryptanalyst who achieved the feat."]}, {"page": "List of people associated with Bletchley Park", "response": ["* Hugh Foss, cryptographer, head of the Japanese Naval Section (Hut 7) from 1942 to 1943"]}, {"page": "St John's Town of Dalry", "response": ["*Hugh Foss 1902–1971,  cryptographer and Scottish country dance deviser, worked on the Enigma machines at Bletchley Park during World War II. Lived at Gleddarroch in the town from his retirement in 1953 until his death in 1971. Buried in Dalry Kirkyard."]}, {"page": "Wee Cooper O'Fife", "response": ["The Wee Cooper O'Fife is also the name of a Scottish country dance devised by Hugh Foss to fit the tune of the folk song, which is unusual in having ten-bar rather eight-bar phrases. "]}, {"page": "Oliver Strachey", "response": ["In World War I, he was in British Military (Army) Intelligence, MI1. Between the wars, he was in the Government Code and Cypher School. In 1934, Strachey and Hugh Foss broke the Japanese naval attaché machine cipher."]}, {"page": "Signals intelligence in modern history", "response": ["In early 1942, a six-month crash course in Japanese, for 20 undergraduates from Oxford and Cambridge, was started by the Inter-Services Special Intelligence School in Bedford, in a building across from the main Post Office. This course was repeated every six months until war's end. Most of those completing these courses worked on decoding Japanese naval messages in Hut 7, under John Tiltman. By mid-1945 well over 100 personnel were involved with this operation, which co-operated closely with the FECB and the US Signal intelligence Service at Arlington Hall, Virginia. Because of these joint efforts, by August of that year the Japanese merchant navy was suffering 90% losses at sea. In 1999, Michael Smith wrote that: \"Only now are the British codebreakers (like John Tiltman, Hugh Foss, and Eric Nave) beginning to receive the recognition they deserve for breaking Japanese codes and cyphers\"."]}, {"page": "Hut 7", "response": ["Hut 7 was a wartime section of the Government Code and Cypher School (GC&CS) at Bletchley Park tasked with the solution of Japanese naval codes such as JN4, JN11, JN40, and JN-25. The hut was headed by Hugh Foss who reported to Frank Birch, the head of Bletchley's Naval section.", "The section was headed by William \"Nobby\" Clarke with Harry Shaw and Ernest Hobart-Hampden.Stripp, Alan, Codebreaker in the Far East, London, England ; Totowa, NJ : F. Cass, 1989. .  Cf. p.13  These were later joined by Eric Nave, seconded from the Royal Australian Navy, John Tiltman, and Hugh Foss.", "* Hugh Foss, head of Hut 7"]}, {"page": "Foss (surname)", "response": ["*Hugh Foss (1902–1971), British cryptographer", "*Hugh Foss (bishop) (1848-1932), Anglican bishop"]}, {"page": "Hugh Foss (bishop)", "response": ["Foss married, 24 July 1901 in Kobe, Lina Janet Ovans, daughter of John Lambert Ovans, of Surrey. His son Hugh Foss was a cryptanalyst for the Government Code and Cypher School at Bletchley Park during the Second World War where he headed the Japanese section. Another son, Charles Calveley Foss was awarded the Victoria Cross in the First World War."]}, {"page": "Type A Cipher Machine", "response": ["The code was broken successfully by three independently working groups. The British solution came first, with Hugh Foss and Oliver Strachey working out the code  in 1934, and Harold Kenworthy's shop producing a replica, the \"J machine\", a year later. American attempts to break the system waited until 1935. In the Army SIS group, the system was broken by Frank Rowlett and Solomon Kullback; for the navy, Agnes Driscoll is generally credited. (She actually solved the Orange (or M-1) cipher used by naval attaches, but as it turned out the two systems were essentially the same.) The Americans also constructed a replica machine to expedite solutions; this machine had two half-rotors to solve the vowels and consonants separately. The SIS group originally referred to it simply as the \"Japanese code machine\", but decided that so descriptive a term was a security risk; as it was the first Japanese machine cipher solved, they decided to start at the beginning of the spectrum, and named it \"RED\"."]}, {"page": "Far East Combined Bureau", "response": ["Smith wrote that: Only now are the British codebreakers (like John Tiltman, Hugh Foss and Eric Nave) beginning to receive the recognition they deserve for breaking Japanese codes and cyphers.Smith (2001) page 151"]}, {"page": "Foss, Hugh Rose", "response": ["#redirectHugh Foss"]}, {"page": "Polharrow Burn", "response": ["It gives its name to a Scottish country dance by the cryptographer and Scottish country dance deviser Hugh Foss, which appeared in his Glendarroch Scottish Country Dance Collection in 1966. He published several volumes of these from his own impress, Glendarroch Press. He lived in his retirement at Glendarroch in St John's Town of Dalry and died in 1971."]}]}}