{"wiki_id": "http://www.wikidata.org/entity/Q1476802", "itemLabel": "Francis Legatt Chantrey", "itemDescription": "English artist (1781-1841)", "wikipedia_url": "https://en.wikipedia.org/wiki/Francis_Leggatt_Chantrey", "wikipedia_page": {"main": "Sir Francis Leg(g)att Chantrey  (7 April 1781 – 25 November 1841) was an English sculptor. He became the leading portrait sculptor in Regency era Britain, producing busts and statues of many notable figures of the time. Chantrey's most notable works include the statues of King George IV (Trafalgar Square); King George III (Guildhall), and George Washington (Massachusetts State House). He also executed four monuments to military heroes for St Paul’s Cathedral, London. He left the Chantrey Bequest (or Chantrey Fund) for the purchase of works of art for the nation, which was available from 1878 after the death of his widow.", "link_mentions": [{"page": "John Raphael Smith", "response": ["Smith's third relationship was with Hannah Croome (1757–1829), by whom he had another two children, who survived him.  In 1793 he opened the Morland Gallery in King Street, Covent Garden, whence he issued catalogues of his prints.  By 1798 he had listed over 302 publications in addition to his prints.  He painted subject-pictures such as the Unsuspecting Maid, Inattention and the Moralist, exhibiting in the Royal Academy from 1779 to 1790. Upon the decline of his business as a printseller he made a tour through the north and midland counties of England, producing much hasty and indifferent work, and settled in Doncaster. The artistic merit of the sculptor Sir Francis Legatt Chantrey was spotted by Smith, who gave him lessons in painting. Chantry later did a bust of Smith in appreciation, that is now in the Victoria and Albert Museum, London; and there is a painting of Chantry by Smith. From 1808 Smith grew increasingly deaf.  Based in Doncaster he travelled extensively through the North of England.  He died at his home there, and was buried in the parish churchyard."]}]}}