{"wiki_id": "http://www.wikidata.org/entity/Q1470796", "itemLabel": "Frederick Sandys", "itemDescription": "Pre-Raphaelite painter (1829-1904)", "wikipedia_url": "https://en.wikipedia.org/wiki/Frederick_Sandys", "wikipedia_page": {"main": "Anthony Frederick Augustus Sandys (born Antonio Frederic Augustus Sands; 1 May 1829 – 25 June 1904), usually known as Frederick Sandys, was a British painter, illustrator, and draughtsman, associated with the Pre-Raphaelites. He was also associated with the Norwich School of painters.", "link_mentions": [{"page": "Eleanor of Aquitaine", "response": ["Judy Chicago's artistic installation The Dinner Party features a place setting for Eleanor, and she was portrayed by Frederick Sandys in his 1858 painting, Queen Eleanor."]}, {"page": "May 1", "response": ["*  1829   – Frederick Sandys, English painter and illustrator (d. 1904)"]}, {"page": "Mary Magdalene", "response": ["File:Mariya Magdalena.jpg|Mary Magdalene (1858–1860) by Frederick Sandys"]}, {"page": "Pre-Raphaelite Brotherhood", "response": ["Many members of the ‘inner’ Pre-Raphaelite circle (Dante Gabriel Rossetti, John Everett Millais, William Holman Hunt, Ford Madox Brown, Edward Burne-Jones) and ‘outer’ circle (Frederick Sandys, Arthur Hughes, Simeon Solomon, Henry Hugh Armstead, Joseph Noel Paton, Frederic Shields, Matthew James Lawless) were working concurrently in painting, illustration, and sometimes poetry. Victorian morality judged literature as superior to painting, because of its “noble grounds for noble emotion.” Robert Buchanan (a writer and opponent of the Pre-Raphaelite Brotherhood) felt so strongly about this artistic hierarchy that he wrote: “The truth is that literature, and more particularly poetry, is in a very bad way when one art gets hold of another, and imposes upon it its conditions and limitations.\" as cited in Welland, D.S.R. The Pre-Raphaelites in Literature and Art. London, UK: George G. Harrap & Co. Ltd., 14. This was the hostile environment in which Pre-Raphaelites were defiantly working in various media. The Pre-Raphaelites attempted to revitalize subject painting, which had been dismissed as artificial. Their belief that each picture should tell a story was an important step for the unification of painting and literature (eventually deemed the Sister Arts), or at least a break in the rigid hierarchy promoted by writers like Robert Buchanan."]}, {"page": "Norwich School of painters", "response": ["File:Sandys - Study of the head of a young mulatto woman -full face.jpg|Frederick Sandys, Study of the head of a young mulatto woman  full face (c. 1859), Art Gallery of New South Wales", "*Frederick Sandys"]}, {"page": "Cheyne Walk", "response": ["* Frederick Sandys, painter, as Rossetti's housemate 1866–67."]}, {"page": "Birmingham Museum and Art Gallery", "response": ["Sandys, Frederick - Morgan le Fay.JPG|Frederick Sandys, Morgan le Fay, 1864 ", "Medea-Sandys.jpg|Frederick Sandys, Medea"]}, {"page": "Walter Crane", "response": ["Crane was the second son of Thomas Crane, a portrait painter and miniaturist, and Marie Crane (née Kearsley), the daughter of a prosperous malt-maker. His elder brother Thomas would also go into illustration, and sister Lucy was a noted writer. He was a fluent follower of the newer art movements and he came to study and appreciate the detailed senses of the Pre-Raphaelite Brotherhood, and was also a diligent student of the renowned artist and critic John Ruskin. A set of coloured page designs to illustrate Tennyson's \"Lady of Shalott\" gained the approval of wood-engraver William James Linton to whom Walter Crane was apprenticed for three years in 1859–62. As a wood-engraver he had abundant opportunity for the minute study of the contemporary artists whose work passed through his hands, of Pre-Raphaelites Dante Gabriel Rossetti and John Everett Millais, as well as Sir John Tenniel, the illustrator of Alice in Wonderland, and Frederick Sandys. He was a student who admired the masters of the Italian Renaissance, however he was more influenced by the Elgin marbles in the British Museum. A further and important element in the development of his talent was the study of Japanese colour-prints, the methods of which he imitated in a series of toy books, which started a new fashion."]}, {"page": "1864 in art", "response": ["* Frederick Sandys – Morgan le Fay"]}, {"page": "1868 in art", "response": ["* Frederick Sandys – Medea"]}]}}