{"wiki_id": "http://www.wikidata.org/entity/Q14817277", "itemLabel": "Hal Cruttenden", "itemDescription": "British comedian", "wikipedia_url": "https://en.wikipedia.org/wiki/Hal_Cruttenden", "wikipedia_page": {"main": "Hal Dominic Bart Cruttenden (born 9 September 1969) is an English stand-up comedian, writer and actor who has appeared on Mock the Week, Live at the Referendum, Live At The Apollo, Have I Got News for You, The 11 O'Clock Show, Richard Herring's Leicester Square Podcast, The Great British Bake Off: An Extra Slice, Pointless Celebrities, and Richard Osman's House of Games.\nHe has also written for The Omid Djalili Show and The Rob Brydon Show. He was nominated for Best Newcomer at the 2002 Edinburgh Comedy Awards.", "link_mentions": [{"page": "List of comedians", "response": ["* Hal Cruttenden (born 1969)"]}, {"page": "List of Have I Got News for You episodes", "response": ["|Hal Cruttenden", "|Hal Cruttenden", "|Hal Cruttenden", "|Hal Cruttenden"]}, {"page": "Angellica Bell", "response": ["From 7–11 March 2016, Bell took part in a challenge for Sport Relief, called 'Hell on High Seas', in which she, along with five other celebrities: Suzi Perry, Doon Mackichan, Alex Jones, Hal Cruttenden and Ore Oduba sailed 1,000 miles from Belfast to London. Coverage of this challenge was shown on The One Show and a special programme aired called Hell on High Seas in March 2016."]}, {"page": "List of Edinburgh Comedy Award winners", "response": ["|Hal CruttendenNatalie HaynesReginald D. Hunter"]}, {"page": "Live at the Apollo (TV series)", "response": ["|Hal Cruttenden and Simon Evans", "|Hal Cruttenden", "|Tanyalee Davis, Hal Cruttenden and Josh Widdicombe", "* Hal Cruttenden"]}, {"page": "Rob Brydon's Annually Retentive", "response": ["| James Corden, Hal Cruttenden"]}, {"page": "Dominic Holland", "response": ["His second radio series on Radio 4, Holland's Shorts. was a series of comic monologues written and performed by Holland. In 2011 he appeared  on Radio 4's The News Quiz, hosted by Sandi Toksvig. Holland was co-writer of Hal, a 2017 sitcom commissioned by BBC Radio 4, that starred Hal Cruttenden, in which Holland also appeared. He also made regular appearances in the early seasons of BBC Radio 5 Live's comedy sports panel show, Fighting Talk."]}, {"page": "Shaun Keaveny", "response": ["On 16 February 2013, Keaveny took part in the fifth series of Let's Dance for Comic Relief as a member of Destiny's Dad alongside fellow stand up comedians Hal Cruttenden and Mark Dolan."]}, {"page": "Chortle Awards", "response": ["* Breakthrough act: Rev Obadiah Steppenwolfe III (nominees: Hal Cruttenden, Micky Flanagan)", "* Best breakthrough act: Jason Manford (nominees: Hal Cruttenden, Josie Long)", "* Club comic: Alun Cochrane (nominees: Adam Bloom, Dana Alexander, Hal Cruttenden, Michael Fabbri)"]}, {"page": "Mark Dolan", "response": ["In February 2013, Dolan took part in the fifth series of Let's Dance for Comic Relief as a member of \"Destiny's Dad\" alongside fellow stand-up comedians Hal Cruttenden and Shaun Keaveny."]}, {"page": "Abigail Cruttenden", "response": ["Her grandmother, Cynthia Coatts, ran the Rosslyn School of Dance and Drama in London, while her late mother, Julia Cruttenden, ran the stage make-up school Greasepaint in London. Her brother is Hal Cruttenden, the stand-up comedian."]}, {"page": "List of Mock the Week episodes", "response": ["|Hal Cruttenden", "|Hal Cruttenden and Miles Jupp", "|Hal Cruttenden and Holly Walsh", "|Hal Cruttenden and Romesh Ranganathan", "|Ed Byrne, Hal Cruttenden and Zoe Lyons"]}, {"page": "Debatable (game show)", "response": ["* Hal Cruttenden"]}, {"page": "List of Old Paulines", "response": ["*Hal Cruttenden (born 1969); actor and comedian"]}, {"page": "The Half Moon, Putney", "response": ["It has also hosted comedy, including Billy Connolly, Andy Parsons, Harry Hill, Rufus Hound, Shappi Khorsandi, Norman Lovett, Bob Mills, Milton Jones, Al Murray, Stewart Lee, Richard Herring, Jack Whitehall, Alistair McGowan, Katherine Ryan, Cardinal Burns, Reginald D. Hunter, Stewart Francis, Bridget Christie, Josh Widdicombe, Sara Pascoe, Rob Beckett, Sean Hughes, Kevin Eldon, Henning Wehn, Hal Cruttenden, Holly Walsh, Danny Bhoy, Aisling Bea and James Acaster."]}, {"page": "The Jon Richardson Show", "response": ["Hal Cruttenden,"]}, {"page": "Celebrity Mastermind", "response": ["| rowspan=\"4\"|4 January 2014 ||Hal Cruttenden || The Rocky Films || Winner", "| Hal Cruttenden ||Magnus Magnusson ||"]}, {"page": "Michael McIntyre's Comedy Roadshow", "response": ["| Hal CruttendenMike GunnSeann Walsh"]}, {"page": "List of Would I Lie to You? episodes", "response": ["|Hal Cruttenden and Kelly Hoppen"]}, {"page": "List of Christmas television episodes and specials in the United Kingdom", "response": ["| rowspan=\"3\"|Noel at the Apollo || 2015 || Nina Conti (host), Tanyalee Davis, Hal Cruttenden & Josh Widdicombe"]}, {"page": "List of Royal Variety Performances", "response": ["| Michael Bublé, Alexandra Burke, Hal Cruttenden, Miley Cyrus, Diversity, Adam Hills, Lady Gaga, Bob Golding, Roy WalkerAlthough both Bob Golding and Roy Walker performed, neither act was shown on the subsequent televised show Les 7 Doigts de la Main, Katherine Jenkins, Paddy McGuinness, Jason Manford, Pilobolus featuring the music of David Poe, Mika, Bette Midler accompanied by Jake Shimabukuro, André Rieu, Faryl Smith and The Soldiers, Paul Zerdin, the Heavy Cavalry and Cambrai Band, the cast of Sister Act the Musical, with Whoopi Goldberg and the cast of Here Come the Girls (Anastacia, Lulu and Chaka Khan)", "| Olly Murs, Robbie Williams, Gary Barlow, Attraction, Dame Edna Everage, the cast of Charlie and the Chocolate Factory the Musical, Bryn Terfel, Jessie J, Mary J. Blige, Jimmy Carr, Torvill and Dean, Chas & Dave, the cast of I Can't Sing! The X Factor Musical, Caro Emerald, Flavia Cacace, Gareth Malone & Voices, Hal Cruttenden, Jason Byrne, John Newman, Rizzle Kicks, Seann Walsh and the cast of Stephen Ward the Musical"]}, {"page": "List of acts that have appeared on the Royal Variety Performance", "response": ["*Hal Cruttenden: 2009"]}, {"page": "Alex Jones (Welsh presenter)", "response": ["From 7–11 March 2016, Jones took part in her second challenge for Sport Relief, called 'Hell on High Seas', in which she, along with five other celebrities: Suzi Perry, Doon Mackichan, Angellica Bell, Hal Cruttenden and Ore Oduba sailed 1,000 miles from Belfast to London. During the Sport Relief telethon, it was announced the team had raised £1,062,868."]}, {"page": "The Rob Brydon Show", "response": ["| 4 ||  || Sir Terry Wogan || Sharleen Spiteri || Hal Cruttenden"]}, {"page": "Mrs Dalloway (film)", "response": ["* Hal Cruttenden – Young Hugh"]}, {"page": "Gavin Webster", "response": ["His many radio jobs have included stints on BBC Radio 4 on the sitcom Hal as Barry with Hal Cruttenden, The Show What You Wrote with John Thompson, and The News Quiz."]}, {"page": "ITV Specials", "response": ["| Angellica BellJoe PasqualeJodie KiddHal CruttendenJennie Bond"]}, {"page": "Richard Herring's interview podcasts", "response": ["|Hal Cruttenden"]}, {"page": "Duck Quacks Don't Echo", "response": ["| Paul Hollywood (13)Gabby Logan (15)Hal Cruttenden (15)"]}, {"page": "Just the Tonic", "response": ["Other comedians to have performed at Just the Tonic include: Michael McIntyre, Peter Kay, Bill Bailey, Tim Vine, Jo Brand, Russell Howard, Kevin Bridges, Dylan Moran, Frankie Boyle, John Bishop, Reginald D Hunter, Mark Watson, Richard Herring, Ed Byrne, Ardal O'Hanlon, Russell Kane, Shappi Khorsandi, Stewart Lee, Jack Whitehall, Jack Dee, Sean Lock, Stephen K Amos, Jo Caulfield, Jason Byrne, Andrew Maxwell, Simon Amstell, Alan Davies, Paul Foot, Rob Rouse, Tony Law, Gary Delaney, Andrew Maxwell, Henning Wehn, Hal Cruttenden, Sean Hughes, Steve Hughes, Phill Jupitus, Josie Long, Andi Osho and Andrew Lawrence."]}, {"page": "Weekend (talk show)", "response": ["| Anneka Rice, Hal Cruttenden, John McArdle and Clare Maguire "]}, {"page": "Alan Davies: As Yet Untitled", "response": ["| Stephen Mangan, Sarah Millican, Zoe Lyons and Hal Cruttenden"]}, {"page": "The Great British Bake Off: An Extra Slice", "response": ["Brand and three rotating panelists appear on each episode. The panelists are generally a chef or cooking expert, such as Michel Roux Jr. or Rosemary Shrager, a comedian such as Hal Cruttenden, and a well-known figure who is a fan of the show. The panel has also featured past bakers, including winners Nancy Birtwhistle and Nadiya Hussain. A typical episode begins with Brand reviewing the events of the previous episode while showing clips, including unseen footage from the tent, usually humorous outtakes. Afterwards, she interviews the panelists about the current episode and what happened in the tent that week. In the next segment, she presents images of bakes viewers have sent in, the talks about the bakes the audience have brought to the studio, at least one of which the panelists try. In the final segment, the most recently eliminated baker joins the panel and is interviewed again by Brand. The baker is invited to bring one of their \"less-successful bakes\" which Brand and the panel sample. The segment concludes with the baker being presented a cake that captures their time in the tent. Brand concludes the show by showing a preview of what will happen in the next episode of the main show."]}, {"page": "Cruttenden", "response": ["* Hal Cruttenden  (born 1969), English stand-up comedian, writer and actor"]}, {"page": "The John Bishop Show (2015 TV series)", "response": ["| 4 || 20 June 2015 || The Vaccines, The Overtones, Vikki Stone, Hal Cruttenden, Tanyalee Davis, Spark Fire Dance, Jimeoin & Brian Cox"]}, {"page": "The Saturday Show (2015 TV series)", "response": ["| Claire Goose, Hal Cruttenden and Rav Wilding"]}, {"page": "It's Not Me, It's You (game show)", "response": ["|Hal Cruttenden and Louie Spence"]}, {"page": "Pierre Novellie", "response": ["He is known for his work as a comedian, actor, and writer, having recently been seen and heard on The Mash Report, Chris Ramsey's Stand Up Central  and The Now Show. He was also a guest on BBC Radio 4’s The Rest is History hosted by Frank Skinner. Other highlights include appearing on the Joke Thieves pilot for BBC Two opposite Marcus Brigstocke, BBC Three’s Edinburgh Comedy Fest Live  and 4OD’s comedy series Taxi Gags. Pierre’s writing credits include Spitting Image, Mock The Week, The Mash Report, ITV’s Newszoids, Adam Buxton’s Shed of Christmas. In addition to his television and radio credits and his own live shows, Pierre has supported Frank Skinner, Hal Cruttenden and Gary Delaney on tour."]}, {"page": "The Nightly Show (British TV series)", "response": ["| Louise Redknapp, Hal Cruttenden and Jason Manford"]}]}}