{"wiki_id": "http://www.wikidata.org/entity/Q14830136", "itemLabel": "David Baldwin", "itemDescription": "British historian, author, and former university lecturer", "wikipedia_url": "https://en.wikipedia.org/wiki/David_Baldwin_(historian)", "wikipedia_page": {"main": "David Baldwin  ( 22 December 1946 (?) – 4 April 2016) was a British historian, author and former university lecturer, who lived near Leicester, England.\nBaldwin specialised in late Medieval history—\"the great medieval families of the Midlands\"—and wrote several books about the people and events of the Wars of the Roses. Before retiring from teaching, Baldwin had previously worked as a lecturer at both the University of Leicester and the University of Nottingham. In 1986, over 25 years before the 2012 excavation and the discovery of the king's body, he predicted that Richard III's remains would be found at Greyfriars, Leicester.In his 2010 book, Robin Hood: The English Outlaw Unmasked, Baldwin argued  that the 'real' Robin Hood was Roger Godberd, a disinherited supporter of Simon de Montfort.> He drew attention to the many similarities between Godberd's career and the stories told of Robin in the earliest ballads, and to a grave slab in Loxley churchyard in Warwickshire which appeared to be identical to one associated with Robin in earlier centuries.\nIn his 2007 book, The Lost Prince: The Survival of Richard of York, Baldwin discussed the possibility that the younger of the Princes in the Tower, Prince Richard, survived, and was the \"Richard Plantagenet\" who died in December 1550 at Eastwell in Kent. Richard had worked as a bricklayer at St. John's Abbey, Colchester, until 1539, but, unusually for someone of his class, could read Latin. He is sometimes said to have been an illegitimate son of King Richard III.Baldwin was elected a Fellow of the Royal Historical Society in 2012.A religious man, Baldwin was a member of a Christadelphian congregation in Leicester.", "link_mentions": [{"page": "Robin Hood", "response": ["David Baldwin identifies Robin Hood with the historical outlaw Roger Godberd, who was a die-hard supporter of Simon de Montfort, which would place Robin Hood around the 1260s.See BBC website. Retrieved 19 August 2008 on the Godberd theory. \"The Real Robin Hood \". There are certainly parallels between Godberd's career and that of Robin Hood as he appears in the Gest. John Maddicott has called Godberd \"that prototype Robin Hood\".J.R. Maddicott, \"Edward the First and the Lessons of Baronial Reform\" in Coss and Loyd ed, Thirteenth century England: 1 Proceedings of the Newcastle Upon Tyne Conference 1985, Boydell and Brewer, p. 2. Some problems with this theory are that there is no evidence that Godberd was ever known as Robin Hood and no sign in the early Robin Hood ballads of the specific concerns of de Montfort's revolt.Dobson and Taylor, introduction."]}, {"page": "Edward V of England", "response": ["The princes' fate after their disappearance remains unknown, but the most widely accepted theory is that they were murdered on the orders of their uncle, King Richard.Horrox, Rosemary. \"Edward V of England\". Oxford Dictionary of National Biography. Oxford University Press. Retrieved 25 August 2013.  Thomas More wrote that they were smothered to death with their pillows, and his account forms the basis of William Shakespeare's play Richard III, in which Tyrrell murders the princes on Richard's orders. In the absence of hard evidence a number of other theories have been put forward, of which the most widely discussed are that they were murdered on the orders of Henry Stafford, 2nd Duke of Buckingham, or by Henry Tudor. However, Pollard points out that these theories are less plausible than the straightforward one that they were murdered by their uncle who in any case controlled access to them and was therefore regarded as responsible for their welfare. In the period before the boys' disappearance, Edward was regularly being visited by a doctor; historian David Baldwin extrapolates that contemporaries may have believed Edward had died of an illness (or as the result of attempts to cure him).David Baldwin, What happened to the Princes in the Tower?, BBC History: 2013 An alternative theory is that Perkin Warbeck, a pretender to the throne, was indeed Richard, Duke of York, as he claimed, having escaped to Flanders after his uncle's defeat at Bosworth to be raised by his aunt, Margaret, Duchess of Burgundy."]}, {"page": "Elizabeth Woodville", "response": ["Elizabeth Woodville was born in about 1437, possibly in October,No record of Elizabeth's birth survives. She was the product of a secret and socially-unequal marriage between Richard Woodville, a prominent English gentleman, and Jacquetta of Luxembourg, the genuinely-aristocratic eldest daughter of Peter I of Luxembourg, Count of Saint-Pol, Conversano and Brienne. The marriage caused a scandal when it came to public notice and the couple were fined, and, on 24 October 1437, pardoned for marrying without royal permission. David Baldwin conjectures that the pardon coincided with the birth of Elizabeth Woodville, the couple's firstborn child. See Baldwin, David, Elizabeth Woodville: The Mother of the Princes in the Tower  at Grafton Regis, Northamptonshire. She was the firstborn child of a socially unequal marriage between Sir Richard Woodville and Jacquetta of Luxembourg, which briefly scandalised the English court. The Woodvilles, though an old and respectable family, were gentry rather than noble, a landed and wealthy family that had previously produced commissioners of the peace, sheriffs, and MPs, rather than peers of the realm; Elizabeth's mother, in contrast, was the widow of the Duke of Bedford, uncle of King Henry VI of England.", "Scholars differ about why Dowager Queen Elizabeth spent the last five years of her life living at Bermondsey Abbey, to which she retired on 12 February 1487. Among her modern biographers, David Baldwin believes that Henry VII forced her retreat from the Court, while Arlene Okerlund presents evidence from July 1486 that she was already planning her retirement from court to live a religious, contemplative life at Bermondsey Abbey.Arlene Okerlund, Elizabeth: England's Slandered Queen. Stroud: Tempus, 2006, 245. Another suggestion is that her retreat to Bermondsey was forced on her because she was in some way involved in the 1487 Yorkist rebellion of Lambert Simnel, or at least was seen as a potential ally of the rebels.Bennett, Michael, Lambert Simnel and the Battle of Stoke, New York, St. Martin's Press, 1987, pp.42; 51; Elston, Timothy, \"Widowed Princess or Neglected Queen\" in Levin & Bucholz (eds), Queens and Power in Medieval and Early Modern England, University of Nebraska Press, 2009, p.19.", "* Elizabeth Woodville: Mother of the Princes in the Tower (2002) by David Baldwin", "* The Women of the Cousins' War  (2011) by Philippa Gregory, David Baldwin and Michael Jones.   The book deals with Jacquetta of Luxembourg (mother of Elizabeth Woodville) (chapter written by Philippa Gregory), Elizabeth Woodville (chapter written by David Baldwin), and Lady Margaret Beaufort (mother of Elizabeth Woodville's son-in-law King Henry VII) (chapter written by Michael Jones) ", "* David Baldwin, Elizabeth Woodville (Stroud, 2002) ", "* Philippa Gregory, David Baldwin, Michael Jones, The Women of the Cousins' War (Simon & Schuster, 2011)"]}, {"page": "Princes in the Tower", "response": ["Historian David Baldwin suggests that Henry VII's reticence on the subject may have been because at least one of the princes was still alive; he considers that Richard is more likely to survive, with Edward dying of a malady. Baldwin argues that it is \"impossible\" that no one knew what happened to the Princes after they entered the Tower; he believes Richard III and Henry VII, leading courtiers and their mother would all have known the boys' whereabouts and welfare. Baldwin argues that had this been the case, Henry VII would have had the choice of keeping quiet about the survival of Richard, or having him executed, and concluded, \"He [Henry] would have been happy to let people think the boys had been murdered, but not to speculate when or by whose hand.\""]}, {"page": "Philippa Gregory", "response": ["* The Women of the Cousins' War: The Duchess, the Queen and the King's Mother (2011), with David Baldwin and Michael Jones, history"]}, {"page": "Jacquetta of Luxembourg", "response": ["Jacquetta of Luxembourg, Countess Rivers (1415/16 – 30 May 1472) was the eldest daughter of Peter I of Luxembourg, Count of Saint-Pol, Conversano and Brienne, and his wife Margaret of Baux (Margherita del Balzo of Andria).David Baldwin, Elizabeth Woodville: Mother of the Princes in the Tower, (The History Press, 2010), Genealogical table 4. She was a prominent, though often overlooked, figure in the Wars of the Roses. Through her short-lived first marriage to the Duke of Bedford, brother of King Henry V, she was firmly allied to the House of Lancaster. However, following the emphatic Lancastrian defeat at the Battle of Towton, she and her second husband Richard Woodville sided closely with the House of York. Three years after the battle and the accession of Edward IV of England, Jacquetta's eldest daughter Elizabeth Woodville married him and became Queen consort of England. Jacquetta bore Woodville 14 children and stood trial on charges of witchcraft, of which she was exonerated."]}, {"page": "Richard of Shrewsbury, Duke of York", "response": ["The Duke of York was sent to the Tower of London, then a royal residence, by King Richard III in mid-1483, where he was held with his brother. They were sometimes seen in the garden of the Tower, but there are no known sightings of them after the summer of 1483. What happened to the two of them—the Princes in the Tower—after their disappearance remains unknown. Tudor History was quick to blame his uncle, Richard.Horrox, Rosemary. \"Edward V of England\". Oxford Dictionary of National Biography. Oxford University Press. Retrieved 25 August 2013.  Thomas More wrote that the princes were smothered to death with their pillows, and his account forms the basis of William Shakespeare's play Richard III, in which Tyrrell suborns Forrest and Dighton to murder the princes on Richard's orders. Subsequent re-evaluations of Richard III have questioned his guilt, beginning with William Cornwallis early in the 17th century.Kendall, P. M., Richard III, Aylesbury 1972, p. 427; in the Encomium of Richard III, dedicated to Sir John Donne. In the period before the boys' disappearance, Edward was regularly being visited by a doctor; historian David Baldwin extrapolates that contemporaries may have believed Edward had died either of an illness or as the result of attempts to cure him.Baldwin, David (2013) \"The White Queen – What happened to the Princes in the Tower?\", BBC History In the absence of hard evidence a number of other theories have been put forward, of which the most widely discussed are that they were murdered on the orders of the Duke of Buckingham or by Henry Tudor, Earl of Richmond (later King Henry VII)."]}, {"page": "Eleanor of England, Countess of Leicester", "response": ["#Guy de Montfort, Count of Nola (1244–1288)David Baldwin, Elizabeth Woodville: Mother of the Princes in the Tower, (The History Press, 2010), Genealogical table 4."]}, {"page": "Guy de Montfort, Count of Nola", "response": ["Guy de Montfort, Count of Nola (1244–1291) was the son of Simon de Montfort, 6th Earl of Leicester and Eleanor of England.David Baldwin, Elizabeth Woodville: Mother of the Princes in the Tower, (The History Press, 2010), Genealogical table 4.", "In Tuscany, he married an Italian noblewoman, Margherita Aldobrandesca, the Lady of Sovana.David Baldwin, Elizabeth Woodville: Mother of the Princes in the Tower, (The History Press, 2010), Genealogical table 4. "]}, {"page": "David Baldwin", "response": ["David Baldwin may refer to:", "*David Baldwin ( 1830s-1870s), American inventor; owner of David Baldwin House, Midland Park, New Jersey", "*David Baldwin (bowls) (1921–2012), New Zealand bowls player", "*David Baldwin (historian) (1946–2016), British historian and writer", "*David Baldwin (executive), English football executive"]}, {"page": "Exhumation and reburial of Richard III of England", "response": ["The location of Richard III's body had long been of interest to the members of the Richard III Society, a group established to bring about a reappraisal of the King's tarnished reputation. In 1975 an article by Audrey Strange was published in the society's journal, The Ricardian, suggesting that his remains were buried under Leicester City Council's car park. The claim was repeated in 1986, when historian David Baldwin suggested that the remains were still in the Greyfriars area. He speculated, \"It is possible (though now perhaps unlikely) that at some time in the twenty-first century an excavator may yet reveal the slight remains of this famous monarch.\"Carson, Ashdown-Hill, Johnson, Johnson & Langley, p. 25."]}, {"page": "The Women of the Cousins' War", "response": ["The Women of the Cousins' War: The Duchess, the Queen and the King's Mother is a 2011 book by historical novelist Philippa Gregory and historians David Baldwin and Michael K. Jones. It is a non-fiction work that explores the lives of three prominent women of the historical Wars of the Roses, all of whom Gregory has featured in her Cousins' War series of novels."]}, {"page": "Bianca Amato", "response": ["| Philippa Gregory  David Baldwin  Michael Jones"]}]}}