{"wiki_id": "http://www.wikidata.org/entity/Q148669", "itemLabel": "Ida Lupino", "itemDescription": "British actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Ida_Lupino", "wikipedia_page": {"main": "Ida Lupino (4 February 1918 – 3 August 1995) was an English actress, singer, director, and producer. Throughout her 48-year career, she appeared in 59 films and directed eight, working primarily in the United States, where she became a citizen in 1948.\nShe is widely regarded as the most prominent female filmmaker working in the 1950s during the Hollywood studio system. With her independent production company, she co-wrote and co-produced several social-message films and became the first woman to direct a film noir,  The Hitch-Hiker, in 1953. Among her other directed films, the best known are Not Wanted, about unwed pregnancy (she took over for a sick director and refused directorial credit); Never Fear (1950), loosely based upon her own experiences battling paralyzing polio; Outrage (1950), one of the first films about rape; The Bigamist (1953) (which was named in the book 1001 Movies You Must See Before You Die); and The Trouble with Angels (1966). Her short yet immensely influential directorial career, tackling themes of women trapped by social conventions, usually under melodramatic or noir coverings, is a pioneering example of proto-feminist filmmaking.As an actress, her best known films are The Adventures of Sherlock Holmes (1939) with Basil Rathbone; They Drive by Night (1940) with George Raft and Humphrey Bogart; High Sierra (1941) with Bogart; The Sea Wolf (1941) with Edward G. Robinson and John Garfield; Ladies in Retirement (1941) with Louis Hayward; Moontide (1942) with Jean Gabin; The Hard Way (1943); Deep Valley (1947) with Dane Clark; Road House (1948) with Cornel Wilde and Richard Widmark; While the City Sleeps (1956) with Dana Andrews and Vincent Price; and Junior Bonner (1972) with Steve McQueen.\nShe also directed more than 100 episodes of television shows in a variety of genres, including westerns, supernatural tales, situation comedies, murder mysteries, and gangster stories. She was the only woman to direct an episode of the original The Twilight Zone series (\"The Masks\"), and the only director to star in an episode (\"The Sixteen-Millimeter Shrine\").", "link_mentions": [{"page": "August 3", "response": ["*1995 – Ida Lupino, English-American actress and director (b. 1918)"]}, {"page": "Ed Sullivan", "response": ["Sullivan appeared as himself on other television programs, including an April 1958 episode of the Howard Duff and Ida Lupino CBS situation comedy Mr. Adams and Eve. On September 14, 1958, Sullivan appeared on What's My Line? as a mystery guest, and showed his comedic side by donning a rubber mask. In 1961, Sullivan was asked by CBS to fill in for an ailing Red Skelton on The Red Skelton Show. Sullivan took Skelton's roles in the various comedy sketches; Skelton's hobo character \"Freddie the Freeloader\" was renamed \"Eddie the Freeloader.\""]}, {"page": "Film noir", "response": ["A number of low- and modestly-budgeted noirs were made by independent, often actor-owned, companies contracting with larger studios for distribution. Serving as producer, writer, director and top-billed performer, Hugo Haas made films like Pickup (1951), The Other Woman (1954) and Jacques Tourneur, The Fearmakers (1958)). It was in this way that accomplished noir actress Ida Lupino established herself as the sole female director in Hollywood during the late 1940s and much of the 1950s. She does not appear in the best-known film she directed, The Hitch-Hiker (1953), developed by her company, The Filmakers, with support and distribution by RKO.Muller (1998), pp. 176–77. It is one of the seven classic film noirs produced largely outside of the major studios that have been chosen for the United States National Film Registry. Of the others, one was a small-studio release: Detour. Four were independent productions distributed by United Artists, the \"studio without a studio\": Gun Crazy; Kiss Me Deadly; D.O.A. (1950), directed by Rudolph Maté and Sweet Smell of Success (1957), directed by Alexander Mackendrick. One was an independent distributed by MGM, the industry leader: Force of Evil (1948), directed by Abraham Polonsky and starring John Garfield, both of whom were blacklisted in the 1950s.Krutnik, Neale, and Neve (2008), pp. 259–60, 262–63. Independent production usually meant restricted circumstances but Sweet Smell of Success, despite the plans of the production team, was clearly not made on the cheap, though like many other cherished A-budget noirs, it might be said to have a B-movie soul.See Mackendrick (2006), pp. 119–20."]}, {"page": "February 4", "response": ["*1918 – Ida Lupino, English-American actress and director (died 1995)"]}, {"page": "Gene Kelly", "response": ["| 1949|| Suspense Mystery Radio Play||To Find Help || \"Suspense – To Find Help\" Escape and Suspense. To Find Help starring Gene Kelly, Ethel Barrymore and William Conrad, aired on January 6, 1949. It was adapted from Mel Dinelli's stage play The Man and from the film Beware, My Lovely (1952) starring Ida Lupino and Robert Ryan."]}, {"page": "Humphrey Bogart", "response": ["High Sierra (1941, directed by Raoul Walsh) featured a screenplay written by John Huston, Bogart's friend and drinking partner, adapted from a novel by W. R. Burnett, author of the novel on which Little Caesar was based.Sperber and Lax 1997, p. 119. Paul Muni, George Raft, Cagney and Robinson turned down the lead role, giving Bogart the opportunity to play a character with some depth. Walsh initially opposed Bogart's casting, preferring Raft for the part. It was Bogart's last major film as a gangster; a supporting role followed in The Big Shot, released in 1942. He worked well with Ida Lupino, sparking jealousy from Mayo Methot.Sperber and Lax 1997, p. 128."]}, {"page": "Sam Peckinpah", "response": ["Peckinpah wrote a screenplay from the novel The Authentic Death of Hendry Jones, a draft that evolved into the 1961 Marlon Brando film One-Eyed Jacks. His writing led to directing, and he directed a 1958 episode of Broken Arrow (generally credited as his first official directing job) and several 1960 episodes of Klondike, (co-starring James Coburn, L. Q. Jones, Ralph Taeger, Joi Lansing, and Mari Blanchard). He also directed the CBS sitcom Mr. Adams and Eve, starring Howard Duff and Ida Lupino."]}, {"page": "1950s", "response": ["* Ida Lupino"]}, {"page": "1940s", "response": ["* Ida Lupino"]}, {"page": "1918", "response": ["** Ida Lupino, Anglo-American actress, screenwriter, director and producer (d. 1995)"]}, {"page": "1995", "response": ["* August 3 – Ida Lupino, British-born American actress (b. 1918)Flint, Peter B. \"Ida Lupino, Film Actress and Director, Is Dead at 77,\" The New York Times. August 5, 1995. Retrieved on April 11, 2016."]}]}}