{"wiki_id": "http://www.wikidata.org/entity/Q14947290", "itemLabel": "Nathan Sykes", "itemDescription": "English singer, songwriter and record producer", "wikipedia_url": "https://en.wikipedia.org/wiki/Nathan_Sykes", "wikipedia_page": {"main": "Nathan James Sykes (born 18 April 1993) is an English singer, songwriter and record producer. He is best known for being the youngest member of the British boy band The Wanted. In 2013, Sykes appeared with his bandmates in the E! channel reality television series The Wanted Life. After the band's hiatus in 2014, Sykes embarked on a solo career. His debut single, \"Kiss Me Quick\" was released in July 2015. It reached number-one on the US Dance Club Songs chart.", "link_mentions": [{"page": "1993 in music", "response": ["*April 18 – Nathan Sykes, English singer, songwriter and record producer, former member of The Wanted "]}, {"page": "1993 in American television", "response": ["|Nathan Sykes"]}, {"page": "Nathan (given name)", "response": ["* Nathan Sykes (born 1974), English rugby player"]}, {"page": "List of artists who reached number one on the U.S. Dance Club Songs chart", "response": ["* Nathan Sykes (2)"]}, {"page": "Tonight at the London Palladium", "response": ["| 6 || 18 May 2016 || ABC, Nathan Sykes, Gregory Porter, Milos, the Sons Company Teeterbpard and aeralists, Steve Williams and the cast of Guys and Dolls"]}, {"page": "1993 in the United Kingdom", "response": ["* 18 April – Nathan Sykes, singer"]}, {"page": "Ordinary People (John Legend song)", "response": ["* Nathan Sykes covered this song during his Sykes Secret Shows showcase on July 5, 2015"]}, {"page": "The Hot Desk", "response": ["| Nathan Sykes"]}, {"page": "Cahill (group)", "response": ["*Nathan Sykes - \"Over And Over Again\""]}, {"page": "Pokémon Theme", "response": ["The theme song has been covered by various groups and people. \"Pokémon Theme\" was first covered by Billy Crawford for Pokémon: The First Movie. Afterwards, it was covered again by Ben Dixon and The Sad Truth for the English broadcast of Pokémon: XY.  Ben Dixon once again covered it for Pokémon the Movie: I Choose You! Others who have covered the theme song included Postmodern Jukebox, Kurt Hugo Schneider with Lindsey Stirling, Eric Calderone, Baracksdubs, Tay Zonday, Powerglove, Pat Cashman & Xander Mobus as announcers from Super Smash Bros., Nathan Sykes, and Anthony Vincent."]}, {"page": "Fred Falke", "response": ["|Nathan Sykes"]}, {"page": "Celebrity Juice", "response": ["*Nathan Sykes"]}, {"page": "Dsign Music", "response": ["# 2015: Nathan Sykes - \"Kiss Me Quick\" - #1 Billboard US Dance Club Songs", "* 2016: Nathan Sykes - \"Kiss Me Quick\" from the album Unfinished Business released by Global Entertainment", "* 2015: Nathan Sykes - \"Kiss Me Quick\" single released by Global Entertainment (#1 Billboard US Dance Club Songs Chart"]}, {"page": "List of Live episodes", "response": ["| Octavia Spencer, Max Greenfield, Nathan Sykes "]}, {"page": "Ariana Grande", "response": ["Grande recorded the duet \"Almost Is Never Enough\" with Nathan Sykes of The Wanted, which was released as a promotional single in August 2013. She also joined Justin Bieber on his Believe Tour for three shows and kicked off her own headlining mini-tour, The Listening Sessions. The following month, Billboard magazine ranked Grande at number four on their list of \"Music's Hottest Minors 2013\", an annual ranking of the most popular musicians under the age of 21. At the 2013 American Music Awards, she won the award for New Artist of the Year. She released a four-song Christmas EP, Christmas Kisses in December 2013. Grande received the Breakthrough Artist of the Year award from the Music Business Association, recognizing her achievements throughout 2013. By January 2014, Grande had begun recording her second studio album, with singer-songwriter Ryan Tedder and record producers Benny Blanco and Max Martin. The same month, she earned the Favorite Breakout Artist award at the People's Choice Awards 2014. In March 2014, Grande sang at the White House concert, \"Women of Soul: In Performance at the White House\". The following month, President Barack Obama and First Lady Michelle Obama invited Grande again to perform at the White House for the Easter Egg Roll event.", "Grande began recording songs for her third studio album, Dangerous Woman, originally titled Moonlight, in 2015. In October of that year, she released the single \"Focus\", initially intended as the lead single from the album; the song debuted at number seven on the Billboard Hot 100. The next month American singer Who Is Fancy released the single \"Boys Like You\", which features her and Meghan Trainor. She was featured in the remix version of \"Over and Over Again\", a song by English singer Nathan Sykes' debut studio solo album Unfinished Business, which was released in January 2016. Grande made a cameo appearance in the comedy film Zoolander 2 starring Ben Stiller and Owen Wilson.; and  In March 2016, Grande released \"Dangerous Woman\" as the lead single from the retitled album of the same name.;  The single debuted at number ten on the Billboard Hot 100, becoming the first artist to have the lead single from each of her first three albums debut in the top ten. The same month, Grande appeared as host and musical guest of Saturday Night Live, where she performed \"Dangerous Woman\" and debuted the promotional single \"Be Alright\", which charted at number 43 on the Billboard Hot 100. Grande garnered positive reviews for her appearance on the show, including praise for her impressions of various singers, some of which she had done on The Tonight Show. Grande won an online voting poll on Entertainment Weekly as the \"best host of the season\". In May 2016, Grande appeared on The Voice season 10 finale, performing the second single from the album, \"Into You\", which peaked at number 13 in the United States, and duetted with Christina Aguilera on \"Dangerous Woman\"."]}, {"page": "Jingle Bell Ball", "response": ["|Nathan Sykes*as a member of the Wanted"]}, {"page": "Summertime Ball", "response": ["The 2013 Summertime Ball was held on Saturday 8 June 2013 at Wembley Stadium. It was announced on 24 April 2013 that Justin Timberlake would be the guest presenter hosting the ball for 2013. Tickets went on sale on Friday 26 April at 8am, and sold out in under 2 hours. The 2013 Vodafone Summertime Ball featured the most acts ever for a single Capital FM ball with 21 performers. The headliners, Robbie Williams and Taylor Swift made their ball debuts on Saturday 8 June, with will.i.am, performing at his fourth ball, but his first one solo, and Olly Murs, who made his debut Summertime Ball performance, being the supporting headline acts. The Wanted's fourth appearance at this ball made them the most frequent performers at the Summertime Ball. Band member Nathan Sykes returned after having major throat surgery earlier on in the year, making this his first performance after his throat surgery. Justin Timberlake also performed at the event, despite only being listed as a host rather than a performer.", "Nathan Sykes", "The 2015 Summertime Ball returned to Wembley Stadium for the sixth consecutive time and was held on Saturday 6 June 2015. The show sold out within the second few hours of ticket shows. On 27 April 2015 One Direction announced they were going to be the first headliners for the show. LunchMoney Lewis was added to the lineup on 19 May, with Rixton and Nick Jonas being added the following day. Former The Wanted star Nathan Sykes joined the lineup on 22 May. After appearing at the ball four times together with The Wanted and joining Jessie J on stage at the Summertime Ball last year plus his awaited performance this year, it was Sykes' sixth consecutive appearance since 2010 making him the most performed act to date. Sam Smith was due to perform, but withdrew from the show due to illness. Kelly Clarkson performed bare foot at this ball. ", "Nathan Sykes", "Nathan Sykes", "| Nathan Sykes*as a member of The Wanted"]}, {"page": "The Wanted", "response": ["The Wanted are a British-Irish boy band consisting of members Max George, Siva Kaneswaran, Jay McGuiness, Tom Parker and Nathan Sykes. They formed in 2009 and were signed worldwide to Universal Music subsidiaries Island Records and Mercury Records, and managed by Scooter Braun. According to the British Phonographic Industry (BPI), the band has been certified for 600,000 albums and 2 million singles in the UK. Their nominations include 14 World Music Awards, two Brit Awards, an American Music Award, and a MTV Video Music Award.", "* Nathan Sykes – lead and backing vocals"]}, {"page": "All Time Low (The Wanted song)", "response": ["* Vocals – Tom Parker, Nathan Sykes, Jay McGuiness, Max George, Siva Kaneswaran"]}, {"page": "Just the Way You Are (Bruno Mars song)", "response": ["\"Just the Way You Are\" has been covered several times. It was first covered by Nathan Sykes from The Wanted, The Saturdays at BBC Radio 1's Live Lounge on October 29, 2010. San Diego band Pierce the Veil covered the track for the compilation album Punk Goes Pop 4, which was released on November 21, 2011. It was performed by Cory Monteith on \"Furt\", an episode of the American TV show Glee which aired on November 23, 2010. The show's cover version achieved moderate success by peaking at number 24 in Canada. It reached number 40 in the United States, 47 in Australia and number 48 in Ireland."]}, {"page": "Martin Sjølie", "response": ["| Nathan Sykes"]}, {"page": "Carmen Reece", "response": ["Helen Culver, known by her stage name Carmen Reece, is an English singer, songwriter, musician and producer based in Los Angeles, California. An accomplished pianist and flautist from childhood, Carmen penned her first song aged 11 and has since worked and written for artists such as Ariana Grande, Kanye West, Craig David, Destiny Rogers, Samantha Jade, and Nathan Sykes. Reece also has provided background vocals, vocal production, and vocal arrangement for artists. Her debut album Love in Stereo was released in 2010 and her debut EP was released in 2020.", "| rowspan=\"4\"|Nathan Sykes"]}, {"page": "Heart Vacancy", "response": ["*Vocals – Tom Parker, Nathan Sykes, Jay McGuiness, Max George, Siva Kaneswaran"]}, {"page": "Nathan James Sykes", "response": ["#REDIRECT Nathan Sykes"]}, {"page": "Nathan Skyes", "response": ["#REDIRECT Nathan Sykes"]}, {"page": "Lose My Mind (The Wanted song)", "response": ["*Lead and backing vocals – Tom Parker, Nathan Sykes, Jay McGuiness, Max George, Siva Kaneswaran"]}, {"page": "Nathan Sikes", "response": ["#REDIRECT Nathan Sykes"]}, {"page": "Nathan Sykes (The Wanted)", "response": ["#REDIRECT Nathan Sykes"]}, {"page": "Chris Grayston", "response": ["Grayston discovered participant Josh Dubovie in 2008, who went on to represent the United Kingdom at the 2010 Eurovision Song Contest. In 2008 he also discovered Welsh indie/electronic band Kiddo360, which won the Grand Final and later went on to win a Vodafone Award. Nathan Sykes performed in 2008, before he joined The Wanted. In the same year, Grayston was involved in setting up the first Open Mic UK, as a spin off of Live and Unsigned."]}]}}