{"wiki_id": "http://www.wikidata.org/entity/Q14948969", "itemLabel": "Lloyd Laing", "itemDescription": "British archaeologist", "wikipedia_url": "https://en.wikipedia.org/wiki/Lloyd_Laing", "wikipedia_page": {"main": "Lloyd Laing (born 1944, Lanark, Scotland) is an archaeologist and ancient art historian specializing in early medieval Britain and Ireland, coins and ceramics. Solely or jointly he has published over 30 books and 60 papers, as well as many contributions to encyclopedias and magazines. He has directed many excavations in different parts of Britain. His wife Jennifer Laing is also an archaeologist.He studied prehistoric archaeology and fine art at Edinburgh University, before becoming assistant inspector of ancient monuments for Scotland, from 1966 to 1969. He was senior lecturer at University of Liverpool then University of Nottingham, where he was later associate professor.", "link_mentions": [{"page": "Skara Brae", "response": ["Seven of the houses have similar furniture, with the beds and dresser in the same places in each house. The dresser stands against the wall opposite the door, and was the first thing seen by anyone entering the dwelling. Each of these houses had the larger bed on the right side of the doorway and the smaller on the left. Lloyd Laing noted that this pattern accorded with Hebrides custom up to the early 20th century suggesting that the husband's bed was the larger and the wife's was the smaller. The discovery of beads and paint-pots in some of the smaller beds may support this interpretation. Additional support may come from the recognition that stone boxes lie to the left of most doorways, forcing the person entering the house to turn to the right-hand, \"male\", side of the dwelling. At the front of each bed lie the stumps of stone pillars that may have supported a canopy of fur; another link with recent Hebridean style."]}, {"page": "Constantine (Briton)", "response": ["The 6th-century monk Gildas mentions Constantine in chapters 28 and 29 of work De Excidio et Conquestu Britanniae.De Excidio et Conquestu Britanniae, ch. 28–29. Constantine is one of five Brittonic kings whom the author rebukes and compares to Biblical beasts. Gildas calls Constantine the \"tyrannical whelp of the unclean lioness of Damnonia\", a reference to the books of Daniel and Revelation, and apparently also a slur directed at his mother. This Damnonia is generally identified as the kingdom of Dumnonia in Southwestern Britain.Lloyd, pp. 131–132. Scholars such as Lloyd Laing and Leslie Alcock note the possibility that Gildas may have instead intended the territory of the Damnonii, a tribe in present-day Scotland mentioned by Ptolemy in the 2nd century, but others such as Thomas D. O'Sullivan consider this unlikely.O'Sullivan, p. 92 & note."]}]}}