{"wiki_id": "http://www.wikidata.org/entity/Q14920681", "itemLabel": "Joan Regan", "itemDescription": "English pop music singer (1928-2013)", "wikipedia_url": "https://en.wikipedia.org/wiki/Joan_Regan", "wikipedia_page": {"main": "Joan Regan (born Joan Bethel or Siobhan Bethel; 19 January 1928 – 12 September 2013) was an English traditional pop music singer, popular during the 1950s and early 1960s.\n\n", "link_mentions": [{"page": "Ruby Murray", "response": ["After being again spotted by Ray Martin, Murray was signed to Columbia and her first single, \"Heartbeat\", reached No. 3 in the UK Singles Chart in December 1954. Afton had offered her the position of resident singer on the BBC's Quite Contrary television show, to replace Joan Regan. \"Softly, Softly\", her second single, reached number one in early 1955. That same year Murray set a pop chart record by having five hits in the Top Twenty in one week, a feat unmatched for many years. In 2014, the Guinness Book of World Records issued three certificates confirming that at the date of issue, nobody had beaten this record, although it was shared with three other singers.  The record by a female singer still stands at the date of 26 February 2019."]}, {"page": "Pye Records", "response": ["* Joan Regan (1960–1961)"]}, {"page": "Joan (given name)", "response": ["* Joan Regan (1928–2013), English singer"]}, {"page": "Regan", "response": ["* Joan Regan (1928–2013), English singer"]}, {"page": "Russ Conway", "response": ["In 1955, Conway was talent-spotted while playing in a London club, and was signed to EMI's Columbia label. At Columbia, he worked with Norman Newell, who suggested he adopt the stage name of Russ Conway ('Conway' from Newell's early recording association with the singer Steve Conway, and 'Russ' from the Russ Henderson Steel Band). Conway spent the mid-1950s providing backing for artists on their roster, including Gracie Fields and Joan Regan. He recorded his first solo single \"Party Pops\" in 1957, a \"medley of standard songs\" which included \"Roll the Carpet Up\" and \"The Westminster Waltz\"."]}, {"page": "Six-Five Special", "response": ["Among the artists on the show were Petula Clark, Jim Dale, Johnny Dankworth, Terry Dene, Lonnie Donegan, Russ Hamilton, Cleo Laine, Joan Regan, Finlay Currie, boxer Freddie Mills, Wee Willie Harris, Jimmy Lloyd, Marty Wilde, the Dallas Boys and Tommy Steele.", "A spin-off film was released in 1958, scripted by Norman Hudis and directed by Alfred Shaughnessy. It centred around a young woman's quest for stardom, played by up-and-coming musical star Diane Todd. It featured performances from Lonnie Donegan, Dickie Valentine, Jim Dale, Petula Clark, Russ Hamilton and Joan Regan, among others, and featured comic relief from Mike and Bernie Winters."]}, {"page": "If I Give My Heart to You", "response": ["* Joan Regan's recording became the highest charting version in the UK, reaching the No.3 position in 1954."]}, {"page": "Ricochet (Teresa Brewer song)", "response": ["In the United Kingdom, the most popular version was by Joan Regan, and other versions were done by Alma Cogan and Billie Anthony.", ":The recording by Joan Regan With The Squadronaires was released by UK Decca Records as catalog number F 10193, and in Australia as catalogue number Y6543. It reached number 8 on the UK song chart.", "*Joan Regan with The Squadronaires  \t  Decca  UK\t1955"]}, {"page": "Till I Waltz Again with You", "response": ["*The song was also recorded by Joan Regan in the United Kingdom around the same time. "]}, {"page": "List of Decca Records artists", "response": ["* Joan Regan (later on Pye)"]}, {"page": "Dickie Valentine", "response": ["| align=\"left\" |\"Cleo and Me-o\" (with Joan Regan)"]}, {"page": "Jilted (song)", "response": ["Other 1954 recordings were made by Diana Decker, Red Foley and by the UK based singers Alma Cogan and Joan Regan."]}, {"page": "Croce di Oro", "response": ["A United Kingdom version, recorded by Joan Regan, was also issued in the United States by London Records as catalog number 1605."]}, {"page": "Anema e core (song)", "response": ["Yet another set of English lyrics, under the title \"How Wonderful to Know,\" was written by Kermit Goell, and recorded by Joan Regan, by Cliff Richard on his 1960 album 21 Today, by Caterina Valente, and by Andy Williams. Sergio Franchi covered this song in his second RCA Victor Red Seal album Our Man From Italy in 1963. This album placed number 66 on the Billboard 200 album chart."]}, {"page": "That Old Feeling (song)", "response": ["*Joan Regan"]}, {"page": "It's a Big Wide Wonderful World", "response": ["*Joan Regan"]}, {"page": "Happy Anniversary (1959 film)", "response": ["\"Happy Anniversary\" is also the title of a popular song with music written by Robert Allen and lyrics by Al Stillman, that was introduced in this film. Recordings have been made by The Four Lads, Jane Morgan, Maureen Evans and Joan Regan."]}, {"page": "Open Up Your Heart (And Let the Sunshine In)", "response": ["The biggest hit version in the United States was a recording by the Cowboy Church Sunday School (peaking at number 8 on the Billboard charts); in the United Kingdom, by Joan Regan and her son Rusty. Another US recording was made by the McGuire Sisters."]}, {"page": "Billie Anthony", "response": ["January 1954 saw the release of her second record, \"Ricochet\", followed in March by, \"Bell Bottom Blues\", both of which did well for Alma Cogan, Teresa Brewer and Joan Regan. Both sides of her next release \"Cross Over The Bridge\" and \"I Get So Lonely\" were recorded in April as duets with Tony Brent.", "Her sixth record release in October finally made the charts. The song was \"This Ole House\". Several other singers recorded the same song, including Alma Cogan and Joan Regan, but it was Rosemary Clooney who jockeyed with Anthony for the highest chart position. Clooney, in the charts for eighteen weeks, finally won the battle for the coveted number one spot both in the UK and America. Anthony reached No. 4 in the UK and remained in the UK Singles Chart for sixteen weeks."]}, {"page": "The Squadronaires", "response": ["*Vocals: Jimmy Miller, Joan Regan, Billy Nicholls SNR, Suzy Miller, Jackie Lee, Joan Baxter, Peter Morton, Ken Kirkham, Beryl Davis."]}, {"page": "Pine Tree, Pine over Me", "response": ["The best-selling version in the United Kingdom was a duet by Dickie Valentine and Joan Regan.", "* Dickie Valentine and Joan Regan"]}, {"page": "1928 in the United Kingdom", "response": ["* 19 January – Joan Regan, singer (died 2013)"]}, {"page": "A Prize of Gold", "response": ["Joan Regan sings the title song."]}, {"page": "Most People Get Married", "response": ["*In 1962, the song was also recorded by Joan Regan in the United Kingdom.  This recording featured an accompaniment directed by Peter Knight with the Babs Knight Singers."]}, {"page": "Love Me to Pieces", "response": ["On the pop music side, the biggest hit version in the United States was by Jill Corey, who took it to number 11 on the Pop charts, with Joan Regan covering it in the United Kingdom."]}, {"page": "The Johnston Brothers", "response": ["In 1949 Johnston formed an all-male singing trio, The Johnston Brothers, the other members being Alan Dean, Eddie Lester and Denny Vaughan (died 1972). They won a recording contract with Decca Records, and had their first UK Top 10 hit in 1953 with \"Oh Happy Day\". In November 1955, their version of \"Hernando's Hideaway\", from the movie The Pajama Game, reached the number one spot for two weeks, beating off the American versions by both Johnnie Ray and Archie Bleyer.  The Johnston Brothers had a number of smaller follow-up hits in the UK, including the medley \"Join in And Sing Again\" (1955) and \"Heart\" (1957), and also recorded with Joan Regan. They provided backing for the British vocalist, Suzi Miller, on their UK No. 14 joint hit, \"Happy Days and Lonely Nights\" in 1955."]}, {"page": "May You Always", "response": ["In the United Kingdom, Joan Regan took her version to No. 9 in the UK Singles Chart."]}, {"page": "Dave King (actor)", "response": ["King scored four hits on the UK Singles Chart in the middle of the 1950s. The biggest were \"Memories Are Made of This (No. 5, 1956) and \"You Can't Be True to Two\" (No. 11, 1956), both of which featured a backing group called the Keynotes. He also charted with \"Christmas and You\" (No. 23, 1956) and \"The Story of My Life\" (No. 20, 1958). He appeared on Decca Records' All Star Hit Parade charity record in 1956 along with other major Decca artists Dickie Valentine, Joan Regan, Winifred Atwell, Lita Roza and David Whitfield. That record charted at No. 2 in the UK Singles Chart."]}, {"page": "Johnny Douglas (conductor)", "response": ["Moira Anderson, Shirley Bassey, The Bachelors, John Boulter, June Bronhill, Dora Bryan, Max Bygraves, Stuart Gillies, Dulcie Gray, John Hanson, Dickie Henderson, Vince Hill, Frankie Howerd, Teddy Johnson, Denis Lotis, Vera Lynn, Janie Marden, Alfred Marks, Kenneth McKellar, Lita Roza, Mike Redway, Joan Regan, Malcolm Roberts, Patricia Routledge, Harry Secombe, Semprini, Anne Shelton, Jimmy Tarbuck, Bruce Trent, Dickie Valentine, Frankie Vaughan, David Whitfield, Rita Williams, Mark Wynter and Jimmy Young, Shirley Jones, Howard Keel, Al Martino, Barbra Streisand, Tex Ritter."]}, {"page": "Carol Deene", "response": ["After appearing on Joan Regan's BBC TV programme Be My Guest in 1961,Larkin C., Virgin Encyclopedia of Sixties Music, (Muze UK Ltd, 1997), ,  p. 148 at the age of 16, Deene was signed to the HMV label. She scored her first chart hit in late 1961, and three Top 40 hits on the UK Singles Chart in 1962. "]}, {"page": "Christmas Night with the Stars", "response": ["Broadcast on Friday 25 December 1959. Introduced by David Nixon and starring Ken Mackintosh and his Orchestra, Jimmy Logan, David Hughes, Charlie Drake, Jack Warner, Joan Regan, Jimmy Edwards, and The Black and White Minstrels.", "Broadcast on Sunday 25 December 1960. Introduced by David Nixon and starring The Mitchell Minstrels, The Television Toppers, Sid James with Bill Kerr, Liz Fraser, Sydney Tafler, Nina and Frederik, Harry Worth with Deryck Guyler, Hugh Lloyd, George Roderick, Kenneth McKellar with The Showtime Dancers, David Nixon and Robert Harbin, Stanley Baxter and Betty Marsden, Joan Regan, Jimmy Edwards with Arthur Howard, Cyril Fletcher, Pip Hinton, Eric Robinson, Johnny Vyvyan, Chan Canasta, The Showtime Dancers and the George Mitchell Singers"]}, {"page": "Opera House Theatre, Blackpool", "response": ["The first Royal Variety Performance to be held outside London was staged at the Opera House on 13 April 1955. Compèred by Jack Hylton and held in the presence of the Queen and the Duke of Edinburgh. Performers included Arthur Askey, Morecambe and Wise, The Crazy Gang, Reginald Dixon at the Wurlitzer organ, Joan Regan, Alma Cogan, George Formby, Beryl Grey, John Field, Flanagan and Allen and Charlie Cairoli."]}, {"page": "List of Royal Variety Performances", "response": ["| Reginald Dixon, Lupino Lane, George Truzzi, Peter Glaze, Kenneth Sandford, Pamela Bromley, Vera Day, The John Tiller Girls, The Victoria Palace Girls and Boys, Kathryn Moore, The Flying De Pauls, The Barbour Brothers and Jean, The Amandis, The Crazy Gang, Morecambe and Wise, Bill Waddington, Josephine Anne, The Showgirls, Arthur Askey, Geraldo and his Orchestra, Jewel and Warriss, Littlewoods Girls Choir, Joan Regan, Alma Cogan, Five Smith Brothers, George Formby, 1st Battalion The Liverpool Scottish (T.A.) (Queen's Own Cameron Highlanders), Beryl Grey with John Field, Jack Tripp with the John Tiller Girls, children from the Blackpool Tower Ballet, Charlie Cairoli with Paul, Wilfred and Mabel (Pickles), Albert Modley, Flanagan and Allen, Eddie Fisher with the BBC Northern Orchestra, Al Read."]}, {"page": "List of acts that have appeared on the Royal Variety Performance", "response": ["*Joan Regan: 1955 (Blackpool)"]}, {"page": "Must Be Santa (song)", "response": ["\"Must Be Santa\" is a Christmas song written by Hal Moore and Bill Fredericks and first released in November 1960 by Mitch Miller on Columbia 41814 (45 rpm). A cover version by Tommy Steele reached Number 40 on the UK Singles Chart a year later. Another cover, by Joan Regan made number 42 a week later."]}, {"page": "List of UK top-ten singles in 1953", "response": ["|Joan Regan", "|align=\"left\"|Joan Regan with The Squadronaires"]}, {"page": "2013 in music", "response": ["* 12 – Joan Regan (85), British traditional pop singer"]}, {"page": "2013 in the United Kingdom", "response": ["* 12 September – Joan Regan, 85, traditional pop singer."]}, {"page": "2013 in British music", "response": ["*12 September – Joan Regan, pop singer, 85"]}, {"page": "Deaths in September 2013", "response": ["*Joan Regan, 85, British traditional pop singer.Music Obituaries: Joan Regan"]}, {"page": "I'll Close My Eyes (song)", "response": ["* Joan Regan"]}]}}