{"wiki_id": "http://www.wikidata.org/entity/Q14943997", "itemLabel": "Samantha Lewthwaite", "itemDescription": "British widow, Islamist and fugitive", "wikipedia_url": "https://en.wikipedia.org/wiki/Samantha_Lewthwaite", "wikipedia_page": {"main": "Samantha Louise Lewthwaite (; born 5 December 1983), also known as Sherafiyah Lewthwaite or the White Widow, is a British jihadist who is one of the Western world's most wanted terrorism suspects. Lewthwaite, the widow of 7/7 London terrorist bomber Germaine Lindsay, is accused of causing the deaths of more than 400 people. She is a fugitive from justice in Kenya, where she was wanted on charges of possession of explosives and conspiracy to commit a felony and is the subject of an Interpol Red Notice requesting her arrest with a view to extradition.Lewthwaite was alleged to be a member of the Somalia-based radical Islamic militant group Al-Shabaab. She was accused of orchestrating grenade attacks at non-Muslim places of worship, and is believed to have been behind an attack on those watching football in a bar in Mombasa during Euro 2012. In September 2013, there was speculation over her possible involvement in the Nairobi Westgate shopping mall attack, although other reports cast doubt on this, or said her role had been exaggerated. She was dubbed the \"White Widow\" by the news media, a play on words referencing her race and the death of her first husband and the practice of referring to Chechen female suicide bombers as \"black widows\".", "link_mentions": [{"page": "List of Irish people", "response": ["* Samantha Lewthwaite – terrorism suspect"]}, {"page": "Aylesbury", "response": ["* Samantha Lewthwaite, terrorist, grew up in Aylesbury"]}, {"page": "Germaine Lindsay", "response": ["Lindsay had converted to Islam shortly after his mother, Maryam McCleod Ismaiyl, converted to the faith in 2001 and encouraged him to do the same. He worked part-time as a carpet fitter and supplemented his income by selling covers for mobile phones at a local market. Lindsay married a woman from Kinnitty, County Offaly, Ireland, in a traditional Islamic religious ceremony, which had no legal recognition in the UK. He divorced her eight days later in order to marry Samantha Lewthwaite. Lewthwaite, a native of County Down, Northern Ireland, had converted to Islam at the age of 17 after moving to Aylesbury. Lewthwaite lived with him and gave birth to their second child two months after his death.", "Lindsay's wife, Samantha Lewthwaite, denied his involvement until authorities produced forensic evidence to confirm his identity.\"NewMuslim at 15, a bombing suspect at 19\" International Herald Tribune 18 July 2005. She later said she abhorred the attacks and that her husband's mind had been poisoned by \"radicals\".\"Widow of bomber 'abhors' attack\" BBC News, 23 September 2005"]}, {"page": "White widow", "response": ["* Samantha Lewthwaite (born 1983), terrorist suspect and widow of 7/7 suicide bomber Germaine Lindsay"]}, {"page": "Owlpen Manor", "response": ["A secluded and private holiday cottage at Owlpen was chosen for the press interview in September 2005 with Samantha Lewthwaite, a British jihadist known as \"the White Widow\". Following the 7 July 2005 London bombings, she was interviewed and photographed at Owlpen with her new-born baby, when she portrayed herself to tabloid newspaper The Sun as an innocent victim and her husband, terrorist bomber Germaine Lindsay, as a \"relatively recent [convert]\" who had been \"tricked into his actions by extremists\". Following her release, she is believed to have caused the deaths of more than 400 people and become one of the Western world's most wanted terrorism suspects. The episode is shown on Netflix's World's Most Wanted docuseries released in August 2020, exploring the careers of five of the world's most wanted criminals."]}, {"page": "Al-Shabaab (militant group)", "response": ["Harakat al-Shabaab al-Mujahideen (HSM; , , lit. 'Mujahideen Youth Movement' or 'Movement of Striving Youth'), more commonly known as al-Shabaab,(;  is a Somalia-based terrorist jihadist fundamentalist group active in East Africa and Yemen. The group describes itself as waging jihad against \"enemies of Islam\" and is engaged in combat against the Federal Government of Somalia and the African Union Mission to Somalia (AMISOM). The group has been suspected of having links with al-Qaeda in Islamic Maghreb and Boko Haram. Due to its Wahhabi roots, al-Shabaab is hostile to Sufi traditions and has often clashed with the Somali Sufi militia Ahlu Sunna Waljama'a. Al-Shabaab’s leaders and commanders are mainly from the Hawiye clan, which is one of the largest clans in Somalia. It has attracted some members from Western countries, including Briton Samantha Lewthwaite and American Abu Mansoor Al-Amriki.", "* Samantha Lewthwaite: Allegedly an al-Shabaab member, she is believed to have been behind an attack on a sports bar in Mombasa in 2012. Widow of 7/7 suicide bomber Germaine Lindsay."]}, {"page": "1983 in Northern Ireland", "response": ["*5 December - Samantha Lewthwaite, Islamic terrorist."]}, {"page": "Banbridge", "response": ["*Samantha Lewthwaite, terrorism suspect."]}, {"page": "Colleen LaRose", "response": ["* Samantha Lewthwaite"]}, {"page": "Lewthwaite", "response": ["*Samantha Lewthwaite (born 1983), British jihadist"]}, {"page": "List of converts to Islam from Christianity", "response": ["* Samantha Lewthwaite  – also known as Sherafiyah Lewthwaite or the White Widow, one of the United Kingdom's most wanted terrorism suspects"]}, {"page": "Aboud Rogo", "response": ["In 2012, police charged Rogo with possession of guns, ammunition, and detonators. He also faced charges of belonging to al-Shabaab. The police said that Rogo was part of a terror cell that was plotting to bomb Kenyan targets over Christmas. However, Rogo was released on bail of 5 million shillings by a Mombasa court in February 2012. He was also instructed to report to nearest police station in Mombasa and Kilifi county and to inform the Kenyan authorities if he travelled out of the country. Briton Samantha Lewthwaite, the widow of Jermaine Lindsay, who was one of the suicide bombers responsible for the 7 July 2005 London bombings, was also part of the cell, and police said that she is currently on the run."]}, {"page": "List of School of Oriental and African Studies people", "response": ["* Samantha Lewthwaite, alleged mastermind of the Westgate shopping mall attack and widow to 7 July 2005 London bombings perpetrator Germaine Lindsay. Currently wanted by INTERPOL and Kenyan authorities."]}, {"page": "Joseph Ole Lenku", "response": ["Ole Lenku came under scrutiny as the Cabinet Secretary responsible for internal security after the Westgate Shopping Mall Attack where unidentified gunmen attacked the Westgate shopping mall in Nairobi on 21 September 2013. By 24 September, at least 67 people, including four attackers, were reported killed and 175 others wounded in the mass shooting. On 29 September, Kenya's Foreign Affairs Cabinet Secretary Amina Mohamed told the Public Broadcasting Service (PBS) that there was a woman involved in the attack. \"From the information that we have, two or three Americans (were involved) and I think, so far, I have heard of one Brit, a woman, and I think she has done this many times before.\" This spurned speculation that the woman in question could be Samantha Lewthwaite, also known as the \"White Widow\", who was wanted by Kenyan police over alleged links with a terrorist cell involved in attacks at the Coast. Ole Lenku disputed the alleged presence of the British terrorist."]}, {"page": "Foreign fighters in the Syrian Civil War and War in Iraq", "response": ["An ISIS video released by British-based Abu Muthanna al Yemeni claimed \"We have brothers from Bangladesh, from Iraq, from Cambodia, Australia, U.K.\" ISIS also threatened fighters with execution for returning to Britain. In November, Regnum reported that \"White Widow\" Samantha Lewthwaite, who had fought in Syria the previous month, was shot dead by a Russian voluntary sniper while she was fighting for the Ukrainian volunteer battalion Aidar during the War in Donbass. Though it was not formally verified, and her father has not confirmed the reports, it was reported in the Western press."]}, {"page": "Sherafiyah Lewthwaite", "response": ["#REDIRECTSamantha Lewthwaite"]}, {"page": "Sherafiyah", "response": ["#REDIRECTSamantha Lewthwaite"]}, {"page": "Asmantara", "response": ["#REDIRECTSamantha Lewthwaite"]}, {"page": "Asmantara Lewthwaite", "response": ["#REDIRECTSamantha Lewthwaite"]}, {"page": "White Widow (suspect)", "response": ["#REDIRECTSamantha Lewthwaite"]}, {"page": "Samantha Louise Lewthwaite", "response": ["#REDIRECT Samantha Lewthwaite"]}, {"page": "Natalie Webb", "response": ["#Redirect Samantha Lewthwaite"]}, {"page": "The White Widow", "response": ["*Samantha Lewthwaite (born 1983), Islamic State terrorist suspect and widow of London tube bomber Germaine Lindsay"]}]}}