{"wiki_id": "http://www.wikidata.org/entity/Q1494195", "itemLabel": "Gareth Hunt", "itemDescription": "British actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Gareth_Hunt", "wikipedia_page": {"main": "Alan Leonard Hunt (7 February 1942 – 14 March 2007), known as Gareth Hunt, was a British actor best remembered for playing footman Frederick Norton in Upstairs, Downstairs and Mike Gambit in The New Avengers.", "link_mentions": [{"page": "February 7", "response": ["*  1943   – Gareth Hunt, English actor (d. 2007)"]}, {"page": "Patrick Macnee", "response": ["Although Macnee evolved in the role as the series progressed, the key elements of Steed's persona and appearance were there from very early on: the slightly mysterious demeanour and, increasingly, the light, suave, flirting tone with ladies (and always with his female assistants). Finally, from the episodes with Blackman onwards, the trademark bowler hat and umbrella completed the image. Although it traditionally was associated with London \"city gents\", the ensemble of suit, umbrella and bowler had developed in the post-war years as mufti for ex-servicemen attending Armistice Day ceremonies. Steed's sartorial style may also have been drawn from Macnee's father. Macnee, alongside designer Pierre Cardin, adapted the look into a style all his own, and he went on to design several outfits himself for Steed based on the same basic theme. Steed was also the central character of The New Avengers (1976–77), in which he was teamed with agents named Purdey (Joanna Lumley) and Mike Gambit (Gareth Hunt)."]}, {"page": "The Avengers (TV series)", "response": ["The result was a new series, The New Avengers. Patrick Macnee reprised the role of Steed, with two new partners, Mike Gambit (Gareth Hunt) and Purdey (Joanna Lumley). It aired on ITV in the UK in 1976–1977, CTV in Canada, CBS in the United States (in 1978–79) and TF1 in France (series 1 in 1976–1977 and series 2 in 1979). The final four episodes were almost completely produced by Canadian interests and were filmed there. In some markets they carried the title The New Avengers in Canada."]}, {"page": "1943", "response": ["* February 7 – Gareth Hunt, English actor (d. 2007)"]}, {"page": "Cunt", "response": ["Several celebrities have had their names used as euphemisms, including footballer Roger Hunt, actor Gareth Hunt,Anonymous Dirty Cockney Rhyming Slang Michael O'Mara Books Ltd.  singer James Blunt, politician Jeremy Hunt, and 1970s motor-racing driver James Hunt, whose name was once used to introduce the British radio show I'm Sorry I Haven't A Clue as \"the show that is to panel games what James Hunt is to rhyming slang\"."]}, {"page": "Pet Shop Boys", "response": ["Towards the end of 1987, Pet Shop Boys started work on an hour-long film that would incorporate the songs from Please and Actually. Working with director Jack Bond, the short film grew into a full-scale movie, It Couldn't Happen Here, starring Barbara Windsor, Joss Ackland and Gareth Hunt. The film was eventually released in 1988 to mixed reviews. Footage from the film was also used for the music video to \"Always on My Mind\", now released as a single on 30 November; it became both the duo's third number one single in the UK and the Christmas number one single for 1987, beating \"Fairytale of New York\" by The Pogues and Kirsty MacColl. In November 2004, The Daily Telegraph newspaper placed Pet Shop Boys' version of \"Always on My Mind\" at number two in a list of the fifty greatest cover versions of all time."]}, {"page": "Eric Sykes", "response": ["During 1982, Sykes played the Chief Constable in the slapstick police comedy film The Boys in Blue, which starred the comedy duo Cannon and Ball, with Jon Pertwee. For Thames TV that year, he also appeared in and wrote The Eric Sykes 1990 Show with Tommy Cooper and Dandy Nichols and It's Your Move, a wordless slapstick comedy depicting the travails of a couple (Richard Briers and Sylvia Syms) moving into a new home, who hire an accident-prone firm of house removers, headed by Sykes. It featured an all-star cast including Tommy Cooper, Bernard Cribbins, Jimmy Edwards, Irene Handl, Bob Todd, and Andrew Sachs. Sykes produced one further silent movie for Thames in 1988, Mr. H. Is Late, set at a funeral. In 1984, Sykes played the Genie in the children's film Gabrielle and the Doodleman, which also featured Windsor Davies (who would also appear with Sykes in the BBC's Gormenghast in 2000), Bob Todd, Lynsey de Paul, and Gareth Hunt."]}, {"page": "1997 in film", "response": ["| Fierce Creatures || Universal Pictures || Fred Schepisi, Robert Young (director); John Cleese (screenplay); Kevin Kline, Jamie Lee Curtis, John Cleese, Michael Palin, Robert Lindsay, Ronnie Corbett, Carey Lowell, Bille Brown, Derek Griffiths, Maria Aitken, Cynthia Cleese, Richard Ridings, Gareth Hunt || Comedy || Live action"]}, {"page": "1989 in film", "response": ["| A Chorus of Disapproval || Curzon Films || Michael Winner (director/screenplay); Alan Ayckbourn (screenplay); Jeremy Irons, Anthony Hopkins, Prunella Scales, Jenny Seagrove, Sylvia Sims, Gareth Hunt, Patsy Kensit, Lionel Jeffries, Alexandra Pigg, Richard Briers, Barbara Ferris, Pete Lee-Wilson, Dinah May, David King, Amanda Mainard, Anne Priestley, Audrey Trotter || Comedy, Drama, Musical || Live action"]}, {"page": "1988 in film", "response": ["| It Couldn't Happen Here || Liberty Films || Jack Bond (director/screenplay); Neil Tennant, Chris Lowe, Joss Ackland, Neil Dickson, Gareth Hunt, Barbara Windsor || Musical || Live action"]}, {"page": "Fierce Creatures", "response": ["* Gareth Hunt as Inspector Masefield"]}, {"page": "Kenny Everett", "response": ["Everett made one foray into film with 1984's Bloodbath at the House of Death, a spoof of Hammer horror films, which was penned by Everett's usual writing partners Barry Cryer and Ray Cameron (who also directed the film). Vincent Price was featured as the villain, credited only as the \"Sinister Man\", and a number of other popular comedians and actors also appeared, including Pamela Stephenson, Gareth Hunt and Don Warrington. Several regulars from Everett's television series also appeared."]}, {"page": "2007 in film", "response": ["| style=\"text-align:center;\"| 14 || Gareth Hunt || style=\"text-align:center;\"| 65 || style=\"text-align:center;\"|UK || style=\"text-align:center;\"| Actor || "]}, {"page": "Redhill, Surrey", "response": ["*Gareth Hunt, actor.  Remembered for playing the footman Frederick Norton in Upstairs, Downstairs and Mike Gambit in The New Avengers."]}, {"page": "Merchant Navy (United Kingdom)", "response": ["*Gareth Hunt: actor, notably in The New Avengers, and Upstairs, Downstairs"]}, {"page": "Lynsey de Paul", "response": ["In 1994, she released her first album in 15 years entitled Just a Little Time. It featured newly recorded and released songs, notably \"Words Don't Mean a Thing\" and \"We Got Love\", as well as reworked and updated versions of many of her classic hits, plus two club mixes of \"Sugar Me\" and \"Getting a Drag\". This was a CD-only release on the Music DeLuxe label that has since been re-issued on other labels such as ARC Records and Tring International. That year, she also released a new single \"There's No Place Like London\", her version of the song she had written for Shirley Bassey, featuring an all-star cast that included Frankie Vaughan, Patti Boulaye, Gareth Hunt, Kenny Lynch, Rula Lenska, Gwen Taylor, Lionel Blair, Lorraine Chase, Pam St. Clement, Harry Fowler, Polly James, Larry Adler, Rose Marie, Victor Spinetti, Gorden Kaye and the St Joan of Arc School Choir and credited to Lynsey & Friends. The song was the winning record for the LBC London Parade and it went on sale to raise money for the Variety Club. In an LBC radio programme, de Paul discussed how it came about and how it got its title. Lorraine Chase who sang on the track, also discussed her role. Elizabeth Cohen of Nonsuch High School and David Burditch of St Joan of Arc School in Rickmanshaw, described how their schools became involved in the recording. Lionel Blair urged everyone should join the parade to promote London and Ian Fenn provided a report from Stock Aitken Waterman's Hit Factory, where the record was produced."]}, {"page": "List of South African television series", "response": ["|British secret agent series starring Mike Gambit (Gareth Hunt), Purdey (Joanna Lumley) and John Steed (Patrick Macnee)."]}, {"page": "Absolute Power (radio and TV series)", "response": ["*Gareth Hunt"]}, {"page": "Upstairs, Downstairs (1971 TV series)", "response": ["According to Jean Marsh and Simon Williams, at the end of the fourth series they, along with other cast members, were eager to move on to other projects. However, with much persuasion by the producers and writers, they, along with the rest of the cast, agreed to do a fifth and final series showing the Bellamy family and staff entering the decade of the twenties and ending the series with the start of the Great Depression. During the final series, Marsh and Williams reduced their appearances on the show, both appearing in only 11 instalments out of the sixteen episodes produced. In addition, eight new cast members were added to the series, which included two servants, Frederick and Lily, played by Gareth Hunt and Karen Dotrice; Richard Bellamy's new wife, Virginia (played by Hannah Gordon); Virginia's two children Alice and William (Anne Yarker and Jonathan Seely); Shirley Cain as Miss Treadwell, the children's governess; Madeleine Cannon as Lady Dorothy (Dolly) Hale, Georgina's self-centred, catty, fair weather friend; and Anthony Andrews as Lord Robert Stockbridge, Georgina's fiancé and husband."]}, {"page": "Martita Hunt", "response": ["Martita Hunt died of bronchial asthma at her home in Hampstead, London, aged 69, on 13 June 1969. Her estate was valued at £5,390. She never married. Actor Gareth Hunt wrongly claimed she was his aunt."]}, {"page": "3-2-1", "response": ["Acts who appeared included: Gloria Gaynor, George Roper, Ken Dodd, Charlie Williams, Bonnie Langford, Duncan Norvelle, Black Lace, Bernie Winters, Stutz Bear Cats, Kit and the Widow, Wall Street Crash, Kiki Dee, Michael Ball, 'Nasty Nigel' Lythgoe, Martin \"The Beast\" Francis, Tom Pepper, Fay Presto, Pete Price, Manhattan Transfer, Shane Richie, the Flaming Hamsters, Stan Boardman, Fascinating Aida, Showaddywaddy, Kajagoogoo, Frankie Howerd, Colm Wilkinson, Wilfrid Brambell from Steptoe and Son, Sinitta, Five Star, Indigo Lady, Cheryl Baker, Phil Cornwell, Jaki Graham, Nana Mouskouri, the Chuckle Brothers, Brian Conley, Roy Walker, the Drifters, John Sparkes, Wayne Sleep, Andrew O'Connor, Gareth Hunt, Peter Beckett, Syd Lawrence (with his orchestra), Humphrey Lyttelton, Frankie Vaughan, Jessica Martin, the Foxes, Mud, Keith Harris and Orville, Mick Miller, Diane Solomon, Tony Christie, Cover Girls, Lyn Paul, the Searchers, the Rockin' Berries, Stephanie Lawrence, Don Lusher (with his band), Madeline Bell, Georgie Fame, Wayne Dobson, the Real Thing, Rebecca Storm, Richard Digance, Anna Dawson, Marion Montgomery, Bill Maynard, the Krankies, Terry Scott, Carmel McSharry, Bob Carolgees, Diana Dors, Lionel Blair, Alvin Stardust, Phil Cool, Vince Eager, Mike Reid, Nicholas Parsons, Sheila Steafel, Danny La Rue, Les Dennis, The Wurzels, Joan Benham, Ken Colyer (with his jazzmen), Frazer Hines, Charlie Williams, Pan's People (as Dee Dee Wilde's Pan's People), Rita Webb, The Great Soprendo, Bernard Bresslaw, Charlie Drake, Aimi MacDonald, Mark Heap (the Two Marks), Vince Hill and Paul Da Vinci."]}, {"page": "Purdey (The New Avengers)", "response": ["Purdey is a fictional character in the British TV series The New Avengers played by Joanna Lumley from 1976–77. She was a spy working for British intelligence, partnered with John Steed (Patrick Macnee) and Mike Gambit (Gareth Hunt)."]}, {"page": "Jersey Battle of Flowers", "response": ["|Gareth Hunt"]}, {"page": "Lear (play)", "response": ["*Engineer - Gareth Hunt", "*Bishop - Gareth Hunt", "*Usher - Gareth Hunt", "*Prison Commandant - Gareth Hunt", "*Officer - Gareth Hunt"]}, {"page": "Night and Day (TV series)", "response": ["* Gareth Hunt as Charlie Doyle; Roxanne's father, he runs the local pub and is probably the wisest of the neighbourhood. Charlie has been married several times."]}, {"page": "Phil Mitchell", "response": ["Phil and Dan's friendship soon ends after Dan tells the police about a motor scam Phil was involved in and Phil cons Dan into signing the pub over to Peggy. Phil is unsupportive when his girlfriend, Lisa, has a miscarriage and he starts domestically abusing her by getting her sacked from her job and insists she stay at home. This makes her dependent on him so he moves on to her best friend, Mel Healy (Tamzin Outhwaite). Lisa is paranoid that Phil is having an affair and accuses Mel of being his other woman, which she is not, at that point. However, Mel is upset by Lisa's accusation and Phil comforts her, leading to a one-night stand. Mel, however, realizes it was a mistake and reconciles with Steve Owen (Martin Kemp), making Phil jealous. Lisa decides that a baby will improve their relationship so stops taking contraceptive pills but Phil wants Lisa to leave him, not get pregnant, so he admits to Lisa that he and Mel slept together. Lisa leaves, keeping quiet about her pregnancy, so when Mark Fowler (Todd Carty) suggests they tell people that the baby is his, Lisa agrees. Phil now has many enemies: Lisa; Steve, who also knows about Mel and Phil's one night stand; Ian, who Phil bullies mercilessly; Mark, who wants to avenge Lisa; and Dan. On Steve and Mel's wedding night, Phil is shot and collapses in a pool of blood. Steve is the prime suspect and is arrested, but Phil – knowing Steve is innocent – confronts the real culprit, Lisa, after he is discharged from hospital. Realizing he drove her to it, Phil gradually forgives Lisa and instead decides to frame Dan upon learning that he has been extorting money from his godson Jamie (Jack Ryder) – whom Phil had took under his wing to spare him from being further abused by his legal guardian and uncle, Billy (Perry Fenwick). His plan come to fruition when Phil contacts Dan's former crime boss, Ritchie Stringer (Gareth Hunt), and together to pair conspire to incriminate Dan for the shooting; with Ritchie giving Dan the same gun that Lisa used to shoot Phil. Unaware that he is being set up, Dan holds Phil at gunpoint – demanding money until he is arrested for attempted murder. Steve later conspires with Phil to have Dan sent down in order to rid Mel from her tormentor for good, but Dan is ultimately acquitted despite their efforts. Dan later seeks revenge on Phil and Steve. After blackmailing Billy into telling him that Mel slept with Phil before she married Steve on the night of the shooting, Dan kidnaps Mel and alerts both Phil and Steve about this – threatening to kill her unless they pay him £200,000. After the two are forced to work together to provide £200,000 for Mel's release, Phil plans to take Dan down during the exchange. He momentarily subdues Dan and prepares to shoot him, but Mel – after learning how Phil and Steve framed Dan for the shooting – helps Dan by turning off the lights to distract Phil, which allows Dan to overpower him. Dan then escapes with the money, while Phil recovers and returns to the square upon helping Steve rescue Mel."]}, {"page": "It Couldn't Happen Here", "response": ["It Couldn't Happen Here is a 1988 musical film starring the British pop duo Pet Shop Boys and based on the music from their first two studio albums Please and Actually. It was originally conceived as an hour-long video based on Actually, but it evolved into a surreal full-scale feature film directed by Jack Bond and co-starring Barbara Windsor, Joss Ackland, Neil Dickson and Gareth Hunt.", "In the early morning, dancers are warming up on an English beach (Clacton-on-Sea, Essex), and Neil Tennant appears on a bicycle. The song \"It Couldn't Happen Here\" is being played. He cycles up to a kiosk, where he buys some postcards from the shopkeeper (Gareth Hunt). The shopkeeper complains about the political faults of the modern world, but Neil ignores him and fills out his postcards.", "Meanwhile, Chris Lowe is at a bed and breakfast. He is in his room, packing everything into a seemingly bottomless trunk. He runs downstairs and waits for the landlady (Barbara Windsor) to bring him breakfast. In the breakfast room, an Uncle Dredge (Gareth Hunt) is making bad jokes. When the huge fried breakfast arrives, Chris empties the contents of the tray over the landlady and runs out onto the street. He runs along the promenade being chased by a group of Hells Angels on bikes.", "They arrive at a transport café, where they are sat next to a traveller (Gareth Hunt). Whilst \"Love Comes Quickly\" plays on the jukebox, they order an inappropriate gourmet meal, but the waitress does not flinch. At another table, a pilot (Neil Dickson, more or less reprising his lead role in Biggles), fiddles frustratedly with a hand-held computer game that says \"divided by... divided by... zero\" (taking lyrics from \"Two Divided by Zero\"). A voice from the traveller's briefcase asks to be let out and the traveller does so, revealing a ventriloquist's dummy. The dummy starts philosophising about the concept of time. He asks whether time can be likened to a teacup in that a teacup is no longer a teacup if no one has the intention to use it as such. To shut him up, Neil puts a record on the jukebox (\"Rent\") and the wall of the café rises to reveal some dancers.", "* Gareth Hunt – Uncle Dredge/postcard seller/ventriloquist"]}, {"page": "Steve Owen (EastEnders)", "response": ["Shortly after confronting Lisa and forgiving her for shooting him, as Phil had driven her to it due to his mistreatment towards her since over a year ago, Phil resolves to implicate the crime on both Steve and Dan to rid himself of his two archenemies who each threaten his position as the square's reigning top dog. He initially plans to incriminate Steve after seeing him and Mel together in the pub, but then decides to frame Dan after the latter begins extorting money from him and Jamie. When Steve learns about this from Billy, he goes to visit Phil and witnesses him finishing his meeting with Dan's former crime boss Ritchie Stringer (Gareth Hunt). That afternoon, Steve begins to taunt Phil into leaving Walford after recalling on what Dan has been doing to him and Jamie. However, Steve's mood changes when Phil reveals that his handgun – which Lisa used to shoot Phil and had kept in possession in between after Steve's wedding and before Phil's recovery – is now in Ritchie's possession as part of his plan to frame Dan, whom Steve insists Phil incriminate after assuming that Phil intents to frame him for the crime. Phil soon plans to lure Steve to The Archies the following night, despite Mel's protests. Steve goes to meet Phil there anyway, but promptly leaves after witnessing Dan holding Phil at gunpoint. Moments later, the police arrive and arrest Dan under the suspicion of shooting Phil and unlawful possession of Steve's firearm. Dan is subsequently charged for the crime and Phil soon asks Steve to help him ensure that Dan would get sent down for the shooting; Steve agrees when it becomes clear that both he and Phil would both find themselves comfortable be well-ridden of their common nemesis, as well as Mel's previous lover and tormentor."]}, {"page": "You Bet!", "response": ["|bgcolor=\"ddffdd\"| Gareth Hunt", "|bgcolor=\"ddffdd\"| Gareth Hunt"]}, {"page": "Jamie Mitchell", "response": ["In 2001, Phil gets shot by an unseen assailant and Jamie resolves to take care of his business empire until he recovers. Jamie later suspects that one of Phil's two archenemies, Steve Owen (Martin Kemp) and Dan Sullivan (Craig Fairbrass), is the culprit when he becomes involved in their dangerous feud – up to the point where Dan begins to extort money from Jamie in his revenge against Phil, while Steve begins clashing with Jamie over the escalating situation. Billy, who is working for Steve as his errand boy, learns about Jamie's struggle and taunts him about it until Jamie overpowers Billy in the snooker club and forces him to submit. Moreover, Jamie ends up sharing his theory with Steve's wife and Dan's former girlfriend Mel Healy (Tamzin Outhwaite). By the time Phil has recovered, it is revealed that the shooter was in fact his ex-girlfriend and Mel's best-friend Lisa Shaw (Lucy Benjamin). He doesn't tell Jamie about this, however, and the two resolve to implicate Dan and Steve behind the shooting in order to rid them out of the square for good. Phil sets his plan to frame Dan as the shooter and Steve as an accessory in motion when he contacts Dan's former crime boss, Ritchie Stringer (Gareth Hunt), and lends him Steve's handgun that Lisa used to shoot him; Ritchie later gives Dan the gun under the pretense of being permitted to further extort Phil. Later on that night, Dan threatens Phil at gunpoint and Jamie intervenes when he suspects that something has gone wrong. Dan nearly shoots them until the police arrive and arrest him for shooting Phil. Afterwards, Phil summons his lawyer Marcus Christie (Stephen Churchett) and the two advice Jamie to testify against Dan to ensure he gets sent down. Jamie complies and Phil later entraps Steve into conspiring with him against Dan to rid themselves of their common enemy. However, their plan fails when Dan is found not guilty and he gets revenge on Phil by kidnapping Mel for a £200,000 ransom – with Dan also getting revenge on Steve for conspiring with Phil against him and using Mel as leverage to exact his vengeance."]}, {"page": "List of former EastEnders characters", "response": ["|Ritchie Stringer || Gareth Hunt || 2001"]}, {"page": "The New Avengers (TV series)", "response": ["A joint United Kingdom-France-Canada production, the series picks up the adventures of John Steed (again played by Patrick Macnee) as he and his team of \"Avengers\" fight evil plots and world domination. Whereas in the original series Steed had almost always been partnered with a woman, in the new series he had two partners: Mike Gambit (Gareth Hunt), a top agent, crack marksman and trained martial artist, and Purdey (Joanna Lumley), a former trainee with The Royal Ballet (to which she ascribed the high-kicking skills she frequently used in the series) who was an amalgam of many of the best talents from Steed's female partners in The Avengers.", "In 1994, Joanna Lumley and Gareth Hunt publicised the launch of the series on domestic videocassette. Sales were stronger than expected, prompting Brian Clemens to consider reuniting the two actors in a \"spin-off\" series. Although both were keen to participate and a script was written, plans stalled at an early stage for undisclosed reasons."]}, {"page": "Dan Sullivan (EastEnders)", "response": ["By then, Dan's growing conflicts with both Phil and Steve were respectively steamed from each of their own romances with Mel — whom Dan had formerly dated after his relationship with one of the pub's customers, Teresa di Marco (Leila Birch), ended with the character sparking a quarrel with her overprotective brother Gianni (Marc Bannerman). He also ends up squaring up against the Mitchell family amid the \"Who Shot Phil\" scenario by clashing with Phil's mother Peggy (Barbara Windsor); extorting money from his godson Jamie (Jack Ryder); and tormenting the latter's estranged uncle Billy (Perry Fenwick). Although it was ultimately revealed on 5 April 2001 that Phil's ex-girlfriend Lisa Shaw (Lucy Benjamin) was in fact the shooter, Phil ends up framing Dan for the crime by colluding with his former crime boss Ritchie Stringer (Gareth Hunt) against him; Dan is consequently arrested and wrongfully imprisoned prior to his trial in mid-summer 2001. While Phil and Steve — though sworn enemies — worked together to rid themselves of their common adversary, the trial culminated with Dan being found not guilty by the jury.", "It is soon revealed that Lisa is the culprit who shot Phil. After confronting Lisa over the shooting, Phil forgives her and decides to frame Dan — knowing that Dan is a much bigger threat to him than Lisa. He first contacts Dan's former crime boss, Ritchie Stringer (Gareth Hunt), and together the pair hatch a plan where Dan would be given the same gun that Lisa used to shoot Phil. Once the weapon is in his position, Dan later confronts Phil at the garage to extort money from him — threatening to shoot him otherwise. When Jamie ends up walking to see Phil being held at gunpoint, he attempts to disarm Dan — who fights off Jamie and ends up shooting the garage's clock from the resulting impact. Moments later, the police arrive thanks to Phil's tip-off and Dan is consequently arrested; he is later charged with attempted murder and will be put on trial for the crime in July 2001."]}, {"page": "The Lady and the Highwayman", "response": ["* Gareth Hunt - Stangret/Sergeant Potter"]}, {"page": "Bloodbath at the House of Death", "response": ["* Gareth Hunt as Elliot Broome"]}, {"page": "Julia McKenzie", "response": ["McKenzie’s early television credits include the sitcom Maggie and Her (1978–1979), alongside Irene Handl and That Beryl Marston...! (1981), with Gareth Hunt. She went on to greater popularity with British viewers as Hester in the 1980s sitcom Fresh Fields opposite Anton Rodgers, and its 1990s sequel French Fields, for which she was voted TV Times Favourite Female Comedy Performance for five consecutive years. The role also earned her a 1985 BAFTA nomination for Best Entertainment Performance. She appeared as Mrs Forthby in Blott on the Landscape and as a villager involved in a series of murders in an episode of Midsomer Murders. Film credits include Hotel du Lac (1986), Shirley Valentine (1989), Bright Young Things (2003), These Foolish Things (2006) and Notes on a Scandal (2006). She has also made several appearances in BBC TV's long running variety show, The Good Old Days."]}, {"page": "Neil Dickson", "response": ["Film credits include Biggles: Adventures in Time and Romy and Michele's High School Reunion. He also appeared alongside Barbara Windsor, Joss Ackland and Gareth Hunt in the Pet Shop Boys film, It Couldn't Happen Here, Lionheart, David Lynch's Inland Empire, King of the Wind, Ridley Scott's Body of Lies and Charles Dennis's The Favour of Your Company and Chicanery. He played Nick in Barbara Taylor Bradford's \"Voice of the heart\" alongside Lindsey Wagner and Victoria Tennant."]}, {"page": "Stewart Bevan", "response": ["After his role in To Sir, with Love (1967), Bevan had a part in the film Lock Up Your Daughters! (1969) before he went on to spend two years in a production of Conduct Unbecoming in the West End from 1969 to 1971 playing Lieutenant Edward Millington alongside Jeremy Clyde, Jeremy Bulloch and Gareth Hunt. His film credits include Burke & Hare (1972), The Flesh and Blood Show (1972), Steptoe and Son Ride Again (1973), The Ghoul (1975), Brannigan (1975) and House of Mortal Sin (1976)."]}, {"page": "Michael Attwell", "response": ["In 1979 and 1980 he played Razor Eddie a.k.a. Edward Winston Malone in two series of the comedy-drama Turtle's Progress. The character had originally been created for the ITV drama serial The Hanged Man, where he was played by Gareth Hunt."]}, {"page": "Mike Gambit", "response": ["Mike Gambit (or Michael Gambit) is a fictional character in the British TV series The New Avengers, played by actor Gareth Hunt.  ", "Gambit was Steed's first male partner since Drs. David Keel and Martin King in the original The Avengers nearly 15 years earlier. Gareth Hunt was picked for the role at auditions held in late January 1976.   His role in the New Avengers team alongside John Steed and Purdey, was to be the action man, charming female witnesses, chasing and fighting villains and protecting his colleagues. "]}, {"page": "Jackie Rea", "response": ["When Alex Higgins married Lynn Hough on 5 January 1980, Rea was one of six people who held an arch of cues under which the couple walked as they left the United Reformed Church in Wilmslow, Cheshire. The other five people being John Virgo, John Smyth, David Taylor, Bruce Donkin and actor Gareth Hunt."]}, {"page": "Hammer House of Mystery and Suspense", "response": ["| Barbi Benton, Gareth Hunt, Peter Wyngarde, Carol Royle, Brian Deacon, Patricia Hayes, Ralph Michael, Robert James"]}, {"page": "1942 in the United Kingdom", "response": ["* 7 February – Gareth Hunt, English actor (died 2007)"]}, {"page": "Friday Night, Saturday Morning", "response": ["| 2 April 1982 || Jane Walmsley || Buzz, Julian Barnes, Jocelyn Stevens, David Puttnam, Colin Welland, David Soul, John McVicar, Gareth Hunt, Jeremy Nichols, Terry Walsh, Allen Whalley"]}, {"page": "List of Upstairs, Downstairs (1971 TV series) characters", "response": ["| Gareth Hunt || Frederick Norton || colspan=\"3\"  ||  || ", "Portrayed by Gareth Hunt, Frederick Norton (1885–?) first appears as James Bellamy's Army batman Trooper Norton when he arrives at Eaton Place to return some of James's belongings when James is believed killed in October 1917. After the war, and following Edward's departure, Frederick is hired by James as footman. In June 1927, Frederick and Lady Dolly Hale start an affair, and Frederick resigns to start a new life in films and as an escort."]}]}}