{"wiki_id": "http://www.wikidata.org/entity/Q14946850", "itemLabel": "Bernard Green", "itemDescription": "British historian, priest and sex offender", "wikipedia_url": "https://en.wikipedia.org/wiki/Bernard_Green", "wikipedia_page": {"main": "Edward Bernard Green OSB (1953–22 March 2013) was an English Catholic priest, Benedictine monk of Ampleforth Abbey, and historian.", "link_mentions": [{"page": "Persecution of Christians", "response": ["In the first two centuries Christianity was a relatively small sect which was not a significant concern of the Emperor. Rodney Stark estimates there were less than 10,000 Christians in the year 100. Christianity grew to about 200,000 by the year 200, which works out to about .36% of the population of the empire, and then to almost 2 million by 250, still making up less than 2% of the empire's overall population. According to Guy Laurie, the Church was not in a struggle for its existence during its first centuries. However, Bernard Green says that, although early persecutions of Christians were generally sporadic, local, and under the direction of regional governors, not emperors, Christians \"were always subject to oppression and at risk of open persecution.\" James L. Papandrea says there are ten emperors generally accepted to have sponsored state sanctioned persecution of Christians, though the first empire wide government sponsored persecution wasn't until Decius in 249."]}, {"page": "The Tablet", "response": ["Contributors to The Tablet have included Popes Benedict XVI and Paul VI (while cardinals), the novelists Evelyn Waugh and Graham Greene, Mark Lawson, Francine Stock, Peter Hennessy, Henry Wansbrough and Bernard Green."]}, {"page": "List of University of Cambridge people", "response": ["*Bernard Green"]}, {"page": "Green (surname)", "response": ["*Bernard Green (1953–2013), English priest", "*Bernard Green (British Army officer) (1887–1971), British army officer"]}, {"page": "List of University of Oxford people in religion", "response": ["*Bernard Green (St Benet's) Catholic priest and monk of Ampleforth"]}, {"page": "Sexual abuse scandal in the English Benedictine Congregation", "response": ["In 1995 Fr Bernard Green, then a housemaster at Ampleforth College, was arrested after indecently assaulting a sleeping boy in one of the school's dormitories. He received two years' probation for an incident which was said to have \"petrified\" the boy concerned.Priest accused of dormitory assault, The Independent, 28 November 1995.Silence and secrecy at school where child sex abuse went on for decades, The Guardian, 18 November 2005."]}, {"page": "2013 in the United Kingdom", "response": ["**Bernard Green, 60, historian."]}, {"page": "Deaths in March 2013", "response": ["*Bernard Green, 60, British priest and historian, heart attack.British historian and priest, Father Bernard Green, dead|ampleforth.org.uk"]}]}}