{"wiki_id": "http://www.wikidata.org/entity/Q14948971", "itemLabel": "Lilian Lindsay", "itemDescription": "First qualified woman dentist in the United Kingdom", "wikipedia_url": "https://en.wikipedia.org/wiki/Lilian_Lindsay", "wikipedia_page": {"main": "Lilian Lindsay, CBE, FSA (née Murray) (24 July 1871 – 31 January 1960) was a dentist, dental historian, librarian and author who became the first qualified female dentist in Britain and the first female president of the British Dental Association.", "link_mentions": [{"page": "North London Collegiate School", "response": ["*Lilian Lindsay [née Murray] (1871–1960) (first female dentist)"]}, {"page": "British Dental Association", "response": ["In 1946 Lilian Lindsay became the first female president of the BDA."]}, {"page": "Camden School for Girls", "response": ["* Lilian Lindsay (1871–1960), first woman with a British qualification in dentistry, having graduated from the Royal College of Surgeons of Edinburgh in 1895"]}, {"page": "Pierre Fauchard", "response": ["Although Fauchard's famous dental treatise on dentistry was published in the 18th century, it was not until 1946 when Lilian Lindsay a medical science historian published a translation in the English language."]}, {"page": "Women in dentistry", "response": ["* 1895: Lilian Lindsay became the first licensed female dentist in Britain.", "* 1946: Lilian Lindsay became the first female president of the British Dental Association."]}, {"page": "Lilian Murray", "response": ["#redirect Lilian Lindsay"]}, {"page": "Dentistry in the Philippines", "response": [":*Lilian Lindsay, woman dentist and dental historian"]}, {"page": "List of English Heritage blue plaques in the London Borough of Camden", "response": ["| Lilian Lindsay(1871–1960)"]}, {"page": "1946 Birthday Honours", "response": ["*Lilian Lindsay, MDS, Honorary Librarian and President Elect of the British Dental Association."]}, {"page": "History of Medicine Society", "response": ["* 1927: First British qualified female dentist, Lilian Lindsay presented \"The London Dentist of the 18th Century\".", "* 1950: First female president of History of Medicine Society, Lilian Lindsay."]}, {"page": "Charles Edward Wallis", "response": ["Wallis was interested in archaeology and history. Writing extensively on the history of dentistry and sitting next to Lilian Lindsay at meetings, Wallis spent a considerable time with activities related to the history of medicine section at the Royal Society of Medicine in Wimpole Street, London.", "Wallis died at the age of 59 years in King’s College hospital on Tuesday 4 January 1927 from bronchopneumonia. He left with his writing an unfinished history of Harley Street. His brother, Ferdinand bestowed a C.E Wallis prize in preventive dentistry for undergraduates at King’s. Ferdinand Wallis also presented the RSM with £100 to establish a ‘CE Wallis Lecture’ on the history of dentistry in memory of his brother.Gelbier, Stanley and Papworth, Julie \"Malcolm Bishop and the CE Wallis Lecture at the Royal Society of Medicine\". Dental Historian. Vol. 63, No. 2 (2018), pp. 52-55. This is jointly arranged by the odontology section of the RSM and the history of medicine society and is given every 5 years. It was emphasised that the lecturer must be a fluent and interesting speaker and should provide “illustrations such as lantern slides”. The first person given the honour of presenting the memorial lecture was Lilian Lindsay. She remembered Wallis as a personal friend who sat next to her at meetings of the History of Medicine Section at the RSM. Other notable speakers have included W. Fraser-Moodie in 1971, J. R. Garrett in 1975,J. R. Garrett. \"Changing Attitudes on Salivary Secretion - A Short History on Spit\". Proceedings of the Royal Society of Medicine. Section of the History of Medicine with Section of Odontology. Vol. 68, No. 2 (September 1975), pp. 553-560. Frank Colyer, Zachary Cope and Stanley Gelbier.", "Tributes have continued through to 2017 with Malcolm Bishop recalling how Wallis was a model mover and shaker of his time. Previously, John Davy Rolleston had prepared a special reference to Wallis in Philadelphia in 1926, at the 7th International Dental Congress called 'Recollections of Lister'. Following Wallis's death, Dr E Graham Little MP, honoured a lecture on the 'Art of War' which Wallis had centred on the Latin text De Re Militari (Concerning Military Matters). Lilian Lindsay commented how \"his retentive memory provided material for his entertainment of children whom he delighted with his stories and recitations\".", "|1933 ||Lilian Lindsay||The Sun, the Tooth drawer and the Saint|| ||"]}, {"page": "List of first women dentists by country", "response": ["||| Lilian Lindsay || 1895 || 1895"]}, {"page": "The Lindsay Society for the History of Dentistry", "response": ["The Lindsay Club was formed in 1962, the idea of dental surgeon J. E. McAuley. He was inspired by the Osler Club, a society for those interested in the history of medicine, of which he was a member. The new club was intended to perform the same function for the history of dentistry and was named after Lilian Lindsay, the first woman to qualify as a dentist in the UK and a president of the British Dental Association. The first meeting of the Lindsay Club was held in October 1962, two years after Lindsay's death. At a later date the club was renamed The Lindsay Society.", "The Lindsay Society holds meetings at the British Dental Association headquarters in Wimpole Street, London and an annual meeting each year usually in the home town of the current president. There is an annual Lilian Lindsay memorial lecture each year at annual British Dental Association conference. The society is affiliated to the British Society for the History of Medicine."]}, {"page": "List of presidents of the History of Medicine Society", "response": ["| 1950–1952 || Lilian Lindsay ||  ||thumb|100px|Lilian Lindsay "]}, {"page": "Peter Orphoot", "response": ["In 1880 the name changed to the Edinburgh Dental Hospital and in 1894 it moved from Drummond Street to the west end of Chambers Street, Orphoot being involved in all these changes. From 1864 the Dispensary and later the Hospital played a major role in the training of Scottish dentists, one of their most famous students being Lilian Lindsay.Scotsman (newspaper) 10 September 2009"]}]}}