{"wiki_id": "http://www.wikidata.org/entity/Q14945692", "itemLabel": "Caroline Criado-Perez", "itemDescription": "British journalist and author", "wikipedia_url": "https://en.wikipedia.org/wiki/Caroline_Criado_Perez", "wikipedia_page": {"main": "Caroline Emma Criado Perez  (born 1984) is a British feminist author, journalist and activist. Her first national campaign, the Women's Room project, aimed to increase the presence of female experts in the media. She opposed the removal of the only woman from British banknotes (other than The Queen), leading to the Bank of England's swift announcement that the image of Jane Austen would appear on the £10 note by 2017. That campaign led to sustained harassment on the social networking website Twitter of Criado Perez and other women; as a result, Twitter announced plans to improve its complaint procedures. Her most recent campaign was for a sculpture of a woman in Parliament Square; the statue of Millicent Fawcett was unveiled in April 2018, as part of the centenary celebrations of the winning of women's suffrage in the United Kingdom. Her 2019 book Invisible Women: Exposing Data Bias in a World Designed for Men was a Sunday Times bestseller.", "link_mentions": [{"page": "Victoria Cleland", "response": ["Cleland was Head of Notes from March 2010Interview with Victoria Cleland, The Bank of England’s Head of Notes Division. Michael Alexander, Coin Update, 10 October 2013. Retrieved 18 September 2014. and has been Director for Banknotes and Chief Cashier from March 2014. In that role, Cleland was primarily responsible for ensuring that banks had the right amount and type of notes available at all times. She was also responsible for measures to prevent forgery and the controversial matter of the design of new notes. In 2013, Cleland received, on behalf of the Bank of England, a petition organised by Caroline Criado Perez to keep a woman on the reverse of Bank of England banknotes. To date, other than the portrait of H.M. The Queen on the obverse of all Bank of England notes, Jane Austen on the reverse of the current polymer £10 note is the third historical woman depicted on a Bank of England note. The previous two historical women were Elizabeth Fry on the last paper £5 note from 2002 until May 2017 and Florence Nightingale on the £10 from 1975 until 1994.Keep a Woman on English Banknotes. Caroline Criado-Perez. Retrieved 18 September 2014."]}, {"page": "2015 Birthday Honours", "response": ["* Ms Caroline Criado-Perez  – Journalist.  For services to Equality and Diversity, particularly in the Media."]}]}}