{"wiki_id": "http://www.wikidata.org/entity/Q14945499", "itemLabel": "Harry Hodson", "itemDescription": "British economist and journalist", "wikipedia_url": "https://en.wikipedia.org/wiki/Harry_Hodson", "wikipedia_page": {"main": "Henry Vincent \"Harry\" Hodson (12 May 1906 – 26 March 1999) was an English economist and editor.", "link_mentions": [{"page": "The Annual Register", "response": ["* Harry Hodson (1973–1987)"]}, {"page": "Worshipful Company of Mercers", "response": ["* Harry Hodson, economist, editor of The Sunday Times (1950–61)"]}, {"page": "Thrilling Cities", "response": ["Roy Thomson, the chairman of The Sunday Times, enjoyed Fleming's articles and suggested a number of other cities, including Rio de Janeiro, Buenos Aires, Havana, New Orleans and Montreal. Others, such as The Sunday Times editor Harry Hodson, were less enthusiastic; Hodson considered that \"more serious readers have tut-tutted a bit about missing the really important things\"."]}, {"page": "Ivison Macadam", "response": ["Macadam was responsible for numerous international conferences around the world. He organised the first Commonwealth Relations Conference at Hart House, University of Toronto, Canada in 1933 (the first Commonwealth conference per se),The over 400 hundred attendees included delegations from the then seven Commonwealth Dominion countries of Canada, Great Britain, Australia, New Zealand, Newfoundland, South Africa and the Irish Free State along with participants from future members like India and others. British Commonwealth Relations: Proceedings of the First Unofficial Conference on British Commonwealth Relations Held at Toronto from September 11th to 21st, 1933 by Arnold J. Toynbee, Published by RIIA followed by others at Lapstone near Sydney, Australia in 1938,This just prior WWII conference was organised after \"Herculean efforts by Macadam.\" The British delegation was under the chairmanship of Lord Lothian, shortly thereafter British Ambassador to the United States, and included TGWU leader Ernest Bevin (later British Foreign Minister in the post-WWII Attlee Labour government), James Walker, General John Burnett-Stuart, Admiral John Kelly, Geoffrey Vickers, Harry Hodson, Lionel Curtis and Macadam. Empire to International Commonwealth: A Biography of Lionel Curtis, Deborah Lavin, Clarendon Press, Oxford, 1995 at Chatham House, London in 1945, at Lucknow, India  in  1950.,capital of the Indian state of Uttar Pradesh and at Lahore, Pakistan in 1954 the capital of the Pakistani province of Punjab Also various Institute of Pacific Relations Conferences, including that at Banff, Canada 1933. He was a participant in the Congress of Europe at The Hague, Netherlands in 1948."]}, {"page": "Ditchley Foundation", "response": ["*The Ditchley Foundation from the autobiography of Harry Hodson"]}, {"page": "Henry Vincent Hodson", "response": ["#REDIRECT Harry Hodson"]}, {"page": "Henry V Hodson", "response": ["#REDIRECT Harry Hodson"]}, {"page": "The Sunday Times", "response": [":1950: Harry Hodson"]}, {"page": "National Student Drama Festival", "response": ["NSDF was founded in 1956 by the Sunday Times arts columnist Kenneth Pearson, the Sunday Times theatre critic Harold Hobson, and National Union of Students president Frank Copplestone. Pearson became the organisation's first artistic director. Early supporters also included Sunday Times Editor Harry Hodson and Professor Glynne Wickham, a leading pioneer of the academic discipline of drama based at the University of Bristol."]}, {"page": "Indo-Pakistani Confederation", "response": ["Former Vice President of India Mohammad Hamid Ansari called for an Indo-Pakistani Confederation that would be \"based on the principle of equality\" and in which \"India, Pakistan and Bangladesh should remain separate, and yet together on issues of common concern and common benefit.\" According to Pakistani historian Ayesha Jalal and former Pakistani Prime Minister Ismail Ibrahim Chundrigar, the Lahore Resolution originally called for a Hindustan-Pakistan Confederation in a United India, not for Pakistan as a separate state from the rest of India. Chundrigar \"said that the object of the Lahore Resolution was not to create Ulsters (a reference to the violent separatist movement aimed at Northern Ireland's independence from the United Kingdom), not to 'destroy the unity of India', but to get the 'two nations (Pakistan and Hindustan)... welded into united India on the basis of equality'. Harry Hodson, the Reforms Commissioner in India in 1941, said that leaders of the All-India Muslim League \"interpreted Pakistan as consistent with a confederation\"."]}, {"page": "Hodson", "response": ["*Harry Hodson, British journalist and economist"]}, {"page": "Institute of Race Relations", "response": ["Proposed by Sunday Times editor Harry Hodson, the institute began as the Race Relations Unit of the Royal Institute of International Affairs in 1952.  Former Governor of the United Provinces Lord Hailey served as first chairman, while Philip Mason, formerly of the Indian Civil Service, served as its first director. The unit later became the Institute of Race Relations under the chairmanship of Sir Alexander Carr-Saunders. Mason remained as director.", "The founding of the IRR can be traced back to a 1950 Chatham House speech by Sunday Times editor Harry Hodson, \"Race Relations in the Commonwealth\", in which he described Communism and race relations as the two transcendent problems."]}, {"page": "List of Old Greshamians", "response": ["*Harry Hodson – economist"]}]}}