{"wiki_id": "http://www.wikidata.org/entity/Q14945525", "itemLabel": "Evelyn Ruggles-Brise", "itemDescription": "British civil servant and prison reformer", "wikipedia_url": "https://en.wikipedia.org/wiki/Evelyn_Ruggles-Brise", "wikipedia_page": {"main": "Sir Evelyn John Ruggles-Brise  (6 December 1857 – 18 August 1935) was a British prison administrator and reformer, and founder of the Borstal system.", "link_mentions": [{"page": "Victorian era", "response": ["By the Victorian era, penal transportation to Australia was falling out of use since it did not reduce crime rates.Hamish Maxwell-Stewart, \"Transportation from Britain and Ireland 1615–1870\", History Compass 8#11 (2010): 1221–42. The British penal system underwent a transition from harsh punishment to reform, education, and training for post-prison livelihoods. The reforms were controversial and contested. In 1877–1914 era a series of major legislative reforms enabled significant improvement in the penal system. In 1877, the previously localized prisons were nationalized in the Home Office under a Prison Commission. The Prison Act of 1898 enabled the Home Secretary to impose multiple reforms on his own initiative, without going through the politicized process of Parliament. The Probation of Offenders Act of 1907 introduced a new probation system that drastically cut down the prison population, while providing a mechanism for transition back to normal life. The Criminal Justice Administration Act of 1914 required courts to allow a reasonable time before imprisonment was ordered for people who did not pay their fines. Previously tens of thousands of prisoners had been sentenced solely for that reason. The Borstal system after 1908 was organized to reclaim young offenders, and the Children Act of 1908 prohibited imprisonment under age 14, and strictly limited that of ages 14 to 16. The principal reformer was Sir Evelyn Ruggles-Brise, the chair of the Prison Commission.R.C.K. Ensor. England 1870–1914 (1937) pp 520–21.J. W. Fox, \"The Modern English Prison\" (1934)."]}, {"page": "Borstal", "response": ["The Gladstone Committee (1895) first proposed the concept of the borstal, wishing to separate youths from older convicts in adult prisons. It was the task of Sir Evelyn Ruggles-Brise (1857–1935), a prison commissioner, to introduce the system, and the first such institution was established at Borstal Prison in a village called Borstal, near Rochester, Kent, England in 1902. The system was developed on a national basis and formalised in the Prevention of Crime Act 1908."]}, {"page": "Her Majesty's Prison Service", "response": ["The British penal system underwent a transition from harsh punishment to reform, education, and training for post-prison livelihoods. The reforms were controversial and contested. In 1877-1914 era a series of major legislative reforms enabled significant improvement in the penal system. In 1877, the previously localised prisons were nationalised in the Home Office under a Prison Commission. The Prison Act 1898 enabled the Home Secretary to enact multiple reforms on his own initiative, without going through the politicised process of Parliament. The Probation of Offenders Act 1907 introduced a new probation system that drastically cut down the prison population, while providing a mechanism for the transition back to normal life. The Criminal Justice Administration Act of 1914 required courts to allow a reasonable time before imprisonment was ordered for people who did not pay their fines. Previously tens of thousands of prisoners had been sentenced solely for that reason. The Borstal system after 1908 was organised to reclaim young offenders, and the Children Act of 1908 prohibited imprisonment under age 14, and strictly limited that of ages 14 to 16. The principal reformer was Sir Evelyn Ruggles-Brise. the chair of the Prison Commission.R.C.K. Ensor. England 1870-1914 (1937) pp 520-21.J. W. Fox, The Modern English Prison (1934)."]}, {"page": "Prison reform", "response": ["The British penal system underwent a transition from harsh punishment to reform, education, and training for post-prison livelihoods. The reforms were controversial and contested. In 1877-1914 era a series of major legislative reforms enabled significant improvement in the penal system. In 1877, the previously localized prisons were nationalized in the Home Office under a Prison Commission. The Prison Act of 1898 enabled the Home Secretary to and multiple reforms on his own initiative, without going through the politicized process of Parliament. The Probation of Offenders Act of 1907 introduced a new probation system that drastically cut down the prison population while providing a mechanism for transition back to normal life. The Criminal Justice Administration Act of 1914 required courts to allow a reasonable time before imprisonment was ordered for people who did not pay their fines. Previously tens of thousands of prisoners had been sentenced solely for that reason. The Borstal system after 1908 was organized to reclaim young offenders, and the Children Act of 1908 prohibited imprisonment under age 14, and strictly limited that of ages 14 to 16. The principal reformer was Sir Evelyn Ruggles-Brise. the chair of the Prison Commission.R.C.K. Ensor. ‘’ England 1870-1914’’ (1937) pp 520-21.J.W. Fox, ‘’The Modern English Prison ‘’ (1934)."]}, {"page": "Montague Druitt", "response": ["In his final year at Winchester, 1875–76, he was Prefect of Chapel, treasurer of the debating society, school fives champion, and opening bowler for the cricket team. In June 1876, he played cricket for the school team against Eton College, which won the match with a team including cricketing luminaries Ivo Bligh and Kynaston Studd, as well as a future Principal Private Secretary at the Home Office Evelyn Ruggles-Brise. Druitt bowled out Studd for four.Leighton, p. 16 With a glowing academic record, he was awarded a Winchester Scholarship to New College, Oxford.Cullen, p. 225; Leighton, p. 20; McDonald, p. 82"]}, {"page": "James Monro", "response": ["Monro immediately clashed with the Home Office and the Receiver, the force's chief financial officer. He complained that he had a shortage of men and that the uniform boots and trousers were of extremely inferior quality. In 1890, Assistant Commissioner Richard Pearson died suddenly. Monro wanted to replace him with Chief Constable Charles Howard, but the Home Office preferred Evelyn Ruggles-Brise, one of its own high-flyers. Monro refused, saying that his force had been promised promotions from below. This was compounded by Monro's backing of his men's grievances over pay and pensions. Matthews announced a bill to improve them, but Monro said it was too little. When Matthews refused to budge, Monro offered his resignation, which was accepted on 12 June 1890, to take effect on 21 June. On 17 June, the bill was published, and met Monro's demands. Howard was also appointed Assistant Commissioner. There was speculation in the press that Matthews had been playing dirty tricks on Monro. Monro got some sort of revenge on 18 July by chairing a meeting of all his superintendents which rejected all of the proposals which he himself had demanded! He left the Met as a hero to both the police and the press."]}, {"page": "Margaret Greville", "response": ["In 1891, Margaret Anderson married the Hon. Ronald Greville (1864–1908). In 1906, her father purchased Polesden Lacey in Great Bookham, Surrey for her and her husband. Her husband died two years later, and her father (who also lived at Polesden Lacey) in 1913. Margaret became known at Polesden Lacey as a society hostess; and was a close friend of Queen Mary. She received proposals of marriage from Sir Evelyn Ruggles-Brise and (in 1917) from Sir John Simon, but declined both."]}, {"page": "Francis Stonor, 4th Baron Camoys", "response": ["Stonor Park Cemetery in Oxfordshire.  He was succeeded in the barony by his eldest son Ralph. After his death, his widow remarried to Sir Evelyn Ruggles-Brise  on 3 September 1914."]}, {"page": "EJ Ruggles-Brise", "response": ["#REDIRECT Evelyn Ruggles-Brise "]}, {"page": "Basil Thomson", "response": ["In the mid-1890s, Thomson read for the bar examinations at the Inner Temple, and was admitted to the bar in 1896. Instead of becoming a barrister, Thomson accepted the position of deputy governor at HM Prison Liverpool, after his name was suggested for the post due to a personal acquaintance with Sir Evelyn Ruggles-Brise, a fellow Old Etonian who had stayed with Thomson in Tonga. Over the next twelve years, he served as governor of Northampton, Cardiff, Dartmoor, and Wormwood Scrubs prisons. From 1908 to 1913, he served as secretary of the Prison Commission."]}, {"page": "List of Vanity Fair (British magazine) caricatures (1910–1914)", "response": ["|1910-02-10 10 Feb 1910||Ruggles Brise Sir Evelyn Ruggles-Brise||Borstal System||Spy||M 1216||25px"]}, {"page": "Harold Ruggles-Brise", "response": ["Harold Ruggles-Brise was born on 17 March 1864, the fifth son of Sir Samuel Brise Ruggles-Brise, of Spains Hall, Essex, and his wife Marianne Weyland Bowyer-Smith, daughter of Sir Edward Bowyer-Smith, 10th Baronet, of Hill Hall, Essex.Burke's Landed GentryWho Was Who.Obituary, Times (London) 27 June 1927. His eldest brothers were Archie (who inherited Spains Hall) and Evelyn (later Sir Evelyn Ruggles-Brise, chairman of the Prison Commission).'Sir Evelyn John Ruggles-Brise', Oxford Dictionary of National Biography, accessed 30 May 2013. Unlike his elder brothers who went to Eton College, Harold was educated at Winchester College, where he was in the Rev J. T. Bramston's House, and at Balliol College, Oxford. At Oxford, Ruggles-Brise obtained a Second Class in Classical Moderations and his cricket Blue in 1883."]}, {"page": "Hill Street, London", "response": ["* Sir Evelyn Ruggles-Brise - No.41"]}, {"page": "File talk:Evelyn Ruggles-Brise.jpg", "response": ["Comparison to this 1925 portrait shows that the subject is Evelyn Ruggles-Brise, not Edward Ruggles-Brise (source only names the subject as Sir E. Ruggles - Brise). The subject appears younger in this photo than the 1925 one (his hair looks whiter and more receded in the 1925 photo), suggesting it is earlier than 1925. January (talk)"]}, {"page": "November 1935", "response": ["*Died: Evelyn Ruggles-Brise, 77, British penologist and founder of the Borstal system"]}, {"page": "1899 New Year Honours", "response": ["* Evelyn Ruggles-Brise, Esq., Chairman of the Prison Commission"]}, {"page": "Edward Daniel Stone", "response": ["Beginning in 1857, he was assistant master at Eton, a position he held for about 27 years. His students included Sir Henry Babington Smith and Sir Evelyn Ruggles-Brise. On 20 November 1873 he was admitted into the Chemical Society."]}, {"page": "Ruggles-Brise", "response": ["*Evelyn Ruggles-Brise (1857–1935), British prison administrator and reformer"]}]}}