{"wiki_id": "http://www.wikidata.org/entity/Q14945665", "itemLabel": "John Mason", "itemDescription": "British historian, born 1920", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Mason_(historian)", "wikipedia_page": {"main": "John Mason (9 June 1920 – 31 October 2009) was a British historian and academic.", "link_mentions": [{"page": "John Mason", "response": ["John Mason may refer to:", "* John Mason (playwright) (fl. 1609), British playwright", "* John Mason (poet) (1646–1694), English clergyman, poet, and hymn-writer", "* John Mason (artist) (1927–2019), ceramic artist from Los Angeles, California", "*John Mason (15th-century MP), Member of Parliament for Lewes and East Grinstead", "*John Mason (diplomat) (1503–1566), British diplomat and spy", "*John Mason (governor) (1586–1635), founder of the Province of New Hampshire and governor of Newfoundland", "*John Mason (Scottish politician) (born 1957), Member of Parliament for Glasgow East and Member of the Scottish Parliament for Glasgow Shettleston", "*John Mason (British diplomat) (1927–2008), UK High Commissioner to Australia", "*John Mason (New Zealand politician) (1880–1975), New Zealand politician", "*John Mason (Australian politician) (born 1928), member of the New South Wales Legislative Assembly", "*Sir John Mason (died 1720), Irish MP for County Waterford", "*John Mason (died 1738), Irish MP for the city of Waterford", "* John Mason (meteorologist) (1923–2015), British meteorologist", "* John Mason (American football), American college football player and coach", "* John Mason (announcer), sports announcer for the Detroit Pistons basketball team", "* John Mason (cricketer) (born 1984), English cricketer", "* John Mason (runner) (born 1987), Canadian long-distance runner", "* John Mason (soccer) (born 1953), Scottish-American soccer defender", "* John Mason (c. 1600–1672) (1600–1672), Commander of the Connecticut forces in the 1637 Pequot War", "* John Mason (businessman) (1773–1839), American banker", "* John Mason (planter) (1766–1849), American banker and planter, son of George Mason", "* John Mason (outlaw) (died 1866), bushwhacker and bandit", "* John Mason (historian) (1920–2009), British historian and Oxford academic", "* John Mason (schoolmaster) (born 1945), Indian educationist", "* John Mason (astronomer), former president of the British Astronomical Association", "* John Mason (master), master of the Prince of Wales in the First Fleet", "* John Mason School, a secondary school in Abingdon, UK."]}, {"page": "Bridgnorth Endowed School", "response": ["The school's name was changed from Bridgnorth Grammar School to Bridgnorth Endowed School in 1974 when it began the transition from a selective to a comprehensive intake. The new name reflected the Endowed School's history, referring to the endowments it had received. In the nineteenth century the terms endowed school and grammar school were used interchangeably as in the Endowed Schools Act 1869. In the second half of the twentieth century the Endowed School's buildings and sporting facilities on the Northgate site were greatly expanded with a new Lower School complex and a new Leisure Centre which the Endowed School had sole use of during the school day. Famous twentieth-century alumni of the school include Sir Cedric Hardwicke, the Hollywood and stage actor, Cyril Washbrook, the cricketer who played for Lancashire and England and who gained a famous record as batsman, Professor Peter Bullock, the inspirational soil scientist who was a member of the IPCC (the work of the IPCC, including the contributions of many scientists, was recognised by the joint award of the 2007 Nobel Peace Prize), and the historian John Mason.", "* John Mason (1920–2009), historian; Student and Librarian of Christ Church, Oxford."]}, {"page": "Deaths in October 2009", "response": ["*John Mason, 89, British historian and librarian."]}]}}