{"wiki_id": "http://www.wikidata.org/entity/Q14949452", "itemLabel": "Joy Batchelor", "itemDescription": "English animator, director and producer", "wikipedia_url": "https://en.wikipedia.org/wiki/Joy_Batchelor", "wikipedia_page": {"main": "Joy Ethel Batchelor (12 May 1914 – 14 May 1991) was an English animator, director, screenwriter, and producer. She married John Halas in 1940 and subsequently co-established Halas and Batchelor cartoons, whose best known production is the animated feature film Animal Farm (1954), which made her the first woman director of an animated feature since Lotte Reiniger. Together they created over 2000 shorts/films, and produced roughly 70 propaganda pieces during World War II for the British government. She helped co-write, write, animate, produce, and direct many of their productions.\nOne of her projects as an art director was Cinerama Holiday (1955). Joy directed and wrote Ruddigore (1967), a television-film adaptation of W.S. Gilbert's opera of the same name, which became the first opera to be adapted into an animated film. She later worked in television, directing series, including animated shows like The Jackson 5ive (1971). Batchelor died on 14 May 1991, just two days after her 77th birthday.", "link_mentions": [{"page": "List of film and television directors", "response": ["*Joy Batchelor"]}, {"page": "List of female film and television directors", "response": ["* Joy Batchelor (UK/USA)"]}, {"page": "Women's cinema", "response": ["Joy Batchelor was an English animator, director, screenwriter, and producer. She married John Halas in 1940, and subsequently co-established Halas and Batchelor cartoons, whose best known production is the animated feature film Animal Farm (1954), which made her the first woman director of an animated feature since Lotte Reiniger.", "* 1935 Robin Hood (animated film); director:  Joy Batchelor", "* 1954 Animal Farm; co-director: Joy Batchelor"]}, {"page": "English Civil War (song)", "response": ["The cover of the single is a still from John Halas and Joy Batchelor's 1954 animated adaptation of George Orwell's dystopian novella Animal Farm."]}, {"page": "List of animators", "response": ["* Joy Batchelor"]}, {"page": "Brenda Chapman", "response": ["Chapman was one of a team of three directors who worked on 1998's The Prince of Egypt, along with Steve Hickner and Simon Wells.  She became the first woman to land a directing role in an animated feature by a major studio; three others had helmed independent efforts before her (Lotte Reiniger of The Adventures of Prince Achmed, Joy Batchelor of Animal Farm, and Arna Selznick of The Care Bears Movie)."]}, {"page": "John Halas", "response": ["John Halas (born János Halász;Brian McFarlane The Encyclopedia of British Film, London: Methuen/BFI, 2003, p.48 16 April 1912 – 21 January 1995) was a pioneering British animator. Together with Gyula Macskássy (an acquaintance from Sándor Bortnyik's Bauhaus art studio, Műhely), and Félix Kassowitz, Halász co-founded Hungary's first animation studio, Coloriton, in 1932. Coloriton existed for 4 years, producing high-quality promotion-oriented animations for television and cinema including Boldog király kincse (\"The Treasure of the Joyful King\").Orosz, Márton. Vissza a szülőföldre! / Back to the Homeland!. 10th Kecskeméti Animáció Film Fesztivál (KAFF) 2011. Orosz, Anna Ida and Orosz, Márton. Vissza a szülőföldre! - I. rész - Halász János - John Halas . FilmKultura. 2011. Halász learned his craft under George Pal, but launched his own career in 1934, and two years later moved to England where later, with his wife Joy Batchelor, founded Halas and Batchelor in 1940."]}, {"page": "Animal Farm (1954 film)", "response": ["Animal Farm is a 1954 British-American animated drama and propaganda film commissioned by the American Central Intelligence Agency (CIA). and directed by both John Halas and Joy Batchelor, and produced by Halas and Batchelor, based on the 1945 novel of the same name by George Orwell. It was the first British animated feature.Water for Firefighting and Handling Ships, two feature-length wartime training films, were produced earlier, but did not receive a formal cinema release And one of the first adult animated feature films. Although the film was a financial disaster, it quickly became a staple of classrooms in America and Britain. "]}, {"page": "Halas and Batchelor", "response": ["Halas and Batchelor was a British animation company founded by husband and wife John Halas and Joy Batchelor. Halas was a Hungarian émigré to the United Kingdom. The company had studios in London and Cainscross, in the Stroud District of Gloucestershire.", "From 1936, Halas ran a small animation unit that created commercials for theatrical distribution. After independent careers in animation, Halas and Joy Batchelor began working together in 1938. Batchelor responded to Halas's advertisement for an assistant, and they founded Halas and Batchelor in 1940 to create war information and propaganda films.Brian McFarlane The Encyclopedia of British Film, London: Methuen/BFI, 2003, p.48 Approximately 70 films were created for the Ministry of Information, the War Office, and the Admiralty over the course of World War II; most of these were shorts intended to improve morale or spur on increased contributions to the war effort, such as Dustbin Parade, about recycling, and Filling the Gap, about gardening. Halas and Batchelor also created a series of anti-fascist cartoons intended for viewing in the Middle East; starring an Arab boy named Abu, who was \"enticed and misguided by the forces of Hitler and Mussolini.\" The heavy workload (at one point the studios were creating a minute-long short every three weeks) and minimal budgets meant that simple animations with economically driven stories were the norm."]}, {"page": "Borden Mace", "response": ["Mace produced hundreds of films, many of them for the military, in a career spanning decades. During the post World War II period he worked on numerous projects with his mentor, producer Louis de Rochemont, notably on Alfred L. Werker's quasi-biographical Lost Boundaries, which was one of the first U.S. films to feature black actors in professional positions, and which was banned in Atlanta and Memphis. He was also involved in the production and story development of the 1954 Joy Batchelor and John Halas animated adaptation of Animal Farm. His last Hollywood project was John Ehle's The Journey of August King."]}, {"page": "1970 in poetry", "response": ["* Release of Tomfoolery, an animated film directed by Joy Batchelor and John Halas, based on the nonsense verse of Edward Lear (especially \"The Courtship of the Yonghy-Bonghy-Bo\") and Lewis Carroll"]}, {"page": "1991 in comics", "response": ["* May 14: Joy Batchelor, British animator and film director (Halas & Batchelor), dies at age 77. "]}, {"page": "Batchelor (surname)", "response": ["* Joy Batchelor (1914–1991), English director, producer, writer, art director and animator"]}, {"page": "List of British films of 1954", "response": ["|Animal Farm||John Halas, Joy Batchelor||Gordon Heath, Maurice Denham||Literary adaptation||Animated version of George Orwell's book"]}, {"page": "Handling Ships", "response": ["After independent careers in animation, John Halas and Joy Batchelor began working together in 1938, and founded Halas and Batchelor in 1940 to create war information and propaganda films. Approximately 70 films were created for the Ministry of Information, the War Office, and the Admiralty over the course of World War II; most of these were shorts intended to improve morale or spur on increased contributions to the war effort, such as Dustbin Parade, about recycling, and Filling the Gap, about gardening. Halas and Batchelor also created a series of anti-fascist cartoons intended for viewing in the Middle East; starring an Arab boy named Abu, who was \"enticed and misguided by the forces of Hitler and Mussolini.\" The heavy workload (at one point the studios were creating a minute-long short every three weeks) and minimal budgets meant that simple animations with economically driven stories were the norm."]}, {"page": "Arna Selznick", "response": ["Selznick began her career at Toronto's Nelvana studio, participating in several efforts such as Layout Artist on Rock & Rule, Story Supervisor on 64 half hours for Inspector Gadget and Director on Strawberry Shortcake and the Baby Without a Name.  There, she met future husband John van Bruggen.  She moved on to direct The Care Bears Movie, released in 1985 by the Samuel Goldwyn Company in the United States, and Astral Films and Criterion Pictures Corporation in Canada.  The film won Canada's Golden Reel Award for highest-grossing local production in 1985, with the Canadian gross of $22,934,622.00.  Quite remarkable, since children's admission at the time was about $3.50 or less. At the time of that film's release, Arna was probably only the third woman to direct an animated feature (after Lotte Reiniger of 1927's The Adventures of Prince Achmed, and Joy Batchelor of 1954's Animal Farm).  Selznick was part of the layout unit on the next two Care Bears films, A New Generation (1986) and Adventure in Wonderland (1987), and was also a story artist on Wonderland."]}, {"page": "The Candlemaker (film)", "response": ["The Candlemaker is a 1956 animated short film directed by John Halas and Joy Batchelor for the United Lutheran Church in America. The story is about a candlemaker and his son at Christmas time."]}, {"page": "1991 in animation", "response": ["* May 14: Joy Batchelor, British animator, film producer and director (Halas & Batchelor, Animal Farm, the animated music video of Love Is All by Roger Glover), dies at age 77."]}, {"page": "List of animated feature films of the 1950s", "response": ["| Animal Farm ||    || John Halas, Joy Batchelor || Halas and Batchelor || Traditional || First British animated feature "]}, {"page": "List of animated feature films of the 1960s", "response": ["| The Halas & Batchelor Ruddigore ||  || Joy Batchelor || Halas and Batchelor || Traditional ||"]}, {"page": "History of Hungarian animation", "response": ["*1936 - Cartoonist János Halász (anglicized as John Halas) emigrates to found Halas and Batchelor Studio in London with his wife, Joy Batchelor in 1940.Lendvai, Erzsi. Egy halhatatlanságra vágyó animátor. FilmKultúra. 2002. Here he finds the political freedom to produce a number of works including his most famous work, Animal Farm (1954). He would later be granted an OBE in 1972, would become the president of ASIFA in 1979, and would play an essential role in Hungary's first three animated film festivals (KAFF events)."]}, {"page": "1940 in animation", "response": ["* John Halas and Joy Batchelor establish the animated studio Halas and Batchelor. .Brian McFarlane The Encyclopedia of British Film, London: Methuen/BFI, 2003, p.48 "]}, {"page": "April 1912", "response": ["** John Halas, Hungarian-British animator, known for his collaborations with wife Joy Batchelor on Animal Farm, as János Halász, in Budapest (d. 1995) "]}, {"page": "Your Very Good Health", "response": ["Your Very Good Health was one of a series of government-funded propaganda films featuring the cartoon character Charley, which were produced to educate the public changes introduced under the postwar Labour government. Charley had been created in 1946 by Joy Batchelor, and this was the second film featuring him. Different government departments funded the various films, with Your Very Good Health being sponsored by the Central Office of Information for the Ministry of Health."]}, {"page": "List of films dealing with anarchism", "response": ["|John Halas & Joy Batchelor"]}, {"page": "May 1914", "response": ["* Born: Howard K. Smith, American journalist, one of the original Edward R. Murrow Boys at CBS, in Ferriday, Louisiana (d. 2002); Joy Batchelor, English animator, co-founder of the animated production company Halas and Batchelor with husband John Halas, best known for the animated version of George Orwell's Animal Farm, in Watford, England (d. 1991)"]}, {"page": "List of adult animated films", "response": ["| John Halas, Joy Batchelor"]}, {"page": "The Count of Monte Cristo (1973 television series)", "response": ["The series ran for one season, and was produced in the UK by British animation studio Halas and Batchelor Cartoon Films. John Halas and Joy Batchelor had been making animated films since the 1950s.Robert Shail \"British Film Directors: A Critical Guide\"  p89 Edinburgh University Press (18 Oct. 2007) p 89 The show was a co-production with RAI, and ITC. Tyne Tees Television purchased the studio and made a number of animated titles, including this. It was a UK-Italy co-production. The series had 17 episodes, but was not released on video or DVD. It aired in 1973 in the UK, and 1976 in Italy."]}]}}