{"wiki_id": "http://www.wikidata.org/entity/Q14949185", "itemLabel": "John Sauven", "itemDescription": "Executive Director of Greenpeace UK since 2008", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Sauven", "wikipedia_page": {"main": "John Sauven, (born in Ealing, west London, on 6 September 1954) is a trained economist, environmentalist and executive director of Greenpeace UK since 2008. Before that he was the director responsible for Greenpeace communications and specialised on solutions and working with business. Sauven started working in a temporary position for Greenpeace in 1991 while waiting for a place at teacher training college. As director, Sauven has helped to shape Greenpeace UK's commitment to defend the natural world and promote peace by investigating, exposing and confronting environmental abuse, and championing environmentally responsible solutions.", "link_mentions": [{"page": "September 6", "response": ["*  1954   – John Sauven, English economist and environmentalist"]}, {"page": "Terry Gilliam", "response": ["Gilliam has been involved with a number of charitable and humanitarian causes. In 2009, he became a board member of Videre Est Credere (Latin for \"to see is to believe\"), a UK human rights charity.UK Charity Commission, UK Charity Commission Report on Videre, UK Charity Commission, 23 July 2013 Videre describes itself as giving \"local activists the equipment, training and support needed to safely capture compelling video evidence of human rights violations. This captured footage is verified, analysed and then distributed to those who can create change.\"Videre Website. Videre Est Credere. 23 July 2013. He participates alongside movie producer Uri Fruchtmann, music producer Brian Eno and executive director of Greenpeace UK John Sauven."]}, {"page": "Michael Gove", "response": ["Gove introduced a ban on bee-harming pesticides like neonicotinoids. He was praised by Greenpeace UK executive director John Sauven for his strong stance on issues like bee-harming pesticides, single-use plastic bottles and the future of the internal combustion engine\", adding \"Gove has defied many people's expectations on the environment\"."]}, {"page": "St Benedict's School, Ealing", "response": ["* John Sauven, economist, and executive director of Greenpeace UK since 2008"]}, {"page": "John sauven", "response": ["#REDIRECT John Sauven "]}]}}