{"wiki_id": "http://www.wikidata.org/entity/Q1490916", "itemLabel": "William Buller", "itemDescription": "British racing driver", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Buller_(racing_driver)", "wikipedia_page": {"main": "William Buller (born 17 September 1992) is a British racing driver.", "link_mentions": [{"page": "Arden International", "response": ["|  William Buller"]}, {"page": "Carlin Motorsport", "response": ["Carlin joined the Formula 3 Euro Series in 2008. In 2012, after poor results in the first three seasons, William Buller finished fifth and Carlos Sainz Jr. finished ninth. Carlin also entered the 2012 FIA European Formula 3 Championship, where Sainz finished fifth and Buller sixth."]}, {"page": "1992 in the United Kingdom", "response": ["* 17 September – William Buller, driver"]}, {"page": "Fortec Motorsport", "response": ["Fortec were also crowned Team Champions in the Formula Renault 2.0 UK Championship with Alex Lynn clinching the drivers' title with a record-breaking twelve wins in one season. Oliver Rowland secured second in the Championship, as well as winning the Graduate Cup. William Buller was Fortec's top finisher in the British Formula 3 Championship, as he finished fourth in the Championship. In club-level racing, the new-for-2011 InterSteps Championship saw Jake Dennis win the Championship from teammate Alex Walker with Ed Jones finishing in fourth place, while in Formula Renault BARC, Josh Webster narrowly missed out on the drivers', after a close battle with eventual champion Dino Zamparelli.", "|  William Buller", "|  William Buller"]}, {"page": "1992 in Northern Ireland", "response": ["* 17 September - William Buller, driver."]}, {"page": "Buller", "response": ["* William Buller (bishop), theologian and churchman", "* William Buller (racing driver) (born 1992), British racing driver"]}, {"page": "Hitech Grand Prix", "response": ["|  William Buller"]}, {"page": "António Félix da Costa", "response": ["Félix da Costa remained in the series for 2012, and he rejoined the Carlin team, partnering British drivers Alex Brundle and William Buller. For the opening round of the season in Barcelona, Félix da Costa qualified on pole position by 0.01 seconds ahead of Lotus GP team-mates Conor Daly and Aaro Vainio. Félix da Costa jumped the start of the race, and was given a drive-through penalty as a result. He ultimately finished the race in fourteenth place, before taking a seventh-place finish in the weekend's other race. He finished seventh in the opening race at Monaco, meaning he started second for the second race of the weekend. He remained in that position during the race, following Marlon Stöckinger across the line for his first podium of the season."]}, {"page": "2008 Formula Renault seasons", "response": ["| William Buller"]}, {"page": "2008 Formula BMW Europe season", "response": ["|  William Buller", "|  William Buller", "|align=left|  William Buller"]}, {"page": "Guia Circuit", "response": ["|  William Buller"]}, {"page": "2008–09 Toyota Racing Series", "response": ["|  William Buller", "|  William Buller", "|  William Buller", "|  William Buller", "|  William Buller", "|align=\"left\"|  William Buller"]}, {"page": "2008 Formula BMW Americas season", "response": ["|  William Buller", "|style=\"text-align:left\"|  William Buller"]}, {"page": "2009 Formula BMW Europe season", "response": ["|  William Buller", "|  William Buller", "|align=left|  William Buller"]}, {"page": "2009 Formula BMW Pacific season", "response": ["|  William Buller", "* At the last three rounds, guest drivers started from pole position, setting the fastest lap before winning the race. In Singapore, Felipe Nasr achieved that before Facundo Regalia (Okayama) and William Buller did so in Macau.", "|align=left|  William Buller"]}, {"page": "List of Formula 3 Euro Series drivers", "response": ["|align=left| Emil Bernstorff, Tom Blomqvist, William Buller, Philip Ellis, Jack Harvey, Alex Lynn, Alexander Sims (2012)"]}, {"page": "2010 British Formula 3 International Series", "response": ["|  William Buller", "|  William Buller", "|align=left|  William Buller"]}, {"page": "2010 Masters of Formula 3", "response": ["|  William Buller", "|  William Buller", "| William Buller"]}, {"page": "Formula 3 Brazil Open", "response": ["|  William Buller"]}, {"page": "2010 Formula 3 Brazil Open", "response": ["After a weekend of competition, British driver William Buller of the Hitech Racing Brazil outfit was crowned as the race champion, beating a host of Formula Three Sudamericana drivers, as well as André Negrão competing for the Cesario Fórmula team, who would drive in the Eurocup Formula Renault 2.0 championship later in the 2010 season. After Buller qualified on pole position for the first race, he and Negrão took a victory apiece with Yann Cunha finishing third in both races. Negrão won the third race, the pre-final, before Buller claimed the main event by nearly nine seconds from Negrão. Cunha finished third ahead of Razia Sports' Bruno Andrade, and Negrão's team-mate Vittorio Ghirelli completed the top five placings. In Class B the Brazilian of the RC3 Bassani was the winner.", "|  William Buller", "| William Buller", "| William Buller", "!colspan=8 align=center|Fastest lap: William Buller, 1:40.488,  on lap 16", "| William Buller", "| William Buller", "| William Buller", "| William Buller", "!colspan=8 align=center|Fastest lap: William Buller, 1:31.942,  on lap 10"]}, {"page": "2011 British Formula 3 International Series", "response": ["|  William Buller", "* William Buller will change teams for his second season in British F3 moving from Hitech Racing to Fortec Motorsport. Lucas Foresti will also join Fortec Motorsport, having completed his rookie season with Carlin.", "|  William Buller", "|  William Buller", "|  William Buller", "|  William Buller", "|  William Buller", "|  William Buller", "|  William Buller", "|align=left|  William Buller"]}, {"page": "2010 Macau Grand Prix", "response": ["|  William Buller", "Valtteri Bottas set the fastest time in the first half-hour free practice session that was held prior to the first qualifying session, but he and defending race-winner Edoardo Mortara were split by just 0.01 seconds. Mortara's teammate Laurens Vanthoor completed the session in third place, marginally faster than Bottas' teammate Roberto Merhi, with Carlos Huertas completing the top five, just over a second off the pace. Renger van der Zande rounded out the top six, in a crash-filled session with four drivers – Daniel Abt, Felix Rosenqvist, Rio Haryanto and Kimiya Sato – hitting the wall, with William Buller and Michael Ho also having excursions down escape roads.", "|  William Buller", "|  William Buller", "|  William Buller"]}, {"page": "Lewis Williamson", "response": ["After a guest drive in Formula Jedi at Brands Hatch in which he won one of the two races, Williamson moved up into Formula Renault, contesting the 2008 Formula Renault UK Winter Series after Highland Arena Ltd, an organisation set up by three family friends helping to promote sporting talent from the Scottish Highlands – where Williamson resides – leased a car from CR Scuderia. In his second race in the category at Croft, Williamson finished on the podium, taking a third-place finish behind James Calado and Henry Surtees. He added another third place in the final race at Rockingham Motor Speedway, finishing behind Surtees and Dean Stoneman, to end up in sixth place in the championship standings, a point behind fifth-placed William Buller. He also contested the Estoril round of the Portuguese Formula Renault 2.0 Winter Series, taking second and fifth-place finishes for CR Scuderia."]}, {"page": "FIA Formula 3 International Trophy", "response": ["|  William Buller", "|align=\"left\"|  William Buller"]}, {"page": "2012 GP3 Series", "response": ["|  William Buller", "* Alex Brundle competes in the series for Carlin, moving from the FIA Formula Two Championship. He was joined by British Formula 3 driver William Buller.", "Two weeks later at Monaco Vainio took the championship lead from Evans after his first series win from pole position in the feature race. He was joined on the podium by Atech CRS GP's Tamás Pál Kiss and Ocean Racing Technology's Kevin Ceccon. Stöckinger, who started from reverse pole, celebrated his first series win. Félix da Costa and Abt completed the podium. The race was noted by two huge accidents between Carlin team-mates Alex Brundle and William Buller, and between Marussia Manor Racing's Dmitry Suranovich and Daly.", "Prior Silverstone round António Félix da Costa became part of the Red Bull Junior Team and his results increased. He scored his first win of the season, despite start behind championship leaders Evans and Vainio, who joined Félix da Costa on podium. Tyre strategy enabled William Buller to claim the victory in the second race starting from last row on the grid. Daly and Niederhauser completed the podium.", "|  William Buller", "|align=\"left\"|  William Buller"]}, {"page": "2011 Macau Grand Prix", "response": ["The qualifying period was split into two sessions; the first was held on Thursday afternoon and ran for 30 minutes with the second held on Friday afternoon and was similarly timed to the previous day's session. The fastest time set by each driver from either session counted towards his final starting position for the qualification race. The first qualifying session saw Merhi on top, again with a margin of over 1.5 seconds to the field. However, his session came to an early end in deteriorating track conditions as he misjudged his braking for Lisboa corner and ran into the back of Rosenqvist, ending the session for both drivers. Wittmann ended up second ahead of Nasr, Juncadella and Sims. Sekiguchi finished the session in sixth place ahead of top-placed rookie Hannes van Asseldonk and António Félix da Costa with William Buller and Rosenqvist rounding out the top ten. Following them were Foresti, Kimiya Sato with Richie Stanaway and Magnussen provisionally lining up on row seven. Daniel Abt, who held the lead of the Grand Prix before crashing out in 2010, was next ahead of Jazeman Jaafar, Marko Asmer, Laurens Vanthoor and Jimmy Eriksson. Adderly Fong ended the session in 20th, ahead of Carlos Muñoz, Huertas, Hideki Yamauchi, Carlos Sainz Jr., Hywel Lloyd, Evans, Valtteri Bottas, Pietro Fantin, Richard Bradley and Yasuda. After qualifying, numerous penalties were handed out. For earlier free practice incidents, Magnussen and Rosenqvist were sent to the back of the field. Rosenqvist was also given a three-place grid penalty for illegally crossing the pit lane exit line, along with session pacesetter Merhi, Asmer and Signature teammates Vanthoor, Muñoz and Sainz. Yasuda was given a six-place grid drop for crossing the line on two occasions. Merhi was then given another grid penalty for running into Rosenqvist, taking his total drop for the qualification race to ten places. Prior to second qualifying, Merhi, Rosenqvist and van Asseldonk – whose original penalty had not been announced – had their penalties rescinded.", "|  William Buller", "|  William Buller", "|  William Buller"]}, {"page": "2012 British Formula 3 International Series", "response": ["|  William Buller", "|  Félix SerrallésFastest lap recorded by William Buller, but he was ineligible to score the fastest lap point.", "|align=left|  William Buller"]}, {"page": "2012 Formula 3 Euro Series", "response": ["|  William Buller", "|  William Buller", "|  William Buller", "|  William Buller", "|  William Buller", "|align=\"left\"|  William Buller"]}, {"page": "2012 FIA Formula 3 European Championship", "response": ["|  William Buller", "|  William Buller", "| style=\"text-align: left;\" |  William Buller"]}, {"page": "2012 Catalunya GP2 and GP3 Series rounds", "response": ["|  William Buller", "|  William Buller", "|  William Buller"]}, {"page": "2012 Monaco GP2 and GP3 Series rounds", "response": ["|  William Buller", "* — William Buller was given a five-place grid penalty for causing an avoidable accident during the second race in Barcelona.", "|  William Buller", "|  William Buller", "|  William Buller"]}, {"page": "2012 Valencia GP2 and GP3 Series rounds", "response": ["|  William Buller", "|  William Buller", "|  William Buller"]}, {"page": "July 2012 in sports", "response": ["** William Buller   Conor Daly   Patric Niederhauser "]}, {"page": "2012 Silverstone GP2 and GP3 Series rounds", "response": ["|  William Buller", "|  William Buller", "|  William Buller"]}, {"page": "2012 Masters of Formula 3", "response": ["|  William Buller", "|  William Buller", "|  William Buller"]}, {"page": "2012 Hockenheimring GP2 and GP3 Series rounds", "response": ["|  William Buller", "|  William Buller", "|  William Buller"]}, {"page": "2013 British Formula 3 International Series", "response": ["|  William Buller", "|  William Buller", "|  William Buller", "|  William Buller", "|  William Buller", "|  William Buller", "|  William Buller", "|  William Buller", "|  William Buller", "|align=left|  William Buller"]}, {"page": "2013 GP3 Series", "response": ["* William Buller, who drove for Carlin in 2012, decided to concentrate on the newly formed European Formula Three Championship."]}, {"page": "2012 Monza GP2 and GP3 Series rounds", "response": ["|  William Buller", "|  William Buller", "|  William Buller"]}, {"page": "2012 Hungaroring GP2 and GP3 Series rounds", "response": ["|  William Buller", "|  William Buller", "|  William Buller"]}, {"page": "2012 Spa-Francorchamps GP2 and GP3 Series rounds", "response": ["|  William Buller", "|  William Buller", "|  William Buller"]}]}}