{"wiki_id": "http://www.wikidata.org/entity/Q1496455", "itemLabel": "Gavin de Beer", "itemDescription": "British evolutionary embryologist (1899-1972)", "wikipedia_url": "https://en.wikipedia.org/wiki/Gavin_de_Beer", "wikipedia_page": {"main": "Sir Gavin Rylands de Beer  (1 November 1899 – 21 June 1972) was a British evolutionary embryologist, known for his work on heterochrony as recorded in his 1930 book Embryos and Ancestors. He was director of the Natural History Museum, London, president of the Linnean Society of London, and a winner of the Royal Society's Darwin Medal for his studies on evolution.\n\n", "link_mentions": [{"page": "Archaeopteryx", "response": ["Today, fossils of the genus Archaeopteryx are usually assigned to one or two species, A. lithographica and A. siemensii, but their taxonomic history is complicated. Ten names have been published for the handful of specimens. As interpreted today, the name A. lithographica only referred to the single feather described by Meyer. In 1954 Gavin de Beer concluded that the London specimen was the holotype. In 1960, Swinton accordingly proposed that the name Archaeopteryx lithographica be placed on the official genera list making the alternative names Griphosaurus and Griphornis invalid. The ICZN, implicitly accepting de Beer's standpoint, did indeed suppress the plethora of alternative names initially proposed for the first skeleton specimens, which mainly resulted from the acrimonious dispute between Meyer and his opponent Johann Andreas Wagner (whose Griphosaurus problematicus – 'problematic riddle-lizard' – was a vitriolic sneer at Meyer's Archaeopteryx). In addition, in 1977, the Commission ruled that the first species name of the Haarlem specimen, crassipes, described by Meyer as a pterosaur before its true nature was realized, was not to be given preference over lithographica in instances where scientists considered them to represent the same species."]}, {"page": "Heredity", "response": ["The idea that speciation occurs after populations are reproductively isolated has been much debated. In plants, polyploidy must be included in any view of speciation. Formulations such as 'evolution consists primarily of changes in the frequencies of alleles between one generation and another' were proposed rather later. The traditional view is that developmental biology ('evo-devo') played little part in the synthesis, but an account of Gavin de Beer's work by Stephen Jay Gould suggests he may be an exception.Gould S.J. Ontogeny and phylogeny. Harvard 1977. pp. 221–222"]}, {"page": "Hannibal", "response": ["Hannibal outmaneuvered the natives who had tried to prevent his crossing, then evaded a Roman force marching from the Mediterranean coast by turning inland up the valley of the Rhône. His exact route over the Alps has been the source of scholarly dispute ever since (Polybius, the surviving ancient account closest in time to Hannibal's campaign, reports that the route was already debated). The most influential modern theories favor either a march up the valley of the Drôme and a crossing of the main range to the south of the modern highway over the Col de Montgenèvre or a march farther north up the valleys of the Isère and Arc crossing the main range near the present Col de Mont Cenis or the Little St Bernard Pass.Montgenèvre: Peter Connolly, Hannibal and the Enemies of Rome (1978); (extensive summary); Col de la Traversette: Gavin de Beer, Alps and Elephants and Napoleon III; Mahaney 2008, \"Hannibal's Odyssey; Environmental Background to the Alpine Invasion of Italia\"; Mont Cenis: Denis Proctor, Hannibal's March in History. Other theories include the Col de Clapier (Serge Lancel, Hannibal (1995) and the Col du Petit Saint Bernard (Barthold Niebuhr). Recent numismatic evidence suggests that Hannibal's army may have passed within sight of the Matterhorn. Stanford geoarchaeologist Patrick Hunt argues that Hannibal took the Col de Clapier mountain pass, claiming the Clapier most accurately met ancient depictions of the route: wide view of Italy, pockets of year-round snow, and a large campground. Other scholars have doubts, proposing that Hannibal took the easier route across Petit Mount Cenis. Hunt responds to this by proposing that Hannibal's Celtic guides purposefully misguided the Carthaginian general.", "Most recently, W. C. Mahaney has argued Col de la Traversette closest fits the records of ancient authors.Mahaney, W.C., Allen, C.C.R., Pentlavalli, P., Dirszowsky, O., Tricart, P., Keiser, L., Somelar, P., Kelleher, B., Murphy, B., Costa, P.J.M., and Julig, P., 2014, \"Polybius's ‘previous landslide’: proof that Hannibal's invasion route crossed the Col de la Traversette\", Journal of Mediterranean Archaeology and Archaeometry, 14(2), 1–20. Biostratigraphic archaeological data has reinforced the case for Col de la Traversette; analysis of peat bogs near watercourses on both sides of the pass's summit showed that the ground was heavily disturbed \"by thousands, perhaps tens of thousands, of animals and humans\" and that the soil bore traces of unique levels of Clostridia bacteria associated with the digestive tract of horses and mules. Radiocarbon dating secured dates of 2168 BP or c. 218 BC, the year of Hannibal's march. Mahaney et al. have concluded that this and other evidence strongly supports the Col de la Traversette as being the 'Hannibalic Route' as had been argued by Gavin de Beer in 1974. De Beer was one of only three interpreters – the others being John Lazenby and Jakob Seibert – to have visited all the Alpine high passes and presented a view on which was most plausible. Both De Beer and Siebert had selected the Col de la Traversette as the one most closely matching the ancient descriptions.de Beer, S. G., 1974, Hannibal: The struggle for power in the Mediterranean, Book Club Associates, London. Polybius wrote that Hannibal had crossed the highest of the Alpine passes: Col de la Traversette, between the upper Guil valley and the upper Po river is the highest pass. It is moreover the most southerly, as Varro in his De re rustica relates, agreeing that Hannibal's Pass was the highest in Western Alps and the most southerly. Mahaney et al. argue that factors used by De Beer to support Col de la Traversette including \"gauging ancient place names against modern, close scrutiny of times of flood in major rivers and distant viewing of the Po plains\" taken together with \"massive radiocarbon and microbiological and parasitical evidence\" from the alluvial sediments either side of the pass furnish \"supporting evidence, proof if you will\" that Hannibal's invasion went that way. If Hannibal had ascended the Col de la Traversette, the Po Valley would indeed have been visible from the pass's summit, vindicating Polybius's account.Polybius, History III:54de Beer, S. G., 1969, Hannibal: Challenging Rome's supremacy, Viking, New York, NY. pp. 163-180"]}, {"page": "Evolutionary developmental biology", "response": ["The evolutionary embryologist Gavin de Beer anticipated evolutionary developmental biology in his 1930 book Embryos and Ancestors, by showing that evolution could occur by heterochrony, such as in the retention of juvenile features in the adult. This, de Beer argued, could cause apparently sudden changes in the fossil record, since embryos fossilise poorly. As the gaps in the fossil record had been used as an argument against Darwin's gradualist evolution, de Beer's explanation supported the Darwinian position. However, despite de Beer, the modern synthesis largely ignored embryonic development to explain the form of organisms, since population genetics appeared to be an adequate explanation of how forms evolved."]}, {"page": "History of the Alps", "response": ["During the twentieth century, then, the Alps were involved in the globalisation of tourism, a process that caused the multiplication of its destinations. However, in the British population these mountains retained an undeniable attraction. In fact, the British continued to view winter sports in particular (such as skiing, skating, bobsleigh, curling) as significant grounds for justifying their travel and their perpetuation of a unique culture. The personalities of Gavin de Beer and Arnold Lunn represent this attitude through a prolific interpretation of this mountain range from every possible perspective. Indeed, the British  have never ceased to love and be attracted to the Alps. This is not likely to end soon, if the advertisements and presentations of the major Alpine resorts that intersperse the Sunday editions of the major newspapers are any indicator."]}, {"page": "Modern synthesis (20th century)", "response": ["The traditional view is that developmental biology played little part in the modern synthesis, but in his 1930 book Embryos and Ancestors, the evolutionary embryologist Gavin de Beer anticipated evolutionary developmental biology by showing that evolution could occur by heterochrony, such as in the retention of juvenile features in the adult. This, de Beer argued, could cause apparently sudden changes in the fossil record, since embryos fossilise poorly. As the gaps in the fossil record had been used as an argument against Darwin's gradualist evolution, de Beer's explanation supported the Darwinian position."]}, {"page": "Julian Huxley", "response": ["* In the early 20th century he was one of the minority of biologistsBowler P.J. 1983. The eclipse of Darwinism: anti-Darwinian evolutionary theories in the decades around 1900. Johns Hopkins, Baltimore. who believed that natural selection was the main driving force of evolution, and that evolution occurred by small steps and not by saltation (jumps). These opinions are now standard.Bowler P.J. 2003. Evolution: the history of an idea. 3rd ed revised and expanded, University of California Press.Though his time as an academic was quite brief, he taught and encouraged a number of evolutionary biologists at the University of Oxford in the 1920s. Charles Elton (ecology), Alister Hardy (marine biology) and John Baker (cytology) all became highly successful, and Baker eventually wrote Huxley's Royal Society obituary memoir.Baker, John R. 1978. Julian Huxley, scientist and world citizen, 1887–1975. UNESCO, Paris. Perhaps the most significant was Edmund Brisco Ford, who founded a field of research called ecological genetics, which played a role in the evolutionary synthesis. Another important disciple was Gavin de Beer, who wrote on evolution and development, and became Director of the Natural History Museum. Both these fine scholars had attended Huxley's lectures on genetics, experimental zoology (including embryology) and ethology. Later, they became his collaborators, and then leaders in their own right.", "* Elements of Experimental Embryology, with Gavin de Beer (1934)", "* Present Standing of the Theory of Sexual Selection. In: Gavin de Beer (ed). Evolution: Essays on Aspects of Evolutionary Biology. Oxford: Clarendon Press (1938): 11-42."]}, {"page": "St Michael's Mount", "response": ["In prehistoric times, St Michael's Mount may have been a port for the tin trade, and Gavin de Beer made a case for it to be identified with the \"tin port\" Ictis/Ictin mentioned by Posidonius."]}]}}