{"wiki_id": "http://www.wikidata.org/entity/Q14946917", "itemLabel": "Will Sharpe", "itemDescription": "Japanese-English actor, writer, and director", "wikipedia_url": "https://en.wikipedia.org/wiki/Will_Sharpe", "wikipedia_page": {"main": "William Tomomori Fukuda Sharpe (born 22 September 1986) is a Japanese-English actor, writer, and director.", "link_mentions": [{"page": "Footlights", "response": ["* 2007 – Will Sharpe"]}, {"page": "Chris Langham", "response": ["In 2011, in his first screen appearance after his release, he was cast as the lead in Black Pond, a low-budget British film directed by Tom Kingsley and Will Sharpe. In an interview with The Guardian in September 2011, Langham stated that many people had suggested to him that he should work again, but no one wanted to employ him. Reviewing his performance in Black Pond positively, The Independent commented, \"whether it will rehabilitate him among casting agents and comedy show commissioners is another question\". The Kino Digital cinema in Hawkhurst had a screening of the film on 11 December 2011. Afterwards, Langham, who lived nearby, held a brief question-and-answer session to help promote the film."]}, {"page": "Kudos (production company)", "response": ["* Flowers (2016) for Channel 4 – 6 episodes. Written by Will Sharpe and starring Olivia Colman and Julian Barratt. Second series currently in production.   "]}, {"page": "Japan–United Kingdom relations", "response": ["*Will Sharpe - BAFTA Winning Actor and Director known for Giri/Haji (2019)"]}, {"page": "Evening Standard British Film Awards", "response": ["*Most Promising Newcomer : Tom Kingsley & Will Sharpe –  Co-writers/Directors of Black Pond"]}, {"page": "Japanese in the United Kingdom", "response": ["* Will Sharpe – actor of mixed English and Japanese"]}, {"page": "BAFTA Award for Outstanding Debut by a British Writer, Director or Producer", "response": ["| Black Pond || Tom Kingsley (director); Will Sharpe (director); Sarah Brocklehurst (producer)"]}, {"page": "Sharpe (surname)", "response": ["* Will Sharpe, Japanese-English actor, writer, and director"]}, {"page": "Characters of Casualty", "response": ["Lenny Lyons played by Steven Miller, first appeared at the beginning of series 24, on 12 September 2009 - alongside Yuki Reid (Will Sharpe), May Phelps (Laura Aikman) and Heather Whitefield (Georgia Moffett). Miller left the show in 2012, with his departure broadcast on 8 June 2012. Miller reprised his role for the 30th anniversary episode \"Too Old for This Shift\", which aired on 27 August 2016.", "Yuki Reid, played by Will Sharpe, is an F2 Junior Doctor. He was one of eight new Foundation House Officer Year 2 doctors joining the department at the start of series 24. He had known May since the beginning of medical school and helped her out with work, secretly smitten with her. However, May leaves the series after she frames Yuki for breaking a patient's neck, causing her to become paralysed. This resulted in Yuki running away and ending up being admitted to hospital after sleeping rough. After the breakdown of Yuki and May's relationship, he became very close to fellow F2 Lenny. Yuki and the F2s spent the majority of the series competing for the JAFA award, but on the day of the award ceremony he finds out that Lenny has been guaranteed the award in return for keeping quiet about a botched medical trial. After the reveal, the JAFA is cancelled, but Mr Jordan brings both doctors back. In the same episode, 'What Tonight Means to Me - Part One', a series of flashbacks explained that Yuki's brother had cancer and died, explaining his real reason for becoming a doctor, rather than because of his relationship with May, as previously believed."]}, {"page": "Sophia Di Martino", "response": ["Di Martino is in a relationship with actor and writer Will Sharpe, with whom she has two children, one born in 2019 and another in November 2021."]}, {"page": "Jonny Sweet", "response": ["|Will SharpeTom Kingsley"]}, {"page": "Casualty (series 24)", "response": ["Casualty features an ensemble cast of characters in the medical profession, who work in the hospital's Emergency Department. In series 24, Tristan Gemmill, Michael French and Sunetra Sarker played consultants Adam Trueman, Nick Jordan and Zoe Hanna, Georgia Taylor appeared as doctor Ruth Winters, and Steven Miller (actor), Will Sharpe and Laura Aikman played F2s Lenny Lyons, Yuki Reid and May Phelps. Derek Thompson, Suzanne Packer and Ben Turner appeared as nurses Charlie Fairhead, Tess Bateman and Jay Faldren. Jane Hazlegrove, Matt Bardock and Sophia Di Martino played paramedics Kathleen \"Dixie\" Dixon, Jeff Collier and Polly Emmerson. Charles Dale appeared as hospital porter MacKenzie \"Big Mac\" Chalker, and Sam Grey played healthcare assistant Alice Chantrey. Chantrey departed from the show mid-series. Tony Marshall continued his role as receptionist Noel Garcia. Gillian Kearney played nurse Jessica Harrison from the beginning of the series until episode 24, \"An Ugly Truth\". Kearney briefly reprised her role for two episodes, \"New Beginnings\" and \"A Better Past\". Aikman also departed during the course of the series, resuming her role in episode 48, \"What Tonight Means to Me – Part One\". Lucy Gaskell was cast as new nurse Kirsty Clements.", "*Will Sharpe as Yuki Reid (from episode 1)"]}, {"page": "Casualty (series 25)", "response": ["This series has featured the death of Polly Emmerson (Sophia Di Martino), and the departures of Adam Trueman (Tristan Gemmill), Yuki Reid (Will Sharpe), and Kirsty Clements (Lucy Gaskell). This series has welcomed Dylan Keogh (William Beck) and Madiha \"Mads\" Durrani (Hasina Haque), with the latter departing at the end of the series; and has seen the return of Linda Andrews (Christine Tremarco).", "The series also saw a number of departures. Junior doctor, Yuki Reid (Will Sharpe), left the show in episode 16 after taking the blame for Lenny and deciding to take a research position in Birmingham. Sophia Di Martino, who plays ambulance technician, Polly Emmerson left the series in January 2011, with Polly's exit scenes airing in episode 34. Polly, who was to leave the following day for a new career path, decided to fix things between Dylan and an unhinged patient. Unfortunately, the patient is armed with scissors and is stabbed. In a tense episode, Polly bleeds to death, leaving the department devastated and Dylan feeling guilty. Lucy Gaskell, who plays Kirsty Clements, became pregnant, but rather than take maternity leave, decided to leave the show. Kirsty's exit aired in episode 46 when a patient encourages her to make a decision about her future and she chooses to leave Holby with daughter, Nita and live in Wales. In the series finale, Adam Trueman (Tristan Gemmill) left after a tough few weeks, marking the end of his four-year stint on the show.", "*Will Sharpe as Yuki Reid (until episode 16)"]}, {"page": "Dirk Gently (TV series)", "response": ["The programme pilot featured appearances from Doreen Mantle, Anthony Howell, Miles Richardson, Billy Boyle. Episode one saw guest appearances by Paul Ritter, Cosima Shaw, Ken Collard, Colin McFarlane and Miranda Raison. Episode two featured roles for Bill Paterson, Sylvestra Le Touzel, Lydia Wilson, Andrew Leung, Will Sharpe and Bethan Hanks. Episode three features Lisa Dillon and Tony Pitts."]}, {"page": "British Academy Television Award for Best Scripted Comedy", "response": ["| Flowers  (series 2) || Will Sharpe, Naomi de Pear, Diederick Santer, Jane Featherstone || Channel 4"]}, {"page": "List of British films of 2011", "response": ["|| Director: Tom Kingsley, Will Sharpe   Cast: Chris Langham, Simon Amstell, Amanda Hadingue, Colin Hurley"]}, {"page": "British Academy Television Award for Best Supporting Actor", "response": ["| Will Sharpe"]}, {"page": "List of British films of 2012", "response": ["* Will Sharpe (Outstanding Debut by a British Writer, Director or Producer) - Black Pond"]}, {"page": "Tom Kingsley", "response": ["In 2011, Kingsley and Will Sharpe released their low budget feature-length film Black Pond. The film led to Kingsley and Sharpe being nominated for Outstanding Debut at the Baftas, and winning Most Promising Newcomer at the Evening Standard Film Awards. It was listed as a film of the year in the New Statesman and the Financial Times."]}, {"page": "65th British Academy Film Awards", "response": ["* Black Pond – Sarah Brocklehurst (Producer), Tom Kingsley and Will Sharpe (Director)"]}, {"page": "Black Pond", "response": ["Black Pond is the debut, low budget, independent film by young British directors Tom Kingsley and Will Sharpe. The film was nominated for the 2012 BAFTA Outstanding British Debut Award.Outstanding Debut Nominees in 2012, BAFTA. Retrieved 26 January 2012. The film stars Chris Langham in his first acting role since being convicted of child pornography charges. The film is reported as having cost £25,000 to make."]}, {"page": "List of British films of 2016", "response": ["|| Directors: Will Sharpe, Tom Kingsley  Cast: Will Sharpe, Tiani Ghosh, Joe Thomas, Sophia Di Martino, Raph Shirley, Chris Langham"]}, {"page": "Zoe Hanna", "response": ["Zoe later begins a relationship with Nick Jordan (Michael French), which Nick ends when he leaves the ED at the end of series 23. At the beginning of series 24, Nick's clinical lead replacement, Adam Trueman (Tristan Gemmill), assigns Zoe three of the new junior doctors – May Phelps (Laura Aikman), Lenny Lyons (Steven Miller) and Yuki Reid (Will Sharpe) – to her to show them the ropes of the ED and Zoe reassigns May to Ruth Winters (Georgia Taylor) and Yuki to Jeff Collier and Polly Emmerson (Matt Bardock and Sophia Di Martino), while she keeps Lenny under her wing. Zoe later discovers that Nick left because he has a brain tumor and wanted to die alone. Zoe then lies to save his life against his will by forging his signature on documents allowing him treatment. Much remains unsaid in the relationship as he originally didn't appreciate the actions she made. As time goes on, Nick begins to assume she signed the papers saving his life because Zoe is pregnant, prompting her to begin failed cycles of fertility treatments. Nick never realized that she was not pregnant, but after she tells him that she isn't pregnant, Nick ends the relationship again. Nick and Zoe, however, continue to be great friends and close colleagues."]}, {"page": "Flowers (TV series)", "response": ["Flowers is a British black comedy-drama sitcom written by Will Sharpe and starring Olivia Colman and Julian Barratt. It was commissioned by the British broadcaster Channel 4, in association with the American TV streaming service Seeso. The first series premiered in the U.K. with two episodes on 25 April 2016 and was broadcast daily during the week, ending on 29 April. In the United States, all 6 episodes were released online on 5 May 2016. The series concluded with a second series following the same pattern, premiering with two episodes on 11 June 2018, in the UK, followed by an episode daily during that week.", "* Will Sharpe as Shun", "Reception of the second series was similarly positive, once again garnering a 100% \"fresh\" score on Rotten Tomatoes based on 9 reviews. Writing for The Guardian, Sam Wollaston awarded four stars out of five, stating: \"The second series of Will Sharpe’s deeply imaginative comedy-drama has been serious and sensitive in its handling of difficult issues, and hilarious to boot.\""]}, {"page": "The Darkest Universe", "response": ["The Darkest Universe is a 2016 black comedy film by Will Sharpe and Tom Kingsley. The film premiered at the London Comedy Film Festival (LOCO) in April 2016, and subsequently screened at the East End Film Festival in July 2016. The film was written by Tiani Ghosh and Will Sharpe and was shot over a three-year period from 2013 to 2015. It is set on the canals of London and tells the story of the disappearance of a young couple on a narrowboat.", "Zac (Will Sharpe) is a lonely, highly strung city trader on the edge of a psychological breakdown. He has lost everything—his job, his girlfriend Eva (Sophia Di Martino) and, most devastatingly, his weird and wayward younger sister Alice (Tiani Ghosh), the only family he had left. Alice is now a missing person, having disappeared on a narrowboat trip along with her kindred drifter and boyfriend Toby (Joe Thomas). Zac becomes increasingly frustrated with the futile attempts of the police to find them and, eventually, decides to take matters into his own inexpert hands by starting a terribly executed video blog and scouring the dark canals of the UK in a desperate, perhaps even deluded, search for clues. Struggling for information and fast losing hope, Zac reflects on his past and the difficult relationship he had with Alice. Wracked with guilt and regret, his sanity starts to unravel as he fights with memories of her in the weeks leading up to her disappearance. As he remembers her sweetly burgeoning relationship with the mysterious Toby, however, he begins to wonder if there may in fact be a grander, wilder, much stranger explanation for their disappearance."]}, {"page": "Hayley Squires", "response": ["| Directed by Will Sharpe"]}]}}