{"wiki_id": "http://www.wikidata.org/entity/Q1491119", "itemLabel": "Alan Graham Apley", "itemDescription": "British orthopaedic surgeon", "wikipedia_url": "https://en.wikipedia.org/wiki/Alan_Graham_Apley", "wikipedia_page": {"main": "Alan Graham Apley FRCS (10 November 1914, London – 20 December 1996) was a British orthopaedic surgeon and educator known for his textbook, Apley's System of Orthopaedics and Fractures, and for the Apley grind test in meniscal injury.\n\n", "link_mentions": [{"page": "List of eponymous medical signs", "response": ["|Apley grind test   ||  Alan Graham Apley  ||orthopaedic surgery   ||meniscal lesions   || ||manoeuvres to elicit knee pain"]}, {"page": "Apley grind test", "response": ["The Apley test is named for Alan Graham ApleyApley AG. The diagnosis of meniscus injuries. J Bone Joint Surg 1947; 29:78-84 (1914–1996), a British orthopedic surgeon."]}, {"page": "Timothy Herbert", "response": ["He received his medical training at St Bartholomew's Hospital Medical School in London (1959–1964) and his specialty training at St George's Hospital in London, under Alan Graham Apley. Since 1975 he was with the Hand Surgery Unit at St. Luke's Hospital in Sydney, New South Wales, Australia and became Director of that section. He retired in 1996 at the age of 55.Timothy Herbert Interview published in Maîtrise Orthopédique n° 105 - June–July 2001. (in French).Buck-Gramcko, Dieter. Ein Leben für die Handchirurgie: 100 Lebensbilder. Darmstadt: Steinkopff, 2007. p.–99-101."]}, {"page": "Deaths in 1996", "response": ["*Alan Graham Apley, British orthopaedic surgeon (b. 1914)"]}, {"page": "Jitendra Nath Gohain", "response": ["He completed his MBBS from Assam Medical College, Dibrugarh, and went to London for his residency. There he worked with British medical doctors like orthopaedist Alan Graham Apley. In 1971, he became a Fellow of the Royal College of Surgeons and returned to Assam to serve the society. He is still practising medicine in the Nagaon district."]}, {"page": "List of eponymous tests", "response": ["| A || Apley || Alan Graham Apley || Used to evaluate people for problems in the meniscus of the knee  "]}, {"page": "Apley (disambiguation)", "response": ["* Alan Graham Apley (1914-1996), British orthopaedic surgeon and educator", "** Apley grind test, used to evaluate individuals for problems in the meniscus of the knee, devised by Alan Graham Apley"]}]}}