{"wiki_id": "http://www.wikidata.org/entity/Q14946721", "itemLabel": "Iqbal Wahhab", "itemDescription": "British businessman", "wikipedia_url": "https://en.wikipedia.org/wiki/Iqbal_Wahhab", "wikipedia_page": {"main": "Iqbal Wahhab, OBE (Bengali: ইকবাল ওয়াহাব; born 22 August 1963) is a Bangladeshi-born British businessman. He is the founder of Tandoori Magazine, and restaurants The Cinnamon Club and Roast.", "link_mentions": [{"page": "List of British Bangladeshis", "response": ["* Iqbal Wahhab OBE – Entrepreneur, restaurateur, journalist and publisher. He founded Tandoori Magazine and multi-award-winning restaurant Cinnamon Club. Taken from the book Starting Your Own Restaurant (Crimson Publishing)"]}, {"page": "List of British Muslims", "response": ["* Iqbal Wahhab OBE – entrepreneur, restaurateur, journalist, publisher; founder of Tandoori Magazine and multi-award-winning restaurant Cinnamon Club Taken from the book Starting Your Own Restaurant (Crimson Publishing)"]}, {"page": "Vivek Singh (chef)", "response": ["Singh met PR guru Iqbal Wahhab, at a wedding reception at Rajvilas hotel and talked about Indian food using French cooking methods. They opened their first flagship restaurant, The Cinnamon Club, in London in March 2001."]}, {"page": "British Bangladeshi Power & Inspiration 100", "response": ["Each category has 10 positions which are listed in rank order. The rankings have been determined by an advisory committee of leading Bangladeshi UK based newspaper editors headed by chief advisor, Mohammed Nobab Uddin, Editor, Janomot Bengali Newsweekly, the oldest ethnic newspaper. The British Bangladeshi Power 100 is consulted on widely amongst a selected group of leading figures in the community, including Iqbal Wahhab OBE and Syed Nahas Pasha. Each person or organisation named on the list has earned their place on merit after a confidential, impartial and thorough debate."]}, {"page": "List of restaurateurs", "response": ["*  Iqbal Wahhab "]}, {"page": "List of Bangladeshi business people", "response": ["* Iqbal Wahhab"]}, {"page": "Iqbal (name)", "response": ["*Iqbal Wahhab (born 1963), British-Bangladeshi restaurateur"]}, {"page": "Liberty Kitchen", "response": ["Liberty Kitchen launched in 2016. Seed funding was provided by, among others, the Royal Society of Arts and the Drapers' Company, one of the ancient livery companies of the City of London. Its board is chaired by Lord Falconer, and also includes Edward Faulks, Baron Faulks QC and the editor of Delicious, Karen Barnes. Its patrons are Iqbal Wahhab and Gina Moffat, and its founder-director is Janet Boston."]}, {"page": "Vineet Bhatia", "response": ["In 1998 he and Iqbal Wahhab opened Cinnamon Club, before heading up the kitchen at \"Vineet Bhatia\" in Hammersmith the following year. AA Gill wrote: \"It's shaming to point out, but if Bhatia cooked in the French or Italian vernacular, or came from New York, he would be hailed as a superchef\"."]}]}}