{"wiki_id": "http://www.wikidata.org/entity/Q14949341", "itemLabel": "Peter Walters", "itemDescription": "businessperson", "wikipedia_url": "https://en.wikipedia.org/wiki/Peter_Walters", "wikipedia_page": {"main": "Sir Peter Ingram Walters (born 11 March 1931) is a retired British businessman. He is a former CEO and chairman of British Petroleum.  He was born in Birmingham, United Kingdom, in the family of a police inspector.In 1949, he left King Edward's School, Birmingham. He gained a Bachelor of Commerce degree from the University of Birmingham in 1952.In 1954 he joined British Petroleum. In 1965–1967 Walters served as vice president of BP North America Inc., and in 1971–1980 as BP's regional director for the Western Hemisphere, Australasia and the Far East. He became BP's deputy chairman in 1980.Walters was British Petroleum chairman from 1981 to 1990.  He retired from British Petroleum in March 1990. In 1991–1994, he served as chairman of Midland Bank. In 1994–200, he was chairman of SmithKline Beecham. He is a former Deputy Chairman of GlaxoSmithKline.  Walters was deputy chairman of EMI in 1990–1999 and HSBC Holdings in 1992–2001.  In addition, he is a former president of the General Council of British Shipping, the Society of Chemical Industry and the Institute for Employment Studies, and has served as a chairman of the governing body of the London Business School, president of the Institute of Directors, president of the Police Foundation, president of the Institute of Business Ethics and a trustee of the Institute of Economic Affairs.Walters was knighted in 1984.  He was awarded the Society of Chemical Industry's Centenal Medal, an Honorary Fellowship from the Royal Society of Chemistry, an Honorary Fellowship from the Institution of Chemical Engineers, and the Cadman Medal from the Institute of Petroleum.  He has received an Honorary Doctorate of Social Science from Birmingham University, the Honorary Degree of Doctor of Stirling University, and an Honorary Fellowship from the London Business School.", "link_mentions": [{"page": "University of Birmingham", "response": ["Alumni in the world of business include: director of the Bank of England Lord Roll of Ipsden; CEO of J Sainsbury plc Mike Coupe; Chairman of the Shell Transport and Trading Company plc Sir John Jennings; automobile executive Sir George Turnbull; President of the Confederation of British Industry Sir Clive Thompson; CEO and chairman of BP Sir Peter Walters; Chairman of British Aerospace Sir Austin Pearce; mobile communications entrepreneur Mo Ibrahim; fashion designer and retailer George Davis; founder of Osborne Computer Corporation Adam Osborne; and chairman & CEO of Bass plc Sir Ian Prosser."]}, {"page": "BP", "response": ["Peter Walters was the company chairman from 1981 to 1990. During his period as chairman he reduced company's refining capacity in Europe. In 1982, the downstream assets of BP Canada were sold to Petro Canada. In 1984, Standard Oil of California was renamed to Chevron Corporation; and it bought Gulf Oil—the largest merger in history at that time. To meet anti-trust regulations, Chevron divested many of Gulf's operating subsidiaries, and sold some Gulf stations and a refinery in the eastern United States to British Petroleum and Cumberland Farms in 1985. In 1987, British Petroleum negotiated the acquisition of Britoil and the remaining publicly traded shares of Standard Oil of Ohio. At the same year it was listed on the Tokyo Stock Exchange where its share were traded until delisting in 2008."]}, {"page": "Brian Pearse", "response": ["He became chief executive of Midland Bank on 6 March 1991, leaving in March 1994, with the former chairman of BP becoming the chairman in June 1991. He was replaced by his deputy Keith Whitson. The chairman Sir Peter Walters left at the same time, being succeeded by Sir William Purves."]}, {"page": "Walters, Peter", "response": ["#redirectPeter Walters"]}]}}