{"wiki_id": "http://www.wikidata.org/entity/Q14948955", "itemLabel": "James Hogge", "itemDescription": "British politician (1873-1928)", "wikipedia_url": "https://en.wikipedia.org/wiki/James_Hogge", "wikipedia_page": {"main": "James Myles Hogge (19 April 1873 – 27 October 1928) was a British social researcher and Liberal politician.\nHogge was educated at the Edinburgh Normal School, Moray House School of Education, and the University of Edinburgh, where he was president of the Liberal Association. Hogge at first wanted to be teacher. He began as pupil teacher in Edinburgh and was a 1st class King's Scholar at Moray House Training College, Edinburgh but he then qualified as a preacher in the United Free Church of Scotland. However, after engaging in work in the Edinburgh slums, he changed career again to concentrate on social work and research; first in Edinburgh, then in York with Joseph Rowntree and his son Seebohm. On 4 February 1905, Hogge married Florence Rebecca Metcalfe, a widow from Malton in Yorkshire. They had one son and two daughters.", "link_mentions": [{"page": "H. H. Asquith", "response": ["Although accounts differ as to the exact numbers, around 29 uncouponed Liberals had been elected, only three with any junior ministerial experience, not all of them opponents of the coalition. There was widespread discontent at Asquith's leadership, and Sir T. A. Bramsdon, who said that he had been elected at Portsmouth only by promising not to support Asquith, protested openly at his remaining leader from outside the Commons. At first Lloyd George extended the government whip to all Liberal MPs. On 3 February 23 non-coalition Liberals formed themselves into a \"Free Liberal\" group (soon known as the \"Wee Frees\" after a Scottish religious sect of that name); they accepted Asquith's appointment of Sir Donald Maclean as chairman in his absence but insisted that George Rennie Thorne, whom Asquith had appointed Chief Whip, hold that job jointly with James Hogge, of whom Asquith and Maclean had a low opinion. After a brief attempt to set up a joint committee with the Coalition Liberal MPs to explore reunion, the \"Wee Frees\" resigned the government whip on 4 April, although some Liberal MPs still remained of uncertain allegiance. The Liberals won by-elections in March and April 1919, but thereafter Labour performed better than the Liberals in by-elections."]}, {"page": "List of MPs elected in the 1918 United Kingdom general election", "response": ["| James Hogge"]}, {"page": "List of MPs elected in the 1922 United Kingdom general election", "response": ["| James Hogge"]}, {"page": "List of United Kingdom by-elections (1900–1918)", "response": ["|James Hogge"]}, {"page": "James myles hogge", "response": ["#REDIRECT James Hogge "]}, {"page": "James Hogg (disambiguation)", "response": ["* James Hogge (1873–1928), British social researcher and politician"]}, {"page": "National Federation of Discharged and Demobilised Sailors and Soldiers", "response": ["Although the Federation initially invited senior military figures to its meetings, they refused. The leadership was assumed by the left-wing Liberal Party MPs James Hogge and William Pringle, who fought for improved pensions and representation on relevant government committees. Frederick Lister later took over the presidency. The organisation's statutes called for the nationalisation of industry and land. The Federation's politics were thus broadly liberal, although there was a wide diversity of opinion."]}, {"page": "Frederick Lister", "response": ["The National Federation had links with the Liberal Party, and its first president was a Liberal MP James Hogge. The National Association of Discharged Sailors and Soldiers was linked with the Labour Party and trades unions; and the Comrades of the Great War was supported by the Conservative Party. The non-partisan Officers Association split the veterans movements further."]}, {"page": "1911 Glasgow Tradeston by-election", "response": ["The local Liberal association finally settled on J. D. White to defend the seat. He had been Liberal MP for Dunbartonshire before standing down at the last election. They had considered James Hogge and Junior Minister Charles Masterman, and settled on Masterman before he withdrew to contest the 1911 Bethnal Green South West by-election.Liberal Nationalisms: Empire, State, and Civil Society in Scotland and Quebec By James Kennedy The new Unionist candidate was Conservative  John Henry Watts, who had opposed James Keir Hardie at Merthyr Tydfil at the general election."]}, {"page": "James Myles Hogge", "response": ["#REDIRECT James Hogge"]}, {"page": "Hogge, James", "response": ["#redirectJames Hogge"]}]}}