{"wiki_id": "http://www.wikidata.org/entity/Q15040068", "itemLabel": "Mick Easterby", "itemDescription": "British racehorse trainer", "wikipedia_url": "https://en.wikipedia.org/wiki/Mick_Easterby", "wikipedia_page": {"main": "Michael William Easterby (born 30 March 1931) is a British racehorse trainer.\nHe is a dual-purpose trainer, saddling runners in both flat racing and National Hunt racing. He gained his only Classic winner with Mrs McArdy in the 1977 1,000 Guineas and his major successes have come with Lochnager, winner of the King's Stand Stakes, July Cup and Nunthorpe Stakes in 1976; and Peterhof, winner of the Triumph Hurdle also in 1976. His most recent British Pattern race winner came in the 2007 Winter Derby with Gentleman's Deal.\nMick combines training racehorses with farming and has run a working farm at Sheriff Hutton since the 1950s.  Mick runs an annual Point-to-Point on his land at Sheriff Hutton in aid of the Yorkshire Air Ambulance and has raised over £100,000 for this cause.\nMick's brother, Peter Easterby, was also a racehorse trainer and is now retired, and his nephew Tim Easterby is an active trainer. Mick's cousin Henry is the father of Irish rugby union internationals Simon and Guy Easterby.", "link_mentions": [{"page": "1000 Guineas Stakes", "response": ["| Mick Easterby"]}, {"page": "July Cup", "response": ["| Mick Easterby"]}, {"page": "Nunthorpe Stakes", "response": ["| Mick Easterby"]}, {"page": "King's Stand Stakes", "response": ["| Mick Easterby"]}, {"page": "Duchess of Cambridge Stakes", "response": ["| Mick Easterby"]}, {"page": "Gimcrack Stakes", "response": ["| Mick Easterby"]}, {"page": "Triumph Hurdle", "response": ["| Mick Easterby"]}, {"page": "Winter Derby", "response": ["| Mick Easterby"]}, {"page": "European Free Handicap", "response": ["| Mick Easterby"]}, {"page": "Stewards' Cup (Great Britain)", "response": ["| Mick Easterby"]}, {"page": "Great St. Wilfrid Stakes", "response": ["| Mick Easterby", "| Mick Easterby"]}, {"page": "Altcar Novices' Chase", "response": ["| Mick Easterby"]}, {"page": "Mersey Novices' Hurdle", "response": ["| Mick Easterby"]}, {"page": "Tim Easterby", "response": ["Tim's uncle Mick Easterby is also a racehorse trainer."]}, {"page": "Noel Novices' Chase", "response": ["| Mick Easterby"]}, {"page": "Seaton Delaval Stakes", "response": ["| Mick Easterby", "| Mick Easterby"]}, {"page": "Brocklesby Stakes", "response": ["| Mick Easterby"]}, {"page": "Carlisle Bell", "response": ["| Mick Easterby"]}, {"page": "2013 British Champions Series", "response": ["|Hoof ItGraham Gibbons - Mick Easterby"]}, {"page": "EFT Systems Handicap Hurdle", "response": ["| Mick Easterby"]}, {"page": "1993 Champion Hurdle", "response": ["| Mick Easterby (GB)"]}, {"page": "Zetland Gold Cup", "response": ["| Mick Easterby"]}, {"page": "Mrs McArdy", "response": ["In 1975, Lord Grimthorpe sold all his bloodstock, with most being bought by trainer Mick Easterby. Easterby sold the horses on but kept Mrs McArdy and trained at her at his farm near Sheriff Hutton in Yorkshire. He later sold the filly privately to Edith Kettlewell, the wife of a hotelier."]}, {"page": "Lochnager", "response": ["As a foal Lochnager was sold for a \"modest sum\" to Charles Spence. The colt was sent into training with Mick Easterby at his stable near Sheriff Hutton in North Yorkshire. In his early life his size and strength meant that he was viewed as a potential National Hunt horse. Lochnager was ridden in most of his races by the leading northern jockey Edward Hide.", "Lochnager began his third season by finishing fifth in a handicap at York and then finished second over the same distance in a minor at Thirsk but was never beaten again. In May was moved up in class to contest his first Group race, the Temple Stakes over five furlongs at Sandown Park Racecourse. Matched against Roman Warrior at level weights he started at odds of 5/1 and produced his best performance up to that time taking the lead approaching the final furlong and drawing away to win by two lengths. Lochnager then started the 6/4 favourite in a field of thirteen runners for the King's Stand Stakes at Royal Ascot after being backed down from 5/2 in \"one of the biggest gambles seen at Ascot for years\" and produced another impressive performance. He was among the leaders from the start, opened up a clear advantage and held the late challenge of the French-trained filly Realty to win by three-quarters of a length. Timeform described his victory as a \"sparkling display\". Remembering the race in 2002, Mick Easterby, speaking his distinctive Yorkshire dialect said \"Lochnager was such a good 'oss and so strongly fancied, I don't think I've ever been so nervous before a race. I couldn't stop sweatin', just thinking about it. The one thing I told [Hide], over and over again, was not to come too soon. Lochnager was an 'oss with all the gears. What made him so brilliant was that he was so switched off - he'd pick grass on't side of a gallop at home while others galloped past him. But when you asked him to pick up in a race, he was like a Ferrari in overdrive, he had an unbelievable burst of speed. I couldn't watch t'race from the stands. I ended up watching it from t'weighing room ... I've never had an 'oss like him and never seen a better sprinter. He was a machine.\" He also recalled that he was reprimanded by the racecourse stewards for failing to wear appropriate dress as he appeared at the course in his usual suit and trilby."]}, {"page": "Harry Rosebery Stakes", "response": ["| Mick Easterby"]}, {"page": "Grand Military Gold Cup", "response": ["| Mick Easterby"]}, {"page": "Marygate Fillies' Stakes", "response": ["| Mick Easterby"]}, {"page": "Hilary Needler Trophy", "response": ["| Mick Easterby"]}, {"page": "Leisure Stakes", "response": ["| Mick Easterby"]}, {"page": "Pride Stakes (Newmarket)", "response": ["| Mick Easterby"]}, {"page": "Wentworth Stakes", "response": ["| Mick Easterby"]}, {"page": "Quebec Stakes", "response": ["| Mick Easterby"]}, {"page": "Tudenham", "response": ["Tudenham began his racing career in the Scarborough Maiden Stakes over five furlongs at York Racecourse in May and finished second to the Mick Easterby-trained Gypo, beaten a head by the winner. After a three-month absence the colt finished sixth on his reappearance before being stepped up in class for the inaugural running of the Mill Reef Stakes at Newbury Racecourse in September. He took the lead from the start, maintained his advantage until well inside the final furlong but was then caught and beaten a head by Mon Fils. The pair finished ten lengths clear of the other two starters."]}, {"page": "Twafeaj", "response": ["Twafeaj made her debut in a maiden race over five furlongs at Newmarket Racecourse on 3 May and finished second, beaten one and a half lengths by Marling after going to the front a furlong out but being overtaken in the closing stages. Eleven days later she started 1/2 favourite for a maiden over the same distance at York Racecourse but was beaten a head by the Mick Easterby-trained Poolesta. At the same track on 14 June the filly started favourite for a minor event over six furlongs, and recorded her first success, taking the lead inside the last quarter mile and coming home three lengths clear of her rivals despite being eased down by her jockey, Pat Eddery, in the final strides."]}, {"page": "Easterby", "response": ["*Mick Easterby (born 1931), British racehorse trainer"]}]}}