{"wiki_id": "http://www.wikidata.org/entity/Q15054979", "itemLabel": "Omar Rowe", "itemDescription": "English footballer (born 1994)", "wikipedia_url": "https://en.wikipedia.org/wiki/Omar_Rowe", "wikipedia_page": {"main": "Omar Reiss Rowe (born 30 October 1994) is an English footballer who plays as a winger for Hayes & Yeading United.", "link_mentions": [{"page": "Southampton F.C. B team and Academy", "response": ["| Omar Rowe || MF || 2 || 0 ||  Hayes & Yeading ||  Hackney || || Age 18 vs. Barnsley, League Cup, 27 August 2013"]}, {"page": "List of foreign football players in Cypriot First Division", "response": ["*Omar Rowe – Enosis Neon Paralimni FC (2018)"]}, {"page": "2013–14 Southampton F.C. season", "response": ["Southampton began their 2013–14 League Cup campaign in the Second Round against struggling Championship side Barnsley on 27 August. The Saints could have opened the scoring in the first minute through Gastón Ramírez, who missed a chance from 12 yards out, but they did break the deadlock less than half an hour later through Steven Davis who scored in the penalty area. Barnsley came close to equalising close to the end of the first half, but shortly after the break it was Southampton who scored next through Jay Rodriguez, although this was soon to be cancelled out by Stephen Dawson for the home side. In the 66th minute, Emmanuel Mayuka scored his first goal for the club on only his third start for the club in a year, and later in the game debuts were given to winger Omar Rowe, midfielder Harrison Reed, and forward Jake Sinclair. Mayuka was later brought down in the box in the final minute of normal time, Steven Davis converted the penalty to give Saints the win, and Ramírez scored straight after to make it a 5–1 win for the Premier League side.", "|Omar Rowe"]}, {"page": "2014–15 Southampton F.C. season", "response": ["|Omar Rowe"]}, {"page": "2015–16 Southampton F.C. season", "response": ["| Omar Rowe"]}, {"page": "Aaron Rowe", "response": ["Rowe is the younger brother of former Southampton man Omar Rowe, who has played in Cyprus."]}, {"page": "2016–17 Cypriot Third Division", "response": ["|align=\"left\"| Omar Rowe"]}]}}