{"wiki_id": "http://www.wikidata.org/entity/Q1501152", "itemLabel": "Gemma Merna", "itemDescription": "British actor and model", "wikipedia_url": "https://en.wikipedia.org/wiki/Gemma_Merna", "wikipedia_page": {"main": "Gemma Merna (born 6 February 1984) is an English actress and model. She is best known for portraying the role of Carmel McQueen in the Channel 4 soap opera Hollyoaks from 2006 to 2014.", "link_mentions": [{"page": "Bonnie Tyler", "response": ["In April 2009, Tyler joined Welsh male voice choir Only Men Aloud! on their UK tour to perform \"Total Eclipse of the Heart\". They recorded the song for their second studio album Band of Brothers, which was released in October. In the same year, she also recorded the title song for Mal Pope's new musical Cappuccino Girls, and performed the song at the opening night in Swansea's Grand Theatre. Tyler also made a cameo on Hollyoaks Later to sing \"Holding Out for a Hero\" in a dream sequence with Carmel McQueen (Gemma Merna)."]}, {"page": "Cleethorpes", "response": ["*Gemma Merna, actress"]}, {"page": "Police community support officer", "response": ["Hollyoaks the long-running British television soap opera, on Channel 4 featured for many years  Carmel McQueen played by Gemma Merna who was portrayed as being a PCSO between 2009 and 2010."]}, {"page": "Lydiate", "response": ["*Gemma Merna, a British actress known as Carmel McQueen in TV soap Hollyoaks lives in Lydiate."]}, {"page": "Hollyoaks", "response": ["In November 2012, Hollyoaks aired \"Enjoy the Ride\", in which four regular characters were killed: Rhys Ashworth (Andrew Moss), and three sixth form students, Maddie Morrison (Scarlett Bowman), Neil Cooper (Tosin Cole) and Jono (Dylan Llewellyn). In October 2013, as part of the celebration of the soap opera turning 18, the show aired Hollyoaks — The Blast from 15 October until the end of the week. The storyline saw a cast massacre with five main characters being killed off through the week, and two were also killed off in the annual Hollyoaks Later. In November 2014, the show aired Hollyoaks  – End of The Line from 17–21 November. The storyline saw newcomers Porshe McQueen (Twinnie Lee Moore) and Lockie Campbell (Nick Rhys) celebrate their wedding reception on a party train, and Sienna Blake (Anna Passey)'s car becomes stuck on the tracks after a car chase with her father Patrick Blake (Jeremy Sheffield), causing the train to smash into it and derail. Long-running character Carmel McQueen (Gemma Merna) was killed when the wreckage exploded after saving her cousin Theresa McQueen (Jorgie Porter) from \"villainous\" Sonny Valentine (Aaron Fontaine), who also died in the explosion, who wanted revenge on her for killing Calvin in 2010. Long-running character Mercedes McQueen (Jennifer Metcalfe) also \"died\" in November 2014, just a week after her sister Carmel, in a plot that saw her brutally murdered in the McQueen house by Grace Black. As of December 2014, only two original McQueen family members remain on screen, Myra McQueen (Nicole Barbara Lane) and John Paul McQueen (James Sutton). Mercedes returned in February 2015. In June of that year, Phoebe died after Lindsey Butterfield (Sophie Austin) injects her with potassium chloride. Cleo moves into the house in late January 2015."]}, {"page": "List of former Hollyoaks characters", "response": ["| Carmel McQueen || Gemma Merna || 2006–2014"]}, {"page": "Steph Cunningham", "response": ["Following her departure, her co-stars commented favourably on the actress and character, with Jorgie Porter deeming her an \"ultimate original\", Gemma Merna stating that she \"was Hollyoaks\", and Ricky Whittle admitting that he cried during the airing of her final scenes. Television and entertainment website Holy Soap did not see Steph's fire death coming, calling her actions brave and her ten-year duration \"mammoth\". They described her most memorable moment as telling Niall she did not love him and then watching him commit suicide. Inside Soap said if there was an award for \"the unluckiest character in soap\", Steph would certainly win. In his column for The Guardian, television critic Jim Shelley stated that it was time for Steph to go, having \"suffered enough\" during her tenure. Humorously recapping her ten years in Hollyoaks, Shelley wrote:"]}, {"page": "Tony Hutchinson", "response": ["Hollyoak's series producer Jo Hallows described Tony as a \"fantastic\" character and opined that Pickard had made the role his own. She went on to say that Tony is \"easy to write for, because you can throw any story at him, both serious and frivolous, and you know that Nick will make a good job of it. He'll make you laugh and he'll also make you cry\". Hallows opined that Pickard is \"probably the person I've cried at the most, some of the more difficult stories he's done, even though you know the story that's coming up, you can't help but have a lump in your throat\".Evans 2002, p.129. Another series producer Bryan Kirkwood praised Pickard's acting skills, stating that he felt Pickard is a \"brilliant\" actor. He said he was \"particularly pleased in moving Tony away from the buffoon he had become over the years into heartbreaking stories such Grace's death and his relationship with Jacqui. He's a touching and sensitive actor who's always over-looked\". Series producer Paul Marquess praised Pickard, saying he felt that \"there's only so many daft Tony stories you can do. He's so key to the show and so able and adept\". Pickard's colleague Gemma Merna praised Pickard saying Pickard has \"had some great storylines\", adding that if she was \"half as successful as Nick is on the show and liked as much then I would love to stay\"."]}, {"page": "Dominic Reilly", "response": ["After Grace Hutchinson's death from SIDS, Dom comforts Mandy Hutchinson (Sarah Jayne Dunn). Mandy develops feelings for Dom and leaves Tony, but continues to stay in contact with Dom. Dom begins a relationship with Tina McQueen (Leah Hackett) after they bond over their love of classic literature. Tina's sisters Michaela (Hollie-Jay Bowes) and Carmel McQueen (Gemma Merna) overhear Dom speaking lovingly on a phone to \"Cathy\", a character from he and Tina's favourite book, who they assume to be Kathy Barnes (Sarah Jane Buckley) and accuse Dom of having an affair. Dom then proposes to Tina, which she accepts. Just before their wedding day, Tina discovers Dom and Mandy's past feelings for each other and feels she cannot trust him. After some convincing, Tina goes through with the wedding."]}, {"page": "Jessica Harris (Hollyoaks)", "response": ["On Friday 23 November, Jessica slept with Zoe's boyfriend Darren Osborne (Ashley Taylor Dawson), after the pair had some luck at a casino, which led to them sleeping together on the pool table in The Dog in The Pond with money scattered around them. Two days after their steamy encounter on the pool table Jessica and Darren slept together again but both regretted it. Kris then found out and Jessica and Kris had a confrontation where Kris worked about Jessica and Darren's affair and Darren and Jessica going to the casino behind Zoe's back and the whole conversation was recorded on the radio. Zoe and the whole of Hollyoaks heard it and this led to Zoe moving out of the student flats. Zoe then got revenge by writing crude insults on Jessica's door and throwing her clothes all around the village. Jessica got her own back by editing Zoe's instructional video for Evissa salon to make it seem as if Carmel McQueen (Gemma Merna) was prostituting herself."]}, {"page": "Louise Summers", "response": ["Louise becomes friends with Carmel McQueen (Gemma Merna) and Frankie Osborne (Helen Pearson), who she hires at Evissa to replace Sophie and Mel who died in a fire. Warren moves into the flat with Louise and there is clearly chemistry between the pair. They began going on dates until Louise catches Warren snorting cocaine with Clare in the toilets of The Loft, disgusted at what she has seen, she quickly ends it with Warren. Warren begins to try to get Louise back, however she goes on holiday and meets a man named Andy. They become lovers and she begins to hope for a relationship with him, however a woman calls her and reveals she is married to Andy. After, Louise begins a relationship with Calvin Valentine (Ricky Whittle). Sean returns to the village asking for money from Louise. Louise refuses and he ends up hitting her, which leaves her with a black eye. Warren returns from a holiday and discovers Louise's black eye. She covers up saying it was a burglar, however he discovers it was Sean and he gives him the money he wants. Louise and Calvin then become engaged."]}, {"page": "The British Soap Awards", "response": ["| \"Sexiest Female\" || Roxanne McKee (Louise Summers in Hollyoaks) || Gemma Merna (Carmel McQueen in Hollyoaks) Samia Smith (Maria Sutherland in Coronation Street) Lacey Turner (Stacey Slater in EastEnders) ", "| \"Best Comedy Performance\" || Gemma Merna (Carmel McQueen in Hollyoaks) || Ricky Groves (Garry Hobbs in EastEnders) Charlie Hardwick (Val Lambert in Emmerdale) Martha Howe-Douglas (Donna Parmar in Doctors)"]}, {"page": "Neville Ashworth", "response": ["In spring 2010, Josh is the driver in a car crash which injures several people. None of the family knows that Rhys had spiked Josh's drink, and they all blame Josh. Neville and the family cut Josh out of their lives and as a result, on Suzanne's birthday dinner, Josh punches Neville. Acting on Josh's behaviour, Neville reports his own son to the police. Josh is sentenced to prison for his role in the car crash, and the family falls further apart. To make matters worse, Suzanne begins a sexual affair with Hannah's fiancé Darren Osborne (Ashley Taylor Dawson) at Calvin (Ricky Whittle) and Carmel Valentine's (Gemma Merna) wedding. Suzanne tries to resist, but soon Rhys catches them as they are about to have sex. When Rhys tells Neville about the affair, Neville throws Suzanne out of the family home. When Josh returns early from his prison sentence, Neville and Suzanne reconcile. Ultimately Neville decides they need a clean break, and they tell Josh that since he started their problems, he will stay behind while the rest of the family move to Spain. A guilt-ridden Rhys, unable to convince Neville to change his mind, confesses that he was the one who caused Josh's car crash. Neville is furious with Rhys, who then stays behind in Josh's place, to help sell The Dog. In spite of Neville's anger, he hugs Rhys goodbye, suggesting he will forgive Rhys."]}, {"page": "Suzanne Ashworth", "response": ["At Calvin (Ricky Whittle) and Carmel Valentine's (Gemma Merna) wedding, Suzanne sleeps with Darren. Suzanne later embarked on an affair with Darren, until Rhys catches them outside Darren's flat. Rhys tells Neville who then kicks Suzanne out of The Dog. She then moved in with Darren, temporarily, alongside Cindy and Holly. Neville forgives Suzanne and they reconcile and move to Spain."]}, {"page": "Tina Reilly", "response": ["Tina Reilly (also McQueen) is a fictional character from the British Channel 4 soap opera, Hollyoaks, played by Leah Hackett. Since making her first appearance in August 2006 as part of the McQueen family, Tina has been involved in storylines including sexual harassment and surrogacy. Tina was killed off in a church explosion on 17 October 2008, shortly after Hackett decided to leave the serial. Tina briefly appeared in a flashback on 20 November 2014 when the McQueen family remember her half-sister Carmel Valentine (Gemma Merna) at her funeral.", "Tina meets Dominic Reilly (John Pickard). They soon discover that they both share interests in reading and a passive demeanour. Following many failed dates, Tina and Dom finally kiss and lose their virginity to each other. Tina's sisters Carmel (Gemma Merna) and Michaela (Hollie-Jay Bowes) overhear Dom calling Tina \"Cathy\", a character from her favourite play Wuthering Heights, and assume he is having an affair with Kathy Barnes (Sarah Jane Buckley). Michaela and Carmel decide to expose Dom's apparent affair, but end up finding Dom and Tina sleeping together. Dom proposes to Tina, and they begin to plan their wedding. However, Tina and Dom discover their planned wedding clashes with Tina's sister Mercedes McQueen (Jennifer Metcalfe) and fiancé Russ Owen (Stuart Manning), so Myra suggests they have a double wedding and Mercedes and Tina reluctantly agree. During their joint hen night, Tina and Mercedes, along with Carmel and Jacqui McQueen (Claire Cooper), find an unconscious Clare Cunningham (Gemma Bissix), after she is pushed from a balcony. On the wedding day, Louise Summers (Roxanne McKee) interrupts the ceremony claiming Mercedes slept with Warren Fox (Jamie Lomas) on the night Clare was pushed, Mercedes being his only alibi after his arrest for attempted murder. In order for the wedding not to be ruined, Tina tells Russ that Mercedes was with her all night. After marrying Dom, Tina tells Mercedes she will never forgive her for spoiling her wedding day. Due to lack of privacy at the McQueen house, Tina and Dom move in with Jacqui and her boyfriend, also Dom's brother, Tony Hutchinson (Nick Pickard)."]}, {"page": "Carmel McQueen", "response": ["Carmel Valentine (also McQueen) is a fictional character from the British Channel 4 soap opera Hollyoaks, played by Gemma Merna. She debuted on-screen during episodes airing on 13 August 2006 and was introduced by series producer Bryan Kirkwood as part of the McQueen family. Carmel has proved popular with fans with her comedic personality and has become notable for her \"dumb blonde\" appearance. Carmel was killed-off as she saved her cousin, Theresa McQueen (Jorgie Porter) from Sonny Valentine (Aaron Fontaine) during the \"End of the Line\" storyline. Her most prominent storylines include her marriage and divorce from Sonny's brother Calvin Valentine (Ricky Whittle), her facial disfigurement after a tanning machine explodes in her face, remarrying Calvin which ends in tragedy after he was shot dead by Theresa, her relationship with Jim McGinn (Dan Tetsell), her feud with Theresa and infatuation with Theresa and Calvin's daughter Kathleen-Angel McQueen, beginning a relationship with Sonny and being killed in an explosion following a train crash at her cousin Porsche McQueen's (Twinnie Lee Moore) wedding reception.", "Carmel was created as part of the McQueen family by Bryan Kirkwood in 2006. Actress Gemma Merna successfully auditioned for the part and Carmel was subsequently created around Merna, of this Kirkwood stated: \"Gemma Merna, I remember back to the audition when she turned up looking like a dog's breakfast in what she believed the character would wear. It was instant. From there we created a character around her.\"", "Proving popular with fans, Gemma Merna won both \"Funniest Character\" and \"Favourite Female Character\" at the Hollyoaks Awards.Hollyoaks – E4.com She won the award of \"Best Comedy Performance\" at the 2007 British Soap Awards. In 2007 she was nominated for \"Sexiest Female\".The British Soap Awards 2007: The Winners – Soaps News – Digital Spy In 2008 she was nominated for \"Best Actress\", however, she lost to co-star, Emma Rigby.The British Soap Awards 2008: The Winners – Soaps News – Digital Spy At the 2007 Inside Soap Awards, Merna was nominated for \"Best Newcomer\". In 2008, Merna and Ricky Whittle were nominated for the award of \"Best Couple\" for their portrayals of Carmel and Calvin Valentine. At the 2009 Inside Soap Awards, the McQueens won \"Best Family\". In 2012, Merna was nominated for \"Funniest Female\" at the Inside Soap Awards. Virgin Media compiled a list of their favourite soap couples, Carmel and Calvin were featured and they stated: \"Couples don’t come much cuter than these two – they even have matching police uniforms! The Valentines may be a little lacking in the brain cell department, but they more than make up for it by being the biggest-hearted couple in soap.\""]}, {"page": "Myra McQueen", "response": ["Niall lures Myra to the church she left Niall at when she abandoned him at. Niall \"stuns\" Myra by grabbing her and showing her the step she abandoned him on as a baby. Myra is \"completely confused\" by Niall's actions but \"it slowly starts to dawn on her, especially when she sees the rest of her family in the church\". Barber-Lane explained that Niall decides to play one last game with the family and tells that he is \"going to wipe them out\". Niall decides that he will ask Myra questions and for every one of his questions that Myra answers correctly she can choose one of her children to live. Barber-Lane added that it is \"really traumatic\" experience for Myra. Myra answers all but two questions correctly and must choose out of her six children which two can live. Myra is told that if she fails to make a decision all of her children will die. Barber-Lane commented that for \"a mother, that's such a ridiculously difficult decision. She does choose, though - that's something that comes back to haunt her\". Myra chooses Jacqui and Carmel (Gemma Merna) to die, when John-Paul (James Sutton) and Mercedes (Jennifer Metcalfe) volunteer to die. The church exploded and Tina (Leah Hackett) is killed. Barber-Lane explained that Myra \"can't forgive herself\" for choosing Jacqui and Carmel to die. She added that the family dynamics changed when Myra made this choice. Barber-Lane said that Jacqui is less responsive to Myra and she became stronger than Myra who is \"constantly riddled with guilt\". She concluded that Myra now lets her children \"get away with a lot more things than they usually would\" because of her guilt."]}, {"page": "Mercedes McQueen", "response": ["Mercedes is described as a \"savvy, ballsy girl that can't say no and is unapologetic about it\". She is played as having moments of happiness which she ruins for herself and as managing to justify \"whatever she does that's bad\". Throughout her time on the series, Mercedes' storylines have centered on her relationships. These include her marriages to Russ Owen (Stuart Manning), Malachy Fisher (Glen Wallace) and Dr. Paul Browning (Joseph Thompson), with her second marriage involving her in an HIV storyline, an engagement to Riley Costello (Rob Norbury) and a committed relationship with Joe Roscoe (Ayden Callaghan). She has also been central to several affairs which included Calvin Valentine (Ricky Whittle), her sister's husband, and Riley's father Carl (Paul Opacic). Following the revelation of her affair with Carl on her wedding day to Riley, Mercedes was at the centre of a kidnapping storyline when she was held against her will by Riley's serial killer grandfather, Silas Blissett (Jeff Rawle), before going into labour, giving birth to a boy as a result of the stress. Following her ordeal Mercedes briefly turned to prostitution. When Mitzeee (Rachel Shenton) grows close to Riley, Mercedes begins to stalk her. During the culmination of the plot, in \"pure desperation\" Mercedes stabs herself and Mitzeee is blamed. Mercedes' friend, Lynsey Nolan (Karen Hassan), discovers Mercedes' stalking of Mitzeee and stabbing of herself. Lynsey is later murdered in a \"whodunit\" storyline with Mercedes becoming a suspect in her murder. It is later revealed Mercedes' partner Doctor Browning killed Lynsey to protect Mercedes and in October 2013, Mercedes, Cindy Cunningham (Stephanie Waring) and Lindsey Butterfield (Sophie Austin) attacked, murdered and covered up the murder of Doctor Browning. In the run-up to her 2014 departure, Mercedes was involved in feuds with Freddie Roscoe (Charlie Clapham) and Grace Black (Tamara Wall) and mourning for her sister Carmel (Gemma Merna) following a train crash, which Mercedes was also involved in. Since her return in February 2015, her storylines have included reuniting with her family, her relationship with Joe and delivering a stillborn son named Gabriel, exposing Lindsey as the Gloved Hand Killer, Silas returning and targeting her again, and her feud with Joanne Cardsley (Rachel Leskovac) over Joe, who later dies during the show's \"Halloween Spooktacular\" episodes. In late 2019, the character finds herself at the centre of another \"whodunit\" storyline, \"Who Shot Mercedes?\", where she is shot having angered numerous residents."]}, {"page": "Fletch (Hollyoaks)", "response": ["With nowhere else to go, Fletch was using school as his only refuge. Fletch decided to leave school. Fletch forgave Sasha for having sex with Nige, and begged her to leave Hollyoaks to come to London with him, but Sasha, however, could not decide. Niall Rafferty (Barry Sloane) pushed a pregnant Tina Reilly (Leah Hackett) down the city stairs, Fletch was the only one to witness this action, however Niall blamed him for the attack. No one believed Fletch's claims that he was innocent, and he escaped Carmel McQueen (Gemma Merna) who was trying to arrest him. Fletch went to the hospital to try and explain what had happened, but Niall made things clear that no one would believe him, so he left. A month or two later, Fletch showed up for results day at Sixth Form where he convinced a now clean Sasha that he was also clean. He asked Sasha to move away with him, however, Sasha spotted marks on Fletch's arm from a recent heroin injection. Upon Sasha's discovery Fletch resorted to mugging Sasha and running away. That was his last appearance."]}, {"page": "Kathy Barnes", "response": ["Kathy returns in October 2007, and finds Ste Hay (Kieron Richardson) living with Amy. Kathy and Mike are not happy and throw Ste out. Amy then leaves with Leah and moves in with Ste. Kathy phones the social services which excludes her from her daughter even more. Kathy discovers Sarah and Rhys are back together. Their relationship leads to the start of Kathy's vendetta against the Ashworth family. The family begins getting strange phone calls, vandalism on their house and even a Tupperware box full of faeces. The Ashworths begin to accuse several people including Ste and even own family members Hannah Ashworth (Emma Rigby) and Beth Clement (Sinéad Moynihan). Whilst throwing a brick through the window of the Ashworth family business, Drive 'n' Buy, Kathy loses a nail. She goes to Evissa for a manicure and tells Carmel Valentine (Gemma Merna) that she took the nail off after it became loose. Carmel turns detective and finds a broken nail outside Drive 'n' Buy. She then reveals Kathy as the vandal. Kathy, Mike, Sarah, Amy and Ste are confronted by Rhys, Hannah, Beth. Suzanne (Suzanne Hall), Neville (Jim Millea), and Josh (Sonny Flood). Kathy also gets jealous of Zoe Carpenter (Zoë Lister) and falsely accuses her and Mike of cheating. Although he had always previously supported Kathy throughout all of her various issues while at Hollyoaks, this accusation, coupled with Kathy's vendetta against the Ashworths, finally proves to be the last straw for Mike. Unable to cope with Kathy's behaviour any longer Mike tells her to leave. When she refuses, Mike throws her out, and Kathy goes to stay with her mother. In January 2008 Mike subsequently files for a divorce."]}, {"page": "Sonny Valentine", "response": ["Sonny Valentine is a fictional character from the British Channel 4 soap opera, Hollyoaks, played by Aaron Fontaine. The role was initially played by Devon Anderson until 2007 when producer Bryan Kirkwood fired Anderson. In 2014, the role was recast when Kirkwood decided to reintroduce the character. On 12 November 2014, Sonny was killed off in a train explosion along with Carmel McQueen (Gemma Merna), when Carmel rescued her cousin Theresa McQueen (Jorgie Porter) from Sonny.", "Sonny, now played by Aaron Fontaine, returns when his former sister-in-law Carmel Valentine (Gemma Merna) contacts him and tells him that his niece Kathleen-Angel (Nieve Grandison) is not safe with her mother, Theresa McQueen (Jorgie Porter). When he refuses to help, Carmel reveals that Theresa murdered his brother and Kathleen-Angel's father, Calvin. Sonny confronts Theresa in the village, revealing that he is now a Detective Sergeant in the police force and threatens her. When Carmel finds out, she confronts Sonny and he asks her to make a full written statement saying that Theresa killed Calvin, but she refuses. When Kathleen-Angel goes missing, Carmel tells Sonny about Theresa's plans to flee the village, so she gives in her statement. As Theresa is being pulled into a police car, Sonny arrives with Kathleen-Angel. When Sonny's superior, Sam Lomax (Lizzie Roper), is demoted to Detective Sergeant and is later killed in a car accident with her husband Danny Lomax (Stephen Billington), Sonny is promoted to Detective Inspector and leads the case into the deaths of Sam and Danny. It is revealed that Sonny is a bent copper and that he is working on both sides of the law, being paid by Grace Black (Tamara Wall) to set Big Bob (Vincent Ebrahim) up on a false charge. When Theresa's mother, Kathleen McQueen (Alison Burrows), returns to the village to help get Theresa released from prison, Sonny threatens her. When Kathleen reveals that Sonny is a recovering alcoholic and she tries to spike his drink with alcohol, he bribes her with money. When Kathleen later goes missing, it is revealed that Sonny has beaten her up and she is in hospital. When Kathleen's sister and Theresa's aunt, Myra McQueen (Nicole Barber-Lane), returns from Alicante to help with Theresa's escape plan, she knocks Sonny unconscious, but Theresa is caught and sent back to prison. Myra is livid when she finds out Sonny and Carmel are engaged and vows to show Sonny's true colours to Carmel. Carmel becomes suspicious of Sonny and follows him to the hospital, realising that he has beaten up Kathleen. Myra and Mercedes vow to deal with Sonny, but Kathleen warns the McQueens that they cannot win against Sonny and returns to Spain. Myra, Mercedes and Phoebe McQueen (Mandip Gill) handcuff Sonny in his car and drive him to a lake. When the McQueens are discussing what to do, Myra forgets to put the handbrake on and the car rolls into the lake with Sonny inside."]}, {"page": "Michaela McQueen", "response": ["Michaela decides to track down her father, Ricky Bowen (Simon Cassidy). When they meet, Ricky apologises to Michaela for not trying harder to be involved in her life, claiming Michaela's mother Myra stopped him from seeing Michaela and her siblings John Paul (James Sutton) and Carmel (Gemma Merna). Michaela takes Ricky back to the McQueens' home, where her family do not trust him. During Christmas, Ricky steals the family's presents and leaves, leaving Michaela heartbroken. After this, Michaela begins dating her friend Sasha Valentine's (Nathalie Emmanuel) brother, Sonny (Devon Anderson). Michaela and Sonny plan to sleep together, but are interrupted by Sonny's older brother, Calvin Valentine (Ricky Whittle). The relationship ends when Michaela discovers Sonny had told people he had been sleeping with Michaela's older sister Mercedes McQueen (Jennifer Metcalfe). However, they later get back together, and are arrested for shoplifting on Michaela's sixteenth birthday. Michaela is cautioned by Calvin. Sonny and Michaela eventually sleep together, but he soon moves away from Hollyoaks, which left her devastated, but more bad news for her, as she discover that her older brother John-Paul was gay, and didn't accepted him first, but later she did."]}, {"page": "Clare Devine", "response": ["Clare convinces Louise to have her unborn child aborted and tell fiancé Calvin Valentine (Ricky Whittle) it was a miscarriage. Clare later tells him the truth causing them to split up. Louise and Calvin on separate occasions attack Clare. Clare phones the social services, and tells them her false suspicions that Tom is getting physically abused by Max and O.B.. Clare then manipulates Tom into thinking he caused the deaths of his parents and baby Grace Hutchinson and would cause Max's death, this frightening Tom, he refuses to see Max, making his social worker believe he is being abused. O.B. confronts Clare about Social Services. Clare taunts him over the death of his girlfriend Mel and her sister Sophie, saying it was \"two for the price of one\". O.B. threatens Clare and is seen by several people in The Loft. That night, Clare goes onto The Loft balcony to investigate a noise, there, she is pushed by a mystery person. Jacqui (Claire Cooper), Carmel (Gemma Merna) and Tina McQueen (Leah Hackett) then find Clare, and beside her, Calvin's mobile."]}, {"page": "Leo Valentine", "response": ["In July 2014, Sonny (now played by Aaron Fontaine) informs his current fiancée Carmel McQueen (Gemma Merna) that Leo has provided him with a financial deposit for the two of them to purchase a household of their own in the village."]}, {"page": "Warren Fox", "response": ["Mandy tells Louise about the affair and the pair plan revenge on Warren, after Louise tells Mandy that Warren killed Sean. They then come up with a plan to steal Warren's money and go to the police about the murder. Louise sees CCTV footage of Warren and Mandy sleeping together in The Loft and decides to murder Warren and frame Mandy. On the wedding day, Warren's foster brother Spencer Gray (Darren John Langford) turns up, stating his mother has died. Warren asks him to be his best man. Warren, Ravi and Spencer arrive at the hotel where the wedding is being held. Warren goes up to Louise's room where he hides a necklace for her, however, he finds the gun which she plans to use to kill him. Warren takes the gun and removes the bullets as Louise returns to the room. He gives her the necklace and asks if the gun was his present. Louise reveals she hates Warren because he had ruined her life, killed her husband and cheated on her. Warren begins crying and apologises to Louise, telling her that he wants to start a family with her. Louise picks up the gun and tells him she could never bring his child into the world. However, Louise discovers the gun is empty and Warren reveals he has the bullets. Warren attacks Louise for trying to kill him. A struggle breaks out and Warren ends up killing Louise. The wedding party believe Louise left Warren due to his affair, unaware of her death. A heartbroken Warren watches as Mandy leaves the village with Tony. Calvin and his wife, Carmel (Gemma Merna) approach him in an attempt to comfort him. Carmel mentions that Louise was pregnant, leaving Warren devastated."]}, {"page": "Russ Owen", "response": ["Russ' family leaves the village following Sam's murder spree, but Russ stays and starts a public relationship with Mercedes. They become engaged and plan to share a wedding with Mercedes' sister, Tina McQueen (Leah Hackett), and her partner, Dom Reilly (John Pickard). Mercedes has sex with Warren Fox (Jamie Lomas) on her hen night, which is exposed by Louise Summers (Roxanne McKee) at the wedding. Mercedes convinces Russ to continue with the wedding, but they separate after their honeymoon. Russ and Carmel McQueen (Gemma Merna), Mercedes' sister, grow close, but decide not to date for Mercedes' sake. Tina begins getting sexually harassed by her boss, Pete Webster (Richard Cambridge), and Russ prevents Pete from raping Tina. Later, they have sex, which they agree to conceal. Tina later discovers that she is pregnant and decides to give the child to Jacqui McQueen (Claire Cooper) and her partner, Tony Hutchinson (Nick Pickard). Tina later realises that it is Russ' child, but does not tell him; she gives birth to a son, Max McQueen (Brayden Haynes-Mawdsley). Russ meets Caroline Cooper (Kari Corbett) and as they prepare to leave the village together, Tina reveals that Russ is Max's father. Russ stays in the village and he and Tina start dating, but they quickly end their relationship. Tina is later killed in an explosion caused by Niall Rafferty (Barry Sloane), but Jacqui decides to raise him, refusing Russ access."]}, {"page": "Kris Fisher", "response": ["Another storyline the character was involved in a carbon monoxide poisoning plot. Danny Valentine (David Judge) had made a faulty repair to a boiler, causing a carbon monoxide leak that left Kris, John Paul McQueen (James Sutton), Katy Fox (Hannah Tointon), Summer (Summer Strallen), Zak Ramsey (Kent Riley), Carmel McQueen (Gemma Merna), Russ Owen (Stuart Manning), and other students unconscious. Justin Burton (Chris Fountain) later arrived to try and win Katy back and instead found everyone unconscious. After ringing Danny and finding that the boiler faulty, the pair carried everyone out saving them in the process. The storyline which had touched a very common issue in everyday life, helped save the life of regular Hollyoaks viewer Beth Cordingly, who was watching the episode when she was experiencing the same ordeal."]}, {"page": "Ste Hay", "response": ["Months later, Ste returns and seeks Amy's help. After convincing her he has changed, Amy gives Ste a second chance. Amy's father Mike attacks Ste, but is told by Amy that Ste is her daughter Leah's father. Ste and Amy become a couple again and move into a flat of their own. Mike contacts Ste's stepfather Terry, who arrives and beats up Ste. Amy then throws Mike out. To help with their money worries, Ste steals Warren Fox's (Jamie Lomas) credit card. With this, he buys expensive belongings for the flat. When Warren finds out, he takes the belongings and threatens Ste, who later breaks into Warren's business, Evissa and sets a fire, which almost kills Warren's fiancée Louise Summers (Roxanne McKee). After this, Warren beats up Ste. Ste then turns to dealing drugs for money with his friend Nige Foster (Sam Townsend) and influences Fletch to begin smoking marijuana. Amy lets Ste's mother Pauline see Leah, causing an angry Ste to end up hitting Amy. However, they reconcile. After Ste fails to find a job, Ste steals Carmel McQueen's (Gemma Merna) handbag, but is stopped. To defend himself, Ste lies that Leah has been diagnosed with leukaemia. Amy is angry, but also lies after they receive money. Ste and Amy's relationship turns violent, with his lashing out on several occasions. The lie about Leah's health is revealed and Amy has no other option but to stay with Ste. Amy discovers she is pregnant, so Ste agrees that he will change. Despite his promise, Ste steals a karaoke machine, which causes Amy to walk out and tell Mike of her abuse, after which he beats Ste up. A drunken Ste climbs onto scaffolding and threatens to commit suicide. Kieron Hobbs (Jake Hendriks) tries to talk him down as Amy, Sarah Barnes (Loui Batley) and Mike leave, believing Ste is attention-seeking. As they turn away, Ste falls and breaks his leg. After this, Ste and Justin Burton (Chris Fountain) become friends and move in together. For the sake of his unborn child, Ste gets a job in Il Gnosh restaurant and begins taking anger management classes."]}, {"page": "Sasha Valentine", "response": ["Fletch takes up drugs and offers Josh and Sasha them, but they refuse. Later that night, Valerie takes Sasha out clubbing. This results in Valerie and Katy Fox (Hannah Tointon) having a fight and Sasha and Valerie being thrown out. They are then arrested by Calvin and spend night in the cells. After overhearing an argument between Valerie and Leo in which he calls her boring she leaves to find Fletch who gives her some cannabis, which she smokes. During Niall Rafferty's (Barry Sloane) party, Sasha and Fletch took some Speed. Sasha hallucinates and sees her father angry at her for taking speed. Sasha complains that her heart is beating extremely fast and won't stop, she also complains her jaw and stomach was hurting. Sasha was then sick before Lauren found her. On 11 February, Sasha and Calvin have an argument after he catches her smoking weed with Fletch, and Sasha started mocking him and Carmel McQueen (Gemma Merna). Calvin pushes Sasha causing her to bang her head on the wooden staircase. Sasha moves out of the Valentine's and into Amy and Ste's. Sasha and Fletch decided to take heroin. But the morning after they take the heroin Sasha and Fletch suffer a massive comedown in Amy and Ste's bathroom. Ste finds out and chucks Sasha and Fletch out the flat for taking the heroin. After this Sasha moves back in with the rest of the Valentine's. Sasha is caught in bed with Fletch by her father so -later buys heroin from a drug dealer named Nige. Sasha and Fletch suffer a painful comedown in Sasha's bedroom . She is sick and suffers from nausea and paranoia."]}, {"page": "Calvin Valentine", "response": ["Calvin Valentine is a fictional character from the British Channel 4 soap opera, Hollyoaks, played by Ricky Whittle. He arrived in July 2006 as a police officer with his mother Diane Valentine, his brother Sonny Valentine and his sister Sasha Valentine and made his final appearance on 21 May 2010 after he was murdered by Theresa McQueen (Jorgie Porter). Whittle was credited for a flashback episode on 1 December 2010. Calvin appeared again as a ghost to tell his wife and Theresa's Cousin Carmel McQueen (Gemma Merna) that his and Theresa's daughter, Kathleen-Angel McQueen, was fine with Theresa in February 2011.", "The apparent love of Calvin's life was originally Louise Summers (Roxanne McKee). However, their engagement ended when he discovered her affair with his enemy Warren Fox. The second main love for Calvin was Carmel McQueen (Gemma Merna). The characters quickly fell in love, became engaged and eventually married. In May 2008, series producer Bryan Kirkwood, speaking to Digital Spy about the couple's upcoming wedding, said: \"They're a fantastic couple to come up with stories for. They're engaged at the moment and it's nice to see the lighter side of Calvin. We'll have fun watching Carmel planning the wedding of the millennium and it'll continue to serve the fun war between the Valentines and McQueens.\"", "In 2007, Calvin and Louise Summers (Roxanne McKee) begin a relationship. After a heated dispute and eventual separation, Louise has sex with Warren Fox (Jamie Lomas). Louise and Calvin resume their romance, however, upon their reconciliation, she announces her pregnancy. Perceptive in knowing the baby could be Warren's, Clare Cunningham (Gemma Bissix) convinces Louise to have an abortion and tell Calvin she suffered a miscarriage. After Calvin uncovers Louise's betrayal, he dumps her. Calvin becomes a suspect with Warren, Louise, Sam \"O.B.\" O'Brien (Darren Jeffries) and Max Cunningham (Matt Littler) for the attempted murder of Clare after his mobile phone is found at the scene of the crime. He is questioned but later released. In September 2007, Calvin unearths that he has two half-siblings, Danny and Lauren, who are the children of Leo and Valerie, the woman whom he had an affair with for years. Calvin and Carmel McQueen (Gemma Merna) become romantically linked and announce their engagement, soon after, despite having temporary separations. Calvin catches Nige Foster (Sam Townend) dealing drugs and, knowing he sells them to Sasha, takes the drugs and tells him to leave. However, Calvin's colleague, Eddie find the drugs and believes Calvin has an addiction. With Warren, Calvin accidentally kills Nige and is guilt-ridden. Carmel and Calvin marry, however before, Calvin goes to The Loft during a drugs raid and removes Warren's drugs for him. Meanwhile, Carmel is waiting to be wed. Calvin arrives late and apologises before getting married. After the honeymoon, Calvin decides he needs to reflect over his guilt of killing Nige and Carmel is angered upon his disappearance.", "Ricky Whittle was nominated for 'Sexiest Male' in the 2007, 2008 and 2009 British Soap Awards Whittle was also nominated for 'Sexiest Male' at the Inside Soap Awards in 2007, 2008 and 2009. Also in 2008, he and Gemma Merna (Carmel) were nominated for 'Best Couple'. In 2010, Calvin and Carmel's wedding was nominated for 'Best Wedding', losing to Syed Masood and Amira Shah of EastEnders. The character was selected as one of the \"top 100 British soap characters\" by industry experts for a poll to be run by What's on TV, with readers able to vote for their favourite character to discover \"Who is Soap's greatest Legend?\""]}, {"page": "Cindy Cunningham", "response": ["When Mandy returned to Hollyoaks as manager of Cinergy, Mandy and Texas planned to scam Cindy out of her money, by getting her to buy fake expensive paintings. They also got Cindy to buy a snake, which is later revealed as poisonous and when the snake escapes the girls panic. Cindy finds out that Mandy and Texas were continuing to con her out of her money and at first she is furious with Mandy and threatens to call the police, but later makes up with her. A priest named Father Francis (Richard Winsor) arrives in Hollyoaks and catches the affections of Cindy and Carmel Valentine (Gemma Merna) who also works in Cinergy. Cindy donates a large sum of money to Father Francis's charity, but it is later revealed that Father Francis is a con artist posing as a priest in order to steal Cindy's money."]}, {"page": "Lee Hunter (Hollyoaks)", "response": ["Lee finds a poster asking for directors to put on a production. He cunningly removes the poster and successfully applies for the position. He writes a script for a play named 'MasKara' and casts Jem Costello (Helen Russell-Clark) and Jamil Fadel (Sikander Malik) in the lead roles. Lee also casts Texas Longford (Bianca Hendrickse-Spendlove) Lee tries to hang some decorations for the production and falls off the ladder, hurting his neck. Due to Lee's absence, Steph takes over the production, making drastic changes and hiring Carmel Valentine (Gemma Merna) as the makeup artist. Lee is keen to see what Steph has changed in the production, but is horrified when he sees the costumes and props. He storms off, but then returns to give the production another go; however begins another argument and eventually upsets Steph after cruelly mentioning her cancer. Due to Lee's actions, Jem quits and Lee decides to re-cast the leading part to Amy. On the day of the production, he is forced by the cast members to apologise to Steph and does so. Things however are not sorted, as Darren fails to remember his lines and quits last minute. Lee, with no other options, casts himself as the part that Darren was scheduled to play. The production receives positive feedback from the cheering audience, however Nancy Hayton (Jessica Fox) writes a review which harshly criticises Lee's dictating directing skills."]}, {"page": "Jacqui McQueen", "response": ["Jacqui arrives home on a tag after being released from prison and hoards money for gangster, Davey, but her half-sister Carmel McQueen (Gemma Merna) steals the money to buy breast implants. Mercedes McQueen (Jennifer Metcalfe) finds the money to repay Davey but there is still not enough so Jacqui promises to do him a favour one day."]}, {"page": "Niall Rafferty", "response": ["Niall arrives as a new hairdresser at beauty salon, Evissa. He helps Evissa owner Louise Summers (Roxanne McKee) and attacks her fiancé Warren Fox (Jamie Lomas), who assumes Niall is mugging her. Niall befriends co-worker Carmel McQueen (Gemma Merna) and her family. Jacqui McQueen (Claire Cooper) is suspicious of Niall, who claims to have two sisters. Niall soon becomes friends with Myra McQueen (Nicole Barber-Lane), who is unaware of his identity, and is invited for Christmas. Overwhelmed, Niall steals a picture from the McQueens and burns it. Niall attempts to become closer to his mother and begins encouraging her to be stricter with her youngest daughter, Michaela McQueen (Hollie-Jay Bowes). Niall gets Michaela drunk at a party and injects her with heroin, which causes her to overdose and makes the McQueens believe she is addicted. Niall continues his revenge on the McQueens by ruining their lives in small ways; reporting Myra for benefit fraud, pushing Carmel and boyfriend Calvin Valentine (Ricky Whittle) apart and attacking his grandmother, Nana McQueen (Diane Langton)."]}, {"page": "Children in Need 2006", "response": ["* Chris Fountain, Andrew Moss, Gemma Merna and Carley Stenson from Hollyoaks performed \"Unbelievable\" by EMF in London whilst Gerard McCarthy, also from Hollyoaks, duetted with Sheila Ferguson live from Belfast."]}, {"page": "Big Brother: Celebrity Hijack", "response": ["| Gemma Merna"]}, {"page": "Hole in the Wall (British game show)", "response": ["| Graham ColeGemma Merna"]}, {"page": "Theresa McQueen", "response": ["It was announced in April 2014, four months after her exit scenes aired, that Porter would be returning to the serial as Theresa, with her return scenes airing on 25 August 2014. Theresa's storylines since her return have included: a breakout from prison; giving birth to her second child, this time with Dodger and her subsequent on-off relationship with him; a feud with Sonny Valentine (Aaron Fontaine); being involved in a train crash which saw Calvin's wife and her cousin, Carmel (Gemma Merna) save Theresa and die; being kidnapped by Will; agreeing to donate a kidney to Nico Blake (Persephone Swales-Dawson); a relationship with Patrick Blake (Jeremy Sheffield) which saw her care for him as he suffered from motor neurone disease; and being targeted by Nico as she plotted to kill her for her other kidney. In 2016, Porter left the soap again in order to pursue a career in Hollywood. She agreed to reprise the role in 2020 for the programme's 25th anniversary on a short term basis. It was announced Theresa would not leave the soap at the end of year like originally planned and will stick with the soap indefinitely.", "In December 2009, Hollyoaks broadcast the first ever flashforward episode. The episode, set in May 2010, featured the wedding of Calvin and Carmel Valentine (Gemma Merna), as well as the murder of Calvin. This started a six-month-long 'whodunnit'. During May 2010, Theresa was revealed as the killer. When asked what her reaction to the news that she was the murderer, Porter said: \"I was a bit gutted because I thought I'd be gone, because everyone gets puts away for life if they kill someone. I believe one day she should get her comeuppance and I think she does.\" In an interview with Digital Spy, Porter was asked what happened in the aftermath, saying: \"It's the whole guilt trip really. It was never planned because Theresa's not that type of person. She's not a murderer — she's a 17-year-old girl with little girl tendencies. She wants to talk about boys and clothes and make-up, then this comes along and totally changes her.\" She also explained Theresa's motive: \"Well, she'd recently had a night of naughtiness with Calvin, and as a result she fell pregnant. She was really stressed out about it and he's getting married so she thinks, 'If I go and tell him maybe he won't get married to her and maybe he'll want to bring up the baby with [me]'. I think she thought he would be with her.\" Porter admitted that she thinks it allows viewers to see a \"completely different side to her character,\" but also believes Theresa is probably \"a little too young.\" She also admitted her view on Theresa's personality after Calvin's murder: \"You see her become really vulnerable. You saw her vulnerable when her mum left but this is a total helplessness, she just doesn't know what to do.\"", "On 13 October 2013, it was announced that Porter had chosen to leave her role as Theresa after five years and would be filming her final scenes in late 2013. It was revealed, two months later, that Porter would be leaving to compete in the final series of Dancing On Ice, having previously appeared in the show in 2012. Theresa's exit storyline would see her face consequences for Calvin's murder that occurred four years previously, to which the show's executive producer, Bryan Kirkwood said: \"Theresa has got away with murder for many years, so it is time for her to face the consequences.\" Entertainment website, Digital Spy reported that Porter was expected to return after a break, with the door left open. Speaking of her decision to leave, Porter said: \"I've loved playing Theresa and of course being a McQueen. I've been so lucky to have been given some amazing storylines over the last five years. I start to feel a little emotional when I think about leaving but the time is right for me to move on. I've still got a while to go yet so there'll be plenty more mischief from Theresa over the next few months.\" Meanwhile, Kirkwood described Porter as \" a real talent, beautiful, sexy and a delightful presence on and off screen.\" Porter had since stated she had backed her exit, while co-star, Gemma Merna (Carmel Valentine) expressed her sadness over Porter's decision to leave as well as stating she hoped that Porter would return soon.", "Theresa is first mentioned by Myra McQueen (Nicole Barber-Lane) and Nana McQueen one month before her introduction. During her arrival, Theresa is attracted to Tony Hutchinson (Nick Pickard) while in The Loft, whom she meets during an educational-themed night. Sexual tension mounts between the pair and ultimately spend the night together, with Tony unaware that she is only fifteen. Theresa falls in love with Tony, who realises her deception, and destroys any chances of a future with him. A dejected Theresa turns to her family, the McQueens. Jacqui McQueen (Claire Cooper), who is still infuriated with Tony for his fling with her sister Mercedes McQueen (Jennifer Metcalfe), is angered with Tony for his night with Theresa. She immediately calls the police, who charge him. Theresa then moves in with the McQueens, sharing a room with cousin Michaela McQueen (Hollie-Jay Bowes), whom she previously had turned to for advice. Jacqui is not pleased at Theresa moving in but soon warms. Theresa then tells the police she was deceptive about spending the night with Tony, who is released. Theresa finds an unlikely friendship in Anita Roy (Saira Choudhry) and auditions for the part of The Virgin Mary in a nativity play produced by older cousin Carmel Valentine (Gemma Merna) and Cindy Cunningham (Stephanie Waring). However, she is heckled off the stage by some teenagers, who clearly know she is not a virgin. On Christmas Day, Anita finds a DVD containing CCTV footage of Warren Fox (Jamie Lomas) sleeping with Mandy Richardson (Sarah Jayne Dunn) and gives it to the McQueens, who set off to ruin Warren's wedding to Louise Summers (Roxanne McKee). Theresa begins battling against Lauren Valentine (Dominique Jackson) for friendship with Anita. When Lauren makes a comment about the McQueens, Theresa reminds her that Carmel is married to Lauren's brother Calvin. Theresa follows her family by using a fake pregnancy bump to shoplift. Having a proper relationship with Ste Hay (Kieron Richardson), Theresa is dumped by him, who wants to focus on son Lucas Hay (Jude)."]}, {"page": "List of Hollyoaks characters (2007)", "response": ["Father Raymond is the Catholic Priest that first appeared to console Myra McQueen (Nicole Barber-Lane) over the anguish she felt about her gay son John Paul McQueen (James Sutton). He also helped prepare for the double wedding of Russ Owen (Stuart Manning) and Mercedes McQueen (Jennifer Metcalfe) and Dominic Reilly (John Pickard) and Tina McQueen (Leah Hackett), he also took confession from Mercedes about her affair with Warren Fox (Jamie Lomas). He is a priest at St. Paul's Catholic Church. Father Raymond reappears when Kieron Hobbs (Jake Hendriks) chose to leave his position in the church and told him that he must do what is right for him. Father Raymond then took over again from Kieron and started working at a new Catholic Church, St. Timothy's, it was here that he performed the wedding of Carmel McQueen (Gemma Merna) and Calvin Valentine (Ricky Whittle). Father Raymond then returned to perform Tina's funeral service. He is due to reappear again for the funeral of Warren. Father Raymond is Irish and appears to be mostly bemused by the McQueens antics.", "Nana is first seen in July 2007 when flirting with Russ Owen (Stuart Manning) in The Dog in the Pond. She enters the McQueen household to find her granddaughters fighting. When the rest of the McQueens get back, she sees Russ and claims he was chatting her up at The Dog. Nana reappears in October 2007 when her grandchildren Carmel McQueen (Gemma Merna) and John Paul McQueen (James Sutton) nearly die from carbon monoxide poisoning. She stirs up trouble by lying to her granddaughter Mercedes McQueen (Jennifer Metcalfe) that she has seen Carmel and Russ kissing at the hospital. Nana's daughter, Myra McQueen (Nicole Barber-Lane), tries to get along with her, but after she realises Nana has tried to steal the compensation money the family have received for Carmel and John Paul, Myra throws Nana out. Nana reminds Myra that she is her mother, but Myra exclaims that she stopped being her mother at the age of 14. Nana vows to return before leaving. Nana returns for the family's Christmas and Boxing Day celebrations. Neither she nor the rest of the family realise their guest, Niall Rafferty (Barry Sloane), is the son Nana forced Myra to give up at birth. During the dinner, Nana toasts her granddaughter Tina McQueen (Leah Hackett) for being a surrogate mother for her half-sister Jacqui McQueen (Claire Cooper) and her boyfriend Tony Hutchinson (Nick Pickard). Myra gets upset and leaves the table. Nana finds her in the bathroom, weeping over old newspaper clippings of the child she had given up at birth. Myra tells Nana she could never forgive her, or herself. Nana tells her to stop complaining and that she was right to give up the child. Myra slaps Nana for her comment, but Nana slaps Myra right back, leaving as she refused to be treated in such a manner.", "On 20 November 2008, several months after the murder, the viewers discovered Warren was paying Nige to stay out of sight to continue the illusion Calvin has killed him. Calvin eventually confessed to Sasha that he murdered Nige, and racked with guilt posted his and Carmel McQueen's (Gemma Merna) life savings through the letterbox of Nige's parents' house. On 21 January 2009, Nige showed up at The Loft wanting even more money from Warren and in the process nearly exposed himself to Calvin. Warren snuck Nige outside and said that if he ever saw him again he would kill him. On 27 February, Calvin discovered Nige dealing in a carpark. Nige fled and this was his last appearance."]}, {"page": "List of Hollyoaks characters (2008)", "response": ["After Tina discovers she is pregnant, she agrees to let her sister Jacqui McQueen (Claire Cooper) and her partner, Tony Hutchinson (Nick Pickard), adopt her child. At her 12-week scan, Tina discovers that she is 15 weeks pregnant, meaning that Russ is the child's father. Tina tells Jacqui, who convinces Tina to stay quiet. Tina's brother, Niall Rafferty (Barry Sloane), pushes her down the stairs, causing her to give birth in a caesarean section. After learning she cannot have any more children, Tina decides to raise Max as she could not bare to give him away, creating strain between Tina and Jacqui. As Russ prepares to leave the village, Tina reveals that he is Max's father and convinces him to stay to be Max’s father. A month later, Niall kills Tina in an explosion leaving Max without a mum, so Jacqui begins raising Max, promising Russ access. She later restricts Russ access to his son, so he plans to run away with Max. As Tina's sister, Carmel McQueen (Gemma Merna) babysits Max, Russ visits him and kidnaps him. Carmel sees this, but lets them go. Max leaves the village with Russ and Justin Burton (Chris Fountain). Jacqui is devastated when she discovers Max and his passport missing."]}, {"page": "Anita Roy", "response": ["Anita ruins Ravi's date with a woman who she believes is called Kate, by accidentally spilling a drink on her. Later Ravi finds Anita has been stealing money from the till when asked about her recent change in behaviour. Anita reveals she's still upset with the knowledge that her real mother gave her up for adoption. Unbeknownst to her, Kate's real name is Eva Strong (Sheree Murphy) and is Anita's real mother. Anita starts to find her birth mother, with Jem Costello's (Helen Russell-Clark) help. Anita and Jem visit Anita's mother's workplace at a stall in Manchester. Anita is then hurt when she realises that Kate is actually Eva. Anita is horrified and devastated to learn this and furthermore thinking that Eva doesn't want her for the second time, and walks away in tears. However, Eva returns and begs her to give her another chance. Anita does so, but discovers that she was a result of Eva's holiday fling with her Indian father. She is deeply upset when Eva doesn't let the conversation  go any further and instead, goes for fashion advice from Jem. Anita calls her mother a slapper and when Theresa comes for comfort after deciding not to have an abortion, Eva feels uncomfortable and leaves. Anita reconciles with Lauren and Lauren accepts to go to Paris with her to visit Leila but Gaz is furious about this and gives Lauren an ultimatum to either choose between him or Anita. She decides to choose Anita and consequently her and Gaz split. Anita then later finds a gun in Evissa after she is attacked by Gaz and came to Carmel Valentine (Gemma Merna) for help. She tells Theresa, not knowing that she used the gun before to kill Carmel's husband Calvin Valentine (Ricky Whittle). Theresa then tries to ignore the situation and tries to convince Anita that she must have imagined it. Anita walks off in a strop and insists that someone will believe her, but is wrong when the gun is replaced by Theresa's cousin Jacqui McQueen (Claire Cooper). Anita is later held hostage by Gaz in the woods after he successfully lures her by texting through Theresa's mobile phone. During the hostage, Gaz finds the gun in his bag and is arrested by the police who arrives at the same time he found the gun."]}, {"page": "Gaz Bennett", "response": ["Gaz first appears as a student at Hollyoaks High School, and he begins work experience at take-away Relish. His work experience turns out bad as he turns up late, does no work and is racist towards Anita, Lauren, Calvin and Ash, which ends up with him being sacked by Ash. At school, local Police Community Support Officer Carmel McQueen (Gemma Merna) opens a police stall. Gaz and his gang turn up a heater, causing Carmel to sweat and take her jacket off. They then give her a lollipop, which she begins to eat, before taking a picture on a mobile phone of her. This phone is then confiscated by Russ Owen (Stuart Manning). The gang later spray-paint a picture of Carmel on the skate ramps, but are interrupted by Calvin, who Gaz is then racist towards. Gaz and his gang steal Relish's week's takings from Gilly Roach (Anthony Quinlan), also beating him up. Zak attacks Gaz, who is scared without his gang. Gilly refuses to acknowledge that it was Gaz who stole the takings. Feeling embarrassed, Gilly tells Ash and Calvin that the man who mugged him was 'huge'. Zak confronts Gaz, but loses his temper and punches him. Zak is cautioned by the police. Gaz and his gang then beat up Gilly, who does not file a complaint. Gaz starts harassing Theresa McQueen (Jorgie Porter), and is warned off by Russ, Jacqui McQueen (Claire Cooper) and Tony Hutchinson (Nick Pickard)."]}]}}