{"wiki_id": "http://www.wikidata.org/entity/Q1507526", "itemLabel": "George Hardwick", "itemDescription": "English association football player and manager (1920-2004)", "wikipedia_url": "https://en.wikipedia.org/wiki/George_Hardwick", "wikipedia_page": {"main": "George Francis Moutry Hardwick (2 February 1920 – 19 April 2004) was an English footballer, manager and coach. During his time as an active player, he was a left-sided defender for Middlesbrough. He was also a member of the England national football team, playing in 13 international matches and serving as the team's first post-World War II captain in all 13 of those matches. The only England player to be captain in every game.\nIn 1947, the nations of Great Britain joined to form a football team, which Hardwick captained and led to victory (6–1) against the rest of Europe.\n\nOwing to a knee injury Hardwick had to terminate his international career after 12 matches. He is held in high esteem by Middlesbrough fans, and is regarded as the greatest defender in the club's history.\nAfter his career as a player, Hardwick served as player manager for Oldham Athletic and manager for PSV Eindhoven, and for six months in 1957, the Netherlands national football team. He later managed Sunderland A.F.C. and Gateshead.\nToday his legacy lives on in the form of The George Hardwick Foundation, a charity dedicated to helping carers, former carers and patients. The Patron is his wife Jennifer, who cared for George during his latter years. They have three main sites at Stockton, Middlesbrough and The University Hospital of North Tees.", "link_mentions": [{"page": "February 2", "response": ["*1920 – George Hardwick, English footballer and coach (d. 2004)"]}, {"page": "Stanley Matthews", "response": ["Stoke City arranged a testimonial match in honour of Matthews; it was much needed as he had spent most of his career constricted to the tight maximum wage that had been enforced upon the English game and only abolished a few years before his retirement. The game was played at the Victoria Ground on 28 April 1965, by which time Matthews had decided to retire as a player, and the pre-match entertainment consisted of another match of two veteran teams featuring many legends of the game. Harry Johnston led out a team consisting of Bert Trautmann, Tim Ward, George Hardwick, Jimmy Hill, Neil Franklin, Don Revie, Stan Mortensen, Nat Lofthouse, Jimmy Hagan, Tom Finney and Frank Bowyer (reserve). Walley Barnes led out an opposing team consisting of Jimmy O'Neill, Jimmy Scoular, Danny Blanchflower, Jimmy Dickinson, Hughie Kelly, Bill McGarry, Jackie Mudie, Jackie Milburn, Jock Dodds, Ken Barnes, and Arthur Rowley (reserve)."]}, {"page": "Middlesbrough F.C.", "response": ["The decade before the war saw the emergence of Wilf Mannion and George Hardwick, both of whom would go on to become England internationals in the years ahead. Middlesbrough climbed to fourth in the last full season before World War II and were expected to challenge for the title next season, but the war intervened. After the war, the club was unable to recover the form of the previous seasons and hovered around mid-table and exited in the early rounds of the FA Cup. Soon afterwards, the team began to falter, eventually suffering relegation in 1953–54. This was the start of a 20-year spell outside the top division, but saw the emergence of one of the club's top goalscorers, Brian Clough, who scored 204 goals in 222 games, before he left for Sunderland. Over that period, Middlesbrough maintained reasonable progress in the Second Division but were never serious contenders for promotion. After a fourth-place finish in 1962–63, the club endured a steady decline and were relegated to the Third Division for the first time in their history in 1966.", "* George Hardwick", "* George Hardwick"]}, {"page": "Oldham Athletic A.F.C.", "response": ["thumb|250px|right|Chart of yearly table positions since Oldham joined the Football League.Following the return of competitive football there was to be no immediate success for Oldham Athletic. They finished 19th in the first league season after the war and manager Frank Womack resigned. In spite of reaching a more respectable 6th place under his successor Billy Wooton in 1949, it wasn't until the appointment of George Hardwick as player-manager in November 1950 that the club found any real form.", "In the history of the club, only three managers have won a league title: George Hardwick (Division 3 North, 1953), Jimmy Frizzell (Division 3, 1974) and Joe Royle (Division 2, 1991). Frizzell also won promotion from Division 4 in 1971 (3rd place), as did Jack Rowley from the runners-up spot in 1963."]}]}}