{"wiki_id": "http://www.wikidata.org/entity/Q1508299", "itemLabel": "George Stott", "itemDescription": "British missionary in China and amputee", "wikipedia_url": "https://en.wikipedia.org/wiki/George_Stott_(missionary)", "wikipedia_page": {"main": "George Stott (13 April 1835 – 21 April 1889) was a British Protestant Christian missionary to China with the China Inland Mission.\nDespite physical disabilities, Stott was a highly effective mission leader.  In China he has been credited, alongside William Edward Soothill, for laying the groundwork for the large number of Christian adherents in Wenzhou, Zhejiang Province. Although his wife, Grace Stott worked with him and led the mission for twenty years after his death.", "link_mentions": [{"page": "Our Mutual Friend", "response": ["In 1866 George Stott found the novel flawed: \"Mr. Dickens must stand or fall by the severest canons of literary criticism: it would be an insult to his acknowledged rank to apply a more lenient standard; and bad art is not the less bad art and a failure because associated, as it is in his case, with much that is excellent, and not a little that is even fascinating.\"", "However, in 1869 George Stott condemned Dickens for being overly sentimental: \"Mr Dickens's pathos we can only regard as a complete and absolute failure. It is unnatural and unlovely. He attempts to make a stilted phraseology, and weak and sickly sentimentality do duty for genuine emotion.\"Stott, George, \"Charles Dickens\", Contemporary Review January 1869, pp 203–25 quoted in    Still, in the manner of all the other mixed reviews, Stott states that \"we still hold him to be emphatically a man of genius.\"Stott, George, \"Charles Dickens\", Contemporary Review January 1869, pp 203–25 quoted in   "]}, {"page": "OMF International", "response": ["Hudson Taylor made the first decision to found the China Inland Mission at Brighton, England during his first furlough from China. Like his missionary forebear Karl Gützlaff and contemporary William Chalmers Burns, Taylor was convinced that Chinese clothing should be worn when engaged in missionary work in inland China. On 3 October 1865, Taylor sent John and Anne Stevenson and George Stott to China, where they arrived on February 6, 1866. Including the five missionaries previously sent to Ningbo -James Joseph Meadows, Jean Notman, Stephen Paul Barchet, and George and Anne Crombie, these eight were already in China when Taylor returned in 1866. On 26 May of that year, Taylor accompanied the largest group of missionaries that had ever sailed to China on the Lammermuir. There were 16 missionaries as well as Hudson, his wife, Maria and their 4 children that became known as the Lammermuir Party. This journey took 4 months."]}, {"page": "List of Protestant missionaries in China", "response": ["| George Stott"]}, {"page": "Belhelvie", "response": ["*George Stott (1835-1889), Christian missionary with the China Inland Mission"]}, {"page": "Stott (disambiguation)", "response": ["*George Stott (–1889), British missionary to China"]}, {"page": "George Stott", "response": ["George Stott is the name of:", "*George Stott (architect) (1876–1936), English architect", "*George Stott (footballer) (born 1906), English footballer", "*George Stott (missionary) (1835–1889), British missionary", "*George Stott (wrestler) (1888–1969), British wrestler", "*George Stott, Lord Stott (1909–1999), Scottish lawyer"]}, {"page": "Grace Stott", "response": ["Grace Stott born Grace Cigie (12 March 1845 – 24 January 1922) was a British Protestant missionary in China. She went to China after a marriage proposal arrived in the post. She worked in Wenchow where she created a school for girls. Her husband George Stott died in 1899. She then returned to China. The mission was struck by riots twice and a cholera epidemic. She became the head of the mission and finally left the mission in 1909 twenty years after he was sacked and his death. Her husband is credited with the mission's success.", "She was born in 1845 and brought up in Glasgow by her grandmother, who died. At sixteen she was an enthusiastic Christian with no home ties. She wanted to be a missionary in China after hearing Hudson Taylor speak in Glasgow. She was accepted to go until she fell ill. When the large Lammermuir Party sailed she was left behind on the dock. The opportunity passed her by and she was moved to establish a more domestic mission to the red light districts of Glasgow. She was busy with this when a letter arrived from a young Scot George Stott who she had met. He proposed marriage to her, by mail, and she accepted. George was unusual as he had been chosen as a China Inland Mission (i.e. non denominational) missionary despite having lost a leg. He had planned to take another woman to China as his wife, but her parents disapproved of her going to China."]}]}}