{"wiki_id": "http://www.wikidata.org/entity/Q1508584", "itemLabel": "George Whetstone", "itemDescription": "English dramatist", "wikipedia_url": "https://en.wikipedia.org/wiki/George_Whetstone", "wikipedia_page": {"main": "George Whetstone (1544? – 1587) was an English dramatist and author.\n\n", "link_mentions": [{"page": "1587", "response": ["* probable – George Whetstone, English writer (b. 1544)"]}, {"page": "1544", "response": ["** George Whetstone, English writer (d. 1587)"]}, {"page": "English Renaissance theatre", "response": ["*George Whetstone"]}, {"page": "Measure for Measure", "response": ["The other main source for the play is George Whetstone's 1578 lengthy two-part closet drama Promos and Cassandra, which itself is sourced from Cinthio. Whetstone adapted Cinthio's story by adding the comic elements and the bed and head tricks."]}, {"page": "1586 in literature", "response": ["*George Whetstone – English Myrror"]}, {"page": "1578 in literature", "response": ["*George Whetstone – Promos and Cassandra"]}, {"page": "1576 in literature", "response": ["*George Whetstone – The Rocke of Regard"]}, {"page": "George Gascoigne", "response": ["The eldest son of Sir John Gascoigne of Cardington, Bedfordshire, Gascoigne was educated at Trinity College, Cambridge, and on leaving the university is supposed to have joined the Middle Temple. He became a member of Gray's Inn in 1555. He has been identified without much show of evidence with a lawyer named Gastone who was in prison in 1548 under very discreditable circumstances. There is no doubt that his escapades were notorious, and that he was imprisoned for debt. George Whetstone says that Sir John Gascoigne disinherited his son on account of his follies, but by his own account he was obliged to sell his patrimony to pay the debts contracted at court. He was MP for Bedford in 1557–1558 and 1558–1559, but when he presented himself in 1572 for election at Midhurst he was refused on the charges of being \"a defamed person and noted for manslaughter\", \"a common Rymer and a deviser of slaunderous Pasquelles\", \"a notorious rufilanne\", and a constantly indebted atheist.", "Most of his works were published during the last years of his life after his return from the wars. He died 7 October 1577 at Walcot Hall, Barnack, near Stamford, where he was the guest of George Whetstone and was buried in the Whetstone family vault at St John the Baptist's Church, Barnack."]}, {"page": "Giovanni Battista Giraldi", "response": ["Among the prose works of Cinthio is the Hecatommithi or Gli Ecatommiti, a collection of tales told somewhat after the manner of Boccaccio, but still more closely resembling the novels of Cinthio's contemporary, Matteo Bandello. Something may be said in favour of their professed claim to represent a higher standard of morality. Originally published at Mondovì in 1565, they were frequently reprinted in Italy, while a French translation appeared in 1583 and one in Spanish, with 20 of the stories, in 1590. They have a peculiar interest to students of English literature, for providing the plots of Measure for Measure and Othello. That of the latter, which is to be found in the Hecatommithi, was almost certainly read by Shakespeare in the original Italian;Michael Neill, ed. Othello (Oxford University Press), 2006, p. 21–2. while that of the former is probably to be traced to George Whetstone's Promos and Cassandra (1578), an adaptation of Cinthio's story, and to his Heptamerone (1582), which contains a direct English translation. It has also been noted that the story of Othello and Un Capitano Moro resemble the earlier tale of The Tale of the Three Apples, a story from One Thousand and One Nights. To Cinthio also must be attributed the plot of Beaumont and Fletcher's Custom of the Country."]}, {"page": "Thomas Watson (poet)", "response": ["The following year Watson appears for the first time as an English poet in verses prefixed to George Whetstone's Heptameron, and in a far more important work, as the author of the Hekatompathia or Passionate Centurie of Love, dedicated to Edward de Vere, 17th Earl of Oxford, who had read the poems in manuscript and encouraged Watson to publish them. Also entitled Watson's Passion the work, published in 1584, contains over 100 poems in French and Italian sonnet styles, including a number of translations. The technical peculiarity of these interesting poems is that, although they appear and profess to be sonnets, they are written in triple sets of common six-line stanza, and therefore have eighteen lines each."]}, {"page": "1572 in poetry", "response": ["* George Whetstone joined an English regiment on active service in the Low Countries, where he met fellow English poets George Gascoigne and Thomas Churchyard."]}, {"page": "The pen is mightier than the sword", "response": ["In 1529, Antonio de Guevara, in Reloj de príncipes, compared a pen to a lance, books to arms, and a life of studying to a life of war.In Spanish: \"¡Cuánta diferencia vaya de mojar la péñola de la tinta a teñir la lanza en la sangre, y estar rodeados de libros o estar cargados de armas, de estudiar cómo cada uno ha de vivir o andar a saltear en la guerra para a su prójimo matar!\" Thomas North, in 1557, translated Reloj de príncipes into English as Diall of Princes. The analogy would appear in again in 1582, in George Whetstone's An Heptameron of Civil Discourses: \"The dashe of a Pen, is more greeuous than the counterbuse of a Launce.\""]}, {"page": "1576 in poetry", "response": ["* George Whetstone, The Rocke of Regard, mostly verse"]}, {"page": "1577 in poetry", "response": ["* October 7 – George Gascoigne (born c. 1535), English poet who died while a guest at George Whetstone's family manor of Walcot at Barnack, near Stamford, Lincolnshire; Whetstone commemorated his friend in a long elegy."]}, {"page": "1540s in England", "response": ["** George Whetstone, writer (died 1587)"]}, {"page": "1580s in England", "response": ["** September – George Whetstone, writer (duel) (born 1544)"]}, {"page": "1587 in poetry", "response": ["* George Whetstone, , in verse (see \"Deaths\" section)", "* date not known – George Whetstone died about this year (born c. 1544), English playwright, poet and author (see \"Works published\" section)"]}, {"page": "1551 in poetry", "response": ["* George Whetstone year uncertain (died 1587), English poet and author"]}, {"page": "1544 in poetry", "response": ["** George Whetstone born about this year (died c. 1587), English playwright, poet and author"]}, {"page": "Whetstone (surname)", "response": ["* George Whetstone (1544?–1587), English dramatist and author"]}, {"page": "George Whotstone", "response": ["#RedirectGeorge Whetstone"]}]}}