{"wiki_id": "http://www.wikidata.org/entity/Q15079700", "itemLabel": "Harvey Goodwin", "itemDescription": "British academic and Anglican bishop", "wikipedia_url": "https://en.wikipedia.org/wiki/Harvey_Goodwin", "wikipedia_page": {"main": "Harvey Goodwin (9 October 1818 – 25 November 1891) was a Cambridge academic and Anglican bishop, Bishop of Carlisle from 1869 until his death.", "link_mentions": [{"page": "Henry Yule", "response": ["Elizabeth died before Henry was eight and William moved to Edinburgh with his sons, where he attended the Royal High School. In 1833 he was sent to be coached by the Reverend Henry Hamilton at his rectory in the village of Wath near Ripon in North Yorkshire. When Hamilton moved to Cambridge in the following year Yule was transferred to the care of the Reverend James Challis, at Papworth Everard near Cambridge. The other resident pupils were John Neale and Harvey Goodwin. (Neale co-founded the Society of Saint Margaret, an order of women in the Church of England dedicated to nursing the sick, while Goodwin became Bishop of Carlisle.) Yule's stay at Papworth Everard ended in 1826 when Challis was appointed Plumian Professor of Astronomy and moved to the Observatory in Cambridge."]}, {"page": "Church House, Westminster", "response": ["The idea of a central meeting and administrative building for the Church of England had been raised twice in the mid 19th century and was finally acted upon in 1886 when Harvey Goodwin, Bishop of Carlisle, suggested in a letter to The Times that the Church should construct a \"Church House\" as a memorial of the Golden Jubilee of Queen Victoria. Accordingly, a charity called the Corporation of the Church House was founded by Royal Charter on 23 February 1888, with the aim of raising the necessary funds and executing the project."]}, {"page": "Hardwicke Rawnsley", "response": ["During the time the Lake District Defence Society was being formed, the Bishop of Carlisle, Harvey Goodwin, offered Rawnsley the post of vicar of St Kentigern's, Crosthwaite and rural dean of Keswick. Goodwin said, \"In my opinion the post which I offer you is as near Heaven as anything in this world can be\".Rawnsley (1923), p. 55 Rawnsley took up the appointment in July 1883.\"Preferments and Appointments\", Manchester Courier, 21 July 1883, p. 16"]}, {"page": "George Richmond (painter)", "response": ["On the death of his wife in 1881 he gave up regular work, but still painted occasionally and occupied himself with sculpture. He had previously, in 1862, designed and executed a recumbent statue in marble of Charles James Blomfield, bishop of London, for St. Paul's Cathedral, and in 1882 he executed the marble bust of Dr. Pusey, now in Pusey House, Oxford, and presented a bust of John Keble to Keble College. Among his later works in oil were portraits of Harvey Goodwin, bishop of Carlisle, Edward King, bishop of Lincoln, and Archibald Campbell Tait, archbishop of Canterbury. In 1887, on the occasion of Queen Victoria's jubilee, he painted a portrait of the third Marquis of Salisbury (the last work he executed), which was presented to the queen by the marquis's wife."]}, {"page": "John Pratt (Archdeacon of Calcutta)", "response": ["Pratt was the second son of Josiah Pratt and Elizabeth née Jowett. His exact date of birth is debated and it is thought that he was born in London as he was baptised on 30 June 1809 at St Mary Woolnoth. His early schooling was at Oakham School under the tutelage of Dr Doncaster. He then went to Caius College, Cambridge and was a student of William Hopkins. He graduated B.A., third wrangler (after Alexander Ellice and Joseph Bowstead) in the Mathematical Tripos 1833, was elected to a fellowship, and proceeded M.A. in 1836. For a while he stayed at Cambridge and gave private tuitions. One of his students was Harvey Goodwin, later Bishop of Carlisle. While at Cambridge he wrote a book called Mathematical Principles of Mechanical Philosophy (1836, second edition 1845) which described mathematical applications in gravitational physics."]}, {"page": "King's Ely", "response": ["| Goodwin(Go) || Red  || Harvey Goodwin,  Dean of Ely 1858–1869 || Day"]}, {"page": "Hulsean Lectures", "response": ["* 1855 — Harvey Goodwin, The Doctrines and Difficulties of the Christian Faith contemplated from the standing ground afforded by the Catholic doctrine of the being of our Lord Jesus Christ", "* 1856 — Harvey Goodwin, The Glory of the Only Begotten of the Father seen in the manhood of ChristMissing in Stephenson 1984, 292; cf. Hurst 1896, 33."]}, {"page": "Bishop of Carlisle", "response": ["| 60px Harvey Goodwin"]}, {"page": "Robert Leslie Ellis", "response": ["William Walton edited a posthumous collection of both published and unpublished writings, in The mathematical and other writings of R. L. Ellis (1863): this was prefaced by a biographical  memoir by Harvey Goodwin. Correspondence and notebooks of Ellis are amongst the Mayor Papers and Whewell Papers at Trinity College, Cambridge.Catalogue entries for Ellis, Robert Leslie (1817-1859) mathematician", "* The Mathematical and Other Writings of Robert Leslie Ellis Edited by William Walton. With a biographical memoir by the Very Reverend Harvey Goodwin. (London: Deighton, Bell & Co., Bell and Daldy, 1863.)"]}]}}