{"wiki_id": "http://www.wikidata.org/entity/Q1507549", "itemLabel": "George Francis Robert Henderson", "itemDescription": "Jersey historian", "wikipedia_url": "https://en.wikipedia.org/wiki/George_Francis_Robert_Henderson", "wikipedia_page": {"main": "Colonel George Francis Robert Henderson, CB (2 June 1854 – 5 March 1903) was a British soldier and military author.\n\n", "link_mentions": [{"page": "Morale", "response": ["Military history experts have not agreed on a precise definition of \"morale\". Clausewitz's comments on the subject have been described as \"deliberately vague\" by modern scholars. George Francis Robert Henderson, a widely read military author of the pre-World War I era, viewed morale as related to the instinct of self-preservation, the suppression of which he said was \"the moral fear of turning back\", in other words, that a willingness to fight was bolstered by a strong sense of duty. Henderson wrote:"]}, {"page": "George Henderson", "response": ["*George Francis Robert Henderson (1854–1903), British soldier and military author"]}, {"page": "Henderson (surname)", "response": ["**George Francis Robert Henderson (1854–1903), British soldier and military author"]}, {"page": "William Henderson (priest)", "response": ["He married Jane Melville Dalyell, daughter of John Dalyell. Their son was George Francis Robert Henderson. Henderson was a scholar who edited various liturgical works."]}, {"page": "G F R Henderson", "response": ["#REDIRECT George Francis Robert Henderson"]}, {"page": "Colonel G F R Henderson", "response": ["#REDIRECT George Francis Robert Henderson"]}, {"page": "Jay Luvaas", "response": ["Luvaas' The Civil War: A Soldier's View (1958) collected the writings of Colonel George Francis Robert Henderson, a British observer of the American Civil War.  Henderson's international reputation had been built on a biography of Stonewall Jackson; Luvaas' study combined Henderson's work as a military historian/biographer and a teacher of the art of war, recognizing that Henderson's fame rested on his career as a teacher and writer, not as a field officer. In the final chapter, as J. Orin Oliphant points out, Luvaas analyzed Henderson's contribution to military thinking and education.J. Orin Oliphant, Review. Pennsylvania History: A Journal of Mid-Atlantic Studies, Reviewed Work: The Civil War: A Soldier's View. A Collection of Civil War Writings by Colonel G. F. R. Henderson by Jay Luvaas, Vol. 25, No. 3 (July, 1958),  pp. 339-341."]}]}}