{"wiki_id": "http://www.wikidata.org/entity/Q15072603", "itemLabel": "John Robert Hollond", "itemDescription": "British politician", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Robert_Hollond", "wikipedia_page": {"main": "John Robert Hollond (2 November 1843 – 19 October 1912) was a British Liberal Party and Liberal Unionist politician and father of the army officer Spencer Edmund Hollond.\nHe was the second son of Rev. Edmund Hollond, of Benhall Lodge, Saxmundham, Suffolk by his first wife Isabella née Robinson and was educated at Harrow School.  He entered Trinity College, Cambridge in 1862 and was President of the Union in 1865. He received a bachelor's degree in 1865, receiving a second class in the Classical Tripos. He subsequently obtained a master's degree.He was then admitted at the Inner Temple on 12 November 1864 and called to the Bar on 10 June 1870. He never practised law, however. On 17 August 1870 he married Fanny Eliza Keats, and the couple had six children.\nBy 1879 Hollond was chairman of the Paddington Board of Guardians, although he was resident in the coastal resort of Brighton. In that year he was selected by the Liberal Party along with William Thackeray Marriott to contest the two seat parliamentary constituency of Brighton. At the general election in April 1880 the two Liberals topped the poll, unseating the sitting Conservative members of parliament. In 1884 Marriott resigned his seat to be re-elected as a Conservative, and at the general election of 1885 Hollond lost his seat to David Smith of the Conservative Party. Following a split in the Liberals over Irish Home Rule, Hollond became a Liberal Unionist, standing unsuccessfully at East Perthshire. By 1889 he was president of the Marylebone Liberal Unionist Association. He was a Deputy Lieutenant for London and Justice of the Peace for Devon, Somerset and Middlesex. During this time he lived at Stanmore Hall, Middlesex, and \"Wonham\", Bampton, Devon, inheriting the latter from his aunt Mrs Robert Hollond in 1884.\nHe died at his London residence, 41 Prince's Gate, Westminster, in October 1912 aged 68. He was buried at Stanmore.", "link_mentions": {}}}