{"wiki_id": "http://www.wikidata.org/entity/Q1500208", "itemLabel": "Richard Ford", "itemDescription": "English writer (1796-1858)", "wikipedia_url": "https://en.wikipedia.org/wiki/Richard_Ford_(English_writer)", "wikipedia_page": {"main": "Richard Ford (1796–1858) was an English travel writer known for his books on Spain. Born in Chelsea into a high-class family and educated in Oxford, he first moved to Spain in 1830, where he travelled extensively and collected notes and drawings. Upon return to England, he wrote an account of his journeys in A Handbook for Travellers in Spain, first published in 1845, described as one of masterpieces of the travel literature genre. An erudite art collector, he befriended many important art and literature figures of his time. Ford was a skilled drawer himself, and made illustrations for his own and his friends' books.", "link_mentions": [{"page": "Spanish cuisine", "response": ["For most of the 19th century, the aristocracy consumed a set of dishes that was largely an imitation of French cuisine. That was the available cuisine at the time, together with the degeneration of regional cuisines. A positive foreign take on the Spanish dishes opposing the largely negative views from foreign commentators was that of Richard Ford, fond of Spanish specialties such as Sherry and ham."]}, {"page": "Toro, Zamora", "response": ["English traveller Richard Ford (English writer) visited Toro in 1831 and reported a population of 9,000; it has just under 10,000 now.  In 1838 it lost its status as a provincial capital, its province being merged with Zamora."]}, {"page": "Chase This Light", "response": ["Musically, the sound of Chase This Light has been described as pop punk, pop rock and power pop, with influence from pop, moving away from the emo style of their earlier work. Adkins and Linton's guitar work earned comparisons to early 1980s rock acts, such as the Outfield and U2. In contrast to Futures darker sound, Chase This Light was more melodic and upbeat. The opening song \"Big Casino\" channeled \"When You Were Young\" by the Killers. Adkins referred to it as a \"loser anthem\" for people who burn-out and desire success. He got the title phrase from a short story by Richard Ford where two of the characters are talking and one of them says \"He's big casino.\"Jimmy Eat World 2020, event occurs at 0:49–1:01 The pop punk number \"Let It Happen\" is aided by additional vocals from Ross. Adkins wrote it as a \"feigning strength as a defense\"-type track. \"Always Be\" utilizes finger snaps and handclaps; its melody was compared to the Shins and Shout Out Louds. It discuses co-dependency, alongside exploited weaknesses."]}, {"page": "George Capel-Coningsby, 5th Earl of Essex", "response": ["He had an illegitimate daughter, Harriet (1808–1837), who married Richard Ford (d. 1858) of Heavitree, Devon. The Earl erected a mural monument to Harriet in the Essex Chapel of St Mary's Church, Watford."]}, {"page": "Richard Ford (East Grinstead MP)", "response": ["Sir Richard Ford (1758 – 3 May 1806) was an English politician who sat in the house of Commons from 1789 to 1791.", "After serving the Undersecretary of State in the home office, Richard Ford was for many years chief police magistrate of London, for which services he was knighted. Ford lived some years with actress Dorothea Jordan, who had three children by him, one of whom died. She left him when his promises of marriage were not fulfilled, as it was went against the wishes of Ford's father.The Volume of the Walpole Society, volume 60, \"The Ford Collection\", p. 380. Ford later married Benjamin Booth's daughter and heiress. His eldest son from this marriage was also named Richard Ford known for his travel writings about Spain and art collection.Richard Ford DNB"]}, {"page": "Richard Ford (disambiguation)", "response": ["Richard Ford (born 1944) is an American novelist and short story writer.", "Richard Ford may also refer to:", "* Sir Richard Ford (Southampton MP) (c. 1614–1678), English merchant and politician, MP for Southampton 1661–1678", "* Richard Ford (ironmaster) at Coalbrookdale in the 18th century", "* Richard Ford (East Grinstead MP) (1758–1806), English politician, MP for East Grinstead 1789–1790, Appleby 1790–1791", "* Richard Ford (English writer) (1796–1858), English writer", "* Sir Richard Ford (Royal Marines officer) (1878–1949), British Royal Marines general", "* Richard Ford (music editor), British music editor and music producer"]}, {"page": "Portrait of Mariana of Austria", "response": ["Later in life, Velázquez became preoccupied with courtly duties, and tended to paint a bust-length portrait of his sitter from life, leaving the completion of the final work to assistants.\"Infanta Maria Theresa\". Museum of Fine Arts, Boston. Retrieved 13 October 2019 Several contemporary full-length copies are known; one in the Kunsthistorisches Museum, Vienna, a second was sent to Archduke Leopold William in 1653, but is now lost. The third was in the Prado until it was acquired by the Louvre in a 1941 exchange. A half-length version attributed to members of his workshop is in the Metropolitan Museum of Art. The version cataloged in the collection of Richard Ford by the German art historian Gustav Friedrich Waagen in his 1854 \"Art Treasures in Great Britain\", and misidentified by Harry Wehle in 1940 as the Met picture, is today attributed to followers of Velázquez, and in the Ringling Museum of Art, Sarasota, Florida.\"Mariana of Austria, Queen of Spain\". Ringling Museum of Art. Retrieved 22 February 2019"]}, {"page": "Spanish cloak", "response": ["Much later the cloak was banned by one of the ministers of Carlos III, triggering the start of the Esquilache riots in the eighteenth century. Richard Ford, in 1845, wrote that the cloak \"favours habits of inactivity, prevents the over-zealous arms or elbows from doing anything, conceals a knife and rags, and, when muffled around, offers a disguise for intrigues and robbery\", and that this is why it was banned."]}, {"page": "Richard Ford (writer)", "response": ["#REDIRECT Richard Ford (English writer)"]}, {"page": "Elizabeth Murray (painter)", "response": ["English painters painted the geography of other regions and ancient cities, usually medieval. Many English painters who were on their way to other parts of Europe, such as Switzerland or Italy, settled in France. Although Murray didn't settle in France, she did travel through the country when travelling to and from Italy. However, Murray practiced painting landscapes primarily when she stayed in Morocco and the Canary Islands. During her time in Spain she felt especially attracted to Seville, as did Richard Ford, a traveller and Hispanist who wrote about his travels in Spain and possibly gave Murray the idea to write about her trips. Murray was part of a group of travellers who, like herself, described Spain as a country with a lot of fervour and vitality, even as it was impacted by apathy and backwardness. These travellers and their romantic spirit helped to develop a romantic image of Spain."]}, {"page": "Marie Guy-Stéphan", "response": ["Richard Ford, travel writer, arrived in Spain in 1830 and wrote about the rivalry between Guy-Stéphan and Maria Brambilla, specialist in Donizetti and first dancer of La Scala."]}, {"page": "Cecilia Betham", "response": ["Cecilia Betham was born in Tunbridge Wells, Kent in January 1843. She was the only daughter and second child of archivist, Molyneux Cecil John Betham (1813–1880), and Elizabeth Betham (née Ford). Her maternal grandparents were Sir Richard Ford, chief magistrate (1800–1806) and an amateur painter, Marianne (née Booth). Her uncle was writer Richard Ford. The family lived in London when Betham was a young child, living in 123 Park Street, Grosvenor Square by 1846, and Clarges Street by 1851, where she was educated at home. In 1829, Molyneux Betham was appointed Cork herald of arms, and in 1834 the deputy Ulster king of arms. The family returned to Ireland following the death of Betham's paternal grandfather, William Betham, on 26 October 1853."]}, {"page": "James Ford (translator)", "response": ["He was the son of Sir Richard Ford, police magistrate in London and Member of Parliament, and his wife Marianne Booth, an artist and daughter of Benjamin Booth; Richard Ford (1796–1858) was his elder brother. He was educated at Rugby School, and matriculated at Oriel College, Oxford in 1814, graduating B.A. in 1818, and M.A. in 1821."]}]}}