{"wiki_id": "http://www.wikidata.org/entity/Q15070074", "itemLabel": "Paul Wilmshurst", "itemDescription": "English TV Director", "wikipedia_url": "https://en.wikipedia.org/wiki/Paul_Wilmshurst", "wikipedia_page": {"main": "Paul Wilmshurst is a British television director. He has worked on five seasons of the Sky/Cinemax action-adventure series Strike Back and directed on the first series of David S. Goyer's historical fantasy series Da Vinci's Demons for StarZ and BBC America. He has received an International Emmy Award and two BAFTA nominations.\n\n", "link_mentions": [{"page": "Luke Rhinehart", "response": ["UK Channel 4's broadcast of Diceworld (1999, Paul Wilmshurst directing), a 50-minute television documentary about Cockcroft/Rhinehart and some of the people influenced by his novels, led to a resurgence of interest in Cockcroft/Rhinehart's books, and in various related \"dicing projects\". A further documentary was produced in 2004, a collaboration between Cockcroft/Rhinehart and director Nick Mead, entitled Dice Life: The Random Mind of Luke Rhinehart."]}, {"page": "List of film and television directors", "response": ["*Paul Wilmshurst"]}, {"page": "Frank Skinner", "response": ["Skinner was born on 28 January 1957 in West Bromwich, Staffordshire, England, and grew up in a council house in neighbouring Oldbury.Frank Skinner om Frank Skinner, 2001 ITV Documentary. Produced and directed by Paul Wilmshurst. He was the youngest of four children born to John Collins (1918–1990) and his wife Doris (1919–1989)."]}, {"page": "Hibakusha", "response": ["* Hiroshima, Paul Wilmshurst, BBC, 2005, 89 mn"]}, {"page": "Saïd Taghmaoui", "response": ["| Paul Wilmshurst"]}, {"page": "Forgiveness (disambiguation)", "response": ["* Forgiven (2007 film), a 2007 British TV film directed by Paul Wilmshurst"]}, {"page": "List of documentary films about World War II", "response": ["| Paul Wilmshurst"]}, {"page": "Strike Back: Project Dawn", "response": ["Frank Spotnitz, Richard Zajdlic, Tony Saint and Simon Burke were contracted as the series writers, while Alex Holmes, Bill Eagles, Paul Wilmshurst and Daniel Percival serve as the series directors. Andy Harries and Elaine Pyke were the show's executive producers, with Percival and Spotnitz working as Co-Executive Producers. In addition, Michael Casey, Trevor Hopkins and Sue De Beauvoir were the series producers, with Bill Shepard serving as co-producer. Spotnitz wrote the first episodes. He was approached to write for the series because the producers needed somebody to reimagine the show as Armitage was committed to The Hobbit in New Zealand, by introducing two new leads. Spotnitz described the process; \"We had this great format, this great world of 'Strike Back' and then we had to imagine who were the new characters who were going to drive the show in the second year.\" Before Project Dawn was even announced, the crew were scouting for locations in South Africa, where the first series was shot, as well as investigating other parts of the world including the United States, South America, and Europe."]}, {"page": "Strike Back: Vengeance", "response": ["Tony Saint returned to write a number of episodes as well as co-executive produce the series, while Bill Eagles and Paul Wilmshurst returned to direct; Eagles directed four episodes, while Wilmshurst directed two. Julian Holmes directed episodes five and six, and film director Michael J. Bassett also directed two episodes of the series. Andy Harries and Huw Kennair-Jones executive produced the series. The series also included consultants who work in counterterrorism, who provided insight into the environment."]}, {"page": "Doctor Who (series 8)", "response": ["Filming began on 6 January 2014 in Cardiff, with Peter Capaldi and Jenna Coleman shooting their first scenes for Series 8 on 7 January 2014. On 22 February 2014 it was announced that Paul Wilmshurst would also direct an episode. On 11 May 2014, it was announced that an episode directed by Wilmshurst and written by Harness would be filming in Lanzarote, the second time Doctor Who has filmed there after the 1984 serial Planet of Fire. Filming took place in Volcán del Cuervo, also known as the Raven's Volcano. On 14 May 2014 it was announced that American director Rachel Talalay would be directing two episodes of the eighth series. On 2 July 2014 filming for the finale took place at the Box Cemetery in Llanelli, previously the location for the final scenes of the seventh series mid-season finale \"The Angels Take Manhattan\". On 4 July 2014 it was announced that Sheree Folkson would direct an episode. On 19 July 2014 filming with the Cybermen took place outside St Paul's Cathedral in London, which had previously been the setting of 1968's The Invasion. Filming on the series was completed on 6 August 2014.", "| rowspan=\"2\" | Paul Wilmshurst"]}, {"page": "Strike Back: Shadow Warfare", "response": ["On 3 October 2012, Cinemax and Sky1 announced the renewal of Strike Back for a fourth series, the third with Cinemax's participation. Michael J. Bassett, Julian Holmes and Paul Wilmshurst return as directors, whilst Simon Burke, James Dormer, John Simpson and Richard Zajdlic return as series writers. The series was produced by Left Bank Pictures, with company director Andy Harries serving as executive producer, with Michael Casey as series producer. Co-executive producers include Bassett, Dormer and Tim Vaughan, with Selwyn Roberts and Chris Thompson as producers and Bill Shepard as the co-producer. Consultants who work in counterterrorism, return as advisers to provide insight into the environment. Like past seasons, the cast receive military training so that they can perform most of their own stunts. Production of the series began in January 2013, and took six months to complete. Filming began in South Africa, used to double Beirut and Colombia for the first four episodes. The first two episodes features water sequences, which were filmed at the KwaZulu-Natal province. In March 2013, production moved to Budapest, Hungary to double as several Eastern European locations for the remainder of the series until filming concluded in June."]}, {"page": "Doctor Who (series 9)", "response": ["| Paul Wilmshurst"]}, {"page": "Mummy on the Orient Express", "response": ["\"Mummy on the Orient Express\" is the eighth episode of the eighth series of the British science fiction television programme Doctor Who. It was first broadcast on BBC One on 11 October 2014. The episode was written by Jamie Mathieson, and directed by Paul Wilmshurst."]}, {"page": "Last Christmas (Doctor Who)", "response": ["\"Last Christmas\" is an episode of the British science fiction television series Doctor Who that was first broadcast on 25 December 2014. It is the tenth Christmas special since the show’s revival in 2005. It was written by Steven Moffat and directed by Paul Wilmshurst.", "Filming on \"Last Christmas\" was scheduled to start two weeks after the Series 8 World Tour Promotion. Paul Wilmshurst directed the episode.  The read-through for the episode took place on 3 September 2014, and filming began on 8 September in Cardiff, with Wilmhurst tweeting that it would likely take four weeks to complete. Scenes were filmed at Vaendre Hall in the Cardiff suburb of St Mellons."]}, {"page": "Kill the Moon", "response": ["\"Kill the Moon\" is the seventh episode of the eighth series of the British science fiction television programme Doctor Who. It was first broadcast on BBC One on 4 October 2014. The episode was written by Peter Harness and directed by Paul Wilmshurst.", "Writing in The Independent, Neela Debnath praised Coleman's performance, articulating that she \"impressed again with her fury as she held the Doctor to account. This is the grown up assistant the Time Lord needs to keep him in check\" and ultimately closed her review by saying \"'Kill the Moon' was an enclosed space adventure with all the claustrophobia that an episode like this demands [...] It was hardly the strongest episode of the series but it was no car crash either.\".. Patrick Mulkern heavily praised the episode, awarding it a perfect 5/5 in Radio Times. He also praised Coleman's performance, stating that \"Coleman expertly conveys Clara's terrible dilemma – and later her tearful fury at the Doctor's behaviour\". He described the episode's writing as \"audacious, highly imaginative, and is well matched by Paul Wilmshurst's supremely eerie, cinematic direction\", and closed his review by noting \"Portentous dialogue, sharp direction, urgent music and a powerhouse performance from Peter Capaldi make this one of the defining moments of the season\"."]}, {"page": "Wilmshurst, Paul", "response": ["#redirectPaul Wilmshurst"]}]}}