{"wiki_id": "http://www.wikidata.org/entity/Q1508624", "itemLabel": "George William de Saulles", "itemDescription": "British medalist", "wikipedia_url": "https://en.wikipedia.org/wiki/George_William_de_Saulles", "wikipedia_page": {"main": "George William de Saulles (4 February 1862 – 21 July 1903) was a British medallist. He designed the obverse of coins of the United Kingdom and its colonies under Queen Victoria and King Edward VII.", "link_mentions": [{"page": "History of the British penny (1714–1901)", "response": ["Joseph Edgar Boehm's \"Jubilee head\" of the Queen was placed on the gold and silver coinage in 1887 but was not adopted for the bronze, with the Bun head continuing. Boehm's rendering proved unpopular, and in 1893 was replaced with the \"Veiled head\" or \"Old head\", by Thomas Brock, and engraved by Chief Engraver of the Royal Mint George William de Saulles. The new penny design was introduced in 1895, the new version being authorised by a proclamation dated 11 May of that year. Victoria is seen as an elderly woman, wearing a diadem partially eclipsed by a veil. She wears a necklace with a pendant, an earring, and the Garter Riband with Star. The inscription became VICTORIA DEI GRA BRITT REGINA FID DEF IND IMP, as the title of Empress of India had been added to the Queen's titles in 1876. The reverse was modified by de Saulles, with the most significant change the deletion of the ship and lighthouse. The new design was struck each year from 1895 to 1901, the year in which Victoria died. Coins depicting her and dated 1901 continued to be struck until King Edward VII's coinage was ready in May 1902."]}, {"page": "History of the British penny (1901–1970)", "response": ["In 1895 the design on the reverse was modified by the Engraver of the Royal Mint George William de Saulles and, after Queen Victoria's death in 1901, de Saulles was called upon to create a design for the obverse which would feature Edward VII. This feature appeared on the version of the penny which went into circulation in 1902, and it remained in circulation until the year of Edward's death, 1910. An obverse version of the penny designed by Sir Bertram Mackennal and depicting George V went into circulation in 1911, and it remained in circulation with some modifications until the year of the king's death, 1936. No new pennies were produced for commerce in 1933, because a sufficient number were already in circulation, but at least seven were struck that year, mostly for placement beneath foundation stones and in museums; today they are valuable. Edward VIII's short reign is only represented by a single pattern coin, dated 1937. That year, a new obverse design by Humphrey Paget which depicted George VI went into use. From 1941 to 1943, during the Second World War, pennies were only struck for the colonies; these are all dated 1940 which was the most recent year of production in the United Kingdom. After the war, demand for the penny began to diminish. Most of the 1950 and 1951 pieces were sent to Bermuda, where many of them were retrieved from circulation and repatriated by British coin dealers because of their relative scarcity.", "Following the death of Queen Victoria on 22 January 1901, officials at the Royal Mint planned for new coins, to bear the image of her son and successor, Edward VII. New coin designs had been introduced in the 1890s, and Mint officials believed the British people wanted as few changes to the coinage as possible. Thus, it was decided not to alter the reverses of the three bronze coins (the penny, halfpenny and farthing), as a new portrait of the Queen had been introduced in 1895. At that time, the Engraver of the Royal Mint, George William de Saulles, had modified Leonard Charles Wyon's depiction of Britannia on the reverse of the bronze coins—the lighthouse and sailing ship that had flanked her were removed. De Saulles was tasked with creating a depiction of Edward for the King's new coinage. The Mint continued to strike coins depicting Victoria, dated 1901, until the King's coinage was ready in May 1902."]}, {"page": "Florin (British coin)", "response": ["Both sides of the florin were redesigned following the accession of Victoria's son, Edward VII, each design being created by the Chief Engraver of the Royal Mint, George William de Saulles. The florin of King Edward VII was minted every year from 1902 to 1910. Its specifications remained at 11.3 grams weight and 28.5 millimetres diameter. The obverse shows the right-facing head of the King, inscribed , while the other side features what Coincraft's Standard Catalogue of English and UK Coins deems \"a most unusual and original reverse\". It shows a windswept figure of Britannia standing holding a shield with her left hand and a trident with her right, and inscribed , with the date below. Peter Seaby, in his history of British coinage, described the figure of Britannia as \"standing on some mythical ancient ship which could hardly be sea-worthy under her weight\", but \"a pleasing composition\"."]}, {"page": "Sovereign (British coin)", "response": ["In 1871, the Deputy Master of the Mint, Sir Charles Fremantle, restored the Pistrucci George and Dragon design to the sovereign, as part of a drive to beautify the coinage. The return of Saint George was approved by the Queen, and authorised by an Order in Council dated 14 January 1871. The two designs were struck side by side in London from 1871 to 1874, and at the Australian branch mints until 1887, after which the Pistrucci design alone was used. The saint returned to the rarely-struck two- and five-pound pieces in 1887, and was placed on the half sovereign in 1893. Wyon's \"Young head\" of Queen Victoria for the sovereign's obverse was struck from 1838 until 1887, when it was replaced by the \"Jubilee head\" by Sir Joseph Boehm. That obverse was criticised and was replaced in 1893 by the \"Old head\" by Sir Thomas Brock. Victoria's death in 1901 led to a new obverse for her son and successor, Edward VII by George William de Saulles, which began production in 1902; Edward's death in 1910 necessitated a new obverse for his son, George V by Bertram Mackennal. Pistrucci's George and Dragon design continued on the reverse."]}, {"page": "Michael Hicks Beach, 1st Earl St Aldwyn", "response": ["His second daughter, Susan Hicks Beach (1878-1965), was the sitter representing Britannia on the reverse of the Edward VII silver florins (two shilling pieces) issued from 1902 to 1910 and designed by George William de Saulles.  She resided with her mother for sundry years subsequent to World War II, cultivating and caring for the family land in the Cotswolds."]}, {"page": "History of the British farthing", "response": ["In 1896, a new obverse was introduced to the bronze coinage showing Victoria as an elderly woman. The obverse was designed by Thomas Brock and engraved by George William de Saulles. The farthing continued to display it until the year of the Queen's death, 1901. De Saulles also revised the reverse; the most significant change was the deletion of the lighthouse and ship on either side of Britannia; they would never return to the farthing. The inscription on the Old Head farthing was . Beginning in 1897, farthings were issued artificially darkened; this was to avoid confusion of bright new farthings with the half sovereign; the bronze farthing and the gold piece were the same size."]}, {"page": "Coins of the Newfoundland dollar", "response": ["|George William de Saulles (obv)Horace Morehen (rev)", "|George William de Saulles", "|George William de Saulles", "|George William de Saulles (obv)W.H.J. Blakemore(rev)", "|George William de Saulles (obv)W.H.J. Blakemore (rev)", "|Edgar Bertram MacKennal (obv)George William de Saulles (rev)", "|Edgar Bertram MacKennal (obv)George William de Saulles (rev)", "|Percy Metcalfe (obv)George William de Saulles (rev)", "|Percy Metcalfe (obv)George William de Saulles (rev)"]}, {"page": "List of medallists", "response": ["*George William de Saulles (1862 – 1903) Signatures: \"DES\", \"DS\", or \"WS\"."]}, {"page": "Florin (Australian coin)", "response": ["|||||| 1910 || 1910 || rowspan=\"6\" | 28.5 mm || rowspan=\"6\" | 2.5 mm || rowspan=\"6\" | 11.31 g || rowspan=\"3\" | 92.5% silver 7.5% copper || rowspan=\"6\" | Reeded || Edward VII  EDWARDVS VII D:G: BRITT. OMN: REX F: D: IND: IMP:  by George William de Saulles || 1908 coat of arms of Australia (with ADVANCE AUSTRALIA on ribbon)  ONE FLORIN - TWO SHILLINGS  by William Henry James Blakemore"]}, {"page": "Newfoundland fifty cents", "response": ["|George William de Saulles"]}, {"page": "Shilling (Australian)", "response": ["|||||| 1910 || 1910 || 23.5 mm || || 5.65 g || 92.5% silver, 7.5% copper || Reeded || Edward VII  EDWARDVS VII D:G: BRITT. OMN: REX F: D: IND: IMP:  by George William de Saulles || 1908 coat of arms of Australia (with ADVANCE AUSTRALIA on ribbon)  ONE SHILLING  by W.H.J. Blakemore"]}, {"page": "Threepence (Australian coin)", "response": ["|||||| 1910 || 1910 || 16 mm || || 1.41 g || 92.5% silver, 7.5% copper || Plain || Edward VII  EDWARDVS VII D:G: BRITT. OMN: REX F: D: IND: IMP:  by George William de Saulles || Coat of arms of Australia  THREEPENCE  by W.H.J. Blakemore"]}, {"page": "George william de saulles", "response": ["#REDIRECT George William de Saulles "]}, {"page": "Ashanti Medal", "response": ["The medal, designed by George William de Saulles, was circular and  in diameter, with the following design:"]}, {"page": "Royal Naval Volunteer Reserve Long Service and Good Conduct Medal", "response": ["* The original King Edward VII version of 1908 has his effigy in the uniform of the Admiral of the Fleet and is circumscribed \"EDWARDVS VII REX IMPERATOR\". The initials \"De S\" below the epaulette on the King's left shoulder are those of the engraver, British medallist George William de Saulles.Medal-Medaille – Royal Naval Long Service and Good Conduct Medal, Edward VII, 1901–1910 issue, rare attribution to H.M. Coast Guard (Accessed 10 June 2015)"]}, {"page": "Allan Wyon", "response": ["Wyon made the episcopal seals for the archbishops of Canterbury and York; the seal for the secretary of Scotland in 1889, and the Great Seal of Ireland in 1890. The great seal of Queen Victoria of 1899 was not his, but the work of George William de Saulles."]}, {"page": "George William De Saulles", "response": ["#REDIRECT George William de Saulles"]}, {"page": "Volunteer Long Service Medal", "response": ["* The original version of 1894, created by George William de Saulles, shows the effigy of Queen Victoria wearing the Crown, a veil and the Star of the Order of the Garter. The effigy is circumscribed \"VICTORIA REGINA\". This version's suspender is affixed to the medal by means of a double-toe claw. Some Queen Victoria versions of the medal were awarded up to the Army Order of July 1902, post-dating her death.The Military Archive - Volunteer Long Service Medal  (Accessed 30 June 2015)"]}, {"page": "Naval Long Service and Good Conduct Medal (1848)", "response": ["The King Edward VII version appeared after his succession to the throne on 22 January 1901. The obverse has a raised rim, with the King's effigy in Admiral's uniform, facing left and inscribed \"EDWARDVS VII REX IMPERATOR\" around the perimeter. The initials \"De S\" below the epaulette on the King's left shoulder are those of the engraver, British medallist George William de Saulles.Medal-Medaille - Royal Naval Long Service and Good Conduct Medal, Edward VII, 1901-1910 issue, rare attribution to H.M. Coast Guard (Accessed 10 June 2015)"]}, {"page": "Colonial Auxiliary Forces Long Service Medal", "response": ["* The King Edward VII version, introduced after his succession to the throne in 1901, displays his effigy in Field Marshal's uniform, facing left, circumscribed with the legend \"EDWARDVS VII REX IMPERATOR\".  The initials \"DES\" of medallist George William de Saulles are in the field below the bust.Museum Victoria - Medal - Colonial Auxiliary Forces Long Service Medal, King Edward VII, Australia, 1902-1910 (Accessed 6 July 2015)"]}, {"page": "Volunteer Long Service Medal for India and the Colonies", "response": ["* The original version of 1896, created by George William de Saulles, shows the effigy of Queen Victoria wearing the Crown, a veil and the Star of the Order of the Garter. The effigy is circumscribed \"VICTORIA REGINA ET IMPERATRIX\" (Victoria, Queen and Empress). This version's suspender is affixed to the medal by means of a double-toe claw. Some Queen Victoria medals were awarded up to July 1902, post-dating her death.Latin Dictionary – Victoria Regina et Imperatrix (VRI) (Accessed 1 July 2015)"]}, {"page": "King Edward VII Police Coronation Medal", "response": ["The medal,  in diameter, was designed by George William de Saulles.  "]}, {"page": "Chief Engraver of the Royal Mint", "response": ["|George William de Saulles"]}]}}