{"wiki_id": "http://www.wikidata.org/entity/Q1501866", "itemLabel": "Murdo MacLeod", "itemDescription": "Scottish footballer and manager (born 1958)", "wikipedia_url": "https://en.wikipedia.org/wiki/Murdo_MacLeod", "wikipedia_page": {"main": "Murdo Davidson MacLeod (born 24 September 1958 in Glasgow) is a Scottish former professional football player and manager. MacLeod, who played as a midfielder, made 20 appearances for Scotland and played in the 1990 World Cup Finals. He had a successful club career, mainly with Dumbarton, Celtic, Borussia Dortmund and Hibernian. He then became a manager during the mid-1990s, serving both Dumbarton and Partick Thistle. MacLeod then returned to Celtic as assistant manager, enjoying a successful season in tandem with Wim Jansen. Since leaving Celtic as a result of Jansen's departure from Celtic Park in 1998, MacLeod has worked as a football pundit for newspapers, radio and television.\n\n", "link_mentions": [{"page": "Milngavie", "response": ["The footballer Murdo MacLeod, who played for Dumbarton, Celtic, Borussia Dortmund and Hibernian, and at international level for Scotland, was born and brought up in Milngavie."]}, {"page": "Partick Thistle F.C.", "response": ["|Murdo MacLeod"]}, {"page": "Billy McNeill", "response": ["McNeill is credited with developing young players for Celtic, such as Paul McStay and Charlie Nicholas, and making signings such as Murdo MacLeod and Davie Provan who became key players for the club through the 1980s. However, McNeill found working with Desmond White, Celtic's chairman, very difficult, and felt underpaid and underappreciated. Despite Celtic's successes, by 1983 he was being paid less than the managers of Aberdeen, Dundee United, Rangers and St Mirren. When White sold Nicholas to Arsenal, against McNeill's wishes, McNeill looked for the first available way out, and took up the offer to manage Manchester City."]}, {"page": "Helensburgh", "response": ["*Murdo MacLeod, football player and manager"]}, {"page": "Dumbarton F.C.", "response": ["* Murdo MacLeod – 87 apps (1975–1978) and 66 apps (1993–1995) as Player/Manager", "|align=left|Murdo MacLeod"]}, {"page": "Davie Cooper", "response": ["To the surprise of many, manager Jock Wallace abruptly left Rangers on 23 May 1978 and was replaced by John Greig. The club made a poor start to the 1978-79 season, failing to win their first six league encounters. Despite this however, they recorded victories against Juventus and PSV Eindhoven in the European Cup, with Cooper failing to be selected for the ties by Greig. A mixed season domestically followed and they had all but lost the title in a 4–2 away defeat to Celtic on 21 May 1979. Describing losing the championship, Cooper said \"you just want to emigrate as soon as you have got changed and walked out of the ground. It is like a spectre which haunts you for weeks.\" Despite this, Rangers won the 1979 Scottish League Cup Final in a 2–1 victory against Aberdeen and were victorious in the 1979 Scottish Cup Final, winning 3–2 over Hibernian. Tensions were beginning to rise between Cooper and Greig, mainly due to less-frequent selection of Cooper by the new manager. Cooper would often return home to Hamilton complaining the club he loved was \"kicking him in the teeth\". That season, Cooper made 49 appearances and scored ten goals. On 4 August 1979, Cooper scored a memorable solo goal against Celtic in the 1979 Drybrough Cup Final at Hampden. A crossed ball in from Alex MacDonald met Cooper at the edge of the box, where he went on to \"keepie up\" the ball over Roddie MacDonald, Murdo MacLeod, Tom McAdam and Alan Sneddon before slotting the ball past onrushing Celtic goalkeeper Peter Latchford. The goal was voted the greatest ever Rangers goal by Rangers fans and listed by The Guardian's Rob Smyth as the second greatest ever solo goal, after Diego Maradona's Goal of the Century. Sandy Jardine, who had scored a spectacular second goal for Rangers during the match, admitted his goal had been overshadowed by Cooper's. \"I scored one of my best goals that day,\" said Jardine, \"and it hardly got a mention.\""]}, {"page": "History of Celtic F.C. (1887–1994)", "response": ["Billy McNeill (nicknamed \"Cesar\") the former player and captain of The Lisbon Lions, took over as manager in August 1978.  The return from injury of Danny McGrain and shrewd signings such as winger Davie Provan and midfielder Murdo MacLeod helped McNeill strengthen a Celtic side that had finished fifth in the league previous season.  In May 1979 Celtic's final league fixture was an Old Firm fixture against Rangers at Parkhead.  A win would clinch the 1978–79 league title for Celtic, but any other result would leave Rangers as favourites for the league as they had two additional games to play.  Celtic attacked from the start but trailed 1–0 at half-time through an Alex MacDonald goal for Rangers.  Johnny Doyle was then sent-off in the second half, leaving Celtic a man down as well as a goal down.  Celtic though, responded in exhilarating style through goals from Roy Aitken and George McCluskey to go 2–1 ahead. Celtic's lead only lasted a couple of minutes, Bobby Russell equalising with a fine strike.  As the game neared the end, and with Celtic attacking relentlessly, a McCluskey cross was parried by Rangers goalkeeper Peter McCloy against one of his own defenders, Colin Jackson, and then rebounded back into the goal to put Celtic 3–2 ahead.  In the final minute Murdo MacLeod put the matter beyond doubt when he hammered home a powerful 20 yard strike to secure a 4–2 win on the night and clinch the title in the most dramatic of circumstances.", "When Billy McNeill returned to manage the club in 1987, he oversaw significant change in playing personnel over the summer.  Strikers Brian McClair, Mo Johnston and Alan McInally had left, as well as midfielder Murdo MacLeod.  Winger Davie Provan retired due to ill-health, veteran defender and captain Danny McGrain had been given a free transfer whilst Irish international centre-half Mick McCarthy had arrived from Manchester City, signed by Davie Hay a few weeks before his sacking.  McNeill signed three players over the summer; right-back Chris Morris from Sheffield Wednesday, goalscoring midfielder Billy Stark from Aberdeen and striker Andy Walker from Motherwell.  As the season progressed, Frank McAvennie arrived from West Ham and young forward Joe Miller – a very promising prospect – was signed from Aberdeen."]}, {"page": "1987 World Snooker Championship", "response": ["Murdo MacLeod defeated Rex Williams 10–5, despite Williams making the highest break of the first round, a 112. The win made MacLeod the first Scottish player to secure a victory at the Crucible Theatre. Stephen Hendry met veteran player Willie Thorne, led 5–4 at the end of their first session, and then took the first four frames in the second, before Thorne won three in a row. Hendry took the 17th frame to achieve a 10–7 win. At age 18 years and 97 days, Hendry became the youngest-ever player to win a world championship match at the Crucible. Steve Longworth led 5–4 after the first session of his match, and won five successive frames to defeat Kirk Stevens 10–5. Terry Griffiths also progressed from a 5–4 interval lead to a 10–4 win, against Jim Wych. Alex Higgins, due to start a six-month ban after the Championship, eliminated first-year professional Jon Wright 10–6."]}]}}