{"wiki_id": "http://www.wikidata.org/entity/Q1508011", "itemLabel": "George Osborne, 10th Duke of Leeds", "itemDescription": "British politician (1862-1927)", "wikipedia_url": "https://en.wikipedia.org/wiki/George_Osborne,_10th_Duke_of_Leeds", "wikipedia_page": {"main": "George Godolphin Osborne, 10th Duke of Leeds, JP (18 September 1862 – 10 May 1927), styled Earl of Danby from birth until 1872 and subsequently Marquess of Carmarthen until 1895, was a British peer and Conservative politician.\n\n", "link_mentions": [{"page": "Claude Bowes-Lyon, 14th Earl of Strathmore and Kinghorne", "response": ["|Patrick Bowes-Lyon, Lord Glamis||||25 May 1949||64 years||He married Lady Dorothy Osborne (daughter of George Osborne, 10th Duke of Leeds) in 1908, and had issue. In 1944, he became 15th and 2nd Earl of Strathmore and Kinghorne."]}, {"page": "Oliver Lyttelton, 1st Viscount Chandos", "response": ["Lord Chandos married Lady Moira Godolphin Osborne, a daughter of George Osborne, 10th Duke of Leeds on 30 January 1920. They had three sons and one daughter:"]}, {"page": "Patrick Bowes-Lyon, 15th Earl of Strathmore and Kinghorne", "response": ["The Earl married Lady Dorothy Beatrix Godolphin Osborne (3 December 1888 – 18 June 1946), daughter of George Osborne, 10th Duke of Leeds, on 21 November 1908 in London. The couple had four children:"]}, {"page": "George Lambton, 2nd Earl of Durham", "response": ["* Lady Katherine Frances Lambton (1862–1952), who married George Osborne, 10th Duke of Leeds and had issue.v"]}, {"page": "Cecilia Bowes-Lyon, Countess of Strathmore and Kinghorne", "response": ["|Patrick Bowes-Lyon, Lord Glamis||||25 May 1949||64 years||He married Lady Dorothy Osborne (daughter of George Osborne, 10th Duke of Leeds) in 1908, and had issue. In 1944, he became 15th and 2nd Earl of Strathmore and Kinghorne."]}, {"page": "Enoch Seeman", "response": ["The Yale University Art Gallery owns a 1717 portrait of Elihu Yale by Seeman and the Metropolitan Museum in New York, US, owns his rendering of Sir James Dashwood, described by the Grove Dictionary of Art as 'Exceptionally lively'. Also by Seeman the younger are a 1739 portrait of Abraham Tucker, held by the National Portrait Gallery, London, and various copies of sixteenth- and seventeenth-century portraits. The National Trust owns two examples of this set of his work – at Dunham Massey in Cheshire, England, a copy of a portrait of Lady Diana Cecil, and at Belton House in Lincolnshire, England, of Lady Cust and her nine children. His portrait of Lady Caroline D'Arcy, Countess of Ancram, wife of the Earl of Ancram, sold at Christie's in 2000 for £11,750. It had previously been owned by George Osborne, 10th Duke of Leeds and hung in the dining room at Hornby Castle."]}, {"page": "George Godolphin Osborne, 10th Duke of Leeds", "response": ["#REDIRECT George Osborne, 10th Duke of Leeds"]}, {"page": "GG Osborne", "response": ["#REDIRECT George Osborne, 10th Duke of Leeds"]}, {"page": "George Osborne, 8th Duke of Leeds", "response": ["* Sir George Godolphin Osborne, 9th Duke of Leeds (11 August 1828 –23 December 1895); succeeded his father as the 9th Duke in 1872. He married on 16 January 1861 Hon. Frances Georgiana Pitt-Rivers, daughter of George Pitt-Rivers, 4th Baron Rivers of Sudeley Castle and Lady Susan Georgiana Leveson-Gower (herself a daughter of Granville Leveson-Gower, 1st Earl Granville); had issue. He was succeeded in the dukedom by his second surviving son, George Osborne, 10th Duke of Leeds."]}, {"page": "George Osborne (disambiguation)", "response": ["*George Osborne, 10th Duke of Leeds (1862–1927), his son, British MP for Brixton, Treasurer of the Household"]}, {"page": "Antony Lyttelton, 2nd Viscount Chandos", "response": ["Lord Chandos was the son of Oliver Lyttelton, 1st Viscount Chandos, and Lady Moira Godolphin Osborne, a daughter of George Osborne, 10th Duke of Leeds. He was educated at Eton and Trinity College, Cambridge.  Chandos served in the General Staff during World War II in the Mediterranean from 1942–45, where he was mentioned in dispatches. In 1950 Chandos joined the stockbrokers Panmure Gordon & Co. where he stayed until 1975."]}, {"page": "Irma de Malkhozouny", "response": ["Irma Amelia de Malkhozouny was the daughter of Iskender de Malkhozouny. She was a professional ballet dancer. She married Paul Brewster, but later divorced. On 27 March 1933 she married John Osborne, 11th Duke of Leeds in Nice, France. Her husband was the son of George Osborne, 10th Duke of Leeds and Lady Katherine Lambton. The marriage produced no children, and ended in 1948 when de Malkhozouny had an affair with Frank Atherton Howard, an American millionaire. In 1947 she married Howard.   The duke went on to marry two other times, to Audrey Young and Caroline Fleur Vatcher."]}, {"page": "Katherine Osborne, Duchess of Leeds", "response": ["#REDIRECT George Osborne, 10th Duke of Leeds"]}]}}