{"wiki_id": "http://www.wikidata.org/entity/Q15040605", "itemLabel": "Disley Jones", "itemDescription": "English stage and film designer", "wikipedia_url": "https://en.wikipedia.org/wiki/Disley_Jones", "wikipedia_page": {"main": "Clifford Disley Jones (15 January 1926 – 4 June 2005) was an English stage and film designer.", "link_mentions": [{"page": "The Boy Friend (musical)", "response": ["In 1995, on its 40th anniversary, the musical returned to The Players' Theatre in London in a new production that was as near a reproduction of the original as possible. It was directed by Maria Charles, who had played the original Dulcie. The choreography was by Geoffrey Webb who was also in the original production. It was originally planned that the choreography would be done by Larry Drew, the original Bobby van Husen, but he died suddenly during the early planning stages of the production. Set design was by Disley Jones who was responsible for the hat designs in the original production. Among the cast were Gemma Page, Oliver Hickey, Sophie Louise Dann and John Rutland (in his original role as Lord Brockhurst). Following its success at the Players' it went on a nationwide tour and was very successful."]}, {"page": "Johanna Harwood", "response": ["Between 1960 and 1961 Harwood and Saltzman adapted the play The Marriage Game - originally by Mel Tolkin and Lucille Kallen - a comedy about \"six girls in search of husbands.\" The play opened at the Kings Theatre, Southsea, on 25 September 1961. According to Plays and Players, the comedy was scheduled to visit Liverpool, Eastbourne and Brighton \"before coming into the West End.\" Anthony Sharp directed with sets by Disley Jones.' Broccoli and Saltzman subsequently hired Terry Southern to write the script which was never filmed."]}, {"page": "The Mikado (1967 film)", "response": ["The Mikado was filmed at the Golders Green Hippodrome on enlarged stage sets in the same way that Burge had filmed Othello. It starred John Reed, Kenneth Sandford, Valerie Masterson, Philip Potter, Donald Adams, Christene Palmer and Peggy Ann Jones in their usual roles with D'Oyly Carte, and used the D'Oyly Carte chorus. The City of Birmingham Symphony Orchestra was conducted by D'Oyly Carte's longstanding conductor, Isidore Godfrey. Set design and decoration were by Disley Jones and Peter Howitt. With one exception the costumes were by Charles Ricketts, first seen in D'Oyly Carte stage productions in 1926 and retained by subsequent D'Oyly Carte designers.Bradley, pp. 38–39; and \"Peter Goffin\", The Studio, Volume 62, 1961, pp. 16–19 The first of Nanki-Poo's two costumes was by Jones.Bettany, p. 16"]}, {"page": "List of restaurateurs", "response": ["*  Disley Jones"]}, {"page": "Disley (disambiguation)", "response": ["* Disley Jones, an English stage and film designer"]}]}}