{"wiki_id": "http://www.wikidata.org/entity/Q1507932", "itemLabel": "George Simond", "itemDescription": "British tennis player (1867-1941)", "wikipedia_url": "https://en.wikipedia.org/wiki/George_Simond", "wikipedia_page": {"main": "George Miéville Simond (23 January 1867 – 8 April 1941) was an English tennis player who competed in the 1908 Summer Olympics. Simond was born in Marylebone.  In 1908 he won the silver medal in the men's indoor doubles competition together with his partner George Caridia.", "link_mentions": [{"page": "Tennis at the 1908 Summer Olympics", "response": ["| George Caridia  George Simond"]}, {"page": "George Caridia", "response": ["At the 1908 London Olympics Caridia won those medals in the men's singles and doubles (with George Simond) event (both were contested indoor). In both finals he lost to fellow British player Arthur Gore. Caridia reached the singles semifinals of Wimbledon in 1903 (losing in four sets to Major Ritchie) and the quarterfinals in 1904 and 1909. "]}, {"page": "Great Britain at the 1908 Summer Olympics", "response": ["| , George Simond || Tennis", "|bgcolor=silver| 2nd ||align=left| George Caridia  George Simond || Defeated  Eaves/Hillyard || Defeated  Boström/Setterwall || Lost to  Barrett/Gore"]}, {"page": "Laurence Doherty", "response": ["|   George Simond", "|  George Simond"]}, {"page": "Kent Championships", "response": ["|1902 ||  Laurence Doherty ||  George Simond || 6–4, 6–0, 6–3"]}, {"page": "Simond", "response": ["* George Simond (1867–1941), English tennis player"]}, {"page": "Anthony Wilding career statistics", "response": ["|  George Simond"]}, {"page": "French Covered Court Championships", "response": ["|1896 ||  Manliffe Goodbody  ||  George Simond|| 7–5, 6–3, 6–4", "|1898 ||  George Simond ||  Paul Aymé || 9–7, 2–6, 7–5 retired.", "|1901 ||  George Simond  ||  Max Decugis || 6–0, 7–5, 6–1"]}, {"page": "1901 Wimbledon Championships – Men's doubles", "response": ["Dwight Davis and Holcombe Ward defeated Herbert Roper Barrett and George Simond 7–5, 6–4, 6–4 in the All Comers' Final, but the reigning champions Laurence Doherty and Reginald Doherty defeated Davis and Ward 4–6, 6–2, 6–3, 9–7 in the Challenge Round to win the Gentlemen' Doubles tennis title at the 1901 Wimbledon Championships.100 Years of Wimbledon by Lance Tingay, Guinness Superlatives Ltd. 1977"]}, {"page": "1906 Wimbledon Championships – Men's Doubles", "response": ["Frank Riseley and Sydney Smith defeated Clement Cazalet and George Simond 6–2, 6–2, 5–7, 6–4 in the All Comers' Final, and then defeated the reigning champions Laurence Doherty and Reginald Doherty 6–8, 6–4, 5–7, 6–3, 6–3 in the Challenge Round to win the Gentlemen' Doubles tennis title at the 1906 Wimbledon Championships.100 Years of Wimbledon by Lance Tingay, Guinness Superlatives Ltd. 1977"]}, {"page": "John Flavelle", "response": [" At his first Wimbledon in 1895, Flavelle lost in the quarter finals to Ernest Meers.  At Wimbledon 1898 he lost in the quarterfinals to Laurence Doherty, though he did win a set. Flavelle reached the Wimbledon last 16 in 1906 (beating George Simond before losing to Sydney Smith). In his last appearance aged 57 in 1920, Flavelle lost easily in round one to Bill Johnston. Flavelle was runner up in several important tournaments: the German Open in 1902 (Challenge Round to Max Decugis) and 1903 (all comer's final to Major Ritchie), the French Covered Court Championships in 1905 (to Ritchie) and Queen's in 1906 (losing to Ritchie). "]}, {"page": "Match of the Century (tennis)", "response": ["Tournament referee George Simond chose the match officials, all of whom were agreed upon by Lenglen and Wills. The chair umpire was George Hillyard. The six linesmen were Cyril Tolley, Clement Cazalet, Roman Najuch, Francis Towle, Charles Hope, and Reginald Dunkerley. All of the officials were British. Simond, Hillyard, Tolley, Najuch, Cazalet, and Dunkerley were tennis players themselves. Tolley was also a British Amateur golf champion, while Towle was a hotel magnate. There was no foot fault judge, possibly as a result of a series of foot faults being called against Lenglen in her semifinal match."]}, {"page": "Simond, George", "response": ["#redirectGeorge Simond"]}]}}