{"wiki_id": "http://www.wikidata.org/entity/Q15046128", "itemLabel": "Florence Margaret Durham", "itemDescription": "British geneticist", "wikipedia_url": "https://en.wikipedia.org/wiki/Florence_Margaret_Durham", "wikipedia_page": {"main": "Florence Margaret Durham (6 April 1869 – 25 June 1949) was a British geneticist at Cambridge in the early 1900s and an advocate of the theory of Mendelian inheritance, at a time when it was still controversial. She was part of an informal school of genetics at Cambridge led by her brother-in-law William Bateson. Her work on the heredity of coat colours in mice and canaries helped to support and extend Mendel's law of heredity. It is also one of the first examples of epistasis.", "link_mentions": [{"page": "National Institute for Medical Research", "response": ["* Florence Margaret Durham (1869–1948), geneticist"]}, {"page": "Frances Cave-Browne-Cave", "response": ["Like her sister, she was usually known by the single surname Cave professionally. Along with Beatrice, she worked with Karl Pearson at University College London.David Alan Grier, When Computers Were Human, Princeton University Press, 2005, pp. 111–112 Her work was funded by the first research grant offered at Girton: an Old Students' Research Studentship from Girton, provided by Florence Margaret Durham. Her research in the field of meteorology produced two publications in the Proceedings of the Royal Society which discussed barometric measurements, and was read to the British Association at Cambridge in 1904."]}, {"page": "Durham (surname)", "response": ["*Florence Margaret Durham (1869–1949), British geneticist"]}, {"page": "Florence Durham", "response": ["#redirect Florence Margaret Durham"]}, {"page": "Frances Hermia Durham", "response": ["Hermia Durham was born in Pagham, Sussex in 1873, the youngest of nine children of the noted surgeon Arthur Edward Durham; her siblings included Mary Edith Durham, the traveller and anthropologist, and Florence Margaret Durham, the geneticist.Oxford Dictionary of National Biography  She was educated at Notting Hill High School and Girton College, Cambridge, where she studied history from 1892 to 1896."]}]}}