{"wiki_id": "http://www.wikidata.org/entity/Q15070868", "itemLabel": "Lydia Kyasht", "itemDescription": "Russian-British ballet dancer and teacher", "wikipedia_url": "https://en.wikipedia.org/wiki/Lydia_Kyasht", "wikipedia_page": {"main": "Lydia Georgievna Kyasht (25 March 1885 — 11 January 1959) was a Russian British ballerina and dance teacher. She was described by one critic as \"the World's Most Beautiful Dancer\" in 1914.", "link_mentions": [{"page": "Vaslav Nijinsky", "response": ["He appeared with Sedova, Lydia Kyasht and Karsavina. Kchessinska partnered him in La Fille Mal Gardée, where he succeeded in an atypical role for him involving humour and flirtation. Designer Alexandre Benois proposed a ballet based upon Le Pavillon d'Armide, choreographed by Fokine to music by Nikolai Tcherepnin. Nijinsky had a minor role, but it allowed him to show off his technical abilities with leaps and pirouettes. The partnership of Fokine, Benois and Nijinsky was repeated throughout his career. Shortly after, he upstaged his own performance, appearing in the Bluebird pas de deux from the Sleeping Beauty, partnering Lydia Kyasht. The Mariinsky audience was deeply familiar with the piece, but exploded with enthusiasm for his performance and his appearing to fly, an effect he continued to have on audiences with the piece during his career."]}, {"page": "Kay Kendall", "response": ["She had two elder siblings, Terrence Justin \"Terry\" Kendall McCarthy (born 1923) and Patricia Kim \"Pat\" Kendall McCarthy (a.k.a. Kim Kendall, born 1925). By her father's second marriage to his professional dancing partner, Dora Spencer, she had a younger half-brother, Cavan Spencer Kendall McCarthy (a.k.a. Cavan Kendall) (1942–1999). Young Justine attended various schools, including St Leonard's (Brighton), St Margaret's (near Oban, Scotland), and the Lydia Kyasht Dancing Academy (London)."]}, {"page": "List of people from Saint Petersburg", "response": ["* Lydia Kyasht (1885–1959), Russian British ballerina and dance teacher"]}, {"page": "Lucy, Lady Duff-Gordon", "response": ["Lucile was most famous for its lingerie, tea gowns, and evening wear. Its luxuriously layered and draped garments in soft fabrics of blended pastel colours, often accentuated with sprays of hand-made silk flowers, became its hallmark.\"Dream Dresses\", Philadelphia Museum of Art (1998), Best Dressed, 22 However, Lucile also offered simple, smart tailored suits and daywear.Ginsburg, Madeleine, Four Hundred Years of Fashion (1984), 81 The dress illustrated at right typifies the classically draped style often found in Lucile designs. Lucy Duff-Gordon originally designed it in Paris, for Lucile Ltd's spring 1913 collection, and later specially adapted it for London socialite Heather Firbank and other well-known clients, including actress Kitty Gordon and dancer Lydia Kyasht of the Ballets Russes. The example illustrated was worn by Miss Firbank and is preserved in the Victoria and Albert Museum.Duff Gordon, Lady (\"Lucile\"), \"The Last Word in Fashions,\" Harper's Bazaar, July 1913, 26; also \"Mousseline Now Holds First Place,\" New York Times, 6 July 1913, and \"Vogue Points,\" Vogue, 15 May 1913; Gown worn by Heather Firbank. The original design included beading, lost or omitted from this example."]}, {"page": "Roger Tully", "response": ["Roger Tully was born in East London. His early studies were with Muriel Green, née Quick, in eurhythmics. Offered a scholarship to the Rambert School, his first teacher of classical dance and mentor was Marie Rambert. After three years with Rambert and his stage début, he studied at London with Lydia Kyasht, Cleo Nordi, Stanislas Idzikowski and Mary Skeaping. This was followed by intensive study with Kathleen Crofton, who had been a student of Olga Preobrajenska, and who then became his principal teacher."]}, {"page": "Maina Gielgud", "response": ["From 1952 to 1955, Gielgud trained in London and Paris with such artists as George Gontcharov, Olga Preobrajenska, Tamara Karsavina, Lydia Kyasht, Nadine Nicolaeva-Legat, Stanislas Idzikovski and Rachel Cameron. "]}, {"page": "Ronald Colman filmography", "response": ["| Lydia Kyasht"]}, {"page": "List of British films of 1920", "response": ["|The Black Spider||William Humphrey||Mary Clare, Lydia Kyasht||Crime||"]}, {"page": "The Black Spider (1920 film)", "response": ["*Lydia Kyasht as Angela Carfour "]}, {"page": "Anne Woolliams", "response": ["At age 16, she made her professional debut in dance. Woolliams joined the Russian Opera and Ballet led by Jay Pomeroy, which was made up of Eastern European expatriates. Adopting the stage name Anne de Mohan, she joined Lydia Kyasht Ballet de la Jeunesse Anglaise the following year, and then danced with the small St James's Ballet, a minor Arts Council England touring group for towns lacking decent theatres, with whom she became assistant ballet mistress. There, Woolliams became friends with Peter Wright, with the duo dancing together in Alan Carter's comedy ballet The Catch. From 1948 on, she danced in the film The Red Shoes as part of a corps de ballet, and in London stage musicals, such as Brigadoon and Paint Your Wagon. However, Woolliams was more interested in teaching off-stage."]}, {"page": "Kyasht", "response": ["#REDIRECT Lydia Kyasht"]}]}}