{"wiki_id": "http://www.wikidata.org/entity/Q15040601", "itemLabel": "Lisa Vanderpump", "itemDescription": "American restaurateur, philanthropist, author, actress, television personality, activist, editor-in-chief", "wikipedia_url": "https://en.wikipedia.org/wiki/Lisa_Vanderpump", "wikipedia_page": {"main": "Lisa Vanderpump (born 15 September 1960) is a British restaurateur, designer, television personality, author and humanitarian. She has appeared on The Real Housewives of Beverly Hills, Vanderpump Rules, and Vanderpump Dogs. \nVanderpump and her husband, Ken Todd, have owned 36 restaurants, bars and clubs in London and Los Angeles, including The Shadow Lounge, Bar Soho, SUR Restaurant & Lounge, Villa Blanca, Pump Restaurant, Tom Tom Restaurant & Bar and Vanderpump Cocktail Garden.", "link_mentions": [{"page": "September 15", "response": ["*  1960   – Lisa Vanderpump, British restaurateur, television personality, and author"]}, {"page": "Dulwich", "response": ["Famous people born in the area include: artist Madge Tennent in 1889; the author, Enid Blyton in 1897; the first compiler of the London A-Z, Phyllis Pearsall in East Dulwich in 1906, she went on to live in Dulwich Village; code breaker extraordinaire Mavis Batey, then Mavis Lever, was born in Dulwich on May 5, 1921; the war-time singer Anne Shelton who lived on Court Lane until shortly before her death in 1994; also on Court Lane, Dr Reginald John Gladstone FRSE embryologist, lived here until his house was destroyed in the blitz in 1941; footballer Trevor Sinclair in 1973; the actor Tim Roth in 1961; the TV personality Lisa Vanderpump in 1960; and actress Sally Hawkins in 1976."]}, {"page": "A Touch of Class (film)", "response": ["*Lisa Vanderpump as Julia Allessio"]}, {"page": "List of individual dogs", "response": ["* Giggy, a Pomeranian belonging to London born Beverly Hills business women and reality star on The Real Housewives of Beverly Hills and Vanderpump Rules Lisa Vanderpump"]}, {"page": "Pandora (disambiguation)", "response": ["* Pandora Todd, Ken Todd and Lisa Vanderpump's daughter"]}, {"page": "Dancing with the Stars (American TV series)", "response": ["| Lisa Vanderpump", "In season sixteen, Olympic figure skating champion Dorothy Hamill had to withdraw from the competition due to doctor's orders for a spinal injury. A cyst had developed near her lower spine, and was pinching off the nerve in that area. Either boxing champion Victor Ortiz or reality TV star Lisa Vanderpump would have been eliminated, but Hamill withdrew before the results could be announced, meaning that no one was eliminated that week. In season eighteen, week three, actor Billy Dee Williams withdrew, by advice from a doctor, due to a chronic back problem (which resulted in no elimination that week). In season twenty-one, week three, reality TV star Kim Zolciak-Biermann was forced to withdraw from the competition after suffering a blood clot which resulted in a mini stroke (which resulted in no elimination that week). Tamar Braxton also withdrew from the season due to blood clots in her lungs making it the first season to have two withdrawals in it. In season twenty eight, Christie Brinkley withdrew from the competition a week before the season premiere, due to injuring her arm during rehearsal and needing sudden surgery. She was replaced by her daughter, Sailor with only a few days to practice prior to the season premiere. Later that season, Ray Lewis withdrew from the competition in the third week due to a toe injury he sustained during rehearsal that needed surgery. This is the second season to have two withdrawals."]}, {"page": "Beverly Park, Los Angeles", "response": ["Despite being a gated community, there have been occasional instances of crime. In February 2007, the Beverly Park home of Tim McGraw and Faith Hill was burglarized. Police stated that the method of entry was believed to be a broken window and an unspecified amount of money was missing. In February 2010, resident Lisa Vanderpump's automobile was stolen from her driveway during the night and driven off a nearby cliff. Former residents Robert and Jeannette Bisno claimed that their gardens had been toilet-papered, trampled, and strewn with debris in 2004, though there was speculation this may have been the doing of another resident(s), as the Bisnos were involved in a dispute with their Homeowners' Association over a sculpture at the time.", "* Lisa Vanderpump", "The facade of Lisa Vanderpump's estate in Beverly Park was used in the first season of Schitt's Creek. The French chateau style mansion was damaged by a fire in 2012 and demolished between 2014 and 2015."]}, {"page": "Poison Arrow", "response": ["In the music video, ABC's singer Martin Fry plays three parts: a haughty upper-class opera patron; a messenger boy at the opera; and a bandleader at a 1960s-style swinging nightspot. In all three roles, he unsuccessfully attempts to woo the leading lady, played by Lisa Vanderpump, later of The Real Housewives of Beverly Hills."]}, {"page": "List of programs broadcast by E!", "response": ["*Overserved with Lisa Vanderpump"]}, {"page": "The Real Housewives", "response": ["A highly recognizable and frequently parodied feature of the franchise is its opening credits, which feature clips and green screen footage of each housewife in turn, with each housewife delivering a \"tagline\"—a short quip alluding to some aspect of their personality or story. For example, for season 6 of The Real Housewives of Beverly Hills, Lisa Vanderpump, who runs a dog rescue organization, used the tagline \"I'm passionate about dogs, just not crazy about bitches\". Housewives record several taglines for a given season, some of which may be written by the housewife herself and some by producers, with the network having final say on which one is used.", "The compensation of Real Housewives cast members has been the subject of some speculation. In his book about the Housewives franchise, writer Brian Moylan estimates that, as of 2021, a cast member would receive around $60,000 for her first season, increasing year over year up to a cap of around 300 to 500 thousand dollars. Certain \"star\" cast members have been rumored to be paid figures in the low millions, such as NeNe Leakes, and Kandi Burruss of The Real Housewives of Atlanta, Lisa Vanderpump of The Real Housewives of Beverly Hills, and Tamra Judge of The Real Housewives of Orange County. In the early years of the franchise, cast members were paid considerably less, with Real Housewives of New York City cast member Bethenny Frankel stating that she was paid $7,250 for her appearance on the show's first season in 2008.", "Bravo has aired 10 American installments of the Real Housewives franchise, beginning with The Real Housewives of Orange County in 2006. It has also licensed the brand to networks outside the United States, giving rise to more than a dozen international installments. Bravo has also aired a number of specials and spin-offs centered on specific housewives, with the longest-running being Don't Be Tardy (following the family life of Kim Zolciak of The Real Housewives of Atlanta), and Vanderpump Rules (which follows the staff of restaurants owned by Lisa Vanderpump of The Real Housewives of Beverly Hills). In November 2021, The Real Housewives of Dubai was announced as Bravo's first original international installment of the franchise."]}, {"page": "The Wildcats of St Trinian's", "response": ["* Lisa Vanderpump as Ursula"]}, {"page": "Killer's Moon", "response": ["*Lisa Vanderpump - Anne ", "Killer's Moon was shot off season at Armathwaite Hall in the Lake District.  The eclectic  cast includes David Jackson, Jane Hayden (sister of cult actress Linda Hayden), JoAnne Good, future restaurateur Lisa Vanderpump, Hilda Braid, comedian Chubby Oates, and Hannah the three legged dog. Hannah the three legged dog in the film, was originally a pub dog who had lost a leg as the result of a shotgun wound sustained during an armed robbery.  She was later awarded the doggy Victoria Cross award for bravery."]}, {"page": "Stassi Schroeder", "response": ["In 2010, she started working at Lisa Vanderpump's restaurants SUR and Villa Blanca, which earned her a spot on the reality television series Vanderpump Rules. The series follows Vanderpump's employees, as they work on building their futures and become entangled in interpersonal drama. She departed the show at the end of season two to move to New York City, then she returned as an Intern to Lisa Vanderpump in season three."]}, {"page": "List of Live episodes", "response": ["| Shia LaBeouf, Rita Wilson, Lisa Vanderpump & Gleb Savchenko"]}, {"page": "The Real Housewives of Beverly Hills", "response": ["The cast of the upcoming twelfth season will consist of Kyle Richards, Lisa Rinna, Erika Girardi, Dorit Kemsley, Garcelle Beauvais, Sutton Stracke, Crystal Kung Minkoff and Diana Jenkins, while Kathy Hilton and Sheree Zampino will serve as a friends of the housewives. Previous cast members include original housewives Camille Grammer Meyer, Taylor Armstrong, Adrienne Maloof, Kim Richards, and Lisa Vanderpump; and subsequent housewives Brandi Glanville, Yolanda Hadid, Carlton Gebbia, Joyce Giraud de Ohoven, Eileen Davidson, Kathryn Edwards, Teddi Mellencamp Arroyave, and Denise Richards.", "The Real Housewives of Beverly Hills was announced in March 2010 as the sixth installment of The Real Housewives franchise. The first season premiered on October 14, 2010, and starred Kyle Richards, Adrienne Maloof, Kim Richards, Lisa Vanderpump, Camille Grammer and Taylor Armstrong. The series received a 2011 Critics Choice Award for best reality series.", "| Lisa Vanderpump"]}, {"page": "MasterChef (American TV series)", "response": ["*Lisa Vanderpump and her daughter, Pandora vs. Nicole \"Snooki\" Polizzi and JWoww (Blind Taste Test)"]}, {"page": "Corona Theatre School", "response": ["*Lisa Vanderpump"]}, {"page": "Adrienne Maloof", "response": ["She was a cast member for the first three seasons of Bravo's The Real Housewives of Beverly Hills, part of the network's Real Housewives series, alongside Kim and Kyle Richards, Camille Grammer, Lisa Vanderpump, Brandi Glanville, and Taylor Armstrong.Quentin Fottrell, 'Shopping with a Real Housewife of Beverly Hills', in The Wall Street Journal, December 23, 2011  On March 4, 2013, Maloof announced she would be leaving the TV series, but has made guest appearances in the series' fifth, sixth, eighth, and tenth season."]}, {"page": "Miss Universe 2012", "response": ["* Lisa Vanderpump – Reality star of The Real Housewives of Beverly Hills"]}, {"page": "List of The Real Housewives of Beverly Hills episodes", "response": ["Former cast members featured over the previous ten seasons are: Taylor Armstrong (1-3), Camille Grammer (1-2), Adrienne Maloof (1-3), Kim Richards (1-5), Lisa Vanderpump (1-9), Brandi Glanville (3-5), Yolanda Hadid (3-6), Carlton Gebbia (4), Joyce Giraud de Ohoven (4), Eileen Davidson (5-7), Kathryn Edwards (6), Teddi Mellencamp Arroyave (8-10), and Denise Richards (9-10).", "Taylor Armstrong, Camille Grammer, Adrienne Maloof, Kim Richards, Kyle Richards and Lisa Vanderpump are introduced as series regulars."]}, {"page": "Vanderpump Rules", "response": ["Vanderpump Rules is an American reality television series that premiered on January 7, 2013, on Bravo. Developed as a spin-off of The Real Housewives of Beverly Hills, it has aired nine seasons and features Lisa Vanderpump and the staff at her restaurants SUR Restaurant & Lounge, Pump Restaurant and Tom Tom Restaurant & Bar in West Hollywood, CA.", "Vanderpump Rules follows Lisa Vanderpump and the staff at her restaurants SUR Restaurant & Lounge, Pump Restaurant and Tom Tom Restaurant & Bar in West Hollywood, CA, as they work on building their futures in show business and become entangled in interpersonal drama. The series initially centered on new server Scheana and her relationships with established employees: Kristen, Katie, Tom Sandoval, Stassi and Jax.", "On April 27, 2021, Bravo confirmed that Vanderpump Rules would return for a ninth season as well as confirming that Lisa Vanderpump, Katie Maloney-Schwartz, Scheana, Tom Sandoval, Ariana Madix, Tom Schwartz, James Kennedy, Lala Kent and Raquel Leviss would all be returning to the show as main cast members. In May 2021, production had begun for Season 9 and premiered on September 28, 2021.", "| scope=\"row\" nowrap=\"\" | Lisa Vanderpump", "* Lisa Vanderpump: A successful restaurateur, the co-owner of SUR Restaurant & Lounge & TomTom Restaurant & Bar, and owner of Pump Restaurant.", "*Max Todd: Lisa Vanderpump and Ken Todd’s son."]}, {"page": "Dancing with the Stars (American season 16)", "response": ["|Lisa Vanderpump"]}, {"page": "Hello Ross", "response": ["| style=\"background:white;\"| Lisa Vanderpump"]}, {"page": "Miss Universe 2014", "response": ["* Lisa Vanderpump – Reality star of The Real Housewives of Beverly Hills"]}]}}