{"wiki_id": "http://www.wikidata.org/entity/Q1507342", "itemLabel": "George Finch, 9th Earl of Winchilsea", "itemDescription": "Patron of cricket (1752-1826)", "wikipedia_url": "https://en.wikipedia.org/wiki/George_Finch,_9th_Earl_of_Winchilsea", "wikipedia_page": {"main": "George Finch, 9th Earl of Winchilsea  (4 November 1752 – 2 August 1826), was an important figure in the history of cricket. His main contributions to the game were patronage and organisation but Winchilsea, an amateur, was also a very keen player. Finch served with the 87th Foot at the time of the American Revolutionary War from its formation in 1779 to its disbanding in 1783, with the temporary ranks of major and lieutenant-colonel.\n\n", "link_mentions": [{"page": "1826", "response": ["* August 2 – George Finch, 9th Earl of Winchilsea, English cricketer (b. 1752)"]}, {"page": "1752", "response": ["** George Finch, 9th Earl of Winchilsea, English cricketer (d. 1826)"]}, {"page": "Earl of Winchilsea", "response": ["*George Finch, 9th Earl of Winchilsea, 4th Earl of Nottingham (1752–1826)"]}, {"page": "Marylebone Cricket Club", "response": ["This gentlemen's club, which was multi-purpose, had a social meeting place at the Star and Garter on Pall Mall. It was the same club that was responsible for drafting the Laws of Cricket at various times, most notably in 1744 and 1774, and this lawgiving responsibility was soon to be vested in the MCC as the final repose of these cricketing gentlemen. When the White Conduit began, its leading lights were George Finch, 9th Earl of Winchilsea (1752–1826) and the Hon. Colonel Charles Lennox (1764–1819), who later succeeded as the 4th Duke of Richmond. White Conduit was nominally an exclusive club that only \"gentlemen\" might play for, but the club did employ professionals and one of these was the bowler Thomas Lord, a man who was recognised for his business acumen (he became a successful wine and provisions merchant) as well as his bowling ability.Haygarth, p. 70.Birley, p. 47"]}, {"page": "Daniel Finch, 2nd Earl of Nottingham", "response": ["**William Finch (169025 December 1766), who married Charlotte Fermor, a daughter of Thomas Fermor, 1st Earl of Pomfret, by whom he had issue including Sophia Finch and her younger brother George Finch, 9th Earl of Winchilsea."]}, {"page": "Royal Institution", "response": ["*1799 – George Finch, 9th Earl of Winchilsea"]}, {"page": "Lord's", "response": ["Acting on behalf of members of the White Conduit Club and backed against any losses by George Finch, 9th Earl of Winchilsea and Colonel Charles Lennox, Thomas Lord opened his first ground in May 1787 on the site where Dorset Square now stands, on land leased from the Portman Estate. The White Conduit moved there from Islington, unhappy at the standard of the ground at White Conduit Fields, soon afterwards and reconstituted themselves as Marylebone Cricket Club (MCC). It was thought that the establishment of a new ground would offer more exclusivity to its members, with White Conduit Fields considered too far away from fashionable Oxford Street and the West End. The first match played at the new ground saw Middlesex play Essex. In 1811, feeling obliged to relocate because of a rise in rent, Lord removed his turf and relaid it at his second ground. This was short-lived because it lay on the route decided by Parliament for the Regent's Canal, in addition to the ground being unpopular with patrons."]}, {"page": "List of knights and ladies of the Garter", "response": ["| George Finch, 9th Earl of Winchilsea"]}, {"page": "Thomas Lord", "response": ["In 1786 Thomas Lord was approached by George Finch, 9th Earl of Winchilsea, and Charles Lennox, 4th Duke of Richmond, who were the leading members of the White Conduit Club.  They wanted Lord to find a more private venue for their club and offered him a guarantee against any losses he might suffer. In May 1787, Lord acquired seven acres (28,000 m²) off Dorset Square and started his first ground.  White Conduit relocated there and soon afterwards formed, or merged into, the new Marylebone Cricket Club (MCC)."]}, {"page": "Daniel Finch, 8th Earl of Winchilsea", "response": ["He died in 1769 and was buried at Eastwell Church, near his residence. As he died without male issue his titles, together with his estates at Burley and elsewhere, passed to his nephew George Finch, 9th Earl of Winchilsea, the son of his brother the diplomat William Finch. He left his Kentish properties, including Eastwell Park, to his other nephew George Finch-Hatton, son of his brother Edward Finch."]}, {"page": "Groom of the Stool", "response": ["*1804–1812: George Finch, 9th Earl of Winchilsea"]}, {"page": "Burley, Rutland", "response": ["George Finch, 9th Earl of Winchilsea, lived at the mansion in the late 18th century and used its grounds to stage a number of cricket matches, six of them first-class, between 1790 and 1793.List of matches As late as 1814, the venue was used for a Rutland v Nottingham game."]}, {"page": "Broadhalfpenny Down", "response": ["The 1772 season is notable in English cricket history because it is from then that surviving scorecards are common and three exist of 1772 matches organised by the Hambledon Club which commence a continuous statistical record. Those three matches were all between a Hampshire XI and an England XI, the first played at Broadhalfpenny on 24 and 25 June. The two leading online archives begin their first-class coverage with this match which is numbered \"first-class no.1\" by ESPNcricinfo and \"f1\" by CricketArchive.alt=Cricket pavilion with players watching on a summers day|thumb|Broadhalfpenny Down Pavilion in Summer 2019On 13 July 1775, Small scored 136 not out and Nyren 98 for Hampshire against Surrey at Broadhalfpenny and Small's innings is the earliest known century in first-class cricket.Underdown, p. 112. Despite being ordained, a Steward of the Hambledon Club and a member of the Laws of Cricket committee, the Reverend Charles Powlett was not above gambling on the outcome of matches or of betting against his own team. At one point in the match against Surrey, the situation was such that a Surrey victory seemed certain. Powlett and his associate Philip Dehaney, another Hambledon member, decided to bet heavily on Surrey to win. Then Small was joined at the wicket by his captain Nyren and the two put on a massive century partnership which turned the game around, for Surrey collapsed and Hampshire won a famous victory. When Nyren was out, he was confronted by Powlett and Dehaney who complained that he and Small had cost them their money. Nyren, disgusted with them, retorted: \"Another time, don't bet your money against such men as we are.\"Underdown, p. 118.alt=Batsman hits out in front of the Bat & Ball public house|thumb|Batsman hits out in front of the Bat & Ball public houseBroadhalfpenny Down continued in regular use by Hambledon/Hampshire teams until 1781. At the end of that season, the Hambledon Club moved to Windmill Down, which is closer to the village. According to John Nyren, Windmill was \"one of the finest places for playing on I ever saw\".Underdown, p. 152. A key difference was that Windmill was under the club's control as they rented it from a farmer at ten guineas a year, whereas Broadhalfpenny was common land in use as sheep pasture, for fairs and other gatherings. It could be said that Broadhalfpenny belonged to the community and Windmill to the club, whose members may not have been happy about the \"raucous, boisterous crowds that gathered (on the Down)\". The move was done at the behest of the Duke of Dorset, chief among club members, and David Underdown saw it as the first step in a process which removed professional cricket from a truly rural setting and ultimately concentrated it in an urban environment, for it was Dorset's successors George Finch, 9th Earl of Winchilsea and Colonel Charles Lennox who were the key players in the establishment of the White Conduit Club in Islington and subsequently Marylebone Cricket Club at Lord's.Underdown, p. 153."]}, {"page": "Billy Beldham", "response": ["In his reminiscences to James Pycroft in 1836, Beldham said that, when he was eighteen years old in the 1784 season, he had played for Farnham against Hambledon and scored 43 runs.Underdown, p. 157. He was watched by George Finch, 9th Earl of Winchilsea who was cricket's most influential patron at the time and, the following spring, Winchilsea visited Beldham at the farm where he worked and arranged with his employer for him to have time off in order to play cricket. Beldham was invited to play for Hampshire in June 1785 against All-England at White Conduit Fields, the start of his career in top-class cricket."]}, {"page": "Lord Lieutenant of Rutland", "response": ["*George Finch, 9th Earl of Winchilsea 12 April 1779 – 2 August 1826"]}, {"page": "White Conduit Club", "response": ["The most significant members of the club were Charles Lennox, 4th Duke of Richmond and George Finch, 9th Earl of Winchilsea who employed Lord to find a new, private venue for the club after complaints that White Conduit Fields was too open to the public. Famous players who represented WCC include the professionals John Small, Lumpy Stevens, Tom Taylor and Tom Walker. Records of many WCC matches are known to have been lost when the Lord's Pavilion burned down in 1825 and only 13 matches between 1784 and 1788 are known today.", "It is not known for certain when the WCC was founded but it seems to have been after 1780 and certainly by 1785. According to Pelham Warner, it was formed in 1782 as an offshoot from a West End convivial club called the Je-ne-sais-quoi, some of whose members frequented the White Conduit House in Islington and played matches on the neighbouring White Conduit Fields.Warner, p. 17. The famous batsman Billy Beldham was hired while still a young professional by the WCC in 1785 and he told James Pycroft, author of The Cricket Field (1851) that his farming employer concluded a deal with George Finch, 9th Earl of Winchilsea to allow Beldham time away from his agricultural duties to go to the \"new cricket ground\" at White Conduit Fields and play for Hampshire (or more accurately, the Hambledon Club) against All-England. The score of this match has evidently been lost because there is no trace of an All-England v Hampshire game at White Conduit Fields in or about 1785.", "| George Finch, 9th Earl of Winchilsea (MCC) "]}, {"page": "Thomas Assheton Smith (1752–1828)", "response": ["Thomas Assheton Smith was a keen sportsman and was particularly noted for his involvement in cricket.  He was a close friend of George Finch, 9th Earl of Winchilsea and became one of cricket's main patrons following the establishment of Marylebone Cricket Club (MCC) in 1787.  Smith was not a good player, unlike his son, but is known to have taken part in 45 major matches between the 1787 and 1796 seasons.  In the contemporary scorecards, he is generally shown as \"A Smith, Esq.\" whereas his son was usually recorded as \"T A Smith, Esq.\"."]}, {"page": "Peter Burrell, 1st Baron Gwydyr", "response": ["A keen amateur cricketer, Burrell has been called the third most influential member of the White Conduit Club and of the early MCC, after George Finch, 9th Earl of Winchilsea and Charles Lennox, 4th Duke of Richmond. he played in seven matches which have been awarded first-class cricket status between 1787 and 1790.Peter Burrell, CricInfo. Retrieved 2 August 2021. In a non-first-class match for White Conduit Club against the Gentlemen of Kent at White Conduit Fields in 1785 he scored 97 runs in an innings."]}, {"page": "1787 English cricket season", "response": ["During 1786, Thomas Lord had been approached to establish his first ground at Dorset Fields in the Marylebone area of London,Lord's Old Ground, CricInfo. Retrieved 23 November 2019. leasing land from the Portman Estate and fencing it off.The man behind the ground, Wisden Cricketers' Almanack, 1955, at CricInfo. Retrieved 23 November 2019. Lord was backed financially by George Finch, 9th Earl of Winchilsea and Charles Lennox, 4th Duke of Richmond, leading members of the White Conduit Club, an aristocratic club based in Islington.Birley D (1999) A Social History of English Cricket, p.47. London: Aurum Press. The ground opened in May 1787 with White Conduit playing matches on the ground. The club are also believed to have used it as a practice ground. The first match on the ground to be considered first-class cricket was played at the end of May between a Middlsex XI and one from Essex.Fay S (2006) The Lord's testament, CricInfo. Retrieved 23 November 2019."]}, {"page": "1797 English cricket season", "response": ["Four matches saw the George Finch, 9th Earl of Winchilsea's XI play a side organised by Charles Lennox. In one of these Winchelsea is reported to have attempted to introduce a fourth stump and to increase the height of the stumps by two inches. The following year saw a new version of the Laws of Cricket introduced which raised the height of the stumps but did not introduce a fourth stump.C Lennox's XI v Earl of Winchilsea's XI, CricketArchive. Retrieved 2020-12-07. C Lennox's XI v Earl of Winchilsea's XI, CricInfo. Retrieved 2020-12-07."]}, {"page": "John Willes (cricketer)", "response": ["In fact, as Beldham confirmed, roundarm bowling was first devised back in Hambledon days by the wily Tom Walker but he was barred from using it in matches by the patrons of the day, including George Finch, 9th Earl of Winchilsea."]}, {"page": "George Finch", "response": ["* George Finch, 9th Earl of Winchilsea (1752–1826), politician"]}, {"page": "1826 in the United Kingdom", "response": ["* 2 August – George Finch, 9th Earl of Winchilsea, cricketer (born 752)"]}, {"page": "Lords and Gentlemen of the Bedchamber", "response": ["*1777–1812: George Finch, 9th Earl of Winchilsea"]}, {"page": "George Finch-Hatton, 10th Earl of Winchilsea", "response": ["George William, the elder son, was educated at Westminster School and Christ's College, Cambridge, where he proceeded B.A. in 1812. On 13 October 1809 he became a captain in the Ashford regiment of Kentish local militia, on 14 December 1819 commenced acting as a lieutenant of the Northamptonshire regiment of yeomanry, and on 7 September 1820 was named a deputy-lieutenant for the county of Kent. His cousin, George Finch, 9th Earl of Winchilsea and fourth earl of Nottingham, having died on 2 August 1826, he succeeded to these peerages."]}]}}