{"wiki_id": "http://www.wikidata.org/entity/Q15076995", "itemLabel": "Thomas Bevill Peacock", "itemDescription": "English physician", "wikipedia_url": "https://en.wikipedia.org/wiki/Thomas_Bevill_Peacock", "wikipedia_page": {"main": "Thomas Bevill Peacock (21 December 1812 – 31 May 1882) was a cardiologist in London remembered for founding the London Chest Hospital. He also made a large contribution to the understanding of aortic dissection by publishing several case series on the condition.", "link_mentions": [{"page": "Aortic dissection", "response": ["The earliest fully documented case of aortic dissection is attributed to Frank Nicholls in his autopsy report of King George II of Great Britain, who had been found dead on 25 October 1760; the report describes a dissection of the aortic arch and into the pericardium. The term \"aortic dissection\" was introduced by the French physician J.P. Maunoir in 1802, and René Laennec labeled the condition \"dissecting aneurysm\". London cardiologist Thomas Bevill Peacock contributed to the understanding of the condition by publishing two series of the cases described in the literature so far: 19 cases in an 1843 review, and 80 in 1863. The characteristic symptom of tearing pain in the chest was recognized in 1855 when a case was diagnosed in life."]}, {"page": "Hunterian Society", "response": ["* 1868–69 Thomas Bevill Peacock"]}, {"page": "London Chest Hospital", "response": ["The London Chest Hospital was founded on 13 March 1848 by a group of men, predominantly Quakers, who included bankers, merchants and the physician, Thomas Bevill Peacock. They wished to build a hospital to deal with diseases of the heart and lungs, particularly tuberculosis. By June the group, with the patronage of Prince Albert, had raised enough money to open a public dispensary at 6 Liverpool Street, while the hospital was being built. In 1849 a site in Bonner's Fields, part of Victoria Park was purchased and in 1851 Prince Albert laid the foundation stone. The Hospital opened in 1855 at a cost of around £30,000."]}, {"page": "Thomas Peacock", "response": ["* Thomas Bevill Peacock (1812–1882), English physician"]}, {"page": "Thomas B. Peacock", "response": ["#REDIRECT Thomas Bevill Peacock"]}, {"page": "Thomas B Peacock", "response": ["#Redirect Thomas Bevill Peacock"]}]}}