{"wiki_id": "http://www.wikidata.org/entity/Q15072677", "itemLabel": "Katherine Jakeways", "itemDescription": "British comedian", "wikipedia_url": "https://en.wikipedia.org/wiki/Katherine_Jakeways", "wikipedia_page": {"main": "Katherine Jakeways is a British comedian, actor and writer. She has appeared in multiple television, radio and theatrical productions.", "link_mentions": [{"page": "QI", "response": ["Since 10 February 2007, a weekly QI column has run in The Daily Telegraph newspaper. Fifty-two columns were planned, originally alphabetically themed like the TV series and running from A to Z twice, but the feature is ongoing and was recently re-launched in the newspaper's Saturday magazine and online. A QI feature has appeared in BBC MindGames magazine since its fifth issue, and revolves around facts and questions in the General Ignorance-mould. A weekly QI-linked multiple-choice question is featured in Radio Times, with the solution printed in the feedback section. QI also has an official website, QI.com, which features facts, forums and other information. It also links to QIs internet show QI News, a parody news show which broadcasts \"News\" items about things which are \"quite interesting\". QI News stars Glenn Wrage and Katherine Jakeways as the newsreaders, Bob Squire and Sophie Langton."]}, {"page": "The Hand of Ethelberta", "response": ["It was adapted for BBC Radio 4 by Katherine Jakeways. The one-hour play was released just before International Women's Day 2021, as part of a series on Hardy's women."]}, {"page": "Footballers' Wives", "response": ["Footballers Wives TV is a spin-off mockumentary comedy series that was broadcast to tie-in with the original broadcast of the fourth series of Footballers Wives. It aired on Thursdays at 10:30pm on ITV2 and only lasted for one series of eight episodes. The series was loosely based on the book How to be a Footballer's Wife and centred on a chat show presented by Katherine Jakeways and Glenn Hugill as TV presenters Gary Fox and Lorna Miller. Characters from Footballers' Wives appeared in interviews as did parody celebrities."]}, {"page": "Rosie Cavaliero", "response": ["* Where This Service Will... BBC Radio 4 – Afternoon Play (2016 thru till 2020) – five episodes by Katherine Jakeways"]}, {"page": "Deep Trouble (radio comedy series)", "response": ["It takes place in the year 2012, aboard HMS Goliath, a Royal Navy stealth nuclear submarine, and follows the trials and tribulations of the submarine's chaotic crew, underneath their inept commanding officer, Captain Paul Wade (played by Jim Field Smith) and his officers Lieutenant Trainor, Weapons Officer (played by Ben Willbond), Commander Alison Fairbanks, second-in-command (played by Katherine Jakeways).  The series has also included a fourth regular character - in season one only this was the innocently seductive Petty Officer Lucy Radcliffe (played by Miranda Raison) and in season two this was Alice Barry, Computer and Weapons Expert (played by Alice Lowe) who was - in contrast to her predecessor - grumpy and uncooperative unless given incentive, but also an expert it most fields.", "*Katherine Jakeways - Fairbanks"]}, {"page": "28 Acts in 28 Minutes", "response": ["* Katherine Jakeways"]}, {"page": "Trafficlink", "response": ["* Katherine Jakeways"]}, {"page": "Parsons and Naylor's Pull-Out Sections", "response": ["| text-align:center\" | 14 AprilLucy Porter|| 21 AprilJackie Clune|| 28 AprilKatherine Jakeways || 5 May(Election Special)Lucy Porter || 12 May || 19 May || 26 May ||"]}, {"page": "QI News", "response": ["QI News was a five-minute long show which reported \"quite interesting\" things from around the world. It was presented by two newsreaders, brash American Bob Squire (Glenn Wrage) and female Cambridge British co-anchor Sophie Langton (Katherine Jakeways). Other contributions were sometimes provided by correspondent Graham Prince (Robert Meakin). Off-screen, the Producer (Voice of Alexander McConnell) tried to keep Squire and Langton in order."]}, {"page": "Look Away Now", "response": ["Look Away Now is a BBC Radio 4 sports-based comedy series presented by Garry Richardson (the Today programme's sports reporter). The programme takes the form of a sports news programme and mocks many aspects of such programmes. The cast also includes Laurence Howarth, Katherine Jakeways, Dave Lamb, Richie Webb and Mark Evans. Most of the show is composed of \"interviews\" with important sporting figures and satire based on sporting news. There is also a sport related song performed by Richie Webb. Other regular sketches include a panel of ex-professional footballers watching various non sport related programmes on TV monitors and the \"Rant-line\" which is supposedly open to the public to complain about sport but in fact is mainly filled with messages from people interviewed on the programme."]}, {"page": "The First Men in the Moon (2010 film)", "response": ["The First Men in the Moon, also promoted as H. G. Wells' The First Men in the Moon, is a 2010 television drama written by Mark Gatiss, directed by Damon Thomas, that stars Gatiss as Cavor and Rory Kinnear as Bedford, with Alex Riddell, Peter Forbes, Katherine Jakeways, Lee Ingleby and Julia Deakin. The First Men on the Moon was first broadcast on 19 October 2010 on BBC Four. It is an adaptation of H. G. Wells' 1901 science fiction novel of the same name. This is the third collaboration between Thomas and Gatiss (after The Worst Journey in the World and Crooked House), and the first film to be produced by their production company Can Do Productions.", "* Katherine Jakeways as Mum"]}, {"page": "North by Northamptonshire", "response": ["North by Northamptonshire is a BBC Radio 4 comedy, written by Katherine Jakeways, that takes place in Northamptonshire. The first series was transmitted in the summer of 2010, the second series in December 2011 and January 2012 and the third series in December 2013 and January 2014. Series 1 was produced by Claire Jones, series 2 by Victoria Lloyd and Series 3 by Steven Canny.", "*Esther: Katherine Jakeways"]}, {"page": "Me and Mrs Jones (TV series)", "response": ["* Katherine Jakeways – Caroline"]}, {"page": "Buy Me Up TV", "response": ["Buy Me Up TV is a BBC Radio 2 sitcom set behind the scenes of a 24-hour shopping channel. It was written by James Eldred and Justin Edwards. A pilot episode aired in March 2007, with a further four episodes following in March 2008. It starred Justin Edwards, Katherine Jakeways, Alex MacQueen, Greg Proops, Ewen MacIntosh, Colin Hoult.", "* Katherine Jakeways as Angela Bassett"]}, {"page": "Crackanory", "response": ["Live action actors in the series included Alex Macqueen, Cariad Lloyd, Katherine Jakeways, James Bachman, Martha Howe-Douglas, Nick Mohammed, Vera Filatova, Cassie and Connie Powney", "* Mel Giedroyc \"Proxy Lady\" by Katherine Jakeways"]}, {"page": "Horrible Histories (2009 TV series)", "response": ["!scope=\"row\"| Katherine Jakeways"]}, {"page": "Trying Again", "response": ["* Katherine Jakeways as Paula, couples therapist"]}, {"page": "Alan Davies: As Yet Untitled", "response": ["| Katherine Jakeways, Lee Mack, Nick Helm and Olivia Lee"]}, {"page": "Horrible Histories (2015 TV series)", "response": ["!scope=\"row\"| Katherine Jakeways (Series 6)", "*Katherine Jakeways (Series 6)"]}, {"page": "Lee Ridley (comedian)", "response": ["In 2018, Ridley took a starring role on Radio 4 sitcom Ability, which he co-wrote with the writer and comedian Katherine Jakeways (series 1 and 2) and Kat Butterfield and Daniel Audritt (series 3). His role involved playing the disabled 'Matt', who moves out from his parents' home to share with his best friend from school, who refreshingly treats him as an equal but is not the influence Matt's concerned parents are looking for. In June 2018, Ridley won the 12th series of Britain's Got Talent after successfully making it through the audition stages, and winning the show by the public vote. In February 2019, Ridley appeared in one episode of the BBC Three television series, Jerk."]}, {"page": "Tracey Ullman's Show", "response": ["* Katherine Jakeways"]}, {"page": "Guy Masterson", "response": ["In 2005, Masterson directed the most successful ever theatre production at the Edinburgh Fringe Festival, The Odd Couple by Neil Simon starring comedians Bill Bailey, Alan Davies, Phil Nichol, Owen O'Neill, Dave Johns, Ian Coppinger, Katherine Jakeways and Lizzie Roper. This production sold a capacity 850 seats a day at the Assembly Hall for the full run of the Festival."]}, {"page": "Tracey Breaks the News", "response": ["* Katherine Jakeways"]}, {"page": "Pilot (Tracey Breaks the News)", "response": ["* Katherine Jakeways as Various"]}, {"page": "I May Destroy You", "response": ["* Katherine Jakeways as Jacki"]}]}}