{"wiki_id": "http://www.wikidata.org/entity/Q15070164", "itemLabel": "John Askew", "itemDescription": "cricketer (1908-1942)", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Askew", "wikipedia_page": {"main": "John Garbutt Askew (2 September 1908 – 31 August 1942) was an English rugby player and first-class cricketer. In rugby, Askew played as a fullback, while in cricket he played as a right-handed batsman. He was born at Gateshead, County Durham.\nAskew was educated at Durham School. He made his debut in county cricket for Durham against Northumberland in the 1928 Minor Counties Championship. He played Minor counties cricket for Durham from 1928 to 1931, making eight appearances. He later attended Emmanuel College, Cambridge, where he made two first-class appearances for Cambridge University Cricket Club in 1931, against Sussex and the touring New Zealanders. He scored a total of 30 runs at an average of 7.50 in his two appearances, with a high score of 11.In rugby union, Askew played club rugby for Durham City from 1925 to 31, Durham County from 1926 to 31, and Cambridge University from 1929 to 1931. He also appeared for the Barbarians. Askew was capped by England three times, playing in the 1930 Five Nations Championship against Wales, Ireland and France.In 1932, he was serving in the Colonial Service in Nyasaland, but was invalided home. He was also a member of the Durham Light Infantry, in which he held the rank of second lieutenant. Between 1933 and 1937, he was in business with his father, while in 1937 he went to South Africa, where he spent a year farming. In 1939, he had returned to England and was in business in Newcastle. He died at Stannington, Northumberland, on 31 August 1942.\n\n", "link_mentions": [{"page": "Askew", "response": ["*John Askew (1908–1942), English rugby and cricket player"]}, {"page": "List of Old Dunelmians", "response": ["* John Askew (1908–1942), cricketer and England rugby union international."]}, {"page": "List of cricket and rugby union players", "response": ["| John Askew"]}, {"page": "List of Essential Mix episodes", "response": ["| 11 February|| John Askew "]}, {"page": "List of England national rugby union players", "response": ["|653||John Askew||fullback ||1930-01-18||v Wales at Cardiff"]}, {"page": "Jack Askew", "response": ["#REDIRECT John Askew"]}, {"page": "The Delines", "response": ["The Delines were formed when singer Amy Boone was touring with Richmond Fontaine and singing the female parts from that band's 2003 album, Post to Wire, which had been performed by her sister Deborah Kelly. Kelly and Boone had been in the Texas band the Damnations.  Vlautin then formed the Delines, centred on Boone's evocative world-weary and vulnerable vocals. They gathered in Portland, Oregon with producer John Askew to cut the band's debut album, Colfax. The songs on  Colfax, which was released in June 2014, combined Vlautin's admired lyrics about characters from the America's hinterland and their everyday struggles, with Boone's vocals, the emotion of which wrings out the pain of the characters. Colfax was well received by the critics and scored 87 on Metacritic with seven positive reviews.", "*John Askew – baritone guitar"]}, {"page": "Askew, John", "response": ["#redirectJohn Askew"]}]}}