{"wiki_id": "http://www.wikidata.org/entity/Q15110696", "itemLabel": "Dave Okumu", "itemDescription": "British-Austrian singer", "wikipedia_url": "https://en.wikipedia.org/wiki/Dave_Okumu", "wikipedia_page": {"main": "David Jairus Ochieng Okumu (born 12 October 1976 in Vienna, Austria) is a singer, songwriter, producer and guitarist, best known for fronting the band The Invisible. Their debut album, released in March 2009, was nominated for a Mercury Prize (2009) and selected as 'iTunes album of the year'.Okumu grew up in Vienna, surrounded by music enthusiasts. He relocated with his family to the UK when he was 10. His love of music, which developed from a young age, has led him to become a songwriter, producer and performing musician. He has performed and recorded with many artists such as Robert Miles, Amy Winehouse, St. Vincent, Rosie Lowe, Jane Birkin, Sara Creative Partners, Brigitte Fontaine, Theo Parrish, Tony Allen, King Sunny Adé, Omar, Matthew Herbert, Dani Siciliano, Toddla T, Bilal, Jack De Johnette, and Anna Calvi.Okumu began working with Jessie Ware in 2010 where he co-wrote and produced Ware's debut album Devotion, which was later nominated for Album of the Year (2012) by the Mercury Prize.", "link_mentions": [{"page": "Ed O'Brien", "response": ["O'Brien's debut solo album, Earth, was released on 17 April 2020 on Capitol Records to positive reviews. It features drummer Omar Hakim, Invisible members Nathan East and Dave Okumu, folk singer Laura Marling, Portishead guitarist Adrian Utley, Wilco drummer Glenn Kotche and Radiohead bassist Colin Greenwood. The music was inspired by O'Brien's time living in Brazil and attending Carnival, which he described as a \"musical eureka moment\". The first track, \"Brasil\", was released on 5 December 2019, followed by \"Shangri-La\" on 6 February. O'Brien began a North American tour in February 2020; a larger Earth tour was cancelled due to the COVID-19 pandemic. O'Brien contributed a remix of Paul McCartney's song \"Slidin'\" to the remix album McCartney III Imagined (2021)."]}, {"page": "Maxïmo Park", "response": ["On 15 November 2013, Maxïmo Park announced the forthcoming release of their fifth album. Titled Too Much Information, the album was released on 3 February 2014. Of the album, Smith said, \"Our lyrics and our music will never be too-cool-for-school - we are an emotional band even if it might be too much information for some.\" The album was recorded by Duncan Lloyd and produced by the band, with additional production by The Invisible's Dave Okumu on the track Brain Cells. Recording originally started as an EP of 5 tracks in Sunderland, with help from Field Music's David and Peter Brewis, before turning into a fully formed album with the extra tracks recorded in the band's studio in Newcastle."]}, {"page": "Tony Allen (musician)", "response": ["in 2021, two posthumous albums were released, There Is No End, a solo album, and The Solution Is Restless, a collaborative album between Joan As Police Woman and Dave Okumu.", "|Dave Okumu, Joan As Police Woman, & Tony Allen"]}, {"page": "Kid Harpoon", "response": ["| Dave Okumu", "| Jessica WareDave Okumu", "| Dave Okumu", "| Dave Okumu"]}, {"page": "The Invisible (band)", "response": ["The Invisible are an English band, fronted by the singer and guitarist Dave Okumu. The band formed as Okumu's solo project but quickly developed into a full-fledged band with friends Tom Herbert (bass, keyboards) and Leo Taylor (drums). Their self-titled debut album, released on 9 March 2009, was nominated for the Mercury Prize and selected as critics choice for iTunes album of the year.", "The band's tongue-in-cheek definition of their style of music is 'Experimental Genre-Spanning Spacepop'. They have been compared to bands such as Bloc Party and TV on the Radio, even though Dave Okumu has strongly denied knowledge of the latter of these.", "The Invisible's second album, Rispah was released on Ninja Tune in August 2012, having been recorded in Brighton - with producer Richard File.  The album's first single \"Protection\" was premiered through online music magazine, The Quietus. Rispah was named after frontman Dave Okumu's mother, Rispah Achieng Okumu, who died during the making of the second album. ", "Outside of the band endeavours, members have embarked on production and session work. Dave Okumu has co-written and produced South London singer Jessie Ware's debut album, Devotion, which was later recognised as Album of the Year (2012) by the Mercury Prize.\"Jessie Ware\" Mercury Prize, [retrieved on 22/04/2013] Okumu has performed and recorded with many artists such as Amy Winehouse, St. Vincent, Jane Birkin, Sara Creative Partners, Brigitte Fontaine, Theo Parrish, Tony Allen, King Sunny Adé, Omar, Matthew Herbert, Dani Siciliano, Toddla T, Bilal, Jack De Johnette, Róisín Murphy, Rosie Lowe and Anna Calvi.\"Dave Okumu\" Universal Music Publishing Group, [retrieved on 22/04/2013] Tom Herbert continues to play as part of post-jazz band Polar Bear; Leo Taylor has contributed drums for Jessie Ware's second single \"Running\", Kate Nash's album \"Made of Bricks\", Kano's album \"Home Sweet Home\" and Adele's second album 21, including its leading single \"Rolling In The Deep\"."]}, {"page": "Kwes", "response": ["| Production, co-write w/ Dave Okumu and Rosie Lowe", "| Production, co-write w/ Dave Okumu and Rosie Lowe"]}, {"page": "Jamie Woon", "response": ["| Dave Okumu"]}, {"page": "Anna Calvi", "response": ["Calvi co-produced the album with long-term PJ Harvey collaborator Rob Ellis. Brian Eno sang backing vocals on Desire and Suzanne & I, Dave Okumu from the band The Invisible sang backing vocals on the song No More Words, and long-term collaborator Emma Nathan created the album artwork. \"I see music quite visually and I like to create atmospheres... I like to try and create a whole world in the space of a song,\" explained Calvi. In an interview with  The Daily Telegraph Calvi said of writing the album \"'I imagine the different instruments as colours, and so it feels like painting. I need music to come from a really emotional place. With my music I do like to hypnotise people and take them somewhere else. I like to slowly draw people into a world.\"", "In December 2014, Calvi performed a one-off show with the innovative and eclectic Heritage Orchestra, conducted by Jules Buckley. New orchestral versions of tracks from her previous releases were performed at St John's Church in Hackney, London. The concert was a sold-out event which also saw guest appearances from Patrick Wolf and Charlie Fink from Noah and the Whale, and Dave Okumu producer and musician from the band Invisible. Calvi had also worked with the Heritage Orchestra previously on the Giorgio Moroder show at the Sydney Opera House.", "In March 2016, Calvi was part of the Pieces of a Man: The Gil Scott-Heron Project, \"a celebration of the life and legacy of the legendary American soul and jazz poet, musician, and author\" in conjunction with Convergence Festival in London. Under the direction of The Invisible's Dave Okumu, an ensemble of guest vocalists and poets, including Andreya Triana, Kwabs and Jamie Woon performed reinterpretations of Scott-Heron's music. \"Anna Calvi delivered a menacing rock-opera take on 'Me and the Devil'\". In July 2016, Calvi and Jherek Bischoff performed \"Lady Grinning Soul\" at the BBC Proms David Bowie special."]}, {"page": "Thirteen (Robert Miles album)", "response": ["* Dave Okumu – electric guitar"]}, {"page": "Devotion (Jessie Ware album)", "response": ["Devotion is the debut studio album by British singer-songwriter Jessie Ware. It was released in the United Kingdom on 20 August 2012 through PMR Records and Island, and later on 16 April 2013 through Cherrytree and Interscope in the United States. Production for the album came primarily from Dave Okumu of alternative rock band The Invisible, alongside house Record producer Julio Bashmore and Kid Harpoon with contribution from Wilma Archer, fellow UK musician and collaborator Sampha and Hassan Hamandi, while Ware co-wrote most of the album tracks' lyrics. The album was re-released under the title \"Devotion – The Gold Edition\" on 15 April 2013 in the United Kingdom, containing a bonus disc with four tracks, including a new single, \"Imagine It Was Us\" and \"Valentine\" – a previously-released collaboration with musician Sampha in 2011. One day later, this version was released in the United States under its original title with a slightly different track list, omitting the latter track while including a remix version of \"Wildest Moments\", which features American rapper A$AP Rocky.", "Except for the fifth track \"No to Love\", which was written and produced solely by Okumu, Ware co-wrote most of the album tracks' lyrics. Production for Devotion came primarily from Dave Okumu of alternative rock band The Invisible, whom produced twelve out of fourteen original recordings used for the album. Fellow British house record producer Julio Bashmore and singer Kid Harpoon also co-produced along with Okumu, with Bashmore handling solely the production of \"110%\" and Wilma Archer co-producing the eleventh track \"Something Inside\". Fellow UK musician and collaborator Sampha and Hassan Hamandi also contributed to two songs from the deluxe edition of the album, namely \"Strangest Feeling\" and \"What You Won't Do for Love\", with the former being released digitally on 14 October 2011 and the latter being premiered on 22 May 2012. Sampha was also credited as a collaborator on \"Valentine\", a song released previously on 14 February 2011 with Ware. The song was partly inspired by James Blake's song \"The Wilhelm Scream\" and based on both Ware and Sampha's own personal experiences in love.", "*Dave Okumu – synthesizer, bass, guitar, piano, drums, keyboards, background vocals, rap, finger snapping", "*Dave Okumu – composer, programming, producer, engineer, cello arrangement"]}, {"page": "A Perfect Contradiction", "response": ["*Dave Okumu – producer, instrumentation"]}, {"page": "Too Much Information (album)", "response": ["The album also included production contributions from Dave Okumu from The Invisible and was mixed by Nicolas Vernhes who previously worked with Deerhunter on Monomania. B-sides from the album campaign include \"A Vague Implication\" (from \"Leave This Island\") and \"When I'm Alone\" (from \"Midnight On The Hill\")."]}, {"page": "Tough Love (Jessie Ware album)", "response": ["At the beginning of 2014, Ware returned to the studio to write her second album. Ed Sheeran confirmed in an interview with Daily Star that they had written a song together for the new album. (The song, \"Say You Love Me\", was released on 13 August 2014.) \"Tough Love\" is the first single to be taken from the new album, airing for the first time on BBC Radio 1 as \"Hottest Record\" during the Zane Lowe's show and slated for a UK release on 3 August 2014. \"Tough Love\" was compared to \"Prince at his minimalist '80s best\" by Pitchfork, who interviewed Ware prior to the release. \"Tough Love\" is produced together with BenZel, the production duo composed of London post-bass producer Two Inch Punch and mega-producer Benny Blanco who Ware previously worked with on the single \"If You Love Me\"; Benzel are also executive producers of her new album. It has been confirmed that Kid Harpoon, Dave Okumu, Julio Bashmore, Miguel, James Ford, Nineteen85, Sam Smith and Ed Sheeran have also worked on the new album.", "*Dave Okumu – bass, drum programming, guitar, keyboards, production, programming, synthesizer, background vocals"]}, {"page": "The Hunger Games: Mockingjay, Part 1 (soundtrack)", "response": ["*Dave Okumu – guitar"]}, {"page": "Fifty Shades of Grey (soundtrack)", "response": ["*Dave Okumu - composer, engineer, instrumentation, producer, programming"]}, {"page": "Jam City", "response": ["| Dave Okumu"]}, {"page": "Okumu", "response": ["*Dave Okumu (born 1976), Austrian musician, songwriter, and producer"]}, {"page": "David Jairus Ochieng Okumu", "response": ["#REDIRECT Dave Okumu"]}, {"page": "Miss Universe (album)", "response": ["* Dave Okumu – guitar , instrumentation , vocals ", "* Dave Okumu – recording "]}, {"page": "Earth (EOB album)", "response": ["Earth is the debut solo album by English musician Ed O'Brien, released under the name EOB. It was released by Capitol Records on 17 April 2020. It was produced by Flood and Catherine Marks and features musicians including drummer Omar Hakim, Invisible members Nathan East and Dave Okumu, folk singer Laura Marling, Portishead guitarist Adrian Utley, Wilco drummer Glenn Kotche and Radiohead bassist Colin Greenwood. "]}, {"page": "What's Your Pleasure?", "response": ["* Dave Okumu – guitar "]}, {"page": "Ooh La La (Jessie Ware song)", "response": ["* Dave Okumu – guitar"]}]}}