{"wiki_id": "http://www.wikidata.org/entity/Q151754", "itemLabel": "Anne, Princess Royal", "itemDescription": "daughter of Queen Elizabeth II and Prince Philip, Duke of Edinburgh", "wikipedia_url": "https://en.wikipedia.org/wiki/Anne,_Princess_Royal", "wikipedia_page": {"main": "Anne, Princess Royal  (Anne Elizabeth Alice Louise; born 15 August 1950), is the second child and only daughter of Queen Elizabeth II and Prince Philip, Duke of Edinburgh. She is 17th in the line of succession to the British throne and has been Princess Royal since 1987.Born at Clarence House, Anne was educated at Benenden School and began undertaking royal duties upon adulthood. She became a respected equestrian, winning one gold medal in 1971 and two silver medals in 1975 at the European Eventing Championships. In 1976, she became the first member of the British royal family to have competed in the Olympic Games.\nThe Princess Royal performs official duties and engagements on behalf of her mother. She holds patronage in over 300 organisations, including WISE, Riders for Health, and Carers Trust. Her charity work revolves around sport, sciences, people with disabilities, and health in developing countries. She has been associated with Save the Children for over fifty years and has visited a number of their projects;  her work resulted in her nomination for the Nobel Peace Prize in 1990.\nAnne married Captain Mark Phillips in 1973; they separated in 1989 and divorced in 1992. The couple have two children, Zara and Peter Phillips, and five grandchildren. Within months of her divorce, Anne married Commander (now Vice Admiral) Sir Timothy Laurence, whom she had met while he served as her mother's equerry between 1986 and 1989.\nIn 1988, Princess Anne became a member of the International Olympic Committee (IOC).", "link_mentions": [{"page": "August 15", "response": ["*  1950   – Anne, Princess Royal of the United Kingdom"]}, {"page": "Act of Settlement 1701", "response": ["The next most senior living descendant of the Electress Sophia who had been ineligible to succeed on this ground is George Windsor, Earl of St Andrews, the elder son of Prince Edward, Duke of Kent, who married the Roman Catholic Sylvana Palma Tomaselli in 1988. His son, Lord Downpatrick, converted to Roman Catholicism in 2003 and is the most senior descendant of Sophia to be barred as a result of his religion. In 2008 his daughter, Lady Marina Windsor, also converted to Catholicism and was removed from the line of succession. More recently, Peter Phillips, the son of Anne, Princess Royal, and eleventh in line to the throne, married Autumn Kelly; Kelly had been brought up as a Roman Catholic, but she converted to Anglicanism prior to the wedding. Had she not done so, Phillips would have forfeited his place in the succession upon their marriage, only to have it restored in 2015."]}, {"page": "Harry Secombe", "response": ["Secombe died on 11 April 2001 at the age of 79, from prostate cancer, in hospital in Guildford, Surrey. His ashes are interred at the parish church of Shamley Green, and a later memorial service to celebrate his life was held at Westminster Abbey on 26 October 2001. As well as family members and friends, the service was also attended by Charles, Prince of Wales and representatives of Prince Philip, Duke of Edinburgh, Anne, Princess Royal, Princess Margaret, Countess of Snowdon and Prince Edward, Duke of Kent. On his tombstone is the inscription: \"To know him was to love him.\""]}, {"page": "International Olympic Committee", "response": ["| IOC Members Election Commission || Anne, Princess Royal || "]}, {"page": "1948", "response": ["** Mark Phillips, British army captain, equestrian and first husband of Anne, Princess Royal"]}, {"page": "1955", "response": ["** Sir Timothy Laurence, English vice admiral and second husband of Anne, Princess Royal"]}, {"page": "British royal family", "response": ["*The core of the royal family is made up of Queen Elizabeth II; Charles, Prince of Wales; Camilla, Duchess of Cornwall; Prince William, Duke of Cambridge; Catherine, Duchess of Cambridge; Anne, Princess Royal; Prince Edward, Earl of Wessex; and Sophie, Countess of Wessex. They carry out royal duties full-time."]}, {"page": "Queen Elizabeth The Queen Mother", "response": ["|| Anne, Princess Royal || Peter PhillipsZara Tindall"]}, {"page": "George VI", "response": ["| Prince Philip, Duke of Edinburgh || Charles, Prince of WalesAnne, Princess RoyalPrince Andrew, Duke of YorkPrince Edward, Earl of Wessex"]}, {"page": "Dunblane massacre", "response": ["Two days after the shooting, a vigil and prayer session was held at Dunblane Cathedral which was attended by people of all faiths. On Mothering Sunday, on 17 March, Queen Elizabeth II and her daughter Anne, Princess Royal, attended a memorial service at Dunblane Cathedral."]}, {"page": "Prince Philip, Duke of Edinburgh", "response": ["In the summer of 1946, the King granted Philip permission to marry Elizabeth. Before the official announcement of their engagement in July 1947, Philip relinquished his Greek and Danish royal titles and styles, became a naturalised British subject, and adopted his maternal grandparents' surname Mountbatten. He married Elizabeth on 20 November 1947. The day prior to their wedding, the King granted Philip the style His Royal Highness. On the day of their wedding, he was additionally created Duke of Edinburgh, Earl of Merioneth, and Baron Greenwich. Philip left active military service when Elizabeth ascended the throne in 1952, having reached the rank of commander. In 1957, he was created a British prince. Philip had four children with Elizabeth: Charles, Prince of Wales; Anne, Princess Royal; Prince Andrew, Duke of York; and Prince Edward, Earl of Wessex. Through a British Order in Council issued in 1960, descendants of Philip and Elizabeth who do not bear royal titles or styles may use the surname Mountbatten-Windsor. The surname has also been used by members of the royal family who hold titles.", "! rowspan=\"3\" scope=\"row\" | Anne, Princess Royal"]}, {"page": "Royal Canadian Mounted Police", "response": ["|Anne, Princess Royal", "Various members of the Canadian royal family have been granted honorary titles by the RCMP. Queen Elizabeth II, initially appointed honorary commissioner in 1953 was made commissioner-in-chief in celebration of her Diamond Jubilee in 2012. Upon her new appointment, her son, Charles, Prince of Wales was made an honorary commissioner. Prince Edward, Earl of Wessex was made an honorary commissioner during a royal visit in 2009. Anne, Princess Royal was made  honorary deputy commissioner during a visit to Canada in 2014.", "The RCMP has since 1998 had its own distinctive tartan. The creation of the tartan was the result of a committee created in the early 1990s to create a tartan by its 125th anniversary. Upon approval from commissioner Phillip Murray, the tartan was registered with the Scottish Tartans Society and presented to the agency by Anne, Princess Royal during her royal visit to Canada in 1998. The tartan appeared for the first time by a RCMP pipe band at the Royal Nova Scotia International Tattoo in July and August 1998."]}]}}