{"wiki_id": "http://www.wikidata.org/entity/Q151556", "itemLabel": "Richard Owen", "itemDescription": "English biologist and paleontologist", "wikipedia_url": "https://en.wikipedia.org/wiki/Richard_Owen", "wikipedia_page": {"main": "Sir Richard Owen  (20 July 1804 – 18 December 1892) was an English biologist, comparative anatomist and paleontologist. Despite being a controversial figure, Owen is generally considered to have been an outstanding naturalist with a remarkable gift for interpreting fossils.\nOwen produced a vast array of scientific work, but is probably best remembered today for coining the word Dinosauria (meaning \"Terrible Reptile\" or \"Fearfully Great Reptile\"). An outspoken critic of Charles Darwin's theory of evolution by natural selection, Owen agreed with Darwin that evolution occurred, but thought it was more complex than outlined in Darwin's On the Origin of Species. Owen's approach to evolution can be seen as having anticipated the issues that have gained greater attention with the recent emergence of evolutionary developmental biology.Owen was the first president of the Microscopical Society of London in 1839 and edited many issues of its journal – then known as The Microscopic Journal.Owen also campaigned for the natural specimens in the British Museum to be given a new home. This resulted in the establishment, in 1881, of the now world-famous Natural History Museum in South Kensington, London. Bill Bryson argues that, \"by making the Natural History Museum an institution for everyone, Owen transformed our expectations of what museums are for\".While he made several contributions to science and public learning, Owen was a controversial figure among his contemporaries, such as Thomas Henry Huxley. His later career was tainted by controversies, many of which involved accusations that he took credit for other people's work.", "link_mentions": [{"page": "Alfred Russel Wallace", "response": ["Prominent anatomists and geologists such as Georges Cuvier, Richard Owen, Adam Sedgwick, and Charles Lyell attacked it vigorously.McGowan The Dragon Seekers pp. 101, 154–55.Larson pp. 23–24, 37–38. It has been suggested that Wallace accepted the idea of the transmutation of species in part because he was always inclined to favour radical ideas in politics, religion and science, and because he was unusually open to marginal, even fringe, ideas in science.Shermer p. 54."]}, {"page": "Archaeopteryx", "response": ["The first skeleton, known as the London Specimen (BMNH 37001), was unearthed in 1861 near , Germany, and perhaps given to local physician  in return for medical services. He then sold it for £700 (roughly £83,000 in 2020UK inflation calculator) to the Natural History Museum in London, where it remains. Missing most of its head and neck, it was described in 1863 by Richard Owen as Archaeopteryx macrura, allowing for the possibility it did not belong to the same species as the feather. In the subsequent fourth edition of his On the Origin of Species, Charles Darwin described how some authors had maintained \"that the whole class of birds came suddenly into existence during the eocene period; but now we know, on the authority of Professor Owen, that a bird certainly lived during the deposition of the upper greensand; and still more recently, that strange bird, the Archaeopteryx, with a long lizard-like tail, bearing a pair of feathers on each joint, and with its wings furnished with two free claws, has been discovered in the oolitic slates of Solnhofen. Hardly any recent discovery shows more forcibly than this how little we as yet know of the former inhabitants of the world.\"", "Finally, the motives they suggested for a forgery are not strong, and are contradictory; one is that Richard Owen wanted to forge evidence in support of Charles Darwin's theory of evolution, which is unlikely given Owen's views toward Darwin and his theory. The other is that Owen wanted to set a trap for Darwin, hoping the latter would support the fossils so Owen could discredit him with the forgery; this is unlikely because Owen wrote a detailed paper on the London specimen, so such an action would certainly backfire."]}, {"page": "December 31", "response": ["*1853 – A dinner party is held inside a life-size model of an iguanodon created by Benjamin Waterhouse Hawkins and Sir Richard Owen in south London, England."]}, {"page": "Dinosaur", "response": ["The first dinosaur fossils were recognized in the early 19th century, with the name \"dinosaur\" (meaning \"terrible lizard\") having been coined by Sir Richard Owen in 1841 to refer to these \"great fossil lizards\". Since then, mounted fossil dinosaur skeletons have been major attractions at museums worldwide, and dinosaurs have become an enduring part of popular culture. The large sizes of some dinosaurs, as well as their seemingly monstrous and fantastic nature, have ensured their regular appearance in best-selling books and films, such as Jurassic Park. Persistent public enthusiasm for the animals has resulted in significant funding for dinosaur science, and new discoveries are regularly covered by the media.", "Under phylogenetic nomenclature, dinosaurs are usually defined as the group consisting of the most recent common ancestor (MRCA) of Triceratops and modern birds (Neornithes), and all its descendants. It has also been suggested that Dinosauria be defined with respect to the MRCA of Megalosaurus and Iguanodon, because these were two of the three genera cited by Richard Owen when he recognized the Dinosauria. Both definitions result in the same set of animals being defined as dinosaurs: \"Dinosauria = Ornithischia + Saurischia\". This definition includes major groups such as ankylosaurians (armored herbivorous quadrupeds), stegosaurians (plated herbivorous quadrupeds), ceratopsians (bipedal or quadrupedal herbivores with neck frills), pachycephalosaurians (bipedal herbivores with thick skulls), ornithopods (bipedal or quadrupedal herbivores including \"duck-bills\"), theropods (mostly bipedal carnivores and birds), and sauropodomorphs (mostly large herbivorous quadrupeds with long necks and tails).", "The study of these \"great fossil lizards\" soon became of great interest to European and American scientists, and in 1841 the English paleontologist Sir Richard Owen coined the term \"dinosaur\", using it to refer to the \"distinct tribe or sub-order of Saurian Reptiles\" that were then being recognized in England and around the world. The term is derived . Though the taxonomic name has often been interpreted as a reference to dinosaurs' teeth, claws, and other fearsome characteristics, Owen intended it to also evoke their size and majesty. Owen recognized that the remains that had been found so far, Iguanodon, Megalosaurus and Hylaeosaurus, shared a number of distinctive features, and so decided to present them as a distinct taxonomic group. With the backing of Prince Albert, the husband of Queen Victoria, Owen established the Natural History Museum, London, to display the national collection of dinosaur fossils and other biological and geological exhibits.", "Category:Taxa named by Richard Owen"]}, {"page": "December 18", "response": ["*1892 – Richard Owen, English biologist, anatomist, and paleontologist (b. 1804)"]}, {"page": "Dodo", "response": ["Until 1860, the only known dodo remains were the four incomplete 17th-century specimens. Philip Burnard Ayres found the first subfossil bones in 1860, which were sent to Richard Owen at the British Museum, who did not publish the findings. In 1863, Owen requested the Mauritian Bishop Vincent Ryan to spread word that he should be informed if any dodo bones were found. In 1865, George Clark, the government schoolmaster at Mahébourg, finally found an abundance of subfossil dodo bones in the swamp of Mare aux Songes in Southern Mauritius, after a 30-year search inspired by Strickland and Melville's monograph. In 1866, Clark explained his procedure to The Ibis, an ornithology journal: he had sent his coolies to wade through the centre of the swamp, feeling for bones with their feet. At first they found few bones, until they cut away herbage that covered the deepest part of the swamp, where they found many fossils. Harry Pasley Higginson, a railway engineer from Yorkshire, reports discovering the Mare aux Songes bones at the same time as Clark and there is some dispute over who found them first. Higginson sent boxes of these bones to Liverpool, Leeds and York museums. The swamp yielded the remains of over 300 dodos, but very few skull and wing bones, possibly because the upper bodies were washed away or scavenged while the lower body was trapped. The situation is similar to many finds of moa remains in New Zealand marshes. Most dodo remains from the Mare aux Songes have a medium to dark brown colouration.", "Clark's reports about the finds rekindled interest in the bird. Sir Richard Owen and Alfred Newton both wanted to be first to describe the post-cranial anatomy of the dodo, and Owen bought a shipment of dodo bones originally meant for Newton, which led to rivalry between the two. Owen described the bones in Memoir on the Dodo in October 1866, but erroneously based his reconstruction on the Edwards's Dodo painting by Savery, making it too squat and obese. In 1869 he received more bones and corrected its stance, making it more upright. Newton moved his focus to the Réunion solitaire instead. The remaining bones not sold to Owen or Newton were auctioned off or donated to museums. In 1889, Théodor Sauzier was commissioned to explore the \"historical souvenirs\" of Mauritius and find more dodo remains in the Mare aux Songes. He was successful, and also found remains of other extinct species."]}, {"page": "Diprotodon", "response": ["At the time these massive fossils were discovered, there were no serious scientists in Australia, so the massive fossils were not formally described until Mitchell, while in England publishing his journal, brought them to his former colleague Sir Richard Owen in 1837. Before Owen, it was generally guessed the fossil assemblage represents rhinos, elephants, hippos, or dugongs. In 1838, while studying a piece of a right mandible with an incisor, Owen compared the tooth to that of a wombat or a hippo, and designated it as a new genus in a letter to Mitchell, as Diprotodon. Mitchell published the correspondence in his journal. He formally described Diprotodon in volume 2 without mentioning a species, but in volume 1, he listed the name Diprotodon optatum, making that the type species. Diprotodon means \"two protruding front teeth\". In 1844, Owen replaced the name D. optatum with \"D. australis\". Owen only used optatum the one time, and the acceptance of its apparent replacement \"australis\" has varied widely.", "Category:Taxa named by Richard Owen"]}, {"page": "Human evolution", "response": ["The first debates about the nature of human evolution arose between Thomas Henry Huxley and Richard Owen. Huxley argued for human evolution from apes by illustrating many of the similarities and differences between humans and other apes, and did so particularly in his 1863 book Evidence as to Man's Place in Nature. Many of Darwin's early supporters (such as Alfred Russel Wallace and Charles Lyell) did not initially agree that the origin of the mental capacities and the moral sensibilities of humans could be explained by natural selection, though this later changed. Darwin applied the theory of evolution and sexual selection to humans in his 1871 book The Descent of Man, and Selection in Relation to Sex."]}, {"page": "July 20", "response": ["*1804 – Richard Owen, English biologist, anatomist, and paleontologist (d. 1892)"]}, {"page": "Koala", "response": ["Naturalist and popular artist John Gould illustrated and described the koala in his three-volume work The Mammals of Australia (1845–1863) and introduced the species, as well as other members of Australia's little-known faunal community, to the general British public.Moyal, pp. 87–93. Comparative anatomist Richard Owen, in a series of publications on the physiology and anatomy of Australian mammals, presented a paper on the anatomy of the koala to the Zoological Society of London. In this widely cited publication, he provided the first careful description of its internal anatomy, and noted its general structural similarity to the wombat.Moyal, pp. 94–96. English naturalist George Robert Waterhouse, curator of the Zoological Society of London, was the first to correctly classify the koala as a marsupial in the 1840s. He identified similarities between it and its fossil relatives Diprotodon and Nototherium, which had been discovered just a few years before.Moyal, pp. 46–48. Similarly, Gerard Krefft, curator of the Australian Museum in Sydney, noted evolutionary mechanisms at work when comparing the koala to its ancestral relatives in his 1871 The Mammals of Australia.Moyal, pp. 103–105."]}, {"page": "Recapitulation theory", "response": ["The embryological theory was formalised by Serres in 1824–26, based on Meckel's work, in what became known as the \"Meckel-Serres Law\". This attempted to link comparative embryology with a \"pattern of unification\" in the organic world. It was supported by Étienne Geoffroy Saint-Hilaire, and became a prominent part of his ideas. It suggested that past transformations of life could have been through environmental causes working on the embryo, rather than on the adult as in Lamarckism. These naturalistic ideas led to disagreements with Georges Cuvier. The theory was widely supported in the Edinburgh and London schools of higher anatomy around 1830, notably by Robert Edmond Grant, but was opposed by Karl Ernst von Baer's ideas of divergence, and attacked by Richard Owen in the 1830s."]}, {"page": "Odd-toed ungulate", "response": ["Despite their very different appearances, they were recognized as related families in the 19th century by the zoologist Richard Owen, who also coined the order name.", "Relationships within the large group of odd-toed ungulates are not fully understood. Initially, after the establishment of \"Perissodactyla\" by Richard Owen in 1848, the present-day representatives were considered equal in rank. In the first half of the 20th century, a more systematic differentiation of odd-toed ungulates began, based on a consideration of fossil forms, and they were placed in two major suborders: Hippomorpha and Ceratomorpha. The Hippomorpha comprises today's horses and their extinct members (Equoidea); the Ceratomorpha consist of tapirs and rhinos plus their extinct members (Tapiroidea and Rhinocerotoidea). The names Hippomorpha and Ceratomorpha were introduced in 1937 by Horace Elmer Wood, in response to criticism of the name \"Solidungula\" that he proposed three years previously. It had been based on the grouping of horses and Tridactyla and on the rhinoceros/tapir complex. The extinct brontotheriidae were also classified under Hippomorpha and therefore possess a close relationship to horses. Some researchers accept this assignment because of similar dental features, but there is also the view that a very basal position within the odd-toed ungulates places them rather in the group of Titanotheriomorpha.", "thumb|right|Richard Owen, 1856", "In 1861, Henri Marie Ducrotay de Blainville (1777–1850) classified ungulates by the structure of their feet, differentiating those with an even number of toes from those with an odd number. He moved the horses as solidungulate over to the tapirs and rhinos as multungulate animals and referred to all of them together as onguligrades à doigts impairs, coming close to the concept of the odd-toed ungulate as a systematic unit. Richard Owen (1804–1892) quoted Blainville in his study on fossil mammals of the Isle of Wight and introduced the name Perissodactyla."]}, {"page": "Pterodactylus", "response": ["Beginning in 1846, many pterosaur specimens were found near the village of Burham in Kent, England by British paleontologists James Scott Bowerbank and Sir Richard Owen. Bowerbank had assigned fossil remains to two new species; the first was named in 1846 as Pterodactylus giganteus; the specific name means 'the gigantic one' in Latin, in reference to the large size of the remains, and the second species was named in 1851 as Pterodactylus cuvieri, in honor of the French scientist Georges Cuvier. Later in 1851, Owen named and described new pterosaur specimens that have been found yet again in England. He assigned these specimens to a new species called Pterodactylus compressirostris.Owen, R. (1851). Monograph on the fossil Reptilia of the Cretaceous Formations. The Palaeontographical Society 5(11):1–118. In 1914 however, paleontologist Reginald Hooley redescribed P. compressirostris, to which he erected the genus Lonchodectes (), and therefore made P. compressirostris the type species, and created the new combination L. compressirostris. In a 2013 review, P. giganteus and P. cuvieri were reassigned to new genera; P. giganteus was reassigned to a genus called  Lonchodraco ('lance dragon'), which resulted in a new combination called L. giganteus, and P. cuvieri was reassigned to the new genus Cimoliopterus ('chalk wing'), creating C. cuvieri. Back in 1859, Owen had found remains the front part of a snout in the Cambridge Greensand, and assigned it into the species Pterodactylus segwickii; in honor of Adam Sedgwick, a British geologist.Owen, R. (1859). Monograph on the fossil Reptilia of the Cretaceous formations. Supplement no. I. Palaeontographical Society, London, p. 19 This species however, was reassigned to the genus Camposipterus in 2013, therefore creating the new combination Camposipterus segwickii. Later, in 1861, Owen had uncovered multiple distinctively looking fossil remains yet again in the Cambridge Greensand, these were assigned to a new species named Pterodactylus simus,Martill, David. (2010). The early history of pterosaur discovery in Great Britain. Geological Society of London Special Publications. 343. 287–311.  though the British paleontologist Harry Govier Seeley had created a separate generic name called Ornithocheirus, and reassigned P. simus as the type species, which created the combination Ornithocheirus simus. Between the years 1869 and 1870, Seeley had reassigned many pterosaur species into Ornithocheirus, while also creating several new species. Many of these species however, are now reclassified to other genera, or considered . In 1874, further specimens were found in England, again by Owen, these ones were assigned to a new species called Pterodactylus sagittirostris,Owen, R. 1874. \"A Monograph on the Fossil Reptilia of the Mesozoic Formations. 1. Pterosauria.\" The Palaeontographical Society Monograph 27: 1–14 this species however, was reassigned to the genus Lonchodectes in 1914 by Hooley, which resulted in an L. sagittirostris. This conclusion was revised by Rigal et al. in 2017, who disagreed with Hooley's reassignment, and therefore created the genus Serradraco, which afterwards resulted in a new combination called S. sagittirostris."]}, {"page": "Pterosaur", "response": ["In 1828, Mary Anning in England found the first pterosaur genus outside Germany, by Richard Owen named as Dimorphodon, also the first non-pterodactyloid pterosaur known. Later in the century, the Early Cretaceous Cambridge Greensand produced thousands of pterosaur fossils, that however, were of poor quality, consisting mostly of strongly eroded fragments. Based on these, nevertheless numerous genera and species would be named. Many were described by Harry Govier Seeley, at the time the main English expert on the subject, who also wrote the first pterosaur book, Ornithosauria,Seeley, H.G., 1870, Ornithosauria – an elementary study of the bones of Pterodactyles, Cambridge University Press and in 1901 the first popular book, Dragons of the Air. Seeley thought that pterosaurs were warm-blooded and dynamic creatures, closely related to birds.Seeley, H.G., 1901, Dragons of the Air: An account of extinct flying reptiles, Londen: Methuen Earlier, the evolutionist St. George Jackson Mivart had suggested pterosaurs were the direct ancestors of birds. Owen opposed the views of both men, seeing pterosaurs as cold-blooded \"true\" reptiles."]}, {"page": "Reptile", "response": ["It was not until the beginning of the 19th century that it became clear that reptiles and amphibians are, in fact, quite different animals, and Pierre André Latreille erected the class Batracia (1825) for the latter, dividing the tetrapods into the four familiar classes of reptiles, amphibians, birds, and mammals.Latreielle, P.A. (1804): Nouveau Dictionnaire à Histoire Naturelle, xxiv., cited in Latreille's Familles naturelles du règne animal, exposés succinctement et dans un ordre analytique, 1825 The British anatomist Thomas Henry Huxley made Latreille's definition popular and, together with Richard Owen, expanded Reptilia to include the various fossil \"antediluvian monsters\", including dinosaurs and the mammal-like (synapsid) Dicynodon he helped describe. This was not the only possible classification scheme: In the Hunterian lectures delivered at the Royal College of Surgeons in 1863, Huxley grouped the vertebrates into mammals, sauroids, and ichthyoids (the latter containing the fishes and amphibians). He subsequently proposed the names of Sauropsida and Ichthyopsida for the latter two groups.Huxley, T.H. (1863): The Structure and Classification of the Mammalia. Hunterian lectures, presented in Medical Times and Gazette, 1863. original text In 1866, Haeckel demonstrated that vertebrates could be divided based on their reproductive strategies, and that reptiles, birds, and mammals were united by the amniotic egg.", "Dinosaurs have been widely depicted in culture since the English palaeontologist Richard Owen coined the name dinosaur in 1842. As soon as 1854, the Crystal Palace Dinosaurs were on display to the public in south London.Torrens, Hugh. \"Politics and Paleontology\". The Complete Dinosaur, 175–190. One dinosaur appeared in literature even earlier, as Charles Dickens placed a Megalosaurus in the first chapter of his novel Bleak House in 1852. The dinosaurs featured in books, films, television programs, artwork, and other media have been used for both education and entertainment. The depictions range from the realistic, as in the television documentaries of the 1990s and first decade of the 21st century, or the fantastic, as in the monster movies of the 1950s and 1960s."]}, {"page": "On the Origin of Species", "response": ["Richard Owen showed that fossils of extinct species Darwin found in South America were allied to living species on the same continent. In March 1837, ornithologist John Gould announced that Darwin's rhea was a separate species from the previously described rhea (though their territories overlapped), that mockingbirds collected on the Galápagos Islands represented three separate species each unique to a particular island, and that several distinct birds from those islands were all classified as finches. Darwin began speculating, in a series of notebooks, on the possibility that \"one species does change into another\" to explain these findings, and around July sketched a genealogical branching of a single evolutionary tree, discarding Lamarck's independent lineages progressing to higher forms. Unconventionally, Darwin asked questions of fancy pigeon and animal breeders as well as established scientists. At the zoo he had his first sight of an ape, and was profoundly impressed by how human the orangutan seemed.", "Chapter X examines whether patterns in the fossil record are better explained by common descent and branching evolution through natural selection, than by the individual creation of fixed species. Darwin expected species to change slowly, but not at the same rate – some organisms such as Lingula were unchanged since the earliest fossils. The pace of natural selection would depend on variability and change in the environment. This distanced his theory from Lamarckian laws of inevitable progress. It has been argued that this anticipated the punctuated equilibrium hypothesis, but other scholars have preferred to emphasise Darwin's commitment to gradualism. He cited Richard Owen's findings that the earliest members of a class were a few simple and generalised species with characteristics intermediate between modern forms, and were followed by increasingly diverse and specialised forms, matching the branching of common descent from an ancestor. Patterns of extinction matched his theory, with related groups of species having a continued existence until extinction, then not reappearing. Recently extinct species were more similar to living species than those from earlier eras, and as he had seen in South America, and William Clift had shown in Australia, fossils from recent geological periods resembled species still living in the same area.", "Darwin discusses morphology, including the importance of homologous structures. He says, \"What can be more curious than that the hand of a man, formed for grasping, that of a mole for digging, the leg of the horse, the paddle of the porpoise, and the wing of the bat, should all be constructed on the same pattern, and should include the same bones, in the same relative positions?\" This made no sense under doctrines of independent creation of species, as even Richard Owen had admitted, but the \"explanation is manifest on the theory of the natural selection of successive slight modifications\" showing common descent. He notes that animals of the same class often have extremely similar embryos. Darwin discusses rudimentary organs, such as the wings of flightless birds and the rudiments of pelvis and leg bones found in some snakes. He remarks that some rudimentary organs, such as teeth in baleen whales, are found only in embryonic stages. These factors also supported his theory of descent with modification.", "The leading naturalist in Britain was the anatomist Richard Owen, an idealist who had shifted to the view in the 1850s that the history of life was the gradual unfolding of a divine plan. Owen's review of the Origin in the April 1860 Edinburgh Review bitterly attacked Huxley, Hooker and Darwin, but also signalled acceptance of a kind of evolution as a teleological plan in a continuous \"ordained becoming\", with new species appearing by natural birth. Others that rejected natural selection, but supported \"creation by birth\", included the Duke of Argyll who explained beauty in plumage by design. Since 1858, Huxley had emphasised anatomical similarities between apes and humans, contesting Owen's view that humans were a separate sub-class. Their disagreement over human origins came to the fore at the British Association for the Advancement of Science meeting featuring the legendary 1860 Oxford evolution debate. In two years of acrimonious public dispute that Charles Kingsley satirised as the \"Great Hippocampus Question\" and parodied in The Water-Babies as the \"great hippopotamus test\", Huxley showed that Owen was incorrect in asserting that ape brains lacked a structure present in human brains. Others, including Charles Lyell and Alfred Russel Wallace, thought that humans shared a common ancestor with apes, but higher mental faculties could not have evolved through a purely material process. Darwin published his own explanation in the Descent of Man (1871)."]}, {"page": "Thomas Henry Huxley", "response": ["The stories regarding Huxley's famous debate in 1860 with Samuel Wilberforce were a key moment in the wider acceptance of evolution and in his own career, although historians think that the surviving story of the debate is a later fabrication.Livingstone, David. \"Myth 17. That Huxley Defeated Wilberforce in Their Debate over Evolution and Religion,\" in Numbers, Ronald L., ed. Galileo goes to jail and other myths about science and religion. No. 74. Harvard University Press, 2009, 152-160. Huxley had been planning to leave Oxford on the previous day, but, after an encounter with Robert Chambers, the author of Vestiges, he changed his mind and decided to join the debate. Wilberforce was coached by Richard Owen, against whom Huxley also debated about whether humans were closely related to apes.", "Huxley's support started with his anonymous favourable review of the Origin in the Times for 26 December 1859, pp. 1–20 and continued with articles in several periodicals, and in a lecture at the Royal Institution in February 1860. p. 400. At the same time, Richard Owen, whilst writing an extremely hostile anonymous review of the Origin in the Edinburgh Review, also primed Samuel Wilberforce who wrote one in the Quarterly Review, running to 17,000 words. The authorship of this latter review was not known for sure until Wilberforce's son wrote his biography. So it can be said that, just as Darwin groomed Huxley, so Owen groomed Wilberforce; and both the proxies fought public battles on behalf of their principals as much as themselves. Though we do not know the exact words of the Oxford debate, we do know what Huxley thought of the review in the Quarterly:", "Wilberforce had a track record against evolution as far back as the previous Oxford B.A. meeting in 1847 when he attacked Chambers' Vestiges. For the more challenging task of opposing the Origin, and the implication that man descended from apes, he had been assiduously coached by Richard OwenOwen stayed with him the night before the debate. p. 493 On the day, Wilberforce repeated some of the arguments from his Quarterly Review article (written but not yet published), then ventured onto slippery ground. His famous jibe at Huxley (as to whether Huxley was descended from an ape on his mother's side or his father's side) was probably unplanned, and certainly unwise. Huxley's reply to the effect that he would rather be descended from an ape than a man who misused his great talents to suppress debatethe exact wording is not certainwas widely recounted in pamphlets and a spoof play.", "For nearly a decade his work was directed mainly to the relationship of man to the apes. This led him directly into a clash with Richard Owen, a man widely disliked for his behaviour whilst also being admired for his capability. The struggle was to culminate in some severe defeats for Owen. Huxley's Croonian Lecture, delivered before the Royal Society in 1858 on The Theory of the Vertebrate Skull was the start. In this, he rejected Owen's theory that the bones of the skull and the spine were homologous, an opinion previously held by Goethe and Lorenz Oken. p. 538–606.", "Although Darwin did not publish his Descent of Man until 1871, the general debate on this topic had started years before (there was even a precursor debate in the 18th century between Monboddo and Buffon). Darwin had dropped a hint when, in the conclusion to the Origin, he wrote: \"In the distant future... light will be thrown on the origin of man and his history\". Not so distant, as it turned out. A key event had already occurred in 1857 when Richard Owen presented (to the Linnean Society) his theory that man was marked off from all other mammals by possessing features of the brain peculiar to the genus Homo. Having reached this opinion, Owen separated man from all other mammals in a subclass of its own. p. 1–37. No other biologist held such an extreme view. Darwin reacted \"Man...as distinct from a chimpanzee [as] an ape from a platypus... I cannot swallow that!\" Neither could Huxley, who was able to demonstrate that Owen's idea was completely wrong.", "* \"Monkeyana\" (Punch vol. 40, 18 May 1861). Signed 'Gorilla', this turned out to be by Sir Philip Egerton MP, amateur naturalist, fossil fish collector and—Richard Owen's patron! p. 296. The last two stanzas include a reference to Huxley's comment that \"Life is too short to occupy oneself with the slaying of the slain more than once.\": Next HUXLEY repliesThat OWEN he liesAnd garbles his Latin quotation;That his facts are not new,His mistakes not a few,Detrimental to his reputation.To twice slay the slainBy dint of the Brain(Thus HUXLEY concludes his review)Is but labour in vain,unproductive of gain,And so I shall bid you \"Adieu\"!", "* The Water Babies, a fairy tale for a land baby by Charles Kingsley (serialised in Macmillan's Magazine 1862–63, published in book form, with additions, in 1863). Kingsley had been among first to give a favourable review to Darwin's On the Origin of Species, having \"long since... learnt to disbelieve the dogma of the permanence of species\", 287 and the story includes a satire on the reaction to Darwin's theory, with the main scientific participants appearing, including Richard Owen and Huxley. In 1892 Thomas Henry Huxley's five-year-old grandson Julian saw the illustration by Edward Linley Sambourne (right) and wrote his grandfather a letter asking: Dear Grandpater—Have you seen a Waterbaby? Did you put it in a bottle? Did it wonder if it could get out? Could I see it some day?—Your loving Julian. Huxley wrote back: My dear Julian—I could never make sure about that Water Baby... My friend who wrote the story of the Water Baby was a very kind man and very clever. Perhaps he thought I could see as much in the water as he did—There are some people who see a great deal and some who see very little in the same things.When you grow up I dare say you will be one of the great-deal seers, and see things more wonderful than the Water Babies where other folks can see nothing."]}, {"page": "Taxonomy (biology)", "response": ["With Darwin's theory, a general acceptance quickly appeared that a classification should reflect the Darwinian principle of common descent. Tree of life representations became popular in scientific works, with known fossil groups incorporated. One of the first modern groups tied to fossil ancestors was birds. Using the then newly discovered fossils of Archaeopteryx and Hesperornis, Thomas Henry Huxley pronounced that they had evolved from dinosaurs, a group formally named by Richard Owen in 1842.Huxley, T.H. (1876): Lectures on Evolution. New York Tribune. Extra. no. 36. In Collected Essays IV: pp. 46–138 original text w/ figures  The resulting description, that of dinosaurs \"giving rise to\" or being \"the ancestors of\" birds, is the essential hallmark of evolutionary taxonomic thinking. As more and more fossil groups were found and recognized in the late 19th and early 20th centuries, palaeontologists worked to understand the history of animals through the ages by linking together known groups. With the modern evolutionary synthesis of the early 1940s, an essentially modern understanding of the evolution of the major groups was in place. As evolutionary taxonomy is based on Linnaean taxonomic ranks, the two terms are largely interchangeable in modern use."]}, {"page": "Tasmanian devil", "response": ["Believing it to be a type of opossum, naturalist George Harris wrote the first published description of the Tasmanian devil in 1807, naming it Didelphis ursina, due to its bearlike characteristics such as the round ear.Owen and Pemberton, p. 79. He had earlier made a presentation on the topic at the Zoological Society of London. However, that particular binomial name had been given to the common wombat (later reclassified as Vombatus ursinus) by George Shaw in 1800, and was hence unavailable. In 1838, a specimen was named Dasyurus laniarius by Richard Owen, Online at Project Gutenberg Australia. but by 1877 he had relegated it to Sarcophilus. The modern Tasmanian devil was named Sarcophilus harrisii (\"Harris's flesh-lover\") by French naturalist Pierre Boitard in 1841.", "According to Pemberton, the possible ancestors of the devil may have needed to climb trees to acquire food, leading to a growth in size and the hopping gait of many marsupials. He speculated that these adaptations may have caused the contemporary devil's peculiar gait.Owen and Pemberton, p. 34. The specific lineage of the Tasmanian devil is theorised to have emerged during the Miocene, molecular evidence suggesting a split from the ancestors of quolls between 10 and 15 million years ago, when severe climate change came to bear in Australia, transforming the climate from warm and moist to an arid, dry ice age, resulting in mass extinctions. As most of their prey died of the cold, only a few carnivores survived, including the ancestors of the quoll and thylacine. It is speculated that the devil lineage may have arisen at this time to fill a niche in the ecosystem, as a scavenger that disposed of carrion left behind by the selective-eating thylacine. The extinct Glaucodon ballaratensis of the Pliocene age has been dubbed an intermediate species between the quoll and devil.  Fossil deposits in limestone caves at Naracoorte, South Australia, dating to the Miocene include specimens of S. laniarius, which were around 15% larger and 50% heavier than modern devils.Owen and Pemberton, p. 35. Older specimens believed to be 50–70,000 years old were found in Darling Downs in Queensland and in Western Australia. It is not clear whether the modern devil evolved from S. laniarius, or whether they coexisted at the time.Owen and Pemberton, p. 36. Richard Owen argued for the latter hypothesis in the 19th century, based on fossils found in 1877 in New South Wales. Large bones attributed to S. moornaensis have been found in New South Wales, and it has been conjectured that these two extinct larger species may have hunted and scavenged. It is known that there were several genera of thylacine millions of years ago, and that they ranged in size, the smaller being more reliant on foraging.Owen and Pemberton, p. 37. As the devil and thylacine are similar, the extinction of the co-existing thylacine genera has been cited as evidence for an analogous history for the devils.Owen and Pemberton, p. 38. It has been speculated that the smaller size of S. laniarius and S. moornaensis allowed them to adapt to the changing conditions more effectively and survive longer than the corresponding thylacines. As the extinction of these two species came at a similar time to human habitation of Australia, hunting by humans and land clearance have been mooted as possible causes.Owen and Pemberton, p. 39. Critics of this theory point out that as indigenous Australians only developed boomerangs and spears for hunting around 10,000 years ago, a critical fall in numbers due to systematic hunting is unlikely. They also point out that caves inhabited by Aborigines have a low proportion of bones and rock paintings of devils, and suggest that this is an indication that it was not a large part of indigenous lifestyle. A scientific report in 1910 claimed that Aborigines preferred the meat of herbivores rather than carnivores.Owen and Pemberton, pp. 40–42. The other main theory for the extinction was that it was due to the climate change brought on by the most recent ice age."]}, {"page": "1863", "response": ["* Richard Owen publishes the first description of a fossilised bird, Archaeopteryx."]}, {"page": "1840s", "response": ["* 1842 – English palaeontologist Richard Owen coins the name Dinosauria, hence the Anglicized dinosaur.Owen, R. (1842). \"Report on British Fossil Reptiles.\" Part II. Report of the British Association for the Advancement of Science, Plymouth, England."]}, {"page": "1892", "response": ["** Sir Richard Owen, English paleontologist (b. 1804)"]}, {"page": "1842", "response": ["* English palaeontologist Richard Owen coins the name Dinosauria, hence the Anglicized dinosaur.Owen, R. (1842). \"Report on British Fossil Reptiles.\" Part II. Report of the British Association for the Advancement of Science, Plymouth, England."]}, {"page": "1804", "response": ["* July 20 – Richard Owen, English anatomist, paleontologist, and zoologist (d. 1892)"]}, {"page": "Mary Anning", "response": ["*  It was to him Anning made what would prove to be the scientifically important suggestion (in a letter auctioned for over £100,000 in 2020 ) that the strange conical objects known as bezoar stones were really the fossilised faeces of ichthyosaurs or plesiosaurs. Buckland would name the objects coprolites. In 1839 Buckland, Conybeare, and Richard Owen visited Lyme together so that Anning could lead them all on a fossil-collecting excursion.", "Anning discovered yet another important and nearly complete plesiosaur skeleton in 1830. It was named Plesiosaurus macrocephalus by William Buckland and was described in an 1840 paper by Richard Owen. Once again Owen mentioned the wealthy gentleman who had purchased the fossil and made it available for examination, but not the woman who had discovered and prepared it.", "Anning found what a contemporary newspaper article called an unrivalled specimen of Dapedium politum. This was a ray-finned fish, which would be described in 1828. In December of that same year she made an important find consisting of the partial skeleton of a pterosaur. In 1829 William Buckland described it as Pterodactylus macronyx (later renamed Dimorphodon macronyx by Richard Owen), and unlike many other such occasions, Buckland credited Anning with the discovery in his paper. It was the first pterosaur skeleton found outside Germany, and it created a public sensation when displayed at the British Museum. Recent research has found that these creatures were not inclined to fly continuously in their search for fish."]}, {"page": "Herbivore", "response": ["Herbivore is the anglicized form of a modern Latin coinage, herbivora, cited in Charles Lyell's 1830 Principles of Geology.J.A. Simpson and E.S.C. Weiner, eds. (2000) The Oxford English Dictionary, vol. 8, p. 155. Richard Owen employed the anglicized term in an 1854 work on fossil teeth and skeletons. Herbivora is derived from Latin herba 'small plant, herb'P.G.W. Glare, ed. (1990) The Oxford Latin Dictionary, p. 791. and vora, from vorare 'to eat, devour'.P.G.W. Glare, ed. (1990) The Oxford Latin Dictionary, p. 2103."]}, {"page": "Even-toed ungulate", "response": ["Linnaeus postulated a close relationship between camels and ruminants as early as the mid-1700s. Henri de Blainville recognized the similar anatomy of the limbs of pigs and hippos, and British zoologist Richard Owen coined the term \"even-toed ungulates\" and the scientific name \"Artiodactyla\" in 1848."]}, {"page": "North West England", "response": ["Clifford Cocks and James H. Ellis from Cheshire, with Malcolm J. Williamson, invented the RSA (algorithm) in 1973 at GCHQ, used for public-key cryptography. Sir Richard Owen from Lancaster coined the word dinosaur in 1842, and he founded the Natural History Museum, London, opening in 1881."]}, {"page": "Hippocampus", "response": ["Another reference appeared with the term pes hippocampi, which may date back to Diemerbroeck in 1672, introducing a comparison with the shape of the folded back forelimbs and webbed feet of the mythological hippocampus, a sea monster with a horse's forequarters and a fish's tail. The hippocampus was then described as pes hippocampi major, with an adjacent bulge in the occipital horn, described as the pes hippocampi minor and later renamed as the calcar avis. The renaming of the hippocampus as hippocampus major, and the calcar avis as hippocampus minor, has been attributed to Félix Vicq-d'Azyr systematizing nomenclature of parts of the brain in 1786. Mayer mistakenly used the term hippopotamus in 1779, and was followed by some other authors until Karl Friedrich Burdach resolved this error in 1829. In 1861 the hippocampus minor became the center of a dispute over human evolution between Thomas Henry Huxley and Richard Owen, satirized as the Great Hippocampus Question. The term hippocampus minor fell from use in anatomy textbooks and was officially removed in the Nomina Anatomica of 1895.Gross, 1993 Today, the structure is just called the hippocampus, with the term Cornu Ammonis surviving in the names of the hippocampal subfields CA1-CA4.Wechsler, 2004"]}, {"page": "List of biologists", "response": ["*Richard Owen (1804–1892), British biologist,Abbreviation in zoology: Owen paleontologist, and taxonomist of fossil and extant organisms"]}, {"page": "Moa", "response": ["DieffenbachDieffenbach, E. (1843) also refers to a fossil from the area near Mt Hikurangi, and surmises that it belongs to \"a bird, now extinct, called Moa (or Movie) by the natives\". 'Movie' is the first transcribed name for the bird. In 1839, John W. Harris, a Poverty Bay flax trader who was a natural-history enthusiast, was given a piece of unusual bone by a Māori who had found it in a river bank. He showed the  fragment of bone to his uncle, John Rule, a Sydney surgeon, who sent it to Richard Owen, who at that time was working at the Hunterian Museum at the Royal College of Surgeons in London."]}, {"page": "Placentalia", "response": ["Category:Taxa named by Richard Owen"]}, {"page": "Convergent evolution", "response": ["In morphology, analogous traits arise when different species live in similar ways and/or a similar environment, and so face the same environmental factors. When occupying similar ecological niches (that is, a distinctive way of life) similar problems can lead to similar solutions. The British anatomist Richard Owen was the first to identify the fundamental difference between analogies and homologies."]}, {"page": "Trichinosis", "response": ["The circumstances surrounding the first observation and identification of T. spiralis are controversial, due to a lack of records. In 1835, James Paget, a first-year medical student, first observed the larval form of T. spiralis, while witnessing an autopsy at St. Bartholomew’s Hospital in London. Paget took special interest in the presentation of muscle with white flecks, described as a \"sandy diaphragm\".  Although Paget is most likely the first person to have noticed and recorded these findings, the parasite was named and published in a report by his professor, Richard Owen, who is now credited for the discovery of the T. spiralis larval form.Richard Owen (1835) \"Description of a microscopic entozoon infesting the muscles of the human body,\"  Transactions of the Zoological Society of London, 1 :  315–24.  Paget is mentioned on pp. 315 and 320."]}]}}