{"wiki_id": "http://www.wikidata.org/entity/Q15130786", "itemLabel": "Eric Dingwall", "itemDescription": "British anthropologist", "wikipedia_url": "https://en.wikipedia.org/wiki/Eric_Dingwall", "wikipedia_page": {"main": "Eric John Dingwall (1890–1986) was a British anthropologist, psychical researcher and librarian.", "link_mentions": [{"page": "Society for Psychical Research", "response": ["Sceptics have criticised members of the SPR for having motives liable to impair scientific objectivity. According to SPR critics John Grant and Eric Dingwall (a member of the SPR), early SPR members such as Henry Sidgwick, Frederic W. H. Myers, and William Barrett hoped to cling to something spiritual through psychical research.Dingwall, Eric (1985). The Need for Responsibility in Parapsychology: My Sixty Years in Psychical Research. In Paul Kurtz. A Skeptic's Handbook of Parapsychology. Prometheus Books. pp. 161–174.  Author John Grant stated that prominent member F. W. H. Myers held that telepathy, according to some speculative explanations, might, in demonstrating that mind could communicate with mind apart from recognised channels, provide evidence supporting the proposition that human personality could continue after the death of the body. \"Thus the supernatural might be proved by science, and psychical research might become, in the words of Sir William Barrett, a handmaid to religion.\"Grant, John (2015). Spooky Science: Debunking the Pseudoscience of the Afterlife. Sterling Publishing. pp. 23–24.  Myers stated that \"[T]he Society for Psychical Research was founded, with the establishment of thought-transference—already rising within measurable distance of proof—as its primary aim.\"Woerlee, G. M. (2011). \"Review of Consciousness Beyond Life by Pim van Lommel\". Retrieved 2016-12-19. Defenders of the SPR have stated in reply that \"a 'will to believe' in post-mortem survival, telepathy and other scientifically unpopular notions, does not necessarily exclude a \"will to know\" and thus the capacity for thorough self-criticism, methodological rigour and relentless suspicion of errors.\"", "Some sceptical members have resigned from the SPR. Eric Dingwall resigned and wrote \" After sixty years' experience and personal acquaintance with most of the leading parapsychologists of that period I do not think I could name half a dozen whom I could call objective students who honestly wished to discover the truth. The great majority wanted to prove something or other: They wanted the phenomena into which they were inquiring to serve some purpose in supporting preconceived theories of their own.\""]}, {"page": "Telepathy", "response": ["Psychical researcher Eric Dingwall criticized SPR founding members Frederic W. H. Myers and William F. Barrett for trying to \"prove\" telepathy rather than objectively analyze whether or not it existed.Dingwall, Eric. (1985). The Need for Responsibility in Parapsychology: My Sixty Years in Psychical Research. In A Skeptic's Handbook of Parapsychology. Prometheus Books. pp. 161-174.  \"Let me give an example, such as thought-transference, which is as good as any. When the British SPR was founded, the public was led to believe that at least a scientific survey was to be made, and I have no doubt that even some of those closely associated with the early days thought so too. But Myers, among others, had no such intention and cherished no such illusion. He knew that the primary aim of the Society was not objective experimentation but the establishment of telepathy. (...) What was wanted was proof that mind could communicate with mind apart from the normal avenues, for if mental sharing was a fact when the persons concerned were incarnate it could plausibly be suggested that the same mechanism might operate when death had occurred. Thus the supernatural might be proved by science, and psychical research might become, in the words of Sir William Barrett, a handmaid to religion.\""]}, {"page": "Frederic W. H. Myers", "response": ["Some historians have suggested that Myers was strongly biased to believe in the paranormal and held a secret religious agenda. After the publication of Charles Darwin's On the Origin of Species (1859), it was difficult for those with a scientific education to retain a belief in tenets of the Judeo-Christian religion.Grant, John. (2015). Spooky Science: Debunking the Pseudoscience of the Afterlife. Sterling Publishing. pp. 23–24.  Early SPR members like Myers and Henry Sidgwick hoped to cling to something spiritual through psychical research. Psychical researcher Eric Dingwall wrote regarding the early formation of the Society for Psychical Research, \"Myers, among others... knew that the primary aim of the society was not objective experimentation but the establishment of telepathy.\"Dingwall, Eric. (1985). The Need for Responsibility in Parapsychology: My Sixty Years in Psychical Research. In Paul Kurtz. A Skeptic's Handbook of Parapsychology. Prometheus Books. pp. 161–174.  \"When the British SPR was founded, the public was led to believe that at least a scientific survey was to be made, and I have no doubt that even some of those closely associated with the early days thought so too. But Myers, among others, had no such intention and cherished no such illusion. He knew that the primary aim of the Society was not objective experimentation but the establishment of telepathy. To understand why this was so it is necessary to realize the position in which so many educated and intelligent people found themselves during the 1870s and later in Victorian England. With the emergence of new scientific concepts touching the origin of man and his place in the universe, the very foundations of their religious beliefs began to give way.\""]}, {"page": "Materialization (paranormal)", "response": ["*Harry Price and Eric Dingwall. (1975). Revelations of a Spirit Medium. Arno Press. Reprint of 1891 edition by Charles F. Pidgeon. This rare, overlooked, and forgotten, book gives the \"insider's knowledge\" of 19th century deceptions."]}, {"page": "Edmé Boursault", "response": ["*Les Cadenats, ou le Jaloux Endormi (English: The locks, or the jealous one asleep, 1663). A one-act comedy. A theatrical work involving a \"girdle of chastity\" (chastity belt). Eric Dingwall considered it \"in places both dull and tedious\".Dingwall (1931), p. 155"]}, {"page": "Harry Price", "response": ["The psychical researcher Eric Dingwall and Price re-published an anonymous work written by a former medium entitled Revelations of a Spirit Medium (1922) which exposed the tricks of mediumship and the fraudulent methods of producing \"spirit hands\".Eric Dingwall, Harry Price. (1922). Revelations of a Spirit Medium. Kegan Paul, Trench, Trübner & Co. Originally all the copies of the book were bought up by spiritualists and deliberately destroyed.Georgess McHargue. (1972). Facts, Frauds, and Phantasms: A Survey of the Spiritualist Movement. Doubleday. p. 158. ", "Price joined the Society for Psychical Research (SPR) in 1920 and because of his knowledge in conjuring had debunked fraudulent mediums but in direct contrast to other magicians, Price endorsed some mediums that he believed were genuine.Paul Tabori. (1974). Harry Price: The Biography of a Ghosthunter. Sphere Books. pp. 43–48.  Price's first major success in psychical research came in 1922 when he exposed the 'spirit' photographer William Hope.Leaves from a Psychist's Case Book by Harry Price, Page 213.Hall (1978) p. 222 In the same year he travelled to Germany together with Eric Dingwall and investigated Willi Schneider at the home of Baron Albert von Schrenck-Notzing in Munich.Hall (1978) pp. 136–153 In 1923, Price exposed the medium Jan Guzyk, according to Price the \"man was clever, especially with his feet, which were almost as useful to him as his hands in producing phenomena.\"Harry Price. (1942). Search for truth: My Life for Psychical Research. Collins p. 206", "On 4 February 1922, Price with James Seymour, Eric Dingwall and William Marriott had proven the spirit photographer William Hope was a fraud during tests at the British College of Psychic Science. Price wrote in his SPR report \"William Hope has been found guilty of deliberately substituting his own plates for those of a sitter ... It implies that the medium brings to the sitting a duplicate slide and faked plates for fraudulent purposes.\"", "The psychical researcher John L. Randall wrote there was direct evidence of \"dirty tricks\" played upon Price by members of the SPR. On 9 October 1931, a past president of the SPR William Henry Salter visited the Borley Rectory in an attempt to persuade the Rector Lionel Foyster, to sever his links with Price and work with the SPR instead.Ivan Banks. (1996). The Enigma of Borley Rectory. London: Foulsham. p. 92.  After Price's death in 1948 Eric Dingwall, Kathleen M. Goldney, and Trevor H. Hall, three members of the Society for Psychical Research, two of whom had been Price's most loyal associates, investigated his claims about Borley. Their findings were published in a 1956 book, The Haunting of Borley Rectory, which concluded Price had fraudulently produced some of the phenomena.Dingwall, E. J.; Goldney, K. M.; Hall, T. H. (1956). The Haunting of Borley Rectory. Duckworth.", "Eric Dingwall and Trevor Hall wrote the Rosalie séance was fictitious and Price had lied about the whole affair but had based some of the details on the description of the house from a sitting he attended at a much earlier time in Brockley, South London where he used to live.Eric Dingwall, Trevor Hall. (1958). Four Modern Ghosts. Gerald Duckworth. K. M. Goldney who had criticised Price over his investigation into Borley Rectory wrote after the morning of the Rosalie sitting she found Price \"shaken to the core by his experience.\" Goldney believed Price had told the truth about the séance and informed the Two Worlds spiritualist weekly newspaper that she believed the Rosalie sitting to be genuine.Philip Paul. (1985). Some Unseen Power: Diary of a Ghost Hunter. Robert Hale Ltd. p. 36. ", "*Revelations of a Spirit Medium, with Eric Dingwall, Kegan Paul, Trench, Trubner & Co. Ltd, London, 1922."]}, {"page": "Daniel Dunglas Home", "response": ["According to Eric Dingwall, a lady acted as a medium and used to help Home during the séances attended by Henrietta Ada Ward.Gordon Stein. (1993). The Sorcerer of Kings: The Case of Daniel Dunglas Home and William Crookes. Prometheus Books. p. 85.  \"Dingwall mentions that Henrietta Ada Ward, the wife of the painter Edward Matthew Ward, said in her memoirs that a lady used to help Home during the séances she attended and \"act as a medium.\"Memories of Ninety Years by Mrs E. M. Ward (Henrietta Mary Ada Ward), Henry Holt,2nd edition, 1925, page 102", "The claim that the accordion feat was performed by Home using a small harmonica was originally suggested by J. M. Robertson in 1891.J. M. Robertson. (1891). A Spiritualistic Farce. The National Reformer, 20 September. The psychical researcher Eric Dingwall who catalogued Home's collection on its arrival at the SPR did not record the presence of the mouth organs, and Lamont speculates that it is unlikely Dingwall would have missed these or not made them public.Lamont, 2005 p. 302 The accordion in the SPR collection is not the actual one Home used. They display a duplicate.\"ESP Extrasensory Perception\", Chapter 5, Spiritualism, Spirits and Mediums by Simeon Edmonds, Wilshire Book co, 1975", "*Harry Price and Eric Dingwall. (1975). Revelations of a Spirit Medium. Arno Press. Reprint of 1891 edition by Charles F. Pidgeon. This rare, overlooked, and forgotten, book gives the \"insider's knowledge\" of 19th century deceptions."]}, {"page": "Mary Magdalene de' Pazzi", "response": ["The anthropologist Eric Dingwall wrote a chapter on Pazzi's alleged masochism and flagellant behaviors in Very Peculiar People (1962).Dingwall, Eric. (1962). Very Peculiar People. University Books. pp. 127–133"]}, {"page": "Billet reading", "response": ["In his book The Physical Phenomena of Spiritualism, Hereward Carrington revealed the tricks of billet reading (with diagrams) that fraudulent mediums would use.Hereward Carrington. (1907).The Physical Phenomena of Spiritualism . Herbert B. Turner & Co. pp. 276-290. The psychical researcher Eric Dingwall observed Reese in New York and claimed to have discovered his cheating methods; according to Dingwall the exploits of Reese were \"not worth any serious scientific consideration\" and that Reese came into contact with the sealed notes.Eric Dingwall. (1927). How to Go to a Medium. K. Paul, Trench, Trübner. pp. 31-32. Also see Eric Dingwall. (1968). Abnormal Hypnotic Phenomena: France. Barnes & Noble. p. 272 Martin Gardner wrote that Reese was an expert mentalist no different from stage magicians of the period such as Joseph Dunninger but managed to fool a number of people into believing he was a genuine psychic.Martin Gardner. (1957). Fads and Fallacies in the Name of Science. Dover Publications. p. 311.  Another magician to expose the methods of billet readers was Joseph Rinn.Martin Gardner. (2001). Did Adam and Eve Have Navels?: Debunking Pseudoscience. W. W. Norton & Company. p. 217. "]}, {"page": "Mediumship", "response": ["In 1910 at a séance in Grenoble, France the apport medium Charles Bailey produced two live birds in the séance room. Bailey was unaware that the dealer he had bought the birds from was present in the séance and he was exposed as a fraud.J. Gordon Melton. (2007). The Encyclopedia of Religious Phenomena. Visible Ink Press. p. 12.  The psychical researcher Eric Dingwall observed the medium Bert Reese in New York and claimed to have discovered his billet reading tricks.Eric Dingwall. (1927). How to Go to a Medium. K. Paul, Trench, Trübner. pp. 31–32. The most detailed account at exposing his tricks (with diagrams) was by the magician Theodore Annemann.Theodore Annemann. (1983). Practical Mental Magic. Dover Publications. pp. 7–11", "On 4 February 1922, Harry Price with James Seymour, Eric Dingwall and William S. Marriott had proven the spirit photographer William Hope was a fraud during tests at the British College of Psychic Science. Price wrote in his SPR report \"William Hope has been found guilty of deliberately substituting his own plates for those of a sitter... It implies that the medium brings to the sitting a duplicate slide and faked plates for fraudulent purposes.\"Photos of Ghosts: The Burden of Believing the Unbelievable by Massimo Polidoro The medium Kathleen Goligher was investigated by the physicist Edmund Edward Fournier d'Albe. On July 22, 1921 in a séance he observed Goligher holding the table up with her foot. He also discovered that her ectoplasm was made of muslin. During a séance d'Albe observed white muslin between Goligher's feet.Edmund Edward Fournier d'Albe. (1922). The Goligher Circle. J. M. Watkins. p. 37", "The psychical researchers Eric Dingwall and Harry Price re-published an anonymous work written by a former medium entitled Revelations of a Spirit Medium (1922) which exposed the tricks of mediumship and the fraudulent methods of producing \"spirit hands\".Eric Dingwall, Harry Price. (1922). Revelations of a Spirit Medium. Kegan Paul, Trench, Trübner & Co. Originally all the copies of the book were bought up by spiritualists and deliberately destroyed.Georgess McHargue. (1972). Facts, Frauds, and Phantasms: A Survey of the Spiritualist Movement. Doubleday. p. 158.  In 1923, the magician Carlos María de Heredia revealed how fake spirit hands could be made by using a rubber glove, paraffin and a jar of cold water.Carlos María de Heredia. (1923). Spirit Hands, \"ectoplasm,\" and Rubber Gloves. Popular Mechanics. pp. 14–15", "* Harry Price and Eric Dingwall. (1975). Revelations of a Spirit Medium. Arno Press. Reprint of 1891 edition by Charles F. Pidgeon. This rare, overlooked, and forgotten, book gives the \"insider's knowledge\" of 19th century deceptions."]}]}}