{"wiki_id": "http://www.wikidata.org/entity/Q15137929", "itemLabel": "James Dallaway", "itemDescription": "Antiquary", "wikipedia_url": "https://en.wikipedia.org/wiki/James_Dallaway", "wikipedia_page": {"main": "The Rev. Prebendary James Dallaway FSA (20 February 1763 – 6 June 1834) was an English antiquary, topographer, and miscellaneous writer. He is known for his account of Constantinople and the Greek islands, published in 1797; and his county history of the western parts of Sussex, of which he published two volumes in 1815–19.", "link_mentions": [{"page": "Cirencester Grammar School", "response": ["* James Dallaway (1763–1834), antiquary, topographer and writer."]}, {"page": "William Talbot, 1st Earl Talbot", "response": ["I wish the nominal distinction of Whig and Tory abolished, as the words only, not the sense remain; a Ministerial Whig and a State Tory, when in power, are so exactly alike in their conduct, that my discernment is not sufficient to distinguish one from the other. The principles of a real Whig, in my sense of the term, are these, That government is an original compact between the governors and governed, instituted for the good of the whole community; that in a limited monarchy, or more properly regal commonwealth, the majesty is in the people, and tho'the person on the throne in superior to any individual, he is the servant of the nation;- that the only title to the crown is the election of the people; that the laws are equally obligatory to the Prince and people; that as the constitution of England is formed of three legislation branches, the balance between each must be preserved, to prevent the destruction of the whole; that elections ought to be free, the elected independent;- that a Parliamentary influence by places and pensions is inconsistent with the interest of the public; and that a Minister who endeavours to govern by corruption, is guilty of the vilest attempt to subvert the constitution;- that a standing mercenary army, in time of peace, is contrary to the laws, dangerous to the liberties, and oppressive to the subjects of Great Britain.James Dallaway, Letters of the Late Thomas Rundle, L.L.D., Lord Bishop of Derry in Ireland, to Mrs. Barbara Sandys, of Miserden, Glocestershire: With Introductory Memoirs by James Dallaway, pp.241-3, Byrne & Moore, (1789)"]}, {"page": "William Worcester", "response": ["Worcester made several journeys through England, and his notes (now known as his \"Itineraries\") contain much information. His survey of Bristol, which he appears to have devised as a self-contained work, is particularly detailed, and of great value to historians and antiquaries. Portions of his notes were printed by James Nasmith in 1778; and the description of Bristol was published by James Dallaway under the title William Wyrcestre Redivivus in 1823, and reprinted in his Antiquities of Bristowe in 1834. Modern scholarly editions and translations have been published as the Itineraries of William Worcestre in 1969, edited by John Harvey; and as The Topography of Medieval Bristol in 2000, edited by Frances Neale."]}, {"page": "İznik", "response": ["The Byzantine city is estimated to have had a population of 20,000–30,000 but in the Ottoman period the town was never prosperous and occupied only a small fraction of the walled area. The English clergyman John Covel visited Iznik in 1677 and found that only a third of the town was occupied. In 1745 the English traveller Richard Pococke reported that Iznik was no more than a village. A succession of visitors described the town in unflattering terms. After his visit in 1779, the Italian archaeologist Domenico Sestini wrote that Iznik was nothing but an abandoned town with no life, no noise and no movement. In 1797 James Dallaway described Iznik as \"a wretched village of long lanes and mud walls...\". The town was seriously damaged in 1921 during the Greco-Turkish War (1919–1922); the population became refugees and many historical buildings were damaged or destroyed."]}, {"page": "Ralph Bigland", "response": ["Much of Bigland's antiquarian work was focused on Gloucestershire. Over time, he travelled the whole county, accumulating historical information and making it his business to record the inscriptions on everything from great monuments to modest gravestones. Following his death, his son, Richard, attempted to bring the work to print as a county history, under the editorship of James Dallaway. A number of instalments of the Historical, Monumental, and Genealogical Collections relative to the County of Gloucester were published between 1786 and 1794 (completing two volumes, dated 1791 and 1794), and further instalments appeared sporadically through the 19th century. However, the project remained unfinished until a definitive edition was published in four volumes by the Bristol and Gloucestershire Archaeological Society between 1989 and 1995."]}, {"page": "John Shackleton", "response": ["* Horace Walpole, Anecdotes of painting in England: with some account of the principal artists, ed. James Dallaway, [rev. and enl. edn], 2 (1826), 711"]}, {"page": "Beer Street and Gin Lane", "response": ["Thomas Clerk, in his 1812 The Works of William Hogarth, writes that the sign-painter has been suggested as a satire on Jean-Étienne Liotard (called John Stephen by Clerk), a Swiss portrait painter and enameller whom Horace Walpole praised for his attention to detail and realism, mentioning he was, \"... devoid of imagination, and one would think memory, he could render nothing but what he saw before his eyes.\"Clerk p. 25 In his notes in Walpole's Anecdotes of painting in England, James Dallaway adds a footnote to this statement about Liotard saying, \"Hogarth has introduced him, in several instances, alluding to this want of genius.\"Dallaway in Walpole p. 747"]}, {"page": "Thomas Walker Horsfield", "response": ["Horsfield compiled for John Baxter The History and Antiquities of Lewes and its vicinity (with an appendix, an Essay on the Natural History of the District by Gideon Mantell), two vols. Lewes, 1824–7. This was followed by a more major undertaking, The History and Antiquities and Topography of the County of Sussex, two vols. Lewes, 1835. For the first volume, which contains East Sussex, Horsfield was assisted by William Durrant Cooper; the second volume, on West Sussex, is mainly an abridgment of the histories of James Dallaway and Edmund Cartwright (1773–1833)."]}, {"page": "Charles Boit", "response": ["*Walpole, Horace: Anecdotes of Painting in England…, collected by .. George Vertue, digested and published from his original mss by Horace Walpole, with additions by the Rev. James Dallaway. New edition, revised, with additional notes by Ralph Nicholson Wornum, vol. II, London: Henry G. Bohn, 1849"]}, {"page": "Samuel Freeman (engraver)", "response": ["For Tresham's British Gallery (1815) Freeman engraved the Stafford Gallery replica of Raphael's La vierge au diadème. He also engraved some of the plates for Jones's National Gallery, and numerous portraits for Fisher's National Portrait Gallery. For James Dallaway's edition of Horace Walpole's Anecdotes of Painting he engraved The Marriage of Henry VI and Margaret of Anjou from an ancient painting."]}, {"page": "Renold Elstracke", "response": ["**Walpole'a Anecdotes of Painting, editors James Dallaway and Ralph Nicholson Wornum"]}, {"page": "English county histories", "response": ["*James Dallaway, History of the Western Division of Sussex (1815 to 1832), with Edmund Cartwright"]}, {"page": "Book of Saint Albans", "response": ["The virtues of the gentleman, according to the Book, were skewed towards those useful in military terms. It contained a section on the law of heraldic arms, the Liber Armorum, reporting on the contemporary discussion on the relationship between gentility, and the heraldic practice of \"gate-keeping\" the grant of coats of arms (blazons). The Book took the line that the law of arms was part of the law of nature. James Dallaway reprinted this Book of Arms in his 1793 Inquiries into the Origin and Progress of Heraldry in England.Cooper, p. 46 note 18."]}, {"page": "Harriet Dallaway", "response": ["#REDIRECT James Dallaway"]}, {"page": "John Bacon Sawrey Morritt", "response": ["Morritt travelled from Vienna to Istanbul, where the embarrassed Robert Liston found the British embassy was in no state to lodge him. On a quest for Troy, he arrived, with James Dallaway and other Englishmen, from Lesbos on 6 November 1794, landing about twenty miles below Cape Lectum, in the Sinus Adramyttenus. There he made a survey of the supposed scene of the Iliad."]}, {"page": "List of chaplains of the Levant Company", "response": ["*1794 James Dallaway"]}, {"page": "Thomas Rundle", "response": ["Rundle published four single sermons (1718–36). His Letters … with Introductory Memoirs, Gloucester, 1789, 2 vols. (reprinted, Dublin, same year), were edited by James Dallaway. Most of them are addressed to Barbara (1685–1746), daughter of Sir Richard Kyrle, governor of South Carolina, and widow of William Sandys (1677–1712) of Miserden, Gloucestershire."]}, {"page": "Dallaway, James", "response": ["#redirectJames Dallaway"]}, {"page": "Dallaway", "response": ["* James Dallaway (1763–1864), British antiquary, topographer, and writer"]}]}}