{"wiki_id": "http://www.wikidata.org/entity/Q15221561", "itemLabel": "Ian Sayer", "itemDescription": "British historian", "wikipedia_url": "https://en.wikipedia.org/wiki/Ian_Sayer", "wikipedia_page": {"main": "Ian K. T. Sayer (born 30 October 1945) is a British entrepreneur, World War II historian, author and investigative journalist. His Sayer Transport Group (established in 1967 and sold in 1979) became part of the British and European overnight door to door express parcels delivery industry.\nHe is a World War II historian and studies Nazi Germany documentation.  He is co-author of Nazi Gold, The Story of the World’s Greatest Robbery and claims to remain the only private individual to have been responsible for the location and restitution of looted Nazi gold. That claim remains unchallenged. As a Nazi hunter, he has also tracked down a number of Nazis for war criminal investigations, including SS General Wilhelm Mohnke whose wartime activities were subsequently investigated by the British, Canadian, American and German governments.He currently acts as curator to the \"Ian Sayer Archive\", a collection of contemporary World War II documentation, which assists in providing information to institutions, other historians, authors and researchers of the period.\n\n", "link_mentions": [{"page": "Heinrich Müller (Gestapo)", "response": ["In July 1988, author Ian Sayer received from an anonymous individual a 427-page document, which claimed to be a photocopy of a US Army Counter Intelligence Corps (CIC) file that had been inadvertently released by the US National Archives. The dossier purported to confirm Heinrich Müller had survived the war and been retained by the CIC as an intelligence adviser."]}, {"page": "Kelly's Heroes", "response": ["In 1975 British researcher Ian Sayer began a nine-year investigation into the Guinness entry. The results of his investigation, which confirmed a cover up by the U.S. government together with the involvement of U.S. military and former Wehrmacht and SS officers in the theft, were published in the 1984 book Nazi Gold — The Sensational Story of the World's Greatest Robbery — and the Greatest Criminal Cover-Up. The investigation finally led to two of the missing gold bars (valued in 2019 at over $1 million) being handed over by German officials to the U.S. government in a secret ceremony at Bonn on 27 September 1996. The bullion was transported to the Bank of England where it was held to the account of the Tripartite Commission for the Restitution of Monetary Gold (TCRMG). The first disclosure that the Bank was holding the two bars (complete with Nazi markings) came from a press release issued by the bank on 8 May 1997 which confirmed that the two bars were those that had been identified as missing in the book Nazi Gold. Sayer had given information to the United States Department of State concerning the two bars (amongst other things) in July 1978. In 1983 they finally agreed to investigate using Sayer's evidence. The State Department investigation did not conclude until 1997. On 11 December 1997 Sayer was invited, by the Secretary General of the TCRMG, to view the two bars in the gold bullion vaults of the Bank of England. In addition to being accorded this rare honour, he was also photographed holding the bars, which he had been instrumental in tracking down."]}, {"page": "Alleged doubles of Adolf Hitler", "response": ["In 1998, British author Ian Sayer received from an anonymous source what alleged to be a photocopy of a 427-page report from the U.S. Army's Counterintelligence Corps (CIC), apparently containing a 1948 interview of Gestapo chief Heinrich Müller, who was presumed missing in action in 1945, but claimed to have been retained by the CIC as an intelligence adviser and to have joined the CIA. According to Müller's purported account: a Hitler double was discovered in Breslau in 1941 and was seldom seen after July 1944, being sedated and kept hidden until April 1945; on April 22, Hitler, Braun and three of Hitler's associates departed by air for Hörsching Airport and were then flown to Barcelona; the double was later killed by a coup de grâce, dressed in Hitler's clothes, and buried. Joachimsthaler notes that the plane claimed to have been flown out of Berlin was considered a \"total loss\" by the Luftwaffe in May 1944, and the Junkers Ju 290 supposedly flown to Barcelona had been grounded in that city since the beginning of April 1945. Thereby, the claims of the dossier are considered by historians such as Joachimsthaler and Daly-Groves as an example of created \"myths\"."]}, {"page": "Nazi hunter", "response": ["A Nazi hunter is an individual who tracks down and gathers information on alleged former Nazis, or SS members, and Nazi collaborators who were involved in the Holocaust, typically for use at trial on charges of war crimes and crimes against humanity. Prominent Nazi hunters include Simon Wiesenthal, Tuviah Friedman, Serge Klarsfeld, Beate Klarsfeld, Ian Sayer, Yaron Svoray, Elliot Welles, and Efraim Zuroff.Wiesenthal Center Urges Australian Authorities to Expedite Extradition Proceedings Against Holocaust Perpetrator"]}, {"page": "Douglas Botting", "response": ["*Nazi Gold: The Story of the World's Greatest Robbery - And Its Aftermath (co-author Ian Sayer); Granada, 1984; ", "*America's Secret Army: The Untold Story of the Counter Intelligence Corps (co-author Ian Sayer); Grafton Books, 1989; ", "*Hitler's Last General: The Case Against Wilheim Mohnke (co-author Ian Sayer); Bantam Books, 1989;   ", "*Hitler and Women: The Love Life of Adolf Hitler  (co-author Ian Sayer); Constable and Robinson, 2004; "]}, {"page": "Eric Pleasants", "response": ["Pleasants' autobiography was ghost-written by Eddie Chapman, a British safe-breaker and double agent whom Pleasants befriended in German custody, under the title I Killed to Live – The Story of Eric Pleasants as told to Eddie Chapman, Cassell & Co, 1957. Another version appears to have been edited by Ian Sayer and Douglas Botting and published posthumously as Hitler's Bastard: Through Hell and Back in Nazi Germany and Stalin's Russia, Random House, 2012."]}, {"page": "Sayer", "response": ["* Ian Sayer (1945–present), English writer and businessman"]}, {"page": "Walter Wagner (notary)", "response": ["Wagner's unit was now charged with the defence of the Potsdamer Platz. The fighting was desperate and chaotic. Wagner's friend, colleague and company commander, Erich Illing, was severely wounded by Russian tank fire. Wagner, the Number 1 Section Commander immediately assumed command of the company. As he continued the fight in the Anhalter Bahnhof area he was shot in the head and killed.Hitler and Women – The Love Life of Adolf Hitler, Ian Sayer & Douglas Botting, Constable & Robinson London, 2004  p. 207 It was less than 24 hours since he had married Hitler and Eva Braun. His body was never found.", "Walter Wagner was an enigma. Plucked from obscurity at a critical moment in world history he enjoyed a few brief hours of fame before plunging back into obscurity and dying almost immediately afterwards in the Apocalypse that was Berlin in April 1945. Both his Christian and surnames were common throughout Germany. However, as the notary who had married Hitler and Eva Braun his name appeared in every major work on the Battle of Berlin and Hitler's last days. However, although he was portrayed in many post war films, the real Walter Wagner remained a faceless individual until 2004 when the first photograph of him was published in Hitler and Women – The Love Life of Adolf Hitler, Ian Sayer & Douglas Botting Constable & Robinson London, 2004 .", "In 1980 investigative writer Ian Sayer purchased a postcard, handwritten by Walter Wagner on 30 March 1945. It was addressed to his wife on the Frisian island of Fohr where she was living with his, as yet, unseen son. The stamp was a typical Nazi stamp bearing Hitler's effigy. Someone had written at the top in another hand \"The Last Card\"."]}]}}