{"wiki_id": "http://www.wikidata.org/entity/Q152316", "itemLabel": "Prince Harry, Duke of Sussex", "itemDescription": "younger son of Charles, Prince of Wales, and Diana, Princess of Wales", "wikipedia_url": "https://en.wikipedia.org/wiki/Prince_Harry,_Duke_of_Sussex", "wikipedia_page": {"main": "Prince Harry, Duke of Sussex,  (Henry Charles Albert David; born 15 September 1984), is a member of the British royal family. As the younger son of Charles, Prince of Wales, and Lady Diana Spencer, he is sixth in the line of succession to the British throne.\nBorn in St Mary's Hospital, London, Harry was educated at Wetherby School, Ludgrove School, and Eton College. He spent parts of his gap year in Australia and Lesotho, then underwent officer training at the Royal Military Academy Sandhurst. He was commissioned as a cornet into the Blues and Royals, serving temporarily with his brother William and completed training as a troop leader. In 2007–2008, he served for over ten weeks in Helmand Province, Afghanistan. He returned to Afghanistan for a 20-week deployment in 2012–2013 with the Army Air Corps. In June 2015, he resigned from the army.\nHarry launched the Invictus Games in 2014 and remains the patron of its foundation. He also gives patronage to several other organisations, including the HALO Trust and Walking With The Wounded. To encourage people to open up about their mental health issues, Harry, alongside the Duke and Duchess of Cambridge, initiated the mental health awareness campaign \"Heads Together\" in April 2016.In 2018, Harry was made Duke of Sussex prior to his wedding to American actress Meghan Markle. In January 2020, the couple stepped down as senior members of the royal family and moved to the Duchess's native Southern California. In October 2020, they launched Archewell Inc., an American public organisation that focuses on non-profit activities and creative media ventures. They have two children, Archie and Lilibet Mountbatten-Windsor.", "link_mentions": [{"page": "Diana, Princess of Wales", "response": ["| Prince Harry, Duke of Sussex"]}, {"page": "September 15", "response": ["*1984 – Prince Harry, Duke of Sussex "]}, {"page": "1984", "response": ["* September 15 – Prince Harry, Duke of Sussex, British Prince"]}, {"page": "Norfolk", "response": ["* Charles Spencer, 9th Earl Spencer brother of Diana, Princess of Wales and maternal uncle to H.R.H. Prince William, Duke of Cambridge and Prince Harry, Duke of Sussex"]}, {"page": "British royal family", "response": ["*Other members of the royal family with royal rank who do not carry out official duties are Prince Andrew, Duke of York; Prince Harry, Duke of Sussex; Meghan, Duchess of Sussex; Princess Beatrice; Princess Eugenie; Katharine, Duchess of Kent; and Prince and Princess Michael of Kent."]}, {"page": "Queen Elizabeth The Queen Mother", "response": ["| rowspan=\"4\" | Elizabeth II || rowspan=\"4\" | 21 April 1926 || rowspan=\"4\" | || rowspan=\"4\" | 20 November 1947 || rowspan=\"4\" | Prince Philip, Duke of Edinburgh || Charles, Prince of Wales || Prince William, Duke of CambridgePrince Harry, Duke of Sussex"]}, {"page": "Eton College", "response": ["* Prince Harry, Duke of Sussex (born 1984)"]}, {"page": "Prince Philip, Duke of Edinburgh", "response": ["| Prince Harry, Duke of Sussex"]}, {"page": "Baron", "response": ["Several members of the royal family with the style of Royal Highness are also titled Barons. For example, Charles, Prince of Wales is also The Baron of Renfrew. Similarly, his eldest son Prince William, Duke of Cambridge is also The Baron Carrickfergus. His youngest son, Prince Harry, Duke of Sussex is Baron of kilkeel. Prince Andrew, Duke of York is The Baron Killyleagh."]}, {"page": "Montecito, California", "response": ["* Prince Harry, Duke of Sussex and Meghan, Duchess of Sussex"]}, {"page": "Charles, Prince of Wales", "response": ["| Prince Harry, Duke of Sussex"]}, {"page": "Duke of Edinburgh", "response": ["*** (4) Prince Harry, Duke of Sussex (b. 1984)"]}, {"page": "Henry Charles Albert Windsor", "response": ["#REDIRECT Prince Harry, Duke of Sussex"]}, {"page": "Mountbatten-Windsor", "response": ["***(6)  15px Prince Harry, Duke of Sussex (b. 1984)", "| Prince Harry, Duke of Sussex and Meghan Markle"]}]}}