{"wiki_id": "http://www.wikidata.org/entity/Q1524275", "itemLabel": "Giles MacDonogh", "itemDescription": "British historian", "wikipedia_url": "https://en.wikipedia.org/wiki/Giles_MacDonogh", "wikipedia_page": {"main": "Giles MacDonogh (born 1955) is a British writer, historian and translator.", "link_mentions": [{"page": "Battle of Stalingrad", "response": ["Out of the nearly 91,000 German prisoners captured in Stalingrad, only about 5,000 returned.How three million Germans died after VE Day. Nigel Jones reviews After the Reich: From the Liberation of Vienna to the Berlin Airlift by Giles MacDonogh. The Telegraph, 18 April 2007. Weakened by disease, starvation and lack of medical care during the encirclement, they were sent on foot marches to prisoner camps and later to labour camps all over the Soviet Union. Some 35,000 were eventually sent on transports, of which 17,000 did not survive. Most died of wounds, disease (particularly typhus), cold, overwork, mistreatment and malnutrition. Some were kept in the city to help rebuild it."]}, {"page": "McDonough", "response": ["* Giles MacDonogh (born 1955), British writer, historian and translator"]}, {"page": "Downfall (2004 film)", "response": ["It was criticized for its scenes involving the members of the Nazi party, with author Giles MacDonogh criticizing the portrayals as being sympathetic towards SS officers Wilhelm Mohnke and Ernst-Günther Schenck, the former of whom was accused of murdering a group of British prisoners of war in the Wormhoudt massacre. But at a discussion in London, Hirschbiegel said in response that he did not find the allegations against Schenck convincing. The film was also seen as controversial because it was made by Germans instead of British or American filmmakers. Russian press visited the set, making the producers uneasy and occasionally defensive. Yana Bezhanskay, director of Globus Film, Constantin's Russian partner, raised her voice to Russian journalists and said: \"This is an antifascist film and nowhere in it do you see Hitler praised.\""]}, {"page": "Stasiland", "response": ["Chris Mitchell of Spike Magazine called it \"an essential insight into the totalitarian regime\". Giles MacDonogh wrote in The Guardian that the culture of informants and moral capitulations \"comes wonderfully to life in Funder's racy account\"."]}, {"page": "Scott Moncrieff Prize", "response": ["* Commended: Giles MacDonogh for his translation of Testicles by Blandine Vié (Prospect Books)"]}, {"page": "Wormhoudt massacre", "response": ["The 2004 German film Downfall was criticized by author Giles MacDonogh upon release for its sympathetic portrayal of Mohnke, who many hold directly or indirectly responsible for the massacre."]}, {"page": "Edda Göring", "response": ["The only child of Hermann Göring, Edda was born on 2 June 1938. Her father received approximately 628,000 messages of congratulations on his daughter's birth; tributes came in from all over the world, including telegrams from British Lords Halifax and Londonderry. The historian Giles MacDonogh later described the German reaction to the birth:"]}, {"page": "Luise Eleonore Wreech", "response": ["She became a close friend of Crown Prince Frederick when he stayed at Tamsel between August 1731 and February 1732.  She was described by the Crown Prince as having a \"complexion like roses and lilies.\".Giles MacDonogh, Frederick the Great, New York, 2001, , p. 84"]}, {"page": "46th Infantry Division (United Kingdom)", "response": ["During 1946, the division took part in Operation Keelhaul, which included the forced repatriation of Cossacks to the Soviet Union. The author Ian Mitchell wrote the division was ordered, on 26 May, \"to provide 'static picquets' along the route the Cossacks were to travel\". Mitchell stated the 138th Brigade was informed that \"the return of the Cossacks to Russia is part of an international agreement\", many were wanted for war crimes, and \"any Cossack who escapes will be a menace to British troops stationed in the area\". The men of the division were ordered \"to capture or shoot any Cossack\" who attempted escape, but were to avoid any potential mass shootings. The historian and writer Giles MacDonogh wrote the division, along with the 78th, were engaged in \"some ugly scenes\" once the Cossacks and their families realised what was happening; \"Tommies used rifles, bayonets and pickaxe handles to convince them to board the lorries that would take them to the frontier.\" These efforts resulted in 900 German officers being turned over to the Soviets, among them Helmuth von Pannwitz who was later executed."]}, {"page": "Horcher (restaurant)", "response": ["As of 2019 Horcher's was owned by a member of the fourth generation of the Horcher family, Elisabeth Horcher. The historian Giles MacDonogh said of Horcher's that \"There is no other restaurant in the history of the twentieth — or indeed any — century...that has relocated from one European capital to another without losing a jot of its social exclusivity\". In a 2018 interview with El Confidencial, Elisabeth Horcher referred to her grandparents as \"survivors\" who had \"...had to live through a very convulsive time. They had to leave their country...My grandparents were not supporters of the regime\". Elisabeth Horcher's historical novel her family's story, Los Horcher, was published in 2018."]}]}}