{"wiki_id": "http://www.wikidata.org/entity/Q153408", "itemLabel": "Joseph Banks", "itemDescription": "English naturalist, botanist and patron of the natural sciences (1743-1820)", "wikipedia_url": "https://en.wikipedia.org/wiki/Joseph_Banks", "wikipedia_page": {"main": "Sir Joseph Banks, 1st Baronet,  (24 February [O.S. 13 February] 1743 – 19 June 1820) was an English naturalist, botanist, and patron of the natural sciences.Banks made his name on the 1766 natural-history expedition to Newfoundland and Labrador. He took part in Captain James Cook's first great voyage (1768–1771), visiting Brazil, Tahiti, and after 6 months in New Zealand, Australia, returning to immediate fame. He held the position of president of the Royal Society for over 41 years. He advised King George III on the Royal Botanic Gardens, Kew, and by sending botanists around the world to collect plants, he made Kew the world's leading botanical garden. He is credited for bringing 30,000 plant specimens home with him; amongst them, he discovered 1,400.Banks advocated British settlement in New South Wales and colonisation of Australia, as well as the establishment of Botany Bay as a place for the reception of convicts, and advised the British government on all Australian matters.  He is credited with introducing the eucalyptus, acacia, and the genus named after him, Banksia, to the Western world. Around 80 species of plants bear his name. He was the leading founder of the African Association and a member of the Society of Dilettanti, which helped to establish the Royal Academy.", "link_mentions": [{"page": "Arthur Phillip", "response": ["Lord Sandwich, together with the President of the Royal Society, Sir Joseph Banks, the eminent scientist who had accompanied Lieutenant James Cook on his 1770 voyage, was advocating establishment of a British colony in Botany Bay, New South Wales. Banks accepted an offer of assistance from the American Loyalist James Matra in July 1783. Under Banks's guidance, he rapidly produced \"A Proposal for Establishing a Settlement in New South Wales\" (24 August 1783), with a fully developed set of reasons for a colony composed of American Loyalists, Chinese and South Sea Islanders (but not convicts). The decision to establish a colony in Australia was made by Thomas Townshend, Lord Sydney, as Secretary of State for the Home Office, was the minister in charge. This was taken for two reasons: the ending of transportation of criminals to North America following the American Revolution, as well as the need for a base in the Pacific to counter French expansion.", "Phillip soon decided that this site, chosen on the recommendation of Sir Joseph Banks, who had accompanied James Cook in 1770, was not suitable, since it had poor soil, no secure anchorage and no reliable water source. After some exploration Phillip decided to go on to Port Jackson, and on 26 January the marines and convicts landed at Sydney Cove, which Phillip named after Lord Sydney. This date later became Australia's national day, Australia Day. The colony was formally proclaimed by Governor Phillip on 7 February 1788 at Sydney. Sydney Cove offered a fresh water supply and a safe harbour, which Philip famously described as:"]}, {"page": "British Empire", "response": ["Since 1718, transportation to the American colonies had been a penalty for various offences in Britain, with approximately one thousand convicts transported per year.Smith, p. 20. Forced to find an alternative location after the loss of the Thirteen Colonies in 1783, the British government turned to Australia.Smith, pp. 20–21. The coast of Australia had been discovered for Europeans by the Dutch in 1606,Mulligan & Hill, pp. 20–23. but there was no attempt to colonise it. In 1770 James Cook charted the eastern coast while on a scientific voyage, claimed the continent for Britain, and named it New South Wales.Peters, pp. 5–23. In 1778, Joseph Banks, Cook's botanist on the voyage, presented evidence to the government on the suitability of Botany Bay for the establishment of a penal settlement, and in 1787 the first shipment of convicts set sail, arriving in 1788.James, p. 142. Unusually, Australia was claimed through proclamation. Indigenous Australians were considered too uncivilised to require treaties,Macintyre, pp. 33–34.Broome, p. 18. and colonisation brought disease and violence that together with the deliberate dispossession of land and culture were devastating to these peoples.PascoeMcKenna, pp. 28–29. Britain continued to transport convicts to New South Wales until 1840, to Tasmania until 1853 and to Western Australia until 1868.Brock, p. 159. The Australian colonies became profitable exporters of wool and gold,Fieldhouse, pp. 145–49 mainly because of gold rushes in Victoria, making its capital Melbourne for a time the richest city in the world.Cervero, p. 320"]}, {"page": "Carl Linnaeus", "response": ["His library and collections were left to his widow Sara and their children. Joseph Banks, an eminent botanist, wished to purchase the collection, but his son Carl refused the offer and instead moved the collection to Uppsala. In 1783 Carl died and Sara inherited the collection, having outlived both her husband and son. She tried to sell it to Banks, but he was no longer interested; instead an acquaintance of his agreed to buy the collection. The acquaintance was a 24-year-old medical student, James Edward Smith, who bought the whole collection: 14,000 plants, 3,198 insects, 1,564 shells, about 3,000 letters and 1,600 books. Smith founded the Linnean Society of London five years later.Blunt (2001), pp. 238–240.", "Daniel Solander was living in Linnaeus's house during his time as a student in Uppsala. Linnaeus was very fond of him, promising Solander his eldest daughter's hand in marriage. On Linnaeus's recommendation, Solander travelled to England in 1760, where he met the English botanist Joseph Banks. With Banks, Solander joined James Cook on his expedition to Oceania on the Endeavour in 1768–71.Anderson (1997), p. 96.Blunt (2004), pp. 191–192. Solander was not the only apostle to journey with James Cook; Anders Sparrman followed on the Resolution in 1772–75 bound for, among other places, Oceania and South America. Sparrman made many other expeditions, one of them to South Africa.Blunt (2004), pp. 192–193."]}, {"page": "Human cannibalism", "response": [" The title of the book is drawn from the 16 January 1770 journal entry of Captain James Cook, who, in describing acts of Māori cannibalism, stated \"though stronger evidence of this horrid practice prevailing among the inhabitants of this coast will scarcely be required, we have still stronger to give.\"John Byron, Samuel Wallis, Philip Carteret, James Cook, Joseph Banks (1785, 3d ed.). An account of the voyages undertaken by the order of His present Majesty for making discoveries in the southern hemisphere, vol. 3 (London) p. 295."]}, {"page": "February 24", "response": ["*1743 – Joseph Banks, English botanist and explorer (d. 1820)"]}, {"page": "Humphry Davy", "response": ["In February 1801 Davy was interviewed by the committee of the Royal Institution, comprising Joseph Banks, Benjamin Thompson (who had been appointed Count Rumford) and Henry Cavendish. Davy wrote to Davies Gilbert on 8 March 1801 about the offers made by Banks and Thompson, a possible move to London and the promise of funding for his work in galvanism. He also mentioned that he might not be collaborating further with Beddoes on therapeutic gases. The next day Davy left Bristol to take up his new post at the Royal Institution, it having been resolved 'that Humphry Davy be engaged in the service of the Royal Institution in the capacity of assistant lecturer in chemistry, director of the chemical laboratory, and assistant editor of the journals of the institution, and that he be allowed to occupy a room in the house, and be furnished with coals and candles, and that he be paid a salary of 100l. per annum.'", "The Society was in transition from a club for gentlemen interested in natural philosophy, connected with the political and social elite, to an academy representing increasingly specialised sciences. The previous president, Joseph Banks, had held the post for over 40 years and had presided autocratically over what David Philip Miller calls the \"Banksian Learned Empire\", in which natural history was prominent.David Philip Miller, \"Between hostile camps: Sir Humphry Davy's presidency of the Royal Society of London\", British Journal for the History of Science (1983): 1-47."]}, {"page": "James Cook", "response": ["On 23 April, he made his first recorded direct observation of indigenous Australians at Brush Island near Bawley Point, noting in his journal: \"... and were so near the Shore as to distinguish several people upon the Sea beach they appear'd to be of a very dark or black Colour but whether this was the real colour of their skins or the C[l]othes they might have on I know not.\" On 29 April, Cook and crew made their first landfall on the mainland of the continent at a place now known as the Kurnell Peninsula. Cook originally named the area \"Stingray Bay\", but later he crossed this out and named it \"Botany Bay\" after the unique specimens retrieved by the botanists Joseph Banks and Daniel Solander. It is here that Cook made first contact with an aboriginal tribe known as the Gweagal.", "Cook's journals were published upon his return, and he became something of a hero among the scientific community. Among the general public, however, the aristocratic botanist Joseph Banks was a greater hero. Banks even attempted to take command of Cook's second voyage but removed himself from the voyage before it began, and Johann Reinhold Forster and his son Georg Forster were taken on as scientists for the voyage. Cook's son George was born five days before he left for his second voyage.", "Cook carried several scientists on his voyages; they made significant observations and discoveries. Two botanists, Joseph Banks and the Swede Daniel Solander, sailed on the first voyage. The two collected over 3,000 plant species. Banks subsequently strongly promoted British settlement of Australia, leading to the establishment of New South Wales as a penal settlement in 1788. Artists also sailed on Cook's first voyage. Sydney Parkinson was heavily involved in documenting the botanists' findings, completing 264 drawings before his death near the end of the voyage. They were of immense scientific value to British botanists. Cook's second expedition included William Hodges, who produced notable landscape paintings of Tahiti, Easter Island, and other locations. Several officers who served under Cook went on to distinctive accomplishments. William Bligh, Cook's sailing master, was given command of  in 1787 to sail to Tahiti and return with breadfruit. Bligh became known for the mutiny of his crew, which resulted in his being set adrift in 1789. He later became Governor of New South Wales, where he was the subject of another mutiny—the 1808 Rum Rebellion. George Vancouver, one of Cook's midshipmen, led a voyage of exploration to the Pacific Coast of North America from 1791 to 1794. In honour of Vancouver's former commander, his ship was named . George Dixon, who sailed under Cook on his third expedition, later commanded his own. Henry Roberts, a lieutenant under Cook, spent many years after that voyage preparing the detailed charts that went into Cook's posthumous atlas, published around 1784.", "* The South Seas Project: maps and online editions of the Journals of James Cook's First Pacific Voyage, 1768–1771. Includes full text of journals kept by Cook, Joseph Banks and Sydney Parkinson, as well as the complete text of John Hawkesworth's 1773 Account of Cook's first voyage."]}, {"page": "June 19", "response": ["*1820 – Joseph Banks, English botanist and author (b. 1743)"]}, {"page": "Josiah Wedgwood", "response": ["* Commemorating the landing of the First Fleet at Sydney Cove in January 1788, Wedgwood made the Sydney Cove Medallion, using a sample of clay from the cove from Sir Joseph Banks, who had himself received it from Governor Arthur Phillip. Wedgwood made the commemorative medallion showing an allegorical group described as, \"Hope encouraging Art and Labour, under the influence of Peace, to pursue the employments necessary to give security and happiness to an infant settlement\".; Robert J. King, \"'Etruria': the Great Seal of New South Wales\", Journal of the Numismatic Association of Australia, vol.5, October 1990, pp.3–8. ; photo of example"]}, {"page": "Kangaroo", "response": ["The word kangaroo derives from the Guugu Yimithirr word gangurru, referring to eastern grey kangaroos. The name was first recorded as \"kanguru\" on 12 July 1770 in an entry in the diary of Sir Joseph Banks; this occurred at the site of modern Cooktown, on the banks of the Endeavour River, where  under the command of Lieutenant James Cook was beached for almost seven weeks to repair damage sustained on the Great Barrier Reef.Bruce Moore, The Vocabulary of Australian English, Australian National Dictionary Centre, Australian National University Cook first referred to kangaroos in his diary entry of 4 August. Guugu Yimithirr is the language of the people of the area."]}, {"page": "Koala", "response": ["The first written reference of the koala was recorded by John Price, servant of John Hunter, the Governor of New South Wales. Price encountered the \"cullawine\" on 26 January 1798, during an expedition to the Blue Mountains, although his account was not published until nearly a century later in Historical Records of Australia.Moyal, p. 8 . In 1802, French-born explorer Francis Louis Barrallier encountered the animal when his two Aboriginal guides, returning from a hunt, brought back two koala feet they were intending to eat. Barrallier preserved the appendages and sent them and his notes to Hunter's successor, Philip Gidley King, who forwarded them to Joseph Banks. Similar to Price, Barrallier's notes were not published until 1897.Moyal, pp. 9–10 . Reports of the first capture of a live \"koolah\" appeared in The Sydney Gazette in August 1803.The Sydney Gazette, 21 August 1803, p.3 Within a few weeks Flinders' astronomer, James Inman, purchased a specimen pair for live shipment to Joseph Banks in England. They were described as 'somewhat larger than the Waumbut (Wombat)'. These encounters helped provide the impetus for King to commission the artist John Lewin to paint watercolours of the animal. Lewin painted three pictures, one of which was subsequently made into a print that was reproduced in Georges Cuvier's Le Règne Animal (The Animal Kingdom) (first published in 1817) and several European works on natural history.Moyal, pp. 12–13, 45 ."]}, {"page": "Kiritimati", "response": ["The type specimen of the Tuamotu sandpiper (Prosobonia cancellata) was collected on Christmas Island in 1778, probably on 1 or 2 January, during Captain Cook's visit. The expedition's naturalist William Anderson observed the bird, and it was painted by William Ellis (linked below). The single specimen was in Joseph Banks's collection at the end of the 18th century, but later was lost or destroyed. There is some taxonomic dispute regarding the Kiritimati population."]}, {"page": "Lunar Society of Birmingham", "response": ["While the society's meetings provided its name and social focus, however, they were relatively unimportant in its activities, and far more activity and communication took place outside the meetings themselves – members local to Birmingham were in almost daily contact, more distant ones in correspondence at least weekly. A more loosely defined group has therefore been identified over a wider geographical area and longer time period, who attended meetings occasionally and who corresponded or co-operated regularly with multiple other members on group activities. These include Richard Kirwan, John Smeaton, Henry Moyes, John Michell, Pieter Camper, R. E. Raspe, John Baskerville, Thomas Beddoes, John Wyatt, William Thomson, Cyril Jackson, Jean-André Deluc, John Wilkinson, John Ash, Samuel More, Robert Bage, James Brindley, Ralph Griffiths, John Roebuck, Thomas Percival, Joseph Black, James Hutton, Benjamin Franklin, Joseph Banks, James Lind, William Herschel, Daniel Solander, John Warltire, George Fordyce, Alexander Blair, Samuel Parr, Louis Joseph d'Albert d'Ailly, William Emes, the seventh Duke of Chaulnes, Barthélemy Faujas de Saint-Fond, Grossart de Virly, Johann Gottling. and Joseph Wright.Fraser, David. \"Joseph Wright of Derby and the Lunar Society\", in Egerton, Judy, Wright of Derby (London, 1990)"]}, {"page": "Surfing", "response": ["Various European explorers witnessed surfing in Polynesia.  Surfing may have been observed by British explorers at Tahiti in 1767. Samuel Wallis and the crew members of  were the first Britons to visit the island in June of that year. Another candidate is the botanist Joseph BanksFleming, F. (c. 2005). Off the Map: Tales of Endurance and Exploration, p. 154. Atlantic Monthly Press. who was part of the first voyage of James Cook on , arriving on Tahiti on 10 April 1769. Lieutenant James King was the first person to write about the art of surfing on Hawaii, when he was completing the journals of Captain James Cook (upon Cook's death in 1779)."]}, {"page": "Thylacine", "response": ["The first definitive encounter was by French explorers on 13 May 1792, as noted by the naturalist Jacques Labillardière, in his journal from the expedition led by D'Entrecasteaux. In 1805, William Paterson, the Lieutenant Governor of Tasmania, sent a detailed description for publication in the Sydney Gazette.Paddle (2000), p. 3. He also sent a description of the thylacine in a letter to Joseph Banks, dated 30 March 1805.Description of a Tasmanian Tiger Received by Banks from William Paterson, 30 March 1805. (n.d.). Sir Joseph Banks Papers, State Library of New South Wales, SAFE/Banks Papers/Series 27.33 "]}, {"page": "Tattoo", "response": ["It is commonly held that the modern popularity of tattooing stems from Captain James Cook's three voyages to the South Pacific in the late 18th century. Certainly, Cook's voyages and the dissemination of the texts and images from them brought more awareness about tattooing (and, as noted above, imported the word \"tattow\" into Western languages). On Cook's first voyage in 1768, his science officer and expedition botanist, Sir Joseph Banks, as well as artist Sydney Parkinson and many others of the crew, returned to England with a keen interest in tattoos with Banks writing about them extensively and Parkinson is believed to have gotten a tattoo himself in Tahiti. Banks was a highly regarded member of the English aristocracy that had acquired his position with Cook by co-financing the expedition with ten thousand pounds, a very large sum at the time. In turn, Cook brought back with him a tattooed Raiatean man, Omai, whom he presented to King George and the English Court. On subsequent voyages other crew members, from officers, such as American John Ledyard, to ordinary seamen, were tattooed."]}, {"page": "History of the United Kingdom", "response": ["On 22 August 1770, James Cook discovered the eastern coast of Australia while on a scientific voyage to the South Pacific. In 1778, Joseph Banks, Cook's botanist on the voyage, presented evidence to the government on the suitability of Botany Bay for the establishment of a penal settlement, and in 1787 the first shipment of convicts set sail, arriving in 1788."]}, {"page": "Vanuatu", "response": ["In 1789 William Bligh and the remainder of his crew sailed through the Banks Islands on their return voyage to Timor following the 'Mutiny on the Bounty'; Bligh later returned to the islands, naming them after his benefactor Joseph Banks."]}, {"page": "Wombat", "response": ["After the ship Sydney Cove ran aground on Clarke Island in February 1797, the crew of the salvage ship, Francis, discovered wombats on the island. A live animal was taken back to Port Jackson. Matthew Flinders, who was travelling on board the Francis on its third and final salvage trip, also decided to take a wombat specimen from the island to Port Jackson. Governor John Hunter later sent the animal's corpse to Joseph Banks at the Literary and Philosophical Society to verify that it was a new species. The island was named Clarke Island after William Clark.Nash, M. \"Maritime Archaeology Monograph and Reports Series No.2 – Investigation of a Survivors Camp from the Sydney Cove Shipwreck.\" Master of Maritime Archaeology Thesis. Department of Archaeology, Flinders University, South Australia. 2004. Accessed 30 December 2009."]}, {"page": "William Bligh", "response": ["Bountys log shows that Bligh was relatively sparing in his punishments. He scolded when other captains would have whipped, and whipped when other captains would have hanged. He was an educated man, deeply interested in science, convinced that good diet and sanitation were necessary for the welfare of his crew. He took a great interest in his crew's exercise, was very careful about the quality of their food and insisted upon the Bounty being kept very clean. The modern historian John Beaglehole has described the major flaw in this otherwise enlightened naval officer: \"[Bligh made] dogmatic judgements which he felt himself entitled to make; he saw fools about him too easily … thin-skinned vanity was his curse through life … [Bligh] never learnt that you do not make friends of men by insulting them.\" Bligh was also capable of holding intense grudges against those whom he thought had betrayed him, such as Midshipman Peter Heywood and ship's gunner William Peckover; in regard to Heywood, Bligh was convinced that the young man was as guilty as Christian. Bligh's first detailed comments on the mutiny are in a letter to his wife Betsy,Bligh letter of 1789 in which he names Heywood (a mere boy not yet 16) as \"one of the ringleaders\", adding: \"I have now reason to curse the day I ever knew a Christian or a Heywood or indeed a Manks man.Alexander, p. 152. Natives of the Isle of Man are known as \"Manxmen\". Bligh's later official account to the Admiralty lists Heywood with Christian, Edward Young and George Stewart as the mutiny's leaders, describing Heywood as a young man of abilities for whom he had felt a particular regard.Bligh, Ch. 13. To the Heywood family Bligh wrote: \"His baseness is beyond all description.\"Alexander, p. 168. (Despite Bligh paranoid diatribe of thinking that all the remaining midshipmen who were against him had stayed on the BOunty, the only active supporter of Chrisitan was Ned Young who had slept through the mutiny but only joined it after it was over!)Peckover applied for a position as gunner on HMS Providence (the second breadfruit expedition to Tahiti) but was refused by Bligh. In a letter to Sir Joseph Banks, 17 July 1791 (two weeks before departure), Bligh wrote:", "Should Peckover my late Gunner ever trouble you to render him further services I shall esteem it a favour if you will tell him I informed you he was a vicious and worthless fellow – He applied to me to render him service & wanted to be appointed Gunner of the Providence but as I had determined never to suffer an officer who was with me in the Bounty to sail with again, it was for the cause I did not apply for him. Quoting William Bligh to Sir Joseph Banks, 17 July 1791.", "Bligh had gained a reputation as a firm disciplinarian. Accordingly, he was offered the position of Governor of New South Wales on the recommendation of Sir Joseph Banks (President of the Royal Society and a main sponsor of the breadfruit expeditions) and appointed in March 1805, at £2,000 per annum, twice the pay of the retiring governor, Philip Gidley King. He arrived in Sydney on 6 August 1806, to become the fourth governor. As his wife Elizabeth had been unwilling to undertake a long sea voyage, Bligh was accompanied by his daughter, Mary Putland, who would be the Lady of Government House; Mary's husband John Putland was appointed as William Bligh's aide-de-camp.Whitaker, Anne-Maree, 'William Bligh', in David Clune and Ken Turner (eds), The Governors Of New South Wales 1788–2010, Federation Press, Sydney, 2009, pp. 87–105, . During his time in Sydney, his confrontational administrative style provoked the wrath of a number of influential settlers and officials. They included the wealthy landowner and businessman John Macarthur, and prominent Crown representatives such as the colony's principal surgeon, Thomas Jamison, as well as senior officers of the New South Wales Corps. Jamison and his military associates were defying government regulations by engaging in private trading ventures for profit, a practice which Bligh was determined to put a stop to.", "*William Bligh, Letter from William Bligh to Sir Joseph Banks, 26 November 1805, letter was written from the Lady Madeleleine Sinclair several months before she sailed for New South Wales, State Library of New South Wales, Safe 1/241c. "]}, {"page": "1743", "response": ["* February 13 – Sir Joseph Banks, British naturalist and botanist (d. 1820)"]}, {"page": "1770", "response": ["* April 29 – First voyage of James Cook: Captain Cook drops anchor on  in a wide bay, about 16 km (10 mi) south of the present city of Sydney, Australia. Because the young botanist on board the ship, Joseph Banks, discovers 30,000 specimens of plant life in the area, 1,600 of them unknown to European science, Cook names the place Botany Bay on May 7."]}]}}