{"wiki_id": "http://www.wikidata.org/entity/Q153330", "itemLabel": "Prince Andrew, Duke of York", "itemDescription": "second son and third child of Queen Elizabeth II and Prince Philip, Duke of Edinburgh (born 1960)", "wikipedia_url": "https://en.wikipedia.org/wiki/Prince_Andrew,_Duke_of_York", "wikipedia_page": {"main": "Prince Andrew, Duke of York  (Andrew Albert Christian Edward; born 19 February 1960) is a member of the British royal family. The third child and second son of Queen Elizabeth II and Prince Philip, Duke of Edinburgh, Andrew is ninth in the line of succession to the British throne.\nAndrew served in the Royal Navy as a helicopter pilot and instructor and as the captain of a warship. During the Falklands War, he flew on multiple missions including anti-surface warfare, casualty evacuation, and Exocet missile decoy. In 1986, he married Sarah Ferguson and was created Duke of York. They have two daughters, Princess Beatrice and Princess Eugenie. Their marriage, separation in 1992, and divorce in 1996 attracted extensive media coverage. Andrew served as the UK's Special Representative for International Trade and Investment for 10 years until July 2011.\nAndrew has been accused of child sexual abuse by Virginia Giuffre, who alleges that she was sex trafficked as a minor to him by the American financier and convicted sex offender Jeffrey Epstein. In a BBC television interview in November 2019 he categorically denied Giuffre's allegation. Following intense negative reaction to his connections to Epstein, Andrew permanently resigned from public roles in May 2020, and his honorary military affiliations and royal charitable patronages were returned to the Queen in January 2022. As of January 2022, Andrew is the defendant in a civil lawsuit over sexual assault filed by Giuffre in New York State.\n\n", "link_mentions": [{"page": "February 19", "response": ["*1960 – Prince Andrew, Duke of York"]}, {"page": "House of Lords", "response": ["Of the 92, two remain in the House of Lords because they hold royal offices connected with Parliament: the Earl Marshal and the Lord Great Chamberlain. Of the remaining ninety peers sitting in the Lords by virtue of a hereditary peerage, 15 are elected by the whole House and 75 are chosen by fellow hereditary peers in the House of Lords, grouped by party. (If a hereditary peerage holder is given a life peerage, he or she becomes a member of the House of Lords without a need for a by-election.) The exclusion of other hereditary peers removed Charles, Prince of Wales (who is also Earl of Chester) and all other Royal Peers, including Prince Philip, Duke of Edinburgh; Prince Andrew, Duke of York; Prince Edward, Earl of Wessex; Prince Richard, Duke of Gloucester; and Prince Edward, Duke of Kent."]}, {"page": "Macquarie University", "response": ["The Macquarie University Incubator is a space to research and develop ideas that can be commercialised. It was established in 2017 as a part of the Macquarie Park Innovation District (MPID) project. Macquarie University received $1 million grant from the New South Wales government to build the incubator. The University has also committed about $7 million to the incubator with financial support of the big businesses and the New South Wales government. It was officially opened by Prince Andrew, Duke of York on 25 September 2017."]}, {"page": "Transport for London", "response": ["TfL's Surface Transport and Traffic Operations Centre (STTOC) was officially opened by Prince Andrew, Duke of York in November 2009. The centre monitors and coordinates official responses to traffic congestion, incidents and major events in London. London Buses Command and Control Centre (CentreComm), London Streets Traffic Control Centre (LSTCC) and the Metropolitan Police Traffic Operation Control Centre (MetroComm) were brought together under STTOC."]}, {"page": "1959", "response": ["** Sarah, Duchess of York, British royal and former wife of Prince Andrew, Duke of York"]}, {"page": "1960", "response": ["** Prince Andrew, Duke of York, British prince and second son of Elizabeth II and The Duke of Edinburgh"]}, {"page": "1986", "response": ["* July 23 – In London, Prince Andrew, Duke of York marries Sarah Ferguson at Westminster Abbey."]}, {"page": "Governor General of Canada", "response": ["Sarah, Duchess of York, said in 2009 that sometime during her marriage to Prince Andrew, Duke of York, her husband was offered the position of governor general of Canada, and she speculated in hindsight that their agreement to refuse the commission may have been a contributing factor in their eventual break-up. Instead, Sauvé's tenure as governor general was book-ended by a series of appointments—Edward Schreyer, Ray Hnatyshyn, and Roméo LeBlanc—that have been generally regarded as mere patronage postings for former politicians and friends of the incumbent prime minister at the time, and despite the duties they carried out, their combined time in the viceregal office is generally viewed as unremarkable at best, and damaging to the office at worst. As David Smith described it: \"Notwithstanding the personal qualities of the appointees, which have often been extraordinary, the Canadian governor general has become a hermetic head of state—ignored by press, politicians and public.\" It was theorized by Peter Boyce that this was due, in part, to widespread misunderstanding about the governor general's role coupled with a lack of public presence compared to the media coverage dedicated to the increasingly presidentialized prime minister."]}, {"page": "Westminster Abbey", "response": ["| 23 July 1986|| Prince Andrew, Duke of York, second son of Queen Elizabeth II|| Miss Sarah Ferguson"]}, {"page": "Stone of Scone", "response": ["In 1996, in a symbolic response to growing dissatisfaction among Scots at the prevailing constitutional settlement, the British Government decided that the stone should be kept in Scotland when not in use at coronations. On 3 July 1996, Prime Minister John Major announced to the House of Commons that, seven hundred years after it had been taken, the stone would return to Scotland. On 15 November 1996, after a handover ceremony at the border between representatives of the Home Office and of the Scottish Office, the stone was transported to Edinburgh Castle. An official handover ceremony occurred in the Castle on 30 November 1996, St Andrew's Day, to mark the arrival of the stone. Prince Andrew, Duke of York, representing Queen Elizabeth II, formally handed over the Royal Warrant transferring the stone into the safekeeping of the  Commissioners for the Regalia.The ceremonial of the day:  It currently remains alongside the crown jewels of Scotland, the Honours of Scotland, in the Crown Room of Edinburgh Castle."]}, {"page": "British royal family", "response": ["*Other members of the royal family with royal rank who do not carry out official duties are Prince Andrew, Duke of York; Prince Harry, Duke of Sussex; Meghan, Duchess of Sussex; Princess Beatrice; Princess Eugenie; Katharine, Duchess of Kent; and Prince and Princess Michael of Kent."]}, {"page": "Queen Elizabeth The Queen Mother", "response": ["|| Prince Andrew, Duke of York || Princess BeatricePrincess Eugenie"]}, {"page": "George VI", "response": ["As Duke of York, George bore the royal arms of the United Kingdom differenced with a label of three points argent, the centre point bearing an anchor azure—a difference earlier awarded to his father, George V, when he was Duke of York, and then later awarded to his grandson Prince Andrew, Duke of York. As king, he bore the royal arms undifferenced.Velde, François (19 April 2008), Marks of Cadency in the British Royal Family , Heraldica, retrieved 22 April 2009", "| Prince Philip, Duke of Edinburgh || Charles, Prince of WalesAnne, Princess RoyalPrince Andrew, Duke of YorkPrince Edward, Earl of Wessex"]}, {"page": "Fleet Air Arm", "response": ["* Commander Prince Andrew, Duke of York (1960–): served during the Falklands War 1982 and for some years afterwards."]}, {"page": "Prince Philip, Duke of Edinburgh", "response": ["In the summer of 1946, the King granted Philip permission to marry Elizabeth. Before the official announcement of their engagement in July 1947, Philip relinquished his Greek and Danish royal titles and styles, became a naturalised British subject, and adopted his maternal grandparents' surname Mountbatten. He married Elizabeth on 20 November 1947. The day prior to their wedding, the King granted Philip the style His Royal Highness. On the day of their wedding, he was additionally created Duke of Edinburgh, Earl of Merioneth, and Baron Greenwich. Philip left active military service when Elizabeth ascended the throne in 1952, having reached the rank of commander. In 1957, he was created a British prince. Philip had four children with Elizabeth: Charles, Prince of Wales; Anne, Princess Royal; Prince Andrew, Duke of York; and Prince Edward, Earl of Wessex. Through a British Order in Council issued in 1960, descendants of Philip and Elizabeth who do not bear royal titles or styles may use the surname Mountbatten-Windsor. The surname has also been used by members of the royal family who hold titles.", "! rowspan=\"2\" scope=\"row\" | Prince Andrew, Duke of York"]}, {"page": "Patrick Stewart", "response": ["Having lived in Los Angeles for many years, Stewart moved back to England in 2004, in part to return to work in the theatre. In the same year, Stewart was appointed chancellor of the University of Huddersfield and subsequently as a professor of performing arts in July 2008. In these roles, Stewart has regularly attended graduation ceremonies in the UK and Hong Kong and teaches master classes for drama students. He stepped down from the chancellorship in July 2015, and was named chancellor emeritus in the installation ceremony for his successor, Prince Andrew, Duke of York. In August 2016 a building at the university was renamed the \"Sir Patrick Stewart Building\"."]}]}}