{"wiki_id": "http://www.wikidata.org/entity/Q15304265", "itemLabel": "Eddie Charlton", "itemDescription": "squash player", "wikipedia_url": "https://en.wikipedia.org/wiki/Eddie_Charlton_(squash_player)", "wikipedia_page": {"main": "Eddie Charlton (born 11 July 1988 in Nottingham) is a professional squash player who represents England. He reached a career-high world ranking of World No. 50 in April 2015. He coaches Sara Thomas.Currently the head pro at the Toledo Club. Previously the head pro at University Club of Chicago. Eddie loves the community atmosphere of the sport.", "link_mentions": [{"page": "Eddie Charlton", "response": ["Always active in the organisation and promotion of the game, Charlton was appointed a Member of the Order of Australia (AM) in 1980. He formed the Australian Professional Players Association and was responsible for bringing many of the top players to play in Australia. He released a 30-minute beginners' instructional video, Eddie Charlton's Snooker, Pool & Trick Shots, in PAL VHS format. In 1993 he was inducted into the Sport Australia Hall of Fame. He stopped competing in 1995 and died in Palmerston North, New Zealand on 8 November 2004 following an operation."]}, {"page": "Edward Charlton", "response": ["*Eddie Charlton (1929–2004), Australian snooker player", "*Eddie Charlton (squash player), English squash player"]}, {"page": "Eddie (given name)", "response": ["*Eddie Charlton (1929–2004), Australian snooker and billiards player", "*Eddie Charlton (born 1988), English squash player"]}, {"page": "2013 PSA World Tour", "response": ["| Nicolas Müller Grégoire Marche Andrew Wagih Shoukry Eddie Charlton", "| Campbell Grayson Christopher Gordon Eddie Charlton Erik Tepos Valtierra", "| Christopher Gordon Shaun Le Roux Muhd Asyraf Azan Eddie Charlton", "| Campbell Grayson Martin Knight Eddie Charlton Eric Gálvez"]}, {"page": "World University Squash Championships", "response": ["| Eddie Charlton"]}, {"page": "2014 PSA World Tour", "response": ["| Tom Richards Henrik Mustonen Eddie Charlton Rex Hedrick"]}, {"page": "2015–16 PSA World Tour", "response": ["| Piëdro Schweertman Eddie Charlton Mohamed El Gawarhy Nathan Lake", "| Chris Simpson Ryan Cuskelly Piëdro Schweertman Eddie Charlton", "| Lucas Serme Eddie Charlton", "| Eddie Charlton Henrik Mustonen", "| Henrik Mustonen Diego Elías Shawn Delierre Eddie Charlton", "| Piëdro Schweertman Jens Schoor Eddie Charlton Steven Finitsis", "| Tom Ford Eddie Charlton", "| Eddie Charlton11–9, 11–3, 11–3", "| Mahesh Mangaonkar  Eddie Charlton"]}, {"page": "2016–17 PSA World Tour", "response": ["| Leandro Romiglio Eddie Charlton Martin Knight Jesús Camacho", "| Eddie Charlton Leandro Romiglio Henrik Mustonen Clinton Leeuw", "| Eddie Charlton Christopher Gordon Joshua Larkin Faraz Khan", "| Eddie Charlton11–9, 11–5, 4–11, 11–6", "| Eddie Charlton Reuben Phillips", "| Faraz Khan Jesús Camacho Eddie Charlton Reuben Phillips", "| Eddie Charlton13–11, 11–5, 11–5"]}]}}