{"wiki_id": "http://www.wikidata.org/entity/Q15458124", "itemLabel": "Robert Rigby", "itemDescription": "British writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Robert_Rigby", "wikipedia_page": {"main": "Robert Rigby began his career as a journalist, then spent several years in the music business as a songwriter and session musician. In 1978, the independent record label Flight, released a single by Rigby and the following year Fusion Records (a subsidiary of Rediffusion) released the \"Let The Music Play\" single.  Around this time Rigby also wrote the Rock Star musical, based on the Nativity story. This was recorded and released as an album by Fusion records, produced by Daniel Brown and Mike Wade.\nHe turned to writing for radio, television and the theatre, and has also directed and performed in children’s theatre throughout the country. He has become an established young people’s playwright, and his award-winning work with youth theatre companies has been seen in Britain, Europe, the US and Africa. Rigby wrote the novelizations of the movies, Goal! (film) and Goal II, and his scripts for television include the long-running BBC children’s drama series, Byker Grove.\nRigby also co-wrote the Boy soldier series of books with Andy McNab.", "link_mentions": [{"page": "Andy McNab", "response": ["The Nick Stone Missions are a successful series based on an ex-SAS soldier working on deniable operations for British intelligence. The series draws extensively on McNab's experiences and knowledge of Special Forces soldiering. The Boy Soldier Series was written with the co-operation of Robert Rigby and follows a boy named Danny Watts and his grandfather Fergus, apparently a rogue ex-SAS soldier.", "Boy Soldier Series (written with Robert Rigby)"]}, {"page": "Boy Soldier Series", "response": ["Boy Soldier is a series of novels written by Andy McNab with the co-operation of Robert Rigby. It tells the story of a boy named Danny Watts and his grandfather Fergus, apparently a rogue ex-SAS soldier."]}, {"page": "The Off Cut Festival", "response": ["The first festival was held at The Old Red Lion Theatre in Angel, London from 29 September to 18 October. The panel was headed by Moira Buffini, and included playwrights Josephine Melville and Robert Rigby, directors Psyche Stott and Nigel Douglas, producer Andrew Robb; literary agent Anna Brewer; playwright and actor Andrew Neil and Old Red Lion Artistic directors, Helen and Damien Devine."]}, {"page": "Sharkmouth", "response": ["In an August 2013 interview with Michael Smith of TheMusic.com.au, Morris recalled: \"I originally did four tracks, 'Blackdog Blues', 'Ballad of Les Darcy', 'Big Red' and 'Sharkmouth' – and I thought I'd see if anyone was interested. We did the rounds and went to all the record companies, and all of them said no.\" Morris continued with the recording, \"I went back offering not only the album but also the publishing on the album and my old publishing, on songs like 'Wings of an Eagle' and 'Sweet, Sweet Love', but they still declined to release it.\" Morris pressed 500 copies of the album and began performing it at gigs when Robert Rigby from Ambition Entertainment said he'd release it under the FanFare label."]}, {"page": "Rigby, Robert", "response": ["#redirectRobert Rigby"]}]}}