{"wiki_id": "http://www.wikidata.org/entity/Q15453108", "itemLabel": "Margaret Stuart", "itemDescription": "British writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Dorothy_Margaret_Stuart", "wikipedia_page": {"main": "Dorothy Margaret Stuart, née Browne (1889, Meerbrook, Staffordshire – 14 September 1963) was a British poet and writer.In 1924 she won a silver medal in the art competitions of the Olympic Games for her \"Fencers' song\" cycle, Sword Songs.Her other works include literary and historical biographies, historical non-fiction particularly concentrating on the lives of women and children, and history stories for children. She was a member of the English Association from 1930 onwards, edited its News-Letter and contributed essays and book reviews to its journal, English.", "link_mentions": [{"page": "Poems of Today", "response": ["Lascelles Abercrombie - J. Redwood Anderson - W. H. Auden - George Barker - Julian Bell - Laurence Binyon - Edmund Blunden - Cicely Boas - Guy Boas - Lilian Bowes Lyon - A. C. Boyd - Robert Bridges - Hilton Brown - Roy Campbell - G. M. Cookson - Frances Cornford - W. H. Davies - Cecil Day-Lewis - Walter De la Mare - John Drinkwater - Clifford Dyment - Richard Eberhart - Robin Flower - John Freeman - John Gawsworth - Wilfrid Gibson - Lord Gorell - C. L. Graves - I. Sutherland Groom - Thomas Hardy - Phyllis Hartnoll - Christopher Hassall - A. P. Herbert - Gerard Manley Hopkins - E. V. Knox - D. H. Lawrence - John Lehmann - F. L. Lucas - Louis MacNeice - Charles Madge - John Masefield - Huw Menai - E. H. W. Meyerstein - Harold Monro - Edwin Muir - Seán O'Casey - Wilfred Owen - Herbert E. Palmer - Ruth Pitter - Frederic Prokosch - John Pudney - Herbert Read - James Reeves - Michael Roberts - V. Sackville-West - Siegfried Sassoon - Geoffrey Scott - Edith Sitwell - Osbert Sitwell - Stephen Spender - L. A. G. Strong - Jan Struther - Dorothy Margaret Stuart - A. S. J. Tessimond - Dylan Thomas - W. J. Turner - James Walker - Rex Warner - Dorothy Wellesley - Laurence Whistler - Humbert Wolfe - W. B. Yeats - Andrew Young"]}, {"page": "Art competitions at the 1924 Summer Olympics", "response": ["| 2 || align=\"left\"| Dorothy Margaret Stuart || align=\"left\"| "]}, {"page": "Margaret Stuart (poet)", "response": ["#REDIRECT Dorothy Margaret Stuart"]}, {"page": "Dorothy Stuart", "response": ["#REDIRECT Dorothy Margaret Stuart"]}, {"page": "Dorothy Margaret Stewart", "response": ["#REDIRECT Dorothy Margaret Stuart"]}, {"page": "Participation of women in the Olympics", "response": ["At the 1924 Summer Olympics held the same year in Paris, women's fencing made its debut with Dane, Ellen Osiier winning the inaugural gold. Dorothy Margaret Stuart was the first woman to gain a medal in the Arts, winning silver in Mixed Literature."]}]}}