{"wiki_id": "http://www.wikidata.org/entity/Q15452415", "itemLabel": "Simon Taylor", "itemDescription": "English artist", "wikipedia_url": "https://en.wikipedia.org/wiki/Simon_Taylor_(artist)", "wikipedia_page": {"main": "Simon Taylor is an artist / painter. Born in Gloucester, England on the 22 June 1969.  Living in Lydney in the Forest of Dean then moving to Manchester and graduating in 1994 with degree in Fine Art.\nHe has exhibited nationally and internationally completing a number of solo exhibitions in public galleries and has exhibited in exhibitions in Manchester, London, Dublin, Milan, Brussels and Utrecht.\nHis works have been used for television productions and a variety of publications worldwide. His paintings are collected internationally and he has works in public collections after winning the prestigious Sefton Open art prize in 2006.\nHis painting process is complex: working from photographs taken from magazines, life and film stills. Each image is dis-assembled and de-constructed from the original source and context then re-assembled. The images are re-edited to create new narratives, which exist only on the painted surface of his works. Characters are given the freedom to interact with themselves and/or different backdrops, manipulating the time and space that they originally inhabited.\nThe finished works are painted using acrylic paint onto various surfaces including canvas, wood panels and aluminum.\n\"He takes a variety of subjects and treats them in different styles. It can be documentary, as his 'Scenes of Crime' and 'Disposables' series, impressionistic in 'Travel Pictures' or surreal in 'Self-Portrait as a Consumer'. \n\"So Do We Really Know What We Are Seeing\", The Huddersfield Daily Examiner, 5 June 1998, page 15\".", "link_mentions": [{"page": "Simon Taylor", "response": ["Simon Taylor may refer to:", "*Simon Taylor (sugar planter) (1739–1813), British sugar planter in Jamaica", "*Simon Taylor (rugby union) (born 1979), Scottish rugby union footballer", "*Simon Taylor (ship), convict ship to Western Australia", "*Simon Taylor (footballer born 1970), Australian rules footballer who played for the Collingwood Football Club", "*Simon Taylor (footballer born 1982), Australian rules footballer who played for the Hawthorn Football Club", "*Simon Taylor (journalist) (born 1944), British motor sport writer and editor", "*Simon Taylor (comedian), Australian Comedian", "*Simon Taylor (artist) (born 1969), English artist ", "*Simon Taylor (musician), drummer for InMe"]}, {"page": "1969 in the United Kingdom", "response": ["* 22 June – Simon Taylor, English graphic artist"]}, {"page": "Simon Taylor Artist", "response": ["#REDIRECT Simon Taylor (artist)"]}, {"page": "Chris Ashworth (artist)", "response": ["Chris Ashworth is an English graphic designer known for being the executive global creative director for Getty Images and the art director of the magazine Ray Gun in 1997. In addition to his work on Ray Gun, Ashworth also created the brochure and promotional materials for the first MTV Europe Music Awards in collaboration with John Warwicker and Simon Taylor. His work on the brochures earned him more work with MTV, as well as work with Warner Music Group and Image Bank."]}]}}