{"wiki_id": "http://www.wikidata.org/entity/Q15432181", "itemLabel": "Edward Hamilton", "itemDescription": "English physician and homeopath", "wikipedia_url": "https://en.wikipedia.org/wiki/Edward_Hamilton_(homeopath)", "wikipedia_page": {"main": "Edward Hamilton (1815 – 3 August 1903) was an English physician who practiced homeopathy, and is noted for his 1852–53 two-volume work The Flora Homoeopathica with colour illustrations and descriptions of the medicinal plants then used in homoeopathic remedies.", "link_mentions": [{"page": "George Brettingham Sowerby I", "response": ["George's son Henry was born in Kensington on 28 March 1825. He was educated at Bickerdike's school, Kentish Town, and University College, Gower Street. From 1843 to 1852 he was assistant curator/librarian to the Linnean Society. He went out to Australia in 1854, and became draughtsman at the Melbourne University, and subsequently teacher of drawing in the state schools. During the last twenty years of his life he devoted himself to gold mining. He died near Melbourne on 15 Sept. 1891, having married, in April 1847, Miss Annie Faulkner. He wrote for Reeve's popular handbooks 'Popular Mineralogy,' London, 1850, and illustrated various books such as Flora Homoeopathica of Edward Hamilton which appeared in 1852–53."]}, {"page": "Edward Hamilton", "response": ["Edward Hamilton may refer to:", "*Sir Edward Hamilton, 1st Baronet (1772–1851), Royal Navy admiral", "*Edward Hamilton (pastoralist) (1809–1898), British pastoralist in New South Wales and Member of Parliament for Salisbury", "*Edward Hamilton (homeopath) (1815–1903), British homeopath", "*Edward Hamilton (Australian politician) (1831–?), Colonial Architect and member of the House of Assembly in South Australia", "*Edward Hamilton (British Army officer) (1854–1944), British Army officer"]}, {"page": "List of florilegia and botanical codices", "response": ["* 1852–53 London Flora Homoeopathica Edward Hamilton (1815–1903)"]}]}}