{"wiki_id": "http://www.wikidata.org/entity/Q15493820", "itemLabel": "Howard Thomas", "itemDescription": "Welsh-born British radio producer and television executive", "wikipedia_url": "https://en.wikipedia.org/wiki/Howard_Thomas", "wikipedia_page": {"main": "Howard Thomas CBE (5 March 1909 – 6 November 1986) was a Welsh radio producer and television executive.", "link_mentions": [{"page": "ABC Weekend TV", "response": ["ABC Weekend TV was one of a number of commercial television companies established in the United Kingdom during the 1950s by cinema chain companies, in an attempt to safeguard their business by becoming involved with television, which was taking away their cinema audiences. In this case, the parent company was the Associated British Picture Corporation (ABPC), which initially did not wish to become involved with the new broadcasting system, but was persuaded to do so by the Independent Television Authority (ITA) and the manager of its Pathé News subsidiary Howard Thomas, who became the new company's managing director."]}, {"page": "Thames Television", "response": ["The ITA ordered ABC's managing director Howard Thomas and its director of programmes Brian Tesler to be appointed in similar capacities at the new station, the only individuals named or specified in all 15 franchise awards. ABC had majority control of the new company and the make-up of its board predominantly (and eventually fully) came from ABC. The use of ABC's old studios at Teddington meant the workforce was predominantly ex-ABC, although those at Kingsway were ex-Rediffusion."]}, {"page": "Sydney Newman", "response": ["Several of the General Motors Theatre plays, including Hailey's Flight into Danger, were purchased for screening by the BBC in the United Kingdom. The productions impressed Howard Thomas, who was the managing director of Associated British Corporation (ABC), the franchise holder for the rival ITV network in the English Midlands and the North at weekends. Thomas offered Newman a job with ABC as a producer of his own Saturday night thriller series, which Newman accepted, moving to Britain in 1958. In 1975 the Head of Drama at the CBC, John Hirsch, noted that the tendency of so many writers and directors having followed Newman to the UK in the 1950s and never having returned to work in Canada had a detrimental impact on the standard of subsequent Canadian television drama."]}, {"page": "Lew Grade", "response": ["ITC's success continued and had many internationally successful TV series, leading Howard Thomas, managing director of the Associated British Corporation (ABC), to complain that Grade distributed programming for \"Birmingham, Alabama, rather than Birmingham, England\".Carl Ellis Lew Grade, Part 4: Embracing the 1950s , TV Heroes, Transdiffusion. These series included The Saint (1962–1969), which was sold to over 80 countries,James Chapman Saints and Avengers: British Adventure Series of the 1960s, London: I.B Tauris, 2002, p.100 and two featuring Patrick McGoohan: Danger Man (1960–1968) and The Prisoner (1967–1968). These series, exclusively thrillers, were normally used as summer replacements for American-made programmes until the mid-1960s.Stuart Hood \"Export Backlash\", The Spectator, 25 November 1966, p. 12  While many of Grade's series used American actors in lead roles (The Baron and Man in a Suitcase, for example) it was those series which used an exclusively British cast, such as The Saint (and The Avengers, made by another ITV contractor), which were more successful in the United States.Chapman, Saints and Avengers, p. 11"]}, {"page": "Armchair Theatre", "response": ["The series was launched by Howard Thomas, head of ABC at the time,\"The Aimchair Theatre Effect\" , Teletronic website. who argued that \"Television drama is not so far removed from television journalism, and the plays which will grip the audience are those that face up to the new issues of the day as well as to the problems as old as civilisation.\"Cited by George W. Brandt British Television Drama, Cambridge: Cambridge University Press, 1981, p. 24.", "Newman's three-and-a-half-season involvement in Armchair Theatre concluded at the end of December 1962. He was succeeded by Leonard White, an early producer of The Avengers. In Armchair Theatres last years Lloyd Shirley was the series producer. A holdover from the Newman era, Clive Exton's legal satire The Trial of Dr Fancy (13 September 1964), was among the first television plays on ITV to be suppressed. The deliberately absurd and savage play was a conscious break on Exton's part from the social realism of which he had grown tired. Although the Independent Television Authority (ITA), the regulator of the commercial channel at the time, had not objected to the production, Howard Thomas of ABCObituary: Clive Exton, The Times, 22 August 2007. feared that it would give offence to viewers.Mark Duguid \"Trial of Dr Fancy, The (1964)\", BFI screenonline; Anthony Hayward, in his obituary of Exton in The Independent (18 August 2007), inaccurately places the blame on the ITA rather than the production company. The programme controller at ABC, Brian Tesler, explained the later change of heart: \"We believe that the climate of opinion concerning black comedy has changed in the past two years. When the play was recorded we felt that many people might fail to appreciate the compassion which underlies the irony in Mr Exton's play.\"Dennis Barker Obituary: Clive Exton, The Guardian, 21 August 2007."]}, {"page": "Associated British Picture Corporation", "response": ["In 1955, the Independent Television Authority (ITA) awarded one of the four initial contracts for commercial television in the UK to ABPC (after original awardee Kemsley-Winnick Television collapsed). The contract was to provide programming on the new ITV network in the Midlands and northern England on Saturdays and Sundays. The board of ABPC had been unconvinced by the merits of entering the television market, but were eventually convinced by the ITA who believed they were the only acceptable option to take the contract. Former head of British Pathé Howard Thomas was appointed as the station's managing director."]}, {"page": "1986 in Wales", "response": ["*6 November (at Henley-on-Thames) – Howard Thomas, radio producer, 77"]}, {"page": "Pearson Playwrights' Scheme", "response": ["In 1973, Howard Thomas, then managing director of Thames Television, launched the Thames Television Theatre Writers Scheme to support and celebrate new writing in the theatre. He believed that television owed much to the theatre for its supply of creative talent. In 1993 Pearson PLC took over the sponsorship of the scheme and it became the Pearson Playwrights' Scheme.Pearson Playwrights' Scheme writersservices.comShenton's View, The Nurturing of New Playwrights The Stage"]}, {"page": "The Brains Trust", "response": ["The series was created by BBC producers Howard Thomas and Douglas Cleverdon.Thomas, Howard With An Independent Air London: Weidenfeld & Nicolson 1977  The programme started on the Forces radio service in 1 January 1941, the first series under the name Any Questions? (a name later reused for a different radio programme).\"The BBC Story – The Brains Trust\", bbc.co.uk Subsequently renamed The Brains Trust, it continued for 84 weeks continuously from its initial broadcast and became one of the most popular of informational programmes. Because of its popularity, it was moved to the peak time on Sunday afternoons. It was typically heard by around 29 per cent of the UK population and generated four to five thousand letters each week from the public. During the early war years it helped raise morale, and the verbal sparring between panel members, especially Julian Huxley and Cyril Joad, made it one of the most popular programmes.(2)", "Listeners or viewers sent in questions on subjects ranging from practical conundrums to moral dilemmas for the panel members to answer. The panellists were chosen for the unique contributions each could bring to the subject matter—from the most erudite and serious to the most irreverent and comedic. One question which has become a classic example of its kind was 'How does a fly land on a ceiling? Does it loop the loop, or what?'. Although questions on religion and politics were initially included, these were banned as the programme progressed, following complaints from the Church and Government. Concern also arose with the BBC itself. One controller, A. P. Ryan, wrote to the Director-General complaining of the programme's political bias. The Controller of Programmes analysed the political attitudes of contributors and calculated a proportion of 25 left-wing and 28 right-wing along with three 'doubtfuls'. He agreed, however, that two of the three regulars, Joad and Huxley, were left-wing. They were also agnostics, a matter of irritation to Dr J. W. Welch, the Director of Religious Broadcasting. In June 1941 the Controller of Programmes instructed the panel to 'avoid all questions involving religion, political philosophy or vague generalities about life'. In June 1942 the Board of Governors reiterated that questions about religion were to be excluded.Howard Thomas, With an Independent Air, London : Weidenfeld and Nicolson, 1977, 81–82."]}, {"page": "List of International Emmy Award winners", "response": ["|Howard Thomas"]}, {"page": "1909 in Wales", "response": ["*5 March – Howard Thomas, radio and television producer (died 1986)"]}, {"page": "Howard Thomas (wrestler)", "response": ["Thomas competed in the 1932 Summer Olympics in Men's Freestyle 66 kg and in the 1936 Summer Olympics in same event, but did not win a medal.Howard Thomas' profile at Sports Reference.com  He won a gold medal in the lightweight division at the 1930 British Empire Games and a bronze medal in the same event at the 1934 British Empire Games.Howard Thomas' profile at the Canadian Olympic CommitteeCommonwealth Games Federation  Thomas died in Burlington, Ontario in 1995. "]}, {"page": "Strategic Management Society", "response": ["*Howard Thomas, 1997–2000"]}, {"page": "Douglas Cleverdon", "response": ["In 1939 he joined the BBC, where he co-created The Brains Trust with fellow producer Howard Thomas.Thomas, Howard With An Independent Air London: Weidenfeld & Nicolson 1977  From 1945 he was in the department headed by Laurence Gilliam.Asa Briggs, The History of Broadcasting in the United Kingdom (1995), p. 348. Later, in 1948, Cleverdon would adapt and produce David Jones's major poem In Parenthesis for radio, with Richard Burton and Dylan Thomas, with music by Elizabeth Poston,The Official Richard Burton Website  for BBC Radio's Third Programme. In 1954 Cleverdon produced Under Milk Wood, the premier of the Dylan Thomas dramatic poem; according to Jenny Abramsky it had taken seven years to persuade Thomas to write it.BBC – Press Office – Jenny Abramsky Oxford lecture one At around this time he also worked with Henry Reed on the Hilda Tablet cycle of plays."]}, {"page": "London Press Exchange", "response": ["*Howard Thomas (1909—1986) worked in the commercial radio section"]}]}}