{"wiki_id": "http://www.wikidata.org/entity/Q15486156", "itemLabel": "Irene Thomas", "itemDescription": "British radio personality", "wikipedia_url": "https://en.wikipedia.org/wiki/Irene_Thomas", "wikipedia_page": {"main": "Elsie Irene Ready (28 June 1920 – 27 March 2001) was a British radio personality, well known for her participation in quiz shows and panel games from the 1960s until shortly before her death.", "link_mentions": [{"page": "My Word!", "response": ["The programme ran for 38 series, until 1988. Muir and Norden were in every series, always on opposing teams. As Muir's partner, Barnett was succeeded during the first series by the novelist and critic E. Arnot Robertson. On Robertson's death in 1961 the film critic and Greek scholar Dilys Powell took her place until the show finished, when she was aged 87. Norden's first partner was Nancy Spain; after her death in 1964 she was succeeded by the journalist Anne Scott-James, and then from 1979 by the historian Antonia Fraser. In the one season in which Fraser took the chair her place as Norden's teammate was taken by Irene Thomas.\"My Word!\", BBC Genome. Retrieved 3 May 2021", "| Muir, Norden, Powell, Irene Thomas"]}, {"page": "Round Britain Quiz", "response": ["Regional contestants have included Irene Thomas, John Julius Norwich, Fred Housego, Brian J. Ford, Patrick Hannan and Philippa Gregory. Current contestants include Marcus Berkmann, David Edwards, Adèle Geras, Stuart Maconie, Val McDermid and Paul Sinha."]}, {"page": "Brain of Britain", "response": ["||1961||Irene Thomas"]}, {"page": "Spelthorne College", "response": ["* Irene Thomas, radio quiz show personality"]}, {"page": "1920 in radio", "response": ["*28 June – Irene Thomas, British radio quiz show player (d. 2001)"]}, {"page": "2001 in radio", "response": ["*March 27: Irene Thomas, 80, British radio quiz show player"]}, {"page": "Brooklands College", "response": ["* Irene Thomas"]}, {"page": "2001 in British radio", "response": ["*27 March – Irene Thomas, 80, radio personality"]}, {"page": "List of Desert Island Discs episodes (1991–2000)", "response": ["|||Irene Thomas||Complete score of Fidelio by Beethoven|||| more"]}, {"page": "1961 in British radio", "response": ["*Chorus singer Irene Thomas enters and wins the Brain of Britain contest, heralding a forty-year period as a mainstay of radio panel game quiz programmes."]}, {"page": "Woman & Home", "response": ["* Irene Thomas, columnist"]}, {"page": "The 607080 Show", "response": ["The 607080 Show was a 1970s British lifestyle television programme aimed at retired people that was presented by Roy Hudd and Irene Thomas.", "The studio based programme was directed by Giles Oakley, produced for BBC One by Brigit Barry and broadcast on Sundays. It included financial advice, health tips and hobbies for older people, nostalgic music and guests such as the Minister of State for Social Security Alf Morris.  The title of the programme was pronounced '6 O 7 O 8 O show'. Roy Hudd was under 40 at the time and neither presenter was in the target age range when the programme was first broadcast.Irene Thomas Obituary at the Daily Telegraph.Retrieved 20 March 2014The 607080 Show at the BFI Film and TV Database, Retrieved 20 March 2014"]}, {"page": "Deaths in March 2001", "response": ["*Irene Thomas, 79, British radio personality."]}, {"page": "List of Private Passions episodes (1995–1999)", "response": ["|rowspan=\"11\"|Irene Thomas"]}, {"page": "1920 in British radio", "response": ["* 28 June – Irene Thomas, radio quiz show player (died 2001)"]}]}}