{"wiki_id": "http://www.wikidata.org/entity/Q15460778", "itemLabel": "Kathleen Tynan", "itemDescription": "British writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Kathleen_Tynan", "wikipedia_page": {"main": "Kathleen Jeannette Halton Tynan (January 25, 1937 – January 10, 1995) was a Canadian-British journalist, author, and screenwriter.", "link_mentions": [{"page": "January 10", "response": ["*1995 – Kathleen Tynan, Canadian-English journalist, author, and screenwriter (b. 1937)Buck, Joan Juliet. \"Obituary: Kathleen Tynan\" , The Independent, January 11, 1995. Last accessed March 11, 2009."]}, {"page": "1979 in film", "response": ["| Agatha || Warner Bros. / Casablanca FilmWorks / First Artists || Michael Apted (director); Kathleen Tynan, Arthur Hopcraft (screenplay); Dustin Hoffman, Vanessa Redgrave, Timothy Dalton, Helen Morse, Celia Gregory, Paul Brooke, Carolyn Pickles, Timothy West, Tony Britton, Alan Badel, Robert Longden, Donald Nithsdale, Yvonne Gilan, Sandra Voe, Barry Hart, David Hargreaves, Tim Seely, Jill Summers, Chris Fairbank, Liz Smith, Peter Arne || Drama, Thriller || Live Action"]}, {"page": "Kenneth Tynan", "response": ["* Kathleen Tynan (ed.) Kenneth Tynan: Letters ()", "* Kathleen Tynan & Ernie Eban (ed.) Profiles (1990, Various editions; )", "* \"When Kenneth met Lulu\", The Guardian, \"Saturday Review\", p. 4 (21 November 1998). Discusses the story (told by Kathleen Tynan) of Kenneth Tynan's obsession with Louise Brooks. Kathleen produced a screenplay, the rights to which were bought by Martin Scorsese in 1998."]}, {"page": "Agatha (film)", "response": ["Agatha is a 1979 British drama thriller film directed by Michael Apted and starring Vanessa Redgrave, Dustin Hoffman,  and Timothy Dalton. It was written by Kathleen Tynan. The film focuses on renowned crime writer Agatha Christie's famous 11-day disappearance in 1926. The film was released on 9 February 1979, receiving generally positive reviews from critics, who praised the production values and performances.", "Kathleen Tynan began researching the project as a BBC documentary. During her research, she told producer David Puttnam about it and he suggested it be turned into a feature film. The Agatha Christie estate opposed the film, and tried to get it stopped. Filming commenced on 7 November 1977 in Harrogate, North Yorkshire, England. Several members of the cast were upset with script changes made once production had begun, with Hoffman even suing the studio for $66 million claiming breach of contract; the outcome of the lawsuit is not known."]}, {"page": "David Halton", "response": ["Halton was born in Beaconsfield, England in 1940.  His father Matthew Halton, was a war correspondent for the CBC Radio during World War II and died when David was 16 years old on December 3, 1956. The senior Halton had a big influence in David's career choice. His sister Kathleen Tynan was the second wife and biographer of the English theatre critic Ken Tynan."]}, {"page": "Kathleen Halton", "response": ["#REDIRECT Kathleen Tynan"]}, {"page": "List of people educated at Queen's College, London", "response": ["*Kathleen Tynan (1951-55), Canadian-British journalist, author, and screenwriter"]}, {"page": "Trick or Treat (unfinished film)", "response": ["Kathleen Tynan was called in to work on the script. Jagger refused to film nude scenes in Rome, claiming that the movie was \"pure pornography\"."]}, {"page": "Halton (surname)", "response": ["* Kathleen Tynan,  (1937–1995), Canadian-British journalist, author and screenwriter"]}, {"page": "Deaths in January 1995", "response": ["*Kathleen Tynan, 57, Canadian-British journalist, author, and screenwriter, cancer."]}]}}