{"wiki_id": "http://www.wikidata.org/entity/Q15453290", "itemLabel": "Minna Keal", "itemDescription": "composer", "wikipedia_url": "https://en.wikipedia.org/wiki/Minna_Keal", "wikipedia_page": {"main": "Minna Keal, née Mina Nerenstein (22 March 1909 – 14 November 1999) was a British composer. After early compositions as a student, she only returned to composing at the end of her life. Aged 80 when her music was first performed at the Proms in 1989, she experienced her return to composition as a new life:\n\nI felt I was coming to the end of my life, but now I feel as if I'm just beginning. I feel as if I'm living my life in reverse.", "link_mentions": [{"page": "List of women composers by birth date", "response": ["* Minna Keal (1909–1999)"]}, {"page": "1999 in British music", "response": ["*14 November – Minna Keal, composer, 90"]}, {"page": "List of compositions for cello and piano", "response": ["*Minna Keal"]}, {"page": "Justin Connolly", "response": ["Connolly was highly regarded as a teacher. His former students include Minna Keal, Geoffrey King and Alwynne Pritchard.", "* MK lives! [early version of Piano Trio, op.36], Minna Keal 90th Birthday Concert (private release)"]}, {"page": "List of symphony composers", "response": ["*Minna Keal (1909–1999), British composer of 1 symphony"]}, {"page": "List of compositions for viola: I to K", "response": ["* Minna Keal (1909–1999)"]}, {"page": "Alison Light", "response": ["After Samuel's death in 1996, Light assembled and donated his papers to create the Raphael Samuel Archive, now held by Bishopsgate Institute in London. She was also a member of the initial team which established the Raphael Samuel History Research Centre, now a public history centre jointly operated by University of East London, Birkbeck and Queen Mary colleges, London University, and the Bishopsgate Institute. Light also donated materials relating to Samuel's mother, the composer and Communist activist Minna Keal (1909–99).Light, Alison, Obituary of Minna Keal, The Guardian, Wednesday 24 November 1999 "]}, {"page": "Keal", "response": ["*Minna Keal (1909–1999), British composer"]}, {"page": "Minna (given name)", "response": ["* Minna Keal (1909-1999), British composer"]}]}}