{"wiki_id": "http://www.wikidata.org/entity/Q15497462", "itemLabel": "Henry Booth", "itemDescription": "English railway executive", "wikipedia_url": "https://en.wikipedia.org/wiki/Henry_Booth", "wikipedia_page": {"main": "Henry Booth  (4 April 1788 – 28 March 1869) was a corn merchant, businessman and engineer particularly known as one of the key people behind the construction and management of the pioneering Liverpool and Manchester Railway (L&M), the world's first steam railway conducting both scheduled passenger services and freight.", "link_mentions": [{"page": "George Stephenson", "response": ["As the L&MR approached completion in 1829, its directors arranged a competition to decide who would build its locomotives, and the Rainhill Trials were run in October 1829. Entries could weigh no more than six tons and had to travel along the track for a total distance of . Stephenson's entry was Rocket, and its performance in winning the contest made it famous. George's son Robert had been working in South America from 1824 to 1827 and returned to run the Forth Street Works while George was in Liverpool overseeing the construction of the line. Robert was responsible for the detailed design of Rocket, although he was in constant postal communication with his father, who made many suggestions. One significant innovation, suggested by Henry Booth, treasurer of the L&MR, was the use of a fire-tube boiler, invented by French engineer Marc Seguin that gave improved heat exchange."]}, {"page": "Stephenson's Rocket", "response": ["There have been differences in opinion on who should be given the credit for designing Rocket. George Stephenson had designed several locomotives before but none as advanced as Rocket. At the time that Rocket was being designed and built at the Forth Banks Works, he was living in Liverpool overseeing the building of the Liverpool and Manchester Railway. His son Robert had recently returned from a stint working in South America and resumed as managing director of Robert Stephenson and Company. He was in daily charge of designing and constructing the new locomotive. Although he was in frequent contact with his father in Liverpool and probably received advice from him, it is difficult not to give the majority of the credit for the design to Robert. A third person who may deserve a significant amount of credit is Henry Booth, the treasurer of the Liverpool and Manchester Railway. He is believed to have suggested to Robert Stephenson that a multi-tube boiler should be used.", "On 20 April 1829 the board of the Liverpool and Manchester Railway project passed a resolution for a competition to be held to prove their railway could be reliably operated by steam locomotives, there being advice from eminent engineers of the age that stationary engines would be required.  A prize of £500 was offered as an incentive to the winner, with strict conditions a locomotive would need to meet to enter the trial.  Robert Stephenson was able to report to Henry Booth on 5 September 1829 that Rocket had performed initial manufacturer tests with flying colours at Killingworth.  Rocket was dismantled at Newcastle and began the long trip to Rainhill: by horse wagon to Carlisle; lighter to Port Carlisle then by the Cumberland steamer to Liverpool for re-assembly on 18 September 1829.    Rocket passed the trial requirement of achieving an average speed of  over  by over 40 percent.  Demonstrations also saw Rocket consistently and easily haul a carriage of over 20 person up the Whiston incline at over , and light engine running of around . No other locomotive at the trials was able to achieve anything like the level of performance reliably, with partners Booth and Stephensons sharing the £500 winnings, and perhaps more importantly the need for stationary engines being demonstrated as unnecessary with sceptics such as Rastrick on the way to conversion."]}, {"page": "London and North Western Railway", "response": ["* Henry Booth"]}, {"page": "Liverpool and Manchester Railway", "response": ["The Liverpool and Manchester Railway Company was founded on 20 May 1824. It was established by Henry Booth, who became its secretary and treasurer, along with merchants from Liverpool and Manchester. Charles Lawrence was the Chairman, Lister Ellis, Robert Gladstone, John Moss and Joseph Sandars were the Deputy Chairmen."]}, {"page": "History of rail transport", "response": ["The success of the Stockton and Darlington encouraged the rich investors in the rapidly industrialising North West of England to embark upon a project to link the rich cotton manufacturing town of Manchester with the thriving port of Liverpool. The Liverpool and Manchester Railway was the first modern railway, in that both the goods and passenger traffic were operated by scheduled or timetabled locomotive hauled trains. When it was built, there was serious doubt that locomotives could maintain a regular service over the distance involved. A widely reported competition was held in 1829 called the Rainhill Trials, to find the most suitable steam engine to haul the trains. A number of locomotives were entered, including Novelty, Perseverance and Sans Pareil. The winner was Stephenson's Rocket, which steamed better because of its multi-tubular boiler (suggested by Henry Booth, a director of the railway company)."]}, {"page": "Robert Stephenson", "response": ["The L&MR directors had not decided whether to use fixed engines with ropes or steam locomotives, and resolved on 20 April 1829 to hold trials to see if a steam locomotive would meet their requirements. On the last day of August the date was set to 1 October and the location to a two-mile (3.2 km) double-track railway that was to be built at Rainhill. Robert designed the locomotive for the trials during the summer of 1829. Only two of the wheels were driven, as experience had shown wrought-iron tyres had a high rate of wear that quickly resulted in wheels of different size, and gears were provided for both forward and reverse running . The performance-enhancing idea to heat water using many small diameter tubes through the boiler was communicated to Robert via a letter from his father, George, who heard about it from Henry Booth and Marc Seguin . With both George and Booth in Liverpool, Robert was responsible for the detail design, and he fitted twenty-five  diameter tubes from a separate firebox through the boiler. In September the locomotive was sent to Rainhill where it was coupled with its tender; when it was given the name Rocket is not known."]}, {"page": "St George's Hall, Liverpool", "response": ["The Crown Court has a tunnel vault on red granite columns and the Civil Court a coved ceiling on grey granite columns. The South Entrance Hall is approached through the portico, is low and has Ionic columns. Below this is a larger vaulted space which was adapted to form a new entrance in 2003–05. The North Entrance Hall has Doric columns on its landing and a Doric ambulatory around the apse with two bronze Torchères by Messengers of Birmingham decorated with allegorical scenes, the apse contains stairs, unlike the other main entrances where the stairs are external. A copy in plaster of part of the Parthenon frieze runs round its walls. In the centre of the south wall is a marble statue of Henry Booth shown standing up, carved 1874 by William Theed the Younger, placed here in 1877, flanking the statue are sculptures of caryatids."]}, {"page": "List of people from Merseyside", "response": ["* Henry Booth: Inventor and director of the  pioneering world's first inter-city railway"]}, {"page": "Ullet Road Unitarian Church", "response": ["File:Henry Booth memorial, Ullet Road church.jpg|Memorial to Henry Booth, in cloister"]}, {"page": "Rodney Street, Liverpool", "response": ["*Henry Booth merchant, entrepreneur, and engineer"]}, {"page": "Booth (surname)", "response": ["* Henry Booth, 1st Earl of Warrington (1651–1694),  Member of Parliament, Privy Councillor, supporter of William of Orange in the Revolution of 1688, Mayor of Chester and author", "* Henry Booth (1788–1869), British businessman, engineer and railway proponent"]}, {"page": "Boiler (power generation)", "response": ["Prior to the Rainhill trials of 1829 Henry Booth, treasurer of the Liverpool and Manchester Railway suggested to George Stephenson, a scheme for a multi-tube one-pass horizontal boiler made up of two units: a firebox surrounded by water spaces and a boiler barrel consisting of two telescopic rings inside which were mounted 25 copper tubes; the tube bundle occupied much of the water space in the barrel and vastly improved heat transfer. Old George immediately communicated the scheme to his son Robert and this was the boiler used on Stephenson's Rocket, outright winner of the trial. The design formed the basis for all subsequent Stephensonian-built locomotives, being immediately taken up by other constructors; this pattern of fire-tube boiler has been built ever since."]}, {"page": "Railway time", "response": ["The introduction of railway time was in the end swift despite not being straightforward. The Great Western Railway was the first to standardise its timetable on Greenwich Mean Time, in November 1840. One of the most vociferous proponents of standardising time on the railways was Henry Booth, Secretary of the Liverpool and Manchester Railway, who by January 1846 had ordered the adjustment of clocks to Greenwich Mean Time at both Liverpool and Manchester stations."]}, {"page": "Opening of the Liverpool and Manchester Railway", "response": ["The Liverpool and Manchester Railway (L&M) was founded on 24 May 1823 by Liverpool merchants Joseph Sandars and Henry Booth, with the aim of linking the textile mills of Manchester to the nearest deep water port at the Port of Liverpool. (subscription or UK public library membership required) (subscription or UK public library membership required) At the time, the only means of bulk transport between the two towns other than animal-drawn carts was water transport on the Mersey and Irwell Navigation, the Bridgewater Canal and the Leeds and Liverpool Canal, all of which were slow and expensive to use; (subscription or UK public library membership required) transporting raw cotton the  from Liverpool to Manchester was as expensive as the initial cost of shipping it from America to Liverpool. Although horse and human powered railways had existed for centuries, and steam power was beginning to be used in some experimental industrial railways, the L&M was to be the first steam powered railway to provide an inter-city passenger service, and the most expensive engineering project yet undertaken in Britain. (Because much of the Liverpool and Manchester Railway ran over land owned by investors in the company, and because many of the early locomotives were owned by the engineering firms which built them rather than by the L&M, it is impossible to give a precise figure for the L&M's construction costs. The direct construction cost of the line up to its opening was around £820,000, and the two years of lobbying necessary to get the railway authorised is estimated to have cost £70,000. In comparison, the Bridgewater Canal, which had the same purpose as the L&M in connecting Manchester to the Port of Liverpool, had cost an estimated £220,000 to build in the late 18th century. The average labourer's wage in the area at this time was around £20 per year.)"]}, {"page": "Henry Booth (disambiguation)", "response": ["Henry Booth (1788–1869) was a corn merchant and engineer.", "Henry Booth may also refer to:", "*Henry Booth, 1st Earl of Warrington (1652–1694), MP", "*Henry Booth (MP for Derbyshire) (died 1446)", "*Henry Booth (cricketer) (1815–1883), English cricketer"]}, {"page": "Adam Hodgson", "response": ["Parliament reviewed the Bank Charter Act of 1844, passed by Robert Peel's government, in the light of the Panic of 1847. Hodgson was taken to be a major figure of those who gave evidence to the 1848 secret committee on the matter. Henry Booth and the merchant William Pickering, along with Hodgson, defended the 1844 act, and were attacked as a group by a critic, James Harvey. On the other hand, Hodgson regarded the Panic as a narrow escape from disaster."]}, {"page": "Booth, Henry", "response": ["#redirectHenry Booth"]}, {"page": "Charles Lawrence (Liverpool merchant)", "response": ["Lawrence was pivotal in the development of the Liverpool & Manchester Railway along with others in Liverpool such as Joseph Sandars, Henry Booth and John Moss. Once the Act of Parliament authorised construction, he took over as chairman from John Moss and saw the project through to 1845 when the company merged with the Grand Junction Railway. He also served as Deputy Chairman of the Grand Junction Railway and invested in a number of other railway projects."]}, {"page": "Forrester single (locomotive)", "response": ["George Forrester's Vauxhall Foundry had been established in Liverpool by 1827, taking over a disused cotton mill.  The location was about  from the L&MR's Edge Hill Workshops and was also convenient to the docks.  The L&MR had started operating in 1830, becoming the first example of successfully operating railway in the world and the model upon which the next generation of railways used as a study example for their own projects.  While most L&MR locomotives in the early 1830s were supplied by Robert Stephenson and Company of Newcastle that company was unable to supply demand and other suppliers were entering the market.  Forrester's had first become with the proposal to construct locomotives in response to a tender invitation by the L&MR in May 1831 but pulled out following a misunderstanding with the L&MR's secretary Henry Booth, the tender being satisfied by Bee and Liver from Edward Bury and Experiment from Robert Sharp.  Forresters, along with other firms, did however perform some locomotive component construction or repair work for the L&MR in the early 1830s."]}]}}