{"wiki_id": "http://www.wikidata.org/entity/Q15439321", "itemLabel": "J. C. Buckstone", "itemDescription": "English actor", "wikipedia_url": "https://en.wikipedia.org/wiki/J._C._Buckstone", "wikipedia_page": {"main": "John Copeland Buckstone (9 September 1859 in Sydenham, London – 24 September 1924) was an English stage and film actor of the late Victorian and Edwardian eras, who was most famous for his 1901 stage play Scrooge, which was the basis for the first film version of A Christmas Carol in the same year. He was the son of the actor John Baldwin Buckstone and the brother of Lucy Isabella Buckstone.", "link_mentions": [{"page": "The Admirable Crichton", "response": ["| colspan=\"1\" | J. C. Buckstone"]}, {"page": "Alice in Wonderland (musical)", "response": ["Adult actors who appeared along with the mainly juvenile casts included Irene Vanbrugh as the Knave of Hearts (1888);The Era, 29 December 1888, p. 18 Ellaline Terriss as Alice and Seymour Hicks as the Hatter (1900);The Standard, 20 December 1900, p. 3 Marie Studholme as Alice, Alice Barth as the Duchess and the Red Queen, Stanley Brett as the Mad Hatter and J. C. Buckstone as Tweedledee at the Prince of Wales's Theatre (1906); Dan Leno (1909, in a production conducted by Marjory Slaughter, the composer's daughter);The Times, 17 December 1909, p. 8\"P. I. P. Playgoer,\" Penny Illustrated Paper and Illustrated Times, 18 December 1909, p. 411 and C. Hayden Coffin as the Hatter (1913 and 1921).The Times, 13 December 1913, p. 6; and 27 December 1921, p. 6"]}, {"page": "Scrooge, or, Marley's Ghost", "response": ["Evidence suggests that Paul's version of A Christmas Carol was based as much on J. C. Buckstone's popular stage adaptation Scrooge as on Dickens' original story. Like the play, the film dispenses with the different ghosts that visit Scrooge, instead relying upon the figure of Jacob Marley, draped in a white sheet, to point out the error of Scrooge's ways. The film featured impressive trick effects by 1901 standards, superimposing Marley's face over the door knocker, and displaying the scenes from his youth on a black curtain in Scrooge's bedroom. R. W. Paul was a trick film specialist; Walter Booth, credited as the film's director, was a well-known magician as well as a trick and comic film specialist.  The film makes early use of dissolving between scenes. Some scenes are tinted."]}, {"page": "John Copeland Buckstone", "response": ["#REDIRECT J. C. Buckstone"]}, {"page": "Scrooge (1913 film)", "response": ["The film's cast included Seymour Hicks as Scrooge, William Lugg, Leedham Bantock, J. C. Buckstone, Dorothy Buckstone, Leonard Calvert, Osborne Adair, Adela Measor and Ellaline Terriss.Scrooge on the Silent Era website Hicks had played the role of Scrooge regularly onstage since 1901 before this, his first appearance in the role in film. He reprised the role of Scrooge again, in the 1935 film Scrooge."]}, {"page": "David Garrick (1913 film)", "response": ["*Mr. Alexander Smith - J. C. Buckstone"]}, {"page": "Evelyn Millard", "response": ["For the American theatrical manager Charles Frohman, she played Lady Ursula in The Adventure of Lady Ursula at the Duke of York's Theatre in 1898,Photograph of Millard in The Adventure of Lady Ursula (1898) – Victoria and Albert Museum Collection the title role in Jerome K. Jerome's Miss Hobbs, both of which ran for over 200 performances, and Cho-Cho-San in the London premiere of David Belasco's play Madame Butterfly, which opened on 28 April 1900 at the Duke of York's Theatre and which ran for sixty-eight performances. The cast included Allan Aynesworth, Claude Gillingwater and J. C. Buckstone. This production was seen by the composer Giacomo Puccini, who is said to have based his opera Madama Butterfly on it."]}, {"page": "Seymour Hicks filmography", "response": ["His first role was for his own screenplay adaptation of A Christmas Carol, titled Scrooge, alongside William Lugg, J. C. Buckstone, and his wife Ellaline Terriss.Scrooge on the Silent Era website  His next film role was in the title role of the film biography David Garrick."]}, {"page": "J.C. Buckstone", "response": ["#REDIRECT J. C. Buckstone"]}]}}