{"wiki_id": "http://www.wikidata.org/entity/Q1541237", "itemLabel": "Selig Brodetsky", "itemDescription": "Russian-born English mathematician", "wikipedia_url": "https://en.wikipedia.org/wiki/Selig_Brodetsky", "wikipedia_page": {"main": "Selig Brodetsky, זליג ברודצק (10 February 1888 – 18 May 1954) was a Russian-born English mathematician, a member of the World Zionist Executive, the president of the Board of Deputies of British Jews, and the second president of the Hebrew University of Jerusalem.", "link_mentions": [{"page": "List of people from Ukraine", "response": ["*Selig Brodetsky (1888–1954), British mathematician, President of the Hebrew University of Jerusalem"]}, {"page": "Edmund Landau", "response": ["Landau and his family emigrated to Mandatory Palestine in 1927 and he began teaching at the Hebrew University. The family had difficulty adjusting to the primitive living standards then available in Jerusalem. In addition, Landau became a pawn in a struggle for control of the University between Magnes and Chaim Weizmann and Albert Einstein. Magnes suggested that Landau be appointed Rector of the University, but Einstein and Weizmann supported Selig Brodetsky. Landau was disgusted by the dispute and decided to return to Göttingen, remaining there until he was forced out by the Nazi regime after the Machtergreifung in 1933. Thereafter, he lectured only outside Germany. He moved to Berlin in 1934, where he died in early 1938 of natural causes."]}, {"page": "Hebrew University of Jerusalem", "response": ["By 1947, the university had become a large research and teaching institution. Sir Leon Simon was Acting President from 1948 to 1949, and he was succeeded as president by Professor Selig Brodetsky, who served from 1949 to 1952. Plans for a medical school were approved in May 1949, and in November 1949, a faculty of law was inaugurated. In 1952, it was announced that the agricultural institute founded by the university in 1940 would become a full-fledged faculty."]}, {"page": "Leipzig University", "response": ["* Selig Brodetsky, Israeli President of the Hebrew University of Jerusalem"]}, {"page": "Board of Deputies of British Jews", "response": ["The Board became more prominent in British society in the early twentieth century due to its support of refugees, notably leading an ultimately failed campaign against the Aliens Act 1905. However, by the 1930s, the Board's position had shifted to a more assimilationist position in order to improve the perception of Jews among the non-Jewish British population, including adopting a position of non-Zionism. In 1933, Neville Laski was elected as the Board's President, and called for Jews to give \"overriding consideration of duty and loyalty\" to the United Kingdom. However, the stances of the Board once again had shifted in 1939 with the election of Selig Brodetsky, who was described as the \"foremost Zionist in Great Britain\" by the Jewish Telegraphic Agency. As of 2021 the Board has continued to hold a Zionist position.", "* Selig Brodetsky (1940–1949)"]}, {"page": "Thomas Cowling", "response": ["Cowling became an Assistant Lecturer at Swansea in 1933.  He was subsequently a lecturer at the University of Dundee (1937–38) and the University of Manchester (1938–45) before being appointed Professor at the University of Wales, Bangor (now Bangor University).  In 1948 Cowling was appointed Professor of Applied Mathematics at the University of Leeds in succession to Professor Selig Brodetsky.  Cowling retired from his chair at Leeds in 1970 with the title Emeritus Professor.Quarterly Journal of the Royal Astronomical Society, Vol. 32, No. 2, pp. 201–205"]}, {"page": "Benjamin Mazar", "response": ["Mazar was born in Ciechanowiec, Poland, then part of the Russian Empire. He was educated at Berlin University and Giessen University in Germany. At the age of 23, he immigrated to Mandatory Palestine and in 1943 joined the faculty of the Hebrew University of Jerusalem, whose original campus at Mount Scopus was an enclave in the Jordanian sector of Jerusalem following the 1948 Arab-Israeli War. In 1952 he became Rector of the university and later its president for eight years from 1953 to 1961, following Selig Brodetsky and succeeded by Giulio Racah."]}, {"page": "JFS (school)", "response": ["| Selig Brodetsky", "*Selig Brodetsky, mathematician, Zionist leader, and President of the Hebrew University of Jerusalem"]}, {"page": "Leon Mestel", "response": ["Leon Mestel was born on 5 August 1927MESTEL, Prof. Leon, Who's Who 2010, A & C Black, 2010; online edn, Oxford University Press, Dec 2009; online edn, Nov 2009. Retrieved 7 November 2010 in Melbourne, AustraliaProf Leon Mestel, FRS , Debrett's People of Today. Retrieved 7 November 2010 to Solomon Mestel, a rabbi and Rachel (née Brodetsky), a schoolteacher and sister of Selig Brodetsky. With his family, he migrated to England at the age of three, where he lived in Forest Gate, east London. He was educated at West Ham Secondary School, London, and Trinity College, Cambridge, where he obtained his BA in 1948 and his PhD in 1952.", "He married Sylvia Louise Cole (d. 2014) in 1951, and they had two sons, Ben and Jonathan and two daughters Rosie and Leo. One of his sons is Jonathan Mestel (born 1957), a mathematics professor and chess grandmaster. In 1982, as part of a memorial series of annual lectures at the University of Leeds commemorating his maternal uncle, Leon Mestel gave the 23rd Selig Brodetsky Memorial Lecture, titled Astronomy: A Mirror to Physics.Astronomy: A Mirror to Physics, University of Leeds Review, 1982 (entry at worldcat.org)", "After retiring, Mestel wrote several obituaries and biographical articles on physicists and astrophysicists for publications such as The Independent, the Oxford Dictionary of National Biography, and Biographical Memoirs of Fellows of the Royal Society. Those for whom Mestel wrote obituaries and articles include Martin Schwarzschild,Obituary: Professor Martin Schwarzschild, Leon Mestel, The Independent, Saturday, 19 April 1997 Roger John Tayler,Obituary: Professor Roger Tayler, Leon Mestel, The Independent, Tuesday, 28 January 1997Leon Mestel, Tayler, Roger John (1929–1997), Oxford Dictionary of National Biography, Oxford University Press, 2004. Retrieved 7 November 2010 William McCrea,Leon Mestel, McCrea, Sir William Hunter (1904–1999), Oxford Dictionary of National Biography, Oxford University Press, 2004; online edition, Oct 2007. Retrieved 7 November 2010 Hermann Bondi, Subrahmanyan Chandrasekhar,Leon Mestel, Chandrasekhar, Subrahmanyan (1910–1995), Oxford Dictionary of National Biography, Oxford University Press, 2004. Retrieved 7 November 2010Obituary: Professor Subrahmanyan Chandrasekhar, Leon Mestel, The Independent, Thursday, 24 August 1995 and Thomas George Cowling.Leon Mestel, Cowling, Thomas George (1906–1990), Oxford Dictionary of National Biography, Oxford University Press, 2004. Retrieved 7 November 2010 Mestel also contributed the Oxford Dictionary of National Biography entry for Selig Brodetsky.Leon Mestel, Brodetsky, Selig (1888–1954), Oxford Dictionary of National Biography, Oxford University Press, 2004. Retrieved 7 November 2010"]}, {"page": "List of Jews in religion", "response": ["* Selig Brodetsky, President of the British Board of Deputies"]}, {"page": "Maccabaeans", "response": ["* 1932–54 Selig Brodetsky"]}, {"page": "List of alumni of Trinity College, Cambridge", "response": ["* Selig Brodetsky, President of the Hebrew University of Jerusalem", "*Selig Brodetsky (1888–1954), mathematician, President of the Hebrew University of Jerusalem"]}, {"page": "Selig brodetsky", "response": ["#REDIRECT Selig Brodetsky "]}, {"page": "Pervomaisk, Mykolaiv Oblast", "response": ["*Selig Brodetsky (1888–1954), British mathematician, President of the Hebrew University of Jerusalem"]}, {"page": "List of British Jewish scientists", "response": ["* Selig Brodetsky, mathematician, President of the Board of Deputies of British Jews, and President of the Hebrew University of Jerusalem"]}, {"page": "Theodor Herzl", "response": ["Discharged from the army in late spring 1946, without money or job and despondent about his future, Norman followed the advice of Dr.Selig Brodetsky. Dr. H. Rosenblum, the editor of Haboker, a Tel Aviv daily that later became Yediot Aharonot, noted in late 1945 that Dr. Weizmann deeply resented the sudden intrusion and reception of Norman when he arrived in Britain. Norman spoke to the Zionist conference in London. Haboker reported, \"Something similar happened at the Zionist conference in London. The chairman suddenly announced to the meeting that in the hall there was Herzl's grandson who wanted to say a few words. The introduction was made in an absolutely dry and official way. It was felt that the chairman looked for—and found—some stylistic formula which would satisfy the visitor without appearing too cordial to anybody among the audience. In spite of that there was a great thrill in the hall when Norman mounted on the platform of the praesidium. At that moment, Dr.Weizmann turned his back on the speaker and remained in this bodily and mental attitude until the guest had finished his speech.\"Haboker 26 October 1945. Document amongst the papers of Stephen Norman at the Central Zionist Archives in Jerusalem The 1945 article went on to note that Norman was snubbed by Weizmann and by some in Israel during his visit because of ego, jealousy, vanity and their own personal ambitions. Brodetsky was Chaim Weizman's principal ally and supporter in Britain."]}, {"page": "List of University of Leeds people", "response": ["*Selig Brodetsky (1888–1954), mathematician, President of the Hebrew University of Jerusalem"]}, {"page": "List of Jewish mathematicians", "response": ["* Selig Brodetsky (1888–1954), mathematician and President of the Board of Deputies of British Jews"]}, {"page": "List of Leipzig University people", "response": ["* Selig Brodetsky, President of the Hebrew University of Jerusalem"]}, {"page": "Central Foundation Boys' School", "response": ["* Selig Brodetsky, Professor of Applied Mathematics from 1924–48 at the University of Leeds,  President of the Board of Deputies of British Jews, President of the Hebrew University of Jerusalem"]}]}}