{"wiki_id": "http://www.wikidata.org/entity/Q15429451", "itemLabel": "Herbert Allingham", "itemDescription": "British editor, journalist and serial pulp fiction writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Herbert_Allingham", "wikipedia_page": {"main": "Herbert John Allingham (1867–10 January 1936) was an English editor, journalist, serial pulp fiction writer, husband of writer Emmie Allingham and father of crime novelist Margery Allingham.", "link_mentions": [{"page": "Amalgamated Press", "response": ["Alfred Harmsworth died in 1922, and in 1926 Amalgamated Press was bought by William and Gomer Berry of Allied Newspapers.Herbert Allingham biography, golden-duck.co.uk website; accessed 2013-09-16. Shortly after this sale, in 1927, AP acquired and continued publishing a number of Cassell & Co.'s periodicals, including  Cassell's Magazine,  The Story-Teller, and Chums."]}, {"page": "The London Journal", "response": ["By 1883 it had transformed itself from being a 'penny family weekly' into what was recognizably a 'woman’s magazine'. Herbert Allingham became editor in 1889, publishing his own story \"A Devil of a Woman\" in 1893.Herbert Allingham biography on golden-duck.co.uk website, viewed 2013-09-16"]}, {"page": "Allingham", "response": ["*Herbert Allingham (1867–1936), English editor and writer."]}, {"page": "Julia Jones (writer)", "response": ["Jones opened a bookshop in Ingatestone, Essex, which she then developed into a small-scale local publishing business, reissuing a Second World War autobiography by crime writer Margery Allingham. Jones's interest in the Allingham family grew; she researched Margery Allingham's life and wrote a biography published in 1991. Jones has also studied the fiction writing of Margery Allingham's father, Herbert Allingham.", "In 2006, while working on a PhD on Herbert Allingham, Jones decided to become a writer of adventure stories like the Swallows and Amazons series of Arthur Ransome she had read as a child. The Salt-Stained Book, the first part of a planned sailing adventure trilogy, was released in June 2011.The Salt-stained Book page on publisher's website, viewed 2011-07-08 Jones hoped the trilogy would inspire a new generation of children to mess about in boats.", "* Fifty Years in the Fiction Factory: The working life of Herbert Allingham  September 19, 2012"]}]}}