{"wiki_id": "http://www.wikidata.org/entity/Q15438635", "itemLabel": "Henry Winkles", "itemDescription": "British artist", "wikipedia_url": "https://en.wikipedia.org/wiki/Henry_Winkles", "wikipedia_page": {"main": "Henry Winkles (1801–1860) was an English architectural illustrator, engraver and printer, who, together with Karl Ludwig Frommel founded the first studio for steel engraving in Germany.\n\nIn 1836, with Benjamin Winkles, he produced and helped to engrave three volumes of \"Winkles's architectural and picturesque illustrations of the cathedral churches of England and Wales\". This featured illustrators such as Hablot Knight Browne (the famous \"Phiz\" of Charles Dickens fame) and architect Robert Garland (1808–1863), with text (and some engraving) by Thomas Moule. These books helped to inspire the 19th century Gothic revival in architecture in Britain.", "link_mentions": [{"page": "Cologne Cathedral", "response": ["File:Botanischer-Garten-am-Dom-um-1820.JPG|The unfinished cathedral as in 1820, engraved by Henry Winkles. The huge crane on the tower of the cathedral is visible in the picture."]}, {"page": "List of Australian artists", "response": ["* Henry Winkles (1800–1860)"]}, {"page": "Karl Ludwig Frommel", "response": ["Karl Ludwig Frommel (29 April 1789 – 6 February 1863)  was a German landscape painter and engraver, born at Birkenfeld.  He studied at Karlsruhe, under F. J. Becker and Haldenwang, visited Paris, and earned a considerable reputation in Italy (1812–17).  He was appointed professor at Karlsruhe where he founded the Society of Art and Industry.  After a visit to London (1824) to acquaint himself with the technique of steel engraving, he opened a studio, with Henry Winkles at Karlsruhe for that branch of art.  From 1830 to 1858 he was director of the picture gallery, which flourished. He was the father of Emil Frommel."]}, {"page": "Henry Winkler (disambiguation)", "response": ["*Henry Winkles (1801–1860), English architectural illustrator, engraver and printer"]}, {"page": "Winkles", "response": ["* Henry Winkles (1801–1860) was an English architectural illustrator, engraver and printer, who, together with Karl Ludwig Frommel founded the first studio for steel engraving in Germany. "]}]}}