{"wiki_id": "http://www.wikidata.org/entity/Q15497298", "itemLabel": "Mikyla Dodd", "itemDescription": "British actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Mikyla_Dodd", "wikipedia_page": {"main": "Mikyla Dodd (born 1978, in Blackburn) is an English actress who is most famous for playing the role of Chloe Bruce in the Channel 4 soap opera Hollyoaks from 2000 until 2004.\nIn 2006, she appeared in the ITV Reality TV show Celebrity Fit Club.\nIn 2008, Dodd guest starred in an episode of Casualty for the BBC.", "link_mentions": [{"page": "Celebrity Fit Club", "response": ["*Mikyla Dodd (actress, formerly on Hollyoaks) – lost 3 stone 2 pound ()", "Mikyla Dodd, at  () is medically morbidly obese and has a goal weight of 12 stone ()."]}, {"page": "List of former Hollyoaks characters", "response": ["|Chloe Bruce || Mikyla Dodd || 2000–2004"]}, {"page": "Toby Mills", "response": ["Toby soon discovered that Ellie's parents had thrown her out and he offered her a place to stay at The Dog. The pair began dating again, but Toby still disliked Ellie working for Scott. Soon Scott sacked her and Toby also quit his job at the Loft. Toby’s mum Linda arrived, and she caused a stir in his relationship with Ellie. Ellie put Toby under pressure to choose between her or his mother. Toby made a difficult decision, and decided it was Ellie he wanted to be with and he told his mother that he'd had enough of her interfering. Toby was then worried when Ellie decided to go on a reality TV program called the Fish Tank. Toby made her promise not to flirt with any men there. During Ellie's experience of The Fish Tank, rumours started to spread around the village that Ellie had slept with someone. Toby became angry by Ellie's actions and was frustrated that Ellie had not kept her promise. Toby demanded Chloe Bruce (Mikyla Dodd) allow Ellie to get out of the Fish Tank, otherwise his relationship was over with her. Ellie was allowed out for an hour, and Toby told her that he was getting impatient and angry by Ellie's lies. Ellie got upset about how little Toby thought of her, and told him that she slept with everyone."]}, {"page": "Theo Sankofa", "response": ["Theo moved to Hollyoaks where he set up the village's first gadget shop Theologic, which supplied some of the strangest devices. Friendly and well-liked, Theo was someone who the residents of Hollyoaks came to for advice and help. He often supported and advised his friends, including Chloe Bruce (Mikyla Dodd) and Matt Musgrove. Theo also played a key part in helping Gordon Cunningham in winning the local elections as Theo was his right-hand man campaigner. In 2002, his younger brother Norman arrived and extra responsibility was put on Theo's shoulders, especially when his business began to fall apart."]}, {"page": "Chloe Bruce", "response": ["Chloe Bruce is a fictional character from the British Channel 4 soap opera, Hollyoaks, played by Mikyla Dodd. The character first appeared onscreen in 2000. The character is noted for her storylines involving self-image issues and acting as the \"agony aunt\" within the serial.", "Auditions were held for the part. Actress Mikyla Dodd was member of Oldham Theatre Workshop under the tuition of David Johnson and through that she got an agent, who managed to get her the audition. Chloe was described as a seventeen-year-old at the audition and Dodd felt she was too old and would lose out to a younger actress, however she impressed Jo Hallow, when she returned home from the audition she found out she had secured the role."]}, {"page": "Dodd (surname)", "response": ["*Mikyla Dodd (born 1978), British actress"]}, {"page": "List of British actors", "response": ["* Mikyla Dodd (born 1978)"]}, {"page": "Calendar Girls (play)", "response": ["*Mikyla Dodd as Elaine"]}, {"page": "Duncan Button", "response": ["In an interview with entertainment website Digital Spy speaking of Duncan's friendship with fellow teenager Ricky Campbell (Ashley Margolis), Lucy Allan said, \"Ahh, Duncan and Ricky! I love them. If you look at who Max [Cunningham] (Matt Littler) and O.B. (Darren Jeffries) were when they were teenagers... They had an innocence and a naïvety to them that the show was lacking at the time. I actually wrote Max and O.B.'s storylines when they were youngsters and they spent about six months trying to get Chloe [Bruce] (Mikyla Dodd) into bed in a burger van! There's a joy in Ricky and Duncan that shouldn't be ignored. They're just trying to get laid - Duncan in particular, by whatever means necessary. Even if that means suggesting that his sexuality isn't what it is. And Ricky has a secret, so we'll meet elements of his family...\""]}]}}