{"wiki_id": "http://www.wikidata.org/entity/Q15492954", "itemLabel": "Henry Pelling", "itemDescription": "British historian", "wikipedia_url": "https://en.wikipedia.org/wiki/Henry_Pelling", "wikipedia_page": {"main": "Henry Mathison Pelling (27 August 1920 – 14 October 1997) was a British historian best known for his works on the history of the British Labour Party, including:\n\nThe Origins of the Labour Party (1954) and\nA Short History of the Labour Party (1961) (later editions co-written with Alastair J. Reid)He was also a pioneer of the serious study of twentieth-century electoral and party politics, and wrote such other works as:\n\nModern Britain 1885-1955\nSocial Geography of British Elections: 1885-1910\nWinston Churchill\nBritain and the Marshall Plan\nAmerican Labor\nA History of British Trade Unionism, London, 1963\nAmerica and the British left: from Bright to Bevan\nThe British Communist Party: a historical profile\nThe 1945 General Election Reconsidered\nPopular Politics and Society in Late Victorian Britain\nBritain and the Second World War\nThe Labour Governments 1945-51Pelling was educated at Birkenhead School and St John's College, Cambridge, where he gained firsts in part I of the Classical tripos and part II of the Historical tripos. His collection of British left-wing political pamphlets is held at Senate House Library, while his papers are lodged with St John's College.\n\n", "link_mentions": [{"page": "Independent Labour Party", "response": ["A number of so-called \"Lib-Lab\" candidates were subsequently elected Members of Parliament by this alliance of trade unions and radical intellectuals working within the Liberal Party.Henry Pelling, The Origins of the Labour Party. London: Macmillan, 1954, p. ??.", "\"From the beginning the ILP attempted to influence the trade unions to back a working-class political party: they sought, as Henry Pelling states: 'collaboration with trade unionists with the ultimate object of tapping trade union funds for the attainment of Parliamentary power.' The socialism of the ILP was ideal for achieving this end; lacking as it did any real theoretical basis it could accommodate practically anything a trade unionist was likely to demand. Fervent and emotional, the socialism of the ILP could accommodate, with only a little strain, temperance reform, Scottish nationalism, Methodism, Marxism, Fabian gradualism, and even a variety of Burkean conservatism. Although the mixture was a curious one, it did have the one overwhelming virtue of excluding nobody on dogmatic grounds, a circumstance, on the left and at the time, which cannot be lightly dismissed.\"Dowse, Left in the Centre, pp. 6–7.", "* Henry Pelling, The Origins of the Labour Party. London: Macmillan, 1954."]}, {"page": "1945 United Kingdom general election", "response": ["The historian Henry Pelling, noting that polls showed a steady Labour lead after 1942, pointed to long-term forces that caused the Labour landslide: the usual swing against the party in power, the Conservative loss of initiative, wide fears of a return to the high unemployment of the 1930s, the theme that socialist planning would be more efficient in operating the economy and the mistaken belief that Churchill would continue as prime minister regardless of the result."]}, {"page": "List of University of Cambridge people", "response": ["*Henry Pelling (St John's)"]}, {"page": "General Secretary of the Labour Party", "response": ["*A Short History of the Labour Party, Henry Pelling, 2005, "]}, {"page": "South Norfolk (UK Parliament constituency)", "response": ["* Social Geography of British Elections 1885-1910. by Henry Pelling (Macmillan 1967)"]}, {"page": "Windsor (UK Parliament constituency)", "response": ["* Social Geography of British Elections 1885–1910, by Henry Pelling (Macmillan 1967)"]}, {"page": "St Ives (UK Parliament constituency)", "response": ["* Henry Pelling, Social Geography of British Elections 1885-1910 (London: Macmillan, 1967)"]}, {"page": "Birkenhead School", "response": ["*Henry Pelling (1920–1997), historian"]}, {"page": "National Liberal Club", "response": ["*Henry Pelling, historian."]}, {"page": "Scottish Workers' Representation Committee", "response": ["The SWPEC's first contest was the 1900 UK general election. It sponsored radical journalist A. E. Fletcher in Glasgow Camlachie. He received 3,107 votes and did not win the seat. It then stood Robert Smillie, a leader of the miners' trade union, at the 1901 North East Lanarkshire by-election, and was also defeated. When another by-election arose in North East Lanarkshire, in 1904, another miners' leader was selected, John Robertson, who again failed to win the seat.Frank Bealey and Henry Pelling, Labour and Politics, 1900-1906, p.296", "! Constituency !! Candidate !! Votes !! Percentage !! Position !! SponsorFrank Bealey and Henry Pelling, Labour and Politics 1900-1906, p.296"]}, {"page": "Hallamshire (UK Parliament constituency)", "response": ["The Municipal Borough of Sheffield was also a Parliamentary Borough and so the only electors from that area entitled to vote in Hallamshire were those who were freeholders. They could, of course, also exercise their vote in the appropriate division of the Parliamentary Borough of Sheffield. However, there were always considerable numbers of Sheffield freeholders who voted at elections for Hallamshire according to Henry Pelling in his Social Geography of British Elections 1885-1910.", "*Social Geography of British Elections 1885-1910 by Henry Pelling (Macmillan, London, 1967)"]}, {"page": "Maidstone (UK Parliament constituency)", "response": ["* Henry Pelling, Social Geography of British Elections 1885-1910 (London: Macmillan, 1967)"]}, {"page": "Maldon (UK Parliament constituency)", "response": ["* Henry Pelling, Social Geography of British Elections 1885-1910 (London: Macmillan, 1967)"]}, {"page": "Stuart Macintyre", "response": ["While a postgraduate student at Monash in the early 1970s, Macintyre joined the Left Tendency faction of the Communist Party of Australia, this faction being particularly strong at that campus. His CPA membership lapsed while he was studying in the United Kingdom, and on returning to Australia he joined the Australian Labor Party. He thereafter considered himself to be a democratic socialist. As an historian he identified with the tradition of labour historians, such as Henry Pelling, who was his doctoral supervisor in Britain."]}, {"page": "Abingdon (UK Parliament constituency)", "response": ["* Henry Pelling, Social Geography of British Elections 1885–1910 (London: Macmillan, 1967)"]}, {"page": "Isle of Ely (UK Parliament constituency)", "response": ["* Social Geography of British Elections 1885–1910, by Henry Pelling (Macmillan 1967)"]}, {"page": "Newmarket (UK Parliament constituency)", "response": ["* Social Geography of British Elections 1885-1910, by Henry Pelling (Macmillan 1967)"]}, {"page": "Wisbech (UK Parliament constituency)", "response": ["* Social Geography of British Elections 1885-1910, by Henry Pelling (Macmillan 1967)"]}, {"page": "Bewdley (UK Parliament constituency)", "response": ["* Henry Pelling, Social Geography of British Elections 1885–1910 (London: Macmillan, 1967)"]}, {"page": "List of close election results", "response": ["| Conservative incumbent John Edmund Wentworth Addison and Liberal challenger (and English cricketer) Alexander Butler Rowley were tied, 3,049–3,049. The Returning Officer (and also mayor) James Walker broke the tie by casting a vote for Addison.Page 256, Social Geography of British Elections 1885–1910, by Henry Pelling (Macmillan 1967)"]}, {"page": "Hackney (UK Parliament constituency)", "response": ["* Social Geography of British Elections 1885-1910. by Henry Pelling (Macmillan 1967)"]}, {"page": "Frome (UK Parliament constituency)", "response": ["* Henry Pelling, Social Geography of British Elections 1885-1910 (London: Macmillan, 1967)"]}, {"page": "Mile End (UK Parliament constituency)", "response": ["* Social Geography of British Elections 1885–1910. by Henry Pelling (Macmillan 1967)"]}, {"page": "Spen Valley (UK Parliament constituency)", "response": ["Political historian Henry Pelling noted that the constituency as it existed from 1885 to 1918 was dominated by the woollen industry and carpetmaking, where the vast bulk of the population were nonconformist: the Church of England parish of Birstall was said to have had only four clergymen in the eighteenth century (two of whom were schoolmasters).Henry Pelling, \"Social Geography of British Elections 1885-1910\", Macmillan, 1967, p. 302. In 1922, membership of nonconformist circuits in the constituency is estimated at 2,759 for the Congregational Church, 1,065 Wesleyanism, 1,027 United Methodist Church, 698 Primitive Methodism, and 328 Baptists, making it the second largest nonconformist attendance in the West Riding.Michael Kinnear, \"The British Voter\" 2nd edition, Batsford Academic, 1981, p. 128."]}, {"page": "Rutland (UK Parliament constituency)", "response": ["* Henry Pelling, Social Geography of British Elections 1885–1910 (Macmillan, 1967)"]}, {"page": "Heywood (UK Parliament constituency)", "response": ["* Social Geography of British Elections 1885–1910. by Henry Pelling (Macmillan 1967)"]}, {"page": "Egremont (UK Parliament constituency)", "response": ["* Social Geography of British Elections 1885-1910. by Henry Pelling (Macmillan 1967)"]}, {"page": "List of Parliamentary Boroughs and associated County Constituencies 1832–1918", "response": ["* Social Geography of British Elections 1885-1910. by Henry Pelling (Macmillan 1967)"]}, {"page": "West Cumberland (UK Parliament constituency)", "response": ["* Social Geography of British Elections 1885-1910. by Henry Pelling (Macmillan 1967)"]}, {"page": "Croydon (UK Parliament constituency)", "response": ["* Social Geography of British Elections 1885-1910. by Henry Pelling (Macmillan 1967)"]}, {"page": "Finsbury Central (UK Parliament constituency)", "response": ["* Social Geography of British Elections 1885-1910. by Henry Pelling (Macmillan 1967)"]}, {"page": "Finsbury East (UK Parliament constituency)", "response": ["* Social Geography of British Elections 1885-1910. by Henry Pelling (Macmillan 1967)"]}, {"page": "Lewisham (UK Parliament constituency)", "response": ["During its existence Lewisham was a safe Conservative seat. In Lewisham, between 1885 and 1906, the electorate more than doubled and over this period the population of poorer people in the constituency grew.Henry Pelling, Social Geography of British Elections, 1885-1910 (Macmillan, 1967), p. 35. Over the six general elections of 1885, 1886, 1892, 1906 and January and December 1910 the average Conservative share of the vote in Lewisham was 63.0%."]}, {"page": "Zelda Kahan", "response": ["Born into a Jewish family in Russia in 1886, Kahan's family were forced to emigrate, and she moved to Britain at an early age.Henry Pelling, The British Communist Party: A Historical Profile The Kahans lived at 6 Clapton Square in Hackney, London. She became an active socialist and joined the Social Democratic Federation (SDF).  Within the SDF, she was a leading opponent of Ernest Belfort Bax's anti-feminism, and an ardent anti-militarist.  After a resolution she proposed to the conference of the SDF's successor, the British Socialist Party, was approved against the wishes of the party leadership, she was elected to its executive.  She worked alongside Theodore Rothstein in opposition to World War I, and supported the foundation of the Communist Party of Great Britain (CPGB).Karen Hunt, Equivocal Feminists: The Social Democratic Federation and the Woman Question 1884-1911 "]}, {"page": "Ramsey (UK Parliament constituency)", "response": ["* Social Geography of British Elections 1885-1910. by Henry Pelling (Macmillan 1967)"]}, {"page": "Boston (UK Parliament constituency)", "response": ["* Henry Pelling, Social Geography of British Elections, 1885-1910 (London: Macmillan, 1967)"]}, {"page": "Plymouth (UK Parliament constituency)", "response": ["* Henry Pelling, Social Geography of British Elections 1885–1910 (London: Macmillan, 1967)"]}]}}