{"wiki_id": "http://www.wikidata.org/entity/Q15431042", "itemLabel": "Edwin La Dell", "itemDescription": "British artist (1914-1970)", "wikipedia_url": "https://en.wikipedia.org/wiki/Edwin_La_Dell", "wikipedia_page": {"main": "Thomas Edwin La Dell  (7 January 1914 – 27 June 1970) was a British printmaker, lithographer, illustrator and painter active during the 1940s, 1950s and 1960s.", "link_mentions": [{"page": "1970 in art", "response": ["* June 27 – Edwin La Dell, British artist (born 1914)"]}, {"page": "1914 in art", "response": ["* January 7 – Edwin La Dell, British artist (died 1970)"]}, {"page": "1970 in the United Kingdom", "response": ["* 27 June – Edwin La Dell, artist (born 1914)"]}, {"page": "John Brunsdon", "response": ["Brunsdon studied at the Cheltenham College of Art from 1949 to 1953. After national service he attended the Royal College of Art from 1955 to 1958 under the tutelage of Julian Trevelyan and others including Edwin La Dell, Edward Ardizzone and Edward Bawden."]}, {"page": "1914 in the United Kingdom", "response": ["* 7 January – Edwin La Dell, artist (died 1970)"]}, {"page": "Brenda Rawnsley", "response": ["The selected artists were asked to produce a lithograph using no more than six colours, to help with mass production. Artists in the first two series of prints produced in 1946 and 1947 included John Nash (Harvesting, 1947), Feliks Topolski, John Skeaping, David Gentleman, Edwin La Dell (Tower of London, 1945), Hans Feibusch, L.S. Lowry (Punch and Judy, 1946), Michael Rothenstein, Julian Trevelyan (Harbour, 1946) and John Tunnard. The lithographs were printed from stone or zinc plates by Thomas Griffiths and the Baynard Press."]}, {"page": "War Artists' Advisory Committee", "response": ["* Edwin La Dell"]}, {"page": "Bernard Cheese", "response": ["He was born in Sydenham, London, in 1925. He studied at Beckenham School of Art and, following four years in the army, studied at the Royal College of Art from 1947, in London, where he studied alongside Walter Hoyle and Sheila Robinson, and his teachers included Edward Bawden and Edwin La Dell.Fry Art Gallery (2012). The Artists. In: Artists at the Fry: Art and design in the North West Essex Collection (pp. 39–40). Saffron Walden, Essex: The Fry Art Gallery."]}, {"page": "List of alumni of the Royal College of Art", "response": ["* Edwin La Dell"]}, {"page": "Charles Mozley", "response": ["While he was at the Royal College of Art, Mozley met Eileen Kohn, who was also an artist, and they married in 1938. Her sister Joan would later marry one of Mozley's contemporaries, Edwin La Dell. Mozley had two sons and three daughters. Mozley died of heart failure in 1991, surviving his wife by two years. From 1971 until his death, Mozley lived in Kew, in a house which he had bought from another artist, John Plant. "]}, {"page": "Walton Street, London", "response": ["*Edwin La Dell (1914–1970), artist"]}]}}