{"wiki_id": "http://www.wikidata.org/entity/Q15429274", "itemLabel": "Hilary Lofting", "itemDescription": "Novelist, travel writer, journalist and editor", "wikipedia_url": "https://en.wikipedia.org/wiki/Hilary_Lofting", "wikipedia_page": {"main": "Hilary Joseph Francis Lofting (23 May 1881 – 3 May 1939) was an Australian novelist, travel writer, journalist and editor.\nHe was the eldest brother of Hugh Lofting (1886–1947), author of Doctor Dolittle.", "link_mentions": [{"page": "Hugh Lofting", "response": ["Lofting, born in January 1886 in Maidenhead, Berkshire, to Elizabeth Agnes (Gannon) and John Brien Lofting, was of English and Irish ancestry.https://lofting.thefreelibrary.com/ His eldest brother, Hilary Lofting, later became a novelist in Australia, having emigrated there in 1915."]}, {"page": "St Edmund's College, Cambridge", "response": ["* Hilary Lofting, Australian novelist, travel writer, journalist and editor. Eldest brother of Hugh Lofting (author of The Story of Doctor Dolittle)."]}, {"page": "Margaret Fane", "response": ["Margaret Fane (born Beatrice Florence Osborn, 10 January 1887 – 1962) was an Australian novelist and poet. Her short stories were published in the Sydney Mail and the Sydney Morning Herald, and she co-wrote The Happy Vagabond with Hilary Lofting (1928).", "In 1912, Fane married David McKee Wright (1869–1928), editor of The Bulletin. She gave birth to their four sons. She divorced Wright in 1918. Fane remarried, marrying Hilary Lofting (1881–1939, the eldest brother of Hugh Lofting). Her second marriage stimulated Fane's creative impulses.Sharkey (2012), p. 1-2. She and Hilary published short stories in various publications, including Sydney Mail, The Sydney Morning Herald and other magazines.", "* The Happy Vagabond (1928, co-authored with Hilary Lofting)", "* Michael Sharkey / Romantic and modern: country and city in the short stories of Margaret Fane and Hilary Lofting, Journal of the Association for the Study of Australian Literature, vol. 12, no. 3 (2012)"]}, {"page": "Hilary Joseph Francis Lofting", "response": ["#REDIRECTHilary Lofting"]}, {"page": "Francis Brien", "response": ["#REDIRECTHilary Lofting"]}, {"page": "1881 in Australian literature", "response": ["* 23 May – Hilary Lofting, novelist (died 1939)"]}, {"page": "1939 in Australian literature", "response": ["* 3 May – Hilary Lofting, novelist, travel writer, journalist and editor (born 1881)"]}, {"page": "Brien", "response": ["* Francis Brien, pseudonym of Australian writer Hilary Lofting"]}]}}