{"wiki_id": "http://www.wikidata.org/entity/Q1541911", "itemLabel": "Graham Dow", "itemDescription": "Bishop of Carlisle; Bishop of Willesden (born 1942)", "wikipedia_url": "https://en.wikipedia.org/wiki/Graham_Dow", "wikipedia_page": {"main": "Geoffrey Graham Dow (born 4 July 1942) is a retired British Anglican bishop. He was the Bishop of Carlisle from 2000 to 2009, the 66th holder of the office. He is a well-known Evangelical.", "link_mentions": [{"page": "Divine retribution", "response": ["The 2007 UK floods were claimed by Graham Dow to be God's punishment against homosexuals."]}, {"page": "Bishop of Willesden", "response": ["|align=\"center\"| 1992 ||align=\"center\"| 2000 || Graham Dow || Translated to Carlisle"]}, {"page": "Anglican Diocese of Manchester", "response": ["*2011–present: Graham Dow, a retired Bishop of Carlisle, lives in Romiley in the neighbouring Diocese of Chester, where he is also licensed as an HAB."]}, {"page": "St Albans School, Hertfordshire", "response": ["* Graham Dow (b. 1942), Bishop of Carlisle"]}, {"page": "Michael Scott-Joynt", "response": ["In 2003, he was (unexpectedly at the time) signatory to an open letter from 17 Church of England bishops opposing the nomination of Jeffrey John, an openly gay priest in a long-term relationship, as suffragan bishop-designate of Reading.Telegraph – And suspicion begat spite, back-stabbing and schism The other nine diocesan bishop signatories were: Michael Langrish (Exeter), Michael Nazir-Ali (Rochester), Peter Forster (Chester), James Jones (Liverpool), George Cassidy (Southwell & Nottingham), Graham Dow (Carlisle), John Hind (Chichester) and David James (Bradford).Frost's Meditations – Nazir-Ali "]}, {"page": "Bishop of Carlisle", "response": ["| 60px Graham Dow"]}, {"page": "Diocese of Chester", "response": ["*2009–present: Graham Dow, a retired Bishop of Carlisle, lives in Romiley and is also licensed as an honorary assistant bishop in the neighbouring Diocese of Manchester"]}, {"page": "St John's College, Nottingham", "response": ["*Graham Dow, Bishop of Carlisle (2000–2009)", "*Graham Dow, Bishop of Carlisle"]}, {"page": "John Hind (bishop of Chichester)", "response": ["Hind was also one of the bishops who signed a letter against Rowan Williams' decision not to block the appointment of Jeffrey John as Bishop of Reading in 2003, due to John being a self-identified homosexual. The other diocesan bishop signatories (referred to by their opponents, since there were nine, as the Nazgûl) were: Michael Scott-Joynt (Bishop of Winchester), Michael Langrish (Exeter), Michael Nazir-Ali (Rochester), Peter Forster (Chester), James Jones (Liverpool), George Cassidy (Southwell & Nottingham), Graham Dow (Carlisle) and David James (Bradford).Frost's Meditations – Nazir-Ali "]}, {"page": "Michael Langrish", "response": ["Langrish was one of the diocesan bishops who signed a letter against Rowan Williams' decision not to block the appointment of Jeffrey John as Bishop of Reading in 2003. The others signatories (referred to, since there were nine, as the \"Nazgûl\") were: Michael Scott-Joynt (Bishop of Winchester), Michael Nazir-Ali (Rochester), Peter Forster (Chester), James Jones (Liverpool), George Cassidy (Southwell & Nottingham), Graham Dow (Carlisle), John Hind (Chichester) and David James (Bradford)."]}, {"page": "James Jones (bishop)", "response": ["Jones is an Evangelical and was one of the group of bishops who signed a letter opposing Rowan Williams' decision not to block the appointment of Jeffrey John as Bishop of Reading. The other diocesan bishop signatories were: Michael Scott-Joynt (Bishop of Winchester), Michael Langrish (Exeter), Michael Nazir-Ali (Rochester), Peter Forster (Chester), George Cassidy (Southwell & Nottingham), Graham Dow (Carlisle), John Hind (Chichester) and David James (Bradford). In 2008, Jones apologised for opposing the gay cleric. "]}, {"page": "George Cassidy (bishop)", "response": ["Cassidy spent much of his time in the House of Lords, where he voted against the Equality Act in early 2007. He was also one of the rebel bishops who signed a letter against Rowan Williams' decision not to block the appointment of Jeffrey John as Bishop of Reading in 2003. The other diocesan bishop signatories (referred to by their opponents, since there were nine, as the Nazgûl) were: Michael Scott-Joynt (Bishop of Winchester), Michael Langrish (Exeter), Michael Nazir-Ali (Rochester), Peter Forster (Chester), James Jones (Liverpool), Graham Dow (Carlisle), John Hind (Chichester) and David James (Bradford).Frost's Meditations – Nazir-Ali "]}]}}