{"wiki_id": "http://www.wikidata.org/entity/Q15452040", "itemLabel": "John Relly Beard", "itemDescription": "British Unitarian minister, educator and writer", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Relly_Beard", "wikipedia_page": {"main": "John Relly Beard (4 August 1800 – 22 November 1876) was an English Unitarian minister, schoolmaster, university lecturer, and translator who co-founded Unitarian College Manchester and wrote more than thirty books.", "link_mentions": [{"page": "James Relly", "response": ["Relly is said to have shown much natural ability and a generous disposition, under a rough manner. He died in London, England on 25 April 1778 and was interred in the baptist burial ground, Maze Pond, Southwark; the inscription on his tombstone represents him as 'aged 56 years'. Two elegies were written by admirers. He left a widow and one daughter, who was living in 1808 and had issue. John Relly Beard was named after him, but was not a descendant. Relly's portrait was twice engraved."]}, {"page": "John Beard", "response": ["* John Relly Beard (1800–1876), Unitarian minister"]}, {"page": "Richard Carlile", "response": ["Carlile was an advocate of the Christ myth theory. He did not believe that Jesus existed. He debated Unitarian minister John Relly Beard in The Republican, 1826.Beard, J. R.. (1825). To Mr. Richard Carlile, London. The Republican 12 (26): 803-828.Carlile, Richard. (1826). To Mr. J. R. Beard, Unitarian Preacher, Manchester. The Republican 13 (3): 65-72."]}, {"page": "Unitarian College, Manchester", "response": ["* John Relly Beard 1854- Alan P. F. Sell Philosophy, dissent and nonconformity 2003 p139  \"Established in 1854, with John Relly Beard, a fellow-student of Martineau's at Manchester College, York, as its first principal\""]}, {"page": "Helen Bosanquet", "response": ["Helen Dendy was born in Manchester in 1860 to Reverend John Dendy and his wife, Sarah Beard (1831–1922), one of nine children, the fifth child and the youngest daughter of John Relly Beard. Helen was one of three children, Mary Dendy was her elder sister and her brother was biologist Arthur Dendy (1865–1925)."]}, {"page": "William Gaskell", "response": ["* Head, Geoffrey 'The founders: John Relly Beard and William Gaskell' in Len Smith and others Unitarian to the Core: Unitarian College Manchester, 1854-2004 (Carnegie Publishing, 2004) pp. 30–51"]}, {"page": "Brooklands, Greater Manchester", "response": ["*Rev John Relly Beard."]}, {"page": "History of Unitarianism", "response": ["English Unitarianism produced some well-known scholars, e.g. John Kenrick (1788–1877), James Yates (1789–1871), Samuel Sharpe (1799–1881), but few popular preachers, though George Harris (1794–1859) is an exception. For the education of its ministry it supported Manchester College at Oxford (which deduced its ancestry from the academy of Richard Frankland, begun 1670), the Unitarian Home Missionary College (founded in Manchester in 1854 by John Relly Beard, D.D., and William Gaskell), and the Presbyterian College, Carmarthen.  It also produced the notable Chamberlain family of politicians: Joseph Chamberlain, Austen Chamberlain, and Neville Chamberlain, and the Courtauld and Tate industrialist dynasties."]}, {"page": "J. R. Beard", "response": ["#REDIRECT John Relly Beard"]}, {"page": "William Henry Herford", "response": ["After attending a school kept by Charles Wallace, Unitarian minister at Hale Barns, Herford was from 1831 to 1834 a day boy at Shrewsbury School under Samuel Butler. From 1834 to 1836 he was at Manchester grammar school. Then, destined for the Unitarian ministry, he was prepared for entry at the ministerial college at York by John Relly Beard."]}, {"page": "List of Bible dictionaries", "response": ["|John Relly Beard"]}, {"page": "Emily Taylor", "response": ["Rev. John Relly Beard's Collection of Hymns for Public and Private Worship (1837) repeats several of these and also has:"]}, {"page": "Henry Arthur Bright", "response": ["He also contributed a hymn ('To the Father through the Son') to Hymns, Chants, and Anthems, 1858, edited by John Hamilton Thom for Renshaw Street Unitarian Chapel; and wrote (before 1858) 'The Lay of the Unitarian Church,' a spirited poem, originally contributed to a magazine (Sabbath Leisure, edited by John Relly Beard), and issued anonymously and without date as a tract about 1870. To the same magazine he contributed a prose tale, 'The Martyr of Antioch', illustrating the early history of Arianism; part of this was reprinted in the Christian Freeman."]}, {"page": "John Hamilton Thom", "response": ["In July 1838 he succeeded John Relly Beard as editor of the Christian Teacher, a monthly which developed (1845) into the Prospective Review (see John James Tayler). From February to May 1839 he contributed four lectures, and a defensive ‘letter,’ to the Liverpool Unitarian controversy, conducted in conjunction with Martineau and Henry Giles, in response to the challenge of thirteen Anglican clergy. Thom's chief antagonist was Thomas Byrth."]}, {"page": "Ann Hawkshaw", "response": ["During the 1820s Ann met John Hawkshaw. They were married on 20 March 1835 in Whixley, moving to Salford shortly after. Whilst in Manchester the Hawkshaws mixed socially with the Unitarian community, including John Relly Beard, William and Elizabeth Gaskell and their close friends the Dukinfield Darbishires, and Catherine Winkworth. John's election to the Manchester Literary and Philosophical Society in 1839 brought the Hawkshaws into contact with many of Manchester's prominent thinkers including Richard Cobden and John Dalton."]}, {"page": "James Yates (minister)", "response": ["Yates issued (1833) proposals for an organisation of the Unitarian congregations of Great Britain on the presbyterian model; the plan was abortive, though it obtained the support of John Relly Beard, Joseph Hunter, and John James Tayler. In the course of the Hewley case, Sir Lancelot Shadwell had condemned the Improved Version of the New Testament, issued (1808) by Unitarians. Yates wrote A Letter to the Vice-chancellor, 1834, defending the version, which produced a reply by Robert Halley."]}, {"page": "Arthur Dendy", "response": ["Dendy's parents were John Dendy, a silk fabric maker of Manchester, and Sarah Beard, daughter of John Relly Beard. His sisters included Mary Dendy and Helen Bosanquet. He married Ada Margaret Courtauld on 5 December 1888. They had four children, three daughters and one son."]}, {"page": "Charles Beard (Unitarian)", "response": ["Beard was the eldest son of John Relly Beard, by his wife Mary (Barnes), and was born at Higher Broughton, Salford, on 27 July 1827. After passing through his father's school, he studied at Manchester New College (then at Manchester, now Harris Manchester College, Oxford) from 1843 to 1848, graduating B.A. at London University in 1847. He aided his father in compiling the Latin dictionary issued by Messrs. Cassell. In 1848-9 he continued his studies at Berlin."]}, {"page": "Mary Dendy", "response": ["Dendy was born in 1855 in Bryn Celyn, Llangoed in north Wales. She was the daughter of John Dendy, Unitarian minister, and his wife  Sarah Beard (1831–1922), eldest daughter of John Relly Beard. Her sister was the social reformer Helen Bosanquet and her brother was the biologist Arthur Dendy (1865–1925). She was home educated, completing her education with a year at Bedford College, London."]}, {"page": "Relly", "response": ["* John Relly Beard (1800–1876), English Unitarian minister, schoolmaster, university lecturer, and translator"]}, {"page": "John R. Beard", "response": ["#REDIRECT John Relly Beard"]}]}}