{"wiki_id": "http://www.wikidata.org/entity/Q15492531", "itemLabel": "George Oatley", "itemDescription": "English architect", "wikipedia_url": "https://en.wikipedia.org/wiki/George_Oatley", "wikipedia_page": {"main": "Sir George Herbert Oatley  (3 January 1863 – 12 May 1950) was an English architect noted for his work in Bristol, especially the gothic Wills Memorial Building. He was knighted for public service in 1925.", "link_mentions": [{"page": "University of Bristol", "response": ["thumb|200px|The Gardens of Goldney Hall were acquired by the Wills familyBurwalls, a mansion house on the other side of the Avon Gorge, was used as a halls of residence in the past and was a home of Sir George Oatley. The building is now used to house the Centre for Continuing Education.", "In Clifton, Goldney Hall was built first in the early 18th century by the wealthy merchant Goldney family and eventually became part of the university in 1956. It is a popular location for filming, with The Chronicles of Narnia, The House of Eliott and Truly, Madly, Deeply, as well as episodes of Only Fools and Horses and Casualty, being filmed there. The Grotto in the grounds is a Grade I listed building. Clifton Hill House is another Grade I listed building now used as student accommodation in Clifton. The original building was constructed between 1745 and 1750 by Isaac Ware, and has been used by the university since its earliest days in 1909. Manor Hall comprises five separate buildings, the principal of which was erected from 1927 to 1932 to the design of George Oatley following a donation from Henry Herbert Wills. Manor Hall houses the largest and most dated rooms, some dating back to the early 20th century. One of its annexes, Manor House, has recently been refurbished and officially 'reopened' in 1999. "]}, {"page": "Oatley", "response": ["* George Oatley (1863–1950), architect"]}, {"page": "Cotham, Bristol", "response": ["The University of Bristol Student Health Service is a separate general practice located at Hampton House Health Centre, opposite Western College, providing primary care service to students of university their families with over 6,000 registrations a year. The Grade II listed Hampton House building itself is the former site of the Bristol Homeopathic Hospital, built in 1925 in the Jacobethan Cotswold vernacular style by George Oatley, a local Bristol architect renowned for the design on many buildings locally, most notably the nearby Wills Memorial Building. Homeopathic treatments had been available in Bristol since 1854. As homeopathy services developed and expanded over time, its popularity required the building of a specialist hospital. Following his appointment as president of the Bristol Homeopathic Hospital in 1916, Walter Melville Wills commissioned the construction of the new hospital at the site, moving from its former location, a building in Brunswick Square. The commission was a gift to the city in remembrance of his son, killed in action in 1915 in the First World War. The Wills family owned a successful Bristol tobacco company and bequeathed the city a number of prominent buildings. Construction began in 1921 with the engraved foundation stone laid by Edward, Prince of Wales. The building ceased use as a homeopathic hospital in 1986 following the defunding of homeopathic services on the NHS."]}, {"page": "George Herbert Oatley", "response": ["#REDIRECT George Oatley"]}, {"page": "Sir George Oatley", "response": ["#REDIRECT George Oatley"]}, {"page": "New Room, Bristol", "response": ["After Wesley's death the property passed into the hands of the Welsh Calvinistic Methodists. In 1929, it was given back to the Wesleyan Methodist Church. The John Snetzler Chamber Organ of 1761 is a 20th-century addition following the restoration of the building in 1929 by Sir George Oatley."]}, {"page": "Template talk:WikiProject Biography/Missing", "response": ["*George Oatley"]}, {"page": "List of British architects", "response": ["*George Oatley (1863–1950)"]}, {"page": "Bristol General Hospital", "response": ["The hospital has its origins in a small house in Guinea Street where it was established with 20 beds in 1832. Construction of purpose-built facility, at a site previously occupied by Bathurst Ironworks and designed by William Bruce Gingell, was undertaken between 1852 and 1856. An extension was opened by the Duke of Edinburgh in 1891. The nurses accommodation, designed by Henry Crisp and Sir George Oatley, was completed in 1895 and extended in 1907."]}, {"page": "History of the University of Bristol", "response": ["After the death of their father, Henry Wills and George Wills donated money for the building of a university building in memory of their father. He met with George Oatley (later Sir George Oatley) to plan the building of what was to become the Wills Memorial Building which the brothers requested would be built to last for 400 years.Cartleton 1984 p34 When the Wills family acquired Royal Fort gardens as a site they were given to the university and were to be the site of a castle like building which became the physics department."]}, {"page": "Warlingham Park Hospital", "response": ["The facility, which was designed by George Oatley and Willie Swinton Skinner, was built at a cost of £200,000 and opened as the Croydon Mental Hospital on 26 June 1903. This was reputedly the first institution to be called a 'mental hospital' and never appears officially to have been called an asylum. The hospital was extended in the early 20th century with the addition of a nurses' home, two further blocks for female patients and four villas."]}, {"page": "Beaufort War Hospital", "response": ["Built next to the co-located Stapleton Hospital mental health facility, the Bristol Lunatic Asylum was the city’s response to the 1845 Mental Asylum Health Act, which laid upon local authorities the statutory duty to provide treatment facilities for in-patients. The building was by Henry Crisp, with subsequent additions by Crisp and George Oatley."]}, {"page": "Banwell Castle", "response": ["The land on which the house is built was owned by the Bishop of Bath and Wells. It was sold to John and Joan Landown in 1753. It was passed down to the Sympson family; John Dyer Sympson, a solicitor from London, built the castle as his home. It was completed in 1847. Built in the Gothic Revival style made popular by Augustus Pugin.it was expanded and embellished in the 1880s by Sir Elskin Baker, having passed to Sir William Baker, Other owners and tenants have been 1854 to 1874 Henry & Elizabeth Pigou then Sir William & Lady Frances Baker.  In 1883 the Estate was sold to the Shaw Yate's family from Rotherham. In 1905 Kate Behrens of Manchester purchased the property. Mr & Mrs Hope made it their home, she died in 1916 and the Estate was then sold to Richard Calvert who in 1919 had the Bristol Architect Sir George Oatley do remodelling work on the property."]}, {"page": "List of museums in Bristol", "response": ["| New Room || 125px || Broadmead || Bristol || Religious || The New Room was built in 1739 by John Wesley and is the oldest Methodist chapel in the world. The chapel includes a double decker pulpit, which was common at the time, and an octagonal lantern window to reduce the amount paid in Window tax. In addition to meetings and worship the New Room was used a dispensary and schoolroom for the poor people of the area. The pews and benches were made from old ship timber. The courtyards around the building contain statues of John Wesley and his brother Charles. The John Snetzler Chamber Organ of 1761 is a 20th-century addition following the restoration of the building in 1929 by Sir George Oatley. It has been designated by English Heritage as a grade I listed building, and is the only piece of land in Broadmead for which the freehold has not been bought by Bristol City Council during expansion after World War II. It now includes a visitor centre."]}, {"page": "Barrow Hospital", "response": ["The new hospital was designed by Sir George Oatley of Bristol to the then-innovative colony plan based on detached 'villas' centred on a central cluster of service buildings. The plan called for 25 villas to house 1,200 patients,  treatment centres for local authority and private patients, a chapel, recreation hall, laundry and central kitchens."]}, {"page": "Bristol Homeopathic Hospital", "response": ["Bristol Homeopathic Hospital was a hospital in the city of Bristol in south-west England, specialising in homeopathic treatments. The Hampton House building, designed by George Oatley, is a Grade II listed building. Hampton House is now being used as the student health service for Bristol University, offering a range of services to the students of the university."]}, {"page": "Fry Building", "response": ["The Fry Building of the University of Bristol is a Grade II listed building built in 1909 by Sir George Oatley.", "The original section of the building was constructed in 1880, designed by architect Charles Francis Hansom. In 1909 Sir George Oatley was appointed to design a new university department for Chemistry and Physiology, further extending the Fry Building to the southwest."]}, {"page": "Oatley, George", "response": ["#redirectGeorge Oatley"]}]}}