{"wiki_id": "http://www.wikidata.org/entity/Q15492506", "itemLabel": "Paul Shelley", "itemDescription": "British actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Paul_Shelley", "wikipedia_page": {"main": "Paul Shelley (born Paul Matthews, 15 May 1942) is an English actor.\nShelley was born in Leeds, West Riding of Yorkshire, and trained at RADA (Royal Academy of Dramatic Art). Since then he has mainly worked in the theatre as a classical actor. He has worked extensively with the Royal National Theatre and the Royal Shakespeare Company and has appeared in several West End productions.", "link_mentions": [{"page": "Antony and Cleopatra", "response": ["* 1999, Paul Shelley as Antony and Mark Rylance as Cleopatra in an all-male cast production at Shakespeare's Globe Theatre in London."]}, {"page": "Six Degrees of Separation (play)", "response": ["| style=\"text-align:center;\"| Paul Shelley"]}, {"page": "Shelley (name)", "response": ["* Paul Shelley (born 1942), English actor", "* Paul Shelley (politician) (born 1959), Canadian politician"]}, {"page": "Oh! What a Lovely War", "response": ["Oh! What a Lovely War is a 1969 British comedy musical war film directed by Richard Attenborough (in his directorial debut), with an ensemble cast, including Maggie Smith, Dirk Bogarde, John Gielgud, John Mills, Kenneth More, Laurence Olivier, Jack Hawkins, Corin Redgrave, Michael Redgrave, Vanessa Redgrave, Ralph Richardson, Ian Holm, Paul Shelley, Malcolm McFee, Jean-Pierre Cassel, Nanette Newman, Edward Fox, Susannah York, John Clements, Phyllis Calvert and Maurice Roëves.", "* Paul Shelley as Jack Smith"]}, {"page": "Not About Heroes", "response": ["Not About Heroes had its première at the Edinburgh Festival in 1982 and won a Fringe First award. Directed by Eric Standidge, Sassoon was played by the author and Owen by David Learner. It toured and came to the King's Head, was adapted for Yorkshire TV and BBC Radio 4, and was published by Faber and Faber, all in 1983. A new production at the Royal National Theatre in 1986 celebrated the centenary of Sassoon's birth. A national tour took place the following year with Paul Shelley as Siegfried Sassoon and Stephen McGann as Wilfred Owen. In 1992, the author directed a revised text for the Citizen's, Glasgow – a production which afterwards was seen in Shrewsbury as part of the celebrations marking the centenary of Owen's birth.", "Stephen McGann played Owen in a production at the Oxford Playhouse in 1987, opposite Paul Shelley as Sassoon.McGann Brothers  Jonas Armstrong played Owen in a 2000 production at the Edinburgh Fringe."]}, {"page": "Baie Verte-Green Bay", "response": ["| rowspan=\"4\" |Paul Shelley"]}, {"page": "Four to Doomsday", "response": ["Kwouk later played Doctor Hayashi in the audio play Loups-Garoux while Paul Shelley appeared in The Whispering Forest."]}, {"page": "Sydney Carton", "response": ["* Paul Shelley (TV/BBC, 1980)"]}, {"page": "Caught in the Act", "response": ["* Caught in the Act (1997 film), a comedy film starring Sara Crowe, Annette Badland, Nadia Sawalha and Paul Shelley"]}, {"page": "Secret Army (TV series)", "response": ["| Maj. Nick Bradley ||  bgcolor=lightgray| || colspan=\"2\" style=\"text-align:center;\" |  Paul Shelley"]}, {"page": "A Tale of Two Cities", "response": ["*The BBC produced another eight-part mini-series in 1980 starring Paul Shelley as Carton/Darnay, Sally Osborne as Lucie Manette and Nigel Stock as Jarvis Lorry."]}, {"page": "The Fourth Arm (TV series)", "response": ["The Fourth Arm was created and produced by Gerard Glaister, who had previously been at the helm of other World War II dramas such as Colditz and Secret Army. The serial starred former Secret Army cast member Paul Shelley as Major Hugh Gallagher, essentially a reprise of his Secret Army character, Major Nick Bradley, in all but name."]}, {"page": "Francis Matthews (actor)", "response": ["Matthews was married to actress Angela Browne from 1963 until her death in 2001; the couple had three sons. Two, Damien Matthews and Paul Rattigan, are actors; the other, Dominic, is an artist and musician. Matthews' younger brother, Paul Shelley, is also an actor; they had a sister, Maura."]}, {"page": "List of alumni of the Royal Academy of Dramatic Art", "response": ["*Paul Shelley (Acting Diploma 1966)"]}, {"page": "The Relics of Jegg-Sau", "response": ["*Kalwell — Paul Shelley"]}, {"page": "The Oracle of Delphi", "response": ["*Socrates - Paul Shelley"]}, {"page": "Pathfinders (TV series)", "response": ["|John Bluthal, Julian Orchard, Paul Shelley, Ian Stirling "]}, {"page": "Shawn Skinner", "response": ["On January 19, 2007, Skinner was appointed Minister of Human Resources, Labour and Employment and the Minister responsible for Newfoundland and Labrador Housing. His appointment came after Paul Shelley, the department's former minister, announced he would not be seeking re-election in the October election. In August 2007, Skinner said he planned to bring forth legislation to protect jobs of reservists who leave work for military duty. Skinner's announcement was in response to Major Wallace Noseworthy, who called for the legislation after he was forced to quit his job in order to serve in Afghanistan. Noseworthy's employer would not grant him a leave of absence to serve. In April 2008, the government brought forth changes to The Labour Standards Act to provide for unpaid leave for reservists."]}, {"page": "Auriol Smith", "response": ["During 1990, as part of a busy year, she played Lady Wishfort in The Way of the World at the Royal Exchange Manchester (deputising for Sylvia Syms who was indisposed), and toured North America for the ACTER company in The Winter's Tale playing opposite Paul Shelley as Leontes. She also appeared in Christine Edzard's film The Fool."]}, {"page": "Made in Bangkok", "response": ["* Paul Shelley as Stephen "]}, {"page": "It Shouldn't Happen to a Vet", "response": ["* Paul Shelley as Richard"]}, {"page": "Paradise Postponed", "response": ["* Paul Shelley - Fred Simcox"]}, {"page": "List of Doctors characters", "response": ["| Paul Shelley"]}, {"page": "God's Outlaw (1986 film)", "response": ["* Paul Shelley ...  John Frith "]}, {"page": "The Secret Rapture (play)", "response": ["*Tom - Paul Shelley"]}, {"page": "Macbeth (2010 film)", "response": ["* Duncan / Doctor – Paul Shelley"]}, {"page": "Revelations (1994 TV series)", "response": ["Revelations was a late-night soap opera created by Russell T Davies, Brian B. Thompson, and Tony Wood, produced by Granada and starring Judy Loe and Paul Shelley. It aired in the Granada, Central and Carlton ITV regions between 1994 and 1996. The series is family drama about the family of the priest Edward Rattigan (Shelley) and his wife Jessica (Loe). It follows and critiques the organisational structure of the Anglican Church at the turn of the millennium."]}, {"page": "2018 Progressive Conservative Party of Newfoundland and Labrador leadership election", "response": [":Former MHAs: Susan Sullivan, MHA for Grand Falls-Windsor-Buchans (2007-2015); Patty Pottle;  Paul Shelley; Paul Oram; Wade Verge, former Provincial Cabinet Minister and Speaker of the House Assembly; Fred Stagg (1971-1985); Len Simms, former party leader."]}, {"page": "On Wings of Fire", "response": ["On Wings of Fire (originally titled A Quest for Zarathustra) is a 1986 English-language Indian film directed by Cyrus Bharucha and starring Zubin Mehta, Paul Shelley, Saeed Jaffrey, Amrish Puri, with Nigel Terry as Zarathustra and Derek Jacobi as the narrator. It is the first and only film to cover the philosophy and history of Zoroastrianism in a scholarly and dramatic way. The film was premiered at Mumbai's Sterling Cinema in June 1986, and was released in the United States in 2001.", "*Paul Shelley as King Vishtaspa"]}, {"page": "Nicholas Nickleby (1968 TV series)", "response": ["* Paul Shelley as  Frank Cheeryble  (4 episodes)"]}, {"page": "A Tale of Two Cities (1980 TV series)", "response": ["* Paul Shelley as Sydney Carton/Charles Darnay "]}, {"page": "Shelley, Paul", "response": ["#redirectPaul Shelley"]}]}}