{"wiki_id": "http://www.wikidata.org/entity/Q1544613", "itemLabel": "Jeremy Gray", "itemDescription": "British mathematician", "wikipedia_url": "https://en.wikipedia.org/wiki/Jeremy_Gray", "wikipedia_page": {"main": "Jeremy John Gray (born 25 April 1947) is an English mathematician primarily interested in the history of mathematics.", "link_mentions": [{"page": "George Boole", "response": ["In 1841, Boole published an influential paper in early invariant theory. He received a medal from the Royal Society for his memoir of 1844, \"On a General Method in Analysis\". It was a contribution to the theory of linear differential equations, moving from the case of constant coefficients on which he had already published, to variable coefficients.Andrei Nikolaevich Kolmogorov, Adolf Pavlovich Yushkevich (editors), Mathematics of the 19th Century: function theory according to Chebyshev, ordinary differential equations, calculus of variations, theory of finite differences (1998), pp. 130–2; Google Books . The innovation in operational methods is to admit that operations may not commute.Jeremy Gray, Karen Hunger Parshall, Episodes in the History of Modern Algebra (1800–1950) (2007), p. 66; Google Books . In 1847, Boole published The Mathematical Analysis of Logic, the first of his works on symbolic logic.George Boole, The Mathematical Analysis of Logic, Being an Essay towards a Calculus of Deductive Reasoning  (London, England: Macmillan, Barclay, & Macmillan, 1847)."]}, {"page": "Isomorphism theorems", "response": ["* Colin McLarty, \"Emmy Noether's 'Set Theoretic' Topology: From Dedekind to the rise of functors\". The Architecture of Modern Mathematics: Essays in history and philosophy (edited by Jeremy Gray and José Ferreirós), Oxford University Press (2006) pp. 211–35."]}, {"page": "Eugenio Beltrami", "response": ["* Jeremy Gray, Poincaré and Klein — Groups and Geometries. In 1830–1930: a Century of Geometry (ed L.Boi, D.Flament and J.-M.Salanskis), Springer, 1992, 35–44"]}, {"page": "Sphere-world", "response": ["This thought experiment is discussed in Roberto Torretti's book Philosophy of Geometry from Riemann to Poincaré and in Jeremy Gray's article \"Epistemology of Geometry\" in the Stanford Encyclopedia of Philosophy. This sphere-world is also described in Ian Stewart's book Flatterland (chapter 10, Platterland)."]}, {"page": "European Mathematical Society", "response": ["Otto Neugebauer Prize: Jeremy Gray (UK)"]}, {"page": "Angle of parallelism", "response": ["* Jeremy Gray (1989) Ideas of Space: Euclidean, Non-Euclidean, and Relativistic, 2nd edition, Clarendon Press, Oxford (See pages 113 to 118)."]}, {"page": "Alabama House of Representatives", "response": ["| Jeremy Gray", "| Jeremy Gray"]}, {"page": "Functional square root", "response": ["*The solutions of  over \\mathbb{R} (the involutions of the real numbers) were first studied by Charles Babbage in 1815, and this equation is called Babbage's functional equation.Jeremy Gray and Karen Parshall (2007) Episodes in the History of Modern Algebra (1800–1950), American Mathematical Society,  A particular solution is  for . Babbage noted that for any given solution , its functional conjugate  by an arbitrary invertible function  is also a solution. In other words, the group of all invertible functions on the real line acts on the subset consisting of solutions to Babbage's functional equation by conjugation."]}, {"page": "Jed Buchwald", "response": ["Buchwald is also the general editor of the book series Dibner Institute Studies in the History of Science and Technology and of the book series Archimedes: New Studies in the History and Philosophy of Science and Technology, as well as managing editor of the book series Sources and Studies in the History of Mathematics and the Physical Sciences. Buchwald, together with Jeremy Gray, serves as editor-in-chief of the Springer journal Archive for History of Exact Sciences."]}, {"page": "List of people by Erdős number", "response": ["* Jeremy Gray"]}, {"page": "Geometry", "response": ["Immanuel Kant argued that there is only one, absolute, geometry, which is known to be true a priori by an inner faculty of mind: Euclidean geometry was synthetic a priori.Kline (1972) \"Mathematical thought from ancient to modern times\", Oxford University Press, p. 1032.  Kant did not reject the logical (analytic a priori) possibility of non-Euclidean geometry, see Jeremy Gray, \"Ideas of Space Euclidean, Non-Euclidean, and Relativistic\", Oxford, 1989; p. 85.  Some have implied that, in light of this, Kant had in fact predicted the development of non-Euclidean geometry, cf. Leonard Nelson, \"Philosophy and Axiomatics,\" Socratic Method and Critical Philosoph, Dover, 1965, p. 164.  This view was at first somewhat challenged by thinkers such as Saccheri, then finally overturned by the revolutionary discovery of non-Euclidean geometry in the works of Bolyai, Lobachevsky, and Gauss (who never published his theory). They demonstrated that ordinary Euclidean space is only one possibility for development of geometry. A broad vision of the subject of geometry was then expressed  by Riemann in his 1867 inauguration lecture Über die Hypothesen, welche der Geometrie zu Grunde liegen (On the hypotheses on which geometry is based), published only after his death. Riemann's new idea of space proved crucial in Albert Einstein's general relativity theory. Riemannian geometry, which considers very general spaces in which the notion of length is defined, is a mainstay of modern geometry."]}, {"page": "The Story of Maths", "response": ["The Story of Maths is a four-part British television series outlining aspects of the history of mathematics. It was a co-production between the Open University and the BBC and aired in October 2008 on BBC Four. The material was written and presented by University of Oxford professor Marcus du Sautoy.Guardian interview The consultants were the Open University academics Robin Wilson, professor Jeremy Gray and June Barrow-Green. Kim Duke is credited as series producer.To Infinity and Beyond 27 October 2008 21:00 BBC Four"]}, {"page": "The Princeton Companion to Mathematics", "response": ["The contributors to The Princeton Companion to Mathematics consist of 133 of the world's best mathematicians. Timothy Gowers, its editor, is the recipient of the Fields Medal, considered to be the top honor in mathematics. Other contributors include Fields medalists Michael Atiyah, Alain Connes, Charles Fefferman, and Terence Tao, and well-known mathematicians Noga Alon, George Andrews, Béla Bollobás, John P. Burgess, Kevin Buzzard, Clifford Cocks, Ingrid Daubechies, Persi Diaconis, Jordan Ellenberg, Oded Goldreich, Andrew Granville, Jeremy Gray, Frank Kelly, Sergiu Klainerman, Jon Kleinberg, János Kollár, Peter Lax, Dusa McDuff, Barry Mazur, Carl Pomerance, Eleanor Robson, Peter Sarnak, Madhu Sudan, Clifford Taubes, and Avi Wigderson. Among the historians who contributed to it are Charles C. Gillispie, Ivor Grattan-Guinness, Jeremy Gray, Niccolò Guicciardini, Ulf Hashagen, Eberhard Knobloch, Karen Hunger Parshall, Eleanor Robson, and Erhard Scholz."]}, {"page": "Revolutions in Mathematics", "response": ["*Jeremy Gray, The nineteenth-century revolution in mathematical ontology (226–248); "]}, {"page": "Albert Leon Whiteman Memorial Prize", "response": ["*2009 Jeremy Gray"]}, {"page": "Colin McLarty", "response": ["* Colin McLarty, 'Emmy Noether’s ‘Set Theoretic’ Topology: From Dedekind to the rise of functors' in The Architecture of Modern Mathematics: Essays in history and philosophy (edited by Jeremy Gray and José Ferreirós), Oxford University Press (2006) p. 187–208."]}, {"page": "Klein's Encyclopedia of Mathematical Sciences", "response": ["In 2013 Umberto Bottazzini and Jeremy Gray published Hidden Harmony in which they examined the history of complex analysis. In the final chapter concerned with textbooks, they used Klein's and Molk's encyclopedia projects§ 10.10: Complex analysis in the German and French Encyclopädie, pages 691 to 759 in Hidden Harmony – Geometric Fantasies, Springer  to contrast the approaches in Germany (Weierstrass and Riemann) and France (Cauchy). In 1900 an element of an algebra over a field (usually \\mathbb{R} or \\mathbb{C}) was known as a hypercomplex number, exemplified by quaternions (\\mathbb{H}) which contributed the dot product and cross product useful in analytic geometry, and the del operator in analysis. Explorative articles on hypercomplex numbers, mentioned by Bottazzini and Gray, written by Eduard Study (1898) and Elie Cartan (1908), served as advertisements to twentieth century algebraists, and they soon retired the term hypercomplex by displaying the structure of algebras."]}, {"page": "Archive for History of Exact Sciences", "response": ["Archive for History of Exact Sciences is a peer-reviewed academic journal published quarterly by Springer Science+Business Media, covering the history of mathematics and of astronomy observations and techniques, epistemology of science, and philosophy of science from Antiquity until now. It was established in 1960 and the current editors-in-chief are Jed Z. Buchwald and Jeremy Gray."]}, {"page": "List of International Congresses of Mathematicians Plenary and Invited Speakers", "response": ["*Jeremy Gray"]}, {"page": "June Barrow-Green", "response": ["Barrow-Green obtained a BSc Hons in Mathematics in 1986 and an MSc in Mathematical Physics in 1989, both from King's College London. In 1993 she gained a PhD in Mathematics from the Open University, under supervision of Jeremy Gray, on Poincaré and the Three Body Problem."]}]}}