{"wiki_id": "http://www.wikidata.org/entity/Q15456058", "itemLabel": "Lance Price", "itemDescription": "British journalist", "wikipedia_url": "https://en.wikipedia.org/wiki/Lance_Price", "wikipedia_page": {"main": "Lance Price (born 3 September 1958) is Chief of Staff to Kim Leadbeater, MP for Batley and Spen  in the UK. He returned to active politics to help run her by-election campaign, having worked with her at the Jo Cox Foundation since the murder of her sister who was MP for the constituency in 2015-16. He is also a writer, broadcaster and political commentator. He was a journalist for the BBC from 1981 to 1998, then became special adviser to Prime Minister Tony Blair, eventually assuming the role of Director of Communications for the Labour Party, coordinating the Labour Party election campaign of 2001. He has published five books, and appears regularly on Sky News and the BBC. Price's fourth book, The Modi Effect, which details the rise of the Indian Prime Minister Narendra Modi, was published by Hodder & Stoughton in 2015.", "link_mentions": [{"page": "Sackville School, East Grinstead", "response": ["* Lance Price (1958-), journalist and political commentator"]}, {"page": "List of Question Time episodes", "response": ["|Jack Straw, Kenneth Clarke, Piers Morgan, Jenny Tonge, Lance Price"]}, {"page": "List of University of Oxford people with PPE degrees", "response": ["* Lance Price, former BBC journalist and special advisor to Tony Blair"]}, {"page": "List of advocates of republicanism in the United Kingdom", "response": ["*Lance Price, writer, journalist and former political adviser to Tony Blair"]}, {"page": "The Modi Effect", "response": ["#REDIRECT Lance Price"]}, {"page": "Lance (given name)", "response": ["* Lance Price (born 1958), British writer, journalist and political strategist"]}, {"page": "Prescott punch", "response": ["At the time of the punch Brown was at the Labour Party headquarters at Millbank Tower in London. He was meeting with senior advisers including Douglas Alexander, Ian Austin, Lord Falconer, Lance Price, Philip Gould and Labour General Secretary Margaret McDonagh to discuss the next day's press conference. During the meeting McDonagh was informed of the punch by a Labour official. At the end of the meeting she announced that \"there has been an incident in Rhyl. We don't know the details but we think that John Prescott may have punched someone\". It proved difficult for Brown's team to contact Prescott to get more details as the mobile phone signal was patchy in Rhyl."]}]}}