{"wiki_id": "http://www.wikidata.org/entity/Q15408000", "itemLabel": "Chlöe Howl", "itemDescription": "British singer and singer-songwriter", "wikipedia_url": "https://en.wikipedia.org/wiki/Chl%C3%B6e_Howl", "wikipedia_page": {"main": "Chlöe Howl (born Chlöe Louise Howells; 4 March 1995), is a British singer-songwriter. She was shortlisted for the BBC Sound of 2014 and the 2014 BRIT Awards: Critics Choice Award.", "link_mentions": [{"page": "March 4", "response": ["*1995 – Chlöe Howl, British singer-songwriter"]}, {"page": "Chloe", "response": ["* Chlöe Howl (born 4 March 1995), British singer-songwriter"]}, {"page": "Victoria Park, London", "response": ["* Appears in the music video Paper Heart, by Chlöe Howl."]}, {"page": "Dawn Shadforth", "response": ["| Chlöe Howl "]}, {"page": "Way Out West (festival)", "response": ["*Chlöe Howl"]}, {"page": "Digital Dog", "response": ["*Chlöe Howl - \"Paper Heart\" (2013)"]}, {"page": "Sound of...", "response": ["| Chance The Rapper, Chlöe Howl, FKA twigs, Jungle, Kelela, Luke Sital-Singh, MNEK, Nick Mulvey, Royal Blood, Say Lou Lou", "The longlist for the Sound of 2014 poll was revealed on 2 December 2013. The acts nominated were Banks, Chance the Rapper, Chlöe Howl, Ella Eyre, George Ezra, FKA twigs, Jungle, Kelela, Luke Sital-Singh, MNEK, Nick Mulvey, Royal Blood, Sam Smith, Sampha and Say Lou Lou. On 10 January 2014, Sam Smith was announced as the winner on Radio 1 by Nick Grimshaw."]}, {"page": "Unicorn Kid", "response": ["*Chlöe Howl - Rumour (Unicorn Kid Remix) (2013)"]}, {"page": "Alexandra Road Estate", "response": ["* Chlöe Howl – \"Do It Alone\" (2017)"]}, {"page": "Julian Emery", "response": ["|Chlöe Howl", "|Jim Irvin, Chlöe Howl"]}, {"page": "Jim Irvin", "response": ["|Chlöe Howl", "|Julian Emery, Chlöe Howl"]}, {"page": "We're No Heroes", "response": ["In January 2013, the band released a single titled \"Distort The Air\", that lead to worldwide support and national attention of their music from the likes of BBC Radio 1, BBC Radio 6 Music, BBC Radio Wales, Topshop playlists and since have appeared on bills alongside bands such as Catfish and the Bottlemen, Peace, Tall Ships, Dutch Uncles, Public Service Broadcasting, Tribes, Chlöe Howl, Tom Odell, The Amazons and many more."]}, {"page": "Ant Whiting", "response": ["Further releases in 2013 included cuts with Devlin (Island) and Chlöe Howl (Columbia), tracks for Ella Eyre (Virgin), and co-writing with Willy Moon (Island). He also produced the John Newman debut album Tribute, which peaked at No. 1 on the UK album charts. He also worked on the debut by Becky Hill."]}, {"page": "Dan Grech-Marguerat", "response": ["| 2013 || Track \"India\" || Chlöe Howl || Co Produced"]}, {"page": "List of redheads", "response": ["* Chlöe Howl – Singer-songwriter"]}, {"page": "The Halcyon Days Tour", "response": ["* Chlöe Howl"]}, {"page": "Magnetic (disambiguation)", "response": ["*\"Magnetic\", a 2017 song by Chlöe Howl"]}, {"page": "Talk Dirty (Jason Derulo song)", "response": ["In February 2014, American band Set It Off released a cover of \"Talk Dirty\". British singer Chlöe Howl also covered the song at BBC Radio 1's Live Lounge. On March 16, 2014, Lifetime used the song as part of a season 2 promotion campaign for its hit comedy-drama Devious Maids, featuring the cast appearing alongside Derulo, who recreated the song's video and performance.\"Devious Maids\" promotional video from YouTube/Lifetime (posted March 16, 2014) In May 2014, actor Kevin Spacey and late night talk host Jimmy Fallon did an a capella barbershop quartet rendition of the song on The Tonight Show Starring Jimmy Fallon. Saturday Night Live has also done a parody entitled \"Dongs\". Malin Akerman performed the song on episode 7 of Lip Sync Battle, while Jorgie Porter did the same on Lip Sync Battle UK. Indian dance crew Desi Hoppers performed to the song in the Duels round of NBC's World of Dance."]}, {"page": "Glastonbury Festival 2014", "response": ["* Chlöe Howl"]}, {"page": "34th Brit Awards", "response": ["**Chlöe Howl"]}, {"page": "Chloe Howl", "response": ["#REDIRECT Chlöe Howl"]}, {"page": "No Strings (song)", "response": ["\"No Strings\" is a song by the British singer-songwriter Chlöe Howl. It was released on 23 August 2013, through Sony Music Entertainment. The song entered the UK Singles Chart at number 176 on 1 September 2013.Chart Log UK: New Entries Update, Week ending 7 September 2013, zobbel.de, retrieved 10 March 2014 The song has peaked at number 182 on the French Singles Chart. The song was written by Chlöe Howl and Francis White. It was used as part of the Kick-Ass 2 movie soundtrack.Radar Band Of The Week - Chloe Howl, NME, 27 August 2013, retrieved 23 December 2013", "A music video to accompany the release of \"No Strings\" was first released onto YouTube on 16 June 2013 at a total length of three minutes and fifty-six seconds.Chlöe Howl - No Strings (Official Video) - YouTube", "| France (SNEP)Lescharts.com – Chlöe Howl – No Strings (in French). Les classement single.", "| 23 August 2013iTunes - Music - No Strings - EP by Chlöe Howl", "Category:Chlöe Howl songs"]}, {"page": "Rumour (Chloe Howl song)", "response": ["#REDIRECT Chlöe Howl"]}, {"page": "Jim Eliot", "response": ["|Chlöe Howl"]}, {"page": "Kid Astray", "response": ["During the summer of 2014, Kid Astray travelled to Manchester to record their debut album with producer Joe Cross (Chlöe Howl, Hurts). The band released two singles from their recording sessions in Manchester, which both got playlisted on Norwegian P3. \"Back To The Ordinary\" premiered at the popular music blog HillyDilly.com, and \"Still Chasing Nothing\" premiered February 9 at Idolator.com."]}, {"page": "Good Times (Ella Eyre song)", "response": ["\"Good Times\" was written by Ella Eyre, Sigma and Sigala, produced by Sigma and Sigala, vocal produced by Michael Angelo and performed by Eyre. In an interview with The Line of Best Fit, Eyre noted that if the song was a food it would be sushi, and said that she wrote it in 2015 and that it was about herself and her best friend Chlöe Howl, both of whose circumstances had disintegrated and whose company helped each other get through them. It was released as the fourth single from her debut studio album Feline (2015), and was the fourth track on the album. It was released to iTunes on 14 August 2015 backed with \"Fall Down\" and was first performed during her set on Glastonbury on 27 June. It has also been featured on an advertisement for SNOG Pure Frozen Yogurt and Channel 5's 2016 trailer."]}, {"page": "ITunes New Artist Spotlight", "response": ["* Chlöe Howl"]}, {"page": "Emil Nava", "response": ["| Chlöe Howl"]}, {"page": "Brit Award for Rising Star", "response": ["* Chlöe Howl"]}, {"page": "Paper Heart", "response": ["*Paper Heart, a 2013 album by Chlöe Howl"]}, {"page": "Chloe Howl discography", "response": ["#REDIRECT Chlöe Howl#Discography"]}, {"page": "Chlöe Howl discography", "response": ["#REDIRECT Chlöe Howl#Discography"]}, {"page": "Rumour (Chlöe Howl song)", "response": ["#REDIRECT Chlöe Howl"]}, {"page": "Paper Heart (Chlöe Howl song)", "response": ["#REDIRECT Chlöe Howl"]}, {"page": "Rumour (EP)", "response": ["#REDIRECT Chlöe Howl"]}, {"page": "Work (Chlöe Howl EP)", "response": ["#REDIRECT Chlöe Howl"]}, {"page": "No Strings (EP)", "response": ["#REDIRECT Chlöe Howl"]}, {"page": "Millionaire (Chlöe Howl song)", "response": ["#REDIRECT Chlöe Howl"]}]}}