{"wiki_id": "http://www.wikidata.org/entity/Q15482", "itemLabel": "William Jack", "itemDescription": "1795-1822, Scottish botanist", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Jack_(botanist)", "wikipedia_page": {"main": "William Jack FRSE (1795 in Aberdeen – 1822 in Bencoolen, Sumatra) was a noted Scottish botanist and medical practitioner.", "link_mentions": [{"page": "Henry Thomas Colebrooke", "response": ["*  (with William Jack)"]}, {"page": "Jackfruit", "response": ["The common English name \"jackfruit\" was used by physician and naturalist Garcia de Orta in his 1563 book .Oxford English Dictionary, Second Edition, 1989, online edition Centuries later, botanist Ralph Randles Stewart suggested it was named after William Jack (1795–1822), a Scottish botanist who worked for the East India Company in Bengal, Sumatra, and Malaya."]}, {"page": "Rafflesia arnoldii", "response": ["William Jack, Arnold's successor in the Sumatran Bencoolen colony, recollected the plant and was the first to officially describe the new species under the name R. titan in 1820. It is thought quite likely that Jack rushed the name to publication because he feared that the French might publish what they knew of the species, and thus rob the British of potential 'glory'. Apparently aware of Jack's work, Brown finally had the article published in the Transactions of the Linnean Society a year later, formally introducing the name R. arnoldii (he ignores Jack's work in his article)."]}, {"page": "Nepenthes rafflesiana", "response": ["Nepenthes rafflesiana was discovered by Dr. William Jack in 1819. In a letter from Singapore published in Curtis's Botanical Magazine, Jack wrote the following account:"]}, {"page": "William Jack (U.S. politician)", "response": ["William Jack (July 29, 1788 – February 28, 1852) was a Democratic member of the U.S. House of Representatives from Pennsylvania.", "William Jack was born in Greensburg, Pennsylvania.  He studied law, was admitted to the bar and practiced.  He moved to Brookville, Pennsylvania, in 1831 and engaged in mercantile pursuits.  He was the division inspector of militia for Westmoreland and Fayette Counties from 1830 to 1835.  He served as sheriff of Brookville in 1833, and was a contractor and builder in Mississippi and assisted in the construction of a canal there.  He returned to Pennsylvania and served as a county judge of Jefferson County, Pennsylvania, about 1840."]}, {"page": "List of authors of South African botanical taxa", "response": ["*William Jackson Hooker (1785–1865) A, B, M, P, S ........ Hook.", "*William Jack (1795–1822) S ........ Jack"]}, {"page": "Murraya paniculata", "response": ["Orange jasmine was first formally described in 1767 by Carl Linnaeus who gave it the name Chalcas paniculata in Mantissa Plantarum. In 1820, William Jack changed the name to Murraya paniculata in his book Descriptions of Malayan Plants [Malayan Miscellanies]."]}, {"page": "Elaeocarpus ferrugineus", "response": ["Category:Taxa named by William Jack (botanist)"]}, {"page": "Anisophyllea disticha", "response": ["Category:Taxa named by William Jack (botanist)"]}, {"page": "Lasianthus", "response": ["The generic name Lasianthus is derived from the Greek lasios, \"shaggy, velvety, hairy\", and anthos, \"flower\".Umberto Quattrocchi. 2000. CRC World Dictionary of Plant Names volume II. CRC Press: Boca Raton; New York; Washington,DC;, USA. London, UK.  (vol. II). (see External links below). The genus was named by William Jack in 1823.Lasianthus in International Plant Names Index. (see External links below).William Jack. !823. Transactions of the Linnean Society of London 14:125. (See External links below)."]}, {"page": "William Jack", "response": ["William Jack is the name of:", "*William Jack (athlete) (born 1930), British Olympic sprinter ", "*William Jack (Australian explorer) (died 1910), founder of Herberton, Queensland", "*William Jack (Australian politician) (1892–1982)", "*William Jack (botanist) (1795–1822), of Scotland", "*William Jack (mathematician) (1834–1924), from Scotland", "*William Jack (U.S. politician) (1788–1852), member of the U.S. House of Representatives "]}, {"page": "Chresonym", "response": ["Nepenthes rafflesiana, a species of pitcher plant, was described by William Jack in 1835. The name Nepenthes rafflesiana as used by Hugh Low in 1848 is a heterochresonym. Cheek and Jebb (2001) explain the situation thus:"]}, {"page": "Jackia", "response": ["Jackia may refer to any of three genera of plants, all named after William Jack (1795–1822):"]}, {"page": "Rafflesia patma", "response": ["Blume then used this collection to formally describe the plant as a new species in 1825, including it in the strange new genus Rafflesia, which had only been described a few years earlier. Blume apparently only had six works on taxonomy with him in Java to identify plants at the time, including the 1820 work by William Jack in the British Sumatra colony, which included the first published scientific description of a Rafflesia, Rafflesia titan."]}]}}