{"wiki_id": "http://www.wikidata.org/entity/Q15445972", "itemLabel": "Sandu Popescu", "itemDescription": "British physicist", "wikipedia_url": "https://en.wikipedia.org/wiki/Sandu_Popescu", "wikipedia_page": {"main": "Sandu Popescu  (born 1956 in Oradea, Romania) is a Romanian-British physicist working in the foundations of quantum mechanics and quantum information.", "link_mentions": [{"page": "Quantum teleportation", "response": ["One of the first scientific articles to investigate quantum teleportation is \"Teleporting an Unknown Quantum State via Dual Classical and Einstein-Podolsky-Rosen Channels\" published by C. H. Bennett, G. Brassard, C. Crépeau, R. Jozsa, A. Peres, and W. K. Wootters in 1993, in which they used dual communication methods to send/receive quantum information. It was experimentally realized in 1997 by two research groups, led by Sandu Popescu and Anton Zeilinger, respectively.", "First proposed theoretically in 1993, quantum teleportation has since been demonstrated in many different guises. It has been carried out using two-level states of a single photon, a single atom and a trapped ion – among other quantum objects – and also using two photons. In 1997, two groups experimentally achieved quantum teleportation. The first group, led by Sandu Popescu, was based out Italy. An experimental group led by Anton Zeilinger followed a few months later."]}, {"page": "Timeline of quantum computing and communication", "response": ["* Noah Linden and Sandu Popescu proved that the presence of entanglement is a necessary condition for a large class of quantum protocols. This, coupled with Braunstein's result (see 1999 above), called the validity of NMR quantum computation into question."]}, {"page": "Dirac Medal", "response": ["* 2016: Sandu Popescu (University of Bristol)  For his fundamental and influential research into nonlocality and his contribution to the foundations of quantum physics."]}, {"page": "Popescu", "response": ["*Sandu Popescu, Physicist (quantum information)"]}, {"page": "Andreas Winter", "response": ["Winter's research is focused in the field of quantum information theory. Some of his main contributions concern the understanding of quantum communication protocols, the coding theory for quantum channels, and the theory of quantum entanglement. Together with Michał Horodecki and Jonathan Oppenheim, he discovered quantum state-merging and used this primitive to show that quantum information could be negative. Together with Marcin Pawlowski, Tomasz Paterek, Dagomir Kaszlikowski, and Valerio Scarani, he discovered information causality. Together with Runyao Duan and Simone Severini, he introduced a quantum mechanical version of the Lovász number. Together with Sandu Popescu, Noah Linden and Tony Short he proved that local equilibration of large quantum systems is a generic phenomena."]}, {"page": "Clifford Paterson Lecture", "response": ["* 2004 Sandu Popescu on What is quantum non-locality?"]}, {"page": "John Stewart Bell Prize", "response": ["The John Stewart Bell Prize for Research on Fundamental Issues in Quantum Mechanics and their Applications (short form: \"Bell Prize\") was established in 2009, funded and managed by the University of Toronto, Centre for Quantum Information & Quantum Control (CQIQC). It is awarded every odd-numbered year, for significant contributions relating to the foundations of quantum mechanics and to the applications of these principles – this covers, but is not limited to, quantum information theory, quantum computation, quantum foundations, quantum cryptography, and quantum control. The selection committee has included Gilles Brassard, Peter Zoller, Alain Aspect, John Preskill, and Juan Ignacio Cirac Sasturain, in addition to previous winners Sandu Popescu, Michel Devoret, and Nicolas Gisin. ", "* 2011: Sandu Popescu, Professor of Physics at the University of Bristol, UK, for discoveries of stronger-than-quantum no-signaling correlations, and the application of quantum theory to thermodynamics."]}, {"page": "List of fellows of the Royal Society elected in 2017", "response": ["# Sandu Popescu"]}]}}