{"wiki_id": "http://www.wikidata.org/entity/Q15453157", "itemLabel": "Ernest Shand", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Ernest_Shand", "wikipedia_page": {"main": "Ernest Shand (born Ernest William Watson; 31 January 1868 – 29 November 1924) was an English performer and composer for the classical guitar, and a music-hall singer and actor.\n\n", "link_mentions": [{"page": "List of composers for the classical guitar", "response": ["| data-sort-value=\"Shand, Ernest\"| Ernest Shand || align=center | 1868 || align=center | 1924 || align=center | United Kingdom || || "]}, {"page": "Shand", "response": ["* Ernest Shand (1868–1924), Victorian guitarist and composer"]}, {"page": "List of classical guitarists", "response": ["| Ernest Shand || 1868–1924 || United Kingdom"]}, {"page": "Windsor-2 Vermont Representative District, 2002–2012", "response": ["*Ernest Shand,   Democrat"]}, {"page": "C. H. Bovill", "response": ["In the early 1900s while still a civil servant, Bovill began writing song lyrics, collaborating with, among other composers, Ernest Shand and Philip Braham.\"Songs for Low Comedians\", The Era, 7 November 1903, p. 23; and \"New Music\", The Stage, 3 March 1904. p. 9 In 1905 his short play Goodbye, Pierrot was given as a curtain raiser in provincial performances.\"Amusements in Sheffield\", Sheffield Daily Telegraph, 13 June 1905, p. 4; and Theatre listings, Folkestone Express, 1 July 1905, p. 4 In 1907 he and P. G. Wodehouse contributed lyrics for Seymour Hicks's musical The Gay Gordons.\"The Aldwych\", The Stage, 19 September 1907, p. 18 For revues contributed lyrics to George Grossmith Jr.'s Come Inside (1909), and was co-author of Mr Manhattan and Half Past Eight, and was writer of the Theatre Royal, Drury Lane's 1912 pantomime, The Sleeping Beauty."]}, {"page": "Stanley Yates", "response": ["For his thesis at the University of North Texas, he received the Morgan Dissertation Award for Excellence in Music Performance. He is a dedicated performer of contemporary guitar music and has also brought neglected nineteenth-century guitar composers to renewed attention, such as Charles Doisy and Ernest Shand, by publishing modern editions of their works, recording them on CD, and including them in his concert repertoire. His numerous editions and arrangements are published in the Stanley Yates Series by Mel Bay Publications (and with Chanterelle Verlag, ClearNote Music and his own imprint, CGS)."]}]}}