{"wiki_id": "http://www.wikidata.org/entity/Q15462349", "itemLabel": "Gordon Corrigan", "itemDescription": "British military historian", "wikipedia_url": "https://en.wikipedia.org/wiki/Gordon_Corrigan", "wikipedia_page": {"main": "John Gordon Harvey Corrigan MBE, FRAS (born 1942) is a former British soldier and historical writer and broadcaster.\nCorrigan was educated at the Royal School, Armagh, and the Royal Military Academy Sandhurst. He served in the British Army's Royal Gurkha Rifles, mainly in the far east, and reached the rank of major. Between 1980 and 1987 he took a break from military service, joining the  Royal Hong Kong Jockey Club where he was clerk of the course at the Happy Valley Racecourse from 1980 to 1982, and Racing Secretary from 1982 to 1987. Corrigan was awarded the MBE in 1995 His last appointment was commanding the Gurkha Centre in Hampshire.\nFollowing his retirement from the army in 1998, Corrigan became a freelance writer on military history. He also presented television documentaries, made speaking appearances and conducted tours of World War I battlefields. He is an honorary research fellow of the University of Kent, and the University of Birmingham, and a teaching fellow at the Joint Services Command and Staff College. He is also a fellow of the Royal Asiatic Society, a member of the British Commission for Military History and a liveryman of the Worshipful Company of Farriers.\nCorrigan authored  Mud, Blood and Poppycock, one of the more recent histories of the First World War which challenges a number of popular cultural beliefs about that conflict.  Among the targets for his book are the beliefs that British generalship was incompetent, blinkered and reactionary and that the military justice system was unfair. The book received a positive review from historian Gary Sheffield. Corrigan later wrote Blood, Sweat and Arrogance: The Myths of Churchill's War in which he set out to demolish the \"myths of Churchill's War\". This book was criticised in a review by historian Piers Brendon, who wrote:\n\"his tone, occasionally sneering, often patronising and always cocksure, is particularly tiresome in someone so prone to error. He makes the elementary mistake of asserting, for example, that a Russian declaration of war against Japan \"never came\".\nHis 2010 The Second World War: A Military History received critical acclaim. \"[A] highly readable new look at the titanic struggle between nations\" - The Independent. \"An invaluable source of reference [that] should be savoured\" - Daily Express. \"Bold, incisive, and insightful....A first class read\" - Michael Jones, author of 'The Retreat: Hitler's First Defeat'\nHis newest work is about the Hundred Years' War.", "link_mentions": [{"page": "Douglas Haig, 1st Earl Haig", "response": ["After the war Haig was praised by the American General John J. Pershing, who remarked that Haig was \"the man who won the war\".Gordon Corrigan, Mud, Blood and Poppycock, p. 204. He was also publicly lauded as the leader of a victorious army. His funeral in 1928 was a huge state occasion. However, after his death he was increasingly criticised for issuing orders which led to excessive casualties of British troops under his command on the Western Front, earning him the nickname \"Butcher of the Somme\"."]}, {"page": "Albert Jacka", "response": ["Although traditionally the reason Jacka was not awarded a bar to his VC has been ascribed to British snobbery towards a \"rough colonial\", this view has been challenged. Gordon Corrigan, in Blood Mud and Poppycock, points out that  it was Jacka's Australian superiors who chose not to recommend him for the award, and he argues that this may have been due to the fact that the Germans easily infiltrated Jacka's platoon position in broad daylight without being challenged. The sentries were most likely asleep or absent and Jacka should have ensured that they were not; as such it may have been perceived that while Jacka should be commended for his robust action in responding to the situation, he also bore a responsibility for allowing it to happen in the first place."]}, {"page": "Lions led by donkeys", "response": ["Later, Strachan, in reviewing Aspects of the British experience of the First World War edited by Michael Howard, observed that \"In the study of the First World War in particular, the divide between professionals and amateurs has never been firmly fixed\". Strachan points out that revisionists take strong exception to the amateurs, particularly in the media, with whom they disagree, while at the same time Gary Sheffield welcomes to the revisionist cause the work of many \"hobby\"-ists who only later migrated to academic study.Hew Strachan Back to the trenches – Why can't British historians be less insular about the First World War? The Sunday Times November 5, 2008 Gordon Corrigan, for example, did not even consider Clark to be a historian.Corrigan, p. 213. \"Alan Clark was an amusing writer, a brilliant story teller and bon viveur. British political life is the poorer for his passing, but he cannot be described as a historian\". The phrase \"lions led by donkeys\" has been said to have produced a false, or at least very incomplete, picture of generalship in the First World War, giving an impression of Generals as \"château Generals\", living in splendour, indifferent to the sufferings of the men under their command, only interested in cavalry charges and shooting cowards. One historian wrote that \"the idea that they were indifferent to the sufferings of their men is constantly refuted by the facts, and only endures because some commentators wish to perpetuate the myth that these generals, representing the upper classes, did not give a damn what happened to the lower orders\". Some current academic opinion has described this school of thought as \"discredited\".Simpson, Andy, Directing Operations: British Corps Command on the Western Front, p. 181.Sheffield, Gary. The Somme, pp. xiv–xv. Strachan quotes Gavin Stamp, who bemoans \"a new generation of military historians\", who seem as \"callous and jingoistic\" as Haig, while himself referring to the \"ill-informed diatribes of Wolff and Clark\"."]}, {"page": "Corrigan (surname)", "response": ["* Gordon Corrigan (born 1942), British military historian"]}, {"page": "Goodbyeee", "response": ["Some historians of the First World War have taken a different view. William Philpott referred to the series, by name, as \"bathetic\" and felt it part of a \"post-facto generalisation of the nature of their war\" that \"sucked in\" even veterans of the conflict; in other words, the First World War soldier had become a \"victim\" in the public consciousness, a circumstance at odds with the historical record. The impact of Blackadder on the public consciousness was so pervasive that Gordon Corrigan referenced it in his book cover copy when he published Mud, Blood, and Poppycock, which was an attempt to \"dispel various myths\" about the war.google books website  The copy noted that \"Corrigan's brilliant, witty history reveals how out of touch we have become with the soldiers of 1914–18. They simply would not recognize the way their generation is depicted on television...\""]}, {"page": "Fellow of the Royal Asiatic Society of Great Britain and Ireland", "response": ["* Gordon Corrigan"]}, {"page": "Cameron Shute", "response": ["As commander of the Royal Naval Division, Shute had an intense dislike of its unconventional \"nautical\" traditions and made numerous unpopular attempts to stamp them out. He was particularly critical of the poor management of the latrines which could have led to an outbreak of dysentery.Gordon Corrigan Mud, Blood and Poppycock () p87-88 Following a particularly critical inspection of the trenches by Shute, an officer of the division, Sub-Lieutenant A. P. Herbert, who later became a famous humorous writer, legal satirist and Member of Parliament, wrote a popular poem that summed up the feelings of the men of the division:Martin Gilbert, The Somme, Henry Holt, 2006, p218"]}, {"page": "List of alumni of the Royal Military Academy Sandhurst", "response": ["* Gordon Corrigan (Royal Gurkha Rifles)"]}, {"page": "Jack Livesey (impostor)", "response": ["In 2004 Jack Livesey was convicted of benefit fraud for receiving nearly £30,000 in incapacity benefit while he was employed at the Imperial War Museum. He was sentenced to a suspended twelve-month jail term due to his supposed military service, and character references submitted by veterans including Air Commodore Peter Thorne and Major Gordon Corrigan, who knew Livesey and believed him to be a war hero."]}]}}