{"wiki_id": "http://www.wikidata.org/entity/Q15486032", "itemLabel": "Nicky Haslam", "itemDescription": "English interior designer and socialite", "wikipedia_url": "https://en.wikipedia.org/wiki/Nicky_Haslam", "wikipedia_page": {"main": "Nicholas Ponsonby Haslam (born 27 September 1939) is an English interior designer and socialite, and founder of the London-based interior design firm, NH Studio Ltd.", "link_mentions": [{"page": "Interior design", "response": ["Notable interior designers in the world today include Scott Salvator, Troy Adams, Jonathan Adler, Michael S. Smith, Martin Brudnizki, Mary Douglas Drysdale, Kelly Hoppen, Kelly Wearstler, Nina Campbell, David Collins, Nate Berkus, Sandra Espinet, Jo Hamilton and Nicky Haslam."]}, {"page": "Kill, County Kildare", "response": ["Bishopscourt was home to John Ponsonby, speaker of the Irish House of Commons (1753–61), William Ponsonby, leader of the Irish Whigs (1789–1803) and birthplace of his brother George Ponsonby (1755–1817) leader of the Whig Party in the British House of Commons at Westminster (1808–17), his uncle Major-General Sir William Ponsonby (1772–1815) whose inept charge at the Battle of Waterloo resulted in his death at the hands of the Polish Lancers  and was studied as an example of failed battle strategy for generations afterwards, and of his sister Mary Ponsonby, wife of Charles Grey, British Prime Minister from 1830–34, best known as the Earl Grey of the tea brand. Lady Ponsonby was mentioned in the Saul Dibb film, The Duchess. Ponsonby descendants include Sir Alec Douglas-Home (British Prime Minister, 1963–64), Nicky Haslam, and Princess Diana. "]}, {"page": "Candida Lycett Green", "response": ["She was a member of the Performing Rights Society through her writing of lyrics for songs and was a Contributing Editor to Vogue from 1987. She was part of the original team who started Private Eye. Nicky Haslam nominated Lycett Green as the living person he most admired (\"beautiful, brave, strong, clever, loving and loved\").The Guardian; 26 October 2002."]}, {"page": "Sam Hopper", "response": ["#REDIRECT Nicky Haslam"]}, {"page": "Paul Parsons", "response": ["#REDIRECT Nicky Haslam"]}, {"page": "John Beresford Fowler", "response": ["He died of cancer.  He never married.  After his death his home at Odiham was leased by interior designer Nicky Haslam."]}, {"page": "List of Desert Island Discs episodes (2001–2010)", "response": ["|||Nicky Haslam||Legacy by Sybille Bedford||||"]}, {"page": "Douglas Arrowsmith", "response": ["In 2013 Arrowsmith was commissioned by UK celebrity designer Nicky Haslam to direct a series of music videos to support the release of the LP Midnight Matinee, a collection of Haslam's favourite cabaret songs, performed and recorded by Haslam for Cherry Red Records. The videos were designed to capture biographical pieces from Haslam's life and were shot in the UK for the tracks \"Total Control\", \"Illusions\" and \"Real Live Girl\"."]}, {"page": "Hugo Guinness", "response": ["Guinness also contributed to the BBC Storyville documentary Hi Society – The Wonderful World of Nicky Haslam."]}, {"page": "Storyville (TV series)", "response": ["|scope=\"row\" | Hi Society – The Wonderful World of Nicky Haslam", "| Documentary about the British socialite and wit Nicky Haslam."]}, {"page": "Amanda Eliasch", "response": ["In 2013 she contributed to Nicky Haslam's album Midnight Matinee. That year the writer Katie Glass from the Sunday Times said she looked \"like Marilyn Monroe dressed as a gothic Japanese schoolgirl\"."]}, {"page": "Haslam, Nicholas", "response": ["#REDIRECT Nicky Haslam"]}, {"page": "Nicholas Haslam", "response": ["#REDIRECT Nicky Haslam"]}, {"page": "Teddy Millington-Drake", "response": ["Nicky Haslam describes Millington-Drake at this time as \"the prettiest dark-eyed and curl-haired faun, with an enchanting lisp\". Discharged from service and in part inspired by his sister's anecdotes of her travels abroad, Millington-Drake embarked on a painting tour that took him to Lebanon, Iran, Iraq and Syria. He was aided by his father's connections, which meant that diplomats abroad would often be pleased to see him, but he also spent much time alone in hotels or outside painting. Jonathan Hope, who wrote an obituary for Millington-Drake, notes that \"He loved this part of the world: the soukhs, the street life, the sounds and colours, and was dazzled by the power and simplicity of Islamic architecture\"."]}, {"page": "James Ostrer", "response": ["Curator's Choice: James Ostrer's portrait of Nicky Haslam at the National Portrait Gallery, London."]}, {"page": "List of Private Passions episodes (2010–2014)", "response": ["|rowspan=\"8\"|Nicky Haslam"]}]}}