{"wiki_id": "http://www.wikidata.org/entity/Q15487161", "itemLabel": "Isabel Rawsthorne", "itemDescription": "British painter and model", "wikipedia_url": "https://en.wikipedia.org/wiki/Isabel_Nicholas", "wikipedia_page": {"main": "Isabel Rawsthorne (10 July 1912 – 27 January 1992), also known at various times as Isabel Nicholas, Isabel Delmer, and Isabel Lambert, was a British painter, scenery designer and occasional artists' model. During the Second World War she worked in black propaganda. She was part of and flourished in an artistic bohemian society that included Jacob Epstein, Alberto Giacometti and Francis Bacon.\n\n", "link_mentions": [{"page": "Jacob Epstein", "response": ["Despite being married to and continuing to live with Margaret, Epstein had a number of relationships with other women that brought him his five children: Peggy Jean (1918–2010), Theo (1924–1954), Kathleen (1926–2011), Esther (1929–1954) and Jackie (1934–2009). Margaret generally tolerated these relationships – even to the extent of bringing up his first and last children.  In 1921, Epstein began the longest of these relationships, with Kathleen Garman, one of the Garman sisters,Three sisters with a love, and lust, for life , Camden New Journal, 9 September 2004. Retrieved 23 August 2010 mother of his three middle children, which continued until his death. Margaret \"tolerated Epstein's infidelities, allowed his models and lovers to live in the family home and raised Epstein's first child, Peggy Jean, who was the daughter of Meum Lindsell, one of Epstein's previous lovers, and his last, Jackie, whose mother was the painter Isabel Nicholas.Jacobi, Carol. Out of the Cage: The Art of Isabel Rawsthorne, London: The Estate of Francis Bacon Publishing, Feb 2021 Evidently, Margaret's tolerance did not extend to Epstein's relationship with Kathleen Garman, as in 1923 Margaret shot and wounded Kathleen in the shoulder.\""]}, {"page": "Académie de la Grande Chaumière", "response": ["|Maxwell Armfield – Olivia Mary Bryden – John Craxton – Keith Henderson - Vivien John – Jacques Kupfermann - Lowes Dalbiac Luard – Lewis Morley – Isabel Nicholas – Viola Paterson - Basil Rakoczi – Isabel Rawsthorne – Mary Remington – John Walker – Josefina de Vasconcellos"]}]}}