{"wiki_id": "http://www.wikidata.org/entity/Q15431869", "itemLabel": "Jefferson Davis Cohn", "itemDescription": "British American publisher, horse breeder", "wikipedia_url": "https://en.wikipedia.org/wiki/Jefferson_Davis_Cohn", "wikipedia_page": {"main": "Jefferson Davis Cohn (1881–1951) was a British American publisher and horse breeder. He was the godson of Jefferson Davis.In 1914, he bought Teddy from Edmond Blanc for 5,400 francs. Cohn also owned Haras du Bois-Roussel, a breeding farm in Alençon, which he sold to Léon Volterra.\nHe was married firstly to Florence, daughter of the Member of Parliament, financier and swindler Horatio Bottomley, and secondly, in 1921, to Marcelle Chantal.", "link_mentions": [{"page": "Horatio Bottomley", "response": ["In 1880 Bottomley married Eliza Norton, the daughter of a debt collector. Bottomley's biographers have tended to regard this early, unambitious marriage as a mistake on his part; she was not equipped, intellectually or socially, to help him advance in the world. They had a daughter, Florence, who married firstly American millionaire Jefferson Davis Cohn,Dictionary of World Biography: The 20th Century A- GI: Volume VII, ed. Frank N. Magill, Routledge, 1999, p. 382Paris 1918: The War Diary of the British Ambassador, the 17th Earl of Derby, ed. David Dutton, Liverpool University Press, p. 12Symons, p. 114 and secondly successful South African planter Gilbert Moreland. In the year of his marriage, Bottomley left his job to become a full-time shorthand writer for Walpole's, a firm that provided recording and transcription services for the law courts. His competence impressed his employers sufficiently for them, in 1883, to offer him a partnership, and the firm became Walpole and Bottomley.Hyman, pp. 26–27Messinger, p. 203"]}, {"page": "Sir Gallahad", "response": ["Racing at age two in France for his British breeder/owner, Jefferson Davis Cohn, Sir Gallahad earned victory in three of his five starts but was overshadowed by the 1922 Champion colt, Epinard. At age three, he won four races, most notably the French 2,000 Guineas (Poule d'Essai des Poulains). At four, he won three important races in France and in England won the Lincolnshire Handicap. That year, he also went head-to-head with Epinard, winning a 6½ furlong event.", "Sir Gallahad was retired after his four-year-old season to stand at stud at Haras du Bois-Roussel in Alençon. In 1926, owner Jefferson Davis Cohn sold him to an American syndicate made up of Robert A. Fairbairn, William Woodward, Sr., Marshall Field III, and Arthur B. Hancock. In the United States, he was recorded as Sir Gallahad III for registration clarification. Although he was sent to the various breeding farms of his four owners, he stood primarily at Woodward's Belair Stud in Maryland and at Hancock's Claiborne Farm in Kentucky."]}, {"page": "Prix Quincey", "response": ["* Jefferson Davis Cohn – Imaginaire (1919), King Arthur (1926), Lion Hearted (1929), Slipper (1930)"]}, {"page": "Teddy (horse)", "response": ["Teddy was sold to captain Jefferson Davis Cohn, godson of American Civil War Confederate president Jefferson Davis, for 5,400 francs. His racing career was big partly due to World War I, which erupted when he was a yearling.  He was shipped to the San Sebastian racecourse in Spain, where he began to race as a three-year-old, winning 5 of his 7 starts. His record in Spain included a win at his maiden race, the Gran Premio San Sebastian (2400 meters), a win at the \"Spanish St. Leger\" Premio Villamejor (2800 meters), and a third-place finish in the Copa d'Oro del Re (2400 meters). In France, he won the Prix Darbonnay (1700 meters), Prix Darney, and Prix des Trois Ans (2400 meters)—amazingly, within 8 days of each other—and finished third in the Prix d'Elevage. He had one race as a four-year-old, the Prix des Sablonieres (2400 meters), which he won to retire with a record of 6 wins in 8 starts."]}, {"page": "Bull Dog (horse)", "response": ["Bull Dog was by American Jefferson Davis Cohn at his Haras du Bois-Roussel in Alençon in France's Lower Normandy region, and raced for him as a homebred. Bull Dog was sired by Teddy, who had been the Leading sire in France in 1923. His dam was Plucky Liege, one of the most important broodmares of the 20th century. Bull Dog was a full brother to Sir Gallahad, who won the Poule d'Essai des Poulains and became a leading sire in North America. Plucky Liege also produced two other colts, Bois Roussel and Admiral Drake, who went on to sire classic winners in Europe. Plucky Liege was sired by Spearmint, a winner of the two most prestigious races in England and France in 1906, The Derby and the Grand Prix de Paris."]}, {"page": "Bois Roussel", "response": ["He was named for Haras du Bois-Roussel, the breeding farm in Alençon where he was foaled. His breeder was Leon Volterra who acquired his sire, Vatout, and his dam as part of his purchase of Haras du Bois Roussel from American, Jefferson Davis Cohn. According to Thoroughbred Heritage, his dam, Plucky Liege, was one of the most important broodmares of the 20th century. At the time of foaling Bois Roussel Plucky Liege was 23 years old."]}, {"page": "Plucky Liege", "response": ["Plucky Liege was purchased by Jefferson Davis Cohn for whom she had thirteen race starts, winning four two-year-old races for earnings of £1,811.", "In October 1933, Jefferson Davis Cohn sold his racing operations, including Plucky Liege, to Leon Volterra. In 1935, Plucky Liege had reached the mature age of twenty-three when foaling future Epsom Derby winner Bois Roussel. She died in 1937 at age twenty-five."]}, {"page": "Marcelle Chantal", "response": ["Marcelle Chantal (1901–1960) was a French stage and film actress. Chantal appeared in a number of leading roles in films such as Maurice Tourneur's In the Name of the Law (1932). Early in her career she married British banker Jefferson Davis Cohn and was billed as Marcelle Jefferson-Cohn."]}, {"page": "Marguerite (horse)", "response": ["Three of Marguerite's best progeny were sired by Sir Gallahad III, a French-bred stallion that had been bought in 1926 by an American syndicate when standing at stud for owner Jefferson Davis Cohn at his Haras du Bois-Roussel near Alençon in Normandy, France. The syndicate was made up of  Robert A. Fairbairn, William Woodward Sr., Marshall Field III, and Arthur B. Hancock."]}]}}