{"wiki_id": "http://www.wikidata.org/entity/Q15485690", "itemLabel": "Joseph Nightingale", "itemDescription": "British writer and minister", "wikipedia_url": "https://en.wikipedia.org/wiki/Joseph_Nightingale", "wikipedia_page": {"main": "Joseph Nightingale (26 October 1775 – 9 August 1824) was a prolific English writer and preacher. He was particularly noted for his topographic writing and his interest in shorthand.", "link_mentions": [{"page": "1775", "response": ["** Joseph Nightingale, prolific English writer and preacher (d. 1824)"]}, {"page": "Bunhill Fields", "response": ["* Joseph Nightingale (1775–1824), writer and preacher"]}, {"page": "John Benbow", "response": ["Benbow was born the son of William and Martha Benbow. The astrologer John Partridge recorded the exact time and date of his birth as being at noon on 10 March 1653, and this is the date used by the National Museum of the Royal Navy, the Encyclopædia Britannica, and the local historical accounts of Joseph Nightingale published in 1818.Nightingale, pp. 167–175. A biography within an 1819 publication of The Gentleman's Magazine, however, records in a short biography entitled Life and Exploits of Admiral Benbow by D. Parkes that he was born in 1650, as does the 1861 Sea kings and naval heroes by John George Edgar.Edgar, pp. 206–214. Edgar records that Benbow's father died when Benbow was very young, while Parkes' account describes his father as being in the service of the Army under Charles I and not dying until Benbow was in his teens. Encyclopædia Britannica writes that Benbow's father was in fact a tanner. Meanwhile, his uncle, Thomas, was executed by Charles I. Both Parkes and the National Museum of the Royal Navy concur that Benbow was born in Coton Hill in Shrewsbury, Shropshire, and Nightingale asserts that the death of both uncle and father, and the family's association with Charles I in the years following his execution, ensured that the \"family were brought very low.\" Benbow's lack of possessions, Nightingale writes, turned him to a career at sea."]}, {"page": "Atherton, Greater Manchester", "response": ["There were several ministers of note of Chowbent Chapel including James Wood, the \"General\" (1672–1759), who distinguished himself at the Battle of Preston in 1715. Thomas Walker Horsfield (1792–1837) was a historian and topographer. Joseph Nightingale (1775–1824), born in Chowbent, was a prolific English writer and preacher who subsequently became a Unitarian."]}, {"page": "Monthly Repository", "response": ["Contributors included John Bowring, Lant Carpenter, George Dyer, Benjamin Flower, William Frend, Jeremiah Joyce, John Kentish, Harriet Martineau, J.S. Mill, Joseph Nightingale, John Towill Rutt, Emily Taylor, Eliza Flower"]}, {"page": "John Stockdale", "response": ["Stockdale again figured as defendant in an action for libel brought by Joseph Nightingale in 1809, when he had to pay £200 damages. Towards the end of his career he dealt largely in remaindered books from other publishers, and caused some resentment among the regular traders by a series of sales of books by auction which he established in various parts of the country. Early in his enterprise he had acquired considerable property, but afterwards he was less successful and the circumstance of having to make an arrangement with his creditors is said to have caused him some anxiety and accelerated his death."]}, {"page": "Nightingale (surname)", "response": ["* Joseph Nightingale (1775–1824), English writer and preacher"]}, {"page": "The Beauties of England and Wales", "response": ["The Beauties of England and Wales (1801–1815) is a series of books describing the topography and local history of England and Wales. Produced by a variety of London publishers, the work appeared in 18 multi-part volumes arranged by county, individually authored by John Bigland, Edward Wedlake Brayley, J. Norris Brewer, John Britton, John Evans, John Hodgson, Francis Charles Laird, Joseph Nightingale, Thomas Rees, and Frederic Shoberl. Each volume contained engraved illustrations by artists such as Thomas Hearne, J. M. W. Turner, John Varley, Benjamin West. Readers included Charles Dickens."]}, {"page": "Nightingale, Joseph", "response": ["#redirectJoseph Nightingale"]}, {"page": "Reasons for Not Eating Animal Food", "response": ["At 10 x 17 centimeters, Reasons for not eating animal food, or any thing which has enjoyed sensitive life is four pages in total length. It was first published as its own pamphlet by Phillips in 1814. The British Book Trade Index lists John Clifford of Tunbridge Wells as the printer, a trade he had between 1809 and 1843. It was also published in the city of Manchester. It is noted by English writer and preacher Joseph Nightingale with Phillips' work, that \"this benevolent species of abstinence has numerous observers.\""]}]}}