{"wiki_id": "http://www.wikidata.org/entity/Q15430490", "itemLabel": "Margaret Crosland", "itemDescription": "British translator", "wikipedia_url": "https://en.wikipedia.org/wiki/Margaret_Crosland_(writer)", "wikipedia_page": {"main": "Margaret McQueen Crosland (born 17 June 1920) is an English literary biographer and translator. She has also used the pen name  Leonard de Saint-Yves.", "link_mentions": [{"page": "Morganatic marriage", "response": ["Generally, this is a marriage between a man of high birth (such as from a reigning, deposed or mediatised dynasty) and a woman of lesser status (such as a daughter of a low-ranked noble family or a commoner).Webster's Online Dictionary . Retrieved 2008-07-10.Diesbach, Ghislain de. Secrets of the Gotha (translated from the French by Margaret Crosland). Chapman & Hall, Ltd., London, 1967. pp. 18, 25–26, 35, 179–182, 186–187. Usually, neither the bride nor any children of the marriage have a claim on the bridegroom's succession rights, titles, precedence, or entailed property. The children are considered legitimate for all other purposes and the prohibition against bigamy applies.\"Hugh Chisholm, editor. Encyclopædia Britannica Eleventh Edition. Volume 18. Morganatic Marriage. University Press, 1911, p. 835. In some countries, a woman could also marry a man of lower rank morganatically. As a result of the above, a king deciding to enter into a morganatic marriage who does not have children from a previous marriage thereby gives up the chance of being succeeded by his own children and accepts that succession would pass to his other relatives."]}, {"page": "Édith Piaf", "response": ["* Piaf, by Margaret Crosland. New York: G. P. Putnam's Sons, 1985, . A biography."]}, {"page": "Girolamo Crescentini", "response": ["* Barbier, Patrick. The World of the Castrati: The History of an Extraordinary Operatic Phenomenon. Trans. Margaret Crosland. Suffolk: Souvenir Press, 1996."]}, {"page": "Ada Leverson", "response": ["One critic in The Bookman commented on how her lack of characterization distracted the reader from understanding what The Twelfth Hour was about. Dennis Poupard says, \"some have found Leverson's characters merely vehicles for her wit, others believe she conveys accomplished characterization deftly and swiftly in the epigrammatic dialogue\".Poupard, Dennis. \"Ada Leverson (1895–1933)\". Twentieth-Century Literary Criticism. Literary Criticism Online. Accessed 9 June 2014. John Mason Brown recommended that Leverson's work be read by \"those who find laughter no hardship, high comedy a delight, nonsense relaxing, and who are not made uncomfortable by worldlings both comfortable and conscienceless\".Brown, John Mason qtd. in Poupard. \"Ada Leverson (1895–1933)\". Twentieth-Century Literary Criticism. Literary Criticism Online. Accessed 9 June 2014. Margaret Crosland summarized several critics' feelings toward Leverson and reports that she is seen \"as a distant descendant of Jane Austen, sensitive to the hidden motives of behavior, ready to laugh at vanity, understanding of married couples, parents, and children, yet seemingly preoccupied with all that was going on in the world outside\".Debelius, Margaret. \"Countering a Counterparts: Ada Leverson and Oscar Wilde.\" Women and British Aestheticism. The University of Virginia Press (1999)."]}, {"page": "Vladimir Jankélévitch", "response": ["* 1939: Ravel (tr. into German by Willi Reich, Reinbek, Rowohlt, 1958; tr. into English by Margaret Crosland, NY-London, 1959; tr. into Italian by Laura Lovisetti Fua, Milano, Arnoldo Mondadori Editore, 1962)"]}, {"page": "Minou Drouet", "response": ["*Then there was fire translator Margaret Crosland, London : Hamish Hamilton, 1957. ", "* Then there was fire (1957), translated by Margaret Crosland"]}, {"page": "L'Aigle à deux têtes", "response": ["L'Aigle à deux têtes is a French play in three acts by Jean Cocteau, written in 1943 and first performed in 1946.  It is known variously in English as The Eagle with Two Heads,Jean Cocteau. Five Plays: [including \"The Eagle with Two Heads\"]. (New York: Hill and Wang, 1961). The Eagle Has Two Heads,Jean Cocteau. The Eagle Has Two Heads; adapted by Ronald Duncan. (London: Vision Press, 1947). The Two-Headed Eagle,E.g. Margaret Crosland. Jean Cocteau: a biography. (New York: Knopf, 1956) ch.9-10. The Double-Headed Eagle,E.g. Christopher Innes. Holy Theatre: Ritual and the Avant Garde. (Cambridge: Cambridge University Press, 1984) p.8. and Eagle Rampant.Eagle Rampant was the title used in the American preview run of the production starring Tallulah Bankhead in December 1946: theatre programme held at Library of Congress. The title refers to the double-headed eagle of heraldry. Cocteau also directed a film of his play which appeared in 1948."]}, {"page": "The Blood of Others", "response": ["Beauvoir began writing The Blood of Others in 1941,Margaret Crosland, Simone de Beauvoir: The Woman and Her Work (Heinemann, London, 1992) p. 327. and it was 'essentially finished' by May 1943.Deirdre Bair, Simone de Beauvoir: A Biography (Jonathan Cape, London, 1990) p. 277. Beauvoir wrote it in the Café de Flore in Paris, arriving at 8am each morning, because the café was heated while the hotel in which she lived was not.Deirdre Bair, Simone de Beauvoir: A Biography (Jonathan Cape, London, 1990) p. 273. Beauvoir used some of her own experiences for the novel.:The following information is from Margaret Crosland, Simone de Beauvoir: The Woman and Her Work (Heinemann, London, 1992) p. 267, 328. Hélène's fleeing from Paris as the Germans advanced is based on Beauvoir's own actions - in June 1940 she travelled with friends by car to Laval and then by coach to Angers.  Blomart's reaction to the death of the baby son of his family's maid (chapter 1) is based on Beauvoir's own experience of the same as a young woman. The story of Madeleine volunteering to help in the Spanish civil War and injuring her foot by spilling hot water over it is based on a similar event that occurred to writer Simone Weil. According to another source, much of Hélène's behaviour is based on that of Nathalie Sorokine, a pupil and friend of Beauvoir's and to whom The Blood of Others is dedicated.Deirdre Bair, Simone de Beauvoir: A Biography (Jonathan Cape, London, 1990) p. 237.", "According to biographer Deirdre Bair, the novel received a 'barrage of praise that was showered upon it.'  One reviewer wrote that Beauvoir had written 'in an economical, sometimes flat style which conceals a remarkably sustained note of suspense and mounting excitement due to the sheer vitality and force of her ideas. This is perhaps the way a novel of ideas should be presented.' Richard McLaughlin, 'Mouthing Basic Existentialism,' Saturday Review of Literature, July 17, 1948, p. 13, quoted in Deirdre Bair, Simone de Beauvoir: A Biography (Jonathan Cape, London, 1990) p. 306-307. Fifteen years later in 1960, Beauvoir herself was critical of the book, saying that the characters were too thin and the novel too didactic.Margaret Crosland, Simone de Beauvoir: The Woman and Her Work (Heinemann, London, 1992) p. 328."]}, {"page": "Margaret Crosland", "response": ["Margaret Crosland is a Canadian former figure skater from Calgary, Alberta. She is the 1958 and 1959 Canadian national champion. She started skating at age 7, and was coached by the Swiss Olympian Hans Gerschwiler. She represented the Glencoe Club as a junior and the Winnipeg Winter Club as a senior.", "Now known as Margaret Crosland Berezowski, she was featured in a segment profiling Alberta Sports Hall of Fame inductees, where she reflected on her experience.Margaret Crosland Berezowski @YouTube.com Retrieved September 29, 2018."]}, {"page": "L'École des veuves", "response": ["L'École des Veuves (School for Widows) is a 1936 one-act play (or playlet) written by French dramatist Jean Cocteau. He wrote it originally for the actress Arletty.  Cocteau's world: An anthology of writings by Jean Cocteau. Ed. Margaret Crosland. Peter Owen, 1972, p151.  ", "L'École des veuves was not published until 1949 when it appeared Cocteau's Théatre de Poche. It has been translated in English as School for Widows by Margaret Crosland and published in Cocteau's world: An anthology of writings by Jean Cocteau (1972).  Cocteau's world: An anthology of writings by Jean Cocteau. Ed. Margaret Crosland. Peter Owen, 1972, p151.  "]}]}}