{"wiki_id": "http://www.wikidata.org/entity/Q15458660", "itemLabel": "William Linley", "itemDescription": "British composer", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Linley", "wikipedia_page": {"main": "William Linley (1771–1835) was one of seven musical siblings born to Thomas Linley the elder and his wife Mary Johnson.", "link_mentions": [{"page": "All's Well That Ends Well", "response": ["Henry Woodward (1714–1777) popularised the part of Parolles in the era of David Garrick. Sporadic performances followed in the ensuing decades, with an operatic version at Covent Garden in 1832.William Linley's song \"Was this fair face\" was written for All's Well That Ends Well."]}, {"page": "Thomas Lawrence", "response": ["Sometime before his eighteenth birthday in 1787 Lawrence arrived in London, taking lodgings in Leicester Square, near to Joshua Reynolds' studio. He was introduced to Reynolds, who advised him to study nature, rather than the Old Masters. Lawrence set up a studio at 41 Jermyn Street and installed his parents in a house in Greek Street. He exhibited several works in the 1787 Royal Academy exhibition at Somerset House, and enrolled as a student at the Royal Academy but did not stay long, abandoning the drawing of classical statues to concentrate on his portraiture. In the Royal Academy exhibition of 1788 Lawrence was represented by five portraits in pastels and one in oils, a medium he quickly mastered. Between 1787 and his death in 1830 he would miss only two of the annual exhibitions: once, in 1809, in protest about the way his paintings had been displayed and once, in 1819, because he was abroad. In 1789 he exhibited 13 portraits, mostly in oil, including one of William Linley and one of Lady Cremorne, his first attempt at a full-length portrait.Levey 2005: 77–79 The paintings received favourable comments in the press with one critic referring to him as \"the Sir Joshua of futurity not far off\" and, aged just twenty, Lawrence received his first royal commission, a summons arriving from Windsor Palace to paint the portraits of Queen Charlotte and Princess Amelia.Levey 2005: 76–77 The queen found Lawrence presumptuous (although he made a good impression on the princesses and ladies-in-waiting) and she did not like the finished portrait, which remained in Lawrence's studio until his death. When it was exhibited at the Royal Academy in 1790, however, it received critical acclaim.Levey 2005: 85–90 Also shown that year was another of Lawrence's most famous portraits, that of the actress Elizabeth Farren, soon to be the Countess of Derby, \"completely Elizabeth Farren: arch, spirited, elegant and engaging\", according to one newspaper.Levey 2005: 92"]}, {"page": "1800 in literature", "response": ["*William Linley – Forbidden Apartments"]}, {"page": "Dulwich Picture Gallery", "response": ["The gallery attracted donors from its earliest days. In 1835 William Linley (1771–1835) — last of a musical and theatrical family, (many of whom had connections to Dulwich College) and brother-in-law to playwright Richard Brinsley Sheridan — bequeathed his collection of family portraits to the gallery. Among these paintings were works by Thomas Gainsborough, Archer James Oliver, James Lonsdale and Sir Thomas Lawrence."]}, {"page": "Thomas Linley the elder", "response": ["He married Mary Johnson (1729–1820) on 11 May 1752 in Batheaston; Johnson was described by Ozias Humphry, who lodged with the couple for two years from 1762 until 1764, as having musical talents almost on a par with her husband. According to Michael Kelly, when young, Mrs Linley was \"reckoned beautiful\". The couple had 12 children over an 18-year period from 1753 until 1771, but only eight lived beyond infancy or childhood. Seven went on to musical or theatrical careers: Elizabeth Ann Linley (1754–1792), his eldest daughter, wife of Richard Brinsley Sheridan; his eldest son Thomas Linley the younger (1756–1778), composer and noted violinist; Mary Linley (1758–87), who gave up her career as a singer after she married playwright Richard Tickell in 1780; Samuel Linley (1760–1778), second son, singer and oboe player; Maria Linley (1763–84), singer; Ozias Thurston Linley (1765–1831), minor canon at Norwich and organist at Dulwich; and William Linley, (1771–1835), composer of glees, songs and writer. Another child, Jane Nash (1768–1806), sang in an amateur capacity until her marriage. Music historian Charles Burney visited when the children were young and listened to them singing and playing instruments; he described the family as \"a Nest of Nightingales\"."]}, {"page": "List of Old Harrovians", "response": ["*William Linley (1771–1835), English musician and son of Thomas Linley the elder"]}, {"page": "Linley", "response": ["* William Linley (1771–1835), British composer"]}, {"page": "1789 in art", "response": ["** William Linley"]}, {"page": "Shipley Hall", "response": ["Shipley Hall was built in 1700, and by 1722 coal mining was an important activity on the Shipley estate. The Hall became the property of the Miller-Mundy family who in around 1765 started running the mines themselves. The Nutbrook Canal opened in 1796 to serve the Shipley Colliery, and the income led to extensive development of the estate. The Hall was rebuilt in 1799 (the building in the above photo) to the design of William Linley of Doncaster,York through the Eyes of the Artist (York City Art Gallery) 199.) and the grounds were landscaped by William Emes, a follower of Capability Brown."]}, {"page": "Osorio (play)", "response": ["Osorio was Coleridge's second drama, having written The Fall of Robespierre with Robert Southey in 1794. The creation of Osorio was prompted by a letter Coleridge received in February 1797 from W. L. Bowles through which Sheridan asked him \"to write a tragedy on some popular subject\".Mays, p.47 He began writing the work in March in Stowey, and on 6 June Coleridge read the first two and a half acts to William and Dorothy Wordsworth when he visited them at Racedown. Two days later, Coleridge wrote to Joseph Cottle that \"Wordsworth admires my tragedy - which gives me great hopes\".Banerjee, p.122 Coleridge had difficulties completing the work, however, and it was not until October that two copies of the play were prepared and sent to Bowles and William Linley (Sheridan's brother-in-law) for consideration.Mays, p.48"]}, {"page": "Linley, William", "response": ["#redirectWilliam Linley"]}, {"page": "Music in the plays of William Shakespeare", "response": ["The generations after Shakespeare saw many composers create or arrange music for his plays. Among the most notable were Thomas Morley, Henry Purcell, Matthew Locke, Thomas Arne, William Linley, Sir Henry Bishop, and Sir Arthur Sullivan."]}, {"page": "Portrait of William Linley", "response": ["#REDIRECT William Linley"]}]}}