{"wiki_id": "http://www.wikidata.org/entity/Q15428159", "itemLabel": "Selma Vaz Dias", "itemDescription": "British actress, writer, and painter", "wikipedia_url": "https://en.wikipedia.org/wiki/Selma_Vaz_Dias", "wikipedia_page": {"main": "Selma Vaz Dias, also known as Selma Cohen-Vaz Dias (23 November 1911 — 30 August 1977), was a British actress, writer, and painter. Dias was born in Amsterdam to \nJacob Vaz Dias and Hana Hamburger. She had a brother, Salomon. She\nmoved to the United Kingdom, where she spent most of her career.Her cinematic credits include performances in the films of major British directors, including Alfred Hitchcock's The Lady Vanishes (1938) and Michael Powell and Emeric Pressburger's One of Our Aircraft Is Missing (1942). She also appeared in Ernest Morris' The Tell-Tale Heart (1960).\nAuthor Jean Rhys credited Dias with reawakening her literary inclinations. Rhys had disappeared from public view and fallen into obscurity shortly after her novel Good Morning, Midnight was published, in 1939. When Dias adapted the novel for theatrical presentation in 1949, Rhys said that Dias had \"lifted the numb hopeless feeling that stopped me writing for so long\". In 1957, Dias's radio adaptation of Good Morning, Midnight was broadcast by the BBC.She played Solange in the two British premières (the first, given in French, the second, in English) of Jean Genet's The Maids, both of which were directed by Peter Zadek, in 1952 and 1956 respectively. She also played the lead role, Irma (a brothel madam), in the world première of Genet's The Balcony, which opened on 22 April 1957, in a production directed by Zadek at the Arts Theatre Club, a \"private theatre club\" that enabled the production to circumvent the Lord Chamberlain's ban on public performances of the play.Dias died in London on 30 August 1977. She was survived by her husband, the journalist Hans Werner Egli, with whom she had a son and daughter.", "link_mentions": [{"page": "Jean Rhys", "response": ["After a long absence from the public eye, she was rediscovered by Selma Vaz Dias, who in 1949, placed an advertisement in the New Statesman asking about her whereabouts, with a view to obtaining the rights to adapt her novel Good Morning, Midnight for radio. Rhys responded, and thereafter developed a long-lasting and collaborative friendship with Vaz Dias, who encouraged her to start writing again. This encouragement ultimately led to the publication in 1966 of her critically acclaimed novel Wide Sargasso Sea. She intended it as an account of the woman whom Rochester married and kept in his attic in Jane Eyre. Begun well before she settled in Bude, the book won the notable WH Smith Literary Award in 1967. She returned to themes of dominance and dependence, especially in marriage, depicting the mutually painful relationship between a privileged English man and a Creole woman from Dominica made powerless on being duped and coerced by him and others. Both the man and the woman enter marriage under mistaken assumptions about the other partner. Her female lead marries Mr. Rochester and deteriorates in England as the \"madwoman in the attic\". Rhys portrays this woman from a quite different perspective from the one in Jane Eyre. Diana Athill of André Deutsch gambled on publishing Wide Sargasso Sea. She and the writer Francis Wyndham helped to revive interest in Rhys's work.Preliminary page in Jean Rhys, Quartet, Penguin: 2000,  There have been film, operatic and radio adaptations of the book.Brian Kellow,\"On the Beat: A novel that sings: Jean Rhys's Wide Sargasso Sea\", Opera News, December 2012 — Vol. 77, No. 6.\"Jean Rhys – Wide Sargasso Sea\", RadioListings.\"Jean Rhys – Wide Sargasso Sea\", BBC Radio 4 Extra. "]}, {"page": "Wide Sargasso Sea", "response": ["Rhys' editor Diana Athill discusses the events surrounding the publication of the book in her memoir. The book came out of a friendship between Rhys and Selma Vaz Dias who encouraged her to start writing again. At the time, Rhys was living in a shack made of corrugated iron and tar paper in a slum neighborhood of Cheriton Fitzpaine. The book was virtually completed in November 1964 when Rhys, who was 74 years old and complained of the cold and rain in her shack, suffered a heart attack. Athill cared for Rhys in the hospital for two years, keeping a promise not to publish the book until Rhys was well enough to compile the manuscript and add a few final lines. The income from the book provided enough money for Rhys to improve her living conditions."]}, {"page": "The Maids", "response": ["In Britain, the play was first presented in French by the Institute of Contemporary Arts, initially at the Mercury Theatre, Notting Hill Gate, London, in 1952. Peter Zadek directed, while Eduardo Paolozzi provided the scenic design. Selma Vaz Dias played Solange, Olive Gregg played Claire, and Oriel Ross played Madame. The production subsequently transferred to the Royal Court Theatre, where Betty Stockfeld played Madame and David de Bethel provided the scenic design. Zadek also directed the play's first production in Britain in English, which opened on 5 June 1956 at the New Lindsey Theatre Club. Selma Vaz Dias again played Solange and Betty Stockfeld played Madame, while Hazel Penwarden played Claire."]}, {"page": "One of Our Aircraft Is Missing", "response": ["* Selma Vaz Dias as Burgomaster's wife (as Selma Van Dias)"]}, {"page": "The Adventure of the Three Gables", "response": ["A radio adaptation of the story aired in 1964 on the BBC Light Programme, as part of the 1952–1969 radio series starring Carleton Hobbs as Holmes and Norman Shelley as Watson. It was adapted by Michael Hardwick. The cast included Frank Singuineau as Steve Dixie and Selma Vaz Dias as Isadora Klein."]}, {"page": "The Balcony", "response": ["In a note of 1962, Genet writes that: \"In London, at the Arts Theatre, I saw for myself that The Balcony was badly acted. It was equally badly acted in New York, Berlin and Paris – so I was told.\"Genet (1962, xi). The play received its world première in London on 22 April 1957, in a production directed by Peter Zadek at the Arts Theatre Club, a \"private theatre club\" that enabled the production to circumvent the Lord Chamberlain's ban on public performances of the play (though the censor still insisted that what he considered to be blasphemous references to Christ, the Virgin, the Immaculate Conception and Saint Theresa be cut, along with the failed revolutionary Roger's castration near the end of the play).Dichy (1993, xxiv) and White (1993, 481). It featured Selma Vaz Dias as Irma and Hazel Penwarden as Chantal.Styan (1981, 149). Genet himself participated in the theatrics during the opening-night performance when he accused Zadek of the \"attempted murder\" of his play and attempted to obstruct the performance physically, but police officers prevented him from entering the theatre.Dichy (1993, xxiv). Genet objected to what he called its \"Folies Bergère\"-style mise en scène. The production was well-received for the most part. Two years later in 1959 the play was produced at the Schlosspark-Theater in Berlin under the direction of Hans Lietzau. This production utilised a colour TV set for Irma's surveillance and switchboard machine."]}, {"page": "The Lady Vanishes", "response": ["* Selma Vaz Dias as Signora Doppo"]}, {"page": "Good Morning, Midnight (Rhys novel)", "response": ["Good Morning, Midnight is a 1939 modernist novel by the author Jean Rhys. Often considered a continuation of Rhys' three other early novels, Quartet (1928), After Leaving Mr. Mackenzie (1931) and Voyage in the Dark (1934), it is experimental in design and deals with a woman's feelings of vulnerability, depression, loneliness and desperation during the years between the two World Wars. The book initially sold poorly—critics thought it well written, but too depressing—and after its publication Rhys spent a decade living in obscurity. It was not until it was adapted by Selma Vaz Dias into a radio play, first broadcast by the BBC in 1957, that Rhys was once again put into the spotlight.", "Rhys had disappeared from public view and fallen into obscurity shortly after Good Morning, Midnight was published in 1939. In fact, many believed that she was dead as a result of the seeming end of her literary career.Lindfords (1992), p. 269 When Selma Vaz Dias adapted the novel for theatrical presentation in 1949, her husband had to place advertisements in the New Statesman and the Nation to find Rhys in order to gain her permission, which she gave enthusiastically. Rhys credited Dias with reawakening her literary inclinations, stating in November of that same year that Dias had \"lifted the numb hopeless feeling that stopped me writing for so long\". In 1957, Dias's adaptation of Good Morning, Midnight was performed on BBC radio.Lindfords (1992), p. 270"]}, {"page": "The Flanagan Boy", "response": ["* Selma Vaz Dias as Mrs. Corelli, Vecchi's sister"]}, {"page": "The Singer Not the Song", "response": ["*Selma Vaz Dias as Chela"]}, {"page": "Cat Girl", "response": ["* Selma Vaz Dias as Nurse"]}, {"page": "Olga Edwardes", "response": ["| colspan=2                  | Selma Vaz Dias"]}, {"page": "Jean Rhys: Letters 1931-1966", "response": ["* Selma Vaz Dias", "Selma Vaz Dias was an actress who placed a notice in the New Statesman in 1949, during Rhys's period of obscurity, enquiring about her whereabouts (seeking permission to dramatize her 1939 novel Good Morning, Midnight)."]}, {"page": "Triton (1961 TV series)", "response": ["* Selma Vaz Dias as Madame Victor"]}]}}