{"wiki_id": "http://www.wikidata.org/entity/Q15441011", "itemLabel": "Hugh McDermott", "itemDescription": "British actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Hugh_McDermott_(actor)", "wikipedia_page": {"main": "Hugh Patrick McDermott (20 March 1906 – 29 January 1972) was a British professional golfer turned actor who made a number of film, stage and television performances between 1936 and 1972.", "link_mentions": [{"page": "Devil Girl from Mars", "response": ["Devil Girl from Mars is a 1954 UK black-and-white science fiction film, produced by the Danziger Brothers, directed by David MacDonald and starring  Patricia Laffan, Hugh McDermott, Hazel Court, Peter Reynolds, and Adrienne Corri. The film was released by British Lion.Warren 1982", "* Hugh McDermott as Michael Carter"]}, {"page": "First Men in the Moon (1964 film)", "response": ["* Hugh McDermott as Richard Challis, UN Space Agency"]}, {"page": "\"Pimpernel\" Smith", "response": ["*Hugh McDermott as David Maxwell"]}, {"page": "Malaga (1954 film)", "response": ["* Hugh McDermott as Richard Farrell "]}, {"page": "Lawman (film)", "response": ["* Hugh McDermott as L.G. Moss"]}, {"page": "Hey! Hey! USA", "response": ["* Hugh McDermott  (Uncredited)"]}, {"page": "Where's That Fire?", "response": ["*Hugh McDermott as Jim Baker"]}, {"page": "List of Western films of the 1970s", "response": ["|Captain Apache || Alexander Singer || Lee Van Cleef, Carroll Baker, Stuart Whitman, Percy Herbert, Elisa Montes, Charly Bravo, Charles Stal Maker, Tony Vogel, Faith Clift, Dee Pollock, Dan van Husen, Hugh McDermott, Elsa Zabala || United KingdomSpain || Euro-Western", "|Lawman || Michael Winner || Burt Lancaster, Robert Ryan, Lee J. Cobb, Robert Duvall, Sheree North, Albert Salmi, J. D. Cannon, Joseph Wiseman, Richard Jordan, John McGiver, Ralph Waite, John Beck, William C. Watson, Walter Brooke, Robert Emhardt, Richard Bull, John Hillerman, Hugh McDermott || United States || traditional Western"]}, {"page": "List of science fiction films of the 1950s", "response": ["|Devil Girl from Mars||David MacDonald||Patricia Laffan, Hugh McDermott, Adrienne Corri||United Kingdom||"]}, {"page": "List of British films of 1950", "response": ["|Lilli Marlene||Arthur Crabtree||Hugh McDermott, Lisa Daniely||Drama||"]}, {"page": "List of British films of 1951", "response": ["|Four Days||John Guillermin|| Hugh McDermott, Kathleen Byron ||Drama||"]}, {"page": "List of British films of 1953", "response": ["|The Wedding of Lilli Marlene||Arthur Crabtree||Lisa Daniely, Hugh McDermott || Drama||"]}, {"page": "List of British films of 1954", "response": ["|Devil Girl from Mars||David MacDonald ||Patricia Laffan, Hugh McDermott ||Sci-fi ||", "|Johnny on the Spot||Maclean Rogers||Hugh McDermott, Elspet Gray||Crime|| "]}, {"page": "List of British films of 1957", "response": ["|You Pay Your Money||Maclean Rogers||Hugh McDermott, Jane Hylton||Crime||"]}, {"page": "List of British films of 1964", "response": ["|Delayed Flight||Michael Luckwell, Anthony Young||Helen Cherry, Hugh McDermott||Thriller|| "]}, {"page": "Night People (1954 film)", "response": ["* Hugh McDermott as  Maj. Burns"]}, {"page": "Chato's Land", "response": ["* Hugh McDermott as Bartender"]}, {"page": "The Love Lottery", "response": ["* Hugh McDermott as Rodney Wheeler "]}, {"page": "The Huggetts Abroad", "response": ["* Hugh McDermott as Bob McCoy "]}, {"page": "No Orchids for Miss Blandish (film)", "response": ["No Orchids for Miss Blandish (US re-release title Black Dice) is a 1948 British gangster film adapted and directed by St. John Legh Clowes from the 1939 novel of the same name by James Hadley Chase.\"Variety\"  film review; 21 April 1948 It stars Jack La Rue, Hugh McDermott, and Linden Travers (reprising her title role from the West End play by Chase and Robert Nesbitt), with unbilled early appearances from Sid James, as a barman,Cliff Goodwin, Sid James: A Biography. Random House, 2011 , (p. 67-68). and Walter Gotell, as a nightclub doorman. Due to the film's strong violence and sexual content for its time, amongst other reasons, several critics have called it one of the worst films ever made.", "* Hugh McDermott as Dave Fenner "]}, {"page": "Good-Time Girl", "response": ["* Hugh McDermott as Al Schwartz "]}, {"page": "The Man Who Wouldn't Talk (1958 film)", "response": ["* Hugh McDermott as Bernie  "]}, {"page": "For Freedom (1940 film)", "response": ["* Hugh McDermott as Sam"]}, {"page": "The Adding Machine (film)", "response": ["* Hugh McDermott as Harry"]}, {"page": "Relative Values (play)", "response": ["*Don Lucas – Hugh McDermott"]}, {"page": "The Rat Catchers", "response": ["An American spy as a hostage held by an enemy agent as brilliant as the Brigadier. Hurst and Smith must follow strict orders to prevent the worst happening. Also stars Cyril Shaps, Hugh McDermott, Toke Townley and Bill Hutchinson."]}, {"page": "Lilli Marlene (film)", "response": ["Lilli Marlene is a 1950 British war film aimed for the US market and directed by Arthur Crabtree. It stars Lisa Daniely, Hugh McDermott, and Richard Murdoch. Stanley Baker is seen in one of his early support roles.", "* Hugh McDermott as Steve"]}, {"page": "David Livingstone (film)", "response": ["* Hugh McDermott as H.M. Stanley"]}, {"page": "Two on the Tiles", "response": ["Two on the Tiles is a 1951 British comedy film directed by John Guillermin and starring Herbert Lom, Hugh McDermott and Brenda Bruce. It was made at the Walton Studios by the independent Vandyke Productions for release as a second feature. It was one of three back-to-back productions Guillermin directed for the company at Walton Studios, along with Smart Alec and Four Days,.Chibnall & McFarlane p.122-23 It was released in the U.S. as School for Brides."]}, {"page": "Four Days (film)", "response": ["Businessman Francis Templar (Hugh McDermott) suspects his neglected wife Lucienne (Kathleen Byron) of having an affair with his business partner's son Johnny (Peter Reynolds). When the two of them confess, Templar refuses to give his wife a divorce and she retaliates by trying to poison him. Johnny however, intervenes, and manages to prevent the murder. During the next few days, Lucienne comes to realise she loves her husband after all; but Templar, believing his wife is about to leave him, attempts suicide by jumping off a cliff. He survives the fall, but loses all memory of the previous four days. Now an amnesiac, Templar is blissfully in love with his devoted wife. However, she fears their happiness is only temporary, and dreads the return of her husband's memory. To make matters worse, Johnny then reappears to blackmail Lucienne, threatening to reveal all to her husband."]}, {"page": "The Captain's Table (1936 film)", "response": ["* Hugh McDermott - Inspector Mooney"]}, {"page": "As Long as They're Happy", "response": ["* Hugh McDermott as Barnaby Brady "]}, {"page": "List of Royal Variety Performances", "response": ["| Tommy Trinder, Latona, Graham and Chandel, The Victoria Palace Boys and Girls, Dave King and Julia Channing, The Crazy Gang, Ruby Murray, Benny Hill with Olivia Dale, Jeremy Hawk and Ronnie Brody, Patricia Kirkwood with Robert Beatty, Douglas Byng, George Carden, Walter Crisham, John Gregson, Bobby Howes, Hugh McDermott, Terence Morgan and Brian Reece, Cyril Stapleton with the BBC Show Band and The Stargazers, Lena Horne, John Warner, Eleanor Drew, Dorothy Reynolds, Newton Blick, Yvonne Coulette, James Cairncross, Michael Meacham, Christine Finn, Michael Aldridge, Pat Heywood, Joseph Greig, Bob Harris, Johnnie Ray, Robert Dhery, Colette Brosset, Jacques Legras, Christian Duvalein, Pierre Olaf and Company, Alfred Drake, George Jessel, Doretta Morrow and Company, Leslie Henson, Jimmy Edwards, Richard Attenborough, Diana Dors, Edmund Willard, Bruce Seton, Emrys Jones, Lupino Lane, The Chinese Classical Theatre Company, Moscow State Folk Dance Company. Channing Pollock"]}, {"page": "List of acts that have appeared on the Royal Variety Performance", "response": ["*Hugh McDermott: 1955 (London)"]}, {"page": "Trent's Last Case (1952 film)", "response": ["* Hugh McDermott – Calvin C. Bunner"]}, {"page": "Spring Meeting", "response": ["* Hugh McDermott as Michael Byrne"]}, {"page": "The File of the Golden Goose", "response": ["* Hugh McDermott - Ray Moss"]}, {"page": "The Wedding of Lilli Marlene", "response": ["The Wedding of Lilli Marlene is a 1953 British drama film directed by Arthur Crabtree and starring Lisa Daniely, Hugh McDermott and Sid James. It was made at Southall Studios, as a sequel to the 1950 film Lilli Marlene.", "* Hugh McDermott - Steve Moray, Lilli's fiance"]}, {"page": "This Man Is Mine (1946 film)", "response": ["* Hugh McDermott as Bill Mackenzie"]}, {"page": "Guns in the Heather", "response": ["*Hugh McDermott as Carleton"]}]}}