{"wiki_id": "http://www.wikidata.org/entity/Q15488783", "itemLabel": "James Barr", "itemDescription": "British politician, pacifist and socialist", "wikipedia_url": "https://en.wikipedia.org/wiki/James_Barr_(politician)", "wikipedia_page": {"main": "Reverend James Barr (26 July 1862 – 1949) was a Scottish minister and a British Liberal then Labour politician and a noted pacifist and socialist. He was also a strong supporter of home rule for Scotland, a minimum wage and the Temperance movement.", "link_mentions": [{"page": "Robert McIntyre (politician)", "response": ["On 13 April 1945, shortly before the end of World War II, McIntyre won the Motherwell by-election, with a narrow majority of 617 votes over his Labour opponent. He made history as the first SNP candidate to be elected as a Member of Parliament. Upon arriving at Parliament, he had difficulty finding the customary two sponsors to allow him to take his seat, as members did not want to break party loyalties. Two reluctant sponsors were found but McIntyre chose to present himself to the Speaker alone, later writing \"I very clearly stated to the people of Motherwell and Wishaw that I would give no allegiance to the London-controlled parties\". A vote to waive the rule was lost, and eventually he accepted the sponsorship of James Barr and Alexander Sloan \"under protest\"."]}, {"page": "Parliamentary Labour Party", "response": ["** James Barr (1930–31) – Liaison Committee"]}, {"page": "United Free Church of Scotland", "response": ["Voluntaryism led some to oppose the union (the United Free Church Association, led by James Barr – minister of Govan and Labour MP for Motherwell). When it came, 13,000 UFC members remained outside, calling themselves the United Free Church (Continuing). The phrase 'continuing' was used for five years to avoid confusion between the remaining United Free Church and the pre-union Church. It was dropped from the title in 1934. An agreement between the parties avoided the property disputes of the 1900 union. UFC members increased slightly during the 1930s, to a peak of 23, 000 by 1939, but it never regained anywhere near the numbers it had had prior to the union with the Church of Scotland.", "*James Barr (1929)"]}, {"page": "List of MPs elected in the 1924 United Kingdom general election", "response": ["|James Barr"]}, {"page": "Fenwick, East Ayrshire", "response": ["*Rev James Barr leader of the United Free Church Continuing and politician"]}, {"page": "Coatbridge (UK Parliament constituency)", "response": ["| James Barr"]}, {"page": "Motherwell (UK Parliament constituency)", "response": ["| 1924 ||  James Barr || Labour"]}, {"page": "List of MPs elected in the 1935 United Kingdom general election", "response": ["|James Barr"]}, {"page": "List of Labour Party (UK) MPs", "response": ["*James Barr, Motherwell, 1924–31; Coatbridge, 1935–45"]}, {"page": "List of MPs elected in the 1929 United Kingdom general election", "response": ["|James Barr"]}, {"page": "Kilmarnock Academy", "response": ["* Rev. James Barr, Labour MP from 1935 to 1945 for Coatbridge, and from 1924 to 1931 for Motherwell"]}, {"page": "James Barr (biblical scholar)", "response": ["James Barr  (30 March 1924 – 14 October 2006) was a liberal Scottish Old Testament scholar, known for his contribution on how vocabulary and structure of the Hebrew language may reflect a particular theological mindset. At the University of Oxford, he was the Oriel Professor of the Interpretation of Holy Scripture from 1976 to 1978, and the Regius Professor of Hebrew from 1978 to 1989.", "Born in Glasgow, Scotland (although one obituary claims he was born in Edinburgh on 20 March 1924),Bartsad, Hans (11 November 2006) The Rev Professor James Barr, Semitist whose technical approach to the Hebrew Bible changed the methods of biblical exegesis The Independent. Retrieved 23 September 2014, educated at Daniel Stewart's college in Edinburgh and the University of Edinburgh, Barr was ordained to the ministry of the Church of Scotland in 1951.Williamson, HGM (8 November 2006) James Barr, Radical academic whose incisive critiques challenged the orthodoxies of biblical theology The Guardian. Retrieved 23 September 2014 He held professorships in New College in the University of Edinburgh, University of Manchester, in Princeton Theological Seminary and at Vanderbilt University in the United States. He was Oriel Professor of the Interpretation of Holy Scripture at Oxford from 1976 to 1978 and Regius Professor of Hebrew from 1978 to 1989.", "Barr married Jane Hepburn in 1950 and had two sons and a daughter. He was the grandson of the minister and politician James Barr. He died in Claremont, California, on 14 October 2006, aged 82.", "*2013: Bible and Interpretation: The Collected Essays of James Barr, Volumes I-III. Oxford University Press, "]}, {"page": "James Barr", "response": ["James Barr may refer to:", "* James Barr (moderator) (1789-1861) Moderator of the General Assembly of the Church of Scotland in 1853", "*James Barr (author) (born 1976), British author who writes mainly on the Middle East", "*James Barr (biblical scholar) (1924–2006), British Old Testament scholar and philologist", "*James Barr (composer) (1779–1860), Scottish composer; composed the tune which inspired that which is now used for \"Waltzing Matilda\"", "*James Barr (physician) (1849–1938), Irish physician", "*James Barr (politician) (1862–1949), British Labour Party politician; MP for Motherwell, 1924–1931; Coatbridge, 1935–1945", "*James Barr (presenter), British radio and television presenter, LGBT+ activist, creator of podcast A Gay and a NonGay", "*Anthony James Barr (born 1940), also known as Jim Barr, American software engineer", "* James Barr Ames (1846–1910), American law educator", "* James Fugaté (1922–1995), American author who used the pseudonym James Barr"]}, {"page": "United Kingdom general election records", "response": ["*James Barr was 73 when he returned to the house in 1935 as MP for Coatbridge, after four years' absence. He was previously MP for Motherwell 1924–31."]}, {"page": "1933 Kilmarnock by-election", "response": ["The Labour Party candidate in Kilmarnock was Rev James Barr, hoping to regain the seat which Labour had won in 1929."]}, {"page": "List of people associated with the campaign for Scottish devolution", "response": ["* James Barr"]}, {"page": "Jimmy Reid Foundation", "response": ["In August 2013, the Jimmy Reid Foundation led calls for a memorial to be erected in honour of those who opposed the outbreak of World War I. Its \"alternative World War One Commemoration Committee\" identified John Wheatley, John Maclean, Mary Barbour, Helen Crawfurd, Jimmy Maxton, Agnes Dollan, Willie Gallacher, Rev James Barr, and Keir Hardie in its list of prominent opponents of the war."]}, {"page": "Elizabeth Barr", "response": ["Barr was born in Dennistoun in Glasgow in 1905. Her parents were Elizabeth (born Brown) and James Barr. Her father was a minister who would lead the United Free Church of Scotland and become a member of parliament. During the first world war, her parents took in a refugee Belgian family. Barr became friends with them and this friendship continued all her life. She attended Bellahouston Academy and then was a model student at Glasgow University where she was a keen member of the Student Christian Movement. She won academic prizes culminating in a first class masters degree in 1925."]}]}}