{"wiki_id": "http://www.wikidata.org/entity/Q15485635", "itemLabel": "Peter Carruthers", "itemDescription": "American philosopher", "wikipedia_url": "https://en.wikipedia.org/wiki/Peter_Carruthers_(philosopher)", "wikipedia_page": {"main": "Peter Carruthers (; born 16 June 1952) is a British-American philosopher and cognitive scientist working primarily in the area of philosophy of mind, though he has also made contributions to philosophy of language and ethics. He is a Professor of Philosophy at the University of Maryland, College Park, an associate member of Neuroscience and Cognitive Science Program, and a member of the Committee for Philosophy and the Sciences.", "link_mentions": [{"page": "Consciousness", "response": ["As noted earlier, even among writers who consider consciousness to be a well-defined thing, there is widespread dispute about which animals other than humans can be said to possess it. Edelman has described this distinction as that of humans possessing higher-order consciousness while sharing the trait of primary consciousness with non-human animals (see previous paragraph). Thus, any examination of the evolution of consciousness is faced with great difficulties.  Nevertheless, some writers have argued that consciousness can be viewed from the standpoint of  evolutionary biology as an adaptation in the sense of a trait that increases fitness.  In his article \"Evolution of consciousness\", John Eccles argued that special anatomical and physical properties of the mammalian cerebral cortex gave rise to consciousness (\"[a] psychon ... linked to [a] dendron through quantum physics\").  Bernard Baars proposed that once in place, this \"recursive\" circuitry may have provided a basis for the subsequent development of many of the functions that consciousness facilitates in higher organisms. Peter Carruthers has put forth one such potential adaptive advantage gained by conscious creatures by suggesting that consciousness allows an individual to make distinctions between appearance and reality. This ability would enable a creature to recognize the likelihood that their perceptions are deceiving them (e.g. that water in the distance may be a mirage) and behave accordingly, and it could also facilitate the manipulation of others by recognizing how things appear to them for both cooperative and devious ends."]}, {"page": "Rationalism", "response": ["Some philosophers, such as John Locke (who is considered one of the most influential thinkers of the Enlightenment and an empiricist) argue that the Innate Knowledge thesis and the Innate Concept thesis are the same.Locke, Concerning Human Understanding, Book I, Ch. III, par. 20 Other philosophers, such as Peter Carruthers, argue that the two theses are distinct from one another. As with the other theses covered under the umbrella of rationalism, the more types and greater number of concepts a philosopher claims to be innate, the more controversial and radical their position; \"the more a concept seems removed from experience and the mental operations we can perform on experience the more plausibly it may be claimed to be innate. Since we do not experience perfect triangles but do experience pains, our concept of the former is a more promising candidate for being innate than our concept of the latter."]}, {"page": "Philosophy of psychology", "response": ["*George Botterill, Peter Carruthers. 1999. The Philosophy of Psychology. Cambridge University Press. , 9780521559157."]}, {"page": "Michael Dummett", "response": ["During his career at Oxford, Dummett supervised many philosophers who went on to distinguished careers, including Peter Carruthers, Adrian Moore, Ian Rumfitt, and Crispin Wright."]}, {"page": "Index of philosophy articles (I–Q)", "response": ["* Peter Carruthers (philosopher)"]}, {"page": "Modularity of mind", "response": ["* Peter Carruthers (philosopher)"]}, {"page": "Theory of mind", "response": ["Different theories have sought to explain these patterns of results. The idea that theory of mind is automatic is attractive because it would help explain how people keep up with the theory of mind demands of competitive games and fast-moving conversations. It might also explain evidence that human infants and some non-human species sometimes appear capable of theory of mind, despite their limited resources for memory and cognitive control. The idea that theory of mind is effortful and not automatic is attractive because it feels effortful to decide whether a defendant is guilty or innocent, or whether a negotiator is bluffing, and economy of effort would help explain why people sometimes neglect to use their theory of mind. Ian Apperly and Stephen Butterfill have suggested that people do in fact have \"two systems\" for theory of mind, in common with \"two systems\" accounts in many other areas of psychology. On this account, \"system 1\" is cognitively efficient and enables theory of mind for a limited but useful set of circumstances. \"System 2\" is cognitively effortful, but enables much more flexible theory of mind abilities. This account has been criticised by philosopher, Peter Carruthers who suggests that the same core theory of mind abilities can be used in both simple and complex ways. The account has been criticised by Celia Heyes who suggests that \"system 1\" theory of mind abilities do not require representation of mental states of other people, and so are better thought of as \"sub-mentalising\"."]}, {"page": "Hard problem of consciousness", "response": ["A notable family of strong reductionist accounts are the higher-order theories of consciousness. In 2005, the philosopher Peter Carruthers wrote about \"recognitional concepts of experience,\" that is, \"a capacity to recognize [a] type of experience when it occurs in one's own mental life,\" and suggested that such a capacity could explain phenomenal consciousness without positing qualia. On the higher-order view, since consciousness is a representation, and representation is fully functionally analyzable, there is no hard problem of consciousness."]}]}}