{"wiki_id": "http://www.wikidata.org/entity/Q15461487", "itemLabel": "Marion Foale", "itemDescription": "British fashion designer", "wikipedia_url": "https://en.wikipedia.org/wiki/Marion_Foale", "wikipedia_page": {"main": "Marion A Foale (born 13 March 1939 in Edmonton, London) is an English artist and fashion designer. With Sally Tuffin, she formed one half of the design team behind the 1960s fashion label Foale and Tuffin.\nBorn in London, Foale attended Ilford County High School for Girls, where she entered (and won) several painting contests. After school, she attended Walthamstow College of Art. Two years later, she realized that her love of art would never translate into a career that would sustain her, and decided to attend fashion school.", "link_mentions": [{"page": "Carnaby Street", "response": ["By the 1960s, Carnaby Street was popular with followers of the mod and hippie styles. Many independent fashion designers, such as Mary Quant, Marion Foale and Sally Tuffin, Lord John, Merc, Take Six, and Irvine Sellars, had premises in the street, and various underground music bars, such as the Roaring Twenties, opened in the surrounding streets. Bands such as the Small Faces, The Who and The Rolling Stones appeared in the area, to work (at the legendary Marquee Club round the corner in Wardour Street), to shop, and to socialise, so it became one of the coolest destinations associated with 1960s Swinging London."]}, {"page": "List of fashion designers", "response": ["* Marion Foale"]}, {"page": "List of people from the London Borough of Waltham Forest", "response": ["* Marion Foale"]}, {"page": "Valentines High School", "response": ["* Marion Foale, artist and fashion designer"]}, {"page": "Foale and Tuffin", "response": ["Foale and Tuffin was an English fashion design business established in London in 1961 by Marion Foale and Sally Tuffin. The label became a part of the 1960s Swinging London scene."]}, {"page": "Sally Tuffin", "response": ["Sally Tuffin (born 1938 in Essex) http://search.findmypast.co.uk/results/world-records/england-and-wales-births-1837-2006?firstname=sally&lastname=tuffin&eventyear=1938&eventyear_offset=0Sally Tuffin; Marion Foale National Portrait Gallery, 2014. Retrieved 17 July 2014. is an English fashion designer and ceramicist who, with Marion Foale, was half of Foale and Tuffin, the groundbreaking fashion label that was part of the \"youthquake\" movement in 1960s London.", "Tuffin studied at Walthamstow College of Art, where she became friends with Marion Foale, who was in the year below her. On graduating, they enrolled in 1959 on a fashion design diploma course at the Royal College of Art headed by Professor Janey Ironside."]}, {"page": "James Wedge", "response": ["At the first end of year show, he did all the hats and drew the attention of the designer Ronald Paterson, who asked him if we would like to do hats for his collections. As they were all couture hats, Wedge designed extreme creations to showcase his talents and garner publicity. Liberty of London offered him a free workshop if they could have first choice of what to sell in his shop, although he was allowed to sell the rest elsewhere. Working out of a small house at 4 Ganton Street starting in about 1962, his staff grew to seven people. He was also able to help his art school friends Sally Tuffin and Marion Foale start as designers.", "Wedge helped Marion Foale and Sally Tuffin become established as designers and retailers. According to Tuffin, to make their clothes, they \"worked on the billiards table in Jimmy Wedge's flat\". According to Foale, Wedge had his offices in Ganton Street and told them about a place round the corner in Marlborough Court with a low rent. Soon, they needed more space, so Wedge found space for them above him, and when he moved out, they took over 4 Ganton Street in its entirety.Interview with Marion Foale and Sally Tuffin, April 2006. Victoria & Albert Museum, 2014. Retrieved 15 July 2014."]}, {"page": "Walthamstow College of Art", "response": ["* Marion Foale, fashion designer"]}, {"page": "Janey Ironside", "response": ["Ironside's students included Bill Gibb, Ossie Clark, Zandra Rhodes, Moya Bowler, Janice Wainwright, Sally Tuffin and Marion Foale. She introduced a menswear course and was laughed at when she said she thought Mick Jagger stylish. Antony Price, a student on the menswear course, went on to create the suited look favoured by Bryan Ferry and others. When the College was given the power to award degrees, however, her School of Fashion was excluded. After Ironside lost her post in 1968, according to her daughter in her book Janey and Me, there followed a downward spiral of alcohol abuse and depression."]}, {"page": "Ganton Street", "response": ["Designer James Wedge had premises at 4 Ganton Street in about 1962.Interview with James Wedge, February 2006. Victoria & Albert Museum, 2014. Retrieved 20 July 2014. When Wedge moved out, designers Marion Foale and Sally Tuffin took over the building. Foale described the atmosphere at the time, before Carnaby Street began to swing, as follows: \"People lived there, there was a dairy, a tobacconist, a newsagent – there was this little courtyard and everything … a proper village, though very run down.\"Interview with Marion Foale and Sally Tuffin, April 2006. Victoria & Albert Museum, 2014. Retrieved 20 July 2014."]}, {"page": "Lady Jane (boutique)", "response": ["The shop was one of the new wave of fashionable boutiques that were revitalising Carnaby Street which before the early 1960s had been a down-at-heel area of mixed shops. Lady Jane was on the site of a former dairy. Designer Marion Foale described the general Carnaby area in 1962 as follows: \"People lived there, there was a dairy, a tobacconist, a newsagent – there was this little courtyard and everything… a proper village, though very run down.\"Interview with Marion Foale and Sally Tuffin, April 2006. Victoria & Albert Museum, 2014. Retrieved 20 July 2014."]}, {"page": "Moya Bowler", "response": ["Moya Bowler was born in Reading, Berkshire. She studied fashion at the Royal College of Art (RCA) under Janey Ironside and was part of a wave of new design talent that transformed British fashion in the 1960s, with a peer group that included Bill Gibb, Janice Wainwright, Marion Foale and Sally Tuffin."]}, {"page": "List of alumni of the Royal College of Art", "response": ["* Marion Foale, fashion designer"]}, {"page": "Daphne Brooker", "response": ["She first taught at Walthamstow School of Art in east London, where her students included the fashion designers James Wedge, Marion Foale and Sally Tuffin, the film director Ken Russell and the musician Ian Dury."]}, {"page": "Foale", "response": ["*Marion Foale (born 1939), English artist and fashion designer"]}]}}