{"wiki_id": "http://www.wikidata.org/entity/Q15462948", "itemLabel": "Dominic Sherwood", "itemDescription": "English actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Dominic_Sherwood", "wikipedia_page": {"main": "Dominic Anthony Sherwood (born 6 February 1990) is an English actor and model, known for his role as Christian Ozera in the teen vampire film Vampire Academy, as Jace Herondale on the Freeform fantasy series Shadowhunters and as Kurt in the series Penny Dreadful: City of Angels.", "link_mentions": [{"page": "Sherwood", "response": ["* Dominic Sherwood"]}, {"page": "1990 in American television", "response": ["|Dominic Sherwood"]}, {"page": "Eraser (film)", "response": ["A remake of the film titled Eraser: Reborn is currently in production starring British actor Dominic Sherwood in the lead role, and is scheduled to be released in 2022.", "Deadline reported on 13 September 2021, a remake of the film with Dominic Sherwood in the lead role, alongside his fellow Shadowhunters co-star Jacky Lai, other actors on the cast include McKinley Belcher III and Eddie Ramos. It filmed under-the-radar in mid-2021 for release through Warner Bros. Home Entertainment."]}, {"page": "Heterochromia iridum", "response": ["File:Dominic Sherwood (22429006997).jpg|Actor Dominic Sherwood has sectoral heterochromia."]}, {"page": "1990 in the United Kingdom", "response": ["* 6 February – Dominic Sherwood, English actor and model"]}, {"page": "Curtis Brown (agency)", "response": ["*Dominic Sherwood, English actor and model best known for his role in Shadowhunters."]}, {"page": "List of people with heterochromia", "response": ["*Dominic Sherwood"]}, {"page": "List of people from Kent", "response": ["*Dominic Sherwood (born 1990) – actor in TV's Shadowhunters"]}, {"page": "List of people from Royal Tunbridge Wells", "response": ["*Dominic Sherwood (1990-), actor and model", "* Dominic Sherwood (1990– ), actor"]}, {"page": "Vampire Academy", "response": ["The first book in the series was adapted into a film directed by Mark Waters, starring Zoey Deutch, Lucy Fry, Danila Kozlovsky and Dominic Sherwood, released by The Weinstein Company on February 7, 2014. The film was a financial and critical failure. A television series developed by Julie Plec is set at Peacock."]}, {"page": "List of British actors", "response": ["* Dominic Sherwood (born 1990)"]}, {"page": "Sarah Hyland", "response": ["Hyland dated her Vampire Academy and Shadowhunters co-star Dominic Sherwood from 2015 until 2017."]}, {"page": "Oakwood Park Grammar School", "response": ["* Dominic Sherwood, Actor, known for his roles in Shadowhunters and Vampire Academy"]}, {"page": "List of The Mortal Instruments characters", "response": ["| Dominic Sherwood", "Like all other Shadowhunters, he is covered in thin, pale scars from years of applying various magical runes with a stele for battle and healing purposes. It is said that Jace is seventeen years old, though that was assuming he was Valentine (or Michael Wayland's) son, and his real age is between a few years younger than Jonathan Christopher and a year or so older than Clary. Jace is also left-handed (like Valentine). He has often said (and tried to prove) that the only trait he got from his father was his attitude. He is described to be extremely good looking. Jace is portrayed by Jamie Campbell Bower in the film adaptation of the book and Dominic Sherwood in the television series."]}, {"page": "The Cut (British TV series)", "response": ["Jack Simmons (played by Dominic Sherwood) is a friend of Stephen's from the mental institution who is introduced in Series 3."]}, {"page": "List of The Cut characters", "response": ["|Jack Simmons/Andrew Cromwell || Dominic Sherwood  || 3x01, 3x03 - 3x12 || 11"]}, {"page": "List of Vampire Academy characters", "response": ["Christian is played by Dominic Sherwood in the Vampire Academy film and by André Dae Kim in the Peacock television series."]}, {"page": "Not Fade Away (film)", "response": ["* Dominic Sherwood as Young Mick Jagger                       "]}, {"page": "Vampire Academy (film)", "response": ["* Dominic Sherwood as Christian Ozera, a social outcast Moroi due to his parents willingly becoming Strigoi, and Lissa's love interest", "On May 18, 2013, it was announced that Gabriel Byrne would play Victor Dashkov, Lissa's uncle, while Sarah Hyland would play Natalie Dashkov, Victor's daughter and fellow student at the academy. Joely Richardson played Queen Tatiana Ivashkov, leader of the Moroi Vampires and Dominic Sherwood played Christian Ozera, Lissa's love interest. On May 20, 2013, the producers posted a behind the scenes photograph revealing the names of a few more cast members.", "The performances received a mixed response, with Harvey and RogerEbert.com's Susan Wloszczyna negatively comparing Zoey Deutch's performance to that of Elliot Page as the titular character in Juno, while Jordan Hoffman of New York Daily News called her work the film's \"breakout\" performance while positively comparing her to Page. However, Hoffman criticized Gabriel Byrne's performance as \"obligatory slumming\". Harvey described Danila Kozlovsky's acting as \"so expressionless that he can in all honesty now say that he never acted in anything called Vampire Academy\", while also criticizing Byrne, Joely Richardson, and Olga Kurylenko; Travers also panned the latter three, saying they were \"bringing shame on all their reputations\". Dargis praised Waters for providing \"a conspicuous sympathetic touch\" to the performances of Deutch, Lucy Fry, Sarah Hyland, and Dominic Sherwood."]}, {"page": "List of American films of 2014", "response": ["| Vampire Academy|| The Weinstein Company|| Mark Waters (director); Daniel Waters (screenplay); Zoey Deutch, Lucy Fry, Danila Kozlovsky, Dominic Sherwood, Cameron Monaghan, Sami Gayle, Sarah Hyland, Joely Richardson, Olga Kurylenko, Gabriel Byrne|| "]}, {"page": "Teen Choice Award for Choice Sci-Fi/Fantasy TV Actor", "response": ["*Dominic Sherwood – Shadowhunters", "*Dominic Sherwood – Shadowhunters", "* Dominic Sherwood"]}, {"page": "Style (Taylor Swift song)", "response": ["Filmmaker Kyle Newman directed the song's music video featuring actor Dominic Sherwood as Swift's love interest. Premiering on February 13, 2015, the video featured a darker and more abstract atmosphere compared to those for previous 1989 singles \"Shake It Off\" and \"Blank Space\". Swift included \"Style\" on regular set lists for two of her world tours: the 1989 World Tour (2015) and the Reputation Stadium Tour (2018).", "American filmmaker Kyle Newman directed the music video for \"Style\", which was shot in Los Angeles and completed within four days in summer 2014. Before its release, Swift posted several teaser images and short clips from the video on her social media accounts. She planned to premiere the video on Good Morning America on the morning of February 13, 2015, but Canadian music channel Much released it at midnight. Swift uploaded the video to her Vevo account on the same day. In the video, English actor Dominic Sherwood plays Swift's love interest. Swift contacted him by text message roughly a month before the shooting; the two had known of each other through mutual friends. By the time they worked on the video, Sherwood had finished the film Take Down, which was later renamed Billionaire Ransom (released in 2016)."]}, {"page": "Shadowhunters", "response": ["* Dominic Sherwood as Jace Herondale, a charming and narcissistic shadowhunter who falls in love with Clary and is the adoptive brother of Alec, Isabelle and Max. Jace and Alec are also Parabatai. He was thought to be Michael Wayland's son and Clary's brother, however, in season 2B, he is revealed to be a Herondale. At the end of season 2B, he is killed by Valentine and subsequently resurrected by a mourning Clary as a wish to the Angel Raziel. In season 3A, his mental health and vulnerability to demonic influence are the pivotal storyline and consequences of his resurrection.", "On Twitter, Cassandra Clare announced that she would not be part of casting decisions, and would not be expecting any of the original film cast to return. On April 20, 2015, ABC revealed Dominic Sherwood as the first member of the Shadowhunters cast. On May 1, 2015, it was announced that Emeraude Toubia would be taking the role of Isabelle Lightwood and Alberto Rosende would be joining the cast as Simon Lewis. On May 6, it was reported that Katherine McNamara landed the lead role of Clary Fray. Two days later, on May 8, Matthew Daddario and Isaiah Mustafa were cast as Alec Lightwood and Luke Garroway, respectively. Harry Shum, Jr. and Alan van Sprang later joined the cast on May 15, as Magnus Bane and Valentine Morgenstern. On May 18, it was announced that Maxim Roy would be playing Jocelyn Fray.", "| data-sort-value=\"Sherwood, Dominic\" | Dominic Sherwood", "| data-sort-value=\"Sherwood, Dominic\" | Dominic Sherwood"]}, {"page": "Billionaire Ransom", "response": ["Billionaire Ransom, also known as Take Down, is a British thriller film that was directed by Jim Gillespie and written by Alexander Ignon. The film stars are Jeremy Sumpter, Phoebe Tonkin, Ed Westwick, Dominic Sherwood, Mark Bonnar, and Sebastian Koch. It was released in Kuwait on 5 May 2016 and later in the United States on 19 August 2016.", "* Dominic Sherwood as James Herrick", "In March 2013, it was announced that Jim Gillespie would direct a teen thriller titled Take Down. In February 2014, Jeremy Sumpter, Phoebe Tonkin, and Sebastian Koch were cast in the film. On 14 May 2014 it was reported that Ed Westwick and Dominic Sherwood had joined the cast of the film."]}, {"page": "Modern Family (season 7)", "response": ["* Dominic Sherwood as James"]}, {"page": "Oz Comic Con", "response": ["|Dominic Sherwood, Alberto Rosende, DB Woodside, Clare Kramer, Rick Cosnett, Willa Holland, Colton Haynes, Sam Witwer, Tricia Helfer"]}, {"page": "MTV New Year's Eve specials", "response": ["*2014: Girl Code Presents: New Year's Code—Special episode of Girl Code at 10pm ET. Hosts: live hosting in Times Square from Carly Aquilino and Charlamagne Tha God during the episode and for the hour after. Guests: Cast of Vampire Acacdemy (Zoey Deutch, Cameron Monaghan, and Dominic Sherwood)."]}, {"page": "List of Romanian films of 2014", "response": ["|| Director: Mark Waters  Cast: Zoey Deutch, Lucy Fry, Danila Kozlovsky, Gabriel Byrne, Dominic Sherwood, Olga Kurylenko, Sarah Hyland"]}]}}