{"wiki_id": "http://www.wikidata.org/entity/Q15429394", "itemLabel": "Claire Duncanson", "itemDescription": "researcher", "wikipedia_url": "https://en.wikipedia.org/wiki/Claire_Duncanson", "wikipedia_page": {"main": "Dr Claire Duncanson (born 15 January 1974) is a lecturer at the department of Social and Political Science; at the University of Edinburgh. Her research fields include Intersectional Security, International Relations theory and gender politics.In 2008, Dr. Duncanson and Dr. Eschle published a co-authored article titled \"Gender and the Nuclear Weapons State: A Feminist Critique of the UK Government’s White Paper on Trident\".  The primary inquiry in her work was to establish a connection between gender and the nuclear weapons state. While giving credit to Carol Cohn, she tackles the issue of gendered language and its place within feminist critique of the White Paper. Her argument is that since the military is so highly masculinized, there is room for feminist critique and opposition because the evidence is not only apparent, but is also overwhelming in that gender narratives are predominantly generalized with positive and negative sexualized connotations. Her claim is that not only is mitigation of gender narratives required within the military, but that they are a necessity to disassembling the \"addiction\" and need for nuclear weapons.\nBy examining the White Paper from a feminist point of view, she is able to establish that the way in which the state contextualized the language used within the White Paper publication is predominantly under the standard of sexual potency and masculinity. However the feminine terminology is stigmatized within military language; thus creating a duality of sexual binaries where one is inherently better than the other by simple term association within the language narrative. The sexual metaphorical imagery of \"vertical erector launchers, thrust-to-weight ratios, soft lay downs, deep perpetration and orgasmic whump\" gives evidence to the predominant phallic nature of the military. Furthermore, there is an underlying discourse towards gendered weakness by the dichotomy of the \"protector\" and the \"protected\". She asserts that classifying something as \"invulnerable, invincible and impregnable\" is a masculine trait; because by definition and association of pregnancies, women are the ones susceptible to pregnancy. Following this logic, one can assume that the role of protector falls into the role of the empowered male and the protected is therefore the vulnerable females. In a further example of the binary, she assumes the role of the protector as the state itself and that any rational individual within; can depict their ideologies as a \"sober and mature man who gives careful thought to the achievement of his purposes\". She indicated that this once again creates the illusion that the realist state is a rational \"manly state\"; thus creating the multitude of different dichotomies such as \"active/passive\", \"independent/ (inter)dependent\", \"rational/irrational\"; each signifying the proposed association of the positive traits to the male gender and the negative to the female gender.  She concludes that while there is \"less than expected\" of masculine lined language, it is apparent that at both face value, and while reading between the lines, that feminine terminology is devalued throughout the White Paper.", "link_mentions": [{"page": "Peace and conflict studies", "response": ["Feminist scholars have developed a speciality within conflict studies, specifically examining the role of gender and interlocking systems of inequality in armed and other conflicts.Cohn, C. (2013). Women and wars. Cambridge: Polity Press. The importance of considering the role of gender in post-conflict work was recognised by the United Nations Security Council resolution 1325. Examples of feminist scholarship include the work of Carol Cohn and Claire Duncanson."]}, {"page": "J. Ann Tickner", "response": ["* Claire Duncanson"]}, {"page": "Feminism in international relations", "response": ["Manifestations of feminist anti-militarism can be identified in various contexts and methods. In line with Cohn and Ruddick's (2003) aforementioned article, part of what feminist anti-militarism critiques is the framework in which weapons of mass destruction are “discussed”. Such discourse assumedly would have large influence in the outcome, as investigated by Cohn in one of her earlier articles, “Sex and Death in the Rational World of Defense Intellectuals.\" Her participation in security discussions allowed her to observe the way in which the “technostrategic” language used by American defense intellectuals was highly gendered, and assigned greater value and strength to that which was assigned masculine or highly sexualized terminology. While Cohn does not explicitly identify the use of a feminist anti-militarist view in this article, the ideas and subjects at hand run parallel. Relatedly, Claire Duncanson and Catherine Eschle do state their use of a feminist anti-militarist perspective in their article “Gender and the Nuclear Weapons State: A Feminist Critique of the UK Government’s White Paper on Trident”. The authors borrow Cohn's rendition of the relationship between gender and nuclear weapons to examine the way in which discourses are shaped by underlying dichotomous views of masculinity and femininity. This perspective is then applied to the renewal of Trident nuclear weapons, a plan which Duncanson and Eschl argue is enabled by the UK government's use of masculinized language that seems to be constructed into the state's identity. The UK Trident Program was the cause of another expression of feminist anti-militarism, beginning a few decades earlier in the form of the Greenham Common Women's Peace Camp. The 1979 decision by NATO to base ground cruise missiles at Greenham Common initiated a response from women largely associated with various feminist and anti-nuclear groups. Their opposition to such militarism was demonstrated in the persistence of peace camps, demonstrations and other forms of resistance for the following two decades (nat. archive website).The National Archives | Access to Archives. The National Archives. Retrieved September 26, 2013, from http://www.nationalarchives.gov.uk/a2a/records.aspx?cat=106-5gcw&cid=-1#-1 Such efforts brought to life the feminist anti-militarist perception of the relationship between gender and militarism as exhibited through nuclear weaponry."]}]}}