{"wiki_id": "http://www.wikidata.org/entity/Q15457098", "itemLabel": "Kenneth Elloway", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Kenneth_Elloway", "wikipedia_page": {"main": "Captain Kenneth Albert Elloway (17 January 1916 – 22 September 1980) was a British teacher, trombonist, double-bassist, cornetist, and conductor of many orchestras.\n\n", "link_mentions": [{"page": "New Brunswick Youth Orchestra", "response": ["* Kenneth Elloway (1974-1975)"]}, {"page": "Kenneth Albert Elloway", "response": ["#REDIRECT Kenneth Elloway"]}, {"page": "Captain Kenneth Albert Elloway", "response": ["#REDIRECT Kenneth Elloway"]}, {"page": "Cpt. Kenneth Albert Elloway", "response": ["#REDIRECT Kenneth Elloway"]}, {"page": "Captain Kenneth Elloway", "response": ["#REDIRECT Kenneth Elloway"]}, {"page": "Cpt. Kenneth Elloway", "response": ["#REDIRECT Kenneth Elloway"]}, {"page": "Royal Canadian Artillery Band", "response": ["The RCA Band traces its roots to the \"B\" Battery Band of the Royal Canadian Artillery in Quebec City. Founded in 1879, it was composed of volunteer militia and professionally trained musicians from the United Kingdom and France, becoming the first permanent military band. It became the Royal Canadian Garrison Artillery Band in 1899 under Joseph Vézina, a prominent Quebec musician who was also the first director of the Orchestre Symphonique de Québec and led the first performance of \"O Canada\" in 1880. A second band part of the Royal Canadian Garrison Artillery was formed in Kingston in 1905 and directed by Major Alfred Light. During the First World War, the RCGA Band was stationed at the Citadelle of Quebec. During this time, it was mentioned in an article of the Montreal Star as \"justly known as one of the best bands in North America\".  The two bands were the only ones operational at the end of the war. In 1922, 20 members of the band broke off or created the Band of the Royal 22nd Regiment or La Musique du Royal 22e Régiment as it is known today in French. During the Second World War, the band was for the most part stationed overseas, one of them being the RCHA Band which was reformed and stationed in Shilo, Manitoba, and then Winnipeg. In 1952, the Royal Canadian Artillery Band was formed in Halifax under Captain E.R. Wragg, and in the following years it travelled overseas to entertain troops in South Korea. In 1955 Captain Kenneth Elloway became the new bandmaster and was vital in highlighting the RCA Band on an international stage. He arranged appearances on BBC radio, invited guest performers, and led the RCA Band in the 1957 Bermuda Tattoo. After the Unification of the Canadian Armed Forces in 1968 the RCA Band in Halifax was dissolved and reformed in Montreal. The RCA Band performed for over 100,000 spectators in 1988. The RCA Band was moved from Montreal to Edmonton on 4 December 1997.http://army-armee.forces.gc.ca/en/rca-band/history.page", "*Captain Kenneth Elloway, British teacher, trombonist, and conductor."]}, {"page": "Elloway", "response": ["* Kenneth Elloway (1916–1980), British teacher, musician, and conductor"]}]}}