{"wiki_id": "http://www.wikidata.org/entity/Q15435598", "itemLabel": "Peter Wilson", "itemDescription": "English auctioneer and chairman of Sotheby's (1913-1984)", "wikipedia_url": "https://en.wikipedia.org/wiki/Peter_Wilson_(auctioneer)", "wikipedia_page": {"main": "Peter Cecil Wilson  (8 March 1913 – 3 June 1984) was an English auctioneer and chairman of Sotheby's.Wilson's father was Sir Mathew Wilson, 4th Baronet of Eshton Hall, Gargrave, Yorkshire. He was educated at Eton College and at New College, Oxford. He married Helen Ballard in 1935 who he had met in Hamburg. They had two sons and she became a noted horticulturist after he became attracted to men. The marriage was dissolved in 1951 and they remained on good terms.He worked for British Intelligence during World War II, in London and Washington DC. He thought about taking this up as a career but decided to return to \"Sotherbys\" after the war.He appeared as a castaway on the BBC Radio programme Desert Island Discs on 26 September 1966.He was made a Commander of the Order of the British Empire in 1970, and was made honorary life president of Sotheby's in 1980, when he stood down as chairman. Wilson owned Garden Lodge at Logan Place in London's Kensington district for several years.He died in Paris in 1984, after being in a coma for a week. He was 71.Wilson is mentioned in the Ian Fleming story \"The Property of a Lady\", commissioned by Sotheby's for use in their annual journal, The Ivory Hammer, and which was adapted as the auction sequence in the film Octopussy.", "link_mentions": [{"page": "Bruce Chatwin", "response": ["In the mid-1960s Chatwin grew unhappy at Sotheby's. There were various reasons for his disenchantment. Both women and men found Chatwin attractive, and Peter Wilson, then chairman of Sotheby's, used this appeal to the auction house's advantage when using Chatwin to try to persuade wealthy individuals to sell their art collections. Chatwin became increasingly uncomfortable with the situation. Later in life Chatwin also spoke of having become \"burnt out\" and said, \"In the end I felt I might just as well be working for a rather superior funeral parlour. One's whole life seemed to be spent valuing for probate the apartment of somebody recently dead.\""]}, {"page": "Peter Wilson", "response": ["==Peter Wilson==", "* Peter Wilson (singer) (born 1973), Australian singer", "* Peter Wilson (musician) (born 1971), Northern Irish musician, also known as Duke Special", "* Peter Wilson (record producer), British record producer", "* Peter Wilson (Australian rules footballer) (born 1963), Australian rules footballer", "* Peter Wilson (cricketer, born 1907) (1907–1986), New Zealand cricketer", "*Peter Wilson (cricketer, born 1944), Zimbabwean-born South African cricketer", "* Peter Wilson (curler) (born 1961), Scottish-Irish curler ", "* Peter Wilson (field hockey) (born 1942), British Olympic hockey player", "* Peter Wilson (footballer, born 1905) (1905–1983), Scottish international footballer", "* Peter Wilson (soccer, born 1947), English-born captain of the Australian national soccer team", "* Peter Wilson (footballer, born 1996), Liberian footballer", "* Peter Wilson (sailor) (born 1960), Zimbabwean sailor", "* Peter Wilson (ski jumper) (born 1952), Canadian former ski jumper", "* Peter Wilson (American soccer), Scottish-born American soccer player in the 1890s and early 1900s", "* Peter Wilson (sport shooter) (born 1986), British sport shooter", "* Peter Wilson (bishop) (1883–1956), Bishop of Moray, Ross and Caithness", "* Peter Wilson (architect) (born 1950), Australian architect", "* Peter Wilson (writer) (born 1951), Australian writer and commentator", "* Peter Wilson (murder victim) (1952–1973), Northern Irish kidnap victim; one of the \"Disappeared\" ", "* Peter Wilson (diplomat) (born 1968), British ambassador", "* Peter Wilson (auctioneer) (1913–1984), English auctioneer, chairman of Sotheby's", "* Peter Wilson or Wa-o-wa-wa-na-onk (died 1871), Native American physician and Cayuga leader"]}, {"page": "Sotheby's", "response": ["* Peter Wilson (auctioneer), former chairman"]}, {"page": "Octopussy and The Living Daylights", "response": ["\"Property of a Lady\", which was written in early 1963, was commissioned by Sotheby's for use in their annual journal, The Ivory Hammer, and was published in November 1963 and later in Playboy; Sotheby's chairman Peter Wilson is mentioned by name in the story. Fleming was so unhappy with the final piece, he wrote to Wilson and refused payment for something he considered so lacklustre."]}, {"page": "1984 in art", "response": ["*June 3 – Peter Wilson, English art auctioneer (b. 1913)"]}, {"page": "1913 in art", "response": ["* March 8 – Peter Wilson, English art auctioneer (died 1984)"]}, {"page": "Gordon Brunton", "response": ["He succeeded auctioneer Peter Wilson. His role was to stabilize the business and latterly hold off the well documented 1983 hostile takeover bid from New Jersey carpet and felt makers Marshall Cogan and Stephen Swid of General Felt Industries and Knoll International. The Board consensus was neither Cogan or Swid were suitable buyers and eventually the company was sold to real estate developer A. Alfred Taubman."]}, {"page": "List of Desert Island Discs episodes (1961–1970)", "response": ["|||Peter Wilson||His favourite novels by E. M. Forster||Bertholdo's Apollo||more"]}, {"page": "Peter Cecil Wilson", "response": ["#REDIRECTPeter Wilson (auctioneer)"]}, {"page": "Garden Lodge, Kensington", "response": ["Garden Lodge at Logan Place in Kensington, London W8 is a detached house that was built from 1908-09 for the painter Cecil Rae and his wife, the sculptor Constance Halford. The house has had several notable inhabitants since Rae including Peter Wilson, the chairman of Sotheby's auction house, and was the last residence of the singer and songwriter Freddie Mercury from 1980 until his death at the house in 1991."]}, {"page": "Peregrine Pollen", "response": ["Pollen first began working for Sotheby's in 1957, rising to become an aide to the company's chairman, Peter Wilson, before he was made the company's first New York City representative in 1960. After the company purchased Parke-Bernet in 1964at the time the largest auction house in America he became the head of Sotheby Parke-Bernet. He expanded it throughout North America, opening facilities in Houston, Denver, Los Angeles, Buenos Aires, and São Paulo. He also spearheaded the opening of PB 84, a discount store, in New York City in 1968."]}]}}