{"wiki_id": "http://www.wikidata.org/entity/Q15463201", "itemLabel": "Brian Ash", "itemDescription": "British writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Brian_Ash_(bibliographer)", "wikipedia_page": {"main": "Brian Ash (1936 – 30 June 2010) was a British writer, scientific journalist, and editor. Ash was best known for his bibliographies and reference books. In the 1970s he wrote several works on science fiction, including Faces of the Future, Who's Who in Science Fiction, and Who's Who in H. G. Wells. He also was the editor of The Visual Encyclopedia of Science Fiction (1977: UK, Pan Books; US, Harmony/Crown Books, ISBN 0-517-53175-5), which contained chapter introductions from science fiction authors as well as articles on the themes of science fiction written by himself and others. The latter title was, in 1978, listed as one of the ALA Best Books for Young Adults. He was married once, and had two children.\nIn the field of advertising, Ash published Tiger in your Tank: the Anatomy of an Advertising Campaign, a light-hearted study of the worldwide ESSO \"Tiger in your Tank\" campaign.", "link_mentions": [{"page": "Exxon", "response": ["In the 1960s and early 1970s, Humble Oil continued to have difficulties promoting itself as a nationwide marketer of petroleum products, despite a number of high-profile marketing strategies. These included the popular \"Put a Tiger in Your Tank\" advertising campaign and accompanying tiger mascot created by American illustrator Bob Jones,. 1959 as the year of the final slogan message is also mentioned by: Brian Ash, Tiger in Your Tank: The Anatomy of an Advertising Campaign (1969), p. 32. to promote Enco Extra and Esso Extra gasolines. Humble Oil also used similar logotypes, use of the Humble name in all Enco and Esso advertising, and uniform designs for all stations regardless of brand. In addition, Humble Oil was a major promoter and broadcast sponsor for college football in the Pacific-8 (now Pac-12) and Southwestern conferences."]}, {"page": "Desmond Skirrow", "response": ["While working as an advertising executive in the mid-1960s Skirrow commuted daily from Brighton to London, and he wrote 1,000 words a day until he had a 70,000-word novel. This was It Won't Get You Anywhere, the first of three spy novels about fictional British agent John Brock. Like his creator, Brock works in advertising in London, but is also a part-time agent for an undercover department run by The Fat Man. Penthouse magazine said that both Brock and Skirrow were likeable, soft-hearted and rather shy.\"Words\". Penthouse (1967), Volume 2, Issues 6–12. Skirrow denied that he and Brock had any similarity, noting that his hair was blonde and Brock's is black. According to Brian Ash, Skirrow \"resembled a latter-day Chesterton.\" Ruth Martin, writing for Books & Bookmen, described Skirrow as \"Tall, big, bearded and seemingly incapable of being serious for more than a few minutes at a time.\""]}, {"page": "Inter Ice Age 4", "response": ["In his Visual Encyclopedia of Science Fiction, British author and critic Brian Ash calls the English translation of the novel \"flat\" and \"featureless\", but notes that this \"could not smother the miracle of [Abe's] use of biology to attack racism at its very root, asking what will be our attitudes to those whom we ourselves design for life in alien habitats?\""]}, {"page": "Brian Ash", "response": ["Brian Ash (born September 29, 1974 in Bronx, New York)  is an American producer and screenwriter.", "Brian Ash is a writer and co-executive producer of Black Dynamite: The Animated Series on Adult Swim and the author of the graphic novel, Black Dynamite: Slave Island.", "Bronx raised and Yeshiva educated, Brian Ash is an alumnus of NYU's Tisch School of the Arts Film & TV program."]}, {"page": "Ash (name)", "response": ["* Brian Ash (born 1974), American screenwriter", "* Brian Ash (bibliographer) (1936–2010), bibliographer"]}, {"page": "The Visual Encyclopedia of Science Fiction", "response": ["The Visual Encyclopedia of Science Fiction is an illustrated collection of bibliographic essays on the history and subject matter of science fiction. It was edited by Brian Ash and published in 1977 by Pan Books in the UK and Harmony/Crown Books in the US.", "* Ash, Brian. The Visual Encyclopedia of Science Fiction. Brian Ash, ed. Harmony Books, 1977. ."]}, {"page": "Deaths in June 2010", "response": ["*Brian Ash, 73-74, British writer, scientific journalist, and editor."]}, {"page": "When I Was Miss Dow", "response": ["Sonya Dorman was a breeder of akitas,\"Sonya Dorman\". Brian Ash, Who's Who in Science Fiction. Elm Tree Books, 1976. which may relate to the element in the story about dog breeding."]}, {"page": "Encyclopedia of Science Fiction (1978 book)", "response": ["* The Visual Encyclopedia of Science Fiction (1977) Edited by Brian Ash"]}, {"page": "The Voyage That Lasted 600 Years", "response": ["\"The Voyage\", however, is widely regarded as the first use of the concept in fiction. It was published only shortly before Robert A. Heinlein's much more famous May 1941 \"Universe\". Both stories are broadly similar, involving a generation ship on which the passengers forget their past and come to see the ship as their original home. Brian Ash suggested that the first fictional treatment of the concept predates Wilcox's story, nothing the appearance of similar concept - but not central to the plot - in Laurence Manning's The Living Galaxy (1934)."]}, {"page": "The Greenwood Encyclopedia of Science Fiction and Fantasy", "response": ["* The Visual Encyclopedia of Science Fiction (1977) Edited by Brian Ash"]}]}}