{"wiki_id": "http://www.wikidata.org/entity/Q15503598", "itemLabel": "Harry Corbett", "itemDescription": "British puppeteer", "wikipedia_url": "https://en.wikipedia.org/wiki/Harry_Corbett", "wikipedia_page": {"main": "Harry Corbett OBE (28 January 1918 – 17 August 1989) was an English magician, puppeteer and television presenter. He was best known as the creator of the glove puppet character Sooty in 1952.", "link_mentions": [{"page": "Bill Oddie", "response": ["In the 1960s and early 1970s, Oddie released a number of singles and at least one album. One of the former, issued in 1970 on John Peel's Dandelion Records label (Catalogue No: 4786), was \"On Ilkla Moor Baht 'at\", performed in the style of Joe Cocker's \"With a Little Help from my Friends\". The B-side, \"Harry Krishna\", featured the Hare Krishna chant, substituting the names of contemporary famous people called Harry, including Harry Secombe, Harry Worth, Harry Lauder, and Harry Corbett, as well as puns such as \"Harry [Hurry] along now\", \"Harrystotle [Aristotle]\" and ending with \"Harry-ly [I really] must go now\". Both tracks appear on the compilation CD Life Too, Has Surface Noise: The Complete Dandelion Records Singles Collection 1969–1972 (2007). In 1966, he was credited as the vocalist with Spencer's Washboard Kings on \"Five Feet Two\" (Rayrick LCR1001a). The vocalist on the B-side of this 45rpm single, \"If You Knew Susie\", was Jean Hart, Oddie's future wife.Rayrick LCR1001a/b"]}, {"page": "January 28", "response": ["*1918 – Harry Corbett, English puppeteer, actor, and screenwriter (d. 1989)"]}, {"page": "Guiseley", "response": ["Harry Corbett, known for his children's television glove puppet character Sooty stage act, lived with his parents, who owned a fish and chip shop on Springfield Road.McIntyre, Annette; \"Guiseley chip shop wraps up place in TV show\", Wharfedale and Aireborough Observer, 30 April 2008. Retrieved 11 June 2008"]}, {"page": "Shipley, West Yorkshire", "response": ["* Harry Corbett OBE (1918 – 1989), creator of the long running Sooty glove puppet character, was born in the area."]}, {"page": "Thames Television", "response": ["The Sooty Show, cancelled in 1967 by the BBC, now aired on Thames and began on the first day of transmission. It continued after Harry Corbett's retirement in 1975 with his son, Matthew Corbett, and lasted on Thames until late 1992. The company also produced the children's show Magpie, which began in 1968 and was intended as a rival for Blue Peter on BBC 1, and The Tomorrow People (1973–79), a science fiction series. For pre-school children there was Rainbow, which started in 1972 and ran for 20 years. The programme used animation and graphics created by Cosgrove Hall, a Thames subsidiary founded in 1972, which made animated series for children. During the hours after Rainbow and before the children's slot, Good Afternoon was transmitted, a magazine programme. It began after the IBA allowed non-schools broadcasting in this period of the day, when the government relaxed the regulations around daytime television and featured interview editions undertaken by such broadcasters as Mavis Nicholson, and a weekly consumer programme, which eventually became a programme in its own right; Money-Go-Round."]}, {"page": "Harry Ramsden's", "response": ["The business was started by Harry Ramsden (10 February 1888–1963) in 1928 in a wooden hut in White Cross, Guiseley, West Yorkshire, northern England. Three years later he moved into a new premises, complete with fitted carpets, oak panelled walls, and chandeliers. The original hut still stands on the same site adjacent to the main restaurant, which once held the Guinness World Record for the largest fish and chip shop in the world, seating 250 people, serving nearly a million customers a year. Harry Corbett of Sooty fame was a nephew of Harry Ramsden and played the piano in his uncle's original restaurant."]}, {"page": "Basil Brush", "response": ["Ivan Owen took great care to ensure that he, personally, never received any publicity. Professionally, only Basil had a public persona, with Owen himself remaining entirely unknown. This helped give the character believability, making Basil appear to be real, since—unlike Harry Corbett and Sooty, for example—the audience never saw the puppeteer. Owen modelled Basil's voice on the actor Terry-Thomas, giving the puppet a touch of well-cultivated class."]}, {"page": "List of show business families", "response": ["* Harry Corbett, creator of the Sooty glove puppet and its TV shows, is the father of Matthew Corbett."]}, {"page": "The Magic Circle (organisation)", "response": ["The Magic Circle's headquarters houses a theatre, library, museum, a dining room, a clubroom and bars. The museum features magic tricks, props, posters, programmes, toys, photographs and artefacts related to conjuring history. Items of interest include, Robert Harbin’s original Zig Zag illusion, Chung Ling Soo's robes, an original Sooty with associated Harry Corbett apparatus, sets of props used by television magicians David Nixon and Tommy Cooper, a sound recording of Harry Houdini taken from an Edison cylinder, and a set of cups and balls used by HRH Charles, Prince of Wales when he took his Magic Circle exam in 1975. Visits are by arranged tour."]}, {"page": "Glove puppetry", "response": ["* Harry Corbett"]}, {"page": "Harry H. Corbett", "response": ["Upon returning to civilian life, Corbett trained as a radiographer before taking up acting as a career, initially in repertory. In the early 1950s, he added the initial \"H\" to avoid confusion with the television entertainer Harry Corbett, known for his act with the glove-puppet Sooty. He joked that \"H\" stood for \"hennyfink\", a Cockney pronunciation of \"anything\". In 1956, he appeared on stage in The Family Reunion at the Phoenix Theatre in London.", "As Prime Minister, Wilson wished to have Corbett appointed an Officer of the Order of the British Empire (OBE), but the middle initial \"H\" was lost in the process and the award went to the Sooty puppeteer, Harry Corbett, instead.Sin to Win: Seven Deadly Steps to Success, Marc Lewis  Both were eventually included in the same New Year's Honours list on 1 January 1976.Supplement to the London Gazette, 1 January 1976 "]}, {"page": "Child Okeford", "response": ["In 1561 William Kethe was appointed vicar of the parish. He remained in the village until his death in 1594. Kethe wrote the hymns O worship the King, all glorious above and All people that on earth do dwell, the latter adapted from Psalm 100 and set to the tune of The Old Hundredth. Other well known people who live or lived in the village include the composer Sir John Tavener, who lived in the village until his death in 2013, TV presenter Harry Corbett, originator of Sooty and Sweep, who lived here until his death in 1989, TV presenter Mick Robertson, known for Magpie, politician David James, who lived in the village whilst Conservative MP for North Dorset, and actor Tom Mennard, known for the character Sam Tindall in Coronation Street."]}, {"page": "Children in Need", "response": ["The first televised appeal took place in 1955 and was called the Children's Hour Christmas Appeal, with the yellow glove puppet Sooty Bear and Harry Corbett fronting it. The Christmas Day Appeals continued on TV and radio until 1979. During that time a total of £625,836 was raised. Terry Wogan first appeared during this five-minute appeal in 1978 and again in 1979. Sometimes cartoon characters such as Peter Pan and Tom and Jerry were used."]}, {"page": "The Sooty Show", "response": ["The Sooty Show is a British children's television series, created by Harry Corbett, and produced for the BBC from 1955 to 1967, and then for ITV from 1968 until 1992. The programme, part of the Sooty franchise, focuses on the mischievous adventures of the glove puppet character of the same name, alongside his friends Sweep and Soo, and their handler. Between 1955 and 1975, Corbett presented the programme until his retirement, before it was taken over by his son Matthew Corbett. It also co-starred Marjorie Corbett as the voice of Soo from the character's debut in 1964, until her retirement in 1981, whereupon she was replaced by Brenda Longman.", "The Sooty Show was created by Harry Corbett, a children's entertainer and magician, following the popularity of his puppet character Sooty on children's television and the decision by the BBC to commission him for several episodes featuring the character. Corbett produced several episodes for broadcast on BBC One, originally under the title of Sooty, before later renaming it to the title that would be use throughout its broadcast history, along with creating additional characters that would become key elements to the children's media franchise sharing the character's name. In 1967, Corbett fell into disagreement with BBC producers over the presentation of the programme, and with the decision by Paul Fox, the controller of BBC One at that time, to cancel the programme, and so signed a deal with ITV to move The Sooty Show to their channel. Production was handled by Thames Television shortly after its return in 1968, with Corbett presenting the programme until he was forced to retire in 1976, with his son Matthew Corbett presenting the programme until its conclusion in 1992, when Thames lost the right to produce further episodes.", "The Sooty Show featured three different formats during its broadcast history - two by Harry Corbett, the programme's creator; and the third by Matthew Corbett. The first format functioned in a manner of a cartoon short, in which Harry Corbett would detail a scenario to viewers that Sooty was undertaking, sometimes accompanied by Sweep and Soo, who were introduced over the course of this period. Certain elements in this were influenced by aspects of society, such as the space race of the 1960s, but tailored towards amusing young children - slapstick humour was often used, including the use of cream pies and water. The format was later amended over time, expanding with additional characters, while episodes were. The second format was an evolution of the first, created during the mid 1960s, which focused on episodes consisting of a series of sketches involving Sooty and his friends, and performed in front of a live studio audience of young children. In this arrangement, the programme incorporated music, story-telling, magic tricks and guest stars into episodes.", "* Harry Corbett (1955–1975) - The show's first presenter and the creator of Sooty. Corbett ran the programme mostly within a sketch-based format throughout his era, later creating the characters of Sweep and Soo to accompany the show. His most notable contribution to the show, aside from the puppet characters, was the catchphrase he used to conclude an episode's run, that would continue to be used by his successors - \"Bye bye, everybody. Bye bye.\" Harry returned to the programme as a guest star during his son Matthew's era, and was knighted with an OBE for his contributions with the programme and characters following his retirement.", "* Butch – A dark brown male dog, similar to Sweep, but able to talk. Introduced by Harry Corbett in the early 1970s, the character was withdrawn by his son Matthew in 1980, returning to guest star in the role of a villain.", "* Ramsbottom – A brown male snake who spoke in a deep Yorkshire accent and had the habit of telling rather convoluted stories and ditties. The character was created by Harry Corbett, but retired by his son Matthew. He was originally voiced by Bill Garrett, the company model and prop maker who used his own strong Yorkshire accent and made the original puppet."]}, {"page": "Matthew Corbett", "response": ["He is the son of Sooty's creator, Harry Corbett, and took over the show from his father in 1976. He retired in 1998."]}, {"page": "Ronnie Le Drew", "response": ["His numerous television credits began in 1964 with A Touch of Don Juan (BBC - narrated by Douglas Fairbanks, Jr.), The Little Mermaid (Associated Re-diffusion), Late Night line up (BBC), Mak the Sheep stealer (ATV) Michael Bentine's Potty Time, The Tommy Cooper Show both for Thames Television. Playdays (BBC), Mortimer and Arabel (BBC), Utterly Brilliant with Timmy Mallett (YTV), Good Morning with Anne and Nick (BBC), Jay's World (Meridian), Roger and the Rotten Trolls. (ITV). Bills New Frock (Channel 4) Ronnie was fortunate to appear with Harry Corbett, Matthew Corbett and also with Richard Cadell on the Sooty Show (Thames Television), and also Sooty Heights (Granada), mainly as Sweep, occasionally as Sooty and once as Scampi."]}, {"page": "1952 in the United Kingdom", "response": ["* 16 January – Sooty, Harry Corbett's glove puppet bear, first appears on BBC Television."]}, {"page": "North Pier, Blackpool", "response": ["The pier is designated by English Heritage as a Grade II listed building, due to its status as the oldest surviving pier created by Eugenius Birch. As of 2021, it is still in regular use, despite having suffered damage from fires, storms and collisions with boats. Its attractions include bars, a theatre, a carousel and an arcade. One of the oldest remaining Sooty glove puppets is on display commemorating Harry Corbett buying the original puppet there.", "One of the earliest Sooty bear puppets used by Harry Corbett is on display on the pier. Corbett bought the original Sooty puppet on North Pier for his son, Matthew. When Corbett took the puppet on BBC's Talent Night programme, he marked the nose and ears with soot so that they would show up on the black and white television, giving the puppet its name."]}, {"page": "Princes Hall", "response": ["Entertainers and personalities who have appeared at the Princes Hall include Gene Pitney, Ivor Emmanuel, Billy Fury, Marty Wilde, Heinz, New World, Martha Reeves and the Vandellas, Bobby Crush, Charles Hawtrey, Kenny Ball, Tommy Trinder, Bobby Davro, Syd Lawrence, Geno Washington, Jools Holland, Jane McDonald, Joe Brown, Harry Corbett and Matthew Corbett in the Sooty Show, Little and Large, The Krankies, Val Doonican, Barbara Dickson, Danny La Rue, Lenny Henry, Dan Snow, Norman Wisdom, Des O'Connor, Alvin Stardust, The Hollies, Joan Armatrading and Katherine Jenkins."]}, {"page": "1918 in the United Kingdom", "response": ["**Harry Corbett, English puppeteer, actor and screenwriter (died 1989)"]}, {"page": "Freda Lingstrom", "response": ["Lingstrom was responsible for commissioning a wide range of programmes including much high-quality drama as well as entertainment programmes such as Crackerjack and those featuring Harry Corbett and Sooty. She gave Johnny Morris his first TV appearances as The Hot Chestnut Man (1953–1961). Her policy was in the tradition of Lord Reith, so her programmes were aimed at education as much as entertainment, and she strongly resisted cartoons and imported programmes. Although the programmes were widely approved of by adults, the launch of ITV in 1955 soon made it clear that many children wanted something different, and the ratings for the BBC's children's programmes plummeted over the following year, when Lingstrom was replaced as Head of BBC Children's Television by Owen Reed. In retrospect Lingstrom's programmes have been seen professionally as \"cosy and slightly over-protective in tone\"."]}, {"page": "Corbett (surname)", "response": ["* Harry Corbett (1918–1989), British puppeteer"]}, {"page": "Carlton Bolling College", "response": ["* Harry Corbett OBE, puppeteer, inventor of Sooty (the longest running children's TV show in the UK)"]}, {"page": "Pentland Hick", "response": ["He was friends with Harry Corbett and contributed scripting and promotion to Sooty. He brought Harry and Sooty to the stage in his show FAMILY FUN in Christmas matinees at the Adelphi Theatre in London, and holiday season matinees at the Floral Hall in Scarborough, North Yorkshire."]}, {"page": "Soo (puppet)", "response": ["The original voice artist and puppeteer for Soo was Harry Corbett's wife, Marjorie Corbett, who voiced Soo until 1980. Brenda Longman took over in 1981 until 2001, when the then new owners of Sooty Hit Entertainment, overhauled the series and Sheila Clark became the voice of Soo  in  Sooty from 2001 - 2004."]}, {"page": "List of cultural icons of England", "response": ["* Sooty, bear created by Harry Corbett in 1948."]}, {"page": "Sooty", "response": ["Sooty is a British children's television media franchise created by Harry Corbett in the late 1950s, which incorporates primarily television and stage shows. The franchise was born in the wake of the success of his fictional glove puppet character introduced to television in 1955, with the franchises focused around the adventures of the character – a mute yellow bear with black ears and nose, who is kind-hearted but also cheeky, performs magic tricks and practical jokes, and infamously squirts his handler and other people with his iconic water pistol, including on other television programmes he guest stars on. The franchise itself also includes several other puppet characters who were created for television, some of whom became the backbone to performances, and features additional elements including an animated series, two spin-off series for the direct-to-video market, and a selection of toy merchandising.", "The Sooty franchise is focused upon the adventures of Sooty, a fictional glove puppet character created by magician and puppeteer Harry Corbett in the 1950s, alongside his other friends Sweep and Soo. Although fundamentally focused upon programmes for British children's television, Sooty also incorporate stages shows, both of which make use of a mixture of slapstick comedy, prop comedy – ranging from gunge, cream pies and water pistols – magic tricks, and music. All routines in both are primarily aimed at providing family-friendly entertainment suitable for young children. In addition, the franchise also include merchandising, ranging from annuals to toys. One such product that was sold was a toy musical instrument – referred to as a \"xylophone\", but in reality a toy glockenspiel – based upon the same instrument use by Sooty up until the 1980s.", "===Harry Corbett era===", "After his initial performances with his puppet between 1952 to 1955, Harry Corbett introduced Sooty officially with his own programme, under the same name; the title would later be changed to The Sooty Show in 1967. The programme, run on BBC 1 between 1955 to 1967 and made as a replacement for Muffin the Mule, focused primarily on a series of comedic sketches involving Sooty conducting simple tasks or ventures, which would sometimes go wrong and result in a mess that they would need to deal with. The show expanded on the routines used in episodes by featuring slapstick humour suitable for young children, magic tricks, and the inclusion of songs and music. The glove puppet gained a sufficient profile from television exposure that his likeness became a feature on charity collection boxes used by the Royal National Institute of Blind People in the late 1950s.", "In 1973 a single and album were released. The single was \"Super Sonic Sooty Spug\" with \"My Friend and I\" on the B-side. The album was Around the World with Sooty...Harry Corbett and Sweep. This comprised eight songs with a linking story. The songs included both the A and B-sides of the single. These were released on the Music for Pleasure label."]}, {"page": "1968 in British television", "response": ["*13 January – Sooty, Harry Corbett's glove puppet bear, moves from the BBC to ITV following its cancellation the previous year by the controller of BBC One, Paul Fox."]}]}}