{"wiki_id": "http://www.wikidata.org/entity/Q1557330", "itemLabel": "Neil Bibby", "itemDescription": "British politician (born 1983)", "wikipedia_url": "https://en.wikipedia.org/wiki/Neil_Bibby", "wikipedia_page": {"main": "Neil James Bibby (born 6 September 1983) is a Scottish Labour co-operative politician who has served as a Member of the Scottish Parliament (MSP) for the West Scotland region since 2011.", "link_mentions": [{"page": "Co-operative Party", "response": ["|Neil Bibby || West Scotland"]}, {"page": "Ken Macintosh", "response": ["Macintosh announced his candidacy in 2011 Scottish Labour leadership election. During a September 2011 BBC Scotland TV interview, Labour leader Ed Miliband was unable to recall Macintosh's name. After the interview, Miliband telephoned to apologise for his mistake and Macintosh tried to downplay the incident saying \"I don't think anyone should read anything into it – half the time I can't even remember the names of my own kids.\" Macintosh officially launched his campaign at Cumbernauld College on 28 October. He described the 2011 election result as a \"disaster\" and said the party had been too negative: \"We need to unite as a party and to start talking positively about our values, what Labour stands for and not just what we are against.\" He later also said he was a devolutionist, not a unionist. Despite lacking ministerial experience, he was widely seen as a frontrunner. Colleagues who endorsed his bid included his campaign manager Michael McMahon, Claire Baker, Mary Fee, Neil Bibby, Mark Griffin, Kezia Dugdale, Jenny Marra and East Renfrewshire MP Jim Murphy, with whom Macintosh shared his constituency office in Clarkston, East Renfrewshire. In the ensuing leadership election, Macintosh came second to MSP Johann Lamont."]}, {"page": "Scottish Labour Students", "response": ["2004: Neil Bibby "]}, {"page": "Scottish Labour", "response": ["*Neil Bibby - Shadow Minister for Parliamentary Business and Transport", "|Neil Bibby || West Scotland|| 2011 || Chief Whip of the Scottish Labour Party 2014-2016"]}, {"page": "Opposition Shadow Cabinets of the Scottish Parliament", "response": ["| rowspan=\"2\" |Neil Bibby", "|Neil Bibby", "|Neil Bibby", "|Neil Bibby"]}, {"page": "Bibby", "response": ["* Neil Bibby (born 1983), Scottish politician"]}, {"page": "West Scotland (Scottish Parliament electoral region)", "response": ["|rowspan=\"3\"|Neil Bibby(Labour)"]}, {"page": "2011 Scottish Labour leadership election", "response": ["Parliamentary nominations - MSPs: Claire Baker, Neil Bibby, Kezia Dugdale, Mary Fee, Mark Griffin, Ken Macintosh, Margaret McCulloch, Margaret McDougall, Jenny Marra, Michael McMahon, John Park, Graeme Pearson, Richard Simpson. MPs: Willie Bain, Gordon Banks, Alistair Darling, Russell Brown, Thomas Docherty, Brian Donohoe, Frank Doran, Gemma Doyle, Mark Lazarowicz, Anne McGuire, Jim Murphy, Frank Roy. MEPs: Catherine Stihler.", "Parliamentary nominations - MSPs: Jackie Baillie, Claire Baker, Claudia Beamish, Neil Bibby, Kezia Dugdale, Patricia Ferguson, Mark Griffin, James Kelly, Hanzala Malik, Jenny Marra, Paul Martin, Michael McMahon, Siobhan McMahon, Duncan McNeil, Anne McTaggart, John Park, Graeme Pearson, John Pentland, Drew Smith. MPs: Douglas Alexander, Willie Bain, Gordon Banks, Russell Brown, Tom Clarke, Alistair Darling, Thomas Docherty, Gemma Doyle, Sheila Gilmore, Tom Greatrex, Jim Hood, Cathy Jamieson, Eric Joyce, Mark Lazarowicz, Michael McCann, Gregg McClymont, Anne McGuire, Iain McKenzie, Jim Murphy, Ian Murray, Pamela Nash, Fiona O'Donnell, Frank Roy, Anas Sarwar. MEPs: Catherine Stihler."]}]}}