{"wiki_id": "http://www.wikidata.org/entity/Q15514459", "itemLabel": "Nigel Williamson", "itemDescription": "British journalist", "wikipedia_url": "https://en.wikipedia.org/wiki/Nigel_Williamson", "wikipedia_page": {"main": "Nigel Williamson (born 1954) is a British journalist.\n\n", "link_mentions": [{"page": "461 Ocean Boulevard", "response": ["In a retrospective review for Uncut, Nigel Williamson considered that with 461 Ocean Boulevard, Clapton \"rediscovered the primacy of music in his life\". Critic Ryan Book from The Music Times likes the track listing very much and thinks that \"the climate comes out in Clapton's work, ten tracks ranging from bright blues rock to, well, 'Let It Grow'.\" Eduardo Rivadavia at Ultimate Classic Rock calls the release a \"watershed solo LP\" and notes the popularity of the album, stating it is a \"wanted man\". The journalist finished his review by calling 461 Ocean Boulevard the album in which Clapton's \"incomparable talents and this inspired song set were finally captured\"."]}, {"page": "Trapeze (band)", "response": ["Working with The Moody Blues bassist John Lodge as producer, Trapeze recorded their self-titled debut album at London's Morgan Studios and Decca Studios. Despite Jones being the band's official lead singer, Hughes performed all vocals on the release. Hughes has revealed that he was asked to sing on the album by the group's management, who deemed him to be the better of the two vocalists.Archived at Ghostarchive and the Wayback Machine:  Before the end of the year, the Rowley composition \"Send Me No More Letters\" was released as the band's first single, backed with \"Another Day\" (written by Galley, Hughes and Jones). Trapeze was released in May 1970. The album was generally well received by critics – Billboard magazine described it as featuring \"a strong rock personality\" and dubbed it \"a candidate for big chart action\", while journalist Nigel Williamson hailed it as \"a classic period example of English prog, mixing pastoral whimsy, swirling psychedelia, rock guitars and pop harmonies\". It also received significant airplay on BBC Radio 1 from DJs such as Bob Harris and Pete Drummond, and was played in full by the station. Trapeze was promoted on a string of shows in the UK between January and July."]}, {"page": "Tribune (magazine)", "response": ["Mullin left in 1984, with circulation at around 6,000, a level it roughly remained for the next ten years). He was replaced by his equally Bennite protege Nigel Williamson, who surprised everyone by arguing for a realignment of the left and took the paper into the soft left camp, supporting Kinnock, a long-time Tribune contributor and onetime board member, as Labour leader against the Bennites. The next two editors Phil Kelly and Paul Anderson took much the same line, although both clashed with Kinnock, particularly over his decision to abandon Labour's non-nuclear defence policy.", "#Nigel Williamson (1984–1987)"]}, {"page": "Trapeze (1970 album)", "response": ["The material featured on Trapeze was primarily written by Galley, Hughes and Jones – Galley was credited on seven tracks, Hughes and Jones on five each, and Rowley on two. Despite being the band's primary vocalist, Jones was only credited with trumpet on the album, with Hughes being credited for all vocals on the release. The style of the album has been described by commentators as a mix between progressive rock, psychedelic rock and pop rock, with AllMusic's Bruce Eder claiming that \"Those listeners who only know the subsequent albums by Trapeze may be surprised by this debut effort\" due to their later hard rock style. The album was compared stylistically to the work of other British rock acts of the period, including Lodge's band the Moody Blues and Hughes's future group Deep Purple (particularly the first three albums). In the liner notes for a 2004 reissue of the album by Lemon Recordings, journalist Nigel Williamson described Trapeze as \"a classic period example of English prog, mixing pastoral whimsy, swirling psychedelia, rock guitars and pop harmonies\". Similarly, Eder identified that the album featured an array of \"lush choruses, psychedelic interludes, and hook-laden romantic ballads\", amounting to \"high-energy music within the context of psychedelic pop/rock\"."]}, {"page": "Origins of rock and roll", "response": ["According to The Boston Globes Joan Anderman, most rock historians cite it as the first, while The New Rolling Stone Encyclopedia of Rock & Roll and the website of the Rock and Roll Hall of Fame said that it is \"frequently cited\" and \"widely considered the first\", respectively. People in the music industry have also called it the first, among several others. \"Rocket 88\" is cited for its forceful backbeat and unrefined, distorted electric guitar. By contrast, writer and musician Michael Campbell wrote that, \"from our perspective,\" it was not the first rock and roll record because it had a shuffle beat rather than the rock rhythm originally characteristic in Chuck Berry's and Little Richard's songs, although he added that \"Rocket 88\" had basic characteristics of rock music such as the emphasis on guitar and distortion. Its characterization as a rock and roll or rhythm and blues song continues to be debated. Nigel Williamson questions whether it was really an R&B song \"with an unusually fast, bottom-heavy eight-to-the bar boogie rhythm and a great lyric about cars, booze and women\"."]}, {"page": "Mighty ReArranger", "response": ["A Special Tour Edition of the album was released in France containing a bonus live disc with songs recorded at Studio 104 in Paris on 9 June 2005. The album was re-released in a remastered edition on 20 March 2007, and as a part of the Nine Lives boxset. A special edition of the album sold exclusively in Best Buy retailers features a 44-minute interview bonus disc—A Conversation with Robert Plant—with an interview by Nigel Williamson."]}, {"page": "Singles 1963–1965", "response": ["Journalist Nigel Williamson provides a liner notes essay."]}, {"page": "Singles 1965–1967", "response": ["Journalist Nigel Williamson provides a liner notes essay."]}, {"page": "New Morning", "response": ["In his contemporaneous review for The Times, Richard Williams wrote that New Morning showed Dylan left behind by recent trends and \"a newer generation finds it hard to understand what the fuss is about\". Writing for Rough Guides, Nigel Williamson says that music historian Sean Egan \"astutely\" summarized the issue when he commented: \"[Dylan's] music was no longer an elemental thing ... his world view was limited to the end of the driveway of the home that his wife baked in and his children caroused through.\" Williamson calls New Morning a \"fine album\" but, despite the excitement of Dylan's supporters at Rolling Stone, \"more of a false dawn\"."]}, {"page": "Uncut (magazine)", "response": ["Uncut often produces themed spin-off titles celebrating the career of one artist. This series is now known as The Ultimate Music Guide, but was initially known as Uncut Legends. The series started in 2003 with an inaugural issue devoted to Bob Dylan, edited by Nigel Williamson (though the majority of titles that followed were produced by magazine editor Chris Hunt),followed by magazines entirely devoted to Radiohead, Kurt Cobain, U2, Bruce Springsteen, Tom Waits and John Lennon (with the Lennon magazine being produced to commemorate the 25th anniversary of the death of the former Beatle).LENNON . uncut.co.uk. Retrieved on 4 October 2007.  "]}, {"page": "The Concert for Bangladesh (album)", "response": ["In his entry for the album in the book 1,000 Recordings to Hear Before You Die, Tom Moon recognises the concerts as \"the first large-scale example of rock activism\", saying that Harrison and his fellow performers provided the blueprint for celebrities to employ their fame for charitable causes. Moon advises listeners to \"Pull this out whenever your faith in the power of music begins to wane\", and suggests Preston's \"That's the Way God Planned It\" as a primer track.Moon, p. 807. Pitchforks Quinn Moreland deems the Bangladesh relief project \"a musical triumph and a momentous collaborative effort\". He writes that while subsequent benefit concerts might encourage a suspicion that celebrity musicians merely \"play philanthropist for a day\", the Concert for Bangladesh was the realisation of Harrison's commitment to the Indian subcontinent, beyond the cultural appropriation suggested by his initial alliance with Shankar in the mid 1960s. Nigel Williamson of Uncut compliments Harrison and Spector for retaining the imperfections of the live recordings and thereby conveying the spirit of the all-star concerts. He views Dylan's set as \"spellbinding\" and a final reprise of the singer's \"mythic voice-of-a-generation image\", and concludes of the album: \"seldom before or since has rock music sounded so honest, so caring – and so capable of making us smile and cry at the same time.\"Nigel Williamson, \"George Solo: Concert for Bangladesh\", Uncut Ultimate Music Guide: George Harrison, TI Media (London, 2018), pp. 62–63."]}, {"page": "All My Love (Led Zeppelin song)", "response": ["\"All My Love\" is a mid-tempo rock-style ballad, that biographer Nigel Williamson describes as \"underpinned by a semi-classical arrangement of the kind popular at the time with the likes of Genesis and ELO\".  The original working title was \"The Hook\".  The song was recorded between November and December 1978 at Polar Studios in Stockholm, Sweden. A studio outtake of an extended version of the song exists timed around 7:55 (the song itself would be timed around 6:57). It has a complete ending, with Plant extending the last chorus with much ad-libbing and a twangy B-Bender guitar solo by Page. This version is found on several Led Zeppelin bootleg recordings."]}, {"page": "Millionaires (album)", "response": ["Writing for Uncut, Nigel Williamson wrote that the record represented \"forward momentum regained, in part due to the edgy tension between the rest of the band and the idiosyncratic Booth.\" It was a \"strange, unpredictable and at times perplexing\" album, which is why \"it might just be the best album James have ever made.\" Independent on Sunday said it had \"big ambitions, a bigger heart and choruses that are bigger still.\" Exclaim! writer Rob Bolton said Eno's production added \"a richness and deep emotional feel to the already clever and catchy songs.\" Time Out Peter Paphides found it meeting \"all the criteria a reasonable man could lay down for a great album.\" Melody Maker writer Daniel Booth criticised the \"emaciated torchsongs\" for ruining the album. He closed his review asking a question: \"Is this album a) Complete arse, b) Not that bad really, c) Pretty good, or d) F***ing fantastic? Trust me, you won't need to phone a friend.\" Soibahn Grogan of NME said it was \"an entirely adequate, depressingly typical example\" of the band's trademark: \"the ordinary, the bland, the - yawn - reliability of each album.\""]}, {"page": "Chislehurst and Sidcup Grammar School", "response": ["* Nigel Williamson, former Times journalist"]}, {"page": "Tangerine (Led Zeppelin song)", "response": ["several songs on Led Zeppelin III and later albums.  Although written earlier, \"Tangerine\" reflects this rural sensibility and journalist Nigel Williamson includes it with the acoustic material born of the Bron-yr-aur sojourn.  Other earlier influences include songs recorded at Mickie Most's Donovan sessions, when John Paul Jones and Page were studio musicians."]}, {"page": "Introducing...Rubén González", "response": ["*Nigel Williamson – liner notes"]}, {"page": "Nigel Williamson (UK journalist)", "response": ["#REDIRECT Nigel Williamson"]}, {"page": "Ginger Baker's Air Force (album)", "response": ["*Nigel Williamson – liner notes"]}, {"page": "Bitches Ain't Shit", "response": ["Meanwhile, during 2002, certain singers, rather, including Usher and Alicia Keys, were leading a revitalization of R&B's soul tradition, after a decade of the rap genre, with its \"Bitches Ain't Shit\" model, invading the R&B genre. But by 2005, in the rap genre itself, \"Bitches Ain't Shit\" had seemingly stood, as New York rapper Jadakiss would hyperbolize, \"since the beginning of time.\" And yet, in 2012, at The Chronic's 20th anniversary, Billboard magazine still found, at this track, \"an elephant in the room here: the misogyny is ugly and thick, even for a rap record,\" as \"women are treated like disposable sperm receptacles.\" The album was, by then, both a rap classic and a popular classic, anyway, roundly celebrated at its 25th anniversary.\"T.I., Juicy J & Outkast's Big Boi share their fondest memory of Dr. Dre's 'The Chronic' for 25th anniversary\", Billboard.com, Prometheus Global Media, LLC, 14 Dec 2017. \"A misogynistic hip-hop masterpiece and relic of the past,\" wrote one music journalist during the commemoration. Another journalist, meanwhile, called it \"rap's world-building masterpiece.\" In 2020, the Library of Congress entered it in the National Recording Registry. By then, music artists of over 40 songs had borrowed from \"Bitches Ain't Shit.\"In 2000, there was Trina's debut album and its \"Niggas Ain't Shit\". In 2001, Dipset's mixtape Diplomats Volume 1 offered a synthesis, \"Bitches Ain't Shit (Remix)\". In 2010, Boosie's mixtape Gone Til' December offered a \"Niggas Ain't Shit\". In 2011, YG's mixtape Just Re Up'd offered a \"Bitches Ain't Shit\", featuring Tyga and Nipsey Hussle, that samples the original and reached #90 on the main popular songs chart, the Billboard Hot 100. By 2020, over 40 songs had sampled the original, as listed at \"Samples of Bitches Ain't Shit by Dr. Dre and Snoop Dogg feat. Daz Dillinger, Kurupt and Jewell\", WhoSampled.com, originally visited 16 Jan 2020, revisited 25 May 2020 [sampling count at 45 songs]. In the process, it had become, additionally, \"a gorgeous piano ballad\"Nigel Williamson, The Rough Guide to the Best Music You've Never Heard (New York & London: Rough Guides Ltd., 2008), p 43.—a 2008 description of the 2005 cover version by rock artist Ben FoldsBen Folds, A Dream About Lightning Bugs: A Life of Music and Cheap Lessons (New York: Ballantine Books, 2019), pp 272–274. Google Books tends to conceal p 273, which as in this abridged excerpt explains, \"the part that I chose to excerpt skewed sad\", \"like a sad Johnny Cash song with a lot more vulgarity. Slowing these words down from their gangsta-rap presentation and adding a melody creates an absurd effect, both sad and funny. Sung this way, the misogyny in the original lyrics, no matter how wrong, COULD be explained by how badly the narrator was hurt\". \"It was a joke only to the extent that the comedy I loved from the seventies was a joke: It was based on something real\".—which entered the main popular songs chart, the Billboard Hot 100.\"Chart history: Ben Folds—Hot 100\", Billboard.com, Billboard Media, LLC, visited 20 Jun 2020. \"Bitches Ain't Shit\" spent one week on the Hot 100, where it held #71 for the week ending on April 2, 2005. The single's A side, \"Landed\", in two weeks on it, peaked at #77 on February 26, 2005. Although this webpage's droplist menu, now simply an unsorted list, no longer has subheaders, there once were groupings, relevant in this case to distinguish popular via consumer uptake versus pop via music genre. Whereas the Hot 100 is a \"popular\" songs chart, there are \"pop\" songs charts, rather, like the Adult Top 40, where \"Landed\" peaked at #40 on August 13, 2005, and where \"Brick\", by his earlier band, Ben Folds Five, peaked at #11 on March 21, 1998 [\"—Adult Top 40\"]. Meanwhile, on another \"pop\" songs chart, the Mainstream Top 40, \"Brick\" reached #17 on March 28, 1998 [\"—Mainstream Top 40\"]. Yet on Billboard's other \"popular\" songs chart, Triple A Songs, where \"Brick\" had placed #9 on February 14, 1998, the Ben Folds song \"You Don't Know Me\", featuring Regina Spektor, peaked at #28 on November 15, 2008, and \"Phone in a Pool\" peaked, also at #28, on September 9, 2015 [\"—Triple A Songs\"]. Outside of \"popular\" and \"pop\" but under a \"rock\" chart is Alternative Airplay, wherein Folds has five songs, the first four as Ben Folds Five and the fifth as Ben Folds: \"Battle of Who Could Care Less\" for 12 weeks at #22 peak on April 26, 1997; \"Brick\" for 26 weeks at #6 peak on February 7, 1998; \"Song for the Dumped\" for 9 weeks at #23 peak on June 13, 1998; \"Army\" for 11 weeks at #17 peak on May 29, 1999; \"Rockin' the Suburbs\" for 11 weeks at #28 peak on September 22, 2001 \"Chart History: Ben Folds—Alternative Airplay\", Billboard.com, Billboard Media, LLC, visited 14 Aug 2021]. Note that the Billboard 200, rather, is a \"popular\" albums chart."]}]}}