{"wiki_id": "http://www.wikidata.org/entity/Q15525275", "itemLabel": "Julia Drown", "itemDescription": "British politician (born 1962)", "wikipedia_url": "https://en.wikipedia.org/wiki/Julia_Drown", "wikipedia_page": {"main": "Julia Kate Drown (born 23 August 1962) is a British Labour Party politician.  She was the Member of Parliament (MP) for Swindon South, in south-west England, from 1997 until 2005.Drown was a National Health Service accountant and member of Oxfordshire County Council before her election to parliament. A mother of young children, she was at the forefront of campaigns to make Parliament more child-friendly, including the allowing of breast-feeding. She stepped down at the 2005 election to spend more time with her children, although she did not rule out standing again for election at some point in the future.\nAs of May 2018, Drown holds several organisational positions. She chairs the Veterinary Medicines Directorate, and is a trustee of the Pension Scheme for the Nursing and Midwifery Council and Associated Employers. She also occasionally trains for Eden and Partners (a health sector leadership and training consultancy). Previously she was a member of the Human Fertilisation and Embryology Authority Appeals Committee, the Health Care Professions Council and the Audit Committee of the Nursing and Midwifery Council.", "link_mentions": [{"page": "List of MPs elected in the 2001 United Kingdom general election", "response": ["| Julia Drown", "| Julia Drown"]}, {"page": "List of MPs elected in the 1997 United Kingdom general election", "response": ["|Julia Drown"]}, {"page": "Oxfordshire County Council", "response": ["*Julia Drown, member 1989–96, later Member of Parliament for Swindon South'DROWN, Julia Kate' in Who's Who (London: A. & C. Black); online edition (subscription required) by Oxford University Press, December 2007, accessed 1 December 2011"]}, {"page": "List of MPs elected in the 2005 United Kingdom general election", "response": ["| Swindon South || Anne Snelgrove || Labour || Julia Drown || Labour"]}, {"page": "South Swindon (UK Parliament constituency)", "response": ["Created in 1997, the Swindon South constituency, swinging in line with the national average in the New Labour landslide, produced a fairly safe majority for the Labour winner. Julia Drown had a lead of more than 5,000 which was extended in 2001 to more than 7,000 but then dropped dramatically on a new candidate's selection, to just 1,353 in 2005.  In 2010 Robert Buckland, a Conservative, gained South Swindon at the general election with a majority of just over 3500.  In 2015, the Conservative majority increased to 5785; in 2017, the Conservative majority fell to 2,464 on a 3.5% swing to Labour. In 2019, Buckland's majority rose to 6625 (13%) and 52% of the vote with a swing of 4.1% to Conservative. These patterns suggest a seat that is more marginal than its neighbour North Swindon,  and one which has acted as a bellwether of the national result. Incumbent MP Buckland is the current Lord Chancellor and Secretary of State for Justice.", "| Julia Drown"]}, {"page": "List of United Kingdom MPs: D", "response": ["*Julia Drown (1997–2005)"]}, {"page": "List of Labour Party (UK) MPs", "response": ["*Julia Drown, Swindon South, 1997–2005"]}, {"page": "Simon Coombs", "response": ["Coombs was MP for Swindon from 1983 until 1997 when the seat was divided by boundary changes. Coombs stood in the new Swindon South seat but lost to Labour's Julia Drown. He stood again for the seat in 2001, but was unsuccessful."]}, {"page": "Blair Babe", "response": ["| 25. || Julia Drown || South Swindon || 1997 || 2005 || Retired"]}, {"page": "List of MPs who lost their seat in the 1997 United Kingdom general election", "response": ["|Julia Drown"]}]}}