{"wiki_id": "http://www.wikidata.org/entity/Q15525123", "itemLabel": "Jim Marshall", "itemDescription": "British politician (1941-2004)", "wikipedia_url": "https://en.wikipedia.org/wiki/Jim_Marshall_(British_politician)", "wikipedia_page": {"main": "James Marshall (13 March 1941 – 27 May 2004) was a  Labour Party politician in the United Kingdom.\n\n", "link_mentions": [{"page": "1987 United Kingdom general election", "response": ["|Jim Marshall"]}, {"page": "List of MPs elected in the 1997 United Kingdom general election", "response": ["|Jim Marshall"]}, {"page": "Jim Marshall", "response": ["Jim Marshall may refer to:", "*Jim Marshall (Georgia politician) (born 1948), a member of the United States House of Representatives", "*Jim Marshall (British politician) (1941–2004), British politician", "*Jim Marshall (businessman) (1923–2012), owner and founder of Marshall Amplification", "*Jim Marshall (defensive end) (born 1937), American football player", "*Jim Marshall (defensive back) (born 1952), American and Canadian football player", "*Jim Marshall (baseball) (born 1931), American baseball player and manager", "*Jim Marshall (coach), head college football coach for the University of Richmond Spiders (1989–1994)", "*Jim Marshall (photographer) (1936–2010), music photographer", "*Jim Marshall (Australian footballer) (1882–1950), Australian rules footballer"]}, {"page": "List of MPs elected in the 1987 United Kingdom general election", "response": ["|Jim Marshall"]}, {"page": "2004 Leicester South by-election", "response": ["A by-election was held for the United Kingdom Parliament seat of Leicester South on 15 July 2004. It was triggered by the death of Labour Party Member of Parliament (MP) Jim Marshall, who died on 27 May 2004, shortly before the local and European elections in June. The by-election was won by Parmjit Singh Gill of the Liberal Democrats, over-turning a Labour majority of 13,243 votes at the 2001 general election.", "Leicester South was first won by Jim Marshall in 1974. He lost the seat to the Conservative Party candidate, Derek Spencer, in the 1983 general election by a mere 7 votes, but won it back at the 1987 election. Marshall won the constituency with a majority of 13,243 (31.4%) at the 2001 election.", "The Labour Party chose Peter Soulsby to fight the by-election. Soulsby had previously been head of Leicester City Council for 18 years and also acted as the election agent for Jim Marshall at the 2001 general election."]}, {"page": "2004 in the United Kingdom", "response": ["* 27 May – The MP for Leicester South, Jim Marshall dies, triggering a by-election.", "**Jim Marshall, politician (born 1941)"]}, {"page": "Leicester South (UK Parliament constituency)", "response": ["The seat was held by Derek Spencer for the Conservative Party between the general elections of 1983 and 1987. Its electorate demonstrated increased Labour support thereafter in local and national elections. A 2004 by-election caused by the death of Labour MP Jim Marshall was fought under the shadow of the Iraq War, and was won by Parmjit Singh Gill who became at the time the only Liberal Democrat MP from an ethnic minority. He held the seat for a year before being defeated by Labour candidate Sir Peter Soulsby at the 2005 general election. Soulsby subsequently resigned in order to seek election as Mayor of Leicester in 2011, giving Leicester South its second by-election in the space of seven years; this time the seat was safely held by Labour.", "The expansion of the city's suburbs and commuter belt has altered the incomes and other demographic measures of the constituency. The seat saw close contests between Conservative and Labour candidates in the 1980s, with Jim Marshall losing the seat by 7 votes to the Conservatives in the 1983 general election, but regaining it in 1987.", "| Jim Marshall || Labour", "| Jim Marshall"]}, {"page": "British Overseas Territories citizen", "response": ["At the time of nationality reclassification in 1983, the largest group of BDTCs (2.5 million people) was associated with Hong Kong.. The deprivation of full passports and nationality rights for colonial residents was criticized for effectively codifying ethnicity as the deciding factor in determining what rights British subjects were entitled to, an impression confirmed by exceptions granted to the majority white residents of Gibraltar and – after the Falklands War – the Falkland Islands..Lord Wyatt of Weeford, , col. 863. The British government was particularly unwilling to grant full citizenship and immigration rights to Hongkongers, fearing a mass migration to the UK after the transfer of sovereignty to China in 1997.Jim Marshall, , col. 495."]}, {"page": "1994 Labour Party leadership election", "response": ["| Jim Marshall || Beckett || Beckett"]}, {"page": "Tom Boardman, Baron Boardman", "response": ["His success as a minister was illustrated by his promotion to the post of Chief Secretary to the Treasury in the dying days of the Heath government, but a long career on the front bench was denied him by the defeat of the Government in the February 1974 election and the loss of his own seat to the Labour Party's Jim Marshall. Boardman had been a well-liked and respected Member of Parliament but, with his party back in opposition, his mainstream political career had come to an end."]}, {"page": "United Kingdom general election records", "response": ["* 1987: Bob Cryer, Margaret Ewing, John Garrett, Bruce Grocott, Joan Lestor, Jim Marshall, Ann Taylor, Andrew Welsh, Audrey Wise"]}, {"page": "1994 Labour Party deputy leadership election", "response": ["| Jim Marshall || Margaret Beckett || Margaret Beckett"]}, {"page": "Deaths in May 2004", "response": ["*Jim Marshall, 63, British Labour MP."]}, {"page": "Jim Marshall (UK politician)", "response": ["#REDIRECT Jim Marshall (British politician)"]}, {"page": "List of United Kingdom MPs who died in the 2000s", "response": ["|Jim Marshall (in office)"]}]}}