{"wiki_id": "http://www.wikidata.org/entity/Q15500605", "itemLabel": "Jonathan Maitland", "itemDescription": "British writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Jonathan_Maitland", "wikipedia_page": {"main": "Jonathan Maitland is a British playwright and broadcaster.", "link_mentions": [{"page": "Steve Nallon", "response": ["Nallon continues to perform in the guise of Margaret Thatcher. In 2011, he provided the voice of Thatcher for the film In Search of La Che, and in 2015 was cast as Thatcher in Jonathan Maitland's play Dead Sheep. Nallon has provided the voice of Margaret Thatcher since 2011 in the BBC Radio Four series UK Confidential which examines Government Cabinet papers released under the 30-year rule. During Margaret Thatcher's term in office Nallon appeared as Thatcher in The New Statesman with Rik Mayall. In 2016 voiced Thatcher for the national tour of the theatre dance show Coal created by Gary Clarke which included a section on the miners' strike of 1985."]}, {"page": "Alistair McGowan", "response": ["From 10 June to 11 July 2015 McGowan starred in An Audience with Jimmy Savile, a play about Jimmy Savile, written by Jonathan Maitland, at the Park Theatre in London."]}, {"page": "Geoffrey Howe", "response": ["Howe's dramatic resignation speech in the House of Commons formed the basis of Jonathan Maitland's 2015 play Dead Sheep. Howe was interviewed in 2012 as part of the History of Parliament's oral history project."]}, {"page": "United Kingdom in the Eurovision Song Contest 2002", "response": ["| align=\"left\" | Jonathan Maitland, Jackie Collins, Peter Maitland"]}, {"page": "Watchdog (TV programme)", "response": ["*The Big Dinner – about the food industry, presented by Jonathan Maitland"]}, {"page": "Epsom College", "response": ["* Jonathan Maitland (Cr 1974–1979), ITV Television journalist"]}, {"page": "UK national selection for the Eurovision Song Contest", "response": ["The 2002 A Song For Europe generated a lot of publicity, because three of the four acts that made the final were relatively well known to TV viewers, albeit not necessarily for their singing ability. Surf 'n' Turf included Jonathan Maitland who is a TV presenter of consumer advice shows such as Watchdog and House of Horrors. Tricia Penrose is an actress who plays Gina in the 60s retro drama Heartbeat on ITV, and Jessica Garlick had made the final stages of another ITV show Pop Idol. The standard of songs was stronger than previous years, and Jessica Garlick had a runaway victory of nearly 70,000 votes with her ballad \"Come Back\". The song was also a success in Eurovision with it finishing joint third with host country Estonia."]}, {"page": "Tonight (1999 TV programme)", "response": ["* Jonathan Maitland (1999—)"]}, {"page": "Heads Up with Richard Herring", "response": ["* Episode 10: Jonathan Maitland, Roy \"The Boy\" Brindley, Michael Greco"]}, {"page": "Jonathan Gould (presenter)", "response": ["In September 1994 Gould made the move into presenting after an introduction arranged by school friend Jonathan Maitland, joining Cable 17 TV, a Telewest channel for viewers in south-west London. By 1995 he was a full-time sports presenter for Cable 17 Sport and turned freelance in May the following year, working on the sports desk for ITV Carlton's London Tonight with newsreaders Alastair Stewart and Mary Nightingale."]}, {"page": "List of people associated with the University of London", "response": ["* Jonathan Maitland (KCL)"]}, {"page": "List of alumni of King's College London", "response": ["*Jonathan Maitland – journalist"]}, {"page": "2004 in British television", "response": ["*15 April – ITV announce plans for Vote for Me, a Pop Idol-style contest to find a Parliamentary candidate. The series will be presented by Jonathan Maitland."]}, {"page": "1999 in British television", "response": ["**ITV announce that Michael Nicholson and Jonathan Maitland will join Trevor McDonald to present a new current affairs programme for the network."]}, {"page": "The Dickson Poon School of Law", "response": ["*Jonathan Maitland, broadcaster"]}, {"page": "Jamie Tinkler", "response": ["In 2002, Jamie Tinkler entered the British qualifying competition for Eurovision Song Contest and was part of Level Best, chosen as one of four finalists alongside Surf 'n' Turf (featuring Jonathan Maitland), Tricia Penrose and Pop Idol contestant / finalist Jessica Garlick."]}, {"page": "Park Theatre (London)", "response": ["* New British plays by British authors including Sarah Rutherford's Adult Supervision (September 2013), Andrew Keatley's The Gathered Leaves (July 2015), and Jonathan Lynn's The Patriotic Traitor (February 2016). Journalist-turned-playwright Jonathan Maitland's Dead Sheep and An Audience with Jimmy Savile both drew sellout crowds in 2015."]}, {"page": "Stephen Budd", "response": ["Interviews with Budd appear in various music documentaries including \"The Africa Express\", and  \"Walking In The Opposite Direction\" (about the artist Adrian Borland and The Sound), and books such as Martin Roach's \"Take That – Now and Then\" biography, and Jonathan Maitland's \"How to Have a No.1 Hit Single\"."]}, {"page": "Jimmy Savile sexual abuse scandal", "response": ["In June 2015 a stage play about Savile and the abuse scandal was premiered at Park Theatre in Finsbury Park, London. Titled An Audience with Jimmy Savile, it was written by Jonathan Maitland and starred Alistair McGowan as Savile."]}, {"page": "From the Heart (TV campaign)", "response": ["From 8pm, an hour-long episode of Tonight, presented by Jonathan Maitland aired, highlighting the need for organ donations."]}, {"page": "Bad Girls (series 6)", "response": ["* Jonathan Maitland as Reporter"]}, {"page": "Maitland, Jonathan", "response": ["#redirectJonathan Maitland"]}]}}