{"wiki_id": "http://www.wikidata.org/entity/Q1569624", "itemLabel": "Kenneth Leighton", "itemDescription": "British composer and pianist", "wikipedia_url": "https://en.wikipedia.org/wiki/Kenneth_Leighton", "wikipedia_page": {"main": "Kenneth Leighton (2 October 1929 – 24 August 1988) was a British composer and pianist. His compositions include church and choral music, pieces for piano, organ, cello, oboe and other instruments, chamber music, concertos, symphonies, and an opera. He had various academic appointments in the Universities of Leeds, Oxford and Edinburgh. \n\n", "link_mentions": [{"page": "Yorkshire", "response": ["In the field of classical music, Yorkshire has produced some major and minor composers, including Frederick Delius, George Dyson, Philip Wilby, Edward Bairstow, William Baines, Kenneth Leighton, Eric Fenby, Haydn Wood, Arthur Wood, Arnold Cooke, Gavin Bryars, John Casken, and in the area of TV, film and radio music, John Barry and Wally Stott. Opera North is based at the Grand Theatre, Leeds. Leeds is also home to the Leeds International Piano Competition. The Huddersfield Contemporary Music Festival takes place annually in November. Huddersfield Choral Society is one of the UK's most celebrated amateur choirs. The National Centre for Early Music is located in York."]}, {"page": "The Queen's College, Oxford", "response": ["* Kenneth Leighton, twentieth-century English composer"]}, {"page": "Gerald Finzi", "response": ["In 1939, the Finzis moved to Ashmansworth in Hampshire, where he founded the Newbury String Players, an amateur chamber orchestra that he conducted until his death, reviving 18th century string music, as well as giving premieres of works by his contemporaries and offering talented young musicians such as Julian Bream and Kenneth Leighton the chance to perform."]}, {"page": "John Barbirolli", "response": ["Barbirolli's interest in new music waned in post-war years,Kennedy (1971), p. 201 but he and the Hallé appeared regularly at the Cheltenham Festival, where he premiered new works of a mostly traditional style by William Alwyn, Richard Arnell, Arthur Benjamin, Peter Racine Fricker, Gordon Jacob, Alan Rawsthorne, Kenneth Leighton and others.\"Cheltenham Musical Festival\", The Times, 1 July 1948, p. 6; \"Cheltenham Festival\", The Times, 2 July 1948, p. 6; \"Cheltenham Festival\", The Times, 30 June 1949, p. 7; \"Cheltenham Festival\", The Times, 2 July 1949, p. 7; \"Cheltenham Festival\", The Times, 6 July 1950, p. 8; and \"Cheltenham Festival\", The Times, 7 July 1950, p. 6 For its hundredth anniversary in 1958 the Hallé commissioned several new works, and gave the British premiere of Walton's virtuosic divertimento Partita.Kennedy (1989), pp. 208–209 Increasingly, Barbirolli concentrated on his core repertory of the standard symphonic classics, the works of English composers, and late-romantic music, particularly that of Mahler. In the 1960s he made a series of international tours with the Philharmonia (Latin America, 1963), BBC Symphony Orchestra (Czechoslovakia, Poland and the USSR, 1967) and the Hallé (Latin America and West Indies, 1968). It was a lasting disappointment to him that it never proved possible to take the Hallé on a tour of the United States."]}, {"page": "1988 in music", "response": ["** Kenneth Leighton, English composer"]}, {"page": "1929 in music", "response": ["*October 2 – Kenneth Leighton, composer (d. 1998)"]}, {"page": "Thomas Traherne", "response": ["Traherne's writing has also contributed to two larger-scale works. Kenneth Leighton's Symphony No.2 (Sinfonia mistica, 1974) set lines from Traherne's \"Thanksgivings for the Body\" as its third movement (Meditation).Classical Music SalesNaxos recording on YouTube Later, Harrison Birtwistle had Christ quote from \"Thanksgivings for the Body\" in Vision 1 of his opera The Last Supper (1999).\"Birtwistle: The Last Supper's libretto explored\"A 20-second excerpt at the start of a video on the opera"]}, {"page": "Priory Records", "response": ["Other Organ collections include: the complete works by Olivier Messiaen performed by Dame Gillian Weir, \"Great Australasian Organs\", \"Victorian Organ Sonatas\", \"Christmas Organ Music\", \"Organ Master Series\", \"Organ Concertos\", \"Concert Hall Series\"; the \"Complete Organ Works\" by: Sigfrid Karg-Elert, Herbert Sumsion, Camille Saint-Saëns, Eugène Gigout, Hubert Parry, Percy Whitlock, Frank Bridge, Ralph Vaughan Williams, Joseph Jongen, Kenneth Leighton, Henri Mulet, William Mathias, Samuel Sebastian Wesley.  "]}, {"page": "Common linnet", "response": ["Walter de la Mare's poem \"The Linnet\", published in 1918 in the collection Motley and Other Poems, has been set to music by a number of composers including Cecil Armstrong Gibbs, Kenneth Leighton and Jack Gibbons."]}, {"page": "List of solo cello pieces", "response": ["*Kenneth Leighton"]}, {"page": "Service (music)", "response": ["From the twentieth century, compositions are often named after the college chapel or cathedral for which they were written: examples are the Collegium Magdalenae Oxoniense of Kenneth Leighton for Magdalen College, Oxford and the Gloucester Service of Herbert Howells for Gloucester Cathedral."]}, {"page": "List of violin sonatas", "response": ["*Kenneth Leighton"]}, {"page": "Goffredo Petrassi", "response": ["From 1940 to 1960 Petrassi was professor of composition at the Santa Cecilia Conservatory; later, he also became musical director of the opera house La Fenice, and from 1960 to 1978 he taught in the master courses in composition at the Accademia di Santa Cecilia.Restagno, Enzo (ed.) (1992). Petrassi. Turin: EDT, pp. 41–42.  He was also a teacher at the Salzburg Mozarteum. Petrassi had many famous students, including Franco Donatoni, Aldo Clementi, Cornelius Cardew, Ennio Morricone, Karl Korte, Boris Porena, Norma Beecroft, Mario Bertoncini, Ernesto Rubin de Cervin, Eric Salzman, Kenneth Leighton, Peter Maxwell Davies, Michael Dellaira, Armando Santiago, and Richard Teitelbaum.  Petrassi died in Rome at the age of 98."]}, {"page": "James MacMillan", "response": ["He studied composition at the University of Edinburgh with Rita McAllister and Kenneth Leighton, and at Durham University with John Casken, where he gained an undergraduate degree and then a PhD degree in 1987. At Durham he was a member of the College of St Hild and St Bede as an undergraduate student and the Graduate Society while studying for his PhD. He was a lecturer in music at the Victoria University of Manchester from 1986 to 1988. After his studies, MacMillan returned to Scotland, composing prolifically, and becoming Associate Composer with the Scottish Chamber Orchestra, often working on education projects. As a young man he was briefly a member of the Young Communist League."]}, {"page": "Coventry Carol", "response": ["The music contains a well-known example of a Picardy third. The author is unknown; the oldest known text was written down by Robert Croo in 1534, and the oldest known setting of the melody dates from 1591.Studwell, W. E. (1995). The Christmas Carol Reader. Haworth Press. pp. 15  There are alternative, modern settings of the carol by Kenneth Leighton and another by Philip Stopford."]}, {"page": "List of Anglican church composers", "response": ["*Kenneth Leighton"]}, {"page": "List of compositions for piano and orchestra", "response": ["*Kenneth Leighton"]}, {"page": "List of compositions for cello and orchestra", "response": ["*Kenneth Leighton", "*Kenneth Leighton"]}, {"page": "List of compositions for cello and piano", "response": ["*Kenneth Leighton"]}, {"page": "Stephen Oliver (composer)", "response": ["Oliver was educated at St Paul's Cathedral School, Ardingly College and at Worcester College, Oxford, where he read music under Kenneth Leighton and Robert Sherlaw Johnson. His first opera, The Duchess of Malfi (1971), was staged while he was still at Oxford."]}, {"page": "Bernard Rose (musician)", "response": ["A graduate of Cambridge University, he is best known for his compositions of Anglican church music; his Preces and Responses, for use in the Anglican service of evensong, is widely performed. He served as a soldier in the Second World War, and went on to become a noted choir master and music tutor, counting among his pupils the composer Kenneth Leighton, musicians Professor Roger Bray, Professor David Wulstan and Harry Christophers, and actor Dudley Moore.", "After the war, Rose resumed his academic teaching role at The Queen's College in 1945, and remained there until he was appointed Informator Choristarum (organist and master of the choristers) at Magdalen College (1957–1981). Rose became a sought-after tutor, particularly for harmony and counterpoint and a distinguished choir master. His pupils included Kenneth Leighton, Dudley Moore, Harry Christophers of The Sixteen and his son, Gregory Rose. His special study of the choral music of Thomas Tomkins was published in Musica Deo Sacra; another major work was his editing of Handel's oratorio Susanna (Kassel 1967). Former choristers inspired by his leadership include Daniel Sandford, John La Bouchardière and Jonathan Powell.", "In 1952, Rose conducted the premiere of An Oxford Elegy by Ralph Vaughan Williams. Rose introduced Kenneth Leighton to the composer Gerald Finzi in the late 1940s, and the two developed a close friendship and artistic association. After Finzi's death, Leighton dedicated his Veris Gratia Suite, Op. 9 to his friend, and the choral version was conducted in Oxford by Bernard Rose in 1956. For ten years from 1957 he was president of the City of Oxford Silver Band, which he also conducted."]}, {"page": "Vernon Handley", "response": ["*Kenneth Leighton - Veris Gratia Suite"]}, {"page": "Queen Elizabeth Grammar School, Wakefield", "response": ["* Kenneth Leighton, classical and Anglican church music composer."]}, {"page": "List of organ composers", "response": ["* Kenneth Leighton"]}, {"page": "Brian Runnett", "response": ["Runnett was killed in a car crash in 1970 whilst returning from an organ recital he had given in Westminster Abbey. Composer Kenneth Leighton was commissioned by the Cathedral Organists' Association to write a memorial work for Runnett - his Second Evening Service (Magnificat and Nunc Dimittis)."]}, {"page": "Finzi Trust", "response": ["Recording projects have included not only music by Finzi, but also by Michael Berkeley, Benjamin Britten, Howard Ferguson, Ivor Gurney, Herbert Howells, Kenneth Leighton, Malcolm Lipkin, Herbert Sumsion, Elizabeth Poston, William Walton and Percy Whitlock."]}]}}