{"wiki_id": "http://www.wikidata.org/entity/Q15640861", "itemLabel": "Sam Sunderland", "itemDescription": "British off-road motorcycle rider", "wikipedia_url": "https://en.wikipedia.org/wiki/Sam_Sunderland", "wikipedia_page": {"main": "Sam Sunderland (born 15 April 1989 in Poole) is a Dubai-based British rally raid motorcycle rider, best known for his participation in the Dakar Rally, which he won in 2017 and 2022.", "link_mentions": [{"page": "Dakar Rally", "response": ["Peugeot returned for the 2015 event with an all-new, diesel-powered, two-wheel drive contender, but failed to make an impact as X-raid's Minis once more dominated. Al-Attiyah won the event in his second year for the team, while Coma racked up a fifth title in the bikes after the defection of long-time rival Despres to the car class and Peugeot. Peugeot did however see success in 2016 with Peterhansel behind the wheel, racking up his 6th win in the car category, and again in 2017 and 2018 until Peugeot decide to officially leave the competition. In 2019 Toyota won for the first time with Nasser Al-Attiyah (in his third victory with three different manufacturers). The bike category saw the KTM works team rider, Australian Toby Price, take his first Dakar victory, winning his second title in 2019. Sam Sunderland and Matthias Walkner won the 2017 and 2018 edition also for the team from Mattighofen (18 overall victories as in 2019).", "| Sam Sunderland", "| Sam Sunderland", "| Sam Sunderland || KTM 450 Rally", "| Sam Sunderland || KTM 450 Rally", "| Sam Sunderland || KTM 450 Rally ", "| Sam Sunderland || Gas Gas 450 Rally "]}, {"page": "Sport in the United Kingdom", "response": ["Britain hosts one round of the MotoGP World Championship at Silverstone in early September, and celebrated its first motorcycle grand prix world champion since the late Barry Sheene with Danny Kent's title in Moto3 in 2015. The UK also hosts one round of the Superbike World Championship, at Donington Park. In  the race had become the third Superbike World Championship round in Britain, but since then rounds at Silverstone and Brands Hatch have been dropped. The reigning SBK World Champion is Northern Irishman Jonathan Rea. Since 2000 the British Superbike Championship (BSB) has become increasingly popular. Road racing events are popular, with the Isle of Man hosting the Isle of Man TT and Northern Ireland hosting the North West 200. In rally raiding, Sam Sunderland"]}, {"page": "Segrave Trophy", "response": ["| 100px|alt=Sam Sunderland in 2020"]}, {"page": "Motorsport in the United Kingdom", "response": ["In rally raiding, Sam Sunderland became the first British winner of the Dakar Rally when he won the motorcycle classification in 2017."]}, {"page": "2019 in sports", "response": ["**Bikes winner:  Sam Sunderland (Red Bull KTM Factory Racing)", "**Bikes winner:  Sam Sunderland (Red Bull KTM Factory Racing)"]}, {"page": "Abu Dhabi Desert Challenge", "response": ["|  Sam Sunderland", "|  Sam Sunderland"]}, {"page": "Silk Way Rally", "response": ["|  Sam Sunderland", "|  Sam Sunderland ||KTM"]}, {"page": "2022 in sports", "response": ["** Bikes winner:  Sam Sunderland (Gas Gas Factory Team)"]}, {"page": "2014 Dakar Rally", "response": ["| Sam Sunderland", "| Sam Sunderland"]}, {"page": "FIM Cross-Country Rallies World Championship", "response": ["|colspan=\"4\"| Sam Sunderland (KTM)"]}, {"page": "2014 FIM Cross-Country Rallies World Championship", "response": ["| Sam Sunderland", "|align=left|  Sam Sunderland"]}, {"page": "2015 Dakar Rally", "response": ["The race was expected to be a fight between KTM, led by defending champion Marc Coma, and Honda's fleet, spearheaded by Joan Barreda, which had not triumphed since returning to Dakar as a works operation. KTM's Sam Sunderland won the opening stage, but dropped time getting lost on the second stage before retiring after injuring his shoulder and collarbone in a crash on the fourth stage. That handed the lead to Barreda, who extended his advantage to almost 13 minutes over Coma with wins in the second and fourth stages. Coma fought back with his first (and only) stage victory the following day, Barreda having his lead reduced to six-and-a-half minutes on the seventh stage after a fall which damaged his handlebar.", "| Sam Sunderland", "| Sam Sunderland"]}, {"page": "2015 FIM Cross-Country Rallies World Championship", "response": ["Austria's Matthias Walkner, riding a KTM, was the winner of the championship by 7 points ahead of Great Britain's Sam Sunderland, who also rode a KTM. Walkner won the season's fourth event, the Sardegna Rally Race, while Sunderland was the winner of the final event, the Rallye OiLibya du Maroc. Third place in the championship, 11 points further behind Sunderland, went to the best-placed Honda rider, Paulo Gonçalves. Defending champion Marc Coma finished fourth, after announcing his retirement midway through the season – he was the only rider to win more than one event, winning the first two events at the Abu Dhabi Desert Challenge and the Sealine Cross-Country Rally. Two other riders won races in 2015; Pablo Quintanilla won his home event at the Atacama Rally, and Poland's Jakub Piątek won the Rallye des Pharaons.", "| Sam Sunderland", "| Sam Sunderland", "| Sam Sunderland", "|align=left|  Sam Sunderland"]}, {"page": "Merzouga Rally", "response": ["The winners of the previous Merzouga Rally editions in the bikes include Helder Rodrigues, Sam Sunderland, Pal Anders Ullevaalseter, Kevin Benavides, Joan Barreda and Adrien van Beveren, who used the Moroccan rally as a launch pad for the Dakar. In quads, the most famous winners are Nicolas Cavigliasso (who won Dakar 2019) and Axel Dutrie, two-times Merzouga winner in this category. The 2019 winners were Adrien van Beveren (motos), Axel Dutrie (quad) and Nasser Al-Attiyah (SxS): the Qatarian driver and three-times Dakar winner, who promoted the Chapter 3 of the most famous rally-raid in Saudi Arabia, raced in Merzouga and won in side-by-side. Here below all the Merzouga Rally winners. ", "MOTO: Sam Sunderland (Gbr/Honda)"]}, {"page": "2016 FIM Cross-Country Rallies World Championship", "response": ["|  Sam Sunderland", "| Sam Sunderland", "| Sam Sunderland", "| Sam Sunderland", "|align=left|  Sam Sunderland"]}, {"page": "2017 Dakar Rally", "response": ["| Sam Sunderland", "| Sam Sunderland", "| Sam Sunderland", "| Sam Sunderland", "| Sam Sunderland", "| Sam Sunderland", "| Sam Sunderland", "| Sam Sunderland", "| Sam Sunderland", "| Sam Sunderland", "| Sam Sunderland", "| Sam Sunderland", "| Sam Sunderland", "| Sam Sunderland", "|align=center| 1||align=center| 14|| Sam Sunderland||KTM 450 Rally||Red Bull KTM Factory Team||32:06:22||"]}, {"page": "2018 Dakar Rally", "response": ["Big troubles on Stage 4 was for two of the favorites, Nasser Al-Attiyah (Team Toyota) and Cyril Despres (Team Peugeot) that have been significantly delayed. The bikes class leader and defending champion Sam Sunderland was airlifted to hospital by helicopter as he quit the race with a frightening back injury. Also, former Chelsea and Tottenham manager André Villas-Boas was taken to hospital when his car crashed into a sand dune, forcing him to retire from the rally.", "|  Sam Sunderland (KTM)", "|  Sam Sunderland (KTM)", "|  Sam Sunderland (KTM)", "|  Sam Sunderland (KTM)", "|align=center|Sam Sunderland ||  "]}, {"page": "January 2017 in sports", "response": ["| Bikes:  Sam SunderlandQuads:  Sergey KaryakinCars:  Stéphane PeterhanselTrucks:  Eduard NikolaevUTV:  Leandro Torres"]}, {"page": "List of Dakar Rally records", "response": ["| rowspan=\"5\" | 7 ||  Sam Sunderland || 2017, 2022 ||  rowspan=\"5\" | 2", "|align=left| Sam Sunderland"]}, {"page": "Dakar 18", "response": ["Players can play as official rally drivers like Sam Sunderland, Carlos Sainz, Stéphane Peterhansel, Sebastian Loeb and many others, and can exit their vehicle and take control of the pilots to explore, rescue and repair. If the vehicle is trapped, players can use shovels to dig through sand or mud, place recovery boards, and tow the vehicle. During races, players also have to pay attention to the damage and repair system."]}, {"page": "Rallye OiLibya du Maroc", "response": ["| Nasser Al-Attiyah|| Matthieu Baumel||Mini All 4 Racing Team X-Raid||  Sam Sunderland || KTM"]}, {"page": "2019 Dakar Rally", "response": ["| Sam Sunderland", "| Sam Sunderland", "| Sam Sunderland", "| Sam Sunderland", "| Sam Sunderland", "| Sam Sunderland", "| Sam Sunderland", "|  Sam Sunderland", "|align=center|Sam Sunderland || "]}, {"page": "List of 2019 motorsport champions", "response": ["|  Sam Sunderland"]}, {"page": "2019 FIM Cross-Country Rallies World Championship", "response": ["|  Sam Sunderland", "| Sam Sunderland", "| Sam Sunderland", "| Sam Sunderland", "|align=left|  Sam Sunderland"]}, {"page": "2020 Dakar Rally", "response": ["|\tSam Sunderland", "| Sam Sunderland", "| Sam Sunderland"]}, {"page": "2021 Dakar Rally", "response": ["| 5 ||  Sam Sunderland || KTM 450 Factory || Red Bull KTM Factory Racing || G1.1", "| Stage 11 ||  Sam Sunderland ||  Giovanni Enrico ||  Nasser Al-Attiyah ||  Seth Quintero ||  Francisco López Contardo ||  Anton Shibalov ||  Stephan Lamarre", "| Sam Sunderland", "| Sam Sunderland", "| Sam Sunderland", "| Sam Sunderland", "| Sam Sunderland", "| Sam Sunderland", "| Sam Sunderland", "| 3 ||  Sam Sunderland|| KTM 450 Factory|| 47:34:11 || + 0:15:57"]}, {"page": "2017 FIM Cross-Country Rallies World Championship", "response": ["| Sam Sunderland", "| Sam Sunderland", "|align=left|  Sam Sunderland"]}, {"page": "2021 FIM Cross-Country Rallies World Championship", "response": ["|  Sam Sunderland", "|align=left|  Sam Sunderland"]}, {"page": "2022 Dakar Rally", "response": ["| 3 ||  Sam Sunderland || Gas Gas 450 Rally Factory Replica || Gas Gas Factory Team || RallyGP", "| Stage 8 ||  Sam Sunderland ||  Alexandre Giroud ||  Mattias Ekström ||  Seth Quintero ||  Marek Goczał ||  Dmitry Sotnikov ||  Jesus Fuster Pliego", "! Rally Winners !!  Sam Sunderland !!  Alexandre Giroud !!  Nasser Al-Attiyah !!  Francisco López Contardo !!  Austin Jones !!  Dmitry Sotnikov !!   Serge Mogno", "| Sam Sunderland", "| Sam Sunderland", "| Sam Sunderland", "| Sam Sunderland", "| Sam Sunderland", "| Sam Sunderland", "| Sam Sunderland", "| Sam Sunderland", "| Sam Sunderland", "| Sam Sunderland", "| Sam Sunderland", "| Sam Sunderland", "| Sam Sunderland", "| Sam Sunderland", "| Sam Sunderland"]}]}}