{"wiki_id": "http://www.wikidata.org/entity/Q15616328", "itemLabel": "John Cridland", "itemDescription": "British business person", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Cridland", "wikipedia_page": {"main": "John Cridland, CBE (born 3 February 1961) is a British business executive. He was the tenth Director-General of the Confederation of British Industry (CBI) from January 2011 to November 2015.\n\n", "link_mentions": [{"page": "Christ's College, Cambridge", "response": ["|John Cridland"]}, {"page": "Lincolnshire", "response": ["* John Cridland (born 1961), former Director-General of the Confederation of British Industry (CBI); Chair of Transport for the North (TfN)"]}, {"page": "Boston, Lincolnshire", "response": ["* John Cridland (born 1961) former Director-General of the Confederation of British Industry, Chair of Transport for the North"]}, {"page": "Gordonstoun", "response": ["In Britain, former Education Secretary Nicky Morgan voiced a need for a greater curricular emphasis on character building. At the same time the educational advisor John Cridland and former shadow education minister Tristram Hunt began using phrases such as \"rounded and grounded\", \"resilience\", \"team-building\" and \"communication skills\" when discussing education."]}, {"page": "Confederation of British Industry", "response": ["* John Cridland (31 January 2011 – October 2015)"]}, {"page": "Carolyn Fairbairn", "response": ["In June 2015, it was announced that she would replace John Cridland in November as Director-General of the Confederation of British Industry, as a result of which she would resign all other positions aside from her chair of Marie Curie Cancer Care."]}, {"page": "Boston Grammar School", "response": ["* John Cridland – former Director General of the Confederation of British Industry(Retrieved 13 April 2021 from archive) Business Update - CBI Annual Conference 2015 CBI"]}, {"page": "Richard Lambert", "response": ["He was replaced by John Cridland as head of the CBI on 1 February 2011."]}, {"page": "Pensions crisis", "response": ["In October 2017 the UK Government implemented a mandatory automatic enrolment system where full-time employees and employers have to make contributions to a workplace pension scheme. The UK Government commissioned an independent review of the State pension age by John Cridland and in 2017, amongst other measures, it proposed increasing the state pension age to 68 and removing the triple lock on state pensions."]}, {"page": "Cridland", "response": ["* John Cridland (born 1961), British businessman", "* John Cridland Latham (1888–1975), American soldier and Medal of Honor recipient"]}, {"page": "Cridland, John", "response": ["#redirectJohn Cridland"]}, {"page": "List of people from Lincolnshire", "response": ["* John Cridland (born 1961), former Director-General of the Confederation of British Industry (CBI); Chair of Transport for the North (TfN)"]}]}}