{"wiki_id": "http://www.wikidata.org/entity/Q15694022", "itemLabel": "John Cargill Thompson", "itemDescription": "British dramatist", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Cargill_Thompson", "wikipedia_page": {"main": "John Cargill Thompson (1938 - 2000) was a Scottish dramatist specialising in one-person plays. After the performance of his 52nd play, he was described as \"Britain's most prolific playwright\", surpassing Shakespeare's 37 and Alan Ayckbourn's 51.", "link_mentions": [{"page": "Macbeth, King of Scotland", "response": ["In modern times, Dorothy Dunnett's novel King Hereafter aims to portray a historical Macbeth, but proposes that Macbeth and his rival and sometime ally, Thorfinn of Orkney, are one and the same (Thorfinn is his birth name and Macbeth his baptismal name). John Cargill Thompson's play Macbeth Speaks 1997, a reworking of his earlier Macbeth Speaks, is a monologue delivered by the historical Macbeth, aware of what Shakespeare and posterity have done to him. Scottish author Nigel Tranter based one of his historical novels, MacBeth the King, on the historical figure. David Greig's 2010 play Dunsinane takes Macbeth's downfall at Dunsinane as its starting point, with his reign portrayed as long and stable, in contrast to Malcolm's. British Touring Shakespeare also produced in 2010 A Season Before the Tragedy of Macbeth by dramatist Gloria Carreño describing events from the murder of \"Lord Gillecomgain\", Gruoch Macbeth's first husband, to the fateful letter in the first act of Shakespeare's tragedy"]}, {"page": "John Thompson", "response": ["* John Cargill Thompson (1938–2000), Scottish dramatist"]}, {"page": "George Frederick Cooke", "response": ["Scottish dramatist John Cargill Thompson wrote a one-person play The Actor's Apology about an incident when Cooke was forced by theatre management to make an apology to an audience for his drunken performance."]}, {"page": "Manchester School of Theatre", "response": ["Manchester Polytechnic School of Theatre evolved out of an early training course for drama teachers that was introduced by the Manchester College of Art and Design between 1964 and 1966. The theatre school was officially established in 1970 as part of Manchester Polytechnic under its charismatic Head of School Edward Argent and Senior Lecturer John Cargill Thompson. It was established to provide a professional training for actors that went beyond the rather staid traditions of the established drama schools: at the time, the Central School of Speech and Drama would examine prospective students' teeth, like a horse, to see if they had the teeth of a professional actor. Argent and his team believed that the authentic spirit of an actor, even if contained within a less-than-conventionally-perfect body, was more important."]}, {"page": "Cargill (surname)", "response": ["*John Cargill Thompson, Scottish dramatist specialising in one-person plays", "*John Cargill Thompson (1938-2000), Scottish dramatist"]}, {"page": "Helen Cargill Thompson", "response": ["Born in Burma where her father worked as a merchant trader, in 1939, Thompson, her parents and two brothers returned to Glasgow to live with her grandparents in Mirrlees Drive, close to Glasgow Botanic Gardens. Her great grand-uncle David Sime Cargill was the founder of Burmah Oil., the Cargills having started as East India merchants in Glasgow and merchant traders in Ceylon (today's Sri Lanka) where the business was known as the 'Harrods of Colombo'. Her older brother, William David James Cargill Thompson, was a professor of ecclesiastical history at King's College, London, and her younger brother, John Cargill Thompson, was a playwright."]}]}}