{"wiki_id": "http://www.wikidata.org/entity/Q1565100", "itemLabel": "Richard Noble", "itemDescription": "Scottish entrepreneur and holder of the land speed record", "wikipedia_url": "https://en.wikipedia.org/wiki/Richard_Noble", "wikipedia_page": {"main": "Richard James Anthony Noble, OBE (born 6 March 1946) is a Scottish entrepreneur who was holder of the land speed record between 1983 and 1997. He was also the project director of ThrustSSC, the vehicle which holds the current land speed record, set at Black Rock Desert, Nevada in 1997.", "link_mentions": [{"page": "March 6", "response": ["*  1946   – Richard Noble, Scottish race car driver and businessman"]}, {"page": "October 4", "response": ["*1983 – Richard Noble sets a new land speed record of  at the Black Rock Desert in Nevada."]}, {"page": "1997", "response": ["** Andy Green sets the first supersonic land speed record for the ThrustSSC team, led by Richard Noble of the UK. ThrustSSC goes through the flying mile course at Black Rock Desert, Nevada at an average speed of 1,227.985 km/h (763.035 mph)."]}, {"page": "1983", "response": ["* October 4 – British entrepreneur Richard Noble sets a new land speed record of 633.468 mph (1,019.468 km/h), driving Thrust2 at the Black Rock Desert, Nevada."]}, {"page": "Supersonic speed", "response": ["The Bloodhound LSR project planned an attempt on the record in 2020 at Hakskeenpan in South Africa with a combination jet and hybrid rocket propelled car. The aim was to break the existing record, then make further attempts during which [the members of] the team hope to reach speeds of up to . The effort was originally run by Richard Noble who was the leader of the ThrustSSC project, however following funding issues in 2018, the team was bought by Ian Warhurst and renamed Bloodhound LSR. Later the project was indefinitely delayed due to the Covid-19 pandemic and the vehicle was put up for sale."]}, {"page": "Sound barrier", "response": ["On 15 October 1997, in a vehicle designed and built by a team led by Richard Noble, Royal Air Force pilot Andy Green became the first person to break the sound barrier in a land vehicle in compliance with Fédération Internationale de l'Automobile rules. The vehicle, called the ThrustSSC (\"Super Sonic Car\"), captured the record 50 years and one day after Yeager's first supersonic flight."]}, {"page": "Land speed record", "response": ["|October 4, 1983|| Black Rock Desert, United States|| Richard Noble||Thrust2||Turbojet: 1 × Rolls-Royce Avon"]}, {"page": "ThrustSSC", "response": ["ThrustSSC, Thrust SSC or Thrust SuperSonic Car is a British jet car developed by Richard Noble, Glynne Bowsher, Ron Ayers, and Jeremy Bliss.", ":The World Motor Sport Council homologated the new world land speed records set by the team ThrustSSC of Richard Noble, driver Andy Green, on 15 October 1997 at Black Rock Desert, Nevada (USA). This is the first time in history that a land vehicle has exceeded the speed of sound. The new records are as follows:", "In 1983 Richard Noble had broken the world land speed record with his earlier car Thrust2, which reached a speed of . The date of Andy Green's record came exactly a half century and one day after Chuck Yeager broke the sound barrier in Earth's atmosphere, with the Bell X-1 research rocket plane on 14 October 1947.", "== Richard NobleOrange-Intel dispute ==", "In June 2012, a television advertisement for the Orange San Diego mobile phone, containing an Intel processor, was broadcast on British television and featured a fast car in computer generated imagery. Richard Noble claimed that the car was a representation of Thrust SSC and thus these companies had used his intellectual property without permission, putting the future of the Bloodhound LSR project in doubt. The Advertising Standards Authority rejected the Bloodhound team's complaint, claiming that intellectual property disputes were not in its remit. According to BBC News technology correspondent Rory Cellan-Jones, Intel and Orange responded that their production team had researched different styles of \"superfast vehicles\" and developed their own Orange-branded land speed car, and that the advertisement and phone were not connected to Noble or Bloodhound LSR.BBC News – Orange, Intel, and a fast car furore. BBC. (27 June 2012).", "* Richard Noble: Thrust: The Remarkable Story of One Man's Quest for Speed, Hardcover: Partridge, 1998, ; Paperback: Bantam, 1999, ", "*Richard Noble"]}, {"page": "Thrust2", "response": ["The “Land Speed Record” (LSR), which was valid for 12 years, 11 months and 11 days at that time, was 622.407 mph (1001.667kph) over one mile (with a flying start). The record was set on October 23, 1970 by the American Gary Gabelich with Blue Flame, a rocket car on the Bonneville Salt Flats. Richard Noble stepped up to \"bring back this record for Britain\".", "The time it took Richard Noble from the idea to the first concept to the successful record attempt was nine years. In 1977 the Thrust2 project was officially presented at the Motorfair 1977 at London's Earls Court. In 1978, the design and construction of Thrust2 began. The hired designer John Ackroyd retired to an abandoned cottage on the Isle of Wight for the design studies.", "| rowspan=\"4\" |Richard Noble", "In 1997 Thrust2's record was broken by Richard Noble's follow up car, ThrustSSC, with a top speed of ."]}, {"page": "Black Rock Desert", "response": ["* In 1983, Richard Noble drove the jet-powered Thrust2 car to a new record of . Noble also headed up the team that beat the Thrust 2 record."]}, {"page": "Gary Gabelich", "response": ["Gabelich averaged  on his first run and  on his second run for an average speed of  establishing a new kilometer FIA LSR. The mile FIA LSR was the first exceeding  and remained unbeaten until 1983, when Richard Noble broke it driving Thrust 2. The faster kilometer FIA LSR remained unbroken for 27 years when ThrustSSC went supersonic in 1997."]}, {"page": "Rolls-Royce Spey", "response": [";RB.168 Mk.202: (Military Spey) McDonnell Douglas F-4 Phantom II modified F-4J for British service (\"Phantom FG1\"). (Surplus engines were purchased and used by Richard Noble for the Thrust SSC land speed record car of 1997.)"]}, {"page": "John Cobb (racing driver)", "response": ["Cobb resided at 'Grove House' in Esher, an 18th-century mansion, which was demolished in the late 20th century for building development. A public green in Esher (located at 51.37933 -0.36472) was named 'Cobb Green' in tribute to his achievements. In 2013 an archaeological excavation of meadowland at Arran Way at Esher's Lower Green uncovered the foundations of Grove House.'Remains of John Cobb house found during site dig', 'Get Surrey' online newspaper, 3 July 2013. https://www.getsurrey.co.uk/news/local-news/remains-john-cobb-house-found-4868502 In 2017 a Blue plaque was unveiled by Richard Noble to Cobb's memory at the newly re-built Cranmere Primary School which partially occupies the site of the former Grove House estate.'Blue plaque honours John Rhodes Cobb, former world land speed record holder', 'Get Surrey' online newspaper, 28 February 2013. https://www.getsurrey.co.uk/news/motoring/motoring-news/john-rhodes-cobb-blue-plaque-12665671"]}, {"page": "RAF Elvington", "response": ["In the summer of 1998 Colin Fallows bettered Richard Noble's outright UK Record, driving his \"Vampire\" jet dragster at Elvington with an average of .The Guardian, 8 June 1999, Page C4. The current non wheel-driven British Land Speed Record holder is Vampire, driven by Fallows, which hit a speed of  on 5 July 2000 at Elvington.The Times, 21 September 2006. See"]}, {"page": "Rolls-Royce Derwent", "response": ["A Derwent Mk.8 from a Gloster Meteor was used in the jet propelled car Thrust1, which was built by Richard Noble in 1977. This was an initial development car that paved the way for Thrust2, which Noble drove to set a new land speed record in 1982."]}, {"page": "Pragyan", "response": ["| 2013 || Anil Kakodkar, Tessy Thomas, Atul Gurtu, Rohan Dixit, David Christian, Richard Noble"]}, {"page": "You Bet!", "response": ["|bgcolor=\"ffdddd\"| Richard Noble"]}, {"page": "Hewland", "response": ["After an approach from Richard Noble, Hewland was persuaded to design and build the AE75, a 75 bhp aero-engine for Noble ARV Super2, a 2-seater light aircraft. This engine, an inverted three-cylinder water-cooled two-stroke unit with dual ignition and a 2.7:1 reduction gearbox, was developed from Hewland's existing two-cylinder microlight engine. The AE75 was very light at , thereby contributing to the overall lightness of the aircraft, so that the ARV Super2 weighed 40% less than its competitor, the Cessna 152."]}, {"page": "List of English inventions and discoveries", "response": ["* 1997: World Land Speed Record, 1,228 km/h (763 mph), achieved by ThrustSSC, a jet-propelled car designed and built in England. Project director: Richard Noble (born 1946); designed by Ron Ayers (born 1932), Glynne Bowsher and Jeremy Bliss; piloted by Andy Green (born 1962)."]}, {"page": "Henry Segrave", "response": ["Recipients include Malcolm Campbell (1932), Stirling Moss (1957), Richard Noble (1983), Lewis Hamilton (2007) and John Surtees (2013)."]}, {"page": "Segrave Trophy", "response": ["| 100px|alt=Richard Noble"]}, {"page": "Ron Ayers", "response": ["In retirement, while working as a volunteer at Brooklands Museum, Ayers found research papers from pre-World War II record-breaking attempts, and it sparked his interest in record-breaking. His involvement in the land speed record-breaking attempt came about through a chance meeting with Richard Noble in the offices of Ken Norris, the designer behind Donald Campbell's record-breaking Bluebird CN7. Through a combination of rocket sled testing at Pendine Sands and extensive computational fluid dynamics testing, Ayers was able to develop and refine a shape which would eventually go on to break the sound barrier."]}, {"page": "1983 in the United Kingdom", "response": ["* 4 October – Richard Noble, driving the British turbojet-powered car Thrust2, takes the land speed record to 634.051 mph (1020.406 km/h) over 1 km (633.47 mph (1019.47 km/h) over 1 mile) at Black Rock Desert in the United States, an increase of 40 mph over the previous kilometre record."]}, {"page": "Rosco McGlashan", "response": ["McGlashan attempted to set the record in his jet-powered car, Aussie Invader II. The car was powered by a 36,000 hp Atar jet engine from a Mirage jet fighter aeroplane. In February 1995 Rosco and his team headed back to Lake Gairdner for an assault at the 633.468 mph (1,013.55 km/h) world land speed record, held by Richard Noble. This attempt was not a success, due to poor salt conditions, the course being very wet in places. McGlashan ran off course and hit the metal timing equipment at 960 km/h (600 mph). McGlashan walked away but the car was destroyed."]}, {"page": "British land speed record", "response": ["On 25 September 1980 Thrust2 driven by Richard Noble broke the Flying Mile record at a speed of 248.87 m.p.h. and the Flying Kilometre at 251.190 m.p.h. at RAF Greenham Common.Thrust, by Richard Noble, Bantam Books, 1999, Pages 80-81.", "In the summer of 1998, Colin Fallows bettered Richard Noble's outright UK Record in his Vampire jet dragster at an average speed of 269 m.p.h. at Elvington, Yorkshire.The Guardian, 8 June 1999, Page C4. See also: The Guardian, 20 August 1997, Page 2. Mark Newby raised this to 272 mph in Split Second in July 2000 but Colin Fallows raised the record again on the same day using Vampire to record an average speed of 300.3 mph with a peak of 329 mph."]}, {"page": "ARV Super2", "response": ["Richard Noble, the world 1983 land speed record holder and UK entrepreneur, identified a gap in the market for a low-cost lightweight two-seat trainer, after expensive product-liability lawsuits in the USA had driven the major American general aviation manufacturers temporarily to abandon production of such aircraft. Noble established a factory at Sandown on the Isle of Wight to build the ARV Super2 aircraft, with the first prototype flying on 11 March 1985. The factory used some novel manufacturing techniques, including British ALCAN's \"Supral\" (a superplastic aluminium alloy), adhesives (to reduce the number of rivets and thereby save weight), and a bespoke new British engine, the Hewland AE75. These innovations gave the ARV an empty weight 40% lower than the Cessna 152,Blech 1986, p.47. making the Super2 both cheaper to buy and to operate. The manufacturer claimed it could reduce pilot training costs by 25%"]}, {"page": "List of Old Wykehamists", "response": ["*  Richard Noble, designer of the ThrustSSC"]}, {"page": "Bloodhound LSR", "response": ["The Bloodhound project was announced on 23 October 2008 at the London Science Museum by Lord Drayson – then Minister of Science in the UK's Department for Innovation, Universities and Skills – who first suggested the project in 2006 to land speed record holders Richard Noble and Andy Green, a pilot and Wing Commander serving in the RAF.  The two men, between them, have held the land speed record since 1983."]}, {"page": "Carpool (web series)", "response": ["| Richard Noble"]}, {"page": "1983 in the United States", "response": ["**Richard Noble sets a new land speed record of 633.468 mph, driving Thrust 2 at the Black Rock Desert, Nevada."]}, {"page": "1997 in the United States", "response": ["**Andy Green sets the first supersonic land speed record for the ThrustSSC team, led by Richard Noble of the UK. ThrustSSC goes through the flying mile course at Black Rock Desert, Nevada, at an average speed of 1,227.985 km/h (763.035 mph)."]}, {"page": "Fully Charged", "response": ["|Richard Noble"]}, {"page": "Kestrel K-350", "response": ["The original company, formed in 2002 to build the aircraft, was started by Richard Noble who was responsible for the team that first broke the sound barrier on land. Noble envisioned the aircraft's primary role as being part of a fleet of “air taxis” in Europe, provided as an alternative to both commercial airlines and chartered corporate jets. Noble named his Farnborough, England-based company “Farnborough Aircraft” and the design for the then-designated “F1” was detailed."]}, {"page": "Thrust1", "response": ["Thrust1 was a British-designed and built jet-propelled car. The car was designed and built by its driver Richard Noble, who later achieved the land speed record with his car Thrust2."]}]}}