{"wiki_id": "http://www.wikidata.org/entity/Q1560662", "itemLabel": "Neil Kernon", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Neil_Kernon", "wikipedia_page": {"main": "Neil Kernon is an English musician, record producer, mixer and recording engineer from London. He is a Grammy Award winner and has worked on over 100 Gold and Platinum records.", "link_mentions": [{"page": "Dexys Midnight Runners", "response": ["Around this time, Archer played Rowland demos of Archer's new group, The Blue Ox Babes, which featured, in Rowland's words, \"a Tamla-style beat with violins\".  The violins had been played by a Birmingham School of Music classical violin student named Helen Bevington. Rowland's first idea was to get the horn players to also play strings, as he had discussed in the March interview (with Speare on viola, which he already played, and string novices Paterson and Maurice on cello), and the horn players (with session musician support) contributed strings to the third single with the new lineup, \"Liars A to E\", produced by Neil Kernon, which was released in October 1981.  In November, the group played a three-night stand at The Old Vic in London, with the horn section again doubling on strings. The Old Vic shows attracted unexpectedly rave reviews in the press, although these concerts were not recorded. Rowland said of these shows, \"Those three nights at the Old Vic were all I wanted to say in '81.\""]}, {"page": "Hall & Oates", "response": ["The 1980s brought about significant changes for Hall and Oates. The pair felt that the biggest hindrance to their success was that their music was being filtered through outside producers, and that studio musicians were not familiar with their own tastes and thoughts. In 1979, they hired G. E. Smith (who had worked with Dan Hartman and David Bowie by then) as lead guitarist, Mikey Curry as drummer in 1980 and later in 1981 Tom \"T-Bone\" Wolk joined as bassist. They also enlisted Hall's girlfriend Sara Allen (and also her younger sister Janna) as songwriting collaborators, as well as beginning a working relationship with Neil Kernon, an engineer on Voices who worked as co-producer on their succeeding two albums. In late 1979, Hall and Oates released X-Static, which combined rock with disco. The album did not fare well, although \"Wait for Me\" did hit the top 20. "]}, {"page": "Redemption (band)", "response": ["Now back in Los Angeles, Redemption teamed up with Grammy Award-winning producer Neil Kernon to complete work on the band's next record. Hosharian decided to return his focus to classical music and departed from the band amicably, so van Dyk returned to keyboards. Released in October 2011, This Mortal Coil is centered lyrically around the concept of mortality and is influenced -- though not to a simply auto-biographical extent -- by van Dyk's experience with cancer."]}, {"page": "Empire (Queensrÿche album)", "response": ["* Neil Kernon — producer and engineer on track 13"]}, {"page": "Petra (band)", "response": ["At the height of its career, the members of Petra were wary of repeating the arena-rock formula that had served the band so well since the mid-1980s. Seeking a way to change directions musically, the band and its producers for their next album hired an outside engineer for the first time, bringing in Neil Kernon, who had previously worked with Kansas, Elton John and Peter Gabriel.Hendrickson, Lucas W. \"Petra: Ready, Willing, and Able\". CCM Magazine, January 1992, Pages 18–20. Along with its usual hard rock fare, the band added tracks that featured a gospel choir and a bluesy sound, and Kernon's influence led to an album with a stronger emphasis on the band's rhythm section."]}, {"page": "Unleashed in the East", "response": ["*Engineered by Neil Kernon"]}, {"page": "Drastic Measures", "response": ["* Neil Kernon – producer, engineer, mixing at Bullet Recording, Nashville, Tennessee", "Category:Albums produced by Neil Kernon"]}, {"page": "Back for the Attack", "response": ["*Neil Kernon – producer, engineer", "Category:Albums produced by Neil Kernon"]}, {"page": "Scars of the Crucifix", "response": ["*Neil Kernon – production", "Category:Albums produced by Neil Kernon"]}, {"page": "Under Lock and Key", "response": ["*Neil Kernon, Michael Wagener – producers, engineers, mixing", "Category:Albums produced by Neil Kernon"]}, {"page": "Choronzon (album)", "response": ["* Neil Kernon – mixing"]}, {"page": "The Clay People", "response": ["Forming in 1989 as \"Clay People\", the band debuted with the 1991 EP Toy Box before signing to Re-Constriction Records and issuing their debut album Firetribe in May 1993. Clay People's second EP The Iron Icon and studio album Stone-Ten Stitches followed in 1995 and 1997 respectively. The group added \"The\" to their name with the release of their 1998 self-titled album, marking a change in direction from their dance club roots to a live rock band with a lineup featuring Neet, Brian McGarvey (guitar), Mike Guzzardi (guitar), D. Patrick Walsh (bass) and Dan Dinsmore (drums). The album was produced by Neil Kernon for Slipdisc Records and was the band's most successful release.  Songs from the record were included in the soundtracks to the films Strangeland, Universal Soldier: The Return, and Marked For Death.", "*The Clay People (1998) production credit Neil Kernon"]}, {"page": "FM (British band)", "response": ["When CBS folded the Portrait label, FM switched to Epic. The Overland brothers went to the United States to write with Desmond Child, returning with the hard rock anthem \"Bad Luck\". Queensrÿche and Dokken producer Neil Kernon was engaged to oversee 1989’s Tough It Out."]}, {"page": "Tourniquet (band)", "response": ["On February 22, 2010, Blabbermouth.net reported that Tourniquet would record a new album in spring with noted producer Neil Kernon. The band stated, \"We plan to release it as soon as it's finished in fall of this year.\" Kirkpatrick also announced plans to release solo albums of stoner metal and drumming over classical music. On November 10, Tourniquet announced a partnership with Kickstarter.com to fund the album's recording with fan packages and experiences for anyone who contributes toward the new album budget. On May 21, 2012, a contest concluded where a fan guessed the new album name from a series of clues. The band announced, via their Facebook page, that the album would be titled Antiseptic Bloodbath.  The band re-released Tourniquet Live in California on DVD that same year."]}, {"page": "Dahmer (album)", "response": ["* Neil Kernon - Production", "Category:Albums produced by Neil Kernon"]}, {"page": "Queensrÿche (EP)", "response": ["* Neil Kernon – production (track 5)"]}, {"page": "The Warning (Queensrÿche album)", "response": ["*Neil Kernon – engineering, mixing (\"The Prophecy\"), production"]}, {"page": "Rage for Order", "response": ["* Neil Kernon – keyboards", "* Neil Kernon - production, engineering, mixing", "Category:Albums produced by Neil Kernon"]}, {"page": "Annihilation of the Wicked", "response": ["Annihilation of the Wicked is the fourth studio album by American technical death metal band Nile. The album was released on May 23, 2005, by Relapse Records. This is the first Nile album to feature George Kollias on drums, replacing Tony Laureano. This album marks Nile's last record released by Relapse. The liner notes detail the theme and writing/recording process of each song. A music video for \"Sacrifice Unto Sebek\" was produced. It is also the first Nile album produced by Neil Kernon.", "* Neil Kernon − recording, mixing, producer", "Category:Albums produced by Neil Kernon"]}, {"page": "The Clay People (album)", "response": ["* Neil Kernon – production, recording, mixing", "Category:Albums produced by Neil Kernon"]}, {"page": "Wild in the Streets (Helix album)", "response": ["*Neil Kernon – Producer (tracks 1, 6)", "Category:Albums produced by Neil Kernon"]}, {"page": "The Wretched Spawn", "response": ["Category:Albums produced by Neil Kernon"]}, {"page": "King's College, Taunton", "response": ["* Neil Kernon, musician, record producer"]}, {"page": "Gore Obsessed", "response": ["* Neil Kernon – production, mixing", "Category:Albums produced by Neil Kernon"]}, {"page": "Novembers Doom", "response": ["In October 2002, Novembers Doom entered the studio to begin work on their second full-length of new material for Dark Symphonies. The band's fourth full-length album would be entitled To Welcome the Fade, only this time they recruited the talents of the Grammy Award-winning producer, Neil Kernon. Kernon, best known for his work with acts like Hall & Oates, Kansas, Yes, Queensrÿche, Judas Priest, and more recently Nevermore and Cannibal Corpse, brought a new power and clarity to the sound of the band. This album was chosen as the Number One metal album of 2002 in Metal Maniacs magazine by one of its head editors, Novembers Doom was also a featured cover story on their January 2003 issue."]}, {"page": "The Best of Kansas", "response": ["*\"Perfect Lover\" produced by Kansas, engineered by Kevin Elson, mixed by Neil Kernon at The Record Plant, Los Angeles, California, 1984"]}, {"page": "Dreaming Neon Black", "response": ["* Neil Kernon – production, mixing, mastering", "Category:Albums produced by Neil Kernon"]}, {"page": "Everybody's Crazy", "response": ["Producer Neil Kernon described how he became involved with the album: \"Well, I got a call from Michael's manager asking me if I'd be interested. I'd heard \"Fools Game\" [from his previous album, Michael Bolton] and liked that, so we met and hit it off straight away. Michael was one of the funniest people I've ever met.\" Kernon also said that later on, Bolton did not want to re-release Everybody's Crazy or his self titled 1983 album on CD for fear of confusing and alienating fans of his later adult contemporary music.Interview with the album's producer, Neil Kernon Retrieved 12-02-2007.", "* Neil Kernon – additional keyboards", "* Producers – Neil Kernon (Tracks 1–5, 7, 8 & 9); Randy Goodrum (Track 6).", "* Engineers – John Abbey, Bruce Buchalter, Bobby Cohen, John Davenport, Neil Kernon, Bruce Lampcov, Andrew Milano and Malcolm Pollack.", "* Tracks 1, 2, 3, 5, 7, 8 & 9 mixed by Neil Kernon.", "Category:Albums produced by Neil Kernon"]}, {"page": "Do They Hurt?", "response": ["Category:Albums produced by Neil Kernon"]}, {"page": "Advance and Vanquish", "response": ["* Neil Kernon – producer, engineer", "Category:Albums produced by Neil Kernon"]}, {"page": "1st (album)", "response": ["*Neil Kernon - Engineer, Producer, Mixing", "Category:Albums produced by Neil Kernon"]}, {"page": "Play Don't Worry", "response": ["*Neil Kernon – ARP synthesizer on \"Billy Porter\" and \"This Is for You\""]}, {"page": "Anatomy Is Destiny", "response": ["*Neil Kernon – production, engineering, mixing", "Category:Albums produced by Neil Kernon"]}, {"page": "Cuatro (Flotsam and Jetsam album)", "response": ["*Orchestration on \"Forget About Heaven\" by Michael Gilbert; performed by Neil Kernon", "*Produced by Neil Kernon", "*recorded, engineered and mixed by Neil Kernon. Assistant engineers: Michelle Schindler, A.J. Justico", "Category:Albums produced by Neil Kernon"]}, {"page": "The Politics of Ecstasy (album)", "response": ["*Produced, recorded and mixed by Neil Kernon", "Category:Albums produced by Neil Kernon"]}, {"page": "Unseen Power", "response": ["* Neil Kernon – mixing"]}, {"page": "In Memory", "response": ["*Neil Kernon - produced, recorded and mixed"]}, {"page": "I Can't Go for That (No Can Do)", "response": ["Daryl Hall sketched out the basic song one evening at a music studio in New York City, in 1981, after a recording session for the Private Eyes album. Hall started the Rock 1 setting on Roland CompuRhythm then began playing a bass line on a Korg organ, and sound engineer Neil Kernon recorded the result. Hall then came up with a guitar riff, which he and Oates worked on together. The next day, Hall, Oates and Sara Allen worked on the lyrics."]}, {"page": "Nevermore (album)", "response": ["*Neil Kernon – recording and mixing", "Category:Albums produced by Neil Kernon"]}, {"page": "Pamela Moore", "response": ["In 2006, Moore released a full-length album, Stories from a Blue Room. All of the songs written by Moore and former Rorschach Test guitarist Benjamin Anderson. The album was produced by Neil Kernon and recorded at Sonic Ranch studio in El Paso, Texas and Robert Lang Studios in Seattle. Terri Nunn, Jeff Loomis, and Michael Wilton have all made guest appearances on this record.Pamela Moore Interview, RavenheartMusic.com; accessed March 3, 2015."]}, {"page": "Private Eyes (Hall & Oates album)", "response": ["As the liner notes to the 2004 Private Eyes reissue indicate, it was while Daryl Hall & John Oates were recording the follow-up album in their adopted hometown of New York City, during the spring of 1981, that \"Kiss on My List\" went to number one in three trade publications. Determined to follow up on their success, the duo produced Private Eyes assisted by their co-producer Neil Kernon.", "* Produced by Daryl Hall, John Oates and Neil Kernon.", "* Engineered and Mixed by Neil Kernon", "Category:Albums produced by Neil Kernon"]}, {"page": "Sons of Thunder (Labyrinth album)", "response": ["*Neil Kernon - Engineer, Mixing", "Category:Albums produced by Neil Kernon"]}, {"page": "Rock 'n Soul Part 1", "response": ["* Neil Kernon – co-producer (5, 6, 7, 9, 10 & 11)", "Category:Albums produced by Neil Kernon"]}, {"page": "Boys in Heat", "response": ["*Neil Kernon - producer, engineer, mixing", "Category:Albums produced by Neil Kernon"]}, {"page": "H2O (Hall & Oates album)", "response": ["* Engineered and co-produced by Neil Kernon", "Category:Albums produced by Neil Kernon"]}, {"page": "Drift (Flotsam and Jetsam album)", "response": ["Category:Albums produced by Neil Kernon"]}, {"page": "Formless", "response": ["*Neil Kernon — Producer/Mixer", "Category:Albums produced by Neil Kernon"]}, {"page": "Death SS", "response": ["The album Panic was partially recorded in the US, with Neil Kernon as a producer, because the band liked his work for artists such as Queensrÿche, Judas Priest, Dokken, Nevermore, David Bowie, Rush and Skrew and had, according to Sylvester, \"a particular touch in the dark side of Heavy Metal [...] that we were looking for\". The band's management contacted Kernon, who accepted after listening to the band's demos of the new songs. The album was released in 2000 by Sylvester's own label, Lucifer Rising, and Dream Catcher."]}, {"page": "Product (Brand X album)", "response": ["Category:Albums produced by Neil Kernon"]}]}}