{"wiki_id": "http://www.wikidata.org/entity/Q15787326", "itemLabel": "Beatrice Dawson", "itemDescription": "British costume designer", "wikipedia_url": "https://en.wikipedia.org/wiki/Beatrice_Dawson", "wikipedia_page": {"main": "Beatrice Dawson (26 January 1908 – 16 April 1976) was a British costume designer who was nominated for an Academy Award, as well as three BAFTA nominations. She had 69 film credits from 1945 to 1976.\nDawson also worked on an episode of Walt Disney's Wonderful World of Color in 1969, which was the made-for-television film Guns in the Heather, as well as a few episodes of the television show Sir Francis Drake.\n\n", "link_mentions": [{"page": "Academy Award for Best Costume Design", "response": ["| Beatrice Dawson"]}, {"page": "Sir Francis Drake (TV series)", "response": ["Historical research was provided by E. Hayter Preston.  Beatrice Dawson designed the many period costumes worn in the show.  Ian Stuart Black was story editor.  The fight scenes were arranged by Peter Diamond, who also appeared in four episodes."]}, {"page": "28th Academy Awards", "response": ["** The Pickwick Papers – Beatrice Dawson"]}, {"page": "Tam-Lin (film)", "response": ["Filming took place in the summer of 1969 at Traquair House and other locations in Peeblesshire, Scotland.'Shooting Now: Location', Kinematograph Weekly 19 July 1969'Gershwin-Kastner's Toys Rolls Scot Locationing', Variety 16 July 1969 The cast stayed at the Peebles Hydro Hotel. Interiors were shot at Pinewood Studios, on sets designed by art directors John Graysmark and Donald M. Ashton. Costumes were designed by Beatrice Dawson and Ava Gardner's gowns executed by Balmain."]}, {"page": "BAFTA Award for Best Costume Design", "response": ["| Of Human Bondage || Beatrice Dawson", "| Woman of Straw || Beatrice Dawson", "|A Doll's House || Beatrice Dawson"]}, {"page": "Dawson (surname)", "response": ["*Beatrice Dawson (1908–1976), British costume designer"]}, {"page": "Of Human Bondage (1964 film)", "response": ["* 1965: BAFTA Film Award for Best British Costume Design, Black and White (Beatrice Dawson)"]}, {"page": "The Pickwick Papers (1952 film)", "response": ["*In 1956, Beatrice Dawson was nominated for an Oscar for Best Costume Design, Black-and-White for the film's costumes."]}, {"page": "27th British Academy Film Awards", "response": ["* A Doll's House – Beatrice Dawson"]}, {"page": "18th British Academy Film Awards", "response": ["* Of Human Bondage – Beatrice Dawson", "* Woman of Straw – Beatrice Dawson"]}, {"page": "The Reluctant Widow (film)", "response": ["It was shot at Denham Studios. The film's art direction was by Carmen Dillon while the costumes were designed by Beatrice Dawson."]}, {"page": "List of British Academy Award nominees and winners", "response": ["|Beatrice Dawson"]}, {"page": "Catherine Arley", "response": ["* Woman of Straw (Great Britain, 1964) - Film. French title: La Femme de paille. Director: Basil Dearden. Screenplay: Stanley Mann, Robert Muller and Michael Relph based on the Catherine Arley novel La Femme de paille. Production: Michael Relph. Music: Norman Percival. Photography: Otto Heller (Eastmancolor). Editing: John D. Guthridge. Sets: Ken Adam. Art director: Peter Murton. Scene decorator: Freda Pearson. Costumes: Beatrice Dawson et Christian Dior. Production designer: Charles Orme. Assistant director: Clive Reed. Sound: Ray Baker. Duration: 117 minutes. Cast: Gina Lollobrigida (Maria Marcello), Sean Connery (Anthony Richmond), Ralph Richardson (Charles Richmond), Alexander Knox (Lomer), Johnny Sekka (Thomas), Laurence Hardy (Baynes), Peter Madden (yacht captain), Danny Daniels, Noel Howlett, A.J. Brown, Robert Bruce, Georgina Cookson, Michael Corcoran, George Curzon, Gilada Dahlberg, Michael Goodlife, Ronald Hatton (Dr Murray), Joseph Wise (Peters), George Zenios (waiter at l’Island Hôtel)."]}, {"page": "List of female Academy Award winners and nominees for non-gendered categories", "response": ["|Beatrice Dawson"]}, {"page": "Irmelin", "response": ["Sir Thomas Beecham directed the British premiere at the New Theatre Oxford on 4 May 1953; the costumes were by Beatrice Dawson and choreography by Pauline Grant. Beecham's advocacy of the score and \"care with which he realizes each detail, the beauty of sound he elicits from his orchestra\", were praised by the Opera critic, along with Dennis Arundell's production.Porter, Andrew. Opera Diary – Oxford New Theatre. Irmelin (Delius). Opera, July 1953, Vol. 4, No. 7, pp. 422–425."]}]}}