{"wiki_id": "http://www.wikidata.org/entity/Q15706103", "itemLabel": "Alfred Henry Huth", "itemDescription": "English bibliophile", "wikipedia_url": "https://en.wikipedia.org/wiki/Alfred_Henry_Huth", "wikipedia_page": {"main": "Alfred Henry Huth (1850–1910) was an English bibliophile. From a banking family, he followed his father Henry Huth's interest in book collecting, and helped found the Bibliographical Society of London.", "link_mentions": [{"page": "Roxburghe Club", "response": ["A photograph exists of the membership in 1892, including the Prime Minister Arthur Balfour and anthropologist Andrew Lang, as well as American poet James Russell Lowell, Alfred Henry Huth, and Simon Watson Taylor. James Gascoyne-Cecil, Viscount Cranborne, was then President.", "*Alfred Henry Huth (d.1910, son of Henry) (elected 1883)"]}, {"page": "Huth (surname)", "response": ["* Alfred Henry Huth (1850–1910), English author and bibliophile (son of Henry Huth)"]}, {"page": "Fosbury", "response": ["Fosbury House, northwest of Fosbury, was built around 1800. From 1810 it was the seat of the Bevan banking family, and later was the home of bibliophile Alfred Henry Huth until his death in 1910."]}, {"page": "Henry Huth (bibliophile)", "response": ["He married Augusta Louisa Sophia von Westenholz, the third daughter of Frederick Westenholz, of  in Austria. They had three sons (one of them being the author and bibliophile Alfred Henry Huth) and three daughters.", "*Alfred Henry Huth (1850-1910), author and bibliophile"]}, {"page": "List of most expensive books and manuscripts", "response": ["Originally owned by Carl Philipp Emanuel Bach and subsequently by Breitkopf and Alfred Henry Huth"]}, {"page": "St Mary Magdalene's Church, Bolney", "response": ["The Huth family were important in church life in the 19th and 20th centuries.  Henry Huth was a bibliophile whose enormous collection of rare books was sold for £300,000 in 1910 (£ in ).  He lived in an extravagant château-style 1870s house called Wykehurst Place in the parish, and was buried in the churchyard after his death in 1878.  In 1905, his son Edward gave the church a large, \"magnificent\" lychgate constructed from local materials: oak, millstones from a mill in the parish, Sussex Marble (a locally quarried limestone) and a Horsham Stone slab roof.  It stands at the end of the twitten leading to the churchyard, which has been left slightly overgrown to conserve wildlife.  A mid-19th-century rector planted the churchyard and rectory grounds with a wide range of trees, many of which survive—including Bhutan pines and oaks from Somerset.   There are many Victorian tombs and grave-markers in the churchyard, including some rare wooden grave-boards and some with wooden cross-pieces set between stone balls.  Another of Huth's sons, Alfred Henry Huth—who also became a book-collector and author, and who died in 1910—is commemorated by a memorial tablet inside the church; its style was described by Nikolaus Pevsner as \"neo-late 17th-century\"."]}, {"page": "Alfred Huth", "response": ["#REDIRECT Alfred Henry Huth"]}, {"page": "Fosbury House", "response": ["The house was purchased in 1810 by Silvanus Bevan, then passed to his son David Bevan, then to his son Robert Cooper Lee Bevan, then to his son Francis Augustus Bevan, four generations of bankers. At some point between 1899 and 1903, it was sold to Alfred Henry Huth (1850–1910), the bibliophile, and it housed the Huth Library until its dispersal in a series of sales after his death."]}, {"page": "Charles Frederick Huth", "response": ["*Octavia Huth (1849–1929), married her first cousin, Alfred Henry Huth (1850–1910), the bibliophile"]}, {"page": "Thomas Harman", "response": ["Before 1566, Harman had composed an elaborate treatise on vagrants and come to London to superintend its publication. He lodged at the cloister in Whitefriars and continued his investigation even while his book was passing through the press. Of the first edition, issued in 1566 or very early in 1567, no copy is known. Its popularity was at once so great that Henry Bynneman and Gerrard Dewes were both fined by the Stationers' Company in 1567, for attempting to circulate pirated copies. Of the second edition two copies, differing in many particulars, are extant. One is in the Bodleian Library (dated 8 Jan. 1567-8), and in 1890 the other belonged to Alfred Henry Huth (dated 'Anno Domini 1567'). The former is doubtless the earlier of the two, neither of which seems to have been published till early in 1568. Both were issued by William Griffith. The title ran in the later copy, A Caueat or Warening for commen cvrsetors Vvlgarely called Vagabones. A dedication by Harman to his neighbour, Elizabeth, Countess of Shrewsbury, widow of the 4th Earl, who held the manor of Erith and 'the epistle to the reader' is followed by exhaustive small essays on 24 classes of the thieves' and tramps' fraternity, and by a list of names of the chief professors of the art 'lyuinge nowe at this present.' A vocabulary of 'their pelting speche' or cant terms concludes the volume, which is embellished by a few woodcuts, including one of 'an upright man, Nicolas Blunt,' and another of 'a counterfeit cranke, Nicolas Genynges.' Harman borrowed something from The Fraternitye of Vacabondes, by John Awdelay, which was probably first issued in 1561, although the earliest edition now known is dated 1575; but Harman's information is far fuller and fresher than Awdelay's, and was very impudently plagiarised by later writers. The Groundworke of conny-catching (1592), very doubtfully assigned to Robert Greene, reprints the greater part of Harman's book. Thomas Dekker, in his Belman of London (1608), made free use of it, and Samuel Rowlands exposed Dekker's theft in his Martin Mark-all, Beadle of Bridewell (Lond. 1610). Dekker, in the second part of his Belman, called Lanthorne and Candlelight (1609), conveyed to his pages Harman's vocabulary of thieves' words, which Richard Head incorporated in his 'English Rogue' (1671–80). Harman's vocabulary is the basis of the later slang dictionaries (cf. among others, that forming the appendix to 'Memoires of John Hall' (d. 1707) (see Jack Hall), 1708). Another edition of Harman's Caueat appeared in 1573, and this was reprinted by Machell Stace in 1814. A carefully collated edition of the second edition was edited by Dr. Frederick Furnival and Edward Viles for the Early English Text Society in 1869, and re-issued by the New Shakspeare Society in 1880."]}]}}