{"wiki_id": "http://www.wikidata.org/entity/Q15897", "itemLabel": "Amy Winehouse", "itemDescription": "English singer and songwriter", "wikipedia_url": "https://en.wikipedia.org/wiki/Amy_Winehouse", "wikipedia_page": {"main": "Amy Jade Winehouse (14 September 1983 – 23 July 2011) was a British singer and songwriter. She is known for her deep, expressive contralto vocals and her eclectic mix of musical genres, including soul, rhythm and blues and jazz.\nA member of the National Youth Jazz Orchestra during her youth, Winehouse signed to Simon Fuller's 19 Management in 2002 and soon recorded a number of songs before signing a publishing deal with EMI. She also formed a working relationship with producer Salaam Remi through these record publishers. Winehouse's debut album, Frank, was released in 2003. Many of the album's songs were influenced by jazz and, apart from two covers, were co-written by Winehouse. Frank was a critical success in the UK and was nominated for the Mercury Prize. The song \"Stronger Than Me\" won her the Ivor Novello Award for Best Contemporary Song from the British Academy of Songwriters, Composers, and Authors.\nWinehouse released her follow-up album, Back to Black, in 2006, which went on to become an international success and one of the best-selling albums in UK history. At the 2007 Brit Awards it was nominated for British Album of the Year, and she received the award for British Female Solo Artist. The song \"Rehab\" won her a second Ivor Novello Award. At the 50th Grammy Awards in 2008, she won five awards, tying the then record for the most wins by a female artist in a single night and becoming the first British woman to win five Grammys, including three of the General Field \"Big Four\" Grammy Awards: Best New Artist, Record of the Year and Song of the Year (for \"Rehab\"), as well as Best Pop Vocal Album.\nWinehouse was plagued by drug and alcohol addiction. She died of alcohol poisoning on 23 July 2011, at the age of 27. After her death, Back to Black temporarily became the UK's best-selling album of the 21st century. VH1 ranked Winehouse 26th on their list of the 100 Greatest Women in Music.", "link_mentions": [{"page": "Brigitte Bardot", "response": ["Women who emulated and were inspired by Bardot include Claudia Schiffer, Emmanuelle Béart, Elke Sommer, Kate Moss, Faith Hill, Isabelle Adjani, Diane Kruger, Lara Stone, Kylie Minogue, Amy Winehouse, Georgia May Jagger, Zahia Dehar, Scarlett Johansson, Louise Bourgoin, and Paris Hilton. Bardot said: \"None have my personality.\" Laetitia Casta embodied Bardot in the 2010 French drama film Gainsbourg: A Heroic Life by Joann Sfar. "]}, {"page": "London Borough of Croydon", "response": ["Premier League football club Crystal Palace F.C. play at Selhurst Park in Selhurst, a stadium they have been based in since 1924. Other landmarks in the borough include Addington Palace, an eighteenth-century mansion which became the official second residence of six Archbishops of Canterbury, Shirley Windmill, one of the few surviving large windmills in Greater London built in the 1850s, and the BRIT School, a creative arts institute run by the BRIT Trust which has produced artists such as Adele, Amy Winehouse and Leona Lewis.", "The BRIT School is a performing Arts & Technology school, owned by the BRIT Trust (known for the BRIT Awards Music Ceremony). Famous former students include Kellie Shirley, Amy Winehouse, Leona Lewis, Adele, Kate Nash, Dane Bowers, Katie Melua and Lyndon David-Hall. Grants is an entertainment venue in the centre of Croydon which includes a Vue cinema."]}, {"page": "Diego Maradona", "response": ["In 2017, Maradona featured as a legendary player in the football video games FIFA 18 and Pro Evolution Soccer 2018.\"FIFA 18 to include 95-rated icon Diego Maradona as EA Sports adds footballing legend to Ultimate Team\". Evening Standard. Retrieved 8 September 2017 In 2019, a documentary film titled Diego Maradona was released by Academy Award and BAFTA Award winning filmmaker Asif Kapadia, director of Amy (on singer Amy Winehouse) and Senna (on motor racing driver Ayrton Senna). Kapadia stated that \""]}, {"page": "Eden Project", "response": ["Since 2002, the Project has hosted a series of musical performances, called the Eden Sessions. Artists have included Amy Winehouse, James Morrison, Muse, Lily Allen, Snow Patrol, Pulp, Brian Wilson, and The Magic Numbers. Oasis were also set to play in the summer of 2008, but the concert was postponed because Noel Gallagher was unable to perform after breaking three ribs in a stage invasion incident several weeks before. The concert was instead played in the summer of 2009. After the 2020 sessions were postponed until 2022 due to the COVID-19 pandemic, the 2021 sessions were held in September instead of the usual June and July dates.", "|Amy Winehouse"]}, {"page": "July 23", "response": ["*2011 – Amy Winehouse, English singer-songwriter (b. 1983)"]}, {"page": "London", "response": ["London was instrumental in the development of punk music, with figures such as the Sex Pistols, The Clash, and Vivienne Westwood all based in the city. More recent artists to emerge from the London music scene include George Michael's Wham!, Kate Bush, Seal, the Pet Shop Boys, Bananarama, Siouxsie and the Banshees, Bush, the Spice Girls, Jamiroquai, Blur, McFly, The Prodigy, Gorillaz, Bloc Party, Mumford & Sons, Coldplay, Amy Winehouse, Adele, Sam Smith, Ed Sheeran, Paloma Faith, Ellie Goulding, One Direction and Florence and the Machine.Walker, Tim (28 July 2008). \"Mumford & Sons, The Luminaire, London\". The Independent. Retrieved 13 October 2012. London is also a centre for urban music. In particular the genres UK garage, drum and bass, dubstep and grime evolved in the city from the foreign genres of house, hip hop, and reggae, alongside local drum and bass. Music station BBC Radio 1Xtra was set up to support the rise of local urban contemporary music both in London and in the rest of the United Kingdom."]}, {"page": "September 14", "response": ["*  1983   – Amy Winehouse, English singer-songwriter (d. 2011)"]}, {"page": "The Rolling Stones", "response": ["The band toured Europe throughout June–August 2007. 12 June 2007 saw the release of the band's second four-disc DVD set: The Biggest Bang, a seven-hour film featuring their shows in Austin, Rio de Janeiro, Saitama, Shanghai and Buenos Aires, along with extras. On 10 June 2007, the band performed their first gig at a festival in 30 years, at the Isle of Wight Festival, to a crowd of 65,000 and were joined onstage by Amy Winehouse. On 26 August 2007, they played their last concert of the Bigger Bang tour at the O2 Arena in London. At the conclusion of the tour, the band had grossed a record-setting $558 million and were listed in the latest edition of Guinness World Records. On 12 November 2007, ABKCO released Rolled Gold: The Very Best of the Rolling Stones, a double-CD remake of the 1975 compilation Rolled Gold. In July 2008 the Rolling Stones left EMI to sign with Vivendi's Universal Music, taking with them their catalogue stretching back to Sticky Fingers. New music released by the band while under this contract was to be issued through Universal's Polydor label. Mercury Records was to hold the US rights to the pre-1994 material, while the post-1994 material was to be handled by Interscope Records (once a subsidiary of Atlantic)."]}, {"page": "United Kingdom", "response": ["The Beatles have international sales of over 1 billion units and are the biggest-selling and most influential band in the history of popular music. Other prominent British contributors to have influenced popular music over the last 50 years include The Rolling Stones, Pink Floyd, Queen, Led Zeppelin, the Bee Gees, and Elton John, all of whom have worldwide record sales of 200 million or more. The Brit Awards are the BPI's annual music awards, and some of the British recipients of the Outstanding Contribution to Music award include; The Who, David Bowie, Eric Clapton, Rod Stewart, The Police, and Fleetwood Mac (who are a British-American band).\"Brit awards winners list 2012: every winner since 1977\". The Guardian (London). Retrieved 28 February 2012. More recent UK music acts that have had international success include George Michael, Oasis, Spice Girls, Radiohead, Coldplay, Arctic Monkeys, Robbie Williams, Amy Winehouse, Adele, Ed Sheeran, One Direction and Harry Styles."]}, {"page": "Whitney Houston", "response": ["Tony Bennett spoke of Houston's death before performing at Davis's party. He said, \"First, it was Michael Jackson, then Amy Winehouse, now, the magnificent Whitney Houston.\" Bennett sang \"How Do You Keep the Music Playing?\" and said of Houston: \"When I first heard her, I called Clive Davis and said, 'You finally found the greatest singer I've ever heard in my life.", "On April 27, 2016, it was announced that Kevin Macdonald would work with the film production team Altitude, producers of the Amy Winehouse documentary film Amy (2015), on a new documentary film based on Houston's life and death. It is the first documentary authorized by Houston's estate. That film, entitled Whitney, premiered at the 2018 Cannes Film Festival and was released internationally in theaters on July 6, 2018."]}, {"page": "2000s", "response": ["R&B also gained prominence throughout the decade, and included artists such as D'Angelo, Aaliyah, Usher, Akon, Black Eyed Peas, R. Kelly, Amy Winehouse, Mary J. Blige, Jamie Foxx, John Legend and Alicia Keys."]}, {"page": "1983", "response": ["* September 14 – Amy Winehouse, British singer (d. 2011)"]}, {"page": "2011", "response": ["** Amy Winehouse, English singer (b. 1983)"]}, {"page": "2010s", "response": ["Several prominent musicians from past decades died in the 2010s, including Ronnie James Dio in 2010, Amy Winehouse in 2011, Whitney Houston and Adam Yauch in 2012, Lou Reed in 2013, Joe Cocker in 2014, B.B. King, Lemmy Kilmister and Ben E. King in 2015, David Bowie, Leonard Cohen, Glenn Frey, Phife Dawg, Prince and George Michael all in 2016, Chuck Berry, Chris Cornell, Prodigy and Tom Petty all in 2017, Aretha Franklin in 2018, and Keith Flint in 2019. There were also several deaths of newer hip hop artists who had started or first became successful in the 2010s, including Capital Steez, Lil Peep, XXXTentacion, Mac Miller, Nipsey Hussle, Juice Wrld and Pop Smoke (who was killed at the beginning of 2020), as well as others."]}, {"page": "Cockney", "response": ["*Amy Winehouse, musician, born in Enfield, raised in Southgate"]}, {"page": "Grammy Award for Song of the Year", "response": ["In many cases, the songwriters were also the performers (Domenico Modugno, Henry Mancini, John Lennon & Paul McCartney, Joe South, Paul Simon, Carole King, Barbra Streisand, Billy Joel, Michael McDonald, Christopher Cross, Sting, Michael Jackson & Lionel Richie, Bobby McFerrin, Eric Clapton, Bruce Springsteen, Seal, Shawn Colvin, Rob Thomas, U2, Alicia Keys, Luther Vandross, John Mayer, Dixie Chicks, Amy Winehouse, Coldplay, Beyoncé, Lady Antebellum, Adele, Fun, Lorde, Sam Smith, Ed Sheeran, Bruno Mars, Childish Gambino, Billie Eilish, and H.E.R.).", "Christopher Cross and Billie Eilish are the only artists to receive the Grammys for Song of the Year as well as Record of the Year, Album of the Year, and Best New Artist in a single ceremony. Adele was the first artist to win the award for Song of the Year, Record of the Year, Album of the Year, and Best New Artist from separate occasions, and first woman to accomplish this feat. Only six artists have won the Song of the Year and Best New Artist awards the same year: Christopher Cross (\"Sailing\" in 1981), Alicia Keys (\"Fallin'\" in 2002), Amy Winehouse (\"Rehab\" in 2008), Fun (\"We Are Young\" in 2013), Sam Smith (\"Stay with Me (Darkchild Version)\" in 2015) and Billie Eilish (\"Bad Guy\" in 2020); Marvin Hamlisch is the only composer to win the Song of the Year and Best New Artist awards the same year in 1975, for \"The Way We Were\".", "|Amy Winehouse ", "|Amy Winehouse"]}]}}