{"wiki_id": "http://www.wikidata.org/entity/Q15864665", "itemLabel": "Frank Wilson", "itemDescription": "actor (1873-1952)", "wikipedia_url": "https://en.wikipedia.org/wiki/Frank_Wilson_(director)", "wikipedia_page": {"main": "Frank Wilson (1873–?), was a British actor, writer and film director. Wilson was a prolific director during the silent era, shooting well over 200 shorts and feature films. He worked at the pioneering Hepworth Pictures in Walton Studios and later at Broadwest of Walthamstow Studios.", "link_mentions": [{"page": "Francis Marion Crawford", "response": ["*A Cigarette-Maker's Romance, directed by Frank Wilson (UK, 1913, based on the novella A Cigarette-Maker's Romance)"]}, {"page": "Frank Wilson", "response": ["Frank Wilson may refer to:", "* Frank Wilson (director) (1873–?), British actor, writer and film director", "* Frank Wilson (Australian actor) (1924–2005), Australian actor", "* Frank Wilson (musician) (1940–2012), songwriter and record producer for Motown Records", "* Frank Wilson (journalist) (born 1941), retired book editor of the Philadelphia Inquirer", "* Frank Wilson (politician) (1859–1918), Premier of Western Australia", "* Frank Wilson (diplomat) (born 1946), New Zealand diplomat", "* Frank Wilson (baseball) (1901–1974), Major League Baseball outfielder", "* Frank Wilson (footballer) (born 1904), Scottish footballer with Hamilton Academical", "* Frank Wilson (umpire) (1890–1928), American baseball umpire", "* Frank Wilson (American football) (born 1973), American college football coach", "* Frank Wilson (rugby, born 1944), rugby union and rugby league footballer of the 1960s and 1970s", "* Frank Wilson (rugby union, born 1885) (1885–1916), New Zealand rugby union player killed in WWI"]}, {"page": "List of British films before 1920", "response": ["| A Midnight Adventure || Frank Wilson || Alma Taylor, Jack Raymond, Harry Royston || Drama ||", "| A Throw of the Dice || Frank Wilson || Alice De Winton, Harry Royston, Stewart Rome || Drama ||", "| The Vicar of Wakefield || Frank Wilson || Chrissie White, Violet Hopson, Harry Royston || Drama ||", "| Creatures of Clay || Frank Wilson || Alice De Winton, Stewart Rome, Jack Raymond || Crime ||", "| The Cry of the Captive || Frank Wilson || Stewart Rome, Violet Hopson, James Lindsay || Drama || ", "| The Heart of Midlothian || Frank Wilson || Flora Morris, Violet Hopson, Alma Taylor, Stewart Rome || Historical ||", "| Justice || Frank Wilson || Alec Worcester, Alma Taylor, Stewart Rome || Crime ||", "| In the Shadow of Big Ben || Frank Wilson || Tom Powers, Alma Taylor, Jack Raymond || Thriller ||", "| The Whirr of the Spinning Wheel || Frank Wilson || Alma Taylor, Stewart Rome, Alice De Winton || Romance ||", "| Her Boy || Frank Wilson || Stewart Rome, Violet Hopson, Lionelle Howard || Drama ||", "| A Lancashire Lass || Frank Wilson || Stewart Rome, Alma Taylor, Tom Powers || Crime ||", "| The Man with the Scar || Frank Wilson || Stewart Rome, Chrissie White, Lionelle Howard || Crime ||", "| The Nightbirds of London || Frank Wilson || Chrissie White, Violet Hopson, Stewart Rome || Crime ||", "| The White Hope || Frank Wilson || Stewart Rome, Violet Hopson, Lionelle Howard || Sports ||", "| A Bunch of Violets || Frank Wilson || Chrissie White, Gerald Lawrence, Violet Hopson || Drama ||", "|The Grand Babylon Hotel||Frank Wilson||Fred Wright, Marguerite Blanche||Thriller||", "| The House of Fortescue || Frank Wilson || Violet Hopson, Lionelle Howard, Stewart Rome || Drama ||", "| The Blindness of Fortune || Frank Wilson || Chrissie White, Lionelle Howard, Violet Hopson || Drama ||", "| The Eternal Triangle || Frank Wilson || Chrissie White, Lionelle Howard, Stewart Rome || Romance ||", "|A Gamble for Love || Frank Wilson || Gerald Ames, James Lindsay, Arthur Walcott || Sports ||", "| Her Marriage Lines || Frank Wilson || Chrissie White, Lionelle Howard, Stewart Rome || Crime ||", "|The House Opposite||Walter West, Frank Wilson||Matheson Lang, Violet Hopson||Drama||", "| The Man Behind 'The Times' || Frank Wilson || Chrissie White, Lionelle Howard, Stewart Rome || Drama ||", "| A Munition Girl's Romance || Frank Wilson || Violet Hopson, Gregory Scott, George Foley || Thriller ||", "|The Ragged Messenger||Frank Wilson ||Violet Hopson, Gerald Ames ||  Drama||", "| The Snare || Frank Wilson || Violet Hopson, George Foley, James Lindsay || Romance ||", "| A Turf Conspiracy || Frank Wilson || Violet Hopson, Gerald Ames, Cameron Carr || Sports||", "| The Woman Wins || Frank Wilson || Violet Hopson, Cameron Carr || Crime ||", "| The Irresistible Flapper || Frank Wilson || Violet Hopson, Ivy Close, Gerald Ames || Comedy ||", "| The Soul of Guilda Lois || Frank Wilson || Violet Hopson, Basil Gill, Cameron Carr || Drama ||"]}, {"page": "The Grand Babylon Hotel", "response": ["In 1916 the novel was adapted into a British film The Grand Babylon Hotel directed by Frank Wilson. In 1920 the title was used by the German filmmaker E.A. Dupont for his thriller The Grand Babylon Hotel. Dupont and Bennett later worked together on the 1929 film Piccadilly."]}, {"page": "The Ragged Messenger", "response": ["The Ragged Messenger is a 1917 British drama film directed by Frank Wilson and starring Violet Hopson, Gerald Ames, Basil Gill and George Foley. It was based on the 1904 novel The Ragged Messenger by W.B. Maxwell. A millionaire's mistress marries his nephew, but their relationship only leads to misery and heartbreak for all.", "Category:Films directed by Frank Wilson"]}, {"page": "The Irresistible Flapper", "response": ["The Irresistible Flapper is a 1919 British silent comedy film directed by Frank Wilson and starring Violet Hopson, Ivy Close and Gerald Ames.BFI.org In the film, a flapper rescues her less worldly-wise sister from social disgrace.", "* Frank Wilson - Vicar", "Category:Films directed by Frank Wilson"]}, {"page": "The Woman Wins", "response": ["The Woman Wins is a 1918 British silent crime film directed by Frank Wilson and starring Violet Hopson, Trevor Bland and Cameron Carr.BFI.org It was based on a novel by Cecil Bullivant.", "Category:Films directed by Frank Wilson"]}, {"page": "The House Opposite (1917 film)", "response": ["The House Opposite is a 1917 British silent drama film directed by Walter West and Frank Wilson and starring Matheson Lang, Violet Hopson and Ivy Close.BFI.org It was based on a play by Perceval Landon."]}, {"page": "With All Her Heart", "response": ["With All Her Heart is a 1920 British silent drama film directed by Frank Wilson and starring Milton Rosmer, Mary Odette and Jack Vincent. It was based on the 1901 novel by the popular writer Charles Garvice. Many reviewers recommended the film on the strength of the original book.Bamford p.80", "Category:Films directed by Frank Wilson"]}, {"page": "List of British films of 1920", "response": ["|With All Her Heart||Frank Wilson||Milton Rosmer, Mary Odette||Drama||"]}, {"page": "List of British films of 1922", "response": ["|The White Hope||Frank Wilson||Violet Hopson, Stewart Rome||Sport||"]}, {"page": "The Grand Babylon Hotel (1916 film)", "response": ["The Grand Babylon Hotel is a 1916 British silent thriller film directed by Frank Wilson and starring Fred Wright, Marguerite Blanche and Gerald Lawrence. It is an adaptation of the 1902 novel of the same title by Arnold Bennett.Goble p.784", "Category:Films directed by Frank Wilson"]}, {"page": "The Winding Road", "response": ["The Winding Road is a 1920 British silent crime film directed by Bert Haldane and Frank Wilson and starring  Cecil Humphreys, Edith Pearson and Annesley Healy.Low p.480 The screenplay concerns an army officer who is cashiered for forgery, but later is granted his freedom after saving a warden from rioting prisoners."]}, {"page": "The Soul of Guilda Lois", "response": ["The Soul of Guilda Lois is a 1919 British silent drama film directed by Frank Wilson and starring Violet Hopson, Basil Gill and Cameron Carr.Low p.455 It is based on a novel by Newman Flower and is often known by the alternative title of A Soul's Crucifixion.", "Category:Films directed by Frank Wilson"]}, {"page": "A Bunch of Violets (play)", "response": ["In 1916 the play was turned into a silent British film A Bunch of Violets directed by Frank Wilson."]}, {"page": "A Bunch of Violets (film)", "response": ["A Bunch of Violets is a 1916 British silent drama film directed by Frank Wilson and starring Chrissie White, Gerald Lawrence and Violet Hopson. It is an adaptation of Sydney Grundy's 1894 play A Bunch of Violets.Gifford p.144", "Category:Films directed by Frank Wilson"]}, {"page": "The Heart of Midlothian (film)", "response": ["The Heart of Midlothian is a 1914 British silent historical film directed by Frank Wilson and starring Flora Morris, Violet Hopson and Alma Taylor. It is an adaptation of Sir Walter Scott's 1818 novel The Heart of Midlothian.Palmer p.521", "Category:Films directed by Frank Wilson"]}, {"page": "Her Boy (1915 film)", "response": ["Her Boy is a 1915 British silent drama film directed by Frank Wilson and starring Stewart Rome, Violet Hopson and Lionelle Howard.Palmer p.367", "Category:Films directed by Frank Wilson"]}, {"page": "Justice (1914 film)", "response": ["Justice is a 1914 British silent crime film directed by Frank Wilson and starring Alec Worcester, Alma Taylor and Stewart Rome.Palmer p.868", "Category:Films directed by Frank Wilson"]}, {"page": "The Vicar of Wakefield (1913 film)", "response": ["The Vicar of Wakefield is a 1913 British silent historical drama film directed by Frank Wilson and starring Violet Hopson, Harry Royston and Chrissie White.Palmer p.900 The film is an adaptation of the 1766 novel The Vicar of Wakefield by the Irish writer Oliver Goldsmith.", "Category:Films directed by Frank Wilson"]}, {"page": "The Nightbirds of London", "response": ["The Nightbirds of London is a 1915 British silent crime film directed by Frank Wilson and starring Stewart Rome, Chrissie White and Violet Hopson.Palmer p.790 It was based on a play by George R. Sims.", "Category:Films directed by Frank Wilson"]}, {"page": "The White Boys (film)", "response": ["The White Boys is a 1916 British silent drama film directed by Frank Wilson and starring Stewart Rome, Chrissie White and Lionelle Howard.Palmer p.367", "Category:Films directed by Frank Wilson"]}, {"page": "A Cigarette-Maker's Romance", "response": ["A Cigarette-Maker's Romance is a 1913 British silent drama film directed by Frank Wilson and starring John Martin Harvey, Nell de Silva and Margaret Yarde.Palmer p.530 It was based on a novella by Francis Marion Crawford which had been turned into a popular stage play by Martin Harvey. A Russian Count has to live in poverty in Munich where he falls in love with a co-worker at the cigarette factory where he is employed.", "Category:Films directed by Frank Wilson"]}, {"page": "Her Marriage Lines", "response": ["Her Marriage Lines is a 1917 British silent crime film directed by Frank Wilson and starring Stewart Rome, Chrissie White and Violet Hopson.Palmer p.884", "* Frank Wilson as Rev. Neville", "Category:Films directed by Frank Wilson"]}, {"page": "The Man Behind 'The Times'", "response": ["The Man Behind 'The Times' is a 1917 British silent crime film directed by Frank Wilson and starring Stewart Rome, Chrissie White and Lionelle Howard.Palmer p.884", "Category:Films directed by Frank Wilson"]}, {"page": "The House of Fortescue", "response": ["The House of Fortescue is a 1916 British silent drama film directed by Frank Wilson and starring Stewart Rome, Violet Hopson and Lionelle Howard.Palmer p.884 An Australian millionaire marries a woman to help save her father's business from ruin.", "Category:Films directed by Frank Wilson"]}, {"page": "A Gamble for Love", "response": ["A Gamble for Love is a 1917 British silent sports film directed by Frank Wilson and starring Gerald Ames, James Lindsay and George Foley.Low p.182 It was based on the 1914 novel of the same title by Nat Gould, set in the horseracing world.", "Category:Films directed by Frank Wilson"]}, {"page": "A Munition Girl's Romance", "response": ["A Munition Girl's Romance is a 1917 British silent thriller film directed by Frank Wilson and starring Violet Hopson, Gregory Scott and George Foley.Palmer p.368 The screenplay concerns a young woman from a wealthy family who goes to work in a munitions factory during the First World War.", "Category:Films directed by Frank Wilson"]}, {"page": "The Snare", "response": ["The Snare is a 1918 British silent romance film directed by Frank Wilson and starring Violet Hopson, George Foley and Trevor Bland.Palmer p.253 The screenplay concerns a woman marries a millionaire who likes to go poaching.", "Category:Films directed by Frank Wilson"]}, {"page": "The Blindness of Fortune", "response": ["The Blindness of Fortune is a 1917 British silent drama film directed by Frank Wilson and starring Chrissie White, Lionelle Howard, and Violet Hopson.Palmer p.368", "Category:Films directed by Frank Wilson"]}, {"page": "Carrots (film)", "response": ["Carrots is a 1917 British silent crime film directed by Frank Wilson and starring Chrissie White, Lionelle Howard and Gerald Lawrence.Palmer p.884 A young female costermonger known as \"Carrots\" helps her policeman boyfriend thwart a criminal gang led by her own brother.", "Category:Films directed by Frank Wilson"]}, {"page": "Daughter of the Wilds", "response": ["Daughter of the Wilds is a 1917 British silent drama film directed by Frank Wilson and starring Chrissie White.Connelly p.338", "Category:Films directed by Frank Wilson"]}, {"page": "The Eternal Triangle (film)", "response": ["The Eternal Triangle is a 1917 British silent romance film directed by Frank Wilson and starring Chrissie White, Stewart Rome and Violet Hopson.Palmer p.884 A woman loves a poor squire's son but marries a much wealthier playwright who is subsequently killed in a car accident.", "Category:Films directed by Frank Wilson"]}, {"page": "The Shadows of a Great City (play)", "response": ["The film was turned into a 1913 British silent film Shadows of a Great City directed by Frank Wilson. In 1915 an American silent version The Shadows of a Great City was made, directed by Blaché himself.Goble p.424"]}, {"page": "Shadows of a Great City", "response": ["Shadows of a Great City is a 1913 British silent crime film directed by Frank Wilson and starring Alec Worcester, Chrissie White and Harry Royston. It is an adaptation of the 1884 play The Shadows of a Great City by Herbert Blaché and Aaron Hoffman. An American film adaptation was made two years later.Goble p.424", "Category:Films directed by Frank Wilson"]}, {"page": "The White Hope (1915 film)", "response": ["The White Hope is a 1915 British silent sports film directed by Frank Wilson and starring Stewart Rome, Violet Hopson and Lionelle Howard.Palmer p.367 It is set in the world of boxing.", "* Frank Wilson as Royce  ", "Category:Films directed by Frank Wilson"]}, {"page": "The White Hope (1922 film)", "response": ["The White Hope is a 1922 British silent sports film directed by Frank Wilson and starring Violet Hopson, Stuart Rome and John MacAndrews.Low p.478 It is a remake of Wilson's own 1915 film of the same name with many of the same cast members.", "* Frank Wilson as Joe Shannon  ", "Category:Films directed by Frank Wilson"]}, {"page": "A Turf Conspiracy (novel)", "response": ["In 1918 the novel served as a basis for the British silent film A Turf Conspiracy directed by Frank Wilson.Goble p.188"]}, {"page": "A Turf Conspiracy (film)", "response": ["A Turf Conspiracy is a 1918 British silent sports crime film directed by Frank Wilson and starring Violet Hopson, Gerald Ames and Joan Legge. It is an adaptation of the 1916 novel of the same name by Nat Gould.Palmer p.856", "* Frank Wilson as Dick Bell ", "Category:Films directed by Frank Wilson"]}, {"page": "A Gamble for Love (novel)", "response": ["In 1917 the novel served as a basis for the British silent film A Gamble for Love directed by Frank Wilson.Goble p.188"]}, {"page": "British silent horror", "response": ["Short silent films had become an increasingly common cinematic form of entertainment during the time of the surge in popularity of gothic horror filmmaking. Such films include Dr. Trimball’s Verdict (1913), directed by Frank Wilson, and The Basilisk (1914), directed by Cecil Hepworth. It is could be suggested that these films drew a focus upon establishing narrative themes of the soul and religious spiritualism that defined early British silent horror films. Later, Will Barker directed the film, The Beetle (1919), that was based on Richard Marsh’s novel, Beetle. Barker's film tells the story of an Egyptian princess whose soul is transformed into a monster and is able to possess the commoners."]}, {"page": "List of Butcher's Film Service films", "response": ["| Face to Face || March 1916 || Frank Wilson ||"]}, {"page": "The Jewel Thieves Outwitted", "response": ["The Jewel Thieves Outwitted is a 1913 silent film short directed by Frank Wilson. It starred Jack Hulcup, Violet Hopson, Rachel de Solla.The Jewel Thieves Outwitted at silentera.com", "Category:Films directed by Frank Wilson"]}, {"page": "Frank Howel Evans", "response": ["Evans is probably best remembered for his \"Old Pawray\" stories featuring the retired French detective Monsieur Jules Poiret, likely an inspiration for Agatha Christie's Hercule Poirot. He also wrote six Sexton Blake stories for The Union Jack and The Penny Popular. One of his stories was filmed as In the Shadow of Big Ben (1914), directed by Frank Wilson and starring Tom Powers, Alma Taylor, and Jack Raymond."]}]}}