{"wiki_id": "http://www.wikidata.org/entity/Q1585983", "itemLabel": "Harold A. Wilson", "itemDescription": "British athlete (1885-1932)", "wikipedia_url": "https://en.wikipedia.org/wiki/Harold_A._Wilson", "wikipedia_page": {"main": "Harold Allan Wilson (22 January 1885 – 17 May 1932) was an English runner. Born in Horncastle, Lincolnshire he was a member of the Hallamshire Harriers in Sheffield. He competed at the 1908 Summer Olympics in London and won a team gold in the 3 mile and an individual silver in the 1500 metres race. He was the first man to run a sub four minute 1,500 metres, with a time of 3:59.8 in May 1908.At the 1908 Olympics Wilson won his 1500 m semi-final in a time of 4:11.4; his time in the final was 4:03.6, fractions of a second behind Melvin Sheppard. He was also part of Britain's five-man gold medal-winning team in the three-mile race. He was Britain's fourth man home in fifth place overall. His teammates were Archie Robertson, Norman Hallows, Joe Deakin and William Coales.The following year, Wilson was in Queens, New York, competing alongside Sheppard. He spent the 1909 season in the U.S., and was considered one of the best mile runners. The same year he turned professional and raced in Australia and South Africa. On 29 November 1915 he enlisted as a Private in the West Yorkshire Regiment, serving overseas during World War I. He later emigrated to South Africa, where he died in 1932 aged 47.", "link_mentions": [{"page": "King's College London", "response": ["The Faculty of Natural and Mathematical Sciences was established in 2010, following the reorganisation of the School of Physical Sciences and Engineering. It was renamed in February 2021 to incorporate the return of engineering as a major discipline. The faculty provides education and research in chemistry, informatics, physics, mathematics, engineering and telecommunications. Physics and Mathematics has been studied at the university since 1829 and 1830 respectively, and there are six Nobel laureates who were either students or academic staff of the faculty. Most notably, its teaching of experimental Physics is the oldest in England having fostered the professorships of James Clerk Maxwell, Harold A. Wilson, Charles Glover Barkla, Sir Owen Richardson, Sir Edward Appleton and Sir Charles Ellis, three of whom became Nobel laureates."]}, {"page": "Horncastle", "response": ["*Harold A. Wilson (1885–1932), 1908 Olympic athlete, was the first to run an under four-minute 1500 metres."]}, {"page": "Athletics at the 1908 Summer Olympics – Men's 1500 metres", "response": ["This was the fourth appearance of the event, which is one of 12 athletics events to have been held at every Summer Olympics. The only runner from 1904 to return was the champion, Jim Lightbody. Unlike the previous two Games, the field included some top runners in 1908. Harold A. Wilson had broken the world record in the British Olympic trials. His countryman George Butterfield had won the AAA one-mile title through 1905–07. John Halstead, Mel Sheppard, and Lightbody were among the top American runners."]}, {"page": "Athletics at the 1908 Summer Olympics – Men's 3 miles team race", "response": ["|align=left| Harold A. Wilson ||align=left|  || 15:05.6 || ", "| 5 ||align=left| Harold A. Wilson ||align=left|  || 14:57.0 || "]}, {"page": "Harold Wilson (disambiguation)", "response": ["* Harold A. Wilson (1885–1916), British track Olympian, 1500 m silver medalist in 1908", "* Harold A. Wilson (physicist) (1874–1964), English physicist"]}, {"page": "Great Britain at the 1908 Summer Olympics", "response": ["|rowspan=10 align=left| Men's 1500 metres ||bgcolor=silver| 2nd ||align=left| Harold A. Wilson ||rowspan=10 bgcolor=lightgray| None held || Unknown  1st, semifinal 7 || 4:03.6", "|rowspan=2| No place ||align=left| Harold A. Wilson || 15:05.6  No score, team=6 || 14:57.0  No score, team=6"]}, {"page": "Harold Allan Wilson", "response": ["#REDIRECT Harold A. Wilson"]}, {"page": "List of people with surname Wilson", "response": ["** Harold A. Wilson (physicist) (1874–1964), English physicist", "** Harold A. Wilson (1885–1916), British track Olympian, 1500 m silver medalist in 1908"]}, {"page": "Harold Wilson (athlete)", "response": ["#REDIRECT Harold A. Wilson"]}, {"page": "January 21", "response": ["*  1885   – Harold A. Wilson, English runner (d. 1932)"]}, {"page": "List of British champions in 1500 metres", "response": ["|Harold A. Wilson"]}]}}