{"wiki_id": "http://www.wikidata.org/entity/Q15830186", "itemLabel": "Caroline Stephen", "itemDescription": "English philanthropist, writer on Quakerism", "wikipedia_url": "https://en.wikipedia.org/wiki/Caroline_Stephen", "wikipedia_page": {"main": "Caroline Emelia Stephen (8 December 1834 – 7 April 1909), also known as Milly Stephen, was a British philanthropist and a writer on Quakerism. Her niece was Virginia Woolf.", "link_mentions": [{"page": "James Fitzjames Stephen", "response": ["James Fitzjames Stephen was born on 3 March 1829 at Kensington Gore, London, the third child and second son of Sir James Stephen and Jane Catherine Venn. Stephen came from a distinguished family. His father, the drafter of the Slavery Abolition Act 1833, was Permanent Under-Secretary of State for the Colonies and Regius Professor of Modern History at Cambridge. His grand-father James Stephen and uncle George Stephen were both leading anti-slavery campaigners. His younger brother was the author and critic Sir Leslie Stephen, whilst his younger sister Caroline Stephen was a philanthropist and a writer on Quakerism. Through his brother Leslie Stephen, he was the uncle of Virginia Woolf, He was also a cousin of the jurist A.V. Dicey."]}, {"page": "Jane Senior", "response": ["In Clapham, Senior knew Marianne Thornton, figure of the Clapham Sect and daughter of Henry Thornton, and her niece Henrietta Synnot, both of whom were involved in local schooling. Synnot became her assistant. Caroline Stephen made a very positive impression, and was an influence for the future. In the aftermath of the \"Eyre controversy\", she made a point of inviting Emelia Russell Gurney, wife of Russell Gurney, to show her Jamaica sketches."]}, {"page": "Caroline Emilia Stephen", "response": ["#REDIRECT Caroline Stephen"]}, {"page": "Caroline Emelia Stephen", "response": ["#REDIRECT Caroline Stephen"]}, {"page": "Katharine Stephen", "response": ["Katharine Stephen was born in London on 26 February 1856, the daughter of Mary Richenda Cunningham (1829–1912) and James Fitzjames Stephen (1829–1894), a judge. She was the niece of Caroline Stephen and of Leslie Stephen and the cousin of Virginia Woolf and Vanessa Bell.", "Stephen died of cancer on 16 June 1924 at her home in South Kensington. Stephen was loyal to her family. Every day she would either see her mother or write her a letter. Her aunt, Caroline Stephen, was another relative; she was a friend too. Caroline came to live in Cambridge in 1895 where she evangelised her Quaker beliefs to Newnham students.Margaret M. Jensen, \"Stephen, Caroline Emelia (1834–1909)\", Oxford Dictionary of National Biography, Oxford University Press, 2004; online edn, May 2014 accessed 10 Dec 2015 Caroline's final book contained a biography written by Katherine."]}, {"page": "Robert Howard Hodgkin", "response": ["Despite his Quaker roots, Hodgkin supported the Second Boer War, joining the 1st V.B. Northumberland Fusiliers. In 1900, he wrote to the Quaker magazine The Friend, claiming many members of the movement—known as the Society of Friends—shared his views but hid behind the Quakers' pacifist stance, \"bringing on the Society the shadow of hypocrisy\". His father also supported the war, rankling other Quakers, and causing John Wilhelm Rowntree to write to Rufus Jones in indignation, claiming that \"[y]ou would hardly believe your eyes if you came over here. Thos. Hodgkin's son a Lieutenant, though still a nominal Quaker, heads a procession to burn Kruger in effigy, T. Hodgkin makes the speech and Lily [Lucy?] Hodgkin lights the faggots ... the spirit of war, stalks the land naked, unashamed & our leading Quaker gives his benediction!\" Not all agreed; Caroline Stephen wrote to Robert Hodgkin's mother that there was \"much of nobleness ... much that appeals to all one's best feelings\" in what he had done. Hodgkin was ultimately forced to leave the Society of Friends due to his military service in the Second Boer War. Later, during the First World War years of 1914 to 1919, he would return to the regiment as a captain in the Seventh Battalion. He was at the War Office from 1917 to 1919, serving in the General Staff for Operations."]}]}}