{"wiki_id": "http://www.wikidata.org/entity/Q15857744", "itemLabel": "Gemma Jackson", "itemDescription": "Production designers", "wikipedia_url": "https://en.wikipedia.org/wiki/Gemma_Jackson", "wikipedia_page": {"main": "Gemma Jackson is a British production designer who has worked on both television and film. She has won two Emmys, one for the television show Game of Thrones and the other for the mini-series John Adams.\nShe was nominated at the 77th Academy Awards in the category of Best Art Direction for her work on the film Finding Neverland. She shared her nomination with Trisha Edwards.She is married to production designer Andrew McAlpine.", "link_mentions": [{"page": "Academy Award for Best Production Design", "response": ["| Gemma Jackson"]}, {"page": "World of A Song of Ice and Fire", "response": ["To depict Winterfell, both the pilot and season 1 of the television adaptation used the 16th century clock tower and ancient courtyard of Castle Ward in County Down, Northern Ireland. Doune Castle in Stirling, Scotland, which was previously featured as Castle Anthrax in the film Monty Python and the Holy Grail, was also used for exterior scenes. Saintfield Estates stood in as Winterfell's godswood, an enclosed wooded area where characters can worship the old gods beside trees with faces carved in their bark. A car park stood in for Winterfell's courtyard, and a wine cellar was used to depict the Stark family crypt. Tollymore Forest featured prominently in the prologue of the pilot episode and in the pivotal scene where the Starks first find the direwolves. Cairncastle, meanwhile, served as the location where Ned Stark beheads the deserter Will. The interior of Winterfell, such as the Tower of the First Keep, the Great Hall, and Catelyn's bedchamber, were filmed at The Paint Hall studio. Set designer Gemma Jackson said, \"Winterfell was based on a Scottish castle.\"", "For the CGI compositions of the Vale of Arryn in the TV series, as seen in the establishing shot of the Eyrie and from the sky cells, the visual effects team used images and textures from the Greek rock formations of Meteora. Initially they had been considering the Zhangjiajie Mountains in China, but because the landscape base plates were shot in Northern Ireland, using Meteora resulted a better option. Set designer Gemma Jackson said, \"A lot of the mosaics in the Eyrie were based on a beautiful chapel I visited in Rome.\" The interior of the High Hall of the Arryns was filmed at The Paint Hall, occupying one of the four soundstages there. Martin acknowledged that the set differed significantly from its presentation in the books: \"In the books, the room is long and rectangular. But [The Paint Hall soundstage] had essentially a square space, which they chose to put a round hall in, with a staircase curving up to a throne that was high above.\"", "The Red Keep interior are filmed at Belfast's studio The Paint Hall. Set designer Gemma Jackson said, \"When I was thinking about King's Landing, the whole red aspect of it, that immediately made me think of Rajasthan. The floor [at King's Landing] was from the Pantheon in Rome.\" Martin said that \"Our throne room is a spectacular throne room – we actually redressed a throne room built for [another] film. And again, it occupied a quarter of the Paint Hall, so it's very big, but in my mind [in the books], it's Westminster Abbey, it's St. Paul's Cathedral.\""]}, {"page": "Brad Renfro", "response": ["During Renfro's early career, his worldliness and self-confidence caused many adults who came into contact with him to believe that he was some years older than his actual age. Gemma Jackson, production designer on Tom and Huck, remembered Renfro as being 15 or 16 years of age during filming when he was actually 13. Jackson recounted to BuzzFeed that during production, Renfro had a girlfriend who was several years his senior. Renfro developed an ardent following among adolescent girls; Peter Horton, director of The Cure, recalled that the actor—who had just turned 12—received cards from local girls that contained sexually suggestive messages."]}, {"page": "Finding Neverland (film)", "response": ["| Art Direction: Gemma Jackson; Set Decoration: Trisha Edwards", "| Gemma Jackson"]}, {"page": "77th Academy Awards", "response": ["** Finding Neverland – Art Direction: Gemma Jackson; Set Decoration: Trisha Edwards"]}, {"page": "Gemma (given name)", "response": ["* Gemma Jackson (born 1951), British production designer"]}, {"page": "58th British Academy Film Awards", "response": ["* Finding Neverland – Gemma Jackson"]}, {"page": "Art Directors Guild Awards 2004", "response": ["**Gemma Jackson – Finding Neverland"]}, {"page": "BAFTA Award for Best Production Design", "response": ["| Finding Neverland || Gemma Jackson"]}, {"page": "John Adams (miniseries)", "response": ["| Gemma Jackson, David Crank, Christina Moore, Kathy Lucas and Sarah Whittle"]}, {"page": "Jackson (name)", "response": ["*Gemma Jackson (born 1951), British art director"]}, {"page": "ADG Excellence in Production Design Awards", "response": ["* 2012: Game of Thrones (for \"The Ghost of Harrenhal\") by production designer Gemma Jackson", "* 2013: Game of Thrones (for \"Valar Dohaeris\") by production designer Gemma Jackson", "*2008: John Adams by production designer Gemma Jackson"]}, {"page": "Art Directors Guild Awards 2008", "response": ["*Gemma Jackson – John Adams"]}, {"page": "List of British Academy Award nominees and winners", "response": ["| Gemma Jackson"]}, {"page": "AACTA Award for Best Production Design", "response": ["| style=\"background:#ffff80;\"|Gemma Jackson"]}, {"page": "Art Directors Guild Award for Excellence in Production Design for a Fantasy Film", "response": ["| Finding Neverland ‡ || Gemma Jackson", "| Aladdin ||  Gemma Jackson"]}, {"page": "Art Directors Guild Award for Excellence in Production Design for a Period Film", "response": ["| Finding Neverland ‡ || Gemma Jackson"]}, {"page": "Motley Theatre Design Course", "response": ["* Gemma Jackson Academy Award & BAFTA nominated production designer Finding Neverland, John Adams, Bridget Jones' Diary, Bridget Jones: The Edge of Reason, Iris, The Borrowers"]}, {"page": "A Golden Crown", "response": ["|scope=\"row\"| Gemma Jackson"]}, {"page": "GameCity Prize", "response": ["*Gemma Jackson"]}, {"page": "Game of Thrones (season 2)", "response": ["|scope=\"row\"| Gemma Jackson, Frank Walsh, and Tina Jones for \"Garden of Bones\", \"The Ghost of Harrenhal\" and \"A Man Without Honor\"", "|scope=\"row\"| Gemma Jackson for \"The Ghost of Harrenhal\""]}, {"page": "The Ghost of Harrenhal", "response": ["|scope=\"row\"| Gemma Jackson, Frank Walsh, and Tina Jones", "|scope=\"row\"| Gemma Jackson"]}, {"page": "List of awards and nominations received by Game of Thrones", "response": ["| data-sort-value=\"Jackson, Gemma\"| Gemma Jackson (for \"A Golden Crown\")", "| data-sort-value=\"Jackson, Gemma\"| Gemma Jackson (for \"The Ghost of Harrenhal\")", "| data-sort-value=\"Jackson, Gemma\"| Gemma Jackson (for \"Valar Dohaeris\")", "| data-sort-value=\"Jackson, Gemma\"| Gemma Jackson, Frank Walsh, and Tina Jones (for \"Garden of Bones\", \"The Ghost of Harrenhal\", and \"A Man Without Honor\")", "| data-sort-value=\"Jackson, Gemma\"| Gemma Jackson, Frank Walsh, and Tina Jones (for \"Valar Dohaeris\")"]}, {"page": "Valar Dohaeris", "response": ["|scope=\"row\"| Gemma Jackson, Frank Walsh, and Tina Jones", "|scope=\"row\"| Gemma Jackson"]}, {"page": "Trisha Edwards", "response": ["Trisha Edwards is an Academy Award-nominated set decorator. She was nominated at the 77th Academy Awards in the category of Best Art Direction for her work on the film Finding Neverland. She shared her nomination with Gemma Jackson."]}, {"page": "Art Directors Guild Awards 2011", "response": ["** Gemma Jackson – Game of Thrones (for \"A Golden Crown\")"]}, {"page": "Art Directors Guild Awards 2012", "response": ["*Gemma Jackson – Game of Thrones (for \"The Ghost of Harrenhal\")"]}, {"page": "Art Directors Guild Awards 2013", "response": ["* Gemma Jackson – Game of Thrones (for \"Valar Dohaeris\")"]}, {"page": "Saturn Award for Best Production Design", "response": ["| Gemma Jackson"]}, {"page": "Primetime Emmy Award for Outstanding Art Direction for a Single-Camera Series", "response": ["| Gemma Jackson, Frank Walsh, Tina Jones", "| Gemma Jackson, Andy Thomson, Rob Cameron"]}, {"page": "Primetime Emmy Award for Outstanding Art Direction for a Miniseries or Movie", "response": ["| Gemma Jackson, David Crank, Christina Moore, Kathy Lucas, Sarah Whittle"]}, {"page": "Aladdin (2019 film)", "response": ["Principal photography began on September 6, 2017, at Longcross Studios in Surrey, England, and wrapped on January 24, 2018. Part of the film was shot in Wadi Rum Desert, Jordan. The Royal Film Commission provided support to the production during filming and assisted in facilitating logistics. Reshoots took place during August 2018.Guy Ritchie's Aladdin cast called back to London for reshoots – report  Star UK, Retrieved October 6, 2018 The film's production sets were designed by Game of Thrones production designer Gemma Jackson. The \"Prince Ali\" musical sequence features 1,000 dancers and extras. Smith frequently improvises throughout the film. Massoud also revealed that there was a whole scene, where Prince Ali and Genie meet the royal family for the first time, that was improvised by the cast.", "| Gemma Jackson", "| Gemma Jackson"]}, {"page": "List of female Academy Award winners and nominees for non-gendered categories", "response": ["| Gemma JacksonTrisha Edwards"]}, {"page": "Art Directors Guild Award for Excellence in Production Design for a Television Movie or Limited Series", "response": ["| Gemma Jackson (production designer); David Crank, Christina Moore (supervising art directors); John P. Goldsmith, Tibor Lázár (art directors); Dan Kuchar, Michael H. Ward (assistant art directors); Ted Haigh (graphic designer); Richard Salinas (lead scenic); Kathy Lucas (set decorator U.S.A.); Sarah Whittle (set decorator Hungary)"]}, {"page": "The Nevers", "response": ["In the fifth episode, the character Effie Boyle is introduced. Effie is revealed to be one of Maladie's victims, with the Effie seen in the episode being Maladie herself in disguise. In order to create the illusion of Maladie posing as Effie, Amy Manson used makeup, wore a fat suit and then the look was altered in post-production using Computer-generated imagery. In an attempt to fool the audience, a fake name \"Margaret Tuttle\" was added to IMDb as the actress playing Effie. Executive producers include Bernadette Caulfield, Jane Espenson, and Doug Petrie. Espenson and Petrie, who worked with Whedon on Buffy the Vampire Slayer, will serve as writers. Laurie Penny is also part of the series' writing staff. Gemma Jackson serves as production designer. Academy Award winner Christine Blundell served as the hair and makeup designer. She said that inspiration came from modern-day punk in order to help with the visual world of the series. In June 2021, HBO announced that Andrew Bernstein had joined the series as an executive producer and director."]}, {"page": "Art Directors Guild Award for Excellence in Production Design for a One-Hour Contemporary Single-Camera Series", "response": ["| Gemma Jackson (production designer); Thomas Brown, Paul Inglis, Tom McCullagh (art directors); Ashleigh Jeffers (assistant art director); Heather Greenlees (set designer); Kimberley Pope (illustrator); Jim Stanes (graphic designer); Rohan Harris (scenic artist); William Simpson (storyboard artist); Richard Roberts (set decorator)", "| Gemma Jackson (production designer); Heather Greenlees, Ashleigh Jeffers, Tom McCullagh, Andy Thomson, Frank Walsh (art directors); Sara-Jo Baugh (assistant art director); Brendan Rankin (set designer); Kimberley Pope (illustrator); Michael Eaton (graphic designer); Rohan Harris (scenic artist); Tina Jones (set decorator)", "| Gemma Jackson (production designer); Christina Moore (supervising art director - Morocco); Andy Thomson (supervising art director); Heather Greenlees, Ashleigh Jeffers, Tom Still (art directors); Mark Lowry, Brendan Rankin, Caireen Todd (assistant art directors); Max Berman, Steve Summersgill (concept artists); Michael Eaton (graphic designer); Rohan Harris (scenic artist); William Simpson (storyboard artist); Rob Cameron (set decorator)"]}, {"page": "Art Directors Guild Award for Excellence in Production Design for a One-Hour Period or Fantasy Single-Camera Series", "response": ["| Gemma Jackson (production designer); Thomas Brown, Paul Inglis, Tom McCullagh (art directors); Ashleigh Jeffers (assistant art director); Heather Greenlees (set designer); Kimberley Pope (illustrator); Jim Stanes (graphic designer); Rohan Harris (scenic artist); William Simpson (storyboard artist); Richard Roberts (set decorator)", "| Gemma Jackson (production designer); Heather Greenlees, Ashleigh Jeffers, Tom McCullagh, Andy Thomson, Frank Walsh (art directors); Sara-Jo Baugh (assistant art director); Brendan Rankin (set designer); Kimberley Pope (illustrator); Michael Eaton (graphic designer); Rohan Harris (scenic artist); Tina Jones (set decorator)", "| Gemma Jackson (production designer); Christina Moore (supervising art director - Morocco); Andy Thomson (supervising art director); Heather Greenlees, Ashleigh Jeffers, Tom Still (art directors); Mark Lowry, Brendan Rankin, Caireen Todd (assistant art directors); Max Berman, Steve Summersgill (concept artists); Michael Eaton (graphic designer); Rohan Harris (scenic artist); William Simpson (storyboard artist); Rob Cameron (set decorator)"]}, {"page": "45th Saturn Awards", "response": ["** Gemma Jackson – Aladdin"]}, {"page": "List of invitees for AMPAS Membership (2005)", "response": ["*Gemma Jackson"]}, {"page": "Art Directors Guild Awards 2019", "response": ["** Gemma Jackson – Aladdin"]}, {"page": "Pilot (The Nevers)", "response": ["Gemma Jackson served as the production designer for the show. She commented, \"I read the script and took lots of images when I went to see him [Whedon], and I hit the spot with my research. Joss loved my ideas about the Galanthi [the aliens that help humanity], which had never been seen before. I think that made him excited. We started to talk about this world with these people having extraordinary things happen to them. It wasn't a straightforward process, ideas developed organically.\""]}]}}