{"wiki_id": "http://www.wikidata.org/entity/Q1588089", "itemLabel": "Alfred Strange", "itemDescription": "English footballer (1900-1978)", "wikipedia_url": "https://en.wikipedia.org/wiki/Alfred_Strange", "wikipedia_page": {"main": "Alfred Henry Strange (2 April 1900 – October 1978) was an English footballer who played most of his career as a half back with Sheffield Wednesday. He won 20 caps for England, including three as captain.\nHe began his career at Portsmouth, helping \"Pompey\" to win the Third Division South title in 1923–24. He then transferred to Port Vale, and impressed at the club enough to win a move to Sheffield Wednesday in February 1927. He spent eight years with the club, helping Wednesday to win the First Division title in 1928–29 and 1929–30. He ended his professional career at Bradford Park Avenue in 1936. Over the course of his 14 years in the Football League he scored 63 goals in 382 league appearances. He spent a brief spell as manager of Bedford Town after World War II.", "link_mentions": [{"page": "April 2", "response": ["*  1900   – Alfred Strange, English footballer (d. 1978)"]}, {"page": "Neil Dewar", "response": ["Dewar signed for Third Lanark after a successful trial in October 1929, shortly before his 21st birthday. In his debut season he scored 40 goals for the club and followed by helping the club to win the Second Division title in 1930–31. Third Lanark made a significant impact in the First Division the following season, finishing in fourth place. Dewar again showed impressive form, scoring 35 goals in 37 games for Thirds, and was rewarded with three Scotland caps. His international debut was a 3–0 defeat to England on 9 April 1932, in which he faced future team-mates Alfred Strange and Ernie Blenkinsop. In his second appearance for Scotland, the 3–1 win over France in an International Challenge Match the following month, Dewar scored a hat-trick. He was also on the score-sheet in what transpired to be his final Scotland appearance, a 5–2 defeat to Wales on 26 October 1932."]}, {"page": "Strange (surname)", "response": ["*Alfred Strange (1900–1978), English footballer"]}, {"page": "Alf Strange", "response": ["#REDIRECT Alfred Strange"]}, {"page": "Joe Schofield", "response": ["He brought in veteran Everton goalkeeper Tom Fern, young half-back Sidney Blunt, and Stoke winger Billy Tempest for the 1924–25 season. After a difficult start to the season fans became impatient, and Len Birks was sold to Sheffield United for 'a substantial sum', whilst Alfred Strange was brought in from Portsmouth. Vale won ten of their first thirteen league games in 1925, with striker Wilf Kirkham proving to be prolific. The \"Valiants\" finished in eighth, fifteen points behind second-placed Manchester United."]}, {"page": "Harry Anstiss", "response": ["Anstiss played for Hammersmith Athletic, before joining Brentford, Millwall, Watford, Rochdale and Sheffield Wednesday, before joining Port Vale in February 1927, along with 'a substantial financial consideration' in exchange for Alfred Strange. Strange went on to become an England international, but Anstiss did not head in the same direction. He had a great start to his Vale career though, scoring on his debut at The Old Recreation Ground in a 6–2 win over Notts County on 26 February. He went on to score a hat-trick in a 7–1 home win over Fulham on 2 April, and claimed 11 goals in 15 Second Division games in the 1926–27 campaign. This was the end of his purple patch, as he scored five goals in 32 games in the 1927–28 season. Injury brought him down in November 1928, and limited him to three goals in 17 matches in the 1928–29 relegation season. He scored 15 goals in 37 appearances in the 1929–30 season, as the \"Valiants\" were crowned champions of the Third Division North. He fell from favour in October 1930 and was limited to six goals in 17 games in the 1930–31 season. He was transferred to Swansea Town in May 1931. Later he played for Crewe Alexandra, Gillingham, Tunbridge Wells Rangers and Cray Wanderers."]}, {"page": "Alfred Henry Strange", "response": ["#REDIRECT Alfred Strange"]}, {"page": "1924–25 Port Vale F.C. season", "response": ["The season started with a lose-one-win-one sequence of six games; significantly, the final game of this sequence was a 1–0 win over Stoke at the Victoria Ground, Bob Connelly scoring the goal. The \"Valiants\" followed this with five games without a win, and \"a certain section of the crowd\" became \"prone to gibe and jeer at mistakes\", which had a noticeable effect on the side's confidence. Goals were a problem, and so the directors took the decision to sell full-back Len Birks to Sheffield United for 'a substantial sum', promising to spend the money on forwards. They duly signed Alfred Strange from Portsmouth.", "|align=\"left\"|MF||align=\"left\"| Alfred Strange", "|3||MF||||Alfred Strange||4||3||7", "| 1924 || MF ||  || Alfred Strange || Portsmouth || Free transfer || "]}, {"page": "1925–26 Port Vale F.C. season", "response": ["During the mid-season Vale suffered indifferent form, winning at home but losing away. The cold weather was blamed for the low crowds, and the selling of players was considered. Kirkham's form also suffered, as Vale found difficulty in finding the net. In January the club celebrated its Golden jubilee, this established 1876 as their founding date despite some doubts over the exact year of the club's founding. On the pitch, the club went down 4–0 at Darlington. This defeat was followed by a sequence of seven wins in eight games, including a 5–0 win over Blackpool thanks to four goals from Alfred Strange. The team also picked up two rare away wins, including a 2–0 victory at eventual champions The Wednesday. However in March, young right-back Tom Cooper was sold to eventual promotion-winners Derby County for £2,500. Cooper would later play for Liverpool and England.", "|align=\"left\"|MF||align=\"left\"| Alfred Strange", "|2||MF||||Alfred Strange||17||0||17"]}, {"page": "1926–27 Port Vale F.C. season", "response": ["In January, Alfred Strange felt unsettled and so was transferred to The Wednesday in exchange for Harry Anstiss and an unknown sum of money. Strange would later win twenty caps for England in his 30s, whereas Anstiss settled in well at the Vale, scoring eleven goals in fifteen league games during his debut season. Meanwhile, injuries occasionally savaged the Vale team, with even Jack Lowe being forced to end his run of 123 consecutive games after spraining his ankle. As the season drew to a close secretary Joe Schofield was made manager, meaning he was better able to work with the younger players.", "|align=\"left\"|MF||align=\"left\"| Alfred Strange", "|7||MF||||Alfred Strange||4||1||0||5", "| February 1927 || MF ||  || Alfred Strange || Sheffield Wednesday || 'Substantial' ||"]}, {"page": "1922–23 Southampton F.C. season", "response": ["Outside of the league and the FA Cup, Southampton played five additional first-team matches during the 1922–23 season. The first was a friendly match against First Division side Arsenal on 16 October 1922, which was a benefit for centre-half Alec Campbell. The high-scoring game ended in a 5–3 win for the Gunners, with the Saints scoring through Bill Rawlings (twice) and Arthur Dominy. The second friendly of the season was another benefit game – this time for long-serving manager Jimmy McIntyre – at home to local rivals Portsmouth in December. The visitors won the game 3–1 through goals from Dave Watson, Jerry Mackie and Alfred Strange, with Rawlings scoring the only goal for the Saints, who were described by the Southampton Times as displaying a \"don't care attitude\" towards the game."]}]}}