{"wiki_id": "http://www.wikidata.org/entity/Q1586771", "itemLabel": "Harry Ryan", "itemDescription": "English racing cyclist", "wikipedia_url": "https://en.wikipedia.org/wiki/Harry_Ryan_(cyclist)", "wikipedia_page": {"main": "Harry Edgar Ryan (21 November 1893 – 14 April 1961) was a British track cycling racer. Ryan came second in the world amateur sprint championship in 1913. He competed at the 1920 Summer Olympics and won the tandem competition with Thomas Lance, as well as a bronze medal in the sprint.Ryan lived at 312 Euston Road, St Pancras, London in 1901. His father was a cutler, toolmaker and shopkeeper of Buck & Ryan. After retiring from competitions Ryan converted Buck & Ryan into a successful concern. He also became a prominent cycling administrator, supervising most of the major competitions in Europe.", "link_mentions": [{"page": "List of British cyclists", "response": ["* Harry Ryan"]}, {"page": "Great Britain at the 1920 Summer Olympics", "response": ["| Harry Ryan", "| Thomas Lance  Harry Ryan"]}, {"page": "Maurice Peeters", "response": ["In 1920, Peeters became amateur world champion in track cycling. One day later he rode the Olympic 1000 m sprint, and of course he was considered a favourite. He lost in the first round, but his second place was enough to progress to the next round. He then won the quarter final and the semi-final. In the final, he rode against two British cyclists, Harry Ryan and Tiny Johnson. They tried to make use of their numerical advantage, and Ryan attacked, so that Peeters had to get him back. In the final corner, Johnson should came around the corner to win the race, but Peeters was ahead and kept his lead.Description of the 1920 Olympic race  After having won the gold medal at the 1920 Summer Olympics in Antwerp (1000 m sprint), making him the first Dutch individual Olympic champion, he captured the bronze medal four years later in the 2000 m tandem competition, alongside Gerard Bosch van Drakestein."]}, {"page": "Cycling at the 1920 Summer Olympics – Men's sprint", "response": ["The men's sprint event was part of the track cycling programme at the 1920 Summer Olympics. There were 37 competitors from 11 nations, with each nation apparently limited to four cyclists (down from 12 the last time the event was held, in 1908). The event was won by Maurice Peeters of the Netherlands, the nation's first victory in the men's sprint. Two British cyclists, Thomas Johnson and Harry Ryan, were in the final as well, taking silver and bronze.", "One day before the Olympic tournament, Peeters had become amateur world champion in track cycling. One day later he rode the Olympic 1000 m sprint, and of course he was considered a favourite. He lost in the first round, but his second place was enough to progress to the next round. He then won the quarter final and the semi-final. In the final, he rode against two British cyclists, Harry Ryan and Tiny Johnson. They tried to make use of their numerical advantage, and Ryan attacked, so that Peeters had to get him back. In the final corner, Johnson tried to come around the corner to win the race, but Peeters was ahead and kept his lead. The British team protested the race, arguing that Peeters had obstructed Johnson by forcing him up the bank, but the protest was denied.", "Albert White, Harry Ryan (cyclist), and Maurice Peeters also tied the old record, but after Johnson had set a new one.", "| 1 ||align=left| Harry Ryan ||align=left|  || 13.2 || ", "| 1 ||align=left| Harry Ryan ||align=left|  || 12.8 || ", "| 1 ||align=left| Harry Ryan ||align=left|  || 12.6 || ", "|  ||align=left| Harry Ryan ||align=left|  || 15.1"]}, {"page": "Thomas Lance", "response": ["Thomas \"Tommy\" Glasson Lance (14 June 1891 – 29 February 1976) was a British track cycling racer. He won the tandem competition with Harry Ryan at the 1920 Summer Olympics. He also competed in the sprint event but was eliminated in the repechage."]}, {"page": "Thomas Johnson (cyclist)", "response": ["At the 1920 Summer Olympics held in Antwerp, he won the silver medal after finishing second in the 1,000 metre individual sprint with a time of 15.1 seconds, identical to Harry Ryan who was awarded the bronze medal. The following day, 10 August, Johnson was a member of the British team in the Men's team pursuit. The team, which also included Cyril Alden, William Stewart, and Albert White, finished in the silver medal position with a time of 5 minutes 13.8 seconds."]}, {"page": "Harry Ryan", "response": ["Harry Ryan may refer to:", "* Harry Ryan (cyclist) (1893–1961), British track cycling racer", "* Harry Ryan (hurler) (born 1957), Irish retired hurler", "* Harry Ryan (American football) (died 1953), early professional American football player"]}, {"page": "1913 UCI Track Cycling World Championships", "response": ["| William Bailey   || Harry Ryan    || Christel Rode"]}]}}