{"wiki_id": "http://www.wikidata.org/entity/Q15996859", "itemLabel": "Robert Backhouse", "itemDescription": "British archer", "wikipedia_url": "https://en.wikipedia.org/wiki/Robert_Backhouse", "wikipedia_page": {"main": "Robert Ormston Backhouse (10 March 1854 – 10 April 1940) was a British archer who competed at the 1908 Summer Olympics in London. He and his wife, Sarah Dodgson were also known for producing new varieties of daffodils and lilies.\nHe was born in Darlington, County Durham and died in Sutton St Nicholas, Herefordshire.Backhouse entered the double York round event in 1908, taking 13th place with 516 points. He also shot a round in the manner of the Continental style event, but as a demonstration rather than in the actual competition.  He scored 260 points, which would have given him a silver medal if his competition had been official.  Backhouse received a Diploma of Merit for his effort in the Continental style.", "link_mentions": [{"page": "Archery at the 1908 Summer Olympics – Men's Continental style", "response": ["Just as the British dominated the York round archery, the French dominated the Continental-style. The one Briton to formally enter placed 12th, while the American placed 15th. However, \"several\" of the British archers who had competed in the double York round event also joined in the shooting for this event without competing for medals. One, Robert Backhouse, shot a score of 260. He received a Diploma of Merit for the accomplishment, which would have earned a silver medal had he been shooting in competition.Official Report, pp. 101–02. The report says that there were \"four shooters at each target, of which there were seven,\" suggesting a total of 28 men participated. Setting aside the 17 formal competitors and Backhouse, this leaves 10 unknown British archers who participated without contending for medals."]}, {"page": "Pease family", "response": ["*Robert Backhouse (1854–1940), well-known horticulturist and British archer in the 1908 Olympics. Through his mother, Katherine Aldam, he was also a great-grandson of Thomas Pease (1743–1811).", "**William Ormston Backhouse (1885–1962), English agriculturalist and geneticist. Son of Robert Backhouse (1854–1940)."]}, {"page": "Great Britain at the 1908 Summer Olympics", "response": ["The British did not do as well in the Continental style, dominated by the French team, with the only Briton taking 12th place.  Robert Backhouse, however, shot a score in a friendly demonstration that would have placed him second had he been in actual competition.", "|align=center| 13th || Robert Backhouse ||align=center| 516"]}, {"page": "Backhouse (surname)", "response": ["*Robert Backhouse (1854–1940), well-known horticulturist and British archer in the 1908 Olympics; great-nephew of Jonathan Backhouse (1779–1842).", "*William Ormston Backhouse (1885–1962), English agriculturalist and geneticist. Son of Robert Backhouse (1854–1940)."]}, {"page": "Backhouse, Robert", "response": ["#redirectRobert Backhouse"]}]}}