{"wiki_id": "http://www.wikidata.org/entity/Q15995968", "itemLabel": "Charles Packe", "itemDescription": "cricketer (1909-1944)", "wikipedia_url": "https://en.wikipedia.org/wiki/Charles_Packe_(cricketer)", "wikipedia_page": {"main": "Charles William Christopher Packe (2 May 1909 – 1 July 1944) was an English cricketer who played first-class cricket for Leicestershire between 1929 and 1934 and captained the team for much of the 1932 season. He was born at Pietermaritzburg, South Africa and died near Caen, France during the Second World War. He was a career army officer and also played cricket for the British Army cricket team.", "link_mentions": [{"page": "George Lane-Fox, 1st Baron Bingley", "response": ["* Hon Margaret Lane Fox, b 15 April 1913, married firstly, in 1939, Major Charles Packe, Royal Fusiliers, who was killed in action in Normandy in July 1944. She married secondly, in 1951, James Hunter; they were divorced in 1956. She married thirdly, in 1969, Brigadier Kenneth Hargreaves."]}, {"page": "Michael Packe", "response": ["Born in Eastbourne in 1916, Michael Packe was the younger brother of Charles and Robert Packe, both of whom also played cricket for Leicestershire.Robert Packe and Charles Packe at CricketArchive He was educated at Wellington College and Magdalene College, Cambridge, where he read history. During World War II he served in the Royal Army Service Corps in the First Airborne Division, where he attained the rank of Lieutenant-Colonel. After the Battle of Arnhem in 1944 he was awarded the Dutch Bronze Cross; he was recommended for OBE but not appointed. In 1946 he was demobilised and moved to Alderney, where he grew vegetables commercially, wrote, and was involved in the island cricket team.  He was married to Kathryn Packe, a niece of Edith Wharton.  He died of a brain tumour on Alderney in 1978."]}, {"page": "List of Leicestershire cricket captains", "response": ["* Charles Packe (1932)"]}, {"page": "Charles Packe", "response": ["thumb|right|Charles Packe", "Charles Packe (22 August 1826 – 16 July 1896) was an English lawyer and explorer who is noted for his travels in and writing about the Pyrenees.", "thumb|right|180px|Title page of the second edition of Charles Packe's A Guide to the Pyrenees"]}, {"page": "List of cricketers who were killed during military service", "response": ["|Charles Packe"]}, {"page": "Packe", "response": ["*Charles Packe (1826–1896), British lawyer", "*Charles Packe (cricketer) ( 1909–1944), English cricketer", "*Charles Packe (MP) (1792–1867),  British politician"]}]}}