{"wiki_id": "http://www.wikidata.org/entity/Q15975464", "itemLabel": "Concordia Merrel", "itemDescription": "British writer and actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Concordia_Merrel", "wikipedia_page": {"main": "Concordia Merrel  (born Mary Phyllis Joan Logan; 10 September 1885 – 18 May 1962) was a British stage and silent film actress, photographer's model and a prolific author of romantic fiction.", "link_mentions": [{"page": "Eye, Suffolk", "response": ["*Concordia Merrel (1886–1962), actor and writer, lived and died in Eye."]}, {"page": "Visakhapatnam", "response": ["* Concordia Merrel"]}, {"page": "Valentine Dyall", "response": ["He was the son of the veteran actor Franklin Dyall and the actress and author Mary Phyllis Joan Logan, who acted and wrote as Concordia Merrel."]}, {"page": "List of British films before 1920", "response": ["|A Smart Set||A.V. Bramble||Concordia Merrel, Neville Percy||Crime||"]}, {"page": "Franklin Dyall", "response": ["In the early years of the 20th century Dyall appeared in Lewis Waller's company, and played a variety of roles, both Shakespearean and modern. In 1905–06 he toured the US in E. S. Willard's company. After returning to England, he married the actress Mary Phyllis Logan, known professionally as Concordia Merrel. They had one child, Valentine, who followed his parents into the acting profession. At about the same time Dyall changed his stage name from Frank Dyall to Franklin Dyall,\"Dramatic Gossip\", The Referee, 30 September 1906, p. 2; and \"Manchester Amusements\",  Manchester Courier and Lancashire General Advertiser, 2 October 1906, p. 3 He acted in a wide range of roles, including several Ibsen parts, playing the title role in John Gabriel Borkman (1910), Dr Rank in A Doll's House and  Judge Brack in Hedda Gabler (both 1911). Of the first of these the reviewer of The Illustrated London News called Dyall's performance \"splendid ... the actor has done nothing half so good heretofore and his was ... the best performance we have ever had in London of his role\".\"The Playhouses\", The Illustrated London News, 29 October 1910, p. 646"]}, {"page": "A Smart Set", "response": ["* Concordia Merrel ...  Pauline"]}, {"page": "My Sweetheart", "response": ["My Sweetheart is a 1918 British silent comedy film directed by Meyrick Milton and starring Concordia Merrel, Randle Ayrton and Bert Wynne.BFI.org It was based on a play by Minnie Palmer.", "* Concordia Merrel - Mrs. Fleeter"]}, {"page": "The Lost Chord (1917 film)", "response": ["* Concordia Merrel as Joan "]}, {"page": "Cavendish Morton (artist)", "response": ["Cavendish Morton (17 February 1911 – 30 January 2015) was a British painter and illustrator, a member of the Norwich Twenty Group. Born at Thornton Heath, London, he was son of the actor, art director and photographer Cavendish Morton (1874–1939) and Mary Phyllis Joan Logan, who acted and wrote romantic fiction under the name Concordia Merrel.    After a period of nomadic wandering the family settled in Bembridge in the Isle of Wight where the couple home-schooled their sons with an emphasis on the arts."]}, {"page": "Ave Maria (1918 film)", "response": ["Ave Maria is 1918 British silent drama film directed by Wilfred Noy and starring Concordia Merrel, Rita Jonson and Roy Travers.Connelly p.22", "* Concordia Merrel as Margaret  "]}, {"page": "Cavendish Morton (actor)", "response": ["He was married to the novelist and actress Concordia Merrel, who posed for many of his photographs, and with her was the father of the twin painters Cavendish Morton and Concord Morton. After a period of nomadic wandering the family settled in Bembridge in the Isle of Wight where the couple home-schooled their sons with an emphasis on the arts."]}, {"page": "Concordia Merrill", "response": ["#REDIRECTConcordia Merrel"]}, {"page": "Mary Phyllis Logan", "response": ["#REDIRECTConcordia Merrel"]}]}}