{"wiki_id": "http://www.wikidata.org/entity/Q15990268", "itemLabel": "John Lumley-Savile, 8th Earl of Scarbrough", "itemDescription": "English Earl", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Lumley-Savile,_8th_Earl_of_Scarbrough", "wikipedia_page": {"main": "John Lumley-Savile, 8th Earl of Scarbrough (18 July 1788 – 29 October 1856), styled Viscount Lumley between 1832 and 1835, was a British peer and politician.", "link_mentions": [{"page": "Earl of Scarbrough", "response": ["*John Lumley-Savile, 8th Earl of Scarbrough (1788–1856)"]}, {"page": "Baron Savile", "response": ["Baron Savile, of Rufford in the County of Nottingham, is a title in the Peerage of the United Kingdom. It was created in 1888 for the diplomat Sir John Savile. He was the eldest of the five illegitimate children of John Lumley-Savile, 8th Earl of Scarbrough, and the grandson of John Lumley-Savile, 7th Earl of Scarbrough. The latter was the fourth of the seven sons of Richard Lumley-Saunderson, 4th Earl of Scarbrough, and his wife Barbara, sister and heiress of the politician Sir George Savile, 8th and last Baronet, of Thornhill (see Savile Baronets for more information on this title), who bequeathed the substantial Savile estates in Yorkshire and Nottinghamshire (including Rufford and Thornhill) to his nephew the Hon. Richard Lumley-Saunderson, later 6th Earl of Scarbrough."]}, {"page": "Sir George Savile, 8th Baronet", "response": ["Rufford Abbey and some of his other estates were bequeathed to his nephew, Richard Lumley (1757–1832), a younger son of Richard Lumley-Saunderson, 4th Earl of Scarbrough (1725–1752). Richard took the additional name of Savile, but when on his brother's death in 1807 he became 6th Earl of Scarbrough the Savile estates passed to his brother John (1760–1835), afterwards the 7th earl. John's son and heir was John Lumley-Savile, 8th Earl of Scarbrough (1788–1856). The 8th earl was never married, but he left four natural sons, the eldest of whom was John Savile (1818–1896), the diplomatist, who was created Baron Savile of Rufford in 1888. He entered the foreign office in 1841, was British envoy at Dresden and Bern, and from 1883 to 1888 represented his country in Rome. Although the eldest son, he did not inherit Rufford and his father's other estates until after the deaths of two of his younger brothers. He made a fine collection of pictures and died at Rufford on 28 November 1896, when his nephew John Savile Lumley-Savile, 2nd Baron Savile (b. 1854) became the 2nd baron. He was a member of the Oddfellows.Ayon kay Victoria Solt Dennis, Discovering Friendly and Fraternal Societies: Their Badges and Regalia, page 90"]}, {"page": "Lord Lieutenant of Nottinghamshire", "response": ["*John Lumley-Savile, 8th Earl of Scarbrough 10 May 1839 – 29 October 1856"]}, {"page": "Rufford Abbey", "response": ["Although Rufford Abbey once boasted five ice houses, only two remain today. All were constructed around 1820, when the estate was owned by John Lumley-Savile, 8th Earl of Scarbrough (1788–1856). The five ice houses are located near Rufford lake, created c. 1750; for the simple reason that the movement of ice from its source was easier."]}, {"page": "John Savile, 1st Baron Savile (second creation)", "response": ["Born John Lumley-Savile, he was the eldest of the five illegitimate children of John Lumley-Savile, 8th Earl of Scarbrough and the grandson of John Lumley-Savile, 7th Earl of Scarbrough. The latter had succeeded to the Savile estates through his grandmother Barbara Savile, sister and heiress of Sir George Savile, 8th and last Baronet, of Thornhill (see the Marquess of Halifax) and wife of Richard Lumley-Saunderson, 4th Earl of Scarbrough. Lumley-Savile's mother was of French origin. He served as Attaché at the British embassies in Berlin from 1842 to 1849, in St Petersburg from 1849 to 1854 and as Secretary of Legation in Washington from 1854 to 1858, in Madrid from 1858 to 1860 and in Constantinople in 1860. The latter year Lumley-Savile was appointed Secretary to the Embassy in St Petersburg, in which post he remained until 1868. While in Russia he was made a member of the Russian Imperial Academy in 1866. He summarized some results of his extensive research on Russia's tea trade in an extensive report which he presented to the British Parliament."]}, {"page": "John Lumley-Savile, 7th Earl of Scarbrough", "response": ["He inherited the earldom from his brother in 1832. He was succeeded by his son John Lumley-Savile, 8th Earl of Scarbrough."]}, {"page": "John Lumley-Savile", "response": ["*John Lumley-Savile, 8th Earl of Scarbrough (1788 – 1856), British peer and politician"]}, {"page": "Richard Lumley, 9th Earl of Scarbrough", "response": ["Lumley's predecessor, John Lumley-Savile, 8th Earl of Scarbrough, died childless. Lumley inherited the  earldom  of Scarbrough and barony of Lumley although he was only the first cousin once removed from the eighth earl. He also inherited the Viscountcy of Waterford in the Peerage of Ireland. "]}, {"page": "Augustus William Lumley-Savile", "response": ["John Lumley-Savile, 8th Earl of Scarbrough was Augustus William Lumley-Savile's father. Lord Scarbrough never married but engendered five natural children, four sons and one daughter. The earl bequeathed the family estates to his second son Captain Henry Lumley (d. 1881), and on Captain Lumley's death the estates passed to Augustus William Lumley-Savile, who was the youngest of the four sons. In 1883 the family estates consisted of 17,820 acres in Nottinghamshire and 16,000 acres in the West Riding of Yorkshire. The principal residence was Rufford Abbey, near Ollerton."]}]}}