{"wiki_id": "http://www.wikidata.org/entity/Q15971138", "itemLabel": "Harold Pyman", "itemDescription": "British Army general", "wikipedia_url": "https://en.wikipedia.org/wiki/Harold_Pyman", "wikipedia_page": {"main": "General Sir Harold English \"Pete\" Pyman,  (12 March 1908 – 9 October 1971) was a senior British Army officer who served during the Second World War and achieved high office in the 1960s. He was the eldest son of Harold English Pyman and Christian Jane Scott, and the great-grandson of George Pyman.", "link_mentions": [{"page": "I Corps (United Kingdom)", "response": ["* 1956–1958 Lieutenant-General Sir Harold Pyman"]}, {"page": "XXX Corps (United Kingdom)", "response": ["By 21 September the Guards Armoured Division troops were exhausted, and Horrocks also took ill, with XXX Corps periodically being commanded by its Brigadier General Staff (BGS) Brigadier Harold Pyman, for which he would be made Chief of Staff of Second Army after the operation. They had fought continuously for five days, much of it against fierce German resistance, and were unable to continue the offensive any longer. The 43rd Division was brought up to continue the offensive, who managed to defeat elements of the 10th SS Panzer Division that penetrated to Nijmegen area, and advanced to the Neder Rijn and the area called \"the Island\". There the 4th Battalion, Dorset Regiment successfully crossed the Rhine as a diversion, so that the remnants of the British 1st Airborne Division could withdraw more safely, but many men of the 4th Dorsets were themselves left behind on the north bank of the Rhine when the division withdrew."]}, {"page": "Royal Tank Regiment", "response": ["| Lieutenant General Sir Harold Pyman KCB CBE DSO || 1959–1965 ||"]}, {"page": "Allied Forces Northern Europe", "response": ["*1961-1963 Lieutenant General Sir Harold Pyman"]}, {"page": "Westminster Dragoons", "response": ["* Gen Sir Harold Pyman, GBE, KCB, DSO, appointed 5 November 1952"]}, {"page": "11th Armoured Division (United Kingdom)", "response": ["|Major-General Harold Pyman"]}, {"page": "List of Knights Grand Cross of the Order of the British Empire", "response": ["*1963: Colville Deverell, Walter Merton, Harold Pyman, 10th Earl of Selkirk, Geoffrey Wallinger, Wilfrid Woods"]}, {"page": "List of people educated at Fettes College", "response": ["* Harold Pyman, former Deputy Chief of the General Staff"]}, {"page": "Harold English Pyman", "response": ["#REDIRECT Harold Pyman"]}, {"page": "Deputy Chief of the General Staff (United Kingdom)", "response": ["* Lieutenant-General Sir Harold Pyman 1958–1961"]}, {"page": "Pyman", "response": ["* Harold Pyman (1908–1971), British army officer"]}]}}