{"wiki_id": "http://www.wikidata.org/entity/Q15914903", "itemLabel": "Reece Styche", "itemDescription": "Gibraltarian association football player (born 1989)", "wikipedia_url": "https://en.wikipedia.org/wiki/Reece_Styche", "wikipedia_page": {"main": "Reece Styche (born 3 May 1989) is a professional footballer who plays as a striker for Southern League Premier Division club Stourbridge and the Gibraltar national team. Known as a physical attacker, he is also known as \"Brutus\" by fans in Gibraltar after the nickname was given to him by head coach Julio Cesar Ribas. He currently holds the record of joint-highest scorer for Gibraltar, shared with Tjay De Barr, Liam Walker and Lee Casciaro.\n\n", "link_mentions": [{"page": "Tamworth F.C.", "response": ["* Reece Styche"]}, {"page": "Gibraltar national football team", "response": ["|align=\"left\"|Reece Styche"]}, {"page": "Akwasi Asante", "response": ["On 9 February 2018, Akwasi was unveiled as a Tamworth player, signing an 18-month contract under new caretaker manager Mike Fowler, who suggested that Asante could help fill the void left by the departure of Reece Styche to National League North rivals Darlington. He scored 3 goals from 14 league appearances in what remained of the season, at the end of which Tamworth were relegated to the Southern League. He was not a regular starter in the 2018–19 season, and at the end of November 2018, he joined National League North club Chester on a month's loan, with a view to a permanent move."]}, {"page": "2009–2011 International Challenge Trophy", "response": [" England C: Preston Edwards; Lee Vaughan, Connor Franklin (Matty Blair 65), Rob Atkinson, Max Porter, Michael Wilde (Josh Coulson 73), Andy Mangan, Danny Rose (Jack Byrne 81), George Donnelly, Josh Simpson (Reece Styche 71), Sean Clancy"]}, {"page": "Liam Walker", "response": ["He spent most of his career with lower-league Spanish clubs and in the Gibraltar Premier Division. He also had brief spells with England's Portsmouth (League One) and Notts County (League Two), and Bnei Yehuda Tel Aviv in the Israeli Premier League. He made his international debut for Gibraltar in their first official game in 2013, and as of 2021, he is the joint-record caps holder for Gibraltar (held with Roy Chipolina) and joint-record goalscorer (alongside Lee Casciaro, Tjay De Barr and Reece Styche)."]}, {"page": "2013–14 Wycombe Wanderers F.C. season", "response": ["|Reece Styche", "|Reece Styche"]}, {"page": "Zack Kotwica", "response": ["On 24 November 2017 Kotwica signed for Conference North side Tamworth for an undisclosed fee, to fill the void left by the sale of Reece Styche to Darlington."]}, {"page": "Gibraltar national football team results", "response": ["|Reece Styche 74'", "|Reece Styche 30' (pen.)", "|Reece Styche 43'"]}, {"page": "Adam Priestley", "response": ["Priestley was then called up for Gibraltar's next two friendlies against the Faroe Islands and Estonia on 1 March 2014 and 5 March 2014, respectively. Against the Faroe Islands, Priestley came off the bench as a second-half substitute as head coach Allen Bula gave new striker Reece Styche an opportunity to start. The addition of Priestley at the half was noted for strengthening the Gibraltar attack, despite not changing the scoreline in the 1–4 defeat. For the match against Estonia, Bula once again chose Priestley as his starting forward."]}, {"page": "List of Forest Green Rovers F.C. seasons", "response": ["| Reece Styche", "Reece Styche"]}, {"page": "Hereford F.C.", "response": ["*  Reece Styche"]}, {"page": "List of Gibraltar international footballers", "response": ["Defender Roy Chipolina and midfielder Liam Walker are the nation's most capped players, accumulating 57 appearances since their international debuts in November 2013 against Slovakia. Forwards Lee Casciaro, Tjay De Barr, Reece Styche and Liam Walker are the nation's leading goalscorers of all time, scoring three in 43, 28, 21 and 57 matches respectively. Kyle Goldwin is the most capped goalkeeper in Gibraltar's history having appeared 21 times for the national side. Defender Joseph Chipolina has received the most yellow cards (cautions), with ten. Defender Jayce Olivero has received the most red cards (dismissals), with two sending off. Since their official debut in 2013, 63 players have made at least one international appearance for Gibraltar."]}, {"page": "Gibraltar national football team records and statistics", "response": ["The list encompasses the records set by the team, their managers and their players since joining UEFA in 2013. The player records section itemises the team's leading goalscorers and those who have made most appearances in first-team competitions. Gibraltar's record appearance makers are Roy Chipolina and Liam Walker, who have made 53 appearances each since 2013. Lee Casciaro, Tjay De Barr and Reece Styche are the record goalscorers, scoring three goals each in total. All figures are correct as of the match played on 7 September 2021."]}, {"page": "2017–18 National League", "response": ["|align=left|Reece Styche"]}, {"page": "2018–19 National League", "response": ["|align=left|Reece Styche"]}]}}