{"wiki_id": "http://www.wikidata.org/entity/Q15921115", "itemLabel": "Sarah Bridle", "itemDescription": "British astrophysicist", "wikipedia_url": "https://en.wikipedia.org/wiki/Sarah_Bridle", "wikipedia_page": {"main": "Sarah Louise Bridle is a professor in the Extragalactic astronomy and Cosmology research group in the Jodrell Bank Centre for Astrophysics, part of the School of Physics and Astronomy at the University of Manchester. She is known for her work applying statistical techniques to the Cosmic microwave background (CMB) and on the use of weak gravitational lensing in cosmology. From 2006 - 2015 she co-led weak lensing efforts with The Dark Energy Survey (DES), was co-lead of the Euclid Weak Lensing working group and was Large Synoptic Survey Telescope (LSST) UK Project Scientist from 2013 to 2017.", "link_mentions": [{"page": "Fellow of the Royal Society", "response": ["* University research fellowships (URFs) Royal Society University Research Fellowships are for outstanding scientists in the UK who are in the early stages of their research career and have the potential to become leaders in their field. Previous holders of URFs have been elected FRS at a later date including Richard Borcherds (1994), Jean Beggs (1998), Frances Ashcroft (1999), Athene Donald (1999) and John Pethica (1999). More recent awardees include Terri Attwood, Sarah-Jayne Blakemore, Brian Cox, Sarah Bridle, Shahn Majid, Tanya Monro, Beth Shapiro, David J. Wales and Katherine Willis. "]}, {"page": "Bridle (disambiguation)", "response": ["* Sarah Bridle, British professor of astronomy"]}, {"page": "Department of Physics and Astronomy, University of Manchester", "response": ["* Sarah Bridle, Professor of Astrophysics"]}, {"page": "The Life Scientific", "response": ["| data-sort-value=\"Bridle, Sarah\"| Sarah Bridle"]}, {"page": "Royal Society University Research Fellowship", "response": ["* Sarah Bridle (2008–2012), University of Manchester"]}, {"page": "Bridle, Sarah", "response": ["#redirectSarah Bridle"]}, {"page": "Bluedot Festival", "response": ["The festival has included talks and demonstrations from Richard Dawkins, Brian Cox, Jim Al-Khalili, Philippa Browning, Timothy John O'Brien, Sarah Bridle, Lisa Harvey-Smith, Heather Williams and Teresa Anderson."]}]}}