{"wiki_id": "http://www.wikidata.org/entity/Q15994467", "itemLabel": "Grahame Dangerfield", "itemDescription": "British naturalist", "wikipedia_url": "https://en.wikipedia.org/wiki/Grahame_Dangerfield", "wikipedia_page": {"main": "Grahame Dangerfield (died 13 July 2018) was a British naturalist, author and broadcaster. In the 1960s he was one of the first British television naturalists, and was largely involved with rescued British wildlife.\nDangerfield worked for both the BBC and independent television as a wildlife presenter and adviser, appearing in programmes such as Badger's Bend, Five O'Clock Club and Boom!\nIn 1965 he left Britain to work in the Serengeti National Park in Tanzania. In the 1970s, he opened a private zoo at Wheathampstead.Dangerfield was the author of a number of books about nature, including The Unintended Zoo (1965) and The Rajah of Bong and Other Owls (1981).\nHe lived in Kenya in later life.  He died on 13 July 2018 at the age of 80.", "link_mentions": [{"page": "Dangerfield", "response": ["*Grahame Dangerfield (died 2018), British naturalist"]}, {"page": "Harold Tamblyn-Watts", "response": ["As a comics artist, he is best remembered for his brief time illustrating Supercar in TV Comic in 1961, although he also illustrated such features as 'On the Danger Trail with Grahame Dangerfield' in TV Comic Annual and 'Out and About with Uncle Ben' in Jack and Jill. His longest-running strip work was for 'Katie Country Mouse' in Jack and Jill which he took over from Philip Mendoza in 1964."]}, {"page": "Friday Night, Saturday Morning", "response": ["| 3 October 1980 || Desmond Morris || Andrea Newman, Gerard Kenny, Lynn Barber, Grahame Dangerfield, Prof Randolph Quirk, Betty Fitzpatrick"]}, {"page": "Graham Dangerfield", "response": ["#REDIRECT Grahame Dangerfield"]}, {"page": "Five O'Clock Club", "response": ["Five O'Clock Club was a 1960s British children's television pop programme on Rediffusion with Jimmy Hanley, Muriel Young, Howard Williams, and later Wally Whyton. The programme also featured appearances by Bert Weedon, and Grahame Dangerfield, and two glove puppets; Fred and Ollie, full names Ollie Beak and Fred Barker."]}, {"page": "2018 in the United Kingdom", "response": ["**Grahame Dangerfield, 80, British broadcaster and naturalist."]}, {"page": "Deaths in July 2018", "response": ["*Grahame Dangerfield, 80, British broadcaster and naturalist.Deaths"]}]}}