{"wiki_id": "http://www.wikidata.org/entity/Q15920231", "itemLabel": "Route 94", "itemDescription": "British DJ and producer", "wikipedia_url": "https://en.wikipedia.org/wiki/Route_94_(musician)", "wikipedia_page": {"main": "Rowan Tyler Jones (born 21 May 1993), known by his stage name Route 94, is an English record producer and remixer from Richmond, London. Initially producing dubstep as Dream, Jones worked with the likes of Skream, Benga and Katy B. He then began producing house. His single \"My Love\" was a commercial success, charting to number one in three charts.\n\n", "link_mentions": [{"page": "List of one-hit wonders on the UK Singles Chart", "response": ["| Route 94", "| A collaboration with Jess Glynne. Route 94 has not released another single that has reached the UK chart since, but did remix MK featuring Alana's \"Always\", which charted at number 12 in August the same year."]}, {"page": "4th & B'way Records", "response": ["On April 12, 2013, The Island Def Jam Music Group reactivated the label as a dance-oriented imprint with Cazzette as its first artist on the reactivated imprint, and has also signed Route 94, Kiesza, and Loote"]}, {"page": "MK (DJ)", "response": ["Kinchen also produced music in collaboration with Blinded in March 2014. In the same year, British DJ Route 94 remixed Kinchen's track \"Always\", which went on to peak at number 12 on the UK Singles Chart.", "! scope=\"row\"| \"Always\" (Route 94 Remix)"]}, {"page": "List of artists by number of UK Singles Chart number ones", "response": ["|Route 94 featuring Jess Glynne"]}, {"page": "List of Live Lounge cover versions", "response": ["|Duke Dumont ||\"My Love/Hideaway\" by Route 94/Kiesza\"Walking With Elephants/Unfinished Sympathy\" (feat. Moko) by Ten Walls/Massive Attack feat. Shara Nelson ||18 March 20145 September 2014"]}, {"page": "List of artists who reached number one on the UK Singles Chart", "response": ["| Route 94"]}, {"page": "List of highways numbered 94", "response": ["* National Route 94 in Western Australia", "*Newfoundland and Labrador Route 94", "*National Route 94", "*20px U.S. Route 94 (former)", "*20px Alabama State Route 94", "*20px California State Route 94", "*20px Connecticut Route 94", "*20px Georgia State Route 94", "*20px Illinois Route 94", "**20px Illinois Route 94A (former)", "**20px Illinois Route 94B (former)", "*20px Kentucky Route 94", "**20px Louisiana State Route 94 (former)", "*20px Maine State Route 94", "*20px Maryland Route 94", "*20px Missouri Route 94", "*20px New Jersey Route 94", "**20px County Route 94 (Bergen County, New Jersey)", "*20px New York State Route 94", "**20px County Route 94 (Cattaraugus County, New York)", "**20px County Route 94 (Dutchess County, New York)", "**20px County Route 94 (Madison County, New York)", "**20px County Route 94 (Oneida County, New York)", "**20px County Route 94 (Onondaga County, New York)", "**20px County Route 94 (Rensselaer County, New York)", "**20px County Route 94 (Rockland County, New York)", "**20px County Route 94 (Saratoga County, New York)", "**20px County Route 94 (Steuben County, New York)", "**20px County Route 94 (Suffolk County, New York)", "***20px County Route 94A (Suffolk County, New York)", "**20px County Route 94 (Sullivan County, New York)", "**20px County Route 94 (Westchester County, New York)", "*20px Ohio State Route 94", "*20px Pennsylvania Route 94", "*20px Rhode Island Route 94", "*20px Tennessee State Route 94", "*20px Utah State Route 94", "*20px Virginia State Route 94", "*20px West Virginia Route 94"]}, {"page": "Rinse FM", "response": ["Currently signed acts include P Money, Katy B, Novelist, Roska and Royal-T. DJs who have released mix albums for Rinse Recordings include Skream, Skepta, Kode9 and Elijah and Skilliam. With the release of the 23rd mix CD (mixed by Richy Ahmed), Rinse has stated that it broadens the concept to include non-residents of the station.Reviews: Richy Adhmed - Rinse 23  Resident Advisor The label went on to release Katy B's chart-topping album Little Red and Route 94's chart-topping single \"My Love\" in 2014."]}, {"page": "List of UK Singles Chart number ones of the 2010s", "response": ["|Route 94 featuring Jess Glynne"]}, {"page": "Scottish Singles and Albums Charts", "response": ["| 9 March || \"My Love\" || Route 94  featuring Jess Glynne  || G I R L || Pharrell Williams"]}, {"page": "List of million-selling singles in the United Kingdom", "response": ["| scope=\"row\" | Route 94featuring Jess Glynne || \"My Love\""]}, {"page": "List of UK Singles Downloads Chart number ones of the 2010s", "response": ["|Route 94  featuring Jess Glynne "]}, {"page": "Skream discography", "response": ["|Route 94 (featuring L Devine)"]}, {"page": "Chapter II (Benga album)", "response": ["* Rowan \"Route 94\" Jones - co-producer (2)"]}, {"page": "Jess Glynne", "response": ["Jessica Hannah Glynne (born 20 October 1989) is an English singer and songwriter. After signing with Atlantic Records, she rose to prominence in 2014 as a featured artist on the singles \"Rather Be\" by Clean Bandit and \"My Love\" by Route 94, both of which reached number one in the UK. She was considered one of the \"Most Influential People Under 30\" by Forbes magazine in 2019.", "In 2013, deep house producer Route 94 approached Glynne about rewriting and providing vocals for his song \"My Love\". It was later released as a single in February 2014 and reached number one on the UK Singles Chart. It was later certified Platinum by the British Phonographic Industry. British band Clean Bandit heard \"My Love\" and approached Glynne to feature on their song \"Rather Be\". Band member Jack Patterson spoke of \"a real subtlety of emotion in her voice\". The collaboration produced the single which also charted atop the UK charts, becoming the third fastest-selling single and most streamed song of 2014. The single attained number one and top five positions on charts across Europe and Oceania, and was a top ten hit on the US Billboard Hot 100. Both \"Rather Be\" and \"My Love\" received nominations at the BRIT Awards for Best British Single. For her work on \"Rather Be\", Glynne won the Grammy Award for Best Dance Recording and was nominated for Song of the Year at the inaugural BBC Music Awards."]}, {"page": "Little Red (album)", "response": ["* Route 94 – producer"]}, {"page": "List of UK Dance Singles Chart number ones of 2014", "response": ["|Route 94 featuring Jess Glynne", "|align=center|7 ||  || Route 94 ||align=center|1"]}, {"page": "List of UK top-ten singles in 2014", "response": ["|Route 94", "| align=\"left\"|Route 94 ", "* Figure includes appearances on Route 94's \"My Love\" and Clean Bandit's \"Rather Be\"."]}, {"page": "2014 in British music charts", "response": ["In the singles chart, Pharrell Williams, Clean Bandit, Sam Smith, Route 94, DVBBS, Borgeous, 5 Seconds of Summer, Aloe Blacc, Sigma, Kiesza, Mr Probz, Secondcity, Ed Sheeran, Ella Henderson, Oliver Heldens, Ariana Grande, Rixton, Magic!, Nico & Vinz, Lilly Wood, Nicki Minaj, Meghan Trainor, Gareth Malone's All Star Choir, Band Aid 30, Mark Ronson and Ben Haenow have all claimed their first number 1 single as a lead artist. Williams (with \"Get Lucky\" and \"Blurred Lines\"), Smith (with \"La La La\"), and Blacc (not credited; with \"Wake Me Up\") had all reached number one as featured artists prior to 2014.", "| 15 March || \"My Love\" || Route 94 featuring Jess Glynne || 120,770 || ", "| Route 94 featuring Jess Glynne"]}, {"page": "My Love (Route 94 song)", "response": ["\"My Love\" is the first single by British DJ and record producer Route 94, featuring vocals by Jess Glynne. It was released in the United Kingdom on 28 February 2014, through Rinse Recordings. The song topped the UK Singles Chart, peaked at number 12 on the Irish Singles Chart and also charted in Belgium. The song was written and produced by Route 94.", "Glynne's previous single, \"Rather Be\" with Clean Bandit, topped the UK chart the previous month. The song and an acoustic version appear on the deluxe edition of her album I Cry When I Laugh. The Route 94 version has since become a 2x Platinum record in the UK and the acoustic version has separately received a silver certification.", "\"The latest producer-turned-frontman poised to take over the charts seemingly out of nowhere is Route 94; a Rinse FM-signed wonderkid who has shot through the ranks after receiving praise from Radio 1's Annie Mac as well as D'n'B DJs Skream and Benga. What's more, his mysterious alias actually holds meaning: it's the US highway that links Chicago – the home of house music – and Detroit, the birthplace of techno. Naturally, what will almost certainly be his breakthrough hit 'My Love' lands somewhere in the middle on the deep house pH spectrum, its heady piano thuds and gauzy electro glow offset by the radio friendly vocals of Jess Glynne, who featured on Clean Bandit's recent chart topper 'Rather Be'. And while you'd think the latter's recent success would have satisfied the public's appetite for chart-friendly house, we suspect its reign is far from over yet.\" ", "Category:Route 94 (musician) songs"]}, {"page": "Right Here (Jess Glynne song)", "response": ["It is Glynne's first solo single, following collaborations with Clean Bandit and Route 94. It was released as a digital download on 6 July 2014 in the United Kingdom."]}, {"page": "Always (MK song)", "response": ["==Route 94 remix==", "In 2013, the song was remixed by Route 94. The remix entered the UK Singles Chart at number 12 after its re-release in 2014."]}, {"page": "35th Brit Awards", "response": ["** Route 94 featuring Jess Glynne – \"My Love\"", "** Route 94 featuring Jess Glynne – \"My Love\"", "|Route 94"]}, {"page": "Hold My Hand (Jess Glynne song)", "response": ["\"Hold My Hand\" debuted at number one on the UK Singles Chart on 29 March 2015 with sales of 97,000. The single outsold its closest competitor, James Bay's \"Hold Back the River\", by over 40,000 units. The single became Glynne's first solo number one in the UK; she had previously scored two number one singles in 2014 as a featured artist, on Clean Bandit's \"Rather Be\" and Route 94's \"My Love\". The song retained the top position in its second week on the chart, with combined chart sales of just over 80,000, including 1.62 million streams. The song also retained the top position in its third week on the chart, beating Nick Jonas' \"Jealous\" in streaming format. In the United States, \"Hold My Hand\" debuted at number 88 on the Billboard Hot 100 chart, on the issue dated 3 October 2015 and has peaked at number 86."]}, {"page": "Noize Generation", "response": ["He has reached first attention with his remixes of Dare and Feel Good Inc for the band Gorillaz, which both have peaked in the Top 3 on the music platform The Hype Machine. Afterwards he released several remixes for artists like Skrillex, Iggy Azalea and Route 94. He has also started touring as DJ and has played shows all over Germany and globally, including South Korea, Portugal, Italy, Sweden, Austria, Switzerland and Ukraine. On some of them he has shared the stage with DJs like Martin Garrix, Dimitri Vegas & Like Mike, R3hab and many more. In July 2014, it was confirmed that he signed a record deal with Universal Music. After that he made an unofficial remix for OneRepublic's single Love Runs Out, which has reached a big popularity and gained one million plays on SoundCloud and YouTube in a very short time. His first official single A Song for You was released on the 27 January 2015 and has featured the Swedish singer Patrik Jean. A Song for You was already supported on some German radio stations before the official release."]}, {"page": "Sigma discography", "response": ["| Route 94"]}, {"page": "I Cry When I Laugh", "response": ["The album was preceded by the UK top-ten singles \"Right Here\" and \"Real Love\", as well as the UK number-one singles \"Hold My Hand\" and \"Don't Be So Hard on Yourself\". The album's fifth single, \"Take Me Home\", was released on 3 November 2015 as the official BBC Children in Need single of 2015. The deluxe edition also includes the collaborative singles \"Rather Be\" (with Clean Bandit), \"My Love\" (with Route 94) and \"Not Letting Go\" (with Tinie Tempah), all of which reached number one in the UK. The album was also promoted with the Ain't Got Far to Go Tour, lasting from September to November 2015 with concerts taking place in both North America and the United Kingdom.", "In August 2013, the singer signed a contract with Atlantic Records, consequently leaving her job at the time in brand management for a drinks company. The same year, deep house producer Route 94 approached Glynne about rewriting and providing vocals for a song of his, called \"My Love\", which at the time contained a sample that he was prohibited from using. It was released on DJ Annie Mac's compilation album Annie Mac Presents in October 2013 and led to Glynne’s discovery by British electronic group Clean Bandit who approached her to feature on their song \"Rather Be\". Released as a single in January 2014, \"Rather Be\" debuted at number one on the UK Singles Chart, becoming the third fastest-selling single and the most streamed song of 2014. The track attained number-one and top-five positions on charts across Europe and Oceania, and was a top ten hit on the US Billboard Hot 100. In February 2014, Route 94's \"My Love\" was released as a single; it also debuted at number one in the UK.  Prior to writing the songs for the album, Glynne had broken up with her girlfriend.", "Selected as the first single from I Cry When I Laugh, \"Right Here\" was released on 6 July 2014. It received a positive from critics who called it \"a little more low-key\" than Glynne's previous collaborations on Clean Bandit's \"Rather Be\" and Route 94's \"My Love\", both of which had reached the top of the UK Singles Chart in early 2014. The song peaked at number six on the UK Singles Chart and reached the top ten in Belgium and Scotland. It was eventually certified silver by the British Phonographic Industry (BPI). \"Real Love\", another collaboration with Clean Bandit, was released as the second single on 16 November 2014. It reached number two on the UK Singles Chart and peaked at number two on the German Singles Chart.", "*\"My Love\" is Route 94's debut single. It was released on 28 February 2014 and reached number one on the UK Singles Chart. \"My Love\" (Acoustic) was made available to download on 27 May 2015."]}, {"page": "Don't Be So Hard on Yourself", "response": ["In the United Kingdom, \"Don't Be So Hard on Yourself\" entered the UK Singles Chart at number 78 based on streams alone. The following week, after its release, the song reached the top of the charts, becoming her fifth number-one single, matching the record for a British female solo artist, held by Cheryl. Glynne has previously reached the top of the charts with Clean Bandit's \"Rather Be\", Route 94's \"My Love\", her own \"Hold My Hand\" and \"Not Letting Go\" with Tinie Tempah. In Australia, the song was Glynne's first solo top-ten hit and her highest-charting single since \"Rather Be\" (2014). It debuted at number 37 on the ARIA Singles Chart week ending 6 September 2015, before peaking at number 17 two weeks later. After remaining for another week at number 17, the song fell to numbers 21 and 24, the following two weeks, however it later climbed to number 12, before finally peaking at number 10, on 1 November 2015."]}, {"page": "Jess Glynne discography", "response": ["Glynne made her debut on Clean Bandit's single \"Rather Be\" in January 2014, which peaked at number one on the UK Singles Chart. The following month, she was featured on Route 94's single \"My Love\", which also topped the charts in the UK. Her debut solo single \"Right Here\" was released in July 2014 as the lead single from her debut album I Cry When I Laugh. The song peaked at number six in the UK. She again collaborated with Clean Bandit later that year on \"Real Love\". Further singles \"Hold My Hand\", \"Don't Be So Hard on Yourself\" and the Tinie Tempah track \"Not Letting Go\" also topped the UK charts, giving Glynne five number-one singles in the space of one year and making her the second British female solo artist to achieve the tally after Cheryl. The album charted atop the UK Albums Chart and has since been certified four times platinum by the British Phonographic Industry for sales exceeding 1,200,000 copies.", "! scope=\"row\"| \"My Love\"  (Route 94 featuring Jess Glynne)", "| Route 94"]}, {"page": "Young Bombs", "response": ["| Route 94 (feat. Jess Glynne)"]}, {"page": "Ryan Staake", "response": ["* Route 94 - My Love (2014)"]}, {"page": "Brit Award for British Single", "response": ["| Route 94 featuring Jess Glynne "]}, {"page": "Brit Award for British Video of the Year", "response": ["* Route 94 featuring Jess Glynne – \"My Love\""]}]}}