{"wiki_id": "http://www.wikidata.org/entity/Q15996494", "itemLabel": "Peter Proudfoot", "itemDescription": "Football player and manager (1882-1941)", "wikipedia_url": "https://en.wikipedia.org/wiki/Peter_Proudfoot", "wikipedia_page": {"main": "Peter Proudfoot (28 October 1879 – 4 March 1941) was a Scottish footballer who scored 21 goals in 162 appearances in the Football League playing for Lincoln City, Clapton Orient, Chelsea and Stockport County. He played at inside right, centre half or right half. He also played in the Southern League for Millwall and briefly for Scottish Football League clubs St Mirren, Albion Rovers and Morton. When he signed for Millwall in 1904, the Daily Express described him as \"a big strapping fellow with a fine knowledge of the game\". He was the first player to be transferred directly from Chelsea to Manchester United.Proudfoot was manager of Clapton Orient in three spells covering much of the 1920s and 1930s. In 1928, the Football Association suspended him from football for six months for financial irregularities.", "link_mentions": [{"page": "Albert Pape", "response": ["He signed for Notts County at the end of that season, but made just six appearances in 1923–24 before moving on to Clapton Orient. In eight months with Orient, he scored 11 goals in 24 league matches. In February 1925, Orient travelled to a match against a Manchester United side that had just sold its star striker, Bill Henderson, to Preston North End. United manager John Chapman had telephoned the Orient manager Peter Proudfoot before they left London, and the two clubs agreed a fee of £1,070 for Pape. They met up at Manchester Piccadilly station just after noon, and Pape – who was a friend of the United captain Frank Barson, and had relatives in nearby Bolton – quickly agreed terms.Blundell, p. 164 The details were wired to The Football Association and The Football League at around 1:30 p.m., and although Pape had been named in Orient's starting line-up for the match, he was confirmed as a Manchester United player with about an hour left before kick-off. Pape was not only allowed to start the match in the colours of Manchester United, but he also scored the team's third goal in a 4–2 win over his previous employers, as well as hitting the post with a header late in the game. He made 15 further appearances that season, and scored four more goals. He also made two appearances in 1925–26, but he was then sold to Fulham in October 1925. However, he was reluctant to return to London, and only signed with Fulham on the condition that he could continue to live in Bolton and train with Manchester United.Blundell, p. 202 Five months later, the two clubs met in the Sixth Round of the FA Cup, and although Pape scored, Manchester United won the match 2–1."]}, {"page": "1905–06 Chelsea F.C. season", "response": ["| Peter Proudfoot", "|align=\"left\"|MF||align=\"left\"| Peter Proudfoot"]}]}}