{"wiki_id": "http://www.wikidata.org/entity/Q15989811", "itemLabel": "Maggie Atkinson", "itemDescription": "Children's Commissioner", "wikipedia_url": "https://en.wikipedia.org/wiki/Maggie_Atkinson", "wikipedia_page": {"main": "Margaret Elizabeth Atkinson (born 16 September 1956) is an English educator and the former Children's Commissioner for England. After a career in teaching, she moved into public service administration, initially in education, but later in Children Services. Her appointment and tenure as Children's Commissioner was notable for a series of controversies.", "link_mentions": [{"page": "September 16", "response": ["*1956 – Maggie Atkinson, English educator and civil servant"]}, {"page": "University of Sheffield", "response": ["Many notable people in a number of disciplines have attended Sheffield. A number of politicians are alumni of the university, including President of Dominica Nicholas Liverpool, Deputy Prime Minister of Turkey Nurettin Canikli, Home Secretary David Blunkett, Minister for Foreign Affairs of Seychelles Jean-Paul Adam, Downing Street Chief of Staff Nick Timothy. At least ten Members of the UK Parliament and two Members of the European Parliament have studied at Sheffield. Notable public servants who have studied at the university includes Secretary General of the Higher Commission for Industrial Security of Saudi Arabia Khalid S. Al-Ageel, Chief Economist at the Bank of England Andy Haldane, head of London Metropolitan Police Bernard Hogan-Howe, Chief of the Defence Staff Stuart Peach,Who's Who 2014, A & C Black, 2010,  and Children's Commissioner for England Maggie Atkinson."]}, {"page": "Newnham College, Cambridge", "response": ["|Maggie Atkinson"]}, {"page": "Maggie", "response": ["* Maggie Atkinson (born 1956), English educator"]}, {"page": "Birkdale High School", "response": ["* Maggie Atkinson, Children's Commissioner for England was Head of English in the 1980s."]}, {"page": "Children's Commissioner for England", "response": ["Maggie Atkinson, then the Children's Commissioner for England, commented: \"There now needs to be an ongoing dialogue between the government, through UK Borders Agency (UKBA), and stakeholders with a concern for this area of policy. As a previous report from my office has stated, the starting point for any alternative to detention should be developing community-based alternatives to detention, which ensure that children's needs are met, and their rights not breached, during the process of removal.\"", "Maggie Atkinson attracted controversy by describing the murder of James Bulger as \"unpleasant\", and commenting that his killers, Jon Venables and Robert Thompson, ought never to have been prosecuted, and that the age of criminal responsibility in England and Wales ought to be raised to twelve, from the age of ten.", "* Dr Maggie Atkinson (2009–2015)"]}, {"page": "List of people from Barnsley", "response": ["* Maggie Atkinson, the Children's Commissioner for England"]}, {"page": "List of University of Sheffield people", "response": ["* Maggie Atkinson, Children's Commissioner for England"]}]}}