{"wiki_id": "http://www.wikidata.org/entity/Q15994632", "itemLabel": "William McNaught", "itemDescription": "British engineer, died 1881", "wikipedia_url": "https://en.wikipedia.org/wiki/William_McNaught_(Glasgow)", "wikipedia_page": {"main": "William McNaught (1813–1881) was a Scottish engineer, from Glasgow, who patented a compound steam engine in 1845. This was a technique of improving the efficiency of a standard simple Boulton & Watt beam engine. The engine was compounded by adding a high-pressure cylinder between the support column and the flywheel, on the side opposite the low-pressure cylinder. This improvement could be retrospectively fitted to existing engines.", "link_mentions": [{"page": "Compound steam engine", "response": ["*1845 – William McNaught devised a method of fixing an additional high-pressure cylinder within an existing beam engine. To do so involved using a long pipe to connect the cylinders, and an extra set of valves to balance them. In effect this acted as a receiving chest, and a new type of compound had been invented. This system allowed greater control of the steam intake and cut-offs. An engine could be slowed by either a throttle which reduced the pressure of the steam, or by adjusting the cut-off on either cylinder. The latter was more efficient as no power was lost. The cycle was smoother as the two cylinders were not in phase."]}, {"page": "Beam engine", "response": ["A beam engine is a type of steam engine where a pivoted overhead beam is used to apply the force from a vertical piston to a vertical connecting rod. This configuration, with the engine directly driving a pump, was first used by Thomas Newcomen around 1705 to remove water from mines in Cornwall. The efficiency of the engines was improved by engineers including James Watt, who added a separate condenser; Jonathan Hornblower and Arthur Woolf, who compounded the cylinders; and William McNaught, who devised a method of compounding an existing engine.  Beam engines were first used to pump water out of mines or into canals but could be used to pump water to supplement the flow for a waterwheel powering a mill.", "William McNaught patented a compound beam engine in 1845. On a beam engine of the standard Boulton & Watt design he placed a high-pressure cylinder, on the opposite side of the beam to the existing single cylinder, where the water pump was normally fitted. This had two important effects: it massively reduced the pressure on the beam, and the connecting steam pipe, being long, acted as an expansive receiver – the element missing in the Woolf design. This modification could be made retrospectively, and engines so modified were said to be \"McNaughted\". The advantages of a compound engine were not significant at pressures under , but showed at over ."]}, {"page": "McNaught", "response": ["* William McNaught (Glasgow) (1813–1881), engineer who compounded a beam engine", "* William McNaught (Rochdale) (1813–1881), engineer of  Petrie and McNaught, who invented a variable cut off gear and governor for a Stationary steam engine"]}, {"page": "William McNaught (Rochdale)", "response": ["William McNaught  was a steam engine engineer from Rochdale, Lancashire, England."]}, {"page": "William McNaught", "response": ["William McNaught may refer to:", "*William McNaught (Glasgow)(1813-1881), Scottish engineer", "*William McNaught (Rochdale) (1813-1881), English engineer"]}, {"page": "Petrie of Rochdale", "response": ["Alexander Petrie and Co was a company that manufactured stationary steam engines.  It was based in Rochdale, Greater Manchester in England.  The company did general millwrighting, producing some steam engines during the 19th century. Around 1845, their superintendent, William McNaught, was producing large steam-driven beam engines for textile mills in Rochdale.", "Alexander Petrie, an iron founder and millwright from Cumberland, set up a small firm in Bury about 1792. His son, John Petrie served his apprenticeship with him in Bury, and then converted some cottages behind Cheetham St, Rochdale. John Petrie, was successful taking much business from his father. His father closed down and joined his son in a new firm Alexander Petrie and Son, where they were described in 1816-7 as ‘Iron & Brass Founders’.1816 – 17 trade directory In 1818, they  built and equipped a new, larger foundry the Phoenix Foundry, on Whitehall Street.Leigh’s Directory of Rochdale for 1818 They made their first steam engine in 1819. It was an 8 hp (nominal) engine for James King of Leavengreave. This was the first steam engine built in Rochdale. It was sold at £300. (£ current prices). By 1845, they employed William McNaught (Rochdale) as the factory superintendent, and he also designed engines, such as the pair of 120 hp nominal (700 hp indicated) beam engines for Bright's New Mill in 1845. McNaught left and founded his own firm. In 1853, John Petrie, junior patented and made the first automatic wool-washing machine. Graces Guides", "*Bright's (120 hp-nominal- 700 hp-indicated) Indicated horse power, was the system for calculating the power on a compound engine patented by  William McNaught "]}, {"page": "1813 in Scotland", "response": ["* 27 May – William McNaught, steam engineer (died 1881 in Manchester)"]}]}}