{"wiki_id": "http://www.wikidata.org/entity/Q15971188", "itemLabel": "John Durnford", "itemDescription": "Royal Navy admiral (1849-1914)", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Durnford", "wikipedia_page": {"main": "Admiral Sir John Durnford  (6 February 1849 – 13 June 1914) was a Royal Navy officer who went on to be Commander-in-Chief, Cape of Good Hope Station.", "link_mentions": [{"page": "HMS Jupiter (1895)", "response": ["HMS Jupiter was laid down by J & G Thomson, Clydebank at Clydebank on 26 April 1894 and launched on 18 November 1895. In February 1897 she was transferred to Chatham Dockyard, where she was completed in May 1897. She was commissioned on 8 June 1897 at Chatham Dockyard for service in the Channel Fleet. She was present at both the Fleet Review at Spithead for the Diamond Jubilee of Queen Victoria on 26 June 1897 and the Coronation Fleet Review for King Edward VII on 16 August 1902. Captain John Durnford was appointed in command in October 1899, followed by Captain Sir Archibald Berkeley Milne from December 1900. In March 1901 she visited Cork. The following year she was part of a squadron visiting Nauplia and Souda Bay at Crete for combined manoeuvres between the Channel and Mediterranean fleets in September and October. Captain Sir Richard Poore was appointed in command in December 1902. On 1 January 1905, the Channel Fleet became the new Atlantic Fleet, making her an Atlantic Fleet unit. She was paid off at Chatham on 27 February 1905 to undergo a refit there, and her Atlantic Fleet service ended when she emerged from refit and was commissioned at Chatham into the Portsmouth Reserve on 15 August 1905. Jupiter was commissioned for service in the new Channel Fleet on 20 September 1905. This service ended on 3 February 1908 when she was paid off. By this time, Jupiter had been surpassed in the role of front-line battleship by the new \"all-big-gun\" dreadnought battleships inaugurated by  in 1906."]}, {"page": "List of Lords Commissioners of the Admiralty", "response": ["**John Durnford, Junior Naval Lord", "**John Durnford, Junior Naval Lord", "**John Durnford, Junior Naval Lord"]}, {"page": "Fourth Sea Lord", "response": ["*Rear Admiral Sir John Durnford 1901–1903"]}, {"page": "Commander-in-Chief, Africa (Royal Navy)", "response": ["*Rear Admiral Sir John Durnford (1904-1907)"]}, {"page": "Durnford", "response": ["* John Durnford, Admiral in the Royal Navy", "* John Durnford (cricketer)", "* John Durnford-Slater, British Army officer"]}, {"page": "1897 Diamond Jubilee Honours", "response": ["*Captain John Durnford DSO, Royal Navy."]}, {"page": "Admiral Sir John Durnford", "response": ["#REDIRECT John Durnford"]}, {"page": "List of Royal Navy vice admirals", "response": ["|  Sir John Durnford, GCB, DSO"]}, {"page": "Royal Naval College, Greenwich", "response": ["*Admiral Sir John Durnford (1908–1911)"]}, {"page": "1913 Birthday Honours", "response": ["*Admiral Sir John Durnford, KCB, DSO"]}, {"page": "List of Royal Navy admirals (1707–current)", "response": ["| Sir John Durnford, GCB, DSO"]}, {"page": "Durnford, John", "response": ["#redirectJohn Durnford"]}]}}