{"wiki_id": "http://www.wikidata.org/entity/Q15999809", "itemLabel": "Geoffrey Davies", "itemDescription": "cricketer (1892-1915)", "wikipedia_url": "https://en.wikipedia.org/wiki/Geoffrey_Davies_(cricketer)", "wikipedia_page": {"main": "Geoffrey Boisselier Davies (26 October 1892 – 26 September 1915) was an English cricketer.\nDavies was educated at Rossall School where he played cricket for the school 1909–12, being captain in 1912. He also played for Essex in 1912. He went up to Selwyn College, Cambridge, and played for both Cambridge University and Essex in 1913 and 1914. In the First World War he was commissioned in the Essex Regiment and held the rank of Captain when he was killed in France in 1915.", "link_mentions": [{"page": "List of cricketers who were killed during military service", "response": ["|Geoffrey Davies"]}, {"page": "Geoff Davies", "response": ["* Geoffrey Davies (cricketer) (1892–1915), English cricketer", "* Geoffrey Davies (born 1942), English actor"]}, {"page": "Leo Reid", "response": ["Reid was born at Chesterton in January 1888. He was educated at Aldenham School, before going up to Christ's College, Cambridge. He made his debut in minor counties cricket for Cambridgeshire in the 1906 Minor Counties Championship. He played minor counties for Cambridgeshire until 1914, making fifty appearances in the Minor Counties Championship. Having not played first-class cricket while at Cambridge, Reid later made a single first-class appearance for the Marylebone Cricket Club (MCC) against Cambridge University at Lord's in 1913. Batting twice in the match, he was dismissed for 6 runs in the MCC first-innings by Geoffrey Davies, while in their second-innings he was dismissed for 4 runs by the same bowler. Following the First World War, he switched to playing minor counties cricket for Hertfordshire, making 65 appearances in the Minor Counties Championship between 1920–31, as well as captaining the side from 1923–27. Reid later emigrated to the United States, where he died at New York City in October 1938."]}]}}