{"wiki_id": "http://www.wikidata.org/entity/Q15990103", "itemLabel": "Henry Keswick", "itemDescription": "British businessman and politician (1870-1928)", "wikipedia_url": "https://en.wikipedia.org/wiki/Henry_Keswick_(politician)", "wikipedia_page": {"main": "Henry Keswick (1870 – 29 November 1928) was a British Conservative politician and businessman and member of the Executive Council and Legislative Council of Hong Kong.", "link_mentions": [{"page": "The Hongkong and Shanghai Banking Corporation", "response": ["#Henry Keswick (1908–1909)"]}, {"page": "Keswick family", "response": ["===Henry Keswick (1870–1928)===", "Son of William, Henry Keswick arrived in Hong Kong in 1895 the year before his uncle James left. He had previously spent two years in the New York office of Jardines.", "He married Ida Wynifred Johnston and had 3 children, David Johnston, Sir William Johnston \"Tony\" Keswick and Sir John Henry Keswick KCMG.", "The next family members to be associated with Hong Kong and Shanghai were Henry's sons \"Tony\" and John Keswick. As well as being directors of Jardines they served as members of the Legislative and Executive Councils in Hong Kong and of the Shanghai Municipal Council responsible for Shanghai's International Settlement. They were also Chairmen of the Shanghai Municipal Council and Chamber of Commerce at various times. When William and his father Henry Keswick returned to the United Kingdom they both served as members of parliament with responsibility for Far Eastern interests.", "===Sir Henry Keswick===", "Percy Weatherall (born 1957) or Edward Percy Keswick Weatherall, is a great grandson of Henry Keswick (1870–1928). He was managing director of the Jardine Matheson Group from 2000 to 31 March 2006 having joined the board in 1999."]}, {"page": "William Keswick", "response": ["*Henry Keswick (1870–1928)"]}, {"page": "Francis Oswald Lindley", "response": ["* Mary Etheldreda Lindley (1911–2009), who married Sir William Johnstone Keswick (1903–1990), son of politician and businessman Henry Keswick of the prominent Hong Kong based Keswick family.", "* Sir Henry Keswick (b. 1938), one of Britain's richest men who married Annabel Thérèse \"Tessa\" Fraser, Lady Reay (a daughter of war hero Simon Fraser, 15th Lord Lovat and the former wife of Hugh Mackay, 14th Lord Reay); "]}, {"page": "Henry Keswick", "response": ["Henry Keswick may refer to:", "* Henry Keswick (politician) (1870–1928), British taipan of Jardine Matheson & Co and Member of Parliament", "* Sir Henry Keswick (businessman) (born 1938), British chairman of Jardine Matheson & Co, grandson of the above"]}, {"page": "Henry Keswick (MP)", "response": ["#REDIRECT Henry Keswick (politician)"]}, {"page": "John Keswick", "response": ["Sir John Henry Keswick, KCMG (1906–1982) was an influential Scottish businessman in China and Hong Kong. He was the taipan of the Jardine, Matheson & Co., the leading British trading firm in the Far East, and had established friendship with many Chinese politicians. He was also a representative of the Special Operations Executive, a British intelligence service during the Second World War.", "Sir John Keswick was born in 1906 to the third generation of Keswick family in the Jardine, Matheson & Co.. His father, Henry Keswick, son of William Keswick, was a Jardines taipan and a Conservative Member of Parliament. Sir John followed his father and grandfather into Jardines in 1929 at the age of 23. He worked in Shanghai from 1931 until the outbreak of the Second World War in Europe in 1939."]}, {"page": "Tony Keswick", "response": ["\"Tony\" Keswick was born in Yokohama, Japan, the son of Henry Keswick and his wife Ida. He returned to England as a boy to attend Winchester School and Trinity College, Cambridge. He arrived in the Far East in 1926. Keswick and his brother remained directors of the firm after they had left the Far East. He was in charge of the Shanghai office (at that time the Head Office in the Far East) from 1935 until 1941. He was also Chairman of the Shanghai Municipal Council during the crises leading to the Pacific War, stepping down in May 1941 to be replaced by John Hellyer Liddell.", "*Henry Keswick (businessman), son of Tony"]}]}}