{"wiki_id": "http://www.wikidata.org/entity/Q15971202", "itemLabel": "William Furse", "itemDescription": "British Army general", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Furse", "wikipedia_page": {"main": "Lieutenant General Sir William Thomas Furse,  (21 April 1865 – 31 May 1953) was a Master-General of the Ordnance.", "link_mentions": [{"page": "Master-General of the Ordnance", "response": ["* Lieutenant-General Sir William Furse (1916–1919)"]}, {"page": "9th (Scottish) Division", "response": ["* 28 September 1915 – 2 December 1916 Major-General William Furse"]}, {"page": "Battle of Bazentin Ridge", "response": ["The 9th (Scottish) Division (Major-General William Furse) and the 3rd Division (Major-General Aylmer Haldane) in XIII Corps were to attack on a line from the north-west corner of Bernafay Wood to Marlboro' Wood and needed to advance  to a line from Delville Wood to Longueval and Bazentin le Grand in the dark, to close up to the German front line. From Marlboro' Wood to the north side of Mametz Wood, the 7th Division (Major-General Herbert Watts) and 21st Division (Major-General David Campbell) of XV Corps, faced no man's land which was  wide south of Bazentin le Grand Wood, Bazentin le Petit Wood, village and the cemetery  east. The advance would be uphill except beyond Mametz Wood, where the ground was flat. The 18th (Eastern) Division (Major-General Ivor Maxse) was to set up a defensive flank on the east face of Trônes Wood, between the 9th (Scottish) Division and the French 153rd Division, which would support the 18th (Eastern) Division with artillery if necessary. On the left flank, the 1st Division was to form another defensive flank in the Pearl Alley communication trench and capture Contalmaison Villa, to link with the 21st Division at Bazentin le Petit Wood. (At  on 13 July, the 1st Division attacked with the 1st Black Watch and captured Lower Wood, north of the top left of Mametz Wood and Contalmaison Villa at  on 14 July."]}, {"page": "Battle of Delville Wood", "response": ["The Battle of Bazentin Ridge (14–17 July) was planned as a joint attack by XV and XIII Corps, whose troops would assemble in no man's land in darkness and attack at dawn after a five-minute hurricane bombardment. Haig was sceptical of the plan but eventually accepted the views of Rawlinson and the corps commanders, Lieutenant-General Henry Horne and Lieutenant-General Walter Congreve. Preparatory artillery bombardments began on 11 July and on the night of  British troops advanced stealthily across no man's land, which in parts was  wide, to within  of the German front line and then crept forward. At  the hurricane bombardment began and the British began to run forward. On the right flank, the 18th (Eastern) Division (Major-General Ivor Maxse), captured Trônes Wood in a subsidiary operation and the 9th (Scottish) Division (Major-General William Furse) was repulsed from Waterlot Farm but on the left got into Delville Wood. The 21st, 7th and 3rd Division on the left (northern) flank, took most of their objectives. By mid-morning  of the German second position had been captured, cavalry had been sent forward and the German defenders thrown into chaos."]}, {"page": "Battle of Le Transloy", "response": ["Late on 8 October, Rawlinson ordered another attack, once XV Corps had reached its objectives, anticipated to be by 12 October, when the Sixth Army expected to have captured Sailly-Saillisel to the south-east. The rain stopped early on 9 October and from  the weather was fine but the state of the ground made divisional reliefs slow and laborious. From  the XIV Corps replaced the 56th and 20th divisions with the 4th Division (Major-General W. Lambton) and the 6th Division (Major-General Charles Ross). In XV Corps the 41st Division was replaced by the 30th Division (Major-General J. S. M. Shea) and the 9th Division (Major-General William Furse) and 15th Division (Major-General Frederick McCracken) took over from the 47th and 23rd divisions in III Corps. The new division had little time to study the ground or dig assembly trenches and Furse was refused a 48-hour postponement. The Royal Flying Corps (RFC) attempted to get new photographs of the German defences but the light was too poor for much to be achieved."]}, {"page": "Attacks on the Butte de Warlencourt", "response": ["On 8 October, a post was spotted halfway up the road towards the Butte by the crew of a British reconnaissance aircraft. The 142nd Brigade attacked Diagonal Trench again with the 1/21st London and the 1/22nd London, who crawled forward to rush the German garrison as soon as a one-minute hurricane bombardment lifted at  The 1/21st London advanced until about  short of Diagonal Trench with no losses, then massed machine-gun fire inflicted many casualties; few troops reached the trench. On the left flank, three companies of the 1/22nd London reached the trench against slight opposition but enfilade fire from the right flank made the trench untenable once dawn broke. The survivors managed to dig advanced posts up to  short of the objective and at the Eaucourt l'Abbaye–Warlencourt road. Touch was gained with the 23rd Division on the left. The 47th (1/2nd London) and 23rd divisions were relieved by the 9th Division (Major-General William Furse) and 15th (Scottish) Division (Major-General Frederick McCracken) from 8 11 October, preparatory to another attack."]}, {"page": "Roger K. Furse", "response": ["Roger Furse was the son of Lieutenant General Sir William Furse and Jean Adelaide Evans-Gordon. He was educated at St George's School, Windsor Castle, at Eton College and at the Slade School of Fine Art, London."]}, {"page": "Judith Furse", "response": ["A member of the Furse family, her father was Lieutenant-General Sir William Furse and mother "]}, {"page": "Michael Lubbock", "response": ["Lubbock was the son of Cecil Lubbock (15 February 1872 – 18 January 1956) and  Edith Furse (1867 – 14 December 1960), daughter of Rev. Charles Furse was Archdeacon of Westminster. He was a great-grandson of Sir John William Lubbock, 3rd Baronet, and was the nephew of Lt.-Gen. Sir William Furse, the artist Charles Wellington Furse, and The Rt Rev Bolton Michael Furse."]}, {"page": "Order of battle for the Battle of the Somme", "response": ["| style=\"background:#FFFFCC;\" |9th (Scottish) DivisionBuchan p.58  ||colspan=\"2\" |Major-General William Furse"]}, {"page": "Michael Furse", "response": ["Born in 1870 in Staines, Middlesex, Furse was the fourth son of Ven. Charles Furse (born Johnson), Archdeacon of Westminster, and Jane Diana Monsell, second daughter of John Samuel Bewley Monsell, vicar of Egham. His elder brothers included the sculptor John Henry Monsell Furse, Lt.-Gen. Sir William Furse and the artist Charles Wellington Furse.1871 England Census"]}, {"page": "W. T. Furse", "response": ["#REDIRECT William Furse"]}, {"page": "William Thomas Furse", "response": ["#REDIRECT William Furse"]}, {"page": "General Officers of World War I", "response": ["A list of potential subjects was compiled by Evan Charteris and Lewis Vernon Harcourt, 1st Viscount Harcourt and approved by Bailey.  Some were deliberately omitted (for example, General Ian Hamilton was blamed for the failure at Gallipoli and left out).  Others prominent army commanders to be left out include Horace Smith-Dorrien, Hubert Gough, Charles Monro, Richard Haking, William Peyton, Charles Kavanagh, John Nixon, Percy Lake, and Charles Townshend; administrative officers such as Stanley Brenton von Donop, William Furse, Nevil Macready, George Macdonogh, Ronald Charles Maxwell and Travers Clarke, several Chiefs of the Imperial General Staff – Charles W. H. Douglas, James Wolfe Murray, and Archibald Murray – and army chiefs of staff, such as Tim Harington, Archibald Montgomery-Massingberd, Launcelot Kiggell and Herbert Lawrence.  There are no officers from the Royal Flying Corps, such as Hugh Trenchard, David Henderson and John Salmond, or the Tank Corps, such as Hugh Elles."]}, {"page": "Furse, William", "response": ["#redirectWilliam Furse"]}, {"page": "Harris R. Oke", "response": ["Oke embarked for France on 12 June 1916 as part of the 11th Service Battalion, 27th Brigade, 9th (Scottish) Division under the command of Major-General William Furse, who geared up for a major offensive in the Battle of the Somme that July. The infantry participated in the Capture of Montauban and the liberation of Longueval. In March 1917, the 11th Battalion conducted a daylight reconnaissance along the Arras Cambrai Road followed in April by the Battle of Arras, during which Oke served as a Lieutenant (Temp.). Oke also served as Acting Captain (20 Jul 1917–10 Sep 1917). During the Third Battle of Ypres he was wounded, having been gassed on 17 August 1917 during the Battle of Langemarck and hit by shell fragments on 10 September 1917, which pierced his left shoulder and buttock. Oke was evacuated to the UK for surgery and recuperated at the W. London hospital for officers run by Lady Evelyn Mason, OBE LGStJ (1870–1944)."]}]}}