{"wiki_id": "http://www.wikidata.org/entity/Q15994409", "itemLabel": "Lord William Douglas", "itemDescription": "British politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Lord_William_Douglas", "wikipedia_page": {"main": "Lord William Robert Keith Douglas (1783 – 5 December 1859) was a British politician and landowner. He was the fourth son of Sir William Douglas, 4th Baronet of Kelhead and younger brother of both Charles Douglas, 6th Marquess of Queensberry and John Douglas, 7th Marquess of Queensberry. He represented the Dumfries Burghs constituency between 1812 and 1832 and served, on a number of occasions, as one of the Lord Commissioners of the Admiralty. He owned sugar plantation estates in Tobago which had formerly belonged to Walter Irvine, whose daughter, Elizabeth, he married on 24 November 1824. They had three sons, the second of which, Walter, went on to continue the Douglases of Grangemuir. He employed the future missionary Catherine Grant (later Edward) as a governess until 1843.According to the Legacies of British Slave-Ownership at the University College London, Douglas was awarded a payment as a slave trader in the aftermath of the Slavery Abolition Act 1833 with the Slave Compensation Act 1837. The British Government took out a £15 million loan (worth £1.43 billion in 2021) with interest from Nathan Mayer Rothschild and Moses Montefiore which was subsequently paid off by the British taxpayers (ending in 2015). Douglas was associated with three different claims he owned 576 slaves in Tobago and received a £10,907 payment at the time (worth £1.04 million in 2021).In May 1837, some time after William Douglas's eldest brother succeeded to the Marquessate of Queensberry, he was granted a patent of precedence which gave him the rank and style of a Marquess's younger son (Lord William Douglas).Lord William is buried at Dunino, Fife, a village close to his family seat at Grangemuir, near Pittenweem.", "link_mentions": {}}}