{"wiki_id": "http://www.wikidata.org/entity/Q15993276", "itemLabel": "Iain McColl", "itemDescription": "British actor (1954-2013)", "wikipedia_url": "https://en.wikipedia.org/wiki/Iain_McColl", "wikipedia_page": {"main": "Iain McColl (27 January 1954 – 4 July 2013) was a Scottish film and television actor, best known for his roles on British television series. McColl starred on City Lights, a BBC Scotland sitcom, from 1984 to 1991. He then co-starred on the BBC Two sitcom, Rab C Nesbitt during its first run (1988-1999). He rejoined the cast of Rab C Nesbitt again when the show was revived in 2008. Additionally, he appeared in guest spots on numerous other television shows, including Hamish Macbeth, Still Game and Taggart. McColl was also cast in a small role in the 2002 American film, Gangs of New York, directed by Martin Scorsese.In 1994 he guest starred alongside his Rab C Nesbitt co star Gregor Fisher in episode 5 of The Tales of Para Handy in which, he played a religious madman who held the ships crew hostage.\nIain McColl died from complications of cancer on 4 July 2013, aged 59.", "link_mentions": [{"page": "1984 in film", "response": ["| Comfort and Joy || Universal Pictures / Thorn EMI / Lake Ltd. / Scottish Television / Kings Road Entertainment || Bill Forsyth (director/screenplay); Bill Paterson, Eleanor David, Clare Grogan, Alex Norton, Patrick Malahide, Rikki Fulton, Roberto Bernardi, George Rossi, Ron Donachie, Iain McColl, Arnold Brown, Peter Rossi, Billy McElhaney, Gilly Gilchrist, Caroline Guthrie, Ona McCracken, Elizabeth Sinclair, Katy Black, Robin Black, Billy Johnstone || Comedy || Live action"]}, {"page": "Rab C. Nesbitt", "response": ["; Dodie: Alex Norton in 1988, Iain McColl since 1990 [1988–2011]. Another of Rab's best friends. Dodie is implied to be fond of unconventional methods of intoxication, e.g. sniffing shoe polish. He too, like Andra, has an insufferable wife whom he loathes and wretches when he thinks about sleeping with her. Dodie did not appear in the 2014 special as McColl died in 2013 following complications from a cancer diagnosis. McColl was not replaced in the role."]}, {"page": "City Lights (1984 TV series)", "response": ["He was held back in this by his own incompetence, the dodgy dealings of his best friend Chancer (Andy Gray), and the lack of support he gained from his mother (Jan Wilson), the bank's manager Adam McLelland (Dave Anderson) and his obsequious fellow teller, Brian (Jonathan Watson). Other recurring characters included Chancer's friend Tam (Iain McColl) and Willie's love interests, Janice (Elaine Collins, Series 1 and 2) and Fiona (Ann Bryson, Series 4 and 5)."]}, {"page": "Comfort and Joy (1984 film)", "response": ["* Iain McColl as Archie"]}, {"page": "The Tales of Para Handy", "response": ["The series followed the Vital Spark's adventures around the coastal waters of west Scotland and the various schemes that Para Handy would get himself and his crew involved in. These involved transporting a bull aboard the Vital Spark, trying to marry Sunny Jim off, avoiding the sale of the Vital Spark by Campbell and being held hostage at gunpoint by a religious nutter Iain McColl."]}, {"page": "King's Theatre, Glasgow", "response": ["* 1990/1991 – Babes in the Wood – Starring Gerard Kelly, Iain McColl, Una McLean"]}, {"page": "Atletico Partick", "response": ["*Iain McColl as Pettigrew"]}, {"page": "List of Scottish actors", "response": ["*Iain McColl (1954–2013)"]}, {"page": "Hamish Macbeth (TV series)", "response": ["* Iain McColl as Neil (Series 2–3); Operator of the local omnibus and the small, unstaffed local railway station."]}, {"page": "List of Rab C. Nesbitt episodes", "response": ["The ninth series is the only series not to feature Dodie (Iain McColl), who was unavailable for filming. The character of Peaches is introduced into the series, and following Andrew Fairlie's decision not to reprise the role of Gash, Iain Robertson is recast in the role. Nicola Park reprises her role as Bridie, the mother of Gash's only daughter.", "Series ten is the final regular series to be broadcast to date. Series ten saw the return of Dodie (Iain McColl) in a very minor role, while Gash, Gash's daughter Peaches and ex-girlfriend Bridie all appear in very minor roles. This series features a number of guest appearances, including Richard E. Grant, Shane MacGowan, John Sergeant, Susan Boyle and Hamish Clark."]}, {"page": "2013 in the United Kingdom", "response": ["**Iain McColl, 59, actor."]}, {"page": "Deaths in July 2013", "response": ["* Iain McColl, 59, Scottish actor (Gangs of New York), cancer.Rab C Nesbitt actor Iain McColl dies aged 59 after cancer battle"]}, {"page": "Daniel Boyle (writer)", "response": ["| Griff Rhys Jones, Elaine Paige, Laura Claire Duerden, Benjie Lawrence, Charlotte Coleman, Adrian Murphy, Ian Hart, Jake D'Arcy, Mary Ann Reid, Louis Emerick, James Culshaw, Al T Kossy, Mitzi Meuller, Sandra Gough, Iain McColl, Ian Sexon, Grace Kirby and Jill Balcon", "| Robert Carlyle, Philip Jackson, Brian Alexander, Juliet Cadzow, Ron Donachie, Shirley Henderson, Stuart McGugan, Barbara Rafferty, Valerie Gogan, Billy Riddoch, Stuart Davids, David Ashton, Ralph Riach, Laurie Ventry, Anne Lacey, Brian Pettifer, Duncan Duff, Rab Christie, Dolina MacLennan, Ronnie Letham and Iain McColl", "| Robert Carlyle, Brian Alexander, Stuart Davids, Shirley Henderson, Valerie Gogan, Stuart McGugan, Billy Riddoch, Duncan Duff, Barbara Rafferty, Ralph Riach, Ronnie Letham, Iain McColl, Peter Wight, Dinah Stabb, Brian Pettifer, Anne Lacey, Margery Withers and Hugo Munro"]}, {"page": "The Play on One", "response": ["Cast: Griff Rhys Jones, Elaine Paige, Laura Claire Duerden, Benjie Lawrence, Charlotte Coleman, Adrian Murphy, Ian Hart, Jake D'Arcy, Mary Ann Reid, Louis Emerick, James Culshaw, Al T Kossy, Mitzi Meuller, Sandra Gough, Iain McColl, Ian Sexon, Grace Kirby and Jill Balcon"]}]}}