{"wiki_id": "http://www.wikidata.org/entity/Q15969753", "itemLabel": "Michael Turner", "itemDescription": "British businessman", "wikipedia_url": "https://en.wikipedia.org/wiki/Michael_Turner_(businessman)", "wikipedia_page": {"main": "Michael John Turner CBE (born 5 August 1948) is the former chief executive officer (CEO) of the aerospace and defence company BAE Systems, and current chairman of Babcock International and prior to the hostile takeover by Melrose was chairman of GKN plc.", "link_mentions": [{"page": "Michael Turner", "response": ["*Michael Turner (actor) (1921–2012), South African born actor who played numerous roles on British television", "*Michael Turner (comics) (1971–2008), comic book artist and publisher known for his work on Witchblade and Fathom", "*Michael Turner (illustrator) (born 1934), British motorsport and aviation illustrator", "*Michael Turner (musician) (born 1962), Canadian writer and musician from Vancouver, BC", "*Michael Turner (American football) (born 1982), former American football running back", "*Michael Turner (Australian rules footballer) (born 1954), Australian rules footballer who played for the Geelong Football Club", "*Michael Turner (swimmer) (born 1948), British Olympic swimmer of the 1960s", "*Michael Turner (water polo) (born 1951), Australian former water polo player", "*Michael Turner (footballer, born 1983), English footballer", "*Michael Turner (banker) (1905–1980), chief manager of Hong Kong and Shanghai Bank from 1952 to 1963", "*Michael Turner (businessman) (born 1948), former CEO of BAE Systems"]}, {"page": "The Hongkong and Shanghai Banking Corporation", "response": ["Michael Turner became Chief Manager in 1953 and set about diversifying the business. His tenure came to an end in 1962 having established The Hong Kong and Shanghai Banking Corporation of California 1955 and having acquired The British Bank of the Middle East and the Mercantile Bank (based in India) in Aug 1959. Turner was succeeded in 1962 by Jake Saunders. In 1964 the Chief Managership was superseded as the top executive role in the bank by an Executive Chairmanship. Saunders took this role until retirement in 1972 and was succeeded as Chief Manager in 1964 by H.J. Shen, the managing director of Maysun Trading Co. and the former head of the Central Trust of China, who became the first ethnic Chinese to be appointed to the position of Chief Manager of the bank. Under Saunders' tenure the bank continued to expand. 1965 saw the bank purchase a controlling interest in Hang Seng Bank of Hong Kong, and 1972 the formation of a merchant banking arm, Wardley Limited.", "#Michael Turner (1959–1962)", "# Michael Turner (1953–1962)"]}, {"page": "Mike Turner (businessman)", "response": ["#REDIRECT Michael Turner (businessman)"]}, {"page": "Manchester Metropolitan University Business School", "response": ["* Michael Turner, former CEO of BAE Systems"]}, {"page": "Ian King (businessman)", "response": ["In November 2006, BAE Systems appointed King chief operating officer from 1 January 2007. He was promoted in what The Financial Times described as \"in part... to improve relations with the MoD further\". This followed a general improvement in relations since acrimony in 2003. The previous co-COOs were Chris Geoghegan and Steve Mogford. The Independent described King's appointment as COO as part of the \"succession battle\" to succeed BAE CEO Michael Turner."]}, {"page": "Chorlton High School", "response": ["* Sir Michael Turner CBE FRAeS, Chief Executive from 2002 to 2008 of BAE Systems, and chairman since 2008 of Babcock International and from 2012 of GKN"]}, {"page": "Roy Brown (businessman)", "response": ["Brown joined GKN as a non-executive director in 1996 and became the company's chairman in May 2004. He was replaced by Michael Turner in May 2012."]}, {"page": "List of Speakers at The Economic Club of Washington, D.C.", "response": ["|Michael Turner"]}]}}