{"wiki_id": "http://www.wikidata.org/entity/Q15994525", "itemLabel": "Abraham Hume", "itemDescription": "Scots-Irish Anglican priest in Liverpool (1814-84)", "wikipedia_url": "https://en.wikipedia.org/wiki/Abraham_Hume_(priest)", "wikipedia_page": {"main": "Abraham Hume (1814–1884) was a Scots-Irish Anglican priest in Liverpool, known as a social researcher, supporter of learned societies, and antiquary,", "link_mentions": [{"page": "Irish language in Northern Ireland", "response": ["The last speakers of varieties of Irish native to what is now Northern Ireland died in the 20th century. Irish as spoken in Counties DownAbraham Hume, whilst compiling a report for the British Association in 1874, said that \"as late as 1820... the Irish language was spoken along with English from Ballynahinch to near Newry.\" Cited in Ó Casaide (1930: 54ff) and Fermanagh were the first to die out, but native speakers of varieties spoken in the Glens of Antrim\"When Swiss-born scholar Heinrich Wagner began his four-volume Linguistic Atlas and Survey of Irish Dialects in the 1950s, most of his Ulster material was collected from Donegal – where Gaeltacht areas still exist – although he did manage to locate native speakers of Irish in counties Cavan, Tyrone and Rathlin Island, Co. Antrim, in addition to Omeath, Co. Louth\": A.J. Hughs, Belfast and the Irish Language, Fionntán de Brún (ed.), 2006,  and the Sperrin Mountains of County TyroneHistorical Sketches of the Native Irish \"estimated that around 140,000 of the total 261,867 inhabitants of that county [Tyrone], returned for the 1821 census, spoke Irish\": cited in A.J. Hughs Belfast and the Irish Language, Fionntán de Brún (ed.), 2006,  and County Londonderry survived into the 1950s and 1970s respectively, whilst the Armagh dialect survived until the 1930s or '40s.Coimisiún na Gaeltachta 1926 report and maps based on 1911 census. (This was the last time all of Ireland had a census with the same question regarding language on the same date.) Varieties of Irish indigenous to the territory of Northern Ireland finally became extinct when the last native speaker of Rathlin Irish died in 1985.\"Counties Down and Fermanagh were the first counties where Irish died out, but according to the 1911 census, Irish was spoken by the majority of the population over 60 years old in parts of the Sperrin mountains and Rathlin Island. Sound recordings have been made of the Irish of Antrim, Armagh, Londonderry and Tyrone. One of the last speakers of Antrim Irish, Jimmy Stewart of Murlough, died in 1950, and the last speaker of Tyrone Irish, Johnny McAleer, died in 1970. Bella McKenna, the last speaker of Rathlin Irish, was recorded on videotape and died in 1985. With her death came the extinction of the East Ulster dialect of Irish which had been spoken in what is present-day Northern Ireland.\" Iontaobhas ULTACH, http://www.ultach.org Séamus Bhriain Mac Amhlaigh, who died in 1983, was reportedly the last native-speaker of Antrim Irish. A wealth of recordings and stories told by Mac Amhlaigh were recorded by researchers from Queen's University in Belfast."]}, {"page": "Vestiges of the Natural History of Creation", "response": ["While the season's fashionable use of Vestiges as a conversation piece in London society avoided theological implications, the book was read very differently in Liverpool, where it was first made public that men of science condemned the book, and it became the subject of sustained debate in newspapers. The book was attractive to reformers, including Uniformitarians and William Ballantyne Hodgson, the principal of the Mechanics' Institution who, like Chambers, had become a supporter of George Combe's ideas. In defence of public morals and Evangelical Tory dominance in the city, the Reverend Abraham Hume, an Anglican priest and lecturer, delivered a detailed attack on Vestiges at the Liverpool Literary and Philosophical Society on 13 January 1845, demonstrating that the book conflicted with standard specialist scientific texts on nebulae, fossils and embryos, and accusing it of manipulative novelistic techniques occupying \"the debatable ground between science and fiction\". At the next meeting two weeks later John Robberds, son of John Gooch Robberds the minister, defended the book as well-intentioned and based on \"deep reflection and extensive research\", while noting that he considered it inconsistent in distinguishing miracles from natural law, against his Unitarian views. As subsequent debates appeared inconclusive, Hume wrote to leading men of science for authoritative expert opinions, and made the responses public to resolve the dispute. This backfired when a writer in the Liverpool Journal pointed out inconsistencies and contradictions between the various expert opinions. They only agreed on the point that Vestiges was unscientific, and the publication of their letters was considered bad manners as well as tactically unwise. Few of the experts would have allowed any direct reference to the book to be published under their names, and their gentlemanly disagreements to be made public."]}, {"page": "Sir Hugh", "response": ["Victorian collectors were surprised to find evidence of a ballad featuring a blood libel, and two wrote books on the subject. James Orchard Halliwell wrote Ballads and Poems Respecting Hugh of Lincoln in 1849. In the same year, and unknown to Halliwell, Abraham Hume wrote the book Sir Hugh of Lincoln, or, an Examination of a Curious Tradition respecting the Jews, with a notice of the Popular Poetry connected with it."]}, {"page": "Abraham Hume", "response": ["Abraham Hume may refer to:", "*Sir Abraham Hume, 1st Baronet (1703–1772), MP for Steyning ", "*Sir Abraham Hume, 2nd Baronet (1749–1838)", "*Abraham Hume (priest) (1814–1884), English priest and antiquary", "*Abraham Hume (cricketer) (1819–1888), English clergyman and cricketer"]}, {"page": "Henry Beaumont Leeson", "response": ["Leeson studied medicine at St Thomas's Hospital in London, and graduated M.D. in 1840, at the University of Oxford. From 1840 to 1852 he acted as physician and lecturer on Chemistry and Forensic Medicine, at St Thomas's.Royal Society Page He was Treasurer of the Cavendish Society, set up in 1846 to print chemical works;Abraham Hume and A. I. Evans, The Learned Societies and Printing Clubs of the United Kingdom (1853), p. 293; archive.org. and was elected Fellow of the Royal Society in 1849. He belonged also to the Royal College of Physicians. and the Chemical Society."]}, {"page": "John Southward", "response": ["Born on 28 April 1840, he was son of Jackson Southward, a printer in Liverpool from Corney, Cumberland, by Margaret Proud of Enniscorthy, County Wexford. After education at the Liverpool Collegiate Institution, he gained practical knowledge of printing in his father's office on Pitt Street, Liverpool. At 17 he began editorial work with the Rev. Abraham Hume on the Liverpool Philosophical Magazine; and from November 1857 to 1865, when it folded, he ran the Liverpool Observer, the first local penny weekly, which was printed by Jackson Southward. On the failure of the paper John Southward went to London, and was reader for Cox & Wyman (until 1868) and then for Eyre & Spottiswoode."]}, {"page": "Henry Clark Pidgeon", "response": ["With Joseph Mayer and Abraham Hume, Pidgeon in 1848 founded the Historic Society of Lancashire and Cheshire. He and Hume were joint-secretaries till January 1851, when Pidgeon moved back to London. There he continued his practice as a painter and a teacher of art. He had been elected an associate of the Institute of Painters in Water-colours in 1846, and a full member in 1861. He was also president of the Sketching Club."]}]}}