{"wiki_id": "http://www.wikidata.org/entity/Q15990145", "itemLabel": "Lewis Luxton", "itemDescription": "British rower and sports administrator", "wikipedia_url": "https://en.wikipedia.org/wiki/Lewis_Luxton", "wikipedia_page": {"main": "Lewis Luxton (12 September 1910 – 9 November 1985) was an Australian rower who competed for Great Britain at the 1932 Summer Olympics and became a member of the International Olympic Committee.\nLuxton was born in Melbourne, Victoria, Australia, the son of Sir Harold Luxton who was a member of the IOC. He was educated at Melbourne Grammar School before going to England to study at Pembroke College, Cambridge. In 1931 he and his partner William Sambell were runners-up in Silver Goblets at Henley Royal Regatta to Jumbo Edwards and Lewis Clive. In 1932 he was a member of the winning Cambridge boat in the Boat Race.  The 1932 Cambridge crew won the Grand Challenge Cup at Henley, rowing as Leander Club. They were subsequently chosen to represent Great Britain at the 1932 Summer Olympics in Los Angeles, where they came fourth in the eights.Luxton served with his father on the AOF Executive Committee for many years. When his father, resigned from the IOC on 9 May 1951 Otto Mayer immediately announced Lewis would be his successor. Luxton, as deputy chairman, undertook a great deal of work for the 1956 Summer Olympics in Melbourne. In 1957 he was awarded CBE for services to the Olympic movement.Luxton was Chairman of Shell Australia where he was able to give support to Ralph Doubell who was an employee. At Mexico in the 1968 Summer Olympics, he made the presentation to Doubell of the gold medal for the 800m.Luxton was made an honorary member of the IOC when he retired in 1974. Luxton had the deciding vote on whether Australia should send athletes to compete at the 1980 Summer Olympics in Moscow. In a 6–5 vote, Australia attended the Games officially.", "link_mentions": [{"page": "Australian Olympic Committee", "response": ["James Taylor (1924–1944), Sir Harold Luxton (1933–1951), Hugh R Weir, (1946–1975), Lewis Luxton (1951–1974), David H Mckenzie (1974–1981), Kevan Gosper, (1977–2013), Phillip W Coles (1982–2011), Susan O'Neill, (2000–2005), John D Coates (2001 – present), James Tomkins (2013–2021)", "James Taylor (1924–1944), Sir Harold Luxton (1933–1951), Hugh R Weir, (1946–1975), Lewis Luxton (1951–1974), David H Mckenzie (1974–1981), Kevan Gosper, (1977–2013), Phillip W Coles (1982–2011), Susan O'Neill, (2000–2005), John D Coates (2001 – present), James Tomkins (2013–2021)"]}, {"page": "Bill Sambell", "response": ["Sambell was born in Melbourne, Victoria, Australia. He was educated at Melbourne Grammar School before going to England to study at Pembroke College, Cambridge. In 1931 he and his partner Lewis Luxton were runners-up in Silver Goblets at Henley Royal Regatta to Jumbo Edwards and Lewis Clive.Henley Royal Regatta Results of Final Races 1839–1939  In 1932 he was a member of the winning Cambridge boat in the Boat Race.  The 1932 Cambridge crew won the Grand Challenge Cup at Henley, rowing as Leander Club. They were subsequently chosen to represent Great Britain at the 1932 Summer Olympics in Los Angeles, where they came fourth in the eights. He was in the winning Cambridge boat in the Boat Race again in 1933 and 1934."]}, {"page": "David McKenzie (fencer)", "response": ["David McKenzie (15 July 1936 – 10 August 1981) was an Australian fencer. He competed at the 1956, 1960 and 1964 Summer Olympics. He was an International Olympic Committee member from 1974 to 1981. He replaced Lewis Luxton who had resigned."]}, {"page": "1957 New Year Honours", "response": ["*Lewis Luxton, , Deputy Chairman of the Organising Committee for the Olympic Games, Melbourne, State of Victoria."]}, {"page": "The Boat Race 1932", "response": ["The Cambridge crew weighed an average of 12 st 2.75 lb (77.3 kg),  per rower more than their opponents.  Oxford saw four rowers return to the crew with Boat Race experience.  Cambridge's crew also contained four participants who had taken part in the event previously, including bow David Haig-Thomas and number six Harold Rickett.  Two participants in the race were registered as non-British, both of whom rowed for Cambridge: Lewis Luxton and William Sambell were Australian.Burnell, p. 39"]}, {"page": "The Boat Race 1933", "response": ["According to the rowing correspondent for The Times, \"no training in recent years has seen more changes in the comparative merits of the two crews.\"  Oxford started well while Cambridge took time to settle, but having done so \"made astonishingly rapid progress\" and \"promised to be the best Cambridge crew since 1900.\"  Oxford improved further once they had arrived at Putney; conversely the Light Blues suffered misfortune in losing Lewis Luxton, last year's stroke ten days before the race.  The Dark Blues continued to progress but by the time of the race, \"there was very little to choose between the two crews.\""]}, {"page": "List of Old Melburnians", "response": ["*Lewis Luxton – Olympic rower"]}]}}