{"wiki_id": "http://www.wikidata.org/entity/Q1599723", "itemLabel": "Henry Procter", "itemDescription": "British Army general", "wikipedia_url": "https://en.wikipedia.org/wiki/Henry_Procter_(British_Army_officer)", "wikipedia_page": {"main": "Henry Patrick Procter or Proctor (1763–31 October 1822) was a British major-general who served in Canada during the War of 1812.  He is best known as the commander who was decisively defeated in 1813 by the Americans and left western Upper Canada in American hands. Procter is regarded by many as an inept leader who relied heavily on textbook procedure. His \"going by the book\" is attributed to his lack of any combat experience before coming to Canada.", "link_mentions": [{"page": "War of 1812", "response": ["After Hull surrendered Detroit, General William Henry Harrison took command of the American Army of the Northwest. He set out to retake the city, which was now defended by Colonel Henry Procter and Tecumseh. A detachment of Harrison's army was defeated at Frenchtown along the River Raisin on 22 January 1813. Procter left the prisoners with an inadequate guard and his Potowatomie allies killed and scalped 60 captive Americans. The defeat ended Harrison's campaign against Detroit, but \"Remember the River Raisin!\" became a rallying cry for the Americans.", "The Americans again invaded the Niagara frontier. They had occupied southwestern Upper Canada after they defeated Colonel Henry Procter at Moraviantown in October and believed that taking the rest of the province would force the British to cede it to them. The end of the war with Napoleon in Europe in April 1814 meant that the British could deploy their army to North America, so the Americans wanted to secure Upper Canada to negotiate from a position of strength. They planned to invade via the Niagara frontier while sending another force to recapture Mackinac. They captured Fort Erie on 3 July 1814. Unaware of Fort Erie's fall or of the size of the American force, the British general Phineas Riall engaged with Winfield Scott, who won against a British force at the Battle of Chippawa on 5 July. The American forces had been through a hard training under Winfield Scott and proved to the professionals under fire. They would deploy in a shallow U formation bringing flanking fire and well-aimed volleys against Riall's men. Riall's men were chased off the battlefield."]}, {"page": "Richard Mentor Johnson", "response": ["In September, Oliver Hazard Perry destroyed most of the British fleet at the Battle of Lake Erie, taking control of the lake. This made the British army, then at Fort Malden (now Amherstburg, Ontario) vulnerable to having its supply lines cut. The British, under General Henry Procter, withdrew to the northeast, pursued by Harrison, who had advanced through Michigan while Johnson kept the Indians engaged. The Indian chief Tecumseh and his allies covered the British retreat, but were countered by Johnson, who had been called back from a raid on Kaskaskia that had taken the post where the British had distributed arms and money to the Indians. Johnson's cavalry defeated Tecumseh's main force on September 29, took British supply trains on October 3, and was one of the factors inducing Procter to stand and fight at the Battle of the Thames on October 5, as Tecumseh had been demanding he do. One of Johnson's slaves, Daniel Chinn, accompanied Johnson to the battle.Snyder, Great Crossings, p. 7. Julia Chinn, an enslaved black woman, sought more liberty for herself and children was different from Daniel, her brother."]}, {"page": "Tecumseh", "response": ["Tecumseh returned to Amherstburg in April 1813. Meanwhile, the Americans, having suffered defeat at the Battle of Frenchtown in January 1813, were pushing back toward Detroit under the command of William Henry Harrison. Tecumseh and Roundhead led about 1,200 warriors to Fort Meigs, a recently constructed American fort along the Maumee River in Ohio. The Indians initially saw little action while British forces under General Henry Procter laid siege to the fort. Fighting outside the fort began on May 5 after the arrival of American reinforcements, who attacked the British gun batteries. Tecumseh led an attack on an American sortie from the fort, then crossed the river to help defeat a regiment of Kentucky militia. The British and Indians had inflicted heavy casualties on the Americans outside the fort, but failed to capture it. Procter's Canadian militia and many of Tecumseh's warriors left after the battle, so Procter was compelled to lift the siege."]}, {"page": "Battle of the Thames", "response": ["British troops under Major General Henry Procter had occupied Detroit until the United States Navy gained control of Lake Erie, cutting them off from their supplies. Procter was forced to retreat north up the Thames River to Moraviantown, followed by the tribal confederacy under Shawnee leader Tecumseh who were his allies. American infantry and cavalry under Major General William Henry Harrison drove off the British and then defeated the Indigenous peoples, who were demoralized by the death of Tecumseh in action. American control was re-established in the Detroit area, the tribal confederacy collapsed, and Procter was court-martialled for his poor leadership.", "The American Army of the Northwest under William Henry Harrison was attempting to recover Fort Detroit and capture Fort Malden at Amherstburg, Ontario during the last months of 1812 and for much of 1813 from the Right Division of the British Army in Upper Canada, which was commanded by Major General Henry Procter. The British position depended on maintaining command of Lake Erie, as the sparsely populated region produced insufficient crops and cattle to feed Procter's troops, the sailors of the British ships on the lake, and the large number of Indians and their families gathered at Amherstburg under Tecumseh. Supplies could effectively be brought to them only by water,Forester, p. 142 usually from Long Point near the eastern end of Lake Erie. Also, if naval command of Lake Erie passed to the Americans, they would be able to land an army on the north shore, cutting off Procter from reinforcement from the east.", "Major General Henry Procter"]}, {"page": "Battle of Lake Erie", "response": ["Barclay repeatedly requested men and supplies from Commodore James Lucas Yeo, commanding on Lake Ontario, but received very little. The commander of the British troops on the Detroit frontier, Major-General Henry Procter, was similarly starved of soldiers and munitions by his superiors. He declined to make an attack on Presque Isle unless he was reinforced, and instead he incurred heavy losses in an unsuccessful attack on Fort Stephenson, which he mounted at the urgings of some of his Indian warriors.Hitsman 1999, pp. 167–168."]}, {"page": "Gordon Drummond", "response": ["Drummond, like Brock and Henry Procter, was continually hungry for reinforcements from the governor general, Sir George Prevost, who held relatively large numbers of troops in reserve at Quebec, despite the fact that no enemy had even come close to endangering the capital. Despite a constant lack of manpower and war material, Drummond had all but driven the American forces from the Niagara by the close of the 1813–1814 winter campaign. In July 1814, responding to a request from the beleaguered Major-General Phineas Riall, Drummond went with his troops from York to Fort George to take command from Riall and drive back Jacob Brown's invading soldiers. On 25 July, he ordered an immediate attack on the American forces, which were already engaging Riall's troops near Chippawa. In this way, a small skirmish exploded into the bloody and inconclusive Battle of Lundy's Lane, which cost each side over 850 casualties and left the British in possession of the road, although it is uncertain whether the British drove the Americans from the field, or the Americans drove off the British and were simply forced to withdraw by a lack of supplies. The latter is likely the case, based upon evidence compiled by Donald Graves, a Canadian historian employed at the Directorate of History, Department of National Defence Canada."]}, {"page": "HMS Detroit (1813)", "response": ["Construction of Detroit began in January 1813, however delays began almost immediately as William Bell complained that he did not have enough shipwrights. The construction placed further burdens on British supply lines, with the vessel requiring  of oak timber, 200 oak knees and over  of pine timber and boards. Furthermore, there was shortages of fabric for sails, bolts, sheaves and deadeyes. Reinforced by shipwrights sent from Kingston, Upper Canada, planking of the sloop began in April. However, this was soon interrupted when Brigadier General Henry Procter ordered the shipwrights to concentrate their efforts on the construction of gunboats for the army."]}, {"page": "Shawnee", "response": ["After William Hull's surrender of Detroit to the British during the War of 1812, General William Henry Harrison was given command of the U.S. Army of the Northwest. He set out to retake the city, which was defended by British Colonel Henry Procter, together with Tecumseh and his forces. A detachment of Harrison's army was defeated at Frenchtown along the River Raisin on January 22, 1813. Some prisoners were taken to Detroit, but Procter left those too injured to travel with an inadequate guard. His Native American allies attacked and killed perhaps as many as 60 wounded Americans, many of whom were Kentucky militiamen. The Americans called the incident the \"River Raisin Massacre.\" The defeat ended Harrison's campaign against Detroit, and the phrase \"Remember the River Raisin!\" became a rallying cry for the Americans."]}, {"page": "Francis de Rottenburg", "response": ["In 1813, he succeeded Major General Sir Roger Hale Sheaffe as military and civil commander in Upper Canada. He was accused of neglecting civil duties and of being unduly cautious in his military decisions. He refused to send reinforcements to Major General Henry Procter, commanding on the Detroit frontier, and this ultimately led to the British defeats at the Battle of Lake Erie and the Battle of Moraviantown. He later imposed martial law in the Eastern and Johnstown districts to force farmers to sell supplies to the army, an unpopular move which his successor repealed but was nevertheless forced to reimpose upon all of Upper Canada."]}, {"page": "River Raisin", "response": ["During the winter of 1813 as part of the War of 1812, the Battle of Frenchtown occurred near the river. British and Native American troops under the command of British General Henry Procter and Native American chiefs Roundhead, Walks in Water, and Split Log, were allied against a division of ill-trained Kentucky infantry and militia under command of General James Winchester. Cut off and surrounded and facing total slaughter, Winchester surrendered with British assurances of safety of the prisoners. The British and Potawatomi allies marched those who could walk to Detroit. But the next day, many of the severely wounded prisoners left in Frenchtown were killed by the Native Americans allies of the British.  "]}, {"page": "Siege of Fort Meigs", "response": ["The poor weather of early spring prevented a British attack while the fort was still vulnerable.Elting, p.104 The British Army commander on the Detroit frontier, Major General Henry Procter, had been urged to attack Fort Presque Isle (present day Erie, Pennsylvania), where the Americans were constructing a flotilla intended to seize control of Lake Erie, but Procter refused unless he received substantial reinforcements. Instead, he decided upon an attack on Fort Meigs, to disrupt American preparations for a summer campaign and hopefully capture supplies.Hitsman and Mackay, p.141 Harrison received word of Procter's preparations, and hastened down the Maumee with 300 reinforcements, increasing the garrison of the fort to a total of 1,100 men. He had persuaded Isaac Shelby, the Governor of Kentucky, to call up a brigade of 1,200 Kentucky militia under Brigadier General Green Clay. Clay's brigade followed Harrison down the Maumee, but had not reached the fort before it was besieged.", "| valign = \"top\" style=\"width:50%\"|British Army: Brigadier General Henry Procter"]}, {"page": "Siege of Fort Wayne", "response": ["After the British had successfully captured the city of Detroit, they had received the news that American Indians had surrounded an American Fort. General Isaac Brock learned that a temporary armistice had been made in the east, and ordered Colonel Henry Procter to withhold support for the attack on Fort Wayne. "]}, {"page": "Battle of Frenchtown", "response": ["Meanwhile, Brigadier General Henry Procter, commanding the British Army around Detroit, assembled all the British troops available, supported by about 500 Native Americans under the Shawnee leader Tecumseh. While Tecumseh was present during the Frenchtown fighting, he did not participate and left before the massacre.", "On hearing that the Americans had recaptured Frenchtown, British Brigadier General Henry Procter, commander of the British forces around Detroit, marched with his troops from Fort Malden and crossed the Detroit River from Upper Canada, invading Michigan in strength. His army consisted of 597 regulars from the 41st Regiment of Foot and Royal Newfoundland Fencibles, joined by about 800 Indians. This force linked up with elements of the Essex militia who had fallen back after their initial defeat on January 18. Shawnee leader Tecumseh was in the area, but he was not present at the Battle of Frenchtown. He left command of the Native Americans to Wyandot chiefs Roundhead and Walk-in-the-Water. The Indians included Shawnee, Potawatomi, Ottawa, Chippewa, Delaware, Miami, Winnebago, Creek, Sauk, and Fox tribes.River Raisin National Battlefield Park historic marker Roundhead Procter's artillery consisted of six light 3-pounder cannons drawn on sledges, manned by men from the Canadian Provincial Marine under the command of Lieutenant Frédérick Rolette. Procter halted about  north of the River Raisin to prepare for battle on January 21.", "James Winchester largely bore the responsibility for the devastating loss at Frenchtown. His ill-prepared defensive planning following the successful First Battle of the River Raisin led to the defeat of his army and the high number of deaths suffered by his column. Had Winchester retreated to the Maumee River to rejoin with General Harrison's column, the two could have strengthened their numbers and marched back to Frenchtown with the necessary troops and preparedness to fight the British and Native Americans.  Instead, Winchester remained in Frenchtown with his small force despite advanced knowledge of a British and Native American counterattack. He was unaware that Harrison's troops were on their way and would arrive shortly.  During the Second Battle of the River Raisin, Winchester was captured early in the battle and surrendered his army at the urging of British Brigadier General Henry Procter. While Winchester's army suffered heavy losses at the start of the surprise attack, the Kentuckians regrouped and fought off three waves of British lines to protect their camp. They were very low on ammunition when the order of surrender came from Winchester.  Had the Americans prolonged the battle long enough for Harrison's column to arrive at Frenchtown, the outcome of the battle could have changed."]}, {"page": "Siege of Detroit", "response": ["Hull reached Detroit on 5 July, where he was reinforced by detachments of Michigan militia, including the 140 men of the Michigan Legionary Corps, which Hull had established in 1805. The American army was short of supplies, especially food, as Detroit provided only soap and whiskey. Nevertheless, Eustis urged Hull to attack Amherstburg. The fort there was defended by 300 British regulars, mainly from the 41st Regiment of Foot, 400 Indians, and some, principally Essex, militia. The post's commander was Colonel St. George, who was later superseded by Colonel Henry Procter of the 41st. Hull was not enthusiastic and wrote to Eustis that \"the British command the water and the savages.\"Hitsman, p. 70 Nevertheless, his army crossed into Canada on 12 July. He issued several proclamations which were intended to induce Canadians to join or support his army while some of his mounted troops raided up the Thames River as far as Moraviantown. These moves discouraged many of the militia from opposing his invasion, but few of the inhabitants of the region actively aided him, even those who had recently moved from the United States.Hitsman, p.67"]}, {"page": "Black Hawk (Sauk leader)", "response": ["During the war, Black Hawk and Native warriors fought in several engagements alongside Major-General Henry Procter on the borders of Lake Erie. Black Hawk was at the Battle of Frenchtown, Fort Meigs, and the attack on Fort Stephenson.Trask, Kerry A. Black Hawk: The Battle for the Heart of America, (Google Books), Henry Holt: 2006, p. 109, 308, (), pp. 220-221. Retrieved October 26, 2007.Lewis, James. \"The Black Hawk War of 1832: FAQ ,\" Abraham Lincoln Digitization Project, Northern Illinois University. Retrieved October 26, 2007. The United States Army was able to inflict a significant defeat on Tecumseh's Confederacy by killing Tecumseh during the war."]}, {"page": "Battle of Fort Stephenson", "response": ["After failing to defeat American forces in the siege of Fort Meigs, the British under Henry Procter withdrew. Procter attempted to take Fort Meigs again in July by staging a mock battle to lure the defenders out of the fort. The ploy failed, and Procter abandoned the idea of taking the fort."]}, {"page": "George Madison", "response": ["During the War of 1812, Governor Shelby called for volunteers to serve in the Army of the Northwest. Colonel John Allen raised a regiment, and Madison was commissioned as his second-in-command. The regiment, known as the 1st Rifle Regiment of Kentucky Volunteers, fought under James Winchester at the Battle of Frenchtown. Winchester was captured by General Henry Procter, but about four hundred men under Madison repelled several charges by the British.Coles, p. 116 Madison's men believed they had won the victory when they observed a white flag in the midst of the British force, but the flag was being waved by Winchester as an order for Madison's force to surrender."]}, {"page": "Military deception", "response": ["In August 1813, American Major George Croghan was in charge of 160 soldiers at Fort Stephenson, a base on the Sandusky River in what is now Sandusky County, Ohio which guarded a nearby supply depot. British commander Henry Procter arrived with a superior force that included at least 500 British regulars, 800 American Indians under Major Robert Dickson, and at least 2,000 more under Tecumseh. Procter met Croghan under a flag of truce and urged him to surrender, but Croghan refused. The British then bombarded the fort by artillery and gunboat, to little effect. Croghan returned fire with his single cannon, \"Old Betsy\" while frequently changing its position in the hopes that the British would believe he had more than one artillery piece. When Croghan's supply of ammunition ran low, he ordered his men to cease fire."]}, {"page": "Robert Heriot Barclay", "response": ["For the next few weeks, Barclay maintained a blockade of Presqu'Isle, preventing the Americans under Oliver Hazard Perry from crossing the sandbar at the mouth of the harbour. He meanwhile repeatedly requested that Yeo send him more sailors and arms, and that the Lieutenant Governor of Upper Canada (Major General Francis de Rottenburg) reinforce the troops at Amherstburg under Major General Henry Procter. Neither senior officer sent the requested help."]}, {"page": "Joseph Wanton Morrison", "response": ["In July 1814, Morrison was severely wounded at the Battle of Lundy's Lane, and saw no further action in the War of 1812, although he was a member of the court martial board which tried Major General Henry Procter for negligence following the defeat at the Battle of Moraviantown."]}, {"page": "Canadian units of the War of 1812", "response": ["Late in 1813, following the Battle of Lake Erie, the Americans recaptured Detroit, captured Amherstburg and defeated the retreating British army under Major General Henry Procter at the Battle of the Thames. From then until the end of the war, only small outposts of British regulars were stationed in the Western Districts of Kent, Essex and Norfolk. During 1814, American troops made several raids from Detroit or Lake Erie against these, causing much destruction. The local militia could not stop a determined expedition (for example, that which resulted in the Battle of Malcolm's Mills), but could stop small scale nuisance raids. The Essex and Kent militias are perpetuated in the Canadian Army by the Essex and Kent Scottish Regiment."]}, {"page": "James Winchester", "response": ["Early in 1813, Winchester took part in an attempt to recapture Frenchtown (present day Monroe, Michigan). On January 18, his men drove off a smaller Canadian and Indian force and recaptured the American town. However, his men were attacked four days later by a combined British/Indian/Canadian force under Col. Henry Procter in the Battle of Frenchtown. Winchester himself was captured by Roundhead while trying to reach his men. Following the loss of hundreds of his soldiers in the initial assault, he agreed to order a conditional surrender of the remainder of his troops in exchange for \"a pledge of protection\". Despite Procter's pledge, Indians accompanying the British slaughtered 68 seriously wounded American soldiers in the Massacre of the River Raisin."]}, {"page": "Nancy (1789 ship)", "response": ["On 30 July 1812, Nancy sailed to Fort Erie in convoy with the new Provincial Marine schooner , returning with military supplies and 60 men of the 41st Regiment who then participated in the Siege of Detroit. After the British and members of Tecumseh's Confederacy under Major General Isaac Brock had captured Detroit, Nancy carried troops, stores and provisions between Fort Erie and Detroit during the late summer and autumn. The following spring, on 23 April 1813 Nancy joined a small squadron in moving Major General Henry Procter's division from Amherstburg to Miami Bay, positioning them for what would be an unsuccessful Siege of Fort Meigs."]}, {"page": "Joseph Desha", "response": ["Desha resumed his service in Congress at its next term.  He was disappointed at the decision not to pursue the annexation of Upper Canada and to ignore British impressment of American mariners in favor of pursuing peace with the British. Ultimately, he was dissatisfied with the Treaty of Ghent that ended the war. When William Henry Harrison was being considered by Congress for the position of  general-in-chief in late 1813 and early 1814, Desha opposed giving him the title because he claimed that Harrison had determined not to pursue British General Henry Procter following the Battle of the Thames and had only done so after strenuous urging by Isaac Shelby.Quimby, p. 288 Desha's charge was a contributing factor in Congress's decision to remove Harrison's name from a resolution of thanks for service in the Northwest Army and withhold from him a Congressional Gold Medal. Both Harrison and Shelby denied Desha's account, and as the issue began to damage Desha's reelection chances, he partially recanted his story.Quimby, pp. 288–289 He claimed that he had only told some friends that Harrison was wary of pursuit during a council of war held at Sandwich, Ontario, after the battle, but that he had not personally witnessed a disagreement over the pursuit between Harrison and Shelby."]}, {"page": "Louis de Watteville", "response": ["As campaigning wound down over the winter, de Watteville took leave in Montreal to meet his wife and family. Here he learned that the War had ended. After presiding over the court martial of Major General Henry Procter, he resumed his command, and in late 1815 was nominated commander in chief of the forces in Upper Canada. He preferred to retire from the army, and lived out the remainder of his life in retirement in Rubigen in Switzerland."]}, {"page": "41st (Welch) Regiment of Foot", "response": ["The regiment embarked for the West Indies in 1793 for service in the French Revolutionary Wars; it took part in the capture of Martinique in March 1794 and the attack on Guadeloupe in April 1794 before returning to England in October 1796.Lomax, pp. 37–40 It was posted to Canada in 1800 and saw service there during the War of 1812.  It fought under Major General Isaac Brock at the siege of Detroit in August 1812Lomax, p. 53 and the Battle of Queenston Heights in October 1812.Lomax, p. 66 Following Brock's death, it fought under Major-General Henry Procter at the Battle of Frenchtown in January 1813Lomax, p. 67 and formed the bulk of the attacking force at the siege of Fort Meigs in April 1813.Lomax, p. 74 It then formed part of the crew of the British naval squadron which was defeated at the Battle of Lake Erie in September 1813Lomax, p. 80 and faced defeat again at the Battle of the Thames in October 1813.Lomax, p. 85 It also took part in the successful Capture of Fort Niagara in December 1813.Lomax, p. 98 Shadrack Byfield, a private in the regiment from 1809 to 1815, took part in many of these battles before losing an arm at Conjocta Creek in 1814 and, after returning home, chronicled the battles in his memoirs."]}, {"page": "Amos Stoddard", "response": ["From May 1 to May 9 of 1813, Fort Meigs was attacked by a large British and Indian force from Canada under Major General Henry Procter (see Siege of Fort Meigs). Early on, Stoddard was wounded in the leg by shrapnel. He survived long enough to see the British retreat, but on May 11 he died from tetanus."]}, {"page": "William K. Bond", "response": ["In July 1813, he was part of the Expedition of Governor Meigs for the relief of Fort Meigs, which had been besieged for a second time by General Henry Procter and Shawnee chief Tecumseh.  On the evening of the second day's march, his regimental commander Colonel Ferguson convened a court martial for a member of the regiment, and appointed Bond as Judge Advocate, in his first appearance as a lawyer."]}, {"page": "Charles Larned", "response": ["During the War of 1812, while Larned was dining with a group of prominent citizens in Shelby County, Kentucky, word came to the group from Governor Isaac Shelby that General William Henry Harrison was in danger of being overwhelmed by British General Henry Procter and his Indian allies. One of the group, Colonel Owen, undertook the organization of a regiment, including Larned and commanded by Governor Shelby himself, to reinforce Harrison's troops. Many of the regiment were slaughtered by the Indians after surrendering to the British, in an event known as the River Raisin Massacre. Larned himself survived and soon rose to the rank of major, and later participated with the regiment in the Battle of the Thames."]}, {"page": "British Band", "response": ["During the 1812 war, Black Hawk and his warriors fought in several engagements with Henry Procter on the borders of Lake Erie. He returned home to Saukenuk to find his rival Keokuk had become the tribe's war chief. After the war ended, Black Hawk signed a peace treaty in May 1816 that re-affirmed the treaty of 1804, a provision Black Hawk later protested ignorance of.Lewis, James. \"Background ,\" The Black Hawk War of 1832, Abraham Lincoln Digitization Project, Northern Illinois University. Retrieved 20 September 2007."]}, {"page": "Henry Procter", "response": ["Henry Procter or Proctor may refer to:", "* Henry Procter (politician) (1883–1955), British politician", "* Henry Procter (British Army officer) (1763–1822)"]}, {"page": "Henry Procter (general)", "response": ["#REDIRECT Henry Procter (British Army officer)"]}, {"page": "Adam Muir (British Army officer)", "response": ["Muir was wounded at Maguaga, but recovered to lead the main body of the 41st at the Siege of Detroit. Later in the year, Muir commanded another detachment sent to aid the Indians attacking Fort Wayne, Indiana. The attack failed, but Muir retreated successfully to Detroit. During the following year, he took part in the Battles of Frenchtown, Fort Meigs and Fort Stephenson. He was one of several officers who became critical of the leadership of the commander of the division, Major General Henry Procter. Finally, he was taken prisoner at the Battle of Moraviantown, when the by now starving and demoralised 41st Regiment gave way before a charge of Kentucky mounted riflemen."]}, {"page": "Paschal Hickman", "response": ["In August 1812, shortly after the beginning of the War of 1812, Hickman raised a company for Col. John Allen's 1st Kentucky Rifle Regiment and served as its Captain. The regiment served in the campaign under Gen. James Winchester against British Gen. Henry Procter and the Shawnee leader Tecumseh. Hickman was seriously wounded in the American victory at the First Battle of Frenchtown on January 18, 1813 and both of his legs had to be amputated. On January 22, the main British force arrived and Winchester was defeated and captured. Fearing the American army under Gen. William Henry Harrison would now move against him, Procter retreated the next day, taking the uninjured prisoners with him and leaving the seriously wounded behind. No sooner had Procter departed than his Indian allies massacred the American wounded. Paschal Hickman was reportedly dragged from a house and tomahawked to death. At least 68 other Kentuckians also died in the massacre.The History of Franklin County, Kentucky: by L. F. Johnson, 1912"]}, {"page": "Old Sandwich Town", "response": ["Sandwich has been the site of significant historic events, such as the beginning of the War of 1812 between Britain and the US, in part fought over the northern border with Canada. This brought various influential military figures to Old Sandwich Town, such as; Chief Tecumseh, British Major Generals Sir Isaac Brock and Henry Procter, and American General William Henry Harrison, who later became the ninth president of the United States. Sandwich also saw action during the Upper Canada Rebellion in 1837-1838; which revealed Sandwich and Windsor to be likely targets for rebellion, and invasion by a Fenian movement from the United States. The Battle of Windsor commenced during December 1838, which confirmed suspicions of American invasion. Hundreds of \"Patriots\" stormed the Canadian frontier of the Detroit River, until they were thwarted by militia in Sandwich."]}]}}