{"wiki_id": "http://www.wikidata.org/entity/Q15989428", "itemLabel": "Pat Ashton", "itemDescription": "British actress (1931-2013)", "wikipedia_url": "https://en.wikipedia.org/wiki/Pat_Ashton", "wikipedia_page": {"main": "Pat Ashton (28 February 1931 – 23 June 2013) was an English actress. Her engaging cockney, blonde persona is best remembered for appearances in English TV-sitcom film spin-offs On the Buses (1971) and Mutiny on the Buses (1972).\nShe was married to Geoff Godwin 1953-1985, separated with 1 child.", "link_mentions": [{"page": "Only When I Laugh (TV series)", "response": ["Guest appearances have been made by Gwen Taylor, John Quayle, Neil McCarthy, Patrick Troughton, Moira Lister, Pat Ashton, Neil Connery, Pamela Cundell, Brenda Cowling, Reginald Marsh, Rosalind Ayres, Ann Beach, Mary Tamm, Karl Howman, Isla Blair, Ronnie Stevens, Stephen Greif, Robert Gillespie, Sylvia Kay and Frank Middlemass."]}, {"page": "The Optimists of Nine Elms", "response": ["* Pat Ashton as Woman at Nursery"]}, {"page": "Bloodbath at the House of Death", "response": ["* Pat Ashton as Barmaid"]}, {"page": "The Gaffer (TV series)", "response": ["* Pat Ashton – Betty", "The cast included Russell Hunter as the radical union shop steward whose interest was in parting Moffatt from as much money as possible to better pay his members, and Pat Ashton as his ineffectual secretary Betty."]}, {"page": "On the Buses (film)", "response": ["*Pat Ashton – Sally"]}, {"page": "Mutiny on the Buses", "response": ["Despite Arthur now having a job, Stan discovers that he cannot afford a flat with the money he is earning, unless he can make more, and so is thrilled when Jenkins reveals to the bus crews that he is planning to arrange the company to run safari tours to Windsor Safari Park, whereupon the driver selected by him to drive the special bus for the tour will receive a larger wage and keep any tips they earn. However, any hope of Stan getting the job are dashed when Blakey informs him that, because both he and the depot manager agree that he is accountable for the mayhem with the fire drill, he will never be allowed to get the job. Later that evening, attending the company's dart competition in the busmen's canteen while debating on how to secure the safari job, trouble arises when he, Jack and Mum are forced to take Olive home, after she starts a fight with Arthur's clippie, Norah (Pat Ashton), for trying to flirt with her husband and getting more attention than herself. A couple of nights later, when they are in the depot after hours, Stan and Jack witness Jenkins having an affair with Norah and use the information to blackmail him into giving Stan the safari job, much to Blakey's shock.", "*Pat Ashton as Norah"]}, {"page": "Dante's Inferno (1967 film)", "response": ["*Pat Ashton as Fanny Cornforth"]}, {"page": "Party Party (film)", "response": ["* Pat Ashton – Johnny's Mum"]}, {"page": "Ashton (surname)", "response": ["*Pat Ashton (1931–2013), English actress"]}, {"page": "2013 in the United Kingdom", "response": ["**Pat Ashton, 82, actress."]}, {"page": "Deaths in June 2013", "response": ["*Pat Ashton, 82, English actress (The Benny Hill Show).Pat Ashton obituary"]}, {"page": "Nearest and Dearest (film)", "response": ["*Freda...Pat Ashton"]}, {"page": "Thick as Thieves (TV series)", "response": ["Thick as Thieves is a British sitcom which was broadcast on ITV between 1 June and 20 July 1974 and produced by London Weekend. It was created and written by Dick Clement and Ian La Frenais. There were 8 episodes over one series and starred Bob Hoskins, John Thaw and Pat Ashton.", "The plot revolves mainly around George (Bob Hoskins), whose last job as a house burglar ended up with his getting sent to prison.  After three long years, he returns to his home and wife Annie (Pat Ashton), only to find everything is not quite as he left it.  His best friend Stan (John Thaw) moved into George's house with his wife eight months previously.  This was the moment Annie and Stan were dreading, but when it came to the crunch she found she not only loved Stan, but also still loved husband George.  Confused, and not helped by George's perhaps understandable annoyance at the situation, she finds she is unable to decide which will stay and which will go.  As the series moves on the answer to the trios problems doesn't get any clearer.", "* Pat Ashton as Annie", "Pat Ashton who played Annie was almost 11 years older than Bob Hoskins who played her husband George, and nearly 12 years older than John Thaw who played her lover, Stan."]}, {"page": "Both Ends Meet", "response": ["*Pat Ashton, as Glad"]}]}}