{"wiki_id": "http://www.wikidata.org/entity/Q15996217", "itemLabel": "Ned Bromley", "itemDescription": "English footballer (1869-1942)", "wikipedia_url": "https://en.wikipedia.org/wiki/Ned_Bromley", "wikipedia_page": {"main": "Charles Edward \"Ned\" Bromley (1869–1 April 1942) was an English footballer. Originally from Southampton, he played as a forward for local side St. Mary's between their formation in 1885 and 1889.", "link_mentions": [{"page": "Ralph Ruffell", "response": ["Ruffell was born in Southampton and was associated with St. Mary's Church; the St Mary's Church of England Young Men's Association decided to arrange a football match against Freemantle, which took place on 21 November 1885 on a pitch in Northlands Road, where the Hampshire Bowling Club was subsequently situated, close to the County Cricket Ground, with Ruffell playing in goal. The \"Saints\" won the match 5–1 with three goals from Ned Bromley and two from Arthur Fry; Freemantle's goal was an own goal when the ball came off a defender's legs after a corner."]}, {"page": "1885–86 St. Mary's Y.M.A. season", "response": ["*Charles Edward Bromley (1869–1942) (known as \"Ned Bromley\") took over from A. A. Fry as captain in 1886; he remained with the club until 1889, when he was seriously injured in a six-a-side tournament. He had relinquished the captaincy to George Carter in the summer of 1888, when he moved to London to study dentistry. He was a prolific goalscorer and was the top goalscorer in each of the first three seasons, scoring a hat-trick in the inaugural match and four against Petersfield on 17 December 1887."]}, {"page": "Charles Bromley", "response": ["#REDIRECT Ned Bromley"]}, {"page": "1887–88 St. Mary's Y.M.A. season", "response": ["The visitors could only muster ten men, and had two of their best players absent, and the Saints won easily, 10–0, with five goals from A. A. Fry and five from Ned Bromley.", "The Southampton Times estimated the crowd for the final at approximately 600, despite the \"threatening\" weather. St. Mary's fell behind early in the game and were 2–0 down at half-time but fought back to draw level at 2–2, with goals from Warn and Ned Bromley who unleashed a \"splendid shot\" with three minutes left to play. The match report in the Bournemouth Guardian however claimed that St. Mary's had scored a third goal but failed to claim it, as required by the rules \"to the astonishment of both umpires and referee\". In the absence of goal nets, the ball had crossed the line, but the Harriers \"kicked off from the six yards' mark and no claim was made by St. Mary's for the point. I can't imagine how the Saints, who must be kicking themselves with chagrin at the slip, lost sight of the goal. I don't think they will get the chance again.\"", "The replay was played two weeks later, again at the County Ground in front of a crowd of \"over 500 people, exclusive of the ladies who, bless 'em, are admitted free.\" St. Mary's took a 2–0 lead through McDonald and Warn (after some \"pretty passing\") before the Harriers pulled one back. The report in the Southampton Times concluded: \"Soon the final whistle sounded leaving \"Saints\" victorious by two goals to one. Though the Harriers played a great game, the St. Mary's played better football.\" The cup was presented to the \"Saints\" captain, Ned Bromley, with each of the winning team being presented with a silver medal \"in commemoration of the match\". ", "*  Frank Bromley was the brother of Ned Bromley. He played as a forward and remained with the club until 1891, helping them win the Hampshire Senior Cup."]}, {"page": "1888–89 St. Mary's F.C. season", "response": ["At the start of the season, the St. Mary's captain, Ned Bromley had moved to London to study dentistry; his role as captain was taken over by George Carter, although Bromley remained with the club, and continued to play in important matches, travelling from London by train.", "Ned Bromley's career came to an end shortly after the 1889 final of the Hampshire Junior Cup, when he was seriously injured in a six-a-side tournament.", "The defence of the Hampshire Junior Cup started with a home match against Havant played at the County Ground on 24 November 1888. With Ned Bromley and George Muir  being unavailable as they were both away studying, the Saints' team had a rather makeshift appearance with A. A. Fry playing at full-back in place of Muir, alongside George Carter, Frank Bromley replacing his brother as a forward and four players (Stride, Mate, Delamotte and Farwell) making their competitive debut. The match was won easily 5–0, with Frank Bromley scoring four goals.", "St. Mary's received a bye in the next round seeing them through to a home tie against Fordingbridge Turks, the oldest team in Hampshire having been founded in 1868. The match was scheduled to be played on 12 January which coincided with a Hampshire F.A. match against Berks & Bucks F.A. for which four St. Mary's players (Ruffell, Carter, Stride and Ned Bromley) had been selected. St. Mary's tried to have the cup match postponed but Fordingbridge refused so the St. Mary's players were withdrawn from the Hampshire F.A. squad. As a result of the doubt over the date of the match, no ground had been organised; on the Saturday morning, Mr. Oswald, the owner of  the Oswald, Mordaunt & Co. shipyard in Woolston \"kindly allowed them to play at the Antelope\". The shipyard's football team, Woolston Works were now tenants of the Antelope Ground, which stood near the top of St. Mary's Road. The match was a close-fought encounter which St. Mary's won (as reported in the Southampton Times) \"by three goals and one disputed goal to two\"."]}]}}