{"wiki_id": "http://www.wikidata.org/entity/Q15971250", "itemLabel": "Norman MacMullen", "itemDescription": "British general", "wikipedia_url": "https://en.wikipedia.org/wiki/Norman_MacMullen", "wikipedia_page": {"main": "General Sir Cyril Norman MacMullen, KCB, CMG, CIE, DSO (13 December 1877 – 12 November 1944) was a British officer in the British Indian Army.", "link_mentions": [{"page": "Battle of Passchendaele", "response": ["Preparations for operations in Flanders began in 1915, with the doubling of the Hazebrouck–Ypres rail line and the building of a new line from Bergues to Proven, which was doubled in early 1917. Progress on roads, rail lines, railheads and spurs in the Second Army zone was continuous and by mid-1917, gave the area the most efficient supply system of the BEF. Several plans and memoranda for a Flanders offensive were produced between January 1916 and May 1917, in which the writers tried to relate the offensive resources available to the terrain and the likely German defence. In early 1916, the importance of the capture of the Gheluvelt plateau for an advance further north was emphasised by Haig and the army commanders. On 14 February 1917, Colonel Norman MacMullen of GHQ proposed that the plateau be taken by a massed tank attack, reducing the need for artillery; in April a reconnaissance by Captain Giffard LeQuesne Martel found that the area was unsuitable for tanks."]}, {"page": "Aide-de-camp general", "response": ["| General Sir Norman MacMullen, Indian Army || 29 June 1931 || 12 September 1935 ||"]}, {"page": "Operation Hush", "response": ["Hunter-Weston rejected the plan because it was an attack on too narrow a front. Ostend harbour was in range of German heavy guns and the exits from the harbour were easy to block. Bacon began work on a new plan for a beach landing near Middelkirke, which incorporated Hunter-Weston's recommendations and also Haig's desire for tanks to be used in the landings. The Battle of the Somme in 1916 forced Haig to postpone an offensive in Flanders until 1917 and the coastal attack depended on retaining the Yser bridgehead, because the river was deep, tidal, and  wide. Lieutenant-Colonel Norman MacMullen (GSO I) and a small planning group formed in January 1917 at General Headquarters (GHQ), recommended that the operation should not begin until a general advance from Ypres had reached Roulers, which Haig accepted. A coastal offensive was to be conducted if one of three conditions were met, that the offensive at Ypres had prompted a collapse in the German defence or if the Germans took troops from the coast to replace losses in a long battle in the Ypres area or if the Allied advance at Ypres had reached Passchendaele ridge and the Fifth Army was advancing on Roulers and Thourout."]}, {"page": "Eastern Command (India)", "response": ["|Sir Norman MacMullen"]}, {"page": "List of British Army full generals", "response": ["| Cyril Norman MacMullen||1877||1944||"]}, {"page": "Adjutant-General (India)", "response": ["| Sir Norman MacMullen"]}, {"page": "1935 New Year Honours", "response": ["*General Sir Cyril Norman MacMullen  Indian Army, Aide-de-Camp General to The King, General Officer Commanding-in-Chief, Eastern Command, India."]}, {"page": "Arthur Young (rugby union, born 1901)", "response": ["Young was born in Darjeeling, India in 1901. As a child he moved to Britain and was educated at Tonbridge School before matriculating to Gonville and Caius College, Cambridge. On leaving education he joined the British Army, serving in the Royal Tank Corps. Later in his career he was Aide-de-camp to Sir Norman MacMullen while he was General Officer Commanding Eastern Command in India. While serving in India he contracted influenza and died in 1933 from pneumonia at the age of 31."]}, {"page": "1919 New Year Honours", "response": ["*Major and Brevet Colonel Cyril Norman MacMullen  15th Sikhs, Indian Army"]}]}}