{"wiki_id": "http://www.wikidata.org/entity/Q159051", "itemLabel": "Alfred Pennyworth", "itemDescription": "fictional character throughout the DC Universe", "wikipedia_url": "https://en.wikipedia.org/wiki/Alfred_Pennyworth", "wikipedia_page": {"main": "Alfred Thaddeus Crane Pennyworth or simply Alfred is a fictional character appearing in American comic books published by DC Comics, most commonly in association with the superhero Batman.Pennyworth is depicted as Bruce Wayne's loyal and tireless butler, legal guardian, best friend, aide-de-camp, and surrogate father figure following the murders of Thomas and Martha Wayne. As a classically trained British actor and an ex-Special Operations Executive operative of honor and ethics with connections within the intelligence community, he has been called \"Batman's batman\". He serves as Bruce's moral anchor while providing comic relief with his sarcastic and cynical attitude. A vital part of the Batman mythos, Alfred was nominated for the Wizard Fan Award for Favorite Supporting Male Character in 1994.In non-comics media, the character has been portrayed by actors Richard Dean Anderson William Austin, Eric Wilton, Michael Gough, Michael Caine, Jeremy Irons and Douglas Hodge on film, and by Alan Napier, Efrem Zimbalist Jr., Ian Abercrombie, David McCallum, and Sean Pertwee on television. Ralph Fiennes voiced Alfred in two animated films, and Martin Jarvis has voiced the character in the Batman: Arkham video game series. A young version of Alfred, played by Jack Bannon, depicts him before he became the butler to the Wayne family in the television series Pennyworth. The character will be played by Andy Serkis in the 2022 film The Batman.", "link_mentions": [{"page": "Batman", "response": ["Batman is a superhero who appears in American comic books published by DC Comics. The character was created by artist Bob Kane and writer Bill Finger, and debuted in the 27th issue of the comic book Detective Comics on March 30, 1939. In the DC Universe continuity, Batman is the alias of Bruce Wayne, a wealthy American playboy, philanthropist, and industrialist who resides in Gotham City. Batman's origin story features him swearing vengeance against criminals after witnessing the murder of his parents Thomas and Martha, a vendetta tempered with the ideal of justice. He trains himself physically and intellectually, crafts a bat-inspired persona, and monitors the Gotham streets at night. Kane, Finger, and other creators accompanied Batman with supporting characters, including his sidekick Robin; allies Alfred Pennyworth, James Gordon, and Catwoman; and foes such as the Penguin, the Riddler, Two-Face, and his archenemy, the Joker.", "Batman's butler, Alfred Pennyworth, first appeared in Batman #16 (1943). He serves as Bruce Wayne's loyal father figure and is one of the few persons to know his secret identity. Alfred raised Bruce after his parents' death and knows him on a very personal level. He is sometimes portrayed as a sidekick to Batman and the only other resident of Wayne Manor aside from Bruce. The character \"[lends] a homely touch to Batman's environs and [is] ever ready to provide a steadying and reassuring hand\" to the hero and his sidekick.Boichel, p. 8.", "In early strips, Batman's career as a vigilante earns him the ire of the police. During this period, Bruce Wayne has a fiancé named Julie Madison.She first appears in Detective Comics #31 (September 1939) In Detective Comics #38, Wayne takes in an orphaned circus acrobat, Dick Grayson, who becomes his vigilante partner, Robin. Batman also becomes a founding member of the Justice Society of America, although he, like Superman, is an honorary member, and thus only participates occasionally. Batman's relationship with the law thaws quickly, and he is made an honorary member of Gotham City's police department. During this time, Alfred Pennyworth arrives at Wayne Manor, and after deducing the Dynamic Duo's secret identities, joins their service as their butler.Batman #16 (May 1943); his original last name, Beagle, is revealed in Detective Comics #96 (February 1945)", "After the 12-issue miniseries Crisis on Infinite Earths, DC Comics retconned the histories of some major characters in an attempt at updating them for contemporary audiences. Frank Miller retold Batman's origin in the storyline \"Year One\" from Batman #404–407, which emphasizes a grittier tone in the character. Though the Earth-Two Batman is erased from history, many stories of Batman's Silver Age/Earth-One career (along with an amount of Golden Age ones) remain canonical in the Post-Crisis universe, with his origins remaining the same in essence, despite alteration. For example, Gotham's police are mostly corrupt, setting up further need for Batman's existence. The guardian Phillip Wayne is removed, leaving young Bruce to be raised by Alfred Pennyworth. Additionally, Batman is no longer a founding member of the Justice League of America, although he becomes leader for a short time of a new incarnation of the team launched in 1987. To help fill in the revised backstory for Batman following Crisis, DC launched a new Batman title called Legends of the Dark Knight in 1989 and has published various miniseries and one-shot stories since then that largely take place during the \"Year One\" period."]}, {"page": "The Big O", "response": ["The Big O's cast of supporting characters includes Norman, Roger's faithful mechanically-inclined butler who fills the role of Alfred Pennyworth; R. Dorothy Wayneright, who plays the role of the sidekick; and Dan Dastun, a good honest cop who, like Jim Gordon, is both a friend to the hero and greatly respected by his comrades."]}, {"page": "Batman (1989 film)", "response": ["*Michael Gough as Alfred Pennyworth", "Tom Mankiewicz completed a script titled The Batman in June 1983, focusing on Batman and Dick Grayson's origins, with the Joker and Rupert Thorne as villains, and Silver St. Cloud as the romantic interest. Mankiewicz took inspiration from the limited series Batman: Strange Apparitions, written by Steve Englehart. Comic book artist Marshall Rogers, who worked with Englehart on Strange Apparitions, was hired for concept art. The Batman was then announced in late 1983 for a mid-1985 release date on a budget of $20 million. Originally, Mankiewicz had wanted an unknown actor for Batman, William Holden for James Gordon, David Niven as Alfred Pennyworth, and Peter O'Toole as the Penguin, whom Mankiewicz wanted to portray as a mobster with low body temperature. Holden died in 1981 and Niven in 1983, so this would never come to pass. A number of filmmakers were attached to Mankiewicz' script, including Ivan Reitman and Joe Dante. Reitman wanted to cast Bill Murray as Batman and Eddie Murphy as Robin. Nine rewrites were performed by nine separate writers. Most of them were based on Strange Apparitions. However, it was Mankiewicz's script that was still being used to guide the project. Due to the work they did together with the film Swamp Thing (1982), Wes Craven was among the directors that Melniker and Uslan considered while looking for a director."]}, {"page": "Batman Returns", "response": ["* Michael Gough as Alfred Pennyworth: The Wayne family's butler and Batman's accomplice, who has helped and raised him since his parents' death. Along with Pat Hingle, Gough was one of the few actors who appeared in all four films of the initial Batman film series."]}, {"page": "Batman & Robin (film)", "response": ["At a Wayne Enterprises lab in Brazil, botanist Dr. Pamela Isley is working under the deranged Dr. Jason Woodrue, experimenting with a drug called Venom. She witnesses Woodrue use the formula to turn serial killer Antonio Diego into a hulking monstrosity, whom he dubs \"Bane.\" When Isley threatens to expose Woodrue's experiments, he attempts to kill her by overturning a shelf of various toxins. Isley transforms into the beautiful and seductive Poison Ivy before killing Woodrue with her poisonous kiss, setting fire to the lab, and escaping with Bane. She finds that Wayne Enterprises funded Woodrue, though they eventually cut Woodrue's funding. Poison Ivy concocts a plan to use Wayne's money to support her research, and goes to Gotham City with Bane. Meanwhile, Alfred Pennyworth's niece, Barbara Wilson, makes a surprise visit and is invited by Bruce to stay at Wayne Manor until she goes back to school.", "* Michael Gough as Alfred Pennyworth:  The trusted butler for Bruce Wayne and Dick Grayson. Alfred is dying of a rare disease from which Mr. Freeze's wife also suffers.", "** Jon Simmons as Young Alfred Pennyworth."]}, {"page": "Batman Forever", "response": ["* Michael Gough as Alfred Pennyworth: The Wayne family's faithful butler and Bruce's confidant. Alfred also befriends the young Dick Grayson.", "Production went on fast track with Rene Russo cast as Chase Meridian but Keaton decided not to reprise Batman because he did not like the direction the series was headed in and rejected the script. Keaton also wanted to pursue \"more interesting roles\", turning down $15 million. A decision was made to go with a younger actor for Bruce Wayne, and an offer was made to Ethan Hawke, who turned it down but eventually regretted the decision. Schumacher had seen Val Kilmer in Tombstone, but was also interested in Keanu Reeves, Alec and William Baldwin, Dean Cain, Tom Hanks, Kurt Russell, Ralph Fiennes (who would later voice Alfred Pennyworth in The Lego Batman Movie), Daniel Day-Lewis and Johnny Depp. Cain was scrapped as he was well known for starring in the TV series Lois & Clark: The New Adventures of Superman. Kilmer, who as a child visited the studios where the 1960s series was recorded and shortly before had visited a bat cave in Africa, was contacted by his agent for the role. Kilmer signed on without reading the script or knowing who the director was."]}, {"page": "Batman: Year One", "response": ["Bruce believes he is still unprepared to fight against crime despite having the skills he learnt from abroad. He goes in disguise on a surveillance mission in Gotham's red-light district, but he refuses a proposition from teenage prostitute Holly Robinson. He is reluctantly drawn into a brawl with her pimp and several prostitutes, including dominatrix Selina Kyle. Two police officers shoot him on sight and take him away in their squad car. Bruce breaks free and flees from the scene as soon as possible. He reaches Wayne Manor barely alive and sits before his father's bust, requesting guidance in his war against crime. A bat suddenly crashes through a window and settles on the bust, giving him the inspiration to become the Batman. Bruce quickly rings up his butler Alfred Pennyworth to patch up his injuries and proposes the idea of saving Gotham as Batman.", "In 2011, an animated adaptation was released as a DC Universe Animated Original Movie. It was produced by Bruce Timm, co-directed by Lauren Montgomery and Sam Liu. It features the voices of Benjamin McKenzie as Bruce Wayne/Batman, Bryan Cranston as James Gordon, Eliza Dushku as Selina Kyle/Catwoman, Katee Sackhoff as Sarah Essen, Grey DeLisle as Barbara Gordon, Jon Polito as Commissioner Loeb, Alex Rocco as Carmine 'The Roman' Falcone, and Jeff Bennett as Alfred Pennyworth. The movie premiered at Comic-Con, with a Catwoman short shown in October."]}, {"page": "Lord Voldemort", "response": ["Voldemort appears in The Lego Batman Movie as one of the prisoners in the Phantom Zone that Joker recruits to take over Gotham City. Though Ralph Fiennes is featured in this movie as the voice of the British butler Alfred Pennyworth, he does not reprise his role as Voldemort. Instead, Voldemort is voiced by Eddie Izzard."]}, {"page": "Michael Caine", "response": ["Caine is also known for his performance as Ebenezer Scrooge in The Muppet Christmas Carol (1992), and for his comedic roles in Dirty Rotten Scoundrels (1988), Miss Congeniality (2000), Austin Powers in Goldmember (2002), and Secondhand Lions (2003). He received his second Golden Globe Award for Little Voice (1998). In 1999, he received his second Academy Award for Best Supporting Actor for his performance as a sympathetic doctor in The Cider House Rules. He portrayed a British journalist in Vietnam in The Quiet American (2002), earning his sixth Oscar nomination, and appeared in Alfonso Cuaron's dystopian drama film Children of Men (2006). Caine portrayed Alfred Pennyworth in Christopher Nolan's The Dark Knight Trilogy (2005–2012). He appeared in several other of Nolan's films including The Prestige (2006), Inception (2010), Interstellar (2014) and Tenet (2020). He also appeared in the heist thriller film Now You See Me (2013), the action comedy film Kingsman: The Secret Service (2014), the Italian drama Youth (2015) and the crime film King of Thieves (2018).", "In 2005, he was cast as Bruce Wayne's butler Alfred Pennyworth in Batman Begins, the first movie in the new Batman film series known as The Dark Knight Trilogy. In 2006, he appeared in Alfonso Cuaron's acclaimed dystopian drama Children of Men alongside Clive Owen and Julianne Moore as well as Nolan's mystery thriller The Prestige starring Hugh Jackman and Christian Bale. In 2007 he appeared in Flawless, and in 2008 and 2012 he reprised his role as Alfred in Christopher Nolan's critically acclaimed Batman sequels, The Dark Knight and The Dark Knight Rises as well as starring in the British drama Is Anybody There?, which explores the final days of life.", "Caine reprised his role as Alfred Pennyworth in the Batman sequel, The Dark Knight Rises, which was released in July 2012. Caine later called The Dark Knight Trilogy, \"one of the greatest things I have done in my life.\" In 2013, Caine appeared in the heist thriller Now You See Me starring alongside Jesse Eisenberg, Mark Ruffalo, Isla Fisher, Woody Harrelson, and Morgan Freeman. Caine played the role of Arthur Tressler, an insurance magnate and the Four Horsemen's sponsor. The film, despite receiving mixed reviews from critics was a financial success at the box office and spawned a sequel, Now You See Me 2 (2016).", "A parody of Caine appears in the animated series Ugly Americans, in the episode \"The Dork Knight\", which also parodies the film The Dark Knight. In the episode, Caine appears as himself, portrayed in the light of his Alfred Pennyworth interpretation, and constantly annoys the protagonists with endless anecdotes of his career."]}, {"page": "The Dark Knight Returns", "response": ["Inspired by Batman, Kelley buys an imitation Robin costume and searches for him. Although Batman defeats the Mutants at the city dump with the Batmobile's advanced weaponry, the Mutant Leader goads him into a hand-to-hand fight. Batman, due to his age and a decade of physical inactivity, is beaten and almost killed. Kelley creates a diversion which allows her and Batman to return to the Batcave, where Wayne's butler Alfred Pennyworth tends to his wounds. Impressed with her bravery, Wayne decides to make Kelley his new protegee. Batman strategically defeats the Mutant Leader in a fight surrounded by the Mutants. Seeing Batman defeat their leader, the Mutants disband into smaller gangs. One of these gangs rename themselves the Sons of the Batman, using excessive violence against criminals.", "* Alfred Pennyworth: Wayne's trusted butler, medic, and confidant; now in his 80s."]}, {"page": "Poison Ivy (character)", "response": ["In one of the annuals of Batman: Shadow of the Bat, a mutual attraction between Poison Ivy and the Batman is obvious right from the start. Ivy considers Batman \"the perfect man\", and in a conversation with his butler, Alfred Pennyworth, he admits to finding her attractive and more appealing than Catwoman. She subsequently targets Bruce Wayne as one of those she blames for recent environmental 'crimes', giving him her poisoned kiss, but when she kisses Batman later and brags about how a second kiss is the antidote, Batman thus creates the impression that he is immune to her poisons.", "In the 2004 story Batman/Poison Ivy: Cast Shadows, Batman and Ivy work together to find a killer carrying out a series of Ivy-like murders at Arkham. His butler, Alfred Pennyworth, notes that Batman has been poisoned by the flowers. Batman tells Alfred he must kiss Poison Ivy for the cure, and that if he fails Alfred must kill him. Ivy and Batman confront each other, where Batman warns Ivy that he'll have to knock her out to kiss her to make sure that she doesn't kill him when he passes out after being cured. Ivy insists for him to trust her, despite Batman's doubts. Batman at first decides to punch her, hesitates, then they embrace and kiss passionately instead. Upon being cured, he falls, but saves himself, and saves Ivy as Gotham Tower collapses when — assuming Batman dead — Poison Ivy tries to kill herself, once more insinuating that it is more than just lust she feels for him. Ivy and Batman share a moment together speaking, watching her plant creations create light, and Batman compliments her on her talent. Batman takes Ivy back to Arkham Asylum, so that Ivy can finish her rehabilitation. Discouraged, Ivy complains to Batman about the lack of light in her cell, and Batman  responds that there is nothing he can do about it, before departing. Transferred to a new cell the next morning, Ivy is stunned when she discovers that someone has had her room moved to a special cell where she can be in the sunlight, and has been filled with flowers as a gift. Upon being told some \"anonymous benefactor\" wanted to make sure her time isn't as daunting as it might have been, a touched Ivy smiles and thanks Batman."]}, {"page": "Jay and Silent Bob", "response": ["After winning $10 million from a scratchcard they bought at the Quick Stop, Jay & Silent Bob decide to become superheroes Bluntman and Chronic (a parody of Batman and Robin). They build a secret Fortress of Solitude beneath RST Video and acquire all the necessary gadgets and accessories to make them ideal crime-fighters. They also hire their own butler, Albert (a parody of Alfred Pennyworth)."]}, {"page": "Robin (character)", "response": ["Originally conceived to become a host for his maternal grandfather's soul as well as a pawn against the Dark Knight, Batman saved his child from this fate, which forced Ra's to inhabit his own son's body, and thus, Damian was affectionate to his father.  After Batman's apparent death during Final Crisis, Talia left her son under Dick Grayson and Alfred Pennyworth's care and Damian was deeply affected by his father's absence. In the first issue of \"Battle for the Cowl\", Damian was driving the Batmobile and was attacked by Poison Ivy and Killer Croc. Damian was rescued by Nightwing, who then tries to escape, but was shot down by Black Mask's men. Nightwing tried to fight the thugs, but the thugs were shot by Jason Todd. After a fight between Nightwing and Todd, Todd eventually shot Damian in the chest. In the final issue of the series, Alfred made Damian into Robin. Damian's first task as Robin was to rescue Tim. After \"Battle for the Cowl\", Grayson adopted the mantle of Batman, and instead of having Tim (who he viewed as an equal rather than a protégé) remain as Robin, he gave the role to Damian, who he felt needed the training that his father would have given him.", "Elseworlds versions of DC characters are ones that exist in alternate timelines or realities that take place in entirely self-contained continuities. In Elseworlds, Robin has been a German immigrant during World War II named Richart Graustark, Bruce Wayne Jr. (the son of Julia Madison and Bruce Wayne), a genetically enhanced ape named Rodney, a samurai named Tengu, a pirate's cabin boy, a girl traveling via space ship to a far-off colonial planet, Bruce Wayne's nephew Thomas Wayne III, MI-6 agent Alfred Pennyworth, Bruce Wayne's sister during the Reign of Terror in France, and a Native American named Red Bird."]}, {"page": "Batman (military)", "response": ["In DC Comics media, Alfred Pennyworth (Batman's butler, created in 1943) has been referred to multiple times as \"Batman's batman.\" Currently unsubstantiated rumors have it that Alfred was also Thomas Wayne's (Bruce Wayne's late father) batman when both men were in military service."]}, {"page": "Superman: The Animated Series", "response": ["Several episodes involve Superman encountering other superheroes in the DC universe. Batman appears the most often, along with several of his allies and antagonists from The New Batman Adventures, including The Joker, Robin, Alfred Pennyworth, Harley Quinn, Bane, Commissioner Gordon, and Ra's al Ghul, among others. In addition, other episodes feature The Flash (alongside the Weather Wizard), Green Lantern (Kyle Rayner) (with Sinestro and the Green Lantern Corps), Aquaman, and Doctor Fate (along with his wife Inza and Karkull)."]}, {"page": "Batman: The Animated Series", "response": ["At the age of eight, Bruce Wayne, the son of billionaire philanthropists, witnessed the murder of his parents, Thomas and Martha, during a mugging on the street. The event left him traumatized and mentally scarred for the rest of his life. This left Bruce to be cared for by his family's butler, Alfred Pennyworth. Over the years, Bruce slowly turned the pain and trauma he sustained into a burning fuel for a lifelong obsession, as he underwent rigorous training in mental and physical conditioning, the martial arts, criminology, sciences, manhunting, forensics, detective work, interrogation methods and intimidation, for the next years of his life. Having observed the rampant crime and corruption across Gotham City, he chose to deal with the crime-wave in Gotham in his own way, by using his years of training and swore an oath to dedicate his entire life to fighting crime, in a bid to avenge the murder of his parents and to use his pain and suffering to drive him to do good, while being guided by his self-enforced moral code to never kill and to refrain from using firearms. Inspired by the presence of bats, his childhood fear, which used to be present around his home, Bruce chose to undertake the alias of The Batman, a feared, near-mythical and bat-masked vigilante.", "Other antagonists that appeared in the series included classic villains such as Poison Ivy, Catwoman, the Riddler, Two-Face, the Mad Hatter, Ra's al Ghul, Talia al Ghul, Man-Bat, the Penguin, the Scarecrow, Killer Croc, Bane, the Ventriloquist and his dummy Scarface, Hugo Strange and Tony Zucco. Friends and allies of Batman featured in the show not previously mentioned include Alfred Pennyworth, Harvey Bullock, the Gray Ghost (an original character created by the series to portray Bruce Wayne's childhood hero and crimefighting inspiration, voiced by Adam West, the actor who had played Batman in the 1960s Batman series), Lucius Fox, and Leslie Thompkins.", "| Clive Revill || Alfred Pennyworth (first three episodes in production order) ", "| Efrem Zimbalist Jr. || Alfred Pennyworth (the rest of the series) "]}, {"page": "Ralph Fiennes", "response": ["Fiennes has appeared in a number of other notable films, including  Quiz Show (1994), Strange Days (1995), The End of the Affair (1999), Red Dragon (2002), Maid in Manhattan (2002), The Constant Gardener (2005), In Bruges (2008), The Reader (2008), Clash of the Titans (2010), Great Expectations (2012), The Grand Budapest Hotel (2014), and The King's Man (2021). He voiced Rameses in The Prince of Egypt (1998), Lord Victor Quartermaine in Wallace & Gromit: The Curse of the Were-Rabbit (2005) and Alfred Pennyworth in The Lego Batman Movie (2017). Fiennes starred in the Harry Potter film series (2005–2011), in which he played the franchise's main antagonist, Lord Voldemort. He starred in the James Bond series, in which he has played Gareth Mallory / M in Skyfall (2012), Spectre (2015) and No Time to Die (2021).", "In 2015, Fiennes starred in Luca Guadagnino's thriller A Bigger Splash alongside Dakota Johnson and Tilda Swinton. In 2016, Fiennes appeared in the Coen brothers ensemble comedy film Hail, Caesar! which is set in 1950s Hollywood. Fiennes plays the fictional Laurence Laurentz, an acclaimed European film director within the movie. That same year, he lent his voice in the stop-motion animated film Kubo and the Two Strings where he played Raiden the Moon King, Kubo's grandfather. In 2017, he voiced the British butler Alfred Pennyworth in  The Lego Batman Movie, and reprised the role in The Lego Movie 2: The Second Part (2019). In 2018, he directed and starred in The White Crow, a biographical drama film about the Russian ballet dancer Rudolf Nureyev."]}, {"page": "Chauffeur", "response": ["* Alfred Pennyworth, Bruce Wayne's tireless valet, assistant, butler, chauffeur, confidant, best friend, and surrogate father figure"]}, {"page": "Phantom Zone", "response": ["* In The Lego Batman Movie, the Phantom Zone appears as a prison for the most dangerous villains in the Lego universe. The setting on the Phantom Zone Projector when releasing the inmates are \"Dark Lords Only\", \"Witches & Queens Only\", \"Monsters & Robots Only\", and \"Release All Inmates\". Its gatekeeper \"Phyllis\" (voiced by Ellie Kemper) resembles a generic Lego brick and reviews the bad things the new arrivals have done. The Phantom Zone's inmates consist of villains from various fictional franchises including General Zod, King Kong, Lord Voldemort from Harry Potter, the Eye of Sauron from Lord of the Rings, the Daleks from Doctor Who, the Gremlins, the Wicked Witch of the West and her Flying Monkeys from The Wizard of Oz, Lord Vampyre, the Evil Mummy, and the Swamp Creature from Lego Monster Fighters, the Kraken from Clash of the Titans, Medusa from Lego Minifigures, the skeletons from Jason and the Argonauts, Agent Smith and his clones from The Matrix, the titular great white shark from Jaws, and the Tyrannosaurus rex and Velociraptors from Jurassic Park. This group of villains have been referred to as the \"Ubers\" in the credits. Superman talked about it on the news program \"Metropolis in Focus\" as a tie-in to his latest victory over General Zod. When the Joker gets sent to the Phantom Zone by Batman, he persuades the inmates that he meets in the Phantom Zone to help him take over Gotham City. After infiltrating Arkham Asylum, Harley Quinn helps release them using the Phantom Zone Projector under the \"Release All Inmates\" option. With help from Robin, Batgirl, Alfred Pennyworth, and Gotham City's villains, Batman manages to defeat the villains and send them back to the Phantom Zone. This is the second depiction of the Joker being banished to the Phantom Zone, the first being in the story \"Truth and Justice\" by J.C. Roberts."]}, {"page": "Enn Reitel", "response": ["Reitel does voiceovers for The X Factor. He played the Town Crier and The Maggot in Tim Burton's Corpse Bride and played Auric Goldfinger in the 2004 video game GoldenEye: Rogue Agent. It is his voice that provides the vocals on Lemon Jelly's \"Nice Weather For Ducks\" in 2002. He narrated the in-game promo spot for the Praying Mantis PMC in Metal Gear Solid 4: Guns of the Patriots. He also does Lorenzo Belli's voice from Capcom's survival horror game Haunting Ground. He was also the voice of Billy the ventriloquist dummy in James Wan's movie Dead Silence. He also provided voice performance for the audiobook of the sixth book in Eoin Colfer's Artemis Fowl series, The Time Paradox. Reitel also provided the voice for Delvin Mallory in The Elder Scrolls V: Skyrim and the Wizard Zabodon in The Big Knights. He also provided the voice of Ost Ordura in Kingdoms of Amalur: Reckoning and Alfred Pennyworth in Batman: The Telltale Series. He also played Male Altmer and Dunmer in The Elder Scrolls Online. He also provided voices of The Time Keeper in Skylanders: Swap Force, Laufey in Hulk and the Agents of SMASH, Master Ding in Kung Fu Panda: Legends of Awesomeness, Sebastian Oliver in Adr1ft, Olgan in Baten Kaitos Origins, Bootstrap Bill Turner in Pirates of the Caribbean: Dead Man's Chest, A Male Pedestrian in Infamous, Deraegis in Batman: The Brave and the Bold, Five Leaf Clover Guy, Japanese Deputy, Robertson, Boss Guraji and Fox in TripTank, Edwin Jarvis in Marvel Heroes, An English Spy in American Dad!, Billy in Dead Silence and The Dreamer in The Secret World. In May 2014, Reitel replaced Ade Edmondson as the voice of the Animal in the Peperami adverts.", "|2016||Batman: The Telltale Series || Alfred Pennyworth ||", "|2017||Batman: The Enemy Within ||Alfred Pennyworth ||"]}]}}