{"wiki_id": "http://www.wikidata.org/entity/Q15945878", "itemLabel": "Florence Mildred White", "itemDescription": "English policewoman", "wikipedia_url": "https://en.wikipedia.org/wiki/Florence_Mildred_White", "wikipedia_page": {"main": "Florence Mildred White (10 December 1873 – 29 December 1957) was an English policewoman. She was likely to have been the first documented woman to join a police force in England and Wales, and to be attested immediately as a Constable. Later she was to become the first attested woman officer holding the rank of Inspector, and the first woman police officer to receive a pension on retirement.\nPrior to joining the police force she was a teacher of English in Germany. She later returned to England and taught German, Italian and French at a school in Salisbury, Wiltshire, reaching a senior post. In 1914, aged 41, she moved to the Bath and Bristol city area to join a group of women who had started an unofficial Women's Police Volunteers unit. She returned to Salisbury in 1918 to join the Constabulary proper at the City of Salisbury. Seven years later she moved to the Birmingham City Police and rose to the rank of Inspector. She stayed with the Birmingham force until her retirement in 1937.", "link_mentions": [{"page": "White (surname)", "response": ["*Florence Mildred White (1874–1957), English policewoman"]}, {"page": "Ernest Frank Richardson", "response": ["Frank Richardson was one of the first (if not the first) Chief Constables in England to attest a woman as a Constable. Florence Mildred White was born in December 1873 in Warminster, Wilts. She went to Baden-Baden, Germany, in 1892 to work as a teacher in a college, and then returned in 1902 to teach at The Godolphin School, Salisbury. In 1914 she left teaching abruptly and joined an unofficial women's street patrols in Bath, Somerset, and in Bristol city. On 26 May 1918 she joined the City of Salisbury Police and was attested as a Constable in the City immediately. By 1921 she held the rank of Sergeant. Another female, Miss Elsie Mouland, (attesting of females was still very rare) was attested by Frank Richardson in 1925 when Miss White moved to Birmingham City Police where she served with distinction as a Detective Inspector until 1937.", "*Florence Mildred White"]}, {"page": "Alfred Herbert Richardson", "response": ["The Chief Constables Report for 1943, showed that \"a general increase in offences of one kind or another, compared with 1941, showed there was an increase of 211 indictable offences and 404 more offences than the average of the last nine years.\"Newspaper, Halifax Guardian and Courier. Article, More Cases in Halifax Court Last Year. 20 February 1943. Each year, from 1903 until 1943, the watch committee was rewarded with a certificate of efficiency from The Home OfficeCentral Government Office for the Constabulary of England and Wales for efficiency and discipline for the chief constable of its police force. Never once during his time of office did he fail to attain the certificate. There were no women police officers in Halifax during his time in office; he did not approve of them. This was in contrast to his brother Frank Richardson, chief constable of Salisbury, who attested the first female police officer in England.Florence Mildred White (1873–1957) was attested into the City of Salisbury Police Force in 1918. Book. The Memoirs of Miss Dorothy Olivia Georgina Peto OBE"]}, {"page": "Mildred White", "response": ["#REDIRECT Florence Mildred White"]}, {"page": "National Council of Women of Great Britain", "response": ["*Florence Mildred White"]}, {"page": "Women in policing in the United Kingdom", "response": ["In 1910 five women got together as a group and started to draw the attention of the Police Authorities to the fact that there were no woman Constables, even though many women were temporary prisoners in police custody. Two women in particular sought to point out the lack of a woman Constable presence was wrong. They each had a relative in political high office. One of these women was Edith Tancred (1873–1957).Edith Tancred. Record 1 of 1 Code NA61. She became a campaigner for the requirement of women police. The other was Dorothy Peto. Peto later decided to take the 'administrative path' within the Constabulary for promotion. Both Tancred and Peto were well placed in society to get their views heard. They were soon joined by three other women campaigners, and around 1911 started unofficial street patrols from an office in Bristol \"to maintain public morality and decency\". A Voluntary Women's Force was created in Bath, Somerset in 1912. In 1914 Peto joined the National Union of Women Workers and made patrols herself. Florence Mildred White left her teaching post at the Godolphin School in 1914 to live and work in the newly created Bath office for women police, where Peto had become the Assistant Patrols Organizer). White stayed at the Bath office until May 1918, working under the supervision of Peto, as a Patrol Officer in the city.", "Sir Leonard Dunning, Her Majesty's Inspector of Constabulary wrote an article in Police Review in 1918. About two of the six pages of his annual Report concerned the employment of women in professional police work, including the possibility of them having the powers of arrest.Article, Women Police. He concluded that such employment was a matter for individual police authorities.Police Review and Parade Ground Gossip 5 April 1918. Page 110. Viewed June 2014.The magazine Police Review and Parade Ground Gossip later printed a lengthy editorial on the possibility of employing women police officers. 12 April 1918. Viewed June 2014. Many Chief Constables saw the role of women as 'Clerks and Chauffeurs' and thought women could possibly be employed as Special Constables..Police Review and Parade Ground Gossip, 31 May 1918. Viewed June 2014. The Chief Constable of Wolverhampton wrote an article in Police Review and Parade Ground Gossip in which he listed a range of duties women could undertake within the Force.Article by C.C. Wolverhampton> Police Review and Parade Ground Gossip5 July 1918. Viewed June 2014. On 16 November 1921 the Metropolitan Commissioner of Police, Sir Nevil Macready, who was considered to be setting the standard throughout England, issued an order that with the possibility of women being appointed to the Police Service, these would reflect current requirements for male officers; \"a minimum height would be established, though at 5 feet 4 inches this was considerably lower than that for men.\" Florence Mildred White (see below) was officially documented as being five feet five and one half inch tall.City of Birmingham Police records, Form No. 50. Macready added that women with dependent young children would be barred from service, women officers were not to be sworn in as constables, and they would not have the right to a pension.", "The Home Office set up the Baird Committee in 1920 on the employment conditions and attesting of women in the Service. Two Inspectors of Constabulary gave evidence as did several senior people in the Service, including two attested Sergeants from provincial forces, Florence Mildred White and Ethel Gale from Gloucestershire.", "| Sergeant || Florence Mildred WhiteEthel Gale || Salisbury City PoliceGloucestershire Constabulary || 1920", "| Inspector || Florence Mildred White || Birmingham City Police || 1930"]}]}}