{"wiki_id": "http://www.wikidata.org/entity/Q15922225", "itemLabel": "Millie Knight", "itemDescription": "Paralympian", "wikipedia_url": "https://en.wikipedia.org/wiki/Millie_Knight", "wikipedia_page": {"main": "Millicent Genevieve \"Millie\" Knight (born 15 January 1999) is a Paralympic athlete and student who competes at international level for ParalympicsGB in alpine skiing in the slalom, giant slalom Super-G, Super Combined and Downhill events with a sighted guide, Brett Wild. When Knight was one year old, she contracted an illness, diagnosed at age three, which resulted in the loss of most of her vision by the age of six. She joined the Great Britain paralympic skiing team in 2012, and progressed to compete at international-level events. Knight was the flagbearer at the 2014 Winter Paralympics opening ceremony, her debut Paralympics, in Sochi where, at the age of 15, she was the youngest person ever to compete for ParalympicsGB at the Winter Paralympic games.\nIn 2017, Knight and Wild became Great Britain’s first World Champions in a snow sport. In the same year Knight also became an Honorary Doctor of the University of Kent.", "link_mentions": [{"page": "Sport in the United Kingdom", "response": ["The United Kingdom has played a major role in the development of disability sport. The Paralympic Games originated in the Stoke Mandeville Games, which were held at Stoke Mandeville Hospital in Buckinghamshire in 1948. The Great Britain team does much better in the medal table at the Summer Paralympics than at the Summer Olympics. It has never finished outside the top five and has been second several times, including the last five games in 2000, 2004, 2008, 2012 and 2016. The BBC is an enthusiastic promoter of disability sport. Former International Paralympic Committee president Sir Philip Craven is British. London's successful bid for the 2012 Summer Olympics also meant that it hosted the 2012 Summer Paralympics. Although Great Britain have been a minor nation in the Winter Paralympics, they have enjoyed particular success in women's visually impaired alpine skiing in the 2010s, with Kelly Gallagher becoming the first British Winter Paralympic gold medallist at the 2014 Games when she won the super-G and Jade Etherington, Menna Fitzpatrick and Millie Knight all winning multiple Paralympic medals in the sport."]}, {"page": "Millie", "response": ["* Millie Knight (born 1999), British Paralympic skier"]}, {"page": "Kilmacolm", "response": ["In sports, Rachael Ferrier, who competed in the 2014 Winter Paralympics at Sochi as a sighted guide for visually impaired athlete Millie Knight also resides in Kilmacolm."]}, {"page": "List of Old King's Scholars", "response": ["* Millie Knight (born 1999), Paralympic skier"]}, {"page": "Great Britain at the 2014 Winter Paralympics", "response": ["Britain’s alpine skiing team consisted of seven competitors. In the visually impaired categories Kelly Gallagher, Jade Etherington and Millie Knight represented Britain, racing with their respective guides, Charlotte Evans, Caroline Powell and Rachael Ferrier.", "|rowspan=2|Millie KnightGuide: Rachael Ferrier"]}, {"page": "Alpine skiing at the 2014 Winter Paralympics – Women's slalom", "response": ["| 5 || 10 || align=left| Millie KnightGuide: Rachael Ferrier ||align=left| || 1:09.87 || 6 || 1:08.90 || 6 || 2:18.77 || +17.53"]}, {"page": "Alpine skiing at the 2014 Winter Paralympics – Women's giant slalom", "response": ["| 5 || 10 || align=left| Millie KnightGuide: Rachael Ferrier ||align=left| || 1:39.66 || 5 || 1:27.68 || 5 || 3:07.34 || +18.71"]}, {"page": "Emily Knight", "response": ["#REDIRECT Millie Knight"]}, {"page": "2015 IPC Alpine Skiing World Championships", "response": ["|Millie KnightGuide: Jen Kehoe|| 2:24.39", "|Millie KnightGuide: Jen Kehoe|| 2:13.81"]}, {"page": "Great Britain at the 2018 Winter Paralympics", "response": ["|rowspan=5|Millie KnightGuide: Brett Wild"]}, {"page": "2017–18 in skiing", "response": ["*** Downhill:   Henrieta Farkašová;   Millie Knight;   Eléonor Sana", "*** Super G:   Henrieta Farkašová;   Millie Knight;   Menna Fitzpatrick", "*** Slalom:   Menna Fitzpatrick;   Henrieta Farkašová;   Millie Knight"]}, {"page": "Alpine skiing at the 2018 Winter Paralympics – Women's downhill", "response": ["|  || 4 || align=\"left\" | Millie KnightGuide: Brett Wild || align=\"left\" | || 1:30.58 || +0.86"]}, {"page": "Alpine skiing at the 2018 Winter Paralympics – Women's Super-G", "response": ["|  || 1 || align=\"left\" | Millie KnightGuide: Brett Wild || align=\"left\" | || 1:33.76 || +3.59"]}, {"page": "Alpine skiing at the 2018 Winter Paralympics – Women's super combined", "response": ["||| 4 || align=\"left\" | Millie KnightGuide: Brett Wild || align=\"left\" | ||1:33.63||3||58.1||5||2:31.73||"]}]}}