{"wiki_id": "http://www.wikidata.org/entity/Q15995675", "itemLabel": "Henry Chancellor", "itemDescription": "British politician (1863-1945)", "wikipedia_url": "https://en.wikipedia.org/wiki/Henry_Chancellor", "wikipedia_page": {"main": "Henry George Chancellor (3 June 1863 – 14 March 1945), was a radical British Liberal Party politician.", "link_mentions": [{"page": "National Liberal Club", "response": ["*Henry Chancellor, Liberal MP 1910–18."]}, {"page": "Lamb to the Slaughter", "response": ["\"Lamb to the Slaughter\" demonstrates Dahl's fascination with horror (with elements of black comedy), which is seen in both his adult fiction and his stories for children.Roald Dahl: The Storyteller, by Jason Hook, page 21 The story was suggested to Dahl by his friend Ian Fleming: \"Why don't you have someone murder their husband with a frozen leg of mutton which she then serves to the detectives who come to investigate the murder?\"Jennet Conant, The Irregulars: Roald Dahl and the British Spy Ring in Wartime Washington, 2008. p. 333Henry Chancellor,James Bond, the man and his world,2005. p. 47"]}, {"page": "List of MPs elected in the January 1910 United Kingdom general election", "response": ["| Henry Chancellor"]}, {"page": "Attempts to escape Oflag IV-C", "response": ["Pat Reid claimed in Colditz: The Full Story that there were 31 \"home runs\", whereas German authorities cite 30, and some other sources count 36. Reid included prisoners from the hospital and prisoners being transported, who were not directly under Colditz staff control. Henry Chancellor in Colditz: The Definitive History claims 32 escaped, but only 15 were \"home runs\": 1 Belgian, 11 British, 7 Dutch, 12 French, and 1 Polish. The difference is that Reid claims any successful escape by an \"official\" Colditz POW a \"home run\" whereas most other historians only consider escapes from the castle or castle grounds itself as a \"home run\". Also a subject of debate is whether or not Lieutenant William A. Millar's escape should be considered a \"home run\", but since he is listed as \"Missing in action\" (unofficially, he is assumed dead), Chancellor does not count him as such.", "* Henry Chancellor, Colditz: The Definitive History: The Untold Story of World War II's Great Escapes London: Hodder & Stoughton, 2001. "]}, {"page": "Haggerston (UK Parliament constituency)", "response": ["| Henry Chancellor"]}, {"page": "Henry George Chancellor", "response": ["#REDIRECT Henry Chancellor"]}]}}