{"wiki_id": "http://www.wikidata.org/entity/Q15999975", "itemLabel": "William Shirley", "itemDescription": "English cricketer (1900-1970)", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Shirley_(cricketer)", "wikipedia_page": {"main": "William Robert de la Cour Shirley (13 October 1900 – 23 April 1970) was an English cricketer. A right-handed batsman and right-arm fast-medium bowler, he played first-class cricket between 1922 and 1925, primarily for Hampshire. He also played first-class cricket for Cambridge University and the Free Foresters in addition to representing the Nigeria national cricket team.", "link_mentions": [{"page": "William Shirley", "response": ["William Shirley (2 December 1694 – 24 March 1771) was a British colonial administrator who was the longest-serving governor of the Province of Massachusetts Bay (1741–1749 and 1753–1756) and then Governor of the Bahamas (1760–1768). He is best known for his role in organizing the 1745 Siege of Louisbourg during King George's War, and for his role in military affairs during the French and Indian War. He spent most of his years in the colonial administration of North America working to defeat New France, but his lack of formal military training led to political difficulties and his eventual downfall.", "William Shirley, the son of William and Elizabeth Godman Shirley, was born on 2 December 1694 at Preston Manor in East Sussex, England.Schutz (1961), p. 3 He was educated at Pembroke College, Cambridge, and then read law at the Inner Temple in London.Wood, p. 13  In 1717 his grandfather died, leaving him Ote Hall in Wivelsfield and some funds, which he used to purchase a clerkship in London.  About the same time he married Frances Barker, with whom he had a large number of children.Schutz (1961), p. 4  He was called to the bar in 1720.Wood, p. 14  Although his inheritance had been substantial (about £10,000), he cultivated an expensive lifestyle, and suffered significant financial reverses in the depression of 1721.  The financial demands of his large family (he and Frances had eight children by 1731) prompted him to seek an appointment in the North American colonies.  His family was connected by marriage to the Duke of Newcastle, who became an important patron and sponsor of Shirley's advancement, and to that of Arthur Onslow, the Speaker of the House of Commons.Wood, pp. 12–13  Armed with letters of introduction from Newcastle and others (but no appointment), Shirley arrived in Boston, Massachusetts in 1731.Schutz (1961), p. 5", "In 1739 the Privy Council reprimanded Belcher, voted to separate the Massachusetts and New Hampshire governorships, and began debating the idea of replacing the governor.Batinski, p. 133  The exact reasons for Belcher's dismissal have been a recurring subject of scholarly interest, due to the many colonial, imperial, and political factors at play.Foster, p. 180, documents at least seven scholarly approaches to the subject, including Batinski and Zemsky referenced here  Two principal themes within these analyses are Belcher's acquisition of many local enemies, and the idea that good imperial governance in London eventually required his replacement.Foster, p. 181  Before the issues of 1739 most of the efforts to unseat Belcher had failed: Belcher himself noted in that year that \"the warr I am ingag'd in is carrying on in much the same manner as for 9 years past.\"Foster, p. 188  Historian Stephen Foster further notes that someone as powerful as Newcastle was at the time generally had much weightier issues to deal with than arbitrating colonial politics.  In this instance, however, imperial and colonial considerations coincided over the need for Massachusetts to provide a significant number of troops for Newcastle's proposed West Indies expedition in the War of Jenkins' Ear.Foster, pp. 189–190  In April 1740 Newcastle in effect offered Shirley the opportunity to prove, in the light of Belcher's political difficulties, that he could more effectively raise troops than the governor could.Foster, p. 190  Shirley consequently engaged in recruiting, principally outside Massachusetts (where Belcher refused his offers of assistance, understanding what was going on), and deluged Newcastle with documentation of his successes while Belcher was preoccupied with a banking crisis.Wood, pp. 84–89Foster, pp. 194–197  Newcastle handed the issue off to Martin Bladen, secretary to the Board of Trade and a known Belcher opponent.  The Board of Trade then apparently decided, based on the weight of the extant evidence, that Belcher needed to be replaced.Foster, pp. 197–198  In April 1741 the Privy Council approved William Shirley's commission as governor of Massachusetts, and Benning Wentworth's commission as governor of New Hampshire was issued the following June.Wood, p. 89Shipton, p. 153", "*Correspondence of William Shirley, Vol. 1"]}, {"page": "Nigeria national cricket team", "response": ["* William Shirley – played for Hampshire and Cambridge University between 1922 and 1925.William Shirley at CricketArchive"]}, {"page": "John Fox (cricketer, born 1904)", "response": ["Fox's personal contribution to the match was minimal, although he did take his maiden first-class wicket, that of William Shirley."]}]}}