{"wiki_id": "http://www.wikidata.org/entity/Q15994443", "itemLabel": "Douglas John Foskett", "itemDescription": "director of the central library at the University of London", "wikipedia_url": "https://en.wikipedia.org/wiki/Douglas_John_Foskett", "wikipedia_page": {"main": "Douglas John Foskett OBE (27 June 1918 – 7 May 2004) was a British librarian and library and information scientist, and author of several special faceted classification systems.Foskett was born in London on 27 June 1918. He received his BA from Queen Mary College in 1939 and in 1954 his MA at Birkbeck, University of London. He started his career in the late 1930s as a librarian in the Ilford Public Libraries in Essex. During World War II he served in the Royal Army Medical Corps and later in the Intelligence Corps. From 1948 to 1957 he was Head of Information in the Research Division of the Metal Box Company Limited. In 1957 to 1978 he was at the Library of the Institute of Education in London, where he devised and implemented the specialist  London Education Classification scheme to organize the library's collections. The last five years before retirement he was Director at the Central Library Services of the University of London.In the early 1950s Foskett was among the founding members of the Classification Research Group. He was active member of British Library Association. For 5 years he was a member of Unesco's International Advisory Committee on Libraries, Documentation and Archives. Also visiting Professor in MIT, in Ghana, Ibadan, Brazil and Iceland.His brother, Tony (1926–2014), was also a librarian and teacher of information science.", "link_mentions": [{"page": "Chartered Institute of Library and Information Professionals", "response": ["The first President of the Library Association had been John Winter Jones and other notable Presidents had included Richard Garnett (1893), Frederic G. Kenyon (1910), W. C. Berwick Sayers (1938), Lionel McColvin (1952) and Douglas John Foskett (1976).Munford, W. A. A History of the Library Association, 1877-1977, pp. 333-336. London: Library Association, 1977. The jubilee (50th year) of the Association was celebrated in 1927. Library associations from fourteen European countries and the United States signed a resolution at the celebration of the 50th anniversary of the Library Association of the United Kingdom held in Edinburgh which brought the International Federation of Library Associations into existence. "]}, {"page": "2004 in the United Kingdom", "response": ["* 7 May – Douglas John Foskett, librarian (born 1918)"]}, {"page": "1918 in the United Kingdom", "response": ["* 27 June – Douglas John Foskett, librarian (died 2004)"]}, {"page": "Library and information scientist", "response": ["* Douglas John Foskett"]}, {"page": "Foskett", "response": ["*Douglas John Foskett, British library and information scientist"]}, {"page": "Deaths in May 2004", "response": ["*Douglas John Foskett, 85, British librarian."]}, {"page": "Douglas Foskett", "response": ["#REDIRECT Douglas John Foskett"]}, {"page": "1978 Birthday Honours", "response": ["*Douglas John Foskett, Librarian, Institute of Education, University of London."]}, {"page": "Ingetraut Dahlberg", "response": ["In 1970, she was also delegated to cooperate in a Committee for Classification and Indexing in the context of the UNISIST-ProgramUNISIST = UNESCO United Nations International Scientific Information System of UNESCO, headed by Douglas John Foskett."]}]}}