{"wiki_id": "http://www.wikidata.org/entity/Q15994711", "itemLabel": "Margaret Rock", "itemDescription": "British cryptoanalyst (1903-1983)", "wikipedia_url": "https://en.wikipedia.org/wiki/Margaret_Rock", "wikipedia_page": {"main": "Margaret Rock (7 July 1903 –  26 August 1983) was one of the 8000 women mathematicians who worked in Bletchley Park during World War II. With her maths skills and education, Rock was able to decode the Enigma Machine against the German Army. Her work during the war was classified by the Official Secrets Act 1939, so much of her work was not revealed during her lifetime.", "link_mentions": [{"page": "Bletchley Park", "response": ["The female staff in Dilwyn Knox's section were sometimes termed \"Dilly's Fillies\". Knox's methods enabled Mavis Lever (who married mathematician and fellow code-breaker Keith Batey) and Margaret Rock to solve a German code, the Abwehr cipher.", "Knox was given a new section for work on Enigma variations, which he staffed with women (\"Dilly's girls\"), who included Margaret Rock, Jean Perrin, Clare Harding, Rachel Ronald, Elisabeth Granger; and Mavis Lever."]}, {"page": "Women in computing", "response": ["Women worked with cryptography and, after some initial resistance, many operated and worked on the Bombe machines. Joyce Aylard operated the Bombe machine testing different methods to break the Enigma code. Joan Clarke was a cryptographer who worked with her friend, Alan Turing, on the Enigma machine at Bletchley Park. When she was promoted to a higher salary grade, there were no positions in the civil service for a \"senior female cryptanalyst,\" and she was listed as a linguist instead. While Clarke developed a method of increasing the speed of double-encrypted messages, unlike many of the men, her decryption technique was not named after her. Other cryptographers at Bletchley included Margaret Rock, Mavis Lever (later Batey), Ruth Briggs and Kerry Howard. In 1941, Batey's work enabled the Allies to break the Italians' naval code before the Battle of Cape Matapan. In the United States, several faster Bombe machines were created. Women, like Louise Pearsall, were recruited from the WAVES to work on code breaking and operate the American Bombe machines."]}, {"page": "Portsmouth High School, Southsea", "response": ["* Margaret Rock (1903–1983), Bletchley Park codebreaker"]}, {"page": "List of people associated with Bletchley Park", "response": ["* Margaret Rock, mathematician"]}, {"page": "Signals intelligence in modern history", "response": ["Breakthroughs were also made with Italian signals. During the Spanish Civil War the Italian Navy used the K model of the commercial Enigma without a plugboard; this was solved by Knox in 1937. When Italy entered the war in 1940 an improved version of the machine was used, though little traffic was sent by it and there were \"wholesale changes\" in Italian codes and cyphers. Knox was given a new section for work on Enigma variations, which he staffed with women (\"Dilly's girls\") who included Margaret Rock, Jean Perrin, Clare Harding, Rachel Ronald, Elisabeth Granger; and Mavis Leverwho made the first break into the Italian naval traffic. She solved the signals revealing the Italian Navy's operational plans before the Battle of Cape Matapan in 1941, leading to a British victory. in "]}, {"page": "List of women in Bletchley Park", "response": ["* Margaret Rock"]}, {"page": "Women in Bletchley Park", "response": ["Though the initial focus of recruitment, particularly during the latter years of the inter-war period, focused primarily on male academics, there soon emerged an eclectic staff of \"Boffins and Debs\", which caused GC&CS to be whimsically dubbed the \"Golf, Cheese and Chess Society\".  At the outbreak of the war Dilly Knox was the GC&CS's chief cryptanalyst  and, as such, took a leading role in the work on the various Enigma networks. His team, which he staffed with women (\"Dilly's girls\"), included Margaret Rock and Mavis Lever, sometimes termed \"Dilly's Fillies\". During a September 1941 morale-boosting visit, Winston Churchill reportedly remarked to head of GC&CS Alastair Denniston: \"I told you to leave no stone unturned to get staff, but I had no idea you had taken me so literally.\""]}]}}