{"wiki_id": "http://www.wikidata.org/entity/Q15916244", "itemLabel": "George Barlow", "itemDescription": "British association football player (1885–1921)", "wikipedia_url": "https://en.wikipedia.org/wiki/George_Barlow_(footballer,_born_1885)", "wikipedia_page": {"main": "George Barlow (19 September 1885 – 3 March 1921) was an English footballer. He was part of Great Britain's squad for the football tournament at the 1908 Summer Olympics, but he did not play in any matches.", "link_mentions": [{"page": "Football at the 1908 Summer Olympics", "response": ["|valign=\"top\"| Horace BaileyArthur BerryFrederick ChapmanWalter CorbettHarold HardmanRobert HawkesKenneth HuntHerbert SmithHarold StapleyClyde PurnellVivian Woodward  George BarlowThose players were also in squad, but did not play any matches. Albert Bell Ronald BrebnerW. CrabtreeWalter DaffernThomas PorterAlbert Scothern"]}, {"page": "George Barlow", "response": ["George Barlow may refer to:", "* George Barlow (MP), Member of Parliament (MP) for Haverfordwest", "* George Barlow (poet) (1847 –  1913), English poet, who sometimes wrote under the pseudonym James Hinton", "* Sir George Barlow, 1st Baronet (1763–1846), acting Governor-General of British India 1805–07", "* Sir George Barlow, 2nd Baronet (c. 1680–1726), British landowner and politician", "* George Barlow (footballer, born 1885), British footballer", "* George Barlow (footballer, born 1914), British footballer player", "* George Barlow (American poet) (born 1948), American poet", "* George Barlow (American football) (born 1967), American football coach", "* George Barlow (soccer) (born 1933), Australian footballer"]}, {"page": "List of 1908 Summer Olympics medal winners", "response": ["|valign=top| Horace BaileyArthur BerryFrederick ChapmanWalter CorbettHarold HardmanRobert HawkesKenneth HuntHerbert SmithHarold StapleyClyde PurnellVivian Woodward  George BarlowThose players were also in squad, but did not play any matches.Albert BellRonald BrebnerW. CrabtreeWalter DaffernThomas PorterAlbert Scothern"]}, {"page": "1913 FA Charity Shield", "response": ["The 1913 FA Charity Shield was the sixth staging of the FA Charity Shield, an annual association football match arranged to raise funds for charitable causes supported by the Football Association (the FA), the governing body of football in England. The match was contested by select teams of amateur and professional players. It was played on 6 October 1913 at The Den, London, and ended as a 7–2 win for the Professionals. England internationals Harry Hampton scored four goals, George Holley two and Harold Fleming one for the Professionals; George Barlow and Herbert Farnfield scored for the Amateurs. The proceeds were donated to the Senghenydd Colliery Disaster Fund.", "Hampton completed his hat-trick after five minutes of the second half, but then the Amateurs took control. Sam Hardy kept out shots from Dick Healey, Ivan Sharpe and Herbert Farnfield before being beaten twice in five minutes. After a \"great shot\" from Preston North End winger George Barlow, the Amateurs' second was touched in by Farnfield after a move involving four players brought the ball all the way down the field. It was, according to the pseudonymous 'Reflector', writing in the Mirror, \"easily the best of the match.\" Confusion between goalkeeper Ronald Brebner and full-back Thomas Burn presented Hampton with his fourth, and Holley completed the scoring late on.", "|Forward|| George Barlow||Preston North End"]}, {"page": "George Barlow (1900s footballer)", "response": ["#REDIRECTGeorge Barlow (footballer, born 1885)"]}]}}