{"wiki_id": "http://www.wikidata.org/entity/Q15907325", "itemLabel": "Leonard Robert Palmer", "itemDescription": "English linguist", "wikipedia_url": "https://en.wikipedia.org/wiki/Leonard_Robert_Palmer", "wikipedia_page": {"main": "Leonard Robert Palmer (5 June 1906, Bristol – 26 August 1984, Pitney, Somerset) was author and Professor of Comparative Philology at the University of Oxford  from 1952 to 1971. He was also a Fellow of Worcester College, Oxford. Palmer made some significant contributions to the study of Classical languages, and in the area of historical linguistics.", "link_mentions": [{"page": "Linear B", "response": ["The examination uncovered a number of difficulties. The Knossos tablets had been found at various locations in the palace. Evans had not kept exact records. Recourse was had to the day books of Evans' assistant, Duncan Mackenzie, who had conducted the day-to-day excavations. There were discrepancies between the notes in the day books and Evans' excavation reports. Moreover, the two men had disagreed over the location and strata of the tablets. The results of the reinvestigation were eventually published by Palmer and Boardman, On the Knossos Tablets. It contains two works, Leonard Robert Palmer's The Find-Places of the Knossos Tablets and John Boardman's The Date of the Knossos Tablets, representing Blegen's and Evans' views respectively. Consequently, the dispute was known for a time as \"the Palmer–Boardman dispute\". There has been no generally accepted resolution to it yet."]}, {"page": "Mycenae", "response": ["The land possessed by the king is usually called , te-me-no (, \"témenos\"), a word that survived in classical Greece (the temenos placed by Hephaestus on the shield of Achilles is called \"royal\"). In classical times the word has a religious connotation . Other important landowners were the , ra-wa-ke-ta (\"lāwāgetas\"), literally translated as “the leader of the people”, and sometimes interpreted as a given Kingdom's military leader, though this is not confirmed by the inscriptions. Alternatively, he may have been the crown prince or, if one follows the argument of a single Mycenaean state, a local king who was a vassal to the overarching wanax / Great King. Below these two elevated persons, Linear B texts situate the , te-re-ta (\"telestai\"), the officials. Leonard Robert Palmer suggests that the \"telestai were the men of telos- the fief holders\". The , e-qe-ta (ekwetai, \"companions\" or \"followers\") were a group of nobles (aristocrats), who followed the king in peace and war. It seems that they were representatives of the king among military groups and religious personnel. There is also at least one instance of a person, Enkhelyawon at Pylos, who appears titleless in the written record but whom modern scholars regard as being probably a king., pp. 71–72."]}, {"page": "Mycenaean Greek", "response": ["Such theories are also connected with the idea that the Mycenaean language constituted a type of a special koine representing the official language of the palace records and the ruling aristocracy. When the 'Mycenaean linguistic koine' fell into disuse after the fall of the palaces because the script was no longer used, the underlying dialects would have continued to develop in their own ways. That view was formulated by Antonin Bartonek.Bartoněk, Antonín, Greek dialectology after the decipherment of Linear B. Studia Mycenaea : proceedings of the Mycenaean symposium, Brno, 1966. Bartoněk, Antonín (editor). Vyd. 1. Brno: Universita J.E. Purkyně, 1968, pp. [37]-51BARTONEK, A. 1966 'Mycenaean Koine reconsidered', Cambridge Colloquium on Mycenaean Studies' (CCMS) ed. by L. R. Palmer and John Chadwick, C.U.P. pp.95-103 Other linguists like Leonard Robert Palmer (1980),Palmer, L.R. (1980), The Greek Language, London. and :de:Yves Duhoux (1985)Duhoux, Y. (1985), ‘Mycénien et écriture grecque’, in A. Morpurgo Davies and Y. Duhoux (eds.), Linear B: A 1984 Survey (Louvain-La-Neuve): 7–74 also support this view of the 'Mycenaean linguistic koine'.Stephen Colvin, ‘The Greek koine and the logic of a standard language’, in M. Silk and A. Georgakopoulou (eds.) Standard Languages and Language Standards: Greek, Past and Present (Ashgate 2009), 33-45 (The term 'Mycenaean koine' is also used by archaeologists to refer to the material culture of the region.) However, since the Linear B script does not indicate several possible dialectical features, such as the presence or absence of word-initial aspiration and the length of vowels, it is unsafe to extrapolate that Linear B texts were read as consistently as they were written."]}, {"page": "History of Latin", "response": ["The name Latin derives from the Italic tribal group named Latini that settled around the 10th century BC in Latium, and the dialect spoken by these people.Leonard Robert Palmer - The Latin language - 372 pages   University of Oklahoma Press, 1987 Retrieved 2012-02-01 "]}, {"page": "Palmer (surname)", "response": ["*Leonard Robert Palmer (1906–1984) British philologist and linguist"]}, {"page": "Leonard R. Palmer", "response": ["#REDIRECT Leonard Robert Palmer"]}, {"page": "Leonard Palmer", "response": ["#REDIRECT Leonard Robert Palmer"]}, {"page": "L.R. Palmer", "response": ["#REDIRECT Leonard Robert Palmer"]}, {"page": "Department of Classics, King's College London", "response": ["*Leonard Robert Palmer, Professor of Classical Literature (1945-1946), Professor of Greek Language & Literature (1946-1952)"]}]}}