{"wiki_id": "http://www.wikidata.org/entity/Q15967634", "itemLabel": "James Hennessy", "itemDescription": "British diplomat", "wikipedia_url": "https://en.wikipedia.org/wiki/James_Hennessy_(diplomat)", "wikipedia_page": {"main": "Sir James Patrick Ivan Hennessy   (born 26 September 1923) is a British retired diplomat and served as Her Majesty's Chief Inspector of Prisons from 1982 to 1987.", "link_mentions": [{"page": "September 26", "response": ["*  1923   – James Hennessy, English businessman and diplomat"]}, {"page": "1923", "response": ["** James Hennessy, English businessman and diplomat "]}, {"page": "Her Majesty's Chief Inspector of Prisons", "response": ["* 1982–1987: Sir James Hennessy, "]}, {"page": "List of ambassadors of the United Kingdom to Uruguay", "response": ["*1971–1972: James Hennessy (Consul) chargé d'affaires"]}, {"page": "Maze Prison escape", "response": ["The escape was a propaganda coup and morale boost for the IRA, with Irish republicans dubbing it the \"Great Escape\". Leading unionist politician Ian Paisley called on Nicholas Scott, the Parliamentary Under-Secretary of State for Northern Ireland, to resign. The British Prime Minister Margaret Thatcher made a statement in Ottawa during a visit to Canada, saying \"It is the gravest [breakout] in our present history, and there must be a very deep inquiry\". The day after the escape, Secretary of State for Northern Ireland James Prior announced an inquiry would be headed by Her Majesty's Chief Inspector of Prisons, James Hennessy. The Hennessy Report was published on 26 January 1984 placing most of the blame for the escape on prison staff, and made a series of recommendations to improve security at the prison. The report also placed blame with the designers of the prison, the Northern Ireland Office and successive prison governors who had failed to improve security. Prior announced that the prison's governor had resigned, and that there would be no ministerial resignations as a result of the report's findings. Four days after the Hennessy Report was published, the Minister for Prisons Nicholas Scott dismissed allegations from the Prison Governors Association and the Prison Officers Association that the escape was due to political interference in the running of the prison."]}, {"page": "List of colonial governors and administrators of British Honduras", "response": ["* Sir Sir James Hennessy, 1980 – 21 September 1981"]}, {"page": "James Patrick Ivan Hennessy", "response": ["#REDIRECTJames Hennessy (diplomat)"]}, {"page": "List of High Commissioners of the United Kingdom to Uganda", "response": ["*1973–1976: James Hennessy"]}, {"page": "List of people educated at Bedford School", "response": ["*Sir James Hennessy KBE CMG (born 1923), Ambassador to Uruguay, 1971–1972, High Commissioner to Uganda, 1973–1976, Ambassador to Rwanda, 1973–1976, Governor of Belize, 1980–1981, and Her Majesty's Chief Inspector of Prisons, 1982–1987"]}, {"page": "Sir James Patrick Ivan Hennessy", "response": ["#REDIRECT James Hennessy (diplomat)"]}, {"page": "Murder of Dora Bloch", "response": ["On 4 July, the British Government were informed that Bloch was not among the hostages released during Operation Entebbe. As a result, she was visited by James Hennessy, then-High Commissioner of the United Kingdom to Uganda, and Peter Chandley, second secretary of the British High Commission in Kampala. Bloch told Chandley that she had been treated well in the hospital, but did not like the food. They were also told that Bloch was going to be moved to the Grand Imperial Hotel in Kampala. Chandley and his wife went to get some food for Bloch, but when they returned, they were denied entry to the hospital. The reason for this was that four men including Farouk Minawa, head of the State Research Bureau (Ugandan secret police) and Idi Amin's Chief of Protocol Nasur Ondoga had taken Bloch from her hospital bed and murdered her. The policeman guarding Bloch was also killed."]}, {"page": "List of governors of dependent territories in the 20th century", "response": ["::*James Hennessy, Governor (1980–1981)"]}, {"page": "Governor Hennessy", "response": ["*James Hennessy (diplomat) (born 1923), Governor of British Honduras from 1980 to 1981"]}, {"page": "James Hennessy", "response": ["James Hennessy may refer to:", "* James Hennessy (diplomat) (born 1923), British diplomat and civil servant", "* James Hennessy (equestrian) (1867–1945), French equestrian", "* James Hennessy, 2nd Baron Windlesham (1903–1962), British peer and decorated British Army officer"]}]}}