{"wiki_id": "http://www.wikidata.org/entity/Q1594388", "itemLabel": "Jack Hayward", "itemDescription": "businessman, owner of Wolverhampton Wanderers, philanthropist", "wikipedia_url": "https://en.wikipedia.org/wiki/Jack_Hayward", "wikipedia_page": {"main": "Sir Jack Arnold Hayward  (14 June 1923 – 13 January 2015) was an English businessman, property developer, philanthropist and president of English football club Wolverhampton Wanderers.\n\n", "link_mentions": [{"page": "Lundy", "response": ["About  long and  wide, Lundy has had a long and turbulent history, frequently changing hands between the British crown and various usurpers. In the 1920s, one self-proclaimed king, Martin Harman, tried to issue his own coinage and was fined by the House of Lords. In 1941, two German Heinkel He 111 bombers crash landed on the island, and their crews were captured. In 1969, Lundy was purchased by British millionaire Jack Hayward, who donated it to the National Trust. It is managed by the Landmark Trust, a conservation charity that derives its income from day trips and holiday lettings. As of 2007, the island had a population of 28.", "Following the death of Harman's son Albion in 1968,\"Island owner dies after air lift\" (source unknown). 24 June 1968 Lundy was put up for sale in 1969. Jack Hayward, a British millionaire, purchased the island for £150,000 (£ today) and gave it to the National Trust, who leased it to the Landmark Trust. The Landmark Trust has managed the island since then, deriving its income from arranging day trips, letting out holiday cottages and from donations. In May 2015 a sculpture by Antony Gormley was erected on Lundy. It is one of five life-sized sculptures, Land, placed near the centre and at four compass points of the UK in a commission by the Landmark Trust, to celebrate its 50th anniversary. The others are at Lowsonford (Warwickshire), Saddell Bay (Scotland), the Martello Tower (Aldeburgh, Suffolk), and Clavell Tower (Kimmeridge Bay, Dorset)."]}, {"page": "1923", "response": ["** Jack Hayward, English businessman (d. 2014)"]}, {"page": "SS Great Britain", "response": ["The salvage operation, made possible by several large donations, including from Sir Jack Hayward and Sir Paul Getty, was organised by 'the SS Great Britain Project', chaired by Richard Goold-Adams. Ewan Corlett conducted a naval architect's survey, reporting that she could be refloated. A submersible pontoon, Mulus III, was chartered in February 1970. A German tug, Varius II, was chartered, reaching Port Stanley on 25 March. By 13 April, after some concern about a crack in the hull, the ship was mounted successfully on the pontoon and the following day the tug, pontoon and Great Britain sailed to Port Stanley for preparations for the transatlantic voyage. The voyage (code name \"Voyage 47\") began on 24 April, stopped in Montevideo from 2 May to 6 May for inspection, then across the Atlantic, arriving at Barry Docks, west of Cardiff on 22 June. (\"Voyage 47\" was chosen as the code name because it was on her 47th voyage from Penarth, in 1886, that during a tempest she had sought shelter in the Falklands.) Bristol-based tugs then took over and towed her, still on her pontoon, to Avonmouth Docks.", "*The ITV1 series The West Country Tonight, in July 2010, told five aspects of the Great Britain's story: her history, her restoration and Bristolians' memories of her return to the city, showing their home footage of the event. Correspondent Robert Murphy travelled to Grand Bahama for an exclusive interview with Sir Jack Hayward, then moved to the Falkland Islands where he spoke with islanders who worked in the salvage team."]}, {"page": "Billy Wright (footballer, born 1924)", "response": ["After leaving management, he became a television pundit and Head of Sport for ATV and Central Television, before retiring in 1989. The following year, he joined the board of directors at Wolverhampton Wanderers as part of the takeover by Sir Jack Hayward."]}, {"page": "Wolverhampton Wanderers F.C.", "response": ["Lifelong fan Jack Hayward purchased the club in 1990 and immediately funded the extensive redevelopment of a by then dilapidated Molineux into a modern all-seater stadium. With work completed in 1993, Hayward redirected his investment onto the playing side in an attempt to win promotion to the newly formed Premier League. Despite substantial spending, neither Graham Taylor nor Mark McGhee could fulfil this, both managers leading the team to play-off defeats at the semi-final stages in 1995 and 1997 respectively. It was not until 2003 that Wolves were promoted, when they defeated Sheffield United 3–0 in the play-off final under Dave Jones to end a 19-year absence from the top level. Their stay proved short-lived however as they were immediately relegated back to the newly retitled EFL Championship.", "After former England manager Glenn Hoddle failed to bring a swift return to the Premier League, the rebuilding of the squad by Mick McCarthy rejuvenated the club with an unexpected play-off finish. The club was bought from Sir Jack Hayward by Steve Morgan in 2007 and two years later the team returned to the Premier League as 2008–09 Football League Championship title winners. Wolves successfully battled relegation for two seasons before McCarthy's dismissal in the 2011–12 season, which precipitated relegation under his former assistant Terry Connor, who was promoted to replace McCarthy.", "Following the takeover of the club by Sir Jack Hayward in 1990, £8.5 million of funding was made available to redevelop Molineux comprehensively. Between August 1991 and December 1993 three sides of the stadium were completely rebuilt to form a 28,525 capacity all-seater stadium that complied with the Taylor Report: the Waterloo Road Stand was replaced by the Billy Wright Stand, the North Bank terrace by the Stan Cullis Stand, and the South Bank terrace by the Sir Jack Hayward Stand (named the Jack Harris Stand until 2015). Aside from the addition of a temporary seating area in the southwest corner used during Wolves' seasons in the Premier League; this redevelopment formed the stadium for almost twenty years.", "Ground redevelopments were once again placed on the agenda following the club's acquisition by Fosun in 2016. In contrast to previously mooted plans, it was publicly revealed in February 2019 that future plans consisting of the demolition and full rebuild of the Steve Bull Stand, followed by the redevelopment of the Sir Jack Hayward Stand, to raise the stadium capacity to 45-46,000, were under active consideration. However, in 2020 the club announced more modest plans for making gradual improvements to the stadium as the club seeks to retain its unique character, and enable prioritisation of investment in the playing side of the club.", "Fosun bought Wolves from Steve Morgan, who had taken ownership in August 2007 for a nominal sum of £10 with the proviso that £30 million was injected into the club, ending an almost four-year search for a new buyer. Morgan oversaw nine full seasons, but placed the club on the market for new owners in September 2015. Morgan had bought the club from Sir Jack Hayward, a lifelong fan of the club, who had himself purchased it in 1990 for £2.1 million. During his tenure Sir Jack invested an estimated £50 million of his personal wealth to rebuild the club's stadium and fund new players, but the team only achieved one season in the top flight during his 17 years at the helm despite this increased spending power."]}, {"page": "Molineux Stadium", "response": ["The Steve Bull Stand (formerly the John Ireland Stand). The Sir Jack Hayward Stand (formerly the Jack Harris Stand and also known as 'The South Bank'), is a single tier, safe standing terrace. The Stan Cullis Stand (also known as The North Bank) is the most recently renovated stand. The Billy Wright Stand holds the team dressing rooms, media booths and the family section.", "The takeover of the club and stadium by Sir Jack Hayward in 1990 paved the way for redevelopment, which was further prompted by legislation following the Taylor Report that outlawed terraces which affected Premier League and Division One stadiums from the 1993–94 season. The North Bank terrace was demolished in October 1991 and the new Stan Cullis Stand was completed in August 1992, in time for the 1992–93 season. Next came the demolition of the Waterloo Road Stand, with the new Billy Wright Stand opening in August 1993. The final phase of the redevelopment came in December 1993, when the new Jack Harris Stand was opened on the site of the South Bank terrace.", "In 2003, the John Ireland Stand was renamed the Steve Bull Stand (in honour of the club's record goalscorer) and, at the same time, the south-west corner of the ground was filled with 900 temporary seats, known as the Graham Hughes Stand, which, until their removal in the summer of 2006, raised the Molineux capacity to 29,400. This seating area – now officially named the Wolves Community Trust Stand – was again added on the club's return to the top flight in 2009, which lifted the capacity to 29,195 before the club began its redevelopment of the stadium in summer 2011. In August 2015, the Jack Harris Stand was renamed the Sir Jack Hayward Stand in honour of Steve Morgan's predecessor as the club's owner, who had died earlier that year. ", "Phase 3 is subject to demand and finance, but is planned to be the construction of a new top-tier on the Sir Jack Hayward Stand, that will connect it to the new Steve Bull Stand. This would bring capacity up to around 38,000."]}, {"page": "Lord's", "response": ["A new indoor cricket school was completed in 1973 at the Nursery End, funded by £75,000 from Sir Jack Hayward and additional funds raised by the Lord's Taverners and  The Sports Council. The West Indies appeared in their third successive World Cup final in 1983, but were defeated by 43 runs by India. The Mound Stand was demolished in 1985 to make way for a new stand designed by Michael Hopkins and Partners, which opened in time for the MCC's bicentenary in 1987.Green 2010, p. 448 That bicentenary was celebrated with a five-day match between MCC and a Rest of the World team in August 1987, which ended in a draw after the final day was rained off. Graham Gooch made the first Test match triple-century at Lord's, scoring 333 against India in 1990. The final decade of the 20th–century saw rapid redevelopment of Lord's. The Compton and Edrich stands were completed in 1991, having run over time and budget. The indoor school closed in 1994, owing to the constuction of a new state-of-the-art indoor cricket centre which opened in 1995. The old grandstand was demolished in 1996, with a replacement designed by Nicholas Grimshaw & Partners being completed in 1998. Since 1997, Lord's has been home to the European Cricket Council (ECC), which administers cricket outside of the European full-member nations. With Lord's hosting three matches in the 1999 World Cup, including the final, the MCC set about improving press facilities by constructing the Media Centre at the Nursery End between the Compton and Edrich stands, offering commanding views towards the pavilion from over the bowlers arm. The Media Centre was opened in April 1999 by then MCC President Tony Lewis."]}, {"page": "Freeport, Bahamas", "response": ["* Jack Hayward - British businessman"]}, {"page": "Dave Jones (footballer, born 1956)", "response": ["They overcame Reading in the semi-finals and 3–0 victory over Sheffield United in the final at Millennium Stadium, Cardiff, saw Jones become the manager who returned Wolves to the top level of English football for the first time since 1984 and the man who achieved the chairman Jack Hayward's ambition of Premier League football after 11 years, millions of pounds spent on players, and four previous managers."]}, {"page": "Stowe School", "response": ["* Sir Jack Hayward, (1923-2015), entrepreneur and former owner of Wolverhampton Wanderers"]}, {"page": "Rick Hayward", "response": ["Richard \"Rick\" A. Hayward (born 17 March 1952) is a British businessman who was chairman of the English association football club Wolverhampton Wanderers from 2003 to 2006. He is the eldest son of Sir Jack Hayward."]}, {"page": "Rachael Heyhoe Flint", "response": ["She hit the first six in a women's Test match in 1963, at the Oval against Australia. She was instrumental in the effort to hold the first Women's World Cup, securing funding from her friend Jack Hayward.The tireless champion of women's cricket liberation , ESPNcricinfo, 19 January 2017 She captained the England team in the tournament, and scored a half-century in the final, which England won against Australia at Edgbaston on 28 July 1973.Women's World Cup, 21st Match: England Women v Australia Women at Birmingham, 28 July 1973 , ESPNcricinfo The women led the men: first men's Cricket World Cup was not held for another two years."]}, {"page": "Women's Cricket World Cup", "response": ["Talks began in 1971 about holding a World Cup for women's cricket, led by Jack Hayward. South Africa, under pressure from the world for their apartheid laws, were not invited to take part in the competition. Both of the other two Test playing nations, Australia and New Zealand were invited. Hayward had previously organised tours of the West Indies by England women, and it was from this region that the other two competing nations were drawn; Jamaica and Trinidad & Tobago. To make up the numbers, England also fielded a \"Young England\" team, and an \"International XI\" was also included. Five South Africans were invited to play for the International XI as a means of compensation for the team not being invited, but these invitations were later withdrawn."]}, {"page": "Iwan Roberts", "response": ["In the summer off-season of 1997, Roberts returned from holiday and came into the club for the first day of pre-season training where manager Mark McGhee called him into his office.  There McGhee said that he had been told that in order to bring in new players, he had to sell first, and that Roberts was the only player for whom an offer had been made – by Norwich City. Roberts did not want to leave the club, but accepted that if the manager did not want him there, he needed to go. In his 2004 book, Roberts says that he has no fondness for Wolves, due to the arrogant, ungrateful and violent mentality and behaviour of many of their supporters.  Roberts said that despite his goals, especially against West Bromwich Albion, and despite the fact he did not want to leave the club \"their fans still slaughter me\". He also cites the way their fans \"abused\" the Wolves president Sir Jack Hayward, that they \"think they have a God-given right to be in the Premier League just because they've got a nice stadium\", they are \"arrogant\" and spat at and pushed Norwich fans.: \"I hate Wolves with a passion. I... played 28 games for them and scored 12 goals, including four against West Brom... and yet their fans still slaughter me whenever we play them. It's not as if I wanted to leave... Sir Jack Hayward ... [is] a really nice man and he's put millions into the club. But when they were going through bad times a couple of years ago, fans were spitting at him and abusing him. I couldn't believe it... Wolves fans seem to think they have a God-given right to be in the Premier League just because they've got a nice stadium. It doesn't work like that. The majority of First Division clubs have lovely all-seater stadiums. The fans do get behind you at Molineux, but they are arrogant. And Norwich fans have told me they were spat at and pushed after the play-off semi-final a couple of years ago.\""]}, {"page": "Sir Jack Hayward", "response": ["#REDIRECT Jack Hayward"]}, {"page": "History of women's cricket", "response": ["In April 1970, MCC's traditional Easter coaching classes at Lord's were attended by Sian Davies and Sally Slowe of Cheltenham Ladies' College (see photo in Wisden at Lord's, page 129) breaking the 'gender barrier'. The first Women's Cricket World Cup was held in England in 1973, funded in part by businessman Jack Hayward, and won by the hosts at Lords in front of Princess Anne. Enid Bakewell and Lynne Thomas, making their international debuts for England, scored unbeaten hundreds against an International XI in Brighton in a stand of 246, a record which stood for a quarter of a century . Lord's staged its first women's Test match in 1979, between England and Australia."]}, {"page": "Wolverhampton", "response": ["*Sir Jack Hayward, OBE, 9 July 2003"]}, {"page": "John Hayward", "response": ["*Sir Jack Hayward (1923–2015), property developer", "*Jack Hayward (cricketer) (1910-1976), Rhodesian cricketer", "*Jack Hayward (political scientist) (1931–2017), English writer and academic"]}, {"page": "Charles William Hayward", "response": ["Hayward married Hilda Arnold in 1915 and remained so until her death in 1971.  The Hilda Hayward Swimming Pool  was named in remembrance of her.  The couple had one son, Jack Hayward, who was born in 1923.", "re: changes made 26 September 2019:  Information from consultation with Sir Jack Hayward in 2012 during visit with my second cousin in Freeport, Grand Bahama Island."]}, {"page": "List of people from Wolverhampton", "response": ["* Sir Jack Hayward, OBE (1923–2015) – son of Wolverhampton factory owners; self-made millionaire; benefactor of many charities; fighter pilot in the Second World War; President of Wolverhampton Wanderers F.C."]}, {"page": "2007–08 Wolverhampton Wanderers F.C. season", "response": ["This season was the first under the ownership of Steve Morgan, ending the seventeen-year reign of Sir Jack Hayward. Morgan had bought the club for the nominal sum of £10, with the proviso that he invested £30 million into the club.", "The close season saw businessman Steve Morgan take control of the club for a nominal £10 fee in return for a £30 million investment into the club, resulting in the departure of Sir Jack Hayward after 17 years as chairman. The protracted takeover, originally announced in May, was finally completed on 9 August 2007. The announcement of the deal saw the club set out their future ethos:"]}, {"page": "Avro Vulcan XH558", "response": ["The project faced a funding crisis in 2006, with an appeal being sent out on 1 August for £1.2m to be raised by the end of the month, or the restoration would have to be suspended indefinitely. The target was reached thanks in part to a last minute donation of £500,000 from a mystery donor. The donor was later named as Sir Jack Hayward, a British philanthropist. This topped off the £860,000 already raised."]}, {"page": "Index of World War II articles (J)", "response": ["# Jack Hayward"]}]}}