{"wiki_id": "http://www.wikidata.org/entity/Q15990314", "itemLabel": "Iain Tennant", "itemDescription": "British businessman", "wikipedia_url": "https://en.wikipedia.org/wiki/Iain_Tennant", "wikipedia_page": {"main": "Sir Iain Mark Tennant  (11 March 1919 – 25 September 2006) was a Scottish businessman.", "link_mentions": [{"page": "List of Knights and Ladies of the Thistle", "response": ["|Iain Tennant||75px||1919–2006||1986|| "]}, {"page": "Iain Mark Tennant", "response": ["#REDIRECT Iain Tennant"]}, {"page": "Lord Lieutenant of Moray", "response": ["*Sir Iain Tennant 16 January 1964 – 1994"]}, {"page": "Deaths in September 2006", "response": ["* Sir Iain Tennant, 87, Scottish businessman and public servant."]}, {"page": "Lord High Commissioner to the General Assembly of the Church of Scotland", "response": ["*1988–1989: Captain Sir Iain Tennant"]}, {"page": "Charles Tennant", "response": ["*Iain Tennant (1919–2006) 3rd great grandson"]}, {"page": "Jocelyn Stevens", "response": ["He was married to Jane Armyne Sheffield, daughter of John Vincent Sheffield and wife Ann Margaret Faudel-Phillips, paternal granddaughter of the 6th Baronet Sheffield and maternal granddaughter of the 3rd and last of the Faudel-Phillips baronets, and a Lady-in-Waiting to Princess Margaret, for 23 years until 1979. They had four children, two sons and two daughters. Alt URL Their daughter Pandora married property developer Charles Delevingne and they have three daughters, Chloe, and models Poppy Delevingne and Cara Delevingne. Stevens was a long-term partner of the philanthropist Dame Vivien Duffield until they separated in 2005. In 2008, he married Emma Margaret Ismay Cheape, daughter of the late Sir Iain Tennant and former wife of Angus Ismay Cheape. Interview with Mark Tennant."]}, {"page": "David Ogilvy, 12th Earl of Airlie", "response": ["* Lady Margaret Helen Isla Marion Ogilvy (23 July 1920 – 22 January 2014); married Iain Tennant on 11 July 1946. They have three children and six grandchildren."]}, {"page": "Tennant (surname)", "response": ["* Iain Tennant (1919–2006), British businessman"]}, {"page": "Index of World War II articles (I)", "response": ["# Iain Tennant"]}, {"page": "George Macaulay Kirkpatrick", "response": ["In 1896, Kirkpatrick married artist Mary Lydia Dennistoun (1870-1945). They had three daughters, Georgina Helen (born 1898) and Kathleen Mary (born 1899) in Malta, and Margaret Charlotte (born 1904) in Canada, mother of Iain Tennant."]}, {"page": "List of fellows of the Royal Society of Arts", "response": ["* Iain Tennant"]}, {"page": "Wedding of Princess Alexandra and Angus Ogilvy", "response": ["* Miss Emma Tennant, daughter of Iain Tennant and Lady Margaret Ogilvy, the bridegroom's niece", "** Lady Margaret and Iain Tennant, the groom's sister and brother-in-law"]}, {"page": "Kenneth Mackessack", "response": ["He later served as the Deputy Lieutenant of Moray in 1954, alongside Iain Tennant. He served as the chairman of the Moray Territorial Association from 1953 to 1962, alongside duties as the convenor of Moray County Council. He served as the vice-lieutenant of Moray in 1964. He died at Elgin in October 1982. He was survived by his two children from his first marriage. His brother, Douglas, was also a first-class cricketer. "]}, {"page": "List of The Crown characters", "response": ["| Iain Tennant ||  ||  || colspan=\"2\" "]}]}}