{"wiki_id": "http://www.wikidata.org/entity/Q15996334", "itemLabel": "Richard Pope-Hennessy", "itemDescription": "British politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Richard_Pope-Hennessy", "wikipedia_page": {"main": "Major-General Ladislaus Herbert Richard Pope-Hennessy  (1875 – 1 March 1942) was a British Army officer and Liberal Party politician of Irish Catholic descent.", "link_mentions": [{"page": "John Pope-Hennessy", "response": ["Born into an Irish Catholic family in the Belgravia district of Central London, Pope-Hennesssy's father was Major-General Richard Pope-Hennessy, who was the son of the politician John Pope Hennessy. Pope Hennessy's mother was Dame Una Pope-Hennessy. He was the elder of two sons; his younger brother, James Pope-Hennessy was a noted writer."]}, {"page": "50th (Northumbrian) Division", "response": ["|Major-General Richard Pope-Hennessy"]}, {"page": "John Pope Hennessy", "response": ["Hennessy had two illegitimate daughters with his mistress, Miss A. M. Conyngham, before, on 4 February 1868, marrying Catherine \"Kitty\" Elizabeth Low (1850–1923), daughter of his predecessor (acting) Governor of Labuan. They had three sons, including Richard Pope-Hennessy.Stearn, Roger T. (2007). \"Hennessy, Sir John Pope (1834–1891)\". Oxford Dictionary of National Biography. Oxford University Press. . Accessed 2 August 2018. Richard had two sons, John Wyndham Pope-Hennessy (1913–1994) and James Pope-Hennessy, author of a biography, Verandah, in 1964."]}, {"page": "Isle of Thanet (UK Parliament constituency)", "response": ["*Liberal: Richard Pope-HennessyThe Liberal Magazine, 1939"]}, {"page": "Irish military diaspora", "response": ["* Major-General Richard Pope-Hennessy"]}, {"page": "Una Pope-Hennessy", "response": ["Dame Una Constance Pope-Hennessy,  (née Birch; 21 April 1875 – 16 August 1949) was a British writer, historian, and biographer. She was the daughter of Sir Arthur Birch, and married Major (later Major-General) Richard Pope-Hennessy in 1910."]}, {"page": "James Pope-Hennessy", "response": ["Richard James Arthur Pope-Hennessy was born in London on 20 November 1916, the younger son of Ladislaus Herbert Richard Pope-Hennessy, a soldier from County Cork, Ireland, and his wife, Una, the daughter of Arthur Birch, Lieutenant-Governor of Ceylon. He was the younger of two sons; his elder brother, John Pope-Hennessy, was an English art historian, museum director and writer of note. James, as he was generally known, came from a close-knit Catholic family and was educated at Downside School and at Balliol College, Oxford, but generally showed a lack of interest in formal education and did not enjoy his time at either Downside or Oxford.Quennell, P., Introduction to A Lonely Business – A Self-Portrait of James Pope-Hennessy, 1981, p. xv.Lees-Milne, James, Fourteen Friends, 1996, John Murray Publishers, London, p. 201."]}, {"page": "November 1916", "response": ["* Born: Forrest J Ackerman, American writer, editor and principal writer of sci-fi/horror film fan magazine Famous Monsters of Filmland, in Los Angeles (d. 2008); James Pope-Hennessy, English biographer and travel writer, author of Aspects of Provence and Sins of the Fathers, son of Richard Pope-Hennessy, in London (d. 1974, murdered); Frankie Muse Freeman, American civil right activist and lawyer, first woman to be appointed to the United States Commission on Civil Rights, in Danville, Virginia (d. 2018)"]}, {"page": "1928 New Year Honours", "response": ["*Colonel Ladislaus Herbert Richard Pope-Hennessy  Military Attache, Washington."]}, {"page": "Ladislaus Herbert Richard Pope-Hennessy", "response": ["#REDIRECT Richard Pope-Hennessy"]}, {"page": "Pope-Hennessy, Richard", "response": ["#redirectRichard Pope-Hennessy"]}, {"page": "General Pope", "response": ["*Richard Pope-Hennessy (1875–1942), British Army major general "]}]}}