{"wiki_id": "http://www.wikidata.org/entity/Q15995073", "itemLabel": "Paul Flowers", "itemDescription": "British banker", "wikipedia_url": "https://en.wikipedia.org/wiki/Paul_Flowers_(banker)", "wikipedia_page": {"main": "Paul John Flowers  (born 5 June 1950) is an English local politician and former Methodist minister. He is a former Labour councillor in Rochdale and Bradford, and was non-executive chairman of the Co-operative Bank.After the bank lost £700m in the first half of 2013, and a £1.5 billion hole in the bank's finances was discovered by the new chief executive Euan Sutherland in May 2013, Flowers resigned in May 2013.In November 2013, the activities of Flowers, who had occupied a variety of powerful political and business posts and had been appointed by Labour leader Ed Miliband to a senior post in 2010, were widely reported in the media. Flowers was filmed by an acquaintance in his car apparently agreeing to buy cocaine and methamphetamine, and appearing to count large sums of money while discussing his use of a range of other non-medicinal drugs. He was subsequently taken to court and convicted of possession of drugs.Soon after the film of the apparent purchase of illicit drugs was released to the media, it was revealed that, while deputy head of social services at Rochdale Council, Flowers had known about the activities of paedophiles at a residential boys' school, but had not informed parents or taken measures to close the school, was responsible for rejecting allegations of child sex abuse against the late Rochdale MP Cyril Smith, and that, in 2011, while working at Bradford Council, \"inappropriate but not illegal adult content was found on a council computer handed in by Councillor Flowers for servicing. This was put to him and he resigned immediately.\"Several newspapers reported allegations that he communicated with rent boys using his work email account while he was in charge of the Co-operative Bank, and was convicted of carrying out a sex act in a public toilet more than 30 years ago.\n\n", "link_mentions": [{"page": "The Co-operative Bank", "response": ["Over the weekend of 15–16 June 2013 negotiations between the Co-operative Group and its regulator the  Prudential Regulation Authority culminated in reports  that the Bank had a shortfall in its capital of about £1.5 billion, and that this would be filled by a procedure known as a \"bail-in\" scheme. Bank Chairman Paul Flowers resigned shortly before the announcement of the shortfall. A press release by the bank issued on 17 June 2013 explained that the scheme would compel subordinated (also known as junior) bondholders to convert some or all of their assets from debt instruments to ownership (\"equity\") shares of uncertain value which would be listed on the London Stock Exchange and a new fixed income instrument. The scheme contrasted with the rescues of other British banks in 2008 and 2009 when central government introduced new capital into the failed institutions. Details of the outcome for small retail investors in the Bank were uncertain at the time of the June announcement, but there was no suggestion that ordinary deposits in the Bank would be put at any additional risk by the rescue, as they would continue to be covered by the existing compensation scheme. The bondholders had the opportunity to seek to reject the restructuring proposed, and an alternative option of the Bank of England taking over the ownership of the bank under the Banking Act 2009 special resolution regime was considered.", "On 17 November 2013, Labour Party advisor and the former Co-operative Bank Chairman, Rev. Paul Flowers, was caught buying crack cocaine and methamphetamine.\"Co-op Bank ex-boss Paul Flowers 'filmed buying drugs, BBC, 19 November 2013 The former Labour councillor served as the Bank's chairman from April 2010 until June 2013 and it was under his chairmanship that in March 2013 the bank reported losses of £600 million. In May, Moody's downgraded its credit rating by six notches to junk (Ba3) and the chief executive Barry Tootell resigned. Flowers was suspended by both the Labour Party and the Methodist Church. On 19 November it was discovered that Flowers had previously resigned as a Labour Party Councillor for Bradford Council after \"inappropriate\" content was discovered on his computer.Co-op Group chairman Len Wardle resigns scandal Guardian, 19 November 2013", "On 19 November 2013, the group's Chairman Len Wardle, who was leading the board when Flowers was appointed to his position, resigned \"with immediate effect\" because of the Flowers scandal.Co-op Group chair quits over Paul Flowers drugs claims BBC, 19 November 2013"]}, {"page": "Rochdale", "response": ["Other notable residents include businessman and philanthropist Sir Peter Ogden, Businessman and Author Benjamin Howarth, novelist Nicholas Blincoe, Monica Coghlan, a prostitute caught up in the Jeffrey Archer scandal, and the banker Rev. Paul Flowers. Poet John Siddique was brought up in Rochdale and has referred to the town in several poems. Novelist Anna Jacobs was born in Rochdale. World Series of poker winner Jake Cody grew up in Rochdale. Elite British climber Ben Thornton was brought up in Rochdale. The footballer Earl Barrett was born there in April 1967 to Jamaican immigrant parents. Great Britain Olympian Craig Dawson, represented hometown club Rochdale and Bolton Wanderers at football."]}, {"page": "Great Horton", "response": ["| Paul Flowers (Lab)", "| Paul Flowers (Lab)", "|bgcolor=\"#99CCFF\"| Paul Flowers (Lab)", "| Paul Flowers (Lab)", "| Paul Flowers (Lab)", "| By-election24 November 2011Cllr. Paul Flowers (Labour Party) stood down in 2011 after \"adult content\" was found on a council computer he had used."]}, {"page": "1950 in the United Kingdom", "response": ["* 5 June – Paul Flowers, Labour politician and non-executive chairman of The Co-operative Bank"]}, {"page": "Barton Peveril Sixth Form College", "response": ["* Rev Paul Flowers, former chairman of the Co-op bank"]}, {"page": "List of gay, lesbian or bisexual people: F", "response": ["| Paul Flowers"]}, {"page": "List of people from Rochdale", "response": ["*Paul Flowers – banker, also known as the Crystal Methodist; councillor in the town in 1988–92"]}, {"page": "Flowers (name)", "response": ["*Paul Flowers (banker) (born 1950), English politician, minister and banker", "*Paul Flowers (footballer) (born 1974), English footballer"]}, {"page": "List of fellows of the Royal Society of Arts", "response": ["* Paul Flowers"]}, {"page": "Reverend Flowers", "response": ["*Paul Flowers (banker), former chairman of the Co-operative Bank and a Methodist minister"]}, {"page": "2011 City of Bradford Metropolitan District Council election", "response": ["This was triggered by the resignation of Cllr. Paul Flowers (Labour Party) who stood down after \"adult content\" was found on a council computer he had used."]}, {"page": "2013 in the United Kingdom", "response": ["**Former non-executive chairman of the Co-operative Bank Paul Flowers is arrested by police in with a drugs supply investigation, having been exposed agreeing to buy cocaine and methamphetamine by the Mail on Sunday newspaper. Flowers is also suspended from the Labour Party and Methodist Church as a result of the allegations."]}, {"page": "2013 in England", "response": ["*21 November – Former non-executive chairman of the Co-operative Bank Paul Flowers is arrested by police in with a drugs supply investigation, having been exposed agreeing to buy cocaine and methamphetamine by the Mail on Sunday newspaper. Flowers is also suspended from the Labour Party and Methodist Church as a result of the allegations."]}, {"page": "2008 City of Bradford Metropolitan District Council election", "response": ["Cllr. Paul Flowers (Labour Party) stood down in 2011 after \"adult content\" was found on a council computer he had used. Abdul Jabar retained the seat for the party in a by-election later the same year."]}, {"page": "Paul Flowers", "response": ["Paul Flowers may refer to:", "*Paul Flowers (banker) (born 1950), businessman, church minister and former bank chairman", "*Paul Flowers (footballer) (born 1974), English former footballer"]}, {"page": "2014 in the United Kingdom", "response": ["*7 May – Former Co-operative Bank chairman Paul Flowers is fined £400 after being convicted of possessing cocaine, methamphetamine and ketamine. Flowers stood down from his role at the bank in 2013 due to allegations concerning drug taking, inappropriate expense payments and use of rent boys."]}, {"page": "2014 in England", "response": ["* 7 May – Former Co-operative Bank chairman Paul Flowers is fined £400 after being convicted of possessing cocaine, methamphetamine and ketamine. Flowers stood down from his role at the bank in 2013 due to allegations concerning drug taking, inappropriate expense payments and use of rent boys."]}, {"page": "Lifeline project", "response": ["Paul Flowers was chair of the organisation until 2014 when he was asked to resign over allegedly excessive expenses claims. On the 19th May 2017, the charity collapsed, just after the Charity Commission for England and Wales launched an investigation into its financial controls. At that time it employed almost 1,500 people. CGL were expected to take over some of their staff and projects."]}, {"page": "List of people from Portsmouth", "response": ["*Paul Flowers, disgraced chairman of the Co-operative Bank and Labour politician "]}, {"page": "Crystal Methodist", "response": ["#REDIRECT Paul Flowers (banker)"]}]}}