{"wiki_id": "http://www.wikidata.org/entity/Q15999284", "itemLabel": "Henry Charleton", "itemDescription": "British politician (1870-1959)", "wikipedia_url": "https://en.wikipedia.org/wiki/Henry_Charleton", "wikipedia_page": {"main": "Henry Charles Charleton (1 March 1870 – 8 October 1959) was a British train driver, trade unionist and Labour Party politician. He sat in the House of Commons from 1922 to 1931 and from 1935 to 1945.", "link_mentions": [{"page": "List of MPs elected in the 1924 United Kingdom general election", "response": ["|Henry Charleton"]}, {"page": "List of MPs elected in the 1935 United Kingdom general election", "response": ["|Henry Charleton"]}, {"page": "List of MPs elected in the 1929 United Kingdom general election", "response": ["|Henry Charleton"]}, {"page": "List of MPs elected in the 1923 United Kingdom general election", "response": ["|Henry Charleton"]}, {"page": "List of MPs elected in the 1922 United Kingdom general election", "response": ["|Henry Charleton"]}, {"page": "Leeds South (UK Parliament constituency)", "response": ["| 1922 || Henry Charleton || Labour", "| 1935 || Henry Charleton || Labour"]}, {"page": "Noel Whiteside", "response": ["After spending several years public speaking in support of Conservative Party causes, Whiteside was adopted as the Conservative candidate for Leeds South, a seat held for the Labour Party by Henry Charleton who was a Whip for his party. When the general election was called in October 1931, the Conservaives hoped that Whiteside and Charleton would have a straight fight. However at the last moment Captain Frederick Boult came forward as a Liberal Party candidate, having withdrawn from fighting at Buckrose. This shift was thought to make the election more difficult for Whiteside, and Charleton was expected to win the election.\"Unionist Hopes In Leeds\", The Times, 17 October 1931, p. 8. However, on polling day Leeds South was part of the landslide result, with Whiteside winning a majority of 725 over Charleton and Boult coming a poor third.", "On 6 June 1935, Whiteside married Dorothy Farrington at Speldhurst in Kent.\"Court Circular\", The Times, 6 June 1935, p. 19. That November, a new general election required him to defend his seat against Henry Charleton, who attempted to regain it for the Labour Party. Whiteside having been an unexpected winner in what was regarded as a safe Labour seat, he was thought to be vulnerable.\"West Yorkshire\", The Times, 9 November 1935, p. 18. There was again a three-cornered contest with the third candidate coming from the Social Credit Party of Great Britain and Northern Ireland, one of only three candidates in the election. After a keen contest, Charleton regained his seat with a majority of 1,016.\"The Times House of Commons, 1935\", p. 62-3."]}, {"page": "William Middlebrook", "response": ["Middlebrook entered the House of Commons at a by-election in 1908 for Leeds South. The seat had become vacant on the death of the sitting Liberal MP, Sir John Lawson Walton (1852–1908) who held the office of Attorney General at the time of his death.The Times, 20 January 1908 p8 It seems that one of the reasons Middlebrook was selected was his ability to give financial aid to the Leeds South Liberal Association. Walton had paid the salary of his political agent and Middlebrook undertook to pay the constituency £100 a year.Neal Blewett, The Peers, the Parties and the People: The General Elections of 1910; University of Toronto Press, 1972 p280  This was at a time when MPs were not yet paid a salary. The by-election took place on 13 February 1908 and Middlebrook held the seat for the Liberals with a majority of 359 over his Unionist opponent Reginald Neville, with Labour's Albert Fox in third place.F W S Craig, British Parliamentary Election Results 1885-1918; Macmillan Press, 1974 p134 Middlebrook held his seat until the 1922 general election when he was defeated in a straight fight by Labour's Henry Charleton. He did not stand for Parliament again.F W S Craig, British Parliamentary Election Results 1918-1949; Political Reference Publications, Glasgow, 1949 p163"]}, {"page": "Henry Charles Charleton", "response": ["#REDIRECT Henry Charleton"]}, {"page": "List of members of London County Council 1937–1949", "response": ["| Henry Charleton(resigned 17 December 1935)"]}]}}