{"wiki_id": "http://www.wikidata.org/entity/Q15971259", "itemLabel": "Joe McCarthy", "itemDescription": "Canadian WW2 RAF pilot and Dambuster", "wikipedia_url": "https://en.wikipedia.org/wiki/Joe_McCarthy_(RCAF_officer)", "wikipedia_page": {"main": "Joseph Charles \"Big Joe\" McCarthy,  (31 August 1919 – 6 September 1998) was an American aviator who served with the Royal Canadian Air Force in Bomber Command during World War II. He is best known as the commander and pilot of Lancaster AJ-T (\"T-Tommy\") in Operation Chastise, the \"Dambuster\" raid of 1943.", "link_mentions": [{"page": "Sutton Bridge", "response": ["RAF Sergeant George (Johnny) Johnson DFM, Bomb-Aimer on board Lancaster bomber ED825/AJ-T commanded by Joe McCarthy that attacked the Sorpe Dam from a height of just 30 feet, recounts that in the village of Sutton Bridge there were electric cables that cross the River Nene just before the bridge itself and to hone their low-level flying skills they would regularly practice flying the Lancasters under the electric cables and skim up over Crosskeys Bridge, missing the bridge itself by only a few feet each time."]}, {"page": "Operation Chastise", "response": ["Formation No. 2, numbering five aircraft, piloted by Flt Lt Joe McCarthy (an American serving in the RCAF), P/O Vernon Byers (RCAF), Flt Lt Norman Barlow (RAAF), P/O Geoff Rice and Flt Lt Les Munro (RNZAF), was to attack the Sorpe.", "The Sorpe dam was the one least likely to be breached. It was a huge earthen dam, unlike the two concrete-and-steel gravity dams that were attacked successfully. Due to various problems, only two Lancasters reached the Sorpe Dam: Joe McCarthy (in T for Tommy, a delayed aircraft from the second wave) and later Brown (F for Freddie) from the third formation. This attack differed from the previous ones in two ways: the 'Upkeep' bomb was not spun, and due to the topography of the valley the approach was made along the length of the dam, not at right angles over the reservoir."]}, {"page": "Joseph McCarthy (disambiguation)", "response": ["Joseph or Joe McCarthy may also refer to:", "*Joe McCarthy (catcher) (1881–1937), American baseball catcher", "*Joe McCarthy (manager) (1887–1978), American baseball manager", "*Joe McCarthy (wrestler) (1929–2012), American professional wrestler", "*Joe McCarthy (outfielder) (born 1994), American baseball outfielder", "*Joe McCarthy (RCAF officer) (1919–1998), American-born volunteer pilot in the Royal Canadian Air Force who flew in Operation Chastise", "*Joe McCarthy (Irish musician) (born 1936), Irish musician with the showband group The Dixies"]}, {"page": "Hinckley Academy", "response": ["* Flying Officer Geoff Rice DFC, flew AJ-H in the Dambusters raid on 16 May 1943, with a second wave of five Lancasters that took off at 9.31pm for the Sorpe Dam with Canadian Joe McCarthy, flying too low over the sea, ripping off the bomb at 10.59pm near Vlieland in the north Netherlands, but returned safely at 12.46am; he was later shot down in Lancaster DV398 KC-Z over Liège in Belgium, evading capture but was caught in Antwerp on 28 April 1944 and sent to Stalag Luft III; he died in Taunton on 24 November 1981 aged 64; a green plaque was put in the Sycamores Inn at Burbage in September 2014"]}, {"page": "Les Munro", "response": ["On 25 March 1943, Munro, along with Flight Lieutenant Joe McCarthy and Squadron Leader David Maltby, were transferred to 617 Squadron to be part of the secretive Dambusters raid forming at RAF Scampton. The squadron was created to attack the dams of the Ruhr in an effort to wreck the industrial capacity of Germany. It was initially called Squadron \"X\", as the speed of its formation outstripped the RAF process for naming squadrons. Twenty-one bomber crews were selected from existing squadrons in 5 Group. These crews included RAF personnel of several different nationalities, as well as members of the Royal Australian Air Force (RAAF), Royal Canadian Air Force (RCAF) and Royal New Zealand Air Force (RNZAF), who were frequently attached to RAF squadrons under the British Commonwealth Air Training Plan.", "Munro's co-pilot on this operation was Wing Commander Leonard Cheshire, the squadron's commanding officer who later was awarded the Victoria Cross. When Cheshire was stood down, Cochrane also stood down 617's three flight commanders Dave Shannon from Australia, Joe McCarthy from Canada, and Les Munro. Munro was \"not happy\" as he had flown 59 ops and said:  "]}, {"page": "List of aviators by nickname", "response": ["* \"Big Joe\" – Joe McCarthy, RAF Bomber Command pilot (617 Squadron) in the Second World War"]}, {"page": "Joseph Charles McCarthy", "response": ["#REDIRECTJoe McCarthy (RCAF officer)"]}, {"page": "David Maltby", "response": ["Maltby then spent six months commanding an Air Bomber Training Section in No. 1485 Target Towing and Gunnery Flight, before returning to active service with 97 Squadron in March 1943. He was given a new crew, most of whom had only just finished training. On 25 March 1943, he and his crew were transferred to 617 Squadron, along with Flt Lt Joe McCarthy and Flt Lt Les Munro and their crews."]}, {"page": "Johnny Johnson (RAF officer)", "response": ["Johnson continued on squadron operations as an air gunner, until the opportunity came along for him to train as a specialist bomb aimer. Undergoing a course at RAF Fulbeck in November 1942, he returned to No. 97 Squadron filling the vacancy for a bomb aimer with the crew of Joe McCarthy. Initially, Johnson showed reticence in operating with an American skipper, however having met with McCarthy, he changed his mind."]}, {"page": "Deaths in September 1998", "response": ["*Joe McCarthy, 79, American aviator."]}]}}