{"wiki_id": "http://www.wikidata.org/entity/Q15968034", "itemLabel": "Kate Losinska", "itemDescription": "British trade unionist", "wikipedia_url": "https://en.wikipedia.org/wiki/Kate_Losinska", "wikipedia_page": {"main": "Kathleen Mary Losinska, OBE (née Conway; 5 October 1922 – 16 October 2013) was a leading conservative trade unionist in Britain, involved in the Civil and Public Services Association and associated with Sir David Stirling.\nShe was born in Croydon, the daughter of a soldier, and attended Selhurst Grammar School. Conway entered the civil service at age 17 in the Office of Population Censuses and Surveys, later marrying a Polish air ace, Stanisław Losinski in 1942, which informed her opposition to communism.\nIn 1975 she was elected President of the Civil and Public Services Association (CPSA) for the first time, beating her nearest rival by 10,000 votes, although she was deposed the following year. She re-took the position from 1979–82, the position going to Militant supporter Kevin Roddy in 1982, before Losinska was re-elected once more from 1983–86. Throughout much of this period she allied herself with Alistair Graham who became CPSA General Secretary from 1982–86.Losinska's presidencies were surrounded by controversies. During the first year of her presidency she had taken the union's executive after they had censured her for her comments in an article in Readers Digest, where she had said the union was being infiltrated by Trotskyists and Marxists and wished to reply to her in the union's journal, Red Tape. As chair of the Solidarnosc Foundation, she clashed with Arthur Scargill over his criticisms of Polish trade union Solidarność, and later appointed Knight Commander of the Order of Polonia Restituta. Her opposition to a merger with the Society of Civil and Public Servants in 1986 led to a split in the Moderate group into Losinska's National Moderate Group and the Democratic Moderate Group. She chaired the Trade Union Committee for European and Transatlantic Understanding, a body funded by NATO and the US Congress.", "link_mentions": [{"page": "David Stirling", "response": ["During the mid to late 1970s, Stirling created a secret organisation designed to undermine trade unionism from within. He recruited like-minded individuals from within the trade union movement, with the express intention that they should cause as much trouble during conferences as permissible. One such member was Kate Losinska, who was Head of the Civil and Public Services Association. Funding for this \"operation\" came primarily from his friend Sir James Goldsmith."]}, {"page": "Economic League (United Kingdom)", "response": ["* Kate Losinska (Civil and Public Services Association)"]}, {"page": "Deaths in October 2013", "response": ["*Kate Losinska, 81, British trade unionist.Kate Losinska: Activist who struggled for the future of trade unionism in Britain while fighting factions in her own union"]}, {"page": "General Council of the Trades Union Congress", "response": ["| Kate Losinska"]}]}}