{"wiki_id": "http://www.wikidata.org/entity/Q15995126", "itemLabel": "E. A. Hewett", "itemDescription": "British merchant", "wikipedia_url": "https://en.wikipedia.org/wiki/E._A._Hewett", "wikipedia_page": {"main": "Edbert Ansgar Hewett,  (5 September 1860 – 24 November 1915) was a prominent British merchant in Hong Kong and China and member of the Executive Council and Legislative Council of Hong Kong.", "link_mentions": [{"page": "Commercial (First)", "response": ["* E. A. Hewett (1906–1915)"]}, {"page": "1903 Hong Kong sanitary board election", "response": ["| E. A. Hewett || Agent, P. & O. Company || J. H. Lewis || E. W. Mitchell"]}, {"page": "November 1915", "response": ["* Died: L. C. Hughes, American politician, 11th Governor of Arizona Territory (b. 1842); E. A. Hewett, British merchant and colonial administrator, member of the Executive Council of Hong Kong from 1906 to 1915 (b. 1860)"]}, {"page": "Edbert Ansgar Hewett", "response": ["#REDIRECT E. A. Hewett"]}, {"page": "Percy Hobson Holyoak", "response": ["Holyoak was the chairman of the Hong Kong General Chamber of Commerce in from 1917 to 1918 and 1920 to 1921. He was nominated as unofficial member of the Legislative Council as a representative of the chamber on the death of E. A. Hewett in 1915 and later on was appointed to the Executive Council for various times. Despite being a large contributor to the raising funds during the First World War, in early 1917 Holyoak moved in the Legislative Council to exclude German merchants from the colony for ten years, mandated by the Chamber of Commerce. In 1919, he and Henry Pollock formed the Constitutional Reform Association of Hong Kong to demand London for a further representation in the colonial legislature."]}, {"page": "1914 Hong Kong sanitary board election", "response": ["There were two candidates, P. W. Goldring, senior member of the Goldring and Russ solicitors firm and W. L. Carter, manager of the China and Japan Telephone and Electric Co., Ltd.. Goldring was proposed by E. J. Grist and seconded by Playfair while Carter was proposed by E. A. Hewett and seconded by H. E. Pollock."]}]}}