{"wiki_id": "http://www.wikidata.org/entity/Q15967047", "itemLabel": "Noelle Barker", "itemDescription": "Soprano singer and singing teacher", "wikipedia_url": "https://en.wikipedia.org/wiki/Noelle_Barker", "wikipedia_page": {"main": "Noelle Barker OBE (28 December 1928 – 15 May 2013) was an English soprano singer and singing teacher. She was considered one of the most outstanding singing teachers of her generation. She taught at the Guildhall School of Music and Drama. Among her students was the soprano Sophie Karthäuser.", "link_mentions": [{"page": "Symphony No. 1 (Brian)", "response": ["|24 June 1961||Central Hall Westminster, London||Polyphonia Symphony Orchestra,Royal Military School of Music,London Philharmonic Choir,Kingsway Choral Society,London Orpheus Choir,Hendon Grammar School Choir||Noelle Barker (soprano),Jean Evans (alto),Kenneth Bowen (tenor),John Shirley-Quirk (baritone)||Bryan Fairfax||First performance of the symphony."]}, {"page": "Noelle", "response": ["* Noelle Barker (1928–2013), British soprano singer and singing teacher"]}, {"page": "Vera Rózsa", "response": ["Among Vera Rózsa's students were Sarah Walker, Cynthia Hoffmann, Kiri Te Kanawa, Ileana Cotrubaș, Sonia Theodoridou, Agathe Martel, Karita Mattila, Dorothea Röschmann, Tom Krause, Jyrki Niskanen, Martina Bovet, Anne Sofie von Otter, Anne Howells, Anthony Rolfe Johnson, François le Roux, Nora Gubisch, Marie Te Hapuku, Ildikó Komlósi, Louise Werner, and many others. Maria Callas intended to work with Rózsa to make a career comeback, but died shortly before she could do so. Participation in her classes and courses is mentioned in many modern day classical music singers' CVs. Several of her own students, such as Noelle Barker, Enid Hartle and Jessica Cash, also became successful singing teachers in their own right."]}, {"page": "Anna Steiger", "response": ["She trained with Noelle Barker at the Guildhall School of Music in London from 1977 to 1983 and then with Vera Rózsa at the National Opera Studio from 1985 to 1986. She won the Sir Peter Pears Award in 1982, the Richard Tauber Prize in 1984, and the John Christie Award in 1985."]}, {"page": "Amel Brahim-Djelloul", "response": ["Considered one of the most promising singers of her generation, Amel Brahim-Djelloul started her musical studies with the violin. She began studying singing in 1995 in Algiers under the tuition of Abdelhamid Belferouni. It was Noelle Barker who advised her to go to Paris to finish her training, and she studied at the Ecole Nationale de Musique at Montreuil with Frantz Petri and then at the Conservatoire National Supérieur de Musique in Paris with Peggy Bouveret and Malcolm Walker, with whom she has since been working. She graduated from the Conservatoire in June 2003."]}, {"page": "Deaths in May 2013", "response": ["*Noelle Barker, 84, British soprano and singing teacher.Noelle Barker: Soprano who championed new music"]}, {"page": "Katarina Karnéus", "response": ["She worked with her teacher Noelle Barker in 1999 in preparation for her first Octavian in Der Rosenkavalier, at Cardiff in June 2000.Milnes, R. Der Rosenkavalier (review of WNO, Cardiff). Opera, Vol 51 No 9, September 2000, p1105-6."]}, {"page": "Sophie Karthäuser", "response": ["Born in Malmedy, her musical training began in her village of , where she learned the clarinet at the local academy and was a member of the church choir. At the age of 16, she decided to take singing lessons at the regional academy. In 1992, at the age of 18, she entered the Royal Conservatory of Liège, studying with Greta de Reyghere and Thierry Migliorini. Winner of the  in 1997, she continued her studies at the Guildhall School of Music and Drama in London with Noelle Barker. She participated in some masterclasses and took private lessons, notably with Elisabeth Schwarzkopf."]}]}}