{"wiki_id": "http://www.wikidata.org/entity/Q1607218", "itemLabel": "Henry Roberts", "itemDescription": "British architect", "wikipedia_url": "https://en.wikipedia.org/wiki/Henry_Roberts_(architect)", "wikipedia_page": {"main": "Henry Roberts (16 April 1803 – 9 March 1876) was a British architect best known for Fishmongers' Hall in London and for his work on model dwellings for workers.\n\n", "link_mentions": [{"page": "George Gilbert Scott", "response": ["Born in Gawcott, Buckingham, Buckinghamshire, Scott was the son of the Reverend Thomas Scott (1780–1835) and grandson of the biblical commentator Thomas Scott. He studied architecture as a pupil of James Edmeston and, from 1832 to 1834, worked as an assistant to Henry Roberts. He also worked as an assistant for his friend, Sampson Kempthorne, who specialised in the design of workhouses, a field in which Scott was to begin his independent career.Bayley 1983, p. 43"]}, {"page": "London Bridge station", "response": ["Plans for a large new station were drawn up, designed jointly by Lewis Cubitt, John Urpeth Rastrick and Henry Roberts. Drawings were published in the Illustrated London News and George Bradshaw's Guide to the London and Brighton Railway 1844. They show 'a quasi-Italianate building with a picturesque campanile'. It opened for business in July 1844 while only partially complete, but events were taking place which would mean that the bell tower would never be built, and the new building would only last five years.", "Category:Henry Roberts railway stations"]}, {"page": "John Soane", "response": ["Among the more renowned architects who attended Soane's lectures at the Royal Academy, but weren't actually articled to him as a studentWhitbourn, 2003, p. 11 was Decimus Burton, who was one of the most famous and most successful architects of the 19th century. Other successful architects who as students attended the lectures were James Pennethorne,Tyack, 1992, p. 7 George Gilbert Scott,Cole, 1980, p. 6 Owen JonesFlores, 2006, p. 13 and Henry Roberts.Curl, 1983, p. 15", "* Curl, James Stevens, (1983) The Life and Works of Henry Roberts 1803–1876, Philimore, "]}, {"page": "Semi-detached", "response": ["At the same time as the huge increase in the population of the rural counties there was an even greater shift in population from the impoverished land to the large towns and to cities. Society was restructuring, with the labouring classes dividing into artisans and labourers. In the cities, labourers were housed in overcrowded tenement blocks, rookeries and lodging houses, and philanthropic societies aimed to improve conditions. The rural Labourers' Friend Society expanded in 1844 and was reconstituted as the Society for Improving the Condition of the Labouring Classes. In their 1850 publication The Dwellings of the Labouring Classes, written by Henry Roberts, the society laid out plans for model 'semi-detached' cottages for workers in towns and the city. However, the first properties they built were tenements and lodging houses. "]}, {"page": "Worshipful Company of Fishmongers", "response": ["The Company's livery hall in the City of London is known as Fishmongers' Hall (sometimes shortened in common parlance to Fish Hall); its earliest recorded hall was built in 1310. A new hall, on the present site, was bequeathed to the Company in 1434. Together with 43 other Livery halls, this one was destroyed in the Great Fire of London in 1666 and a replacement hall designed by the architect Edward Jerman opened in 1671. This hall by Jerman was demolished to facilitate the construction of the new London Bridge in 1827. The Fishmongers' next hall was designed by Henry Roberts (although his assistant, later the celebrated Sir Gilbert Scott, made the drawings) and built by William Cubitt & Company, opening in 1834. After severe bomb damage during the Blitz, Fishmongers' Hall was restored by Austen Hall (of Whinney, Son & Austen Hall) and reopened in 1951."]}, {"page": "Robert Smirke (architect)", "response": ["His pupils included Lewis Vulliamy, William Burn, Charles Robert Cockerell, Henry Jones Underwood, Henry Roberts, and his own brother Sydney, best known for the circular reading room at the British Museum. Another brother, Edward Smirke, was a lawyer and antiquarian. Their  sister Mary Smirke was a noted painter and translator."]}, {"page": "Henry Roberts", "response": ["Henry Roberts may refer to:", "*Henry Roberts (fl. 1606), English writer", "*Henry Roberts (Royal Navy officer) (1756–1796), served with Captain Cook", "*Henry Roberts (architect) (1803–1876), architect of Fish Hall", "*Henry Roberts (cricketer) (1888–1963), English first class cricketer", "*Henry Roberts (engraver), English engraver in the 18th-century", "*Henry Roberts (governor) (1853–1929), American politician and Governor of Connecticut", "*Henry Roberts (rugby union) (1862–1949), New Zealand rugby player", "*Harry Roberts (footballer, born 1907) (Henry Roberts, 1907–1984), English footballer"]}, {"page": "Architecture of London", "response": ["File:Fishmongers' Hall from Oystergate Walk.jpg|Fishmongers' Hall (1834) Henry Roberts"]}, {"page": "Mary Ann Gilbert", "response": ["Sharing her husband's interest, Mary Ann Gilbert managed some successful practical agronomical experiments at Beachy Head in feeding the poor, or rather, teaching them to feed themselves using land no one else wanted, for a fair rent. She presented the statistical results of these works to her husband's political, scientific and \"County\" contacts. She was also a prominent member of the Labourer's Friend Society (later the Society for Improving the Condition of the Labouring ClassesThe Society for Improving the Condition of the Labouring Classes was established in 1844 with the Prince Consort as its President; Henry Roberts, its Honorary Architect, was a pioneer in the improvement of working-class housing.). Among those who advised her were Richard Whately, Anglican Archbishop of Dublin  and his brother, the Vicar of Cookham in Berkshire, Edwin Chadwick and William Gill, of Chacewater, Cornwall."]}, {"page": "Fishmongers' Hall", "response": ["The first recorded Fishmongers' Hall was built in 1310. A new hall, on the present site, was bequeathed to the Company in 1434. Together with 43 other livery halls, it was destroyed in the Great Fire of London in 1666 and a replacement hall designed by the architect Edward Jerman opened in 1671. This hall by Jerman was demolished to facilitate the construction of the new London Bridge in 1827. The Fishmongers' fourth hall was designed by Henry Roberts (although his assistant, later the celebrated Sir Gilbert Scott, made the drawings) and built by William Cubitt & Company, opening in 1834. After severe bomb damage during the Blitz, Fishmongers' Hall was restored by Austen Hall (of Whinney, Son & Austen Hall) and reopened in 1951."]}, {"page": "List of British architects", "response": ["*Henry Roberts (1803–1876)"]}, {"page": "Escot, Talaton", "response": ["Escot in the parish of Talaton, near Ottery St Mary in Devon, is an historic estate. The present mansion house known as Escot House is a grade II listed building built in 1837 by Sir John Kennaway, 3rd Baronet to the design of Henry Roberts, to replace an earlier house built in about 1680 by Sir Walter Yonge, 3rd Baronet (1653–1731) of Great House in the parish of Colyton, Devon, to the design of Robert Hooke, which burned down in 1808. Today it remains the home of the Kennaway baronets.Kidd, Charles, Debrett's peerage & Baronetage 2015 Edition, London, 2015, p.B454", "The present house was built in 1838 by Sir John Kennaway, 2nd Baronet (1797–1873) (whose father had died two years earlier in 1836), to the design of Henry Roberts. The new house was built on the same site, but the ground-floor was raised on higher foundations and a terrace was created to the south and west. The principal entrance was moved to the east side, looking across the parkland. On the north side the hillside was cut back to create various service buildings. It is built of Flemish bond brick and appears yellow on the forward aspects but red to the rear and service buildings. The roof is of slate, with limestone ashlar chimney stacks. The building has two stories with basement and cellars, and is constructed on a square plan, being two rooms wide and two rooms deep. The entrance on the east side gives onto a hallway containing the main staircase. The house has multi-pane sash windows with limestone architraves. The building was designated grade II listed on 24 October 1988. In 1844 he constructed  bridges over the River Tale flowing through the estate, and erected several miles of fencing in the park. He took a great interest in gardening and in 1858 started to plant azaleas and rhododendrons.Channon, p.40 In 1860 part of the northern edge of the park was lost when used for the track of the new Exeter to Yeovil railway. In 1858 he built a glass-sided aquarium, made possibly by advances in the manufacture of strong glass."]}, {"page": "St Matthew's Church, Talbot Street", "response": ["It was a neat substantial structure in the Early English style, by the architect Henry Roberts, F.S.A., of London;.Allen’s Illustrated Guide to Nottingham. J. Potter Briscoe. 1888 It had narrow lancets, a broad tower, and a tall broach spire. At their western ends the aisles terminated in two low octagonal turrets. The construction cost was £5,645 (equivalent to £ in ),"]}, {"page": "Model dwellings company", "response": ["The first of these companies was formed out of the Labourer's Friend Society, which in 1844 agreed to change its name and purpose towards building houses for labourers that might be adopted by others as a template. Their first urban building project was completed in 1846 at Bagnigge Wells, Pentonville, designed by Henry Roberts."]}, {"page": "Labourer's Friend Society", "response": ["The Society received support from many influential figures of the time, including Montagu Burgoyne, Sir William Miles, Mary Ann Gilbert and Lord Ashley, who was the primary influence behind the transition of the Society into a more powerful body. The new Society had the patronage of Queen Victoria, the Prince Consort as president and Ashley as chairman. The company's architect was Henry Roberts, best known for Fishmongers' Hall in London."]}, {"page": "Metropolitan Association for Improving the Dwellings of the Industrious Classes", "response": ["The association was formed in 1841 by a group including Thomas Southwood Smith, George Howard, 7th Earl of Carlisle, Viscount Ebrington, Lord Haddo, Sir Ralph HowardSheppard, F.H.W. (1957) Mile End New Town, Survey of London: volume 27: Spitalfields and Mile End New Town, pp. 265-288. Date accessed: 1 April 2011 and Thomas Field Gibson and incorporated by Royal Charter in 1845. Its first project was the Metropolitan Buildings in Old Pancras Road, Kings Cross, which consisted of 21 two-room and 90 three-room flats in five-storey blocks. It was demonstrated as an archetype of model dwellings and was visited by the Prince Consort in 1848, as well as William Gladstone, Charles Kingsley, Lord Shaftesbury, Charles Dickens and the Duke of Wellington. The principal architect on many of these dwellings was Henry Roberts who pioneered many types of model dwelling, working also with the Society for Improving the Condition of the Labouring Classes."]}, {"page": "List of existing model dwellings", "response": ["This company was founded in Edinburgh in 1849 and built the earliest model dwellings (see colony houses) in Edinburgh. The work of the PMDC was an inspiration on Henry Roberts, who went on to become one of the most prolific architects of model housing.Roberts, H. (1861) Examples of Efforts in Scotland to Provide Improved Dwellings for the Working Classes. Transactions of the National Association for the Promotion of Social Science - p779ff"]}, {"page": "Camberwell Collegiate School", "response": ["The Collegiate School was situated on a two-acre site laid out as a pleasure ground and flower gardens, and housed in a purpose-built building constructed the previous year to the designs of Henry Roberts, who had also designed the Fishmongers' Hall."]}, {"page": "Streatham Street", "response": ["Parnell House was built in the 1850s by Henry Roberts. Originally constructed for Improving the Condition of the Labouring Classes. The building was designed to make slum living a thing of the past. Whereas whole families had lived together in one room, now they could enjoy a more spacious living space. The Streatham Street apartments were the first multi level domestic building in the world.  Subsequent buildings were erected by George Peabody and Streatham Street was taken over by the Peabody Trust and modernised in later years."]}, {"page": "River Hart", "response": ["The park was created in the 14th century. It was re-landscaped in 1591 for Edward Seymour, 1st Earl of Hertford to entertain Elizabeth I with four days of lavish festivities. Courtiers were offered a booklet describing the entertainment. In the 18th and early 19th centuries the park was extended and planting took place in some areas, while ornamental and formal gardens were added in the later 19th and early 20th centuries. The original Elvetham House burnt down in 1840, and was replaced by the grade II* listed Elvetham Hall built between 1859 and 1862 by Samuel Sanders Teulon. Additions were made to the building in 1901 and 1911–12, while the grounds include a Norman-style church building erected in 1840 by Henry Roberts. The river runs through the park, separating Elvetham Park to the south-east from New Park, to the north-west. A lake was constructed in 1871, to the north-east of the hall, but this had become overgrown with vegetation by the 1980s, and a weir and bypass channel were built, so that the river could be diverted around it to allow it to be dredged. Teulon also built a bridge over the river, with two segmental brick arches and wrought iron gates."]}, {"page": "Prince Albert's Model Cottage", "response": ["The model cottage was designed by Henry Roberts, who was honorary architect to the SICLC, and, like the Prince Consort, was interested in upgrading housing for the working class. The cottage demonstrated at the Great Exhibition was possibly conceived as a model for larger blocks of flats (designs for a three-storey version were prepared). It was designed to house four families, with two flats, or apartments, on each level. Roberts indicated that the design was aimed at “the class of mechanical and manufacturing operatives who usually reside in towns or in their immediate vicinity”. Each flat had a living room, with a built-in cupboard heated by the fireplace that was also \"well contrived equally to cook the family meals at midday and to warm the feet of the family group at eve\", a kitchen/scullery, three bedrooms and a toilet. Bathrooms were not usually provided in houses built in England at this time. Three bedrooms were included for the sake of \"decency\" so that children of different sex would not have to share a room."]}, {"page": "Henry Hill Vale", "response": ["Henry Hill Vale (1831–26 August 1875) was a British architect who was active in North West England in the late 19th century. He was born in Liverpool, Lancashire, into a Warwickshire family, and studied under the Liverpudlian architect Henry Roberts."]}]}}