{"wiki_id": "http://www.wikidata.org/entity/Q16030963", "itemLabel": "Tommy Barber", "itemDescription": "English football player (1886-1925)", "wikipedia_url": "https://en.wikipedia.org/wiki/Tommy_Barber", "wikipedia_page": {"main": "Thomas Barber (20 February 1888 – 18 September 1925) was an English professional footballer who played in the Football League for Aston Villa, Bolton Wanderers, Merthyr Town and Walsall as a half back or inside left. He scored the winning goal for Aston Villa in the 1913 FA Cup Final.", "link_mentions": [{"page": "1913 FA Cup Final", "response": ["The 1913 FA Cup Final was contested by Aston Villa and Sunderland on 19 April 1913 at London's Crystal Palace. Playing as the home side, Aston Villa won 1–0 on a goal by Tommy Barber on a crossed ball from Charlie Wallace. Wallace had earlier missed a penalty, something that would not occur again in an FA Cup final until the 1988 final between Wimbledon and Liverpool.", "||Tommy Barber"]}, {"page": "Charlie Wallace", "response": ["Wallace was the first player to miss a penalty kick in an FA Cup Final, when he missed the target from the spot in 1913 against Sunderland at London's Crystal Palace. A penalty kick miss would not occur again in FA Cup Final until 1988, when Liverpool player John Aldridge had his penalty saved by Wimbledon goalkeeper Dave Beasant. Villa still went on to win 1–0 in the 1913 FA Cup Final, despite Wallace's penalty miss. Villa's goal that day came from Tommy Barber courtesy of a Wallace assist from a corner kick. Wallace also played in Villa's 1920 FA Cup Final winning side."]}, {"page": "1912–13 FA Cup", "response": ["The Final was contested by Aston Villa and Sunderland on 19 April 1913 at London's Crystal Palace. Aston Villa won 1–0, with a goal by Tommy Barber assisted by a crossed ball from Charlie Wallace. Wallace had earlier missed a penalty, something that would not occur again in FA Cup Final, until the 1988 final between Wimbledon and Liverpool."]}, {"page": "Barber (surname)", "response": ["* Tommy Barber (1886–1925), English footballer"]}, {"page": "List of most expensive association football transfers", "response": ["| 1913 ||  Tommy Barber ||  Bolton Wanderers ||  Aston Villa ||  "]}, {"page": "Johnny Curley", "response": ["Curley made a third defence of the title in January 1927, losing a points decision to Cuthbert. He won seven of nine fights in the remainder of the year, and travelled to Australia in 1928, where he won all four of his fights, including a points win over Australian champion Tommy Barber. Back in England, he beat Auguste Gyde on points in July, but by the end of the year his fortunes dipped."]}, {"page": "1916–17 Brentford F.C. season", "response": ["|Tommy Barber", "| style=\"text-align:left;\" |Tommy Barber", "| Tommy Barber"]}, {"page": "1912–13 Aston Villa F.C. season", "response": ["Tommy Barber scored the winning goal for Aston Villa in the 1913 FA Cup Final."]}]}}