{"wiki_id": "http://www.wikidata.org/entity/Q16059504", "itemLabel": "John McNamara", "itemDescription": "Recipient of the Victoria Cross", "wikipedia_url": "https://en.wikipedia.org/wiki/John_McNamara_(VC)", "wikipedia_page": {"main": "John McNamara VC (28 October 1887 – 16 October 1918) was an English recipient of the Victoria Cross, the highest and most prestigious award for gallantry in the face of the enemy that can be awarded to British and Commonwealth forces.\nHe was 30 years old, and a corporal in the 9th Battalion, The East Surrey Regiment, British Army during the First World War when the following deed took place for which he was awarded the Victoria Cross.\nOn 3 September 1918 north west of Lens, France, when operating a telephone in evacuated enemy trenches occupied by his battalion, Corporal McNamara realised that a determined enemy counter-attack was gaining ground. Rushing to the nearest post, he made very good use of a revolver taken from a wounded officer and then, seizing a Lewis gun, he fired it until it jammed. By this time, he was alone in the post and, having destroyed the telephone, he joined the nearest post and maintained a Lewis gun until reinforcements arrived.He was killed in action near Solesmes, France, on 16 October 1918.In 2018 a plaque was unveiled in the John McNamara Gardens in the centre of Bamber Bridge, less than half a mile from where he was born. \nThree generations of his family, Politicians, soldiers and priests all stood in tribute to Cpl John McNamara, 100 years on from the courageous act which earned him South Ribble’s only Victoria Cross.", "link_mentions": [{"page": "Clandon Park House", "response": ["Colonel JW Sewell reached agreement with the National Trust to re-establish the Surrey Infantry Museum at Clandon House. The museum opened in 1981 with exhibits including uniforms, medals, weapons, regalia, photographs and memorabilia. The regiment's archives and library are located at the Surrey History Centre in Woking. After being upgraded in 2001, in July 2011 with part funding from the Heritage Lottery Fund the museum merged with those of the Princess of Wales's Royal Regiment and the Queen's Royal Surrey Regiment to become The Surrey Infantry Museum. The museum's displayed medal collection included six Victoria Crosses, including those awarded to: Lieutenant Wallace Duffield Wright; Lance Corporal Leonard James Keyworth; Corporal John McNamara; Second Lieutenant Arthur James Terence Fleming-Sandes. The museum, housed in the basement, was totally destroyed in the fire."]}, {"page": "John McNamara", "response": ["John McNamara or Macnamara may refer to:", "*John McNamara (Australian politician) (fl. 1850s), New South Wales politician", "*John McNamara, mayor of Rockford, Illinois (1981–89)", "*John McNamara (baseball) (1932–2020), American baseball manager", "*John McNamara (VC) (1887–1918), recipient of the Victoria Cross", "*John McNamara (artist) (born 1950), American artist", "*John McNamara (sportswriter) (1961/2–2018), sports reporter killed in the Capital Gazette shooting", "*John McNamara (writer) (born 1962), co-creator of Profit", "*John McNamara (fraudster) (fl. 1980s–1990s), Long-Island car dealer convicted of defrauding GMAC", "*John McNamara (actor) (1906–1968)"]}, {"page": "John McNamara (Victoria Cross)", "response": ["#redirect John McNamara (VC)"]}, {"page": "List of people named MacNamara", "response": ["* John McNamara (born 1950), an American artist", "* John McNamara (1936-2020), a baseball manager", "* John McNamara, a recipient of the Victoria Cross", "* John McNamara, co-creator of Profit (TV series)", "* John McNamara, one of the McNamara brothers who bombed the office of the Los Angeles Times in 1910"]}, {"page": "East Surrey Regiment", "response": ["* Corporal John McNamara, Great War"]}]}}