{"wiki_id": "http://www.wikidata.org/entity/Q16006571", "itemLabel": "Leo Gradwell", "itemDescription": "British sailor, barrister and magistrate (1899-1969)", "wikipedia_url": "https://en.wikipedia.org/wiki/Leo_Gradwell", "wikipedia_page": {"main": "Joseph Leo Anthony Gradwell DSC (28 July 1899 – 8 November 1969) was a British barrister, a magistrate and a Second World War Royal Navy volunteer, who in July 1942 against orders, led his own RN-adapted trawler HMS Ayrshire and three merchant ships from the disaster of Convoy PQ 17 into Arkhangelsk, Soviet Union.", "link_mentions": [{"page": "Chester", "response": ["* Leo Gradwell DSC (1899–1969), barrister and Arctic Convoys war hero"]}, {"page": "Convoy PQ 17", "response": ["On receiving the third order to scatter on 4 July 1942, RNVR T/Lt Leo Gradwell commanding the ASW adapted  Middlesbrough-built trawler HMS Ayrshire (FY 225), concluded that as he was heading north to the Arctic ice shelf, nothing prevented him from escorting merchantmen. Leading his convoy of Ayrshire and three US merchant vessels, the Panamanian-registered Troubador, Ironclad and Silver Sword, he proceeded north, using only a sextant and The Times World Geographic Pocket Book. On reaching the Arctic ice pack, the convoy stuck fast and so the ships stopped engines and then banked their fires. Gradwell arranged a defence, formulated around the fact that Troubador was carrying a cargo of bunkering coal and drums of white paint: the crews painted all the vessels white; covered decks with white linen; and arranged the Sherman tanks on the merchant vessels decks into a defensive formation, with loaded main guns. After a period of waiting and having evaded Luftwaffe reconnaissance aircraft, finding themselves unstuck, they proceeded to the Matochkin Strait. They were found there by a flotilla of corvettes, who escorted the four-ship convoy plus two other merchant vessels to the Russian port of Archangel, arriving on 25 July. Gradwell was awarded the Distinguished Service Cross on 15 September 1942."]}, {"page": "Last Exit to Brooklyn", "response": ["Sir Cyril Black, the then Conservative Member of Parliament for Wimbledon, initiated a private prosecution of the novel before Marlborough Street Magistrates' Court, under judge Leo Gradwell. The public prosecutor brought an action under Section 3 of the Obscene Publications Act. During the hearing the Chief Metropolitan Magistrate ordered that all copies of the book within the jurisdiction of the Magistrate's Court be seized. Not a single bookseller possessed a copy, but the publishing offices of Calder and Boyars, within the Bow Street Magistrate's jurisdiction, were discovered to be in possession of three copies. The books were duly seized, and Mrs. Boyars was summonsed to show cause why \"the said articles\" should not be forfeited.Forell, Claude. \"A Noble Crusader for Purity.\" The Age Literary Review,  March 25, 1967. Expert witnesses spoke, \"unprecedentedly,\"Newburn, Tim (1992). Permission and Regulation: Law and Morals in Post-War Britain.  London: Routledge, pp. 96–8. Google Books for the prosecution: they included the publishers Sir Basil Blackwell and Robert Maxwell. On the defense side were the scholars Al Alvarez II, and professor Frank Kermode, who had previously compared the work to Dickens. Others who provided rebuttal evidence included H. Montgomery Hyde.H. Montgomery Hyde,  Last Exit To Brooklyn, The Times, 6 December 1967"]}, {"page": "Gradwell", "response": ["*Leo Gradwell, a veteran of the disaster of Convoy PQ 17 and a British barrister and magistrate "]}]}}