{"wiki_id": "http://www.wikidata.org/entity/Q16003974", "itemLabel": "Charles Zachary Barnett", "itemDescription": "English writer of farce", "wikipedia_url": "https://en.wikipedia.org/wiki/Charles_Zachary_Barnett", "wikipedia_page": {"main": "Charles Zachary Barnett (c1813 – 1849) was an English librettist and playwright of Jewish descent notable for writing the libretti for two operas by his brother the composer John Barnett as well as for his early theatrical adaptations of the works of Charles Dickens. \nHe was the son of a Hungarian mother and Bernhard Beer, a Prussian Jew who changed his surname to Barnett on settling in England as a diamond merchant and jeweller. According to some he was a cousin of the composer Giacomo Meyerbeer. Charles Zachary Barnett was the younger brother of the composer John Barnett, for whom he wrote the libretti for two of his operas, Fair Rosamond (1837), in which he 'perversely reduced the story to the level of burlesque'; and Farinelli (1839). He also wrote several plays including early adaptations of the works of Charles Dickens, such as the three-act burletta Oliver Twist; Or, The Parish Boy's Progress, which opened at the Theatre Royal, Marylebone on 21 May 1838. It was only the second stage production of the work, as Dickens had not yet completed the novel. Barnett also wrote A Christmas Carol: Or, the Miser's Warning!, a two-act adaptation of A Christmas Carol first produced at the Surrey Theatre on 5 February 1844, just weeks after the publication of the novella.Other plays written by Barnett include The Banks of Allan Water, or the Death of Fair Eleanor (1831), performed at the Pavilion Theatre at Mile End; and a drama based on the Rothschilds - The Rise of the Rothschildes: Or, The Honest Jew of Frankfort (1838).  Other dramas from the pen of Barnett included The Drum of Fate or Sarah the Jewess (1838); The Minister's Dream or the Jew of Plymouth (1838); Linda; The Pearl of Savoy, adaptation of Rossi's libretto Linda di Chamounix; Victorine of Paris; Dominique, and Bohemians of Paris.", "link_mentions": [{"page": "John Barnett", "response": ["In 1834 he published a collection of Lyrical Illustrations of the Modern Poets. His opera The Mountain Sylph – with which his name is nowadays most associated – received a warm welcome when produced at the Lyceum on 25 August 1834, as the first modern English opera, and was given over 100 performances, which was an unusual success.  It was followed by Fair Rosamond in 1837, and Farinelli in 1839, to librettos by his younger brother Charles Zachary Barnett, but Barnett never again achieved the success that he had enjoyed with The Mountain Sylph.  Disappointed with his reception as a composer, Barnett retired to the country. He had a large connection as a singing-master at Cheltenham, and published Systems and Singing-masters (1842) and School for the Voice (1844). Barnett wrote several songs for the theatre with the actor, playwright and theatre manager John Baldwin Buckstone, and also some instrumental works, including three string quartets and a violin sonata."]}, {"page": "Oliver Twist", "response": ["*In 1838 Charles Zachary Barnett's adaptation, the three-act burletta Oliver Twist; or, The Parish Boy's Progress opened at the Marylebone Theatre in London .Theatres in Victorian London - Victorian Web"]}, {"page": "Adaptations of A Christmas Carol", "response": ["An early theatrical production was A Christmas Carol: Or, the Miser's Warning!, a two-act adaptation of A Christmas Carol by C. Z. Barnett, first produced at the Surrey Theatre on 5 February 1844, just weeks after the publication of the novella.Charles Zachary Barnett, Librettists: English Romantic Opera websiteThe Gentleman's Magazine, Vol. 31 (Jan.1849), p. 103A Christmas Carol, or, the Miser's Warning!, Project Gutenberg eBook"]}, {"page": "Farinelli (opera)", "response": ["Farinelli is an opera in two acts, described as 'serio-comic', by John Barnett, to a libretto by his brother Charles Zachary Barnett. Produced in 1839, it is the third of the composer's large-scale operas, and was the last to reach the stage. The hero is the castrato singer Farinelli, although the storyline of the opera is fictional."]}, {"page": "Fair Rosamond (opera)", "response": ["Fair Rosamond is an English historical opera in four acts composed by John Barnett, written in 1837 to a libretto by Charles Zachary Barnett, after the legend of Rosamund Clifford  (\"Fair Rosamond\" or the \"Rose of the World\"), the 12th century mistress of King Henry II who was said to have been poisoned by the King's wife, Queen Eleanor. In his opera, Barnett effects a happier ending."]}, {"page": "Theatre Royal, Marylebone", "response": ["Charles Zachary Barnett's early Dickens adaptation, the three-act burletta Oliver Twist; or, The Parish Boy's Progress, opened at the theatre on 21 May 1838.Theatres in Victorian London - Victorian WebPlaybill for The Royal Pavilion Theatre advertising Oliver Twist - British Library Collection It was only the second stage production of the work: Dickens had not yet completed the novel. Hyde left the Royal Marylebone Theatre on 1 September 1838. Morley, M. The Old Marylebone Theatre (1960), St Marylebone Society Publication"]}, {"page": "C. Z. Barnett", "response": ["#REDIRECTCharles Zachary Barnett"]}]}}