{"wiki_id": "http://www.wikidata.org/entity/Q16014417", "itemLabel": "Michael Kenny", "itemDescription": "British painter", "wikipedia_url": "https://en.wikipedia.org/wiki/Michael_Kenny_(sculptor)", "wikipedia_page": {"main": "Michael Kenny  (1941 – 28 December 1999) was a British artist. Best known as a sculptor, he also made important reliefs and drawings as well as sculptural constructions in wood and metal.\nHaving studied at Liverpool College of Art and then Slade School of Fine Art, Kenny taught at Slade 1970-1982 and at Goldsmiths School of Art 1983–88. He was made a Royal Academician in 1986 and completed many public commissions and exhibitions including retrospectives at Wilhelm-Lehmbruck Museum, Duisburg (1984), Hansard Gallery in Southampton (1990), and Dulwich Picture Gallery (1994) following a residency there from 1992 to 1993. He died on 28 December 1999. He is buried in Highgate cemetery in London.", "link_mentions": [{"page": "Limehouse Link tunnel", "response": ["The tunnel structures feature substantial works of public art. The western portal has Zadok Ben-David's circle of silhouettes, Restless Dream. The eastern portal has an untitled abstract by Nigel Hall. The eastern services building (Westferry Road) has artwork commissioned from UK artist and sculptor Michael Kenny (1941–1999), a relief work in Kilkenny limestone called On Strange And Distant Islands."]}, {"page": "Jules de Goede", "response": ["De Goede developed an interest in abstract art, and moved to London in 1965, taking a flat in Holborn and an art studio at the St Katharine Docks run by Bridget Riley and Peter Sedgeley. After a property developer bought the dock, he moved to a large minimalist studio in a former Jewish school in Stepney Green, east London, alongside the studios of Michael Kenny and Bert Irvin. The space taken by de Goede was formerly occupied by sculptor Hubert Dalwood. De Goede was an early pioneer of opening his studio to the public. He joined the London Group in 1996, when he was also a finalist for the Jerwood Prize. He was a founder member of the Movement for a Socialist Future (later merged into A World to Win) in 1999."]}, {"page": "Michael Kenny", "response": ["Michael Kenny may refer to:", "*Michael Kenny (boxer) (born 1964), New Zealand boxer", "*Michael Kenny (sculptor) (1941–1999), English sculptor", "*Michael Kenny (political scientist), professor of public policy at the University of Cambridge", "*Michael Kenny, character in Sister Kenny"]}, {"page": "City and Guilds of London Art School", "response": ["* Michael Kenny R.A. (Principal 1995–1999Guardian Obituary)"]}, {"page": "List of public art in the London Borough of Wandsworth", "response": ["List of sculptors: Adams, David Annesley, Kenneth Armitage, Michael Bolus, Brown, Antanas Braždys, Anthony Caro, Hubert Dalwood, Elisabeth Frink, George Fullard, David Hall, Barbara Hepworth, John Hoskin, Michael Kenny, King, Bryan Kneale, Kim Lim, F. E. McWilliam, Bernard Meadows, Henry Moore, Francis Morland, Eduardo Paolozzi, Pickett?, Scott?, Smith, William G. Tucker, Brian Wall"]}, {"page": "Simon Gales", "response": ["Gales's early metaphysical works incited him to be included in a number of largely conceptual exhibitions such as A Spiritual Dimension in 1989, a major touring exhibition organised by Peterborough Museum and Art Gallery along with former Goldsmiths tutors Brian Falconbridge, Michael Kenny and Carl Plackman and including Craigie Aitchison, Tess Jaray and Bob Law and supported by works from the Arts Council Collection as well as that of the Royal Academy. Due to the small scale of Gales's works at this time, he was invited again from 1991–1992 to show with Craigie Aitchison in another touring exhibition which was curated by Gillian Jason called Cabinet Paintings which also included Frank Auerbach, Howard Hodgkin, Euan Uglow and Sarah Raphael."]}, {"page": "Michael Kenny, RA", "response": ["#REDIRECT Michael Kenny (sculptor) "]}, {"page": "Michael Kenny (artist)", "response": ["#REDIRECTMichael Kenny (sculptor)"]}, {"page": "List of officers of the Royal Academy of Arts", "response": ["|Michael Kenny ||1 Oct 1995 – 28 Dec 1999"]}, {"page": "Documenta 6", "response": ["| Michael Kenny"]}]}}