{"wiki_id": "http://www.wikidata.org/entity/Q160770", "itemLabel": "Prince George, Duke of Kent", "itemDescription": "Royal Navy admiral (1902-1942)", "wikipedia_url": "https://en.wikipedia.org/wiki/Prince_George,_Duke_of_Kent", "wikipedia_page": {"main": "Prince George, Duke of Kent,  (George Edward Alexander Edmund; 20 December 1902 – 25 August 1942) was a member of the British royal family, the fourth son of King George V and Queen Mary. He was a younger brother of kings Edward VIII and George VI.\nPrince George served in the Royal Navy in the 1920s and then briefly as a civil servant. He became Duke of Kent in 1934. In the late 1930s he served as an RAF officer, initially as a staff officer at RAF Training Command and then, from July 1941, as a staff officer in the Welfare Section of the RAF Inspector General's Staff. He was killed in a military air-crash on 25 August 1942.", "link_mentions": [{"page": "August 25", "response": ["*1942 – Prince George, Duke of Kent (b. 1902)"]}, {"page": "December 20", "response": ["*1902 – Prince George, Duke of Kent (d. 1942)"]}, {"page": "1942", "response": ["** Dunbeath air crash: Prince George, Duke of Kent, brother to King George VI and King Edward VIII, is among 14 to die in a military aircraft accident at Morven, Scotland, at the age of 39.", "** Prince George, Duke of Kent, 4th eldest son of George V (b. 1902)"]}, {"page": "1902", "response": ["* December 20 – Prince George, Duke of Kent (d. 1942)"]}, {"page": "Westminster Abbey", "response": ["| 29 November 1934|| Prince George, Duke of Kent, son of King George V|| Princess Marina of Greece and Denmark"]}, {"page": "George VI", "response": ["King George V had severe reservations about Prince Edward, saying \"After I am dead, the boy will ruin himself in twelve months\" and \"I pray God that my eldest son will never marry and that nothing will come between Bertie and Lilibet and the throne.\"Ziegler, p. 199 On 20 January 1936, George V died and Edward ascended the throne as King Edward VIII. In the Vigil of the Princes, Prince Albert and his three brothers (the new king, Prince Henry, Duke of Gloucester, and Prince George, Duke of Kent) took a shift standing guard over their father's body as it lay in state, in a closed casket, in Westminster Hall."]}, {"page": "George V", "response": ["! rowspan=\"3\" scope=\"row\" | Prince George, Duke of Kent"]}, {"page": "Mary of Teck", "response": ["During the Second World War, George VI wished his mother to be evacuated from London. Although she was reluctant, she decided to live at Badminton House, Gloucestershire, with her niece, Mary Somerset, Duchess of Beaufort, the daughter of her brother Adolphus.Pope-Hennessy, p. 596 Her personal belongings were transported from London in seventy pieces of luggage. Her household, which comprised fifty-five servants, occupied most of the house, except for the Duke and Duchess's private suites, until after the war. The only people to complain about the arrangements were the royal servants, who found the house too small, though Queen Mary annoyed her niece by having the ancient ivy torn from the walls as she considered it unattractive and a hazard. From Badminton, in support of the war effort, she visited troops and factories and directed the gathering of scrap materials. She was known to offer lifts to soldiers she spotted on the roads.Pope-Hennessy, p. 600 In 1942, her youngest surviving son, Prince George, Duke of Kent, was killed in an air crash while on active service. Mary finally returned to Marlborough House in June 1945, after the war in Europe had resulted in the defeat of Nazi Germany.", "! rowspan=\"3\" scope=\"row\" | Prince George, Duke of Kent"]}, {"page": "Harry Hay", "response": ["In 1930 Hay enrolled at Stanford University to study international relations, taking independent study courses in English, history, and political science. There, he became increasingly interested in acting, and also wrote poetry, some of which was published in university magazines. He came to frequent the gay scene in both Los Angeles and San Francisco, attending parties where men danced with men, women danced with women, people cross-dressed, and alcohol was consumed, all of which was illegal. He had a number of sexual and romantic trysts with various men; one biographer asserts that these included a one-night stand with Prince George, Duke of Kent, and a brief affair with James Broughton. In 1931 he came out as gay to some people he knew at Stanford, and while he did not face any vehement backlash, some friends and associates, including a number who were gay, chose not to be seen with him from then on. A severe sinus infection led Hay to drop out in 1932 and he returned to his cousin's Nevada ranch to recuperate; he would never return to university."]}, {"page": "Abdication of Edward VIII", "response": ["At Fort Belvedere, on 10 December, Edward signed his written abdication notices, witnessed by his three younger brothers: Prince Albert, Duke of York (who succeeded Edward as George VI); Prince Henry, Duke of Gloucester; and Prince George, Duke of Kent. The following day, it was given effect by Act of Parliament: His Majesty's Declaration of Abdication Act 1936. Under changes introduced in 1931 by the Statute of Westminster, a single Crown for the entire empire had been replaced by multiple crowns, one for each Dominion, worn by a single monarch in an organisation then known as the British Commonwealth. Though the British government, hoping for expediency and to avoid embarrassment, wished the Dominions to accept the actions of the \"home\" government, the Dominions held that Edward's abdication required the consent of each Commonwealth state. Under the Statute of Westminster, the act passed by the UK parliament could become law in other Dominions at their request. This was duly given by the Parliament of Australia, which was at the time in session, and by the governments of Canada, South Africa, and New Zealand, whose parliaments were in recess. The government of the Irish Free State, taking the opportunity presented by the crisis and in a major step towards its eventual transition to a republic, passed an amendment to its constitution on 11 December to remove references to the Crown and abolish the office of Governor-General of the Irish Free State; the King's abdication was recognised a day later in the External Relations Act. In South Africa, His Majesty King Edward the Eighth's Abdication Act 1937 declared that the abdication took effect there on 10 December. Canada passed the Succession to the Throne Act 1937 to symbolically confirm the abdication."]}, {"page": "Mountbatten-Windsor", "response": ["Mountbatten-Windsor differs from the official name of the British royal family, which remains the House of Windsor. In accordance with law and custom in the English-speaking world, the surname Mountbatten-Windsor belongs to all male-line descendants of Queen Elizabeth II and Prince Philip, and is used by them if and when a surname is needed. In contrast, male-line descendants of King George V, the first monarch of the House of Windsor, use Windsor as their surname if and when a surname is needed.  The surviving male-line descendants are all descendants of the King's sons Prince Henry, Duke of Gloucester, and Prince George, Duke of Kent, because King George VI had only daughters (of whom only Queen Elizabeth II is alive) and no sons, and King George V's other two sons, King Edward VIII and Prince John, left no descendants.  After the House of Saxe-Coburg and Gotha was renamed Windsor, other descendants of Queen Victoria and Prince Albert could also use the name Windsor.  For example, Alastair Arthur Windsor, 2nd Duke of Connaught and Strathearn, was descended from Prince Arthur, Duke of Connaught and Strathearn, but none do today because the only surviving male-line descendants are the descendants of King George V and the descendants of Charles Edward, Duke of Saxe-Coburg and Gotha, whose descendants use the surname Saxe-Coburg and Gotha (English) or von Sachsen-Coburg und Gotha (German)."]}]}}