{"wiki_id": "http://www.wikidata.org/entity/Q16066416", "itemLabel": "Richard Preston", "itemDescription": "English legal author and politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Richard_Preston_(MP)", "wikipedia_page": {"main": "Richard Preston (1768–1850) was an English legal author and politician.\n\n", "link_mentions": [{"page": "Ashburton (UK Parliament constituency)", "response": ["| Richard Preston"]}, {"page": "John Burgess Karslake", "response": ["The son of Henry Karslake, a solicitor and Confidential Secretary to the Duke of Kent, by his wife Elizabeth Marsh Preston, the daughter of Richard Preston, Q.C. and sometime M.P. for Ashburton, he was educated at Harrow. His elder brother, Edward Kent Karslake (1820-1892), was a Q.C., sometime M.P. for Colchester and Fellow of Balliol College, Oxford."]}, {"page": "John Hodgkin (barrister)", "response": ["John Hodgkin became a pupil of George Harrison, a Quaker conveyancer, of the school of Richard Preston and Peter Bellinger Brodie. As a conveyancer Hodgkin was in the same tradition, which aimed at concision, at a time when legal documents were still often diffuse. He obtained a large practice, but was best known as a teacher of the law; his chambers had many pupils, with whom he read for an hour daily."]}, {"page": "Richard Preston (disambiguation)", "response": ["Richard Preston (born 1954) is an American writer.", "Richard Preston may also refer to:", "* Richard Preston (MP) (1768–1850), English legal author and politician", "* Richard Preston (clergyman) (c. 1791–1861), American religious leader", "* Richard Preston, 1st Earl of Desmond (died 1628), Scottish court favourite of King James VI", "* Richard Preston, a pen-name of Jack Lindsay (1900–1990) Australian-born British author"]}, {"page": "Manor of Alverdiscott", "response": ["Alverdiscott was the inheritance of his eldest son William Rowe.Records at the Devon Archives and Local Studies Service (South West Heritage Trust) show the conveyance by \"James Rowe of Great Torrington\" of lands at Bagdale and Fullerswood and his other property in Jamaica to his eldest son William in exchange for a payment of £500 p.a. to James Rowe and £50 p.a. to five of James Rowe's younger children identified as \"James Rowe the younger of St Elizabeth\" (in Jamaica), John Rowe of Great Torrington, Clerk, Charles Rowe of St Elizabeth, Judith Rowe and Mary Rowe of Great Torrington, spinsters. In 1800 the nephew of James Rowe sold the manor of Alverdiscott to Richard Preston, MP,\"MP\" per Lysons who still owned it in 1822,Lysons, Devonshire in which year Rev. John Rowe was Rector of Alverdiscott, and the son of his elder brother still resided in Jamaica.Lysons, General history: Families removed since 1620", "The manor was purchased shortly before 1810 by Richard Preston (1768–1850) of Lee House in the parish of Chulmleigh, Devon, a lawyer of the Inner Temple,History of Parliament biography; according to the 1810 Additions to Risdon, he was of Lincoln's Inn (Risdon, 1810 Additions, p.423) a leading authority on the law of real property and a Member of Parliament for Ashburton in Devon 1812-1818,P. A. Symonds / David R. Fisher, biography of PRESTON, Richard (1768-1850), of Lee House, Chulmleigh, Devon, published in History of Parliament: House of Commons 1790-1820, ed. R. Thorne, 1986 a pocket borough under the patronage of Robert Cotton St John Trefusis, 18th Baron Clinton (1787–1832) of Heanton Satchville, Petrockstowe in Devon.\"Ashburton | History of Parliament Online\". www.historyofparliamentonline.org.  He still owned the manor in 1822. He was the only son of Rev. John Preston of OkehamptonHistory of Parliament biography in Devon and in 1794 he married Catherine Marsh of Bideford, by whom he had 2 sons and 5 daughters. Having made a fortune from his legal career he \"invested heavily in Devonshire landed property\". He wrote in his will  dated 12 August 1836: \"the ample estate I have acquired has not been obtained without a devotion to my profession which has been rarely surpassed\". However, he went on to say that his fortune \"was far less than might have been expected from the income of 40 years disclosed in his fee books, but that he was better satisfied with the sacrifices he had made than to have oppressed a tenantry who in general are meritorious and have suffered by low prices\"."]}, {"page": "List of MPs elected in the 1812 United Kingdom general election", "response": ["| Richard Preston"]}]}}