{"wiki_id": "http://www.wikidata.org/entity/Q1606684", "itemLabel": "Henry Drummond Wolff", "itemDescription": "British diplomat and politician (1830-1908)", "wikipedia_url": "https://en.wikipedia.org/wiki/Henry_Drummond_Wolff", "wikipedia_page": {"main": "Sir Henry Drummond Charles Wolff  (12 October 1830 – 11 October 1908), known as Henry Drummond Wolff, was an English diplomat and Conservative Party politician, who started as a clerk in the Foreign Office.", "link_mentions": [{"page": "Lord Randolph Churchill", "response": ["In the new parliament of 1880 he speedily began to play a more notable role. Along with Henry Drummond Wolff, John Gorst and occasionally Arthur Balfour, he made himself known as the audacious opponent of the Liberal administration and the unsparing critic of the Conservative front bench. The \"fourth party\", as it was nicknamed, at first did little damage to the government, but awakened the opposition from its apathy; Churchill roused the Conservatives by leading resistance to Charles Bradlaugh, the member for Northampton, who as an avowed atheist or agnostic, was prepared to take the parliamentary oath only under protest. Stafford Northcote, the Conservative leader in the Lower House, was forced to take a strong line on this difficult question by the energy of the fourth party."]}, {"page": "Charles Bradlaugh", "response": ["Bradlaugh's letter was regarded as a direct provocation by his opponents, and when he came to the table, Sir Henry Drummond Wolff rose to object to the administration of the Oath to Bradlaugh. Speaker Brand allowed him to object, and Wolff argued that the Evidence Amendment Acts referred to by Bradlaugh only allowed an affirmation to one who regarded the oath as meaningless, so the House should not allow Bradlaugh to take it. Prime Minister William Gladstone, alerted to the fact that a protest was possible, moved to set up a second Select Committee to examine whether it was possible to interfere with a Member wishing to take the oath. Gladstone's amendment was carried by 289 to 214.Arnstein, p. 40-51; Hansard 3ser vol 252 cols 187–221, 333–422."]}, {"page": "Boscombe", "response": ["The scheme was not implemented; instead about  of land was obtained by Sir Henry Drummond Wolff, on part of which he built a house for himself named Boscombe Towers, in 1868, Sir Henry became closely associated with the development of Boscombe Spa for a considerable number of years. Wolff sought to develop 'Boscombe Spa' as a resort to rival Bournemouth and it was he who created the Boscombe Chine Gardens. In order to encourage the taking of the mineral water from the spring at the mouth of the Chine, a small thatched-roof building resembling a summer house was erected over the spring, and for a time this became a fashionable meeting place. The Chine itself was partially laid out and a broad pathway provided. A rustic bridge was constructed across the Chine."]}, {"page": "List of ambassadors of the United Kingdom to Spain", "response": ["|Henry Drummond Wolff"]}, {"page": "List of Privy Counsellors (1837–1901)", "response": ["*Sir Henry Drummond Wolff (1830–1908)"]}, {"page": "Edward Montagu-Stuart-Wortley", "response": ["In 1881 he acted as a Military Secretary to General Valentine Baker who at that time was in command of the Egyptian police and then, during the Anglo-Egyptian War, was Aide-de-Camp to Major General Sir Evelyn Wood. In 1884–85 he took part in the Nile Expedition to relieve General Gordon who was besieged in Khartoum and took part in the Abu Klea on 17 January 1885. In 1885 he accompanied Conservative politician Sir Henry Drummond Wolff to Constantinople as a military attaché. Later that year he was appointed as Deputy Assistant Adjutant General to Sir Francis Grenfell as he led his division at the Battle of Ginnis."]}, {"page": "Joseph Wolff", "response": ["A patron when he was a young man was the eccentric politician, Henry Drummond, a member of the Catholic Apostolic Church. Wolff named his son Henry Drummond Wolff; the boy grew up to be a noted diplomat and Conservative politician who founded the Primrose League."]}, {"page": "Imperial Bank of Persia", "response": ["Reuter was not to go down without a fight. However it was not until 1889 that he was able to get exclusive banking and mining rights for sixty years. Although this new concession was not as immense as the first one, it still granted him valuable control over Persian banking and mining with the energetic support of British minister, Henry Drummond Wolff.The English Amongst the Persians: Imperial Lives in Nineteenth-Century Iran, Denis Wright, pp 103.", "The bank's high level contact in Tehran was general Albert Houtum-Schindler who was, like Reuter, a British subject of German origin. Schindler lived in Persia for many years and was the most informed member of the European community in Persia at the time. Henry Drummond Wolff liked him so much that he tried unsuccessfully to persuade the foreign office to engage him as a member of Legation staff. Reuter employed him instead. Schindler and Rabino were instrumental in increasing the bank's reputation."]}, {"page": "Primrose League", "response": ["A small group had for some time discussed the means for obtaining the support of the people for Conservative principles. Sir Henry Drummond Wolff said to Lord Randolph Churchill, \"Let us found a primrose league\". A meeting was held at the Carlton Club shortly afterwards, consisting of Churchill, Wolff, Sir John Gorst, Percy Mitford, Colonel Fred Burnaby and some others, to whom were subsequently added Satchell Hopkins, J. B. Stone, Rowlands and some Birmingham supporters of Burnaby, who also wished to return Lord Randolph Churchill as a Conservative member for that city. These founding members assisted in remodelling the original statutes, first drawn up by Wolff. Wolff had for some years perceived the influence exercised in benefit societies by badges and titular appellations, and he endeavoured to devise some quaint phraseology that would be attractive to the working classes. The title of \"Knight Harbinger\" was taken from an office no longer existing in the Royal Household, and a regular gradation was instituted for the honorific titles and decorations assigned to members. This idea, though at first ridiculed, was greatly developed since the foundation of the order; and new distinctions and decorations were founded, also contributing to the attractions of the league."]}, {"page": "Henry Drummond-Wolff", "response": ["#REDIRECT Henry Drummond Wolff"]}, {"page": "H. D. Wolff", "response": ["#REDIRECT Henry Drummond Wolff"]}, {"page": "H. Drummond Wolff", "response": ["#REDIRECT Henry Drummond Wolff"]}, {"page": "Edward Linley Sambourne", "response": ["Henry Drummond Wolff,"]}, {"page": "Christchurch (UK Parliament constituency)", "response": ["| Sir Henry Drummond Wolff"]}, {"page": "Wolff", "response": ["* Henry Drummond Wolff (1830–1908), English diplomat"]}, {"page": "Fourth Party", "response": ["The Fourth Party was an informal  label given to four British MPs,  Lord Randolph Churchill, Henry Drummond Wolff, John Gorst and Arthur Balfour, who gained national attention by acting together in the 1880–1885 parliament. They attacked what they saw as the weakness of both the Liberal government and the Conservative opposition.  They were all backbench members of the Conservative Party. The Fourth Party seized upon the Bradlaugh affair, expressing time and again the outrage felt by many Conservatives for Gladstone allowing an avowed atheist to sit in Parliament. They had the support of two thirds of the Conservative MPsWalter L. Arnstein, Bradlaugh Case: Atheism, Sex and Politics Among the Late Victorians (1983)   The Fourth Party also vigorously assaulted Gladstone regarding the Irish Land Bill of 1881."]}, {"page": "List of British Jewish politicians", "response": ["*Henry Drummond Wolff (1874–1885) Conservative MP"]}, {"page": "Portsmouth (UK Parliament constituency)", "response": ["| Sir Henry Drummond Wolff"]}, {"page": "Kitabgi", "response": ["Antoine Kitabgi was born in 1843 in Constantinople to a modest Armenian Catholic family of Georgian origin.Sir Henry Drummond Wolff, Rambling Recollections, vol. II, MacMillan and Co, Ltd, 1908, p. 329Peter Frankopan, The Silk Roads: A New History of the World, Bloomsbury Publishing, 2005 () He was the second child and first son of a sibling group of six. His father, Vincent Kitabgi, was a supplier of gem-embellished water pipes to the sultan. Around the age of 14, Kitabgi was sent to Livorno, Italy, to complete his studies. There he learned Italian and French, which he spoke fluently in addition to Turkish and Armenian. His father being sick and unable to work, he returned to Constantinople in 1861 and was hired at the age of 18 at the Maritime Messenger Agency. In 1866, he was employed and later became a partner in the Armenian Ruben Hocozian cloth and drapery business and three years later founded his own cloth, drapery and carpet business. In 1870, he married Philomene Altounian, an Armenian Catholic woman whose parents came from the New Julfa district of Esfahan in Persia. Three boys, Vincent, Paul and Edward, were born in Constantinople from this union. Kitabgi's business prospered rapidly. He became the official supplier to the Sultan's tailor and began to diversify his business. He began selling arms, obtaining representation from major European firms and the position of arms supplier to the War Ministry. In 1874, in association with the Armenian Serkissian, he created a mechanical sawmill company in Bulgaria, then an Ottoman province.Patrick Kitabgi, Les Tribulations d'un Arménien de Constantinople, Paris, Editions du Bosphore, octobre 2018, 354 p. ()", "In April 1889, Nasseredin shah undertook his third trip to Europe. Kitabgi obtained from Amin al-Soltan to be part of the royal retinue. He was seventeenth on the official list of dignitaries accompanying the shah and, as such, occupied room 17 at Buckingham Palace during the shah's visit to Queen Victoria. During this trip, which lasted five months and during which Kitabgi was received in the European courts visited by the Shah - he was decorated with the Order of Leopold in Antwerp and the Order of Francis Joseph in Vienna - he made many acquaintances, including the British Major Gerald F. Talbot in London. It is probably there that the two men discussed for the first time the possibility for the Major to acquire the tobacco concession in Persia. It is also likely that Sir Henry Drummond Wolff, Minister Plenipotentiary of Great Britain in Tehran, and his secretary Sidney J.A. Churchill who were in London at the time of the Shah's visit were informed of the project by Kitabgi who wanted to ensure their support once the negotiations had begun by him in Tehran. The financial prospects for Kitabgi in the event of success were very advantageous.", "At the same time, Kitabgi having asked his friend Sir Henry Drummond Wolff to look for investors in Great Britain, the latter, through his nephew Lord Orford, made the acquaintance of William Knox D'Arcy,« D'ARCY, WILLIAM KNOX » [archive], in Encyclopedia Iranica a Briton who had made a fortune in gold mines in Australia. D'Arcy was interested in Iranian oil and Wolff introduced him to Kitabgi in February 1901. The two men signed an agreement. D'Arcy would provide the capital necessary for the operation while Kitabgi would take over the negotiations with Persia. Kitabgi would have 7% of the shares of the concession plus 10% at the issue, Cotte 3% of the shares and Wolff 10% of the profits.", "When the young Amin al-Soltan took office, relations between Kitabgi and his new leader were strained. Kitabgi found it difficult to bear being under the orders of a young man fifteen years his junior. But as they worked together, the two men learned to appreciate each other, Kitabgi recognizing Amin al-Soltan's intelligence and the latter appreciating Kitabgi's skills. Sir Henry Drummond Wolff wrote in his memoirs: \"The Amin-es-Sultan relied very much on a coadjutor of his - Kitabgi Khan - who was also of Georgian origin. He was a Roman Catholic, and married to an Armenian lady. The European element of the Persian Government was really represented by Kitabgi Khan, for he was well versed in Western matters - being able to draw up a concession and initiate commercial movements. He was the head of the Custom HouseSir Henry Drummond Wolff, Rambling Recollections, vol. II, MacMillan and Co, Ltd, 1908, p. 329\"."]}, {"page": "List of diplomats of the United Kingdom to Iran", "response": ["*1887–1891: Sir Henry Drummond Wolff"]}, {"page": "Drummond Wolff", "response": ["#REDIRECT Henry Drummond Wolff "]}, {"page": "Drummond-Wolff", "response": ["#REDIRECT Henry Drummond Wolff "]}, {"page": "H Drummond-Wolff", "response": ["#REDIRECT Henry Drummond Wolff"]}, {"page": "List of Conservative Party MPs (UK)", "response": ["*Henry Drummond Wolff"]}, {"page": "List of MPs elected in the 1880 United Kingdom general election", "response": ["| Sir Henry Drummond Wolff"]}, {"page": "The Owl (magazine)", "response": ["The Conservative MP Alexander Baillie-Cochrane, 1st Baron Lamington was joint editor of the paper from 1864 to 1868.ODNB Contributors included the architect Arthur Ashpitel (1807–69), Disraeli's private secretary Montagu Corry, Laurence Oliphant, and Henry Drummond Wolff. They also included Mortimer Collins,'Early Days of Mortimer Collins', Dublin University Magazine, 90 (1877), p. 340ff Lord Houghton, Ralph Bernal Osborne, George Otto Trevelyan, and Thomas Gibson Bowles.Reginald Lucas, 'Borthwick, Sir Algernon, first Baron Glenesk (1830–1908)', Dictionary of National Biography, 1912."]}, {"page": "List of MPs elected in the 1874 United Kingdom general election", "response": ["| Sir Henry Drummond Wolff"]}, {"page": "Bournemouth Rowing Club", "response": ["At the Annual Dinner of 1870 Cutler, the Captain of the Club referred to having two heavy Punts of unequal size and that racing was hardly practical even with a handicap. Sir Henry Drummond Wolff who was then the Parliamentary candidate for Christchurch and Bournemouth presented the club with a four oared racing galley called the Lothair, which was the title of a novel by the Earl of Beaconsfield. This gift set an example, followed for many years by the Parliamentary candidate, to present a racing galley to the local club. These boats were usually built by Picket or some other expert at Southampton, and though quite light, were designed for sea rowing and so much stouter than 'fine' boats used at river Regattas such as the Henley Royal Regatta."]}, {"page": "Henry Robert Kingscote", "response": ["*Howard (1845–1917; retired from the army as a colonel; married in 1885 writer Adeline Drummond Wolff, daughter of diplomat and politician Henry Drummond Wolff; their son Algernon Kingscote (1888–1964) was a notable tennis player)"]}, {"page": "Lucas Cleeve", "response": ["Adeline Georgiana Isabel Wolff was born in 1862. She was the only daughter of Henry Drummond Wolff, a diplomat and Conservative MP. Recorded in Who's Who as a traveller and linguist, she compiled a book of Indian folklore, Tales of the Sun, or, Folklore of Southern India, and a work entitled The English Baby in India and How to Rear it. However she was best known as a novelist."]}, {"page": "Henry Drummond Wolff (Basingstoke MP)", "response": ["Henry Maxence Cavendish Drummond Wolff (16 July 1899 – 8 February 1982), commonly known as Henry Drummond Wolff, was a British Conservative Party politician. Drummond Wolff was known for his close ties to the far right.", "Drummond Wolff was the grandson of Sir Henry Drummond Wolff, himself also a Conservative MP.Henry Drummond Wolff Drummond Wolff was married to the American socialite Margaret Fahnestock the daughter of investment banker Gibson Fahnestock and granddaughter of Harris C. Fahnestock whose sons were the founders of Fahnestock & Co.University of Leeds:Special Collections Archive:Henry M. C. Drummond Wolff"]}, {"page": "Mary Diana Dods", "response": ["Dods also lived under the male identity of a diplomat and scholar whom she named Walter Sholto Douglas, ostensibly the spouse of one Isabella Robinson and a friend of Mary Shelley. The marriage was concocted in part as a veil for Robinson's illegitimate pregnancy. When the child was born, Dods and Robinson named the little girl Adeline Douglas; when she married Henry Drummond Wolff in 1853, Adeline cited her late father as \"Walter Sholto Douglas\". Correspondence between Dods and Jane Williams in the mid-1820s suggests they too had close relations.Charlotte Gordon: Romantic Outlaws (New York/London: 2015), Chapter 35, notes 28–30. Retrieved 7 January 2017."]}]}}