{"wiki_id": "http://www.wikidata.org/entity/Q1608126", "itemLabel": "Herbert Chermside", "itemDescription": "British Army general", "wikipedia_url": "https://en.wikipedia.org/wiki/Herbert_Chermside", "wikipedia_page": {"main": "Lieutenant-General Sir Herbert Charles Chermside,  (31 July 1850 – 24 September 1929) was a British Army officer who served as Governor of Queensland from 1902 to 1904.", "link_mentions": [{"page": "Paul Reuter", "response": ["In 1845, Reuter married Ida Maria Magnus, daughter of Friedrich Martin Magnus, a German banker in Berlin.Paul Julius Freiherr von Reuter, Encyclopaedia Judaica, 2008, The Gale Group.Lüders, Carsten, \"Magnus, Friedrich Martin Freiherr von\" in: Neue Deutsche Biographie 15 (1987), S. 672. They had three sons: Herbert, who became the 2nd Baron (succeeded by his son Hubert as 3rd Baron), George and Alfred. The 2nd Baron (born 1852, died 1915) committed suicide 3 days after the death of his wife. He was succeeded by his son, Hubert. Clementine Maria, one of his daughters, married Count , and after Stenbock's death, Sir Herbert Chermside, a governor of Queensland."]}, {"page": "Governor of Queensland", "response": ["| rowspan=\"2\"| Sir Herbert Chermside"]}, {"page": "Chermside, Queensland", "response": ["In 1904 the district's name was changed to Chermside after the Governor of Queensland, Sir Herbert Chermside."]}, {"page": "Robert Philp", "response": ["Philp, with his genial nature, was ill-suited to the position of Opposition Leader, and showed little enthusiasm in attacking the new government. Morgan briefly lost control of the Legislative Assembly in 1904 and Philp was called upon by Governor Sir Herbert Chermside to form a ministry, but could not secure sufficient support from among his colleagues. The end result was a dissolution of Parliament and a solid defeat of the Opposition. Philp resumed his position as Leader and his conciliatory treatment of the government continued when fellow Scot William Kidston became Premier. Philp cultivated good relations with Kidston and helped foster the increasing gap between Kidston and the Labor movement."]}, {"page": "Warwick, Queensland", "response": ["The T J Byrnes Monument (a statue of the 12th Queensland Premier Thomas Joseph Byrnes) was built on the corner of Palmerin and Grafton Streets. The monument was built from 1901 to 1902 and was officially unveiled on Saturday 13 December 1902 by the Governor of Queensland, Sir Herbert Chermside. The unveiling of the monument was an important occasion for Warwick."]}, {"page": "Chermside", "response": ["*Herbert Chermside (1850–1929), British general and governor of Queensland, Australia"]}, {"page": "Sir Herbert Chermside", "response": ["#REDIRECT Herbert Chermside"]}, {"page": "Major-General Herbert Chermside", "response": ["#REDIRECT Herbert Chermside"]}, {"page": "Major General Herbert Chermside", "response": ["#REDIRECT Herbert Chermside"]}, {"page": "Herbert Charles Chermside", "response": ["#REDIRECT Herbert Chermside"]}, {"page": "William Frederick Webb", "response": ["* Geraldine Katharine Webb (1860), married Herbert Chermside."]}, {"page": "Chermside West, Queensland", "response": ["The name Chermside honours Queensland Governor, Sir Herbert Chermside."]}, {"page": "Major-General Sir Herbert Chermside", "response": ["#REDIRECT Herbert Chermside"]}, {"page": "1902 in Australia", "response": ["*Governor of Queensland – Major General Sir Herbert Chermside (from 24 March)"]}, {"page": "1903 in Australia", "response": ["*Governor of Queensland – Major General Sir Herbert Chermside"]}, {"page": "1904 in Australia", "response": ["*Governor of Queensland – Sir Herbert Chermside (until 10 October)"]}, {"page": "St Luke's Church of England, Brisbane", "response": ["The site was purchased in 1903 by the Church of England for a new mission church. Prior to this, the mission had rented rooms throughout Brisbane and St Luke's provided its first permanent home. On 3 February 1904 the foundation stone of St Luke's Church was laid by His Excellency, Sir Herbert Chermside, Governor of Queensland."]}, {"page": "Benjamin Leigh Smith", "response": ["For the 3rd expedition Leigh Smith chartered James Lamont's Arctic exploration vessel Diana (crew of 17) and used Sampson (crew of 13) as a reserve supply tender. It was joined by Herbert Chermside, who was in charge of logkeeping, and naturalist Alfred Edwin Eaton. The objective was to venture beyond the northeast edge of Svalbard and also to search for Nordenskiöld's expedition which had not yet returned. On 13 June, Diana learned from a Norwegian fishing vessel at Danes Island that Nordenskiöld's expedition had been frozen in at Mosselbukta and  was starving. Leigh Smith reached the 3 beset ships on the same day and aided them with his provisions. For this act of salvation he later received the Swedish Royal Order of the Polar Star. The expedition undertook some exploring, but did not succeed in reaching much further than previously."]}]}}