{"wiki_id": "http://www.wikidata.org/entity/Q16031281", "itemLabel": "Jonathan Rashleigh", "itemDescription": "English cricketer (1820-1905)", "wikipedia_url": "https://en.wikipedia.org/wiki/Jonathan_Rashleigh_(cricketer)", "wikipedia_page": {"main": "Jonathan Rashleigh (7 January 1820 – 12 April 1905) was an English cricketer active in the early 1840s, making four appearances in first-class cricket. Born at Wilsford, Wiltshire, Rashleigh was educated at Harrow School, for whom he played cricket, and at Balliol College, Oxford, matriculating 1839 and graduating 1842 on B.A.Rashleigh's batting and bowling styles are unknown. He made his debut in first-class cricket in 1841 for Oxford University against the Marylebone Cricket Club (MCC) at the Magdalen Ground, Oxford. He made three further first-class appearances for the university in 1842, playing twice against the MCC and once in The University Match against Oxford University at Lord's. He scored a total of 42 runs with a high score of 20, while with the ball he took two wickets.A member of the prominent Rashleigh family, Rashleigh was listed in 1873 as the largest landowner in Cornwall with an estate of 30,156 acres (122.04 km2) or 3.97% of the total area of Cornwall. He was a Deputy Lieutenant of Cornwall. He died at the Menabilly Estate on 12 April 1905.", "link_mentions": [{"page": "Rashleigh family", "response": [";Jonathan Rashleigh (1591–1675)", "Jonathan Rashleigh (4 July 1591 – 1 May 1675), was an English merchant and politician who sat in the House of Commons at various times between 1614 and 1675. He supported the Royalist cause during the English Civil War. Jonathan was also responsible for completing the construction of the family home of Menabilly.", "John Rashleigh (21 January 1619 – 13 March 1693) was an English politician who sat in the House of Commons from 1661 to 1679. He was the son of Jonathan Rashleigh and the grandson of John Rashleigh (the merchant and MP).", ";Jonathan Rashleigh (1642–1702)", "This Jonathan Rashleigh (see painting to the right) was also based in Menabilly and was the Sheriff of Cornwall in 1687. He was the grandson of Jonathan Rashleigh the merchant and House of Commons politician.", "In the Return of Owners of Land, 1873 Mr Jonathan Rashleigh of Menabilly Estate, Par, was listed as the largest landowner in Cornwall with an estate of , or 3.97% of the total area of Cornwall. The estate contains pleasure grounds and a large country house which was Daphne du Maurier's inspiration for the house Manderley in her novel Rebecca."]}, {"page": "List of Old Harrovians", "response": ["*Jonathan Rashleigh (1820–1905), English first-class cricketer, brother of the aboveWisden Cricketer's Almanack, \"Obituaries in 1905\""]}, {"page": "Menabilly", "response": ["It has been the seat of the Rashleigh family from the 16th century to the present day. The mansion house, which received a Grade II* listing on 13 March 1951, is early Georgian in style, having been re-built on the site of an earlier Elizabethan house, parts of which were possibly incorporated into the present structure.  The  house is surrounded by woodland and nearby is the farmhouse Menabilly Barton.Menabilly Barton situated at  In the Return of Owners of Land, 1873 Jonathan Rashleigh of Menabilly, Par, was listed as the largest landowner in Cornwall with an estate of  or almost 4% of the total area of Cornwall.Who Owns Britain - by Kevin Cahill", "The Rashleigh family of Menabilly originated as powerful merchants in the 16th century. In 1545 Philip Rashleigh (died 1551), a younger son of the Rashleigh family of Barnstaple in Devon, who had become wealthy through trade, purchased the manor of Trenant near Fowey from the King after the Dissolution of the Monasteries.  His two sons Robert and John founded the Rashleigh family of Fowey. The land on which Menabilly was built has been owned by the Rashleigh family since the 1560s. In 1589 the building of the first house at Menabilly was commenced by John Rashleigh (1554–1624), shipowner, MP for Fowey in 1589 and 1597, Sheriff of Cornwall 1608-9, who captained his own ship Francis of Foy against the Spanish Armada in 1588. The house was  completed in 1624 by his son Jonathan Rashleigh (1591–1675), five times MP for Fowey and a Royalist during the Civil War. It was re-built between 1710 and 1715 by Jonathan Rashleigh III (1693–1764).", "Jonathan Rashleigh (1820–1905), the cricketer, improved and extended the gardens and grounds and  planted many trees including pine, cedar, eucalyptus and beech. He also planted rhododendron, bamboo and hydrangea.", "===Jonathan Rashleigh I (1591–1675)===", "Jonathan Rashleigh I (1591–1675), second son and heir, his elder brother John Rashleigh (1582-May 1624), presumed insane, having died one month after their father, who left instructions in his will for his care to his second son, executor and heir Jonathan: \"keep and maintain his brother John, allowing him a chamber, meat, drink, apparel and all other necessities and a servant continually to attend him\".", "Jonathan was elected  MP for Fowey in 1614, 1621 and 1625, and retained his seat until the start of the Civil War of 1641-1651 during which Menabilly was ransacked of livestock, furniture and stores. After the execution of King Charles I Jonathan was imprisoned at St Mawes Castle and his estate became bankrupt from the war and parliamentarian taxes. Jonathan's son John Rashleigh (1621–1651), MP for Fowey in 1661, pre-deceased his father, having married Joan Pollexfen and produced male issue, and thus after Jonathan's death in 1675 his heir was his grandson Jonathan Rashleigh (1642–1702)", "===Jonathan Rashleigh II (1642–1702)===", "Jonathan Rashleigh (1642–1702), grandson, Sheriff of Cornwall in 1686/7, and several times MP for Fowey, of whom a portrait exists at Antony House, Torpoint, Cornwall, the  home of his second wife Jane Carew, daughter of Sir John Carew, 3rd Baronet  (1635–1692) of Antony.  After his death in 1702 the estate was inherited by his eldest son by his second wife Jane Carew, Philip II Rashleigh (1689–1736)", "Philip Rashleigh II (1689–1736) was the eldest son and heir of Jonathan Rashleigh (1642–1702) by his second wife Jane Carew. He served as MP for Liskeard 1710-1722. He rebuilt Menabilly circa 1710–15. He was a supporter of the Jacobite Pretender. He died in 1736 without progeny.", "=== Jonathan Rashleigh III (1693–1764) ===", "Jonathan Rashleigh III (1693–1764), younger brother. He was the fourth son of Jonathan Rashleigh II (1642–1702), by his second wife Jane Carew. He served as MP for Fowey. He married in 1728 Mary Clayton, daughter of Sir William Clayton, 1st Baronet, of Marden Park in Surrey, MP for Bletchingley. His fourth son John Rashleigh (1742–1803) of Penquite, Cornwall, was the father of Sir John Colman Rashleigh, 1st Baronet (1772–1847) of Prideaux, Cornwall.  He was a co-heir (together with his sister's grandson Reginald Pole-Carew (died 1835), whose share included Antony) of his half first cousin Sir Coventry Carew, 6th Baronet (c. 1716 – 1748) of Antony, from whom he inherited several estates including East Antony, Manely Durnford,  Langunnet, Little Deviock, Sheviock, Nancolleth, Pensignance, Penventon, Helsett, Drewsteignton and", "William Rashleigh II (1817–1871), eldest son by second marriage, JP, DL and MP for East Cornwall 1841–47. He travelled in the Middle East and whilst in Egypt he met a sheikh in Cairo who on hearing the name  Rashleigh asked if he knew Philip Rashleigh and told him that many years before as a prisoner of war in England Philip had invited him to Menabilly many times. In 1843 he married Hon. Catherine Stuart (died 1872), eldest daughter of the Scottish peer Robert Walter Stuart, 11th Lord Blantyre (1777–1830). He left no male progeny and was succeeded by his brother Jonathan Rashleigh (1820–1905)", "=== Jonathan Rashleigh IV (1820–1905) ===", "thumb|Evelyn William Rashleigh (1850–1926), of Stoketon, Saltash, Cornwall, younger son of Jonathan Rashleigh (1820–1905) of Menabilly.)  Royal Cornwall Museum, Truro", "Jonathan Rashleigh IV (1820–1905), brother of William Rashleigh (1817-1871), of Menabilly, Feniton Court in Devon, and Lissadrone, County Mayo, Ireland, the latter were the lands that were absorbed after his second marriage to Jane Elizabeth Pugh (1836-1902), daughter of Arthur Pugh, of Lissadrone, Co.Mayo.Bell’s Weekly Messenger, Saturday, 7 August 1869", "Rashleigh’s first wife died in 1852, leaving him a youthful widower with five small children: Caroline Mary Stuart (Rashleigh) Long, Jonathan Rashleigh, Alice Henrietta Rashleigh, Evelyn William Rashleigh and Mary Anna Rashleigh, during much of his middle life. He occupied some of his time during this period by serving as a member of the Metropolitan Board of Works, on which he represented the St.Pancras district, and as a member of the Metropolitan Asylums Board, including being Chairman of Cornwall County Lunatic Asylum Committee for twelve years 1873-1885.", "On 3rd of August 1869, Jonathan Rashleigh married an Irish heiress, Jane Elizabeth Pugh (1836-1902), the only daughter of Arthur Pugh, of Lissadrone, Co.Mayo. by whom he had four further children: Eleanor Elizabeth (Rashleigh) Tremayne, Arthur Rashleigh, Kathleen Rashleigh and  Rachel Jane Rashleigh. After his second marriage, Jonathan Rashleigh (1820-1905) together with his second wife and three children from the first marriage: Alice Henrietta Rashleigh, Evelyn William Rashleigh and Mary Anna Rashleigh, had moved in to his marital home - Fortfield House, Sidmouth, Devon. In 1871, he purchased the \"Feniton Court Estate not very many miles away in East Devon\".BNS Research Blog, by Hugh Pagan, 1 October 2019", "Jonathan Rashleigh (1820-1905) was a JP for Middlesex and Westminster, in 1856, JP and DL for Cornwall, in 1872,  High Sheriff of Cornwall in 1877, and Chairman of Cornwall County Lunatic Asylum Committee in 1873-1885 . He was a collector of medals, tokens, tickets and classical Greek and Roman coins.Antiquarian catalogue  Rashleigh was elected a member of the Numismatic Society of London on 23 March 1848 and was to remain associated with it and with its successor body, the Royal Numismatic Society, until his death on 12 April 1905.BNS Research Blog, by Hugh Pagan, 1 October 2019", "The eldest son of J. Rashleigh (1820-1905) - Jonathan Rashleigh (1845–1872) was educated in Harrow and at Christ Church, Oxford (BA), 1869, student of the Inner Temple, 1868. 'At Harrow he distinguished himself in mathematics.Royal Cornwall Gazette, 21 December 1872", "On 8th of November 1870 Jonathan Rashleigh jun. married Mary Frances Labouchere (1848-1874), the youngest daughter of an English banker, John Peter Labouchere of Broome Hall, Surrey (1798–1863), and niece of Henry Labouchere, 1st Baron Taunton.Royal Cornwall Gazette, 12 November 1870", "On 2 July 1872, Mary Frances (Labouchere) Rashleigh gave birth to a son - John Cosmo Stuart Rashleigh (1872 -1961) who was to become the heir to his grandfather, as his father, Jonathan Rashleigh jun. (1845-1872) died on 8th December 1872, pre-diseasing his father, Jonathan Rashleigh (1820-1905), of Menabilly."]}, {"page": "List of English cricketers (1841–1850)", "response": ["|Jonathan Rashleigh"]}, {"page": "Jonathan Rashleigh", "response": ["Jonathan Rashleigh may refer to:", "* Jonathan Rashleigh (1591–1675), English politician, for Fowey in 1614, 1621, 1625, April 1640 and November 1640, and 1661", "* Jonathan Rashleigh (1642–1702), English politician, MP for Fowey 1675-81 and 1689-95", "* Jonathan Rashleigh (1693–1764), English politician, MP for Fowey 1727–64", "* Jonathan Rashleigh (cricketer) (1820–1905), English cricketer"]}]}}