{"wiki_id": "http://www.wikidata.org/entity/Q16013177", "itemLabel": "Percy Corrall", "itemDescription": "cricketer (1906-1994)", "wikipedia_url": "https://en.wikipedia.org/wiki/Percy_Corrall", "wikipedia_page": {"main": "Percy \"Paddy\" Corrall (16 July 1906 – 23 February 1994) was an English first-class cricketer who played for Leicestershire between 1930 and 1951. He was born and died in Leicester, Leicestershire.\nCorrall was a lower-order right-handed batsman and wicketkeeper and, at five feet two inches (1.57 m), one of the smallest first-class cricketers. Having played for the second eleven since 1927, he made his first-class debut for Leicestershire in a single game in the 1930 season, against Cambridge University, in which he failed to make a dismissal. He returned to second eleven cricket for 1931 but at the end of that season Tom Sidwell, who had been the regular first-team wicketkeeper since before the First World War, retired. Corrall took over as the wicketkeeper in the 1932 season and played in every Leicestershire first-class match that season, making 39 catches and 11 stumpings and batting at No 10 or No 11.Corrall was again Leicestershire's first-choice wicketkeeper in 1933, but in the match against Lancashire at Leicester in early July he met with what Wisden Cricketers' Almanack termed \"an unfortunate accident\". Wisden wrote: \"Washbrook swung his bat at a high ball from Astill and struck the wicketkeeper on the left ear. He was removed to hospital in a semi-unconscious condition, and remained so ill that he did not play again during the summer.\" In its broader report on Leicestershire's 1933 season, Wisden wrote: \"A serious accident in the match with Lancashire at Leicester overtook Corrall, the young wicketkeeper, and for weeks he was in hospital on the danger list. As it happened, the loss of Corrall, far from weakening the eleven, brought forth some increased strength in batting, for Sidwell, after spending a year in retirement, returned to first-class cricket with marked success.\" Later reports identified Corrall's injury as a fractured skull.Fit again, Corrall returned to the Leicestershire side in 1934 and was then the regular wicketkeeper again until he was once more injured in 1937. Never much more than a tail-ender as a batsman, he made his only career score of more than 50 when acting as nightwatchman in the match against Sussex at Hove in 1934, with an innings of 64. In exactly the same fixture in 1936, he set a first-class record for a Leicestershire wicketkeeper that still stands, as of 2013, in making 10 dismissals, with seven caught and three stumped. In 1937, Corrall was injured twice and Leicestershire turned to George Dawkes, not yet 17 in his first matches, as replacement wicketkeeper, and in 1938 and 1939 Dawkes took over as the first choice, and Corrall did not play at all.\nDuring his military service in the Second World War, Corrall was stationed in India, where he played in two first-class matches in late 1944, one of them for the Europeans in the Bombay Pentagular Tournament.When first-class county cricket resumed in 1946, Dawkes was still serving with the Royal Air Force, so Corrall was recalled as Leicestershire wicketkeeper and had his most successful season so far, with 65 dismissals. Dawkes had still not been demobilised by the start of the 1947, so Corrall retained his place and when Dawkes was finally available late in the season, he joined Derbyshire rather than returning to Leicestershire. Corrall played through to the end of the 1950 season as Leicestershire's regular wicketkeeper, and in 1948 he was (jointly with Eric Meads, the Nottinghamshire player) the leading wicketkeeper in England with 74 dismissals, 34 of them stumpings. His high proportion of stumpings in the latter part of his career reflected the Leicestershire bowling attack's dependence on the spin of Jack Walsh and Vic Jackson. Corrall was awarded a benefit match in 1949 and retired at the end of the 1950 season, though he returned for a single match in 1951.\nCorrall went on to the first-class umpires list for the 1952 season and stayed there for six seasons, returning for occasional matches in the following two seasons. Later, although a lifelong teetotaller, he ran a pub.", "link_mentions": [{"page": "Leicestershire County Cricket Club", "response": ["*Most dismissals in a match: 10 by Percy Corrall v. Sussex, Hove, 1936"]}, {"page": "George Dawkes", "response": ["Dawkes was born at Leicester and made his debut for Leicestershire in the 1937 season at the age of 16. According to Wisden Cricketers' Almanack, he \"was claimed to be the youngest wicket-keeper ever to take part in county cricket\". He played in 11 matches in the 1937 season as replacement for the injury-prone main wicketkeeper, Percy Corrall, taking 13 catches and making four stumpings. For a player who later earned a reputation as a solid lower-order batsman, his batting record was singular: in 17 innings, he made 53 runs, and never once reached double figures."]}, {"page": "1947 English cricket season", "response": ["Leicestershire had fourteen defeats and finished fourteenth. In Les Berry, they had the only professional captain in the County Championship. In July, they were involved in two exciting finishes, first when Middlesex were set to score 66 in 25 minutes and got them, courtesy of Edrich and Compton, to win by ten wickets with only four minutes to spare. Second, in their home match against Derbyshire, Leicestershire themselves succeeded in a run chase scoring 391 to win by three wickets at over eighty runs an hour, the winning run coming from a straight six off the third ball of the final over. Leicestershire were a strong batting side with Berry, Vic Jackson, Gerry Lester, Francis Prentice, Maurice Tompkin and George Watson all exceeding 1,000 runs while all-rounder Anthony Riddington scored over 800. Wicketkeeper Percy Corrall claimed 59 victims in championship matches. The main bowler was Jack Walsh, a great exponent of slow left-arm wrist-spin, who took 152 wickets in all matches. Jackson and the veteran James Sperry bowled well but Leicestershire's main need was a good pace bowler. Other players were Thomas Chapman, Jack Howard and Harry Pickering.Playfair, pp. 106–107."]}, {"page": "Tom Sidwell", "response": ["Though he never made an international appearance, Sidwell played for the Rest of England and the North of England in 1922 and 1923 respectively, and appeared in a first-class England XI in 1929. He enjoyed a benefit season with his club in 1926, where he played 28 matches, scoring 892 runs at 22.30 (with his only other century), taking 36 and performing nine stumpings. Two years later in 1928 he hit 1,153 runs – a career best – including the two centuries and five half-centuries. He retired after the 1931 season, but reappeared in 1933 when Percy Corrall, his replacement as Leicestershire wicketkeeper, was injured, making 13 appearances. Between 1914 and 1931 he only missed six matches. He went on to play club cricket until 1957."]}, {"page": "Paddy Corrall", "response": ["#REDIRECTPercy Corrall"]}, {"page": "History of English cricket from 1919 to 1939", "response": ["Among their better players were the wicket-keepers Tom Sidwell and Percy Corrall; batsmen Norman Armstrong, Les Berry and Eddie Dawson; and bowlers Ewart Astill, George Geary and Haydon Smith."]}, {"page": "Corrall", "response": ["*Percy Corrall (1906–1994), English cricketer"]}]}}