{"wiki_id": "http://www.wikidata.org/entity/Q16066203", "itemLabel": "Michael Williams", "itemDescription": "British politician, born 1784", "wikipedia_url": "https://en.wikipedia.org/wiki/Michael_Williams_(MP)", "wikipedia_page": {"main": "Michael Williams (3 June 1785 – 15 June 1858) was a mining entrepreneur and politician, the MP for West Cornwall from 19 July 1853 until his death in June 1858.He was the second son of John Williams \"the Third\" (23 September 1753 – 17 April 1841), the Cornish industrialist, of the Williams family. He bought Caerhays Castle.On 5 March 1813, he married Elizabeth Eales (d. 1852).", "link_mentions": [{"page": "Michael Williams", "response": ["Michael Williams or Micheal Williams may refer to:", "* Michael Williams (author) (born 1952), known for his Dragonlance novels", "* Michael Williams (Henry V), a character in William Shakespeare's Henry V", "* Michael Williams (Neighbours), a character from the soap opera Neighbours", "* Michael Williams (guitarist), American blues guitarist", "* Michael Williams II (born 1989), American record producer known professionally as Mike Will Made It", "* Michael Williams (MP) (1785–1858), MP for West Cornwall and owner of Caerhays castle", "* Michael Williams, Baron Williams of Baglan (1949–2017), British diplomat and United Nations Special Coordinator for Lebanon", "* Michael Williams (Georgia politician) (born 1973), Republican member of the Georgia State Senate", "* Michael Williams (running back) (born 1961), American football player", "* Michael Williams (defensive back) (born 1970), American football player", "* Michael Williams (tight end) (born 1990), American football offensive lineman", "* Michael Williams (defensive lineman) (born 1984), professional Canadian and Arena football defensive end", "* Michael Williams (figure skater) (born 1947), British ice skater", "* Michael Williams (boxer) (born 1962), former heavyweight boxing prospect and actor", "* H. Michael Williams, American athletic director", "* Michael Williams (athlete) (born 1964), Vincentian sprinter", "* Michael Williams (footballer) (born 1988), Montserattian footballer", "* Michael Williams (actor) (1935–2001), British actor and husband of Judi Dench", "* Michael Williams (film producer) (born 1957), 2004 Academy Award winner for the documentary The Fog of War", "* Michael Williams (film director) (born 1987), American film director", "* Michael Williams (Canadian TV personality), former MuchMusic VJ", "* Michael Williams (geographer) (1935–2009), Welsh historical geographer", "* Michael Williams (philosopher) (born 1947), professor of philosophy at Johns Hopkins University", "* Michael Williams, academic in Indigenous Australian studies whose historical framework influenced Wesley Enoch's play The 7 Stages of Grieving", "* Michael Williams, defendant in United States v. Williams (2008)", "* Jerry Michael Williams (1969–2000), American murder victim"]}, {"page": "West Cornwall (UK Parliament constituency)", "response": ["|rowspan=\"2\"| Michael Williams || rowspan=\"2\"| Whig"]}, {"page": "Williams family of Caerhays, Burncoose and Scorrier", "response": ["* Michael Williams (1730–1775), son of John the First married Susanna, daughter of Henry Harris of Cusgarne, Cornwall, by his wife Elizabeth, daughter of William Beauchamp (1670–1729) of Pengreep, Cornwall. He lived at Burncoose and was the father of,", "* John Williams the Third (23 September 1753 – 17 April 1841), son of Michael Williams (1730–1775), controlled the Gwennap copperbelt and copper smelting works in Swansea. Also owned tin-smelting works, sulphur mines and quarries. He was a Director of The Cornish Bank. With the Fox family of Falmouth, built the Plymouth breakwater and developed the harbour at Portreath and linked it by the Portreath tramway to his mine at Poldice. Purchased land at Scorrier and built Scorrier House there. Married Catherine Harvey in 1776. Received a dream warning of the assassination of the Prime Minister in 1812, \"correct in every detail\".The Times, Saturday, 16 August 1828; pg. 2; Issue 13673; col F \"Remarkable Coincidence\".", "* Michael Williams, MP for the Western Division of Cornwall from 1853 to 1858. Son of John the Third. High Sheriff of Glamorgan in 1840, Deputy Lieutenant of Cornwall and Deputy-Warden of the Stannaries. Bought Caerhays Estate in 1853.", "* John Michael Williams (25 December 1813 – 16 February 1880), married Elizabeth Maria Davey (d. 24 May 1884), daughter of Stephen Davey of Redruth and Bochym, on 24 February 1852.Burke's A Genealogical and Heraldic Dictionary of the Landed Gentry of Great Britain (1863) \"Williams of Burncoose and Caerhays Castle\" article, provided by Google Books. He was High Sheriff of Cornwall in 1865.", "* Michael Williams, eldest son of John Michael Williams (1813–1880) who bequeath for life Gnaton Hall estate, Devon and the rest of his estates in Devon, and all his estates in the town and parish of Calstock.", "* John Charles Williams (30 September 1861 – 29 March 1939), second son of John Michael Williams and Elizabeth Davey, his wife. MP for the Truro Division of Cornwall, 1892–1895, High Sheriff of Cornwall 1888, Lord Lieutenant of Cornwall 1918–1936.Who was Who", "* Charlotte Williams, daughter of John Michael Williams, married Edward Powys Rogers. They moved to \"Burncoose\" in 1916.Burncoose gardens a guidebook with a historical introduction by F.J.Williams (n.d, purchased at Burncoose 24 February 2008)"]}, {"page": "Richard Davey (MP)", "response": ["Along with Michael Williams, also a Whig, they were elected without opposition on 2 April 1857; John Tremayne, the Conservative candidate, having stood down. In 1859, the Whigs joined the new Liberal Party. He was re-elected for this seat until 1868."]}, {"page": "List of MPs elected in the 1857 United Kingdom general election", "response": ["|rowspan=\"2\"|West Cornwall(two members)||Michael Williams||Liberal"]}, {"page": "Caerhays Castle", "response": ["After Bettesworth-Trevanion left for Paris, unable to pay his bills, Michael Williams II purchased Caerhays from his creditors in 1854.  As the house had been unoccupied for over a decade and had not been watertight for some of that time, his younger brother Sir William Williams, 1st Baronet, of Tregullow (1791–1870), with his son John Michael Williams (1813–1880), JP, DL, initiated an extensive repair programme. Michael Williams II died in 1858 and left Caerhays to his eldest son John Michael Williams (1813–1880), whilst he left Scorrier House to his sixth son George Williams (1827–1891), DL, JP, High Sheriff of Cornwall in 1875. After the death of John Michael Williams in 1880 his second son, John Charles Williams (1861–1939),  then aged 18, inherited the Caerhays estate. (His elder brother was Michael Williams (1857–1899) of Gnaton Hall, who died without progeny).Burke's Landed Gentry, 1937, p.2442 John Charles Williams married in 1884, at which time the house again went through restoration and alteration.  He became a plantsman, sponsoring plant hunting expeditions in order to fill the castle garden with new acquisitions.  Seeds brought back from China by Ernest Henry Wilson in 1903 were donated to J.C. Williams by Harry Veitch. The current owner in 2012 is Charles Williams."]}, {"page": "List of United Kingdom by-elections (1857–1868)", "response": ["|Michael Williams"]}, {"page": "List of United Kingdom by-elections (1847–1857)", "response": ["|Michael Williams"]}, {"page": "Llywernog Mine", "response": ["A draft lease suggests that the site was leased to Michael Williams and William Williams of Scorrier House, Gwennap, Cornwall, partners of Williams, Foster, and Co., in 1825, who leased many other mines in Cardiganshire between 1825 and 1840. However, just two years later they tried to rescind their lease, as the price of lead had fallen to a level which made Llywernog unprofitable."]}]}}