{"wiki_id": "http://www.wikidata.org/entity/Q16091941", "itemLabel": "Leslie Morrell", "itemDescription": "Northern Irish politician (born 1931)", "wikipedia_url": "https://en.wikipedia.org/wiki/Leslie_Morrell", "wikipedia_page": {"main": "Leslie Morrell (born 26 December 1931) is a former unionist politician in Northern Ireland.\nMorrell was a farmer from near Coleraine, and was active in the Ulster Unionist Party (UUP).  He was elected to Coleraine Rural District Council in 1962, then Londonderry County Council in 1969. He was on several committees, on Coleraine Harbour Board and Coleraine Hospital Management Board as well as Tourism and Water until the 1973 Reorganisation.  In 1973, he was elected to Coleraine District Council and during his service on the Councils was successful in expanding housing in Articlave and getting a swimming-pool, seafront promenade, bowling green and community hall for Castlerock. He was elected on first preference to the Northern Ireland Assembly from the Londonderry constituency.  Although he was a supporter of UUP leader Brian Faulkner, Morrell refused to sign a pledge to support a relevant White Paper, as asked., but became Deputy-leader of the Ulster Unionist Party, under Brian Faulkner, his wife becoming Vice President of Ulster Women's Unionist Association under Lucy Faulkner. He was a member of the team that met SDLP and Alliance for talks that led to the NI Executive and was at the Sunningdale Conference where he negotiated the Council of Ireland with Garret Fitzgerald. He introduced the Shannon-Erne Waterway as a cross -border initiative, giving it further encouragement when on the NI Water Council!\nFaulkner appointed Morrell as Minister of Agriculture when the Northern Ireland Executive was created. After Sunningdale when Faulkner resigned after losing a vote on the Agreement in the Unionist Council, and Morrell was expelled from the UUP by the North Londonderry Constituency Association, he joined Faulkner's new Unionist Party of Northern Ireland, becoming deputy leader of the party.  The Executive fell as a result of the Ulster Workers' Strike in May 1974. However, Morrell lost his seat in Londonderry in the 1975 elections to the Northern Ireland Constitutional Convention.  Morrell did not defend his seat in the 1977 Northern Ireland local elections, and resigned as deputy leader of the party in 1978, to focus on farming and developing the Voluntary Housing Movement in Northern IrelandHe had attended the Corrymeela Conference on Housing in December 1974 and was elected as a member of the Steering Group to develop Voluntary ( Social ) Housing. When the Federation of Housing associations was set up in 1976 he represented Ulster Provident Housing and was founder-chair of James Butcher Housing NI in February 1976.He was the second Chair of NIFHA in 1981/2, and vacated Chair of James Butcher in 1982 to become Honorary Secretary instead. He retained this office after James Butcher and NIH merged to form Oaklee Housing Association and later when Choice Housing Ireland Ltd. was formed by the merger of Oaklee, Trinity and Ulidia HA's. He retired on 31 March 2016 but was elected as the first Honorary President of Choice Housing.In 2015 the UK Institute of Housing recognised his contribution to the development of Social housing in Northern Ireland by a Lifetime Achievement Award\nHe helped launch Oaklee Housing Trust, now re-named Oaklee Housing, in the Republic of Ireland with funds from Oaklee, later being elected to its Board where he served until 2018 when tenure ended under the Rules..\nHe founded and chaired the Virus-tested Seed Potato Growers Association, formed from those who produced the basic healthy seed for the industry in NI., and was a founder member of the NI Institute of Agricultural Science. Before election to the Assembly he was an active member of the Ulster Farmers Union, became Chair of its Potato Committee, on the Executive, and was appointed to the NI Agricultural Council, that elected him as Chairman for several years until it was superseded÷ by the NI Assembly in 1973. in 1982, during Direct Rule,  he was invited to Chair the NI Water Council, a post he held for 10 years, receiving the OBE in 1986 for his services to Water.", "link_mentions": [{"page": "Sunningdale Agreement", "response": ["On 21 November agreement was reached on a voluntary coalition of pro-agreement parties (unlike the provisions of the Belfast Agreement, which establishes the d'Hondt method for the election of ministers, proportionally to the main parties in the assembly). Prominent members of the executive included former Unionist Prime Minister Brian Faulkner as chief executive, SDLP leader Gerry Fitt as deputy chief executive, future Nobel Laureate and SDLP leader John Hume as Minister for Commerce and leader of the Alliance Party Oliver Napier as Legal Minister and head of the Office of Law Reform. Other members of the Executive included Unionist Basil McIvor as Minister for Education, Unionist Herbert Kirk as Minister for Finance, SDLP member Austin Currie as Minister for Housing, Unionist Leslie Morrell as Minister for Agriculture, SDLP member Paddy Devlin as Minister for Health and Social Services, Unionist Roy Bradford as Minister for Environment, and Unionist John Baxter as Minister for information. This new power-sharing executive, made up of the above members, took up office and had its very first meeting on 1 January 1974. The UUP was deeply divided: its Standing Committee voted to participate in the executive by a margin of 132 to 105.", "|Leslie Morrell"]}, {"page": "Department of Agriculture, Environment and Rural Affairs", "response": ["This was subsequently known as the Department of Agriculture for Northern Ireland under direct rule; Northern Ireland was included in the Common Agricultural Policy from January 1973, when the UK joined the European Union. An agricultural ministry with an Ulster Unionist Party minister, Leslie Morrell, was included in the cross-community Northern Ireland Executive which was briefly established in 1974."]}, {"page": "Morrell", "response": ["* Leslie Morrell (born 1931), former Northern Ireland unionist politician"]}, {"page": "Members of the 1973 Northern Ireland Assembly", "response": ["|Leslie Morrell", "|Leslie Morrell"]}, {"page": "Northern Ireland Assembly (1973)", "response": ["*Minister of Agriculture: Leslie Morrell (UUP)"]}, {"page": "Londonderry (Assembly constituency)", "response": ["| Leslie Morrell(UUP)"]}, {"page": "Executive of the 1974 Northern Ireland Assembly", "response": ["|Leslie Morrell"]}]}}