{"wiki_id": "http://www.wikidata.org/entity/Q16062504", "itemLabel": "Leicester Smyth", "itemDescription": "British Army general", "wikipedia_url": "https://en.wikipedia.org/wiki/Leicester_Smyth", "wikipedia_page": {"main": "Lieutenant General Hon. Sir Leicester Smyth  (born Curzon-Howe; 25 October 1829 – 27 January 1891) was a British Army officer and colonial administrator who served as the Governor of Gibraltar.", "link_mentions": [{"page": "Leicester (disambiguation)", "response": ["* Leicester Smyth (1829–1891), British Army officer and Governor of Gibraltar"]}, {"page": "Governor of Gibraltar", "response": ["|||23 August 1890 to 27 January 1891||Sir Leicester Smyth, Governor||"]}, {"page": "Earl Howe", "response": ["Several other members of the Curzon-Howe family have also gained distinction. The Hon. Frederick Howe (1823–1881), third son of the first Earl, was a captain in the Royal Navy. The Hon. Ernest George Howe (1828–1885), sixth son of the first Earl, was a Colonel in the British Army. The Hon. Sir Leicester Smyth (1829–1891) (who assumed the surname of Smyth in 1866), seventh son of the first Earl, was a General in the British Army and served as Governor of Gibraltar. The Hon. Montagu Curzon (1846–1907), eighth son of the first Earl (and eldest from his second marriage), was a Colonel in the Rifle Brigade and Member of Parliament. The Hon. Sir Assheton Curzon-Howe, ninth son and youngest child of the first Earl, was a naval commander and served as Commander-in-Chief of the Mediterranean Fleet from 1908 to 1910. His eldest son Leicester Charles Assheton St John Curzon-Howe (1894–1941) was a Captain in the Royal Navy. Lady Mary Anna Curzon, only daughter of the second marriage of the first Earl, married James Hamilton, 2nd Duke of Abercorn. Their granddaughter Lady Cynthia Hamilton married Albert Spencer, 7th Earl Spencer, and was the grandmother of Diana, Princess of Wales. The aforementioned George Curzon, son of the Hon. Frederick Graham Curzon-Howe, second son of the third Earl, was an actor."]}]}}