{"wiki_id": "http://www.wikidata.org/entity/Q16062570", "itemLabel": "William Frederick Rock", "itemDescription": "British businessman", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Frederick_Rock", "wikipedia_page": {"main": "William Frederick Rock (29 January 1801 – 8 February 1890) was a British publisher and philanthropist.", "link_mentions": [{"page": "Brannam Pottery", "response": ["In 1867 Thomas's son, Charles Hubert Brannam, left school at age 12 to start work at the pottery. Charles won a prize for art at school and also won the Queen's Prize for Drawing in 1870. Initially educated in the theory and practice of ceramics, he was encouraged by a local dignitary, William Frederick Rock, who invited him to London where he studied pottery in the various museums. In 1879 he persuaded his father to allow him to produce art ware. His father agreed on the proviso that Charles paid for the materials he used."]}, {"page": "Museum of Barnstaple and North Devon", "response": ["The structure was built in 1872 for William Thorne, but sold to the Barnstaple Bridge Trust in 1876 who then sold it to William Frederick Rock. Constructed in red brick with dressings of stone and terracotta, the hipped and slated roof has a flat central section which is set with ornamental iron railings together with 5 red brick chimneys with stone caps. The building is square and is built round an internal courtyard with on the right on the building's North side a small service wing which may actually be a former coach-house with a walled courtyard behind.", "The museum was founded as the North Devon Athenæum in 1888 by William Frederick Rock, who intended it to serve as a replacement for  the Barnstaple Literary and Scientific Institute he had created in 1845. In addition to functioning as a library and museum, the building served as an informal records office for Barnstaple. An innovation unusual at that time was that men and women shared the reading rooms as Rock believed that separate facilities would encourage women to gossip rather than read. The Librarian lived in the building, a requirement that lasted until the 1930s."]}, {"page": "Rock Park", "response": ["Rock Park is an urban park in Barnstaple, Devon, England. The park was donated to the public by William Frederick Rock and opened in 1879. It has a number of listed structures including an obelisk at the entrance to the park, a lodge and a range of historic lamp posts.", "The park was donated to the public by William Frederick Rock and officially opened 12 August 1879. It was designed and laid out by RD Gould. The opening was commemorated with an obelisk at the entrance to the park which is a listed structure with Historic England. William Rock was born in Barnstaple and educated at Christ's Hospital London, he started a successful printing business and became wealthy. He became a benefactor to the town founding the literary and scientific foundation in 1845, Rock Park in 1879 and North Devon Athenæum in 1888."]}, {"page": "Guildhall, Barnstaple", "response": ["On the walls of the Chamber are displayed portraits of former Mayors of Barnstaple and various other local dignitaries including local benefactor William Frederick Rock and Barnstaple-born John Gay, author of The Beggar's Opera. Some of these were painted by the noted artist Thomas Hudson and a number were restored with funding from the National Lottery.", "The Mayoral chain displayed in a cabinet in the room dates from 1872; this became the chain of the Lady Mayoress in 1911 when a new Mayor's chain was designed and created by Fred Partridge. This new Mayor's chain was funded by donations from the descendants of former Mayors of Barnstaple and the medallions incorporate scenes from the town including the old Guildhall, the Castle Mound and Queen Anne's Walk together with representations of the old town seals and portraits of William Frederick Rock and Pentecost Dodderidge.Clarke, p. 32"]}]}}