{"wiki_id": "http://www.wikidata.org/entity/Q160627", "itemLabel": "Alfred Russel Wallace", "itemDescription": "British naturalist, explorer, geographer, anthropologist and biologist (1823-1913)", "wikipedia_url": "https://en.wikipedia.org/wiki/Alfred_Russel_Wallace", "wikipedia_page": {"main": "Alfred Russel Wallace  (8 January 1823 – 7 November 1913) was a British naturalist, explorer, geographer, anthropologist, biologist and illustrator. He is best known for independently conceiving the theory of evolution through natural selection; his paper on the subject was jointly published with some of Charles Darwin's writings in 1858. This prompted Darwin to publish On the Origin of Species.\nLike Darwin, Wallace did extensive fieldwork—first in the Amazon River basin, and then in the Malay Archipelago, where he identified the faunal divide now termed the Wallace Line, which separates the Indonesian archipelago into two distinct parts: a western portion in which the animals are largely of Asian origin, and an eastern portion where the fauna reflect Australasia. He was considered the 19th century's leading expert on the geographical distribution of animal species and is sometimes called the \"father of biogeography\".Wallace was one of the leading evolutionary thinkers of the 19th century and made many other contributions to the development of evolutionary theory besides being co-discoverer of natural selection. These included the concepts of warning colouration in animals, and reinforcement (sometimes known as the Wallace effect), a hypothesis on how natural selection could contribute to speciation by encouraging the development of barriers against hybridisation. Wallace's 1904 book Man's Place in the Universe was the first serious attempt by a biologist to evaluate the likelihood of life on other planets. He was also one of the first scientists to write a serious exploration of the subject of whether there was life on Mars.Aside from scientific work, he was a social activist who was critical of what he considered to be an unjust social and economic system (capitalism) in 19th-century Britain. His advocacy of spiritualism and his belief in a non-material origin for the higher mental faculties of humans strained his relationship with some members of the scientific establishment.  His interest in natural history resulted in his being one of the first prominent scientists to raise concerns over the environmental impact of human activity. He was also a prolific author who wrote on both scientific and social issues; his account of his adventures and observations during his explorations in Singapore, Indonesia and Malaysia, The Malay Archipelago, was both popular and highly regarded. Since its publication in 1869, it has never been out of print.", "link_mentions": [{"page": "Amazon River", "response": ["* Henry Walter Bates and Alfred Russel Wallace, 1848–1859"]}, {"page": "Anthropic principle", "response": ["Carter was not the first to invoke some form of the anthropic principle. In fact, the evolutionary biologist Alfred Russel Wallace anticipated the anthropic principle as long ago as 1904: \"Such a vast and complex universe as that which we know exists around us, may have been absolutely required [...] in order to produce a world that should be precisely adapted in every detail for the orderly development of life culminating in man.\" In 1957, Robert Dicke wrote: \"The age of the Universe 'now' is not random but conditioned by biological factors [...] [changes in the values of the fundamental constants of physics] would preclude the existence of man to consider the problem.\""]}, {"page": "Branco River", "response": ["As suggested by its name, the Branco (literally \"white\" in Portuguese) has whitish water that may appear almost milky due to the inorganic sediments it carries.The Alfred Russel Wallace page: On the Rio Negro. Retrieved 10 October 2017. It is traditionally considered a whitewater river, although the major seasonal fluctuations in its physico-chemical characteristics makes a classification difficult and some consider it clearwater. Especially the river's upper parts at the headwaters are clear and flow through rocky country, leading to the suggestion that sediments mainly originate from the lower parts. Furthermore, its chemistry and color may contradict each other compared to the traditional Amazonian river classifications. The Branco River has pH 6–7 and low levels of dissolved organic carbon.", "Alfred Russel Wallace mentioned the coloration in \"On the Rio Negro\", a paper read at the 13 June 1853 meeting of the Royal Geographical Society, in which he said: \"[The Rio Branco] is white to a remarkable degree, its waters being actually milky in appearance\". Alexander von Humboldt attributed the color to the presence of silicates in the water, principally mica and talc. Alexander von Humboldt, Personal Narrative of Travels to the Equinoctial Regions of America During the Years 1799-1804, (chapter 25). Henry G. Bohn, London, 1853. There is a visible contrast with the waters of the Rio Negro at the confluence of the two rivers. The Rio Negro is a blackwater river with dark tea-colored acidic water (pH 3.5–4.5) that contains high levels of dissolved organic carbon."]}, {"page": "Bali", "response": ["In June 1860, the famous Welsh naturalist, Alfred Russel Wallace, travelled to Bali from Singapore, landing at Buleleng on the north coast of the island. Wallace's trip to Bali was instrumental in helping him devise his Wallace Line theory. The Wallace Line is a faunal boundary that runs through the strait between Bali and Lombok. It is a boundary between species. In his travel memoir The Malay Archipelago, Wallace wrote of his experience in Bali, of which has a strong mention of the unique Balinese irrigation methods:", "To the east, the Lombok Strait separates Bali from Lombok and marks the biogeographical division between the fauna of the Indomalayan realm and the distinctly different fauna of Australasia. The transition is known as the Wallace Line, named after Alfred Russel Wallace, who first proposed a transition zone between these two major biomes. When sea levels dropped during the Pleistocene ice age, Bali was connected to Java and Sumatra and to the mainland of Asia and shared the Asian fauna, but the deep water of the Lombok Strait continued to keep Lombok Island and the Lesser Sunda archipelago isolated."]}, {"page": "Continental drift", "response": ["In 1889, Alfred Russel Wallace remarked, \"It was formerly a very general belief, even amongst geologists, that the great features of the earth's surface, no less than the smaller ones, were subject to continual mutations, and that during the course of known geological time the continents and great oceans had, again and again, changed places with each other.\" He quotes Charles Lyell as saying, \"Continents, therefore, although permanent for whole geological epochs, shift their positions entirely in the course of ages.\" and claims that the first to throw doubt on this was James Dwight Dana in 1849."]}, {"page": "Beetle", "response": ["Beetle collecting became extremely popular in the Victorian era. The naturalist Alfred Russel Wallace collected (by his own count) a total of 83,200 beetles during the eight years described in his 1869 book The Malay Archipelago, including 2,000 species new to science."]}, {"page": "Charles Lyell", "response": ["Building on the innovative work of James Hutton and his follower John Playfair, Lyell favoured an indefinitely long age for the earth, despite evidence suggesting an old but finite age.  He was a close friend of Charles Darwin, and contributed significantly to Darwin's thinking on the processes involved in evolution. As Darwin wrote in On the Origin of Species, \"He who can read Sir Charles Lyell's grand work on the Principles of Geology, which the future historian will recognise as having produced a revolution in natural science, yet does not admit how incomprehensibly vast have been the past periods of time, may at once close this volume.\" Lyell helped to arrange the simultaneous publication in 1858 of papers by Darwin and Alfred Russel Wallace on natural selection, despite his personal religious qualms about the theory. He later published evidence from geology of the time man had existed on the earth.", "Lyell and Hooker were instrumental in arranging the peaceful co-publication of the theory of natural selection by Darwin and Alfred Russel Wallace in 1858: each had arrived at the theory independently. Lyell's views on gradual change and the power of a long time scale were important because Darwin thought that populations of an organism changed very slowly."]}, {"page": "Darwinism", "response": ["In Darwin's day there was no rigid definition of the term \"Darwinism\", and it was used by opponents and proponents of Darwin's biological theory alike to mean whatever they wanted it to in a larger context. The ideas had international influence, and Ernst Haeckel developed what was known as Darwinismus in Germany, although, like Spencer's \"evolution\", Haeckel's \"Darwinism\" had only a rough resemblance to the theory of Charles Darwin, and was not centred on natural selection.Schmitt S. (2009). Haeckel: A German Darwinian? Comptes Rendus Biologies: 332: 110-118. In 1886, Alfred Russel Wallace went on a lecture tour across the United States, starting in New York and going via Boston, Washington, Kansas, Iowa and Nebraska to California, lecturing on what he called \"Darwinism\" without any problems."]}, {"page": "Evolution", "response": ["The scientific theory of evolution by natural selection was conceived independently by Charles Darwin and Alfred Russel Wallace in the mid-19th century and was set out in detail in Darwin's book On the Origin of Species. Evolution by natural selection was first demonstrated by the observation that more offspring are often produced than can possibly survive. This is followed by three observable facts about living organisms: (1) traits vary among individuals with respect to their morphology, physiology and behaviour (phenotypic variation), (2) different traits confer different rates of survival and reproduction (differential fitness) and (3) traits can be passed from generation to generation (heritability of fitness). Thus, in successive generations members of a population are more likely to be replaced by the progenies of parents with favourable characteristics that have enabled them to survive and reproduce in their respective environments. In the early 20th century, other competing ideas of evolution such as mutationism and orthogenesis were refuted as the modern synthesis reconciled Darwinian evolution with classical genetics, which established adaptive evolution as being caused by natural selection acting on Mendelian genetic variation.", "The crucial break from the concept of constant typological classes or types in biology came with the theory of evolution through natural selection, which was formulated by Charles Darwin in terms of variable populations. Darwin used the expression \"descent with modification\" rather than \"evolution\". Partly influenced by An Essay on the Principle of Population (1798) by Thomas Robert Malthus, Darwin noted that population growth would lead to a \"struggle for existence\" in which favourable variations prevailed as others perished. In each generation, many offspring fail to survive to an age of reproduction because of limited resources. This could explain the diversity of plants and animals from a common ancestry through the working of natural laws in the same way for all types of organism. Darwin developed his theory of \"natural selection\" from 1838 onwards and was writing up his \"big book\" on the subject when Alfred Russel Wallace sent him a version of virtually the same theory in 1858. Their separate papers were presented together at an 1858 meeting of the Linnean Society of London. At the end of 1859, Darwin's publication of his \"abstract\" as On the Origin of Species explained natural selection in detail and in a way that led to an increasingly wide acceptance of Darwin's concepts of evolution at the expense of alternative theories. Thomas Henry Huxley applied Darwin's ideas to humans, using paleontology and comparative anatomy to provide strong evidence that humans and apes shared a common ancestry. Some were disturbed by this since it implied that humans did not have a special place in the universe."]}, {"page": "Human evolution", "response": ["The first debates about the nature of human evolution arose between Thomas Henry Huxley and Richard Owen. Huxley argued for human evolution from apes by illustrating many of the similarities and differences between humans and other apes, and did so particularly in his 1863 book Evidence as to Man's Place in Nature. Many of Darwin's early supporters (such as Alfred Russel Wallace and Charles Lyell) did not initially agree that the origin of the mental capacities and the moral sensibilities of humans could be explained by natural selection, though this later changed. Darwin applied the theory of evolution and sexual selection to humans in his 1871 book The Descent of Man, and Selection in Relation to Sex."]}, {"page": "Falsifiability", "response": ["In the 5th and 6th editions of On the origin of species, following a suggestion of Alfred Russel Wallace, Darwin used \"Survival of the fittest\", an expression first coined by Herbert Spencer, as a synonym for \"Natural Selection\". Popper and others said that, if one uses the most widely accepted definition of \"fitness\" in modern biology (see subsection ), namely reproductive success itself, the expression \"survival of the fittest\" is a tautology."]}, {"page": "Flat Earth", "response": ["* English writer Samuel Rowbotham (1816–1885), writing under the pseudonym \"Parallax\", produced in 1849 a pamphlet \"Zetetic Astronomy\" arguing for a flat Earth and published results of many experiments that tested the curvatures of water over a long-drainage ditch, followed by another, called The inconsistency of Modern Astronomy and its Opposition to the Scripture. One of his supporters, John Hampden, lost a bet to Alfred Russel Wallace in the famous Bedford Level experiment, which attempted to prove it. In 1877, Hampden produced a book A New Manual of Biblical Cosmography. Rowbotham also produced studies that purported to show that the effects of ships disappearing below the horizon could be explained by the laws of perspective in relation to the human eye. In 1883, he founded Zetetic Societies in England and New York, to which he shipped a thousand copies of Zetetic Astronomy."]}, {"page": "Indonesia", "response": ["British naturalist Alfred Russel Wallace described a dividing line (Wallace Line) between the distribution of Indonesia's Asian and Australasian species. It runs roughly north–south along the edge of the Sunda Shelf, between Kalimantan and Sulawesi, and along the deep Lombok Strait, between Lombok and Bali. Flora and fauna on the west of the line are generally Asian, while east from Lombok, they are increasingly Australian until the tipping point at the Weber Line. In his 1869 book, The Malay Archipelago, Wallace described numerous species unique to the area. The region of islands between his line and New Guinea is now termed Wallacea."]}, {"page": "June 18", "response": ["*1858 – Charles Darwin receives a paper from Alfred Russel Wallace that includes nearly identical conclusions about evolution as Darwin's own, prompting Darwin to publish his theory."]}, {"page": "Joseph Conrad", "response": ["For the natural surroundings of the high seas, the Malay Archipelago and South America, which Conrad described so vividly, he could rely on his own observations. What his brief landfalls could not provide was a thorough understanding of exotic cultures. For this he resorted, like other writers, to literary sources. When writing his Malayan stories, he consulted Alfred Russel Wallace's The Malay Archipelago (1869), James Brooke's journals, and books with titles like Perak and the Malays, My Journal in Malayan Waters, and Life in the Forests of the Far East. When he set about writing his novel Nostromo, set in the fictional South American country of Costaguana, he turned to The War between Peru and Chile; Edward Eastwick, Venezuela: or, Sketches of Life in a South American Republic (1868); and George Frederick Masterman, Seven Eventful Years in Paraguay (1869).  As a result of relying on literary sources, in Lord Jim, as J. I. M. Stewart writes, Conrad's \"need to work to some extent from second-hand\" led to \"a certain thinness in Jim's relations with the... peoples... of Patusan...\" This prompted Conrad at some points to alter the nature of Charles Marlow's narrative to \"distanc[e] an uncertain command of the detail of Tuan Jim's empire.\""]}, {"page": "July 1", "response": ["*1858 – Joint reading of Charles Darwin and Alfred Russel Wallace's papers on evolution to the Linnean Society of London."]}, {"page": "January 8", "response": ["*1823 – Alfred Russel Wallace, Welsh geographer, biologist, and explorer (d. 1913)"]}, {"page": "List of agnostics", "response": ["* Alfred Russel Wallace (1823–1913): British naturalist, explorer, geographer, anthropologist and biologist. He is best known for independently proposing a theory of evolution due to natural selection that prompted Charles Darwin to publish his own theory."]}, {"page": "Index of philosophy articles (A–C)", "response": ["* Alfred Russel Wallace"]}]}}