{"wiki_id": "http://www.wikidata.org/entity/Q16030588", "itemLabel": "William Eaton, 2nd Baron Cheylesmore", "itemDescription": "British art collector (1843-1902)", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Eaton,_2nd_Baron_Cheylesmore", "wikipedia_page": {"main": "William Meriton Eaton, 2nd Baron Cheylesmore (15 January 1843 – 10 July 1902) is best remembered as a leading collector of English mezzotint portraits, and collector of other art. His mezzotints and other prints, over 10,000 in number, were left to the British Museum, and five oil paintings to the National Gallery, London.  He also stood unsuccessfully for Parliament for the Conservative Party at Macclesfield in 1868, 1874 and 1880, and held a nominal partnership in the family silk business.\nAs his elder brother had predeceased him, he became 2nd Baron Cheylesmore, which is pronounced \"Chylsmore\", in 1891 on the death of his father Henry William Eaton, 1st Baron Cheylesmore (1816–1891). He never married, and was succeeded by his younger brother Herbert, a major-general and sportsman.", "link_mentions": [{"page": "Mezzotint", "response": ["British mezzotint collecting was a great craze from about 1760 to the Great Crash of 1929, also spreading to America. The main area of collecting was British portraits; hit oil paintings from the Royal Academy Summer Exhibition were routinely, and profitably, reproduced in mezzotint throughout this period, and other mezzotinters reproduced older portraits of historical figures, or if necessary, made them up. The favourite period to collect was roughly from 1750 to 1820, the great period of the British portrait. There were two basic styles of collection: some concentrated on making a complete collection of material within a certain scope, while others aimed at perfect condition and quality (which declines in mezzotints after a relatively small number of impressions are taken from a plate), and in collecting the many \"proof states\" which artists and printers had obligingly provided for them from early on. Leading collectors included William Eaton, 2nd Baron Cheylesmore and the Irishman John Chaloner Smith.Griffiths, 134–137 and 141–142"]}, {"page": "The Execution of Lady Jane Grey", "response": ["It was originally bought by Anatoly Nikolaievich Demidov, 1st Prince of San Donato as part of the Demidov collection. From there it passed in 1870 to Henry Eaton, 1st Baron Cheylesmore after whose death in 1891 it realised £1,575 (lot 78) at his sale at Christie's the next year, less than a quarter of the price of the star of the sale, The Monarch of the Glen (lot 42, £7,245) by Sir Edwin Landseer, one of the most popular paintings of the age.Christie's, Catalogue of the important collection of modern pictures and sculpture formed by the late Rt. Hon. Lord Cheylesmore, auction catalogue, London, 7 May 1892, online copy with prices realized added by hand It was bought by his son, William Eaton, 2nd Baron Cheylesmore, who bequeathed it to the National Gallery, London in 1902, with four other paintings, including two other Landseers from his father's collection.Antony Griffiths (ed), Landmarks in Print Collecting – Connoisseurs and Donors at the British Museum since 1753, 1996, British Museum Press, , p. 139"]}, {"page": "William Eaton", "response": ["* William Eaton, 2nd Baron Cheylesmore (1843–1902), collector of English mezzotint portraits"]}]}}