{"wiki_id": "http://www.wikidata.org/entity/Q1606575", "itemLabel": "Henry Callaway", "itemDescription": "Missionary, Bishop of St. John's", "wikipedia_url": "https://en.wikipedia.org/wiki/Henry_Callaway", "wikipedia_page": {"main": "Henry Callaway (17 January 1817 in either Lymington, Hampshire, or Somerset – 26 March 1890) was a missionary for the Church of England and bishop of St John's, Kaffraria, in the Church of the Province of Southern Africa.", "link_mentions": [{"page": "The Religious System of the Amazulu", "response": ["The Religious System of the Amazulu (1870), by Henry Callaway, describes the beliefs of the Amazulu people. It was written in both English and Zulu. Henry Callaway was an English missionary. His interest in the Zulu people began when he settled on the banks of the Nsunguze river where he created various books influenced by them. One of those books was The Religious Systems of The Amazulu. The book is presented in question and answer format. It is divided into four different sections which include, Unkulunkulu, Amatonga, Izinyanga Zokubula, and Abatakati. Each of these sections focuses on the four main aspects which constitute the religious system of the Zulu people.", "== Biographical Background of Henry Callaway ==", "Henry Callaway was the first missionary bishop of St. John’s Kafraria in South Africa. He was born on January 17, 1817 at Lymington Somerset. After giving birth to Callaway, his family moved to London and then Crediton where he officially got educated in Crediton Grammar School. Callaway then went to become an assistant teacher in a small school in Heavitree. During his time at Heavitree, he was introduced to the idea of Quakerism by the headmaster of the school, William Dymond. He was prone to the idea of Quakerism and by the Spring of 1837, Henry Callaway was admitted to be the member of the Society of Friends, which is an official group for Quakers. He was admitted through a Quaker family that he privately tutored in  Wellington. After his years in teaching, he decided to move into the medical field."]}, {"page": "Euphorbia cupularis", "response": ["Missionary Henry Callaway, living near the Umkomazi River recorded stories of the magical and spiritual power of the umdlebe tree in The Religious System of the Amazulu. He guesses the tree is \"probably a kind of aspen\" and reminds him of the upas of Java, but that \"much that is said about it is doubtless fabulous and wholly untrustworthy.\""]}, {"page": "Nada the Lily", "response": ["Parts of the story are closely based on actual historical events and on folktales recorded by Bishop Henry Callaway and others. 'Mopo' is based in part on a man called Mbopa who was involved in the assassination of Shaka; however Umslopogaas, Galazi and Nada are wholly invented characters."]}, {"page": "Anglican Diocese of Mthatha", "response": ["Bishop Henry Callaway was consecrated in Edinburgh in 1873 as the first bishop of the diocese.  In Bishop Callaway's new diocese, apart from the mission station he started at Clydesdale, there were five or six other centres of missionary work. The oldest being St Mark's.  The first part of Callaway's work was spent trying to find the best way to organise the diocese.  The chief problem was to link Clydesdale with the St Mark's group in the south. He first attempted to establish the See at Clydesdale, which was too far north, and then at St Andrew's, not far from Lusikisiki, which turned out to be inaccessible except by sea.  He finally settled on a place on the Mthatha River.  A town sprang up around the bishop's mission station and Pro-cathedral.", "| Henry Callaway"]}, {"page": "College of the Transfiguration", "response": ["St Bede's College in Mthatha was founded in 1879 by Henry Callaway, the first bishop of the Diocese of St John. The purpose of the institution was the \"training of young natives, and colonists as clergy and teachers.\" At that time the primary task was to train clergy and catechist for the diocese. A shift happened in the mid-twentieth century when the college was given some provincial recognition as a result of a synod of bishops in 1955. Pressures brought to bear by the apartheid regime, and other institutional factors, resulted in the consideration of different schemes of amalgamation as early as the seventies. The college was temporarily closed in 1983 and the premises were leased to the University of Transkei for a year, before being re-opened in 1985. At the time of its closure in 1992 the college had an influential role in the Anglican Church of Southern Africa."]}, {"page": "Queen Elizabeth's Grammar School, Crediton", "response": ["* Henry Callaway, missionary"]}, {"page": "Callaway (surname)", "response": ["*Henry Callaway, bishop of the Anglican Church"]}, {"page": "Peter Masiza", "response": ["In 1871 Peter's brother, Paul Masiza was ordained deacon in the Anglican Church of Southern Africa by the Henry Cotterill, bishop of Grahamstown. Paul died two years later; Peter Masiza followed in his brother's footsteps: he was ordained deacon in 1873 and later becoming the first black Anglican priest in South Africa, when on 24 June 1877 Henry Callaway, the first bishop of St John's ordained Masiza the first Xhosa priest in St John's Cathedral, Mthatha, and later the first black canon."]}, {"page": "Umamba (Zulu folktale)", "response": ["An English language translation of the tale was provided by reverend Henry Callaway in his book on Zulu tales, which he collected from a Lydia (Umkasetemba).Callaway, Henry. Nursery Tales, Traditions, and Histories of the Zulus: In Their Own Words. Springvale, Natal: J. A. Blair. 1868. pp. 321-331."]}]}}