{"wiki_id": "http://www.wikidata.org/entity/Q16063009", "itemLabel": "John MacGregor", "itemDescription": "Australian politician", "wikipedia_url": "https://en.wikipedia.org/wiki/John_MacGregor_(Australian_politician)", "wikipedia_page": {"main": "John MacGregor (1828 – 27 March 1884) was a politician in colonial Victoria (Australia), and Minister of Mines.MacGregor was the son of John Macgregor, and was born in the island of Skye, Scotland. He arrived in Victoria in 1840, was admitted a solicitor of the Supreme Court in 1855, and practised in Melbourne, in what was latterly the firm of MacGregor, Ramsay, & Brahe.MacGregor unsuccessfully contested East Bourke in 1856 and 1861, but after the retirement of Wilson Gray in September 1862 MacGregor was returned for Rodney, for which district he sat in the Victorian Legislative Assembly till March 1874, when he retired from Parliament. \nMacGregor joined the first James McCulloch Government, and was Minister of Mines from July 1866 to May 1868. On the defeat of the John Alexander MacPherson Ministry in April 1870 MacGregor was asked by the Governor to form a Government, but he recommended that Sir James McCulloch should be sent for. MacGregor brought in, and for the first time carried, a Payment of Members Bill. He had long retired from public life when he died on 27 March 1884 at his home in Gipps street, East Melbourne, Victoria.", "link_mentions": [{"page": "John MacGregor", "response": ["John MacGregor, John Macgregor or John McGregor may refer to:", "* John MacGregor (rugby union) (fl. 1909), Scottish rugby union player", "* John MacGregor (Glasgow MP) (1797–1857), MP representing Glasgow", "* John MacGregor, Baron MacGregor of Pulham Market (born 1937), British politician, MP, and government minister", "* John MacGregor (Australian politician) (1828–1884), member of the Victorian Legislative Assembly in the 1860s & 70s", "* John MacGregor (New Zealand politician) (1850–1936), New Zealand lawyer, politician and writer", "* John MacGregor (sportsman) (1825–1892), Scottish explorer, travel writer and philanthropist", "* John MacGregor (VC) (1889–1952), Canadian recipient of the Victoria Cross, 1918"]}, {"page": "Electoral district of Rodney", "response": ["| John MacGregor"]}, {"page": "List of Victorian state by-elections", "response": ["|John MacGregor", "|John MacGregor", "|John MacGregor"]}, {"page": "Electoral results for the district of Rodney", "response": ["| John MacGregor"]}, {"page": "Members of the Victorian Legislative Assembly, 1861–1864", "response": [": Gray resigned in September 1862; replaced by John MacGregor in a November 1862 by-election"]}, {"page": "List of plant genera named for people (K–P)", "response": ["|data-sort-value=\"MacGregor\"|John MacGregor (1828–1884), politician"]}]}}