{"wiki_id": "http://www.wikidata.org/entity/Q16012915", "itemLabel": "Don Adams", "itemDescription": "British association football player (1931-1993)", "wikipedia_url": "https://en.wikipedia.org/wiki/Don_Adams_(footballer)", "wikipedia_page": {"main": "Donald Frederick Adams (15 February 1931–1993) was an English professional footballer who played in the Football League, as a forward.\nDon was the son of a former Northampton Town footballer by the name of Fred Adams who played in the 1920s, and lived in Clark Road Northampton, the garden backing onto the old county ground\nDon spent many hours as a youngster at the football ground, not only watching but also training. As a youth he played for a local youth team, the 6th Northampton company of the Boys Brigade based in Kingsley. Don was introduced to the Cobblers one day when attending an injury clinic and got talking to Jack Jennings who had Tommy Mulgrew under treatment at the time. Don explained that he was on amateur forms with Chelsea, so it was suggested that he went along to the cobblers for a trial when he was fit again. From this opportunity he progressed through the A team and reserves (who used to draw 6000 crowds back in those days) to eventually play his first game for the club as a professional against Plymouth Argyle. He made 23 appearances, scoring 7 goals. \nDon played for the cobblers from 1951 to 1956 and went on to play for Bedford town and Rushden town.", "link_mentions": [{"page": "Don Adams (disambiguation)", "response": ["Don Adams (1923–2005) was an American actor.", "Don Adams may also refer to:", "*Don Adams (country singer) 1960s, American country singer", "*Don Adams (R&B singer) (1942–1995), Munich based Scottish singer", "*Don Adams (rugby league), Australian rugby league footballer for Scone Thoroughbreds", "*Don Adams (boxer), British bare-knuckle boxer", "*Don Adams (basketball) (1947–2013), American basketball player", "*Don Adams (footballer) (1931–1993), English footballer", "*Don Adams (politician), Texas politician and legislator"]}, {"page": "1952–53 Northampton Town F.C. season", "response": ["|Don Adams||IF||||Northampton||||9||4||Apprentice||Summer 1951||N/A", "| IF || style=\"text-align:left;\" |  Don Adams"]}]}}