{"wiki_id": "http://www.wikidata.org/entity/Q16017359", "itemLabel": "Gracie Cole", "itemDescription": "English trumpeter", "wikipedia_url": "https://en.wikipedia.org/wiki/Gracie_Cole", "wikipedia_page": {"main": "Grace Elizabeth Agnes Annie Cole (8 September 1924 – 28 December 2006) was a British trumpeter and bandleader. She was lead soloist in Ivy Benson's all-girls band during the 1940s, going on to form her own all-female band in the 1950s.", "link_mentions": [{"page": "List of trumpeters", "response": ["* Gracie Cole"]}, {"page": "Ivy Benson", "response": ["*Gracie Cole – trumpeter with the Ivy Benson band."]}, {"page": "Deaths in December 2006", "response": ["*Gracie Cole, 82, British trumpeter and bandleader."]}, {"page": "Cole (surname)", "response": ["*Gracie Cole (1924–2006), English trumpeter"]}, {"page": "George Evans (bandleader)", "response": ["Other leading UK musicians who at one time were members of Evans' bands include Jimmy Staples, Don Rendell, Charles Chapman, Gracie Cole, Tony Symes, Jackie Sprague, Bill Geldard, Jock Cummings, Jack Parnell, Pat Dodd, Jack Llewellyn, Kenny Baker, Billy Riddick, Cliff Haines, Izzy Duman, Bill Apps, Eric Jupp, Malcolm Mitchell, Don Raine, Dougie Cooper, Arthur Greenslade, Ricky Derges, Ted Hunt, Bill Jackson, Graham Smith, Frank Pritchard, Hank Shaw, Arthur Mowatt, Ray Chester, Don Fairly, Eddy Shearer, Ray Harley, Gordon Marshall, David Barnes, and Denis Shirley, Charlie Payne, Frank Rogers, Roy Ringrose, Freddie Syer, Ronnie Chandler, Erik Maxwell, Dennis Hughes, Syd Dowel, Kenny Kaye, Jimmy Paul and Shirley Gray on vocals."]}, {"page": "Gracie (name)", "response": ["* Gracie Cole (1924–2006), British trumpeter and bandleader"]}, {"page": "Grace Cole", "response": ["#REDIRECT Gracie Cole"]}, {"page": "Janette Mason", "response": ["Mason was born in Bushey, Hertfordshire and grew up in Wembley in  a musical household: her mother, who performed in the Gracie Cole Big Band, played jazz organ and vibraphone. She studied at the Guildhall School of Music and Drama and has a degree in musical composition for film and television."]}]}}