{"wiki_id": "http://www.wikidata.org/entity/Q16043778", "itemLabel": "J. W. Myers", "itemDescription": "British singer", "wikipedia_url": "https://en.wikipedia.org/wiki/J._W._Myers", "wikipedia_page": {"main": "John W. Myers (c. 1864 – c. 1919?), who was usually credited as J. W. Myers, was a Welsh-born baritone singer, who recorded widely in the United States between the early 1890s and early 1917. His recordings, including \"Two Little Girls in Blue\" (1893), \"The Sidewalks of New York\" (1895), \"Just Tell Them That You Saw Me\" (1895), \"When You Were Sweet Sixteen\" (1901), \"On a Sunday Afternoon\" (1902), \"Way Down In Old Indiana\" (1902), and \"In the Good Old Summer Time\" (1902), were among the most popular of the period.", "link_mentions": [{"page": "1903 in music", "response": ["* \"In The City Of Sighs And Tears\" (w. Andrew B. Sterling m. Kerry Mills)  –  J. W. Myers on Victor", "* \"The Message Of The Violet\" (w. Frank Pixley m. Gustav Luders)  –  J. W. Myers on Victor", "* \"My Own United States\" (w. Stanislaus Stange m. Julian Edwards)  –  J. W. Myers on Victor", "* \"Wait At The Gate For Me\" (w. Ren Shields m. Theodore F. Morse)  –  J. W. Myers on Victor"]}, {"page": "1899 in music", "response": ["* \"I Dreamt I Dwelt In Marble Halls\" (w. Alfred Bunn m. Michael William Balfe)  – J. W. Myers on Berliner Records", "* \"Just As The Sun Went Down\" (w. Karl Kennett m. Lyn Udall)  – J. W. Myers on Berliner Records – S. H. Dudley & Harry Macdonough on Edison Records", "* \"Just One Girl\" (w. Karl Kennett m. Lyn Udall)  – Sousa's Band on Berliner Records – Albert C. Campbell on Edison Records – H. Scott Russell with p. Amy Williams on Berliner Gramophone – J. W. Myers on Columbia Records", "* \"'Tis The Last Rose Of Summer\" (w. Thomas Moore m. Richard Alfred Milliken)  – J. W. Myers on Berliner Records"]}, {"page": "1898 in music", "response": ["* \"Believe Me, If All Those Endearing Young Charms\" (w. Thomas Moore m. trad)  –  J. W. Myers on Berliner Gramophone", "* \"The Harp That Once Thro' Tara's Halls\" (w. Thomas Moore m. trad)  –  J. W. Myers on Berliner Gramophone"]}, {"page": "1896 in music", "response": ["*\"Nearer, My God, To Thee\" (w. Sarah F. Adams m. Lowell Mason)  –  J. W. Myers on Berliner –  Len Spencer & Roger Harding on Columbia", "*\"Onward, Christian Soldiers\" (w. Rev. Sabine Baring-Gould m. Sir Arthur Sullivan)  –  J. W. Myers on Berliner", "*\"Rock Of Ages\" (w. Augustus Montague Toplady m. Thomas Hasting)  –  J. W. Myers on Berliner", "*\"There's Only One Girl In the World For Me\" (w.m. Dave Marion)  –  J. W. Myers on Berliner", "*\"Toreador Song\" (w. Henri Meilhac, Ludovic Halévy m. Georges Bizet)  –  J. W. Myers on Berliner", "*\"Watchman Tell Us Of The Night\" (Bowring, Mason)  –  J. W. Myers on Berliner", "*\"Where Is My Wandering Boy, Tonight?\" (w.m. Rev. R. Lowry)  –  J. W. Myers on Berliner"]}, {"page": "1891 in music", "response": ["* \"Bell Buoy\" – J. W. Myers"]}, {"page": "Myers", "response": ["*J. W. Myers (c. 1864–c. 1919?), Welsh-American baritone"]}, {"page": "Ciro Pinsuti", "response": ["In Britain and America Pinsuti was best known for his parlour songs.  One of these ballads titled \"Beatrice - Kind and so modest\", was a setting of Dante's sonnet XXVI from La Vita Nuova. His song \"I fear no foe\", to words by E. Oxenford, was popular and widely-sung in Britain. Other widely recorded songs included the \"Bedouin love song\" and \"Welcome, pretty primrose\".\"Ciro Pinsuti\", Discography of American Historical Recordings Performers who recorded his songs included Peter Dawson, J. W. Myers, Clarence Whitehill and Jules Levy. His aria il libro santo was recorded by Magda Olivero. The choral song Good night, good night, beloved has been recorded by The Sixteen.Coro COR16184 (2021), reviewed at MusicWeb International"]}, {"page": "When You Were Sweet Sixteen", "response": ["\"When You Were Sweet Sixteen\" was the number one record in 1900.  First recorded by Jere Mahoney on Edison Records, it became the number one record in April and held the spot for five weeks; it was also recorded by George J. Gaskin on Columbia and in November this record rose to number one as well, remaining so for eight weeks.  Other artists followed quickly including J. W. Myers (1901, Victor 1145) and Harry Macdonough (1901, Victor 1769).", "*\"When You Were Sweet Sixteen\" sung by J. W. Myers, 1901 recording at Library of Congress National Jukebox"]}, {"page": "List of train songs", "response": ["*\"In the Baggage Coach Ahead\" (Gussie Davis), published 1886, by Fiddlin' John Carson (1924), Vernon Dalhart (1918), George J. Gaskin (c. 1898), Andrew Jenkins & Carson Robison (1928), J. W. Myers (1905), John Mellencamp (1985, as \"Grandma's Theme\"), Dick Nolan (1974), Steve Porter (1899), Kate Smith (1932), Mac Wiseman (1960)"]}, {"page": "In the Good Old Summer Time", "response": ["*J. W. Myers (1902)"]}, {"page": "John W. Myers", "response": ["#REDIRECT J. W. Myers"]}]}}