{"wiki_id": "http://www.wikidata.org/entity/Q16000000", "itemLabel": "Bernard van Cutsem", "itemDescription": "English horsebreeder and racehorse trainer", "wikipedia_url": "https://en.wikipedia.org/wiki/Bernard_van_Cutsem", "wikipedia_page": {"main": "Bernard Henry Richard Harcourt van Cutsem (23 January 1916 – 8 December 1975) was an English horsebreeder and racehorse trainer.", "link_mentions": [{"page": "2000 Guineas Stakes", "response": ["| Bernard van Cutsem"]}, {"page": "Coronation Cup", "response": ["| Bernard van Cutsem"]}, {"page": "King George VI and Queen Elizabeth Stakes", "response": ["| Bernard van Cutsem"]}, {"page": "Middle Park Stakes", "response": ["| Bernard van Cutsem"]}, {"page": "Dewhurst Stakes", "response": ["| Bernard van Cutsem"]}, {"page": "Vertem Futurity Trophy", "response": ["| Bernard van Cutsem", "| Bernard van Cutsem"]}, {"page": "John Aspinall (zoo owner)", "response": ["Among the gamblers were the Queen's racehorse trainer Bernard van Cutsem, who brought with him friends including the Earl of Derby and the Duke of Devonshire. The standard bet was £1,000, which would be £25,000 accounting for inflation in 2007 figures. Chemie games were quick and played every 30 seconds, with £50,000 changing hands per game. On his first such event Aspinall made a profit of £10,000, a sum roughly equivalent to £300,000 in 2017 money."]}, {"page": "Ribblesdale Stakes", "response": ["| Bernard van Cutsem"]}, {"page": "Hardwicke Stakes", "response": ["| Bernard van Cutsem", "| Bernard van Cutsem"]}, {"page": "Arthur Gore, 9th Earl of Arran", "response": ["On 28 September 1974, Arran married Eleanor van Cutsem, daughter of Bernard van Cutsem and Lady Margaret Fortescue, and granddaughter of Hugh Fortescue, 5th Earl Fortescue, and heiress of the Fortescue seat of Castle Hill, in Devon. She was appointed a Member of the Order of the British Empire (MBE) in the Queen's Birthday Honours 2008. Lord and Lady Arran run the Fortescue family's stately home, Castle Hill House and gardens in Devon, as a venue for weddings and corporate hospitality. He has no son, but has two daughters:"]}, {"page": "Irish 2,000 Guineas", "response": ["| Bernard van Cutsem"]}, {"page": "Hugh Fortescue, 5th Earl Fortescue", "response": ["*Lady Margaret Fortescue (13 December 1923 – 25 May 2013), eldest surviving daughter and co-heiress, who married the prominent race-horse breeder Bernard van Cutsem of Newmarket, Suffolk, and had issue. Following her inheritance (see below) Lady Margaret found herself frequently commuting the long distance between Newmarket and Devon to administer her estates at Castle Hill and at Simonsbath on Exmoor.Exmoor Oral History Archive, Dulverton and District Civic Society, 2001  Shortly after 1879 her grandfather Hugh Fortescue, 4th Earl Fortescue (1854–1932), Master of the Devon and Somerset Staghounds 1880/81–87, had acquired the reversion of the whole of the former Royal Forest of Exmoor after the death of Frederick Winn Knight. When Castle Hill was largely destroyed by a fire in 1934, the Fortescue family moved to Simonsbath House whilst rebuilding was in progress. Lady Margaret devoted much time to attempting to put the Exmoor estate, purchased by her grandfather largely for his sporting interest, onto a profitable footing.Exmoor Oral History Archive The marriage was unsuccessful and eventually the couple were divorced and in 1966 she resumed the surname of Fortescue. She served as a Deputy Lieutenant of Devon.Obituary, Daily Telegraph newspaper, 21 Jun 2013 In 2001 she gave a lengthy interview for the Exmoor Oral History Archive of the Dulverton and District Civic Society, which provides a valuable insight into many aspects of modern Devon history."]}, {"page": "Superlative Stakes", "response": ["The event was formerly known as the Bernard van Cutsem Stakes. It was named in memory of Bernard van Cutsem, a successful racehorse trainer who died in 1975."]}, {"page": "Blue Riband Trial Stakes", "response": ["| width=180px | Bernard van Cutsem", "| Bernard van Cutsem", "| Bernard van Cutsem"]}, {"page": "Nell Gwyn Stakes", "response": ["| Bernard van Cutsem"]}, {"page": "Craven Stakes", "response": ["| Bernard van Cutsem"]}, {"page": "McCorquodale", "response": ["***** Sarah McCorquodale m. Geoffrey van Cutsem, son of Bernard van Cutsem."]}, {"page": "Seaton Delaval Stakes", "response": ["| Bernard van Cutsem"]}, {"page": "Castle Hill, Filleigh", "response": ["The last Earl Fortescue to own Castle Hill was Hugh Fortescue, 5th Earl Fortescue (1888–1958) who died in June 1958, aged 70. As he had no surviving male issue he was succeeded in the earldom by his younger brother, Denzil Fortescue, 6th Earl Fortescue. However the 5th Earl bequeathed Castle Hill, his principal seat, to his elder surviving daughter, Lady Margaret Fortescue (born 1923). Lady Margaret had married in 1948 Bernard van Cutsem, and had issue. It is now the home of her daughter Eleanor, Countess of Arran (b. 1949), who married on 28 September 1974 Arthur Gore, 9th Earl of Arran (b. 1938). She was awarded the MBE in the Queen's Birthday Honours 2008. They have two daughters, Lady Laura Duckworth-Chad and Lady Lucy Fortescue-Gore."]}, {"page": "Weare Giffard", "response": ["In 1454 Sir Martin Fortescue (d. 1472), second son of Sir John Fortescue (1395–1485), Chief Justice, of Ebrington Manor in Gloucestershire, married Elizabeth Densyll, the daughter and heiress of Richard Densyll of Weare Giffard and Filleigh, and thereby the manor became a possession of the Fortescue family, together with substantial other Densyll manors including East Buckland, Bray (both adjacent to Filleigh), Buckland Filleigh, Combe and Tamerton. The Filleigh Estate, comprising some 5,500 acres (22 km2), together with Castle Hill mansion is still today privately owned by descendants of the Fortescue family. The last Earl Fortescue to own Castle Hill was Hugh Fortescue, 5th Earl Fortescue (1888–1958) who died in June 1958, aged 70. As he had no surviving male issue he was succeeded in the earldom by his younger brother, Denzil Fortescue, 6th Earl Fortescue. However the 5th Earl bequeathed Castle Hill, his principal seat, to his elder surviving daughter, Lady Margaret Fortescue (b. 1923) and bequeathed Weare Giffard to his younger daughter Lady Elizabeth Fortescue (b. 1926),Lauder, R., op.cit. p.80 who sold the manor in 1960. Lady Margaret had married in 1948 Bernard van Cutsem, and had issue. Castle Hill is now the home of her daughter Eleanor, Countess of Arran (b. 1949), who married on 28 September 1974 Arthur Gore, 9th Earl of Arran (b. 1938). Lady Elizabeth married in 1946 Major William Lloyd (John) Baxendale, Coldstream Guards, of Hailwell House, Framfield, Uckfield, Sussex, and had issue:Debrett's Peerage, 1968, Earl Fortescue, p.461"]}, {"page": "City and Suburban Handicap", "response": ["|Bernard van Cutsem"]}, {"page": "Sharpen Up", "response": ["Sharpen Up was a chestnut horse standing 16.1 hands high with a white blaze and white socks on his hind legs bred and owned by Mimi van Cutsem. He was sired by the American stallion Atan, who was retired from racing after winning his only race. His dam, Rocchetta, was a full sister to Outcrop, the winner of the Yorkshire Oaks. Sharpen Up was trained throughout his racing career by Bernard van Cutsem at the Stanley House tables in Newmarket."]}, {"page": "Hugh van Cutsem", "response": ["Hugh Bernard Edward van Cutsem was born on 21 July 1941.Gordon Cramb, Hugh van Cutsem, countryman, 1941-2013, Financial Times, 6 September 2013Hugh van Cutsem, The Daily Telegraph, 3 September 2013 His father Bernard van Cutsem (1916–1975) was a millionaire horse-trainer and -breeder. His mother was Mary Compton, a descendant of the chiefly line of Clan Farquharson. The van Cutsems were Roman Catholics of Flemish origin who had moved to England in the nineteenth century. He was educated at Sunningdale School and Ampleforth College,‘van CUTSEM, Hugh Bernard Edward’, Who Was Who, A & C Black, an imprint of Bloomsbury Publishing plc, 1920–2016 a Roman Catholic boarding school in Ampleforth, North Yorkshire, and graduated from the University of Cambridge.Josh Duboff, William and Harry Join Prince Charles at Funeral of His Closest Friend, Vanity Fair, 11 September 2013 He then served as an officer in the Life Guards."]}, {"page": "1973 Prix de l'Arc de Triomphe", "response": ["| Bernard van Cutsem (GB)"]}, {"page": "Cellini (horse)", "response": ["On the death of Claiborne Farm's owner Arthur B. Hancock, Jr. in 1972 Cellini was offered for auction. He attracted strong interest from bidders including Alec Head and Bernard van Cutsem but was bought for $240,000 by the British Bloodstock Agency on behalf of Charles St George. The colt was sent to race in Europe and was sent into training with Vincent O'Brien at Ballydoyle. He was named after the sixteenth-century sculptor Benvenuto Cellini."]}, {"page": "1972 Prix de l'Arc de Triomphe", "response": ["| Bernard van Cutsem (GB)"]}, {"page": "Sharp Edge (horse)", "response": ["Sharp Edge began his racing career in the Kennett Maiden Stakes over six furlongs at Newbury Racecourse in July and won by one and a half lengths from the Bernard van Cutsem-trained favourite Noble Decree. On his next appearance, the colt won the Home Ales Stakes over the same distance at Nottingham Racecourse but was not particularly impressive as he had to be driven out to prevail by half a length from Prince Gourmet. In the New Ham Stakes at Goodwood Racecourse Sharp Edge won again, beating the Windsor Castle Stakes winner Adams Pet by a length. On his final appearance of the season, Sharp Edge was moved up in class and distance for the Royal Lodge Stakes over one mile at Ascot Racecourse. In a rough and unsatisfactory race, he was repeatedly blocked as he attempted to obtain a clear run before finishing strongly to take third place behind Adios and Noble Decree. The form of the race was subsequently boosted when Noble Decree won the Observer Gold Cup and in the winter of 1972/1973 British bookmakers made Sharp Edge the 8/1 second favourite for the 2000 Guineas."]}, {"page": "Van Cutsem", "response": ["*Bernard van Cutsem (1916–75), English racehorse breeder and trainer"]}, {"page": "Pearlyman", "response": ["Pearlyman had a distinctive white mark down his face. He was sired by Mandamus, a very useful one mile handicapper on the flat who was trained by Bernard van Cutsem. Pearlyman’s dam was a winning hurdler."]}]}}