{"wiki_id": "http://www.wikidata.org/entity/Q1606902", "itemLabel": "Inigo Triggs", "itemDescription": "British gardener", "wikipedia_url": "https://en.wikipedia.org/wiki/Inigo_Triggs", "wikipedia_page": {"main": "Henry Inigo Triggs (1876–1923) was an English country house architect and designer of formal gardens, and author.", "link_mentions": [{"page": "Haslemere", "response": ["Shepherd's Hill is the name belonging to the neighbourhood to the south of the town centre, which is accessed by three short roads, Shepherd's, College and Museum Hill. The area has large gardens and four listed buildings Broad Dene at Grade II*, features a round tower with conical roof and spike. It was built in 1900 for Walter Tyndale by William Frederick Unsworth, see Shakespeare Memorial Theatre; his business partner was Inigo Triggs. Substantial and sensitive masonry makes up the house, carefully recalling medieval solidity and enclosure.", "The limestone war memorial was designed by Inigo Triggs in 1920-21. It takes the form of a gabled stone cross, supported on an octagonal column, which in turn rests on a stepped stone base. It commemorates 62 local residents who died in WWI, whose names are inscribed on the plinth. The surnames of 47 people who died in the WWII are listed on bronze plaques. A restoration project, which included the repair and replacement of damaged stonework, partly funded by the War Memorials Trust, was undertaken in 2018."]}, {"page": "Liphook", "response": ["*Inigo Triggs (1876-1923), architect and designer, set up home in Liphook in 1910"]}, {"page": "Inigo", "response": ["*Inigo Triggs (1876–1923), British garden designer and author"]}, {"page": "Arthur Bryant Triggs", "response": ["Triggs was born in Chelsea, London, the son of James Triggs, carpet agent, and his wife Celia Anne, née Bryant. His younger brother was Inigo Triggs, the English country house architect and garden designer and author. The architect Inigo Jones was a distant relative."]}, {"page": "Saighton Grange", "response": ["The monastic buildings, other than the gatehouse, were demolished in 1861 and were replaced by a house designed by Edward Hodkinson for the 2nd Marquess of Westminster. Alterations were made to the house in about 1870–72 and again in 1894–96 by the Chester architect John Douglas for the 1st Duke of Westminster. In the 1880s the building was occupied by Earl Grosvenor. The garden were redesigned in 1901–02 by Harry Inigo Triggs. The buildings were converted into a school in 1977 and it now forms Abbey Gate College, which is an independent coeducational school for pupils aged 4–18."]}, {"page": "List of people from the London Borough of Hounslow", "response": ["*Inigo Triggs – architect and garden designer, born in Chiswick"]}, {"page": "Triggs", "response": ["* Inigo Triggs (1876–1923), English country house architect and author"]}, {"page": "St Michael and All Angels, Bedford Park", "response": ["The rood screen memorial was unveiled on 28 September 1918, on the eve of the Patronal Feast of St Michael and All Angels. The bronze plaque with the names of the 91 fallen was completed in 1919. The other memorial is just outside the church, by the church hall. It is in the form of a semi-circular stone bench, and is Grade II listed. Dedicated to the local victims of the First World War, it was designed by Inigo Triggs and completed around 1920. In the 1960s, the original nameplates were stolen, and when the memorial was re-sited in its current position, engraved stone replacements were installed. In June 2021, some of the replacement nameplates were again stolen.", "File:External semicircular stone WWI Memorial St Michael and All Angels Bedford Park.jpg|External semicircular stone war memorial by Inigo Triggs, c. 1920"]}, {"page": "Harry Inigo Triggs", "response": ["#REDIRECT Inigo Triggs"]}, {"page": "William Frederick Unsworth", "response": ["Around 1908 he moved to Steep, near Petersfield, where he worked in partnership with his son, Gerald Unsworth (1883-1946) and Inigo Triggs (1876-1923). He then built several houses in the Arts and Crafts style.", "* Broad Dene, Hill Road built for Walter Tyndale by the architectural firm comprising WF Unsworth, his son and Inigo Triggs  Sir Lawrence Weaver,  Small country houses of to- day , volume 1, , The Offices of Country Life, London, 1922.( read online ) "]}]}}