{"wiki_id": "http://www.wikidata.org/entity/Q16012896", "itemLabel": "John Sutton", "itemDescription": "English geologist", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Sutton_(geologist)", "wikipedia_page": {"main": "John Sutton (8 July 1919 – 6 September 1992) was an English geologist.Born in London into the family that established Suttons Seeds, John's father was an engineer credited with inventing the motor lawn-mower, among other things, and his mother was a teacher of classics. In 1937 he began a general science degree at Imperial College, graduating in geology in 1941 with an Abbreviated Honours degree (not an Honours degree) for war service in the army.\nFrom 1946-1949 he undertook research on the Lewisian gneiss of N.W.Scotland with fellow student Janet Watson.\nHe was Dean of the Royal School of Mines (1965–68 and 1974–77); member of the BAS Scientific Advisory Committee (1970–85); member of NERC (1977–79); Chairman, British National Committee on Antarctic Research, from 1979.\nHe was elected President of the Geologists' Association for 1966–68. He was also elected a Fellow of the Royal Society in 1966, serving as their Vice-President in 1975.He died in 1992 and was buried in Martinstown, Dorset. He is commemorated by the Sutton Heights in Antarctica.", "link_mentions": [{"page": "Sutton (surname)", "response": ["*John Sutton of Lincoln (d. c. 1391), English politician", "*John Sutton, 1st Baron Dudley (1400–1487)", "*John Sutton (composer) (fl. 15th century), English composer", "*John Sutton (merchant) (1777–1863), founder of Suttons Seeds", "*John Sutton (actor) (1908–1963), British—Indian actor", "*John Sutton (baseball) (born 1952), American sportsperson", "*John Sutton (economist) (born 1948), British academic", "*John Sutton (geologist) (1919–1992), British geologist", "*John Sutton (hurler) (Irish name Seán de Sutún), Irish sportsperson", "*John Sutton (RAF officer) (1932–2014), British military officer", "*John Sutton (rugby league) (born 1984), Australian Rugby League player", "** John Sutton"]}, {"page": "John Sutton", "response": ["John Sutton may refer to:", "*John Sutton II (1310–1359), first Baron Sutton of Dudley", "*John Sutton III (1339–1370), 2nd Baron Sutton of Dudley", "*John Sutton IV (1361–1396), 3rd Baron Sutton of Dudley", "*John Sutton V (1380–1406), father of 1st Baron Dudley", "*John Sutton of Lincoln (died c. 1391), MP for Lincoln", "*John Sutton, 1st Baron Dudley (1400–1487), Lord Lieutenant of Ireland", "*John Sutton, 3rd Baron Dudley (1494–1553), mockingly known as Lord Quondam", "*John Sutton (baseball) (born 1952), former Major League Baseball pitcher", "*John Sutton (footballer) (born 1983), English footballer", "*John Sutton (rugby league) (born 1984), Australian professional rugby league footballer", "*John Sutton (hurler), retired Irish sportsperson", "*John Sutton (composer), English Renaissance composer", "*John Sutton (Royal Navy officer) (c.1758-1825)", "*John Sutton (seed merchant) (1777–1863), founder of Suttons Seeds", "*John Sutton Nettlefold (1792–1866), British industrialist", "*John Sutton, Baronet (1820–1873), Benefactor and patron in Kiedrich", "*John Sutton (actor) (1908–1963), British-Indian actor", "*John Sutton (geologist) (1919–1992), British geologist after which the Sutton Heights are named", "*John Sutton (RAF officer) (1932–2014)", "*John Sutton (economist) (born 1948), economist at the London School of Economics", "*Oliver Humperdink (John Sutton, 1949–2011), professional wrestling manager"]}, {"page": "Janet Watson", "response": ["She was born 1 September 1923 in Hampstead, London. Her father; David M. S. Watson FRS was a vertebrate palaeontologist and a professor of zoology and comparative anatomy at the University of London. Her mother; Katharine M. Parker, did research in embryology prior to marriage. Janet Watson grew up alongside her sister, Katharine Mary in South Hampstead where she attended South Hampstead High School, which was known for being specialised in teaching science. She then went on to attend Reading University in 1943 to learn about General Science. Watson graduated with a first class honours degree in biology and geology in 1943. After a convincing recommendation from Professor H.L Hawkins and a first class General Honours degree, Watson attended Imperial College. She graduated in 1947 with a first class honours in Geology. Watson married John Sutton in 1949 and they had a professional partnership throughout their lives. They had two daughters who both had died at birth. Watson died on 29 March 1985, at the age of 61.", "After her graduation in 1943, Watson began working at the National Institute for Research in Dairying. She observed chicken growth and their diets. She became bored with her job and went on to teach biology at Wentworth School, Bournemouth before deciding to become a geologist by the end of World War II. She applied to Imperial College in 1945, completing her B.Sc in Geology in 1947, again getting a first class degree. Prior to graduating, Janet's interest in geology was spurred after working on a mapping project in the Scottish Highlands in 1946. Watson enrolled for her PhD in 1947 and began studying the Lewisian Complex in northern Scotland. After her second graduation, the then head of department, Herbert Harold Read, took her on as his student and set her to work on the migmatites of Sutherland. She then began to work on the Lewisian complex of northwestern Scotland together with John Sutton, another of Read's research students. The two completed their Ph.D theses in 1949 followed by a wedding and honeymoon in the Channel Islands, which explains a joint publication on the geology of Sark a few years later.", "After receiving her PhD in 1949, Janet and her husband; John Sutton, continued their involvement with Imperial College. They published their thesis work in a paper in 1951, that had a major impact on the study of Precambrian basement complexes, by showing that it was possible to understand their metamorphic and structural development as a series of discrete orogenic events that could be discerned in the field. They proposed that an older Archaean Scourian complex, had been partially reworked by a younger Paleoproterozoic Laxfordian orogenic event, as shown by its effect on a set of dolerite dykes, known as the Scourie dykes. Subsequent fieldwork, metamorphic studies and radiometric dating has refined their chronology but supported their original hypothesis.", "In 1952, Janet worked under H.H. Read as a Research Assistant, until 1973 when she became a Senior Lecturer. They continued to work together on other aspects of the Precambrian geology of Scotland, including the Moine, Dalradian and Torridonian. John Sutton became head of department at Imperial College in 1964 and from then on their joint publications became less frequent. Watson published an introductory textbook Beginning geology with her former Ph.D supervisor H.H. Read in 1966, followed by Introduction to Geology: Volume 1 Principles in 1968 and Introduction to geology Volume2 Earth history: Part 1 Early Stages of Earth History and Part 2 Later Stages of Earth History in 1975.", "* Lyell Fund – awarded jointly with John Sutton 1954", "* Bigsby Medal – awarded jointly with John Sutton 1965"]}, {"page": "List of fellows of the Royal Society S, T, U, V", "response": ["|John Sutton||17/03/1966||8 July 1919 – 6 September 1992 Geologist"]}, {"page": "Sutton Heights", "response": ["Sutton Heights () is an eminence rising to about 800 m lying between the Lassus Mountains and Debussy Heights, in the northern portion of Alexander Island, Antarctica. The area was photographed from the air by Ronne Antarctic Research Expedition in 1947, mapped from air photographs by Falkland Islands Dependencies Survey in 1959, and surveyed by the British Antarctic Survey in 1975–76. They are named after John Sutton, Professor of Geology, at Imperial College of Science and Technology, London, who studied the area from 1958 to 1973."]}, {"page": "List of fellows of the Royal Society elected in 1966", "response": ["#John Sutton"]}, {"page": "David Williams (geologist, born 1898)", "response": ["He was the Head of the Department of Geology at Imperial College London from 1950 to 1964; his predecessor as Head was H. H. Read and his successor was John Sutton."]}, {"page": "List of fellows of Imperial College London", "response": ["* John Sutton", "* Alfred John Sutton Pippard"]}]}}