{"wiki_id": "http://www.wikidata.org/entity/Q16031562", "itemLabel": "William Monk Gould", "itemDescription": "British composer", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Monk_Gould", "wikipedia_page": {"main": "William Monk Gould, (1856–7 April 1923) was a British composer of light music: his popular song The Curfew (1898) was particularly well-known.Monk was born in Tavistock, becoming organist at Rye parish church when only 12 years old. He later served as organist and choirmaster at St Michaels' Church, Portsmouth. He published 56 compositions between 1883 and 1920.  He married Agnes Hilton Skinner (died 1937), and they had a son, Rupert Gould who achieved fame as a horologist and scientific broadcaster.  Another son was Henry Hilton Monk Gould.He died 7 April 1923 in Portsmouth.", "link_mentions": [{"page": "Rupert Gould", "response": ["Gould grew up in Southsea, near Portsmouth, where his father, William Monk Gould, was a music teacher, organist, and composer. He was educated at Eastman's Royal Naval Academy and then, from 15 January 1906 on, he attended the Royal Naval College, Osborne, and then the Royal Naval College, Dartmouth, being part of the 'Greynville' term (group), and by Easter 1907, examinations placed him at the top of his class. He became a midshipman, and thereby a naval officer, on 15 May 1907. He initially served on HMS Formidable and HMS Queen (under Captain David Beatty) in the Mediterranean. Subsequently, he was posted to China (first aboard HMS Kinsha and then HMS Bramble). He chose the \"navigation\" career track and, after qualifying as a navigation officer, served on HMS King George V, and HMS Achates until near the outbreak of World War I, at which time he suffered a nervous breakdown and went on medical leave. During his lengthy recuperation, he was stationed at the Hydrographer's Department at the Admiralty, where he became an expert on various aspects of naval history, cartography, and expeditions of the polar regions. In 1919 he was promoted to Lieutenant-Commander (retired)."]}, {"page": "William Gould", "response": ["* William Monk Gould (1856–1923), British composer of light music"]}]}}