{"wiki_id": "http://www.wikidata.org/entity/Q16012127", "itemLabel": "Anthony Minoprio", "itemDescription": "architect and town planner", "wikipedia_url": "https://en.wikipedia.org/wiki/Anthony_Minoprio", "wikipedia_page": {"main": "Sir Charles Anthony Minoprio (1900–1988) was a British architect and town planner. Much of his early work was in partnership with Hugh Spencely (1900–1983), a friend since they attended Harrow School together. Later he worked more as a town planner, particularly the New Town of Crawley.\n\n", "link_mentions": [{"page": "Crawley", "response": ["In May 1946, the New Towns Act of 1946 identified Crawley as a suitable location for a New Town; but it was not officially designated as such until . The  of land set aside for the new town were split across the county borders between East Sussex, West Sussex and Surrey. Architect Thomas Bennett was appointed chairman of Crawley Development Corporation. A court challenge to the designation order meant that plans were not officially confirmed until December 1947. By this time, an initial plan for the development of the area had been drawn up by Anthony Minoprio. This proposed filling in the gaps between the villages of Crawley, Ifield and Three Bridges. Bennett estimated that planning, designing and building the town, and increasing its population from the existing 9,500 to 40,000, would take 15 years."]}, {"page": "Southgate, West Sussex", "response": ["Crawley was designated as a New Town in January 1947 after the New Towns Act 1946 identified it as a suitable site for one.  A Development Corporation was formed, led by the architect Thomas Bennett, and planner Anthony Minoprio provided a master plan for the town's development.  He proposed a double ring of nine neighbourhoods surrounding an extended town centre. Southgate was to form the southern part of the inner ring, between the town centre and the southern section of the planned Crawley ring road (which already existed, formed by Crawley and Southgate Avenues).  Its built-up area, excluding Goffs Park—which would lie within the neighbourhood's northwest corner—was to be .", "Modern Southgate is primarily residential, and the area was mostly undeveloped before the New Town was created.  Nevertheless, some commercial and industrial development existed around the Brighton Road and railway line, and farming provided employment.  Two sets of local shops serve the modern neighbourhood, but its proximity to Crawley town centre and main transport routes mean that, as intended in Anthony Minoprio's masterplan, residents travel outside Southgate for most of their employment and shopping requirements."]}, {"page": "West Green, West Sussex", "response": ["Crawley was designated as a New Town in January 1947 after the New Towns Act 1946 identified it as a suitable site for one.  Crawley Development Corporation was formed, led by the architect Thomas Bennett, and planner Anthony Minoprio provided a master plan for the town's development. He proposed a double ring of nine neighbourhoods surrounding an extended town centre; West Green was to be one of the inner ring of four, and the first to be built. By 1949, when building work started, West Green's population was about 2,000—mainly concentrated in the area between Ifield Road and the railway line—and the Development Corporation had to consider how to fit new development around this."]}, {"page": "Whitgift Centre", "response": ["The centre was designed by Anthony Minoprio and built between 1965 and 1970 by Fitzroy Robinson & Partners.  Commenting in 1971, architectural historians Ian Nairn and Nikolaus Pevsner stated that \"most of the architectural details are banal, but the centre functions unusually well as a shopping precinct\".", "Category:Anthony Minoprio buildings"]}, {"page": "Northgate, West Sussex", "response": ["Crawley was designated as a New Town in January 1947 after the New Towns Act 1946 identified it as a suitable site for one.  Crawley Development Corporation was formed, led by the architect Thomas Bennett, and planner Anthony Minoprio provided a master plan for the town's development.  He proposed a double ring of nine neighbourhoods surrounding an extended town centre.  Northgate was to form the northern part of the inner ring, between the town centre and the northern section of the planned Crawley ring road.", "The designated area of Crawley New Town according to Anthony Minoprio's masterplan was , of which  was to be developed at first.  Northgate was to cover  immediately north of the expanded town centre.  Anticlockwise from the south, the neighbourhood is bounded by The Boulevard (forming the northern limit of the town centre), Northgate Avenue (the A2004), Crawley Avenue (the A2011) and London Road, historically the main north–south route through the town but now bypassed and downgraded."]}, {"page": "Thomas Bennett (architect)", "response": ["In 1947, he was appointed as the Chairman of the Development Corporation of Crawley New Town, in West Sussex, a post he held until 1960. In his early days at the Development Corporation, he was responsible for the scrapping of the existing plans for the New Town, and the appointment of Sir Anthony Minoprio to create a new master plan. When the town was built, a new comprehensive school was named for him, opening in 1958. He also took over responsibility for the Stevenage New Town which had been initially the responsibility of Monica Felton."]}, {"page": "List of Old Harrovians", "response": ["*Sir Anthony Minoprio (1900–1988), British architect and town planner who worked on the Crawley new town"]}]}}