{"wiki_id": "http://www.wikidata.org/entity/Q1606992", "itemLabel": "Rose Coghlan", "itemDescription": "English actress (1851-1932)", "wikipedia_url": "https://en.wikipedia.org/wiki/Rose_Coghlan", "wikipedia_page": {"main": "Rosamond Marie Coghlan (March 18, 1851 – April 2, 1932) was an English actress.\nCoghlan was born in Peterborough, England, to author Francis Coghlan, and Anna Marie, née Kirby. Her elder brother (or half-brother) was the actor Charles Francis Coghlan. Her niece was Gertrude Coghlan. Rose went to America in 1871 as part of Lydia Thompson's troupe touring the U.S.. She made her Broadway debut in 1872 in a musical. Coghlan was again in England from 1873 to 1877, playing with Barry Sullivan, and then returned to America. She became prominent as Countess Zicka in Diplomacy, and Stephanie in Forget-me-not. She was at Wallack's almost continuously until 1888, and subsequently appeared in melodrama in parts like the title-role of The Sporting Duchess.  \n\nFollowing the 1899 death of her brother, Charles Coghlan, in 1901 Rose appeared at Denver, Colorado's, Elitch Theatre in the world premiere of her brother's play, Fortune's Bridge. Rose stated that \"my particular reason for coming to Denver was to produce my brother's play -- the one he finished just before his death. It's called Fortune's Bridge, but he didn't give it the name.\"  Rose explained that the manuscript was sent to a typist and at the end her brother signed it and added his Canadian address: \"Charles Coghlan, Fortune Bridge.\" Apparently the typist moved it to the head of the first page and typed, \"Fortune's Bridge, by Charles Coghlan.\"  Rose stated \"the name seemed to fit the play so well I allowed it to stand.\"Coghlan died in 1932 in Harrison, New York. She had been married twice first to Clinton J. Edgerly from 1885 to 1890 and second to John T. Sullivan from 1890 to 1893.  She had two children, an adopted daughter and a son.     \n\n", "link_mentions": [{"page": "1932", "response": ["**Rose Coghlan, English actress (b. 1851)"]}, {"page": "1851", "response": ["right|thumb|110px|Rose Coghlan, 1870s", "** Rose Coghlan, English actress (d. 1932)"]}, {"page": "A Woman of No Importance", "response": ["The Internet Broadway Database records two New York productions of A Woman of No Importance. Maurice Barrymore and Rose Coghlan played Illingworth and Mrs Arbuthnot in an 1893–94 production, and Holbrook Blinn and Margaret Anglin starred in the roles in 1916.\"A Woman of No Importance\", Internet Broadway Database. Retrieved 15 April 2021; and \"Wilde to Aid of Shakespeare Again\", The Sun, 25 April 1916, p. 5 Robert Brough and his company presented the first Australian production in 1897.\"Criterion Theatre\", Truth, 10 January 1897, p. 2 Les Archives du spectacle record no performances of the play in France, in contrast with Wilde's other three drawing room plays, which have all been staged in translation on various occasions.\"Une femme sans importance\", \"L'Éventail de Lady Windermere\", \"Un mari idéal and \"L'Importance d'être Constant\", Les Archives du spectacle. Retrieved 15 April 2021"]}, {"page": "List of William Shakespeare screen adaptations", "response": ["|The film brings stage star Rose Coghlan to the screen for her motion picture debut. At 61–62, Coghlan is an older Rosalind than usual. Filmed mainly outdoors."]}, {"page": "Charles Francis Coghlan", "response": ["In 1876 Augustin Daly brought Coghlan to America where he would spend the greater balance of his career.  He made his Broadway debut on September 12, 1876, at the Fifth Avenue Theater, as Alfred Evelyn in Lord Lytton's \"Money\" and was an instant success. Two months later, at the same venue, Coghlan played Orlando opposite Fanny Davenport's Rosalind in Shakespeare's As You Like It.Shakespeare On the Stage by William Winter 1915, pg. 262 The next season Coghlan was engaged as the leading man at the Union Square Theater, where he played Jean Remind during the successful run of Augustus R. Cazauran's The Celebrated Case.  He returned to London in 1881 to play Col. Woods, U.S.A. in the long-running \"The Colonel\" produced at the Prince of Wales. On December 13, 1890 Coughlan was declared bankruptDaily Alta California, Volume 83, Number 167, 14 December 1890 He had liabilities of  £315.San Francisco Call, Volume 69, Number 61, 30 January 1891 The pinnacle of Coghlan's near twenty-five-year career in America came on December 2, 1898, at the Fifth Avenue Theater in his own adaptation of the Dumas’ play Kean titled The Royal Box, in which he played the part of the actor Clarence. This great success was tempered the following year by the failure of his play \"Citizen Pierre\", in which he made his last New York performance. During his career Coghlan had played opposite his sister, Rose Coghlan, and in support of Lillie Langtry and Minnie Maddern Fiske. His last appearance on the stage was at Houston, Texas, on October 28, 1899, as Clarence in \"The Royal Box\".", "Actress Louisa Elizabeth Thorn, a native of London, England,1871-1881 England Census Records (Charles Coghlan)  was apparently Charles Coghlan's common-law wife for twenty-five years or more and the mother of his daughter Gertrude Coghlan. When in 1893 Coghlan married nineteen-year-old Kühne Beveridge,[Various birthdates are given for her from 1874 to 1878; she was still living as of May 1916 in Munich, Germany] a promising sculptor and aspiring actress from a prominent Illinois family, questions arose about his former marital status.Charles Coghlan's Young Wife - New York Times; October 27, 1893;  pg. 2;  Rose Coghlan soon came to her brother's defense stating she had known for years that Louisa and Charles never legally married.Not Charles Coghlan's Wife. - New York Times; November 4, 1893; pg. 1  Not long afterwards though, Rose decided to dissolve the business partnership she had with her brother.Brotherly Charles Coghlan. - New York Times ; December 3, 1893; pg. 16; Upon learning of her father's marriage, an upset Gertrude Coghlan reportedly told the press, \"I am Charles Coghlan’s adopted daughter and not related to him in any way.\"The Galveston Daily News, December 10, 1893 pg. 9 Perhaps as an attempt to save his daughter the stigma of an illegitimate  birth, Coghlan later supported Gertrude's claim that she was adopted, just not legally through the courts.Charles Coghlan Explains The Young Actress Who Bears His Name is His Daughter, He Says (Arts & Entertainment) -The Daily Inter Ocean (Chicago, IL) Monday, October 30, 1893; pg. 4 Within a year of his marriage Coghlan would return to Louisa leaving Beveridge to seek an absolute divorce on the grounds of desertion.Coghlan with His First Wife. -  New York Times; June 18, 1894; Pg. 1Otherwise Unnoticed - The Herald-Dispatch, Decatur, Illinois, September 15, 1894; Pg. 17  A few years later Gertrude joined her father's company playing Juliet in the Broadway production of the Royal Box and afterwards on the road.Inherited Talent for the Stage Sons and Daughters of Well-Known Actors Who Are Winning Fame for Themselves upon the Stage -  The Milwaukee Sentinel, September 18, 1898; pg. 3; Gertrude Coghlan, who took to the stage at age sixteen, would go on to have a theatrical career spanning nearly fifty years.Gertrude Coghlan,\" Former Actress, 73  - New York Times; September 13, 1952; pg. 17;", "The stage actor and director, Charles F. Coghlan (1896–1971), was often thought to be Coghlan's son, in fact he was his nephew, the son of the mezzo-soprano singer Elizabeth \"Eily\" Coghlan. She died in April 1900 at the age of thirty-six leaving Charles to be adopted by her sister, Rose Coghlan. Charles’ father, according to his mother's New York Times obituary, was Sydney Battam or Bratton, a London banker. At the time of his wife's death, Battam was living in London with their twelve-year-old daughter, while four-year-old Charles was with his mother in America.The Theatre Magazine vol. 21-22; 1915, pg. 132Miss Coghlan Dead.- New York Times - April 9, 1900;  pg. 2 At least one family researcher has made the claim that Charles F. Coghlan was the illegitimate son of Rose Coghlan and her one-time lover the future King Edward VII of England.Charles Coghlan – Ancestry.com", "*Jocelyn (1889) starring Rose Coghlan.The History of the New York Stage 1903 pg. 582", "*The Check Book (1894) starring Rose Coghlan.Miss Coghlan in \"The Check Book.\"; The Popular Actress Begins a Summer Term at the Madison Square New York Times May 10, 1894"]}, {"page": "Elizabeth Crocker Bowers", "response": ["Her subsequent retirement in Philadelphia was interrupted by a return to the stage in October 1886 for several years.  She organized a new dramatic company, and visited the principal cities of the U.S., playing many of her old and favorite characters. Under A. M. Palmer's management she appeared in Lady Windermere's Fan (1893), and later she was a supporting actress for Rose Coghlan and Olga Nethersole."]}, {"page": "Charles F. Coghlan (actor, born 1896)", "response": ["Coghlan born in Boston, Massachusetts, was the alleged son of Charles Francis Coghlan and nephew of Rose Coghlan.Silent Film Necrology p. 97 2ndedition c.2001 by Eugene M. Vazzana  Another source has it that Charles F. Coghlan is the son of Elizabeth \"Eily\" Coghlan, another sister of Charles Francis Coghlan and Rose Coghlan, and a man named Sydney Battam or Bratton. The story has it that Elizabeth \"Eily\" died in 1900 and Charles F. was adopted by Rose Coghlan. Still another angle has Charles F. being the result of an affair between Rose Coghlan and the Prince of Wales (aka Edward VII). Whatever his origins, Charles F. Coghlan bears a strong resemblance to Rose Coghlan and is buried in the same plot with her. A relative Gertrude Coghlan was the daughter of Rose's brother Charles Coghlan.  "]}, {"page": "1851 in the United Kingdom", "response": ["* 18 March – Rose Coghlan, actress (died 1932)"]}, {"page": "Wallack's Theatre", "response": ["During the summer of 1888, the interior was largely redesigned and reconstructed to improve sightlines and add seats. On August 27, 1888, the theater opened with Theodore Moss as proprietor and Charles Burnham as manager. Johnson & Slavin's minstrels, Lydia Thompson, John W. Albaugh, Henry E. Dixey, Annie Pixley, Marie Wainwright, Fanny Davenport, John Wild, Benoît–Constant Coquelin, Rose Coghlan, and Robson and Crane appeared, and attractions included Boston's Howard Athenaeum Specialty Company and The Crystal Slipper from the Chicago Opera House.", "The new theater was dedicated January 4, 1882, \"with a magnificent revival of The School for Scandal, which had an exceptionally fine cast\" led by John Gilbert and Rose Coghlan. As in the past, the treasurer was Theodore Moss.", "Among the performers appearing at Palmer's Theatre were Benoît–Constant Coquelin and Jane Hading, Richard Mansfield, Rose Coghlan, Mary Anderson, Mrs. James Brown–Potter, Charles Wyndham, Tommaso Salvini, E. S. Willard, Marie Wainwright, John Drew (Jr.), Maude Adams, Annie Russell, Lillie Langtry, Julia Marlowe, and Georgia Cayvan.", "The last performance at Wallack's 30th Street theater occurred on Saturday night, May 1, 1915, when Barker's company presented Androcles and the Lion and The Man Who Married a Dumb Wife. Following the plays, an epilogue written for the occasion by Oliver Herford was read by Rose Coghlan, the leading lady on opening night in 1882."]}, {"page": "Phyllis Rankin", "response": ["Rose Coghlan obtained Rankin to replace Jennie Yeamans in an 1892 production of The Check Book.Theatrical Gossip, New York Times, April 19, 1892, pg. 8. In April 1893 she appeared in the Arabian Nights on a variety bill at the Standard Theatre,Display Ad 11-No Title, New York Times, April 23, 1893, pg. 7. 6th Avenue between 32nd Street and 33rd Street,EJ Phillips' Manhattan, Standard Theatre. Retrieved on 12-24-07."]}, {"page": "Stella Weaver", "response": ["The daughter of George C. Boniface, Weaver went on stage as a youth. Her fellow actors included Sol Smith Russell, John Edward McCullough, John T. Raymond, and Lawrence Barrett. In 1878 Weaver teamed with Charles Coghlan, Rose Coghlan, and John Gibbs Gilbert in The Snowball.  The same year she was featured in Our Girls by H.J. Byron and appeared with Maurice Barrymore in a revival of The Shaughraun. She acted with"]}, {"page": "Lydia Thompson", "response": ["Thompson's troupe, called the \"British Blondes\", was the most popular entertainment in New York during the 1868–1869 theatrical season: \"The eccentricities of pantomime and burlesque – with their curious combination of comedy, parody, satire, improvisation, song and dance, variety acts, cross-dressing, extravagant stage effects, risqué jokes and saucy costumes – while familiar enough to British audiences, took New York by storm.\"\"Amusements. Theatrical. Wood's Museum.\" The New York Times, 1 October 1868 (review of Ixion). The six-month tour was extended to almost six years, and during two subsequent tours the British Blondes drew large crowds at leading theatres across the US. The troupe launched the careers of several actors, including Markham, Alice Burville, Lisa Weber and Rose Coghlan, and of comedian Willie Edouin. It also drew fierce criticism from those who felt it transgressed the boundaries of propriety. Burlesques, colloquially referred to as leg-shows, started off tame, clever and sophisticated, drawing in all types of people, especially women. Unfortunately, “the female audiences for burlesque did not last for long. In the summer of 1869 a wave of ‘anti-burlesque hysteria’ in the New York press frightened away the middle-class audiences that had initially been drawn to Ixion and sent the Thompson troupe prematurely packing for a national tour”.Dudden, Faye E. \"The Rise of the Leg Show\", Women in the American Theatre: Actresses and Audeiences, New Haven, Yale UP (1994) After this untimely closure, the hatred toward American burlesque continued to grow. Thompson's shows were described as a “disgraceful spectacle of padded legs jiggling and wriggling in the insensate follies and indecencies of the hour”.Moses, Marlie. \"Lydia Thompson and The ‘British Blondes’.\", Women in the American theatre, New York, Crown (1981) Times called their shows “an idiotic parody of masculinity”. Shakespeare scholar Richard Grant White, called burlesque “monstrously incongruous and unnatural”.Allen, Robert C.  \"Horrible Prettiness: A Cultural Analysis of ‘British Blondes’.\", Women in the American Theatre, New York, Crown (1981) The New York Times constantly expressed its disgust of burlesque, even headlining an article with the plea “Exit British Burlesque”."]}, {"page": "Rosalind (As You Like It)", "response": ["Rosalind has been played by various notable actresses on film including Rose Coghlan in 1912, Elizabeth Bergner in a 1936 film opposite Laurence Olivier as Orlando,Elizabeth Bergner Emma Croft in 1992, and Bryce Dallas Howard in the 2006 production directed by Kenneth Branagh. Branagh felt that the character of Rosalind talked too much in the original play and thus cut many of Rosalind's lines in his Japan-set adaptation. Howard was nominated for a Golden Globe for her performance as Rosalind."]}, {"page": "Helen Barry", "response": ["In 1889 Barry returned to New York, where she appeared in Love and Liberty at the Union Square Theatre.Helen Barry in Life and Love, NYPL Digital Gallery, accessed 1 February 2012\"Miss Helen Barry in America\", The Era, 19 January 1889, p. 12 In 1891, she starred in and produced A Night's Frolic, by Augustus Thomas, at the Park Theatre in New York City.  In 1892, she sued Rose Coghlan in New York State court for copyright infringement, claiming that Coghlan's play Dorothy's Dilemma appropriated whole scenes from her production.\"In and About the City: Rose Coughlin Must Answer\", The New York Times, 26 January 1892, accessed 26 June 2012 She was also involved in a court case in London that year but was acting in America in 1895.  "]}, {"page": "Henry Edwards (entomologist)", "response": ["Edwards appeared in early 1882 at Palmer's Theatre on Broadway and West 30th Street in a production of the English comedy The School for Scandal. Wallack stalwart John Gibbs Gilbert reached the height of his fame in the production, playing Sir Peter Teazle. As Sir Oliver Surface, Edwards, too, was lauded—Gilbert and Edwards shared the stage with Stella Boniface, Osmond Tearle, Gerald Eyre, Madame Ponisi and Rose Coghlan.", "A testimonial production of Hamlet was mounted at the Metropolitan Opera House on 21 May 1888, to celebrate the life and accomplishments of an ageing Lester Wallack, and to raise money to ease the chronic sciatica that arrested his career. \"One of the greatest casts ever assembled\" was formed into a company composed of Edwards as the priest, Edwin Booth as Hamlet, Lawrence Barrett as the ghost, Frank Mayo as the king, John Gibbs Gilbert as Polonius, Rose Coghlan as the player queen and Helena Modjeska as Ophelia. Other stars made cameo appearances, and Wallack was assisted up onto the stage to address the standing room crowd at intermission. Notables such as Mayor Hewitt and General Sherman were in attendance. More than $10,000 was raised for Wallack's care. In the following months, Edwards teamed with other actors and Wallack's wife to help him write his memoir; Wallack died in September."]}, {"page": "The Passing Show", "response": ["The revue opened at the  Casino Theatre on May 12, 1894 and ran for 145 performances before touring in the US. The piece burlesqued theatrical productions of the past season.  Among many other sketches, Paul Arthur spoofed Henry Miller, Adele Ritchie portrayed the singer Rosamund, Gus Pixley parodied Rummel, Grace Filkins parodied Rose Coghlan, Mrs. Kendal and Ada Rehan, and Mabel Stephenson appeared as Hannele in a parody of the Kilyani films.  John E. Henshaw and Queenie Vassar (later replaced by Madge Lessing) played, respectively, the character Laf Quickstep and Chollie Keal."]}, {"page": "Coghlan (surname)", "response": ["*Rose Coghlan"]}, {"page": "Howard Kyle", "response": ["Kyle's debuted as Guildenstern and the Second Grave Digger in Shakespeare's Hamlet at the Meyer's Opera House in Janesville, Wisconsin, on September 10, 1884. He spent the following twelve seasons in tours with a number of large classical repertory companies and made his first appearance in New York  in 1887 at the Windsor Theatre as Lucius in the James Sheridan Knowles play Virginius. During the mid-1890s Kyle played leading man roles with stock companies in Salt Lake City, Pittsburg and San Francisco. In late 1897 Kyle began a two-year run at the Manhattan Theatre and national tour of the Grismer and Parker pastoral play Way Down East, playing David Bartlett to Phoebe Davies' Anna Moore. During the season of 1900/01 he played the title role in a successful tour of the Clyde Fitch romantic drama Nathan Hale, with co-star Nanette Comstock as Alice Adams. Kyle was Sir Jasper Thorndyke, the lead character in a 1904 tour of Louis Parker's four-act comedy, Rosemary, and the next year played the title role in a tour of Louis Shipman's adaptation of the Frederic Remington western, John Ermine of the Yellowstone. Kyle later toured with Rose Coghlan's company playing Henry Beauclerc to Coghlan's Countess Zicka in the Victorien Sardou play Diplomacy.Howard Kyle, Internet Broadway Database Retrieved August 5, 2013"]}, {"page": "Frederic De Belleville", "response": ["He began his career in 1873 in London and arrived in the United States in 1880. An early newspaper account records him as starring in a play False Friend for A. M. Palmer.Chicago Daily Tribune, December 12, 1880 \"FALSE FRIEND, One Week Only\" He was long a leading man on the stage to Clara Morris, Rose Coghlan, Mrs. Fiske and Viola Allen.Great Actors & Actresses of the American Stage, in Historic Photographs p.37 c.1983 edited by Stanley Appelbaum De Belleville appeared in three silent films."]}, {"page": "Notable American Women, 1607–1950", "response": ["* Rose Coghlan"]}, {"page": "As You Like It (1912 film)", "response": ["As You Like It is a 1912 American silent film based on the play of the same name by William Shakespeare. It was directed by J. Stuart Blackton, Charles Kent, and James Young, and was produced by the Vitagraph Company. The film brings stage star Rose Coghlan to the screen for her motion picture debut alongside costar Maurice Costello. At 61 or 62 Coghlan is an older Rosalind than usual."]}, {"page": "The Sporting Duchess (1915 film)", "response": ["The Sporting Duchess is a lostThe Library of Congress/FIAF American Silent Feature Film Survival Catalog:The Sporting Duchess 1915 silent film drama directed by Barry O'Neil and starring Rose Coghlan and Ethel Clayton. It was produced by the Lubin Manufacturing Company.The Sporting Duchess at silentera.comThe AFI Catalog of Feature Films:The Sporting Duchess", "*Rose Coghlan - The Sporting Duchess"]}, {"page": "The White Heather (play)", "response": ["*Lady Janet Maclintock by Rose Coghlan"]}, {"page": "Maida Craigen", "response": ["In 1889 Craigen starred in two plays by William Shakespeare at the Broadway Theatre in New York with Edwin Booth and Helena Modjeska; playing Jessica in The Merchant of Venice with Booth as Shylock and Modjeska as Portia, and playing Hero in Much Ado About Nothing with Booth as Benedick and Modjeska as Beatrice.\"Broadway Theatre\" New York Amusement Gazette (October 28, 1889): 1. That same year she starred in Brander Matthews's The Silent System with Benoît-Constant Coquelin. In 1891 she appeared in As You Like It in New York, alongside Viola Allen, Maurice Barrymore, and Rose Coghlan, among others.\"As You Like It\" The Illustrated American (July 4, 1891): 295."]}, {"page": "Alice Atherton", "response": ["This launched her career and that of several actresses, including Lisa Weber, and Rose Coghlan.  It also drew fierce criticism from those who felt it transgressed the boundaries of propriety at the time. Burlesques, colloquially referred to as leg-shows, started off very tame, clever, and sophisticated, drawing in all types of people, especially women. Unfortunately, “the female audiences for burlesque did not last for long. In the summer of 1869 a wave of ‘anti-burlesque hysteria’ in the New York press frightened away the middle-class audiences that had initially been drawn to Ixion and sent the Thompson troupe prematurely packing on a tour around the United States and Canada."]}, {"page": "Diplomacy (play)", "response": ["*Rose Coghlan as Countess Zicka"]}, {"page": "Alexander De Soto", "response": ["In their formative years, the Wayside Mission and Hospital were supported by the Free Methodist, Baptist, and Congregational churches of Seattle. For over a year, the North Baptist Church of Seattle provided the bread for the mission. The Seattle Seminary helped the mission organize meetings. A number of business companies and well-known people of Seattle helped provide necessary medicines and food. In 1903, English actress Rose Coghlan donated her earnings from three performances of The Second Mrs. Tanqueray in Seattle to the hospital. That same year, it was announced that all profits from De Soto's mining properties in Granite Falls, Washington would be dedicated to charities across Puget Sound including the Wayside Hospital."]}, {"page": "Harry R. Roberts", "response": ["*Sir Horace Welby in Forget-me-Not with Rose Coghlan."]}, {"page": "The Sporting Duchess (play)", "response": ["The play was adapted into silent films of the same name in 1915, starring Rose Coghlan and Ethel Clayton, and in 1920, starring Alice Joyce."]}, {"page": "Bernard A. Reinold", "response": ["Reinhold was born in Manhattan.  He ran away to sea at age 15 to avoid having to follow his father (Bernard Henry Reinhold, head of the College of Physicians and Surgeons of Columbia University) into the medical profession, spending four years on a whaling boat.  He then became an actor, including supporting Lawrence Barrett, and stints with Rose Coghlan's company and Charles Frohman's company.  He was also on the executive staff of producer William A. Brady.  One of his last roles was in Quarantine (1924) with Helen Hayes.  He became superintendent of the Percy Williams Home for Retired Actors in 1926, where he died on March 19, 1940.  "]}]}}