{"wiki_id": "http://www.wikidata.org/entity/Q16066735", "itemLabel": "William Gresham", "itemDescription": "Footballer (1870-?)", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Gresham_(footballer)", "wikipedia_page": {"main": "William Gresham (1870 – after 1894) was an English footballer who made 35 appearances in the Football League playing for Lincoln City as a goalkeeper. He played for Gainsborough Trinity before joining Lincoln in 1892 in time to play in their first Football League match, alongside his younger brother James. Both brothers were ever-present in the 1892–93 Football League season.", "link_mentions": [{"page": "Gresham (surname)", "response": ["*William Gresham, (1870 – after 1894), English footballer"]}, {"page": "James Gresham (footballer)", "response": ["Gresham was born in Liverpool, the younger brother of William Gresham, who also went on to play for Lincoln City. James Gresham played once for Lincoln in September 1889 in the Midland League and moved to Doncaster Rovers for the beginning of the 1890–91 season. Rovers were playing in the newly formed Midland Alliance League. He played inside forward as well as outside left for Doncaster, and was part of the Sheffield and Hallamshire FA Senior Challenge Cup-winning side who beat Sheffield United 2–1."]}, {"page": "1892–93 Lincoln City F.C. season", "response": ["In all competitive league and cup matches Lincoln used 20 players and had 10 different goalscorers, William Gresham, Quentin Neill, Frank Smallman and James Gresham played in all 22 league games and the six cup matches, Frank Smallman scored 19 goals in total while no other player reached double figures.", "Although Lincoln City struggled in the 1891–92 season in the Football Alliance finishing in 9th place and with debts of £110, the committee decided to spend a sizeable sum over the close season on summer wages and signing-on fees, the new recruits were goalkeeper William Gresham from Gainsborough Trinity, back Charles Coulton from Birmingham St George's and forwards James Kelly from Renton F.C. and finally Robert Cameron from Clydebank."]}]}}