{"wiki_id": "http://www.wikidata.org/entity/Q16016215", "itemLabel": "William McAlpine", "itemDescription": "British tenor", "wikipedia_url": "https://en.wikipedia.org/wiki/William_McAlpine_(tenor)", "wikipedia_page": {"main": "William McAlpine (3 December 1922 – 2 February 2004) was a leading British tenor during the 1950s and 1960s. He created roles in two operas by Benjamin Britten— A Novice in Billy Budd and The Spirit of the Masque in Gloriana. He also sang Andres in the UK premiere of Berg's Wozzeck.\nMcAlpine was born in Stenhousemuir, Scotland and initially worked as bricklayer before studying at the Guildhall School of Music. He made his stage debut in 1951 as  the third Jew in a revival of Richard Strauss's Salome at the Royal Opera House, and went on to sing several there and at the Sadlers Wells company, which he joined in 1956 as a principal tenor. He later sang with the Scottish Opera and Glyndebourne Festival Opera as well as in Berlin, Prague, and Paris. After his retirement from the stage, he taught singing at the Guildhall School of Music. He died in Surrey at the age of 81 following a heart attack after one of his teaching sessions at Guildhall.", "link_mentions": [{"page": "Stenhousemuir", "response": ["*William McAlpine (1922–2004) – leading tenor of the 1950s and 1960s"]}, {"page": "Gloriana", "response": ["|William McAlpine"]}, {"page": "Billy Budd (opera)", "response": ["| William McAlpine"]}, {"page": "William McAlpine", "response": ["William McAlpine may refer to:", "*Sir William McAlpine, 6th Baronet (1936–2018), British businessman", "*William McAlpine (tenor) (1922–2004), Scottish tenor", "* McAlpine Locks and Dam, named for William McAlpine, district engineer for the Corps of Louisville, Kentucky"]}, {"page": "Richard Austin (conductor)", "response": ["Austin recorded a selection of works by Balfour Gardiner in May 1955 for Argo, with Alexander Young, the Goldsmiths’ Choral Union and the London Symphony Orchestra (Overture to a Comedy, Shepherd Fennel’s Dance, April, Philomela). Later that year with cellist André Navarra he set down recordings of Bloch's Schelomo and Tchaikovsky's Variations on a Rococo Theme Op.30 for Parlophone. A recording of The Beggar's Opera featured Dennis Noble, Carmen Prietto, Martha Lipton, Roderick Jones, Marjorie Westbury, John Cameron and William McAlpine."]}, {"page": "Temistocle (J.C. Bach)", "response": ["A complete recording is available on Oriel Music Trust, OMT945. Conducted by Charles Mackerras, the cast includes William McAlpine, Marie Hayward, Anne Evans, Patricia Kern, April Cantelo, Raimund Herincx, Maureen Lehane, BBC Northern Symphony Orchestra and Singers. The overture is available on CD, for example on Johann Christian Bach: Complete Opera Overtures, performed by the Hanover Band conducted by Anthony Halstead (CPO Records 9999632, 2003). WorldCat lists a recording of Temistocle with Vladimir Delman, Herbert Handt, Kate Gamberucci, Renato Cesari, Radiotelevisione Italiana, Orchestra Alessandro Scarlatti di Napoli, ."]}, {"page": "Bath Bach Choir", "response": ["|Nelson Mass (1965 Bath Festival). Soprano Anne Pashley, Contralto Yvonne Minton, Tenor William McAlpine, Bass-baritone Heinz Rehfuss. Festival Orchestra. Leader Yehudi Menuhin."]}, {"page": "Martin's Lie", "response": ["|William McAlpine"]}, {"page": "Georg Solti discography", "response": ["|William McAlpine", "|William McAlpine"]}, {"page": "MacAlpine", "response": ["* William McAlpine (tenor) (1922–2004), Scottish tenor", "* Sir William McAlpine, 6th Baronet (1936-2018), British businessman, older brother of Alistair"]}]}}