{"wiki_id": "http://www.wikidata.org/entity/Q16012198", "itemLabel": "Harry Barratt", "itemDescription": "English footballer and manager (1918-1989)", "wikipedia_url": "https://en.wikipedia.org/wiki/Harry_Barratt", "wikipedia_page": {"main": "Harold Barratt (25 December 1918 – 1989) was an English football player and manager.", "link_mentions": [{"page": "History of Gillingham F.C.", "response": ["Gillingham's fortunes on the field gradually improved and the team finished in the top half of the Third Division South on three occasions, helped by the goals of Ernie Morgan, who in 1954–55 set a new club record by scoring 31 league goals. In 1956–57 and 1957–58, however, the Gills found themselves once again rooted to the bottom of the table, and this meant that with the restructuring of the league system for the 1958–59 season, the team was placed in the newly created Fourth Division – a top-half finish would have led to placement in the new national Third Division. 1958 also saw the departure of long-serving manager Archie Clark, who had held the post since before the Second World War, with Harry Barratt taking over."]}, {"page": "George Curtis (footballer, born 1939)", "response": ["Curtis started his playing career with the Snowdown Colliery Welfare team, based close to his home, before signing for Coventry City in October 1955. He was one of four Snowdown Colliery players to join Coventry at that time, on the recommendation of former Coventry captain Harry Barratt who had become manager of the Kent club, the others being Alf Bentley, Eric Jones and Bill Patrick. Curtis made his debut for the Coventry reserve team in a Football Combination fixture against Southampton on 10 December 1955 at the age of 16. He made his first-team league debut on 21 April 1956, playing in a 4–2 defeat against Newport County at Somerton Park. Coventry were competing in the Football League Third Division South, which was at that time the third tier of the English football league system. Playing at left-back at the time, Coventry Evening Telegraph reporter Derek Henderson, writing under the byline \"Nemo\", wrote that Curtis had a \"memorable\" first game, and that \"after a shaky opening [he] settled down to give a splendid showing after the interval\". Curtis was then called up to the England national under-18 team in May 1956, making his debut in a match against Northern Ireland in Belfast. He went to make three more appearances for England, the last coming in 1957."]}]}}