{"wiki_id": "http://www.wikidata.org/entity/Q16017674", "itemLabel": "Rod Allen", "itemDescription": "British advertising executive", "wikipedia_url": "https://en.wikipedia.org/wiki/Rod_Allen_(advertising_executive)", "wikipedia_page": {"main": "Roderick Howard Allen (16 May 1929 – 22 August 2007) was a British advertising executive who wrote many well known advertising slogans and jingles used in the United Kingdom. He was nicknamed the \"jingle king\".\nAllen was born in Consett, County Durham and worked in advertising from the age of 17. His career was only interrupted by National Service in the Royal Corps of Signals. In 1966, Allen joined Mike Brady and Peter Marsh to co-found the advertising agency Allen, Brady and Marsh, which was one of the five largest agencies in the UK during the early 1980s until its demise in the late 80s following a take-over by another ad agency, Lowe.", "link_mentions": [{"page": "Consett", "response": ["*Rod Allen (1929–2007), advertising executive born in Consett"]}, {"page": "Midland Bank", "response": ["The Midland Bank was famous for its golden griffin logo, surrounded by golden coins originally introduced in 1965 on a black, then later blue background, and for its slogan \"the listening bank,\" written by the advertising executive Rod Allen. Advertisements for the bank appeared in the popular computer game Theme Park. An animated friendly version of the Griffin fronted the bank's television advertising during the 1980s."]}, {"page": "Harp Lager", "response": ["For many years the slogan \"Harp stays sharp\"  was used in advertisements. It was written by the advertising executive Rod Allen. Recently it has used the slogan \"Look on the Harp side\"."]}, {"page": "R. White's Lemonade", "response": ["In 1973, the popular 'Secret Lemonade Drinker' advertising campaign was launched by London agency Allen, Brady and Marsh and devised by Rod Allen, who wrote the slogan. The adverts featured actor Julian Chagrin in pyjamas creeping downstairs to raid the fridge for R. Whites Lemonade. Ross McManus wrote and sang the advert's song, with his son Declan McManus – later known by his stage name Elvis Costello – providing the backing vocals. An alternative, unaired version of the advert featured Costello and his father onstage, as the 'Secret Lemonade Drinker' fantasised about being a rock star.McManus, Declan (2015), pp.156-157 Unfaithful Music & Disappearing Ink. Viking."]}, {"page": "Allen (surname)", "response": ["* Rod Allen (advertising executive) (1929–2007), British advertising executive", "* Rod Allen (born 1959), American television baseball commentator"]}, {"page": "Rod Allen", "response": ["On September 4, 2018, Allen and Impemba were allegedly involved in a physical altercation off the air after broadcasting the Tigers game against the Chicago White Sox. Fox Sports Detroit sent the men home on different planes after the game, and the next night's telecast was covered by Kirk Gibson and field-level reporter Matt Shepard. One source claimed that there was an argument over a chair, followed by Allen using a choke hold on Impemba, but Allen's agent denied that his client choked Impemba. On September 7, Fox Sports Detroit suspended both men from calling any Tigers games for the remainder of the 2018 season. It was later announced that Impemba and Allen's contracts were not renewed for future seasons, ending their 17-year partnership.Broadcasters Rod Allen, Mario Impemba won't return to Detroit Tigers The Detroit Free Press, October 9, 2018"]}, {"page": "Milk Marketing Board", "response": ["From the 1950s onwards, there were several memorable advertising campaigns by the Milk Marketing Board. Slogans included \"full of natural goodness\", \"is your man getting enough?\", \"milk's gotta lotta bottle\" (written by the advertising executive Rod Allen), and \"drinka pinta milka day\" designed by the advertising agency Ogilvy.\"Former Ogilvy & Mather chief Archie Pitcher dies\" Campaign February 10, 2017. Retrieved 12 November 2018. In the 1980s, they ran the advert \"Accrington Stanley, Who Are They?\"."]}, {"page": "Everest Home Improvement", "response": ["Everest's slogan \"Fit the best. Everest,\" written by advertising executive Rod Allen, was made memorable by the company's first television advert in the 1980s. Filmed in 'Britain's highest pub' the Tan Hill Inn in Tan Hill, North Yorkshire, it attempted to showcase the draught-proofing of Everest double glazing by having television personality Ted Moult dropping a feather on one side of the pubs double-glazed windows, while a gale raged outside. A new version of the advert featuring Craig Doyle, was produced in 2008. It created some controversy after local planning officials recognized that Everest had not properly authorized the improvement work done to the filming location, as is required for commercial premises."]}, {"page": "Roderick Allen", "response": ["*Rod Allen (born 1959), baseball analyst", "*Rod Allen (advertising executive) (1929–2007)"]}, {"page": "Rod (given name)", "response": ["* Rod Allen (born 1959), American baseball player and commentator ", "* Rod Allen (advertising executive) (1929–2007), nicknamed the \"jingle king\""]}, {"page": "The Age of the Train", "response": ["Savile was selected to front the advertising campaign because, at the time, he was perceived as being both a popular and family-friendly television personality. The slogan, \"This is the Age of the Train\", is credited to Rod Allen of ABM."]}]}}