{"wiki_id": "http://www.wikidata.org/entity/Q16066265", "itemLabel": "William Ord", "itemDescription": "British politician", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Ord", "wikipedia_page": {"main": "William Ord (2 January 1781 – 28 July 1855) was an English Whig politician and landowner, the son of William Ord and Eleanor Brandling.He inherited estates and coal and lead mining interests at Whitfield, Northumberland on the death of his father. His residence was Whitfield Hall. After his father's death, his mother remarried Thomas Creevey in 1803.Ord was granted the Freedom of Newcastle-on-Tyne in 1808. He was Member of Parliament for Morpeth 1802–32, when one of the seats was eliminated for that constituency. He was defeated that year when standing for South Northumberland, but was returned for Newcastle-upon-Tyne 1835–52. Politically, Ord was a left-wing Whig, a follower of Samuel Whitbread.He married Mary Scott, daughter of the Rector of St Lawrence, Southampton, Hampshire and sister of Jane Harley, Countess of Oxford.\nTheir only son, also named William Henry (1803–1839), was a barrister and Member of Parliament for Newport, Isle of Wight, married Frances Vere Lorraine in 1829 but died aged only 36 in 1839. In 1855 his father left his estates to his son's widow Frances (who remarried Sir Edward Blackett, 6th Baronet in 1851) and to his niece, Anne Jane Hamilton, who married Rev John Alexander Blackett, Rector of Wolsingham, the youngest son of Christopher Blackett of Wylam, on condition that he changed his name to Blackett-Ord.\n\n", "link_mentions": [{"page": "Second Melbourne ministry", "response": ["| William Ord"]}, {"page": "Penshaw Monument", "response": ["At a meeting at the Lambton Arms pub in Chester-le-Street on 19 August 1840, it was decided to form a Provisional Committee to raise funds for a monument to the Earl by subscription. The next day, at the Assembly Rooms in Newcastle, a committee of 33 men was formed for that purpose; it included the mayors of Newcastle and Gateshead. The chairman of the committee was Henry John Spearman. The following motion was put forward by William Ord MP:"]}, {"page": "Whitfield, Northumberland", "response": ["Whitfield Hall is the home of the Blackett-Ord family. The Manor of Whitfield was granted, in the 12th century, by William the Lion, King of Scotland, to the Whitfield family, who retained it until 1750 when it was sold to William Ord of Fenham. When a later William Ord died in 1855, the estate fell to his son's widow and then to her heir, her niece, who married Rev John Blackett, a son of Christopher Blackett of Wylam. As a condition of the marriage and inheritance, he changed his name to Blackett-Ord.", "St John's Church is the site of an ancient church that was rebuilt by William Ord in 1785. Trinity Church (more usually known as Holy Trinity) was dedicated in 1860 and was the gift of the Rev'd and Mrs. J. A. Blackett-Ord in memory of William Ord Esq. from whom Mrs. Blackett-Ord had inherited the whole estate. It replaced St. John's church as the parish church. Many of the stones from St. John's were used in the building of Holy Trinity. The registers start in 1612 and the list of Rectors in 1180 with Robert de Quitfield which confirms the existence of a church at that time."]}, {"page": "Morpeth (UK Parliament constituency)", "response": ["|rowspan=\"4\"| William Ord"]}, {"page": "Blackett baronets", "response": ["*Sir Edward Blackett, 6th Baronet DL JP (23 February 1805 – 23 November 1885). Blackett succeeded to the baronetcy on the death of his father Sir Edward Blackett, 5th Baronet, in 1816. He was educated at Eton College and Christ Church, Oxford, and served in the army in the 1st Life Guards. He was also a Justice of the Peace, Deputy Lieutenant of Northumberland (23 July 1831), and High Sheriff of Northumberland in 1833, and constructed the new mansion house at Matfen Hall, Matfen, Northumberland, in 1828. Blackett married four times; in 1830 to Julia Monck, the mother of all his children, in 1851 to Francis Vere (Lorane) Ord (d. 29 May 1874), widow of William Ord of Whitfield, in 1875 to Isabella Richardson and finally in 1880 to Alethea Rianette Scott. He died on 23 November 1885 at Matfen Hall, Matfen, and was succeeded by his son Edward."]}, {"page": "William Ord of Fenham", "response": ["William Ord (c. 1715 – 24 January 1768) was an English land and mine owner.", "His eldest son, William (1752–1789), High Sheriff of Northumberland in 1777, married Eleanor Brandling of Gosforth, daughter of the Member of Parliament Charles Brandling, and William Ord MP was their son; on her husband's death she remarried Thomas Creevey. His second son, Rev. James Ord (1761–1836), who inherited the Langton estates, married Barbara Brandling of Gosforth."]}, {"page": "Newcastle-upon-Tyne (UK Parliament constituency)", "response": ["|rowspan=\"3\"| William Ord"]}, {"page": "William Henry Ord", "response": ["#REDIRECT William Ord"]}, {"page": "List of MPs elected in the 1830 United Kingdom general election", "response": ["|rowspan = \"2\"|Morpeth(two members)||William Ord||Whig"]}, {"page": "List of MPs elected in the 1831 United Kingdom general election", "response": ["|rowspan = \"2\"|Morpeth(two members)||William Ord|| Whig"]}, {"page": "List of MPs elected in the 1826 United Kingdom general election", "response": ["|rowspan = \"2\"|Morpeth(two members)||William Ord||Whig"]}, {"page": "Ord (surname)", "response": ["*William Ord (1781–1855), English Whig politician and landowner"]}, {"page": "Christopher Blackett", "response": ["Christopher Blackett's son and heir, Christopher Blackett, and his son John Frederick Burgoyne Blackett both became Members of Parliament. His youngest son, Rev John Alexander Blackett (1803-1865), in 1855 inherited the Whitfield, Northumberland estates of his wife's uncle, William Ord, and changed his name to Blackett-Ord."]}, {"page": "List of ministerial by-elections to the Parliament of the United Kingdom", "response": ["|William Ord"]}, {"page": "Thomas Hanway Bigge", "response": ["Bigge married Charlotte Scott, daughter of James Scott, Rector of Itchen Ferry; his first cousin and Foxite MP William Ord married her sister Mary, and Thomas Hobbes Scott was Charlotte's brother. Their children included Francis Edward Bigge. The youngest daughter, Fanny Cecilia, married Matthew Bell, son of John Bell."]}, {"page": "List of MPs elected in the 1820 United Kingdom general election", "response": ["|rowspan=\"2\"|Morpeth||William Ord||Whig"]}, {"page": "Ord, William", "response": ["#redirectWilliam Ord"]}, {"page": "List of MPs elected in the 1806 United Kingdom general election", "response": ["| William Ord"]}, {"page": "List of MPs elected in the 1802 United Kingdom general election", "response": ["| William Ord"]}, {"page": "List of MPs elected in the 1807 United Kingdom general election", "response": ["| William Ord", "| Hon. William Orde-Powlett  Replaced by    Admiral Sir John Orde"]}, {"page": "List of MPs elected in the 1812 United Kingdom general election", "response": ["| William Ord"]}, {"page": "List of MPs elected in the 1818 United Kingdom general election", "response": ["| William Ord"]}, {"page": "William Armstrong (corn merchant)", "response": ["Armstrong was generally a progressive, but began as a more independent, and sometimes reactionary, politician, remaining a \"timid reformer\" even afterwards, according to Welford. In the 1832 general election he voted for both Tory and Whig Newcastle MP candidates. By the 1835 election, he was decidedly in favour of the Whigs. By 1837, he was divided between two candidates - Charles John Bigge and William Ord - after which he expressly favoured Whig (or, later, Liberal) candidates. One political concern he held, despite his reformist reputation, was against the abolition of the Corn Laws - a set of taxes on imported food, which kept domestic grain prices high - a reform he spoke out vigorously against in 1845, perhaps out of self interest as a corn merchant."]}, {"page": "1835 Speaker of the British House of Commons election", "response": ["James Abercromby was proposed by William Denison and seconded by William Ord."]}]}}