{"wiki_id": "http://www.wikidata.org/entity/Q16006593", "itemLabel": "Fred Kitchen", "itemDescription": "English writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Fred_Kitchen", "wikipedia_page": {"main": "(William) Frederick Kitchen (28 December 1890 – 16 September 1969) was an English farm labourer and writer. His best known work is Brother to the Ox (1939), which has been adapted for radio and television.", "link_mentions": [{"page": "Edwinstowe", "response": ["*Fred Kitchen (1890–1969), countryside writer and autobiographer, was born here."]}, {"page": "Maltby, South Yorkshire", "response": ["*Fred Kitchen, author, wrote a number of biographical works on rural life and worked in and around the Maltby area. His best-known work is Brother to the Ox."]}, {"page": "Kitchen (surname)", "response": ["*Fred Kitchen (1890–1969), English writer", "*Fred Kitchen (entertainer) (1872–1951), English entertainer"]}, {"page": "Fred Kitchen (entertainer)", "response": ["Fred Kitchen (15 June 1872 – 1 April 1951) was an English music hall star, comic and entertainer.", "Fred Kitchen was born Frederick Thomas Kitchen in the parish of St John's, London. His father, Richard Henry Kitchen (1830–1910), was a music hall actor for sixty years, beginning his stage work at the age of seven with Messrs Frampton and Frenton in London's Waterloo Road. His Daily Telegraph obituary noted \"An actor like Kitchen played everything. It was, however, as a harlequin, clown and pantomimist that he chiefly shone\".Daily Telegraph, 4 July 1910 \"Death of Mr R. H. Kitchen\"", "Fred Kitchen's first role was in the Prince's Theatre Portsmouth, appearing in The Dumb Man of Manchester. The little fellow: the life and work of Charles Spencer Chaplin (Variety obituary reprinted) (1965) Peter Cotes, Citadel Press, University of Michigan p35 He was discovered by theatre impresario Fred Karno whilst playing a small part in a sketch at the Princess's Theatre Glasgow. The chief comedian at the theatre had to be replaced immediately and Kitchen was chosen to take the role. It began a 50-year career as a headliner. \"Obituary: Fred Kitchen\" The Glasgow Herald 2 April 1951 He was the lead comedian with Karno's company from 1897 to 1910, starring in comic works such as the highly popular His Majesty's Guests. Charlie Chaplin, managed by Karno, was influenced by Kitchen's comic style, his splayed walk and scruffy costume.Chaplin in the Sound Era: An Analysis of the Seven Talkies (1997) Eric L. Flom, McFarland p13  Chaplin commented \"A part of the [tramp] character was inspired by Fred Kitchen, an old fellow-trouper of mine in vaudeville. He had flat feet.\"Slapstick Comedy (2010) editors Tom Paulus, Rob King, Routledge, p252  The sketch that Karno and Kitchen co-wrote, entitled \"The Football Match\", made Kitchen's name. He was known for the catchphrase \"Meredith, we're in!\" from The Baliffs (1907), a sketch which toured the country for many years.A Dictionary of Catch Phrases (2004) Eric Partridge, Psychology Press p307  The catchphrase's popularity was helped by the fact that footballer Billy Meredith (1874-1958), had transferred from Manchester City Football Club to Manchester United. The line was carved on his tombstone.", "Kitchen's wife, also an entertainer, known by the stage name Ella Ward, died during the Second World War. Their son Fred Kitchen Jr. also went on to work in theatre and film. Kitchen's grandson Simon Kitchen-Dunn drew together the memoirs of the Vaudeville star, published as Meredith we're in!Meredith we're in! (2013)  Published by Simon Kitchen-Dunn", "On 27 March 2016, Kitchen's memorial at West Norwood Cemetery was restored by The Music Hall Guild of Great Britain and America.\"Fred Kitchen Memorial restored\", the Music Hall Guild of Great Britain and America, accessed 25 March 2016"]}]}}