{"wiki_id": "http://www.wikidata.org/entity/Q16010340", "itemLabel": "Charles Edgson", "itemDescription": "cricketer (1915-1983)", "wikipedia_url": "https://en.wikipedia.org/wiki/Charles_Edgson", "wikipedia_page": {"main": "Charles Leslie Edgson (22 August 1915 – 28 June 1983) was an English first-class cricketer who played for Leicestershire between 1933 and 1939 as an amateur right-handed batsman. He was born at Morcott, Rutland and died at Brentwood, Essex.\nEducated at Stamford School, Edgson scored 111 in a one-day minor match for Leicestershire on his 18th birthday and found himself in the county's first eleven four days later. He scored 6 and 0 against Lancashire. A year later, his name cropped up in discussions when Leicestershire found themselves without an available amateur to captain the side, but he was deemed too young and Royal Air Force officer Walter Beisiegel was drafted in for a few games: in 1935, the captaincy issue was resolved by the expediency of appointing the senior professional, Ewart Astill, and Edgson played a few games under both Beisiegel and Astill.\nHis best game was against Derbyshire in 1934: he scored 49 in the first innings and 43 in the second and these were his highest scores in first-class cricket. In 1936, he was at Brasenose College, Oxford University, and played in the Freshmen's trial game there, scoring 57 in his only innings: the match was abandoned on the second day by the Oxford captain, Norman Mitchell-Innes because he considered the bowling so feeble that the match did not constitute a realistic trial. Edgson was then not picked for any of Oxford's first-class matches, although he was in the Leicestershire team that played Oxford, a device sometimes used by the university team to uncover potential players: he scored 12 and 18, but it did not lead to further games. He played twice more for Leicestershire in the 1936 season and then a single final match in 1939.\nEdgson became a schoolmaster at Brentwood School in Essex, where he taught Classics, and was in charge of cricket.", "link_mentions": {}}}