{"wiki_id": "http://www.wikidata.org/entity/Q16030786", "itemLabel": "John Alexander Strachey Bucknill", "itemDescription": "Chief Justice of the Straits Settlements and ornithologist (1873-1926)", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Alexander_Strachey_Bucknill", "wikipedia_page": {"main": "Sir John Bucknill KC (14 September 1873 – 6 October 1926) was a British lawyer and Judge.   He served as Attorney General of Hong Kong, Chief Justice of the Straits Settlements and Puisne Judge in Patna, India.", "link_mentions": [{"page": "List of Old Carthusians", "response": ["*John Alexander Strachey Bucknill (1873–1926), Attorney General of Hong Kong"]}, {"page": "Chief Justice of Singapore", "response": ["| Sir John Alexander Strachey Bucknill"]}, {"page": "Thomas Bucknill", "response": ["He was the father of Sir Alfred Townsend Bucknill (1880–1963), also a High Court Judge and who became a Privy Councillor in 1945 and John Alexander Strachey Bucknill who served as Chief Justice of the Straits Settlements and Puisne Judge in Patna, India."]}, {"page": "John Bucknill", "response": ["*Sir John Alexander Strachey Bucknill, British lawyer and colonial judge (and grandson of John Charles Bucknill)"]}, {"page": "Bucknill", "response": ["*Sir John Alexander Strachey Bucknill, KC British lawyer and colonial judge (and son of Thomas Townsend Bucknill)."]}, {"page": "John Bucknill (lawyer)", "response": ["#REDIRECT John Alexander Strachey Bucknill"]}, {"page": "John Bucknill (judge)", "response": ["#REDIRECT John Alexander Strachey Bucknill"]}, {"page": "Düstur", "response": ["British lawyer John Alexander Strachey Bucknill wrote that for Nicolaides \"high praise is due as it is an accurate and useful rendering\". George Young, the author of Corps de droit ottoman, stated that there were inconsistencies in the translation and that the work lacked an index."]}, {"page": "Législation ottomane", "response": ["It has the Düstur in Volumes 1-5, with the fifth titled as Doustour-i-hamidié. British lawyer John Alexander Strachey Bucknill wrote that the second volume was \"the French Paraphrase\" of \"The Imperial Penal Code\". - PDF p. 12-14/263 The corpus includes the Edict of Gülhane, originating from the 1865 collection Manuale di diritto publico e privato ottomano by Domenico Gatteschi, a lawyer from Italy's Supreme Court of Appeal. The book's translation of the Ottoman Reform Edict of 1856 (Islâhat Fermânı in modern Turkish) was made by French diplomat François Belin, who also attached his own notes; his translation was published first in the Journal Asiatique and later in his 1862 published book Etude sur la propriété foncière en pays musulman et spécialement en Turquie, as well as in the Manuale. Belin had also translated the Ottoman land codes used in this volume and included notes. However the translation was on several occasions later revised to match the Greek version done by dragoman D. Rhazes, a translation Strauss stated had \"such high esteem\".Strauss, \"A Constitution for a Multilingual Empire,\" p. 30 (PDF p. 32) Takvor Efendi Baghtchebanoglou, a judge at the criminal court of Péra (Beyoglu) of Armenian descent, had hitherto published laws seen in volume 4 and 5 (\"du Transport de Dette\" and \"du Gage\", respectively)."]}, {"page": "List of Knights Bachelor appointed in 1916", "response": ["|John Alexander Strachey Bucknill "]}]}}