{"wiki_id": "http://www.wikidata.org/entity/Q16063131", "itemLabel": "Walter Duffield", "itemDescription": "Australian politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Walter_Duffield", "wikipedia_page": {"main": "Walter Duffield (1816 – 5 November 1882) was a pastoralist and politician in colonial South Australia, Treasurer of South Australia 1865 to 1867.Duffield was born in Great Baddow, Essex, England, son of William Duffield, a farmer. Walter arrived in South Australia in the William Barras in December 1839. His first occupation was as manager for fellow-passenger Jacob Hagen's estate at Echunga, where his wine was some of the first produced in the colony. He left Echunga to build up the Para Para estate, near Gawler, and produced hams, wines and orchard fruit; he later had 40,000 Merino sheep.He started business in Gawler as a flour miller (\"The Victoria Steam Flour Mill\", founded by Stephen King JP) and merchant in September 1847, and, in conjunction with Harrold Brothers as Duffield, Harrold and Company (later Duffield, Harrold and Hurd), owned Weinteriga and Outalpa stations.Duffield was member for Barossa in the South Australian House of Assembly from 9 March 1857 to 6 April 1868 and from 14 April 1870 to 13 December 1871, and was Treasurer in the John Hart Government from 23 October 1865 to March 1866, and in the Ministry of James Boucaut, which succeeded it, from the latter date till 3 May 1867. Duffield subsequently sat in the South Australian Legislative Council from 3 April 1873 to 27 May 1879, when every four years one third of the Legislative Council was elected by the whole colony as one electorate \"The Province\".Duffield died in Gawler on 5 November 1882 and was buried in Willaston General Cemetery.", "link_mentions": [{"page": "Members of the South Australian House of Assembly, 1862–1865", "response": ["|| Walter Duffield || Barossa || 1857–1868, 1870–1871"]}, {"page": "Members of the South Australian House of Assembly, 1865–1868", "response": ["|| Walter Duffield || Barossa || 1857–1868, 1870–1871"]}, {"page": "Members of the South Australian House of Assembly, 1870–71", "response": ["|| Walter Duffield || Barossa || 1857–1868, 1870–1871"]}, {"page": "Duffield (surname)", "response": ["* Walter Duffield (1816–1882), British pastoralist and politician in South Australia"]}, {"page": "Stephen King (surveyor)", "response": ["Around 1845, King founded the Victoria Flour Mill in Gawler, \"opposite Miss Calton's Old Spot Inn\", named for his daughter not the monarch. Finding it unable to cope with demand, he had it converted to steam power and renamed it the Victoria Steam Flour Mill. He sold the business to Walter Duffield in 1847; the mill was destroyed by fire in 1867."]}, {"page": "Adelaide Educational Institution", "response": ["*D(avid) Walter Duffield (died 24 January 1922) miller and pastoralist, son of Hon. Walter Duffield father of Kenneth Duffield)"]}, {"page": "Treasurer of South Australia", "response": ["|align=center|  || data-sort-value=\"Duffield\" | Walter Duffield ||  || 23 Oct 1865 || 3 May 1867"]}, {"page": "William Everard (South Australian politician)", "response": ["Fourteen months later, Everard was elected a member of the Legislative Council, in company with Sir Henry Ayers, Alexander Hay, T. Hogarth, J. Fisher, R. A. Tarlton, and Walter Duffield, and continued as one of the eighteen members of the Upper House, who were elected by the whole province acting as one electoral district, until he vacated his seat on 1 August 1878."]}, {"page": "Electoral district of Barossa", "response": ["| rowspan=6|Walter Duffield", "| Walter Duffield"]}, {"page": "Members of the South Australian Legislative Council, 1873–1877", "response": ["|| Walter Duffield || 1873–1880 ||  || elected Feb. 1873  "]}, {"page": "Members of the South Australian Legislative Council, 1877–1881", "response": ["|| Walter Duffield || 1873–1880 ||  || "]}, {"page": "James Martin (South Australian politician)", "response": ["He was elected for the seat of Barossa in the House of Assembly in February 1865 with Walter Duffield as a colleague, and retired in 1868."]}, {"page": "Joseph Barritt", "response": ["He was for several years partner with Walter Duffield in a  pastoral lease adjacent to the Burra Special Survey."]}, {"page": "James Andrew Trehane Lake", "response": ["He was elected to the seat of Barossa in the South Australian House of Assembly, defeating Walter Duffield, and served from December 1871 to February 1875, a colleague of J. H. Angas. In contrast with his business life, he was not noted as a forceful or innovative politician. He did not seek a seat in the next Parliament owing to ill health. He died at his home in Enfield."]}, {"page": "Harrold Brothers", "response": ["They held, in partnership with Walter Duffield as Duffield, Harrold and Company, Weinteriga station (between Menindee and Wilcannia, New South Wales) in 1859, and Outalpa Station, between Mannahill and Olary, South Australia around 1865. This partnership later included  overseer William Hurd (c. 1836–1992)."]}, {"page": "List of South Australian Legislative Council by-elections", "response": ["|Walter DuffieldHenry Kent HughesCharles Burney Young"]}, {"page": "Jacob Hagen", "response": ["Hagen arrived in the colony of South Australia in December 1839 aboard the William Barrass. He purchased part of fellow-Quaker Barton Hack's selection at Echunga. He put Walter Duffield, a fellow-passenger on the trip out, in charge of the estate and was soon growing grapes; his wine was some of the first produced in the Colony. The Hagen Arms, opened in the area around 1853, and which still stands today, was named for him."]}, {"page": "Koonoona, South Australia", "response": ["The area was originally the territory of the Ngadjuri people. It was named after the Koonoona Station and Merino stud, which was established in 1863 by Walter Duffield and T. S. Porter. Koonoona Station was described in 1929 as \"one of the oldest estates in this district\" and \"noted for the breed of its merino sheep\"; another correspondent in 1933 labelled it \"one of the most important [Merino studs] in the Commonwealth\"."]}, {"page": "Kenneth Duffield", "response": ["Kenneth Duffield was born into a wealthy South Australian pastoral family. His grandfather was colonial politician Walter Duffield. He was educated at St Peter's College in Adelaide. Moving to England, Duffield graduated in Arts from Cambridge in 1906 and a diploma in agriculture the following year. At Cambridge he was part of the Footlights Club."]}, {"page": "Willaston General Cemetery", "response": ["*Walter Duffield, (1816–1882) miller, pastoralist and politician"]}, {"page": "Green's Exchange", "response": ["The offices over the Telegraph Office were occupied by solicitors Belt, Cullen, & Wigley. Businessmen mentioned as habitués include T. F. Monteith, F. P. Bayley, C. J. Barry, William Mitchell, Walter Duffield, Capt. John Hart, John Dunn, Beeby & Dunstan and Thomas Magarey."]}, {"page": "Thomas H. Bowen", "response": ["Bowen had been appointed attorney to handle (his father-in-law) Walter Duffield's extensive pastoral and business interests, and on the old man's death Bowen, D. Walter Duffield (1851–1922, his only son and another AEI student), and Lieutenant-Colonel Makin (D. W. Duffield's son-in-law) acted as trustees and managers of the estate."]}]}}