{"wiki_id": "http://www.wikidata.org/entity/Q16008426", "itemLabel": "William Nevell", "itemDescription": "English cricketer (1916-1978)", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Nevell", "wikipedia_page": {"main": "William Thomas Nevell was an English cricketer active from 1936 to 1947 who played for Middlesex and Surrey before the Second World War and then for Northamptonshire in the 1946 and 1947 seasons. He appeared in 51 first-class matches as a right arm medium-fast bowler who was a righthanded batsman. Nevell was born in Balham, London on 13 June 1916 and died in Worthing, Sussex, on 25 August 1978. He took 105 first-class wickets with a best performance of four for 11 and he scored 671 runs with a highest score of 55 not out, his sole half-century.", "link_mentions": [{"page": "1947 English cricket season", "response": ["Northamptonshire slipped from sixteenth to bottom and were captained by Arthur Childs-Clarke. Dennis Brookes was the pick of the batsmen and earned a trip to the West Indies in the winter. Bill Barron, Percy Davis and John Timms also topped 1,000 runs but with low averages. Vince Broderick put in a sound all-round effort with 860 runs and 87 wickets while the best bowler was West Indian Test player Bertie Clarke with 89 wickets. The attack was hampered by injuries to Nobby Clark who did not play often. Wicketkeeper Kenneth Fiddling claimed 40 victims. Other players included Leo Bennett, Robert Clarke, Arthur Cox, Eddie Davis, William Nevell and Jack Webster.Playfair, pp. 111–113."]}, {"page": "Nevell", "response": ["* William Nevell (1916–1978), English cricketer"]}, {"page": "List of Marylebone Cricket Club players (1919–1939)", "response": ["* William Nevell (1938) : W. T. Nevell (Middlesex, Surrey, Northamptonshire)"]}, {"page": "Nevell, William", "response": ["#redirectWilliam Nevell"]}, {"page": "Sir Geoffrey Vavasour, 5th Baronet", "response": ["Following the war, Vavasour played one first-class cricket match for the Combined Services cricket team against Northamptonshire in 1947 at Northampton. Batting twice in the match, Vavasour was dismissed for 8 runs in the Combined Services first-innings by William Nevell, while in their second-innings he was dismissed by John Timms for 6 runs. He was divorced from his wife in the same year. He was promoted to the rank of lieutenant commander in December 1949. He was promoted to the rank of commander between 1950 and 1958, with Vavasour retiring from active service in February 1958."]}]}}