{"wiki_id": "http://www.wikidata.org/entity/Q16013847", "itemLabel": "Patrick Gardiner", "itemDescription": "philosopher", "wikipedia_url": "https://en.wikipedia.org/wiki/Patrick_Gardiner", "wikipedia_page": {"main": "Patrick Lancaster Gardiner  (1922–1997) was a British academic philosopher and a Fellow of Magdalen College, Oxford.", "link_mentions": [{"page": "Very Short Introductions", "response": ["| 058 || Kierkegaard || Patrick Gardiner ||  || Past Masters series, 1988 || philosophy"]}, {"page": "Geoffrey Warnock", "response": ["*Obituary in The Independent by Patrick Gardiner, and another obituary in the same newspaper by John Torrance]"]}, {"page": "Stephen Gardiner (architect)", "response": ["Gardiner was born and raised in Chelsea in London.  He was the younger son of Clive Gardiner, painter and principal of Goldsmiths College from 1929 to 1958, and Lilian Lancaster, also a painter and one of Walter Sickert's favourite pupils at the Slade.  His paternal grandfather was the journalist A. G. Gardiner.  His elder brother, Patrick Gardiner, became a professor of philosophy at the University of Oxford."]}, {"page": "List of important publications in philosophy", "response": ["* Patrick Gardiner, The Nature of Historical Explanation, 1952"]}, {"page": "1922 in philosophy", "response": ["* March 17 - Patrick Gardiner (died 1997)"]}, {"page": "Alfred George Gardiner", "response": ["*Clive Gardiner, father of Patrick Gardiner and Stephen Gardiner."]}, {"page": "List of British philosophers", "response": ["* Patrick Gardiner"]}, {"page": "Michael Krausz", "response": ["Krausz earned a PhD from University of Toronto, including post-graduate work at Linacre College, Oxford University. He was a Special Student at the London School of Economics, and holds a BA from Rutgers University and an MA from Indiana University. His notable teachers include Sir Isaiah Berlin, William Dray, Patrick Gardiner, Rom Harré, Sir Karl Popper, and John Oulton Wisdom. He has also been influenced by R.G. Collingwood, Joseph Margolis and Bimal Krishna Matilal."]}, {"page": "Past Masters (book series)", "response": ["*Kierkegaard, Patrick Gardiner, 1988.*"]}]}}