{"wiki_id": "http://www.wikidata.org/entity/Q16066414", "itemLabel": "Francis Osborne, 1st Baron Godolphin", "itemDescription": "British politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Francis_Osborne,_1st_Baron_Godolphin", "wikipedia_page": {"main": "Francis Godolphin Osborne, 1st Baron Godolphin (18 October 1777 – 15 February 1850), styled Lord Francis Osborne from 1789 to 1832, was a British politician.", "link_mentions": [{"page": "William Eden, 1st Baron Auckland", "response": ["* Hon. Elizabeth Charlotte Eden (1780–1847), who married Francis Osborne, 1st Baron Godolphin."]}, {"page": "George Osborne, 6th Duke of Leeds", "response": ["Leeds was born in London, the eldest son of Francis Osborne, 5th Duke of Leeds, and his first wife, Amelia, Baroness Darcy de Knayth, daughter of Robert Darcy, 4th Earl of Holderness. Francis Osborne, 1st Baron Godolphin, was his younger brother. His parents divorced in 1779. In January 1784, aged eight, he succeeded as 13th Baron Darcy de Knayth and 10th Baron Conyers on the early death of his mother. In 1799 he also succeeded his father in the dukedom of Leeds.thepeerage.com Sir George William Frederick Osborne, 6th Duke of Leeds"]}, {"page": "Eden baronets", "response": ["***** Hon. Elizabeth Eden (1780–1847) m. Francis Osborne, 1st Baron Godolphin"]}, {"page": "Sir Theodore Brinckman, 2nd Baronet", "response": ["He was the son of Sir Theodore Brinckman, 1st Baronet and his first wife Hon. Charlotte Godolphin Osborne, only daughter of Francis Osborne, 1st Baron Godolphin. In 1880, he succeeded his father as baronet. Brinckman was educated at Eton and served then in the 17th Regiment of Foot. He fought in the Crimean War and reached the rank of captain. Brinckman was Deputy Lieutenant of Tower Hamlets and sat as Member of Parliament (MP) for Canterbury from 1868 to 1874."]}, {"page": "Francis Godolphin", "response": ["*Francis Osborne, 1st Baron Godolphin (1777–1850), British politician"]}, {"page": "Francis Osborne (disambiguation)", "response": ["*Francis Osborne, 1st Baron Godolphin (1777–1850), British politician"]}, {"page": "Matthew Montagu, 4th Baron Rokeby", "response": ["He married on 9 July 1785, Elizabeth (died 7 March 1817), daughter and heir of Francis Charlton of Kent, who bore him six sons, including Henry Robinson-Montagu, 6th Baron Rokeby and Spencer Dudley Montagu, and seven daughters; Caroline married William Godolphin Osborne, son of Francis Osborne, 1st Baron Godolphin, Jane married politician Henry Goulburn, Mary married Colonel Robert Ellison, of the Grenadier Guards, and Eleanor married politician John-Nicholas Fazakerley."]}, {"page": "Harriet Osborne, Baroness Godolphin", "response": ["While in the Netherlands, Harriet met George Osborne, the son of Francis Osborne, 1st Baron Godolphin and thus an heir to the dukedom of Leeds. Granville and Baron Godolphin eventually gave their consent, and the couple were married at the British Embassy in Paris on 21 October 1824. The newly married couple took up residence in the Bois de Boulogne, where they were enthusiastically welcomed by French society."]}, {"page": "Sydney Godolphin Osborne", "response": ["The third son of Francis Osborne, 1st Baron Godolphin, by Elizabeth Charlotte Eden, daughter of William Eden, 1st Baron Auckland, he was born at Stapleford, Cambridgeshire on 5 February 1808. He was a direct descendant of Sidney Godolphin, 1st Earl of Godolphin, and when in 1859 his elder brother George Godolphin Osborne, succeeded his cousin Francis Godolphin D'Arcy Osborne, as eighth Duke of Leeds, he obtained the rank of a duke's son, and with it the use of \"Lord\", a courtesy title."]}]}}