{"wiki_id": "http://www.wikidata.org/entity/Q16018866", "itemLabel": "Norman Neasom", "itemDescription": "English painter", "wikipedia_url": "https://en.wikipedia.org/wiki/Norman_Neasom", "wikipedia_page": {"main": "Norman Neasom RWS, RBSA (7 November 1915 – 22 February 2010) was an English painter and art teacher. He grew up on Birchensale Farm in Brockhill Lane on the outskirts of Redditch, Worcestershire. On finishing his schooling at Redditch County High School, aged 16, he was given a scholarship at the Birmingham College of Art where, from 1931, he worked under Bernard Fleetwood-Walker, Harold Holden, Henry Sands, Michael Fletcher and William Colley.During World War II, his work on the family farm was a reserved occupation, though he did undertake St John's Ambulance and Civil Defence duties. He also briefly worked in London, for journals such as Punch.After World War II he took up lecturing at the Birmingham College of Art. He also taught at the Bournville Art College and at Aston, and later in 1953 moved to Redditch School of Art. On the death of the then principal the School became part of Redditch College with Neasom becoming Head of Department. In 1979 he retired in order to devote all his time to painting, and became a member of the Royal Watercolour Society.Neasom exhibited at the Royal Academy, The Royal Watercolour Society, Royal Birmingham Society of Artists (RBSA), Birmingham Museum and Art Gallery, The Mall Gallery, Chris Beetles Gallery and the Stratford Art Society. His work is to be found in the permanent collections of the Queen, The Queen Mother, Birmingham Museum and Art Gallery, Royal Watercolour Society, Royal Birmingham Society of Artists and the West Midlands Arts Council.He produced the illustrations for more than 40 books. His work has been used on the cover of Reader's Digest.\nAfter retirement, he drew and published historical maps.He was commissioned by the Royal Watercolour Society to paint pictures as a 70th birthday gift for Queen Elizabeth II and a 100th birthday gift for Queen Elizabeth The Queen Mother.An avid sailor, he designed his own 9 feet (2.7 m) sailing dinghy and built nearly 200 boats.A number of his letters, including a hand-written autobiography, are in the archives of the RBSA.", "link_mentions": {}}}