{"wiki_id": "http://www.wikidata.org/entity/Q1603342", "itemLabel": "Sheila Burrell", "itemDescription": "English actress (1922-2011)", "wikipedia_url": "https://en.wikipedia.org/wiki/Sheila_Burrell", "wikipedia_page": {"main": "Sheila Mary Burrell (9 May 1922 – 19 July 2011) was a British actress. A cousin of Laurence Olivier, she was born in Blackheath, London, the daughter of a salesman. She attended St John's, Bexhill-on-Sea and the Webber Douglas Academy of Dramatic Art, London. Her first marriage to actor Laurence Payne was dissolved and she then married David Sim, a portrait and theatre photographer. She is primarily remembered in the United States for her performance as Lady Rochford in three episodes of the television series Six Wives of Henry VIII.", "link_mentions": [{"page": "A Severed Head", "response": ["With J.B. Priestley, Murdoch adapted her book for the stage. The play, directed by Val May, opened at the Theatre Royal, Bristol, in May 1963. In July 1963, it moved to the Criterion Theatre in London, for a run of 1,044 performances.Who's Who in the Theatre, 14th edition, Pitman (1967) In New York, after four previews, the Broadway production, also directed by May, opened on 28 October 1964 at the Royale Theatre, where it ran for only 29 performances. The cast included Sheila Burrell, reprising her role as Honor Klein, Robin Bailey again playing Martin Lynch-Gibbon, and Jessica Walter as Georgie. The novel was also made into a 1970 film starring Claire Bloom, Lee Remick, Richard Attenborough and Ian Holm. The screenplay was written by Frederic Raphael."]}, {"page": "1996 in film", "response": ["| Cold Comfort Farm || Universal Pictures / Gramercy Pictures || John Schlesinger (director); Malcolm Bradbury (screenplay); Eileen Atkins, Kate Beckinsale, Sheila Burrell, Stephen Fry, Freddie Jones, Joanna Lumley, Ian McKellen, Miriam Margolyes, Rufus Sewell, Ivan Kaye, Jeremy Peters, Maria Miles, Christopher Bowen, Louise Rea, Sophie Revell, Rupert Penry-Jones, Angela Thorne, Harry Ditson || Comedy || Live action"]}, {"page": "Jane Boleyn, Viscountess Rochford", "response": ["In the 1970 BBC series The Six Wives of Henry VIII starring Keith Michell as Henry, Sheila Burrell portrayed Lady Rochford in several segments throughout the programme, primarily in the segments concerning Anne Boleyn and Catherine Howard. In the 2003 British 2-part television drama Henry VIII, Lady Rochford was played by Kelly Hunter. She appeared opposite Helena Bonham Carter as Anne Boleyn, Ray Winstone as Henry VIII and Emily Blunt as Catherine Howard. In the film adaptation of Philippa Gregory's novel The Other Boleyn Girl, Jane Boleyn (played by Juno Temple) was a minor character. In both these representations, Jane was shown as being a political tool in the hands of her husband's uncle, the Duke of Norfolk, although the presentation of her in The Other Boleyn Girl was more sympathetic."]}, {"page": "The Naked Sun", "response": ["* Sheila Burrell as Under-Secretary Minnim"]}, {"page": "The Darling Buds of May (TV series)", "response": ["* Sheila Burrell as Mrs. Kinthley, owner of the hop-garden bought by Charlie (4 episodes)"]}, {"page": "The Wednesday Play", "response": ["| Joss AcklandPatricia LawrenceJohn StrattonChristine HargreavesSheila BurrellJoan SandersonArthur Hewlett"]}, {"page": "Paranoiac (film)", "response": ["Paranoiac is a 1963 British thriller film from Hammer Films. Directed by Freddie Francis, it stars Janette Scott, Oliver Reed, Sheila Burrell, and Alexander Davion. The screenplay, written by Jimmy Sangster, was based loosely on the 1949 crime novel Brat Farrar by Josephine Tey.", "*Sheila Burrell as Aunt Harriet"]}, {"page": "Cloudburst (1951 film)", "response": ["Cloudburst is a 1951 British crime drama film produced by Hammer Films, directed by Francis Searle, starring Robert Preston and featuring Elizabeth Sellars, Harold Lang, Colin Tapley and Sheila Burrell.  The script is based on a play written by Leo Marks, a wartime cryptographer for the Special Operations Executive, and later the author of a memoir about his wartime work, Between Silk and Cyanide (1998).  ", "* Sheila Burrell as Lorna Dawson  "]}, {"page": "The Desperados", "response": ["* Sheila Burrell as Emily Galt"]}, {"page": "List of The Avengers and The New Avengers cast members", "response": ["* Sheila Burrell"]}, {"page": "List of Western films of the 1960s", "response": ["|The Desperados || Henry Levin || Vince Edwards, Jack Palance, George Maharis, Sylvia Syms, Kate O'Mara, Christian Roberts, Neville Brand, Sheila Burrell, Christopher Malcolm, Kenneth Cope, Patrick Holt || United States || traditional Western shot in Spain"]}, {"page": "List of British films of 1949", "response": ["|The Man in Black || Francis Searle || Betty Ann Davies, Sheila Burrell || Thriller ||"]}, {"page": "When We Are Married", "response": ["BBC's Play of the Month broadcast an adaptation on 29 December 1975 directed by David Giles with John Stratton as Joseph Helliwell, Beryl Reid as Maria Helliwell, Eric Porter as Albert Parker, Patricia Routledge as Annie Parker, Richard Pearson as Herbert Soppitt, Thora Hird as Clara Soppitt, Shirley Steedman as Ruby Birtle, Sheila Burrell as Mrs. Northrop, Ronnie Barker as Henry Ormonroyd and Sheila Reid as Lottie Grady."]}, {"page": "Le Voyageur sans bagage", "response": ["*Juliette – Sheila Burrell"]}, {"page": "2011 in film", "response": ["| style=\"text-align:center;\"| 19 || Sheila Burrell || style=\"text-align:center;\"| 89 || style=\"text-align:center;\"| British || style=\"text-align:center;\"| Actress || "]}, {"page": "Colin Tapley", "response": ["| 1951 || Cloudburst || Inspector Davis || Francis Searle || Robert Preston, Elizabeth Sellars, Sheila Burrell, Harold Lang ||"]}, {"page": "John Battles", "response": ["The Mountains Look Different centers on a young Irish woman, played in this production by British stage and screen veteran Sheila Burrell, trying to leave behind a past that includes a turn as a prostitute in London. Upon return to her native west of Ireland with her husband-to-be, she meets up with her past in the form of her fiancé's father, a former customer."]}, {"page": "The Man in Black (film)", "response": ["The Man in Black is a 1950 British thriller film directed by Francis Searle and starring Betty Ann Davies, Sheila Burrell and Sid James. It was adapted by Hammer Film Productions from the popular British radio series Appointment with Fear featuring Valentine Dyall. Dyall (The \"Man in Black\" of the radio series) here provides the on screen introduction to the film, as \"The Story-Teller\"."]}, {"page": "The Rossiter Case", "response": ["The Rossiter Case is a 1951 British crime film directed by Francis Searle and starring Helen Shingler, Clement McCallin, Sheila Burrell and Stanley Baker in a small role. A man has an affair with his disabled wife's sister - and when the sister is murdered, suspicion falls on him.", "* Sheila Burrell as Honor "]}, {"page": "Cold Comfort Farm (film)", "response": ["* Sheila Burrell as Ada Doom"]}, {"page": "Laughter in the Dark (film)", "response": ["* Sheila Burrell as Miss Porly"]}, {"page": "The Feathered Serpent (TV series)", "response": ["* Keelag: Sheila Burrell"]}, {"page": "Women Without Men (1956 film)", "response": ["* Sheila Burrell - Babs "]}, {"page": "Black Orchid (film)", "response": ["* Sheila Burrell ...  Annette"]}, {"page": "2011 in the United Kingdom", "response": ["**Sheila Burrell, actress (b. 1922)"]}, {"page": "Deaths in July 2011", "response": ["*Sheila Burrell, 89, British actress."]}, {"page": "List of horror films of 1963", "response": ["| data-sort-value=\"Francis, Freddie\" | Freddie Francis || Janette Scott, Oliver Reed, Sheila Burrell || United KingdomUnited States || "]}, {"page": "The Unconquered (short story)", "response": ["The story was adapted for television in 1970 by James Saunders, starring Michael Pennington as Hans, Caroline Mortimer as Annette and Jack Woolgar and Sheila Burrell as Monsieur and Madame Perrier.IMDB entry"]}, {"page": "Ian McCurrach", "response": ["In 1982, he played Newbugs in the TV series Young Sherlock: The Mystery of the Manor House opposite Andrew Johns and Michael Irwin. From 3 November 1982 he starred opposite Eamon Boland, Clive Mantle, C.J. Allen and Philip Donaghy in David Hayman's award-winning stage production of \"Coming Clean\" at the Bush Theatre in London. In 1983, he appeared in the series Metal Mickey as a student organiser, and in 1984 he had appearances in  The Jewel in the Crown  and Now and Then. In 1985 he portrayed the lead character of Pip with the \"tousled charm of a young Tommy Steele\" in a Peter Coe production of Dicken's \"Great Expectations\" at the Old Vic Theatre in London opposite Roy Dotrice, Sheila Burrell, Leon Greene and Tony Jay. Country Life noted that Ian McCurrach's \"glamorous-looking Pip narrates his childhood experiences as if engaged in a loud oratorical exercise.\" In 1986 he appeared in Storyboard, and in 1987 played an editor in Ron Peck's crime thriller film Empire State. In 1988 he portrayed a Swedish student in an episode of Inspector Morse, and in 1989 had a role as Adian Fielding in the series Mystery!: Campion. Interested in travel, McCurrach took full advantage of his appearances in theatre world tours, visiting unusual destinations such as Burma and Oman."]}, {"page": "Colonel March Investigates", "response": ["*Joan Forsythe –\tSheila Burrell"]}, {"page": "Sheila Mary Burrell", "response": ["#REDIRECT Sheila Burrell"]}, {"page": "Hell Is Empty", "response": ["*Sheila Burrell as Judge"]}, {"page": "Charlesworth (TV series)", "response": ["Other actors who appeared include Lana Morris, Barbara Shelley, George Coulouris, Arnold Ridley, Terence Alexander, William Mervyn, Wally Patch, Naomi Chance, Leslie Perrins, Edward Evans, James Raglan, Leonard Sachs, Ina De La Haye, Austin Trevor, Sheila Burrell, Jack Hedley, Frank Pettingell, Robert Raglan, Olive Sloane, Josephine Tewson, Mary Kerridge, Patrick Troughton, John Forbes-Robertson, Willoughby Goddard, Elizabeth Shepherd, Norman Mitchell, Sam Kydd and Justine Lord."]}, {"page": "Campion (1959 TV series)", "response": ["Other actors appearing in the first series include Denis Quilley, Michael Gough, Noel Howlett, Vanda Godsell, Richard Pearson, Olive Sloane, Sheila Burrell and Wally Patch. The second series featured Mary Merrall, Andre Van Gyseghem, Arthur Brough and Shay Gorman."]}]}}