{"wiki_id": "http://www.wikidata.org/entity/Q16023302", "itemLabel": "John Philipps, 1st Viscount St Davids", "itemDescription": "British Liberal politician (1860-1938)", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Philipps,_1st_Viscount_St_Davids", "wikipedia_page": {"main": "John Wynford Philipps, 1st Viscount St Davids , (30 May 1860 – 28 March 1938) was a British Liberal politician.", "link_mentions": [{"page": "Warminster", "response": ["*John Philipps, 1st Viscount St Davids (1860–1938), politician."]}, {"page": "Baron Strange", "response": ["However, the abeyance was terminated in 1921 in favour of Elizabeth Frances Philipps, Viscountess St Davids, who became the fourteenth Baroness. She was the second wife of John Philipps, 1st Viscount St Davids. The abeyance of the ancient baronies of Hungerford and de Moleyns was terminated at the same time in her favour. On 31 July 1963, the Peerage Act 1963 came into effect, which, among other things, enabled women to sit and vote in the House of Lords by virtue of an hereditary peerage.- Peerage Act 1963 Following the passage of the Act, Lady St Davids applied for a writ of summons to the House of Lords in right of her Strange barony, which was subsequently issued to her, and she took her seat in the House on 19 November 1963Lords Hansard (19 November 1963) - Baroness Strange of Knockin as the first female peer to do so under the provision of the Peerage Act 1963. On her death in 1974 the titles were inherited by her son, the fifteenth Baron Strange, who had already succeeded his father as second Viscount St Davids. As of 2013 the titles are held by the second Viscount's grandson, the fourth Viscount and seventeenth Baron Strange."]}, {"page": "Baron Milford", "response": ["The title was revived for a second time in the Peerage of the United Kingdom in 1939, when Sir Laurence Philipps, 1st Baronet, was made Baron Milford, of Llanstephan in the County of Radnor. He had already been created a Baronet, of Llanstephan in the County of Radnor, in 1919. Philipps was the sixth son of Sir James Philipps, 12th Baronet, of Picton Castle, and the younger brother of John Philipps, 1st Viscount St Davids and Owen Philipps, 1st Baron Kylsant. He was succeeded by his son, the second Baron. He became a Communist and was disinherited by his father. Lord Milford is the only member of the Communist Party of Great Britain to sit in the House of Lords.  the titles are held by his grandson, the fourth Baron, who succeeded his father in 1999."]}, {"page": "National Liberal Club", "response": ["*John Philipps, 1st Viscount St Davids, Liberal MP 1888–95 and peer"]}, {"page": "Lord Lieutenant of Pembrokeshire", "response": ["*John Philipps, 1st Viscount St Davids 21 March 1911 – 21 December 1932"]}, {"page": "Laurence Philipps, 1st Baron Milford", "response": ["Philipps was the sixth son of Reverend Sir James Erasmus Philipps, 12th Baronet of Picton, and his wife the Hon. Mary Margaret (née Best). John Philipps, 1st Viscount St Davids, and Owen Philipps, 1st Baron Kylsant, were his elder brothers."]}, {"page": "Owen Philipps, 1st Baron Kylsant", "response": ["With financial assistance from his eldest brother John Philipps, 1st Viscount St Davids Philipps set up his own shipping firm Philipps & Co in 1888, bought his first ship in 1889 and by the end of the nineteenth century the two brothers owned two shipping lines (King Line Ltd and the Scottish Steamship Company), a finance company (the London Maritime Investment Company), and the London and Thames Haven Petroleum Wharf. Taking advantage of a low share price, the brothers acquired shares in the Royal Mail Steam Packet Company, and by 1902 Owen had become chairman and managing director of the line. Over the next twenty years he and the Royal Mail Steam Packet Company acquired a controlling interest in more than twenty other companies, including the Union-Castle Line and the Pacific Steam Navigation Company. Acquisitions continued, culminating in the purchase of the White Star in 1927."]}, {"page": "Jestyn Philipps, 2nd Viscount St Davids", "response": ["Jestyn Reginald Austin Plantagenet Philipps, 2nd Viscount St Davids , (19 February 1917 – 10 June 1991) was a British peer, the only surviving son of John Philipps, 1st Viscount St Davids, and his second wife, Elizabeth Philipps, Viscountess St Davids (née Abney-Hastings)."]}, {"page": "Philipps House", "response": ["In 1917 foreclosure proceedings were brought against Dinton House and its estate. The estate was bought by Bertram Erasmus Philipps (1870–1947), a descendant of the Philipps baronets of Picton Castle (1621 creation);Bertram was the 5th son of the Reverend Sir James Erasmus Philipps, 12th baronet, of Picton Castle, Vicar of Warminster, Wilshire.  His brothers were John Philipps, 1st Viscount St Davids; Owen Philipps, 1st Baron Kylsant; Major-General Sir Ivor Philipps; and Laurence Philipps, 1st Baron Milford; several of them were Members of Parliament and directors or stockholders in the Royal Mail Steam Packet Company and other shipping companies. who renamed the house after himself.  He was High Sheriff of Wiltshire in 1923.\"Philipps House,\" Art UK – Your Paintings, accessed 22 June 2013.\"Philipps House (Dinton House),\" The DiCamillo Companion, accessed 22 June 2013.  Philipps and his wife, who had no children, annually hosted the pupils from the village school for a tea party at Philipps House with sports and fireworks."]}, {"page": "Roland Philipps", "response": ["Roland Erasmus Philipps,   (27 February 1890 – 7 July 1916) was a writer and a leading Scout official. He was the second son of John Philipps, 1st Viscount St Davids and his first wife, Leonora Gerstenberg. He was educated at Twyford School, Winchester College and New College, Oxford.Biography"]}, {"page": "John Wynford Philipps", "response": ["#REDIRECT John Philipps, 1st Viscount St Davids"]}, {"page": "John Wynford Philipps, 1st Viscount St Davids", "response": ["#REDIRECT John Philipps, 1st Viscount St Davids"]}, {"page": "Roch Castle", "response": ["The castle remained decaying until 1900, when purchased by John Philipps, 1st Viscount St Davids, who restored it with a steel frame and new concrete floors to the designs of D. E. Thomas of Haverfordwest. Further works were carried out in 1910 and circa 1918–20, the latter by D. F. Ingleton."]}, {"page": "William Rees-Davies (judge)", "response": ["He was a Liberal Member of Parliament for Pembrokeshire, from July 1892 to 1898,The Liberal Year Book for 1906, p. 275. having succeeded his father, Sir William Davies in the seat. He was private secretary to the Chancellor of the Exchequer, Sir William Harcourt, from 1893 to 1895. He was succeeded by the Liberal politician John Philipps, 1st Viscount St Davids."]}, {"page": "List of Old Felstedians", "response": ["* John Philipps, 1st Viscount St Davids (1860–1938), financier and politician, Lib. MP for Mid Lanarkshire (1888–1894) and Pembrokeshire (1898–1904), 13th Baronet of Picton Castle (from 1912) (ODNB)"]}, {"page": "John Philipps", "response": ["*John Philipps, 1st Viscount St Davids (1860–1938), British Liberal politician"]}]}}