{"wiki_id": "http://www.wikidata.org/entity/Q16014316", "itemLabel": "Francis Baines", "itemDescription": "British composer", "wikipedia_url": "https://en.wikipedia.org/wiki/Francis_Baines_(musician)", "wikipedia_page": {"main": "Francis Athelstan Baines (1917–1999) was a British composer and double-bass player.", "link_mentions": [{"page": "Taverner Consort and Players", "response": ["The Taverner Consort and Players were led until the early 1990s by baroque violinist John Holloway. The ensemble has collaborated with noted early music practitioners such as singers Emma Kirkby, Emily Van Evera, Evelyn Tubb, Rogers Covey-Crump, and instrumentalists Nigel North, Francis Baines and Anthony Bailes. The players' orchestral make-up typically includes instruments such as baroque violins, viols, lutes, theorbo and chamber organ continuo."]}, {"page": "Claude Hobday", "response": ["He played in leading orchestras, including the Royal English Opera under Sir Arthur Sullivan, the Glasgow Choral Union under Augustus Manns, the Scottish Orchestra under George Henschel, in the Richter Concerts in London, in the London Symphony Orchestra as a founding member from 1904–10, in the Beecham Symphony Orchestra from 1910–16 and in the Royal Philharmonic Orchestra, before becoming a founder member of the BBC Symphony Orchestra in 1930. He retired from playing in 1940. He was professor of double-bass at the Royal College of Music from 1902–46, his pupils including Adrian Beers, Ernest Ineson and Francis Baines. He was a notable collector of basses, owning instruments by Testore, Montagnana, Gasparo da Salò, Gennaro Gagliano, and Vincenzo Panormo."]}, {"page": "Hoffnung Music Festival", "response": [":Fanfare by Francis Baines", ":Hoffnung Festival Overture (Francis Baines)", ":\"Rigmarole\" - Introductory Music Played in the Foyer (Francis Baines)", ":Festival Anthem (Francis Baines)"]}, {"page": "Francis Baines", "response": ["Francis Baines may refer to:", "* Francis Baines (cricketer) (1864–1948), English cricketer", "* Francis Baines (Jesuit) (1648–1710), English Jesuit", "* Francis Baines (musician) (1917–1999), British composer and double-bass player"]}, {"page": "Musica Reservata (early music group)", "response": ["The first proper public concert took place in Fenton House, Hampstead, on 30 January 1960. A programme of medieval music was performed by Grayston Burgess (counter-tenor), Eric Halfpenny (early cross flute), John Sothcott (recorder), June Baines (tenor viol), John Beckett (tenor viol and regal), Francis Baines (hurdy-gurdy and bagpipes), Michael Morrow (lute) and Jeremy Montagu (percussion). The music consisted of pieces by Dufay, Binchois, Dunstable, Ockeghem, Landini and de Lantins.John S. Beckett, pp. 126-7, 508."]}]}}