{"wiki_id": "http://www.wikidata.org/entity/Q16066222", "itemLabel": "Frederick Nash", "itemDescription": "English painter and draughtsman", "wikipedia_url": "https://en.wikipedia.org/wiki/Frederick_Nash_(painter)", "wikipedia_page": {"main": "Frederick Nash (1782–1856) was an English painter and draughtsman.\nFrederick Nash was born in Lambeth. He initially studied architectural drawing under Thomas Malton, then later enrolled at the Royal Academy of Arts. Between 1801 and 1809 Nash worked with the antiquarians John Britton and Edward Wedlake Brayley. In 1810, he became a member of Society of Painters in Watercolours, an organization whose members had seceded from the Royal Academy over complaints that their work was not being recognized. Nash primarily painted landscapes, and made sketching trips to Calais, Caen, the Moselle river and the Rhine. In 1834 he moved to Brighton where he continued working until his death in 1856.", "link_mentions": [{"page": "List of British artists", "response": ["* Frederick Nash (painter) (1782–1856) – architectural and landscape painter"]}, {"page": "Frederick Nash", "response": ["Frederick Nash (February 9, 1781 – December 5, 1858) was an American lawyer and jurist from Hillsborough, North Carolina. He served on the North Carolina Supreme Court and was its chief justice from 1852 until his death."]}, {"page": "Benjamin Hick", "response": ["Hick's support for the British school extended to: Samuel Austin, Thomas Barker, William Roxby Beverly, John Boaden, William Bradley, Augustus Wall Callcott, George Cattermole, Thomas Sidney Cooper, James Wilson Carmichael, David Cox, James Francis Danby, Samuel Drummond, Charles Lock Eastlake, Copley Fielding, John Rogers Herbert, Henry Howard, John Prescott Knight, William Linton, Henry Liverseege, Frederick Richard Lee, Philip James de Loutherbourg, John Martin, George Morland, Frederick Nash, the Nasmyths, Paul Falconer Poole, Samuel Prout, Thomas Miles Richardson, David Roberts, John Rhodes, William Shayer, Clarkson Frederick Stanfield, Caleb Robert Stanley, Philip Francis Stephanoff, Thomas Stothard, John Tennant, Thomas Uwins, Alfred Vickers, Benjamin West, Richard Westall, David Wilkie, John Wilson, Richard Wilson, John Michael Wright, John Christian Zeitter and others."]}, {"page": "1856 in art", "response": ["** Frederick Nash, English painter and draughtsman (born 1782)"]}, {"page": "Woodstock (novel)", "response": ["*, a painting by Frederick Nash, engraved by Lumb Stocks for the Forget Me Not annual, 1839, with illustrative verse by Letitia Elizabeth Landon."]}, {"page": "1782 in art", "response": ["** Frederick Nash, English painter and draughtsman (died 1856)"]}, {"page": "Nash (surname)", "response": ["*Frederick Nash (1781–1858), American lawyer and jurist", "*Frederick Nash (painter) (1782–1856), English painter "]}, {"page": "Brighton Museum & Art Gallery", "response": ["In September 1851 it was announced that part of the Pavilion was to be appropriated for annual art exhibitions and two months later the first of these was held. The local talent to which it was confined included Frederick Nash and Copley Fielding. The room devoted to the exhibition was the original South Gallery, now the First Conference Room, but later the exhibitions even spread to the Great Kitchen."]}, {"page": "George Cooke (engraver)", "response": ["In 1833, Cooke produced Views of the Old and New London Bridges, executed conjointly with his son, Edward William Cooke, who also made the drawings. He also produced plates for Frederick Nash's Views in Paris, Colonel Batty's Views of European Cities, Baron Taylor's Spain published by Robert Jennings, Rhodes's Peak Scenery and Yorkshire Scenery, several for Stark's Scenery of the Rivers of Norfolk, and one of \"Southampton\", after Copley Fielding, for the Gallery of the Society of Painters in Water Colours."]}, {"page": "George Robert Lewis", "response": ["Some of Lewis's portraits were engraved, and he aquatinted a large plate of the procession of the knights of the order of the Bath in Westminster Abbey, after Frederick Nash. In 1838, he printed An Address on the subject of Education as connected with Design in every department of British Manufacture, together with Hints on the Education of the Poor generally (Hereford)."]}, {"page": "Lumb Stocks", "response": ["* Engraving of  by Frederick Nash for the Forget Me Not annual, 1839, with illustrative verse by Letitia Elizabeth Landon."]}, {"page": "Britannia Depicta", "response": ["* Frederick Nash 1782–1856"]}, {"page": "Londina Illustrata", "response": ["Most of the plates carry names of the draughtsman and engraver. A few early artists are included such as Wenceslaus Hollar. More recent draughtsmen included Robert Blemmell Schnebbelie, Frederick Nash, William Capon, George Jones, H. Gardner, George Shepherd, William Goodman, C.J.M. Whichelo, John Carter, Fellows, C. Westmacott, E. Burney, Bartholomew Howlett, Thomas H. Shepherd, Banks, Ravenhill, William Oram. Engravers include James Stow, T. Dale, Bartholomew Howlett, John Whichelo, W. Wise, Samuel Rawle, T. Bourne, H. Cook, M. Springsguth, Wenceslaus Hollar, Joseph Skelton, Israel Silvestre, Richard Sawyer, S. Springsguth junr., Taylor."]}]}}