{"wiki_id": "http://www.wikidata.org/entity/Q16090464", "itemLabel": "Ian Aitken", "itemDescription": "Journalist, commentator", "wikipedia_url": "https://en.wikipedia.org/wiki/Ian_Aitken_(journalist)", "wikipedia_page": {"main": "Ian Levack Aitken (19 September 1927 – 21 February 2018) was a British journalist and political commentator.\n\n", "link_mentions": [{"page": "Airdrie, North Lanarkshire", "response": ["*Ian Aitken - political journalist"]}, {"page": "Tribune (magazine)", "response": ["Foot remained in the editorial chair until 1952 when Bob Edwards took over, but he returned after losing his parliamentary seat in Plymouth in 1955. During the early 1950s, Tribune became the organ of the Bevanite left opposition to the Labour Party leadership, turning against the United States over its handling of the Korean War, then arguing strongly against West German rearmament and nuclear arms. However, Tribune remained critical of the Soviet Union as it denounced Stalin on his death in 1953 and in 1956 opposed the Soviet suppression of the Hungarian Revolution and the British government's Suez adventure. The paper and Bevan parted company after his \"naked into the conference chamber\" speech at the 1957 Labour Party conference. For the next five years, Tribune was at the forefront of the campaign to commit Labour to a non-nuclear defence policy, \"the official weekly of the Campaign for Nuclear Disarmament\" (CND) as the direct actionists in the peace movement put it. CND's general secretary Peggy Duff had been Tribune general manager. Among journalists on Tribune in the 1950s were Richard Clements, Ian Aitken and Mervyn Jones, who related his experience on the paper in his autobiography Chances."]}, {"page": "Michael White (journalist)", "response": ["White began his career in journalism at the Reading Evening Post (1966–71) and after a spell at London's Evening Standard (1970–71) he moved to The Guardian, where he worked as a sub/feature writer (1971–74), diary writer (1974–76), political correspondent and sketchwriter (1976–84) and Washington correspondent from 1984. He became the newspaper's political editor in 1990, succeeding Ian Aitken; he relinquished the position to Patrick Wintour at the beginning of 2006. He retired from his Guardian positions in October 2016. In 2003, he was voted Print Journalist of the Year by MPs and Peers in The House/BBC Parliamentary Awards."]}, {"page": "Aitken (surname)", "response": ["* Ian Aitken (disambiguation), one of several people including:", "**Ian Aitken (journalist) (1927–2018), British journalist and political commentator", "**Ian Aitken (footballer) (born 1967), former Australian rules footballer"]}, {"page": "Political editor", "response": ["| Ian Aitken || 1975–1990 ||"]}, {"page": "1990 Mid Staffordshire by-election", "response": ["The Labour campaign was very tightly controlled by the party officials, under the director of communications Peter Mandelson.Nicholas Wood, \"Labour hope sticks to script\", The Times, 20 March 1990 Heal held no public meetings and the morning press conferences were limited to 20 minutes (with senior party figures often replying rather than Heal); most of her campaign was conducted on personal appearances in pubs and clubs and 'Red Rose Rallies'. The other parties were angered by this approach, with Liberal Democrat leader Paddy Ashdown denouncing the way Sylvia Heal was \"packaged and handled .. as if she was some Walworth Road barbie woman\", and that her leaflets said nothing about her ideas or Labour policies.Richard Ford, \"Frustrated Tories hunt their opponent\", The Times, 14 March 1990 After initially implying that Heal was a 'birdbrain', the Conservatives switched to claiming her control by the party was done in order to conceal Labour policies. The Daily Mail sent a reporter armed with a long list of questions to try to get answers from Heal, but her minder Peter Snape determined to stop him.Ian Aitken, \"Loyal Tarzan no name-dropper\", The Guardian, 16 March 1990, p. 6 The Conservatives noted that at the 1989 Labour Party conference Heal had supported a motion to cut defence spending by £5 billion.Patrick Wintour, \"Byelection panic button leaves Tories grounded\", The Guardian, 17 March 1990, p. 2", "The Guardian reporter Ian Aitken found the Liberal Democrat campaign a 'pale shadow' of those run by its former campaign director Andy Ellis. However the party held off Labour to retain a local council seat in Western Springs ward, part of Rugeley, on 14 March.Craig Seton, \"Kinnock sees a Tory defeat as notice to quit\", The Times, 17 March 1990 A poll by Mori for The Times published on 19 March showed that the poll tax was identified by 88% of voters as one of the three most important issues. The only other issues scoring significantly were mortgage and interest rates and the National Health Service, which each had 31%. Voting intentions were Labour 55%, Conservatives 29%, Liberal Democrats 9%, Green Party 3%, SDP 2% and Others 2%.Robin Oakley, Craig Seton, \"Opinion polls predict sweeping Labour win\", The Times, 19 March 1990"]}, {"page": "King Alfred School, London", "response": ["* Ian Aitken, journalist and political commentator"]}, {"page": "John Burgan", "response": ["John Burgan is the author of entries on Robert Vas, Jean-Pierre Gorin and The Back of Beyond in the Encyclopaedia of the Documentary Film edited by Ian Aitken.New York and London: Routledge, 2006"]}, {"page": "Jonathan Dawson", "response": ["He continued to give many public lectures, addressing the Royal Australian Institute of Architects annual awards as Keynote Speaker (2004) on film and architecture as well as creating a series of new adult education courses on screenwriting and contemporary film. In association with Screen Tasmania  and The State Cinema  he has curated and lectured on film theory and history, hosting movie seasons with themes from Independent Movies to new French Film, Australian Film and Documentary. His regular audiences for these short lecture/film screenings include government ministers, department heads and many film professionals. He also wrote a weekly popular culture column (2002–05) and contributes regular book reviews to the Hobart Mercury  and contributes key essays, Metro, Screen Education and for the online journal sensesofcinema , voted (2007) by The Times as the world's finest international online film journal and contributing major essays to the Dartmouth Medal award-winning Concise Encyclopedia of the Documentary Film by Ian Aitken, Routledge/Taylor & Francis (2006) .", "* Encyclopaedia of the Documentary Film (Ian Aitken, Editor). 3 Vols. New York, Routledge Reference. Essays by Jonathan Dawson:Volume 1:pp 42–45, 56 -61,105–106, 337–338."]}, {"page": "The Guardian", "response": ["* Ian Aitken"]}, {"page": "List of Question Time episodes", "response": ["|Ian Aitken, Menzies Campbell, Jane Ewart-Biggs, Douglas Hurd", "|Ian Aitken, Barbara Castle, Ian Crowther, David Hunt"]}, {"page": "Geoffrey Goodman", "response": ["After the end of hostilities, he briefly worked on the Manchester GuardianGuardian contributor profile page. (1946–47) before joining the Daily Mirror, but was sacked at Christmas 1948. He then joined the News Chronicle. A one-time member of the Communist Party, he left it in 1951, and henceforward supported the Labour Party. As a friend of Aneurin Bevan, whom he had first met in 1948 outside St Pancras Town Hall, Goodman gave support to Tribune, the newspaper Bevan had founded just before the war, and helped new staff writer Ian Aitken.Ian Aitken, \"Geoffrey Goodman took me under his wing\", theguardian.com. 6 September 2013."]}, {"page": "Ian Aitken", "response": ["Ian Aitken may refer to:", "*Ian Aitken (journalist) (1927–2018), British journalist and political commentator", "*Ian Aitken (footballer) (born 1967), former Australian rules footballer "]}, {"page": "Mark Garnett", "response": ["With Ian Aitken, he was the authorised biographer of Conservative politician William Whitelaw.", "*(with Ian Aitken), Splendid! Splendid! The Authorised Biography of Willie Whitelaw (London: Jonathan Cape, 2002)."]}, {"page": "Like the Roman", "response": ["Ian Aitken reviewed the book in the New Statesman: \"At 1,024 pages, it would have benefited from some judicious cutting. But for all its length, it is never tedious. Heffer writes with the same lucidity as his subject, but happily without Powell's corkscrew-like sentence construction.\" In 2014, Sathnam Sanghera selected Like the Roman as one of the \"top 10 books of the Midlands\" for an article in  The Guardian. Sanghera wrote: \"Powell remains a highly controversial figure, but if you want to understand the story of postwar immigration in Britain, and, arguably, postwar British politics at large, you need to read this book.\""]}, {"page": "2018 in the United Kingdom", "response": ["**Ian Aitken, 90, British journalist and political commentator."]}, {"page": "2018 in England", "response": ["**Ian Aitken, 90, British journalist and political commentator."]}, {"page": "Deaths in February 2018", "response": ["*Ian Aitken, 90, British journalist and political commentator.Ian Aitken Obituary"]}, {"page": "Ian Levack Aitken", "response": ["#REDIRECT Ian Aitken (journalist)"]}]}}