{"wiki_id": "http://www.wikidata.org/entity/Q16089785", "itemLabel": "Mark Scott", "itemDescription": "British rower", "wikipedia_url": "https://en.wikipedia.org/wiki/Mark_Scott_(rower)", "wikipedia_page": {"main": "Mark Bodley Scott (17 April 1923 – 11 February 2013) was a British rower who competed in the 1948 Summer Olympics.Scott was born into a medical family based in Dorset. He was the son of Maitland Bodley Scott (1878–1942) and the youngest of six sons. As a child, he lived in Shiplake on the River Thames.\nScott was educated at Bryanston School. Aged 18, he joined the Royal Naval Volunteer Reserve during World War II. While on active service in Sicily, he was wounded in a mortar bomb explosion, during which he lost one eye and his other eye was damaged by shrapnel. He was in hospital recuperating for almost a year in North Africa.\nIn 1946 when he was demobilised, he joined North London Polytechnic, studying architecture. He also joined the Thames Rowing Club. He rowed in the 1948 Henley Regatta and then for Britain at the 1948 Summer Olympics, in the coxed pairs event, with Bakie James.Mark Bodley Scott was involved in local government, including Sonning Parish Council and Wokingham Rural District Council. He was also chair of Sonning Working Men’s Club.\nIn 1953, Scott married Josephine Clare Stanley, also an architect, and they had three children. In 2006, they moved from Sonning-on-Thames, where they had lived for 53 years, to Henley-on-Thames, where Mark Bodley Scott died. A voice recording can be heard at the River and Rowing Museum in Henley-on-Thames.", "link_mentions": [{"page": "Thames Rowing Club", "response": ["| Mark Scott"]}, {"page": "Old Bryanstonians", "response": ["* Mark Scott (1923–2013), rower who competed in the 1948 Summer Olympics"]}, {"page": "Mark Scott", "response": ["Mark Scott may refer to:", "*Mark Scott (singer), lead singer of The Miracles", "*Mark Scott, also known as SHY, part of the Scottish rapper and songwriter duo SHY & DRS", "*Mark Scott (radio host) (1936–2005), American talk show host", "*Mark Scott (actor) (1915–1960), TV actor and host of the TV series Home Run Derby", "*Mark Scott (businessman) (born 1962), Vice-Chancellor of the University of Sydney and former managing director of the Australian Broadcasting Corporation", "*Mark Scott (cricketer) (born 1959), English cricketer", "*Mark Scott (footballer) (born 1959), Australian rules footballer", "*Mark Scott (police officer), Australian Federal police officer killed in the Garuda plane crash", "*Mark Scott (rower) (1923–2013), British rower", "*Mark Scott, victim of serial killers Dean Corll and Elmer Wayne Henley"]}, {"page": "Great Britain at the 1948 Summer Olympics", "response": ["|align=left|Howard JamesMark ScottDavid Walker"]}, {"page": "Deaths in February 2013", "response": ["*Mark Scott, 89, British rower.https://www.sonning.org.uk/Public/pdf/Bridge_35.pdf"]}, {"page": "Rowing at the 1948 Summer Olympics – Men's coxed pair", "response": ["|align=left| Mark ScottHoward James ||align=left| David Walker", "|align=left| Mark ScottHoward James ||align=left| David Walker", "|align=left| Mark ScottHoward James ||align=left| David Walker"]}, {"page": "Mark Bodley Scott", "response": ["#REDIRECT Mark Scott (rower)"]}]}}