{"wiki_id": "http://www.wikidata.org/entity/Q16013662", "itemLabel": "Willie Jones", "itemDescription": "Welsh cricketer and rugby union  player (1916-1996)", "wikipedia_url": "https://en.wikipedia.org/wiki/Willie_Jones_(cricketer)", "wikipedia_page": {"main": "William Edward Jones (31 October 1916 – 25 July 1996) was a Welsh cricketer active from 1937 to 1958 who played for Glamorgan.\nHe appeared in 345 first-class matches as a left-handed batsman who bowled slow left-arm orthodox spin. He scored 13,536 runs with eleven centuries and took 192 wickets with a best performance of five for 50.\nHis highest score was 212 not out against Essex in 1948, when he put on 313 for the third wicket with Emrys Davies in three and a quarter hours. 1948 was his most successful season: he hit his only other double-century, 207 against Kent in 245 minutes, and scored 1656 runs in all matches at an average of 40.39, and took 47 wickets at 25.53, to help Glamorgan to their first County Championship.\nHe also played rugby union as a fly-half, representing Wales in an international match during World War II.", "link_mentions": [{"page": "Willie Jones", "response": ["Willie Jones may refer to:", "*Willie Jones (American football) (born 1957), former American football player with the Oakland Raiders", "*Willie Jones (baseball) (1925–1983), American Major League Baseball player", "*Willie Jones (baseball, born 1902) (1902–?), American Negro leagues baseball player", "*Willie Jones (basketball player) (born 1936), former NBA player for the Detroit Pistons", "*Willie Jones (basketball coach), American college basketball coach for North Carolina A&T", "*Willie Jones (cricketer) (1916–1996), Welsh cricketer", "*Willie Jones (drummer) (1929–1991), American drummer", "*Willie Jones III (born 1968), American musician and drummer", "*Willie Jones (blues singer) (born 1936), American blues singer", "*Willie Jones (pianist) (1920–1977), American pianist and bandleader", "*Willie Jones (statesman) (1740–1801), North Carolina delegate to the Continental Congress"]}, {"page": "Glamorgan County Cricket Club", "response": ["| Emrys Davies and Willie Jones"]}, {"page": "List of Glamorgan first-class cricket records", "response": ["| 3rd || 313 ||  Emrys Davies Willie Jones || v Essex || Brentwood || 1948", "| 6th || 230 ||  Willie Jones Len Muncer || v Worcestershire || Worcester || 1953"]}, {"page": "Guy Jewell", "response": ["He represented Hampshire in one first-class match in 1952 against Glamorgan. In Glamorgan's second innings he took a single wicket, that of Willie Jones."]}, {"page": "List of Glamorgan County Cricket Club players", "response": ["* Willie Jones (1937–1958) : W. E. Jones"]}, {"page": "History of English cricket from 1919 to 1939", "response": ["The 1921 team included Trevor Arnott, William Bates, Johnnie Clay, Harry Creber, Stamford Hacker, Jack Nash and Norman Riches. Among the players they introduced through these first nineteen seasons were Jack Mercer, Dai Davies, Cyril Walters, Emrys Davies, Maurice Turnbull, Arnold Dyson, George Lavis, Haydn Davies, Phil Clift, Willie Jones, Wilf Wooller and Allan Watkins."]}]}}