{"wiki_id": "http://www.wikidata.org/entity/Q16018433", "itemLabel": "Jimmy Forsyth", "itemDescription": "photographer", "wikipedia_url": "https://en.wikipedia.org/wiki/Jimmy_Forsyth_(photographer)", "wikipedia_page": {"main": "Jimmy Forsyth (15 August 1913 – 11 July 2009) was a British amateur photographer, who in his later life became celebrated for his portrayal of the working class communities of Tyneside and received wide recognition for this achievement prior to his death aged 95. He was equally accomplished in showcasing both the people and the environment of his chosen locality.", "link_mentions": [{"page": "Benwell and Scotswood", "response": ["The ward has both the West End Library and Denton Burn Library,http://www.newcastle.gov.uk/leisure-libraries-and-tourism/libraries/branch-libraries-and-opening-hours/denton-burn-library which have computers with free internet access. The West End library holds the West Newcastle Picture History Collection of around 17,000 images of the West End, some taken by Jimmy Forsyth.http://www.newcastle.gov.uk/leisure-libraries-and-tourism/libraries/branch-libraries-and-opening-hours/west-end-library Benwell Nature Park and Denton Dene South are located within the ward. Scotswood Leisure Centre hosts various sports clubs and fitness classes. The ward contains three pieces of Play Provision, provided by Newcastle Play Service."]}, {"page": "Tyne and Wear Archives", "response": ["*Jimmy Forsyth (photographer) (15 August 1913 – 11 July 2009) British amateur photographer, who in his later life became celebrated for his portrayal of the working class communities of Tyneside "]}, {"page": "Forsyth (surname)", "response": ["* Jimmy Forsyth (1904–1982), Scottish football player, trainer and physiotherapist", "* Jimmy Forsyth (photographer), (1913–2009), British amateur photographer"]}, {"page": "Dunston Power Station", "response": ["The station was also a popular subject for photographers. It featured in the work of documentary and press photographer Bert Hardy, who photographed it from Benwell, using it as a backdrop whilst photographing a mother and child. It was also photographed by Welsh documentary photographer Jimmy Forsyth (photographer) as part of his Scotswood Road collection."]}, {"page": "James Forsyth", "response": ["*Jimmy Forsyth (1904–1982), Scottish footballer, trainer and physiotherapist", "*Jimmy Forsyth (photographer) (1913–2009), British amateur photographer"]}]}}