{"wiki_id": "http://www.wikidata.org/entity/Q16058481", "itemLabel": "Robert Homburg", "itemDescription": "Australian politician and judge", "wikipedia_url": "https://en.wikipedia.org/wiki/Robert_Homburg", "wikipedia_page": {"main": "Robert Homburg (10 March 1848 – 23 March 1912) was a politician and judge in colonial South Australia. He was a member of the South Australian House of Assembly from 1884 to 1905, representing the electorates of Gumeracha (1884-1902) and Murray (1902-1905). He was Leader of the Opposition from 1901 to 1902 and Attorney-General of South Australia from 1890 to 1892, 1892 to 1893 and 1904 to 1905. His sons Hermann Homburg and Robert Homburg Jr. also served in the House of Assembly, with Hermann also being a long-serving minister.Homburg was born in Brunswick, Duchy of Brunswick, Germany, the son of Wilhelm Homburg (died 1860), a grain merchant, and his wife Caroline Magdalene Pauline.Homburg arrived in South Australia in the year 1857. He was employed in a land agency business until 1868, when he was articled to James Boucaut. The last two years of his articles were served in the office of Sir John Downer, and he was admitted to the bar in April 1874.Homburg was elected to the South Australian House of Assembly as a representative for Gumeracha in April 1884, and at the election of 1887 was re-elected with the Sir Robert Dalrymple Ross. In April 1890 he was again returned with Theodore Hack. In 1880 for a short period he was president of the German Club. He was appointed Attorney-General in Thomas Playford's second Ministry in August 1890, and held office till June 1892, when he retired with his colleagues. Homburg was again Attorney-General from 15 October 1892 to 16 June 1893 and from 4 July 1904 to 24 February 1905 (also being Minister of Education in the latter term). \nHomburg held the seat of Gumeracha until its abolition at the 1902 election. Homburg served as the tenth Leader of the Opposition from 1901 to 1902. Homburg represented the Assembly for Murray from 1902 until the 1905 election.Homburg was appointed a justice of the Supreme Court of South Australia in 1905. He died in Medindie, Adelaide on 23 March 1912; he was survived by a total of four sons and four daughters from his two marriages. The two children of his first marriage, sons Hermann (1874-1964) and Robert junior followed him as lawyers and parliamentarians.", "link_mentions": {}}}