{"wiki_id": "http://www.wikidata.org/entity/Q16062759", "itemLabel": "James William Carling", "itemDescription": "Pavement artist", "wikipedia_url": "https://en.wikipedia.org/wiki/James_William_Carling", "wikipedia_page": {"main": "James William Carling (31 December 1857 – 9 July 1887) was a pavement artist from Liverpool, England.\nCarling was born on 31 December 1857 at 38 Addison Street, Liverpool. His parents Henry and Rose had been married in Roscommon, Ireland, his father's original surname was Carolan, anglicised to Carling following his emigration to England after being evicted during the Irish Famine. His mother's maiden name was Lynch. His mother died when he was aged only 6 years. His father died 4 years after the death of his mother. From an early age James was known as the \"little drawer\" or \"THE LITTLE CHALKER\" and used Liverpool's street pavements for his art and to beg for money. He attended Holy Cross School in Fontenoy Street. After he was arrested by a policeman on Christmas Eve in 1865 and a week in a workhouse, he was sent to St George's Roman Catholic Boys Industrial School in Everton, Liverpool.After leaving the industrial school in 1871, he travelled to America to join his elder brother Henry and to attempt to become as successful an artist as Henry. While in America, James supported himself as a sidewalk artist and Vaudeville caricaturist. In Chicago, aged 23 years, he entered a competition in Harper's Magazine to illustrate a special edition of the Edgar Allan Poe poem The Raven. He was unsuccessful but his drawings are now exhibited in the Edgar Allan Poe Museum in Richmond, Virginia.James Carling returned to Liverpool in 1887 with intentions to further his artwork and career. He became ill and was admitted to Liverpool Workhouse on 17 June 1887. He died on 9 July 1887 aged 29 and was buried in an unmarked pauper's grave at Walton Park Cemetery due to there being no known next of kin information for him.Carling's life and times are celebrated annually in his birthplace Liverpool, England, with The James Carling International Pavement Art Competition. This takes place on Bold Street, the very street where, as James Carling puts it, \"I not only could not draw in that street, I could not walk in it”", "link_mentions": [{"page": "Vauxhall, Liverpool", "response": ["* James William Carling"]}]}}