{"wiki_id": "http://www.wikidata.org/entity/Q16018282", "itemLabel": "Bertie Smalls", "itemDescription": "British criminal and supergrass", "wikipedia_url": "https://en.wikipedia.org/wiki/Bertie_Smalls", "wikipedia_page": {"main": "Derek Creighton \"Bertie\" Smalls (1935 – 31 January 2008) was considered by many as Britain's first supergrass. Although there have been informers throughout history – the Kray twins were partly convicted two years before Smalls on evidence given by Leslie Payne – the Smalls case was significant for three reasons: the first informer to give the police volume names of his associates and provide the evidence that would send dozens of them to prison to serve long sentences; the first criminal informer to strike a written deal with the Director of Public Prosecutions; the only criminal informer to serve no time for his crime in return for providing Queen's evidence.", "link_mentions": [{"page": "Jack Slipper", "response": ["He was involved in several major investigations such as the Bank of America robbery in April 1975, in which £8 million was stolen from a branch in Davies Street, Mayfair.  He was also involved with Britain's first \"Supergrass\" trial  in 1973, in which bank robber Bertie Smalls testified against his former associates in exchange for his own freedom, and then in the trials supported by the evidence of \"King Squealer\" Maurice O'Mahoney."]}, {"page": "Norman Skelhorn", "response": ["In 1972, Skelhorn gave bank robber Bertie Smalls, Britain's first true supergrass, immunity from prosecution in light of the amounts and detail of his Queen's evidence.The rat race | Society | The Guardian Although Smalls evidence and confession consequently convicted 21 associates for a total of 302 years, the Law Lords told Skelhorn that they found the arrangement with Smalls an \"unholy deal.\"BFI | Film & TV Database | The LONDON PROGRAMME[27/11/77] (1977)"]}, {"page": "Deaths in January 2008", "response": ["*Bertie Smalls, 72, British criminal turned informant."]}, {"page": "Tony Lundy", "response": ["Throughout the 1970s, the supergrass was a feared tool that the police had begun using which is generally considered to have begun with Bertie Smalls, who, faced with a hefty prison sentence for his part in leading his gang of armed robbers, the 'Wembley Mob', decided to turn 'Queen's Evidence' against his fellow thieves which resulted in them receiving heavy prison sentences whilst Smalls was granted immunity from prosecution. Although after the Smalls trial immunity could no longer be granted, criminals who turned supergrass could expect to be rewarded with the 'supergrass tariff', normally a sentence of around five years, most of which would be spent in police custody."]}, {"page": "Smalls (surname)", "response": ["* Bertie Smalls (1935–2008), noted British supergrass"]}, {"page": "Frederick Lawton (judge)", "response": ["Lawton was appointed a Lord Justice of Appeal in 1972, and was sworn of the Privy Council. For a time Lawton often sat with Lord Denning and Lord Diplock on civil appeals: as the two frequently disagreed Lawton was often tasked with  to deliver leading judgments in matters where he had little experience. In 1973, he criticised the Director of Public Prosecutions for offering Bertie Smalls, the first so-called \"supergrass\", immunity in exchange for his testimony. The law lords referred to the transaction as an \"unholy deal\", but allowed it to stand."]}, {"page": "Alec Eist", "response": ["In May 1968 Eist joined the Flying Squad under Harold \"Tanky\" Challenor and was swiftly promoted to detective sergeant (second class). Eist eventually reached the rank of Detective Chief Inspector. He was appointed—with Chief Superintendent James Marshall—head of the Wembley Robbery Squad, where they encountered Bertie Smalls, head of the Wembley Mob. Eist had an in-depth and extensive knowledge and understanding of both London's underworld and the geography it occupied. The gangster Freddie Foreman described Eist as a \"rebel cop\", who would get drunk and stand on pub tables singing. The police historian Dick Kirby describes Eist as \"always controversial\", as was his relationship with senior offices. In an anecdote from Eist's tenure at Holloway:"]}]}}