{"wiki_id": "http://www.wikidata.org/entity/Q16000009", "itemLabel": "Marc Weller", "itemDescription": "academic", "wikipedia_url": "https://en.wikipedia.org/wiki/Marc_Weller_(professor)", "wikipedia_page": {"main": "Marc Weller is Professor of International Law and International Constitutional Studies at Cambridge University, England, and a fellow of Hughes Hall, Cambridge working in its Department of Politics and International Studies (POLIS). He was the Director of the Lauterpacht Centre for International Law. He has been an adviser in many international peace negotiations.", "link_mentions": [{"page": "Hughes Hall, Cambridge", "response": ["*Marc Weller, University of Cambridge Professor of International Law and International Constitutional Studies"]}, {"page": "Marc Weller", "response": ["Marc Weller (born 27 October 1951 in Mutzig) is a French former professional football goalkeeper."]}, {"page": "Lauterpacht Centre for International Law", "response": ["* Marc Weller (October 2010 – 2016)"]}, {"page": "Wolfgang F. Danspeckgruber", "response": ["Danspeckgruber's publications include \"The Self-Determination of Peoples: Community, Nation, and State in an Interdependent World\", and \"Working Toward Peace and Prosperity in Afghanistan\", [Lynne Rienner Publishers]; \"Globalization - Reflections on Impact and Dichotomies\" in Carl Baudenbacher, Erhard Busek, eds., \"Aspekte der Globalisierung\",  2008; \"Self-Governance Plus Regional Integration: A Possible Solution to Self-Determination Claims\" in Stefan Wolff and Marc Weller, eds. \"Autonomy, Self-Governance, and Conflict Resolution\", 2005; and \"The EEA, the Neutrals, and an Emerging Architecture\" in Gregory F. Treverton, ed. \"The Shape of the New Europe\", 1992."]}, {"page": "2014 Crimean status referendum", "response": ["Many scholars and politicians (Neil Melvin, Robert McCorquodale, John Kerry, John B. Bellinger III, Marc Weller among others) have stated that the referendum was conducted under the cover of assault rifles and, thus, the result was obtained through violence. However, according to Russia Today and ITAR-TASS those claims are not substantiated by the international observers of the pro-Kremlin European Center of Geopolitical Analysis, Polish Eurasian Mateusz Piskorski (leader of the European observers' mission according to the Kremlin media outlet Russia Today), the FPÖ's Ewald Stadler and Johannes Hübner, Pavel Chernev, Aymeric Chauprade, Tatjana Ždanoka, Srđa Trifković, who said they saw no signs of pressure or military presence during the referendum, and that the Crimean people were genuinely eager to have their say in the vote."]}, {"page": "Marc Weller (Professor)", "response": ["#REDIRECT Marc Weller (professor)"]}, {"page": "American-led intervention in Iraq (2014–2021)", "response": ["In an article for the BBC, Marc Weller, professor of international law at Cambridge University, argued that the U.S. airstrikes are consistent with international law. Specifically, he argued that: the government in Baghdad invited international forces to join in the fight against IS; the newly reconstituted and religiously representative Iraqi government has a positive obligation to deliver on its constitutional promises and defend its population from subjugation by ISIS; and foreign intervention exercising the right of collective self-defense on behalf of Iraq can involve forcible action in IS-controlled territories in Syria that is proportional to the necessity of securing Iraq's borders. Similarly, Michael Ignatieff, professor of politics at Harvard University discussed the international dimensions of American intervention in Iraq in an interview with Der Spiegel in which he described the Islamic State as an \"attack on all values of civilization\" and that it was essential that America, \"continued with their air strikes.\""]}, {"page": "Department of Politics and International Studies, University of Cambridge", "response": ["POLIS, formed in 2009 by the merger of the former Department of Politics and the Centre for International Studies, is administratively housed at the university's Alison Richard Building on the Sidgwick Site and is part of the Faculty of Human, Social, and Political Science. Its primary predecessor, the Department of Politics, was formed in 2004, prior to which political science had been fragmented across other departments. Notable teaching staff include Andrew Gamble, Peter Nolan, Brendan Simms, Marc Weller, Duncan Bell, Baroness Smith of Newnham and Ayşe Zarakol and current head of department Jason Sharman."]}]}}