{"wiki_id": "http://www.wikidata.org/entity/Q16043793", "itemLabel": "Alexander Rowley", "itemDescription": "English cricketer (1837-1911)", "wikipedia_url": "https://en.wikipedia.org/wiki/Alexander_Rowley", "wikipedia_page": {"main": "Alexander Butler Rowley (3 October 1837 – 9 January 1911) was an English first-class cricketer active from 1854 to 1871 who played for Lancashire. He was born in Manchester and died in Dover. He appeared in 31 first-class matches as a right-handed batsman who bowled left arm slow medium roundarm. He scored 967 runs with a highest score of 63 not out and took 78 wickets with a best performance of six for 21.", "link_mentions": [{"page": "Jack Crossland", "response": ["At the end of the 1883 season, a meeting of county representatives at Lord's was held, during which a proposal was made \"that the undermentioned counties agree among themselves not to employ any bowler whose action is at all doubtful.\". The proposal was essentially a gentlemen's agreement to try and prevent unfair bowling, necessitated by the umpires' refusal to intervene.. The resolution was signed by representatives from Derbyshire, Kent, Middlesex, Nottinghamshire, Surrey and Yorkshire, but those from Gloucestershire and Sussex refused to sign it, along with Alexander Rowley from Lancashire. During the meeting, Hornby defended Crossland's action, saying that \"he had never seen Crossland bowl otherwise than fairly.\" As a result, Middlesex were joined by Nottinghamshire and Cambridge University in boycotting Lancashire in 1884. Crossland was strong again, and claimed ten wickets in a match on three occasions, first against Oxford University in late May–early June. In his next match, for the North against the South, he claimed seven wickets in each innings to record match figures of fourteen for 80. The crowd at Lord's followed the example previously set at the Oval, heckling Crossland throughout the match.. He collected seven wickets in an innings again, in a match not classified as first-class against Leicestershire, and completed the ten-wicket haul with four wickets in the second innings. He faced the touring Australians twice during June, taking two wickets for the North, before collecting eleven wickets for Liverpool and District. The report in The Argus once again vilified Crossland, writing that \"owing principally to the successful throwing of Crossland\" the Australian first innings closed for 140."]}, {"page": "Geoffrey MacLaren", "response": ["Geoffrey MacLaren (28 February 1883 – 14 September 1966) was an English cricketerCricinfo profile who played first-class cricket for LancashireCricketArchive profile in addition to playing three matches for Egypt.Other matches played by Geoffrey MacLaren at CricketArchive His elder brothers Archie and James also played for Lancashire,Archie MacLaren at CricketArchiveJames MacLaren at CricketArchive as did his uncle Alexander Rowley.Alexander Rowley at CricketArchive Archie also played Test cricket for England."]}, {"page": "List of Gentlemen cricketers (1841–1962)", "response": ["* Alexander Rowley (1859–1863)"]}, {"page": "List of Manchester Cricket Club players", "response": ["|Alexander Rowley", "|Alexander Rowley, CricketArchive. Retrieved 2020-07-05. Ambrose D (2004) Lancashire player number 8 - Rowley, Alexander Butler, CricketArchive. Retrieved 2020-07-05. ", "|Two of his five first-class matches were for Manchester and he also played in both of Lancashire's 1851 fixtures. Brother of Alexander Rowley."]}, {"page": "Rowley, Alexander", "response": ["#redirectAlexander Rowley"]}]}}