{"wiki_id": "http://www.wikidata.org/entity/Q16029973", "itemLabel": "Alma Stanley", "itemDescription": "British actress and vocalist (1854-1931)", "wikipedia_url": "https://en.wikipedia.org/wiki/Alma_Stanley", "wikipedia_page": {"main": "Alma Stuart Stanley (26 October 1854 – 8 March 1931) was a British actress and vocalist once popular on both sides of the Atlantic Ocean. She was perhaps best remembered as Lady Teazle in Sheridan's The School for Scandal and Aphrodite in George Procter Hawtrey's Atlanta. In a career of more than thirty years she appeared in some sixty plays and made two North American tours. Her later years were spent in reduced circumstances, culminating with her death at a London prison hospital following an arrest for public intoxication.", "link_mentions": [{"page": "An Ideal Husband", "response": ["An Ideal Husband was produced in Australia in April 1895 by the Brough-Boucicault company;\"An Ideal Husband at the Lyceum, The Daily Telegraph, 13 April 1895, p. 6 they gave the play its New Zealand premiere later in the same year.\"The Brough and Boucicault Company\", New Zealand Herald, 16 October 1895, p. 5 The Irish premiere was in Dublin in 1896, given (with no mention of the author's name) by a touring company managed by Hawtrey, at the Gaiety Theatre. The cast included Alma Stanley as Mrs Cheveley and Cosmo Stuart, promoted from his small role in the London production, as Lord Goring.\"Gaiety Theatre\", The Freeman's Journal, 26 October 1896, p. 4; and \"'An Ideal Husband' at the Theatre Royal\", Edinburgh Evening News, 20 October 1896, p. 2"]}, {"page": "Patience (opera)", "response": ["|Ella||May Fortescue||Alma Stanley||Agnes Fraser||Ruby Gray"]}, {"page": "Tita in Thibet", "response": [":Miss Santley appeared as Tita, a part which seemed to please her immensely. Her singing, like her speaking, was spoiled by affectation, although it is only right to say that in \"I wish I was a man\" and in \"Poor Mrs. B.\" – both songs of the Music Hall class – she was vociferously applauded by the youths in the gallery. In the second act Miss Santley wears a dress which gives a very liberal display of personal charms. Mr. W. H. Fisher played the part of Brum with considerable \"go,\" and his acting in the idol business of the second act was decidedly funny. Mr. Charles Groves exhibited some dry humour as Chin-Chin, but the everlasting talk about the umbrella which he carries may be modified with advantage. Very comical indeed was the Po-Hi of Mr. Frederick Leslie, whose method of indicating mental anguish called forth considerable merriment. Miss Alma Stanley made an imposing Young Hyson, and was of service in the interpretation of the music; the Great and Little Bonzes being respectively represented by Mr. C. A. White and Mr. W. H. Seymour. To those in search of a good and refined entertainment we certainly cannot recommend a visit to the Royalty.The Era, 5 January 1879, p. 12c/d", "*Young Hyson (an impassioned young tea-gardener) – Alma Stanley"]}, {"page": "List of people from Jersey", "response": ["*Alma Stanley, actress, (1854–1931) "]}, {"page": "Alma Stuart Stanley", "response": ["#REDIRECT Alma Stanley"]}, {"page": "Theatre of Jersey", "response": ["Lillie Langtry, the Jersey Lily, is the island's most widely recognised cultural icon. Other stage actors from Jersey have included Seymour Hicks, Ivy St. Helier, Alma Stanley and Sylvestra Le Touzel."]}]}}