{"wiki_id": "http://www.wikidata.org/entity/Q16059325", "itemLabel": "George Kennedy", "itemDescription": "Scottish footballer (1882-1917)", "wikipedia_url": "https://en.wikipedia.org/wiki/George_Kennedy_(Scottish_footballer)", "wikipedia_page": {"main": "George William Kennedy  (12 March 1882 – 16 November 1917) was a Scottish footballer. He played at left half or centre half.\nHe began his career in his native Dumfries with Maxwelltown Volunteers.\nHe then made 45 appearances over two seasons playing for Lincoln City. Under David Calderhead, Lincoln pulled off an FA Cup upset when a goal by another ex-Maxwelltown Volunteers player, Norrie Fairgray, knocked out Chelsea 1–0 in a replay. Calderhead became Chelsea manager soon after and took Fairgray with him. Kennedy followed a year later.\nKennedy spent the years in the lead up to World War I playing for another team in West London, then-Southern League club, Brentford. George left Brentford at the end of the 1912–13 season, returning to Dumfries for the following season.George Kennedy emigrated to Canada in June 1914. Sailing from Glasgow to Montreal on board the SS Grampian.", "link_mentions": [{"page": "George Kennedy (disambiguation)", "response": ["George Kennedy (1925–2016) was an American actor.", "George Kennedy may also refer to:", "* George Kennedy (businessman) (1799–1870), founder of Georgetown, Ontario, Canada", "* George Kennedy (sports promoter) (1881–1921), owner of the Montreal Canadiens ice hockey team, 1910–1921", "* George Kennedy (Scottish footballer) (1882–1917), Scottish association footballer who played for Lincoln City and Chelsea", "* George Kennedy (Australian footballer) (1919–1979), Australian rules footballer", "* George Kennedy (politician) (1927–2003), Canadian politician, Liberal Member of the Legislative Assembly of Quebec for the district of Châteauguay"]}, {"page": "Norrie Fairgray", "response": ["Fairgray was signed for Chelsea in 1907 by manager David Calderhead, an ex-Queen of the South Wanderers player who had been Fairgray's manager at Lincoln.Willie Ferguson (Fairgray transfer to Chelsea), Queen of the South FCDavid Calderhead (Fairgray info at Lincoln City and Chelsea), Queen of the South FC Soon afterwards, George Kennedy followed the same path. At Chelsea Fairgray scored five goals in 84 games over seven seasons.Chelsea FC Player Profile: Norrie Fairgray, Stamford-Bridge.com At representative level he played in the Home Scots v Anglo-Scots annual trial match in 1908Football.  Anglo-Scots, 3; Home Scots, 0., The Glasgow Herald, 24 March 1908 and 1909Football.  Home Scots, 3; Anglo-Scots, 1., The Glasgow Herald, 23 March 1909 but was never selected for his country in a full international."]}, {"page": "1911–12 Brentford F.C. season", "response": ["|George Kennedy", "| style=\"text-align:left;\" |George Kennedy"]}, {"page": "1912–13 Brentford F.C. season", "response": ["|George Kennedy", "| style=\"text-align:left;\" |George Kennedy", "| George Kennedy"]}, {"page": "1910–11 Brentford F.C. season", "response": ["A £315 loss on the 1909–10 season meant that there was little transfer activity for Brentford manager Fred Halliday to conduct over the course of the 1910 off-season, with half back George Kennedy, full back John Christie and returning outside right Joe Ryalls being the only signings of note. The Bees had a good first half of the Southern League First Division season, losing just five of the opening 20 matches, with Geordie Reid (Southern League XI) and Steve Buxton and John Christie (both London XI) winning representative honours. Despite the promising form, the majority of the team's goals were scored by Reid, who bagged 14 goals in a 17-match spell.  ", "Brentford's promotion challenge was effectively ended by a 3–0 defeat to Swindon Town (champions at the end of the season) on 7 January 1911 and the team slipped from 5th position into mid-table. Injuries to George Kennedy, Joe Ryalls, Geordie Reid and George Anderson at differing times disrupted the attack and Brentford finished the season having scored 41 league goals, with Geordie Reid having scored over half the team's total (21), which equalled Adam Bowman's club record for most Southern League goals in a season. Some pride was salvaged with victory over West London rivals Queens Park Rangers in the inaugural Ealing Hospital Cup in April.", "|George Kennedy", "| style=\"text-align:left;\" |George Kennedy", "| style=\"text-align:left;\" |George Kennedy", "| George Kennedy"]}, {"page": "1917–18 Brentford F.C. season", "response": ["* Company Sergeant Major George Kennedy DCM MM, died of wounds suffered during the Battle of Passchendaele on 16 November 1917, while serving with the Canadian Infantry Corps."]}]}}