{"wiki_id": "http://www.wikidata.org/entity/Q16019698", "itemLabel": "Tony Harding", "itemDescription": "British artist", "wikipedia_url": "https://en.wikipedia.org/wiki/Tony_Harding", "wikipedia_page": {"main": "Anthony John \"Tony\" Harding (9 January 1942 – 12 January 2014) was a British illustrator of boys' action comics specialising in football stories. He worked for D. C. Thomson & Co. and IPC Magazines in a career that spanned over 30 years, on comics such as Bullet, Scorcher, Hornet, Action, Roy of the Rovers, Victor and Scoop, amongst others.", "link_mentions": [{"page": "Roy of the Rovers", "response": ["After Joe Colquhoun departed, he was succeeded first by Paul Trevillion, then by Yvonne Hutton, who illustrated from 1967 to 1974, before David Sque took over in 1975. Despite reportedly not being a football fan, he was responsible for one of the strip's more definitive looks in its early '80s period. He was replaced in 1986 by former 2000 AD artist Mike White, who gave Roy a more muscular look and the strip a more modern feel. Barrie Mitchell took over in 1992, with a style quite similar to White's.Rob Davis on Roy of the Rovers Monthly, Dinlos and Skilldos, 19 March 2009 A number of artists worked on the monthly comic, such as David Jukes, Sean Longcroft and Garry Marshall, in contrast to the lengthy tenures of the weekly strip's creative team. Tony Harding often illustrated Roy for the Roy of the Rovers annuals and also drew the Roy's Action Replay strip that appeared in All Action Monthly in the late eighties (Fleetway). Mitchell returned in 1997 as the sole artist of the Match of the Day strips for all four years."]}, {"page": "Action (comics)", "response": ["* Look Out For Lefty was an unconventional football strip based on the adventures of Kenny Lampton, a working-class teenager whose powerful left foot gave him the nickname of \"Lefty\". It was unlike any other football strips in British boys' comics at the time because the strip would include football hooliganism, as well as Lefty often not being a clean-cut hero, being prone to brawling, partying, and womanising. The violence on display in the strip mirrored the real-life football violence taking place at the time. After the ban, the strip became a conventional Roy of the Rovers–type strip and removed any hint of controversy. The strip was written by Tom Tully, with art from Barrie Mitchell and Tony Harding."]}, {"page": "Tom Tully (writer)", "response": ["* 1976–1977 Look Out For Lefty (with art by Barrie Mitchell and Tony Harding, in Action)"]}, {"page": "Bullet (DC Thomson)", "response": ["*Twisty: Twisty Lunnon was a fantastic footballer, with an attitude, who also raced pigeons in his spare time and sometimes had brushes with the law. He started off playing as an apprentice with 4th division Sleethorpe United. He had a crooked left foot (caused by a car crash) which allowed him to bend the ball with astonishing accuracy. Drawn by artist Tony Harding."]}, {"page": "Harding (surname)", "response": ["*Tony Harding (1942–2014), British illustrator"]}, {"page": "Deaths in January 2014", "response": ["*Tony Harding, 72, British comics artist.Mr Anthony (Tony) John Harding"]}, {"page": "2014 in the United Kingdom", "response": ["**Tony Harding, 72, comics artist."]}, {"page": "List of alumni of Saint Martin's School of Art", "response": ["* Tony Harding"]}]}}