{"wiki_id": "http://www.wikidata.org/entity/Q16014857", "itemLabel": "Chuck Faulkner", "itemDescription": "Australian actor, born in Belfast (1922-2000)", "wikipedia_url": "https://en.wikipedia.org/wiki/Chuck_Faulkner", "wikipedia_page": {"main": "Charles Stephen Faulkner (21 October 1922 – 4 December 2000), professionally Chuck Faulkner was an Irish-born Australian actor and US radio talk show host, he was best known for his role as Det. Snr. Sgt. Keith Vickers in the Australian television police drama Division 4, appearing in 300 episodes from 1969-1975.Born in Belfast, Northern Ireland, after relocating to Australia he was one of Australian television's first news presenters at the Nine Network with studio TCN from 1956-1964. Faulkner moved to the United States in the late 1970s and became a talk show host on radio station WNIS in Norfolk, Virginia until the mid 1980s.", "link_mentions": [{"page": "Name That Tune", "response": ["|Bruce GyngellChuck FaulknerTony BarberStuart Wagstaff "]}, {"page": "Crawford Productions", "response": ["After Hunter ended in 1969, a new police drama, Division 4 (1969) was conceived as a vehicle for Kennedy's talents and he became a dual Gold Logie winner, the series also screened on the Nine Network; the other stars included former game show host and newsreader Chuck Faulkner, Terry Donovan, and Ted Hamilton. Unlike Homicide, which concentrated on murder plots, Division 4 was set in a suburban Melbourne police station, and covered a broad range of police work, as well as occasionally featuring more light-hearted episodes. It too became an enduring popular success and earned Kennedy two Logie Awards."]}, {"page": "Division 4", "response": ["| Chuck Faulkner || Det. Sgt./Det. Snr. Sgt. Keith Vickers ||, Head of the Yarra Central CIB, married with two sons. He often clashes with his younger son Jamie, a university student, over anti-Vietnam demonstrations. His bark is usually worse than his bite, and although he comes across as a very serious person most of the time, he has a dry sense of humour which lends itself to some nice comedy touches."]}, {"page": "Whiplash (TV series)", "response": ["Other actors with memorable appearances and not included in episode list (below) included comedian George Wallace Jnr and Chuck Faulkner."]}, {"page": "It's Time (Australian campaign)", "response": ["The slogan \"It's Time\", around which the three-stage campaign was built, was conceived by Paul Jones, at the time creative director at Sydney ad agency Hansen-Rubensohn–McCann-Erickson which was handling ALP's advertising account.'It's Time' to 'Rock on' Paul Campaign Brief, 8 February 2007Patricia Amphlett: Timely campaign signalled start of Whitlam's cultural sea change The Sydney Morning Herald, 12 November 2012 The goal of the campaign's first stage was to popularise the phrase while the television commercial served as the core element of the second stage. Conceived by Jones, copywriter Ade Casey (then known as Adrienne Dames) and art director Rob Dames, it was directed by Ric Kabriel and produced through Fontana Films, Sydney. The song was written by Jones and advertising jingle writer Mike Shirley, it was arranged as well as produced by Pat Aulton. Lead singer Alison McCallum laid down the foundation track at ATA Studios, Sydney. The chorus comprising a \"Who's Who\" of Australian entertainment and sport personalities, including Tony Barber, Barry Crocker, Lynette Curran, Chuck Faulkner, Jimmy Hannan, Brian Henderson, Col Joye, Graham Kennedy, Dawn Lake, Bobby Limb, Little Pattie, Bert Newton, Terry Norris, Hazel Phillips, Judy Stone, Maggie Tabberer, Jack Thompson, Jacki Weaver, Kevin Sanders, Ade and Rob Dames, among others, was recorded one day in early spring at either the Hordern Pavilion or Supreme Sound in Sydney's Paddington with Joye conducting. The TV spot mainly shows McCallum and the other singers performing the song, intercut are pictures from Whitlam's private photo collection. As well as reaching its target demographic—loosely speaking, women and young people—, \"the ad reached a far wider and probably quite unexpected segment of the electorate.\""]}, {"page": "Mad Dog Morgan", "response": ["*Chuck Faulkner as Sergeant Montford"]}, {"page": "Logie Awards of 1963", "response": ["::Chuck Faulkner"]}, {"page": "Nine News Sydney", "response": ["*Chuck Faulkner (1956–1963)"]}, {"page": "The Bluestone Boys", "response": ["The Bluestone Boys is a 1976 Australian comedy television series about a fictional prison, produced by Crawford Productions. The program was not particularly successful and was cancelled after a run of 26 episodes. The series starred Chuck Faulkner.Albert Moran, Moran's Guide to Australian TV Series, AFTRS 1993 p 83"]}]}}