{"wiki_id": "http://www.wikidata.org/entity/Q16000013", "itemLabel": "Michael White", "itemDescription": "cricketer (1913-2003)", "wikipedia_url": "https://en.wikipedia.org/wiki/Michael_White_(cricketer)", "wikipedia_page": {"main": "William Michael Eastwood White (22 May 1913 – 15 February 2003) was an English cricketer active from 1937 to 1949 who played for Northamptonshire (Northants). He was born in Barnes, Surrey on 22 May 1913 and died in Guernsey on 15 February 2003. White appeared in 21 first-class matches as a righthanded batsman who bowled right arm medium fast. He scored 398 runs with a highest score of 48 and took 42 wickets with a best performance of four for 67.", "link_mentions": [{"page": "Michael White", "response": ["* Michael White (psychotherapist) (1948–2008), inventor of narrative therapy", "* L. Michael White, American theologian", "* Michael White (criminologist) (born 1951), professor of criminology", "* Michael White (journalist) (born 1945), associate editor and former political editor of The Guardian newspaper", "* Michael White (author) (1959–2018), British science writer and novelist", "* Michael White (clarinetist) (born 1954), New Orleans jazz musician", "* Michael White (singer), country music artist", "* Michael White (violinist) (1933–2016), jazz musician", "* Michael White & the White, American hard rock combo and occasional Led Zeppelin tribute band", "* Trippie Redd (Michael White IV, born 1999), rap artist from Canton, Ohio", "* Michael White (bobsleigh) (born 1964), Jamaican Olympic bobsledder", "* Michael White (footballer) (born 1987), Waitakere United player", "* Michael White (snooker player) (born 1991), Welsh snooker player", "* Michael White (cricketer) (1913–2003), English cricketer", "* Michael White (baseball) (born 1968), first-round pick by the L.A. Dodgers in the 1986 draft", "* Michael White (producer) (1936–2016), British theatre and film producer", "* Michael White (judge) (born 1953), Irish High Court judge", "* Michael White (chef), American chef", "* Michael White (businessman), owner of the Rite-Hite company", "* Michael White (British Army officer) (1791-1868), British Army general"]}, {"page": "John Brockbank", "response": ["His grandson, Michael White, also played cricket for Cambridge University and for Northamptonshire in the 1940s."]}, {"page": "Richard Page (cricketer)", "response": ["Page was born at Bursledon and educated at Marlborough College. From Marlborough he attended the Royal Military Academy, Woolwich. He graduated from Woolwich in January 1930, entering into the Royal Artillery as a second lieutenant. He was promoted to the rank of lieutenant in February 1933, with seniority to January 1933. He made a single appearance in first-class cricket for the British Army cricket team against Cambridge University at Fenner's in 1937. Batting twice in the match, he was dismissed for a 12 runs by Michael White in the Army's first-innings, while in their second-innings he was dismissed without scoring by John Cameron. He opened the bowling with his leg breaks alongside John Stephenson in the Cambridge first-innings, but went wicketless from eight overs bowled. He was promoted to the rank of captain in August 1938. Having served in the Second World War, he was awarded the Military Cross in October 1945, and was mentioned in dispatches in November 1945 and June 1946, for his efforts during the war."]}]}}