{"wiki_id": "http://www.wikidata.org/entity/Q16013977", "itemLabel": "Stephen Tredre", "itemDescription": "British actor-writer (1963-1997)", "wikipedia_url": "https://en.wikipedia.org/wiki/Stephen_Tredre", "wikipedia_page": {"main": "Stephen Ralph Tredre (17 July 1963 – 8 December 1997) was an English actor and writer.\nThe son of a doctor, he was born in London and educated at Epsom College, appearing as the lead role in a school production of Hamlet. Tredre also wrote articles for the school magazine, which was edited by his brother. After studying drama and English at Exeter University, he graduated from the Royal Academy of Dramatic Art.Following graduation, he appeared on the stage in Manchester and London, and then in film and television productions such as ITV's The Bill. While on the set of Dark Season, Tredre met actress Kate Winslet with whom he had a five-year relationship, starting when she was 15 years old and 12 years his junior. The couple broke up in 1995, at Tredre's insistence.Tredre began to write while still working as an actor. Having had scripts accepted to the BBC soap opera EastEnders, he then joined the soap's rota of writers. After being diagnosed with cancer in 1996, he wrote the short personal memoir film Between Dreams, and had his six-part legal series Fish accepted by the BBC, who cast Paul McGann in the lead role. Tredre finished an EastEnders script from his bed in his home in Islington two weeks before his death from bone cancer, dying soon after Winslet completed filming Titanic. Attending his funeral caused her to miss the film's premiere in Los Angeles.", "link_mentions": [{"page": "Kate Winslet", "response": ["While filming Dark Season, fifteen-year-old Winslet began a romantic relationship with actor-writer Stephen Tredre, who was twelve years her senior. She considered him a major influence in her life and they lived together in London. They broke up in 1995, but remained close until he died of bone cancer two years later. Winslet missed the premiere of Titanic to attend his funeral. In a 2008 interview, she admitted to having never got over his death."]}, {"page": "Lloyd Owen", "response": ["|Stephen Tredre"]}, {"page": "List of alumni of the Royal Academy of Dramatic Art", "response": ["*Stephen Tredre (Acting Diploma 1987)"]}, {"page": "Fish (British TV series)", "response": ["Fish is a British television drama series first broadcast on BBC One in 2000. It features Paul McGann as the title character, alongside Jemma Redgrave and Mick Ford. It was created by Stephen Tredre, written by Tredre and Matthew Bardsley, and co-produced by the BBC and Principal Pictures.", "The series was inspired by the brother of producer Miriam Segal and conceived by Stephen Tredre in 1994, who took up screenwriting due to illness. After obtaining funding from Principal Pictures, Segal approached ITV and then the BBC with the programme, who both turned it down. It was then offered to the BBC's regional drama department, BBC Birmingham, and the series was commissioned. After reorganisation within the BBC, the series was announced in 1999 by the corporation's drama head, Mal Young."]}, {"page": "List of EastEnders crew members", "response": ["*Stephen Tredre (1997)"]}, {"page": "Deaths in December 1997", "response": ["*Stephen Tredre, 34, English actor and writer, bone cancer."]}, {"page": "Tredre, Stephen", "response": ["#redirectStephen Tredre"]}, {"page": "Tredre", "response": ["#REDIRECT Stephen Tredre"]}]}}