{"wiki_id": "http://www.wikidata.org/entity/Q16029157", "itemLabel": "Francesco Berger", "itemDescription": "British pianist and composer", "wikipedia_url": "https://en.wikipedia.org/wiki/Francesco_Berger", "wikipedia_page": {"main": "Francesco Berger (10 June 1834 – 26 April 1933) was a pianist and composer. He was a teacher of the piano and a professor at the Royal Academy of Music but is mostly remembered as the honorary secretary of the Philharmonic Society for 27 years.", "link_mentions": [{"page": "John Stainer", "response": ["Lady Stainer was devastated by his death and went into mourning for a year, but as she confided to a friend, the pianist Francesco Berger, \"I am thankful he has been spared long illness and the weariness of old age, which he always dreaded\".Dibble, pps. 309–310. She gave a memorial stained glass window to St Cross Church and arranged for a monument to be erected at Magdalen College. Her husband's valuable library of antiquarian music books passed to his elder son, J F R Stainer, who allowed its use for study and research purposes. The collection was sold to an American collector in 1932 who, on his death in 1973, had it bequeathed to the Bodleian Library, where it remains. Lady Stainer died in 1916 leaving six children. She is buried in Holywell Cemetery, Oxford, beside her husband.Dibble, pps. 309–310."]}, {"page": "The Mystery of Edwin Drood", "response": ["Foreman of the jury was George Bernard Shaw. Other jurors were selected from a list of nineteen named in the programme.  A copy of this, annotated by its original owner, suggests that the others on the jury bench were William Wymark Jacobs, William Pett Ridge, Tom Gallon, William de Morgan, Arthur Morrison, Raymond Paton, Francesco Berger, Ridgwell Callum, Justin Huntly McCarthy, Oscar Browning and William Archer. "]}, {"page": "List of compositions by Moritz Moszkowski", "response": ["| rowspan=\"8\" | MoszWV 20 → Morceau No. 1 dedicated to Madame Bertha Moszkowski, wife of his brother Alexander, No. 2 to Monsieur Arthur De Greef, No. 3 to Giuseppe Buonamici, No. 4 to Józef Wieniawski, No. 5 to W. Goldner, No. 6 to Max Schwarz, No. 7 to English pianist and composer Francesco Berger, and No. 8 to Alexander Lambert. A composition for piano. Published by Hainauer. "]}, {"page": "Louise Chandler Moulton", "response": ["Her songs were set to music by Francesco Berger and Lady Charlesmont, and later on by Margaret Ruthven Lang, Arthur Foote, Ethelbert Nevin, and many others. Marston wrote her, \"Much as we all love and admire your work, it seems to me we have not yet fully realized the unostentatious loveliness of your lyrics, as fine for lyrics as your best sonnets are for sonnets. 'How Long' struck me more than ever. The first verse is eminently characteristic of you, exhibiting in a very marked degree what runs through nearly all of your poems, the most exquisite and subtle blending of strong emotion with the sense of external nature. It seems to me this perfect poem is possessed by the melancholy yet tender music of winds sighing at twilight, in some churchyard, through old trees that watch beside silent graves. Then nothing can be more subtly beautiful than the closing lines of the sonnet, 'In Time to Come':— \"'Which was it spoke to you, the wind or I? I think you, musing, scarcely will have heard.'\" Marston wrote her again concerning \"The House of Death\" that it was one of the most beautiful, the most powerful poems he knew. \"No poem gives me such an idea of the heartlessness of Nature. The poem is Death within and Summer without—light girdling darkness—and it leaves a picture and impression on the mind never to be effaced.\" The poem of \"The House of Death\" is unequalled in its tragic beauty and sweetness. It was apropos of this volume that in one of his letters to her Robert Browning said he had closed the book with music in his ears and flowers before his eyes, and not without thoughts across his brain. And it was concerning a later poem, \"Laus Veneris,\" inspired by a painting of his own, that Edward Burne-Jones said it made him work all the more confidently and was a real refreshment."]}, {"page": "St James's Hall", "response": ["In 1892 Alexander Mackenzie succeeded Cowen. In the 1893 season, Tchaikovsky gave the English premiere of his Fourth Symphony, Saint-Saëns conducted his Le Rouet d'Omphale and played his G minor concerto, and Max Bruch conducted his own Second Violin Concerto with Ladislas Gorski as soloist.  In November 1893, a presentation was made to the Society's Secretary Francesco Berger in appreciation of ten years service. Soon afterwards, Queen's Hall opened its doors, and the Society moved there in the following February.Elkin 1944, 52; Elkin 1946, 87-88."]}, {"page": "Gaetano Rossi", "response": ["|Francesco Berger; G. Rota; Alberto Randegger; A. Zelman"]}, {"page": "1933 in British music", "response": ["*26 April – Francesco Berger, pianist and composer, 98"]}, {"page": "Biographies of Johann Sebastian Bach", "response": ["** In the early 20th century republished by Sampson Low, Marston & Co. as Johann Sebastian Bach, 1685-1750, with a foreword by Francesco Berger. "]}, {"page": "1913 in British music", "response": ["*Francesco Berger – Reminiscences, Impressions, and Anecdotes."]}, {"page": "Sidney Harrison", "response": ["The son of a tailor, Harrison grew up in Hammersmith, London, England, and began playing the piano at the age of four. He studied at the Guildhall School of Music under Francesco Berger and Orlando MorganHarrison, Sidney. Teacher never told me (1961) and was subsequently a professor of piano there, from 1927 until 1965. He made his first public appearances in the 1920s as a solo pianist, in chamber ensembles and as a concerto performer,Radio Times, Issue 138, 23 May 1926, p 15 travelling across the UK, Scandinavia, the Low Countries and France. This continued over the next few decades, including frequent BBC broadcasts.Radio Times, Issue 869, 1 June 1940, p 40"]}]}}