{"wiki_id": "http://www.wikidata.org/entity/Q16030154", "itemLabel": "Leslie Faber", "itemDescription": "actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Leslie_Faber_(actor)", "wikipedia_page": {"main": "Leslie Faber (30 August 1879 – 5 August 1929) was an English stage actor who played mostly in London and New York in the first three decades of the 20th century. He was best known for character roles in both modern and classic plays. Faber was taken prisoner during the First World War.", "link_mentions": [{"page": "The Importance of Being Earnest", "response": ["For a 1913 revival at the same theatre the young actors Gerald Ames and A. E. Matthews succeeded the creators as Jack and Algy.\"St James's Theatre\", The Times, 17 February 1913, p. 10 Leslie Faber as Jack, John Deverell as Algy and Margaret Scudamore as Lady Bracknell headed the cast in a 1923 production at the Haymarket Theatre.\"Haymarket Theatre\", The Times, 22 November 1923, p. 12 Many revivals in the first decades of the 20th century treated \"the present\" as the current year. It was not until the 1920s that the case for 1890s costumes was established; as a critic in The Manchester Guardian put it, \"Thirty years on, one begins to feel that Wilde should be done in the costume of his period – that his wit today needs the backing of the atmosphere that gave it life and truth. … Wilde's glittering and complex verbal felicities go ill with the shingle and the short skirt.\"\"The Importance of Being Earnest – a case for period costume\", The Manchester Guardian, 3 May 1927, p. 14"]}, {"page": "Henry Arthur Jones", "response": ["* Winifred Amy (1880-1956), who married and divorced actor Leslie Faber."]}, {"page": "Henry Ainley", "response": ["Ainley was born in Morley, near Leeds, on 21 August 1879, the only son and eldest child of Richard Ainley (1851–1919), a textile worker, and his wife, Ada née Hinchliffe (1850–1928). After education at the church school of St Peter's, Morley, Ainley became a bank clerk in Sheffield, where he took part in amateur dramatics. When the actor-manager George Alexander was on tour in 1899 in H. A. Jones's play The Masqueraders, Ainley obtained his permission to \"walk on\" (i.e. appear as a non-speaking extra). He made his professional stage début in F. R. Benson's company as a messenger in Macbeth.Parker, p. 205 He remained with Benson for two years, making his London début at the Lyceum Theatre as the Duke of Gloster to Benson's king in Henry V, in a cast that also featured Constance Benson, Leslie Faber, Harcourt Williams, Charles Doran and Oscar Asche.Parker, pp. 206–208\"The Lyceum Theatre\", The Morning Post, 16 February 1900, p. 6"]}, {"page": "Richard Bennett (actor)", "response": ["| Hudson Theatre, New YorkWritten by Henry Arthur Jones, produced by Charles FrohmanCast includes Viva Birkett, W. H. Denny, Leslie Faber, Doris Keane, Jessie Millward"]}, {"page": "White Cargo", "response": ["According to the file on the film in the MPAA/PCA collection at the Margaret Herrick Library, the miscegenation element of Leon Gordon's story caused great censorship difficulties, beginning with the U.S. distribution of a 1929 British screen adaptation of his play, also titled White Cargo. As noted in articles included in the MPAA/PCA files, in accordance with the MPPDA's 1924 agreement of self-imposed censorship, MPPDA head Will Hays deemed the play unacceptable material for screen adaptation and effectively banned any studios from producing it. In the play, Tondelayo is described throughout as a \"negress.\"  The March 1930 New York release of the 1929 British film, directed by J. B. Williams and Arthur Barnes, starring Leslie Faber, Maurice Evans, and Gypsy Rhouma, generated complaints from industry insiders, who felt that its distribution in the U.S. violated the spirit of Hays' decree."]}, {"page": "Outward Bound (play)", "response": ["*Mr Prior – Leslie Faber"]}, {"page": "List of British films of 1930", "response": ["|White Cargo||J. B. Williams||Leslie Faber, Maurice Evans||Drama||"]}, {"page": "Leslie Faber", "response": ["Leslie Faber may refer to:", "*Leslie Faber (actor), English actor (1879–1929)"]}, {"page": "The Ringer (1928 film)", "response": ["The Ringer is a 1928 British silent crime film directed by Arthur Maude and starring Leslie Faber, Annette Benson and Hayford Hobbs. It was based on the 1925 Edgar Wallace novel The Gaunt Stranger. Scotland Yard hunt for a dangerous criminal who has returned to Britain after many years away. A talkie version of The Ringer followed in 1931. ", "* Leslie Faber as Dr. Lamond"]}, {"page": "The Three Passions", "response": ["* Leslie Faber as Father Aloysius"]}, {"page": "Afraid of Love (film)", "response": ["Afraid of Love is a 1925 British silent drama film directed by Reginald West and starring Leslie Faber, Jameson Thomas and Moore Marriott.", "* Leslie Faber as Anthony Bond "]}, {"page": "The White Hen", "response": ["The White Hen is a 1921 British silent comedy film directed by Frank Richardson and starring Mary Glynne, Leslie Faber and Pat Somerset. It was based on a novel by Phyllis Campbell.", "* Leslie Faber as Duc de Crequy"]}, {"page": "Faber (surname)", "response": ["*Leslie Faber (1879–1929), English stage actor"]}, {"page": "List of British films of 1921", "response": ["|The White Hen||Frank Richardson||Mary Glynne, Leslie Faber||Comedy||"]}, {"page": "List of British films of 1928", "response": ["|The Ringer||Arthur Maude||Leslie Faber, Annette Benson||Crime||"]}, {"page": "White Cargo (1930 film)", "response": ["White Cargo is a 1930 British drama film directed by J.B. Williams and starring Leslie Faber, John F. Hamilton and Maurice Evans.  Originally made at Twickenham Studios as a silent film, it had sound sequences added at Elstree Studios.Warren p.88.", "*Leslie Faber as Weston  "]}, {"page": "The Outsider (play)", "response": ["It premiered at the Pleasure Gardens Theatre in Folkstone in April 1923, before transferring to the St James's Theatre for a West End run lasting for 107 performances between May and September the same year. The cast included Leslie Faber, Charles Kenyon and Isobel Elsom.Wearing The London Stage 1920-1929. p.231"]}, {"page": "The River (play)", "response": ["It ran for 53 performances in the West End, initially at St James's Theatre before transferring to the Lyric Theatre. The cast included Owen Nares, Clifford Mollison, Jessie Winter, Helen Ferrers and Leslie Faber.Wearing p.369"]}, {"page": "Milestones (play)", "response": ["The New York cast was headed by Leslie Faber as John Rhead."]}, {"page": "The Great Adventure (play)", "response": ["The play was revived at the Haymarket Theatre, London on 5 June  1924, starring Leslie Faber as Ilam and Hilda Trevelyan as Janet.\"Theatres\", The Times, 30 May 1924, p. 12 and ran until 18 October.\"Theatres\", The Times, 18 October 1924, p. 10 A Broadway revival starring Reginald Pole as Ilam and Spring Byington as Janet ran for 45 performances in December 1926 and January 1927.\"The Great Adventure\", Internet Broadway Database. Retrieved 7 June 2020"]}]}}