{"wiki_id": "http://www.wikidata.org/entity/Q1607516", "itemLabel": "Archibald Forbes", "itemDescription": "British war correspondent", "wikipedia_url": "https://en.wikipedia.org/wiki/Archibald_Forbes", "wikipedia_page": {"main": "Archibald Forbes (17 April 1838 – 30 March 1900) was a Scottish war correspondent.", "link_mentions": [{"page": "European influence in Afghanistan", "response": ["*The Afghan Wars 1839–42 and 1878–80 by Archibald Forbes, from Project Gutenberg"]}, {"page": "Richard D'Oyly Carte", "response": ["During the years when the Gilbert and Sullivan operas were being written Carte also produced operas and plays by other writing teams, as well as other works to fill the Savoy Theatre in between new operas. Many of these were companion pieces to the Gilbert and Sullivan operas. Others were new full-length pieces either for the Savoy or for Carte's touring companies, which played the Gilbert and Sullivan operas and the new works extensively.Rollins and Witts, pp. 23–27 Carte and Lenoir also continued to run his management agency. As an example of their level of activity, an 1881 souvenir programme commemorating the 250th performance of Patience in London and its 100th performance in New York records that, in addition to these two productions of Patience, Carte was simultaneously managing many other projects. These included two companies touring with Patience, two touring with other Gilbert and Sullivan operas, one touring with the operetta Olivette (co-produced with Charles Wyndham), one with Claude Duval in America, a production of Youth running at a New York theatre, a lecture tour by Archibald Forbes (a war correspondent) and productions of Patience, Pirates, Claude Duval and Billee Taylor in association with J. C. Williamson in Australia, among other things."]}, {"page": "First Anglo-Afghan War", "response": ["* The Afghan Wars 1839–42 and 1878–80 by Archibald Forbes, from Project Gutenberg"]}, {"page": "War correspondent", "response": ["* Archibald Forbes"]}, {"page": "Montgomery C. Meigs", "response": ["*Louisa Rodgers Meigs (1854–1922), the wife of British journalist Archibald Forbes"]}, {"page": "The Idler (1892–1911)", "response": ["* Archibald Forbes"]}, {"page": "William Simpson (artist)", "response": ["At Gandamak, he met the photographer John Burke and his counterpart at The Graphic, Frederic Villiers, and after the departure of Archibald Forbes, Simpson took over the task of supplying the Daily News with accounts of the campaign. "]}, {"page": "Category talk:British journalists", "response": ["Archibald Forbesnot yet classified"]}, {"page": "List of book-based war films (1927–1945 wars)", "response": ["| China || 1943 || John Farrow|| U.S. ||Fourth Brother || Archibald Forbes || 18?No publication details for this title are available at the US Library of Congress.Source: Library of Congress Online Catalog.¤ || Play "]}, {"page": "Frederic Villiers", "response": ["Villiers worked primarily for The Graphic but also supplied illustrations to Black and White as well as serving as a special correspondent of The Standard; he also contributed illustrations to the English Illustrated Magazine and The Idler. He counted among his friends, Archibald Forbes and John Alexander Cameron, who was killed in the Gordon Relief Expedition; he was also a friend of the Prince of Wales and was invited on at least one occasion to go hunting with the Prince in Scotland. Villiers exhibited two paintings at the Royal Academy, the first in 1882 entitled 'The road home; the return of an Imperial brigade from Afghanistan', and in the following year 'Fighting Arabi with his own weapons; an incident of the Battle of Tel el-Kebir'."]}, {"page": "Henry Charles Fehr", "response": ["* Memorial plaque, in bronze and marble, to Archibald Forbes, died 1900, in the crypt of St Paul's Cathedral, London."]}, {"page": "List of Vanity Fair (British magazine) caricatures (1875–1879)", "response": ["|1878-01-05||Mr Archibald Forbes||Thorough||Ape||M 0169||25px"]}, {"page": "Robert Sparrow Smythe", "response": ["Carlotta Patti toured in the beginning of 1880 under Smythe and during that year Smythe's preference turned from substantial musical companies to more serious platform speakers such as the \"lamented Richard Anthony Proctor astronomer\" then war correspondent Archibald Forbes in 1882 (with whom he first met Mark Twain while in America). Moncure Daniel Conway followed in 1883, then George Augustus Sala whom had earlier written to Smythe after hearing how much money Forbes had cleared during his tour. Smythe informed Sala that he would have to hear him first and Sala responded by telling Smythe to \"...go to the lower levels of Tartarus!.\" A local consortium then engaged Sala, brought him to Australia and upon finding him difficult to manage, asked Smythe to take him off their hands. From 1885 until 1886 Smythe gladly contracted with Sala and earned them both a handsome profit."]}, {"page": "Forbes (name)", "response": ["* Archibald Forbes (1838–1900), British war correspondent"]}, {"page": "John Richard Robinson", "response": ["In 1868, when the price of the Daily News was reduced to one penny, Robinson was appointed manager, and turned the paper around. He saw that the public demanded news not only quickly but in an attractive form. At the opening of the Franco-Prussian War he instructed his correspondents to telegraph descriptive details and not merely bare facts, and after the war was in progress he brought in Archibald Forbes, who became a valuable contributor. At the prompting of another correspondent, John Edwin Hilary Skinner, he started the \"French Peasants Relief Fund\", which reached a total of £20,000."]}, {"page": "Lewis William Forbes", "response": ["He was married twice. His first wife was Penelope Cowie. His son, Archibald Forbes (1838–1900), was a famous war correspondent."]}, {"page": "William Robinson Pirie", "response": ["In March 1842 he married Margaret Chalmers Forbes (1821-1900), daughter of Very Rev Lewis William Forbes minister of Boharm and later the Moderator in 1852. They had eight children. His brother-in-law through this marriage was the war correspondent Archibald Forbes."]}, {"page": "Ella Loraine Dorsey", "response": ["Dorsey began her literary career as a journalist and was for several years the \"Vanity Fair\" of the Washington Critic, leaving that paper to take a special correspondence on the Chicago Tribune. John Boyle O'Reilly and the Rev. D. E. Hudson, editor of the Ave Maria, urged her into magazine work. Her first three stories appeared almost simultaneously, \"The Knickerbocker Ghost\" and \"The Tsar's Horses\" in the Catholic World and \"Back from the Frozen Pole\" in Harper's Magazine. \"The Tsar's Horses\" traveled round the world, its last reproduction being in New Zealand. It was attributed at first, because of its accuracy of detail, to Archibald Forbes, the war correspondent. Dorsey's specialty was boys' stories. Midshipman Bob went through two editions in the United States and England in its first year, and was since translated into Italian. Scarcely second to it in popularity was Saxty's Angel and The Two Tramps, while two poems printed in the Cosmopolitan were received with marked favor. For many years, she served as special correspondent for Washington, Chicago, Boston, and Cincinnati papers. She worked as an indexer and Russian translator for Scientific Library, U.S. Department of the Interior, Washington, D. C."]}, {"page": "List of University of Aberdeen people", "response": ["Alumni in literature and journalism include Alexander Ross, Chaplain-in-Ordinary to Charles I and the first to translate the Quran into English, Thomas Urqhuart, the first to translate Rabelais into English, writer and poet Tobias Smollett, Ali Smith, the author of the Booker Prize nominated novel Hotel World and the Whitbread Award winning novel The Accidental, George Coleman the Younger, James Fordyce, Rosemary Ashton, Quain Professor of English Language and Literature at UCL, Simon Farquhar, Adam Roberts, and Archibald Forbes. George Chalmers, historian, antiquarian, occasional economist, and writer and serial biographer who courted controversy when paid by the Pitt ministry to publish a hostile biography on Thomas Paine, read for an MA at King's. George MacDonald, a pioneering figure in the field of fantasy literature and a mentor of fellow writer Lewis Carroll, read for an MA between 1840 and 1845. James Murdoch, journalist and linguist, wrote the first comprehensive history of Japan in the English language. Nan Shepherd, the Modernist writer and poet, and Eric Linklater, poet, author, and military historian, who both played key roles in the Scottish Renaissance."]}]}}