{"wiki_id": "http://www.wikidata.org/entity/Q1606534", "itemLabel": "Henry Brackenbury", "itemDescription": "British Army general", "wikipedia_url": "https://en.wikipedia.org/wiki/Henry_Brackenbury", "wikipedia_page": {"main": "General Sir Henry Brackenbury,  (1 September 1837 – 20 April 1914) was a British Army officer who was assistant to Garnet Wolseley in the 1870s and became part of his 'Ring' of loyal officers. He also wrote several books of military history and memoirs.", "link_mentions": [{"page": "Sir Henry Wilson, 1st Baronet", "response": ["The Intelligence Division had been developed by General Henry Brackenbury in the late 1880s into a sort of substitute General Staff; Brackenbury had been succeeded by Roberts protégé General Edward Chapman in April 1891.Jeffery 2006, p. 22. Wilson worked there for three years from November 1894."]}, {"page": "Sir William Robertson, 1st Baronet", "response": ["Promoted to lieutenant on 1 March 1891, he saw his first active service in 1891, distinguishing himself as Railway Transport Officer for the expedition to Kohat.Bonham-Carter 1963, pp. 34–35 He was appointed an attaché in the Intelligence Branch of the Quartermaster-General's Department at Simla in India on 5 June 1892. There he became a protégé of Sir Henry Brackenbury, the new Military Member of the Viceroy's Council (equivalent to War Minister for India), who had been Director of Military Intelligence in London and was keen to beef up the intelligence branch of the Indian army, including mapping the Northwest Frontier. Robertson spent a year writing a long and detailed \"Gazetteer and Military Report on Afghanistan\". After five years in India he was granted his first long leave in 1893, only to find that his mother had died before he reached home.Bonham-Carter 1963, p. 32", "He returned to the War Office in October 1900 and on 29 November 1900 was promoted brevet lieutenant-colonel for his services in South Africa. On 1 October 1901 he was appointed Assistant Quartermaster-General with specific responsibility for the Foreign Military Intelligence section, on the recommendation of the Intelligence expert General Sir Henry Brackenbury, and worked closely with William Nicholson (then Director of Military Operations). Although Robertson was later to be a staunch advocate of Britain's concentration of effort on the Western Front, in March 1902 (before the Entente Cordiale) he wrote a paper (\"Treaty Obligations of the British Empire\") recommending that, in the event of Belgian neutrality being violated by France or Germany in any future war, Britain should concentrate on naval warfare and deploy no more troops to Belgium than was needed to \"afford ocular proofie. visible proof - the phrase is from Othello Act III Scene 3 of our share in the war.\" His suggestion did not meet with approval at the highest political level: Foreign Secretary Lord Lansdowne commented that British policy had always been to deploy a small force immediately and (as had been done in the Boer War) a corps as soon as mobilisation was complete, whilst Lord Salisbury, then in his final months as Prime Minister, commented that he disapproved of such \"meditations\".Guinn 1965, p. 5. Salisbury thought it unlikely that Belgium would be invaded without support within Belgium, that it could not be predicted whether British opinion would support war, and that policy rather than the letter of treaties would determine whether Britain went to war to defend Belgium; he commented that despite the treaties of 1856 France, Austria and Britain had not gone to war to defend Turkey when she had been invaded by Russia in 1877"]}, {"page": "QF 18-pounder gun", "response": ["During the Second Boer War, the British government realised that its field artillery was being overtaken by the more modern \"quick-firing\" guns of other major powers, and investigated replacements for its existing field gun, the BL 15-pounder 7 cwt. In 1900, General Sir Henry Brackenbury, the then director-general of ordnance, sent officers to visit European gun makers. At Rheinische Metallwaren und Maschinenfabrik in Düsseldorf, they found a quick firing gun designed by Heinrich Ehrhardt with a recoil system that totally absorbed all the recoil of firing, 108 guns plus spares, were secretly purchased and entered service as the Ordnance QF 15-pounder in June 1901.Headlam, p.13"]}, {"page": "Evelyn Wood (British Army officer)", "response": ["In 1892 Wood was considered for the position of Commander-in-Chief, India, a move which the Queen favoured, while the Duke of Cambridge wanted him to become commander-in-chief at Madras so that the Queen's son the Duke of Connaught (himself a former commander-in-chief at Bombay, a few years earlier) could replace him at Aldershot. Henry Brackenbury, a senior military adviser to the Viceroy of India, thought Wood better suited to remain at Aldershot. Wood became Prime Warden of the Fishmongers' Company in 1893."]}, {"page": "Directorate of Military Intelligence (United Kingdom)", "response": ["In 1873 the Intelligence Branch was created within the Quartermaster General's Department with an initial staff of seven officers.  Initially the Intelligence Branch was solely concerned with collecting intelligence, but under the leadership of Henry Brackenbury, a protege of influential Adjutant-General Lord Wolseley, it was increasingly concerned with planning. However despite these steps towards a nascent general staff, the Intelligence Branch remained a purely advisory body, something that sharply limited its influence. The Branch was transferred to the Adjutant General's Department in 1888 and Brackenbury's title was changed to Director of Military Intelligence.", "* 1886–1888 Henry Brackenbury ", "* 1888–1891 Henry Brackenbury "]}, {"page": "Wolseley ring", "response": ["*Henry Brackenbury"]}, {"page": "Brackenbury", "response": ["*Henry Brackenbury (1837–1914), British soldier (brother of Charles Booth Brackenbury)"]}, {"page": "British Army during the Victorian Era", "response": ["Britain had no General Staff until the early twentieth century, and the work of some departments at the War Office was sometimes poorly supervised and inefficient. One of these was the Intelligence department. Although some distinguished soldiers, such as Henry Brackenbury and George Henderson, held the post of Director of Intelligence, they were distracted by questions of organisation and tactical doctrine, in which fields they made their major contributions.Badsey, pp.40, 46"]}, {"page": "River Column", "response": ["The Desert and River Columns arrived in and set out from Korti in late 1884.  The River Column moved out slowly, commanded by Major General William Earle and Brigadier General Henry Brackenbury.  They were hampered by all of the different cataracts of the Nile as they marched south.  This column was a force of regular infantry, men of the Egyptian Camel Corps, a Highlander regiment, an artillery battery and a small unit of the Eighth Hussars."]}, {"page": "Murders of Martin and John Lydon", "response": ["Under powers granted by The Crimes Act of 1881, Patrick Walsh's trial was moved to Dublin from Galway upon the strong recommendation of Henry Brackenbury, assistant undersecretary for police and crime. Brackenbury had read a report written by S.I. Horne, the man in charge of the Walsh murder case, which stated that: \"So demoralized by fear owning to the recent outrages and the general state of intimidation which prevails, that not only no jury dare find Pat Walsh guilty, but that no one man on such a jury dare propose to find him guilty, and that there is a certainty of acquittal.\"Pat Finnegan, Loughrea, 'That Den of Infamy,' The Land War in Co. Galway, 1979-1882, Four Courts, 2014.Patrick Walsh was convicted of murder and hanged in Galway Gaol on 22 September 1882."]}, {"page": "Military history", "response": ["Researchers have been unable to determine the sizes of these canons and others, outside the artifacts recovered.  Sir Henry Brackenbury was able to surmise the approximate size of these cannons by comparing receipts for both the firearms and the corresponding amounts of gunpowder purchased.  The receipts show a transaction for \"25 Livres for 5 canons.\"  Brackenbury was able to deduce, when comparing the costs of the cannons and the gunpowder apportioned, that they each iron cannon weighed approximately 25 lbs, while the brass cannons weighed roughly 22 lbs.  "]}, {"page": "List of British Army full generals", "response": ["| Sir Henry Brackenbury"]}, {"page": "1894 Birthday Honours", "response": ["*Lieutenant-General Henry Brackenbury  Royal Artillery, Ordinary Member of the Council of the Governor-General of India."]}, {"page": "1896 New Year Honours", "response": ["*Lieutenant-General Sir Henry Brackenbury, RA, KCB, Member of the Council of the Governor-General of India."]}, {"page": "John Townshend St Aubyn, 2nd Baron St Levan", "response": ["St. Aubyn was commissioned a second lieutenant in the Grenadier Guards on 19 October 1878, and was promoted to a lieutenant on 1 July 1881. He served in Egypt and Sudan for several years during the Mahdist War; he was Aide-de-camp (ADC) to General Sir Redvers Buller during the Suakin Expedition in 1884, where he took part in the battles of El Teb (February 1884) and Tamai (March 1884), and for which he was mentioned in despatches, received the medal with clasp, and the bronze star. Taking part in the Nile Expedition 1884–1886, he was ADC to Major-General Earle in 1883–1885 and after his death to General Henry Brackenbury in 1885, and was present at the Battle of Kirbekan (February 1885), for which he was again mentioned in despatches and received claps to the medal.Hart's Army list, 1903"]}, {"page": "List of Knights Commander of the Order of the Star of India", "response": ["*Lieutenant-General Sir Henry Brackenbury, , Member of the Council of the Governor-General of India."]}]}}