{"wiki_id": "http://www.wikidata.org/entity/Q16006679", "itemLabel": "James Welsh", "itemDescription": "British politician (1881-1969)", "wikipedia_url": "https://en.wikipedia.org/wiki/James_Welsh_(Paisley_MP)", "wikipedia_page": {"main": "James Welsh (29 January 1881 – 16 December 1969) was a Scottish Labour Party politician.\nBorn in Paisley, Welsh owned a cinemas in Glasgow, and served for many years on Glasgow City Council.  He was elected at the 1929 general election as Member of Parliament (MP) for Paisley, but was defeated at the 1931 general election by the Liberal Party candidate Joseph Maclay.Long a member of the Independent Labour Party, Welsh resigned in 1933 to join the Scottish Socialist Party.  He served as Lord Provost of Glasgow from 1943 to 1945.  In later life, he was a member of the Arts Council of Great Britain, chairing its Scottish Committee from 1946 to 1951.", "link_mentions": [{"page": "List of provosts of Glasgow", "response": ["*1943–1945 – James Welsh (Labour)"]}, {"page": "Paisley (UK Parliament constituency)", "response": ["| James Welsh "]}, {"page": "List of Labour Party (UK) MPs", "response": ["*James Welsh, Paisley, 1929–31"]}, {"page": "List of MPs elected in the 1929 United Kingdom general election", "response": ["|James Welsh"]}, {"page": "James Welsh", "response": ["James Welsh may refer to:", "*James Welsh (East India Company officer) (1775–1861), army officer in the East India Company", "*James Welsh (Paisley MP) (1881–1969), Scottish Labour Party politician, MP for Paisley 1929–1931", "*James Welsh (Medal of Honor) (1846–1916), American Civil War Medal of Honor recipient", "*James Welsh (rower) (1931–1963), American Olympic rower"]}, {"page": "Kingsway Theatre", "response": ["* Kingsway Cinema Ltd., founded by James Welsh (Paisley MP)", "* Kingsway Cinema, owned by James Welsh (Paisley MP), opened on 8 May 1929, by Kingsway Cinema Ltd., later Vogue Cinema, Cathcart, Glasgow, Scotland (demolished) "]}, {"page": "Scottish Socialist Party (1932)", "response": ["The party's first chair was Dollan, with councillors Andrew Gilzean as vice-chair and Arthur Brady as secretary.  The party was boosted by Neil Maclean, an MP who had resigned from the ILP shortly before the 1931 election,The National Union of Conservative and Unionist Associations, Gleanings and Memoranda (1932), p.500 while other members included former MP James Welsh,Euan McArthur, Scotland, CEMA and the Arts Council, 1919-1967 and future MP Thomas Cook.The Times Guide to the House of Commons: 1950, p.244"]}, {"page": "Kingsway Cinema Ltd.", "response": ["#REDIRECT James Welsh (Paisley MP)#Kingsway Cinema Ltd."]}]}}