{"wiki_id": "http://www.wikidata.org/entity/Q16091252", "itemLabel": "Vera McKechnie", "itemDescription": "British television presenter", "wikipedia_url": "https://en.wikipedia.org/wiki/Vera_McKechnie", "wikipedia_page": {"main": "Vera McKechnie (born 1927) is a retired British presenter who was one of the first presenters at the start of BBC Children's Television in the early 1950s.", "link_mentions": [{"page": "Lime Grove Studios", "response": ["Lime Grove would be used for many BBC Television programmes over the next forty-two years, including: Nineteen Eighty-Four; Steptoe and Son; Doctor Who; Nationwide; Top of the Pops; and The Grove Family, which took its title family from the studios, where it was made. A children's magazine-style programme, Studio E, was broadcast live from the studio of the same name from 1955 until 1958; it was hosted by Vera McKechnie."]}, {"page": "Andy Pandy", "response": ["The original version of Andy Pandy premiered on BBC TV in 1950, on either 11 JulyWatch with Mother or 20 June, as part of the For the Children strand (later Watch with Mother) narrated by Maria Bird. Initially it was broadcast live, but it was realised that if the programmes were filmed, they could be repeated. 26 fifteen-minute episodes were filmed on 16mmTV studio history Lime Grove  around 1952 and repeated continuously until 1969.|Final airing of black and white episodes] In 1970, 13 new episodes were made in colour with Vera McKechnie as narrator.", "* Narrator:  Maria Bird and later Vera McKechnie."]}, {"page": "Picture Book (TV series)", "response": ["Picture Book is a BBC children's TV series created by Freda Lingstrom, first broadcast in 1955. It was the Monday programme in the Watch with Mother cycle. Initially introduced by Patricia Driscoll, the programme encouraged children to make things;  Driscoll's catch phrase was \"Do you think you could do this? – I am sure you could if you tried\". She left the programme in 1957 to play the part of Maid Marian in the ITV series The Adventures of Robin Hood. Patricia Driscoll's episodes were repeated until 1963 and was replaced by a new series of episodes with Vera McKechnie. The programme ran until December 1965 and replaced in the Monday slot by Camberwick Green in January 1966.BBC Genome – Picture Book", "Each Monday, Driscoll or McKechnie would open the Picture Book at a relevant page. Sometimes it would be shown to the camera at a distance, making the pages' content often brief and obscure. Alternatively, the presenter would simply tell the children what the next item would be, sometimes with a still photograph as a continuity link. It was something different every week. The 1963 series featured Sausage, a puppet dachshund who could speak a few words and generally shared the presentation with Vera McKechnie.", "The 1987 VHS release by BBC Video featured an episode including Sausage the puppet dog, the Adventures of the Jolly Jack Tars (a group of sailors), making paper lanterns, growing mustard and cress, and a regular cartoon of a little girl called Bizzy Lizzy, who had a magic flower. The 'Bizzy Lizzy' inserts for Picture Book were narrated by Maria Bird, who also narrated Andy Pandy, The Woodentops and The Flowerpot Men. A further episode was included on a Watch with Mother 2 video released in 1989. The main feature involved the creation of hills and a valley using a sand tray, an item featured regularly in the programme. Both episodes were taken from the 1963 series, presented by Vera McKechnie."]}, {"page": "Patricia Driscoll", "response": ["Trained as an actress at RADA, Driscoll made her first television appearances in 1953 on Whirligig and then as a police sergeant in the series Scotland Yard in the episode \"The Silent Witness\". From 1955 to 1957, she introduced Picture Book, a BBC Television series that appeared on Mondays as part of the Watch with Mother cycle and encouraged children to make things.  She had a catchphrase: \"Do you think you could do this? – I am sure you could if you tried\". Driscoll left Picture Book in 1957 to take over from Bernadette O'Farrell the part of Maid Marian opposite Richard Greene in the ITV series The Adventures of Robin Hood for 37 episodes in series 3 and 4. Her place in Picture Book was taken by Vera McKechnie in a further series in 1962–63."]}, {"page": "Freda Lingstrom", "response": ["In June 1950, production began on Andy Pandy, which began a trial broadcast of four live episodes on 11 July. After several episodes, Andy was joined by Teddy and Looby Loo, while Molly Gibson joined the small team to help Audrey perform with the puppets. The show was narrated by Vera McKechnie, a continuity announcer and presenter, and the songs were performed by Gladys Whitred, accompanied on piano by Maria Bird, who also narrated some episodes.\"Andy Pandy Episode 1, BBC TV\", Andy Pandy"]}, {"page": "Vera (given name)", "response": ["* Vera McKechnie (born 1929), British children's television presenter"]}, {"page": "McKechnie", "response": ["*Vera McKechnie"]}]}}