{"wiki_id": "http://www.wikidata.org/entity/Q16192641", "itemLabel": "Paul Cardwell", "itemDescription": "British businessman", "wikipedia_url": "https://en.wikipedia.org/wiki/Paul_Cardwell", "wikipedia_page": {"main": "Paul Cardwell is  Chairman and Creative Director of Doner Cardwell Hawkins.The \"Creature Comforts\" advertising campaign that he created with Nick Park and Phil Rylance won a BAFTA award and went on to win almost every major advertising award in the world.\nThese commercials were voted fourth in the alltime 100 Greatest TV Ads by viewers of Channel 4.Since 1995 he has been a director of the Mariinsky Theatre Trust, managing the visits of the Mariinsky Opera and Mariinsky Ballet, formerly the Kirov.In 2004 he designed the stage sets for a performance by the artistic director, Valery Gergiev, to commemorate the Beslan school hostage crisis. The performance was broadcast worldwide by the BBC.\nIn 2011 he moved to Turin where he was International Creative Director at Armando Testa (https://www.armandotesta.it/en/) agency.\n2012-2017 Executive Creative Director at Brand Union, Dubai. Work for Abdul Latif Jameel (https://www.alj.com/en/community-jameel) won internationalr recognition, including Gold at Graphis (https://www.graphis.com/entry/71a56a50-c657-488f-b3b4-31672d45a9c7/) the first time an Arabic brand has achieved this level of recognition.\n2017-2019 Head of Communications at Brand Union, London, which became Superunion (https://www.superunion.com/). The launch of the new LEVEL airline (https://www.flylevel.com/) was chosen as No5 in best airline designs of all time (https://www.creativebloq.com/inspiration/6-best-airline-logos-of-all-time-and-why-they-work) and awarded a pencil at D&AD (https://www.superunion.com/news/five-dad-pencils-wins/)\nIn 2019 Cardwell established a new brand agency - Saboteur(https://saboteur.studio/)- with Alex Clegg and Nick Eagleton.\nAn early project was the re-naming of Colston Hall in Bristol (http://bristolbeacon.org/new-name/) which will now be the Bristol Beacon.", "link_mentions": [{"page": "Creature Comforts", "response": ["In 1990, Nick Park worked with Phil Rylance and Paul Cardwell to develop a series of British television advertisements for the electricity boards' \"Heat Electric\" campaign. The creative team of advertising agency GGK had seen the original Creature Comforts film and were hugely impressed by it.", "* Writers: Paul Cardwell, Kim Durdant-Hollamby"]}, {"page": "Cardwell", "response": ["*Paul Cardwell (born 1958), British advertising executive"]}, {"page": "Cardwell, Paul", "response": ["#redirectPaul Cardwell"]}]}}