{"wiki_id": "http://www.wikidata.org/entity/Q16185303", "itemLabel": "Jon Cunliffe", "itemDescription": "British civil servant", "wikipedia_url": "https://en.wikipedia.org/wiki/Jon_Cunliffe", "wikipedia_page": {"main": "Sir Jonathan Stephen Cunliffe, CB (born 2 June 1953) is a senior British civil servant, currently serving as Deputy Governor of the Bank of England for Financial Stability.", "link_mentions": [{"page": "Bank of England", "response": ["| Sir Jon Cunliffe            "]}, {"page": "Monetary Policy Committee (United Kingdom)", "response": ["* Jon Cunliffe (1 November 2013 - 31 October 2023, Deputy Governor for Financial Stability)"]}, {"page": "Bailout", "response": ["In Europe, the EU financial community symposium on the \"Future of Banking in Europe\" (December 2013) was attended by Irish Finance Minister Michael Noonan, who proposed a bail-in scheme in light of the banking union that was under discussion at the event.Irish Examiner, 3 Dec 2013: \"Noonan: Credit line can break doom cycle\" Deputy BoE Director Jon Cunliffe suggested in a March 2014 speech at Chatham House that the domestic banks were too big to fail, but instead of the nationalisation process used in the case of HBOS, RBS and threatened for Barclays (all in late 2008), those banks could henceforth be bailed in.telegraph.co.uk: \"BoE has 'no confidence' a failing big bank could be saved\" (Wilson) 17 Mar 2014"]}, {"page": "Ivan Rogers", "response": ["In 2012, Rogers returned to the civil service as the Prime Minister's Adviser for Europe and Global Issues and the Head of the European and Global Issues Secretariat, based in the Prime Minister's Office at Number 10, replacing Jon Cunliffe who had become the senior British diplomat at the EU. On Cunliffe's move to the Bank of England the next year, Rogers succeeded him again, moving to Brussels in 2013."]}, {"page": "John Cunliffe", "response": ["*Jon Cunliffe, British civil servant"]}, {"page": "Kim Darroch", "response": ["On 24 June 2011, it was announced that Darroch would replace Peter Ricketts as National Security Advisor in January 2012, with Jon Cunliffe selected as Darroch's replacement as Permanent Representative to the European Union."]}, {"page": "List of permanent representatives of the United Kingdom to the European Union", "response": ["*2012–2013: Sir Jon Cunliffe"]}, {"page": "Ed Balls", "response": ["Balls became Economic Secretary to the Treasury, a junior ministerial position at HM Treasury, in the Cabinet reshuffle of May 2006. While Economic Secretary, he was commissioned, alongside Jon Cunliffe, by the G7 finance ministers to prepare a report on economic aspects of the Israeli–Palestinian conflict."]}, {"page": "Jonathan Stephen Cunliffe", "response": ["#REDIRECTJon Cunliffe"]}]}}