{"wiki_id": "http://www.wikidata.org/entity/Q1610303", "itemLabel": "Herman Merivale", "itemDescription": "English civil servant and historian", "wikipedia_url": "https://en.wikipedia.org/wiki/Herman_Merivale", "wikipedia_page": {"main": "Herman Merivale CB (8 November 1806 – 8 February 1874) was an English civil servant and historian.  He was the elder brother of Charles Merivale, and father of the poet Herman Charles Merivale.\nHe was born at Dawlish, Devon to John Herman Merivale (1770–1844) and Louisa Heath Drury. He was educated at Harrow School.  In 1823 he entered Oriel College, Oxford. In 1825 he became a scholar of Trinity College and also won the Ireland scholarship, and three years later he was elected fellow of Balliol College.  He became a member of the Inner Temple and practised on the western circuit, being made in 1841 recorder of Falmouth, Helston and Penzance.\nFrom 1837 to 1842 he was professor of political economy at Oxford in this capacity he delivered a course of lectures on the British Colonies in which he dealt with questions of emigration, employment of labour and the allotment of public lands.  The reputation he secured by these lectures had much to do with his appointment in 1847 as Assistant Under-Secretary for the colonies, and in the next year he became Permanent Under-Secretary.  In 1859 he was transferred to the permanent under-secretaryship for India, receiving the distinction of CB.  In 1870, Merivale was awarded the degree of DCL by Oxford University. He died in 1874 and is buried in Brompton Cemetery, London.\nBesides his Lectures on Colonization and Colonies (1841), he published Historical Studies (1865), and completed the Memoirs of Sir Philip Francis (1867); he wrote the second volume of the Life of Sir Henry Lawrence (1872) in continuation of Sir Herbert Edwardes's work.\nA tribute to his powers as an original thinker by his chief at the Colonial Office, Sir Edward Bulwer-Lytton, is printed with a notice of his career which his brother contributed to the Transactions (1884) of the Devonshire Association.", "link_mentions": {}}}