{"wiki_id": "http://www.wikidata.org/entity/Q16106197", "itemLabel": "Neville Buswell", "itemDescription": "British actor (1943-2019)", "wikipedia_url": "https://en.wikipedia.org/wiki/Neville_Buswell", "wikipedia_page": {"main": "Neville Alfred Morris Buswell (20 January 1943 – 25 December 2019) was a British actor, best known for his role as Ray Langton in Coronation Street.", "link_mentions": [{"page": "Ken Barlow", "response": ["When Ray Langton (Neville Buswell) leaves his wife Deirdre (Anne Kirkbride) in 1978, Ken supports her. In 1981, they marry, with Ken becoming stepfather to Deirdre's four-year-old daughter Tracy (Christabel Finch). However, by 1983, Deirdre grows bored with Ken and has an affair with his rival, Mike Baldwin (Johnny Briggs). Ken and Deirdre's marriage suffers; the couple separate in 1990, and eventually divorce following Ken's affair with Wendy Crozier (Roberta Kerr), his colleague at the local newspaper, The Weatherfield Recorder. Ken takes the separation badly and attempts suicide by overdose, but is prevented from doing so by his friend, Bet Lynch (Julie Goodyear)."]}, {"page": "Deirdre Barlow", "response": ["Deirdre's typist skills are noticed by troublesome Ray Langton (Neville Buswell), and he hires her as a secretary in the builder's yard, but due to Ray's constant needling she resigns in June 1975 after they have a blazing row. However, the hate turns to feelings for him, and they marry in July. They later move into No. 5 Coronation Street in March 1976, shortly after their daughter Tracy (Christabel Finch) is born on 24 January 1977. After Deirdre is attacked by a rapist while walking home, she contemplates suicide, standing on the parapet of a motorway bridge and only snaps back to reality when a lorry driver asks her for directions. Her marriage to Ray fails, and by September 1978, he is having an affair with waitress Janice Stubbs (Angela Bruce). When Deirdre finds out, they decide to start afresh and emigrate to the Netherlands, where Ray has been offered a job, but at their farewell party two months later, Deirdre decides not to go and Ray leaves alone; they subsequently divorce. In 1979, Deirdre is touched when Sally Norton (Yvonne Nicholson) – who had been in the bed next to her when Deirdre was giving birth – brings Tracy a doll, but she makes excuses to stop Sally taking Tracy out. Later, Deirdre leaves Tracy outside the Rovers whilst she visits Annie for knitting patterns but they are disturbed by the sound of a crash and Deirdre finds a lorry outside has spilt a load of timber into the front of the Rovers, crushing the front of the pub. Deirdre hysterically claws at the timber screaming for Tracy, who she believed was underneath. Sally had been unstable since she had been persuaded by a social worker to put her daughter up for adoption shortly after the birth, and Deirdre later discovers she has taken Tracy, moments before the lorry crashed."]}, {"page": "Rita Sullivan", "response": ["In January 1972, Rita returns to the Street as Rita Bates, living with Harry Bates (William Simons) as his common-law wife and his twelve-year-old son Terry (John Barrett). Initially attracted to Ken Barlow (William Roache), Rita later starts an on-off relationship with Len Fairclough (Peter Adamson). Len arrives at Harry's house to return a scarf that Rita left in his van. They flirt. Len tells Jerry Booth (Graham Haberfield) and Ray Langton (Neville Buswell) to stay out of the house that evening as he’s entertaining a lady but to tidy up before they go. Ray delays going until Rita arrives so he can see who the woman is. Rita tells Len that her husband is away often working on building motorways. She obviously isn't happy in her marriage. Len tells her how much he likes her but Alf Roberts (Bryan Mosley) interrupts them. Rita is surprised to find out that Len is a councillor."]}, {"page": "Gail Platt", "response": ["Gail Potter is a friend of Tricia Hopkins (Kathy Jones) and a boss. She is first seen as a teenager in July 1974 when she tells Ray Langton (Neville Buswell) that Tricia fancies him. In April 1975, Gail discovers that the man her mother was living with – Frank Peterson – isn't her father as she thought. Angry, Gail leaves home, moving into the shop flat with her co-worker/former schoolfriend, Tricia. Gail is plagued by nuisance telephone calls and when phone engineer, John Lane, turns up one evening to catch the culprit, Gail realises that it is him. Luckily, Emily Bishop (Eileen Derbyshire) sees him go in, her suspicions aroused, and the police are called."]}, {"page": "Blanche Hunt", "response": ["Blanche is introduced as the widowed mother of Deirdre Hunt (Anne Kirkbride). Her bank manager husband, Donald, died in January 1963 after being knocked down outside their house by a black Ford Prefect. Blanche immediately makes her mark by slapping Deirdre's love interest, Ray Langton (Neville Buswell), when she thinks he's treating her daughter badly; she is quick to criticise Deirdre when she disapproves of her behaviour. Blanche originally runs a corset business from home but later takes jobs as a barmaid at The Rovers Return and helps Gordon Clegg (Bill Kenwright) run the corner shop."]}, {"page": "Tracy Barlow", "response": ["Tracy is the daughter of Ray Langton (Neville Buswell) and Deirdre Barlow (Anne Kirkbride). Tracy never had much to do with Ray and was later adopted by Deirdre's new husband Ken Barlow (William Roache). Early storylines featuring Tracy concentrated on her childhood. She went on to feature in storylines about drugs, various family crises, relationships with Roy Cropper (David Neilson) and Steve McDonald (Simon Gregson), a feud with Steve's ex-wife Karen McDonald (Suranne Jones) and a short-lived marriage to Robert Preston (Julian Kay). Her exit storyline in 2007 was the culmination of a storyline that saw Tracy imprisoned for killing her boyfriend Charlie Stubbs (Bill Ward) in revenge. In the on-screen events, Tracy was sentenced to 15 years in prison. Her brief return in May 2010 saw the character lie about Gail Platt (Helen Worth) confessing to murdering late husband Joe McIntyre (Reece Dinsdale). Her return in December 2010 saw her released from prison after forensic evidence used at her trial was discredited, and getting her daughter Amy Barlow (Elle Mulvaney) back and attempting to steal Steve from his wife Becky McDonald (Katherine Kelly) and failing; resulting in them both having a feud. Tracy also sparked a feud with Tina McIntyre (Michelle Keegan), which worsened after it transpired that Tina had kissed Rob Donovan (Marc Baylis). Rob would later murder Tina and after discovering this, Tracy and Rob's sister, Carla Connor (Alison King), turned him in and he was arrested, sparking a feud between Tracy and Carla. Tracy's former husband Robert Preston (Tristan Gemmill) also returned, with Tracy going on to briefly reunite with him. She has since remarried Steve and had a drunken one night stand with Paula Martin (Stirling Gallacher).", "Tracy Lynette Langton is the daughter of Ray (Neville Buswell) and Deirdre Langton (Anne Kirkbride), born on 24 January 1977. Ray leaves when Tracy is a baby and she is raised by Deirdre and her husband, Ken Barlow (William Roache), who adopts her.", "Tracy was created as the daughter of Deirdre (Anne Kirkbride) and Ray Langton (Neville Buswell). The first actress to play Tracy was Christabel Finch in 1977, who first appeared in the role when she was 15 days old. According to Finch in 2007, \"It was a case of being the right baby, in the right place, at the right time. The casting director came to the baby unit and picked me at random, then asked my parents if I could be in the show.\" In 2001, Finch reflected on her time in the soap, remembering that she used to share a dressing room with Anne Kirkbride who played Tracy's mother Deirdre and one of her most prominent storyline memories is her involvement in Deirdre's affair with Mike Baldwin (Johnny Briggs): \"Because I was a kid, everyone was really friendly to me. Julie Goodyear, who played Bet Gilroy, was really lovely and a very down-to-earth person. The biggest plot I was involved in was when Deirdre had an affair with Mike Baldwin. There was a lot of shouting going on and Ken was screaming at her, 'Get out of the house!' I just thought, 'what's going on, why are they shouting?'\" Finch left the role when she was seven as her parents had opted to move to Guernsey. It was two years until the producers recast Tracy. On screen during that time, Tracy's parents Ken and Deirdre would say that Tracy was either in her room upstairs or at school. Eight-year-old Holly Chamarette was given the role in 1985. At the time she reportedly commented, \"I'm thrilled. I've been watching Coronation Street for ages.\" She was chosen from more than 60 children, but left the role when she was 11 in 1988, quitting the acting profession to become a doctor."]}, {"page": "Rovers Return Inn", "response": ["* 10 April 2005: Tracy Barlow's (Kate Ford) biological father Ray Langton (Neville Buswell) dies of stomach cancer during a party to celebrate the second wedding of his ex-wife Deirdre Rachid (Anne Kirkbride) to Ken Barlow (William Roache).", "Jack (Arthur Leslie) and Annie Walker (Doris Speed) bought the tenancy and moved into The Rovers Return on 4 February 1937. During World War II, landlord Jack was away from the pub for some time on army duty, leaving Annie to run the pub by herself. The pair was considered very different. Jack, with a broad Northern accent (the phrase \"Eeee Annie\" heard on many occasion), was no different from his customers, whilst Annie was a snobbish, \"well spoken\" lady.  Despite this, the pair were inseparable until Jack's untimely death in 1970 while the couple were on holiday. (This was due to the sudden death of Arthur Leslie off-screen). Considered by many to be the best landlady of them all, Annie holds the reins at The Rovers for 46 years. Her sometimes vicious snobbishness often alienates her from her customers, but she runs the pub with class and stands for no nonsense.Little. (1993) p.19. Behind her mask of a hard landlady, Annie is a very vulnerable person. In 1975, she is held up in her bedroom by two young thieves. After she refuses to reveal where she keeps her money, they flee, receiving a beating in the yard courtesy of Ray Langton (Neville Buswell) and Len Fairclough (Peter Adamson). Though calm throughout, the ordeal causes Annie to collapse later. The brewery hears rumours that she is becoming an absentee landlady, something which she had always feared.Little. (1993) p.142. She does not like to feel detached from her duties, and is always free to speak to customers and develop friendships with her staff, in particular Bet Lynch (Julie Goodyear) and Betty Turpin (Betty Driver). She continues her tenancy until 1983 (on-screen), but in 1984 it is announced that Annie has decided to retire as landlady to spend more time with her daughter, Joan, and her family in Derby. In agreeing to pay off her son Billy Walker's (Ken Farrington) debts, he agrees to take over the tenancy as landlord. Sadly, Billy does not fully enjoy the role, and in December 1984, the brewery buy the tenancy back from the Walker family, ending over 47 and a half years of the Walker name over the door of The Rovers. In 2012, it is revealed that Annie left the tenancy and role of landlady to Betty in her will; however, Betty is not interested, and the letter and will are only found after Betty's death (and the tenancy had already been sold back to the brewery prior to Annie's death, rendering the bequest moot).", "In 2005, Ray Langton (Neville Buswell) returned to Coronation Street, where he died of stomach cancer. His death was the second death in the history of Coronation Street to take place inside The Rovers."]}, {"page": "Ray Langton", "response": ["Ray Langton is a fictional character from the British ITV soap opera, Coronation Street, played by Neville Buswell.", "Ray Langton's departure in 1978 came due to Neville Buswell quitting acting and later leaving to work in Las Vegas. However, he returned in 2005 for a brief stint, 27 years since he portrayed the character.", "Neville Buswell is the fourth cast member to have the longest break in Coronation Street, which is a 27-year absence from 1978 to 2005. As of 2011, Philip Lowrie, who played Dennis Tanner, has the record for the longest break between TV appearances in the same show, having been absent for 43 years."]}, {"page": "Amy Barlow", "response": ["Amy is the daughter of Tracy Barlow (Kate Ford) and Steve McDonald (Simon Gregson), granddaughter of Deirdre Barlow (Anne Kirkbride), Ray Langton (Neville Buswell), Ken Barlow (William Roache), Liz McDonald (Beverley Callard) and Jim McDonald (Charles Lawson) and the cousin of Simon Barlow (Alex Bain) and Adam Barlow (Iain De Caestecker; Sam Robertson). Amy's storylines have included: her mother's selling her to Roy Cropper (David Neilson), who was presumed to be the father of Amy, and his wife, Hayley (Julie Hesmondhalgh); her becoming lactose intolerant and purposefully making herself ill so that her parents would be nice to each other; her losing her great-grandmother Blanche Hunt (Maggie Jones) and grandmother Deirdre; and her being stuck in Victoria Court flats when a fire was accidentally started by Tracy and falling pregnant at the age of 14 by gang leader Tyler Jefferies (Will Barnett) and having a secret abortion without telling her parents."]}, {"page": "Bet Lynch", "response": ["The character then first appears in 1966 (as presumed) as a factory worker who gives Lucille Hewitt (Jennifer Moss) a black eye. She quickly departs with the explanation she has moved away (actress Patricia Phoenix was also rumoured to have told Goodyear to return to the programme when she gained a little more acting experience). Bet returns in 1970, when she shares a flat with Irma Barlow (Sandra Gough), who put a down payment on it with the help of Len Fairclough (Peter Adamson) and Ray Langton (Neville Buswell). Bet begins work as a barmaid at the Rover's Return. The earlier incident with Lucille is not mentioned again and the two became good friends."]}, {"page": "List of former Coronation Street characters", "response": ["|Ray Langton || Neville Buswell || 1966, 1968–1978, 2005"]}, {"page": "Tony Aitken", "response": ["He attended Belmont Abbey School, Hereford, 1959–64. He was active in the amateur dramatic society, appearing in many revues, plays and Gilbert and Sullivan productions. He acted with Neville Buswell another student at the school. Trained as a Drama and Art Teacher at St. Mary's University College, London 1964–67."]}, {"page": "Buswell", "response": ["*Neville Buswell (1943–2019), British actor "]}, {"page": "List of longest-serving soap opera actors", "response": ["|Neville Buswell || Ray Langton || Coronation Street || 1966, 1968–1978, 2005 ||  years ||"]}, {"page": "List of Coronation Street characters (2005)", "response": ["Louise Hazel meets Steve McDonald (Simon Gregson) on the Red Rec. He is immediately attracted to her and when she says she's going into town he organises a free taxi. Steve is delighted the taxi driver gives him a note from Louise with her phone number on it. On 3 April 2005, Louise enjoys a drink with Steve, much to the indignation of his ex Tracy Barlow (Kate Ford). Louise is unfazed by Tracy and tells her to move on and leave her and Steve alone. Steve keeps Louise waiting in the pub while he comforts Tracy following the sudden death of her father Ray Langton (Neville Buswell). When he finally arrives at the Rovers and convinces Louise to go home with him and the couple then sleep together. On 13 April 2005, Louise shares a sad farewell with Steve as she has to return to Ireland. Louise returns to the Street on 12 June 2005, as she is visiting relatives and calls to Steve, who is delighted. However, Tracy threatens Louise telling her to leave Steve alone."]}, {"page": "Chapel-en-le-Frith", "response": ["* Neville Buswell (1943 in Chapel-en-le-Frith – 2019), British actor known for his role as Ray Langton in Coronation Street"]}, {"page": "List of Coronation Street characters (1973)", "response": ["Patricia \"Tricia\" Hopkins, played by Kathy Jones, made her first screen appearance on 24 September 1973. Patricia is the daughter of Idris and Vera Hopkins (Kathy Staff) and the granddaughter of Cledwin and Megan Hopkins. She first appeared in September 1973 when she was being chatted up by Ray Langton (Neville Buswell) and was eventually caught by Vera drinking in The Rovers Return."]}, {"page": "List of Coronation Street characters (1971)", "response": ["Edna Gee was played by Mavis Rogerson. Edna first appeared in 1971 working at the Mark Brittain mail order warehouse. Edna was the first wife of Fred Gee. Edna was well known in Weatherfield as being a bit of a flirt. In 1973 she attended Hilda Ogden's (Jean Alexander) birthday party and flirted with Ray Langton (Neville Buswell), but ended up in the Ogdens' bedroom with Billy Walker (Ken Farrington). Hilda thought Edna was in the room with Stan. Edna also enjoyed a gossip and along with workmate Ivy Tilsley (Lynne Perrie) started spreading rumours that Elsie Tanner's (Pat Phoenix) husband Alan Howard (Alan Browning) was having an affair. Her other workmates included Elsie, Ken Barlow (William Roache), Emily Nugent (Eileen Derbyshire), Vera Duckworth (Liz Dawn), Gail Potter (Helen Worth) and Tricia Hopkins (Kathy Jones). She attended Emily's wedding to Ernest Bishop (Stephen Hancock) in 1972. In October 1975, Edna celebrated her 40th birthday with Fred in The Rovers Return. The next day Edna was found dead in the warehouse fire, Len Fairclough (Peter Adamson) broke the news to all her friends and workmates."]}, {"page": "List of Coronation Street characters (1970)", "response": ["Frank Bradley, played by Tommy Boyle, made his first screen appearance on 8 July 1970.Little 2000, p.71. Frank and his friend Jud Johnson turned up looking for Ray Langton (Neville Buswell) and, after swearing that they were reformed characters, talked Ray into giving them a job. Ray employed Frank and Jud to build a display cabinet for Ernest Bishop's (Stephen Hancock) shop, but they stole a camera and threatened to pin the blame on Ray, unless he helped them with a robbery. Ken Barlow (William Roache) scared Frank and Jed off by posing as a policeman. A newly returned Bet Lynch (Julie Goodyear) was not put off by Frank's past and embarked on a \"passionate affair\" with him. At nineteen, Frank was almost half Bet's age and she was worried that he would leave her. Bet tried to get Frank to commit to her, but he felt trapped and broke off the relationship. "]}, {"page": "List of Coronation Street characters (1975)", "response": ["Eddie Yeats and his friend Monkey reunite to case some houses for Monkey to burgle. They store the proceeds of the burglaries at Minnie Caldwell's (Margot Bryant) house. However, the police quickly catch them and they are sent to prison. When they are released from prison the following year, Eddie and Monkey go to the Rovers Return, hoping to find somewhere to stay. Ray Langton (Neville Buswell) tells them that Number 11 is empty and Eddie and Monkey let themselves in and go to sleep. The owners, Elsie (Patricia Phoenix) and Gail (Helen Worth), return home and throw them out. In desperation, Eddie and Monkey let themselves back in and fell asleep in the living room. The following morning, Elsie and Gail threaten to ring the police, but Eddie begs her not to and she agrees. Eddie and Monkey find separate lodgings in the area and when Eddie is thrown out of his, Monkey invites him to stay with him. Monkey gets some cheap watches and sells them to Eddie, who then sells them on. When one of the watches stopped working after a few days, everyone assumed the watches were dodgy. Eddie throws the lot down a drain, but Monkey explains that the watches were not stolen and they try unsuccessfully to retrieve them. A few years later, Monkey helps Eddie to get back some items that have been stolen and return them to their owners."]}, {"page": "List of Coronation Street characters (1976)", "response": ["Terry Bradshaw, played by Bob Mason, made his first onscreen appearance on in 1976 and departed in December of that year. Terry was introduced as a new employee at Ray Langton (Neville Buswell) and Len Fairclough's (Peter Adamson) builders yard. Show writers then devised a relationship with Gail Potter (Helen Worth), but their romance ended when Gail said that she did not love him. He left in December to join the army. His sister Renee Bradshaw (Madge Hindle) was also introduced into the series.Randall 2010, p.242.Randall 2010, p.129."]}, {"page": "Neville (name)", "response": ["*Neville Buswell (1943–2019), British actor"]}, {"page": "2019 in British television", "response": ["|Neville Buswell"]}, {"page": "Deaths in December 2019", "response": ["*Neville Buswell, 76, British actor (Coronation Street).Coronation Street star Neville Buswell dies at 77"]}, {"page": "List of Coronation Street characters (2020)", "response": ["Digital Spy described Elaine's role in the coercive control storyline as \"pivotal\", and hinted that her arrival in Weatherfield \"may offer fresh hope for Yasmeen\". Actress Wilcox said that being part of the storyline was \"daunting\", and that she \"quickly realised that [she] was going to be part of something very big and very important\". Viewers began to suspect that Elaine would be revealed as the mother of Geoff's son Tim Metcalfe (Joe Duttine), which producers later confirmed to be true. Wilcox has appeared in the series previously in 1969, as Janice Langton, the sister of Ray Langton (Neville Buswell)."]}]}}