{"wiki_id": "http://www.wikidata.org/entity/Q16116339", "itemLabel": "Sheila Parker", "itemDescription": "English footballer (born 1947)", "wikipedia_url": "https://en.wikipedia.org/wiki/Sheila_Parker", "wikipedia_page": {"main": "Sheila Parker  (née Porter; born 1947) is an English former international football defender. In November 1972 she captained the England women's national football team in their first official match, a 3–2 win over Scotland in Greenock. Parker was announced as an inductee to the English Football Hall of Fame in May 2013.Parker grew up in Chorley, Lancashire and played football with the boys at school. In June 1961, 13-year-old Parker played her first match for Dick, Kerr's Ladies.When the Women's Football Association (WFA) tasked Eric Worthington with constructing the first official England national team in 1972, he selected Parker as his captain after a series of trials. She was 24, already married and returning from the birth of her son earlier that year.\nParker, a centre half, retained the captaincy until 1976, when she was left out of the squad for a Home Nations tournament against Wales and Scotland. Carol Thomas assumed the captaincy. Parker returned to the team in November 1977, scoring the winning goal in a 1–0 victory over Italy at Plough Lane. Wendy Owen reported that her central defensive partner Parker played for England until 1980.In 1974 Parker helped Fodens, originally a works team from the Edwin Foden, Sons & Co. lorry manufacturing plant in Sandbach, shock Southampton in the final of the Women's FA Cup. Teammate Sylvia Gore recalled:\nIt was the first time Southampton had ever lost in a cup game in the three seasons the national cup had been in existence. We were determined to beat them. We weren't frightened of them — even though they had six international players on their side, compared to our four. It was close though, but I think we deserved our 2–1 win.\nEngland manager Martin Reagan selected veteran Parker in his squad for the 1984 European Competition for Women's Football final against Sweden. After her retirement as a player in 1984, Parker wanted to remain involved in football and trained as a referee under the Lancashire County Football Association.Parker was appointed Member of the Order of the British Empire (MBE) in the 2022 New Year Honours for services to women's football and charity.", "link_mentions": [{"page": "Chorley", "response": ["*Sheila Parker (born 1947), (former captain of the England women's national football team)"]}]}}