{"wiki_id": "http://www.wikidata.org/entity/Q16199132", "itemLabel": "Tulip Mazumdar", "itemDescription": "British journalist and broadcaster", "wikipedia_url": "https://en.wikipedia.org/wiki/Tulip_Mazumdar", "wikipedia_page": {"main": "Tulip Mazumdar is a British journalist and broadcaster who currently works for the BBC as their global health reporter.Mazumdar is from Spalding, Lincolnshire, her first name chosen by her mother as she looked out on tulip fields in Lincolnshire. She is of Indian Bengali descent.She attended The King's (The Cathedral) School, Peterborough,  and then the University of Liverpool before moving to work for BBC Radio Merseyside. From there she moved to the news department broadcasting on the BBC station 1Xtra. She has also worked on the BBC Radio 1 Newsbeat programme, the Radio 4 Today programme, Newsday on the BBC World Service and appeared on BBC television where she has reported from Helmand, Afghanistan, on the conflict and its impact on local communities. In 2014, Mazumdar reported for the BBC and world media on the Ebola virus epidemic in Sierra Leone.\n\n", "link_mentions": [{"page": "The King's (The Cathedral) School", "response": ["* Tulip Mazumdar, British journalist"]}, {"page": "Newsbeat", "response": ["Previous reporters and main presenters include Eleanor Oldroyd, Carolyn Atkinson, Claire Bradley, Tina Daheley, Claire Cavanagh, Dominic Byrne, Georgina Bowman, Anna Foster, Tulip Mazumdar, Chris Smith, Declan Harvey and Sinead Garvan.", "In 2007, Newsbeat's Oddbox was launched. A four-minute video which looked at the week's strangest news, it was mostly presented by Dominic Byrne. When he was unavailable Tulip MazumdarOddbox presented by Tulip  and Natalie Jamieson as deputy. Old episodes are available to watch at BBC Online, on the BBC Red Button and on the BBC News channel. The last episode of Oddbox was released on 14 September 2012, to coincide with Byrne leaving Radio 1.The last ever Oddbox"]}, {"page": "Majumdar", "response": ["*Tulip Mazumdar (born 1981) British journalist and broadcaster for the BBC"]}, {"page": "List of current BBC newsreaders and reporters", "response": ["*Tulip Mazumdar – Global Health"]}, {"page": "Newsday (radio programme)", "response": ["| 2012–present || Tulip Mazumdar"]}, {"page": "Tulip (name)", "response": ["*Tulip Mazumdar (born c. 1981), British journalist and broadcaster currently with the BBC"]}, {"page": "Chris Smith (newsreader)", "response": ["Smith first broadcast on Chiltern Radio in Dunstable, where he started as an intern and became trainee journalist afterwards. He then moved to the newly launched Heart 106.2 in London. He was the newsreader and cohost on the Christian O'Connell breakfast show on XFM London. When O'Connell moved to Virgin Radio (now Absolute Radio), Smith joined him. He left in 2007 and began reading the news on BBC Radio 1. He took over from Tulip Mazumdar as the regular afternoon newsreader in May 2011. These bulletins were simulcast on BBC Radio 1Xtra from September 2012. He regularly presented both the 12:45 and 17:45 Newsbeat programmes."]}, {"page": "WFTV Awards", "response": ["| Tulip Mazumdar "]}]}}