{"wiki_id": "http://www.wikidata.org/entity/Q16186198", "itemLabel": "André Cox", "itemDescription": "CEO and 20th General of The Salvation Army", "wikipedia_url": "https://en.wikipedia.org/wiki/Andr%C3%A9_Cox", "wikipedia_page": {"main": "General André Cox (born 12 July 1954) is the former chief executive officer (CEO) and 20th General of The Salvation Army. He was commissioned as an Officer in The Salvation Army on 25 May 1979. He was elected to the position of General by the 18th High Council of The Salvation Army on 3 August 2013 and retired on 3 August 2018; he was succeeded by Brian Peddle.\nHe was the Chief of the Staff of The Salvation Army from 1 February 2013 to 3 August 2013. In the wake of the unexpected retirement of General Linda Bond in June 2013, Cox fulfilled the duties of General as Acting General for about two months until his actual election.\nBorn in Salisbury, Southern Rhodesia, today Zimbabwe, to an English father and Swiss mother, Cox spent his childhood years in Southern Rhodesia and the United Kingdom, before moving to Switzerland where he met and married Silvia Cox (née Volet), who was born to Swiss parents in Argentina.", "link_mentions": [{"page": "General of The Salvation Army", "response": ["| André Cox"]}, {"page": "High Council of The Salvation Army", "response": ["*Chief of the Staff of The Salvation Army, Commissioner André Cox"]}, {"page": "Cox (surname)", "response": ["*André Cox (born 1954), Zimbabwean General of The Salvation Army"]}, {"page": "List of 21st-century religious leaders", "response": [":*André Cox, General (2013–2018)"]}, {"page": "Linda Bond", "response": ["The High Council of The Salvation Army convened on 29 July 2013 to elect a new General, with André Cox being elected as the 20th General of The Salvation Army."]}, {"page": "Andre Cox", "response": ["#REDIRECT André Cox"]}, {"page": "Ecumenism and interreligious dialogue of Pope Francis", "response": ["On 14 December 2014, Pope Francis became the first pope to host a General of The Salvation Army, the international leader of the Evangelical Methodist denomination The Salvation Army, in a private audience in the Vatican when he met with André Cox. The pope said that \"Catholics and Salvationists, together with other Christians, recognise that those in need have a special place in God's heart\", as a result they often \"meet at the same peripheries of society\"."]}]}}