{"wiki_id": "http://www.wikidata.org/entity/Q16105438", "itemLabel": "Ruth Myers", "itemDescription": "British costume designer", "wikipedia_url": "https://en.wikipedia.org/wiki/Ruth_Myers_(costume_designer)", "wikipedia_page": {"main": "Ruth Myers (born 1940) is a British costume designer. She has received two Academy Award nominations as well as two BAFTA nominations and has won an Emmy Award for costumes. In 2008, she received the Career Achievement Award at the Costume Designers Guild Awards.\n\n", "link_mentions": [{"page": "Academy Award for Best Costume Design", "response": ["| Ruth Myers", "| Ruth Myers", "*0: Ruth Myers (2)"]}, {"page": "L.A. Confidential (film)", "response": ["|Best Costume Design || Ruth Myers || ", "The movie was released again as a two-disc Special Edition DVD and Blu-ray on September 23, 2008. Both sets have the same bonus content. In addition to the features from the original DVD, there are four new featurettes, the 1999 pilot of the proposed TV series starring Kiefer Sutherland, and film commentary by writer (novel) James Ellroy, writer (screenplay)/co-producer Brian Helgeland, actors Kevin Spacey, Russell Crowe, Guy Pearce, James Cromwell, Kim Basinger, Danny DeVito & David Strathairn, production designer Jeannine Oppewall, director of photography Dante Spinotti, costume designer Ruth Myers and American film critic Andrew Sarris. Some sets included a six-song sampler from the film's soundtrack."]}, {"page": "Saturn Award for Best Costume Design", "response": ["| Ruth Myers", "| Ruth Myers", "* Ruth Myers"]}, {"page": "69th Academy Awards", "response": ["** Emma – Ruth Myers"]}, {"page": "The Golden Compass (film)", "response": ["| Ruth Myers "]}, {"page": "64th Academy Awards", "response": ["** The Addams Family – Ruth Myers"]}, {"page": "Emma (1996 theatrical film)", "response": ["thumb|left|160px|Emma's wedding dress created by Ruth Myers.", "British costume designer Ruth Myers created and designed the clothing for the film. She wanted to mirror the lightness of the script within the costumes and give \"a spark of color and life\" to the early 19th century setting. During her research, Myers noted a similarity between the fashions after the Napoleonic Wars and the 1920s, saying that they had \"the same sort of flapperish quality\". The designer explained \"The moment I set to research it, more and more it kept striking me what the similarities were between the two periods. It was a period of freedom of costume for women, and it was a period of constant diversions for the upper classes–picnics, dinners, balls, dances. What I wanted to do was make it look like the watercolors of the period, which are very bright and very clear, with very specific colors.\"", "| Ruth Myers"]}, {"page": "51st British Academy Film Awards", "response": ["* L.A. Confidential – Ruth Myers"]}, {"page": "Costume Designers Guild", "response": ["| 2007 ||  Ruth Myers || The Golden Compass", "| 2004 || Terry Dresbach and  Ruth Myers || Carnivàle"]}, {"page": "BAFTA Award for Best Costume Design", "response": ["| Isadora || Ruth Myers", "| L.A. Confidential || Ruth Myers"]}, {"page": "City of Ember", "response": ["Saoirse Ronan was nominated for 2009 Irish Film and Television Award as \"Best Actress in a Lead Role in a Film\".IMDB Awards Art director Jon Billington and production designer Martin Laing were nominated for Satellite Awards in 2008 for their design of the film, as was Ruth Myers for her costume design."]}, {"page": "Satellite Award for Best Costume Design", "response": ["|City of Ember || Ruth Myers"]}, {"page": "Nicholas Nickleby (2002 film)", "response": ["Costume designer Ruth Myers opted to dress two of the leading characters in clothing pre-dating the period in which the film is set in order to suggest Nicholas, as the newly anointed head of his family, wore clothing inherited from his father, and the impoverished Madeline's dresses were hand-me-downs from her mother."]}, {"page": "Costume Designers Guild Awards 2007", "response": [" The Golden Compass - Ruth Myers"]}, {"page": "34th Saturn Awards", "response": ["*Ruth Myers- The Golden Compass"]}, {"page": "23rd British Academy Film Awards", "response": ["* Isadora – Ruth Myers"]}, {"page": "List of awards and nominations received by Carnivàle", "response": ["| Ruth Myers, Terry Dresbach", "| Ruth Myers, Linda Henrikson, Terry Dresbach, Niklas J. Palm, Lucinda Campbell"]}, {"page": "List of British Academy Award nominees and winners", "response": ["|Ruth Myers", "| Ruth Myers"]}, {"page": "Primetime Emmy Award for Outstanding Costumes for a Series", "response": ["| rowspan=\"5\" align=center | 2004 || style=\"background:#FAEB86;\" | Carnivàle || style=\"background:#FAEB86;\" align=center| \"Milfay\" || style=\"background:#FAEB86;\" | Lucinda Campbell, Terry Dresbach, Linda Henrikson, Ruth Myers, Niklas J. Palm || style=\"background:#FAEB86;\" | HBO"]}, {"page": "Primetime Emmy Award for Outstanding Costumes for a Miniseries, Movie, or Special", "response": ["| colspan=2| Hemingway & Gellhorn || Adina Bucur, Ruth Myers"]}, {"page": "Hemingway & Gellhorn", "response": [" | Ruth Myers"]}, {"page": "Costume Designers Guild Award for Excellence in Fantasy Costume Design for Film", "response": ["|rowspan=5 style=\"text-align:center;\"|2007|| style=\"background:#B0C4DE;\" | The Golden Compass || style=\"background:#B0C4DE;\" |  Ruth Myers"]}, {"page": "International Festival of Independent Cinema Off Camera", "response": ["The jury comprising Lech Majewski (the head of the jury), Udo Kier, John Rhys-Davies and Ruth Myers granted US$100,000 and Kraków Film Award to Marcin Krzyształowicz for \"Manhunt\".  Polish director was also promised a grant amounting to 1,000,000 PLN from the Polish Film Institute.  The jury decided to hand out the second award (\"Ombline\" by Stéphane Cazes) as well as special recognitions (\"Soldate Jeannette\" by Daniel Hoesl and \"Upstream Color\" by Shane Carruth). The Jury of the International Federation of Film Critics FIPRESCI gave its award to Stéphane Cazes for the film, \"Ombline\". The film also received the youth jury award. It included junior high school students and high school students, who won a competition to write a film review as part of a social action of the Polish Film Institute, \"Skrytykuj\" (\"Criticize\").", "* Ruth Myers – British costume designer, nominated to the Oscar for Emma and The Addams Family. She won the Emmy Award for the costumes in TV show Carnivale"]}, {"page": "Bryna Productions", "response": ["Something Wicked This Way Comes opened on April 29, 1983. While it was generally well received by critics, the film failed to recoup its increased $20,000,000 budget at the box office; it has since become a cult film. The Academy of Science Fiction, Fantasy & Horror Films awarded the film a Saturn Award for Best Fantasy Film and Bradbury a Saturn Award for Best Writing. Jonathan Pryce was nominated for a Saturn Award for Best Supporting Actor, James Horner was nominated for a Saturn Award for Best Music, Ruth Myers was nominated for a Saturn Award for Best Costumes, Lee Dyer was nominated for a Saturn Award for Best Special Effects, and Gary Liddiard and James R. Scribner were nominated for Saturn Awards for Best Make-Up. Jack Clayton was nominated for the Grand Prize at the Avoriaz Fantastic Film Festival and Clayton and Bradbury were together nominated for a Hugo Award for Best Dramatic Presentation."]}, {"page": "Ruth Myers", "response": ["Ruth Myers may refer to:", "*Ruth Myers (costume designer) (born 1940), British costume designer ", "*Ruth Myers (sculptor), artist in residence with the Southland Art Foundation", "*Ruth Myers, first wife of Ellis Cunliffe Lister"]}, {"page": "11th Saturn Awards", "response": ["** Ruth Myers – Something Wicked This Way Comes"]}, {"page": "Costume Designers Guild Award for Excellence in Fantasy Film", "response": ["| rowspan=\"5\" style=\"text-align:center;\"| 2007 || style=\"background:#FAEB86;\" | The Golden Compass || style=\"background:#FAEB86;\" | Ruth Myers"]}, {"page": "List of female Academy Award winners and nominees for non-gendered categories", "response": ["|Ruth Myers", "|Ruth Myers"]}, {"page": "Costume Designers Guild Award for Excellence in Period Television", "response": ["| rowspan=\"4\" style=\"text-align:center;\"| 2003 || style=\"background:#FAEB86;\" | Carnivàle || style=\"background:#FAEB86;\" | Ruth Myers (Pilot), Terry Dresbach (Series) || style=\"background:#FAEB86;\" | HBO"]}, {"page": "Costume Designers Guild Award for Excellence in Sci-Fi/Fantasy Television", "response": ["| rowspan=\"4\" style=\"text-align:center;\"| 2003 || style=\"background:#FAEB86;\" | Carnivàle || style=\"background:#FAEB86;\" | Ruth Myers (Pilot), Terry Dresbach (Series) || style=\"background:#FAEB86;\" | HBO"]}]}}