{"wiki_id": "http://www.wikidata.org/entity/Q16106618", "itemLabel": "Paul Capell, 11th Earl of Essex", "itemDescription": "English peer (born 1944)", "wikipedia_url": "https://en.wikipedia.org/wiki/Paul_Capell,_11th_Earl_of_Essex", "wikipedia_page": {"main": "Frederick Paul de Vere Capell, 11th Earl of Essex (born 29 May 1944) is the current Earl of Essex. He succeeded his father Robert Capell, 10th Earl of Essex, in 2005.\nBorn to Robert Capell and his wife Doris, Lord Essex began his life as Frederick Paul de Vere Capell. His father was a distant cousin to the 9th Earl of Essex.\nWhen his father proved that he was the heir to the earldom in 1989, Paul became entitled to call himself Viscount Malden. However, few people at Skerton County Primary School in Lancashire, where he was deputy headmaster, knew of his aristocratic status.Lord Essex is unmarried at age 77. If he dies without an in-wedlock son, the earldom will pass to William Jennings Capell, his fourth cousin once removed. William's father, Bladen Horace, was a strong claimant to the heirship of the earldom, before the 10th Earl proved his superior claim.", "link_mentions": [{"page": "Earl of Essex", "response": ["The current holder of the earldom is Paul Capell, 11th Earl of Essex (born 1944), a retired school teacher from Caton, Lancashire."]}, {"page": "List of earls in the peerages of Britain and Ireland", "response": ["|13. ||The Earl of Essex||(1661)||25px||Paul Capell, 11th Earl of Essex||"]}, {"page": "William Jennings Capell", "response": ["William Jennings \"Bill\" Capell (born 9 August 1952), a retired grocery clerk from Yuba City, California, is the heir presumptive to the Earldom of Essex. He will be the 12th Earl if the current earl, Paul Capell, 11th Earl of Essex (currently  and unmarried), predeceases him without in-wedlock male issue. He had considered renouncing the earldom if it would require him to give up his United States citizenship (under the United Kingdom's Peerage Act 1963, a person may disclaim a hereditary peerage). United States law requires only government officeholders without Congressional authorization and persons wishing to become naturalized citizens, however, to renounce titles of nobility. As Mr. Capell is in neither category, there would be no legal impediment to his use of the title as a U.S. citizen; indeed there is precedent in the case of the Earl of Wharncliffe, currently a Maine construction worker."]}]}}