{"wiki_id": "http://www.wikidata.org/entity/Q16186730", "itemLabel": "Barry Jones", "itemDescription": "English cricketer (born 1955)", "wikipedia_url": "https://en.wikipedia.org/wiki/Barry_Jones_(cricketer)", "wikipedia_page": {"main": "Barry John Richardson Jones (born 2 November 1955) is a former English cricketer who played first-class and List A cricket for Worcestershire between 1976 and 1980.\nJones was born in Shrewsbury, Shropshire and educated at Wrekin College.Jones made his first-class debut against Oxford University at The University Parks in late May 1976. Although he made only 10 and 4 from number two in the order,\nhe was retained for the County Championship match which immediately followed. In this game, now batting at seven, he did no better, making only 11 and 1.\nAfter this, Jones spent a long period out of the first team, returning only in August when he was given a short run but again made no significant scores.\nDuring the 1977 season, Jones played in the First XI more than at any other time, turning out for 14 first-class and six List A games. In late August he finally made his maiden fifty, hitting 65 against Warwickshire at Edgbaston.Wisden thought he had made \"a steady advance\" over the summer,\nbut statistically his season as a whole was disappointing as he averaged only 16.31 in first-class cricket and 8.80 in the one-day game.\nFrom 1978 to 1980, Jones was in and out of the Worcestershire side, often getting chances but never managing a really big score. Indeed, he was to score only one half-century in 26 first-class games during that period, an innings of 61 against Oxford University in June 1978.\nHis most eye-catching achievement came in a Second XI match, when he hit a century in each innings versus Somerset II in August 1979.Jones' career in top-class cricket ended after the 1980 season, and he returned to his family's farm in Shropshire. He played minor counties cricket with Shropshire in 1981 and 1982, and since 2006 he has made numerous appearances for Shropshire's Over-50s team. He has played at club level for Wroxeter.His brother Bryan Jones made 20 List A appearances for Shropshire and played one Youth Test for England.", "link_mentions": [{"page": "Barry Jones", "response": ["Barry Jones is the name of:", "*Barry Jones (actor) (1893–1981), British-born actor", "*Barry Jones (Australian politician) (born 1932), member of the ALP", "*Barry Jones, Baron Jones (born 1939), British politician", "*Barry Jones (Canadian politician) (born 1940)", "*Barry Jones (bishop) (1941–2016), ninth Bishop of Christchurch, New Zealand", "*Barry Jones (cricketer) (born 1955), English cricketer; played for Worcestershire, 1976–1980", "*Barry Jones (baseball) (born 1963), former Major League Baseball pitcher", "*Barry Jones (outfielder) (born 1965), American professional baseball player and manager (See 1990 Caribbean Series)", "*Barry Jones (footballer) (born 1970), formerly of Wrexham and York City", "*Barry Jones (boxer) (born 1974), British boxer and WBO Super featherweight Champion", "*Barry Jones (magician) (born 1980), Scottish magician", "*Barry Jones (executive), former chief executive of the Australian Petroleum Production and Exploration Association"]}, {"page": "John Inchmore", "response": ["an innings taking just 35 minutes and including seven sixes; his partner Barry Jones' share in their seventh-wicket stand of 70 was a mere 3!"]}]}}