{"wiki_id": "http://www.wikidata.org/entity/Q16145874", "itemLabel": "Ken Wharton", "itemDescription": "British writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Ken_Wharton_(writer)", "wikipedia_page": {"main": "Ken Wharton (born 21 June 1950) is an English writer and former British soldier who has written a series of non-fictional books on the conflict in Northern Ireland known as the Troubles. The books are based on first-hand accounts by soldiers of all ranks who served in the Operation Banner campaign as well as Wharton's own personal experiences from his two tours of Northern Ireland.\nBorn in Leeds, Yorkshire, Wharton, having left school at 15, joined the British Army in 1967 aged 17. He later served in the Royal Green Jackets regiment. He left the army in 1973. Upon leaving the military, he enrolled at the University of Warwick where he studied politics.", "link_mentions": [{"page": "Ken Wharton", "response": ["! Ken Wharton", "* Ken Wharton profile at The 500 Owners Association"]}, {"page": "Dominic McGlinchey", "response": ["Mary McGlinchey—called \"Mrs Mad Dog\" by the ex-soldier and writer Ken Wharton—may have continued to organise her husband's operation while he was incarcerated, perhaps even running it. Publicly, she appears to have distanced herself from political activity (notwithstanding, noted The Sunday Tribune, that \"her window displayed a Sinn Féin election poster\"). She probably to have supported the faction still controlled by her husband's man—\"Jap\" O'Reilly—in the INLA's faction feuding but not to the extent of playing a direct role."]}, {"page": "Gerard Steenson", "response": ["He was viewed highly in the movement with Brown calling him a \"committed and highly efficient military activist and a dedicated revolutionary\". However he was described by Lord Justice Cardwell as \"a most dangerous and sinister terrorist. A ruthless and highly dedicated, resourceful and indefatigable planner of criminal exploits who did not hesitate to take a leading role in assassinations and other crimes\". Henry McDonald and Jack Holland write \"Both his friends and enemies spoke in a tone of awestruck at his paramilitary abilities\". Ken Wharton refers to him as a \"notorious psychopath\". Sean O'Callaghan describes Steenson as someone who \"never took to orders\"."]}, {"page": "Brotherton", "response": ["Brotherton is the birthplace of Thomas of Brotherton, Earl of Norfolk, son of King Edward I and Margaret of France. Notable Brotherton residents include Ken Wharton (b 1950), a writer of Military History books, who lived in the village between 2005 and 2009."]}, {"page": "Miami Showband killings", "response": ["Former British soldier and writer Ken Wharton published in his book Wasted Years, Wasted Lives, Volume 1, an alternative theory that was suggested to him by loyalist paramilitarism researcher Jeanne Griffin; this was that the ambush was planned by Robin Jackson as an elaborate means of eliminating trumpet player Brian McCoy. Griffin suggests that McCoy, who originally came from Caledon, County Tyrone, and had strong UDR and Orange Order family connections, was possibly approached at some stage by Jackson with a view of securing his help in carrying out UVF attacks in the Irish Republic. When McCoy refused, Jackson then hatched his plan to murder McCoy and his bandmates in retaliation for what he viewed as having betrayed the loyalist cause, even macabrely choosing Buskhill as the ambush site due to its similarity to Bus-kill. Griffin goes on to add that the bogus checkpoint was set up not only to plant the bomb on board the van but to ensure the presence of McCoy which would have been confirmed when he handed over his driving licence to the gunmen. She also thinks that had everything gone to plan once the bomb was planted in the van McCoy would have been instructed to drive through Newry where the bomb would have gone off and the UVF could then afterwards portray the Miami Showband as IRA members on a mission to blow up the local RUC barracks. Griffin based her theory on the nine bullets that were fired from a Luger into McCoy's body and that Jackson's fingerprints were found on the silencer used for a Luger. She furthermore opined that Jackson was the man Travers saw kicking McCoy's body to make sure he was dead."]}, {"page": "Ballygawley bus bombing", "response": ["Eight of the soldiers were killed and the remaining 28 were wounded. The soldiers killed were: Jayson Burfitt (aged 19), Richard Greener (aged 21), Mark Norsworthy (aged 18), Stephen Wilkinson (aged 18), Jason Winter (aged 19), Blair Bishop (aged 19), Alexander Lewis (aged 18) and Peter Bullock (aged 21). This was the single biggest loss of life for the British Army from an IRA attack in Northern Ireland since the Warrenpoint ambush in 1979,  although eleven off-duty British soldiers were killed in the Droppin Well bombing in 1982, carried out by the Irish National Liberation Army (INLA).A Chronology of the Conflict: December 1982. Conflict Archive on the Internet (CAIN). An account from one of the survivors was published in Ken Wharton's book A Long Long War: Voices from the British Army in Northern Ireland, 1969–98.A Long Long War: Voices from the British Army in Northern Ireland 1969-98. Goodreads. Retrieved 20 February 2014."]}, {"page": "Billy Hanna", "response": ["Former British soldier and Troubles' writer Ken Wharton suggested in his 2013 book Wasted Years, Wasted Lives, Volume 1 that the accusations against Hanna having been involved in loyalist paramilitary activities were unsubstantiated.Wharton, Ken (2013). Wasted Years, Wasted Lives, Volume 1. Solihull: Helion & Company. p. 106"]}, {"page": "Hillcrest Bar bombing", "response": ["According to writer and former British soldier Ken Wharton, a loyalist attack had been anticipated in Northern Ireland as 'Catholic pubs' would be packed with people enjoying the Irish holiday. Earlier that day in East Belfast, Catholic teacher John Donnelly had been drinking in the Cregagh Inn on Woodstock Road. When one of his former students identified him as a Catholic, UDA members who happened to be in the pub forced him outside (in full view of the customers) and stabbed him to death behind the building.Wharton, Ken (2013). Wasted Years, Wasted Lives, Volume 1: The British Army in Northern Ireland, 1975-1977. UK: Helion & Company"]}]}}