{"wiki_id": "http://www.wikidata.org/entity/Q16104882", "itemLabel": "Madge Hindle", "itemDescription": "English television actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Madge_Hindle", "wikipedia_page": {"main": "Madge Hindle (born Madge Railton; 19 May 1938) an English actress, known for her roles in British television shows.", "link_mentions": [{"page": "Porridge (1974 TV series)", "response": ["* Madge Hindle as Mrs Hesketh"]}, {"page": "Hylda Baker", "response": ["Baker's highest profile role was as Nellie Pledge in the Granada Television comedy series Nearest and Dearest (1968–73). Playing her brother Eli was the comedian Jimmy Jewel and the series was centred on their characters' love-hate relationship as they tried to run their small family business, Pledge's Purer Pickles. As they bickered onscreen and traded insults such as \"knocked-kneed knackered old nosebag\" and \"big girl's blouse\", the insults continued off-screen as the two performers disliked each other intensely. A film version of the series was made by Hammer Films in 1972Nearest and Dearest (the same year she was a subject of This Is Your Life when she was surprised by Eamonn Andrews). Later in the series, Baker began having trouble remembering her lines and had to rely on cue cards and prompts from her co star Madge Hindle, who would whisper her next line to her."]}, {"page": "Gail Platt", "response": ["After the warehouse they work in burns down, Gail and Tricia work in the Corner Shop, but when Renee Bradshaw (Madge Hindle) buys the shop and flat in June 1976, the girls are evicted. Tricia leaves Weatherfield and Elsie Tanner (Pat Phoenix) returns. Elsie ensures that Gail can stay in the flat. Elsie and Gail find work at Sylvia's Separates and move into No 11. She loses her virginity to Roy Thornley but discovers that he is married and Gail is cited in a messy divorce. In December 1976, Sylvia's Separates is taken over by Mike Baldwin (Johnny Briggs) and renamed the Western Front. Elsie is moved from boutique manager to factory supervisor and Gail is promoted to manager with Suzie Birchall (Cheryl Murray), working for her. In early 1977, Suzie joins Elsie and Gail at No 11, and the three women become one of the programme's most popular groups."]}, {"page": "Alf Roberts", "response": ["In 1978, Alf married Renee Bradshaw (Madge Hindle), who now owned the corner shop. Theirs was an awkward courtship - Alf withdrew his first proposal, telling Renee that he had been drunk when he asked her - but when he proposed again, they married. The marriage seemed doomed from the start - Alf punched Renee's stepfather, Joe Hibbert, at the reception for suggesting that the only reason he had married Renee was to get the corner shop. Renee, however, made it clear that the shop was hers and Alf should continue to work at the post office. After a lorry crashed into the pub in 1979, burying Alf under tons of wood, the couple re-assessed their lives. They decided to buy a sub-post office in Grange-Over-Sands in 1980 and Renee took driving lessons. It was while learning to drive that Renee stalled Alf's car at a red traffic light in a country lane. While Alf got out of the car to change places, a lorry coming the other way hit the car and Renee was killed. Alf, who had been drinking, was unharmed and later told Ken Barlow (William Roache) that he felt guilty as seconds before Renee died, they were arguing about her driving and this was the last thing he ever said to her."]}, {"page": "Annie Walker (Coronation Street)", "response": ["In her final years at the Rovers, age was no obstacle to Annie, and she continued to rule with an iron fist. In 1976, when her business was threatened by Renee Bradshaw's (Madge Hindle) application to turn the Corner Shop into an off-licence, Annie petitioned against her, but the matter was settled in court in favour of Renee. At 67, Annie decided to learn to drive, and to pass her test after fewer than 86 lessons - the number her friend and rival Nellie Harvey (Mollie Sugden) had taken. To the surprise of all (after her first lesson ended with her hitting a lamp post), she passed her test first time and bought a second-hand Rover 2000. Not long after getting the car, Annie was stopped by the police while doing a turn in the road, and was breathalysed. Much to her horror, the crystal turned green. A blood test taken at the police station proved Annie was below the limit, but by that time her companion Kitty Stonely (Stella Moray) had already spread the word among Annie's posh friends at the Lady Victuallers."]}, {"page": "Barbara (TV series)", "response": ["*Madge Hindle - Doreen", "*Madge Hindle - Doreen"]}, {"page": "David Ross (actor)", "response": ["Ross also played Inspector Martin in The Adventures of Sherlock Holmes, Mr. Sherwin in Basil, a cheating betting shop owner in the BBC One comedy Goodnight Sweetheart, Basil Tyler (a kind-natured, well meaning cab driver and postman who was unlucky in love) in John Sullivan's BBC comedy drama Roger Roger, and Donald Moss (a DHSS officer) in Alan Bleasdale's Boys from the Blackstuff. On BBC Radio 2, in 1985, Ross starred alongside Jack Smethurst in the second series of A Proper Charlie (a comedy by Vince Powell, in which Madge Hindle also featured)."]}, {"page": "Jack Smethurst", "response": ["Smethurst also starred in Vince Powell’s seven-part BBC Radio 2 slice-of-life sitcom A Proper Charlie in 1984, as factory worker Charlie Garside. Madge Hindle played his wife with Jane Hazlegrove and Jason Littler as their daughter and son. A second series of eight episodes followed at the end of 1985."]}, {"page": "Renee Bradshaw", "response": ["Irene \"Renee\" Roberts (also Bradshaw) is a fictional character from the British ITV soap opera Coronation Street, played by Madge Hindle. The character was created by producer Bill Podmore as a new shop keeper. He wanted a mature female to create an atmosphere of gossip the show had previously boasted. While Podmore envisioned Renee as a feisty character, Hindle decided to play down the persona and make her likeable. She believed that no one would visit her shop otherwise. Renee was partnered with Alf Roberts (Bryan Mosley) and they later marry. But Hindle and Mosley did not think the two were compatible. Renee also features in a feud over her shop and comedic stories such as a disastrous fishing trip.", "Actress Madge Hindle did not audition for the role. She previously starred in Nearest and Dearest which Podmore directed and he contacted Hindle offering her the role. She accepted the part but had reservations over Renee's characterisation and forced change. Hindle explained to Little that \"I think they wanted somebody to be strong and argumentative like Ena Sharples (Violet Carson). But you can't do that in a shop because people won't come in.\" Hindle had no shop work experience and was not confident with maths. She found the till prop difficult because the tray ejected and hit her in the stomach, ruining many scenes.Little 1998, p.132."]}, {"page": "Pat and Margaret", "response": ["* Madge Hindle as Hotel Lady"]}, {"page": "Nearest and Dearest", "response": ["Also featured was the Pledges' second-cousin, Lily Tattersall, who was married to constantly-mute octogenarian Walter. Walter was unable to control his bladder, which led to one of the programme's oft-used catchphrases, \"Has he been?\". Lily was played by Madge Hindle, Walter by Edward Malin. Another regular character was the Pledges' toothless, cloth-capped old foreman, Stan Hardman (Joe Gladwin).", "Much of the comedy was derived from Nellie's constant malapropisms. When asked by Lily if she knew the facts of life, Nellie replied with immense dignity, \"Of course I do! I'm well over the age of content!\" In another episode, Nellie has a suitor named Vernon Smallpiece, whom she addresses as 'Vermin Bigpiece'. When Eli insists on playing the high-powered executive once he is in charge of the pickle business, Nellie asks him who he thinks he is \"sat sitting there like a big business typhoon!\" In each episode, Nellie and Eli would hurl insults at each other to spectacular effect, as they fought over the family business or domestic matters, with Nellie's constant nagging and Eli's constant drinking and womanising fuelling their arguments. It was known that the insults continued off-screen as well, as Baker and Jewel disliked each other in real life, their working relationship being described as \" the most toxic in the whole of British sitcom history\".McCann, Graham (9 August 2020) Comedy Chronicles:Strained Relationships: Hylda Baker & Jimmy Jewel Comedy.co.uk. Retrieved February 24, 2021. In later episodes, Baker struggled to remember her lines and relied on cue cards and prompting from co-star Madge Hindle. Baker would suffer greatly with dementia during her final years.", "Madge Hindle, the sole surviving member of the cast, went on to become a series regular in Coronation Street from 1976 to 1980, playing Renee Roberts, the wife of grocer Alf Roberts. Since then Hindle has worked in a variety of roles in television and stage."]}, {"page": "Tickle on the Tum", "response": ["*Winnie Walker (postwoman) – Madge Hindle (4 episodes, series 1–2)"]}, {"page": "Storylines of Coronation Street", "response": ["*In 1980, Renee Roberts (Madge Hindle) was killed off after public opinion polls showed the character (as well as her marriage to Alf Roberts, played by actor Bryan Mosley) to be very unpopular. She died when a lorry hit her car head-on while Alf was giving her driving lessons."]}, {"page": "Comedy Firsts", "response": ["| style=\"font-size: 100%;\" |Barbara Liversage (played by Gwen Taylor) is a no-nonsense nosey Yorkshire woman who works at a doctor's receptionist with a sharp tongue. She is married to Ted (Sam Kelly), a taxi driver. Her son Neil (Benedict Sandiford) still lives at home, while her daughter Linda (Caroline Milmoe) is married to chef Martin Benson (Glen Davies). Barbara's sister is Jean (Shirley Anne Field) who is married to Phil (John Arthur) while her colleague is Doreen (Madge Hindle). Three series of Barbara aired from 1999 to 2003."]}, {"page": "List of former Coronation Street characters", "response": ["|Renee Bradshaw || Madge Hindle || 1976–1980"]}, {"page": "On the Margin", "response": ["On the Margin was a British satirical comedy sketch show written and performed by Alan Bennett and a regular cast including John Sergeant, Virginia Stride, Madge Hindle and Yvonne Gilan. Guest performers included John Fortune and Jonathan Miller. The show also featured songs and poems by John Betjeman and Philip Larkin."]}, {"page": "Capstick's Law", "response": ["*Madge Hindle as Mrs Birtles"]}, {"page": "List of Coronation Street characters (1973)", "response": ["When Elsie Tanner (Pat Phoenix) returned to the Street to manage Sylvia's Separates, Tricia and Gail both asked her for the assistant's job. Elsie took on Tricia, but she and Gail decided to toss a coin to decide, and Gail won, leaving Tricia in the Corner Shop, but only a short time later Renee Bradshaw (Madge Hindle) bought the Shop from Gordon and Tricia lost her job. She was willing to let Tricia stay on in the flat, but Tricia was sick of Renee already and told her she could stick her job and her flat, and returned to her family."]}, {"page": "List of Coronation Street characters (1976)", "response": ["Terry Bradshaw, played by Bob Mason, made his first onscreen appearance on in 1976 and departed in December of that year. Terry was introduced as a new employee at Ray Langton (Neville Buswell) and Len Fairclough's (Peter Adamson) builders yard. Show writers then devised a relationship with Gail Potter (Helen Worth), but their romance ended when Gail said that she did not love him. He left in December to join the army. His sister Renee Bradshaw (Madge Hindle) was also introduced into the series.Randall 2010, p.242.Randall 2010, p.129.", "Irene \"Renee\" Roberts (née Bradshaw), played by Madge Hindle, made her first onscreen appearance on 10 May 1976 and departed on 30 July 1980. The character began a relationship with widower Alf Roberts (Bryan Mosley). The duo married in the episode dated 20 March 1978 despite accusations that Alf was only interested in Renee's wealth. Renee was written out of Coronation Street in 1980. Hindle told Rosemary Long from Evening Times that she was upset to learn her character would be killed off. Renee is involved in a car accident and dies from a ruptured spleen and liver.Randall 2010, p.115. The episode that aired on 30 July 1980 featured Renee's final appearance."]}, {"page": "Disturbing the Peace (Porridge)", "response": ["| Madge Hindle"]}, {"page": "Nearest and Dearest (film)", "response": ["*Lily ...Madge Hindle"]}, {"page": "Hindle", "response": ["*Madge Hindle (born 1938), English actress"]}]}}