{"wiki_id": "http://www.wikidata.org/entity/Q16196270", "itemLabel": "Robert L. Smith", "itemDescription": "American recording engineer", "wikipedia_url": "https://en.wikipedia.org/wiki/Robert_L._Smith_(recording_engineer)", "wikipedia_page": {"main": "Robert L. Smith (born 1965) is a record producer and recording engineer in New York City, USA. His work includes producing, recording and mixing numerous Billboard top 100 charting songs including 'Teenage Dream' and 'Hey, Soul Sister' with The Warblers for hit television show Glee. Robert has worked on recording projects with Lady Gaga for the single 'Speechless' which topped the Billboard Hot Singles Sales Chart in 2010 as well as tracks by Aerosmith, David Bowie, U2 and Stacie Rose.Robert's Emmy Award nomination was earned for the documentary 'Full Battle Rattle' with composer Paul Brill, for which Robert was Producer, Sound Recordist and Sound Mixer.\nRobert is a founding member of New York's Pyramid Recording Collective, and has his own music production company called Defy Recordings.", "link_mentions": [{"page": "Robert Smith", "response": ["* Robert L. Smith (recording engineer) (born 1965), recording engineer and record producer in New York City", "*Robert L. Smith (born 1931), Republican politician from Idaho"]}, {"page": "Robert L. Smith", "response": ["Robert L. Smith (born May 1931) was a Republican politician from  Idaho. Smith was the 1974 Republican nominee for the United States Senate seat in Idaho. He was defeated by Democratic incumbent Frank Church.http://library.boisestate.edu/special/church/Church1.shtm"]}, {"page": "Speechless (Lady Gaga song)", "response": ["*Robert L. Smith – co-production, audio engineering"]}, {"page": "Deni Bonet", "response": ["In February 2017 Deni released the all-instrumental album Bright Shiny Objects on Zip Records, distributed on Sony RED in the US and Rough Trade in the Benelux countries.  Featuring songs co-written with Stephen Gaboury, Richard Barone and Jon Cobert among others, the album was recorded with world-class session musicians including Shawn Pelton, Will Lee, Steve Holley, Graham Maby, and Liberty DeVitto.  Produced by Emmy award-winning engineer Paul Bevan, recorded and mixed by Robert L. Smith, and mastered by Scott Hull at Masterdisk, the album showcases Deni's broad musical talent across a wide variety of musical genres. Shortly thereafter she performed 3 of her original songs live at Carnegie Hall."]}, {"page": "Robert L Smith (recording engineer)", "response": ["#redirect Robert L. Smith (recording engineer)"]}]}}