{"wiki_id": "http://www.wikidata.org/entity/Q16193497", "itemLabel": "Alastair Bruce", "itemDescription": "Television commentator", "wikipedia_url": "https://en.wikipedia.org/wiki/Alastair_Bruce_of_Crionaich", "wikipedia_page": {"main": "Alastair Andrew Bernard Reibey Bruce  (born 25 June 1960), a senior British Army reservist, is a  journalist and television correspondent, who commanded the TA Media Operations Group, before being appointed in 2019 Governor of Edinburgh Castle.Royal, Religious and National Events Commentator for Sky News, Bruce was previously engaged by the BBC, and was historical adviser to several feature films and the ITV series Downton Abbey. He has commentated on many major state events in the United Kingdom, including the Queen's Diamond Jubilee in 2012, the Royal Wedding in 2011, the Papal Visit in 2010, and the deaths and funerals of the Princess of Wales in 1997, the Queen Mother in 2002 and the Duke of Edinburgh in 2021. \nA godfather to Viscount Severn, the son of Prince Edward, Major General Bruce also serves in HM Household as Fitzalan Pursuivant since 1998.\n\n", "link_mentions": [{"page": "June 25", "response": ["*1960 – Alastair Bruce of Crionaich, English-Scottish journalist and author"]}, {"page": "Royal Company of Archers", "response": ["* Maj-Gen. Alastair Bruce of Crionaich, OBE, DL (1960–), Governor of Edinburgh Castle"]}, {"page": "Lairg", "response": ["* Alastair Bruce of Crionaich K.stJ OBE VR (born 1960),  Fitzalan Pursuivant Extraordinary and historical advisor to film and television productions including Downton Abbey, as well as the current Governor of Edinburgh Castle (appointed July 2019)."]}, {"page": "Fitzalan Pursuivant Extraordinary", "response": ["|Alastair Bruce of Crionaich"]}, {"page": "Alastair Bruce, 5th Baron Aberdare", "response": ["thumb|left|Coats of arms of Alastair Bruce"]}, {"page": "List of governors of Edinburgh Castle", "response": ["* June 2019–present: Major-General Alastair Bruce of Crionaich"]}, {"page": "Sky News presenters and editorial team", "response": ["|Alastair Bruce"]}, {"page": "Personality and image of Elizabeth II", "response": ["The Queen has never done a press interview. In 2018, she engaged in small talk with Alastair Bruce of Crionaich for the television documentary The Coronation. In 2006, the Queen had been filmed having a conversation with the later-disgraced Australian artist and media personality Rolf Harris while he painted her portrait. It ventured little beyond talk of previous portraits of the Queen and royal art history in general, and the Queen's responses to Harris's overtures were notably crisp and monosyllabic. She had a more jovial on-camera exchange with the painter Andrew Festing while sitting for a portrait in the 1992 BBC documentary Elizabeth R, directed by Edward Mirzoeff on the 40th anniversary of her accession."]}, {"page": "The Young Victoria", "response": ["As screenwriter, Fellowes sought to make the film as historically accurate as possible. With this in mind, Oscar-winning costume designer Sandy Powell and historical consultant Alastair Bruce were hired, and filming for The Young Victoria took place at various historical landmarks in England to further the film's authenticity. Despite this, some aspects of the film have been criticised for their historical inaccuracies.", "Academy Award-winning costume designer Sandy Powell heard about the script and contacted King, who in turn hired her. Powell was given access to Victoria's wedding dress and coronation robes while researching. Based upon his work on The Lives of Others and his German nationality, Hagen Bogdanski was selected as the director of photography. Fellowes enlisted his friend Alastair Bruce's help with the coronation ceremony's historical authenticity, which led to Bruce's employment as the film's historical consultant, his first film credit."]}, {"page": "James, Viscount Severn", "response": ["He was baptised on 19 April 2008, in the Private Chapel of Windsor Castle by David Conner, the Dean of Windsor and his godparents were Alastair Bruce of Crionaich, Duncan Bullivant, Thomas Hill, Denise Poulton and Jeanye Irwin. He wore a newly made replica of the royal christening gown originally used by Victoria, the eldest child of Queen Victoria, in 1840. It has been worn for most royal christenings since then, and the original gown has now been preserved."]}, {"page": "Royal Households of the United Kingdom", "response": ["* 2008–Present: Major General Alastair Bruce of Crionaich "]}]}}