{"wiki_id": "http://www.wikidata.org/entity/Q16187309", "itemLabel": "Victoria Sharp", "itemDescription": "British judge", "wikipedia_url": "https://en.wikipedia.org/wiki/Victoria_Sharp", "wikipedia_page": {"main": "Dame Victoria Madeleine Sharp,  (born 8 February 1956) is the President of the Queen's Bench Division of the High Court of Justice in England and Wales.", "link_mentions": [{"page": "Order of precedence in England and Wales", "response": ["| colspan=2|The Rt. Hon. Dame Victoria Sharp"]}, {"page": "List of judges of the Court of Appeal of England and Wales", "response": ["| 3President of the Queen's Bench Division ||Dame Victoria Sharp|| align=\"center\" |University of Bristol || align=\"center\" | 8 February 2026 || align=\"center\" | 23 June 2019 || Court of Appeal (1 October 2013)Queen's Bench (13 January 2009)"]}, {"page": "List of current members of the British Privy Council", "response": ["| Dame Victoria Sharp"]}, {"page": "Elsevier", "response": ["There was speculation that the editor-in-chief of Elsevier journal Chaos, Solitons & Fractals, Mohamed El Naschie, misused his power to publish his own work without appropriate peer review. The journal had published 322 papers with El Naschie as author since 1993. The last issue of December 2008 featured five of his papers.Chaos, Solitons & Fractals 38(5), pp. 1229–1534 (December 2008) The controversy was covered extensively in blogs. The publisher announced in January 2009 that El Naschie had retired as editor-in-chief.  the co-Editors-in-Chief of the journal were Maurice Courbage and Paolo Grigolini. In June 2011, El Naschie sued the journal Nature for libel, claiming that his reputation had been damaged by their November 2008 article about his retirement, which included statements that Nature had been unable to verify his claimed affiliations with certain international institutions. The suit came to trial in November 2011 and was dismissed in July 2012, with the judge ruling that the article was \"substantially true\", contained \"honest comment\", and was \"the product of responsible journalism\". The judgement noted that El Naschie, who represented himself in court, had failed to provide any documentary evidence that his papers had been peer-reviewed.\"Nature libel verdict 'a victory for free speech'\",The Guardian 6 July 2012 Judge Victoria Sharp also found \"reasonable and serious grounds\" for suspecting that El Naschie used a range of false names to defend his editorial practice in communications with Nature, and described this behavior as \"curious\" and \"bizarre\"."]}, {"page": "List of Privy Counsellors (1952–present)", "response": ["* Hon. Dame Victoria Sharp (b. 1956)"]}, {"page": "President of the Queen's Bench Division", "response": ["The President of the Queen's Bench Division is the head of the Queen's Bench Division of the High Court of Justice. The current president is Dame Victoria Sharp.", "*23 June 2019: Dame Victoria Sharp", "* 1 January 2016 Dame Victoria Sharp"]}, {"page": "List of Dames Commander of the Order of the British Empire", "response": ["*2009: Jenny Abramsky, Sally Davies, Elizabeth Fradd, The Baroness Gould of Brookwood, Barbara Hakin, Wendy Hall, Anne Owers, Linda Partridge, Philippa Russell, Rosalind Savill, Victoria Sharp, Joan Stringer, Mitsuko Uchida"]}, {"page": "Mohamed El Naschie", "response": ["Judge Victoria Sharp also found \"reasonable and serious grounds\" for suspecting that El Naschie used a range of false names to defend his editorial practice in communications with Nature, and described this behavior as \"curious\" and \"bizarre\"."]}, {"page": "Eric Sharp, Baron Sharp of Grimsdyke", "response": ["He married Marion Freedman in 1950 and had with her one son Richard Sharp,  and two daughters Nicola, who died in 1982, and Victoria Sharp, who is the President of the Queen’s Bench Division of the High Court in England and Wales."]}, {"page": "List of University of Bristol people", "response": ["*Victoria Sharp, English Lady Justice of Appeal and Vice-President of the Queen's Bench Division"]}, {"page": "Justice Sharp", "response": ["*Victoria Sharp (born 1956), Justice of the Court of Appeal of England and Wales"]}, {"page": "Same-sex marriage in the Cayman Islands", "response": ["In January 2020, lawyers for couple Chantelle Day and Vickie Bodden announced they had begun the process of appealing the Court of Appeal's ruling to the Privy Council. The Privy Council, with five members, Lord Reed, Lord Hodge, Lady Arden, Lord Sales and Dame Victoria Sharp, heard oral arguments in the case on 23 and 24 February 2021."]}, {"page": "R (Miller) v The Prime Minister and Cherry v Advocate General for Scotland", "response": ["| Dame Victoria Sharp (PQBD)"]}, {"page": "Richard Sharp (BBC chairman)", "response": ["Richard Sharp was born on 8 February 1956, in London. He is the son of Eric Sharp, Baron Sharp of Grimsdyke, who was chairman of Cable & Wireless plc from 1980 to 1990. His twin sister, Dame Victoria Sharp, is president of the Queen's Bench Division of the High Court in England and Wales."]}, {"page": "Sharp, Victoria", "response": ["#redirectVictoria Sharp"]}, {"page": "Dame Victoria Sharp", "response": ["#REDIRECTVictoria Sharp"]}]}}