{"wiki_id": "http://www.wikidata.org/entity/Q16106518", "itemLabel": "Ian Young", "itemDescription": "Scottish footballer (1943-2019)", "wikipedia_url": "https://en.wikipedia.org/wiki/Ian_Young_(footballer)", "wikipedia_page": {"main": "John Muir \"Ian\" Young (21 May 1943 – 11 December 2019) was a Scottish footballer who played for Celtic and St Mirren.", "link_mentions": [{"page": "Tommy Gemmell", "response": ["In his book, Lion Heart, Gemmell revealed that, during his time at Celtic, he was on the receiving end of sectarian abuse from certain teammates; he and teammate Ian Young had been the target of \"a handful\" of colleagues who had wanted an all-Catholic team. He also stated that he received verbal abuse on several occasions from some supporters of Old Firm rivals Rangers due to his perceived status as a 'turncoat' (as a Protestant who played for Celtic), such as when attending matches many years after retiring."]}, {"page": "Jim Craig (Scottish footballer)", "response": ["Craig's abilities and style of play matched manager Jock Stein's tactical philosophy and he soon displaced Willie O'Neill and Ian Young as Celtic's regular right back. Stein encouraged his fullbacks to overlap the side's midfield to provide additional support to the forwards, in the style of the modern wing-back role, and in Craig and left back Tommy Gemmell he found willing protagonists."]}, {"page": "1965–66 Scottish Cup", "response": ["|RB |||| Ian Young"]}, {"page": "1964–65 Scottish Cup", "response": ["|RB |||| Ian Young "]}, {"page": "Celtic F.C. in European football", "response": ["Season 1964–65 saw Celtic back in the Inter-Cities Fairs cup. First round opponents were Portuguese side Leixões S.C.. The first leg away in Portual was ill-tempered and marred by eccentric referring decisions in a 1–1 draw. Stevie Chalmers and Ian Young were both controversially sent off; Chalmers for a minor collision with the Leixões goalkeeper as they both jumped for the ball, Young for a minor scuffle with an opponent (who was also sent off). Celtic won the return match in Glasgow 3–0 to progress, although the game was again bad tempered. In the next round Celtic faced Barcelona. The Spaniards won 2–0 at the Nou Camp and held Celtic to a goalless draw at Parkhead in a series of ties where they clearly outclassed their opponents."]}, {"page": "1964 Scottish League Cup Final", "response": ["|FB ||||Ian Young"]}, {"page": "1965 Scottish League Cup Final", "response": ["|FB ||||Ian Young"]}, {"page": "Ian Young", "response": ["Ian Young may refer to:", "* Ian Young (academic) (born 1957), Australian academic", "* Ian Young (athlete) (1911–2003), Scottish athlete", "* Ian Young (basketball) (born 1981), Trinidadian basketball player", "* Ian Young (footballer) (1943–2019), Scottish footballer", "* Ian Young (marathoner), British marathon runner", "* Ian Young (writer) (born 1945), Canadian author and poet", "* Ian Young (cricketer), captain of Scottish under-19 team 2004"]}, {"page": "2019 in the United Kingdom", "response": ["**Ian Young, 76, Scottish footballer (Celtic, St Mirren)."]}, {"page": "Deaths in December 2019", "response": ["*Ian Young, 76, Scottish footballer (Celtic, St Mirren).Ian Young dead: Former Celtic defender dies aged 76 after illness"]}, {"page": "2019–20 in Scottish football", "response": ["*11 December: Ian Young, 76, Celtic and St Mirren defender."]}, {"page": "Nine in a row", "response": ["This squad nucleus won the 1965–66 Scottish Division One title and the 1965–66 Scottish League Cup with a win over Rangers, though they lost to the same opponents in the 1966 Scottish Cup Final after a replay and were narrowly eliminated from the Cup Winners' Cup at the semi-final stage. The battle for the league was a tight affair with Rangers, as it would also be for the next two seasons,Nine In A Row The First Time Round, David Potter, Celtic Fanzine, 18 April 2020 with Celtic's higher scoring rate prior to the last game of the season (105 goals to their rivals' 87, with five or more scored on 10 occasions including a 5–1 victory in the pivotal New Year Old Firm match) ensuring they would be champions on goal average in any case; they still won the last fixture away to Motherwell to claim a first title in 12 seasonsScotland - List of Champions, James M. Ross and Karel Stokkermans, RSSSF, 25 March 2021 and overcome the psychological blows of losing the cup final and the European semi-final in the preceding weeks.Celtic Win League Championship, The Glasgow Herald, 9 May 1966, scan via The Celtic Wiki Older hands like John Divers, and Jim Kennedy were allowed to move on,Jim Kennedy | Former Celtic and Scotland defender, Evening Times, 6 December 2003Former Celt Divers dies, Sky Sports, 23 September 2014 while Ian Young remained in the squad but played no active role in the following campaign.Ian Young dead: Former Celtic defender dies aged 76 after illness, Adam Hamdani, The Independent, 11 December 2019"]}]}}