{"wiki_id": "http://www.wikidata.org/entity/Q16107198", "itemLabel": "Steve Ashley", "itemDescription": "British singer-songwriter", "wikipedia_url": "https://en.wikipedia.org/wiki/Steve_Ashley", "wikipedia_page": {"main": "Steve Frank Ashley (born 9 March 1946) is an English singer-songwriter, recording artist, multi-instrumentalist, writer and graphic designer. Ashley is best known as a songwriter and first gained public recognition for his work with his debut solo album, Stroll On (Gull, 1974). Taking his inspiration from English traditional songs, Ashley has developed a songwriting style, which is contemporary in content while reflecting traditional influences in his melodies, poetry and vocal delivery.\n\n", "link_mentions": [{"page": "Dave Mattacks", "response": ["He replaced Martin Lamble, who had died on 12 May 1969 in a road accident on the M1 motorway, as the drummer for Fairport Convention. Mattacks left Fairport Convention in early 1972 to join The Albion Country Band. Meanwhile, he had also contributed to numerous studio recordings such as the Morris On project, Nick Drake's Bryter Layter, Steve Ashley's \"Stroll On\" sessions, Steeleye Span's debut album Hark! The Village Wait, John Martyn's Solid Air and Harvey Andrews' album Writer of Songs. He returned to Fairport Convention in order to help complete the 1973 album Rosie with a revamped line up of the band."]}, {"page": "Dave Pegg", "response": ["Although Fairport had disbanded they continued to play annual reunions at Cropredy, supplemented by New Year's gigs in minor locations and occasional larger European festivals. Because no record label was interested in putting out recordings of the Cropredy concerts, Pegg and his wife Christine established their own label, Woodworm Records. They released the final concert as the album Farewell, Farewell (1979) and subsequent recordings were issued as 'official bootlegs'. He had already established a small recording studio in his house and with the money from the end of the record deal with Vertigo, he was able to develop this and it was eventually moved to a nearby converted chapel. The result was that Pegg had his own recording facility and record label. Artists like Steve Ashley began to record albums there from 1979. The Peggs established a mailing list of fans of the band, keeping interest in Fairport alive and, particularly Christine, took over the organization of the Cropredy Festival, which grew in size every year to reach about 18,000 attendees by the mid-1980s.", "In 2007 a retrospective of Pegg's career was launched. A Box of Pegg's contained four CDs, summarizing his work with Fairport Convention, Crawdaddy, Richard Thompson, Mike Heron, Steve Ashley, Jethro Tull, The Ian Campbell Folk Group and others.", ";On Steve Ashley albums", "* Steve Ashley's Family Album (Woodworm, 1983)"]}, {"page": "Hollywood, Worcestershire", "response": ["*Steve Ashley, former motor racing champion (Class 4 Kart, Formula Ford, F3)."]}, {"page": "Woodworm Records", "response": ["Woodworm Records soon grew and released albums by Fairport and other artists such as Dave Swarbrick and Steve Ashley. During 2004 the Peggs were divorced, resulting in the sale of  studio. The record label was thus put on hold. Members of Fairport Convention decided to form the new label Matty Grooves Records  to continue the work of Woodworm Records."]}, {"page": "Chris Leslie (musician)", "response": ["Since then he has worked with Whippersnapper, the Albion Band, All About Eve, Simon Mayor and Ian Anderson (of Jethro Tull). In 1981 he contributed to a cassette tape produced by CND. It was called \"Demo Tape\" and had limited distribution. Also on the tape were songs by Fairport Convention. In 1983 he contributed to \"More Demo Tapes\", again a cassette for CND. He accompanied Steve Ashley on the song \"Down By the Embankment\" on the album \"All Through The Year\" (1991). This was a compilation of original tracks. He appeared on \"People on the Highway\" (Bert Jansch tribute album, 2000). There were other appearances on Steve Ashley albums (see discography).  In 2003, Chris played violin on several tracks from Mostly Autumn's album Passengers. In late 2007 he recorded violin and mandolin parts on Dan Crisp's debut album 'Far From Here'.", "===Appearances with Steve Ashley==="]}, {"page": "The Albion Band", "response": ["Hutchings was keen to make a permanent band from these musicians and the first attempt included Royston Wood, Steve Ashley and Sue Draheim in the line-up, but the group failed to gel and he recruited a second band, turning to Martin Carthy, John Kirkpatrick, Sue Harris, Roger Swallow and Simon Nicol. The band remained fragile and split in August 1973, but an album was released retrospectively under the title Battle of the Field, on Island Records in 1976.P. Humphries, Meet on the Ledge, Fairport Convention, the Classic Years, (Virgin, 2nd edn 1997), p. 126. Other material recorded by this line-up eventually appeared on the later BBC Sessions CD (1998).", "* Steve Ashley - harmonica, whistle, vocals (1972)", "*Steve Ashley - Stroll On (Gull Records, 1974) - performing on Lord Bateman "]}, {"page": "Anne Briggs", "response": ["Early in 1973 she recorded a third solo album Sing a Song for You with instrumental support from Ragged Robin, a folk-rock band led by Steve Ashley. She was pregnant at the time with her second child. She would eventually move to northern Scotland with her family. It was to be her final studio recording and remained unavailable until 1996, when it was released by Fledg'ling Records. By this time Briggs was living in the Hebrides."]}, {"page": "Tinderbox (disambiguation)", "response": ["* The Tinderbox, musical duo formed by Steve Ashley and Dave Menday"]}, {"page": "The Cocktail Cowboy Goes It Alone", "response": ["#\"The Journeymen\" (Steve Ashley) (4:06)"]}, {"page": "Simon Nicol", "response": ["Just about the time that Nicol left Fairport Convention, Hutchings had also quit Steeleye Span and began to work on the first incarnation of the Albion Country Band to provide backing for his then wife Shirley Collins. Nicol joined the long list of musicians, including former Fairport members Richard Thompson and Dave Mattacks, to contribute to No Roses (1971), often considered one of the most important British folk rock albums. In 1972 Simon Nicol was part of the by now reduced six-piece-line up of the Albion Country Band featuring vocalists Royston Wood and Steve Ashley, Sue Draheim on fiddle, Ashley Hutchings on bass guitar and Dave Mattacks on drums. This band played a session for BBC Radio 1 and contributed one lengthy song to Steve Ashley's debut album.", "Along with Dave Mattacks, Ashley Hutchings, singer Royston Wood, singer and multi-instrumentalist Steve Ashley and American fiddler Sue Draheim Nicol then teamed up with Richard Thompson and Linda Peters (later Linda Thompson) to form the trio Hokey Pokey in 1973. In 1974 this trio expanded into the band Sour Grapes that was assembled to tour in support of the Thompsons' I Want to See the Bright Lights Tonight album. Later that year Nicol played on and co-produced the Thompsons' Hokey Pokey album.Humphries, Patrick, Richard Thompson – The Biography, Schirmer, 1997. ", ";With Steve Ashley", "* Steve Ashley's Family Album (Woodworm, 1983)"]}, {"page": "Young Beichan", "response": ["* Steve Ashley on Stroll On (1974) (as \"Lord Bateman\")"]}, {"page": "Market Square Records", "response": ["Artists associated with these two labels include Neil Ardley, Steve Ashley, Kevin Ayers, Kuljit Bhamra, Michael Chapman, Rod Clements, Design, Donovan, Ollie Halsall, Jack The Lad, Bert Jansch, Sonja Kristina, Linda Lewis,  Lindisfarne, Eleanor McEvoy, New Jazz Orchestra, Nirvana, Howard Riley, Steve Tilston, Pierre Tubbs, Peter Ulrich and Norma Winstone."]}, {"page": "Chris Karan", "response": ["* Steve Ashley, Stroll On (Gull, 1974)"]}, {"page": "Mysterious Ways", "response": ["*Mysterious Ways, a 1990 album by Steve Ashley"]}, {"page": "The Guv'nor vol 1", "response": ["* Steve Ashley on 7"]}, {"page": "Henry Lowther (musician)", "response": ["* Steve Ashley, Stroll On (Line, 1989)"]}]}}