{"wiki_id": "http://www.wikidata.org/entity/Q16193622", "itemLabel": "Christopher Guy Harrison", "itemDescription": "British luxury furniture designer (1960-2020)", "wikipedia_url": "https://en.wikipedia.org/wiki/Christopher_Guy_Harrison", "wikipedia_page": {"main": "Christopher Guy Harrison (3 September 1960 – 19 August 2020) was a British luxury furniture designer. He was the founder and head designer of the international furnishings brand. Originally known for a wide range of decorative mirrors, the Christopher Guy brand grew into a collection of upholstery, chairs, dining tables, sofas, headboards, and office furniture. In 2017, Christopher Guy partnered with rug manufacturer Nourison to create a new line of luxury area rugs.  Christopher's signature design includes the patented Chris-X (pronounced kris-krôs) leg design.", "link_mentions": [{"page": "List of furniture designers", "response": ["* Christopher Guy Harrison (1960-2020)"]}, {"page": "World Market Center Las Vegas", "response": ["Part of Las Vegas Design Center’s ongoing programming includes the First Friday series, a monthly A&D event featuring top design and arts and cultural speakers from around the world. The Design Icon award is part of the Design Series and celebrates modern-day design legends and gives them a platform to share their stories and inspire others. The Winter 2010 Las Vegas Market Design Icon will be Christopher Guy Harrison. Previous Design Icon honorees include Juan Montoya, Vicente Wolf, Roger Thomas, Vladimir Kagan and Larry Laslo."]}, {"page": "Design Icon Award", "response": ["*2011 Christopher Guy Harrison,Christopher Guy Official Website  a British luxury furniture designer "]}, {"page": "Christopher Harrison (disambiguation)", "response": ["* Christopher Guy Harrison (1960–2020), British furniture designer"]}, {"page": "Birgit C. Muller", "response": ["Birgit C. Muller was born in Vienna, Austria and raised in Marbella, Spain. She resides in Beverly Hills, California and has worked in the film and television industry in the United States for Paramount, Sony, Disney and Universal Studios and others, with such noted directors as William Friedkin, David Lynch, Michael Bay, Francis Ford Coppola and Ridley Scott. She manufactures her own line of couture designer gowns, and is a philanthropist for various global humanitarian causes. Birgit Muller is a celebrity judge for the annual Christopher Guy Harrison BritWeek Design Award challenge. She is the brand ambassador for the British luxury furniture designer Christopher Guy Harrison. In addition; she is the Co-Executive Producer of Miss Liberty America, a reality show pageant promoting the Constitution, Liberty and the American Way."]}, {"page": "2020 in the United Kingdom", "response": ["*19 August – Christopher Guy Harrison, 59, furniture designer, lung cancer."]}, {"page": "Deaths in August 2020", "response": ["*Christopher Guy Harrison, 59, British furniture designer, lung cancer.Designer Christopher Guy Harrison passed away at the age of 59"]}]}}