{"wiki_id": "http://www.wikidata.org/entity/Q16105226", "itemLabel": "Reg Stratton", "itemDescription": "Footballer (1939-2018)", "wikipedia_url": "https://en.wikipedia.org/wiki/Reg_Stratton", "wikipedia_page": {"main": "Reginald Malcolm Stratton (10 July 1939 – 21 May 2018) was an English footballer who played as a forward in the Football League for Fulham and Colchester United and in the North American Soccer League for Vancouver Royals.", "link_mentions": [{"page": "1939 in association football", "response": ["* July 10: Reg Stratton, English footballer (died 2018)"]}, {"page": "List of Colchester United F.C. seasons", "response": ["|align=\"left\"| Reg Stratton", "|align=\"left\"| Reg Stratton", "|align=\"left\"| Reg Stratton"]}, {"page": "1968–69 Colchester United F.C. season", "response": ["|Reg Stratton"]}, {"page": "1967–68 Colchester United F.C. season", "response": ["Colchester's league and FA Cup form contrasted during the 1967–68 season. A trip to Torquay United in the first round of the Cup saw the U's earn a replay at home, where they won 2–1. Essex rivals Chelmsford City were beaten 2–0 in the second round, a joint–best result for the campaign for Colchester. Layer Road then played host to First Division West Bromwich Albion in front of a crowd just short of 16,000. With the score at 1–1, both goalscorer Reg Stratton and John Mansfield had goals ruled out for infringements late on as the tie went to a replay. The U's lost 4–0 at The Hawthorns to the eventual Cup winners.", "|Reg Stratton||FW||||Kingsley||||88||45|| Fulham||28 May 1965||Free transfer", "|align=\"left\"|Reg Stratton"]}, {"page": "1966–67 Colchester United F.C. season", "response": ["Neil Franklin spent £4,000 to sign Ken Hodgson from Bournemouth in the summer, and alongside Peter Bullock, the pair amassed 31 goals between them. Meanwhile, Reg Stratton scored 24 league goals as Colchester ended their first season back in the Third Division with a mid-table 13th position finish.", "|Reg Stratton||FW||||Kingsley||||39||21|| Fulham||28 May 1965||Free transfer", "|align=\"left\"|Reg Stratton"]}, {"page": "1965–66 Colchester United F.C. season", "response": ["Neil Franklin brought in forward Reg Stratton to lead the line for the new season and he responded with 18 league goals and 21 in total. They won ten times on their travels, setting a new club record, while losing just three times at Layer Road. After leading the Fourth Division table across Easter, subsequent defeats to promotion rivals Darlington on two occasions and Torquay United saw Colchester drop to fourth position ahead of the final game of the season. A 2–1 defeat to Newport County left fans awaiting the result of Luton Town's game with Chester with Luton just one point behind and the game kicking off 15-minutes later than the U's fixture. The game finished 1–1 with Colchester, Luton, and Tranmere Rovers all tied on 56 points. Goal average would separate the sides, with Franklin's side pipping Tranmere to the final promotion spot by 0.08.", "|Reg Stratton||FW||||Kingsley||||0||0|| Fulham||28 May 1965||Free transfer", "|Reg Stratton", "|align=\"left\"|Reg Stratton", "|Reg Stratton"]}, {"page": "David Buck (footballer)", "response": ["Born in Colchester, Buck joined hometown club Colchester United as an apprentice. He made just one appearance for Colchester, coming on as a substitute for Reg Stratton in a 2–0 victory over Hartlepool United on 16 October 1965."]}, {"page": "David Laitt (footballer)", "response": ["Born in Colchester, Laitt joined hometown club Colchester United as an apprentice from local amateur team Colchester Casuals. He made one appearance for the U's in the Football League during a 0–0 Fourth Division home draw with Southport on 30 October 1965. He came on as a 40th-minute substitute for Reg Stratton. He failed to make any further appearances for the first-team, signing for Crittall Athletic following his release from the club."]}, {"page": "Deaths in May 2018", "response": ["*Reg Stratton, 78, English footballer (Fulham, Colchester United).Reg Stratton: 1939-2018"]}]}}