{"wiki_id": "http://www.wikidata.org/entity/Q16106970", "itemLabel": "Brendan Hamill", "itemDescription": "Northern Irish writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Brendan_Hamill_(writer)", "wikipedia_page": {"main": "Brendan Hamill (born 1945, Belfast, Northern Ireland) is a poet and writer.", "link_mentions": [{"page": "Ulster University", "response": ["Ulster has a large body of notable alumni, including MPs Kate Hoey, Gregory Campbell, Michelle Gildernew, Roberta Blackman-Woods and former deputy First Minister of Northern Ireland Mark Durkan, MLAs Alban Maginness, Basil McCrea and Seán Neeson, writers and authors including Anne Devlin, Dinah Jefferies, Colin Duriez, Calum Neill and Aodán Mac Póilin, poets including Gerald Dawe and Brendan Hamill, and artists including Jack Coulter, Colin Davidson, Oliver Jeffers, Freddie Freeburn, Victor Sloan, Andre Stitt, John Luke and John Kindness. Other alumni include composer Brian Irvine, musician David Lyttle, comedian Omid Djalili, former hostage and writer Brian Keenan, historian Simon Kitson, biomedical scientist and former Vice-Chancellor Gerry McKenna, visual artist Willie Doherty, photographer Mary Fitzpatrick, film producer Michael Riley, rugby player Brian Robinson, radio and television personality Gerry Anderson, nursing academic Alison Kitson, CEO of Cognizant Brian Humphries and senior police officer Barbara Gray."]}, {"page": "Brian Keenan (writer)", "response": ["Keenan was born into a working-class family in East Belfast, Northern Ireland, in 1950. He left Orangefield School early and began work as a heating engineer. However, he continued an interest in literature by attending night classes and in 1970 gained a place at the University of Ulster in Coleraine. Other writers there at that time included Gerald Dawe and Brendan Hamill. In the mid 1980s Keenan returned to the Magee College campus of the university for postgraduate study. Afterwards he accepted a teaching position at the American University of Beirut, where he worked for about four months."]}, {"page": "Falls Road, Belfast", "response": ["Brendan Hamill, another writer, who attended the school in the 1960s recalled later: While on teaching practice, Seamus Heaney came to St Thomas’ about October that year (1962). I remember him, his voice grave and resonant, his big, brown shoes, reading from Carrickfergus by Louis MacNeice. He was an enormously decent man with extraordinary antennae. Joe Graham, the writer and historian, was also a student at the school when McLaverty was the headteacher. For several years, after the school closed, this building was used by Belfast Metropolitan College for further education courses. After the new Springvale campus of the college was opened the building was demolished. Coláiste Feirste is an Irish language school situated in the Beechmount district."]}, {"page": "1945 in Northern Ireland", "response": ["* Brendan Hamill, poet and writer."]}, {"page": "List of Ulster University people", "response": ["*Brendan Hamill, poet and writer"]}, {"page": "Brendan Hamill", "response": ["Brendan Hamill may refer to:", "* Brendan Hamill (writer) (born 1945), Northern Ireland poet and writer", "* Brendan Hamill (soccer) (born 1992), Australian football (soccer) player"]}]}}