{"wiki_id": "http://www.wikidata.org/entity/Q16197589", "itemLabel": "Terry Christie", "itemDescription": "Scottish football player and manager", "wikipedia_url": "https://en.wikipedia.org/wiki/Terry_Christie", "wikipedia_page": {"main": "Terry Christie (born 1942/1943) is a Scottish former football player and manager.", "link_mentions": [{"page": "Livingston F.C.", "response": ["|align=left|Terry Christie¹"]}, {"page": "Alloa Athletic F.C.", "response": ["Following the departure of Tom Hendrie to St Mirren, Terry Christie took over at Alloa and led the club to the Scottish Challenge Cup in 1999 followed by promotion to the First Division a few months later. The team was relegated at the first attempt but bounced back up in 2001–02. Relegation followed once more, this time on goal difference.", "*  Terry Christie (1999–2003)"]}, {"page": "Neil Alexander", "response": ["Alexander started his career with local youth side Edina Hibs in Niddrie, Edinburgh and attracted interest from Arbroath, agreeing scholarship terms with the club. However, at the age of 18, Alexander was spotted by Stenhousemuir manager Terry Christie while playing for Edina. Christie had initially gone to watch the side play at a public park with his son after the team coach Bill Harper recommended one of the sides defenders to him but instead spotted Alexander and immediately signed him for Stenhousemuir, despite not knowing his name at the time. Christie later remarked \"You could see the talent he (Alexander) had in that one game. He was streets ahead of everyone else\". After establishing himself in the first-team for two seasons, he moved to Livingston in 1998, where he was part of Scottish Second Division and Scottish First Division title-winning sides during a three-year spell. During his time at the club, Alexander attracted attention from various British clubs including Everton and old firm duo Rangers and Celtic."]}, {"page": "Vic Kasule", "response": ["After him playing nine league games of the 1986-87 Scottish Second Division campaign Meadowbank Thistle transferred Darren Jackson to Newcastle United in October 1986.Darren Jackson, Sporting Heroes It was from Jackson's transfer fee that Terry Christie managing Meadowbank funded their £28,000 record signing of 21 year old Kasule.\"Terry Christie on his Meadowbank Thistle memories\" The Scotsman When playing for Meadowbank, Kasule was one of the first black players in the Scottish game - a fact that the Meadowbank supporters were proud of.Andrew Miller Oldies Songbook Rivals.net, 24 December 2000; Retrieved 6 January 2007  He was though regularly subjected to racist abuse. Kasule and Thistle won the 1986–87 Scottish Second Division earning  promotion for the next season to the middle of Scotland's then three tiers in senior football. Thistle finished runners-up in the 1987-88 Scottish First Division missing promotion to the top tier by one place. However Kasule had already left halfway through the season. In 15 months at Meadowbank he played in 35 league games in which he scored 7 goals."]}]}}