{"wiki_id": "http://www.wikidata.org/entity/Q16164894", "itemLabel": "Jane Collins", "itemDescription": "British politician (born 1962)", "wikipedia_url": "https://en.wikipedia.org/wiki/Jane_Collins", "wikipedia_page": {"main": "Jane Maria Collins (born 17 February 1962) is a British politician and horse show-jumper who served as a Member of the European Parliament (MEP) for Yorkshire and the Humber from 2014 to 2019. She was elected in May 2014 as a member of the UK Independence Party (UKIP), but defected to the Brexit Party in 2019 in the last months of her membership of the European Parliament.\nCollins served as UKIP's spokesperson on Employment law, Home Affairs and most recently on Animal Welfare.  \nOn 15 April 2019 she announced that she was leaving the party to join the Brexit Party.", "link_mentions": [{"page": "Pontefract", "response": ["* Jane Collins (1962–), politician, UKIP, Brexit Party MEP Yorkshire (2014–2019)"]}, {"page": "UK Independence Party", "response": ["In November 2018, Patrick O'Flynn resigned to join the 'rump' Social Democratic Party in protest over the party's move to the \"hard right\", and Louise Bours is now independent. Former leader Nigel Farage quit on 6 December 2018, as did Scottish MEP David Coburn. Another former leader Paul Nuttall quit the party the following day as did London Assembly Member Peter Whittle.Matthew Weaver, \"Ukip resignations plunge party into further turmoil \" , The Guardian, 7 December 2018. Retrieved 31 December 2018. It was reported that Tim Aker had also quietly quit the party earlier in 2018. Julia Reid announced her resignation from UKIP on 8 December 2018, with Jonathan Bullock following the next day. Jill Seymour, Jane Collins and Margot Parker left for the Brexit Party on 15 April 2019, with the first of those three citing the party's current direction and occupation of 'the extreme right of politics' and the second citing Batten's 'sick' defence of Carl Benjamin's rape comments."]}, {"page": "Kevin Barron", "response": ["In 2015, three Rotherham Labour MPs, Barron, Sarah Champion and John Healey, started a defamation legal action against UKIP MEP Jane Collins after Collins falsely alleged in a UKIP conference speech that the three MPs knew about child exploitation in Rotherham but did not intervene, and in February 2017 the MPs were awarded £54,000 each in damages."]}, {"page": "Nigel Farage", "response": ["In October 2016 Farage praised Trump for \"dominating\" Hillary Clinton, comparing him to a silverback gorilla. Following revelations of a 2005 audio recording in which Trump made lewd remarks about women, Farage said that Trump's comments were \"ugly\" but described them as \"alpha male boasting\" also stating that Trump was \"not running to be Pope\" and that women also make remarks they would not want to see reported. Farage's comments prompted several senior UKIP members to express concern privately, and resulted in public criticism of Farage from two UKIP MEPs, Jane Collins and William Dartmouth. As more publicity appeared about Trump's alleged groping and as the criticisms increased, Farage said he disagreed with Trump's comments about groping women and his comments on Muslim immigration."]}, {"page": "John Healey (politician)", "response": ["In 2015 three Rotherham Labour MPs, Kevin Barron, Sarah Champion and Healey, started a defamation legal action against UKIP MEP Jane Collins after Collins falsely alleged in a UKIP conference speech that the three MPs knew about child exploitation in Rotherham but did not intervene, and in February 2017 the MPs were awarded £54,000 each in damages."]}, {"page": "Gerard Batten", "response": ["In April 2019, Batten defended UKIP candidate Carl Benjamin's social media reply in 2016, \"I wouldn't even rape you\", to the MP Jess Phillips. Philips had written \"People talking about raping me isn't fun, but has become somewhat par for the course.\" Batten stated on BBC One's The Andrew Marr Show that Benjamin's reply was \"satire against the people he was saying it about.\" Three more MEPs left UKIP the following day, defecting to the Brexit Party. One of these, Jane Collins, said \"to hear Gerard Batten on national TV yesterday defending this man's use of rape as 'satire' made me sick to my stomach.\" A second, Jill Seymour, said: \"No one person should ever be bigger than a political party but sadly I believe that Mr Batten will be instrumental in its demise.\"- - - "]}, {"page": "Yorkshire and the Humber (European Parliament constituency)", "response": ["| colspan = 4| Jane Collins UKIP (2014-2019) Brexit Party (2019)"]}, {"page": "Collins (surname)", "response": ["*Jane Collins (born 1962), British Ukip Member of the European Parliament"]}, {"page": "United Kingdom by-election records", "response": ["|Jane Collins", "|Jane Collins"]}]}}