{"wiki_id": "http://www.wikidata.org/entity/Q16188953", "itemLabel": "Jon Craig", "itemDescription": "British journalist", "wikipedia_url": "https://en.wikipedia.org/wiki/Jon_Craig", "wikipedia_page": {"main": "Jon Craig (born 9 August 1957) is the Chief Political Correspondent of Sky News, the 24-hour television news service operated by Sky Television, part of British Sky Broadcasting. He has occupied this position since July 2006. He is a former Political Editor of two national newspapers, the Daily Express and the Sunday Express, and of BBC London, and was a lobby correspondent at Westminster for more than 30 years.", "link_mentions": [{"page": "Balham", "response": ["*Jon Craig, Jon Craig is the Chief Political Correspondent of Sky NewsJon Craig"]}, {"page": "King's School, Macclesfield", "response": ["* Jon Craig (born 1957), Chief Political Correspondent of Sky News "]}, {"page": "Michael Gove", "response": ["On 14 July 2016 Gove was sacked by Prime Minister Theresa May. According to Jon Craig of Sky News, Gove was told to \"go and learn about loyalty on the backbenches\" in a two-minute meeting with May."]}, {"page": "Tadcaster Grammar School", "response": ["*Jon Craig – political journalist"]}, {"page": "Sky News presenters and editorial team", "response": ["|Jon Craig"]}, {"page": "John Craig", "response": ["*Jon Craig (born 1957), Chief Political Correspondent of Sky News", "*Jon Craig (architect) (c. 1941–2015), New Zealand architect"]}, {"page": "Wetherby High School", "response": ["* Jon Craig – political journalist"]}, {"page": "The Lobby", "response": ["* Jon Craig"]}, {"page": "List of University of Southampton people", "response": ["* Jon Craig, Chief Political Correspondent for Sky News"]}, {"page": "November 2021 British shadow cabinet reshuffle", "response": ["Yvette Cooper's appointment as Shadow Home Secretary was one of the most significant changes announced by Starmer, as it returned her to the role she had previously occupied in 2015 as a member of the Miliband shadow cabinet. The move was seen as a shift towards the right and a further departure from the Corbyn era. Jon Craig of Sky News described Cooper as \"Labour's lost leader\" and speculated that her comeback would increase her odds of one day succeeding Starmer."]}]}}