{"wiki_id": "http://www.wikidata.org/entity/Q16191279", "itemLabel": "Lisa Singh", "itemDescription": "Australian politician (born 1972)", "wikipedia_url": "https://en.wikipedia.org/wiki/Lisa_Singh", "wikipedia_page": {"main": "Lisa Maria Singh (born 20 February 1972) is a former Australian politician. She was a Senator for Tasmania from 2011 to 2019. She had previously been a member of the Tasmanian House of Assembly, representing the division of Denison from 2006 to 2010. The granddaughter of an Indo-Fijian member of the Parliament of Fiji, Singh was Australia's first female federal parliamentarian of Indian origin.After leaving politics she worked as Head of Government Advocacy for Walk Free, an international human rights organization and initiative of the Minderoo Foundation. She is currently the Director and CEO of the Australia India Institute, the University of Melbourne’s centre dedicated to promoting support for and understanding of the bilateral relationship. She is also the Deputy Chair of the Australia India Council. She sits on the advisory councils of Asialink and the Australian Human Rights Institute.", "link_mentions": [{"page": "Women in the Australian Senate", "response": ["|Lisa Singh", "  from:2011 till:2019 color:AL text:\"Lisa Singh (2011–2019)\""]}, {"page": "Asian Australians", "response": ["* Lisa Singh, senator (Tas)"]}, {"page": "Division of Denison (state)", "response": ["| rowspan=\"2\"|Lisa Singh"]}, {"page": "List of Macquarie University people", "response": ["*Lisa Singh, Australian politician, Senator representing Tasmania"]}, {"page": "Raman Pratap Singh", "response": ["His father, Ram Jati Singh, was a member of the Legislative Council, elected on the National Federation Party (NFP) ticket. Lisa Singh, the Australian Labor Party Senator for Tasmania, is his niece."]}, {"page": "Members of the Tasmanian House of Assembly, 2006–2010", "response": ["|| Hon Lisa Singh || Labor || Denison || 2006–2010"]}, {"page": "Graeme Sturges", "response": ["In May 2011, former Premier David Bartlett resigned from parliament, triggering a \"countback\" (or recount of 2010 votes) for Denison. Of Labor's unsuccessful candidates at that election, Lisa Singh had been elected to the Australian Senate, leaving Sturges and Madeleine Ogilvie as the eligible Labor candidates. The recount took place on 26 May, and Sturges was re-elected with 5,362 votes to Ogilvie's 4,197.Denison recount result , Tasmanian Electoral Commission, 26 May 2011."]}, {"page": "Ram Jati Singh", "response": ["He was the father of the Fijian politician Raman Pratap Singh, and the grandfather of Australian politician Lisa Singh."]}, {"page": "Indian Australians", "response": ["*Lisa Singh, ALP Senator representing Tasmania"]}, {"page": "List of foreign politicians of Indian origin", "response": ["* Lisa Singh – Labor Senator for Tasmania"]}, {"page": "Bill Aylett", "response": ["Aylett defied the ALP's official campaign material, issuing his own how-to-vote cards telling voters to rank him first. His campaign was successful, as he out-polled both O'Byrne and Murray by significant margins. This resulted in Murray failing to win a seat, and he subsequently wrote privately to Fred Daly that Aylett had won re-election \"by treachery, fraud and wilful deception\". In June 1953, he was censured by the ALP state executive for his actions. The following month, the federal executive also debated a resolution of censure, moved by the New South Wales delegation, but decided to refer the case back to the state executive. Until the election of Lisa Singh in 2016, Aylett was the only person to have been elected to the Senate ahead of a higher-ranked candidate on the same ticket."]}, {"page": "Indo-Fijians", "response": ["* Lisa Singh, Australian Senator"]}, {"page": "Candidates of the 2006 Tasmanian state election", "response": ["Lisa Singh*"]}, {"page": "List of Q+A panelists", "response": ["| Lisa Singh", "| Lisa Singh", "|Lisa Singh", "| Lisa Singh", "| Lisa Singh", "| Lisa Singh"]}, {"page": "Candidates of the 2010 Tasmanian state election", "response": ["Lisa Singh"]}, {"page": "Women in the Tasmanian House of Assembly", "response": ["|Lisa Singh", "  from:2006 till:2010 color:AL text:\"Lisa Singh (2006–2010)\""]}, {"page": "Scott Bacon", "response": ["Bacon was elected at the 2010 Tasmanian state election, securing 10.3% of first preferences. The Labor ticket for Denison included three sitting Labor MPs (including the Premier, David Bartlett) but only Bartlett and Bacon were elected, with two sitting members Lisa Singh and Graeme Sturges losing their seats."]}, {"page": "Bartlett Ministry", "response": ["|| Lisa Singh, MP(from 27 November 2008)"]}, {"page": "Candidates of the 2010 Australian federal election", "response": ["#Lisa Singh*"]}, {"page": "Results of the 2010 Australian federal election (Senate)", "response": ["| Lisa Singh"]}, {"page": "Fijian Australians", "response": ["* Lisa Singh"]}, {"page": "Australian Flag Society", "response": ["In 2008 the AFS lobbied members of the Tasmanian parliament for a public inquiry to be held in response to a motion proposed by Denison Labor MHA Lisa Singh to have the Australian Aboriginal Flag stand in Parliament House, Hobart. The AFS is also opposed to \"aboriginal treaties, separate elected and constitutional representation.\"https://www.facebook.com/pg/Australian.Flag.Society/about"]}, {"page": "2012 Australian Labor Party leadership spill", "response": ["* Lisa Singh, Senator for Tasmania"]}, {"page": "Candidates of the 2013 Australian federal election", "response": ["Six Senate places were up for election. The Labor Party was defending three seats. The Liberal Party was defending two seats. The Australian Greens were defending one seat. Senators Eric Abetz (Liberal), Christine Milne (Greens), Stephen Parry (Liberal), Helen Polley (Labor), Lisa Singh (Labor) and Anne Urquhart (Labor) were not up for re-election."]}, {"page": "2010 Tasmanian Legislative Council periodic election", "response": ["The Hobart seat had been held by Terry Martin since 2004. Martin was facing court on charges of child sex offences, and was not recontesting the election. A frontrunner emerged in Adriana Taylor, Glenorchy Mayor and Labor Party member, although in common with the prevalence of independents in the Legislative Council, Taylor did not seek party endorsement. There were suggestions that Lisa Singh, defeated Labor MHA and former government minister, or Andrew Wilkie might run, but these came to nothing. The Labor Party did endorse a candidate, Health and Community Services Union official Tim Jacobson. The Tasmanian Greens endorsed Housing Tasmania policy officer Kartika Franks, who ran on the Greens' ticket in Denison at the 2010 state election."]}, {"page": "Shadow Ministry of Bill Shorten", "response": ["| Senator Lisa Singh"]}, {"page": "Results of the 2013 Australian federal election (Senate)", "response": ["| Lisa Singh"]}, {"page": "Candidates of the 2016 Australian federal election", "response": ["#Lisa Singh*"]}, {"page": "List of people with surname Singh", "response": ["*Lisa Singh (born 1972), Australian politician"]}, {"page": "Results of the 2016 Australian federal election (Senate)", "response": ["| Lisa Singh"]}]}}