{"wiki_id": "http://www.wikidata.org/entity/Q16196141", "itemLabel": "Philip Lymbery", "itemDescription": "Animal welfare advocate", "wikipedia_url": "https://en.wikipedia.org/wiki/Philip_Lymbery", "wikipedia_page": {"main": "Philip John Lymbery (born 23 September 1965) is the Global CEO of farm animal welfare charity, Compassion in World Farming International, Visiting Professor at the University of Winchester’s Centre for Animal Welfare, President of Eurogroup for Animals, Brussels, and founding Board member of the World Federation for Animals.Lymbery is an author, ornithologist, photographer, naturalist, and animal advocate. He regularly speaks at international events and commentates in the media about the global effects of industrial agriculture (factory farming), including its impact on animal welfare, wildlife, soil and natural resources, biodiversity and climate change, as well as the need for more balanced, regenerative agriculture and sustainable food systems. In March 2021, he was appointed as a United Nations (UN) Food Systems Champion for the 2021 UN Food Systems Summit.", "link_mentions": [{"page": "Compassion in World Farming", "response": ["Peter Roberts, a Hampshire dairy farmer, founded Compassion in World Farming (CIWF) in 1967.  After he realized there was public support, Roberts unsuccessfully appealed to contemporary animal welfare groups to campaign against factory farming.  Undeterred, Roberts began his own campaign.  Roberts retired in 1991.  He was replaced as Chief Executive by Joyce D'Silva, who served until 2005 and now serves as ambassador.  Philip Lymbery, co-author of Farmageddon, is the current Chief Executive.  CIWF has offices in the UK, Italy, Netherlands, France, Poland, the United States, Brussels and China.  Representatives are located in Czech Republic, Spain, Germany, South Africa, and Sweden.  CIWF was responsible for the veal crate ban in the UK, as well as bans on narrow stalls and chains on pregnant sows.  The European Union recognised animals as sentient beings as a result of their petition."]}, {"page": "2009 swine flu pandemic actions concerning pigs", "response": ["On June 5, the UK-based Compassion in World Farming organization warned Egypt that its brutal measures and its mass slaughter of pigs could negatively affect Egypt's tourism industry. Philip Lymbery the chief executive of the group was quoted saying that \"Britons and people from around the world have joined the international storm of protest against this atrocity in Egypt, with many saying they'll no longer consider Egypt as a possible holiday destination,\""]}]}}