{"wiki_id": "http://www.wikidata.org/entity/Q16186598", "itemLabel": "Phill Brown", "itemDescription": "British audio engineer", "wikipedia_url": "https://en.wikipedia.org/wiki/Phill_Brown", "wikipedia_page": {"main": "Phill Brown (born 1950) is an audio engineer who has worked with a number of well-known musicians, including: Traffic, Led Zeppelin, David Bowie, Cat Stevens, Bob Marley and Talk Talk. He is also the younger brother of Terry Brown.Brown's autobiography, Are We Still Rolling?, published in 2011, covers 40 years of the British music industry.", "link_mentions": [{"page": "Captain Lockheed and the Starfighters", "response": ["* Technicians: Phill Brown, Frank Owen, Rufus Cartwright, Anton Matthews, Phil Chapman"]}, {"page": "Trapeze (1975 album)", "response": ["*Phill Brown – engineering"]}, {"page": "Turin Brakes", "response": ["On 6 September 2012, all four Turin Brakes members played at a \"Spirit of Talk Talk\" evening at 229 Great Portland Street where they joined some former members of Talk Talk to play a few hits including It's My Life, with the band then playing a set of their own afterwards.  Before playing the song \"Painkiller\" Gale announced to the audience that although it wouldn't be obvious to most people the song was heavily influenced by Talk Talk and by the work they did with producer Phill Brown in the Kent countryside some years ago."]}, {"page": "Spirit of Eden", "response": ["The sessions took place in a blacked-out studio, with an oil projector and strobe lighting. Engineer Phill Brown said that the album, along with its successor, was \"recorded by chance, accident, and hours of trying every possible overdub idea.\" According to Brown, \"twelve hours a day in the dark listening to the same six songs for eight months became pretty intense. There was very little communication with musicians who came in to play. They were led to a studio in darkness and a track would be played down the headphones.\"", "Spirit of Eden was released worldwide in 1988. It did not enjoy nearly as much commercial success as The Colour of Spring. The album spent five weeks on the UK Albums Chart, peaking at #19. The album cover depicts a tree festooned with seashells, snails, birds, and insects. It was illustrated by James Marsh, who did Talk Talk's artwork throughout their recording career. The booklet provides reproductions of Hollis' handwritten lyrics. The album was digitally remastered by Phill Brown and Denis Blackham in 1997.", "* Phill Brown – engineering, bowed guitar"]}, {"page": "Third World War (band)", "response": ["Third World War were an English rock & roll band formed in 1970 by manager and producer John Fenton together with songwriters Terry Stamp and Jim Avery. Fenton came up with the band's name and provided a large part of its musical direction; Phill Brown, the recording engineer on the band's first album, quotes him as saying, \"I want a no-bullshit, working class band—I've had enough of all this pseudo peace crap.\" Due to this attitude, the band's raucous sound and its revolutionary lyrics, they have been described as \"England's first punk band.\""]}, {"page": "Laughing Stock", "response": ["Like Spirit of Eden the album featured improvised instrumentation from a large ensemble of musicians. The demanding sessions were marked by Hollis' perfectionist tendencies and desire to create a suitable recording atmosphere. Engineer Phill Brown stated that the album, like its predecessor, was \"recorded by chance, accident, and hours of trying every possible overdub idea.\" The band split up following its release, effectively making Laughing Stock their last official release.", "In 1986, Talk Talk, then a three-piece band consisting of leader and singer Mark Hollis alongside drummer Lee Harris and bassist Paul Webb, released their third album The Colour of Spring, which saw the band shift from their earlier, synthpop-oriented sound and featured a more organic art pop sound, where musicians improvised with their instruments for many hours, then Hollis and producer Tim Friese-Greene edited and arranged the performances to get the sound they wanted. A total of sixteen musicians appeared on the album. It became their most successful album, selling over two million copies and prompting a major world tour. Nonetheless, for their next album Spirit of Eden (1988), the band chose to work towards an even more unconventional and uncommercial direction. The album was compiled from a lengthy recording process at London's Wessex Studios between 1987 and 1988 where the band worked again with Friese-Greene and engineer Phill Brown. Often working in darkness, the band recorded many hours of improvised performances which were heavily edited and re-arranged into the final album.", "As the band's legal battle with EMI concerning their contract had freed them from the label, the band began searching for other record labels, and eventually, their manager Keith Aspden signed them to Verve Records, the jazz offshoot label of Polydor Records. Hollis was pleased that they signed Talk Talk because the Mothers of Invention were once on Verve. The band set to recording their new album soon after the contract was signed. Again hiring an array of guest musicians, producer/multi-instrumentalist Tim Friese-Greene and engineer Phill Brown, work began on Laughing Stock in 1990.", "With Verve Records guaranteeing full funding for Laughing Stock and offering not to interfere during recording, the band took full advantage of the scenario \"and locked themselves away for the duration of recording.\" As with the band's previous album, Laughing Stock was produced by Tim Friese-Greene and recorded at the North London recording studio Wessex Sound Studios with engineer Phill Brown, and around fifty guest musicians, although a total of only eighteen guest musicians feature on the final album. Working in an environment influenced by that of Traffic's recording sessions from 1967 that Brown worked on, Hollis' vision with Laughing Stock was to \"collect a group of like-minded musicians together\" in the studio where he could then record the \"perspective of instruments in physical distance rather than off the board,\" after which \"each player gets to improvise around a basic theme as he or she feels it.\" The process continued over a long period of time, and ultimately the album took a year to record, although its liner notes state it was recorded from September 1990 to April 1991. The record was \"only complete\" when Hollis felt each guest musician had \"expressed their character and refined their contribution to the purest, most truthful essence.\"", "After engineering Laughing Stock, Phill Brown said \"there was divorce, breakdown. It was intense. I have never worked on more focussed sessions though. And no – I wouldn't work in the dark again. It was difficult getting back to 'normal' sessions.\" However, compared to prior Talk Talk albums, he goes on to note that \"Laughing Stock is a different beast. I am very proud of the album, it's probably one of my best projects, but I find it dark and claustrophobic.\" Laughing Stock was the last release in the band's career, as Talk Talk silently disbanded in 1992, as Hollis wished to focus on his family. Paul Webb rejoined Lee Harris, and the two went on to form the band .O.rang, who recorded several albums in the 1990s, while Tim Friese-Greene started recording under the name Heligoland. Mark Hollis effectively left the music industry, but in 1998 released his unexpected self-titled solo début Mark Hollis, which was much in keeping with the post-rock sound of Spirit of Eden and Laughing Stock, finding inspiration not in the popular music of the day, but rather in 20th-century classical music and jazz from the late fifties and sixties,Music Minded interview Music Minded interview Archived but he officially retired from the music industry shortly afterwards.", "*Phill Brown – engineer"]}, {"page": "Mr. Fantasy", "response": ["The album was recorded at Olympic Studios in London with American record producer Jimmy Miller and recording engineer Phill Brown. When Brown was asked his favourite memory of engineering, he responded: \"Recording Dear Mr Fantasy, one o'clock in the morning, November 1967.\"McGee, Alan (9 April 2008). Wherefore Art Thou Mark Hollis?, Guardian.co.uk."]}, {"page": "Mark Hollis (album)", "response": ["The album was recorded as part of a two-album contract with Polydor, along with Talk Talk's 1991 Laughing Stock. At one point, the record was to be entitled Mountains of the Moon and released under the Talk Talk name, but eventually it was decided it should be a self-titled solo project (early promotional CD-Rs and cassettes of the album contain the original details, with the CD-R retaining the attribution to Talk Talk). Engineer Phill Brown, who also recorded Laughing Stock, stated that, compared to the final Talk Talk album, which he considered \"one of [his] best projects\" but \"dark and claustrophobic\",cybercity.dk  he found the solo release \"the opposite…- open, restful and at times fantastically beautiful\".", "* Phill Brown – engineer"]}, {"page": "Manifesto (Roxy Music album)", "response": ["* Phill Brown – engineer"]}, {"page": "In Search of Eddie Riff", "response": ["Recorded and mixed and Island Studios in February 1974.  Engineer:  Phill Brown.  Assistant engineers: Dave Hutchins, Richard Elen, Brian Pickering."]}, {"page": "Don't Leave Home", "response": ["* Phill Brown – recording", "* Phill Brown – recording"]}, {"page": "The Walkabouts", "response": ["* Trail of Stars (1999 - Glitterhouse Records - produced by Phill Brown & the Walkabouts)", "* Ended Up a Stranger (2001 - Glitterhouse - produced by Larry Crane, Phill Brown & the Walkabouts)"]}, {"page": "One World (John Martyn album)", "response": ["One World was recorded during July–September 1977 at Blackwell's Woolwich Green Farm in Theale, Berkshire. According to Martyn, the location was chosen because Blackwell did not want to travel to and from London on a daily basis to record the album. The musician said of the farm: \"Vast grounds, lovely lake, a fine environment. It was my way of saying, it's not all rock'n'roll and mirrors\". While at the farm, Martyn and engineer Phill Brown resided in two converted stables. Although Martyn had said he brought his wife and children to the cottage, he also claimed that Beverley did not attend the sessions and felt she may have erroneously thought he was living a hedonistic lifestyle at the farm. Martyn trusted Blackwell, a personal friend of his, with choosing which songs he should record for the album, later explaining: \"he has what I call 'cross-over ears,' he'd as soon listen to Coltrane as anyone else. He knows what people will dig, right, which is something I've lost sight of. I don't honestly know what's strongest of my material.\"", "*Phill Brown, Frank Owen, Robert Ash - recording engineers"]}, {"page": "Jarvis (album)", "response": ["* Phill Brown – engineering "]}, {"page": "Richard James Burgess", "response": ["In 1978, Burgess founded a management company, Heisenberg Ltd, which managed producers and engineers such as Phill Brown, Andy Jackson, Adam Moseley, and Rafe McKenna in the UK and US. The company changed its name to Burgess World Co in the mid-eighties, and relocated to Maryland from Los Angeles and New York in the mid-nineties where it managed many mid-Atlantic based artists including Jimmie's Chicken Shack."]}, {"page": "Life for Rent (song)", "response": ["* Phill Brown – recording"]}, {"page": "Sand in My Shoes", "response": ["* Phill Brown – recording"]}, {"page": "Pressure Drop (album)", "response": ["* Phill Brown – engineering"]}, {"page": "Sneakin' Sally Through the Alley", "response": ["*Engineer: Phill Brown, Ken Laxton, Alan Varner, Rhett Davies"]}, {"page": "Double Fun", "response": ["*Engineers – Phill Brown (Tracks #1, 3, 5, 7 & 9), Arthur Stoppe (Tracks #1, 3, 5, 7 & 9) and Tom Moulton  (Tracks #2, 4, 6 & 8)."]}, {"page": "Some People Can Do What They Like", "response": ["#\"Off the Bone\" (Phill Brown, Robert Palmer, Steve Smith) – 2:18", "*Engineered & Mixed by Phill Brown at Clover Studios (Los Angeles, CA)."]}, {"page": "SAHB Stories", "response": ["* Phill Brown – engineer"]}, {"page": "Wildlife (Mott the Hoople album)", "response": ["The album was recorded in November and December 1970 at Island Studios in London. It was produced by Guy Stevens and Mott the Hoople. The engineers were Andy Johns, Brian Humphries, and Phill Brown. ", "* Andy Johns, Brian Humphries, Phill Brown – engineers"]}, {"page": "Nigel Lived", "response": ["In 2017 Intervention Records reissued Nigel Lived on 180-gram double 45RPM vinyl. The reissue was 100% analog mastered using the original master tapes provided to the label by the original sound engineer on the project, Phill Brown. The album quickly became Intervention’s best selling reissue ever and resulted in Murray Head’s decision to perform songs from the album live for the first time ever.", "*Phill Brown - chief engineer"]}, {"page": "Find the Crowd", "response": ["*Phill Brown - engineer, mixing"]}, {"page": "Go (Go album)", "response": ["*Phill Brown - Engineer"]}, {"page": "Flaunt the Imperfection", "response": ["The album was produced by Steely Dan co-founder Walter Becker, who is credited as an official member of China Crisis on the record sleeve. Becker apparently requested to meet with the band after hearing their song \"Papua\" from their 1983 album Working with Fire and Steel. He was subsequently signed on as producer to begin work on the album with the assistance of Phill Brown, sound engineer with the Rolling Stones and Jimi Hendrix."]}, {"page": "The Affectionate Punch", "response": ["* Cliff Lewis, David Baker, Gary Bidmead, Louis Austin, Nigel Mills, Paul Fisher, Phill Brown - re-recording and remixing engineers"]}, {"page": "Resolving Contradictions", "response": ["*Phill Brown - assistant producer, engineer"]}, {"page": "Philip Clemo", "response": ["In October 2008, Clemo released his fourth album The Rooms. A musical progression through different sound \"rooms\" or \"spaces\", it featured 22 musicians including: Clive Bell; Theo Travis (saxophone and flute); Simon Hopkins (electric guitar); B.J Cole (pedal steel); Henry Lowther (trumpet and flugelhorn); and a Prague string quartet. Clemo credited legendary sound engineer Phill Brown, who has worked with Jimi Hendrix and Bob Marley among others, for his invaluable contribution to the recording process of The Rooms. The album was critically acclaimed, and reviewed as floating somewhere between jazz, rock and soundtrack, with critics describing it as intelligent \"fourth world\" electro-jazz.", "Up to this point, one of Clemo's key instruments of choice to compose with was the guitar. But having become quite bored with what he was playing on it, he moved for his next album to the piano. For a year he created improvisations, charting a deeply personal journey through significant life experiences and environments. These were then given to pianist Kevin Pollard to interpret and expand, with Clemo then adding additional guitar pieces to shape the compositions. With the basic structure laid out, he then invited 14 additional musicians – one at a time – to \"blindly\" add their response on top, including: Oren Marshall (tuba); B. J. Cole (pedal steel guitar); Byron Wallen (trumpet and flugelhorn); Emily Burridge (cello); with Thomas Bloch (Radiohead, Damon Albarn) contributing ethereal tones on three instruments (glass harmonica, crystal baschet and ondes martenot). Clemo then heavily edited and shaped their contributions. The album was the first on which Clemo added his own voice, using multi-layering to create harmonies. He finally added additional recorded sounds from places which have great significance to him, including: the river and woods at the end of his childhood garden; his first school; Aberdeen railway station; Redwood National Park in northern California; and Plum Village Zen Buddhist monastery in France. As with The Rooms, most of the sessions were recorded by Phill Brown, who Clemo sees as crucial in both building powerful creative environments, and capturing a high level of sonic detail in the sessions. The end result, Mesmer, was well reviewed by both the music and mainstream press, described as a form of contemporary chamber music with \"improvisation, multi-level musical dialogue and sound design at its core.\"", "With contributions from 21 musicians including Arve Henriksen (trumpet), Evi Vine (voice), Byron Wallen (trumpet, flugelhorn), Oren Marshall (tuba), Thomas Bloch (glass harmonica, Ondes Martenot), Emily Burridge and Peter Gregson (cellos), Dream Maps was released on 9 September 2016 with a live launch with an 8-piece band including Arve Henriksen and Evi Vine at Kings Place, London, UK on 14 September. The concert was described by Richard Williams on thebluemoment.com as \"Artfully mixed together with recordings of heartbeats and water by the sound engineer Phill Brown, the music washed gently but insistently over the clearly beguiled near-capacity crowd in Kings Place’s Hall 2... this was Clemo’s first live gig in 10 years; its success should encourage him.\""]}, {"page": "Phill", "response": ["*Phill Brown (born 1950), British audio engineer"]}, {"page": "Russian Roulette (Hollies album)", "response": ["*Phill Brown, Rhett Davies – engineers"]}, {"page": "Missing Pieces (Talk Talk album)", "response": ["Missing Pieces is a 2001 compilation album by Talk Talk. The first six tracks are the A- and B-Sides of the three CD singles released in 1991 for their final album Laughing Stock. Four of these are versions of album tracks, with the addition of the otherwise uncollected B-Sides \"Stump\" and \"5:09\".  The final track, \"Piano\", was recorded pseudonymously by Mark Hollis (as \"John Cope\", the title of the B-Side of their 1988 single \"I Believe In You\" from the album Spirit of Eden) for the 1998 album \"AV 1\" by Allinson / Brown, which was produced by former Talk Talk producer Phill Brown.  According to Hollis, it was designed to cycle indefinitely for a Dave Allinson/Phill Brown art exhibition and is presented twice in a row on the CD.  Missing Pieces was released in 2001 to a generally mixed to positive reception.  It is now out of print.", "* Phill Brown – engineering (Tracks 1–6), production (Track 7)"]}, {"page": "Back to the Night", "response": ["*Engineers: Phill Brown, Phil Ault, Robin Black", "*Re-mix Engineer: Phill Brown"]}, {"page": "Trail of Stars", "response": ["* Phill Brown – loops, sounds", "* Phill Brown – production, mixing"]}, {"page": "Ferguslie Park (album)", "response": ["* Phill Brown – Engineer"]}, {"page": "Nightbird (Paul Carrack album)", "response": ["* Producers – Paul Carrack and Phill Brown (all tracks); Alan Callan (tracks 1, 6 & 7).", "* Engineer – Phill Brown"]}, {"page": "Mirmama", "response": ["* Phill Brown – mixing (track 8)"]}, {"page": "Shakin' Stevens (album)", "response": ["* Phill Brown – engineer"]}, {"page": "Between Two Churches", "response": ["* Phill Brown – mixing"]}]}}