{"wiki_id": "http://www.wikidata.org/entity/Q16150855", "itemLabel": "Tom Allin", "itemDescription": "cricketer (1987-2016)", "wikipedia_url": "https://en.wikipedia.org/wiki/Tom_Allin", "wikipedia_page": {"main": "Thomas William Allin (27 November 1987 – 4 January 2016) was an English cricketer who played for Warwickshire County Cricket Club.Tom Allin was a right-arm medium-fast pace bowler who also batted right-handed. He made his debut for the county in the 2011 Clydesdale Bank 40 against Surrey, and his first-class debut came against Middlesex in May 2013.Allin suffered serious injuries in a road accident in October 2015. He gradually recovered physically, but suffered from mood swings. He committed suicide on 4 January 2016 aged 28 in Bideford, North Devon, by jumping from the A39 River Torridge Bridge.", "link_mentions": [{"page": "Bideford", "response": ["Crime fiction author Hilary Bonner was born and raised in the town. Plymouth Argyle defender Gary Sawyer was born in Bideford. The actress Joanna Tope was born in Bideford, as was Warwickshire county cricketer Tom Allin and the cricketer Matthew Allin. The current Bishop of Norwich Graham James was born in the town. Golfer Jimmy Mullen is also from the town."]}, {"page": "Tony Allin", "response": ["After one outstanding season for Glamorgan in 1976 he decided professional cricket was not for him, and returned to the family dairy farm in Devon. He continued to play for Devon, playing 43 matches for them in the Minor Counties Cricket Championship. He is the father of the Warwickshire cricketer Tom Allin."]}, {"page": "List of Warwickshire County Cricket Club players", "response": ["* Tom Allin (2013) : T. W. Allin (1)"]}, {"page": "Hugh Owen (cricketer)", "response": ["His league and club debut was when he was brought into the first team, as goalkeeper, to replace the injured Jack Holland. The match was played at Trent Bridge, Nottingham and was against the eventual Football League Champions, known as 'The Invincibles\", Preston North End. Within the first ten minutes Hugh Owen had conceded two. The scorers were John Goodall and Jack Gordon. County came into the game after that and Tom Allin forced a fine save from Jimmy Trainer, the North End goalkeeper. In the second-half North End overwhelmed their opponents. Owen saved a shot from Gordon but was legally barged over the line by Goodall for his second. Jimmy Ross then scored a fourth for North End. Gordon scored his second goal and then, shortly after scoring, secured his hat-trick. Goodall, near the end, went on a mazy run to complete his hat-trick. Full-Time Score – Notts County 0–7 Preston North End."]}, {"page": "Warwickshire County Cricket Club in 2013", "response": ["! scope=\"row\" | Tom Allin "]}, {"page": "2016 in the United Kingdom", "response": ["**Tom Allin, 28, cricket player (Warwickshire)."]}, {"page": "Deaths in January 2016", "response": ["*Tom Allin, 28, English cricketer (Warwickshire), suicide by jumping.Bideford cricketer named as man who died from Torridge Bridge fall"]}]}}