{"wiki_id": "http://www.wikidata.org/entity/Q16153596", "itemLabel": "Sam Barlow", "itemDescription": "English rugby league footballer", "wikipedia_url": "https://en.wikipedia.org/wiki/Sam_Barlow_(rugby_league)", "wikipedia_page": {"main": "Sam Barlow (born 7 March 1989) is a Scotland international rugby league footballer who plays for the Bradford Bulls in the Championship.", "link_mentions": [{"page": "2009 Widnes Vikings season", "response": ["!width=30%|Sam Barlow"]}, {"page": "New Zealand at the 2013 Rugby League World Cup", "response": ["|IC ||17|| Sam Barlow"]}, {"page": "2010 European Cup", "response": ["|  Halifax || Sam Barlow", "SCOTLAND: 1 Lee Paterson, 2. Dave Arnot, 3. Joe Wardle, 4. Kevin Henderson, 5. Jon Steel, 6. Brendan Lindsay, 7. Danny Brough, 8. Oliver Wilkes, 9. Ben Fisher, 10, Mitch Stringer, 11. Alex Szostak, 12. Sam Barlow, 13. Dale Ferguson. Subs: 14. Andrew Henderson, 15. Paddy Coupar, 16. Neil Lowe, 17. Jack Howieson."]}, {"page": "2012 European Cup (rugby league)", "response": ["| align=\"center\" colspan=\"1\" | 11. Sam Barlow"]}, {"page": "2013 Rugby League World Cup Group C", "response": ["|IC ||14|| Sam Barlow"]}, {"page": "2013 Rugby League World Cup Group D", "response": ["|IC ||14|| Sam Barlow"]}, {"page": "2013 Rugby League World Cup knockout stage", "response": ["|IC ||17|| Sam Barlow"]}, {"page": "2013 Rugby League World Cup squads", "response": ["||Sam Barlow||2||0||SR|| Halifax"]}, {"page": "Sam Barlow", "response": ["Sam Barlow may refer to:", "* Sam Barlow (rugby league) (born 1985), rugby league player for Halifax R.L.F.C.", "* Sam Barlow (game designer), British video game director and writer", "* Sam Barlow (pioneer) (1795–1867), U.S. pioneer toll road builder", "** Sam Barlow High School, Gresham, Oregon, USA", "* Sam Barlow, fictional character from Home and Away, see List of Home and Away characters", "* Sam Barlow Williams (1921–2009), U.S. inventor"]}, {"page": "2014 European Cup", "response": ["||Sam Barlow||0||0||PR|| Leigh Centurions"]}, {"page": "2015 European Cup", "response": ["||Sam Barlow||0||0||PR|| Leigh Centurions"]}, {"page": "2008 Widnes Vikings season", "response": ["|6/5/08|| National League One|| Dewsbury Rams || A || W || 22-29 || Fletcher (2), Gannon, Barlow, Dodd || Dodd 4/5 || Beswick || 1,434 || Ian Hardman, Dean Gaskell, Jason Crookes, Lee Paterson, Gavin Dodd, Bob Beswick, John Duffy, Iain Morrison, Mark Smith, Jim Gannon, Danny Hill, Richard Fletcher, Tommy Gallagher || Shane Grady, Sam Barlow, Rob Draper, Ben Kavanagh ||", "|18/5/08|| National League One|| Sheffield Eagles || H || W || 30-22 || Paterson, Hill (2), Gaskell, Gannon || Dodd 5/6 || N/A || 3,891 || Ian Hardman, Dean Gaskell, Dayne Donoghue, Shane Grady, Gavin Dodd, Lee Paterson, John Duffy, Iain Morrison, Mark Smith, Jim Gannon, Danny Hill, Richard Fletcher, Bob Beswick || Adam Bowman, Sam Barlow, Rob Draper, Ben Kavanagh || ", "|3/8/08|| National League One|| Leigh Centurions || A || L || 33-24 || Gaskell, Fletcher, Tyrer, Matty Smith || Tyrer 4/5 || N/A || 3,089 || Ian Hardman, Dean Gaskell, Steve Tyrer, Chris Dean, Gavin Dodd, John Duffy, Matty Smith, Iain Morrison, Bob Beswick, Jim Gannon, Matt Strong, Paul Noone, Lee Paterson || Josh Simm, Richard Fletcher, Gareth Morton, Sam Barlow ||", "|10/8/08|| National League One|| Featherstone Rovers  || H || W || 30-20 || Beswick, Hardman, Paterson, Matty Smith, Barlow || Tyrer 5/5 || N/A || 3,924 || Ian Hardman, Dean Gaskell, Steve Tyrer, Gareth Morton, Gavin Dodd, John Duffy, Matty Smith, Iain Morrison, Bob Beswick, Jim Gannon, Matt Strong, Richard Fletcher, Lee Paterson || Mark Smith, Josh Simm, Dayne Donoghue, Sam Barlow ||", "|14/8/08|| National League One|| Sheffield Eagles  || A || W || 20-26 || Mark Smith, Gaskell, Tyrer, Dean || Tyrer 5/5 || N/A || 1,823 || Ian Hardman, Dean Gaskell, Steve Tyrer, Chris Dean, Gavin Dodd, John Duffy, Matty Smith, Iain Morrison, Mark Smith, Jim Gannon, Lee Paterson, Richard Fletcher, Bob Beswick || Tim Hartley, Sam Barlow, Gareth Morton, Michael Ostick ||", "|24/5/08|| 2008 Northern Rail Cup - Quarter Final|| Celtic Crusaders || A || L || 50-18 || Morrison, Gaskell, Roper || Dodd 3/4 || N/A || 1,750 || Ian Hardman, Dean Gaskell, Lee Paterson, Shane Grady, Gavin Dodd, Bob Beswick, John Duffy, Ben Kavanagh, Mark Smith, Jim Gannon, Danny Hill, Iain Morrison, Richard Fletcher || Steve Roper, Sam Barlow, Dayne Donoghue, Rob Draper ||", "|Sam Barlow || 7/3/88 || 6 || 2 || 0 || 0 || 8 "]}, {"page": "2020 Bradford Bulls season", "response": ["After a four year ban from the game it was announced that former Leigh Centurions prop forward Sam Barlow signed for the Bulls for the 2020 season. Following this news it was revealed that Hull Kingston Rovers had let young second-row forward Adam Rooks join the Bulls on a season long loan. A further signing was made to the Bulls roster as Racing Club Albi XIII prop Levy Nzoungou signed a one year deal. The Bulls rounded off the year with a 20–14 victory over Super League side Castleford Tigers.", "The start of 2020 saw experienced centre Rhys Evans join Super League side Leeds Rhinos on a season long loan deal. A young Bradford side traveled to Hunslet R.L.F.C. for the second pre-season friendly and lost a close match 18–26 with Murphy Smith, Harry Shackleton and Matthew Race all scoring for the Bulls. The Bulls announced the capture of former academy product Dan Waite-Pullan on a one year deal from the Leeds Rhinos. Bradford faced arch rivals Leeds in a pre-season friendly for Jamie Jones-Buchanan's testimonial. However former Leeds player Rob Burrow was diagnosed with Motor Neurone Disease (MND) so the match was also used to raise funds to combat MND. The Bulls lost 34–10 in front of a 19,700 sell out crowd at Headingley Stadium with Ross Oakes and Thomas Doyle scoring for the Bulls. Former Bulls players and legends such as Wayne Godwin, Matty Blythe, Rob Parker, Nathan McAvoy, Robbie Hunter-Paul and Stuart Fielden also featured in the final 10 minutes of the match in support of Rob Burrow. Super League side Hull F.C. revealed that they would partner up with the Bulls on dual registration for the 2020 season. The 2020 black away shirt was released and the 2020 squad numbers were also revealed for the Bulls with new signings Anthony England, Adam Rooks, Dan Waite-Pullan and Sam Barlow taking the 8, 11, 20 and 27 shirts respectively. Another pre-season defeat followed this with a 25–12 loss to Dewsbury Rams. The Bulls announced the signing of Hull F.C. winger Matty Dawson-Jones on a one year deal. In the final pre-season match the Bulls faced rivals York City Knights and came away with a hard-fought 6–4 win before the match was abandoned ten minutes before the final whistle.", "|27|| Sam Barlow ||B ||x ||x ||B ||x", "|27|| Sam Barlow ||12px ||12px ||12px ||12px ", "|27|| Sam Barlow ||12px ||12px ", "|Sam Barlow", "|align=center| Sam Barlow"]}, {"page": "2021 Bradford Bulls season", "response": ["|align=center| Sam Barlow"]}]}}