{"wiki_id": "http://www.wikidata.org/entity/Q16106166", "itemLabel": "Evan Armstrong", "itemDescription": "Scottish boxer", "wikipedia_url": "https://en.wikipedia.org/wiki/Evan_Armstrong", "wikipedia_page": {"main": "Evan Armstrong (15 February 1943 – 8 July 2017) was a Scottish professional bantam/feather/super featherweight boxer of the 1960s and 1970s, who won the British Boxing Board of Control (BBBofC) Scottish Area bantamweight title, BBBofC Scottish Area featherweight title, BBBofC British featherweight title, and Commonwealth featherweight title, and was a challenger for the BBBofC British bantamweight title against Alan Rudkin, and European Boxing Union (EBU) featherweight title against José Legrá, his professional fighting weight varied from 116+3⁄4 lb (53.0 kg; 8 st 4.8 lb), i.e. bantamweight to 127+1⁄2 lb (57.8 kg; 9 st 1.5 lb), i.e. super featherweight. Armstrong had Alzheimer's disease later in life and died at the age of 74 in 2017.\n\n", "link_mentions": [{"page": "Chucho Castillo", "response": ["|align=left| Evan Armstrong"]}, {"page": "Arnold Taylor", "response": ["|align=left| Evan Armstrong"]}, {"page": "Lonsdale Belt", "response": ["! scope=\"row\" |  Evan Armstrong"]}, {"page": "Scott Harrison (boxer)", "response": ["Harrison won his first professional bout on 7 October 1996, when he knocked out Eddie Sica in round 2 at Lewisham Theatre in London. In January 2000, in his eleventh fight, Harrison picked up the Commonwealth featherweight title by beating Patrick Mullings by unanimous decision. He became the first Scottish boxer to win the Commonwealth featherweight title since Evan Armstrong in 1974."]}, {"page": "Tarbolton", "response": ["*Another famous resident of Tarbolton was boxing legend Evan Armstrong, who was British Featherweight Champion from 17 September 1973 until 8 July 1974."]}, {"page": "David Kotei", "response": ["David Kotey turned professional under trainer Attuquaye Clottey. His first professional bout was on 5 February 1966 in Accra when he outpointed his opponent over six rounds. He became the national featherweight champion that year. Although he fought once in neighbouring Togo in 1967, all his subsequent fights through to 1971 were all in Ghana. In 1972 however, he fought as much as seven times in Australia, winning five and losing two. He won the African featherweight title on 2 February 1974 when he knocked out Tahar Ben Hassen in the first round of a scheduled 15 round fight in Tunis, Tunisia. Later on 7 December 1974, he also won the Commonwealth featherweight title with a technical knock out over Evan Armstrong, a British boxer in round 10 of a scheduled 15 rounds bout. This victory gave him an opportunity to go for the World Boxing Council version of the world title. On 20 September 1975, in The Forum, Inglewood, California, United States, he beat Rubén Olivares by split points decision after 15 rounds to become the first Ghanaian world boxing champion. He relinquished the African and Commonwealth titles following this victory. The Ghana government gave him an estate house at Teshie-Nungua, an Accra suburb in honour of this achievements in boxing. He however lost the title in his third defence on 6 November 1976 by unanimous points decision to Danny \"Little Red\" Lopez in a fierce fight in Accra, Ghana.He is married with three daughters. He also defeated Fuku Yama in Japan.", "|align=left| Evan Armstrong\t"]}, {"page": "Armstrong (surname)", "response": ["*Evan Armstrong, Scottish boxer of the 1960s and '70s"]}, {"page": "José Legrá", "response": ["|style=\"text-align:left;\"| Evan Armstrong", "|style=\"text-align:left;\"| Evan Armstrong"]}, {"page": "List of British featherweight boxing champions", "response": ["|align=left | Evan Armstrong", "|align=left | Evan Armstrong"]}, {"page": "List of Commonwealth Boxing Council champions", "response": ["|align=left |  Evan Armstrong"]}, {"page": "José Medel", "response": ["|align=left| Evan Armstrong"]}, {"page": "Alan Richardson (boxer)", "response": ["Managed by Trevor Callaghan, Alan Richardson's first professional boxing bout was a victory over Abu Arrow on Tuesday 30 November 1971, this was followed by fights including; victory over Bingo Crooks (Midlands (England) Area lightweight champion), defeat by, and victory over Billy Hardacre challenging for the British Boxing Board of Control Central (England) Area featherweight title, draw with Billy Waith (Welsh Area welterweight champion, and British welterweight challenger), defeat by Barry Harris challenging for the Central (England) Area featherweight title, defeat by Evan Armstrong challenging for the British featherweight, and British Commonwealth featherweight titles, defeat by Fernand Roelands (EBU European lightweight champion) at Bruges, Belgium, victory over John Mitchell (Scottish Area featherweight challenger), victory over Ray Ross (Northern Ireland Area lightweight challenger, Irish light welterweight challenger, and Northern Ireland Area light welterweight challenger), Gerry Duffy (Scottish Area featherweight champion), victory over Vernon Sollas (EBU European featherweight challenger) challenging for the British featherweight title, victory over Les Pickett (Welsh Area featherweight champion) defending the British featherweight title, defeat by Eddie Ndukwu challenging for the British Commonwealth featherweight title at Lagos National Stadium, Nigeria, defeat by Dave Needham (British bantamweight champion, and EBU European bantamweight Challenger, and British Commonwealth featherweight Challenger) defending the British featherweight title, Alan Richardson's final professional bout was a defeat by Les Pickett on Tuesday 3 October 1978."]}, {"page": "Vernon Sollas", "response": ["He turned professional in 1973 and moved base to London where he was managed by former British champion Bobby Neill, stopping John O'Rawe in his debut in February. He fought eight more times that year, including wins over Albert Amatler and Bashew Sibaca, losing only once, to George McGurk. In March 1974 he faced Jimmy Revie in a British featherweight title eliminator at the Royal Albert Hall. The fight went the full ten rounds with Revie getting the decision. He beat Sibaca again in May and in June faced British champion Evan Armstrong in a non-title fight, losing by knockout in the eighth round."]}, {"page": "2017 in the United Kingdom", "response": ["*8 July – Evan Armstrong, 74, boxer of the 1960s and 1970s."]}, {"page": "Deaths in July 2017", "response": ["*Evan Armstrong, 74, British boxer.Obituary - Evan Armstrong, one of Scotland's greatest ever featherweight boxing champions"]}, {"page": "Jimmy Revie", "response": ["In July 1971, Revie made the second defence of his British title against Evan Armstrong at Grosvenor House, Mayfair; With Revie well ahead on points, Armstrong knocked him out in the twelfth round to take the title.Donald, Brian (2017) \"Evan Armstrong\", The Herald, 11 July 2017. Retrieved 23 December 2017 via pressreader.com"]}, {"page": "Tommy Glencross", "response": ["Glencross's next fight came in September that year, a challenge for Evan Armstrong's British title; The fight went the full fifteen rounds, with Glencross winning by only half a point to take the title. A draw against Jimmy Bell and defeats to Bingo Crooks and Billy Waith followed before Glencross got a second shot at the European title in May 1973, when he faced Jose Antonio Jimenez in Gijon for the vacant title; Glencross lost a unanimous decision. His bad run continued four months later when he was stopped due to a cut over his left eye is the first defence of his British title against Armstrong in Glasgow. He lost again to Crooks in April 1974, retiring due to broken bone in his hand, and subsequently going missing for twenty months."]}]}}