{"wiki_id": "http://www.wikidata.org/entity/Q16198757", "itemLabel": "Ivan Hewett", "itemDescription": "British music journalist, academic, and radio and television presenter", "wikipedia_url": "https://en.wikipedia.org/wiki/Ivan_Hewett", "wikipedia_page": {"main": "Ivan Hewett is a British music critic and academic, currently the chief music critic for British newspaper The Telegraph. He is also active as a radio and television presenter.", "link_mentions": [{"page": "Angola Avante", "response": ["The lyrics of \"Angola Avante\" allude to how the country and its people will progress forward in the future.   It has been classified by The Daily Telegraph′s Ivan Hewett as one of several contemporary national anthems that convey \"a more martial tone\" inspired by \"La Marseillaise\"."]}, {"page": "Charles Rosen", "response": ["Ivan Hewett suggests that a major temptation of Rosen's 1947 fellowship offer was that it offered him time to practice and to read extensively in the Princeton library."]}, {"page": "Cantus in Memoriam Benjamin Britten", "response": ["Cantus in Memoriam Benjamin Britten () is a short canon in A minor, written in 1977 by the Estonian composer Arvo Pärt, for string orchestra and bell. The work is an early example of Pärt's tintinnabuli style, which he based on his reactions to early chant music. Its appeal is often ascribed to its relative simplicity; a single melodic motif dominates and it both begins and ends with scored silence. However, as the critic Ivan Hewett observes, while it \"may be simple in concept...the concept produces a tangle of lines which is hard for the ear to unravel. And even where the music really is simple in its audible features, the expressive import of those features is anything but.\"Hewett, Ivan. Music: Healing the Rift.  Continuum International Publishing, 2005. 218.  A typical performance lasts about six and a half minutes.Grimshaw, Jeremy. \"[ Cantus in Memory of Benjamin Britten, for string orchestra & bell]\". AllMusic. Retrieved on 28 June 2009."]}, {"page": "Borusan Istanbul Philharmonic Orchestra", "response": ["After the concert especially at the English press the concert got positive reviews. The Telegraph reporter Ivan Hewett wrote that the concert was \"superbly rich\". The Guardian's Tim Ashley wrote that Sascha Goetzel is more than a conductor, is a total entertainer."]}, {"page": "Cleveland Watkiss", "response": ["Reviewing a solo performance at The Vortex, Ivan Hewett wrote in The Telegraph: \"Cleveland Watkiss is such a restlessly curious musician, it's hard to know where to place him. He has sung with the Who and gospel choirs, he has appeared in straight-ahead jazz contexts and in drum and bass, he has worked with video artists, DJs, Indian percussionists, Japanese musicians. All these encounters have left their traces on him, as was clear from his solo gig at the Vortex. Just as important was the virtuoso way a reference to one musical style would morph into another. This worked so well because it was done in a spirit of play....", "But it wasn't all fun and games. Watkiss earlier on spun some ecstatic variations on a Chopin prelude that had us all spellbound.\"Ivan Hewett, \"From an opera to a hurricane in the blink of an eye\", The Telegraph, 11 December 2006."]}, {"page": "Raymond Yiu", "response": ["* Conjuring up opera magic at Aldeburgh - Ivan Hewett, The Daily Telegraph, 8 June 2006", "*LSO Futures, Barbican, Review - Ivan Hewett (The Telegraph, 15 April 2013)", "*The London Citizen Exceedingly Injured - Ivan Hewett (The Telegraph, 21 January 2013)", "*It's the magic that does the trick - Ivan Hewett (The Daily Telegraph, 19 June 2006)"]}]}}