{"wiki_id": "http://www.wikidata.org/entity/Q16195185", "itemLabel": "Jim MacCool", "itemDescription": "British poet", "wikipedia_url": "https://en.wikipedia.org/wiki/Jim_MacCool", "wikipedia_page": {"main": "Jim MacCool (born 1954) is a British dramatic poet in the shanachie or travelling bard tradition. MacCool is the author of Ionan Tales, a series of twelve lengthy tales in verse inspired by the Canterbury Tales and which he has performed more than a thousand times in places from Brisbane to Chicago since their premiere at a Sunday Times–sponsored Literary Festival at the 2000 Millennium. His shows typically combine his singing of Irish or Scots folk ballads, such as \"The Belle of Belfast City\" or \"Whiskey in the Jar\", a poetic recitation and a Celtic drum performance. MacCool is the founder and patron of Britain's National Poetry Month and in August 2006 was named poet-in-residence for Dudley, West Midlands.On 13 November 2004, he presented two of his stories \"The Boxer's Tale\" and the \"Story of Sawney Bean\" in Pember Heath Village Hall, along with his renditions of Irish and Scottish folk ballads. One story told of a boxer's greed, drug abuse and the revenge of his lover that left him in a wheelchair, while the second told of Sawney Bean and his wife Black Agnes, who dabbled in witchcraft and cannibalism at the time of King James VI of Scotland.During the May 2008 Malvern Fringe Festival, he performed two shows in rotation 18 times each over a six-day period. MacCool has also performed at the Buxton Fringe Festival and the Camden Fringe Festival, as well as at schools.\nJim MacCool took part in the Buxton Fringe Festival in 2008 and 2010.", "link_mentions": [{"page": "Bard", "response": ["* Bob Dylan, Jim MacCool and the band Blind Guardian have also been termed 'bards'"]}, {"page": "Dudley", "response": ["* Jim MacCool (born 1963) British dramatic poet in the shanachie or travelling bard tradition, also poet-in-residence for Dudley "]}, {"page": "Malvern Fringe Festival", "response": ["*Jim MacCool", "*Jim MacCool"]}, {"page": "National Poetry Month", "response": ["In the United Kingdom the festival “October is National Poetry Month” was founded in 2000 by Celtic bard Jim MacCool and was adopted by the Birmingham-based Performance Poetry Society that same year. From makeshift beginnings, National Poetry Month has been exploited by primary and secondary schools, colleges of further education, public library services, the prison estate, and to a lesser extent, more localised festivals. Professional poets appear in all corners of the United Kingdom under the aegis of the Performance Poetry Society, which co-ordinates a proportion of their efforts and ensures that they are paid a normal rate for their appearances."]}]}}