{"wiki_id": "http://www.wikidata.org/entity/Q1616131", "itemLabel": "William Home Lizars", "itemDescription": "Scottish painter and engraver (1788-1859)", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Home_Lizars", "wikipedia_page": {"main": "William Home Lizars (1788 – 30 March 1859) was a Scottish painter and engraver.", "link_mentions": [{"page": "Sir William Jardine, 7th Baronet", "response": ["Jardine made natural history available to all levels of Victorian society by editing the hugely popular forty volumes of The Naturalist's Library (1833–1843) issued and published by his brother in law, the Edinburgh printer and engraver, William Home Lizars.Susan Sheets-Pyenson \"War and Peace in Natural History Publishing: The Naturalist's Library, 1833-1843\". Isis. 1981, v.72 (no. 261) pp.50-72. The series was divided into four main sections: Ornithology (14 volumes), Mammalia (13 volumes), Entomology (7 volumes), and Ichthyology (6 volumes); each prepared by a leading naturalist. James Duncan wrote the insect volumes. The artists responsible for the illustrations included Edward Lear. The work was published in Edinburgh by W. H. Lizars. The frontispiece is a portrait of Pierre André Latreille.", "He was married to Jane Home Lizars, and through her was brother-in-law to John Lizars FRSE and William Home Lizars."]}, {"page": "Alexander Keith Johnston (1804–1871)", "response": ["After an education at the High School and the University of Edinburgh he was apprenticed to the Edinburgh engraver and mapmaker, James Kirkwood and William Home Lizars. In 1826, he joined his brother William (who would become Sir William Johnston, Lord Provost of Edinburgh) in a printing and engraving business, forming the well-known cartographical firm of W. and A. K. Johnston with offices based at 4 St Andrew Square in Edinburgh's New Town (demolished 2016)Edinburgh and Leith Post Office Directory 1870-71 and their printworks based at Edina Works, off Easter Road. The firm used the clan motto of \"Ready Aye Ready\" as their logo. Early hikes in the West Highlands had led Johnston to despair at the accuracy of maps, and inspired a desire to rectify this."]}, {"page": "Daniel Macnee", "response": ["He studied in Edinburgh at the Trustees' Academy, where he supported himself by illustrating publications for William Home Lizars the engraver. Moving to Glasgow, he established himself as a fashionable portrait painter. In 1829 he was admitted as a member of the Royal Scottish Academy. He does not appear as an independent property owner until 1840 when he is listed as a portrait painter living at 126 West Regent Street in Glasgow.Glasgow Post Office Directory 1840-41"]}, {"page": "Horatio McCulloch", "response": ["Horatio McCulloch was trained in the studio of the Glasgow landscape painter John Knox (1778–1845) for about one year alongside Daniel Macnee (1806–1882) and at first earned his living as a decorative painter. He was then engaged at Cumnock, painting the ornamental lids of snuffboxes, and afterwards employed in Edinburgh by William Home Lizars, the engraver, to colour the illustrations in Prideaux John Selby's British Birds and similar works."]}, {"page": "John Lizars", "response": ["The son of Daniel Lizars Sr (1754–1812), a publisher and engraver, and his wife Margaret Home, he was born in 1792 at the \"Backstairs\" on Parliament Close in Edinburgh, off the Royal Mile.Edinburgh and Leith Post Office Directory 1791-92 His siblings were: Jane Home Lizars, who later married Sir William Jardine; William Home Lizars; and Daniel Lizars."]}, {"page": "St Cuthbert's Church, Edinburgh", "response": ["* William Home Lizars (1788–1859), engraver, and his brother John Lizars (1792–1860) and father Daniel Lizars Sr."]}, {"page": "Lizars", "response": ["** William Home Lizars (1788–1859), engraver, artist, and editor"]}, {"page": "List of painters by name beginning with \"L\"", "response": ["*William Home Lizars (1788–1859), Scottish painter and engraver"]}, {"page": "List of Scottish artists", "response": ["*William Home Lizars (1788–1859), painter and engraver"]}, {"page": "W. H. Lizars", "response": ["#REDIRECT William Home Lizars"]}, {"page": "William H. Lizars", "response": ["#REDIRECT William Home Lizars"]}, {"page": "George Aikman", "response": ["Born at the top of Warriston Close, in the High Street, Edinburgh, on 20 May 1830, was the ninth child of George Aikman (1788-1865) and his wife Alison McKay. The father, after employment by William Home Lizars the engraver, started business for himself about 1825 in Warriston Close, where he produced the plates and illustrations for the Encyclopædia Britannica seventh edition. Many of these were drawn and engraved by his son George."]}, {"page": "Benjamin Smith (engraver)", "response": ["In 1817 Smith and Bye were convicted at Dover of uttering forged Margate Bank notes and initially sentenced to death. Petitions for clemency included individual petitions from Smith's wife Mary and from William Bengo' Collyer; 7 collective petitions (65 people); and 8 letters, including from Sir Robert Gardiner on behalf of Prince Leopold of Saxe-Coburg (uncle of Queen Victoria, later to be King Leopold I of Belgium); from ex-employer William Home Lizars and his son Daniel Lizars; from publisher John Murray; and from the mayor and justices of the peace for the town and port of Dover. Murray's letter stated that “Bye and Smith shewed great ingenuity in engraving maps but did not excel in engraving written characters” [necessary for forging banknotes]. Smith and Bye were hanged on 27 November 1817. Smith's wife, Mary, had four children and lived in the Battle Bridge (Kings Cross) and Somers Town areas of London."]}, {"page": "Hugh William Williams", "response": ["In 1811–12, Williams published six large engravings of scenes in the north, while many of his early topographical drawings appeared in the Scots Magazine. An account of his travels in southern Europe, in two volumes, appeared in 1820. Written in the form of letters, and dedicated to John Thomson of Duddingston, the intention of the work was descriptive of scenery, and peoples as they appeared to him. The illustrations were engraved by William Home Lizars from drawings by the author."]}, {"page": "Comparison diagram", "response": ["Another popular subject became the comparative views of the lengths of the principal rivers in one country or from all over the world. In 1822 William Home Lizars presented a map, entitled \"Comparative View of the Lengths of the Principal Rivers of Scotland.\"\"Comparative View of the Lengths of the Principal Rivers of Scotland.\" by William Home Lizars, 1822. And in 1826 "]}, {"page": "Sarah Bezra Nicol", "response": ["In 1823 Mrs Nicol was engraved as Miss Grizelda Oldbuck by William Home Lizars. She had played that part at the Theatre Royal in an adaptation of Walter Scott's novel The Antiquary.Mrs. Nicol of the Theatre Royal Edinburgh as Miss Grizelda Oldbuckthe National Drama"]}, {"page": "James Hope Stewart", "response": ["Stewart made and signed watercolour drawings for 213 mammal plates, 177 bird plates, 140 fish plates and 15 insect plates, a total of 545 under his name, in 28 volumes of The Naturalist's Library. Many other plates in the series are in similar style and apparently by Stewart, but are unsigned. A number of the plates were engraved by William Home Lizars (1788-1859) from Stewart's drawings. Stewart may have added background detail to further plates by other artists such as Edward Lear."]}, {"page": "William Howison", "response": ["He was originally apprenticed to an engraver named Wilson and later worked under William Home Lizars."]}, {"page": "Scottish genre art", "response": ["Less well known contemporaries of Wilkie that pursued genre art included William Home Lizars (1788–1859), who was a student with Wilkie at the Trustees Academy. He exhibited two genre paintings in 1811: A Scotch Wedding and The Reading of the Will, which demonstrate humour and seem to relate to the early work of Wilkie, who painted his own version of the later in 1820. Shortly after this Lizars turned to engraving for a living.D. Macmillan, Scottish Art 1460–1990 (Edinburgh: Mainstream, 1990), , pp. 180–1. William Shiels (1785–1857) is mainly known as an animal painter, but he also created genre art. James Howe (1780–1836) also undertook genre art with an agricultural dimension. Most influenced by Wilkie were his close friends John Burnet (1784–1868), William Allan (1782–1850), Alexander George Fraser (1786–1865) and Andrew Geddes (1783–1844). The first three were all contemporaries of Wilkie at the Academy, while Geddes was self-taught. Burnet and Fraser worked closely with Wilkie in London, while Geddes and Allan stayed in touch with him throughout his career. Allan became Master of the Trustees Academy and later President of Royal Scottish Academy and so was able to pass on Wilkie's influence. He produced genre paintings including Christmas Eve (undated), which is a variation on Wilkie's A Penny Wedding.D. Macmillan, Scottish Art 1460–1990 (Edinburgh: Mainstream, 1990), , pp. 181–3."]}]}}