{"wiki_id": "http://www.wikidata.org/entity/Q16151052", "itemLabel": "Alice Owen", "itemDescription": "British philanthropist", "wikipedia_url": "https://en.wikipedia.org/wiki/Alice_Owen", "wikipedia_page": {"main": "Alice Owen (née Wilkes; 1547 – 26 October 1613) was an English philanthropist.", "link_mentions": [{"page": "Dame Alice Owen's School", "response": ["Dame Alice Owen's School (also known as Dame Alice Owen's or Owen's; referred to by the acronym DAOS) is an 11–18 mixed, partially selective secondary school and sixth form with academy status in Potters Bar, Hertfordshire, England. It is part of the Dame Alice Owen's Foundation; its trustees are the Worshipful Company of Brewers.", "It was founded in Islington as a boys' school for 30 students in 1613, which makes it one of the oldest schools in the United Kingdom, and is named after its founder, the 17th-century philanthropist Alice Owen. Over time, the boys' school expanded. A girls' school was built in 1886, and the two schools were merged in 1973; the mixed school moved to its current location at Dugdale Hill Lane in Potters Bar in stages between 1973 and 1976.", "right|thumb|alt=A black-and-white engraving of a woman, visible up to her waist, with the caption \"Lady Owen.\"|An engraving copied from a copy of a portrait of Alice Owen", "Dame Alice Owen's School was founded in 1613 by the English philanthropist Alice Owen (née Wilkes; 1547 – 26 November 1613). Owen decided to found a school to thank God for saving her when she was a child after she narrowly avoided being struck by an arrow, which passed through her hat, in the fields in Islington; the exact nature of this event is disputed.", "The death of her third husband (the judge Thomas Owen) in 1598 caused Alice Owen to be free to carry out her plans. On 6 June 1608, she acquired a licence to purchase  of ground in Islington and Clerkenwell, on which to build a hospital for 10 poor widows, and to confer power over that land (and some other land; in total, it was worth £40 a year) to the Worshipful Company of Brewers (her first husband, Henry Robinson, had been a member of the company). The site had been called the \"Hermitage\" field. In 1609, Owen officially gave authority over the charity she had founded to the Brewers' Company; by indentures dated in that year, she had given the company an annual payment of £25 to support her almshouses.", "The boys' school was expanded further in 1895–96 so that 420 boys could go there; a new wing was built, which included a library and science laboratories. In 1897, a memorial to Alice Owen (in the form of a statue) was commissioned; this statue is still located in the modern school. A building used for lunch as well as art and woodwork was built in 1904. During Robert Chomeley's time as headmaster (1909–27), the boys' school obtained playing fields in Oakleigh Park and he built several huts there, which were used for lessons. An assembly hall was added to the boys' school during his tenure; it was built in 1927.", "The schools were evacuated to Bedford during the Second World War, in which the schools' buildings were badly damaged. The girls' school was mostly destroyed by bombing in 1940 and had to be rebuilt; on 15 October 1940, 143 people were sheltering in the basement when a parachute mine hit the building, causing a pipe to flood the basement and killing 109 of the occupants. (A memorial to the people who died in the bombing was unveiled in 2005 at City and Islington College, at the former site of Dame Alice Owen's School's playground). Temporary huts were initially used when the students returned in 1945; a new five-storey girls' school building was built between 1960 and 1963.", "In 1951, Dame Alice Owen's took voluntary aided status, while retaining its separation into two single-sex schools. Both schools were in Goswell Road, facing each other across the boys' playground.", "To commemorate the school's quatercentenary in 2013, the school established a 400th Anniversary Committee chaired by the musician Gary Kemp (with Peter Martin, the chair of governors, as vice-chairman), which organised several events. Kemp is an Old Owenian (former student) who met some of the future members of his band Spandau Ballet at the school. Construction was set to start in February 2013. By November 2013, more than £840 000 had been raised. In 2014, Lord Winston unveiled the new block. Staff and volunteers made a cake at the school, large enough for all the staff, students and parents to share; this marked the beginning of the celebrations. The film director and producer Sir Alan Parker (also an Old Owenian) directed a Celebration Concert at the Royal Albert Hall in April 2013, (it was planned to take place on 23 April 2013) featuring performances by various groups of students, as well as members of Spandau Ballet (including Kemp). A Thanksgiving Service was held at St Paul's Cathedral on 30 April 2013; it was meant to be held a week after the concert. In November, the train company First Capital Connect named one of its trains \"Dame Alice Owens 400 years of learning\" to honour the occasion.", "The Dame Alice Owen's Foundation supports the school, and its trustees are the Worshipful Company of Brewers. The school's governing body consists of thirteen Foundation Governors (whose appointments are endorsed by the Worshipful Company of Brewers, since they are trustees of the Dame Alice Owen's Foundation), two elected teacher-governors, the headteacher and three elected parent-governors. The Governing Body meets once in every school term, and will hold additional meetings if necessary. , the Chair of Governors is Peter Martin.", "Around 90 per cent of students enter higher education, with many going to some of the best British universities: in 2016, 14 successfully applied to the University of Oxford or the University of Cambridge (collectively called Oxbridge). the school's record number of successful applications to these institutions in a single year is 30, which was achieved in 2013; two-thirds of students go on to Russell Group universities. In a 2016 study, Sol Gamsu, a PhD student at King's College London, found that Dame Alice Owen's School acts as a \"de facto feeder school\" for Oxbridge. According to a briefing paper about higher education published in 2019 by the House of Commons Library, 10.5 per cent of the school's pupils who go on to university go to Oxbridge; by this measure, it is the best performing state comprehensive school in the UK.", "Dame Alice Owen's School has been a Science Specialist School since 2007 and 43 per cent of students go on to study science at world-class universities.  The school holds regular lectures, organised by its science society, for students; worked with Cancer Research last year on a skin cancer project and is building relationships with Imperial College London. The school aimed to attract additional government funding, with over £250 000 already raised , to support the construction of a new science block, which finished in 2014.", "Dame Alice Owen's School offers a wide range of extracurricular activities for the pupils that attend it. Many pupils take part in the Duke of Edinburgh Award, including around 30 annually who do the Gold Award, the highest level. and school trips, for example to the Galapagos Islands, Costa Rica or CERN (the European Organization for Nuclear Research, which is based in Switzerland). There are also opportunities for students to visit the school's partner school in Tanzania.", "Dame Alice Owen's School is situated in the south of Potters Bar, just north of the M25 motorway and near South Mimms services (which are to the west of the school). Its grounds have an area of  and include a lake and large playing fields. In 2014, Alice Rose, writing for Tatler magazine, praised its \"excellent facilities\" and \"smart campus\"; in 2016, the journalist Sue Leonard, writing in The Times, said that the school \"offers...facilities many other secondary schools can only envy\", and described its sports grounds as \"enormous\"."]}, {"page": "Cransley Hall", "response": ["The Hall was originally built by Dame Alice Owen, widowed three times, latterly to Judge Thomas Owen. Following his death she left her home in Islington, London, and moved to Cransley Hall. Owen also founded Dame Alice Owen's School. ", "Dame Alice Owen's School", "*Dame Alice Owen's School"]}, {"page": "Thomas Owen (died 1598)", "response": ["Owen was twice married: first, to Sarah, daughter of Humphrey Baskerville, having by her five sons and five daughters; and second, to Alice, daughter of Thomas Wilkes of London, and widow of William Elkin, alderman of London, and of Henry Robinson, brewer of London. The latter survived him, and lived to found Dame Alice Owen's School in Islington in 1613, the year she died."]}, {"page": "Dame Alice Owen", "response": ["#REDIRECT Alice Owen"]}, {"page": "List of people educated at Dame Alice Owen's School", "response": ["Dame Alice Owen's School  is a  partially selective secondary school and sixth form with academy status located in Potters Bar, Hertfordshire in southern England. The school was founded in Islington as a boys' school for 30 students in 1613, which makes the school one of the oldest in the United Kingdom. It is named after its founder, the 17th-century philanthropist Alice Owen. Over time, the boys' school expanded. A girls' school was built in 1886, and the two were merged into a mixed school in 1973; after this, the school moved to its current location gradually between 1973 and 1976.", "* Dame Helen Metcalf (1946–2003), headteacher of Chiswick Community School, 1998-2001 (taught history at Dame Alice Owen's School, 1971–75)"]}, {"page": "Owen, Alice", "response": ["#redirectAlice Owen"]}]}}