{"wiki_id": "http://www.wikidata.org/entity/Q16145955", "itemLabel": "John Arnison", "itemDescription": "English music producer", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Arnison", "wikipedia_page": {"main": "John Arnison is an English music manager and producer. Acts he has managed include Marillion in the 1980s and much of the 1990s, Gabrielle, Billy Ocean, Aswad, MN8, Charles & Eddie, Yusuf Islam (formerly Cat Stevens) Leftfield, Connie Talbot and Noisettes. 2015 John now runs John Arnison Music and Media, a bespoke management company Managing the Singer Billy Ocean and up and coming band CC Smugglers.", "link_mentions": [{"page": "Marillion", "response": ["Fish gave the band a choice to continue with either him or the manager, John Arnison.  They sided with the manager and Fish left for a solo career. His last live performance with Marillion was at Craigtoun Country Park on 23 July 1988. Owing to lengthy legal battles, informal contact between Fish and the other four band members apparently did not resume until 1999. Fish would later disclose in the liner notes to the 2-CD reissue of Clutching at Straws that he and his former bandmates had met up and discussed the demise of the band and renewed their friendship, and had come to the consensus that an excessive touring schedule and too much pressure from the band's management led to the rift."]}, {"page": "Aswad", "response": ["*John Arnison"]}, {"page": "Vigil in a Wilderness of Mirrors", "response": ["The cover art was by Mark Wilkinson, who had illustrated all Marillion albums and singles while Fish was their singer and went on to design almost all Fish solo covers. The front cover features a close-up from a larger, very detailed painting/collage inside the gatefold LP cover and the CD booklet. The painting contains many references to the lyrics, political allusions as well as \"hidden\" messages only understandable to fans (such as the faces of Marillion's keyboardist Mark Kelly and manager John Arnison). The central element is a \"hill\" consisting of junk consumer goods in a post-apocalyptic landscape, on top of which a couple clad in pseudo-oriental clothes stare into the distance, holding an hourglass. The man's cape, flapping in the wind, resembles the east of Scotland, with the Southern Uplands (Fish's home region) lit by light beams apparently emitted by the hourglass – a reference to Fish's interest in Scottish culture. Only the couple and the top of the hill are on the front cover. The TV sets and the Amiga 500 computer set the couple is standing on show pictures of Fish's face; on the larger version inside, these are replaced with faces from Ingres's painting The Golden Age."]}, {"page": "Over the Rainbow (Connie Talbot album)", "response": ["Connie Talbot entered the public eye appearing, aged six, on the first series of the reality programme Britain's Got Talent, reaching the final. After briefly recording with Sony BMG, Talbot was signed to Rainbow Recording Company, an offshoot of the label Rhythm Riders made specifically for her. To produce Over the Rainbow, Talbot worked with John Arnison, then-manager to Gabrielle and Billy Ocean, and Marc Marot, a former managing director of Island Records. It was produced and mixed by Simon Hill and Rob May. Talbot said that \"it was just amazing that we could do it in my auntie's house\". Arnison and Marot asked the Talbot family to \"write down a list of the songs that Connie would sing at her birthday party\" to help choose the track listing, and then \"thought long and hard\" about including more adult songs on the album. Talbot herself insisted that they should."]}, {"page": "Connie Talbot", "response": ["The team behind the album consisted of John Arnison, who also managed Gabrielle and Billy Ocean, and Marc Marot, former managing director of Island Records. It was produced and mixed by Simon Hill and Rob May."]}, {"page": "Arnison", "response": ["*John Arnison, British music manager and producer"]}, {"page": "Arnison, John", "response": ["#redirectJohn Arnison"]}]}}