{"wiki_id": "http://www.wikidata.org/entity/Q16190995", "itemLabel": "N. A. Palmer", "itemDescription": "British musician and artist", "wikipedia_url": "https://en.wikipedia.org/wiki/N._A._Palmer", "wikipedia_page": {"main": "Andrew \"Andy\" Palmer, also known as N. A. Palmer, is a British musician and artist. He was the rhythm guitarist for anarcho punk band Crass.\n\n", "link_mentions": [{"page": "Yes Sir, I Will", "response": ["*N. A. Palmer - rhythm guitar, vocals, voices"]}, {"page": "Crass", "response": ["Other friends and household members joined (including Gee Vaucher, Pete Wright, N. A. Palmer and Steve Herman), and Crass played their first live gig at a squatted street festival in Huntley Street, North London. They planned to play five songs, but a neighbour \"pulled the plug\" after three. Guitarist Steve Herman left the band soon afterwards, and was replaced by Phil Clancey, aka Phil Free. Joy De Vivre and Eve Libertine also joined around this time. Other early Crass performances included a four-date tour of New York City, a festival gig in Covent Garden and regular appearances with the U.K. Subs at The White Lion, Putney and Action Space in central London. The latter performances were often poorly attended: \"The audience consisted mostly of us when the Subs played and the Subs when we played\".Rimbaud, P; \"...In Which Crass Voluntarily Blow Their Own\", sleeve note essay included with Best Before 1984 album", "The band had also incurred heavy legal expenses for the Penis Envy prosecution; this, combined with exhaustion and the pressures of living and operating together, finally took its toll. On 7 July 1984, the band played a benefit gig at Aberdare, Wales, for striking miners, and on the return trip guitarist N. A. Palmer announced that he intended to leave the group. This confirmed Crass's previous intention to quit in 1984, and the band split up.", "*N. A. Palmer (guitar)"]}, {"page": "Palmer (surname)", "response": ["*N. A. Palmer, guitarist for anarcho-punk band Crass"]}, {"page": "N.A.Palmer", "response": ["#REDIRECT N. A. Palmer "]}, {"page": "N.A. Palmer", "response": ["#REDIRECT N. A. Palmer"]}, {"page": "Andrew Palmer", "response": ["*N. A. Palmer (born 1956), British punk musician and artist"]}]}}