{"wiki_id": "http://www.wikidata.org/entity/Q16196976", "itemLabel": "Sigurd Haveland", "itemDescription": "Gibraltarian triathlete and cyclist", "wikipedia_url": "https://en.wikipedia.org/wiki/Sigurd_Haveland", "wikipedia_page": {"main": "Sigurd Haveland (born 30 March 1964) is a Gibraltarian triathlete and cyclist. He is a nutrition consultant by profession.", "link_mentions": [{"page": "2000 IAAF World Cross Country Championships – Senior men's race", "response": ["|align=center|  —  || align=left | Sigurd Haveland || align=left |  || DNF", "|align=left style=\"border:0\"| (Sigurd Haveland) || align=right style=\"border:0\"| (DNF) "]}, {"page": "2000 IAAF World Cross Country Championships – Men's short race", "response": ["|align=center| 155 || align=left | Sigurd Haveland || align=left |  || 14:53", "|align=left style=\"border:0\"| (Sigurd Haveland) || align=right style=\"border:0\"| (155)"]}, {"page": "Christopher Walker (athlete)", "response": ["8 months after his surgery, Walker competed in two cycling events at the 2005 Island Games in Shetland, Scotland. In the men's individual time trial he finished in 27th in 1:04:08.3 and with Julian Bellido and Sigurd Haveland finished 6th in men's team time trial. At the 2006 Commonwealth Games in Melbourne, Walker finished 34th in men's road time trial with a time of 57:30.39. The following year at the 2007 Island Games in Rhodes, Greece, Walker competed in the men's individual town centre criterium and in the triathlon where he finished 5th in the men's individual triathlon with a time 2:05:35 and alongside Edgar Harper, Sigurd Haveland and Kevin Walsh finished 6th in the team event. Walker qualified for the 2008 Ironman 70.3 World Championship held in Clearwater, Florida. He finished 12th out of 159 in the male 40–44 age division and 179th of out of 1493 overall. At the 2010 Commonwealth Games in Delhi, Walker finished 32nd in men's road time trial with a time of 59:05.13. and started but failed to finish the road race. In August 2010, Walker competed in the Outlaw Triathlon in Nottingham where he finished 2nd in his age division and 9th overall in 9:49:08. In May 2011, Walker competed in the 2011 Ironman Lanzarote in Puerto del Carmen finishing 36th out of 299 in the male 40–44 age division and 173th of 1469 overall in a time of 10:50:50. Cycling was dropped from the program for the 2009 Island Games, however, it returned in two years later at the 2011 Island Games in the Isle of Wight where Walker contested five of six road cycling events. The following year, Walker first competed in the Ironman European Championship in Frankfurt, Germany finishing 4th out of 502 in the male 45–49 age division and 134th of 2885 overall in a personal best time of 9:36:07. This result qualified him for the 2012 Ironman World Championship in Hawaii where he finished 58th out of 225 in his division and 578th out of 1984 overall with a time of 10:23:56. At the 2013 Island Games in Bermuda, Walker failed to finish the men's individual time trial but alongside Mark Francis, Sigurd Haveland, Robert Matto and Sean Randall they finished in 7th place in 3:22:50.817 in the men's time trial team award. The 2013 Games also saw Walker contest the triathlon where he finished in 4th place in the individual event with a time 2:03:36 and won gold in the team event with Derek Barbara, Mark Francis, Mark Garcia, Andrew Gordon, Edgar Harper, Sigurd Haveland, Robert Matto, Richard Muscat and Sean Randall. At the 2013 ITU World Championships in London Walker won silver in the Sprint Distance event in the 45–49 age group with a time of 1:08:16, the first ever ITU World Championship medal for Gibraltar. Walker also competed in the Standard Distance event and finished in 13th place in the 45–49 age group with a time of 1:55:11."]}]}}