{"wiki_id": "http://www.wikidata.org/entity/Q16193662", "itemLabel": "Wendy Jeal", "itemDescription": "British athletics competitor", "wikipedia_url": "https://en.wikipedia.org/wiki/Wendy_Jeal", "wikipedia_page": {"main": "Wendy Jeal (née McDonnell, born 21 November 1960) is a female English former track and field athlete who competed in the 100 metres hurdles. She represented Great Britain at the 1988 Olympic Games. In 1986,  representing England, she won a Commonwealth Games silver medal.", "link_mentions": [{"page": "Sally Gunnell", "response": ["In 1986, having won the AAAs and UK titles, Gunnell won the Commonwealth Games gold medal in the 100 metres hurdles in Edinburgh, ahead of Wendy Jeal and 1984 Olympic heptathlon champion Glynis Nunn. She would remain the UK number one in the event over the next four seasons and reach the semi-finals at the 1987 World Championships and 1988 Olympics in the event."]}, {"page": "Athletics at the 1988 Summer Olympics – Women's 100 metres hurdles", "response": ["| 17 || 2 || align=\"left\" | Wendy Jeal ||align=left| || 13.32 ||", "| 16 || 4 || align=\"left\" | Wendy Jeal ||align=left| || 13.32 || q"]}, {"page": "Lesley-Ann Skeete", "response": ["Skeete was born in Sydenham, England and was raised in Swindon. She first came to prominence in 1985 as a teenager, winning the first of two English Schools 100 metres hurdles titles and placing third at the UK Championships behind Judy Simpson and Judith Rodgers in 13.76 seconds. She began 1986 by claiming her first senior national title at the AAAs indoor championships, winning the 60 m hurdles in 8.22 secs. In the summer of 1986, Skeete placed second in the 100 m hurdles at both the UK Championships and the AAA Championships behind Sally Gunnell and ahead of both Wendy Jeal and Olympic silver medalist Shirley Strong. At the Commonwealth Games in Edinburgh, she finished fifth for England in the final in a time of 13.66.", "In the 1987 indoor season, after retaining her AAAs title, Skeete reached the 60 m hurdles final at both the European Indoor Championships and the World Indoor Championships. At the Europeans in Lievin, she was fifth in 8.07, having run a UK record of 8.06 in both the heats and semis. At the World Indoors in Indianapolis, she was sixth in 8.18 secs. Outdoors, she won the UK title in 13.29, ahead of Kim Hagger and Wendy Jeal before again finishing second to Sally Gunnell at the AAAs Championships. At the World Championships in Rome, she was eliminated in the heats in 13.40."]}, {"page": "1986 European Athletics Championships – Women's 100 metres hurdles", "response": ["| 6 || align=left | Wendy Jeal || align=left |  || 13.29 || ", "| 5 || align=left | Wendy Jeal || align=left |  || 13.16 || q"]}, {"page": "Athletics at the 1986 Commonwealth Games – Women's 100 metres hurdles", "response": ["|Wendy Jeal", "| 4 || 1 ||align=left| Wendy Jeal ||align=left|  || 13.33 || Q", "|  || 5 ||align=left| Wendy Jeal ||align=left|  || 13.41 ||"]}, {"page": "1985 IAAF World Indoor Games – Women's 60 metres hurdles", "response": ["| 7 || 3 || align=\"left\" | Wendy Jeal ||align=left|  || 8.34 || Q", "| 7 || 1 || align=\"left\" | Wendy Jeal ||align=left|  || 8.37 ||"]}, {"page": "1984 UK Athletics Championships", "response": ["|Wendy Jeal || 13.41 "]}, {"page": "1986 UK Athletics Championships", "response": ["|Wendy Jeal || 13.60"]}, {"page": "1987 UK Athletics Championships", "response": ["|Wendy Jeal || 13.53"]}, {"page": "1990 UK Athletics Championships", "response": ["|Wendy Jeal || 13.40 "]}, {"page": "1988 AAA Championships", "response": ["|Wendy Jeal || 13.43"]}, {"page": "Jeal", "response": ["*Wendy Jeal (born 1960), British track and field athlete"]}, {"page": "England at the 1986 Commonwealth Games", "response": ["|Wendy Jeal          ||100m Hurdles ||1 x silver"]}]}}