{"wiki_id": "http://www.wikidata.org/entity/Q16106575", "itemLabel": "Mike Buss", "itemDescription": "English cricketer (born 1944)", "wikipedia_url": "https://en.wikipedia.org/wiki/Mike_Buss", "wikipedia_page": {"main": "Michael Alan Buss (born 24 January 1944 in Brightling, Sussex) is an English former cricketer active from 1961 to 1978 who played for Sussex. He appeared in 316 first-class matches as a lefthanded batsman who bowled left arm medium pace. Tony Buss is his brother. He scored 11,996 runs with a highest score of 159 among eleven centuries and took 547 wickets with a best performance of seven for 58.", "link_mentions": [{"page": "Ian Botham", "response": ["Botham had done well for the Second XI and he later acknowledged the help and advice he received from Somerset players Peter Robinson, Graham Burgess and Ken Palmer. Botham made his senior debut, aged 17, for Somerset on Sunday, 2 September 1973 when he played in a List A John Player League (JPL) match (38 overs each) against Sussex at the County Ground, Hove.Murphy (1988) p. 24. The match was in the same week that his time on the Lord's ground staff was completed.Doust (1981), p. 42. Somerset batted first, and Botham, number seven in the batting order, scored two runs before he was dismissed leg before wicket (lbw) by Mike Buss. Somerset totalled 139 for 9. Sussex won comfortably by six wickets, reaching 141 for four with fifteen deliveries remaining. Botham bowled three overs without success, conceding 22 runs. He did impress, however, by taking a diving catch to dismiss his future England colleague Tony Greig off the bowling of his captain Brian Close.Murphy (1988), pp. 24–25."]}, {"page": "Tony Greig", "response": ["Greig was born to a Scottish immigrant father and a South African-born mother, and was educated at Queen's College, Queenstown, South Africa. Many former Sussex players had been recruited to coach the cricket team at Queen's College — during Greig's schooldays, Jack Oakes, Alan Oakman, Ian Thomson, Ron Bell, Richard Langridge and Mike Buss all came from overseas for off-season work. All of them noticed Greig's developing abilities which, after a first-class debut for Border in the Currie Cup, led to a trial at Sussex when Greig was 19. Greig's father helped him decide between university study or pursuit of the Sussex offer. \"He used to slam into me for not reading enough, for being generally immature. He would look at me sometimes and say 'Boy, when I was your age I was fighting a war', but in the end he grinned and said: 'Go over to England for one year, one year mind, and see what you can do'\".Wisden 1975"]}, {"page": "Indian cricket team in England in 1971", "response": ["Mike Buss and Geoff Greenidge scored 199 before the first wicket fell. Buss who was 15 at the end of the first day reached his hundred before lunch on the second, out of 154. His eventual 140 was scored in 195 minutes with two sixes and eighteen does. Greenidge took 205 minutes for 62. Prasanna took 5 for 137 which was his best bowling for the tour in what was to be his last match. Sussex took a lead of 146."]}, {"page": "Town Ground, Worksop", "response": ["The land on which the Town Ground was built was previously agricultural land. It was given to the town's cricket club in 1900 by a local brewer, William Allen. Construction of the ground required the land to be levelled by some , which some locals believed to be an error as the ground now lies below the water level of nearby the River Ryton. Construction was completed by 1901 and included a pavilion, with the new cricket ground replacing one which had been sited south of the River Ryton. The ground was due to be opened in 1901 with a match between Worksop and Nottinghamshire Club and Ground, but the match was abandoned due to rain. The ground was adjoined on its eastern side by the stadium of Worksop Town F.C.. Nottinghamshire first played at the ground in a first-class match against Derbyshire in the 1921 County Championship. Nottinghamshire played there twelve times prior to the Second World War. After a gap of twenty years, Nottinghamshire returned to the ground in 1959 and often played matches there in July to coincide with the annual holidays at the local coalfields. Worksop is located just a few miles from the South Yorkshire border, with Yorkshire being the visitors on thirteen occasions. Their affinity with the ground led to success for Yorkshire players such as Geoffrey Boycott who scored over 900 runs on the ground and averaged well over 100, and Fred Trueman who once took figures of 8 for 84 in 1962. Nottinghamshire played first-class cricket at the ground until 1998, having played 48 first-class matches there in the County Championship, Nottinghamshire also played three List A one-day matches at the Town Ground in the John Player League between 1970 and 1980, with Sussex's Mike Buss making the only List A century at the ground with a score of 121 in 1971."]}, {"page": "Richard Holmes (cricketer)", "response": ["While studying at the University of Cambridge, Holmes made a single appearance in List A cricket for the university cricket team in the 1974 Benson & Hedges Cup against Sussex at the County Cricket Ground, Hove. In a match which Sussex won by 186 runs, Holmes bowled eleven wicketless overs and was dismissed for just one run by Mike Buss. This was his only appearance for Cambridge University, with him not featuring in any first-class fixtures for the team."]}, {"page": "Tony Buss", "response": ["Antony Buss (born 1 September 1939 in Brightling, Sussex) is an English former cricketer active from 1958 to 1974 who played for Sussex. He appeared in 310 first-class matches as a righthanded batsman who bowled right arm fast medium. Mike Buss is his brother. He scored 4,415 runs with a highest score of 83 and took 958 wickets with a best performance of eight for 23.Tony Buss at CricketArchive"]}, {"page": "List of Marylebone Cricket Club players (1946–1977)", "response": ["* Mike Buss (1968) : M. A. Buss (Sussex)"]}, {"page": "Marylebone Cricket Club Under-25 cricket team in Pakistan in 1966–67", "response": ["* Mike Buss (22)"]}]}}