{"wiki_id": "http://www.wikidata.org/entity/Q16150056", "itemLabel": "Arsher Ali", "itemDescription": "British actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Arsher_Ali", "wikipedia_page": {"main": "Arsher Ali (born 9 April 1984) is a British-Pakistani actor. He has played various TV and film roles, and is a regular lead performer at the Royal Shakespeare Company in Stratford-upon-Avon.", "link_mentions": [{"page": "George Edalji", "response": ["Julian Barnes's 2005 novel Arthur & George is based on the events, and was the basis for the March 2015 ITV three-part dramatisation of the case Arthur & George, starring Martin Clunes as Conan Doyle and Arsher Ali as Edalji."]}, {"page": "East 15 Acting School", "response": ["* Arsher Ali"]}, {"page": "Screen International", "response": ["* Arsher Ali"]}, {"page": "Number 10 (drama series)", "response": ["* Amjad Hemmati ..... Arsher Ali"]}, {"page": "List of people from Nottingham", "response": ["*(Born 1984) Arsher Ali, actor born in Basford, who starred in the film Four Lions"]}, {"page": "Four Lions", "response": ["Four Lions (originally titled We Are Four Lions) is a 2010 British political satire black comedy film directed by Chris Morris (in his directorial debut) and written by Morris, Sam Bain and Jesse Armstrong. The film, a jihad satire following a group of homegrown terrorist jihadis from Sheffield, South Yorkshire, England, stars Riz Ahmed, Kayvan Novak, Nigel Lindsay, Arsher Ali and Adeel Akhtar.", "A group of radicalised young British Muslim men aspire to be suicide bombers. They are Omar (Riz Ahmed), who is deeply critical of Western society and interventionism; his very dim-witted cousin Waj (Kayvan Novak); Barry (Nigel Lindsay), a bad-tempered and extremely rash English convert to Islam; and the naive Faisal (Adeel Akhtar), who tries to train crows to be used as bombers. While Omar and Waj travel to an al Qaeda-affiliated training camp in Pakistan, Barry recruits a fifth member, Hassan (Arsher Ali). The training trip ends in disaster when Omar attempts to shoot down an American drone and accidentally destroys part of the camp; the pair are forced to flee. However, Omar uses the experience to assert authority on his return to Britain.", "* Arsher Ali as Hassan Malik, a rapper who joins the cell after Barry witnesses him pretending to blow himself up at a conference"]}, {"page": "Ben Lovett", "response": ["|a Netflix Original film directed by David Bruckner and starring Rafe Spall, Arsher Ali, Robert James-Collier, and Sam Troughton"]}, {"page": "Beaver Falls (TV series)", "response": ["220px|thumb|right|The main cast of series 1. Bottom row from left to right: Natasha Loring as Kimberley, John Dagleish as Barry, Jon Cor as Jake, Arsher Ali as A-Rab and Kristen Gutoskie as Rachael. Top row from left to right: Todd Boyce as Bobby, Sam Robertson as Flynn, and Alison Doody as Pam.", "| Arsher Ali ||A-Rab/Adil Hussain||Series 1–2"]}, {"page": "List of comedy films of the 2010s", "response": ["|Four Lions||Chris Morris||Riz Ahmed, Arsher Ali, Nigel Lindsay ||United Kingdom||"]}, {"page": "Line of Duty", "response": ["* Arsher Ali as PC Harinderpal \"Hari\" Baines"]}, {"page": "Doctor Who (series 9)", "response": ["In January 2015, it was announced that actor Paul Kaye had a guest role in the first production block. It was later announced that other guest actors featuring in the first block include Arsher Ali, Morven Christie, Neil Fingleton, Colin McFarlane, and Steven Robertson."]}, {"page": "The Missing (British TV series)", "response": ["*Arsher Ali as Malik Suri; an English journalist who is determined to make his big break by any means. By bribing corrupt detective Khalid Ziane, he has obtained evidence that could lead to Oliver's killer."]}, {"page": "Complicit (film)", "response": ["Edward Ekubo (David Oyelowo) is a case officer for the British Security Service, MI5. He is keeping Waleed Ahmed (Arsher Ali), a British citizen of Yemeni descent, under surveillance because he believes that Ahmed has been radicalised and is planning a terrorist attack in the UK. However, his supervisor and head of section are sceptical due to the lack of solid evidence. Ekubo feels his instincts are ignored and his career prospects stifled because he is black and studied at Warwick University rather than Oxford or Cambridge.", "Actor Arsher Ali took a 'method acting' approach to his role and as a result, he did not speak to David Oyelowo between takes so as not to break character.", "* Arsher Ali – Waleed Ahmed", "Arsher Ali also won the \"Outstanding Actor\" award at the Golden Nymph Awards in Monte Carlo for his performance."]}, {"page": "Arthur & George (TV series)", "response": ["*Arsher Ali as George Edalji"]}, {"page": "A Patch of Fog", "response": ["* Arsher Ali as Troy Griffin"]}, {"page": "Roxy Shahidi", "response": ["Ghawam-Shahidi was born to an Iranian father and an English mother, and grew up in Whalley Range in Manchester. She became a vegetarian at the age of 8, and a vegan since the age of 21.As told to Channel 5 programme \"The Wright Stuff\" on 17 January 2013. She is married to Arsher Ali. They have 1 child together born in 2018."]}, {"page": "Remainder (film)", "response": ["* Arsher Ali as Naz"]}, {"page": "The Guilty (TV series)", "response": ["* Arsher Ali as DS Vinesh Roy"]}, {"page": "List of horror films of 2017", "response": ["| data-sort-value=\"Bruckner, David\" | David Bruckner || |Rafe Spall, Arsher Ali, Robert James-Collier || United Kingdom ||"]}, {"page": "The Ritual (2017 film)", "response": ["The Ritual is a 2017 British horror film directed by David Bruckner and written by Joe Barton. It stars Rafe Spall, Arsher Ali, Robert James-Collier, and Sam Troughton. The film is based on the 2011 novel The Ritual by Adam Nevill.", "* Arsher Ali as Phil "]}, {"page": "List of British films of 2017", "response": ["|| Director: David Bruckner  Cast: Rafe Spall, Arsher Ali, Robert James-Collier, Sam Troughton"]}, {"page": "List of British films of 2018", "response": ["|| Director: Tinge Krishnan  Cast: Michaela Coel, Arinzé Kene, George MacKay, Joe Dempsie, Luke Norris, Arsher Ali, Rakie Ayola, Ashley Thomas"]}, {"page": "List of British films of 2019", "response": ["|| Director: Anthony Woodley  Cast: Lena Headey, Ivanno Jeremiah, Mandip Gill, Jack Gordon, Peter Singh, Arsher Ali, Iain Glen "]}, {"page": "Been So Long (film)", "response": ["*Arsher Ali as Jake"]}, {"page": "Informer (TV series)", "response": ["* Arsher Ali as Imran Aziz, an undercover police detective"]}, {"page": "Line of Duty (series 3)", "response": ["* Arsher Ali as PC Harinderpal \"Hari\" Bains "]}, {"page": "The Flood (2019 film)", "response": ["The Flood is a 2019 British drama film, directed by Anthony Woodley, from a screenplay by Helen Kingston. It stars Lena Headey, Ivanno Jeremiah, Mandip Gill, Jack Gordon, Peter Singh, Arsher Ali and Iain Glen. It was released on 21 June 2019, by Curzon Artificial Eye.", "* Arsher Ali as Nasrat"]}, {"page": "Cold Courage", "response": ["*Arsher Ali DCI Peter Chandra"]}, {"page": "Sadiq Nawaz", "response": ["Ray had never appeared on a serious drama series prior to Ackley Bridge, but stated that he was \"quite happy going straight in at the deep end\". He stated that there was a large difference in the form of acting used on Ackley Bridge as opposed to Citizen Khan, a sitcom Ray stars in. He explained that on Citizen Khan, a comedy series filmed with a live studio audience, he is \"playing for laughs\", which causes him to \"play quite big\". However, he noted that with portraying Sadiq, he does not have to do this. He expressed his gratitude at getting to work with co-stars Joyner, Liz White and Arsher Ali, stating that he watched how they performed, and was \"feeding off them\". He said that he enjoyed filming for Ackley Bridge since it made him \"think again about how [he does] things, and [made him] learn something\". He added that since he created, starred in, co-wrote and co-produced Citizen Khan, it was \"a very liberating and satisfying experience\" to only have to act as Sadiq. He added that while it was a \"real challenge\", he \"loved it\". Ray found it \"fantastic\" to work with the young cast of Ackley Bridge, and opined that a number of \"real stars\" had been found on the series. Whilst filming for the series in Halifax, West Yorkshire, he stayed in a hotel across the road from the set. He stated that it felt \"important\" to have productions in locations such as Halifax, as opposed to big cities like London and Manchester. He opined that the Halifax area was not represented onscreen prior to it, and he could \"feel the energy and the culture that exists there\"."]}, {"page": "Emma Keane (Ackley Bridge)", "response": ["Emma Keane is a fictional character from the Channel 4 school drama Ackley Bridge, portrayed by Liz White. Emma first appeared in the pilot episode of the series, first broadcast on 7 June 2017. She is introduced as an English teacher at the fictional Ackley Bridge College. Her storylines in the series include her rocky relationship with daughter Chloe Voyle (Fern Deacon), supporting student Missy Booth (Poppy Lee Friar) through her life struggles and having an affair with Samir Qureshi (Arsher Ali).", "After having shaved her legs in the taxi, Emma arrives at Ackley Bridge College for her first day in flip-flops, due to running late. She arrives late to headteacher Mandy Carter's (Jo Joyner) staff meeting, who is a friend from her previous school. She also meets Samir Qureshi (Arsher Ali), with whom she had a relationship with in university. Mandy oversees her English lesson, where daughter Chloe Voyle (Fern Deacon) shows up drunk and vomits in her classroom. Chloe informs her that her father Nik (Stuart Manning) no longer wants to care for her, so she has taken an Uber across the country. When Emma plans for her to go back to Nik and scolds her for getting drunk, Chloe posts a photo of Emma topless on social media. She is called in by Mandy, who informs her that the image has damaged the reputation of the school. Chloe apologises for posting the photo, and Emma explains that she felt she would not be good at motherhood. Emma worries about student Missy Booth (Poppy Lee Friar), who she knows from a previous school."]}, {"page": "Characters of Ackley Bridge", "response": ["Ackley Bridge is a British television drama series that follows the lives of the staff and pupils at the fictional multi-cultural academy school Ackley Bridge College. Series one features the debuts of friends Missy Booth (Poppy Lee Friar) and Nasreen Paracha (Amy-Leigh Hickman), headteacher Mandy Carter (Jo Joyner) and her husband Steve Bell (Paul Nicholls), school cook Kaneez Paracha (Sunetra Sarker), English teacher Emma Keane (Liz White) and her daughter Chloe Voyle (Fern Deacon), school sponsor Sadiq Nawaz (Adil Ray) and his children Alya (Maariah Hussain) and Riz (Nohail Mohammed), brothers Jordan (Samuel Bottomley) and Cory Wilson (Sam Retford), school receptionist Lorraine Bird (Lorraine Cheshire), science teacher Lila Shariff (Anneika Rose), head of pastoral care Samir Qureshi (Arsher Ali), PE teacher Will Simpson (Tom Varey), Missy's mother Simone (Samantha Power) and grandmother Julie 'Nana' Booth (Rita May) and students Hayley Booth (Cody Ryan), Razia (Nazmeen Kauser) and Saleem Paracha (Esa Ashraf), Candice Murgatroyd (Emily Pyzer) and Naveed Haider (Gurjeet Singh). Series two sees the introduction of science teacher Rashid Hyatt (Tony Jayawardena), Nasreen's half-brother Aaron Turner (Adam Fielding), deputy headteacher Javid Shah (Jay Saighal) and student Sam Murgatroyd (Megan Parkinson).", "| Arsher Ali ", "Jordan Wilson (portrayed by Samuel Bottomley) is the brother of Cory (Sam Retford), and the son of Kevin (Steve Jackson). When he begins attending the school, he pretends to be an Islam revert, and later displays a poster that mocks female students wearing hijabs. This causes a rivalry between Jordan and the Muslim students. He is placed in isolation, where he argues with PE teacher Steve Bell (Paul Nicholls), who punches Jordan. Jordan believes that he is the father of Candice Murgatroyd's (Emily Pyzer) child, and when she leaves the baby with him, Jordan takes him to school in a gym bag. Chloe Voyle (Fern Deacon) discovers the baby, and helps him to escape class to care for it. Jordan shows the baby to Steve, and confides in him that he does not think he is the father. Feeling guilty for punching him, Steve buys him a paternity test for the baby, and it is confirmed that he is not the father; Cory is. In series two, he is abused by his father, and moves out. He begins delivering drugs to fund his lifestyle, and when pastoral care teacher Samir Qureshi (Arsher Ali) discovers what he is doing, he shows Jordan that boxing can be a better source of entertainment for him. Trying to defend Jordan to the drug dealer, Samir is stabbed and dies. Jordan moves back in with Kevin and Cory, but later decides to leave the school and town to attend art college.", "Emma Keane (portrayed by Liz White) is the mother of Chloe Voyle (Fern Deacon), and an English teacher at Ackley Bridge College. Emma arrives late to headteacher Mandy Carter's (Jo Joyner) staff meeting, who is a friend from her previous school. She also meets Samir Qureshi (Arsher Ali), with whom she had a relationship with in university. Mandy oversees her English lesson, where daughter Chloe Voyle (Fern Deacon) shows up drunk and vomits in her classroom. Chloe informs her that her father Nik (Stuart Manning) no longer wants to care for her, so she has taken an Uber across the country. When Emma plans for her to go back to Nik and scolds her for getting drunk, Chloe posts a photo of Emma topless on social media. She is called in by Mandy, who informs her that the image has damaged the reputation of the school. Chloe apologises for posting the photo, and Emma explains that she felt she would not be good at motherhood. Emma worries about student Missy Booth (Poppy Lee Friar), who she knows from a previous school. When Missy acts strangely school, Emma questions her, and Missy asks her for a large sum of money. She explains that her grandmother has died, but asks her not to inform social services, otherwise her sister will put into foster care. Emma affirms that she has a responsibility to tell social services, but waits until they have cremated her grandmother. When the Booth family have a hearing for Hayley's custody, she tries to attend, but Mandy stops her from doing so. Chloe begins to feel neglected by Emma, since she is paying a lot of attention to Missy. She then reveals to Emma that she has a boyfriend, who is in his thirties. Emma goes to her boyfriend's place of work and exposes him for dating a teenager. Emma learns that Samir is engaged to Maryam (Kiran Landa/Meryl Fernandes), but the pair begin an affair regardless. When Samir marries Maryam, they continue their affair. Samir is stabbed, and Emma takes time from work to deal with the grief. She tries to find the man responsible for his death, but is unsuccessful in doing so. When the Valley Trust take over the school, Emma is replaced by Martin Evershed (Rob James-Collier). She returns to the town after hearing Missy has died, to attend a ceremony for her. Mandy begs her to return to the school, but she affirms that she is unsure what to do with her career.", "Samir Qureshi (portrayed by Arsher Ali) is the community liaison officer at Ackley Bridge College. Samir is engaged to Maryam (Kiran Landa/Meryl Fernandes), but despite this, he begins an affair with English teacher Emma Keane (Liz White). The pair know each other from dating in university, and rekindle their love. Despite having doubts, Samir marries Maryam. When he discovers that former friend Khadim Afzal (Jonas Khan) is forcing student Jordan Wilson (Samuel Bottomley) to deal drugs, he intervenes by getting Jordan into boxing. Samir punches Khadim, and a video of him doing so is posted online. In return for embarrassing him, Khadim stabs him, and leaves him to die in the street.", "Maryam Qureshi (portrayed by Kiran Landa; series 1 and Meryl Fernandes; series 2) is the partner of Samir (Arsher Ali). She is unaware that he is having an affair with Emma Keane (Liz White), and when she sees Emma outside of her house, she invites her in for tea. Maryam and Samir get married, but he is soon stabbed, and Maryam struggles to grieve for him."]}]}}