{"wiki_id": "http://www.wikidata.org/entity/Q16152015", "itemLabel": "Michael Van Wijk", "itemDescription": "British bodybuilder (born 1952)", "wikipedia_url": "https://en.wikipedia.org/wiki/Michael_Van_Wijk", "wikipedia_page": {"main": "Michael Van Wijk (born 30 September 1952) is an Indian-born English bodybuilder, professional sportsperson, actor and TV presenter. He is most well known for his role as Wolf on British TV endurance sports game show Gladiators, a role he held for eight series (1992–1999).", "link_mentions": [{"page": "Newbiggin-by-the-Sea", "response": ["Until 2004 Newbiggin was host to a street fair that attracted thousands of people every year. In its final years, the fair was set out in the following format: starting at the beginning of the shopping area of Front Street, up to the Cresswell Arms public house flowing into Church Point car park and continuing along the seafront promenade. The lifeboat house and boatyard became the music venue. A stage replaced the boats and the lifeboat house opened its doors, serving food and afternoon tea. Appearances were made by Slade, Leo Sayer and TV show Gladiators star Michael Van Wijk."]}, {"page": "Barbarian: The Ultimate Warrior", "response": ["Instead of using painted artwork for the game's box, Palace Software used photos of hired models. The photos, also used in advertising campaigns, featured Michael Van Wijk (who would later become famous as 'Wolf' in the TV series Gladiators) as the hero and bikini-clad Maria Whittaker, a model who was then associated with The Sun tabloid's Page 3 topless photo shoots. Palace Software's marketing strategy provoked controversy in the United Kingdom, with protests focused on the sexual aspects of the packaging rather than decapitations and other violence within the game. The ensuing controversy boosted Barbarians profile, helping to make it a commercial success. Game critics were impressed with its fast and furious combat, and dashes of humour. The game was Palace Software's critical hit; boosted by Barbarians success, Palace Software expanded its operations and started publishing other developers' work. In 1988, the company released a sequel, Barbarian II: The Dungeon of Drax.", "Feeling that most of the artwork on game boxes at that time were \"pretty poor\", Brown suggested that an \"iconic fantasy imagery with real people would be a great hook for the publicity campaign.\" His superiors agreed and arranged a photo shoot, hiring models Michael Van Wijk and Maria Whittaker to pose as the barbarian and princess. Whittaker was a topless model, who frequently appeared on Page 3 of the tabloid, The Sun. She wore a tiny bikini for the shoot while Van Wijk, wearing only a loincloth, posed with a sword. Palace Software also packaged a poster of Whittaker in costume with the game. Just before release, the company discovered that fellow developer Psygnosis was producing a game also titled Barbarian, albeit of the platform genre. After several discussions, Palace Software appended the subtitle \"The Ultimate Warrior\" to differentiate the two products."]}, {"page": "Maria Whittaker", "response": ["In the late 1980s, she appeared with Michael Van Wijk (also known as Wolf from the Gladiators television show) on the cover of Palace Software's computer games Barbarian: The Ultimate Warrior and Barbarian II: The Dungeon of Drax."]}, {"page": "Salome's Last Dance", "response": ["* Michael Van Wijk as 2nd Soldier"]}, {"page": "Wolf (name)", "response": ["*Michael Van Wijk, known by the pseudonym Wolf on the television series Gladiators"]}, {"page": "List of controversial video games", "response": ["| 1987 || Barbarian: The Ultimate Warrior || Acorn Electron, Amiga, Amstrad CPC, Apple II, Atari ST, BBC Micro, Commodore 64, MS-DOS, ZX Spectrum || Palace Software || The cover art of the game, which featured bikini-clad Maria Whittaker, a model who was then associated with The Sun tabloid's Page Three topless photo shoots, and Michael Van Wijk, who was only wearing a loincloth, provoked outrage in the United Kingdom. Electron User magazine received letters from readers and religious bodies, who called the image \"offensive and particularly insulting to women\" and an \"ugly pornographic advertisement\"."]}, {"page": "Barbarian II: The Dungeon of Drax", "response": ["Palace Software repeated the strategy for the sequel, publishing a poster of Whittaker as Princess Mariana, this time in metal bikini armour, and Michael Van Wijk as the barbarian."]}, {"page": "The Bruce (film)", "response": ["*Michael Van Wijk as Henry de Bohun"]}, {"page": "Michael van Wijk", "response": ["#REDIRECT Michael Van Wijk "]}, {"page": "Wolf (Gladiators)", "response": ["#REDIRECT Michael Van Wijk"]}, {"page": "ITV Specials", "response": ["| Anthony McPartlinDeclan DonnellyJonathan RossVernon KayBruce ForsythRicky WilsonDermot O'LearyAmanda HoldenAlesha DixonPetula ClarkTommy CannonBobby BallMarty WildeUlrika JonssonJohn AndersonMichael Van WijkKim BettsDiane YoudaleWarren FurmanJames CrossleyMike LewisHenry KellyMatthew KellyJon CulshawDebra Stephenson"]}, {"page": "Van Wijk", "response": ["*Michael Van Wijk (born 1952), English bodybuilder, actor and television presenter"]}, {"page": "List of LGBT-related films of 1988", "response": ["|Salome's Last Dance ||  || United StatesUnited Kingdom || Comedy, drama || Glenda Jackson, Stratford Johns, Nickolas Grace, Douglas Hodge, Imogen Millais-Scott, Denis Lill, Russell Lee Nash, Ken Russell, David Doyle, Warren Saire, Kenny Ireland, Michael Van Wijk, Paul Clayton, Imogen Claire and Tim Potter ||"]}, {"page": "Gladiators (1992 British TV series)", "response": ["| Michael Van Wijk"]}, {"page": "Gladiators (2008 British TV series)", "response": ["Wolf (who featured in all eight series of the original Gladiators) returned to be the Gladiators' \"Leader of the Pack\". He featured in all episodes of series 2. His real name is Michael Van Wijk."]}, {"page": "Gladiators (1992 British TV series, series 4)", "response": ["| Michael Van Wijk"]}, {"page": "Gladiators (1992 British TV series, series 7)", "response": ["| Michael Van Wijk", "Two new Gladiators joined the team; Diesel (Darren Crawford) and Vulcan (John Seru). Vulcan joined the UK series after his native Australian series was cancelled, and was brought in to give established bad guy Wolf (Michael Van Wijk) a rival. The total number of Gladiators for this series was reduced to fifteen. Neither Diesel or Vulcan's faces were added to the opening titles of the show."]}, {"page": "Gladiators (1992 British TV series, series 3)", "response": ["| Michael Van Wijk"]}, {"page": "Gladiators (1992 British TV series, series 5)", "response": ["| Michael Van Wijk"]}, {"page": "Gladiators (1992 British TV series, series 2)", "response": ["| Michael Van Wijk"]}, {"page": "Gladiators (1992 British TV series, series 6)", "response": ["| Michael Van Wijk"]}]}}