{"wiki_id": "http://www.wikidata.org/entity/Q16146307", "itemLabel": "Nadia Ali", "itemDescription": "English broadcaster", "wikipedia_url": "https://en.wikipedia.org/wiki/Nadia_Ali_(broadcaster)", "wikipedia_page": {"main": "Nadia Ali (Bengali: নাদিয়া আলী; born 15 November 1984) is an English television and radio presenter of Bangladeshi descent. She is best known for presenting the Sunday evening show on BBC Asian Network.", "link_mentions": [{"page": "BBC Asian Network", "response": ["*Nadia Ali"]}, {"page": "Music programmes on the BBC Asian Network", "response": ["*Nadia Ali - Bengali music, entertainment and news. Every Sunday from 2000–2200."]}, {"page": "Signature (dance group)", "response": ["On 21 May 2016, they performed in one of London's biggest Asian comedy and entertainment events hosted by Studio1 Media. They performed alongside many other notable faces such as; Nadia Ali, Ezza (Ezzakins), Rumena Begum (Rumena_101), Sham Idrees, Karim Metwaly (AreWeFamousNow), Sheikh Akbar, Tasha Tah, Zack Knight, Mumzy Stranger, Char Avell, Shaful Khan, Jernade Miah, Babrul Hoque (Bengali Blitz), Kawsar Ahmed (Kash), Nishat Monsur (Nish), Islah Abdur-Rahman and Michael Truong from the Corner Shop Show, Dulzy Ahmed, Hussnain Lahori, Humza Arshad, Rameet Kaur, Iksy and Bambi Bains (TeamPBN)."]}, {"page": "List of British Bangladeshis", "response": ["* Nadia Ali – Television and radio presenter. Since 2012, she has presented the live Bengali show on Sunday nights for BBC Asian Network."]}, {"page": "Ajmal Masroor", "response": ["In July 2015, Masroor was interviewed by Nadia Ali on BBC Asian Network about his Ramadan memories."]}, {"page": "Suzana Ansar", "response": ["In December 2013, she performed live on BBC Asian Network's Saima Ajram Show. In March 2014, Islam was interviewed by Nadia Ali on BBC Asian Network."]}, {"page": "Saiman Miah", "response": ["In September 2014, Miah was interviewed by Nadia Ali on BBC Asian Network about his design project in Sylhet."]}, {"page": "Sanchita Islam", "response": ["In March 2013, she had a mid-career retrospective at Rich Mix. KAOS (TrActor's sister organisation) awarded her a grant to complete the second scroll project with patients suffering from mental health problems in Brussels 2014. Rich Mix has invited Pigment Explosion again to exhibit this second scroll and write/perform a play about art, madness and disability, the show is scheduled in June 2015. In March of the same year, she was interviewed by Nadia Ali on BBC Asian Network about her exhibition The Rebel Within."]}, {"page": "Shama Rahman", "response": ["In October 2013, Rahman was interviewed by Nadia Ali on BBC Asian Network."]}, {"page": "Munsur Ali", "response": ["In February, March and June 2014, he was interviewed by Nadia Ali on BBC Asian Network."]}, {"page": "Ali Jacko", "response": ["In August 2015, Ali started receiving vocal training. On 4 November 2015, Ali's debut single \"Give My Love A Brand New Name\" was released by record label LBE Music Group. The music video was shot in London, conceptualised by Talvin Singh. and features supermodel and television personality Jodie Kidd. His debut album is due to be released in 2016. In December of the same year, he was interviewed by Nadia Ali on BBC Asian Network."]}, {"page": "Rahima Begum", "response": ["In May 2014, Begum was interviewed by Nadia Ali on BBC Asian Network about the Rohingya migrant crisis."]}, {"page": "Dilruba Yasmeen Ruhee", "response": ["In June 2014, Ruhee was interviewed by Nadia Ali on BBC Asian Network. In September 2015, she will host the London Bengali Film Festival (LBFF)."]}, {"page": "Riaz Amin", "response": ["In September 2014, Amin was interviewed by Nadia Ali on BBC Asian Network."]}, {"page": "Leesa Gazi", "response": ["In May 2014, Gazi was interviewed by Nadia Ali on BBC Asian Network."]}, {"page": "Corner Shop Show", "response": ["*Nadia Ali as Mum: Malik's mother"]}, {"page": "List of Corner Shop Show characters", "response": ["*Nadia Ali as Mum: Malik's mother. She's as strict as it gets! She has a habit of telling Malik off all the time, she spends most of her time at home watching Indian soap dramas & tracking down the aunties who didn't return her containers!", "*Nadia Ali as Mum"]}, {"page": "Aminul Hoque (writer)", "response": ["In February 2015, he contributed in a discussion regarding the three British schoolgirls from Bethnal Green Academy who left home to join the Islamic State of Iraq and the Levant on BBC Radio Scotland and BBC Radio 4. In the same month, he spoke at the London Festival of Education, hosted by the Institute of Education. In April of the same year, he was interviewed by Nihal on BBC Asian Network. In May of the same year, he contributed on BBC Radio 4's Today programme. In July 2015, he was interviewed by Nadia Ali on BBC Asian Network about his Ramadan memories and the British Bangladeshi community."]}, {"page": "Khiyo", "response": ["In August 2014, the band self-released their Khiyo|self-titled debut album with a launch at the Forge in Camden Town, London. The album (which was recorded over seven years) combines grungy rhythm-section and acoustic guitars to classic Bangladeshi melodies. In September of the same year, they performed songs from their album live on BBC Asian Network, hosted by Nadia Ali. In August 2015, the album was re-launched by ARC Music."]}, {"page": "Momtaz Begum-Hossain", "response": ["In November 2015, she was interviewed by Nadia Ali on BBC Asian Network."]}, {"page": "Saikat Ahamed", "response": ["In February 2015, Ahamed was interviewed on BBC Somerset. In November and December 2015, he was interviewed by Nadia Ali on BBC Asian Network."]}, {"page": "Nadia Ali (actress)", "response": ["Onai Malik (born Onaza Malik; 1991 or 1992), known professionally as Nadia Ali, is a Pakistani-born American former pornographic actress, who worked as an actress from 2015 to 2016.", "Nadia Ali was born in Pakistan in 1991 or 1992 as Onaza Malik. She emigrated to the United States as a child and was raised in New Jersey. She now uses the name Onai Malik. She felt isolated by her family's conservatism although she did not wear a hijab. She was raised as a Muslim and in an interview in July 2016 with Refinery29, she stated that still identified herself as a practicing Muslim. She prays two to three times a day, and said \"I kind of have an internal conflict sometimes. One of the biggest main sins it’s hard to be forgiven for is adultery — having sex without marriage is a sin and doing it multiple times a day as an escort is one of the major sins that you will not be forgiven for, and I am fully aware of that, but yeah, I still pray.\""]}, {"page": "Nadia Ali", "response": ["Nadia Ali may refer to:", "*Nadia Ali (singer) (born 1980), American singer", "*Nadia Ali (actress) (born 1991), American pornographic actress", "*Nadia Ali (broadcaster) (born 1984), British broadcaster"]}]}}