{"wiki_id": "http://www.wikidata.org/entity/Q16192792", "itemLabel": "Nicholas Kay", "itemDescription": "British diplomat", "wikipedia_url": "https://en.wikipedia.org/wiki/Nicholas_Kay", "wikipedia_page": {"main": "Sir Nicholas Peter Kay  (born 8 March 1958) is a British diplomat. He has served as the British ambassador to Afghanistan, Sudan and the Democratic Republic of the Congo. From 2013 to 2016 he was the United Nations Special Representative for Somalia.\n\n", "link_mentions": [{"page": "Somali Armed Forces", "response": ["In early March 2014, Somali security forces and AMISOM troops launched another operation against Al-Shabaab in southern Somalia. According to Prime Minister Abdiweli Sheikh Ahmed, the government subsequently launched stabilization efforts in the newly liberated areas, which included Rab Dhuure, Hudur, Wajid and Burdhubo. However, there were continuing concerns that not enough was being done to revitalise and secure the newly liberated areas. By 26 March, the allied forces had liberated ten towns within the month, including Qoryoley and El Buur. UN Special Representative for Somalia Nicholas Kay described the military advance as the most significant and geographically extensive offensive since AU troops began operations in 2007."]}, {"page": "South West State of Somalia", "response": ["On 3 March 2014, Madoobe Nuunow was elected president by supporters of the six-region state proposal. Internal and Federal Affairs Minister Abdullahi Godah Barre indicated that the Somali federal government would not recognize the six-region convention outcome, as it contravenes an earlier Jubba agreement signed in Addis Ababa between the Somali federal authorities and the autonomous Jubbaland administration in southwestern Somalia. The Jubba agreement stipulates that Jubaland's constituent provinces are instead to be administered by the Jubaland regional authorities. Addressing the 425th meeting of the AU Peace and Security Council on 25 March 2014, UN Special Representative for Somalia Nicholas Kay similarly indicated that he would continue to work closely with the AU, EU and IGAD to support a Somali federal government-led three-region state formation process for the southwestern provinces.", "On 23 June 2014, President of Somalia Hassan Sheikh Mohamud, Prime Minister Abdiweli Sheikh Ahmed, and Parliament Speaker Mohamed Osman Jawari oversaw a ceremony in Mogadishu marking the merger of the two competing administrations into a single three-region state, which is to be composed of the Bay, Bakool and Lower Shabelle  provinces. The pact stipulates that the new polity will be led by an Interim South West Administration consisting of representatives from both sides. According to an official press communique, the opposing sides are slated to form a thirteen-member technical committee, appointing five members apiece to the body alongside three members selected by the Federal Government. The panel is then within ten days scheduled to prepare a roadmap for the interim administration's formation. Additionally, the Federal Government is to facilitate consultations between the Interim South West Administration and Jubaland over mutual concerns and interests. The UN Special Representative for Somalia Nicholas Kay, the UN Secretary-General Ban Ki-Moon, the Special Representative of the Chairperson of the African Union Mission Commission for Somalia Mahamat Saleh Annadif, and the U.S. Special Representative for Somalia James P. McAnulty all welcomed the Southwestern State of Somalia agreement, commended the principals on their constructive consultations, acknowledged the Federal Government's key role in facilitating the talks, and pledged to continue supporting the local post-conflict reconstruction process. On 25 June 2014, the federal cabinet unanimously approved the signed accord.", "In September 2014, Parliament Speaker Mohamed Osman Jawari and UN Special Representative for Somalia Nicholas Kay visited Baidoa to finalize talks over the South West state's formation. Jawari subsequently announced that a reconciliation conference would be held in the city on 14 September to unify the competing three-region and six-region local administrations. Prime Minister Abdiweli Sheikh Ahmed opened the summit, which was attended by Lower Shabelle, Bay and Bakool provincial representatives, clan elders and politicians.", "In October 2014, President Mohamud opened a state formation conference in Baidoa for the three-region Southwestern State of Somalia. The UN-financed summit was attended by 380 delegates from the state's constituent Bay, Bakool and Lower Shabelle provinces, as well as UN Envoy to Somalia Nicholas Kay, IGAD Envoy to Somalia Mohamed Abdi Affey, and the Ambassador of Denmark to Somalia, among other officials. On 7 November 2014, the Southwestern State of Somalia was established, following the conclusion of the two-week Baidoa conference. The delegates from the new regional state's constituent Bay, Bakool and Lower Shabelle provinces unanimously agreed to make Barawe its capital. They also approved a new regional state constitution. On 17 November 2014, former Parliament Speaker Sharif Hassan Sheikh Adan was elected President of the three-region Southwestern State of Somalia."]}, {"page": "Somali Civil War", "response": ["In early March 2014, AMISOM, supported by Somali militias, launched another operation to remove Al-Shabaab from its remaining areas of control in southern Somalia. According to Prime Minister Abdiweli Sheikh Ahmed, the government subsequently launched stabilization efforts in the newly liberated areas, which included Rab Dhuure, Hudur, Wajid and Burdhubo. The Ministry of Defense provided ongoing reassurance and security to local residents, and supplied logistical and security support. Additionally, the Ministry of Interior was prepared to support and put into place programs to assist local administration and security. A Deputy Minister and several religious scholars were dispatched to all four towns to coordinate and supervise the federal government's stabilization initiatives. By March 26, the allied forces had liberated ten towns, including Qoryoley and El Buur. UN Special Representative for Somalia Nicholas Kay described the military advance as the most significant and geographically extensive offensive since AU troops began operations in 2007."]}, {"page": "List of Old Abingdonians", "response": ["thumb|150px|Nicholas Kay", "* Sir Nicholas Kay KCMG (born 1958), British diplomat"]}, {"page": "Augustine Mahiga", "response": ["Mahiga's term as the UN Special Representative for Somalia ended on 3 June 2013. Secretary General Ban Ki-Moon commended him on his close work with the Somali authorities, which saw the end of the transitional period and the establishment of a permanent Federal Government of Somalia. UK diplomat Nicholas Kay was concurrently appointed as Mahiga's replacement."]}, {"page": "List of ambassadors of the United Kingdom to Afghanistan", "response": ["* 2017–2018: Sir Nicholas Kay"]}, {"page": "Abdirahman Farole", "response": ["UN Special Representative for Somalia Nicholas Kay likewise noted that Puntland was spearheading Somalia's ongoing federalisation, and hailed the region's MPs, Speaker and traditional leaders for their respective roles in the election process. He also commended former Puntland President Farole for the latter's constructive role and peaceful transfer of power. Additionally, the US Special Representative for Somalia James P. McAnulty issued a statement saluting Puntland residents for having conducted the ballot in a democratic manner. McAnulty also paid tribute to Farole for his many achievements during his tenure, including his emphasis on security and his key role in the Roadmap federal transition process."]}, {"page": "Omar Sharmarke", "response": ["On 12 January 2015, Sharmarke announced his new Federal Cabinet, consisting of 26 ministers, 25 deputy ministers, and 8 state ministers. Many ministers were retained from the previous Ahmed administration. Sharmarke indicated that he selected the new Council of Ministers after intensive consultations with local stakeholders, with the aim of balancing the public interest with governmental continuation and administrative priorities. On 17 January 2015, Prime Minister Sharmarke dissolved his newly nominated cabinet due to vehement opposition by legislators, who rejected the reappointment of certain former ministers. At Sharmarke's behest, the Federal Parliament concurrently granted him a time extension to engage in further consultations before he was to select a new Council of Ministers. On 27 January 2015, Sharmarke appointed a new, smaller 20 minister Cabinet. UN Special Representative for Somalia Nicholas Kay and US Special Representative for Somalia James P. McAnulty both welcomed the new appointments, emphasized the importance of working towards the Vision 2016 political benchmarks, and reaffirmed their continued support for the Somali federal government. On 31 January, the Federal Parliament granted Sharmarke an additional 10 days to finalize his cabinet before deliberation. 139 MPs voted in favour of the time extension, 47 rejected it, and 4 abstained. On 6 February, Sharmarke finalized his cabinet, consisting of 26 ministers, 14 state ministers, and 26 deputy ministers. Federal legislators later approved the new Council of Ministers on 9 February, with 191 voting in favor it, 22 against it, and none abstaining. The UN, AU, EU, IGAD and US and UK governments all applauded the announcement, and reemphasized the importance of working toward the Vision 2016 benchmarks."]}, {"page": "Abdiweli Gaas", "response": ["On 25 January 2014, Puntland President Ali and Vice President Abdihakim Abdullahi Haji Omar were officially inaugurated into office at a ceremony at the state capital Garowe. The event was attended by a number of dignitaries, including former Puntland Presidents Abdirahman Mohamed Farole and Mohamud Muse Hersi, Jubaland President Ahmed Mohamed Islam (Madobe), Galmudug President Abdi Hasan Awale Qeybdiid, former Prime Minister of Somalia Ali Mohammed Ghedi, federal MPs, ambassadors from Djibouti, Ethiopia and Turkey, UN Special Representative for Somalia Nicholas Kay, members of the Somali expatriate community and Puntland public, and US, AU and IGAD representatives. In his inaugural speech, Ali outlined his intention to prioritize the security sector in order to create an environment conducive for investment. He also indicated that his administration would facilitate commercial development and trade by renovating and growing the region's existing transport infrastructure, and would seek to tap into Puntland's natural resources through inclusive cooperation. Additionally, Ali pledged to deliver social services in the areas of free education, health and women's development, and highlighted the importance of strengthening relations with the federal government. He likewise gave a 100-day window for the unity conference for Puntland's various constituencies, vowing to revive the \"spirit of 1998\" when Puntland state was established.", "The three-day meeting concluded with a 12-point agreement between the stakeholders, with UN envoy to Somalia Ambassador Nicholas Kay, EU Ambassador Michele Cervone d'Urso, IGAD representative Mohamed Abdi Afey, and Ethiopian Consul General Asmalash Woldamirat serving as witnesses. According to federal Minister of Culture and Higher Education Duale Adan Mohamed, the pact stipulates that the recent tripartite agreement between Galmudug and Himan and Heeb establishing a new central regional state within Somalia only applies to the Galguduud and south Mudug provinces. In keeping with a 2013 pact signed by former Prime Minister of Somalia Abdi Farah Shirdon and former Puntland President Abdirahman Mohamed Farole, the Garowe bilateral agreement also states that the Federal and Puntland authorities will work together to form a united and inclusive national army. Additionally, parliamentary committees consisting of Federal and Puntland representatives are mandated with ensuring equitable distribution of foreign assistance and overseeing eventual talks pertaining to the Provisional Constitution. Ambassador Kay welcomed the agreement and urged both parties to work for the public interest, and IGAD representative Afey likewise hailed the reconciliation effort."]}, {"page": "Mohamed Osman Jawari", "response": ["In March 2015, Federal Parliament Speaker Jawari met with UN Special Representative for Somalia Nicholas Kay and the ambassadors of Djibouti, Sweden and Switzerland in Mogadishu. The officials discussed various matters of mutual interest, among which were bilateral ties and how best to attain the Vision 2016 political roadmap's benchmarks. Additionally, the representatives touched on the Federal Parliament's duties and tasks, with the diplomats urging the legislature to pass any remaining laws that will facilitate the realization of Vision 2016. They also pledged to continue working alongside the Somali central government and to support its reconstruction and development initiatives."]}, {"page": "Mahad Abdalle Awad", "response": ["The three-day meeting concluded with a 12-point agreement between the stakeholders, with UN envoy to Somalia Ambassador Nicholas Kay, EU Ambassador Michele Cervone d'Urso, IGAD representative Mohamed Abdi Afey, and Ethiopian Consul General Asmalash Woldamirat serving as witnesses. According to federal Minister of Culture and Higher Education Duale Adan Mohamed, the pact stipulates that the recent tripartite agreement between Galmudug and Himan and Heeb establishing a new central regional state within Somalia only applies to the Galguduud and south Mudug provinces. In keeping with a 2013 pact signed by former Prime Minister of Somalia Abdi Farah Shirdon and former Puntland President Abdirahman Mohamed Farole, the Garowe bilateral agreement also states that the Federal and Puntland authorities will work together to form a united and inclusive national army. Additionally, parliamentary committees consisting of Federal and Puntland representatives are mandated with ensuring equitable distribution of foreign assistance and overseeing eventual talks pertaining to the Provisional Constitution. Ambassador Kay welcomed the agreement and urged both parties to work for the public interest, and IGAD representative Afey likewise hailed the reconciliation effort."]}, {"page": "Hassan Sheikh Mohamud", "response": ["In August 2013, the Somali federal government signed a national reconciliation agreement in Addis Ababa with the autonomous Jubaland administration based in southern Somalia. Endorsed by the federal State Minister for the Presidency Farah Abdulkadir on behalf of Hassan, the pact was brokered by the Foreign Ministry of Ethiopia and came after protracted bilateral talks. Under the terms of the agreement, Jubaland will be administered for a two-year period by a Juba Interim Administration and led by the region's incumbent president, Ahmed Mohamed Islam (Madobe). The regional president will serve as the chairperson of a new Executive Council, to which he will appoint three deputies. Management of Kismayo's seaport and airport will also be transferred to the Federal Government after a period of six months, and revenues and resources generated from these infrastructures will be earmarked for Jubaland's service delivery and security sectors as well as local institutional development. Additionally, the agreement includes the integration of Jubaland's military forces under the central command of the Somali National Army (SNA), and stipulates that the Juba Interim Administration will command the regional police. UN Special Envoy to Somalia Nicholas Kay hailed the pact as \"a breakthrough that unlocks the door for a better future for Somalia,\" with AUC, UN, EU and IGAD representatives also present at the signing.", "On 24 November 2013, 168 MPs led by former TFG Parliament Speaker Sharif Hassan Sheikh Adan endorsed a document submitted to parliament, which outlined a motion against Prime Minister Shirdon's administration. A parliamentary vote of confidence was later held against Shirdon on 2 December 2013. Parliament Speaker Mohamed Osman Jawari subsequently announced that 184 of the present MPs had voted against Shirdon, whereas 65 legislators had voted to retain him. On 5 December 2013, Shirdon released a statement confirming that he and his Cabinet accepted the legislature's decision. UN Special Representative for Somalia Nicholas Kay paid tribute to the outgoing Prime Minister, noting that Shirdon had endeavoured to promote growth and progress and was an important principal in establishing the New Deal Compact between Somalia and its international partners. He also commended the legislators on adhering to procedural rules during the vote, and pledged to work constructively with the succeeding administration.", "On 27 October, UN Special Envoy to Somalia Nicholas Kay met with Hassan and Ahmed at the Villa Somalia compound in an unsuccessful attempt to broker an agreement between the two officials. Puntland Information Minister Abdiweli Hirsi Abdulle also suggested that the row should be resolved through constitutional means, asserted that the Puntland regional administration was prepared to mediate between the two federal leaders, and called on international representatives to do the same. Similarly, Speaker of the Federal Parliament Mohamed Osman Jawari indicated that he was confident that the disagreement could be resolved through legal channels.", "In January 2015, Hassan signed the UN Convention on the Rights of the Child on behalf of the Federal Republic of Somalia at a ceremony in Mogadishu. It is the most widely ratified global human rights treaty, with all but two countries party to it. The signing event was held at the Hamar Jab Jab School in the capital and was attended by various domestic and international officials, including Interim Minister for Information Mustaf Sheikh Ali Dhuhulow, Interim Minister for Women and Human Rights Khadijo Mohamed Diriye, Interim Minister for Agriculture Abdi Mohamed Bafo, Interim Minister for Justice Farah Sheikh Abdulkadir, various federal legislators, UN Special Representative for Somalia Nicholas Kay, and UNICEF Representative for Somalia Steven Lauwerier. The Federal Parliament had already ratified the agreement in December 2014. Following the subsequent signing of the treaty by Hassan, the Federal Government is now slated to formulate and adopt child friendly systems and policies, implement steps geared toward child development, survival, protection and participation, and produce periodic reports on its progress toward that end for the Committee on the Rights of the Child."]}, {"page": "Abdi Farah Shirdon", "response": ["On 2 December 2013, a parliamentary vote of confidence was held against Shirdon. Parliament Speaker Jawari subsequently announced that 184 of the present MPs had voted against the Prime Minister, whereas 65 legislators had voted to retain him.\"Somali parliament impeaches Prime minister Shirdon\", Hiiraan.com, on 2 December 2013. On 5 December 2013, Shirdon released a statement confirming that he and his Cabinet accepted the legislature's decision. He also expressed disappointment that he had not been allowed to address parliament, and urged the citizenry to support the incoming administration in order build on the development gains that had been achieved during his tenure. UN Special Representative for Somalia Nicholas Kay paid tribute to the outgoing Prime Minister, noting that Shirdon had endeavoured to promote growth and progress and was an important principal in establishing the New Deal Compact between Somalia and its international partners. He also commended the legislators on adhering to procedural rules during the vote, and pledged to work constructively with the succeeding administration. On 12 December 2013, President Mohamud named Abdiweli Sheikh Ahmed as the new Prime Minister."]}, {"page": "Jubaland", "response": ["On 28 August 2013, the autonomous Jubaland administration signed a national reconciliation agreement in Addis Ababa with the Somali federal government. Endorsed by the federal State Minister for the Presidency Farah Abdulkadir on behalf of President Hassan Sheikh Mohamud, the pact was brokered by the Foreign Ministry of Ethiopia and came after protracted bilateral talks. Under the terms of the agreement, Jubaland will be administered for a two-year period by a Juba Interim Administration and led by the region's incumbent president, Ahmed Mohamed Islam. The regional president will serve as the chairperson of a new Executive Council, to which he will appoint three deputies. Management of Kismayo's seaport and airport will also be transferred to the Federal Government after a period of six months, and revenues and resources generated from these infrastructures will be earmarked for Jubaland's service delivery and security sectors as well as local institutional development. Additionally, the agreement includes the integration of Jubaland's military forces under the central command of the Somali National Army (SNA), and stipulates that the Juba Interim Administration will command the regional police. UN Special Envoy to Somalia Nicholas Kay hailed the pact as \"a breakthrough that unlocks the door for a better future for Somalia,\" with AUC, UN, EU and IGAD representatives also present at the signing."]}, {"page": "NATO Senior Civilian Representative in Afghanistan", "response": ["*2019-2020: Ambassador Nicholas Kay, (United Kingdom)"]}, {"page": "2014 Puntland presidential election", "response": ["On 29 December 2013, incumbent President of Puntland Abdirahman Mohamed Farole and his predecessor Mohamud Muse Hersi (Adde) met privately at the State House in Garowe to discuss the 2014 election process. Hersi subsequently announced at a joint press conference attended by Puntland Security Committee chairman Said Dheere and Nuradin Aden Dirie, senior adviser to UN Special Envoy to Somalia Ambassador Nicholas Kay, that the two presidential leaders agreed that credible elections would be held and that both averred to work with the victorious candidate. Hersi also stated that he would support the Vetting and Conflict Resolution Committee's parliamentary selections, and commended the Puntland administration, security chief Dheere and UN officials for their cooperation to strengthen security. Additionally, Farole appealed to the general public to uphold the peace, unity and solidarity in Puntland.", "UN Special Representative for Somalia Nicholas Kay likewise congratulated Ali on his win. Noting that Puntland was spearheading Somalia's ongoing federalization, Kay hailed the region's MPs, Speaker and traditional leaders for their respective roles in the election process. He also commended former Puntland President Farole for the latter's constructive role and peaceful transfer of power. Additionally, the European Union Special Envoy to Somalia Michele Cervone d'Urso described the vote as a positive development for Somalia's democratisation process and urged national reconciliation. The US Special Representative for Somalia James P. McAnulty in turn issued a statement welcoming Ali's election as Puntland President, and saluting Puntland residents for having conducted the ballot in a democratic manner. McAnulty also paid tribute to Farole for his many achievements during his tenure, including his emphasis on security and his key role in the Roadmap federal transition process."]}, {"page": "Abdiweli Sheikh Ahmed", "response": ["On 21 December, legislators endorsed the selection, with 239 of the present 243 MPs voting in favor of Ahmed as Premier, two lawmakers voting against, and two abstaining. UN Special Representative for Somalia Nicholas Kay congratulated Prime Minister Ahmed on his appointment and pledged to continue supporting the Federal Government's peace and state-building efforts.", "The US Department of State issued a statement welcoming the offensive by the Somali government troops and AMISOM, and pledging continued logistical, training and equipment support to the broader military campaign by the allied forces. UN Special Representative for Somalia Nicholas Kay also commended the Somali federal authorities on the recent progress in terms of security and development, and emphasized the need for continued and intensified collaboration between the Somali government and its international partners to consolidate those gains.", "The three-day meeting concluded with a 12-point agreement between the stakeholders, with UN envoy to Somalia Ambassador Nicholas Kay, EU Ambassador Michele Cervone d'Urso, IGAD representative Mohamed Abdi Afey, and Ethiopian Consul General Asmalash Woldamirat serving as witnesses. According to federal Minister of Culture and Higher Education Duale Adan Mohamed, the pact stipulates that the recent tripartite agreement between Galmudug and Himan and Heeb establishing a new central regional state within Somalia only applies to the Galguduud and south Mudug provinces. In keeping with a 2013 pact signed by former Prime Minister of Somalia Abdi Farah Shirdon and former Puntland President Abdirahman Mohamed Farole, the Garowe bilateral agreement also states that the Federal and Puntland authorities will work together to form a united and inclusive national army. Additionally, parliamentary committees consisting of Federal and Puntland representatives are mandated with ensuring equitable distribution of foreign assistance and overseeing eventual talks pertaining to the Provisional Constitution. Ambassador Kay welcomed the agreement and urged both parties to work for the public interest, and IGAD representative Afey likewise hailed the reconciliation effort.", "On 27 October, UN Special Envoy to Somalia Nicholas Kay met with Mohamud and Ahmed at the Villa Somalia compound in an unsuccessful attempt to broker an agreement between the two officials. Puntland Information Minister Abdiweli Hirsi Abdulle also suggested that the row should be resolved through constitutional means, asserted that the Puntland regional administration was prepared to mediate between the two federal leaders, and called on international representatives to do the same. Similarly, Speaker of the Federal Parliament Mohamed Osman Jawari indicated that he was confident that the disagreement could be resolved through legal channels."]}, {"page": "Philippe Lazzarini", "response": ["In 2003, Lazzarini joined the UN Office for the Coordination of Humanitarian Affairs (OCHA) as Area Coordinator in Mossul, Iraq. From there he went on to serve as Head of Office for OCHA in Angola, Somalia, and in the occupied Palestinian territory. In 2010, he became the Deputy Director of the Coordination and Response Division for OCHA and in 2013 he was appointed, under the leadership of Nicholas Kay, as the Deputy Special Representative of the Secretary-General, UN Resident and Humanitarian Coordinator and Resident Representative of the United Nations Development Programme (UNDP) in Somalia. On 24 April 2015, United Nations Secretary-General Ban Ki-moon announced the Lazzarini's appointment as his Deputy Special Coordinator for Lebanon, where he also served as Resident and Humanitarian Coordinator and UNDP Resident Representative, succeeding Ross Mountain; in this capacity, he worked under the leadership of successive Special Coordinators Sigrid Kaag (2015-2017), Pernille Dahler Kardel (2017-2019) and Ján Kubiš (2019-2020)."]}, {"page": "Abdihakim Abdullahi Haji Omar", "response": ["On 25 January 2014, Puntland Vice President Omar and President Abdiweli Mohamed Ali were officially inaugurated into office at a ceremony at the state capital Garowe. The event was attended by a number of dignitaries, including former Puntland Presidents Abdirahman Mohamud Farole and Mohamud Muse Hersi, Jubaland President Ahmed Mohamed Islam (Madobe), Galmudug President Abdi Hasan Awale Qeybdiid, former Prime Minister of Somalia Ali Mohammed Ghedi, federal MPs, ambassadors from Djibouti, Ethiopia and Turkey, UN Special Representative for Somalia Nicholas Kay, members of the Somali expatriate community and Puntland public, and US, AU and IGAD representatives.", "The three-day meeting concluded with a 12-point agreement between the stakeholders, with UN envoy to Somalia Ambassador Nicholas Kay, EU Ambassador Michele Cervone d'Urso, IGAD representative Mohamed Abdi Afey, and Ethiopian Consul General Asmalash Woldamirat serving as witnesses. According to federal Minister of Culture and Higher Education Duale Adan Mohamed, the pact stipulates that the recent tripartite agreement between Galmudug and Himan and Heeb establishing a new central regional state within Somalia only applies to the Galguduud and south Mudug provinces. In keeping with a 2013 pact signed by former Prime Minister of Somalia Abdi Farah Shirdon and former Puntland President Abdirahman Mohamed Farole, the Garowe bilateral agreement also states that the Federal and Puntland authorities will work together to form a united and inclusive national army. Additionally, parliamentary committees consisting of Federal and Puntland representatives are mandated with ensuring equitable distribution of foreign assistance and overseeing eventual talks pertaining to the Provisional Constitution. Ambassador Kay welcomed the agreement and urged both parties to work for the public interest, and IGAD representative Afey likewise hailed the reconciliation effort."]}, {"page": "Abdirahman Duale Beyle", "response": ["In February 2014, Beyle and UN Special Representative for Somalia Nicholas Kay signed a bilateral agreement outlining the terms of future cooperation between the Somali federal government and the United Nations. According to Beyle, the pact came after extensive consultations between both parties. Along with attorneys, President Hassan Sheikh Mohamud attended the signing of the agreement, which he commended for helping to strengthen cooperation between the Somali authorities and the UN."]}, {"page": "Duale Adan Mohamed", "response": ["The three-day meeting concluded with a 12-point agreement between the stakeholders, with UN envoy to Somalia Ambassador Nicholas Kay, EU Ambassador Michele Cervone d'Urso, IGAD representative Mohamed Abdi Afey, and Ethiopian consul General Asmalash Woldamirat serving as witnesses. According to federal Minister of Culture and Higher Education Mohamed, the pact stipulates that the recent tripartite agreement between Galmudug and Himan and Heeb establishing a new central regional state within Somalia only applies to the Galguduud and south Mudug provinces. In keeping with a 2013 pact signed by former Prime Minister of Somalia Abdi Farah Shirdon and former Puntland President Abdirahman Mohamed Farole, the Garowe bilateral agreement also states that the Federal and Puntland authorities will work together to form a united and inclusive national army. Additionally, parliamentary committees consisting of Federal and Puntland representatives are mandated with ensuring equitable distribution of foreign assistance and overseeing eventual talks pertaining to the Provisional Constitution. Ambassador Kay welcomed the agreement and urged both parties to work for the public interest, and IGAD representative Afey likewise hailed the reconciliation effort."]}, {"page": "Hassan Mohamed Hussein", "response": ["In November 2014, Mayor Hussein met with UN Special Representative for Somalia Nicholas Kay in Mogadishu. The two officials discussed a number of bilateral issues, including strengthening municipal security, training local government forces, and engaging the indigent. Hussein also indicated that he and Kay agreed to accelerate ties between the Benadir administration and the UN. Additionally, Kay applauded Hussein for pledging to hold fair city elections."]}, {"page": "Saado Ali Warsame", "response": ["On 23 July 2014, Warsame and her driver were gunned down by unknown assailants in Mogadishu as she was being driven to a hotel. Al-Shabaab claimed responsibility for the attack, which it said was part of its assassination campaign against Somali legislators. President of Somalia Hassan Sheikh Mohamud, Prime Minister Abdiweli Sheikh Ahmed, UN Special Representative for Somalia Nicholas Kay, Ambassador of Germany to Somalia Andreas Peschke, and the U.S. Department of State all issued statements condemning the assassination and expressing condolences to Warsame's family. Somali American community leaders in Minnesota also requested a full investigation by the State Department into her death. Additionally, Prime Minister Ahmed vowed to apprehend the perpetrators. In April 2015, two Al-Shabaab operatives were sentenced to death and later executed for Warsame's assassination and the murder of several other federal officials."]}, {"page": "Central Hotel attack", "response": ["An Al-Shabaab spokesman later claimed responsibility for the attack, asserting that the militants had targeted the officials during prayer-time as retribution for \"apostasy\" and for deploying foreign African Union troops in Somalia. Security subsequently cordoned off the area around the hotel. President of Somalia Hassan Sheikh Mohamoud, the Somali Forum for Unity and Democracy, UN Secretary-General Ban Ki-Moon, UN Special Representative for Somalia Nicholas Kay, OIC Secretary-General Iyad bin Amin Madani, EU High Representative Federica Mogherini, President of the UAE Sheikh Khalifa bin Zayed Al Nahyan, Minister of Foreign Affairs of Canada Rob Nicholson, and US State Department Spokesperson Jen Psaki also issued statements condemning the attack, sent their condolences to the families of the victims, and vowed to continue their reconstructive and developmental work."]}, {"page": "Makka al-Mukarama hotel attack", "response": ["President Hassan Sheikh Mohamud commended the security forces for their competence, described the attack as futile and spineless, and vowed to continue the ongoing reconstruction and development process unimpeded. He also instructed the national security agencies to immediately launch a probe into the attack. Puntland President Abdiweli Mohamed Ali and former Puntland President Abdirahman Farole likewise sent their condolences to Ambassador Ismail's family, and wished the injured parties a rapid recovery. Farole also accused the central government forces of having neglected to effectively protect federal officials. Additionally, UN Special Representative for Somalia Nicholas Kay and AMISOM condemned the attack, and extended their condolences to the families of the victims. U.S. State Department spokeswoman Marie Harf in turn applauded the Somali security forces for their rapid counter-terrorist maneuvers, and reaffirmed her administration's support for the Federal Government of Somalia's development initiatives. The United Nations Human Rights Council also observed a minute of silence in honour of Ismail, with President of the Council Ambassador Joachim Rücker describing the late diplomat as a widely admired and respected leadership figure."]}, {"page": "Yusuf Mohamed Ismail", "response": ["President of Somalia Hassan Sheikh Mohamud, Puntland President Abdiweli Mohamed Ali, former Puntland President Abdirahman Farole, and UN Special Representative for Somalia Nicholas Kay all sent their condolences to the slain diplomat's family. The United Nations Human Rights Council also observed a minute of silence in honour of Ismail. President of the Council Ambassador Joachim Rücker described Ismail as a widely admired and respected leadership figure, whose commitment to global human rights left a tangible impact."]}, {"page": "Garowe attack", "response": ["On 20 April 2015, militants planted a bomb in a UN van in the northeastern city of Garowe, the administrative capital of the autonomous Puntland regional state of Somalia. According to police Colonel Ali Salad, at least seven workers were killed in the ensuing blast, including three Somali nationals, two Kenyans, one Afghan and one Ugandan. Four of the slain officials were UNICEF workers. Police commander Ahmed Abdullahi Samatar suggested that the attacker was among the dead. Additionally, UN Special Representative for Somalia Nicholas Kay indicated that two guards were among the dead. Unconfirmed witness reports suggested that 10 people died. Four Somali nationals, one American, one Sierra Leonean, one Kenyan and one Ugandan were also injured. Police officer Yusuf Ali indicated that the explosive device was lodged under a seat in the vehicle and detonated via remote control."]}, {"page": "Nicholas Peter Kay", "response": ["#REDIRECTNicholas Kay"]}, {"page": "Kay, Nicholas", "response": ["#redirectNicholas Kay"]}, {"page": "Dominic Jermey", "response": ["After a year working on Counter-Extremism, Jermey was again appointed ambassador, this time back to Kabul as Her Majesty's Ambassador to Afghanistan in 2016, succeeding Dame Karen Pierce. At the end of the next year, Jermey was replaced by Sir Nicholas Kay and took up his appointment at ZSL following on from the 13-year tenure of Ralph Armond."]}, {"page": "Abdirahman Abdishakur Warsame", "response": ["After the formation of the Federal Government of Somalia in 2012, Abdirahman became a policy advisor to President Hassan Sheikh Mohamed. He was a leading member of the London conference. He also played a part in the agreement signed between the federal government and Jubbaland. He served as a political adviser to two consecutive UN envoys to Somalia, Ambassador Nicholas Kay and Michael Keating."]}, {"page": "Presidency of Hassan Sheikh Mohamud", "response": ["In November 2013, President Mohamud asked Prime Minister Shirdon to resign from office on the grounds that Shirdon was allegedly ineffective in the job. Mohamud was reportedly acting on the advice of the State Minister for Presidency, Farah Abdulkadir. On 12 November 2013, Shirdon confirmed that there was a dispute between himself and the president, but indicated that the row was constitutional rather than political. He also asserted that the matter should be resolved in parliament. According to MP Mohamed Abdi Yusuf, the rift between Mohamud and Shirdon centered over through what constitutional mechanism and by whom the Cabinet was ultimately to be formed. On 24 November 2013, 168 MPs led by former TFG Parliament Speaker Sharif Hassan Sheikh Adan endorsed a document submitted to parliament, which outlined a motion against Prime Minister Shirdon's administration. A parliamentary vote of confidence was later held against Shirdon on 2 December 2013. Parliament Speaker Mohamed Osman Jawari subsequently announced that 184 of the present MPs had voted against Shirdon, whereas 65 legislators had voted to retain him. On 5 December 2013, Shirdon released a statement confirming that he and his Cabinet accepted the legislature's decision. UN Special Representative for Somalia Nicholas Kay paid tribute to the outgoing Prime Minister, noting that Shirdon had endeavoured to promote growth and progress and was an important principal in establishing the New Deal Compact between Somalia and its international partners. He also commended the legislators on adhering to procedural rules during the vote, and pledged to work constructively with the succeeding administration. "]}]}}