{"wiki_id": "http://www.wikidata.org/entity/Q16105410", "itemLabel": "Olufemi Majekodunmi", "itemDescription": "British architect", "wikipedia_url": "https://en.wikipedia.org/wiki/Olufemi_Majekodunmi", "wikipedia_page": {"main": "Olufemi Adetokunbo Majekodunmi (born 1 May 1940) is a British-Nigerian architect.\n\n", "link_mentions": [{"page": "University of Lagos", "response": ["* Olufemi Majekodunmi"]}, {"page": "Jane Drew", "response": ["a poem, Rowfant Lake, for Jane Sir Hugh Casson, Cedric Price, Baroness Lee, Delia Tyrwhitt,Delia Tyrwhitt first met Jane and Max in Chandigarh in 1953 Lord Reilly,Sir Paul Reilly, Director of the Design Council Lord Elwyn-Jones, William MacQuitty, Arnold Whittick,Arnold Whittick was an art and architectural historian Elizabeth and Mervyn Dalley,Mervyn Dalley (CMG, MA (Cantab)) and his wife, Elizabeth, first met Jane in Iran at Masjid-i-Suleiman, when Jane stayed with them; they remained friends, and years later Jane converted their old rectory house in England. Mervyn Dailey wrote a note on Jane's work in Iran Romi Khosla,Romi Khosla (BA (Cantab), AA Dipl.), son of High Court Judge G. D. Khosla (a friend of Jawaharlal Nehru), was an accountant who, under Jane's guidance switched careers to architecture Roz Jacobs,Roza Jacobs was Vice President and Fashion Director of Macy's store in New York \"...a good and loyal friend\" Noma Copley,Noma Copley was a jewellery designer, earlier married to the painter William Copley Kenane Barlow,Kenane Barlow (wife of Peter Barlow) \"and the five Barlows\" wrote Jane an affectionate poem. Peter had met Jane on the Torbay express to London Sergei Kadleigh,Sergei Kadleigh (AA Dipl. (Hons), ARIBS) was a Russian-born British architect Maria Luisa Plant Zaccheo,Maria Luisa Plant Zaccheo, (Dr. Arch.(Rome), ARIBA) was an associate in Jane's office 1971–1980 Lord Goodman, Lady Jean Medawar,Jean Medawar was a pioneer in family planning; Jane designed the Margaret Pyke Centre for her Arunendu Das,Arun Das worked in Jane's office on the Margaret Pyke Centre J.R. Bhalla,Jai Rattan Bhalla, (FRIBA, FHS, FVI, HFAIA) was President of the Indian Institute of Architects. Although not involved in the Chandigarh project, he was appreciative of Jane's interest in the training of young Indian architects The Lord Perry,Walter Laing Macdonald Perry, Lord Perry of Walton (OBE, FRSE), was a pharmacologist and vice-chancellor of the Open University (1921–2003). Lord Perry was instrumental in the planning of the Open University and Jane was his development architect Victor Pasmore, Mike Lacey,Mike Lacey was Director of Lovell Construction on the OU project at Milton Keynes Nigel Wood,Nigel Wood (MA, C.Eng., MICE, MCIOB) was a craftsman builder who worked for Jane on the OU project at Milton Keynes, St Pauls Girls' School, Carlton House Terrace and Jane's own flat and offices Peter Greenham,Peter Greenham (CBE, RA, PPRBA) was a renowned portrait painter Sunita Kanvinde,Sunita Kanvinde was a student of painting and graphics in Delhi and was helped by Jane when she came to England Tony Forrest,Tony Forrest (DA (Edin.)) was a building contractor and artist, specialising in combining architecture and landscapes with human elements Heather Brigstocke, Peter Murray, Berthold Lubetkin, Frances Webb Leishman,Frances Webb Leishman was the American wife of a retired British diplomat and merchant banker, and a freelance journalist, who once interviewed Jane for Woman's Hour Robert Bliss,Robert L. Bliss (FAIA) was Dean of Architecture at the University of Utah when, in 1975, she visited Salt Lake City, Utah during her lecture tour of the United States Viren Sahai,Viren Sahai (OBE, DipTP., ARIBA) was born in India, studied architecture, painting and town planning and was Chairman of the Bristol Centre for the Advancement of Architecture Sir John Summerson,Sir John Summerson (CBE, FBA) contributed an extract from an essay on Batty Langley Patrick Harrison,Patrick Harrison (CBE) met Jane while he was secretary of the RIBA Ebenezer Akita,Ebenezer Akita (AA Dip., ARIBA, FGIA) was President of the Ghana Institute of Architects Charles Correa, and Olufemi Majekodunmi.Olufemi Majekodunmi (DARch, ARIBA, FNIA, FIArb) was President of the Nigerian Institute of Architects, and reviewed Jane's work on the University of Ibadan"]}, {"page": "Moses Majekodunmi", "response": ["*Olufemi Majekodunmi                                                                                                 "]}, {"page": "FMA Architects", "response": ["Olufemi Majekodunmi established FMA Architects Ltd in 1973 as Femi Majekodunmi Associates. The firm is one of the foremost architectural firms in Nigeria. It was initially located at Odunlami Street before moving to St Nicholas Building, Lagos Island. Since then, it has expanded and grown its services most especially in Nigeria. The firm has diversified into various forms of architecture, design and construction in projects with the Nigerian government and corporate institutions. The firm currently maintains offices in the cities of Lagos, Nigeria,  Abuja in Nigeria, Pretoria in South Africa and Gaborone in Botswana"]}, {"page": "List of Nigerian architects", "response": ["* Olufemi Majekodunmi"]}]}}