{"wiki_id": "http://www.wikidata.org/entity/Q16107536", "itemLabel": "Brett Usher", "itemDescription": "English actor (1946-2013)", "wikipedia_url": "https://en.wikipedia.org/wiki/Brett_Usher", "wikipedia_page": {"main": "Brett Usher (10 December 1946 – 13 June 2013) was an English actor, writer and ecclesiastical historian. Although he appeared frequently on stage and television, it was as a radio actor that he came to be best known. His many radio roles ranged widely, from farce to Shakespeare and new works. In addition to acting he also wrote for radio.\nAs a historian Usher specialised in English ecclesiastical history of the 16th and 17th centuries, with particular focus on the Puritans. The first part of his study of church and state politics of Elizabeth I's reign,\nWilliam Cecil and Episcopacy 1559–1577, was published in 2003. The second part, Lord Burghley and Episcopacy, 1577–1603, which was nearly complete at the time of Usher's death, was published in 2016.", "link_mentions": [{"page": "Edward Bulwer-Lytton", "response": ["Bulwer-Lytton was portrayed by the actor Brett Usher in the 1978 television serial Disraeli."]}, {"page": "Toad of Toad Hall", "response": ["In the 1960s and 1970s there were annual West End revivals during the Christmas season, with Goolden returning to the part of Mole in every year except one.Herbert, pp. 482–483 Among the actors appearing in the play in London and elsewhere were, in the title role Michael Bates,Herbert, p. 391 Hywel Bennett,Herbert, p. 403 Derek Godfrey,Herbert, p. 658 Nicky Henson,Herbert, p. 723 Michael Hordern,Herbert, p. 745 Paul Scofield,Trewin, p. 8 Ian Wallace,\"Theatres\", The Times, 23 December 1964, p. 11 Michael Williams,Herbert, p. 1257 Peter WoodthorpeHerbert, p. 1269 and Patrick Wymark.\"Toad of Toad Hall\", Royal Shakespeare Company. Retrieved 23 April 2021   Alan Badel and Clive Revill were among those seen as Rat;Herbert, p. 374 and 1059 Badgers included Michael Blakemore, Mark Dignam, John Justin and John Woodvine.Herbert, pp. 420, 553, 794 and 1269 Performers seen in other roles in the play included Beverley Cross, Judi Dench, Ian McKellen, Rita Tushingham and Brett Usher.Herbert, pp. 521, 545, 1199 and 27; and \"Toad of Toad Hall\", Ian McKellen. Retrieved 23 April 2021"]}, {"page": "Guards! Guards!", "response": ["* a 6-episode serial on BBC Radio 4 (23 November  - 28 December  1992) dramatised by Michael Butt and starring John Wood (Vimes), Melvyn Hayes (Nobby), Robert Gwilym (Carrot), Crawford Logan (Vetinari), Helen Atkinson-Wood (Lady Ramkin), Brett Usher (Supreme Grand Master), Martin Jarvis (narrator).The L-Space Web Events: Radio: Guards Guards Retrieved 2009-05-9"]}, {"page": "The Adventure of Silver Blaze", "response": ["\"Silver Blaze\" was dramatised for BBC Radio 4 in 1992 by Bert Coules as an episode of the 1989–1998 radio series starring Clive Merrison as Holmes and Michael Williams as Watson. It featured Jack May as  Colonel Ross, Susan Sheridan as Mrs Straker, Brett Usher as Silas Brown, Terence Edmond as Inspector Gregory, and Petra Markham as Edith."]}, {"page": "The Adventure of the Naval Treaty", "response": ["\"The Naval Treaty\" was dramatised for BBC Radio 4 in 1992 by David Ashton as part of the 1989–1998 radio series starring Clive Merrison as Holmes and Michael Williams as Watson. It featured Patrick Malahide as Percy Phelps, Brett Usher as Lord Holdhurst, Norman Jones as Mr Tangey, and Petra Markham as Miss Tangey."]}, {"page": "Robert Crowley (printer)", "response": ["Crowley began his studies at the University of Oxford in about 1534, and was listed as a demy of Magdalen College on 25 July 1539. He experienced an evangelical conversion about this time which entailed religious convictions more in line with continental Protestant reformers, but quite at odds with the Church of England under Henry VIII and the Act of Six Articles, known to those who chafed under it as \"the whip with six strings\". Magdalen was then \"a hotbed of evangelicals,\" according to Brett Usher. Four of its members during this period became bishops under Elizabeth I, and with Crowley, Lawrence Humphrey was a key leader in the vestments controversy that took place during her reign. Most of the Magdalen evangelicals became exiles under Mary I, and their influence was purged from the college by Stephen Gardiner in 1554.", "Recently an argument has been propounded that Crowley and others like him were patronised by less elevated but still powerful figures, particularly after the reign of Edward VI. In an article for the Foxe's Book of Martyrs Variorum Edition Online, Brett Usher has emphasised the importance of previously neglected work by T. S. Willin on Tudor merchants in London, particularly those associated with the Muscovy Company, which was established early in the reign of Mary I and traces its roots to the Company of Merchant Adventurers. At its inception, Sir George Barne, then Lord Mayor of London, was the principal figure in the Muscovy Company. Barne was praised by Bishop Ridley and prior to becoming bishop of Winchester, Robert Horne preached the funeral sermon for Barne's wife in 1559 after returning from exile on the continent. Barne's nephew and apprentice was Nicholas Culverwell whose younger brother Richard left money at his death in 1586 to Crowley as well as William Charke, Walter Travers, John Field, Thomas Crooke, Nicholas Crane, Thomas Edmonds, William Cheston and Giles Sinclair.", "Earlier, under Henry VIII and Edward VI, the Merchant Adventurers included Thomas Poyntz, brother of Lady Anne Walsh in whose house Crowley had served as tutor. Poyntz was the head of the Merchant Adventurer's house in Antwerp; it was there that he sheltered William Tyndale as his sister had in England. John Foxe's 1563 biography of Tyndale concludes with an account probably written by Thomas Poyntz, and received from him or someone close to him. While Tyndale was with Poyntz in Antwerp, Richard Grafton was there as a merchant adventurer involved with Tyndale's project of publishing an English Bible. John Rogers, the first martyr under Mary I, whose \"Matthew's Bible\" later combined translations by Tyndale and Miles Coverdale, served as chaplain to the English merchants in Antwerp. Some of these merchants, like Grafton, were probably involved in producing and smuggling copies of Tyndale's New Testament and other Protestant texts into England. Another figure in the network of evangelical merchants with ties to Crowley was \"the immensely rich John Quarles\", who was \"twice Master of the Drapers' Company\" and \"a friend and patron of Robert Crowley\". (See Brett Usher, \"Backing Protestantism: the London godly, the exchequer and the Foxe circle\", in David Loades (ed.), John Foxe: an Historical Perspective (Aldershot, 1999), p. 129; T. S. Willan, The Muscovy Merchants of 1555 (Manchester, 1953), p. 118.)"]}, {"page": "Vestments controversy", "response": ["Despite the appearance of a victory for Parker, Brett Usher has argued that national uniformity was an impossible goal due to Parker's political and jurisdictional limitations. In Usher's view, the anti-vestments faction did not perceive a defeat in 1566, and it was not until the Presbyterian movements of the next two decades (which Parker's crackdown helped to provoke) that relations really changed between the state and high-ranking clergy who still sought further changes in the church."]}, {"page": "A Family at War", "response": ["* Brett Usher as Ken Beaumont"]}, {"page": "Disraeli (TV serial)", "response": ["*Brett Usher         - as Edward Bulwer-Lytton, 1st Baron Lytton"]}, {"page": "John Sterne", "response": ["John Sterne was appointed Bishop of Colchester to deputise within the Diocese of Ely under the provisions of the Suffragan Bishops Act 1534 in 1592 and held the post until his death in 1607.British History on-line Educated at Trinity College, CambridgeBrett Usher, ‘Sterne, John (c.1545–1607/8)’, Oxford Dictionary of National Biography, Oxford University Press, 2004 accessed 18 Dec 2008 and ordained in 1554 he was Rector of Stevenage at St Nicholas' Church, then Rickmansworth before his Consecration at All Saints Church, Fulham.British History on-line"]}, {"page": "Archdeacon of Sudbury", "response": ["*March 1576 – 1593 (res.): John Still (became Bishop of Bath and Wells)Brett Usher, ‘Vaughan, Richard (c.1553–1607)’, Oxford Dictionary of National Biography, Oxford University Press, 2004; online edn, Jan 2008 accessed 9 March 2013"]}, {"page": "Scorpion Tales", "response": ["| colspan=\"5\" | Anthony Bate (Sir Robert), Susan Engel (Jean Newman), Christopher Benjamin (Arab), Raad Rawi (Young Arab), Chloe Salaman (Samatha Robinson), Brett Usher (Jeremy Hope), Saul Reichlin (Terrorist)"]}, {"page": "Deaths in June 2013", "response": ["*Brett Usher, 66, English actor, writer and ecclesiastical historian, pancreatic cancer.http://announcements.thetimes.co.uk/obituaries/timesonline-uk/obituary-preview.aspx?n=brett-usher&pid=165418955&referrer=2282"]}, {"page": "Mark Anthony Galliardello", "response": ["Galliardello converted to Christianity, and became a devoted protestant. He is of importance to ecclesiastical historians of the period because of the unusually detailed records he kept as churchwarden of Holy Trinity, Minories. The historian Brett Usher writes, \"His conscientious drudgery provides historians with vital clues to the development of nonconformist activity in London in the aftermath of the vestiarian controversy which divided the capital after March 1566.\" Galliardello became prosperous enough to contribute generously to church funds.Kisby, p. 215 and was praised as of \"most good name and fame and godly report of all his neighbours\"."]}]}}