{"wiki_id": "http://www.wikidata.org/entity/Q16212974", "itemLabel": "Joanna Ruiz", "itemDescription": "British voice actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Joanna_Ruiz", "wikipedia_page": {"main": "Joanna Ruiz (born 1 February 1970) is a British voice actress who has mainly done voice acting for children's television shows. She attended the Royal Welsh College of Music & Drama.", "link_mentions": [{"page": "LazyTown", "response": ["* Pixel () (played by Ronald Binion/Julie Westwood and voiced by Noel MacNeal/Kobie Powell/Chris Knowings/Ronald Binion in the US and Joanna Ruiz in the UK) is an inventor who is passionate about computers and technology. He fixes up all sorts of gadgets to avoid doing physical activities himself. Pixel is not very sociable due to the large amount of time he spends alone, usually playing video games on his computers. He has a crush on Stephanie and finds it difficult to talk to her in early episodes. He represents intelligence and common sense. His house often serves as a meeting spot for the rest of the kids, since it is spacious and contains a television.", "* Trixie () (played by Amanda Maddock/Sarah Burgess/Heather Asch and voiced by Sarah Burgess/Aymee Garcia in the US and Joanna Ruiz in the UK) likes jokes and playing pranks. She tends to make sarcastic remarks about her friends. She refers to Stephanie as \"Pinky\" (due to her outfit and hair color) when trying to get her attention. In the theme song, Trixie loves to draw moustaches over the Meanswell's posters. Trixie represents impatience and a lack of respect for rules."]}, {"page": "Little Robots", "response": ["*Joanna Ruiz - Sparky 2"]}, {"page": "Clifford's Puppy Days", "response": ["*Emily Elizabeth Howard (voiced by Grey DeLisle; Joanna Ruiz in the British version) – 6-year-old owner of Clifford and Daffodil."]}, {"page": "Pororo the Little Penguin", "response": ["* Loopy (voiced by (Hong So-yeong), (Joanna Ruiz in UK and Anna Paik in North America) is a pink female beaver with a love for cooking."]}, {"page": "Meees", "response": ["*Voices: Tamsin HeatleyWayne ForesterJoanna RuizIan Sexon (season 2)Nick Mercer"]}, {"page": "Make Way for Noddy", "response": ["*Tessie Bear (voiced by Joanna Ruiz in the UK and Britt McKillip in the US), a neutral and child-like female teddy bear who is Noddy's best friend, always ready to try something new and help everyone she sees.", "*Martha Monkey (voiced by Joanna Ruiz in the UK and Kathleen Barr in the US), a stuffed monkey with an energetic but bossy tomboy personality.", "*Clockwork Mouse (voiced by Joanna Ruiz in the UK and Kathleen Barr in the US), a perky wind-up toy mouse who sometimes can't help feeling dwarfed by the other inhabitants of Toyland for his size.", "*The Skittles (voiced by Joanna Ruiz, Carrie Mullan and Ben Small in the UK and Teryl Rothery and Chantal Strand in the US), a family of orderly bowling pins.", "*Harvey and Cecilia (voiced by Ben Small and Joanna Ruiz in the UK and the US), two beetles."]}, {"page": "Fifi and the Flowertots", "response": ["*Buttercup is a buttercup. She lives in a \"Milk Bucket House\" with her twin sister Daisy and has a mouse called Cornflower because of his lovely blue colour. Voiced by Joanna Ruiz."]}, {"page": "Miss Spider's Sunny Patch Friends", "response": ["*Joanna Ruiz as Squirt, & Bounce"]}, {"page": "Fireman Sam", "response": ["These episodes used more modern techniques of stop motion claymation including mouths that move with the dialogue. This series featured all the original characters, but also introduced some new faces, such as Tom Thomas, the Australian pilot of the rescue helicopter Wallaby One and the Mountain Rescue 4×4 Jeep, an unnamed photographer/news reporter, and the Flood family; consisting of Mike the Plumber, his wife Helen the Nurse, and their daughter Mandy. Though still loosely based on a Bedford TK, the updated Jupiter has six wheels, with a slightly revised livery and appearance. Venus also received an update, with its design sporting a more generic modern appearance, though not based on any real-life model in particular. The main characters in this series were voiced by John Sparkes, Joanna Ruiz and Sarah Hadland."]}, {"page": "Four Eyes!", "response": ["*Miss Dowager (voiced by Joanna Ruiz) is the strict teacher at Payne Academy. She lavishes praise on the Billingsford twins, whilst looking for any excuse to send Emma and her friends to detention. It is later revealed that the reason she hates Emma so much is because her last boyfriend left her for a woman with the same name.Miss Dowager's Secret"]}, {"page": "Horrid Henry (TV series)", "response": ["| Sour Susan/Goody-Goody Gordon/Gorgeous Gurinder/Bossy Bill/Lisping Lily/Miss Lovely/Singing Soraya/Stuck-Up Steve || Joanna Ruiz || "]}, {"page": "List of Horrid Henry characters", "response": ["In the TV series, he is voiced by Joanna Ruiz and has a Scouse accent. He wears the same clothes and has the same hairstyle as his father. He has appeared in the adaptation of Horrid Henry Goes to Work, Perfect Peter Pumps Up, Horrid Henry Says Goodbye, Perfect Peter’s Perfect Day, Horrid Henry's Skipping Lesson and Horrid Henry Helps Out.", "Gordon is one of Peter's best friends. He is a member of the Best Boys Club and is friends with Tidy Ted and Spotless Sam. He often speaks with a lisp. He is voiced by Joanna Ruiz. Gordon has black hair and dark skin. He wears a mustard-yellow jumper, white undershirt, and blue grey pants.", "Miss Lydia Lovely is Peter's teacher. As her name suggests, she has a gentle nature. She is very proud of Peter's progress and behaviour and is always saying nice things about him to his parents. However, on odd occasions (such as when Peter hands in a \"Why I Hate My Teacher\" essay, which he wrote as \"Why I Love My Teacher\", which Henry edited the night before) she had lost her temper. She is often seen in the library, on library duty when she's in the reading area. During early seasons, she spoke with an Indian accent, which fitted considering she appears to be Asian, however, later on in the series, she speaks with a Welsh accent. She is voiced by Joanna Ruiz.", "Lawrence and Luanne Mulligan give her everything her heart desires. Luanne has dark magenta hair while Lawrence has grey hair. In Horrid Henry on TV Henry gets these parents but then gets kicked out because he sat on Margaret's Dad's Chair. They first appear in Moody Margaret Moves In when Margaret spends a week in Henry's home but misbehaves and is punished. Luanne is voiced by Joanna Ruiz and Lawrence is voiced by Aidan Cook.", "Mr Mossy is Mum's boss, although sometimes Mrs Mossy is shown to be Mum's boss. Mr Mossy also appears in TV series Horrid Henry Changes a Nappy. At the start of Horrid Henry and the Dinner Guests Mr Mossy sabotages all of the tricks of Henry. The Mossys appear to be of black descent and it is revealed at the end of Horrid Henry and the Dinner Guests that Mr Mossy's first name is Timothy in the TV series, although it is given as Reginald in the book. When Mr Mossy was a child he was called \"Terrible Timothy\". Mr. Mossy is voiced by Aidan Cook and Mrs. Mossy is voiced by Joanna Ruiz.", "An Indian girl in Henry's class who loves singing. She even sounds like she's singing when she's talking normally. Soraya wears a yellow blouse with blue pants and orange keds. Voiced by Joanna Ruiz.", "Sour Susan is the arch-enemy of Rude Ralph, and the best friend of Moody Margaret. Mostly, Susan is feisty, immature, sassy and annoying. She is very tomboyish in the way she talks. She always has a sour look on her face and often says \"Yeah, Henry.\" when Margaret offends or annoys him. She acts as a budgie and sidekick to Moody Margaret, but often has fallouts with her. She has a baby sister called Vicious Vicky. In TV Series, she has orange hair and wears a lime dress with dark green effects. In Horrid Henry's Stinkbomb, she joins the Purple Hand Gang, and warns Henry about Margaret's stinkbomb. She is voiced by Joanna Ruiz and portrayed by Helena Barlow.", "Steve is Henry's Stuck up Cousin. Henry calls him \"Stuck-Up\" because of how rich, greedy and spoiled he is compared to him. Once Steve got a taste of his own medicine in Horrid Henry and The Perfect Plane when the park keeper caught him flying his toy plane in the park and he takes it away from Steve and gives it to Mike. In the series 5 episode Horrid Henry’s Class Action, he faces Henry in the School Council election, also In Horrid Henry Eats Out, Henry wins by eating all his snails. Steve is hated by Henry for a particular reason - because he is spoiled and refuses to share with his cousin, Henry. Henry always knows that Steve does not look forward to seeing him, as in Horrid Henry's Christmas, he switched the labels on his and Steve's presents, allowing him to help himself to some presents intended for Steve while Steve gets presents, such as socks, intended for Henry, and in Horrid Henry's Haunted House, he convinced Steve that there was a monster under his bed. In the television series, he speaks with what is seemingly an upper class London accent and has reddish-purple hair. The turtleneck jumper he wears also appears to change colour between episodes - it is light green in most episodes, but is purple in Horrid Henry's Haunted House. He is voiced by Joanna Ruiz in the TV series."]}, {"page": "Clifford the Big Red Dog (2000 TV series)", "response": ["*Emily Elizabeth Howard (voiced by Grey DeLisle Griffin; Joanna Ruiz in the British version): Clifford's 8-year-old owner. Emily Elizabeth adopted Clifford when he was a very small puppy, when her parents gave him to her on her 6th birthday.\"Little Clifford\" 19 September 2000, 6 candles on cake Emily's love apparently caused Clifford to grow enormous, thus starting their new lives on Birdwell Island. Emily was named for creator Norman Bridwell's daughter and based on the imaginary adventures of Bridwell's wife."]}, {"page": "Casper the Friendly Ghost", "response": ["* Joanna Ruiz provided the voice for a British dub in 1991."]}, {"page": "Calon (TV production company)", "response": ["Hana's Helpline is a stop-motion animation series for preschool children, about Hana, a duck who runs a telephone helpline for animals with problems. The principal voices are provided by Arabella Weir, Jonathan Kydd, Joanna Ruiz, Boyd Clack and Caroline Harker with most of the other voices being provided by children."]}, {"page": "The Bopps", "response": ["The Bopps are a children's musical group formed in the south west of England in 2010. Their members are Stan Cullimore, Keith Littler, Mike Cross and Joanna Ruiz.", "Joanna Ruiz has worked as a voice actress and has spent her time providing voice talent work for children's animation. Amongst her works are Make Way for Noddy, Everything's Rosie, Hana's Helpline, Fireman Sam, Horrid Henry and Bananas in Pyjamas. She left the group years later to focus on her voice acting career."]}, {"page": "Keith Littler", "response": ["In 2007, Littler founded the children’s music group The Bopps and went on to develop and appear in the TV series with Stan Cullimore, Michael Cross and Joanna Ruiz for Nickelodeon."]}, {"page": "Wakfu (TV series)", "response": [":Voiced by: Dorothee Pousseo (French); Joanna Ruiz (Season 1-2 & OVAs), Cristina Valenzuela (Season 3) (English)", ":Voiced by: Maryne Bretieaux (French); Joanna Ruiz (English)"]}, {"page": "Emma Tate", "response": ["In 2010, she began to appear with Horrid Henry co-star Joanna Ruiz in Everything's Rosie, voicing the main characters. Ruiz voices the title character while Tate voices Raggles the rabbit. In the 2013 video game Broken Sword 5: The Serpent's Curse, she voices the female lead Nicole Collard and other minor roles. She also provided voices for the Warcraft expansion Battle for Azeroth in 2018."]}, {"page": "Kate & Mim-Mim", "response": ["*Valerie is Kate's mother. Valerie is voiced by Nicole Oliver in North America and Joanna Ruiz in the UK.", "*Boomer is a blue creature, and Lily's younger brother. He is voiced by Maryke Hendrikse in North America and Joanna Ruiz in the UK."]}, {"page": "Moomin (1990 TV series)", "response": ["| Mrs Fillyjonk ||Stacey Gregg (episodes 14–26, 59–78),  Joanna Ruiz (episodes 33–56)||Sumi Shimamoto||Leena Uotila||  rowspan=2 | Carla Rindell||Cris af Enehielm", "| Thingumy and Bob ||Stacey Gregg (Thingumy) (episodes 6–8),  Joanne McQuinn (Thingumy) (episode 74),  Stacey Gregg (Bob) (episodes 6–8),  Joanna Ruiz (Bob) (episode 74)||Isamu Tanonaka (Thingumy)You Inoue (Bob)||Marja Packalén (Thingumy)Leena Uotila (Bob)||Ella Pyhältö (Thingumy)Katja Aakkula (Bob)||Sue Lemström (Thingumy)Hellen Willberg (Bob) "]}, {"page": "Dennis & Gnasher: Unleashed!", "response": ["* Mrs Creecher (voiced by Joanna Ruiz): The elderly teacher of Dennis' class who has bad eyesight.", "*Joanna Ruiz as Mrs Creecher, Gran and Anne Finally - a journalist whose name is a play on the words \"And finally...\".", "The series was first announced on 8 June 2016, when The Beano announced they were setting up a business dedicated to media based on The Beano. Dennis & Gnasher: Unleashed! will be their first production. On 5 October 2016, it was officially announced that the series would air on CBBC in 2017 and the first-ever picture of Dennis in CGI was released. On 17 March 2017, Freddie Fox was announced to be voicing Dennis, a clip of the series was also released. On 3 July 2017, Rasmus Hardiker, Ryan Sampson, Kathryn Drysdale, Kelly-Marie Stewart and Joanna Ruiz were all added to the voice cast and another clip was released."]}, {"page": "Simon (French TV series)", "response": ["*Joanna Ruiz as Eva, Patricia, Grandma"]}, {"page": "Poppy Cat (TV series)", "response": ["*Zuzu is a speedy young black and white plush toy Dalmatian puppy with black spots. He is Poppy's best friend who loves doing tricks on his skateboard and laughs really loud. Zuzu is an adrenaline junkie who is competitive, loud, and practically fearless. He is impulsive and cool, quick to laugh at a joke, impatient when it comes to manners and protocol, and a good sport most of the time. Voiced in the UK by Joanna Ruiz and in the US by Katie Leigh."]}, {"page": "Lilybuds", "response": ["*Rose - The most positive lilybud and the leader of the group. She is mostly the one who grows the flowers and plants. Voiced by Joanna Ruiz."]}, {"page": "Tinpo", "response": ["* Hackpo: a purple member of Team Tinpo. She heads up communication and invents gadgets. She is voiced by Joanna Ruiz."]}, {"page": "List of changes made due to the George Floyd protests", "response": ["| style=\"text-align: center; font-weight: bold\" | John Alderton (seasons 1–4)John Sparkes (season 5)David Carling (seasons 6–12)Sarah Hadland/Joanna Ruiz (season 5)Su Douglas (seasons 6–12)"]}]}}