{"wiki_id": "http://www.wikidata.org/entity/Q16214139", "itemLabel": "Andy Puddicombe", "itemDescription": "British writer and meditation advocate", "wikipedia_url": "https://en.wikipedia.org/wiki/Andy_Puddicombe", "wikipedia_page": {"main": "Andy Puddicombe (born 23 September 1972) is a British author, public speaker and a teacher of meditation and mindfulness. He, alongside Richard Pierson, is the co-founder of Headspace, a digital health company that provides guided meditation training and mindfulness for its users.\nPuddicombe is a former Buddhist monk with a degree in Circus Arts.", "link_mentions": [{"page": "BBC Natural History Unit filmography", "response": ["|Mindful Escapes: Breathe, Release, Restore ||2020 || A four part series featuring relaxing sequences of the natural world. || Andy Puddicombe (Narrator) || No || No"]}, {"page": "Action for Happiness", "response": ["AfH runs monthly events in London with expert speakers from around the world presenting on themes related to happiness. An archive of the public talks including sessions with Thupten Jinpa, Dr Kristen Neff, Dr Ranjan Chattergee, Andy Puddicombe, Jeff Sachs, Dr Maria Sidios, Martin Seligman, Matthieu Ricard, Claudia Hammond, Mo Gawdat and Jon Kabat-Zinn are available on the charity's YouTube channel."]}, {"page": "Headspace (company)", "response": ["Headspace is an English-American online company, specializing in meditation. It was incorporated in May 2010 in London, England, by Andy Puddicombe and Richard Pierson. It is headquartered in Santa Monica, California, with offices in San Francisco and London.", "Headspace was founded in May 2010, by Andy Puddicombe and Richard Pierson. Puddicombe is a former Buddhist monk, and Pierson has a background in marketing and new brand development.", "Three books by Headspace founder Andy Puddicombe are published by Hodder & Stoughton. ", "In November 2012, Headspace founder Andy Puddicombe gave a TED Talk, entitled \"All It Takes Is 10 Mindful Minutes\", outlining the benefits of taking time out each day to practise mindfulness."]}, {"page": "How I Built This", "response": ["|Headspace: Andy Puddicombe and Rich Pierson", "|How I Built Resilience: Live with Alli Webb and Andy Puddicombe & Rich Pierson"]}, {"page": "Peston (TV programme)", "response": ["| Anthony Costello, Sam Allardyce, Andy Puddicombe, David Miliband and Andrea Leadsom"]}, {"page": "OMR Festival", "response": ["2019 was a year of firsts for the OMR Festival. Instead of being scheduled in late February/March as usual, OMR19 moved to May for the first time, taking place on May 7 & 8, 2019. OMR19 also saw the first rendition of the Festival to take up six halls at the Hamburg Convention Center and cracked the 50,000-attendee mark (52,000) for the first time. The Expo portion of the Festival featured 400 exhibitors, 150 Masterclasses, 37 Guided Tours and 100 Side Events. Headlining the Conference on May 8 were New York Times' best-selling author Yuval Noah Harari, Endeavor executive Bozoma Saint John, Headspace CEO Andy Puddicombe, JD.Com CEO Bowen Zhou, The Atlantic journalist Taylor Lorenz and British recording artist Ellie Goulding."]}]}}