{"wiki_id": "http://www.wikidata.org/entity/Q16239659", "itemLabel": "Oli McBurnie", "itemDescription": "Scottish association football player (born 1996)", "wikipedia_url": "https://en.wikipedia.org/wiki/Oli_McBurnie", "wikipedia_page": {"main": "Oliver Robert McBurnie (born 4 June 1996) is a professional footballer who plays as a striker for EFL Championship club Sheffield United and the Scotland national team.\nAfter playing youth football for Leeds United, McBurnie began his career with Bradford City, spending two loan spells at Chester. He later signed for Swansea City, spending time on loan at Newport County, Bristol Rovers and Barnsley.\nBorn in England to a Scottish father and mother, he represents Scotland at international level, making his senior debut in March 2018.", "link_mentions": [{"page": "Barnsley F.C.", "response": ["|2018|| Oli McBurnie"]}, {"page": "Garforth Academy", "response": ["*Oli McBurnie, footballer"]}, {"page": "List of Sheffield United F.C. seasons", "response": ["|Oli McBurnieLys Mousset"]}, {"page": "Graham Potter", "response": ["Potter won his first match as Swansea boss with a 2–1 victory over Sheffield United, with goals from striker Oli McBurnie and former Liverpool youngster Yan Dhanda. His first game at Swansea's Liberty Stadium was a 1–0 win against Preston North End. In his first season at the club, Swansea reached the quarter-finals of the 2018–19 FA Cup, where they hosted Manchester City. They initially led the Premier League champions 2–0 after 30 minutes but three goals in the last 20 minutes, one from Bernardo Silva, an own goal from Kristoffer Nordfeldt and a late winner from Sergio Agüero defeated Potter's side. They finished 10th in the league, after a strong end of season run gave Swansea a slim chance of making the play-offs going into the last three matches of the season."]}, {"page": "Jamie Murphy (footballer, born 1989)", "response": ["Murphy's second Scottish cap came in a friendly where Scotland lost 2–0 away to Peru where Murphy started the game. However, he was subbed off in the 63rd minute, replaced by Oli McBurnie."]}]}}