{"wiki_id": "http://www.wikidata.org/entity/Q16208533", "itemLabel": "Mr Dibs", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Mr_Dibs", "wikipedia_page": {"main": "Jonathan Darbyshire (born 4 August 1964) (now Jonathan Hulme by deed poll), widely known by his stage name Mr Dibs or Dibs Hawkwinder, is a British musician, best known as a former member of the space rock group Hawkwind.", "link_mentions": [{"page": "Hawkwind", "response": ["December 2006 saw the official departure of Alan Davey, who left to perform and record with two new bands: Gunslinger and Thunor. He was replaced by Mr Dibs, a long-standing member of the road crew. The band performed at their annual Hawkfest festival and headlined the US festival Nearfest and played gigs in PA and NY. At the end of 2007, Tim Blake once again joined the band filling the lead role playing keyboards and theremin. The band played 5 Christmas dates, the London show being released as an audio CD and video DVD under the title Knights of Space.", "On 8 September 2008 keyboard player Jason Stuart died due to a brain haemorrhage. In October 2008, Niall Hone (former Tribe of Cro) joined Hawkwind for their Winter 2008 tour playing guitar, along with returning synth/theremin player Tim Blake. In this period, Hone also occasionally played bass guitar alongside Mr Dibs and used laptops for live electronic improvisation."]}, {"page": "Space Ritual", "response": ["*Mr Dibs (Jonathan Hulme Derbyshire) - vocals, bass"]}, {"page": "Astounding Sounds, Amazing Music", "response": ["Calvert had written the lyrics to \"Steppenwolf\" when Adrian Wagner, for his album Distances Between Us, \"wanted a song about living in cities and I was re-reading Hesse's Steppenwolf at the time. It seemed to me that there was a strong myth in it about city life and it gave me the basic idea.\" It was performed during the tour of the album, appearing on the live album Atomhenge 76, and remained in the band's set until Calvert left in 1978, versions included on Weird Tape 4 and 5. The song has occasionally been re-instated into the live set, between 1982 and 1984 it was performed by Turner, in 1996 by Ron Tree, in 2003 by Arthur Brown and in 2017 by Mr Dibs during the Into The Woods tour."]}]}}