{"wiki_id": "http://www.wikidata.org/entity/Q16238559", "itemLabel": "Derek Whitehead", "itemDescription": "English rugby league footballer", "wikipedia_url": "https://en.wikipedia.org/wiki/Derek_Whitehead", "wikipedia_page": {"main": "Derek Whitehead (born 14 February 1944) is an English former professional rugby league footballer who played in the 1960s and 1970s. He played at representative level for Great Britain and Lancashire, and at club level for Folly Lane ARLFC [1] (in Pendlebury), Swinton, Oldham and Warrington (Heritage № 694), as a goal-kicking fullback, i.e. number 1.", "link_mentions": [{"page": "Warrington Wolves", "response": ["* Derek Whitehead 1969 to 1979"]}, {"page": "Swinton Lions", "response": ["Throughout the late 1940s, and the 1950s the Lions strove unsuccessfully to repeat former glories and often flattered to deceive, but the appointment of Welshman Cliff Evans as coach signalled a renaissance. Concentrating on a youth policy and training methods beyond his era, Evans began to model an exciting, young Swinton team. This new era saw some notable Welshmen in the Lions' ranks such as Rees Thomas, Ralph Morgan, Frank Osmond, Dai Moses, Ron Morgan and Graham Rees. Also in the 'swinging 1960s' years the Lions fielded real top class performers such as GB internationals Ken Gowers at full-back, Alan Buckley at left-centre plus his wing partner, John Stopford. During this same decade, local talent came to the fore with the likes of Graham Williams (scrum-half), Derek Whitehead (full-back/utility), Barry Simpson (2nd-row) and classy GB loose-forward Dave Robinson. During the second half of the decade other prominent players turned out for the Lions. Of these, perhaps the most worthy were stand-off Billy 'Daz' Davies, scrum-half Peter Kenny and 2nd-rowers Rod Smith (ex-Workington Town) and the highly respected Bill Holliday (ex-Whitehaven, Hull Kingston Rovers, Cumberland and GB). In fact it was the Lions 1960s quartet of Gowers, Buckley, Stopford and Robinson who were selected to play for the GB tourists on the 1966 tour to Australasia. Gowers was even given the honour of being awarded the position of tour vice-captain. However, some critics saw this as an apology for overlooking him when the previous tourists were chosen in 1962, when many believe he was easily the most outstanding player to wear a full-back's jersey in the British game.", "* Derek Whitehead"]}, {"page": "Lance Todd Trophy", "response": ["| Derek Whitehead"]}, {"page": "Co-op Academy Swinton", "response": ["* Derek Whitehead (born 1944), rugby league  in the 1960s and 1970s for Great Britain, Lancashire, Swinton, Oldham and Warrington"]}, {"page": "Chris Scott (cricketer, born 1964)", "response": ["Chris Scott is the nephew of 1960/1970s rugby league player Derek Whitehead who played for his hometown club Swinton as well as Oldham and Warrington. Playing predominantly at full-back he also won three caps for Great Britain against France (twice) and New Zealand."]}, {"page": "Derek", "response": ["*Derek Whitehead (born 1944), English rugby league footballer ", "*Derek Whitehead (born 1944), rugby league footballer"]}]}}