{"wiki_id": "http://www.wikidata.org/entity/Q16223106", "itemLabel": "Ted Dwane", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Ted_Dwane", "wikipedia_page": {"main": "Ted Dwane (born Edward James Milton Dwane, 15 August 1984) is a British musician and photographer, best known for being the bassist of the Grammy Award-winning British folk rock band Mumford & Sons. Before this he was the bassist in experimental folk band Moulettes.", "link_mentions": [{"page": "Grammy Award for Best Rock Song", "response": ["* Ted Dwane, Ben Lovett, Marcus Mumford, \"Country\" Winston Marshall – \"Little Lion Man\" (Mumford & Sons)", "* Ted Dwane, Ben Lovett, Marcus Mumford & Country Winston – \"The Cave\" (Mumford & Sons)", "* Ted Dwane, Ben Lovett, Winston Marshall, & Marcus Mumford – \"I Will Wait\" (Mumford & Sons)"]}, {"page": "Windlesham House School", "response": ["*Ted Dwane (born 1984), musician, bassist of Mumford & Sons"]}, {"page": "Gallien-Krueger", "response": ["Artists using GK equipment include Flea of the Red Hot Chili Peppers,   Velvet Revolver's Duff McKagan, Tom Hamilton of Aerosmith, and Ted Dwane of Mumford & Sons."]}, {"page": "Laura Marling", "response": ["After completing her GCSEs at age 16, Marling joined her older sisters and settled in the outskirts of London. She soon joined a cluster of intertwined bands that were drawn to acoustic instruments and tradition-tinged melodies—the group formed a musical movement that was labelled \"nu-folk\" by the British press. Marling joined the original line-up of indie folk band Noah and the Whale and appears as a background vocalist on their debut album, Peaceful, the World Lays Me Down; however, she left the group before the album's 2008 release due to a dissolved relationship with the band's lead singer, Charlie Fink. Marling appeared on The Rakes track \"Suspicious Eyes\" from the band's 2007 album, Ten New Messages, credited as 'Laura Marlin'. Marling later collaborated with Mystery Jets and contributed guest vocals to their 2008 single \"Young Love\". Early in her career, Marling performed with members of the band Mumford & Sons: Ted Dwane, Marcus Mumford, and Winston Marshall."]}, {"page": "Mumford & Sons", "response": ["Mumford & Sons are a British folk rock band formed in London in 2007. The band consists of Marcus Mumford (lead vocals, electric guitar, acoustic guitar, drums), Ben Lovett (vocals, keyboards, piano), and Ted Dwane (vocals, bass guitar, double bass). Banjo player Winston Marshall left the band in 2021.", "Mumford & Sons was formed in late 2007  by multi-instrumentalists Marcus Mumford, Ben Lovett, Winston Marshall and Ted Dwane. Band members play acoustic guitar, drums, keyboard instruments, bass guitar, and traditional folk instruments such as banjo, mandolin and resonator guitar. The band name originates from Marcus Mumford being the most visible member, organizing the band and their performances. Lovett indicated that the name was meant to evoke the sense of an \"antiquated family business name\".Collis, Clark (4 March 2011). \"Mumford and Sons: Ben Lovett talks about playing with Dylan, recording with Ray Davies, and high-fiving R. Kelly\". Entertainment Weekly Music Mix. Retrieved 6 January 2011.", "The first phase of a 2013 world tour in support of Babel was released in November 2012. Their Gentlemen of the Road tour continued through 2013. After performing two shows on 8 & 9 June 2013 at the Austin360 Amphitheater in Austin, Texas, bassist Ted Dwane checked into a hospital the next day. Surgeons found a blood clot on the surface of his brain and performed surgery to remove it. Heeding medical advice to aid Dwane's recovery, the band cancelled the rest of its Summer Stampede Tour, including performances at the 2013 Bonnaroo Music Festival and returned to the UK. Dwane's surgery was successful, and his recovery was such that the band was able to headline the 2013 Glastonbury Festival on 30 June, with the band receiving acclaim for their performance.", "*Ted Dwane – vocals, bass guitar, double bass, drums"]}, {"page": "53rd Annual Grammy Awards", "response": ["** Ted Dwane, Ben Lovett, Marcus Mumford & Country Winston, songwriters (Mumford & Sons)"]}, {"page": "Sigh No More (Mumford & Sons album)", "response": ["* Ted Dwane – vocals, double bass, bass guitar, drums"]}, {"page": "I Speak Because I Can", "response": ["*Ted Dwane – double bass"]}, {"page": "Alan Pownall", "response": ["He shared a flat in London with fellow singer/songwriter Jay Jay Pistolet (who would go on to become the front man of The Vaccines). He later moved in with Marcus Mumford and Winston Marshall from Mumford and Sons, who he supposedly introduced to Ted Dwane."]}, {"page": "Roll Away Your Stone", "response": ["Category:Songs written by Ted Dwane"]}, {"page": "List of people educated at Millfield", "response": ["* Ted Dwane, musician & member of Mumford and Sons"]}, {"page": "Moulettes", "response": ["Moulettes are an English art rock band that combines elements of rock, progressive, folk and pop music. The band was formed in 2002 in Glastonbury, England by Hannah Miller (vocals, cello), Ruth Skipper (vocals, bassoon), Robert Skipper (later of The Holloways), Oliver Austin (drums, vocals) and Ted Dwane (bass guitar). ", "Hannah Miller, Ruth Skipper, Robert Skipper, Oliver Austin and Ted Dwane met at school in Glastonbury and Winchester.", "Very soon after this point Laura Marling and Mumford & Sons recruited Ted Dwane, Robert Skipper left to join The Holloways, and Leach went to live in Australia. Determined to document the many songs that had been played live during that period, Miller, Ruth Skipper, and Austin became a newly arranged three-piece band. It was on this foundation that the unique sound for the first album was made. During this period Austin, Ruth Skipper, and Miller also helped found the Sotones Music co-operative label in Southampton and released their first split single, Wilderness, with Peter Lyons. However, after a few years of seeing Moulettes at 'The Den of Iniquity', Seasick Steve's previous management and label, who had been courting the band for a while, offered to release the upcoming album on Balling the Jack records.", "The sessions saw the return of Ted Dwane on double bass and the addition of Jim Mortimore, Laura Hockenhull of the Copper Family, and Faye Houston. Guest appearances include Liz Green on 'Blood And Thunder', Banjoist Matt Menefee (Cadillac Sky, Chessboxer) and Ríoghnach Connolly (folk singer, flute and whistle).", "The band began writing for Album 5 in May 2018 and started recording at The Rosehill Studios and Metway studios in Brighton. Old and new members are writing a new set of songs to be reimagined with five different arrangements on five different albums: rock, acoustic, horns, a capella, and electronic. The band have a few UK dates this summer, a Canadian tour and some headline shows from October through December. There is no release date set. Guest artists confirmed are Rioghnach Connolly, Yazz Ahmed, Resonators, Wallis Bird, Lee Westwood, and Charlotte Glasson. Returning members include Ted Dwane, Georgina Leach, Anisa Arslanagic, Mike Simmonds, Laura Impallomeni, Jim Mortimore, Emma Gatrill."]}, {"page": "54th Annual Grammy Awards", "response": ["**Ted Dwane, Ben Lovett, Marcus Mumford & Country Winston, songwriters (Mumford & Sons)"]}, {"page": "55th Annual Grammy Awards", "response": ["** Ted Dwane, Ben Lovett, Winston Marshall & Marcus Mumford, songwriters (Mumford & Sons)"]}, {"page": "Babel (Mumford & Sons album)", "response": ["* Ted Dwane – upright bass, electric bass, electric guitar, drum kit, percussion, backing vocals"]}, {"page": "Lover of the Light", "response": ["Category:Songs written by Ted Dwane"]}, {"page": "List of British films of 2013", "response": ["* Ted Dwane (Best Song) – Brave"]}, {"page": "Ben Lovett (British musician)", "response": ["Lovett is one of the founding members of the band Mumford & Sons. He attended Hallfield School in Birmingham before moving to London. Later, he attended King's College School in Wimbledon which he attended with Marcus Mumford. He met fellow band members, Ted Dwane and Winston Marshall, in London. He primarily plays keyboard and piano within the group, but also sings backing vocals and plays accordion, drums, guitar and percussion on the group's songs."]}, {"page": "List of songs recorded by Mumford & Sons", "response": ["| \"Cold Arms\" || Wilder Mind || 2015 || The track features vocals from Marcus Mumford and lone electric guitar from Winston Marshall. The band experimented with extra instrumentation in the recording process but decided to keep the song's stripped-back nature. Marshall said of the track, \"We may never play this one live\" but in June 2015 the band began performing the song acoustically with Ted Dwane, Ben Lovett and Marshall providing backing vocals."]}, {"page": "Whispers in the Dark (Mumford & Sons song)", "response": ["*Ted Dwane-Bass, vocals", "Category:Songs written by Ted Dwane"]}, {"page": "Babel (song)", "response": ["Category:Songs written by Ted Dwane"]}, {"page": "Studio Zoo", "response": ["The recording of Studio Zoo was being streamed live online, 24/7 for 5 weeks from 11 June 2013. His home studio in East London was set up with 4 cameras, to allow fans to follow every detail of recording the album – with no producer or engineer, only Faulkner and a few guests, such as The X Factor's Janet Devlin and Ted Dwane (of Mumford & Sons). Fans were also able to follow regular updates on the social networks, such as Facebook and Twitter. The campaign used the hashtag #StudioZoo which allowed users tweets to play sounds in Faulkner's house. The campaign concluded in a party at Faulkner's house with a set jungle. There was a toy jeep which would drive forward every time someone tweeted #StudioZoo. The #StudioZoo campaign was created and ran by Powster.", "\"With the whole album I gave myself relatively strict rules. The main criticism I’ve had in the past has been that my recordings have been overly layered and polished. So as this is the first album I’ve ever produced myself, I aimed to make sure this wasn’t the case. I limited myself to one guitar part per track, which meant I pushed my playing considerably further than ever before. I also tried to harmonise with myself as little as possible vocally,\" he said in an interview with The Independent. \"So that the main guitar part and lead vocal had to carry every track the way it does when I play live. I did allow myself to get in great players and singers to add more light and shade. Andreya Trianna and Janet Devlin both did awesome harmonies and guitar-wise I was joined by some of best acoustic guitarists in the world, Thomas Leeb and Nick Harper. Ted Dwane from Mumford and Sons played some double bass and India Borne, who plays cello and bunch of stuff for Ben Howard, popped in too. I was very lucky.\"", "* Ted Dwane – double bass, backing vocals"]}, {"page": "List of double bassists in popular music", "response": ["* Ted Dwane (Mumford & Sons)"]}, {"page": "Winston Marshall", "response": ["The group Mumford & Sons came together in December 2007 after its four members had already been performing together in various configurations. Co-founder Mumford started songwriting after seeing Marshall's band Captain Kick, and other similar artists, perform while Mumford was at university in Edinburgh; Mumford was struggling at the time and found Marshall's music \"a glimpse of salvation\", especially as Marshall encouraged him to join them on-stage. The first Mumford & Sons performances took place in 2005 at Marshall's Bosun's Locker jam nights as informal performances of the musicians \"like a hoedown\". Mumford began performing here, and was joined by Marshall as well as other musician friends with whom he had previously performed, including Ben Lovett and Ted Dwane. As well as together, Dwane, Marshall, and Mumford all performed with Marling's band during the jam sessions. Mumford said that \"eventually, Ted [Dwane], Ben [Lovett], and Winston [Marshall] stuck. It wasn't until [they] started writing songs together that [they] realized this was an actual band and not just a singer/songwriter with a couple of mates.\" Marshall played the banjo, guitars, dobro, and provided backing vocals, for the group, and was often identified as the comic relief of the line-up."]}, {"page": "Wilder Mind", "response": ["*Ted Dwane", "*Ted Dwane – photography"]}, {"page": "Believe (Mumford & Sons song)", "response": ["*Ted Dwane – bass guitar", "Category:Songs written by Ted Dwane"]}, {"page": "Tompkins Square Park (song)", "response": ["Category:Songs written by Ted Dwane"]}, {"page": "The Wolf (Mumford & Sons song)", "response": ["The official music video for the song, lasting three minutes and fifty-five seconds, was uploaded on 30 June 2015 to the band's Vevo channel on YouTube. Directed by Marcus Haney, the video takes place at the 2015 Bonnaroo Music Festival as the band explores its sights and sounds. It also showcases the headlining performance by the band. In the video the band members are dressed in various costumes; Marcus Mumford can be seen wearing a Robin Hood costume, Ted Dwane in giant chicken costume, Winston Marshall in a wedding dress and Ben Lovett in a fox costume. Actor Ed Helms can also be seen in the video; the actor performed at the festival that year alongside Dierks Bentley.", "Category:Songs written by Ted Dwane"]}, {"page": "Ditmas (song)", "response": ["Category:Songs written by Ted Dwane"]}]}}