{"wiki_id": "http://www.wikidata.org/entity/Q16216800", "itemLabel": "Michael Simon Toon", "itemDescription": "British photographer", "wikipedia_url": "https://en.wikipedia.org/wiki/Michael_Simon_Toon", "wikipedia_page": {"main": "Michael Simon Toon (born 12 March 1977) is an English photographer, filmmaker, designer and builder.", "link_mentions": [{"page": "Microexpression", "response": ["Microexpressions can be difficult to recognize, but still images and video can make them easier to perceive. In order to learn how to recognize the way that various emotions register across parts of the face, Ekman and Friesen recommend the study of what they call \"facial blueprint photographs,\" photographic studies of \"the same person showing all the emotions\" under consistent photographic conditions.Ekman, P. & Friesen, W.V. (2003). Unmasking the Face. Cambridge: Malor Books. p. 169 However, because of their extremely short duration, by definition, microexpressions can happen too quickly to capture with traditional photography. Both Condon and Gottman compiled their seminal research by intensively reviewing film footage. Frame rate manipulation also allows the viewer to distinguish distinct emotions, as well as their stages and progressions, which would otherwise be too subtle to identify. This technique is demonstrated in the short film Thought Moments by Michael Simon Toon and a film in Malayalam Pretham 2016Prof. Ragodí. \"Trabajo Psicología de 1er Trimestre.\" El Bigote de Bernays. Blogspot. Updated 11-19-2009. Accessed 8-5-13. http://elbigotedebernays.blogspot.com/2009/11/trabajo-psicologia-1er-trimestre.htmlBraun, Roman. \"Eye Catcher.\" Trinergy-NLP-Blog. Posted 10-27-2009. Accessed 8-5-13. \"Thought Moments.\" British Films Directory. British Council. Updated 12-1-2009."]}, {"page": "Protocell Circus", "response": ["Protocell Circus (2010), produced by Dr. Rachel Armstrong and Michael Simon Toon, is the first film to show the recognizable lifelike behavior of laboratory-created protocells.Toon, Michael Simon (2011). \"Protocell Circus\". YouTube. \"Rachel Armstrong: Applied scientist, innovator.\" Speakers, Ted.com. (c) TED Conferencing LLC. Accessed 7-31-13. \"Living Chemistry & A \"Natural History\" of Protocells.\"  Synth-ethic: Art and Synthetic Biology Exhibition 2013. 14.05 – 26.06.2011 in the Natural History Museum, Vienna, Austria. Produced by Biofaction KG. Added 20-4-2011 21:09."]}, {"page": "Thought Moments", "response": ["Thought Moments (2004) is an anthropological short film in the style of cinéma vérité by Michael Simon Toon.\"Thought Moments.\" Film information. Complete Index To World Film. (C) Alan Goble 2005-2013. http://www.citwf.com/film470058.htm Toon, a former Buddhist monk,McGhie, Caroline. \"The rise of Modernist, eco-friendly home.\" The Telegraph. Posted 10-26-2012. Accessed 8-8-13. ", "Consistency of composition, lighting, and contrast facilitates the analysis of both the differences and similarities of the interviewees' facial expressions.Ekman, P., & Friesen, W. V. (2003). Unmasking the Face. Cambridge: Malor Books., p.1.Alex. \"'Thought Moments' by Michael Simon Toon.\" Healing Philosophy. Blog. Posted 12-7-2009. Accessed 8-5-13."]}, {"page": "Toon (name)", "response": ["* Michael Simon Toon (born 1977), English filmmaker and builder"]}]}}