{"wiki_id": "http://www.wikidata.org/entity/Q16207730", "itemLabel": "Niki Evans", "itemDescription": "British singer", "wikipedia_url": "https://en.wikipedia.org/wiki/Niki_Evans", "wikipedia_page": {"main": "The X Factor is a British television music competition to find new singing talent. The fourth series was broadcast on ITV from 18 August 2007 and was won by Leon Jackson on 15 December 2007, with Rhydian Roberts finishing as the runner-up and Dannii Minogue emerging as the winning mentor. Dermot O'Leary presented for the first time, replacing Kate Thornton, who had been presenting the show since series 1 in 2004. Fearne Cotton replaced Ben Shephard as presenter on the spin-off show The Xtra Factor. The original judging panel consisted of Simon Cowell, Sharon Osbourne, Brian Friedman and Minogue. Friedman left the panel halfway through the first audition episode and was replaced by former judge Louis Walsh.\nThis series saw a number of changes to the format, most notably the lowering of the minimum age for participants from 16 to 14 and the increase in the number of categories from three to four, resulting from the division of the 16-24s category into separate male and female categories.\nJackson's prize as winner was a £1 million recording contract. His first single release was \"When You Believe\", arranged for the finalists by composer Stephen Schwartz and released to download on 16 December 2007, with the physical format following on 19 December. The single became that year's Christmas number one on the UK Singles Chart and was also the fourth best selling single of 2007.This series was the first to be sponsored by The Carphone Warehouse after being sponsored by Nokia since the first series.", "link_mentions": [{"page": "Tamworth, Staffordshire", "response": ["* Niki Evans (born 1972) singer,IMDb Database retrieved December 2017 from the fourth series of The X Factor in 2007"]}, {"page": "1972 in music", "response": ["*December 13 – Niki Evans, English actress and singer"]}, {"page": "List of soul musicians", "response": ["*Niki Evans"]}, {"page": "Blood Brothers (musical)", "response": ["The central role of Mrs. Johnstone has been played in various productions by, among others, Dee, Angela Richards, Barbara Dickson, Stephanie Lawrence, Clodagh Rodgers, Lyn Paul, Siobhan McCarthy, four of the Nolan sisters (Linda, Bernie, Denise and Maureen), Melanie Chisholm (making her West End debut and receiving an Olivier nomination in 2009), Marti Webb, Vivienne Carlyle, Niki Evans,Cole, Simon.\"X Factor's Niki Evans Joining 'Blood Brothers' Tour\" whatsonstage.com, 25 May 2010 Amy Robbins, Natasha Hamilton, Helen Reddy, Rebecca Storm, Carole King and Petula Clark. Stephanie Lawrence played the role more times than anyone else. Mickey has been played by O'Neill, Russell Boulter, Stephen McGann, Paul Crosby, Antony Costa, Stefan Dennis, Andy Snowden, David Cassidy and Michael J.Cook among others. Notable actors to play Eddie include Hutchinson and Shaun Cassidy. Narrators include Evans, Carl Wayne, Adrian Zmed, David Soul and Marti Pellow. Alex Harland played the small role of the postman in more than 4,000 performances."]}, {"page": "Marti Webb", "response": ["From September to December 2008, she appeared as Mrs Johnstone in the long-running UK tour of Willy Russell's musical Blood Brothers, succeeding Linda Nolan who left due to illness.Hardwick. \"Rescuing Mrs J\", thenorthernecho.co.uk, 26 September 2008; accessed 1 October 2008. The producer of the show, Bill Kenwright had been trying to persuade Webb to play the role for around 20 years and she was only free by chance. As Nolan was ill, she had just a week and a half to rehearse, around half the time normally expected for the rehearsal of such a tour. Birmingham-born Niki Evans was playing the role in the West End at the time, so while the tour visited Birmingham, Webb briefly took over in the London production to allow Evans to play her home city."]}, {"page": "List of people from Birmingham", "response": ["*Niki Evans – Singer"]}, {"page": "Pete Waterman Entertainment", "response": ["* Niki Evans"]}, {"page": "Glen Goldsmith", "response": ["In 2000, Goldsmith built his own recording studio in Ladbroke Grove, London, and set up Blues & Rhythm, a production company and record label working with various artists such as Soul-unique and his brother lead vocalist KG/Mn8. In 2004, Goldsmith composed \"Trippin'\" for Milk & Sugar's album, Housemusic.de. In 2008, Goldsmith and Rollover wrote Niki Evans' debut single, \"Love Me No More\" which failed to reach the Top 40 in the UK Singles Chart."]}, {"page": "When You Believe", "response": ["\"When You Believe\" was recorded by The X Factor winner Leon Jackson in December 2007, with slightly altered lyrics in the second verse, removing some religious overtones within the song. The single was available to download from midnight after the result of the show on December 15, 2007, and a CD was rush-released mid-week, on December 19, 2007. This was unusual as most new singles were released on a Monday to gain maximum sales for the UK Singles Chart the following Sunday. Exceptions included the previous two X Factor winners whose were singles released in this fashion, in order for them to compete to be the Christmas number-one single, which they all became. A video for the single was made by each of the final four of the series; Jackson, Rhydian Roberts, Same Difference, and Niki Evans. However, only the winner's version of the song and video was released."]}, {"page": "List of people with surname Evans", "response": ["*Niki Evans (born 1972), English singer"]}, {"page": "2007 in music", "response": ["*December 15 – Leon Jackson is named winner of the fourth series of The X Factor UK. Rhydian Roberts is named runner-up, while Same Difference and Niki Evans finish in third and fourth place respectively."]}, {"page": "Legally Blonde (musical)", "response": ["Following Willets, Professor Callahan was played by Matthew Kelly, and later Les Dennis, alongside Niki Evans as Paulette. Amy Lennox covered as Elle for the Aberdeen run of the tour, with Stephen Ashfield briefly reprising his role as Emmett just weeks after leaving the show in London. On July 17, 2012, Jennifer Ellison replaced Niki Evans as Paulette, and Gareth Gates replaced Ray Quinn as Warner."]}, {"page": "List of RCA Records artists", "response": ["*Niki Evans"]}, {"page": "All That Jazz (song)", "response": ["*Niki Evans sang the song on the fourth edition of The X Factor."]}, {"page": "Sarah Lark", "response": ["In February 2009, Lark performed at the 2009 Whatsonstage Theatregoers' Choice Award at the Prince of Wales Theatre in London. She sang \"9 to 5\" with fellow I'd do Anything contestant Samantha Barks and X-Factor finalist Niki Evans, then the title track from the Broadway musical Xanadu."]}, {"page": "Right Now (Leon Jackson album)", "response": ["The album was recorded from 2007–2008 under the direction of Simon Cowell, head of the Syco/Sony BMG record label, and under the production of producer Steve Mac. In an episode of the Bebo series from Jackson Leon's Life, one episode shows Jackson recording the track \"All in Good Time\" and how the original high note towards the end of the song was changed to a lower key note because Jackson could not reach the high note well enough on the original version of the song. The album was completed in 2008 and released on 20 October 2008. The single was available to download from midnight after the result of the show on 15 December 2007, and a CD was released on 19 December 2007. This is unusual as most new singles are released on a Monday to gain maximum sales for the UK Singles Chart the following Sunday. Exceptions included the previous two X Factor winners whose singles released in this fashion, in order for them to compete to be the Christmas number-one single, which they all became. A video for the single was made by each of the final four of the series, Jackson, Rhydian Roberts, Same Difference, and Niki Evans. However, only the winner's version of the song and video was released.", "\"When You Believe\" was released as the winner's single in December 2007. Like many X Factor winner singles, it entered the United Kingdom chart at #1, staying there for 3 weeks, and #1 in Ireland. The song was gone from the charts by early February 2008. The single sold 490,000 copies. The single was available to download from midnight after the result of the show on 15 December 2007, and a CD was rush-released mid-week, on 19 December 2007. This is unusual as most new singles are released on a Monday to gain maximum sales for the UK Singles Chart the following Sunday. Exceptions included the previous two X Factor winners whose singles were released in this fashion, in order for them to compete to be the Christmas number-one single, which they all became. A video for the single was made by each of the final four of the series: Jackson, Rhydian Roberts, Same Difference and Niki Evans. However, only the winner's version of the song and video was released."]}, {"page": "List of British actors", "response": ["* Niki Evans (born 1972)"]}, {"page": "2007 in British music", "response": ["*15 December – Leon Jackson is named winner of the fourth series of The X Factor. Rhydian Roberts is named runner-up, while Same Difference and Niki Evans finish in third and fourth place respectively."]}, {"page": "Joe Tracini", "response": ["Having taken a year off in 2010, he returned to pantomime in 2011 playing the role of Wishee Washee in Aladdin alongside Larry Lamb at the Ashcroft Theatre in Croydon. The following year, Tracini returned to the role of Buttons, this time at the Barbican Centre in York alongside his close friend Dani Harmer and ex-EastEnders star Joe Swash. Due to his filming schedule for Hollyoaks, he again took a break from the pantomime stage in 2013, however having completed his work with the soap, he returned to the stage in November 2014, once again reprising the role of Buttons in Cinderella at Wolverhampton's Grand Theatre alongside Julian Clary and The X Factor (UK series 4) star Niki Evans. In early April 2015, it was confirmed that Tracini would be taking over from Todd Carty in the role of Patsy in the UK tour of Spamalot. The musical's cast already included his father, Joe Pasquale, who had extended his run starring as King Arthur."]}, {"page": "1972 in British music", "response": ["*13 December - Niki Evans, actress and singer"]}, {"page": "Kinky Boots (musical)", "response": ["| Niki Evans"]}]}}