{"wiki_id": "http://www.wikidata.org/entity/Q16295190", "itemLabel": "William Crichton", "itemDescription": "Scottish-Finnish industrialist", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Crichton_(engineer)", "wikipedia_page": {"main": "William Crichton (29 November 1827 – 10 April 1889) was a Scottish engineer and shipbuilder who spent most of his career in Turku, located in the Grand Duchy of Finland.\nCrichton moved to Turku at the age of 23 to lead a steam engine construction project at Cowie and Eriksson, a local engineering company. After two years, he moved to Helsinki to work for Fiskars, but because of the Crimean War he was  arrested due to his nationality and transferred to Saint Petersburg. He was soon released with help from family connections and he remained working for Izhorsk Works for eight years.\nIn 1862, Crichton returned to Turku after receiving an offer to buy half of Cowie & Eriksson Company. The company was renamed W:m Crichton & C:o and under Crichton's leadership it developed into the largest company in Turku. The company built predominantly ships and steam engines and its main customer was the Imperial Russian Navy.\nCrichton led the company until his death in 1889. He was survived by twelve children who soon sold the company to investors. Crichton's name remained in use until 1965.", "link_mentions": [{"page": "Crichton", "response": ["* William Crichton, 1st Lord Crichton (died 1454), Scottish Lord", "* William Crichton (engineer), (1827–1889), Scottish engineer and shipbuilder"]}, {"page": "Crichton-Vulcan", "response": ["The first shipyard in Turku was established in 1732 on the eastern bank of the Aura River. The first foundry and metal workshop was established in 1842. After the Crimean War the workshop was acquired by Scotsman William Crichton. Crichton built a new shipyard near the mouth of Aura. Soon a joint-stock company, W:m Crichton & C:o Ab was established, merging smaller shipyards. In 1913 W:m Crichton & C:o Ab went bankrupt, and a new company Ab Crichton was established in its place."]}, {"page": "William Crichton", "response": ["William Crichton may refer to:", "* William Crichton, 1st Lord Crichton (died 1454), political figure in the late medieval Kingdom of Scotland", "* William Crichton (Jesuit) (c. 1535–1617), Scottish Jesuit", "* William Crichton (engineer) (1827–1889), Scottish engineer and shipbuilder in Turku, Grand Duchy of Finland", "* William Crichton, 2nd Earl of Dumfries (1598–1691)", "* William Crichton (minister) (1630-1708), Scottish minister, who served as Moderator of the General Assembly in both 1692 and 1697"]}, {"page": "Russian frigate Rurik (1851)", "response": ["Rurik was designed by Johan Eberhard von Schantz. She was built in Turku at Gamla Warfsbolaget i Åbo and launched in October 1851. At the time of her construction she was the largest ship ever built in Finland. The Scottish engineer William Crichton was recruited to supervise construction of the steam engine.Keisarin messinkilelu oli antimagneettinen erikoisuus  (Turun Sanomat)   Later he took over the engine builder Cowie & Ericsson and renamed it W:m Crichton & C:o."]}, {"page": "Åbo Skeppswarf", "response": ["In the early 1880s the company employed 300 people. The major shareholder became William Crichton, the owner of the neighbouring yard. He bought the company and in 1883 he incorporated it to his own yard W:m Crichton & C:o Ab.", "The articles of association were renewed again in 1871 and the company name was once more changed. The share capital of Åbo Skeppswarfs Aktie Bolaget, \"Turku shipyard limited\", was 400 000 marks and divided to 80 shares, each of 5 000 marks value. The owners were E. Julin Trading House and William Crichton, who owned another yard in Turku."]}, {"page": "Wm. Crichton & Co.", "response": ["The company was founded as Cowie & Eriksson. At the beginning it produced steam engines, boilers and other engineering products. William Crichton became owner in 1862 and the company was named W:m Crichton & C:o The first shipbuilding slipway was constructed in 1864. The company became the biggest employer of Turku after acquiring the nearby yard Åbo Skeppswarf in 1883.", "Cowie & Eriksson got an order for an engine to power steam frigate Rurik, which was the largest ship built in Finland until then. In 1850 the company hired Scottish engineer William Crichton to accomplish installation and commissioning of the 300-hp engine; the project took three years in total. The ship was launched at the Turku Old Shipyard in 1851 and handed over in 1853, after which Crichton left the company.", "The company suffered of lack of orders during the Crimean War. Eriksson decided to give up the business and sold his share of the company to local investor Erik Julin in 1857. After this the company operated under name D. Cowie & C:o. Julin started to seek for a partner who had experience about marine industry and business knowledge. He wrote a letter to William Crichton, who lived then in Kolpino, close to Saint Petersburg, and suggested him to buy Cowie's share of the company. Crichton took the offer and moved in Turku in 1862, after which the company was named W:m Crichton & C:o. Crichton was up to date about the latest development of naval engineering: propellers were replacing paddle wheels, wood gave way to steel and compound technology was entering in steam engines; this was enabled by the recently invented fire-tube boilers which withstood higher pressure.", "In the early 1870s W:m Crichton & C:o employed 400 people. Most of the sales came from steam engines and other machinery, and just 30% of turnover came from ships. The company produced most of the needed tools, even drilling and turning machines, in its own workshops. Rapid growth of the company and the large orders required investments and various financial arrangements, creating large risks to its owners. At about the same time with making quotation for S/S Finland in 1874, the owners converted W:m Crichton & C:o a limited company in order to assure their personal property. The capital was 1 500 000 marks which was divided into 30 shares, each of 50 000 marks value; 20 shares were owned by William Crichton and 10 shares by trading house Julin. Erik Julin died already in the same year, after which the trading house was led by his son John Julin.", "Due to the growing demand of larger ships Crichton became interested at the Turku Old Shipyard company located at the opposite side of river Aura. The yard had capacity for building large hulls. During the 1870s William Crichton grew his ownership in the Turku Old Shipyard and by the end of the decade he became majority shareholder and was appointed head of the company in 1878. Straight after this Crichton started investments at the old yard to enable building of large steel hulls; a workshop was built for bending steel ribs and after few years there were sheet steel forming and riveting facilities. When Crichton received two large orders with two steel ships in each in 1881, the hull production of Solovetski, Murmanski, Zurukan and Spasiteliy was subcontracted from the Old Shipyard. During that year Crichton handed over total 12 vessels, including customs boat Wiikinki, paddle steamer Krasnovodsk and six smaller vessels. Crichton became sole owner in 1883 and merged the yard to his own company. Subsequently, W:m Crichton & C:o became by far the largest company of Turku; the headcount was 936 and turnover 1 589 000 marks.", "The company faced a major loss in April 1889 when William Crichton passed away just at the age of 62 years. John Eager took his post as company manager. None of Crichton's 12 children wanted to take the business. Shortly after four shares were sold to Eager, one to the major funding bank Nordiska Aktiebanken för Handel och Industrie. In the 1890s 13 of the remaining 15 shares were sold. Count Anatol Orloff-Davidoff from Saint Petersburg bought 12 shares and another nobleman from the same city, Ludwig von Havemann, bought one share. Supposedly, the Russia-based owners contributed the rapid growth of the company after the mid-1890s, but speculatively they also initiated the disastrous decision of starting operations in Saint Petersburg."]}, {"page": "Erik Julin", "response": ["In 1838 Julin became board member in Åbo Gamla Skeppswarf, Turku old shipyard. He was one of the company managers in 1842–1846 until he was replaced by his old business partner Joel Falcken. Julin had a key role in promoting investments at the yard and made deals of ships delivered to the Russian-American Company. Julin gained a strong foothold in the Turku shipbuilding industry after together with his business partner William Crichton he took over engineering company Cowie & Eriksson. In 1862 the company was renamed W:m Crichton & C:o."]}, {"page": "Meyer Turku", "response": ["The company was taken over by William Crichton who incorporated it into his own company W:m Crichton & C:o in 1882. The main customer was Imperial Russian Navy which ordered a number of torpedo boats and other vessels.Knorring: 2. William Crichtonin muistiinmerkintöjä. pp. 17–30. Crichton's company bankrupted in 1913, after which local businessmen Ernst and Magnus Dahlström founded Ab Crichton to continue shipbuilding. As all the Finnish shipbuilders, Ab Crichton suffered of low order intake at the early 1920s; it went together with its competitor and neighbour Ab Vulcan in 1924. The new company name became Ab Crichton-Vulcan Oy and its manager became Allan Staffans.Knorring: Osakeyhtiö Crichton. pp. 79–84. It got large orders from the Finnish Navy, most significant ones being coastal defence ships Väinämöinen and Ilmarinen.Knorring: Suomen laivaston uudisrakennukset. pp. 97–107. By time Crichton-Vulcan grew the biggest shipbuilding company of Finland. The major owner became Helsinki-based Kone- ja Siltarakennus which also owned the Hietalahti shipyard. In 1935 Kone- ja Siltarakennus was taken over by Karelian iron mill Wärtsilä which was led by energetic Wilhelm Wahlforss.Knorring: Suuri nousu. pp. 107–114. Most of the ships produced by Wärtsilä Crichton-Vulcan were exported to Soviet Union but the importance of western market increased by time. The historical name Crichton-Vulcan was replaced by Wärtsilä Turku Shipyard in 1966.Knorring: Crichton-Vulcanista Turun telakkaan. pp. 126–135."]}]}}