{"wiki_id": "http://www.wikidata.org/entity/Q16210693", "itemLabel": "Jon Campbell", "itemDescription": "Scottish singer", "wikipedia_url": "https://en.wikipedia.org/wiki/Jon_Campbell", "wikipedia_page": {"main": "Jon Campbell (born 25 November 1970) is a Scottish singer, producer, radio DJ, and songwriter, and frontman of the band The Time Frequency (TTF).\nIn 1991-93, Campbell had five Scottish number one singles with the self-written songs \"Real Love\", \"New Emotion\", \"The Ultimate High\", \"Dreamscape\" and \"Such A Phantasy\".", "link_mentions": [{"page": "List of Scottish musicians", "response": ["*Jon Campbell, singer, producer, keyboard player, songwriter, and frontman of the band The Time Frequency "]}, {"page": "The Time Frequency", "response": ["The band was founded by Jon Campbell in early 1991. They are Scotland's first techno group. Members that TTF have included are fellow keyboard players Paul Inglis, Kyle Ramsay and later Colin McNeil. Mary Kiani was the lead singer of TTF, then Debbie Millar and now Lorena Dale.", "Jon Campbell was the singer of the synthpop band, 'Thru the Fire' from 1987 to 1990, when he left the band to form The Time Frequency. Their first release was the white label EP, \"Futurama\". In 1992, the band released \"Real Love\" through the record label Jive Records. They released more singles and EPs until 1994, when they released their first album, Dominator, which included many of the singles that had been released prior to 1994.", "Jon Campbell called the group's 2018 single \"Home\", \"my best Time Frequency song ever\". It debuted on George Bowie's GBX, Radio Clyde on 21 April 2018.", "In November 2018, Jon Campbell and the Time Frequency released the single \"In Heaven\", with posthumous vocals by Millar."]}, {"page": "Jon campbell", "response": ["#REDIRECT Jon Campbell"]}, {"page": "Jon Campbell (Producer)", "response": ["#REDIRECT Jon Campbell"]}, {"page": "Campbell, Jon", "response": ["#redirectJon Campbell"]}, {"page": "Jonathan Campbell", "response": ["* Jon Campbell, Scottish singer and producer"]}, {"page": "Jon Campbell (producer)", "response": ["#REDIRECT Jon Campbell"]}, {"page": "Gallowgate, Glasgow", "response": ["*Jon Campbell, Singer-songwriter, musician, producer (TTF)"]}, {"page": "Michael Oakley", "response": ["On 16 April 2021, Oakley announced the release of a new single, \"Is There Anybody Out There\", co-written by fellow labelmate Ollie Wride and produced by Jon Campbell of The Time Frequency."]}]}}