{"wiki_id": "http://www.wikidata.org/entity/Q16222133", "itemLabel": "Pollyanna Woodward", "itemDescription": "television presenter", "wikipedia_url": "https://en.wikipedia.org/wiki/Pollyanna_Woodward", "wikipedia_page": {"main": "Pollyanna Woodward (born 11 June 1982) is a British television presenter, best known for being a co-presenter on Channel 5's The Gadget Show.", "link_mentions": [{"page": "Suzi Perry", "response": ["Since 2004, Perry had been a co-presenter for Channel 5's The Gadget Show, a hi-tech weekly programme, alongside Jason Bradbury, Jon Bentley, Ortis Deley and Pollyanna Woodward. She was temporarily replaced by Gail Porter while recovering from an ectopic pregnancy, and returned in August 2009. Perry created the current theme music for the Gadget Show in 2011, as part of one of the show's challenges. In February 2012, it was announced that the show's format was going to change and be renamed The Gadget Show: World Tour, featuring only two of the previous team of presenters: Jason Bradbury and Pollyanna Woodward."]}, {"page": "Paul Casey", "response": ["After they met at the Formula 1 Chequered Flag Ball at the 2011 Abu Dhabi Grand Prix, Casey started dating television presenter Pollyanna Woodward. The couple got engaged during the Christmas period in 2013. Soon after, they welcomed their first son, Lex, on 1 September 2014. They married January 2015."]}, {"page": "Andermatt", "response": ["In November 2012 Andermatt appeared on the British television series The Gadget Show, where presenters Jason Bradbury and Pollyanna Woodward were testing electric bicycles, scooters, and several mobile phone photo editing applications, on the hills of Nätschen. 8 January 2013"]}, {"page": "Quiz Call", "response": ["*Pollyanna Woodward", "For the last week of the show, 4 of the 7 presenters who were working for Quiz Call at the time presented. The 3 that did not present were Russ Spencer, Pollyanna Woodward and Keith Price. The presenter for the last 3 shows were as follows. Thursday – Liz Fuller and Kait Borsay, Friday – Chris Hopkins and Chris Park, and on the final show, Saturday – Liz Fuller and Chris Park."]}, {"page": "Ortis Deley", "response": ["In early 2009, Deley joined the popular technology show The Gadget Show as a co-presenter with Suzi Perry, Jon Bentley and Jason Bradbury, making his debut in the \"Road Trip Special\" episode on 30 January 2009. He replaced Dallas Campbell. In February 2012 it was announced that the show's format was changing; it is now known as The Gadget Show: World Tour and features two of the previous presenting team: Jason Bradbury and Pollyanna Woodward."]}, {"page": "The Gadget Show", "response": ["In February 2012, it was announced that the show would be in a new, revamped format. It was called The Gadget Show: World Tour, and it started airing on 23 April 2012. The new version of the show saw presenters Jason Bradbury and Pollyanna Woodward travelling the world to test the latest gadgets and partake in a number of challenges. The reception of the show from fans, after the first few broadcasts were generally negative, questioning Jon, Ortis and Suzi's drop from the show. ", "For the 17th series, Jason Bradbury and Pollyanna Woodward were joined by Countdown co-presenter Rachel Riley and former Gadget Show presenter Jon Bentley who re-joined the show as chief gadget tester. It was announced that The Gadget Show would return to its more traditional format, with a new studio. On 30 January 2014, it was announced that Ortis Deley would be returning to the show, replacing Pollyanna Woodward. On 25 April 2014, it was announced that Riley would be leaving the show and would be replaced by Olympic skeleton gold medallist, Amy Williams.", "* Pollyanna Woodward (2010–2014) – 62 episodes", "thumb|right|The live Super Theatre at Gadget Show Live 2013, featuring Jason Bradbury and Pollyanna Woodward"]}, {"page": "Jon Bentley (TV presenter)", "response": ["As a producer of Top Gear, Bentley helped launch the television careers of Jeremy ClarksonI was there – Jezza's TV debut. Topgear. 1 June 2005 and hired Quentin WillsonA history of motoring on TV. theguardian.com (24 November 2004). Retrieved on 30 November 2013. and Vicki Butler-Henderson. He also has a corner named after him on the Top Gear test track. Bentley presented The Gadget Show on Channel 5 in the United Kingdom, alongside Ortis Deley, Suzi Perry, Pollyanna Woodward and Jason Bradbury.", "In February 2012, it was announced that the show's format was changing, it was then known as The Gadget Show: World Tour, and featured two of the previous presenting team Jason Bradbury and Pollyanna Woodward.The Gadget Show | The Gadget Show rebooted for 2012 by The Gadget Show . Fwd.channel5.com. 23 February 2012. Occasionally, he also presented on Fifth Gear."]}, {"page": "The Great Big British Quiz", "response": ["*Pollyanna Woodward"]}, {"page": "Lee Clark", "response": ["* Lee Clark, television presenter, ex-husband of Pollyanna Woodward"]}, {"page": "Gran Turismo 5", "response": ["On September 5, 2011, Martin Brundle and Jonathan Legard commentated on a race between David Coulthard, driving a real Mercedes-Benz SLS AMG around the Top Gear test track, and 6 leading Gran Turismo players, racing on a console at Mercedes-Benz World. Coulthard won, with Jason Birt trailing by half a second. Reggie Yates, Pollyanna Woodward and Mike Bushell also took part in the race, but did not qualify for the leader board. Coulthard's lap was subsequently available to download for players to race against."]}, {"page": "Wannabe (TV series)", "response": ["*Pollyanna Woodward"]}, {"page": "Pollyanna (disambiguation)", "response": ["* Pollyanna Woodward (born 1982), English TV presenter"]}, {"page": "Popstars: The Rivals", "response": ["Girls – Kimberley Walsh, Pollyanna Woodward, Nicola Roberts, Annika Gavitas, Charlie Houston"]}, {"page": "Nätschen", "response": ["In November 2012 Andermatt and Nätschen appeared on the British television series The Gadget Show. Presenters Jason Bradbury and Pollyanna Woodward were testing electric bicycles, scooters, and several mobile phone photo editing applications, on the hills of Nätschen. 29 March 2013"]}, {"page": "Warsop", "response": ["Warsop is home to Meden School on Burns Lane, part of a local group named Torch Academy Gateway Trust.Torch Academy Gateway Trust - schools in the trust Retrieved 2014-10-29 Former pupils include television hosts Pollyanna Woodward and Simon Mapletoft, Mansfield 103.2 presenter Jason Harrison, Breakfast Show host Joe Sentance on Rother FM/Dearne FM, ex-Everton footballer Neil Pointon, former England wicketkeeper Bruce French and his nephew, current England and Nottinghamshire fast bowler Jake Ball, and Royal College of Art artist David Poyser."]}, {"page": "News media phone hacking scandal reference lists", "response": ["* Pollyanna Woodward"]}, {"page": "List of people from Mansfield", "response": ["*Pollyanna Woodward (born 1982), TV presenter, born in Mansfield"]}, {"page": "Splash! (British TV series)", "response": ["| Pollyanna Woodward"]}, {"page": "The Gadget Show (series 18)", "response": ["Jason Bradbury, Pollyanna Woodward, Rachel Riley and Jon Bentley all returned from the previous series to present the show."]}, {"page": "Splash! (British series 2)", "response": ["| Pollyanna Woodward", "| 4 || 10 || Pollyanna Woodward || 24.5 || 1 || 24.5", "| Pollyanna Woodward"]}, {"page": "Woodward (surname)", "response": ["* Pollyanna Woodward (born 1982), British television presenter"]}, {"page": "The Saturday Show (2015 TV series)", "response": ["*Pollyanna Woodward (Gadgets)"]}]}}