{"wiki_id": "http://www.wikidata.org/entity/Q16225016", "itemLabel": "Mark Nelson", "itemDescription": "English cricketer (born 1986)", "wikipedia_url": "https://en.wikipedia.org/wiki/Mark_Nelson_(cricketer)", "wikipedia_page": {"main": "Mark Anthony George Nelson (born  24 September 1986, Milton Keynes, Buckinghamshire) is an English cricket player who has represented Northamptonshire.  He is a left-handed batsman who bowls right-arm medium pace.  He currently represents Great brickhill Cricket Club in Minor Counties cricket.\nHe previously played for England in the 2006 U-19 Cricket World Cup in Sri Lanka, having previously playing at under 16's and 17's for England.\nNelson was released by the county at the end of the 2009 season.", "link_mentions": [{"page": "NBC Denis Compton Award", "response": ["*Northamptonshire – Mark Nelson"]}, {"page": "Graeme White", "response": ["Graeme was educated at Stowe School in Buckinghamshire, which is also where former Northamptonshire teammates Rob White, Ben Howgego and Mark Nelson studied. Earlier on in his career, he scored 109 and took 7 for 21 for Staffordshire U17s during 2003. Graeme then progressed on to playing second XI cricket for Northamptonshire  at the end of the 2004 season and throughout the 2005 season. He played for England in the 2006 U-19 Cricket World Cup in Sri Lanka."]}, {"page": "Mark Nelson", "response": ["Mark Nelson may refer to:", "* Mark Nelson (actor) (born 1955), American theater actor, director, and acting teacher", "* Mark Nelson (cricketer) (born 1986), English cricketer ", "* Mark Nelson (North Dakota official), superintendent of the North Dakota Highway Patrol", "* Mark Nelson (artist), artist whose work has appeared in role-playing games and comic books", "* Mark Nelson (Chicago artist) (born 1957), artist who has contributed public art to the Chicago area", "* Mark Nelson (boxing referee), boxing referee from Maplewood, Minnesota", "* Mark Nelson (musician), musician with the band Pan American", "* Mark Nelson (Canadian football) (born 1956), defensive coordinator for the Edmonton Eskimos", "* Mark Nelson (offensive lineman)", "* Mark Nelson (footballer) (born 1969), Scottish former footballer", "* Mark Nelson (video game designer), video game designer", "* Mark Nelson (scientist), American ecologist"]}, {"page": "2006 Under-19 Cricket World Cup squads", "response": ["* Mark Nelson"]}]}}