{"wiki_id": "http://www.wikidata.org/entity/Q16202649", "itemLabel": "Robin Chapman", "itemDescription": "English novelist, playwright and screenwriter", "wikipedia_url": "https://en.wikipedia.org/wiki/Robin_Chapman", "wikipedia_page": {"main": "Robin John Chapman (18 January 1933 – 29 July 2020) was an English novelist, playwright and screenwriter.", "link_mentions": [{"page": "John Collier (fiction writer)", "response": ["* De Mortuis — Adapted by Robin Chapman as \"Never Speak Ill of the Dead\" for Tales of the Unexpected, May 24, 1981 (Season 4, Episode 8), starring Colin Blakely, Warren Clarke and Keith Drinkel."]}, {"page": "Doomwatch", "response": ["| align=\"center\"| Robin Chapman"]}, {"page": "Theatre 625", "response": ["| (novel);Robin Chapman (adaptation)", "| (novel);Robin Chapman (adaptation)"]}, {"page": "Rex Warner", "response": ["In 1983 the BBC screened an adaptation of The Aerodrome. It was written by Robin Chapman and directed by Giles Foster. The cast included Peter Firth as Roy, the protagonist, Richard Briers as the Rector and Jill Bennett as Eustasia."]}, {"page": "Eyeless in Gaza (novel)", "response": ["The novel was adapted by Robin Chapman as a BBC mini-series in five episodes, which aired in 1971."]}, {"page": "Force 10 from Navarone (film)", "response": ["The producers wanted Robert Bolt to write the screenplay but he was busy working with David Lean. Bolt's agent Peggy Ramsey suggested they hire Robin Chapman.Hollywood battles: [Final 1 Edition] Sunday Times 12 May 2002: 18."]}, {"page": "Lamb to the Slaughter", "response": ["In 1979, the story was adapted by Robin Chapman for Roald Dahl's British television series Tales of the Unexpected, with Susan George as Mary and Brian Blessed as the police detective in charge of the investigation of her husband's murder. This episode ends slightly differently from the original story: having finished the leg of lamb, the four police officers get up and leave the kitchen. The last of them stops and turns back, looking intently at the leg bone resting on the serving platter. He then scrapes the contents of the platter into the kitchen bin."]}, {"page": "The XYY Man", "response": ["Although the television adaptation openly depicts a person with XYY syndrome as having criminal tendencies, it was highlighted following the series' broadcast that in real life, there is no connection. An early academic paper studying the conditional probability fallacy resulted in the myth becoming conventional wisdom in the 1970s, but subsequent research has not found any evidence for it. The subject was also touched on in an episode of Doomwatch, \"By the Pricking of My Thumbs...\", written by Robin Chapman."]}, {"page": "1994 in Wales", "response": ["**Welsh language: Robin Chapman, W. J. Gruffydd"]}, {"page": "Stanley Ellin", "response": ["*1980 - \"The Orderly World of Mr. Appleby\" - Adapted by Robin Chapman for Roald Dahl's Tales of the Unexpected, 7 June 1980 (Season 2, Episode 15), starring Robert Lang, Elizabeth Spriggs, and Cyril Luckham.", "*1981 - \"Kindly Dig Your Own Grave\" - Adapted by Robin Chapman for Tales of the Unexpected, 14 June 1981 (Season 4, Episode 11), starring Micheline Presle, Robert H. Thomson, and Celia Gregory."]}, {"page": "Spindoe", "response": ["The following year, Spindoe returned in his own series, which depicted events after Spindoe's release from prison. The series, devised by Robin Chapman, tried to portray London gangland in a realistic and consequently unpleasant light. Characters can be both sympathetic and repulsive in the space of a few lines and there is little room for usual TV moralising.", "The character of seedy-but-wise private detective Scaliger (George Sewell) was supposed to appear in a subsequent Robin Chapman series, the controversial Big Breadwinner Hog in 1969 but Sewell's unavailability led to the part being re-written and the character renamed. Spindoe was directed by Cormac Newell, better known as Mike Newell, director of Four Weddings and a Funeral and Donnie Brasco. Glynn Edwards was later better known in his role as 'Dave the Barman' in Minder."]}, {"page": "Big Breadwinner Hog", "response": ["Big Breadwinner Hog is a British television thriller serial devised by Robin Chapman, produced by Granada TV and transmitted in eight parts, starting at 9.00pm on 11 April 1969 on the ITV network. It portrayed the ruthless rise through the criminal underworld of the trendy young London gangster Hogarth (Peter Egan). He exploits the resources of a declining gangster, Ryan (Godfrey Quigley), to take over the dominant crime syndicate Scot-Yanks, controlled by the equally ruthless and manipulative Lennox (Timothy West). The key to Hogarth's success is knowledge of a murder arranged by Lennox, of which there is a crucial witness, Ackerman (Donald Burton), a one-time private eye who has been blackmailed into working for Scot-Yanks and bitterly resents Lennox."]}, {"page": "The Man in Room 17", "response": ["The Man in Room 17 is a British television series which ran for two seasons in the mid-1960s, produced by the northern weekday ITV franchise, Granada Television. Key to the series' success was the involvement of writer/producer Robin Chapman.", "An episode of The Man in Room 17 - the series 2 opener 'How to Rob Bank - And Get Away with it' was released on DVD in 2007 as a bonus feature for the complete series box set of Randall and Hopkirk (Deceased). The episode featured a guest role for R&H(D) star Mike Pratt. A solitary episode of The Fellows was released on DVD in 2007 as part of a set from Network DVD dedicated to the work of Robin Chapman and featuring Spindoe and his later gangster series Big Breadwinner Hog."]}, {"page": "Chapman (surname)", "response": ["*Robin Chapman (born 1933), British actor and writer"]}, {"page": "Shades of Greene", "response": ["|Robin Chapman", "|Robin Chapman"]}, {"page": "Desperate Romantics", "response": ["Desperate Romantics was not the first time the lives of the Pre-Raphaelite Brotherhood had been dramatised for television. In 1967 Ken Russell had directed Dante's Inferno, and in 1975 there was The Love School – a six-part serial first broadcast in 1975. Whereas Bowker's drama about the PRB was an adaptation of Franny Moyles' book, The Love School (scripted by John Hale, Ray Lawler, Robin Chapman and John Prebble) was adapted into a novel published by Macmillan in 1975. The new dramatisation was heavily influenced by the earlier series.Chloe Johnson, \"Presenting the Pre-Raphaelites: From Radio Reminiscences to Desperate Romantics\", Visual Culture in Britain, Volume 11, Issue 1, 1 March 2010, pp. 67–92"]}, {"page": "The Love School", "response": ["The Love School (broadcast in the U.S. as The Brotherhood) is a BBC television drama series originally broadcast in 1975 about the Pre-Raphaelite Brotherhood, written by John Hale, Ray Lawler, Robin Chapman and John Prebble. It was directed by Piers Haggard, John Glenister and Robert Knights. It was shown during January and February 1975.BFI database It includes six episodes, each episode is 75 minutes in length."]}, {"page": "Lost Hearts", "response": ["\"Lost Hearts\" was adapted by Robin Chapman in 1973 as part of the BBC's A Ghost Story for Christmas strand, directed by Lawrence Gordon Clark. The shortest of the adaptations, it was first broadcast on Christmas Day 1973 at 11:35 pm. It starred Simon Gipps-Kent as Stephen and Joseph O'Conor as the much older cousin. The adaptation is noted for the distinctive hurdy-gurdy music that accompanies appearances of the two ghostly children. Ralph Vaughan Williams' English Folk Song Suite is also featured."]}, {"page": "A Picture of Katherine Mansfield", "response": ["A Picture of Katherine Mansfield is a 1973 BBC television drama series starring Vanessa Redgrave as writer Katherine Mansfield, Jeremy Brett as her second husband John Middleton Murry, and Annette Crosbie as her life-long friend Ida Baker, known as L.M. The series consists of six fifty-minute parts each including episodes of Mansfield's life interwoven with adaptations of her short stories, dramatized by English novelist, playwright, and screenwriter Robin Chapman (1933–2020)."]}, {"page": "Cider Press Review Book Award", "response": ["* 2007 Robin Chapman, AbundanceRobin Chapman's Book Award Page"]}, {"page": "Georgy Porgy (short story)", "response": ["The story was dramatised in series two, episode nine of Tales of the Unexpected, first broadcast April 26, 1980. It was written by Robin Chapman and directed by Graham Evans. Joan Collins played both George's mother and Miss Roach. George was played by John Alderton."]}]}}