{"wiki_id": "http://www.wikidata.org/entity/Q162492", "itemLabel": "Colin Firth", "itemDescription": "English actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Colin_Firth", "wikipedia_page": {"main": "Colin Andrew Firth  (born 10 September 1960) is an English actor. He is the recipient of various accolades, including an Academy Award, a Golden Globe Award, two European Film Awards, two British Academy Film Awards, and three Screen Actors Guild Awards, as well as the Venice Film Festival Volpi Cup for Best Actor. In 2010, his portrayal of King George VI in Tom Hooper's The King's Speech won him the Academy Award for Best Actor.He was identified in the mid 1980s with the \"Brit Pack\" of rising young British actors, undertaking a challenging series of roles, including leading roles in A Month in the Country (1987), Tumbledown (1988) and Valmont (1989). His portrayal of Mr. Darcy in the 1995 television adaptation of Jane Austen's Pride and Prejudice led to widespread attention, and to roles in more prominent films such as The English Patient (1996); Shakespeare in Love (1998), Bridget Jones's Diary (2001), for which he was nominated for a BAFTA Award; Conspiracy (2001), The Importance of Being Earnest (2002), Girl with a Pearl Earring (2003), Richard Curtis's romantic comedy ensemble film Love Actually (2003), and the musical comedy Mamma Mia! (2008) and its sequel, Mamma Mia! Here We Go Again! (2018)\nIn 2009, Firth received international acclaim for his performance in Tom Ford's A Single Man, for which he gained the BAFTA Award and his first Academy Award nomination. He subsequently appeared as MI6 agent Bill Haydon in Tinker Tailor Soldier Spy (2011), and as secret agent Harry Hart in Kingsman: The Secret Service (2014) and its sequel Kingsman: The Golden Circle (2017). In 2018 he co-starred in the musical fantasy Mary Poppins Returns, and the following year, he appeared in the Sam Mendes' war film 1917. In 2012, he founded the production company Raindog Films, where he served as a producer for Eye in the Sky (2015) and Loving (2016). His films have grossed more than $3 billion from 42 releases worldwide. In 2011, he received a star on the Hollywood Walk of Fame, and was selected as one of the Time 100.Firth has campaigned for the rights of indigenous tribal people and is a member of Survival International. He has campaigned on issues of asylum seekers, refugees' rights and the environment. He commissioned and co-authored a scientific paper on a study of the differences in brain structure between people of differing political orientations.", "link_mentions": [{"page": "Ambrosius Aurelianus", "response": ["*In Valerio Massimo Manfredi's The Last Legion, Aurelianus (here called \"Aurelianus Ambrosius Ventidius\") is a major character and is shown as one of the last loyal Romans, going to enormous lengths for his boy emperor Romulus Augustus, whose power has been wrested by the barbarian Odoacer. In this story, Romulus Augustus marries Igraine, and King Arthur is their son, and the sword of Julius Caesar becomes the legendary Excalibur in Britain. In the 2007 film version of the novel, he is played by Colin Firth and his name becomes \"Aurelianus Caius Antonius\". In both he is called \"Aurelius\" for short."]}, {"page": "Anthony Hopkins", "response": ["In 1983, Hopkins also became a company member of The Mirror Theater Ltd's Repertory Company. In 1985, Hopkins starred opposite Colin Firth in the Arthur Schnitzler play The Lonely Road at The Old Vic. That same year, he featured in the National Theatre production of Pravda as Lambert Le Roux by David Hare and Howard Brenton.Gussow, Mel. \"\"THEATER: MIRROR REP, IN A REVIVAL OF 'RAIN'.\" The New York Times, 10 March 1984. Web. 10 January 2017. Frank Rich, in his New York Times review, praised the performance writing, \"Mr. Hopkins creates a memorable image of a perversely brilliant modern-day barbarian.\" In 1986 he starred in David Hare’s production of King Lear, Hopkins's favourite Shakespeare play, at the National Theatre. The next year, he starred as Antony in the National Theatre production of Antony and Cleopatra opposite Judi Dench, and in 1989, Hopkins made his last appearance on stage in a West End production of M. Butterfly. \"It was a torment\", he claimed in a later interview. Of a matinee where nobody laughed, there was, he said \"not a titter”. When the lights came up, the cast realised the entire audience was Japanese. \"Oh God,\" he recalled, \"You’d go to your dressing room and someone would pop their head round the door and say, ‘Coffee? Tea?’ And I’d think, ‘An open razor, please.’\""]}, {"page": "Blackadder", "response": ["Blackadder: Back & Forth was originally shown in the Millennium Dome in 2000, followed by a screening on Sky One in the same year (and later on BBC1). It is set on the turn of the millennium, and features Lord Blackadder placing a bet with his friends – modern versions of Queenie (Miranda Richardson), Melchett (Stephen Fry), George (Hugh Laurie) and Darling (Tim McInnerny) – that he has built a working time machine. While this is intended as a clever con trick, the machine surprisingly works, sending Blackadder and Baldrick back to the Cretaceous period, where they manage to cause the extinction of the dinosaurs through the use of Baldrick's best-worst-and-only pair of underpants as a weapon against a hungry T. Rex. Finding that Baldrick has forgotten to write dates on the machine's dials, the rest of the film follows their attempts to find their way back to 1999, often creating huge historical anomalies in the process that must be corrected before the end. The film includes cameo appearances from Kate Moss and Colin Firth."]}, {"page": "West Memphis Three", "response": ["Atom Egoyan directed a dramatized feature film of the case, titled Devil's Knot, released in U.S. theaters on May 9, 2014. The film stars Reese Witherspoon and Colin Firth."]}, {"page": "Dubbing (filmmaking)", "response": ["|John MalkovichKevin KlineMichael KeatonHugh LaurieColin Firth", "|Christoph WaltzColin FirthWoody HarrelsonTim RobbinsGary Oldman"]}, {"page": "Cinema of the United Kingdom", "response": ["Mainly outside the commercial sector, film makers from the new commonwealth countries had begun to emerge during the 1970s. Horace Ové's Pressure (1975) had been funded by the British Film Institute as was A Private Enterprise (1974), these being the first Black British and Asian British films, respectively. The 1980s however saw a wave of new talent, with films such as Franco Rosso's Babylon (1980), Menelik Shabazz's Burning an Illusion (1981) and Po-Chih Leong's Ping Pong (1986; one of the first films about Britain's Chinese community). Many of these films were assisted by the newly formed Channel 4, which had an official remit to provide for \"minority audiences.\" Commercial success was first achieved with My Beautiful Laundrette (1985). Dealing with racial and gay issues, it was developed from Hanif Kureishi's first film script. My Beautiful Laundrette features Daniel Day-Lewis in a leading role. Day-Lewis and other young British actors who were becoming stars, such as Gary Oldman, Colin Firth, Tim Roth and Rupert Everett, were dubbed the Brit Pack.Stern, Marlow, and in 1985 we saw the retirement of Roger Moore from the role of Bond after A View to a kill,at the age of 58.\"Gary Oldman Talks 'Tinker, Tailor, Soldier, Spy,' 'Batman' Retirement\". The Daily Beast. 8 December 2011. Retrieved 10 December 2013.", "The first decade of the 21st century was a relatively successful one for the British film industry. Many British films found a wide international audience due to funding from BBC Films, Film 4 and the UK Film Council, and some independent production companies, such as Working Title, secured financing and distribution deals with major American studios. Working Title scored three major international successes, all starring Hugh Grant and Colin Firth, with the romantic comedies Bridget Jones's Diary (2001), which grossed $254 million worldwide; the sequel Bridget Jones: The Edge of Reason, which earned $228 million; and Richard Curtis's directorial debut Love Actually (2003), which grossed $239 million. The most successful of all, Phyllida Lloyd's Mamma Mia! (2008), grossed $601 million."]}, {"page": "Halle Berry", "response": ["In the stand-up comedy concert film Kevin Hart: What Now? (2016), Berry appeared as herself, opposite Kevin Hart, attending a poker game event that goes horribly wrong. She provided uncredited vocals to the song, \"Calling All My Lovelies\" by Bruno Mars from his third studio album, 24K Magic (2016). Kidnap, an abduction thriller Berry filmed in 2014, was released in 2017. In the film, she starred as a diner waitress tailing a vehicle when her son is kidnapped by its occupants. Kidnap grossed US$34 million and garnered mixed reviews from writers, who felt that it \"strays into poorly scripted exploitation too often to take advantage of its pulpy premise — or the still-impressive talents of [Berry].\" She next played an agent employed by a secret American spy organisation in the action comedy sequel Kingsman: The Golden Circle (2017), as part of an ensemble cast, consisting of Colin Firth, Taron Egerton, Mark Strong, Julianne Moore, and Elton John. While critical response towards the film was mixed, it made US$414 million worldwide."]}, {"page": "Jane Austen", "response": ["From 1995 many Austen adaptations appeared, with Ang Lee's film of Sense and Sensibility, for which screenwriter and star Emma Thompson won an Academy Award, and the BBC's immensely popular TV mini-series Pride and Prejudice, starring Jennifer Ehle and Colin Firth.Troost (2007), 82–84. A 2005 British production of Pride and Prejudice, directed by Joe Wright and starring Keira Knightley and Matthew Macfadyen,Carol Kopp, \"The Nominees: Keira Knightley\", CBS News, 20 October 2008. was followed in 2007 by ITV's Mansfield Park, Northanger Abbey and Persuasion,Julia Day, \"ITV falls in love with Jane Austen\", The Guardian, 10 November 2005. and in 2016 by Love & Friendship starring Kate Beckinsale as Lady Susan, a film version of Lady Susan, that borrowed the title of Austen's Love and  [sic].Alonso Duralde, Alonso, \"'Love & Friendship' Sundance Review: Whit Stillman Does Jane Austen—But Hasn't He Always?\", The Wrap, 25 January 2016."]}, {"page": "Kevin Bacon", "response": ["In 2000, he appeared in Paul Verhoeven's Hollow Man. Bacon, Colin Firth and Rachel Blanchard depict a ménage à trois in their film, Where the Truth Lies. Bacon and director Atom Egoyan have condemned the MPAA ratings board decision to rate the film \"NC-17\" rather than the preferable \"R\". Bacon commented: \"I don't get it, when I see films (that) are extremely violent, extremely objectionable sometimes in terms of the roles that women play, slide by with an R, no problem, because the people happen to have more of their clothes on.\""]}, {"page": "My Fair Lady", "response": ["Columbia Pictures announced a new adaptation in 2008. The intention was to shoot on location in Covent Garden, Drury Lane, Tottenham Court Road, Wimpole Street and the Ascot Racecourse. John Madden was signed to direct the film, and Colin Firth and Carey Mulligan were possible choices for the leading roles. Emma Thompson wrote a new screenplay adaptation for the project, but the studio shelved it."]}, {"page": "Nicole Kidman", "response": ["In 2014, Kidman starred as the titular character in the biographical film Grace of Monaco, which chronicles the 1962 crisis in which Charles de Gaulle blockaded the tiny principality, angered by Monaco's status as a tax haven for wealthy French subjects and Kelly's contemplative Hollywood return to star in Alfred Hitchcock's Marnie. Opening out of competition at the 2014 Cannes Film Festival, the film received largely negative reviews. Kidman also starred in two films with Colin Firth that year, the first being the British-Australian historical drama The Railway Man, in which Kidman played an officer's wife. Katherine Monk of the Montreal Gazette said of Kidman's performance, \"It's a truly masterful piece of acting that transcends Teplitzky's store-bought framing, but it's Kidman who delivers the biggest surprise: For the first time since her eyebrows turned into solid marble arches, the Australian Oscar winner is truly terrific\". Her second film with Firth was the British thriller film Before I Go To Sleep, portraying a car crash survivor with brain damage. Also in 2014, she appeared in the live-action animated comedy film Paddington as the film's main antagonist."]}, {"page": "Pride and Prejudice", "response": ["Pride and Prejudice has engendered numerous adaptations. Some of the notable film versions include the 1940 Academy Award-winning film, starring Greer Garson and Laurence Olivier (based in part on Helen Jerome's 1936 stage adaptation) and that of 2005, starring Keira Knightley (an Oscar-nominated performance) and Matthew Macfadyen. Notable television versions include two by the BBC: a 1980 version starring Elizabeth Garvie and David Rintoul and the popular 1995 version, starring Jennifer Ehle and Colin Firth. This also includes Bride and Prejudice and Trishna (1985 Hindi TV Series).", "Helen Fielding's 1996 novel Bridget Jones's Diary is also based on Pride and Prejudice; the feature film of Fielding's work, released in 2001, stars Colin Firth, who had played Mr Darcy in the successful 1990s TV adaptation."]}, {"page": "September 10", "response": ["*  1960   – Colin Firth, English actor and producer"]}, {"page": "Stuttering", "response": ["A famous Briton who stammered was King George VI. George VI went through years of speech therapy, most successfully under Australian speech therapist Lionel Logue, for his stammer. This is dealt with in the Academy Award-winning film The King's Speech (2010) in which Colin Firth plays George VI. The film is based on an original screenplay by David Seidler, who also stuttered until age 16."]}, {"page": "Tom Waits", "response": ["A number of events have been held for fans of Waits's work, such as \"Waiting for Waits\" in Mallorca and the \"Straydogs Party\" in Denmark. Various cabaret shows have been held devoted to Waits's songs, including Robert Berdahl's Warm Beer, Cold Women and Stewart D'Arrietta's Belly of a Drunken Piano. When the actor Robert Carlyle formed a theatre, he named it the Rain Dog Theatre after Waits' album. Among the celebrities who have described themselves as Waits fans are Johnny Depp, John Oliver, Jordan Peterson, Jerry Hall, Megan Mullally, and Nick Offerman. In Britain, prominent figures who have described themselves as Waits fans include the historian Simon Schama, the writer Raymond Briggs, the presenter Graham Norton, and the actor Colin Firth. Musicians who noted their admiration for Waits' work included Elvis Costello, Bruce Springsteen, Nanci Griffith, Joe Strummer from the punk rock band The Clash, Michael Stipe of R.E.M., Frank Black of Pixies, and James Hetfield from the heavy metal band Metallica. Bob Dylan, who was a major influence on the young Waits, stated that Waits was one of his \"secret heroes\"."]}, {"page": "The Importance of Being Earnest", "response": ["Oliver Parker, a director who had previously adapted An Ideal Husband by Wilde, made the 2002 film; it stars Colin Firth (Jack), Rupert Everett (Algy), Judi Dench (Lady Bracknell), Reese Witherspoon (Cecily), Frances O'Connor (Gwendolen), Anna Massey (Miss Prism), and Tom Wilkinson (Canon Chasuble).Ebert, Roger, The Chicago Sun-TimesThe Importance of Being Earnest review 24 May 2002, accessed 3 May 2010. Parker's adaptation includes the dunning solicitor Mr. Gribsby who pursues \"Ernest\" to Hertfordshire (present in Wilde's original draft, but cut at the behest of the play's first producer). Algernon too is pursued by a group of creditors in the opening scene."]}, {"page": "Woody Allen", "response": ["Blue Jasmine debuted in July 2013. The film is set in San Francisco and New York, and stars Alec Baldwin, Cate Blanchett, Louis C.K., Andrew Dice Clay, Sally Hawkins, and Peter Sarsgaard. Opening to critical acclaim, the film earned Allen another Academy Award nomination for Best Original Screenplay, and Blanchett received the Academy Award for Best Actress.Nominees for the 86th Academy Awards | Academy of Motion Picture Arts & Sciences. Academy of Motion Picture Arts and Sciences (August 24, 2012). Retrieved May 22, 2014. Allen co-starred with John Turturro in Fading Gigolo, written and directed by Turturro, which premiered in September 2013.Bailey, Cameron (undated). \"Fading Gigolo\" . Toronto International Film Festival. Retrieved June 18, 2015. In 2013 Allen shot the romantic comedy Magic in the Moonlight with Emma Stone, and Colin Firth in Nice, France. The film is set in the 1920s on the French Riviera. The film was a modest financial success, earning $51 million off a budget of $16 million."]}, {"page": "1960", "response": ["**Colin Firth, English actor"]}, {"page": "Alan Rickman", "response": ["In November 2011, Rickman opened in Seminar, a new play by Theresa Rebeck, at the John Golden Theatre on Broadway. Rickman, who left the production in April, won the Broadway.com Audience Choice Award for Favorite Actor in a Play and was nominated for a Drama League Award. Rickman starred with Colin Firth and Cameron Diaz in Gambit (2012) by Michael Hoffman, a remake of the 1966 film. In 2013, he played Hilly Kristal, the founder of the East Village punk-rock club CBGB, in the CBGB film with Rupert Grint.", "Kate Winslet, who gave a tearful tribute at the London Film Critics' Circle Awards, remembered Rickman as warm and generous, adding, \"And that voice! Oh, that voice.\" Dame Helen Mirren said his voice \"could suggest honey or a hidden stiletto blade\". Emma Thompson remembered \"the intransigence which made him the great artist he was—his ineffable and cynical wit, the clarity with which he saw most things, including me... I learned a lot from him.\" Colin Firth told The Hollywood Reporter that, as an actor, Rickman had been a mentor. John McTiernan, director of Die Hard, said Rickman was the antithesis of the villainous roles for which he was most famous on screen. Sir Ian McKellen wrote, \"behind [Rickman's] mournful face, which was just as beautiful when wracked with mirth, there was a super-active spirit, questing and achieving, a super-hero, unassuming but deadly effective.\" Writer/director Kevin Smith told a tearful 10-minute story about Rickman on his Hollywood Babble On podcast. Rickman's family offered their thanks \"for the messages of condolence\"."]}]}}