{"wiki_id": "http://www.wikidata.org/entity/Q16200669", "itemLabel": "Henry Bromley", "itemDescription": "British politician (1761-1836)", "wikipedia_url": "https://en.wikipedia.org/wiki/Henry_Bromley_(died_1836)", "wikipedia_page": {"main": "Colonel Henry Bromley (fl. 10 March 1803 - d. 1836) was Member of Parliament for Worcester City from the General Election in October 1806 until he resigned on 13 February 1807, rather than defend a bribery allegation by the defeated candidate.On 10 March 1803 he inherited the Manorship of Abberley together with the patronage of St. Mary's church in the village.", "link_mentions": [{"page": "Abberley", "response": ["On 10 March 1803 Colonel Henry Bromley inherited the Manorship of Abberley. As he had no son, on his death in 1836, the manor was put up for sale by his executors and bought by John Lewis Moilliet of Geneva. He built a new house, Abberley Hall, but  he died in 1845 before it was completed.Victoria County History  History of the County of Worcester: volume 4 1924 Accessed 20.10.2014", "* Henry Bromley MP for Worcester City and Lord of the Manor"]}, {"page": "Abberley Hall", "response": ["* 1803–1837: Colonel Henry Bromley"]}, {"page": "Henry Bromley", "response": ["Henry Bromley may refer to:", "*Henry Bromley (died 1615) (1560–1615), English MP for Plymouth, Worcestershire and Shropshire", "*Henry Bromley (died 1670) (1632–1670), English MP for Worcestershire", "*Henry Bromley, 1st Baron Montfort (1705–1755), British landowner and politician", "*Henry Bromley (writer) (1750?–1814?), real name Anthony Wilson, English writer on art", "*Henry Bromley (died 1836) (c.1761–1836), British MP for Worcester, 1806", "*Sir Henry Bromley, 4th Baronet (1816–1895) of the Bromley baronets", "*Sir Henry Bromley, 5th Baronet (1849–1905) of the Bromley baronets"]}, {"page": "Henry Bromley (died 1837)", "response": ["#REDIRECTHenry Bromley (died 1836)"]}, {"page": "Sir George Smith, 1st Baronet", "response": ["**Sir George Pauncefote-Bromley, 2nd Baronet (1753–1808), High Sheriff of Gloucestershire in 1775. In 1778 he assumed by Royal licence the surname and arms of Bromley in lieu of his patronymic and in 1803 he assumed by Royal licence the surname of Pauncefote in addition to that of Bromley, having inherited or purchased the outstanding moities of his maternal estates of Carswalls and Preston from his mother's childless first-cousin Robert Bromley (d.1803) of Abberley. Robert Bromley (d.1803) thus disposed of his maternal estates to the descendant of his mother's sister, but his paternal estate of Abberley he bequeathed to his illegitimate kinsman Col. Henry Bromley (c.1803-1836), a  Member of Parliament for Worcester 1806-7, illegitimate son of a certain William Bromley. In 1778 he married Esther Curzon, who brought with her a large dowry, a daughter of Assheton Curzon, 1st Viscount Curzon (1730-1820) of Hagley Hall in Staffordshire. However by 1782 it had become clear to his wife that he was homosexual: Lady Bromley observed an increasing impertinent familiar behaviour of Sr George Bromley to his male servants, but inspecting (suspecting) as she was of the cause, it past on for some time until his conduct discovered evident proof to her of a strong propensity to the vice of sodomitical practices he separated himself from her bed grew less attentive and soon almost entirely alienated his affections, if he ever entertained any, for her, and directed all his thoughts and actions to his favourite male servants spending the whole of his time with them in his study or in amusements under the pretences of fishing and having one constantly to sleep in the same room with him.Tim White Following the complaint of one of his male servants, he was tried at Nottingham Assizes in 1791 and was convicted for assault and attempted sodomy and was jailed for 2 years, and was divorced by his wife. By his wife he had a son and heir:"]}]}}