{"wiki_id": "http://www.wikidata.org/entity/Q16254076", "itemLabel": "Hue Montgomery", "itemDescription": "British singer", "wikipedia_url": "https://en.wikipedia.org/wiki/Hue_Montgomery", "wikipedia_page": {"main": "The Foundations were a British soul band (m. 1967–1970). The group's background was West Indians, White British, and Sri Lankan. Their 1967 debut single \"Baby Now That I've Found You\" reached number one in the UK and Canada, and number eleven in the US, while their 1968 single \"Build Me Up Buttercup\" reached number two in the UK and number three on the US Billboard Hot 100. The group was the first multi-racial group to have a number one hit in the UK in the 1960s.The Foundations were one of the few British acts to successfully imitate what became known as the Motown Sound. The Foundations signed to Pye, at the time one of only four big UK record companies (the others being EMI, which included the HMV, Columbia and Parlophone labels, Decca, and Philips, which also owned Fontana).\n\n", "link_mentions": [{"page": "The Foundations", "response": ["There was another line-up formed in 1999 that included Young (vocals), Alan Warner (Guitar), Steve Bingham (bass), Gary Moberly (keyboards), Tony Laidlaw (sax) and Sam Kelly then Steve Dixon (drums). This version of the group was re-formed due to the popularity of the film There's Something About Mary, and the interest created resulting from the 1968 hit \"Build Me Up Buttercup\" being featured in the film. Some time later Young left this version of the group and was replaced by Hue Montgomery (aka Hugh Montgomery)."]}, {"page": "Alan Warner (musician)", "response": ["In the late 1990s, due to the popularity of the hit film,  There's Something About Mary and the revived interest in the song, \"Build Me Up Buttercup\", Warner reformed a version of The Foundations that featured Colin Young, and another former Foundations member, Steve Bingham. After Colin Young left another singer Hue Montgomery was brought in to front the group. and they toured throughout the UK and down under in Australia.", "By January 2009, Warner was the lead singer and lead guitarist of a group called Flashback, and has also been booked at various venues with his other group Alan Warner's Foundations featuring singer Hue Montgomery."]}, {"page": "Colin Young", "response": ["In 1999, a version of The Foundations was reformed that included Colin Young (vocals), Alan Warner (Guitar), Steve Bingham (bass), Gary Moberly (keyboards), Tony Laidlaw (sax) and Sam Kelly then Steve Dixon (drums). This version of the group was formed due to the popularity of the film There's Something About Mary and the interest created resulting from the 1968 hit \"Build Me Up Buttercup\" being featured in the film. Some time later Young left this version of the group and was replaced by Hue Montgomery (aka Hugh Montgomery)."]}, {"page": "Steve Bingham (bassist)", "response": ["In 1999, because of the popularity of the film There's Something About Mary, the renewed interest in '\"Build Me Up Buttercup\" and The Foundations, a version of the band reformed with Colin Young on vocals, Alan Warner on guitar, Bingham on bass, and Gary Moberley on keyboards, etc. The group stayed together for a period of time seeing a change of the lead singer with Hue Montgomery replacing Colin Young."]}, {"page": "Hue (name)", "response": ["* Hue Montgomery, singer of the Foundations"]}]}}