{"wiki_id": "http://www.wikidata.org/entity/Q16232914", "itemLabel": "Scrufizzer", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Scrufizzer", "wikipedia_page": {"main": "Amary Lorenzo,  better known as Scrufizzer, is an English MC and producer from West London.  Who first gained recognition as a grime producer before building a reputation for his bashment-influenced flow and versatility.", "link_mentions": [{"page": "List of hip hop musicians", "response": ["* Scrufizzer"]}, {"page": "Adam F", "response": ["2009 saw Adam back in the studio, this time with Horx to remix The Prodigy's \"Take Me to the Hospital\" from their album Invaders Must Die. Months later, Adam collaborated with Horx again to release \"Shut The Lights Off\" with Redman. Adam F and DJ Fresh's 2010 collaboration single under the artist name WTF?! was next, built around Dead Prez's \"Hip Hop\". Over the past few years Adam has remixed David Guetta, Rihanna, Afrojack, Missy Elliott, Sander van Doorn and Scrufizzer."]}, {"page": "Reading and Leeds Festivals line-ups", "response": ["* Scrufizzer"]}, {"page": "Godiva Festival", "response": ["* Scrufizzer"]}, {"page": "Friction (English musician)", "response": ["Friction has collaborated several times with British singer-songwriter and rapper Example. Since Friction's 2011 remix of his #1 hit single \"Changed the Way You Kiss Me\", Example has co-written songs for Friction (\"Led Astray\" and \"Long Gone Memory\") and Friction has co-produced an album track for Example (\"Snakeskin\"). Friction also collaborated with English electronic musician Skream in the 2013 song \"Kingpin\" (featuring UK grime MCs Scrufizzer, P Money and Riko Dan from Roll Deep)."]}, {"page": "Samantha Mumba discography", "response": ["|align=\"left\"| \"Evolution 2\" (Kid Bookie featuring Kxng Crooked, Kuniva, Samantha Mumba, Lady Leshurr, Scrufizzer, Zeph Ellis)"]}, {"page": "Keep Up (EP)", "response": ["Keep Up is the debut extended play (EP) by British YouTube personality and rapper KSI. It was released on 8 January 2016 through Island Records. The EP features guest appearances from Jme, Tiggs da Author, Lunar C, Nick Brewer, Randolph, Youngs Teflon, Sway and Scrufizzer. The EP charted at number 13 on the UK Albums Chart.", "*Scrufizzer – vocals, songwriter (track 4)"]}, {"page": "Ed Sheeran discography", "response": ["! scope=\"row\"| \"You Need Me, I Don't Need You\" (True Tiger Remix featuring Dot Rotten and Scrufizzer)"]}, {"page": "Vato Gonzalez", "response": ["! scope=\"row\"| \"Bump & Grind (Bassline Riddim)\"(featuring Scrufizzer)"]}, {"page": "Skream discography", "response": ["* \"Kingpin\" (with Friction) (featuring Scrufizzer, P Money & Riko Dan) (2013)"]}, {"page": "Zeph Ellis", "response": ["! scope=\"row\"| \"You Need Me, I Don't Need You\" (True Tiger Remix)(Ed Sheeran featuring Dot Rotten & Scrufizzer)", "! scope=\"row\"| \"Evolution 2\"(Kid Bookie featuring Samantha Mumba, Crooked I, Kuniva D12, Lady Leshurr, Scrufizzer and Dot Rotten)"]}, {"page": "Work (The 2 Bears song)", "response": ["# \"Work\" (Toddla T Remix)[feat. Trim, Scrufizzer & Trigganom] - 3:29"]}, {"page": "Old (Danny Brown album)", "response": ["Old includes production from American, British and Canadian record producers such as A-Trak, BadBadNotGood, Frank Dukes, Oh No, Paul White, Rustie and Skywlkr, among others. The album also features guest appearances from fellow artists such as Freddie Gibbs, ASAP Rocky, Schoolboy Q, Ab-Soul, Scrufizzer, Charli XCX and Purity Ring. It was supported by three singles, \"Dip\", \"25 Bucks\" and \"Smokin & Drinkin\".", "In December 2012, Brown announced ODB had been completed. Brown continued stating \"it's about 75% done\" and in the mixing stages. Brown also revealed the album would include contributions from ASAP Rocky, Schoolboy Q, Ab-Soul, Kitty and Purity Ring, the latter of whom are contributing production along with a hook from vocalist Megan James. On May 3, 2013, Brown added Freddie Gibbs, Mr. MFN eXquire, Scrufizzer and Charli XCX, to the list of guest appearances on the album. He also revealed the production was handled by Paul White, Oh No, Rustie, Skywlkr, A-Trak, Darq E Freaker and Frank Dukes. He collaborated with Charli XCX after being a fan of hers and meeting her through Twitter. He later remixed her song \"What I Like\", and in turn she contributed to the album.", "* Scrufizzer – featured artist"]}, {"page": "Loadstar (duo)", "response": ["It was announced in February that the duo would be releasing their debut album, titled Future Perfect, on 5 May 2013. However, this was later delayed to 26 May. On 8 February, they released the track \"Drowning\" from the album as a free download. On 21 April 2013, \"Refuse to Love / Flight\" featuring uncredited vocals from Takura was released as the album's second single. On 9 May 2013, they announced the fifteen-track standard edition album track list. It includes guest appearances from Scrufizzer, Takura, Jakes, Benny Banks, Jenn D, Hadouken! and Lloyd Yates. The deluxe edition of the album features seven extra tracks. On 7 June 2014, \"Give It To Me\" appeared in the pilot episode of American crime drama Power.", "In 2013, the duo produced grime and UK rap songs for Dot Rotten, Benny Banks and Scrufizzer. They also produced P Money's 2013 single \"Round the Clock\", the title track from his EP on Rinse. \"Bomber\" was featured in Gran Turismo 6 in 2013. The first single after Future Perfect, entitled \"Stepped Outside\" / \"Under Pressure\", was released on 6 April 2014. On 17 April, \"Stepped Outside\" was added to BBC Radio 1Xtra's C-list, and it rose to their B-list on 24 April, staying in rotation for the following week. The song features uncredited vocals from Caan. On 13 July 2014, Dot Rotten released his second studio album Interview for free download, which included the Loadstar production \"Determination\"."]}, {"page": "Lady Leshurr", "response": ["! scope=\"row\"| \"Move\"(Fire Camp featuring Lady Leshurr and Scrufizzer)", "! scope=\"row\"| \"Hoods Up\" (Remix)(Teddy Music featuring Lil Nasty, Double S, Lady Leshurr, Scrufizzer, Dot Rotten and Tre Mission)", "! scope=\"row\"| \"Evolution 2.0\"(Kid Bookie Samantha Mumba, Kuniva, Crooked I, Scrufizzer, Lady Leshurr & Dot Rotten)"]}, {"page": "Jay Fay", "response": ["| Friction and Skream featuring Scrufizzer, P Money and Riko Dan"]}, {"page": "Kick It (Scrufizzer song)", "response": ["\"Kick It\" is a song by English rapper Scrufizzer. It was released on 4 October 2013. The track was produced by Zed Bias. The song reached number 62 in the UK Singles Chart.", "The official video for \"Kick It\" premiered on 18 August 2013, at a total length of 3 minutes and 41 seconds. An acoustic A64 of the song was filmed for SB.TV in which Scrufizzer also freestyled.", "Category:Scrufizzer songs"]}, {"page": "The Last Skeptik", "response": ["Douieb has worked with artists such as Giggs, Kojey Radical, Mikill Pane, Lunar C, Sway, and MF Grimm, Trim, and Scrufizzer.", "*Drumroll Please Single (2017, with Dream Mclean, Jordan Stephens, Mikill Pane and Scrufizzer", "*Love Affair (2015) Scrufizzer x Haile WSTRN", "*Story of Jin (2015) Scrufizzer "]}, {"page": "Kid Bookie", "response": ["Whilst working as part of Dot Rotten's minarmy Kid Bookie forged connections and collaborated with a range of established artists including D12 members Kuniva and Swifty McVay, Slaughterhouse (Group)'s Crooked I as well as popstar Samantha Mumba. These efforts ultimately resulted in a track entitled 'Evolution' which also featured Scrufizzer, Lady Leshurr and indeed Dot Rotten himself. The track premiered on BBC 1Xtra with DJ Cameo on 7 July 2014 and has since then been reworked with underground producer Teeza, the video for which premiered on the UK music platform, SB.TV.", "*2014: \"Evolution 2.0 The Temix\" (Featuring) Samantha Mumba, Kuniva, Crooked I, Scrufizzer, Lady Leshurr & Dot Rotten"]}, {"page": "Rap Rave", "response": ["#REDIRECT Scrufizzer#Singles"]}, {"page": "TCTS", "response": ["| Motez (producer) featuring Scrufizzer"]}, {"page": "List of UK Independent Singles Breakers Chart number ones of the 2010s", "response": ["|Scrufizzer"]}, {"page": "Dirty Dancer (disambiguation)", "response": ["* \"Dirty Dancer\", a 2011 song by Oh My! featuring Scrufizzer"]}, {"page": "Scruffizer", "response": ["#REDIRECT Scrufizzer"]}, {"page": "2014 UK Music Video Awards", "response": ["* Scrufizzer – \"Kick It\""]}]}}