{"wiki_id": "http://www.wikidata.org/entity/Q16240210", "itemLabel": "Ian Ker", "itemDescription": "English Roman Catholic priest, scholar and author", "wikipedia_url": "https://en.wikipedia.org/wiki/Ian_Ker", "wikipedia_page": {"main": "Ian Ker (born 1942) is an English Roman Catholic priest, scholar and author.   He is generally regarded as the world's authority on John Henry Newman, on whom he has published more than twenty books.Father Ian Ker teaches theology at Oxford University, where he is a senior research fellow at Blackfriars, Oxford, and a member of the Faculty of Theology .  He has taught both English literature and theology at universities in the UK and USA.  Father Ker is generally regarded as the leading authority on Saint John Henry Newman, on whom he has published the universally acknowledged definitive biography.  He is also the author of The Catholic Revival in English Literature 1845-1961,  Mere Catholicism, and G.K. Chesterton: A Biography. On this last book, the late Christopher Hitchens reviewed that \"Professor Ker's spirited and double-barreled attempt at a rehabilitation\" of Chesterton \"is enjoyable in its own right.\"", "link_mentions": [{"page": "G. K. Chesterton", "response": ["Of his nonfiction, Charles Dickens: A Critical Study (1906) has received some of the broadest-based praise. According to Ian Ker (The Catholic Revival in English Literature, 1845–1961, 2003), \"In Chesterton's eyes Dickens belongs to Merry, not Puritan, England\"; Ker treats Chesterton's thought in Chapter 4 of that book as largely growing out of his true appreciation of Dickens, a somewhat shop-soiled property in the view of other literary opinions of the time. The biography was largely responsible for creating a popular revival for Dickens's work as well as a serious reconsideration of Dickens by scholars."]}, {"page": "Catholic literary revival", "response": ["The Catholic literary revival is a term that has been applied to a movement towards explicitly Catholic allegiance and themes among leading literary figures in FranceRichard Griffiths, The Reactionary Revolution: The Catholic Revival in French Literature 1870-1914 (Constable, 1966). and England,Ian Ker, The Catholic Revival in English Literature (1845–1961): Newman, Hopkins, Belloc, Chesterton, Greene, Waugh (University of Notre Dame Press, 2003). roughly in the century from 1860 to 1960. This often involved conversion to Catholicism or a conversion-like return to the Catholic Church. The phenomenon is sometimes extended to the United States."]}, {"page": "Classics of Western Spirituality", "response": ["* John Henry Newman: Selected Sermons, edited by Ian Ker (1994, )"]}]}}