{"wiki_id": "http://www.wikidata.org/entity/Q16202305", "itemLabel": "Martyn Campbell", "itemDescription": "English bass guitarist", "wikipedia_url": "https://en.wikipedia.org/wiki/Martyn_Campbell", "wikipedia_page": {"main": "Martyn Craig Campbell (born 1970 in Liverpool) is an English bass player.\nHe is best known for his work with Rain, The Lightning Seeds, Richard Ashcroft, Wah! and Terry Hall. Campbell has also worked with Pete Wylie, and toured with Shack.", "link_mentions": [{"page": "Cast (band)", "response": ["Due to Tyson's touring commitments with Robert Plant to promote the latter's latest album Carry Fire (which includes several songs co-written by Tyson), he was unable to participate in Cast's U.K. shows from late November to mid-December 2017. In his absence, Lewis switched from bass to lead guitar, and filling in on bass was Martyn Campbell, best known as a member of The Lightning Seeds and a close friend of O'Neill's who had toured together with the drummer as part of Kealer's backing band. Campbell had also played bass on Power's debut solo album Happening for Love and on Richard Ashcroft albums. After fulfilling his duties with Robert Plant, Tyson returned to Cast halfway through their tour, in which they were the opening act for Shed Seven."]}, {"page": "The Lightning Seeds", "response": ["* Martyn Campbell – bass, backing vocals (1994–2000, 2009–present)"]}, {"page": "Ian Broudie", "response": ["Broudie returned with a new line-up in 2009, releasing the album Four Winds, and has extensively toured since with a line-up including old Seeds favourites Angie Pollack (piano), Martyn Campbell (guitar), and Ian's son Riley Broudie (guitar)."]}, {"page": "Human Conditions", "response": ["*Martyn Campbell – bass"]}, {"page": "The Stands", "response": ["The Stands were formed by Howie Payne in 2002 following the split of the Edgar Jones fronted The Big Kids, for whom Payne had played lead guitar. Early local shows featured a revolving cast of backing musicians, including brother Sean Payne and Russell Pritchard (both fellow ex-Big Kids members and later of The Zutons) and session player Martyn Campbell. Payne then set about putting together a more permanent lineup and recruited local acoustic singer-songwriter/drummer Steve Pilgrim on drums and Luke Thomson on guitar. The trio, along with Campbell on Bass, recorded a selection of demos at Parr St Studios in Liverpool, which were reportedly financed by Payne roadying for The Zutons on the first UK tour.", "In September 2002, the ITV program \"This Is Music\" filmed a special episode focusing on the emerging new music scene in Liverpool, centered on The Bandwagon night, ran by members of local band The Bandits at The Zanzibar venue. Due to the band being newly formed and having performed few shows, they were not set to appear until the other bands petitioned the producers of the show to add The Stands to the program, which they did and the band performed All Years Leaving, with Russell Pritchard filling in on bass. Having watched the band perform, local musician Dean Ravera asked to join the band after the show. He joined the band a week later and the band were shortly after invited to support The Coral on their imminent autumn UK tour. During the tour, Payne received a phone call from Noel Gallagher who had been given a copy of the Parr St demos by Martyn Campbell at the Oasis show at Old Trafford Cricket Ground, where Campbell was playing with support act Richard Ashcroft. Gallagher invited the band to support Oasis at their upcoming show in Liverpool at the Royal Court in December 2002, and were subsequently asked to support Oasis again for two nights at the NIA in Birmingham. In early 2003 and still unsigned without management, the band supported the likes of The Burn, Alfie, Stephen Fretwell, The Zutons and further shows with The Coral. The band were also invited to play Glastonbury, V Festival, T in the park and two further shows with Oasis at the Point Theatre in Dublin."]}, {"page": "Jollification", "response": ["By the end of 1993, Broudie had completed the third Lightning Seeds album Jollification, which included contributions from Terry Hall, Simon Rogers, Alison Moyet and Ian McNabb. A promotional tour began in August 1994 with their line-up consisting of, guitarist Paul Hemmings, drummer Chris Sharrock, bassist Martyn Campbell and keyboardist Ali Kane. The tour benefited from the success of the second single from the album \"Change\", which reached No. 13 in the UK Singles Chart, becoming Lightning Seeds' second UK top twenty hit. The album Jollification became a critical success and the other singles taken from this album (\"Lucky You\", \"Marvellous\" and \"Perfect\") all made noticeable impact. Mark Farrow's album cover featured the use of computer graphics to create an enormous strawberry and depicting seeds with superimposed human faces."]}, {"page": "Kello Rovers F.C.", "response": ["*  Martyn Campbell - Ayr United"]}, {"page": "Shack (band)", "response": ["In October 2007, the band released their greatest hits compilation album, Time Machine, including two new tracks. They toured briefly in England in October and November with Martyn Campbell on bass, including a set at the Liverpool Academy on 26 October 2007, which was filmed and recorded for a possible live album and/or DVD.", "In February 2008, the band re-formed the Pale Fountains for two critically acclaimed live shows in Liverpool and London.  The members of the reformed band were Michael Head, John Head, Martyn Campbell, Andy Diagram, Thomas 'Jock' Whelan and Iain Templeton. Since 2008, John Head has pursued a solo career playing live shows with his band The Streams. Michael Head launched a new project Michael Head & The Red Elastic Band on his own label Violette Records.", "* Martyn Campbell – bass (1992, 2007–present)"]}, {"page": "Dizzy Heights", "response": ["\"What If...\" was released October 1996 in the UK. It peaked at No. 14 in the charts and, continuing in the vein of the previous single, included a cover of The Beach Boys' \"Here Today\"What If, Sugar Coated discography, lightning-seeds.co.uk. Retrieved 1 April 2011. as a cassette-only B-side. The single's title track, co-written by Terry Hall and Broudie, featured a poppy sound reminiscent of The Turtles' \"Happy Together\". The song is regarded as a stand-out track of the album by Broudie himself, who cites The Beach Boys and The Turtles as influences behind the song.Like You Do – The Greatest Hits Interview with Ian Broudie and Martyn Campbell", "* Martyn Campbell – bass, backing vocals"]}, {"page": "Tilt (The Lightning Seeds album)", "response": ["* Martyn Campbell – bass, backing vocals"]}, {"page": "Pure (The Lightning Seeds song)", "response": ["The first Lightning Seeds single release, \"Pure\" is significant in that it was the first song Broudie had \"completely written and sung, ever\".Like You Do - The Greatest Hits Interview with Ian Broudie and Martyn Campbell It was when producing a track for The Pale Fountains that Broudie was offered a chance to release some of his own material. He was originally apprehensive:"]}, {"page": "Happening for Love", "response": ["* Martyn Campbell – bass"]}, {"page": "List of English people", "response": ["* Martyn Campbell (born 1970), bassist of The Lightning Seeds"]}, {"page": "Lo Fi Acoustic Excursions by Mike Badger & Friends", "response": ["* Martyn Campbell - backing vocals, bass, percussion, acoustic guitar (tracks 2, 7 and 14)"]}, {"page": "Lo Fi Electric Excursions by Mike Badger & Friends", "response": ["Martyn Campbell - bass guitar (tracks 3, 7 and 11)"]}, {"page": "Mike Badger's Country Side", "response": ["Martyn Campbell - bass guitar, backing vocals (tracks 5, 10 and 13)"]}, {"page": "Rain (British band)", "response": ["The band was formed at the Merseyside Trade Union Community and Unemployed Resource Centre in Huyton, Liverpool, in 1988 with a line-up of Ned Murphy (vocals, guitar), Colin Clarke (vocals, guitar), Martyn Campbell (bass guitar, vocals), and Tony McGuigan (drums).Strong, Martin C. (2003) \"Rain\", in The Great Indie Discography, Canongate, , p. 935-6Larkin, Colin (1998) The Virgin Encyclopedia of Indie & New Wave, Virgin Books, , p. 346 They were signed by Columbia Records in late 1989, and began recording with Nick Lowe producing. Unhappy with the results, they did not release any material until their 1991 debut single \"Lemonstone Desired\", which reached number 95 in the UK Singles Chart, and was the source of some controversy due to the photograph of a naked woman on the sleeve.\"Rain\", Chart Stats, retrieved 2010-11-21 The band recorded a session for Mark Goodier's BBC Radio 1 show in March that year.Garner, Ken (1993) In Session Tonight, BBC Books, , p. 285 This was followed by debut album A Taste of Rain, drawing comparisons with Cream, R.E.M., and the Byrds, and a single featuring the title track from the album. The album was followed by a reissued \"Lemonstone Desired\", which proved to be the band's final release while together, although they shared a posthumous split album with The Real People in 1996, featuring tracks mainly taken from their album."]}]}}