{"wiki_id": "http://www.wikidata.org/entity/Q16216833", "itemLabel": "Tim Weaver", "itemDescription": "English crime writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Tim_Weaver_(author)", "wikipedia_page": {"main": "Tim Weaver (born 1977) is an English writer primarily known for his crime thrillers featuring missing persons investigator David Raker.", "link_mentions": [{"page": "Turok 2: Seeds of Evil", "response": ["Although the graphics were widely praised for their details, the game's inconsistent frame rate and intense distance fog were generally criticized. Peer Schneider of IGN said that, unlike its predecessor, Seeds of Evil \"forgoes framerate for detail so often [that] some gamers will definitely be put off by the choppiness\". The music and sound effects were highlighted positively. GameSpot said that the soundtrack is \"well suited to the game and never intrusive\", while Victor Lucas of The Electric Playground described it as \"suspenseful, dynamic and always adrenaline charged\". Similarly, Tim Weaver of N64 Magazine credited the music for being \"dramatically scored, with strings, tom toms, bass lines and nerve-juddering screeches as enemies spring out at you from all angles\". He also remarked that the soundtrack's loop was well disguised."]}, {"page": "Legion in popular culture", "response": ["* Legion  is the name of the main villain, a disturbed veteran of the conflict in Afghanistan, in Chasing the Dead, a 2010 thriller by journalist and writer Tim Weaver."]}, {"page": "NGC Magazine", "response": ["The staff of NGC Magazine varied over the years. Memorable staff members included Jonathan Davies, James Ashton, Jes Bickham, Dan Geary, Tim Weaver, Wil Overton, Mark 'Greener' Green, Martin 'Kittsy' Kitts, Andrea Ball, Dr Mark Cousens, Zy Nicholson, Geraint Evans, Justin Webb, Miriam 'Mim' McDonald, Steve Jalim and Paul 'Shedwards' Edwards.", "The magazine took usual light-hearted digs at each of its own staff; Jes was regularly lampooned due to his bald head; Mark Green had an evil alter-ego named Dark Mark; Andrea Ball was apparently permanently covered in grease and fake tan, and also had a reputation for carrying a constantly trademarked \"Big Stick™\"; Dr Mark Cousens was mocked for his apparent lack of a Nintendo Entertainment System console; Tim Weaver was famed for his patented Emotionless Stare; and James Ashton was ridiculed mercilessly in the magazine's pages for continually failing to pass his driving test. To this very day, he drives his Ferraris on a provisional license. Geraint was often also the subject of jokes, due to his Welsh origins, with regular pokes at him and his culture and lifestyle."]}, {"page": "Mission: Impossible (1998 video game)", "response": ["Criticism was targeted at the game's trial and error progression and unbalanced levels, with Tim Hsu of GameRevolution noting that it is sometimes difficult to know what to do in a given situation. Electronic Gaming Monthly acknowledged that Mission: Impossible has some interesting missions and locations, but ultimately concluded that most of the puzzles are tedious and that the game requires a lot of patience. The game's controls also frustrated critics. Tim Weaver, writing for N64 Magazine, said that the game has poor analog stick detection. He explained that Hunt \"almost never walks because a touch in any direction just sends him scuttling into a full-paced sprint\". Other reviewers noted long delays when shooting enemies and that quick reactions are hampered by the game's low frame rate."]}, {"page": "Nintendo Gamer", "response": ["* Tim Weaver"]}, {"page": "Xbox World", "response": ["In September 2005, Xbox World relaunched as Xbox World 360 under the guidance of former NGC editor Tim Weaver. It contains an achievements/hint/cheats/walkthrough book and a double sided four-hour disc including a DVD side and a HD side to be run on the Xbox 360.", "In the November 2011 issue, the magazine was revamped and reverted to its original name of Xbox World. The Christmas 2011 issue was Tim Weaver's last issue as editor of the magazine. He is now the managing editor, while PSM3's Andy Hartup took over as editor."]}, {"page": "Norton Hill School", "response": ["* Tim Weaver, author."]}, {"page": "List of books from the Richard & Judy Book Club", "response": ["* Tim Weaver – Never Coming Back ", "* Tim Weaver – No One Home"]}, {"page": "Tim Weaver", "response": ["Tim Weaver is a retired American soccer defender who played two seasons in Major League Soccer with the San Jose Clash."]}]}}