{"wiki_id": "http://www.wikidata.org/entity/Q16207101", "itemLabel": "Kevin Shine", "itemDescription": "English cricketer (born 1969)", "wikipedia_url": "https://en.wikipedia.org/wiki/Kevin_Shine", "wikipedia_page": {"main": "Kevin James Shine (born 22 February 1969) is a former first-class cricketer and former coach of Somerset County Cricket Club, and was the fast-bowling coach for the England cricket team from 2006 until 2019. In November 2019 he joined Nottinghamshire County Cricket Club as an Assistant Coach.His first-class career ran from 1989 to 1998, during which he played for Hampshire, Middlesex and Somerset. He took 249 first-class wickets at an average of 36.09, including 55 in the 1997 season. His best innings figures were 8 for 47 for Hampshire against Lancashire in 1992.", "link_mentions": [{"page": "National Cricket Performance Centre", "response": ["*ECB Fast-Bowling Programme Lead: Kevin Shine"]}, {"page": "Jason Kerr (cricketer)", "response": ["After back injury curtailed his career at the end of 2002, Bridgwater Cricket Club appointed Kerr as director of coaching in 2004 to spearhead their West of England Premier League promotion bid. He succeeded Ben Wellington, who resigned in early February 2004 because of his commitments as a full-time coach at Somerset's Centre of Excellence. Kerr returned to Somerset as a self-employed coach in 2005, before taking up the Academy Directors post full-time in February 2006, replacing the ECB bound Kevin Shine. At the end of the 2013 season, Kerr was promoted to the role of First XI bowling coach."]}, {"page": "Mike Burns (cricketer)", "response": ["The following season was another difficult one for both Burns and Somerset. Burns scored 733 first-class runs, but only passed 50 on five occasions, including a top score of 124 not out against Essex. Four wins late in the season pushed Somerset up to fourth in the second division of the County Championship, but the county were knocked out of the 2004 Cheltenham & Gloucester Trophy in the third round, and they finished eighth of ten in the second division of the totesport League. Their elimination from the Cheltenham & Gloucester Trophy came at the hands of Worcestershire; after Somerset had won the toss and Burns had chosen to bat, his side were bowled out for 95 runs, the tenth lowest List A total for the county. Burns was dismissed for a first-ball duck in the match, which Wisden reported was dominated by the \"muscular hostility\" of Andy Bichel, who took four wickets for Worcestershire. Both Burns and Somerset's first-team coach, Kevin Shine were criticised for the team's failures; Shine was reassigned as the county's academy director, while a committee of former captains was set up to assess the captaincy. On the recommendations of the group, composed of Roy Kerslake, Vic Marks and Brian Rose, Somerset signed the captain of the South Africa national cricket team, Graeme Smith, to lead them in 2005."]}, {"page": "List of Somerset County Cricket Club players", "response": ["* Kevin Shine (1996–1998) 33 matches CA"]}, {"page": "Southampton Evening Cricket League", "response": ["Several notable Test and county cricketers have played in the league, including Robin Smith, Kevin Shine, Gary Brent and Adrian Aymes. "]}, {"page": "Matt Hobden", "response": ["His death was announced by Sussex County Cricket Club, who said that \"Matthew was an exciting young cricketer with a big future ahead of him in the game.\" Speaking after Hobden's death, England fast bowling coach Kevin Shine said, \"his potential was huge. He was improving rapidly and I'm certain that he would have played for England\", and about his performance on the PEPP that, \"he was the strongest, most powerful cricketer I've ever seen on that programme\". The England Cricket Team official Facebook page posted, \"we are shocked and saddened to hear of the death of Matthew Hobden. Our thoughts are with his family, friends and team-mates.\" Out of respect for Hobden, England players wore black armbands during the second day of the 2nd Test against South Africa on 3 January. Angus Porter, head of the Professional Cricketers' Association described Hobden as \"a young seamer with immense potential.\" Sussex County Cricket Club announced that Hobden's shirt number (19) would be retired, and a tree would be planted at the County Ground in memory of Hobden."]}, {"page": "Shine (surname)", "response": ["* Kevin Shine (born 1969), a former first-class cricketer and former coach of Somerset County Cricket Club"]}]}}