{"wiki_id": "http://www.wikidata.org/entity/Q16203046", "itemLabel": "JS Clayden", "itemDescription": "British singer", "wikipedia_url": "https://en.wikipedia.org/wiki/JS_Clayden", "wikipedia_page": {"main": "JS Clayden (born Jonathan Seth Clayden, 24 March 1971) is a British singer/songwriter. He is best known as the lead vocalist of the band Pitchshifter. He moved to several towns in the United Kingdom, settling in Nottingham, England for a number of years before emigrating to Los Angeles, California. He is also the brother of Pitchshifter's bassist, Mark Clayden.", "link_mentions": [{"page": "Pitchshifter", "response": ["right|thumb|upright|Vocalist JS Clayden in June 2008", "In 2009, the band announced in their official website that they were working on a new album. Frontman JS Clayden stated that \"It's been refreshing to get back in the demo studio. We are taking this record in a few places we haven't been before in terms of guitar work. Brian Harrah [Professional Murder Music and Tura Satana] is writing with me on guitar at The Manor Studios, and Jason is jamming at his place. So far we are having a blast and kicking ass. There are a few new moves in terms of song timing and vocals that have us all jazzed. I guess you'll just have to wait and see what we came up with.\" In late 2009, guitarist Tim Rayner was diagnosed with b cell lymphoma while on vacation in Australia and underwent treatment. In February 2010, he arrived in the UK and started radiotherapy. The band headlined the Wakefield Rock Festival on 15 May 2010.", " bar:JSClayden text:\"JS Clayden\""]}, {"page": "De Montfort University", "response": ["* JS Clayden, vocalist for Pitchshifter, founder of PSI Records"]}, {"page": "Www.pitchshifter.com", "response": ["The album's name comes from the band's domain name - a relative novelty at the time of the release. The domain name registration was eventually lapsed; JS Clayden said \"we carried the website for such a long time that it felt like a burden being lifted to let it go\".", "*Johnny Carter and JS Clayden - writer"]}, {"page": "Pigface", "response": ["*JS Clayden (Pitchshifter)"]}, {"page": "Earache Records", "response": ["Over the years, the relationship between the label and some of its former artists have become fraught, and Pearson has made a number of disparaging blog posts about, among others, JS Clayden from Pitchshifter and Barney Greenway of Napalm Death. Greenway responded that Pearson \"expects everybody to be subservient\", while Clayden called Pearson \"petty and vindictive\" and criticized the label for not allowing fans to stream or purchase Pitchshifter's albums that were released on Earache. In the documentary Slave to the Grind, Scott Carlson from Repulsion accused Earache of not paying the band, adding \"I'm sure they sold way more records than they told us they did.\" Former Iron Monkey drummer Justin Greaves accused Earache of refusing to support the band financially in an emergency when during a European tour, singer Johnny Morrow fell sick and needed to return to the UK, which the band couldn't afford to cover."]}, {"page": "P.S.I.entology", "response": ["#\"Drive Me\" by JS Clayden side project Doheny"]}]}}