{"wiki_id": "http://www.wikidata.org/entity/Q16239457", "itemLabel": "Duncan Johnston", "itemDescription": "British composer", "wikipedia_url": "https://en.wikipedia.org/wiki/Duncan_Johnston_(songwriter)", "wikipedia_page": {"main": "Duncan Johnston (1881–1947), also Duncan Johnstone or Donnachadh MacIain in Gaidhlig, was a songwriter from Islay, Scotland, UK. He is best known for his 1938 book Cronan nan Tonn (The Croon of the Sea). The Royal National Mòd has an annual prize, the Duncan Johnston Trophy, named after him. Johnston, along with Charles MacNiven (1874–1944), Duncan MacNiven (1880–1955), and William Livingston (1808–1870), is one of the Islay Bards.", "link_mentions": [{"page": "Godred Crovan", "response": ["In the wake of Macpherson's publications, several examples of Manx folksongs appear to have first come to light. One particular piece, a Manx Gaelic song called Fin as Oshin, is the only example of  existing in Manx musical tradition.Broderick (2018) pp. 63, 73, 76; Broderick (1990) pp. 51–53. Surviving in several eighteenth-century manuscripts,Broderick (2018) pp. 63–66; Ó Muircheartaigh (2016). Fin as Oshin tells a tale similar to other poems recounting the story of the burning of Finn's house.Broderick (2018) pp. 73–74, 80–81; Broderick (1990) pp. 53–54 n. 13, 54–58; Moore, AW (1891) pp. 10–12; Campbell (1872) pp. 175–180. A central character in the song is a certain Gorree/Orree/Orree Beg, a hero who corresponds to Garadh/Garaidh in cognate tales. The spelling of this hero's name in Fin as Oshin suggests that he represents Godred himself, thereby giving the story a native slant.Broderick (2018) pp. 66–67, 74–75; Ó Muircheartaigh (2016) pp. 104–105, 121; Broderick (1990) pp. 53, 53–54 n. 13. Godred's place in this song probably accounts for its survival in local memory.Broderick (2018) pp. 75–76. In Vindication of the Celtic Character, the nineteenth-century Gaelic poet William Livingstone offered imaginative accounts of Viking incursions on Islay. One such tale, alleged by Livingstone to have been \"handed down from the Danish mythologists of those days\", concerns exploits of Godred in the island's Loch Indaal vicinity. Livingstone's versions of such local traditions appear to be the inspiration behind his epic Gaelic battle-poem Na Lochlannaich an Ile (\"The Norsemen in Islay\").Kidd (2006); Whyte (1991) pp. 175–176; Livingston (1882) pp. 1–37; Livingston (1850) pp. 147–150. The Gaelic folk song Birlinn Ghoraidh Chróbhain, sometimes called Birlinn Ghoraidh Chrobhain and Godred Crovan's Galley, was composed by Duncan Johnston, and released in part one of his 1938 book Cronan nan Tonn. Johnston's song describes the journey of Godred's royal birlinn from Mann to Islay, and commemorates the sea-power of the Crovan dynasty.McDonald (2007b) p. 53, 53 n. 62; Johnston (1997) p. 28."]}, {"page": "Duncan Johnston", "response": ["Duncan Johnston was born at 32 Heriot RowEdinburgh and Leith Post Office Directory 1847-8 in Edinburgh on 25 June 1847 the son of Henry Johnston, a surgeon in the Honourable East India Company. His brothers included Henry Johnston, Lord Johnston and the high-ranking advocate and cricketer, Sir William Campbell Johnston FRSE.https://www.royalsoced.org.uk/cms/files/fellows/biographical_index/fells_indexp1.pdf", "Johnston made his cricketing debut for Derbyshire in the 1882 season against Lancashire in May and played in the next three matches. He was an opening batsman for Derbyshire but with the exception of 31 against Sussex failed to score highly. His last game was  against the touring Australians, which the tourists won by an innings margin, with the help of a ten-wicket match haul by Fred Spofforth. Johnston was a right-handed batsman and played 8 innings in 4 games with a top score of 31 and an average of 8.12.Duncan Johnston at Cricket Archive", "thumb|left|The grave of Sir Duncan Johnston, Dean Cemetery, Edinburgh"]}, {"page": "William Lawrie", "response": ["In 1914 he became Pipe Major of the 8th Argyllshire Battalion of the Argyll and Sutherland Highlanders and served with them in France from 1915 to 1916 when he became ill as a result of trench conditions. He was invalided to England where he died in the Third Southern General Hospital in Oxford, possibly as a result of contracting pneumonia and pleurisy in the trenches and then meningitis after being admitted to hospital. He left behind his wife Una and three children, who were all aged under five when he died. A 'marbhrann' (gaelic lament) was written upon his death by the Islay bard Duncan Johnston who was a close personal friend."]}]}}