{"wiki_id": "http://www.wikidata.org/entity/Q16213995", "itemLabel": "Mark Hill", "itemDescription": "Welsh musician, songwriter and record producer", "wikipedia_url": "https://en.wikipedia.org/wiki/Mark_Hill_(musician)", "wikipedia_page": {"main": "Mark Leslie Hill (born 22 December 1972 in Cwmbran, Wales) is a Welsh musician, songwriter and record producer. He rose to fame as one half of the Artful Dodger and co-writer and producer of Craig David's multi-platinum debut studio album, Born to Do It. Since he began releasing music in 1997, Hill has achieved four Ivor Novello Awards, a number one album, two number one singles and over 10 million records sales worldwide.", "link_mentions": [{"page": "December 22", "response": ["*  1972   – Mark Hill, English musician, producer and songwriter"]}, {"page": "Artful Dodger (duo)", "response": ["The band originally consisted of producers Mark Hill (born 22 December 1972 in Cwmbran, Wales) and Pete Devereux. What began as a handle for the release of underground bootleg recordings quickly blossomed into a musical project creating original material for mainstream release Paul Ridney,  and culminated in the release of It's All About the Stragglers, after the duo went on to work with an array of up-and-coming vocalists.Sam,  This version of Artful Dodger became defunct as of 10 July 2001.NME,  The Artful Dodger name is currently the property of Blessed Records, also known as Public Demand Records, and is represented on the live circuit by DJ Dave Low and MC Alistair. When the original two producers, Mark Hill and Pete Devereux, formally announced the reestablishment of their creative partnership in 2017, they reunited under the name \"Original Dodger\".Amy Heaton, ", "==== Mark Hill ====", "Mark Hill was admitted to the school of music at the University of Southampton as a percussionist as a teenager. Prior to Artful Dodger, he had performed with the Welsh Philharmonic Orchestra as a percussionist, and played in jazz bands.Paul Lester, Simon Reynolds,  He had also worked as a session musician.", "Pete Devereux first found his way towards Mark Hill when he booked time at his and Neil Kerrs' studio, after discovering it in the YellowPages.", "The origins of Artful Dodger lie in an R&B remix crew of producers, which included Mark Hill and Pete Devereux, known as Back to the Future. This group disbanded due to a lack of financial success. In 1997, Hill and Devereux joined forces to create bootleg editions of tracks including \"Dreams\" by Gabrielle, \"You're Not Alone\" by Olive, and \"If You Love Me\" by Brownstone, releasing these under the Artful Dodger moniker, under Fagin Records.GetDarker Editorial, ", "Both Artful Dodger and Fagin were intended to be disposable aliases adopted to protect their identities and shield them from potential lawsuits from record companies, which might be inclined to pursue them for their unauthorised sampling of other artists' work. The name Artful Dodger was decided on over coffee, at a meeting between Mark Hill and Pete Devereux in Southampton. Names such as Dick Turpin and Robin Hood were also under consideration, but Artful Dodger held greater appeal due its association with the city of London; regarded by many as the capital of the garage sound.", "Mark Hill was first introduced to Craig David when a friend was working on a project associated with a youth centre linked to the Southampton football club, using Mark Hill and business associate, Neil Kerrs' studio. Craig David was a soloist on the project, and Hill noted him for his talent. Hill next encountered David in a club 'years later'; finding that he was already familiar with the bootleg vinyl releases he had completed with Devereux as Artful Dodger, and with Artful Dodger being in need of a vocalist to contribute to their original instrumental tracks, Hill invited David to return to his studio. This led to a series of vinyl releases, via Artful Dodger's own label for the release of their original tracks, Centric Records, including \"Something\", \"What Ya Gonna Do\" and, most notably, \"Re-Rewind\". Following an initial 'white label' release, these were then licensed on to any interested record labels. The original plan was for David to be the frontman for Artful Dodger. Plans changed once David signed to a different record label and hired professional artist management; David was to use Artful Dodger to launch his solo career, thus leaving Hill and Devereux to become \"unwitting popstars\" as the frontmen of Artful Dodger.Joe Muggs, ", "It was announced on 10 July 2001 that Pete Devereux was leaving Artful Dodger.NME,  The official statement emphasised that the parting of ways was 'amicable'. This news came immediately prior to the release of the single \"TwentyFourSeven\", featuring Melanie Blatt [different version to that which appears on It's All About the Stragglers]. Hill alone represented Artful Dodger in the cover art for the single and the video clip. Fatigued from a hectic tour schedule, having 'strained' relationships with certain colleagues, wanting to focus more on a behind-the-scenes music industry role as producer, and with a view towards doing more work with Craig David, Mark Hill left Artful Dodger, and Devereux returned, before leaving once again. It was in the midst of all of this that the Artful Dodger name was sold, or otherwise changed hands.", "The transfer of the 'Artful Dodger' moniker has been the source of a great deal of speculation and critical commentary, expressed on social media sites including Facebook, Twitter and YouTube, and has been explained by Hill and Devereux variously across numerous interviews.Mya Joel,  The common theme articulated in these interviews is that the duo express their anger and frustration over the fact that two different people, only one of which had any, albeit limited and 'guest status' involvement in the creation of the Artful Dodger music, were seemingly able to achieve exclusive control over the Artful Dodger name, play at events, participate in interviews with journalists who were apparently unaware that the constitution of the group had changed,Kim Do,  and most disconcertingly, appeared to take credit for the music that had made the original duo famous. That promoters would at times use photos of the original duo to advertise events featuring the new duo heightened the prevailing confusion. Whenever the opportunity presented itself in the natural course of the conversation however, DJ Dave Low has been known to pay homage to Mark Hill when being interviewed. In a 2011 interview with iFILM London, DJ Dave Low named Mark Hill as a current, but apparently dormant member of Artful Dodger. According to public records provided by the Intellectual Property Office - UK [IPO], there was no trademark of the terms 'The Artful Dodger' under the stipulated classes 9, 16, 25, 28, 41 prior to it being assigned to Mark Hill, as a consequence of a process initiated on 7 July 2001.", "In a 2019 interview, Mark Hill described complex details regarding the transfer of the Artful Dodger name, consisting of the claim that as part of his departure from Artful Dodger, he had entered into a pact with Pete Devereux, part of which involved Devereux acquiring ownership of the Artful Dodger name; Public Demand subsequently acquired the name from Pete Devereux and have retained it to the present day. This version of events is somewhat substantiated by public records provided by the Intellectual Property Office - UK, which show that the 'Artful Dodger' name was transferred from Mark Hill to Pete Devereux on 27 January 2003. Pete Devereux transferred it to Public Demand Records on 1 May 2003. The trademark was transferred once again on 22 May 2008, from Public Demand Records to Blessed Records. Discogs lists Blessed Records as a 'sublabel' of Public Demand Records.", "Once the Artful Dodger name came under the direct control of Public Demand Records, the duo which ultimately emerged and stands as the current incarnation of Artful Dodger has come to consist of MC Alistair, who had been a featured artist on tracks by the original Artful Dodger, and was now upgraded to the status of being a permanent member of the group; in addition to newcomer, DJ Dave Low. Both have toured the brand extensively and internationally over subsequent years as a DJ and MC duo; frequently being billed to appear alongside period genre peers including DJ Luck and MC Neat, and successors such as So Solid Crew. In addition to playing garage tracks, their repertoire has expanded to include tracks from the dubstep, deep funky house, soulful house, bassline, electro, jungle, drum and bass, and rare groove genres, curated to fit with the atmosphere at the event. Mark Hill has emphasised that he does not endorse this incarnation of Artful Dodger, and has communicated that he is sceptical of the inclusion of MC Alistair, dismissing it as an attempt by 'the label' to 'add legitimacy'.", "In the immediate aftermath of the departure of Pete Devereux in July 2001, Billboard reported that it was anticipated that Mark Hill would complete a sophomore Artful Dodger album for release in the summer of 2002; this however never eventuated. ", "In August 2016, a 'selfie' entered circulation on Facebook showing Mark Hill and Pete Devereux, fingers to their lips, with the hashtag #mumstheword. The pair were 'convening' for the purpose of thinking of solutions to problems stemming from the fact that they had lost control of the Artful Dodger name, including the issue that those who had established themselves in their stead were answering interview questions as though they were responsible for the creation of the Artful Dodger music, which was making it difficult for them to get bookings. As a consequence of the unexpected positive response to the possibility of a reunion of the original duo, in 2017, Mark Hill and Pete Devereux formally announced the reestablishment of their creative partnership, reuniting as Original Dodger.Jaguar,  Leading the charge was the 2017 single, \"Millionaire\".John Twells,  News indicated that an '11 track release' was due to emerge, titled Soundtrack, and a tracklist was published.Jaguar,  Soundtrack was to take the form of a 'mixtape', and was to serve as the precursor to an album release. Later in 2017, the single \"Find Space\", featuring Shakka, was released, which was followed in 2018 by a 4-track EP titled Momentum, led by the single \"Bubblin\", featuring Daniel Bedingfield.The Partae, Akshay Bhanawat,  Disappointing sales of these early releases meant that a record deal with Warner Music Group was terminated in late 2018. Mark Hill indicated that as a consequence of this, any further Original Dodger material would be released independently."]}, {"page": "Louise Redknapp", "response": ["In 2002, Redknapp signed a £1.5 million contract with her manager Oliver Smallman's Positive Records (a division of Universal Music) to record her fourth solo album. The album was due for release in 2004 alongside the single \"Bounce Back\". However, due to the singer becoming pregnant with her son Charley, the album was never released. The only single released from the album was the double A-side \"Pandora's Kiss\"/\"Don't Give Up\", which peaked at number five and raised money for Tickled Pink/Breast Cancer Care. The unreleased album saw Louise work with the likes of Sylvia Bennett Smith and Marc 'M2E' Smith, Mark Hill and Pete Martin. The album would also have included Louise's first duet with boy band 3rd Wish on the track \"Don't Ever Change\"."]}, {"page": "Craig David", "response": ["The success of David's debut, which was written almost entirely by David and Mark Hill of Artful Dodger, led to the United States release of \"Fill Me In\" in May 2001. It reached number 15 on the Billboard Hot 100 chart. Born to Do It was released in the United States on 17 July 2001, peaking at number 11 on the Billboard 200 chart and sold over 1 million copies. The single \"7 Days\" hit the top 10 in the U.S.; although \"Walking Away\", which had reached number 3 in the UK and number 5 in Australia, missed the top 40 in the U.S. and was the last of his singles to chart there."]}, {"page": "Christina Milian (album)", "response": ["Following her collaboration with Ja Rule, Milian signed a deal with Island Def Jam Music Group in 2000. Milian traveled to Sweden and recorded her self-titled debut album, working with the popular producers of that time. Milian collaborated with Bloodshy & Avant, Jermaine Dupri, Focus, Irv Gotti, Mark Hill, Montell Jordan and Evan Rogers. Soren Baker of the Los Angeles Times later suggested that instead of launching her career off the success of \"Between Me and You\", and by recording in Sweden without the \"platinum production touch\" of Irv Gotti, the owner of The Inc. Records, the momentum created by the song had evaporated. Milian received writing credit for eleven of the twelve songs on the album. It was during the production of the album that Milian had first started to write songs, and wrote about things that she could relate to at the time."]}, {"page": "Born to Do It", "response": ["Born to Do It is the debut studio album by English singer Craig David, released in the United Kingdom on 14 August 2000 by Wildstar Records and in the United States later in 2001 by Atlantic Records. Following exposure from his work with British group Damage, David began performing vocals for garage duo Artful Dodger. During this time, Wildstar Records became aware of David, offering him a development deal before offering an album contract. The recording for the album began in 1999 before David had acquired a record contract, the recording lasted until 2000 and was composed by David himself and Mark Hill.", "After David and Mark Hill met, Hill enlisted David to feature on Artful Dodger's debut album. Hill found it hard to pay David for his appearances so instead offered him studio time and help with production at a small recording studio in Southampton. The album's recording began in 1999 and lasted through until 2000, Hill took responsibility for the album's production along with David, whilst David wrote the majority of the album's lyrics with co-writing from Hill. Hill stated that because there was no label during this time the pair had more creative freedom when creating the album;", "*Mark Hill – producer (tracks 1, 3–5, 7–14), mixing (tracks 3–6, 8, 10–14), additional vocals (tracks 3, 4)"]}, {"page": "Slicker Than Your Average", "response": ["*Mark Hill - producer (tracks 4, 6, 9, 12)"]}, {"page": "The Story Goes...", "response": ["AllMusic rated the album 3 out of 5, and said of the record: \"Picking himself up and signing to Warner Bros. Records after the demise of his Wildstar/Telstar record label, David offers The Story Goes... as a very personal album filled with his own experiences over the past few years, including his own relationship breakdown in \"Don't Love You No More (I'm Sorry),\" being mesmerized by a woman during his partying phase on the tracks \"Hypnotic\" and \"Just Chillin',\" and another doomed liaison on the song \"One Last Dance.\" The song \"Johnny\" delves deeper into his past as he explores the subject of bullying, and the line \"I didn't want to tell you anything in case it made things worse\" would strike a chord with many a victim. David has a unique style of singing more words than should have been able to fit into each line, but it works for him. \"Separate Ways\" is back to \"Fill Me In\" standards, and he also has a habit of answering his own lines through a voicebox, as on \"Thief in the Night.\" He strays into Enrique Iglesias territory on the song \"Unbelievable,\" but without the smoldering Latin passion. Produced by long-term David collaborator Mark Hill, The Story Goes... appears to fall between an urban R&B-flavored Usher-styled album and his earlier more hip-hop-influenced work with the Artful Dodger. It couldn't be both.\"", "*Mark Hill - producer (tracks 1, 2, 4-6, 13, 14)"]}, {"page": "TwentyFourSeven (song)", "response": ["Artful Dodger initially consisted of Mark Hill and Pete Devereux, but Devereux left prior to the release of the single \"TwentyFourSeven\", making this the first single of Artful Dodger as a stage name for Mark Hill.", "Category:Songs written by Mark Hill (musician)"]}, {"page": "Corinne Bailey Rae", "response": ["In 2004, Bailey Rae got a breakthrough when she was signed by Global Talent Publishing and then approached by Craig David's mentor Mark Hill, from the duo the Artful Dodger, to appear on his new album better luck next time under his new alias, the stiX. The resulting collaboration, \"Young and Foolish\", was released in April 2005 and brought Bailey Rae to the attention of the major record label bosses."]}, {"page": "The stiX", "response": ["The stiX is a project by record producer Mark Hill of Artful Dodger. Each track features a guesting British vocalist, most notably Corinne Bailey Rae. "]}, {"page": "Better Luck Next Time (The Stix album)", "response": ["Better Luck Next Time is the debut album release from UK artist and producer Mark Hill, working under the moniker The stiX. It was released on April 18, 2005.", "All tracks produced by Mark Hill.", "* Mark Hill"]}, {"page": "Sarah Masen (album)", "response": ["* Mark Hill - bass"]}, {"page": "Rebecca Worthley", "response": ["Worthley recorded her first album, Myths and Elegies, in 2005. The album was voted one of the top 25 independent albums of 2006 by indie-music.com.\"City folk singer Rebecca Worthley has released her latest album Morning Comes to Those Who Wait\", Express & Echo, 2008-08-01, p. 4. The following year she met music producer Mark Hill who helped produce her 2006 eponymously titled EP. The acoustic version of Worthley's song \"Consumed\", which is recorded on both CDs, was used that year on a YouTube video about sweatshop labor.Sweatshop Labour - Consumed, YouTube, 6 September 2006 In April 2007, Worthley was the first musician to perform on SofaGig, an online music venue.Rebecca Worthley, Sofagig, 1 April 2007 She was the only musician from outside Plymouth invited to perform for The Still Sessions at Plymouth Gin Distillery for an acoustic compilation album.\"Gin firm helps bands distill sounds on compilation CD\", The Plymouth Evening Herald, 2007-06-06, p. 15.Robinson, Clare. \"Vintage year for live music\", The Plymouth Evening Herald, 2007-12-28, p. 5. Rebecca has also received national airplay on BBC Radio 2,Rebecca Worthley, Interview, BBC Devon, 18 January 2007 and performed a live session with Radio 2 producer Bob Harris on 17 February 2007.\"The vibraphonic music festival is returning to city\", Western Morning News, 2007-02-23, p. 23. Her new album Morning Comes to Those Who Wait was released on Peppy Records in June 2008 and features two tracks by producer Sean Genockey."]}, {"page": "Walking Away (Craig David song)", "response": ["\"Walking Away\" is a song by English singer Craig David. It was written by David and Mark Hill and released as the third single from his debut studio album, Born to Do It (2000), on 20 November 2000. It reached number three in the United Kingdom and number one in New Zealand, where it became the number-one song of 2001, combining both sales and airplay.", "Category:Songs written by Mark Hill (musician)"]}, {"page": "Fill Me In", "response": ["Category:Songs written by Mark Hill (musician)"]}, {"page": "Hidden Agenda (Craig David song)", "response": ["\"Hidden Agenda\" is a song by English singer Craig David. It was released on 6 January 2003 as the second single from his second studio album, Slicker Than Your Average (2002). The song became his eighth top-10 hit in the United Kingdom (including his Artful Dodger collaborations), peaking at number 10 and spending six weeks inside the UK top 75. After the change in sound between his debut album Born to Do It and \"What's Your Flava?\", the lead single from Slicker Than Your Average, \"Hidden Agenda\" returned David to the sound for which he was known for in his worldwide hits such as \"7 Days\" and \"Walking Away\" and re-united him with Artful Dodger record producer Mark Hill. The instrumental part of the song was compared to that of O-Town's We Fit Together."]}, {"page": "You Don't Miss Your Water ('Til the Well Runs Dry)", "response": ["Category:Songs written by Mark Hill (musician)"]}, {"page": "All the Way (Craig David song)", "response": ["\"All the Way\" is a song  recorded by the British singer Craig David. It was released on 8 August 2005 as the lead single from his third studio album The Story Goes... (2005). The song is written by Craig David and Mark Hill. It was the first single he released with new label Warner Bros. Records after Wildstar Records went bankrupt. After missing the top ten with previous singles \"World Filled with Love\" and \"You Don't Miss Your Water ('Til the Well Runs Dry)\", \"All the Way\" returned David to the top three. It was the highest-charting single from The Story Goes... but not the biggest-selling as \"Don't Love You No More (I'm Sorry)\" spent over double the number of weeks inside the UK top 75. The music video became the sixth Craig David video directed by Max & Dania.", "Category:Songs written by Mark Hill (musician)"]}, {"page": "Don't Love You No More (I'm Sorry)", "response": ["Category:Songs written by Mark Hill (musician)"]}, {"page": "Mark Hill", "response": ["* Mark Hill (antiques expert) (born 1975), British antiques expert", "* Mark Hill (cricketer) (born 1964), Australian cricketer", "* Mark Hill (English footballer) (born 1961), English football player (Maidstone United)", "* Mark Hill (musician) (born 1972), British recording artist, songwriter and record producer", "* Mark Hill (Scottish footballer) (born 1998), Scottish football player (St Mirren)"]}, {"page": "List of UK garage artists", "response": ["* Mark Hill"]}, {"page": "Greatest Hits (Craig David album)", "response": ["*Mark Hill - producer (tracks 1, 2, 6, 8, 9, 11, 14, 16, 18), mixing (tracks 2, 9, 18), additional vocals (track 9)"]}, {"page": "List of University of Southampton people", "response": ["* Mark Hill, record producer; member of Artful Dodger band"]}, {"page": "Re-Rewind (The Crowd Say Bo Selecta)", "response": ["In February 2016, David revealed that, after the recording session, the song was nearly lost forever: \"We finished the song and dubbed it onto a little TDK D90 cassette to go and play it in the car,\" he says. \"It sounded good but there was a couple of little tweaks we wanted to do – and literally as [producer Mark Hill] turned the computer on, all we saw was this 'error, file number' message. The only way to get rid of it was to press OK. So we pressed OK, and it kept coming up with new error numbers. So we'd press OK, press OK, press OK. But when we looked at the session, all that we saw was the hi-hats. I was like, 'are you actually for real?' So that plastic TDK tape became gold dust. We had the whole song on there, and we had to use the recording as our reference, playing it very carefully so it didn't get chewed up, and trying to remember all the things we did. And that was 'Re-Rewind'.\"", "Category:Songs written by Mark Hill (musician)"]}, {"page": "Osmosis Jones (soundtrack)", "response": ["*\"Fill Me In\" written by Craig David and Mark Hill and performed by Craig David"]}, {"page": "Woman Trouble (song)", "response": ["Category:Songs written by Mark Hill (musician)"]}, {"page": "Open Mic UK", "response": ["The judging panel for the National Grand Final included: Kerrang Radio, Planet Rock, and 4Music presenter Alex Baker; Sony Music Entertainment talent producer Eddie Evelyn-Hall; Mark Hill  - who boasts four Ivor Novello Awards, a number one album, two number one singles and over 10 million record sales worldwide; managing director of River Studios, Gareth Henderson - who has produced for the likes of Alesha Dixon, Corinne Bailey Rae, Birdy and Luke Friend; Tanya Anderson - who has choreographed for acts on the JLS Farewell Tour and the Music Video Awards; A&R scout for Universal Music Group James Morgan; showbiz journalist Jon Hornbuckle; founder of www.music-news.com Marco Gandolfi; songwriter/producer Simon Britton - who has worked with the likes of Eminem, Sting, Usher, Michael Jackson, and Sean Paul; producer and presenter for BBC Introducing Merlin D; and head of Future Music Management Chris Grayston.", "*Mark Hill (2008–2014)"]}, {"page": "Silya", "response": ["After Multicyde, Silya began working with the Murlyn Music production house in Stockholm as a songwriter. Silya wrote the singles \"Kiss Your Mama!\" recorded by Australian artist Vanessa Amorosi and \"Masterplan\" recorded by Swiss artist Stefanie Heinzmann that both went gold in their respective countries. She also wrote the songs \"Sneakernight\" and \"Last Night\" on Vanessa Hudgens' album Identified. Most recently, Silya's song \"Rock With You\" was recorded by Rachel Crow, who came in fifth place on the U.S. The X Factor. Silya has worked with the likes of Cee Lo Green (Gnarls Barkley), Printz Board (Black Eyed Peas, Macy Gray, Nikka Costa), Lester Mendez (Shakira, Nelly Furtado), J.R. Rotem (Rihanna), and Mark Hill (Craig David, Artful Dodger)."]}, {"page": "Archean Soundtrack", "response": ["Later that year, the band entered the annual Live and Unsigned competition. The talent contest has previously been judged by Noddy Holder, Annie Nightingale, Mark Hill and BBC Radio 1 DJ Ras Kwame. Archean Soundtrack made it to the finals, but in the end were beaten by CoCo and the Butterfields."]}, {"page": "TeenStar", "response": ["The judging panel that crowned Luke Friend 2013's winner included; former BBC Radio 1 DJ and Choice FM presenter Ras Kwame; four time Ivor Novello Awards winner and one half of the successful garage duo Artful Dodger (UK band) - Mark Hill (musician); Choice FM presenter E Plus; The X Factor's Jake Quickenden; Capital FM producer and celebrity journalist Jon Hornbuckle; editor of TeenStar partner Shout magazine Ali Henderson; Head of Baby Girl Music Michael King and Head of Future Music Chris Grayston.", "Judges included four time Ivor Novello award winner Mark Hill, James Meadows (A&R from Universal Music), Andy Baker (Music Manager from Resound Media), Rock School's Stuart Slater, Editor in Chief of Shout magazine Laura Brown and head of Future Music Chris Grayston. For the pre teen category Dutch Van Spall from Big Help Management replaced James Meadows."]}, {"page": "Recovery (Justin Bieber song)", "response": ["Category:Songs written by Mark Hill (musician)"]}, {"page": "Journals (album)", "response": ["*\"Recovery\" contains samples of \"Fill Me In\", written by Craig David and Mark Hill."]}, {"page": "Please Don't Turn Me On", "response": ["Category:Songs written by Mark Hill (musician)"]}, {"page": "Niraj Chag", "response": ["Born in Southampton, England, Niraj's first professional experience in music was working on Mark Hill's label."]}, {"page": "UK garage", "response": ["Early 2011 saw the start of a gradual resurgence of 2-step garage. Producers such as Wookie, MJ Cole, Zed Bias and Mark Hill (formerly one half of Artful Dodger) made a return to the scene, by producing tracks with more of a 2-step feel. Electronic music duos Disclosure and AlunaGeorge, both successful throughout 2012 and 2013, often use elements of UK garage in their music, and arguably, some of their biggest hits including \"You & Me\" and \"We Are Chosen\" respectively, are entirely 2-step with an updated cleaner sound. Shortly following this, \"original\" style garage had made a return in a big way, with producers such as Moony, DJD and Tuff Culture paving the way. One of the genre's pioneering labels, Ice Cream Records, responsible for anthems such as \"RipGroove\", True Steppers' \"Out of Your Mind\", Kele Le Roc's \"My Love\" and more, opened up their permanent roster for the first time to include DJs outside of the legendary trio that launched the label."]}]}}