{"wiki_id": "http://www.wikidata.org/entity/Q16236647", "itemLabel": "Anthony Watson", "itemDescription": "English rugby union footballer", "wikipedia_url": "https://en.wikipedia.org/wiki/Anthony_Watson_(rugby_union)", "wikipedia_page": {"main": "Anthony Watson (born 26 February 1994) is an English professional rugby union player who plays wing or full-back for Bath Rugby in Premiership Rugby and since 2014 has been a regular player for the England national team, starting the 2019 Rugby World Cup Final and winning over 50 caps.  Watson toured with the British & Irish Lions in 2017 and 2021, playing tests in both years.", "link_mentions": [{"page": "British & Irish Lions", "response": ["*  Anthony Watson", "Following his winning tour of Australia in 2013, Warren Gatland was reappointed as Lions Head Coach for the tour to New Zealand in June and July 2017. In April 2016, it was announced that the side would again be captained again by Sam Warburton. The touring schedule included 10 games: an opening game against the Provincial Barbarians, challenge matches against all five of New Zealand's Super Rugby sides, a match against the Māori All Blacks and three tests against . The Lions defeated the Provincial Barbarians in the first game of the tour, before being beaten by the Blues three days later. The team recovered to beat the Crusaders but this was followed up with another midweek loss, this time against the Highlanders. The Lions then faced the Māori All Blacks, winning comfortably to restore optimism and followed up with their first midweek victory of the tour against the Chiefs. On 24 June, the Lions, captained by Peter O'Mahony, faced New Zealand in Eden Park in the first Test and were beaten 30–15. This was followed by the final midweek game of the tour, a draw against the Hurricanes. For the second Test, Gatland recalled Warburton to the starting team as captain. In Wellington Regional Stadium, the Lions beat a 14-man New Zealand side 24–21 after Sonny Bill Williams was red-carded at the 24-minute mark after a shoulder charge on Anthony Watson. This tied the series going into the final game, ending the side's 47-game winning run at home. In the final test at Eden Park the following week, the teams were tied at 15 points apiece with 78 minutes gone. Romain Poite signaled a penalty to New Zealand for an offside infringement after Ken Owens received the ball in front of his teammate Liam Williams, giving New Zealand the opportunity to kick for goal and potentially win the series. Poite, however, decided to downgrade the penalty to a free-kick after discussing with assistant referee Jérôme Garcès and Lions captain Sam Warburton. The match finished as a draw and the series was tied."]}, {"page": "Bath Rugby", "response": ["| Rob Webber, David Wilson, George Ford, Sam Burgess, Jonathan Joseph, Anthony Watson", "| Sam Underhill, Jonathan Joseph, Joe Cokanasiga, Ruaridh McConnochie, Anthony Watson"]}, {"page": "London Irish", "response": ["London Irish manages its own academy, with players such as Nick Kennedy, Topsy Ojo, Anthony Watson, Delon Armitage and Jonathan Joseph having gone on to play for the senior side and be internationally capped. Ojo retired at the end of the 2018–19 season having made 301 appearances for the club"]}, {"page": "England national rugby union team", "response": ["On 19 October 2021, Luke Cowan-Dickie and Anthony Watson, who had been named in the original squad, both withdrew due to injury. They were replaced by Jamie George and Joe Marchant, respectively."]}, {"page": "Ashford, Surrey", "response": ["* Anthony Watson, England rugby union player"]}, {"page": "Walton-on-Thames", "response": ["*Anthony Watson, England International Rugby Union Player."]}, {"page": "Rugby Aid", "response": ["|LW ||11|| Anthony Watson"]}, {"page": "Sonny Bill Williams", "response": ["Williams returned to the All Blacks against Samoa at Eden Park in a solid performance, where he scored a try in a 78–0 win. A week later, he started at inside centre for the All Blacks in their victory against the British and Irish Lions in the first test. However, a week later in the second test, Williams became the first All Black to be sent off in 50 years after Colin Meads was sent off in 1967, and was also the first ever to be sent off in New Zealand, for shoulder charging Anthony Watson to the head. The All Blacks went on to lose the test 24–21."]}, {"page": "St George's College, Weybridge", "response": ["* Anthony Watson"]}, {"page": "National Schools Sevens", "response": ["*Anthony Watson (St.George’s, Weybridge, 2015)"]}, {"page": "Nigeria national rugby union team", "response": ["*Anthony Watson (rugby union) - England"]}, {"page": "List of England national rugby union team records", "response": ["|align=\"left\"|Anthony Watson"]}, {"page": "List of Adidas sponsorships", "response": ["*  Anthony Watson"]}, {"page": "List of Rugby World Cup try scorers", "response": ["*Anthony Watson"]}]}}