{"wiki_id": "http://www.wikidata.org/entity/Q16258175", "itemLabel": "Len Peach", "itemDescription": "Chief Executive of the National Health Service", "wikipedia_url": "https://en.wikipedia.org/wiki/Len_Peach", "wikipedia_page": {"main": "Sir Leonard Harry Peach (17 December 1932 – 5 August 2016) was Chief Executive of the National Health Service from 1986-89.\nHe was born in Walsall in December 1932 to Henry and Beatrice Peach as the eldest of six children, one of whom died at a young age. After the Second World War he was enlisted for National Service, achieving the rank of Second Lieutenant in the infantry. He then studied history at Pembroke College, Oxford. He was subsequently sponsored by his employer, John Thompsons of Wolverhampton, to study management at the London School of Economics and then joined the West Midlands Gas Board. In 1961 he moved to IBM where he rose to be Head of Personnel and Corporate Affairs for the UK. He was President of the Institute of Personnel Management from 1983-85.The NHS Management Board was established by Norman Fowler as a result of the Griffiths Report on NHS. In 1985 he was seconded to the Department of Health as to serve as Director of Personnel on the Board and was appointed Chief Executive in November 1986. Announced in the 1989 Birthday Honours, Peach was knighted on 22 November 1989. He returned to IBM in 1989 and when he retired in 1992 he became Chairman of the Police Complaints Authority and later Commissioner for Public Appointments.Sir Leonard Peach died on 5 August 2016 at the age of 83.", "link_mentions": [{"page": "Peach (surname)", "response": ["* Len Peach (1932–2016), British businessman and public servant"]}, {"page": "Commissioner for Public Appointments", "response": ["* November 1995–March 1999: Sir Len Peach"]}, {"page": "Chief Executive of NHS England", "response": ["# Len Peach  1986–1989 (3 years)"]}, {"page": "List of people from Walsall", "response": ["* Sir Len Peach (1932 in Walsall – 2016) Chief ExecutiveThe Telegraph, 29 August 2016, Obituary retrieved 17 February 2018 of the National Health Service 1986 – 1989."]}, {"page": "Leonard Harry Peach", "response": ["#REDIRECT Len Peach"]}]}}