{"wiki_id": "http://www.wikidata.org/entity/Q16212483", "itemLabel": "Eric Neumayer", "itemDescription": "German academic", "wikipedia_url": "https://en.wikipedia.org/wiki/Eric_Neumayer", "wikipedia_page": {"main": "Eric Neumayer (born 1970 in Zweibrücken) is a Professor of Environment and Development at the London School of Economics and Political Science (LSE) and is Pro-Director of Faculty Development.  He holds a Diplom in Economics from  Saarland University, a Master of Science and PhD in Development Studies  from LSE, awarded by the University of London. In 2003, he was awarded a Philip Leverhulme Prize in Geography. He is an Associate of the Center for the Study of Civil War at the Peace Research Institute Oslo.", "link_mentions": [{"page": "Travel visa", "response": ["The main reasons states impose visa restrictions on foreign nationals are to curb illegal immigration, security concerns, and reciprocity for visa restrictions imposed on their own nationals. Typically, nations impose visa restrictions on citizens of poorer countries, along with politically unstable and undemocratic ones, as it is considered more likely that people from these countries will seek to illegally immigrate. Visa restrictions may also be imposed when nationals of another country are perceived as likelier to be terrorists or criminals, or by autocratic regimes that perceive foreign influence to be a threat to their rule. According to Professor Eric Neumayer of the London School of Economics:"]}, {"page": "Stern Review", "response": ["Eric Neumayer (2007) of the London School of Economics thought that the Review could have argued for emission reductions based on the non-substitutable loss of natural capital. Neumayer argued that the real issue is the non-substitutable loss of natural capital, that is to what extent climate change inflicts irreversible and non-substitutable damage to and loss of natural capital. Economists define natural capital as the multiple and various services of nature from which humans benefit- from natural resources to pollution absorption and environmental amenities."]}, {"page": "Neumayer", "response": ["*Eric Neumayer, German academic"]}, {"page": "Neumayer, Eric", "response": ["#redirectEric Neumayer"]}]}}