{"wiki_id": "http://www.wikidata.org/entity/Q16227631", "itemLabel": "Tommy Taylor", "itemDescription": "British professional wrestler", "wikipedia_url": "https://en.wikipedia.org/wiki/Tommy_Taylor_(wrestler)", "wikipedia_page": {"main": "Steven Taylor (born 25 January 1986) is an English professional wrestler currently competing on the independent circuit. He is also known for working in WWE's developmental territories Florida Championship Wrestling under the ring name Tommy Taylor.", "link_mentions": [{"page": "Erick Stevens", "response": ["On December 20, 2008, Stevens teamed with former rival Roderick Strong to defeat Kenny King and Jason Blade of The YRR to win the FIP Tag Team Championship, making Stevens the first triple crown champion in FIP. On October 3, 2009, Strong turned on Stevens in a match where they lost the Tag Team Championship to Chris Gray and Tommy Taylor of The British Lions."]}, {"page": "Alicia Fox", "response": ["Crawford debuted for WWE's new developmental territory Florida Championship Wrestling (FCW) on September 2, 2007, participating in a body contest. Her FCW in-ring debut came on September 25, where she and Nattie Neidhart defeated The Bella Twins (Brianna and Nicole) in a tag team match. She quickly began feuding with The Bella Twins, while allying herself with Neidhart. The Bella Twins defeated Crawford and Neidhart on two consecutive occasions, and on October 23, Crawford lost to Nicole in a singles match. A week later, she and Sheamus O'Shaunessy were defeated by Brianna and Kofi Kingston in a mixed tag team match. In December, Crawford teamed with Tommy Taylor in a loss to Brianna and Robert Anthony. The feud continued into 2008, with the Bellas defeating Crawford and Maryse Ouellet on January 8, and Crawford and Neidhart on January 19 and 29. Following the completion of the feud, Crawford began competing regularly against her former tag team partner, Neidhart. Neidhart won their first singles encounter on February 5 and was on the winning side of a tag team match on February 23, before Crawford won a singles match against her on February 26. Following her debut on SmackDown, Crawford changed her ring name to Alicia Fox. She began managing Jack Gabriel in September, and teamed with Gabriel in mixed tag team matches against Mike Kruel and Wesley Holiday and Gabe Tuft and Melina, while continuing to compete in singles competition as well. Fox competed in the Queen of FCW tournament between December 2008 and February 2009, defeating Jenny Quinn and Tiffany en route to the final, where she lost to Angela Fong."]}, {"page": "Tommy Taylor (disambiguation)", "response": ["Tommy Taylor (1932–1958) was an English international footballer who played for Barnsley and Manchester United.", "Tommy Taylor may also refer to:", "*Tommy Taylor (baseball) (1892–1956), Major League Baseball player", "*Tommy Taylor (footballer, born 1903) (1903–1978), English footballer who played for Southampton", "*Tommy Taylor (Irish footballer), Irish international footballer", "*Tommy Taylor (footballer, born 1951), English footballer who played for Leyton Orient and West Ham United", "*Tommy Taylor (New Zealand politician) (1862–1911), New Zealand politician", "*Tommy Taylor (Mississippi politician) (born 1948), American politician in the Mississippi House of Representatives", "*Tommy Taylor (rugby league) (1911–1992), English rugby league footballer", "*Tommy Taylor (rugby union) (born 1991), rugby union player", "*Tommy Taylor (athlete), British Paralympic gold medal winner", "*Tommy Taylor (wrestler) (born 1986), English wrestler", "*Tommy Taylor (drummer) (born 1957), drummer "]}, {"page": "The Bravado Brothers", "response": ["In 2013, the Bravados also began working for Full Impact Pro (FIP). They debuted at Ascension in April, where they defeated Tommy Taylor and Kenneth Cameron, before attacking the FIP Tag Team Champions Dos Ben Dejos. On July 5, at the Declaration of Independence internet pay-per-view, the Bravado Brothers won a three-way match against Dos Ben Dejos and KOA (Sugar Dunkerton and Aaron Epic) to win the FIP Tag Team Championship. On November 16, the Bravado Brothers defeated The Young Bucks to win Dragon Gate USA's Open the United Gate Championship. On December 6, they lost the FIP Tag Team Championship to Rich Swann and Roderick Strong. On September 14, 2014, at Evolve 35, The Bravado Brothers lost the Open the United Gate Championship to Anthony Nese and Caleb Konley in a three-way match, also involving AR Fox and Rich Swann. In 2017, Lance Bravado retired from wrestling thus disbanding the team. Harlem Bravado continued to wrestle on the independent circuit mainly for Evolve Wrestling before he signed with WWE in 2021."]}, {"page": "Thom Latimer", "response": ["After his release from his NXT contract by the WWE and his 90-day non-compete clause expired, Latimer began competing on the independent circuit while reusing the Kenneth Cameron ring name and The Ascension gimmick, as he lost to Tommy Taylor at an NWA Florida Underground Wrestling event on 9 February 2013. He made his debut for World Xtreme Wrestling on the 27 February episode of WXW Rage where he lost to CJ Doyle. Cameron would wrestle at Full Impact Pro Establish Dominance and defeated Johnny Vandal. After the match, Larry Dallas, who was at ringside with Scott Reed, Trina Michaels and Buggy Nova offered Cameron a spot with The Scene, which Cameron turned down. Vandal then attacked Cameron and asked to join The Scene. On the 3 April episode of WXW Rage, after defeating Tony Torres, Kenneth came out to the ring and demanded a shot at the recently vacated WXW Television Championship which he got after laying out Doyle. He would go on to lose to  Doyle. At FIP Ascension, Cameron would team up with Tommy Taylor to take on new Scene members, the Bravado Brothers (Harlem and Lance), which they lost after interference by the Scene. At FUW Throwdown 2, Cameron took on Bruce Santee in a match for the NWA FUW Bruiserweight Championship, which he would lose. At FUW Throwdown 3, Cameron helped Rule Britannia (Andreas Rossi and Tommy Taylor) defeat JD Maverick and James Alexander after interfering in their match and also becoming the third member of Rule Britannia. On 9 June at an FUW event, Cameron was defeated by Michael Tarver in a NWA FUW Heavyweight Championship match. On 1 September FUW TV tapings, Cameron defeated Tommy Taylor, after the match, both men shook hands in a sign of respect for each other. At FUW Throwdown 7, Cameron took on Kahagas for the NWA North American Heavyweight Championship and lost. On 20 December 2014, Cameron defeated Valkabious to win the EPW World Heavyweight Championship."]}, {"page": "Leeds West Academy", "response": ["*Tommy Taylor, Professional Wrestler"]}, {"page": "List of Evolve Wrestling events", "response": ["|Tommy Taylor", "|Lince Dorado and Tommy Taylor", "|Tommy Taylor"]}]}}