{"wiki_id": "http://www.wikidata.org/entity/Q16205131", "itemLabel": "Ti2bs", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Ti2bs", "wikipedia_page": {"main": "Maka Agu, (born 12 January 1982), better known by his stage name Ti2bs or Mr Ti2bs, is an English rapper. He released his first mixtape North Stars Rising in 2002; and his first album, Nobody's Perfect, in 2007 on Kemet Entertainment Records.", "link_mentions": [{"page": "British hip hop", "response": ["In 1998, Mark B and Blade released \"Hitmen for Hire EP\", which featured guest appearances from Lewis Parker and Mr Thing (of the Scratch Perverts). The EP was a success, and led to the successful 2001 album The Unknown, which despite never charting in the UK top 75, was still a top 100 success and an even bigger success within its genre. Also, the album spawned the 2001 top 40 single \"Ya Don't See the Signs\", which was a remix by Feeder frontman Grant Nicholas, after the title track was a top 75 hit and Blade with Mark B supported Feeder. The same year, Bristol's Hombré label released the \"2012 EP\" from Aspects, a benchmark release within the movement. Roots Manuva, Blak Twang, Mud Family, Ti2bs, Task Force, Phi Life Cypher, MSI & Asylum, Jeep Beat Collective and Ty all came to the public's attention, while veteran acts Rodney P, Mike J, and MC Mell'O' returned to the scene. In 1999, MF Doom released his debut studio album Operation: Doomsday which has since been ranked as one of the greatest hip hop albums of all time."]}, {"page": "Skinnyman", "response": ["He formed the Mud Family with Mongo and Chester P, a group which released a number of EPs. These included such records as \"Itchy Town\" and \"Lash Suttin\", a reworking of Redman's \"Smash Something\". Later Supar Novar, Mr. Ti2bs, Uncle Festa and more joined the group. Skinnyman released a solo album, Council Estate of Mind in 2004."]}, {"page": "MC Tali", "response": ["When Full Cycle disbanded in 2006, Tali moved to London for a change of scenery and music. Disillusioned with the drum and bass scene, and suffering from depression and anxiety, she began working alongside hip hop duo First Man, and from here collaborated with MC’s including Skinnyman, Blak Twang, Ti2bs and Sincere. From this came her compilation CD Do It for Yourself."]}, {"page": "Sway discography", "response": ["|align=\"center\"|SuperTi2bs", "|align=\"center\"|Ti2bs"]}, {"page": "RZA production discography", "response": ["* 16. \"Boing, Boing\" – performed by RZA feat. Blade, Skinnyman & Ti2bs"]}, {"page": "The World According to RZA", "response": ["#RZA feat. Blade, Skinnyman & Ti2bs - \"Boing, Boing\" 4:48"]}]}}