{"wiki_id": "http://www.wikidata.org/entity/Q16210390", "itemLabel": "Louisa Henrietta Sheridan", "itemDescription": "British writer, editor", "wikipedia_url": "https://en.wikipedia.org/wiki/Louisa_Henrietta_Sheridan", "wikipedia_page": {"main": "Louisa Henrietta Sheridan (1810 – 2 October 1841) was an English writer and illustrator. Her most well-known work, published by Smith, Elder & Co., is the literary annual, The Comic Offering, for which she served as editor and contributor from 1831 to 1835. She also edited The Diadem, a Book for the Boudoir (London, 1838).Louisa Henrietta Sheridan was born in Amlwch, Isle of Anglesey, Wales, the only daughter of Captain William Brownlow Sheridan and Louisa Mary Addison. She married Lieutenant-Colonel Sir Henry Robartes Wyatt in France on 8 September 1840. She died in Paris one year later from consumption, aged 31.", "link_mentions": [{"page": "Smith, Elder & Co.", "response": ["* The Comic Offering volumes one through five by Louisa Henrietta Sheridan, 1831–1835"]}, {"page": "Charles Robert Forrester", "response": ["Forrester also wrote for The Ladies' MuseumHere his first article was \"The Ladye of the Sun\", The Ladies' Museum, April 1830, pp. 187–92. and Louisa Henrietta Sheridan's annual Comic Offering.Here his first appearance was \"The Old Man's Plaint, by the author of 'Absurdities' \", Comic Offering, 1832, p.  70. Under the editorship of Theodore Hook he was on the staff of the New Monthly Magazine in 1837 and 1838, where he used the name Alfred Crowquill, and inserted his first contribution, \"Achates Digby\", in xlix. 93–8."]}, {"page": "Sheridan (surname)", "response": ["*Louisa Henrietta Sheridan (1810–1841), English writer"]}, {"page": "The Comic Offering", "response": ["The Comic Offering, or Ladies' melange of literary mirth is a literary annual consisting of five volumes from 1831 to 1835 edited by Louisa Henrietta Sheridan and published by Smith, Elder & Co. The first volume was the first British humor publication written, illustrated, and edited by a woman.Hunt, Tamara L., \"Louisa Henrietta Sheridan's \"Comic Offering\" and the Critics: Gender and Humor in the Early Victorian Era\", Victorian Periodicals Review, 1996"]}]}}