{"wiki_id": "http://www.wikidata.org/entity/Q16239037", "itemLabel": "Ishia Bennison", "itemDescription": "British actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Ishia_Bennison", "wikipedia_page": {"main": "Ishia Bennison is a British actress, best known for her television appearances, although she is also a veteran stage actress. Bennison is originally from Hull in Yorkshire.", "link_mentions": [{"page": "1985 in film", "response": ["| King David || Paramount Pictures || Bruce Beresford (director); Andrew Birkin, James Costigan (screenplay); Richard Gere, Edward Woodward, Alice Krige, Denis Quilley, Niall Buggy, Cherie Lunghi, Hurd Hatfield, Jack Klaff, John Castle, Tim Woodward, David de Keyser, Simon Dutton, Jean-Marc Barr, George Eastman, Arthur Whybrow, Christopher Malcolm, Valentine Pelka, Gina Bellman, James Coombes, Jason Carter, Aïché Nana, Ishia Bennison, Marino Masé, Anton Alexander, Tomás Milián, John Barrard, John Gabriel, Lorenzo Piani, David Graham, John Hallam, Ian Sears, Ned Vukovic, James Lister, Genevieve Allenbury, Massimo Sarchielli, Jenny Lipman, Roberto Renna, Michael Müller, Mark Drewry, Nicholas van der Weide, Shimon Avidan, Peter Frye, David George, Nicola Di Gioia || Epic, Historical, Drama || Live action"]}, {"page": "1980 in film", "response": ["| The Awakening || Orion Pictures / EMI Films || Mike Newell (director); Chris Bryant, Allan Scott, Clive Exton (screenplay); Charlton Heston, Susannah York, Jill Townsend, Stephanie Zimbalist, Patrick Drury, Bruce Myers, Nadim Sawalha, Ian McDiarmid, Ahmed Osman, Miriam Margoyles, Michael Mellinger, Leonard Maguire, Ishia Bennison, Madhav Sharma, Chris Fairbanks, Michael Halphie || Horror || Live action"]}, {"page": "At Home with the Braithwaites", "response": ["*Ishia Bennison as Denise Skidmore"]}, {"page": "Dorota Masłowska", "response": ["Her first play, Dwoje biednych Rumunów mówiących po polsku (A Couple of Poor, Polish-Speaking Romanians), has been translated by Lisa Goldman and Paul Sirett and was performed for the first time in the UK at Soho Theatre from 28 February – 29 March 2008 with a cast featuring Andrew Tiernan, Andrea Riseborough, Howard Ward, Valerie Lilley, Ishia Bennison, John Rogan and Jason Cheater. Neither Goldman nor Sirett know Polish and based their adaptation on a technical translation and a line by line translation with Dorota Maslowska in London in 2007. An American translation of the play by Benjamin Paloff was commissioned by TR Warszawa in 2007 and has been performed in New York. Dorota Maslowska October 2015 she was awarded the Bronze Medal for Merit to Culture – Gloria Artis."]}, {"page": "List of former EastEnders characters", "response": ["|Guizin Osman || Ishia Bennison || 1985–1989"]}, {"page": "List of Bergerac episodes", "response": ["| Patrick Mower, Sarah Douglas, Sean Caffrey, Bill Treacher, George Roubicek, Ishia Bennison"]}, {"page": "Sue Osman", "response": ["Sue obsesses with the idea of having another child but no matter how hard she and Ali try, they cannot conceive. A phantom pregnancy in May 1986 leaves her heartbroken and she later tries to convince Michelle to let her adopt Michelle's daughter Vicki, culminating in Michelle slapping Sue. In September, Sue begins toying with the idea of adopting a Turkish child from Cyprus, which is met with indignation from Ali's family. She and Ali decide to apply to adopt in the UK instead. They meet a social worker to assess their suitability; however, their application is rejected because it is felt they are applying too quickly after the death of their child. Sue agonizes over this and in 1987, she faces more turmoil after finding a lump on her breast; she fears she has breast cancer. After much worrying, she is eventually persuaded to get the lump checked out and is subsequently given the all-clear. Later in the year, Sue grows attached to Ali's nephews and niece when they come to stay with her in Walford, and is saddened when they go home several months later. Still unable to conceive, Sue begins to crave a baby more than ever and Ali tires of her eternal broodiness. Sue decides she wants to move to the Isle of Dogs, thinking that the milder climate may increase her chances of conceiving. Ali refuses and in a fury, Sue packs a suitcase and disappears without word. Ali believes she has left him, but Sue is only visiting an old school friend and she returns in October 1987 to announce that she is expecting another baby. In March 1988, she gives birth to another son, \"Little Ali\", who is delivered by Lofty Holloway (Tom Watt) and Pauline Fowler (Wendy Richard). Sue's desperation to be a good mother means that she often excludes her husband from parental duties. She becomes so obsessed with her baby's welfare that she has no time for Ali and their relationship suffers. Feeling neglected and tired of his wife's nagging, Ali has sex with Donna Ludlow (Matilda Ziegler). However, Donna blackmails Ali, threatening to inform Sue about their tryst unless he pays her regularly. A fearful Ali pays, silencing Donna for a while, but in March 1989 Sue argues with Donna, banning her from the café. In retaliation, Donna informs Sue about the affair. Upset, Sue turns to Ali's brother Mehmet (Haluk Bilginer) for comfort and attempts to kiss an innocent Mehmet in front of Ali for revenge. Believing that Sue is having an affair with his brother, Ali assaults Mehmet then informs Mehmet's wife Guizin (Ishia Bennison) about the fabricated affair, causing the Osman family to fracture. Following threats from Ali, Sue takes their son and leaves Walford."]}, {"page": "Kessler (TV series)", "response": ["Van Eyck and Bauer meet a young Israeli woman soldier called Mical Rak (Nitza Saul). Mical's mother's family was sent to Dachau to be killed, on Kessler's orders. Mical breaks into the grounds of Kessler's home to see him, but is discovered and forced to flee. Her companion Ruth Lieberman (Ishia Bennison) is murdered by the Kameradenwerk, and Van Eyck becomes their next victim. Mical is kidnapped from outside Kessler's London hotel and beaten by Franz, before being thrown into the River Thames. However, she survives and is rescued. Mical and Bauer team up to get Kessler. Bauer's agents break into Kessler's home and find a photo album which proves he is Kessler. When it is discovered, Kessler, Ruckert, Franz, and Ingrid travel to Paraguay, and Bauer and Mical set off in pursuit. After a brief detour in Buenos Aires, the pair arrive in Ascunsion.", "* Ruth Lieberman - Ishia Bennison"]}, {"page": "Mehmet Osman", "response": ["Mehmet proceeds to make things infinitely worse for himself soon after, when he stakes his house and business on a bet, loses and swiftly disappears leaving his wife, Guizin Osman (Ishia Bennison), to face up to the consequences. A then homeless Guzin arrives at Ali and his wife Sue's (Sandy Ratcliff) doorstep with the news that Mehmet had beaten her, and she isn't ever returning to him. Ali and Sue are forced to take Guizin and her three children, Murat, Rayif and Emine (Pelin Ahmet) into their one bedroom apartment. Mehmet returns to Walford in May 1987 and he manages to persuade his long suffering wife to give their marriage another chance. However, his promises to Guizin prove to be hollow as soon after he decides that the barmaid Donna Ludlow (Matilda Ziegler) is to be the next sexual conquest. Donna refuses his advances, but can't resist informing Guizin about his offer and Guizin and Donna nearly fight on New Year's Eve that year. Guizin and Mehmet's marriage is highly turbulent and they are always involved in intense arguments, mainly concerning money and gambling. In 1988 Mehmet and Guzin become partners in Ali's café after Sue gives up working to look after her baby. Mehmet often clashes with his wife about the amount of time he takes off to gamble and the way the café is run. Later in the year Mehmet and Ali run up huge gambling debts to Joanne Francis (Pamela Salem), manageress of Strokes wine bar, and who is also a member of the criminal underworld known as The Firm. Desperate for money the two turn to their café employee, Ian Beale (Adam Woodyatt), for a loan. He agrees, but charges his employers 10 percent interest and later, when they cannot meet the repayments, he demands a stake in the café. The brothers refuse, but the debt eventually leads to Ali losing the café to Ian the following year.", "Mehmet Osman makes his first appearance on-screen in June 1985, four months after the show originally aired. His arrival coincides with a cot death storyline of Sue and Ali's baby, Hassan. Mehmet appears as a recurring character from 1985–1987, setting up a cab firm named Ozcabs from inside Ali's café; however, he becomes a regular in 1988, when both he and his wife Guizin (Ishia Bennison) are made partners in Ali's café, which is renamed Café Osman."]}, {"page": "The Exterminators (audio drama)", "response": ["*Frey Saxton – Ishia Bennison"]}, {"page": "The Healers (audio drama)", "response": ["*Frey Saxton – Ishia Bennison"]}, {"page": "The Survivors (audio drama)", "response": ["*Frey Saxton – Ishia Bennison"]}, {"page": "The Demons (audio drama)", "response": ["*Frey Saxton – Ishia Bennison"]}, {"page": "The Warriors (audio drama)", "response": ["*Frey Saxton – Ishia Bennison"]}, {"page": "The Future (audio drama)", "response": ["*Frey Saxton – Ishia Bennison"]}, {"page": "List of Bergerac cast members", "response": ["*Ishia Bennison "]}, {"page": "List of EastEnders characters (1985)", "response": ["Guizin Osman, played by Ishia Bennison, is the long suffering wife of the philandering Turkish Cypriot, Mehmet Osman (Haluk Bilginer). She first arrives in Albert Square in October 1985 when she comes to inform her sister-in-law, Sue (Sandy Ratcliff), that her husband, Ali (Nejdet Salih), had gambled away the mortgage money for the home they were planning to buy."]}, {"page": "List of EastEnders characters (1987)", "response": ["Emine Osman, played by Pelin Ahmet, is the daughter of Mehmet (Haluk Bilginer) and Guizin Osman (Ishia Bennison). She is first seen on screen in February 1987. Her father gambles away their home and then disappears, so Emine, her mother, and her two brothers, Murat (Ediz Izzet) and Rayif (Billy Hassan), are forced to move in with Mehmet's brother Ali (Nejdet Salih) and his wife Sue (Sandy Ratcliff).", "Rayif Osman, played by Billy Hassan, is the elder son of Mehmet (Haluk Bilginer) and Guizin Osman (Ishia Bennison). He is first seen on screen in February 1987. Rayif, his mother, sister Emine (Pelin Ahmet) and brother Murat (Ediz Izzet) are all forced to move in with Mehmet's brother Ali (Nejdet Salih) and his wife Sue (Sandy Ratcliff), after Mehmet gambles away their home and then disappears.", "Murat Osman, played by Ediz Izzet, is the son of Mehmet (Haluk Bilginer) and Guizin Osman (Ishia Bennison). He is first seen on screen in February 1987 after his father gambles away their home and then disappears, so Murat, his mother, sister Emine (Pelin Ahmet) and brother Rayif (Billy Hassan), are forced to move in with Mehmet's brother Ali (Nejdet Salih) and his wife Sue (Sandy Ratcliff). Murat is the youngest of the three children."]}, {"page": "The Awakening (1980 film)", "response": ["* Ishia Bennison as Nurse"]}, {"page": "List of former Emmerdale characters", "response": ["|Jackie Stiles || Ishia Bennison || 2007"]}, {"page": "Little Howard's Big Question", "response": ["Series 1 began airing on 8 January 2009. Performers who appeared in series 1 included: Kirsten O'Brien,Series 1 Episode 4 Can I Get Big Howard Abducted by Aliens? Lucy Porter,Series 1 Episode 5 How Will I Know When I'm in Love? Justin Edwards,Series 1 Episode 6 How Can I Be Lucky? Ishia Bennison,Series 1 Episode 10 What the Gibbing Flump Are You On About Doris? and David Penn.Series 1 Episode 12 Can I Believe My Eyes?"]}, {"page": "Bennison", "response": ["*Ishia Bennison, British actress on television and stage"]}, {"page": "Lisa Goldman", "response": ["Jimmy Akingbola, Ishia Bennison, Lucy Briers, Silas Carson, Anna Carteret, Claire Louise Cordwell, Frances Cuka, Noma Dumezweni, Miranda Foster, Tristan Gravelle, Val Lilley, Jennifer Lim, John Macmillan, Kika Markham, Maxine Peake, Lara Pulver, Matt Rawle, Andrea Riseborough, John Rogan, Sirine Saba, Ruth Sheen, Andrew Tiernan, Luke Treadaway, Ben Whishaw, Jade Williams."]}, {"page": "List of Happy Valley characters", "response": ["*Ishia Bennison as Joyce: a civilian police employee. "]}]}}