{"wiki_id": "http://www.wikidata.org/entity/Q16221179", "itemLabel": "David Arthur Skinner", "itemDescription": "Jazz pianist", "wikipedia_url": "https://en.wikipedia.org/wiki/David_Arthur_Skinner", "wikipedia_page": {"main": "David Arthur Skinner (born 3 January 1980) is a British pianist, bandleader, and composer. Skinner was born on the Isle of Wight.", "link_mentions": [{"page": "David Skinner", "response": ["* David Arthur Skinner (born 1980), British pianist, bandleader, and composer"]}, {"page": "1980 in jazz", "response": ["* 3 – David Arthur Skinner, British pianist and composer."]}, {"page": "Stig Hvalryg", "response": ["Together with Sture Janson, Jens Fossum and Kåre Garnes he played within \"Fire bassister\", who performed the tribute to Erik Amundsen in 2006. At \"Oslo Jazzfestival\" 2006 he joined the quartet of Majken Christiansen in \"Tribute to Ella Fitzgerald\". He also performed with David Arthur Skinner and Bjørn Vidar Solli in the Diagonal Jazzband and David Skinner og Bjørn Vidar Solli Quartet, among others at Lancelot in Asker, Norway and Swing'n'Sweet Jazzklubb in Bergen, Norway."]}, {"page": "Audun Ellingsen", "response": ["During the time in Leeds Ellingsen played in various bands and local rhythm sections comping touring British and American soloists like Mark Nightingale, Joe Temperly, Alan Barnes and Red Holloway. One of his main projects, “Sphinx” with David Arthur Skinner, was founded in this period and we started recording Cds and touring England and Norway. He also was involved in the very active free jazz and improvisation scene in Leeds. After graduation in Leeds he established himself as a professional musician based in Oslo."]}, {"page": "2015 in Norwegian music", "response": ["| David Arthur Skinner", "| Produced by David Arthur Skinner, executive producer Odd Gjelsnes"]}, {"page": "Losen Records", "response": ["| LOS 140-2 || David Arthur Skinner || Cubistic Boogie || 2015-10-31 || CD", "| LOS 171-2 || David Arthur Skinner || Skinner Plays Skinner || 2017-03-31 || CD"]}, {"page": "2015 in jazz", "response": ["| David Arthur Skinner", "| Produced by David Arthur Skinner, executive producer Odd Gjelsnes"]}, {"page": "List of years in jazz", "response": ["* 1980 in jazz, death of Aldo Rossi, Amos White, Babs Gonzales, Barney Bigard, Bill Evans, Bobby Jones, Charles Fowlkes, Chauncey Morehouse, Chino Pozo, Dick Stabile, Dominic Lash, Don Albert, Don Banks, Duke Pearson, Ed Garland, Eric Vogel, Freddie Roach, Harlan Lattimore, Herman Autrey, Irmgard Österwall, Jan Werich, Jane Froman, Jimmy Bryant, Jimmy Crawford, Jimmy Durante, Jimmy Forrest, Joe \"Mr Piano\" Henderson, Lennie Felix, Monk Hazel, Norman Keenan, Oscar Alemán, Paul Howard, Peck Kelley, Pekka Pöyry, Poley McClintock, Ronnie Boykins, Shorty Sherock, Sonny Burke, Stu Martin, and Vinicius de Moraes; births of Alberto Porro Carmona, Andreas Amundsen, Anton Eger, Benedikt Jahnel, Brandi Disterheft, Christina Bjordal, Christoffer Andersen, Colin Vallon, David Arthur Skinner, Dominic Lash, Elana Stone, Federico Casagrande, Gustav Lundgren, Hannah Marshall, Harold Lopez Nussa, Ibrahim Maalouf, Jasser Haj Youssef, Jimmy Rosenberg, Julie Crochetière, Keith Christie, Kendrick Scott, Lars Horntveth, Lena Nymark, Lizz Wright, Manuel Valera, Mark Guiliana, Martin Blanes, Mary Halvorson, Morten Schantz, Øystein Moen, Paddy Milner, Pål Hausken, Ruslan Sirota, Sasha Dobson, Simin Tander, Stian Omenås, Takuya Kuroda, Tim Giles, Tyshawn Sorey, Vincent Peirani, and Yasek Manzano Silva."]}, {"page": "2010s in jazz", "response": ["* David Arthur Skinner: Cubistic Boogie (Losen)"]}, {"page": "2017 in jazz", "response": ["| David Arthur Skinner", "| Produced by David Arthur Skinner"]}, {"page": "Bjørn Vidar Solli", "response": ["Solli has released the albums Poinciana (Losen Records) og Ahmad Jamal Prosjekt in 2014 as a member of the Andreas Dreier Trio, together with the bass player Andreas Dreier and drummer Adam Pache. In 2016 he presented his latest albums at Sildajazz which featured the saxophonist Seamus Blake. He also performed with David Arthur Skinner in the Diagonal Jazzband and David Skinner og Bjørn Vidar Solli Quartet, among others at Lancelot in Asker, Norway and Swing'n'Sweet Jazzklubb in Bergen, Norway."]}, {"page": "Joachim Kwetzinsky", "response": ["Joachim Kwetzinsky studied at the Norwegian Academy of Music, and has been a student of Einar Steen-Nøkleberg, Liv Glaser and Jiri Hlinka. He has given concerts in over 20 countries and has published several albums. He is known for his collaboration with David Arthur Skinner, Johannes Martens and Marcus Paus, and published the album Marcus Paus i 2013.Joachim Kwetzinsky, mic.noJoachim Kwetzinsky: Marcus Paus: Trauermusik/4 Memento Mori/Sonata For Cello And Piano , Radio Ludo"]}, {"page": "1980 in Norwegian music", "response": ["* 3 – David Arthur Skinner, British jazz pianist and composer, living in Norway."]}, {"page": "Majken Christiansen", "response": ["Besides, she has played with varied bands, like Magnolia Jazzband, Sandvika Storband, Bodil Niska, David Arthur Skinner, Christiania 12,  Det Norske Blåseensemble (with a Duke Ellington show) and Ski Storband."]}, {"page": "Skinner Plays Skinner", "response": ["#REDIRECT David Arthur Skinner"]}]}}