{"wiki_id": "http://www.wikidata.org/entity/Q16203574", "itemLabel": "Helen Beebee", "itemDescription": "British philosopher", "wikipedia_url": "https://en.wikipedia.org/wiki/Helen_Beebee", "wikipedia_page": {"main": "Helen Beebee is the Samuel Hall Professor of Philosophy at the University of Manchester.Beebee's work has been influential across a wide variety of fields, including causation, free will, and natural kinds. Eric Schliesser, writing on NewApps, described Beebee as 'one of the most prominent metaphysicists of our time.' Beebee has a significant interest in the problem of underrepresentation of women in the field of philosophy, and has spoken about the problems that face women philosophers in a modern academic context, such as in her paper \"Women and Deviance in Philosophy\".", "link_mentions": [{"page": "List of women philosophers", "response": ["*Helen Beebee (fl. 2014)"]}, {"page": "List of philosophers born in the 20th century", "response": ["* Helen Beebee (born 1968)"]}, {"page": "List of people associated with the University of London", "response": ["* Helen Beebee (KCL)"]}, {"page": "Stephen Mumford", "response": ["Mumford was a project leader for The University of Nottingham in the AHRC (Arts & Humanities Research Council) funded three-year research project: the metaphysics of science.  Mumford worked alongside Alexander Bird (Bristol)Alexander Bird – http://eis.bris.ac.uk/~plajb/Alexander Bird (Research) – http://eis.bris.ac.uk/~plajb/research/research.html and Helen Beebee (Birmingham)Helen Beebee – http://www.philosophy.bham.ac.uk/staff/beebee.shtml within this project with their joint focus on \"causes, laws, kinds, and dispositions\".  The project was described with the following abstract:"]}, {"page": "Praxis (British philosophy journal)", "response": ["* Prof Helen Beebee (University of Manchester)"]}, {"page": "List of alumni of King's College London", "response": ["*Helen Beebee – philosopher"]}, {"page": "Beebee", "response": ["* Helen Beebee, UK professor of philosophy"]}, {"page": "Jennifer Saul", "response": ["Saul has recently co-written a report for the British Philosophical Association and Society for Women in Philosophy UK  with Helen Beebee titled Women in Philosophy in the UK: A Report.http://swipuk.org/notices/2011-09-08/Women%20in%20Philosophy%20in%20the%20UK%20(BPA-SWIPUK%20Report).pdf Saul frequently writes comments on women in philosophy, in a variety of non-academic publications."]}, {"page": "Department of Philosophy, King's College London", "response": ["*Helen Beebee, British academic and philosopher"]}]}}