{"wiki_id": "http://www.wikidata.org/entity/Q16215486", "itemLabel": "Nigel Pilkington", "itemDescription": "British actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Nigel_Pilkington", "wikipedia_page": {"main": "Nigel Pilkington (born 1975) is a British actor, screenwriter and former lawyer.", "link_mentions": [{"page": "Bury, Greater Manchester", "response": ["* Nigel Pilkington, actor, writer, and voiceover"]}, {"page": "Radio Disney Jams series", "response": ["The Radio Disney Jams: 15th Birthday Edition was released on August 16, 2011. It is a compilation of songs that were frequently played on Radio Disney from 1999 through the time of its release in 2011. Before the album was released, Radio Disney hosted a concert featuring Cody Simpson, Nigel Pilkington, Dan Russell and Emma Tate."]}, {"page": "List song", "response": ["* \"Super Supper March\" (Nigel Pilkington)"]}, {"page": "The Bamboozle", "response": [":*Eric & The Sliders, Richy Nix, Great Big Planes, All the Day Holiday, Bobby Long, Let's Get It, Nigel Pilkington, Dan Russell and Emma Tate, Stephen Jerzak, Artist Vs Poet, Secret Secret Dino Club, Moneybrother", ":*School of Rock All-Stars, 100 to One, Nigel Pilkington, Dan Russell and Emma Tate, Mitchy C., Alive in Love", ":*Knucklebone, Our Black Friday, Nigel Pilkington, Dan Russell and Emma Tate, Deas Vail, He Is We, Spacehog, Dramarama, Andrew Dice Clay"]}, {"page": "Noughts & Crosses (novel series)", "response": ["* Double Cross (abridged) - narrated by Nigel Pilkington, Nicole Davis and Joan Walker"]}, {"page": "Keith Wickham", "response": ["| 2009–21 || Thomas & Friends || Edward, Henry, Gordon, Whiff, Dash, Harold  and Mr. Percival (UK)The Fat Controller/Sir Topham Hatt (US; 2015 onwards / UK), Harvey, Glynn, Skarloey, Sir Handel, Arlesdale Bert, Stafford, Salty, Den, Norman, Bertie, Captain, Dowager Hatt and Lord Callan || Succeeded by Nigel Pilkington as the role of Percy (UK) and Rob Rackstraw as the role of James"]}, {"page": "The Jungle Book (2010 TV series)", "response": ["* Tabaqui (voiced by Nigel Pilkington in seasons 1–2) – An Indian jackal. He is Shere Khan's sycophantic, greedy, devious sidekick where he lacks the courage to disagree with his tiger master. Tabaqui is usually the one to set up traps for Mowgli so Shere Khan can eat him.", "* Rikki-Tikki-Tavi (voiced by Nigel Pilkington in seasons 1–2) – An Indian gray mongoose. Here he lives in the jungle with the other animals. Very cute-faced, ferret-sized and fearless (once even fought with Shere Khan in order to defend Mowgli)."]}, {"page": "Orange Drive Miami Beach Music Festival", "response": ["The inaugural Orange Drive Miami Beach Music Festival took place on December 31, 2010 to January 2, 2011. Some of the talent from the 2010-2011 included Leona Lewis, Natasha Bedingfield, DJ Irie, DJ Nino, DJ Vertigo, Adam Carolla, Teenage Fairytale Dropouts voice actors Nigel Pilkington, Dan Russell and Emma Tate, Cuban-American singer Albita, legendary salsa king Gilberto Santa Rosa and salsa duo Hansel y Raul."]}, {"page": "Amber Lily", "response": ["Two original singles were featured on the show: \"2 2 2 L8\" and \"Next To You.\" They were later featured on her second album, Coming to Life. Amber Lily did not win the competition, but has been featured on Radio Disney's channel, the same thing happens with Alex Cook and \"N.B.T.\" winners, Nigel Pilkington, Dan Russell and Emma Tate."]}, {"page": "Peter Rabbit (TV series)", "response": ["*Nigel Pilkington as Squirrel Nutkin", "*Squirrel Nutkin – A short-tailed squirrel and the leader of the squirrels' tribe. He is Peter's squirrel friend who saves Peter whenever he gets captured by Mr. Tod. His tail was cut off by Old Brown. (Voiced by Kyle Dean Massey in the U.S. and Nigel Pilkington in the UK. His right-hand man is Felix, voiced by Spike Spencer.)"]}, {"page": "List of Thomas & Friends voice actors", "response": ["| rowspan = \"2\" | Nigel Pilkington  || UK || Percy (Series 19 onwards; excluding \"Sodor's Legend of the Lost Treasure\"), and Trevor ||"]}, {"page": "Thomas & Friends (franchise)", "response": ["| rowspan = \"2\" | Linda Ballantyne (Workprint: Michael Angelis) || rowspan = \"2\" colspan = \"6\" | Keith Wickham (UK)Martin Sherman (US) || rowspan = \"2\"| || rowspan = \"2\" | Keith Wickham (UK)Christopher Ragland (US) || colspan = \"3\" | Nigel Pilkington (UK)"]}, {"page": "Awesome Magical Tales", "response": ["* Nigel Pilkington as Jimmy Rella, Evil Earl, Chuck Charming"]}, {"page": "Murder of Donna Eastwood", "response": ["Caird appeared at Maidstone Crown Court on 10 April 2015 accused of murdering Eastwood. During his trial, Nigel Pilkington said that there was \"overwhelming evidence\" against Caird. In his trial, Caird admitted that he brutally murdered Eastwood."]}, {"page": "Thomas & Friends: The Great Race", "response": ["The film stars the voices of Joseph May and John Hasler as the voice of Thomas in the US and the UK, respectively. It also stars the voices of Rasmus Hardiker, Kerry Shale, Christopher Ragland, Nigel Pilkington, Rob Rackstraw, Teresa Gallagher and Keith Wickham, with Mark Moraghan narrating.Mattel Creations Trailers New 'Thomas & Friends' Movie at MIPTV|Animation World Network", "| Nigel Pilkington || UK || rowspan = \"2\" | Percy"]}, {"page": "Thomas & Friends: Journey Beyond Sodor", "response": ["Christopher Ragland, Nigel Pilkington, Keith Wickham, Kerry Shale and Teresa Gallagher with Mark Moraghan narrating his last special. Hugh Bonneville, Lucy Montgomery, Darren Boyd, Jim Howick, Sophie Colquhoun, Colin McFarlane and Nicola Stapleton join the cast. This special deals with many traits that children have such as autism, through the Experimental Engines.", "| Nigel Pilkington || rowspan = \"2\" | Percy"]}, {"page": "Thomas & Friends (series 21)", "response": ["| rowspan = \"2\" | Nigel Pilkington || UK/US || A Passenger"]}, {"page": "Thomas & Friends (series 23)", "response": ["* Nigel Pilkington as Percy (UK)"]}, {"page": "Thomas & Friends (series 24)", "response": ["* Nigel Pilkington as Percy (UK) "]}]}}