{"wiki_id": "http://www.wikidata.org/entity/Q162629", "itemLabel": "Simon Cowell", "itemDescription": "English television personality, businessman, producer, and record executive", "wikipedia_url": "https://en.wikipedia.org/wiki/Simon_Cowell", "wikipedia_page": {"main": "Simon Phillip Cowell (; born 7 October 1959) is an English television personality, entrepreneur, and record executive. He has judged on the British television talent competition series Pop Idol (2001–2003), The X Factor UK (2004–2010, 2014–2018) and Britain's Got Talent (2007–present), and the American television talent competition series American Idol (2002–2010), The X Factor US (2011–2013), and America's Got Talent (2016–present). Cowell is the founder and sole owner of the British entertainment company Syco.\nAfter some success in the 1980s and 1990s as a record producer, talent scout and consultant in the UK music industry, Cowell came to public prominence in 2001 as a judge on Pop Idol, a show which he and its creator Simon Fuller successfully pitched to ITV Controller of Entertainment Claudia Rosencrantz. He subsequently created The X Factor and Got Talent franchises which have been sold around the world. In 2004 and 2010, Time named Cowell one of the 100 most influential people in the world. In 2008, The Daily Telegraph ranked him sixth in their list of the \"100 most powerful people in British culture\". The same year, he received the Special Recognition Award at the National Television Awards. At the 2010 British Academy Television Awards, Cowell received the BAFTA Special Award for his \"outstanding contribution to the entertainment industry and for his development of new talent\". In 2018, he received a star on the Hollywood Walk of Fame in the television category.Cowell often makes blunt and controversial comments as a television music and talent show judge, including insults and wisecracks about contestants and their singing abilities. He combines activities in both the television and music industries. Cowell has produced and promoted successful singles and albums for various recording acts whom he has signed and taken under his wing, including Little Mix, James Arthur, Labrinth, Leona Lewis, Fifth Harmony, Il Divo, Olly Murs, Noah Cyrus, Cher Lloyd, Fleur East, and Susan Boyle. He has also signed successful boybands such as Westlife, One Direction, PrettyMuch, CNCO.", "link_mentions": [{"page": "Britney Spears", "response": ["In May 2012, Spears was hired to replace Nicole Scherzinger as a judge for the second season of the U.S. version of The X Factor, joining Simon Cowell, L.A. Reid, and fellow new judge Demi Lovato, who replaced Paula Abdul. With a reported salary of $15 million, she became the highest-paid judge on a singing competition series in television history. However, Katy Perry broke her record in 2018 after Perry was signed for a $25-million salary to serve as a judge on ABC's revival of American Idol. Spears mentored the Teens category; her final act, Carly Rose Sonenclar, was named the runner-up of the season. Spears did not return for the show's third season.", "Before Spears joined The X Factor, Simon Cowell explained that he is \"fascinated by [Britney]. The fact that she's one of the most talked about – not just pop stars – but people in the world today, means that you've got this star power. ... She's still hot, she's still having hit records and she's still controversial, there's a reason for that.\" Marina Diamandis named Spears as the main influence behind her album Electra Heart. Lana Del Rey has said that the music video for \"Toxic\" inspires her. Spears has had a direct influence on singer Porcelain Black's work after growing up around her music as a child. Black describes her music as a \"love child between\" Spears and Marilyn Manson. Rita Ora's 2019 music video for \"Only Want You\" was inspired by Spears's \"Everytime\" music video, and said in a stories from Instagram, \"Hey @britneyspears this was for you because I love you so. Pay homage to the ones who inspire! #icon.\""]}, {"page": "Boy band", "response": ["In the late 1990s in the UK, producer Simon Cowell (noted in the U.S. for the American Idol/X Factor franchise) is also known for having managed British boyband Five (formed in 1997) and Irish boyband Westlife (formed in 1998). Westlife was created by Irishman Louis Walsh as a replacement for Boyzone and was initially managed by a former member of the band Ronan Keating. Westlife would eventually overtake Take That in number one's tally in the UK although Take That's overall UK sales are still higher. In 2012, the Official Charts Company revealed the biggest selling singles artists in British music chart history with Take That placed 15th overall and the highest selling boyband act (9.3 million), followed by Boyzone at 29 (7.1 million) and Westlife at 34 (6.8 million). Even though Cowell is known to have managed several successful boy bands, he is also infamous for passing on signing two of the biggest boybands to emerge from the 1990s and 2000s, Take That and Busted.", "Although most boy bands consist of R&B or pop influences, other music genres, most notably country music and folk music, are also represented. South 65 and Marshall Dyllon, for example, were both country music boy bands. Il Divo, created by Simon Cowell in 2004, are a vocal group that performs operatic pop in several (mainly Italian) languages. Since then operatic/classical boy bands have become quite popular and common, especially in the UK. Since 2001 there has been some crossover with power pop and pop punk from bands that play live instruments. Just recently some boy bands decided to go back to their original doo-wop roots, most notably, The Overtones."]}, {"page": "July 23", "response": ["*2010 – English-Irish boy band One Direction is formed by judge Simon Cowell on The X Factor (British series 7), later going on to finish at third place. It would go on to become one of the biggest boy bands in the world, and would be very influential on pop music of the 2010s."]}, {"page": "Motörhead", "response": ["In November 2009, the band were supported by NWOBHM veterans Sweet Savage on the Irish leg of the tour (30 years after first sharing the stage together) and punk and goth rock legends The Damned on the UK leg of their world tour. On The Damned's official website, Captain Sensible said: \"Ha ha ... we're working with Lemmy again, are we? Excellent! He's the real deal, the absolute antithesis to all that the likes of Simon Cowell stand for. And for that we should all be grateful. This tour will be a celebration of all things rock 'n' roll ... pity the poor roadies is all I can say!\""]}, {"page": "October 7", "response": ["*  1959   – Simon Cowell, English businessman and producer"]}, {"page": "Paula Abdul", "response": ["In 2000, Virgin Records, with whom Abdul was already no longer affiliated, released the first of two compilation albums by Abdul, Paula Abdul: Greatest Hits. Abdul co-produced the 2001 pilot for Skirts, an MTV television series about a high school cheerleading squad; Abdul was also set to appear as the head coach. The pilot never aired.Gone to Pot  (Paula Abdul interview), Gia Kourlas, Time Out New York, September 2001 In 2002, she began appearing as one of three judges on the Fox reality competition series American Idol, where she won praise as a sympathetic and compassionate judge and mentor. She seemed especially kind compared to fellow judge Simon Cowell, who was often blunt in his appraisals of the contestants' performances. When she realized that Cowell's over-the-top judging style was heartbreaking for many young contestants, Abdul was horrified and she considered leaving the series. Although their differences often resulted in heated on-air exchanges and confrontations, Cowell says he played a major role in convincing Abdul not to leave the series.Cowell, S (2003): I don't mean to be rude, but ..., p. 116–117, Random House.  While serving as a judge on American Idol, Abdul accepted a second assignment as reporter for Entertainment Tonight. In December 2005, Abdul launched a cheerleading/fitness/dance DVD series called Cardio Cheer, which is marketed to children and teenage girls involved with cheerleading and dance. Abdul also choreographed The King's touchdown celebration, as seen in a string of Burger King television commercials that aired during the 2005–06 NFL season. In 2006, Abdul appeared on the third series of The X Factor UK as a guest judge during the auditions, sitting alongside judges Cowell, Sharon Osbourne and Louis Walsh.", "In May 2005, ABC's news magazine Primetime Live reported claims by season 2 American Idol contestant Corey Clark that he and Abdul had had an affair during that season, and she had coached him on how to succeed in the competition. That Clark came forward at a time when he was marketing a CD and trying to get a book deal was seen as suspicious by some, but Clark maintains that his career was being prejudiced because of his relationship with Abdul, and that is why he came forward with the information to clear his name. For the most part, Abdul refused to comment on Clark's allegations. Simon Cowell came to Abdul's defense, calling Corey Clark a creep and stating, \"It was just somebody using her to get a lot of publicity for an appalling record, full stop.\" At the height of the debacle, Abdul appeared in a Saturday Night Live skit, making light of the situation. While Fox launched an investigation, Abdul received numerous calls of support from celebrities, including Oprah Winfrey and Kelly Ripa; Barbara Walters addressed the camera during an episode of ABC's The View to say she was sad to be part of an operation that would report Clark's flimsy tabloid claims under the guise of a news story. In August 2005, the Fox network confirmed that Abdul would be returning to the show, as the investigation had found \"insufficient evidence that the communications between Mr. Clark and Ms. Abdul in any way aided his performance.\"[["]}, {"page": "1959", "response": ["** Simon Cowell, English music producer and television talent show judge"]}, {"page": "Robbie Williams", "response": ["On 17 July 2018, Williams along with his wife, and One Direction star Louis Tomlinson, were announced as the new judges on the fifteenth series of The X Factor in the UK, joining Simon Cowell and replacing Louis Walsh, Sharon Osbourne and Nicole Scherzinger."]}, {"page": "Dannii Minogue", "response": ["In January 2012, Minogue appeared in the ITV documentary The Talent Show Story where she talked about her time on The X Factor UK and working on talent shows. Other talent show judges interviewed included Gary Barlow, Louis Walsh, Kelly Rowland, Tulisa, Amanda Holden, Piers Morgan, Carrie Grant and Simon Cowell, as well as The X Factor host Dermot O'Leary and Britain's Got Talent hosts Ant & Dec. In February 2012, Minogue officially opened Madame Tussauds Sydney, unveiling a waxwork of herself at the launch.", "In 2007, Minogue became a judge on the fourth series of The X Factor UK, alongside Simon Cowell, Louis Walsh and Sharon Osbourne.\"Minogue, Friedman join 'The X Factor'\". Digital Spy. 4 June 2007. Retrieved 28 October 2011. She mentored the Boys category and selected Leon Jackson, Rhydian Roberts and Andy Williams to represent her in the live rounds of the competition.Dannii was assisted by song-writer and close friend Terry Ronald. Ultimately, two of her chosen acts, Roberts and Jackson, became the final two, with Jackson eventually becoming the winner after topping the public vote. Minogue was the first female judge to win the show.Leon Jackson takes X Factor crown. BBC News. Retrieved 16 December 2007. On 20 September 2008, Minogue presented the Nickelodeon UK Kids' Choice Awards ceremony.Daniel Kilkelly. \"Dannii Minogue to host Nickelodeon awards\". DigitalSpy.co.uk. Retrieved 28 October 2011. That same year, Minogue returned to the show's fifth series alongside Cowell, Walsh and Cheryl Cole, who replaced Osbourne. Following the initial auditions and boot camp stages of the competition, Minogue was assigned the Over 25s category to mentor.\"'X Factor' judges given categories\". Digital Spy. Retrieved 13 October 2008. She chose Daniel Evans, Rachel Hylton and Ruth Lorenzo as her final three contestants for the live shows and was assisted by Spice Girls member Emma Bunton. In the quarter-final, Minogue lost her final act as Lorenzo was eliminated from the competition finishing in fifth place, leaving her without a contestant in the semi-final.", "On 14 May 2011, it was announced that Minogue would not be returning for the eighth series of The X Factor UK. Of her decision, Minogue said \"During discussions for me to return (to The X Factor) it became clear that unfortunately, this year, the X Factor audition dates in the UK clash with the live shows of Australia's Got Talent during June and July. For this reason I am unable to return.\" She was replaced by Kelly Rowland. In January 2012, Minogue appeared on the ITV documentary The Talent Show Story where she talked about her time on The X Factor and working on talent shows. Other The X Factor judges who were interviewed included Gary Barlow, Walsh, Tulisa, Rowland and Simon Cowell as well as the host Dermot O'Leary. In June 2013, Minogue joined Elle Macpherson and Tyson Beckford on the judging panel for the ninth series of Sky Living's Britain & Ireland's Next Top Model. She replaced Whitney Port and Julien McDonald.", "In 2007, Minogue was hired by Simon Cowell to become a judge on the Seven Network talent show Australia's Got Talent along with Red Symons and Tom Burlinson. It was after this series that Minogue was offered the role on The X Factor UK after Cowell thought she proved good as a judge on Australia's Got Talent. She returned to the panel for seasons two and three in 2008 and 2009. Australia's Got Talent returned for a fourth season in 2010, and Minogue was the only original judge to remain on the panel as producers revamped the series. Brian McFadden and Kyle Sandilands took the places of Red Symons and Tom Burlinson. Minogue also returned for the fifth season in 2011 and the sixth season in 2012. In November 2012, it was announced that Minogue would not be returning for the seventh season in an attempt to reboot the show. She was replaced by Geri Halliwell in the Nine Network's version of the show."]}, {"page": "George Michael", "response": ["Michael made his American acting debut by playing a guardian angel to Jonny Lee Miller's character on Eli Stone, a US TV series. Each episode of the show's first season was named after a song of his. Michael also appeared on the 2008 finale show of American Idol on 21 May, singing \"Praying for Time\". When asked what he thought Simon Cowell would say of his performance, he replied \"I think he'll probably tell me I shouldn't have done a George Michael song. He's told plenty of people that in the past, so I think that'd be quite funny.\"24 Facts: George Michael Channel 24, 14 October 2010George Michael Reflects on His Own American Idolatry Spinner, 22 May 2008 On 25 December 2008, Michael released a new Christmas-themed track, \"December Song\", on his website for free."]}, {"page": "Hollywood Squares", "response": ["After Goldberg's departure, at first the show did not feature a traditional permanent center square. Instead, a new celebrity was in the center square each week. Ellen DeGeneres, Alec Baldwin and Simon Cowell were among those who played center square as was Peter Marshall, who appeared during a special theme week in 2002. Martin Mull was eventually chosen as the permanent center square for the 2003-04 season (though some guests continued to appear as centre square during a few occasional weeks of the season)."]}, {"page": "Jon Bon Jovi", "response": ["Jon Bon Jovi is one of 21 artists singing on \"Everybody Hurts\", a charity single organized by Simon Cowell aiding victims of the 2010 Haiti earthquake."]}, {"page": "Stephen Fry", "response": ["At the 2012 Pride of Britain Awards shown on ITV on 30 October, Fry, along with Michael Caine, Elton John, Richard Branson and Simon Cowell, recited Rudyard Kipling's poem \"If—\" in tribute to the 2012 British Olympic and Paralympic athletes. In November 2012, Fry hosted a gadgets show called Gadget Man, exploring the usefulness of various gadgets in different daily situations to improve the livelihoods of everyone. In October 2013, Fry presented Stephen Fry: Out There, a two-part documentary in which he explores attitudes to homosexuality and the lives of gay people in different parts of the globe."]}, {"page": "Richard Branson", "response": ["At the 2012 Pride of Britain Awards on ITV on 30 October, Branson, along with Michael Caine, Elton John, Simon Cowell and Stephen Fry, recited Rudyard Kipling's poem \"If—\" in tribute to the 2012 British Olympic and Paralympics athletes."]}, {"page": "Dan Rather", "response": ["Since 2013, Rather has hosted and produced the hour-long series The Big Interview with Dan Rather on AXS TV, where he sits down for in-depth interviews with influential figures in music and entertainment, such as: John Fogerty, Quentin Tarantino, Simon Cowell, Aaron Sorkin, and Sammy Hagar. He has also produced several documentary specials for the network under the banner Dan Rather Presents, including specials about \"America's Mental Health Crisis,\" the United States Secret Service, and \"The Shameful Side of International Adoption.\""]}, {"page": "Howard Stern", "response": ["In August 2013, Stern and Simon Cowell shared first place on Forbes list of America's highest-paid television personalities with $95 million earned between June 2012–13. Stern and Cowell tied first place in the following year's poll with the same amount earned from June 2013–14. In 2015, Forbes placed Stern as the world's highest paid media personality and the fifth highest earning celebrity worldwide, at $95 million."]}, {"page": "Brian Epstein", "response": ["Epstein's influence on the Beatles and his complicated personal life continue to provoke controversy. In 2013 author Vivek Tiwary released the graphic novel The Fifth Beatle: The Brian Epstein Story. A film of the same name was scheduled for release in 2014, originally to be produced by Bruce Cohen and directed by Peyton Reed. Tiwary said about that project that the film would \"be less a music bio and more of an inspirational human-interest story about an outsider\". Tiwary and named co-producers Stuart Ford and Simon Cowell originally set the film for release in 2016, but in March 2016 it was announced that the project would be a television series."]}, {"page": "Brandy Norwood", "response": ["In February 2006, Norwood began appearing in a recurring role on UPN sitcom One on One, playing the sister to brother Ray J's character D-Mack. In June, she was cast as one of three talent judges on the first season of America's Got Talent, an amateur talent contest on NBC executive-produced by Simon Cowell and hosted by Regis Philbin. The broadcast was one of the most-watched programs of the summer, and concluded on August 17, 2006 with the win of 11-year-old singer Bianca Ryan. Norwood was originally slated to return for a second season in summer 2007, but eventually decided not to, feeling that she \"couldn't give the new season the attention and commitment it deserved,\" following the fatal 2006 car accident in which she was involved. She was replaced by reality TV star Sharon Osbourne."]}, {"page": "List of American television series based on British television series", "response": ["| Pop Idol || American Idol || Reality competition. UK judge Simon Cowell was also a judge on American Idol.", "| The X Factor || The X Factor || Reality competition. Same executive producer/judge (Simon Cowell) and production company (Syco TV). Cheryl Cole was also a judge on the U.S. version but was dropped following the audition stage. US edition cancelled after three seasons."]}, {"page": "Madame Tussauds", "response": ["| Ariana Grande  ||  || Benny Hill || Simon Cowell", "| Simon Cowell || Leonardo DiCaprio || Whitney Houston || Chuck Liddell"]}, {"page": "Sharon Osbourne", "response": ["Osbourne was a judge and mentor on the UK's The X Factor every year, from 2004 through to 2007. In the first series she mentored the 16–24s and chose Roberta Howett, Cassie Compton and Tabby Callaghan to represent her in the live rounds of the show. The best placed of these was Tabby, who finished third overall. The final was contested between Simon Cowell's act Steve Brookstein and Louis Walsh's act G4, with Steve winning. Osbourne's outburst against Steve on the night of the final is widely credited with helping him to win, although according to her autobiography he was well ahead at all stages of the voting.", "On 6 June 2008, it was announced in a statement on behalf of Osbourne that she has decided to step down as an X Factor judge after four series on the show. The statement read \"Sharon would like to thank the wonderful British public for their enormous support during what's been an exciting ride. She would also like to take this opportunity to thank Simon Cowell and ITV while wishing them all the best for the next series.\" A spokesman from ITV commented \"She has been a tremendous judge and mentor on the programme, but we respect her wish to leave and wish her the very best.\" Osbourne was replaced by Cheryl Cole. During an interview on Piers Morgan's Life Stories, broadcast on 22 February 2009, Osbourne admitted that the reason for her departure from The X Factor was her fractured relationship with Minogue. She stated \"I didn't enjoy working with her at all and didn't fancy the prospect of spending six months sitting next to her.\""]}, {"page": "David Hasselhoff", "response": ["In 2011, he was a guest judge at the Belgian Idols competition. Hasselhoff became a judge on Britain's Got Talent in 2011 alongside Amanda Holden, Michael McIntyre and Simon Cowell. However, Hasselhoff was axed after only one series on the show and was replaced by David Walliams. In 2011, he revived his music career with a short tour across Germany, Austria and Switzerland. In the same year, Hasselhoff was featured in the trailer of the spin-off downloadable game, Burnout Crash!."]}, {"page": "Paulina Rubio", "response": ["In May 2013, Rubio was hired to replace Britney Spears as a judge for the third season of the U.S. version of The X Factor, joining Simon Cowell, Demi Lovato, and fellow new judge Kelly Rowland, who replaced  L.A. Reid. She became the first Mexican artist judge on an American singing competition series. Rubio mentored the Boys category; her final act, Carlito Olivero, was finished 3rd in the competition of the season. Universal Music released to fall 2013 the first compilation album by Rubio, Pau Factor, spanning greatest hits from her 2000 homonym album to album project Bravísima! The album was poorly promoted, but managed to reach number thirty-seven on the Billboard Top Latin Albums, and number thirteen on the Latin Pop Albums."]}, {"page": "2003 in film", "response": ["| Scary Movie 3 || Dimension Films || David Zucker (director); Craig Mazin, Pat Proft (screenplay); Anna Faris, Charlie Sheen, Simon Rex, Leslie Nielsen, Regina Hall, Queen Latifah, Denise Richards, Anthony Anderson, Kevin Hart, Camryn Manheim, George Carlin, Eddie Griffin, Pamela Anderson, Jenny McCarthy, Drew Mikuska, D. L. Hughley, Ja Rule, Darrell Hammond, Jeremy Piven, Simon Cowell, Marny Eng, Naomi Lawson-Baird, Edward Moss, Ajay Naidu, Tom Kenny, Jianna Ballard, Master P, RZA, Raekwon, Method Man, Redman, Macy Gray, U-God, Fat Joe || Comedy, Spoof || || Live Action"]}, {"page": "Hugh Grant", "response": ["Gone from the screen for two years, Grant next re-teamed with Paul Weitz (About a Boy) for the black comedy American Dreamz (2006). Grant starred as the acerbic host of an American Idol-like reality show where, according to Caryn James of the New York Times, \"nothing is real ... except the black hole at the centre of the host's heart, as Mr. Grant takes Mr. Cowell's villainous act to its limit\". American Dreamz failed financially but Grant was generously praised. He played his self-aggrandising character, an amalgam of Simon Cowell and Ryan Seacrest, with smarmy self-loathing. The Boston Globe proposed that this \"just may be the great comic role that has always eluded Hugh Grant\", and critic Carina Chocano said, \"He is twice as enjoyable as the preening bad guy as he was as the bumbling good guy.\""]}, {"page": "1959 in television", "response": ["| Simon Cowell"]}, {"page": "American Idol", "response": ["American Idol employs a panel of vocal judges who critique the contestants' performances. The original judges, for the first through eighth seasons, were record producer and music manager Randy Jackson, singer and choreographer Paula Abdul, and music executive and manager Simon Cowell. The judging panel for the last three seasons on Fox consisted of singers Keith Urban, Jennifer Lopez, and Harry Connick Jr.'American Idol' officially adds J.Lo and Harry Connick Jr. as judges Entertainment Weekly, Retrieved November 23, 2019 The sixteenth season brought three new judges: singers Lionel Richie, Katy Perry, and Luke Bryan. The first season was hosted by radio personality Ryan Seacrest and comedian Brian Dunkleman, but Seacrest has been the sole master of ceremonies since the second season.", "American Idol was based on the British show Pop Idol created by Simon Fuller, which was in turn inspired by the New Zealand television singing competition Popstars. Television producer Nigel Lythgoe saw a version in Australia and helped bring it over to Britain. Fuller was inspired by the idea from Popstars of employing a panel of judges to select singers in audition. He then added other elements, including telephone voting by the viewing public (which at the time was already in use in shows, such as the Eurovision Song Contest), the drama of backstories, and real-life soap opera unfolding in real time. Pop Idol debuted in Britain in 2001 with Lythgoe as showrunnerthe executive producer and production leaderand Simon Cowell as one of the judges, and was successful with the viewing public.", "The show had originally planned on having four judges following the Pop Idol format; however, only three judges had been found by the time of the audition round in the first season, namely Randy Jackson, Paula Abdul and Simon Cowell. A fourth judge, radio DJ Stryker, was originally chosen but he dropped out citing \"image concerns.\" In the second season, New York radio personality Angie Martinez had been hired as a fourth judge but withdrew only after a few days of auditions due to not being comfortable with giving out criticism. The show decided to continue with the three judges format until the eighth season. All three original judges stayed on the judging panel for eight seasons.", "In the eighth season, Latin Grammy Award-nominated singer-songwriter and record producer Kara DioGuardi was added as a fourth judge. She stayed for two seasons and left the show before the tenth season. Paula Abdul left the show before the ninth season after failing to agree to terms with the show producers. Emmy Award-winning talk show host Ellen DeGeneres replaced Paula Abdul for that season, but left after just one season. On May 26, 2010, Simon Cowell left the show to pursue introducing the American version of his show The X Factor for 2011.", "| rowspan=9|Simon Cowell", "The performance of \"Summertime\" by Barrino, later known simply as \"Fantasia\", at Top 8 was widely praised, and Simon Cowell considered it as his favorite Idol moment in the nine seasons he was on the show. Fantasia and Diana DeGarmo were the last two finalists, and Fantasia was crowned as the winner. Fantasia released as her coronation single \"I Believe\", a song co-written by the first season finalist Tamyra Gray, and DeGarmo released \"Dreams\".", "A special tribute to Simon Cowell was presented in the finale for his final season with the show. Many figures from the show's past, including Paula Abdul, made an appearance.", "The tenth season premiered on January 19, 2011. Many changes were introduced this season, from the format to the personnel of the show. Jennifer Lopez and Steven Tyler joined Randy Jackson as judges following the departures of Simon Cowell (who left to launch the American version of The X Factor), Kara DioGuardi (whose contract was not renewed) and Ellen DeGeneres, while Nigel Lythgoe returned as executive producer. Jimmy Iovine, chairman of the Interscope Geffen A&M label group, the new partner of American Idol, acted as the in-house mentor in place of weekly guest mentors, although in later episodes special guest mentors such as Beyoncé, will.i.am and Lady Gaga were brought in.", "Some of the later writers about the show were more positive, Michael Slezak, again of Entertainment Weekly, thought that \"for all its bloated, synthetic, product-shilling, money-making trappings, Idol provides a once-a-year chance for the average American to combat the evils of today's music business.\" Singer Sheryl Crow, who was later to act as a mentor on the show, however took the view that the show \"undermines art in every way and promotes commercialism\". Pop music critic Ann Powers nevertheless suggested that Idol has \"reshaped the American songbook\", \"led us toward a new way of viewing ourselves in relationship to mainstream popular culture\", and connects \"the classic Hollywood dream to the multicentered popular culture of the future.\" Others focused on the personalities in the show; Ramin Setoodeh of Newsweek accused judge Simon Cowell's cruel critiques in the show of helping to establish in the wider world a culture of meanness, that \"Simon Cowell has dragged the rest of us in the mud with him.\" Some such as singer John Mayer disparaged the contestants, suggesting that those who appeared on Idol are not real artists with self-respect."]}, {"page": "Grammy Award for Record of the Year", "response": ["| Simon Cowell, Clive Davis & Ryan Tedder, producers; Craig Durrance, Phil Tan & Ryan Tedder, engineers/mixers"]}, {"page": "Noel Gallagher", "response": ["Gallagher was reportedly asked by Simon Cowell to be a judge on The X Factor after Dannii Minogue, Cheryl Cole, and Cowell himself declined to participate in series 8, but he declined."]}, {"page": "Betty Boop", "response": ["On August 14, 2014,  Simon Cowell's Syco and Animal Logic announced they were developing and producing a feature-length film based on the character."]}]}}