{"wiki_id": "http://www.wikidata.org/entity/Q16215531", "itemLabel": "Shapla Salique", "itemDescription": "British singer", "wikipedia_url": "https://en.wikipedia.org/wiki/Shapla_Salique", "wikipedia_page": {"main": "Farzana Salique (Bengali: ফরজানা সালিক), better known as Shapla Salique, (Bengali: শাপলা সালিক) is a Bangladeshi-born British singer-songwriter and harmonium player.", "link_mentions": [{"page": "List of British Bangladeshis", "response": ["* Shapla Salique – Bengali folk singer-songwriter and harmonium player. She has released two solo albums; Siyono na Siyona in 1997, and Lai Lai in 2002."]}, {"page": "List of people from Sylhet", "response": ["* Shapla Salique, singer and harmonium player"]}, {"page": "British Bangladeshi Power & Inspiration 100", "response": ["On 2 February 2016, notable guests included British politicians Lord Karan Bilimoria, Paul Scully MP, Anne Main MP, Karen Buck MP, Sir Keir Starmer MP, Ronnie Campbell MP, Greater London Authority Member Murad Qureshi and Bangladesh High Commissioner Mohammed Abdul Hannan at the ceremony at London's City Hall. Among the most influential in the list are British Ambassador to Peru Anwar Choudhury Ambassador to Philippines Asif Ahmad, Musician Shapla Salique, Choreographer Akram Khan, Nohshad Shah, MD of Goldman Sachs, Professor Moorad Choudhry, Chief Executive of Habib Bank AG Zurich, Businessmen Iqbal Ahmed OBE, Amin Ali and in Politics three MP's Rushanara Ali, Tulip Siddiq and Rupa Huq."]}, {"page": "Salique", "response": ["*Shapla Salique (born 1974), British singer"]}, {"page": "Shapla", "response": ["*Shapla Salique (born 1974), British singer"]}, {"page": "Jason Alder", "response": ["Alder also performs in jazz and world music bands such as the klezmer-jazz band Payazen!, gypsy punk band Victor Menace, afrobeat bands JORO and Matuki, with Bangladeshi/British singer Shapla Salique, and with the Balkan-jazz band Mimika. He has also studied karnatic music. In 2014 Alder toured with Idina Menzel and Rob Mounsey, and has played in other pop and rock bands such as The Lazlo Device, The Palumbo Phunk, Novack, Canvas Blanco, and RaskalBOMFukkerz. He played bass guitar in the bands Spinfist and June Ruin."]}]}}