{"wiki_id": "http://www.wikidata.org/entity/Q16214762", "itemLabel": "James Seymour Brett", "itemDescription": "British composer and conductor", "wikipedia_url": "https://en.wikipedia.org/wiki/James_Seymour_Brett", "wikipedia_page": {"main": "James Seymour Brett (born 3 April 1974) is an English composer and conductor.", "link_mentions": [{"page": "Michael Kamen", "response": ["In 1998, Kamen composed and conducted the soundtrack for What Dreams May Come. Produced by James Seymour Brett, the score was initially set to be composed by Ennio Morricone. The Italian composer had initially completed and recorded a full score for the film but, after editorial changes were made, his score was rejected and Kamen was hired in his place. Short on time, Kamen took the song \"Beside You\" from his New York Rock Ensemble's album Roll Over and adapted it as the movie's main musical theme.WHAT DREAMS MAY COME - \"They rejected it because it was too emotional?\", Radio Soundtrack f-m"]}, {"page": "What Dreams May Come (film)", "response": ["The musical score for What Dreams May Come was composed and conducted by Michael Kamen and produced by James Seymour Brett. Ennio Morricone had completed and recorded a full score for the film but, after editorial changes were made, his score was rejected and Kamen was hired in his place. Short on time, Kamen took the song \"Beside You\" from his band the New York Rock & Roll Ensemble's 1971 album Roll Over and adapted it as the film's main musical theme.WHAT DREAMS MAY COME - \"They rejected it because it was too emotional?\", Radio Soundtrack f-m With just over three weeks to write, record, and mix the score, Kamen took a more direct approach. \"I was at an extremely profound juncture in my own life at that time, and the film produced a powerful and personal response in me,\" said Kamen. \"I know, despite the mixed response to the film itself, that I accomplished one of my best and most focused scores.\""]}, {"page": "Tiffin School", "response": ["* James Seymour Brett, composer"]}, {"page": "Brett", "response": ["* James Seymour Brett (born 1974) English film composer"]}, {"page": "List of people associated with the Royal Academy of Music", "response": ["* James Seymour Brett Film Composer"]}, {"page": "Batman Live", "response": ["The production was mounted by acclaimed professionals, and was co-directed by James Powell,Batman Live – O2 Arena, 31 August 2011, dealj.wordpress.com who has worked on Les Miserables and Dirty Dancing.JAMES POWELL BROADWAY AND THEATRE CREDITS, www.broadwayworld.com The crew included Anthony Van Laast, widely known for his work on Mamma Mia!, as the creative director, and renowned car designer Prof.Gordon Murray, who crafted the Batmobile especially for the show,Batman takes on the world with £12m stage extravaganza, www.theguardian.comBatman Live Worldwide Arena Tour, www.warnerbros.com as well as composer James Seymour Brett, who created and arranged the music,Batman Live World Arena Tour, jamesseymourbrett.com Es Devlin as the production designer, Luke Halls and Sam Pattinson as the video designers and Patrick Woodroffe as the lighting designer.BATMAN LIVE – WORLD ARENA TOUR 2011, https://esdevlin.com The crew also included Jack Galloway as costume designer, Jake Berry as technical director and Simon Baker as sound designer. The circus sequences were created and managed by Bryan Donaldson and Juliette Hardy-Donaldson.\"Batman Live World Tour \", à Paris Bercy, du 21 au 25 décembre, musicalsineurope.com"]}, {"page": "A Wizard's Tale", "response": ["James Seymour Brett has composed the film's original score."]}, {"page": "Dorothée Munyaneza", "response": ["Munyaneza worked on the sound track for the Hotel Rwanda film. She started out as a singer and storyteller for the film, but then started dancing in a style similar to how she had danced as a child in Rwanda. She worked with , Robyn Orlin, , Nan Goldin, Mark Tompkins, Ko Murobushi and . As a singer, she released her first solo album in 2010, which was produced by Martin Russell. In 2012, she collaborated with British composer James Seymour Brett to produce the album Earth Songs. In 2013, she starred in a performance by Rachid Ouramdane in Rennes, France. During the performance, she chanted the names of Algerians killed during the Paris massacre of 1961."]}, {"page": "James Brett", "response": ["*James Seymour Brett (born 1974), English composer and conductor"]}, {"page": "James S. Brett", "response": ["#redirectJames Seymour Brett"]}]}}