{"wiki_id": "http://www.wikidata.org/entity/Q16225560", "itemLabel": "Gordon Haynes", "itemDescription": "English rugby league footballer (1928-2015)", "wikipedia_url": "https://en.wikipedia.org/wiki/Gordon_Haynes", "wikipedia_page": {"main": "Gordon Haynes (21 December 1928-4 July 2015) is a former professional rugby league footballer who played in the 1950s and 1960s. He played at representative level for Great Britain, and at club level for Swinton and Oldham (Heritage № 619) as a loose forward, i.e. number 13, during the era of contested scrums.", "link_mentions": [{"page": "Swinton Lions", "response": ["* Gordon Haynes won caps for Great Britain while at Swinton 1-(unofficial?)cap"]}, {"page": "Keith Holliday", "response": ["Along with Billy Banks, Ted Cahill, Gordon Haynes, Billy Ivison, Bob Kelly, John McKeown, George Parsons and Ted Slevin, Keith Holliday's only Great Britain appearance came against France prior to 1957, these matches were not considered as Test matches by the Rugby Football League, and consequently caps were not awarded."]}, {"page": "John McKeown (rugby league)", "response": ["Along with William \"Billy\" Banks, Edward \"Ted\" Cahill, Gordon Haynes, Keith Holliday, William \"Billy\" Ivison, Robert \"Bob\" Kelly, George Parsons and Edward \"Ted\" Slevin, John McKeown's only Great Britain appearance came against France prior to 1957, these matches were not considered as Test matches by the Rugby Football League, and consequently caps were not awarded."]}, {"page": "List of Great Britain national rugby league team players", "response": ["* Gordon Haynes (non-Test)"]}, {"page": "Billy Banks (rugby)", "response": ["Along with Edward \"Ted\" Cahill, Gordon Haynes, Keith Holliday, William \"Billy\" Ivison, Robert \"Bob\" Kelly, John McKeown, George Parsons and Edward \"Ted\" Slevin, Billy Banks' only Great Britain appearances came against France prior to 1957, these matches were not considered as Test matches by the Rugby Football League, and consequently caps were not awarded."]}, {"page": "Robert Kelly (rugby league)", "response": ["Along with William \"Billy\" Banks, Edward \"Ted\" Cahill, Gordon Haynes, Keith Holliday, William \"Billy\" Ivison, John McKeown, George Parsons and Edward \"Ted\" Slevin, Bob Kelly's only Great Britain appearance came against France prior to 1957, these matches were not considered as Test matches by the Rugby Football League, and consequently caps were not awarded."]}, {"page": "George Parsons (rugby)", "response": ["Along with William \"Billy\" Banks, Edward \"Ted\" Cahill, Gordon Haynes, Keith Holliday, William \"Billy\" Ivison, Robert \"Bob\" Kelly, John McKeown and Edward \"Ted\" Slevin, Parsons' only Great Britain appearance came against France prior to 1957, these matches were not considered as Test matches by the Rugby Football League, and consequently caps were not awarded."]}, {"page": "Ted Slevin", "response": ["Slevin won caps for England while at Wigan in 1950 against Wales, and while at Huddersfield in 1953 against France. Slevin also represented Great Britain while at Huddersfield in 1953 against France, and in 1954 against France (2 non-Test matches).Edgar, Harry (2007). Rugby League Journal Annual 2008 [Page-110]. Rugby League Journal Publishing.  Along with William \"Billy\" Banks, Edward \"Ted\" Cahill, Gordon Haynes, Keith Holliday, William \"Billy\" Ivison, Robert \"Bob\" Kelly, John McKeown and George Parsons, Slevin's only Great Britain appearances came against France prior to 1957, these matches were not considered as Test matches by the Rugby Football League, and consequently caps were not awarded."]}, {"page": "Ted Cahill (rugby league)", "response": ["Along with William \"Billy\" Banks, Gordon Haynes, Keith Holliday, Billy Ivison, Robert \"Bob\" Kelly, John McKeown, George Parsons and Ted Slevin, Ted Cahill's only Great Britain appearance came against France prior to 1957, these matches were not considered as Test matches by the Rugby Football League, and consequently caps were not awarded."]}, {"page": "Billy Ivison", "response": ["Along with William \"Billy\" Banks, Edward \"Ted\" Cahill, Gordon Haynes, Keith Holliday, Robert \"Bob\" Kelly, John McKeown, George Parsons and Edward \"Ted\" Slevin, Billy Ivison's only Great Britain appearances came against France prior to 1957, these matches were not considered as Test matches by the Rugby Football League, and consequently caps were not awarded."]}]}}