{"wiki_id": "http://www.wikidata.org/entity/Q16203381", "itemLabel": "Amy Marren", "itemDescription": "British swimmer", "wikipedia_url": "https://en.wikipedia.org/wiki/Amy_Marren", "wikipedia_page": {"main": "Amy Marren (born 14 August 1998) is a British Para swimmer who became the SM9 200m individual medley world champion at the 2013 IPC Swimming World Championships.At the same championships, she also won gold in the S9 100m butterfly as well as being a part of the British women’s relay teams who won both the 4x100m freestyle relay and the 4x100m medley relay (which broke the existing world record by six seconds, set by Great Britain in 2011). \nShe also won silver medals in the S9 100m Backstroke and the S9 100m Freestyle in both races, finishing behind fellow British teammate Stephanie Millward. Amy won a bronze medal in the 200m Ind. Medley at the Paralympic Games in Rio in 2016, after only qualifying for the GB Team by 0.2 seconds.", "link_mentions": [{"page": "1998 in the United Kingdom", "response": ["* 14 August – Amy Marren, swimmer"]}, {"page": "London Youth Games", "response": ["Elaine Barrett, Ellen Gandy, Dervis Konuralp, Zara Long, Amy Marren, Craig Moate"]}, {"page": "Great Britain at the 2012 Summer Paralympics", "response": ["|rowspan=\"3\"|Amy Marren"]}, {"page": "Hall Mead School", "response": ["*Amy Marren Paralympian"]}, {"page": "Swimming at the 2012 Summer Paralympics – Women's 100 metre backstroke S9", "response": ["| Amy Marren", "| Amy Marren"]}, {"page": "Swimming at the 2012 Summer Paralympics – Women's 50 metre freestyle S9", "response": ["| 10|| 1|| 2||align=left| Amy Marren||align=left| || 31.02||"]}, {"page": "Susie Rodgers", "response": ["In 2013 Rodgers was selected to represent Great Britain again, this time at the IPC Swimming World Championships in Montreal. In her three individual freestyle events; the 50 m S7, 100 m S7 and the 400 m S7 she was beaten into silver on each occasion by American Cortney Jordan. In her only butterfly event, the 50 m S7, she again took second place, this time losing the top podium place to Canada's Brianna Nelson. Rodgers left Canada with one more medal, taking the gold in the 4x100 m freestyle relay (34 points) alongside Stephanie Millward, Claire Cashmore and Amy Marren. The second and third places in the 100m relay went to Canada and the USA, those teams contained both Nelson and Jordan."]}, {"page": "Sunday Times and Sky Sports Sportswomen of the Year Awards", "response": ["Disability Sportswoman of the Year: Amy Marren"]}, {"page": "Swimming at the 2012 Summer Paralympics – Women's 400 metre freestyle S9", "response": ["|2 || 6 || style=\"text-align:left;\" |Amy Marren || style=\"text-align:left;\" | || 4:53.04 ||  Q", "|4 || 6 || style=\"text-align:left;\" |Amy Marren || style=\"text-align:left;\" | || 4:50.79 || "]}, {"page": "2013 IPC Swimming World Championships – Women's 200 metre medley", "response": ["|Amy Marren"]}, {"page": "2013 IPC Swimming World Championships – Women's 100 metre freestyle", "response": ["|Amy Marren"]}, {"page": "2013 IPC Swimming World Championships – Women's 100 metre backstroke", "response": ["|Amy Marren"]}, {"page": "2013 IPC Swimming World Championships – Women's 100 metre butterfly", "response": ["|Amy Marren"]}, {"page": "2013 IPC Swimming World Championships – Women's 4 × 100 metre medley relay", "response": ["|Stephanie Millward S9Claire Cashmore SB8Stephanie Slater S8Amy Marren S9"]}, {"page": "2013 IPC Swimming World Championships – Women's 4 × 100 metre freestyle relay", "response": ["|Stephanie Millward S9Susannah Rodgers S7Claire Cashmore S9Amy Marren S9"]}, {"page": "2014 IPC Swimming European Championships – Women's 400 metre freestyle", "response": ["| Amy Marren|| 4:47.66"]}, {"page": "2014 IPC Swimming European Championships – Women's 100 metre freestyle", "response": ["| Amy Marren|| 1.04.22"]}, {"page": "2014 IPC Swimming European Championships – Women's 50 metre freestyle", "response": ["| Amy MarrenNatalia Mamlina || 30.00"]}, {"page": "2014 IPC Swimming European Championships – Women's 100 metre backstroke", "response": ["| Amy Marren ||  1:13.21  "]}, {"page": "2014 IPC Swimming European Championships – Women's 100 metre butterfly", "response": ["| Amy Marren|| 1:11.09"]}, {"page": "2014 IPC Swimming European Championships – Women's 200 metre individual medley", "response": ["| Amy Marren || 2:35.10 "]}, {"page": "2014 IPC Swimming European Championships – Women's 4 × 100 metre medley relay", "response": ["| Stephanie Millward (S9)Claire Cashmore (SB8)Stephanie Slater (S8)Amy Marren (S9) || 4:46.89"]}, {"page": "Great Britain at the 2016 Summer Paralympics", "response": ["| style=\"text-align:left;\" rowspan=\"5\"|Amy Marren", "|align=left|Amy MarrenStephanie MillwardSusie RodgersAlice Tai"]}, {"page": "Alice Tai", "response": ["Tai began swimming at the age of eight joining the Seagulls Swimming Club in New Milton. It was not until the winter of 2010 that her family realised that she could be classified as a disability swimmer. In 2011, she was officially classified as a S10 swimmer allowing her to compete in international competitions. In 2012 Tai showed her potential at the 2012 British International Disability Swimming Championships in Sheffield, where she won silver in the Youth final of the NC (Nutella-Classification) 400m freestyle, beaten to gold place by Amy Marren.", "Tai made progress into senior competitions in 2013. She made the finals of three senior events at the British International Disability Swimming Championships. She followed this with a third place in the MC 50m Freestyle and a second place in the MC 100m Freestyle at the ASA National Championships in Sheffield. In January 2014, Tai was one of four British swimmers selected to compete at the Brazil School Games in São Paulo. She won gold in the 50m freestyle and backstroke S10 category and silver in the SB9 50m breaststroke, again beaten by her teammate Amy Marren. She followed youth success by breaking into the British team after a strong show at the Para-Swimming International Meet in Glasgow."]}, {"page": "Swimming at the 2016 Summer Paralympics – Women's 100 metre backstroke", "response": ["|style=\"text-align:left\"| Amy Marren ||style=\"text-align:left\"| "]}, {"page": "Swimming at the 2016 Summer Paralympics – Women's 400 metre freestyle", "response": ["|style=\"text-align:left\"| Amy Marren ||style=\"text-align:left\"| "]}, {"page": "Swimming at the 2016 Summer Paralympics – Women's 200 metre individual medley", "response": ["|style=\"text-align:left\"| Amy Marren ||style=\"text-align:left\"| "]}, {"page": "Marren", "response": ["* Amy Marren (born 1998), British Paralympic swimmer"]}, {"page": "The Witches (2020 film)", "response": ["Numerous disability advocates, including British Paralympic swimmer Amy Marren, accused the film of perpetuating bias against individuals with ectrodactyly and other limb differences. Lauren Appelbaum, a spokesperson for advocacy group RespectAbility, said the film portrays limb differences as \"hideous or something to be afraid of.\" On November 4, 2020, Warner Bros. issued a statement in which they apologized for offending people with disabilities. They further added that they had worked with \"designers and artists to come up with a new interpretation of the cat-like claws that are described in the book. [...] The film is about kindness. [...] It was never the intention for viewers to feel that the fantastical, non-human creatures were meant to represent them.\" Hathaway also issued an apology over the film's portrayal, saying \"I particularly want to say I'm sorry to kids with limb differences... Now that I know better I promise I'll do better.\""]}]}}