{"wiki_id": "http://www.wikidata.org/entity/Q16239126", "itemLabel": "William Thomas Lewis", "itemDescription": "British actor; (1746-1811)", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Thomas_Lewis", "wikipedia_page": {"main": "William Thomas Lewis (1748?–1811), known as \"Gentleman\" Lewis, due to his refined acting style, was an English actor. He was said to be \"the most complete fop on the stage\". In later life he went into theatrical management.", "link_mentions": [{"page": "John Bell (publisher)", "response": ["*Volume 8. The Maid of the Mill by Isaac Bickerstaffe illustrated with Mr William Blanchard as Ralph. Rule a Wife and Have a Wife by Francis Beaumont and John Fletcher illustrated with Mr William Thomas Lewis as the Copper Captain. The Careless Husband by Colley Cibber illustrated with Mr William Farren as Charles Easy. The Revenge by Edward Young LLD illustrated with Mrs Brooks as Leonora.Bell, John, 1745–1831, British theatre (1791), Volume 8, Publisher: J. Bell Year, 1791. Illustrations: Mr Blanchard, Mr Lewis, Mr Farren, Mrs Brooks"]}, {"page": "William Lewis", "response": ["* William Thomas Lewis (1748–1811), English actor"]}, {"page": "Alfred (play)", "response": ["The original Covent Garden cast included William Thomas Lewis as Alfred, Thomas Hull as Edwin, John Whitfield as Earl of Surrey, Francis Aickin as Hinguar, Ann Street Barry as Ethelswida. The epilogue was written by David Garrick.Hogan p.142"]}, {"page": "The Eccentric Lover", "response": ["The Eccentric Lover is a comedy play by the British writer Richard Cumberland. It was first performed at Covent Garden Theatre on 30 April 1798.Watson p.1968 The original cast included William Thomas Lewis as Sir Francis Delroy, John Quick as Peter Crowfoot, Joseph George Holman as Fenton, Joseph Shepherd Munden as Admiral Delroy, John Fawcett as Doctor Crisis, Charles Murray as Gangrene, John Whitfield as Sir Henry Netterville, Julia Betterton as Eleanor de Ferrars, Jane Pope as Constantia and Isabella Mattocks as Fidelia.Hogan p.2064"]}, {"page": "The Mysterious Husband", "response": ["The original Covent Garden cast included William Thomas Lewis as Charles Davenant, Richard Wroughton as Captain Dorner, Richard Yates as Sir Edmund Travers, Elizabeth Satchell as Marriane and Elizabeth Younge as Lady Davenant.Hogan p.588"]}, {"page": "John Jones (engraver)", "response": ["* William Thomas Lewis as the Marquis in the Midnight Hour (adapted by Elizabeth Inchbald from the French original), after Martin Archer Shee;"]}, {"page": "Henrietta Amelia Leeson", "response": ["Henrietta Amelia Leeson (1751 – 6 December 1826) was an English actress of the 18th-century.Accounts of Henrietta Amelia (Leeson) Lewis - Folger Shakespeare Library Known as Mrs Lewis after her marriage to the actor William Thomas Lewis In 1780, she appeared regularly with him at the Theatre Royal, Drury Lane. She made over 100 appearances on the London stage between 1775 and 1791.", "Born in London, Leeson developed an early interest in the theatre through the encouragement and support of her friends exacerbated by the frequent absence of her father from the family home owing to the long hours he worked in his printer's business. The Irish actor Charles Macklin took her on  as an apprentice and in 1771 she accompanied him to Ireland where she made her début at the Crow Street Theatre in Dublin.An Historical View of the Irish Stage; From the Earliest Period Down to the Close of the Season 1788. Interspersed with Theatrical Anecdotes, and an Occasional Review of the Irish Dramatic Authors and Actors. In Two Volumes. Vol. II. By Robert Hitchcock, of the Theatre-Royal, Dublin. Printed by William Folds, No. 38, Gt. Strand-Street, Dublin 1794 pg. 218 Leeson played a number of roles on her tour of Ireland with Macklin's company including Portia in The Merchant of Venice and Desdemona in Othello. On their return to Dublin Leeson continued to act in Macklin's company but he had become \"deeply but fruitlessly infatuated with her\" and he released her from her apprenticeship, following which she joined the Dawson Company at the Capel Street Theatre. She began to live with the actor William Thomas Lewis and went with him to England in 1775 where they married in about 1780. She appeared with Lewis at the Theatre Royal, Drury Lane, at first as Mrs Leeson and later as Mrs Lewis. She joined her husband on his tours of the provinces.Roland Metcalf,William Thomas Lewis - Oxford Dictionary of National Biography (2012)"]}, {"page": "Capel Street Theatre", "response": ["The second theatre was known as the City Theatre and was in the same building as the earlier theatre and opened on 26 February 1770 with the investors being Mr. Dawson, Mr. Mahon, and Mr. Wilkes. The theatre opened with a production featuring William Thomas Lewis.", "Among the actors to appear here were: Charles Macklin, Elizabeth Younge,Robert Farquharson Sharp (1909) A Short History of the English Stage: From Its Beginnings to the Summer of the Year 1908 p.312, Walter Scott Publishing Company, London and New York William Thomas Lewis,On 26 February 1770 he was Sir Harry Newburgh in Hugh Kelly's False Delicacy. Hastings in The Tragedy of Jane Shore by Nicholas Rowe followed. and Henrietta Amelia Leeson. The dramatist Robert Houlton wrote works for the theatre for a season, sharing the honours with Walley Chamberlain Oulton."]}, {"page": "Five Thousand a Year", "response": ["The original Covent Garden cast included William Thomas Lewis as George Fervid, Alexander Pope as Frederick Fervid, Joseph Shepherd Munden as Sir Matthew Maxim, Charles Farley as Paragraph, Charles Murray as Mr Goulding, Julia Betterton as Maria, Jane Pope as Lady Julia and Isabella Mattocks as Lady Maxim.Hogan p.2154"]}, {"page": "The School for Widows", "response": ["The original Covent Garden cast included William Thomas Lewis as Jack Marmoset, Thomas Ryder as Mr Wordly, John Quick as Sir Wilful Wayward, Alexander Pope as Frederick, Isabella Mattocks as Mrs Wordly, Sarah Wewitzer as Mrs Gayless and Frances Abington as Lady Charlotte Richmore.Hogan p.1153"]}, {"page": "The Town Before You", "response": ["The original cast included William Thomas Lewis as Tippy, John Quick as Sir Robert Floyer, Joseph George Holman as Conway, Alexander Pope as Asgill, Joseph Shepherd Munden as Humphrey, John Fawcett as Fancourt, John Bernard as Acid and Isabella Mattocks as Mrs Fancourt and Jane Pope as Lady Horatia Horton."]}, {"page": "More Ways Than One", "response": ["The original Covent Garden cast included William Thomas Lewis as Bellair, John Quick as Doctor Freelove, John Edwin as Sir Marvel Mushroom, Ralph Wewitzer as Le Gout, Richard Wilson as Evergreen, James Fearon as David, Richard Wroughton as Carlton, Priscilla Kemble as Arabella and Sarah Maria Wilson as Miss Juvenile and Elizabeth Younge as Miss Archer."]}, {"page": "Which is the Man?", "response": ["The original Covent Garden cast included John Henderson as Fitzherbert, William Thomas Lewis as Beauchamp, Richard Wroughton as Belville, John Quick as Pendragon, Charles Lee Lewes as Lord Sparkle, Isabella Mattocks as Sophy Pendragon, Sarah Maria Wilson as Kitty, Elizabeth Satchell as Julia and Elizabeth Younge as Bloomer.Hogan p.496"]}, {"page": "Cleonice, Princess of Bithynia", "response": ["The original Covent Garden cast included Spranger Barry as Artabuses, Robert Bensley as Lycomedes, William Thomas Lewis as Pharnaces, John Lee as Orontes, Thomas Hull as Teramenes, John Whitfield as Agenor and Elizabeth Hartley as Cleonice.Hogan p.1873"]}, {"page": "Duplicity (play)", "response": ["The original Covent Garden cast included John Henderson as Mr Osborne, William Thomas Lewis as Sir Harry Portland, Richard Wilson as Sir Hornet Armstrong, Charles Lee Lewes as Squire Turnbull, John Edwin as Timid, Ralph Wewitzer as Mr Vandervelt, William Stevens as Scrip, Sarah Maria Wilson as Miss Turnbull, Elizabeth Inchbald as Melissa, Ann Pitt as Mrs Trip and Elizabeth Younge as Clara.Hogan p.466"]}, {"page": "The Votary of Wealth", "response": ["The original Covent Garden cast included William Thomas Lewis as Drooply, Alexander Pope as Leonard Vizorly, Joseph Shepherd Munden as Oakworth, John Fawcett as Sharpset, Charles Murray as Clevland, John Emery as Old Vizorly, Julia Betterton as Caroline and Jane Pope as Julia Cleveland.Hogan p.2138"]}, {"page": "The Deserted Daughter", "response": ["The original Covent Garden cast included William Thomas Lewis as Cheveril, John Quick as Item, Alexander Pope as Mr Mordent, Joseph Shepherd Munden as Donald, George Davies Harley as Lennox, John Bernard as Grime, Isabella Mattocks as Mrs Sarsnet and Jane Pope as Lady Anne.Hogan p.1751"]}, {"page": "The School for Arrogance", "response": ["The original Covent Garden cast included William Thomas Lewis as Count Conolly Villars, John Henry Johnstone as MacDermot, Francis Aickin as Mr Dorimont, William Farren as Edmund, Richard Wilson as Sir Paul Peckham, Joseph Shepherd Munden as Sir Samuel Sheepy, James Thompson as Exempt, Charles Farley as Footmen, Mary Wells as Lucy and Isabella Mattocks as Lady Peckham.Hogan p.1320"]}, {"page": "He's Much to Blame", "response": ["The original Covent Garden cast included William Thomas Lewis as Sir George Versatile, John Quick as Lord Vibrate, Alexander Pope as Mr Deleval, Charles Murray as Doctor Gosterman, James Thompson as Master of the Hotel, Jane Pope as Maria, Julia Betterton as Lady Jane and Isabella Mattocks as Lady Vibrate.Hogan p.2044"]}, {"page": "The Way to Get Married", "response": ["The original cast included William Thomas Lewis as Tangent, John Quick as Toby Allspice, John Henry Johnstone as McQuery, Alexander Pope as Captain Faulkener, Joseph Shepherd Munden as Caustic, John Fawcett as Dick Dashall, Charles Farley as Servant, Charles Holland as Solicitor, Isabella Mattocks as Clementina Allspice, and Mary Ann Davenport as Lady Sorel.Hogan p.1825-26"]}, {"page": "Secrets Worth Knowing", "response": ["The original Covent Garden cast included William Thomas Lewis as Rostrum, John Quick as Nicholas, Joseph George Holman as Egerton, Alexander Pope as Greville, Joseph Shepherd Munden as Undermine, John Fawcett as April, Thomas Knight as Plethora, Charles Farley as Valet, James Thompson as Cook and Isabella Mattocks as Sally.Hogan p.2036"]}, {"page": "A Cure for the Heart Ache", "response": ["It premiered at the Covent Garden Theatre in London. The original cast included William Thomas Lewis as Young Rapid, John Quick as Vortex, Alexander Pope as Charles Stanley, Joseph Shepherd Munden as Old Rapid, John Fawcett as Frank Oatland, Charles Murray as Sir Hubert Stanley, Thomas Hull as Heartley, Charles Farley as Bronze, James Thompson as Landlord, Isabella Mattocks as Miss Vortex, Jane Pope as Ellen.Hogan p.1929"]}, {"page": "Love's Frailties", "response": ["The original Covent Garden cast included William Thomas Lewis as Mr Muscadel, John Quick as Sir Gregory Oldwort, Joseph George Holman as Charles Seymour, Joseph Shepherd Munden as Mr Craig Campbell, Charles Farley as James, Jane Pope as Lady Fancourt and Isabella Mattocks as Nanette.Hogan p.1617"]}, {"page": "The Road to Ruin (play)", "response": ["It premiered at Covent Garden in London with a cast that featured William Thomas Lewis as Goldfinch, John Quick as Mr Silky, Joseph George Holman as Harry Dornton, Richard Wilson as Mr Sulky, Joseph Shepherd Munden as Mr Dornton, George Davies Harley as Mr Milford, James Thompson as Sheriff's Officer, William Macready as Hosier, Ann Brunton Merry as Sophia, Sarah Harlowe as Jenny and Isabella Mattocks as Mrs Warren.Hogan p.1428"]}, {"page": "A Bold Stroke for a Husband", "response": ["The original Covent Garden cast included William Thomas Lewis as Don Julio, Richard Wroughton as Don Carlos, John Quick as Don Caesar, John Edwin as Don Vincentio, Richard Wilson as Gasper, John Whitfield as Don Garcia, James Fearon as Vasquez, Mary Robinson as Victoria, Sarah Maria Wilson as Minette, Mary Whitfield as Laura, Harriet Pitt as Sancha and Isabella Mattocks as Olivia. The epilogue was written by John O'Keeffe.Hogan p.594"]}, {"page": "The World as it Goes", "response": ["The original cast included William Thomas Lewis as Sir Charles Danvers, Charles Lee Lewes as Fairfax, John Quick as Grub, Richard Wilson as Colonel Sparwell, John Edwin as Bronze, Ralph Wewitzer as Von Irkin, Isabella Mattocks as Mrs Sparwell, Lydia Webb as Molly Grub, Elizabeth Inchbald as Sidney Grubb and Elizabeth Younge as Lady Danvers.Hogan p.411"]}, {"page": "The Count of Narbonne", "response": ["It premiered at the Covent Garden Theatre. The original cast featured John Henderson as Austin, Richard Wroughton as Raymond, William Thomas Lewis as Theodore, James Thompson as Fabian, James Fearon as Officer, Elizabeth Satchell as Adelaide and Elizabeth Younge as Hortensia.Hogan p.476"]}, {"page": "Percy (play)", "response": ["The play premiered at the Covent Garden Theatre in London. The original cast included William Thomas Lewis as Percy, Francis Aickin as Earl Raby, Thomas Hull as Sir Hubert, John Whitfield as Edric, James Thompson as Servant, Richard Wroughton as Earl Douglas and Ann Street Barry as Elwina. David Garrick wrote both the prologue and epilogue.Hogan p.133"]}, {"page": "Fortune's Fool (1796 play)", "response": ["The original cast included William Thomas Lewis as Ap-Hazard, John Quick as Sir Bamber Blackletter, John Fawcett as Tom Seymour, William Macready  as  Orville and Isabella Mattocks as Miss Union.Hogan p.1909-10"]}]}}