{"wiki_id": "http://www.wikidata.org/entity/Q16239770", "itemLabel": "Mark Russell", "itemDescription": "Scottish association football player (born 1996)", "wikipedia_url": "https://en.wikipedia.org/wiki/Mark_Russell_(footballer,_born_1996)", "wikipedia_page": {"main": "Mark Russell (born 22 March 1996) is a Scottish professional footballer who plays as a left midfielder for Greenock Morton.\nHe began his career with Greenock Morton and made over 100 appearances for them, spending a short spell with Falkirk before spending two years playing in Ireland for Finn Harps.\n\n", "link_mentions": [{"page": "Greenock Morton F.C.", "response": ["*  Mark Russell"]}, {"page": "Declan McManus", "response": ["McManus moved on loan to Scottish League One club Greenock Morton on 8 August 2014. He scored his first ever senior hat-trick in a 5–2 cup victory over Berwick Rangers in August 2014, and left the club at the end of his loan spell having scored 12 goals in 21 starts. On 2 February 2015, McManus joined Greenock Morton for a second loan spell, signing until the end of the 2014–15 season. McManus was nominated for the SPFA League One player of the year for 2014–15, as well as being included in the League One Team of the Year with teammate Mark Russell. He won the Player of the Year award."]}, {"page": "PFA Scotland Team of the Year", "response": ["| DF || Mark Russell || Greenock Morton ||align=\"center\"|1"]}, {"page": "2013–14 Greenock Morton F.C. season", "response": ["|DF / MF||style=\"text-align:left\"| Mark Russell || 5 || 8 || 10 || 0 || 0 || 0"]}, {"page": "Mark Russell (disambiguation)", "response": ["Mark Russell (born 1932) is an American political satirist and comedian.", "Mark Russell may also refer to:", "* Mark Russell (Australian footballer) (born 1962), Australian footballer for Sydney", "* Mark Russell (comics) (born 1971), American comics writer", "* Mark Russell (composer) (born 1960), British composer", "* Mark Russell (cricketer) (born 1970), English cricketer", "* Mark Russell (charity director) (born 1974), Northern Irish evangelist and charity executive", "* Mark Russell (footballer, born 1996), Scottish footballer", "* Mark Russell (hurler), Irish hurler"]}, {"page": "2014–15 Greenock Morton F.C. season", "response": ["Morton re-signed Mark Russell on a two-year deal, whilst Stefan Milojević and Conor Pepper verbally agreed terms.", "Morton defeated Viewfield Rovers 13-1 to confirm their place in the Renfrewshire Cup final. Barrowman scored a hat-trick, with Mark Russell and Joe McKee getting braces.", "Mark Russell was told by the chairman that he would be offered a new improved contract.", "Declan McManus and Mark Russell were announced as being included in the PFA Scotland League One Team of the Year.", "Morton finished the season as champions, defeating Peterhead by three goals to one; goals being scored by Mark Russell, Declan McManus and Michael Miller", "|DF / MF||style=\"text-align:left\"| Mark Russell || 30 || 5 || 8 || 3 || 0 || 5", "*Joe McKee, Sean Crighton, Dylan Stevenson, Scott Tiffoney, Mark Russell, Scott Miller, Michael Tidser, John Mitchell & Alex McWaters - 1", "|Mark Russell"]}, {"page": "2015–16 Greenock Morton F.C. season", "response": ["Mark Russell rejected an offer of a new contract, but stated that he would be willing to re-negotiate. However, Derek Gaston signed up for another two seasons until 2018.", "Mark Russell signed a contract extension until the summer of 2017.", "|DF||style=\"text-align:left\"| Mark Russell || 35 || 1 || 1 || 0 || 0 || 3"]}, {"page": "Dylan Stevenson", "response": ["Before making his debut for Morton, Stevenson joined Dalry Thistle on loan. After a couple of substitute appearances in the cups, Stevenson made his league debut against Hibernian on 15 August 2015 as a late replacement for Mark Russell. With the development league in its winter shutdown, Stevenson went on a development loan to Berwick Rangers in December 2015. He signed a six-month deal at Morton in May 2016."]}, {"page": "2016–17 Greenock Morton F.C. season", "response": ["|DF / MF||style=\"text-align:left\"| Mark Russell || 36 || 4 || 5 || 1 || 1 || 4"]}, {"page": "2017–18 Greenock Morton F.C. season", "response": ["|DF||style=\"text-align:left\"| Mark Russell || 32 || 4 || 1 || 0 || 0 || 1"]}, {"page": "List of foreign League of Ireland players", "response": ["* Mark Russell – Finn Harps"]}]}}