{"wiki_id": "http://www.wikidata.org/entity/Q16203648", "itemLabel": "Moko", "itemDescription": "British singer", "wikipedia_url": "https://en.wikipedia.org/wiki/Nadiah_Adu-Gyamfi", "wikipedia_page": {"main": "Diane Nadia Adu-Gyamfi (born 1991), better known by her stage names Moko or Nadiah Adu-Gyamfi, is a Ghanaian-British soul singer. She rose to fame after featuring on the Chase & Status single \"Count on Me\". Moko has released two EPs, Black (2013) and Gold (2014), on MTA and Virgin EMI. Under the stage name Nadiah Adu-Gyamfi, she won the £500,000 jackpot on ITV music game show Walk the Line in December 2021.", "link_mentions": [{"page": "Chase & Status", "response": ["On 8 March 2013, the duo were confirmed to headline Saturday night at Roskilde Festival following Metallica at Orange stage. On 11 March 2013, the duo were confirmed through their website to co-headline Saturday night at Reading Festival and Sunday night at Leeds Festival 2013. On 4 June 2013, the album's lead single \"Lost & Not Found\" featuring Louis M^ttrs was uploaded to the Chase & Status Vevo channel. The digital single was released on 26 June and includes remixes from MTA Records artists Dream Mclean, Kove and Josh Butler. On 17 June 2013, MTA Records announced that newly signed Elli Ingram will support them on tour and feature on the album. On 26 July 2013, they announced the album title to be Brand New Machine. The album's second single \"Count On Me\" featuring Nadiah Adu-Gyamfi (under her stage-name \"Moko\") premiered on B.Traits' BBC Radio 1 show on the same day, and the album artwork was released. \"Count On Me\" was released on 29 September. The album was released on 7 October. On 24 August 2013, they performed on the Main Stage at Reading Festival before Eminem. During the performance, MC Rage had to stop the show due to people being crushed at the front of the crowd. The act was resumed, and finished successfully. They headlined 1Xtra Live in Bournemouth on 7 October, the same day as the album release, and returned to the BIC on their arena tour in November. The band played their first show in India during the multi-genre music festival NH7 Weekender on 20 October 2013."]}, {"page": "Moko (disambiguation)", "response": ["Moko is a character in the mythology of Mangaia in the Cook Islands.", "Moko (disambiguation) may also refer to:", "* Moko (dolphin), a male bottlenose dolphin that associated with New Zealanders from 2007 to 2010", "* Moko, Burkina Faso, a village", "* Moko drum, Asian bronze drums", "* Moko, a pen-name of Sidney Moko Mead, New Zealand author", "* Nadiah Adu-Gyamfi, a British soul singer, previously known by the stage-name \"Moko\"", "* Moko skink (Oligosoma moco), a species of skink in the family Scincidae", "* Pépé le Moko, a 1937 French film about a criminal from Toulon"]}, {"page": "Brand New Machine", "response": ["Brand New Machine is the third studio album by English drum and bass production duo Chase & Status. It was released on 7 October 2013 by MTA Records under exclusive license to Mercury Records. The album features vocal contributions from a new wave of British talent, including Louis M^ttrs, Moko, Jacob Banks and Elli Ingram, as well as contributions from Major Lazer, Nile Rodgers and rapper Pusha T. The duo toured the album with an arena tour beginning on 31 October 2013. They also headlined 1Xtra Live at the Bournemouth International Centre on the same day as the release of the album.", "\"Lost & Not Found\", featuring vocals from Brighton-based Louis M^ttrs, was released as the album's lead single on 24 June 2013. The track was initially released on Clubland 23 before its official single release, meaning the release date was brought forward by a week.https://www.facebook.com/chaseandstatus/posts/10151442349515974 A music video to accompany the release of \"Lost & Not Found\" was first released onto YouTube on 4 July 2013 at a total length of five minutes and eight seconds. \"Count on Me\", featuring vocals from British singer and songwriter Moko, was released as the album's second single on 29 September 2013. A two-and-a-half minute version of the song originally premiered back in July, before the full mix was premiered on 29 August 2013. The music video was released via the band's official website on 20 September 2013, originally through a JavaScript modification of Twitter. The track entered at number five on the UK Singles Chart on 6 October 2013. \"Machine Gun\", featuring vocals from Pusha T, premiered on 21 August 2013 as a promotional single. It entered the UK Singles Chart at number 114 without independent release. However, it received frequent airplay on BBC Radio 1Xtra. Upon the album release, \"International\" charted at number 116 supported by sales of the Skrillex remix. \"Alive\", featuring vocals from Jacob Banks, was released as the album's third single on 15 December 2013. It was performed on Later... with Jools Holland on 8 November 2013. It managed to enter the UK Dance Chart at number 16 prior to independent release, later rising to number 26 in the UK Singles Chart. The song received a surge in popularity due to featuring in the FIFA 14 for Xbox One and PlayStation 4 trailer. \"Blk & Blu\" was released as the album's fourth single on 16 March 2014. It peaked at number 52 on the UK Singles Chart. A video for \"International\" was released on 6 August, and a remix by Dimension was released for free download on the same day.", "*Diane Nadia \"Moko\" Adu-Gyamfi – vocals "]}, {"page": "Count On Me (Chase & Status song)", "response": ["\"Count on Me\" is a song by British record production duo Chase & Status, featuring vocals from British singer Moko (also known as Nadiah Adu-Gyamfi). It was released as the second single from their third studio album Brand New Machine on 29 September 2013. The single peaked at number five on the UK Singles Chart, tying with \"Blind Faith\" as their highest-charting single to date.", "Because while gone are the heavy dubstep lines and wobbly breakdowns, they've far from lost their knack for a giant chorus, which is demonstrated no better than on their current offering. Aided by a rich and growly vocal supplied by rising soul singer Moko, her looped vocal on the chorus sounds like something straight out of the early '90s techno scene. That said, it's C&S's slick and strobing production that hauls it firmly back to the present day. .", "* Nadiah Adu-Gyamfi (aka Moko) – vocals"]}, {"page": "Kove (musician)", "response": ["! scope=\"row\"| \"Hurts\"(featuring Moko)"]}, {"page": "Walk the Line (TV series)", "response": ["The winner of the fourth, fifth and final episode was London-based singer Nadiah Adu-Gyamfi, who has featured under the stage-name \"Moko\" on two singles by electronic music duo, Chase & Status including on the UK Top 5 hit single \"Count On Me\". Nadiah \"Walked the Line\" one final time in the last episode and won the audience vote, taking home the £500,000 jackpot."]}]}}