{"wiki_id": "http://www.wikidata.org/entity/Q16215200", "itemLabel": "James Carpenter", "itemDescription": "English cricketer (born 1975)", "wikipedia_url": "https://en.wikipedia.org/wiki/James_Carpenter_(cricketer)", "wikipedia_page": {"main": "James Robert Carpenter (born 20 October 1975) is a former English cricketer. Carpenter was a left-handed batsman who bowled slow left-arm orthodox. He was born at Birkenhead, Cheshire.\nCarpenter made a single Minor Counties Championship appearance for Cheshire against Oxfordshire in 1996, before joining Sussex in 1997. In that same year he made his first-class debut for the county against Surrey in the County Championship. He made infrequent appearances for Sussex in first-class cricket, making twelve more appearances, the last of which came against New Zealand A in 2000. In his thirteen first-class appearances, he scored a total of 383 runs at an average of 15.95, with a high score of 65. This score, which was one of two first-class fifties he made, came against Nottinghamshire in 1998.In his debut season, Carpenter also made his List A debut against Surrey in the 1997 AXA Life League. Utilised more by Sussex in the shorter format of the game, Carpenter made a total of 57 List A appearances. His appearances in this format went beyond his final first-class appearance in 2000, with his final List A match coming against Hampshire in the 2002 Norwich Union League. The majority of his List A appearances came in the 1998 and 1999 seasons, after which he found his opportunities limited. In his 57 List A matches, Carpenter scored a total of 827 runs at an average of 22.97, with a high score of 64 not out. This score was one of five half centuries he made in that format and came against Nottinghamshire in 1999. He was released by Sussex at the end of the 2002 season.", "link_mentions": [{"page": "James Carpenter", "response": ["James Carpenter may refer to:", "*James Carpenter (actor), Shakespearean actor in the San Francisco Bay Area", "*James Carpenter (architect) (born 1949), American light artist and designer", "*James Carpenter (astronomer) (1840–1899), British astronomer", "*James Carpenter (American football) (born 1989), American football offensive lineman", "*James Carpenter (cricketer) (born 1975), former English cricketer", "*James Carpenter (fencer) (born 1962), American fencer"]}]}}