{"wiki_id": "http://www.wikidata.org/entity/Q16224610", "itemLabel": "J. Knill", "itemDescription": "cricketer", "wikipedia_url": "https://en.wikipedia.org/wiki/J._Knill", "wikipedia_page": {"main": "Left-Handed v Right-Handed was an occasional first-class cricket fixture held in England between 1790 and 1870. There were four such fixtures in all where a team titled \"Left-Handed\" played a team titled \"Right-Handed\". Additionally, a left-handed team played in two other matches against Marylebone Cricket Club (MCC). There are no instances of a right-handed team except in the four matches against left-handed teams.\nThe first match in 1790 was held at Lord's Old Ground in London and the other five at Lord's Cricket Ground, which opened in 1814. The first match was played 10–12 May 1790 and won by the left-handed team by 39 runs. Hambledon players Tom Sueter, James Aylward and David Harris made significant contributions to the left-handed cause. The right-handed gained belated revenge in 1828 when they won by 226 runs, fielding a very strong team which included Fuller Pilch, Jem Broadbridge and William Lillywhite.In July 1833, a left-handed team including Nicholas Felix and Tom Marsden played MCC and won by 149 runs. Two years later, another strong right-handed team won by an innings and 87 runs, Sam Redgate capturing ten wickets in the match. The left-handed team were more than 100 runs behind on first innings and were asked to follow on, the first time that a new follow-on law was operated; it was next modified in 1854. Left-handed played MCC again in July 1838 and this time were outclassed, losing heavily by an innings and 159 runs.That one-sided match ended the idea of a left-handed team for over thirty years until it was resurrected one last time in May 1870. Again, however, the left-handed were well beaten, losing to the right-handed team, which included W. G. Grace, by an innings and 8 runs.", "link_mentions": [{"page": "Knill (surname)", "response": ["*J. Knill, English cricketer"]}]}}