{"wiki_id": "http://www.wikidata.org/entity/Q16205309", "itemLabel": "Jo Hamilton", "itemDescription": "British interior designer", "wikipedia_url": "https://en.wikipedia.org/wiki/Jo_Hamilton_(interior_designer)", "wikipedia_page": {"main": "Jo Hamilton (born in Eton, Berkshire) is a leading British interior designer and artist, known for her expertise in colour. She is the founder and creative director of Jo Hamilton Interiors, taking on residential and commercial work in the UK and abroad. Hamilton is also a newspaper columnist and runs interior design courses at her London offices, in Belsize Park.\nHamilton is a show ambassador and key speaker for House, in Dublin's RDS, and the Index Exhibition, in Dubai's World Trade Centre. She was also the long-term resident interior designer at Grand Designs Live in both London and Birmingham as well as a key speaker and one of three \"show ambassadors\" along with Kevin McCloud and Charlie Luxton, and formerly George Clarke (architect).Further keynote public speaking appointments have included London's Decorex, the International Contemporary Furniture Fair (ICFF), in New York, and the International Property Awards, for which she is a judge. Hamilton also became a What House? Awards judge in 2016, with What House? editorial director Rupert Bates stating: “We are delighted to have Jo on board. She is hugely talented and regarded and joins an outstanding panel of judges.” She is a judge also for the Index Architecture and Design Awards.Hamilton has appeared on Sky Living series Who'd Be a Billionaire?, BBC's What To Do With The House (When The Kids Leave) and ITV's 60-Minute Makeover, among others.Hamilton regularly features in interviews about interior design trends and issues by media outlets that have included The Independent, the Daily Telegraph, The Times, Irish Independent, Metro, BBC, International Property & Travel, Rightmove, and UAE fashion magazine Elite Monde, among others.\nHamilton has worked on interior design-related PR activities with a number of respected companies, including Virgin Money UK and First Time Buyer Online. In 2014, she was commissioned by homewares chain HomeSense to open a series of new stores across England, including Cheltenham, Solihull and Salisbury. Hamilton has also been a brand ambassador for Bosch Power Tools - also known as Robert Bosch GmbH - and Dulux.\n\nFrom a young age Hamilton believed she would become an artist, with her \"first love\" being fashion design. She became an interior designer in 1995 with a brief professional background in graphic design before she had three children.\nHer father, Brian Clarke, writes a monthly column for The Times, on fly-fishing and the environment.", "link_mentions": [{"page": "Interior design", "response": ["Notable interior designers in the world today include Scott Salvator, Troy Adams, Jonathan Adler, Michael S. Smith, Martin Brudnizki, Mary Douglas Drysdale, Kelly Hoppen, Kelly Wearstler, Nina Campbell, David Collins, Nate Berkus, Sandra Espinet, Jo Hamilton and Nicky Haslam."]}, {"page": "Grand Designs", "response": ["Grand Designs Live takes place biannually, in London in the spring and Birmingham in the autumn. The exhibitions showcase contemporary design and technology for the home and garden, along with hundreds of stands for suppliers and manufacturers to promote their goods and services. Design and media personalities Kevin McCloud, George Clarke and Jo Hamilton are show ambassadors."]}, {"page": "Jo Hamilton", "response": ["Jo Hamilton  may refer to:", "* Jo Hamilton (interior designer) British interior designer", "* Jo Hamilton (musician) British musician", "* Jo Hamilton (politician) (1827–1904) former California Attorney General "]}, {"page": "Brian Clarke (author)", "response": ["One of Clarke's three daughters is the interior designer Jo Hamilton."]}]}}