{"wiki_id": "http://www.wikidata.org/entity/Q16239398", "itemLabel": "John Davenport", "itemDescription": "British politician", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Davenport_(industrialist)", "wikipedia_page": {"main": "John Davenport (29 September 1765 – 12 December 1848) was one of the most financially successful English industrial potters, founder of the Davenport Pottery firm in Longport in The Potteries. He served as the Conservative M.P. for Stoke from 1832 to 1841.A native of the nearby rural town of Leek, he worked for a while for a local bank then in 1794 he set himself up as a pottery manufacturer in Longport, Stoke-on-Trent. His ruthless business sense combined with the technical breakthroughs of Wedgwood and Spode, and made his firm a formidable force in the growing export trade from the Potteries.\nHe married Diana Ward in 1795 and they had two daughters and three sons. Davenport resided at Westwood Hall from 1813, and the running of his business began to pass to his son Henry in the 1820s. This left Davenport time to become involved in politics. He served in the Commons as a diligent local M.P. until 1841. He was also deputy lieutenant for Staffordshire.A portrait of Davenport by an unknown artist is held by the Potteries Museum & Art Gallery.", "link_mentions": [{"page": "John Davenport", "response": ["* John Davenport (rally driver), co-winner of the 1968 RAC Rally and British Leyland's Director of Motorsport from the end of 1976.", "* John Davenport (baseball), born 1922, American baseball player in 1954 New York Giants (MLB) season", "* John Davenport (Connecticut politician) (1752–1830), U.S. Representative from Connecticut, 1799–1816", "* John Davenport (industrialist) (1765–1848), British pottery manufacturer and member of parliament for Stoke-upon-Trent, 1832–1841", "* John Davenport (Ohio politician) (1788–1855), U.S. Representative from Ohio, 1827–1828", "* John Davenport (minister) (1597–1670), Puritan minister and colonist in New Haven Colony", "* John Davenport (orientalist) (1789-1877), British orientalist scholar", "* John Davenport (trade unionist) (died 1941), British trade unionist", "* Otis Blackwell (1932–2002), musician who used the pseudonym John Davenport", "* John Davenport (economic journalist) (1904–1987)", "* John Davenport (journalist), former host of Washington Week", "* John Davenport (critic) (1908-1966), British poet and critic", "* John Davenport Siddeley, 1st Baron Kenilworth (1866–1956), automobile pioneer"]}, {"page": "Longport, Staffordshire", "response": ["John Brindley, younger brother of James Brindley, established the first pottery factory here in 1773, and other businessmen built pottery factories soon afterwards. John Davenport acquired John Brindley's factory in 1794, and other pottery factories, and the works were enlarged.", "John Davenport's son William became head of the pottery company in the mid 19th century. His home was Longport Hall, originally built in the 1770s; it was immediately south of Trubshaw Cross.Longport Hall thepotteries.org. Retrieved 31 July 2018. The building was demolished in the 1880s."]}, {"page": "Stoke-upon-Trent (UK Parliament constituency)", "response": ["|rowspan=\"5\"| John Davenport"]}, {"page": "Davenport Pottery", "response": ["In 1785, John Davenport began as a potter working with Thomas Wolfe of Stoke. In 1794, he acquired his own pottery at Longport and began producing cream-coloured blue and white transfer-printed earthenware. In 1801 he began making glass, and by 1805 he was making porcelain and stone china as well.Godden, 116  By September 1806 the quality of his porcelain wares was such that the Prince of Wales, later to become King George IV, ordered services of the finest and most valuable kinds.Staffordshire Advertiser, 20 September 1806 "]}, {"page": "John Davenport (MP)", "response": ["#REDIRECT John Davenport (industrialist)"]}, {"page": "Westwood Hall", "response": ["===John Davenport===", "In 1813 the younger Booth Grey sold the estate to the industrialist John Davenport, founder of Davenport Pottery. He enlarged the building, employing the architect James Elmes; the resulting house had an Elizabethan style. John Davenport died in 1848, and his heir, also John Davenport, made further modifications. Employing architects Hadfield Weightman and Goldie, the house was extended, the work being carried out from 1850 to 1853. ", "The younger John Davenport sold Westwood Hall in 1868 to John Robinson, a locomotive engineer. After the death of Robinson's widow Helen in 1908, it was the home of H. J. Johnson; he sold it in 1920 to Staffordshire County Council, and in 1921 it was opened as a girls' school. In 1965, merging with a newly built school nearby on Westwood Park Avenue, it became the mixed comprehensive Westwood County High School. In 1980 it became a 14–18 comprehensive High School.\"About\" Westwood College. Retrieved 17 November 2019."]}]}}