{"wiki_id": "http://www.wikidata.org/entity/Q16203878", "itemLabel": "Hannah Claydon", "itemDescription": "glamour model", "wikipedia_url": "https://en.wikipedia.org/wiki/Hannah_Claydon", "wikipedia_page": {"main": "Hannah Claydon is an English glamour model from Wakefield, West Yorkshire.Claydon has been modelling since she was 15 years old, and in 2004 she made the Top 100 girls in FHM magazine's \"High Street Honeys\" competition to find the nation's top amateur models. This was happening as she was revising and taking her A-Level exams at Sixth Form College. She went on to achieve 4 \"A\" grades in her exams and was set to study Law at Oxford University but took a year out \"to give modelling a go\".Her modelling took off and she had a successful career, appearing in many publications including Page 3 of the Daily Star and The Sun newspapers. As well as The Sun's \"Dear Deidre\" and Sunday People's \"Dear Jane\" agony-aunt pages. Hannah has also appeared in British men's magazines Loaded, FHM, Maxim, Nuts and Zoo. She appeared for the American Score website, which specialises in large busted models, and Playboy Special Editions magazines. She regularly appears on Babestation and Only Tease websites.\nShe has been a popular model with The Daily and Sunday Sport newspapers. In the spirit of the newspaper's sensationalism, Hannah's image appeared on the shirts of Creighton Rugby Union Club, Cumbria, England.Claydon admitted in the Daily Sport that she had her breasts augmented to their current size in 2004. She is also a supporter of Leeds United football club.", "link_mentions": [{"page": "Sunday Sport", "response": ["The Sunday Sport capitalized on the popularity of The Suns Page 3 feature, but made sexualized content more of a primary focus by printing topless glamour models across multiple pages and publishing a \"nipple count\" to highlight how many exposed breasts it featured. The tabloid courted controversy by featuring 15-year-old aspiring glamour models in scantily clad poses, counting down the days until it could legally show them topless on their 16th birthdays, as it did with Linsey Dawn McKenzie and Hannah Claydon, among others. The Sexual Offences Act 2003 ended this practice by raising the minimum permissible age for topless modeling to 18. "]}, {"page": "Daily Sport", "response": ["The Sport claimed to have launched the careers of numerous models, among them Louise Hodges who modeled throughout the 1990s Linsey Dawn McKenzie, who began posing topless for the newspaper in 1994, and Cherry Dee who began posing topless for them in 2003 when they were both 16 (the legal age for such activity in the United Kingdom at the time). Among recent popular Sport models were Kelly Bell, Hannah Claydon and Lauren Pope; however, very few Sport models also appeared in the other tabloids which the paper regarded as its rivals."]}, {"page": "List of glamour models", "response": ["*Hannah Claydon"]}]}}