{"wiki_id": "http://www.wikidata.org/entity/Q16226659", "itemLabel": "Paul Isola", "itemDescription": "Gibraltarian musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Paul_Isola", "wikipedia_page": {"main": "Breed 77 (pronounced \"Breed Seven-Seven\") is an Gibraltarian rock band. The band was formed in 1996 and perform a combination of alternative metal, rock, and flamenco.", "link_mentions": [{"page": "Breed 77", "response": ["Breed 77 comes from the British overseas territory of Gibraltar. Old Gibraltarian school friends Paul Isola, Danny Felice, and Stuart Cavilla met up in London and became informally known as the Gibraltarian Mafia. When, in late April 1996, this circle of friends formed a band, they wanted a name to reflect their joint origins and called themselves simply Breed. The band were forced to change their name because it was previously registered by Steve Hewitt (formerly of Placebo) on his vanity record label. Stuart Cavilla, the band's bass player, had previously worked as a motorcycle courier under the call sign of Kilo 77 or K77, and the band became Breed 77.", "On 28 August 2013, lead vocalist Paul Isola announced his departure from the band due to personal circumstances, detailing that he would not be participating in the band's upcoming summer tour. He revealed that his replacement would be Rui Lopez, who would be completing the lineup for the four dates and joining the band thereafter.", "Following this, it was announced in early 2014 that Paul Isola was to rejoin the band for a newly announced 10th Anniversary tour for the album Cultura. ", "Vocalist Paul Isola returned to his homeland of Gibraltar, forming a multi-media production company. ", "After the Coronavirus pandemic in early 2020, vocalist Paul Isola returned to the public eye for the first time in almost 3 years, performing a livestream of a number of songs as part of the Gibraltar Live At Home sessions. ", "As of February 2021, the full lineup of the reunited band has not been confirmed publicly, however it is thought based on the music video released that the band will consist of vocalist Paul Isola and guitarists Danny Felice and Pedro Caparros López with any other members currently unknown.", "* Paul Isola (Gibraltar) lead vocals, (1996–2013, 2014–2015, 2017, 2021-)"]}, {"page": "Cultura (Breed 77 album)", "response": ["All tracks written by Paul Isola, Danny Felice, Pedro Caparros López & Stuart Cavilla."]}, {"page": "In My Blood (En Mi Sangre)", "response": ["All tracks written by Paul Isola, Danny Felice, Pedro Caparros López & Stuart Cavilla."]}, {"page": "La Última Hora", "response": ["\"La Última Hora\" is a song and single by Gibraltarian Flamenco Metal band Breed 77. It was first released as a CD EP in a card slip-case, and later released as a CD single and 7\" Vinyl. Released on 20 November 2003, this was the first new song to be heard from Cultura. All tracks written by Breed 77. Recorded at Alberts Studio, London. The line-up for this single consisted of: Paul Isola, Danny Felice, Stuart Cavilla, Pete Chichone and Pedro Caparros.\"La Última Hora\" info from Breed 77 Fansite ."]}, {"page": "The River (Breed 77 song)", "response": ["Track 1 written by Paul Isola & Danny Felice. Track 2 (CD1) written by Danny Felice, Paul Isola, Pete Chichone. Track 2 (CD2) written by Pedro Caparros, Paul Isola, Danny Felice.", "The line-up for this single consisted of Paul Isola, Danny Felice, Stuart Cavilla, Pete Chichone and Pedro Caparros.", "The music video for this single was fully directed by Paul Isola. It was filmed at three different locations along the southern coast of the Iberian Peninsula. These included Río Tinto in Huelva, Tarifa in Cádiz (both in Spain) and finally Europa Point in Gibraltar. Río Tinto is a river which carries blood red waters due to its high mineral content, which provided the video with striking visuals. The famous sand dunes of Tarifa provides the video with a desert-like background, giving it a sense of scorching heat which is felt throughout the video. The Ibrahim-al-Ibrahim Mosque at Europa Point in Gibraltar can be clearly seen in the background as the band is seen playing their music and displaying a flag of Gibraltar as they do on stage at their concerts. This location holds a special meaning to the band as it is a place where they would hang out for hours during their teenage years."]}, {"page": "World's on Fire (song)", "response": ["Track 1 written by Paul Isola, Danny Felice & Pedro Caparros. Track 2 (CD) written by Breed 77. Track 2 (DVD + Vinyl) written by Pete Chichone, Paul Isola & Danny Felice.", "The line-up for this single consisted of: Paul Isola, Danny Felice, Stuart Cavilla, Pete Chichone and Pedro Caparros."]}, {"page": "Shadows (Breed 77 song)", "response": ["Track 1 & 2 (CDs) were written by Paul Isola, Danny Felice, Stuart Cavilla and Pete Chichone. Track 2 (vinyl) was written by Danny Felice, Paul Isola, Pedro Caparros and Stu Cavilla.", "The line-up for this single consisted of Paul Isola, Danny Felice, Stuart Cavilla, Pete Chichone and Pedro Caparros.\"Shadows\" info from Breed 77's unofficial website"]}, {"page": "The Message (EP)", "response": ["All tracks written by Danny Felice & Paul Isola.", "The line-up for this EP consisted of: Paul Isola, Danny Felice, Stuart Cavilla and Pete Chichone.\"The Message\" info from Breed 77's unofficial website"]}, {"page": "List of Gibraltarians", "response": ["* Paul Isola, (b. 1972), former Breed 77 vocalist"]}, {"page": "Gibraltarians", "response": ["File:Paul Isola.JPG|Paul Isola"]}, {"page": "Surianne", "response": ["Her single \"Stronger Than Before\" entered the iTunes UK Top 100 Latino songs at No. 56 on 25 January 2011. She continued her work as an Ambassador for London-based charity Hestia Housing & Support, organising music workshops and events and promoting Hestia's Domestic Violence services. In 2016, she released an experimental new single \"Hold On\", produced by Mikki Nilsen and music video produced by Paul Isola from Gibraltar rock band Breed77. In 2010, Surianne formed part of a Reggaeton project and worked with British record producer and composer Jay Singh (known for the hit single \"Dare La La La\" which he co-wrote and produced for Shakira's tenth studio album, going top 10 in most countries worldwide) co-writing a track called \"Amor\". In 2016, Latino artist Jesse Medeles releases \"Amor\" as his second single after reaching No. 1 on the Top 20 National Latin Dance Charts across the U.S. with his first single \"Sucia\".", "Surianne, although not married, is partner of the lead singer of Gibraltarian rock band Breed77, Paul Isola. They have been together since 2000."]}, {"page": "History of the Genoese in Gibraltar", "response": ["* Paul Isola (Breed 77 vocalist)"]}, {"page": "Isola (surname)", "response": ["*Paul Isola, Gibraltarian musician and songwriter"]}]}}