{"wiki_id": "http://www.wikidata.org/entity/Q16232430", "itemLabel": "Luke Sital-Singh", "itemDescription": "British singer-songwriter", "wikipedia_url": "https://en.wikipedia.org/wiki/Luke_Sital-Singh", "wikipedia_page": {"main": "Luke Sital-Singh is a British singer-songwriter.\n\n", "link_mentions": [{"page": "Luke (given name)", "response": ["*Luke Sital-Singh (born 1988), British singer-songwriter"]}, {"page": "New Malden", "response": ["* Luke Sital-Singh – singer-songwriter"]}, {"page": "Greenbelt Festival", "response": ["| rowspan=\"3\" | Sinead O'Connor, Stornoway, Tinariwen, Luke Sital-Singh, Gilles Peterson, Jahmene Douglas, Boo Hewerdine, Beth Rowley, Lau, Hackney Colliery Band, Bridie Jackson & The Arbour, Emily and The Woods, Gaggle, Samantha Crain, Wara, Winter Mountain, Jason Carter, Dizraeli and the Small Gods, Hobbit, Cathy Burton, Harp and a Monkey, Heather Hind, Levi Hummon, RM Hubbert, The Chaplins, The Cut Ups, Tiny Ruins, Ezio, Josephine and The Artizans, The Jonny Walker Band, Apirana Quartet, Benjamin Blower & The Army of the Broken Hearted, Fischy Music, Flute of Shame, Lotte Mullan, The Claze, Thumb, Vive, The Observatory, Jump Cannon Productions, Berkeley Ensemble, Harry Bird and the Rubber Wellies, Hope & Social, The Tombola Theory (with Ben Castle), The Old Plough Folk Club, Atlum Schema, Chris T-T & The Hoodrats, Ellie Rose, Flight Brigade, Folk On, Grace Petrie, Guvna B, Hannah Scott, Jasmine Kennedy, Jess Morgan, Luke Leighfield, Marcus Hummon, Martyn Joseph, Rory Butler, Yvonne Lyon, Stanley Odd, The Travelling Band, Clara Sanabras, Wednesday's Wolves, Harvey Brough", "| rowspan=\"3\" | Newton Faulkner, Kate Rusby, Luke Sital-Singh, Wildwood Kin, Sound of the Sirens, Jess Morgan, Martyn Joseph, Joanne Shaw Taylor, Clean Cut Kid, CC Smugglers, Dan Donovan, King Porter Stomp, Lee Bains III & the Glory Fires, Jasmine Kennedy, The Rubber Wellies, Will Varley, Jasper in the Company of Others, Zoe Lyons, Paul Kerensa"]}, {"page": "Aqualung (musician)", "response": ["| Luke Sital-Singh", "| Luke Sital-Singh"]}, {"page": "Sleeper (band)", "response": ["Stewart moved to Los Angeles, California, where he played with West Coast band UFO Bro and contributed as a session guitarist to k.d. lang's album Invincible Summer (2000) and Mel C's album Reason. After returning to the UK he became Course Leader of the BA (Hons) Music Business and a lecturer in popular culture and music history at the British and Irish Modern Music Institute in Brighton, where his former students include The Kooks, James Bay, Black Honey (band), The Xcerts, Kate Walsh and Luke Sital-Singh, as well as members of As It Is and Miss Vincent, amongst others.  Stewart also wrote a monthly column for Guitarist magazine from 2002 to 2010, and gained a PhD Music from the University of Southampton in 2018. In 2019 he joined The Wedding Present as guitarist during their thirtieth anniversary Bizarro UK and EU tour."]}, {"page": "Sasquatch! Music Festival", "response": ["*Luke Sital-Singh"]}, {"page": "Latitude Festival", "response": ["<BR>Luke Sital-Singh"]}, {"page": "Haldern Pop", "response": ["| Alabama Shakes, Allah-Las, Anna Von Hausswolff, Ásgeir Trausti, Balthazar, Bear's Den, Ben Caplan, Brandt Brauer Frick, Buke and Gase, Connan Mockasin, DakhaBrakha, Dan Croll, Death Letters, Denis Jones, Die Goldenen Zitronen, Douglas Dare, Duologue, Ebbot Lundberg and Trummor & Orgel, Efterklang, Florian Ostertag, Glen Hansard, Gold Panda, Half Moon Run, Ja, Panik, James, Jherek Bischoff, John Grant, Julia Holter, Käptn Peng & Die Tentakel von Delphi, Kettcar, Lee Fields & The Expressions, Local Natives, Lubomyr Melnyk, Luke Sital-Singh, METZ, Mikal Cronin, Orchestre Miniature In The Park, Owen Pallett, Pascal Finkenauer, Regina Spektor, Renate Granate, Rival Consoles, Rubik, Sam Amidon, Sophie Hunger, Stargaze with Andé de Ridder, Suuns, The Staves, The Strypes, These New Puritans, This Is The Kit, Tom Odell, Trümmer, Villagers, We Were Promised Jetpacks", "| Alexi Murdoch, All The Luck In The World, Augustines, Benjamin Clementine, Bernhoft, Big Sixes, Big Ups, Black Lips, Boy & Bear, Cantus Domus, Carlos Cipa, Champs, Charity Children, Chet Faker, Conor Oberst, Connan Mockasin, Dawes, East Cameron Folkcore, Ed Harcourt, Enno Bunger, Ewert and The Two Dragons, Fat White Family, Fink, First Aid Kit, Grant Hart with stargaze, Honig, Hozier, Jeff Beadle, Jeffrey Lewis & the Jrams, Jonathan Toubin, Josh Record, Kurt Vile & the Violators, Kwabs, Lee Fields & The Expressions, Luke Sital-Singh, Manu Delago Handmade, Mariam The Believer, Money For Rope, My Brightest Diamond, Never Sol, Nick Mulvey, Ought, Patti Smith and her band, Poppy Ackroyd, Rhodes, Royal Blood, Ry X, Samantha Crain, Sam Smith, Speedy Ortiz, stargaze und André de Ridder, Stephan Eicher, Sun Kil Moon, The Acid, The Districts, The Mispers, The Slow Show, Tom The Lion, Trampled By Turtles, Wintergatan."]}, {"page": "Pure (The Lightning Seeds song)", "response": ["English singer-songwriter Luke Sital-Singh released \"Pure\" as a single in May 2016."]}, {"page": "British and Irish Modern Music Institute", "response": ["* Luke Sital-Singh"]}, {"page": "Sound of...", "response": ["| Chance The Rapper, Chlöe Howl, FKA twigs, Jungle, Kelela, Luke Sital-Singh, MNEK, Nick Mulvey, Royal Blood, Say Lou Lou", "The longlist for the Sound of 2014 poll was revealed on 2 December 2013. The acts nominated were Banks, Chance the Rapper, Chlöe Howl, Ella Eyre, George Ezra, FKA twigs, Jungle, Kelela, Luke Sital-Singh, MNEK, Nick Mulvey, Royal Blood, Sam Smith, Sampha and Say Lou Lou. On 10 January 2014, Sam Smith was announced as the winner on Radio 1 by Nick Grimshaw."]}, {"page": "Apple Music Festival", "response": ["* September 8: Robert Plant + Luke Sital-Singh"]}, {"page": "NH7 Weekender", "response": ["The festival travelled to four cities in the span of a month. Starting off with Kolkata (1-2 Nov), Bangalore (8-9 Nov), Pune (21-23 Nov) and Delhi NCR (29-30 Nov). Headliners included The Vaccines, Jon Hopkins, Fear Factory, Luke Sital-Singh, and Amit Trivedi.", "|Luke Sital-Singh"]}, {"page": "Justin Parker", "response": ["*Luke Sital-Singh"]}, {"page": "The Fire Inside (Luke Sital-Singh album)", "response": ["The Fire Inside is the debut studio album by British singer-songwriter Luke Sital-Singh. It was released on 18 August 2014 and peaked at number 43 in the UK Official Charts"]}, {"page": "British Summer Time (concerts)", "response": ["Luke Sital-Singh"]}, {"page": "ITunes New Artist Spotlight", "response": ["* Luke Sital-Singh"]}, {"page": "Old Sea Brigade", "response": ["Old Sea Brigade's debut self-titled EP was released in January 2016 to much critical acclaim. Cramer spent the following year touring the United States and Europe, including support shows with Joseph, Julien Baker, and Benjamin Francis Leftwich. His music has been described as indie folk with \"a sense of Southern-gothic\". Old Sea Brigade released his debut album Ode to a Friend in January 2019. In August 2020, Old Sea Brigade released a collaborative EP, All The Ways You Sing In The Dark, with his friend, Luke Sital-Singh. Old Sea Brigade's music has been featured in notable TV shows including Grey's Anatomy, This Is Us, Nashville (2012 TV series), and A Million Little Things.", "|Collaborative EP with Luke Sital-Singh"]}, {"page": "Time Is a Riddle", "response": ["#REDIRECT Luke Sital-Singh"]}, {"page": "Time is a Riddle", "response": ["#REDIRECT Luke Sital-Singh"]}, {"page": "List of Parlophone artists", "response": ["* Luke Sital-Singh"]}, {"page": "Sital-Singh, Luke", "response": ["#redirectLuke Sital-Singh"]}]}}