{"wiki_id": "http://www.wikidata.org/entity/Q16208920", "itemLabel": "William Bedford", "itemDescription": "British admiral; (1764-1827)", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Bedford_(Royal_Navy_officer)", "wikipedia_page": {"main": "William Bedford (c. 1764 – October 1827) was an officer of the Royal Navy. He served during the American War of Independence and the French Revolutionary and Napoleonic Wars.", "link_mentions": [{"page": "Solomon Ferris", "response": ["Acquitted of blame, Ferris was almost immediately appointed to a new command. He was given the 74-gun  in September 1801, and commanded her until February 1803, when he left the ship and was superseded by Captain William Bedford. Ferris's new command was the 74-gun , which he commissioned in February. He took her out to the West Indies, and became senior officer at Port Royal. His time in command was short-lived, he was taken ill suddenly in May 1803, and died after two days. Most remembered for his command of Hannibal during the First Battle of Algeciras, this was mentioned in most of his obituaries. Ferris also appears as a minor character in the first of the Aubrey–Maturin series of nautical historical novels by Patrick O'Brian, Master and Commander. He is shown meeting the character Jack Aubrey, who was based on the real-life exploits of Lord Cochrane, shortly after the First Battle of Algeciras, and is described as a former shipmate of Jack's."]}, {"page": "William Lechmere", "response": ["Lechmere took command of the 64-gun  in 1796, during which time she was the flagship of Vice-Admiral George Vandeput on the Halifax station.  He went out to Lisbon in February 1797 and there captured the Spanish privateer Atrebedo on 28 February. He moved to the 74-gun  in July 1797 and resumed his previous duties as commander of Vandeput's flagship at Halifax. He commanded Resolution until paying her off in October 1798. He then appears to have been unemployed for a period, as he is not recorded in command of a ship until April 1805, when he superseded Captain William Bedford, and commissioned the 74-gun ."]}, {"page": "William Bedford", "response": ["William Bedford may refer to:", "*William Bedford (chaplain) (1781–1852), Clergyman in Van Diemen's Land", "*William Bedford (footballer) (born  1861), Doncaster Rovers player", "*William Bedford (Royal Navy officer) ( 1764–1827), officer of the Royal Navy", "*William Bedford (basketball) (born 1963), retired NBA player"]}, {"page": "Order of battle in the Biscay campaign of June 1795", "response": ["| align= left | Vice-Admiral Sir Alan GardnerCaptain William Bedford"]}, {"page": "William Bedford (admiral)", "response": ["#REDIRECT William Bedford (Royal Navy officer)"]}, {"page": "Robert Fanshawe (Royal Navy officer)", "response": ["Captain Robert Fanshawe died at Stonehall, Stonehouse, Plymouth, Devon on 4 February 1823; at which period, had he accepted his flag, he would have been the senior Admiral of the Red. He was buried at St George's Church, Devon. On 5 December 1769 Fanshawe had married Christiana Gennys,https://histfam.familysearch.org//getperson.php?personID=I113406&tree=Nixon daughter of John Gennys of Whitleigh Hall, Saint Budeaux, Devon. They had three sons and nine daughters together. His eldest son, also named Robert, followed his father into the navy, rising to the rank of captain. He died at Antigua in 1804 while in command of HMS Carysfort, the ship his father had commanded 30 years earlier. His second son, Edward, served as an officer in the Royal Engineers, while his third son, Arthur, rose to flag rank, as did Robert's grandson, Edward. Of his daughters; Christiana married the Rev. Francis Haggitt, Prebendary and Sub-Dean of Durham; Elizabeth married F. Glanville, Esq.; Susan married Vice-Admiral William Bedford; Catharine married to Sir Thomas Byam Martin; Cordelia married Captain, later Vice-Admiral, John Chambers White; Mary married Vice-Admiral the Hon. Sir Robert Stopford, and Penelope married Colonel Duckworth, who died at Battle of Albuera on 16 May 1811.  Two other daughters, Anne and Harriet, were recorded as being unmarried at the time that Fanshawe's biography was published."]}, {"page": "Order of battle at the Battle of the Basque Roads", "response": ["| align= left | Admiral Lord GambierCaptain Sir Harry NealeCaptain William Bedford"]}]}}