{"wiki_id": "http://www.wikidata.org/entity/Q16217486", "itemLabel": "Ben Moore", "itemDescription": "curator", "wikipedia_url": "https://en.wikipedia.org/wiki/Ben_Moore_(curator)", "wikipedia_page": {"main": "Ben Moore (born 25 May 1978) is a British art curator, entrepreneur and artist. He is the founder and curator of Art Below, a contemporary art organisation that places art in public spaces and has had shows in England, Germany, Japan and the United States. He is also the founder and curator of Art Wars, an exhibition of designs based on the Imperial Stormtrooper helmets from Star Wars. In 2021, Ben Moore fell to infamy for his alleged theft and unauthorized use of artworks to create NFTs that sold for millions of dollars.   \n\n", "link_mentions": [{"page": "David Bailey", "response": ["In October 2013, Bailey took part in Art Wars at the Saatchi Gallery curated by Ben Moore. The artist was issued with a stormtrooper helmet, which he transformed into a work of art. Proceeds went to the Missing Tom Fund set up by Ben Moore to find his brother Tom who has been missing for over ten years. The work was also shown on the Regents Park platform as part of Art Below Regents Park."]}, {"page": "Jake and Dinos Chapman", "response": ["The Chapman brothers continued the theme of anatomical and pornographic grotesque with Fuck Face, a series of mannequins of children, sometimes fused together, with genitalia in place of facial features. Their sculpture Hell (2000) consisted of a large number of miniature figures of Nazis arranged in nine glass cases laid out in the shape of a swastika. In 2003, with a series of works named Insult to Injury, they altered a set of Goya's etchings by adding funny faces. As a protest against this piece, Aaron Barschak (who later gate-crashed Prince William's 21st birthday party dressed as Osama bin Laden in a frock) threw a pot of red paint over Jake Chapman during a talk he was giving in May 2003. The Chapmans' oeuvre has also referenced work by William Blake, Auguste Rodin and Nicolas Poussin. Jake Chapman has published a number of catalogue essays and pieces of art criticism in his own right, as well as a book, Meatphysics (Creation Books, 2003). The brothers have also designed a label for Becks beer as part of a series of limited edition labels produced by contemporary artists. Using a title from the Tim Burton film, in 2004 they curated A Nightmare Before Christmas as part of the occasional All Tomorrow's Parties music festival at Camber Sands. In October 2013 the Chapman brothers took part in Art Wars at the Saatchi Gallery curated by Ben Moore. The artists were issued with a stormtrooper helmet, which they transformed into a work of art. Proceeds went to the Missing Tom Fund set up by Moore to find his brother Tom who has been missing for over ten years. The work was also shown on the Regents Park platform as part of Art Below Regents Park."]}, {"page": "Yinka Shonibare", "response": ["In October 2013 Shonibare took part in Art Wars at the Saatchi Gallery curated by Ben Moore. The artist was issued with a stormtrooper helmet, which he transformed into a work of art. Proceeds went to the Missing Tom Fund set up by Ben Moore to find his brother Tom, who has been missing for more than ten years. The work was also shown on the Regent's Park platform as part of Art Below Regents Park."]}, {"page": "Harry Pye", "response": ["Pye's artwork has been displayed on the London Underground in conjunction with the arts company Art Below. Ben Moore of Art Below featured Pye's works along with Peter Kennard, Nasser Azam, Moore, and six other artists as part of Thatcheristic.“Thatcheristic: new exhibition showing a different side to the Iron Lady,” London Evening Standard, 12 April 2013."]}, {"page": "D*Face", "response": ["D*Face was the owner and curator for the Outside Institute,  London's first contemporary art gallery to focus on street art.Fransesca Gavin Graffiti legend SEEN at London’s first street-art gallery , BBC collective, 1 April 2005. Retrieved 2011-12-12. In 2005 the Outside Institute moved and re-branded to become the Stolen Space Gallery. In 2010, he collaborated with Christina Aguilera, on her album cover of Bionic. In October 2013 D*Face took part in Art Wars at the Saatchi Gallery curated by Ben Moore. The artist was issued with a stormtrooper helmet, which he transformed into a work of art.  Proceeds went to the Missing Tom Fund set up by Ben Moore to find his brother Tom who has been missing for over ten years. The work was also shown on the Regents Park platform as part of Art Below Regents Park."]}, {"page": "Nasser Azam", "response": ["In April 2011, Azam, with Art Below, carried out a dual public art display in the Tokyo Metro and London Underground commuters saw a scene of Antarctica and one artist – a dot in the huge icy canvas. In July 2008 Azam completed two triptychs in zero gravity, done as a homage to the artist Francis Bacon. In February 2010, accompanied by a camera crew, Azam to draw inspiration from the frozen tundra of Antarctica where he endured extreme weather conditions to produce a series of large abstract oil paintings. For 2 weeks, Azam's work was on the billboard space of 2 platforms 6000 miles apart in Tokyo's Shibuya station and London's Liverpool Street Station with images of his Antarctica series. Azam commented \"I wanted to expose the desolate, silent, spacious and empty environment of the South Pole in probably the most crowded, hectic, busy and noisy space in the world\" Accompanying the poster display on the Liverpool Street station platform, Art Below took over a 3-metre wide digital projection screen, piloting an international video link enabling London's travellers to view the Tokyo platform – the poster display and all the public activity going on around it. Playing on the same video loop was a 2-minute film made in collaboration with Bafta nominated British Film Director Ed Blum. Here we see Nasser Azam creating canvasses at temperatures of minus 40 degrees and buffeted by gales, he paints in different settings: on glaciers, by frozen lakes, in ice caves. Nasser says \"I am confronted by a magnitude of blinding light, by wind and intense cold.\" Some of his canvases were lost in an Antarctic gale.  But most are here for us to see. Such ordeals need preparation.  Azam prepared for this venture in the huge freezer of Billingsgate Butchers Market, devising brushes that would work in such temperatures, and acrylic paint that did not clog. Art Below made the policy decision to persist with this display in Tokyo despite tsunami, earthquake and nuclear fallout. Ben Moore said, \"We did this in the sure conviction that Tokyo's commuters will appreciate such a diversion from their adversities. Now is not the time to withdraw our custom.\" This was the third exhibition they have staged in the Tokyo metro."]}, {"page": "Mr. Brainwash", "response": ["In October 2013, Guetta took part in Art Wars at the Saatchi Gallery curated by Ben Moore. Guetta was issued with a stormtrooper helmet, which he transformed into a work of art.  Proceeds went to the Missing Tom Fund set up by Ben Moore to find his brother Tom who has been missing for over ten years. The work was also shown on the Regents Park platform as part of Art Below Regents Park."]}, {"page": "Ben Moore", "response": ["Ben Moore may refer to:", "* Ben Moore (judge) (1891–1958), U.S. federal judge", "* Ben Moore (composer) (born 1960), U.S. composer", "* Ben Moore (astrophysicist) (born 1966), U.K. astrophysicist and musician", "* Ben Moore (footballer) (born 1977), Australian rules footballer", "* Ben Moore (curator) (born 1978), British art curator, entrepreneur, and artist", "* Ben Moore (snowboarder) (born 1986), U.K. snowboarder", "* Ben Moore (basketball) (born 1995), U.S. basketball player", "* Ben Moore (born 1941), U.S. soul singer who performed under the name Bobby Purify", "* Ben Moore (Chaos Walking), fictional characters"]}, {"page": "List of Old Emanuels", "response": ["* Ben Moore – artist and curator "]}, {"page": "Disappearance of Luke Durbin", "response": ["In March 2019 to mark the 25th anniversary of the Missing People charity, artist Ben Moore curated the Unmissable exhibition at The Other Art Fair located at the Old Truman Brewery in Brick Lane, London. A group of artists commissioned 25 portraits of the missing over the years, with Durbin's portrait painted by artist Ru Knox."]}]}}