{"wiki_id": "http://www.wikidata.org/entity/Q16230496", "itemLabel": "Brent Spencer", "itemDescription": "British Army general", "wikipedia_url": "https://en.wikipedia.org/wiki/Brent_Spencer", "wikipedia_page": {"main": "General Sir Brent Spencer  (c. 1760 – 29 December 1828) was an Anglo-Irish officer in the British Army, seeing active service during the American Revolutionary War and the French Revolutionary Wars. During the Peninsular War he became General Wellesley's second-in-command on two occasions. He fought at Vimeiro and testified in Wellesley's favour at the inquiry following the Convention of Cintra. He led a division at Bussaco and two divisions at Fuentes de Onoro. After the latter action, he had an independent command in northern Portugal. Wellesley, now Lord Wellington, was not satisfied that Spencer was up to the responsibilities of second-in-command and he was replaced by Thomas Graham. Miffed, Spencer left Portugal and never returned. He became a full general in 1825.\nHe was the Member of Parliament (MP) for Sligo Borough from 1815 to 1818.", "link_mentions": [{"page": "Robert Stewart, 1st Marquess of Londonderry", "response": ["#Georgiana (1785–1804), married the politician George Canning, 1st Baron Garvagh, nephew of army general and politician Brent Spencer"]}, {"page": "Battle of Bussaco", "response": ["* the 1st led by Major General (Maj Gen) Brent Spencer"]}, {"page": "Charles Vane, 3rd Marquess of Londonderry", "response": ["#Lady Georgiana Stewart (born 1785), married the politician George Canning II, nephew of army general and politician Brent Spencer."]}, {"page": "West India Regiments", "response": ["*1808–1809: Gen. Sir Brent Spencer"]}, {"page": "Princess Augusta Sophia of the United Kingdom", "response": ["==Relationship with Brent Spencer==", "Largely denied access to personal relationships with men of their own rank, several of the daughters of George III embarked on such romances with gentlemen at court.  Augusta Sophia first met Sir Brent Spencer, a senior Anglo-Irish officer in the British Army, around 1800.  As she wrote to her brother, the future King George IV, then Prince Regent, in 1812, the two had entered into an understanding around 1803, while Spencer was stationed in England. In 1805 he was appointed as an equerry to the king. The couple conducted their romance with the utmost privacy, and Augusta asked the Prince Regent in 1812 to consent to her marrying Spencer, promising further discretion in their behaviour.Dorothy Margaret Stuart, The Daughters of George III (Fonthill Media, 2017), pp 110–120"]}, {"page": "List of Knights Companion of the Order of the Bath", "response": ["|75px||Major-General Brent Spencer||made GCB 2 January 1815"]}, {"page": "Sligo Borough (UK Parliament constituency)", "response": ["| Sir Brent Spencer \t"]}, {"page": "40th (the 2nd Somersetshire) Regiment of Foot", "response": ["*1818–1829: Gen. Sir Brent Spencer, GCB"]}, {"page": "Brent Spencer (soldier)", "response": ["#REDIRECT Brent Spencer"]}, {"page": "Gregory Holman Bromley Way", "response": ["Way was promoted to major in the 29th Foot on 25 February 1808. He served under Sir Brent Spencer off Cadiz, and with him joined Sir Arthur Wellesley's army, landing in Mondego Bay, Portugal, on 3 August. He took part in the Battle of Roliça on 17 August, when, on gaining the plateau with a few men and officers of his regiment, he, when charged by the enemy, was rescued from the bayonet of a French grenadier by the humanity of General Brenier, and made a prisoner. He was exchanged in time to take part in the operations in Portugal when Sir Arthur Wellesley returned in April 1809. He commanded the light infantry of Brigadier-general R. Stewart's brigade, which led the advance of the British Army, and was present in the actions of the passage of the Vouga on 10 May and the heights of Grijon the following day, at the passage of the Douro and capture of Oporto on the 12th, and in the subsequent pursuit of Soult's army."]}, {"page": "William Balfour (lieutenant-colonel)", "response": ["Balfour was a boy-ensign in the 40th Foot at the Anglo-Russian invasion of Holland, and won the approval of Sir John Moore. He served on the staff of Major General Brent Spencer in the Mediterranean and at the capture of Copenhagen, and received a brevet lieutenant colonelcy for service in the field with the 40th in the Peninsula and south of France in 1813–14. After a few years on half-pay, he became lieutenant colonel of his old regiment, commanding it for several years in New South Wales, and he was afterwards in command of the 82nd Foot in Mauritius. He retired from the army in 1832, and died in February 1838."]}, {"page": "Anglo-Portuguese Army", "response": ["| Maj Gen Brent Spencer1st and 3rd Divisions.", "| Maj Gen Brent Spencer"]}, {"page": "Battle of Évora (1808)", "response": ["Meanwhile, trouble broke out in Lisbon at the annual celebration of the Feast of Corpus Christi on 16 June. Junot permitted the festival to take place, but concentrated 15,000 soldiers in the city to prevent a riot. Nevertheless, as the religious procession made its way through the streets, a panic broke out among the people who surged through the lines of soldiers. Just as the artillery was ready to fire on the mob, Junot coolly rode into the crowd and ordered his men to refrain from firing. He managed to clear the streets, calmed the people, and insisted that the procession continue. Though Junot's level-headed action averted a massacre, Lisbon remained rife with wild rumors. On top of this, a British expedition under General Brent Spencer hovered off the coast. Spencer had only 5,000 troops but Junot had no way of knowing this."]}, {"page": "Second siege of Badajoz (1811)", "response": ["On 14 May 1811, the 3rd and 7th Divisions left the northern front and set out for Badajoz under the command of General Thomas Picton. On 16 May, Wellington left General Brent Spencer in charge of the 26,000 infantry and 1,800 cavalry of the northern army. Wellington reached Badajoz on the 19th; Picton's divisions arrived on the 24th. Meanwhile, Soult retreated slowly southeast to Llerena with his large convoys of wounded soldiers, followed by Beresford and Blake. There was one notable clash at the Battle of Usagre on 25 May. Soult asked Latour-Maubourg to drive back the Allied cavalry to ascertain if infantry was present. The French dragoons ran into a trap and lost 250 killed and wounded plus another 78 captured. Lumley's cavalry lost only 20 casualties in the one-sided fight."]}, {"page": "Battle of Sobral", "response": ["Jean-Andoche Junot's VIII Corps was engaged in the fighting on both days. On 13 October, the French drove back the skirmish line of Lowry Cole's 4th Infantry Division. The following day, Junot's troops seized an outpost belonging to Brent Spencer's 1st Infantry Division, but were quickly ejected from the position by a British counterattack. Masséna soon decided that Wellington's defensive lines were too strong to crack and elected to wait for reinforcements."]}, {"page": "Charles FitzRoy (British Army officer)", "response": ["FitzRoy was granted brevet rank as colonel on 26 January 1797, and in 1799 commanded the grenadier company of the 1st Foot Guards during the expedition to Holland. On 5 January 1801 he was made an extra equerry to the King. He was later appointed aide-de-camp to the King, and major-general on 25 September 1803. He served on the staff of the Eastern District, and from 1804 of the Western District. On 25 March 1805 he was made colonel of the 25th Regiment of Foot, on 27 August 1809 appointed regular equerry to the King, and on 25 July 1810 he was promoted lieutenant-general. He had resigned his post as an equerry by 11 October 1811, when he was replaced by Brent Spencer. On 21 September 1816 he married Eliza (née Barlow), widow of Clavering Savage; they had no children. He was promoted to general on 19 July 1821."]}, {"page": "Sir George Walker, 1st Baronet", "response": ["Later in the same month Walker was again sent home from campaign because of medical issues. He served as an Inspecting Field Officer of Recruiting in Manchester between February 1798 and March 1799, during which time on 6 September he was promoted to lieutenant colonel in the 50th Regiment of Foot. He briefly commanded this regiment in Portugal in early 1799, but was posted to the British military mission assisting the Russians in the Anglo-Russian invasion of Holland in October. Soon after the invasion was called off and Walker evacuated with the rest of the army to the Channel Islands. Walker stayed with the Russians until they returned to their homeland in October 1800. He then re-joined the 50th, commanding them as a garrison unit at Malta from August 1801. The regiment moved in May 1802 to serve in Belfast, Ireland, where they assisted in putting down the Irish rebellion of 1803. Walker's next chance to see action did not come until 1807 when the regiment was sent to join a brigade commanded by Brigadier-General Brent Spencer. This brigade formed part of the army that attacked Copenhagen from August to September. The brigade was not broken up after the Copenhagen campaign, and instead sailed in December to attack naval installations at Cadiz and in the Mediterranean Sea. The transports the brigade travelled on were upset by constant bad weather as they travelled south, however, and they only reached Gibraltar in March 1808, by which time the opportunity to attack the installations had gone. Walker himself did not make Gibraltar at the same time as the rest of his regiment, as his ship had been separated from the rest of the convoy and driven all the way to Sicily, and he only learned of his regiment's landing at Gibraltar several weeks after the event, at which point he joined them."]}, {"page": "Battle of Bussaco order of battle", "response": ["    Maj Gen Brent Spencer"]}, {"page": "Battle of Fuentes de Oñoro order of battle", "response": ["Column Commander: Lt Gen Brent Spencer, commanding 1st & 3rd Divisions", "    Lt Gen Brent Spencer"]}, {"page": "Douglas Mercer-Henderson", "response": ["In the Autumn of 1810 he went to Portugal and joined the army of Viscount Wellington following the Battle of Bussaco. After travelling to the Lines of Torres Vedras as ADC to Sir Brent Spencer, he was wounded by a gunshot and returned to Lisbon. The following Spring he was again wounded at the Battle of Barrosa."]}, {"page": "John Scott Lillie", "response": ["Lillie joined the 6th Warwickshire Regiment of Foot in 1807 as an ensign. The following year he embarked under Sir Brent Spencer in first expeditionary force to Portugal for service in Barbary, Cadiz and the Tagus. He joined the Lusitanian Legion of the Portuguese Army in the rank of captain, when still only 19 years old, under the watchful eye of Lieutenant-General William Carr Beresford, who raised the famous élite corps of light infantry, the Caçadores.Teixeira, Humberto. (2010) in Portuguese An Applied Analysis of the Cacadores Infantry Regiment in the Peninsular War annotated with illustrations for the Military Academy, Lisbon  Having taken part in engagements in defence of Portugal, Lillie was promoted lieutenant in 1810. He fought at the Battle of Bussaco and took part in the retreat to the Torres Vedras Lines. In 1812 at the Battle of Salamanca, he was reputed to have personally seized the Colours of the 116th French Line Regiment during the struggle for Arapiles. As commander of the 7th Caçadores, he led his troops into the Battle of the Pyrenees, Battle of Nivelle (1813), Battle of Orthez (1814) and finally, the Battle of Toulouse (1814), where he was gravely wounded (for the third time) and left for dead for 48 hours on the battlefield. He was awarded the Decoration of The Lily by the French. By the British he was awarded the Army Gold Cross, (later) he was honoured with the Military General Service Medal. In Wellington's army his progression was somewhat slow; he left the Peninsula Campaign in the rank of major and in 1816 he was knighted by patent. In the 1831 Coronation Honours, he was made a Companion of the Bath. Also that year, Pedro of Portugal, promoted him to the rank of major general in the Portuguese Army. By the time he took formal retirement from the British Army, in 1855, he had attained the rank of lieutenant colonel with the commensurate pension. He left a record of his experiences in the war.Lillie John Scott A Narrative ... In the Biblioteca Nacional de Portugal, "]}, {"page": "Governor of Cork", "response": ["*1820–1828: Sir Brent Spencer"]}, {"page": "103rd Regiment of Foot (1806)", "response": ["* 25 November 1806 – 25 June 1808: General Sir Brent Spencer, GCB (also Colonel of the Rifle Brigade and 2nd West India Regiment)"]}, {"page": "List of MPs elected in the 1812 United Kingdom general election", "response": ["| George Canning – sat for  Petersfield Replaced by Joshua Spencer 1813 – took officeReplaced by Sir Brent Spencer 1815"]}, {"page": "Barnard Foord Bowes", "response": ["In 1807 Bowes and the 6th Foot were assigned to the garrison of Gibraltar. In the Dos de Mayo Uprising of May 1808, the Spanish people rose in revolt against the French troops occupying their country. Both the ruling Tories and the opposition Whigs saw the Spanish revolt as an opportunity for the United Kingdom to effectively intervene against Emperor Napoleon on the European continent. When the Spanish authorities declined the offer of soldiers, the British government determined to send an expedition to the Kingdom of Portugal which was occupied by French troops. Britain would send 9,000 men under Lieutenant General Arthur Wellesley from Ireland, a force under Major General Brent Spencer from Gibraltar, and two brigades from Harwich and Ramsgate, altogether 18,000 infantry and 390 cavalry."]}, {"page": "Fort of Feiteira", "response": ["The Fort of Feiteira was designated Military Work No. 129 of the 152 separate works carried out on the Lines. At 249 metres above sea level, it was on the first of the three Lines of Torres Vedras, to the southeast of the town of Torres Vedras and northeast of Monte Agraço, where the French were repelled.  It was under the command of the German Baron of Eben and of General Brent Spencer, who was on two occasions Wellington's second-in-command. The fort was situated between two other forts, the Fort of Catefica to the north and the Fort of Archeira to the south. Combined, these three forts were designed to protect the Ribaldeira and Runa valleys. Feiteira had 13 gun emplacements and nine cannon. Like all of the forts it was surrounded by a ditch, or dry moat."]}, {"page": "James Bathurst", "response": ["During the Peninsular War, he accompanied Sir Brent Spencer to the coast of Spain in 1808. In 1808 and 1809, he served in Portugal as assistant quartermaster-general and as aide-to-camp to the Duke of Wellington. He was present in the battles of Roliça , Vimeiro, Corunna, Talavera, and Buçaco, for which battles he had received a gold cross. He was also at the Wellington's passage of the Douro in 1809. "]}, {"page": "Fort of Archeira", "response": ["The Fort of Archeira was designated Military Work No. 128 of the 152 separate works carried out on the Lines. It was on the first of the three Lines of Torres Vedras, to the southeast of the town of Torres Vedras and northeast of Monte Agraço, where the French were repelled.  Designed for a garrison of 500 soldiers, Archeira had six 12-calibre guns. Like all of the forts it was surrounded by a ditch, or dry moat. Built at an altitude of 345 metres and following an irregular polygonal plan, it was the largest fortification of the Serra da Caduceira and was designed for a garrison of 500 soldiers. This stronghold, together with the Feiteira (No. 129) and Fort of Catefica (No. 130), both to the north, defended the vulnerable Runa and Ribaldeira river valleys, under the command of Baron Christian Adolph Friedrich von Eben and General Brent Spencer, who was on two occasions Wellington's second-in-command."]}]}}