{"wiki_id": "http://www.wikidata.org/entity/Q16210194", "itemLabel": "Karishma Kotak", "itemDescription": "British model, actress and television presenter", "wikipedia_url": "https://en.wikipedia.org/wiki/Karishma_Kotak", "wikipedia_page": {"main": "Karishma Kotak is a British Indian model, actress and TV presenter.", "link_mentions": [{"page": "List of Indian film actresses", "response": ["* Karishma Kotak"]}, {"page": "Bigg Boss (Hindi TV series)", "response": ["| rowspan=\"3\" |Karishma Kotak"]}, {"page": "Shankar Dada Zindabad", "response": ["Shankar Dada Zindabad () is a 2007 Indian Telugu-language comedy drama film directed by Prabhu Deva. Starring Chiranjeevi and Karishma Kotak, the film is a remake of the 2006 Hindi film Lage Raho Munnabhai and a sequel to Shankar Dada MBBS (2005). In addition, Dilip Prabhavalkar reprises his role as Mahatma Gandhi, while Srikanth and Sayaji Shinde play other supporting roles. The music is scored by Devi Sri Prasad and filmed by Chota K. Naidu.", "* Karishma Kotak as Jahnavi"]}, {"page": "List of Telugu films of 2007", "response": ["|Shankar Dada Zindabad|| Prabhu Deva || Chiranjeevi, Srikanth, Karishma Kotak || Drama ||"]}, {"page": "List of Telugu films of 2008", "response": ["|Dhyeyam || Jayasimha Reddy || Sai Kiran, Karishma Kotak, Venu Madhav || Action"]}, {"page": "Kotak (surname)", "response": ["* Karishma Kotak (born 1982), Indian model and actor"]}, {"page": "Savitha Reddy", "response": ["|Karishma Kotak"]}, {"page": "List of Telugu films of 2010", "response": ["| Glamour || P. Satya Reddy || Karishma Kotak, Kavitha || Drama || Produced by Surya Powerful Movies ||"]}, {"page": "Tips Industries", "response": ["| Kaptaan || Mandeep Kumar || Gippy Grewal, Monica Gill, Karishma Kotak"]}, {"page": "Kingfisher Calendar", "response": ["| Deepika Padukone, Shruti Agrawal, Karishma Kotak, Neelam Chauhan, Shilpa Reddy and Mashoom Singha"]}, {"page": "Bigg Boss (Hindi season 6)", "response": ["* Karishma Kotak – Model. Karishma is a model born from London."]}, {"page": "Karishma", "response": ["* Karishma Kotak, British-Indian actress "]}, {"page": "List of people on the cover of FHM (India)", "response": ["| April || Karishma Kotak || "]}, {"page": "Mr Joe B. Carvalho", "response": ["Mr Joe B. Carvalho is a Bollywood comedy film which released on 3 January 2014. The film is directed by Samir Tewari, and produced by Shital Malviya and Bhola Ram Malviya (Arshad Warsi's long standing secretary). The film stars Arshad Warsi, Soha Ali Khan, Javed Jaffrey and Vijay Raaz. The first teaser of the film was released on 17 November 2013. The film also has guest appearances by Geeta Basra, Mahika Sharma and Karishma Kotak. Singer Babul Supriyo debuts in the film by playing a cameo.", "* Karishma Kotak as Neena"]}, {"page": "List of Bollywood films of 2015", "response": ["| Luckhnowi Ishq || Aanand Raut ||Adhyayan Suman, Karishma Kotak|| Romance ||"]}, {"page": "List of Bollywood films of 2016", "response": ["| Kaptaan || Mandeep Kumar || Gippy Grewal, Karishma Kotak, Rishaan Dutta || Comedy || ||"]}, {"page": "Luckhnowi Ishq", "response": ["Luckhnowi Ishq () is a 2015 Indian romantic film directed by Aanand Raut. It stars Adhyayan Suman and Karishma Kotak in lead roles. The film is produced by KC Films. It tells the love story of a young medical student from Delhi and a beautiful girl from Lucknow.", "Prem (Adhyayan Suman) a medical student of Lucknow attends his friend's wedding and falls in love with Sunaina (Karishma Kotak). It is love at first sight and Prem wants to marry Sunaina; he even fights her brother Krishna who shares a close bond with his sister. Prem swears to marry Sunaina in the next 10 days and manages to keep his word.", "* Karishma Kotak as Sunaina"]}, {"page": "Love Affair (unreleased film)", "response": ["*Karishma Kotak as Mamie Ahuja"]}, {"page": "Kaptaan", "response": ["Kaptaan () is a 2016 Indian Punjabi-language action/courtroom drama film directed by Mandeep Kumar and  starring Gippy Grewal, Monica Gill, Karishma Kotak. The release date of the film is 20 May 2016.", "* Karishma Kotak as Sam"]}, {"page": "Extraaa Innings T20", "response": ["Hosts usually take the role of introducing the expert panel, asking them questions and interviewing the players while on field. Extraaa Innings T20 was amongst the first sports show in India that included a predominant number of female anchors in a largely male dominated sport. Ever since, there has been an increase in the number of female commentators and hosts in India's franchise-based sporting events like the football and kabaddi. Archana Vijaya, an MTV VJ, has hosted the show in several seasons with her experience as an anchor in similar shows such as Tour Diary for extra cover and Cricket Masala mar ke. She was the only female anchor in the last edition of Extraaa Innings T20 as the other female hosts had prior commitments. Singer and model Shibani Dandekar has anchored the show in several seasons. Mandira Bedi, a prominent face in the television industry who was a host in ICC World Cups 2003 and 2007, had been a host in the 2009 season. Other female hosts who have featured on the show include Rochelle Maria Rao, Pallavi Sharda, Karishma Kotak, Shonali Nagrani, Mayanti Langer and Lekha Washington, with some of them having experience as hosts in various cricket talk shows."]}, {"page": "Freaky Ali", "response": ["* Karishma Kotak as Aditi"]}]}}