{"wiki_id": "http://www.wikidata.org/entity/Q16240362", "itemLabel": "Lauren MacColl", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Lauren_MacColl", "wikipedia_page": {"main": "Lauren MacColl is a Scottish fiddle player from Fortrose. She has released three solo albums as well as a duet album with flute player Calum Stewart. MacColl is a member of the fiddle quartet RANT and contemporary folk band Salt House.\n\n", "link_mentions": [{"page": "Lauren", "response": ["* Lauren MacColl, fiddle player"]}, {"page": "List of Scottish musicians", "response": ["*Lauren MacColl, fiddler"]}, {"page": "Scots Trad Music Awards", "response": ["* Instrumentalist of the Year: Lauren MacColl"]}, {"page": "Rant (disambiguation)", "response": ["* RANT, Scottish chamber-folk quartet whose members have included Jenna Reid, Lauren MacColl and Gillian Frame"]}, {"page": "Chris Stout", "response": ["* Lauren MacColl – When Leaves Fall (2007)When Leaves Fall (Lauren MacColl) Retrieved 24 May 2016"]}, {"page": "Calum Stewart", "response": ["*Wooden Flute and Fiddle (Calum Stewart and Lauren MacColl) 2012 Make Believe Records "]}, {"page": "Rachel Newton", "response": ["Newton's second solo release was the 2014 album Changeling, which was commissioned by the Celtic Connections festival as part of its New Voices series, and premiered in January 2014 at the festival.  The album was written by Newton and on the recording she performs vocals and plays harp and viola. It also features Corrina Hewat on vocals and harp, Lauren MacColl on fiddle, Adam Holmes on vocals, Mattie Foulds on percussion, Su-a Lee on cello and musical saw and Alec Frank-Gemmill on horn. The theme was inspired by Scottish folk takes of human children being taken by fairies and replaced by supernatural creatures and the use of this to explain children with behavioural problems and disabilities. In the album Newton wanted to look at the darker side of traditional folk tales and use them to explore feelings about life and death that are hard to express outside of music. Robin Denselow writing in The Guardian gave it 3 stars out of 5 while praising the \"haunting vocal work and elegant harp playing\" and the Financial Times gave it 4 stars out of 5. Other reviews called it \"quietly compelling\" and \"emotionally stirring\".", "Newton's third solo release was Here's My Heart Come Take It in 2016, which was shortlisted for the Scottish Album of the Year Award in 2017. The album was mostly traditional songs in new arrangements, including songs from the Max Hunter songbook and original music for Sir Walter Scott's An Hour With Thee. The album featured Lauren MacColl on fiddle and Mattie Foulds on drums. The album was well reviewed, receiving four stars out of five from both the Guardian and the Financial Times."]}]}}