{"wiki_id": "http://www.wikidata.org/entity/Q16209780", "itemLabel": "Helen Mort", "itemDescription": "British poet", "wikipedia_url": "https://en.wikipedia.org/wiki/Helen_Mort", "wikipedia_page": {"main": "Helen Mort  (born 28 September 1985, Sheffield) is a British poet and novelist. She is a five-time winner of the Foyle Young Poets award, received an Eric Gregory Award from The Society of Authors in 2007, and won the Manchester Poetry Prize Young Writer Prize in 2008. In 2010, she became the youngest ever poet-in-residence at the Wordsworth Trust, Grasmere. In the same year she was shortlisted for the Picador Prize and won the Norwich Café Writers' Poetry Competition with a poem called \"Deer\". She was the Derbyshire Poet Laureate from 2013 to 2015. In 2014, she won the Fenton Aldeburgh First Collection Prize for \"Division Street\".\nShe is an alumna of Christ's College, Cambridge, from which she graduated with a degree in Social and Political Sciences in 2007. In 2014, she completed her Doctorate at Sheffield University with a Ph.D thesis in English/Neuroscience and her BlogSpot \"Poetry on the Brain\" was one of the  Picador \"Best Poetry Blogs\" choices.\nHer collection Division Street is published by Chatto & Windus and was shortlisted for the Costa Book Awards and the T.S. Eliot Prize. In a national survey, it was chosen by sixth-form groups and reading groups as their first choice collection. She has published two pamphlets with Tall Lighthouse press.\nIn 2014 she was named as a Next Generation poet by the Poetry Book Society. Mort is currently the Douglas Caster Creative Writing Fellow in the School of English at the University of Leeds. She edited the Verse Matters anthology with Rachel Bower who is also a Fellow at the University of Leeds. She has appeared on radio programmes such as The Verb, Poetry Please, and Woman's Hour. Individual poems have been published in the New Statesman, \"Ex-Industrial (a trailer)\", and the Sunday Times, \"Admit you feel like all the ice skates in Brazil\", as well as the magazines Poetry Review, Granta, The Rialto, Poetry London, The Manhattan Review, and The North.\nIn June 2018 Mort was elected Fellow of the Royal Society of Literature in its \"40 Under 40\" initiative.", "link_mentions": [{"page": "Christ's College, Cambridge", "response": ["|Helen Mort"]}, {"page": "Simon Armitage", "response": ["After a delay caused by the COVID-19 pandemic, the first tour took place in 2021. Armitage read in various library buildings for a remote, online, live audience, beginning at Ashby-de-la-Zouch on 26 April and continuing to Belper with Helen Mort; Aberdeen with Mag Dixon; Bacup with Clare Shaw; Bootle with Amina Atiq and Eira Murphy; the British Library with Theresa Lola and Joelle Taylor; and Abington, where he officially opened the volunteer-run library on Saturday 1 May."]}, {"page": "Royal Society of Literature", "response": ["| Helen Mort"]}, {"page": "T. S. Eliot Prize", "response": ["*2017 — W. N. Herbert, James Lasdun and Helen Mort", "*Division Street by Helen Mort"]}, {"page": "International Booker Prize", "response": ["The 2017 prize was judged by Nick Barley (Chair), Daniel Hahn, Helen Mort, Elif Shafak and Chika Unigwe. The longlist for the eighth Man Booker International Prize was announced on 14 March 2017, and the shortlist on 20 April 2017. The winner was announced on 14 June 2017. Grossman became the first Israeli author to win the prize, sharing the £50,000 award with Cohen. Nick Barley, who is the director of the Edinburgh International Book Festival, described the book as \"an ambitious high-wire act of a novel [that] shines a spotlight on the effects of grief, without any hint of sentimentality. The central character is challenging and flawed, but completely compelling.\" The novel won over 126 other contenders."]}, {"page": "Off the Shelf Festival", "response": ["*Helen Mort"]}, {"page": "Eric Gregory Award", "response": ["*2007: Rachel Curzon, Miriam Gamble, Michael McKimm, Helen Mort, Jack Underwood"]}, {"page": "1985 in poetry", "response": ["* September 28 – Helen Mort, English poet"]}, {"page": "Dylan Thomas Prize", "response": ["* Helen Mort, Black Car Burning (Chatto & Windus)"]}, {"page": "Mort (name)", "response": ["* Helen Mort (born 1985), British poet"]}, {"page": "2007 in poetry", "response": ["* Eric Gregory Award :  Rachel Curzon, Miriam Gamble, Michael McKimm, Helen Mort, Jack Underwood"]}, {"page": "Manchester Poetry Prize", "response": ["The joint winners, Lesley Saunders and Mandy Coe, impressed the judges with their contrasting but brilliant styles and shared the £10,000 Prize. Helen Mort, 23, from Sheffield, won the Manchester Young Writer of the Year Award. The runners up were Mike Barlow, Allison McVety and Rosie Shepperd."]}, {"page": "Tower Poetry", "response": ["| Caroline Bird, Joanna Moorman, Helen Mort", "| Ian McMillan and Helen Mort"]}, {"page": "Tall Lighthouse", "response": ["Poets published by Tall Lighthouse include Sarah Howe, Helen Mort, Rhian Edwards, Aoife Mannix, Baden Prince, Pierre Ringwald, Heather Taylor, Alan Buckley, Ben Parker and Jodie Hollander.http://www.tall-lighthouse.co.uk/ A number of young poets (under 30) are also published as part of the press's Pilot series."]}, {"page": "Huddersfield Literature Festival", "response": ["Bernardine Evaristo, Helen Mort, Lemn Sissay"]}, {"page": "Michael Marks Awards for Poetry Pamphlets", "response": ["*Helen Mort", "*Helen Mort"]}, {"page": "2013 in poetry", "response": ["* Helen Mort, Division Street, Chatto & Windus, London, England."]}, {"page": "2013 Costa Book Awards", "response": ["*Helen Mort, Division Street"]}, {"page": "Next Generation poets (2014)", "response": ["*Helen Mort"]}, {"page": "Sixty-Six Books", "response": ["| 1 Peter || Snow in Sheffield || Helen Mort ||"]}]}}