{"wiki_id": "http://www.wikidata.org/entity/Q16333835", "itemLabel": "Hugh Lunghi", "itemDescription": "British military interpreter", "wikipedia_url": "https://en.wikipedia.org/wiki/Hugh_Lunghi", "wikipedia_page": {"main": "Hugh Albert Lunghi (3 August 1920 – 14 March 2014) was a British military interpreter and veteran of World War II. He served as an interpreter for Prime Minister Winston Churchill during the war, often accompanying Churchill to summits with other world leaders. Lunghi was one of the last living participants of the \"Big Three\" meetings between Allied leaders at Tehran, Yalta and Potsdam.Lunghi was the first British soldier to enter Hitler's bunker in Berlin in 1945. Soviet troops, who were guarding the bunker, had granted Lunghi permission to enter. He kept one volume of Hitler's Brockhaus Enzyklopädie from the bunker as a memento.", "link_mentions": [{"page": "Louis Mountbatten, 1st Earl Mountbatten of Burma", "response": ["British interpreter Hugh Lunghi recounted an embarrassing episode during the Potsdam Conference when Mountbatten, desiring to receive an invitation to visit the Soviet Union, repeatedly attempted to impress Joseph Stalin with his former connections to the Russian imperial family. The attempt fell predictably flat, with Stalin dryly inquiring whether \"it was some time ago that he had been there\". Says Lunghi, \"The meeting was embarrassing because Stalin was so unimpressed. He offered no invitation. Mountbatten left with his tail between his legs.\"."]}, {"page": "1920 in the United Kingdom", "response": ["** Hugh Lunghi, military interpreter (died 2014) "]}, {"page": "List of Old Abingdonians", "response": ["* Hugh Lunghi (1920-2014), British military interpreter and Foreign Office"]}, {"page": "2014 in the United Kingdom", "response": ["**Hugh Lunghi, 93, military interpreter (Winston Churchill)."]}, {"page": "Deaths in March 2014", "response": ["*Hugh Lunghi, 93, British military interpreter (Winston Churchill), one of the last living Big Three participants, first British soldier to enter Hitler's bunker.Soldier Hugh Lunghi, who was the first to step into Hitler's bunker dies at 93 "]}]}}