{"wiki_id": "http://www.wikidata.org/entity/Q1634221", "itemLabel": "H. Hugh Bancroft", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/H._Hugh_Bancroft", "wikipedia_page": {"main": "Henry Hugh Bancroft (29 February 1904 – 11 September 1988) was a British organist, choirmaster, and composer who was organist of five cathedrals. He was born in Cleethorpes, Lincolnshire, and studied music with E. P. Guthrie and J. S. Robinson in nearby Grimsby.He attained the FRCO diploma in 1925. He was then organist of Old Clee parish church, and was supplementing his modest income by playing in the local theatre and by working as a compass adjuster. Seeking better prospects, he left for Canada in 1929 to become organist of St. Matthew's Anglican Church in Winnipeg, Manitoba.  In 1936 while at St. Matthew's, he earned an external BMus from Durham University. After nine years, he left for the Church of the Ascension in Hamilton, Ontario, but stayed there only nine months.In 1937, he was back in Winnipeg, at the downtown parish of All Saints, where he developed a men and boys choir of national renown, and initiated choral evensongs on the model of the Church of England cathedrals. Also in Winnipeg, he met and married his wife Eldred Curle.\nFrom 1946 to 1948 he was organist of Christ Church Cathedral in Vancouver, British Columbia, director of the Vancouver Bach Choir, and an instructor at the British Columbia Institute of Music and Drama. He left Vancouver to become master of music at St. Andrew's Cathedral in Sydney, Australia, but in 1953 returned to All Saints in Winnipeg.\nOn a visit to Cambridge University on his way back from Australia, he experienced the annual Advent Carol service of King's College, and the next year introduced the tradition to Canada at All Saints' Church.\nHe was briefly at Christ Church Cathedral in Nassau, Bahamas, before moving to All Saints' Cathedral in Edmonton, Alberta, in 1958, where he remained until his retirement in 1980. From 1968 to 1977 he also taught for the Department of Music of the University of Alberta in Edmonton.\nBancroft was also known as a teacher, and instructed many students who went on to have careers as composers and organists, including Hugh McLean (organist), Barry Anderson, Barbara Pentland, Douglas Bodle,  Elwyn Davies and Herbert Sadler.An active composer and arranger, Bancroft was an Associate Composer of the Canadian Music Centre and published numerous pieces, including anthems, motets, chorale and organ works. Several works were premiered by major symphony orchestras.", "link_mentions": {}}}