{"wiki_id": "http://www.wikidata.org/entity/Q1638173", "itemLabel": "Hunterz", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Hunterz", "wikipedia_page": {"main": "Hunterz is a British Asian urban musician with Indian pop and Bhangra influences but based in England. His grandmother moved from Kenya to the U.K. after her husband died. She had to sing to feed her six children. With an early training in Indian classical music from the Patiala Gharana, HunterZ has spent a life devoted to music. But born and brought up in the U.K., he joined private music schools to learn the guitar and keyboard. Hunterz raps and sings in English, Hindi and Punjabi in his albums.\nAfter co-producing  Slave II Fusion, he made his solo producing debut in 1999 with No Limits. However, he had no part in the singing.\nHis vocal debut came in 2003 with the bhangra album Most Wanted.\nThe second album to bear his name was Phat Trax Vol. 1: Blazin, completed in 2004, which had a more urban flavour in comparison to Most Wanted's international style. Most songs contrasted Hunterz' Hindi lyrics with rapping in English. The album also featured Hunterz' brothers Ishers and Vee and his cousin Chan. In December 2004, Hunterz also featured on Streets of Bollywood, an album of remixes of Bollywood songs, with his 'Baby Girl Mix' of \"Aap Ka Aana\" from the 2000 film Kurukshetra.\nIn 2005 Hunterz co-wrote and sang a single, \"Reasons\", with the dub/reggae band UB40. Along with UB40 and The Dhol Blasters he performed this song at the Live 8 London concert in Hyde Park. He also produced four further remixes of Bollywood songs for the album Bollywood Breaks Vol. 1: \"Haare Haare\", \"Tu Cheez\", \"Dulhe Ka Sehra\" and \"Pehli Baar\".\nOn 16 June 2008, the album Masterpiece was released featuring Vee.\nHunterz attended Kingsbrook Middle School in Bedford between 1984 and 1988, and then John Bunyan Upper School from 1988 to 1991. Rabz, Headz and Lee Daley were amongst his early musical associates. Mrs Parron, a teacher of Hunterz when he was 13 years old, saw his great musical potential even then referred to him as Hunterz. Among his numerous successes were the school record for 100 metres and high jump. Hunterz was affectionately known as 'Alveen' by the staff of Kingsbrook Middle School.\nInspired by the advice to \"Give it some welly!\" by sports mentor Nigel 'Baldy Aldy' Aldis, Hunterz never stopped searching for his deeper spiritual connection with nature and the living world. Along with business associates Barry Lodge and Richard West, Hunterz and brother Ishaaz (then known by his stage name 'Ishpal') developed a model of retailing merchandise procured via unconventional market mechanisms. This was a successful business operation until Alan 'Mr Ormsby' Ormsby decreed selling bags of prawn cocktail crisps in the playground to be against school rules. Despite support from Mrs Parron and Zeena Horseman, Hunterz was forced to exit the commodity retail business and focus his considerable talents in other areas.\nHunterz performed at the University of Sheffield on 8 February 2010, along with Imran Khan, Veronica and Dr Zeus. In the promotion for this performance, he gave an interview on BBC Radio Sheffield, where he officially announced that his new upcoming album in 2010 will be in collaboration with Rishi Rich.", "link_mentions": [{"page": "List of one-word stage names", "response": ["* Hunterz, Pakistani-born English musician"]}, {"page": "UB40", "response": ["All three of their UK number one hits and four of their five US top ten hits were cover versions. UB40 collaborators include: Pato Banton, Madness, Bitty McLean, Chrissie Hynde, Maxi Priest, Robert Palmer, Hunterz, Japanese artist Mikidozan, French artist Nuttea, Lady Saw, Afrika Bambaataa, 808 State. With 214 weeks spent on the UK singles charts over the course of the 1980s, UB40 and Madness hold the record for most weeks spent by a group in the 1980s UK singles charts."]}, {"page": "Live 8 concert, London", "response": ["* UB40 – \"Food For Thought\", \"Who You Fighting For?\", \"Reasons\" (with Hunterz & The Dhol Blasters), \"Red Red Wine\", \"Can't Help Falling in Love\" (HP 18:43)"]}, {"page": "Who You Fighting For?", "response": ["#\"Reasons\" (Hunterz) – 3:53 ", "\"Reasons\" is the 9th track in the album. The song reached number 75 on the UK singles chart. Hunterz and The Dhol Blasters also feature in the song. The song is distinguished by its chorus with Punjabi words, which is woven into a song with a reggae rhythm. The Punjabi lyrics are:"]}, {"page": "Streets of Bollywood", "response": ["Streets of Bollywood is a compilation album of songs from Bollywood movies, remixed by British Asian music artists. Among the artists are Hunterz, Metz & Trix, and Kami K (who produced the most tracks, at 3, plus two re-remixes at the end of the album). Several of the artists would also feature on the later similarly themed Bollywood Breaks Vol. 1.", "# Aap Ka Aana (Kurukshetra) - Baby Girl Remix of baby got back (Hunterz)"]}, {"page": "List of Live 8 artists", "response": ["* Hunterz & The Dhol Blasters"]}, {"page": "DJ Vix", "response": ["DJ Vix has worked with artists like Miss Pooja, RnB superstar Jay Sean, Sukbir, Taz Stereo Nation, B21, XLNC, Debi Muksuspuri, H-Dhami and Ajay the ‘Brit Asia Superstar’ winner of 2010. In 2014, DJ Vix worked in collaboration with Malkit Singh MBE, and produced the track 'Desi Beat'. In 2014, he released 'Marda' feat Hunterz, along with the new album My Turn from Manjit Pappu. His fifth solo album, Chapter V was  released on 26 February 2015. ", "# MARDA - Hunterz", "| Singer: Hunterz"]}, {"page": "Mumzy Stranger", "response": ["Ahmed's debut single \"One More Dance\" was produced by Rishi Rich and was released in July 2009. The single was set to be titled \"One More Chance\" but was later changed to \"One More Dance\", according to Rishi Rich. His second single, \"Showgirl\", was released in August 2009. Mumzy is heard on two tracks on The Streets of Bollywood 3, a remix album by Rishi Rich, Hunterz and Kami K, mainly focusing on bringing Indian and urban music together."]}, {"page": "UB40 discography", "response": ["|align=\"left\"|\"Reasons\" (with Hunterz and The Dhol Blasters)"]}, {"page": "Love Mein Ghum", "response": ["| 3|| \"Ilah Ilah\" || Sunidhi Chauhan, Hunterz"]}, {"page": "List of songs recorded by Sunidhi Chauhan", "response": ["| 2007 || Mohabbataan Sachiyaan || 3 || \"Galiyan Galiyan Husan Diyaan\"|| rowspan=\"2\"| Hunterz"]}, {"page": "List of songs recorded by Mumzy Stranger", "response": ["Mumzy Stranger made his debut after being signed by Rishi Rich,  with his track \"One More Dance\", which was released in 2009. Later that year, he was featured in two tracks on The Streets of Bollywood 3, a remix album by Rishi Rich, Hunterz and Kami K, mainly focusing on bringing Indian and urban music together. The following year, he is released his debut mixtape No Stranger To This and his debut album Journey Begins. He is also heard on the soundtrack of Toonpur Ka Super Hero, making his debut on a Bollywood film soundtrack. On 18 November 2010, he supported Sean Kingston at The O2 Arena. Although making his singing debut with the 2009 single \"One More Dance\", he wrote his first song \"Jump Up\", from his 2008 mixtape Mumzy Mixtape, in 2005. He made his Sylheti singing debut with the song \"Mone Kori (Thinking About You)\" on his 2008 mixtape, Mumzy Mixtape and his Bengali debut in Jaan Atki Bangla Refix.He has also sung in Arabic in the multi-lingual single \"Come My Way\". Mumzy was also the founder of the multi-genre and multilingual South Asian collective, Stranger Family with Sayfuz (Char Avell), Junai Kaden (Jay Kadn), Natasha Tah (Tasha Tah), Ramee (Rameet Kaur Sandhu) and Javier Miraj (Salique). After launching his record label Timeless London, he formed the group 'Timeless Camp' with Nish, Lyan and Rupika."]}, {"page": "Ali Zafar discography", "response": ["|Hunterz ft. Zafar and Hadiqa Kiani"]}, {"page": "Index of Sri Lanka–related articles (H)", "response": ["# Hunterz"]}, {"page": "For the Many", "response": ["* Hunterz – vocal on \"All We Do Is Cry\""]}, {"page": "Middlesbrough Mela", "response": ["Notable past performers have included: Hunterz, Raxstar, Rameet Kaur, Lehmber Hussainpuri."]}]}}