{"wiki_id": "http://www.wikidata.org/entity/Q1632204", "itemLabel": "Spike Hughes", "itemDescription": "Composer, Author, Music Critic", "wikipedia_url": "https://en.wikipedia.org/wiki/Spike_Hughes", "wikipedia_page": {"main": "Patrick Cairns \"Spike\" Hughes (19 October 1908 – 2 February 1987) was a British musician, composer and arranger involved in the worlds of classical music and jazz. He has been called Britain's earliest jazz composer. Later in his career, he became better known as a broadcaster and humorous author.", "link_mentions": [{"page": "Gioachino Rossini", "response": ["Such pressures led to a further significant element of Rossini's compositional procedures, not included in Budden's \"Code\", namely, recycling. The composer often transferred a successful overture to subsequent operas: thus the overture to La pietra del paragone was later used for the opera seria Tancredi (1813), and (in the other direction) the overture to Aureliano in Palmira (1813) ended as (and is today known as) the overture to the comedy Il barbiere di Siviglia (The Barber of Seville). He also liberally re-employed arias and other sequences in later works. Spike Hughes notes that of the twenty-six numbers of Eduardo e Cristina, produced in Venice in 1817, nineteen were lifted from previous works. \"The audience ... were remarkably good-humoured  ... and asked slyly why the libretto had been changed since the last performance\". Rossini expressed his disgust when the publisher Giovanni Ricordi issued a complete edition of his works in the 1850s: \"The same pieces will be found several times, for I thought I had the right to remove from my fiascos those pieces which seemed best, to rescue them from shipwreck ... A fiasco seemed to be good and dead, and now look they've resuscitated them all!\""]}, {"page": "Die Entführung aus dem Serail", "response": ["Die Entführung aus dem Serail is in the genre of \"Singspiel\", thus the music lacks recitatives and consists entirely of set numbers. As Spike Hughes notes, the action is mostly carried forward by the spoken dialogue, so the libretto gave Mozart little opportunity to display an achievement for which his later operas are celebrated, namely the construction of scenes in which the plot is both reflected in and driven forward by the music."]}, {"page": "1987 in music", "response": ["**Spike Hughes, jazz double bass player, composer and journalist, 78"]}, {"page": "List of jazz bassists", "response": ["*Spike Hughes (1908–1987)"]}, {"page": "Benny Carter", "response": ["In 1933, Carter participated in sessions with British composer/musician Spike Hughes, who visited New York City to organize recordings with prominent African American musicians. These 14 sides plus four by Carter's big band, titled at the time Spike Hughes and His Negro Orchestra, were initially only issued in England. The musicians were from Carter's band and included Red Allen, Dicky Wells, Wayman Carver, Coleman Hawkins, J. C. Higginbotham, and Chu Berry."]}, {"page": "Michael Green (humorist)", "response": ["The Art of Coarse Rugby, which became a best-seller in 1960, and The Art of Coarse Acting were both products of his Midlands days, when he was involved with amateur rugby and dramatics. Green was commissioned to write The Art of Coarse Rugby by Hutchinson, to go with a republication of The Art of Coarse Cricket by Spike Hughes, who had intended the title as a play on Coarse Fishing. Green describes a coarse actor as \"one who can remember his lines, but not the order in which they come. One who performs ... amid lethal props...\" and goes on: \"The Coarse Actor's aim is to upstage the rest of the cast. His hope is to be dead by Act Two so that he can spend the rest of his time in the bar. His problems? Everyone else connected with the production.\" In similar vein, the coarse rugby player is described as differentiated from the rugger player in that he does not enjoy playing, but instead plays for any one of a number of other reasons, such as to get away from his wife, or because he dare not admit he is too old. Other books in the series followed, and The Art of Coarse Moving subsequently became the 1977 BBC TV series A Roof over My Head with Brian Rix."]}, {"page": "Egon Wellesz", "response": ["Despite his composing, Wellesz remains best known as an academic and teacher, and for his extensive scholarly contributions to the study of Byzantine music and opera in the 17th century. These contributions brought for him an honorary doctorate from Oxford University in 1932 and later a Fellowship at Lincoln College, Oxford, where he remained until his death.'Lincoln College: Egon Wellesz and other Emigrées in 1930s Britain, Oxford Facility of Music His pupils there included Herbert Chappell, Martin Cooper, Kunihiko Hashimoto, Spike Hughes, Frederick May, Wilfrid Mellers, Nigel Osborne and Peter Sculthorpe."]}, {"page": "Sidonie Goossens", "response": ["She married her first husband, the conductor, violinist and composer Hyam Greenbaum, in 1924. In the late 1920s and early 1930s their London home (5 Wetherby Gardens, SW5) became a regular meeting place for musicians, including Arnold Bax, Constant Lambert, Patrick Hadley, Spike Hughes, Alan Rawsthorne and William Walton. He died of alcohol-related problems, one day after his 41st birthday, following the death of their only son at birth.Sidonie Goossens obituary, The Independent, 16 December, 2004 With her second husband, Norman Millar, she moved to Reigate in Surrey, where they raised pigs and poultry at the 400-year-old Woodstock Farm, Gadbrook Road, Betchworth.Mole Valley District Council. Historic Justification Statement, Woodstock Farm She was a close personal friend of Sir Adrian Boult and Pierre Boulez,Robert Ponsonby: Musical Heroes, A Personal View of Music and the Musical World over Sixty Years (London: Giles de la Mare Publishers Ltd, 2009) 93-96,  who wrote of her: 'Always her presence was reassuring, her professional conscience irreproachable, her attitude faultless. She loved her metier, her instrument. All this, really, was the reflection of her personality for which I have had from the first instant, not only the greatest admiration, but also an immense affection.'"]}, {"page": "The Perse School", "response": ["*Spike Hughes, jazz musician and journalist"]}, {"page": "BBC Concert Orchestra", "response": ["The parent ensemble of the orchestra was the BBC Theatre Orchestra, which was formed in 1931 and based in Bedford. The orchestra also did opera work and was occasionally billed as the BBC Opera Orchestra. Stanford Robinson was the principal conductor from 1931 until 1946, but others included Walter Goehr, Spike Hughes, Harold Lowe and Mark Lubbock. In August 1949, the ensemble was formally renamed the BBC Opera Orchestra. In January 1952, the BBC Opera Orchestra was disbanded and the BBC Concert Orchestra was formed from its players."]}, {"page": "Wendy Wood (artist)", "response": ["Wood was the aunt of both the physicist J. B. Gunn and the musician Spike Hughes, and granddaughter of Samuel Peploe Wood. She was also the sister-in-law of the Egyptologist Battiscombe Gunn and the musician Herbert Hughes."]}, {"page": "Chu Berry", "response": ["Throughout his brief career, Berry was in demand as a sideman for recording sessions under the names of various other jazz artists, including Spike Hughes (1933), Bessie Smith (1933), The Chocolate Dandies (1933), Mildred Bailey (1935–1938), Teddy Wilson (1935–1938), Billie Holiday (1938–1939), Wingy Manone (1938–1939) and Lionel Hampton (1939)."]}, {"page": "British jazz", "response": ["By the early 1930s, music journalism in Britain, notably through the Melody Maker, had created an appreciation of the importance of the leading American jazz soloists and was beginning to recognise the improvising talents of some local musicians. During the 1930s most British jazz musicians made their living in dance bands of various kinds. Jazz became more important, and more separate as its own genre. Louis Armstrong played residencies in London and Glasgow in 1932, followed in subsequent years by the Duke Ellington Orchestra and Coleman Hawkins. But local jazz culture was limited to London where: \"jazz was played after hours in a couple of restaurants that encouraged musicians to come in and jam for drinks\"., p. 250. The groups of Nat Gonella and Spike Hughes gained a profile within Britain early in the decade; Hughes was even invited to New York to arrange, compose and lead what, in effect, was Benny Carter's Orchestra of the time. Carter himself worked in London for the BBC in 1936. West Indian swing band leader Ken \"Snakehips\" Johnson and Leslie Thompson, a Jamaican trumpeter, influenced jazz in Britain, with the band fronted by Johnson – \"The Emperors of Jazz\" – being the first large Black band of note.Valerie Wilmer, \"Essay: 'Blackamoors' and the British Beat\" , Black Musicians Conference / 1986 Standing on the Shoulders of Giants, University of Massachusetts Amherst. Johnson went on to form one of the top swing bands in the country, known as \"The West Indian Orchestra\", which became the resident band at fashionable London venue Café de Paris, and it was here that Johnson was among those killed by a German bomb during the Blitz in the early days of the war.\"Ken 'Snakehips' Johnson\"  at www.swingtime.co.uk."]}, {"page": "Val Rosing", "response": ["Rosing was the son of Russian tenor Vladimir Rosing and English singer Marie Falle. Rosing sang on the original BBC recording of \"Teddy Bears' Picnic\" as well as \"In a Little Gypsy Tea Room\". He also sang on the Ray Noble Orchestra's version of \"Try a Little Tenderness\", the first recording of this well-covered song. Rosing recorded more than one hundred sides with various English bands, including Spike Hughes and His Decca-Dents, the Jack Payne Orchestra, Jack Hylton's Orchestra and Rosing's own Radio Rhythm Rascals."]}, {"page": "Dicky Wells", "response": ["He played with Count Basie between 1938–1945 and 1947–1950. He also played with Cecil Scott, Spike Hughes, Fletcher Henderson, Benny Carter, Teddy Hill, Jimmy Rushing, Buck Clayton and Ray Charles.  In the middle years of the 1960s, Wells toured and performed extensively, and the onset of alcoholism caused him  personal problems which led to his semi-retirement.  Publication of his autobiography in 1973 helped to steer Wells back to his profession.", "* Spike Hughes, Spike Hughes and His All American Orchestra (London 1933 1956)"]}, {"page": "Battiscombe Gunn", "response": ["In 1915, in the midst of World War I, Meena was in Florence, Italy, visiting another suitor, a \"rich American\". Jack escorted her seven-year-old son, Patrick Hughes (later Spike Hughes) from London to Florence, and then returned.  In his autobiography, \"Opening Bars\", Pat describes his part in her decision to return to England and marry Jack. Her divorce from Herbert Hughes, however, was not finalised until 1922."]}, {"page": "Dies Bildnis ist bezaubernd schön", "response": ["Though repeated elsewhere, the opening notes of \"Dies Bildnis\" do not recur in the aria itself. Spike Hughes writes, \"That rapt opening phrase does not occur again in this aria, and so has a remarkable effect of expressing that unforgettable but unrepeatable moment of love at first sight.\"Hughes (1972:201)"]}, {"page": "O zittre nicht, mein lieber Sohn", "response": ["While countless audiences have enjoyed hearing skilled sopranos navigate the difficult coloratura passage, Spike Hughes detects a more significant purpose in Mozart's writing:"]}, {"page": "Herbert Hughes (composer)", "response": ["Herbert Hughes (16 May 1882 – 1 May 1937) was an Irish composer, music critic and a collector and arranger of Irish folksongs. He was the father of Spike Hughes.", "Married to Lillian Florence (known as Meena) Meacham and Suzanne McKernan, Herbert had three children: Patrick (known professionally as Spike Hughes), Angela and Helena. He died in Brighton, England, at the relatively early age of fifty-four."]}, {"page": "Coarse", "response": ["*Coarse books, a British series of humorous books on sports and pursuits by Michael Green or Spike Hughes, e.g. The Art of Coarse Rugby"]}, {"page": "Hughes (surname)", "response": ["*Spike Hughes (1908–1987), British musician"]}, {"page": "Rugby union in Austria", "response": ["The London Irish player Spike Hughes wrote about the surreal world of 1960s Austrian rugby in the foreword to Michael Green's The Art of Coarse Rugby:"]}, {"page": "Lawrence Lucie", "response": ["Lucie's professional career began as a temporary substitute for Fred Guy in the Duke Ellington Orchestra in 1931. He spent the next two years playing guitar for Benny Carter, followed by Fletcher Henderson, the Mills Blue Rhythm Band, Lucky Millinder, Coleman Hawkins in 1940, and Louis Armstrong until 1944, recording with all of them except Ellington. He can also be found on record with Red Allen, Putney Dandridge, Billie Holiday, Spike Hughes, Jelly Roll Morton, Big Joe Turner, and Teddy Wilson.", "* Spike Hughes, Spike Hughes and His All American Orchestra (London, 1956)"]}, {"page": "Buddy Featherstonhaugh", "response": ["Born in Paris in 1909, the son of an English marine architect and his Scottish wife.  His grandfather, George William Featherstonhaugh, a geologist and geographer, had already emigrated to America.The Fast Life of Buddy Featherstonehaugh www.thebluemoment.com  After moving to England, he studied in Sussex, and had his first professional gig with Pat O'Malley in 1927. He was with Spike Hughes from 1930 to 1932, and toured England in Billy Mason's band behind Louis Armstrong that same year and in 1933 he recorded with a group called The Cosmopolitans, which included Fletcher Allen. He recorded with Valaida Snow in 1935 and Benny Carter in 1937."]}, {"page": "Music of the BioShock series", "response": ["* \"St. James Infirmary Blues\" - Spike Hughes & His Dance Orchestra"]}, {"page": "George Washington (trombonist)", "response": ["In New York, Washington studied under Walter Damrosch at the New York Conservatory, playing with various ensembles in the late 1920s. In 1931, he began playing with Don Redman, and gigged with Benny Carter in 1932 and Spike Hughes in 1933. In the mid-1930s, he played and arranged for the Mills Blue Rhythm Band and worked with Red Allen and Fletcher Henderson. From 1937 to 1943, he played in Louis Armstrong's orchestra."]}, {"page": "Wayman Carver", "response": ["Carver was a rare jazz flautist active during the swing era, and was among the earliest soloists on his main instrument to perform jazz, although Alberto Socarras preceded him by about five years. His first professional experience was with J. Neal Montgomery. After he moved to New York City in 1931, he recorded and performed with Dave Nelson, and played with Elmer Snowden (1931–32), Benny Carter, and Spike Hughes (1933)."]}, {"page": "Peelennium", "response": ["| Spike Hughes & His All American Orchestra"]}, {"page": "Billy Munn", "response": ["Munn also played on recordings with Spike Hughes (1932) and Benny Carter (1936) during this time. Munn then played with Sydney Lipton from 1936 to 1940, and concomitantly played with Louis Armstrong and Coleman Hawkins on their tours of England, as well as with Wingy Manone in the United States. He played with Stephane Grappelli in 1943 and George Chisholm in 1944, then led his own ensemble at the Orchid Room in Mayfair from 1945 to 1948. He co-founded the BBC program Jazz Club in the 1940s with producer Mark White and clarinettist Harry Parry."]}, {"page": "Leslie Thompson (musician)", "response": ["In 1930 he began playing with Spike Hughes, where he played trumpet, trombone, and double bass until 1932. In 1934–35 Thompson toured Europe with Louis Armstrong, then formed his own band, intended to be all-black (although initially with two white trombonists who blacked up), with the help of Ken \"Snakehips\" Johnson, who himself took over control of this band in 1936. Jiver Hutchinson was one of his sidemen."]}, {"page": "Billy Amstell", "response": ["At ten he played piano and at thirteen was teaching himself how to play alto saxophone. He performed in Glasgow before moving to London in 1930, working with violinist Jack Harris. During the next year, he recorded with Roy Fox and Spike Hughes and became a member of the Ambrose orchestra in which he played tenor saxophone. In the 1940s he worked for bandleader Geraldo and in the 1950s for the BBC Dance Orchestra. He was a studio musician in the 1960s, working with George Chisholm. He played clarinet in the 1980s, released a solo album, Session After Midnight (Zodiac, 1980), and wrote his autobiography, Don't Fuss, Mr. Ambrose. He continued to perform in his nineties."]}, {"page": "List of nicknames of jazz musicians", "response": ["* Spike: Spike Hughes"]}, {"page": "Avalon (Al Jolson song)", "response": ["*Spike Hughes and his Dance Orchestra (23 May 1930)"]}, {"page": "1987 in jazz", "response": ["** Spike Hughes, British upright bassist, composer, and music journalist (born 1908)."]}, {"page": "List of Desert Island Discs episodes (1951–1960)", "response": ["|||Spike Hughes||No book||A barrel of wine"]}, {"page": "Shad Collins", "response": ["* Spike Hughes, Spike Hughes and His All American Orchestra (London, 1956)"]}, {"page": "Jazz flute", "response": ["Among the earliest jazz flute recordings is \"Shootin' the Pistol,\" performed by the Cuban clarinettist and bandleader Alberto Socarras with the Clarence Williams band in 1927. The first jazzman to make extensive use of the flute was Wayman Carver, a saxophone player who from 1932 specialised in flute. He recorded flute solos with Benny Carter and with Spike Hughes in 1933, and played and recorded with the Chick Webb band for several years, soloing on flute on tracks such as \"Sweet Sue\", \"Down Home Rag\" and \"I Got Rhythm\".Brian Case, Stan Britt (1978). The Illustrated Encyclopedia of Jazz. New York: Harmony Books. ."]}, {"page": "List of television operas", "response": ["| 1938 || ||  Spike Hughes ||  CinderellaWyver, John. 'A tale of six Cinders, part 2: Cinderella (BBC, 1938, 1948, 1950)' in Screen Play, 12 January 2012 ||  Spike Hughes || BBC Television", "| 1947 || ||  Spike Hughes ||  St Patrick's Day ||  Richard Brinsley Sheridan || BBC Television"]}]}}