{"wiki_id": "http://www.wikidata.org/entity/Q1634193", "itemLabel": "Hugh Alexander Kennedy", "itemDescription": "English chess master", "wikipedia_url": "https://en.wikipedia.org/wiki/Hugh_Alexander_Kennedy", "wikipedia_page": {"main": "Hugh Alexander Kennedy (22 August 1809 – 22 October 1878) was an English chess master and writer.", "link_mentions": [{"page": "List of chess players", "response": ["* Hugh Alexander Kennedy (Ireland, England, 1809–1878)"]}, {"page": "Adolf Anderssen", "response": ["| 1851 || align=left| London International Tournament || 1 || 15/21 || align=left | Ahead of Marmaduke Wyvill, Elijah Williams, Howard Staunton, József Szén, Hugh Alexander Kennedy, Bernhard Horwitz, Henry Edward Bird, Lionel Kieseritzky, Carl Mayet, Johann Löwenthal, Edward Löwe, Alfred Brodie, James Mucklow, Samuel Newham, and E.S. Kennedy.A knock-out tournament in which the contestants played mini-matches in each round, increasing from best-of-3 in the 1st round to best-of 8 in the final. Anderssen himself beat Kieseritzky, Szen, Staunton and Wyvill – his closest mini-match was +4−2=1 in the final against Wyvill."]}, {"page": "Carl Mayet", "response": ["In 1899, Mayet defeated Jozsef Szen in a match with (+3−2=1). In 1845, he drew a match with Augustus Mongredien with (+3−3). In 1847, he defeated A. von der Goltz in a match (+14−9=1), but then lost a match with his cousin Wilhelm Hanstein (+5−12=1).  In 1848, he lost a match to Daniel Harrwitz (+2−5=2). In the London 1851 chess tournament, he was knocked out in round 1 when he lost to Hugh Alexander Kennedy with two losses. In 1851, he lost a match to Adolf Anderssen in Berlin with four losses. In 1852, he lost a match to Frederic Deacon (2–5). "]}, {"page": "József Szén", "response": ["Szén took fifth place at the world's first international chess tournament, London 1851. In the first round he beat Samuel Newham 2-0, then lost 2-4 to the tournament winner, Adolf Anderssen; in the third round he overcame Bernhard Horwitz 4-0, and in the fourth round Hugh Alexander Kennedy by 4½-½.chessmetrics.com, the Jozsef Szen results file He actually scored the highest percentage in the tournament.chessgames.com, the Jozsef Szen file In 1852, he drew a match with Ernst Falkbeer (+9 –9 =2) in Vienna. In 1853, he lost a match to Daniel Harrwitz (+1 –3 =1) in London."]}, {"page": "London 1851 chess tournament", "response": ["Before the tournament started two commentators wrote that the winner should be regarded as \"the World’s Chess Champion\"; one was Captain Hugh Alexander Kennedy, one of the tournament's organizers and competitors, while the other was the Liberty Weekly Tribune in Missouri. However, there is no indication that crowning a world champion was a formal objective of the tournament.", "The tournament was planned as a knock-out contest involving sixteen of Europe's best players. Invitations had been extended to foreign masters Vincent Grimm, József Szén, and Johann Löwenthal from Hungary; Adolf Anderssen, Bernhard Horwitz, Carl Mayet, and von der Lasa from Germany; Pierre Charles Fournier de Saint-Amant and Lionel Kieseritzky from France, and Carl Jaenisch, Alexander Petrov and Ilya Shumov from Russia. The British players were to be Howard Staunton, Henry Thomas Buckle, Marmaduke Wyvill, Elijah Williams, Captain Hugh Alexander Kennedy, William Newham, and Henry Bird."]}, {"page": "Edward Löwe", "response": ["In 1847, he won a match with Howard Staunton (5–2), but his opponent gave odds of pawn and two moves. In regular matches, he won against Hugh Alexander Kennedy (7½–6½) in 1849, and lost to Frederic Deacon (2½–7½) in 1851, James Hannah (8–13) in 1857, and Paul Morphy (0–6) in 1858.Edo Ratings, Lowe, E The match against Morphy took place in Lowe's Hotel, which belonged to Löwe.Lawson, p. 94"]}, {"page": "George Walker (chess player)", "response": ["In 1839, Walker visited Paris and the Café de la Régence, where he lost (+1-2) a short match to Boncourt . In 1845, he teamed up with Henry Thomas Buckle, William Davies Evans, George Perigal, and William Josiah Tuckett in London in two telegraph games (one win and one draw) against a team of Howard Staunton and Hugh Alexander Kennedy in Portsmouth.http://www.chesscafe.com/text/spinrad15.pdfThe Kibitzer"]}, {"page": "Hugh Kennedy (disambiguation)", "response": ["* Hugh Alexander Kennedy (1809–1878), British chess master and army captain"]}]}}