{"wiki_id": "http://www.wikidata.org/entity/Q1633060", "itemLabel": "Hubert Bath", "itemDescription": "composer", "wikipedia_url": "https://en.wikipedia.org/wiki/Hubert_Bath", "wikipedia_page": {"main": "Hubert Charles Bath (6 November 1883 – 24 April 1945) was a British film composer, music director, and conductor.  His credits include the music to the Oscar-winning documentary Wings over Everest (1934), as well as to the films Tudor Rose (1936), A Yank at Oxford (1938) and Love Story (1944).", "link_mentions": [{"page": "Barnstaple", "response": ["*Hubert Bath (1883–1945), born in Barnstaple, composed musical scores for many films in the 1920s and 1930s."]}, {"page": "List of film score composers", "response": ["* Hubert Bath (1883–1945)Tudor Rose, A Yank at Oxford, Millions Like Us"]}, {"page": "Warsaw Concerto", "response": ["*The composer and presenter Steve Race coined the term Denham Concerto for short romantic film pieces inspired by the success of the Warsaw Concerto, such as Hubert Bath's Cornish Rhapsody, Nino Rota's Legend of the Glass Mountain and Charles Williams' The Dream of Olwen, after the Denham Film Studios."]}, {"page": "Sports Report", "response": ["The programme, almost uniquely, has used the same theme music since its inception - \"Out of the Blue\", written by Hubert Bath. It is said that Lynam prevented the theme from being dropped in the 1970s due to it sounding old-fashioned."]}, {"page": "Basil Hood", "response": ["With the outbreak of World War I, German-language operetta lost its popularity. After that, Hood supplied lyrics for individual numbers for some musicals, and a revue, Bric-a-Brac with Lionel Monckton and Arthur Wimperis, and some non-musical plays. In the early days of the war, he took up a post with the Cryptography Division of the War Office.Kenrick, John. \"Who's Who in Musicals: Additional Bios XII\", Musicals101.com, 2004. Retrieved 11 June 2010 Despite the heavy demands of his wartime work, he wrote a patriotic light opera, Young England, with music by G. H. Clutsam and Hubert Bath, starring Walter Passmore, which ran at Daly's Theatre and then the Theatre Royal, Drury Lane in 1916–17 before going on tour.\"Young England: Music and Laughter at Daly's\", The Times, 26 December 1916, p. 9; The Times 4 January 1917, p. 8; and 26 March 1917, p. 11 In his final years, Hood developed an obsession with Shakespeare's Hamlet, which he believed contained a cryptogram that he worked to decipher. His companion of later years was Doris Armine Ashworth; she died about 1958."]}, {"page": "C. Hayden Coffin", "response": ["*4-2834 When travelling days are over Young England (Hubert Bath) c. 1916, 10\", coupled on E35. (speed 81)", "*2-4385 Young Fresh England Young England (Hubert Bath) in ensemble, 10\", coupled on E 35."]}, {"page": "Out of the Blue", "response": ["*\"Out of the Blue\", a composition by Hubert Bath used as theme music for Sports Report"]}, {"page": "Sir Alfred Rawlinson, 3rd Baronet", "response": ["On 13 December 1913, Rawlinson married secondly Jean Isabella Griffin Aitkin, an actress also known by her stage name of Jean Aylwin. They were divorced in 1924; the composer Hubert Bath was named as co-respondent in the case.Burke's Peerage 2003"]}, {"page": "Steve Race", "response": ["Race coined the term Denham Concerto for short romantic film pieces inspired by the success of Richard Addinsell's Warsaw Concerto, such as Hubert Bath's Cornish Rhapsody, Nino Rota's Legend of the Glass Mountain and Charles Williams' The Dream of Olwen, after the Denham Film Studios where many of them were made."]}, {"page": "Louis Levy", "response": ["*His Lordship (with Hubert Bath, 1936) ", "*Tudor Rose (with Hubert Bath, 1936) ", "*The Great Barrier (with Hubert Bath, Jack Beaver, 1937)", "*Non-Stop New York (with Hubert Bath, Bretton Byrd, 1937) "]}, {"page": "Thomas Quinlan (impresario)", "response": ["The artists were mostly British, with two returning Australian singers, Lalla Miranda and Julia Caroli. The company also included the British tenor John Coates and Britain's leading dramatic soprano, Agnes Nicholls. There was a total of 163 people in the party (plus a three-year-old child for Butterfly), including the permanent orchestra of 55 and a chorus of 60, and there were three conductors: Ernst Knoch for the Wagner operas, Hoffmann, Hansel and Gretel and Carmen; Tullio Voghera, who had conducted at the Met and been Caruso's accompanist, from the Royal Opera Stockholm, for the Italian repertoire, and English composer/conductor Hubert Bath, who conducted the opening of Faust and took over other operas later in the run. He was also chorus-master."]}, {"page": "Anastasia Martiusheva", "response": ["* Cornish Rhapsody  by Hubert Bath "]}, {"page": "Philip Fowke", "response": ["* \"Piano Concertos from the Movies\": pieces by Richard Addinsell, Hubert Bath, Jack Beaver, Richard Rodney Bennett, Bernard Herrmann, Leonard Pennario, Nino Rota, Miklós Rózsa and Charles Williams"]}, {"page": "Wanted for Murder (film)", "response": ["The score, by the Russian-born émigré composer Mischa Spoliansky, includes extracts from a fake piano concerto, A Voice in the Night using the soloist Eric Harrison. It is an example of the so-called \"Denham Concerto\",  a term coined by Steve Race to describe the short romantic pieces, written for piano and orchestra for use in film scores, which became  popular in Britain during the 1940s and 1950s, inspired by the success of Richard Addinsell's Warsaw Concerto, composed for the film Dangerous Moonlight in 1941. Like the Warsaw  Concerto and Hubert Bath's Cornish Rhapsody (from Love Story, 1944), A Voice in the Night was released commercially.Lane, Philip. Notes to The Film Music of Mischa Spolianski, Chandos CH10543 (2009)"]}, {"page": "Son Yeon-jae", "response": ["| Cornish Rhapsody by Hubert Bath"]}, {"page": "Miriam Licette", "response": ["Her associate artists in these recordings include Dennis Noble, Heddle Nash, Muriel Brunskill, Harold Williams, Frank Mullings and Clara Serena; and the conductors Sir Thomas Beecham, Percy Pitt, Albert Ketèlbey, Hamilton Harty, Hubert Bath, Felix Weingartner, Eugene Goossens, Clarence Raybould and Stanford Robinson."]}, {"page": "Cedric Sharpe", "response": ["His light orchestral pieces are: Suite Pompadour (orchestrated by Hubert Bath 1934) and Holyrood Suite (1935)."]}, {"page": "Jean Aylwin", "response": ["On 13 December 1913, Aylwin married Lieutenant-Colonel Alfred Rawlinson, son of Sir Henry Rawlinson, the famed Assyriologist. They were divorced in 1924; the composer Hubert Bath was named as co-respondent in the case. The court heard that while she had been appearing in Polly, she had asked her husband to rent a flat for her opposite the theatre. When he went to visit her there, he encountered Mr Bath. On learning that his wife was too ill to come out, Rawlinson invited Bath out to lunch, who declined, claiming a prior engagement. Rawlinson returned to the flat later, where he again met Bath. When Bath went to ask Aylwin if she was well enough to receive her husband, Rawlinson heard her ask \"Has he gone?\" which aroused his suspicions about Bath's presence. Aylwin wrote to her husband afterwards, saying he was \"quite wrong\", and that Bath had been \"a good friend\". However, the housekeeper testified that Aylwin and Bath had often been alone together at the flat. The court found for Colonel Rawlinson and granted the divorce."]}]}}