{"wiki_id": "http://www.wikidata.org/entity/Q1643584", "itemLabel": "Tehmina Sunny", "itemDescription": "actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Tehmina_Sunny", "wikipedia_page": {"main": "Tehmina Sunny is an English actress. She is also trained as a violinist and vocalist. She is of Indian descent.", "link_mentions": [{"page": "1980 in American television", "response": ["|Tehmina Sunny"]}, {"page": "The Ground Beneath Her Feet", "response": ["The novel has been turned into a major performance work combining music and film that premiered at the inaugural Manchester International Festival in England on 29 June 2007. Composed by Victoria Borisova-Ollas and featuring a film directed by Mike Figgis (Leaving Las Vegas, Internal Affairs), the tale of two star-crossed lovers was performed by the Hallé orchestra, conducted by its music director Mark Elder and Alan Rickman as the narrator, with Tehmina Sunny in the role of Vina."]}, {"page": "List of Heroes characters", "response": ["Bridget Bailey, introduced by the BBC in its mirror of Heroes 360 information and portrayed by Tehmina Sunny, has the ability of psychometry. Her exchanges with Mohinder Suresh were later included on NBC.com as part of Heroes Evolutions. Her first message, entitled \"I need some advice\", began on July 11, 2007."]}, {"page": "List of NCIS characters", "response": ["| scope=\"row\" | Tehmina Sunny", "Leyla Shakarji (Tehmina Sunny) is the daughter-in-law of Mike Franks. She was disowned by her family and then smuggled out of Iraq after becoming pregnant with the child of Franks's biological son, Lance Corporal Liam O'Neill, USMC. O'Neill was murdered and Gibbs finds out about Leyla from Franks as he was the lead agent assigned to the case. She and her daughter, Amira, lived with Mike in Mexico until his death in 2011. Gibbs, as Amira's godfather, asks Leyla to move to Washington DC to be nearer to him as he is their closest thing to family. Leyla's mother, Shada Shakarji (Diane Venora), is the tough-as-nails matriarch of one of the most prominent tribes in Iraq, due to the fact that most of her male relatives are now deceased."]}, {"page": "Marc Rosenberg (screenwriter)", "response": ["Rosenberg finished shooting the suspense-thriller Elevator, which he wrote and produced. The film, which is about people trapped in a New York elevator with a terrorist, features actors John Getz, Shirley Knight, Joey Slotnick, Devin Ratray, Waleed Zuaiter, Anita Briem, Tehmina Sunny, Christopher Backus, Michael Mercurio, Amanda Pace and Rachel Pace. It is Rosenberg's second film to be shot in the U.S. It was released in 2011.http://movies.broadwayworld.com/article/Shirley_Knight_Begins_Production_for_ELEVATOR_20100930  TalkMoviesWorld.com"]}, {"page": "Elevator (2011 film)", "response": ["* Tehmina Sunny as Maureen Asana, an investigative reporter for a local news station, fiancée of Don."]}, {"page": "Mistresses (American season 1)", "response": ["* Tehmina Sunny as Natalie Wade"]}, {"page": "Chicago Med", "response": ["* Tehmina Sunny as Dr. Sabeena Virani (season 6), a cardiologist who supervises a clinical trial for a new medication and approaches Dr. Will Halstead to lead the project."]}, {"page": "Sunny (name)", "response": ["* Tehmina Sunny (born 1980), English actress"]}, {"page": "List of Chicago Med characters", "response": ["| Tehmina Sunny"]}, {"page": "Pandora (TV series)", "response": ["* Tehmina Sunny as Regan Freid (season 1), the daughter of industrialist Harlan Fried."]}, {"page": "Chicago Med (season 6)", "response": ["* Tehmina Sunny as Dr. Sabeena Virani, R&D Rep from Kender Pharmaceutical", "On September 22, 2020, Tehmina Sunny has been tapped for a multi-episode arc. On May 12, 2021, it was announced that longtime cast members Yaya DaCosta and Torrey DeVitto would depart the series at the end of the sixth season opting not to renew their contracts and new work opportunities."]}]}}