{"wiki_id": "http://www.wikidata.org/entity/Q1640024", "itemLabel": "Joseph Marcell", "itemDescription": "British actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Joseph_Marcell", "wikipedia_page": {"main": "Joseph Marcell (born 14 August 1948) is a British actor and comedian. He is best known for his role as Geoffrey Butler, the butler on the NBC sitcom The Fresh Prince of Bel-Air from September 1990 until the show ended in May 1996. Born in Saint Lucia, he moved to the United Kingdom, when he was nine years old and grew up in Peckham, South London. Marcell currently lives in Banstead, Surrey.\nHe studied speech and dance at the Central School of Speech and Drama.", "link_mentions": [{"page": "List of comedians", "response": ["* Joseph Marcell (born 1948)"]}, {"page": "1948", "response": ["* August 14 – Joseph Marcell, English actor"]}, {"page": "Southall", "response": ["*Joseph Marcell, American television personality (\"Fresh Prince of Bel Air\" and English theatre actor)"]}, {"page": "Wilkins Micawber", "response": ["|1993 || David Copperfield || Joseph Marcell"]}, {"page": "The Fresh Prince of Bel-Air", "response": ["| scope=\"row\" | Joseph Marcell", "Following Fresh Prince's conclusion, Ribeiro joined the principal cast of In the House from its third season as Dr. Maxwell Stanton. In the Season 4 episode \"My Pest Friend's Wedding\", Avery and Daphne Maxwell Reid (the second Vivian Banks) guest starred as Stanton's parents. Joseph Marcell, Geoffrey Butler on Fresh Prince, appeared as an officiating minister in the same episode.", "| Joseph Marcell"]}, {"page": "1948 in television", "response": ["|Joseph Marcell"]}, {"page": "DJ Jazzy Jeff & the Fresh Prince", "response": ["The next single was \"Jazzy's Groove\", sampling \"Nautilus\" in the chorus and bridge. The song features much more of Jazzy Jeff, like in \"Brand New Funk\"; Jazzy Jeff gives a 'math lesson' by making the sound clips add 1+1, 2+1, and 2+2. Due to a self-admitted spendthrift attitude, Smith felt he had nothing to lose when a producer from NBC and Quincy Jones approached him with an idea for a sitcom, with Townes appearing as a recurring character, named \"Jazz\". A popular running gag would have Uncle Phil (James Avery) literally throwing Jazz out of the house; however, this action is not restricted to Uncle Phil, as other characters, including Hilary Banks (Karyn Parsons), Geoffrey Butler (Joseph Marcell), the second Aunt Vivian (Daphne Maxwell Reid) and even Will himself, have thrown him out in the same manner. Another trademark on the show involved Jazz and Will greeting each other by slapping each other's hand, then swinging back in opposite directions while saying \"Pssh!\" The Fresh Prince of Bel-Air boosted his profile and his pocketbook. But Smith ended up squandering almost US$2.8m, while failing to pay any of it to the Internal Revenue Service in income taxation. Soon after And in This Corner... was released, Smith was found guilty of income-tax evasion by the IRS, and sentenced to pay this all back. For the first three seasons of The Fresh Prince of Bel-Air, Smith had 25% of his paycheck subjected to IRS garnishment. "]}, {"page": "List of Eastern Caribbean people", "response": ["* Joseph Marcell"]}, {"page": "Peer Gynt", "response": ["In 2000, the Royal National Theatre staged a version based on the 1990 translation of the play by Frank McGuinness. The production featured three actors playing Peer, including Chiwetel Ejiofor as the young Peer, Patrick O'Kane as Peer in his adventures in Africa, and Joseph Marcell as the old Peer. Not only was the use of three actors playing one character unusual in itself, but the actors were part of a \"color-blind\" cast: Ejiofor and Marcell are black, and O'Kane is white."]}, {"page": "Living Single", "response": ["* Joseph Marcell — Reese, the women's house cleaner (Season 4, Episode 19)"]}, {"page": "James Avery", "response": ["On December 31, 2013, Avery died at the age of 68 at Glendale Memorial Medical Center. His publicist, Cynthia Snyder, told the Associated Press that Avery died following complications from open heart surgery. Janet Hubert, who portrayed his on-screen wife Vivian on The Fresh Prince of Bel-Air for the first three seasons, said after his death: \"RIP James, all the world is a stage, and we are all merely players in this production called LIFE.\" Will Smith commented on Avery's death, saying: \"Some of my greatest lessons in acting, living, and being a respectable human being came through James Avery. Every young man needs an Uncle Phil. Rest in peace.\" Joseph Marcell (Geoffrey) called Avery a \"gentle giant\"."]}, {"page": "Omeros", "response": ["Walcott has adapted his poem for performance at the Sam Wanamaker Playhouse, Shakespeare's Globe, London. Starring Saint Lucian actor Joseph Marcell and Jade Anouka, it was presented in May and June 2014, and was reprised in October 2015."]}, {"page": "List of fictional butlers", "response": ["| Geoffrey Butler || from The Fresh Prince of Bel-Air (Joseph Marcell also plays the recurring role of Massimo Marone's butler on The Bold and the Beautiful, who used to work for a family in Beverly Hills, a reference to his role on Fresh Prince) || Joseph Marcell|| 1990 ||"]}, {"page": "In the House (TV series)", "response": ["* Joseph Marcell – Pastor (season 4)"]}, {"page": "List of Soul Train episodes", "response": ["| Joseph Marcell"]}, {"page": "Patrick Trueman", "response": ["Patrick rents the car-lot, hiring Pat Evans (Pam St Clement) to do bookkeeping. Patrick and Pat begin a casual affair, which Yolande discovers when Stacey Slater (Lacey Turner) informs her; Yolande slaps Pat, who retaliates. Yolande threatens to leave, but Patrick persuades her to rebuild their marriage. Yolande remains resentful and almost strays with Aubrey Valentine (Joseph Marcell), a member of Patrick's former band, The Five Hectors; Aubrey tries to destroy Patrick but fails and the Truemans remain together. Denise Fox (Diane Parish) discovers that a member of Patrick's band is her father although she is unsure which member. Patrick takes a DNA test and it is revealed that he is not Denise's father, but he pretends he is as he has grown attached to her. The truth comes out while Patrick and Denise holiday together; despite initial upset, Denise and the Truemans remain close. Patrick sees Denise as the daughter he never had and acts as grandfather to her two daughters Chelsea (Tiana Benjamin) and Libby (Belinda Owusu)."]}, {"page": "Anansi Boys", "response": ["A new, six-part full-cast radio series was produced in 2017, adapted by Dirk Maggs; it's the fifth of Gaiman's novels Maggs has adapted for radio. It is narrated by Joseph Marcell, and stars Jacob Anderson as Fat Charlie, Nathan Stewart-Jarrett as Spider and Lenny Henry as Anansi, with the rest of the cast including Julian Rhind-Tutt as Grahame Coats and Adjoa Andoh as Bird Woman. It was broadcast on BBC Radio 4 and the BBC iPlayer over six days, beginning on Christmas Day 2017; the first five episodes were 30 minutes each, with a 60-minute finale broadcast on December 30. Gaiman is reportedly very happy with this version, describing it as his favourite of Maggs' adaptations."]}, {"page": "Yolande Trueman", "response": ["In early 2006, Yolande strikes up a feud with Pat Evans (Pam St Clement) when she starts to become involved in another Trueman business, Trueman's Motors. Their rivalry increases when Pat begins an affair with Patrick, but their Minute Mart employee Stacey Slater (Lacey Turner) catches Pat and Patrick kissing and tells Yolande. This results in a brawl in The Queen Victoria public house. Yolande attempts to play Patrick at his own game. She goes to a nightclub intending to pick up a man and have an affair. She comes onto Kevin Wicks (Phil Daniels), he reciprocates, and the pair arrange to go back to his house for sex. However she has second thoughts and backs out. The next day, she confesses to Patrick that she almost had sex with another man, and, albeit reluctantly, gives Patrick another chance. Soon afterwards, in October 2006, Yolande then has a supposed drunken one-night stand with Aubrey Valentine (Joseph Marcell), one of Patrick's old friends. This results in Patrick throwing her out, but when they call Aubrey's bluff, he admits they did not have sex, and the couple reconcile."]}, {"page": "Banstead", "response": ["*Joseph Marcell, Actor"]}, {"page": "Empire Road", "response": ["Cast members included Norman Beaton, Corinne Skinner-Carter, Wayne Laryea, Joseph Marcell, Rudolph Walker and Rosa Roberts. The programme also provided early TV exposure for Julie Walters who appeared in a few episodes. The series was made at BBC Pebble Mill with location work in the Handsworth area of Birmingham."]}, {"page": "List of former EastEnders characters", "response": ["|Aubrey Valentine || Joseph Marcell || 2006", "|Adrian Bell || Joseph Marcell || 1992"]}, {"page": "Black British people", "response": ["Television reporter and newsreader Sir Trevor McDonald, born in Trinidad, was knighted in 1999. Also notable is Moira Stuart, OBE, the first female newsreader of African-Caribbean heritage on British television. Other high-profile television personalities and entertainers include comedian Sir Lenny Henry, John Boyega, Rudolph Walker, Joseph Marcell, Nabil Elouahabi and chef Ainsley Harriott."]}, {"page": "Denise Fox", "response": ["Moving to Walford, Denise has a tempestuous encounter with Kevin Wicks (Phil Daniels); however, an attraction develops and they begin dating. Denise's ex-spouse Owen Turner (Lee Ross), an vituperative alcoholic, soon turns up and wishes to reunite with their daughter Libby Fox (Belinda Owusu). When Denise prevents this from happening, Owen kidnaps Libby and tries to down them both - but she recovers and Owen is arrested. Denise, who never knew her father but knows he played in a band called \"The Five Hectors\", thinks that her lodger Patrick Trueman (Rudolph Walker) may be her father as he was in the band but a DNA test proves that he is not. The band also consisted of Aubrey Valentine (Joseph Marcell), Cedric Lucas (Ram John Holder), Dwight and Earl. The identity of Denise's father is never discovered, up to the point where Aubrey also dismisses himself; nonetheless, Patrick quickly bonds with Denise and becomes a father figure towards her."]}, {"page": "Shane Cullinan", "response": ["Cullinan has continued to work for theatre and film and on projects with the Royal Opera House, The Urban Culture Project, Tonic Fold, Cargem Theatre, Hanby & Barrett, and Channel 4. In 2017 he was appointed as composer and musical director for the prolific West-End production of Lady Windermere's Fan directed by Kathy Burke starring Jennifer Saunders, Samantha Spiro, Kevin Bishop and Joseph Marcell, produced by Dominic Dromgoole Classic Spring Company at Vaudeville Theatre London."]}, {"page": "List of The Professionals episodes", "response": ["| Keith Washington, John Junkin, Robert Flemyng, Joseph Marcell, Nick Brimble, Marilyn Galsworthy, Vicki Michelle, Ramsay Williams, Imogen Bickford-Smith"]}, {"page": "Marcell", "response": ["* Joseph Marcell, an actor from St. Lucia"]}, {"page": "Theatre Royal, Bath", "response": ["In 1997, a studio theatre was built at the rear of the building on Monmouth Street, called the Ustinov Studio, named after the actor Peter Ustinov. The front of the building is decorated with a bronze winged figure which was designed by his son, Igor Ustinov, entitled Hopefully. The 150-seat auditorium was originally a space for the youth theatre and small-scale touring productions, but the Ustinov programme soon expanded to encompass classical concerts, stand-up comedy (including high-profile acts such as Bill Bailey, Stewart Lee and Lucy Porter) and in-house productions. To accommodate the technical needs of these productions, a refurbishment was planned to take place throughout 2007, improving the backstage & technical facilities, the foyer, bar and auditorium. The Ustinov Studio re-opened in February 2008, with their own production of Breakfast With Mugabe, starring Joseph Marcell, Miles Anderson and Nicholas Bailey."]}, {"page": "Michael Abbensetts", "response": ["Apart from plays, Abbensetts was a screenwriter for Empire Road (BBC, 1978–79), considered British television's first Black soap opera. He has said: \"I never really liked it being called a Soap. It was The Daily Mail that called it that. I always thought of it as a drama series, where each episode had a separate story.\" The second series was directed by Horace Ové, \"establishing a production unit with a Black director, Black writer and Black actors.\" The cast featured Norman Beaton, Corinne Skinner-Carter, Joseph Marcell, Rudolph Walker and Wayne Laryea. Other television projects by Abbensetts include Easy Money (1981), Big George Is Dead (Channel 4, 1987), starring Norman Beaton, Linzi Drew and Ram John Holder,\"Big George Is Dead\" at IMDb. and the mini-series Little Napoleons (1994, Channel 4).\"Little Napoleons\" at IMDb."]}, {"page": "List of The Bold and the Beautiful characters", "response": [":Joseph Marcell (2003–04)"]}, {"page": "Horace Ové", "response": ["Ové's film Playing Away (1987, with a screenplay by Caryl Phillips),\"Playing Away (1987)\", IMDb. starring Norman Beaton and other notable actors such as Joseph Marcell, Ram John Holder, Brian Bovell, and Stefan Kalipha (incidentally, Ové's cousin), centres on the residents of the fictional British village of Sneddington, who invite the \"Caribbean Brixton Conquistadors\" (from South London) for a cricket match to commemorate \"African Famine Week\".Playing Away page at Screenonline.org.uk."]}, {"page": "David Copperfield (1993 film)", "response": ["David Copperfield is a 1993 traditionally animated musical feature-length adaptation of Charles Dickens' classic 1850  novel of the same name. It was directed by Don Arioli and features the voices of Sheena Easton, Julian Lennon, Howie Mandel, Andrea Martin, Kelly Le Brock, Michael York, Joseph Marcell and many others. The movie is loosely based on Dickens' original plot, omitting several major characters (such as Mr Creakle, Dora Spenlow, and Uriah Heep) and adding fantasy elements like the \"moldies\" and the \"cheese monster\". The human characters are replaced with anthropomorphic animals.", "* \"Something's Gonna Turn Up\" – David Copperfield and Mr. Micawber (Julian Lennon and Joseph Marcell)", "* \"Family Christmas\" – Agnes Wickfield, David Copperfield, Mr. Micawber and Aunt Betsey (Sheena Easton, Julian Lennon, Joseph Marcell and Andrea Martin)"]}, {"page": "The Sofa of Time", "response": ["The series features Spaced regulars Mark Heap, Julia Deakin, Peter Serafinowicz, and Simon Pegg as well as Kevin Eldon, Daisy Jones and Joseph Marcell.  The series was produced by Mario Stylianides, for Talkback."]}, {"page": "Edric Connor", "response": ["A prestigious annual award named after him, the Edric Connor Inspiration Award, is made annually in his honour in the Screen Nation Film and Television Awards. It was won by Joseph Marcell in 2012 and in 2011 by Sir Trevor MacDonald OBE, other previous winners including Moira Stuart (2007), Mona Hammond (2006) and Lenny Henry (2002). In 2014 the award was posthumously given to Felix Dexter.\"The Winners — 2014 Awards\" , Screen Nation."]}, {"page": "Kino's Storytime", "response": ["* Joseph Marcell"]}, {"page": "List of EastEnders characters (1992)", "response": ["Adrian Bell, played by Joseph Marcell, appears in episodes 782 and 783, first broadcast on 4 and 6 August 1992 respectively. He is introduced as an acquaintance of Grant Mitchell (Ross Kemp)."]}, {"page": "List of EastEnders characters (2006)", "response": ["Joy returns in October 2006 to tell Patrick and Yolande that Cedric has died. She attends his funeral and wake, with Patrick, Yolande, and Cedric's other surviving bandmate, Aubrey Valentine (Joseph Marcell). Denise Fox has revealed that her father was in a band called The Five Hectors, and Patrick tells Joy and Aubrey that her father is either himself, Cedric, Aubrey, or one of the two other deceased band members. Joy later returns to Trinidad.", "Aubrey Valentine, played by Joseph Marcell, was once a member of a band called The Five Hectors, along with Patrick Trueman (Rudolph Walker), Cedric Lucas (Ram John Holder) and two other men named Dwight and Earl. Aubrey first appears in Walford for Cedric's funeral. Patrick reveals to Aubrey that local resident Denise Fox (Diane Parish) knows that her father was in The Five Hectors, but she does not know his name. On realising that he could possibly be Denise's father, Aubrey leaves the funeral reception."]}, {"page": "David George (Baptist)", "response": ["* George was portrayed by Joseph Marcell in the BBC television production of Rough Crossings (2007), based on the history of Black Loyalists and the formation of Freetown by Simon Schama."]}, {"page": "Ustinov Studio", "response": ["In 2006 it closed for a £1.5million,  15-month refurbishment undertaken by Haworth Tompkins.  The Ustinov Studio re-opened in February 2008,  following a period of closure for refurbishment, with their own production of Breakfast With Mugabe starring Joseph Marcell, Miles Anderson and Nicholas Bailey."]}, {"page": "Playing Away", "response": ["*Joseph Marcell"]}]}}