{"wiki_id": "http://www.wikidata.org/entity/Q164565", "itemLabel": "Peter Molyneux", "itemDescription": "English video game designer and game programmer", "wikipedia_url": "https://en.wikipedia.org/wiki/Peter_Molyneux", "wikipedia_page": {"main": "Peter Douglas Molyneux  (; born 5 May 1959) is an English video game designer and programmer. He created the god games Populous, Dungeon Keeper, and Black & White, as well as Theme Park, the Fable series, Curiosity – What's Inside the Cube?, and Godus. He currently works at 22cans.", "link_mentions": [{"page": "Atari ST", "response": ["The ST enjoyed success in gaming due to the low cost, fast performance, and colorful graphics. Notable individuals who developed games on the ST include Peter Molyneux, Doug Bell, Jeff Minter, Éric Chahi, Jez San, and David Braben."]}, {"page": "Final Fantasy", "response": ["The series has inspired numerous game developers. Fable creator Peter Molyneux considers Final Fantasy VII to be the RPG that \"defined the genre\" for him. BioWare founder Greg Zeschuk cited Final Fantasy VII as \"the first really emotionally engaging game\" he played and said it had \"a big impact\" on BioWare's work. The Witcher 3 senior environmental artist Jonas Mattsson cited Final Fantasy as \"a huge influence\" and said it was \"the first RPG\" he played through. Mass Effect art director Derek Watts cited Final Fantasy: The Spirits Within as a major influence on the visual design and art direction of the series. BioWare senior product manager David Silverman cited Final Fantasy XIIs gambit system as an influence on the gameplay of Dragon Age: Origins. Ubisoft Toronto creative director Maxime Beland cited the original Final Fantasy as a major influence on him. Media Molecule's Constantin Jupp credited Final Fantasy VII with getting him into game design. Tim Schafer also cited Final Fantasy VII as one of his favourite games of all time."]}, {"page": "Lionhead Studios", "response": ["Lionhead Studios Limited was a British video game developer founded in July 1997 by Peter Molyneux, Mark Webley, Tim Rance, and Steve Jackson. The company is best known for the Black & White and Fable series. Lionhead started as a breakaway from developer Bullfrog Productions, which was also founded by Molyneux. Lionhead's first game was Black & White, a god game with elements of artificial life and strategy games. Black & White was published by Electronic Arts in 2001. Lionhead Studios is named after Webley's hamster, which died not long after the naming of the studio, as a result of which the studio was very briefly renamed to Redeye Studios.", "upright|thumb|left|Peter Molyneux (2007), co-founder of Lionhead Studios", "Peter Molyneux founded Bullfrog Productions in 1987, which was later acquired by Electronic Arts (EA) in 1995. Around 1996, Molyneux had contemplated leaving Bullfrog, as he felt limited in his creative freedom under Electronic Arts. He along with Lionhead's eventual co-founders, Mark Webley, Tim Rance and Steve Jackson, started developing plans for a new studio. In 1997, due to a series of events and from issues arising between Molyneux and Electronic Arts, he ultimately left the company in July 1997, co-founding Lionhead shortly after that, along with Mark Webley, Tim Rance, and Steve Jackson (who co-founded Games Workshop and co-authored the Fighting Fantasy series). On his recruitment, Jackson said \"It was an offer I couldn't refuse\", as he wanted to get back to making games instead of writing about them (Jackson had interviewed Molyneux about Bullfrog and Dungeon Keeper, but for much of it, they discussed German board games instead. This led to them meeting frequently for an event called \"Games Night\"). Molyneux assured him that his lack of programming knowledge was an asset rather than a problem. Lionhead is the second Bullfrog break-off group, after Mucky Foot Productions (founded in February 1997). According to Glenn Corpes (who co-founded another: Lost Toys), Lionhead was Molyneux's \"take on what Bullfrog used was\"."]}, {"page": "PlayStation (console)", "response": ["Sony strived to make game production as streamlined and inclusive as possible, in contrast to the relatively isolated approach of Sega and Nintendo. Phil Harrison, the then-representative director of SCEE, believed that Sony's emphasis on developer assistance reduced most time-consuming aspects of development. As well as providing programming libraries, SCE headquarters in London, California and Tokyo housed technical support teams that could work closely with third-party developers if needed. Peter Molyneux, who owned Bullfrog Productions at the time, admired Sony's open-handed approach to software developers and lauded their decision to use PCs as a development platform, remarking that \"[it was] like being released from jail in terms of the freedom you have\". Another strategy that was effective in attracting software developers was the PlayStation's use of the CD-ROM format instead of traditional cartridges; in contrast to other disc-reading consoles such as the 3DO, the PlayStation could quickly generate and synthesise data from the CD since it was an image-generation system, rather than a data-replay system."]}, {"page": "The Legend of Zelda", "response": ["Souls creator Hidetaka Miyazaki (FromSoftware) named A Link To The Past as one of his favorite role-playing video games. According to Miyazaki, \"The Legend of Zelda became a sort of textbook for 3D action games.\" Ico director Fumito Ueda (Team Ico) cited Zelda as an influence on Shadow of the Colossus. Peter Molyneux (Lionhead Studios and Microsoft Studios) stated that the Twilight Princess is one of his favorite games and an influence for the Fable series. Darksiders director David Adams (Vigil Games) cited Zelda as an influence on his work. Prince of Persia and Assassin's Creed director Raphael Lacoste (Ubisoft) cited The Wind Waker as an influence on Assassin's Creed IV: Black Flag. CD Projekt Red (The Witcher, Cyberpunk 2077) cited the Zelda series as an influence on The Witcher series, including The Witcher 3: Wild Hunt.Episode #478 – The Witcher 3: Wild Hunt Interview with CD Projekt Red (48:45) Alex Hall cited Majora's Mask as the primary influence on their Ben Drowned web serial and web series. Final Fantasy and The 3rd Birthday director Hajime Tabata (Square Enix) cited Ocarina of Time as inspiration for the seamless open world of Final Fantasy XV."]}, {"page": "History of video games", "response": ["Later in the 1980s the next wave of personal computers emerged, with the Commodore Amiga and Atari ST in 1985 and the Atari ST. Both computers had more advanced graphics and sound capabilities than the prior generation of computers, and made for key platforms for video game development, particularly in the United Kingdom. The bedroom coders had since formed development teams and started producing games for these systems professionally. These included Bullfrog Productions, founded by Peter Molyneux, with the release of Populous (the first such god game), DMA Design with Lemmings, Psygnosis with Shadow of the Beast, and Team17 with Worms."]}, {"page": "1959", "response": ["** Peter Molyneux, British game programmer"]}, {"page": "Final Fantasy VII", "response": ["The game has inspired numerous developers. GameSpot stated that Final Fantasy VII was \"the RPG that would influence every role-playing game that would follow\" after it, and that its cinematic approach to storytelling was widely adopted by later RPGs. Its Limit Break gameplay mechanic became a core mechanic in subsequent Final Fantasy games. According to Samuel Roberts of Retro Gamer, the game's \"character designs would shape Japanese RPGs for years to come\". Fable creator Peter Molyneux considers FFVII to be the RPG that \"defined the genre\" for him. BioWare founder Greg Zeschuk cited FFVII as \"the first really emotionally engaging game\" he played and said it had \"a big impact\" on BioWare's work. Black Isle Studios cited FFVII as an inspiration for Planescape: Torment (1999). According to Maciej Miszczyk of Hardcore Gaming 101, FFVIIs spell animations and character quests may have influenced Western computer RPGs such as Planescape: Torment and BioWare's Baldur's Gate II (2000). Media Molecule's Constantin Jupp credited FFVII with getting him into game design. Tim Schafer cited FFVII as one of his favorite games of all time. Thatgamecompany founder Jenova Chen cited FFVII as one of the biggest influences on his work and the game that inspired his adopted name (from the character Jenova). Grinding Gear Games designer Chris Wilson cited the Materia system of Final Fantasy VII as an influence on Path of Exile (2013)."]}, {"page": "Populous (video game)", "response": ["The player assumes the role of a deity, who must lead followers through direction, manipulation, and divine intervention, with the goal of eliminating the followers led by the opposite deity. Played from an isometric perspective, the game consists of more than 500 levels, with each level being a piece of land which contains the player's followers and the enemy's followers. The player is tasked with defeating the enemy followers and increasing their own followers' population using a series of divine powers before moving on to the next level. The game was designed by Peter Molyneux, and Bullfrog developed a gameplay prototype via a board game they invented using Lego.", "Peter Molyneux led development, inspired by Bullfrog's artist Glenn Corpes having drawn isometric blocks after playing David Braben's Virus.", "Peter Molyneux presented a post-mortem of the games development and work in progress on a related personal project at Game Developers Conference in 2011.", "Compute! named the game to its list of \"nine great games for 1989\", stating that with \"great graphics, a simple-to-learn interface, and almost unlimited variety, Populous is a must buy for 1989\". Peter Molyneux estimated that the game accounted for nearly a third of all the revenue of Electronic Arts in that year.", "Orson Scott Card in Compute! criticized the game's user interface, but praised the graphics and the ability to \"create your own worlds ... you control the world of the game, instead of the other way around\". STart in 1990 gave \"kudos especially to Peter Molyneux, the creative force behind Populous\". The magazine called the Atari ST version \"a fascinating, fun and challenging game. It's unlike any other computer game I've ever seen, ever. Don't miss it, unless you are a dyed-in-the-wool arcade gamer who has no time for strategy\". Entertainment Weekly picked the game as the No. 16 greatest game available in 1991, saying: \"Talk about big-time role-playing. Most video games posit you as a mere sword-wielding, perilously mortal human; in Populous you're a deity. Slow-paced, intricate, and difficult to learn: You literally have to create entire worlds while all the time battling those pesky forces of evil.\""]}]}}