{"wiki_id": "http://www.wikidata.org/entity/Q165592", "itemLabel": "Joseph Leftwich", "itemDescription": "British writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Joseph_Leftwich", "wikipedia_page": {"main": "Joseph Leftwich (1892–1983), born Joseph Lefkowitz, was a British critic and translator into English of Yiddish literature.", "link_mentions": [{"page": "A. K. Chesterton", "response": ["* The Tragedy of Anti-Semitism, with Joseph Leftwich (1948)"]}, {"page": "Stephen Winsten", "response": ["Stephen Winsten (1893–1991) was the name adopted by Samuel Weinstein, one of the 'Whitechapel Boys' group of young Jewish men and future writers in London's East End in the years before World War I (the others included Isaac Rosenberg, John Rodker and Joseph Leftwich). In the First World War he was a conscientious objector, and imprisoned in Bedford and Reading gaols. He is now known for his works about George Bernard Shaw, and his life of Henry Salt."]}, {"page": "Joseph Lefkowitz", "response": ["#REDIRECT Joseph Leftwich"]}, {"page": "Joseph McElroy", "response": ["In 1961, McElroy married Joan Leftwich, of London, in London. She is the daughter of Yiddish-speaking Orthodox Jews; her father, Joseph Leftwich, was a translator and anthologizer of Yiddish poetry.one of his translations was used by McElroy in A Smuggler's Bible from an anthology Leftwich dedicated to Joan The McElroys' only child, Hanna, was born in 1967. McElroy assisted with the birth."]}, {"page": "Chaim Grade", "response": ["*Shayn fun farloshene shtern (The Glow of Extinguished Stars). 1950. Translated in \"The Golden Peacock: A Worldwide Treasury of Yiddish Poetry\", Ed. Joseph Leftwich, 1961."]}, {"page": "Abraham Nahum Stencl", "response": ["Stencl was arrested in 1936 and tortured by the Gestapo. However, he was released and made his escape to the United Kingdom, settling in London (from 1944), initially in Hampstead, but soon moving to Whitechapel. There he met again with Dora Diamant, and founded the Literarische Shabbes Nokhmitogs (later known as Friends of Yiddish), a weekly meeting involving political debate, literature, poetry and song, in the Yiddish language.Diamant, pp. 240-1. He found an English translator in Joseph Leftwich.Diamant, p. 242. He also edited the Yiddish literary journal Loshn und Lebn, from 1946 to 1981. Diamant in 1951 defined Stencl's work as a mitzvah, to keep Yiddish alive.Diamant, p. 297."]}, {"page": "List of British Jewish writers", "response": ["* Joseph Leftwich, writer, one of the Whitechapel Boys"]}, {"page": "Chaim Zhitlowsky", "response": ["* Joseph Leftwich comp. and trans., The Way We Think, A. S. Barnes & Co., 1969. pp. 76–98, Zhitlovski essays: \"Job-A Poem of Jewish Free Thought,\" \"What Is Secular Jewish Culture?\""]}, {"page": "Whitechapel Boys", "response": ["The name \"Whitechapel Boys\" identifies a loosely-knit group of Anglo-Jewish writers and artists of the early 20th century.  It is named after Whitechapel, which contained one of London's main Jewish settlements and from which many of its members came.  These members included Mark Gertler, Isaac Rosenberg, David Bomberg, Joseph Leftwich, Jacob Kramer, Morris Goldstein, Stephen Winsten, John Rodker, Lazarus Aaronson and its only female member, Clara Birnberg."]}, {"page": "Albert Montefiore Hyamson", "response": ["In 1942 Hyamson published Palestine: A Policy, his work outlining his case against political Zionism and for a 'spiritual Zionism'. He was one of the original members of The Jewish Fellowship, founded on 7 November 1944, to campaign against (political) Zionism from a Jewish perspective. Founding members also included Basil Henriques, Sir Brunel Cohen, Joseph Leftwich, Louis Gluckstein, and Rabbi Israel Mattuck. The fellowship saw political Zionism as damaging the good relations the diaspora had achieved in the country of their birth, and as linked to a moral decline within Jewry. They held that the solution to problems faced by the Jewish community would be found in the revival of religious principles rather than political ones. By 1947, Leftwich felt that Hyamson was trying to turn the Fellowship into an organisation similar to Judah Magnes' Ihud (which sought Jewish-Arab co-operation for a bi-national unitary state).Miller, 2013 pps. 82 & 182"]}, {"page": "Leftwich (surname)", "response": ["*Joseph Leftwich (1892–1983), English writer, poet, critic and translator"]}, {"page": "Young Socialist League", "response": ["Several of the so-called Whitechapel Boys, including John Rodker, Isaac Rosenberg, Joseph Leftwich, Samuel Winsten, Lazarus Aaronson and David Bomberg were among the members of the League."]}, {"page": "Lazarus Aaronson", "response": ["His father emigrated to New York in 1905. The rest of the family followed in 1912, except for 17-year old Lazarus who remained in London. From then on, he lived with the family of Joseph Posener at 292 Commercial Road in the East End of London. At the time, the area was a hub of the Jewish diaspora and at the turn of the 20th century, a quarter of its population were Jews from Central and Eastern Europe. Growing up in the East End, Aaronson was part of a group of friends who are today referred to as the Whitechapel Boys, all of whom were children of Jewish immigrants and shared literary and artistic ambitions. Others in the group who, like Aaronson, later achieved distinction included John Rodker, Isaac Rosenberg, Joseph Leftwich, Stephen Winsten, Clara Birnberg, David Bomberg, and the brothers  Abraham Fineberg and Joseph Fineberg. Aaronson was also involved in the Young Socialist League, where he and other Whitechapel Boys helped organise educational meetings on modern art and radical politics. Aaronson remained a committed socialist throughout adulthood.", "Although much of Aaronson's writings centred on his conversion to Christianity, Jacobs traces a continuing Hebraic mood in his poetry, and wrote that \"his Christianity was hardly familiarly Anglican, and there is in his work an avowed sensuality which could in some ways be compared to that of modern Hebrew poets like Tchernikowsky or Shneur, or later, Avraham Shlonsky.\" According to his friend Joseph Leftwich, Aronson himself in old age acknowledged influences from both traditional Judaism and Martin Buber's unorthodox interpretation of Hasidism."]}, {"page": "Ida Maze", "response": ["She began to write in 1928 in reaction to the death of her eldest son Bernard and these poems made up her first collection, A Mame (, 'A Mother', 1931).  Most of her work would be about or for children.  She went on to publish Lider far kinder (, 'Songs for Children', 1936), Naye lider (, 'New Songs', 1941), and Vakhsn mayne kinderlech (, 'My Children Grow', 1954).  A novel based on her childhood memories, Dineh: Autobiografishe dertseylung (, 'Dina: An Autobiographical Story', 1970), was published posthumously.  She published poems in a number of journals and anthologies, including Yidish amerike ('Yiddish America', edited by Noah Steinberg, 1929) and The Golden Peacock (edited by Joseph Leftwich, 1939).   She also co-edited the journal Heftn from 1935 to 1937."]}, {"page": "Leftwich, Joseph", "response": ["#redirectJoseph Leftwich"]}, {"page": "Joseph Bovshover", "response": ["Bovshover's lifetime concerns about making a living and his egocentrism led to his mental illness. He became depressed and was hospitalized, where he stayed until his death in 1915. His brothers initially withheld the news of his death, formally disclosing it to the public in February 1916. After the Bolshevik Revolution, his work became popular with the emerging Soviet Yiddish press. Throughout 1918, his poetry was featured in Soviet Russia's first Yiddish-language newspaper, Varhayt (Yiddish: װאַרהײַט, \"Truth\"). In 1919, his work also became popular with Britain's anarcho-communist journal, The Spur. At the publication, his poetry was translated into English by Joseph Leftwich. In 1920, his work was included in Moscow's Mut (Yiddish: מוט; \"Courage\"). In 1925, his work was also included in Kharkov's Zamlung (Yiddish: זאַמלונג; \"Collection\"). In 1940, three unknown poems of his were published in New York City for Yidishe kultur (Yiddish: ייִדישע קולטור; \"Jewish culture\") by Kalman Marmor."]}, {"page": "Norman Dinerstein", "response": ["*Songs of Remembrance (Yiddish, translated Joseph Leftwich) for soprano and strings (1976-1979)"]}]}}