{"wiki_id": "http://www.wikidata.org/entity/Q1655371", "itemLabel": "Iain Hamilton", "itemDescription": "Scottish composer", "wikipedia_url": "https://en.wikipedia.org/wiki/Iain_Hamilton_(composer)", "wikipedia_page": {"main": "Iain Ellis Hamilton (6 June 1922 – 21 July 2000) was a Scottish composer.\nHamilton was born in Glasgow, but was educated in London, where he became an apprentice engineer.  He remained in that profession for the next seven years. He undertook the study of music in his spare time. After winning a scholarship to study at the Royal College of Music, which he entered in 1947, he decided to devote himself to a musical career. He earned the Bachelor of Music degree from the University of London and was awarded an honorary Doctorate of Music from the University of Glasgow.\nHamilton moved to the United States in 1962, but died in London, aged 78.", "link_mentions": [{"page": "List of Scots", "response": ["* Iain Hamilton (1922–2000)"]}, {"page": "1959 in music", "response": ["* Iain Hamilton –"]}, {"page": "1956 in music", "response": ["*Iain Hamilton – The Bermudas, Op. 33 (text: Hamilton, Jourdain, A. Marvell), for baritone, chorus, and orchestra"]}, {"page": "English National Opera", "response": ["ENO has commissioned more than a dozen operas by composers including Gordon Crosse, Iain Hamilton, Jonathan Harvey, Alfred Schnittke, Gavin Bryars, David Sawer, Asian Dub Foundation and Nico Muhly. The company's best known world premiere was Peter Grimes in 1945. Subsequent world premieres have included The Mines of Sulphur (1965), The Mask of Orpheus (1986), The Silver Tassie (1999), and works by Malcolm Williamson, Iain Hamilton, David Blake, Robin Holloway, Julian Anderson and Stephen Oliver.Service, Tom  \"Nico Muhly: Strings and stabbings\" , The Guardian, 31 May 2011 British stage premieres include operas by Verdi (Simon Boccanegra, 1948), Janáček (Káťa Kabanová, 1951), Stravinsky (Oedipus rex, 1960), Prokofiev (War and Peace, 1972) and Philip Glass (Akhnaten, 1985, among others)."]}, {"page": "Music of Scotland", "response": ["After World War I, Robin Orr and Cedric Thorpe Davie were influenced by modernism and Scottish musical cadences. Erik Chisholm founded the Scottish Ballet Society and helped create several ballets.M. Gardiner, Modern Scottish Culture (Edinburgh: Edinburgh University Press, 2005), , pp. 193–8. The Edinburgh Festival was founded in 1947 and led to an expansion of classical music in Scotland, leading to the foundation of Scottish Opera in 1960. Important post-war composers included Ronald Stevenson, Francis George Scott, Edward McGuire, William Sweeney, Iain Hamilton, Thomas Wilson, Thea Musgrave, Judith Weir, James MacMillan and Helen Grime. Craig Armstrong has produced music for numerous films. Major performers include the percussionist Evelyn Glennie. Major Scottish orchestras include: Royal Scottish National Orchestra (RSNO), the Scottish Chamber Orchestra (SCO) and the BBC Scottish Symphony Orchestra (BBC SSO). Major venues include Glasgow Royal Concert Hall, Usher Hall, Edinburgh and Queen's Hall, Edinburgh.J. Clough, K. Davidson, S. Randall, A. Scott, DK Eyewitness Travel Guide: Scotland: Scotland (London: Dorling Kindersley, 2012), , p. 108.N. Wilson, Edinburgh (London: Lonely Planet, 2004), , p. 137.J. S. Sawyers, Maverick Guide to Scotland (London: Pelican, 1999), , pp. 176–7."]}, {"page": "BBC Symphony Chorus", "response": ["John Poole was entrusted with the world premiere of David Bedford's Twelve Hours of Sunset in 1975, and at the Alexandra Palace conducted two symphonies by Havergal Brian with the BBC Choral Society (who had already taken part in the giant Gothic Symphony by the same composer in a concert at the Albert Hall). Another first performance, that of Iain Hamilton's Epitaph for this world and time, performed before the traditional Beethoven's Ninth on the penultimate night of the Proms in 1975, proved one of the most complex undertakings of the BBC Choral Society, for the choir was split into three groups, and positioned around the arena in the Albert Hall. Both this, and another 1975 contemporary work, Mortales by Wilfred Josephs, were conducted by John Poole."]}, {"page": "List of compositions for horn", "response": ["*Iain Hamilton"]}, {"page": "The Royal Hunt of the Sun", "response": ["An opera based on the play, with music and libretto by British composer Iain Hamilton, was premièred by ENO at the London Coliseum in 1977."]}, {"page": "List of compositions for violin and orchestra", "response": ["*Iain Hamilton"]}, {"page": "Theodore Presser Company", "response": ["*Iain Hamilton"]}, {"page": "List of operas by composer", "response": ["*Iain Hamilton (1922–2000): Anna Karenina, The Catiline Conspiracy, The Royal Hunt of the Sun"]}, {"page": "Robin Orr", "response": ["After World War II he became a lecturer at Cambridge and a professor at the Royal College of Music, then Gardiner Professor of Music at Glasgow University from 1956 to 1965. While in Glasgow he worked with Alexander Gibson to set up the Musica Viva contemporary music festival, promoting the work of (among others) Stockhausen, Schoenberg, Stravinsky, Iain Hamilton, Thea Musgrave, and Orr himself.Wilson, Conrad. Alex: The Authorised Biography of Sir Alexander Gibson (1993) Gibson also asked Orr to help him form Scottish Opera in 1960, and Orr served as the founding chairman between 1962 and 1976."]}, {"page": "Joan Lippincott", "response": ["Throughout her recital career, Ms. Lippincott has also been recognized for her flair for the contemporary.  She has premiered many significant contemporary organ works, as well as regularly including 20th-century literature on her recital programs.  She has been heard in recital broadcasts of contemporary American music, such as ABC’s Pilgrimage series and The Musical Fund Society of Philadelphia’s presentation of contemporary American music.  She played the American premiere of Malcolm Williamson’s Organ Symphony at the National Cathedral in Washington, DC; the American premiere of Iain Hamilton’s Paraphrase for Organ on Epitaph for This World and Time at the Riverside Church, New York City; and first performances of commissioned works: Epiphanies by Daniel Pinkham at House of Hope Presbyterian Church, St. Paul, MN; Masques d’Afrique for Organ, Trumpet and Percussion by C. Curtis-Smith at the Air Force Academy, CO, at a national convention of The American Guild of Organists; and The Salutation of Gabriel for Organ and Horn by Daniel Pinkham at the Peabody Conservatory at a celebration honoring Karen McFarlane.  In 1952, Ainslee Cox composed Prelude for Organ which he dedicated to Ms. Lippincott."]}, {"page": "Hugh Wood", "response": ["Wood was born in Parbold, Lancashire and grew up in a musical family; while still a teenager, he was encouraged by the composer Alan Bush. He says that his \"earliest enthusiasm was Bach... and that's been at the center of everything ever since.\"In conversation with Robert Worby on BBC Radio 3's Hear and Now program (broadcast 16 June 2012) After military service in Egypt, he studied History at New College, Oxford, where he dedicated much of his time to music and writing compositions for the theatre. In 1954, he moved to London to study composition privately with William Lloyd Webber, Anthony Milner, Iain Hamilton, and Mátyás Seiber. He also started a parallel career as a music teacher by finding work in schools, including Morley College, and as a lecturer at the Royal Academy of Music."]}, {"page": "Dawid Engela", "response": ["The London period was filled with rich musical experiences, including the radio interviews that he conducted with the composers Aaron Copland, Iain Hamilton, Humphrey Searle, John Joubert and others. The first public performances of his compositions date from this period. Well-known South African performers such as Joyce Barker, Betsy De La Porte and Dawie Couzyn were involved. He also organised the entire London production of Bartho Smit's play The Maimed. The performance by the English Stage Society took place on Sunday, 27 November 1960, at the Royal Court Theatre."]}, {"page": "Thomas Hemsley", "response": ["In 1960, Hemsley created the role of Demetrius in Britten's A Midsummer Night's Dream with the English Opera Group at Aldeburgh.  His other work in contemporary opera included his Covent Garden debut in 1970 as Mangus in Tippett's The Knot Garden, Iain Hamilton's opera The Catiline Conspiracy in 1974 at Scottish Opera as Caesar, and the role of Rev Wringhim in Thomas Wilson's opera The Confessions of a Justified Sinner (1976).  In 1965, he was the baritone soloist in only the second UK performance (and only the fourth performance in the work's history) of Delius's Requiem, in Liverpool, under Charles Groves."]}, {"page": "Della Jones", "response": ["In 1977 she joined the English National Opera, where she created the role of Dolly in Iain Hamilton's Anna Karenina in 1981,Dean, Winton (1981). \"Music in London: Anna Karenina\". The Musical Times Vol. 122, No. 1661 (July 1981), p. 487 and the Royal Opera House in 1983, and began appearing abroad, notably in France, Italy, and the United States."]}, {"page": "List of symphony composers", "response": ["*Iain Hamilton (1922–2000), Scottish composer of 4 symphonies plus a symphony for two orchestras and a sinfonia concertante for violin, viola and chamber orchestra"]}, {"page": "1981 in British music", "response": ["*Iain Hamilton - Anna KareninaDean, Winton (1981). \"Music in London: Anna Karenina\". The Musical Times Vol. 122, No. 1661 (July 1981), p. 487. Retrieved 1 December 2010."]}, {"page": "Adaptations of Anna Karenina", "response": ["* 1978: Anna Karenina by Scottish composer Iain Hamilton on his own libretto, premièred by ENO at the London Coliseum in 1981."]}, {"page": "Iain Hamilton", "response": ["Iain Hamilton may refer to:", "*Iain Hamilton (journalist) (1920–1986), editor at the Spectator", "*Iain Hamilton (composer) (1922–2000), Scottish composer", "*Iain Hamilton Grant, British lecturer"]}, {"page": "Frederick Thurston", "response": ["He gave the first performance of new works, including Arnold Bax's Clarinet Sonata, Arthur Bliss's Clarinet Quintet and Gerald Finzi's Clarinet Concerto.  Works dedicated to him include Malcolm Arnold's Clarinet Concerto No 1, Iain Hamilton's Three Nocturnes, Herbert Howells's Clarinet Sonata, John Ireland's Fantasy-Sonata, Gordon Jacob's Clarinet Quintet, Elizabeth Maconchy's Clarinet Concertino #1 and Alan Rawsthorne's Clarinet Concerto."]}, {"page": "Jackson Hill (composer)", "response": ["Hill was a Morehead Scholar at the University of North Carolina at Chapel Hill (Ph.D. in musicology in 1970). A composer from the age of 14, he studied composition with Iain Hamilton at Duke University (1964–66) and Roger Hannay (1967-68). He has served as a visiting scholar and choral assistant at Exeter College, Oxford, and as a Visiting Fellow at Clare Hall, Cambridge University.  He studied Buddhist chant as a Fulbright Fellow in Japan in the 1970s, and traditional Japanese music has been a strong influence in his work."]}, {"page": "Paul Zukofsky", "response": ["While he performed and recorded a broad range of classical music, Zukofsky had little interest in pursuing the typical career of a violin virtuoso and gravitated toward music he felt was underappreciated. As one succinct description puts it: \"From his earliest years he was fascinated by ultramodern music and developed maximal celerity, dexterity, and alacrity in manipulating special techniques, in effect transforming the violin into a multimedia instrument beyond its normal capacities.\"Slonimsky (2001). \"Zukofsky, Paul,\" Baker's Biographical Dictionary of Musicians (9th edn.). New York: Schirmer Books. Vol. 6, p. 4044. .For a lively portrait of Zukofsky and his multi-faceted activities in the late 1960s, see Richard Kostelantz (2004). “Paul Zukofsky (1969),” On Innovative Music(ian)s. Limelight Editions. He is best known for his performances of and collaborations with many of the key composers of contemporary classical music, such as Milton Babbitt, Arthur Berger, Easley Blackwood, Henry Brant, John Cage, Elliott Carter, George Crumb, Morton Feldman, Philip Glass, Peter Mennin, Krzysztof Penderecki, Walter Piston, J. K. Randall, Wallingford Riegger, Giacinto Scelsi, Artur Schnabel, Roger Sessions, Ralph Shapey, Harvey Sollberger, Stefan Wolpe, Charles Wuorinen, and Iannis Xenakis. He gave world premieres of concertos by Roger Sessions (for violin, cello and orchestra), Charles Wuorinen (for amplified violin and orchestra), Morton Feldman (for violin and orchestra), Philip Glass, and the Scottish composer Iain Hamilton, among others."]}, {"page": "List of 20th-century classical composers", "response": ["| Iain Hamilton || 1922 || 2000 || Scottish ||chamber & orchestral works; operas & vocal works ||"]}, {"page": "Southeastern Composers League", "response": ["The League traces it existence to the Alabama Composers' League, founded in 1950 by Gurney Kennedy and Paul Newell. Southeastern Composers League History  It celebrated its 50th anniversary in 2001.  The organization remained headquartered at the University of Alabama until 1980, when a new structure and revised constitution was adopted. Southeastern Composers League Constitution Guest composers who have been invited to the SCL Forum include Roy Harris, William Bergsma, Wayne Barlow, Ross Lee Finney, Peter Mennin, Bernard Wagenaar, Norman Dello Joio, Lukas Foss, Vincent Persichetti, Robert Palmer, Burrill Phillips, Wallingford Riegger, Ernst Krenek, Henry Cowell, Milton Babbitt, Alvin Etler, Iain Hamilton, Robert Ward, Roque Cordero, Carlos Chavez and Harrison Birtwistle. Southeastern Composers League History The fiftieth anniversary meeting was held at the University of Alabama. Southeastern Composers League History The sixtieth anniversary meeting, March 14-15, 2011, marked the first time the Forum has ever been held at North Carolina State University. 60th SCL Forum CVNC 60th SCL Forum NCSU Other recent instances of the event have been held at the University of Tennessee at Chattanooga, at Louisiana Tech, and the University of North Carolina-Greensboro."]}, {"page": "1959 in British music", "response": ["*Iain Hamilton – Sinfonia, for two orchestras"]}, {"page": "Margaret Kitchin", "response": ["Margaret Kitchin (23 March 1914 – 16 June 2008) was a classical pianist, born in Switzerland but long resident in the United Kingdom. She was strongly associated with contemporary music and gave many premieres, including works by Michael Tippett, Iain Hamilton, Peter Racine Fricker, Alexander Goehr, Thea Musgrave, Priaulx Rainier, Elizabeth Maconchy, Don Banks, Alan Bush and Kenneth Leighton. She gave over 200 BBC recitals between 1949 and 1980."]}, {"page": "Lois McDonall", "response": ["In 1970, McDonall became a resident artist at the Sadler's Wells Opera (now the English National Opera). She appeared on short notice in the title role of Handel's Semele when the lead soprano became ill during the first act.Dean, Winton, \"Review\" (Music in London),  The Musical Times 116.1590 (Aug. 1975): 723. JSTOR. Accessed 10 December 2008. During that season, McDonall sang many performances of Constanze in The Abduction from the Seraglio by Mozart. In following seasons she performed Fiordiligi from Così fan tutte, the Countess in Le nozze di Figaro, Roselinda in Die Fledermaus, Antonia in The Tales of Hoffmann, Leonora in Il trovatore, Freia in Das Rheingold, Hanna in The Merry Widow, the title role in Massenet's Manon, Marschallin in Der Rosenkavalier, Violetta in La traviata, Miss Jessel in The Turn of the Screw and she created the title role in Iain Hamilton's Anna Karenina.", "==Iain Hamilton and other contemporary music premieres==", "Lois McDonall has premiered the works of several composers. Among these, most notably is the British Composer, Iain Hamilton. He wrote a few pieces specifically for her voice. These include the opera Anna Karenina, which was commissioned by the English National Opera in 1978; the Passion According to St. Mark's, commissioned by the London Chorale in 1982; and Cleopatra, a dramatic Scena for Soprano which was premiered by the BBC Symphony Orchestra at the 1978 Proms.Conway, Paul, Iain Hamilton (1922-2000), on musicweb-international.com. Accessed 17 December 2008  Lois McDonall also created the role of Mrs. Medlock in Stephen McNeff's The Secret Garden for the COMUS Music Theatre in 1985."]}, {"page": "List of compositions for viola: F to H", "response": ["* Iain Hamilton (1922–2000)"]}, {"page": "New York Philomusica Chamber Ensemble", "response": ["The centerpiece of the ensemble’s current activities is their annual concert series in New York City and the parallel series in nearby Rockland County, New York. The group emphasizes its Featured Composer program, which provides commissions for new works and features the work of contemporary composers. Former Featured Composers include Dr. Iain Hamilton, Jacob Druckman, and John Harbison. Michael Berkeley has been the current Featured Composer since 2005."]}, {"page": "1976 in British music", "response": ["*Iain Hamilton - Tamberlaine (radio)"]}, {"page": "Trumpet repertoire", "response": ["*Iain Hamilton, Circus for two trumpets and orchestra"]}, {"page": "Guy Jonson", "response": ["Guy Jonson adjudicated at music festivals throughout Britain and Ireland and gave piano recitals all around the world. After retiring from the Royal Academy he continued to teach privately. Among his distinguished pupils were Pianists Dimitris Sgouros, Martin Jones, Angela Lear, Julian Saphir and Philip Smith and the composers Sir John Tavener and Iain Hamilton."]}, {"page": "List of people associated with the Royal Academy of Music", "response": ["* Iain Hamilton (composer)"]}, {"page": "David Hillman", "response": ["He also created roles in the world premières of operas by Thea Musgrave, Iain Hamilton, Malcolm Williamson (The Violins of Saint-Jacques), Stephen Paulus and, most notably, Richard Rodney Bennett's The Mines of Sulphur. British stage premières included King Roger (1975, for the New Opera Company) and Saul and David (1977, for University College Opera).  He sang Sinon in a hitherto unstaged episode in Part 1 (La prise de Troie) of Les Troyens for Opera North in 1986."]}, {"page": "List of historical opera characters", "response": ["* Iain Hamilton: The Royal Hunt of the Sun", "* Iain Hamilton: The Tragedy of Macbeth", "* Iain Hamilton: Tamberlaine"]}, {"page": "John Lubbock (conductor)", "response": ["Lubbock founded the Orchestra of St John's Smith Square in 1967. He led the orchestra on tours to Italy, Spain, Germany, Belgium and the USA. He also appeared with them at the Bulgarian, Bratislava and Turku festivals in the 1980s, and in a Southern Television programme with the Labèque sisters. In August 1985 he and the orchestra took part in the premiere of Iain Hamilton’s opera Lancelot."]}, {"page": "Anna Karenina (Hamilton)", "response": ["Anna Karenina is an opera in three acts by Scottish composer Iain Hamilton. The libretto, based on Leo Tolstoy's 1877 novel, Anna Karenina was written by the composer. Anna Karenina was premiered on May 7, 1981, at the London Coliseum by the English National Opera in a performance conducted by Howard Williams with Lois McDonall in the title role.Dean, Winton (1981). \"Music in London: Anna Karenina\". The Musical Times Vol. 122, No. 1661 (July 1981), p. 487. Retrieved 1 December 2010. The director was Colin Graham and the designers were Ralph Koltai and Annena Stubbs. Its running time is approximately two and a quarter hours.Theodore Presser Company. Iain Hamilton: Works . Retrieved 1 December 2010.", "Anna Karenina was the fifth of Hamilton's ten operas.Friedberg, Ruth C. and Morris, Francis J.. \"Hamilton, Iain (Ellis)\". Grove Dictionary of Music and Musicians via Grove Music Online. Retrieved 1 December 2010 . Conrad Wilson in his 2000 obituary for the composer wrote that \"inside Hamilton there was always a romantic composer struggling to get out ... it finally exploded in Anna Karenina, a poignantly Mahlerian treatment of Tolstoy's novel.\"Wilson, Conrad (August 5, 2000). \"Obituary: Iain Hamilton\". The Herald (Glasgow). Retrieved 1 December 2010. Hamilton composed Anna Karenina, a commission from English National Opera, in 1978, and published the score in 1979. It was first staged on May 7, 1981, by ENO in a production directed by Colin Graham with sets by Ralph Koltai and costumes by Anena Stubbs. Anna Karenina had its American premiere on March 16, 1983, at the Wilshire Ebell Theatre in Los Angeles and ran for three nights under the baton of Chris Nance. It was staged by the now defunct Los Angeles Opera Theatre in a production using screen projections as backdrops rather than traditional sets.Central Opera Service Bulletin, Vol. 24, No. 2 (Fall/Winter 1982). \"New Operas and Premieres\" p. 6. Retrieved 1 December 2010. It is not known whether the opera has had any subsequent performances. The American composer David Carlson also wrote an opera, premiered in 2007, based on the Tolstoy's novel; the libretto of his Anna Karenina was written by Colin Graham, the director of the 1981 production of Hamilton's version."]}, {"page": "Donald Bell", "response": ["In 1961 Bell toured Israel and in 1963 he toured the USSR. He moved to Düsseldorf in 1964, where he worked for the next three years as a resident artist at the Deutsche Oper am Rhein. At that opera house he sang such roles as Amfortas in Parsifal, Count Almaviva in The Marriage of Figaro, Kurwenal in Tristan und Isolde, Méphistophélès in Faust, Wolfram in Tannhäuser, and the title role in Don Giovanni among others. In 1973 he performed the role of Alfred in the British premiere of Gottfried von Einem's Der Besuch der alten Dame at the Glyndebourne Festival. The following year he sang the part of Catiline in the premiere of Iain Hamilton's The Catiline Conspiracy at the Scottish Opera."]}]}}