{"wiki_id": "http://www.wikidata.org/entity/Q165657", "itemLabel": "Princess Beatrice", "itemDescription": "elder daughter of Prince Andrew, Duke of York, and Sarah Ferguson", "wikipedia_url": "https://en.wikipedia.org/wiki/Princess_Beatrice", "wikipedia_page": {"main": "Princess Beatrice, Mrs Edoardo Mapelli Mozzi (Beatrice Elizabeth Mary; born 8 August 1988) is a member of the British royal family. She is the elder daughter of Prince Andrew, Duke of York, and Sarah, Duchess of York. Born fifth in line of succession to the British throne, she is now tenth. She has a younger sister, Princess Eugenie.\nBorn in Portland Hospital, London, Beatrice attended St George's School, Ascot, before studying at Goldsmiths College, graduating with a bachelor's degree in history. She was briefly employed at the Foreign Office and Sony Pictures before joining software company Afiniti as Vice President of Strategic Partnerships. Beatrice also works privately with a number of charitable organisations, including the Teenage Cancer Trust and Outward Bound.\nShe married Edoardo Mapelli Mozzi, a property developer, in 2020. Their daughter Sienna Elizabeth was born on 18 September 2021.\n\n", "link_mentions": [{"page": "British royal family", "response": ["The monarchical head of state of the United Kingdom and 14 other Commonwealth realms is Queen Elizabeth II. She is the head of the royal family. She has four children, eight grandchildren, and twelve great-grandchildren. The Lord Chamberlain's \"List of the Royal Family\" mentions all of George VI's descendants and their spouses (including Sarah, Duchess of York, who is divorced), along with the Queen's cousins with royal rank and their spouses. The Lord Chamberlain's list applies for the purposes of regulating the use of royal symbols and images of the family. Meanwhile, the website of the royal family provides a list of \"Members of the Royal Family\"; those listed correspond to the royal family members mentioned and pictured below, with the exception of Princess Beatrice, Princess Eugenie, and the Duchess of Kent. The royal family's guidelines on greeting a member of the royal family say they should first be greeted with \"Your Royal Highness\". The status of Royal Highness is restricted to children of a monarch, male-line grandchildren of a monarch, the children of the eldest child of the Prince of Wales, and their wives.", "*Other members of the royal family with royal rank who do not carry out official duties are Prince Andrew, Duke of York; Prince Harry, Duke of Sussex; Meghan, Duchess of Sussex; Princess Beatrice; Princess Eugenie; Katharine, Duchess of Kent; and Prince and Princess Michael of Kent."]}, {"page": "Queen Elizabeth The Queen Mother", "response": ["|| Prince Andrew, Duke of York || Princess BeatricePrincess Eugenie"]}, {"page": "Queen Victoria", "response": ["According to one of her biographers, Giles St Aubyn, Victoria wrote an average of 2,500 words a day during her adult life.Hibbert, p. xv; St Aubyn, p. 340 From July 1832 until just before her death, she kept a detailed journal, which eventually encompassed 122 volumes.St Aubyn, p. 30; Woodham-Smith, p. 87 After Victoria's death, her youngest daughter, Princess Beatrice, was appointed her literary executor. Beatrice transcribed and edited the diaries covering Victoria's accession onwards, and burned the originals in the process.Hibbert, pp. 503–504; St Aubyn, p. 30; Woodham-Smith, pp. 88, 436–437 Despite this destruction, much of the diaries still exist. In addition to Beatrice's edited copy, Lord Esher transcribed the volumes from 1832 to 1861 before Beatrice destroyed them.Hibbert, p. 503 Part of Victoria's extensive correspondence has been published in volumes edited by A. C. Benson, Hector Bolitho, George Earle Buckle, Lord Esher, Roger Fulford, and Richard Hough among others.Hibbert, pp. 503–504; St Aubyn, p. 624", "| Princess Beatrice"]}, {"page": "Prince Andrew, Duke of York", "response": ["Andrew served in the Royal Navy as a helicopter pilot and instructor and as the captain of a warship. During the Falklands War, he flew on multiple missions including anti-surface warfare, casualty evacuation, and Exocet missile decoy. In 1986, he married Sarah Ferguson and was created Duke of York. They have two daughters, Princess Beatrice and Princess Eugenie. Their marriage, separation in 1992, and divorce in 1996 attracted extensive media coverage. Andrew served as the UK's Special Representative for International Trade and Investment for 10 years until July 2011.", "Andrew was the first child born to a reigning monarch since the birth in 1857 of Queen Victoria's youngest child, Princess Beatrice. As with his older siblings, Andrew was looked after by a governess, who was responsible for his early education at Buckingham Palace. He was sent to Heatherdown School near Ascot in Berkshire. In September 1973, he entered Gordonstoun, in northern Scotland, which his father and elder brother had also attended. While there, he spent six months—from January to June 1977—participating in an exchange programme to Lakefield College School in Canada. He left Gordonstoun in July two years later with A-Levels in English, History, and Economics.", "| Princess Beatrice of York || 8 August 1988 || 17 July 2020 || Edoardo Mapelli Mozzi || Sienna Mapelli Mozzi"]}, {"page": "Sarah, Duchess of York", "response": ["In 2016, Sarah collaborated with British contemporary artist Teddy McDonald and her daughters, Princess Beatrice and Princess Eugenie, to create the first Royal contemporary painting. Titled Royal Love, it was painted on the lawn of Royal Lodge and features positive thoughts and quotes by Sarah and the princesses. The painting was exhibited in London at the Masterpiece Art Fair, Chelsea in June/July 2016 and later auctioned at private dinner. The proceeds from the sale of the painting were donated by McDonald to the charity Children in Crisis. British GQ magazine published an exclusive on the creation of the painting. In 2017, Sarah was joined by her daughter Eugenie to mark the second anniversary of the Teenage Cancer Trust unit at Alder Hey Children's Hospital.", "Sarah had a producing role (credited as \"Sarah Ferguson\") in the 2009 Jean-Marc Vallée film The Young Victoria, starring Emily Blunt and featured a background player role for Sarah's daughter Princess Beatrice. It was Sarah who conceived the idea for a film based upon the early years of Queen Victoria. Since her marriage to Prince Andrew, she had been interested in the Queen, and had written two books about her with the help of a historian. The Victoria-Albert relationship in particular drew her into the queen's history, as she believed there were parallels between their marriage and her own with Prince Andrew, as they both \"fought for their love\" in the midst of public scrutiny.", "| Princess Beatrice of York || 8 August 1988 || 17 July 2020 || Edoardo Mapelli Mozzi || Sienna Mapelli Mozzi"]}, {"page": "Princess Margaret of Connaught", "response": ["Princess Margaret was born at Bagshot Park and baptised in the Private Chapel of Windsor Castle on 11 March 1882 by the Archbishop of Canterbury. Her godparents were Queen Victoria (her paternal grandmother); the German Emperor (her maternal great-granduncle, who was represented by the German Ambassador, Count Münster); the German Crown Princess (her paternal aunt, who was represented by her sister, Princess Christian of Schleswig-Holstein); Prince and Princess Friedrich Karl of Prussia (her maternal grandparents, for whom her paternal uncle the Duke of Edinburgh and aunt Princess Beatrice of the United Kingdom stood proxy); the Duchess of Cambridge (who was represented by Princess Louise, Duchess of Argyll); the Prince of Wales (her paternal uncle) and Prince Charles of Prussia (represented by Prince Leopold, Duke of Albany). She was known as \"Daisy\" to her family."]}, {"page": "Princess Eugenie", "response": ["Princess Eugenie, Mrs Jack Brooksbank ( ; Eugenie Victoria Helena; born 23 March 1990) is a member of the British royal family. She is the younger daughter of Prince Andrew, Duke of York, and Sarah, Duchess of York. At birth, she was 6th in the line of succession to the British throne and is now 12th. She is the younger sister of Princess Beatrice."]}, {"page": "Mountbatten-Windsor", "response": ["***(10) 15px Princess Beatrice, Mrs Edoardo Mapelli Mozzi (b. 1988)", "| Princess Beatrice of York and Edoardo Mapelli Mozzi"]}, {"page": "Philip Treacy", "response": ["In 1989, Treacy was discovered and then mentored by fashion editor Isabella Blow, whom Treacy described as the \"biggest inspiration\" on his life. Blow would wear and promote Treacy's designs at important fashion events and helped Treacy to break into some of the main fashion houses, particularly Chanel and Givenchy. Treacy is associated with celebrities such as Lady Gaga, Madonna, and Sarah Jessica Parker. He has been associated with British royalty and has designed hats for royal occasions, including the fascinator (or \"pretzel hat\") worn by Princess Beatrice in 2011.", "Treacy's hats are also associated with English royalty, with thirty-six worn at the wedding of Prince William and Catherine Middleton, including the controversial fascinator-style hat worn by Princess Beatrice of York (pictured). This so-called \"pretzel hat\" was auctioned for charity by Princess Beatrice on eBay for $130,000 (£80,100) on 22 May 2011. Treacy felt the criticism regarding the \"pretzel hat\" was extreme (the hat had its own Facebook page with over 140,000 connections), and in July 2011 said: \"In the future, we'll look back and think she looked wild\". In a July 2018 Desert Island Discs interview on BBC Radio 4, Treacy said of the backlash to his design: \"There was a moment where I thought I would find myself with my head on a spike outside the Tower of London\". The hat is stored at the Metropolitan Museum of Art."]}, {"page": "Royal coat of arms of the United Kingdom", "response": ["| style=\"text-align:center;\"|Princess Beatrice, Mrs Edoardo Mapelli Mozzi"]}, {"page": "Princess Alexandra, The Honourable Lady Ogilvy", "response": ["The Princess was baptised in the Private Chapel of Buckingham Palace, on 9 February 1937, and her godparents were King George VI and Queen Elizabeth (her paternal uncle and aunt); the Queen of Norway (her grand-aunt); Princess Nicholas of Greece and Denmark (her maternal grandmother); Princess Olga of Yugoslavia (her maternal aunt); the Princess Beatrice (her paternal great-grand-aunt); the Earl of Athlone (her paternal grand-uncle); and Count Karl Theodor of Törring-Jettenbach (her maternal uncle by marriage). Of her godparents, only the King and Queen and Lord Athlone were present.Yorkshire Post and Leeds Intelligencer. 10 February 1937."]}, {"page": "Royal Standard of the United Kingdom", "response": ["|rowspan=\"2\"|Princess Beatrice"]}, {"page": "Princess Alice, Countess of Athlone", "response": ["She was christened in the Private Chapel of Windsor Castle on 26 March 1883, named Alice after her late paternal aunt. Her godparents were: Queen Victoria (her paternal grandmother); the German Empress (for whom Alice's paternal aunt Princess Beatrice stood proxy); the King of the Netherlands (her mother's brother-in-law, for whom the Dutch Ambassador Count Charles van Bylandt stood proxy); the Grand Duke of Hesse and by Rhine (her paternal aunt's widower, whose brother-in-law the Duke of Edinburgh represented him); the Princess of Waldeck and Pyrmont (her maternal grandmother); the Prince of Wales (her paternal uncle); the German Crown Princess (her paternal aunt, whose sister-in-law the Princess of Wales represented her); Prince Wilhelm of Württemberg (her mother's brother-in-law, for whom his cousin the Duke of Teck stood proxy); the Hereditary Princess of Bentheim and Steinfurt (her maternal aunt, for whom her paternal aunt Princess Christian stood proxy); and the Duchess of Cambridge (her grandmother's aunt, whose daughter the Duchess of Teck represented her). She was confirmed at the Royal Memorial Church of St George, Cannes, in 1898 with Queen Victoria present."]}, {"page": "Princess Louise, Duchess of Argyll", "response": ["Louise spent her last years at Kensington Palace, occupying rooms next to her sister Princess Beatrice. She made occasional public appearances with the royal family, such as at the Cenotaph at Whitehall on 11 November 1925. However, her health deteriorated. In 1935, she greeted her nephew, King George V, and his wife, Queen Mary, at Kensington Town Hall during their Silver Jubilee celebrations, and was made an Honorary Freeman of the Borough of Kensington. Her last public appearance occurred in 1937, at the Home Arts and Industries Exhibition. Between these occasions, her great nephew, King Edward VIII, abdicated on 11 December 1936. In December 1936, Louise wrote to the British prime minister, Stanley Baldwin, sympathising with him about the crisis.", "* Princess Beatrice, 1864. Marble, 55.0 x 29.0 x 23.0 cm. Royal Collection Trust, RCIN 53351."]}, {"page": "Princess Helena of the United Kingdom", "response": ["Helena was educated by private tutors chosen by her father and his close friend and adviser, Baron Stockmar. Her childhood was spent with her parents, travelling between a variety of royal residences in Britain. The intimate atmosphere of the royal court came to an end on 14 December 1861, when her father died and her mother entered a period of intense mourning. Afterwards, in the early 1860s, Helena began a flirtation with Prince Albert's German librarian, Carl Ruland. Although the nature of the relationship is largely unknown, Helena's romantic letters to Ruland survive.Chomet, p. 6 After the Queen found out in 1863, she dismissed Ruland, who returned to his native Germany. Three years later, on 5 July 1866, Helena married the impoverished Prince Christian of Schleswig-Holstein. The couple remained in Britain, in calling distance of the Queen, who liked to have her daughters nearby. Helena, along with her youngest sister, Princess Beatrice, became the Queen's unofficial secretary. However, after Queen Victoria's death on 22 January 1901, Helena saw relatively little of her surviving siblings, including King Edward VII."]}, {"page": "Princess Beatrice of the United Kingdom", "response": ["Princess Beatrice of the United Kingdom,  (Beatrice Mary Victoria Feodore; 14 April 1857 – 26 October 1944), later Princess Henry of Battenberg, was the fifth daughter and youngest child of Queen Victoria and Prince Albert. Beatrice was also the last of Queen Victoria's children to die, 66 years after the first, her elder sister Alice.", "left|thumb|Queen Victoria holding Princess Beatrice in 1862", "Princess Beatrice was born on 14 April 1857 at Buckingham Palace, London.Dennison, p. 2 She was the fifth daughter and youngest of the nine children of the reigning British monarch, Queen Victoria, and her husband, Prince Albert of Saxe-Coburg and Gotha (later the Prince Consort). The birth caused controversy when it was announced that Queen Victoria would seek relief from the pains of delivery through the use of chloroform administered by Dr John Snow. Chloroform was considered dangerous to mother and child and was frowned upon by the Church of England and the medical authorities.Dennison, p. 3 Queen Victoria was undeterred and used \"that blessed chloroform\" for her last pregnancy.Longford, (Victoria R. I.), p. 234 A fortnight later, Queen Victoria reported in her journal, \"I was amply rewarded and forgot all I had gone through when I heard dearest Albert say 'It's a fine child, and a girl!'\"Quoted in Dennison, p. 3 Albert and Queen Victoria chose the names Beatrice Mary Victoria Feodore: Mary after Princess Mary, Duchess of Gloucester, the last surviving child of King George III of the United Kingdom; Victoria after the Queen; and Feodore after Feodora, Princess of Hohenlohe-Langenburg, the Queen's older half-sister. She was baptised in the private chapel at Buckingham Palace on 16 June 1857. Her godparents were the Duchess of Kent (maternal grandmother); the Princess Royal (eldest sister); and the Prince Frederick of Prussia (her future brother-in-law).Dennison, p. 8", "left|upright|thumb|Princess Beatrice in 1868", "Beatrice and Henry were married at Saint Mildred's Church at Whippingham, near Osborne,Beatrice and her siblings were confirmed here on 23 July 1885. Beatrice, who wore her mother's wedding veil of Honiton lace, was escorted by the Queen and Beatrice's eldest brother, the Prince of Wales.Dennison, pp. 152–153 Princess Beatrice was attended by ten royal bridesmaids from among her nieces: Princesses Louise (18), Victoria and Maud of Wales; Princesses Irene and Alix of Hesse and by Rhine; Princesses Marie, Victoria Melita and Alexandra of Edinburgh; and Princesses Helena Victoria and Marie Louise of Schleswig-Holstein. The bridegroom's supporters were his brothers, Prince Alexander of Bulgaria and Prince Francis Joseph of Battenberg.", "right|thumb|Princess Beatrice with her mother, Queen Victoria", "Princess Beatrice, who was Governor of the Isle of Wight from 1896 until her death in 1944, was also President of the Frank James Memorial Hospital at East Cowes, from 1903 until her death. ", "Her presence at court further decreased as she aged. Devastated by the death of her favourite son, Maurice, during the First World War in 1914, she began to retire from public life.Dennison, p. 245 In response to war with Germany, George V changed the name of the royal house from Saxe-Coburg and Gotha to Windsor and at the same time adopted it as the family surname, to downplay their German origins. Subsequently, Beatrice and her family renounced their German titles; Beatrice stopped using the style Princess Henry of Battenberg, reverting to only using her birth style, HRH The Princess Beatrice. Her sons gave up their style, Prince of Battenberg. Alexander, the eldest, became Sir Alexander Mountbatten and was later given the title Marquess of Carisbrooke in the Peerage of the United Kingdom. Her younger son, Leopold, became Lord Leopold Mountbatten and was given the rank of a younger son of a marquess. He was a haemophiliac, having inherited the \"royal disease\" from his mother, and died during a knee operation in 1922 one month short of his 33rd birthday.", "thumb|right|upright|Princess Beatrice in later life", "*14 April 1857 – 23 July 1885: Her Royal Highness The Princess Beatrice", "*23 July 1885 – 14 July 1917: Her Royal Highness The Princess Beatrice, Princess Henry of Battenberge.g. ", "*17 July 1917 – 26 October 1944: Her Royal Highness The Princess Beatricee.g. ", "|style=\"text-align: center;\" |Princess Beatrice's coat of arms (1858–1917)", "*Aspinall-Oglander, C. F., \"Princess Beatrice (1857–1944)\", Dictionary of National Biography (archive), Oxford University Press, 1959; accessed 26 December 2007", "*Princess Beatrice letter, MSS SC 1247 at L. Tom Perry Special Collections, Harold B. Lee Library, Brigham Young University"]}, {"page": "Louise, Princess Royal", "response": ["Louise and her sisters, Maud and Victoria, were bridesmaids at the wedding of their paternal aunt Princess Beatrice to Prince Henry of Battenberg in 1885."]}, {"page": "Princess Victoria of the United Kingdom", "response": ["In 1885, Victoria was a bridesmaid at the wedding of her aunt Princess Beatrice to Prince Henry of Battenberg. She was also a bridesmaid at the wedding of her brother George, Duke of York and Victoria Mary of Teck, the future King and Queen of the United Kingdom."]}, {"page": "St James's Palace", "response": ["St James's Palace is still a working palace, and the Royal Court is still formally based there, despite the monarch residing elsewhere. It is also the London residence of Princess Anne, Princess Beatrice, and Princess Alexandra. The palace is used to host official receptions, such as those of visiting heads of state, and charities of which members of the royal family are patrons. It forms part of a sprawling complex of buildings housing Court offices and officials' apartments. The immediate palace complex includes York House, the former home of the Prince of Wales and his sons, Princes William and Harry. Lancaster House, located next door, is used by HM Government for official receptions, and the nearby Clarence House, the former home of the Queen Mother, is now the residence of the Prince of Wales. The palace also served as the official residence of Princess Eugenie until April 2018."]}, {"page": "Order of precedence in England and Wales", "response": ["The order of precedence accorded to women of the royal family differs depending on whether or not they are accompanied by a husband who is of higher precedence by birthright. Thus two tables are given below: the first outlines the order of precedence for women of the royal family when unaccompanied by a more senior ranking spouse. The second shows the order of precedence when female members of the royal family are joined by their spouses of the blood Royal. This is done because when unaccompanied, blood relations of the sovereign are always accorded higher precedence than those who are married in. For example, when not accompanied by the Prince of Wales, Camilla, Duchess of Cornwall, ranks after Princess Alexandra, The Honorable Lady Ogilvy; when with him, she ranks above all women other than the reigning sovereign and any queens dowager. The same goes for spouses of the Queen's grandsons and their positioning with the Queen's granddaughters. For example, as a Princess of the blood Royal, Princess Beatrice of York outranks Catherine, Duchess of Cambridge if Catherine is unaccompanied by Prince William, Duke of Cambridge.", "|  HRH Princess Beatrice, Mrs Edoardo Mapelli Mozzi", "|  HRH Princess Beatrice, Mrs Edoardo Mapelli Mozzi"]}, {"page": "Order of precedence in Scotland", "response": ["##Princess Beatrice, Mrs Edoardo Mapelli Mozzi"]}]}}