{"wiki_id": "http://www.wikidata.org/entity/Q1659500", "itemLabel": "David Young", "itemDescription": "Bishop of Ripon; British Anglican bishop (1931-2008)", "wikipedia_url": "https://en.wikipedia.org/wiki/David_Young_(bishop)", "wikipedia_page": {"main": "David Nigel de Lorentz Young  (2 September 1931 – 10 August 2008) was the last Bishop of Ripon before the diocese became Ripon and Leeds. At his appointment at the age of 46 he was the youngest diocesan bishop of the Church of England.He was a supporter of women priests, but opposed to active homosexual priests and same-sex marriages. He had special knowledge of Eastern religions (especially Buddhism) and languages, which he used in his interfaith work, and was particularly concerned with education.", "link_mentions": [{"page": "Wycliffe Hall, Oxford", "response": ["* David Young (1958–1959) - 11th Bishop of Ripon"]}, {"page": "David Young", "response": ["* David Young (Canadian playwright) (born 1946), Canadian playwright and novelist", "* David Young (novelist) (born 1958), British novelist", "* David Young (judge), daytime court television show judge in Miami", "* Judge David Young, daytime court television show", "* David Young (TV producer), British game show producer", "* David Young (Neighbours), fictional character on Australian soap opera Neighbours", "* David Young, founding editor of the Farmers' Almanac, 1818", "* David Young, writer and actor for CollegeHumor web site", "* David Young (saxophonist, 1912-1992), American jazz tenor saxophonist", "* David Young (musician) (active from 1990), American recorder musician", "* David Young (composer), American video game music composer", "* David Young (Labour politician) (1930–2003), British Labour Party MP, 1974–1997", "* David Young, Baron Young of Graffham (born 1932), British politician and Cabinet minister from the 1980s", "* David Young (Ontario politician) (born 1957), Canadian politician in Ontario", "* David Young (Watergate) (born 1936), member of a covert ops team under U.S. President Richard Nixon", "* David Young (Iowa politician) (born 1968), former member of the U.S. House of Representatives", "* David Young (North Carolina politician) (born 1959), businessman and Chairman of the North Carolina Democratic Party", "* David Young III (1905–1977), American politician in New Jersey", "*David Young (Louisiana politician), state senator (African American officeholders during and following the Reconstruction era)", "* David Young (footballer, born 1945), English footballer for Newcastle, Sunderland, Charlton, and Southend in the 1970s", "* David Young (Australian footballer) (born 1954), Australian rules footballer for South Melbourne and Collingwood", "* David Young (footballer, born 1965), English footballer for Darlington in the 1980s", "* David Young (gridiron football) (born 1979), defensive back selected in the 2003 NFL Draft", "* David Young (swimmer) (1907–1988), American Olympic swimmer", "* David Young (wrestler) (born 1972), American professional wrestler", "* David Young (cricketer) (born 1977),  English cricketer", "* David Young (basketball) (born 1981), drafted by the Seattle SuperSonics", "* David Young (hurler) (born 1985), Irish sportsperson", "* David Young (rower), English rower", "* David Young (bishop) (1931–2008), British Anglican bishop; Bishop of Ripon", "* David Young (cleric) (1844–1913), Wesleyan minister and historian", "* David Young (British Army officer) (1926–2000), General Officer Commanding Scotland", "* David Young (bomber), former policeman who took hostages at an elementary school in Cokeville, Wyoming, 1986"]}, {"page": "Diocese of Ripon", "response": ["In a process which began with commission recommendations in 1989 and in 1997,Archvied included Diocesan Synod on 20 June 1998,Archived General Synod approval in November 1998 and royal assent in May 1999, the diocese was renamed 'The Diocese of Ripon and Leeds' in order to reflect the demographic importance of Leeds within its boundaries; the name change to effect on 3 September 1999, the day after David Young's retirement as bishop. The diocesan bishop's residence and offices and the diocesan offices were based in Leeds, while the cathedral remained Ripon Cathedral; after 1999, the diocese was known as Ripon and Leeds diocese, or, less often, Ripon diocese. The central importance of Leeds to the area was further recognised in the eventual creation of the new Diocese of Leeds."]}, {"page": "David nigel de lorentz young", "response": ["#REDIRECT David Young (bishop) "]}, {"page": "Deaths in August 2008", "response": ["*David Young, 76, British Bishop of Ripon (1977–1999)."]}, {"page": "Bishop Young Church of England Academy", "response": ["Bishop Young Church of England Academy (formerly known as David Young Community Academy) is a state-funded academy sponsored by the Church of EnglandBishop Young Academy  School Prospectus in Seacroft, Leeds, West Yorkshire, England.", "The school was named after David Young (1931–2008) a former Bishop of Ripon. The academy is named in recognition of Bishop David Young's extensive work in education both nationally and in the Leeds area. The school was established on 18 September 2006 with pupils from Agnes Stewart Church of England High School and Braim Wood for Boys High School.Yorkshire Post 10 January 2008 Before the building of the Academy the largest secondary school in Seacroft was the nearby East Leeds High School (formerly Foxwood School), which was demolished in December 2009.", "The school was divided into six houses: Brunel (after Isambard Kingdom Brunel); Da Vinci (after Leonardo da Vinci); Hadid (after Zaha Hadid); Hopper (after Grace Hopper); Telford (after Thomas Telford); and Whittle (after Frank Whittle).(old houses when it was known as David Young)", "It was renamed from David Young Community Academy to Bishop Young Academy in 2017.", "In the last full Ofsted inspection of David Young Community Academy inspectors  rated it inadequate in all four assessment criteria. Further to this they found that 'Leaders of the school and the academy trust have failed to fulfil legislative requirements relating to safeguarding and to health and safety'."]}, {"page": "David Nigel de Lorentz Young", "response": ["#REDIRECT David Young (bishop)"]}, {"page": "Mark Sowerby", "response": ["Sowerby was made a deacon in the Church of England at Petertide (28 June) 1987 by David Young, Bishop of Ripon, during a service at Ripon Cathedral. He was ordained a priest the Petertide following (3 July 1988) by Malcolm Menin, Bishop of Knaresborough. His first posts were curacies at Knaresborough and Darwen after which he was Vicar of Accrington then Vocations Officer and Selection Secretary in The Ministry Division."]}, {"page": "Archdeacon of Huntingdon and Wisbech", "response": ["*1975–1977 (res.): David YoungTelegraph Obituary – David Young"]}, {"page": "Andrew Nunn", "response": ["Nunn was ordained in the Church of England, made a deacon in 1983 during a service at Ripon Cathedral. He was ordained a priest at Petertide 1984 (1 July) by David Young, Bishop of Ripon, at Ripon Cathedral. Between 1983 and 1987, he served his curacy at St James the Great, Manston, Leeds. He was then chaplain of Agnes Stewart Church of England High SchoolAgnes Stewart High Schoolweb site  and curate then vicar at (All Saints') Richmond Hill."]}, {"page": "List of School of Oriental and African Studies people", "response": ["*David Young, Bishop of Ripon 1977–1999"]}, {"page": "St Mark's Church, Harrogate", "response": ["The church was restored in 1997 and re-opened by David Young, Bishop of Ripon."]}]}}