{"wiki_id": "http://www.wikidata.org/entity/Q1655389", "itemLabel": "Iain Weaver", "itemDescription": "English boxer", "wikipedia_url": "https://en.wikipedia.org/wiki/Iain_Weaver", "wikipedia_page": {"main": "Iain Weaver (born 17 January 1990) is an English professional boxer who turned professional in May 2012. Prior to turning professional he was fighting in the 57 kg Featherweight category. He was a member of the England elite squad as well as the Great British podium squad and won silver at the 2010 European Amateur Boxing Championships in Moscow. Gold at commonwealths games India. Weaver turned professional having not been given the chance at Olympic qualifiers for GB Olympic Squad for the 2012 Summer Olympics in London.", "link_mentions": [{"page": "2010 European Amateur Boxing Championships", "response": ["| Iain Weaver"]}, {"page": "June 2010 in sports", "response": ["**Featherweight:  Denis Makarov   Iain Weaver   Sergey Kunitsyn   Tyrone McCullough "]}, {"page": "GB Amateur Boxing Championships", "response": ["The 2011 GB Amateur Boxing Championships were staged at York Hall, London on 11 and 12 November 2011. The most hotly anticipated bout going into the second GB Championships was in the flyweight division between Welshman Andrew Selby and Khalid Yafai of England. After both boxers had got past the quarter-final stage of 2011 World Amateur Boxing Championships in Baku one month previous, it meant they would have to box off for a place at the 2012 Summer Olympics if neither boxer took gold in Azerbaijan, and Selby missed that achievement by the narrowest of margins in the final, losing 13:12. The pair met on 11 November for the first of a scheduled three fights to decide which boxer would secure Olympic qualification, with Selby recording a convincing 26:12 victory. On 12 November it was reported that Yafai had pulled out of their next encounter because he couldn't make the weight, thus granting the Welshman Olympic qualification and denying Yafai of a second Olympic Games. In other bouts, Warren Baister claimed gold with an impressive win in the 91 kg final. Salisbury ABC's Sam Maxwell earned a hard-fought 16:14 win over Wales' Joe Cordina who had beaten tournament favorite Iain Weaver the previous day. Another Liverpool boxer, Anthony Fowler beat Kieran Smith 15:9, and his conqueror of last year's championships, Callum Smith won at the 75 kg division. In the female contest, Amanda Coulsen beat Chantelle Cameron in a competitive bout, Natasha Jonas who denied Coulson of gold last year did not enter, neither did Olympians Tom Stalker, Anthony Joshua and Luke Campbell. BBC once again broadcast the event on BBC One and betting operator Betfair sponsored Team GB."]}, {"page": "England at the 2010 Commonwealth Games (B–R)", "response": ["| Iain Weaver"]}, {"page": "England Boxing National Amateur Championships Featherweight Champions", "response": ["|2009 || Iain Weaver|| (Golden Ring)"]}]}}