{"wiki_id": "http://www.wikidata.org/entity/Q1655637", "itemLabel": "Ian Steedman", "itemDescription": "British economist", "wikipedia_url": "https://en.wikipedia.org/wiki/Ian_Steedman", "wikipedia_page": {"main": "Ian Steedman (born 1941, in London) was for many years a professor of economics at the University of Manchester before moving down the road to Manchester Metropolitan University. He retired from there at the end of 2006, but was appointed as an emeritus professor.\n\n", "link_mentions": [{"page": "David Ricardo", "response": ["After the rise of the 'neoclassical' school, Ricardo's influence declined temporarily. It was Piero Sraffa, the editor of the Collected Works of David RicardoPiero Sraffa and M.H. Dobb, editors (1951–1973). The Works and Correspondence of David Ricardo. Cambridge University Press, 11 volumes. and the author of seminal Production of Commodities by Means of Commodities,Sraffa, Piero 1960, Production of Commodities by Means of Commodities: Prelude to a Critique of Economic Theory. Cambridge University Press. who resurrected Ricardo as the originator of another strand of economic thought, which was effaced with the arrival of the neoclassical school. The new interpretation of Ricardo and Sraffa's criticism against the marginal theory of value gave rise to a new school, now named neo-Ricardian or Sraffian school. Major contributors to this school include Luigi Pasinetti (1930–), Pierangelo Garegnani (1930–2011), Ian Steedman (1941–), Geoffrey Harcourt (1931–), Heinz Kurz (1946–), Neri Salvadori (1951–), Pier Paolo Saviotti (–) among others. See also Neo-Ricardianism. The Neo-Ricardian school is sometimes seen to be a component of Post-Keynesian economics.", "Inspired by Piero Sraffa, a new strand of trade theory emerged and was named neo-Ricardian trade theory. The main contributors include Ian Steedman and Stanley Metcalfe. They have criticised neoclassical international trade theory, namely the Heckscher–Ohlin model on the basis that the notion of capital as primary factor has no method of measuring it before the determination of profit rate (thus trapped in a logical vicious circle). This was a second round of the Cambridge capital controversy, this time in the field of international trade. Depoortère and Ravix judge that neo-Ricardian contribution failed without giving effective impact on neoclassical trade theory, because it could not offer \"a genuine alternative approach from a classical point of view.\"Christophe Depoortère, Joël Thomas Ravix 2015 The classical theory of international trade after Sraffa. Cahiers d'économie Politique / Papers in Political Economy (69): 203–34, February 2015."]}, {"page": "Minimum wage", "response": ["The argument that a minimum wage decreases employment is based on a simple supply and demand model of the labor market. A number of economists (for example Pierangelo Garegnani, Robert L. Vienneau, and Arrigo Opocher & Ian Steedman), building on the work of Piero Sraffa, argue that that model, even given all its assumptions, is logically incoherent. Michael Anyadike-Danes and Wynne Godley argue, based on simulation results, that little of the empirical work done with the textbook model constitutes a potentially falsifiable theory, and consequently empirical evidence hardly exists for that model. Graham White argues, partially on the basis of Sraffianism, that the policy of increased labor market flexibility, including the reduction of minimum wages, does not have an \"intellectually coherent\" argument in economic theory. "]}, {"page": "Transformation problem", "response": ["it follows from Sraffa’s result that there is generally no function from E_i to P_i, as was made explicit and elaborated upon by later writers, notably Ian Steedman in Marx after Sraffa."]}, {"page": "Econophysics", "response": ["Econophysics has nothing to do with the \"physical quantities approach\" to economics, advocated by Ian Steedman and others associated with neo-Ricardianism. Notable econophysicists are Jean-Philippe Bouchaud, Bikas K Chakrabarti, J. Doyne Farmer, Tiziana Di Matteo, Diego Garlaschelli, Dirk Helbing, János Kertész, Rosario N. Mantegna, Matteo Marsili, Joseph L. McCauley, Enrico Scalas, Didier Sornette, H. Eugene Stanley, Victor Yakovenko and Yi-Cheng Zhang.  Particularly noteworthy among the formal courses on econophysics is the one offered by Diego Garlaschelli at the Physics Department of the Leiden University. From September 2014 King's College has awarded the first position of Full Professor in Econophysics (Tiziana Di Matteo)."]}, {"page": "Labour power", "response": ["It has been argued by Ian Steedman that Marx's own concept of labour power was in truth very similar to that of David Ricardo and Adam Smith and, therefore, that Marx was not saying anything really new. However, Marx's interpretation is (as he himself said) different from the \"natural price of labour\" of the classical political economists, because the \"free play of market forces\" does not gravitate spontaneously and automatically toward the \"natural price\" (the value) of labour power. Precisely because labour power is a unique and peculiar commodity, being lodged in the living worker, it does not conform to all the same laws as other kinds of commodities. Depending on social conditions, labour power may durably trade at prices well above, or below, its real value. Marx only assumed that labour power traded at its value, in order to show that even if that was the case, the worker was still economically exploited. But he was well aware that often labour power did not trade at its value, either because of unfavourable wage-bargaining conditions or because of labour scarcity.", "*Ian Steedman, \"Marx on Ricardo\", in: Ian Bradley and Michael Howard (eds), Classical and Marxian Political Economy—Essays in honour of Ronald L. Meek\". London: Macmillan, 1982."]}, {"page": "Neo-Ricardianism", "response": ["Prominent neo-Ricardians are usually held to include Pierangelo Garegnani, Krishna Bharadwaj, Luigi Pasinetti, Joan Robinson, John Eatwell, Fernando Vianello, Murray Milgate, Ian Steedman, Heinz D. Kurz, Neri Salvadori, Bertram Schefold, Fabio Petri, Massimo Pivetti, Franklin Serrano, Fabio Ravagnani, Roberto Ciccone, Sergio Parrinello, Alessandro Roncaglia, Maurice Dobb, Gilbert Abraham-Frois, Theodore Mariolis and Giorgio Gilibert."]}, {"page": "Law of value", "response": ["In Das Kapital Marx normally thinks of the quantity of labour that determines product-value as the ratio between the average total amount of labour-time required to produce a reproducible good, and the corresponding average amount of labour required to produce a unit of gold (see also gold standard).Ian Steedman, \"Marx and Ricardo\", in: Ian Bradley and Michael Howard, Classical and Marxian Political Economy: Essays in honour of Ronald L. Meek. London: Macmillan, 1982, p. 120. Already in 1844, long before he wrote Das Kapital, Marx was very aware of credit money. Whereas \"commodity money\" (coinage or bullion) played an important role in the earlier stages of capitalist development, the growth of integrated capital markets meant increased use of credit money. Marx felt that the initial assumption of gold-money as a standard of value was justified, in analysing the capitalist relations of production and distribution. Thus, as follows:", "While Marx used the concept of the law of value in his works Grundrisse, A Contribution to the Critique of Political Economy, Theories of Surplus Value and Das Kapital, he did not explicitly formalise its full meaning in a mathematical sense, and therefore how it should be exactly defined remains to some extent a controversial topic in Marxian economics. Different economists dispute how the proportionality between exchange-value and labour-time should be mathematically understood or modeled, and about the measures which are relevant.See e.g. Ian Steedman et al., The Value Controversy. London: Verso, 1981; John Weeks, Capital and exploitation. Edward Arnold, 1981; Ernest Mandel, and Alan Freeman (eds.), Ricardo, Marx, Sraffa, The Langston Memorial Volume, London: Verso, 1984  ; Makoto Itoh, The Basic Theory of Capitalism; Ulrich Krause, Money and Abstract Labour: On the Analytical Foundations of Political Economy. Translated by Peter Burgess. Edited by Jon Rothschild. London: Verso 1982; Alan Freeman, Andrew Kliman, Julian Wells (eds.), The new value controversy and the foundations of economics. Cheltenham: Edward Elgar, 2004; Simon Mohun (ed.), Debates in Value Theory. Macmillan: London, 1994; Richard Westra & Alan Zuege (eds.), Value and the world economy today - Production, Finance and Globalization. Houndmills: Palgrave Macmillan, 2003. Alfredo Saad-Filho, The value of Marx: political economy for contemporary capitalism. London: Routledge, 2002; Ajit Sinha, Theories of Value from Adam Smith to Piero Sraffa. London: Routledge, 2010; Gerard Dumenil & Dominique Levy online archive  ", "The result of the difficulties in explaining economic value and its sources is that value becomes something of a mystery, and that how the attribution of value really occurs is no longer clear. The three relationships mentioned become mixed up, and are confused with each other, in commercial and economic discourse, and it appears that things and assets acquire an independent power to create value, even although value is a human attribution. Marx refers to this as commodity fetishism or thingification (Verdinglichung or reification) which culminates in what he calls fictitious capital. Value then seems to appear spontaneously out of trading activity. He regards this perception as an inevitable effect of commercial practice, since it involves the circumstance that objects acquire a value which exists independently of the valuer, a value \"set by the state of the market\" which individuals normally cannot change and must adjust to. The end result is that value theory is banished from economics as a useless metaphysics, surviving only in the form of assumptions made about price behaviour. Because money-prices offer convenient quantifiable and generally applicable units of economic value, no further inquiry into value is deemed necessary.Ian Steedman thus argued value theory was unnecessary, since everything can be stated in terms of prices. See: Ian Steedman, Marx after Sraffa. London: NLB, 1977."]}, {"page": "Criticism of Marxism", "response": ["Critics who have alleged that Marx has been proved internally inconsistent include former and current Marxian and/or Sraffian economists, such as Paul Sweezy,\"Only one conclusion is possible, namely, that the Marxian method of transformation [of commodity values into prices of production] is logically unsatisfactory.\" Paul M. Sweezy, 1970 (1942), The Theory of Capitalist Development, p. 15. New York: Modern Reader Paperbacks. Nobuo Okishio,Nobuo Okishio, 1961, \"Technical Changes and the Rate of Profit,\" Kobe University Economic Review 7, pp. 85–99. Ian Steedman,\"[P]hysical quantities ... suffice to determine the rate of profit (and the associated prices of production) .... [I]t follows that value magnitudes are, at best, redundant in the determination of the rate of profit (and prices of production).\" \"Marx’s value reasoning – hardly a peripheral aspect of his work – must therefore be abandoned, in the interest of developing a coherent materialist theory of capitalism.\" Ian Steedman, 1977, Marx after Sraffa, pp. 202, 207. London: New Left Books John Roemer,\"[The falling-rate-of-profit] position is rebutted in Chapter 5 by a theorem which states that ... competitive innovations result in a rising rate of profit. There seems to be no hope for a theory of the falling rate of profit within the strict confines of the environment that Marx suggested as relevant.\" John Roemer, Analytical Foundations of Marxian Economic Theory, p. 12. Cambridge: Cambridge Univ. Press, 1981. Gary MongioviVulgar Economy in Marxian Garb: A Critique of Temporal Single System Marxism, Gary Mongiovi, 2002, Review of Radical Political Economics 34:4, p. 393. \"Marx did make a number of errors in elaborating his theory of value and the profit rate .... [H]is would-be Temporal Single System defenders ... camouflage Marx’s errors.\" \"Marx’s value analysis does indeed contain errors.\" (abstract) and David Laibman,\"An Error II is an inconsistency, whose removal through development of the theory leaves the foundations of the theory intact. Now I believe that Marx left us with a few Errors II.\" David Laibman, \"Rhetoric and Substance in Value Theory\" in Alan Freeman, Andrew Kliman and Julian Wells (eds.), The New Value Controversy and the Foundations of Economics, Cheltenham, UK: Edward Elgar, 2004, p. 17 who propose that the field be grounded in their correct versions of Marxian economics instead of in Marx's critique of political economy in the original form in which he presented and developed it in Capital.See Andrew Kliman, Reclaiming Marx's \"Capital\": A Refutation of the Myth of Inconsistency, esp. pp. 210–11."]}, {"page": "Steedman", "response": ["*Ian Steedman (born 1941), professor of economics in Manchester, England"]}, {"page": "List of socialist economists", "response": ["* Ian Steedman"]}, {"page": "The Theory of Capitalist Development", "response": ["The political scientist David McLellan called Sweezy's work the best modern continuation of Marx's economic ideas.McLellan 1995. p. 439. The Marxist theorist Ernest Mandel accused Sweezy of several misunderstandings of Marx, including confusing prices of production and market prices, a mistake he saw as a result of Sweezy's employment of the work of Ladislaus von Bortkiewicz,Mandel 1991. p. 27. a critic of Marx.Mandel 1974. p. 301. Mandel compared Sweezy's misunderstandings of Marx to those later made by economist Ian Steedman in his Marx after Sraffa (1977).Mandel 1991. p. 9."]}, {"page": "Marx After Sraffa", "response": ["Marx after Sraffa is a 1977 book about Marxist economics by the economist Ian Steedman, in which the author argues against the labor theory of value. Steedman has been criticized for alleged misunderstandings of Karl Marx.", "Category:Books by Ian Steedman"]}, {"page": "Cambridge capital controversy", "response": ["\"These findings destroy, for example, the general validity of Heckscher-Ohlin-Samuelson international trade theory (as authors such as Sergio Parrinello, Stanley Metcalfe, Ian Steedman, and Lynn Mainwaring have demonstrated), of the Hicksian neutrality of technical progress concept (as Steedman has shown), of neoclassical tax incidence theory (as Steedman and Metcalfe have shown), and of the Pigouvian taxation theory applied in environmental economics (as Gehrke and Lager have shown).\" (Gehrke and Lager 2000)"]}, {"page": "Marxian economics", "response": ["Among the critics pointing out internal inconsistencies are former and current Marxian and/or Sraffian economists, such as Paul Sweezy,\"Only one conclusion is possible, namely, that the Marxian method of transformation [of commodity values into prices of production] is logically unsatisfactory.\"  Paul M. Sweezy, 1970 (1942), The Theory of Capitalist Development, p. 15. New York: Modern Reader Paperbacks. Nobuo Okishio,Nobuo Okishio, 1961, \"Technical Changes and the Rate of Profit,\" Kobe University Economic Review 7, pp. 85–99. Ian Steedman,\"[P]hysical quantities ... suffice to determine the rate of profit (and the associated prices of production) .... [I]t follows that value magnitudes are, at best, redundant in the determination of the rate of profit (and prices of production).\" \"Marx’s value reasoning––hardly a peripheral aspect of his work––must therefore be abandoned, in the interest of developing a coherent materialist theory of capitalism.\" Ian Steedman, 1977, Marx after Sraffa, pp. 202, 207. London: New Left Books. John Roemer,\"[The falling-rate-of-profit] position is rebutted in Chapter 5 by a theorem which states that ... competitive innovations result in a rising rate of profit.  There seems to be no hope for a theory of the falling rate of profit within the strict confines of the environment that Marx suggested as relevant.\" John Roemer, Analytical Foundations of Marxian Economic Theory, p. 12. Cambridge: Cambridge Univ. Press, 1981. Gary Mongiovi, and David Laibman,\"An Error II is an inconsistency, whose removal through development of the theory leaves the foundations of the theory intact. Now I believe that Marx left us with a few Errors II.\" David Laibman, \"Rhetoric and Substance in Value Theory\" in Alan Freeman, Andrew Kliman, and Julian Wells (eds.), The New Value Controversy and the Foundations of Economics, Cheltenham, UK: Edward Elgar, 2004, p. 17 who propose that the field be grounded in their correct versions of Marxian economics instead of in Marx's critique of political economy in the original form in which he presented and developed it in Capital.See Andrew Kliman, Reclaiming Marx's \"Capital\": A Refutation of the Myth of Inconsistency, esp. pp. 210–11."]}, {"page": "Criticism of value-form", "response": ["The criticism most often heard from the critics of Marx, such as Friedrich von Hayek, Karl Popper, Francis Wheen and Ian Steedman is that, even if Marx himself meant well, Marx's value-form idea is simply an esoteric obscurantism, \"dialectical hocus pocus\", \"sophistry\", or \"mumbo jumbo\". Francis Wheen refers to \"a shaggy-dog story, a picaresque journey through the realms of higher nonsense.\"Francis Wheen, Marx's Das Kapital: a biography. Grove Press, 2008, p. 42. See also Francis Wheen, Karl Marx. London: Fourth Estate, 1999, p. 299f. Mark Blaug stated that \"the reader will miss little by skipping the pedantic third section of Chapter I\".Mark Blaug, Economic Theory in Retrospect. Cambridge: Cambridge University Press, 1996, p. 256.", "In a 1975 paper subtitled \"Was Marx's Journey Really Necessary?\", the influential Marxian economist Ronald L. Meek argued that Marx's value theory had become redundant, because all economic relationships can be described and explained in terms of prices.Ronald L. Meek, \"From values to prices: was Marx's journey really necessary?\". In: Ronald L. Meek, Smith, Marx and after. Ten essays in the development of economic thought. London: Chapman & Hall, 1997, pp. 120-133. Indeed, what Marx calls \"value\" can be regarded simply as a kind of \"theoretical price\". In this interpretation, the conclusion drawn is that Marx's value theory really adds nothing much to the economic arguments, and is therefore probably best abandoned.Ian Steedman, Marx after Sraffa. London: NLB, 1977; Marco Lippi, Value and naturalism in Marx. London: New Left Books, 1979, p. 132; Pierangelo Garegnani, \"Value and distribution in the classical economists and Marx.\" Oxford Economic Papers, Vol. 36, Issue 2, June 1984, pp. 291-325.", "There was no systematic critique of price theory, and almost no attempt to connect the \"transformation problem\" controversy to the socialist calculation debate. When, in his neo-Ricardian attack on Marx's value theory, Ian Steedman simply disregarded all market prices altogether (all prices in Steedman's models are purely hypothetical production pricesIan Steedman, Marx after Sraffa. London: NLB, 1977, p. 20.), there was no objection from the Marxist camp, although there were plenty of other criticisms.Anwar Shaikh pointed out in 2016 (in his Capitalism, p. 237) that \"by focusing on prices of production throughout\", Sraffa \"avoids the transformation problem inherent in his own analysis\"."]}]}}