{"wiki_id": "http://www.wikidata.org/entity/Q1655960", "itemLabel": "Ibrahim Mohammad Bahr Alolom", "itemDescription": "Iraqi politician (born 1954)", "wikipedia_url": "https://en.wikipedia.org/wiki/Ibrahim_Mohammad_Bahr_al-Ulloum", "wikipedia_page": {"main": "Ibrahim Mohammad Bahr al-Ulloum (born 1954) is an Iraqi politician, academician, and petroleum expert. He has served twice as the Iraqi Minister of Oil. He first took the ministerial role as part of the cabinet appointed by the Interim Iraq Governing Council in September 2003 until June 2004. Dr Ibrahim went on to serve a second term as the minister in 2005 where he then submitted his resignation in protest against a governmental decision to increase the price of oil products by five folds. Ibrahim is the son of Sayid Mohammad Bahr al-Ulloum\nDr Ibrahim was educated in the United States, earning a Ph.D. in Petroleum Engineering from the New Mexico Tech. He previously worked for the Kuwaiti Oil Ministry after graduating from the University of Baghdad in BSc Petroleum Engineering. He worked for the Petroleum Recovery Research Center in New Mexico, and later as an oil and gas consultant in London, United Kingdom.\nDr Ibrahim ran for parliament by forming his own independent political group, the Future Iraq Grouping. He was elected as a member of the National Iraqi Assembly in 2005, and was elected for another term as a member of parliament from 2014 - 2018. He was a member of the Oil & Energy Parliamentary committee where he headed the committee in forming the legislation for the Iraqi National Oil Company Law. The law was passed in March 2018.  \nHe is a founding member of the Alalamain Institute for Higher Education. The first and only private higher education institute specialising in law and political science for postgraduate studies in Iraq. Dr Ibrahim is the chairman of the Iraqi Energy Academy, a scientific establishment whose mission is to develop human resources for the energy sector through the process of training and qualification.\nDr Ibrahim also founded the Bahr al-Ulloum Forum for Dialogue, a unique political forum established in 2010 to promote dialogues, discussions and strategies for the political future of Iraq between the highest authorities, foreign diplomats, and the Iraqi elite. Dr Ibrahim is the chairman of the Bahr al-Uloom Award Foundation; that aims to stimulate scientific research and encourage researchers to advance the scientific and cultural contribution and creativity in the fields of medicine, agriculture, energy and sustainable development.\nIbrahim survived an assassination attempt in Iraq in 2003 and another in 2005.", "link_mentions": []}}