{"wiki_id": "http://www.wikidata.org/entity/Q1653797", "itemLabel": "Jeremy Gilley", "itemDescription": "British actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Jeremy_Gilley", "wikipedia_page": {"main": "Jeremy Francis Gilley (born 1969) is an English actor, filmmaker and founder of the nonprofit organisation Peace One Day.", "link_mentions": [{"page": "Jude Law", "response": ["In 2002, Law directed a Respect for Animals anti-fur cinema commercial, titled \"Fur and Against\". It used music composed by Gary Kemp, and included appearances by Law, Chrissie Hynde, Moby, George Michael, Danny Goffey, Rhys Ifans, Sadie Frost, Helena Christensen, Sir Paul McCartney, Melanie C, and Stella McCartney.\"New Nationwide Anti-Fur Commercial\" , Respect for Animals, press release, 19 February 2002. \"Fur and Against\"  on YouTube, added 6 December 2006. Retrieved 7 January 2009. In July 2007, he and Jeremy Gilley were in Afghanistan over a period of ten days to document peace commitments and activities there for an upcoming film and for marking the UN International Day of Peace.Charlie Rose. \"A Conversation with Actor Jude Law\" . The Charlie Rose Show, WNET (New York), broadcast 19–20 October 2007, streaming video posted 22 October 2007. Retrieved 3 March 2008.Roshan Khadivi. \"International Day of Peace ...\"  UNICEF. Official home page, 20 September 2007. Retrieved 21 November 2007. Accompanied by UNICEF Representative Catherine Mbengue, they travelled and filmed in dangerous areas of eastern Afghanistan with a film crew, interviewing children, government ministers, community leaders and UN officials.\"Peace One Day\" . Official home page. Retrieved 19 November 2007.\"American Actor Jude Law Promotes Peace Day During Afghan Travels\" . Embassy of Afghanistan, Washington, D.C., Official home page. Retrieved 7 September 2008. They also filmed at schools and visited various UNICEF-supported programmes inside and outside the capital Kabul.\"Peace One Day Ambassador Jude Law's 'secret' Mission to Afghanistan\" . UNICEF, Official home page, 18 July 2007. Retrieved 21 November 2007.Fiona Cummins. \"Jude's Afghan Mission\" . Daily Mirror. 12 September 2007. The efforts of Peace One Day are coordinated in celebration of the annual International Day of Peace, on 21 September.\"Afghanistan: Press briefing, 11 September 2007\" . United Nations Assistance Mission in Afghanistan (UNAMA). 11 September 2007.Cf. \"Peace One Day Concert\" , Royal Albert Hall. home.i-concerts.com. 21 September 2007. The film, named The Day After Peace, premiered at the Cannes Film Festival.Anita Singh. \"Cannes Film Festival: Jude Law's peace campaign\". The Daily Telegraph. 19 May 2008. Retrieved 20 May 2008.Mark Brown.", "On 30 August 2008, Law and Gilley returned to Afghanistan to help keep a momentum around Peace Day. They met President Hamid Karzai, top NATO and UN officials, and members of the aid community. They also screened the new documentary about the efforts in support of peace. The documentary features activities that took place throughout Afghanistan in 2007. It also highlights support from UNICEF and the WHO for the peaceful immunisation of 1.4 million children against polio in insecure areas.Roshan Khadivi. \"Actor Jude Law and director Jeremy Gilley in Afghanistan to promote peace\" . UNICEF. Official home page. 3 September 2008. Retrieved 7 September 2008.\"UNICEF Special Reports\" . UNICEF. Official home page, video linked. Retrieved 7 September 2008.\"Karzai meets British actor Jude Law\" . AFP. 4 September 2008. Retrieved 7 September 2008.\"Jude Law says: give peace a chance\" . The Sunday Times. 14 September 2008. Retrieved 25 September 2008. In 2011, Law joined street protests against Alexander Lukashenko and his brutal crackdown on the Belarusian democracy movement."]}, {"page": "Edward Fox (actor)", "response": ["He has two grandchildren through his daughters: Harry Grenfell from Lucy's marriage to David Grenfell, and Rose Gilley from Emilia's relationship with actor Jeremy Gilley."]}, {"page": "Peace One Day", "response": ["Peace One Day is a non-profit organisation whose objective is to institutionalise the International Day of Peace. It was founded in 1999 by British documentary filmmaker and actor Jeremy Gilley.", "In 1999 Jeremy Gilley desired there be one single day when all countries vowed not to wage war: a worldwide ceasefire and day of non-violence. He established Peace One Day. The United Nations had already declared the third Tuesday of September the International Day of Peace,A/RES/36/67, 30 November 1981 Peace One Day aimed to resolve the confusion on which calendar day it fell, and on 7 September 2001, the United Nations General Assembly unanimously adopted a resolution formally establishing the UN International Day of Peace an annual Peace Day of global ceasefire and non-violence on 21 September.", "Currently, Jeremy Gilley and his organisation are focused upon institutionalising the International Day of Peace.", "In 2007, Jeremy Gilley and Peace One Day Ambassador Jude Law travelled to Jalalabad and Kabul to meet with representatives from the United Nations, the Afghan government, and other organisations. They initiated a campaign alongside WHO, UNICEF, and the Ministry of Public Health, which resulted in providing 1.4 million children with the monovalent P3 polio vaccine in southern Afghanistan and selected areas in eastern Afghanistan.", "In 2014, Peace One Day made history by taking over Goma Airport in the Democratic Republic of the Congo to hold a major concert, produced by Jude Law and Jeremy Gilley, headlined by five-time Grammy Award-nominated recording artist Akon with regional artists Lexxus Legal, Detty Darba and Sango’A, and Congolese traditional drummers and dancers. In an historic first, the airport hosted this major event that united more than 50,000 people, celebrating the hope for peace on Peace Day, 21 September.", "In 2015, Peace One Day held a celebration in Rwanda on Peace Day 21 September, produced by Jude Law and Jeremy Gilley. On the day they were joined by the African Children's Choir, Knowless, Innoss'B, Urban Boys, KREST CREW, Jabba Junior, as well as artists who contributed to One, the #PeaceDay Anthem by Coke Studio Africa: Zwai Bala, Maurice Kirya, Ice Prince, Alikiba, Wangechi and Dama do Bling.", "On Peace Day 21 September 2016, Peace One Day hosted 17 live broadcasts on their Facebook page. Produced by Jude Law and Jeremy Gilley, and hosted by Ahmad Fawzi, including contributions from Maher Nasser and Melissa Fleming. In 2016 it is estimated that 2.2 billion people were exposed to the Peace Day message, 940 million were fully aware of the day, resulting in around 16 million behaving more peacefully (McKinsey & Co).", "In 2019, Jeremy Gilley and Jude Law produced the Peace One Day 20th Anniversary Celebration at the Shakespeare's Globe Theatre, London. With music from Sting, Emeli Sandé, Jack Savoretti, Basement Jaxx, Will Young and Citizens of the World Choir, and dramatic performances from Jude Law, Sir Mark Rylance and Emily Watson.", "On Peace Day 21 September 2020, Jeremy Gilley and Jude Law produced the Peace One Day Live Global Digital Experience, sponsored by Avon, Lipton and Microsoft. It was 12 hours of online broadcast, featuring speakers, actors, musicians and live action from around the world. With music from, Yusuf/Cat Stevens, Annie Lennox, Emeli Sandé, Jack Savoretti, Basement Jaxx and Jesse Royal. With readings from Jude Law, Dia Mirza, Sir Mark Rylance, Emily Watson, Bella Ramsey, Forest Whitaker and Zoe Kravitz.", "Peace One Day in association with the Office of the United Nations High Commissioner for Human Rights have produced the Anti-Racism Live Global Digital Experience on 21 March 2021, on the International Day for the Elimination of Racial Discrimination. Produced and Directed by Jeremy Gilley. The event featured speakers, actors, musicians and live interviews from around the world. With music from, Youssou N’dour, Mica Paris, Jack Savoretti, Zwai Bala, Emmanuel Jal, Izzy Bizu, Jesse Royal, Madame Gandhi, Popcaan. With readings from, Monique Coleman, Hakeem Kae-Kazim and Nathalie Emmanuel.", "Since 2019, Peace One Day Productions have been making films for Avon, telling stories of gender-based violence survivors. These films are directed and produced by Jeremy Gilley.", "Impact Profile was launched at the Oxford Union, Oxford University, UK on Sunday 14 October 2018, by founder Jeremy Gilley and Peace One Day Ambassador Jude Law,Oxford Union, Peace One Day, 14 October 2018. Retrieved 3 January 2019. along with the President of the Oxford Union, Stephen Horvath. Notable attendants included Professor Kalypso Nicolaidis and Oxford's Lord Mayor Cook.Jude Law Announces New Peace One Day App, 14 October 2018. Retrieved 3 January 2019.", "*Interview with Jeremy Gilley - founder of Peace One Day"]}, {"page": "The StoryTeller (TV series)", "response": ["This episode stars Jeremy Gilley as Perseus, Frances Barber as Medusa, John McEnery as King Polydectus, Kate Buffery as Danaë, Tony Vogel as Diktys, Arthur Dignam as King Acrisius, and Pat Roach as Atlas. The Gracea are played by Barbara Barnes, Justine Glenton, and Tacy Kneale"]}, {"page": "Emilia Fox", "response": ["Following her separation from Harris, Fox began a relationship with actor Jeremy Gilley, and in May 2010 it was reported that Fox was pregnant with their child. In November 2010, Fox gave birth to a daughter named Rose. They split up in 2011."]}, {"page": "Barry Foster (actor)", "response": ["* Succubus (1987, TV Movie) (horror film with Lynsey Baxter, Pamela Salem, Jeremy Gilley) – Mike"]}, {"page": "Gilley", "response": ["* Jeremy Gilley (born 1969), British actor turned film-maker and founder of the non-profit organization Peace One Day"]}, {"page": "Wateler Peace Prize", "response": ["| Peace One Day and its founder Jeremy Gilley"]}, {"page": "Robin Fox family", "response": ["::*Emilia Fox (born 1974), actress, was married to actor Jared Harris (2005–2009). She also had a relationship with the actor Jeremy Gilley with whom she had one child."]}, {"page": "Storyville (TV series)", "response": ["| Documentary charting filmmaker Jeremy Gilley's attempts to establish a Day of Peace."]}, {"page": "LennonOno Grant for Peace", "response": ["*Jeremy Gilley"]}, {"page": "TEDxBermuda", "response": ["* Jeremy Gilley - Peace One Day founder"]}]}}