{"wiki_id": "http://www.wikidata.org/entity/Q165709", "itemLabel": "Princess Eugenie", "itemDescription": "younger daughter of Prince Andrew, Duke of York, and Sarah, Duchess of York", "wikipedia_url": "https://en.wikipedia.org/wiki/Princess_Eugenie", "wikipedia_page": {"main": "Princess Eugenie, Mrs Jack Brooksbank ( YOO-zhə-nee; Eugenie Victoria Helena; born 23 March 1990) is a member of the British royal family. She is the younger daughter of Prince Andrew, Duke of York, and Sarah, Duchess of York. At birth, she was 6th in the line of succession to the British throne and is now 12th. She is the younger sister of Princess Beatrice.\nBorn in Portland Hospital, London, Eugenie attended St George's School and Marlborough College before studying at Newcastle University, graduating with a bachelor's degree in English literature and history of art. She joined the auction house Paddle8 before taking a directing position at art gallery Hauser & Wirth. Eugenie also works privately with a number of charitable organisations, including Children in Crisis and Anti-Slavery International.\nEugenie married Jack Brooksbank, a brand ambassador, in 2018. Their son August was born in February 2021.\n\n", "link_mentions": [{"page": "Prince Harry, Duke of Sussex", "response": ["In May 2012, Harry's cousin Princess Eugenie introduced him to Cressida Bonas, an actress and model who is the granddaughter of Edward Curzon, 6th Earl Howe. On 30 April 2014, it was reported that the couple had parted amicably."]}, {"page": "October 12", "response": ["*2018 – Princess Eugenie marries Jack Brooksbank at St. George's Chapel, Windsor Castle."]}, {"page": "British royal family", "response": ["The monarchical head of state of the United Kingdom and 14 other Commonwealth realms is Queen Elizabeth II. She is the head of the royal family. She has four children, eight grandchildren, and twelve great-grandchildren. The Lord Chamberlain's \"List of the Royal Family\" mentions all of George VI's descendants and their spouses (including Sarah, Duchess of York, who is divorced), along with the Queen's cousins with royal rank and their spouses. The Lord Chamberlain's list applies for the purposes of regulating the use of royal symbols and images of the family. Meanwhile, the website of the royal family provides a list of \"Members of the Royal Family\"; those listed correspond to the royal family members mentioned and pictured below, with the exception of Princess Beatrice, Princess Eugenie, and the Duchess of Kent. The royal family's guidelines on greeting a member of the royal family say they should first be greeted with \"Your Royal Highness\". The status of Royal Highness is restricted to children of a monarch, male-line grandchildren of a monarch, the children of the eldest child of the Prince of Wales, and their wives.", "*Other members of the royal family with royal rank who do not carry out official duties are Prince Andrew, Duke of York; Prince Harry, Duke of Sussex; Meghan, Duchess of Sussex; Princess Beatrice; Princess Eugenie; Katharine, Duchess of Kent; and Prince and Princess Michael of Kent."]}, {"page": "Queen Elizabeth The Queen Mother", "response": ["|| Prince Andrew, Duke of York || Princess BeatricePrincess Eugenie"]}, {"page": "Prince Philip, Duke of Edinburgh", "response": ["On 3 April 2018, Philip was admitted to King Edward VII's Hospital for a planned hip replacement, which took place the next day. This came after the Duke missed the annual Maundy and Easter Sunday services. On 12 April, his daughter, Princess Anne, spent about 50 minutes in the hospital and afterwards said her father was \"on good form\". He was discharged the following day. On 19 May, six weeks later, he attended the wedding of his grandson Prince Harry to Meghan Markle and was able to walk with the Queen unaided. That October, he accompanied the Queen to the wedding of their granddaughter Princess Eugenie to Jack Brooksbank, with The Telegraph reporting that Philip works on a \"wake up and see how I feel\" basis when deciding whether to attend an event or not.", "| Princess Eugenie, Mrs Jack Brooksbank"]}, {"page": "Graceland", "response": ["According to Elvis Presley's Enterprises, and as noted in Graceland's official page, the tour guide staff did informally keep a list of celebrities, from every walk of life,    who had visited in the first years following Elvis death, although this practice only became formal a decade later.  One of the first who visited was Muhammad Ali who did so in 1978,  and Paul Simon, who toured Graceland in the early 80s and afterwards wrote a song which became the title track of his Grammy winning album Graceland. On June 30, 2006, when US President George W. Bush hosted Japanese Prime Minister Junichiro Koizumi for a tour of the mansion, it became one of a few residences on American soil other than an Embassy, the White House, or any of the other Presidential retreats to have hosted an official joint-visit by a sitting US president and a then current head of a foreign government. On August 6, 2010, Prince Albert II, the Principality of Monaco's Head of State, and his then fiancée and now Princess of Monaco Charlene Wittstock, also toured Graceland as part of a vacation to the United States. Prince Albert explained: \"If you're on a summer holiday, you've got to come at this time of year. I've always wanted to come to Graceland. Charlene and my friends wanted to be here today for this visit, Elvis touched our lives as well and the lives of so many people. We wanted to pay our respects and see what this place was all about.\" On May 26, 2013, Paul McCartney of The Beatles visited Graceland, and left a guitar pick on Elvis's grave, and said, \"so Elvis can play in heaven.\" Prince William and Prince Harry, while in Memphis for a friend's wedding, visited Graceland on May 2, 2014. They were joined by their cousins Princess Beatrice and Princess Eugenie for a private tour of the estate. After the tour, a staff member was quoted as saying, \"It is pretty special to have a future king take time to come visit The King\"."]}, {"page": "Prince Andrew, Duke of York", "response": ["Andrew served in the Royal Navy as a helicopter pilot and instructor and as the captain of a warship. During the Falklands War, he flew on multiple missions including anti-surface warfare, casualty evacuation, and Exocet missile decoy. In 1986, he married Sarah Ferguson and was created Duke of York. They have two daughters, Princess Beatrice and Princess Eugenie. Their marriage, separation in 1992, and divorce in 1996 attracted extensive media coverage. Andrew served as the UK's Special Representative for International Trade and Investment for 10 years until July 2011.", "| Princess Eugenie of York || 23 March 1990 || 12 October 2018 || Jack Brooksbank || August Brooksbank"]}, {"page": "Sarah, Duchess of York", "response": ["In 2016, Sarah collaborated with British contemporary artist Teddy McDonald and her daughters, Princess Beatrice and Princess Eugenie, to create the first Royal contemporary painting. Titled Royal Love, it was painted on the lawn of Royal Lodge and features positive thoughts and quotes by Sarah and the princesses. The painting was exhibited in London at the Masterpiece Art Fair, Chelsea in June/July 2016 and later auctioned at private dinner. The proceeds from the sale of the painting were donated by McDonald to the charity Children in Crisis. British GQ magazine published an exclusive on the creation of the painting. In 2017, Sarah was joined by her daughter Eugenie to mark the second anniversary of the Teenage Cancer Trust unit at Alder Hey Children's Hospital.", "| Princess Eugenie of York || 23 March 1990 || 12 October 2018 || Jack Brooksbank || August Brooksbank"]}, {"page": "Eugenie, Princess of York", "response": ["#REDIRECT Princess Eugenie"]}, {"page": "Mountbatten-Windsor", "response": ["***(12) 15px Princess Eugenie, Mrs Jack Brooksbank (b. 1990)", "| Princess Eugenie of York and Jack Brooksbank"]}, {"page": "Princess Beatrice", "response": ["Princess Beatrice, Mrs Edoardo Mapelli Mozzi (Beatrice Elizabeth Mary; born 8 August 1988) is a member of the British royal family. She is the elder daughter of Prince Andrew, Duke of York, and Sarah, Duchess of York. Born fifth in line of succession to the British throne, she is now tenth. She has a younger sister, Princess Eugenie."]}, {"page": "Royal coat of arms of the United Kingdom", "response": ["| style=\"text-align:center;\"|Princess Eugenie, Mrs Jack Brooksbank||Five-point label with three thistles in alternate points."]}, {"page": "Royal Standard of the United Kingdom", "response": ["|rowspan=\"2\"|Princess Eugenie"]}, {"page": "St James's Palace", "response": ["St James's Palace is still a working palace, and the Royal Court is still formally based there, despite the monarch residing elsewhere. It is also the London residence of Princess Anne, Princess Beatrice, and Princess Alexandra. The palace is used to host official receptions, such as those of visiting heads of state, and charities of which members of the royal family are patrons. It forms part of a sprawling complex of buildings housing Court offices and officials' apartments. The immediate palace complex includes York House, the former home of the Prince of Wales and his sons, Princes William and Harry. Lancaster House, located next door, is used by HM Government for official receptions, and the nearby Clarence House, the former home of the Queen Mother, is now the residence of the Prince of Wales. The palace also served as the official residence of Princess Eugenie until April 2018."]}, {"page": "Order of precedence in England and Wales", "response": ["|  HRH Princess Eugenie, Mrs Jack Brooksbank", "|  HRH Princess Eugenie, Mrs Jack Brooksbank"]}]}}