{"wiki_id": "http://www.wikidata.org/entity/Q16626636", "itemLabel": "Rosemary Gordon", "itemDescription": "British psychologist", "wikipedia_url": "https://en.wikipedia.org/wiki/Rosemary_Gordon", "wikipedia_page": {"main": "Rosemary Gordon (1918 Germany – 17 January 2012, Menerbes, France) was a naturalised British academic, clinical psychologist and leading analytical psychologist and writer. She was a fellow of the Royal Anthropological Institute of Great Britain and Ireland and of the British Psychological Society and an honorary fellow of the Centre for Psychoanalytic Studies at the University of Kent.After schooling in Switzerland, Gordon came to London where she took a degree in psychology and later gained a doctorate at the University of London. She undertook anthropological research into family constellations at the Sorbonne in Paris. On returning to England her work in clinical psychology centred on projective testing.She became interested in the possibilities of psychoanalysis and undertook an analysis with the Kleinian Hanna Segal. However she found its premises on instinctual drives too limiting and turned to analytical psychology instead. She became a member of the London Society of Analytical Psychology in 1957 of which she was later to become the chair. She was co-editor with Michael Fordham and Kenneth Lambert of a series of clinical textbooks published by the Society of Analytical Psychology and later the editor of the Journal of Analytical Psychology (1986-1994). She did not abandon entirely her interest in the British Independent group, in particular the work of Melanie Klein and Donald Winnicott. With her colleague Judith Hubback she set up the \"Freud-Jung Group\" which met for years to exchange ideas between members of the British Psychoanalytical Society and the Society of Analytical Psychology. Aside from her many articles, she wrote two significant volumes, Dying and Creating, a Search for Meaning (1978) in which she explored the symbolic process and the variations she found in the conceptualisations of C. G. Jung and Sigmund Freud. Her last book was Bridges, Metaphor for Psychic Processes (1993), which gathered together the writings of a professional lifetime. She was an internationally esteemed clinician, supervisor and lecturer.\nIn 1950 Rosemary Gordon married an intelligence officer and future BBC producer, Peter Montagnon, and was then known as Rosemary Gordon‐Montagnon. They spent their retirement in rural Southern France where she predeceased him in 2012.", "link_mentions": [{"page": "Peter Montagnon", "response": ["Peter Ernest Arnold Montagnon (24 April 1925 – 27 October 2017) was a British Army officer, operative for the Secret Intelligence Service (MI6), and later a television producer.Peter Montagnon. The Times, 13 November 2017. Retrieved 14 November 2017. He was the first head of the BBC's Open University Production Centre. He was married for over fifty years to the influential analytical psychologist, Rosemary Gordon.Gordon, J. (2012). Rosemary Gordon-Montagnon (1918-2012). J. Anal. Psychol., 57(3):405-406 They retired to France where he died."]}, {"page": "Rosemary Gordon‐Montagnon", "response": ["#REDIRECT Rosemary Gordon"]}, {"page": "Society of Analytical Psychology", "response": ["* Rosemary Gordon"]}, {"page": "British Psychotherapy Foundation", "response": ["* Rosemary Gordon"]}]}}