{"wiki_id": "http://www.wikidata.org/entity/Q1669482", "itemLabel": "Joe Melia", "itemDescription": "British actor (1935-2012)", "wikipedia_url": "https://en.wikipedia.org/wiki/Joe_Melia", "wikipedia_page": {"main": "Joe Melia (23 January 1935, Islington, London – 20 October 2012, Stratford-upon-Avon, Warwickshire) was a British actor. He was educated at the City of Leicester Boys' Grammar School and Downing College, Cambridge, where he read English.He came to notice in Peter Nichols’s A Day in the Death of Joe Egg (Glasgow Citizens, 1967).", "link_mentions": [{"page": "Oh! What a Lovely War", "response": ["*Joe Melia as the Photographer"]}, {"page": "List of The Hitchhiker's Guide to the Galaxy characters", "response": ["On radio, he was played by Bill Wallis and appears in . On television, he appears in , played by Joe Melia. He is played by Steve Pemberton in the movie version. He appears in , despite not appearing in , voiced by Bruce Hyman; this Prosser exists on a parallel Earth where the cottage he wishes to demolish is the home of both Arthur Dent and Fenchurch."]}, {"page": "A Very Peculiar Practice", "response": ["In a deliberate case of art imitating life, the final episode of the first series introduces a character named Ron Rust (Joe Melia), a writer who, for reasons that he doesn't quite understand, owes the BBC £17,000 and is trying to write a black comedy about a university to pay the debt. The Ron Rust character also appeared in Davies's A Few Short Journeys of the Heart (an adaptation of his short story collection Dirty Faxes), first shown in the Stages series on BBC2 on 10 August 1994.", "|Joe Melia||Ron Rust||colspan=6 "]}, {"page": "Not Only... But Also", "response": ["(Joe Melia, Bill Wallis, John Wells)"]}, {"page": "Theatre 625", "response": ["|Susan George,Richard Cornish,Edwin Richfield,Joe Melia,Norman Wynne,Janet Burnell,Claire Davenport,Peter Pratt,Marion Mathie,Wilfred Carter,James Cairncross"]}, {"page": "The Balcony", "response": ["The Royal Shakespeare Company staged the play at the Aldwych Theatre, London, opening on 25 November 1971 with Brenda Bruce as Irma, Estelle Kohler as Carmen, and Barry Stanton as the Chief of Police; its director was Terry Hands and its designer was Farrah.Wright and Hands (1991, viii–ix). The RSC premièred another production, with the same director and designer, on 9 July 1987 at the Barbican Theatre, in a translation by Barbara Wright and Terry Hands. Dilys Laye played Irma, Kathryn Pogson played Carmen, and Joe Melia played the Chief of Police in this production.Wright and Hands (1991, x). On both occasions the RSC performed a version of the play that incorporated scenes and elements from Genet's texts of 1956 and 1960 that do not appear in the French edition of 1962. This version was also used in a production at the Abbey Theatre in New York, which opened on 4 December 1976 and featured Karen Sunde as Irma, Ara Watson as Carmen (later replaced by Carol Fleming), Tom Donaldson as the Chief of Police, and Christopher Martin as the Envoy.See the production's article in the Internet Off-Broadway Database website ."]}, {"page": "The Hitchhiker's Guide to the Galaxy (TV series)", "response": ["* Mr Prosser: Joe Melia"]}, {"page": "The Odd Job", "response": ["*Joe Melia as Head Waiter"]}, {"page": "Flash Harry (St Trinian's)", "response": ["Joe Melia played the part in The Wildcats of St Trinian's in 1980."]}, {"page": "Alan-a-Dale", "response": ["*Alan A 'Dale was the subject of a comic song performed on Dudley Moore and Peter Cook's show, Not Only But Also in 1965. The lyrics consisted of little more than a repetition of his name. Along with Cook and Moore, the performers were Joe Melia, Bill Wallis and John Wells."]}, {"page": "Modesty Blaise (1966 film)", "response": ["* Joe Melia as Crevier"]}]}}