{"wiki_id": "http://www.wikidata.org/entity/Q16732332", "itemLabel": "Frances McKee", "itemDescription": "Scottish singer/songwriter", "wikipedia_url": "https://en.wikipedia.org/wiki/Frances_McKee", "wikipedia_page": {"main": "Frances McKee is a Scottish singer and songwriter known best for her work in the Scottish indie band The Vaselines.", "link_mentions": [{"page": "Frances Bean Cobain", "response": ["Frances Cobain was born on August 18, 1992, at Cedars-Sinai Medical Center in Los Angeles, California.Cross, Charles R. Heavier Than Heaven, Hyperion, 2001.  p. 246. She was named after Frances McKee, the guitarist for the Scottish indie pop duo The Vaselines."]}, {"page": "The Vaselines", "response": ["The Vaselines are a Scottish alternative rock band. Formed in Glasgow, Scotland in 1986, the band was originally a duo between its songwriters Eugene Kelly and Frances McKee, but later added James Seenan and Eugene's brother Charlie Kelly on bass and drums respectively from the band Secession. McKee had formerly been a member of a band named The Pretty Flowers with Duglas T. Stewart, Norman Blake, Janice McBride and Sean Dickson. Eugene Kelly had formerly played in The Famous Monsters.", "thumb|right|Frances McKee with the Vaselines in Portland, OR, 13 May 2009.In the summer of 2006, McKee and Kelly took to the stage together for the first time since 1990 to perform a set of Vaselines songs, as part of a joint tour to promote their individual solo albums.", "*Frances McKee – vocals, guitar (1986–1990, 2006, 2008–present)", "*Record label for Frances McKee's 'Sunny Moon'"]}, {"page": "The Way of The Vaselines: A Complete History", "response": ["All songs by Eugene Kelly and Frances McKee except \"You Think You're a Man\" by Geoff Deane.", "* Frances McKee — vocals, guitars"]}, {"page": "With the Lights Out", "response": ["#\"Jesus Doesn't Want Me for a Sunbeam\" (Eugene Kelly/Frances McKee) – 3:57", "#\"Jesus Doesn't Want Me for a Sunbeam\" (Eugene Kelly/Frances McKee) – 3:32"]}, {"page": "McKee", "response": ["* Frances McKee"]}, {"page": "BMX Bandits (band)", "response": ["BMX Bandits were formed in Bellshill by songwriter and lead vocalist Duglas T. Stewart out of the ashes of The Pretty Flowers, a group that featured Stewart alongside Frances McKee (later of The Vaselines), Sean Dickson and Norman Blake. Beginning around 1982/1983, this early version of the band would perform impromptu, happening-style gigs at various locations around Bellshill including local parks, their school and the Hattonrigg Hotel. Before settling on the name The Pretty Flowers, they usually performed under various controversial and outrageous names to attract attention. The material they performed was often improvised or based loosely on other songs. The group would also partake in various other activities to amuse themselves, such as making home videos interviewing themselves as well as members of the public and recording albums of music in one night on home tape recorders. By 1985, McKee had left to start The Vaselines with Eugene Kelly and the group began to morph into the BMX Bandits. The style of the group as a collective of musicians has been present since its early days, with Stewart acting as the leader while the line-up constantly fluctuates. Many notable independent Glasgow musicians have passed through the band over the years and often continue to contribute to BMX Bandits recordings."]}, {"page": "Hagström", "response": ["* Frances McKee - The Vaselines"]}, {"page": "Dum-Dum (album)", "response": ["* Frances McKee – vocals, guitars"]}, {"page": "Secession (band)", "response": ["After Secession broke up, Kelly and Seenan joined the Vaselines with Charlie's brother, Eugene, and Frances McKee."]}, {"page": "Norman Blake (Scottish musician)", "response": ["Blake was a member of the Glasgow group, The Pretty Flowers, with school friend Duglas T. Stewart, Frances McKee, Janice Cochrane and Sean Dickson. After the group split Blake formed the Boy Hairdressers in 1986, the original lineup being really just Blake assisted by Dickson and Stewart. Later Blake was joined by Joe McAlinden, Jim Lambie and three future members of Teenage Fanclub Raymond McGinley, Francis Macdonald and Paul Quinn (after Macdonald's departure) ( Brendan O’ Hare also in joined the group at this time) The group recorded one EP for 53rd and 3rd Records featuring three of Blake's compositions."]}, {"page": "Eugene Kelly", "response": ["Eugene Kelly formed The Vaselines in Glasgow, Scotland in 1986 with Frances McKee and was a member until 1989 when the band disbanded the week their first and only full-length album, Dum-Dum, was released. Kurt Cobain of Nirvana was a big fan of the band, covering three of their songs. Molly's Lips and Son Of A Gun were included on their album, Incesticide. Nirvana also covered The Vaselines song Jesus Doesn't Want Me for a Sunbeam on their album, MTV Unplugged in New York.", "In the summer of 2006, Eugene Kelly and Frances McKee took to the stage to perform a set of The Vaselines songs, as part of a joint tour to promote their individual solo albums. This led to The Vaselines reforming (minus the old rhythm section) on 24 April 2008 for a charity show for the Malawi Orphan Support group at Glasgow's MONO venue."]}, {"page": "List of Scottish musicians", "response": ["*Frances McKee, singer and songwriter in The Vaselines", "*Suckle, indie pop band formed by Vaselines member Frances McKee"]}, {"page": "Frances Farmer Will Have Her Revenge on Seattle", "response": ["On February 24, 1992, Love wore a satin lace dress previously owned by Farmer when she married Cobain on Waikiki Beach in Honolulu, Hawaii. Cobain's and Love's daughter, Frances Bean Cobain, was named after Frances McKee, vocalist and guitarist for the Scottish indie pop band the Vaselines, and not Farmer."]}, {"page": "Naive John", "response": ["Naive John was born Ian Wylie in Poole, Dorset, his family moving to Glasgow when he was two years of age. He attended Cumbernauld High School, Glasgow 1973–79. During the period 1979–83 he took part in a youth training scheme, where amongst other things he played cards. In 1983 he was accepted without academic qualifications as an exceptional student at Greys School of Art, Aberdeen, but was later expelled. Within two years he had sold a painting Yellow Envy to Edwin Morgan, Scotland's Poet Laureate and won an award for his short experimental animation film Phobia. In 1998 he fled to Liverpool after a homophobic knife attack. Intensive psychotherapy followed during 1998 in an attempt to come to terms with his past traumatic experiences.Milner p.126 He has since been diagnosed as suffering from dysthymia. Throughout his periods of illness he continued to produce drawings and paintings albeit in limited numbers. Ex-Vaselines front woman Frances McKee commissioned the artist to create several CD covers for her band Suckle."]}, {"page": "List of female rock singers", "response": ["* Frances McKee"]}, {"page": "Sunny Moon", "response": ["Sunny Moon is the first solo album by Frances McKee.  Containing a much softer and more mellow style of music than her previous days in the Vaselines, the music is more reminiscent of her work in Suckle. All songs were written by McKee except \"You Know Who I Am\" (Leonard Cohen). The album was described by The Scotsman as a \"maudlin but beautiful collection of songs\".\"Eugene Kelly and Frances McKee – Live Music Review\", The Scotsman, 21 June 2006"]}, {"page": "Dying for It", "response": ["* Frances McKee — vocals, guitars"]}, {"page": "Son of a Gun (EP)", "response": ["All songs written by Frances McKee and Eugene Kelly except where noted.", "* Frances McKee — vocals, guitars"]}, {"page": "List of songs recorded by Nirvana", "response": ["| style=\"background-color:#CCFFFF\"|   Frances McKee ", "| style=\"background-color:#CCFFFF\"|   Frances McKee ", "| style=\"background-color:#CCFFFF\"|   Frances McKee "]}, {"page": "List of Hagström users", "response": ["* Frances McKee of The Vaselines currently uses a Hagström Viking II as her main guitar."]}, {"page": "Oomalama", "response": ["#\"Sex Sux (Amen)\" (Eugene Kelly, Frances McKee) – 2:39", "#\"Molly's Lips\" (Eugene Kelly, Frances McKee) – 2:19"]}, {"page": "Suckle (band)", "response": ["Suckle were an indie pop band formed in Glasgow, Scotland in the mid-1990s by former Vaselines member Frances McKee, along with her sister and co-vocalist in the group Marie McKee and another former Vaselines member James Seenan.Robertson, Mark (2000) \"Suckle and See\", The Sunday Herald, 28 May 2000Strong, Martin C. (2003) \"Suckle\", in The Great Indie Discography, Canongate,  After early releases, the line-up was completed by Elanor Taylor (keyboards, flute), Brian McEwan (guitar), his brother Kenny McEwan (drums, formerly of Long Fin Killie), and Vicky Morton (bass). The band's first release was the Hormonal Secretions EP in 1997, followed by \"Cybilla\" in 1998. They were then signed by Chemikal Underground, who issued \"To Be King\" in 2000, followed by their debut album, Against Nurture, described as \"bringing to mind Nick Cave's Bad Seeds fronted by the vocal duo from Stereolab\". After a further EP, The Sun Is God, the band split up. The band were also compared to Belle and Sebastian and Clannad during their time together.\"Suckle - Edinburgh Cas Rock\", NME, 18 May 1999", "Frances McKee later recorded as a solo artist."]}, {"page": "Enter the Vaselines", "response": ["All songs written and composed by Eugene Kelly/Frances McKee except \"You Think You're a Man\" by Geoff Deane and \"I Didn't Know I Loved You ('Til I Saw You Rock 'n' Roll)\" by Gary Glitter/Mike Leander.", "*Frances McKee – vocals, guitar"]}, {"page": "Sex with an X", "response": ["All tracks written and composed by Eugene Kelly/Frances McKee", "*Frances McKee – Guitar/Vocals"]}, {"page": "List of sopranos in non-classical music", "response": ["| Frances McKee || 1966– || Scottish ||  || style=text-align:center|"]}, {"page": "Frances", "response": ["* Frances McKee (born 1966), Scottish musician, guitarist for Scottish indie band The Vaselines"]}, {"page": "V for Vaselines", "response": ["All tracks written and composed by Eugene Kelly/Frances McKee", "*Frances McKee – guitar, vocals, keyboards on \"The Lonely L.P.\" and \"Inky Lies\""]}]}}