{"wiki_id": "http://www.wikidata.org/entity/Q16732883", "itemLabel": "Brian Morris", "itemDescription": "art director", "wikipedia_url": "https://en.wikipedia.org/wiki/Brian_Morris_(art_director)", "wikipedia_page": {"main": "Brian Morris (born 1939) is a British production designer known for films such as Pirates of the Caribbean: The Curse of the Black Pearl, Evita and The Insider.\nHe was nominated at the 69th Academy Awards in the category of Best Art Direction for his work on the film Evita. He shared his nomination with Philippe Turlure.He has worked on over 30 films since 1973.", "link_mentions": [{"page": "Academy Award for Best Production Design", "response": ["| Brian Morris"]}, {"page": "69th Academy Awards", "response": ["** Evita – Art Direction: Brian Morris; Set Decoration: Philippe Turlure"]}, {"page": "Angel Heart", "response": ["In 1985, producer Elliott Kastner met with Alan Parker at Pinewood Studios to discuss a film adaptation of the novel. Parker, who had read the book following its publication, agreed to write the screenplay. He met with Hjortsberg in London before moving to New York, where he wrote most of the script. After completing the first draft in September 1985, Parker traveled to Rome, Italy, where he brought the script to Mario Kassar and Andrew G. Vajna. The two producers agreed to finance the film through their independent film studio, Carolco Pictures, and Parker was given creative control. Pre-production work on Angel Heart began in January 1986 in New York, where Parker selected the creative team, reuniting with several of his past collaborators, including producer Alan Marshall, director of photography Michael Seresin, camera operator Michael Roberts, production designer Brian Morris and editor Gerry Hambling.", "Principal photography for Angel Heart began on March 31, 1986, and concluded on June 20, 1986, on a budget of $18 million. Filming began in Eldridge Street, Manhattan, New York City, which acted as Harry Angel's neighbourhood. Production designer Brian Morris and the set-decorating team spent two months designing the set prior to filming, hoping to recreate 1950s New York. Because of the warm weather conditions, ice trucks were used to create fake snow. Filming then moved to Alphabet City in Manhattan, where several bar scenes and Angel's intimate bedroom scene with Connie (Whitcraft) were filmed.", "Production then moved to Magazine Street, where production designer Brian Morris and the art department attempted to recreate 1950s New Orleans. Parker said of the set, \"As in New York, we had dressed and clad every single storefront as far as the eye could see in order to be authentic to the period, and drained everything of all primary colours for our monochromatic look.\" Filming then moved to Jackson Square where the crew filmed one of the final scenes, in which Angel runs from Margaret's home. The production then filmed a voodoo ceremony scene choreographed by Louis Falco. Falco, who had previously choreographed Parker's 1980 film Fame, based the scene on an actual Haitian ceremony."]}, {"page": "Unfaithful (2002 film)", "response": ["Lyne asked director of photography Peter Biziou, with whom he made 9½ Weeks, to shoot Unfaithful. After reading the script, Biziou felt that the story was appropriate for the classic 1.85:1 aspect ratio because it \"so often has two characters working together in the frame\". During pre-production, Biziou, Lyne and production designer Brian Morris used a collection of still photographs as style references. These included photos from fashion magazines and shots by prominent photographers."]}, {"page": "Evita (1996 film)", "response": ["Parker's finished script included 146 changes to the concept album's music and lyrics. In May 1995, he and Rice visited Lloyd Webber at his home in France, where Parker tried to bring them to work on the film. Rice and Lloyd Webber had not worked together for many years, and the script for Evita required that they compose new music. In June 1995, with assistance from the United States Department of State and senator Chris Dodd, Parker arranged a private meeting with Menem in Argentina to discuss the film's production and request permission to film at the Casa Rosada, the executive mansion. Although he expressed his discontent with the production, Menem granted the filmmakers creative freedom to shoot in Argentina, but not in the Casa Rosada. He also advised Parker to be prepared to face protests against the film. Parker had the film's production designer Brian Morris take photographs of the Casa Rosada, so that the production could construct a replica at Shepperton Studios in England. The director visited seven other countries before deciding to film on location in Buenos Aires and Budapest.", "Principal photography began on February 8, 1996, with a budget of $55 million. Production designer Brian Morris constructed 320 different sets. Costume designer Penny Rose was given special access to Eva's wardrobe in Argentina, and she modeled her own costume designs after Eva's original outfits and shoes. She clothed 40,000 extras in period dresses. The production used more than 5,500 costumes from 20 costume houses located in Paris, Rome, London, New York City, San Francisco, Los Angeles, Buenos Aires, and Budapest as well as 1,000 military uniforms. Madonna's wardrobe included 85 costume changes, 39 hats, 45 pairs of shoes, and 56 pairs of earrings. She broke the Guinness World Record for \"Most Costume Changes in a Film\"."]}, {"page": "50th British Academy Film Awards", "response": ["* Evita – Brian Morris"]}, {"page": "Brian Morris", "response": ["* Brian Morris (biologist) (born 1950), Australian molecular biologist and professor at the University of Sydney", "* Brian Morris, Baron Morris of Castle Morris (1930–2001), British poet, critic and professor of literature", "* Brian Morris (anthropologist) (born 1936), professor of anthropology at London University", "* Brian Morris (judge) (born 1963), American federal judge who served on the Montana Supreme Court from 2004 to 2013", "* Brian Morris (art director) (born 1939), British art director "]}, {"page": "César Award for Best Production Design", "response": ["|Quest for Fire || La Guerre du feu || Brian Morris"]}, {"page": "BAFTA Award for Best Production Design", "response": ["| Yanks || Brian Morris", "| Evita || Brian Morris"]}, {"page": "Quest for Fire (film)", "response": ["The film was nominated for six César Awards in 1981, including Best Original Screenplay or Adaptation for Gérard Brach, Best Music Written for a Movie for Philippe Sarde, Best Cinematography for Claude Agostini, and Best Sets for Brian Morris, winning those for Best Film and Best Director. In 1983 it won the Academy Award for Best Makeup. Also in 1983, it won in five categories in the Genie Awards.", "|Brian Morris"]}, {"page": "33rd British Academy Film Awards", "response": ["* Yanks – Brian Morris"]}, {"page": "Satellite Award for Best Art Direction and Production Design", "response": ["| Evita || Brian Morris"]}, {"page": "List of British Academy Award nominees and winners", "response": ["|Brian Morris"]}, {"page": "Art Directors Guild Award for Excellence in Production Design for a Fantasy Film", "response": ["| Pirates of the Caribbean: The Curse of the Black Pearl || Brian Morris"]}, {"page": "Art Directors Guild Award for Excellence in Production Design for a Period Film", "response": ["| Pirates of the Caribbean: The Curse of the Black Pearl || Brian Morris"]}, {"page": "List of accolades received by the Pirates of the Caribbean film series", "response": ["| Brian Morris, Derek R. Hill, Donald B. Woodruff, James E. Tocci, William Ladd Skinner, Robert Woodruff", "| Brian Morris"]}, {"page": "List of accolades received by Evita (1996 film)", "response": ["Evita is a 1996 American musical drama film based on Tim Rice and Andrew Lloyd Webber's musical of the same name about First Lady of Argentina, Eva Perón. Directed by Alan Parker and written by Parker and Oliver Stone, the film starred Madonna, Antonio Banderas, and Jonathan Pryce in the leading roles of Eva, Ché and Juan Perón respectively. Rice and Webber composed the film's musical score, while Darius Khondji was the cinematographer. Vincent Paterson created the choreography for the film and Gerry Hambling was responsible for editing. Penny Rose designed and created the period costumes for the film, and Brian Morris was the set designer."]}, {"page": "Brian Morris (set designer)", "response": ["#REDIRECT Brian Morris (art director)"]}, {"page": "Los Angeles Film Critics Association Award for Best Production Design", "response": ["|style=\"text-align:center;\" rowspan=2 | 1996 || Evita || Brian Morris"]}, {"page": "Philippe Turlure", "response": ["* Evita (1996; co-nominated with Brian Morris)"]}]}}