{"wiki_id": "http://www.wikidata.org/entity/Q1675824", "itemLabel": "Ivone Kirkpatrick", "itemDescription": "British diplomat", "wikipedia_url": "https://en.wikipedia.org/wiki/Ivone_Kirkpatrick", "wikipedia_page": {"main": "Sir Ivone Augustine Kirkpatrick,  (3 February 1897  – 25 May 1964) was a British diplomat who served as the British High Commissioner in Germany after World War II, and as the Permanent Under-Secretary of State for Foreign Affairs, the highest-ranking civil servant in the Foreign Office.", "link_mentions": [{"page": "Konrad Adenauer", "response": ["In November 1954, Adenauer's lobbying efforts on behalf of the \"Spandau Seven\" finally bore fruit with the release of Konstantin von Neurath. Adenauer congratulated Neurath on his release, sparking controversy all over the world. At the same time, Adenauer's efforts to win freedom for Admiral Karl Dönitz ran into staunch opposition from the British Permanent Secretary at the Foreign Office, Ivone Kirkpatrick, who argued Dönitz would be an active danger to German democracy. Adenauer then traded with Kirkpatrick no early release for Admiral Dönitz with an early release for Admiral Erich Raeder on medical grounds."]}, {"page": "Suez Crisis", "response": ["In Britain, the nationalisation was perceived as a direct threat to British interests. In a letter to the British Ambassador on 10 September 1956, Sir Ivone Kirkpatrick, the Permanent Under-Secretary at the Foreign Office wrote: If we sit back while Nasser consolidates his position and gradually acquires control of the oil-bearing countries, he can and is, according to our information, resolved to wreck us. If Middle Eastern oil is denied to us for a year or two, our gold reserves will disappear. If our gold reserves disappear, the sterling area disintegrates. If the sterling area disintegrates and we have no reserves, we shall not be able to maintain a force in Germany, or indeed, anywhere else. I doubt whether we shall be able to pay for the bare minimum necessary for our defence. And a country that cannot provide for its defence is finished."]}, {"page": "The Lives of a Bengal Lancer (film)", "response": ["According to Ivone Kirkpatrick, who met Adolf Hitler at Berchtesgaden in 1937, one of Hitler's favorite films was The Lives of a Bengal Lancer, which he had watched three times.Sir Ivone Kirkpatrick, The Inner Circle (London: Macmillan, 1959), p. 97. He liked the film because \"it depicted a handful of Britons holding a continent in thrall. That was how a superior race must behave and the film was a compulsory viewing for the S.S.\"David Faber (2009). Munich, 1938: Appeasement and World War II. Simon and Schuster. p. 40. ."]}, {"page": "Independent Television Authority", "response": ["| align=center|Sir Ivone Kirkpatrick"]}, {"page": "Selwyn Lloyd", "response": ["Pineau was less cooperative and left New York on 13 October. Lloyd later wrote that agreement had been reached on the Six Principles, but not on how to implement them, although he conceded that Nasser had never accepted the principle that the Canal could not be under the control of any one country. On 13 October Sir Gladwyn Jebb warned Ivone Kirkpatrick (Permanent Under-Secretary at the Foreign Office) that France appeared to be cooperating with Israel against Egypt, and had sent her ninety-five Mystère jets, possibly with French pilots.Thorpe 1989, p. 229.", "Lloyd later described 18 October as \"an important day\". Jebb had protested to Ivone Kirkpatrick at the exclusion of the ambassadors from the Anglo-French talks and had sent Lloyd a handwritten threat of resignation. Before the Cabinet meeting at 10 Downing Street that morning, Lloyd buttonholed Rab Butler outside the Cabinet Room. Butler later recorded (and Lloyd's account is similar) that Lloyd had gripped him by the arm, telling him that he had been \"wafted\" to Paris and warning him confidentially that there might be a preemptive strike by Israel against Jordan, Egypt and Syria.Jago 2015, p. 287. Butler's biographer Michael Jago thinks that Lloyd's behaviour was evidence that he was out of his depth.Jago 2015, pp. 290–1. This Cabinet was thinly-attended.Shepherd 1994, p. 116. Lloyd reported to the Cabinet on the Security Council vote to keep the Canal insulated from the politics of any one country, despite Soviet veto of the second part of the resolution. There was to be another meeting in Geneva, with Egyptian participation. The Cabinet approved, but then moved on to Eden's disingenuous warnings that negotiations might be overtaken by hostilities between Israel and Egypt.Williams 2010, pp. 254–5. Eden informed ministers that a plan (Operation \"Musketeer Revise\") was being drawn up to retake the Canal by force. \"Musketeer Revise\" was practicable only until the end of October, although in the event a slightly amended version was used for military operations in November. Afterwards Eden circulated a minute that he'd told the French that every effort must be made to stop Israel attacking Jordan, but that he had told Israel that Britain would not come to Egypt's aid in the event of an Israeli attack.", "The Cabinet further considered the use of force on 24 October.Shepherd 1994, p. 117. After Cabinet, Lloyd recorded his UN Day Broadcast for the BBC, for transmission that evening. He then had a tense meeting with Ivone Kirkpatrick and Gladwyn Jebb, who was still angry at being kept in the dark. At 11pm Lloyd went to 10 Downing Street to hear Dean's report on the second Sevres meeting. Mountbatten (First Sea Lord) also attended. The French had produced three copies of a typed document, the Protocol of Sevres. Eden later tried in vain to retrieve the French and Israeli copies to destroy the evidence of collusion.Thorpe 1989, p. 243."]}, {"page": "Reichskonkordat", "response": ["On 4 August 1933 the British Minister reported \"in conversations I have had with Cardinal Pacelli and Monsignor Pizzardo, neither gave me the feeling of the slightest regret at the eclipse of the Centre [Party], and its consequent loss of influence in German politics\".Rhodes, p. 176; On 23 June 1939 von Bergen wrote \"Cardinal Pacelli told me that the fate of the Concordat depends upon the handling of the Germans' wish for diminution of the political work by priests.\" (Rhodes, p. 176) On 19 August Ivone Kirkpatrick had a further discussion with Cardinal Pacelli in which he expressed his \"disgust and abhorrence\" at Hitler's reign of terror to the diplomat. Pacelli said \"I had to choose between an agreement on their lines and the virtual elimination of the Catholic Church in the Reich.\"Lapide, pp. 102–103 Pacelli also told Kirkpatrick that he deplored the persecution of the Jews, but a pistol had been held to his head and that he had no alternative, being given only one week to decide.Lapide, p. 103 Pinchas Lapide notes that whilst negotiations for the concordat were taking place, pressure had been put on the Vatican by the arrest of ninety-two priests, the searching of Catholic youth-club premises, and the closing down of nine Catholic publications.Lapide, p. 103 The Nazi newspaper Völkischer Beobachter wrote: \"By her signature the Catholic Church has recognised National Socialism in the most solemn manner. ...This fact constitutes an enormous moral strengthening of our government and its prestige.\""]}, {"page": "Ian Jacob", "response": ["By the end of the war, the BBC's European Service (later the BBC World Service), based at Bush House, had become the world's most respected and sophisticated foreign language broadcasting operation and had been admired for its contribution to the war effort. After the war, however, its significance was greatly reduced and its future in some doubt. The departing head of the service, Sir Ivone Kirkpatrick (who would become the Chairman of the Independent Television Authority a decade later), recommended Jacob as a potential successor. Sir William Haley, the BBC's Director-General, had already met Jacob during preparations to report the news of the D-Day landings and was aware that his political contacts (Churchill in particular) could be valuable. He heeded Kirkpatrick's recommendation, and Jacob was duly appointed Controller of the European Service following his retirement from the Army. Jacob accepted the post shortly after receiving a knighthood for his work with the war cabinet."]}, {"page": "Political Warfare Executive", "response": ["The Executive was formed in August 1941, reporting to the Foreign Office. The staff came mostly from SO1, which had been until then the propaganda arm of the Special Operations Executive. The organisation was governed by a committee initially comprising Anthony Eden, (Foreign Secretary), Brendan Bracken, (Minister of Information) and Hugh Dalton, (Minister of Economic Warfare), together with officials Rex Leeper, Dallas Brooks and Robert Bruce Lockhart as chairman (and later Director General). Roundell Palmer (the future 3rd Earl of Selbourne) later replaced Dalton when he was moved to become President of the Board of Trade. Ivone Kirkpatrick, an advisor to the BBC and formerly a diplomat in Berlin, also joined the committee, while Leeper left to become British Ambassador to Greece."]}, {"page": "Celbridge", "response": ["Other large houses outside the townMark Bence-Jones Burke's Guide to Country Houses include Killadoon a three-storey block with a single storey wing built c. 1770 (redecorated 1820) for Nathaniel Clements MP, banker and amateur architect. Significantly, it does not appear to have been designed by Clements himself. Clements is also reputed to have designed Colganstown house, built by the Yeats family c 1760 was the property of Dublin Corporation through the first half of the 19th century. It is associated with the Andrews, Sherlock, Colgan and Meade families. Pickering Forest is a three-storey Georgian house associated with the Brooke (Barons Somerton) and later Ogilby families.Irish Times, 21 August 1876 p. 1 and 7 November 1905 p. 6 Donaghcumper is a Tudor revival house built by William Kirkpatrick c1835, was sold after the death of Ivone Kirkpatrick to J Bruce Bredin, Springfield was associated with the Jones and Warren families and then the Mitchell family until 1906.Irish Times, 25 September 1908 p. 11 Elm Hall was associated with the O'Connor family, Stacumny with the Lambert family, and Ballygoran with the Murray family, while The Grove was home of Dr. Charles O'Connor, resident surgeon for the workhouse and first chairman of Kildare GAA Board. Temple Mills was associated with the Tyrrell, Shaw and Von Mumm families and John Ellis. The parsonage, known as Robert Scott's house (rebuilt 1780, locally known as the \"Shelbourne\") fell into ruin and became the site of St Patrick's Park housing estate.", "*Ivone Kirkpatrick (1897–1964), diplomatist, British Chancellor in Berlin before the second world war, and Under-Secretary of the British Foreign Office"]}, {"page": "Spymaster", "response": ["|Ivone Kirkpatrick"]}, {"page": "Sigismund Payne Best", "response": ["Best served as a captain in the First World War; first as a member of the Intelligence Corps- owing partially to his poor eyesight and his command of French, German and Flemish- and later as the second officer of the GHQ's Wallinger London bureau. In 1917, Major Ernest Wallinger sent him to Rotterdam, Netherlands to handle and set up intelligence networks in German-occupied Belgium. The Wallinger service was linked to several Belgian resistance groups. A well-known recruit of Wallinger was the Belgian resistance heroine Gabrielle Petit. In Rotterdam, Best came into conflict with Richard Tinsley, local station chief of MI6. In November 1917, he was recalled to London after he was caught sleeping with the wife of an influential Belgian resistance leader. He was replaced by Lieutenant Ivone Kirkpatrick. Best later accused Tinsley of scheming against him.Ruis, Edwin. Spynest: British and German Espionage from Neutral Holland 1914–1918. Briscombe: The History Press, 2016, p. 193."]}, {"page": "Eyre Crowe", "response": ["Stanley Baldwin called him \"our ablest public servant\". Lord Vansittart in his memoirs said of Crowe: \"...a dowdy, meticulous, conscientious agnostic with small faith in anything but his brain and his Britain\".Robert Gilbert Vansittart, The Mist Procession (Hutchinson, 1958), p. 45. Sir Ivone Kirkpatrick said Crowe was:", "...probably the most efficient public servant ever produced by the Foreign Office. His mother was German, he spoke with a guttural accent and he had a mind of truly Germanic clarity and orderliness. No-one since his time has ever kept so tight a grip on the work of the whole office. He read a copy of every inward and outward telegram (there were fewer in those days) and sent his marginal notes on them by urgent box to the appropriate department. He sometimes telephoned to juniors to make known his views or his disapproval. I was paralysed one day to pick up the telephone to hear his voice: ‘I have just r-r-read your minute. Either you do not mean what you say, in which case you are wasting my time. Or you do mean it, in which case you are wr-r-riting r-r-rot.’ And with that he put down the receiver. Crowe's industry was prodigious. In December 1921 Lord Curzon asked for the office perspective on Anglo-French relations. Crowe regarded this as a suitable holiday task for himself, and on our return from the Christmas holidays we found a 20,000-word manuscript memorandum in his inimitable limpid style. It was unfortunate for Crowe that he should have served under a chief who never appreciated his quality and who was apt to take advantage of his zeal. The work which Curzon heaped on his [Curzon] willing shoulders probably accelerated his premature death whilst still in harness.Sir Ivone Kirkpatrick, The Inner Circle (London: Macmillan, 1959), pp. 32-33."]}, {"page": "Allied-occupied Germany", "response": ["Another special feature of the British zone was the Enclave of Bonn. It was created in July 1949 and was not under British or any other allied control. Instead it was under the control of the Allied High Commission. In June 1950, Ivone Kirkpatrick became the British High Commissioner for Germany. Kirkpatrick carried immense responsibility particularly with respect to the negotiation of the Bonn–Paris conventions during 1951–1952, which terminated the occupation and prepared the way for the rearmament of West Germany."]}, {"page": "Allied High Commission", "response": ["| Sir Ivone Kirkpatrick"]}, {"page": "List of ambassadors of the United Kingdom to the Holy See", "response": ["*1932–1933: Sir Ivone Kirkpatrick"]}, {"page": "List of diplomats of the United Kingdom to Germany", "response": ["*1950–1953: Sir Ivone Kirkpatrick"]}, {"page": "Information Research Department", "response": ["Since 1946, many senior officials of both the Foreign Office and the Labour Party had proposed the creation of an anti-communist propaganda organ. Christopher Warner raised a formal proposal in April 1946, but Secretary of State for Foreign Affairs Ernest Bevin was reluctant to upset the pro-Soviet members of the Labour Party. Later in the summer, Bevin rejected another proposal by Ivone Kirkpatrick to set up an anti-communist propaganda unit. In 1947, Christopher Mayhew lobbied for the proposals, linking anti-communism with the concept of \"Third Force\", which was meant to be a progressive camp between the Soviet Union and the United States. This framing, together with anti-British Soviet propaganda attacks during the same years, led Bevin to change his position and to start discussing the details for the creation of a propaganda unit. After sending a confidential paper to the foreign secretary, Ernest Bevin, in 1947, Mayhew was summoned by Attlee to Chequers to discuss it further.", "To achieve these goals, the memorandum called for the establishment of a Foreign Office department \"to collect information\" about Communism and to \"provide material for our anti-Communist publicity through our Missions and Information Services abroad\". The department would collaborate with ministers, British delegates, the Labour Party, trade union representatives, the Central Office of Information, and the BBC Overseas Service. The new department was finally established as the Information Research Department. Mayhew ran the department with Sir Ivone Kirkpatrick until 1950. The original offices were in Carlton House Terrace, before moving to Riverwalk House, Millbank, London."]}, {"page": "September 1956", "response": ["*Sir Ivone Kirkpatrick, Permanent Under-Secretary at the UK's Foreign Office, writes to the British Ambassador in Egypt, warning that allowing President Gamal Abdel Nasser to consolidate his position, it will cause the flow of Middle Eastern oil to the UK to dry up, ruining the British economy.Keith Kyle, Suez: Britain's End of Empire in the Middle East. (I.B. Tauris, 2003), pp. 225–226."]}, {"page": "The Brains Trust", "response": ["The original three members of the broadcasting team were C. E. M. Joad (philosopher and psychologist), Julian Huxley (biologist) and Commander A. B. Campbell (retired naval officer). The chairman was Donald McCullough. Later participants included: Edward Andrade, Noel Annan, A. J. Ayer, Michael Ayrton, Isaiah Berlin, Robert Boothby, Jacob Bronowski, Collin Brooks, Violet Bonham Carter, Alan Bullock, Anthony Chenevix-Trench, Kenneth Clark, Margery Fry, Commander Rupert Gould, Gilbert Harding (as chairman), Herbert Hart, Will Hay, Bishop Joost de Blank, Marghanita Laski, C. S. Lewis, John Maud, Malcolm Muggeridge (chairman), Anna Neagle, Egon Ronay, Bertrand Russell, Sir Malcolm Sargent, Hannen Swaffer, Gwyn Thomas (novelist), Geoffrey Crowther (as chairman), Lord Dunsany, Sir Ivone Kirkpatrick, Walter Elliot,Archived at Ghostarchive and the Wayback Machine:  Jennie Lee, Ellen Wilkinson, Aldous Huxley, A. J. P. Taylor, Harold Nicolson, Barbara Ward Jackson, Philip Guedalla and Tom Wintringham."]}, {"page": "Kirkpatrick", "response": ["* Ivone Kirkpatrick (1897–1964), British diplomat"]}, {"page": "Permanent Under-Secretary of State for Foreign Affairs", "response": ["*1949: Sir William Strang (jointly with the Heads of the German Section: Sir Ivone Kirkpatrick 1949–1950, Sir D. Gainer 1950–1951) (later Lord Strang)", "*1953: Sir Ivone Kirkpatrick"]}, {"page": "List of Old Gregorians", "response": ["* Ivone Kirkpatrick - Irish born Permanent Under-Secretary of State for Foreign Affairs, British High Commissioner at Allied High Commission and Ambassador of the United Kingdom to the Holy See"]}, {"page": "René Massigli", "response": ["The deadlock on an Anglo-French alliance was broken when the British ambassador in Paris, Alfred Duff Cooper, acting on his own proposed an alliance to the French premier Léon Blum in January 1947. Despite his doubts about Britain by this time, Massigli approved when Blum arrived in London to take up Duff Cooper's offer, which the British were too embarrassed to admit was something that he done without orders and led to the Treaty of Dunkirk on 4 March. After the treaty was signed, Britain and France invited Belgium, the Netherlands and Luxembourg to join, which led to the Treaty of Brussels in March 1948. Massigli's hopes that these treaties would orient Britain towards Europe and away from the United States were dashed. Sir Ivone Kirkpatrick told Massigli that the British felt that the immediate danger was the Soviet Union, not Germany, and that it was necessary for the states of Western Europe to co-ordinate their defense and foreign policies with the United States, even if the American views about rebuilding Germany as a great power were often unpalatable to the French. Bidault, in his instructions to Massigli, stated that France was opposed to any form of German rearmament. For his part, Massigli reported to Paris that the recurring crises of the Fourth Republic damaged France's credibility in London as even British officials normally Francophile were worried about the state of France. Despite the best efforts of Oliver Harvey, the British ambassador in Paris, the general feeling in Whitehall was that France was a declining power marked by unstable politics and what one British official called a \"petulant approach to European and especially German problems\" as the British were far more in favor of the rehabilitation of Germany than the French."]}, {"page": "Harman Grisewood", "response": ["From 1941–1945 Grisewood was 'Assistant Controller, European Division'.  This was major leap from a relatively obscure post in Broadcasting House to become second in command to Sir Ivone Kirkpatrick at Bush House, London. Kirkpatrick, a career diplomat, had been transferred by the Government using its wartime powers, from the Foreign Office to the new post of controller of the European division, responsible to the Director-General. Grisewood was appointed as a balancing influence with broadcasting skills. He was acting controller from 1945–1946."]}, {"page": "Sir Ivone Augustine Kirkpatrick", "response": ["#REDIRECT Ivone Kirkpatrick"]}, {"page": "Alfred Alexander", "response": ["Alfred Alexander (7 March 188015 May 1950) was a German physician who served as President of the Berlin Association of Doctors during the 1930s.  He was a leading researcher into the cure for leukaemia.  One of his patients was Sir Ivone Kirkpatrick.  In 1935 he and his family fled Nazi Germany to England, where he established a medical practice, with a clinic in Harley Street.  He died in 1950.\"Groß Glienicke Kreis: Die Enteignung des Dr. Alexander\""]}, {"page": "Rudolf Hess", "response": ["After the meeting, Hamilton examined the remains of the Messerschmitt in the company of an intelligence officer, then returned to Turnhouse, where he made arrangements through the Foreign Office to meet Churchill, who was at Ditchley for the weekend. They had some preliminary talks that night, and Hamilton accompanied Churchill back to London the next day, where they both met with members of the War Cabinet. Churchill sent Hamilton with foreign affairs expert Ivone Kirkpatrick, who had met Hess previously, to positively identify the prisoner, who had been moved to Buchanan Castle overnight. Hess, who had prepared extensive notes to use during this meeting, spoke to them at length about Hitler's expansionary plans and the need for Britain to let the Nazis have free rein in Europe, in exchange for Britain being allowed to keep its overseas possessions. Kirkpatrick held two more meetings with Hess over the course of the next few days, while Hamilton returned to his duties. In addition to being disappointed at the apparent failure of his mission, Hess began claiming that his medical treatment was inadequate and that there was a plot afoot to poison him."]}, {"page": "Ivone", "response": ["* Ivone Kirkpatrick (1897-1964), British diplomat"]}, {"page": "John Cloake", "response": ["In August 1948 Cloake commenced a career in the United Kingdom's Diplomatic Service, within the Foreign Office. Following an initial period in the Information Research Department, he was appointed Third Secretary in Baghdad in 1949 supporting Henry Mack and Jack Troutbeck. A posting to Saigon followed in 1951, first as Third Secretary then as Second Secretary.  In 1956 he became Private Secretary to Permanent Under-Secretary Ivone Kirkpatrick during the time of the Suez Crisis, then to Douglas Dodds-Parker and, after that, to Ian Harvey. In 1958 he transferred to New York as Commercial Consul. He then worked in Moscow and in Tehran. His final post was in Sofia as Ambassador of the United Kingdom to Bulgaria where he was in charge of the UK's diplomatic mission between 1976 and 1980."]}, {"page": "Ivone Augustine Kirkpatrick", "response": ["#REDIRECT Ivone Kirkpatrick"]}, {"page": "List of state leaders in the 20th century (1951–2000)", "response": ["::*Ivone Kirkpatrick, High Commissioner (1950–1953)"]}, {"page": "List of state leaders in the 20th century (1901–1950)", "response": ["::*Ivone Kirkpatrick, High Commissioner (1950–1953)"]}]}}