{"wiki_id": "http://www.wikidata.org/entity/Q167718", "itemLabel": "Andy Burrows", "itemDescription": "English musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Andy_Burrows", "wikipedia_page": {"main": "Andrew William Burrows (born 30 June 1979) is an English songwriter and musician. He was the drummer in the band Razorlight from 2004 to 2009, as well as We Are Scientists from 2009 to 2014.\nBurrows' first solo album The Colour of My Dreams (2008) was released while he was still a member of Razorlight. After he departed the band he released his first album with the solo project I Am Arrows, called Sun Comes Up Again in 2010. His third solo album Company was released on 22 October 2012.\nHe has worked with Tom Smith from Editors under the moniker \"Smith & Burrows\". He also co-wrote the soundtrack to The Snowman and The Snowdog with Ilan Eshkeri, which was nominated for a BAFTA Craft Award in April 2013.\nBurrows co-produced the soundtrack for the Ricky Gervais’ film, David Brent: Life On The Road. Burrows appears in the film as drummer in David Brent's  fictional band, Foregone Conclusion.Burrows continued working with Columbia recording artist, Tom Odell, contributing drums and backing vocals to both the Wrong Crowd and Jubilee Road albums. He co-wrote \"Sirens\" from Odell's debut album, Long Way Down, \"Here I Am\" from Wrong Crowd, and the title track of Jubilee Road.", "link_mentions": [{"page": "1979", "response": ["** Andy Burrows, English songwriter and musician"]}, {"page": "Winchester", "response": ["A number of public figures and celebrities were students at Peter Symonds College in Winchester, including TV presenter and model Alexa Chung, singer-songwriter and drummer Andy Burrows, glamour model Lucy Pinder, comedian Jack Dee, Magician Ben Hart and singer/actress Gina Beck. Harlequins rugby and England rugby player Joe Marchant. Actor Colin Firth is from Winchester and was educated at Montgomery of Alamein School (now Kings' School). The adventurer and model Laura Bingham was born and brought up in the local area attending The Westgate School. The singer-songwriter Frank Turner is from Winchester."]}, {"page": "The Snowman", "response": ["The idea of a sequel had been resisted by Raymond Briggs for several years, but he gave his permission for the film in 2012. Howard Blake was one of the few crew members not asked to return; he was allegedly asked to \"send a demo\", which he refused citing the success of the original score. The film instead features a largely pop-music oriented soundtrack featuring a song called \"Light the Night\" by former Razorlight drummer Andy Burrows and incidental music by Ilan Eshkeri."]}, {"page": "Peter Symonds College", "response": ["* Andy Burrows—former drummer in the band Razorlight."]}, {"page": "Pinkpop Festival", "response": ["| - Christopher Green- Kodaline- Andy Burrows- Netsky Live"]}, {"page": "Razorlight", "response": ["Razorlight are an English indie rock band, formed in 2002 in London by lead singer and guitarist Johnny Borrell. Along with Borrell, the current line-up of the band is composed of founding members Björn Ågren on guitar and bassist Carl Delemo, as well as drummer Andy Burrows. This lineup is a reunion of the lineup from the band's second and third albums.", "The band released their debut album Up All Night on 28 June 2004, reaching number 3 in the UK album charts. The critical reception was generally positive, receiving good reviews from NME, Q magazine and Billboard. Drummer Shïan Smith-Pancorvo left the band in April and was replaced by Andy Burrows the following month. Up All Night was re-issued in April 2005, including the stand-alone single Somewhere Else as a bonus track, and peaked at Number 2.", "On 5 March 2009, it was announced that Andy Burrows had quit the band to \"pursue other musical ventures\". Johnny Borrell stated that although \"over the last two albums and five years Andy has been an integral part of Razorlight and we will miss him\", the band would continue. Burrows initially claimed that his time with the band had been \"an amazing experience\", but later went on to state that he \"hated being in the band. Johnny and I didn't get on. Now I've got my freedom. He never wanted people to know that we both wrote songs\". A well publicised fight between Borrell and Burrows occurred in 2006 at the Hawley Arms in Camden, London over songwriting credits for the song America with it being reported that Burrows was the main songwriter of the song. In 2019, Burrows revealed that he had bumped into Borrell in central London three years prior and was \"brushed off\". He stated that Borrell \"acted like I was a stranger, it was the weirdest thing. I think I went off and got extremely drunk, but felt very weird for a couple of days… it was almost like seeing a ghost\". In 2016, Borrell admitted that the band were collaborative and that Burrows had helped shape the sound of the second album, stating that \"I rate the drummer Andy Burrows. He was a great drummer with a melodic ear – but if you want to figure out who was taking Razorlight in which direction, then maybe have a listen to what we're each doing now. I'm playing psychedelic blues-tango, and his stuff is so middle of the road it's got more white lines than Liam Gallagher in 1997\".", "In April 2021, the band announced the return of the original lineup, featuring Borrell and Ågren, as well as Andy Burrows and Carl Dalemo with a livestreamed concert to be held on 2 June 2021.This marked the first appearance of the classic lineup in over a decade.", "| Andy Burrows", "*Andy Burrows – drums (2004–2009, 2021–present)"]}, {"page": "Carl Barât", "response": ["In January 2013 Barât announced that guitarist Johnny Marr (formerly of The Smiths) and drummer Andy Burrows (formerly of Razorlight and We Are Scientists) would feature on his second solo album, due for release in 2013. Barât revealed demo versions of tracks 'War of the Roses' and 'Victory Gin' from his second solo effort online."]}, {"page": "Johnny Borrell", "response": ["In 2002 he went on to form his own band which played house parties, rehearsing at a Hackney warehouse called Unit 13, comprising Carl Dalemo, Shïan Smith-Pancorvo (later replaced by Andy Burrows) and Björn Ågren. The band were watching a video recording of themselves playing a gig and misheard the ending refrain 'Its alright, it's alright' from the song \"In The City\" as 'razor-light, razor-light' which was then chosen as the band name. In early 2003 XFM DJ John Kennedy began to play the band's demos, recorded at Toerag Studios in east London with producers Liam Watson and John Fortis. Razorlight signed to Mercury Records on 23 May 2003 after the Universal label fought off bids from Sony.", "December 2009 also saw the digital release of a documentary on Razorlight made by UK film director Charles Henri-Belleville. Titled 'Rock'n'Roll Lies' the 70-minute film follows the band on a week of UK shows intercut with band member interviews about Razorlight's history. The film also features bonus material including Borrell's charity hovercraft crossing of the English Channel and drummer Andy Burrows' trials and tribulations whilst giving up smoking while on tour.", "In 2008 Borrell and bandmate Andy Burrows appeared at the Teenage Cancer Trust comedy night at the Royal Albert Hall, hosted by Borrell's friend Noel Fielding. The two played a short acoustic set."]}, {"page": "Tim Wheeler", "response": ["Recorded in Ash's New York studio, Wheeler played almost everything himself, roping in musician friends when he needed a hand: Andy Burrows formerly of Razorlight and Fred Aspelin (Alberta Cross) each played some drums; Ilan Eshkeri and Oliver Kraus helped with the string and brass arrangements performed by the London Metropolitan Orchestra; Leanne Macomber from Ejecta and Neon Indian sang; and Moon Hooch's Wenzl McGowen played saxophone. There is even a sample of Wheeler's father's piano playing on the album's epic centerpiece \"Medicine\".", "Wheeler announced his first solo dates to support the release of the album on 4–7 November. He played Bush Hall – London, Night & Day- Manchester, ABC2 – Glasgow and Oh Yeah Centre – Belfast. In addition, he supported Andy Burrows in Amsterdam and Brussels."]}, {"page": "We Are Scientists", "response": ["thumb|right|Keith and Chris after the departure of Tapper remained as the only two official members until Andy Burrows joined in 2009", "thumb|right|Andy Burrows joined the band for the recording of Barbara and some of the subsequent live shows.", "Having worked with a number of different drummers since Michael Tapper's departure in 2007, the band announced that Andy Burrows would be joining them for recording and touring. The band had originally intended on using a succession of drummers on their third album; however after Burrows left his band Razorlight, he became their permanent drummer. In February 2010 they announced that their new record would be titled Barbara and would be released on June 14, 2010. This would also be the first release through the band's own label, Master Swan Recordings, with distribution handled by PIAS Recordings.", "A new album was first teased by the band at The Isle of Weight Festival 2011, where Murray suggested the band would be recording in Autumn that year. It was in 2012 that the band actually began recording new material, working with producer Chris Coady in New York City, where both Keith Murray & Chris Cain reside. The band worked in a number of New York studios, predominately The Magic Shop, DNA Studio and Ash's home studio Atomic Heart. In December 2012 that drummer Andy Burrows confirmed that they had finished work on their new album, with intent to release in early 2013.", "Due to the fact the band had recorded without a record label, and had also fired their management after Barbara, the band then spent a lot of 2013 label shopping and looking for new management. Realising they would be unable to put the album out that year, the band released a two-track single featuring the songs \"Something About You\" and \"Let Me Win\". The single was released through their own record label Master Swan Records and Neon Gold Records on July 16. New material was further previewed across a string of UK tour dates in July. Eventually the band signed to release the finished album with 100% Records, putting out a teaser EP titled Business Casual on October 14, 2013. The EP includes lead singles \"Return the Favor\" and \"Dumb Luck\" along with album off cut \"Good Answer\", a demo of new track \"Courage\" and a cover of Berlin's \"Take My Breath Away\" - which features occasional scientist Max Hart on pedal-steel guitar. Andy Burrows had recorded drums for the album and subsequent EP and singles, but by the time the band were eventually able to release and tour Burrows was busy with his solo-career. This led to Keith Carne taking over the majority of live commitments, with Burrows stepping in for occasional dates, depending on his availability.", "*Andy Burrows – drums, percussion, keyboards, backing vocals (2009–2014)", " bar:Andy     text:Andy Burrows"]}, {"page": "Chris T-T", "response": ["In 2007, T-T signed to Xtra Mile Recordings and in 2008 his sixth album Capital was released, preceded by the 'This Gun Is Not A Gun' EP. With larger-scale production than his previous work, it included appearances from Andy Burrows (ex Razorlight drummer), Phil Sumner (British Sea Power cornettist), Jim Bob (Carter USM), Jon Boden (Bellowhead and Spiers & Boden fiddler) and Emmy The Great. Two further singles, 'A-Z' and '(We Are) The King of England' were also released."]}, {"page": "Novastar", "response": ["Joost Zweegers spent four years creating the next album, titled Inside Outside, which was released by Warner Music in Belgium and The Netherlands on 28 March 2014. It was influenced by many musicians including Richard Ashcroft (The Verve), Pink Floyd, George Harrison, Paul Weller, and Fleetwood Mac. Zweegers worked with songwriters Dean Dyson, Andy Burrows, and James Walsh."]}, {"page": "Muso Awards", "response": ["*Best Drummer - Andy Burrows of Razorlight"]}, {"page": "Caribana Festival (Switzerland)", "response": ["Side stages : Kill It Kid, The Animen, The Coronas, Take Me Home, Andy Burrows, The Heavy, Aya Waska, Tarrus Riley, Birdy Nam Nam, Célien Schneider, Imagine Dragons, The Jim Jones Revue"]}, {"page": "Ziggo Dome", "response": ["| Andy Burrows"]}, {"page": "Tom Smith (musician)", "response": ["In October 2011, Smith announced that he was collaborating with his good friend Andy Burrows under the moniker Smith & Burrows. Their album Funny Looking Angels was released on 25 November 2011. In December 2011, Smith & Burrows played a number of shows throughout Europe. Smith also provided backing vocals to the lead single from the second Andy Burrows' solo album Company, \"Keep On Moving On\". Smith also sang in Burrows' track \"Watch Me Fall Again\" from his third album Fall Together Again (2014).", "Smith is an avid fan of Arsenal FC. He is a friend of fellow musicians Guy Garvey and Andy Burrows. In April 2011, he ran the London Marathon alongside Editors bandmate Russell Leetch, raising over £10,000 for Oxfam.", "With Andy Burrows"]}, {"page": "The Joiners", "response": ["In December 2006, writer Oliver Gray published a book entitled Access One Step: The Official History of the Joiners Arms, which documents the history of the venue and includes a foreword by Razorlight drummer Andy Burrows."]}, {"page": "America (Razorlight song)", "response": ["\"America\" is a song by English indie rock band Razorlight and is the fourth track to their self-titled second studio album, Razorlight (2006).  It was written by Johnny Borrell and Andy Burrows (credited to Borrell, Burrows, and Razorlight) and was also released as the second single from that album on 2 October 2006.", "Category:Songs written by Andy Burrows"]}, {"page": "Before I Fall to Pieces", "response": ["Category:Songs written by Andy Burrows"]}, {"page": "The Chavs", "response": ["The Chavs are an English rock supergroup formed in 2004, by former Libertines and Dirty Pretty Things guitarist Carl Barât.   Alongside Barât in the band are Tim Burgess of The Charlatans, Primal Scream keyboardist Martin Duffy and drummer Andy Burrows from Razorlight.  They made their live debut at Chatham's Tap'n'Tin, in December 2004, where the set included the Libertines songs \"Death On the Stairs\", \"France\" and \"Road To Ruin\", the Charlatans' \"A Man Needs To Be Told\" and \"North Country Boy\", Burgess' solo song \"I Believe In The Spirit\" and festive songs including a cover of \"Fairytale of New York\" by The Pogues.", "The band appeared in almost full format at the 2007 Glastonbury Festival in Lost Vagueness; with Carl, Jamie and Tim. The band was missing Martin Duffy and Andy Burrows but were assisted by Anthony Rossomando, Didz Hammond and Gary Powell in their place. The band appeared on an open mic stage and turned up wearing fancy dress; only revealing themselves after one song."]}, {"page": "Matt Haig", "response": ["In 2017, Haig published How to Stop Time, a novel about a man who appears to be 40 but has, in fact, lived for more than 400 years and has met Shakespeare, Captain Cook and F. Scott Fitzgerald. In an interview with The Guardian, Haig revealed the book has been optioned by StudioCanal films, and Benedict Cumberbatch had been \"lined up to star\" in the film adaptation. Reasons to Stay Alive won the Books Are My Bag Readers' Awards in 2016 and How to Stop Time was nominated in 2017. In August 2018, he wrote lyrics for English singer and songwriter Andy Burrows's music album, the title of which was derived from Haig's book Reasons to Stay Alive."]}, {"page": "Wonderful Life (Black song)", "response": ["In 2011, the song featured on the Christmas album Funny Looking Angels by Smith & Burrows, a collaboration between Tom Smith (Editors) and Andy Burrows (We Are Scientists and ex-Razorlight)."]}, {"page": "Burrows (surname)", "response": ["* Andy Burrows (b. 1979), British musician"]}, {"page": "Ilan Eshkeri", "response": ["| Composed with Andy Burrows"]}, {"page": "Captain Phoenix", "response": ["Lead singer Ben Burrows is younger brother to Andy Burrows, former drummer of Razorlight. They supported Razorlight at a secret gig at The Railway Inn, Winchester when Razorlight previewed second album material."]}]}}