{"wiki_id": "http://www.wikidata.org/entity/Q16735231", "itemLabel": "Raf Riley", "itemDescription": "producer", "wikipedia_url": "https://en.wikipedia.org/wiki/Raf_Riley", "wikipedia_page": {"main": "Rafael Greifer, better known by his stage name Raf Riley, is a record producer and artist from North London. He was formerly a member of ExR alongside Etta Bond, and is signed to OddChild Music and has released on Diplo's Mad Decent label. ExR released two EPs: Emergency Room and Meds. He released his own EP titled Now That's What I Call Gangster Beats!! in January 2013. Riley is also known for his comedy production: alongside Reuben \"Dangerman\" Dangoor, Riley is one half of the Grand Spectacular. Their 2010 single \"Being A Dickhead's Cool\" became a viral video, receiving over thirteen million YouTube views. Riley and Dangerman are also part of the comedy rap trio Sabotage Party alongside Ray Knotts, in which he raps as well as produces. Dangerman also designs and directs all OddChild Music artwork and ExR videos.\nRaf Riley has worked with many artists including Professor Green, Labrinth, Diplo, Naughty Boy, Dr. Luke and Mike Skinner. Riley has  had cuts with Elliphant, Skepta and has remixed for Sigma, Conor Maynard and Plan B.", "link_mentions": [{"page": "Riley (surname)", "response": ["*Raf Riley, English record producer"]}, {"page": "Etta Bond", "response": ["Bond and fellow OddChild signing Raf Riley (who's also had releases with Mad Decent) released a free collaboration EP on 20 July 2012 under the name Emergency Room, featuring the previously unreleased demo \"Ask Me To Stay\" alongside 7 other tracks, including the single \"Boring Bitches\", featuring Lady Leshurr. The video was produced by Reuben Dangoor alongside the EP artwork, and received mixed opinions due to the controversial content shown in the video.Boring Bitches. YouTube. Retrieved on 2012-09-12.", "On 13 October 2014, Bond released her third extended play, entitled #CoolUrbanNewTalent. The release was her first solo EP, and features collaborations with Raf Riley and Delilah. As a follow up to #CoolUrbanNewTalent Etta released her first single '18' featuring Etta's old lady alter ego who is 'growing old disgracefully' produced by MNEK. The video of '18' was released on 10 July 2015. Etta is currently working on new music with Raf Riley, Wilkinson, Mojam, Fred Ball (producer) and Naughty Boy.", "! scope=\"row\" | Emergency Room (with Raf Riley)", "! scope=\"row\" | Meds (with Raf Riley)", "| 2012 || \"Treatment\" (with Raf Riley) || Labrinth", "| 2013 || \"Playing with Fire\" (with Raf Riley) || Plan B featuring Labrinth", "| 2011 || \"Come Over\" (with Raf Riley)", "| 2011 || \"Every Dream\" (with Raf Riley)", "| 2012 || \"The Funeral\" (with Raf Riley)", "| 2012 || \"Fight Til the Death\" (with Raf Riley)", "| 2013 || \"Vomit\" (with Raf Riley)", "| 2013 || \"Mr. Manly\" (with Raf Riley)", "| with Raf Riley feat. Lady Leshurr", "| with Raf Riley", "| with Raf Riley", "| with Raf Riley ", "| with Raf Riley "]}, {"page": "OddChild Music", "response": ["Bond and fellow OddChild signing Raf Riley released a free collaboration EP as ExR on 20 July 2012 called Emergency Room, featuring the previously unreleased demo \"Ask Me To Stay\" alongside 7 other tracks. The EP includes the promotional single \"Boring Bitches\", featuring Lady Leshurr. The video was produced by Reuben Dangoor alongside the EP artwork, and received mixed opinions due to the controversial content shown in the video.", "On 13 October 2014, Etta Bond's third EP and debut solo EP, #CoolUrbanNewTalent, was released for free download. It features collaborations with Delilah, Raf Riley and Chris Loco. The video for Etta Bond's debut solo single '18' was released on 10 July 2015.", "* Raf Riley", "| Etta Bond & Raf Riley", "| Raf Riley", "| Etta Bond & Raf Riley"]}, {"page": "ExR", "response": ["ExR is a musical side project of Etta Bond and Raf Riley, signed to Labrinth's record label Odd Child. The duo released their first collaborative extended play Emergency Room for free download on 20 July 2012 following a series of unreleased ExR demos. They released two promotional singles from the EP in the form of music videos. Etta also performed \"Baddy\" in May 2013 for SB.TV as part of their String Sessions feature alongside a string quartet. After the EP, Riley released a solo EP and Bond worked on some new material with other producers."]}, {"page": "Lady Leshurr", "response": ["! scope=\"row\"| \"Boring Bitches\"(Etta Bond and Raf Riley featuring Lady Leshurr)"]}, {"page": "The Grand Spectacular", "response": ["#REDIRECT Raf Riley"]}, {"page": "Neon Icon", "response": ["Neon Icon is the debut studio album by American rapper Riff Raff. It was released on June 24, 2014, by Mad Decent. Riff Raff enlisted the contributions from Childish Gambino, Mac Miller, Paul Wall, Amber Coffman, Mike Posner and Slim Thug; as well as the production that was handled by DJA, Larry Fisherman, DJ Mustard, Raf Riley, Harry Fraud and Diplo (who executive produced the album). Neon Icon was supported by the singles \"How to Be the Man\" and \"Tip Toe Wing in My Jawwdinz\"."]}, {"page": "FYO (EP)", "response": ["FYO (an acronym for Fuck Your Opinion) is the debut extended play (EP) by English rapper Avelino. It was produced in its entirety by Raf Riley, and released for free download through OddChild Music, on 7 April 2016. The project was also released onto the iTunes Store on 11 April 2016, accompanied by two bonus tracks. It spawned one single; \"Welcome to the Future\", which premiered on 31 March 2016, a week before the rest of the project.", "All tracks produced by Raf Riley."]}, {"page": "Ashnikko", "response": ["Ashnikko's first song, \"Krokodil\", was produced by Raf Riley and published to SoundCloud in July 2016. She released her first EP, Sass Pancakes, under Digital Picnic Records in 2017. The EP was produced by Raf Riley and features appearances from Avelino. Ashnikko's second EP, Unlikeable, was released in November 2018. The EP spawned the singles \"Blow\", \"Nice Girl\", \"Invitation\" featuring Kodie Shane, and \"No Brainer\"."]}, {"page": "2000and4Eva", "response": ["2000and4Eva (stylised in all caps) is the debut mixtape by British rapper and singer-songwriter Bree Runway. It was released on 6 November 2020 via EMI Records and UMG, and was supported by the singles \"Apeshit\", \"Damn Daniel\", \"Gucci\", \"Little Nokia\" and \"ATM\". 2000and4Eva features guest appearances from Missy Elliott, Yung Baby Tate, Maliibu Miitch and Rico Nasty, as well as production from musicians such as EasyFun and Raf Riley, among others. The mixtape expands upon the electronic infused hip hop and trap-pop sound of its predecessor Be Runway (2019) while expanding into different genres such as rock, reggae, and dance."]}, {"page": "Sega Bodega", "response": ["|Sega Bodega, Oscar Scheller, Raf Riley"]}, {"page": "Being a Dickhead's Cool", "response": ["#REDIRECT Raf Riley"]}]}}