{"wiki_id": "http://www.wikidata.org/entity/Q1670384", "itemLabel": "Richard Gregory", "itemDescription": "British psychologist", "wikipedia_url": "https://en.wikipedia.org/wiki/Richard_Gregory", "wikipedia_page": {"main": "Richard Langton Gregory  (24 July 1923 – 17 May 2010) was a British psychologist and Professor of Neuropsychology at the University of Bristol.", "link_mentions": [{"page": "Bristol", "response": ["The city has produced a number of scientists, including 19th-century chemist Humphry Davy (who worked in Hotwells). Physicist Paul Dirac (from Bishopston) received the 1933 Nobel Prize for his contributions to quantum mechanics. Cecil Frank Powell was the Melvill Wills Professor of Physics at the University of Bristol when he received the 1950 Nobel Prize for, among other discoveries, his photographic method of studying nuclear processes. Colin Pillinger was the planetary scientist behind the Beagle 2 project, and neuropsychologist Richard Gregory founded the Exploratory (a hands-on science centre which was the predecessor of At-Bristol/We The Curious)."]}, {"page": "Optical illusion", "response": ["Within visual perception, an optical illusion (also called a visual illusionIn the scientific literature the term \"visual illusion\" is preferred because the older term gives rise to the assumption that the optics of the eye were the general cause for illusions (which is only the case for so-called physical illusions). \"Optical\" in the term derives from the Greek optein = \"seeing\", so the term refers to an \"illusion of seeing\", not to optics as a branch of modern physics. A regular scientific source for illusions are the journals Perception and i-Perception) is an illusion caused by the visual system and characterized by a visual percept that arguably appears to differ from reality. Illusions come in a wide variety; their categorization is difficult because the underlying cause is often not clear but a classification proposed by Richard Gregory is useful as an orientation. According to that, there are three main classes: physical, physiological, and cognitive illusions, and in each class there are four kinds: Ambiguities, distortions, paradoxes, and fictions. A classical example for a physical distortion would be the apparent bending of a stick half immerged in water; an example for a physiological paradox is the motion aftereffect (where, despite movement, position remains unchanged). An example for a physiological fiction is an afterimage. Three typical cognitive distortions are the Ponzo, Poggendorff, and Müller-Lyer illusion. Physical illusions are caused by the physical environment, e.g. by the optical properties of water. Physiological illusions arise in the eye or the visual pathway, e.g. from the effects of excessive stimulation of a specific receptor type. Cognitive visual illusions are the result of unconscious inferences and are perhaps those most widely known."]}, {"page": "James Mark Baldwin", "response": ["In 1899 Baldwin went to Oxford to supervise the completion of the Dictionary... (1902). He was awarded an Honorary Doctorate in Science at Oxford University. (In the light of the foregoing, the deafening silence with which J. M. Baldwin was later treated in Oxford publications on the mind may well come to be regarded as one of the significant omissions in the history of ideas for the 20th century. Compare for example Richard Gregory: The Oxford Companion to the Mind, first edition, 1987.)"]}, {"page": "Müller-Lyer illusion", "response": ["One possible explanation, given by Richard Gregory,Richard L. Gregory, Eye and Brain, McGraw Hill, 1966. is that the Müller-Lyer illusion occurs because the visual system learns that the \"angles in\" configuration corresponds to an rectilinear object, such as the convex corner of a room, which is closer, and the \"angles out\" configuration corresponds to an object which is far away, such as the concave corner of a room. However, in a recent reportThe Müller-Lyer illusion explained by the statistics of image–source relationships Catherine Q. Howe and Dale Purves* PNAS January 25, 2005 vol. 102 no. 4 1234-1239 Catherine Howe and Dale Purves contradicted Gregory's explanation:"]}, {"page": "Idries Shah", "response": ["Langton House at Langton Green became a place of gathering and discussion for poets, philosophers and statesmen from around the world, and an established part of the literary scene of the time. The ICR held meetings and gave lectures there, awarding fellowships to international scholars including Sir John Glubb, Aquila Berlas Kiani, Richard Gregory and Robert Cecil, the head of European studies at the University of Reading who became chairman of the institute in the early 1970s."]}, {"page": "Café wall illusion", "response": ["It was first described under the name Kindergarten illusion in 1898, and re-discovered in 1973 by Richard Gregory. According to Gregory, this effect was observed by a member of his laboratory, Steve Simpson, in the tiles of the wall of a café at the bottom of St Michael's Hill, Bristol. It is a variant of the shifted-chessboard illusion originated by Hugo Münsterberg."]}, {"page": "R. D. Laing", "response": ["* How Does It Feel? (1976). Documentary on physical senses and creativity featuring Laing, Joseph Beuys, David Hockney, Elkie Brooks, Michael Tippett and Richard Gregory."]}, {"page": "Humanists UK", "response": ["| colspan=\"1\" |Sir Richard Gregory"]}, {"page": "Colin McGinn", "response": ["In 1984, McGinn discussed John Searle's Reith lectures on BBC Radio Three with Searle, Richard Gregory and Colin Blakemore. The following year, he and Sir Andrew Huxley debated animal rights with Bernard Williams as the moderator. He was interviewed for Jonathan Miller's documentary mini-series, Atheism: A Rough History of Disbelief (2003), later broadcast as The Atheism Tapes (2004).\"Atheism Tapes: Colin McGinn\" , The Richard Dawkins Foundation, 12 May 2006 (). He has also appeared in eleven episodes of Closer to Truth hosted by Robert Lawrence Kuhn, discussing consciousness, personal identity, free will, and materialism.\"Colin McGinn\", ClosertoTruth.com"]}, {"page": "School of Informatics, University of Edinburgh", "response": ["* Richard Gregory (1923–2010) , cognitive scientist at the University of Bristol"]}, {"page": "We the Curious", "response": ["At-Bristol opened in 2000 as the successor to the Exploratory, a science museum and demonstration centre, founded by Richard Gregory in the former terminus train shed at Bristol Temple Meads railway station (later home to the British Empire & Commonwealth Museum). The Exploratory was a separate organisation and none of the exhibits or staff were transferred when Bristol's new museum opened in a city centre site as part of the regeneration of the historical Floating Harbour. The project was funded with £44.3 million from the National Lottery, Millennium Commission, South West of England Regional Development Agency, and a further £43.4 million from commercial partners (including a controversial donation from Nestlé) and Bristol City Council. The selection and design of exhibits were criticised by Gregory and other scientific adviser as being \"totally inappropriate to the spirit of science\". Goéry Delacôte served as Chief Executive from 2005 until 2012."]}, {"page": "Ames room", "response": ["Ames's original design also contained a groove that was positioned such that a ball in it appears to roll uphill, against gravity. Richard Gregory regarded this apparent \"anti-gravity\" effect as more amazing than the apparent size changes, although today it is often not shown when an Ames room is exhibited."]}, {"page": "Anne Treisman", "response": ["Treisman received her BA in French Literature at Newnham College, Cambridge in 1954. She received a first class BA with distinction, which earned her a scholarship that she used to obtain a second BA in psychology. During this extra year, Treisman studied under the supervision of Richard Gregory, who introduced her to various methods of exploring the mind through experiments in perception.Wikibooks:Applied History of Psychology/History of Research on Attention While at Cambridge, she was active in the folk music scene."]}, {"page": "Nigel Balchin", "response": ["#Freja Mary Balchin (born 1944),GRO Register of Births: MAR 1945 1a 551 MARYLEBONE – Freja M. Balchin, mmn = Walshe who became the first female president of Cambridge University's theatre groupDaily Express, 1 May 1966 and married Professor Richard Gregory (1923–2010), a psychologist."]}, {"page": "Richard Langton Gregory", "response": ["#REDIRECT Richard Gregory"]}, {"page": "R. L. Gregory", "response": ["#REDIRECT Richard Gregory"]}, {"page": "Visual language", "response": ["Abstract art has shown that the qualities of line and shape, proportion and colour convey meaning directly without the use of words or pictorial representation. Wassily KandinskyWassily Kandinsky, Point and Line to Plane : Contribution to the Analysis of the Pictorial Elements, 1947, trans, Howard Deastyne and Hilla Rebay, Solomon Guggenheim Foundation, New York showed how drawn lines and marks can be expressive without any association with a representational image. From the most ancient cultures and throughout history visual language has been used to encode meaning: \"The Bronze Age Badger Stone on Ilkly Moor is covered in circles, lines, hollow cups,winged figures, a spread hand, an ancient swastika, an embryo, a shooting star? … It's a story-telling rock, a message from a world before (written) words.\" Richard Gregory suggests that, \"Perhaps the ability to respond to absent imaginary situations,\" as our early ancestors did with paintings on rock, \"represents an essential step towards the development of abstract thought.\""]}, {"page": "Works based on Alice in Wonderland", "response": ["* Richard Gregory in his book Mirrors in Mind, questions why looking-glass images are right-left reversed. He explains with diagrams the reversals occurring in Carroll's Through The Looking-Glass while also pondering how a scientific phenomenon is reflected in the vocabulary of the text, dwelling on the importance of words such as \"re-turning\", \"behind\", \"back\"."]}, {"page": "Hollow-Face illusion", "response": ["According to Richard Gregory, \"The strong visual bias of favouring seeing a hollow mask as a normal convex face is evidence for the power of top-down knowledge for vision\". This bias of seeing faces as convex is so strong it counters competing monocular depth cues, such as shading and shadows, and also very considerable unambiguous information from the two eyes signalling stereoscopically that the object is hollow. (Lighting a concave face from below to reverse the shading cues making them closer to those of a convex face lit from above can reinforce the illusion.)"]}, {"page": "AI winter", "response": ["The report was contested in a debate broadcast in the BBC \"Controversy\" series in 1973. The debate \"The general purpose robot is a mirage\" from the Royal Institution was Lighthill versus the team of Donald Michie, John McCarthy and Richard Gregory. McCarthy later wrote that \"the combinatorial explosion problem has been recognized in AI from the beginning\"."]}, {"page": "King Alfred School, London", "response": ["* Richard Gregory, experimental psychologist"]}]}}