{"wiki_id": "http://www.wikidata.org/entity/Q16732785", "itemLabel": "Jack Monroe", "itemDescription": "British writer, journalist and political campaigner", "wikipedia_url": "https://en.wikipedia.org/wiki/Jack_Monroe", "wikipedia_page": {"main": "Jack Monroe (born 17 March 1988) is a British food writer, journalist and activist known for campaigning on poverty issues, particularly hunger relief. Monroe initially rose to prominence for writing a blog titled A Girl Called Jack (now renamed Cooking on a Bootstrap), and has since written for publications such as The Echo, The Huffington Post, The Guardian, and The New Yorker, as well as publishing several cookbooks focusing on \"austerity recipes\" and meals which can be made on a tight budget.\n\n", "link_mentions": [{"page": "People for the Ethical Treatment of Animals", "response": ["PETA's campaign has received backlash from the autism community. A 2008 PETA billboard was taken down by the Autistic Self Advocacy Network. In 2017, British food writer, journalist and hunger relief activist Jack Monroe, demanded PETA remove her recipes from their website \"with immediate effect coz I wrote them with my autism\". PETA removed her recipes, but did not remove the \"Got Autism?\" article from their website. It has been argued that the frowny face in the campaign image negatively stereotypes autistic people."]}, {"page": "Greenbelt Festival", "response": ["| rowspan=\"3\" |Pussy Riot, We Are Scientists, Ozomalti, Ibibio Sound Machine, I'm With Her, Duke Special, Lowkey, Lewis Watson, The Reverend Peyton's Big Damn Band, CC Smugglers, Lee Bains III & The Glory Fires, Pierce Brothers, L.A. Salami, Grace Petrie, Martyn Joseph, Zach Said, Lots Holloway, Xylaroo, The Welcome Wagon, Jack Monroe, Michael Eavis, Kate Raworth, Carol Ann Duffy, Jon McGregor, Harry Baker, Jojo Mehta, Simon Mayo, Vicky Beeching, Lauri Love, Dawn Foster, Robyn Travis, Jonathan Bartley, Eve Poole, Broderick Greer, Lynne Segal, Rants n Bants, Winnie Varghese, Anthony Reddie, Sam Wells, Anna Kessel, Matthew Morris, Paula Gooder, Peterson Toscano, Roman Krznaric, Stephen James Smith, Garth Hewitt, Flo & Joan, Harry & Chris, Tony Law, Bryony Kimmings, Alula Cyr, Milk Presents, Malak Mattar"]}, {"page": "Southend-on-Sea", "response": ["* Jack Monroe, blogger, campaigner"]}, {"page": "Cookbook", "response": ["Single-subject books, usually dealing with a specific ingredient, technique, class of dishes or target group (e.g. for kids), are quite common as well. Jack Monroe for example features low budget recipes.  Some imprints such as Chronicle Books have specialized in this sort of book, with books on dishes like curries, pizza, and simplified ethnic food. Popular subjects for narrow-subject books on technique include grilling/barbecue, baking, outdoor cooking, and even recipe cloning (Recipe cloning is copying commercial recipes where the original is a trade secret)."]}, {"page": "Jamie Oliver", "response": ["Oliver was criticised for underestimating the cost of supposedly cheap food he encouraged poor people to prepare for themselves, also for an unrealistic view of poverty in Britain and round the Mediterranean. Cookery writer and poverty campaigner Jack Monroe stated that Oliver's comments \"support damaging myths that poor people are only poor because they spend their money on the wrong things, rather than being constrained by time, equipment, knowledge or practicalities\"."]}, {"page": "David Walliams", "response": ["In July 2020, tweets by author and activist Jack Monroe described Walliams' books as \"like Little Britain for kids\", with \"horrific racism and classism and bodyshaming in a veneer of privileged deniability\".;  Harper Collins issued a response, stating \"David Walliams's books have a diverse readership which is reflected in their content\"."]}, {"page": "Richard Littlejohn", "response": ["===Jack Monroe===", "In 2013, Littlejohn was accused of taking insufficient care to check the facts before publishing an article critical of cookery writer and poverty campaigner Jack Monroe. Littlejohn suggested that Monroe chose to give up her job. Monroe's young son was unsettled with a range of different carers. As Monroe had grown up in a home with foster children, she is aware of the potential for harming him. Monroe tried unsuccessfully to negotiate flexible hours so she could work and look after her baby, but gave up her job so she could look after the child better. Littlejohn incorrectly suggested that Monroe was an unemployed welfare claimant."]}, {"page": "Food bank", "response": ["Then-UK Prime Minister David Cameron said in the House of Commons in 2012 that he welcomed the efforts of food banks. Caroline Spelman, his Secretary of State for Environment, Food and Rural Affairs, has described food banks as an \"excellent example\" of active citizenship. Labour MP Kate Green has a different view, feeling that the rise of food banks reflects people being let down by the state welfare system, saying: \"I feel a real burning anger about them ... People are very distressed at having to ask for food; it's humiliating and distressing.\" Cookery writer and poverty campaigner Jack Monroe wrote that those referred to food banks or given vouchers were \"the lucky ones with a good doctor or health visitor who knows us well enough to recognise that something has gone seriously wrong\" and expressed concern for those who lack this support."]}, {"page": "Southend West (UK Parliament constituency)", "response": ["Jack Monroe had previously been standing for the National Health Action Party, before withdrawing their candidacy on 11 May 2017, citing death threats and concern for their health."]}, {"page": "Westcliff High School for Girls", "response": ["* Jack Monroe, journalist and campaigner"]}, {"page": "Katie Hopkins", "response": ["Hopkins' social media presence and outspoken views, especially on UK politics, social class, migrants and race, have attracted controversy, criticism, media scrutiny, legal issues, protests and petitions. She has been accused of racism by journalists, advocacy groups and politicians for her comments about migrants. In 2016, Mail Online was forced to pay significant damages to a Muslim family whom Hopkins had falsely accused of extremist links. In the 2017 libel case Monroe v Hopkins, Hopkins was required to pay damages and legal costs to Jack Monroe after making defamatory remarks on Twitter. ", "===Jack Monroe===", "Cookery writer and anti-poverty campaigner Jack Monroe threatened a libel action against Katie Hopkins after Hopkins accused Monroe of vandalising a war memorial, having confused Monroe with journalist Laurie Penny, who had written in support of that vandalism. Monroe called for an apology and a £5,000 donation to a migrants rescue charity. Hopkins later admitted that she was mistaken about the identity but did not apologise. Monroe began legal action in January 2016, and was awarded £24,000 in damages and £107,000 in legal costs in March 2017. After the decision became known, Hopkins tweeted an image of herself as the Virgin Mary and commented that she saw herself as \"the Jesus of the outspoken\". An appeal application was refused in January 2018 as it was considered unlikely to succeed. Hopkins sold her family home to pay the legal costs.", "Hopkins sold her Exeter home in March 2018 for £930,000. She applied for an individual voluntary arrangement in May 2018 to avoid bankruptcy, after the libel case brought by Jack Monroe."]}, {"page": "Allegra McEvedy", "response": ["In August 2006 she formed a civil partnership with Susi Smither. The couple dissolved their civil partnership in 2012. She was engaged to Jack Monroe but the relationship ended in 2015, before they married."]}, {"page": "Dean Chalkley", "response": ["He has also been shooting some fashion work for client's such as Sport and Street magazine and Levi's and likes to shoot for The Observer magazine for which he has photographed actors such as Rhys Ifans, Dominic West, Rupert Everett, Bond girl Eva Green, former model and author Sophie Dahl, Clémence Poésy in 2010, Holly Willoughby and Jack Monroe in 2014. Chalkley shot Jake Bugg for an article by Krissi Murison for The Times published on 21 September 2014."]}, {"page": "List of British people of Cypriot descent", "response": ["*Jack Monroe, poverty campaigner"]}, {"page": "List of Question Time episodes", "response": ["|Chris Grayling, Tristram Hunt, Jeremy Browne, Neil Hamilton, Jack Monroe, Kirstie Allsopp"]}, {"page": "Matt Tebbutt", "response": ["In April 2020 it was announced that Tebbutt would co-host Daily Kitchen Live on BBC One alongside Jack Monroe. The show is made by Cactus TV who also created Saturday Kitchen. The programme, made in response to issues stemming from the COVID-19 pandemic, offers tips and guidance to families struggling with limited resources for a two-week period commencing 14 April 2020."]}, {"page": "National Health Action Party", "response": ["The party stood five candidates at the 2017 general election. Food blogger and activist Jack Monroe was announced as the NHA Party candidate for Southend West, but withdrew due to ill health and receiving death threats. The candidates standing were:"]}, {"page": "Hunger in the United Kingdom", "response": ["In December 2013, an e-petition by hunger relief campaigner Jack Monroe led to a parliamentary debate on hunger in the UK. Also in December, a group of doctors and academics wrote to the peer-reviewed  British Medical Journal, noting recent developments such as a doubling in the number of malnutrition cases received by hospitals, and asserting that hunger in the UK had reached the level of a \"public health emergency\"."]}, {"page": "Thee Faction", "response": ["*Interview by Jack Monroe"]}, {"page": "A Girl Called Jack", "response": ["#redirectJack Monroe"]}, {"page": "Joshua Bonehill-Paine", "response": ["===Public order offences and tweets to Jack Monroe===", "In April 2015, Bonehill-Paine claimed to have been the man arrested and released on bail on suspicion of sending \"hate\" tweets to Jack Monroe, a Guardian columnist.Jenn Selby \"Jack Monroe: Man posing as Ukip candidate arrested for abusing gay poverty campaigner\", The Independent, 19 April 2015Press Association \"Jack Monroe Twitter abuse: man re-bailed\", The Guardian, 25 April 2015 The tweets were made by a hoax account purporting to be from a former UKIP candidate, and UKIP reported the account to the police. In a statement on his website, Bonehill-Paine did not admit responsibility, but said that the tweets were \"of a comical nature and [I] commend the level of free speech used\"."]}, {"page": "Jack Monroe (disambiguation)", "response": ["Jack Monroe is a British writer and campaigner.", "Jack Monroe may also refer to:", "*Jack Monroe (character), a Marvel Comics character", "*Jack Monroe (song), a British folk song"]}, {"page": "Sarah Vine", "response": ["In November 2014, she wrote a column criticising food writer and activist Jack Monroe for mentioning the death of David Cameron's son in 2009 in one of a series of tweets criticising Cameron. Vine went on to question Monroe's decision to have a child herself, insinuating that her choice led to her own poverty. Monroe condemned the article as 'homophobic, transphobic, deadnaming, ignorant, and generally ghastly lies'."]}]}}