{"wiki_id": "http://www.wikidata.org/entity/Q16732920", "itemLabel": "Christopher Moulds", "itemDescription": "British conductor", "wikipedia_url": "https://en.wikipedia.org/wiki/Christopher_Moulds", "wikipedia_page": {"main": "Christopher Moulds is an English conductor of classical and baroque operas.", "link_mentions": [{"page": "Concerto Köln", "response": ["Their repertory stretches from early Baroque on through the Classical Era and as far into the nineteenth century as Wagner. They have also done a number of collaborative works, such as a disc juxtaposing Turkish folk music with pieces in a Turkish style by composers such as Mozart. They have recorded frequently with, among others, René Jacobs, Daniel Harding, Louis Langrée, David Stern, Ivor Bolton, Marcus Creed, Christopher Moulds and Evelino Pidò."]}, {"page": "Moulds (surname)", "response": ["* Christopher Moulds is an English conductor "]}, {"page": "Moulds, Christopher", "response": ["#redirectChristopher Moulds"]}, {"page": "Dina Kuznetsova", "response": ["In 2015/2016 season Dina Kuznetsova returned to her hometown of Moscow as Handel's Rodelinda at the Bolshoi Theatre under Christopher Moulds. The Bolshoi Theatre's production of Rodelinda, featuring Dina Kuznetsova as Rodelinda, has been awarded the prestigious Golden Mask Award for Best Opera Production."]}, {"page": "Klemens Sander", "response": ["In addition to opera, Sander is also active in the concert field. In 2005, he gave Charles Spencer (piano) his recital debut at London's Wigmore Hall. Concert invitations have taken him throughout Europe, to Japan and the US, including to the Berlin Philharmonie, London's Wigmore Hall, the Suntory Hall Tokyo, the Gewandhaus Leipzig, the Mozarteum Salzburg, the Laeiszhalle Hamburg, the Wiener Musikverein and the Wiener Konzerthaus, to the Salzburg Easter Festival, the Carinthian Summer, the Schleswig-Holstein Music Festival and the Oxford Lieder Festival. He has worked with the conductors Kent Nagano, Bertrand de Billy, Georges Prêtre, Franz Welser-Möst, Leopold Hager, Helmuth Rilling, René Jacobs, Martin Haselböck, Christopher Moulds, Christian Arming, Andrés Oroczco-Estrada, Thomas Dausgaard, Christophe Rousset, Stefan Vladar, Eivind Gullberg Jensen, H. K. Gruber, Andreas Spering and Jérémie Rhorer.Klemens Sander (Baritone) on Bach Cantatas Website"]}]}}