{"wiki_id": "http://www.wikidata.org/entity/Q16713577", "itemLabel": "Dean-Charles Chapman", "itemDescription": "English actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Dean-Charles_Chapman", "wikipedia_page": {"main": "Dean-Charles Chapman (born 7 September 1997) is an English actor. He is known for portraying Billy Elliot in the West End theatre production of Billy Elliot the Musical, Tom Blake in Sam Mendes's film 1917, and Tommen Baratheon in the fourth, fifth and sixth seasons of the HBO drama series Game of Thrones.", "link_mentions": [{"page": "1997", "response": ["* September 7 – Dean-Charles Chapman, English actor"]}, {"page": "1997 in film", "response": ["* September 7 – Dean-Charles Chapman, English actor"]}, {"page": "1997 in American television", "response": ["|Dean-Charles Chapman"]}, {"page": "List of A Song of Ice and Fire characters", "response": ["In the HBO television adaptation, he is portrayed by Callum Wharry in seasons one and two, and Dean-Charles Chapman from season four onwards."]}, {"page": "Billy Elliot the Musical", "response": ["* Billy – Leon Cooke, Matthew Koon, Layton Williams, Corey Snide, Oliver Taylor,New Billy – Oliver Taylor  billyelliotthemusical.com. Retrieved 6 September 2011 Trent Kowalik, Dean-Charles Chapman, Fox Jackson-Keen,\"London Gets Its First Home Grown Billy\"  billyelliotthemusical.com. Retrieved 6 September 2011 Tom Holland"]}, {"page": "Screen Actors Guild Award for Outstanding Performance by an Ensemble in a Drama Series", "response": ["| Alfie Allen, Jacob Anderson, Dean-Charles Chapman, Emilia Clarke, Nikolaj Coster-Waldau, Liam Cunningham, Peter Dinklage, Nathalie Emmanuel, Iain Glen, Kit Harington, Lena Headey, Conleth Hill, Kristofer Hivju, Michiel Huisman, Faye Marsay, Jonathan Pryce, Sophie Turner, Carice van Houten, Gemma Whelan, Maisie Williams"]}, {"page": "List of people from the London Borough of Havering", "response": ["*Dean-Charles Chapman - famous actor born in Romford"]}, {"page": "List of British actors", "response": ["* Dean-Charles Chapman (born 1997)"]}, {"page": "Game of Thrones", "response": ["In King's Landing, the capital, Ned's old friend, King Robert I Baratheon (Mark Addy), shares a loveless political marriage with Cersei Lannister (Lena Headey). Her younger twin brother, Ser Jamie (Nikolaj Coster-Waldau), serves on the Kingsguard. The third and youngest Lannister sibling is the dwarf Tyrion (Peter Dinklage), who is attended by his mistress Shae (Sibel Kekilli) and the sellsword Bronn (Jerome Flynn). Cersei's father is Tywin (Charles Dance), head of House Lannister and richest man in Westeros. Cersei has, among three children, two sons: Joffrey (Jack Gleeson) and Tommen (Dean-Charles Chapman). Joffrey is guarded by the scar-faced warrior Sandor \"The Hound\" Clegane (Rory McCann).", "Although many of the cast returned after the first season, the producers had many new characters to cast in each of the following seasons. Because of the large number of new characters, Benioff and Weiss postponed introducing several key characters in the second season and merged several characters into one, or assigned plot functions to different characters. Some recurring characters were recast over the years; for example, Gregor Clegane was played by three different actors, while Dean-Charles Chapman played both Tommen Baratheon and a minor Lannister character."]}, {"page": "1997 in British television", "response": ["* 7 September – Dean-Charles Chapman, actor"]}, {"page": "List of Live episodes", "response": ["| LIVE's Pre-Oscar Celebration: Dean-Charles Chapman, Chad Wood, Oscar Memories and Flashbacks, LIVE's Oscar Countdown Games"]}, {"page": "Tommen Baratheon", "response": ["In the HBO television adaptation, Tommen Baratheon is portrayed by Callum Wharry from seasons one to two and by Dean-Charles Chapman from seasons four through six.", "Young actor Callum Wharry portrayed Tommen in the first and second season and was then recast with Dean-Charles Chapman from the fourth season until his death in the sixth season."]}, {"page": "List of Game of Thrones characters", "response": ["| Dean-Charles Chapman || Tommen Baratheon || colspan=2  ||  ||  || colspan=2  || colspan=2 ", "* Dean-Charles Chapman as Martyn Lannister (season 3)", "thumb|upright=0.5|Dean-Charles Chapman", "Tommen Baratheon (seasons 1–6) portrayed by Callum Wharry in seasons 1 and 2, and by Dean-Charles Chapman from season 4 onwards. Tommen Baratheon of House Baratheon is the prince presented as the youngest son of King Robert Baratheon and Queen Cersei Lannister. Like his older siblings Joffrey and Myrcella his actual father is his uncle Ser Jaime Lannister. Like his sister he is good-natured and passive in contrast to his brother Joffrey and is fond of his uncle Tyrion. When King Joffrey is poisoned at his own wedding, Tommen assumes the throne and marries Margaery Tyrell. His mother Cersei battles Margaery for influence over Tommen, and their subsequent war of words eventually results in Margaery and Cersei's arrest by the High Sparrow. After Cersei's temporary release ahead of her trial in front of the Faith Militant, she destroys the Sept of Baelor with wildfire, killing several people inside, including Margaery. Witnessing the event, Tommen, deeply in love with Margaery and heartbroken by her death, leaps from the tallest window in the Red Keep to his death."]}, {"page": "Game of Thrones (season 3)", "response": ["* Dean-Charles Chapman as Martyn Lannister"]}, {"page": "List of awards and nominations received by Game of Thrones", "response": ["| data-sort-value=\"Allen, Alfie\"| Alfie Allen, Jacob Anderson, Dean-Charles Chapman, Emilia Clarke, Nikolaj Coster-Waldau, Liam Cunningham, Peter Dinklage, Nathalie Emmanuel, Kit Harington, Lena Headey, Conleth Hill, Kristofer Hivju, Michiel Huisman, Faye Marsay, Jonathan Pryce, Sophie Turner, Carice Van Houten, Gemma Whelan, and Maisie Williams", "| data-sort-value=\"Altin, Josef\"| Josef Altin, Jacob Anderson, John Bradley, Thomas Brodie-Sangster, Dominic Carter, Dean-Charles Chapman, Gwendoline Christie, Emilia Clarke, Nikolaj Coster-Waldau, Ben Crompton, Liam Cunningham, Charles Dance, Peter Dinklage, Natalie Dormer, Nathalie Emmanuel, Iain Glen, Julian Glover, Kit Harington, Lena Headey, Isaac Hempstead-Wright, Conleth Hill, Rory McCann, Ian McElhinney, Pedro Pascal, Daniel Portman, Mark Stanley, Sophie Turner, Indira Varma and Maisie Williams"]}, {"page": "The Revolting World of Stanley Brown", "response": ["* Stanley Brown (Dean-Charles Chapman) – Stanley is the main character of the series. He is naturally inquisitive and into comics, gadgets and computer games, and often questions the way something works. He is a born leader, always at the center of his gang of friends, able to look after himself and others. With a natural understanding of appliances he can operate the cooker, washer, dryer, and his mother's various gadgets better than anyone – but she has had to ban him from taking anything apart after losing count of household gadgets he 'seconded' and 'adapted' for his experiments. Depending what Archie is up to, Stanley often appears to friends and family to be distracted: daydreaming, inconsiderate, clumsy, talking to himself, forgetful, absent-minded or never where he should be. He struggles to live with the thought that one day he will become the greatest scientist ever, and sometimes wants to be a normal thirteen-year-old."]}, {"page": "Before I Go to Sleep (film)", "response": ["Christine wakes up in a hospital bed and is visited by Nasch, this time as a friend and not as her therapist. He assures her the man responsible for her condition has been arrested. He tells Christine that she has visitors and that he hopes the visit will provide the breakthrough they have been hoping for. The real Ben (Adam Levy) appears with Adam (Dean-Charles Chapman) who is very much still alive. Christine’s memories begin to return when she sees her son."]}, {"page": "The White Queen (TV series)", "response": ["* Dean-Charles Chapman as Richard Grey, son of Elizabeth Woodville and Sir John Grey of Groby"]}, {"page": "Game of Thrones (season 4)", "response": ["Game of Thrones features a large ensemble cast, including Peter Dinklage, Nikolaj Coster-Waldau, Lena Headey, Emilia Clarke and Kit Harington. The season introduced a number of new cast members, including Pedro Pascal, Indira Varma, Michiel Huisman and Dean-Charles Chapman.", "* Dean-Charles Chapman as Tommen Baratheon", "Roles that were recast for season 4 include Michiel Huisman as Daario Naharis. Huisman replaces Ed Skrein, who portrayed the character in season 3. Dean-Charles Chapman plays the role of Tommen Baratheon, King Joffrey's younger brother. Tommen was played by Callum Wharry in seasons 1 and 2. Chapman appeared as Martyn Lannister in two episodes of season 3 (\"Walk of Punishment\" and \"Kissed by Fire\"). Hafþór Júlíus Björnsson was cast as Ser Gregor Clegane, called \"The Mountain\". Hafþór replaces Ian Whyte, who portrayed the character in season 2."]}, {"page": "Walk of Punishment", "response": ["Dean-Charles Chapman first appears in the role of Martyn Lannister in this episode. In Season 4, however, Chapman returns portraying a different character: Tommen Baratheon, who was played by Callum Wharry in previous seasons."]}, {"page": "List of British films of 2014", "response": ["|| Director: Rowan Joffé   Cast: Nicole Kidman, Colin Firth, Mark Strong, Anne-Marie Duff, Dean-Charles Chapman"]}, {"page": "Man Up (film)", "response": ["* Dean-Charles Chapman as Harry"]}, {"page": "The Lion and the Rose", "response": ["The episode has the introduction of new recurring cast members Roger Ashton-Griffiths as Mace Tyrell, the Lord of Highgarden, and Elisabeth Webster as Walda Frey, Roose Bolton's new bride. Young actor Dean-Charles Chapman takes over the role of Tommen Baratheon as of this episode. In a cameo appearance, the Icelandic band Sigur Rós performed their rendition of \"The Rains of Castamere\" at King Joffrey's wedding, and again during the credits."]}, {"page": "Game of Thrones (season 5)", "response": ["* Dean-Charles Chapman as Tommen Baratheon", "The fifth season adds previously recurring actors Indira Varma (Ellaria Sand), Michiel Huisman (Daario Naharis), Nathalie Emmanuel (Missandei), Dean-Charles Chapman (Tommen Baratheon), Tom Wlaschiha (Jaqen H'ghar) and Michael McElhatton (Roose Bolton) to the series' main cast."]}, {"page": "Breathe (2017 film)", "response": ["Breathe is a 2017 biographical drama film directed by Andy Serkis in his directorial debut, from a screenplay by William Nicholson. The film stars Andrew Garfield, Claire Foy, Hugh Bonneville, Tom Hollander, Ed Speleers and Dean-Charles Chapman; it tells the story of Robin Cavendish, who became paralysed from the neck down by polio at the age of 28."]}, {"page": "Glue (TV series)", "response": ["* Dean-Charles Chapman as Chris"]}, {"page": "The Wars to Come", "response": ["With this episode, Michiel Huisman (Daario Naharis), Nathalie Emmanuel (Missandei) and Dean-Charles Chapman (Tommen Baratheon) are promoted to series regulars. Ian Gelder (Kevan Lannister) and Eugene Simon (Lancel Lannister) make return appearances after an absence of several years (since the second season)."]}, {"page": "Into the Badlands (TV series)", "response": ["* Dean-Charles Chapman as Castor, a member of Pilgrim's followers who has the Gift. Is friends with Nix. (season 3)"]}]}}