{"wiki_id": "http://www.wikidata.org/entity/Q16741836", "itemLabel": "Henry Francis Conyngham, Earl of Mount Charles", "itemDescription": "British politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Henry_Francis_Conyngham,_Earl_of_Mount_Charles", "wikipedia_page": {"main": "Henry Francis Conyngham, Earl of Mount Charles (6 April 1795 – 26 December 1824), was an Irish Tory politician.\nConyngham was born to Henry Conyngham, 1st Marquess Conyngham, and his wife Elizabeth Denison. He was educated in 1813 at Trinity College, Cambridge. He was a Tory Member of Parliament (MP) for Donegal from 1818 until his death at the age of 29 in Nice, France. He died unmarried and with no issue, and was buried in Nice.", "link_mentions": [{"page": "Marquess Conyngham", "response": ["Several other members of the Conyngham and Burton families may also be mentioned. Henry Conyngham (died 1706), father of the first Earl Conyngham (of the 1718 creation), was a Major-General in the British Army and was killed in the War of the Spanish Succession. Francis Burton (died 1743), father of the second Baron Conyngham, was a Member of the Irish Parliament for Coleraine and County Clare. William Conyngham (who assumed the surname of Conyngham in lieu of Burton in 1781), younger son of Francis Burton and younger brother of the second Baron Conyngham, was a Member of the Irish Parliament and served as a Teller of the Exchequer. The Honourable Sir Francis Burton, second son of the second Baron, was a colonial administrator and Member of Parliament for County Clare. Elizabeth Conyngham, Marchioness Conyngham, wife of the first Marquess, was a mistress of King George IV. Henry Francis Conyngham, Earl of Mount Charles, eldest son of the first Marquess, represented County Donegal in the House of Commons but predeceased his father, unmarried. Lord Albert Denison Conyngham, third son of the first Marquess, assumed the surname of Denison in lieu of Conyngham in 1849 on succeeding to the vast fortune of his maternal uncle William Joseph Denison, and was raised to the peerage as Baron Londesborough the following year (see this title for more information on this branch of the family). Lady Jane Conyngham, second daughter of the first Marquess, was a Lady of the Bedchamber to Queen Victoria. Lord Francis Conyngham, second son of the second Marquess, was Member of Parliament for County Clare.", "**Henry Francis Conyngham, Earl of Mount Charles (1795–1824)", "***** Henry Francis Conyngham, Earl of Mount Charles (1795–1824)"]}, {"page": "Conyngham", "response": ["* Henry Francis Conyngham, Earl of Mount Charles (1795-1824), Irish politician"]}, {"page": "Henry Conyngham, Earl of Mount Charles", "response": ["#REDIRECT Henry Francis Conyngham, Earl of Mount Charles"]}, {"page": "Henry Conyngham", "response": ["*Henry Francis Conyngham, Earl of Mount Charles (1795–1824), Irish Tory politician"]}]}}