{"wiki_id": "http://www.wikidata.org/entity/Q16727807", "itemLabel": "Stuart Campbell", "itemDescription": "British video games journalist", "wikipedia_url": "https://en.wikipedia.org/wiki/Stuart_Campbell_(game_journalist)", "wikipedia_page": {"main": "Stuart Campbell is a video game designer, pro-Scottish independence blogger and former video game journalist. Born in Stirling, he moved to Bath in 1991 to work for computer magazine Amiga Power as a staff writer, where he gained attention for his video game reviews. He has lived in Somerset ever since, and made further contributions to a number of publications both within the video game industry and in the popular media.A long-term supporter of Scottish independence, Campbell launched the political blog \"Wings Over Scotland\" in November 2011.\n\n", "link_mentions": [{"page": "Boulder Dash", "response": ["The ZX Spectrum version was placed ninth in the Your Sinclair Top 100 Speccy Games Of All Time (Ever) by journalist Stuart Campbell."]}, {"page": "Track & Field (video game)", "response": ["Reviews for the home conversions varied depending on the platforms. Computer Entertainer reviewed the Atari 2600 version in 1984, scoring it 7 out of 8 stars. David M. Wilson and Johnny L. Wilson reviewed the home computer conversions for Computer Gaming World, and stated that \"the game is primarily a joystick buster\". Stuart Campbell, writing in Your Sinclair in 1992, considered the Spectrum version to be one of the worst games ever released for the machine."]}, {"page": "Amiga Power", "response": ["Amiga Power had a number of principles which comprised its philosophy regarding games. Like almost all Amiga magazines of the time, they marked games according to a percentage scale. However, Amiga Power firmly believed that the full range of this scale should be used when reviewing games. A game of average quality rated on this scale would therefore be awarded 50%. Stuart Campbell offered some rationale for this in his review of Kick Off '96 in the final issue of the magazine:", "The physical album took the form of a small hardback book, with two CDs attached to the inside of the front and back covers, and the 100-page Mighty Booklet sandwiched between them. The first CD – subtitled AP's Pick Of The Pops – featured remixes of music personally selected by AP team members (including former editors Matt Bielby, Mark Ramshaw, Linda Barker, Stuart Campbell, Jonathan Davies, Cam Winstanley, Tim Norris and Steve Faragher, plus others), while the second CD – subtitled The AP Bonus Coverdisk – featured remixes inspired by games and demos that appeared on the magazine's cover-mounted disks over the years. The Mighty Booklet contained detailed information about each of the tracks featured on the album, including interviews with the musicians, behind-the-scenes facts, anecdotes and asides from the AP team and full song lyrics; a special The Last Resort section written by Rich Pelley; adverts for F-Max and a Canoe Squad movie; a feature entitled The 'Bum Line, based on The Bottom Line, listing other albums of interest; and an ongoing storyline (following on from the events of AP65) in which the AP team are restored to life by The Four Cyclists Of The Apocalypse so they can attend a concert in their honor.", "*AP2 - An Amiga Power information site created by AP writers Jonathan Nash and Stuart Campbell, with a wealth of behind-the-scenes stories about the magazine.", "*World Of Stuart - Stuart Campbell's extensive website, which includes an archive of Amiga Power and other articles."]}, {"page": "Your Sinclair", "response": ["*Trainspotters – where readers would send in mistakes they'd noticed in a previous issue of the magazine, in the hopes of convincing the editor to send them a Trainspotter Award. Most of the time, however, the editor found a way out of sending the award, by coming up with convoluted reasons why the 'mistake' wasn't a mistake at all (for example, by insisting there was no such place as the Isle of Man after accidentally omitting it from a map in Issue 50). The Trainspotter caricature was supposedly based on the man pictured on the cover of Issue 1 of Your Spectrum. As with the Jugglers, this was drawn by Nick Davies. The last ever award was given to Stuart Campbell, a then former writer who had since left, who found a mistake in a reprint of an article that he wrote.", "Between the months of October 1991 and January 1992, contributor Stuart Campbell compiled his list of the Top 100 ZX Spectrum games of all time. In the months leading up to the final issue, readers were invited to vote on their ten favourite games, which was then compiled into a 'readers choice' top 100, which was published in the final issue alongside Stuart Campbell's list. In the 2004 special issue, presented by Retro Gamer, there was a follow-up top 50 listing, chosen by the journalists from that magazine.", "*Stuart Campbell continued to work for Amiga Power and other magazines before going to work for Sensible Software as a designer. From 2011 until 2021, he ran the Wings over Scotland blog in support of Scottish independence."]}, {"page": "Soccer Kid", "response": ["Amiga Power gave the Amiga version a score of 88% with a review by Stuart Campbell. He criticized the player character's moves as being too \"fiddly\": \"you have to stop, line up your shot, get into trick shot mode and then actually do it. This all looks great and stylish and everything, but it can really slow the pace of the game down on occasion - sometimes when you're zipping along, you'd give anything just to be able to jump on a baddie's head and sort him out then-and-there without a lot of hanging around.\" However, he praised the graphics and particularly the \"fearsome\" difficulty, saying it gave the game good value for money. He compared the game to the acclaimed Arabian Nights, saying it was even better due to the superior control and greater focus on platform action."]}, {"page": "Computer Gaming World", "response": ["Ziff Davis also published a sister magazine to Computer Gaming World, entitled PC Gaming World, in the United Kingdom. It was the region's third-largest computer game magazine by August 2000. In 1998, journalist Stuart Campbell described PC Gaming World as a publication with a predominantly American bent, thanks to its \"sober, serious, text-heavy style\". He considered it to be out of step with the British game audience. Campbell later called the magazine an \"oddity\" that was \"clearly aimed primarily at a 40-something audience and beyond\", in comparison to more youthful rivals such as PC Gamer UK and PC Zone."]}, {"page": "Star Goose", "response": ["Star Goose was re-released by Prism Leisure Corporation in late 1991 for £2.99 and received more favourable reviews. Stuart Campbell, writing for Amiga Power, gave the re-release an 82%, referring to it as \"limited\", but arguing that it was a good value for the price. Around that time it was also distributed by Pactronics' Budget Series, albeit for £12.95. Australian Commodore and Amiga Review, which had recommended the game when it was first released, upheld its recommendation with a 77% for the re-release, praising the graphics and gameplay."]}, {"page": "Lure of the Temptress", "response": ["Amiga Format stated that this \"fine adventure game well worth investigating\" could compete with Sierra and LucasFilm games; \"in any event, Temptress surpasses almost anything Sierra have offered, by being larger, funnier, and a whole lot better drawn ... an innovative system knocks spots of the Sierra-standards and shows LucasFilm a thing or two\" and also praised its humour, saying that there's \"a good dose of tongue-in-cheek humour and fairy-tale nonsense.\" The One praised the game's controls, saying that \"the game's impressive user-friendliness is undoubtably one of its strong points,\" adding that \"Lure of the Temptress is every bit as professional and polished as anything the Americans and French have been able to offer us recently\" but \"Lure is, if anything, a little too serious and sombre\" and that \"LucasFilm's games boast the more interesting characters and interaction sequences.\" Amiga Power praised its graphics, saying they are \"very pretty drawn, with the dark, moody look you'd expect from a town being oppressed by an evil Temptress,\" calling it \"one of the best graphic adventures ever\" that's \"up there with Monkey Island 1 and Beneath a Steel Sky,\" and adding that the \"only drawback is that it's shorter than your average adventure.\" Mega Zone praised the game, stating that it is a \"Sierra/Lucasfilmish with really, really good playability. We're talking 32 colours graphics which look really nice, with playability which is really smooth, and simply pure gaming enjoyment here,\" adding that \"the manual is very well written, the sound the graphics are all there, disc access is very good, and looking at the way the whole game is put together right down to the intro it's one of the most amazing Amiga Adventures every written! An Adventure Zone classic!\" Stuart Campbell of Amiga Power opined that Core Design's rival 1992 fantasy adventure game Curse of Enchantia (also published by Virgin) was \"a funny version of Lure of the Temptress with a different plot.\"Stuart Campbell, \"Things to come: Curse of Enchantia \", Amiga Power 17 (September 1992), page 20."]}, {"page": "John McTernan", "response": ["In November 2016, McTernan bet blogger Stuart Campbell $100 on a Clinton victory in the 2016 US presidential election, which he lost. Campbell has claimed that McTernan failed to honour the bet, and Campbell has taken court action against him.\"Political blogger takes court action against former Blair aide over Clinton bet\". The Scotsman. 28 November 2016."]}, {"page": "Monster Business", "response": ["Stuart Campbell, writing for Amiga Power, praised Monster Business's gameplay, calling it \"simple, comical, fun and addictive\", and praised its difficulty curve, further stating that the game \"plays like all the best arcade games\". In a review of the game in New Computer Express, Campbell described it as \"the most fun I've had with a computer game since I started writing for games magazines\", calling its gameplay \"magnificently designed\", and described the game as a cross between Dig Dug and Snow Bros. Campbell highly praised the game's music, and expressed that he'd \"never heard anything sound this good on an ST, and nothing this good actually during a game on any machine\". Monster Business was 98th on Amiga Power's list of \"All-Time Top 100\" games in 1992, calling the game \"simple but emotionally involving\"."]}, {"page": "Stuart Campbell", "response": ["*Stuart Campbell (footballer) (born 1977), English-born Scottish football coach and former player", "*Stuart Campbell (game journalist), British video game designer and journalist", "*Stuart Campbell (journalist) (1908–1966), British newspaper editor", "*Stuart Campbell (obstetrician), pioneer in the use of ultrasound in obstetrics"]}, {"page": "Xenon (video game)", "response": ["Writing in New Computer Express about the 1991 budget re-release, Stuart Campbell stated that although the graphics were \"gorgeous\" and had \"never really been seen before\", the gameplay was \"simply tedious\" and the game was the first to \"turn 'style-over-content' into an artform\"."]}, {"page": "Sensible Train Spotting", "response": ["Eight years later in 2003, a PC games company called Demon Star released another train spotting simulator, called Train Tracking. The company claimed their game was the first ever train spotting simulator, although the gameplay is nearly identical to Sensible Train Spotting. British game journalist and former Sensible Software employee Stuart Campbell reacted to this by buying a fully registered copy of Train Tracker and making it freely downloadable from his web site, daring Demon Star to take legal action.STOP THE (RIP-OFF) EXPRESS at worldofstuart.com."]}, {"page": "Curse of Enchantia", "response": ["It took a month for the project to be storyboarded before any actual art and programming work started on it. Mohr recalled: \"Back then there was not much in the way of 'game design', much less 'concept art'. I was shown extremely brief paragraphs or diagrams of each scene/puzzle and given full latitude to make up pretty much whatever I wanted. It was a lot of fun, although I found myself questioning some of the gameplay choices.\" The two versions of the game, for the PC and the Amiga, were developed separately and simultaneously, in order to make the best possible product for each platform rather than a quick port from one system to another. A version for the Amiga CD32 had also been planned. The game mixes backgrounds hand-drawn with acrylic paint and then digitized by Mohr, and sprite bitmap graphics made in Deluxe Paint and Brilliance on the Amiga with some rotoscoped animations. The animators Billy Allison and Stuart Atkinson created \"huge\" DPaint-made character sequences but they had to implement them in game in more efficient way due to computer memory limitations.Stuart Campbell, \"Things to come: Curse of Enchantia\". Amiga Power 17 (September 1992), page 20. In addition, the PC version used the full 8-bit color of a 256-color palette, but the Amiga version had to be downscaled to only 32 colors (including 24 colors for the background and eight colors for the main character; the other characters had to be drawn with these colors).\"Life, Core Design and everything\", The One Amiga (January 1994), pages 36-37. The game also uses various digitized sound effects.Amazing Computer Magazine Volume 8 Issue 3 (June 1993), pages 83-84.", "Allison described the projects as a \"zany Pythonesque take on the classic fairy tales.\" The game's story and elements were partially inspired by The Lion, the Witch and the Wardrobe, The Wonderful Wizard of Oz, The Snow Queen, and Disney animated films, and relies heavily on surreal humor and slapstick. It contains several Easter egg pop culture references, including the shop called \"Benn's Costume Shop\" complete with a costume of Batman, a band named \"The Slugs\" consisting of four humanoid slugs, getting into a frozen realm through a wardrobe, and encountering the wreck of Marie Celeste. Other connections might be accidental, such as its likeness to Lure of the Temptress, another fantasy adventure game that was developed at the same time (released in June 1992). Stuart Campbell, who described as Curse of Enchantia as \"a funny version of Lure of the Temptress with a different plot,\" was not the only one who noted the two games' similarities to each other, especially regarding the initial dungeon-escape scenes in both games. As written in adventure gaming magazine Red Herring, \"obvious similarities abound as you find that: 'the downtrodden villagers are praying for a return to a peaceful life, and the death of the evil one', which Is pretty much what they are doing in Lure of the Temptress.\""]}, {"page": "Dangerous Streets", "response": ["The game was derided by critics. Stuart Campbell of Amiga Power gave it a rating of 3%, describing it as the worst game for the CD32 and one of the worst games ever."]}, {"page": "Football Manager (1982 series)", "response": ["The game was not as well received as previous versions. Philip Lindey in Sinclair User suggested it was \"difficult to get excited about Football Manager 3\" and that it was overpriced, giving an overall score of 73%.Football Manager 3 review, Philip Lindey, Sinclair User, January 1993 Stuart Campbell in Your Sinclair thought the game was \"not quite up to the standard of Football Manager 2, to be honest, with vastly inferior presentation and graphics, and lots of hanging around while the computer thinks and doesn't seem to be working properly\", giving a score of 70%.Football Manager 3 review, Stuart Campbell, Your Sinclair, January 1993 Amstrad Action awarded the game only 38%,Football Manager 3 review, Amstrad Action, Issue 87, December 1992 again claiming it did not live up to Football Manager 2."]}, {"page": "Stuart Campbell (journalist)", "response": ["Renton Stuart Campbell (4 June 1908–1 February 1966) was a British newspaper editor known for \"investigation and exposure of criminal and social wrongdoing.\""]}, {"page": "Team17", "response": ["Starting in 1992, Future Publishing-owned Amiga Power started criticising Team17's products more harshly than other gaming magazines. According to Stuart Campbell, deputy editor for the magazine at the time, Overdrive, Project-X, F17 Challenge and Superfrog were among the games that received negative reception from Amiga Power between 1992 and 1993. As a response to their reviews, Team17 began implementing derogatory Easter eggs into their games, which included the cheat code \"AMIGAPOWER\" unlocking a critical statement regarding the magazine's review policy in Alien Breed II: The Horror Continues (1993) and the easiest-difficulty bot opponents in Arcade Pool (1994) being named after Amiga Power staff. However, when the magazine awarded Team17's ATR: All Terrain Racing and Kingpin: Arcade Sports Bowling scores of 38% and 47%, respectively, in 1995, Team17 issued a lawsuit against the magazine, demanding the reviews to be retracted and the issue withdrawn from sale. The lawsuit was not successful for the studio, and it instead turned to not sending review copies of their games to Amiga Power and making other Future Publishing-owned magazines not lend their review copies to Amiga Power."]}, {"page": "Saint Dragon", "response": ["On its budget re-release in 1992, Your Sinclair adjusted their rating to just 29%, criticizing it as \"hideously slow, graphically abysmal, impossibly tedious load of old junk\". Stuart Campbell took issue with the cassette multi-load, the invisible border on the reduced playing area, and frame-rate drop when multiple sprites are on-screen."]}, {"page": "Kezia Dugdale", "response": ["In 2018, Stuart Campbell, a blogger running the pro-independence Wings Over Scotland website, started defamation proceedings against Dugdale about comments she made as a columnist for the Daily Record about his Twitter activity, a case he lost. The judgement said Dugdale was incorrect to imply Campbell had been homophobic but her article was protected under the principle of fair comment.", "Dugdale's late father was retired teacher Jeff Dugdale, and was a campaigner for the Scottish independence movement. Her relationship with her father had been left \"sad\" and \"sore\" by his public criticisms toward her over Twitter and his support for Stuart Campbell in the defamation case against her. Jeff Dugdale died on 10 September 2021."]}, {"page": "Cannon Fodder (video game)", "response": ["The game drew criticism in the Daily Star for its juxtaposition of war and humour, its showcasing in London on Remembrance Day and especially its use of iconography closely resembling the remembrance poppy. The newspaper quoted The Royal British Legion, Liberal Democrat MP Menzies Campbell and Viscount Montgomery of Alamein, calling the game offensive to \"millions\", \"monstrous\" and \"very unfortunate\" respectively. Virgin Interactive initially defended the use of the poppy as an anti-war statement, which the Daily Star in turn dismissed as a \"publicity writer's hypocrisy\". Magazine Amiga Power became involved in the controversy because of its planned reuse of the poppy on the cover of an issue also to be released on Armistice Day. This had been changed in response to criticism in the Daily Star original article, but the newspaper published another piece focussing on a perceived inflammatory retort by Amiga Power editor Stuart Campbell: \"Old soldiers? I wish them all dead.\" The article featured further quotes from the British Legion. The magazine apologised for including the comment although Campbell himself felt he was \"entitled to an opinion\" regardless of its insensitivity. The game was ultimately released with a soldier rather than a poppy on the box art, though the poppy was still displayed on the game's title screen. Amiga Power also changed its cover after \"legal scrapes with the British Legion over whether a poppy is just a flower or a recognisable symbol of a registered charity.\" Stuart Campbell elsewhere pointed out that the game was ironically anti-war, while contemporary Amiga Format reviewer Tim Smith also praised the game as intelligently anti-war. Metro later acknowledged \"a relatively profound statement on the futility of war\" which had been unrecognised by the Daily Star. Kieron Gillen defended the game as ironic and anti-war in a retrospective. Amiga Computing reported the publicity as \"perhaps the best advertising campaign\" for which Virgin could have hoped."]}, {"page": "Rev. Stuart Campbell", "response": ["#REDIRECT Stuart Campbell (game journalist)"]}, {"page": "Stuart Campbell (Games Journalist)", "response": ["#REDIRECT Stuart Campbell (game journalist)"]}, {"page": "Stuart Campbell (games journalist)", "response": ["#REDIRECT Stuart Campbell (game journalist)"]}, {"page": "Wings Over Scotland", "response": ["Wings Over Scotland is a pro-Scottish independence blog by Scottish video game journalist Stuart Campbell. It was launched in November 2011 with the stated aim of providing a \"fair and honest perspective on Scottish politics\" with a pro-independence slant.", "Wings Over Scotland was founded in 2011 by Bath-based video game journalist Stuart Campbell. On The Scottish Independence Podcast in October 2013, he said he \"got fed up of just shouting at the TV when Newsnight Scotland was on\"."]}, {"page": "The Wee Blue Book", "response": ["The Wee Blue Book was a multi-format publication published in 2014 and written by Stuart Campbell, editor of pro-independence blog Wings Over Scotland. It set out an economic case for Scottish independence as part of the pro-independence campaign in the run-up to the referendum held that year."]}, {"page": "Richard Leonard", "response": ["In September 2018, Scottish Labour cut funding for Kezia Dugdale's defence in a defamation case by video games journalist and nationalist blogger Stuart Campbell. They had previously promised not to do so and there was controversy over whether the decision was encouraged by the UK party. Dugdale subsequently won the case on the grounds of principle of fair comment. In leaked messages, Edinburgh South MP Ian Murray wrote, \"Ultimately she won her case and the party lost £80,000 as they would've got their costs had they kept their promise.\" He also wrote the decision was the \"final straw\" which caused her to leave Holyrood in 2019 and he angrily derided the Scottish Labour leadership as \"full of thugs and incompetents\"."]}, {"page": "Rugby World Cup '95", "response": ["Stuart Campbell reviewed the DOS version in PC Gamer, criticising the isometric perspective by stating it was difficult to work out where on the pitch the action was taking place from the markings and where other players on the team were located. He also noted that possession of the ball after a tackle appears to be decided at random, and the kicking controls take too long for the player to carry out and usually get interrupted by a tackle as a result. Awarding the game a score of 52%, Campbell's overall verdict was that it \"concentrates on realism at the expense of gameplay, but doesn't make a very good job of either\"."]}]}}