{"wiki_id": "http://www.wikidata.org/entity/Q16732880", "itemLabel": "Paul Morrell", "itemDescription": "English footballer (born 1961)", "wikipedia_url": "https://en.wikipedia.org/wiki/Paul_Morrell_(footballer)", "wikipedia_page": {"main": "Paul David Morrell (born 23 March 1961) is an English former footballer who played as a defender in the Football League for Bournemouth. He scored the winning goal in the first Football League Trophy Final, then known as the Associate Members' Cup, when Bournemouth beat Hull City 2–1 at Boothferry Park on 24 May 1984.He now works for the probation service in the Bournemouth area.", "link_mentions": [{"page": "AFC Bournemouth", "response": ["|align=\"left\"|Paul Morrell"]}, {"page": "Morrell", "response": ["* Paul Morrell, English quantity surveyor and the UK Government's first Chief Construction Adviser (2009-2012)", "* Paul Morrell (footballer) (born 1961), former English footballer"]}, {"page": "1984 Associate Members' Cup Final", "response": ["The final was played at Boothferry Park on 24 May 1984, and was contested by Hull City and Bournemouth.   Although Hull City had the advantage of the match being played at their own home stadium, Bournemouth won the match 2–1, with Paul Morrell scoring the winning goal.", "| || 10 || Paul Morrell"]}, {"page": "Paul Morrell", "response": ["thumb|Paul Morrell, speaking at London conference, 26 October 2016", "Morrell was a founder member of the British Council for Offices (president in 2004–2005),Paul Morrell appointed President of BCO,  is a Fellow of the Royal Institution of Chartered Surveyors and Honorary Fellow of the Royal Institute of British Architects, and has served as a commissioner on the UK's Commission for Architecture and the Built Environment (2000–2008; also serving as deputy chairman).CABE: Board of 16 Commissioners Chaired by Sir John Sorrell, Design Taxi (accessed: 3 March 2012) In the 2007 Building Awards, he received the Award for Outstanding Contribution to the Construction Industry. He was appointed OBE for services to architecture and the built environment in the 2009 New Year Honours list.Architecture.com, 5 January 2009, Two RIBA members rewarded in New Year Honours (accessed: 3 March 2012). Archived. Accessed: 21 April 2021.BD columnist Paul Morrell awarded OBE, Property Week, 2 January 2009 –  (accessed: 3 March 2012)", "The \"creation of a post of Chief Construction Officer\" was recommended by the House of Commons Business and Enterprise Select Committee in July 2008.Construction Matters, Ninth Report of Session 2007–08 (accessed: 3 March 2012) Paul Morrell was appointed to this pan-departmental role, with a slightly revised title of 'chief construction advisor', in November 2009; the role was initially for two years, and Morrell was re-appointed for a further term in October 2011.Paul Morrell has been re-appointed as the Government’s chief construction adviser by Business Minister Mark Prisk  (accessed: 3 March 2012) The UK government directly or indirectly provides around 40% of the construction industry's workload so its influence as a client is significant.", "Morrell has also been keen to improve the efficiency, cost-effectiveness and sustainability of construction work for the UK government; he led the UK Government, Innovation and Growth Team, that produced an influential report, Low Carbon ConstructionLow Carbon Construction (accessed 30 January 2012) published in November 2010. He was also the instigator of the Government Construction Strategy (published in May 2011)UK Government Construction Strategy, Cabinet Office (accessed 30 January 2012) which, echoing the earlier Latham and Egan Reports, told the sector to work more collaboratively and to use information technology – notably building information modelling (BIM) – to support the design, construction and long-term operation and maintenance of its built assets. Morrell is a strong advocate of BIM, having publicly backed its use in 2010,BIM to become part of public procurement process, Building Design, 1 October 2010 (accessed: 3 March 2012) and BIM was made mandatory for all centrally-procured public sector construction projects from 2016.Paul Morrell: BIM to be rolled out to all projects by 2016, Architects' Journal, 23 June 2012 (accessed: 3 March 2012)", "Paul Morrell was the author of Collaborating for Change, an April 2015 report published by the Edge Commission on the future of professionalism among the built environment institutions.Collaboration for Change: The Edge Commission Report on the Future of Professionalism , Edge Commission, April 2015. Accessed: 28 August 2015.", "In October 2016, the government's skills minister Robert Halfon appointed Paul Morrell to lead a review of industrial training boards, with the future of the Construction Industry Training Board (CITB) central to the review. The report Building Support: the review of the Industry Training Boards was published in November 2017."]}]}}