{"wiki_id": "http://www.wikidata.org/entity/Q16749836", "itemLabel": "George Willmot", "itemDescription": "British archaeologist and curator", "wikipedia_url": "https://en.wikipedia.org/wiki/George_Willmot", "wikipedia_page": {"main": "George Francis Willmot BA FSA (1908–1977) was a British archaeologist and curator based in York", "link_mentions": [{"page": "St Mary's Abbey, York", "response": ["Further excavations in the abbey were undertaken in 1952–56 by the then Keeper of the Yorkshire Museum, George Willmot who encountered the pre-Norman and Roman layers beneath the west wing of the nave.Willmot, G. F. 1953. \"Interim Report on the 1952 Excavation in St. Mary's Abbey\", Yorkshire Philosophical Society, Annual Report for the year 1952. York: YPS. pp. 22–3"]}, {"page": "1977 in archaeology", "response": ["* George Willmot, British archaeologist and former curator of the Yorkshire Museum (b. 1908)"]}, {"page": "Willmot", "response": ["* George Willmot (1908–1977), British archaeologist and museum curator"]}, {"page": "Yorkshire Museum", "response": ["|George Willmot", "A series of reportedly paranormal events were recorded in the Museum in the winter of 1953 and the early months of 1954. In a 1958 report of the events, the museum's caretaker George Jonas reported to have seen the ghost of a man in Edwardian dress entering the Museum's library and that a book repeatedly drew itself from its shelf and fell to the floor on several occasions. A disagreement between the curator George Willmot and the head of the Yorkshire Philosophical Society, H. E. Harrowell, over the scepticism of the latter led to the resignation of Mr. Willmot. The phenomenon of the falling book was reportedly witnessed several times, always on a Sunday evening. On 27 January 1954, eight people entered the museum library to witness the event and signed witness statements recounting their experiences; these included a feeling of cold around the legs, the book removing itself from the shelf, and the leaves of the book still moving whilst it was on the floor."]}, {"page": "Blink Bonny", "response": ["After her death, Blink Bonny's skeleton was donated to the Yorkshire Museum and was on display until the 1950s. She was on display with the skeleton of another racehorse – Tracery. In 1979 it was reported that one of these skeletons was reburied in an 'archaeological trench' by then Keeper of the museum George Willmot and the location of the other was a mystery."]}, {"page": "Tracery (horse)", "response": ["After his death, Tracery's skeleton was donated to the Yorkshire Museum and was on display until the 1950s. He was on display with the skeleton of another racehorse - Blink Bonny. In 1979 it was reported that one of these skeletons was reburied in an 'archaeological trench' by then Keeper of the museum George Willmot and the location of the other was a mystery."]}, {"page": "Andrew Oddy", "response": ["William Andrew Oddy was born on 6 January 1942 in Bradford and spent his childhood in the nearby township of Baildon. He was the first son of William Tingle Oddy, then serving in the Auxiliary Fire Service for the duration of World War II, and Hilda Florence Oddy (née Dalby). He attended Sandal Primary School in Baildon and Bradford Grammar School. It was during these years that he developed an interest in archaeology after having visited the excavations at Meare Lake Village in Somerset that were being directed by Harold St George Gray. When in the sixth form he went with parties from Bradford Grammar School on several occasions to excavate in York under the direction of George Willmot of the Yorkshire Museum. He also took an interest in stonemason's marks on mediaeval buildings and this led to his first publications, which were in the Archaeology Group Bulletin published by Bradford City Art Gallery and Museums."]}, {"page": "George Francis Willmot", "response": ["#REDIRECT George Willmot"]}, {"page": "George F. Willmot", "response": ["#REDIRECT George Willmot"]}, {"page": "Willmot, George", "response": ["#redirectGeorge Willmot"]}]}}