{"wiki_id": "http://www.wikidata.org/entity/Q16738978", "itemLabel": "John Postgate", "itemDescription": "English microbiologist", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Postgate_(microbiologist)", "wikipedia_page": {"main": "John Raymond Postgate (24 June 1922 – 22 October 2014), FRS was an English microbiologist and writer, latterly Professor Emeritus of Microbiology at the University of Sussex.   Postgate's research in microbiology investigated nitrogen fixation, microbial survival, and sulphate-reducing bacteria. He worked for the Agricultural Research Council's Unit of Nitrogen Fixation from 1963 until he retired, by then its Director, in 1987. In 2011 he was described as a \"father figure of British microbiology\".His admired popularizing book on microbes in human culture, Microbes and Man, first published in 1969, remains in print.", "link_mentions": [{"page": "June 24", "response": ["*  1922   – John Postgate, English microbiologist, author, and academic (d. 2014)"]}, {"page": "October 22", "response": ["*  2014   – John Postgate, English microbiologist, author, and academic (b. 1922)"]}, {"page": "Oliver Postgate", "response": ["Postgate was born in Hendon, Middlesex, England, into the Postgate family, as the younger son of journalist and writer Raymond Postgate and his wife Daisy (née Lansbury), making him the cousin of actress Angela Lansbury and maternal grandson of Labour politician, and sometime leader, George Lansbury. His other grandfather was the Latin classicist John Percival Postgate. His brother was the microbiologist and writer John Postgate FRS."]}, {"page": "Raymond Postgate", "response": ["Postgate's younger son, Oliver Postgate, also a conscientious objector though in World War II, became a leading creator of children's television programmes in the UK including Bagpuss, Ivor the Engine and The Clangers. Oliver's brother was the microbiologist and writer John Postgate FRS."]}, {"page": "John Percival Postgate", "response": ["Born in Birmingham, the son of John Postgate, he was educated at King Edward's School where he became head boy. He won a scholarship to Trinity College, Cambridge where he read classics, being elected a Fellow in 1878. He was elected as a member to the American Philosophical Society in 1886.", "He married his graduate student Edith Allen and they had six children among whom were Raymond Postgate (a journalist, historian, novelist and food writer), and Margaret Cole (a Fabian politician); he was grandfather to the animator and puppeteer Oliver Postgate, and the microbiologist John Postgate FRS (1922–2014), "]}, {"page": "Leeuwenhoek Lecture", "response": ["* 1992 John Postgate, Bacterial evolution and the nitrogen-fixing plant"]}, {"page": "Howard Dalton", "response": ["Born in New Malden, Dalton was educated at Raynes Park County Grammar School and Queen Elizabeth College, University of London (now part of King's College London). He graduated in 1965, and went on to study at the University of Sussex with John Postgate, obtaining his PhD in 1968."]}, {"page": "Microbiology (journal)", "response": ["Microbiology is a monthly peer-reviewed scientific journal that covers research in all aspects of microbiology, including the biochemistry, cell biology, molecular biology, developmental biology, physiology, pathogenicity, biodiversity, biotechnology, evolution, and genetics of microorganisms and their viruses. It also covers plant-microbe interactions, and environmental and theoretical microbiology. The journal is published monthly by the Microbiology Society. It was established in January 1947 as the Journal of General Microbiology and obtained its current name in 1994. Since 2020, the editor-in-chief is Gavin H. Thomas  (University of York), who took over from Tanya Parish (Seattle Children's), who served since 2015. The microbiologist and science writer Sir John Postgate FRS was editor from 1969-1974. "]}, {"page": "John Postgate", "response": ["John Postgate may refer to:", "* John Postgate (food safety campaigner) (1820–1881), English surgeon and academic", "* John Postgate (microbiologist) (1922–2014), English microbiologist and writer, grandson of the last"]}, {"page": "John Postgate (food safety campaigner)", "response": ["John Postgate (1820–1881) was an English surgeon and academic, a campaigner against food adulteration.", "Postgate's labours caused him serious personal problems, such as the windows of his house being broken, and once he was shot at. His family suffered: travel, pamphlets, postage and other expenses absorbed almost all of his income. He had married Mary Horwood (1819–1889) during his period in Driffield, who was an educated woman who had hoped to be a writer. But she was kept short of money to feed, clothe and bring up their large family; she sometimes had to hide her housekeeping allowance lest he raid it. His children grew up cordially disliking their parsimonious and seemingly uncaring father.Postgate (2001), pp. 63-68 But to the wider public John Postgate became something of a hero, if feared by food and drug traders. He died of stomach cancer on 26th September 1881England and Wales, National Probate Calendar, via ancestry.co.uk at the London Hospital, taken there returning from Neuenahr in Germany. He was buried in Warstone Lane Cemetery, Birmingham where his grave, thought to have been grassed over, has recently been discovered.Postgate1 Jqrg.org.uk His epitaph recorded that, for \"twenty-five years of his life, without reward, and under heavy discouragement, he laboured to protect the health and to purify the commerce of this people\"; his obituaries were adulatory and his portrait is still displayed in a Committee room in Scarborough Town Hall.", "*John Postgate (2001), \"Lethal Lozenges and Tainted Tea: A Biography of John Postgate (1820-1881)\". "]}, {"page": "2014 in the United Kingdom", "response": ["**John Postgate, 93, microbiologist and writer, professor at University of Sussex."]}, {"page": "Postgate family", "response": ["John Postgate (food safety campaigner) (1820–1881) was an English surgeon who became Professor of Medical jurisprudence and Toxicology at Queen's College, Birmingham (which later became Birmingham University) and was a leading campaigner against food adulteration.", "In the next generation, Raymond's children include the microbiologist John Postgate FRS (1922–2014),  Professor of Microbiology at the University of Sussex, who was also a writer on, and sometime performer of, jazz.Royal Society list of Fellows; Postgate was elected in 1977.John Postgate (microbiologist) profile, Cambridge University Press; accessed 23 April 2016. His brother, Richard Oliver Postgate (1925–2008), was an animator, puppeteer and writer, who created television series including Noggin the Nog, Ivor the Engine, and Clangers from the 1950s to the 1980s. Oliver Postgate had three sons, Stephen Postgate, Simon Postgate and Daniel Postgate. His youngest son Daniel Postgate is a children's book writer and illustrator, he inherited Oliver's company Smallfilms and since then has created a new series of Postgate's Clangers on CBeebies. Their cousin, actress Dame Angela Lansbury (born 1925), has had a film and stage career spanning over 70 years.", "*John Postgate (2001) Lethal Lozenges and Tainted Tea: A Biography of John Postgate (1820–1881). ", "*John Postgate (2013), Microbes, Music and Me, "]}, {"page": "Deaths in October 2014", "response": ["*John Postgate, 93, British microbiologist and writer, professor at University of Sussex.Obituary: John Postgate "]}, {"page": "John Raymond Postgate", "response": ["#REDIRECT John Postgate (microbiologist)"]}, {"page": "Peter Gammond", "response": ["Upon returning to civilian life in 1947 Gammond continued his studies at Wadham College, Oxford, until 1950, where he read English.  While at Oxford, he became well known in literary circles as a poet, appearing in three editions of Oxford Poetry, and as a cartoonist and writer with Cherwell. As poetry editor of the university magazine, The ISIS, Gammond worked under editors R. J. Harvey, Alan Brien, Robert Robinson, and Derrick Cooper. Gammond appeared in Oxford Viewpoint, where a study of his poetry by Irving Wardle was also published. During his time at Oxford, he composed and produced an operetta, Love and Learning,A later operetta by Gammond is The Good Soldier Schweik, based on the satirical novel by Jaroslav Hašek. and played trombone in a university jazz band led by John Postgate."]}, {"page": "Human interactions with microbes", "response": ["The Microbe is a humorous 1912 poem by Hilaire Belloc, starting with the lines \"The microbe is so very small / You cannot make him out at all,/ But many sanguine people hope / To see him through a microscope. Microbes and Man is an admired \"classic\" book, first published in 1969, by the \"father figure of British microbiology\" John Postgate on the whole subject of microorganisms and their relationships with humans."]}, {"page": "Microbes and Man", "response": ["Microbes and Man is a popularising book by the English microbiologist John Postgate FRS on the role of microorganisms in human society, first published in 1969, and still in print in 2017. Critics called it a \"classic\" and \"a pleasure to read\".", "In his textbook Essential Microbiology, Stuart Hogg recommends the book to readers who want a general overview of microbes and their uses, stating \"there can be no better starting point than John Postgate's classic\"."]}]}}