{"wiki_id": "http://www.wikidata.org/entity/Q16739490", "itemLabel": "Hugh Lawson, 6th Baron Burnham", "itemDescription": "British newspaper publisher (1931-2005)", "wikipedia_url": "https://en.wikipedia.org/wiki/Hugh_Lawson,_6th_Baron_Burnham", "wikipedia_page": {"main": "Hugh John Frederick Lawson, 6th Baron Burnham (15 August 1931 – 1 January 2005), was a British peer and journalist. \nThe second son of the 4th Baron Burnham, he was educated at Eton College and read PPE at Balliol College, Oxford. Initially working for the Cambridge Evening News, he joined The Daily Telegraph prior to its 1986 takeover by Conrad Black, and held the positions of general manager and deputy managing director in the 1970s and 80s. Upon inheriting his brother's title in 1993, he had a career in the House of Lords as a Conservative defence spokesman and junior whip. He was one of the 90 hereditary peers who were selected to remain in the House of Lords after the passing of the House of Lords Act 1999.In 1955, Lord Burnham married Hilary Hunter with whom he had three children – two daughters and a son, Harry, who inherited the title.", "link_mentions": [{"page": "Rupert Ponsonby, 7th Baron de Mauley", "response": ["Lord de Mauley succeeded his uncle, the 6th Baron de Mauley, in October 2002. On 10 March 2005, he was declared the winner of a by-election for a Conservative hereditary peers' seat in the House of Lords after the death of Hugh Lawson, 6th Baron Burnham.  He was the first peer to have acceded to a title after the House of Lords Act 1999 to have obtained an elective hereditaries' seat in the House."]}, {"page": "Deaths in January 2005", "response": ["*Hugh Lawson, 6th Baron Burnham, 73, British executive and peer, Deputy Speaker of the House of Lords and former deputy managing director of The Daily Telegraph."]}, {"page": "Hugh John Frederick Lawson, 6th Baron Burnham", "response": ["#REDIRECT Hugh Lawson, 6th Baron Burnham"]}, {"page": "List of hereditary peers elected under the House of Lords Act 1999", "response": ["|Hugh Lawson, 6th Baron Burnham", "|Hugh Lawson, 6th Baron Burnham"]}, {"page": "Hugh Lawson", "response": ["*Hugh Lawson, 6th Baron Burnham (1931–2005), British newspaper executive"]}, {"page": "List of British Jewish nobility and gentry", "response": ["**Hugh Lawson, 6th Baron Burnham"]}, {"page": "Hall Barn", "response": ["Edward Levy-Lawson, 1st Baron Burnham bought the estate in 1880 and made a number of renovations and improvements, and the estate remains under the management  of the Lawson  family - Hugh Lawson, 6th Baron Burnham -  in the  early  21st  century."]}]}}