{"wiki_id": "http://www.wikidata.org/entity/Q167076", "itemLabel": "William Keswick", "itemDescription": "British politician (1835-1912)", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Keswick", "wikipedia_page": {"main": "William Keswick (15 April 1834 – 9 March 1912) was a British Conservative politician and businessman, patriarch of the Keswick family, an influential shipping family in Hong Kong associated with Jardine Matheson Holdings.", "link_mentions": [{"page": "Hudson's Bay Company", "response": ["* William Keswick (15 April 1834 – 9 March 1912) and grandson Sir William Johnstone Keswick (1903–90) served at HBC; the former as a director and later as governor from 1952 to 1965. The Keswick family are the Scottish business dynasty that controls Hong Kong-based Jardine Matheson, one of the original British trading houses or Hongs in British Hong Kong."]}, {"page": "William Jardine (merchant)", "response": ["Sir Robert Jardine (1825–1905) is the ancestor of the Buchanan-Jardine branch of the family. A descendant of Sir Robert, Sir John Buchanan-Jardine, sold his family's 51% holding in Jardine, Matheson and Co. for $84 million at the then prevailing exchange rate in 1959. A great-nephew of Jardine who would be taipan from 1874 to 1886, William Keswick (1834–1912), is the ancestor of the Keswick branch (pronounced Ke-zick) of the family. Keswick is a grandson of Jardine's older sister, Jean Johnstone. Keswick was responsible for opening the Japan office of the firm in 1859 and also expanding the Shanghai office. James Matheson returned to England to fill up the Parliament seat left vacant by Jardine and to head up the firm Matheson & Co., previously known as Magniac, Jardine & Co., in London, a merchant bank and Jardines' agent in England.  In 1912, Jardine, Matheson & Co. and the Keswicks would eventually buy out the shares of the Matheson family in the firm although the name is still retained. The company was managed by several of Jardine's family members and their descendants throughout the decades, including the Keswicks, Buchanan-Jardines, Landales, Bell-Irvings, Patersons, Newbiggings and Weatheralls.", "Notable Jardines Managing Directors or Tai-pans included Sir Alexander Matheson, 1st Baronet, David Jardine, Robert Jardine, William Keswick, James Johnstone Keswick, Ben Beith, David Landale, Sir John Buchanan-Jardine, Sir William Johnstone \"Tony\" Keswick, Hugh Barton, Sir Michael Herries, Sir John Keswick, Sir Henry Keswick, Simon Keswick and Alasdair Morrison. There was a point in time in the early 20th century that the firm had two 'Tai-pans' at the same time, one in Hong Kong and one in Shanghai, to effectively manage the firm's extensive affairs in both locations. Both tai-pans were responsible only to the senior partner or proprietor in London who was normally a retired former tai-pan and an elder member of the Jardine family."]}, {"page": "Gai-Jin", "response": ["*Malcolm Struan: loosely based on the real-life Jardine taipan William Keswick. ", "*Angelique Richaud: based on Amelia Dubeux, who was married to William Keswick."]}, {"page": "Imperial Bank of Persia", "response": ["Between 1889 and 1928, the bank operated as the state bank and bank of issue of Iran, and held a virtual monopoly on banking in the country. Sir William Keswick was the bank's chairman. The bank was principally funded by Glyn, Mills & Co., J. Henry Schröder & Co. and David Sassoon & Co.. Despite holding a monopoly, the bank's management was farcical, according to Geoffrey Jones, and the bank struggled to make a profit. However, Jones also notes that British banks in this period were allowed to disguise their profits by making transfers to or from \"inner\" or \"secret\" reserves before reaching their published profits figure. The Imperial bank's real profits were on average twice as high as the published profits between 1890 and 1952.B. V. Anan'ich, Rossikoe Samoderzhavi i Vyvoz Kapitalov (Leningrad: 1975). The bank contributed to the Iranian economy by mobilizing domestic savings, but many were doubtful of the real use of these savings as the Bank often \"discriminated against Persians in giving credit\".The Imperial Bank of Iran and Iranian Economic Development, 1890-1952, Geoffrey Jones, page 75. In 1927, 80% of the loans granted in Bushehr, Shiraz and Esfahan were to finance Iranian export of opium, whereas most of the loans in the northern cities related to the trade with Russia. The imperial bank did not employ locals as managers; in contrast, the Imperial Ottoman Bank, which was under mixed British, French and Turkish ownership employed middle eastern nationals in managerial positions. The bank's first owner, Joseph Rabino, born in London to an Italian Jewish family, was always regarded with great suspicion by his board."]}, {"page": "The Hongkong and Shanghai Banking Corporation", "response": ["# William Keswick (1880–1881)"]}, {"page": "Tai-pan", "response": ["*William Keswick (1834–1912), Scotland"]}, {"page": "Epsom (UK Parliament constituency)", "response": ["| William Keswick", "thumb|120px|William Keswick"]}, {"page": "Shanghai International Settlement", "response": ["In 1932 there were 1,040,780 Chinese living within the International Settlement, with another 400,000 fleeing into the area after the Second Sino-Japanese War broke out in 1937. For the next five years, the International Settlement and the French Concession were surrounded by Japanese occupiers and Chinese revolutionaries, with conflict often spilling into the Settlement's borders. In 1941, the Japanese launched an abortive political bid to take over the SMC: during a mass meeting of ratepayers at the Settlement Race Grounds, a Japanese official leaped up and shot William Keswick, then Chairman of the Council. While Keswick was only wounded, a near riot broke out.", "#  William Keswick (25.4.1865 - 18.4.1866)"]}, {"page": "Keswick family", "response": ["===The Hon. William Keswick (1834–1912)===", "The founder of the dynasty, William Keswick was born in 1834, in Dumfriesshire in the Scottish Lowlands. His grandmother, Jean Jardine Johnstone was an older sister of Dr. William Jardine, the founder of Jardine Matheson & Company His father Thomas Keswick had married Margaret Johnstone, Jardine's niece and daughter of Jean, and entered the Jardine business.  The company operated as opium traders and had a major influence in the First and Second Opium Wars although the company stopped this trading in 1870 to pursue a broad range of other trading interests including shipping, railways, textiles and property development.", "* William Keswick, 1835–1912: Jardine's Pioneer in Japan by J. E. Hoare, Chapter 10, Britain & Japan: Biographical Portraits "]}, {"page": "James Johnstone Keswick", "response": ["He was the son of the Thomas Keswick, and younger brother of William Keswick, who was the founder of the Keswick family. He arrived in the Far East in 1870 and remained there for 26 years. He became a partner of the Messrs Jardine, Matheson & co. and tai-pan of the firm from the 1890s. He founded Hongkong Land together with his close associate Sir Paul Chater. This was a development company established in 1889 which remained closely associated with Jardine Matheson. Chater and J. J. Keswick became permanent joint managing directors of the new company."]}, {"page": "List of MPs elected in the 1895 United Kingdom general election", "response": ["*23 January: Epsom - William Keswick, Conservative, replacing"]}, {"page": "List of MPs elected in the 1900 United Kingdom general election", "response": ["| William Keswick"]}, {"page": "List of MPs elected in the January 1910 United Kingdom general election", "response": ["| William Keswick"]}, {"page": "List of United Kingdom by-elections (1900–1918)", "response": ["|William Keswick"]}, {"page": "Hong Kong General Chamber of Commerce", "response": ["|William Keswick", "|William Keswick", "|William Keswick"]}, {"page": "William Keswick (Politician)", "response": ["#REDIRECT William Keswick "]}, {"page": "William Keswick (politician)", "response": ["#REDIRECT William Keswick"]}, {"page": "Shanghai Race Club", "response": ["* William Keswick"]}, {"page": "Upright Motive No. 1: Glenkiln Cross", "response": ["Between 1951 and 1976, Sir William Keswick, who owned the Glenkiln estate, bought and arranged works by Henry Moore, Jacob Epstein, and Auguste Rodin, creating the world's first collection of sculpture in a landscape setting, Glenkiln Sculpture Park.  Moore and Keswick installed the first cast of the cross on a hilltop, where they saw a shepherd and his flock; Moore said \"From a distance it looks rather like one of the old Celtic crosses.\"Henry Moore Foundation, Glenkiln"]}, {"page": "Glenkiln Sculpture Park", "response": ["Between 1951 and 1976, local landowner Sir William \"Tony\" Keswick (grandson of William Keswick) assembled a collection of works by Auguste Rodin, Henry Moore, and Jacob Epstein.Henry Moore sculpture is the star at new Tate show - Great Britain , SculptSite.com Keswick worked with the artists in siting their works in a natural landscape, and commissioned works."]}, {"page": "History of Jardine Matheson & Co.", "response": ["In 1862, William Keswick bailed out the fledgling Shanghai Race Club to avoid its financial ruin. At its Spring and Autumn meetings, rivalry between the big Hongs such as Jardines and Dents proved intense. The private EWO stables, located next to the Shanghai Race Club, housed 46 ponies in 1922 while the firm had 21 gentlemen riders on its payroll.", "Jardines was the first foreign trading house to establish a base in Japan when William Keswick, a descendant of William Jardine's sister Jean, was sent there in 1859 following the country's opening up to the outside world. He established an office in Yokohama after acquiring Lot No. 1 in the first land sale. Additional offices subsequently opened in Kobe, Nagasaki and other ports where a large and profitable business was conducted in imports, exports, shipping and insurance. Jardines also operated in Nairobi in the then British protectorate of Kenya through its Jardine Matheson (East Africa) Ltd. subsidiary and held a majority stake in the South African company Rennies Consolidated Holdings, until it disposed of this 74% stake to Old Mutual in 1983. This was later merged with Safmarine to form Safmarine and Rennies Holdings (Safren)."]}, {"page": "List of Legislative Council of Hong Kong members 1843–1941", "response": ["|9 July 1872 || 13 July 1875|| align=\"left\" |Vice William Keswick resigned ", "| rowspan=\"2\" |  Jardine, Matheson & Co. || align=\"left\" |Vice William Keswick on leave", "| align=\"left\" |Vice William Keswick resigned"]}, {"page": "Jardine Matheson", "response": ["Hongkong Land is an Asian property investment, management and development group. Established in Hong Kong in 1889 by Sir Paul Chater and William Keswick, the group today has property interests across the region. In Hong Kong, the group owns and manages approximately 9,140,000 square feet (850,000 m2) of prime commercial space in Central. In Singapore, it is helping to create the city-state's Central Business District with an expanding joint venture portfolio of new developments. In addition to commercial properties, Hongkong Land also develops residential properties in key cities around the region including Hong Kong, mainland China, Macau and Singapore where its subsidiary MCL Land is a significant property developer. Jardine Strategic has a 50% shareholding in Hongkong Land.", "Jardines is controlled by the Keswick family, who are direct descendants of William Jardine's sister Jean through the marriage of her daughter to Thomas Keswick, father of William Keswick, an early Tai-pan of the firm. While the leadership of Jardines is Scottish, the firm is international in its dealings. The staff of Jardines is predominantly Asian, with senior management levels composed of a mixture of British, Chinese, Indonesians, Europeans, Australians and Americans."]}, {"page": "King and Queen (sculpture)", "response": ["The second cast was bought by Sir William Keswick in 1954 and installed on his estate at Glenkiln in Kirkcudbrightshire, on a rock outcrop looking over Glenkiln Loch.  It was formerly part of the Glenkiln Sculpture Park.Henry Moore Foundation This cast was decapitated in 1995 but later restored.Marianne MacDonald (1 August 1995), Reward offered for Moore statue's heads The Independent."]}, {"page": "Matheson & Company", "response": ["William Keswick, a relative of the Jardines, spent some time with Matheson and Company before going to China in 1855 to work for Jardine Matheson, where he rose to become the chief executive in Hong Kong, and later to run the entire company from London, reporting only to Sir Robert Jardine."]}, {"page": "Charles Wedderburn Dickson", "response": ["Son of W. Dickson and Christina Keswick, daughter of William Keswick of the Jardine Matheson, he was educated in Scotland and arrived in Hong Kong in 1884 and lived in Shanghai from 1894 to 1897. He became the director of Jardine Matheson from 1900 to 1906. He was also the Deputy Chairman of Hongkong and Shanghai Banking Corporation and director of various local companies."]}, {"page": "Henry Keswick (politician)", "response": ["Henry Keswick the first-born and only surviving son of William Keswick by his first wife Amelia Sophie Dubeux (d. 1883), born in 1870 in Shanghai, into the Keswick business dynasty.The Keswick Tai-Pans. Retrieved 16 March 2014 He was educated at Eton College and graduated with a B.A. at the Trinity College, Cambridge in 1892, of which he took his M.A. degree later. He was commissioned as a lieutenant in the 3rd (Militia) Battalion of the King's Own Scottish Borderers on 25 February 1893.Hart′s Army list, 1901 The battalion was embodied after the outbreak of the Second Boer War in late 1899, and he left Queenstown for South Africa on the SS Kildonan Castle with other men of the battalion in March 1900. He saw active service and was promoted to a captain. After the war had ended, he resigned his commission on 2 August 1902. He rejoined the battalion during the First World War in which he commanded until its disbandment. He was also a member of the Royal Company of Archers, a ceremonial unit that serves as the sovereign's bodyguard in Scotland."]}, {"page": "1912 Epsom by-election", "response": ["The Epsom by-election of 1912 was held on 21 March 1912.  The by-election was held due to the death of the incumbent Conservative MP, William Keswick.  It was won by his son the Conservative candidate Henry Keswick, who was unopposed."]}, {"page": "James Whittall", "response": ["Whittall was appointed an unofficial member in Legislative Council in 1864. After John Dent resigned in 1867, he became the Senior Unofficial Member. He went on leave later that year, and William Keswick held the seat for him until 1872. Whittall remained an unofficial member in the Legislative Council until he resigned in 1875, and Keswick replaced him again."]}, {"page": "Francis Bulkeley Johnson", "response": ["Johnson was appointed to the Legislative Council of Hong Kong on 17 May 1881, during William Keswick absent on leave. He also acted as Hawaiian Consulate General and Danish Consulate for William Keswick in 1881. He was also Chairman of the Hong Kong General Chamber of Commerce between 1882 and 1883."]}, {"page": "Union Insurance Society of Canton", "response": ["Notable employees and directors of the Union included William Keswick, William Shenton, Arthur William Hughes, A. O. Lang, Stanley Hudson Dodwell, Percy Hobson Holyoak and John Owen Hughes.", "Notable employees and directors of the Union included William Keswick, William Shenton, Arthur William Hughes, A. O. Lang, Stanley Hudson Dodwell, Percy Hobson Holyoak and John Owen Hughes"]}, {"page": "David Newbigging", "response": ["During the 1970s British companies in Hong Kong such as Jardine Matheson, Swire Group, Hutchison Whampoa, and Wheelock & Co, were consistently outperformed by rising local, ethnically Chinese hongs. In 1980, Jardine was outbid by shipping magnate Sir Yue-Kong Pao for the Hongkong & Kowloon Wharf & Godown Company in which the two groups had previously shared control when the latter decided to diversify from ships into property. The Hongkong Land, a development company established in 1889 by William Keswick's brother James Johnstone Keswick, faced consistent threat from Li Ka-shing's Cheung Kong Holdings and nearly went bust in the early 1980s. When he discovered a secret buyer had begun acquiring shares of Jardine Matheson stock in late 1980, many observers suspected that either Li or Pao (or worse, both) were attempting to purchase a large enough share in Jardine Matheson to win control over Hongkong Land. Newbigging announced in early November that Jardine Matheson and Hongkong Land had agreed to increase their interests in each other, so as to make it impossible for any party to gain control of either company. The cross-ownership scheme, however, placed both companies deeply into debt. The defensive actions required during 1980 forced Jardine Matheson to sell its interest in Reunion Properties to raise cash. Newbigging was criticised for being too conservative and placing too much emphasis on local and regional operations. Keswick family also saw it as a chance to remove Newbigging from office. Newbigging finally stepped down as senior managing director in June 1983, but retained the titular position of chairman. He was replaced as taipan by 40-year-old Simon Keswick, brother of Henry Keswick."]}, {"page": "John Keswick", "response": ["Sir John Keswick was born in 1906 to the third generation of Keswick family in the Jardine, Matheson & Co.. His father, Henry Keswick, son of William Keswick, was a Jardines taipan and a Conservative Member of Parliament. Sir John followed his father and grandfather into Jardines in 1929 at the age of 23. He worked in Shanghai from 1931 until the outbreak of the Second World War in Europe in 1939."]}, {"page": "Keswick, William", "response": ["#redirectWilliam Keswick"]}]}}