{"wiki_id": "http://www.wikidata.org/entity/Q1677225", "itemLabel": "Jack Trevor", "itemDescription": "English actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Jack_Trevor", "wikipedia_page": {"main": "Anthony Cedric Sebastian Steane (14 December 1893 – 19 December 1976), known by the stage name Jack Trevor, was a British film actor of the silent and early sound era. Based in Weimar (and later Nazi) Germany, he acted in 67 films between 1922 and 1943. He was later convicted by the Central Criminal Court of collaboration for appearing in multiple propaganda films of the Nazi regime, but his sentence was overturned on the basis that he'd only worked under duress.", "link_mentions": [{"page": "Hans Albers", "response": ["|Lya Mara, Jack Trevor"]}, {"page": "Champagne (1928 film)", "response": ["* Jack Trevor – The Officer"]}, {"page": "List of German actors", "response": ["* Jack Trevor"]}, {"page": "List of pirate films and television series", "response": ["|Jack Trevor"]}, {"page": "List of Austrian films of the 1920s", "response": ["| Cab No. 13Fiaker Nr. 13 || Michael Curtiz || Lili Damita, Jack Trevor || Drama ||"]}, {"page": "List of adventure films of the 1920s", "response": ["|Nameless Woman||Georg Jacoby||Elga Brink, Jack Trevor, Georg Alexander||Germany||", "|Modern Pirates||Manfred Noa||Jack Trevor||Germany||Sea adventure"]}, {"page": "R v Steane", "response": ["Jack Trevor (Steane) was an actor living in Germany leading into World War II with his wife and children. At the war's outbreak, he was arrested, assaulted and interned. He was then sent for by Joseph Goebbels, who asked him to broadcast in English on Germany's behalf. He initially refused but, being in fear of the fate of his family, relented. At the end of the war, he reported to the liberating forces and described his experiences to them. As a result, he appeared before Mr Justice Henn-Collins at the Central Criminal Court, charged with doing acts likely to assist the enemy with intent to assist the enemy contrary to Regulation 2A of the Defence (General) Regulations 1939, which bore a maximum sentence of life imprisonment."]}, {"page": "List of French films of 1929", "response": ["|Deux balles au cœur||Jean Milva, Claude Heymann||Lily Fevrier, Jack Trevor||||"]}, {"page": "List of British films of 1932", "response": ["|A Voice Said Goodnight||William C. McGann||Nora Swinburne, Jack Trevor||Crime||"]}, {"page": "Hangmen, Women and Soldiers", "response": ["|Jack Trevor"]}, {"page": "List of English-language broadcasters for Nazi Germany", "response": ["|Jack Trevor (né Anthony Cedric Sebastian Steane)"]}, {"page": "Cab No. 13", "response": ["Cab No. 13 ( (Austria),  (Germany); ; )  is a 1926 drama film directed by Michael Curtiz and starring Lili Damita, Jack Trevor and Walter Rilla."]}, {"page": "Secrets of a Soul", "response": ["* Jack Trevor as Erich"]}, {"page": "The Love of Jeanne Ney", "response": ["* Jack Trevor"]}, {"page": "The Devious Path", "response": ["* Jack Trevor as Walter Frank, Maler"]}, {"page": "Ohm Krüger", "response": ["* Jack Trevor : British Officer"]}, {"page": "My Life for Ireland", "response": ["*Jack Trevor as the president of the martial court"]}, {"page": "Bright Eyes (1929 film)", "response": ["Bright Eyes is a 1929 British-Austrian romance film directed by Géza von Bolváry and starring Betty Balfour, Jack Trevor, and Fritz Greiner.BFI.org It is also known under the alternative title of Champagner."]}, {"page": "Pages of Life (film)", "response": ["* Jack Trevor as Lord Mainwaring"]}, {"page": "The White Roses of Ravensberg (1929 film)", "response": ["The White Roses of Ravensberg (German: Die weißen Rosen von Ravensberg) is a 1929 German silent drama film directed by Rudolf Meinert and starring Diana Karenne, Viola Garden and Jack Trevor. It was based on the 1887 novel The White Roses of Ravensberg by Eufemia von Adlersfeld-BallestremPrawer p.88 which had previously been made into a film in 1919.", "* Jack Trevor - Dr. Marcel Hochwald "]}, {"page": "Folly of Love", "response": ["Folly of Love (German: Unfug der Liebe) is a 1928 German silent comedy film directed by Robert Wiene and starring Maria Jacobini, Jack Trevor and Betty Astor. While several of Wiene's previous films had met with mixed responses, Folly of Love was universally praised by critics.Jung & Schatzberg p.148-149 It was Wiene's last silent film. His next work was the 1930 sound film The Other.", "*  Jack Trevor "]}, {"page": "The Alley Cat (1929 film)", "response": ["The Alley Cat is a 1929 British-German silent drama film directed by Hans Steinhoff and starring Mabel Poulton, Jack Trevor and Clifford McLaglen. The film was made as a co-production between the British company British & Foreign and the German Orplid-Film. Its German title was Nachtgestalten. The film was shot in Britain, partly on location in London. It was based on a novel by Anthony Carlyle.", "*Jack Trevor as Jimmy Rice"]}, {"page": "Fräulein Else (1929 film)", "response": ["* Jack Trevor as Paul, Tante Emma's Sohn "]}, {"page": "Chance the Idol", "response": ["Chance the Idol (German: Die Spielerin) is a 1927 German silent film directed by Graham Cutts and starring Jack Trevor, Agnes Esterhazy and Harry Liedtke. It was based on a play by Henry Arthur Jones. Cutts was working in Germany at the time for Gainsborough Pictures.", "* Jack Trevor as Golding"]}, {"page": "Not for Sale (film)", "response": ["* Jack Trevor as Desmond North"]}, {"page": "The Second Mother (1925 film)", "response": ["* Jack Trevor as Baron Fred Brochstädt "]}, {"page": "The Duty to Remain Silent", "response": ["* Jack Trevor as Robert, ihr Sohn "]}, {"page": "Rhenish Girls and Rhenish Wine", "response": ["Rhenish Girls and Rhenish Wine (German:Ein rheinisches Mädchen beim rheinischen Wein) is a 1927 German silent film directed by Johannes Guter and starring Xenia Desni, Jack Trevor and Elisabeth Pinajeff.Prawer p.208 The film's art direction was by Jacek Rotmil.", "* Jack Trevor as Baron Wendlingen "]}, {"page": "The Catwalk (film)", "response": ["The Catwalk () is a 1927 German silent drama film directed by Gerhard Lamprecht and starring Lissy Arna, Jack Trevor, and Andreas Behrens-Klausen. It was based on the 1890 novel of the same title by Hermann Sudermann. The film premiered at the Capital am Zoo in Berlin. Art direction was by Otto Moldenhauer."]}, {"page": "Cedric Steane", "response": ["#REDIRECT Jack Trevor"]}, {"page": "List of British films of 1922", "response": ["|Pages of Life||Adelqui Migliar||Evelyn Brent, Jack Trevor||Drama||"]}, {"page": "List of British films of 1929", "response": ["|The Alley Cat||Hans Steinhoff||Mabel Poulton, Jack Trevor||Drama||Co-production with Germany", "|Bright Eyes||Géza von Bolváry||Betty Balfour, Jack Trevor||Romance||Co-production with Austria", "|Champaigner||Geza von Bolvary||Betty Balfour, Jack Trevor||Romantic comedy||Co-production with Austria"]}, {"page": "Cause for Divorce", "response": ["Cause for Divorce () is a 1937 Czech-German comedy drama film directed by Karel Lamač and starring Anny Ondra, Jack Trevor and Robert Dorsay. It was Ondra's last film to be directed by Lamač.Bock & Bergfelder p. 347"]}, {"page": "The Prisoners of Shanghai", "response": ["The Prisoners of Shanghai () is a 1927 German silent drama film directed by Géza von Bolváry and Augusto Genina and starring Carmen Boni, Jack Trevor, and Bernhard Goetzke.", "*Jack Trevor as Ralph Sinclair, English consul"]}, {"page": "Petticoat Loose", "response": ["* Jack Trevor as Max Lorraine  "]}, {"page": "Modern Pirates", "response": ["Modern Pirates () is a 1928 German silent comedy film directed by Manfred Noa and starring Jack Trevor, Marietta Millner, and Sig Arno."]}, {"page": "The Venus of Montmartre", "response": ["The Venus of Montmartre (German:Die Venus vom Montmartre or Die Venus von Montmartre) is a 1925 German silent drama film directed by Frederic Zelnik and starring Lya Mara, Hans Albers, Jack Trevor, and Olga Tschechowa.Grange p.193", "* Jack Trevor as Prince of Chéran"]}, {"page": "The Lady and the Chauffeur", "response": ["The Lady and the Chauffeur (German:Die Dame und ihr Chauffeur) is a 1928 German silent film directed by Manfred Noa and starring Jack Trevor, Fritz Alberti and Elisabeth Pinajeff.Bock & Bergfelder p.17", "*   Jack Trevor as Jan Derrik "]}]}}