{"wiki_id": "http://www.wikidata.org/entity/Q16751741", "itemLabel": "Will Straw", "itemDescription": "British journalist and politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Will_Straw", "wikipedia_page": {"main": "William David John Straw, CBE (born 1980) works in the charitable sector. He worked as a civil servant, founded the political blog Left Foot Forward, was an associate director of the think-tank Institute for Public Policy Research, specialising in climate change, energy and transport, and is currently Chief Operating Officer of Clearly, a charity in the eye care sector.In the lead up to 2016's referendum on European Union membership, he was the executive director of Britain Stronger in Europe, the all-party umbrella organisation that unsuccessfully fought for the United Kingdom to remain a member of the European Union.", "link_mentions": [{"page": "Greater Manchester", "response": ["Art, tourism, culture and sport provide 16% of employment in Greater Manchester, with the proportion highest in Manchester. In 2014, Will Straw remarked that \"Greater Manchester is a creative powerhouse\", recognised for its cultural output in areas such as association football, media and digital content, and guitar and dance music. Since the industrial revolution, Greater Manchester has shared a rivalry with the nearby Liverpool, based on economic and industrial competition."]}, {"page": "Oxford University Student Union", "response": ["*2003 – Will Straw carried out protests against the government's introduction of tuition fees for students, despite his father Jack Straw being a senior member of the government of the day."]}, {"page": "Pimlico Academy", "response": ["* Will Straw, British policy researcher and Labour Party politician"]}, {"page": "1997 in the United Kingdom", "response": ["* 24 December – Will Straw, son of Cabinet minister Jack Straw, is arrested on suspicion of supplying cannabis."]}, {"page": "Careful (1992 film)", "response": ["The film received generally positive reviews. Review aggregator Rotten Tomatoes reports an 83% approval rating based on 12 reviews, with a weighted average of 6.45/10. A critical essay on the film by Will Straw was included in the book Canada's Best Features: Critical Essays on 15 Canadian Films.Walz, Eugene P., ed. Canada's Best Features: Critical Essays on 15 Canadian Films. Amsterdam: Editions Rodopi B.V., 2002. Print. "]}, {"page": "List of University of Oxford people in British public life", "response": ["| Will Straw"]}, {"page": "Nick Anstead", "response": ["He has had journal articles published in British Politics, Renewal, and Journal of Information Technology & Politics, and is co-editing with Will Straw a Fabian book."]}, {"page": "List of University of Oxford people with PPE degrees", "response": ["* Will Straw,  British policy researcher and Labour politician"]}, {"page": "Left Foot Forward", "response": ["Left Foot Forward (LFF) is a left-wing political news and comment site in the UK, established in 2009. Its creator, Will Straw, the son of Alice Perkins and Jack Straw, edited the newspaper until December 2010.\"Our people: Will Straw, Institute for Public Policy Research "]}, {"page": "Britannia Coconut Dancers", "response": ["The group's performance in blackface is popularly explained as either due to the origins of the dance in the mining community, a reference to the dancers' ancient origin as Barbary pirates, or as a disguise to ward off evil spirits.  Theresa Buckland's (1990) research discusses the likely origin of the tradition in minstrel shows.  She argued that over time the dancers have developed and passed on an alternative history of their tradition, one that does not include the connection to minstrelsy. The issue caused controversy in 2014, when local politician Will Straw was photographed with them.  He defended the custom: \"... it’s traditions from the past which give communities a sense of common identity for the present and the future. May the Coconutters continue for many years to come.\""]}, {"page": "1997 in England", "response": ["* 24 December – Will Straw, son of Cabinet minister Jack Straw, is arrested on suspicion of supplying cannabis."]}, {"page": "Britain Stronger in Europe", "response": ["Will Straw is the executive director of the group."]}, {"page": "2016 Prime Minister's Resignation Honours", "response": ["*Will Straw, for political and public service."]}, {"page": "Endorsements in the 2019 United Kingdom general election", "response": ["* Will Straw, policy researcher and politician"]}]}}