{"wiki_id": "http://www.wikidata.org/entity/Q16732180", "itemLabel": "John May", "itemDescription": "British judge", "wikipedia_url": "https://en.wikipedia.org/wiki/John_May_(judge)", "wikipedia_page": {"main": "Sir John Douglas May, PC (28 June 1923 – 15 January 1997) was a British Court of Appeal judge appointed by the British Government to investigate the miscarriages of justice related to the Maguire Seven and other miscarriages linked to IRA bombing offences.", "link_mentions": [{"page": "Michael Havers, Baron Havers", "response": ["In his submission to Sir John May's Inquiry into the Guildford and Woolwich bombings in 1989, Labour MP Chris Mullin cast doubt on Havers's integrity in the matter:Evidence to Sir John May's Inquiry into the Guildford and Woolwich bombings - 1989 ePolitix"]}, {"page": "Garry Runciman, 3rd Viscount Runciman of Doxford", "response": ["Runciman chaired the British Government's Royal Commission on Criminal Justice, established in 1991 and which continued Sir John May's inquiry into the convictions of the Maguire Seven and encompassed further miscarriages of justice. It reported to parliament in 1993. As a result, the Criminal Appeal Act 1995 established the Criminal Cases Review Commission as an executive Non-Departmental Public Body.CCRC Website , ccrc.gov.uk; Accessed 12 July 2014."]}, {"page": "List of Privy Counsellors (1952–present)", "response": ["*Sir John May (1923–1997)"]}, {"page": "John May", "response": ["John May may refer to:", "* John May (angel investor), manager of Business Angel investment groups", "* John May (shipwright), English shipwright in Dutch service", "* John May (bishop) (died 1598), Bishop of Carlisle", "* John May (priest) (died 1893), Dean of St George's Cathedral, Georgetown, Guyana", "* John May (Australian politician) (1844–1917), member of the Queensland Legislative Assembly", "* John May (North Carolina politician) (1950–2017), member of the North Carolina legislature", "* John May (Australian footballer) (born 1951), Australian footballer who played for Essendon", "* John May (cricketer) (1849–?), English cricketer", "* John May (footballer, born 1878) (1878–1933), footballer who played for Rangers FC", "* John May (1744–1790), founder of Maysville, Kentucky", "* John May (gangster), car mechanic for the Moran gang, killed in the Saint Valentine's Day Massacre", "* John May (judge) (1923–1997), British judge who headed the May Inquiry into \"Maguire Seven\" miscarriage of justice", "* John May (Medal of Honor) (1836–1886), American soldier and Medal of Honor recipient", "* John May (police officer) (1775–1856), superintendent in the London Metropolitan Police", "* John May (V), episode of the 2009 miniseries V"]}, {"page": "Sir John May", "response": ["#REDIRECT John May (judge)"]}, {"page": "May Inquiry", "response": ["#REDIRECTJohn May (judge)"]}, {"page": "Wheeler v JJ Saunders Ltd", "response": ["The case was originally sent to the Chancery Division of the High Court of Justice, before being transferred to Bristol District Registry, where Judge Weeks gave his judgment on 24 July 1992, dismissing 6 of the 10 claims made by Wheeler but awarding £2,820 of damages and issuing 3 injunctions. The case was appealed to the Court of Appeal of England and Wales, where it was heard by Staughton LJ, Gibson LJ and Sir John May. The matter of the easement was based on the case of Wheeldon v Burrows, where Thesiger LJ said that easements would be transferred when they were \"necessary to the reasonable enjoyment of the property\". The Court of Appeal held that the use of this easement was not necessary for the enjoyment of the property.J.P.L. (1995) p. 620"]}, {"page": "Thomas Summers West", "response": ["He became Director of the Macaulay Institute for Soil Research in 1975 retiring in 1987 and also became a Fellow of the Royal Society of Edinburgh in 1979. During this period he worked on a number of Royal Commissions and was Chairman of the Scientific Committee of Sir John May's investigation into the IRA Woolwich and Guildford bombings from 1991 to 1993. He also served as Chairman of Panels I and III on the Royal Society, International Relations Committee during the 1990s."]}, {"page": "Royal Brunei Airlines Sdn Bhd v Tan", "response": ["Lord Goff, Lord Ackner, Lord Steyn and Sir John May concurred."]}]}}