{"wiki_id": "http://www.wikidata.org/entity/Q1675581", "itemLabel": "Ivan Moody", "itemDescription": "British composer", "wikipedia_url": "https://en.wikipedia.org/wiki/Ivan_Moody_(composer)", "wikipedia_page": {"main": "Ivan Moody is a composer born in London, England, in 1964. He studied composition with at London University, York University and privately with John Tavener. He also studied Eastern Orthodox theology at the University of Joensuu in Finland. Moody is active as a conductor, having directed ensembles such as Voces Angelicae, the Kastalsky Chamber Choir (United Kingdom), Capilla Peña Florida (Spain), Cappella Romana (United States), the Choir of the Cathedral of St George, Novi Sad, (Serbia) the KotorArt Festival Choir (Montenegro), the Orthodox Choir of the University of Joensuu (Finland) and Ensemble Alpha (Portugal); and as a widely published musicologist.  His research interests include the music of Eastern Europe, especially 20th century and contemporary music from Russia and the Balkans, the music of the Orthodox Church in the modern era, music and spirituality, music as theology, Serbian church music, the aesthetics of Modernism and Postmodernism and their intersection with Orthodox church music and the musical culture of the Mediterranean.", "link_mentions": [{"page": "Viol", "response": ["A number of contemporary composers have written for viol, and a number of soloists and ensembles have commissioned new music for viol. Fretwork has been most active in this regard, commissioning George Benjamin, Michael Nyman, Elvis Costello, Sir John Tavener, Orlando Gough, John Woolrich, Tan Dun, Alexander Goehr, Fabrice Fitch, Andrew Keeling, Thea Musgrave, Sally Beamish, Peter Sculthorpe, Gavin Bryars, Barrington Pheloung, Simon Bainbridge, Duncan Druce, Poul Ruders, Ivan Moody, and Barry Guy; many of these compositions may be heard on their 1997 CD Sit Fast. The Yukimi Kambe Viol Consort has commissioned and recorded many works by David Loeb, and the New York Consort of Viols has commissioned Bülent Arel, David Loeb, Daniel Pinkham, Tison Street, Frank Russo, Seymour Barab, William Presser, and Will Ayton, many of these compositions appearing on their 1993 CD Illicita Cosa."]}, {"page": "Cantata", "response": ["In 1940, the Brazilian composer Heitor Villa-Lobos created a secular cantata titled Mandu çarará, based on an Indian legend collected by Barbosa Rodrigues. Francis Poulenc composed in 1943 Figure humaine, FP 120, a cantata for double mixed choir of 12 voices on poems by Paul Éluard. Igor Stravinsky composed a work titled simply Cantata in 1951–52, which used stanzas from the 15th-century \"Lyke-wake Dirge\" as a narrative frame for other anonymous English lyrics, and later designated A Sermon, a Narrative and a Prayer (1961) as \"a cantata for alto and tenor soli, speaker, chorus, and orchestra\". Luigi Nono wrote Il canto sospeso in 1955–56. Hans Werner Henze composed a Cantata della fiaba estrema and Novae de infinito laudes (both in 1963), as well as a number of other works that might be regarded as cantatas, such as Kammermusik (1958, rev. 1963), Muzen Siziliens (1966), and El Cimarrón (1969–70). Momente (1962–64/1969), one of the most important works of Karlheinz Stockhausen, is often described as a cantata. Benjamin Britten composed at least six works he designated as cantatas: The Company of Heaven (1937), Rejoice in the Lamb, Op. 30 (1943), Saint Nicolas, Op. 42 (1949), the Cantata academica, Op. 62 (1959), the Cantata Misericordium, Op. 69 (1963), and Phaedra, Op. 93 (1975). Alberto Ginastera also composed three works in this form: the Cantata para América Mágica, Op. 27 (1960), Bomarzo, Op. 32 (1964), and Milena, Op. 37 (1971), and Gottfried von Einem composed in 1973 An die Nachgeborenen based on diverse texts, the title taken from a poem of Bertolt Brecht. Mikis Theodorakis composed the cantatas According to the Sadducees and Canto Olympico. Herbert Blendinger's Media in vita was premiered in 1980, his Mich ruft zuweilen eine Stille (Sometimes a silence calls me) in (1992), and Allein den Betern kann es noch gelingen (It can only be achieved by those who pray) in 1995. Iván Erőd wrote in 1988/89) Vox Lucis (Voice of the Light), Op. 56. Ivan Moody wrote in 1995 Revelation. Cantatas were also composed by Mark Alburger, Erik Bergman, Carlos Chávez, Osvald Chlubna, Peter Maxwell Davies, Norman Dello Joio, Lukas Foss, Roy Harris, Arthur Honegger, Alan Hovhaness, Dmitry Kabalevsky, Libby Larsen, Peter Mennin, Dimitri Nicolau, Krzysztof Penderecki, Daniel Pinkham, Earl Robinson, Ned Rorem, William Schuman (A Free Song), Roger Sessions, Siegfried Strohbach, Dave Brubeck, Michael Tippett, and Kurt Weill."]}, {"page": "King Edward VI Grammar School, Chelmsford", "response": ["* Ivan Moody, composer"]}, {"page": "Sofia Gubaidulina", "response": ["Another influence of improvisation techniques can be found in her fascination with percussion instruments. She associates the indeterminate nature of percussive timbres with the mystical longing and the potential freedom of human transcendence. In an interview with the modern British composer Ivan Moody, Gubaidulina provides an explanation for how percussion is utilized in her works to show spiritualism. She says,"]}, {"page": "Alfred Schnittke", "response": ["Alfred Garrievich Schnittke (, Alfred Garriyevich Shnitke; 24 November 1934 – 3 August 1998) was a Russian composer of Jewish-German descent. Among the most performed and recorded composers of late 20th-century classical music, the musicologist Ivan Moody described him as a \"composer who was concerned in his music to depict the moral and spiritual struggles of contemporary man in [...] depth and detail.\""]}, {"page": "List of 21st-century classical composers", "response": ["|Ivan Moody || 1964 || ||  English ||  ||"]}, {"page": "Chanticleer (ensemble)", "response": ["In May 2007, Chanticleer released \"And On Earth, Peace: A Chanticleer Mass\" (Warner Classics) a new mass written by five contemporary composers. Israeli-born composer Shulamit Ran wrote the Credo to the Hebrew text \"Ani Ma'amin\"; US composer Douglas Cuomo contributed the Kyrie; Turkish-American composer Kamran Ince composed the Gloria section to a sufi text; English composer Ivan Moody composed the Sanctus; and Irish composer Michael McGlynn (director of Anúna) composed the Agnus Dei. The Mass was premiered in performance at the Metropolitan Museum of Art in New York City and was followed by six performances throughout the San Francisco Bay area.The New York Times has more on the repertoire here ."]}, {"page": "The King's Singers", "response": ["The King's Singers are also known for frequently commissioning works from contemporary composers. Starting with \"Timepiece\", commissioned by the Camden Festival in 1972 from composer Paul Patterson (and still regularly performed today), they have continued by commissioning pieces from (amongst others) Sally Beamish, Bob Chilcott, Sir Peter Maxwell Davies, Howard Goodall, Daron Hagen, Jackson Hill, Graham Lack, Libby Larsen, György Ligeti, John McCabe, Ivan Moody, Jocelyn Pook, Geoffrey Poole, Francis Pott, Ned Rorem, Joby Talbot, Sir John Tavener and Malcolm Williamson. In 2008 they performed a piece commissioned jointly for them and the National Youth Choirs of Great Britain written by Eric Whitacre."]}, {"page": "Fretwork (music group)", "response": ["In addition to its performances of earlier music, Fretwork has been active in commissioning new works for viol consort.  Its 1997 recording Sit Fast includes new works by such composers as Gavin Bryars, Tan Dun, and Elvis Costello. It has also commissioned music from Sir John Tavener, Michael Nyman, Alexander Goehr, George Benjamin, Duncan Druce, Fabrice Fitch, Gavin Bryars, Barry Guy, Poul Ruders, Simon Bainbridge, Ivan Moody, John Woolrich, Thea Musgrave, Peter Sculthorpe, Sally Beamish, Andrew Keeling and Orlando Gough."]}, {"page": "List of Eastern Orthodox Christians", "response": ["*Ivan Moody - British composer, conductor and Orthodox priest."]}, {"page": "The Tallis Scholars", "response": ["The Tallis Scholars have also performed and recorded Russian Orthodox repertoire, including music by Sergei Rachmaninoff and Igor Stravinsky, and contemporary music, including works by Norbert Moret, Ivan Moody, Arvo Pärt, John Tavener and Eric Whitacre."]}, {"page": "Cappella Romana", "response": ["Cappella Romana is a vocal ensemble founded in 1991 in Portland, Oregon.  Its name, meaning \"Roman Chapel\", refers to the medieval Greek concept of the Roman oikoumene (inhabited world), which embraced Rome and Western Europe, as well as the Byzantine Empire of Constantinople (\"New Rome\") and its Slavic commonwealth centered at Moscow.Cappella Romana  It has become especially known for its exploration of Eastern Orthodox vocal music.  It has collaborated with notable museum exhibitions at the Metropolitan Museum of ArtMusic of Greece CD - The Metropolitan Museum of Art - Met Museum Store in New York and the J. Paul Getty Museum in Los Angeles. The ensemble's 2002 performance of Ivan Moody's Passion and Resurrection was acclaimed by Los Angeles Times music critic Chris Pasles as \"sung gorgeously\" and \"like jeweled light flooding the space\".", "The ensemble is directed by Alexander Lingas,\"Dr. Alexander Linges, Professor in Music\", Staff Directory, City University of London. a musicologist of Byzantine music at City University, London.  Guest artists with similar interests regularly appear with the ensemble, including Ioannis Arvanitis, Stelios Kontakiotis, Ivan Moody, and Vladimir Morosan.", "* 2003 — The Akáthistos Hymn by Ivan Moody"]}, {"page": "Roman Hurko", "response": ["Roman Hurko is an American-Canadian of Ukrainian descent, born in Toronto, Canada (1962).  A graduate of The Yale Institute of Sacred Music (Master of Arts and Religion) and The University of Toronto (B.A. Music History and Theory), he has also studied composition privately with composer Father Ivan Moody in Portugal."]}, {"page": "Ivan Moody", "response": ["|Sixx:A.M. featuring Joe Elliott, Brantley Gilbert, Ivan Moody, Slash, Corey Taylor, Awolnation and Tommy Vext)"]}, {"page": "Trio Mediæval", "response": ["Since its early career, the trio has expanded its repertoire to contemporary compositions such as those of Gavin Bryars and Ivan Moody. The title track on the group's album, Words of the Angel (2001), was a Moody work."]}, {"page": "Suzie LeBlanc", "response": ["* Ivan Moody: Passion and Resurrection (Hyperion, 1997) – with Red Byrd and Capella Amsterdam"]}, {"page": "Sungji Hong", "response": ["Sungji Hong () (b. 1973) is a South Korean composer. Her work Missa Lumen de Lumine, a setting of the Roman-rite Catholic Mass ordinary for three voices, was written for Trio Mediæval in 2002. The trio recorded it in 2005. In a review for The Gramophone, Ivan Moody found it \"rather a fragmentary affair\", though with \"some dazzling moments\"."]}, {"page": "Moody (surname)", "response": ["*Ivan Moody (born 1980), American singer", "*Ivan Moody (born 1964), British composer"]}, {"page": "Estêvão Lopes Morago", "response": ["The British composer Ivan Moody wrote:"]}, {"page": "List of compositions for viola: L to N", "response": ["* Ivan Moody (b. 1964)"]}, {"page": "Amarcord (ensemble)", "response": ["Contemporary composers such as Ivan Moody and Dimitri Terzakis wrote music for the ensemble amarcord. In 1998 Marcus Ludwig (born 1960) wrote in Leipzig Drei Gedichte von Paul Celan. One of these three poems of Paul Celan, Tenebrae, was recorded. They premiered in 1999 Apokathilosis (from the Orthodox vespers of Good Friday) of Moody who wrote for them in 2002 Chalice of Wisdom, Matins of the Feast of St Thomas. Terzakis composed in 2002 Kassandra after Aischylos, and Siegfried Thiele (born 1962) wrote for them Urworte, Orphisch after Goethe. Bernd Franke (born 1959) composed for them in 2002 unseen blue I for voices and bandoneón on words of Pascual Contursi, William Shakespeare, Arthur Rimbaud, Michael Frank and Cesare Pavese, and in 2006 unseen blue II on words of Guillaume de Machaut, Arthur Rimbaud, John Milton, David Bengree-Jones and Lodovico Agostini. Peronellas Fass (Peronella’s Barrel) on a Boccaccio Decameron scene, written on a commission of the ensemble in 2005 by Aristides Strongylis (born 1974), was premiered at the opening concert of a capella in 2006."]}, {"page": "English Chamber Choir", "response": ["It has also commissioned many new works, most recently the Troparion of Kassiani from the Greek-Canadian composer Christos Hatzis and Sub tuum praesidium by Ivan Moody.", "The choir has a special association with contemporary music written for the Orthodox Church and/or inspired by Eastern traditions. It has sung and recorded many works by John Tavener, Ivan Moody and Christos Hatzis, among others. It has also collaborated on several occasions with the William Tyndale Society in programmes exploring not only the words of Tyndale himself, but the use of vernacular texts in sacred music across Europe.", "This included works by Bach, Bax, Tallis (the 40-part motet Spem in alium), Christos Hatzis and Ivan Moody. Paddy O'Connell and Rick Wakeman were guests.", "# Ivan Moody (born 1964): The Troparion of Kassiani", "# Ivan Moody (born 1964): When Augustus Reigned"]}, {"page": "Singer Pur", "response": ["* 1994 - Singer Pur Vokalsolistenensemble - Lassus: four works, Johnny Mercer: Emily, Ludwig Senfl, Ralph Vaughan Williams, Palestrina, Ivan Moody: The Wild Swans at Coole, György Ligeti, Guillaume Dufay, Max Reger Al Jarreau, Luca Marenzio.", "* 1997 - Musik für Stimmen Music for Voices. Weiss and Douglas (arr. Hans Huber): What a Wonderful World, Claude Debussy Trois chansons de Charles d’Orléans John Cage, Ivan Moody, György Ligeti, Hans Leo Haßler, Jacobus Clemens non Papa, Orlando di Lasso  Ludwig Sennfl, Ninot le Petit, Cypriano de Rore, Paul Patterson, Johannes Brahms, Irish traditional The little green lane, Wilhelm Stenhammar, Friedrich Silcher, Joseph Gabriel Rheinberger, Neil Hefti. Ars Musici", "* 2004 - Rihm, Sciarrino, Moody, Metcalf - Wolfgang Rihm: Tenebrae factae sunt, Salvatore Sciarrino: Responsorio delle tenebre a sei voci, Ivan Moody: Lamentation of the Virgin, Joanne Metcalf. with The Hilliard Ensemble", "* 2007 - Das Hohelied der Liebe - Settings from the Song of Songs - Dominique Phinot, Ivan Moody Canticum Canticorum II (1994) Leonhard Lechner, Guillaume Dufay, Brian Elias, Jean Richafort, Heinrich Schütz, Joanne Metcalf, John Plummer, Ludwig Sennfl, Wilhelm Keller"]}, {"page": "Guy Protheroe", "response": ["Over the years Guy has directed the ECC in hundreds of performances and projects in the UK and also in Belgium, Bulgaria, France, Greece and Switzerland. A few years after the ECC was founded a chamber orchestra, the English Players, was formed to accompany it in the choral/orchestral repertoire from the 17th century onwards, playing on period instruments as appropriate, both in the UK and Europe. Together the Choir and Players have performed works ranging from Monteverdi's Vespers of 1610, through Bach's Passions and the B minor Mass, Handel's Dixit Dominus and Messiah, Mozart's Requiem and C minor Mass, to Brahms Ein Deutsches Requiem and Elgar's The Dream of Gerontius. In May 2012 he conducted the Choir and Players in a very rare revival of the Portuguese composer Antonio Teixeira's Te Deum (1734) for 16 soloists, 5 choirs and orchestra at the Brighton Festival. The Choir's unaccompanied (a cappella) repertoire ranges from mediaeval times to today – highlights including Thomas Tallis's 40-part motet Spem in alium which it has performed by invitation of the Lord Mayor of London at the Mansion House, and many compositions inspired by the music of the Eastern Church (and in particular Byzantine chant) including Sir John Tavener, Ivan Moody and the Greek-Canadian composer Christos Hatzis. The Choir has sung publicly in the presence of HM The Queen and most members of the Royal Family and, at the personal invitation of HM The Queen, at Buckingham Palace and Windsor Castle."]}]}}