{"wiki_id": "http://www.wikidata.org/entity/Q16743899", "itemLabel": "Huw Jenkins", "itemDescription": "Welsh football chairman", "wikipedia_url": "https://en.wikipedia.org/wiki/Huw_Jenkins_(Welsh_businessman)", "wikipedia_page": {"main": "Huw Morgan Jenkins   (born 9 March 1963) is a Welsh businessman who was chairman of Swansea City football club between January 2002 and February 2019.", "link_mentions": [{"page": "Swansea City A.F.C.", "response": ["On 9 December 2015, manager Garry Monk was sacked after one win in eleven matches. The club, after a period with Alan Curtis as caretaker manager for the third time, chose the Italian former Udinese Calcio coach Francesco Guidolin. During the 2016–17 preseason, Swansea City came under new ownership by an American consortium led by Jason Levien and Steven Kaplan, who bought a controlling interest in the club in July 2016. Chairman Huw Jenkins remained at the club. On 3 October 2016, Guidolin was sacked and replaced by American coach Bob Bradley. The selection of Bradley marked the first time a Premier League club had ever hired an American manager. Bradley himself was sacked after just 85 days in charge; he won only two of his 11 games, conceded 29 goals, and left with a win percentage of just 18.1%.", "During the season, chairman Huw Jenkins and the club's American owners were criticised by Swansea fans and pundits for poor transfer windows and the firing of managers; Alan Shearer blamed the Swansea board for moving away from the style of play found under previous managers Brendan Rodgers and Roberto Martínez.", "Swansea City were relegated on 13 May 2018, following a 2–1 defeat to already-relegated Stoke City. On 11 June 2018, Graham Potter was announced as the club's new manager, replacing Carvalhal. On 2 February 2019, Huw Jenkins resigned as chairman amid increasing criticism over the club's sale to the American consortium in 2016 and the club's subsequent relegation from the Premier League. He was replaced with Trevor Birch. The first season back in the Championship produced a 10th-place finish, including a quarter-final appearance in the FA Cup. However, Potter left at the end of the season to manage Premier League club Brighton. He was succeeded by former England U17 manager Steve Cooper, with Mike Marsh joining him as his assistant. In September 2019, Cooper was named EFL Championship Manager of The Month, with Swansea City sitting top of the table after an unbeaten first month; this was Swansea's best start to a season in 41 years. On the final day of the season, Swansea beat Reading 4–1 to finish sixth, moving into the play-offs ahead of Nottingham Forest on goal difference, but were later defeated by Brentford in the semi-final second leg."]}, {"page": "Bob Bradley", "response": ["On the December 27, 2016, following a 1–4 defeat by West Ham, Bradley was sacked by Swansea after only 85 days and 11 games in charge of the club, the second shortest reign of any manager in the history of the Premier League. He left with a  record, conceding 29 goals – the most goals conceded by any Premier League club in the same time period, with Swansea gaining only 8 (24.2%) out of a maximum 33 points available for the 11 game period – an average of 0.73 points per game. In a club statement, Huw Jenkins, the Swansea chairman, said: \"We are sorry to lose Bob after such a short period of time. Unfortunately things haven't worked out as planned and we felt we had to make the change with half the Premier League season remaining. Personally, I have nothing but praise for Bob. He is a good man; a good person who gave everything to the job. His work-rate is phenomenal and we wish him well for the future.\""]}, {"page": "Garry Monk", "response": ["On 4 February 2014, Monk was appointed by chairman Huw Jenkins as interim player-manager following the sacking of manager Michael Laudrup. His first match in charge was the South Wales derby on 8 February against Cardiff City, which Swansea won 3–0 with all three goals scored in the second half. After finishing second in their Europa League Group A behind Valencia, Monk's Swansea reached the round of 32, in which they were knocked out by Rafa Benítez's Napoli side after losing 3–1 on aggregate."]}, {"page": "Gylfi Sigurðsson", "response": ["On 28 May, Swansea agreed a £6.8 million fee with 1899 Hoffenheim for the permanent transfer of Gylfi, subject to him passing a medical. However, following Swansea manager Brendan Rodgers' move to Liverpool, the deal collapsed, despite Huw Jenkins keeping hope in the deal alight. In 18 Premier League matches during his loan spell for Swansea, Gylfi scored seven goals and added four assists."]}, {"page": "Jamie Proctor", "response": ["On 18 August 2012, Proctor signed a two-year contract with Premier League club Swansea City, who paid Preston an undisclosed fee. He was signed to be a part of the club's new under-21 team rather than a part of Michael Laudrup's first-team plans as chairman Huw Jenkins cited a need to build for the future. He had been identified as a target by previous manager Brendan Rodgers in 2011. His time at the Liberty Stadium was 'frustrating' as he made no appearances in any senior competitions and hated playing youth-team football. On 26 October 2012, Proctor joined League One club Shrewsbury Town on a month long loan, with manager Graham Turner looking for a \"good option\" up front. He made his \"Shrews\" debut the next day, playing 90 minutes in a 2–2 draw with Colchester United at the New Meadow. However he made just two further appearances for the club."]}, {"page": "2006 Football League Trophy Final", "response": ["The week before the final, the main sponsor of the competition LDV Vans pulled its sponsorship after being sold to a new owner. The company had entered administration the previous year, but the new owners had decided not to honour the prize fund agreement. This meant that the winners of the match would receive no prize money, rather than the £50,000 that had been on offer when the competition began. Swansea chairman Huw Jenkins estimated that, if they won the trophy, the loss of a sponsor and the contractual win bonuses for the players would result in a loss of around £75,000 for his club. The two clubs would however receive 45 per cent of the gate receipts for the final."]}, {"page": "Paul Clement (football manager)", "response": ["After a poor start to the 2017–18 season, Clement was criticised for playing \"boring\" and \"negative\" football, with some Swansea fans questioning his tactical decisions. Others, notably The Guardian journalist Stuart James, criticised chairman Huw Jenkins and the club's American owners for a poor transfer window, in which the club sold key performers Fernando Llorente and Gylfi Sigurðsson from the previous season. Clement was sacked on 20 December 2017, leaving the club bottom of the league table and four points adrift of safety."]}, {"page": "Huw Jenkins (cricketer)", "response": ["Huw Jenkins (24 October 1944 – 21 August 2013) was a Welsh cricketer active in 1970 who played for Glamorgan. He was born in Swansea and died in Clevedon. He appeared in one first-class match as a lefthanded batsman who bowled right arm medium pace. He scored 81 runs with a highest score of 65.Huw Jenkins at CricketArchive"]}, {"page": "Huw Jenkins (disambiguation)", "response": ["Huw Jenkins is managing partner at BTG Pactual investment bank.", "Huw Jenkins may also refer to:", "*Huw Jenkins (Welsh businessman) (born 1963), chairman of Swansea City A.F.C.", "*Huw Jenkins (cricketer) (1944–2013), Welsh cricketer"]}, {"page": "2014–15 Swansea City A.F.C. season", "response": ["| Chairman ||  Huw Jenkins"]}, {"page": "2015–16 Swansea City A.F.C. season", "response": ["| Chairman ||  Huw Jenkins"]}, {"page": "2016–17 Swansea City A.F.C. season", "response": ["| Chairman ||  Huw Jenkins"]}, {"page": "2017–18 Swansea City A.F.C. season", "response": ["| Chairman ||  Huw Jenkins"]}]}}