{"wiki_id": "http://www.wikidata.org/entity/Q1675628", "itemLabel": "Ivan T. Sanderson", "itemDescription": "British biologist", "wikipedia_url": "https://en.wikipedia.org/wiki/Ivan_T._Sanderson", "wikipedia_page": {"main": "Ivan Terence Sanderson (January 30, 1911 – February 19, 1973) was a British biologist and writer born in Edinburgh, Scotland, who became a naturalized citizen of the United States. Along with Belgian-French biologist Bernard Heuvelmans, Sanderson was a founding figure of cryptozoology, a pseudoscience and subculture. Sanderson authored material on paranormal subjects and wrote fiction under the pen name Terence Roberts.", "link_mentions": [{"page": "Bigfoot", "response": ["Ivan T. Sanderson and Bernard Heuvelmans, founders of the subculture and pseudoscience of cryptozoology, have spent parts of their career searching for Bigfoot. Later scientists who researched the topic included Jason Jarvis, Carleton S. Coon, George Allen Agogino and William Charles Osman Hill, though they later stopped their research due to lack of evidence for the alleged creature."]}, {"page": "Cryptozoology", "response": ["Cryptozoology is a pseudoscience and subculture that searches for and studies unknown, legendary, or extinct animals whose present existence is disputed or unsubstantiated, particularly those popular in folklore, such as Bigfoot, the Loch Ness Monster, Yeti, the chupacabra, the Jersey Devil, or the Mokele-mbembe.  Cryptozoologists refer to these entities as cryptids, a term coined by the subculture. Because it does not follow the scientific method, cryptozoology is considered a pseudoscience by mainstream science: it is neither a branch of zoology nor folklore studies. It was originally founded in the 1950s by zoologists Bernard Heuvelmans and Ivan T. Sanderson.", "As a field, cryptozoology originates from  the works of Bernard Heuvelmans, a Belgian zoologist, and Ivan T. Sanderson, a Scottish zoologist. Notably, Heuvelmans published On the Track of Unknown Animals (French Sur la Piste des Bêtes Ignorées) in 1955, a landmark work among cryptozoologists that was followed by numerous other like works. Similarly, Sanderson published a series of books that assisted in developing hallmarks of cryptozoology, including Abominable Snowmen: Legend Come to Life (1961).Regal (2011a: 326–29).Mullis (2021: 185): \"Historians attempting to trace the beginnings of cryptozoology typically locate the practice's origins in the mid-twentienth century when Belgian-French zoologist Bernard Heuvelmans (1916-2001), with deference to Scottish-born naturalist Ivan T. Sanderson (1911-1973), is believed to have coined the term.\""]}, {"page": "Patterson–Gimlin film", "response": ["Patterson said he became interested in Bigfoot after reading an article about the creature by Ivan T. Sanderson in True magazine in December 1959.Perez, 6 In 1961 Sanderson published his encyclopedic Abominable Snowmen: Legend Come to Life, a worldwide survey of accounts of Bigfoot-type creatures, including recent track finds, etc. in the Bluff Creek area, which heightened his interest. Thereafter, Marian Place wrote:"]}, {"page": "1973", "response": ["** Ivan T. Sanderson, Scottish-American naturalist, cryptozoologist and writer (b. 1911)"]}, {"page": "Charles Fort", "response": ["In 1939, Eric Frank Russell first published the novel which became Sinister Barrier, in which he names Fort explicitly as an influence. Russell included some of Fort's data in the story.Russell, Eric Frank, Sinister Barrier, Paperback Library, New York, 1966  Ivan T. Sanderson, Scottish naturalist and writer, was a devotee of Fort's work, and referenced it heavily in several of his own books on unexplained phenomena, notably Things (1967), and More Things (1969). Louis Pauwels and Jacques Bergier's The Morning of the Magicians was also heavily influenced by Fort's work and mentions it often. Author Donald Jeffries referenced Charles Fort repeatedly in his 2007 novel The Unreals. Joe Milutis writes a short chapter in his book Failure, a Writer's Life on Charles Fort, characterising Fort's prose as \"well-nigh unreadable, yet strangely exhilarating\".Milutis, J. (2012), \"Charles Fort\", Failure, a Writer's Life, Alresford: Zero Books, p. 13."]}, {"page": "Bogeyman", "response": ["** The Jersey Devil, which originated in the Pine Barrens of New Jersey in the early 18th century, was originally described as having a horse's head, bat wings, cloven hooves, and a serpent's tail. Regarding the famous Jersey Devil sightings of 1909, Loren Coleman and Ivan T. Sanderson offered the explanation that they were part of an elaborate real estate hoax, used by developers as a boogeyman figure to frighten residents into selling their property at lower prices.Coleman, Loren and Clark, Jerome (1999). Cryptozoology A to Z. Simon & Schuster. pp. 120–121. ."]}, {"page": "Fortean Society", "response": ["The Fortean Society was started in the United States in 1931 during a meeting held in the New York flat of American writer Charles Hoy Fort, in order to promote his ideas. The Fortean Society was primarily based in New York City.  Its first president was Theodore Dreiser, an old friend of Charles Fort, who had helped to get his work published. Founding members of the Fortean Society included Tiffany Thayer, Booth Tarkington, Ben Hecht, Alexander Woollcott and many of New York's literati such as Dorothy Parker. But \"Fort had his share of detractors. His friend H. L. Mencken said his head was filled with 'Bohemian mush. Other members included Vincent Gaddis, Ivan T. Sanderson, A. Merritt, Frank Lloyd Wright and Buckminster Fuller.  The first six issues of the Fortean Society's newsletter \"Doubt\" were each edited by a different member, starting with Theodore Dreiser.  Tiffany Thayer thereafter took over editorship of subsequent issues.  Thayer began to assert extreme control over the society, largely filling the newsletter with articles written by himself, and excommunicating the entire San Francisco chapter, reportedly their most active, after disagreements over the society's direction, and forbidding them to use the name Fortean. During World War II, for example, Thayer used every issue of \"Doubt\" to espouse his politics.  Particularly, he frequently expressed opposition to Civil Defense, going to such lengths as encouraging readers to turn on their lights in defiance to air raid sirens.  In contrast to the spirit of Charles Fort, he not only dismissed flying saucers as nonsense, but also dismissed the atomic bomb as a hoax.\"Personalities in Science Fiction: Charles Fort: His Objects Fade in the West\", by Robert Barbour Johnson (If, July 1952)."]}, {"page": "Fortean Times", "response": ["Issue #21 had the debut of FT semiregular column \"Strange Deaths\" (later descriptively subtitled \"Unusual ways of shuffling off this mortal coil\"), while issue #22 updated FT's to include (Ivan T. Sanderson's) The Society for the Investigation of the Unexplained, alongside INFO. Issue #23 featured an article by Robert Anton Wilson on, aptly, \"The 23 Phenomenon,\"Wilson, Robert Anton. \"The 23 Phenomenon,\"  Fortean Times (May 2007). made available a second index (1975, to The News #8–13) and included a 12-page \"Review Supplement\", issued as a separately bound supplement since the then-printers had difficulty binding more than 40 pages. With #24, the printers were changed to Windhorse Press to overcome this difficulty, and FT became officially 52 pages in length, the changes cemented in issue #25 with a new font for the title and a change of address — c/o London-based \"SF and cosmic\" bookshop Dark They Were and Golden-Eyed, run by Derek Stokes (who had sold Rickard the four Fort books 10 years previously). The same issue ran an obituary for Eric Frank Russell, of whom Rickard was a considerable fan. He writes that Russell turned down an invitation to contribute material to The News back in 1973, having \"earned his rest\" after 40 years as an active Fortean. Rickard further states that Russell was one of the key Fortean-fiction writers he read in Campbell's Astounding Science Fiction  and Analog, and the author of \"the first Fortean book I [Rickard] ever read\": Russell's Great World Mysteries. Issue #26 trailed \"a special series of 'Occasional Papers' in Fortean subjects\" to be edited by Steve Moore, and #27 — the 5th Anniversary issue — welcomed Michigan-native David Fideler (whose Anomaly Research Bulletin was then due to cease publication, although its subscribers, FT promised, would be absorbed by them) as FT's \"man in the New World\"."]}, {"page": "Bernard Heuvelmans", "response": ["Bernard Heuvelmans (10 October 1916 – 22 August 2001) was a Belgian-French scientist, explorer, researcher, and writer probably best known, along with Scottish-American biologist Ivan T. Sanderson, as a founding figure in the pseudoscience and subculture of cryptozoology. His 1958 book On the Track of Unknown Animals (originally published in French in 1955 as Sur la Piste des Bêtes Ignorées) is often regarded as one of the most influential cryptozoology texts.", "Heuvelmans' books made reference to literary sources. He was influenced by Jules Verne and Arthur Conan Doyle's book The Lost World (1912).  Though earlier interested in zoological oddities, he credits a 1948 Saturday Evening Post article, \"There Could be Dinosaurs\" by Ivan T. Sanderson, with inspiring a determined interest in unknown animals. Sanderson discussed the possibility of dinosaurs surviving in remote corners of the world. Heuvelmans was also influenced by the work of Anthonie Cornelis Oudemans, who had defended the existence of the sea serpent.Harrison, Paul. (2002). Sea Serpents and Lake Monsters of the British Isles. Robert Hale. pp. 20-22"]}, {"page": "Martin and Osa Johnson", "response": ["Television's first wildlife series, Osa Johnson's The Big Game Hunt a.k.a. The Big Game Hunt, premiered in 1952. The 26 half-hour episodes were released by Explorers Pictures and primarily used Johnson film. Episodes introduced by Osa Johnson were \"African Army,\" \"Boy Scouts in Africa,\" \"Climbing Fish, The Floating Terror, Giant Elephants, Goring Brutes, Headhunters of Borneo, Jungle Panic, Jungle Power,\" \"Jungle Warriors,\" \"Rhinoceros,\" \"Simba's Trail,\" \"Slinking Fury\" and \"Weird Tribes.\" Episodes introduced by Ivan T. Sanderson were \"Armed Menace,\" \"Cameras in the Wilderness,\" \"Herds of Destruction,\" \"Jaws of Death,\" \"Kill to Live,\" \"Man-Eaters of the Masai,\" \"Monkey Safari,\" \"Orang-utan,\" \"Pygmy Hunters,\" \"Return to Adventure,\" \"Terror of the Plains\" and \"Trek Through the Wild Lands.\""]}, {"page": "Travel literature", "response": ["Travel and nature writing merge in many of the works by Sally Carrighar, Gerald Durrell and Ivan T. Sanderson. Sally Carrighar's works include One Day at Teton Marsh (1965), Home to the Wilderness (1973), and Wild Heritage (1965). Gerald Durrell's My Family and Other Animals (1956) is an autobiographical work by the British naturalist. It tells of the years that he lived as a child with his siblings and widowed mother on the Greek island of Corfu between 1935 and 1939. It describes the life of the Durrell family in a humorous manner, and explores the fauna of the island. It is the first and most well-known of Durrell's \"Corfu trilogy\", together with Birds, Beasts, and Relatives and The Garden of the Gods (1978).", "Ivan T. Sanderson published Animal Treasure, a report of an expedition to the jungles of then-British West Africa; Caribbean Treasure, an account of an expedition to Trinidad, Haiti, and Surinam, begun in late 1936 and ending in late 1938; and Living Treasure, an account of an expedition to Jamaica, British Honduras (now Belize) and the Yucatán. These authors are naturalists, who write in support of their fields of study."]}, {"page": "British Security Co-ordination", "response": ["* Ivan T. Sanderson"]}, {"page": "Globster", "response": ["The term \"globster\" was coined by Ivan T. Sanderson in 1962 to describe the Tasmanian carcass of 1960, which was said to have \"no visible eyes, no defined head, and no apparent bone structure.\" Other sources simply use the term \"blob\"."]}, {"page": "Flatwoods monster", "response": ["According to former news editor Holt Byrne, \"newspaper stories were carried throughout the country, radio broadcasts were carried on large networks, and hundreds of phone calls were received from all parts of the country\". The national press services rated the story \"No. 11 for the year\". A minister from Brooklyn came to question the May family. A Pittsburgh paper sent a special reporter. UFO and Fortean writers like Gray Barker and Ivan T. Sanderson arrived to investigate."]}, {"page": "The World Is Yours (TV series)", "response": ["The World Is Yours is an early television series, making its debut on June 26, 1951, on several stations of the CBS television network in the eastern United States. This half-hour daytime program (4:30-5:30 p.m., EDT) was hosted from New York by naturalist and author Ivan T. Sanderson, and was broadcast Monday through Friday. "]}, {"page": "Roy Pinney", "response": ["He changed his life's course through his collaboration with the nature writer Ivan T. Sanderson, who brought a different animal to show off to Dave Garroway, the talk show host, each week. Pinney was Sanderson's producer and cameraman. He went on to work as cameraman for such nature show gurus as Marlin Perkins and Lorne Greene. Pinney wrote 2,000 articles and over 20 books, about everything from tribal cultures to how to survive the atomic bomb. The last was The Snake Book, published in 1981. He made more than 160 expeditions to remote destinations.", "Pinney went to elementary school with and was lifelong friends with Bernard Herrmann who scored Citizen Kane, Psycho, and Taxi Driver. He was lifelong friends with Abraham Polonsky. He was also friends with writer Ivan T. Sanderson. Pinney moved into Sanderson's apartment in the Whitby on 45th Street in Manhattan's Hell's Kitchen around the time of Sanderson's death. He was also good friends with billionaire Arthur Jones of Nautilus, Inc. exercise equipment fame.  Pinney studied anthropology at Columbia University under Franz Boas. In 1927 Roy competed in a Boy Scout essay contest to accompany Martin and Osa Johnson on one of their wild-life movie-making trips to Africa, but didn't make it. Years later, after Martin Johnson was killed in a plane crash, Osa and Roy became lifelong friends. In 1929 Roy traveled on an expedition to British Guiana with Somerset Maugham. Pinney was friends with the American photographer and model Bunny Yeager. In the book Bunny's Honeys Bunny mentions Pinney in her story of the origin of the phrase \"the world's prettiest photographer\" that is used to describe her. He was also friends with artist William Ward Beecher and with artist Ugo Mochi who designed his letterhead. Pinney was an early patron of George Nakashima, commissioning 18 pieces of furniture starting in 1947. He was also friends with Jim Fowler and Marlin Perkins of Wild Kingdom fame and filmed many of the episodes. Finally, Pinney was friends with John Steinbeck when Steinbeck lived in New York."]}, {"page": "Vile vortex", "response": ["#Redirect Ivan T. Sanderson#Vile vortices"]}, {"page": "The Vile Vortices", "response": ["#REDIRECT Ivan T. Sanderson"]}, {"page": "Vile vortices", "response": ["#REDIRECT Ivan T. Sanderson "]}]}}