{"wiki_id": "http://www.wikidata.org/entity/Q167877", "itemLabel": "Michael Jackson", "itemDescription": "English writer and journalist", "wikipedia_url": "https://en.wikipedia.org/wiki/Michael_Jackson_(writer)", "wikipedia_page": {"main": "Michael James Jackson (27 March 1942 – 30 August 2007) was an English writer and journalist. He was the author of many influential books about beer and whisky. He was a regular contributor to a number of British broadsheets, particularly The Independent and The Observer.Jackson's books have sold over three million copies worldwide and have been translated into eighteen languages. He is credited with helping to start a renaissance of interest in beer and breweries worldwide in the 1970s, particularly in the United States. He is also widely credited with popularising the idea of beer styles. His influential television series The Beer Hunter was shown in fifteen countries.He was as well-versed in malt whisky as he was in beer, and his book Michael Jackson's Malt Whisky Companion (1989) is the best-selling book on the subject in the world.At the time of his death Jackson had been suffering from Parkinson's disease for at least a decade. He did not declare his illness until his symptoms caused some to think he was drunk.", "link_mentions": [{"page": "August 30", "response": ["*2007 – Michael Jackson, English author and journalist (b. 1942)"]}, {"page": "Beer", "response": ["The basic ingredients of beer are water; a starch source, such as malted barley, or malted maize (such as used in the preparation of Tiswin and Tesgüino), able to be saccharified (converted to sugars) then fermented (converted into ethanol and carbon dioxide); a brewer's yeast to produce the fermentation; and a flavouring such as hops.Alabev.com  The Ingredients of Beer. Retrieved 29 September 2008. A mixture of starch sources may be used, with a secondary carbohydrate source, such as maize (corn), rice, wheat, or sugar, often being termed an adjunct, especially when used alongside malted barley.beer-brewing.com Beer-brewing.com  Ted Goldammer, The Brewers Handbook, Chapter 6 – Beer Adjuncts, Apex Pub (1 January 2000), . Retrieved 29 September 2008 Less widely used starch sources include millet, sorghum and cassava root in Africa, and potato in Brazil, and agave in Mexico, among others.BeerHunter.com Michael Jackson, A good beer is a thorny problem down Mexico way, What's Brewing, 1 October 1997. Retrieved 29 September 2008. The amount of each starch source in a beer recipe is collectively called the grain bill.", "English writer Michael Jackson, in his 1977 book The World Guide To Beer, categorised beers from around the world in local style groups suggested by local customs and names. Fred Eckhardt furthered Jackson's work in The Essentials of Beer Style in 1989.", "Lager is cool fermented beer. Pale lagers are the most commonly consumed beers in the world. Many are of the “pilsner” type. The name \"lager\" comes from the German \"lagern\" for \"to store\", as brewers around Bavaria stored beer in cool cellars and caves during the warm summer months. These brewers noticed that the beers continued to ferment, and to also clear of sediment, when stored in cool conditions.Beerhunter.com Michael Jackson, BeerHunter, \"The birth of lager\", 1 March 1996. Retrieved 16 September 2008.", "In terms of sales volume, most of today's beer is based on the pale lager brewed in 1842 in the town of Pilsen in the present-day Czech Republic.BeerHunter Michael Jackson, \"A Czech-style classic from Belgium\", Beer Hunter Online (7 September 1999). Retrieved 20 September 2008. The modern pale lager is light in colour with a noticeable carbonation (fizzy bubbles) and a typical alcohol by volume content of around 5%. The Pilsner Urquell, Bitburger, and Heineken brands of beer are typical examples of pale lager, as are the American brands Budweiser, Coors, and Miller.", "Beer writer Michael Jackson proposed a five-level scale for serving temperatures: well chilled () for \"light\" beers (pale lagers); chilled () for Berliner Weisse and other wheat beers; lightly chilled () for all dark lagers, altbier and German wheat beers; cellar temperature () for regular British ale, stout and most Belgian specialities; and room temperature () for strong dark ales (especially trappist beer) and barley wine.Michael Jackson, Michael Jackson's Beer Companion, Courage Books; 2 edition (27 February 2000), ", "In many societies, beer is the most popular alcoholic drink. Various social traditions and activities are associated with beer drinking, such as playing cards, darts, or other pub games; attending beer festivals; engaging in zythology (the study of beer); visiting a series of pubs in one evening; visiting breweries; beer-oriented tourism; or rating beer.Leslie Dunkling & Michael Jackson, The Guinness Drinking Companion, Lyons Press (2003),  Drinking games, such as beer pong, are also popular.Best Drinking Game Book Ever, Carlton Books (28 October 2002),  A relatively new profession is that of the beer sommelier, who informs restaurant patrons about beers and food pairings.", "* The World Guide to Beer, Michael Jackson. ", "* The New World Guide to Beer, Michael Jackson. "]}, {"page": "March 27", "response": ["*1942 – Michael Jackson, English journalist and author (d. 2007)"]}, {"page": "Stout", "response": ["Beer writer Michael Jackson wrote about stouts and porters in the 1970s, but in the mid 1980s a survey by What’s Brewing found just 29 brewers in the UK and Channel Islands still making stout, most of them milk stouts. In the 21st century, stout is making a comeback with a new generation of drinkers, thanks to new products from burgeoning craft and regional brewers.", "Many breweries were still brewing oatmeal stouts in the 1950s, for example Brickwoods in Portsmouth, Matthew Brown in Blackburn and Ushers in Trowbridge.Whitbread Gravity Book, Whitbread Archive in the London Metropolitan Archives When Michael Jackson mentioned the defunct Eldrige Pope \"Oat Malt Stout\" in his 1977 book The World Guide to Beer, oatmeal stout was no longer being made anywhere, but Charles Finkel, founder of Merchant du Vin, was curious enough to commission Samuel Smith to produce a version. Samuel Smith's Oatmeal Stout then became the template for other breweries' versions."]}, {"page": "Barley wine", "response": ["Barley wine is a strong ale between 6–12% alcohol by volume.\"Barley wine\", Michael Jackson", "The beer writer Michael Jackson referred to a barley wine by Smithwick's thus: \"This is very distinctive, with an earthy hoppiness, a wineyness, lots of fruit and toffee flavours.\" He also noted that its original gravity is 1.062."]}, {"page": "Wetherby", "response": ["* Beer and whisky expert Michael Jackson (1942–2007) was born in Wetherby."]}, {"page": "Pale ale", "response": ["Amber ale is an emerging term used in Australia, France (as ambrée), Belgium and the Netherlands and North America for pale ales brewed with a proportion of amber malt and sometimes crystal malt to produce an amber colour generally ranging from light copper to light brown.James Squire Amber Ale - Michael Jackson 1 October 2001: \"The designation Amber Ale is to be taken seriously\". A small amount of crystal or other coloured malt is added to the basic pale ale base to produce a slightly darker colour, as in some Irish and British pale ales. In France the term \"ambrée\" is used to signify a beer, either cold or warm fermented, which is amber in colour; the beer, as in Pelforth ambrée and Fischer amber, may be a Vienna lager, or it may be a bière de garde as in Jenlain ambrée. In North America, American-variety hops are used in varying degrees of bitterness, although very few examples are particularly hoppy. Diacetyl is barely perceived or is absent in an amber ale.", "American pale ale (APA) was developed around 1980. The brewery thought to be the first to successfully use significant quantities of American hops in the style of an APA and use the name \"pale ale\" was the Sierra Nevada Brewing Company, which brewed the first experimental batch of Sierra Nevada Pale Ale in November 1980, distributing the finished version in March 1981. Anchor Liberty Ale, a 6% abv ale originally brewed by the Anchor Brewing Company as a special in 1975 to commemorate Paul Revere's midnight ride in 1775, which marked the start of the American War of Independence, was seen by Michael Jackson, a writer on beverages, as the first modern American ale. Fritz Maytag, the owner of Anchor, visited British breweries in London, Yorkshire and Burton upon Trent, picking up information about robust pale ales, which he applied when he made his American version, using just malt rather than the malt and sugar combination common in brewing at that time, and making prominent use of the American hop, Cascade. By 1983, it was commonly found. Other pioneers of a hoppy American pale ale are Jack McAuliffe of the New Albion Brewing Company and Bert Grant of Yakima Brewing.", "\"Scotch ale\" or \"whisky ale\" is a designation used by brewers in France for peat-smoked malt flavoured beers.The Prague Post Online  This style is distinct from the Scotch ales,  having a translucent amber, rather than opaque brown, appearance, and a smoky rather than sweet taste. Even though the malt used by brewers in Scotland is not generally or traditionally dried by peat burning, some Scottish whisky distilleries have used low nitrogen barley dried by peat burning. The distinctive flavour of these smoked malts is reminiscent of whisky, and some peat smoke flavour is added during malting by an additional process. The most popular French example is Fischer's Adelscott.Michael Jackson's Beer Companion, Michael Jackson, page 236, Running Press, 19 June 1997  The brewer Douglas Ross of the Bridge of Allan brewery made the first Scottish whisky ale for the Tullibardine Distillery in 2006; the beer is made with unpeated malt and aged in whisky barrels that had not contained a peated malt whisky so has a vanilla and nutty profile.", "*Great Beer Guide: 500 Classic Brews, Michael Jackson, "]}, {"page": "Celis White", "response": ["Celis, at the age of 67, founded a microbrewery in Austin in 1992. At a Brickskeller tasting, Celis, who spoke English haltingly, remarked that he chose Texas because its inhabitants speak with a slow drawl, making them easier to understand. Celis White received a perfect four-star rating from the British beer writer Michael Jackson in his Pocket Guide to Beer. .  Celis Brewery made several other varieties of beer in addition to the celebrated White, including Dubbel, Grand Cru, Pale Bock, Pale Rider and Raspberry. at Wayback Machine These types have been carried on by Michigan Brewing Company."]}, {"page": "Single malt Scotch", "response": ["*Jackson, Michael (1999). Michael Jackson's Complete Guide to Single Malt Scotch. 4th ed. Philadelphia, PA: Running Press Book Publishers. "]}, {"page": "Michael Jackson (disambiguation)", "response": ["Michael Jackson (1958–2009) was an American singer, songwriter and dancer known as the \"King of Pop\".", "Michael Jackson, Mike Jackson, or Mick Jackson may also refer to: ", "* Michael Jackson (radio commentator) (1934–2022), American radio talk show host, KABC and KGIL, Los Angeles", "* Michael Jackson (writer) (1942–2007), Beer Hunter show host, beer and whisky expert", "* Michael Jackson (television executive) (born 1958), British television executive", "* Michael Jackson (actor) (born 1970), Canadian actor", "* Michael Jackson (English singer) (born 1964), British singer with the heavy metal band Satan/Pariah", "* Oh No (musician) or Michael Jackson (born 1978), American rapper", "* Michael Jackson (American soldier) (1734–1801), soldier from Massachusetts, wounded at Bunker Hill", "* Salman Raduyev or Michael Jackson (1967–2002), Chechen warlord", "* Michael Jackson (linebacker) (born 1957), American NFL linebacker (1979–1986)", "* Michael Jackson (footballer, born 1963), Brazilian association footballer", "* Michael Jackson (basketball) (born 1964), American NBA pro basketball player, Sacramento Kings (1987–1990)", "* Michael Jackson (wide receiver) (1969–2017), American politician and NFL wide receiver", "* Michael Jackson (rugby league) (born 1969), rugby league footballer for Great Britain, Wakefield Trinity, Halifax", "* Michael Jackson (footballer, born 1980), English footballer", "* Michael Jackson (anthropologist) (born 1940), New Zealand, professor of social anthropology and writer", "* Michael Jackson (murderer) (born 1954), American convicted murderer", "* Michael Jackson (bishop) (born 1956), Church of Ireland Archbishop of Dublin, Ireland, since 2011", "* Michael Jackson (journalist), Niuean journalist and former politician", "* Michael Jackson, American criminal with Tiffany Cole", "* \"Michael Jackson\", a song by Cash Cash from The Beat Goes On", "* \"Michael Jackson\", a song by Das Racist from Relax", "* \"Michael Jackson\", a song by Fatboy Slim, B-side of \"Going Out of My Head\"", "* \"Michael Jackson\", a song by The Mitchell Brothers", "* \"Michael Jackson\", a song by Negativland from Escape from Noise"]}, {"page": "Boston Beer Company", "response": ["Since 1990, the company has produced a seasonal fruit beer labeled \"Cranberry Lambic\". \"Lambic\" describes a spontaneously fermented beer generally produced in Brussels or the nearby Pajottenland region, and the Samuel Adams product is not spontaneously fermented, consumers and brewers charged that \"Cranberry Lambic\" was mislabeled and could cause consumer confusion. Michael Jackson, a leading beer critic, called it \"a misleading name\". Grant Wood, Senior Brewing Manager at Boston Beer, defended the name, saying, \"I wouldn't consider it mislabeling. Whenever I have served the Cranberry Lambic, I have always been really up front about it. Is it a true lambic made in that region in Belgium? No. Does it taste like one? Yes. So it's sort of our homage to the style without the pain and agony of it.\""]}, {"page": "Single malt whisky", "response": ["* Jackson, Michael (1999). Michael Jackson's Complete Guide to Single Malt Scotch. 4th ed. Philadelphia, PA: Running Press Book Publishers. "]}, {"page": "Craft brewery and microbrewery", "response": ["The trend toward larger brewing companies started to change during the 1970s, when the popularity of the Campaign for Real Ale (CAMRA)'s campaign for traditional brewing methods, and the success of Michael Jackson's World Guide to Beer encouraged brewers in the UK, such as Peter Austin, to form their own small breweries or brewpubs. In 1979, a chain of UK brewpubs, known as the \"Firkin\" pubs, started, running to over one hundred at the chain's peak; however, the chain was sold and eventually its pubs ceased brewing their own beer."]}, {"page": "Trappist beer", "response": ["The idea of visiting Trappist monasteries to sample their beers has become more popular in recent years, partly due to promotion by enthusiasts such as the 'beer hunter' Michael Jackson. Some brewing monasteries maintain a visitors' center where their beers can be tasted and bought (sometimes with other monastic products such as bread and cheese). Visits to the monastery itself are usually not available to the general public, although visitors can overnight in some of the monasteries (like Achel) if their purpose is non-touristic. Currently, Koningshoeven (which brews La Trappe) in Netherlands offers regular tours around their bottling plant, old brewery and parts of their site, along with a beer tasting."]}, {"page": "Beer Hunter", "response": ["#REDIRECT Michael Jackson (writer)"]}, {"page": "Sierra Nevada Brewing Company", "response": ["Sierra Nevada's Porter, along with its heavier Stout version, have been described by writer Michael Jackson as \"gently coffeish\" and \"beautifully roasty\" examples of their respective styles. The two offerings have been brewed since the company's first year of operation."]}, {"page": "Berliner Weisse", "response": ["Most beer authorities trace the origins of Berliner Weisse to an unknown beer being produced in Hamburg which was copied and developed by the 16th century brewer Cord Broihan.The world guide to beer, Michael Jackson, Mitchell Beazley, 1977, page 56 - \"Berliner Weisse\",  Broihan's beer, Halberstädter Broihan, became very popular, and a version was being brewed in Berlin by the Berlin doctor J.S. Elsholz in the 1640s.", " with flavoured syrups,The World Guide to Beer, Michael Jackson, Mitchell Beazley,  such as raspberry (Himbeersirup), or artificial woodruff flavouring (Waldmeistersirup). The beer may also be mixed with other drinks, such as pale lager, in order to balance the sourness.", "*The World Guide to Beer, Michael Jackson, Mitchell Beazley, 1977, page 56 - \"Berlner Weisse\", "]}, {"page": "Beerhunter", "response": ["#REDIRECT Michael Jackson (writer)"]}, {"page": "Orval Brewery", "response": ["Beer critic Michael Jackson considered Orval to be \"a wonderful aperitif\", and a \"world classic\". Its very distinctive taste is largely attributed to two parts of the brewing process. One of these is the use of dry hopping, in which large meshed bags of hops infuse the beer during the three-week maturation period. The other is the use of Brettanomyces yeast during this same maturation, which are a local wild yeast. Hallertau, Styrian Goldings and French Strisselspalt hops are used.Villa, K., \"Orval Brewery\" in Oliver, G. (ed.), The Oxford Companion to Beer (Oxford University Press, 2012), pp. 630–631."]}, {"page": "Dogfish Head Brewery", "response": ["In March 2000, Calagione attended a special dinner for beer writer Michael Jackson. At this time McGovern and Calagione met and discussed recreating the brew. In early 2001 the new beverage was served at a dinner recreating the funeral feast of King Midas. At $150 a plate the meal was a benefit to support the Chemical Archaeology program at University of Pennsylvania."]}, {"page": "Beer in Belgium", "response": ["Beer in Belgium varies from pale lager to amber ales, lambic beers, Flemish red ales, sour brown ales, strong ales and stouts. In 2018, there were approximately 304 active breweries in Belgium,Brewers of Europe including international companies, such as AB InBev, and traditional breweries including Trappist monasteries. On average, Belgians drink 68 liters of beer each year,Brewers of Europe down from around 200 each year in 1900. Most beers are bought or served in bottles, rather than cans, and almost every beer has its own branded, sometimes uniquely shaped, glass.Michael Jackson's Great Beers of Belgium, Michael Jackson,  In 2016, UNESCO inscribed Belgian beer culture on their list of the intangible cultural heritage of humanity.Decision of the Intergovernmental Committee: 11.COM 10.B.5, UNESCO, Intangible Cultural Heritage, accessed 15 June 2017, quote: \"Beer culture in Belgium combines know-how concerning nature, social practices and craft skills that constitute an integral part of daily and festive life. Regularly shared between practitioners, knowledge and skills are transmitted from masters to apprentices in breweries but also within families, in public spaces and through formal education. Beer culture in Belgium contributes to the economic and social viability at local level and the constitution of the social identity and continuity of its bearers and practitioners, who promote responsible production and consumption.\"", " The style of Westmalle's Tripel and the name was widely copied by the breweries of Belgium,The Great Beers of Belgium, Michael Jackson, MMC, 1997, page 226 then the term spread to the US and other countries.Belgian Ale, Pierre Rajotte, Brewers publications, 1992, pages 31–34 Gulden Draak was awarded the best-tasting beer in the world in 1998 by the American Tasting Institute (now ChefsBest). Van Steenberge Brewery – Gulden Draak", "Beer writers who have written extensively on Belgian beer include Belgians Peter Crombeq, Gert van Lierde and Erik Verdonck, and Britons Michael Jackson and Tim Webb.", "*Great Beers of Belgium, Michael Jackson, "]}, {"page": "Beer in England", "response": ["English drinkers became more interested in imported beers during the 1970s and 1980s, partly as a result of increased foreign travel and partly because of promotion of the subject by beer writers such as Michael Jackson, with his 1977 The World Guide to Beer. Newly popular foreign brands included Beck's from Germany, Heineken and Grolsch from the Netherlands, Leffe and Hoegaarden from Belgium, Peroni from Italy, San Miguel from the Philippines, Budweiser and Sierra Nevada from the US and Corona Extra from Mexico. A number of bars specialise in imported beer, with food and decor to match, Belgian and Bavarian themes being the most common.", "Although its founding father, Michael Jackson, died in 2007, modern beer writing was burgeoning, with beer columns appearing alongside wine columns in the quality press. Beer writing was to evolve into beer blogging, leaders in both fields including Martyn Cornell, Pete Brown, Roger Protz and Melissa Cole.", "Breweries may state whether or not a sparkler is preferred when serving their beers. Generally, breweries in northern England serve their beers with a sparkler attached and breweries in the south without.North-South beer divide is all in the head, Michael Jackson, Independent, 15 December 1992"]}, {"page": "Summit Brewing Company", "response": ["The brewery was founded in 1986 by local homebrewer Mark Stutrud and a group of his friends in an old auto parts warehouse on St. Paul's University Avenue. The company grew as the beers become popular locally. In 1987, the Great Northern Porter won a gold medal at the Great American Beer Festival and was featured on the cover of Michael Jackson's New World Guide to Beer (1988). By 1998 the company's beer production had exceeded the capacity of the original University Avenue brewery, and a new brewery, designed by architect Peter O'Brien, was built on the west end of St. Paul, overlooking the Mississippi River. Still in operation, it was the first new brewery built from the ground up in St. Paul since before Prohibition. Having outgrown its original brewing equipment, Summit sold its 1938-vintage brew house to Mt. Shasta Brewing Company in Northern California. They then purchased an all-copper, authentic German brew house built in 1971 from the Hürnerbräu Brewery in Ansbach Germany."]}, {"page": "Brakspear Brewery", "response": ["W.H. Brakspear & Sons Ltd. is a brewer in Henley-on-Thames, Oxfordshire. Since the closure of its original brewery in Henley-on-Thames in 2002, most of its beers have been brewed by Wychwood Brewery in West Oxfordshire. In 1993, beer writer Michael Jackson described its \"ordinary\" bitter as the best in England.", "When beer writer Michael Jackson visited in 1993, the barley was Maris Otter and water came from their own well, described as \"chalk-hard\".  Hops were Goldings from Kent, Hereford Fuggles and \"Styrians\". Jackson thought the ordinary bitter the best in England, writing \"In its delicate, malty sweetness, teasing, yeasty fruitiness, and hoppy bitterness, Brakspear's 'ordinary' is lightly refreshing, gently sociable, more-ish and appetite-arousing; the perfect combination in a bitter. The hoppiness is its salient feature\". John Mortimer in 1986 claimed \"Brakspear's draft bitter is undoubtedly the best to be had in England\". (The contemporary Brakspear draft bitter shares the same name but differs otherwise.)"]}, {"page": "Thisted Bryghus", "response": ["Thisted Brewery (Danish: Thisted Bryghus) is a regional brewery in Thisted in the north of Denmark founded in 1902.Beerinspector.com. THISTED BRYGHUS SINCE 1902. The brewery supplies the local market with pilsner beer, and has gained recognition internationally for beers like Porse Guld (spiced with bog myrtle) and Limfjords Porter, a Baltic porter.Culinary-heritage.com. A/S Thisted Bryghus.Michael Jackson's Beer Hunter. Celebrating small breweries in monopolistic Denmark.", "Twentieth century beer writer Michael Jackson wrote of Thisted's Limfjords Porter:"]}, {"page": "Dortmunder Export", "response": ["Michael Jackson and Roger Protz continued the trend, although with a certain faint heart, uneasy at pinning down exactly the distinctive nature of the beer.", "*Michael Jackson, The World Guide to Beer, 1977, pp68–69, Ballantine Books, "]}, {"page": "Lindemans Brewery", "response": ["* 1985: Michael Jackson named Kriek Lindemans as one of the 5 best beers in the world."]}, {"page": "Beer style", "response": ["The modern concept of beer styles is largely based on the work of writer Michael Jackson in his 1977 book The World Guide To Beer.Michael Jackson's Beer Hunter - How to save a beer style In 1989, Fred Eckhardt furthered Jackson's work publishing The Essentials of Beer Style. Although the systematic study of beer styles is a modern phenomenon, the practice of distinguishing between different varieties of beer is ancient, dating to at least 2000 BC.", "However, despite an awareness by commentators, law-makers, and brewers that there were different styles of beer, it was not until Michael Jackson's World Guide To Beer was published in 1977 that there was an attempt to group together and compare beers from around the world. Jackson's book had a particular influence in North America where the writer Fred Eckhardt was also starting to explore the nature of beer styles. The wine importing company Merchant du Vin switched to importing beers mentioned in Jackson's book. Small brewers started up, producing copies and interpretations of the beer styles Jackson described.", "* Michael Jackson's Beer Styles Index"]}, {"page": "Old Speckled Hen", "response": ["In January 1993, Old Speckled Hen was featured as beer reviewer Michael Jackson's \"Beer of the Month\" in his regular column for The Independent. The relaunch was thought to be behind an 8.9% interim profits rise for Morland in June 1997."]}, {"page": "Saison", "response": ["In the late 1980s, American importer Don Feinberg was urged by beer writer Michael Jackson to import Brasserie Dupont's saison to the United States. It was Feinberg who re-styled saison as a 'farmhouse ale': 'People asked: is it a wheat beer? Is it a lambic? I told them it was a hoppy farmhouse ale.' ", "* A seasonal search for the phantom of brewing, Michael Jackson, BeerHunter.com"]}]}}