{"wiki_id": "http://www.wikidata.org/entity/Q16727297", "itemLabel": "Jason Ainsley", "itemDescription": "English footballer (born 1970)", "wikipedia_url": "https://en.wikipedia.org/wiki/Jason_Ainsley", "wikipedia_page": {"main": "Jason Ainsley (born 30 July 1970) is an English football manager and former player.", "link_mentions": [{"page": "Balestier Khalsa FC", "response": ["| style=\"text-align:left;\"|  Jason Ainsley"]}, {"page": "Tommy Miller", "response": ["After acting as caretaker manager following the departure of Jason Ainsley, Miller was announced as the permanent manager of National League North side Spennymoor Town. Miller was sacked on 5 December 2021 after just seven months in charge, the club sitting 13th in the table. "]}, {"page": "Jurong FC", "response": ["In 1999, Jurong FC star player, V Sundramoorthy, was appointed the coach of Jurong FC. He became the first ever player-coach  in the S.League history. Jurong finished in sixth position in the 12-team league. That year also saw Jurong FC coming closest to a trophy since their entry into the S.League, as they reached the final of the Singapore Cup. The club's captain, Jason Ainsley, was the top scorer for Jurong FC with 19 goals; he was the third top scorer overall for that season. Jurong FC's main sponsor WSA Lines then ended their sponsorship as well. Dalis Supait was recalled back to the national team after a superb performance that season."]}, {"page": "Index of Singapore-related articles", "response": ["* Jason Ainsley"]}, {"page": "Spennymoor Town F.C.", "response": ["In June 2006, a management team of Jamie Pollock and Moors favourite Jason Ainsley was put in place. Together they put together a strong squad of players. After a slow start, consisting of 6 away games out of the first seven, and a high number of draws, the squad went from strength to strength. They went unbeaten in the league from November, until 7 April 2007, where they travelled to Penrith. Backed by a travelling support of over 150 fans, if they won and Seaham lost, they would be champions. At half time, the news came through that Seaham were losing 3–1. Spennymoor's place was booked as champions when Tom Jones netted an 87th-minute winner.", "During the summer of 2007, then Manager Jamie Pollock left the club, stating \"he wanted to concentrate on getting his coaching badges and pursue his career at a higher level\" and moors favourite Jason Ainsley was swiftly given the position of first team manager. Yet another crisis hit the club during this summer when the council evicted the club from its home of 103 years. However, after a lot of good work by individuals of the football club, in particular the Chairman, Vice Chairman and Secretary Jonathan Le Poidevin, a new 25-year lease was agreed on 25 September 2007, securing the future of the club.", "| Jason Ainsley", "| Jason Ainsley"]}, {"page": "Mortimer Community College", "response": ["*Jason Ainsley - Spennymoor manager"]}, {"page": "Lewis Hawkins", "response": ["Hawkins joined Spennymoor Town on 6 February 2015 on a one-month loan, but was recalled by Hartlepool manager Ronnie Moore after three matches, with Spennymoor boss Jason Ainsley saying: \"He has been brilliant in his spell for us, even though he only played three games. He gave us an extra dimension\". Hawkins rejoined Spennymoor on 20 October on a three-month loan."]}, {"page": "2018–19 National League", "response": ["|Jason Ainsley", "|Jason Ainsley"]}, {"page": "2020–21 National League", "response": ["|Jason Ainsley"]}]}}