{"wiki_id": "http://www.wikidata.org/entity/Q16730047", "itemLabel": "Indiana", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Indiana_(singer)", "wikipedia_page": {"main": "Lauren Henson, better known by her stage name Indiana, is a British singer-songwriter from Loughborough. Her 2015 debut album, No Romeo, includes the UK top 20 single \"Solo Dancing\" (2014).", "link_mentions": [{"page": "Nottingham", "response": ["Nottingham also has a selection of smaller venues, including the Albert Hall (800-capacity), Ye Olde Salutation Inn, Malt Cross, Rescue Rooms, the Bodega, the Old Angel, the Central, the Chameleon and the Corner. 1960s Blues-rock band Ten Years After formed in Nottingham, as did the 1970s pop act Paper Lace and the critically acclaimed Tindersticks, as well as influential folk singer Anne Briggs. Since the beginning of the 2010s, the city has produced a number of artists to gain media attention, including; Jake Bugg, London Grammar, Indiana, Sleaford Mods, Natalie Duncan, Ady Suleiman, Dog Is Dead, Saint Raymond, Childhood, Rue Royale, Spotlight Kid and Amber Run."]}, {"page": "Simon Berry", "response": ["On 15 June 2002, his track \"Madagascar\" reached number one on the UK Dance Singles Chart. His work has charted in United Kingdom eight times as Art of Trance and the first time with \"Vicious Circles\" under the alias Poltergeist in 1996. Berry has remixed a number of tracks for other electronic musicians, including Quietman, Moogwai, Indiana, Matt Darey, Steve Jablonsky and Anthony Pappa.  A remix of Yello's \"Vicious Games\" from the 1985 Stella album, charted in 1999.  In 2003, he re-recorded a new version of Jan Johnston's \"Calling your name\" that charted at #80. His tracks appear on mixed compilations such as Tranceport 2, Global Underground 017: London, Upfront Trance, Magik Three: Far from Earth, Oakenfold Anthems, Beyond Euphoria, Ibiza Euphoria and Classic Euphoria."]}, {"page": "V Festival", "response": ["* Indiana"]}, {"page": "Wireless Festival", "response": ["Indiana"]}, {"page": "BBC Radio 1's Big Weekend", "response": ["| IndianaLittle Shoes Big VoiceRHODESShy NatureLeon ElseMDNGHTRoyal BloodBaby StrangeJuceRosie LoweAlgernon Doll"]}, {"page": "List of Live Lounge cover versions", "response": ["|Indiana ||\"Ready for Your Love\" by Gorgon City feat. MNEK\"Waves\" by Mr Probz ||16 April 201425 September 2014"]}, {"page": "Tim Cappello", "response": ["In 2018, Tim was featured, along with singer Indiana, on the British Synthwave band GUNSHIP's single \"Dark All Day\" from the album of the same name. The album rose to number 1 in the Electronic charts in the US, UK and Canada."]}, {"page": "Indiana (disambiguation)", "response": ["Indiana is a state in the United States of America.", "Indiana may also refer to:", "*Indiana Territory, a former territory in the United States from 1803 to 1813 encompassing the present-day state of Indiana and surrounding areas", "*Indiana County, Pennsylvania, United States", "*Indiana, Pennsylvania, a borough in Indiana County, Pennsylvania, United States, that is also its county seat", "*Indiana Township, Allegheny County, Pennsylvania, a township in Allegheny County, Pennsylvania, United States", "*Indiana, São Paulo, in Brazil", "*Indiana, Ontario, Canada", "*Indiana District, Maynas, Peru", "*Indiana University, a multi-campus public university system in Indiana, comprising the following:", "***Indiana University Bloomington", "***Indiana University East", "***Indiana University Kokomo", "***Indiana University Northwest", "***Indiana University South Bend", "***Indiana University Southeast", "***Indiana University – Purdue University Columbus (administered by IU)", "***Indiana University – Purdue University Fort Wayne (administered by Purdue)", "***Indiana University – Purdue University Indianapolis (administered by IU)", "*Indiana Hoosiers, the athletic program of Indiana University Bloomington ", "*Indiana University Press, the publishing house of Indiana University", "*Indiana State University", "*Indiana State Sycamores, the athletic program of Indiana State University", "*Indiana University of Pennsylvania", "*Indiana Area School District", "*Indiana Evans (born 1990), an Australian Home and Away actress", "*Indiana (singer) (born 1987), English electronica singer-songwriter", "*Indiana Massara (born 2002), Australian actress, singer, and Internet personality", "*Indiana Woodward, French ballet dancer", "*Robert Indiana (1928–2018), an American artist", "*List of ships named after Indiana", "*Indiana station (CTA), a station on the Chicago Transit Authority's 'L' system", "*Indiana station (Los Angeles Metro), an at-grade light rail station in the Los Angeles County Metro Rail system", "*Indiana (Jon McLaughlin album), ", "*Indiana (David Mead album), 2004", "*\"Indiana\" (song), a 2015 song by Sarsa", "*\"Back Home Again in Indiana\" or \"(Back Home Again in) Indiana\", written by James F. Hanley", "*\"Indiana\", a 2013 song by Tom Aspaul", "*\"Indiana\", a song by Spanish rock band Hombres G", "*Indiana Jones (character), a fictional archaeologist", "*Indiana (genus), a genus of bradoriid", "*Indiana (statue), a public artwork by Retta T. Matthews", "*Indiana (novel), an 1831 novel by George Sand", "*Project Indiana, OpenSolaris project", "*1602 Indiana, an asteroid", "* Indiana (horse)"]}, {"page": "List of people from Nottingham", "response": ["*(Born 1987) Indiana, singer whose single Solo Dancing charted at No. 14 on 27 April 2014, moved to Nottingham to live with her partner."]}, {"page": "Bad luck", "response": ["* \"Bad Luck\", a song by Indiana, 2017"]}, {"page": "List of Sony Music artists", "response": ["*Indiana"]}, {"page": "Fred Falke", "response": ["|Indiana"]}, {"page": "Y Not Festival", "response": ["*Indiana", "*Indiana"]}, {"page": "Steve Fitzmaurice", "response": ["| Indiana"]}, {"page": "Splendour in Nottingham", "response": ["*Main Stage: The Specials, James, Lawson, IndianaNB, Roots Manuva, Amber Run, To Kill a King and NUSIC's Future Sound of Nottingham Winner 2015, Suspect Alibi (with special guest Josh Wheatley)", "Jess Glynne was set to play the Main Stage. However, due to her vocal cord surgery in 2015, she was forced to pull out just weeks before the festival and was replaced by Indiana.", "*Main Stage: Jake Bugg, Squeeze, KT Tunstall, Dog Is Dead, Nina Nesbitt, Jack Savoretti, Indiana and NUSIC's Future Sound of Nottingham Winner 2013, The Gorgeous Chans ", "*Leftlion Courtyard Stage: Josh Keogh, Opie Dieno, Indiana, Saint Raymond, Rob Green, Nina Smith, Ryan Keen, Miss 600, Natalie Duncan"]}, {"page": "Solo Dancing", "response": ["\"Solo Dancing\" is a song by British singer-songwriter Indiana. The song was released in the United Kingdom on 18 April 2014 as a digital download from her debut studio album No Romeo (2015). The song peaked at number 14 on the UK Singles Chart and number 85 on the Irish Singles Chart.", "A music video to accompany the release of \"Solo Dancing\" was first released onto YouTube on 17 February 2014 at a total length of three minutes and thirty-four seconds. As of October 2016, the music video has over 2 million views on Youtube, making it her most viewed video.Indiana - Solo Dancing (Official Video) - YouTube", "Category:Indiana (singer) songs"]}, {"page": "No Romeo", "response": ["No Romeo is the debut studio album by English singer Lauren Henson, known professionally as Indiana. It was originally scheduled to be released on 1 September 2014, but has been subject to several pushbacks and was eventually released on 16 January 2015. The album spawned six singles: \"Bound\", \"Smoking Gun\", \"Mess Around\", \"Solo Dancing\" and \"Heart on Fire\". No Romeo was produced mainly by Henson's writing partner, John Beck."]}, {"page": "Heart on Fire (Indiana song)", "response": ["\"Heart on Fire\" is a song by British singer and songwriter Indiana. The song was released in the United Kingdom on 24 August 2014 as a digital download from her debut studio album No Romeo (2015). The song has peaked at number 89 on the UK Singles Chart.", "A music video to accompany the release of \"Heart on Fire\" was first released onto YouTube on 7 July 2014 at a total length of four minutes and nine seconds.Indiana - Heart on Fire - YouTube", "Category:Indiana (singer) songs"]}, {"page": "T in the Park 2015", "response": [" Indiana"]}, {"page": "Etherwood", "response": ["| Indiana"]}, {"page": "Steve Chrisanthou", "response": ["Chrisanthou has gone on to produce and co-write with many artists such as Dragonette - Chrisanthou wrote the 2007 single \"Take It Like A Man\" from the album Galore (Dragonette album), Michael Bolton - Chrisanthou co-produced many of the tracks on the 2009 album One World One Love), Will Young, Paloma Faith, Lianne La Havas, a rare co-write with Ashford & Simpson and Bobby McFerrin. Chrisanthou has also worked with artists such as Jenniffer Kae, Greta's Bakery, Simon Webbe, Terri Walker and Indiana (singer) - Chrisanthou co-wrote her 2014 UK Top 40 song \"Solo Dancing\" and Eliza Doolittle - Chrisanthou co-wrote and produced the 2011 release Mr Medicine."]}, {"page": "Gunship (band)", "response": ["*Indiana", "* Collaborated with Tim Cappello and Indiana for the single \"Dark All Day\" (2018), which features on their album of the same name."]}]}}