{"wiki_id": "http://www.wikidata.org/entity/Q16749769", "itemLabel": "Roy Rich", "itemDescription": "British broadcaster", "wikipedia_url": "https://en.wikipedia.org/wiki/Roy_Rich", "wikipedia_page": {"main": "Roy Rich (16 September 1911 – 24 March 1970) was a British broadcaster and film and theatre director.", "link_mentions": [{"page": "Round the Horne", "response": ["A second series was commissioned, and ran for thirteen weeks, from Sunday 13 March to 5 June 1966. The programme was recorded in front of a studio audience, and Williams would play up to them with physical humour, causing hilarity in the studio. Simmonds spoke to the cast, telling them that the radio audience were hearing unexplained laughter, and to try to keep the visual pranks to a minimum. At the end of the series Roy Rich, the head of BBC Light Entertainments for radio, spoke to Took, Feldman, Horne and Williams and discussed possible changes to the programme, including the removal of the Fraser Hayes Four, and the possible changing of Pertwee and Marsden. No changes were made before the next series was commissioned."]}, {"page": "Jean Anouilh", "response": ["* Thieves' Carnival. Arts Theatre, London: 2 January 1952. Directed by Roy Rich. With John Laurie, Harold Lang, Robin Bailey, Maxine Audley."]}, {"page": "Lord's Taverners", "response": ["* Roy Rich (1963–1964)"]}, {"page": "Brenda Bruce", "response": ["She was married and widowed twice, first to television personality Roy Rich, with whom she had two daughters, and second to actor Clement McCallin, with whom she adopted a son. McCallin died in 1977."]}, {"page": "Nigel Green", "response": ["Subsequent West End appearances included Come Live With Me (directed by Roy Rich: Vaudeville Theatre, June 1951),Frances Stephens, Theatre World Annual (London) # 3 (Rockliff 1952), page 20 Heloise (directed by Michael Powell: Duke of York's Theatre, November 1951),Frances Stephens, Theatre World Annual (London) # 3 (Rockliff 1952), page 21 Vernon Sylvaine's As Long as They're Happy, opposite Jack Buchanan (directed by Roy Rich: Garrick Theatre, July 1953),Frances Stephens, Theatre World Annual (London) # 5 (Rockliff 1954), page 38 Félicien Marceau's The Egg (directed by Charles Frank: Saville Theatre, October 1957))Frances Stephens, Theatre World Annual (London) # 9 (Rockliff 1958), page 66 and Agatha Christie's Go Back for Murder (directed by Hubert Gregg: Duchess Theatre, March 1960).Frances Stephens, Theatre World Annual (London) # 11 (Barrie & Rockliff 1960), page 23"]}, {"page": "Housewives' Choice", "response": ["The show had a different presenter − often referred to at the time as a compere − every week who was a BBC staff announcer, contracted broadcaster, actor, comedian, singer or musician. Amongst the more than 250, mostly male, presenters were a number who made repeated appearances including Bryan Michie, Roy Rich, Godfrey Winn, Robert McDermott, Richard Murdoch, Gary Miller, Kenneth Horne, Sam Costa, Desmond Carrington and David Jacobs. One of the most popular was George Elrick, who sang his own lyrics over the theme music, beginning with \"Dooodle-dum-de-doodle-dum\" and ending with \"I'll be with you all again tomorrow morning\"."]}, {"page": "Harold Lang (actor)", "response": ["(1952) He acted in Jean Anouilh's play, \"Thieves' Carnival\", at the Arts Theatre Club in London, England with John Laurie, Robin Bailey, Wyndham Goldie, Judith Furse, Maxine Audley, David Bird, Gerald Harper and Tutte Lemkow in the cast. Roy Rich was the director. John Hotchkis was the musical director."]}]}}