{"wiki_id": "http://www.wikidata.org/entity/Q16731757", "itemLabel": "Alan MacDonald", "itemDescription": "production designer (c. 1956 - 2017)", "wikipedia_url": "https://en.wikipedia.org/wiki/Alan_MacDonald_(production_designer)", "wikipedia_page": {"main": "Alan MacDonald  (c. 1956 – 30 August 2017) was a British production designer. He was best known for his work on The Queen (2006), which earned him nominations for the Art Directors Guild Award for Excellence in Production Design for a Contemporary Film and Best Technical Achievement at the British Independent Film Awards, and for the Rajasthan-set The Best Exotic Marigold Hotel (2012) which earned him a nomination for the Art Directors Guild Award for Excellence in Production Design for a Contemporary Film.In 2013, he designed the sets for the Academy Award-nominated film Philomena. He had also been a production designer for a number of advertisements for global firms including Coca-Cola, Levi's, Microsoft, Mercedes-Benz and Volkswagen, and was the theatrical designer for Kylie Minogue's 2002 \"KylieFever2002\" tour.", "link_mentions": [{"page": "Alan McDonald", "response": ["Alan McDonald, Alan MacDonald, Allan McDonald, Allan MacDonald, Allen McDonald or Allen MacDonald may refer to:", "* Alan MacDonald (writer) (born 1958), English children's writer", "* Alan MacDonald (rugby union) (born 1985), Scottish rugby union player", "* Alsy MacDonald (Alan MacDonald, born 1961), Australian rock musician and lawyer", "* Alan MacDonald (production designer) (c. 1956–2017), British production designer"]}, {"page": "Money Can't Buy", "response": ["Money Can't Buy was a one-off, 75-minute concert show held on 15 November 2003 at Carling Apollo in London to promote Australian singer Kylie Minogue's ninth studio album Body Language. Its title alludes to the fact that tickets were not for sale and limited to invited guests and competition winners. The total cost of staging the concert was £1 million. William Baker and Alan MacDonald served as creative and art directors, respectively, while Michael Rooney and Steve Anderson worked on the choreography and musical arrangements.", "For the show, Minogue collaborated with creative director William Baker and art director Alan MacDonald. Baker and MacDonald had previously worked with the singer on her KylieFever2002 tour. The musical arrangements were handled by Steve Anderson, while the dance routines were choreographed by Michael Rooney. Display hardware manufacturer Barco was hired to provide 100 square metres large LED displays, which were set up on the stage behind Minogue. They were used to show animations and high resolution graphics. Minogue wore five different costumes during the 75-minute-long show. Fashion houses like Balenciaga, Chanel, and Helmut Lang designed these costumes. Minogue was backed by 12 dancers and a full-piece band. The seating capacity of the show was restricted to 4000 spectators and the entire staging of the show cost £1 million."]}, {"page": "The Queen (2006 film)", "response": ["The sets were designed by Alan MacDonald, which won him Best Art Direction in a Contemporary Film from the Art Directors Guild and Best Technical Achievement at the British Independent Film Awards.", "* Nominated: Best Technical Achievement—Alan MacDonald (production design)"]}, {"page": "Art Directors Guild Award for Excellence in Production Design for a Contemporary Film", "response": ["| The Queen || Alan MacDonald", "| The Best Exotic Marigold Hotel || Alan MacDonald"]}, {"page": "The Best Exotic Marigold Hotel", "response": ["Principal photography began on 10 October 2010 in India. Most of the filming took place in the Indian state of Rajasthan, including the cities of Jaipur and Udaipur. In Jaipur, filming took place around the City Palace, the Marigold market, and on crowded buses. Other scenes were shot in Kishangarh, and on the outskirts of Jaipur, footage was shot at Kanota Fort, which stood in for the Viceroy Club. The place where Sonny and Sunaina meet in the film was shot nearby at the stepwell Panna Meena ka Kund near Amer Fort, a 10th-century establishment noted for its \"ten stories of pale golden stone steps.\" Ravla Khempur was chosen as the site for the Best Exotic Marigold Hotel; it is an equestrian hotel that was originally the palace of a tribal chieftain, located about an hour and a half outside of Udaipur in the village of Khempur. Madden considered the building to have a magical quality and unmistakable charm, remarking that it had \"something special that could ultimately draw the characters in. It had these wonderful cool dark interiors, with glimpses of saturated light and the teeming life outside its walls.\" Production designer Alan MacDonald, who won Best Art Direction in a Contemporary Film from the Art Directors Guild for his work, was brought in to embellish the interiors, intentionally making it clash with \"interesting furniture inspired by colonial India, mismatched local textiles, all mixed together with modern plastic bits and pieces, with everything distressed and weather beaten.\" Footage was also shot at the Lake Palace Hotel at Lake Pichola.", "| Alan MacDonald"]}, {"page": "2017 in film", "response": ["| style=\"text-align:center;\"| 30 || Alan MacDonald || style=\"text-align:center;\"| 61 || style=\"text-align:center;\"| English || style=\"text-align:center;\"| Production Designer || "]}, {"page": "Art Directors Guild Awards 2012", "response": ["** Alan MacDonald – The Best Exotic Marigold Hotel"]}, {"page": "2017 in the United Kingdom", "response": ["**Alan MacDonald, 61, production designer (The Queen, The Best Exotic Marigold Hotel, Philomena)."]}, {"page": "Deaths in August 2017", "response": ["*Alan MacDonald, 61, British production designer (The Queen, The Best Exotic Marigold Hotel, Philomena).Film designer took his life days after feeling 'distressed' by £20,000 health bill"]}, {"page": "71st British Academy Film Awards", "response": ["*Alan MacDonald"]}, {"page": "List of British films of 2017", "response": ["| style=\"text-align:center;\"| 30 || Alan MacDonald || style=\"text-align:center;\"| 61 || style=\"text-align:center;\"| Welsh || style=\"text-align:center;\"| Production designer || "]}, {"page": "Nightingale Hospital (Marylebone)", "response": ["*Alan MacDonald, 61, killed himself in August 2017 four days after being discharged from the hospital. He spent two weeks as an in-patient at the hospital at a cost of £20,000. This included charges of £750 a day by the private clinic AddCounsel which had referred him to the hospial for daily visits by a counsellor on top of the hospital fees."]}]}}