{"wiki_id": "http://www.wikidata.org/entity/Q16734973", "itemLabel": "Jessica Ransom", "itemDescription": "British actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Jessica_Ransom", "wikipedia_page": {"main": "Jessica Ransom (born 1 December 1982) is a British actress and writer, best known for her role as medical receptionist Morwenna Newcross in the ITV drama Doc Martin (2011–). She won a Children's BAFTA Award in 2015.\n\n", "link_mentions": [{"page": "John William Polidori", "response": ["* In the episode of CBBC children's television show Horrible Histories entitled Staggering Storytellers, Polidori was portrayed by Jalaal Hartley in the sketch about the original of his story, The Vampyre and Mary Shelley's (portrayed by Jessica Ransom) story Frankenstein while at Lord Byron's Villa Diodati in Switzerland."]}, {"page": "Brontë family", "response": ["* In the episode of CBBC children's television show Horrible Histories entitled \"Staggering Storytellers\", Charlotte (Jessica Ransom), Emily (Gemma Whelan), Anne (Natalie Walter) and Branwell (Thom Tuck) try to get their work published, forgetting all about the Brontë brother."]}, {"page": "Doc Martin", "response": ["Dr Martin Ellingham (Martin Clunes), a brilliant and successful vascular surgeon at Imperial College London, develops haemophobia – a fear of blood, forcing him to stop practising surgery. He obtains a post as the sole general practitioner (GP) in the sleepy Cornish village of Portwenn, where he had spent childhood holidays with his Aunt Joan (Stephanie Cole) and Uncle Phil, who owns a local farm. Upon arriving in Portwenn – where, to his frustration, the locals address him as \"Doc Martin\" – he finds the surgery in chaos and inherits an incompetent receptionist, Elaine Denham (Lucy Punch). In series 2–4, she is replaced by Pauline Lamb (Katherine Parkinson), a new receptionist, and later also a phlebotomist. In Series 5, Morwenna Newcross (Jessica Ransom) takes up the post.", "* Jessica Ransom as Morwenna Newcross (Series 5– ) – surgery receptionist"]}, {"page": "Joanna Page", "response": ["From May 2011, Page provided the voice of the lead character in the first season of Nick Jr. UK's pre-school animation, Poppy Cat and is later replaced by Jessica Ransom from BBC's Doc Martin. In 2012, Page played Leanne Powell in the BBC One drama series The Syndicate, Helen Pearson in the Sky Living comedy Gates, and Mrs Peterson in Nativity 2: Danger in the Manger. In November 2013, Page starred as Queen Elizabeth I in \"The Day of the Doctor\", the 50th Anniversary episode of Doctor Who."]}, {"page": "High Storrs School", "response": ["* Jessica Ransom, actress"]}, {"page": "Cultural depictions of Queen Victoria", "response": ["*Sarah Hadland, Martha Howe-Douglas, Ellie White, Jessica Ransom in the British children's sketchshow Horrible Histories (2009——)"]}, {"page": "Cultural depictions of Marie Antoinette", "response": ["*Alice Lowe and Jessica Ransom played Marie Antoinette in the CBBC's Horrible Histories."]}, {"page": "Cultural depictions of Mary, Queen of Scots", "response": ["* In the CBBC sketch show Horrible Histories (2009–2015), Mary is portrayed by Martha Howe-Douglas and Jessica Ransom."]}, {"page": "Poppy Cat", "response": ["A British-American animated TV series based on the Poppy Cat books and comprising 52 episodes running 11 minutes, was created by Mallory Lewis and produced by Coolabi Productions UK, Cake Entertainment, Ingenious Media and BAFTA award-winning King Rollo Films. Poppy Cat herself is voiced in the UK by Joanna Page from BBC's award-winning series Gavin & Stacey (later replaced by Jessica Ransom from Doc Martin) and in the US by Cake Charles. The series was scored by composer Oliver Davis."]}, {"page": "Posh (play)", "response": ["| Rachel || Fiona Button  || Jessica Ransom || Charlotte Brimble "]}, {"page": "Film Fandango", "response": ["* Episode 5 - Jessica Ransom on In Time & Bugsy Malone"]}, {"page": "List of Horrible Histories (2009 TV series) episodes", "response": ["In 2015, the series returned with a new cast in a revised format. Episodes centred around the life of one prominent historical figure played by an established comedy actor. It was in 2016 that a seventh series began with just three specials before the full series in 2017. The three specials marked anniversaries through the year: 400 years since Shakespeare died, the BBCs 'Love to Read' campaign and 350 years since the Great Fire of London. There was a slight change in cast where the main stars Jalaal Hartley, Tom Stourton and Jessica Ransom continued with new members. This was the first series where none of the main original cast were present."]}, {"page": "Straight (play)", "response": ["The play was directed by Richard Wilson and featured the actors Philip McGinley, Henry Pettigrew, Jenny Rainsford and Jessica Ransom. It received strong reviews from the critics.Guardian reviewTelegraph review"]}, {"page": "Horrible Histories (2009 TV series)", "response": ["!scope=\"row\"| Jessica Ransom", "In 2015, the series returned with a new cast in a revised format. Episodes centred around the life of one prominent historical figure played by an established comedy actor. It was in 2016 that a seventh series began with just three specials before the full series in 2017. The three specials marked anniversaries through the year: 400 years since Shakespeare died, the BBCs 'Love to Read' campaign and 350 years since the Great Fire of London. There was a slight change in cast where the main stars Jalaal Hartley, Tom Stourton and Jessica Ransom continued with new members. This was the first series where none of the main original cast were present."]}, {"page": "Horrible Histories (2015 TV series)", "response": ["In February 2015, the new series debuted with an episode drawing on the events leading up to the signing of Magna Carta, timed to coincide with the BBC's larger commemoration of the document's 800-year anniversary before being followed by a run of fourteen episodes. 2016 saw the broadcast of three specials to mark certain events throughout that year: 400 years since Shakespeare died, the BBC's \"Love to Read\" campaign, and 350 years since the Great Fire of London. There was a slight change in cast where the main stars Jalaal Hartley, Tom Stourton and Jessica Ransom continued with some of the supporting cast, while a number of the sixth series cast, including the two original members Jim Howick and Simon Farnaby were absent.", "!scope=\"row\"| Jessica Ransom (Series 6 – present)", "*Jessica Ransom (Series 6 – present)", "|  Jessica Ransom as Mary, Queen of Scots"]}, {"page": "Zapped (TV series)", "response": ["* Jessica Ransom as Jess, a real world office worker."]}, {"page": "Poppy Cat (TV series)", "response": ["*Poppy Cat is the main protagonist in the series. She is the leader of the group. She is a feisty, imaginative, cheerful and happy-go-lucky young orange ginger tabby kitten with a big white face and long whiskers and she wears a magic multi-colored neckerchief that takes her and her stuffed animal friends on extraordinary adventures by any type of vehicle they need that matches her neckerchief. She's an adventurer, a heroine, an imagineer, a dreamer, and a devoted best friend to her stuffed animal friends. Poppy's heroic gusto and unquenchable curiosity propel each adventure for her and her friends, often leading to unexpected experiences and discoveries. She is highly conscious of those around her and will go to the ends of the Earth to solve a problem. Poppy likes adventure, but her top priority is always her friends, which is why she is the unspoken leader of her little gang. She's the glue that holds them all together. On her birthday adventure, she wears a pink hat and serves as the Birthday Captain. Her catchphrases are \"Would you like to come along?\", \"Would you like to play?\", \"Hoop-dee-doo!\", \"Hooray!\", \"That's a great idea!\", \"Come on, everybody!\", \"Okey-doke, we're off!\" and \"But first, we're going to need...(type of vehicles)!\" Voiced in the UK by Joanna Page in the first season, Jessica Ransom in the second season, and in the US by Haley \"Cake\" Charles."]}, {"page": "Jess Ransom", "response": ["#REDIRECTJessica Ransom"]}]}}