{"wiki_id": "http://www.wikidata.org/entity/Q1679969", "itemLabel": "James Aubrey", "itemDescription": "English stage and screen actor", "wikipedia_url": "https://en.wikipedia.org/wiki/James_Aubrey_(actor)", "wikipedia_page": {"main": "James Aubrey Tregidgo (28 August 1947 – 6 April 2010), known professionally as James Aubrey, was an English stage and screen actor. He trained for the stage at the Drama Centre London, some years after making his professional acting debut in a production of Isle of Children (1962) and his screen acting debut in the film adaptation of Lord of the Flies (1963). He later performed with the Royal Shakespeare Company.", "link_mentions": [{"page": "Klagenfurt", "response": ["* James Aubrey (1947 in Klagenfurt – 2010) famous British actor"]}, {"page": "2001 in film", "response": ["| Spy Game || Universal Pictures / Beacon Pictures || Tony Scott (director); Michael Frost Beckner, David Arata (screenplay); Robert Redford, Brad Pitt, Catherine McCormack, Stephen Dillane, Larry Bryggman, Marianne Jean-Baptiste, Ken Leung, David Hemmings, Michael Paul Chan, Garrick Hagon, Todd Boyce, Matthew Marsh, Andrew Grainger, Shane Rimmer, Ho Yi, Benedict Wong, Adrian Pang, Omid Djalili, Dale Dye, Charlotte Rampling, Matthew Walker, James Aubrey, Colin Stinton, Amidou, Andrea Osvart || Thriller || Live action"]}, {"page": "1983 in film", "response": ["| The Hunger || MGM/UA Entertainment Co. || Tony Scott (director); Ivan Davis, Michael Thomas (screenplay); Catherine Deneuve, David Bowie, Susan Sarandon, Cliff De Young, Dan Hedaya, Beth Ehlers, Rufus Collins, Willem Dafoe, John Pankow, John Stephen Hill, Ann Magnuson, James Aubrey, Bauhaus, Bessie Love || Horror || Live action"]}, {"page": "1980 in film", "response": ["| The Great Rock 'n' Roll Swindle || Virgin Films || Julien Temple (director/screenplay); Malcolm McLaren, Steve Jones, Paul Cook, Sid Vicious, Johnny Rotten, Ronnie Biggs, Mary Millington, Irene Handl, Liz Fraser, Jess Conrad, Helen of Troy, Tenpole Tudor, James Aubrey, Johnny Shannon, Judy Croll, Peter Dean, Dave Dee, Alan Jones || Mockumentary || Live action "]}, {"page": "Spy Game", "response": ["* James Aubrey as CIA Agent Mitch Alford"]}, {"page": "The Great Rock 'n' Roll Swindle", "response": ["*James Aubrey – B.J."]}, {"page": "Loot (play)", "response": ["Albert Finney directed a production at the Royal Court Theatre as part of its Joe Orton Festival. This production opened on 3 June 1975. Arthur O'Sullivan played McLeavy, Jill Bennett played Fay, David Troughton played Hal, James Aubrey played Dennis, Philip Stone played Truscott, and Michael O'Hagan played Meadows. It was designed by Douglas Heap, with costumes by Harriet Geddes."]}, {"page": "The Hunger (1983 film)", "response": ["Willem Dafoe and John Pankow have brief appearances as two youths harassing Sarah at a phone booth. John Stephen Hill and Ann Magnuson play a wild young couple whom Miriam and John pick up at a nightclub to consume at the start of the film. James Aubrey plays a man whom Miriam brings to Sarah as her potential first victim. English gothic rock band Bauhaus appear during the film's opening credits as a group performing at the nightclub, where they play their single \"Bela Lugosi's Dead.\" Silent film star Bessie Love makes her final film appearance as an elderly fan at Sarah's book signing."]}, {"page": "The Valley of Fear", "response": ["* A 1986 BBC Radio 4 adaptation starring Tim Pigott-Smith as Holmes and Andrew Hilton as Watson, with James Aubrey as Douglas and Edward de Souza as White Mason. Roy Apps adapted the story."]}, {"page": "Return of the Saint", "response": ["| 1–23 || 4 March 1979 || \"Appointment in Florence\" || Stuart Wilson, James Aubrey"]}, {"page": "Play of the Month", "response": ["|Charlotte Rampling,Robin Askwith,Victor Spinetti,James Aubrey,Leonie Mellinger"]}, {"page": "Bouquet of Barbed Wire", "response": ["| Gavin Sorenson || James Aubrey || Tom Riley", "Prue Sorensen (Susan Penhaligon) is a university student who, after becoming pregnant, marries American actor Gavin (James Aubrey). Her father, Peter Manson (Frank Finlay), is a publisher who appears to have an unhealthy relationship with his daughter and becomes distressed over her pregnancy and marriage. The pregnancy creates tension between Peter and Gavin, which Prue exploits for her own amusement. It is implied that Prue has engineered the marriage and pregnancy to provoke her father."]}, {"page": "Castaway", "response": ["|James Aubrey, Tom Chapin and Hugh Edwards"]}, {"page": "Rockliffe (TV series)", "response": ["* James Aubrey as DI Derek Hoskins"]}, {"page": "The Cleopatras", "response": ["| Grypus || James Aubrey"]}, {"page": "The Men's Room", "response": ["The Men's Room is a British television drama mini-series that was produced by the BBC and originally aired on BBC2 from 25 September to 23 October 1991. The series, which comprises five 50-minute episodes, was adapted by Laura Lamson from Ann Oakley's 1989 novel of the same name, and stars Bill Nighy, Harriet Walter, Amanda Redman, Charlotte Cornwell and James Aubrey.", "* James Aubrey as Steve Kirkwood"]}, {"page": "Lord of the Flies (1963 film)", "response": ["* James Aubrey as Ralph", "The 60 hours of film from the 1961 shoot was edited down to 4 hours, according to editor Gerald Feil. This was further edited to a 100-minute feature that was shown at the 1963 Cannes Film Festival (9 to 22 May), but the cuts necessitated that new audio transitions and some dialog changes be dubbed into the film more than a year after shooting. The voice of James Aubrey, who played Ralph, had dropped three octaves and was electronically manipulated to better approximate his earlier voice, but it is still significantly different. Tom Chapin, who played Jack, had lost his English accent and another boy's voice was used to dub his parts. The U.S. distributor insisted the film be further edited to 90 minutes, so one fire scene and scenes developing the character of Ralph were cut."]}, {"page": "Lord of the Flies (1990 film)", "response": ["The child members cast were relatively inexperienced. Balthazar Getty (Ralph) and James Badge Dale (Simon) were the only child actors who went on to have successful acting careers, as with James Aubrey, who played Ralph in the film version of 1963."]}, {"page": "List of Dalziel and Pascoe cast members", "response": ["*James Aubrey"]}, {"page": "List of adventure films of the 1960s", "response": ["|Lord of the Flies||Peter Brook||James Aubrey, Tom Chapin, Hugh Edwards||United Kingdom||Adventure drama"]}, {"page": "List of British films of 1963", "response": ["|Lord of the Flies||Peter Brook ||James Aubrey, Tom Chapin ||Drama ||"]}, {"page": "List of British films of 1978", "response": ["|Home Before Midnight||Pete Walker||James Aubrey, Alison Elliott, Richard Todd||Drama||"]}, {"page": "List of former Emmerdale characters", "response": ["|Rev. Bill Jeffries || James Aubrey || 1982"]}, {"page": "James Aubrey (Actor)", "response": ["#REDIRECT James Aubrey (actor) "]}, {"page": "A Stab in the Dark (play)", "response": ["Helmut Kinderland \t   James Aubrey"]}, {"page": "Sheila Allen (English actress)", "response": ["In Bouquet of Barbed Wire (1976), based on a novel by Andrea Newman and described by Philip Purser as a \"kinky saga which was much discussed ... well made and acted\",Halliwell's Television Companion, 3rd ed 1986 Allen's character was the wife of Peter Manson (Frank Finlay), who had an unhealthy obsession about his married daughter, Prue (Susan Penhaligon). Among many sexual entanglements, Cassie had an affair with Gavin Sorenson (James Aubrey), her own son-in-law. She also portrayed the Matron Mary Taylor in the television series Shroud for a Nightingale (1984), based on the P.D. James novel. "]}, {"page": "Magnificence (play)", "response": ["* Constable - James Aubrey"]}, {"page": "2010 in film", "response": ["| style=\"text-align:center;\"| 8 || James Aubrey || style=\"text-align:center;\"| 62 || style=\"text-align:center;\"| Latvia || style=\"text-align:center;\"| Actor || "]}, {"page": "Wolmer's Schools", "response": ["* James Aubrey (actor)-Austrian born English actor"]}, {"page": "Forever Young (1983 film)", "response": ["Jimmy (James Aubrey) and Michael (Nicholas Gecks) were best friends at school in the 1960s. They played guitar and sang together and dreamed of becoming the next Lennon and McCartney or Simon and Garfunkel. Their partnership ended when Michael decided to become a priest. Jimmy eventually became a university lecturer of English literature. The two meet again twenty years later when Jimmy sees posters advertising one of Michael's regular fundraising concerts in his church hall. At first, the two are delighted to see each other, but they gradually remember the events that drove them apart."]}, {"page": "List of actors in Royal Shakespeare Company productions", "response": ["*James Aubrey"]}, {"page": "Bloody Poetry", "response": ["Percy Bysshe Shelley – Valentine PelkaMary Shelley – Fiona ShawClaire Clairmont – Jane GurnettGeorge Byron – James AubreyDr William Polidori – William GaminaraHarriet Westbrook – Sue Burton"]}, {"page": "2010 in the United Kingdom", "response": ["**James Aubrey, actor (b. 1947, Austria)"]}, {"page": "Deaths in April 2010", "response": ["*James Aubrey, 62, British actor (Lord of the Flies, Bouquet of Barbed Wire), pancreatitis."]}, {"page": "The Rift (1990 film)", "response": ["* James Aubrey as Contek 1"]}, {"page": "List of Minder episodes", "response": ["|colspan=\"3\"|Guest stars: Derek Jacobi as Freddie Fenton, June Ritchie as Jo Williams, George Layton as Des, James Aubrey as Graham Hurst, Tony Steedman as Ralph Hurst, Christopher Biggins as Harold, Keith Alexander as Andy."]}, {"page": "Buddy's Song (film)", "response": ["| James Aubrey || Adrian"]}, {"page": "James T. Aubrey", "response": ["Allegations of favoritism in purchasing programs were made against Aubrey. His friend Keefe Brasselle, who had minor film roles in the 1940s and 1950s, and met Aubrey when they both worked at KNXT, had no experience as a producer. \"A 1965 edition of George Raft,\" said David Susskind, as there were also rumors Brasselle had ties to the Mafia. Nevertheless, Aubrey scheduled three shows from Brasselle's Richelieu Productions for the 1964–65 season, without pilot episodes. The shows were The Baileys of Balboa, a sitcom with Paul Ford; the newspaper drama The Reporter; and The Cara Williams Show, a sitcom starring Williams. Brasselle would personally supervise The Reporter, shot in New York City. Costs skyrocketed on Brasselle's shows; after nine episodes, The Reporter was $450,000 over-budget, and ran only for three months. Baileys ran until April 1965, and Cara Williams finished after one season; all three shows were commercial failures. When Aubrey was later asked why he aired three untested programs, he responded with \"arrogance, I guess\".Folkart, Burt A. \"James Aubrey Jr., Former Head of CBS and MGM, Dies.\"  Los Angeles Times. September 11, 1994. 1."]}, {"page": "Home Before Midnight", "response": ["Home Before Midnight is a 1979 British sexploitation drama film directed by Pete Walker, written by Murray Smith, and starring James Aubrey, Alison Elliott and Richard Todd. It is set in London and follows Mike Beresford, a 28-year-old songwriter who is charged with statutory rape after having sex with a 14 year old girl.", "* James Aubrey - Mike Beresford"]}]}}