{"wiki_id": "http://www.wikidata.org/entity/Q16749875", "itemLabel": "Patrick Synge", "itemDescription": "horticulturist (1910-1982)", "wikipedia_url": "https://en.wikipedia.org/wiki/Patrick_Synge", "wikipedia_page": {"main": "Patrick Millington Synge VMH (17 September 1910 - 1982) was a British botanist, writer and plant hunter.", "link_mentions": [{"page": "William T. Stearn", "response": ["After his return to London in 1946, at the end of the Second World War, a number of major publications ensued, including Lilies of the World in 1950. The RHS also imposed two major tasks on their librarian. In 1950, Frederick Chittenden, a previous director of RHS Wisley and Keeper of the Library, died leaving unfinished the four volume RHS Dictionary of Gardening that the society had commissioned from him before the war. The war had interrupted the work as many of the expected contributors were unavailable. Stearn, together with Patrick Synge, the RHS Publications Editor, undertook to complete the work, particularly volume IV (R–Z), a task he completed within six months, with 50 new articles. The finished work was published in 1951 and not only did he undertake the role of editing this large work but his contributions covered 50 genera, 600 species and complex identification keys such as Solidago and Viola. Since Stearn's entries in volume IV extended from Soldanella to Zygotritonia, he would jest that he was but \"a peculiar authority on plants from 'So-' onwards\". He issued a revised version in 1956 with Synge in which he added a further 86 articles. His recollection of this task was that he acquired \"that occupational hazard of compilers of encyclopaedias\", encyclopedic knowledge."]}, {"page": "Victoria Medal of Honour", "response": ["** Patrick Synge (1910–1982)"]}, {"page": "Synge (surname)", "response": ["* Patrick Synge (1910–1982), British botanist, writer and plant hunter"]}, {"page": "Veitch Memorial Medal", "response": ["* 1957 : Charles Henry Curtis (1870-1958); Patrick Synge (1884-1967); Harold Hillier (1905–1985)"]}, {"page": "Sir Colville Barclay, 14th Baronet", "response": ["Aside from his art and business interests, Barclay was a keen botanist, his work focusing initially on the island of Crete. He contributed a chapter to the 1980 guide Flowers of Greece and the Balkans and subsequently published his own work Crete: Checklist of the Vascular Plants in 1986. He collected many plants in the course of his research and as a result was asked by Desmond Meikle to procure samples for the Royal Botanic Gardens, Kew, initially in Turkey but later from many countries around the globe including Nepal with Patrick Synge.In Search of Flowers. Published by Michael Joseph, Patrick Millington Synge (1973) Barclay was also an advocate of homeopathic medicine and spent forty years on the board of the Royal Homeopathic Hospital in London."]}, {"page": "P.M. Synge", "response": ["#REDIRECT Patrick Synge"]}, {"page": "Patrick Millington Synge", "response": ["#REDIRECT Patrick Synge"]}, {"page": "John Paul Wellington Furse", "response": ["His first post-retirement expedition with his wife, Polly was to north eastern Turkey and Iran in 1960, they found specimens of Cyclamen elegans.Christopher Grey-Wilson  They drove from England in a Land Rover packed full of equipment to explore the mountain passes, that had hardly been seen before. They went with a party of explorers including Patrick Synge, the then editor of 'Journal of the Royal Horticultural Society'. The party travelled over 6,000 miles in 2 months exploring.Royal Horticultural Society  This first trip resulted in just over 900 collections of plants. Including the yellow crown imperial, Fritillaria raddeana Regel (from the Kopet Dagh on the borders of Turkmenia or Iran), Iris afghanica Wendelbo (from the Salang Pass, north of Kabul), and also from the Black Sea coast, Iris lazica Albov.", "In 1964, they carried out a botanical expedition in conjunction again with the Royal Horticultural Society botanist Patrick Synge, to Afghanistan, they got as far as the Hindu Kush and the Wakhan Corridor. They then returned to Afghanistan in 1966. They found more specimens of Iris afghanica and then realised it was a new species. Both of their 1964 and 1966 expeditions had resulted in the collection of nearly 4,200 specimens.", "Patrick Synge expeditions, including those to Turkey with Paul Furse and also to Nepal with Colville Barclay were documented in his 1973 book, In Search of Flowers.Best of British Magazine, Jan. 2014, p. 31"]}]}}