{"wiki_id": "http://www.wikidata.org/entity/Q1670013", "itemLabel": "Raymond FitzGerald", "itemDescription": "Cambro-Norman commander during the Norman invasion of Ireland", "wikipedia_url": "https://en.wikipedia.org/wiki/Raymond_FitzGerald", "wikipedia_page": {"main": "Raymond (or Redmond) FitzGerald (died 1185–1198), nicknamed Le Gros (\"the Large\"), was a Cambro-Norman commander during the Norman invasion of Ireland. Raymond was among the first of a small band of Norman knights who landed on the South coast of Ireland before being reinforced by a larger force led by Richard de Clare, 2nd Earl of Pembroke. He was active consolidating Norman rule over Ireland before he retired to his estates in Waterford where he died in the late 12th century.", "link_mentions": [{"page": "Gerald of Wales", "response": ["Gerald became a royal clerk and chaplain to King Henry II of England in 1184, first acting mediator between the crown and Prince Rhys ap Gruffydd. He was chosen to accompany one of the king's sons, John, in 1185 on John's first expedition to Ireland. This was the catalyst for his literary career; his work Topographia Hibernica (first circulated in manuscript in 1188, and revised at least four more times) is an account of his journey to Ireland; Gerald always referred to it as his Topography, though \"History\" is the more accurate term.O'Meara 14. He followed it up, shortly afterward, with an account of Henry's conquest of Ireland, the Expugnatio Hibernica. Both works were revised and added to several times before his death, and display a notable degree of Latin learning, as well as a great deal of prejudice against a foreign people. Gerald was proud to be related to some of the Norman invaders of Ireland, such as his maternal uncle Robert FitzStephen and Raymond FitzGerald, and his influential account, which portrays the Irish as barbaric savages, gives important insight into Anglo-Norman views of Ireland and the history of the invasion."]}, {"page": "County Carlow", "response": ["The arrival of the Normans was followed by the widespread construction of stone castles and tower houses throughout Ireland. These structures did not entirely supplant the earlier forms of fortification, as evidenced by Castlemore Moat, which is an example of a much later Motte-and-bailey. It was built by Raymond FitzGerald in the 12th century following his conquest of O'Nolan lands in the Barony of Forth. "]}, {"page": "Trim Castle", "response": ["De Lacy left Ireland entrusting the castle to Hugh Tyrrel, baron of Castleknock, one of his chief lieutenants. The ringwork was attacked and burnt by forces of the Gaelic High King of Ireland, Ruaidrí Ua Conchobair; Tyrrel, having appealed in vain for help, was forced to flee. Ua Conchobair soon withdrew and De Lacy, or Raymond FitzGerald, immediately repaired or rebuilt the castle in 1173. After Hugh's death in 1186 his son Walter de Lacy succeeded as Lord of Meath.Butler, Some Notices, pp. 14-17. He continued rebuilding and the castle was completed in the 1220's, most likely in 1224. The year when construction was completed was considered to be 1220 by historians in the 19th century but that is now in dispute.ME01634 MANORLAND (1ST DIVISION) TRIM CASTLE"]}, {"page": "Richard de Clare, 2nd Earl of Pembroke", "response": ["Mac Murchada and Richard de Clare raised a large army, which included Welsh archers and arranged for Raymond FitzGerald (also known as Raymond le Gros) to lead it. The force took the Ostman towns of Wexford, Waterford, and DublinThese were longphorts where the Viking raiders settled, marrying Gaelic women and slightly acculturating to Gaelic customs (such as naming practices, MacGiollamhuire, MacTurkill, etc.), Dublin being the most famous. See: James F. Lydon, The Making of Ireland: From Ancient Times to Present (London; New York: Routledge, 1998), p. 21. in rapid succession between 1169 and 1170.Orpen 1911, p. 184 Richard de Clare, however, was not with the first invading party and arrived later, in August 1170.John Davies, A History of Wales (London: Penguin Group, 1993), p. 126", "Henry crossed over to Ireland in October 1172 and stayed in Ireland six months. He put his own men into nearly all the important places, Richard keeping only Kildare. In 1173 Richard went in person to France to help Henry II during the rebellion by his sons, being reinstated in Leinster as a reward. In 1174 he advanced into Connaught and was severely defeated, but subsequently Raymond FitzGerald re-established his supremacy in Leinster."]}, {"page": "Nest ferch Rhys", "response": ["William FitzGerald, Lord of Carew and Emlyn (died c. 1173). William's children included Raymond FitzGerald le Gros."]}, {"page": "Gilbert de Clare, 1st Earl of Pembroke", "response": ["* Basilia, who married (1) Raymond FitzGerald (Raymond le Gros) and (2) Geoffrey FitzRobert.George Edward Cokayne, The Complete Peerage; or, A History of the House of Lords and All its Members from the Earliest Times, Vol. X, Eds. H. A. Doubleday, Geoffrey H. White, & Howard de Walden (London: The St. Catherine Press, Ltd., 1945), Appendix H, p. 100"]}, {"page": "Robert FitzStephen", "response": ["The second son of his half-sister Angharad de Windsor, Philip de Barry came to Ireland in 1183 or 1185 to assist his half-uncle. Together with another relative, Raymond FitzGerald (also known as Raymond Le Gros), they recovered their lands in the modern county of Cork, specifically the baronies of Killede, Olethan and Muscarydonegan. A compromise agreement was reached that allowed the barons to hold seven cantreds near Cork with the remaining twenty-four being retained by the native princes."]}, {"page": "History of Ireland (1169–1536)", "response": ["Henry was happily acknowledged by most of the Irish Kings,Annals of Tigernach [see para 1171.12 https://celt.ucc.ie//published/T100002A/index.html] who perhaps saw in him a chance to curb the expansion of both Leinster and the Hiberno-Normans. It is unclear if they saw him as a new and soon-to-be-absent high king, or understood the obligations of feudalism. This led to the ratification of the Treaty of Windsor (1175) between Henry and Ruaidhrí. However, with both Diarmaid and Strongbow dead (in 1171 and 1176), Henry back in England and Ruaidhrí unable to curb his nominal vassals, within two years it was not worth the vellum it was inscribed upon. John de Courcy invaded and gained much of east Ulster in 1177, Raymond FitzGerald (also known as Raymond le Gros) had already captured Limerick and much of north Munster, while the other Norman families such as Prendergast, fitz Stephen, fitz Gerald, fitz Henry, de Ridelsford, de Cogan, and le Poer were actively carving out virtual kingdoms for themselves."]}, {"page": "Osraige", "response": ["Much of the background drama and initial action of the Norman advance played out on the battlefields and highways of Osraige. The kingdoms of Osraige and Leinster had also witnessed increased mutual hostility prior to the Normans. Significantly, Diarmaid Mac Murchadha, the man who would one day become king of Leinster and invite the Normans into Ireland, was himself fostered as a youth in north Osraige, in the territory of the Ua Caellaighes of Dairmag Ua nDuach who sought to undermine their Mac Giolla Phádraig overlords. In the 1150s, high king Muirchertach Mac Lochlainn made a devastating punitive campaign on the divided Osraige, burning and pillaging the whole kingdom and subjected it to Leinster overlordship. Thus, Diarmaid Mac Murchadha came to intervene several times in the disputes of Ossorian succession. After Mac Murchadha's exile and return in 1167, tension was heightened between Osraige and Leinster by the blinding of Mac Murchadha's son and heir, Éanna mac Diarmat by the prince of greater Osraige, king Donnchad Mac Giolla Phádraig.MCB1167.4  Mac Murchadha's initial mercenary force under Robert FitzStephen landed close to the border of Osraige at Bannow, took Wexford and immediately turned west to invade Osraige, acquiring hostages as a nominal token of submission.MCB1167.6  Later still, another auxiliary force under Raymond FitzGerald (le Gros) landed just opposite Osraige's border at Waterford, and won a skirmish with its inhabitants.MCB1167.9  By 1169, Richard de Clare, 2nd Earl of Pembroke (Strongbow) had also landed with a major force outside of Waterford, married Mac Murchadha's daughter Aoife and sacked the city.MCB1169.2  Later that year, a major conflict was fought in the woods of Osraige near Freshford when Mac Murchadha and his Norman allies under Robert FitzStephen, Meiler FitzHenry, Maurice de Prendergast, Miles FitzDavid, and Hervey de Clare (Montmaurice) defeated a numerically superior force under Domnall Mac Giolla Phádraig, king of greater-Osraige, at the pass of Achadh Úr following a feigned retreat in a three-day battle.  Shortly thereafter, de Prendergast and his contingent of Flemish soldiers defected from Mac Murchada's camp and joined king Domnall's forces in Osraige before quitting Ireland for a time.", "In 1170, MacMurchada died, leaving Strongbow as the de facto king of Leinster, which in his understanding, included Osraige. At Threecastles, Strongbow and Mac Giolla Phádraig agreed to the Treaty of Odogh (Ui Duach) in 1170, in which de Prendergast saved the life of the prince of Osraige from a treacherous assassination.Lyng.  The Fitzpatricks of Ossory, p. 260.  Osraige was afterwards invaded by Strongbow's troops and an Ua Briain force from Thommond. In 1171, King Henry II of England landed in nearby Waterford Harbour with one of the largest injections of English military strength into Ireland. On the banks of the Suir, Henry secured the submission of many of the kings and chiefs of southern Ireland; including Tuaisceart Osraige's king, Domnall Mac Giolla Phádraig.MCB1172.2  In 1172, the Norman adventurer Adam de Hereford was granted land by Strongbow in Aghaboe, north Osraige.  After Henry was recalled from Ireland to deal with the aftermath of Thomas Becket's murder and the Revolt of 1173–74, Osraige continued to be a theatre of conflict. Raymond FitzGerald plundered Offaly and travelled through Osraige to win a naval engagement at Waterford. Later, a force from Dublin inflicted a defeat on Hervey de Clare in Osraige. In 1175, the prince of Osraige assisted a force under Raymond FitzGerald to relieve the city of Limerick which had been besieged by the forces of Domnall Mór Ua Briain. Later, Gerald of Wales relates a defeat of the men of Kilkenny and their prince by a Norman force from Meath. The noted adventurer Robert le Poer won lands in Osraige, but was later killed there against the natives. In 1185, Prince John, then Lord of Ireland and future King of England, travelled from England to Ireland to consolidate the Anglo-Norman colonisation of Ireland, landing at Waterford near the border of Osraige. He secured the allegiance of the Irish princes and travelled through Osraige to Dublin, ordering several castles to be constructed in the region. The last recorded king of central Osraige was Maelseachaill Mac Gilla Patráic, who died in either 1193 or 1194.LC1193.13FM1194.6  However, the kingdom and a continuous succession of rulers remained intact in the north, subsequently called \"Upper Ossory\" into the mid-sixteenth century."]}, {"page": "Anglo-Norman invasion of Ireland", "response": ["By 1170, Strongbow appears to have been funded financially for his invasion by a Jewish merchant by the name of Josce of Gloucester: \"Josce, Jew of Gloucester, owes 100 shillings for an amerciament for the moneys which he lent to those who against the king's prohibition went over to Ireland.\" In May of that year, Raymond FitzGerald landed at Bannow Bay with at least 10 knights and 70 archers. This was the advance guard for Strongbow's army and was to be the springboard for an assault on Waterford.Martin (2008), p.73 Raymond's force occupied an old promontory fort at Baginbun and plundered the surrounding countryside. They were then besieged by a much larger force of Irish and Norse-Irish. The outnumbered Anglo-Normans drove a large herd of cattle into the opposing army.Martin (2008), p.74 In the ensuing havoc, the Normans routed the besiegers, killing up to 500 and capturing 70. These captives were then executed: the Normans broke their limbs before beheading them and throwing their bodies off the cliff.", "When they reached Dublin, Diarmait began negotiations with its king, Ascall mac Ragnaill (Ascall MacRannall). On 21 September, while talks were ongoing, a force of Normans—led by Miles de Cogan and Raymond FitzGerald—stormed the town and took it. Ascall and his followers fled in their ships but vowed to re-take the town.Martin (2008), p.78 Strongbow and Diarmait then launched \"a devastating campaign\" through Meath and into Breffny, burning Clonard, Kells, and several other monastic towns. In response to these violations of the Ferns agreement, Ruaidrí executed three hostages, including Diarmait's son.", "In early 1173, many of the Anglo-Norman leaders left Ireland to fight for King Henry in the Revolt of 1173–74.Martin (2008), p.100 When Raymond FitzGerald returned later that year, he led a successful plundering raid into the kingdom of the Déisi, by both land and sea. However, as their king had submitted to Henry, the kingdom should have been exempt from attack.Martin (2008), p.102 The Norman raid on the monastic town of Lismore was interrupted by a Norse-Irish fleet from Cork. After a naval engagement, the Normans withdrew to Waterford. FitzGerald then returned to Wales, due to the death of his father.Martin (2008), p.103", "Norman power in Ireland seemed to be disintegrating, and in the words of Gerald de Barri, \"the entire population of Ireland took the opportunity of this disorder to rise with one consent against the English\". Shortly after the Norman defeat at Thurles, the Norse-Irish of Waterford rose up and killed the Norman garrison of 200 soldiers.Martin (2008), p.104 Ruaidrí gathered an army that included contingents from Connacht, Meath, Breffny, Oriel, Ulster, and the Northern Uí Néill, along with their kings. It marched into Meath, destroying the castles at Trim and Duleek, before advancing on Dublin. Raymond FitzGerald landed at Wexford with at least 30 knights, 100 mounted soldiers and 300 archers. When this army arrived at Dublin and reinforced the garrison there, Ruaidrí's army withdrew."]}, {"page": "De Barry family", "response": ["* Philip de Barry came to Ireland in 1185 to assist his half-uncle Robert Fitz-Stephen, and his first cousin Raymond FitzGerald (also known as Raymond Le Gros), in their efforts to recover lands in the modern county Cork - the cantreds of Killede, Olethan and Muscarydonegan."]}, {"page": "List of nicknames of European royalty and nobility: R", "response": ["*Raymond FitzGerald "]}, {"page": "Odo, Count of Champagne", "response": ["In 1902 Richard Langrishe published a paper in which he put forward the theory that Odo was the primogenitor of the Irish family of Le Gras (Grace). This amended an older theory that Raymond FitzGerald (died 1185/1198) was the primogenitor. However, Richard Roach (1970) upheld the older proposition, but more recently M. T. Flanagan (2004) disagreed with Roach because FitzGerald had no known legitimate heirs."]}, {"page": "Raymond Fitzgerald", "response": ["#REDIRECT Raymond FitzGerald "]}, {"page": "Knocktopher", "response": ["Following the Norman invasion of Ireland, the Barony of Knocktopher was created. The first baron was said to be Griffin FitzWilliam, brother of Raymond le Gros known as Raymond FitzGerald. Gilbert fitz Griffin is cited as the 2nd Baron of Knocktopher and first owner of Knocktopher Manor. He died about 1203/4.  In the  early  fourteenth "]}, {"page": "Phelan (surname)", "response": ["In 1170, O’Phelan Prince of the Desies, provided military assistance to the Ostmen of Waterford in an Irish/Ostmen coalition against the Norman adventurer Raymond FitzGerald who had landed at a sea cliff around 14 miles from Waterford with a small band of troops of around 100 men. The coalition was also joined by a group from Ossary and O’Ryan a chieftain of the Odrone.  Together they combined with the Vikings and the men of the Desies and formed three bands in which to confront Raymond."]}, {"page": "Raymond le Gros", "response": ["#REDIRECT Raymond FitzGerald"]}, {"page": "Philip de Barry", "response": ["Philip de Barry came to Ireland at the end of February 1183,Expugnatio Hibernica by Giraldus Cambrensis; Book 2, Chapter 20, v94 accompanied by his brother Gerald and their followers, to take possession of his lands and to assist his half-uncle Robert Fitz-Stephen, and his first cousin Raymond FitzGerald (also known as Raymond Le Gros), in their efforts to recover lands in the modern county of Cork. These cantrefs or baronies had been expropriated by another (half) first cousin, Ralph Fitz-Stephen (or Radulph). Ralph was the grandson of Nesta by Stephen, Constable of Cardigan. In 1182 he was killed together with his father-in-law, Milo de Cogan, who had been granted of the second half of the kingdom of Cork.\"Giraldus Cambrensis\" v., 350, 351, Rolls edit. Robert Fitz-Stephen eventually ceded these territories to Philip, his half-nephew. These territories consisted of three cantrefs in Fitz-Stephen's half of the Kingdom of Desmond (\"the kingdom of Cork\") viz. Olethan, Muschiri-on-Dunnegan (or Muskerry Donegan) and Killyde (or Killede) by the service of ten knights.Smith, \"History of Cork\", Book 1, chapter i.Egerton MS., 75 B. M., "]}, {"page": "Selskar Abbey", "response": ["There was an earlier church on the site: it was here in 1169 that Diarmait Mac Murchada signed the first Anglo-Irish peace treaty.Illustrated Dublin Journal  The leading Norman  commander Raymond FitzGerald, (nicknamed Le Gros ) and his wife   Basila de Clare, sister of Richard de Clare, 2nd Earl of Pembroke, (nicknamed Strongbow),  are  said to have been married at Selskar  in 1174."]}, {"page": "Reimund Fitzgerald", "response": ["#REDIRECT Raymond FitzGerald"]}, {"page": "Stephen Devereux", "response": ["*Margaret Devereux (born ~1216). She married Alexander Redmond of The Hall.Gabriel O’C. Redmond. \"An Account of the Anglo-Norman Family of Devereux, of Balmagir, County Wexford.\" (Dublin: Office of \"The Irish Builder,\" 1891). Pages 4The ancient latin pedigree of the family records: Dominus Alexander de Redmond de Aula eques qui obiit AD 1285, nupt. fuit a Margareta filia Domini Stephani Devereux de Ballymaguir in Comitatu Wexfordensi equities. Alexander Redmond was a descendant of Raymond FitzGerald, brother in law of Richard de Clare, 2nd Earl of Pembroke"]}, {"page": "Miles de Cogan", "response": ["In August of 1170, Milo joined his uncles in sailing to Ireland with Strongbow. Less than a month later, he led one of two bands in an assault on Dublin, his cousin, Raymond FitzGerald having led the other. These bands sacked the city and slaughtered many of its inhabitants. Milo was afterward made constable of the settlement.", "Irish accounts relay that in fact, Milo and FitzStephen were marching to attack Waterford when Mac Tyre, king of Uí Meic Caille, slaughtered them and their host, possibly including Raymond FitzGerald and another of FitzStephen's sons.Annals of Loch Cé (first part, 1014–1348) (translated) at University College Cork's Corpus of Electronic Texts CELTThe Annals of Ulster (first part, 431–1201) (translated) at CELTMac Carthaigh's Book at CELT Gerald's text warns his readers of an alleged habit of the Irish in spreading plainly false rumours concerning the deaths of their enemies."]}, {"page": "Castlemore Moat", "response": ["The motte and bailey castle was constructed in the 12th century AD by Raymond FitzGerald (Raymond le Gros), one of the commanders of the Norman invasion of Ireland. The land of Forth O'Nolan was granted to Raymond and he married Basilia, sister of Strongbow. They lived together at Castlemore."]}, {"page": "Kells (County Kilkenny barony)", "response": ["Baron of Kells, Geoffrey FitzRobert de Monte Marisco, who was Richard de Clare's Constable of Leinster, built a castle by the banks of the Kings River and founded a town (the village of Kells) in c.1192. He married the illegitimate half-sister of Isabel de Clare, Basile de Clare, who was the widow of Raymond FitzGerald and grand-daughter to Gilbert de Clare. In the late 12th century, Huolyn (Howlin) served as Lords of Kilree. "]}, {"page": "Gorteens Castle", "response": ["The castle was originally built upon lands acquired by Raymond FitzGerald, who died in the late 1100s. The FitzGeralds were the most powerful Norman-Irish aristocratic dynasty in medieval Ireland until the 1500s. Gorteens was included in the Down Survey of Ireland in 1656 as being in the Baronys of Ida, Igrim or Ibercon and in the Parish of Rathpatricke. John FitzGerald, a Catholic, is recorded as being the last FitzGerald holder of Gorteens. "]}]}}