{"wiki_id": "http://www.wikidata.org/entity/Q16769678", "itemLabel": "Louise Bours", "itemDescription": "British politician (born 1968)", "wikipedia_url": "https://en.wikipedia.org/wiki/Louise_Bours", "wikipedia_page": {"main": "Louise Bours (born 23 December 1968), also known as Louise van de Bours, is a former Member of the European Parliament (MEP) for the North West England region. She was elected in 2014 as a UK Independence Party candidate but resigned from the party 2018, and sat as an independent until she stood down at the 2019 election.\n\n", "link_mentions": [{"page": "UK Independence Party", "response": ["UKIP would allow businesses to favour British workers over migrants, and would repeal \"much of\" Britain's racial discrimination law, which was described as \"shocking\" by the Conservative–Liberal Democrat coalition government and viewed as discriminatory by others. However, Farage insisted that his comments regarding his party's policies on these matters had been \"wilfully misinterpreted\". Although the party did not have an official stance on the Transatlantic Trade and Investment Partnership, the party's former international trade spokesperson (Lord Dartmouth) and former health and social care spokesperson (Louise Bours) stated that they did wish the National Health Service to be included in the trade deal, according to the International Business Times.", "In November 2018, Patrick O'Flynn resigned to join the Social Democratic Party in protest over UKIP's move to the \"hard right\", and Louise Bours became an independent MEP. Former leader Nigel Farage quit on 6 December 2018, as did Scottish MEP David Coburn. Another former leader, Paul Nuttall, quit the party the following day, as did London Assembly Member Peter Whittle.Matthew Weaver, \"Ukip resignations plunge party into further turmoil\" , The Guardian, 7 December 2018. Retrieved 31 December 2018. It was reported that Tim Aker had also quietly quit the party earlier in 2018. Julia Reid announced her resignation from UKIP on 8 December 2018, with Jonathan Bullock following the next day. Jill Seymour, Jane Collins and Margot Parker left for the Brexit Party on 15 April 2019, with the first of those three citing the party's current direction and occupation of 'the extreme right of politics' and the second citing Batten's 'sick' defence of Carl Benjamin's rape comments."]}, {"page": "List of actor-politicians", "response": ["|data-sort-value=\"Bours, Louise\"| Louise Bours || || UKIP (-2018)Independent (2018-)  || MEP for North West England (2014-2019)"]}, {"page": "Mickey Mouse degrees", "response": ["In 2000, Staffordshire University received negative press coverage when a module on the sociological importance of football which had been designed for students taking sociology, sports science, or media studies was portrayed as a \"degree in David Beckham Studies\".\"Beckham in degree course\", BBC News, 29 March 2000. URL accessed 24 June 2006. A professor for the department stressed that the course would not focus on Beckham, and that the module examines \"the rise of football from its folk origins in the 17th century, to the power it's become and the central place it occupies in British culture, and indeed world culture, today\". In July 2015, UK Independence Party MEP Louise Bours referred to the module on Question Time, but as though it was a full degree course. Other degrees deemed \"Mickey Mouse\" include \"golf management\" and \"surf science\".Emma Brockes \"Taking the mick\", EducationGuardian.co.uk, 15 January 2003. URL accessed 24 June 2006. Durham University designed an optional module centred around Harry Potter to examine \"prejudice, citizenship and bullying in modern society\" as part of a B.A. degree in Education Studies."]}, {"page": "North West England (European Parliament constituency)", "response": ["| colspan = 3 | Louise BoursUKIP (2014–2018)  Independent (2018–2019)"]}, {"page": "List of Question Time episodes", "response": ["|David Willetts, Margaret Curran, Louise Bours, Piers Morgan, Joey Barton", "|Alex Salmond, Caroline Flint, Mark Harper, Louise Bours, Len McCluskey", "|Anna Soubry, Chuka Umunna, Tommy Sheppard, Louise Bours, Rachel Johnson", "|Dominic Raab, John McDonnell, Louise Bours, Zoe Williams, Jermaine Jenas"]}, {"page": "Paul Nuttall", "response": ["In 2014, Nuttall was returned to the European Parliament at the European election and is currently one of two UKIP MEPs representing the constituency of North West England. In 2015, he once again contested Bootle, and came second behind Labour, with a 10.9% vote share. In March 2017, it was reported that Nuttall had claimed excess European funding for his office in his constituency which he shared with Louise Bours."]}, {"page": "List of elected British politicians who have changed party affiliation", "response": ["|Louise Bours"]}, {"page": "2012 England and Wales police and crime commissioner elections", "response": ["* Louise Bours, a former councillor and Mayor of Congleton, was the UKIP candidate."]}]}}