{"wiki_id": "http://www.wikidata.org/entity/Q16729028", "itemLabel": "Chris Floyd", "itemDescription": "British photographer", "wikipedia_url": "https://en.wikipedia.org/wiki/Chris_Floyd_(photographer)", "wikipedia_page": {"main": "Chris Floyd (born 1968) is a British photographer based in London. He is known chiefly for his celebrity portraiture and reportage, beginning with the Britpop music scene in the 1990s. He also works with fashion and advertising photography and film. In 2011, he exhibited his series of 140 portraits of Twitter users.", "link_mentions": [{"page": "Roland Gift (album)", "response": ["Roland Gift is the début solo album released by the former Fine Young Cannibals star Roland Gift, an album which includes songs co-written with the Kane Gang's Martin Brammer and Mike Barson's brother Ben. The cover photography was by Chris Floyd."]}, {"page": "Peter Dench", "response": ["*Professional Photography: The New Global Landscape Explained. Oxford: Focal, 2014. . By Grant Scott. With contributions from Dench as well as Alicia Bruce, Chris Floyd, Niall McDiarmid and Jim Mortram.", "*Great Britons of Photography Vol.1: The Dench Dozen. Eastbourne, UK: Hungry Eye, 2016. . With photographs by and transcripts of interviews between Dench and Jocelyn Bain Hogg, Marcus Bleasdale, Harry Borden, John Bulmer, Chris Floyd, Brian Griffin, Laura Pannack, Martin Parr, Tom Stoddart, Homer Sykes, and Anastasia Taylor-Lind. 160 pages. Edition of 500 copies."]}, {"page": "Christopher Floyd (disambiguation)", "response": ["Christopher or Chris Floyd may also refer to:", "*Chris Floyd (born 1975), American football player", "* Chris Floyd (photographer), British photographer", "*Chris Floyd, character in 2061: Odyssey Three"]}, {"page": "Chris Floyd (Photographer)", "response": ["#REDIRECT Chris Floyd (photographer)"]}, {"page": "Anastasia Taylor-Lind", "response": ["*Great Britons of Photography Vol.1: The Dench Dozen. Eastbourne, UK: Hungry Eye, 2016. . Edited by Peter Dench. With photographs by and transcripts of interviews between Dench and Taylor-Lind, Jocelyn Bain Hogg, Marcus Bleasdale, Harry Borden, John Bulmer, Chris Floyd, Brian Griffin, Laura Pannack, Martin Parr, Tom Stoddart, and Homer Sykes. 160 pages. Edition of 500 copies."]}, {"page": "Brooklyn Beckham", "response": ["In 2016, at age 16, Beckham photographed a campaign for Burberry BRIT, starring models Ben Rees, Carvell Conduah, Eliza Thomas, Liv Mason Pearson and Maddie Demaine. Beckham's hiring for the campaign was met with criticism by several prominent photographers. Chris Floyd called Burberry's decision to employ Beckham a \"devaluation of photography\" and \"sheer nepotism\", while fashion photographer Jon Gorrigan called it an example of \"a bit of injustice in a lot of areas\" of the industry."]}, {"page": "Jim Mortram", "response": ["*Professional Photography: The New Global Landscape Explained. Oxford: Focal, 2014. By Grant Scott. . With contributions from Mortram, Alicia Bruce, Peter Dench, Chris Floyd, and Niall McDiarmid."]}, {"page": "Niall McDiarmid", "response": ["*Professional Photography: The New Global Landscape Explained. Oxford: Focal, 2014. By Grant Scott. . With contributions from McDiarmid, Alicia Bruce, Peter Dench, Chris Floyd, and Jim Mortram."]}, {"page": "List of people from Welwyn Garden City", "response": ["* Chris Floyd (born 1968), photographer"]}]}}