{"wiki_id": "http://www.wikidata.org/entity/Q1680721", "itemLabel": "James Lorimer", "itemDescription": "British lawyer", "wikipedia_url": "https://en.wikipedia.org/wiki/James_Lorimer_(advocate)", "wikipedia_page": {"main": "James Lorimer of Kellyfield, FRSE LLD (4 November 1818 – 13 February 1890) was a Scottish advocate and professor of public law. He was an authority on international law.\n\n", "link_mentions": [{"page": "Everard im Thurn", "response": ["In 1895 he married Hannah C. Lorimer, daughter of Professor James Lorimer, of the University of Edinburgh. In 1921 they moved to live at Cockenzie House in East Lothian, where he died in 1932. "]}, {"page": "Foreign Enlistment Act 1870", "response": ["Hansard has reference to \"Foreign Enlistment Bill\" discussions from 1819 to 2006.Hansard record of debates on Foreign Enlistment, 1819-2005  Stephen presents late 19th century establishment views.James Fitzjames Stephen, \"A History of the Criminal Law of England\", p262, 1883, republished 2014 by CUP  Lorimer publishes the law of 1870 as it was originally enacted.James Lorimer, \"The Institutes of the Law of Nations: A Treatise of the Jural Relations of Separate Political Communities\", c. XII. Edinburgh: William Blackwood and Sons, 1883, 1884; reprinted 2005 by the Lawbook Exchange"]}, {"page": "Robert Lorimer", "response": ["Lorimer was born in Edinburgh, the son of Hannah Stodart (1835–1916) and James Lorimer, who was Regius Professor of Public Law at University of Edinburgh from 1862 to 1890. In his youth the family lived at 21 Hill Street, a Georgian house in Edinburgh's South Side, close to where his father worked at Old College."]}, {"page": "Kellie Castle", "response": ["Methven Erskine the 10th Earl of Kellie died in 1829 to be succeeded by John Francis Miller Erskine as 11th Earl of Kellie. The castle was abandoned by Erskine and cleared of its contents at a muckle roup (public auction) in 1830. John Francis Miller Erskine was confirmed as 26th Earl of Mar in 1835 and the Earldom of Kellie was united with the Earldom of Mar. The property then seems to have fallen to James Maitland Hog of Newliston (thereafter titled \"of Newliston and Kellie\") but Hog made little use of the estate, and the castle lay abandoned for many years. In 1878 it was rented from the Earl of Mar and Kellie by James Lorimer, Regius Professor of Public Law at Edinburgh University, and father to Sir Robert Lorimer, the renowned Scottish architect. The Lorimer family set about restoring the castle for use as a holiday retreat, but it soon became the family home. Robert Lorimer was instrumental in much of the restoration work, restoring magnificent plaster ceilings, painted panelling and furniture.", "The main castle contents were given into the care of the Trust by the Secretary of State for Scotland and, in 1998 the Trust purchased the Lorimer family artifacts. Amongst these artifacts are included paintings by Hannah Cassels im Thurn, the eldest daughter of Hannah and James Lorimer. The castle and gardens are open to the public, and there is a permanent exhibition of Hew Lorimer's work and studio in the old stables."]}, {"page": "Hew Lorimer", "response": ["Hew was the nephew of the Scottish painter John Henry Lorimer and the grandson of Prof. James Lorimer, lawyer and academic."]}, {"page": "List of Acts of the Parliament of the United Kingdom, 1801–1819", "response": ["* Foreign Enlistment Act 1819 c. 69The National Archives: \"FOREIGN ENLISTMENT ACT 1819: Foreign enlistment by British subjects\"Hansard record of debates on Foreign Enlistment, 1819-2005James Fitzjames Stephen, \"A History of the Criminal Law of England\", p262, 1883, republished 2014 by CUPJames Lorimer, \"The Institutes of the Law of Nations: A Treatise of the Jural Relations of Separate Political Communities\", c. XI. Edinburgh: William Blackwood and Sons, 1883, 1884; reprinted 2005 by the Lawbook ExchangeFrederick Waymouth Gibbs, historical development of \"The Foreign Enlistment Act\".  W. Ridgway, 1863; also available as google e-book."]}, {"page": "Newburn, Fife", "response": ["* Prof James Lorimer (advocate)"]}, {"page": "James Lorimer (jurist)", "response": ["#REDIRECT James Lorimer (advocate)"]}, {"page": "Ernest Nys", "response": ["Nys was a member of the Permanent Court of Arbitration in The Hague.  He was particularly interested in the historical development of international law and translated works of English legal scholars James Lorimer and John Westlake.  He died in 1920 in Brussels."]}, {"page": "James Lorimer", "response": ["James Lorimer may refer to:", "* James Lorimer (Australian politician) (1831–1889)", "* James Lorimer (South African politician) (born 1962)", "* James Lorimer (advocate) (1818–1890), Scottish advocate and professor of public law", "* James Lorimer Ilsley (1894–1967), Canadian politician and jurist"]}, {"page": "Alfred Daniell", "response": ["In 1885 he was elected a Fellow of the Royal Society of Edinburgh, his proposers being Alexander Crum Brown, William Lindsay Alexander, James Lorimer and Peter Guthrie Tait. At this time he was living at 40 Gillespie Crescent, a modest flat in the south-west of Edinburgh.Edinburgh and Leith Post Office Directory, 1885-6"]}, {"page": "Robert Hamilton (advocate)", "response": ["On his death his professorship was not refilled. The post was not recreated until 1867 when Professor James Lorimer took on the role."]}, {"page": "James Maitland Hog", "response": ["He appears to have inherited Kellie Castle in Fife in 1829 but made little use of the property, which was largely left to fall into disrepair. The Castle later became the home of Prof James Lorimer and his sons Robert Lorimer and John Henry Lorimer."]}, {"page": "Queen Street, Edinburgh", "response": ["* 22 - James Lorimer (advocate)"]}, {"page": "Hannah Cassels im Thurn", "response": ["im Thurn was born Hannah Cassels Lorimer on 7 December 1854. She was the daughter of Hannah Stodart and James Lorimer. She studied at the University of Edinburgh where, in 1880, she was awarded the University Certificate of Arts for Women."]}, {"page": "Robert Stodart Wyld", "response": ["In 1864 he was elected a Fellow of the Royal Society of Edinburgh. His proposer was James Lorimer."]}]}}