{"wiki_id": "http://www.wikidata.org/entity/Q1689303", "itemLabel": "Jimmy Andrews", "itemDescription": "Scottish footballer (1927-2012)", "wikipedia_url": "https://en.wikipedia.org/wiki/Jimmy_Andrews", "wikipedia_page": {"main": "James Patrick Andrews (1 February 1927 – 12 September 2012) was a Scottish footballer who played as a left winger.", "link_mentions": [{"page": "Robin Friday", "response": ["Born and raised in Acton, West London, Friday was scouted, but not retained, by four professional clubs during his teenage years. He appeared for local semi-professional sides in the Isthmian League until he joined Charlie Hurley's Fourth Division Reading team in 1974; quickly becoming a key player, he helped Reading to win promotion to the Third Division during the 1975–76 season. As his drug habit intensified, Friday's form began to dip in the first half of the 1976–77 season, leading Reading to sell him to Second Division side Cardiff City around the New Year. Friday travelled to join his new team by train without a valid ticket and had to be bailed by the Cardiff manager Jimmy Andrews before he signed for the club. He performed strongly on his debut, but afterwards his form declined and his personal life caused him to repeatedly miss matches altogether. Following a number of incidents, on and off the field—including kicking Mark Lawrenson in the face —Friday retired from football in December 1977, aged 25. He died in Acton in 1990, aged 38, after suffering a heart attack.", "Friday was watched by other clubs throughout November and December 1976, but although he performed well in some games, including a 1–1 draw away at Crystal Palace on 6 November in which he scored his team's only goal, he was poor in others. After being marked out of the game during Reading's 4–0 loss away against Mansfield Town on 8 November, he was substituted. \"Coincidence or not\", wrote the Evening Post, \"when Friday left, so did half a dozen managers and scouts\". Friday was so angry at his team's performance that he broke into the Mansfield dressing room and defecated in the team bath. Reading's asking price stood at £50,000, and the first transfer offer came from Second Division side Cardiff City around mid-December. Cardiff boss Jimmy Andrews bid £28,000, half of his offer a year before, which Reading's directors accepted, wanting the troublesome player off their hands as quickly as possible. Friday was reluctant to go to the Welsh club, saying that it was too far from home, that he wanted to go to a First Division team and that he wanted more money than was being offered; however, when Hurley told him that unless he went to Cardiff he would be released, he agreed and travelled to Wales on 30 December 1976.", "Friday's style of play was based around his exceptional ball skills, described by Cardiff doctor Leslie Hamilton as \"absolutely fabulous\", and his instinctive footballing vision, which enabled him both to execute flamboyant individual moves and to create attacks for his teammates. Jimmy Andrews, his manager at Cardiff, later called Friday \"the complete centre-forward\" and placed him on a par with Alan Shearer, while Maurice Evans claimed that he could have played for England, and was at least on a level with international strikers he had worked with such as John Aldridge and Dean Saunders. This opinion was shared by Hamilton and Friday's Reading teammate John Murray, both of whom firmly declared in separate interviews that Friday would have been good enough for the England team had he \"sorted his head out\", in Hamilton's words."]}, {"page": "John Toshack", "response": ["Having secured his release from his contract at Liverpool, Toshack looked to move into management and approached his former club Cardiff City over a coaching position but was rejected by manager Jimmy Andrews who questioned his qualifications for the role. Toshack instead received a phone call from Swansea City chairman Malcolm Struel and was invited to a meeting at the club. Following this, he was appointed player-manager of Fourth Division club Swansea on 1 March 1978, becoming the youngest manager in the Football League at the age of 29. Succeeding Harry Griffiths who stepped down to become his assistant, Toshack's appointment was seen as a significant coup for Swansea and the crowd for his first match in charge, a 3–3 draw with Watford, more than doubled from the club's previous home match with over 15,000 in attendance."]}, {"page": "West Ham United F.C. Under-23s and Academy", "response": ["Fenton was praised as a forward thinking manager.  He pushed for the establishment of \"The Academy\" that brought through a series of young players to augment a side that could not be improved with the limited finances available.  Two of the signings he did manage to make were those of John Dick and Malcolm Allison.  Other players of the day included John Bond, Dave Sexton, Jimmy Andrews and Frank O'Farrell (later swapped for Eddie Lewis) and Tommy Moroney all part of an original 'Cafe Cassettari' club started by Fenton as a result of the restrictive budget.", "Cassettari's Café sat opposite the Boleyn Ground, and Fenton organised a deal that saw meals and a warm welcome for the players of the club at a price the club could manage.  It became a place for routine discussion of the team, and ideas and wisdom freely passed back and forth. The tradition of mentorship lasted long into the 1960s even after Fenton had moved on and saw future managers John Lyall and Harry Redknapp pass through. West Ham, with meetings at Cassettari's Café, soon gained a reputation for producing managers via playing for the club including Malcolm Allison, Noel Cantwell, Frank O'Farrell, John Bond, Dave Sexton, Jimmy Andrews and Malcolm Musgrove."]}, {"page": "Invergordon", "response": ["* Jimmy Andrews, footballer"]}, {"page": "List of West Ham United F.C. players", "response": ["| Jimmy Andrews"]}, {"page": "Andrews (surname)", "response": ["* Jimmy Andrews (1927–2012), Scottish footballer"]}, {"page": "Cardiff City F.C.", "response": ["|align=left|Jimmy Andrews"]}, {"page": "2012 in association football", "response": ["* September 12 - Jimmy Andrews, Scottish footballer (born 1927)"]}, {"page": "Adrian Alston", "response": ["In his debut season, Alston finished as the club's joint top goalscorer, along with Ron Futcher, in the league as the club suffered relegation. However, Alston spent just one season at Kenilworth Road as the club began to experience financial difficulties resulting in Alston not being paid at times. Alston later described his decision to reject offers from Germany and return to England with Luton as \"the biggest mistake I ever made\". Cardiff City manager Jimmy Andrews paid £20,000 to take him to Ninian Park with the club also agreeing to pay Alston the wages owed to him by Luton. He scored twice on his debut in a 4–3 win over Chesterfield and later went on to become the first post-war Cardiff player to score a hat-trick in the FA Cup in a 6–2 win over Exeter City. In his first season, the club won the Welsh Cup, qualifying for the European Cup Winners' Cup the following season. In the first round of the competition, Alston became the first Australian player to score in a European competition when he scored in a 1–0 victory over Georgian side Dinamo Tbilisi on 15 September 1976."]}, {"page": "Johnny Windhurst", "response": ["* Jazz at Columbus Avenue with Buell Neidlinger, Walt Gifford, and Jimmy Andrews (Transition, 1956)"]}, {"page": "History of West Ham United F.C.", "response": ["Fenton was praised as a forward-thinking manager. He pushed for the establishment of \"The Academy\" that brought through a series of young players to augment a side that could not be improved with the limited finances available. Two of the signings he did manage to make were those of John Dick and Malcolm Allison. Other players of the day included John Bond, Dave Sexton, Jimmy Andrews and Frank O'Farrell (later swapped for Eddie Lewis) and Tommy Moroney all part of an original \"Cafe Cassettari\" club started by Fenton as a result of the restrictive budget. Longstanding custodian in goal was Ernie Gregory.", "O'Farrell and Moroney were both acquired from Ireland in 1949 prior to Fenton becoming manager, but the pair were Irish internationals that had even featured in the 2–0 defeat of the England team at Goodison Park in 1949. John Bond had been brought in as Fenton's first signing in 1950 and was to be with the team for the next 15 years as a popular goalscoring right back playing opposite Captain Cantwell. Jimmy Andrews was brought in from Dundee in 1951 to play left wing, but eventually lost his position to Malcolm Musgrove."]}, {"page": "Keith Robson", "response": ["Robson moved to Cardiff City in August 1977, having scored 19 goals in 87 games for West Ham. However, his time in South Wales was plagued by disciplinary problems and, in December, he was heavily fined by the club and placed on the transfer list with manager Jimmy Andrews commenting he \"had problems with the player since he came here\". He went on to play for Norwich City, where he teamed up with ex-West Ham players Alan Taylor, Graham Paddon, Martin Peters and John McDowell. The £25,000 signing scored 13 goals in 65 games for the Carrow Road club before moving to Leicester City. He spent time on loan to Carlisle United where he played with another former Hammer, Pop Robson."]}, {"page": "Phil Dwyer", "response": ["O'Farrell resigned suddenly in April 1974 and the side again avoided relegation on the final day of the season, drawing 1–1 with Crystal Palace to relegate their opponents in their stead. Dwyer won his second Welsh Cup at the end of the season, as Cardiff defeated Stourbridge under Jimmy Andrews, who had previously been O'Farrell's assistant. In only his second season as a senior professional, Dwyer was ever present in the league for Cardiff playing in all 42 matches during the campaign and missing just one first team match, the first leg of the Welsh Cup final against Stourbridge. He made a total of 52 appearances in the 1973–74 season. Andrews was forced to sell players to balance finances ahead of the 1974–75 season and the sales placed further strain on the club's results as the side were placed in the relegation zone midway through the campaign. In January 1975, Cardiff played Millwall at The Den. With Cardiff trailing 5–1, a frustrated Dwyer deliberately collided with Millwall goalkeeper Ray Goddard causing the opposition player to be stretchered off the field with a concussion. Dwyer's actions had caused fans from both sides to clash and a Millwall supporter ran onto the pitch and aimed a punch at Dwyer. Seeing the punch coming, Dwyer was able to avoid being hit and grabbed the fan in a headlock. Holding on until the fan was apprehended by police. Dwyer later refused to press charges against the fan. Cardiff finished the season in 21st position, suffering relegation to the Third Division, and went on to lose the Welsh Cup final 5–2 to Wrexham over two legs.", "Jimmy Andrews, who managed Dwyer for four seasons at Cardiff, described him as \"brave and he had a good professional mentality. He wasn't a great player but a good scrapper who would always give you everything he had.\" Referring to his period playing as forward, Andrews added \"I played him as a striker and he scored one or two important goals [...] he was always happy to give it a go—wherever I wanted him to play. He was a good pro.\" Roger Gibbins, who won promotion with Dwyer in 1983, described him as \"an out-and-out centre half who was good in the air, competed very well and who put his head in where it hurt.\""]}, {"page": "John Lewis (footballer, born 1955)", "response": ["Lewis was born in Tredegar and was spotted by Cardiff City while playing for Pontllanfraith in a Welsh Football League match and was quickly offered a contract by then manager Jimmy Andrews. He made his Cardiff debut against Blackburn Rovers in September 1978. He went on to become a regular fixture in the Bluebirds line-up over the next few years before eventually leaving the club along with Linden Jones and Tarki Micallef to join Newport County in a swap deal that saw Nigel Vaughan and Karl Elsey go the other way and join Cardiff.Newport County A-Z of transfers"]}]}}