{"wiki_id": "http://www.wikidata.org/entity/Q1686451", "itemLabel": "Jeffrey John", "itemDescription": "Dean of St Albans; Bishop-designate of Reading; British Anglican priest", "wikipedia_url": "https://en.wikipedia.org/wiki/Jeffrey_John", "wikipedia_page": {"main": "Jeffrey Philip Hywel John (born 10 February 1953) is a Church of England priest, who served as the Dean of St Albans from 2004 until 2021. He made headlines in 2003 when he was the first person to have openly been in a same-sex relationship to be nominated as a Church of England bishop. Owing to the consequent controversy he stepped down. In the years since, he has reportedly been considered for at least seven diocesan bishoprics across England, Wales and the Isle of Man.", "link_mentions": [{"page": "Rowan Williams", "response": ["Williams's contributions to Anglican views of homosexuality were perceived as quite liberal before he became the Archbishop of Canterbury. These views are evident in a paper written by Williams called \"The Body's Grace\", which he originally delivered as the 10th Michael Harding Memorial Address in 1989 to the Lesbian and Gay Christian Movement, and which is now part of a series of essays collected in the book Theology and Sexuality (ed. Eugene Rogers, Blackwells 2002). At the Lambeth Conference in July 1998, then Bishop Rowan Williams of Monmouth abstained and did not vote in favour of the conservative resolution on human sexuality. These actions, combined with his initial support for openly gay Canon Jeffrey John, gained him support among liberals and caused frustration for conservatives."]}, {"page": "Hertford College, Oxford", "response": ["* The Very Reverend Jeffrey John, Dean of St Albans"]}, {"page": "Southwark Cathedral", "response": ["On 16 November 1996 the cathedral became a focus of controversy when it hosted a twentieth-anniversary service for the Lesbian and Gay Christian Movement. Jeffrey John, the openly gayTelegraph, \"Gay cleric in line to become bishop in Church of England\", 3 July 2010 Dean of St Albans and former bishop-elect of Reading, had been Canon Theologian of Southwark."]}, {"page": "Gene Robinson", "response": ["The election in New Hampshire, like all elections of bishops in the Episcopal Church, was done by a synodical election process, unlike many other parts of the Anglican Communion where bishops are appointed. This detail would be misunderstood when the international commentary following Robinson's election suggested he should voluntarily step down or be asked to do so. The Jeffrey John case in the Church of England is the best example to contrast the election of bishops with the appointment of bishops. Jeffrey John is an openly gay priest living in a long-standing celibate relationship (he self-identifies as celibate) and was appointed as a bishop. One person alone, Richard Harries, then Bishop of Oxford, had the authority to appoint the Bishop of Reading (an area bishop in Oxford diocese), though new bishops are customarily consecrated by the archbishop. Rowan Williams, then Archbishop of Canterbury, however, allegedly persuaded Harries to not proceed with the appointment. This precedent would be used by the wider Anglican Communion to pressure Robinson. Robinson said that \"there was not a single bishop involved in the choosing of me to be Bishop of New Hampshire.\""]}, {"page": "Church in Wales", "response": ["Currently, \"the Church in Wales is much more liberal on this issue [than the Church of England]\" and is discussing the possibility of blessing or performing same-sex marriages. In 2018, the Welsh Bishops released a statement saying it was \"unjust\" to not offer formal provision for same-sex marriages and civil partnerships. Following the bishops' announcement, the General Synod voted in favour of requesting formal provision for same-sex couples. The Welsh Church has decided to move forward with possibly offering same-sex marriage and blessing rites for same-sex unions. The Diocese of St. Asaph provides a chaplaincy and services for LGBT people. The Very Revd Jeffrey John, who is openly gay and in a civil union, was nearly elected bishop of Llandaff when he \"won more than half of a Church in Wales electoral college, but fell short of the two-thirds majority required.\" As of 2020, the Church in Wales has approved the consecration of a bishop, Bishop Cherry Vann, who is openly lesbian and in a civil partnership."]}, {"page": "Homosexuality and the Anglican Communion", "response": ["In 2002, the Diocese of New Westminster, in the Anglican Church of Canada, permitted the blessing of same-sex unions. In 2003, two openly gay men in England and the United States became candidates for bishop. In the Church of England, Jeffrey John eventually succumbed to pressure to withdraw his name from consideration to be the Bishop of Reading. In the Episcopal Church in the United States, Gene Robinson was elected and consecrated Bishop of New Hampshire, becoming the first openly gay bishop in the Anglican Communion and in apostolic Christianity. This was highly controversial and led several hundred bishops to boycott the 2008 Lambeth Conference. As an alternative to Lambeth, many of these bishops attended the Global Anglican Futures Conference in Jerusalem.Christopher Craig Brittain and Andrew McKinnon, \"Homosexuality and the Construction of 'Anglican Orthodoxy': The Symbolic Politics of the Anglican Communion,\" Sociology of Religion (2011), pp. 1–3.", "In August 2003 the Episcopal Diocese of New Hampshire elected an openly gay and partnered priest, Gene Robinson, as bishop. This came shortly after a similar controversy in England when an openly gay priest, Canon Jeffrey John, was appointed to become the Suffragan Bishop of Reading. Eventually, however, John agreed to withdraw in order to avoid division. In 2004, in the aftermath of Robinson's election as bishop, John was installed as Dean of St Albans, the cathedral there being the site of England's first Christian martyr.", "The issue of human sexuality erupted when Jeffrey John, an openly gay priest, was elected area Bishop of Reading in May 2003. Before he could take up his post there was strong opposition from a minority of bishops and he was persuaded to not proceed with the appointment. However, many senior bishops have voiced disappointment at his decision to resign. Later in 2004 he was installed as Dean of St Albans. Further controversy erupted when churches in the Diocese of St Albans decided that they would withhold contributions until further notice to protest this appointment. St. Peter and Paul's Church in Cranfield, near Bedford, and Holy Trinity Church in New Barnet, north of Greater London, pledged to withhold money from diocesan funds in protest. St Andrew's Church in the Hertfordshire town of Chorleywood also announced that it would withhold funds until further notice. Yet, in 2002, reporters confirmed that hundreds of same-sex blessings occur, although unofficially, every year."]}, {"page": "Peter Akinola", "response": ["In August 2003 he stated that if the celibate homosexual Jeffrey John was consecrated as Bishop of Reading or the non-celibate homosexual Gene Robinson consecrated as Bishop of New Hampshire, the Church of Nigeria would leave the Anglican Communion. A number of dioceses throughout the world, including the Diocese of Sydney, made similar statements. Under pressure from the Archbishop of Canterbury, John withdrew from appointment as bishop and was subsequently appointed as Dean of St Albans.  Gene Robinson's consecration went forward, precipitating a crisis in the Anglican Communion. At the end of 2003 Akinola commissioned together with Drexel Gomez, primate of the Church in the Province of the West Indies and Gregory Venables, Presiding Bishop of the Anglican Church of the Southern Cone Claiming our Anglican Identity: The Case Against the Episcopal Church, USA, a paper for the Primates of the Anglican Communion detailing the implications of the consecration of Gene Robinson for the Anglican Communion, in the view of conservative Primates.Claiming our Anglican Identity: The Case Against the Episcopal Church, USA "]}, {"page": "St Stephen's House, Oxford", "response": ["* Jeffrey John – Dean of St Albans"]}, {"page": "2004 in the United Kingdom", "response": ["** An openly gay cleric, Jeffrey John is installed as the Dean of St Albans."]}, {"page": "Affirming Catholicism", "response": ["Prominent supporters include Rowan Williams, former archbishop of Canterbury; as well as Jeffrey John, Dean of St Albans and former bishop suffragan-designate of Reading; both of whom have served on the executive committee of British and Irish Affirming Catholicism. In North America, bishops involved in AAC include Frank Griswold, former presiding bishop of the Episcopal Church; Andrew Hutchison, former primate of the Anglican Church of Canada; and Victoria Matthews, a bishop in Canada and New Zealand."]}, {"page": "2004 in Wales", "response": ["*2 July – Jeffrey John, an openly gay clergyman originally from Tonyrefail, is inducted as Dean of St Albans."]}, {"page": "Elizabeth Stuart (theologian)", "response": ["Jeffrey John argued against the model proposed in Just Good Friends in his booklet Permanent, Faithful, Stable: Christian Same-Sex Partnerships."]}, {"page": "Bishop of Reading", "response": ["|align=\"center\" colspan=\"2\"| 2003 || Jeffrey John ||Nominated in May 2003, but withdrew in July 2003 after controversy about his homosexuality.Gay priest rejects bishop post. BBC News, Sunday, 6 July 2003."]}, {"page": "Michael Scott-Joynt", "response": ["In 2003, he was (unexpectedly at the time) signatory to an open letter from 17 Church of England bishops opposing the nomination of Jeffrey John, an openly gay priest in a long-term relationship, as suffragan bishop-designate of Reading.Telegraph – And suspicion begat spite, back-stabbing and schism The other nine diocesan bishop signatories were: Michael Langrish (Exeter), Michael Nazir-Ali (Rochester), Peter Forster (Chester), James Jones (Liverpool), George Cassidy (Southwell & Nottingham), Graham Dow (Carlisle), John Hind (Chichester) and David James (Bradford).Frost's Meditations – Nazir-Ali "]}, {"page": "Iain Torrance", "response": ["Iain Torrance's tenure as Moderator of the General Assembly of the Church of Scotland (2003-2004) was marked by a nationally reported controversy following his public comments on homosexuality in which he stated that he was \"utterly untroubled\" by the ordination of gay clergy. The context was the nomination of Canon Jeffrey John as Bishop of Reading. Doctor Torrance thereby became the first leader to encourage gay ordination in the Church of Scotland's 500-year history, a stance that marked a major shift in the Church's view and which was met with fierce opposition. Torrance subsequently used a Christmas sermon as a platform to challenge homophobia within his own church. The Reverend David W. Lacy, one of Torrance's successors as Moderator, publicly opposed this stance, arguing that the appointment of openly gay ministers would rip the Church of Scotland apart. When asked to comment on some public criticism by fellow ministers, Torrance said of his critics: \"I am not convinced that their vision and my vision need collide in such a way that one must consume the other. There is room for both, and a lively Church needs both those who are zealous in upholding tradition and those who probe its boundaries.\""]}, {"page": "Stephen Cottrell", "response": ["Cottrell was nominated area Bishop of Reading on 6 January 2004, after Jeffrey John controversially withdrew his nomination to the post in 2003.New Bishop of Reading revealed, BBC Berkshire, 6 January 2004. Retrieved 30 September 2008. He had been a supporter of John's original appointment. He said of his nomination: \"I am looking forward to becoming the next Bishop of Reading with a mixture of excitement and trepidation. I believe my work in mission and evangelism has prepared me well for the challenges facing the church in this new century. I hope and pray that my love for and understanding of the different traditions of the Church of England will enable me to be a focus for unity in the Reading Episcopal area.\" He was consecrated on 4 May 2004 by Rowan Williams, Archbishop of Canterbury, at St Paul's Cathedral,St Mary's Purley Parish NewsBBC News Berkshire — New Bishop of Reading consecrated (Accessed 26 December 2016). following confirmation of the appointment by letters patent."]}, {"page": "Tonyrefail", "response": ["*Jeffrey John, Church of England priest and first openly gay bishop-designate."]}, {"page": "Michael Nazir-Ali", "response": ["Because of his beliefs on marriage and the family, Nazir-Ali has not been in favour of the ordination of non-celibate homosexual people as clergy and the blessing of same-sex unions. He was one of the bishops who signed a letter against Rowan Williams' decision not to block the appointment of Jeffrey John as Bishop of Reading in 2003.Telegraph – And suspicion begat spite, back-stabbing and schism"]}, {"page": "1953 in Wales", "response": ["*10 February – Jeffrey John, Dean of St Albans"]}, {"page": "John Hind (bishop of Chichester)", "response": ["Hind was also one of the bishops who signed a letter against Rowan Williams' decision not to block the appointment of Jeffrey John as Bishop of Reading in 2003, due to John being a self-identified homosexual. The other diocesan bishop signatories (referred to by their opponents, since there were nine, as the Nazgûl) were: Michael Scott-Joynt (Bishop of Winchester), Michael Langrish (Exeter), Michael Nazir-Ali (Rochester), Peter Forster (Chester), James Jones (Liverpool), George Cassidy (Southwell & Nottingham), Graham Dow (Carlisle) and David James (Bradford).Frost's Meditations – Nazir-Ali "]}, {"page": "OneBodyOneFaith", "response": ["**Jeffrey John (Dean of St Albans)"]}, {"page": "List of Anglicans", "response": ["*Jeffrey John"]}, {"page": "Mark Oakley", "response": ["Oakley wrote the introduction for the reissue of Jeffrey John's book Permanent, Faithful, Stable. The book argues for Christian acceptance of same-sex marriage. He has called John \"the best bishop we never had\" and adds that \"It is essential that the Church embraces its gay and lesbian members fully as part of God's diversity and celebrates their permanent, faithful and stable relationships with prayer, affirmation and words of blessing.\" Oakley spoke at the Greenbelt Festival in 2013 on the same theme. He preached in 2017 at St-Martin-in-the-Fields in commemoration of the 50th anniversary of decriminalisation of homosexuality in England and Wales:"]}, {"page": "Peter Forster", "response": ["He was one of nine bishops who signed a letter disagreeing with the decision of Rowan Williams, Archbishop of Canterbury, not to block the appointment of Jeffrey John as Bishop of Reading in 2003."]}, {"page": "Michael Langrish", "response": ["Langrish was one of the diocesan bishops who signed a letter against Rowan Williams' decision not to block the appointment of Jeffrey John as Bishop of Reading in 2003. The others signatories (referred to, since there were nine, as the \"Nazgûl\") were: Michael Scott-Joynt (Bishop of Winchester), Michael Nazir-Ali (Rochester), Peter Forster (Chester), James Jones (Liverpool), George Cassidy (Southwell & Nottingham), Graham Dow (Carlisle), John Hind (Chichester) and David James (Bradford)."]}, {"page": "James Jones (bishop)", "response": ["Jones is an Evangelical and was one of the group of bishops who signed a letter opposing Rowan Williams' decision not to block the appointment of Jeffrey John as Bishop of Reading. The other diocesan bishop signatories were: Michael Scott-Joynt (Bishop of Winchester), Michael Langrish (Exeter), Michael Nazir-Ali (Rochester), Peter Forster (Chester), George Cassidy (Southwell & Nottingham), Graham Dow (Carlisle), John Hind (Chichester) and David James (Bradford). In 2008, Jones apologised for opposing the gay cleric. "]}, {"page": "George Cassidy (bishop)", "response": ["Cassidy spent much of his time in the House of Lords, where he voted against the Equality Act in early 2007. He was also one of the rebel bishops who signed a letter against Rowan Williams' decision not to block the appointment of Jeffrey John as Bishop of Reading in 2003. The other diocesan bishop signatories (referred to by their opponents, since there were nine, as the Nazgûl) were: Michael Scott-Joynt (Bishop of Winchester), Michael Langrish (Exeter), Michael Nazir-Ali (Rochester), Peter Forster (Chester), James Jones (Liverpool), Graham Dow (Carlisle), John Hind (Chichester) and David James (Bradford).Frost's Meditations – Nazir-Ali "]}, {"page": "Anglican realignment", "response": ["The Anglican realignment is a movement among some Anglicans to align themselves under new or alternative oversight within or outside the Anglican Communion. This movement is primarily active in parts of the Episcopal Church in the United States and the Anglican Church of Canada. Two of the major events that contributed to the movement were the 2002 decision of the Diocese of New Westminster in Canada to authorise a rite of blessing for same-sex unions, and the nomination of two openly gay priests in 2003 to become bishops.  Jeffrey John, an openly gay priest with a long-time partner, was appointed to be the next Bishop of Reading in the Church of England and the General Convention of the Episcopal Church ratified the election of Gene Robinson, an openly gay non-celibate man, as Bishop of New Hampshire. Jeffrey John ultimately declined the appointment due to pressure.", "* Jeffrey John, an openly gay priest living with his long-time partner, was appointed to be the next Bishop of Reading. He withdrew his nomination under pressure after being asked to do so by the Archbishop of Canterbury.", "* Clergy in the Church of England are permitted to register a civil partnership if they give assurances that their relationships are celibate. Jeffrey John, the dean of St. Alban's Cathedral, became the most senior cleric to register a civil union with his same-sex partner."]}, {"page": "Penal substitution", "response": ["The debate has largely been conducted in evangelical circles,See Steve Jeffery, Mike Ovey, and Andrew Sach, Pierced for our Transgressions: Rediscovering the Glory of Penal Substitution (IVP, 2007) to which the Bishop of Durham, N. T. Wright, has responded in \"The Cross and the Caricatures\". though the dismissal of the doctrine of penal substitution on moral grounds by Jeffrey John, an Anglo-Catholic priest and Dean of St Albans, in a broadcast talk during Holy Week 2007Jeffrey John, Lent Talks, BBC Radio 4 (04/04/07): 'As he said, \"Whoever sees me has seen the Father\". Jesus is what God is. He is the one who shows us God's nature. And the most basic truth about God's nature is that he is love, not wrath and punishment.' [8.07-08.21 min.]; 'The cross, then, is not about Jesus reconciling an angry God to us; it's almost the opposite. It's about a totally loving God, incarnate in Christ, reconciling us to him. On the cross, Jesus dies for our sins, the price of sin is paid, but it's not paid to God, but by God. As St Paul says ...  Because he is love, God does what love does: unites himself with the beloved. He enters his own creation and goes to the bottom line for us. Not sending a substitute to vent his punishment on, but going himself to the bitter end, sharing in the worst of suffering and grief that life can throw at us, and finally sharing our death so that he can bring us through death to eternal life in him.' [09.37-10.36 min.]; '...so far from inflicting suffering and punishment, be bears our griefs and shares our sorrow. From Good Friday on, God is no longer God up there, inscrutably allotting rewards and retributions; on the cross, even more than in the crib, he is Emmanuel, God down here, God with us.' [13.22-13.45 min.]'\"In other words, Jesus took the rap and we got forgiven as long as we said we believed in him,\" says Mr. John. \"This is repulsive as well as nonsensical. It makes God sound like a psychopath. If a human behaved like this we'd say that they were a monster.\"': Jonathan Wynne-Jones, 'Easter message: Christ did not die for sin' in The Telegraph, 01/04/07. Online (accessed 27/02/11). has drawn fire in his direction.E.g., from Reverend Rod Thomas of Reform on Today, BBC Radio 4, 04/04/07'Church figures have expressed dismay at his comments, which they condemn as a \"deliberate perversion of the Bible\". The Rt Rev Tom Wright, the Bishop of Durham, accused Mr. John of attacking the fundamental message of the Gospel.", "* The Cross and the Caricatures by N. T. Wright—a response to Robert Jenson, Jeffrey John, and the book Pierced for Our Transgressions"]}, {"page": "Gay bishops", "response": ["In 2003, Jeffrey John, at the time Canon Chancellor and Theologian of Southwark Cathedral, was chosen to be the Bishop of Reading (a suffragan of the Bishop of Oxford).  John has been in a relationship with another male priest for many years, though he also says that their relationship is celibate. As a result of the ensuing controversy, however, John withdrew his acceptance of the appointment. He was subsequently appointed Dean of St Albans. John again emerged in the debate over gay bishops in July 2010 following widespread media reports that he was the Crown Nomination Commission's preferred candidate for appointment by the Queen as Bishop of SouthwarkTelegraph Item, Gay cleric in line to become bishop in Church of England, 3 July 2010 though subsequent reports suggested that this was not the case or that his name had been rejected following leaking of the proposal.Telegraph item, Gay cleric blocked from becoming Church of England bishop 7 July 2010", "In 2013, it was announced that the Church of England's House of Bishops had approved plans to allow gay men to become appointed as bishops if they were celibate, including those such as Jeffrey John who are in civil partnerships."]}, {"page": "Graham Dow", "response": ["Dow was one of the rebel bishops who signed a letter against Rowan Williams' decision not to block the appointment of Jeffrey John as Bishop of Reading in 2003.Telegraph – And suspicion begat spite, back-stabbing and schism The other diocesan bishop signatories (referred to, since there were nine, as the Nazgûl) were: Michael Scott-Joynt (Bishop of Winchester), Michael Langrish (Exeter), Michael Nazir-Ali (Rochester), Peter Forster (Chester), James Jones (Liverpool), George Cassidy (Southwell & Nottingham), John Hind (Chichester) and David James (Bradford).Frost's Meditations – Nazir-Ali "]}, {"page": "Martyn Percy", "response": ["Percy is a social thinker, moralist and commentator, with his activism and writings addressing concerns for social justice and equality. Percy has spoken and written about the threat of schism in the Anglican Communion, arguing that churches should embrace the diversity of belief that exists, rather than allowing such divisions to result in separation. In anticipation of the October 2003 Anglican Communion Primates' Meeting, which took place in the wake of the ordination of Gene Robinson as Episcopal Bishop of New Hampshire, the Communion's first openly gay bishop, he wrote of the need for a \"slight loosening of the ties\", to avoid a divorce. Illustrating this, he described Anglicanism as an \"archipelago – a connection of provincial islands that shares doctrinal, liturgical and cultural aspects\", as opposed to being \"one vast, catholic continent.\" He made similar remarks following Jeffrey John's withdrawal as Bishop of Reading, in July 2003, suggesting that the debate on gay rights should instead be shifted towards reflecting on the \"more central gospel themes.\""]}, {"page": "List of gay, lesbian or bisexual people: I–J", "response": ["| Jeffrey John"]}, {"page": "David James (bishop)", "response": ["James became suffragan Bishop of Pontefract in 1998 and then became the diocesan Bishop of Bradford in 2002.Anglican Communion He was one of the rebel bishops who signed a letter against Rowan Williams' decision not to block the appointment of Jeffrey John as Bishop of Reading in 2003. The other diocesan bishop signatories (referred to by their opponents, since there were nine, as the Nazgûl) were: Michael Scott-Joynt (Bishop of Winchester), Michael Langrish (Exeter), Michael Nazir-Ali (Rochester), Peter Forster (Chester), James Jones (Liverpool), George Cassidy (Southwell & Nottingham), Graham Dow (Carlisle) and John Hind (Chichester).Frost's Meditations – Nazir-Ali  James retired on 14 July 2010.The Daily Telegraph Appointments in the Clergy p 32 Issue no 48,058 dated 7 December 2009)"]}]}}