{"wiki_id": "http://www.wikidata.org/entity/Q16873133", "itemLabel": "J. J. Murphy", "itemDescription": "British actor (1928-2014)", "wikipedia_url": "https://en.wikipedia.org/wiki/J._J._Murphy_(actor)", "wikipedia_page": {"main": "James Joseph \"J.J.\" Murphy (7 May 1928 – 8 August 2014) was a Northern Irish film and television actor. He was known for his roles in the films Cal (1984), Angela's Ashes (1999), Mickybo and Me (2004) and Dracula Untold (2014), as well as the Game of Thrones episode \"The House of Black and White\" (2015), but also known for his roles in theatre. He was also featured in The Sparticle Mystery with him being known as \"The Keeper\" in the final series.", "link_mentions": [{"page": "Cal (1984 film)", "response": ["* J. J. Murphy as Man in Library"]}, {"page": "2014 in film", "response": ["| style=\"text-align:center;\"| 8 || J. J. Murphy || style=\"text-align:center;\"| 85 || style=\"text-align:center;\"| Irish || style=\"text-align:center;\"| Actor || "]}, {"page": "2014 in Ireland", "response": ["* 8 August – J. J. Murphy, 86, actor (Cal, Angela's Ashes, Game of Thrones)"]}, {"page": "List of Game of Thrones characters", "response": ["* J. J. Murphy as Denys Mallister (season 5)"]}, {"page": "The Sparticle Mystery", "response": ["| J. J. Murphy || The Keeper || 3 || 3x12-3x13 || The Keeper || The Circle of Perpetual Time "]}, {"page": "2014 in the United Kingdom", "response": ["**J. J. Murphy, 86, actor (Mickybo and Me, Angela's Ashes, Dracula Untold)."]}, {"page": "Game of Thrones (season 5)", "response": ["* J. J. Murphy as Denys Mallister", "Across the Narrow Sea, Enzo Cilenti joins as Yezzan, a Yunkish nobleman and slave trader, while Adewale Akinnuoye-Agbaje was cast as Malko, a slaver, who does not appear in the novels. At Castle Black and beyond the Wall, new cast members include Michael Condron as Bowen Marsh, First Steward of the Night's Watch. J. J. Murphy, who was cast as Night's Watch officer Denys Mallister, died in August 2014 shortly after filming his first scenes; his role was not recast. One role that was recast for season 5 was Ross O'Hennessy as the Lord of Bones. O'Hennessy replaces Edward Dogliani who was last seen in the season 3 premiere \"Valar Dohaeris\". Charles Dance, whose character died in the previous season, returned for one episode to portray Tywin Lannister's corpse.  Isaac Hempstead-Wright (Bran Stark), Kristian Nairn (Hodor) and Ellie Kendrick (Meera Reed) are absent this season because their part in the story has reached the end of A Dance with Dragons."]}, {"page": "Deaths in August 2014", "response": ["*J. J. Murphy, 86, Northern Irish actor (Mickybo and Me, Angela's Ashes, Game of Thrones).Game of Thrones actor JJ Murphy dies just four days into filming TV series"]}, {"page": "J. J. Murphy", "response": ["J. J. Murphy may refer to:", "* J. J. Murphy (politician)", "* J. J. Murphy (actor)"]}, {"page": "List of Irish films of 2014", "response": ["| style=\"text-align:center;\"| 8 || J. J. Murphy || style=\"text-align:center;\"| 85 || style=\"text-align:center;\"| Irish || style=\"text-align:center;\"| Actor || "]}]}}