{"wiki_id": "http://www.wikidata.org/entity/Q1681142", "itemLabel": "James Strachey", "itemDescription": "British psychoanalyst (1887-1967)", "wikipedia_url": "https://en.wikipedia.org/wiki/James_Strachey", "wikipedia_page": {"main": "James Beaumont Strachey (; 26 September 1887, London – 25 April 1967, High Wycombe) was a British psychoanalyst, and, with his wife Alix, a translator of Sigmund Freud into English. He is perhaps best known as the general editor of The Standard Edition of the Complete Psychological Works of Sigmund Freud, \"the international authority\".: 741 ", "link_mentions": [{"page": "Sigmund Freud", "response": ["The Standard Edition of the Complete Psychological Works of Sigmund Freud. Translated from the German under the general editorship of James Strachey, in collaboration with Anna Freud, assisted by Alix Strachey, Alan Tyson, and Angela Richards. 24 volumes, London: Hogarth Press and the Institute of Psycho-Analysis, 1953–1974."]}, {"page": "Bloomsbury Group", "response": ["There were stable marriages and varied and complicated affairs among the individual members. Lytton Strachey and his cousin and lover Duncan GrantKuger, p. 231–232 became close friends of the Stephen sisters, Vanessa Bell and Virginia Woolf. Duncan Grant had affairs with siblings Vanessa Bell and Adrian Stephen, as well as David Garnett, Maynard Keynes, and James Strachey. Clive Bell married Vanessa in 1907, and Leonard Woolf returned from the Ceylon Civil Service to marry Virginia in 1912. Cambridge Apostle friendships brought into the group Desmond MacCarthy, his wife Molly, and E. M. Forster."]}, {"page": "Ernest Jones", "response": ["Jones went on to serve two periods as President of the International Psychoanalytic Association from 1920 to 1924 and 1932 to 1949, where he had significant influence. In 1920 he founded the International Journal of Psychoanalysis, serving as its editor until 1939. The following year he established the International Psychoanalytic Library, which published some 50 books under his editorship. Jones soon obtained from Freud rights to the English translation of his work. In 1924 the first two volumes of Freud's Collected Papers  was published in translations edited by Jones and supervised by Joan Riviere, his former analysand and, at one stage, ardent suitor. After a period in analysis with Freud, Riviere worked with Jones as the translation editor of the International Journal of Psychoanalysis. She then was part of a working group Jones set up to plan and deliver James Strachey's translations for the standard edition of Freud's work.The Standard Edition of the Complete Psychological Works of Sigmund Freud, edited and translated from the German by James Strachey, in collaboration with Anna Freud. Assisted by Alix Strachey and Alan Tyson, 24 volumes. London: Hogarth Press 1955–1974"]}, {"page": "Id, ego and super-ego", "response": ["The id, ego, and super-ego are a set of three concepts in psychoanalytic theory describing distinct, interacting agents in the psychic apparatus (defined in Sigmund Freud's structural model of the psyche). The three agents are theoretical constructs that describe the activities and interactions of the mental life of a person. In the ego psychology model of the psyche, the id is the set of uncoordinated instinctual desires; the super-ego plays the critical and moralizing role; and the ego is the organized, realistic agent that mediates between the instinctual desires of the id and the critical super-ego;Freud, Sigmund. The Standard Edition of the Complete Psychological Works of Sigmund Freud. Vol. XIX (1999) James Strachey, Gen. Ed.  Freud explained that:", "The terms \"id\", \"ego\", and \"super-ego\" are not Freud's own. They are latinisations by his translator James Strachey. Freud himself wrote of \"das Es\", \"das Ich\", and \"das Über-Ich\"—respectively, \"the It\", \"the I\", and \"the Over-I\" (or \"I above\"); thus to the German reader, Freud's original terms are more or less self-explanatory. Freud borrowed the term \"das Es\" from Georg Groddeck, a German physician to whose unconventional ideas Freud was much attracted (Groddeck's translators render the term in English as \"the It\"). The word ego is taken directly from Latin, where it is the nominative of the first person singular personal pronoun and is translated as \"I myself\" to express emphasis.", "* Freud, Sigmund (1923), Das Ich und das Es, Internationaler Psycho-analytischer Verlag, Leipzig, Vienna, and Zurich. English translation, The Ego and the Id, Joan Riviere (trans.), Hogarth Press and Institute of Psycho-analysis, London, UK, 1927. Revised for The Standard Edition of the Complete Psychological Works of Sigmund Freud, James Strachey (ed.), W.W. Norton and Company, New York City, NY, 1961."]}, {"page": "Akhenaten", "response": ["Cyril Aldred, following up earlier arguments of Grafton Elliot Smith and James Strachey, suggested that Akhenaten may have suffered from Frölich's syndrome on the basis of his long jaw and his feminine appearance. However, this is unlikely, because this disorder results in sterility and Akhenaten is known to have fathered numerous children. His children are repeatedly portrayed through years of archaeological and iconographic evidence."]}, {"page": "Lytton Strachey", "response": ["Strachey was born on 1 March 1880 at Stowey House, Clapham Common, London, the fifth son and eleventh child of Lieutenant General Sir Richard Strachey, an officer in the British colonial armed forces, and his second wife, the former Jane Grant, who became a leading supporter of the women's suffrage movement. He was named \"Giles Lytton\" after an early sixteenth-century Gyles Strachey and the first Earl of Lytton, who had been a friend of Richard Strachey's when he was Viceroy of India in the late 1870s. The Earl of Lytton was also Lytton Strachey's godfather.Charles Richard Sanders, Lytton Strachey: His Mind and Art, New Haven: Yale University Press, 1957. The Stracheys had thirteen children in total, ten of whom survived to adulthood, including Lytton's sister Dorothy Strachey and youngest brother, the psychoanalyst, James Strachey.", "* Characters and Commentaries, ed. James Strachey (1933)", "* Spectatorial Essays, ed. James Strachey (1964)"]}, {"page": "Wilhelm Reich", "response": ["He tried to find support among psychoanalysts in the UK so that he could settle there, and was interviewed in London by Ernest Jones, Melanie Klein, Joan Riviere and James Strachey. They decided that he had been \"insufficiently analysed\" and had an unresolved hostility toward Freud.Turner 2011, pp. 154–155. Anna Freud, Freud's daughter—whom Jones had contacted about Reich's desire to relocate to England—wrote in 1938: \"There is a wall somewhere where he stops to understand the other person's point of view and flies off into a world of his own ... He is an unhappy person ... and I am afraid this will end in sickness.\"Danto 2007, p. 270."]}, {"page": "Frank Ramsey (mathematician)", "response": ["Margaret wanted time to consider his proposition and thus began an uncomfortable dance between them, which contributed to Ramsey's depressive moods in early 1924; as a result, he travelled to Vienna for psychoanalysis. Like many of his contemporaries, including his Viennese flatmate and fellow Apostle Lionel Penrose (also in analysis with Siegfried Bernfeld), Ramsey was intellectually interested in psychoanalysis. Ramsey's analyst was Theodor Reik, a disciple of Freud. As one of the justifications for undertaking the therapy, he asserted in a letter to his mother that unconscious impulses might affect even a mathematician's work. While in Vienna, he made a trip to Puchberg in order to visit Wittgenstein, was befriended by the Wittgenstein family and visited A.S. Neill's experimental school four hours from Vienna at Sonntagsberg. In the summer of 1924, he continued his analysis by joining Reik at Dobbiaco (in South Tyrol), where a fellow analysand was Lewis Namier. Ramsey returned to England in October 1924; with John Maynard Keynes's support he became a fellow of King's College, Cambridge. He joined a Psychoanalysis Group in Cambridge with fellow members Arthur Tansley, Lionel Penrose, Harold Jeffreys, John Rickman and James Strachey, the qualification for membership of which was a completed psychoanalysis."]}, {"page": "George Mallory", "response": ["In 1896, Mallory attended Glengorse, a boarding school in Eastbourne on the south coast, having transferred from another preparatory school in West Kirby. At the age of 13, he won a mathematics scholarship to Winchester College. In his final year there, he was introduced to rock climbing and mountaineering by a master, R. L. G. Irving, who took a few people climbing in the Alps each year. In October 1905, Mallory entered Magdalene College, Cambridge, to study history. There, he became good friends with future members of the Bloomsbury Group, including Rupert Brooke, John Maynard Keynes, James Strachey, Lytton Strachey, and Duncan Grant, who took some portraits of Mallory. Among these friends, particularly Lytton Strachey, his letters attest a flirtatious, homoerotic and \"explicitly gay\" friendship. Mallory was a keen oarsman, who rowed for his college."]}, {"page": "Free association (psychology)", "response": ["The psychoanalyst James Strachey (1887-1967) considered free association as 'the first instrument for the scientific examination of the human mind'.James Strachey, \"Sigmund Freud\", in Sigmund Freud, On Sexuality (PFL 7) p. 20"]}, {"page": "Donald Winnicott", "response": ["Winnicott completed his medical studies in 1920, and in 1923, the same year as his marriage to the artist Alice Buxton Winnicott (born Taylor). She was a potter and they married on 7 July 1923 in St Mary's Church, Frensham. Alice had \"severe psychological difficulties\" and Winnicott arranged for her, and his own therapy, to address the difficulties this condition created. He obtained a post as physician at the Paddington Green Children's Hospital in London, where he was to work as a paediatrician and child psychoanalyst for 40 years. In 1923 he began a ten-year psychoanalysis with James Strachey, and in 1927 he began training as an analytic candidate. Strachey discussed Winnicott's case with his wife Alix Strachey, apparently reporting that Winnicott's sex life was affected by his anxieties. Winnicott's second analysis, beginning in 1936, was with Joan Riviere."]}, {"page": "Michael Holroyd", "response": ["*James Strachey"]}, {"page": "Hugh Dalton", "response": ["In 1908, Dalton also made advances at James Strachey, \"waving an immense steaming penis in his face and chuckling softly\", as Brooke reported to James' brother Lytton. In later life, Dalton seem to have refrained from sexual relationships with men, though he kept a fatherly interest in the career of various young men (such as Hugh Gaitskell, Richard Crossman and Tony Crosland, who had been noted for their good looks and had had same-sex experiences at Oxford) and was rather touchy-feely with them."]}, {"page": "The Interpretation of Dreams", "response": ["An abridged version called On Dreams was published in 1901 as part of Lowenfeld and Kurella's Grenzfragen des Nerven und Seelenlebens. It was re-published in 1911 in slightly larger form as a book.Gay, Peter edit. Freud, Sigmund author The Freud Reader WW Norton New York 1989 pages 142-142 On Dreams is also included in the 1953 edition and the second part of Freud's work on dreams, Volume Five, The Interpretation of Dreams II and On Dreams. It follows chapter seven in The Interpretation of Dreams and in this edition, is fifty-three pages in length. There are thirteen chapters in total and Freud directs the reader to The Interpretation of Dreams for further reading throughout On Dreams, in particular, in the final chapter. Immediately after its publication, Freud considered On Dreams as a shortened version of The Interpretation of Dreams. The English translation of On Dreams was first published in 1914 and the second English publication in the James Strachey translation from 1952. Freud investigates the subject of displacement and our inability to recognize our dreams. In chapter VI, page 659, he states: \"It is the process of displacement which is chiefly responsible for our being unable to discover or recognize them in the dream-content\" and he considers the issue of displacement in chapter VIII, page 671 as: \"the most striking of the dream-work.\"", "The first translation from German into English was completed by A. A. Brill, a Freudian psychoanalyst. Years later, an authorized translation by James Strachey was published. The most recent English translation is by Joyce Crick."]}, {"page": "Castration anxiety", "response": ["In Freudian psychoanalysis, castration anxiety (Kastrationsangst) refers to an unconscious fear of penile loss originating during the phallic stage of psychosexual development and lasting a lifetime. According to Freud, when the infantile male becomes aware of differences between male and female genitalia he assumes that the female's penis has been removed and becomes anxious that his penis will be cut off by his rival, the father figure, as punishment for desiring the mother figure.Freud, S. (1954). The Origins Of Psycho-Analysis: Letters To Wilhelm Fliess, Drafts And Notes: 1887-1902. Edited by Marie Bonaparte, Anna Freud, Ernst Kris. Translated by Eric Mosbacher and James Strachey. New York: Basic Books.", "In 19th-century Europe, it was not unheard of for parents to threaten their misbehaving sons with castration or otherwise threaten their genitals. This theme is explored in the story Tupik by French writer Michel Tournier in his collection of stories entitled Le Coq de Bruyère (1978) and is a phenomenon Freud documents several times.Freud, Sigmund. \"The Dissolution of the Oedipus Complex.\" On Sexuality. Vol. 7 of Penguin Freud Library. Trans. James Strachey. Ed. Angela Richards. Harmondsworth: Penguin, 1976. 313-322. In this same period, Dr. Kellogg and others in America and English-speaking countries offered to Victorian parents circumcision and, in grave instances, castration of their boys and girls as a terminal cure and punishment for a wide variety of perceived misbehaviours (such as masturbation), a practice that became widely used at the time."]}, {"page": "Cathexis", "response": ["The Greek term cathexis (κάθεξις) was chosen by James Strachey to render the German term Besetzung in his translation of Sigmund Freud's complete works. Freud himself wrote of \"interest (Besetzung)\", in an early letter to Ernest Jones. Quoted in: "]}, {"page": "Variorum", "response": ["The James Strachey translation of Freud's The Interpretation of Dreams in volumes four and five of The Standard Edition of The Complete Psychological Works of Sigmund Freud collates eight editions."]}, {"page": "Strachey", "response": ["*******James Strachey (1887–1967), son of Richard; psychoanalyst and biographer of Sigmund Freud; husband of psychoanalyst Alix Strachey (1892–1973)"]}, {"page": "Das Ich", "response": ["Das Ich is a German dark wave/gothic-industrial band formed in 1989. The group, fronted by Stefan Ackermann and Bruno Kramm, were one of the prominent founders of and contributors to \"Neue Deutsche Todeskunst\" (New German Death Art) a musical movement in the early 1990s. The band is known for having a classically-inspired gothic-industrial style, for their on-stage theatrics, and their almost exclusive use of German-language lyrics. The German term Das Ich makes reference to the Freudian concept James Strachey translated as \"ego\" ( \"The I\")."]}]}}