{"wiki_id": "http://www.wikidata.org/entity/Q16864471", "itemLabel": "Phil Ryan", "itemDescription": "English musician, writer and entrepreneur", "wikipedia_url": "https://en.wikipedia.org/wiki/Phil_Ryan_(entrepreneur)", "wikipedia_page": {"main": "Phil Ryan is an English musician, writer and entrepreneur. He has toured with The Animals and is co-founder of The Big Issue and The 12 Bar Club.", "link_mentions": [{"page": "12 Bar Club", "response": ["In 1994, the club was expanded and renamed the 12 Bar Club. Offices and a restaurant were added. It was the brainchild of international businessman Lars Ericson and musician Phil Ryan. They approached lease holder Andy Preston, owner of the world-famous Andy's Guitars, and together they formed up to create and launch the club in 1994. The club was run by Ryan, who devised the music policy and booked a host of well-known names including Bert Jansch, whose album Live at the 12 Bar: An Authorised Bootleg was recorded there in 1995, Robyn Hitchcock, Nick Harper, The Albion Band, Steve Jones, Tom Russell, Peter Rowan and the Rowan brothers, Boo Hewerdine, Gordon Giltrap, Jonathan Kalb, Richard Mazda, Suzanne Chawner, Ian Crowther, Vince McCann, Will Kevans. Some of these named artists went on to promote their own nights featuring the best in up and coming artists. Under the guidance of Phil Ryan the club won the Time Out Best Music Venue in 2005, which Ryan collected at Time Out headquarters."]}, {"page": "Vic Briggs", "response": ["In 1992, to the consternation of Eric Burdon, Briggs registered a U.S. trademark of \"The Animals\" band name, and performed under that name with former band members Danny McCulloch and Barry Jenkins.  The band's most notable performance, with Phil Ryan instead of Eric Burdon on lead vocals, was a 1992 performance in Moscow's Red Square, as part of a benefit concert for victims of the Chernobyl Nuclear Disaster."]}, {"page": "Danny McCulloch", "response": ["In 1992, McCulloch joined as the bass player and a vocalist of a reconstituted Animals, including Vic Briggs and drummer Barry Jenkins.Who succeeded John Steel, prior to the formation of the \"New Animals\", and remained with the band until it was dissolved by Eric Burdon. At the time, Briggs asserted that he had a right to call the band \"The Animals\", having trademarked the name in the United States.  With Phil Ryan on lead vocals,Such as on \"House of the Rising Sun\".  McCulloch sang lead vocals on \"When I Was Young\".   instead of Eric Burdon, the band played the first rock concert held in Red Square, Moscow, as part of a benefit concert for the victims of the Chernobyl nuclear disaster.George Varga, Animals reuniting onstage in Moscow . San Diego Union, 27 May 1992, via antionmusic.com.  Retrieved 2017-03-06."]}, {"page": "Phil Ryan", "response": ["Phil Ryan may refer to:", "*Phil Ryan (entrepreneur), English musician and early founder of The Big Issue", "*Phil Ryan (footballer, born 1915) (1915–2014), Australian rules football player and administrator for Hawthorn", "*Phil Ryan (footballer, born 1925) (1925–1982), Australian rules footballer for Collingwood", "*Phil Ryan (footballer, born 1951), Australian rules footballer for North Melbourne", "*Phil Ryan (musician) (1946–2016), Welsh musician", "*Phil Ryan (sheriff) (born 1945), sheriff in Texas"]}]}}