{"wiki_id": "http://www.wikidata.org/entity/Q16849423", "itemLabel": "Stuart Williams", "itemDescription": "British ten-pin bowler", "wikipedia_url": "https://en.wikipedia.org/wiki/Stuart_Williams_(ten-pin_bowling)", "wikipedia_page": {"main": "Stuart Williams (born 28 June 1981 in Ellesmere Port) is an English professional ten-pin bowler who has won titles in nine countries. He is one of the most active touring players in the sport. He is known to his followers by the nickname \"Beef Stu\". While in England, Williams, along with store owner and father Dave, ran MCS Bowling, a pro shop at Chester Megabowl. Williams now resides in Pflugerville, Texas, USA. He is a member of the Roto Grip pro staff.", "link_mentions": [{"page": "Paul Moor", "response": ["Moor is one of the top English bowlers on the European bowling scene along with Stuart Williams and Dominic Barrett."]}, {"page": "Dominic Barrett", "response": ["Barrett won the Weber Cup XIV with Team Europe teammates Mika Koivuniemi, Martin Larsen and Stuart Williams. He captured the 2013 PBA World Championship for his second PBA Tour title and first PBA major.England’s Dom Barrett Wins PBA World Championship Vint, Bill at pba.com on 29 December 2013. He then won the 2013 Qatar Open in Doha, Qatar, which qualified as his third PBA title in addition to a World Bowling Tour title.", "Barrett successfully defended his 2013 Qatar Open championship by winning the event again on 27 November 2014. He defeated Stuart Williams 395–388 over the two-game final in an all-England title match. This was his fourth PBA title.Dom Barrett Repeats as Qatar Open Champion, Defeats Stuart Williams in All-England Title Match Vint, Bill at pba.com on 27 November 2014."]}, {"page": "World Ranking Masters", "response": ["* Stuart Williams", "|Stuart Williams", "| bgcolor=\"gold\"| Stuart Williams", "| bgcolor=\"gold\"| Stuart Williams", "| bgcolor=\"gold\"| Stuart Williams", "| Stuart Williams"]}, {"page": "List of ten-pin bowlers", "response": ["*Stuart Williams"]}, {"page": "European Bowling Tour", "response": ["|Stuart Williams"]}, {"page": "David O'Sullivan (bowler)", "response": ["O'Sullivan made the quarterfinals of the 2007 World Ranking Masters, losing to eventual tournament winner Stuart Williams of England."]}, {"page": "Stuart Williams", "response": ["Stuart Williams is the name of:", "*Stuart Williams (cricketer) (born 1969), West Indian cricketer", "*Stuart Williams (cyclist) (born 1967), New Zealand cyclist", "*Stuart Williams (footballer) (1930–2013), Wales international footballer", "*Stuart Williams (ten-pin bowling)"]}, {"page": "Stuart Williams (Ten-pin Bowling)", "response": ["#REDIRECT Stuart Williams (ten-pin bowling) "]}, {"page": "PBA Bowling Tour: 2009–10 season", "response": ["* Stuart Williams"]}, {"page": "PBA Bowling Tour: 2011–12 season", "response": ["* Stuart Williams won his first PBA title in the Bayer Viper Open.  In doing so, he became the first player from England to win a title on the standard PBA Tour in North America. Shortly after, fellow Englishman Dom Barrett won the Scorpion Open at the same event.", "| Stuart Williams (1)"]}, {"page": "Danielle McEwan", "response": ["McEwan won the PBA International-WBT Thailand tournament on September 28, 2018, topping England's Stuart Williams in a two-game final to win ฿1,000,000 ($31,908 USD). Because McEwan accepted the eight pins per game handicap offered to female competitors, she was not credited with a PBA or WBT title."]}, {"page": "E. J. Tackett", "response": ["| Stuart Williams"]}, {"page": "PBA Bowling Tour: 2018 season", "response": ["| Stuart Williams, England (2)"]}, {"page": "Storm Products", "response": ["*Stuart Williams"]}, {"page": "PBA World Series of Bowling", "response": ["| Stuart Williams, England"]}]}}