{"wiki_id": "http://www.wikidata.org/entity/Q16857813", "itemLabel": "John Le Keux", "itemDescription": "English engraver", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Le_Keux", "wikipedia_page": {"main": "John Le Keux (4 June 1783 – 2 April 1846) was a British engraver.\n\n", "link_mentions": [{"page": "Bunhill Fields", "response": ["* John Le Keux (1783–1846), English engraver"]}, {"page": "Thomas Moule", "response": ["* with John Preston Neale and John Le Keux"]}, {"page": "Samuel Pegge (the younger)", "response": ["His son, Christopher, was a well known doctor in Oxford and also delivered lectures in mineralogy at Oxford University, and in 1800, the university purchased a cabinet of minerals from him which was to be part of the establishment of that subject at the university.Memorials of Oxford, by James Ingram, John Le Keux, Frederick Mackenzie, pub. 1837 accessed on line October 2007"]}, {"page": "William Levett (dean of Bristol)", "response": ["In 1681 he was named Principal of Magdalen Hall at Oxford,Memorials of Oxford, James Ingram, John Le Keux, Frederick Mackenzie, John Henry Parker (pub.), Oxford, 1837 succeeding James Hyde. Hyde, who was the eleventh son of Sir Laurence Hyde of Heale, near Salisbury, was a barrister and a physician as well as Member of Parliament. Hyde himself had been nominated Principal by his relation, the Earl of Clarendon, who was Chancellor of the university, and he took office in 1662. On his death in 1681, the Principal's slot passed to Dr. Levett, another favourite of the Hydes.James Hyde, Physician of Oxford, Oxford Medical Men, headington.org.uk"]}, {"page": "James Ingram (academic)", "response": ["His academic interests in Anglo-Saxon and archaeology meant that he had little time to attend to the business of the College or University. His publications included an edition of the Anglo-Saxon Chronicle (1823), an edition of Quintilian (1809) and Memorials of Oxford (3 volumes, 1832 to 1837) with 100 illustrations by John Le Keux. He died at Trinity College on 4 September 1850, and left his books, pictures and coins to the College and Oxford University."]}, {"page": "Harry Longueville Jones", "response": ["He was developing his interests in Welsh topography and his talents as an artist while still an undergraduate at Cambridge. In 1829, the year after he graduated, he had published “Illustrations of the Natural Scenery of the Snowdonian Mountains: Accompanied by a Description, Topographical and Historical of the County of Caernarvon”  This is a very scarce folio or elephant folio volume,  published by Charles Tilt, with text and fifteen large lithograph prints of Snowdonia.  A later publishing venture in 1841, also produced by Charles Tilt (now Tilt and Bogue Publishers) was when  Jones together with Thomas Wright published the impressive and detailed two volume Memorials of Cambridge, with Historical and Descriptive Accounts. He and Wright prepared the text and he may have submitted some of the illustrations, but the views of the Cambridge Colleges were taken from a number of sources and engraved by John Le Keux.It is presumed that Wright and Jones prepared the text for the \"Memorials\" some years earlier, but as explained in Le Keux's introduction to Volume 1, the preparation of the illustrations were delayed by Le Keux's illness. Le Keux died in 1846", "*Memorials of Cambridge, with Historical and Descriptive Accounts, 2 vols., 1841. This was written by him and Thomas Wright, and published by the engraver John Le Keux."]}, {"page": "John Preston Neale", "response": ["He also in 1824–5 undertook, in collaboration with John Le Keux, the engraver, the publication of Views of the most interesting Collegiate and Parochial Churches in Great Britain, but the work was discontinued after the issue of the second volume. Besides these works he published Six Views of Blenheim, Oxfordshire, (1823); Graphical Illustrations of Fonthill Abbey, (1824); and An Account of the Deep-Dene in Surrey, the seat of Thomas Hope, Esq., (1826). Many other works contain his pen and pencil illustrations."]}, {"page": "Edward Hughes Ball Hughes", "response": ["Many stories were told about Hughes' origins and family, most of them untrue.For example, Gronow, who knew Ball at Eton, thought that Admiral Hughes was his uncle. There was also a rumor that he was the son of a slopseller – see Modern English Biography, Frederic Boase, Truro, Netherington and Worth, 1892, p. 147 His grandmother Ruth (c. 1731–1800), after her first husband, a Mr. Ball, had died, married Admiral Edward Hughes. Admiral Hughes advanced the career of his wife's eldest son, Captain Henry Ball (c. 1754–1792), who served under him as captain of his flagship Superb in India, but Henry predeceased him.Henry Ball obit notice, Aug. 9, 1792 Admiral Hughes died in 1794 without issue, and Edward Hughes Ball, son of Ruth's second son David Ball (c. 1760–1798),Views of the most interesting collegiate and parochial churches in Great Britain..., 1824, John Preston Neale with John Le Keux, entry for \"St. Mary and All Saints, Lambourne, Essex\" inherited the Hughes money (40,000 pounds a year, an enormous fortune) upon turning 21; he adopted the Hughes last name at that time.Records of the Chicheley Plowdens, Walter Chicheley-Plowden, London, 1914 Ball Hughes' mother's name was Sarah; she later remarried, to a man named Thomas Johnson.Reports of Cases Argued and Determined in the High Court of Chancery During the Time of Lord Chancellor Eldon, Volume I, Francis Vesey and John Beames, London, Reed and Hunter, 1813, p. 292"]}, {"page": "Jonathan Anderson Bell", "response": ["Thirty of the engravings in John Le Keux's Memorials of Cambridge are from Bell's drawings. His Dryburgh Abbey was engraved by William Miller. As a watercolour painter, he was known for landscapes and marine scenes, Italian subjects, and still lifes."]}, {"page": "Charles Wild", "response": ["Travels on the continent resulted in Wild's Examples of the Ecclesiastical Architecture of the Middle Ages chiefly in France, and a volume published in 1833 of sketches in Belgium, Germany, and France. A miscellaneous collection, entitled Twelve Beautiful Specimens, from the Cathedrals of England, lacked a date. Architectural Grandeur appeared in 1837, consisting of continental sketches that were etched by John Le Keux and others."]}, {"page": "John le Keux", "response": ["#REDIRECT John Le Keux"]}, {"page": "John Henry Le Keux", "response": ["The son of John Le Keux, he was born in Argyll Street, Euston Road, London, on 23 March 1812, and studied under James Basire III. He then worked for a time as assistant to his father."]}, {"page": "John Lingard of Pentonville", "response": ["*Sarah Sophia Lingard (24 March 1794 – 1871) Wife of English Engraver John Le Keux"]}, {"page": "William Gott (industrialist)", "response": ["Gott Collection at Hepworth Gallery (36).JPG|Former Leeds General Infirmary building, by John Le Keux, after Thomas Taylor, early 19th century"]}]}}