{"wiki_id": "http://www.wikidata.org/entity/Q16832504", "itemLabel": "Alfred Klein", "itemDescription": "British-American stage actor (1861-1904)", "wikipedia_url": "https://en.wikipedia.org/wiki/Alfred_Klein", "wikipedia_page": {"main": "Alfred Asher Klein (May 12, 1861 – February 21, 1904) was an English-born stage actor, singer and comedian who appeared in operettas and musical theatre in America in the late 19th century.", "link_mentions": [{"page": "Little Lord Fauntleroy", "response": ["* Wilkins, a Groom – Alfred Klein"]}, {"page": "El Capitan (operetta)", "response": ["El Capitan was first produced at the Tremont Theatre in Boston, beginning on April 13, 1896.  After this tryout, it transferred to the old Broadway Theatre on 41st Street in New York on April 20, 1896, where it ran for 112 performances, starring DeWolf Hopper, Edna Wallace Hopper, John Parr, and Alfred Klein.Hischak, Thomas S. El Capitan, The Oxford Companion to the American Musical: Theatre, Film, and Television, Oxford University Press (2008), pp. 222–223 0195335333 It then toured almost continuously for four years in the United States and Canada and was quickly revived on Broadway.  It was produced at the Lyric Theatre in London beginning on July 10, 1899, where it ran for 140 performances.El Capitan, The Guide to Light Opera and Operetta, accessed December 4, 2015 Thereafter, the operetta was produced numerous times internationally and remained popular for some time.  Occasional modern performances continue.  For example, Lake George Opera gave a production in 2009, and Ohio Light Opera presented and recorded the work during the summer of 2010.\"John Philip Sousa: El Capitan\", Amazon.com, accessed December 4, 2012", "*Senor Amabile Pozzo, Chamberlain of Peru (tenor) – Alfred Klein"]}, {"page": "Wang (musical)", "response": ["Wang premiered at the now-demolished Broadway Theatre,Broadway Theatre ibdb.com New York City, on May 4, 1891 and closed on October 3, 1891 after 151 performances. The cast featured Helen Beresford as Nannette, Della Fox as Mataya, DeWolf Hopper as Wang, Samuel Reed as Colonel Fracasse, Alfred Klein as Pepat, and Marion Singer as La Veuve Frimousse. A full-scale imitation elephant was built by Edward Siedle for Hopper to ride on during \"The Man With an Elephant On His Hands.\"\"Edward Siedle Dies Opera Stage Ruler\", The New York Times, March 31, 1925, p. 19"]}, {"page": "Ezra Kendall", "response": ["He later toured in Lillian Cleves' Grump, Elliott Barnes' Dr. Clyde, Wallack and Hinds' Criterion -Comedy Company and Edward (\"Teddy\") Byron's, Summer Boarders. Around 1882 Kendall organized a minstrel company with Horace Johnson, which lasted a short period, and next partnered with comedian Alfred Klein, in an act that collapsed after one week. Kendall later starred in the original Muggs' Landing and in early 1884 scored a hit in Wanted, a Partner with a run that lasted until late spring.  Over the summer of 1884 he worked as an advance agent for a minstrel show before beginning the 1884–1885 season performing with William A. Mestayer's company in A Box of Matches."]}, {"page": "The Rajah (play)", "response": ["*Buttons ... Alfred Klein (Klein had to fall into a \"brook\" of water in the third act)"]}, {"page": "The Charlatan (operetta)", "response": ["* Alfred Klein as Jelikoff"]}]}}