{"wiki_id": "http://www.wikidata.org/entity/Q16800769", "itemLabel": "Robert Hibbert", "itemDescription": "English cricketer (1812-1833)", "wikipedia_url": "https://en.wikipedia.org/wiki/Robert_Hibbert_(cricketer)", "wikipedia_page": {"main": "Robert Hibbert (25 October 1812 – 18 December 1833) was an English cricketer with amateur status who was active in 1832. He was born in Cambridge and died in Madeira. He made his first-class debut in 1832 and appeared in two matches as an unknown handedness batsman whose bowling style is unknown, playing for Cambridge University Cricket Club. He scored ten runs with a highest score of 5 and took two wickets. He was educated at Eton and King's College, Cambridge.", "link_mentions": [{"page": "Hibbert", "response": ["This surname appears to have been first noted in Cheshire, England, where they held a family seat from very early times.  From England the surname Hibbert further spread to the Dutch, Welsh, and Irish. The first immigrant to the Americas with this surname appears to be Robert Hibbert, who arrived in Salem, Massachusetts, in 1636. The most people with this surname live in the United States where the most individuals with this surname can be found in New York and Pennsylvania. Globally the country with the highest concentration of individuals with this surname (by percent of population, 2014) is Jamaica where 0.13% of the population carries the name and it is ranked number 125.", "* Robert Hibbert (1717-1784), (1717–1784), West Indian merchant and Mancunian cotton manufacturer", "* Robert Hibbert (Anti-Trinitarian) (1769–1849), Jamaican merchant and financier, established the Hibbert Lectures", "* Robert Hibbert (cricketer) (1812–1833), English cricketer"]}, {"page": "List of English cricketers (1826–1840)", "response": ["|Robert Hibbert"]}, {"page": "Robert Hibbert", "response": ["Robert Hibbert may refer to:", "* Robert Hibbert (1717–1784), West Indies merchant and cotton manufacturer", "* Robert Hibbert (Anti-Trinitarian) (1770–1849), his nephew, founder of the Hibbert Trust", "* Robert Hibbert (cricketer) (1812–1833), English cricketer", "* Robert Hibbert (merchant) (1750–1835), English merchant in Kingston, Jamaica"]}]}}