{"wiki_id": "http://www.wikidata.org/entity/Q16859151", "itemLabel": "Charles Taylor", "itemDescription": "British engraver, born 1756", "wikipedia_url": "https://en.wikipedia.org/wiki/Charles_Taylor_(engraver)", "wikipedia_page": {"main": "Charles Taylor (1756–1823) was an English engraver, known also as a man of letters and biblical scholar.\n\n", "link_mentions": [{"page": "Hebron", "response": ["| (h = households), Augustin Calmet, Charles Taylor, Edward Robinson"]}, {"page": "Bunhill Fields", "response": ["* Charles Taylor (1756–1823), engraver and biblical scholar"]}, {"page": "Charles Taylor", "response": ["Charles Taylor most often refers to:", "*Charles Taylor (Liberian politician) (born 1948), warlord and 22nd President of Liberia", "*Charles Taylor (philosopher) (born 1931), Canadian philosopher and social theorist", "*Charles Taylor (actor), American actor", "*Charles Taylor (Conservative politician) (1910–1989), English politician and MP for Eastbourne", "*Charles Taylor (MP for Totnes) (1693–1766), English politician", "*Charles Taylor (Queensland politician) (1861–1944), member of the Queensland Legislative Assembly", "*Charles Taylor (Hebraist) (1840–1908), British Hebraist", "*Charles Taylor (physicist) (1922–2002), British physicist", "*Charles Taylor (cricketer, born 1816) (1816–1869), English cricketer", "*Charles Taylor (cricketer, born 1881) (1881–1960), English cricketer", "*Charles Taylor (cricketer, born 1966), English former cricketer", "*Charles Taylor (rugby union) (1863–1915), Welsh rugby union international player", "*Charles McArther Emmanuel (born 1978), also known as Chuckie Taylor, Liberian paramilitary leader and son of Liberian president Charles Taylor", "*Charles Taylor (calico printer and dyer) (died 1816), English businessman, pioneer of textiles bleaching with chlorine", "*Charles Taylor (cavalryman) (1840–1899), American cavalryman", "*Charles Taylor (engraver) (1756–1823), English engraver", "*Charles Taylor (priest) (born 1953), English Anglican priest", "*Charles Taylor Jr. (born 1943), American author", "* Myron Charles Taylor (1874–1959), American industrialist and diplomat"]}, {"page": "Onycha", "response": ["of ceramic dishes used in the preparation of kyphi, it appears that labdanum mixed with benzoin was an important part of the kyphi recipe. It was also part of the formula written about by Nostradamus who said it made “the most supreme perfume, and the longest-lasting that can be made anywhere in the world” and that it acted as an air purifier against disease.Nostradamus, Traité des fardemens et confitures, Part 1 Chapter XI It is possible that onycha was this mix of labdanum and Styrax benzoin. Styrax (referred to as storax in antiquity) is mentioned alongside of onycha in Eccesiasticus 24:15 when alluding to the sacred incense. Either onycha and styrax were originally mixed together or styrax was treated with labdanum or by the time of the first temple period a fifth ingredient was added to the ketoret.Taylor's edition of Calmet's great dictionary of the Holy Bible, by Augustin Calmet, Charles Taylor, Edward Wells Stacte may have been light myrrh treated with benzoin."]}, {"page": "Mamzer", "response": ["The term occurs twice in the Hebrew Bible. The first time is  (23:2 in non-Hebrew versions). The Septuagint translates the term mamzer as son \"of a prostitute\" (Greek: ),Deuteronomy 23:2-4, LXX and the Latin Vulgate translates it as  (\"born of a prostitute\").Augustin Calmet, Dictionary of the Holy Bible 1837 English edition p. 151 Charles Taylor, Edward Robinson editors: \"But the Vulgate, the LXX, and the authors of the canon law, take the Hebrew mamzer, (Deut xxiii. 2.) for the child of a prostitute; while some interpreters take it for a generic term, which signifies illegitimate children\" In English, it is translated as \"bastard\"."]}, {"page": "Ann Taylor (poet)", "response": ["Isaac, brother of Ann and Jane, wrote as a theologian, but also as the inventor of a patent beer tap. Their elder brother Charles Taylor edited The Literary Panorama, for which he wrote on topics from art to politics, and produced anonymously a massive annotated translation of Augustin Calmet's Dictionary of the Bible. Their youngest brother Josiah was a publisher, chiefly of works on architecture and design."]}, {"page": "Stacte", "response": ["The book of Ecclesiasticus lists storax as one of the ingredients when alluding to the sacred incense of the biblical tabernacle,Ecclesiasticus 24:15 speaking of \"a pleasant odour like the best myrrh, as galbanum, and onyx, and sweet storax, [in antiquity Styrax was referred to as Storax] and as the fume of frankincense in the tabernacle\". Either myrrh was treated with storax or by the time of the first temple period a fifth ingredient was added to the ketoret.Taylor's edition of Calmet's great dictionary of the Holy Bible, by Augustin Calmet, Charles Taylor, Edward Wells Myrrh may have been treated with storax or storax oil to further enhance the fragrance.\"Year-Book of Pharmacy, comprising abstracts of papers relating to pharmacy, materia medica and chemistry contributed to British and foreign journals with Transactions of the British Pharmaceutical Conference,\" J. C. C. PAYNE, J.P., Pn.C, President, Belfast Frederic Charles Cook's commentary on Exodus 30:34 says that it seems by no means unlikely that benzoin was part of the incense of Exodus 30.The Holy Bible, According to the Authorized Version (A.D. 1611): pt. I, By Frederic Charles Cook For centuries, myrrh has been scented with Styrax benzoin, particularly in the Middle East, to scent private homes and places of worship.http://www.cookingwiththebible.com/reader/Default.aspx/GR3410-4252/lore/ Myrrh treated with Styrax benzoin exudes qualities similar to that of opobalsamum (Mecca myrrh)."]}, {"page": "List of Bible dictionaries", "response": ["|Anonymous, Charles Taylor"]}, {"page": "Robert Pollard (engraver)", "response": ["In October 1836, as the last surviving member, Pollard gave the charter, books, and papers of the Incorporated Society to the Royal Academy. They had been passed to him in 1808 by Charles Taylor."]}, {"page": "Charles Taylor (1756–1823)", "response": ["#REDIRECT Charles Taylor (engraver)"]}, {"page": "Charles Taylor (1756-1823)", "response": ["#REDIRECT Charles Taylor (engraver)"]}, {"page": "Helen Taylor (writer)", "response": ["Helen Taylor was born in 1818, probably in London, to Elizabeth Venn, first wife of Martin Taylor (1788–1867), of Ongar, Essex; he was the son of Isaac Taylor, an engraver, some-time nonconformist pastor and, like Helen, a writer of children's books; his wife Ann was also an author. Her great-grandfather Isaac Taylor was also an engraver; her aunts Jane Taylor, who wrote the words to the song \"Twinkle, Twinkle, Little Star\", and Ann Taylor were both published poets. Other literary family members include her great-uncle Charles Taylor, and her uncle the novelist Jefferys Taylor."]}]}}