{"wiki_id": "http://www.wikidata.org/entity/Q16847811", "itemLabel": "Kelly Sumner", "itemDescription": "British businessman", "wikipedia_url": "https://en.wikipedia.org/wiki/Kelly_Sumner", "wikipedia_page": {"main": "Kelly Sumner (born 29 April 1961), is a director of ArBa Developments, chairman of Reactional Music and chairman of SonicData. Sumner has run two NASDAQ listed companies. He has 40 years experience in hardware and software, starting as a trainee electronics engineer at Commodore in 1979. He progressed up the corporate ladder becoming managing director of Commodore in the UK.From hardware he moved into entertainment software, joining US based Nintendo and Sega publisher Gametek as European MD before becoming CEO. Sumner merged Gametek into the fledgling publisher Take Two shortly thereafter. As CEO he took the company to annual sales of $1 billion, investing in the creation of amongst others, Rockstar Games, launching products such as Grand Theft Auto and delivering a four-fold increase in the share price.After Take Two, Sumner became CEO of RedOctane fronting the commercial development of Guitar Hero, the video game that went on to become a $1 billion franchise. He sold RedOctane to Activision in 2006 for $160 million.More recently Sumner has been investing in early stage tech companies. During this period he has been chairman of Intent Media, which was sold to Newbay Capital; and Mediatonic (Fall Guys) which was sold to Synova Capital, and a board director of the cloud CRM company, TPoint, which was sold to New York-based private equity company Aquiline Capital Partners.He is currently a director of ArBa Developments, chairman of Reactional Music, and chairman of the intelligent content tech start-up, Sonic Data Limited.\nSonicData's mission is to enable, understand and track all the world's music and audio content from creation to consumption. Its patented SonicKey™ enables all audio in the world to be identifiable, referenceable and trackable. SonicKey can be easily integrated into both software and hardware. It has multiple commercial applications in music, social media, advertising, TV, streaming platforms, games, voice and news across all platforms, places, media and devices.\nSumner is also a former vice president of Chelsea Football Club. He resides in Weybridge, Surrey with his wife, Kirsteen.\nAppeared as a contestant on the videogame show GamesMaster (Series 2 Episode 12). Winning the Golden Joystick by completing his challenge on The Humans on the Amiga.", "link_mentions": [{"page": "Sumner (surname)", "response": ["* Kelly Sumner (born 1961), British businessman"]}, {"page": "Mediatonic", "response": ["In July 2009, Mediatonic opened a studio in Brighton to act as a digital media agency, later spun out into a company named Graphite. Mediatonic received funding from entrepreneurs Kelly Sumner, Ian Livingstone and Geoff Heath in April 2010, and from Frog Capital in January 2012. Pete Hickman, a former executive producer for Eidos Interactive, joined Mediatonic as its head of production in July 2011. Planning to double its 50-strong headcount, Mediatonic moved its London headquarters to Soho in May 2012. Mediatonic opened a Brighton development studio that October. According to Bailey, Mediatonic began giving original games and work-for-hire projects equal weight and the company grew as a result. It later branched out into publishing, opening The Irregular Corporation as a sister company in December 2015."]}]}}