{"wiki_id": "http://www.wikidata.org/entity/Q1680270", "itemLabel": "James Dean Bradfield", "itemDescription": "Welsh musician, lead singer and guitarist of the Manic Street Preachers", "wikipedia_url": "https://en.wikipedia.org/wiki/James_Dean_Bradfield", "wikipedia_page": {"main": "James Dean Bradfield (born 21 February 1969) is a Welsh singer-songwriter, musician and record producer. He is known for being the lead vocalist and guitarist for the Welsh alternative rock band Manic Street Preachers.", "link_mentions": [{"page": "February 21", "response": ["*1969 – James Dean Bradfield, Welsh singer-songwriter and guitarist"]}, {"page": "Kylie Minogue", "response": ["By 1997, Minogue was in a relationship with French photographer Stéphane Sednaoui, who encouraged her to develop her creativity.Baker and Minogue, pp. 107–112 Inspired by a mutual appreciation of Japanese culture, they created a visual combination of \"geisha and manga superheroine\" for the photographs taken for Minogue's sixth album Impossible Princess and the video for \"German Bold Italic\", Minogue's collaboration with Towa Tei.Baker and Minogue, pp. 108–109 She drew inspiration from the music of artists such as Shirley Manson and Garbage, Björk, Tricky and U2, and Japanese pop musicians such as Pizzicato Five and Towa Tei.Baker and Minogue, p. 108 The album featured collaborations with musicians including James Dean Bradfield and Sean Moore of the Manic Street Preachers. Impossible Princess garnered some negative reviews upon its release in 1997, but would be praised as Minogue's most personal and best work in retrospective reviews. In 2003, Slant Magazine's Sal Cinquemani called it a \"deeply personal effort\" and \"Minogue's best album to date\", while Evan Sawdey, from PopMatters, described Impossible Princess as \"one of the most crazed, damn-near perfect dance-pop albums ever created\" in a 2008 review. Mostly a dance album, Minogue countered suggestions that she was trying to become an indie artist."]}, {"page": "Public Enemy", "response": ["The Manic Street Preachers track \"Repeat (Stars And Stripes)\" is a remix of the band's own anti-monarchy tirade by Public Enemy production team The Bomb Squad of whom James Dean Bradfield and Richey Edwards were big fans. The song samples \"Countdown to Armageddon\" from It Takes a Nation of Millions to Hold Us Back. The band had previously sampled Public Enemy on their 1991 single Motown Junk."]}, {"page": "Rickenbacker", "response": ["Rickenbacker twelve-string guitars were favoured by George Harrison of the Beatles, Roger McGuinn of the Byrds, Pete Townshend of the Who, and Tom Petty. Players of the six-string include John Lennon of the Beatles, John Fogerty of Creedence Clearwater Revival, Paul Weller of the Jam, John Kay of Steppenwolf, Peter Buck of R.E.M., Johnny Marr of the Smiths, and Susanna Hoffs of the Bangles. Players who have used Rickenbacker basses include Paul McCartney of the Beatles, Lemmy Kilmister of Motörhead, Cliff Burton of Metallica, Roger Glover and Glenn Hughes of Deep Purple, Paul Wilson of Snow Patrol, Bruce Foxton of the Jam, Roger Waters of Pink Floyd, James Dean Bradfield of Manic Street Preachers, Phil Lynott of Thin Lizzy, Chris Squire of Yes, Geddy Lee of Rush, Al Cisneros of Sleep and Om, Paul D'Amour of Tool, and Rick James and Kevin Parker of Tame Impala, Dave Strait Slow Death"]}, {"page": "The Chemical Brothers", "response": ["In October 1994, the Dust Brothers became resident DJs at the small, but influential Heavenly Sunday Social Club at the Albany pub in London's Great Portland Street. Noel Gallagher, Paul Weller, James Dean Bradfield, and Tim Burgess were regular visitors. The Dust Brothers were subsequently asked to remix tracks by Manic Street Preachers and the Charlatans, plus Primal Scream's \"Jailbird\" and the Prodigy's \"Voodoo People\". These two remixes received television exposure, being playlisted by MTV Europe's \"The Party Zone\" in 1995. "]}, {"page": "1969", "response": ["** James Dean Bradfield, Welsh singer-songwriter"]}, {"page": "List of Welsh people", "response": ["*James Dean Bradfield (born 1969), guitarist and lead singer (Manic Street Preachers)"]}, {"page": "Nico", "response": ["Several concerts to honour Nico's career were organized over the years with multiple singers to revisit her repertoire. In 1981 Texas punk band Really Red released an original song in tribute to Nico. In 2005, alternative rock band Anberlin released their second studio album, Never Take Friendship Personal, which includes the song \"Dance, Dance Christa Päffgen,\" inspired by Nico, whose given name was Christa Päffgen. The song references her struggle with drugs and unrelated death. Two Nico tribute concerts took place in Europe in the autumn of 2008 to commemorate the 70th anniversary of Nico's birth and the 20th anniversary of her death. On 11 October 2008, John Cale, James Dean Bradfield (of Manic Street Preachers), Fyfe Dangerfield of the Guillemots, Mark Linkous (of Sparklehorse), Peter Murphy (of Bauhaus), Lisa Gerrard of Dead Can Dance and Mark Lanegan appeared on stage at the Royal Festival Hall in London. On 17 October 2008 at the Volksbuehne in Berlin, Nico's ex-boyfriend Lutz Ulbrich, who was her musical collaborator in the late 1970s, presented another tribute concert, which featured Marianne Rosenberg, Soap&Skin, Marianne Enzensberger and James Young, the keyboardist from The Faction, Nico's last band."]}, {"page": "Víctor Jara", "response": ["* Even in Exile by James Dean Bradfield (2020)", "In 2007, a fishing schooner built in 1917 in Denmark was renamed after the singer-songwriter. He sails at social and cultural events, and when he's not on the high seas he's at the museum in the port of Lübeck, Germany. The title song on Rory McLeod's album Angry Love is about Jara. In a list prepared by the renowned American magazine Rolling Stone, published on June 3, 2013, Víctor Jara is named as one of the \"15 Rock & Roll Rebels\", being the only Latin American to integrate the list. In 2020, James Dean Bradfield of Manic Street Preachers released a concept album about Victor Jara called 'Even In Exile', that album was was rated 4 out of 5 stars by The Guardian. On September 7, 2021, the Municipality of Estación Central approved the name change of \"Avenida Ecuador\" to \"Avenida Víctor Jara\"."]}, {"page": "Jacques Brel", "response": ["Jacques Romain Georges Brel (, ; 8 April 1929 – 9 October 1978) was a Belgian singer, songwriter, actor and director who composed and performed literate, thoughtful, and theatrical songs that generated a large, devoted following—initially in Belgium and France, later throughout the world. He is considered a master of the modern chanson. Although he recorded most of his songs in French and occasionally in Dutch, he became an influence on English-speaking songwriters and performers, such as Scott Walker, David Bowie, Alex Harvey, Marc Almond, Neil Hannon, and Rod McKuen. English translations of his songs were recorded by many performers, including Bowie, Walker, Ray Charles, Judy Collins, John Denver, The Kingston Trio, Nina Simone, Shirley Bassey, James Dean Bradfield, Frank Sinatra, and Andy Williams.", "* James Dean Bradfield"]}, {"page": "The Best... Album in the World...Ever!", "response": ["#808 State and James Dean Bradfield – \"Lopez\""]}, {"page": "Dafydd Ieuan", "response": ["In 2006, Ieuan played drums on James Dean Bradfield's first solo album The Great Western. Ieuan produced and drummed on tracks on the forthcoming debut album from Gulp (band) with Super Furry Animals bandmate Guto Pryce."]}, {"page": "Gruff Rhys", "response": ["On 17 December 2011, Rhys joined Manic Street Preachers on stage during the band's 38 song A Night of National Treasures one-off live event at the O2 Arena in London to provide the lead vocals for the song Let Robeson Sing. Introducing Rhys to the stage, lead singer James Dean Bradfield explained that Rhys had been set to perform the song at the band's 2001 performance in Havana, Cuba but circumstances had prevented this from happening."]}, {"page": "1969 in music", "response": ["*February 21 – James Dean Bradfield (Manic Street Preachers)"]}, {"page": "Manic Street Preachers", "response": ["Manic Street Preachers, also known as the Manics, are a Welsh rock band formed in Blackwood in 1986. The band consists of cousins James Dean Bradfield (lead vocals, lead guitar) and Sean Moore (drums, percussion, soundscapes), plus Nicky Wire (bass guitar, lyrics). They form a key part of the 1990s Welsh Cool Cymru cultural movement.", "thumb|200px|right|Manic's James Dean Bradfield in Chicago circa 1992", "The band have described Gold Against the Soul as their least favourite album and the period surrounding the album as being the most unfocused of their career. The band's vocalist and guitarist James Dean Bradfield has said \"All we wanted to do was go under the corporate wing. We thought we could ignore it but you do get affected.\"", "Edwards disappeared on 1 February 1995, on the day when he and James Dean Bradfield were due to fly to the US on a promotional tour. In the two weeks before his disappearance, Edwards withdrew £200 a day from his bank account, which totalled £2,800 by the day of the scheduled flight. He checked out of the Embassy Hotel in Bayswater Road, London, at seven in the morning, and then drove to his apartment in Cardiff, Wales. In the two weeks that followed he was apparently spotted in the Newport passport office, and the Newport bus station. On 7 February, a taxi driver from Newport supposedly picked up Edwards from the King's Hotel in Newport, and drove him around the valleys, including Blackwood (Edwards' home as a child). The passenger got off at the Severn View service station near Aust and paid the £68 fare in cash.", "James Dean Bradfield later recalled that the lyric had been a fusion of two sets of lyrics-\"Design for Life\" and \"Pure Motive\"-sent to him from Wales by bassist Nicky Wire, while he was living in Shepherd's Bush. The music was written \"in about ten minutes\" and Bradfield felt a sense of euphoria with the result. The song was credited with having \"rescued the band\" from the despair felt after the disappearance of Edwards, with Wire describing the song as \"a bolt of light from a severely dark place\".Archived at Ghostarchive and the Wayback Machine:  The album was shortlisted for the 1996 Mercury Prize award for best album and won the band two Brit Awards for Best British Band and Best British Album, as well as yielding the hit singles \"Australia\", \"Everything Must Go\" and \"Kevin Carter\".", "Several tracks refer to Edwards' time in a couple of hospitals in 1994. Among them is \"She Bathed Herself in a Bath of Bleach\", of which James Dean Bradfield said to the NME: \"There're some people he met when he was in one of the two places having treatment and I think he just digested other people's stories and experiences.\" The final track, \"William's Last Words\", has been compared to a suicide note, and although Nicky Wire rejects this suggestion, Bradfield observes, \"you can draw some pretty obvious conclusions from the lyrics.\" Alt URL Wire, who admitted finding the task of editing this song \"pretty choking\", eventually composed the music and sang lead vocals after Bradfield found himself unsuited to the task.", "On 1 June 2010, the band announced on their homepage that a new album called Postcards from a Young Man would be released on 20 September. James Dean Bradfield said that the album would be an unashamedly pop-orientated affair, following 2009's Journal for Plague Lovers. \"We're going for big radio hits on this one\", he told NME. \"It isn't a follow-up to Journal for Plague Lovers. It's one last shot at mass communication.\"", "Also, if the Deluxe edition was purchased from the London record store \"Rough Trade\", then alongside the £20 purchase came a free ticket to see a showing of the CABD film, followed by an acoustic gig with James Dean Bradfield on 6 November.", "James Dean Bradfield and Sean Moore in November 2015 did a charity hike in Patagonia, Nicky Wire did not participate in the event, the band said: \"In November 2015 we will be walking in the footsteps of our Welsh ancestors when we will be part of the Velindre group of 50 people celebrating the 150th anniversary of Welsh settlers arriving in Patagonia with a challenging six-day trek.\"", "On the other hand, \"Distant Colours\" was written by James Dean Bradfield, rather than Nicky Wire, and inspired by disenchantment and Nye Bevan's old Labour. He said: \"Musically, the verse is downcast and melancholic and the chorus is an explosion of disillusionment and tears.\" The third single \"Dylan & Caitlin\" was released as a download on 9 March 2018. The fourth single \"Liverpool Revisited\" is about a magical day in the city, Nicky added that: \"It was on the Everything Must Go (anniversary) tour and I got up really early at sunrise to walk around Liverpool, polaroid camera in hand on a balmy day. It sounds clichéd I know, but Liverpool in the sun does take on a hypnotic quality, with the Mersey and the stone.\" The band also revealed that they were to support Guns N' Roses during their summer tour. The fifth and final single, \"Hold Me Like a Heaven\", was released as a download on 4 May 2018. Wire said that the song was inspired musically by David Bowie's Ashes to Ashes, something that the band wanted to write about, and Nicky thinks that this the closest that the band is going to get, sharing also that lyrics were informed by the work of Philip Larkin.", "The Lightning Seeds' song \"Waiting for Today to Happen\", from their fifth album, Dizzy Heights (1996), was written by Nicky Wire and Ian Broudie. That same year, James Dean Bradfield and Dave Eringa produced Northern Uproar's first single, \"Rollercoaster/Rough Boys\". The 808 State song \"Lopez\" (1997) features lyrics by Wire and vocals by Bradfield. It is featured on their greatest hits album, 808:88:98. Kylie Minogue's sixth album, Impossible Princess (1997), features two songs co-written and produced by the Manics: \"Some Kind of Bliss\" (Bradfield, Minogue and Sean Moore) and \"I Don't Need Anyone\" (Bradfield, Jones and Minogue) were produced by Bradfield and Dave Eringa. Bradfield provided backing vocals, bass guitar and production for the Massive Attack song \"Inertia Creeps\" (1998), which features on their successful third album, Mezzanine. Patrick Jones's album of poetry set to music, Commemoration and Amnesia (1999), features two songs with music written by Bradfield: the title track and \"The Guerilla Tapestry\". Bradfield plays the guitar on both songs. Furthermore, the track \"Hiraeth\" features a section called \"Spoken Word\", in which Nicky Wire talks about Welsh identity.", "James Dean Bradfield and Nicky Wire contributed an original song, \"The Girl from Tiger Bay\", to Shirley Bassey's 2009 studio album, The Performance.", "* James Dean Bradfield – lead and backing vocals, lead guitar, piano, keyboards (1986–present), rhythm guitar (1988–1989, 1995–present)", "* Musician's Union Maestro (for James Dean Bradfield) at the Classic Rock Roll of Honour Awards, 2013"]}, {"page": "Simple Minds", "response": ["On 22 October 2014, Simple Minds were presented the Q Inspiration to Music award by Manic Street Preachers frontman James Dean Bradfield and saw the first public outing of new member Catherine AD as part of the lineup. On 2 November 2014, Simple Minds introduced Big Music with a special acoustic session for Radio Clyde's The Billy Sloan Collection. Jim Kerr and Charlie Burchill co-hosted the show, choosing some of their favourite records – including Jet Boy by The New York Dolls, The Velvet Underground's Sweet Jane and The Model by Kraftwerk – and playing acoustic versions of songs from Big Music, including \"Honest Town\" and \"Let The Day Begin\" and David Bowie cover \"The Man Who Sold the World\"."]}, {"page": "The Cardigans", "response": ["Persson also appeared on the Manic Street Preachers' album Send Away the Tigers (May 2007), providing guest vocals on the UK Chart #2 single \"Your Love Alone Is Not Enough\". She shared vocals with Manics frontman James Dean Bradfield, who also appeared on stage with the band at the Glastonbury Festival 2007, and who has rated Peter Svensson as his second favourite guitarist."]}, {"page": "808 State", "response": ["In October 1991, Price left the group to perform solo production work, eventually forming his own label, Sun Text. The remaining members released a fourth album called Gorgeous, and after that, did some remix work for David Bowie, Soundgarden, and other performers, before returning with the album entitled Don Solaris in 1996. It featured contributions from James Dean Bradfield, who sang vocals on \"Lopez\", which reached number 20 in the UK Singles Chart. This song was remixed by Brian Eno. In 1997, they had remixed the Mansun track \"Skin Up, Pin Up\" for the Spawn soundtrack. The song \"Bond\" featured vocals by Mike Doughty from the band Soul Coughing and \"Azura\" featured Lou Rhodes from Lamb. They released a greatest hits compilation album, 808:88:98 in 1998. In 2000, Newbuild was re-released."]}, {"page": "Rory Gallagher", "response": ["Many modern day musicians, including The Edge from U2,Archived at Ghostarchive and the Wayback Machine:  Slash of Guns N' Roses, Johnny Marr of the Smiths, Davy Knowles, Janick Gers of Iron Maiden, Alex Lifeson of Rush, James Dean Bradfield of Manic Street Preachers, Glenn Tipton of Judas Priest, Vivian Campbell of Def Leppard, Gary Moore,Archived at Ghostarchive and the Wayback Machine:  and Joe Bonamassa, cite Gallagher as an inspiration in their formative musical years."]}, {"page": "Generation Terrorists", "response": ["All lyrics were written by Richey Edwards and Nicky Wire. All music was written by James Dean Bradfield and Sean Moore (except \"Damn Dog\", which is a cover version of a song by the Sleez Sisters from the 1980 movie Times Square). The album's lyrics are politicised similar to that of The Clash and Public Enemy, with the album's songs regularly switching from a critical focus on global capitalism to more personal tales of despair and the struggles of youth. Examples of the more politically inspired side of Generation Terrorists include the opening track \"Slash 'n' Burn\", which concerns \"third world exploitation\", the track \"Repeat (Stars and Stripes)\", a remix of the band's own anti-monarchy tirade by Public Enemy production team The Bomb Squad and \"Another Invented Disease\", a song whose title was deliberate word play on AIDS and referred to a conspiracy theory insinuating that the virus was manufactured by American biological warfare scientists.", "On 5 November 2012, Generation Terrorists was re-released for its 20th anniversary. There are five editions of the re-release: the original album; a two-disc Deluxe Edition with a bonus disc of demos and a DVD of the documentary film Culture, Alienation, Boredom, Despair, about the making of the album – when purchased from the Rough Trade record store in London it also included a free ticket to a showing of the documentary film, followed by an acoustic gig with James Dean Bradfield on 6 November; a four-disc limited edition (3,000 copies worldwide), including, in addition to the contents of the two-disc edition, a replica of a Generation Terrorist tour VIP pass; a 10\" collage by Richey Edwards; a 10\" vinyl LP of a rare Manics radio performance; and a 28-page book from Nicky Wire's personal archive.", "* James Dean Bradfield – lead vocals, lead, rhythm and acoustic guitars"]}, {"page": "Confide in Me (2001 album)", "response": ["*James Dean Bradfield – Producer"]}, {"page": "Gold Against the Soul", "response": ["When asked to look back on the album, the band themselves have described Gold Against the Soul as their least favourite album and the period surrounding the album as being the most unfocused of their career. The band's vocalist and guitarist James Dean Bradfield has said \"All we wanted to do was go under the corporate wing. We thought we could ignore it but you do get affected.\"", "* James Dean Bradfield – lead vocals, lead, rhythm and acoustic guitars, backing vocals"]}, {"page": "Herbert Grönemeyer", "response": ["I Walk, the English-language debut in the U.S. for Grönemeyer, was released in February 2013 on Grönland Deutschland/EMI Label Services. In early 2013, he played his first American concerts at the Chicago Theatre on 23 February and New York's Irving Plaza on 26 February. His U.S. website later announced 12 tour dates in the U.S. and Canada for September 2013. The album, which includes guest performances from Bono of U2, Antony Hegarty of Antony and The Johnsons, and guitarist James Dean Bradfield of the Manic Street Preachers, was released in the UK in October 2012."]}, {"page": "Exit Planet Dust", "response": ["The duo became resident DJs at the small—but hugely influential—Heavenly Sunday Social Club at the Albany pub in London's Great Portland Street at this point. The likes of Noel Gallagher, Paul Weller, James Dean Bradfield, and Tim Burgess were regular visitors. The Dust Brothers (as they were at the time) were subsequently asked to remix tracks by Manic Street Preachers and The Charlatans. Their remixes of Primal Scream's \"Jailbird\" and The Prodigy's \"Voodoo People\" received television exposure, being playlisted by MTV Europe's \"The Party Zone\" in 1995."]}, {"page": "Pontypool", "response": ["* James Dean Bradfield – singer and guitarist, Manic Street Preachers."]}, {"page": "Everything Must Go (Manic Street Preachers album)", "response": ["Singer-songwriter James Dean Bradfield said that the sound of the drums was crucial on the album to set the tone. He was inspired by the works of several bands, \"I loved records like Pornography by The Cure and Joy Division records and Wire records and Magazine records and [Siouxsie and the] Banshees records and Wah! records and Associates records where everything starts with the drums\". Producer Mike Hedges was the person the group had in mind since The Holy Bible in part for his production role on Siouxsie and the Banshees' single \"Swimming Horses\" which Bradfield loved. The band stayed in France in Normandy to work at Hedges' own studio which contained a mixing desk coming from the Abbey Road Studios.", "* James Dean Bradfield – lead vocals, lead and rhythm guitar and piano"]}, {"page": "This Is My Truth Tell Me Yours", "response": ["It was the first Manics album to feature lyrics solely by Nicky Wire, while all the music was written by the duo of James Dean Bradfield and Sean Moore. This Is My Truth Tell Me Yours shows considerably less hard rock influence than their previous efforts and finds the band experimenting with sound and production techniques. It features cleaner guitar sounds in general and the increased use of additional instrumentation such as strings, keyboards and both real and programmed percussion. Clash magazine described the album's sound as \"a glacial distillation of the anthemic rock that had served them so well two years previous\", an approach further developed on 2004's Lifeblood.", "James Dean Bradfield has cited John Frusciante as the main influence for the intro riff of \"My Little Empire\".Archived at Ghostarchive and the Wayback Machine:  The final track, \"S.Y.M.M.\", an initialism for \"South Yorkshire Mass Murderer\", refers to the involvement of police in the Hillsborough disaster of 1989, in which 96 people died in a human crush during a football match at the Hillsborough Stadium in Sheffield.", "NME awarded the album with a 7/10, stating: \"No longer is James Dean Bradfield required to turn metrical somersaults in order to translate screeds of vituperative prose into the realm of the performable. Nicky's opaque verses lend themselves more readily to poetic contemplation, and James responds with his most incontrovertibly delicate vocals, singing as opposed to lacerating his larynx in the quest for empathy.\"", "* James Dean Bradfield – lead vocals, lead and rhythm guitar, acoustic guitar, 12-string guitar (tracks 2, 10 and 12), electric sitar (tracks 5 and 7), Omnichord (tracks 4 and 5), melody horn (track 10)"]}, {"page": "Know Your Enemy (Manic Street Preachers album)", "response": ["The album features Nicky Wire's debut as a lead vocalist, on the track \"Wattsville Blues\", and James Dean Bradfield's debut as a lyricist, on \"Ocean Spray\". Kevin Shields of My Bloody Valentine plays guitar on the album's final track.", "* James Dean Bradfield – lead vocals, lead and rhythm guitar, keyboards on \"Freedom of Speech Won't Feed My Children\""]}, {"page": "Forever Delayed", "response": ["** Music by James Dean Bradfield and Sean Moore", "** Music by James Dean Bradfield and Sean Moore", "** Music by James Dean Bradfield, Nicky Wire and Sean Moore"]}, {"page": "The Everlasting (song)", "response": ["\"The Everlasting\" is the second single to be lifted from the Manic Street Preachers's fifth studio album This Is My Truth Tell Me Yours. It was released on 30 November 1998 through Epic, it peaked on number 11 on the UK Singles Chart, breaking their run of consecutive top-ten hits. All three members of the band—James Dean Bradfield, Sean Moore and Nicky Wire—share the writing credits.", "All music was written by James Dean Bradfield and Sean Moore except where indicated. All were lyrics written by Nick Jones except where indicated.", "Category:Songs written by James Dean Bradfield"]}, {"page": "If You Tolerate This Your Children Will Be Next", "response": ["All music was written by James Dean Bradfield and Sean Moore except where indicated. All lyrics were written by Nick Jones except where indicated.", "Category:Songs written by James Dean Bradfield"]}, {"page": "You Stole the Sun from My Heart", "response": ["\"You Stole the Sun from My Heart\" is a song by Welsh rock band Manic Street Preachers, released as the third single from their fifth studio album, This Is My Truth Tell Me Yours (1998), on 8 March 1999. All three members of the band—James Dean Bradfield, Sean Moore, and Nicky Wire—share the writing credits. The song reached number five on the UK Singles Chart and number two in Iceland.", "All music was written by James Dean Bradfield and Sean Moore except where indicated. All lyrics were written by Nick Jones except where indicated.", "Category:Songs written by James Dean Bradfield"]}, {"page": "Tsunami (Manic Street Preachers song)", "response": ["\"Tsunami\" is a song by Manic Street Preachers, released as a single on 5 July 1999 through Epic. It was the fourth and final single to be released from the album This Is My Truth Tell Me Yours. All three members of the band - James Dean Bradfield, Sean Moore and Nicky Wire - share the writing credits. The single peaked at number 11 on the UK charts.", "All music written by James Dean Bradfield and Sean Moore; except where indicated.", "Category:Songs written by James Dean Bradfield"]}, {"page": "The Masses Against the Classes", "response": ["All music was written by James Dean Bradfield and Sean Moore except where indicated. All lyrics were written by Nicky Wire except where indicated.", "Category:Songs written by James Dean Bradfield"]}, {"page": "So Why So Sad", "response": ["\"So Why So Sad\" was released by Manic Street Preachers in 2001 and was jointly the first single to be released from the Know Your Enemy album, alongside \"Found That Soul\". All three members of the band - James Dean Bradfield, Sean Moore and Nicky Wire - share the writing credits. The song reached number eight on the UK Singles Chart.", "All tracks written and composed by Nick Jones, James Dean Bradfield and Sean Moore.", "Category:Songs written by James Dean Bradfield"]}, {"page": "Found That Soul", "response": ["\"Found That Soul\" is a single by the Manic Street Preachers, released on 26 February 2001 from the Know Your Enemy album.  Writing credit was shared by all three members of the band, James Dean Bradfield, Sean Moore and Nicky Wire. Note: User may have to click 'Search again' and provide details at 'Enter a title:' e.g Found That Soul; or at 'Performer:' Manic Street Preachers The song reached number 9 in the UK Singles Chart.", "All tracks written and composed by Nick Jones, James Dean Bradfield and Sean Moore.", "Category:Songs written by James Dean Bradfield"]}, {"page": "Nicky Wire", "response": ["Born Nicholas Allen Jones in Llanbadoc, Monmouthshire, Wales, Wire is the younger brother of poet and author Patrick Jones. He attended Oakdale Comprehensive School with James Dean Bradfield, Sean Moore and Richey Edwards. Wire played competitive schools football and, aged 14, was captain of the Welsh national schoolboys' team. Although he was offered a trial at both Tottenham Hotspur and Arsenal football clubs, back and knee problems brought his football career to an end. Wire took A-levels in politics and law. He later attended Portsmouth Polytechnic, but after several months transferred to the University of Wales Swansea, starting his course a year after Edwards. He graduated with a Lower Second-Class Honours degree in politics, which has led him to comment that he may have pursued a career in the diplomatic service or the Foreign and Commonwealth Office.", "In an interview with New Musical Express in March 2020, that also confirmed work on a 2021 Manic Street Preachers album and a solo album by bandmate James Dean Bradfield, Wire announced that he was working on more solo content, joking that he would not have to put in much work to meet fan demand. Bradfield later reconfirmed this, likening their simultaneous solo work to when they did the same in 2006."]}, {"page": "Australia (Manic Street Preachers song)", "response": ["All music was written by James Dean Bradfield and Sean Moore, except where indicated. All lyrics were written by Nicky Wire, except where indicated.", "Category:Songs written by James Dean Bradfield"]}, {"page": "Richey Edwards", "response": ["Richard James Edwards was born and raised in Blackwood, Wales to Graham and Sherry Edwards. He had one younger sister, Rachel (born 1969), with whom he was close. Edwards attended Oakdale Comprehensive School. From 1986 to 1989, he attended University of Wales, Swansea and graduated with a 2:1 degree in political history. The Edwards family lived in Blackwood. He met Nicky Wire, Sean Moore and James Dean Bradfield at Oakdale Comprehensive School.", "Despite Edwards' lack of musical input, he contributed to their overall musical direction, and according to the rest of the band on the Everything Must Go DVD, he played a leading role in deciding the band's sound. Edwards expressed a desire to create a concept album described as \"Pantera meets Nine Inch Nails meets Screamadelica\".Bailie, Stuart. \"The Art of Falling Apart\". Mojo (February 2002). p.85. Lead guitarist and vocalist James Dean Bradfield later expressed doubt over whether the band would have produced such an album: \"I was worried that as chief tune-smith in the band I wasn't actually going to be able to write things that he would have liked. There would have been an impasse in the band for the first time born out of taste.\"Maconie, Stuart \"Everything Must Grow Up\" Q Magazine October 1998"]}, {"page": "Sean Moore (musician)", "response": ["Sean Anthony Moore (born 30 July 1968) is a Welsh musician, who is the drummer and percussionist and occasional trumpet player of the Welsh alternative rock band Manic Street Preachers. He is cousin to bandmate James Dean Bradfield.", "Born on 30 July 1968 in Pontypool, Torfaen, Moore attended Oakdale Comprehensive in Oakdale, Caerphilly, with his cousin James Dean Bradfield, and other future band members Nicky Wire and Richey Edwards.", "Moore also has a strong interest in motoring, and set the 22nd fastest lap time around the Nürburgring, Germany, in an Audi RS 4 in 8 minutes 25 seconds. Manics singer James Dean Bradfield mentioned this before playing \"Motown Junk\" as part of the annual Rock am Ring festival at the track. Moore is a fan of Michael Schumacher."]}, {"page": "Patrick Jones (poet)", "response": ["Jones has made various television and radio appearances, and is probably Wales' most prominent living literary figure. He participated in a week-long intensive writing masterclass with Arnold Wesker at Hay on Wye Literature Festival in 1997. Jones participated in the 1998 Dysfluency Tour. In April 1999, he staged a Kosovo benefit at Blackwood Miner's Institute involving Max Boyce, James Dean Bradfield and other artists. Later that year he read from and discussed sections of his play Everything Must Go at Marxism '99. 1999 also saw Ioan Gruffydd, Matthew Rhys and other Welsh celebrities performing his poem \"The Guerrilla Tapestry\" at the opening of the Welsh Assembly 'Voices of a Nation' concert. In 2004, he returned to the Hay Festival for a discussion with James Dean Bradfield on music, politics and writing.", "It was supported by the Dyn Project Cardiff, Mankind UK, Chapter Arts Centre and the Welsh Arts Council. It was directed by Chris Durnall with Nathan Sussex and Stacey Daly and featured a soundtrack by Jones' friend and collaborator, James Dean Bradfield. It was performed at Chapter Arts Centre in July 2008 before transferring to a three-week run at the Courtyard Theatre in London as well as other, non-theatre venues.", "A CD Tongues for a Stammering Time, with spoken word in collaboration with many musicians including Nicky Wire, James Dean Bradfield, Billy Bragg, Amy Wadge, Martyn Joseph and others, was released on Anhrefn Records in May 2009."]}, {"page": "Ocean Spray (song)", "response": ["\"Ocean Spray\" is a song by the Manic Street Preachers, which was released as the third single from the album Know Your Enemy on 4 June 2001. James Dean Bradfield wrote both lyrics and music for the song. It reached number 15 in the UK Singles Chart.", "All music written and composed by Nick Jones, James Dean Bradfield and Sean Moore.", "Except \"Ocean Spray\"; music and lyrics by James Dean Bradfield.", "Category:Songs written by James Dean Bradfield"]}, {"page": "Let Robeson Sing", "response": ["The song is a tribute to the black American actor, singer and civil rights campaigner Paul Robeson. It shares its title with a book by Phil Cope and others, published jointly by the Paul Robeson Cymru Committee and the Bevan Foundation in 2001, with a reprint being published by the National Library of Wales in 2003. All three members of the band – James Dean Bradfield, Sean Moore and Nicky Wire – share the writing credits.", "On 17 December 2011 \"Let Robeson Sing\" was the tenth of thirty-eight songs performed at the one-off A Night of National Treasures live performance at The O2 Arena (London). The lead vocals were performed by special guest Gruff Rhys of the Super Furry Animals, with James Dean Bradfield explaining to the audience that Rhys had been set to perform the song at the band's 2001 performance in Havana, Cuba, but circumstances had prevented this from happening.", "All music written and composed by Nick Jones, James Dean Bradfield and Sean Moore.", "Category:Songs written by James Dean Bradfield"]}, {"page": "There by the Grace of God", "response": ["All music written and composed by Nick Jones, James Dean Bradfield and Sean Moore.", "Category:Songs written by James Dean Bradfield"]}, {"page": "Kevin Carter (song)", "response": ["The jagged, descending chords of the verses lead into a lush extended middle section, which further points to experimental songwriting while also linking back to the spiky music on the band's previous album, The Holy Bible. James Dean Bradfield has said of the song, \"It's quite a scratchy sound, but it's kind of complicated in its own humble way.\"", "All music was written by James Dean Bradfield, Sean Moore, and Nicky Wire except where indicated. All lyrics were written by Richey James except where indicated.", "Category:Songs written by James Dean Bradfield"]}, {"page": "Everything Must Go (song)", "response": ["James Dean Bradfield has said that Sean Moore had a lot of freedom in the drums for his song. Unlike on several previous Manic Street Preachers singles, the drums are not \"compressed\", they are more open and free, giving a sense of disorder in the song. The song features a prominent string section.", "All music was composed by James Dean Bradfield and Sean Moore except where indicated. All lyrics were written by Nicky Wire except where indicated.", "Category:Songs written by James Dean Bradfield"]}, {"page": "A Design for Life", "response": ["The song was the first to be written and released by the band following the disappearance of figurehead Richey Edwards the previous year. Interviewed in 2014 by NME for their \"Song Stories\" video series, singer and guitarist James Dean Bradfield recalled that the lyric had been a fusion of two sets of lyrics — \"Design for Life\" and \"Pure Motive\" — sent to him from Wales by bassist Nicky Wire, while he was living in Shepherd's Bush. The music was written \"in about ten minutes\" and Bradfield felt a sense of euphoria with the result. The song was credited with having \"rescued the band\" from the despair felt after the disappearance of Edwards, with Wire describing the song as \"a bolt of light from a severely dark place\". The band approached Mike Hedges to be involved in producing the song after hearing McAlmont & Butler's string-laden single \"Yes\", which Hedges had worked on.", "All music was composed by James Dean Bradfield and Sean Moore; all lyrics were written by Nicky Wire except where noted.", "# \"Dead Trees and Traffic Islands\" (music and lyric James Dean Bradfield, Sean Moore, Nicky Wire)", "# \"Faster\" (vocal mix) (music: James Dean Bradfield, Sean Moore; lyric: Nicky Wire, Richey Edwards)", "* acoustic version James Dean Bradfield, August 2013 at walesonline.co.uk", "Category:Songs written by James Dean Bradfield"]}, {"page": "She Is Suffering", "response": ["Promotion for the single included James Dean Bradfield performing an acoustic version of the song on RTÉ's Sunday afternoon TV/radio simulcast The Beatbox", "Category:Songs written by James Dean Bradfield"]}, {"page": "Revol (song)", "response": ["James Dean Bradfield has previously been critical of the song, saying that he hates the UK version. He is, however, a fan of the \"US Mix\" by Tom Lord-Alge, which can be found on the 10th Anniversary re-issue edition of The Holy Bible.", "*James Dean Bradfield – lead vocals, lead guitar", "Category:Songs written by James Dean Bradfield"]}]}}