{"wiki_id": "http://www.wikidata.org/entity/Q16893633", "itemLabel": "Oscar Whitbread", "itemDescription": "Australian producer", "wikipedia_url": "https://en.wikipedia.org/wiki/Oscar_Whitbread", "wikipedia_page": {"main": "Oscar Ralph Whitbread  (26 November 1929 – 16 May 2016) was an English-Australian producer who worked extensively in television.He moved to Australia in the late 1940s. Whitbread started his career at the ABC in 1956, where he served as the Head of Drama, before switching to the same position with the Seven Network. He was responsible for numerous successful series including Bellbird, The Flying Doctors and the miniseries Power Without Glory.\nWhitbread was the senior executive producer at Crawford Productions and also worked in England for the BBC, Thames Television, Granada Television and London Weekend Television.", "link_mentions": [{"page": "Penguin Award", "response": ["*Best Producer/Director - Oscar Whitbread, Rush, ABC"]}, {"page": "Lucinda Brayford", "response": ["This novel was adapted for a television mini-series in 1980, produced by Oscar Whitbread and directed by John Gauci, from a screenplay by Cliff Green, featuring Wendy Hughes as Lucinda, and Sam Neill as Tony Duff.IMDBEd. Scott Murray, Australia on the Small Screen 1970-1995, Oxford Uni Press, 1996, p.202 BBC Radio broadcast a dramatisation by Elspeth Sandys in 2005 and 2020.https://www.bbc.co.uk/sounds/play/b0076pv1"]}, {"page": "Dynasty (Australian TV series)", "response": ["The project was written by Morphett based on his novel, and directed in Melbourne by Oscar Whitbread."]}, {"page": "A Phoenix Too Frequent", "response": ["directed by Oscar Whitbread)."]}, {"page": "Corruption in the Palace of Justice", "response": ["Corruption in the Palace of Justice is a 1964 Australian television film produced by Oscar Whitbread. Based on an Italian stage play by Ugo Betti, it was a drama aired in a 60-minute time-slot and aired on non-commercial broadcaster ABC. Cast included Michael Duffield, Carl Bleazby, Terry Norris. It was produced in Melbourne. It was adapted by Robert Rietti. A copy of the script is at the NAA."]}, {"page": "2016 in Australia", "response": ["* 15 May – Oscar Whitbread, 86, television producer"]}, {"page": "1991 Australian Film Institute Awards", "response": ["**Ratbag Hero (Seven Network) – Zelda Rosenbaum, Oscar Whitbread"]}, {"page": "Plain Jane (Wednesday Theatre)", "response": ["\"Plain Jane\" is a 1966 Australian TV movie. It stars Elspeth Ballantyne and was produced by Oscar Whitbread for the ABC."]}, {"page": "Slow Poison (Australian Playhouse)", "response": ["\"Slow Poison\" is the second television play episode of the second season of the Australian anthology television series Australian Playhouse. \"Slow Poison\" was produced in Melbourne by Oscar Whitbread, written by Allan Trevor. and originally aired on ABC on 22 April 1967, 19 June 1967 in Melbourne and 31 July 1967 in Canberra>.", "The Age said it had \"a well developed central character\" where \"Allan Trevor produced a workmanlike script and Oscar Whitbread treated it well with some light touches.\""]}, {"page": "Photo Finish (Wednesday Theatre)", "response": ["\"Photo Finish\" is a 1965 Australian TV movie based on a play by Peter Ustinov. It screened on ABC and was produced by Oscar Whitbread and starred Frank Thring."]}, {"page": "The Winds of Green Monday", "response": ["\"The Winds of Green Monday\" was a 1965 Australian television play by Michael Noonan. It aired as part of Wednesday Theatre. It starred Terry Norris and was directed by Oscar Whitbread."]}, {"page": "Frank and Francesca", "response": ["The series of six 30 minute black & white episodes were based on the book of the same name by David Martin (1915-1997) It was produced by Oscar Whitbread for the Australian Broadcasting Commission and was directed by Rick Birch and Douglas Sharp."]}, {"page": "The Professional Touch", "response": ["The Professional Touch is a 1976 Australian TV movie directed by Oscar Whitbread starring Cul Cullen."]}, {"page": "The Truckies", "response": ["It was executive produced by Oscar Whitbread and was made by several of the team behind the TV show Power Without Glory."]}, {"page": "Golden Pennies", "response": ["It was executive produced by Christopher Muir, written by Graeme Farmer and directed by Oscar Whitbread."]}, {"page": "Deaths in May 2016", "response": ["*Oscar Whitbread, 86, English-born Australian television producer.Oscar Whitbread: Australian TV pioneer, mentor, dies aged 86"]}, {"page": "The Decision (Australian Playhouse)", "response": ["\"The Decision\" is the 23rd television play episode of the first season of the Australian anthology television series Australian Playhouse. \"The Decision\" was written by John Warwick and directed by Oscar Whitbread and originally aired on ABC on 19 September 1966."]}, {"page": "Outbreak of Love (novel)", "response": ["An television adaptation of this novel was released in Australia in 1981. It consisted of three one-hour episodes and was written by Howard Griffiths, directed by Oscar Whitbread, and featured Rowena Wallace, Tony Bonner and Sigrid Thornton.IMDB - Outbreak of Love"]}, {"page": "Fiends of the Family", "response": ["\"Fiends of the Family\" is a 1969 Australian television play. It was part of the Australian Plays series. Written by Pat Flower based on her 1966 novel, directed by Oscar Whitbread."]}, {"page": "How Do You Spell Matrimony?", "response": ["Both were produced by Oscar Whitbread."]}]}}