{"wiki_id": "http://www.wikidata.org/entity/Q1686268", "itemLabel": "Jeff Butterfield", "itemDescription": "English rugby union footballer", "wikipedia_url": "https://en.wikipedia.org/wiki/Jeff_Butterfield", "wikipedia_page": {"main": "Jeffrey Butterfield (9 August 1929, Heckmondwike, Yorkshire – 30 April 2004, Wicken, Northamptonshire) was an England, British and Irish Lions, Yorkshire, Cleckheaton RUFC, Northampton and Barbarians Rugby player and businessman.", "link_mentions": [{"page": "British & Irish Lions", "response": ["| Jeff Butterfield, 12", "The Lions played an unofficial international match in 1955 at Cardiff Arms Park against a Welsh XV to mark the 75th anniversary of the Welsh Rugby Union. The Lions won 20–17 but did not include all the big names of the 1955 tour, such as Tony O'Reilly, Jeff Butterfield, Phil Davies, Dickie Jeeps, Bryn Meredith and Jim Greenwood.", "|align=\"left\"| Jeff Butterfield"]}, {"page": "Wellingborough", "response": ["* Jeff Butterfield, Rugby Player."]}, {"page": "Heckmondwike", "response": ["*Jeff Butterfield (1929–2004), international rugby union footballer."]}, {"page": "Northampton Saints", "response": ["* Jeff Butterfield (1955 & 1959)"]}, {"page": "Cliff Morgan", "response": ["He won his first cap for Wales against Ireland in 1951, playing opposite his own hero Jack Kyle. He was part of the Grand Slam-winning Welsh side of 1952. The following year he inspired both Cardiff and Wales to historic victories over the touring All Blacks. In 1956, following his success on the 1955 British Lions tour to South Africa, he was made captain of Wales. During that tour, in which the Test series was drawn 2–2, Morgan distinguished himself for his marshalling of a talented Lions backline that included Jeff Butterfield and Arthur Smith in the centre, with Cecil Pedlow and Tony O'Reilly on the wings. Morgan's try in the first Test at Ellis Park, in front of a then world-record crowd of 100,000, helped secure a sensational 23–22 victory at the end of a match that some still consider the most exciting ever played."]}, {"page": "Worksop College", "response": ["The 1950s and 1960s were another period of growth for the college. New buildings from this time included the gym (now demolished), swimming bath (opened in 1954), Churchill Hall Theatre, Chemistry Department and Talbot House (now School House and language department). A new rugby pitch was leveled in 1954; Jeff Butterfield led a Worksop College XV to victory against Worksop RFC in the opening match.", "The appointment of England and British Lion Jeff Butterfield in 1954 as a master at the college, quickly led to a surge in success. In 1960 the college rugby sevens team captained by D.E. Tarbatt and coached by Butterfield, reached the final of the Roslyn Park competition, narrowly losing out to the Belfast Acadeemicals in the final.", "* Jeff Butterfield - Captain of England rugby team in the 1950s"]}, {"page": "1959 Five Nations Championship", "response": ["|Jeff Butterfield"]}, {"page": "Jeffrey Butterfield", "response": ["#REDIRECT Jeff Butterfield"]}, {"page": "1955 British Lions tour to South Africa", "response": ["*Jeff Butterfield (Northampton and )"]}, {"page": "Rugby union in the Cayman Islands", "response": ["Although there has been interest in the game in the Cayman Islands for decades, it only became properly organised in 1972, when the Cayman Islands RFC was founded.Cotton, p14 This team faced the challenge of having no rugby ball, pitch, and no clubhouse, for several years, and their nearest opponents were in Jamaica 600 miles away. In 1975, however, Jeff Butterfield, a former England player acquired the rights to a piece of pine forest, which was turned into their pitch."]}, {"page": "1957–58 Australia rugby union tour of Britain, Ireland and France", "response": ["ENGLAND: James Hetherington, Peter Jackson, Malcolm Phillips, Jeff Butterfield, Peter Thompson, Phil Horrocks-Taylor, Dickie Jeeps, Ned Ashcroft, Ronald Syrett, Peter Robbins, David Marques, John Currie, Ron Jacobs, Eric Evans (captain), George Hastings "]}]}}