{"wiki_id": "http://www.wikidata.org/entity/Q1680215", "itemLabel": "James Cracknell", "itemDescription": "British rower", "wikipedia_url": "https://en.wikipedia.org/wiki/James_Cracknell", "wikipedia_page": {"main": "James Edward Cracknell,  (born 5 May 1972) is a British athlete, rowing champion and double Olympic gold medalist. Cracknell was appointed OBE for \"services to sport\" in the 2005 New Year Honours List.", "link_mentions": [{"page": "May 5", "response": ["*1972 – James Cracknell, English rower"]}, {"page": "1972", "response": ["**James Cracknell, British Olympic rower"]}, {"page": "London Borough of Sutton", "response": ["* James Cracknell OBE, Olympic gold medallist in rowing"]}, {"page": "Brunel University London", "response": ["* James Cracknell (MSc Sport Science 1999), rower, Olympic gold medallist"]}, {"page": "Steve Redgrave", "response": ["* 2000 – Gold, Coxless Four (with Matthew Pinsent, Tim Foster, James Cracknell)", "* 1999 – Gold, Coxless Four (with James Cracknell, Ed Coode, Matthew Pinsent)", "* 1998 – Gold, Coxless Four (with James Cracknell, Tim Foster, Matthew Pinsent)", "* 1997 – Gold, Coxless Four (with James Cracknell, Tim Foster, Matthew Pinsent)"]}, {"page": "Matthew Pinsent", "response": ["In 2000 he won Olympic gold again as part of a coxless four with Redgrave, James Cracknell and Tim Foster. He also carried the flag for Team GB at the opening ceremony. In August 2000, the month prior to winning gold in Sydney, he took part in a three-part BBC documentary entitled Gold Fever. This followed the coxless four team in the years leading up to the Olympics, including video diaries recording the highs and lows in the quest for what would be Pinsent's third consecutive gold.", "* 2004 – Gold, Coxless Four (with James Cracknell, Steve Williams, Ed Coode)", "* 2000 – Gold, Coxless Four (with James Cracknell, Tim Foster, Steve Redgrave)", "* 2003 – 4th, Coxless Pair (with James Cracknell)", "* 2002 – Gold, Coxless Pair (with James Cracknell)", "* 2001 – Gold, Coxless Pair (with James Cracknell)", "* 2001 – Gold, Coxed Pair (with James Cracknell, Neil Chugani)", "* 1999 – Gold, Coxless Four (with James Cracknell, Ed Coode, Steve Redgrave)", "* 1998 – Gold, Coxless Four (with James Cracknell, Tim Foster, Steve Redgrave)", "* 1997 – Gold, Coxless Four (with James Cracknell, Tim Foster, Steve Redgrave)"]}, {"page": "Jonny Lee Miller", "response": ["He was considered as the third teammate to join Ben Fogle and James Cracknell in Team QinetiQ for the Amundsen Omega 3 South Pole Race in January 2009. He participated in training for the event in Norway, which was televised for a BBC2 documentary series On Thin Ice.On Thin Ice (2009). [TV programme]. TwoFour Productions. [Transmitted: 29 June 2009]. He was not able to attend the race because of filming commitments, after Eli Stone was extended for a second season. "]}, {"page": "The Boat Race", "response": ["Many notable individuals have participated in the Boat Race, including those of an Olympic standard.  Four-time Olympic gold medallist Sir Matthew Pinsent, rowed for Oxford in 1990, 1991, and 1993. Olympic gold medallists from 2000 – James Cracknell (Cambridge 2019), Tim Foster (Oxford 1997), Luka Grubor (Oxford 1997), Andrew Lindsay (Oxford 1997, 1998, 1999) and Kieran West (Cambridge 1999, 2001, 2006, 2007), 2004 – Ed Coode (Oxford 1998), and 2008 – Jake Wetzel (Oxford 2006) and Malcolm Howard (Oxford 2013, 2014) have also rowed for their university."]}, {"page": "World Rowing Federation", "response": ["A new idea introduced in 2002 as an attempt to bring rowing to the centre of cities.  The first (and only) event took place on the Serpentine Lake in Hyde Park, London and was sponsored by Mercedes-Benz. Crews from Great Britain, United States, Germany, and the Netherlands took part in the 500 m race. Famous rowing champions raced, including Matthew Pinsent, James Cracknell, and Marcel Hacker."]}, {"page": "David Walliams", "response": ["On 7 March 2008 Walliams, along with James Cracknell, swam the  Strait of Gibraltar from Spain to Morocco, again for Sport Relief. He successfully completed the swim in just over 4½ hours."]}, {"page": "Rowing at the 2000 Summer Olympics", "response": ["|nowrap|James CracknellSteve RedgraveTim FosterMatthew Pinsent"]}, {"page": "August 2004 in sports", "response": ["** Rowing: Matthew Pinsent wins his fourth gold in consecutive Olympics in the men's coxless four. Pinsent, Ed Coode, James Cracknell and Steve Williams hold off the Canadian world champions to win by 0.08s. (BBC)", "**** Men's Coxless Four: Great Britain (Steve Williams, James Cracknell, Ed Coode, Matthew Pinsent)"]}, {"page": "Leander Club", "response": ["* James Cracknell"]}, {"page": "Rowing at the 2004 Summer Olympics", "response": ["Matthew Pinsent also won his fourth consecutive medal, this time without legendary partner Steve Redgrave.  The British men's coxless four of Steve Williams, James Cracknell, Ed Coode with Pinsent at stroke narrowly saw off the challenge of the World Champion Canadian crew of Cameron Baerg, Thomas Herschmiller, Jake Wetzel and Barney Williams.  It was a dramatic stretch run with the lead literally changing hands with each stroke.  (In rowing, the boat will surge depending on where the rowers are during the stroke. Pinsent would later say that he thought they had won because they were in the best part of the stroke when they crossed the line).  Great Britain won with a time of 6:06.98, just 8/100ths of a second faster than the Canadians.  Pinsent later wept at the medal ceremony.", "|Steve WilliamsJames CracknellEd CoodeMatthew Pinsent"]}, {"page": "Ed Coode", "response": ["Coode won his first World Championship in 1999, as a substitute in the British men's coxless four, rowing with Steve Redgrave, Matthew Pinsent and James Cracknell. When Tim Foster returned to the four, Coode was put into the coxless pair with Greg Searle. They finished fourth at the 2000 Sydney Olympics having led for most of the race and being overtaken by three crews in the last 600 m, finishing 12/100th of a second (about 2 feet) out of third place.", "*2004 — Gold, Coxless four (with James Cracknell, Steve Williams, Matthew Pinsent)", "*1999 – Gold, Coxless four (with Steve Redgrave, Matthew Pinsent, James Cracknell)"]}, {"page": "Drew Ginn", "response": ["Ginn and James Tomkins had planned to race the straight pair at the Sydney 2000 Summer Olympics, but Ginn suffered a severe back injury, forcing him to withdraw from the boat.Ginn at World Rowing In 2002, he returned to the water, teaming up with fellow Oarsome Foursome rower James Tomkins in a coxless pair; they finished fourth in the 2002 World Championships.  In 2003, Ginn and Tomkins were the surprise winners, beating the British favourites—and defending champions—Matthew Pinsent and James Cracknell, which was a factor in Pinsent and Cracknell choosing to move to the coxless fours.  At the 2004 Summer Olympics, Ginn and Tomkins won the gold medal in the coxless pairs."]}, {"page": "James Tomkins (rower)", "response": ["Returning to a coxless pair in 2002, Ginn and Tomkins beat the heavily favoured British crew of Matthew Pinsent and James Cracknell in a world cup race before finishing a close fourth at the 2002 World Championships.   In 2003, Ginn and Tomkins reversed the prior years result winning the 2003 World Championship, with Pinsent and Cracknell placing fourth. In 2004, Pinsent and Cracknell moved to the coxless four to better their chances for a medal.  Ginn and Tomkins would go on to win the coxless pair at the 2004 Summer Olympics, leading at every mark, beating Croatia by 2 seconds, with South Africa claiming the bronze."]}, {"page": "Great Britain at the 2004 Summer Olympics", "response": ["|align=left|Ed CoodeJames CracknellMatthew PinsentSteve Williams"]}, {"page": "Jürgen Gröbler", "response": ["*James Cracknell, Tim Foster, Steve Redgrave and  Matthew Pinsent in 2000 in the four", "*Steve Williams, James Cracknell, Ed Coode and Matthew Pinsent in 2004 in the four,"]}, {"page": "Steve Williams (rower)", "response": ["With Matthew Pinsent, James Cracknell and Ed Coode, Williams won Olympic gold at the 2004 Summer Olympics in Athens in the men's coxless four.", "* 2004 – Gold, Coxless Four (with Matthew Pinsent, James Cracknell, Ed Coode)"]}, {"page": "Sutton, London", "response": ["*James Cracknell OBE, Olympic gold medallist in rowing."]}, {"page": "Bradley Wiggins", "response": ["In June 2017 Wiggins revealed that he had taken up rowing on a serious basis after initially using it as a means to keep fit, with fellow Olympic champion James Cracknell as his coach. He stated that he was planning to compete in the British Indoor Rowing Championships in December of the same year with a view to competing at the 2020 Summer Olympics. He competed in the elite 2000m at the Championships, finishing 21st in a time of 6:22.5 after a slow start due to mistakenly believing that the race had false started."]}, {"page": "Strictly Come Dancing", "response": ["| style=\"background:orange;\"|James Cracknell", "| James Cracknell", "|James Cracknell", "Roberts and Kovalev also hold the record for the best overall average score from the judges, receiving an average of 36.94/40 for their dances. Natalie Gumede and Artem Chigvintsev, and Danny Mac and Oti Mabuse follow, with averages of 36.88 and 36.62 respectively. Quentin Willson and Hazel Newberry hold the record for the lowest average score, with 8.0/40; they are followed by Susannah Constantine and Anton Du Beke and James Cracknell and Luba Mushtuk, both with an overall average of 12.0/40.", "| James Cracknell & Luba Mushtuk", "| James Cracknell & Luba Mushtuk"]}, {"page": "Rowing at the 2004 Summer Olympics – Men's coxless four", "response": ["|20px| Great Britain Steve WilliamsJames CracknellEd CoodeMatthew Pinsent", "#20px| Great Britain (Steve Williams, James Cracknell, Ed Coode, Matthew Pinsent)  6:20.85 SF", "#20px| Great Britain (Steve Williams, James Cracknell, Ed Coode, Matthew Pinsent) 5:50.44 FA", "#20px| Great Britain (Steve Williams, James Cracknell, Ed Coode, Matthew Pinsent) 6:06.98"]}, {"page": "Tim Foster", "response": ["In 1997 he won a seat in the coxless four alongside Steve Redgrave, Matthew Pinsent and James Cracknell.  In the run up to the Olympics, he again needed back surgery and time off after severing tendons in his hand by punching a window at a boat club party. In August 2000, the month prior to winning gold in Sydney, a three-part BBC documentary entitled Gold Fever was broadcast. This followed the coxless four team in the years leading up to the Olympics, including video diaries recording the highs and lows in the quest for gold. Despite the problems Foster had had, he was in the final crew and they won the gold medal at the Sydney 2000 Olympics. He was awarded an MBE for his part in this in 2001.", "* 2000: Gold, Coxless Four (with James Cracknell, Matthew Pinsent, Steve Redgrave)", "* 1998: Gold, Coxless Four (with James Cracknell, Matthew Pinsent, Steve Redgrave)", "* 1997: Gold, Coxless Four (with James Cracknell, Matthew Pinsent, Steve Redgrave)"]}, {"page": "Devizes to Westminster International Canoe Marathon", "response": ["Personalities to own a DW medal are former leader of the Liberal Democrats, Paddy Ashdown, explorer Sir Ranulph Fiennes, TV Presenter Steve Backshall, Olympic gold medallist rowers James Cracknell and Helen Glover, adventurer Sarah Outen, and the first British woman to climb Everest Rebecca Stephens."]}, {"page": "List of University of Cambridge people", "response": ["*James Cracknell (Peterhouse), double Olympic gold medallist"]}, {"page": "British Rowing Indoor Championships", "response": ["Graham Benton and Emanuele Romoli are two of the main \"non-rower\" to win the men's open event at the BIRC, an event dominated until that time by Olympic water rowers such as Matthew Pinsent (who won in 2003), James Cracknell (second in 2003), and Jamie Schroeder (who won in 2002)."]}, {"page": "Great Britain at the 2000 Summer Olympics", "response": ["|align=left|James CracknellTim FosterMatthew PinsentSteve Redgrave"]}, {"page": "Marathon des Sables", "response": ["*James Cracknell, British rower and adventurer, competed in the 2010 race and became the highest placing Briton to ever compete in the race, finishing 12th until fellow Briton Danny Kendall placed 5th in 2014. In 2017 Tom Evans became the first Briton to finish in the first three, finishing third overall."]}, {"page": "Great Britain at the 1996 Summer Olympics", "response": ["|align=left|James CracknellBob ThatcherGuy Pooley*"]}, {"page": "Kingston Grammar School", "response": ["* James Cracknell — Olympic rowing gold medallist, adventurer"]}, {"page": "Ben Fogle", "response": ["Fogle was the first to cross the line in the pairs division of the 2005–2006 Atlantic Rowing Race in \"Spirit of EDF Energy\", partnered by Olympic rower James Cracknell. While competing in the 3,000-mile race, the pair had their boat fully capsized by huge waves. They made landfall in Antigua at 07.13 GMT on 19 January 2006, a crossing time of 49 days, 19 hours, 8 minutes. After penalties, they were placed second in the pairs and fourth overall. In 2007, the BBC series that followed the pair, Through Hell and High Water, won a Royal Television Society award.", "Fogle teamed up with Cracknell once again, together with Ed Coats, a Bristol-based doctor,Bryony Gordon (8 October 2008). \"James Cracknell's Race to the South Pole  James Cracknell Should Probably Be Spending This Christmas at Home with His Wife, Beverley Turner, Who Will Be Six Months Pregnant with Their Second Child by Then\". The Daily Telegraph. Retrieved 9 July 2012. as Team QinetiQ to take part in the inaugural \"Amundsen Omega 3 South Pole Race\".  Six teams set out to race across the Antarctic Plateau to commemorate the historic race of 1911 between Roald Amundsen and Robert Falcon Scott. Having led the race for much of the time, the team took 18 days, 5 hours and 10 minutes to complete the  race, coming second overall, 20 hours .  Sparks. behind the Norwegian team, who commended them on making it \"a fantastic race\", and over two days ahead of the next placed team. Fogle suffered hypothermia and frostbite to his nose and the team experienced temperatures as low as . The race was filmed by the BBC for the series On Thin Ice and was aired in Summer 2009. Five episodes of On Thin Ice were broadcast on BBC Two Sunday evenings receiving a peak record of 3.7 million viewers. Macmillan published an account of their journey, Race to The Pole, which became a top-10 best-seller in the UK."]}, {"page": "Land's End to John o' Groats", "response": ["There are several annual mass participation cycle rides that go from Land's End to John o' Groats, the biggest of which is the Deloitte Ride Across Britain, run by Threshold Sports. The Ride Across Britain takes over 800 riders the full length of Britain, taking nine days and covering , with each rider covering an average of  per day. Previous celebrity participants include GB rower and Olympic gold medallist James Cracknell and former England Rugby captain Lewis Moody."]}, {"page": "Peterhouse Boat Club", "response": ["In 1948, the Irish Olympian Danny Taylor was a coach while he lectured at Peterhouse. Distinguished coaches since then have included the double Olympic gold-medallist James Cracknell, who rowed in the Peterhouse May Bumps VIII of 2019. ", "*James Cracknell"]}, {"page": "Alex Partridge", "response": ["In 2004, Partridge won the GB Rowing Senior Selection Trials in the pair with Andrew Triggs Hodge. This proved a headache for the selectors who had already shuffled the previous year's crews considerably, in the wake of Matthew Pinsent and James Cracknell's disappointing 4th place in the pair in Milan. Until the trials Pinsent and Cracknell had been training in a four with Steve Williams and Josh West, but following the unexpected trials result replaced West with Partridge. Hodge remained in the Eight. However, following the World Cup in Lucerne, Partridge was diagnosed with a collapsed lung and had to withdraw from the Athens Olympics; he was replaced in the coxless four by Ed Coode, and the crew went on to win the Olympic final beating the Canadian 4- by just 0.08 seconds. Patridge, however, was first across the line; the crew had named their boat after him."]}, {"page": "List of non-professional marathon runners", "response": ["|data-sort-value=\"Cracknell\"|James Cracknell||sports||rowing||2017||London Marathon ||2:43:12||||"]}, {"page": "Beverley Turner", "response": ["Turner married double Olympic Gold medallist rower James Cracknell at Clearwell Castle in Gloucestershire in 2002. They have a son, born in September 2003, and two daughters,  born in March 2009 and April 2011."]}, {"page": "Policy Exchange", "response": ["Policy Exchange authors have included former government advisor Professor Dieter Helm, economist Robert Shiller, author and broadcaster Bill Bryson, historian and journalist Anna Reid, former Financial Times journalist John Willman, and Olympic athlete James Cracknell."]}, {"page": "Through Hell and High Water", "response": ["Through Hell and High Water is a BBC television programme produced by Twofour that aired in the United Kingdom on 1317 February 2006. Five half-hour morning programmes (9:3010am) on BBC1 followed James Cracknell (Olympic rower) and Ben Fogle (television presenter) in their attempt to cross the Atlantic Ocean in \"Spirit of EDF Energy\", a 24-foot rowing boat, with a half-hour summary programme during the evening of the final day on BBC2."]}, {"page": "ITV Sport", "response": ["ITV Sport's award-winning documentary strand has featured the stories of many sporting greats. Sports Life Stories series one was first shown on ITV4 in 2012 and included episodes on Ronnie O'Sullivan, Dame Kelly Holmes, Fabrice Muamba, Barry McGuigan, Gareth Thomas, Brian Lara, Amir Khan and Lawrence Dallaglio. Series two first shown on ITV4 in 2013 included episodes on James Cracknell, David Weir, Nicola Adams, Jermain Defoe, Eric Bristow, Chris Eubank, Didier Drogba and Jimmy White. Series 3 returns in February 2015. Reporters on the series have included Gabriel Clarke, Ned Boulting, Adam Darke and Leon Mann.", "In 2004, ITV won the rights to the annual Varsity Boat Race from the BBC. The contract ran to 2009. Hosts of the coverage were initially Gabby Logan and Mark Durden Smith. Craig Doyle took over as presenter, while Peter Drury commentated. James Cracknell acted as a co presenter and pundit. ITV Sport did not renew its contract for The Boat Race after its contract ended due to wanting to concentrate on football and the rights reverted to the BBC."]}]}}