{"wiki_id": "http://www.wikidata.org/entity/Q1686156", "itemLabel": "Sian Evans", "itemDescription": "Welsh singer", "wikipedia_url": "https://en.wikipedia.org/wiki/Sian_Evans", "wikipedia_page": {"main": "Sian Evans (born 9 October 1971) is a Welsh singer. Throughout the 2000s, she was front woman and singer-songwriter of the band Kosheen, a trip-hop/drum & bass group that, during that decade, placed two albums within the Top Ten of the UK Albums Chart. She has also joined a list of Welsh artists to have topped the UK Singles Chart with collaboration on the track \"Louder\" with DJ Fresh. Kosheen disbanded in 2016.", "link_mentions": [{"page": "Caerphilly", "response": ["* Sian Evans (born 1971), Singer-songwriter of the band Kosheen"]}, {"page": "Music of Wales", "response": ["DJ Sasha is from Hawarden, Flintshire. Also worth noting are the successful Drum and Bass DJ High Contrast who is from Cardiff, the veteran house outfit K-Klass from Wrexham, and the Swansea-based progressive breaks producers Hybrid. Escape into the Park and Bionic Events are examples of the Welsh Hard Dance scene. On 16 July 2011 Sian Evans of trip hop, synthpop Bristol based band Kosheen had a No.1 Official UK Singles Charts hit in collaboration with DJ Fresh."]}, {"page": "Kosheen", "response": ["Kosheen were a British electronic music group based in Bristol, United Kingdom. The group consisted of singer-songwriter Sian Evans, songwriter-producer Markee Ledge and producer-songwriter Darren Decoder. The name Kosheen derives from the name of a North American Apache warrior, Cochise. When in Japan, it was discovered that a combination of the Japanese words for \"old\" (古, romanised transliteration \"ko\") and \"new\" (新, \"shin\") would make \"Kosheen\" in Japanese.", "On 25 October 2011, fresh from the success of Sian Evans collaboration with DJ Fresh \"Louder\" which had reached number 1 in the UK Singles Chart in July, Kosheen confirmed an album release in May 2012, and a single, titled \"Get a New One\", on 13 February. The second single, \"Holding On\", features Susie Ledge as the guest vocalist. An announcement was made by the band on their official website that Independence would be released at the end of September 2012. It was released on 1 October 2012. \"Mannequin\" was later released as the third single from the album. Other songs on the album include \"Waste\", \"Spies\", \"Addict\" and \"Tightly\".", "Sian Evans is currently performing with her Live Band shows and is in the recording studio."]}, {"page": "Ariels (album)", "response": ["*Sian Evans – Vocals"]}, {"page": "DJ Fresh", "response": ["\"Louder\", the first single from his third album Nextlevelism, was released on 3 July 2011. The song was used as part of a Lucozade Lite advertising campaign in the UK and Ireland. The song features vocals from Welsh singer Sian Evans from the band Kosheen and peaked number 4 on the Irish Singles Chart and was the first ever dubstep number one on the UK Singles Chart."]}, {"page": "1973 in Wales", "response": ["*9 October - Sian Evans, singer"]}, {"page": "List of artists who reached number one on the UK Singles Chart", "response": ["| \"Louder\" features Sian Evans\"Hot Right Now\" features Rita Ora", "| Sian Evans"]}, {"page": "List of people with surname Evans", "response": ["*Sian Evans (born 1971), Welsh singer-songwriter"]}, {"page": "List of Never Mind the Buzzcocks episodes", "response": ["|Wayne Sleep and Sian Evans (Kosheen)"]}, {"page": "Resist (Kosheen album)", "response": ["All songs written by Sian Evans, Darren Beale, Mark Morrison 11 & 15 extra writers Jon Hall & Rod Bowkett"]}, {"page": "Kokopelli (album)", "response": ["All songs written by Darren Beale, Sian Evans and Markee Substance."]}, {"page": "Urban Music Awards", "response": ["| Best Dance Act||DJ Fresh ft Sian Evans, “Louder”"]}, {"page": "Damage (Kosheen album)", "response": ["Released on 23 March 2007 (All songs by Sian Evans, Darren Beale, Mark Morrison)", "Released on 10 September 2007 (All songs by Sian Evans, Darren Beale, Mark Morrison)"]}, {"page": "Hervé (DJ)", "response": ["*\"Louder (Hervé Remix)\" - DJ Fresh (feat. Sian Evans) (2011)"]}, {"page": "Roger Shah", "response": ["2012 Hide U (feat. Sian Evans)", "2012 Shine (feat. Sian Evans)"]}, {"page": "List of bands from Bristol", "response": ["*Kosheen: trip hop, drum and bass, rock group (1999–present). The trio consists of producers Markee Substance (Mark Morrison) and Darren Decoder (Darren Beale), with singer and songwriter Sian Evans. Their first album, 'Resist' was released in 2001 and reached No. 8 in the UK album chart. The name of the band is a combination of the Japanese words for \"old\" ('ko') and \"new\" ('shin')."]}, {"page": "List of UK Singles Chart number ones of the 2010s", "response": ["|DJ Fresh featuring Sian Evans"]}, {"page": "Act Now (campaign group)", "response": ["Public figures including Bob Geldof, Joanna Lumley, Brian May, M.I.A., Massive Attack, Sian Evans, Chris Steel, Jasmine Guinness, and Jade Parfitt have supported ACT NOW's campaign for Tamil victims."]}, {"page": "Siân", "response": ["*Sian Evans (born 1971), Welsh singer with Kosheen"]}, {"page": "Drumsound & Bassline Smith", "response": ["Soon afterwards they remixed DJ Fresh's \"Louder\" which was released on 3 July 2011. The song features vocals from Welsh singer Sian Evans from the band Kosheen and hit the Number 1 spot in the UK Singles Chart. Other remixes include Moby's \"After\" & Youngman MC's \"Who Knows\"."]}, {"page": "Scottish Singles and Albums Charts", "response": ["| 16 July || \"Louder\" || DJ Fresh  featuring Sian Evans  || rowspan=\"4\"|21 || rowspan=\"4\"|Adele"]}, {"page": "List of UK top-ten singles in 2011", "response": ["|Sian Evans", "|align=\"left\"|DJ Fresh featuring Sian Evans"]}, {"page": "List of UK Dance Singles Chart number ones of 2011", "response": ["The nine-week reign of LMFAO was ended when Romanian artist Alexandra Stan topped the chart with debut single \"Mr. Saxobeat\" on 4 June. However, the single was pushed to number 2 the following week when British rapper Example scored his first dance number-one single with \"Changed the Way You Kiss Me\" – which also topped the singles chart and independent chart. After four weeks at the peak, Example was replaced by producer DJ Fresh and the commercial breakthrough \"Louder\". The single, which featured vocals from Sian Evans topped the chart with impressive sales of 140,571 copies – also topping the UK chart.", "|rowspan=5|DJ Freshfeaturing Sian Evans"]}, {"page": "List of UK Independent Singles Chart number ones of 2011", "response": ["Adele was then dethroned for a third time during 2011 when French DJ Alex Gaudino topped the chart with Kelly Rowland-collaborated \"What a Feeling\" on 4 June. The following week, rapper Example scored a number-one single with \"Changed the Way You Kiss Me\" – which also topped the singles and dance chart. The single marked the second number-one single from the musician in 2011 alone, having already claimed number-one singles with \"Won't Go Quietly\" (2010) and \"Kickstarts\" (2010). Having spent four consecutive weeks at the peak, Example was dethroned on 10 July by Ministry of Sound artist DJ Fresh with the Sian Evans-assisted \"Louder\" – which also topped the singles chart.", "|rowspan=6|DJ Freshfeaturing Sian Evans"]}, {"page": "Doctor P", "response": ["* DJ Fresh featuring Sian Evans - \"Louder\" (Flux Pavilion & Doctor P Remix) [3 July 2011]"]}]}}