{"wiki_id": "http://www.wikidata.org/entity/Q16867439", "itemLabel": "Camber", "itemDescription": "legendary first king of Cambria", "wikipedia_url": "https://en.wikipedia.org/wiki/Camber_(legendary_king)", "wikipedia_page": {"main": "Camber, also Kamber, was the legendary first king of Cambria, according to the Geoffrey of Monmouth in the first part of his influential 12th-century pseudohistory Historia Regum Britanniae. According to Geoffrey, Cambria, the classical name for Wales, was named for him.\nCamber was the son of Brutus, and a descendant of Aeneas of Troy. Upon his father's death he was given Cambria, while his younger brother Albanactus got Alba (the territory corresponding to modern Scotland; from Welsh Yr Alban) and his older brother Locrinus received Logres (corresponding to England; from Welsh Lloegr) and the title of King of the Britons. When Albanactus was murdered by Humber, King of the Huns, Camber joined Locrinus in attacking and defeating him.\nLike many of the characters reported by Geoffrey, Camber has no historical basis but is the product of Geoffrey of Monmouth's imagination, invented largely for political ends within the contemporary Anglo-Norman world.", "link_mentions": [{"page": "Cambria", "response": ["According to Geoffrey of Monmouth in the first part of his pseudohistory  ('History of the Kings of Britain'), the Trojan Brutus had three sons, among whom he divided his lands after landing in Britain and subduing Gogmagog. His eldest son, Locrinus, received the land between the rivers Humber and Severn, which he called Loegria (a Latinisation of the medieval Welsh name  (modern Welsh: ), later to be most of England). His second son, Albanactus, got the lands beyond the Humber, which took from him the name of Albany (Latin , not to be confused with other places of this name;  in Welsh; later Scotland). The youngest son, Camber, was bequeathed everything beyond the Severn, which was called after him  (later Wales and then-Brittonic areas immediately to the north and south of it)."]}, {"page": "Locrine", "response": ["The opening scene of the play proper shows the aged Brutus, the leader of the Trojans in Britain, before his courtiers, including his three sons, Locrine, Albanact and Camber. Brutus knows he is dying, and attempts to order the kingdom's affairs; among other points, he decrees that Locrine marry Guendoline, the daughter of his loyal general Corineus. The scene ends with Brutus's death. Locrine obeys his father's behest and marries Guendoline."]}, {"page": "Albanactus", "response": ["Albanactus was stated to be the youngest of three sons of Brutus, a descendant of Aeneas of Troy. According to legend, upon their father's death, the eldest son Locrinus was given Loegria, Camber was given Cambria and Albanactus Albania. These names are merely reverse etymologies. Albanactus, for instance, is a reverse etymology of the Scottish word Albannach or \"Alvannach\" (Volcanic Highlands) [of Albanian  Highland people called \"Highlanders\"]  (Scotsman). Likewise, Locrinus represents the medieval Welsh word Loegria (England) (modern Welsh Lloegr), and  Camber represents the Latin word Cambria or the Welsh word Cymru (Wales). ", "All this was supposedly before the Picts and Scots had invaded. Later Kings of England – particularly Edward I – used the Brutus and Albanactus legend as an excuse to claim superiority over and to conquer Scotland, arguing that as Locrinus was the oldest brother, so he and hence England had superior status. The same argument, of course, extended over Wales, as Camber was also junior to Locrinus."]}]}}