{"wiki_id": "http://www.wikidata.org/entity/Q1689361", "itemLabel": "Jimmy Gardner", "itemDescription": "actor from England (1924-2010)", "wikipedia_url": "https://en.wikipedia.org/wiki/Jimmy_Gardner_(actor)", "wikipedia_page": {"main": "Edward Charles James Gardner, DFM (24 August 1924 – 3 May 2010) was an English actor.During World War II, Gardner served in the Royal Air Force as an air gunner with No. 10 Squadron. He completed 30 sorties as a Halifax rear gunner and was awarded the Distinguished Flying Medal.His first film appearance was in The Curse of the Mummy's Tomb released during 1964. Thereafter he appeared in over 30 films and also made extensive TV and theatre appearances. Some of his best known Shakespearean roles such as Adam in As You Like It, and Gravedigger in Hamlet were performed under the direction of Terry Hands.He played Knight Bus driver Ernie Prang in Harry Potter and the Prisoner of Azkaban, the third film in the Harry Potter film series.", "link_mentions": [{"page": "1924 in film", "response": ["*August 24 – Jimmy Gardner, English actor (died 2010)"]}, {"page": "Frenzy", "response": ["* Jimmy Gardner as Hotel Porter"]}, {"page": "The Wednesday Play", "response": ["| Rosemary LeachJimmy GardnerCharles TingwellStephen YardleyGeorge SelwayFrank MillsMichael Turner"]}, {"page": "Theatre 625", "response": ["|Mavis Villiers,Leonard Rossiter,John Le Mesurier,Jimmy Gardner,James Grout,Graham Armitage,Robert Gillespie,Patrick Godfrey", "|Edward Woodward,Ronald Fraser,Vivian Pickles,Paul Hardwick,James Villiers,Donald Layne-Smith,Trader Faulkner,Tim Preece,Nicholas Hawtrey,David Savile,Clifford Cox,Jimmy Gardner,Keith Pyott,Esmond Webb,Richard Hampton,Denis McCarthy", "|Angela Douglas,Bee Duffell,Philip Grout,Jimmy Thompson,Patrick Tull,Jimmy Gardner,David Battley,Job Stewart,Harold Innocent,Brian Steele,Noel Davis,Derek Needs,Henzie Raeburn,Dudley Jones"]}, {"page": "Finding Neverland (film)", "response": ["*Jimmy Gardner as Mr. Snow", "Within the film are scenes of a production of the play, featuring Kelly Macdonald as \"Peter Pan\", Angus Barnett as \"Nana\", Toby Jones as \"Smee\", Kate Maberly as \"Wendy Darling\", Matt Green as \"John Darling\", Catrin Rhys as \"Michael Darling\", Tim Potter as \"Captain Hook\"/\"George Darling\" and Jane Booker as \"Mary Darling\". Mackenzie Crook plays Mr. Jaspers, the theatre usher. Paul Whitehouse plays the stage manager. Eileen Essell, 82 years old at the time, makes one of her first feature film appearances, as Mrs. Snow, an elderly friend and fan of Barrie's. Like Highmore, she also followed Depp to a role in Charlie and the Chocolate Factory. Jimmy Gardner plays her husband."]}, {"page": "Jimmy Gardner (British Actor)", "response": ["#REDIRECT Jimmy Gardner (actor) "]}, {"page": "Arabesque (1966 film)", "response": ["David meets Beshraavi, who asks him to decode the inscription on the piece of paper Sloane stole. David is attracted to Beshraavi's girlfriend Yasmin Azir (Sophia Loren), who tells him that Beshraavi had Ragheeb killed and will do the same to him once he decodes the message. Their conversation is interrupted by Beshraavi. David keeps hidden until Sloane brings it to Beshraavi's attention that David and the cipher are missing. Overhearing the conversation, David wraps the cipher in a candy in his pocket, among others, a red one with the number \"9\". As Beshraavi's men search for David, Beshraavi demonstrates to one of Yasmin's employees, Hemsley (Jimmy Gardner), that he can buy people for their loyalty or else exact extreme revenge.  Forced to show himself, David seemingly abducts Yasmin. They flee from one of Beshraavi's henchmen, Mustapha (Larry Taylor). In the course of the chase, Mustapha and David struggle at the zoological gardens, when another man intervenes and kills Mustapha. He identifies himself as Inspector Webster (Duncan Lamont) with CID. When a guard approaches, Webster kills him before revealing that he is working with Yasmin. Webster knocks David unconscious."]}, {"page": "Here Come the Double Deckers", "response": ["* David Hutcheson, Jimmy Gardner, Robin Askwith in episode 10."]}, {"page": "The Curse of the Mummy's Tomb", "response": ["*Jimmy Gardner: Fred's mate"]}, {"page": "Gardner (surname)", "response": ["* Jimmy Gardner (disambiguation)", "** Jimmy Gardner (ice hockey) (1881–1940), Canadian professional ice hockey forward", "** Jimmy Gardner (boxer) (1885–1964), Irish-American boxer", "** Jimmy Gardner (actor) (1924–2010)"]}, {"page": "Eddie Yeats", "response": ["After his brief stay with the Ogdens, Eddie lived at Monkey Gibbons's house. Stan and Hilda began to regard Eddie as the son they never had. In 1977, he started a short-lived curtain-making business with Hilda but this ended when Mike Baldwin (Johnny Briggs) would not let Hilda use his factory. Eddie regularly tried to sell products to his neighbours, insisting nothing was stolen or faulty, but there was always a problem of some sort. He sold Rovers Return landlady Annie Walker (Doris Speed) a carpet with her initials on it. The initials were the same because the carpet came from the Alhambra Weatherfield Bingo Hall. His promise to get a colour television for the Ogdens was similarly unsuccessful as he only managed to get them a colour tinted screen. In 1978, Eddie was suspected by the police of stealing Stan's handcart and filling it with lead stolen from Farraday Street, even though Eddie's friend, Tiny Hargreaves (Jimmy Gardner), was the real culprit. The cart was impounded by the police when Hilda took it back and Eddie and Stan claimed it was stolen. But the police found Eddie's fingerprints on the cart and Stan discredited Eddie's alibi by claiming not to know him. Eddie forgave Stan when he told the police the truth, but to clear themselves, they had to admit who the real culprit was and Eddie hated the thought of shopping his friends to the police."]}, {"page": "1924 in the United Kingdom", "response": ["** Jimmy Gardner, actor (died 2010)"]}, {"page": "Take Me High", "response": ["* Jimmy Gardner as Hulbert"]}, {"page": "The Committee (film)", "response": ["* Jimmy Gardner as Boss"]}, {"page": "List of The Avengers and The New Avengers cast members", "response": ["* Jimmy Gardner"]}, {"page": "The Lion, the Witch and the Wardrobe (1967 TV serial)", "response": ["* Jimmy Gardner — Mr. Beaver"]}, {"page": "List of American films of 2004", "response": ["| Harry Potter and the Prisoner of Azkaban || Warner Bros. Pictures / Heyday Films || Alfonso Cuarón (director); Steve Kloves (screenplay); Daniel Radcliffe, Rupert Grint, Emma Watson, Michael Gambon, Maggie Smith, David Thewlis, Gary Oldman, Timothy Spall, Robbie Coltrane, Alan Rickman, Emma Thompson, Julie Christie, Julie Walters, Mark Williams, Richard Griffiths, Fiona Shaw, David Bradley, Devon Murray, Tom Felton, Bonnie Wright, Dawn French, Paul Whitehouse, Adrian Rawlins, Geraldine Somerville, Pam Ferris, Domhnall Gleeson, Harry Melling, Lee Ingleby, Lenny Henry, Jimmy Gardner, Jim Tavaré, Robert Hardy, Oliver Phelps, James Phelps, Chris Rankin, Matthew Lewis, Sitara Shah, Jennifer Smith, Bronson Webb, Josh Herdman, Genevieve Gaunt, Alfred Enoch, Jamie Waylett, Danni Tabor || Fantasy ||", "| Finding Neverland || Miramax Films || Marc Forster (director); David Magee (screenplay); Johnny Depp, Kate Winslet, Julie Christie, Radha Mitchell, Dustin Hoffman, Freddie Highmore, Nick Roud, Joe Prospero, Luke Spill, Ian Hart, Oliver Fox, Mackenzie Crook, Kelly Macdonald, Angus Barnett, Toby Jones, Kate Maberly, Matt Green, Catrin Rhys, Tim Potter, Jane Booker, Eileen Essell, Jimmy Gardner, Paul Whitehouse, Murray McArthur || Biography, Drama ||"]}, {"page": "List of actors who have played Narnia characters", "response": ["|Jimmy Gardner"]}, {"page": "Say Hello to Yesterday", "response": ["| Jimmy Gardner || Balloon seller (uncredited)"]}, {"page": "Jimmy Gardner", "response": ["Jimmy Gardner may refer to:", "* Jimmy Gardner (ice hockey) (1881–1940), Canadian professional ice hockey forward", "* Jimmy Gardner (boxer) (1885–1964), Irish-American boxer", "* Jimmy Gardner (actor) (1924–2010), British actor", "* Jimmy Gardner (footballer) (born 1967), Scottish footballer"]}, {"page": "Take a Girl Like You (film)", "response": ["* Jimmy Gardner as Voter"]}, {"page": "The Murder Game (1965 film)", "response": ["* Jimmy Gardner as Arthur Gillett"]}, {"page": "2010 in the United Kingdom", "response": ["**Jimmy Gardner, actor (b. 1924)"]}, {"page": "Deaths in May 2010", "response": ["*Jimmy Gardner, 85, British character actor (The Curse of the Mummy's Tomb, Harry Potter and the Prisoner of Azkaban) ."]}, {"page": "Jimmy Gardner (British actor)", "response": ["#REDIRECT Jimmy Gardner (actor)"]}, {"page": "Thursday Theatre", "response": ["| Derek GodfreyJack MacGowranFrances CukaJohn HurtCarmel McSharryErik ChittyJonathan BurnTina PackerJimmy Gardner"]}, {"page": "August 1924", "response": ["*Born: Ahmadou Ahidjo, 1st President of Cameroon, in Garoua (d. 1989); Jimmy Gardner, actor, in Newmarket, Suffolk, England (d. 2010); Bob Thompson, composer, arranger and orchestra leader, in San Jose, California (d. 2013)"]}, {"page": "The Sleeper (2000 film)", "response": ["* Jimmy Gardner as Ernest Page"]}]}}