{"wiki_id": "http://www.wikidata.org/entity/Q1681378", "itemLabel": "Jamie Baker", "itemDescription": "British tennis player", "wikipedia_url": "https://en.wikipedia.org/wiki/Jamie_Baker_(tennis)", "wikipedia_page": {"main": "Jamie Baker (born 5 August 1986) is a retired British professional male tennis player, who was British No. 2 in 2008.He won the first match of Leon Smith's tenure as Davis Cup captain, in the tie against Turkey, helping Great Britain to a first Davis Cup win in three years.\nBaker has twelve Futures single titles; in doubles, he has 1 Challenger and four Futures titles.\nAfter retiring from tennis, Baker moved into Corporate Finance for a bank,  whilst also being a part-time television pundit for Eurosport and the BBC.", "link_mentions": [{"page": "James Baker (disambiguation)", "response": ["James, Jim(mie), Jimmy, or Jamie Baker may also refer to:", "* Jamie Baker (ice hockey) (born 1966), Canadian professional hockey centre and sports broadcaster", "* Jamie Baker (tennis) (born 1986), British former tennis player"]}, {"page": "Andy Roddick", "response": ["Roddick's next tournament was the Aegon International, where he received a wild card into the main draw as the sixth seed. In the first round, he led countryman Sam Querrey 5–2 in the first set when Querrey retired injured. Roddick then beat Jérémy Chardy and Fabio Fognini to set up a semifinal with qualifier Steve Darcis, which Roddick led 6–3, 3–1 when Darcis retired. Roddick then proceeded to defeat defending champion Andreas Seppi in the final for his 31st career title and first of 2012. He thus became the only male tennis player besides Roger Federer to have won at least one title every year in the past 12 years. Roddick began his Wimbledon campaign with a first-round match against British wild-card entrant Jamie Baker. He beat German qualifier Björn Phau in the second round in straight sets. He lost to David Ferrer in the third round in four sets."]}, {"page": "Alex Bogdanovic", "response": ["At Queen's he managed to gain an impressive victory over world number 42 Hyung-Taik Lee, and beat British youngster Jamie Baker in the second round to play Andy Roddick. He put on a superb performance against Roddick having won the first set 6–4, and pushed Roddick to a close tie-break in the second set. During the tie-break he was two points from victory, but Roddick took advantage of the Hawk-eye system and a correctly challenged call put him 6–5 up in the tie-break before winning the second set to make it one set all. Roddick broke Alex's serve for the first time in the final set making the final result 4–6 7–6(7–5) 6–4. Bogdanovic's impressive run at Queen's meant a career high of 108. After the match Roddick complimented Bogdanovic and claimed he was \"lucky to get out of there.\" He eagerly backed the idea Alex should easily burst into the top 50 at least by the end of 2007, though this did not happen.", "James Ward lost at the first hurdle in six of his seven tournaments at the beginning of this year, so Leon Smith sprang a surprise when his final choice of singles players were James Ward (No 214) and Jamie Baker (No 406), who had lost first time out in his last two events. James Ward won both his singles rubbers, and with GB’s doubles win, Great Britain clinched the tie."]}, {"page": "2005 Wimbledon Championships", "response": ["#  Jamie Baker /  Claire Curran"]}, {"page": "Harel Levy", "response": ["| Jamie Baker   Brendan Evans"]}, {"page": "Hilton Waikoloa Village USTA Challenger", "response": ["|2007 ||  Michael Russell ||  Jamie Baker || 6-1, 7-5"]}, {"page": "Juan Martín del Potro", "response": ["In his first grass-court event, del Potro beat Thomas Johansson in two sets and reached the second round at the Queen's Club, where he lost to Nadal. He also reached the quarterfinals in Nottingham the following week; there he beat British qualifier Jamie Baker and Kunitsyn in the first two rounds, but lost to Ivo Karlović at the quarterfinal stage. At his inaugural Wimbledon Championships, he defeated Davide Sanguinetti in the first round, before losing to eventual champion Roger Federer in the second round, after a rain delay in the third set."]}, {"page": "2006 Wimbledon Championships", "response": ["#  Jamie Baker"]}, {"page": "2007 Wimbledon Championships", "response": ["#  Jamie Baker", "#  Jamie Baker /  Alex Bogdanovic"]}, {"page": "Bobby Reynolds", "response": ["| Jamie Baker  James Ward"]}, {"page": "2008 Wimbledon Championships", "response": ["| Jamie Baker (WC)", "#  Jamie Baker"]}, {"page": "Dan Evans (tennis)", "response": ["After not initially being picked for Great Britain's squad for the Davis Cup tie versus Russia, Evans was given a last-minute place ahead of Britain's no. 3, Jamie Baker. Evans played valiantly in his first rubber against world no. 67 Dmitry Tursunov before losing in five tight sets. With Great Britain trailing 2–0 to Russia, the GB doubles pairing of Colin Fleming and Jonny Marray reduced the deficit a day later, before James Ward levelled the tie at 2–2 after beating Tursunov in five sets. The result meant that Evans had the chance to complete an unlikely comeback when he faced world no. 80 Evgeny Donskoy in the final rubber. Evans defeated Donskoy comprehensively in straight sets, thus securing what was described as a \"famous victory\". The last time Great Britain had come from 2–0 down to win a Davis Cup tie was 83 years ago against Germany, Consequently, Great Britain won a place in the 16-team World Group play-offs in September."]}, {"page": "Alexandr Dolgopolov", "response": ["Dolgopolov started off his grass-court season seeded seventh at the Aegon International, with wins over Jamie Baker, Lu Yen-hsun, and James Ward, before falling to Michaël Llodra in the semifinals, despite being 4–1 up in the second set. Dolgopolov defeated Marco Chiudinelli in the first round of the 2010 Wimbledon Championships. He put on a solid performance against Jo-Wilfried Tsonga in the second round, but ultimately succumbed to the Frenchman in five sets."]}, {"page": "Jo-Wilfried Tsonga", "response": ["Tsonga's French Open 2012 started off in shaky fashion after dropping the first set to Russian qualifier Andrey Kuznetsov. However, he closed out the match and then had wins over Cedrik-Marcel Stebe, Fabio Fognini, and Stanislas Wawrinka. In the quarterfinals against Novak Djokovic, he lost in five sets. The grass-court season began with the Aegon Championships. He defeated Britain's Jamie Baker, but was ousted by Ivan Dodig in three extremely tight sets. He also suffered a finger injury during the match after diving in an attempt to retrieve a ball."]}, {"page": "Michael Russell (tennis)", "response": ["| Jamie Baker"]}, {"page": "2008 Australian Open", "response": ["#  Jamie Baker"]}, {"page": "Great Britain Davis Cup team", "response": ["Leon Smith was appointed as team captain in 2010. His first tie was against Turkey in the play-offs of the Europe/Africa Zone Group II (the second lowest tier in the game) at home in Eastbourne, UK. A defeat would have sent the national team to the lowest tier of the game. Smith picked James Ward, Jamie Baker, Colin Fleming and Ken Skupski to play the tie, and defeated Turkey 5–0. This would mark the beginning of the team's resurgence. In 2011, the team won the Europe/Africa Zone Group II (third division), and was promoted to the Europe/Africa Zone Group I. Andy Murray, who had not played in the 2009 competition, returned in 2010 for the match against Luxembourg, winning 6–0, 6–0, 6–0 against Laurent Bram in the first rubber. Explaining his hiatus, Murray quipped that he \"wanted the younger guys to step up and experience it\", claiming \"There was no use for us being in the World Group because we weren't ready for it.\" 2012 started well, with a 3–2 victory over Slovakia, but ended with the first defeat under Smith's captaincy against Belgium."]}, {"page": "2007 US Open (tennis)", "response": ["Qualifying Day 2 saw much rain. However, according to this link, players such as Emmanuelle Gagliardi, Pablo Cuevas, Jamie Baker, Steve Darcis, Alina Jidkova and Aisam-ul-Haq Qureshi were winners to the following round of qualifying. In addition, main singles draws for men and women were released, except qualifiers' names; however the draw shows where qualifiers will go. Roger Federer, seeded first, will play a qualifier for the first two rounds, and possibly three consecutive rounds.Source  "]}, {"page": "Josh Goodall", "response": ["|  Jamie Baker"]}, {"page": "Satoshi Iwabuchi", "response": ["| Jamie Baker"]}, {"page": "Konstantinos Economidis", "response": ["|  Jamie Baker"]}, {"page": "Somdev Devvarman", "response": ["In August 2008, Devvarman made the quarterfinals of the Legg Mason Tennis Classic, first beating Sam Warburg, Jamie Baker, and Soeda to qualify, and then beating Taylor Dent and Robert Kendrick in the main draw, before losing to Russian Igor Kunitsyn."]}, {"page": "Sam Warburg", "response": ["| Jamie Baker", "| Jamie Baker   Brendan Evans"]}, {"page": "Sam Groth", "response": ["Groth beat Mark Philippoussis in a 2007 match; Philippoussis subsequently focused on the seniors tour. Groth qualified for the ATP event in Nottingham where he defeated Britain's Jamie Baker 7–6, 6–3 in the first round. He lost his second round match to seeded Gilles Simon 7–6(7–1), 4–6, 4–6.", "| Jamie Baker   Aisam Qureshi"]}, {"page": "Andrew Coelho", "response": ["| Jamie Baker   Aisam Qureshi"]}, {"page": "James Ward (tennis)", "response": ["The new Davis Cup captain Leon Smith selected Ward to take part in Great Britain's vital Davis Cup tie vs Turkey at Eastbourne in July alongside Jamie Baker, Ken Skupski, Colin Fleming, and Alex Ward (non-player). Defeat would have meant Great Britain's relegation to Europe Zone Group III. Ward contributed to the victory by winning both his singles matches, Britain eventually winning 5–0, and giving Great Britain a first Davis Cup win in three years.", "So when Leon Smith, Britain's Davis Cup captain selected his team for the Euro/Africa Zone Group II tie against Tunisia in March, he sprang a surprise, omitting Alex Bogdanovic, having recalled the 26-year-old to the squad after a three-year absence. Instead, Smith's singles players were Ward (No. 214) and Jamie Baker (No. 406), who had lost first time out in his last two events. Although Bogdanovic (No. 374) had lost all six of his live Davis Cup rubbers, he had at least won a Futures tournament in the United States that year. Ward played a key role in Great Britain's 4–1 victory, winning both his live singles rubbers, and ultimately clinching the tie by beating Malek Jaziri 3–6, 6–3, 3–6, 6–3, 8–6 in the fourth rubber.", "| Jamie Baker", "| Jamie Baker"]}, {"page": "Chris Eaton (tennis)", "response": ["| Jamie Baker", "| Jamie Baker", "| Jamie Baker"]}, {"page": "2010 ATP Challenger Tour", "response": ["| Jamie Baker James Ward6–3, 6–4|| Bobby Reynolds Fritz Wolmarans"]}, {"page": "Colin Fleming", "response": ["The new Davis Cup Captain Leon Smith selected Fleming to take part in Great Britain's vital Davis Cup tie vs Turkey, at Eastbourne, in July alongside Ken Skupski, James Ward, Jamie Baker, and Alex Ward. Defeat would have meant Great Britain's relegation to Europe Zone Group III, the lowest tier of the competition. Fleming/Skupski secured the 6-3, 6-4, 6-4 win that gave Britain an unassailable 3-0 lead, giving Great Britain a first Davis Cup win in three years.", "In March, Fleming was called up to take part in Great Britain's Davis Cup 1st round tie vs Tunisia, at Bolton alongside Jamie Baker, James Ward and Jamie Murray. Fleming played alongside Jamie Murray versus Slim Hamza and Malek Jaziri, winning 6–1, 3–6, 6–3, 6-4. Great Britain went on to win the Europe/Africa Zone Group 1 tie 4-1."]}, {"page": "Savannah Challenger", "response": ["| 2010 ||  Jamie Baker James Ward ||  Bobby Reynolds Fritz Wolmarans || 6–3, 6–4"]}, {"page": "Busan Open", "response": ["| 2011 ||  Im Kyu-tae Danai Udomchoke ||  Jamie Baker Vasek Pospisil || 6–4, 6–4"]}]}}