{"wiki_id": "http://www.wikidata.org/entity/Q16997408", "itemLabel": "Mary Woodall", "itemDescription": "British museum director and art historian", "wikipedia_url": "https://en.wikipedia.org/wiki/Mary_Woodall", "wikipedia_page": {"main": "Mary Woodall also known as \"Mighty Mary\" (1901–1988) was a British art historian, museum director, and Thomas Gainsborough scholar.\n\n", "link_mentions": [{"page": "Richard Wilson (painter)", "response": ["In 1948, Mary Woodall, keeper of art at Birmingham Museum and Art Gallery, organized a pioneer exhibition of his work.Kenneth Garlick, ‘Woodall, Mary (1901–1988)’, Oxford Dictionary of National Biography, Oxford University Press, Sept 2004"]}, {"page": "Birmingham Museum and Art Gallery", "response": ["Seven galleries had to be rebuilt after being bombed in 1940. Immediately after World War II \"Mighty Mary\" Mary Woodall (1901–1988) was appointed keeper of art under director, Trenchard Cox. Woodall and Cox, through their links to the London art world, were able to attract exhibitions, much publicity and donations to the gallery. In 1956, Woodall replaced Cox when the latter became Director of the Victoria and Albert Museum.Kenneth Garlick, 'Woodall, Mary (1901–1988)', Oxford Dictionary of National Biography, Oxford University Press, September 2004."]}, {"page": "Trenchard Cox", "response": ["In 1944 Cox's skills as an administrator saw him take up the post of Director of Birmingham Museum and Art Gallery. He restored the museum buildings back to the original function, after they had been used as council offices for 5 years during the war, managing to refurbish and restore them on a tight budget. With the help of the Keeper of the Department of Art, Dr. Mary Woodall, he established excellent relations with the Birmingham Corporation and established the museum as a leading institution. Cox is well known for the care and support he gave to museum staff, always remembering to send a note of congratulation to those responsible for a new exhibition or display. In 1947 he published a book on David Cox (no relation), Birmingham's most famous landscape painter. In 1954 he was made a Commander of the Order of the British Empire (CBE)."]}, {"page": "Animal, Vegetable, Mineral?", "response": ["| 17 May 1956 || John Betjeman || Metropolitan Museum of Art, New York || Stephen Bone, Sir Gerald Kelly, Mary Woodall || ", "| Mary Woodall || Panellist || Unknown episodes"]}, {"page": "1959 Birthday Honours", "response": ["* Mary Woodall, Director, Birmingham City Museum and Art Gallery."]}, {"page": "List of Somerville College, Oxford, people", "response": ["*Mary Woodall (1901–1988), art historian, museum director, and Thomas Gainsborough scholar"]}]}}