{"wiki_id": "http://www.wikidata.org/entity/Q16995506", "itemLabel": "Judith Dunn", "itemDescription": "British psychologist and academic", "wikipedia_url": "https://en.wikipedia.org/wiki/Judith_Dunn", "wikipedia_page": {"main": "Judith Frances Dunn,  (born 1939) is a British psychologist and academic, who specialises in social developmental psychology.", "link_mentions": [{"page": "Martin Bernal", "response": ["In 1961, Bernal married Judy Pace (later known as Judith Dunn). Together, they had one daughter and twin sons. They later divorced. His second wife, Leslie Miller-Bernal, and his five children survived him.Black Athena, Vol III, Preface"]}, {"page": "Sibling rivalry", "response": ["According to observational studies by Judith Dunn, children are sensitive from the age of one year to differences in parental treatment. From 18 months, siblings can understand family rules and know how to comfort and be kind to each other. By the age of 3, children have a sophisticated grasp of social rules, can evaluate themselves in relation to their siblings, and know how to adapt to circumstances within the family."]}, {"page": "Dunn (surname)", "response": ["*Judith Dunn (born 1939), British psychologist"]}, {"page": "Robert Plomin", "response": ["In 1987 Plomin married Judith Dunn, a British psychologist and academic."]}, {"page": "List of developmental psychologists", "response": ["*Judith Dunn"]}, {"page": "Marilyn Wood", "response": ["In New York City, her professional apprenticeship began with the Alwin Nikolais Company at the Henry Street Playhouse (1951-1957). This was followed by five years performing in the early Merce Cunningham and Dance Company (1958-1963), and touring with John Cage, Robert Rauschenberg, Merce Cunningham, and five other dancers: Carolyn Brown, Viola Farber, Remy Charlip, Judith Dunn and Steve Paxton.Potter, Michelle. \"A License to Do Anything: Robert Rauschenberg and the Merce Cunningham and Dance Company.” Dance Chronicle, Vol. 16, No. 1 (1993): 1-43. Taylor & Francis, Ltd. Their touring repertoire in a VW bus with John Cage, music director (and driver), and Robert Rauschenberg, designer of sets, lighting and costumes, reflected the intense involvement towards all art-making aspects during the 50s and 60s in lower Manhattan. Marilyn danced in several notable pieces in the Merce Cunningham and Dance Company including \"Summerspace,\" “Rune,” “Antic Meet,” and “Crises,” now legendary works of the golden age of early modern dance."]}, {"page": "Families Need Fathers", "response": ["The organization advocates for shared parenting, whereby the children live substantial amounts of time with both of their divorced or separated parents. They base their advocacy on scientific studies showing that shared parenting is in the best interest of children, citing research by Malin Bergström, Robert Bauserman, Richard Layard, Judith Dunn, Rebekah Levine Coley and Bethany L. Medeiros, among others.Families Need Fathers, What is Shared Parenting?Families Need Fathers, Shared Parenting Research "]}]}}