{"wiki_id": "http://www.wikidata.org/entity/Q1699469", "itemLabel": "John Butcher", "itemDescription": "English tenor and soprano saxophone player", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Butcher_(musician)", "wikipedia_page": {"main": "John Butcher (born 1954) is an English tenor and soprano saxophone player.", "link_mentions": [{"page": "Free improvisation", "response": ["The Spontaneous Music Ensemble was formed by John Stevens and Trevor Watts in the mid-1960s and included, at various times, influential players such as Derek Bailey, Evan Parker, Kenny Wheeler, Roger Smith, and John Butcher. As with the Association for the Advancement of Creative Musicians (AACM), many of these players began in jazz, but gradually pushed the music into a zone of abstraction and relative quietude. The British record label Emanem has documented much music in this vein."]}, {"page": "Derek Bailey (guitarist)", "response": ["* Vortices and Angels, John Butcher (2001)"]}, {"page": "Spontaneous Music Ensemble", "response": ["Countless other musicians passed through the SME over the years, including Derek Bailey, Paul Rutherford, Maggie Nichols, Dave Holland, Barry Guy, Peter Kowald and Kent Carter. The final edition of the group was a trio of Stevens, Smith, and the saxophonist John Butcher, a configuration documented on A New Distance (1994). ", "*A New Distance (1994, Acta; reissued by Emanem Records in 2005 with additional material from 1993) (featuring John Stevens, John Butcher, Roger Smith)", "*Interview with John Butcher by Jon Morgan (containing detailed discussion of Stevens and SME)"]}, {"page": "Incus Records", "response": ["|, John Butcher, Oren Marshall "]}, {"page": "David Sylvian", "response": ["In 2011, the double disc Died in the Wool was released as variations on the 2009 release Manafon with the addition of six new pieces, including collaborations with composer Dai Fujikura, producers Jan Bang and Erik Honoré, and a roster of contemporary musicians and improvisers. For the first time, a stereo mix of the audio installation \"When We Return You Won't Recognise Us\" is available on CD, pairing a group of improvisers – John Butcher, Arve Henriksen, Günter Müller, Toshimaru Nakamura, and Eddie Prévost – with a string sextet directed by Fujikura."]}, {"page": "Miya Masaoka", "response": ["**Guerrilla Mosaics (1999, 482 Music) (as a trio with John Butcher, Gino Robair)"]}, {"page": "John Stevens (drummer)", "response": ["SME played for its last time in 1994, when it included John Butcher. Stevens died later that year, from a heart attack, aged 54."]}, {"page": "Otomo Yoshihide", "response": ["* Quintet/Sextet (2013) with Sachiko M, Evan Parker, John Butcher, John Edwards and Tony Marsh,"]}, {"page": "AMM (group)", "response": ["Prévost and Tilbury continue to record and perform as AMM. They performed in London during December 2004, with Sachiko M joining as a guest, at the 2005 LMC Festival of Experimental Music, with David Jackman as a guest, and at a festival of experimental music in Belgium in February 2006. They also released a duo CD as AMM, Norwich, during 2005, and in 2009, the CD Trinity with guest John Butcher.", "In 2010 the core duo of Eddie Prévost and John Tilbury along with John Butcher, Christian Wolff and Ute Kangiesser released a CD called \"Sounding Music\" (the first simply tagged as AMM after 2005's Norwich) containing the concert performed at \"Freedom of the City\" festival, Conway Hall, London on 3 May 2009.", "| 2009 || Trinity || Prévost/Tilbury & John Butcher || recorded at Trinity College of Music in Greenwich on 13 January 2008 Matchless recordings mrcd71", "| 2010 || Sounding Music || Prévost/Tilbury & John Butcher, Christian Wolff, Ute Kanngiesser || recorded at a concert given at the \"Freedom of the City\" festival, Conway Hall, London on Sunday 3 May 2009 Matchless Recordings mrcd77"]}, {"page": "Toshimaru Nakamura", "response": ["Nakamura founded the ensemble A Paragon of Beauty in 1992. He has recorded solo albums, worked as a session musician, and collaborated with artists including Sachiko M (\"a kindred spirit\"), Otomo Yoshihide, Keith Rowe, John Butcher, Espen Reinertsen, Nicholas Bussmann, Taku Sugimoto, Tetuzi Akiyama, dancer Kim Ito, and drummer Jason Kahn."]}, {"page": "Thomas Lehn", "response": ["Lehn has recorded with Marcus Schmickler, Keith Rowe, John Butcher, Phil Minton, Phil Durrant, Radu Malfatti, Axel Dörner, Cor Fuhler, Gerry Hemingway, and Andy Moor of The Ex. He is a member of the electronic orchestra M.I.M.E.O..", "*Thermal (with John Butcher /Andy Moor) (2001, CD, Unsounds)"]}, {"page": "Weasel Walter", "response": ["He has performed as leader and sideperson in a number of bands, including Cellular Chaos and Lydia Lunch Retrovirus. Walter has worked with Marshall Allen, John Butcher, Tim Dahl, Peter Evans, Mary Halvorson, Henry Kaiser, Joe Morris, Jim O'Rourke, Evan Parker, Elliott Sharp, Ken Vandermark, and William Winant, as well as in bands including Sharon Cheslow, Bobby Conn, Cheer-Accident, Cock E.S.P., Curse of the Birthmark, Erase Errata, Harry Pussy, Lair of the Minotaur, Quintron, The Chicago Sound, The Scissor Girls, U.S. Maple, and XBXRX. He has produced albums by AIDS Wolf, Arab on Radar, Glenn Branca, Burmese, Lydia Lunch, Coachwhips, and Total Shutdown.", ";with John Butcher & Damon Smith"]}, {"page": "List of free improvising musicians and groups", "response": ["* John Butcher – saxophone"]}, {"page": "Keiji Haino", "response": ["Other groups Haino has formed include Vajra (with underground folk singer Kan Mikami and drummer Toshiaki Ishizuka), Knead (with the avant-prog outfit Ruins), Sanhedolin (with Yoshida Tatsuya of Ruins and Mitsuru Nasuno of Korekyojinn, Altered States and Ground Zero) and a solo project called Nijiumu. He has also collaborated with many artists, including Faust, Boris, Derek Bailey, Joey Baron, Peter Brötzmann, Lee Konitz, Loren Mazzacane Connors, Charles Gayle, Earl Kuck, Bill Laswell, Musica Transonic, Stephen O'Malley, Makigami Koichi, Ayuo, Merzbow, Oren Ambarchi, Jim O'Rourke, John Zorn, Yamantaka Eye, John Duncan, Fred Frith, Charles Hayward and John Butcher.", "*Light never bright enough(with John Butcher) (CD/LP 2017)"]}, {"page": "Kongsberg Jazzfestival", "response": ["Several worldwide great artists have visited Kongsberg during this festival; international stars including Chick Corea, Herbie Hancock, John Scofield, Nigel Kennedy, Niels-Henning Ørsted Pedersen, Dee Dee Bridgewater, Charles Mingus, Wayne Shorter, Dianne Reeves, McCoy Tyner, Radka Toneff, Bobby McFerrin, John Butcher, Anthony Braxton, Diana Krall and Pat Metheny have played in Kongsberg several times."]}, {"page": "David Toop", "response": ["* Until the Night Melts Away (with John Butcher and Sharon Gal) (2021)"]}, {"page": "John Tilbury", "response": ["* Exta with John Butcher (Fataka, 2013)"]}, {"page": "Tim Perkis", "response": ["He has collaborated with John Bischoff, Chris Brown, John Butcher, Eugene Chadbourne, Fred Frith, Gianni Gebbia, Scot Gresham-Lancaster, Luc Houtkamp, Yoshi Ichiraku, Joelle Leandre, Roscoe Mitchell, Gino Robair, the ROVA Saxophone Quartet, Elliott Sharp, Leo Wadada Smith, and John Zorn.", "\"Buddy Systems\" 1998 Gino Robair plays selected duos and trios, with John Butcher and Tim Perkis, Otomo Yoshihide, Carl Kihlstedt and Matthew Sperry, Dan Plonsey, LaDonna Smith, Splatter Trio, Oluyemi Thomas, and Myles Boisen on Meniscus(Minneapolis). CD"]}, {"page": "Paal Nilssen-Love", "response": ["Continuing, \"by the early 2000s, Nilssen-Love had launched an international career, playing alongside Swedish saxophonist Mats Gustafsson and American reed player Ken Vandermark, among others.\" He has worked with his trio Vandermark and Ab Baars, the bands Large Unit (a big band, with about 14 members, which he has led and composed for since 2013), School Days, The Thing, Scorch Trio, Territory Band, FME, and various duo projects such as with reedmen Peter Brötzmann and Vandermark guitarist Terrie Hessels (The Ex), saxophonist John Butcher, organist Nils Henrik Asheim, and noise experimentalist Lasse Marhaug. NRK.no (in Norwegian)"]}, {"page": "List of jazz saxophonists", "response": ["* John Butcher (born 1954) (tenor, soprano, baritone)"]}, {"page": "Emanem Records", "response": ["* 4029 John Butcher / Phil Durrant / John Russell The Scenic Route (1998)", "* 4045 John Butcher Fixations (14) (1997–2000)", "* 4049 John Butcher With Derek Bailey & Rhodri Davies Vortices & Angels (2000)", "* 4063 Chris Burn / John Butcher / Rhodri Davies / John Edwards The First Two Gigs (2000)", "* 4089 John Butcher & John Edwards Optic (2001–2)", "* 4142 John Butcher The Geometry of Sentiment (2004/6)"]}, {"page": "The Stone (music space)", "response": ["* John Butcher"]}, {"page": "John Butcher", "response": ["John Butcher may refer to:", "*John Butcher (musician) (born 1954), British saxophonist", "*John Butcher (Australian footballer) (born 1991), Australian rules footballer with the Port Adelaide Football Club", "*John Butcher, 1st Baron Danesfort (1853–1935), British lawyer", "*John Butcher (British politician) (1946–2006), Conservative MP for Coventry South-West 1979–1997", "*John Butcher (baseball) (born 1957), former Major League Baseball player", "*John Butcher (English footballer) (born 1956), English association football goalkeeper who played for Blackburn"]}, {"page": "Fred Lonberg-Holm", "response": ["When he lived in New York, Lonberg-Holm collaborated with the rock group God Is My Co-Pilot pianist and composer Anthony Coleman as well as multi-instrumentalist Paul Duncan of Warm Ghost.  In Chicago, he worked with Jim O'Rourke, Bobby Conn,  The Flying Luttenbachers, Lake of Dracula, Wilco, Rivulets, Mats Gustafsson, Sten Sandell, Jaap Blonk, and John Butcher."]}, {"page": "Fred Frith discography", "response": ["With John Butcher", "With John Butcher and Theresa Wong"]}, {"page": "Luciano Chessa", "response": ["Chessa's Futurist expertise has resulted in an invitation by RoseLee Goldberg, General Director of the New York-based Biennale of the Arts PERFORMA to direct the first reconstruction project of Russolo's earliest intonarumori orchestra, and to curate concerts of music specifically commissioned for this orchestra. The new intonarumori ensemble has been unveiled in October 2009 at San Francisco's YBCA's Novellus Theater and then presented in NYC's Town Hall in November for PERFORMA 09—both events being co-produced by PERFORMA and SFMOMA, and featuring Minna Choi's Magik*Magik Orchestra. This production presented an impressive array of world premieres written by such composers and ensembles as Blixa Bargeld, John Butcher, Tony Conrad, James Fei, Ellen Fullman, Ghostdigital with Finboggi Petusson and Caspar Electronics, Nick Hallett, Carla Kihlstedt + Matthias Bossi, Ulrich Krieger, Joan La Barbara, Pauline Oliveros, Pablo Ortiz, Mike Patton, Anat Pick, Elliott Sharp, Jennifer Walshe, Theresa Wong, Text of Light. The production, also featuring Chessa's L’acoustique ivresse, for bassvoice and intonarumori ensemble and the modern premiere of Russolo's Risveglio di una città in a new diplomatic edition by Chessa, was hailed by The New York Times among the best events in the arts of 2009. In September 2010 Chessa presented the intonarumori in the first Italian appearance: a concert at the MART in Rovereto, Italy, as part of the Festival Transart, which featured performances by Nicholas Isherwood and included Sylvano Bussotti's \"VARIAZIONE RUSSOLO-Slancio d'angoli\", and two new commissioned pieces by Margareth Kammerer and Teho Teardo. In March 2011 Chessa conducted the Orchestra of Futurist Noise Intoners in a sold out concert for Berliner Festspiele MaerzMusik Festival, which included \"Gramophone Saraswati,\" a new piece by Amelia Cuni and Werner Durand. The Orchestra of Futurist Noise Intoners is currently touring internationally."]}, {"page": "Eddie Prévost", "response": ["Drumming however, was to take a back seat in Prévost's musical output as AMM developed and began to acquire and enhance its innovative reputation. And, apart from rare musical outings he did not commit himself, more fully, to the jazz drum kit again until 2007/08. Although, continuing to play percussion, a jazz-inflected project with Seymour Wright and Ross Lambert in an ensemble called SUM was the precursor of a period more devoted to drumming. Apart from various ad hoc ensembles, this led to various recordings including a series a CDs entitled Meetings with Remarkable Saxophonists. At date this consists of four volumes featuring Evan Parker, John Butcher, Jason Yarde and Bertrand Denzler respectively.", "* Visionary Fantasies with John Butcher (Matchless, 2018)", "* John Butcher, Interworks (Matchless, 2005)", "* John Butcher, Meetings with Remarkable Saxophonists Vol. 2 (Matchless, 2012)", "* Amplified Gesture - A film by Phil Hopkins featuring John Butcher, Christian Fennez, Sachiko M, Toshimaru Nakamura, Evan Parker, Eddie Prévost, Polwiechsel, Keith Rowe, John Tilbury, Otomo Yosihide Souns ssdvd01, 2011"]}, {"page": "Polwechsel", "response": ["Malfatti left in 1997, and was replaced by saxophonist John Butcher. With guitarist/laptop computer whiz Fennesz, this lineup recorded Wrapped Islands, which earned several positive reviewsPolwechsel and Fennesz – Wrapped Islands – Review – Stylus MagazineInk 19 :: Polwechsel W/ FenneszPolwechsel & Fennesz – Wrapped Islands (Erstwhile)", "In around 2004, percussionists Burkhard Beins and Martin Brandlmayr joined Polwechsel. In 2008, Burkhard Stangl left the band and John Butcher also exited in 2009 leaving Polwechsel as a quartet."]}, {"page": "Gino Robair", "response": ["Robair frequently tours North America and Europe as a soloist and often improvises in ad hoc groups. He has recorded with Anthony Braxton, Tom Waits, John Butcher, LaDonna Smith, Otomo Yoshihide, Terry Riley, Lou Harrison, Eugene Chadbourne, Club Foot Orchestra, ROVA Saxophone Quartet, Birgit Ulher,  Beth Custer, and Fred Frith, and many others. In addition, he has performed with John Zorn, Nina Hagen, and Thinking Fellers Union Local 282. He is also a founding member of the Splatter Trio and Pink Mountain.", "*\"New Oakland Burr\" with John Butcher. Rastascan Records (San Francisco). CD.", "*\"Buddy Systems\" 1998 Gino Robair plays selected duos and trios, with John Butcher and Tim Perkis, Otomo Yoshihide, Carl Kihlstedt and Matthew Sperry, Dan Plonsey, LaDonna Smith, Splatter Trio, Oluyemi Thomas, and Myles Boisen On Meniscus(Minneapolis). CD"]}, {"page": "Simon H. Fell", "response": ["Fell's major sequence of compositions is titled Compilation (in total, four projects were issued under this heading). Despite the governing title, these are not collections of previous material but new, large-scale works. The musical language makes overt use of serialist procedures (such as tone rows, retrograde structures, &c), as well as many other techniques: extensive studio layering, overdubbing and reordering of material (so that seemingly \"live\" performances may be the result of carefully edited-together improvisations and/or notated material), and use of aleatoric techniques to \"degrade\" or distort precomposed structures into new shapes. Free improvisation, rock and jazz all form key parts of the musical language; one section of Compilation IV even includes a simultaneous homage to Karlheinz Stockhausen and Henry Mancini. The cast of musicians drawn on for these pieces usually included a mix of classically trained players, jazzers and free improvising musicians, as well as wild cards like the noise guitarist, Stefan Jaworzyn. While virtuoso players such as Evan Parker and John Butcher were essential to the projects, Fell often deliberately made use of amateur or student musicians, too, not as a makeshift but as an intentionally democratising and less predictable element."]}, {"page": "Dominic Lash", "response": ["Dominic Lash (born 18 January 1980 in Cambridge, England) is a Bristol based double bassist and film theorist. He was formerly a central figure in the musicians' collective Oxford Improvisers.  Important long-term musical collaborators include Angharad Davies, Bruno Guastalla, Alexander Hawkins, Tim Hill, Steve Noble, Samantha Rebello, Pat Thomas, Philipp Wachsmann and Alex Ward. He has also performed with saxophonists John Butcher and Evan Parker and violinist Tony Conrad. Recent work includes a UK tour with US guitarist Joe Morris, Australian drummer Tony Buck (of The Necks) and saxophonist Tony Bevan. Festival appearances have included the Manchester Jazz Festival (with the Grew Quartet), Akbank Jazz Festival (Istanbul) and Tampere Jazz Happening."]}, {"page": "Paal Nilssen-Love discography", "response": ["He has released two solo albums, and his portfolio includes Atomic, School Days, The Thing, Scorch Trio, Territory Band, FME, and various duo projects such as with reedmen Peter Brötzmann, Ken Vandermark, John Butcher, organist Nils Henrik Asheim and noise experimentalist Lasse Marhaug.", "===John Butcher / Paal Nilssen-Love===", "| Sten Sandell Trio + John Butcher"]}, {"page": "Lan Tung", "response": ["Since moving to Canada in 1994, Tung has premiered numerous contemporary compositions, including chamber, solo, orchestral and electro-acoustic works, by Canadian composers John Oliver, Hope Lee, Moshe Denburg, Mark Armanini, Jin Zhang, Janet Danielson, Michael Vincent, Neil Weisensel, Paul Plimley, Ya-Wen V. Wang, Farshid Samandari, Grace Lee, and Michael John. Her fascination for creative improvisation has driven her to perform with a number of Vancouver's most innovative improvisers, including Coat Cooke, Ron Samworth, and the Crossing Borders Ensemble. Tung recently completed an intensive course at the Vancouver Creative Music Institute, where she studied and performed with Han Bennink (Holland) and John Butcher (UK)."]}, {"page": "ELISION Ensemble", "response": ["Beyond notated music, ELISION has also maintained a strong thread of structured improvisation performance, often within cross-artform events, such as the seven-night long Bar-do'i-thos-grol (The Tibetan Book of the Dead) (composer Liza Lim, installation artist Domenico de Clario; Lismore 1994 and Perth 1995) (described as \"one of the most astonishing creations in recent Australian music performance\"McGillick, Paul: In Australian Financial Review, 3 March 1995). The use of improvisation as a creative laboratory to generate sonic understandings, subsequently informing more formal processes, has occurred with composers Richard Barrett and John Rodgers, and recently in What Remains (composer/performers John Butcher and Timothy O'Dwyer; Brisbane 2007)."]}, {"page": "Paul Dutton", "response": ["Dutton has collaborated with a wide range of musicians, including fellow oral sound artists Jaap Blonk, Koichi Makigami, Phil Minton, and David Moss in the group Five Men Singing, John Butcher, Bob Ostertag, Phil Durrant, John Russell, Lee Ranaldo, Christian Marclay, Günter Christmann, Thomas Charmetant, Xavier Charles, and Jacques Di Donato. His soundsinging has been called \"fascinating, inventive, grippingly obsessive\" (The Wire)."]}, {"page": "Maya Dunietz", "response": ["In 2004 Dunietz began a new musical practice of free improvisation, deeply influenced by the values of this musical practice. She approached clarinet player, painter, and poet Harold Rubin and began a collaboration that lasted until his passing, in 2020. The duo’s home venue was at The Left Bank in Tel Aviv, where they played hundreds of improv concerts collaborating with numerous local and international artists. The duo also performed at the FMP Total Music Meeting in Berlin. Dunietz later recorded two albums of free improvisation music - one in trio with Yoni Silver and Harold Rubin (Mono Musical Suite for Three Manic Musicians), and one with John Edwards and Steve Noble (Cousin It). Dunietz continues to play free improvisation concerts worldwide with various collaborators. Previous collaborations include: Evan Parker, Eddie Prévost, John Tilbury, Alvin Curran, Ghedalia Tazartes, Lori Goldstone, Fritz Welch, Michelle Guay, Okkyung Lee, Tom White, Nino Biton and The Magreb Orchestra, Jewlia Eisenberg, Shahad Ismaily, Toychestra USA, David Moss, Bari Saharof, Rami Fortis, David Broza, Boom Pam, Steve Noble, Yedo Gibson, Marcio Mattos, Yuka Yamamoto, Shanir Ezra Blumenkranz, Mike Patton, John Butcher, Ilan Volkov, Aaron Dugan, Matisyahu, Assif Zahar, Ravid Kahalani, Desert Blues, Guillaume Villtard, Neil Davidson, Johnny Chang, Ana-Maria Avram, Hildur Gudnsadottir, Stephen O'Malley, Iancu Dumitrescu, Oren Ambarchi, Daniel Higgs, Steve Beresford, Veryan Weston, Tania Chen and more."]}, {"page": "Matt Ingalls", "response": ["Ingalls is most active as a clarinetist, specializing in contemporary and experimental music. He is a prominent figure in the San Francisco Bay Area Improv Scene, and is known for his \"composerly\" solo improvisations that explore extended techniques on his instrument that interact with the acoustic space, often as combination tones.  Ingalls has worked with a diverse range of composers such as Mark Applebaum, Anthony Braxton, John Butcher, Helmut Lachenmann, George Lewis, Miya Masaoka, Meredith Monk, Hyo-shin Na, Pauline Oliveros, Stefano Scodanibbio, Chinary Ung, and numerous Bay Area composers."]}, {"page": "1991 in jazz", "response": ["*John Butcher: Thirteen Friendly Numbers"]}, {"page": "1954 in jazz", "response": ["* John Butcher, English tenor and soprano saxophonist."]}, {"page": "Dieb13", "response": ["Dieb13 is the performing name of Dieter Kovačič, a Viennese-based avant-garde musician. He has also performed under the names Takeshi Fumimoto, Echelon, Dieter Bohlen, and dieb14. After appearing on several compilations documenting the burgeoning Viennese avant-garde scene of the late 1990s, he released his first solo album in 2000.[ Allmusic.com Bio] He has gone on to perform in a number of collaborations with other notable performers, including Burkhard Stangl, erikm, Mats Gustafsson and the John Butcher Group.", "*Somethingtobesaid - with John Butcher Group (2009)"]}, {"page": "John Russell (musician)", "response": ["In 1983, he appeared in the Channel 4 TV documentary Jazz on Four: Crossing Bridges, which examined guitarists Brian Godding, Fred Frith, Ron Geesin, Hans Reichel, and Keith Rowe.Izzard, Bryan and Anthony, Neil (1983) Jazz on Four: Crossing Bridges, Channel 4 In 1988 Russell helped establish Acta Records with John Butcher and Phil Durrant to release the trio's debut album, Conceits.Acta Records list of recordings", "With John Butcher"]}, {"page": "Nameless Sound", "response": ["*John Butcher"]}, {"page": "Solo saxophone", "response": ["The genre of solo saxophone has a rich, but largely unmapped history in contemporary music, particularly jazz.Bill Shoemaker, Solo Saxophone Flights, Jazz Times, June 2000, http://jazztimes.com/articles/20462-solo-saxophone-flights Many, but not all, musicians who play and record solo saxophone use extended techniques, a vocabulary of the saxophone beyond its normal range. Notable musicians in this field include Kaoru Abe, Anthony Braxton, Peter Brötzmann, John Butcher, Don Dietrich, Eric Dolphy, Brandon Evans, Paul Flaherty, Mats Gustafsson, Coleman Hawkins, Lee Konitz, Steve Lacy, Roscoe Mitchell, Evan Parker, Sonny Rollins, Sam Newsome, Ned Rothenberg, Masayoshi Urabe, Ken Vandermark, Colin Stetson, Jonah Parzen-Johnson and Andre Vida, Gianni Gebbia.", "*John Butcher, 13 Friendly Numbers, 1991 (Originally released on ACTA. 2004 reissue on Unsounds)John Eeyles, John Butcher: 13 Friendly Numbers Review, BBC, March 2005 https://www.bbc.co.uk/music/reviews/wqjw", "* John Butcher - official website", "* Solo Saxophones: Roscoe Mitchell, Paul Flaherty & John Butcher - article by Kurt Gottschalk, All About Jazz, November 2009."]}]}}