{"wiki_id": "http://www.wikidata.org/entity/Q16937388", "itemLabel": "John Phillips", "itemDescription": "Irish politician, died 1917", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Phillips_(Irish_politician)", "wikipedia_page": {"main": "John Phillips (1839 or 1840 – 2 April 1917) was an Irish politician. He was the Nationalist Member of Parliament for South Longford.Phillips was born in County Longford, and was a farmer there. As a young man he was a leader of the Fenian movement in Longford, but later devoted his energies to the constitutional Home Rule movement. He was co-opted to Longford County Council on its establishment in 1899, and was its chairman from 1902 until his death. He was elected as MP for South Longford in 1907.He died at his home in Edgeworthstown after a long illness on 2 April 1917, aged 77.", "link_mentions": [{"page": "John Phillips", "response": ["John Phillips or Philips may refer to:", "*John Phillips (bishop of Sodor and Man) (1555–1633), Church of England bishop", "*John Phillips (Puritan), a minister in England and Massachusetts", "*John Phillips (fl. 1570–1591), English writer and poet", "*John Phillips (author) (1631–1706), author and secretary to John Milton", "*John Phillips (c. 1709–75), English master carpenter", "*John Phillips (educator) (1719–1795), American merchant and founder of Phillips Exeter Academy", "*John Phillips (pirate) (died 1724), captain of the pirate ship Revenge", "*John Phillips (mayor) (1770–1823), first mayor of Boston, 1822–1823", "*John Phillips (geologist) (1800–1874), English geologist", "*John Phillips (surveyor) (died 1897), British engineer", "*John Phillips (Canadian politician) (1810–?), politician in New Brunswick, Canada", "*John Phillips (Pennsylvania politician), member of United States Congress, 1821–1822, from Pennsylvania", "*John Phillips (Wisconsin politician) (1823–1903), American physician and politician", "*John Phillips (Irish politician) (1839/40–1917), Irish Member of Parliament for South Longford", "*John Phillips (artist) (1808–after 1842), illustrator and portraitist", "*John Phillips (physician) (1855–1928), British physician", "*John Phillips (priest) (1879–1947), Dean of Monmouth", "*John Phillips (bishop of Portsmouth) (1910–1985), Church of England bishop", "*John Phillips (actor) (1914–1995), British actor", "*John Phillips (photographer) (1914–1996), photographer for Life magazine", "*John Phillips, new name of convicted spy John Vassall (1924–1996) after imprisonment", "*John Phillips (Guyanese cricketer) (1902-1967), Guyanese cricketer", "*John Phillips (South African cricketer) (1910–1985), South African cricketer", "*John Phillips (English cricketer) (1933–2017), English cricketer", "*John Phillips (New Zealand cricketer) (1949-2017), New Zealand cricketer", "*John Phillips (zoologist) (1933–1987), professor of zoology and vice-chancellor of Loughborough University", "*John Phillips (musician) (1935–2001), American singer, songwriter and guitarist, member of the Mamas and the Papas", "*John Phillips (basketball coach) (born 1947), college basketball coach", "*John Phillips (footballer) (1951–2017), English-born Welsh international goalkeeper", "*John Phillips (lawyer), head of the King's Law School, 2002–2005", "*John Phillips (American football) (born 1987), American football tight end", "*John Phillips (sport scientist) (born 1981), English football coach, mountainbiker and kickboxer", "*John Phillips, pen name of American author John P. Marquand, Jr. (1924–1995)", "*John Phillips  (fighter), MMA fighter", "*John Phillips (snooker player) (1935-2008)", "*John Phillips (John, the Wolf King of L.A.), the first solo recording by the Mamas and the Papas leader John Phillips"]}, {"page": "1917 in Ireland", "response": ["*2 April – John Phillips, Member of Parliament for South Longford.Freeman's Journal, 4 April 1917"]}, {"page": "Darrell Figgis", "response": ["Although he did not participate in the 1916 Easter Rising, Figgis was arrested and interned by the British authorities between 1916 and 1917 in Reading Gaol. His wife Millie wrote to The New Age, detailing her husband's conditions in jail and what she saw as the excessively broad terms by which he was interned under the Defence of the Realm Act 1914.Defence of the Realm Act (Hansard) at hansard.millbanksystems.com After his release, Figgis returned to Ireland. At the 1917 Sinn Féin Ardfheis he and Austin Stack were elected Honorary Secretaries of the party. The conference saw Éamon de Valera replace Arthur Griffith as President of the party. Griffith and Michael O'Flanagan became Vice-Presidents. Two Honorary Treasurers were also elected, W. T. Cosgrave and Laurence Ginnell. This duality of offices reflected the coalition nature of Sinn Féin between those of the constitutional tradition, and those who advocated a more militarist approach. Shortly after, Figgis was one of four recently released internees who travelled to the South Longford constituency to campaign for Joseph McGuinness in the by-election caused by the death of John Phillips. The overwhelming victory of the Sinn Féin candidate over the Irish Parliamentary Party nominee marked the beginning of the eclipse of the latter party by the former party. In May 1918, Figgis was arrested for his alleged part in the spurious German Plot a second time and again deported to England. In 1918, he became editor of the newspaper The Republic."]}, {"page": "South Longford (UK Parliament constituency)", "response": ["| John Phillips"]}, {"page": "List of MPs elected in the January 1910 United Kingdom general election", "response": ["| John Phillips"]}, {"page": "List of United Kingdom by-elections (1900–1918)", "response": ["|John Phillips", "|John Phillips"]}, {"page": "1917 South Longford by-election", "response": ["The South Longford by-election of 1917 was held on 9 May 1917 due to the death of the incumbent Irish Parliamentary MP, John Phillips. The by-election ended in a surprise Sinn Féin victory over the Irish Parliamentary Party following a very close vote. The result was not announced until 10 May due to a recount."]}, {"page": "1907 South Longford by-election", "response": ["The South Longford by-election of 1907 was held on 6 September 1907.  The by-election was held due to the resignation of the incumbent Irish Parliamentary MP, Edward Blake, following a stroke.  It was won by the Irish Parliamentary candidate John Phillips, who was unopposed."]}]}}