{"wiki_id": "http://www.wikidata.org/entity/Q1691253", "itemLabel": "Jock Stirrup", "itemDescription": "Retired senior Royal Air Force commander and now a Crossbench member of the House of Lords. (born 1949)", "wikipedia_url": "https://en.wikipedia.org/wiki/Jock_Stirrup", "wikipedia_page": {"main": "Marshal of the Royal Air Force Graham Eric Stirrup, Baron Stirrup,  (born 4 December 1949), informally known as Jock Stirrup, is a former senior Royal Air Force commander who was the Chief of the Defence Staff from 2006 until his retirement in late 2010. He is now a Crossbench member of the House of Lords. In April 2013, he was appointed a Knight of the Order of the Garter by Queen Elizabeth II.\nAs a junior RAF officer, Stirrup was a jet pilot, and saw action in the Dhofar War. Later in his career, he commanded No. 2 Squadron and RAF Marham. After several senior air force appointments, Stirrup was made the Deputy Commander-in-Chief of Strike Command and during this time he served as the first commander of British forces engaged in fighting the Taliban. In 2002, Stirrup was appointed the Deputy Chief of the Defence Staff responsible for equipment and capability and was heavily involved in procuring equipment for the invasion of Iraq. Spending a little over a year in that role, he was then appointed the Chief of the Air Staff, in which capacity he served from 2003 to 2006. He became Chief of the Defence Staff in 2006: during his time in office the British Armed Forces faced significant commitments both to Iraq (Operation Telic) and Afghanistan (Operation Herrick). Stirrup retired as Chief of the Defence Staff on 29 October 2010, taking a seat in the House of Lords in 2011.", "link_mentions": [{"page": "Merchant Taylors' School, Northwood", "response": ["* Sir Jock Stirrup, Chief of the Defence Staff"]}, {"page": "RAF Strike Command", "response": ["*Air Marshal Sir Jock Stirrup 2000–2002"]}, {"page": "Operation Veritas", "response": ["*September 2001 to January 2002, Air Marshal Jock Stirrup"]}, {"page": "Chief of the Defence Staff (United Kingdom)", "response": ["Customarily, former Chiefs of Defence Staff receive a life peerage on retirement, sitting in the House of Lords as non-political crossbench peers. Their appointment is recommended not via the House of Lords Appointments Commission as is normal procedure, but is instead nominated directly to Her Majesty The Queen by the Prime Minister, who elects to nominate \"a limited number of distinguished public servants\" on retirement for a peerage. Sir Jock Stirrup was introduced to the House of Lords on 1 February 2010 as Baron Stirrup of Marylebone in the City of Westminster.House of Lords Business, February 1, 2011"]}, {"page": "List of knights and ladies of the Garter", "response": ["| Marshal of the Royal Air Force Jock Stirrup, Baron Stirrup"]}, {"page": "No. 2 Squadron RAF", "response": ["In September 2012, a memorial dedicated to all those who served on No. 2 Squadron and to those that gave their lives whilst serving on the squadron was unveiled at the National Memorial Arboretum in Staffordshire.  The design, planning and fund-raising for the memorial took three years and it features a Roman numeral 'II' carved from black granite. A service was held at the memorial which involved a flypast by a Supermarine Spitfire of the Battle of Britain Memorial Flight and No. 2 Squadron Tornado GR4. The service was attended by Air Chief Marshal Lord Jock Stirrup and  The Venerable (Air Vice-Marshal) Ray Pentland, RAF Chaplain in Chief."]}, {"page": "No. 41 Squadron RAF", "response": ["The following senior leaders of the RAF all served with 41 Squadron during the Jaguar period: Sir Stephen Dalton, Sir Richard Garwood, Sir Chris Harper, Sir Jock Stirrup, Sir Charles John Thomson, Sir Glenn Torpy.Glenn Torpy, Who's Who 2010, A & C Black, 2010, "]}]}}