{"wiki_id": "http://www.wikidata.org/entity/Q1699179", "itemLabel": "John Atherton", "itemDescription": "Australian explorer", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Atherton_(pioneer)", "wikipedia_page": {"main": "John Atherton (9 August 1837 – 16 May 1913)  was an explorer of the Far North Queensland area of Queensland, Australia.", "link_mentions": [{"page": "Atherton Tableland", "response": ["Atherton was explored by a European, J.V. Mulligan, in 1875. In 1877, John Atherton settled near the town which now bears his name. The area was originally explored for its mining potential where deposits of tin and gold were found.", "Atherton Creek is named after John Atherton,  who settled at Emerald End, (later Mareeba) in 1875.", "Originally a pioneering pastoralist, John Atherton was the first to find tin deposits in Herberton in 1880 Northern Queensland. Local legend has it that Tinaroo Creek received its name from Atherton who shouted, \"Tin! Hurroo!\" when he first made his discovery. Atherton and his friends, William Jack and John Newell, discovered the famous lode in Herberton, which became the Great Northern Tin Mine. A rush of miners from the Hodgkinson's Goldfields followed. The construction of a dray road through the Tableland brought a secondary rush, this time timber cutters to mine the red gold (redcedar) of the rainforest. Redcedar cutters camps were at Rocky Creek, Prior Pocket, Oonda Swamp (Carrington) & Ziggenbein's Pocket. Although tin was a major part in the Tablelands, timber is what Atherton owes its existence to with large areas of red cedar, kauri, maple, black bean, walnut, white beech and red tulip oak being milled for buildings."]}, {"page": "Mareeba", "response": ["The Mareeba area was first settled by Europeans in 1877 by John Atherton, who arrived with cattle at Emerald End, which is just north of the town today. Mareeba quickly became a busy coach stop for Cobb & Co on the road from Port Douglas to Herberton. When the railway arrived in 1893, Mareeba grew into a busy town."]}, {"page": "Tinaroo Dam", "response": ["James Mulligan was the first European explorer and prospector to visit the tablelands in 1875. The area is now called the Atherton Tablelands after John Atherton who settled at Emerald End Station, at the junction of Emerald Creek and the Barron River.  It is reported through popular legend that upon discovering alluvial tin at the headwaters of the creek, Atherton shouted \"Tin, Harroo!!\" to his prospecting mate."]}, {"page": "Athertonia", "response": ["Athertonia is a genus of tall trees, constituting part of the plant family Proteaceae. It is a monotypic taxon, and the sole described species is Athertonia diversifolia, commonly known as Atherton oak. It is a small to medium-sized tree and is endemic to restricted tablelands and mountainous regions of the wet tropics rain forests of north-eastern Queensland, Australia, where it is widespread. For example, it grows in the Atherton Tableland region with which it shares its name, from the colonial pastoralist John Atherton (1837–1913). Its closest relatives are Heliciopsis (South Asia) and Virotia (New Caledonia). A relative of the macadamia, it has potential as an ornamental tree and has an edible nut."]}, {"page": "Djabugay", "response": ["This led to the notorious Speewah massacre in 1890 where John Atherton took revenge on the Djubagay by sending in native troopers to avenge the killing of a bullock. The Djubagay were segregated from them and forced to live at the Mona-Mona Mission and were unable to hunt, fish or move around. Their numbers fell dramatically at the turn of the century."]}, {"page": "1837 in Australia", "response": ["*John Atherton"]}, {"page": "John Moffat (mining pioneer)", "response": ["The area was known to have abundant resources of tin on what became known as the Tinaroo field, site of today's Lake Tinaroo. While prospecting there, Jack and Newell met John Atherton, an early settler knew that the first European explorer in that region, James Venture Mulligan had noticed rich deposits of tin ore on the Wild River, higher up in the 'wild ranges' in 1875. Atherton led Jack and Newell on an exploratory expedition to the area in 1879 but the party failed to find the rich alluvial deposits that had been noted by Mulligan. In 1880, a second expedition located the deposit and secured a claim for Moffat and Company. The town of Herberton was officially laid out in August of that year."]}, {"page": "Atherton (surname)", "response": ["* John Atherton (died 1573) (1513–1573), English politician", "* John Atherton (1598–1640), Anglican Bishop of Waterford and Lismore in the Church of Ireland", "* John Atherton (died 1617), English politician", "* John Atherton (pioneer) (1837–1913), explorer of Australia; the Atherton Tablelands are named for him"]}, {"page": "John Atherton (disambiguation)", "response": ["John Atherton (1598–1640) was a Anglican bishop.", "John Atherton may also refer to:", "*John Atherton (died 1573) (c. 1513–1573), MP for Lancashire in 1559", "*John Atherton (died 1617) (c. 1557–1617), MP for Lancashire in 1586 and Lancaster in 1589", "*John Atherton (pioneer) (1837–1913), English explorer of Queensland, Australia"]}, {"page": "Innot Hot Springs", "response": ["The hot springs were first discovered by Europeans in the early 1870s when John Atherton was exploring the area for grazing opportunities. However it seems the springs were ignored until 1885 when Charles Overend Garbutt, the owner of Woodleigh Station, rediscovered them and learned from the local Aboriginal people that the springs had healing properties. In the Victorian era, mineral springs were widely believed to have theraputic benefits obtained through bathing in the water and drinking the water. Perceiving the commercial opportunities, a Russian-born man, Antonie Antonevic leased 10 acres around the springs on 1 April 1886. The lease passed through a number of people's hands before it was taken up by (Neil) Charles Spranklin in the late 1890s, who is generally regarded as the major force in developing the springs."]}, {"page": "Ernest Atherton", "response": ["Atherton was the youngest son of John Atherton (pioneer) and his wife Catherine (née Grainger). The family had settled on the extensive Emerald End cattle station and their station homestead was attacked many times by bands of indigenous people.Northern Pioneer's Death – The Cairns Post. Retrieved 12 March 2016. He was educated at Cairns State School and also received private tuition in Port Douglas. When he finished his education he spent time as a butcher and storekeeper before becoming a sugar cane and dairy farmer."]}, {"page": "Barron Valley Hotel", "response": ["Early European settlements on the Atherton Tablelands developed along the route from Port Douglas to the Herberton at Granite Creek near Mareeba, Rocky Creek near Atherton and Scrubby Creek near Carrington. Atherton, which takes its name from pastoralist John Atherton, was originally known as Prior's Pocket after Thomas Prior, a timber getter who was the first European to camp there permanently. The settlement grew to shelter men engaged in lumbering operations, including four brothers from the Mazlin family who played a key role in the local timber industry; much of the timber they cut was used to construct Atherton's early buildings."]}, {"page": "Merriland Hall", "response": ["Atherton became a town when it was surveyed in 1885, and named for John Atherton in 1886 when the first lots were put up for sale. It began as a timber town and once much of the timber had been felled, maize, originally grown by Chinese tenant farmers, became the important crop. Peanuts, also introduced by Chinese settlers, were an alternative crop to maize. Today dairying is its main industry. Prior to World War II Atherton was a quiet country town. However, by December 1942 the war had impinged upon the area quickly changing the landscape and the lives of the townspeople."]}, {"page": "Mareeba Shire Hall", "response": ["The Atherton Tableland, west of Cairns in Far North Queensland, was named after squatter John Atherton, who was the first person to establish a cattle run in the area in the late 1870s. In the 1880s the Atherton family established a wayside inn and store at the crossing of Granite Creek, supplying goods to traffic passing between Port Douglas to the north and the new tin mining township of Herberton to the south. A settlement grew on the southern side of Granite Creek and a town, named Mareeba, was surveyed by EB Rankin in 1891. In 1893 it became a railhead when the Tableland railway from Cairns to Kuranda was extended, and by 1919 Mareeba was the district's most important town."]}, {"page": "Mungana Archaeological Area", "response": ["The Mungana Archaeological Area is an aggregation of the remnants of mining and associated community infrastructure that commenced during Queensland's mining boom in the 1880s. The area was both geographically and commercially linked to the development of the nearby township of Chillagoe, which was originally settled and named in 1887 by William Atherton, the son of the famous North Queensland pioneer, John Atherton. William established a large homestead on the banks of the Chillagoe Creek in 1888 with the intention of supplying beef to the expanding mining operations of the area. The far north Queensland mining magnate, John Moffat, buoyed by reports from Atherton and others of the discovery of payable mineral deposits, visited the area in October 1888 and subsequently acquired the mineral rights over a considerable amount of the Chillagoe/Mungana area. He consolidated his position by establishing a number of smaller mining operations, including a smelter at Calcifer in 1894."]}, {"page": "Ngajanji", "response": ["The Ngajanji around Yungaburra and Lake Eacham were affected by the rush of settlement that followed John Atherton's discovery of tin in 1878 at Tinaroo, and development of Robson's track linking the district to the coast."]}, {"page": "Warrongo people", "response": ["Tin was discovered in the vicinity of Warrongo territory, in the Wild river area in 1880. John Atherton's Cashmere station, and the Gunnawarra station, were established on their territory in the mid 1870s. The surging influx of miners led to many clashes and massacres. At Blencoe Falls, a group of Warrongo were driven off the cliffs to plunge into the gorge. Very little knowledge survived of these people."]}, {"page": "List of plant genera named for people (A–C)", "response": ["|data-sort-value=\"Atherton\"|John Atherton and the Atherton Tableland"]}]}}