{"wiki_id": "http://www.wikidata.org/entity/Q16931109", "itemLabel": "Bryan Drake", "itemDescription": "New Zealand singer", "wikipedia_url": "https://en.wikipedia.org/wiki/Bryan_Drake", "wikipedia_page": {"main": "Bryan Ernest Hare Drake (7 October 1925 – 25 December 2001) was a New Zealand-born baritone who became particularly associated with the operas of Benjamin Britten.Born in Dunedin, Drake sang in the choir of the local St Paul's cathedral, and was educated at Otago Boys' High School. He then studied at the University of Otago, where he sang with the music society. He made his opera debut in 1948 as Escamillo in Bizet's Carmen,  in a production originally staged as part of the Otago Centennial, which then toured around the country.Receiving a government bursary in 1949, Drake travelled to London. The following year he received a two-year contract as a full-time principal in the Covent Garden Opera Company. During that time he created the roles of Donald, in the 1951 world premiere of Britten's Billy Budd, and Watchful in Vaughan Williams's The Pilgrim's Progress. To cover a difficult scene change, Vaughan Williams inserted an aria specially for Drake, of which The Times critic commented: \"For pure singing, there was nothing finer than the interlude between the first and second acts, in which Mr Bryan Drake sang the 121st psalm with perfect declamation and limpid purity of tone and style.\"At the Welsh National Opera during the 1950s and '60s, Drake's roles included Germont in Traviata, Ferrando in Trovatore, Flint, the sailing-master, in Billy Budd, and the title roles in Nabucco and Macbeth. At Sadler's Wells, he sang Creon in Stravinsky's Oedipus Rex and Mephistopheles in Gounod's Faust.\nIn 1960, Britten invited Drake to sing the role of Junius in The Rape of Lucretia, at the Aldeburgh festival. Britten, known to be exacting and for dropping musicians who ceased to please him, never lost his high opinion of Drake. For the next 15 years, Drake was a regular member of Britten's English Opera Group, not only singing and recording various roles in his operas, but also performing various leading roles in operas by Malcolm Williamson, Gordon Crosse and Thea Musgrave. He also appeared in BBC television productions of Peter Grimes (as Balstrode) and Billy Budd (as Flint, a role he also recorded for Decca under the composer's baton).\nIn the Church Parables Britten composed between 1964 and 1968, the composer wrote roles specially for Drake in all three: the Traveller in Curlew River, the Astrologer in The Burning Fiery Furnace and the Elder Son in The Prodigal Son.In 1972, Drake began to teach singing, first at the Guildhall School of Music and Drama. He was director of opera at the Royal College of Music from 1981 until 1985, after which he and his wife settled in Aldringham, Suffolk. From 1987 he worked as voice consultant at the Britten-Pears School in Aldeburgh. His final performance was in 1999, when he played the Voice of God in a production of Britten's Noye's Fludde in Aldeburgh parish church.\n\n", "link_mentions": [{"page": "The Yeomen of the Guard", "response": ["The Australian Broadcasting Commission made a TV version in 1972 starring Alan Lander and Pamela Stephenson.Scott Murray, Ed Scott. Australia on the Small Screen 1970-1995, Oxford University Press, 1996, p. 165 A 1975 TV version by the BBC stars Valerie Masterson as Elsie, Derek Hammond-Stroud as Point, David Hillman as Fairfax, Bryan Drake as Sgt. Meryll, Richard Angas as Sir Richard and Elizabeth Bainbridge as Carruthers. It was directed by John Gorrie and conducted by David Lloyd-JonesShepherd, Marc. \"The BBC Yeomen Video (1974)\", the Gilbert and Sullivan Discography, 16 April 2009 Another cut version was made in 1978 for British TV starring Tommy Steele as Point, Terry Jenkins as Fairfax, Anne Collins as Carruthers, Laureen Livingstone as Elsie, Della Jones as Phoebe, Paul Hudson as Meryll and Dennis Wickes as Wilfred. It was directed by Anthony Besch and conducted by David Lloyd-Jones in connection with 1978 City of London Festival.The Yeomen of the Guard, Channel 5, Amazon.com, ASIN B000VN8PS0"]}, {"page": "Peter Grimes", "response": ["|1969 || Peter Pears,Heather Harper,Bryan Drake,Elizabeth Bainbridge || Benjamin Britten,London Symphony Orchestra, Ambrosian Opera Chorus, Recorded Snape Maltings.|| BBC Recording DVD: DeccaCat: 074 3261"]}, {"page": "Curlew River", "response": ["Under Colin Graham's direction, the work was premiered on 13 June 1964 at St Bartholomew's Church, Orford, Suffolk, England, by the English Opera Group. The original cast included Britten regulars Peter Pears and Bryan Drake. The United States premiere was presented at the Caramoor Summer Music Festival on 26 June 1966, with Andrea Velis as the Madwoman.", "|Bryan Drake", "* Traveller: Bryan Drake"]}, {"page": "Billy Budd (opera)", "response": ["| Bryan Drake"]}, {"page": "The Burning Fiery Furnace", "response": ["|Bryan Drake", "* The Astrologer: Bryan Drake"]}, {"page": "Noye's Fludde", "response": ["In 1972 Jonathan Miller directed his first opera with a production of Noye's Fludde, staged during 21–23 December at the Roundhouse Theatre, London. The adult roles were taken by Michael Williams (God), Bryan Drake (Noah) and Isabelle Lucas (Mrs Noah), and the conductor was John Lubbock."]}, {"page": "The Pilgrim's Progress (opera)", "response": ["* Bryan Drake (Watchful, the porter)"]}, {"page": "1925 in New Zealand", "response": ["** Bryan Drake, opera singer"]}, {"page": "We Come to the River", "response": ["|Bryan Drake"]}, {"page": "The Prodigal Son (Britten)", "response": ["|Bryan Drake", "* The Elder Son: Bryan Drake"]}, {"page": "List of fellows of the Royal College of Music", "response": ["* Bryan Drake, 1983"]}, {"page": "Deaths in December 2001", "response": ["*Bryan Drake, 76, New Zealand operatic baritone."]}]}}