{"wiki_id": "http://www.wikidata.org/entity/Q1699561", "itemLabel": "John Carter", "itemDescription": "English singer, songwriter and record producer", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Carter_(musician)", "wikipedia_page": {"main": "John Nicholas Shakespeare (born 20 October 1940), known as John Carter, is an English singer, songwriter, and record producer.", "link_mentions": [{"page": "British Invasion", "response": ["Other US groups also demonstrated a similar sound to the British Invasion artists and in turn highlighted how the British \"sound\" was not in itself a wholly new or original one.K. Keightley, \"Reconsidering Rock\" in S. Frith, W. Straw and J. Street, eds., The Cambridge Companion to Pop and Rock (Cambridge: Cambridge University Press, 2001), , p. 116. Roger McGuinn of the Byrds, for example, acknowledged the debt that US artists owed to British musicians, such as the Searchers, but that \"they were using folk music licks that I was using anyway. So it's not that big a rip-off.\"Holmes, Tim, \"US and Them: American Rock's Reconquista\" Popular Music and Society, Vol.30, July 07 Both the US sunshine pop group the Buckinghams and the Beatles-influenced US Tex-Mex act the Sir Douglas Quintet adopted British-sounding names, and San Francisco's Beau Brummels took their name from the same-named English dandy. Roger Miller had a 1965 hit record with a self-penned song titled \"England Swings\", in which although its title references the progressive youth-centric cultural scene known as Swinging London, its lyric pays tribute to Britain's traditional way of life. Englishman Geoff Stephens (or John Carter) reciprocated the gesture a la Rudy Vallée a year later in the New Vaudeville Band's \"Winchester Cathedral\". Even as recently as 2003, \"Shanghai Knights\" made the latter two tunes memorable once again in London scenes. Anticipating the Bay City Rollers by more than a decade, two British acts that reached the Hot 100's top twenty gave a tip of the hat to America: Billy J. Kramer with the Dakotas and the Nashville Teens.  The British Invasion also drew a backlash from some US bands, e.g., Paul Revere & the Raiders and New Colony Six dressed in Revolutionary War uniforms, and Gary Puckett & the Union Gap donned Civil War uniforms. Garage rock act the Barbarians' \"Are You a Boy or Are You a Girl\" contained the lyrics \"You're either a girl, or you come from Liverpool\" and \"You can dance like a female monkey, but you swim like a stone, Yeah, a Rolling Stone.\""]}, {"page": "Brenda Lee", "response": ["Her last top ten single on the pop charts in the United States was 1963's \"Losing You\" (No. 6), though she continued to have other chart hits such as 1964's \"As Usual\" (which peaked at No. 12 in the US and made No. 5 in the UK), her 1966 song \"Coming on Strong\" (which peaked at No.11 in the US) and \"Is It True\" (No.17 in both the US and the UK) in 1964. The latter, featuring Big Jim Sullivan, Jimmy Page on guitars, Bobby Graham on drums, was her only hit single recorded in London, England, and was produced by Mickie Most (but the slide guitar and background singers were overdubbed in Nashville). It was recorded at Decca Records' number two studio at their West Hampstead complex, as was the UK B-side, a version of Ray Charles' 1959 classic cut, \"What'd I Say?\", which was not released in America. The A-side \"Is It True?\" was composed by noted British songwriting team Ken Lewis and John Carter, who were also members of UK hitmakers the Ivy League."]}, {"page": "Private Dancer", "response": ["A&R man John Carter of Capitol Records is credited with relaunching the career of Tina Turner in the 1980s.\"Passings: Bill Summers, John S. Carter, Ruth C. Cole\". Los Angeles Times May 24, 2011.  Retrieved February 25, 2012.  In 1983, despite opposition from within Capitol, he signed her and managed her first album for the label, Private Dancer. The album itself was produced in England using several different producers.", "\"Let's Stay Together\" was produced by Martyn Ware of British band Heaven 17. Terry Britten produced the reggae-tinged \"What's Love Got to Do with It\". Rupert Hine produced \"Better Be Good to Me\", which had been written by Holly Knight, Mike Chapman, and Nicky Chinn, and most of the other songs.  John Carter produced \"Private Dancer\", which was written by Mark Knopfler and has a guitar solo by Jeff Beck. \"Help!\" was recorded with The Crusaders.", "In 1997, EMI, the parent label of Capitol Records, released a digitally remastered Centenary Edition of the Private Dancer album on CD, then including four additional demo tracks recorded in late 1983 and early 1984 with the producer John Carter, first released as B-sides to some of the Private Dancer singles, as well as three extended 12\" remixes. The album remains the only Tina Turner studio album to have been re-issued in digitally remastered form.", "* John Carter – percussion (5)", "* John Carter – producer  (5, 8)"]}, {"page": "Beautiful Dreamer", "response": ["The song has been recorded by Bing Crosby with John Scott Trotter & his Orchestra (March 22, 1940); The Nutmegs; Steve Conway with Jack Byfield & His Orchestra; Thomas Hampson with Jay Ungar (mandolin), David Alpher (piano), and Molly Mason (guitar); John Leyton (with revised lyrics by Ken Lewis and John Carter); Jerry Lee Lewis;Jerry Lee Lewis, Rocket Retrieved April 8, 2012. Slim Whitman; and Roy Orbison on the album In Dreams (a top ten Australian single in 1964). The documentary Beautiful Dreamer: Brian Wilson and the Story of Smile is named after the song, and in the documentary Brian Wilson quips that the first letters of the words \"Beautiful Dreamer, Wake\" compare with his own initials, Brian Douglas Wilson. The song is also featured on Marty Robbins' posthumous album Long, Long Ago (1984) and on Ray Price's posthumous farewell album Beauty Is... Ray Price, the Final Sessions (2014)."]}, {"page": "United Kingdom in the Eurovision Song Contest 1970", "response": ["\"Knock, Knock Who's There?\" ultimately became the easy victor with 120,290 votes. The song was written by Geoff Stephens and John Carter. Hopkin recorded all six entries, with the top two placed being released as a single. Of the others, only a bootleg version of You've Everything You Need was ever available commercially.", "| align=\"left\" | Geoff Stephens, John Carter"]}, {"page": "Nuggets: Original Artyfacts from the First Psychedelic Era, 1965–1968", "response": ["#Strawberry Alarm Clock: \"Incense and Peppermints\" (John Carter/Timothy Gilbert) (#1)"]}, {"page": "John Carter", "response": ["John Carter may refer to:", "* John Carter (businessman) (born 1961/62), British businessman, CEO of Travis Perkins", "* John Carter (insurance executive) (born 1937), chairman of Commercial Union (1994–1998)", "* John Carter (author) (1905–1975), English author, book-collector and bookseller", "* John Carter (actor) (1927–2015), American actor and director", "* John Carter (sound engineer) (1907–1982), American film audio engineer", "* John Carter (film editor) (1922–2018), American film editor", "* John Carter (film), a 2012 film about the Burroughs character on Mars", "* Princess of Mars, a 2009 direct-to-DVD film retitled in 2012 to John Carter of Mars", "* John Carter, Warlord of Mars, a Marvel Comics series created in 1977", "* John Carter, Warlord of Mars (role-playing game), 1978", "* Carter (artist) (John Carter, born 1970), contemporary American artist", "* John Carter (mouth artist) (1815–1850), disabled English artist", "*John Carter (jazz musician) (1928–1991), American jazz musician", "*John Carter (musician) (born 1942), English singer-songwriter", "* John Carter of Mars, a character from the classic science fiction series of novels by Edgar Rice Burroughs", "* John Carter (ER), a character from the television series ER played by Noah Wyle", "* John Carter (Little House)", "*John Carter (Royal Navy officer) (1785–1863), Royal Navy officer during the French Revolutionary and Napoleonic Wars", "*John Carter (South Carolina politician) (1792–1850), U.S. Representative from South Carolina", "*John Carter (Texas politician) (born 1941), U.S. Representative from Texas", "*John Carter, U.S. Air Force veteran and candidate for the U.S. House of Representatives in North Carolina in 2010", "*John Carter (died 1408), MP for Scarborough", "*John Carter (died 1432), MP for Scarborough", "*John Carter (Roundhead) (died 1676), English Parliamentary soldier and politician", "*John Carter (Mayor of Portsmouth) (1741–1808), English merchant and mayor", "*John Carter (Australian politician) (1893–1971), Australian politician", "*John Carter (New Zealand politician) (born 1950), New Zealand politician and mayor of the Far North District", "*John Carter (ambassador) (1919–2005), Guyanese politician, lawyer and diplomat", "* John Carter (Christadelphian) (1899–1962), editor of The Christadelphian from 1937 to 1962", "* John Carter (evangelist), Seventh-day Adventist evangelist", "*John Carter (cricketer, born 1935), former English cricketer", "*John Carter (cricketer, born 1963), former English cricketer", "*John Carter (ice hockey) (born 1963), professional ice hockey player", "* John Carter (architect) (1748–1817), English draughtsman and architect", "* John Carter (smuggler) (1770–1807), \"King of Prussia\", smuggler operating out of Prussia Cove, Cornwall", "* Lynching of John Carter (d. 1927), African-American man murdered by a white mob", "* John Carter (police officer) (1882–1944), Assistant Commissioner of the London Metropolitan Police, 1938–1940", "* John Carter (endocrinologist) (born 1944), Australian medical academic and endocrinologist", "* John Carter (1942–2000), founder of Carters Steam Fair"]}, {"page": "List of people from Birmingham", "response": ["*John Carter – Musician"]}, {"page": "The Flower Pot Men", "response": ["The Flower Pot Men were a studio recording construct created by John Carter and Ken Lewis, originally the main songwriters of The Ivy League. They notably were featured as backup vocalists for early Who albums and for the first recording of The Sagittarius', \"My World Fell Down\". Ken Lewis departed as a result of his lack of interest in touring, and Carter joined him soon after to create a musical songwriting duo.", "\"Let's Go to San Francisco\" was written and recorded by John Carter and Ken Lewis, a songwriting team  known as Carter & Lewis. The composition, psychedelic in nature, took vocal and instrumental inspiration from The Beach Boys. The name The Flower Pot Men was derived from the BBC children's show Flower Pot Men, with the obvious psychedelic era puns on flower power and \"pot\" (cannabis). In the US, they were commonly deemed The Flower Men on radio airplay to avoid the drug reference.", "Burrows and Shaw later surfaced in another John Carter project, The First Class, whose sole Top 40 hit was \"Beach Baby\". A harmony phrase shortly before the fade out of this record referenced \"Let's Go to San Francisco\". Carter also recorded a track \"Let's Go Back To San Francisco (Parts 1 and 2)\", released as 'Beautiful People' in 1981.  Later the song appeared on a First Class retrospective and ultimately appeared on a compilation album by the Flower Pot Men.", "*Mark Frumento, liner notes John Carter – A Rose by any Other Name (Rev-ola REV 84), October 2004.", "*Bob Stanley, liner notes The John Carter Anthology – Measure by Measure (RPM rpmd268), 2003."]}, {"page": "Penny Farthing Records", "response": ["Penny Farthing also recorded an early album by Raymond Froggatt. However, most of the company's revenue was gained from Germany, where their solo artist signing Kincade had a number of minor hits, including \"Dreams Are 10 A Penny\", \"Big Hand For Annie\" written by John Carter. Carter, writing under a number of different names, also had hits with Penny Farthing in the early 1970s."]}, {"page": "The New Vaudeville Band", "response": ["The original version of the New Vaudeville Band was an assemblage of studio musicians, specifically gathered by Geoff Stephens to record the song \"Winchester Cathedral\", which he both wrote and produced.  The record sold over three million copies worldwide, earning the RIAA certification of gold disc status.  The track also won a Grammy Award for Best Contemporary Song in 1967. The lead vocal was sung by John Carter, formerly of The Ivy League, who had sung on the demo of the song, which Stephens decided to keep for the commercial release. ", "When Stephens received several requests for the New Vaudeville Band to tour and to record a full-length album, he had to put together a group, for the song had been recorded by session musicians hired only for the recording. He contacted the Bonzo Dog Doo-Dah Band, which played similar music at the time. Only Bob Kerr from that group was interested, so he left the Bonzos in order to help Stephens form a touring version of The New Vaudeville Band, which included original session drummer Henri Harrison. Meanwhile, John Carter had no interest in continuing with the group as a singer, though he still co-wrote the occasional song with Stephens for use by the group.  The new lead singer of the group was Alan Klein, who was billed as 'Tristam, Seventh Earl of Cricklewood'. Klein also wrote some of the group's material. Mick Wilsher, on guitars, also sang occasional lead vocals. The official line-up as of late 1966 was:"]}, {"page": "Perry Robinson", "response": ["* You Better Fly Away – Clarinet Summit (with John Carter, Gianluigi Trovesi, Theo Jörgensmann, Bernd Konrad, Ernst–Ludwig Petrowsky, Didier Lockwood, Stan Tracey, Eje Thelin, Kai Kanthak, Jean-François Jenny-Clark, Günter \"Baby\" Sommer, Aldo Romano) (1979)"]}, {"page": "Subterranean Jungle", "response": ["The album opens with two cover songs; the first, \"Little Bit O' Soul\", was originally written by John Carter and Ken Lewis and the second, \"I Need Your Love\", was first performed by Bobby Dee Waxman. Subterranean Jungle is the first Ramones' release to begin with a song not written by the band. This track list structure was criticized by author Everett True, who said that it was \"disorientating.\" Johnny also thought that the fact that the album featured three covers was a bad idea, saying, \"we shouldn't have, but I was happy with the guitar sound on it.\" The album's third track, \"Outsider\", was written by Dee Dee and, in 2002, it was covered by Green Day on Shenanigans.Myers 2006, p. 189. \"What'd Ya Do?\" was track number four, and was described by music journalist Chuck Eddy as \"crudely metallic.\"Eddy 2011, p. 34. Eddy also deemed the next track, \"Highest Trails Above\", as \"AOR-mystic.\" \"Somebody Like Me\" was called a \"full-on rock anthem\" by Everett True, who went on to say that the lyrics contained \"no-nonsense lines.\"True 2005, p. 179."]}, {"page": "The First Class", "response": ["The First Class were a British pop music studio-based group, put together by songwriter and record producer John Carter. They are best known for their hit song \"Beach Baby,\" a top 20 hit in both the US and UK.", "The First Class was the studio creation of British singer/songwriter John Carter, who hired singers Tony Burrows and Chas Mills to join him as an outlet for material Carter wrote, with his creative partner and wife, Gillian (Jill) Shakespeare. In the 1960s, Carter had formed the group Carter-Lewis and the Southerners with fellow producer Ken Lewis. That band dissolved when Carter and Lewis began working extensively as studio singers, appearing on the hits \"It's Not Unusual\" (Tom Jones), \"I Can't Explain\" (The Who), \"Hi Ho Silver Lining\" (Jeff Beck), \"(There's) Always Something There to Remind Me\" (Sandie Shaw), \"Excerpt From A Teenage Opera\" (Keith West), and \"Out of Time\" (Chris Farlowe). Concurrently with this session work, Carter was a member of The Ivy League, leaving in 1966 to be replaced by Burrows.", "Chas Mills subsequently retired from the music industry to run a restaurant in North London. Tony Burrows went on to become known as the only artist to score five hit tunes with five different groups, the artist known as \"A one-hit wonder . . . five times.\"  Burrows was also lead singer on the song \"Love Grows (Where my Rosemary Goes)\" with Edison Lighthouse (although some You Tube videos of the era show other singers lip-synching to his vocals, it was his voice on that hit song. You can view him singing \"Love Grows\" when it was aired on Top of the Pops via YouTube). Burrows also sang on White Plains' hit \"My Baby Loves Lovin'\" with his frequent collaborator Roger Greenaway. Burrows sang lead male vocals on the hit by Brotherhood of Man, \"United We Stand,\" also with Greenaway. Burrows and Greenaway were also paired in their early years as \"The Pipkins,\" with a top hit song called \"Gimme Dat Ding.\" The two individually continued on to numerous successful ventures and occasionally perform together reviving their former hit songs. John Carter remained active writing jingles and managing his back catalogue. He later reflected on The First Class: \"Making the First Class albums was a very happy and creative time. Who knows if we ever come up with another suitable song, maybe we will all get back together one day and record under that name again?\"Liner notes by Fraser Massey for See For Miles Records, CD SEECD 443"]}, {"page": "Dana Gillespie", "response": ["She recorded initially in the folk genre in the mid-1960s. Some of her recordings as a teenager fell into the teen pop category, such as her 1965 single \"Thank You Boy\", written by John Carter and Ken Lewis and produced by Jimmy Page. Page also played, uncredited, on Gillespie's debut LP, Foolish Seasons. Her acting career got under way shortly afterwards, and it overshadowed her musical career in the late 1960s and 1970s."]}, {"page": "Carter-Lewis and the Southerners", "response": ["Carter-Lewis and the Southerners were an early-1960s rock band, formed by the Birmingham-born musicians Ken Lewis (guitarist, singer, songwriter) and John Carter (producer, singer, songwriter).Larkin C 'Virgin Encyclopedia of Sixties Music' (Muze UK Ltd, 1997)  p96", "Carter and Lewis also composed songs for a number of other artists, including Brenda Lee and P.J. Proby. John Carter sang the lead on The New Vaudeville Band's 1966 number 1 hit, \"Winchester Cathedral\", and the pair wrote Herman's Hermits 1965 hit \"Can't You Hear My Heartbeat\", which reached number 2 on the US Billboard Hot 100."]}, {"page": "Kincade (band)", "response": ["Kincade was an English band that was formed in 1972.  In that year, they had their hit single, \"Dreams are Ten a Penny\", but the band itself did not exist at the time. The song was  written by John Carter and his wife Gill.Liner notes Measure for Measure The John Carter Anthology 1961-1977, RPM Records, RPMD368  Carter also sang all the vocals and played the guitar on the record.  The song was released by the British record producer on the Penny Farthing Records label.  Although the record was unsuccessful in the UK, it reached the #2 in Germany, spent six months on the charts there, and sold a million copies."]}, {"page": "Normie Rowe", "response": ["Arriving in London ahead of his band, Rowe engaged one Ritchie Yorke as his London agent and began to record with producers Trevor Kennedy and John Carter, using the cream of London's session musicians, including Big Jim Sullivan, Jimmy Page, John Paul Jones, famed drummer Clem Cattini, and vocal group The Breakaways. The sessions produced several strong new recordings including \"Ooh La La\", \"It's Not Easy\", \"Mary Mary\", \"Turn on the Love Light\" and \"Can't Do Without Your Love\". Despite his absence in London, Rowe's run of chart success in Australia continued—his next single, \"Ooh La La\" / \"Ain't Nobody Home\" (Nov. 1966) was another double-sided hit in Melbourne and a Top 5 hit in most capitals, reaching #2 in Sydney, and #4 in Brisbane and Adelaide."]}, {"page": "Geoff Stephens", "response": ["Geoffrey Stephens (1 October 1934 – 24 December 2020) was an English songwriter and record producer, most prolific in the United Kingdom in the 1960s and 1970s.  He wrote a long series of hit records, often in conjunction with other British songwriters including Tony Macaulay, John Carter, Roger Greenaway, Peter Callander, Barry Mason, Ken Howard, Alan Blaikley, Don Black, Mitch Murray, and Les Reed.", "With John Carter, Stephens wrote \"Semi-Detached Suburban Mr. James\" for Manfred Mann and, with Les Reed, \"There's a Kind of Hush\" for The New Vaudeville Band.  A year later, a cover version of \"There's a Kind of Hush\" was a hit for Herman's Hermits, and it was also later a hit for The Carpenters. Over the next few years he wrote, or co-wrote, hits for The Hollies (\"Sorry Suzanne\"), Ken Dodd (\"Tears Won’t Wash Away These Heartaches\"), Cliff Richard (\"Goodbye Sam, Hello Samantha\"), Tom Jones (\"Daughter of Darkness\"), Mary Hopkin (\"Knock, Knock Who's There?\" - the 1970 UK entry in the Eurovision Song Contest), Scott Walker (\"Lights of Cincinnati\"), Dana (\"It's Gonna Be a Cold Cold Christmas\"), The Drifters (\"Like Sister And Brother\"), Crystal Gayle (\"It's Like We Never Said Goodbye\"), Hot Chocolate (\"I'll Put You Together Again\"), Sue and Sunny and Carol Douglas (\"Doctor's Orders\") and, most successfully of all, UK number one hits for David Soul (\"Silver Lady\") and The New Seekers (the Ivor Novello Award-winning, \"You Won't Find Another Fool Like Me\")."]}, {"page": "White Plains (band)", "response": ["White Plains evolved from the late 1960s pop/psychedelic band the Flower Pot Men, composed of Tony Burrows, Pete Nelson, and Robin Shaw together with Neil Landon (who went to Fat Mattress). The band was primarily a studio project led by John Carter. The last single of the Flower Pot Men for Deram Records was composed by Roger Greenaway and was an attempt at a hit single in the style of the then popular Love Affair called \"In a Moment of Madness\".  The single did not chart and for the next single the band's name was changed to White Plains.  The band's songs were mainly produced and written by Greenaway and Roger Cook.", "\"I've Got You on My Mind\" was a UK hit, reaching number 17. The 1973 hit \"Step into a Dream\" was used in the British television commercials for Butlins' holiday camps.  Burrows, Nelson, and Shaw met again in 1974 in First Class, another John Carter project that scored worldwide with their single, \"Beach Baby\"."]}, {"page": "Early Hits of 1965", "response": ["#\"Can't You Hear My Heartbeat?\" (John Carter, Ken Lewis) – 2:02"]}, {"page": "Volume One (The West Coast Pop Art Experimental Band album)", "response": ["#\"Funny How Love Can Be\" (John Carter, Ken Harper) - 1:38"]}, {"page": "It's Not Unusual", "response": ["* John Carter and Ken Lewis – backing vocals"]}, {"page": "Winchester Cathedral (song)", "response": ["(John Carter) singing through his hands to imitate a megaphone sound. Although the song was recorded entirely by session musicians, when it became an international hit, an actual band had to be assembled, with Fontana trying unsuccessfully to recruit the Bonzo Dog Doo-Dah Band. The recording is one of the few charting songs to feature a bassoon. The band toured extensively under the tutelage of Peter Grant, who later went on to manage The Yardbirds and Led Zeppelin."]}, {"page": "The Music Explosion", "response": ["  Written by John Carter and Ken Lewis, who had previously written big hits for The Ivy League and Herman's Hermits, the song (Laurie Records No. 3380, subsequently reissued on Buddah Records) was the band's only top 40 hit.  This single paved the way for tours with contemporaries like The Left Banke and The Easybeats."]}, {"page": "Herman's Hermits on Tour", "response": ["# \"Can't You Hear My Heartbeat\" (John Carter, Ken Lewis) – 2:15"]}, {"page": "The Most of Herman's Hermits Volume 2", "response": ["# \"My Sentimental Friend\" (Geoff Stephens, John Carter) - 3:16"]}, {"page": "Carter & Lewis", "response": ["John Carter & Ken Lewis are English songwriters, who wrote many hits in the 1960s for various pop bands. They were published by Southern Music, and operated out of their recording studios in London's Denmark Street.", "*John Carter (born John Nicholas Shakespeare, 20 October 1942, Small Heath, Birmingham) "]}, {"page": "Kristina Hautala", "response": ["| style=\"text-align:center;\"| 1970 ||  style=\"text-align:center; width:140px;\"| EMI-Columbia 5E006-34135 A \"Vain hän \"B \"Kop kop, ken lie?\"|| style=\"text-align:center;\"| A Kristina Hautala (l)Peter Moesser (m)B Reino Bäckman (l)John Carter (m)||  style=\"text-align:center; width:350px;\"| A/B arranged and conducted by Seppo PaakkunainenA introduced by Katja Ebstein as \"Ich Will Ihn\" in 1970B cover of \"Knock, Knock Who's There?\" by Mary Hopkin"]}, {"page": "Ken Lewis (songwriter)", "response": ["Kenneth Alan James Hawker (3 December 1940 – 2 August 2015) known as Ken Lewis, was an English singer, songwriter and record producer. He is considered one of the more successful songwriters of the 1960s as a result of his collaborations with John Carter. His biggest success was \"Can't You Hear My Heartbeat\", which was a 1965 US number 2 hit single for Herman's Hermits.", "Lewis was born in Small Heath, Birmingham, England. While still at elementary school, Lewis met his future songwriting partner John Shakespeare. They formed a skiffle band in the 1950s called LVI, when they began writing songs together. In 1960 the duo went to London, and presented themselves under their songwriting pseudonyms John Carter and Ken Lewis. Terry Kennedy became their manager and convinced them to start their own band as an outlet for their songs.", "His funeral took place in the East Chapel of Cambridge Crematorium on 20 August 2015. His former writing partner John Shakespeare (alias John Carter) was among those attending. \"Let's Go to San Francisco\" was played at the end of the ceremony. The funeral date coincided with that of 1960s contemporary, Cilla Black.", "*Mark Frumento, liner notes John Carter – A Rose by any Other Name (Rev-Ola REV 84), January 2005.", "*Bob Stanley, liner notes The John Carter Anthology – Measure by Measure (RPM rpmd268), 2003"]}, {"page": "Knock, Knock Who's There?", "response": ["\"Knock, Knock Who's There?\" is a song written and composed by John Carter and Geoff Stephens, released on Apple Records. It was originally sung and recorded by the Welsh singer Mary Hopkin and was the 's entry at the Eurovision Song Contest 1970, where it came second. The single version was produced by Mickie Most and reached No. 2 on the UK charts.", "Category:Songs written by John Carter (musician)"]}, {"page": "Little Bit O' Soul", "response": ["\"Little Bit O' Soul\" is a song written in 1964 by British songwriters, John Carter and Ken Lewis. It was originally recorded by Coventry band, the Little Darlings, and released in 1965 on Fontana Records. ", "Category:Songs written by John Carter (musician)"]}, {"page": "Beach Baby", "response": ["\"Beach Baby\" is a song by the British band The First Class. It was written by John Carter and his wife, Gillian (Jill) Shakespeare; the song became the band's only substantial hit.", "An engineer who was involved in the recording session recalls: \"The recording was made in February 1974 at Lansdowne Studios, Holland Park, London. Tony Burrows was singing, John Carter producing & Paul Holland engineering. At the time, I was a house assistant engineer & remember being very impressed with the high level of professionalism and ability of the visiting engineer Paul Holland, who I had never met before. I don't believe that he sat down at any time during the session !  -  If my memory serves me right, the recording was completed in one evening session.\" - (source:- Mark Dearnley)", "Category:Songs written by John Carter (musician)"]}, {"page": "Neil Landon", "response": ["Born in Petworth, Sussex, England, and later based in Folkestone, England, Landon started singing and playing semi-professionally under his real name of Pat Cahill in 1960, replacing Kitson 'Kit' Keen in the Dover based 'Rolling Stones' (no connection with the later famous band of that name). When he left to front the 'Cheetahs' (1961–62), he was replaced by Mick Morris (later of Mirkwood). After adopting the name Neil Landon, he joined Folkestone group the 'Burnettes' (1962–65), in which Noel Redding became lead guitarist and Pete Kircher, the drummer. In 1965 Landon released two singles, \"Waiting Here For Someone\" b/w \"I've Got Nothing To Lose\" (Decca F 12330) and \"I'm Your Puppet\" b/w \"I Still Love You\" (Decca F 12451).  Both were written and produced by John Carter and Ken Lewis. Despite television appearances however, early success eluded him.", "After replacing Ken Lewis in The Ivy League (Tony Burrows had replaced John Carter in 1966) Landon sang on a few of the group's less successful records. Subsequently both Landon and Burrows became members of The Flower Pot Men, who scored a hit in 1967 with \"Let's Go To San Francisco\" (Deram DM142) which reached Number 4 in the UK Singles Chart."]}, {"page": "Let's Go to San Francisco", "response": ["\"Let's Go to San Francisco\" is the only UK-charting single by the British pop group The Flower Pot Men. The song was written and produced by John Carter and Ken Lewis, engineered by John Mackswith and released in 1967 on 7\" single format. Lead vocals were by Tony Burrows, who later did vocals for groups like Edison Lighthouse, First Class, White Plains, and The Brotherhood of Man. It is regarded as a work of the 1960s California Sound.", "Category:Songs written by John Carter (musician)"]}, {"page": "The Ivy League (band)", "response": ["The Ivy League was formed in August 1964 by three session singers with an extensive vocal range, John Carter, Ken Lewis (both previous members of Carter-Lewis and the Southerners) plus Perry Ford. They were first heard doing background vocals for The Who on their hit single \"I Can't Explain\" in November 1964 but, after that, the Who's producers entrusted John Entwistle and Pete Townshend with the backing vocals. Their debut single, \"What More Do You Want\" generated little interest but the second release, \"Funny How Love Can Be\" made the UK chart's Top 10. Further hits followed, including \"That's Why I'm Crying\" and UK chart number 3 \"Tossing and Turning\". The original trio released just one album, 1965's This is the Ivy League – panned in the music press as disappointing, with its excessively wide spread of musical styles and material – before both Carter and Lewis left the group. Carter departed in January 1966, with Lewis leaving about one year later. The duo then set up a production company called Sunny Records.", "* John Carter – vocals"]}, {"page": "Herman's Hermits Hits", "response": ["#\"Can't You Hear My Heartbeat\" (John Carter, Ken Lewis) - 2:16"]}]}}