{"wiki_id": "http://www.wikidata.org/entity/Q16947129", "itemLabel": "Steve Voce", "itemDescription": "British journalist and music critic", "wikipedia_url": "https://en.wikipedia.org/wiki/Steve_Voce", "wikipedia_page": {"main": "Steve Voce (born 23 December 1933) is a British journalist and music critic.\nAs well as writing obituaries for The Independent, Voce has been a columnist for Jazz Journal for about 60 years, and presented the Jazz Panorama radio programme on BBC Radio Merseyside for 35 years.", "link_mentions": [{"page": "Derek Bailey (guitarist)", "response": ["* Obituary by Steve Voce in The Independent"]}, {"page": "Harry James", "response": ["James felt strongly about the music he both played and recorded. In 1972 while in London, he did an interview with the English jazz critic Steve Voce, who asked if the biggest audience was for the commercial numbers he had recorded. James visibly bristled, replying \"That would depend on for whom you are playing. If you're playing for a jazz audience, I'm pretty sure that some of the jazz things we do would be a lot more popular than 'Sleepy Lagoon,' and if we're playing at a country club or playing Vegas, in which we have many, many types of people, then I'm sure that 'Sleepy Lagoon' would be more popular at that particular time. But I really get bugged about these people talking about commercial tunes, because to me, if you're gonna be commercial, you're gonna stand on your head and make funny noises and do idiotic things. I don't think we've ever recorded or played one tune that I didn't particularly love to play. Otherwise, I wouldn't play it.\""]}, {"page": "Ian Carr", "response": ["Ian Carr died aged 75 on 25 February 2009, having suffered from Alzheimer's disease. A memorial service was held at Golders Green Crematorium in London the following month. In addition to fellow Nucleus member Geoff Castle, speakers at the service included artist Gerald Laing, author, critic and broadcaster Alyn Shipton, Mike Dibb (with whom Carr collaborated on two films on Miles Davis and Keith Jarrett)Steve Voce, \"Ian Carr: Trumpeter and composer whose band Nucleus was at the forefront of the jazz-rock movement\", The Independent, 27 February 2009. and Carr's students Julian Joseph, Sara Dillon and Nikki Yeoh."]}, {"page": "Harry Beckett", "response": ["Harold Winston \"Harry\" Beckett (30 May 1935According to his wife, Beckett was 86 (sic) when he died, see the obituary by Steve Voce, The Independent, 24 August 2010, where his date of birth is given as 30 May 1923. – 22 July 2010) was a British trumpeter and flugelhorn player of Barbadian origin."]}, {"page": "Dick Morrissey", "response": ["Steve Voce wrote in The Independents obituary that Morrissey had the"]}, {"page": "Stanley Dance", "response": ["During the 1950s, he coined the term mainstream to describe those in between revivalist Dixieland and modern bebop, concentrating on black musicians.Steve Voce, \"Obituary: Stanley Dance\", The Independent, 2 March 1999. In 1958, Decca's Felsted Records commissioned Dance to produce a series of New York recordings of Coleman Hawkins, Cozy Cole/Earl Hines, Billy Strayhorn/Johnny Hodges, Buddy Tate, and several others, which were released under the collective title \"Mainstream Jazz\".", "Dance was famously characterised as an opponent of Bebop and the later jazz of Miles Davis, John Coltrane, and Free Jazz, based largely on his columns in Jazz Journal and in Jazz Times. His biographers (including Porter, Scott Yanow, and Steve Voce), view him rather as an energetic advocate of the music he loved and worked with.  Dance's own perspective (from a 1995 radio interview) was:"]}, {"page": "Mike Osborne", "response": ["Mike Osborne was born in Hereford, England, and attended Wycliffe College in Gloucestershire and the Guildhall School of Music.Steve Voce, \"Mike Osborne\" (obituary), The Independent, 24 September 2007.Jason Ankeny, Mike Osborne biography at AllMusic. From 1962 to 1972, Osborne belonged to the Mike Westbrook band. During this period the artist also worked with musicians such as Michael Gibbs, Mike Cooper, Stan Tracey, Kenny Wheeler, Humphrey Lyttelton, Alan Skidmore, John Surman, Harry Miller, Alan Jackson (drums), John Mumford (trombone) and Lionel Grigson.Richard Wilcocks, \"The Peanuts Club - a small part of the counter-culture\", Thepeanutsclub.blogspot.co.uk, 4 August 2016. During 1974–75, Osborne was part of the saxophone trio S.O.S. with John Surman and Alan Skidmore. They recorded an LP plus BBC radio and television sessions and toured extensively in Europe."]}, {"page": "Jimmy Woode", "response": ["He joined the Duke Ellington Orchestra in 1955,Steve Voce Obituary: Jimmy Woode, The Independent, 28 April 2005 appearing on many of Ellington's recordings, including  Such Sweet Thunder and Ella Fitzgerald Sings the Duke Ellington Songbook, both from 1957, as well as the performance at the 1956 Newport Jazz Festival issued on Ellington at Newport. He stayed with the Orchestra until 1960, when he left to live in Europe."]}, {"page": "Cab Kaye", "response": ["Kaye led multi-ethnic bands usually consisting of musicians from the UK, Africa, and the West Indies. Later that year he was in the revue Memories of Jolson,Steve Voce, \"Obituary: Cab Kaye\", The Independent, 17 March 2000. a musical with sixteen-year-old Shirley Bassey. The show toured Scotland, but Kaye left after the first performance because he thought the show was racist.Obituary: Correction, The Independent, 14 July 2000. He turned to variety shows, according to Melody Maker in 1953, and he founded a theatre booking agency, Black and White Productions, to book small theatre and film roles for himself and other musicians.Melody Maker, 26 March 1973. His career as a businessman was brief, and he returned to music."]}, {"page": "Alun Morgan", "response": ["*1998, 1995: The Gramophone Jazz Good CD Guide, with Keith Shadwick, Dave Gelly, Steve Voce and Brian Priestley, Gramophone Publications"]}, {"page": "Max Jones (journalist)", "response": ["In 1942 and 1943, Jones worked for the BBC radio programme Radio Rhythm Club; and in 1942, together with authors Albert McCarthy and Charles Fox, he founded the magazine Jazz Music,Steve Voce, \"Obituary: Max Jones\", The Independent, 4 August 1993. which became meritorious as it set out \"to reassert the pioneering role of the African-American, to emphasise the music’s social dimensions, and to attack the glossy commercialism of big-band swing\".The Jazz site "]}, {"page": "Voce, Steve", "response": ["#REDIRECT Steve Voce"]}, {"page": "Voce (surname)", "response": ["*Steve Voce (born 1933), British journalist"]}]}}