{"wiki_id": "http://www.wikidata.org/entity/Q1699765", "itemLabel": "John North", "itemDescription": "British historian of science", "wikipedia_url": "https://en.wikipedia.org/wiki/John_North_(historian)", "wikipedia_page": {"main": "John David North (19 May 1934 – 31 October 2008) was a British historian of science and author of numerous books.\nNorth was born in Cheltenham, Gloucestershire in 1934. He attended Batley Grammar School and then read Mathematics at Merton College, Oxford and later Philosophy, Politics and Economics. He met his wife Marion in Oxford, and married her in 1957. Later he went to London University where he took an external degree in Astronomy, Physics and Applied Maths in 1958.His first book was The Measure of the Universe: a History of Modern Cosmology (1965), which was praised as \"a virtually complete history of modern cosmology\". Not long after he started studying medieval science as he had been appointed librarian and assistant curator of the Museum of the History of Science, Oxford. He was appointed Professor of History of Philosophy and the Exact Sciences at the University of Groningen, Netherlands in 1977, where he stayed until his retirement in 1999. North was elected a member of the Royal Netherlands Academy of Arts and Sciences in 1985. He wrote two books on mediaeval scientist and mathematician Richard of Wallingford. He was also briefly a member of the British Astronomical Association in the 1950s.\nNorth was diagnosed with cancer in 2005, and died on 31 October 2008.", "link_mentions": [{"page": "Long Man of Wilmington", "response": ["Professor John North wrote that during the centuries around 3480 BC the figure would have been positioned to mark the constellation Orion's movement across the ridge above it. The figure, according to this interpretation, may have been a manifestation of a Neolithic astral religion. Another suggestion was that the figure had a Romano-British provenance, while an origin in the time of Anglo-Saxon England gained credence after the 1965 discovery at Finglesham in Kent of an Anglo-Saxon brooch depicting a figure, (possibly Odin), holding two spears in a similar fashion to the Long Man."]}, {"page": "History of Christian thought on persecution and tolerance", "response": ["Though tolerance was not a fully developed concept, and was held with some ambivalence, Guy Stroumsa says Christian thought of this era promotes inclusivity, yet invents the concept of heresy at the same time. Tertullian, a second-century Christian intellectual and lawyer from Carthage, advocated for religious tolerance primarily in an effort to convince pagan readers that Christianity should be allowed into the religious \"market-place\" that historian John North proposes second century Rome had become. On the other hand, Stroumsa argues that Tertullian knew co-existence meant competition, so he attempted to undermine the legitimacy of the pagan religions by comparing them to Christianity at the same time he advocated for tolerance from them.  Justin Martyr (100–165 CE) wrote his First Apology (155–157 CE) against heretics, and is generally attributed with inventing the concept of heresy in Christian thought. Historian Geoffrey S. Smith argues that Justin writes only to answer objections his friends are facing and to defend these friends from ill treatment and even death. He quotes Justin in a letter to the emperor as saying he is writing: \"On behalf of those from every race of men who are unjustly hated and ill-treated, being one of them myself.\" However, Alain Le Boulluec argues it is within this period that use of the term \"heretic\" in Christian thought and writings changes from neutral to derogatory."]}, {"page": "Nicholas Kratzer", "response": ["Peter Drinkwater has presented a critical evaluation of the sundials attributed to Kratzer, in particular the one in the Holbein portrait. He comments that \"Kratzer triumphed, not through genius or creativity, but through having learned what others had discovered and invented, and by being the first to apply that learning in England\". John North concurs: \"Kratzer doubtless had nothing new to offer of a fundamental kind. Many of his dials were unusual, but his favorite polyhedral dial was perhaps more useful as a repository of verses [...] than for actually announcing the time with any accuracy\". Nonetheless, Kratzer brought useful German skills and knowledge to the English court and was well-regarded over a period of nearly 30 years."]}, {"page": "John North", "response": ["John North may refer to:", "*John North (died 1597) (1551–1597), MP for Cambridgeshire, Cambridge and Orford", "*John North (City of York MP) (1495–1558), Member of Parliament for City of York", "*John North (Oxfordshire MP) (1802–1894), British politician", "*John North (billiards player), World Champion of English billiards in the 20th century, see World Professional Billiards Championship", "*John North (American football) (1921–2010), original Baltimore Colts player and New Orleans Saints head coach", "*John North (cricketer) (born 1970), former English cricketer", "*John North (Trinity) (1645–1683), Master of Trinity College, Cambridge 1677–1683", "*John North (historian) (1934–2008), British historian of science", "*John North (theologian) (1871–1950), New Zealand Baptist minister, editor and theological college principal"]}, {"page": "John David North", "response": ["#REDIRECT John North (historian)"]}, {"page": "J. D. North", "response": ["#REDIRECT John North (historian)"]}, {"page": "Astrarium of Giovanni Dondi dell'Orologio", "response": ["Dondi documented the Astrarium in detail in the Tractatus astrarii, which is the earliest complete surviving description of its kind; the St Albans abbey clock designed by Richard of Wallingford predates it, but survives only as fragments (reconstructed by John North). In the introduction, Dondi writes that his machine was built in accordance with the 13th-century Theorica planetarum of Campano di Novara, and to demonstrate the validity of the descriptions of the motion of heavenly bodies of Aristotle and Avicenna. The Tractatus survives in twelve manuscript sources. The autograph in the Biblioteca Capitolare of Padova (MS. D39) and a copy of it, also in Padova, are certainly the work of Dondi. The other sources are rewritten versions of the autograph, to which Dondi's contribution is as yet unclear. The autograph manuscript was published in 1987 in a critical edition with colour facsimile and French translation by Poulle as the first volume of the Opera omnia of Jacopo and Giovanni Dondi."]}, {"page": "The Equatorie of the Planetis", "response": ["The text contains references to 31 December 1392, and this is used as a baseline date for many of the tables.  John North showed that the text was  written during the first nine months of 1393. How it came to Peterhouse is not known, but it probably happened during the 15th century; around 1538 it is entered in Peterhouse catalog, as Tab. aequ. planetarum autore Simon Bredon. The Equatorie occupies eight leaves of the manuscript; the phrase Radix chaucer appears on fol. 5v.Cambridge, Peterhouse MS 75.I", "On f. 5v, in a note on a page full of tables, the manuscript has the number \"1392\", followed by that number in sexagesimal notation, and the text \"deffea xpi & Rxa chaucer\". Price, and following him other scholars, expanded this as \"differentia Christi et radix Chaucer\"—or \"the difference (in number of days) between (the year of Christ) and the (year of the) radix of Chaucer\"—the radix in question then being the year 1392. F.N. Robinson was not convinced that this (third-person) reference indicated Chaucer's authorship. However, John North argued that the attachment of a name to a relatively \"trivial\" piece of data made it likely that this was a case of self-citation.  ", "The manuscript was in the library of Peterhouse, Cambridge by 1538, and probably by 1472.Cambridge, Peterhouse MS 75.I  It was discovered there by the historian Derek de Solla Price in December 1951.  Although the 19th-century manuscript catalogue stated that the manuscript contained \"directions for making an astrolabe (?)\", Price identified the instrument as a planetary equatorium. He argued that the manuscript was authored by, and written in the hand of, Geoffrey Chaucer. This was a controversial claim, and was treated with some scepticism by Chaucer scholars, though it received influential backing from the historian of astronomy John North.  The manuscript was shown to be in the hand of John Westwyk by Kari Anne Rand in 2014. Further evidence for Westwyk's authorship was revealed by Seb Falk in a book published in 2020."]}, {"page": "John Westwyk", "response": ["Westwyk's Equatorie manuscript was in the library of Peterhouse, Cambridge by 1538, and probably by 1472.Cambridge, Peterhouse MS 75.I  It was discovered there by the historian Derek de Solla Price in December 1951, making headlines worldwide.  Price believed the manuscript was authored by, and written in the hand of, Geoffrey Chaucer.  This was a controversial claim, and was treated with some scepticism by Chaucer scholars, though it received influential backing from the historian of astronomy John North.  The manuscript was shown to be in the hand of John Westwyk by Kari Anne Rand in 2014. In 2020 Westwyk was the subject of a full biography by Seb Falk, which revealed new evidence for his life and work."]}, {"page": "J.D. North", "response": ["#REDIRECT John North (historian)"]}]}}