{"wiki_id": "http://www.wikidata.org/entity/Q1699529", "itemLabel": "John Callcott Horsley", "itemDescription": "British artist (1817-1903)", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Callcott_Horsley", "wikipedia_page": {"main": "John Callcott Horsley RA (29 January 1817 – 18 October 1903) was an English academic painter of genre and historical scenes, illustrator, and designer of the first Christmas card. He was a member of the artist's colony in Cranbrook.", "link_mentions": [{"page": "1840s", "response": ["* December – The world's first Christmas cards, commissioned by Sir Henry Cole in London from the artist John Callcott Horsley, are sent."]}, {"page": "1843", "response": ["* December – The world's first Christmas cards, commissioned by Sir Henry Cole in London from the artist John Callcott Horsley, are sent."]}, {"page": "Christmas card", "response": ["The next cards were commissioned by Sir Henry Cole and illustrated by John Callcott Horsley in London on 1 May 1843.Christmas card sold for record price BBC News. Retrieved 12 June 2011.György Buday, George Buday (1992). The history of the Christmas card. p.8. Omnigraphics, 1992 The central picture showed three generations of a family raising a toast to the card's recipient: on either side were scenes of charity, with food and clothing being given to the poor.The Times (London, England), 26 November 2001, p.8 12 cards from the original print run are said to survive: one, sent by Henry Cole and his wife to his grandmother, was sold in 2001 for £20,000. Allegedly the image of the family drinking wine together proved controversial, but the idea was shrewd: Cole had helped introduce the Penny Post three years earlier. Two batches totaling 2,050 cards were printed and sold that year for a shilling each."]}, {"page": "1848 in literature", "response": ["*c. October – The first frescoes of scenes from English literature in the Poets' Hall of the Palace of Westminster are completed: Charles West Cope's Griselda's first Trial of Patience (based on Chaucer's The Clerk's Tale) and John Callcott Horsley's Satan touched by Ithuriel's Spear while whispering evil dreams to Eve (based on Milton's Paradise Lost)."]}, {"page": "Culture of the United Kingdom", "response": ["Sir Henry Cole devised the concept of sending greetings cards at Christmas time. Designed by John Callcott Horsley for Cole in 1843, the Christmas card accounts for almost half of the volume of greeting card sales in the UK, with over 600 million cards sold annually. The robin is a common sight in gardens throughout the UK. It is relatively tame and drawn to human activities, and is frequently voted Britain's national bird in polls. The robin began featuring on many Christmas cards in the mid-19th century. The association with Christmas arises from postmen in Victorian Britain who wore red jackets and were nicknamed \"Robins\"; the robin featured on the Christmas card is an emblem of the postman delivering the card."]}, {"page": "List of British painters", "response": ["*John Callcott Horsley (1817–1903)"]}, {"page": "Cragside", "response": ["Armstrong's architect for Cragside's expansion was the Scot R. Norman Shaw. Shaw had begun his career in the office of William Burn and had later studied under Anthony Salvin and George Edmund Street. Salvin had taught him the mastery of internal planning which was essential for the design of the large and highly variegated houses which the Victorian wealthy craved. Salvin and Street had taught him to understand the Gothic Revival. At only 24, he won the RIBA Gold Medal and Travelling Studentship. The connection between Armstrong and Shaw was made when Armstrong purchased a picture, Prince Hal taking the crown from his father's bedside by John Callcott Horsley, which proved too large to fit into his town house in Jesmond, Newcastle. Horsley was a friend of both, and recommended that Shaw design an extension to the banqueting hall Armstrong had previously built in the grounds. When this was completed in 1869, Shaw was asked for enlargements and improvements to the shooting lodge Armstrong had had built at Rothbury four years earlier. This was the genesis of the transformation of the house between 1869 and 1884. Over the next thirty years, Cragside became the centre of Armstrong's world; reminiscing years later, in his old age, he remarked, \"had there been no Cragside, I shouldn't be talking to you todayfor it has been my very life\"."]}, {"page": "Richard Norman Shaw", "response": ["Shaw worked, among others, for the artists John Callcott Horsley and George Henry Boughton, and the industrialist Lord Armstrong.  He designed large houses such as Cragside, Grim's Dyke, and Chigwell Hall, as well as a series of commercial buildings using a wide range of styles."]}, {"page": "1903 in art", "response": ["* October 18 – John Callcott Horsley, painter (b. 1817)"]}, {"page": "Maria Graham", "response": ["Maria Callcott, however, was not someone who accepted ridicule. Her husband and her brother offered to duel Greenough, but she said, according to her nephew John Callcott Horsley, \"Be quiet, both of you, I am quite capable of fighting my own battles, and intend to do it\". She went on to publish a crushing reply to Greenough, and was shortly thereafter backed by none other than Charles Darwin, who had observed the same land rising during Chile's earthquake in 1835, aboard the Beagle.", "*Recollections of a Royal Academician by John Callcott Horsley. 1903"]}, {"page": "Cranbrook, Kent", "response": ["Glassenbury Park is a late-15th-century manor house on the road to Iden Green with a 1730s front block, remodelled in 1877-79 by Anthony Salvia. Wilsley Hotel was originally built in 1864-70 as a home for the Colony artist John Callcott Horsley, designer of the first Christmas card twenty years earlier. The architect was Richard Norman Shaw in his first important domestic commission. The war memorial was erected on Angley Road in 1920."]}, {"page": "Victor Horsley", "response": ["Victor Horsley was born in Kensington, London, the son of Rosamund Haden and John Callcott Horsley R.A. His given names, \"Victor Alexander\", were given to him by Queen Victoria."]}, {"page": "Henry Cole", "response": ["In 1843, Cole introduced the world's first commercial Christmas card,György Buday, George Buday (1992). The history of the Christmas card. p.8. Omnigraphics, 1992 commissioning artist John Callcott Horsley to make the artwork."]}, {"page": "George Henry Boughton", "response": ["Boughton exhibited extensively in both Britain and USA, and was elected a member of the National Academy of Design in New York in 1871. He was elected a member of the Royal Institute of Painters in Water Colours, an Associate of the Royal Academy (ARA) in 1879, and a Royal Academician (RA) in 1896. \"He was a useful and popular member of this body, and worked well as member of the council, as a 'hanger', and as a teacher in the schools.\"GH Boughton. Obituary (The Times, 21 January 1905). After the death of John Callcott Horsley, Boughton was elected a Director of the \"Fine Art and General Insurance Company\".", "In 1865, Boughton married Katherine Louise Cullen (1845-after 1901), and they had an adopted daughter, Florence. Along with John Callcott Horsley, he was one of the early clients of architect Richard Norman Shaw who built a house for the Boughtons on Campden Hill, London. \"The parties given here by Mr and Mrs Boughton were celebrated among artistic and literary people and in the Anglo-American section of the society.\""]}, {"page": "John Calcott Horsley", "response": ["#REDIRECTJohn Callcott Horsley"]}, {"page": "St Paul's Girls' School", "response": ["The buildings for the school were designed by the architect Gerald Horsley, son of the painter John Callcott Horsley and one of the founder members of the Art Workers Guild."]}, {"page": "1885 in art", "response": ["* May 20 – A letter, \"A Woman's Plea\", published in The Times of London protests against the use of nude models in art. Signed \"British Matron\" it is in fact written by painter and senior Royal Academician John Callcott Horsley."]}, {"page": "1848 in art", "response": ["*c. October – The first frescoes of scenes from English literature in the Poets' Hall of the Palace of Westminster are completed: Charles West Cope's Griselda's first Trial of Patience and John Callcott Horsley's Satan touched by Ithuriel's Spear while whispering evil dreams to Eve. "]}, {"page": "1817 in art", "response": ["*January 29 – John Callcott Horsley, English painter (died 1903)"]}, {"page": "J. C. Horsley", "response": ["#REDIRECT John Callcott Horsley"]}, {"page": "1817 in the United Kingdom", "response": ["* 29 January – John Callcott Horsley, painter (died 1903)"]}, {"page": "1843 in the United Kingdom", "response": ["* December – the world's first Christmas cards, commissioned by Sir Henry Cole in London from the artist John Callcott Horsley, are sent."]}, {"page": "Lincoln College of Art", "response": ["The painter and Royal Academician John Callcott Horsley, attending the annual prize-giving in April, 1890, criticised the school for teaching its students such techniques found in the French school of painting, to the detriment of the English school.  He called these techniques a 'fad' and one of those 'ridiculous crazes' that had been imported from Paris.'Lincoln School of Art, Distribution of Prizes and Medals, Address by Mr. Horsley, R. A.', Lincoln Gazette, 12 April 1890 He then went on to expand his criticism to schools of art in general, which he called 'the greatest possible misfortune' to British art (although he did make an exception with Lincoln).'Lincoln School of Art, Distribution of Prizes and Medals, Address by Mr. Horsley, R. A.', Lincoln Gazette, 12 April 1890"]}, {"page": "George Bernard O'Neill", "response": ["In 1855 O'Neill married Emma Stuart Callcott, a cousin of John Callcott Horsley. Through this marriage he entered Horsley’s artistic circle and by 1859 was introduced to the Cranbrook Colony. Next year George and Emma leased a medieval timber-framed, 'Old Wilsley House', about one mile away from the town of Cranbrook and maintained it as a summer home and studio for many years. It became a setting for many of O'Neill's paintings."]}, {"page": "Cranbrook Colony", "response": ["The group evolved in a rather loose and informal manner.  Other artists who soon joined Hardy and Webster were Frederick Hardy's brother George Hardy, John Callcott Horsley, and George Bernard O'Neill (who married Horsley’s cousin Emma Callcott), with George Henry Boughton and Augustus Mulready frequently visiting.Cornucopia  The artists and their families formed strong bonds and were active in their local community, playing a philanthropic role in Cranbrook"]}, {"page": "Augustus Edwin Mulready", "response": ["Mulready was born in Kensal Green, London,1861 and 1871 censuses. the third of five children of William Mulready Junior (1805–1878,  portrait painter and picture restorer), and his wife Sara (1818–1874).England and Wales BMD Index 1837-1915. He studied art at the South Kensington Schools and as early as 1861, at the age of 17, was already promoting himself as a figure artist. In the same year he entered the Royal Academy, London on the recommendation of John Callcott Horsley who took him under his patronage. In 1903, reflecting on Horsley's death, Mulready wrote that Horsley was \"for so many years...regarded by myself as more than a father or valued friend I have known - whose many acts, by word of help and of kindness, throughout the days of his life to me have been so marked and fixed in love though now in tears of memory\".Quoted in \"The Cranbrook Colony exhibition at The Vestry Hall, Cranbrook\". June 29-July 11, 1981. P.32.."]}, {"page": "John Horsley", "response": ["*John Callcott Horsley (1817–1903), English painter"]}, {"page": "Robert Howlett", "response": ["Howlett's studio portraits at 'The Photographic Institute' included eminent 'fine artists' such as William Powell Frith, Frederick Richard Pickersgill, John Callcott Horsley, and Thomas Webster which were among a larger group exhibited at the Art Treasures Exhibition in Manchester in 1857."]}, {"page": "Edward Thomas Daniell", "response": ["Daniell was an active patrons of the arts and held regular dinner parties and other gatherings at his London home. It became a resort of painters including John Linnell, David Roberts, William Mulready, William Dyce, Thomas Creswick, Edwin Landseer, William Collins, Abraham Cooper, John Callcott Horsley, Charles Lock Eastlake,  and William Clarkson Stanfield. Alfred Story, Linnell's biographer, described Daniell's home as \"a treasure-house of art, (which) comprised works by some of the best painters of the day\"."]}, {"page": "The Etching Club", "response": ["*John Callcott Horsley"]}, {"page": "John Hick (politician)", "response": ["In 1855 Hick exhibited two pieces from his collection of art works: The Stag Hunt and Lady Jane Grey and Roger Ascham by John Callcott Horsley in the Fine Art Division of the Exposition Universelle (1855) alongside his father-in-law William Bashall who presented The Madrigal, also by Horsley. Hick and Bashall used the same pair again for the 1857 Art Treasures Exhibition in Manchester with Cupid and Psyche by Benjamin West PRA and Crossing the Brook by Paul Falconer Poole."]}, {"page": "George Capel-Coningsby, 5th Earl of Essex", "response": ["Essex was noted as a major patron of the arts and was responsible for building up a large fine art collection at Cassiobury. An obituary of Essex in 1839 records that \"his Lordship has richly embellished his house at Cassiobury, as well as his town mansion in Belgrave Square, with numerous choice works of our native painters\", and that he had entertained a number of noted British artists of the day at Cassiobury and commissioned works from them, including J. M. W. Turner, Augustus Pugin, John Callcott Horsley, David Wilkie and Edwin Henry Landseer."]}, {"page": "Calcutt", "response": ["* John Callcott Horsley (1817–1903), English Academic painter of genre and historical scenes, illustrator, and designer of the first Christmas card"]}, {"page": "Gerald Horsley", "response": ["Horsley was the son of the painter John Callcott Horsley. He was articled to Norman Shaw from 1879 to 1882, and in 1883 became his assistant. From 1884 to 1885 he was assistant to John Dando Sedding."]}, {"page": "James Dafforne", "response": ["|John Callcott Horsley"]}]}}