{"wiki_id": "http://www.wikidata.org/entity/Q16942568", "itemLabel": "Peter Rodger", "itemDescription": "British filmmaker", "wikipedia_url": "https://en.wikipedia.org/wiki/Peter_Rodger", "wikipedia_page": {"main": "Peter Anthony Rodger (born 6 April 1965) is a British filmmaker and photographer. Rodger is known for his 2009 documentary film Oh My God, as well as his work as a second unit director on The Hunger Games (2012). Rodger has won a number of awards, including from the Houston International Film Festival, the Chicago International Film Festival, the Telly Awards, the Mobius Awards, and the US International Film and Video Festival. He is the father of Elliot Rodger, the perpetrator of the 2014 Isla Vista killings.\n\n", "link_mentions": [{"page": "Barbara Walters", "response": ["On June 10, 2014, it was announced that she would be 'coming out of retirement' in order to do a special 20/20 interview with Peter Rodger, the father of Elliot Rodger who had committed the 2014 Isla Vista killings."]}, {"page": "List of documentary films", "response": ["|Oh My God||2009||Peter Rodger||Peter Rodger"]}, {"page": "Rodger", "response": ["** Peter Rodger, British-American filmmaker, son of George"]}, {"page": "Elliot", "response": ["* Elliot Rodger, (1991–2014) Son of Peter Rodger and Perpetrator of the 2014 Isla Vista shootings "]}, {"page": "2014 Isla Vista killings", "response": ["Elliot Oliver Robertson Rodger was an English-born American college student. Born in London, England, he moved to the United States with his parents at age five. He was raised in Los Angeles. His father is British filmmaker Peter Rodger, his paternal grandfather photo-journalist George Rodger. His mother is a Malaysian Chinese research assistant for a film company. A younger sister was born before his parents divorced. After his father remarried, Peter and his second wife Soumaya Akaaboune, a Moroccan actress with whom Elliot had a strained relationship, had a son together."]}, {"page": "Oh My God (2009 film)", "response": ["Oh My God (later retitled God: The Almighty Question) is a 2009 documentary film by commercial director Peter Rodger. The filmmaker asked people across the world the question \"What is God?\" Notable figures interviewed include Ringo Starr, Hugh Jackman, David Copperfield, Seal, Bob Geldof, Baz Luhrmann, Jack Thompson, Princess Michael of Kent and Lawrence Blair. review, New York Times, November 13, 2009, retrieved 05/24/2014"]}, {"page": "Soumaya Akaaboune", "response": ["Akaaboune met the film producer Peter Rodger in 1999. The pair subsequently married and had a son, Jazz. Akaaboune was the stepmother of Elliot Rodger, the perpetrator of the 2014 Isla Vista killings. The two had a strained relationship, and Rodger had also planned to murder Akaaboune. She returned to Morocco at the end of 2014. Akaaboune speaks French, Arabic, English and Spanish."]}, {"page": "Rodger, Peter", "response": ["#redirectPeter Rodger"]}]}}