{"wiki_id": "http://www.wikidata.org/entity/Q16997158", "itemLabel": "Stuart Macrae", "itemDescription": "English soldier and inventor", "wikipedia_url": "https://en.wikipedia.org/wiki/Stuart_Macrae_(inventor)", "wikipedia_page": {"main": "Colonel Robert Stuart Macrae TD was an inventor best known for his work at MD1 during the Second World War, his best known invention being the sticky bomb.\nMacrae was the author of Winston Churchill's Toyshop, a memoir detailing his experiences at MD1.", "link_mentions": [{"page": "Molotov cocktail", "response": ["There were many who were skeptical about the efficacy of Molotov cocktails and SIPs grenades against the more modern German tanks. Weapon designer Stuart Macrae witnessed a trial of the SIPs grenade at Farnborough: \"There was some concern that, if the tank drivers could not pull up quickly enough and hop out, they were likely to be frizzled to death, but after looking at the bottles they said they would be happy to take a chance.\" The drivers were proved right, trials on modern British tanks confirmed that Molotov and SIP grenades caused the occupants of the tanks \"no inconvenience whatsoever.\""]}, {"page": "Boffin", "response": ["* Col. Stuart Macrae, Winston Churchill's Toyshop: The Inside Story of Military Intelligence (Research), Roundwood Press (1971)"]}, {"page": "Bedford Modern School", "response": ["During World War II, the inventors Cecil Vandepeer Clarke and Stuart Macrae took a prototype of their limpet mine to Bedford Modern School swimming baths, which were closed for such occasions. Clarke was an excellent swimmer and was able to propel himself through the water with a prototype bomb attached to a keeper plate on webbing around his waist.Clarke, John Vandepeer (2005b). \"Wartime memories of my childhood in Bedford Part 1\". WW2 People's War. BBC  "]}, {"page": "Operation Royal Marine", "response": ["The mines were specially developed for the operation by Ministry of Defence 1 (MD1, Churchill's Toyshop), a British weapon research and development organisation. The mine, known as the 'W' Bomb, was designed by Millis Jefferis, who had received the request for the device on 10 November and had completed the first demonstration model by 24 November. A delayed-action fuze based on a soluble chemical pellet was devised by Jefferis' assistant, Stuart Macrae, using an Alka-Seltzer tablet, which was found to dissolve at a predictable rate. Each mine contained  of Trinitrotoluene (TNT). Trials of the mines were carried out in the Thames in December 1939 and depending upon type, either floated or bounced along the riverbed. Because Jefferis' department only consisted of three people at the point, the trials had to be conducted with the help of a boat crewed by local Sea Scouts, who followed the mines after they had been dropped from Chiswick Bridge. Over 20,000 'W' Bombs were produced in the course of the war."]}, {"page": "Sticky bomb", "response": ["Designed by a team from MIR(c) including Major Millis Jefferis and Stuart Macrae, the grenade consisted of a glass sphere containing an explosive made of nitroglycerin and additives which added stability to the mixture and gave it a squash-head-like effect, where the explosive deformed and spread out on the target before exploding. The detonation would be concentrated on a small area, rupturing a thicker armour plate than a more diffuse explosion. The charge was covered in a strong adhesive and surrounded by a sheet-metal casing. When the user pulled a pin on the handle of the grenade, the casing would fall away and expose the sticky sphere. Pulling another pin would arm the firing mechanism and the user would then attempt to attach the grenade to an enemy tank or other vehicle. Letting go of the handle would release a lever that would activate a five-second fuse, which would then detonate the nitroglycerin.", "Under the circumstances, Jefferis considered that his idea might have more general application for the British Army and the Home Guard. Jefferis was in charge of a department known as , which had been created to develop and deliver weapons for use by guerrilla and resistance groups in occupied Europe.  was now charged with the development of the sticky bomb. The problem of designing a sticky bomb was delegated to Robert Stuart Macrae."]}, {"page": "No. 76 special incendiary grenade", "response": ["There were many who were sceptical about the efficacy of Molotov cocktails and SIP grenades against the more modern German tanks. Weapon designer Stuart Macrae witnessed a trial of the SIP grenade at Farnborough: \"There was some concern that, if the tank drivers could not pull up quickly enough and hop out, they were likely to be frizzled to death, but after looking at the bottles they said they would be happy to take a chance.\" The drivers were proved right; trials on modern British tanks confirmed that Molotov and SIP grenades caused the occupants of the tanks \"no inconvenience whatsoever\"."]}, {"page": "Limpet mine", "response": ["On 17 July 1939, Jefferis contacted magazine editor Stuart Macrae for more information about the magnets."]}, {"page": "Archibald Low", "response": ["*The 'W' bomb – a riverine mine for Operation Royal Marine being designed by MD1. It floated just beneath the surface, came up when needed and spread a kind of umbrella out of itself which would detonate when touched. The primary inventors were Millis Jefferis and Stuart Macrae – the latter was formerly an editor of Armchair Science with whom Low was on friendly terms.Macrae, 1972. p.29"]}, {"page": "Millis Jefferis", "response": ["Jefferis was an explosives expert and engineer, but lacked the ability to manage men well. He was assisted in the management of MD1 by a wily assistant – Major Stuart Macrae, whose book Winston Churchill's Toyshop, is still one of the few published works on this unique unit."]}, {"page": "Armchair Science", "response": ["Its editor in 1940, Stuart Macrae, went on to produce weapons for the war effort as part of MD1, known also as \"Churchill's Toyshop\"."]}, {"page": "MacRae", "response": ["*Stuart Macrae (footballer) (1855–1927), English international footballer", "*Stuart Macrae (inventor), British inventor and Army officer"]}, {"page": "MD1 (military R&D organisation)", "response": ["Its two key figures were Major Millis Jefferis and Stuart Macrae, former editor of Armchair Science magazine."]}, {"page": "Edward Terrell", "response": ["Terrell enjoyed a close relationship with Millis Jefferis of MD1, and he once defended Jefferis in court when he had been found to be driving while uninsured.Terrell, 1958, p. 179. In 1947 he represented Robert Stuart Macrae, also of MD1, at the Royal Commission on Awards to Inventors, who was being considered for his work on the sticky bomb and other inventions."]}, {"page": "Cecil Vandepeer Clarke", "response": ["After placing an advertisement in The Caravan & Trailer, he received a visit from the magazine's editor, Stuart Macrae. Macrae later recalled their first meeting:", "In February 1942, Clarke requested a transfer to MD1. The exact circumstances of his transfer are unclear; it seem that his unconventional training methods – breaking into RAF and transformer stations – had made him unpopular. Colin Gubbins liked Clarke, but thought he might be of more use elsewhere and approached Clarke's friend and colleague Stuart Macrae.", "£300 [£] with Stuart Macrae and Charles Neville Wilson for the altimeter switch."]}, {"page": "Robert Stuart Macrae", "response": ["#redirect Stuart Macrae (inventor)"]}, {"page": "Stuart Macrae", "response": ["Stuart Macrae or MacRae may refer to:", "* Stuart Macrae (footballer) (1855–1927), English international footballer", "* Stuart Macrae (inventor), British inventor"]}]}}