{"wiki_id": "http://www.wikidata.org/entity/Q1701904", "itemLabel": "John Teague", "itemDescription": "Canadian architect and mayor (1833-1902)", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Teague", "wikipedia_page": {"main": "John Teague (June 3, 1833 – October 25, 1902) was a Canadian architect and politician who served as mayor of Victoria, British Columbia from 1894 until 1895.Born in Redruth, Cornwall, United Kingdom, Teague left the UK in 1856 spending some time in California before emigrating to British Columbia in 1858. He was an alderman and mayor of Victoria from 1894 until 1895. As an architect and contractor, he played an important role in the design and construction of the most important churches, commercial, residential and civic buildings of his time in Victoria.He was married twice: first to Emily Abington in 1863 and then to Eliza Lazenby in 1892.Teague died in Victoria at the age of 67.", "link_mentions": [{"page": "List of mayors of Victoria, British Columbia", "response": ["* 1894 – 1895 John Teague"]}, {"page": "Hinton Mitchem", "response": ["Mitchem first entered politics as a member of the Albertville, Alabama City Council in 1968.  In 1974, he was elected unopposed in the general election as a member of the Alabama House of Representatives, representing the 25th District, serving a single four-year term from 1975 through 1979 before his election to the Senate. He ran without Republican opposition again in both his first race and in 1982 as well as the special 1983 race the entire legislature had to run in. In 1986, Mitchem stepped down from the Senate and ran in the primary for Lieutenant Governor. In a four-person field, he placed third behind fellow State Senator John Teague and eventual winner, Jim Folsom, Jr., placing just ahead of former State Treasurer Melba Till Allen."]}, {"page": "List of National Historic Sites of Canada in British Columbia", "response": ["| A Reformed Episcopal church designed by John Teague; it is one of the finest examples of Carpenter Gothic on the west coast of Canada"]}, {"page": "Fairholme Manor Bed and Breakfast", "response": ["It was constructed for the sum of $7,000 by contractors Hill and Conley and designed in an Italianate style by architect John Teague. The home's rambling, two-story symmetry; overhanging eaves with decorative brackets; narrow bay windows; and low-pitched, gabled roof are all features typical of this fanciful late 19th century style."]}, {"page": "Victoria City Hall", "response": ["Architect John Teague designed Victoria's City Hall, which is considered \"one of the best surviving examples of Second Empire-style public architecture in Western Canada.\" The earliest surviving municipal hall has a foot 105 tall Gillet and Johnson clock tower, three types of facades, tall windows, pedimented dormer windows and a metal mansard roof. The exterior is constructed of concrete, brick and stone. The Second Empire style reflects a change in the design and construction of governmental buildings, intended to symbolize the government's growth and power. It was constructed from 1878 to 1891 at Pandora Avenue and Douglas Street."]}, {"page": "Cornish Canadians", "response": ["* John Teague (1833-1902), architect and mayor of Victoria"]}]}}