{"wiki_id": "http://www.wikidata.org/entity/Q1701330", "itemLabel": "John Parr", "itemDescription": "British soldier of World War I", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Parr_(British_Army_soldier)", "wikipedia_page": {"main": "Private John Parr (19 July 1897 – 21 August 1914) was an English soldier. He is believed to be the first soldier of the British Empire to fall in action during the First World War.", "link_mentions": [{"page": "Finchley", "response": ["* Private John Parr (1897–1914), the first British soldier and the first soldier of the Commonwealth killed in World War I, was born in Church End Finchley, and lived at 52 Lodge Lane, North Finchley."]}, {"page": "George Lawrence Price", "response": ["Price was originally buried in Havre Old Communal Cemetery, one of the cemeteries subsequently concentrated into the St Symphorien military cemetery, just southeast of Mons. Coincidentally, this is also the final resting place of John Parr and George Edwin Ellison, respectively the first and last British soldiers killed during the Great War. According to Veterans Affairs Canada, Private Price's remains were reinterred at St Symphorien Military Cemetery after the war."]}, {"page": "Battle of Mons", "response": ["The first contact between the two armies occurred on 21 August, when a British bicycle reconnaissance team encountered a German unit near Obourg; and Private John Parr became the first British soldier to be killed in the war. The first substantial action occurred on the morning of 22 August. At  the 4th Royal Irish Dragoons laid an ambush for a patrol of German lancers outside the village of Casteau, to the north-east of Mons. When the Germans spotted the trap and fell back, a troop of the dragoons, led by Captain Hornby gave chase, followed by the rest of his squadron, all with drawn sabres. The retreating Germans led the British to a larger force of lancers, whom they promptly charged and Captain Hornby became the first British soldier to kill an enemy in the Great War, fighting on horseback with sword against lance. After a further pursuit of a few miles, the Germans turned and fired upon the Irish cavalry, at which point the dragoons dismounted and opened fire. Drummer E. Edward Thomas is reputed to have fired the first shot of the war for the British Army, hitting a German trooper.", "The Germans established the St Symphorien Military Cemetery as a memorial to the German and British dead. On a mound in the centre of the cemetery, a grey granite obelisk  tall was built with a German inscription: \"In memory of the German and English soldiers who fell in the actions near Mons on the 23rd and 24th August 1914.\" Originally,  and  soldiers were interred at the cemetery. More British, Canadian and German graves were moved to the cemetery from other burial grounds and more than  were eventually buried in St. Symphorien, of which over  unidentified. Special memorials were erected to five soldiers of the Royal Irish Regiment believed to be buried in unnamed graves. Other special memorials record the names of four British soldiers, buried by the Germans in Obourg Churchyard, whose graves could not be found. St. Symphorien cemetery also contains the graves of the two soldiers believed to be the first (Private John Parr, 4th Battalion, Middlesex Regiment, 21 August 1914) and the last (Private Gordon Price, 28th Canadian Infantry Regiment, 11 November 1918) Commonwealth soldiers to be killed during the First World War. A tablet in the cemetery sets out the gift of the land by Jean Houzeau de Lehaie. A bronze tablet was erected on a wall of Obourg railway station, commemorating British soldiers who lost their lives around Obourg including an unnamed soldier who is said to have stayed behind at the cost of his own life, perched atop the station, in order to cover his withdrawing comrades. The small portion of the wall supporting the plaque was preserved when the rest of the building was demolished in 1980."]}, {"page": "Private John Parr", "response": ["#REDIRECT John Parr (British Army soldier)"]}, {"page": "Merle Hay", "response": ["*John Parr, the first British Army soldier killed, 1914"]}, {"page": "1914 in the United Kingdom", "response": ["* 21 August – World War I: reconnaissance cyclist Private John Parr (aged 17) becomes the first British soldier to be killed on the Western Front, at Obourg in Belgium."]}, {"page": "Obourg", "response": ["It is the site of the first British soldier to be killed in the First World War, Private John Parr on 21 August 1914."]}, {"page": "Thomas Enright", "response": ["*John Parr, the first British Army soldier killed, 1914"]}, {"page": "John Parr (soldier)", "response": ["#REDIRECT John Parr (British Army soldier)"]}, {"page": "St Symphorien Military Cemetery", "response": ["Notable Commonwealth burials in the cemetery include John Parr and George Lawrence Price, traditionally believed to be the first and last Commonwealth soldiers killed in action during the First World War, and Maurice Dease, the first posthumous recipient of the Victoria Cross of World War I. Notable German burials include Oskar Niemeyer, the first Iron Cross recipient of World War I.", "Notable Commonwealth burials in the cemetery include Private John Parr, of the 4th Battalion, Middlesex Regiment and George Lawrence Price of the Canadian 28th (Northwest) Battalion each believed to be the respective first and last Commonwealth soldiers killed in action during the First World War, as is George Ellison. Also buried in the cemetery is Maurice Dease who was the first posthumous recipient of the Victoria Cross in the war. Dease was awarded the Victoria Cross for defending Nimy Bridge and maintained firing of a machine gun until he was hit for a fifth and final time."]}, {"page": "Henry Gunther", "response": ["*John Parr, the first British Army soldier killed, 1914"]}, {"page": "George Edwin Ellison", "response": ["Ellison, aged 40 at the time of his death, is buried in the St Symphorien Military Cemetery, just southeast of Mons. Coincidentally, and in large part due to Mons being lost in the very opening stages of the war and regained at the very end (from the British perspective), his grave faces that of John Parr, the first British soldier killed during the Great War, and just a few metres away from George Lawrence Price, the Canadian soldier who was also felled near Mons at 10:58am, and was the last British Empire soldier killed in the Great War.", "Then in 2018, he and John Parr became the inspiration behind a poem, \"Goodnight Kiss\", by writer Philip Parker – written as part of a project in conjunction with the Imperial War Museums."]}, {"page": "Augustin Trébuchon", "response": ["*John Parr, the first British Army soldier killed, 1914"]}, {"page": "Viceregal eponyms in Canada", "response": ["* Parrsboro – John Parr"]}, {"page": "John Parr (disambiguation)", "response": ["John Parr (born 1952) is a British musician.", "John Parr may also refer to:", "* Sir John Parr (sheriff), sheriff of Westmoreland, c. 1462–1473, younger brother of William Parr, 1st Baron Parr of Kendal", "* John Parr (colonial governor) (1725–1791), British Army officer and Governor of Nova Scotia", "* John Parr (British Army soldier) (1898–1914), believed to have been the first British soldier killed in World War I", "* John Parr (album), 1984 debut album by John Parr"]}, {"page": "Jules-André Peugeot", "response": ["*John Parr, the first British Army soldier killed, 1914"]}, {"page": "Henry Hadley (died 1914)", "response": ["* Private John Parr, reputedly the first British soldier killed in the First World War, on 21 August 1914"]}, {"page": "August 1914", "response": ["* Reconnaissance cyclist Private John Parr (perhaps aged 15) was the first British soldier to be killed on the Western Front, at Obourg in Belgium.WWI Centenary: First casualty Private John Parr shrouded in mystery, Barnet & Whetstone Press, 4 August 2014"]}, {"page": "Albert Mayer (soldier)", "response": ["*John Parr, the first British Army soldier killed, 1914"]}, {"page": "James Bethel Gresham", "response": ["*John Parr, the first British Army soldier killed, 1914"]}, {"page": "Cyclists War Memorial", "response": ["The Cyclists War Memorial is a war memorial on the village green in Meriden, West Midlands.  The village between Coventry and Birmingham was long reputed to be at the geographical centre of England.  The national memorial was built in 1920 to commemorate cyclists killed in the First World War (it is now believed that the first British soldier killed in the war was Private John Parr, a reconnaissance cyclist with the 4th Battalion, Middlesex Regiment).  A bronze plaque was added in 1963 to commemorate cyclists killed in the Second World War."]}, {"page": "Armistice Day centenary", "response": ["On 9 November, Prime Minister Theresa May visited the Thiepval Memorial in northern France and paid respects along with French President Emmanuel Macron. She also visited the St Symphorien Military Cemetery near Mons, Belgium, and laid wreaths at the graves of the first and last British soldiers killed in the Great War, respectively John Parr and George Edwin Ellison. Inscribed within the wreaths were handwritten messages in which she thanked those who died for being \"staunch to the end\", using lines from wartime poems."]}]}}