{"wiki_id": "http://www.wikidata.org/entity/Q1701922", "itemLabel": "John Thomas Blight", "itemDescription": "Cornish archaeological artist", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Thomas_Blight", "wikipedia_page": {"main": "For the Australian poet, see John Blight.\nJohn Thomas Blight FSA (7 October 1835 – 23 January 1911) was a Cornish archaeological artist born near Redruth in Cornwall, England, UK.His father, Robert, a teacher, moved the family to Penzance and introduced his sons to the study of nature, antiquities and folk lore. John Blight was a natural draughtsman. By the age of 20, Blight had published a book on the antiquities of Penwith and a large collection of drawings.\nHis expansion of this work, in two volumes, was at first encouraged by Rev. R. S. Hawker and then the cause of a great quarrel. John Blight's second patron, James Halliwell, was similarly unhelpful, never paying him for his vast labour in illustrating Halliwell's projected edition of William Shakespeare's Works.\nIn the mid-1860s,  Blight had a mental breakdown and was incarcerated for the remainder of his life in Bodmin Mental Asylum. Blight's recording of Cornish antiquities includes many that no longer exist. His descriptions and illustrations of them provide a most valuable source for archaeologists and local historians.", "link_mentions": [{"page": "Bodmin", "response": ["* John Thomas Blight, artist"]}, {"page": "Carn Euny", "response": ["thumb|Drawing by John Thomas Blight, 1868", "The site was discovered in the early 19th Century by prospectors searching for tin deposits. Between 1863 and 1868, the antiquarian William Copeland Borlase examined the archaeological site and exposed the fogou. The graphic artist John Thomas Blight made corresponding engravings for the excavation report. During the 1920s, Dr. Favell and Canon Taylor discovered the foundation walls of the houses with courtyards. Between 1964 and 1972, extensive excavations were carried out, in which nine hut foundations were discovered. The fogou and the circular chamber were investigated and restored. Four main occupation phases between the 5th century BC and the 4th century AD were found.Carn Euny, Cornwall's Archaeological Heritage – Access to Monuments"]}, {"page": "James Halliwell-Phillipps", "response": ["In 1848 he published his Life of Shakespeare, illustrated by John Thomas Blight (1835–1911), which had several editions; in 1853–1865 a sumptuous edition, limited to 150 copies, of Shakespeare in folio, with full critical notes. After 1870 he entirely gave up textual criticism, and devoted his attention to elucidating the particulars of Shakespeare's life. He collated all the available facts and documents in relation to it, and exhausted the information to be found in local records in his Outlines of the Life of Shakespeare. He was instrumental in the purchase of New Place for the corporation of Stratford-on-Avon, and in the formation there of the Shakespeare museum."]}, {"page": "Mên-an-Tol", "response": ["In the 19th Century the local antiquary John Thomas Blight published several drawings of the site, and made the first suggestion that the stones could be the remains of a stone circle.John Thomas Blight, (1864), A week at the Land's End, 1861, Churches of West Cornwall In 1872 William Copeland Borlase, a descendant of the earlier Borlase, gave a more detailed description of the area.William Copeland Borlase, (1872), Naenia Cornubiae, Longmans"]}, {"page": "Lanyon Quoit", "response": ["An etching from 1857 by R. T. Pentreath shows the megaliths in their present arrangement.Richard Edmonds, (1862), The Land's End District and its Antiquities, Natural History, Natural Phenomena and Scenery, Smith A similar drawing appears in the 1864 book A Week at the Land's End by John Thomas Blight.John Thomas Blight, (1861), A Week at the Land's End, Longman"]}, {"page": "Category talk:English historians", "response": ["List of all pages in category English historians retrieved by PockBot.PockBot is currently Undergoing Trials. If you have any comments on its performance please leave them at Wikipedia:Bots/Requests_for_approval/PockBotArticleClass / StatusPeter Ackroydnot yet classifiedHarold Actonnot yet classifiedJohn Dalberg-Acton, 1st Baron Actonnot yet classifiedAethelweardnot yet classifiedGrace Aguilarnot yet classifiedLucy Aikinnot yet classifiedAilred of Rievaulxnot yet classifiedGeoffrey Aldermannot yet classifiedSir Archibald Alisonnot yet classifiedAndrew Allamnot yet classifiedGeorge Allan (antiquary)not yet classifiedWilliam Edward David Allennot yet classifiedAlured of Beverleynot yet classifiedJames Pettit Andrewsnot yet classifiedWilliam Archer (critic)not yet classifiedGeoffrey Ashenot yet classifiedHarold Brakspearnot yet classifiedRichard Baker (chronicler)not yet classifiedJohn Baker (legal historian)not yet classifiedAdolphus Ballardnot yet classifiedJoshua Barnesnot yet classifiedCorrelli BarnettStartHugh Bichenonot yet classifiedRobert Blake, Baron Blakenot yet classifiedWilliam Henry Blissnot yet classifiedRichard Bonneynot yet classifiedGerald Brenannot yet classifiedFrancis Brinkleynot yet classifiedOscar Browningnot yet classifiedKevin Brownlownot yet classifiedHenry Thomas Bucklenot yet classifiedJames Burneynot yet classifiedWilliam Camdennot yet classifiedJohn Capgravenot yet classifiedEdward Cardwellnot yet classifiedGeorge Carewnot yet classifiedThomas Cartenot yet classifiedPaul Cartledgenot yet classifiedChristopher Catherwoodnot yet classifiedWilliam Cavenot yet classifiedHector Munro Chadwicknot yet classifiedOwen Chadwicknot yet classifiedAllan Chapmannot yet classifiedWinston Churchill14px GAEdward Hyde, 1st Earl of Clarendonnot yet classifiedAlan Clarknot yet classifiedKenneth Clarknot yet classifiedBob Clarke (historian)not yet classifiedRobert Conquestnot yet classifiedCharles Henry Coopernot yet classifiedWilliam Coxenot yet classifiedMandell Creightonnot yet classifiedAndrew Dalbynot yet classifiedSamuel Danielnot yet classifiedBasil Davidsonnot yet classifiedGodfrey Daviesnot yet classifiedChristopher Dawsonnot yet classifiedGoldsworthy Lowes Dickinsonnot yet classifiedDavid Diringernot yet classifiedJohn Andrew Doylenot yet classifiedWilliam Dugdalenot yet classifiedAlfred Duggannot yet classifiedThomas Henry Dyernot yet classifiedBryan Edwardsnot yet classifiedLeonard Elliott Elliot-Binnsnot yet classifiedThomas Elmhamnot yet classifiedGeorge Finlaynot yet classifiedMoses I. Finleynot yet classifiedPercy Hethrington Fitzgeraldnot yet classifiedRobin Lane Foxnot yet classifiedJames Anthony Froudenot yet classifiedFrancis Aidan Cardinal Gasquetnot yet classifiedGeoffrey the Bakernot yet classifiedEdward GibbonStartMartin Gilbertnot yet classifiedRobert Gildeanot yet classifiedMary Anne Everett Greennot yet classifiedVivian H. H. Greennot yet classifiedHenry Melvill Gwatkinnot yet classifiedE. E. Y. Halesnot yet classifiedEdward Hallnot yet classifiedHenry Hallamnot yet classifiedJohn Hardyngnot yet classifiedEdward Hastednot yet classifiedPeter Hennessynot yet classifiedHenry of Huntingdonnot yet classifiedChristopher Hibbertnot yet classifiedAndrew Hignellnot yet classifiedChristopher Hill (historian)not yet classifiedHarry Hinsleynot yet classifiedPatricia Hollis, Baroness Hollis of Heighamnot yet classifiedJ. C. Holtnot yet classifiedW. G. Hoskinsnot yet classifiedWilliam Howittnot yet classifiedBettany Hughesnot yet classifiedWilliam Hutton (Birmingham historian)not yet classifiedDavid Irvingnot yet classifiedCatherine Jacksonnot yet classifiedJohn Heneage Jessenot yet classifiedJohn S. Conwaynot yet classifiedJohn of Hexhamnot yet classifiedJohn Jortinnot yet classifiedJohn Keaynot yet classifiedIan Kershawnot yet classifiedAlexander William Kinglakenot yet classifiedHenry Knightonnot yet classifiedRichard Knollesnot yet classifiedPeter Laslettnot yet classifiedBernard Lewisnot yet classifiedJohn Lingardnot yet classifiedCatherine Macaulaynot yet classifiedThomas Babington Macaulay, 1st Baron Macaulaynot yet classifiedDiarmaid MacCullochnot yet classifiedJohn Maddicottnot yet classifiedHenry James Sumner Mainenot yet classifiedFrederic William Maitlandnot yet classifiedNoel Malcolmnot yet classifiedGeorge Bruce Mallesonnot yet classifiedTheodore Augustine Mannnot yet classifiedThomas Maynot yet classifiedCharles Merivalenot yet classifiedWilliam Nassau Molesworthnot yet classifiedPhilip Morantnot yet classifiedJames Augustus Cotter Morisonnot yet classifiedLewis Bernstein Namiernot yet classifiedJohn Julius Norwichnot yet classifiedDimitri Obolenskynot yet classifiedRichard Ollardnot yet classifiedRobin Osbornenot yet classifiedHenry Nutcombe Oxenhamnot yet classifiedFrancis Palgravenot yet classifiedMatthew Parisnot yet classifiedC. Northcote Parkinsonnot yet classifiedMichael Pearsonnot yet classifiedLiza Picardnot yet classifiedCharles Plummernot yet classifiedAlbert Pollardnot yet classifiedFrederick York Powellnot yet classifiedF. M. Powickenot yet classifiedJohn Prebblenot yet classifiedH. F. M. Prescottnot yet classifiedAnthony Preston (naval historian)not yet classifiedJames Rennellnot yet classifiedRicardian (Richard III)not yet classifiedRichard of Hexhamnot yet classifiedAndrew Robertsnot yet classifiedMichael Roberts (historian)not yet classifiedJohn C. G. Röhlnot yet classifiedFrederick Rolfenot yet classifiedJohn Holland Rosenot yet classifiedEmma Georgina Rothschildnot yet classifiedMichael Ernest Sadlernot yet classifiedJohn Saltmarshnot yet classifiedDominic Sandbrooknot yet classifiedNigel Saulnot yet classifiedSimon Schamanot yet classifiedJohn Robert Seeleynot yet classifiedMartin Sharp (journalist)not yet classifiedJane Shawnot yet classifiedWalter Sichelnot yet classifiedRaleigh Ashlin Skeltonnot yet classifiedDavid Smith (historian)not yet classifiedRichard Southernnot yet classifiedGeorge Speaightnot yet classifiedJohn Spelmannot yet classifiedDavid Starkeynot yet classifiedLawrence Stonenot yet classifiedAgnes Stricklandnot yet classifiedJohn Strypenot yet classifiedWilliam Stubbsnot yet classifiedRichard Talbertnot yet classifiedWilliam Woodthorpe Tarnnot yet classifiedAlasdair and Hettie Taylernot yet classifiedA. J. P. Taylornot yet classifiedArnold Fitz Thedmarnot yet classifiedConnop Thirlwallnot yet classifiedThomas Wykesnot yet classifiedE. P. Thompsonnot yet classifiedEmma Elizabeth Thoytsnot yet classifiedH. W. Timperleynot yet classifiedHugh Tootellnot yet classifiedJoshua Toulminnot yet classifiedMichael Trappes-Lomaxnot yet classifiedG. M. Trevelyannot yet classifiedSir George Trevelyan, 2nd Baronetnot yet classifiedHugh Trevor-Roper, Baron Dacre of Glantonnot yet classifiedAndrew White Tuernot yet classifiedSharon Turnernot yet classifiedKenneth Turpinnot yet classifiedRobert Vaughannot yet classifiedOrderic Vitalisnot yet classifiedAndrew Wallace-Hadrillnot yet classifiedSpencer Walpolenot yet classifiedAdolphus William Wardnot yet classifiedVeronica Wedgwoodnot yet classifiedJohn Wheeler-Bennettnot yet classifiedThomas Abingtonnot yet classifiedArthur Agardenot yet classifiedJohn Yonge Akermannot yet classifiedAnthony Allennot yet classifiedJohn Anstisnot yet classifiedJohn Anstis, youngernot yet classifiedElias Ashmolenot yet classifiedJohn Aubreynot yet classifiedJoseph Ayloffenot yet classifiedThomas Baker (antiquarian)not yet classifiedChristopher Barkernot yet classifiedDaines Barringtonnot yet classifiedJohn Thomas Blightnot yet classifiedMatthew Bloxamnot yet classifiedWilliam Copeland Borlasenot yet classifiedJohn Brandnot yet classifiedEdward Wedlake Brayleynot yet classifiedWilliam Bright, D.D.not yet classifiedJohn Britton (antiquary)not yet classifiedGeorge Bucknot yet classifiedWilliam Bullock (collector)not yet classifiedRichard Burnnot yet classifiedRichard Carewnot yet classifiedRichard Chandlernot yet classifiedSimonds d'Ewesnot yet classifiedJohn Evans (archaeologist)not yet classifiedLewis Evans (collector)not yet classifiedFrederick William Fairholtnot yet classifiedThomas Dudley Fosbrokenot yet classifiedAugustus Wollaston Franksnot yet classifiedJohn Frerenot yet classifiedRichard Gough (antiquarian)not yet classifiedEdwin Guestnot yet classifiedJohn Guillimnot yet classifiedRobert Stephen Hawkernot yet classifiedThomas Hearnenot yet classifiedJoseph Hunternot yet classifiedKenneth Hamilton Jenkinnot yet classifiedJohn Battelynot yet classifiedWilliam Lambardenot yet classifiedAshton Levernot yet classifiedCharles Herbert Mayonot yet classifiedWilliam Nicolsonnot yet classifiedWilliam Oldysnot yet classifiedFrancis Pecknot yet classifiedMargaret Bentinck, Duchess of Portlandnot yet classifiedJames Prinsepnot yet classifiedGerald Henry Rendallnot yet classifiedJoseph Ritsonnot yet classifiedJohn Seldennot yet classifiedCharles Hamilton SmithStubHenry Spelmannot yet classifiedJohn Stownot yet classifiedWilliam Stukeleynot yet classifiedMerlin Hanbury-Tracy, 7th Baron Sudeleynot yet classifiedJohn Timbsnot yet classifiedRoger Twysdennot yet classifiedGeorge Vertuenot yet classifiedJohn Weevernot yet classifiedAnthony Woodnot yet classifiedThomas Wrightnot yet classifiedJohn Aylmer (English constitutionalist)not yet classifiedWalter Bagehotnot yet classifiedA. V. Diceynot yet classifiedGeoffrey Rudolph Eltonnot yet classifiedStephen Gardinernot yet classifiedJohn Hooker (English constitutionalist)not yet classifiedJames I of Englandnot yet classifiedErskine May, 1st Baron Farnboroughnot yet classifiedWilliam Stoughton (English constitutionalist)not yet classifiedEdward Aglionbynot yet classifiedEdward Bellasisnot yet classifiedWalter Blountnot yet classifiedJohn Brooke-Littlenot yet classifiedWilliam Brugesnot yet classifiedSamuel Egerton Brydgesnot yet classifiedBernard Burkenot yet classifiedAlfred Butlernot yet classifiedClive Cheesmannot yet classifiedPeter Wilson Coldhamnot yet classifiedRodney Dennysnot yet classifiedGilbert Dethicknot yet classifiedWilliam Dethicknot yet classifiedAlan Dickinsnot yet classifiedPatric Laurence Dickinsonnot yet classifiedArthur Charles Fox-Daviesnot yet classifiedJames Frerenot yet classifiedRichard Graham-Viviannot yet classifiedEverard Greennot yet classifiedPeter Gwynn-Jonesnot yet classifiedIsaac Heardnot yet classifiedCecil Humphery-Smithnot yet classifiedWilliam Hunt (officer of arms)not yet classifiedThomas Joseph-Watkinnot yet classifiedGregory Kingnot yet classifiedHenry Lane (officer of arms)not yet classifiedEdmund Lodgenot yet classifiedRoger Machado (officer of arms)not yet classifiedMichael Maclagannot yet classifiedHenry Robert Charles Martinnot yet classifiedRobin de la Lanne-Mirrleesnot yet classifiedNicholas Harris Nicolasnot yet classifiedPeter O'Donoghuenot yet classifiedHenry Paston-Bedingfeldnot yet classifiedJohn Philipotnot yet classifiedLeslie Pinenot yet classifiedJames Planchénot yet classifiedArchibald Russellnot yet classifiedAlfred Scott-Gattynot yet classifiedWilfrid Scott-Gilesnot yet classifiedRichard St Georgenot yet classifiedFrancis Thynnenot yet classifiedAubrey Toppinnot yet classifiedCharles Townley (officer of arms)not yet classifiedWilliam Barclay Turnbullnot yet classifiedArthur Vicarsnot yet classifiedAnthony Wagnernot yet classifiedJohn Walker (officer of arms)not yet classifiedJohn Warburton (officer of arms)not yet classifiedDavid White (officer of arms)not yet classifiedCharles Wriothesleynot yet classifiedThomas Wriothesleynot yet classifiedJohn Writhenot yet classifiedLionel Barnettnot yet classifiedRichard Francis Burtonnot yet classifiedJoseph Dacre Carlylenot yet classifiedBasil Hall Chamberlainnot yet classifiedDuncan Forbesnot yet classifiedNathaniel Brassey Halhednot yet classifiedThomas Hydenot yet classifiedWilliam Jones (philologist)not yet classifiedEdward William Lanenot yet classifiedSamuel Leenot yet classifiedWilliam Marsden (orientalist)not yet classifiedReynold A. Nicholsonnot yet classifiedE. A. Wallis Budgenot yet classifiedCharles Wilkinsnot yet classifiedEdit by PockBot (on behalf of PocklingtonDan)"]}, {"page": "St Agnes, Cornwall", "response": ["On the southwest side of the church by the churchyard gate is a granite wayside cross from the Middle Ages. The stone is the remains of a lych stone used for holding coffins.Monument No. 428373 / Wayside Cross at the Church of St Agnes. English Heritage National Monuments Record. Retrieved 19 September 2012. Arthur G. Langdon notes that John Thomas Blight recorded its former use as a lych stone. The head of the stone is incomplete; both part of one side of the head and the uppermost part of the head have been cut off."]}, {"page": "Boscawen-Un", "response": ["thumb|right|Illustration by John Thomas Blight (1864)", "William Camden described the stone circle in his Britannia (ca. 1589) thus: \"... in a place called Biscaw Woune are nineteen stones in a circle, twelve feet from each other, and in the circle stands one much larger than the rest.\" Camden does not mention the central stone leaning at an angle but in 1749 William Stukeley thought it may have been disturbed by someone looking for treasure. William Borlase mapped the circle in 1754 showing eighteen stones standing and one fallen, and at some time in the next hundred years a Cornish hedge was constructed through the circle. The hedge was first mentioned in 1850, by Richard Edmonds, and around 1862 the owner of the land, Miss Elizabeth Carne, had it removed and a new hedge built surrounding the stones. This is, thus, an early example of the preservation of an archaeological monument. In 1864 the area around the stone circle was first studied scientifically. The excavation reports show that the central stone already had its remarkable inclination. A burial mound was discovered near the stone circle, in which urns were located. From this time originates one of the first illustrations of the stone circle, which John Thomas Blight made, when he wrote a book concerning the churches of Cornwall with notes concerning ancient monuments. He also drew a plan of the burial mound and sketched one of the excavated urns.John Thomas Blight, (1865), Churches of West Cornwall with notes of antiquities of the district, Parker & Co., London"]}, {"page": "William Copeland Borlase", "response": ["A member of a wealthy Cornish family, Borlase's early life was much influenced by the archaeological work of his great-great-grandfather, Dr. William Borlase the Cornish historian. Young Borlase visited many of the ancient sites in Cornwall and in 1863 and supervised the excavations of the re-discovered prehistoric settlement and fogou at Carn Euny. Although Borlase produced many sketches he commissioned fellow Cornish antiquarian John Thomas Blight to do the engravings for the report."]}, {"page": "John Ralfs", "response": ["Ralfs aided in the botanical portions of the Guide to Ilfracombe, 1838; the Guide to Penzance, by J. S. Courtney, 1845; the Week at the Land's End, by John Thomas Blight, 1861; the Official Guide to Penzance, 1876, and he supplied the list of desmids to Jenner's Flora of Tunbridge Wells. He sent many plants for description in the second edition of English Botany by Sir James Edward Smith. Berkeley gave the name of Ralfsia to a genus of seaweeds, and Wilson named a Jungermannia in his honour. Charles Darwin in his Insectivorous Plants gracefully referred to those supplied to him by Ralfs from the neighbourhood of Penzance."]}, {"page": "List of Cornish artists, architects and craftspeople", "response": ["* John Thomas Blight (1835–1911), archaeological artist"]}, {"page": "List of fellows of the Society of Antiquaries of London", "response": ["*John Thomas Blight (1835–1911)"]}, {"page": "Blight (surname)", "response": ["* John Thomas Blight (1835–1911), Cornish archaeological artist"]}, {"page": "Mên Scryfa", "response": ["The antiquarian William Borlase described the stone in 1769: at that time it was lying prostrate on the ground. It was erected in 1825 only to be toppled again in 1849 by treasure hunters. It was lying face down when John Thomas Blight described it in 1861.John Thomas Blight, (1861), A Week at the Land's End, pages 19–21 It was however re-erected in its current position around 1862, the last word of the inscription being buried."]}]}}