{"wiki_id": "http://www.wikidata.org/entity/Q17022451", "itemLabel": "Leigh Wood", "itemDescription": "British boxer", "wikipedia_url": "https://en.wikipedia.org/wiki/Leigh_Wood_(boxer)", "wikipedia_page": {"main": "Leigh Wood (born 1 August 1988) is a British professional boxer who has held the WBA (Regular) featherweight title since July 2021. At regional level he held the British featherweight title from February to August 2021 and the Commonwealth featherweight title in 2019. As of October 2021, Wood is ranked as the world's fourth-best active featherweight by BoxRec, sixth by The Ring magazine, and seventh by the Transnational Boxing Rankings Board.\n\n", "link_mentions": [{"page": "World Boxing Association", "response": ["| Leigh Wood"]}, {"page": "Featherweight", "response": ["| Leigh Wood"]}, {"page": "List of current world boxing champions", "response": ["| style=\"text-align:center;\"|Leigh Wood 25–2 (15 KO)July 31, 2021"]}, {"page": "List of WBA world champions", "response": ["|align=left |  Leigh Wood  "]}, {"page": "List of people from Nottingham", "response": ["*(Born 1988) Leigh Wood, professional boxer, was born in Gedling. Current Commonwealth featherweight champion"]}, {"page": "List of British featherweight boxing champions", "response": ["|align=left | Leigh Wood"]}, {"page": "List of Commonwealth Boxing Council champions", "response": ["|align=left| Leigh Wood"]}, {"page": "Carl Froch vs. Lucian Bute", "response": ["*Featherweight bout  Leigh Wood vs.  Delroy Spencer"]}, {"page": "Michael Conlan (boxer)", "response": ["|style=\"text-align:left;\"| Leigh Wood"]}, {"page": "Leigh wood (Boxer)", "response": ["#REDIRECT Leigh Wood (boxer)"]}, {"page": "Leigh Wood (Boxer)", "response": ["#REDIRECT Leigh Wood (boxer)"]}, {"page": "Gavin McDonnell", "response": ["McDonnell fought Leigh Wood for the vacant British Super-Bantamweight title in Hull on 22 February 2014. McDonnell won the vacant title by TKO in the 6th round. McDonnell's first defense of the British Super-Bantamweight title would come against Josh Wale on 21 May 2014. The contest went the distance of 12 rounds and ended in a split draw, with the judges scoring the contest 115–114 Wale, 115–114 McDonnell and the final judge scoring the bout at 114–114, meaning McDonnell would hold on to the belt.", "|style=\"text-align:left;\"| Leigh Wood"]}, {"page": "Leigh Wood", "response": ["Leigh Wood may refer to:", "* Leigh Wood (footballer), British footballer", "* Leigh Wood (boxer) (born 1988), British boxer"]}, {"page": "Jazza Dickens", "response": ["In the semi-finals, Dickens battled fellow Brit Leigh Wood. Early in the fight, Dickens had swelling over his left eye, but managed to put on a very good performance throughout the fight. Dickens, who was ranked #3 at featherweight by the IBF at the time, managed to snatch a majority decision victory.", "|style=\"text-align:left;\"| Leigh Wood"]}, {"page": "David Oliver Joyce", "response": ["|align=left| Leigh Wood"]}, {"page": "List of current boxing rankings", "response": ["| Leo Santa Cruz (S) Leigh Wood (R)", "| Leigh Wood", "| Leigh Wood", "| Leigh Wood"]}, {"page": "Xu Can", "response": ["On July 6, 2021, it was announced that Xu would be defending his WBA (Regular) title against British featherweight champion Leigh Wood in Brentwood, England on July 31 as part of Matchroom's Fight Camp. Despite being a -350 favorite, Xu was outboxed during periods of the fight, and suffered an upset defeat via twelfth-round technical knockout.", "|align=left| Leigh Wood"]}, {"page": "The Golden Contract", "response": ["Competitors in the featherweight edition are; Britain's Ryan Walsh, Leigh Wood, Jazza Dickens and Tyrone McCullagh; Ireland's David Oliver Joyce; Mexico's Carlos Araujo; Spain's Carlos Ramos; and Hairon Socarras of Cuba. With Britain's Razaq Najib and Jacob Robinson in reserve. The quarter-final bouts took place on 4 October 2019 at the York Hall, London, and the semi-finals on 21 February 2020 at the same venue. The final was originally set to take place in June, however, due to the COVID-19 pandemic the date was pushed back to 30 September."]}, {"page": "Ryan Doyle (boxer)", "response": ["He came back from defeat with two PTS wins to finish 2017–Lester Cantillano in October and Rafael Castillo in December–before challenging Commonwealth featherweight champion, Reece Bellotti, on 6 June 2018 at the York Hall in London. Doyle left the champion on unsteady legs in the fifth round after landing a right hand. He followed up with a barrage of punches to send Bellotti to the canvas, with referee Howard Foster immediately stepping in to call a halt to the contest, awarding Doyle a TKO win to capture the Commonwealth title. The first defence of his newly acquired title came four months later against Jordan Gill on 27 October at the Copper Box Arena in London. Doyle was dropped to the canvas in the seventh round and after a follow up attack by Gill, the referee stepped in and stopped the contest to prevent Doyle from taking further damage, handing him the third defeat of his career. Doyle would get the chance to regain the Commonwealth title in his next fight, challenging the new champion, Leigh Wood, on 10 May 2019 at the Motorpoint Arena in Wood's home city of Nottingham. Doyle suffered his fourth defeat, being knocked to the canvas in the tenth round. Unable to get back to his feet, he was counted out while on the floor, resulting in a knockout (KO) loss.", "|align=left| Leigh Wood"]}]}}