{"wiki_id": "http://www.wikidata.org/entity/Q1702835", "itemLabel": "Jon Rollason", "itemDescription": "British actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Jon_Rollason", "wikipedia_page": {"main": "Jon Rollason (9 April 1931 – 20 February 2016) was an English television actor. He is best remembered for the role of Dr. Martin King in The Avengers. He also appeared in episodes of Doctor Who (as Harold Chorley in The Web of Fear), Z-Cars, Coronation Street, Crossroads in 1973 and Softly, Softly. He also wrote the scripts for episodes of the soap opera Crossroads.", "link_mentions": [{"page": "The Avengers (TV series)", "response": ["Production of the first series was cut short by a strike. By the time production could begin on the second series, Hendry had quit to pursue a film career. Macnee was promoted to star and Steed became the focus of the series, initially working with a rotation of three different partners. Dr Martin King (Jon Rollason), a thinly disguised recreation of the Keel character, saw action in only three episodes, which were produced from scripts written for the first series. King was intended to be a transitional character between Keel and Steed's two new female partners, but while the Dr King episodes were shot first, they were shown out of production order in the middle of the season. The character was thereafter quickly and quietly dropped.", "* Jon Rollason as Dr Martin King (Series 2)"]}, {"page": "Comedy Playhouse", "response": ["Spanner in the Works (2 June 1967) starring Jimmy Jewel, Norman Rossington, Julian Holloway, Arnold Peters, Eric Dodson, Jon Rollason, Peter Bathurst, Blake Butler and Colin Douglas"]}, {"page": "The Wednesday Play", "response": ["| Celia JohnsonPeter VaughanSydney TaflerPatsy ByrneBernard KayJon RollasonGodfrey JamesValentino Musetti"]}, {"page": "Play of the Month", "response": ["|Robert Stephens,Frank Finlay,Maurice Denham,Edward Woodward,Anthony Bate,Alan Rowe,Jon Rollason,John Alderton,John Abineri,Terence De Marney,Christopher Guard,Christopher Timothy,Trevor Martin,Brian Vaughan,Christopher Benjamin,Richard Coe,Christopher Denham,Christopher Timothy,Stuart Wilson,Andrew Johns,Duncan Preston", "|James Villiers,Lynn Redgrave,Ronald Fraser,Emrys James,Lally Bowers,Angela Baddeley,Jon Rollason,Sheila Grant,John Cannon"]}, {"page": "Tara King", "response": ["thumb|200px|Tara King (Thorson) and John Steed (Macnee)Tara King is a fictional character of British 1960s adventure television series The Avengers, played by Canadian actress Linda Thorson. Sixth partner of agent John Steed (and fourth female partner), she appeared in series six (in colour) of the series (1968–1969), playing in 33 episodes. She is Emma Peel's successor. She is also the first of John Steed's partners to be a real spy. Viewers are not given any indication whether or not she is related to Dr. Martin King — played by Jon Rollason — one of Steed's partners from series 2."]}, {"page": "List of The Avengers (TV series) episodes", "response": ["Cast: Series 2 featured Patrick Macnee as John Steed in all 26 episodes. Either Jon Rollason (as Dr. Martin King, in 3 episodes) or Julie Stevens (as Venus Smith, in 6 episodes) accompanied him as noted in the table; with all of the other 17 episodes featuring Honor Blackman (as Mrs. Cathy Gale) accompanying Steed. All episodes intact."]}, {"page": "List of The Avengers and The New Avengers cast members", "response": ["| Dr Martin King || Jon Rollason || ! align=\"center\" | 3 || ! align=\"center\" | 2", "* Jon Rollason"]}, {"page": "List of former Coronation Street characters", "response": ["|Dave Robbins || Jon Rollason || 1963–1964, 1969, 1971"]}, {"page": "List of Coronation Street characters (1963)", "response": ["Myra's father George Dickenson (Stan Jay) followed her to Weatherfield in September, and Laurie Fraser (Stanley Meadows) began a five-month stint as a new love interest for Elsie Tanner in November. Jon Rollason also joined the cast as Dave Robbins in December."]}, {"page": "Dead on Course", "response": ["* Jon Rollason as Dr. Martin King "]}, {"page": "The Sell Out (The Avengers)", "response": ["* Jon Rollason as Dr. Martin King "]}, {"page": "Mission to Montreal", "response": ["* Jon Rollason as Dr. Martin King"]}, {"page": "Thirteen Against Fate", "response": ["Principal Cast: Marius Goring, Mary Miller, Peter Halliday, David Garfield, Noel Johnson, Jon Rollason, John Forgeham"]}, {"page": "2016 in the United Kingdom", "response": ["*20 February – Jon Rollason, 84, actor (The Avengers,Coronation Street, Doctor Who)."]}, {"page": "2016 in British television", "response": ["|Jon Rollason"]}, {"page": "Deaths in February 2016", "response": ["*Jon Rollason, 84, British actor (The Avengers, Coronation Street, Doctor Who).Jon Rollason 1931–2016"]}]}}