{"wiki_id": "http://www.wikidata.org/entity/Q1707550", "itemLabel": "Joseph MacRory", "itemDescription": "Catholic cardinal", "wikipedia_url": "https://en.wikipedia.org/wiki/Joseph_MacRory", "wikipedia_page": {"main": "Joseph Cardinal MacRory (Irish: Seosamh Mac Ruairí; 19 March 1861 – 13 October 1945) was an Irish Cardinal of the Roman Catholic Church who served as Archbishop of Armagh from 1928 until his death. He was elevated to the cardinalate in 1929.      He is regarded as the leading Catholic Churchman in Ireland during the period spanning the 1916 Rising, Partition, and the Second World War.", "link_mentions": [{"page": "1945 in Ireland", "response": ["* 13 October – Joseph MacRory, Cardinal, Archbishop of Armagh and Primate of All Ireland (born 1861)."]}, {"page": "Falls Road, Belfast", "response": ["Near Beechmount is located Willowfield Park which has a number of playing fields. It is located on the site of the Willowbank Huts which in the late nineteenth century housed a small British Army barracks. When the huts were vacated they were used by various groups including Fianna Éireann. Corrigan Park which is a facility for Gaelic games is located on the Whiterock Road. A nearby smaller facility for various sporting activities is McCrory Park. It was named after Cardinal Joseph MacRory who was Bishop of Down and Connor and then Primate of All Ireland in the early part of the twentieth century.  During the 1970s it was occupied by the British Army who called it Fort Pegasus. The Whiterock Leisure Centre is located off the upper Whiterock Road. It has a community garden and allotment site. Developments include a playground and multi-use games area."]}, {"page": "Abstentionism", "response": ["After Partition, most non-abstentionist parties in the southern state did not organise at all in Northern Ireland. In early 1922, the Provisional Government of the Irish Free State was seen as representing the interests of nationalists in Northern Ireland and had a policy of not recognising the Northern Irish government. Catholic bishop Joseph MacRory (who later became Archbishop of Armagh and a Cardinal) indicated to the Provisional Government that Joe Devlin and his party members wanted to enter the new Parliament of Northern Ireland, and was worried that the policy of non-recognition would result in Northern Irish nationalists having to \"fight alone\", but his advice was ignored."]}, {"page": "Irish Brigade (Spanish Civil War)", "response": ["The Irish Catholic primate Cardinal Joseph MacRory was approached in early August 1936 by the Spanish nationalist Count Ramírez de Arellano, a Carlist from Navarre, for help for the Nationalist rebels. MacRory suggested that O'Duffy was the best man to help, as his politics were supportive and he had organised the enormous Dublin Eucharistic Congress in 1932.Othen, Christopher. Franco's International Brigades, London: Reportage Press, 2008,  pp. 111–112. In 1935 O'Duffy had formed the National Corporate Party, a small fascist group, and hoped that its involvement in Spain would increase its popular vote. He travelled to Spain later in 1936 to meet Franco and Ramírez, promising that 5,000 volunteers would follow him."]}, {"page": "John D'Alton", "response": ["On 25 April 1942, he was appointed Coadjutor bishop of Meath and Titular bishop of Binda. D'Alton received his episcopal consecration on the following 29 June from Cardinal Joseph MacRory, with Bishops Edward Mulhern and William MacNeely serving as co-consecrators, in the chapel of St. Patrick's College. He succeeded Thomas Mulvany as Bishop of Meath on 16 June 1943."]}, {"page": "Roman Catholic Diocese of Down and Connor", "response": ["* Joseph MacRory (1915–1928)"]}, {"page": "Roman Catholic Archdiocese of Armagh", "response": ["* Cardinal Joseph MacRory (1928–1945)"]}, {"page": "Joseph Mac Rory", "response": ["#REDIRECT Joseph MacRory"]}, {"page": "Denis Fahey", "response": ["Fahey's writings have been a source of controversy, both in his lifetime and since. Writing to Joseph MacRory in 1942, Archbishop John Charles McQuaid of Dublin stated that"]}, {"page": "MacRory Cup", "response": ["The competition and trophy are named after Joseph MacRory, then Bishop of Down and Connor, who donated the first cup in 1923.", "Bishop Joseph MacRory, the Bishop of Down and Connor at this time, “offered” to present a Cup for the winners of an Ulster Secondary schools’ competition. The “offer” was not honoured for another five seasons however and in the interim the matches between other seminaries and St Patrick's Armagh are recorded as “challenges” until the arrival of the first MacRory Cup in late spring 1923."]}, {"page": "San Giovanni a Porta Latina", "response": ["* Joseph MacRory 19 December 1929 – 13 October 1945"]}, {"page": "Irish Convention", "response": ["The Irish Hierarchy during the year following the Rising had been split over what kind of change in national leadership the Church ought to support. After indicating on 14 June they might decline to send a delegation, the following week in Maynooth they decided in favour of attending. The delegates chosen were the Bishops Denis Kelly, Dr. Patrick O'Donnell, Harty of Cashel and Joseph MacRory. As a first step they pledged themselves to oppose 'Partition'.Miller, David: pp. 359–61 Dr. O’Donnell was a member and treasurer of the United Irish LeagueGwynn, Stephen: p. 270"]}, {"page": "1945 in Northern Ireland", "response": ["* 13 October – Joseph MacRory, Cardinal, Archbishop of Armagh and Primate of All Ireland (born 1861)."]}, {"page": "1861 in Ireland", "response": ["*19 March – Joseph MacRory, Cardinal, Archbishop of Armagh and Primate of All Ireland (died 1945)."]}, {"page": "Cardinal electors for the 1939 papal conclave", "response": ["#Joseph MacRory, Archbishop of Armagh (archdiocese contained territory in both Ireland/Éire and Northern Ireland)"]}, {"page": "Joseph Cardinal MacRory", "response": ["#REDIRECT Joseph MacRory"]}, {"page": "Bishop of Down and Connor", "response": ["| Joseph MacRory"]}, {"page": "John Tohill", "response": ["He was succeeded by Joseph MacRory."]}, {"page": "Archbishop of Armagh", "response": ["| 60px Cardinal Joseph MacRory"]}, {"page": "Cardinals created by Pius XI", "response": ["# Joseph MacRory (1861–1945)"]}, {"page": "Patrick Lyons (bishop of Kilmore)", "response": ["He also served as Vicar General to Cardinal Joseph MacRory.", "He was appointed the Bishop of the Diocese of Kilmore by Pope Pius XI on 6 August 1937., Handbook of British Chronology, p. 437., A New History of Ireland, volume IX, p. 350. His episcopal consecration took place on 3 October 1937; the principal consecrator was Cardinal Joseph MacRory, Archbishop of Armagh, and the principal co-consecrators were Patrick MacKenna Bishop of Clogher and Edward Mulhern, Bishop of Dromore."]}]}}