{"wiki_id": "http://www.wikidata.org/entity/Q1708538", "itemLabel": "Joshua Hassan", "itemDescription": "Chief Minister of Gibraltar (1915-1997)", "wikipedia_url": "https://en.wikipedia.org/wiki/Joshua_Hassan", "wikipedia_page": {"main": "Sir Joshua Abraham Hassan  (21 August 1915 – 1 July 1997), nicknamed \"Salvador\" (Saviour), was a Gibraltarian politician, and first mayor and Chief Minister of Gibraltar, serving four terms as chief minister for a total of over 20 years. He is seen as the key figure in the civil rights movement in Gibraltar, and played a key role in the creation of the territory's institutions of self-government.", "link_mentions": [{"page": "Timeline of the history of Gibraltar", "response": ["*1942 September – A small group of Gibraltarians, who remained in the town serving in the British Army, joined a mechanic official, Albert Risso, to create 'The Gibraltarians Association', the starting point of what became the Association for the Advancement of Civil Rights (officially established in December that year), the first political party in Gibraltar. Joshua Hassan (a young lawyer then, later Sir and Chief Minister) was among the leading members of the association. The AACR was the dominant party in Gibraltar politics for the last third of the 20th century.", "*1972 – Joshua Hassan of the Association for the Advancement of Civil Rights (AACR) was returned to power. AACR rebrands as GLP/AACR (Gibraltar Labour Party / AACR) in an attempt to develop a more clearly working class image.", "*1987 2 December – A proposal for joint control of Gibraltar Airport with Spain met with widespread local opposition which was expressed in a protest march to The Convent. Chief Minister Sir Joshua Hassan resigned at the end of the year and was succeeded by Adolfo Canepa."]}, {"page": "Demographics of Gibraltar", "response": ["There is also a significant number of Moroccan Jews in Gibraltar, representing Jews of both Sephardic origin and Arabic speaking Jews of Morocco (although almost no Gibraltarian Jews today speak Arabic as a first language). Most notably the Hassan family which runs Gibraltar's largest law firm Hassans International Law FirmLegal 500, 2009 and the late Sir Joshua Hassan who served four terms as Chief Minister for a total of 17 years."]}, {"page": "Chief Minister of Gibraltar", "response": ["| 80px|Sir Joshua Hassan", "| Sir Joshua Hassan", "| 80px|Sir Joshua Hassan", "| Sir Joshua Hassan"]}, {"page": "Joe Bossano", "response": ["He has always kept a hard line stance against any sovereignty deal with Spain without the consent of the Gibraltarians. In 1980 he led a demonstrations of about 2,000 Gibraltarians protesting at the opening of negotiations between Spain and the United Kingdom agreed on the Lisbon Agreement. In 1987 he supported the position of the Government of Gibraltar and the Assembly against any agreement between Spain and the United Kingdom with regard to the joint use of the Airport of Gibraltar. On 10 November, Bossano and Joshua Hassan, then Chief Minister, led a demonstration of about 12,000 Gibraltarians, one of the largest ever held in the territory. In February 1988, Bossano and Adolfo Canepa, the leader of the Association for the Advancement of Civil Rights, stated that the Gibraltar House of Assembly would not approve the agreement reached by Spain and UK in December 1987 on the joint use of the Airport unless Spain accepted the British sovereignty over the isthmus."]}, {"page": "List of colonial governors in 1978", "response": ["** Chief Minister – Sir Joshua Hassan, Chief Minister of Gibraltar (1972–1987)"]}, {"page": "Association for the Advancement of Civil Rights", "response": ["The AACR was established in 1942 by Joshua Hassan and Albert Risso, and sought to protect the interests of families evacuated during World War II.Vincent E McHale (1983) Political parties of Europe, Greenwood Press, p323  At the time, most of the Gibraltar population had been evacuated and only a small number of Gibraltarians remained on The Rock. Consequently, the colony was crowded with British soldiers, sailors and airmen. They received wide support from the Governor, General Mason-MacFarlane (later a Labour MP in the United Kingdom), who allowed them to fulfil the representative role that the Committee of the Exchange and the Commercial Library used to fill. The Governor also left the AACR with the responsibility of managing the leave scheme that allowed the Gibraltarians who remained on the Rock to visit their families in Britain. They also took a leading role in the repatriation of the Gibraltarian evacuees."]}, {"page": "List of Sephardic Jews", "response": ["* Sir Joshua Hassan (1915-1997),independent.co.uk: Obituary: Sir Joshua Hassan Gibraltarian politician, and first Mayor and Chief Minister of Gibraltar"]}, {"page": "Polymer banknote", "response": ["* The Government of Gibraltar issued a £100 polymer banknote to commemorate Sir Joshua Hassan's 22 years as Chief Minister in the first half of 2016.Gibraltar new 100-pound polymer commemorative note to be issued in 2016  BanknoteNews.com. 21 August 2015. Retrieved on 2015-09-07."]}, {"page": "Adolfo Canepa", "response": ["Canepa was a leading member of the Association for the Advancement of Civil Rights. He was a candidate for election for the first time in the 1972 elections, winning a seat (the AACR won the majority by obtaining eight out of fifteen seats, with Joshua Hassan as Chief Minister) and thus becoming Minister for Labour and Social Security. During his time in this ministry, he led a wide-ranging review of the social security system. He later served in government as Minister for Economic Development and Trade, a ministry he held until he succeeded Hassan as Chief Minister. During Hassan's last term in government Canepa also served as Deputy Chief Minister. He was perhaps Hassan's closest political colleague and became his right-hand man at meetings in London with British Prime Minister Margaret Thatcher over the Dockyard Agreement and also accompanied him as his Deputy to meetings leading up to the Brussels Agreement in the early eighties."]}, {"page": "Integration with Britain Party", "response": ["The party was established in February 1967 by Robert Peliza, a former member of the Association for the Advancement of Civil Rights (AACR), and called full integration with the United Kingdom, including electing MPs to the British Parliament. In the 1969 elections the AACR emerged as the largest party with seven of the 15 seats in the House of Assembly, with the IWBP winning five and the Isola Group three. Joshua Hassan, the leader of the AACR was unable to get the support of the Isola Group, who supported Peliza and allowed him to form a government.Britain, Spain and Gibraltar 1945-1990: The Eternal Triangle, R. H. Haigh, D. S. Morris, Routledge, 2002, page 49", "After the defection of an Isola Group member, Peliza dissolved the House of Assembly in June 1972 and called early elections.Vincent E McHale (1983) Political parties of Europe, Greenwood Press, p325  Although the IWBP won seven seats, it was defeated by the AACR, which obtained eight seats and 52% of vote, as the Isola Group lost all three seats. The results took Joshua Hassan to power again, leaving Peliza as leader of the Opposition. In October 1972, Maurice Xiberras took over as party and Opposition leader.", "The party political stands were mainly two: the parity of wages between the labour force in Gibraltar and that in the United Kingdom and the achievement of the integration with the United Kingdom. Although the struggle on parity was successful and Gibraltar work force got the parity in July 1978, the party's main aim of closer links with the UK was dealt a severe blow when in 1975, the British Foreign Office Minister, Roy Hattersley, stated that integration was not acceptable to the British Government.Gibraltar, Maurice Harvey, Spellmount, 1996, page 164 In spite of it, during early 1976, a Gibraltarian inter-party Constitution Committee began to work on a proposal of constitutional changes that involved a further integration of Gibraltar with the United Kingdom. A delegation of the Constitution Committee, comprising Joshua Hassan and Maurice Xiberras visited London in June 1976, but were unable to convince the United Kingdom Government which, in response, issued a memorandum rejecting the proposals.Written answer of Mr. Hattersley to Mrs. Hart, HC Deb 3 August 1976 vol 916 cc726-7W."]}, {"page": "Democratic Party for a British Gibraltar", "response": ["The 1980 the party won six seats,McHale, p327 failing to replace Joshua Hassan's Association for the Advancement of Civil Rights. Following the 1984 elections, the DPBG was replaced by the Gibraltar Socialist Labour Party as the main opposition party, having failed to secure any seats.Gold, p60 It was dissolved some time later."]}, {"page": "Maurice Xiberras", "response": ["As leader of the Opposition during early 1976, he took part in a Gibraltarian inter-party Constitution Committee which began to work on a proposal of constitutional changes that involved a further integration of Gibraltar with the United Kingdom. Xiberras and the then Chief Minister, Joshua Hassan, travelled to London in June 1976 but were unable to convince the Government of the United Kingdom which, in response issued the Hattersley Memorandum which rejected the proposals. This effectively caused the IWBP to disband. Xiberras also accompanied Chief Minister Hassan, in his position as Leader of the Opposition, as part of the British delegation to Strasbourg, France for meetings with Spanish Foreign Minister Marcelino Oreja. This was to be the first official Spanish Government recognition of Gibraltar's elected representatives."]}, {"page": "Peter Isola", "response": ["Isola had an early political success in an election to the Gibraltar Legislative Council in 1956, when ten candidates contested seven seats. The winners were Joshua Hassan, Abraham Serfaty, J. E. Alcantara, and Albert Risso, all of the Association for the Advancement of Civil Rights, one Commonwealth Party candidate, Joseph Triay, and two Independents, Isola and Solomon Seruya.'Gibraltar Election' in The Times (London), issue 53643 dated 22 September 1956, p. 5", "In 1963 and 1964 he went to the United Nations together with Chief Minister Sir Joshua Hassan to oppose Spain's attempt to obtain sovereignty over Gibraltar using decolonisation as an argument to achieve its ends. Both leaders returned to a large public welcome. In 1964 Isola defended Close Association with the UK, which had been unanimously endorsed by the whole legislature as the constitutional formula for decolonisation, which was expected to be achieved by no later than 1969. In 1965, at the height of the Spain's offensive at the United Nations, and as Leader of the Opposition, Isola decided to enter into a coalition Government, serving as Deputy Chief Minister, with Joshua Hassan going on as Chief Minister. He was one of the members of the Constitutional Conference chaired by Lord shepherd in 1968 which drafted the Gibraltar Constitution of 1969.The Gibraltar Constitution – 1969 ", "Upon the creation of the Gibraltar Medallion of Honour in 2008, Peter Isola was posthumously awarded the Medallion and was therefore recorded in the Gibraltar Roll of Honour. Isola's Triumphant Return to Gibraltar in 1963 when he and Joshua Hassan were cheered by crowds in John Mackintosh Square has been recorded in a commissioned painting by Ambrose Avellano.'The Triumphal Welcome' Panorama"]}, {"page": "List of colonial governors in 1979", "response": ["** Chief Minister – Sir Joshua Hassan, Chief Minister of Gibraltar (1972–1987)"]}, {"page": "List of colonial governors in 1981", "response": ["** Chief Minister – Sir Joshua Hassan, Chief Minister of Gibraltar (1972–1987)"]}, {"page": "List of colonial governors in 1980", "response": ["** Chief Minister – Sir Joshua Hassan, Chief Minister of Gibraltar (1972–1987)"]}, {"page": "Hassans", "response": ["Hassans International Law Firm Limited is the largest law firm in Gibraltar. It has approximately 90 lawyers and was established in 1939 by Sir Joshua Hassan GBE, KCMG, LVO, GMH, QC. The firm's current senior partner is James Levy CBE QC, nephew of Sir Joshua. Former Hassans' partner Fabian Picardo QC is the current Chief Minister of Gibraltar.", "Hassans is ranked as Tier 1 by  Chambers and Partners legal directory, and is rated as tier 1 in every category by the Legal 500 directory. At present the senior partner is James Levy CBE QC (nephew of the founding partner Sir Joshua Hassan) he was awarded a lifetime achievement award in the Chambers & Partners European Awards 2008."]}, {"page": "Sir Joshua Hassan", "response": ["#REDIRECT Joshua Hassan"]}, {"page": "Gerald Lathbury", "response": ["Returning to England, he attended the Imperial Defence College as a student in 1948. He was appointed GOC of the 16th Airborne Division in 1948 and then Commandant of the Staff College, Camberley in 1951. He went on to be Commander-in-Chief (C-in-C) of East Africa Command in 1955 and, returning to England, Director General of Military Training at the War Office in 1957. He became General Officer Commanding-in-Chief (GOC-in-C) of Eastern Command in 1960 and Quartermaster-General to the Forces the following year. Finally he was appointed Governor of Gibraltar in 1964; he retired in 1969. He was described as radiating \"a serene imperturbability\" by Joshua Hassan, who was a Chief Minister of Gibraltar. Lathbury's composure was invaluable at the time as the politics meant there was doubts over the status of Gibraltar, with questions being asked at the United Nations. This made the locals nervous, especially as there was a de facto freeze on take home pay in Gibraltar.Joshua Hassan, 'Lathbury, Sir Gerald William (1906–1978)’, rev. Oxford Dictionary of National Biography, Oxford University Press, 2004 accessed 10 June 2013"]}, {"page": "The Pillars of Hercules (book)", "response": ["It concerns a year-and-a-half long expedition around the shoreline of the Mediterranean Sea from one of Hercules' Pillars (Gibraltar) to the other (Ceuta) undertaken during 1993–94. Theroux recounts his experiences from the many diverse countries that border the shores of the sea, including the war-torn Yugoslavia (this was shortly before the break-up of the former republic), the troubled Levant and the recently liberated Albania. Other countries visited include Spain (and Palma de Mallorca, France (and Corsica), Italy (and Sardinia), Slovenia, Greece, Turkey, Egypt, Tunisia, and Morocco. Many authors, politicians, topics, and works are mentioned within the work including Joshua Hassan, bullfighting, Francisco Franco, tourism, Salvador Dalí, Edward Lear, the Bible, the Odyssey, James Joyce (in Trieste), Silvio Berlusconi, Carlo Levi, pornography, the evil eye, the Croatian War of Independence, the Stari Most, bunkers, Ismail Kadare, Enver Hoxha, cruise ship culture with people from the West, cruise ship culture with people from Turkey, border crossings, Lawrence Durrell (Alexandria Quartet), Christopher W.S. Ross, Abdul Rahman Munif, American-Israeli relations, Israeli-Palestinian relations, Naguib Mahfouz, and Paul Bowles.  "]}, {"page": "Albert Risso", "response": ["By the start of World War II, Risso was a foreman mechanic and a City Council employee. When most of Gibraltar's civilian population was evacuated, Risso was one of the few Gibraltarians that remained on The Rock. In September 1942, a group of fellow Gibraltarians, clerks and workers, led by Risso came together to form the AACR, an association advocating the Gibraltarians' civil rights. Risso was president of the AACR from 1942 to 1948, when he was succeeded by former vicepresident, Joshua Hassan. In 1947, he was appointed president of the Gibraltar Confederation of Labour, a trade union created to represent the AACR's rank and file working class supporters."]}, {"page": "List of people on banknotes", "response": ["! Joshua Hassan"]}, {"page": "History of the Jews in Gibraltar", "response": ["Several Gibraltarian Jews have served in important positions in the Government there in the 20th century, particularly Sir Joshua Hassan, who served as Chief Minister of Gibraltar for two separate terms. Solomon Levy served in the ceremonial role of Mayor of Gibraltar from 2008 to 2009. The city maintains five kosher institutions, a Jewish primary school and two Jewish secondary schools. In 2004, at a celebration of the 300 years since the British takeover, the congregants at the Great Synagogue (Shaar Hashamayim) performed the anthem \"God Save the Queen\" in Hebrew, the first time that has occurred officially.\"Jews Thriving on Peace of the Rock ,\" by Hilary Leila Krieger, Jerusalem Post, 2 December 2005  Adi Schwartz, \"Gibraltar Jews feature a mix of ultra-Orthodoxy and modernism\", Haaretz, 27 September 2007"]}, {"page": "William Jackson (British Army officer)", "response": ["*From Fortress to Democracy: Political Biography of Sir Joshua Hassan (1995)"]}, {"page": "Joshua Abraham Hassan", "response": ["#REDIRECT Joshua Hassan"]}, {"page": "Gibraltar Constitution Order 1969", "response": ["The constitution was the outcome of the Constitutional Conference chaired by Malcolm Shepherd, 2nd Baron Shepherd which lasted from 16 July to 24 July 1968. The Gibraltarian members of the Constitutional Conference were: Joshua Hassan, Aurelio Montegriffo and Abraham Serfaty for the Association for the Advancement of Civil Rights; Robert Peliza, Maurice Xiberras and legal advisor Sir Frederick Bennet for the Integration With Britain Party; and Peter Isola.The Gibraltar Constitution - 1969"]}, {"page": "List of Gibraltarians", "response": ["* Sir Joshua Hassan GBE KCMG LVO (1915–1997), first Chief Minister of Gibraltar"]}, {"page": "Gibraltarians", "response": ["File:Joshua Hassan.jpg|Joshua Hassan"]}, {"page": "Hassan (surname)", "response": ["* In Israel and among Sephardi and Mizrahi Jews, the surname Hassan () is derived as a spelling variant of Hazzan (\"cantor\")What Does Your Jewish Name Mean? - \"Cantor: Cantor, Chazzan, Hassan, Singer, Zinger, Schulzinger, Meshoyrer, Soloway or Soloveitchik\" and therefore most likely represents an alteration of this term through Judaeo-Spanish or Judeo-Arabic.independent.co.uk: Obituary: Sir Joshua Hassanjpost.com: French Jews reclaim 'Jewish' namesavotaynu.com: Guidebook for Sephardic and Oriental Genealogical Sources in Israelsephardicgen.com: Sephardic Surnamesitalian-family-history.com: Jewish Genealogy in ItalyTemple Israel , Tulsa Hassan is normally an Arab first or last name; but, in the Jewish Sephardic – Mizrahi traditions, it is a Jewish surname. The Jewish surname Hassan or Hasson (see also  Hassoun), appear to have most likely originated from Spain, from where the Jewish family has initially settled in MoroccoHassan and in Livorno, Italy, following 1492 expulsion of the Jews from Spain, and  afterwards following the 16th century has spread throughout the Ottoman Empire (notably to Thessaloniki, Greece; Istanbul, Turkey; in 1592 in Sidon, Lebanon; Damascus, Syria; Constantine, Algeria and Tunis, Tunisia).", "* Joshua Hassan (1915–1997), Gibraltarian politician of Jewish descent – chief minister for 17 years"]}, {"page": "List of Knights Grand Cross of the Order of the British Empire", "response": ["*1987: Faisal Alhegelan (honorary), Joshua Hassan, Kenneth Newman, The Lord Plowden, Greville Spratt, "]}, {"page": "Mayor of Gibraltar", "response": ["Since its creation in 1921, the city council had a chairman. In 1955, upon request of the members of the city council, the post was renamed to mayor, and therefore, the mayor of Gibraltar was chosen from among the members of the council. Joshua Hassan, the chairman of the city council at the time become the first mayor of Gibraltar.", "|The Hon. Sir Joshua Hassan CBE MVO QC JP"]}, {"page": "List of people on the postage stamps of Gibraltar", "response": ["*Sir Joshua Hassan (1997)"]}, {"page": "John Mackintosh Square", "response": ["===Intervention of Joshua Hassan and Peter Isola before the United Nations===", "In September 1963, Chief Minister Joshua Hassan, and Leader of the Opposition Peter Isola, travelled to New York City to intervene before the United Nations Decolonisation Committee as \"petitioners\" from Gibraltar. Crowds filled John Mackintosh Square as they gathered to wish them well and then again to welcome them back. Their homecoming took place on 24 September 1963 and was commemorated in the painting The Triumphal Welcome depicting the scene at John Mackintosh Square, authored by local artist Ambrose Avellano.'The Triumphal Welcome' , 3 September 2008, Panorama"]}, {"page": "Dorothy Ellicott", "response": ["After the war she became involved in politics, initially as a member of the Association for the Advancement of Civil Rights (AACR) (Joshua Hassan's party, of which her husband was also a member; he was elected to the City Council in the first elections after the war, in 1945). In 1947 she was awarded the MBE. She was the first woman to become a member of the City Council, in December 1947, within the candidature of the AACR (this being the first election in which women were allowed to stand and vote), and remained so as an elected member for nine years. In the early 1950s, Ellicott left the AACR. In 1959, she also became the first woman to be elected to the Legislative Council, this time as an independent, remaining there for five years. She was also Chair of the Gibraltar Museum Committee."]}]}}