{"wiki_id": "http://www.wikidata.org/entity/Q1701943", "itemLabel": "John Tilbury", "itemDescription": "English pianist", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Tilbury", "wikipedia_page": {"main": "John Tilbury (born 1 February 1936) is a British pianist. He is considered one of the foremost interpreters of Morton Feldman's music, and since 1980 has been a member of the free improvisation group AMM.", "link_mentions": [{"page": "Prepared piano", "response": ["* Cor Fuhler pioneered many inside piano techniques during the 1980s and recorded his first prepared piano solo album 7CC IN IO on GeestGronden in 1995; recorded The Hands of Caravaggio with John Tilbury and M.I.M.E.O. on the USA label Erstwhile Records; and in 2007 he released Stengam on the French label Potlatch."]}, {"page": "Cornelius Cardew", "response": ["Musician John Tilbury, in his book Cornelius Cardew—A Life Unfinished suggests that the possibility that Cardew was killed because of his prominent Marxist-Leninist involvement \"cannot be ruled out\".Tilbury 2008, 1022. Tilbury quotes a friend of Cardew's, John Maharg; \"MI5 are quite ruthless; people don't realise it. And they kill pre-emptively\". However, Howard Skempton recalled the treacherous weather conditions prevailing at the time of Cardew's death and suggests that Cardew could have been walking in the road to avoid the icy pavements and might have been hit by a drunken driver who drove off to avoid arrest.Harris, The Legacy of Cornelius Cardew, p..121", "* Cardew, Cornelius. Cornelius Cardew: A Reader, edited by Edwin Prévost, introduction by Michael Parsons. Harlow, Essex: Copula, 2006. . (A collection of Cornelius Cardew's published writings together with commentaries and responses from Richard Barrett, Christopher Fox, Brian Dennis, Anton Lukoszevieze, Michael Nyman, Eddie Prévost, David Ryan, Howard Skempton, Dave Smith, John Tilbury and Christian Wolff.)", "*Cornelius Cardew on Matchless Recordings Includes the Cornelius Cardew Reader, and recordings with AMM and of his piano works by John Tilbury", "*\"Cornelius Cardew: Works 1960–70\" Recorded by John Tilbury, Michael Francis Duch and Rhodri Davies"]}, {"page": "David Sylvian", "response": ["A new solo album entitled Manafon was released on 14 September 2009 in two editions – a regular CD/digipak edition and a twin boxset deluxe edition with two books that include the CD and a DVD featuring the film 'Amplified Gesture'. Manafon featured contributions from leading figures in electroacoustic improvisation such as saxophonist Evan Parker, multi-instrumentalist Otomo Yoshihide, laptop + guitarist Christian Fennesz, Polwechsel's double bassist Werner Dafeldecker and cellist Michael Moser, sinewaves specialist Sachiko M and AMM alumni guitarist Keith Rowe, percussionist Eddie Prévost and pianist John Tilbury. In 2010, Sylvian talked about Manafon, and said:\"What happened with Manafon was that the work abandoned me. As I was writing and developing the material, the spirit holding all these disparate elements together just left me. I sat stunned for a moment and then realised: It's over; this is as far as it goes…In a sense, I'd been steadily working my way toward Manafon since I was a young man listening to Stockhausen and dabbling in deconstructing the pop song. Having said that, I don't think we only develop as artists practising in our chosen fields. For me, that meant an exploration of intuitive states via meditation and other related disciplines which, the more I witnessed free-improv players at work, appeared to be crucially important to enable a being there in the moment, a sustained alertness and receptivity.\"", "Also in 2011, Sylvian acted as the artist in residence at the Punkt Festival in Norway. In addition to curating the events of the festival, Sylvian performed both compositions from the Holger Czukay-collaborated album Plight & Premonition, backed by John Tilbury, Jan Bang, Phillip Jeck, Eivind Aarset, Erik Honoré, and Arve Henriksen.  The positive reception led to the decision to tour throughout Europe in 2012.  The Implausible Beauty tour was due to feature a line-up of musicians including Jan Bang, guitarist Eivind Aarset, pianist Sebastian Lexer, cellist Hildur Gudnadottir and trumpeter Gunnar Halle. The tour was cancelled in late January 2012 due to a back injury Sylvian sustained.", "In 2014, Sylvian released There's a Light That Enters Houses with No Other House in Sight, a long-form composition with contributions from Christian Fennesz and John Tilbury and featuring spoken word by American Pulitzer Prize winning poet Franz Wright of excerpts from Wright's own Kindertotenwald."]}, {"page": "AMM (group)", "response": ["Pianist John Tilbury – previously an occasional AMM collaborator – joined in about 1980. This version of AMM generally explored quieter, more meditative sounds. Gare occasionally rejoined the group in this era; cellist Rohan de Saram was also an occasional addition.", "In 2010 the core duo of Eddie Prévost and John Tilbury along with John Butcher, Christian Wolff and Ute Kangiesser released a CD called \"Sounding Music\" (the first simply tagged as AMM after 2005's Norwich) containing the concert performed at \"Freedom of the City\" festival, Conway Hall, London on 3 May 2009.", "*John Tilbury – piano (1980–present)", "*John Tilbury: Cornelius Cardew: a life unfinished chapter 7 AMM 1965 – 71, Copula 2008: "]}, {"page": "Krapp's Last Tape", "response": ["There have been several musical adaptations of Krapp's Last Tape, most notably the opera Krapp, ou, La dernière bande by composer Marcel Mihalovici. American composer Earl Kim alludes to the work within his Gooseberries, she said (1967), part of the four-part cycle Exercises en Route. The Hungarian composer Gyula Csapó has created the work Krapp's Last Tape –- after Samuel Beckett (1975) loosely inspired by Beckett's play.\"Gyula Csapó\" , The Modern Word, accessed 22 September 2007. This theatrical work is for a \"violinist-actor,\" a tape recorder, four spotlights and a sine wave generator.Krapp's Last Tape –after Samuel Beckett  (1975), The Modern Word, accessed 22 September 2007. In 1999, the English experimental composer, Michael Parsons, adapted Krapp's Last Tape for piano, two pre-recorded pianos, and voice on tape. The piece, specifically written for John Tilbury, was called Krapp Music."]}, {"page": "Wadada Leo Smith", "response": ["* 2011: Nessuno with Pauline Oliveros Roscoe Mitchell John Tilbury (IDA 035 – 2016)"]}, {"page": "Keith Rowe", "response": ["Rowe has worked with Oren Ambarchi, Burkhard Beins, Cornelius Cardew, Christian Fennesz, Kurt Liedwart, Jeffrey Morgan, Toshimaru Nakamura, Evan Parker, Michael Pisaro, Peter Rehberg, Sachiko M, Howard Skempton, Taku Sugimoto, David Sylvian, John Tilbury, Christian Wolff, and Otomo Yoshihide."]}, {"page": "M.I.M.E.O.", "response": ["Pianist John Tilbury joined the group to record the album The Hands of Caravaggio (2001, Erstwhile). Critic Brian Olewnick describes the album as \"A staggering achievement, one is tempted to call The Hands of Caravaggio the first great piano concerto of the 21st century.\""]}, {"page": "Gert-Jan Prins", "response": ["* 2002 mimeo / John Tilbury the hands of caravaggio cd Erstwhile Records"]}, {"page": "Tom Phillips (artist)", "response": ["Phillips became a teacher at Ipswich School of Art, where one of his students was Brian Eno, who would become a lifelong friend. He soon moved to teach Liberal Studies at Walthamstow Polytechnic where he met the pianist John Tilbury and participated in improvisation concerts at several polytechnics. His first musical composition was Four Pieces for Tilbury."]}, {"page": "List of free improvising musicians and groups", "response": ["* John Tilbury – piano"]}, {"page": "Mark Boyle (artist)", "response": ["Amongst others he collaborated with George Brecht, Peter Schmidt (artist), Cornelius Cardew, and John Tilbury."]}, {"page": "Howard Skempton", "response": ["Through the Scratch Orchestra Skempton met numerous composers and performers, including Christopher Hobbs, John White and various Systems artists, and the pianist John Tilbury. However, tensions arose during the politicising of the Scratch Orchestra in the early 1970s, when Cardew and a number of other important members pushed the ensemble in a Maoist direction. Skempton, Hobbs, Parsons, White and many others refused to be associated with this political line, and the break-up of the Orchestra was accompanied by (in Parsons's words) \"a split between its 'political' and 'experimental' factions\".Michael Parsons. Note to Piece For Cello and Accordion. From LMJ 11 CD COMPANION, Not Necessarily \"English Music\" Contributors' Notes.", "In 1974 Skempton and Michael Parsons formed a duo to perform their own works. The 1980s saw an increase of interest in Skempton's music, which led to more commissions and permitted him to compose more for larger forces.Parsons 1987, 16. Lento, an orchestral work composed in late 1991, became one of Skempton's most widely recognised pieces. In the 1990s important recordings of his works started appearing, such as a disc of piano music recorded by his old friend and former Scratch Orchestra colleague John Tilbury, released on Sony Classical in 1996,MacDonald 1996. and Surface Tension, a recording of miscellaneous works released on Mode Records.", "* MacDonald, Calum. 1996. \"Skempton: Well, Well, Cornelius (and 43 other Piano Pieces). John Tilbury (pno). Sony SK 66482 / Sorabji: Gulistan. Charles Hopkins (pno). Altarus AIR-CD-9036 / Simpson: Piano Sonata; Variations and Finale on a Theme of Haydn; Michael Tippett, His Mystery; Variations and Finale on a Theme of Beethoven. Raymond Clarke (pno). Hyperion CDA66827 / Schnabel: Piano Piece in 7 Movements; Piano Sonata. Benedikt Kohlen (pno). Auvidis Montaigne M0782053\". Tempo, new series, no. 197 (July): 47–49."]}, {"page": "Tilbury (disambiguation)", "response": ["*John Tilbury, (born 1936), British pianist"]}, {"page": "Martin Brandlmayr", "response": ["Among others, Brandlmayr has recorded or performed with John Tilbury, Fennesz, Chad Taylor, and Otomo Yoshihide."]}, {"page": "Nurse with Wound list", "response": ["*AMM, British improv group. Currently the core members are just Eddie Prévost and John Tilbury, but has in the past included Keith Rowe, Lou Gare, Cornelius Cardew, Lawrence Sheaff, and Christopher Hobbs. Has worked with the MEV (see below)."]}, {"page": "Laurence Crane", "response": ["He has written a considerable amount of piano music. Pianists who have performed his work include Michael Finnissy, Thalia Myers and John Tilbury."]}, {"page": "Huw Warren", "response": ["Huw Warren was born in Swansea, West Glamorgan and grew up on the Gower peninsula. He attended Gowerton Comprehensive School from 1973 until 1980. Warren's early musical experiences were as a cellist in the West Glamorgan Youth Orchestra and then as an organist in the working men's clubs of South Wales. He left Wales in 1980 to study at Goldsmiths, University of London, where he studied piano with experimental pianist John Tilbury and became involved in both the jazz and avant-garde scenes. Warren studied at the Guildhall School of Music and Drama from 1983 until 1984 before starting a freelance career. In 1993, Warren relocated to Snowdonia, North Wales, where he lives to this day."]}, {"page": "Dave Smith (composer)", "response": ["Up to 1977 his music was largely minimalist (process music or systems music).  His style quickly developed into a highly eclectic pool of ideas ranging musically from the abstract to the markedly referential and which on occasion is informed by a political consciousness and commitment reminiscent of the later Cardew. His acknowledged influences range from Alkan, Ives and Szymanowski to Albanian folk music, Duke Ellington, Tom Dissevelt and those with whom he has worked. The range of ideas is most clearly chronicled in a series of recital-length solo Piano Concerts, works which encompass an entire concert with varieties of styles. Many of his piano works have been encouraged and performed by John Tilbury."]}, {"page": "Hat Hut Records", "response": ["| hatOLOGY 672 || Polwechsel & John Tilbury || Field ||"]}, {"page": "Rough for Radio I", "response": ["The work has also been produced on compact disc by the British pianist John Tilbury who also speaks the part of \"He\". It was recorded at Trinity College of Music and Electronic Music Studio, Goldsmiths College, London, in 2004/5 along with a version of Cascando, the music composed and performed by John Tilbury with electronic modulations by Sebastian Lexer."]}, {"page": "Cascando", "response": ["John Tilbury (piano) / Sebastian Lexer (electronics): Cascando, 2001 "]}, {"page": "Eddie Prévost", "response": ["AMM was co-founded in 1965 by Lou Gare, Eddie Prévost and Keith Rowe. They were shortly joined by Lawrence Sheaff. All had a jazz background. They were, however, soon augmented by composer Cornelius Cardew. Thereafter, Cardew, Gare, Prévost and Rowe remained as basis of the ensemble until the group fractured in 1972. Other more formally trained musicians were to enter the ranks of AMM after Cardew's departure. Those to make significant contributions were cellist Rohan de Saram and, in particular, pianist John Tilbury. The latter was a friend and early associate of Cardew and later became his biographer.", "When, in the early 1970s, Cardew and Rowe began to devote their time and energy to espousing the political doctrine of an English Maoist party, a fracture occurred in the ensemble leaving the rump of Lou Gare and Eddie Prévost, who continued in a duo form making various concerts and festival appearances and leaving a legacy of two recordings. At the end of the decade a rapprochement was attempted and for a short while the quartet began playing together again. It did not last. Lou Gare departed and moved from London to Devon. While Cardew's commitment to politics made his complete withdrawal inevitable. It was during this period Prévost took an Honours Degree at Hatfield Polytechnic, exploring and developing his interests in history (especially East Asian) and philosophy. Musically, this left Rowe and Prévost playing together. Their recording for German ECM label \"It had been an ordinary enough day in Pueblo, Colorado\" is the single example of their duet period. By the late 1970s a reawakened association with John Tilbury was cemented into his permanent place in AMM. He is featured on all subsequent AMM performances and recordings (as is Prévost). In 2002 a more lasting schism occurred leading to Rowe departing from AMM and leaving Tilbury to continue with Prévost.", "Cardew's 'Treatise' etc. Cardew's introduction to AMM in 1966 owes something to his search for musicians to perform his (then unfinished)193 pages long graphic score, 'Treatise'. The AMM musicians (at the time Lou Gare, Eddie Prévost, Keith Rowe and Lawrence Sheaff) seemed perfect candidates to embrace this bold work of imagination. And, with others (including later AMM member John Tilbury) all participated in the premier performance at the Commonwealth Institute on 8 April 1966 (check year!). But the initial impact of Cardew's induction into AMM was to bring a halt to his compositional aspirations. However, over the years since, AMM has had a long relationship with particular indeterminate and experimental works particularly those of Cardew – especially after his death in 1983. Most prominently 'Treatise'. Other favourites were 'Solo with Accompaniment',  'Autumn '60', Schooltime Compositions' and the text piece Cardew wrote particularly for AMM, 'The Tiger's Mind.' These pieces (which for a long time had been neglected within 'new' musical schedules), and occasionally others by Christian Wolff and John Cage, were sometimes played in conjunction with an AMM improvisation. Some concert promoters were, it seems, more interested in these pieces being played than the principal musical output of AMM. Hence, Prévost's ambivalence about the inclusion of such material in concert programmes. The creative search for primary performance material was diverted, in such works, in keeping with the demands of the notation or compositional scheme. This inevitably prevented the musician from (to use Cardew's own words) \"being at the heart of the experiment\". (Cardew, 'Towards an Ethic of Improvisation; CC R p. 127).", "In 1995, following the same principal for internal control over the output, production and dissemination of material, the publishing imprint Copula was inaugurated. The first publication was Prevost's No Sound is Innocent. Later followed by Minute Particulars in 2004. 2006 saw the publication of Cornelius Cardew: A Reader (edited by Prévost) which was a collection of Cardew's published writings accompanied by commentaries by a number of musicians associated and inspired by Cardew. This volume was an essential companion to John Tilbury's comprehensive biography Cornelius Cardew: a life unfinished which was also published by Copula in 2008. The most recent book to appear on this imprint is Prévost's The First Concert: An Adaptive Appraisal of a Meta Music (2011).", "With John Tilbury", "* John Tilbury Plays Samuel Beckett (Matchless, 2005)", "* Amplified Gesture - A film by Phil Hopkins featuring John Butcher, Christian Fennez, Sachiko M, Toshimaru Nakamura, Evan Parker, Eddie Prévost, Polwiechsel, Keith Rowe, John Tilbury, Otomo Yosihide Souns ssdvd01, 2011"]}, {"page": "Burkhard Beins", "response": ["Since the late 1980s he has appeared on international festivals, concerts and tours throughout Europe and overseas. He is a member of several ensembles like Perlonex, Activity Center, Polwechsel, Trio Sowari, Phosphor, The Sealed Knot, BBB and also works with Keith Rowe, Sven-Åke Johansson, John Tilbury, Charlemagne Palestine and many others. At the same time Beins is also active in the area of sound installation.", "* Polwechsel & John Tilbury: Field (Hat Hut, CD 2009)"]}, {"page": "Marcus Schmickler", "response": ["** Marcus Schmickler John Tilbury \"Timekeepers\", A-Musik, 2015", "** Marcus Schmickler/John Tilbury Variety, a-Musik, 2005"]}, {"page": "Kim Cascone", "response": ["on various labels as well as his own label, anechoic (named after his last Heavenly Music Corporation release), which he established in 1996. Cascone has released more than 50 albums of electronic music since 1984 and has recorded/performed with Merzbow, Keith Rowe, Tony Conrad, Scanner, John Tilbury, Domenico Sciajno and Pauline Oliveros among others."]}, {"page": "Polwechsel", "response": ["* (2009) Field (with John Tilbury) – HatOLOGY"]}, {"page": "Tania Chen", "response": ["She has also collaborated with musicians including improviser and composer Steve Beresford (with whom she recorded 'Ointment'), composer Andrew Poppy (concert), pianist John Tilbury, bassist John Edwards, drummer Mark Sanders and harpist Rhodri Davies. She has also collaborated with the film-maker Jayne Parker.", "Originally trained as a classical pianist, she studied (amongst others) with Stephen Coombs, Professor at the Guildhall School of Music and Drama, as well as taking masterclasses with Artur Pizarro. Her piano career took a turn towards contemporary music in the late 1990s, when she studied with noted pianist John Tilbury, and became noted for her performances of composers such as  John Cage and Morton Feldman, amongst others.  She was subsequently awarded an M(Mus) at Goldsmiths College, University of London, with distinction. During this time she also took part in a masterclass with Mstislav Rostropovich(link)."]}, {"page": "Moishe's Bagel", "response": ["*Phil Alexander (piano) - studied with John Tilbury at Goldsmiths College. He currently leads his own jazz tango trio and plays piano with Salsa Celtica. His compositions have featured on London's South Bank and at Edinburgh's Queen's Hall."]}, {"page": "Aleksander Kolkowski", "response": ["Kolkowski studied music at the University of London, Goldsmiths College, violin with Clarence Myerscough at the Royal Academy of Music. Taught by John Tilbury, Hugh Davies and in 1982 participated in seminars and performances directed by John Cage."]}, {"page": "Experimental music", "response": ["Composer and critic Michael Nyman starts from Cage's definition, and develops the term \"experimental\" also to describe the work of other American composers (Christian Wolff, Earle Brown, Meredith Monk, Malcolm Goldstein, Morton Feldman, Terry Riley, La Monte Young, Philip Glass, Steve Reich, etc.), as well as composers such as Gavin Bryars, John Cale, Toshi Ichiyanagi, Cornelius Cardew, John Tilbury, Frederic Rzewski, and Keith Rowe. Nyman opposes experimental music to the European avant-garde of the time (Boulez, Kagel, Xenakis, Birtwistle, Berio, Stockhausen, and Bussotti), for whom \"The identity of a composition is of paramount importance\". The word \"experimental\" in the former cases \"is apt, providing it is understood not as descriptive of an act to be later judged in terms of success or failure, but simply as of an act the outcome of which is unknown\"."]}, {"page": "Sonatas and Interludes", "response": ["* John Tilbury – 1974, Explore Records EXP0004"]}, {"page": "Tank Battles", "response": ["*John Tilbury – keyboards"]}, {"page": "Zbigniew Drzewiecki", "response": ["*John Tilbury"]}, {"page": "Howard Riley (musician)", "response": ["* 2003 Another Part of the Story with Keith Tippett, John Tilbury (Emanem)"]}, {"page": "Piano and String Quartet (Feldman)", "response": ["John Tilbury and the Smith Quartet played the piece at the 2006 Huddersfield Contemporary Music Festival on November 26. Selected live recordings from those performances were released in three volumes by Matchless Recordings in audio-only DVD format, which allowed for uninterrupted playback of the long recordings on a single disc. Just shy of 90 minutes, it is the longest recorded performance of the piece. The Smith Quartet played without vibrato and loosened their bows to enable longer, softer tones.; ."]}, {"page": "Manafon (album)", "response": ["* John Tilbury – piano (2–4, 6–8)"]}, {"page": "Maya Dunietz", "response": ["Maya Dunietz (; April 16, 1981 in Tel Aviv), is an international musician and artist, combining a solo career with collaborations with renowned musicians: Emahoy Tsegué-Maryam Guèbrou, Roscoe Mitchell, John Tilbury, Habiluim, and many others. Her works are exhibited in venues such as Centre Pompidou Paris, Athens Onassis Center, Frac Paca, and CCA Tel Aviv.", "In 2004 Dunietz began a new musical practice of free improvisation, deeply influenced by the values of this musical practice. She approached clarinet player, painter, and poet Harold Rubin and began a collaboration that lasted until his passing, in 2020. The duo’s home venue was at The Left Bank in Tel Aviv, where they played hundreds of improv concerts collaborating with numerous local and international artists. The duo also performed at the FMP Total Music Meeting in Berlin. Dunietz later recorded two albums of free improvisation music - one in trio with Yoni Silver and Harold Rubin (Mono Musical Suite for Three Manic Musicians), and one with John Edwards and Steve Noble (Cousin It). Dunietz continues to play free improvisation concerts worldwide with various collaborators. Previous collaborations include: Evan Parker, Eddie Prévost, John Tilbury, Alvin Curran, Ghedalia Tazartes, Lori Goldstone, Fritz Welch, Michelle Guay, Okkyung Lee, Tom White, Nino Biton and The Magreb Orchestra, Jewlia Eisenberg, Shahad Ismaily, Toychestra USA, David Moss, Bari Saharof, Rami Fortis, David Broza, Boom Pam, Steve Noble, Yedo Gibson, Marcio Mattos, Yuka Yamamoto, Shanir Ezra Blumenkranz, Mike Patton, John Butcher, Ilan Volkov, Aaron Dugan, Matisyahu, Assif Zahar, Ravid Kahalani, Desert Blues, Guillaume Villtard, Neil Davidson, Johnny Chang, Ana-Maria Avram, Hildur Gudnsadottir, Stephen O'Malley, Iancu Dumitrescu, Oren Ambarchi, Daniel Higgs, Steve Beresford, Veryan Weston, Tania Chen and more.", "As pianist and singer mostly, Dunietz has performed a wide repertoire, including world premieres of pieces by Erel Paz, Kiki Keren Hoss, Keren Rosenbaum, Dieter Schnebel - notably his song cycle Liebe - Leid (2013) which was composed for her, Alvin Curran and Ivana Kiss. Performed repertoire also includes collaborations such as duo with pianist John Tilbury (Compositions for two pianos by Morton Feldman, King’s Place, London 2012), The 21st Century Ensemble and Noa Frenkel (N’shima by Ianis Xenakis, Hateiva, Jaffa 2014), Frank Denier and the Iceland symphonic orchestra conducted by Ilan Volkov (Music for 13 by John Cage, Tectonics festival, 2012) and more."]}, {"page": "Plus-Minus (Stockhausen)", "response": ["* Parsons, Michael, and John Tilbury. 1969. \"The Contemporary Pianist: John Tilbury Talks to Michael Parsons\". The Musical Times (February): 150–152."]}, {"page": "Rhodri Davies (musician)", "response": ["*\"\"Cornelius Cardew: Works 1960–70\" (2010) with John Tilbury, Michael Francis Duch and Rhodri Davies"]}, {"page": "The Sinking of the Titanic (Bryars)", "response": ["Bryars frequently participated in the Music Now series of concerts organised by Victor Schonfield in London in the early 1970s, usually with pianist John Tilbury. Schonfield was keen to showcase Bryars' music and in December 1972 organised a concert at London's Queen Elizabeth Hall. The Sinking Of The Titanic would be the centrepiece of the concert. Bryars created a more traditional score for the work and used the Episcopal hymn Autumn as the basis of the work, based on the testimony of wireless operator Harold Bride, although there was some discussion that it may have been actually Aughton that was heard. Bryars incorporated fragments of Aughton and other tunes reportedly heard on the ship. The work has been performed several times in subsequent years, including a performance in San Francisco conducted by John Adams. Other performances have included New York's Guggenheim Museum, a Belgian art-nouveau swimming pool and a Huddersfield nightclub."]}, {"page": "Irma (opera)", "response": ["*John Tilbury – piano, radio"]}]}}