{"wiki_id": "http://www.wikidata.org/entity/Q17046220", "itemLabel": "Charles Robert Drysdale", "itemDescription": "British physician and public health scientist", "wikipedia_url": "https://en.wikipedia.org/wiki/Charles_Robert_Drysdale", "wikipedia_page": {"main": "Charles Robert Drysdale (1829 – 2 December 1907) was an English engineer, physician, public health scientist, and supporter of birth control. He was the first President of the Malthusian League and he published books on a variety of topics including population control, syphilis, the evils of prostitution and the dangers of tobacco smoking.", "link_mentions": [{"page": "List of names in A Biographical Dictionary of Modern Rationalists", "response": ["* Charles Robert Drysdale"]}, {"page": "1907 in the United Kingdom", "response": ["* 2 December – Charles Robert Drysdale, birth control advocate (born c. 1829)"]}, {"page": "Telford Medal", "response": ["| Charles Robert Drysdale || || 'On Steep Gradients of Railways and the Locomotives employed'"]}, {"page": "Malthusian League", "response": ["The first president was Charles Robert Drysdale, who was succeeded by his free union partner Alice Vickery. The league initially restricted itself primarily to an \"educative role\" which emphasised the importance of Malthus' economic arguments rather than practical information about birth control. The league had an increasingly socially and economically conservative tone as the 19th century wore on. Thus some earlier agreement between Malthusians and social reformers was replaced by mutual distrust. The league believed that the sole cause of poverty was an excess of births, and therefore opposed socialism, considered strikes and reforms of labour laws to be \"useless.\" League members were primarily middle class and did not make many serious efforts to communicate with the working class aside from some debates with socialists during the 1880s. Although the league doctrine as a whole was hostile to socialism, some members were indeed socialists who were sympathetic to arguments in favour of birth control. The league also maintained some overlap with the women's rights movement, which was concerned with birth control. The League began plans for a birth control clinic in 1917 but these stalled"]}, {"page": "Alice Vickery", "response": ["Alice Vickery (also known as A. Vickery Drysdale and A. Drysdale Vickery; 1844 – 12 January 1929) was an English physician, campaigner for women's rights, and the first British woman to qualify as a chemist and pharmacist. She and her life partner, Charles Robert Drysdale, also a physician, actively supported a number of causes, including free love, birth control, and destigmatisation of illegitimacy.", "Vickery was born in Devon in 1844 to a piano maker and organ builder. By 1861, she had moved to South London. Vickery began her medical career at the Ladies' Medical College in 1869. There she met the lecturer Charles Robert Drysdale and started a relationship with him. They never married, as they both agreed with his brother George (also a neo-Malthusian physician) that marriage was \"legal prostitution\". The society, however, generally presumed that the pair were married; had their contemporaries known that they were in a free union, their careers likely would have suffered. Vickery sometimes added Drysdale's name to her own, referring to herself both as \"Dr. Vickery Drysdale\" and as \"Dr. Drysdale Vickery\".", "Vickery moved to Brighton in 1923 to be near her elder son. She regularly addressed meetings of the local branch of the Women's Freedom League. She died of pneumonia on 12 January 1929, a few days after delivering an address that became her final public presentation. She was buried with Charles Robert Drysdale in Brookwood Cemetery.", "Her life-partner was Dr Charles Robert Drysdale. Their sons were Charles Vickery Drysdale FRSE (1874-1961) and George Vickery Drysdale (1881)."]}, {"page": "Charles Drysdale", "response": ["* Charles Robert Drysdale (1829-1907), British physician"]}, {"page": "Charles Vickery Drysdale", "response": ["He was born the first son of eminent Drs Charles Robert Drysdale and Alice Vickery. He was born in Paris on 8 July 1874 while his mother was studying Medicine there.Banishing the Beast: Feminism Sex and Morality, Lucy Bland  His uncle was John James Drysdale (1816–1890) founder of the Liverpool Homeopathic Hospital."]}, {"page": "London Dialectical Society", "response": ["The Society had a broad remit to all \"the most absolute freedom of debate\" with no topic excluded from discussion (except on the grounds of \"triviality\"). It therefore hosted debates on a wide variety of topics, examples of which include 'Over-population and Public Health' (July 1868) at which Charles Bradlaugh and Charles Robert Drysdale both spoke, 'On Marriage' (April 1871) led by Moncure D. Conway, and 'The Philosophy of Secularism' (December 1872) opened by Charles Watts. The format of these sessions was usually that an eminent speaker gave an opening lecture, which was followed by a debate open to all attendees. In 1868-69 the Society published a pamphlet explaining its purpose, history, and rules, as well as a report covering its activities and members in 1866-68."]}]}}