{"wiki_id": "http://www.wikidata.org/entity/Q1701569", "itemLabel": "John Richardson", "itemDescription": "British art historian, biographer (1924-2019)", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Richardson_(art_historian)", "wikipedia_page": {"main": "Sir John Patrick Richardson,  (6 February 1924 – 12 March 2019) was a British art historian and biographer of Pablo Picasso. Richardson also worked as an industrial designer and as a reviewer for The New Observer.\nIn 1952, he moved to Provence, where he became friends with Picasso, Fernand Léger and Nicolas de Staël. In 1960, he moved to New York and organized a nine-gallery Picasso retrospective. Christie's then appointed him to open their U.S. office, which he ran for the next nine years. In 1973 he joined New York gallery M. Knoedler & Co., Inc., as vice president in charge of 19th- and 20th-century painting, and later became managing director of Artemis, a mutual fund specializing in works of art.\nIn 1980 he started devoting all his time to writing and working on his Picasso biography. He was also a contributor to The New Yorker and Vanity Fair.\nIn 1993, Richardson was elected to the British Academy and in 1995 he was appointed Slade Professor of Fine Art at the University of Oxford. He was awarded France's Ordre des Arts et des Lettres in 2011 and in 2012 was appointed Knight Commander of the Order of the British Empire.", "link_mentions": [{"page": "Andy Warhol", "response": ["Warhol's brothers took his body back to Pittsburgh, where an open-coffin wake was held at the Thomas P. Kunsak Funeral Home. The solid bronze casket had gold-plated rails and white upholstery. Warhol was dressed in a black cashmere suit, a paisley tie, a platinum wig, and sunglasses. He was laid out holding a small prayer book and a red rose. The funeral liturgy was held at the Holy Ghost Byzantine Catholic Church on Pittsburgh's North Side. The eulogy was given by Monsignor Peter Tay. Yoko Ono and John Richardson were speakers. The coffin was covered with white roses and asparagus ferns. After the liturgy, the coffin was driven to St. John the Baptist Byzantine Catholic Cemetery in Bethel Park, a south suburb of Pittsburgh.Wilson, Scott. Resting Places: The Burial Sites of More Than 14,000 Famous Persons, 3d ed.: 2 (Kindle Location 49627). McFarland & Company, Inc., Publishers. Kindle Edition.", "Warhol's brother has described the artist as \"really religious, but he didn't want people to know about that because [it was] private\". Despite the private nature of his faith, in Warhol's eulogy John Richardson depicted it as devout: \"To my certain knowledge, he was responsible for at least one conversion. He took considerable pride in financing his nephew's studies for the priesthood\"."]}, {"page": "Juan Gris", "response": ["Gris began to paint seriously in 1911 (when he gave up working as a satirical cartoonist), developing at this time a personal Cubist style. In A Life of Picasso, John Richardson writes that Jean Metzinger's 1911 work, Le goûter (Tea Time), persuaded Juan Gris of the importance of mathematics in painting.John Richardson: A Life of Picasso, volume II, 1907–1917, The Painter of Modern Life, Jonathan Cape, London, 1996, p. 211. Gris exhibited for the first time at the 1912 Salon des Indépendants (a painting entitled Hommage à Pablo Picasso)."]}, {"page": "Pablo Picasso", "response": ["Between 1915 and 1917, Picasso began a series of paintings depicting highly geometric and minimalist Cubist objects, consisting of either a pipe, a guitar or a glass, with an occasional element of collage. \"Hard-edged square-cut diamonds\", notes art historian John Richardson, \"these gems do not always have upside or downside\". \"We need a new name to designate them,\" wrote Picasso to Gertrude Stein. The term \"Crystal Cubism\" was later used as a result of visual analogies with crystals at the time. These \"little gems\" may have been produced by Picasso in response to critics who had claimed his defection from the movement, through his experimentation with classicism within the so-called return to order following the war.", "At the start of the Spanish Civil War in 1936, Picasso was 54 years of age. Soon after hostilities began, the Republicans appointed him \"director of the Prado, albeit in absentia\", and \"he took his duties very seriously\", according to John Richardson, supplying the funds to evacuate the museum's collection to Geneva. The war provided the impetus for Picasso's first overtly political work. He expressed anger and condemnation of Francisco Franco and fascists in The Dream and Lie of Franco (1937), which was produced \"specifically for propagandistic and fundraising purposes\". This surreal fusion of words and images was intended to be sold as a series of postcards to raise funds for the Spanish Republican cause."]}, {"page": "Paul Gauguin", "response": ["Concerning Gauguin's impact on Picasso, John Richardson wrote:  The 1906 exhibition of Gauguin's work left Picasso more than ever in this artist's thrall. Gauguin demonstrated the most disparate types of art—not to speak of elements from metaphysics, ethnology, symbolism, the Bible, classical myths, and much else besides—could be combined into a synthesis that was of its time yet timeless. An artist could also confound conventional notions of beauty, he demonstrated, by harnessing his demons to the dark gods (not necessarily Tahitian ones) and tapping a new source of divine energy. If in later years Picasso played down his debt to Gauguin, there is no doubt that between 1905 and 1907 he felt a very close kinship with this other Paul, who prided himself on Spanish genes inherited from his Peruvian grandmother. Had not Picasso signed himself 'Paul' in Gauguin's honor.Richardson 1991, 461.", "Both David Sweetman and John Richardson point to the Gauguin sculpture called Oviri (literally meaning 'savage'), the gruesome phallic figure of the Tahitian goddess of life and death that was intended for Gauguin's grave, exhibited in the 1906 retrospective exhibition that even more directly led to Les Demoiselles. Sweetman writes, \"Gauguin's statue Oviri, which was prominently displayed in 1906, was to stimulate Picasso's interest in both sculpture and ceramics, while the woodcuts would reinforce his interest in print-making, though it was the element of the primitive in all of them which most conditioned the direction that Picasso's art would take. This interest would culminate in the seminal Les Demoiselles d'Avignon.\"Sweetman, 562–563."]}, {"page": "Daniel-Henry Kahnweiler", "response": ["*John Richardson, A Life of Picasso: The Prodigy, 1881–1906, Publ. Alfred A. Knopf, 1991, ", "*John Richardson, A Life of Picasso: The Cubist Rebel, 1907-1916, Publ. Alfred A. Knopf, 1991, "]}, {"page": "American History X", "response": ["Principal photography took place in Los Angeles and Venice Beach, lasting for several months and finishing in May 1997. Kaye served as cinematographer and camera operator, and would often silently walk around the set, scouting for camera angles or visuals. During filming, Kaye established a casual environment for the cast and crew. He welcomed visitors on set, including singer Courtney Love, Norton's girlfriend at the time, and British historian John Richardson. Kaye would arrive for work in a Lincoln Town Car with a chauffeur, and a license plate that read \"JEWISH\". He carried four cell phones and a fax machine, and during the Passover holidays, Kaye had boxes of matzo delivered to the set. He also discovered at the time a newsletter published by a British political group, the National Front, which said he was a prominent Jew who supposedly controlled Britain's media."]}, {"page": "1991 in literature", "response": ["*John Richardson – A Life of Picasso", "*Whitbread Best Book Award: John Richardson, A Life of Picasso"]}, {"page": "Timeline of art", "response": ["* 2019 in art - Death of Francine du Plessix Gray, John Mason, Jonas Mekas, Susan Hiller, Robert Ryman, Alessandro Mendini, Marella Angelli, Kevin Roche, Carolee Schneemann, Martín Chirino, Sir John Richardson, Okwui Enwezor, Luca Alinari, Barbara Hammer, Hedi Turki, Jacqueline Lichtenstein, Claude Lalanne, Monir Shahroudy Farmanfarmaian, Jayne Wrightsman, Mavis Pusey, Thomas Nozkowski, Lutz Bacher, Nobuo Sekine, Jamil Naqsh, I.M. Pei, Lawrence Carroll, Everett Kinstler, Tony DeLap, Joe Overstreet, Adela Neffa, Joyce Pensato, Maryon Kantaroff, Martin Roth, Suzan Pitt, Charles Ginnever, Robert Therrien, Gloria Vanderbilt, Peter Selz, Sascha Pohflepp, David Koloane, Leon Kossoff, Douglas Crimp, Steve Cannon, Frieder Burda, Marisa Merz, Carlos Cruz-Diez, Nancy Reddin Kienholz, Wang Guodong, Peter Lindbergh, Francisco Toledo, Robert Frank, Daniel Johnston, Huguette Caland, Matthew Wong, John Giorno, Ettore Spalletti, E. A. Carmean, Charles Jencks, Adolfo Mexiac, Stefan Edlis, Edward Clark, Huang Yong Ping, Gilberto Aceves Navarro, Rina Lazo, Manoucher Yektai, Johann Eyfells, May Stevens, Emily Mason, PHASE 2, Panamarenko, Alasdair Gray, Syd Mead"]}, {"page": "National Book Critics Circle Award", "response": ["* John Richardson, A Life of Picasso: The Triumphant Years, 1917–1932 (Knopf)"]}, {"page": "John Richardson", "response": ["John Richardson may refer to:", "*John Richardson (translator) (1564–1625), Master of Trinity College, Cambridge, 1615–1625", "*John Richardson (orientalist) (1740/1–1795), Oxford editor of A Dictionary; Persian, Arabic and English, 1777", "*John Richardson (philosopher) (born 1951), professor of philosophy at New York University", "*John Richardson (1766–1836), actor who founded the travelling Richardson's Theatre in 1798", "*John Richardson (actor) (1934–2021), English actor", "*John Richardson (art historian) (1924–2019), art historian, Picasso biographer", "*John Richardson (author) (1796–1852), Canadian novelist", "*John Richardson (drummer) (born 1964), American rock drummer from Illinois", "*Jayadev (musician) (John Richardson, born 1947), drummer, original member of The Rubettes", "*John Richardson (poet) (1817–1886), English poet", "*John Richardson (special effects designer) (born 1946), British designer of visual effects", "*John Richardson (businessman) (c. 1754–1831), Canadian businessman", "*John Richardson (colonial administrator) (1679–1741), Deputy Governor of Anguilla", "*John Richardson (New Zealand politician) (1810–1878), Speaker of the New Zealand Legislative Council, 1868–1879", "*John Richardson (New South Wales politician) (1810–1888), Australian pastoralist, store keeper and politician", "*John Richardson (Ontario MPP) (1844–1915), Ontario farmer and politician", "*John Richardson (born 1886) (1886–1976), American attorney and political figure", "*John Richardson (Canadian MP) (1932–2010), Canadian politician", "*John Richardson (Australian politician) (born 1938), member of the Victorian Legislative Assembly", "*John Richardson Jr. (1921–2014), US Assistant Secretary of State for Educational and Cultural Affairs (1969–1977)", "*John Richardson (Derbyshire cricketer) (1856–1940), English cricketer for Derbyshire County Cricket Club", "*John Richardson (tennis) (1873–?), South African Olympic tennis player", "*John Richardson (Yorkshire cricketer) (1908–1985), English cricketer for Yorkshire County Cricket Club", "*John Richardson (South African cricketer) (born 1935), South African cricketer for North Eastern Transvaal ", "*John Richardson (American football) (born 1945), American football player for the Miami Dolphins", "*John Richardson (baseball), American baseball player", "*John Richardson (footballer, born 1949) (1949–1984), English football player for Brentford, Fulham and Aldershot", "*John Richardson (footballer, born 1966), English football player for Colchester", "*John Richardson (rower) (born 1944), Canadian rower who competed in the 1968 Summer Olympics", "*John Richardson (bishop of Ardagh) (1580–1654), English bishop of the Church of Ireland", "*John Richardson (Quaker) (1667–1753), English Quaker minister and autobiographer", "*John Richardson (Archdeacon of Southwark) (1817–1904), Anglican priest", "*John Richardson (Archdeacon of Nottingham) (1849–1924), priest in the Church of England", "*John Richardson (archbishop of Fredericton) (1868–1938), Anglican Church of Canada bishop", "*John Richardson (bishop of Car Nicobar) (1896–1978), Anglican bishop in India, also M.P.", "*John Richardson (bishop of Bedford) (born 1937), Church of England bishop", "*John Richardson (Dean of Bradford) (born 1950), priest in the Church of England", "*John Richardson (Archdeacon of Derby) (1905–1991), Archdeacon of Derby", "*John Richardson (Archdeacon of Cleveland) (1676–1735)", "*John Richardson (dean of Kilmacduagh) (1669–1747)", "*John Richardson (judge) (1771–1841), English lawyer and judge in the Court of Common Pleas", "*Sir John Richardson (naturalist) (1787–1865), Arctic explorer and naturalist ", "*John Richardson (convict) (1797–1882), Australian convict who accompanied several exploring expeditions as botanical collector", "*John Richardson, Baron Richardson (1910–2004),  British physician", "*John Richardson (Australian Army officer) (1880–1954)"]}, {"page": "Garçon à la pipe", "response": ["John Richardson suggested that the painting could have been inspired by a poem entitled A Crime of Love by Paul Verlaine. One of the most poetic Rose period images is the Boy with a Pipe. It conjures up Verlaine’s poem ‘Crimen Amoris,’ about a palace in Ecbatana where ‘adolescent satans’ neglect the five senses for the seven deadly sins, except for the most handsome of all these evil angels, who is sixteen years old under his wreath of flowers… and who dreams away, his eyes full of fire and tears."]}, {"page": "Slade Professor of Fine Art", "response": ["* John Richardson (1995–96)"]}, {"page": "1991 Whitbread Awards", "response": ["* John Richardson, A Life of Picasso", "*John Richardson, A Life of Picasso"]}, {"page": "Guernica (Picasso)", "response": ["Guernica was painted using a matte house paint specially formulated at Picasso's request to have the least possible gloss. American artist John Ferren assisted him in preparing the monumental canvas,John Ferren biography, guggenheim.org. Retrieved 17 November 2020. and photographer Dora Maar, who had been working with Picasso since mid-1936 photographing his studio and teaching him the technique of cameraless photography,Fluegel (1980), p. 308. documented its creation. Apart from their documentary and publicity value, Maar's photographs \"helped Picasso to eschew color and give the work the black-and-white immediacy of a photograph\", according to art historian John Richardson."]}, {"page": "List of Guggenheim Fellowships awarded in 2001", "response": ["* John Richardson, Contributing Editor, Vanity Fair; International Consultant in 20th Century Art, Dickinson Roundell, New York: A life of Picasso, 1917–1939."]}, {"page": "Les Demoiselles d'Avignon", "response": ["Concerning Gauguin's impact on Picasso, art historian John Richardson wrote,", "Both David Sweetman and John Richardson point to Gauguin's Oviri (literally meaning 'savage'), a gruesome phallic representation of the Tahitian goddess of life and death intended for Gauguin's grave. First exhibited in the 1906 retrospective, it was likely a direct influence on Les Demoiselles. Sweetman writes,", "Picasso biographer John Richardson recounts in A Life of Picasso, The Cubist Rebel 1907–1916, art dealer Daniel-Henry Kahnweiler's recollection of his first visit to Picasso's studio in July 1907. Kahnweiler remembers seeing \"dusty stacks of canvases\" in Picasso's studio and \"African sculptures of majestic severity\". Richardson comments: \"so much for Picasso's story that he was not yet aware of Tribal art.'\"Richardson 1991, 34 A photograph of Picasso in his studio surrounded by African sculptures c.1908, is found on page 27 of that same volume.Richardson 1991, p. 27", "At the end of the first volume of his (so far) three volume Picasso biography: A Life Of Picasso. The Prodigy, 1881–1906, John Richardson comments on Les Demoiselles. Richardson says:", "John Richardson quotes Breton in a letter to Doucet about Les Demoiselles writing:", " through it one penetrates right into the core of Picasso's laboratory and because it is the crux of the drama, the center of all the conflicts that Picasso has given rise to and that will last forever....It is a work which to my mind transcends painting; it is the theater of everything that has happened in the last 50 years.John Richardson, with Marilyn McCully, A Life Of Picasso The Triumphant Years, 1917–1932, Albert A. Knopf 2007, p. 244, "]}, {"page": "1924 in art", "response": ["* 6 February – John Richardson, English-born art historian (d. 2019)."]}, {"page": "Albany (London)", "response": ["* John Richardson, art critic."]}, {"page": "Robert B. Silvers", "response": ["According to John Richardson in a 2007 Vanity Fair article, \"Jason Epstein's assessment of Silvers as 'The most brilliant editor of a magazine ever to have worked in this country' has been 'shared by virtually all of us who have been published by Robert Silvers'\".Richardson, John. \"The Silvers Age\", Vanity Fair, June 1, 2007. The British newspaper  The Guardian called Silvers \"the greatest literary editor there has ever been\",Banville, John, \"'The greatest literary editor there has ever been' – John Banville remembers Robert Silvers\"], The Guardian, March 23, 2017 while Library of America remembered him as \"an unsurpassed editor who helped define and sustain the literary and intellectual culture of New York and America\".\"LOA Remembers Robert Silvers, 1929–2017\", Library of America, March 28, 2017 The New York Times described him as \"the voracious polymath, the obsessive perfectionist, the slightly unknowable bachelor-workaholic with the colossal Rolodexes and faintly British diction\", and, in his obituary, stated that \"under his editorship [The Review] became one of the premier intellectual journals in the United States, a showcase for extended, thoughtful essays on literature and politics by eminent writers.\" Author Louis Begley wrote, \"the ideal editor of my – and I would guess every writer’s – dreams is ... Robert B. Silvers, the editor, brain, and heart of the NYRB. When I write a piece for his magazine, of course I have the immeasurable good luck to be edited by him.  There is no experience quite like it. Bob knows everything that's worth knowing, a consequence of his unflagging curiosity.\"Begley, Louis. \"Robert B. Silvers, Super Nanny, The Paris Review, March 22, 2012. \"Bob's edits are scrupulous, comprehensive, and precise. They are frequently aimed at saving the reviewer's face.\"Banville, John. \"The Rescue\", The Paris Review Daily, April 2, 2012. Roger Cohen wrote, after Silvers' death, \"No eye for imprecise thought was ever more discerning; no edit a sharper yet gentler distillation than his. ... He was a stickler for accuracy. The pencil in his hand went to the heart of the matter.\"Cohen, Roger. \"The Importance of Bob Silvers\", the New York Times, April 28, 2017"]}, {"page": "Gagosian Gallery", "response": ["To complement the West 24th Street gallery, a Richard Gluckman designed space on West 21st Street opened in October 2006. A joint exhibition with the 24th Street gallery, Cast a Cold Eye: The Late Works of Andy Warhol, launched Gagosian Gallery's second location in Chelsea and third location in New York. In 2009, the 21st Street gallery held an exhibition of Pablo Picasso's late works entitled Mosqueteros, curated by Picasso historian John Richardson."]}, {"page": "Waldemar Januszczak", "response": ["* Picasso: Magic, Sex, Death (Channel 4, 2001) with the artist's friend and biographer, John Richardson. (Three-episode series)\"Films by Waldemar Janusczak\", Movie Mail  Retrieved 28 March 2006"]}, {"page": "Costa Book Awards", "response": ["|align=\"left\"|John RichardsonA Life of Picasso "]}, {"page": "Nude in a Black Armchair", "response": ["Picasso met Walter in 1927, while he was married to the Russian ballerina Olga Khokhlova. Their first meeting occurred outside the Galeries Lafayette in Paris, when Picasso stopped Walter in the street and asked to paint her portrait. Picasso was 45 years of age, but Walter, who was aged just 17, was impressed. In 2011, John Richardson, Picasso's biographer related this event. \"She was at the Galeries Lafayette that day to buy a col Claudine—a Peter Pan collar—and matching cuffs. 'You have an interesting face,' Picasso told her. 'I would like to do a portrait of you. I am Picasso.' The name meant nothing to Marie-Thérèse, but the fact that an artist found her beautiful thrilled her.\" This was the beginning of a long-term affair that remained a secret until 1958."]}, {"page": "Modern Library 100 Best Novels", "response": ["During early 1998, the Modern Library polled its editorial board to find their opinions of the best 100 novels. The board of review consisted of Daniel J. Boorstin, A. S. Byatt, Christopher Cerf, Shelby Foote, Vartan Gregorian, Edmund Morris, John Richardson, Arthur Schlesinger Jr., William Styron and Gore Vidal.  All but Gregorian were published by Random House or an affiliate."]}, {"page": "Queen Sofía Spanish Institute", "response": ["* 1996 - Martha T. Muse, John Richardson, Emilio de Ybarra y Churruca"]}, {"page": "Opening of the Fifth Seal", "response": ["It has been suggested that the Opening of the Fifth Seal served as an inspiration for the early Cubist works of Pablo Picasso, especially Les Demoiselles d'Avignon, which mirrors the expressionistic angularity of the painting. When Picasso was working on Les Demoiselles d'Avignon, he visited his friend Zuloaga in his studio in Paris and studied El Greco's Opening of the Fifth Seal.C. B. Horsley, The Shock of the Old The relation between Les Demoiselles d'Avignon and the Opening of the Fifth Seal was pinpointed in the early 1980s, when the stylistic similarities and the relationship between the motifs of both works were analysed.R. Johnson, Picasso's Demoiselles d'Avignon, 102–113 Art historian Ron Johnson was the first to focus on the relationship between the two paintings. According to John Richardson, a British art historian, Les Demoiselles d'Avignon \"turns out to have a few more answers to give once we realize that the painting owes at least as much to El Greco as Cézanne\".J. Richardson, Picasso's Apocalyptic Whorehouse, 40–47"]}, {"page": "Kenneth Widmerpool", "response": ["Many readers and literary analysts have assumed that Widmerpool was drawn from Powell's acquaintances. Powell was circumspect and chose not to confirm any of the suggestions put to him. Candidates include Powell's Eton contemporary Sir Reginald Manningham-Buller (nicknamed \"Bullying-Manner\"),Levin, p. 15 later ennobled as Lord Dilhorne, who served as Attorney General during the 1950s and Lord Chancellor in the early 1960s. According to Powell, Manningham-Buller was an unattractive figure at school; he was instrumental in the dismissal of a master who sent an inappropriate note to a junior boy, an action reflected in the novels when Widmerpool instigates the sacking of Akworth.A Question of Upbringing, pp. 16–17 Powell's brother-in-law, the Labour peer Lord Longford, believed that he was the model for Widmerpool, a proposition that Powell rejected; Longford had also claimed to be Erridge, another character from the novels. The Labour politician Denis Healey thought that Powell had based Widmerpool on Edward Heath, the British prime minister between 1970 and 1974. It is possible that the episodes relating to Widmerpool's spying career are drawn from the activities of Denis Nowell Pritt, a Labour MP who was expelled from the party for his pro-Soviet stance. Powell's biographer Michael Barber wrote that Cyril Connolly declared his long-standing enemy, the art historian Douglas Cooper, to be a Widmerpool prototype; Cooper's companion John Richardson thought that Connolly was joking.Barber 2004, p. 270"]}, {"page": "Art of El Greco", "response": ["The Symbolists, and Pablo Picasso during his blue period, drew on the cold tonality of El Greco, utilizing the anatomy of his ascetic figures. While Picasso was working on Les Demoiselles d'Avignon, he visited his friend Ignacio Zuloaga in his studio in Paris and studied El Greco's Opening of the Fifth Seal (owned by Zuloaga since 1897).C.B. Horsley, The Shock of the Old The relation between Les Demoiselles d'Avignon and the Opening of the Fifth Seal was pinpointed in the early 1980s, when the stylistic similarities and the relationship between the motifs of both works were analysed.R. Johnson, Picasso's Demoiselles d'Avignon, 102–113 According to art historian John Richardson Les Demoiselles d'Avignon \"turns out to have a few more answers to give once we realize that the painting owes at least as much to El Greco as Cézanne\".J. Richardson, Picasso's Apocalyptic Whorehouse, 40–47 Picasso said about Demoiselles d'Avignon, \"in any case, only the execution counts. From this point of view, it is correct to say that Cubism has a Spanish origin and that I invented Cubism. We must look for the Spanish influence in Cézanne. Things themselves necessitate it, the influence of El Greco, a Venetian painter, on him. But his structure is Cubist\".D. de la Souchère, Picasso à Antibes, 15"]}, {"page": "Posthumous fame of El Greco", "response": ["The Symbolists, and Pablo Picasso during his blue period, drew on the cold tonality of El Greco, utilizing the anatomy of his ascetic figures. While Picasso was working on Les Demoiselles d'Avignon, he visited his friend Ignacio Zuloaga in his studio in Paris and studied El Greco's Opening of the Fifth Seal (owned by Zuloaga since 1897).C.B. Horsley, The Shock of the Old The relation between Les Demoiselles d'Avignon and the Opening of the Fifth Seal was pinpointed in the early 1980s, when the stylistic similarities and the relationship between the motifs of both works were analysed by Ron Johnson, John Richardson and Rolf Laesse.R. Johnson, Picasso's Demoiselles d'Avignon, 102-113* J. Richardson, Picasso's Apocalyptic Whorehouse, 40-47 A part of this inquiry was also a polemic: was there more El Greco or Cézanne in Les Demoiselles d'Avignon.E. Foundoulaki, From El Greco to Cézanne, 108 Alfred H. Barr Jr. spots the presence of El Greco and Cézanne in both The Villagers and Les Demoiselles d'Avignon.A.H. Barr Jr., Picasso, 48, 54"]}, {"page": "The Weeping Woman", "response": ["Dora has been described as \"Picasso's emblematic victim\". Françoise Gilot related that Picasso had said, \"For me she's the weeping woman. For years I've painted her in tortured forms, not through sadism, and not with pleasure, either; just obeying a vision that forced itself on me\". John Richardson offered a more realistic interpretation of Dora's tears. \"The source of Dora's tears was not Franco, but the artist's traumatic manipulation of her. Picasso's obsession with her had intensified [at that time], but to judge by the artist's portrayals of her, it precluded tenderness.\" Françoise Gilot described Maar as, \"by nature nervous, anxious and tormented\", who suffered from emotional vulnerability and frequent upsets in this period. Picasso explained that, \"Dora m'a toujours fait peur\" and portrayed her in this manner on numerous occasions from 1938. Maar later admitted that Picasso probably drew his inspiration from her sadness.", "A further interpretation of the painting is that the woman illustrates the Christian motif of the Virgin Mary mourning her dead son, Jesus Christ. This was a particularly prominent theme in Baroque Spanish religious art. Although Picasso was an atheist, John Richardson considered that his art made references to religious themes. Marilyn McCully opined that the weeping woman works are related to the Mater Dolorosa, Our Lady of Sorrows stating, \"In their essence as images of art, their emotional power lies in their origins among the painted wood, life-sized statues of the Madonna carried in Spain in religious processions, whose tears are jewels that sparkle as they run down their cheeks, and whose garments are real lace, velvets and silver - at once real and other worldly\"."]}, {"page": "Nat Tate: An American Artist 1928–1960", "response": ["Boyd published the book as a hoax, presented as a real biography. Gore Vidal, John Richardson (Picasso's biographer), Karen Wright (then editor of the influential Modern Painters magazine) and David Bowie (a board member of Modern Painters and co-director with Karen Wright of 21 Publishing, which published the book) were all participants in the hoax. \"Nat Tate\" is a combination of the names of two London art galleries, the National Gallery and the Tate Gallery. Boyd and his conspirators set about convincing the New York glitterati (social elites) that the reputation of this influential abstract expressionist needed to be re-evaluated."]}]}}