{"wiki_id": "http://www.wikidata.org/entity/Q1700506", "itemLabel": "John Howard", "itemDescription": "British Army officer", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Howard_(British_Army_officer)", "wikipedia_page": {"main": "Major Reginald John Howard DSO (8 December 1912 – 5 May 1999) was a British Army officer who led a glider-borne assault that captured the Caen canal and Orne river bridges on 6 June 1944, as part of the D-Day landings during the Second World War. These bridges spanned the Caen Canal and the adjacent River Orne (about 500 yards to the east), and were vitally important to the success of the D-Day landings. Since the war the bridge over the canal has become known as \"Pegasus Bridge\", as a tribute to the men who captured it, while the bridge over the River Orne later became known as Horsa Bridge after the Horsa gliders that had carried the troops to the bridges.\nHoward initially joined the British Army before the war, serving as a private soldier and then a non-commissioned officer for six years before discharging in 1938 and joining the Oxford City Police. In 1939 he was recalled to the army following the outbreak of the war and quickly rose through the ranks to become a regimental sergeant major in the King's Shropshire Light Infantry. In 1940 he was commissioned as a second lieutenant and eventually rose to be a major in 1942, at which time he took over command of 'D' Company, 2nd Battalion, Oxfordshire and Buckinghamshire Light Infantry. Before D-Day, Howard's company was selected to carry out the assault on the Caen and Orne River bridges and he became personally responsible for their training and the planning of the assault. During D-Day he led the company in a successful coup-de-main assault that gained control of the bridges and then held them until relieved. After D-Day, Howard commanded his company until September 1944 when they were withdrawn from the line. Due to the injuries he sustained in a car accident in November 1944, he took no further part in the war and was eventually invalided out of the British Army in 1946.  After this he became a public servant before he retired in 1974.\nHis role in the assault on the bridges was detailed in a number of books and films since the war, and after he retired he gave a number of lectures in Europe and the United States on tactics and on the assault itself. He died in 1999, at the age of 86.", "link_mentions": [{"page": "Richard Todd", "response": ["Richard Andrew Palethorpe-Todd  (11 June 19193 December 2009) was an Irish-British actor known for his leading man roles of the 1950s. He received a Golden Globe Award for Most Promising Newcomer – Male, and an Academy Award for Best Actor nomination and a Golden Globe Award for Best Actor nomination for his performance as Corporal Lachlan MacLachlan in the 1949 film The Hasty Heart. His other notable roles include Jonathan Cooper in Stage Fright (1950), Wing Commander Guy Gibson in The Dam Busters (1955), Sir Walter Raleigh in The Virgin Queen (1955), and Major John Howard in The Longest Day (1962). He was previously a Captain in the British Army during World War II,  fighting in the D-Day landings as a member of the 7th (Light Infantry) Parachute Battalion.", "He was commissioned into in the 2nd/4th Battalion of the King's Own Yorkshire Light Infantry (KOYLI).  Following arctic warfare training in Iceland he returned to the UK as a full lieutenant. For a short while he was posted, at his own request, as liaison officer to the 42nd Armoured Division then applied to join the Parachute Regiment in order to have a better chance at seeing action. He was accepted and after training was posted to the 7th (Light Infantry) Parachute Battalion as part of the British 6th Airborne Division. On 6 June 1944, as a lieutenant, he participated in Operation Tonga during the D-Day landings. He was among the first British soldiers to land in Normandy as part of Operation Overlord, and the first Irishman. His battalion parachuted in after glider-borne forces had landed to capture the Pegasus Bridge near Caen. During the operation he met John Howard on the bridge and was involved in helping to repulse counter-attacks by the Wehrmacht forces in the area. Five days after D-Day, while still in the bridge defence area, he was promoted Captain.Holland, James, Normandy '44, ISBN 9780552176118 Todd later played Howard in the film The Longest Day, recreating these events.", "The Boys (1962) was a courtroom drama film in which Todd played the lead prosecuting barrister. He had a good part among the many stars in The Longest Day (1962), playing Major John Howard during the airborne action just before and on D-Day in which he had taken part in 1944 (another actor portrayed Todd); this was his biggest hit for some time. He appeared in The Very Edge (1963), a thriller, then he played Harry Sanders in two films for Harry Alan Towers: Death Drums Along the River and Coast of Skeletons (both 1965). He also had a small role in Anderson's Operation Crossbow (1965).", "* The Longest Day (1962) as Major John Howard"]}, {"page": "Operation Tonga", "response": ["Operation Tonga began at 22:56 on the night of 5 June, when six Handley Page Halifax heavy bombers took off from RAF Tarrant Rushton towing six Horsa gliders carrying the coup-de-main force; this consisted of D Company, 2nd Battalion Oxfordshire and Buckinghamshire Light Infantry (part of the 6th Airlanding Brigade, but attached to the 5th Parachute Brigade for the initial invasion) reinforced with two extra platoons from B Company and a party of Royal Engineer sappers under the overall command of Major John Howard, who were tasked with capturing the bridges over the Caen Canal and the River Orne. A few minutes later, between 23:00 and 23:20, six Armstrong Whitworth Albemarle transports took off carrying pathfinders of the 22nd Independent Parachute Company, who were to mark the three drop-zones to be used by the airborne troops of the division. Another sixteen Albemarles followed the transports carrying the pathfinders, these transported elements of the 9th Parachute Battalion, 1st Canadian Parachute Battalion, and 3rd Parachute Brigade Headquarters."]}, {"page": "Pegasus Bridge", "response": ["On 6 June 1944, during the Second World War, the bridge was, along with the nearby Ranville Bridge over the Orne River (another road crossing, later renamed Horsa Bridge), the objective of members of D Company, 2nd (Airborne) Battalion, Oxfordshire and Buckinghamshire Light Infantry, a glider-borne force who were part of the 6th Airlanding Brigade of the 6th Airborne Division during Operation Tonga in the opening minutes of the Allied invasion of Normandy. Under the command of Major John Howard, D Company was to land close by the bridges in six Airspeed Horsa gliders and, in a coup-de-main operation, take both intact and hold them until relieved by the main British invasion forces. The successful capture of the bridges played an important role in limiting the effectiveness of a German counter-attack in the aftermath of the Normandy invasion.", "On the night of 5 June 1944, a force of 181 men, led by Major John Howard, took off from RAF Tarrant Rushton in Dorset, southern England in six Horsa gliders to capture Pegasus Bridge, and also \"Horsa Bridge\", a few hundred yards to the east, over the Orne River. The force was composed of D Company (reinforced with two platoons of B Company), 2nd Battalion, Oxford and Bucks Light Infantry; 20 sappers of the Royal Engineers of 249 Field Company (Airborne); and men of the Glider Pilot Regiment. The object of this action was to prevent German armour from crossing the bridges and attacking the eastern flank of the landings at Sword Beach.", "*Howard, John; Bates, Penny (2006). The Private Papers of Major John Howard DSO. Pen and Sword Military ."]}, {"page": "6th Airborne Division (United Kingdom)", "response": ["The invasion of Normandy started just after midnight 6 June 1944. The first units of the division to land were the pathfinders and six platoons from 'D' Company of the 2nd Battalion, Ox and Bucks Light Infantry, from Brigadier Hugh Kindersley's 6th Airlanding Brigade. While the pathfinders marked the division drop zones, 'D' Company carried out a coup de main glider assault on the two bridges crossing the River Orne and the Caen Canal. Within minutes of landing, both bridges had been captured and the company dug in to defend them until relieved. The company commander, Major John Howard, signalled their success by transmitting the codewords \"Ham and Jam\"."]}, {"page": "Richard Gale (British Army officer)", "response": ["Shortly after midnight on 6 June 1944, known otherwise as D-Day, men of Major John Howard's 'D' Company of the 2nd Battalion, Oxfordshire and Buckinghamshire Light Infantry (2 OBLI), a glider infantry unit forming part of the 6th Airlanding Brigade, landed in glider and captured the Caen canal and Orne river bridges (now known as Pegasus Bridge and Horsa Bridge) via coup de main. It was achieved with light casualties. The two parachute brigades, the 3rd and 5th, landed soon after and landed, for the most part, where intended, although numbers of paratroopers dropped in the flooded countryside. The Merville Gun Battery also fell, although with heavy losses to Lieutenant-Colonel Jock Pearson's 8th Parachute Battalion. At dawn, Gale himself landed in Normandy by a glider piloted by Billy Griffith.Dover, pp. 115–116 By midday on D-Day elements of Brigadier Lord Lovat's 1st Special Service Brigade had landed at Sword Beach, with the British 3rd Infantry Division following, and began to relieve the airborne troops at the bridges. The arrival of the rest of the 6th Airlanding Brigade in the evening, in Operation Mallard, completed the 6th Airborne Division's concentration in Normandy."]}, {"page": "The Longest Day (film)", "response": ["The film employed several Axis and Allied military consultants who had been actual participants on D-Day, and many had their roles re-enacted in the film. These included Günther Blumentritt (a former German general), James M. Gavin (an American general), Frederick Morgan (Deputy Chief of Staff at SHAEF), John Howard (who led the airborne assault on the Pegasus Bridge), Lord Lovat (who commanded the 1st Special Service Brigade), Philippe Kieffer (who led his men in the assault on Ouistreham), Marie-Pierre Kœnig (who commanded the Free French Forces in the invasion), Max Pemsel (a German general), Werner Pluskat (the major who was the first German officer to see the invasion fleet), Josef \"Pips\" Priller (the hot-headed pilot), and Lucie Rommel (widow of Field Marshal Erwin Rommel).", "|Maj. John Howard", "* Colin Maud lent Kenneth More the actual shillelagh that he carried ashore in the invasion. (More had served as an officer in the Royal Navy during World War II, albeit not as a Beachmaster.) Similarly, Richard Todd wears the beret that he actually wore on D-Day, although he changed the cap-badge to that of Maj. John Howard's regiment, the Oxfordshire and Buckinghamshire Light Infantry.", "* Richard Todd played Maj. John Howard, leader of the British airborne assault on the Pegasus Bridge, and Todd himself took part in the real bridge assault on D-Day. He was offered the chance to play himself but took the part of Maj. Howard instead."]}, {"page": "The Lambeth Walk", "response": ["In the movie The Longest Day (1962), about the Allied invasion of Normandy in June 1944, this song is sung by the squadron of Major John Howard in a glider on its way to capture Pegasus Bridge."]}, {"page": "Oxfordshire and Buckinghamshire Light Infantry", "response": ["In October 1941 the battalion, together with the rest of the 31st Brigade, was re-roled as an airborne battalion, specifically as glider infantry, and the 31st Brigade was redesignated the 1st Airlanding Brigade and became part of the 1st Airborne Division. In mid-1943 it was transferred, along with the 1st Royal Ulster Rifles, to become part of the 6th Airlanding Brigade in 6th Airborne Division. The 2nd Ox and Bucks were due to take part in the invasion of Sicily (Operation Husky); however in April 1943 the battalion was advised that the 1st Airborne and not the 6th Airborne were to be deployed in the landings. Just before the Normandy landings on 6 June 1944, a small force led by Major John Howard landed in six Horsa gliders and captured the Caen canal and Orne river bridges. Their success helped secure the eastern flank of the landings, prevented the German armour from crossing upriver and attacking into the flank of the British 3rd Infantry Division (who landed at Sword Beach at 07:25) and forced them to move further south via Caen.", "D Company 2nd Ox and Bucks had only 40 soldiers remaining of the 181 who had taken part in the coup de main operation to capture Pegasus and Horsa Bridges on D-Day. Major John Howard was the only officer still serving; none of the sergeants and few corporals were left of those who had taken part in the operation.Ambrose, p. 187 D Company had been in ninety-one days of continuous combat since 6 June 1944.Ambrose, p. 186"]}, {"page": "Glider infantry", "response": ["With much better intelligence and planning, the glider landings in the Battle of Normandy were far more successful. In particular, one coup de main force in six Horsa gliders captured the Caen canal and Orne river bridges by surprise, led by Major John Howard. The 6th British Airlanding Brigade, part of 6th Airborne Division (United Kingdom), were in action early on following concentrated landings, and prevented early German attempts to counter-attack the Allied landings. American landings were more scattered, but still more successful than many planners had hoped for."]}, {"page": "John Howard (disambiguation)", "response": ["John Howard (born 1939) was Prime Minister of Australia from 1996 to 2007.", "John Howard may also refer to:", "*John Howard (died 1437) (1366–1437), MP for Essex, Cambridgeshire and Suffolk", "*John Howard (MP for Faversham) (1863–1911), British Member of Parliament for Faversham 1900–1906", "*John Howard (Southampton Test MP) (1913–1982), British Member of Parliament, 1955–1964", "*John Howard (Australian actor) (born 1952), Australian actor", "*John Howard (American actor) (1913–1995), American actor", "*John Howard (cyclist) (born 1947), Olympic cyclist who set a land speed record on a pedal bicycle", "*John Howard (athlete) (1888–1937), Canadian athlete who ran in the 1912 Summer Olympics", "*John Howard (fighter) (born 1983), mixed martial arts fighter", "*John Howard (lacrosse) (1934–2007), American educator and lacrosse player and coach", "*John Howard (sprinter) (born 1981), Micronesian sprinter", "*John Howard (adventure racer), New Zealander considered the pioneer of adventure racing", "*John Howard (singer-songwriter) (born 1953), English singer-songwriter and pianist", "*John Howard (civil engineer) (1901–1986), British civil engineer", "*John Howard (industrialist) (1791–1878), British industrialist", "*John Howard (mathematician) (1753–1799), Scottish mathematician", "*John Howard (NIOSH director), American public health administrator", "*John Howard (optical physicist) (1921–2015), president of the Optical Society of America in 1991", "*John Howard (British Army officer) (1912–1999), best known for leading a vital assault during D-Day in the Second World War", "*John Howard, 1st Duke of Norfolk (c. 1425–1485), Duke of Norfolk and Lord High Admiral", "*John Howard, 15th Earl of Suffolk (1739–1820), British soldier and nobleman", "*John Howard (author) (born 1961), English author", "*John Howard (prison reformer) (1726–1790), English prison reformer of the 18th century, also refer to the John Howard Society of Canada", "*John Howard, American professor of English and humanities", "*John Howard (UK businessman), British businessman", "*John Howard, a minor character in Marvel Comics.", "*John Wagner (born 1949), comics writer who used the nom de plume John Howard"]}, {"page": "5th Parachute Brigade (United Kingdom)", "response": ["'D' Company, commanded by Major John Howard, from the 2nd Battalion of the Oxfordshire and Buckinghamshire Light Infantry (OBLI), of 6th Airlanding Brigade, also served with the brigade for a one off mission in Normandy.Ambrose, p.27 At the end of the war, while serving in the Far East, the pathfinders of the 22nd Independent Parachute Company, and the Parachute Platoon from the Light Composite Company, Royal Army Service Corps, were attached to the brigade.", "Just after midnight on 6 June 1944, six Halifax bombers towing Horsa gliders, with the reinforced 'D' Company from the 2nd Oxfordshire and Buckinghamshire Light Infantry on board, crossed the French coast.Ford, p.32 Shortly afterwards, the tow ropes were released and five of the gliders landed in the strip of land between the Caen Canal and the River Orne. Major John Howard commanded the company for the assault, which in short order captured the Benouville and Ranville bridges intact, for the loss of two dead and several wounded.Fowler, p.41, p.59 The intention was for this force to hold the bridges until relieved by the 7th Parachute Battalion.  Next, Albermarle bombers carrying the 5th Parachute Brigade's pathfinders, a group from each battalion, and the brigade headquarters started to arrive over the drop zone (DZ).Harclerode, p.317 Some planes got lost and failed to reach the DZ or arrived late. Others were damaged before dropping all their paratroops and turned back, and one returned to base after failing to find the drop zone at all."]}, {"page": "Terence Otway", "response": ["The citizens of Merville-Franceville-Plage in Normandy, France, decided to honour Otway by the placing of a bust depicting him at the age of 29 at the time of D-Day and the assault on the battery. This was unveiled in the grounds of the Merville Battery Museum on 7 June 1997 by himself, Raymond Triboulet, a leader of the French Resistance during the war, and Olivier Paz, the Mayor. The bust was sculpted by Vivienne Mallock who had also created busts of John Howard, Bernard Law Montgomery and Richard Nelson Gale. There was a large family gathering to witness the ceremony and twenty-one people sat down to dinner that night at the Moulin du Pre, a local restaurant, converted from a farmhouse, coincidentally the same farmhouse against which Otway landed on the night before D-Day.", "For the 50th anniversary, Mark Fielder produced a documentary called 'D-Day: Turning the Tide' in which Charles Wheeler, a D-Day landings veteran, visited the area of the Merville Battery and interviewed some of the protagonists, including Lt. Col. Terence Otway, and Raimund Steiner - the commander of the battery at the time of the assault. The documentary also features Maj John Howard who led the glider-borne attack on Pegasus Bridge."]}, {"page": "Air landing regiment", "response": ["Probably the most famous action involving a glider-borne unit was that at Pegasus Bridge, the first landing of troops on D Day that captured the Caen canal and Orne river bridges. On the night of 5/6 June 1944, D Company, 2nd Battalion Oxfordshire and Buckinghamshire Light Infantry (2nd Ox & Bucks), led by Major  John Howard, together with Royal Engineers and men of the Glider Pilot Regiment (totalling 181 men), were carried in 6 Horsa gliders to capture the vital bridge (later renamed \"Pegasus Bridge\") over the Caen Canal, and the bridge over the Orne River (since known as Horsa Bridge, and which is east of Pegasus Bridge). This was intended to secure the eastern flank to prevent German armour from reaching the area behind Sword Beach and interfering with the beach landings of the 3rd Infantry Division there."]}, {"page": "John Howard (soldier)", "response": ["#REDIRECT John Howard (British Army officer)"]}, {"page": "Hugh Kindersley, 2nd Baron Kindersley", "response": ["He completed a parachute training course and qualified as a glider pilot. In May 1943, promoted to acting Brigadier, The Honourable Hugh Kindersley was appointed Commanding officer of the 6th Airlanding Brigade. It was on his recommendation that Major John Howard and D Company 2nd Oxfordshire and Buckinghamshire Light Infantry (the 52nd) were selected to lead the coup de main operation at Pegasus Bridge and Horsa Bridge before the Allied invasion of the Normandy beaches began. Kindersley commanded 6 Airlanding Brigade, part of 6th Airborne Division, during the Normandy landings on D Day, 6 June 1944, landing at 03.30 hours with 6 Airborne divisional headquarters. He was later wounded during the Battle of Bréville, and evacuated to England. Brigadier Edwin Flavell replaced him as commanding officer of 6 Airlanding Brigade."]}, {"page": "92nd (Loyals) Light Anti-Aircraft Regiment, Royal Artillery", "response": ["F Troop's task on D-Day (6 June) was to drive from Sword Beach to the bridges over the River Orne and Caen canal at Benouville that had been seized overnight by the glider-borne infantry of the 2nd Battalion Oxfordshire and Buckinghamshire Light Infantry (6th Airborne Division), led by Major John Howard. The reconnaissance party of F Troop (Captain Reid and Sergeant Connor) went ashore with the division's first wave (8th Brigade) soon after H-Hour, while the guns landed with the third wave (9th Brigade) in the afternoon. Reid and Connor accompanied the Commandos of Lord Lovat's 1st Special Service Brigade to the bridges, which were held by 2nd Bn Oxfordshire and Buckinghamshire Light Infantry."]}, {"page": "John Howard (British army officer)", "response": ["#REDIRECT John Howard (British Army officer) "]}, {"page": "Howard (surname)", "response": ["* John Howard, various people", "* John Howard (1912–1999), British Army officer who led the glider-born operation that opened D-Day in 1944"]}, {"page": "6th Airlanding Brigade (United Kingdom)", "response": ["One of the first Allied units to land in Normandy was 'D' Company of the 2nd Ox and Bucks Light Infantry, commanded by Major John Howard. The company, attached to the 5th Parachute Brigade, captured the Caen canal and Orne river bridges via a coup de main assault."]}, {"page": "Index of World War II articles (J)", "response": ["# John Howard (American actor)", "# John Howard (British Army officer)", "# John Howard Griffin"]}, {"page": "Major John Howard", "response": ["#REDIRECT John Howard (British Army officer)"]}, {"page": "List of English people", "response": ["* John Howard (1912–1999), British Army major who led the coup de main party that captured the Caen canal and Orne river bridges."]}, {"page": "Tod Sweeney", "response": ["In May 1943 the battalion transferred from the 1st Airborne Division to 6th Airlanding Brigade, of the newly formed 6th Airborne Division. He was a platoon commander in Major John Howard's 'D' Company coup de main that captured the Caen canal and Orne river bridges during Normandy landings on 6 June 1944. The task was to seize Bénouville bridge, now known as Pegasus Bridge, over the Caen canal and Ranville bridge, now known as Horsa Bridge, over the River Orne. Sweeney and his No. 23 platoon's objective was, with two other platoons, to capture the Ranville bridge.", "* Howard, John and Bates, Penny. (2006). The Pegasus Diaries: The Private Papers of Major John Howard, DSO. Pen & Sword Books. ."]}, {"page": "No. 6 Commando", "response": ["In the end it took the commando three-and-a-half hours to advance the  to the bridges, with the lead elements, mounted on bicycles, linking up with gliderborne troops from D Company, 2nd Battalion, Oxford and Buckinghamshire Light Infantry under Major John Howard. After effecting the link up, the commandos joined with paratroops from the 9th Battalion, The Parachute Regiment in an attack on the village of La Plein, before digging in to begin defending against possible counterattack. By the end of the day, No. 6 Commando had suffered three killed and 32 wounded."]}, {"page": "6th Airborne Division advance to the River Seine", "response": ["On 23 August a reconnaissance patrol from the 1st Battalion, Royal Ulster Rifles crossed the River Touques by boat, but German resistance in the area was too heavy for the battalion to cross. Instead they moved upriver, intending to cross at Bonnerville sur Touques. Intelligence reported that the railway embankment on the river was held in force by the Germans, and this put attempts to cross the river there on hold.Harclerode, p.360 Elsewhere the 2nd Battalion, Oxfordshire and Buckinghamshire Light Infantry reached the river. Major John Howard and his D Company swam across and established the battalion's bridgehead. With local French assistance and a collection of small boats and rafts, the rest of the battalion were also able to cross the river, entering Touques on 24 August. The next day they liberated Saint Philibert, La Correspondence and Petiville, and reached Malhortie where the Germans were still defending the bridge and high ground. At 13:00, the battalion assaulted and captured the bridge intact, but German resistance prevented them from proceeding any further. On 26 August the advance continued, and at 19:00 Foulbec was liberated.Harclerode, p.361 Circumstances had divided the 6th Airlanding Brigade's forces, and they were now advancing along two routes, with the Belgian and Dutch brigades along the coast and the airlanding battalions further inland.Harclerode, pp.361–362 The 6th Airlanding Brigade battalions headed towards Honfleur and Berville sur Mer, meeting slight German opposition, while the Belgians occupied the area around Berville and Foulbec.Harclerode, pp.362–363"]}, {"page": "Capture of the Caen canal and Orne river bridges", "response": ["'D' Company, 2nd (Airborne) Battalion, Oxfordshire and Buckinghamshire Light Infantry (Major John Howard) and second in command Captain Brian Priday, was selected for the mission. The company had trained hard and became the fittest in the battalion, often utilizing bomb-damaged inner-city areas to practice street fighting with live ammunition. Howard expected the invasion to involve night-fighting and changed the daily routine to ensure that his men were up to the task. For weeks at a time, they rose at 20:00 and completed exercises, drills and normal paperwork throughout the night before retiring at 13:00. Gale tested the company through two exercises where the objective was to capture bridges, when it became apparent that the company would not be able to carry out the mission on its own. Asked to select two more platoons from the battalion to join them, Howard chose two from 'B' Company commanded by Lieutenants Fox and Smith. Any explosive charges found attached to the bridges were the responsibility of 30 Royal Engineers from the 249th (Airborne) Field Company, commanded by Captain Jock 'Joe' Neilson. Changes were then made to the operational plan to accommodate six platoons. Three were assigned to attack each bridge simultaneously with infantry overcoming the troops on guard duty while the engineers located and dismantled any demolition charges. For six days and nights the company carried out exercises just outside Exeter, in the south-west of England, where two bridges similar to their objectives were found over the Exeter Ship Canal.", "The Caen Canal bridge was renamed Pegasus Bridge after the emblem of the British airborne forces, while the River Orne bridge became Horsa Bridge. The road across them is now the \"Esplanade Major John Howard\". Since the end of the war, Pegasus Bridge and the adjacent Café Gondrée have become a place where British veterans of the conflict visiting Normandy congregate. In 1994, Pegasus Bridge was replaced by a new structure and the old bridge was added to the displays at the Pegasus Museum in Benouville."]}, {"page": "John Tillett (British Army officer)", "response": ["He became adjutant of the 2nd Ox and Bucks early in 1944 and was closely involved in the planning of the coup de main operation, led by Major John Howard, Officer Commanding (OC) of the battalion's D Company to capture two vital bridges: Pegasus Bridge and Horsa Bridge in the opening minutes of D-Day. On 6 June 1944, Tillett's glider, piloted by glider pilots from the Glider Pilot Regiment, landed near Ranville, Normandy, at approximately 21.00hrs, along with the rest of the battalion, as part of Operation Mallard. After holding the line on the Breville ridge and sustaining many casualties, Tillett and the 2nd Ox and Bucks in August 1944 took part in the British break-out and advance to the Seine (see 6th Airborne Division advance to the River Seine), known as Operation Paddle. The battalion, along with the rest of the 6th Airborne Division, returned to Bulford Camp, Wiltshire, in early September 1944, after three months of nearly continuous action.", "Howard, John; Bates, Penny (2006). The Pegasus Diaries: The Private Papers of Major John Howard DSO. Pen and Sword Military ."]}, {"page": "Deaths in May 1999", "response": ["*John Howard, 86, British Army officer during World War II."]}, {"page": "Café Gondrée", "response": ["The two-story red brick building was built at the end of the 19th century. The nearby Bénouville Bridge was a key objective of the British 6th Airborne Division. A unit of Glider infantry of the division's 2nd Battalion was to land, take the bridge intact and hold it until relieved. The unit was led by Major John Howard. Howard and his men boarded three gliders. Released at 8,000 feet in the pitch black of a storm filled night, all three gliders managed to make a rough landing in a field almost directly on top of their objective. Leaving the broken gliders, the men engaged in a short, fierce firefight which ended with the British paratroopers in control of the bridge. Three British paratroopers entered the café at 6:20 am on 6 June 1944, thereby liberating it.", "The café was also a destination for speakers at the military lectures that the war colleges put on in Normandy in the summers each year. Officers involved in the Normandy battles were asked by the war colleges to return to Normandy and speak of their experiences fighting there, and included such men as Major General \"Pip\" Roberts, Brigadier David Stileman, Major John Howard and Colonel Hans von Luck, an officer with the 21st Panzer Division. Because the owners were still severely anti-German, Howard covered for Luck by passing him off as Swedish."]}]}}