{"wiki_id": "http://www.wikidata.org/entity/Q1701264", "itemLabel": "John Osborne, 11th Duke of Leeds", "itemDescription": "British noble (1901-1963)", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Osborne,_11th_Duke_of_Leeds", "wikipedia_page": {"main": "John Francis Godolphin Osborne, 11th Duke of Leeds (12 March 1901 – 26 July 1963) was a British peer.\nHe was the son of George Godolphin Osborne, 10th Duke of Leeds and Lady Katherine Frances Lambton. He succeeded to the title of 11th Duke of Leeds and its subsidiary titles on 10 May 1927.\nHe inherited half a million pounds after tax from his father at the age of twenty-six in 1927, but his father also left gambling debts. Hornby Castle estate was placed on the market in 1930 and the Duke spent the rest of his life as a tax exile on the French Riviera, and on the island of Jersey at his mansion Melbourne House. Hornby Castle, bar one gutted wing, was demolished in 1931.Bibulous and self-centred, he had no interest in living up to his title, and dissipated much of the family's remaining wealth, although enough remained for his sole child Lady Camilla to inherit, in addition to an allowance, £1,000,000 (equivalent to £14,450,000 in 2020) lump sum from the family trust in 1971.In 1961 he sold Francisco Goya's Portrait of the Duke of Wellington at auction for £140,000 (equivalent to £2,770,000 in 2020). It was taken from the National Gallery later that year by Kempton Bunton who unsuccessfully tried to hold it for ransom.", "link_mentions": [{"page": "Oliver Lyttelton, 1st Viscount Chandos", "response": ["In 1948, the 5th Earl Nelson sold Trafalgar Park, Wiltshire, to John Osborne, 11th Duke of Leeds, whose brother-in-law Oliver Lyttelton, 1st Viscount Chandos, lived there while he was an MP. Eventually Lyttleton bought the estate and lived there until 1971, when Jeremy Pinckney bought the house."]}, {"page": "John Osborne (disambiguation)", "response": ["*John Osborne, 11th Duke of Leeds (1901–1963), British peer"]}, {"page": "Trafalgar Park, Wiltshire", "response": ["In 1948, the 5th Earl Nelson sold the house and its remaining 3,415 acres for an estimated £58,000 to John Osborne, 11th Duke of Leeds, whose brother-in-law Oliver Lyttelton, 1st Viscount Chandos, lived there while he was an MP. The Duke’s son-in-law, Viscount Chandos, was installed as sitting tenant in the house, which he eventually bought with only 10 acres of land when the rest of the estate was sold to the neighbouring Longford Castle estate in 1953. Lyttleton lived there until 1971, when banker Jeremy Pinckney bought the house for an estimated £75,000. A series of others bought and sold Trafalgar Park over the following years. Pinckney lived there for six years, after which he sold the estate to Tertius Murray Thriepland in 1978. In 1992 the house was sold to a Swedish hotelier Gunnar Bengtsson. "]}, {"page": "Nigel Dempster", "response": ["He married Lady Camilla Osborne in 1977 (divorced 2002). She was the former wife of Robert John Brownlow Harris and was the daughter of John Osborne, 11th Duke of Leeds and his second wife, Audrey Young. By his second marriage, Dempster had a stepdaughter, Emily Kate Godolphin Harris (born 1972), and a daughter, Louisa Beatrix Dempster (born 1979)."]}, {"page": "Lady Anne Cavendish-Bentinck", "response": ["Anne never married and had no children. Her obituary in the Daily Telegraph repeats the stories that as a débutante, she refused to marry a Belgian nobleman, destined to be Prince Charles of the Belgians. When he came to ask for her hand in marriage she reportedly refused to get out of bed. Instead she wished to marry John Osborne, 11th Duke of Leeds, but her family prevented this."]}, {"page": "Lady Camilla", "response": ["*Lady Camilla Dempster (née Osborne), only daughter of John Osborne, 11th Duke of Leeds"]}, {"page": "Portrait of the Duke of Wellington", "response": ["It descended to John Osborne, 11th Duke of Leeds by the time it was put up for auction at Sotheby's in 1961.  The New York collector Charles Wrightsman bid £140,000 (), but the Wolfson Foundation offered £100,000 and the government added a special Treasury grant of £40,000, matching Wrightsman's bid and obtaining the painting for the National Gallery in London, where it was first put on display on 2 August 1961. It was stolen nineteen days later on 21 August 1961 by bus driver Kempton Bunton. Bunton confessed that he took the painting and its frame in July 1965. Following a high-profile trial in which he was defended by Jeremy Hutchinson, QC, Bunton was found not guilty of stealing the painting, but guilty of stealing the frame."]}, {"page": "Irma de Malkhozouny", "response": ["Irma Amelia de Malkhozouny (formerly Irma Osborne, Duchess of Leeds) was an Italian-born Serbian ballet dancer. She was Duchess of Leeds from 1933 until 1948, during her marriage to John Osborne, 11th Duke of Leeds.", "Irma Amelia de Malkhozouny was the daughter of Iskender de Malkhozouny. She was a professional ballet dancer. She married Paul Brewster, but later divorced. On 27 March 1933 she married John Osborne, 11th Duke of Leeds in Nice, France. Her husband was the son of George Osborne, 10th Duke of Leeds and Lady Katherine Lambton. The marriage produced no children, and ended in 1948 when de Malkhozouny had an affair with Frank Atherton Howard, an American millionaire. In 1947 she married Howard.   The duke went on to marry two other times, to Audrey Young and Caroline Fleur Vatcher."]}, {"page": "Lady Camilla Osborne", "response": ["Lady Camilla Dorothy Godolphin Osborne (formerly Harris and Dempster; born 14 August 1950) is an English heiress. She is the only child of John Osborne, 11th Duke of Leeds.", "Lady Camilla Osborne was born on 14 August 1950 to John Osborne, 11th Duke of Leeds, and his second wife, Audrey Young. She grew up in Jersey, where her parents moved to avoid heavy taxes."]}, {"page": "Caroline Osborne, Duchess of Leeds", "response": ["Caroline Fleur Osborne, Duchess of Leeds, later Caroline Hobart, Lady Hobart, (née Vatcher; 18 May 1931 – 16 July 2005) was a British portraitist and landscape painter. As the third wife of John Osborne, 11th Duke of Leeds, she was the last Duchess of Leeds. She was known professionally as Caroline Leeds.", "Caroline married John Osborne, 11th Duke of Leeds on 22 February 1955, becoming the Duchess of Leeds. She was the duke's third wife, as he had been previously married to Irma de Malkhozouny and Audrey Young. Through this marriage, she became the stepmother of Lady Camilla Osborne, the duke's only child. Her husband died on 26 July 1963. As her husband had no sons, the Dukedom of Leeds went to his cousin Sir D'Arcy Osborne. The twelfth duke, who remained unmarried, died in 1964 without any male heirs and the Dukedom went extinct. As such, Caroline was the last Duchess of Leeds."]}, {"page": "Audrey Osborne, Duchess of Leeds", "response": ["#redirectJohn Osborne, 11th Duke of Leeds"]}, {"page": "Audrey Lawrence, Lady Lawrence", "response": ["#REDIRECT John Osborne, 11th Duke of Leeds"]}]}}