{"wiki_id": "http://www.wikidata.org/entity/Q1701431", "itemLabel": "John Picard", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Picard_(musician)", "wikipedia_page": {"main": "John Francis Picard (born 17 May 1934 in Tottenham, London, England) is an English jazz trombonist.", "link_mentions": [{"page": "Humphrey Lyttelton", "response": ["Lyttelton's mainstream band usually included such established musicians as Jimmy Skidmore, Joe Temperley, Kathy Stobart, Jimmy Hastings, Mike McKenzie, John Barnes, Roy Williams and Pete Strange along with new talent such as Tony Coe, Alan Barnes, John Picard, Karen Sharpe, and Jo Fooks. Lyttelton regarded his band as a family, with some members returning to the fold after periods away and/or staying for long periods (Bruce Turner, Stan Greig, Adrian Macintosh, Stobart, Hastings)."]}, {"page": "Dick Morrissey", "response": ["In between regular M&M gigs, Dick Morrissey would also meet up with old friends Ian \"Stu\" Stewart, Charlie Watts, Alexis Korner, Jack Bruce, Colin Hodgkinson, Don Weller, Zoot Money, John Picard and Colin Smith, to play boogie-woogie/jazz/rock with the back-to-the-roots fun band, Rocket 88, that Stewart put together with boogie-woogie pianist Bob Hall."]}, {"page": "Rocket 88 (band)", "response": ["The continuation of an ad hoc band formed by Stewart, Watts and Bob Hall, George Green, Colin Smith, John Picard,Carr, Ian; Fairweather, Digby and Priestley, Brian Rough Guide to Jazz Rough Guides, 2004   at Google Books the band featured many top British musicians, who would meet up when possible during the late 1970s and early 1980s for what was an ongoing jam session. Other \"regular\" members of the band included the above-mentioned founding members, plus Jack Bruce, Danny Adler, Don Weller, Colin Hodgkinson, Zoot Money, Chris Farlowe, Hal Singer, Mickey Waller, Pete York, Dave Markee, Harvey Weston, Charlie Hart, Willie Garnett, Olaf Vas and Malcolm Everson."]}, {"page": "Rocket 88 (album)", "response": ["*John Picard (trombone)"]}, {"page": "John Picard", "response": ["John Picard (born 25 March 1957) is an American architect, builder, entrepreneur as well as a building efficiency and sustainability expert. He is currently the founder and CEO of John Picard & Associates, an environmental and sustainability consulting firm working with international clients.", "* John Picard & Associates"]}, {"page": "Colin Smith (musician)", "response": ["Born in London, he joined the Terry Lightfoot band in 1957 before moving on to playing with Cy Laurie, in 1958. His long tenure in the Acker Bilk band began in 1959, taking a break in 1966 to sail across the Atlantic in a 45-foot ketch. Rejoining Bilk in 1968, he worked at the same time in the band led by the saxophonist Tony Coe and the trombonist John Picard, and with Stan Greig's London Jazz Big Band."]}, {"page": "1934 in jazz", "response": ["* 17 – John Picard, English trombonist."]}, {"page": "List of years in jazz", "response": ["* 1934 in jazz, deaths of Alcide Nunez, Amiri Baraka, Eddie Anthony, Gene Rodemich, Jack Carey, and Russ Columbo; births of Abdullah Ibrahim, Ahmad Alaadeen, Art Davis, Art Porter Sr., Bảo Vàng, Barre Phillips, Bill Chase, Bob Cunningham, Bob Northern, Bob Wallis, Bobby Bradford, Bobby Bryant, Cedar Walton, Colin Bailey, Colin Smith, Dave Grusin, Delisa Newton, Dick Heckstall-Smith, Don Ellis, Don Bailey, Doug Watkins, Eddie Harris, Egil Johansen, Ellis Marsalis Jr., Ethel Azama, Eva Olmerová, Georg Riedel, Georgy Garanian, Gino Paoli, Hacke Björksten, Hank Crawford, Horace Tapscott, Houston Person, Ib Glindemann, Inger Berggren, Ivan Jullien, Jacques Loussier, Jan Allan, Jimmy Garrison, Jimmy Woods, Joe Licari, John Critchinson, John Picard, Junior Cook, King Curtis, Kirk Stuart, Lanny Morgan, Marion Montgomery, Merl Saunders, Norio Maeda, Norman Edge, Janette Mason, Pat Moran McCoy, Phil Ramone, Pim Jacobs, Ray Mantilla, Raymond Premru, Rudy Collins, Selçuk Sun, Sheila Tracy, Shirley Horn, Shirley Scott, Stanley Turrentine, Steve Lacy, Sylvia Telles, Teri Thornton, Terry Cryer, Tony Coe, Tony Lee, Victor Feldman, Victor Gaskin, Vinko Globokar, Wade Legge, Warren Chiasson, Warren Smith, and Willie Bobo."]}, {"page": "Colin Purbrook", "response": ["He left Cambridge in 1957 and joined Sandy Brown's quintet on double bass for a six-month period at the popular 100 Club in Oxford Street, London.  He played piano for three years with Al Fairweather's All Stars, and also played with Kenny Ball, both as a pianist and on trumpet and double bass. In the early 1960s he worked with Kenny Baker, Ian Carr, Tony Coe, Bert Courtley, Jimmy Deuchar, Wally Fawkes, Alan Ganley, Derek Hogg, Dudley Moore (as bassist), John Picard, Don Rendell, Ronnie Ross, and Ronnie Scott."]}, {"page": "Kenny Napper", "response": ["Napper started out on piano as a child and picked up bass as a student at Guildhall School of Music. He entered the British military in the early 1950s, playing with Mary Lou Williams in 1953 during a leave period. After ending his term of duty, he played with Jack Parnell, Malcolm Mitchell, Vic Ash, and Cab Calloway. He was the house bassist at Ronnie Scott's Jazz Club for several years and played with many British and American jazz musicians in the late 1950s and early 1960s, including Alan Clare, Ronnie Scott, Stan Tracey, Tubby Hayes, Tony Kinsey, Tony Crombie, Jimmy Deuchar, John Dankworth, Pat Smythe, Phil Seamen, Zoot Sims, Carmen McRae, and Paul Gonsalves. Later in the 1960s he worked with Ted Heath, Tony Coe, John Picard, and Barney Kessel, as well as with Gonsalves, Tracey, and Dankworth. In 1970 he played with Stephane Grappelli and moved to Germany, playing with Kurt Edelhagen from 1970 to 1972. While in Germany he focused more on composition and arrangement; later in the decade he moved to the Netherlands, where he arranged for radio ensembles."]}]}}