{"wiki_id": "http://www.wikidata.org/entity/Q1700893", "itemLabel": "John Lutterell", "itemDescription": "Theologian, philosopher, churchman, university chancellor", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Lutterell", "wikipedia_page": {"main": "John Lutterell (died 1335) was an English medieval philosopher, theologian, and university chancellor.Lutterell was a Dominican and a Canon of Salisbury Cathedral.  He was Chancellor of Oxford University from 1317 to 1322. However, he was so disliked by the regent masters at Oxford that he was expelled as Chancellor there.\nJohn Lutterell went to Avignon in 1323 where he hoped to advance his career at the papal court. He carried with him a booklet of 56 errors taken from a commentary on the Sentences of Peter Lombard by William of Ockham. Lutterell presented this to  Pope John XXII. Lutterell may have been given the task of compiling a report on Ockham's views.  Even though he was a Doctor of Theology, he demonstrated a poor understanding of Ockham's ideas. As a result, the papal commission appointed to examine Ockham was forced to revise  the list of 56 errors prior to beginning its own inquiry.Lutterell believed that a reality (God's essence) can have rational differences (ideas). Opposing Ockham, he argued that these ideas cannot be created things. Instead these ideas are eternal and immutable, but creatures are not.\nOckham was questioned by Lutterell and five other theologians. They found difficulties with the young friar's ideas. He was not condemned formally but was forced to remain in Avignon under a type of house arrest.", "link_mentions": [{"page": "William of Ockham", "response": ["An alternative understanding, recently proposed by George Knysh, suggests that he was initially appointed in Avignon as a professor of philosophy in the Franciscan school, and that his disciplinary difficulties did not begin until 1327. It is generally believed that these charges were levied by Oxford chancellor John Lutterell. The Franciscan Minister General, Michael of Cesena, had been summoned to Avignon, to answer charges of heresy. A theological commission had been asked to review his Commentary on the Sentences, and it was during this that William of Ockham found himself involved in a different debate. Michael of Cesena had asked William to review arguments surrounding Apostolic poverty. The Franciscans believed that Jesus and his apostles owned no property either individually or in common, and the Rule of Saint Francis commanded members of the order to follow this practice. This brought them into conflict with Pope John XXII."]}, {"page": "List of chancellors of the University of Oxford", "response": ["| 1317 || John Lutterell "]}, {"page": "John Luttrell", "response": ["* John Lutterell (died 1335), English medieval philosopher, theologian, and university chancellor"]}]}}