{"wiki_id": "http://www.wikidata.org/entity/Q1701000", "itemLabel": "John Maxwell", "itemDescription": "British film producer", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Maxwell_(producer)", "wikipedia_page": {"main": "John Maxwell (1879–1940) was a British film producer. Maxwell was the co-owner of British International Pictures, which emerged as the largest British studio following the Film Act of 1927. Maxwell was a Scottish lawyer who first came into contact with the film industry in 1912. In 1927 he took over the newly constructed British National  Studios in Elstree after its founders ran into financial problems. Maxwell built a vertically integrated company incorporating film production, film distribution, initially through Wardour Films, and a large network of cinemas (ABC Cinemas) that enabled the company to compete with the leading German and Hollywood firms. Along with the facilities in Elstree, the company also acquired Welwyn Studios in Welwyn Garden City.\nWith BIP (which was renamed Associated British Picture Corporation in 1933) John Maxwell began a major production programme. Maxwell imported top filmmakers from Europe as well as signing up leading British talent such as Alfred Hitchcock. Under Maxwell's leadership BIP produced several masterpieces of late silent cinema. With Hitchcock's Blackmail (1929) the company successfully made the transition to sound. While it continued to make some more expensive films, it increasingly relied on large numbers of medium or low-budget comedies and musicals aimed at the British rather than the international market.\nBy the mid-1930s BIP had been overtaken by its rival Gaumont British as the largest British producer. Maxwell bought a stake in Gaumont, intending this as a first step to a takeover that would allow him to merge the two companies to create a giant firm. However, he discovered that he had acquired non-voting shares, which brought him no actual control over the company. He took legal action and a court case followed.\nMaxwell died in 1940. A giant British studio, similar to that envisaged by Maxwell, was created soon afterwards as J. Arthur Rank's Rank Organisation.", "link_mentions": [{"page": "Cinema of the United Kingdom", "response": ["Scottish solicitor John Maxwell founded British International Pictures (BIP) in 1927. Based at the former British National Pictures Studios in Elstree, the facilities original owners, including producer-director Herbert Wilcox, had run into financial difficulties. One of the company's early films, Alfred Hitchcock's Blackmail (1929), is often regarded as the first British sound feature. It was a part-talkie with a synchronised score and sound effects. Earlier in 1929, the first all-talking British feature, The Clue of the New Pin was released. It was based on a novel by Edgar Wallace, starring Donald Calthrop, Benita Home and Fred Raines, which was made by British Lion at their Beaconsfield Studios. John Maxwell's BIP became the Associated British Picture Corporation (ABPC) in 1933. ABPC's studios in Elstree came to be known as the \"porridge factory\", according to Lou Alexander, \"for reasons more likely to do with the quantity of films that the company turned out, than their quality\". Elstree (strictly speaking almost all the studios were in neighbouring Borehamwood) became the centre of the British film industry, with six film complexes over the years all in close proximity to each other.Warren (2001), pp. 57, 58."]}, {"page": "Blackmail (1929 film)", "response": ["The film began production as a silent film. To cash in on the new popularity of talkies, the film's producer, John Maxwell of British International Pictures, gave Hitchcock the go-ahead to film a portion of the movie in sound. Most sources state that Hitchcock thought the idea absurd and surreptitiously filmed almost the entire feature in sound, but in reality the silent version - which was largely completed - was cleverly used for several sequences with non-synchronous sound and dialogue where the actors faces were not visible. The opening 6½ minutes of the sound version are silent, with musical accompaniment, as are numerous shorter scenes later, and the entire final chase sequence is from the silent version with occasional non-synchronized vocal interjections, including Donald Calthrop's last words on the dome of the British Museum's reading room. Thus it can be argued that the sound version of Blackmail, despite BIP's publicity, is a \"part-talkie\". (By contrast, Gaumont-British's High Treason, directed by Maurice Elvey and released in September 1929, was made in all-sound and silent versions simultaneously, with the sound version being truly \"all-talkie\".)"]}, {"page": "Number Seventeen", "response": ["Hitchcock returned to England from a trip to the Caribbean with a new idea for a film. He told John Maxwell about it, but Maxwell said that Walter C. Mycroft had a different film for him to do: a filmed version of Joseph Farjeon's play Number Seventeen. Hitchcock was unhappy with this project, as he considered the story to be too full of cliches and he wanted to do a version of John Van Druten's London Wall. The director Thomas Bentley who eventually got to do London Wall at the time, wanted to direct Number Seventeen.Spoto, 1999. p. 129"]}, {"page": "John Maxwell", "response": ["John Maxwell may refer to:", "*John Maxwell (actor) (1918–1982), American actor of the 1940s and 1950s", "*John Maxwell (artist) (1905–1962), Scottish artist", "*John Maxwell (producer) (1879–1940), British film producer", "*John Maxwell (writer) (born 1944), American writer", "*John Maxwell (1824–1895), London publisher, husband of Mary Elizabeth Braddon", "* John Maxwell, Lord Pollok (1648–1732),  Scottish politician and lawyer", "*John Maxwell, 1st Baron Farnham (1687–1759), Irish peer and politician", "*John Maxwell, 2nd Earl of Farnham (1760–1823), Irish Representative peer and politician", "*Sir John Maxwell, 7th Baronet (1768–1844), British Member of the UK Parliament for Paisley", "*Sir John Maxwell, 8th Baronet of Pollock (1791–1865), British Member of Parliament for Lanarkshire and Renfrewshire", "*John Maxwell (Medal of Honor) (1841–1931), American Medal of Honor recipient", "*John Maxwell (British Army officer) (1859–1929), British Army officer and colonial governor", "*John Maxwell (Confederate agent), secret agent during the American Civil War", "*John Maxwell, 4th Lord Maxwell (died 1513), Scottish nobleman and head of the Border family of Maxwell", "*John Maxwell, 8th Lord Maxwell (1553–1593), Scottish Catholic nobleman", "*John Maxwell, 9th Lord Maxwell (died 1613), Scottish Catholic nobleman", "*John Maxwell (American football), American football player for John Heisman's Clemson Tigers", "*John Maxwell (golfer) (1871–1906), American golfer and Olympic silver medalist", "*John Maxwell (sport shooter) (born 1951), Australian Olympic sport shooter", "*John Maxwell (bishop) (died 1647), Scottish prelate, Archbishop of Tuam, Bishop of Ross", "*John Maxwell (police officer) (1882–1968), Chief Constable of Manchester, 1927–1942", "*John Maxwell (priest), Archdeacon of Clogher, 1762–1783"]}, {"page": "MGM-British Studios", "response": ["Meanwhile, Amalgamated Studios Ltd constructed a large studio on the north side of Elstree Way, Borehamwood, between 1935 and 1937. A January 1937 deal for eight films to be made for the American studio Columbia Pictures soon collapsed. The company was unable to meet the cost of building work, and in February 1939 sold the facility to the Rank Organisation, which was not interested in using the studios itself, but wanted to stop John Maxwell's rival British International Pictures (BIP) from being able to compete more effectively with Rank's recently opened Pinewood Studios. During the war, the studios were leased from Rank by the Ministry of Works which used them for storage purposes.Warren, p. 83"]}, {"page": "Associated British Picture Corporation", "response": ["The company was founded during 1927 by Scottish solicitor John Maxwell after he had purchased British National Pictures Studios and its Elstree Studios complex and merged it with his ABC Cinemas circuit, renaming the company British International Pictures. The Wardour Film Company, with Maxwell as chairman, was the distributor of BIP films. He appointed Joseph Grossman, formerly manager of the Stoll Studios, his Studio Manager."]}, {"page": "ABC Cinemas", "response": ["ABC Cinemas was established in 1927 by solicitor John Maxwell by merging three smaller Scottish cinema circuits. It became a wholly owned cinema subsidiary of British International Pictures when it was merged with the production arm of British National Pictures Studios, which had been formed by Maxwell in 1926."]}, {"page": "Joseph Grossman", "response": ["After serving with distinction in the Royal Army Medical Corps during The Great War, Joe Grossman entered the film industry in 1920, when Oswald Stoll gave him the post of Studio Manager at the Stoll Studios at Surbiton and, a year later, at the new Studios at Cricklewood. (Joe married Oswald Stoll's secretary, Esther Josephs, in 1922.) In 1927, John Maxwell, manager of British International Pictures (later Associated British Picture Corporation), offered him the Studio Manager job at Elstree, where he remained until his death. During his time as studio manager at Elstree he was successful in  engaging the interest of the Royal Family in the work of the studios. Both the future Edward VIII and the future George VI made private visits, and King George V and Queen Mary paid an official visit in 1934."]}, {"page": "Maxwell (surname)", "response": ["*John Maxwell (disambiguation), multiple people", ":* John Maxwell, Lord Pollok (1648–1732),  Scottish politician and lawyer", ":* John Maxwell, 1st Baron Farnham (1687–1759), Irish peer and politician", ":* John Maxwell, 2nd Earl of Farnham (1760–1823), Irish Representative peer and politician", ":* Sir John Maxwell, 7th Baronet (1768–1844), British MP for Paisley", ":* Sir John Maxwell, 8th Baronet of Pollock (1791–1865), British MP for Lanarkshire and Renfrewshire", ":* John Maxwell (1824–1895), London publisher, husband of Mary Elizabeth Braddon", ":* John Maxwell (actor) (1918–1982), American actor of the 1940s and 1950s", ":* John Maxwell (artist) (1905–1962), Scottish artist", ":* John Maxwell (producer) (1879–1940), British film producer", ":* John Maxwell (writer) (born 1944), American writer", ":*William John Maxwell, 18th Naval Governor of Guam"]}, {"page": "The Woman Tempted", "response": ["The Woman Tempted is a 1926 British silent drama film directed by Maurice Elvey and starring Juliette Compton, Warwick Ward and Nina Vanna.BFI.org It was based on a novel by Vera, Countess Cathcart.Goble p.75 The film was shot at Cricklewood Studios, and was backed by John Maxwell's Wardour Films which was dramatically increasing its role in the film industry. It was first given a trade show screening in June 1926, but did not go on full release until the following March. By that time Elvey had departed to work for Maxwell's rival Gaumont-British.Low p.186"]}, {"page": "1879 in Scotland", "response": ["* John Maxwell, film producer (died 1940 in England)"]}, {"page": "Elstree Studios (Shenley Road)", "response": ["British National Pictures Ltd purchased  of land on the south side of Shenley Road and began construction of two large film stages in 1925. After discord among the partners, which by this time included Herbert Wilcox, their solicitor John Maxwell invested and was able to gain control of the company.Patricia Warren British Film Studios: An Illustrated History, London: B.T Batsford, 2001, p.61 The first film produced there was Madame Pompadour (1927)."]}, {"page": "Mayflower Productions", "response": ["Mayflower Pictures was formed in July 1937 by German-born film producer Erich Pommer and British actor Charles Laughton. John Maxwell was on the board. They announced they would make three films, all to star Laughton – Vessel of Wrath (1938), St. Martin's Lane (1938) and Jamaica Inn (1939).", "However the disappointing financial performance of the films saw the company lose its main backer, John Maxwell."]}]}}