{"wiki_id": "http://www.wikidata.org/entity/Q1705657", "itemLabel": "Craig Dawson", "itemDescription": "English association football player", "wikipedia_url": "https://en.wikipedia.org/wiki/Craig_Dawson", "wikipedia_page": {"main": "Craig Dawson (born 6 May 1990) is an English professional footballer who plays as a defender for Premier League club West Ham United. He has previously played for Radcliffe Borough, Bolton Wanderers, Rochdale, West Bromwich Albion and Watford.", "link_mentions": [{"page": "Rochdale Cricket Club", "response": ["Famous players to have played cricket for Rochdale included Cecil Parkin, who was the club's professional in 1921 when he was selected to play for England in The Ashes Test against the Australians; when Parkin was picked for England, Rochdale recruited another England Test player, Patsy Hendren, to play instead for a single match against Heywood. Other notable professionals include England bowler Sydney Barnes, West Indian cricketer (and politician) Learie Constantine and professional footballer Craig Dawson."]}, {"page": "Rochdale", "response": ["Other notable residents include businessman and philanthropist Sir Peter Ogden, Businessman and Author Benjamin Howarth, novelist Nicholas Blincoe, Monica Coghlan, a prostitute caught up in the Jeffrey Archer scandal, and the banker Rev. Paul Flowers. Poet John Siddique was brought up in Rochdale and has referred to the town in several poems. Novelist Anna Jacobs was born in Rochdale. World Series of poker winner Jake Cody grew up in Rochdale. Elite British climber Ben Thornton was brought up in Rochdale. The footballer Earl Barrett was born there in April 1967 to Jamaican immigrant parents. Great Britain Olympian Craig Dawson, represented hometown club Rochdale and Bolton Wanderers at football."]}, {"page": "Julián Speroni", "response": ["Despite being told by manager Pulis that he would not be Crystal Palace's first choice goalkeeper, Speroni, nevertheless, continued to remain the first choice following the departure of Pulis at the start of the 2014–15 season. In a match against Burnley on 13 September 2014, he saved a penalty from Scott Arfield, as the club drew 0–0. After the match, his performance was praised by the returning manager Neil Warnock, saying: \"I think they broke the mould with him. Speroni is just a one-off but he does that every week and that's why he's been here so long with us. Speroni is a gem of a person.\" During a 2–2 draw against West Bromwich Albion on 25 October 2014. Speroni was substituted in the 55th minute after he took a blow to the face from Craig Dawson's arm. After the match, manager Warnock questioned the official's failure to take action against Dawson, calling it \"an assault almost\" and that Speroni could have been injured. But he made his recovery and returned to the starting line–up against Sunderland, as Crystal Palace lost 3–1 on 3 November 2014. Speroni then made his 347th league appearance for Crystal Palace, breaking John Jackson's record as the team's goalkeeper with the most league appearances, against Arsenal on 21 February 2015, losing 2–1. During a 2–1 win against Stoke City on 21 March 2015, he made an impressive display by making impressive saves and was praised by his teammate, James McArthur. However, Speroni uncharacteristically had an inconsistent season could be due to a lack of rotation and even a sense of being too comfortable in the number one spot. Despite being dropped to the substitute bench for the last two remaining matches of the 2014–15 season, he went on to make thirty–seven appearances in all competitions. On 22 May 2015, Speroni signed a one-year contract extension at Crystal Palace to keep him at the club until at least the end of the 2015–16 season."]}, {"page": "Vicarage Road", "response": ["On 1 September 2011 it hosted England under-21s 2013 UEFA European Under-21 Championship qualification Group 8 match against Azerbaijan under-21s. The hosts thrashed the visitors 6 – 0 with braces from Craig Dawson and Henri Lansbury and single goals from Jordan Henderson and Martyn Waghorn. There were 7,738 in attendance."]}, {"page": "Radcliffe F.C.", "response": ["* Craig Dawson", "Their highest transfer fee they received was from Shrewsbury Town for £20,000 for Jody Banim; however, the club has received more in add on fees from the sale of Craig Dawson to Rochdale AFC although the total sum remains undisclosed."]}, {"page": "Matt Mills", "response": ["Mills made his debut for the club in a 2–0 home victory over Derby County on 21 August.\"Bolton Wanderers 2–0 Derby County\"  BBC Sport. 21 August 2012. Retrieved 15 September 2012. He scored his first goal on 15 September, in a 2–1 win against Watford.\"Bolton Wanderers 2–1 Watford\"  BBC Sport. 15 September 2012. Retrieved 15 September 2012. Since joining Bolton Wanderers, Mills quickly became a first team regular, playing in the centre–back position. However, he picked up an upper thigh injury and was substituted in the 85th minute, as the club drew 2–2 against Huddersfield Town on 8 December 2012. Initially out for two to three weeks, Mills was sidelined for four to five months. It wasn't until on 2 April 2013 when he made his first appearance for the club, coming on as a 90th-minute substitute for goal scorer Chris Eagles to ensure a 1–0 victory against Huddersfield Town. Following his return, Mills, however, was unable to reclaim his starting position due to the form of Craig Dawson, Tim Ream and Zat Knight who had each occupied the centre-back position in his absence. At the end of the 2012–13 season, he went on to make twenty–one appearances and scoring once in all competitions."]}, {"page": "Gareth McAuley", "response": ["On 21 March 2015, McAuley was sent off in the second minute against Manchester City by referee Neil Swarbrick in a Premier League match, due to mistaken identity with Craig Dawson."]}, {"page": "Paul Huntington", "response": ["On 16 July 2010 Huntington signed to Yeovil Town on a two-year contract. He scored his first goal for Yeovil and their 3rd in a 3–1 win over Tranmere Rovers on 11 September and made the League One Team Of The Week. He repeated this achievement on 9 October after a 1–0 win at Rochdale. On 3 January 2011 he scored the only goal in a 1–0 win against Milton Keynes Dons at home and received Man of the Match. He won the League One Player of the Month for January, beating competition from Brighton's Elliott Bennett, Craig Dawson from Rochdale, and AFC Bournemouth's Liam Feeney to win this award which was presented by his manager Terry Skiverton. During this month he scored three times against Sheffield Wednesday, Milton Keynes Dons, and Brentford and was part of a defence that kept four clean sheets. He was appointed captain of the club as Yeovil finished in 14th place, their second highest finish. He was runner-up in the Green and White Player of the Season Award and the Western Gazette Player of the Season Award."]}, {"page": "Colchester Community Stadium", "response": ["The Community Stadium has hosted four international football matches; three featuring the England under-21s and one England under-19 game. The first international game at the stadium saw England under-19s defeat their German counterparts 1–0 in front of a crowd of 9,692 on 18 November 2008 courtesy of a Henri Lansbury goal. The next international fixture saw England under-21s qualify for the 2011 UEFA European Under-21 Football Championship as they beat Lithuania 3–0 with two goals from Danny Welbeck and one from Marc Albrighton. A crowd of 7,240 watched the game on 7 September 2010. The England under-21s returned to Colchester for a 2013 UEFA European Under-21 Championship qualifier on 11 November 2011. The Young Lions cruised to a 5–0 victory against Iceland on the night, with goals from Marvin Sordell, Martin Kelly, Craig Dawson and two scored by Gary Gardner. The attendance for the game was 10,051. England won their fourth match after almost five years away from the Community Stadium on 6 September 2016. Full England international Marcus Rashford made his England under-21 debut in the game, scoring a hat-trick as England scored six times against Norway. The other scorers were Nathaniel Chalobah, Ruben Loftus-Cheek and Lewis Baker. England's opposition scored for the first time at the Community Stadium when Ghayas Zahid scored Norway's consolation with the score at 4–1."]}, {"page": "EFL Awards", "response": ["|| Craig Dawson (Rochdale)"]}, {"page": "Dawson (surname)", "response": ["*Craig Dawson (born 1990), English footballer"]}]}}