{"wiki_id": "http://www.wikidata.org/entity/Q1700868", "itemLabel": "J. L. Ackrill", "itemDescription": "British classical scholar", "wikipedia_url": "https://en.wikipedia.org/wiki/J._L._Ackrill", "wikipedia_page": {"main": "John Lloyd Ackrill,  (30 December 1921 – 30 November 2007) was an English philosopher and classicist who specialized in Ancient Greek philosophy, especially the philosophy of Plato and Aristotle. Ackrill has been said to be, along with Gregory Vlastos and G. E. L. Owen, \"one of the most important figures responsible for the upsurge of interest in ancient Greek philosophy among Anglo-American philosophers of the second half of this century\".", "link_mentions": [{"page": "Reading School", "response": ["|J. L. Ackrill"]}, {"page": "De Interpretatione", "response": ["* J. L. Ackrill (ed.), Aristotle, Categories and De Interpretatione: Translated with Notes and Glossary. Oxford: Clarendon Press, 1963. "]}, {"page": "Categories (Aristotle)", "response": ["* 1963 translation by J. L. Ackrill, Chapters 1-5 PDF"]}, {"page": "Magna Moralia", "response": ["The Magna Moralia (Latin for \"Great Ethics\") is a treatise on ethics traditionally attributed to Aristotle, though the consensus now is that it represents an epitome of his ethical thought by a later, if sympathetic, writer. Several scholars have disagreed with this, taking the Magna Moralia to be an authentic work by Aristotle, notably Friedrich Schleiermacher, Hans von Arnim, and J. L. Ackrill.  In any case, it is considered a less mature piece than Aristotle's other ethical works, viz. the Nicomachean Ethics, the Eudemian Ethics, and Virtues and Vices. There is some debate as to whether they follow more closely the Eudemian or the Nicomachean version of the Ethics."]}, {"page": "David Wiggins", "response": ["David Wiggins was born on 8 March 1933 in London,\"Wiggins, David (1933–)\" in The Continuum Encyclopedia of British Philosophy (2006) the son of Norman and Diana Wiggins (née Priestley).'Who's Who 2012, London, A. & C. Black, London : 2012, 2466) He attended St Paul's School before reading philosophy at Brasenose College, Oxford, where he obtained a first-class degree. His tutor was J. L. Ackrill."]}, {"page": "List of philosophers born in the 20th century", "response": ["* J. L. Ackrill (1921-2007)"]}, {"page": "J.L. Ackrill", "response": ["#REDIRECT J. L. Ackrill"]}, {"page": "List of Brasenose College, Oxford people", "response": ["* J. L. Ackrill, Emeritus Professor of the History of Philosophy "]}, {"page": "Deaths in November 2007", "response": ["* J. L. Ackrill, 86, British philosopher."]}, {"page": "JL Ackrill", "response": ["#REDIRECT J. L. Ackrill "]}, {"page": "J. O. Urmson", "response": ["Urmson translated or wrote notes for a number of volumes of Aristotle, and commentaries on Aristotle's Physics by Simplicius, for the Ancient Commentators on Aristotle series published in the USA by Cornell University Press, in the UK initially by Duckworth, now by Bloomsbury, under the distinguished general editorship of Richard K.R. Sorabji. His book Aristotle's Ethics was praised by no less than J. L. Ackrill and Julius Moravcsik as an excellent introduction to Aristotle's Ethics.", "*Aristotle The Nicomachean Ethics (translated David O. Ross, 1925; revised J. O. Urmson and J. L. Ackrill, 1980) Oxford University Press"]}, {"page": "G. E. L. Owen", "response": ["Among the work of his period at Harvard is a paper on theTopics ('Dialectic and Eristic in the Treatment of the Forms', 1968) in which he argued that Aristotle did not employ his dialectic method in an eristic fashion and that he instead engaged constructively with Plato's theory of forms. Owen's article 'Notes on Ryle's Plato', a guide to the second half of the  Parmenides, provided, in the words of philosopher J. L. Ackrill, an \"extraordinary condensation of material and analysis\". In 1972, a paper entitled 'Aristotelian Pleasures' developed a reconciliation of two concepts of pleasures described in the Nicomachean Ethics. "]}, {"page": "John Lloyd Ackrill", "response": ["#REDIRECT J. L. Ackrill"]}, {"page": "List of fellows of the British Academy elected in the 1980s", "response": ["* Professor J. L. Ackrill"]}, {"page": "Laura Ruetsche", "response": ["Ruetsche graduated with a B.A. in Physics and Philosophy with a minor in Classical Greek from Carleton College. She went on to earn her B.Phil. in Philosophy at the University of Oxford, writing her thesis on Plato's Timeaus under the supervision of J. L. Ackrill. She then obtained her PhD at the University of Pittsburgh, writing her dissertation, entitled \"On the Verge of Collapse: Modal Interpretations of Quantum Mechanics\", under the supervision of John Earman."]}]}}