{"wiki_id": "http://www.wikidata.org/entity/Q1700561", "itemLabel": "John Irvin", "itemDescription": "born 1940; English film director", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Irvin", "wikipedia_page": {"main": "John Irvin (born 7 May 1940) is an English film director. Born in Newcastle upon Tyne, Northumberland, he began his career by directing a number of documentaries and television works, including the BBC adaptation of John le Carré's Tinker Tailor Soldier Spy. He made several Hollywood films in the 1980s, including The Dogs of War (1980), Ghost Story (1981) and Hamburger Hill (1987).\nIrvin is a graduate of London Film School.\n\n", "link_mentions": [{"page": "War film", "response": ["From the late 1970s, independently financed and produced films showed Hollywood that Vietnam could be treated in film. Successful but very different portrayals of the war in which America had been defeated included Michael Cimino's The Deer Hunter (1978), and Francis Ford Coppola's Apocalypse Now (1979).  With the shift in American politics to the right in the 1980s, military success could again be shown in films such as Oliver Stone's Platoon (1986), Stanley Kubrick's Full Metal Jacket (1987) and John Irvin's Hamburger Hill (1987)."]}, {"page": "Striptease", "response": ["Also produced in 1965 was Carousella, a documentary about Soho striptease artistes, directed by John Irvin. Another documentary film, which looked at the unglamorous side of striptease, is the 1966 film called,\"Strip\", filmed at the Phoenix Club in Soho."]}, {"page": "The Deer Hunter", "response": ["* John Irvin's Hamburger Hill (1987)"]}, {"page": "101st Airborne Division", "response": ["* 1987 John Irvin movie Hamburger Hill, set in May 1969 during the Vietnam War."]}, {"page": "Michael Gambon", "response": ["He made his film debut in the Laurence Olivier's Othello alongside Maggie Smith and Derek Jacobi in 1965. After his film debut in Olivier's Othello, Gambon was asked by James Bond producer Cubby Broccoli to audition for the role in 1970, to replace George Lazenby. He continued acting in the British horror films Nothing But the Night (1973), and The Beast Must Die (1974). In 1985 he appeared in the British drama film Turtle Diary directed by John Irvin with a screenplay adapted by Harold Pinter. The film starred Glenda Jackson and Ben Kingsley."]}, {"page": "Christopher Walken", "response": ["Walken's first film of the 1980s was the controversial Heaven's Gate, also directed by Cimino. Walken also starred in the 1981 action adventure The Dogs of War, directed by John Irvin. He surprised many critics and filmgoers with his intricate tap-dancing striptease in Herbert Ross's musical Pennies from Heaven (1981). In 1982, he played a socially awkward but gifted theater actor in the film adaptation of Kurt Vonnegut's short story Who Am I This Time? opposite Susan Sarandon. Walken then played schoolteacher-turned-psychic Johnny Smith in David Cronenberg's 1983 adaptation of Stephen King's The Dead Zone. That same year, Walken also starred in Brainstorm alongside Natalie Wood and (in a minor role) his wife, Georgianne."]}, {"page": "1995 in film", "response": ["| A Month by the Lake || Miramax Films || John Irvin (director); Trevor Bentham (screenplay); Vanessa Redgrave, Edward Fox, Uma Thurman, Alida Valli, Alessandro Gassman || Romance, Comedy || Live action"]}, {"page": "1997 in film", "response": ["| City of Industry || Orion Pictures / Largo Entertainment || John Irvin (director); Ken Solarz (screenplay); Harvey Keitel, Stephen Dorff, Timothy Hutton, Famke Janssen, Wade Dominguez, Michael Jai White, Lucy Liu, François Chau, Dana Barron, Elliott Gould || Crime, Thriller || Live action"]}, {"page": "1998 in film", "response": ["| When Trumpets Fade || HBO NYC Productions || John Irvin (director); W.W. Vought (screenplay); Ron Eldard, Zak Orth, Frank Whaley, Dylan Bruno, Devon Gummersall, Dan Futterman, Steven Petrarca, Dwight Yoakam, Martin Donovan, Timothy Olyphant, Jeffrey Donovan, Bobby Cannavale, Frank-Michael Köbe, Peter Thomas, Omar N. Bradley, Pierre Koenig, Bernard L. Montgomery || Drama || Live action"]}, {"page": "1994 in film", "response": ["| Widows' Peak || Fine Line Features / Rank Film Distributors / Irish Screen || John Irvin (director); Hugh Leonard, Tim Hayes (screenplay); Mia Farrow, Joan Plowright, Natasha Richardson, Adrian Dunbar, Jim Broadbent || Comedy || Live action"]}, {"page": "1989 in film", "response": ["| Next of Kin || Warner Bros. Pictures / Lorimar Film Entertainment / Barry & Enright Productions || John Irvin (director); Michael Jenning (screenplay); Patrick Swayze, Liam Neeson, Adam Baldwin, Helen Hunt, Bill Paxton, Ben Stiller, Andreas Katsulas, Michael J. Pollard, Ted Levine, Del Close, Paul Greco, Paul Herman, Valentino Cimo, Vincent Guastaferro, Starla Fugate || Action || Live action"]}, {"page": "1987 in film", "response": ["| Hamburger Hill || Paramount Pictures / RKO Pictures || John Irvin (director); James Carabatsos (screenplay); Anthony Barrile, Michael Patrick Boatman, Don Cheadle, Michael Dolan, Dylan McDermott, Courtney B. Vance, Steven Weber, Tim Quill, Tommy Swerdlow, Don James, M.A. Nickles, Harry O'Reilly, Daniel O'Shea, Tegan West || War || Live action", "* Hamburger Hill, directed by John Irvin, starring Dylan McDermott"]}, {"page": "1986 in film", "response": ["| Turtle Diary || The Samuel Goldwyn Company || John Irvin (director); Harold Pinter (screenplay); Glenda Jackson, Ben Kingsley, Richard Johnson, Michael Gambon, Jeroen Krabbé, Rosemary Leach, Eleanor Bron, Harriet Walter, Nigel Hawthorne, Michael Aldridge, Peter Capaldi, Harold Pinter, Bryan Pringle || Comedy, Drama, Romance || Live action", "| Raw Deal || De Laurentiis Entertainment Group / Embassy Pictures || John Irvin (director); Gary DeVore, Norman Wexler (screenplay); Arnold Schwarzenegger, Kathryn Harrold, Darren McGavin, Sam Wanamaker, Paul Shenar, Steven Hill, Ed Lauter, Joe Regalbuto, Robert Davi, Blanche Baker, George P. Wilbur, Steve Holt || Action || Live action"]}, {"page": "1981 in film", "response": ["| Ghost Story || Universal Pictures || John Irvin (director); Lawrence D. Cohen (screenplay); Fred Astaire, Melvyn Douglas, Douglas Fairbanks Jr., John Houseman, Craig Wasson, Patricia Neal, Alice Krige, Jacqueline Brookes, Miguel Fernandes, Lance Holcomb, Brad Sullivan, Michael O'Neill, Guy Boyd, Robin Curtis, James Greene, Tim Choate, Mark Chamberlin, Ken Olin, Kurt Johnson || Horror || Live action"]}, {"page": "1980 in film", "response": ["| The Dogs of War || United Artists || John Irvin (director); Gary DeVore, George Malko (screenplay); Christopher Walken, Tom Berenger, Colin Blakely, Hugh Millais, Paul Freeman, Jean-François Stévenin, JoBeth Williams, Maggie Scott, Robert Urquhart, Winston Ntshona, Pedro Armendáriz Jr., Harlan Cary Poe, Ed O'Neill, Shane Rimmer, George Harris, David Schofield, Terence Rigby, Olu Jacobs, Alan Beckwith, Jim Broadbent || War || Live action"]}, {"page": "John Houseman", "response": ["|John Irvin"]}, {"page": "Mississippi House of Representatives", "response": ["|John Irvin"]}, {"page": "List of film and television directors", "response": ["*John Irvin"]}, {"page": "Dino De Laurentiis", "response": ["| Raw Deal || John Irvin ||"]}, {"page": "Famke Janssen", "response": ["In 1995, Janssen appeared in Pierce Brosnan's debut James Bond film, GoldenEye, as femme fatale Xenia Onatopp. She appeared in Lord of Illusions with Scott Bakula. In an attempt to fight against typecasting after her Bond girl performance, Janssen began seeking out more intriguing support roles, appearing in John Irvin's City of Industry, Woody Allen's Celebrity, Robert Altman's The Gingerbread Man, and Ted Demme's Monument Ave. Denis Leary, her co-star in Monument Ave., was impressed by how easily she blended in, initially not recognizing her, as she was already in character. In the late 1990s, she appeared in The Faculty, Rounders, Deep Rising, and House on Haunted Hill."]}, {"page": "Frank Wedekind", "response": ["Wedekind's symbolist novella Mine-Haha, or On the Bodily Education of Young Girls (1903) was the basis for the films Innocence (2004) by Lucile Hadžihalilović and The Fine Art of Love (2005) by John Irvin."]}, {"page": "Tinker Tailor Soldier Spy", "response": ["A TV adaptation of the Tinker Tailor Soldier Spy was made by the BBC in 1979. It was a seven-part serial and was released in September of that year. The series was directed by John Irvin, produced by Jonathan Powell, and starred Alec Guinness as George Smiley, with Ian Richardson as Bill Haydon. Ricki Tarr was played by Hywel Bennett. In the US, syndicated broadcasts and DVD releases compressed the seven-part UK episodes into six, by shortening scenes and altering the narrative sequence."]}, {"page": "Hamburger Hill", "response": ["Written by James Carabatsos and directed by John Irvin, the film starred Dylan McDermott (his film debut), Steven Weber, Courtney B. Vance, Don Cheadle and Michael Boatman. It was shot in the Philippines. The novelization was written by William Pelfrey. The movie was produced by RKO Pictures and distributed by Paramount Pictures.", "In a 2021 interview John Irvin said that Hamburger Hill could have been released before Platoon and Full Metal Jacket \"if Paramount had been a bit braver\". Because Vietnam was not considered a popular subject, Paramount wanted to see how Platoon performed at the box office. According to Irvin, Hamburger Hill was again pushed back when Stanley Kubrick pushed for Full Metal Jacket to be released before Hamburger Hill. ", "Category:Films directed by John Irvin"]}, {"page": "Edward Woodward", "response": ["|John Irvin"]}, {"page": "Darren McGavin", "response": ["McGavin appeared in 1984's The Natural as a shady gambler, and appeared on a Christmas episode (\"Midnight of the Century\") of Millennium, playing the long-estranged father of Frank Black (Lance Henriksen). In 1986 he took a part in John Irvin's Raw Deal, alongside then rising star Arnold Schwarzenegger; McGavin plays a long time FBI officer who enlists a former colleague to help him unmask a mole within the Bureau working for a Chicago mob family. He won a CableACE Award (for the 1991 TV movie Clara) and received a 1990 Primetime Emmy Award nomination for Outstanding Guest Star in a Comedy Series on Murphy Brown, in which he played Murphy's father, Bill. From 1993 to 1994, he appeared in an off-Broadway production of Tom Dudzick's holiday comedy Greetings!, performed in numerous popular productions in regional and community theaters nationwide."]}, {"page": "Peter Barnes (playwright)", "response": ["John Irvin directed his The Moon and the Stars with Alfred Molina about the film business in 1930s' Rome. A revival of his Noonday Demons was produced by renowned theatre designer John Napier. Barnes television miniseries are shown yearly as holiday favourites."]}, {"page": "Raw Deal (1986 film)", "response": ["Raw Deal is a 1986 American action film directed by John Irvin, from a story of Sergio Leone's screenwriters Luciano Vincenzoni and Sergio Donati, and starring Arnold Schwarzenegger, Kathryn Harrold, Darren McGavin and Sam Wanamaker. The film was released in North America on June 6, 1986. The film tells the story of an elderly and embittered high-ranking FBI chief, Harry Shannon, who wants to get revenge against a Mafia organization and sends a former FBI agent and now small-town sheriff Mark Kaminski to destroy the organization from the inside.", "Roger Ebert gave the film 1.5 stars out of four and wrote, \"This plot is so simple (and has been told so many times before), that perhaps the most amazing achievement of 'Raw Deal' is its ability to screw it up. This movie didn't just happen to be a mess; the filmmakers had to work to make it so confusing.\" Vincent Canby of The New York Times wrote that the film \"isn't exactly Oscar material. It does nothing for the cause of nonviolence. It will warm the hearts of gun lobbyists everywhere, and its final body count may be even higher than that in Mr. Stallone's 'Cobra.' Yet 'Raw Deal' somehow manages to be measurably less offensive. At times, it's almost funny — intentionally.\"Canby, Vincent (June 6, 1986). \"Film: Schwarzenegger's 'Raw Deal'\". The New York Times. C5. Todd McCarthy of Variety reported, \"Comic book crime meller suffers from an irredeemably awful script, and even director John Irvin's engaging sense of how absurd the proceedings are can't work an alchemist's magic.\"McCarthy, Todd (June 11, 1986). \"Film Reviews: Raw Deal\". Variety. 14. Writing in the Los Angeles Times, Sheila Benson began, \"Has it come to this? That we can feel vaguely cheered that Raw Deal (citywide), where the bodies again pile up like cordwood, is a better made movie than Cobra?\" However, she praised Schwarzenegger, saying that his strength as an actor is \"not that he can toss grown men over ceiling beams, but that he has a vein of sweetness and self-deprecation that no amount of mayhem can obliterate ... it has shone from him since Pumping Iron, it has allowed him to surmount silly and unwise pieces of action (such as the drunk scenes in one of the Conans and here), and even his own awkwardness as an actor.\" Gene Siskel of the Chicago Tribune gave the film 1 star out of 4 and noted that it had \"essentially the same story\" as Cobra, \"but it is told with so many superfluous characters that we're never really sure whose side a few key people are on. Needless to say, in a film filled with punch-outs, we very quickly don't care.\"Siskel, Gene (June 6, 1986). \"'Raw Deal': The title says a lot about confusing plot\". Chicago Tribune. Section 7, page K. Paul Attanasio of The Washington Post dismissed the film as \"a mostly tedious, cheaply made shoot-em-up\" that \"recycles the clichés that have long been the cud of television cop dramas.\"Attanasio, Paul (June 7, 1986). \"'Raw Deal' Arnold as Rambuffo\". The Washington Post. D5. Pauline Kael of The New Yorker called it \"reprehensible and enjoyable, the kind of movie that makes you feel brain dead after two minutes—after which point you're ready to laugh at its mixture of trashiness, violence, and startlingly silly crude humor.\"Kael, Pauline (June 30, 1986). \"The Current Cinema\". The New Yorker. 51.", "Category:Films directed by John Irvin"]}, {"page": "The Garden of Eden (novel)", "response": ["A film adaptation of The Garden of Eden was released in 2008 at the RomaCinemaFest and had a limited investors' screening in the UK. Screen International dubbed the film \"a boundaries-breaking erotic drama.\" The film went on general release in select theaters in December 2010. The ensemble cast featured Jack Huston, Mena Suvari, Caterina Murino, Richard E. Grant, and Carmen Maura. It was directed by John Irvin. The adaptation was by James Scott Linville, former editor of The Paris Review. In March 2011, the film went on sale on iTunes and with other vendors."]}, {"page": "Jack Cardiff", "response": ["|1981 || Ghost Story || John Irvin ||", "|1981 || The Dogs of War || John Irvin ||"]}, {"page": "Jack Nitzsche", "response": ["|John Irvin"]}, {"page": "62nd Venice International Film Festival", "response": ["| colspan=2 data-sort-value=\"Fine\"| The Fine Art of Love-Mine Haha || data-sort-value=\"Irvin\"| John Irvin || Italy, Czech Republic, UK"]}, {"page": "When Trumpets Fade", "response": ["When Trumpets Fade is a 1998 HBO television movie directed by John Irvin and starring Ron Eldard, Frank Whaley, Zak Orth, and Dylan Bruno. First released on June 27, 1998, the film is set in World War II during the Battle of the Hürtgen Forest.", "John Irvin won the Silver FIPA Award for Best Director for the film at the Biarritz International Festival in 1999.", "Category:Films directed by John Irvin"]}, {"page": "Ghost Story (1981 film)", "response": ["Ghost Story is a 1981 American supernatural horror film directed by John Irvin and starring Fred Astaire, Melvyn Douglas, Douglas Fairbanks Jr., John Houseman, Craig Wasson, and Alice Krige. Based on the 1979 novel of the same name by Peter Straub, it follows a group of elderly businessmen in New England who gather to recount their involvement in a woman's death decades prior when one of them suspects her ghost has been haunting him.", "Universal Pictures had purchased the rights to Peter Straub's novel, Ghost Story, in 1978 for $225,000. English director John Irvin was asked to direct the film by producer Burt Weissbourd on the basis of his direction of Haunted: The Ferryman, a British television film.Irvin 2015 (00:01:28) Upon reading Straub's novel and Lawrence D. Cohen's screenplay, Irvin envisioned the narrative as being about hypocrisy and principally \"men's fear of women, and at some point, hatred.\"Irvin 2015 (00:04:34) Irvin, who was a newcomer in Hollywood, hired several British filmmakers as part of his team, and stated that the film's cinematography was intended to be \"European\" in appearance,Irvin 2015 (00:03:50) and to \"look like a Christmas card.\"Irvin 2015 (00:09:27)", "The Time Out film guide deemed it a \"disastrous distillation of Peter Straub's overrated but at least tolerably coherent novel.\" TV Guide awarded the film two out of four stars, criticizing Cohen's screenplay, but adding: \"Director John Irvin does manage to evoke some mood and atmosphere from the snowy New England setting, and the performances from the four veteran lead players are enjoyable.\" ", "Ghost Story was released on DVD on March 25, 1998, by Image Entertainment. Universal repressed the DVD with an alternate cover art, which was released September 7, 2004. The film received its first Blu-ray release in the United States on November 24, 2015, by Scream Factory. This release featured new bonus material, including an audio commentary with director John Irvin, as well as interviews with Peter Straub, Alice Krige, Lawrence D. Cohen, Burt Weissbourd, and Bill Taylor.", "Category:Films directed by John Irvin"]}, {"page": "Carmen Maura", "response": ["||  The Garden of Eden ||Madame Aurol || John Irvin||"]}, {"page": "The Dogs of War (novel)", "response": ["An eponymous film was released in 1980, based upon the novel and directed by John Irvin. The movie was filmed in Belize.", "* United Artists released a 1980 film adaptation directed by John Irvin and starring Christopher Walken and Tom Berenger."]}, {"page": "Matthew Marsden", "response": ["Marsden returned to acting, portraying Paris in the USA networks mini-series Helen of Troy; Army Ranger Dale Sizemore in Ridley Scott's blockbuster film Black Hawk Down. He starred in John Irvin's feature Shiner, Anacondas: The Hunt for the Blood Orchid (the sequel to Anaconda) and Tamara, a supernatural thriller by Final Destination screenwriter Jeffrey Reddick. He made appearances in the films DOA: Dead or Alive and Resident Evil: Extinction. He co-starred in Rambo (2008) and Transformers: Revenge of the Fallen."]}, {"page": "Alexandra Byrne", "response": ["| John Irvin"]}, {"page": "John Irvine", "response": ["John Irvine may refer to:", "*John Irvine (journalist), Northern Irish ITN journalist", "*John Irvine (priest) (born 1949), Dean of Coventry based at Coventry Cathedral, UK", "*John Irvine (ji_2001) DJ based in Edinburgh, Scotland", "*John Irvin (born 1940), English film director", "*John Irvine Hunter (1898–1924), Australian professor of anatomy"]}, {"page": "Peter Honess", "response": ["|John Irvin", "|John Irvin", "|John Irvin"]}, {"page": "List of films based on spy books", "response": ["| 12||  Tinker, Tailor, Soldier, Spy *||  1979 || Frances Alcock & John Irvin|| UK || Tinker, Tailor, Soldier, Spy|| John le Carré || 1974 || Novel || - || - || -"]}, {"page": "The Dogs of War (film)", "response": ["The Dogs of War is a 1980 American war film based upon the 1974 novel of the same name by Frederick Forsyth. Largely filmed in Belize, it was directed by John Irvin and starred Christopher Walken and Tom Berenger. In it a small mercenary unit of soldiers is privately hired to depose the president of a fictional African country so that a British tycoon can gain access to a platinum deposit.", "United Artists bought rights to the novel in 1974. Don Siegel was going to direct but did not like the screenplay. Abbey Mann wrote a new screenplay. Then Michael Cimino wrote another draft. Norman Jewison became attached as producer-director and Gary Devore rewrote the script. Jewison decided to produce, not direct, and looked for another director. Initially Jewison hired Michael Cimino to direct with Clint Eastwood and Nick Nolte starring, but he dropped out of the film in order to work on Heaven's Gate. John Irvin became director. ", "This was only the second international feature for director John Irvin, who previously worked as a documentary maker during the Vietnam War. He went on to direct stars such as Arnold Schwarzenegger (Raw Deal), Don Cheadle (Hamburger Hill) and Michael Caine (Shiner).", "Category:Films directed by John Irvin"]}, {"page": "List of films based on sports books", "response": ["|Champions || 1983 || John Irvin || UK || Champion's Story || Bob Champion & Jonathan Powell || 197? || Autobiography"]}, {"page": "The Fine Art of Love", "response": ["The Fine Art of Love is a 2005 erotic drama film directed by John Irvin. The film, starring Jacqueline Bisset, Hannah Taylor-Gordon and Mary Nighy, is based on Mine-Haha, or On the Bodily Education of Young Girls by the German playwright Frank Wedekind. It received its premiere at the 2005 Venice Film Festival.", "Category:Films directed by John Irvin"]}, {"page": "City of Industry (film)", "response": ["City of Industry is a 1997  American neo-noir crime thriller film starring Harvey Keitel, Stephen Dorff and Timothy Hutton. It is directed by John Irvin, produced by Evzen Kolar and Ken Solarz and written by Solarz.", "Category:Films directed by John Irvin"]}, {"page": "Widows' Peak", "response": ["Widows' Peak is a 1994 British-Irish mystery film directed by John Irvin and starring Mia Farrow, Joan Plowright, Natasha Richardson, Adrian Dunbar and Jim Broadbent.The Irish Filmography 1896–1996; Dublin: Red Mountain Press, 1996. p.207 The film is based on an original screenplay by Hugh Leonard and Tim Hayes.", "In 1995, the actress Natasha Richardson received the Crystal Globe award at the Karlovy Vary International Film Festival, Czech Republic, for her role in this film. The director, John Irvin, was also nominated for this award. It received the best picture award at the 1995 Austin Film Festival.", "Category:Films directed by John Irvin"]}]}}