{"wiki_id": "http://www.wikidata.org/entity/Q17002544", "itemLabel": "John Crozier", "itemDescription": "Australian pastoralist, winemaker and politician", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Crozier_(politician)", "wikipedia_page": {"main": "John Crozier (12 August 1814 – 21 April 1887) was a pastoralist of New South Wales and Victoria and a South Australian politician.", "link_mentions": [{"page": "William Crozier", "response": ["*William Crozier (1839–1906), son and heir of John Crozier, South Australian pastoralist", "*William John Crozier (1892–1955), American physiologist"]}, {"page": "South Australian Jockey Club", "response": ["The Club was re-formed in 1875 with Stewards: Sir John Morphett, Sir Henry Ayers, John Crozier M.L.C., W. Cavenagh, MP., and Philip Levi. The Committee consisted of: G. Bennett, W. K. Simms, MP. Judge: Mr. E. M. Bagot. Starters: Henry Hughes and G. Bennett. Clerk of the Course: J. Boase. The first handicapping committee consisted of W. B. Rounsevell, G. Bennett and H. Hughes. Longtime handicapper Henry Hughes was succeeded by his son William Charles Hughes.", "The directors elected at the first general meeting of the Company were Sir Henry Ayers, Sir John Morphett, Thomas Elder, John Crozier, R. C. Baker, Philip Levi, Joseph Gilbert, E. W. Pitts, and H. B. Hughes, all highly influential gentlemen and racing enthusiasts."]}, {"page": "John Crozier", "response": ["John Crozier may refer to:", "* John Crozier (archbishop of Armagh) (1858–1920), Anglican bishop in Ireland, father of the below", "* John Crozier (bishop of Tuam, Killala and Achonry) (1879–1966), Anglican bishop in Ireland, son of the above", "* John Crozier (politician) (1814–1887) Australian pastoralist and member of South Australian Legislative Council"]}, {"page": "Georgie Crozier", "response": ["Crozier was born in Coleraine, Victoria to Digby Crozier and Mary Jill Salter. She is one of four siblings. Her father was the Member for Western Province in the Victorian Legislative Council from 1973 to 1985 and Member for Portland from 1985 to 1988. He also served as a Minister in the Hamer and Thompson Governments. Her great-great-grandfather, John Crozier was a member of the South Australian Legislative Council from 1867 to 1887."]}, {"page": "Crozier (surname)", "response": ["*John Crozier (politician) (1814–1887) was a pastoralist and politician in South Australia"]}, {"page": "Adelaide Racing Club", "response": ["The club had its origin, following the collapse of the first S.A.J.C., in a meeting called in December 1869 by Sir J. H. Fisher, John Baker, E. Holland, Joseph Gilbert, John Morphett, John Crozier, H. R. Fuller, M.P., and W. W. Tuxford, and a subsequent race run at the \"Old Adelaide Racecourse\" by a group which included William Blackler, Seth Ferry, Gabriel Bennett, George Church, Dr. Robert Peel and Dr. Thomas Cawley on New Year's Day 1870 A racy read but a little short on detail. and substituting in part for the S.A.J.C.'s customary three-day Summer Meeting."]}, {"page": "Edward Bate Scott", "response": ["In 1856, he took over Moorna station (later occupied by John Crozier), near Wentworth, New South Wales, where in 1858 he lost everything in a fire."]}, {"page": "Members of the South Australian Legislative Council, 1865–1869", "response": ["|| John Crozier || 1867–1887 || Feb. 1877 || filled vacancy August 1867"]}, {"page": "Members of the South Australian Legislative Council, 1869–1873", "response": ["|| John Crozier || 1867–1887 || Feb. 1877 || "]}, {"page": "Members of the South Australian Legislative Council, 1873–1877", "response": ["|| John Crozier || 1867–1887 || Feb. 1877 || "]}, {"page": "Members of the South Australian Legislative Council, 1877–1881", "response": ["|| John Crozier || 1867–1887 ||  || returned 1877"]}, {"page": "Members of the South Australian Legislative Council, 1881–1885", "response": ["|| John Crozier || 1867–1887 ||  || "]}, {"page": "Members of the South Australian Legislative Council, 1885–1888", "response": ["|| John Crozier || Central ||  || 1867–1887 || re-elected 1885died 1887"]}, {"page": "William Wigley", "response": [":*Thomas Francis Wigley (c. 1854 – 14 January 1933) married Lilian Sturt Richardson on 9 October 1890. Lilian's mother was a daughter of Hon. John Crozier. Tom was a lawyer and founder of South Australian Jockey Club, for a few years part owner of Morphettville racecourse,  and Tattersalls Club official."]}, {"page": "List of South Australian Legislative Council by-elections", "response": ["|John Crozier, William Morgan, Emanuel Solomon", "|John CrozierJohn Brodie Spence"]}, {"page": "Eustace Reveley Mitford", "response": ["Mitford purchased a farming property of  Section 114, Marion Road near the site of the present Ascot Park school. John Crozier's \"Oaklands\" selection was nearby, as was Section 115 of Dr Handasyde Duncan, a fellow passenger on the Katherine Stewart Forbes. Sections 114 and 115 now comprise the suburb of Park Holme. Despite augmenting his farm income by driving a bullock team between Port Adelaide and Burra, the farming venture was not a success, and after fifteen years' toil he sold up and moved to a house on South Road, Edwardstown."]}, {"page": "J. E. Savill", "response": [":He had harsh words with John Crozier, who was acting as steward at a \"Newmarket\" race meeting conducted privately by Simeon Barnard at Morphettville on 27 December 1879. Savill apologized, but Crozier made an official complaint to the SAJC. In a series of events strongly reminiscent of the 1889 Seth Ferry — Tattersalls confrontation, the club committee convened a special meeting at which Savill was not present, and imposed on him a twelve months' ban from the course. Savill engaged prominent lawyers J. W. Downer Q.C. and C. Mann Q.C. to sue certain committee members (R. C. Baker MLC, E. M. Bagot and others), but not including Rounsevell and some others. He won the case, with costs, which would have been substantial, and continued racing at Morphettville."]}, {"page": "C. Leslie Macdonald", "response": ["St. Albans stud and racing stables in Breakwater, near Geelong was founded in 1872 by trainer James Wilson, and the homestead was completed the following year. In 1886 St Albans was purchased by John Crozier, Jr., who sold it to mining magnate W. R. Wilson four years later for a reputed £75,000. Wilson appointed Macdonald manager of the stud."]}, {"page": "Simeon Barnard", "response": ["When Barnard succeeded C. J. Coates as secretary of the South Australian Jockey Club in 1874 he found the club heavily in debt to the English, Scottish, and Australian Bank. W. B. Rounsevell, William Pile, Sir Richard Chaffey Baker, John Crozier, and Barnard elected to pay off the overdraft.", "The directors elected at the first general meeting of the Company were Sir Henry Ayers, Sir John Morphett, Thomas Elder, John Crozier, R. C. Baker, Philip Levi, Joseph Gilbert, E. W. Pitts, and H. B. Hughes, all highly influential gentlemen and racing enthusiasts.", ":History was created after the Christmas Cup when J. Eden Savill verbally abused steward John Crozier after his horse was disqualified. Savill had apologised, but refused Barnard's demand that he publicly admit to \"unsportsmanlike and ungentlemanly conduct\". In a series of events strongly reminiscent of the 1889 Seth Ferry — Tattersalls confrontation, the club committee convened a special meeting at which Savill was not present, and imposed on him a twelve months' ban from the course. Savill engaged several Q.C.s to sue certain members of that committee for penalising him without allowing him the opportunity to confront his accusers and defend himself. Savill won and was awarded costs, which would have been substantial."]}, {"page": "James Wilson (trainer)", "response": ["The property and stables were in March 1886 sold to John Crozier, jun. (1843–1916) of South Australia for a reputed £37,000."]}, {"page": "Thomas Francis Wigley", "response": [":*Thomas Francis Wigley (c. 1854 – 14 January 1933) married Lilian Sturt Richardson (1867– ) on 9 October 1890. Lilian's mother was a daughter of Hon. John Crozier."]}, {"page": "Central District (South Australian Legislative Council)", "response": ["| John Crozier"]}, {"page": "H. L. Conran", "response": ["In 1893 the brothers founded the Conran Syndicate that financed the Cosmopolitan Mines in the Menzies – Niagara area of Western Australia; other members were G. A. Stockfeld (their prospector), R. C. Baker, S. Newland, William Milne, John Crozier, A. Waterhouse, W. Thorold Grant."]}]}}