{"wiki_id": "http://www.wikidata.org/entity/Q17086678", "itemLabel": "Roger Robinson", "itemDescription": "British writer, musician and performer", "wikipedia_url": "https://en.wikipedia.org/wiki/Roger_Robinson_(poet)", "wikipedia_page": {"main": "Roger Robinson is a British writer, musician and performer who lives between England and Trinidad. His book A Portable Paradise (Peepal Tree Press) won the prestigious T. S. Eliot Prize 2019, announced in London in January 2020. He is the second writer of Caribbean heritage to win the prize, the highest value award in UK poetry, after  Derek Walcott who won the 2010 prize. Robinson's victory was also seen as an important one for small presses. A Portable Paradise was only the second book of poetry to win the Ondaatje Prize in May 2020.\n\n", "link_mentions": [{"page": "Performance poetry", "response": ["Apples and Snakes, a collective promoting performance poetry in pubs and at festivals, was started by Mandy Williams, PR Murry and Jane Addison in London in 1982 inspired by the work of New Variety/CAST. They worked with 'ranting poets' such as Attila the Stockbroker and Seething Wells and other poets and musicians with a political message such as Billy Bragg. Apples and Snakes continues today, 31 years later, as a national organisation. In the 90s, however, in big cities like Manchester and London, a different style emerged that was influenced more by hip hop with much less emphasis on comedy in the manner of Def Poets in the United States. Well-known writers from this evolution include Lemn Sissay and the late Dike Omeje from the Manchester scene and Roger Robinson and El Crisis  from the London circuit."]}, {"page": "Royal Society of Literature", "response": ["| Roger Robinson"]}, {"page": "T. S. Eliot Prize", "response": ["*2019 – Roger Robinson, A Portable Paradise", "* A Portable Paradise by Roger Robinson (Peepal Tree Press)"]}, {"page": "Black British people", "response": ["Jackie Kay, since 2016, has been Scots Makar, the national poet laureate of Scotland, poets Roger Robinson (won the prestigious T. S. Eliot Prize 2019), Benjamin Zephaniah, Linton Kwesi Johnson, Lemn Sissay, Salena Godden, Warsan Shire and Patience Agbabi, playwrights Mustapha Matura, Kwame Kwei-Armah, Roy Williams, Winsome Pinnock, Patricia Cumper and Bola Agbaje, journalists such as Gary Younge, Afua Hirsch and Ekow Eshun, and Children's Laureate Malorie Blackman. Onyeka Nubia is the author of fictional trilogy Waiting to Explode, The Black Prince, and The Phoenix, for which he won the 2009 African Achievers award for Communication and Media. Blackamoores: Africans in Tudor England, their Presence, Status and Origins is his latest book, published by Narrative Eye in 2013, in which he proves that Black people in Tudor England had free status and were not slaves. Blackamoores was runner-up in the 2013/14 People's Book Prize."]}, {"page": "Nii Parkes", "response": ["* Filigree: Contemporary Black British Poetry, Peepal Tree Press, 2018,  (includes work by Roger Robinson & Tishani Doshi)"]}, {"page": "Caribbean literature", "response": ["*Roger Robinson"]}, {"page": "1982 in poetry", "response": ["* Roger Robinson, British dub poet"]}, {"page": "Peepal Tree Press", "response": ["Peepal Tree Press has published, in various forms, such writers as T. S. Eliot Prize-winner Roger Robinson, Booker Prize-winner Bernardine Evaristo, Anthony Kellman, Emmy Award-winner Kwame Dawes, his father Neville Dawes, Aldeburgh Poetry Prize-winner and Forward Poetry Prize-nominee Christian Campbell, Jhalak Prize-winner Jacob Ross, Christine Craig, Opal Palmer Adisa, Angela Barry, Ishion Hutchinson, Dorothea Smartt, Alecia McKenzie, Una Marson, Shivanee Ramlochan, Jack Mapanje, Patience Agbabi, Linton Kwesi Johnson, Daljit Nagra, Grace Nichols, Lemn Sissay, John Agard, Vahni Capildeo, Raymond Antrobus, Keith Jarrett, Rishi Dastidar, Gemma Weekes, Pete Kalu, Maggie Harris, Courttia Newland, Jackie Kay, Jan Shinebourne, and Kamau Brathwaite."]}, {"page": "Kevin Martin (British musician)", "response": ["Martin's projects include GOD, Techno Animal, Ice, Curse of the Golden Vampire, Pressure and, most recently, King Midas Sound (with poet Roger Robinson and singer/visual artist Kiki Hitomi) and The Bug vs Earth.London Zoo review, The Wire, July 2008, p. 44.", "King Midas Sound is a musical crossover project, composed of Martin, London/Trinidad poet Roger Robinson and Japanese artist and singer Kiki Hitomi. Their first 12\" release \"(HDB014) Cool Out\" and debut album Waiting For You... are both released through Kode9's Hyperdub label. \"Meltdown\" also featured on the 5 Years Of Hyperdub CD release in 2009. Their 12\", \"Aroo,\" was released on Ninja Tune in 2013. Their second album, Solitude, a drone ambient album with Robinson's spoken word performances, was released on Valentine's Day of 2019 on Cosmo Rhythmatic."]}, {"page": "List of Trinidad and Tobago–related topics", "response": ["* Roger Robinson (poet)"]}, {"page": "Ondaatje Prize", "response": ["*2020 Roger Robinson, A Portable Paradise"]}, {"page": "Robinson (name)", "response": ["*Roger Robinson (poet), British/Trinidadian writer, musician and performer "]}, {"page": "Bernardine Evaristo", "response": ["* Roger Robinson"]}, {"page": "2010 in poetry", "response": ["* Bernardine Evaristo & Daljit Nagra. editors, Ten: New poets from Spread the Word, an anthology, with work by Mir Mahfuz Ali, Rowyda Amin, Malika Booker, Roger Robinson, Karen McCarthy, Nick Makoha, Denise Saul, Seni Seniviratne, Shazea Quraishi and Janet Kofi Tsekpo; Bloodaxe Books"]}, {"page": "Suitcase (disambiguation)", "response": ["*Suitcase, poetry collection by Roger Robinson (poet)"]}, {"page": "Roger Robinson", "response": ["Roger Robinson may refer to:", "* Roger Robinson (American football coach) (died 2004), American football player and coach", "* Roger Robinson (actor) (1940–2018), American actor", "* Roger Robinson (poet), writer and performer"]}, {"page": "Flipped eye publishing", "response": [" \"The Idea\", The Mundane Comedy.\"Sonnet Hack Pamphlet Launch\", Niall O'Sullivan. and in his lecturing work, \"teaches his students to make silences speak, neither reaching for quick laughs, nor deflecting judgment by writing verse \"steeped in righteousness\".\"National Poetry Day: The rise and rise of performance poetry\", The Independent, 6 October 2015. Jacob Sam-La Rose, a seasoned performer who runs several programmes mentoring young writers and performers,\"Meet the tutors\", Guildhall School. is also a poetry editor with flipped eye. He was shortlisted for both the Forward Prize and the Fenton Aldeburgh Prize for his first full collection, Breaking Silence,Jacob Sam-La Rose\", Arvon. demonstrating a versatility in writing and performance that is reflected in his editorial work. The guiding notion of listening does not appear to limit the sources of the work that flipped eye publishes. They have published concept-driven work from poets such as Max Wallis, narrative-led poetry by Roger Robinson, poetry that rejoices in the possibilities and sounds of language by the likes of Inua Ellams and highly experimental work such as Martin De Mello's if our love stays above the waist."]}, {"page": "List of Trinidad and Tobago writers", "response": ["* Roger Robinson"]}, {"page": "List of black British writers", "response": ["* Roger Robinson (living)"]}, {"page": "Raymond Antrobus", "response": ["Interviewed in 2016, he said: \"I've had many jobs working in removals, gyms, swimming pools, security, etc, but now I make my living off teaching and touring my poetry... and I've never felt more useful working in education as a Jamaican British poet.\" Of his beginnings as a poet, he says: \"When I realised that I wanted to pursue poetry as a career I started looking for a community. At first I came across the London Slam and Open Mic scene, which to me is more of a community than it is a genre. ... and once I found that community I felt very nurtured by it. So for me, certainly there were people like Karen McCarthy Woolfe, Jacob Sam-La Rose, and Roger Robinson who were doing a lot of mentoring at the time, but really my first poetry mentor was Malika Booker, which must have been when I was about 21.\"Robert Greer, \"Interview | Raymond Antrobus\", The London Magazine, 20 February 2019."]}, {"page": "Solitude (King Midas Sound album)", "response": ["Solitude is the fourth studio album by King Midas Sound, the musical project of British musicians Kevin Martin and Roger Robinson. It was released on 15 February (Valentine's Day) 2019 through Cosmo Rhythmatic."]}, {"page": "Afrobeat (book)", "response": ["# Roger Robinson, \"Glow\""]}, {"page": "Queen Mary Wasafiri New Writing Prize", "response": ["The 2015 judges were Susheila Nasta (Chair), Toby Litt, Yasmin Alibhai Brown and Roger Robinson."]}, {"page": "2019 in poetry", "response": ["* T. S. Eliot Prize : Roger Robinson for ‘’A Portable Paradise’’"]}]}}