{"wiki_id": "http://www.wikidata.org/entity/Q171511", "itemLabel": "Peter Gethin", "itemDescription": "British racing driver (1940-2011)", "wikipedia_url": "https://en.wikipedia.org/wiki/Peter_Gethin", "wikipedia_page": {"main": "Peter Kenneth Gethin (21 February 1940 – 5 December 2011) was a British racing driver from England. He participated in 31 World Championship Formula One Grands Prix, debuting on 21 June 1970. He won the 1971 Italian Grand Prix in the fastest average speed in Formula One history, but this was his only podium finish. Gethin also participated in numerous non-Championship Formula One races, winning the 1971 World Championship Victory Race and the 1973 Race of Champions.\nGethin also raced for Team McLaren in the 1970 Canadian-American Challenge Cup series, driving the McLaren M8D that had been driven by Dan Gurney in the first three races of the season. Gethin won one race and finished third in the 1970 championship. In 1974 Gethin won the Tasman Series, a Formula 5000 series held in Australia and New Zealand. Gethin drove a Chevron B24 Chevrolet. Gethin later ran a Formula 3000 team.", "link_mentions": [{"page": "December 5", "response": ["*2011 – Peter Gethin, English race car driver (b. 1940)"]}, {"page": "February 21", "response": ["*1940 – Peter Gethin, English racing driver (d. 2011)"]}, {"page": "McLaren", "response": ["The year  started with a second-place each for Hulme and Bruce in the first two Grands Prix, but in June, Bruce was killed in a crash at Goodwood while testing the new M8D Can-Am car. After his death, Teddy Mayer took over effective control of the team; Hulme continued with Dan Gurney and Peter Gethin partnering him. Gurney won the first two Can-Am events at Mosport and St. Jovite and placed ninth in the third, but left the team mid-season, and Gethin took over from there. While  began promisingly when Hulme led the opening round in South Africa before retiring with broken suspension, ultimately Hulme, Gethin (who left for BRM mid-season,) and Jackie Oliver again failed to score a win. The 1972 season saw improvements though: Hulme won the team's first Grand Prix for two-and-a-half years in South Africa and he and Peter Revson scored ten other podiums, the team finishing third in the Constructors' Championship. McLaren gave Jody Scheckter his Formula One debut at the final race at Watkins Glen. All McLaren drivers used the Ford-Cosworth engines, except for Andrea de Adamich and Nanni Galli who used engines from Alfa Romeo in 1970.", "When Bruce was killed testing the 1970 season's M8D, he was at first replaced by Dan Gurney, then later by Peter Gethin. They won two and one races, respectively, while Hulme won six on the way to the championship. Private teams competing in the 1970 Can-Am series included older M3Bs as well as the M12 – the customer version of the team's M8B. In the 1971 season, the team held off the challenge of 1969 world champion Jackie Stewart in the Lola T260, winning eight races, with Peter Revson taking the title. Hulme also won three Can-Am races in the 1972 season, but the McLaren M20 was defeated by the Porsche 917/10s of Mark Donohue and George Follmer. Faced by the greater resources of Porsche, McLaren decided to abandon Can-Am at the end of 1972 and focus solely on open-wheel racing. When the original Can-Am series ceased at the end of the 1974 season, McLaren was by far the most successful constructor with 43 wins.", "|align=\"left\"|  Bruce McLaren Denny Hulme Peter Gethin Dan Gurney Andrea de Adamich Nanni Galli", "|align=\"left\"|  Denny Hulme Peter Gethin Jackie Oliver"]}, {"page": "1940", "response": ["** Peter Gethin, British racing driver (d. 2011)"]}, {"page": "Denny Hulme", "response": ["The 1970 season was a difficult one for the team, as they mourned the loss of leader Bruce McLaren, who had died while pre-season testing the McLaren M8D \"Batmobile\" at the Goodwood Circuit. Teamed first with driver Dan Gurney, then with driver Peter Gethin, Hulme led the team with six wins in ten races, winning his second Can-Am Championship driving the M8D to 132 points—more than double the number of the second-place competitor. For the 1971 season Hulme's teammate was his good friend Peter Revson, who took the Can-Am crown that year with Hulme in second (three wins in ten races), driving the McLaren M8F. In his final season, Hulme drove the McLaren M20 to second place in the 1972 championship on 65 points, with two wins in the nine race season."]}, {"page": "Italian Grand Prix", "response": ["1962 saw a return to the road circuit only and the banking was never used again for Formula One. It still stands, but in decrepit condition for a long time before being restored in the early 2010s; the last time it was used was in 1969 for the 1000 kilometre sports car race that year. Briton Graham Hill won the race, and won the Drivers' Championship in South Africa soon afterward. 1963 saw an attempted use of the extremely fast full circuit again, and the drivers ran the course during Friday practice but the concrete banking was so rough and bumpy that cars were being mechanically torn apart. It was feared that there would be no finishers for the race itself. Briton Bob Anderson's Lola crashed after losing a wheel on the banking, although he was not injured); the drivers then threatened to walk off unless they raced on the road circuit only, which is what happened. Jim Clark won the race in a Lotus. Ferrari driver John Surtees won in 1964, and Briton Jackie Stewart won his first of 27 Grand Prix victories in 1965, driving for BRM. Against team orders, he fought hard with his teammate Graham Hill, Hill made a mistake at the Parabolica and Stewart was in command; this was all to the chagrin of team boss Tony Rudd. 1966 saw Italian Ludovico Scarfiotti win, and no other Italian has won the race since. 1967 was to be a race of interest and was to produce the first of three close finishes on the fast Monza circuit over the next four years. Surtees, now driving for Honda, battled with Australian Jack Brabham, and Surtees won the race by two-tenths of a second; and Clark, who had problems at the beginning of the race and lost a whole lap, stormed around the circuit, equalled his pole position time and unlapped himself to take the lead- but his fuel pump broke and he coasted over the line to finish third. 1969 saw four drivers; Stewart, Austrian Jochen Rindt, Frenchman Jean-Pierre Beltoise and New Zealander Bruce McLaren battle right down to the line. Stewart came out on top and beat Rindt by eight-hundredths of a second. The four drivers were all within two-tenths of a second of each other. With this win, Stewart won his first of three championships.1970 saw Rindt's fatal crash during qualifying at the wheel of his rear wing-less Lotus; his car suffered brake shaft failure, veered off the track, hit and went under the improperly-secured guardrail on the left and spun multiple times. Rindt died not because of the impact but because he had not properly secured his seat belts and the buckle had slit his throat. Rindt became the only posthumous world champion, after Ferrari driver Jacky Ickx failed to overhaul Rindt. Ickx's teammate Clay Regazzoni won the race, which saw 28 lead changes. 1971 was to see the third close finish in four years. Briton Peter Gethin, Swede Ronnie Peterson, Frenchman François Cevert, Briton Mike Hailwood and New Zealander Howden Ganley battled for the lead all race. On the last lap, Peterson got the inside line for the Parabolica, but Gethin got in front going alongside Peterson through the long right-hand corner, and beat Peterson to the checkered flag by the slimmest of margins; one-one hundredth of a second. Cevert and Hailwood finished within two-tenths and Ganley was half a second behind.", "|  Peter Gethin"]}, {"page": "Lola Cars", "response": ["|align=\"left\"|  Peter Gethin"]}, {"page": "British Racing Motors", "response": ["The team regrouped with Tony Southgate as designer and Rodríguez brought back into the fold to partner Oliver, and gained its first V12 victory when Rodríguez won the 1970 Belgian Grand Prix in a P153, with further victories for Jo Siffert and Peter Gethin in 1971 in the P160. The team had reached one of its intermittent peaks of success. Sadly both Siffert and Rodríguez were killed before the 1972 season and the team had to regroup completely again. Their last World Championship victory came when Jean-Pierre Beltoise drove a stunning race to win the rain-affected 1972 Monaco Grand Prix with the P160. He also won the non-championship 1972 World Championship Victory Race later in the year.  The  campaign was generally chaotic: having acquired major sponsorship, Louis Stanley originally planned to field up to six cars (three for established drivers, three for paying journeymen and young drivers) of varying designs including P153s, P160s and P180s and actually ran up to five for a mix of paying and paid drivers until it became obvious that it was completely overstretched and the team's sponsors insisted that the team should cut back to a more reasonable level and only three cars were run in 1973 for Beltoise, Lauda, and Regazzoni.", "|  Peter Gethin"]}, {"page": "Cosworth DFV", "response": ["|align=\"left\"|  Peter Gethin", "|align=\"left\"|  Peter Gethin"]}, {"page": "Brands Hatch", "response": ["Easter Monday 1969 saw another brainchild of John Webb and the BRSCC's Competitions Director Nick Syreett come to fruition. This was Formula 5000 which was based upon the American Formula A, the cars being single-seater chassis powered by American V8 and V6 stock-block engines of up to 5-litre capacity. The need for the new formula was caused by the escalating costs of Formula Three, Formula Two and the decreasing number of non-championship Formula One events as more and more countries demanded a Grand Prix. The winner of the first Formula 5000 race was Peter Gethin driving a McLaren M10A with Chevrolet power.", "The following year, 1973, was less hectic; the BOAC 1000 was cancelled when the date offered by the FIA was unsuitable, and the year had an unfortunate Race of Champions. Peter Gethin driving a Formula 5000 Chevron-Chevrolet B24 beat the Formula One cars and James Hunt made his F1 debut in Hesketh Racing's March 731. Before the start of that season, £50,000 was spent upon a new grandstand adjoining the Grovewood Suite, while opening seating and new pits were built to comply with FIA requirements. There were also improvements made between Westfields and Stirlings."]}, {"page": "1970 Dutch Grand Prix", "response": ["| Peter Gethin", "|  Peter Gethin", "*This was the first race for future-grand prix winners Clay Regazzoni, François Cevert and Peter Gethin."]}, {"page": "1970 German Grand Prix", "response": ["| Peter Gethin", "|  Peter Gethin"]}, {"page": "1970 Austrian Grand Prix", "response": ["| Peter Gethin", "|  Peter Gethin"]}, {"page": "1970 Italian Grand Prix", "response": ["| Peter Gethin", "|  Peter Gethin"]}, {"page": "1970 Canadian Grand Prix", "response": ["| Peter Gethin", "|  Peter Gethin"]}, {"page": "1970 United States Grand Prix", "response": ["| Peter Gethin", "|  Peter Gethin"]}, {"page": "1970 Mexican Grand Prix", "response": ["| Peter Gethin", "|  Peter Gethin"]}, {"page": "1971 South African Grand Prix", "response": ["|  Peter Gethin", "|  Peter Gethin"]}, {"page": "1971 Spanish Grand Prix", "response": ["|  Peter Gethin", "|  Peter Gethin"]}, {"page": "1971 Monaco Grand Prix", "response": ["|  Peter Gethin", "|  Peter Gethin"]}, {"page": "1971 Dutch Grand Prix", "response": ["|  Peter Gethin", "|  Peter Gethin"]}, {"page": "1971 French Grand Prix", "response": ["|  Peter Gethin", "|  Peter Gethin"]}, {"page": "1971 British Grand Prix", "response": ["|  Peter Gethin", "|  Peter Gethin"]}, {"page": "1971 German Grand Prix", "response": ["File:1971 Peter Gethin, McLaren.jpg|Peter Gethin in a McLaren M19A", "|  Peter Gethin", "|  Peter Gethin"]}, {"page": "1971 Austrian Grand Prix", "response": ["|  Peter Gethin", "|  Peter Gethin"]}, {"page": "1971 Italian Grand Prix", "response": ["This race featured the closest finish in Formula One history, as Peter Gethin beat Ronnie Peterson by 0.01 seconds.All-Time F1 Records Times in this race were only measured to the nearest hundredth of a second (0.01 seconds), so the finish may or may not have been closer than that of the 2002 United States Grand Prix, where Rubens Barrichello beat Michael Schumacher by 0.011 seconds. The top five were covered by just 0.61 seconds, with François Cevert finishing third, Mike Hailwood fourth and Howden Ganley fifth. With an average speed of , this race stood as the fastest-ever Formula One race for 32 years, until the 2003 Italian Grand Prix at Monza.", "Clay Regazzoni's Ferrari thrilled the crowd by surging forward from the fourth row to lead from Jo Siffert and Stewart until lap 3, when Ronnie Peterson took the lead. On lap 7, Stewart took the lead. By lap 16, Stewart and Jacky Ickx retired with engine problems, followed two laps later by Clay Regazzoni. The race began to break into high-speed packs—the leading one containing Hailwood (leading on his debut), François Cevert, Peterson, Siffert, Howden Ganley, Chris Amon, Peter Gethin and Jackie Oliver. Gethin, Peterson, Cevert, Hailwood and Ganley (who fell back slightly) battled right down to the line and all finished within two-tenths of a second of each other.", "|  Peter Gethin", "|  Peter Gethin"]}, {"page": "1971 Canadian Grand Prix", "response": ["|Peter Gethin", "|  Peter Gethin"]}, {"page": "1971 United States Grand Prix", "response": ["|Peter Gethin", "|  Peter Gethin"]}, {"page": "1972 Argentine Grand Prix", "response": ["|  Peter Gethin", "|  Peter Gethin"]}, {"page": "1972 South African Grand Prix", "response": ["|  Peter Gethin", "|  Peter Gethin"]}, {"page": "1972 Spanish Grand Prix", "response": ["|Peter Gethin", "|  Peter Gethin"]}, {"page": "1972 Monaco Grand Prix", "response": ["|Peter Gethin", "|  Peter Gethin"]}, {"page": "1972 Belgian Grand Prix", "response": ["|Peter Gethin", "|  Peter Gethin"]}, {"page": "1972 French Grand Prix", "response": ["|Peter Gethin", "|  Peter Gethin"]}, {"page": "1972 British Grand Prix", "response": ["|Peter Gethin", "|  Peter Gethin"]}, {"page": "1972 Austrian Grand Prix", "response": ["|Peter Gethin", "|  Peter Gethin"]}, {"page": "1972 Italian Grand Prix", "response": ["|  Peter Gethin", "|  Peter Gethin"]}, {"page": "1972 Canadian Grand Prix", "response": ["|  Peter Gethin", "|  Peter Gethin"]}, {"page": "1972 United States Grand Prix", "response": ["|  Peter Gethin", "|  Peter Gethin"]}, {"page": "1973 Canadian Grand Prix", "response": ["|  Peter Gethin", "|  Peter Gethin"]}, {"page": "1974 British Grand Prix", "response": ["|  Peter Gethin", "|  Peter Gethin"]}, {"page": "1975 Dutch Grand Prix", "response": ["On lap 43, Jarier spun when a tyre burst. Lauda now pursued Hunt desperately for over 20 laps, putting him under immense pressure. Hunt had cracked under similar pressure in Buenos Aires, but this time he resisted. The Ferrari managed to gain on the slow corners, but Hunt pulled ahead on the fast corners and down the straight. The TV directors were so confused that the captions showed three laps left to go when a massive roar from the grandstands signalled it was all over. Hunt became the first Englishman since Peter Gethin to win a Grand Prix."]}]}}