{"wiki_id": "http://www.wikidata.org/entity/Q171422", "itemLabel": "John Watson", "itemDescription": "British racecar driver", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Watson_(racing_driver)", "wikipedia_page": {"main": "John Marshall Watson,  (born 4 May 1946) is a British former racing driver and current commentator from Northern Ireland. He competed in Formula One, winning five Grands Prix and was third in the 1982 championship. He also competed in the World Sportscar Championship finishing second in the 1987 championship. After his retirement from motorsport, he became a commentator for Eurosport's coverage of Formula One from 1989 to 1996. He currently commentates on the GT World Challenge Europe.", "link_mentions": [{"page": "Brabham", "response": ["While rival teams Lotus and McLaren relied on the Cosworth DFV engine from the late 1960s to the early 1980s, Ecclestone sought a competitive advantage by investigating other options. Despite the success of Murray's Cosworth-powered cars, Ecclestone signed a deal with Italian motor manufacturer Alfa Romeo to use their large and powerful flat-12 engine from the 1976 season. The engines were free, but they rendered the new BT45s, now in red Martini Racing livery, unreliable and overweight.Henry (1985) pp. 159–161 At that time, designer David North was hired to work alongside Murray. The 1976 and 1977 seasons saw Brabham fall toward the back of the field again. Reutemann negotiated a release from his contract before the end of the 1976 season and signed with Ferrari. Ulsterman John Watson replaced him at Brabham for 1977. Watson lost near certain victory in the French Grand Prix (Dijon) of that year when his car ran low on fuel on the last lap and was passed by Mario Andretti's Lotus, with Watson's second place being the team's best result of the season. The car often showed at the head of races, but the unreliability of the Alfa Romeo engine was a major problem. The team lost Pace early in the 1977 season when he died in a light aircraft accident.Henry (1985) pp. 164, 167", "Brabham made one car for Formula 5000 racing, the Brabham BT43. Rolled out in late 1973 it was tested in early 1974 by John Watson at Silverstone before making its debut at the Rothmans F5000 Championship Round at Monza on 30 June 1974, driven by Martin Birrane. Former Australian Drivers' Champion Kevin Bartlett used the Chevrolet powered Brabham BT43 to finish 3rd in the 1978 Australian Drivers' Championship including finishing 5th in the 1978 Australian Grand Prix.", "| Carlos ReutemannWilson FittipaldiAndrea de AdamichRolf StommelenJohn Watson", "| Carlos PaceJohn WatsonHans-Joachim StuckGiorgio Francia", "| Niki LaudaJohn WatsonNelson Piquet"]}, {"page": "Belfast", "response": ["Leander ASC is a well known swimming club in Belfast. Belfast produced the Formula One racing stars John Watson who raced for five different teams during his career in the 1970s and 1980s and Ferrari driver Eddie Irvine."]}, {"page": "May 4", "response": ["*  1946   – John Watson, British race car driver"]}, {"page": "McLaren", "response": ["In , the M23 was gradually replaced with the M26, the M23's final works outing being Gilles Villeneuve's Formula One debut with the team in a one-off appearance at the British Grand Prix. Hunt won on three occasions that year, but the Lauda and Ferrari combination proved too strong, Hunt and McLaren managing just fifth and third in the respective championships. From there, results continued to worsen. Lotus and Mario Andretti took the  titles with their 78 and 79 ground-effect cars and neither Hunt nor Mass's replacement Patrick Tambay were able to seriously challenge with the nonground-effect M26. Hunt was dropped at the end of 1978 in favour of Lotus's Ronnie Peterson, but when Peterson was killed by a crash at the Italian Grand Prix, John Watson was signed, instead. No improvement occurred in ; Coppuck's M28 design was described by Mayer as \"ghastly, a disaster\" and \"quite diabolical\" and the M29 did little to change the situation. Tambay scored no points and Watson only 15 to place the team eighth at the end of the year.", "|align=\"left\"|  John Watson Patrick Tambay", "|align=\"left\"|  John Watson Alain Prost Stephen South", "|align=\"left\"|  John Watson Andrea de Cesaris", "|align=\"left\"|  John Watson Niki Lauda", "|align=\"left\"|  John Watson Niki Lauda", "|align=\"left\"|  Niki Lauda John Watson Alain Prost"]}, {"page": "Northern Ireland", "response": ["Although Northern Ireland lacks an international automobile racecourse, two Northern Irish drivers have finished inside the top two of Formula One, with John Watson achieving the feat in the 1982 Formula One season and Eddie Irvine doing the same in 1999 Formula One season. The largest course and the only Motor Sports Association-licensed track for UK-wide competition is Kirkistown Circuit."]}, {"page": "Nürburgring", "response": ["To celebrate its opening, an exhibition race was held on 12 May. The 1984 Nürburgring Race of Champions featured an array of notable drivers driving identical Mercedes 190E 2.3–16's: the line-up was Elio de Angelis, Jack Brabham (Formula 1 World Champion 1959, 1960, 1966), Phil Hill (1961), Denis Hulme (1967), James Hunt (1976), Alan Jones (1980), Jacques Laffite, Niki Lauda (1975, 1977)*, Stirling Moss, Alain Prost*, Carlos Reutemann, Keke Rosberg (1982), Jody Scheckter (1979), Ayrton Senna*, John Surtees (1964) and John Watson. [Drivers marked with * won the Formula 1 World Championship subsequent to the race]. Senna won ahead of Lauda, Reutemann, Rosberg, Watson, Hulme and Jody Scheckter, being the only one to resist Lauda's performance who – having missed the qualifying – had to start from the last row and overtook all the others except Senna. There were nine former and two future Formula 1 World Champions competing, in a field of 20 cars with 16 Formula 1 drivers; the other four were local drivers: Klaus Ludwig, Manfred Schurti, Udo Schütz and Hans Herrmann."]}, {"page": "1946", "response": ["* May 4 – John Watson, Northern Irish racecar driver"]}, {"page": "Alain Prost", "response": ["Prost began his career with McLaren (being run by Teddy Mayer) in 1980 alongside Ulsterman John Watson. On his debut in Buenos Aires, Argentina, he finished in sixth place, earning one point, something achieved by only a handful of drivers. Prost added four more points to his tally during the season, scoring points at Interlagos, Brands Hatch and Zandvoort. Prost finished the year 15th in the Drivers' Championship, equalling points with former world champion Emerson Fittipaldi. Despite the encouraging debut season, Prost had several accidents, breaking his wrist during practice at Kyalami and suffering a concussion during practice at Watkins Glen. He also retired from the Canadian round in Montreal a week earlier because of rear suspension failure. At the end of the season, despite having two years remaining on his contract, he left McLaren and signed with Renault. Prost has said that he left because of the large number of breakages on the car and because he felt the team blamed him for some of the accidents.", "Prost was partnered with fellow Frenchman René Arnoux for . Motor sports author Nigel Roebuck reports that there were problems between Prost and Arnoux from the start of the season, Prost being immediately quicker than his more experienced teammate.Roebuck, Nigel Grand Prix Greats 1986, p. 129. Book Club Associates  He did not finish the first two Grands Prix, due to collisions with Andrea de Cesaris in Long Beach and Didier Pironi at Jacarepaguá, but scored his first podium finish at Buenos Aires. He also did not finish in the next four races, and then won his first Formula One race at his home Grand Prix in France at the fast Dijon circuit, finishing two seconds ahead of his old teammate John Watson."]}, {"page": "Niki Lauda", "response": ["The 1983 season proved to be transitional for the McLaren team as they were making a change from Ford-Cosworth engines, to TAG-badged Porsche turbo engines, and Lauda did not win a race that year, with his best finish being second at Long Beach behind his teammate John Watson. Some political maneuvering by Lauda forced a furious chief designer John Barnard to design an interim car earlier than expected to get the TAG-Porsche engine some much-needed race testing; Lauda nearly won the last race of the season in South Africa.", "The 1985 season was a disappointment for Lauda, with eleven retirements from the fourteen races he started. He did not start the Belgian Grand Prix at Spa-Francorchamps after crashing and breaking his wrist during practice, and he later missed the European Grand Prix at Brands Hatch; John Watson replaced him for that race. He did manage fourth at the San Marino Grand Prix, 5th at the German Grand Prix, and a single race win at the Dutch Grand Prix where he held off a fast-finishing Prost late in the race. This proved to be his last Grand Prix victory, as after announcing his impending retirement at the 1985 Austrian Grand Prix, he retired for good at the end of that season."]}, {"page": "John Watson", "response": ["*John Watson (16th-century MP) (fl. 1547–1554), Member of Parliament for Morpeth, Newcastle upon Tyne and Berwick-upon-Tweed", "*Sir John Watson (advocate) (John Charles Watson, 1883–1944), Scottish advocate and sheriff, Solicitor General for Scotland 1929–31", "*John Watson (Australian politician) (born 1937), former Australian senator", "*John Watson (Skipton MP) (born 1943), British Member of Parliament for Skipton, 1979–1989", "*John Watson (New Zealand politician) (fl. 2010–present), Auckland Councillor (2015–present)", "*John Watson (Queensland politician) (1833–?), member of the Queensland Legislative Assembly", "*John Watson (Virginia politician) (died 1870), African-American politician in Virginia", "*Sir John Watson (Indian Army officer) (1829–1919), English recipient of the Victoria Cross in 1857", "*John Watson (American painter) (1685–1768), American portrait artist", "*John Watson, later Sir John Watson Gordon (1788–1864), Scottish painter", "*John Watson (English artist) (born 1971), English artist and comicbook artist", "*John Watson (American football) (born 1949), former NFL offensive lineman", "*John Watson (bowls) (born 1945), former Scottish lawn and indoor bowler", "*John Watson (boxer) (born 1983), British lightweight boxer", "*John Watson (cricketer, born 1828) (1828–1920), Australian cricketer who made one appearance for Tasmania", "*John Watson (Somerset cricketer) (1910–1980), English cricketer who made 19 appearances for Somerset", "*John Watson (curler) (c. 1914–1974), Canadian curler", "*John Watson (cyclist) (born 1947), British Olympic cyclist", "*John Watson (equestrian) (born 1952), Irish Olympic equestrian", "*John Watson (footballer, born 1877) (1877–?), Scottish football player (Everton)", "*John Watson (footballer, born 1942), football player (Chester City)", "*John Watson (footballer, born 1959), football player (Fulham)", "*John Watson (golfer), American golfer", "*Sir John Watson (polo), British polo player", "*John Watson (racing driver) (born 1946), British Formula One driver", "*John Watson, known as Wonko the Sane, character from the novel So Long, and Thanks For All the Fish by Douglas Adams", "*John Watson (Master of Christ's College, Cambridge) (died 1537), priest, academic, and Vice-Chancellor of Cambridge University", "*John Watson (bishop) (1520–c.1584), Bishop of Winchester", "*John Watson (officer of arms), English 17th century Bluemantle Pursuivant", "*John Watson (antiquary) (1725–1783), English clergyman and antiquary", "*John Watson (priest) (1767–1839), English clergyman", "*John Watson (college president) (1771–1802), first president of Jefferson College, Pennsylvania", "*John Watson (philosopher) (1847–1939), Canadian philosopher and academic", "*John Watson (1850–1907), Scottish theologian and author who wrote under the pseudonym Ian Maclaren", "*John Watson (1914–2007), known as Adam Watson, British international relations theorist and researcher, and ambassador", "*John Watson (activist) (died 2001), American black activist and editor", "*John Watson (film producer), English film producer"]}, {"page": "Gilles Villeneuve", "response": ["Several drivers stopped and rushed to the scene. John Watson and Derek Warwick pulled Villeneuve, his face blue, from the catch fence.Fearnley (May 2007) The first doctor arrived within 35 seconds to find that Villeneuve was not breathing, although his pulse continued; he was intubated and ventilated before being transferred to the circuit medical centre and then by helicopter to University St Raphael Hospital in Leuven where a fatal fracture of the neck was diagnosed.Watkins (1997) pp.96–98 Villeneuve was kept alive on life support while his wife travelled to the hospital and the doctors consulted specialists worldwide. He died at 21:12 CEST (UTC+2). An inquiry into the accident was led by Derek Ongaro, the Fédération Internationale du Sport Automobile (FISA) safety inspector. It concluded that an error from Villeneuve caused him to strike Mass' car and exonerated the latter of any responsibility for the accident."]}, {"page": "Nigel Mansell", "response": ["De Angelis was then promoted back to outright number one for the 1983 season. This was demonstrated by the fact that he had exclusive use of the quick but unreliable Renault turbo-charged 93T for the whole season, and Mansell did not get to drive a turbocharged car until the ninth round, the British Grand Prix at Silverstone, a race where he climbed from 16th to second and eventually finished fourth in a brand-new, hastily designed 94T. Due to their tumultuous relationship and a lack of decent results, Warr was not keen on honouring the last year of the contract that Mansell had signed with Chapman. However, with encouragement from Lotus's sponsors, John Player Special (who allegedly preferred a British driver), and with the only other remaining top British driver (Derek Warwick, after John Watson's retirement) already confirmed to be joining the factory Renault team, it was announced Mansell would be staying with the team."]}, {"page": "Canadian Grand Prix", "response": ["The first winner in Montreal was Quebec native Villeneuve, driving a Ferrari. 1979 saw circuit layout modifications to make it faster, and Australian Alan Jones win, and he then won the 1980 race and the Drivers' Championship that year. 1980 also saw a big startline pile-up with involved Jones's Brazilian championship rival Nelson Piquet after he and Jones collided going into the very fast Droit du Casino corner. Piquet jumped into his spare car with a more powerful qualifying engine; but the engine blew up and Piquet retired from the race. Frenchman Jean-Pierre Jabouille's season and F1 racing career came to an end when he crashed his Renault head-on into a tire wall. He had badly broken legs; it took the tall Frenchman months to recover. 1981 saw a rain-soaked event in which near end of the race, Villeneuve demonstrated his car control skill when the front wing of his Ferrari was askew from a crash and he drove on to third place with the car in this condition. Frenchman Jacques Laffite took what was to be his last F1 victory, followed by Briton John Watson and Villeneuve."]}, {"page": "James Hunt", "response": ["Lauda's injuries kept him out of the following two races, allowing Hunt to close the gap in the championship chase. At Zandvoort, Hunt overtook Ronnie Peterson on the 12th lap and resisted pressure from John Watson to win.\"Dutch Grand Prix Hunt's Birthday Gift.\"The Pittsburgh Press, 30 August 1976, p. 18. At the Italian Grand Prix, the big story was Lauda's miraculous return from his Nürburgring accident. At a circuit that should have suited Hunt's car, the Texaco fuel McLaren were using was tested and although apparently legal, their cars, and those of the Penske team, were judged to contain a higher octane level than allowed. Subsequently, both teams were forced to start from the rear of the grid. While trying to make his way up the field, Hunt spun off, while a returning Lauda finished fourth. At the next round in Canada, Hunt found out that he had been disqualified from the British Grand Prix and Lauda had been awarded the victory and thus received three additional points. A furious Hunt drove a very hard race at the challenging Mosport Park circuit and won. And at the penultimate round in the United States at the daunting Watkins Glen track, Hunt started from pole and took victory after a close battle with Jody Scheckter.\"Hunt Captures US Grand Prix; Ickx Injured.\" The Milwaukee Sentinel, 11 October 1976, p. 9B.", "The season did not start well for Hunt. The McLaren M26 was problematic in the early part of the season, during which Niki Lauda, Mario Andretti and Jody Scheckter took a considerable lead in the Drivers' Championship. Towards the end of the year Hunt and the McLaren M26 were quicker than any rival combination other than Mario Andretti and the Lotus 78. Hunt won in Silverstone after trailing the Brabham of John Watson for 25 laps.\"James Hunt Wins Grand Prix Event.\"Sarasota Herald-Tribune, 18 July 1977, p. 2C. He then took a further victory at Watkins Glen. At the Canadian Grand Prix, Hunt retired after a collision with team-mate Jochen Mass and was fined $2000 for assaulting a marshal and $750 for walking back to the pit lane in an \"unsafe manner\".Williamson, Martin. \"'Hunt the punch'.\" ESPN, 11 June 2010. Retrieved 12 October 2012. In Fuji, Hunt won the race but did not attend the podium ceremonyMedland, Chris. \"Fuji's failed finale\".ESPN, 4 October 2011. Retrieved 17 November 2012. resulting in a fine of $20,000.\"Hunt snubs Grand Prix ceremony.\" The Age, 25 October 1977, p. 38. He finished fifth in the World Drivers' Championship."]}, {"page": "List of sports announcers", "response": ["* John Watson – Eurosport 1990–1997, ESPN 1997–1998, BBC Sport 1998–2001, Sky Sports 2002–present, GT World 2016–present"]}, {"page": "British Grand Prix", "response": ["1975 saw a chicane added to Woodcote to slow cars going through the very high-speed corner; and this was another race of variables as a rainstorm hit the track and a number of drivers including Scheckter and Briton James Hunt hydroplaned off the track at the same corner; Fittipaldi won the race after it was called short.  1976 also saw changes to Brands Hatch including making the fearsome Paddock Hill bend a bit tamer and South Bank corner more of a left-hand apex rather than a long hairpin. This race proved to be very controversial; as home favourite Hunt won the race but was later disqualified following a protest from Ferrari and other teams about Hunt not completing the first lap of the race; and the victory went to second-placed Lauda. 1977 saw Hunt take victory without any controversy and when F1 returned to Silverstone two years later, Australian Alan Jones lapped the circuit more than 6 seconds inside the lap record in his ground-effect Williams. His teammate Clay Regazzoni won the race, Williams's first F1 victory. 1980 saw Jones win after the Ligiers of Jacques Laffite and Didier Pironi retired; and 1981 saw French rising star Alain Prost thoroughly dominate the first part race in his Renault; and there was an accident involving Canadian Gilles Villeneuve at the Woodcote Chicane which held up Briton John Watson; but Watson passed several cars and won the race; the first for a car with an all-carbon fibre chassis. 1982 saw polesitter Keke Rosberg having to start from the back due to problems with his Williams and he began a charge that brought him far up the field; but he retired, and there was another spectacular showing from Briton Derek Warwick in his underfunded Toleman; he managed to pass Pironi for 2nd, but he also retired with a broken driveshaft; the victory went to Austrian Lauda.", "|  John Watson"]}, {"page": "Belgian Grand Prix", "response": ["Gilles Villeneuve died during practice at Zolder in 1982 after a collision with West German Jochen Mass going into the fast Butte corner. Villeneuve's Ferrari flipped a number of times and the Canadian was thrown out of his car during the accident; he was severely injured and died during the night at a hospital near the circuit. John Watson won the race for McLaren.", "|  John Watson"]}, {"page": "Ronnie Peterson", "response": ["In the days after the race, many drivers on circuit stated that the race starter lit the green light for the race too early. Although a Formula One start is meant to be a standing start for all cars in the field, the early green light meant that cars in the rear rows were still rolling when the green light came on. This resulted in cars in the back getting a jump on those at the front, and an accordion effect as the cars approached the first chicane, bunching them tightly together. The front four, Andretti, Gilles Villeneuve, Jean-Pierre Jabouille and Niki Lauda, were far enough ahead to avoid any drama, but Peterson had made a poor start from the third row of the grid, and was immediately passed by Alan Jones, Jacques Laffite and John Watson.", "At his funeral, the pallbearers included Åke Strandberg, James Hunt, Jody Scheckter, John Watson, Emerson Fittipaldi, Gunnar Nilsson and Niki Lauda."]}, {"page": "Eddie Irvine", "response": ["Irvine was born on 10 November 1965 in Newtownards, County Down in Northern Ireland, to Edmund Sr. and Kathleen. He grew up in the village of Conlig and was educated at Regent House Grammar School in Newtownards. He has one older sister, Sonia, who acted as Irvine's physiotherapist until 1999. Irvine's first taste of motorsport came when his family spent their holidays attending the British Grand Prix. His father also raced in single-seaters for fun. His childhood hero was countryman John Watson."]}, {"page": "Jordan Grand Prix", "response": ["Jordan's success in lower formulae inspired the creation of a Formula One programme for the  season and a change of name to Jordan Grand Prix. The first driver to test a Jordan F1 car was John Watson. Jordan hired Italian veteran Andrea de Cesaris and Belgian Bertrand Gachot to race his first cars, which were powered by Ford. The team had a very solid debut finishing 5th in the Constructors' Championship, with de Cesaris finishing 9th in the Drivers' Championship. De Cesaris ran second for much of the Belgian Grand Prix, and was actually gaining on leader Ayrton Senna until the car failed in the closing laps. Gachot failed to end the season after being sent to prison for attacking a taxi driver. Gachot was replaced for the  by Michael Schumacher, for whom the team received $150,000 from Mercedes-Benz who were keen to give their young German sportscar star experience of Grand Prix racing in readiness for the firm's future F1 ambitions. Despite Jordan's signed agreement in principle with Mercedes for the remainder of the season, Schumacher was signed by Benetton-Ford for the following race. Jordan applied for an injunction in the UK courts to prevent Schumacher driving for Benetton, but lost the case as they had not yet signed a contract. Future Champ Car title winner Alessandro Zanardi and ousted Benetton driver Roberto Moreno filled the second car afterwards."]}, {"page": "Italian Grand Prix", "response": ["The Italian Grand Prix returned to Monza for 1981, and it has stayed there ever since. The Imola circuit was not to leave Formula One, it hosted the San Marino Grand Prix from 1981 to 2006. The 1981 Italian Grand Prix was won by rising star Alain Prost, and that race saw Briton John Watson have a huge accident at the second Lesmo Curve which also took out Italian Michele Alboreto. Watson was uninjured in his carbon-fibre McLaren. 1982 was won by Prost's teammate René Arnoux; and Prost also won the exciting 1985 event, this time driving a McLaren."]}, {"page": "Silverstone Circuit", "response": ["The 1977 British Grand Prix saw the beginning of a revolution in Formula One, for towards the back of the grid was the product of Règie Renault which was exploiting a rule in F1 regulations that allowed the use of 1.5-litre turbocharged engines. The Renault RS01 expired early in the race. Ulsterman John Watson had an early battle with James Hunt, but the fuel system in Watson's Brabham-Alfa Romeo let him down and the winner Hunt (McLaren M26) won at a speed of , with Niki Lauda second for Ferrari from Gunnar Nilsson in a Lotus.", "1981 saw the arrival of the one-one-one grid, staggered in two rows. The turbocharged era saw Renault occupying the front row of the grid, and turbo-engined Ferraris fourth and eighth. The Renaults dominated the race, but total reliability was still lacking and the victory went to John Watson in a McLaren MP4/1. Second place went to Carlos Reutemann in the Williams FW07C from the Talbot-Ligier JS17 of Jacques Laffite, a lap down; the race speed was down a little at ."]}, {"page": "Surtees", "response": ["Low on money for , the team pared back to a single car for John Watson (although a second car was entered for Dave Morgan at Silverstone). The season was a tremendous struggle for Surtees, with no points scored, and the team missed three of the final four races. 1976 was much better, however, as Surtees landed a well-known, but otherwise controversial sponsorship deal with Durex condoms, and Australian Alan Jones joined the team. Jones finished fifth in Belgium and at Brands Hatch, and fourth in Japan. A second car, with Chesterfield sponsorship, was entered for American Brett Lunger, while a customer car was raced by Frenchman Henri Pescarolo during the second half of the season. With seven points, Surtees placed tenth in the Constructors' Championship.", "File:John Watson TS16.jpg|John Watson in the TS16 at the 1975 British Grand Prix.", "* TS16 1974-1975 Formula One. Based on the TS14, but overweight and with less than top notch DFV engines. The team also failed to engage a single major sponsor for 1974 so money was tight to say the least.  Only a single car was run and to cap off a truly terrible year driver Helmuth Koinigg was killed during the 1974 United States Grand Prix at Watkins Glen. The car was run again in 1975 and John Watson scored in three non-Championship events, but no championship points were scored.", "|align=\"left\"|  John Watson"]}, {"page": "History of Formula One", "response": ["After several years in darkness McLaren merged with Ron Dennis's Formula Two Project-4 team. The McLaren MP4/1 (McLaren Project-4) introduced the first carbon fiber composite chassis in 1981, an innovation which, despite initial doubts over its likely performance in a crash, had been taken up by all the teams by the middle of the decade. The use of carbon fibre composite in place of aluminium honeycomb produced cars that were significantly lighter, yet also far stiffer which improved grip and therefore cornering speed. Significant skepticism regarding the use of carbon fiber chassis remained, but John Watson's 1981 crash in the MP4/1 showed that the new technology was sufficiently safe, with the violent accident leaving Watson unscathed, where similar previous incidents had resulted in death or serious injury."]}, {"page": "Lewis Hamilton", "response": ["Following Hamilton clinching a sixth World Drivers' Championship title in , ex-Formula One driver and pundit Johnny Herbert acclaimed Hamilton as the greatest driver ever, a sentiment echoed by his Mercedes team-boss Toto Wolff, who described him as \"maybe the best driver that has ever existed\", while Formula One staff writer, Greg Stuart, described Hamilton as \"arguably the most complete Formula [One] driver ever\". After Hamilton won his seventh title in 2020, John Watson stated that Hamilton \"is, by a million miles, the greatest driver of his generation and you can argue he will go on to be the greatest Formula One driver of all time\", and highlighted his fearlessness as being key to his success, as evidenced by his performance against double world champion team-mate Alonso in his rookie season and his decision to leave McLaren for Mercedes. Herbert compared Hamilton to tennis player Roger Federer and golfer Tiger Woods."]}]}}