{"wiki_id": "http://www.wikidata.org/entity/Q171783", "itemLabel": "Rupert Keegan", "itemDescription": "racecar driver", "wikipedia_url": "https://en.wikipedia.org/wiki/Rupert_Keegan", "wikipedia_page": {"main": "Rupert Keegan (born 26 February 1955 in Westcliff-on-Sea, Essex) is a former racing driver from England. He participated in 37 Formula One World Championship Grands Prix, debuting on 8 May 1977. He scored no championship points.\nKeegan won the 1976 British Formula 3 Championship, which propelled him into Formula One.  After seasons with Hesketh and Surtees, neither of them particularly competitive teams, he won the Aurora Formula One Championship in 1979. A return to the Formula One World Championship with RAM driving their Williams FW07B yielded little in the way of results, as did a few races with March.\nAfter Formula One, Keegan raced in the United States in CART, and also in endurance racing.  After his retirement, he pursued business interests and also worked as a racing instructor.", "link_mentions": [{"page": "Williams Grand Prix Engineering", "response": ["|align=\"left\"|  Rupert Keegan Kevin Cogan Geoff Lees"]}, {"page": "Renault in Formula One", "response": ["The team's poor qualifying form returned in Italy, as Jabouille qualified 20th. He ran outside the top 10 until his engine failed on lap 24, continuing their awful run of reliability. Things improved at Watkins Glen for the  as Jabouille qualified 14th, but the good pace from Zandvoort seemed to be gone as he once again ran outside the top 10 before retiring with yet another reliability problem, this time the alternator, on lap 31. Jabouille failed to qualify in Canada; as 27 drivers entered the race, only one would not qualify, and this was Jabouille as he ended up last, over 7.5 seconds behind the fastest qualifier Mario Andretti of Lotus, and almost two seconds behind his nearest rival, Rupert Keegan in the Hesketh. After this, Renault did not travel to the season finale in Japan."]}, {"page": "Rupert (name)", "response": ["* Rupert Keegan (born 1955), English Formula One driver "]}, {"page": "Surtees", "response": ["Jones's success resulted in him leaving the team for the emerging Shadow team, and money problems forced Surtees to run one car regularly again in 1977, this time for Vittorio Brambilla. Brambilla's season was effective, also finishing in the points three times. Still, his good results did not prevent Surtees from further monetary troubles. In 1978, the team added a second car for pay driver, Briton Rupert Keegan, but the money problems continued. A lack of decent results caused further problems.", "|align=\"left\"|  Rupert Keegan"]}, {"page": "1977 Spanish Grand Prix", "response": ["|  Rupert Keegan", "|  Rupert Keegan"]}, {"page": "1977 Monaco Grand Prix", "response": ["| Rupert Keegan", "|  Rupert Keegan"]}, {"page": "1977 Belgian Grand Prix", "response": ["| Rupert Keegan", "|  Rupert Keegan"]}, {"page": "1977 Swedish Grand Prix", "response": ["|  Rupert Keegan", "|  Rupert Keegan"]}, {"page": "1977 French Grand Prix", "response": ["|  Rupert Keegan", "|  Rupert Keegan"]}, {"page": "1977 British Grand Prix", "response": ["|  Rupert Keegan", "|  Rupert Keegan"]}, {"page": "1977 German Grand Prix", "response": ["| Rupert Keegan", "|  Rupert Keegan"]}, {"page": "1977 Austrian Grand Prix", "response": ["| Rupert Keegan", "|  Rupert Keegan"]}, {"page": "1977 Dutch Grand Prix", "response": ["|  Rupert Keegan", "|  Rupert Keegan"]}, {"page": "1977 Italian Grand Prix", "response": ["|  Rupert Keegan", "|  Rupert Keegan"]}, {"page": "1977 Canadian Grand Prix", "response": ["There was drama in the final four laps. On lap 77, Andretti's engine blew and laid oil in turn 9 as he pulled into the pits. Patrese spun his Shadow in the turn 9 oil and into the second Hesketh of Rupert Keegan, which had crashed earlier in the race and had been left on the side of the track.  Vittorio Brambilla then hit the oil and also spun his Surtees, collecting the wreckages of Keegan's and Patrese's cars. Danny Ongais was next in the Interscope Penske, but was able to continue. Finally Villeneuve spun, staying on the track only to break a driveshaft trying to pull away and retiring. ", "| Rupert Keegan", "|  Rupert Keegan"]}, {"page": "1978 Argentine Grand Prix", "response": ["|Rupert Keegan", "|  Rupert Keegan"]}, {"page": "1978 Brazilian Grand Prix", "response": ["|Rupert Keegan", "|  Rupert Keegan"]}, {"page": "1978 South African Grand Prix", "response": ["|  Rupert Keegan", "|  Rupert Keegan"]}, {"page": "1978 Monaco Grand Prix", "response": ["|Rupert Keegan", "|  Rupert Keegan"]}, {"page": "1978 Belgian Grand Prix", "response": ["|Rupert Keegan", "|  Rupert Keegan"]}, {"page": "1978 Spanish Grand Prix", "response": ["|  Rupert Keegan", "|  Rupert Keegan"]}, {"page": "1978 Swedish Grand Prix", "response": ["| Rupert Keegan", "|  Rupert Keegan"]}, {"page": "1978 French Grand Prix", "response": ["|  Rupert Keegan", "|  Rupert Keegan"]}, {"page": "1978 British Grand Prix", "response": ["|  Rupert Keegan", "|  Rupert Keegan"]}, {"page": "1978 German Grand Prix", "response": ["|  Rupert Keegan", "|  Rupert Keegan"]}, {"page": "1978 Austrian Grand Prix", "response": ["|Rupert Keegan", "|  Rupert Keegan"]}, {"page": "1978 Dutch Grand Prix", "response": ["|  Rupert Keegan", "|  Rupert Keegan"]}, {"page": "1980 British Grand Prix", "response": ["In the two weeks between the French and British Grands Prix, Brabham decided to replace Ricardo Zunino with Mexican driver Héctor Rebaque, while the Shadow team closed down. There were still 27 cars on the entry list, as RAM Racing entered year-old Williams FW07s for Rupert Keegan and South African female racer Desiré Wilson.", "|  Rupert Keegan", "|  Rupert Keegan"]}, {"page": "1980 German Grand Prix", "response": ["|  Rupert Keegan", "|  Rupert Keegan"]}, {"page": "1980 Austrian Grand Prix", "response": ["|  Rupert Keegan", "|  Rupert Keegan"]}, {"page": "1980 Dutch Grand Prix", "response": ["|  Rupert Keegan", "|  Rupert Keegan"]}, {"page": "1980 Italian Grand Prix", "response": ["|  Rupert Keegan", "|  Rupert Keegan"]}, {"page": "1980 Canadian Grand Prix", "response": ["|  Rupert Keegan", "|  Rupert Keegan"]}, {"page": "1982 German Grand Prix", "response": ["|  Rupert Keegan", "|  Rupert Keegan"]}, {"page": "1982 Austrian Grand Prix", "response": ["|  Rupert Keegan", "|  Rupert Keegan"]}, {"page": "1982 Swiss Grand Prix", "response": ["|  Rupert Keegan", "|  Rupert Keegan"]}, {"page": "1982 Italian Grand Prix", "response": ["| Rupert Keegan", "|  Rupert Keegan"]}, {"page": "1982 Caesars Palace Grand Prix", "response": ["| Rupert Keegan", "|  Rupert Keegan"]}, {"page": "1983 Formula One World Championship", "response": ["The March team united with RAM Racing and became RAM March. As well as Boesel, Rupert Keegan was also replaced by the team, who shrunk to just one car, for Eliseo Salazar of ATS. The German team were also reduced to one car, run for Manfred Winkelhock who had driven alongside Salazar in 1982."]}, {"page": "1982 Formula One World Championship", "response": ["At Team Lotus, Nigel Mansell missed two races due to injuries from a crash in Canada. His substitute at the Dutch Grand Prix was Roberto Moreno, who failed to qualify. Mansell attempted a comeback at Brands Hatch, but was again replaced at the French Grand Prix, this time by Geoff Lees. An accident at the race in France led Jochen Mass, already deeply shaken by the fatal crash of Villeneuve, in which he was involved, to walk away from Grand Prix racing. He was replaced at March by Rupert Keegan. Swedish driver Slim Borgudd had moved from ATS to Tyrrell in the off season, but was forced to leave the team after only three races when his sponsorship money ran out. Henton took his place from the Belgian Grand Prix onwards, as Surer returned to Arrows after his injuries had healed.", "|align=\"left\"|  Rupert Keegan"]}]}}