{"wiki_id": "http://www.wikidata.org/entity/Q171515", "itemLabel": "Jonathan Palmer", "itemDescription": "British racing driver", "wikipedia_url": "https://en.wikipedia.org/wiki/Jonathan_Palmer", "wikipedia_page": {"main": "Jonathan Charles Palmer (born 7 November 1956) is a British businessman and former Formula One racing driver. Before opting for a career in motor racing, Palmer trained as a physician at London's Guys Hospital. He also worked as a junior physician at Cuckfield and Brighton hospitals.\nHe is currently the majority shareholder and Chief Executive of MotorSport Vision (MSV), a company that runs six UK motorsport circuits, the PalmerSport corporate driving event at Bedford Autodrome and several racing championships including British Superbikes and BRDC British F3.Prior to his business life, Palmer was active in Formula One between 1983 and 1989, and drove for Tyrrell, Williams, RAM, and Zakspeed. He won 14 Championship points from 83 starts.  He also raced a Group C Porsche in sports car events between 1983 and 1990, winning the 1984 1000 km of Brands Hatch with co-driver Jan Lammers and taking second place at the 1985 24 Hours of Le Mans with co-drivers James Weaver and Richard Lloyd.\nPalmer helped develop the McLaren F1 road car, and drove one to a new speed record for production cars.", "link_mentions": [{"page": "Auto racing", "response": ["After 25 years away from the sport, former Formula 2 champion Jonathan Palmer reopened the F2 category again; most drivers have graduated from the Formula Palmer Audi series. The category is officially registered as the FIA Formula Two championship. Most rounds have two races and are support races to the FIA World Touring Car Championship."]}, {"page": "November 7", "response": ["*  1956   – Jonathan Palmer, English race car driver and businessman"]}, {"page": "Williams Grand Prix Engineering", "response": ["|rowspan=\"2\" style=\"text-align:left;\"|  Keke Rosberg Jacques Laffite Jonathan Palmer", "Williams developed the car for the revived Formula Two championship, beginning in 2009. The design was originally created for a new, more-powerful offshoot of the Formula Palmer Audi series, however the car was re-purposed when Jonathan Palmer's MotorSport Vision successfully bid for the rights to run the new Formula Two series."]}, {"page": "Minardi", "response": ["Nonetheless, the team expanded to two cars for the  season. In 1988, Minardi switched to Cosworth engines, and in 1989 it became top entrant for Pirelli's return to Formula One. The team was moderately successful in the midfield through the late 1980s and early 1990s, giving a succession of Italian drivers their first chance at the top level, including Alessandro Nannini, Pierluigi Martini and Gianni Morbidelli. Martini in particular was synonymous with Minardi, eventually having three spells with the team. He drove for them on their debut in 1985, scored their first point in the 1988 United States Grand Prix, although he had been running 5th for quite a long time during the race until being passed by Tyrrell's Jonathan Palmer, took their only front-row start at 1990 USA Grand Prix (aided by special Pirelli tyres; several of their other drivers had surprise qualifying results that day), their only lap leading a race in the 1989 Portuguese Grand Prix, where he finished 5th, and scored their joint-best F1 result up to that point (the other being at the British Grand Prix the same year)."]}, {"page": "Lewisham", "response": ["*Jonathan Palmer former Formula One driver and commentator"]}, {"page": "List of sports announcers", "response": ["* Jonathan Palmer – BBC Sport 1993–1996"]}, {"page": "Henri Toivonen", "response": ["Toivonen continued with Opel into the 1983 season, now driving the Manta 400, which took advantage of the new Group B regulations. Although the Manta was a Group B car, it was underpowered against the likes of the Audi Quattro A2 and Lancia 037, which were controlling the world rally scene at the time. Toivonen achieved a win at the Manx International Rally, a round of the British Open Rally Championship and the European Rally Championship, in the Isle of Man, at his first attempt. He also finished first at the Mille Pistes rally in France, but the organisers decided to ban the Group B cars halfway through the event. Toivonen and his co-driver, Ian Grindrod, received only a consolation trophy. In the World Rally Championship, he retired in three rallies, finished sixth at the Monte Carlo Rally and fourth at the Rallye Sanremo. He also drove a Ferrari 308 GTB at the San Marino Rally, where he was co-driven by Juha Piironen for the first time. The pair retired from the event, but Piironen would become his main co-driver for the next two seasons, and later have a long and successful partnership with four-time world champion Juha Kankkunen. In late October, Toivonen again competed on the circuits. This time he entered two sportscar races, driving a Porsche 956 for Richard Lloyd Racing in the European Endurance Championship. He only practiced the car at Imola and did not race, but in the next race at Mugello, partnered with Derek Bell and Jonathan Palmer, he finished third."]}, {"page": "Jean Alesi", "response": ["With Jonathan Palmer having retired from driving at the end of 1989 and a new teammate in Satoru Nakajima, Alesi amazingly became Tyrrell's lead driver in 1990 for what would be his first full year in Grand Prix racing (prior to the start of the 1990 season, Alesi only had 8 race starts in Formula One). At the first event, the United States Grand Prix at Phoenix, he led for 25 laps in front of Ayrton Senna with a car powered by a customer Ford V8 considered as vastly inferior to the factory-developed Honda V10 in Senna's McLaren, and also re-passing Senna after the Brazilian had first overtaken for the lead. Second place in the Monaco Grand Prix followed the second place gained in Phoenix, and by mid-season, top teams were clamouring for his services in 1991. A confused situation erupted, with Tyrrell, Williams, and Ferrari all claiming to have signed the driver within a very short period. The results dropped away during the rest of the 1990 season, and Alesi finished ninth in the championship, with 13 points."]}, {"page": "Martin Brundle", "response": ["His Formula One career began with the Tyrrell Racing Organisation in . He put in a number of aggressive and fast drives, finishing fifth in his first race in Brazil and then second in Detroit before being disqualified. At the 1984 Dallas Grand Prix Brundle broke his ankles and both feet in a crash during a practice session, and was forced to miss the rest of the season while he recuperated; the severity of the damage to Brundle's left ankle initially led doctors to consider amputating his left foot. While Brundle did recover, the damage would leave him with permanent injuries, preventing him from running and left-foot braking.Sport.co.uk meets...Martin Brundle Later in the year Tyrrell were disqualified from the World Championship due to a technical infringement and Brundle's achievements for that season were wiped from the record books.For the next two seasons he remained with Tyrrell, and despite the team's switch from the Cosworth DFV to the turbocharged Renault engines in mid-, the team struggled against the works teams. He scored only eight points in his time with Tyrrell, all in the  season. In  he left Tyrrell and moved to the struggling West German team Zakspeed, but scored only two points during the year; both were scored for finishing fifth at the 1987 San Marino Grand Prix. The Zakspeed 871 car was unable to compete with the front runners. The two points scored by Brundle in 1987 were the only points the Zakspeed team scored in their five-year (1985–89) run in Formula One. Ironically, the driver he replaced at Zakspeed, fellow Englishman Jonathan Palmer, would join Tyrrell in 1987 who were once again using a Cosworth engine. While Brundle only had one point scoring finish for the season, Palmer would go on to score six World Championship points for Tyrrell and would also win the Jim Clark Cup as the 'Atmo Champion' for drivers of cars with Naturally aspirated engines."]}, {"page": "Donington Park", "response": ["Donington Park is a motorsport circuit located near Castle Donington in Leicestershire, England. The circuit business is now owned by Jonathan Palmer's MotorSport Vision organisation, and the surrounding Donington Park Estate, still owned by the Wheatcroft family, is currently under lease by MotorSport Vision until 2038. It has a capacity of 120,000."]}, {"page": "McLaren F1", "response": ["*The 1st lap of Nurburgring was completed by Jonathan Palmer in the XP4 prototype, where he reached a maximum of 200 mph (322 km/h) on the track."]}, {"page": "Marcos Engineering", "response": ["The successor Marcos coupé road cars were popular track/day cars, and several were raced in the BARC and BRSCC Modsports championships, including Jonathan Palmer taking the 1977 Modsport championship in a V6. Mark Hales also successfully raced a 1967 wooden chassis V6 in the Modsports class. The 1800 Volvo engined cars are accepted for historic racing under FIA Appendix K, where they are very competitive, and there are still wooden chassis Ford-engined cars being raced. The fact that the wooden chassis can take the stresses of racing for so many years shows what a successful design it was."]}, {"page": "Murray Walker", "response": ["After Hunt died, former F1 driver and BBC pit lane reporter Jonathan Palmer joined Walker in the commentary box until the end of 1996, though in  individuals such as three-time world champion Jackie Stewart took the role as Walker's partner for the 1993 British Grand Prix and  World Champion Alan Jones commented alongside Walker in Australia at the end of the season following a request by Nine's Wide World of Sports. The following year, the television rights of the UK television coverage transferred to ITV, and Walker followed. His co-commentator from the 1997 season on until his retirement from commentating was another F1 driver, Martin Brundle."]}, {"page": "Formula Two", "response": ["Following an absence of 25 years, a Formula Two championship was re-established by the FIA in 2009. Unlike the previous incarnation, the FIA Formula Two Championship was a one make series, with the competitors all using the same chassis and engine. Jonathan Palmer's MotorSport Vision company managed the championship and also operated and maintained the cars on behalf of the drivers. There were no teams in the championship – unlike other professional motorsport series each driver instead worked with engineers supplied by MotorSport Vision. The cars were designed by Williams Grand Prix Engineering, and were powered by a 1.8L turbocharged Audi engine developed by Mountune Racing, with . The cars fell between Formula One and Formula Three in performance, and cost each driver £195,000 for a season.", "|align=\"left\"| Jonathan Palmer"]}, {"page": "Caterham 7", "response": ["Early cars used the Lotus TwinCam engine (subsequently manufactured by Vegantune), followed by Ford crossflow engines.This paragraph largely draws from Chris Rees' book \"Caterham Sevens from conception to CSR\", published by MRP, , The first Cosworth BDR engines appeared around 1983, in 1600 cc  form, followed by 1700 cc  versions three years later. By 1990 the top of the range engine had become the two-litre Vauxhall HPC, as fitted to the Vauxhall Calibra, putting out 165–175 bhp. A few HPC \"Evolution\" models were built with engines developed by Swindon Race Engines producing between  and . In 1993 Caterham created the JPE special edition (named for Formula 1 driver Jonathan Palmer) by using a two-litre Vauxhall Touring Car engine, putting out around  and reducing weight to around  by such measures as removing the windscreen in favour of an aeroscreen. The JPE was quoted at 0-60 mph times of around 3.5 seconds and, with Jonathan Palmer at the wheel, set a 0-100 mph-0 record of 12.6 seconds. Around 1997 the cross flow range was replaced by 8v and 16v Vauxhall units which, in various guises lived on until the end of the VX-powered Caterham Classic, in 2002."]}, {"page": "Justin Wilson (racing driver)", "response": ["His performances impressed the three-time world champion Jackie Stewart and his son Paul. Jackie Stewart concluded Wilson's height would hinder him in single-seaters and advised a move to either sports car or touring car racing. A lack of funding prevented a progression to Formula Three due to its high entry fee. His family wrote to the former driver and commentator Jonathan Palmer for advice. Palmer replied he had established a one-make racing series for drivers seeking a modest financial route to Formula One (F1). Wilson entered Formula Palmer Audi in 1998 and was employed as a driving instructor at Bedford Autodrome. With nine victories and four pole positions, he won the inaugural championship over Darren Turner, and was again shortlisted for the Autosport BRDC Award.", "When Minardi driver Alex Yoong was rested for two races due to poor performance, Wilson was the team's preferred choice to replace him. However, during a seat fitting at Minardi's headquarters in Faenza, Italy, he was unable to fit inside the PS02 car because of his long legs and so Anthony Davidson drove the car instead. Wilson and his manager Jonathan Palmer were eager to arrange a test with the Newman/Haas Racing CART team in September 2002, and Wilson had a seat fitting in a Lola-Toyota car at their Chicago workshop, becoming acquainted with staff members. Wilson made his oval track test debut at Homestead–Miami Speedway on 8 October. He declined Newman/Haas' invitation for a second test at Sebring International Raceway in December."]}, {"page": "Cosworth DFV", "response": ["The announcement at end of the  season that turbocharged cars would be banned from , and the introduction of the Jim Clark Cup and Colin Chapman Trophy championships for naturally aspirated cars for , prompted Cosworth to revive their elderly engine design. This resulted in the DFZ, essentially an updated version of the final DFY design. However, the capacity increase for the new 3.5L naturally aspirated formula running alongside the 1.5L turbos in 1987 allowed Cosworth to increase the power output of the unit to . The engine was intended as a temporary measure to tide smaller teams over until the turbos were banned at the end of the  season. Tyrrell, AGS, March, Lola and Coloni chassis were all powered by Cosworth in 1987. Jonathan Palmer of Tyrrell eventually won the drivers' Jim Clark Cup, and his team took the constructors' laurels in the Colin Chapman Trophy. The engine remained in service with minor teams until the end of 1988 and development saw a slight power increase to . The DFZ did not race in Formula One beyond 1988 as the general release of the DFR engine made it obsolete."]}, {"page": "Michele Alboreto", "response": ["A lack of a drive had left Alboreto in a difficult situation and he later said that he contemplated retirement – an option of which his family were very much in favour.Nyberg and Diepraam, Paragraph 7 However, he was offered a drive at his former employer Tyrrell, which he accepted. The relationship between Alboreto and team boss, Ken Tyrrell, soon turned sour. At the Monaco Grand Prix, Alboreto was told to drive the 1988 model Tyrrell 017, due to the newer 018 model not being completed. Teammate Jonathan Palmer was chosen to drive the new monoshock 018. Meanwhile, the Italian would have to wait until the following day for the 018 and so he decided not to accept this. The result was Alboreto boycotting the Thursday practice session. Alboreto finished the race in fifth position during while Palmer finished ninth. This was followed by a strong performance at the next race in Mexico, where Alboreto finished 3rd – the only podium the team would achieve during the season."]}, {"page": "Brands Hatch", "response": ["Brands Hatch Circuit is a motor racing circuit in West Kingsdown, Kent, England, United Kingdom. Originally used as a grasstrack motorcycle circuit on farmland, it hosted 12 runnings of the British Grand Prix between 1964 and 1986 and currently hosts many British and International racing events. The venue is owned and operated by Jonathan Palmer's MotorSport Vision organisation.", "One of the biggest developments in the circuit's history occurred in January 2004, when Jonathan Palmer's MotorSport Vision company completed the purchase of Brands Hatch and the other Octagon venues (Cadwell Park, Oulton Park, and Snetterton). Palmer immediately implemented a programme of improvements to the venue, designed to heighten customer experiences both for spectators and competitors.", "The DTM competitors returned to Brands, May 2013, where Mike Rockenfeller dominated with a lights-to-flag win, in his Audi RS5. The reigning champion, Bruno Spengler was second for BMW with his fellow Canadian, Robert Wickens taking third for Mercedes-Benz. However the DTM cars did not return in 2014, as the series expanded into Eastern Europe and China. DTM chief, Hans Werner Aufrecht said that \"while Brands and Zandvoort had been good venues for the championship, Hungary and China were stronger markets\". Meanwhile, Jonathan Palmer, head of Brands owner MotorSport Vision, said the decision to part with the DTM was a mutual one. \"We have enjoyed hosting DTM at Brands Hatch for eight years but we have agreed with ITR that it's time for the event to move on. We witnessed great races at these circuits and have to say thank you for the good cooperation,\" he said."]}, {"page": "1983 European Grand Prix", "response": ["The fastest non-turbo car was the Williams of Keke Rosberg in 16th; teammate Jacques Laffite failed to qualify. Williams had planned to debut their Honda turbo-powered FW09 at this race, but instead decided to wait until the season finale in South Africa. The team, did, however, enter a third car for test driver and Formula Two champion Jonathan Palmer, who qualified 25th.", "|  Jonathan Palmer", "|  Jonathan Palmer"]}, {"page": "1984 Brazilian Grand Prix", "response": ["|  Jonathan Palmer", "|  Jonathan Palmer"]}, {"page": "1984 South African Grand Prix", "response": ["|  Jonathan Palmer", "|  Jonathan Palmer"]}, {"page": "1984 Belgian Grand Prix", "response": ["|  Jonathan Palmer", "|  Jonathan Palmer"]}, {"page": "1984 San Marino Grand Prix", "response": ["|  Jonathan Palmer", "|  Jonathan Palmer"]}, {"page": "1984 French Grand Prix", "response": ["|  Jonathan Palmer", "|  Jonathan Palmer"]}, {"page": "1984 Monaco Grand Prix", "response": ["|  Jonathan Palmer", "|  Jonathan Palmer"]}, {"page": "1984 Dallas Grand Prix", "response": ["|  Jonathan Palmer", "|  Jonathan Palmer"]}, {"page": "1984 British Grand Prix", "response": ["Eddie Cheever (Alfa Romeo), Philippe Alliot (RAM) and Jo Gartner (Osella) were all outed in a first lap crash which started when Riccardo Patrese lost his Alfa going into the Graham Hill Bend. The race was stopped after 11 laps to clear Jonathan Palmer's RAM.", "|  Jonathan Palmer", "|  Jonathan Palmer"]}, {"page": "1984 German Grand Prix", "response": ["|  Jonathan Palmer", "|  Jonathan Palmer"]}, {"page": "1984 Austrian Grand Prix", "response": ["|  Jonathan Palmer", "|  Jonathan Palmer"]}, {"page": "1984 Dutch Grand Prix", "response": ["|  Jonathan Palmer", "|  Jonathan Palmer"]}, {"page": "1984 Italian Grand Prix", "response": ["|  Jonathan Palmer", "|  Jonathan Palmer"]}, {"page": "1984 European Grand Prix", "response": ["|  Jonathan Palmer", "|  Jonathan Palmer"]}, {"page": "1984 Portuguese Grand Prix", "response": ["|  Jonathan Palmer", "|  Jonathan Palmer"]}, {"page": "1985 Brazilian Grand Prix", "response": ["The 1985 Formula One season saw an entry list of 28 drivers competing with Zakspeed officially joining Formula One with Jonathan Palmer being the driver to compete for the team, though they wouldn't be competing in the opening round as they was going to join in the field in Portugal. The other brand new team that was competing in the 1985 season was Minardi who had competed in Formula Two from 1980 to 1984 with a custom chassis before stepping up and competing in F1. The Toleman team, meanwhile, missed the race due to being unable to secure a tyre contract. Their lead driver, Stefan Johansson, was present, however, and substituted for Stefan Bellof when the German driver was suspended by his Tyrrell team due to a contract dispute."]}, {"page": "1985 Portuguese Grand Prix", "response": ["Jonathan Palmer was the first driver to retire, and was able to bring his Zakspeed into the pits and retire with suspension problems. Wet weather caused spinouts frequently early in the race. Philippe Alliot retired trackside for this reason on lap 3. François Hesnault retired trackside with an electrical problem on the same lap.", "|  Jonathan Palmer", "|  Jonathan Palmer"]}, {"page": "1985 San Marino Grand Prix", "response": ["|  Jonathan Palmer", "|  Jonathan Palmer"]}, {"page": "1985 Monaco Grand Prix", "response": ["|  Jonathan Palmer", "|  Jonathan Palmer"]}]}}