{"wiki_id": "http://www.wikidata.org/entity/Q171958", "itemLabel": "Sidney Reilly", "itemDescription": "Russian-born spy", "wikipedia_url": "https://en.wikipedia.org/wiki/Sidney_Reilly", "wikipedia_page": {"main": "Sidney George Reilly  (; c. 1873 – 5 November 1925) — known as \"Ace of Spies\" — was a Russian-born adventurer and secret agent employed by Scotland Yard's Special Branch and later by the Foreign Section of the British Secret Service Bureau, the precursor to the modern British Secret Intelligence Service (MI6/SIS). He is alleged to have spied for at least four different great powers, and documentary evidence indicates that he was involved in espionage activities in 1890s London among Russian émigré circles, in Manchuria on the eve of the Russo-Japanese War (1904–05), and in an abortive 1918 coup d'état against Vladimir Lenin's Bolshevik government in Moscow.Reilly disappeared in Soviet Russia in the mid-1920s, lured by Cheka's Operation Trust. British diplomat and journalist R. H. Bruce Lockhart publicised his and Reilly's 1918 exploits to overthrow the Bolshevik regime in Lockhart's 1932 book Memoirs of a British Agent. This became an international best-seller and garnered global fame for Reilly. The memoirs retold the efforts by Reilly, Lockhart, and other conspirators to sabotage the Bolshevik revolution while still in its infancy.\nThe world press made Reilly into a household name within five years of his execution by Soviet agents in 1925, lauding him as a peerless spy and recounting his many espionage adventures. Newspapers dubbed him \"the greatest spy in history\" and \"the Scarlet Pimpernel of Red Russia\". The London Evening Standard described his exploits in an illustrated serial in May 1931 headlined \"Master Spy\". Ian Fleming used him as a model for James Bond in his novels (set in the early Cold War). Reilly is considered to be \"the dominating figure in the mythology of modern British espionage\".", "link_mentions": {}}}