{"wiki_id": "http://www.wikidata.org/entity/Q17198181", "itemLabel": "George Hamilton", "itemDescription": "Northern Irish police officer", "wikipedia_url": "https://en.wikipedia.org/wiki/George_Hamilton_(police_officer)", "wikipedia_page": {"main": "Sir George Ernest Craythorne Hamilton  (born 27 June 1967) is a Northern Ireland retired police officer. From 2014 to 2019, he served as the Chief Constable of the Police Service of Northern Ireland. He was previously the Assistant Chief Constable with responsibility for rural policing.", "link_mentions": [{"page": "June 27", "response": ["*  1967   – George Hamilton, Northern Irish police officer"]}, {"page": "Provisional Irish Republican Army", "response": ["In February 2015 Garda Commissioner Nóirín O'Sullivan stated that the Republic of Ireland's police service, the Gardaí, have no evidence that the IRA's military structure remains or that the IRA is engaged in crime. In August 2015 George Hamilton, the PSNI chief constable, stated that the IRA no longer exists as a paramilitary organisation. He said that some of its structure remains, but that the group is committed to following a peaceful political path and is not engaged in criminal activity or directing violence. However, he added that some members have engaged in criminal activity or violence for their own ends. The statement was in response to the recent killings of two former IRA members. In August Kevin McGuigan was shot dead, believed to be a revenge killing by former IRA members over the shooting death of former Belfast IRA commander Gerard Davison three months earlier. The chief constable stated there was no evidence that the killing of McGuigan was sanctioned by the IRA leadership. In response, the British government commissioned the Assessment on Paramilitary Groups in Northern Ireland, which concluded in October 2015 that the IRA, while committed to peace, continued to exist in a reduced form."]}, {"page": "Police Service of Northern Ireland", "response": ["|Sir George Hamilton"]}, {"page": "Order of precedence in Northern Ireland", "response": ["#The Chief Constable of the Police Service of Northern Ireland (George Hamilton)"]}, {"page": "George Hamilton", "response": ["George Hamilton may refer to:", "* George Hamilton (musician) (1901–1957), father of the actor George Hamilton", "* George Hamilton IV (1937–2014), American country music performer", "* George Hamilton (actor) (born 1939), American actor", "* George Hamilton (Resident Evil), fictional character in the video games Resident Outbreak File #1 and File #2", "* Sir George Hamilton, Comte Hamilton (est. 1635 – 1676), Irish soldier in French service", "* George Hamilton (soldier) (aft. 1658 – aft. 1728), Scottish soldier, Member of Parliament for Anstruther Burghs, and Jacobite", "* George FitzGeorge Hamilton (1898–1918), British Army officer", "* Sir George Hamilton, 1st Baronet, of Donalong (c. 1607–1679), Irish baronet", "* George Hamilton, 3rd Earl of Abercorn (c. 1636 – bef. 1683), Scottish nobleman", "* George Hamilton, 4th Baron Hamilton of Strabane (1636/7 – 1668), Irish peer", "* George Hamilton, 1st Earl of Orkney (1666–1737)", "* George Hamilton (MP for Wells) (c. 1697–1775), Member of Parliament for Wells and for St Johnstown, Donegal", "* George Hamilton (1732–1793), MP for Belfast", "* George Hamilton (1732–1796), MP for Augher", "* George Hamilton-Gordon, 4th Earl of Aberdeen (1784–1860), Prime Minister of the United Kingdom in 1852–1855", "* Lord George Hamilton (1845–1927), British politician", "* Sir George Hamilton, 1st Baronet (1877–1947) of Ilford, British politician", "* George Hamilton (city founder) (1788–1836), Canadian politician and founder of Hamilton, Ontario", "* George Hamilton (footballer) (1917–2001), Scottish footballer", "* George Hamilton (broadcaster) (born 1951), association football commentator with RTÉ", "* Eppie Hamilton (George Hamilton, born 1900), American baseball player", "* George Hamilton (moderator) (1635–1712), moderator of the General Assembly of the Church of Scotland in 1699", "* George Hamilton (canon) (1718–1787), Canon of Windsor", "* George Hamilton (priest) (1823–1905), Archdeacon of Lindisfarne and of Northumberland", "* George Hamilton (lumber baron) (1781–1839), lumber baron in the Ottawa Valley", "* George Hamilton (Australian police officer) (1812–1883), senior South Australian police commissioner", "* George Hamilton (police officer) (born 1967), Chief Constable of the Police Service of Northern Ireland from 2014"]}, {"page": "Cressida Dick", "response": ["Commissioner Bernard Hogan-Howe subsequently ousted her from her position as the MPS's counterterrorism head after their relationship became strained.Vikram Dodd, Cressida Dick walking a tightrope over policing of Sarah Everard vigil, The Guardian (14 March 2021). In mid-2014, Dick had been one of three short-listed candidates for the position of chief constable of the Police Service of Northern Ireland,Henry McDonald, Met's Cressida Dick faces interview for top Northern Ireland police job, The Guardian (29 May 2014). but George Hamilton was selected for the role instead.Henry McDonald,George Hamilton to be chief constable of Police Service of Northern Ireland, The Guardian (29 May 2014). It was announced in December 2014 that she would retire from the police in 2015 to join the Foreign Office, in an unspecified director-general level posting. The Foreign Office refused Freedom of Information requests for information on her job title, role and responsibilities, or her wage. In the Daily Telegraph, Martin Evans wrote that she had \"an unspecified and rather shadowy security role\" at the Foreign Office."]}, {"page": "Martin O'Hagan", "response": ["On 28 May 2015, BBC aired a Panorama documentary entitled Britain's Secret Terror Deals, which investigated claims that British security forces colluded with paramilitary groups. PSNI Chief Constable George Hamilton denied any police cover-up regarding O'Hagan's death and the subsequent investigations. In the episode, former Police Ombudsman Nuala O'Loan said that state agencies had \"operated outside the rules\" and were responsible for the deaths of \"hundreds and hundreds and hundreds of people\"."]}, {"page": "Bangor Academy and Sixth Form College", "response": ["* George Hamilton - Chief Constable of  PSNI (Police Service of Northern Ireland),  was a former pupil of the Gransha Boys High school, Bangor."]}]}}