{"wiki_id": "http://www.wikidata.org/entity/Q1712045", "itemLabel": "Julian Rathbone", "itemDescription": "English novelist", "wikipedia_url": "https://en.wikipedia.org/wiki/Julian_Rathbone", "wikipedia_page": {"main": "Julian Christopher Rathbone (10 February 1935 – 28 February 2008) was an English novelist.", "link_mentions": [{"page": "List of winners and shortlisted authors of the Booker Prize", "response": ["|Julian Rathbone || King Fisher Lives || Michael Joseph", "|Julian Rathbone || Joseph || Michael Joseph", "*Julian Rathbone"]}, {"page": "Tostig Godwinson", "response": ["Tostig features in the novels The Last English King (2000), by Julian Rathbone (where he is depicted as Edward the Confessor's catamite), Harold, The Last of the Saxon Kings, by Edward Bulwer-Lytton, The King's Shadow, by Elizabeth Alder, The Interim King, by J. Colman McMillan, Lord of Sunset, by Parke Godwin, Warriors of the Dragon Gold, by Ray Bryant, God's Concubine book 2 of The Troy Game series by Sara Douglass, The Bastard King by Jean Plaidy, and The Conqueror's Queen by Joanna Courtney."]}, {"page": "Indian Rebellion of 1857", "response": ["* Julian Rathbone, The Mutiny."]}, {"page": "Iwerne Minster", "response": ["A pre-Norman conquest Iwerne Minster is imagined, along with neighbouring village Shroton, in Julian Rathbone's 1997 novel The Last English King."]}, {"page": "List of University of Cambridge people", "response": ["*Julian Rathbone (Magdalene)"]}, {"page": "Rathbone", "response": ["* Julian Rathbone (1935–2008), English novelist"]}, {"page": "Siege of Cawnpore", "response": ["Many references to the event were made in later novels and films. Julian Rathbone describes the brutality of both British and Indian forces during the siege of Cawnpore in his novel The Mutiny. In the novel, the Indian nurse Lavanya rescues an English child, Stephen, during the Satichaura Ghat massacre. In Massacre at Cawnpore, V. A. Stuart describes the siege and the British defence through the eyes of the characters Sheridan, and his wife Emmy. George MacDonald Fraser's Flashman in the Great Game also contains lengthy scenes set in the entrenchment during the siege and also during the ensuing escape."]}, {"page": "Edith the Fair", "response": ["*Julian Rathbone - The Last English King (1997)"]}, {"page": "British Empire in fiction", "response": ["* The Mutiny (2007) by Julian Rathbone set during the 1857 mutiny."]}, {"page": "Clayesmore School", "response": ["* Julian Rathbone, Author"]}, {"page": "Tamanna (2014 film)", "response": ["Prior to release the film won an award at the London Asian Film Festival for the first released song by Rahat Fateh Ali Khan. Other songs included in the film are sung by Ali Azmat and Amanat Ali. The original score for the film was written by Arthur Rathbone Pullen son of Booker Prize nominee and best selling English author Julian Rathbone."]}, {"page": "2008 in literature", "response": ["*February 28 – Julian Rathbone, English novelist (born 1935)"]}, {"page": "The Last English King", "response": ["The Last English King (1997) is a historical novel by English writer Julian Rathbone. The novel covers the time of the Battle of Hastings. It revolves around Walt Edwinson, a housecarl of Harold Godwinson, the last Anglo-Saxon king of England. The story starts with Walt returning to his home at Iwerne in Dorset four years after the Battle of Hastings. He had fled England after the defeat of the Anglo-Saxons and had spent the time travelling across Europe and Asia Minor. The story of his journey from Constantinople via Nicomedia and Nicaea to Side is then recounted in parallel with his recollections of the time before the battle, such as his accompanying Harold to William of Normandy's attack on Dinan."]}, {"page": "Deaths in February 2008", "response": ["*Julian Rathbone, 73, British novelist."]}, {"page": "Cultural depictions of Edward IV of England", "response": ["*Kings of Albion by Julian Rathbone"]}, {"page": "Marc Atkins", "response": ["*\"Thirteen\", solo photography with text by thirteen writers, including Julian Rathbone, Bill Drummond, James Sallis, Mick Farren, Stella Duffy and Nicholas Royle. (The Do-Not Press )"]}, {"page": "Cultural depictions of Harold Godwinson", "response": ["Modern novels have included The Golden Warrior (1949) by Hope Muntz,The Golden Warrior: the story of Harold and William. London: Chatto & Windus, 1949 \"In 'The Golden Warrior,' Harold, king of Saxon England, goes to his death with such awesome courage...\" Courage and Hope in New Novels. The West Australian (Perth, WA). 22 July 1950. (p. 25) Harold Was My King (1970) by Hilda Lewis,Lynda G. Adamson, World Historical Fiction: An Annotated Guide to Novels for Adults and Young Adults. Phoenix, AZ; Oryx Press  (p. 156)  The Wind From Hastings (1978) by Morgan Llywelyn,Kathryn Falk, Love's Leading Ladies. Pinnacle Books, 1982.  (p. 180). Lord of Sunset (1998) by Parke Godwin,\"Review of Lord of Sunset by Parke Godwin\". Publishers Weekly. Retrieved 29 July 2019.  The Last English King by Julian Rathbone, Siobhan Brownlie, Memory and Myths of the Norman Conquest. Woodbridge, Suffolk.  Boydell & Brewer Ltd, 2013,  (p.99)  the fantasy novel God's Concubine (2004) by Sara Douglass,\"Review: God's Concubine by Sara Douglass\". (Review by Vivane Crystal). Historical Novel Society. Retrieved 18 July 2019.   and The Handfasted Wife (2013) by Carol McGrath.\"Review: The Handfasted Wife by Carol McGrath\". (Review by Sarah Bower). Historical Novel Society. Retrieved 25 August 2019.  The one-act play A Choice of Kings (1966) by John Mortimer deals with his deception by William after his shipwreck. \"...there was a one-act play by John Mortimer called A Choice of Kings about his [William's] tricking of Harold Godwinson\".  \"A Theatregoer’s Guide to the English Monarchs\" by Tim Treanor. DC Theatre Scene, 19 February 2010. Retrieved 19 July 2019.  The Rhyme of King Harold (2014) by Ian Macgill is a verse novel about Harold's life.\"The Rhyme of King Harold\" By Ian Macgill medievalists.net Retrieved 2 September 2019.  After Hastings (2020) by Steven H. Silver is an alternate history novel where Harold defeats Williams at Hastings, and subsequently comes into conflict with the Papacy. O'Neill, John. \"What if King Harold had Prevented the Norman Conquest: After Hastings by Steven H Silver\" Black Gate, 12th July, 2020. Retrieved 18th January 2021."]}, {"page": "ZDT", "response": ["* ZDT, a 1986 novel by Julian Rathbone"]}, {"page": "Deutscher Krimi Preis", "response": ["|1. James Ellroy – Die schwarze Dahlie (Black Dahlia)2. Manuel Vazquez Montalban – Manche gehen baden3. Julian Rathbone – Grünfinger (Zdt)3. Andrew Vachss – Kata (Flood)"]}, {"page": "Past Poisons", "response": ["* \"Damned Spot\" by Julian Rathbone"]}, {"page": "List of historical fiction by time period", "response": ["*The Last English King and Kings of Albion by Julian Rathbone (11th)", "*The Mutiny by Julian Rathbone"]}, {"page": "Anthea Joseph", "response": ["Joseph started to run the publishing business although her primary interest was not profit. She wanted to publish books even those that might not be financially profitable. It was Joseph who phoned the vet Alfred Wight to tell him that they would publish his books. Wight was not allowed to use his name and chose the name, James Herriot, for his popular books. Authors that were also popular were Miss Read,Miss Read, Obituary, The Guardian, Retrieved 9 April 2017 James Baldwin, Stan Barstow, H. E. Bates, Dick Francis, Barry Hines, Julian Rathbone and Alun Richards. Joseph made sure that profits were set aside for other authors."]}]}}