{"wiki_id": "http://www.wikidata.org/entity/Q1714175", "itemLabel": "Justin Cochrane", "itemDescription": "English footballer (born 1982)", "wikipedia_url": "https://en.wikipedia.org/wiki/Justin_Cochrane", "wikipedia_page": {"main": "Justin Vincent Cochrane (born 26 January 1982) is a former professional footballer who played for the Antigua and Barbuda national football team. He is now head of first-team development for Manchester United.", "link_mentions": [{"page": "Manchester United F.C.", "response": ["|Head of player development & coaching (U17–U23)|| Justin Cochrane"]}, {"page": "Cochrane (surname)", "response": ["* Justin Cochrane, British football player"]}, {"page": "Hayes F.C.", "response": ["Church Road saw the start of the career of a number of players who went on to higher levels, among them Les Ferdinand, Cyrille Regis, Blackburn Rovers striker Jason Roberts, Crewe Alexandra's Justin Cochrane and French goalkeeper Bertrand Bossu, who famously scored an injury time equaliser at St Albans City in February 2003."]}, {"page": "Billy Jones (footballer, born 1987)", "response": ["The English defender made his debut for the club aged 16 against Derby County on 18 October 2003, coming on as an 89th-minute substitute for Justin Cochrane. Jones went on to play a further 26 league games, which also included his first goal for the club against Wigan Athletic (on 20 December 2003), which later won Crewe's Goal of the Season award. Jones also won Crewe's Young Player of the Year award."]}, {"page": "Lee Bell", "response": ["However, in the 2003–04 season, Bell lost his first team place following the arrival of Justin Cochrane and joined Football Conference side, Shrewsbury on loan in October 2003, but an injury restricted his opportunities and he returned to Crewe in January 2004. Bell established himself in the first team in December 2004, starting 18 times in the remainder of the 2004–05 season, and signed a new two-year contract in June 2005."]}, {"page": "Tottenham Hotspur F.C. Under-23s and Academy", "response": ["|Youth Development Phase Lead Coach|| Justin Cochrane"]}, {"page": "Manchester United F.C. Reserves and Academy", "response": ["*Head of player development and coaching (U17-U23): Justin Cochrane"]}, {"page": "2014 FIFA World Cup qualification (CONCACAF)", "response": ["* Justin Cochrane"]}, {"page": "List of foreign EFL Championship players", "response": ["* Justin Cochrane – Crewe 2005–06"]}, {"page": "2014 FIFA World Cup qualification – CONCACAF Second Round", "response": ["* Justin Cochrane"]}, {"page": "List of foreign USL Championship players", "response": ["*Justin Cochrane – Antigua Barracuda – 2011"]}]}}