{"wiki_id": "http://www.wikidata.org/entity/Q1712037", "itemLabel": "Julian Perretta", "itemDescription": "English singer-songwriter", "wikipedia_url": "https://en.wikipedia.org/wiki/Julian_Perretta", "wikipedia_page": {"main": "Julian Remo Perretta (born 13 January 1992) is an English singer-songwriter and producer. Perretta first gained attention in 2010 with the single \"Wonder Why\", released in the UK by Columbia Records. In 2016, Perretta released multiple solo hit singles, including \"Miracle,\" which reached number one in 13 countries. Perretta has worked with such artists as Ed Sheeran, Ellie Goulding,  Dua Lipa, Rita Ora,  and Mark Ronson. Selling 15 million records globally, Perretta has worked across many genres, most recently with Atlanta-based hip-hop artist Lil Baby. Perretta married American model Kambree Dalton in February 2021.\n\n", "link_mentions": [{"page": "Guy Chambers", "response": ["In 2007, he co-wrote four songs on Anastacia's fourth album Heavy Rotation. He teamed up with Christophe Willem on his second record Cafeine, co-wrote with Matt Hales from Aqualung on the single \"Heartbox\" and with Cathy Dennis on \"Sensitized\", a duet with Kylie Minogue, for Dennis' solo record, released in 2009. Additional work that year involved new work with British artists Julian Perretta, Katie Melua, Random Impulse, Marlon Roudette and Taio Cruz."]}, {"page": "On the Line", "response": ["* \"On the Line\", by Julian Perretta, 2018"]}, {"page": "Mark Ronson", "response": ["Ronson toured the album \"Version\" extensively through both the UK and Europe during 2008. Notable sold-out performances at The Hammersmith Apollo and Brixton Academy. Ronson is known to champion new upcoming artists on the road with him, such as Sam Sparro and Julian Perretta. Ronson's string backing was provided by the all-female string quartet Demon Strings."]}, {"page": "David Grant (singer)", "response": ["Grant has become well known, along with his second wife Carrie Grant, as vocal coach on Pop Idol; judge and vocal coach on the BBC TV talent show Fame Academy; and its spin-off Comic Relief does Fame Academy. In addition he has worked with some of the UK’s top pop acts including The Spice Girls, Take That, S Club, and more recently Will Young, Atomic Kitten, Mel C, Lemar, Charlotte Church, Joss Stone, Geri Halliwell and Julian Perretta."]}, {"page": "List of Columbia Records artists", "response": ["* Julian Perretta"]}, {"page": "Matt Johnson (keyboardist)", "response": ["Johnson has also had a stint as the chief songwriting partner and producer—along with a Jamiroquai bandmate, guitarist Rob Harris—for singer-songwriter Julian Perretta, helping him create his debut album, Stitch Me Up, which was released in 2010."]}, {"page": "Strawberry Letter 23", "response": ["* The Julian Perretta single \"Wonder Why\" (2010)"]}, {"page": "Salaam Remi", "response": ["Remi contributed tracks to Jurassic 5's 2006 LP Feedback and Nas's 2006 album Hip Hop Is Dead, and racked up production credits on Frank, the platinum debut from North London soul-jazz singer Amy Winehouse. He worked on Winehouse's followup, Back to Black, and was producing her third album that was to be released in 2011, up until her death. Remi worked with Nelly Furtado on her first Spanish language album, Mi Plan. His projects in late 2008 included working with Jazmine Sullivan, Nas, Free, Julian Perretta, Leona Lewis and Corinne Bailey Rae."]}, {"page": "Thomas Troelsen", "response": ["*2016: \"Karma\" by Julian Perretta", "*2017: \"Private Dancer\" by Julian Perretta and Feder"]}, {"page": "St Columba's College, St Albans", "response": ["* Julian Perretta, singer-songwriter"]}, {"page": "Fedde Le Grand discography", "response": ["! scope=\"row\"| \"Tales of Tomorrow\"(with Dimitri Vegas & Like Mike featuring Julian Perretta)"]}, {"page": "List of British Italians", "response": ["* Julian Perretta"]}, {"page": "Out of Control Tour", "response": ["Emma Deigman was confirmed as the supporting act during the tour. Other support acts included Julian Perretta, Girls Can't Catch and Absent Elk. In addition to their own dates, Girls Aloud and American rapper Jay Z were support acts for Coldplay's Viva la Vida Tour at Wembley Stadium on 18 September 2009.", "*Julian Perretta "]}, {"page": "I Cry", "response": ["*\"I Cry\", a song by Julian Perretta from his 2016 album Karma"]}, {"page": "Main Square Festival", "response": ["Martin Solveig, Beady Eye, Eels, Selah Sue, Tame Impala, Jenny & Johnny, Warpaint, Welling Walrus, The Shoes, Kasabian, Two Door Cinema Club, Jimmy Eat World, Fleet Foxes, Aloe Blacc, Everything Everything, Mai, Underworld, Magnetic Man, Cold War Kids, Julian Perretta, Puggy, I Blame Coco, Evaline, Manceau"]}, {"page": "Wolfgang Boss", "response": ["* Julian Perretta: Miracle, 2016 (Gold Single in Germany)Sony Music zeichnet Julian Perretta mit Gold aus"]}, {"page": "List of top 100 singles of 2010 (France)", "response": ["|Julian Perretta"]}, {"page": "Talay Riley", "response": ["|Julian Perretta"]}, {"page": "Sam Gray (musician)", "response": ["Samuel Gray is an English singer and songwriter from Hull, England, who has composed songs for a multitude of artists including Hardwell, DJ Katch, Solano, Abi Phillips (from the British soap opera Hollyoaks), Manovski, Ben Saunders, Alle Farben, Julian Martel, The Magician, Julian Perretta, Nile Rodgers, and Tobtok, garnering over 100 million streams in the process along with multiple top chart hits around the world."]}]}}