{"wiki_id": "http://www.wikidata.org/entity/Q17183503", "itemLabel": "Ada Blanche", "itemDescription": "Actress and singer", "wikipedia_url": "https://en.wikipedia.org/wiki/Ada_Blanche", "wikipedia_page": {"main": "Ada Blanche (born Ada Cecilia Blanche Adams; 16 July 1862 – 1 January 1953) was an English actress and singer known early in her career for vivacious performances in Victorian burlesque and pantomime and later in character roles in Edwardian musical comedy.\nBorn into a theatrical family, Blanche made her stage debut at the age of fourteen and had a forty-five year career, almost exclusively on the British stage, in the West End and on tour. In the 1890s she was a leading principal boy in London's most lavishly staged pantomimes. In the 20th century her career changed to playing comic, formidable older women. Her most celebrated role of this kind was in the hit musical The Arcadians (1909), staged by her brother-in-law Robert Courtneidge.\nBeyond musical comedy, Blanche appeared in farces and other comedies in non-singing roles between 1906 and her retirement in 1921. Among her co-stars during her long career were George Grossmith Jr., Dan Leno, Marie Lloyd, Walter Passmore, Kate Santley and Little Tich.", "link_mentions": [{"page": "Cicely Courtneidge", "response": ["Courtneidge, the elder daughter and second of three children, was born in Sydney to a theatrical family,Green, Stanley. \"Cicely Courtneidge\". Encyclopedia of the Musical Theatre (books.google.com). Da Capo Press, 1980. . p. 86 while her father was touring Australia with the J. C. Williamson company. The family returned to England in 1894. Her parents were the Scottish producer and actor Robert Courtneidge and his wife, Rosaline May (née Adams), who worked under the stage name Rosie Nott. Rosaline was the daughter of the singer and actress Cicely Nott and the sister of three other actresses, including Ada Blanche, a well-known pantomime star.Pepys-Whiteley, D. \"Courtneidge, Dame (Esmerelda) Cicely (1893–1980)\", Oxford Dictionary of National Biography, Oxford University Press, 2004; online edition, January 2011, accessed 8 August 2011  In 1901, at the age of eight, Courtneidge made her stage debut as the fairy Peaseblossom in her father's production of A Midsummer Night's Dream at the Prince's Theatre, Manchester.\"Courtneidge, Dame Cicely\", Who Was Who, A & C Black, 1920–2008; online edition, Oxford University Press, December 2007, accessed 8 August 2011 ", "Courtneidge continued to star in her father's productions.  In September 1913, she played the part of Lady Betty Biddulph in the musical comedy The Pearl Girl.\"The Pearl Girl\", The Times, 26 September 1913, p. 7 The cast included Ada Blanche; this was the third successive production in which aunt and niece had appeared together. Also in the cast, in the role of Robert Jaffray, was the 21-year-old Jack Hulbert, making his professional debut after success as an amateur while a Cambridge undergraduate. In June 1914, Courtneidge and Hulbert starred together in The Cinema Star, an adaptation by Hulbert and Harry Graham of Die Kino-Königin, a 1913 German comic opera by Jean Gilbert.  The piece was a hit for Courtneidge and her father, playing to full houses at the Shaftesbury Theatre until Britain and Germany went to war in August 1914; anti-German sentiment brought the run to an abrupt halt."]}, {"page": "List of British music hall performers", "response": ["* Ada Blanche (1862–1953)"]}, {"page": "Little Tich", "response": ["The year 1891 signalled a new era in the career of Little Tich. The Drury Lane pantomimes were known for their extravagance and splendour and featured lavish sets and big budgets.\"Victorian Pantomime: Pantomimes at the Theatre Royal, Drury Lane, London\", Victoria and Albert Museum (online). Retrieved 23 September 2013 The first of the Drury Lane pantomimes in which Little Tich appeared was Humpty Dumpty in 1891MacQueen-Pope, p. 86 which also starred Drury Lane regulars Marie Lloyd, Dan Leno and Herbert Campbell.Findlater & Tich, p. 47 As well as the title role,Rohmer, p. 79 Little Tich also played the minor part of the Yellow Dwarf in the harlequinade. It was during the latter characterisation that he revived his Big-Boot Dance, which was a hit with audiences.Findlater and Tich, pp. 49–50 The following Christmas, he equalled this success with his second pantomime Little Bo-Peep in which he played the part of \"Hop of my Thumb\". As well as Leno, Lloyd and Campbell, Harris recruited the singers Ada Blanche and Cecilia Loftus as principal boy and girl respectively.Macqueen-Pope, p. 87 Harris was thrilled with Little Tich and signed him for the 1893–94 pantomime Robinson Crusoe in which he played Man Friday.Findlater & Tich, p. 48MacQueen-Pope, p. 88 The Derby Daily Telegraph called the comedian \"one of the most amusing pantomime dames of all time\". Despite a budget of £30,000, Robinson Crusoe failed to equal the success of the previous two shows, which caused Harris to rethink his cast. Unaware of Harris's plans, Little Tich approached him with a view of a pay rise; the proposition angered the manager and not only was his request refused, but he was also ruled out of any future production."]}, {"page": "The Arcadians (musical)", "response": ["*Mrs Smith, Smith's wife (non-singing) – Ada Blanche"]}, {"page": "Robert Courtneidge", "response": ["Courtneidge's wife was Rosaline May née Adams (stage name Rosie Nott). She was the daughter of the singer and actress Cicely Nott and the sister of three other actresses including Ada Blanche, a well-known pantomime star. In 1892 Courtneidge and his wife went to Australia, where he played comic roles for George Edwardes's Gaiety company in the burlesques, Carmen up to Data, Faust up to Date, Miss Esmeralda and Joan of Arc. He and his wife remained in Australia during 1893 and 1894; he joined the J. C. Williamson company, appearing in On 'Change, La Mascotte, Sweet Lavender and Princess Ida and in pantomime.\"Players of the Period\", The Era, 18 April 1896, p. 10 His daughter Cicely was born while he and his wife were in Sydney.Pepys-Whiteley, D. \"Courtneidge , Dame (Esmerelda) Cicely (1893–1980)\", Oxford Dictionary of National Biography, Oxford University Press, 2004; online edition, January 2011, accessed 8 August 2011 "]}, {"page": "Gaiety Theatre, Isle of Man", "response": ["The theatre opened on 16 July 1900, with a West End production of \"The Telephone Girl\" featuring Ada Blanche. The theatre enjoyed considerable success in the Edwardian era until the outbreak of the First World War in 1914, but then much harder times set in after the war and the theatre fell into decline along with the Island's tourist industry."]}, {"page": "Dick Whittington and His Cat", "response": ["*1894 at the Theatre Royal, Drury Lane, with a libretto by Cecil Raleigh and Henry Hamilton.  The cast included Ada Blanche as Dick, Dan Leno as Jack the idle apprentice, Herbert Campbell as Eliza the cook and Marie Montrose as Alice.The Times, 27 December 1894, p. 3"]}, {"page": "Tivoli Theatre of Varieties", "response": ["After a few years, the hall was bought by the impresario Charles Morton, under whose proprietorship, it became one of London's leading music halls. Morton employed, among others: George Robey, Harriet Vernon, Nellie Navette, Harry Randall, Herbert Campbell, Vesta Victoria, the Brothers Griffiths, Ada Blanche, Leo Stormont, Little Tich, Dan Leno and Eugene Stratton.  In 1900, the theatre was refurbished and the seating capacity was reduced. On 7 February 1914 the theatre closed for a road widening scheme, but due to the outbreak of World War I this didn't happen immediately, so the theatre stood derelict until it was demolished in 1916.Cinema Treasures: Tivoli Theatre Linked 2017-01-07"]}, {"page": "Miss Esmeralda", "response": ["*Ernest – Ada Blanche"]}, {"page": "Marie Loftus", "response": ["In her native Glasgow Loftus was incredibly popular, and this was reciprocated in her many charitable acts in the city. While appearing at the Britannia Music Hall in Glasgow in 1894 she bought 150 pairs of boots for the poorest children in the city.Janet Muir, Masks and Faces: The Life and Career of Harry Braham, Chaplin Books (2014) - Google Books As a pantomime principal boy she wore costumes that enhanced her buxom figure; this was displayed to great effect when Loftus played the title role in Robinson Crusoe at the Theatre Royal, Glasgow in 1889 and 1900, and Sindbad the Sailor in 1895.The Theatre Royal,282 Hope Street, Cowcaddens, Glasgow - Arthur Lloyd: The Music Hall and Theatre History Site Dedicated to Arthur Lloyd, 1839 - 1904 Such was her fame that in 1892 Loftus appeared in the popular Theatre Royal, Drury Lane pantomime alongside Marie Lloyd, Ada Blanche, Dan Leno, Herbert Campbell and Mabel Love.Principal Boys: Marie Loftus - It's Behind You website "]}, {"page": "History of transgender people in the United Kingdom", "response": ["*1893 - Ada Blanche stars in the musical adaptation of Robinson Crusoe"]}]}}