{"wiki_id": "http://www.wikidata.org/entity/Q17279164", "itemLabel": "Snowdon Barne", "itemDescription": "British politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Snowdon_Barne", "wikipedia_page": {"main": "Snowdon Barne (26 December 1756 – 3 July 1825) was a lawyer and a British Member of Parliament, who represented the Dunwich seat from 1796 to 1812.", "link_mentions": [{"page": "Barne", "response": ["* Snowdon Barne (1756–1825), English barrister and politician"]}, {"page": "Dunwich (UK Parliament constituency)", "response": ["The right to vote was exercised by the freemen of the borough. Originally, these freemen could vote even if they did not live in the borough, and at times this was abused as elsewhere, notably in 1670 when 500 non-resident freemen were created to swamp the resident voters. From 1709, however, by a resolution of the House of Commons, the franchise was restricted to resident freemen who were not receiving alms. By the 19th century, the maximum number of freemen had been set at 32, of whom the two \"patrons\", Lord Huntingfield and Snowdon Barne, could nominate eight each, so that between them they controlled half of the votes and needed only one other voter to gain control of elections.", "| Snowdon Barne"]}, {"page": "List of Lords Commissioners of the Treasury", "response": ["**Snowdon Barne", "**Snowdon Barne", "**Snowdon Barne", "**Snowdon Barne"]}, {"page": "Perceval ministry", "response": ["! scope=row |Snowdon Barne"]}, {"page": "Second Portland ministry", "response": ["|colspan=2|Snowdon Barne||2 December 1807"]}, {"page": "List of United Kingdom by-elections (1801–1806)", "response": ["| 27 January 1806 || Dunwich || u* || Snowdon Barne || Snowdon Barne || appointed"]}, {"page": "List of United Kingdom by-elections (1806–1818)", "response": ["|29 January 1810||Dunwich||u||Snowdon Barne||Snowdon Barne||Junior Lord of the Treasury"]}, {"page": "Miles Barne (politician born 1718)", "response": ["When Downing died in 1764, the freemen once again offered the seat to Barne, who agreed with the Vannecks (also a family of former merchants who had purchased a seat in Suffolk) to be joint patrons of the borough, thus ousting the Downing influence.Drummond (1964) Barne was elected in 1764 and served until 1777, voting infrequently, but usually with the Government, and listed as a friend of the Newcastle and Rockingham ministries; he resigned in 1777, citing ill health.Drummond (1964) His efforts helped to secure for the Barne family a stake in the seat and four of his sons and a grandson (Frederick Barne) would be returned as members of the seat from that time up to 1832.See the articles of his children: Miles Barne, Barne Barne, Snowdon Barne, Michael Barne; and his grandson, Frederick Barne", "* Snowdon Barne (1756–1825) was a barrister, Deputy Chairman of the Custom Board and a Member of Parliament for Dunwich from 1796 to 1812.Burke (1833), p. 141"]}, {"page": "Michael Barne (politician)", "response": ["After his elder brother, Snowdon Barne, took up a Commission on the Custom Board in 1812, the seat he had held in the constituency of Dunwich fell vacant. The Barne family had held this seat in their ‘pocket’ since 1764 and its dwindling population led to it becoming a notorious \"Rotten Borough\". There was, therefore, no real contest to Michael Barne superseding his brother and he became the M.P. in 1812. He was not an active Member and is not known to have spoken in a debate prior to 1820, but did vote, largely with the Government, on some measures prior to that year; for instance, he voted against Catholic relief in 1813 and 1817, and supported ministers on army matters and property tax in 1816.Stokes (1986) ; Escott (2009)"]}, {"page": "Richard Dean (died 1850)", "response": ["Dean was appointed a Commissioner of Customs for England and Wales in 1810, after Sir Alexander Munro's post on the Board was vacated.Haydn (1851), p. 500 At that time, William Roe was Chairman of the Customs Board, and he was joined in 1813 by Francis Fownes Luttrell; both men retired in 1819 and Dean became chairman, with Snowdon Barne as his Deputy. During his long tenure as chairman, he was called to answer questions by Parliamentary Select Committees on a number of occasions.Reports from Commissioners: Six Volumes, vol. 5, 1833, pp. 107–110Report from the Select Committee appointed to Inquire into ... the Exportation of Machinery, 1841, pp. 121–122 "]}, {"page": "List of ministerial by-elections to the Parliament of the United Kingdom", "response": ["|29 January 1810||Dunwich||u||Snowdon Barne||Snowdon Barne||Junior Lord of the Treasury", "| 27 January 1806 || Dunwich || u|| Snowdon Barne || Snowdon Barne || Lord Treasurer's Remembrancer of the Court of Exchequer"]}, {"page": "List of MPs elected in the 1796 British general election", "response": ["|Snowdon Barne"]}, {"page": "List of MPs in the first United Kingdom Parliament", "response": ["| Snowdon Barne"]}, {"page": "List of MPs elected in the 1806 United Kingdom general election", "response": ["| Snowdon Barne"]}, {"page": "List of MPs elected in the 1802 United Kingdom general election", "response": ["| Snowdon Barne"]}, {"page": "List of MPs elected in the 1807 United Kingdom general election", "response": ["| Snowdon Barne"]}]}}