{"wiki_id": "http://www.wikidata.org/entity/Q17285480", "itemLabel": "Barney Kennett", "itemDescription": "English speedway rider", "wikipedia_url": "https://en.wikipedia.org/wiki/Barney_Kennett", "wikipedia_page": {"main": "Brian 'Barney' Kennett (born 1955) is a former English motorcycle speedway rider in the British National League.\nBrian Kennett was born 15 March 1955 in Orpington, England. He is part of a speedway family which includes brothers Gordon Kennett and Dave Kennett, and nephew Edward Kennett.\nKennett was the longest serving rider for the Canterbury Crusaders (speedway), riding from 1971 to 1984.\nIn 1973 Kennett was runner-up to Peter Collins (speedway rider) in the British Under 21 Speedway Championship. The same year he became the most expensive Division Two rider in a transfer deal. Hackney Hawks boss Len Silver paid a record £1500.01 to Canterbury Crusaders, adding the 1p to beat the record paid previously by Oxford Rebels for Gordon Kennett, his brother, to transfer from Eastbourne Eagles. Despite this deal, Johnny Hoskins, boss of the Crusaders, wrote-in a loan-back clause, meaning that Canterbury Crusaders could still call on Kennett to ride for them.", "link_mentions": [{"page": "Canterbury Crusaders (speedway)", "response": ["The longest serving rider was Barney Kennett who rode for the Crusaders from 1971 until 1984. Barney is the brother of riders Gordon Kennett and Dave Kennett and is uncle to Edward Kennett.", "*Barney Kennett"]}, {"page": "British Speedway Under 21 Championship", "response": ["| |Barney Kennett"]}, {"page": "1977 Individual Speedway World Championship", "response": ["|Newport || Steve Weatherley || Barney Kennett || Steve Lomas"]}, {"page": "1976 Individual Speedway World Championship", "response": ["|Weymouth || Tony Featherstone || Bob Coles || Barney Kennett"]}, {"page": "Kennett (surname)", "response": ["* Barney Kennett (born 1955), English speedway rider"]}, {"page": "Barney Kennett (speedway rider)", "response": ["#REDIRECT Barney Kennett"]}]}}