{"wiki_id": "http://www.wikidata.org/entity/Q17265743", "itemLabel": "Jamie Hopcutt", "itemDescription": "association football player", "wikipedia_url": "https://en.wikipedia.org/wiki/Jamie_Hopcutt", "wikipedia_page": {"main": "Jamie Ryan Hopcutt (born 23 June 1992) is an English professional footballer who plays as an attacking midfielder for Oldham Athletic.\nRegarding his playing style, Hopcutt was described as a \"creative midfielder that can score goals, athletic with good balance and close ball control.\"", "link_mentions": [{"page": "Östersunds FK", "response": ["* Jamie Hopcutt", "| align=\"left\" |  Jamie Hopcutt", "|align=\"left\"|  Jamie Hopcutt"]}, {"page": "List of people from York", "response": ["*Jamie Hopcutt (born 1992)"]}, {"page": "List of foreign football players in Israel", "response": ["*Jamie Hopcutt"]}, {"page": "2009–10 York City F.C. season", "response": ["York released Clarke, Gall, Mimms, Nelthorpe, O'Hare and Pacquette at the end of the season, while Graham, Purkiss, Russell and Smith left for Kettering, Oxford, Cambridge and Mansfield respectively. Mackin and Sangaré signed new contracts. York's summer signings were goalkeeper David Knight on a season-long loan from Histon, defenders Duane Courtney from Kidderminster and Greg Young from Altrincham, midfielder Jonathan Smith from Forest Green, wingers David McDermott from Kidderminster and Peter Till from and Walsall, and striker George Purcell from Braintree Town. York handed professional contracts to two youth-team players, winger Jamie Hopcutt and Lisles."]}, {"page": "2010–11 York City F.C. season", "response": ["Goalkeeper David Knight was brought in on a season-long loan from Histon before the start of the season, while two defenders, Duane Courtney and Greg Young, signed from Kidderminster Harriers and Altrincham respectively. Midfielder Jonathan Smith was signed from Forest Green Rovers, with wingers David McDermott and Peter Till joining from Kidderminster and Walsall respectively. Striker George Purcell was signed from Braintree Town for an undisclosed fee. Defender Dean Lisles and winger Jamie Hopcutt entered the first-team squad from the youth team after agreeing professional contracts.", "|Jamie Hopcutt", "|Jamie Hopcutt", "|Jamie Hopcutt", "!scope=row|Jamie Hopcutt "]}, {"page": "List of foreign Allsvenskan players", "response": ["*Jamie Hopcutt – Östersund – 2016–2019"]}, {"page": "Doug Bergqvist", "response": ["On 10 February 2014, Bergqvist left England to return to Sweden, signing a two-year contract with Östersund on a free transfer. He did so as part of a scheme called 'League Football Education' which aims to obtain contracts abroad for players in the English league system, alongside Andrew Mills and Jamie Hopcutt."]}, {"page": "List of foreign Superettan players", "response": ["* Jamie Hopcutt – Östersund – 2013–"]}, {"page": "2015 Superettan", "response": ["|align=\"left\"| Jamie Hopcutt", "| Jamie Hopcutt||Östersunds FK||Utsiktens BK||align=center|5–1||24 August 2015"]}, {"page": "Samuel Mensiro", "response": ["At the start of the 2013 season, Mensiro started well when he set up a goal for Jamie Hopcutt to score the club's third goal of the game, in a 3–1 win over GAIS on 26 April 2013. After the match, he revealed that he was attacked by gangs. According to him, he said: \" I understood that I could not ride a bike from them so I started running the bike. But in the end I threw the bike aside to run even faster. I got him into the house and they managed not to catch me. I was terribly afraid when I threw myself into the apartment and locked the door.\" Nevertheless, he continued to feature in the first team, but was soon sent–off for a foul on Modou Barrow, in a 3–1 loss against Varbergs BoIS on 18 May 2013. As a result, he served a two match suspension. Throughout the season, he continued to establish himself in the starting eleven for the side, where he played in either midfield positions and defender positions. At the end of the 2013 season, Mensiro went on to make 27 appearances in all competitions. For his performance, he was named Player of the Year."]}, {"page": "2016 Östersunds FK season", "response": ["| Jamie Hopcutt", "|align=\"left\"| Jamie Hopcutt"]}, {"page": "2017 Svenska Cupen Final", "response": ["|MF ||8 || Jamie Hopcutt || || "]}, {"page": "Frank Arhin", "response": ["After graduating from Hartpury College in 2017, Arhin joined Östersunds FK on 9 August 2017 as part of the Right to Dream Academy's programme. He made his competitive debut for the club against AFC Eskilstuna on 9 September in a 3–0 victory. On 14 October, he scored his first goal for the club against Örebro SK, while also registering an assist to earn a 2–1 win. However, he saw first team opportunities limited behind Saman Ghoddos, Alhaji Gero, Hosam Aiesh and Jamie Hopcutt in the attack, although he made cameos against Hertha BSC and Arsenal in the UEFA Europa League, in a historic maiden run for Östersunds FK that saw them reach the knockout stages of the Europa League at the first attempt, and shock Arsenal at the Emirates Stadium despite losing on aggregate."]}]}}