{"wiki_id": "http://www.wikidata.org/entity/Q172315", "itemLabel": "Damien Magee", "itemDescription": "racecar driver", "wikipedia_url": "https://en.wikipedia.org/wiki/Damien_Magee", "wikipedia_page": {"main": "Damien Magee (born 17 November 1945 in Belfast) is a British former racing driver from Northern Ireland.  He participated in two Formula One World Championship Grands Prix, debuting on 8 June 1975. He scored no championship points.\nHis only World Championship Grand Prix start came in 1975 when he replaced Arturo Merzario at Williams at short notice for the Swedish Grand Prix. The following year he tried to qualify a RAM-entered Brabham at the 1976 French Grand Prix, but missed out.", "link_mentions": [{"page": "1975 Swedish Grand Prix", "response": ["|  Damien Magee", "|  Damien Magee"]}, {"page": "1976 French Grand Prix", "response": ["|  Damien Magee"]}, {"page": "1976 Formula One season", "response": ["|  Damien Magee", "|align=\"left\"|  Damien Magee"]}, {"page": "1975 Formula One season", "response": ["|  Damien Magee", "|align=\"left\"|  Damien Magee"]}, {"page": "RAM Racing", "response": ["The team was formed in 1975 by Mike Ralph and John Macdonald, with RAM derived from their names. After running Macdonald in a GRD in British Formula Three, they entered Alan Jones in a Formula 5000 March for 1976. They also bought a pair of Brabham BT44B Formula One cars, and entered the 1976 World Championship, running Loris Kessel and Emilio de Villota for the Spanish Grand Prix, where neither qualified. However, both Kessel and another pay-driver, Patrick Nève, qualified for the Belgian Grand Prix, with Jac Nellemann, Damien Magee, Lella Lombardi and Bob Evans all making appearances in the cars. There were few finishes, and the pay-drivers meant the team were frequent non-qualifiers.", "|align=\"left\"|  Damien Magee"]}, {"page": "Frank Williams Racing Cars", "response": ["Merzario and Laffite stayed on for the start of the 1975 season as the team continued to use the FW02 and FW03. Williams decided a new car was needed. The new Williams FW04 was the first chassis to carry the Williams name and it replaced the FW02 at the Spanish Grand Prix, and promising British youngster Tony Brise substituted for Laffite, finishing just outside the points in seventh. By this time, however, the team's money problems had become serious, and Merzario left following the Belgian Grand Prix, his place taken for the rest of the season by six different paying drivers – Ian Scheckter, François Migault, Ian Ashley, Jo Vonlanthen, Renzo Zorzi and Lella Lombardi. Northern Ireland's Damien Magee, meanwhile, substituted for Laffite in Sweden.", "|align=\"left\"|  Damien Magee"]}, {"page": "Brabham BT44", "response": ["The BT44 was replaced by the Alfa Romeo powered BT45 for 1976 which proved to be a serious step back for the team. The BT44Bs were sold to RAM Racing, who ran them for a variety of drivers in the 1976 World Championship, including Loris Kessel, Emilio de Villota, Patrick Nève, Jac Nellemann, Damien Magee, Lella Lombardi and Bob Evans, none of whom had much success.", "| align=\"left\"| Damien Magee"]}, {"page": "Damien", "response": ["*Damien Magee (born 1945), British auto racing driver"]}, {"page": "1945 in Northern Ireland", "response": ["* 17 November – Damien Magee, racing driver."]}, {"page": "1975 Formula Atlantic season", "response": ["| ||align=\"left\"| Damien Magee ||align=\"left\"|  ||align=\"left\"| McCall Racing ||align=\"left\"| Tui || 3 || - || - || - || - || 3 || -"]}, {"page": "Brabham Grand Prix results", "response": ["|align=\"left\"|  Damien Magee"]}, {"page": "1976 BRDC International Trophy", "response": ["|  Damien Magee", "|  Damien Magee"]}, {"page": "1974 BRDC International Trophy", "response": ["|  Damien Magee"]}, {"page": "Goldie Hexagon Racing", "response": ["|rowspan=\"2\" align=\"left\"|  Damien Magee"]}, {"page": "1974 Race of Champions", "response": ["|  Damien Magee", "|  Damien Magee"]}, {"page": "1976 Shellsport International Series", "response": ["|  Damien Magee", "|  Damien Magee", "|  Damien Magee", "|  Damien Magee", "|  Damien Magee", "|  Damien Magee", "|  Damien Magee", "|style=\"text-align:left\"|  Damien Magee"]}, {"page": "1977 Shellsport International Series", "response": ["|  Damien Magee", "|style=\"text-align:left\"|  Damien Magee"]}, {"page": "1974 Rothmans 5000 European Championship", "response": ["| Damien Magee"]}, {"page": "1975 ShellSPORT 5000 European Championship", "response": ["| Damien Magee"]}, {"page": "Williams FW", "response": ["At the Spanish Grand Prix, the young British driver Tony Brise replaced Laffite who was driving in Formula Two that day. Brise drove the FW03, outqualified Merzario who drove the new FW04 (18th and 25th), and went on to finish seventh in the race. Merzario withdrew from the race protesting that the barriers were not bolted together properly. Later Rolf Stommelen's rear wing failed and he crashed into the crowd, killing five people. In Monaco, the grid was cut to just 18 cars after the accident in Spain, and Merzario failed to qualify the FW03 in 20th place. At the Belgian Grand Prix Merzario retired the FW03 with clutch failure on lap 2, and he subsequently left the team. In Sweden, Laffite was also absent, driving in Formula Two again, so Damien Magee was brought in to drive the FW03. He qualified 22nd and finished 14th while Ian Scheckter crashed out in the FW04.", "|align=\"left\"| Damien Magee"]}, {"page": "Williams FW04", "response": ["On its debut in Spain, the FW04 was driven by Italian Arturo Merzario with young British driver Tony Brise in the FW03 on a one-race deal. Brise outqualified Merzario (18th and 25th) and Merzario withdrew from the race protesting that the barriers at the Montjuich circuit were not bolted together properly. Later Rolf Stommelen's rear wing failed and he crashed into the crowd, killing five people. Brise finished seventh. In Monaco, Jacques Laffite returned to the team to take Brise's place, and the Frenchman drove the FW04 with Merzario in the FW03. Neither driver qualified for the race, as they were classified 19th (Laffite) and 20th (Merzario) and only 18 cars were permitted to start the race. At the Belgian Grand Prix, Laffite qualified 17th in the FW04 but retired from the race with gearbox failure. In Sweden, Laffite was absent again as he was driving in Formula Two, and Merzario had left the team, so Damien Magee and Ian Scheckter were brought in to replace them. Scheckter started 20th in the FW04 but crashed out of the race after a tyre failure."]}, {"page": "Cosworth engine customers' Grand Prix results", "response": ["|align=\"left\"| Damien Magee", "|align=\"left\"| Damien Magee"]}]}}