{"wiki_id": "http://www.wikidata.org/entity/Q1724181", "itemLabel": "Stephen Venables", "itemDescription": "British mountaineer and writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Stephen_Venables", "wikipedia_page": {"main": "Stephen Venables (born 2 May 1954) is a British mountaineer and writer, and is a past president of the South Georgia Association and of the Alpine Club.", "link_mentions": [{"page": "May 2", "response": ["*  1954   – Stephen Venables, English mountaineer and author"]}, {"page": "Jack Longland", "response": ["In 1990 Longland gave an address at a gathering to commemorate the 200th anniversary of the birth of Sir George Everest, the surveyor-general of India, after whom the mountain was named. The Royal Geographical Society hosted a gathering of climbers who had made or attempted the ascent of Everest. Among them were Lord Hunt, leader of the first successful British expedition in 1953, and Sir Edmund Hillary, who first climbed the mountain with Tenzing Norgay. Chris Bonington, Doug Scott, Stephen Venables and Harry Taylor talked of the post-war achievements, and Longland spoke about the early attempts on the mountain.Faux Ronald. \"Everest heroes hold summit\", The Times, 8 November 1990, p. 3"]}, {"page": "Jim Wickwire", "response": ["In 1995, Jim Wickwire, John Roskelley, Tim Macartney-Snape, Stephen Venables,  and Charlie Porter attempted a new route on Monte Sarmiento, on the western shores of Tierra del Fuego. Wickwire and Porter were injured on the climb and did not reach the summit with Roskelley, Macartney-Snape, and Venables."]}, {"page": "Ten Tors", "response": ["2010 saw the 50th anniversary of the Ten Tors event. To mark the occasion the Duke of Edinburgh visited the event on Sunday morning to speak to finishers and present some with the commemorative 50 years medals. It also marked the first year that teams carried a GPS tracker which enabled the organisers and team managers to track the participants' progress directly. The first finishers were 20th Torbay Explorer Scouts (Joshua Owen, Matthew Ryder, Luke Hayward, Jacob Shah, Paul Moroz, and William Fordyce) and King Edward's School Bath (Robert Wilcox, James Plumstead, Benjamin Smith, Edmond Venables (son of Stephen Venables), Jonathan Tracy, and Mark Humphreys) who walked over the line together at 7:37 to break the record for earliest finishers by 40 minutes, and also finishing four and a half hours ahead of any other team on their route. This also meant the scout group had crossed the line first for three consecutive years.  Notable other finishers were the 'Denbury Boys' who, made up of men who completed the first ever Ten Tors, successfully completed the 35 mile event."]}, {"page": "Boardman Tasker Prize for Mountain Literature", "response": ["*1986 Stephen Venables, Painted Mountains: Two Expeditions to Kashmir", "*The Boardman Tasker Legacy by Stephen Venables"]}, {"page": "Melungtse", "response": ["* Andy Fanshawe and Stephen Venables, Himalaya Alpine-Style, Hodder and Stoughton, 1995."]}, {"page": "Doug Scott", "response": ["*Doug Scott Obituary - 1941-2020 by Stephen Venables"]}, {"page": "Oxford University Mountaineering Club", "response": ["Stephen Venables was the first British climber to climb Everest without using an oxygen cylinder; he climbed to the South Col via the Kangshung Face, creating a new route, and then went solo to the summit, as his colleagues were exhausted.", "*Stephen Venables (b. 1954), New College"]}, {"page": "Panchachuli", "response": ["The first ascent of this peak was made in 1992 by an Indo-British team jointly led by Chris Bonington and Harish Kapadia by the south ridge. Stephen Venables was one of the people in the team who successfully summited, he however had an accident while descending  and a daring rescue operation by the Indian Air force helped evacuate him to safety."]}, {"page": "Tim Macartney-Snape", "response": ["In 1995 Macartney-Snape, Stephen Venables, John Roskelley, Jim Wickwire and Charlie Porter attempted a new route on Mt Sarmiento, on the western shores of Tierra del Fuego, where Macartney-Snape, Roskelley and Venables summited via new route up the southwest face of the western summit.Wickwire, Jim and Bullitt, Dorothy, Addicted to Danger Simon & Schuster 1999. "]}, {"page": "Kangshung Face", "response": ["In 1988, an American/British expedition climbed a new route up the South Buttress on the face to reach the South Col, with a finish to the summit via the standard Southeast Ridge. Stephen Venables, became the first Briton to summit without the use of bottled oxygen. Ed Webster (USA) and Robert Anderson (USA) made it to the South Summit but did not reach the summit. Paul Teare (Canada) made it to the South Col, but descended because he was feeling unwell. In support were: Miriam Zieman (USA), doctor; Joseph Blackburn (USA), photographer; Pasang Norbu (Nepal), cook and Kasang Tsering (Tibet), cookboy.", "To climb the face, the 3 kilometer (2 mi) wide base of the wall must be surpassed by climbing up either the deep gashes of avalanche-swept gullies or the vertical, overhanging rock buttresses, full of deadly ice towers and unsteady snow. Since the crux of the route is near the bottom, retreat is more difficult, making the climb more committing; the relative isolation of the face and probable lack of other climbers also add to the commitment factor. The hanging glaciers and snow slopes pose a large risk of avalanches, especially in the case of a storm, adding to the objective danger of the route. Taking into account these challenges, George Mallory noted in his expedition book: \"Other men, less wise, might attempt this way if they would, but, emphatically, it was not for us.\"Stephen Venables, Everest: Alone at the Summit, p. 8."]}, {"page": "List of Old Carthusians", "response": ["*Stephen Venables (born 1954), mountaineer and writer"]}, {"page": "Timeline of Mount Everest expeditions", "response": ["* On 12 May 1988, Stephen Venables became the first Briton to summit Everest without oxygen, alone. Team leader Robert Anderson and Ed Webster reached the South Summit. All three, with Paul Teare, had climbed a new route up the Kangshung Face to the South Col, with no oxygen and no high altitude porters.", "*  Stephen Venables became the first Briton to ascend the peak without use of oxygen. He pioneered a new route over the East Kangshung Face."]}, {"page": "Piolet d'Or", "response": ["This year in an unprecedented move, the Piolets d'Or jury — Stephen Venables, Silvo Karo, Katsutaka Yokoyama and Gerlinde Kaltenbrunner — awarded all six of the nominated ascents with golden ice axes. The 6 winning climbs - all in the Himalaya and Karkoram mountains - were: "]}, {"page": "Alpine Club (UK)", "response": ["*2005–2007: Stephen Venables"]}, {"page": "Monte Sarmiento", "response": ["The west summit of Monte Sarmiento was climbed in 1995 by a party including the British mountaineers Stephen Venables, John Roskelley and Tim Macartney-Snape. (Source: Ollie, by Stephen Venables). A German team composed of Robert Jasper, Jörn Heller and Ralf Gantzhorn, climbed the North Face to the western summit on April 4, 2010. This team followed the route opened in 1986."]}, {"page": "Venables", "response": ["* Stephen Venables (born 1954), British mountaineer and writer"]}, {"page": "Banff Mountain Book Festival", "response": ["* 1996: Stephen Venables, Himalaya Alpine-Style: The Most Challenging Routes on the Highest Peaks"]}, {"page": "Victor Saunders", "response": ["* 1992 - Panch Chuli V - first ascent, with Dick Renshaw, Stephen Sustad & Stephen Venables", "* 1992 - Rajramba - New route up SE Ridge with Dick Renshaw, Stephen Sustad & Stephen Venables", "* 1985 - Rimo I - attempt with Stephen Venables"]}, {"page": "Alpine Ski Club", "response": ["Stephen Venables became the patron of the Alpine Ski Club in 2017.https://www.alpineskiclub.org.uk/about-the-club/#patron"]}, {"page": "Huw Lewis-Jones", "response": ["The next in his series, Ocean Portraits, a celebration of the sea told through rare historic imagery and modern maritime photography, was released in the United Kingdom in late 2010 by Conway, an imprint of London-based publishing house Anova Books. It is understood there will also be French and German language editions. Its Foreword was written by pioneering yachtsman Sir Robin Knox-Johnston. Described by Wanderlust magazine as a trove of 'portraiture at its best; personal, insightful and delightfully intriguing', it was selected by The Guardian as one of 'the year's best photography books'.Guardian online review Lewis-Jones has now completed Mountain Heroes: Portraits of Adventure, with a significant international team of authors and mountaineers including Doug Scott, Sir Chris Bonington, Stephen Venables, and the celebrated National Geographic photographers Gordon Wiltsie and Cory Richards. It won the Adventure Book of the Year at the World ITB Awards in Germany.ITB Book Awards "]}, {"page": "Andy Fanshawe", "response": ["His book Himalaya Alpine-style, co-authored with Stephen Venables, was published after his death in 1995."]}, {"page": "John Roskelley", "response": ["* 1995 Roskelley, Tim Macartney-Snape, Stephen Venables, Jim Wickwire and Charlie Porter attempted a new route on Monte Sarmiento, on the western shores of Tierra del Fuego, where Roskelley, Macartney-Snape and Venables summited via new route up the southwest face of the western summit."]}, {"page": "Shackleton's Antarctic Adventure", "response": ["* Stephen Venables - Himselfhttps://www.imdb.com/title/tt0280105/"]}, {"page": "Charlie Porter", "response": ["*Monte Sarmiento, West Peak. In 1995 he joined with Stephen Venables, John Roskelley, Jim Wickwire and Tim Macartney-Snape; however, during high winds Porter was blown off an icy ridge, managing to stop his slide off the mountain by jamming his arm in a crevasse, breaking a bone and dislocating his shoulder in the process, but saving his life.Jim Wickwire, Dorothy Bullitt Addicted to Danger Simon and Schuster, 1999 "]}, {"page": "Rodrigo Jordan", "response": ["The following year, in February, he reembarked on the yacht Pelagic Australis for a month long international expedition of Antarctic mountain climbing, led by Stephen Venables and Skip Novak. He climbed Mount Scott and Mount Agamemnon.", "In September 2014, again under the command of Stephen Venables and Skip Novak, he went on an expedition to South Georgia Islands, where he made the first ascent to the three summits of the Trident, discovered by Ernest Shackleton 98 years before. The American Alpine Journal published an article of that expedition the following year."]}]}}