{"wiki_id": "http://www.wikidata.org/entity/Q172199", "itemLabel": "Lance Macklin", "itemDescription": "British racing driver", "wikipedia_url": "https://en.wikipedia.org/wiki/Lance_Macklin", "wikipedia_page": {"main": "Lance Noel Macklin (2 September 1919 – 29 August 2002) was a British racing driver from England. He participated in 15 Formula One World Championship Grands Prix, debuting on 18 May 1952.", "link_mentions": [{"page": "August 29", "response": ["*2002 – Lance Macklin, English race car driver (b. 1919)"]}, {"page": "Aston Martin", "response": ["|  George Abecassis Lance Macklin", "|  Lance Macklin Eric Thompson"]}, {"page": "September 2", "response": ["*  1919   – Lance Macklin, English racing driver and businessman (d. 2002)"]}, {"page": "Mike Hawthorn", "response": ["In January 1955, Hawthorn joined the Jaguar racing team, replacing Stirling Moss, who had left for Mercedes.A letter from Mike Hawthorn . Mike-hawthorn.org.uk. Retrieved on 2013-08-16. Hawthorn won the 1955 les 24 Heures du Mans following what has been described as an inspired drive in which he set a lap record of 4 minutes and 6.6 seconds during a three-hour duel with Fangio in the early stages. However, the race was marred by the worst disaster in motor racing history, a crash which killed 83 spectators and Mercedes driver Pierre Levegh. After overtaking Lance Macklin's Healey, Hawthorn suddenly braked in front of him on noticing an order to enter the pits to refuel, causing Macklin to swerve into the path of Levegh's Mercedes. After colliding with the Healey, the Mercedes skipped the earthen embankment separating the spectator area from the track, bounced through spectator enclosures, then hit a concrete stairwell parapet head-on. The impact shattered the front end of the car, which then somersaulted high, pitching debris into the spectator area, before landing atop the earthen embankment. The debris, including bonnet, engine, and front axle, which separated from the frame, flew through the crowd."]}, {"page": "Stirling Moss", "response": ["|align=\"left\"|  Lance Macklin"]}, {"page": "Pierre Levegh", "response": ["In 1955 he was tempted away from Talbot and joined the American John Fitch in racing a Mercedes-Benz 300 SLR. During the 24 Hours of Le Mans, in the third hour of racing, while on the Tribunes Straight, the car of Mike Hawthorn cut into the pits, slowing in front of the Austin-Healey 100S of Lance Macklin.  Macklin was forced to make an evasive move away from Hawthorn, pulling across the track into the path of Levegh's faster Mercedes, which was driving just in front of Mercedes teammate Juan Manuel Fangio. Running up the side of Macklin's car, Levegh's car launched into the air, striking high on a retaining wall, disintegrating and scattering components into the crowd.  Levegh was killed when he was thrown from the car and his skull crushed by the impact. The flammable magnesium body of the Mercedes quickly ignited in the accident; the combination of the fire and flying car parts killed 83 spectators with over 100 injured. The race was continued in order to avoid a mass exodus of spectators, which would have blocked all access roads needed for use by the responding ambulances."]}, {"page": "Silverstone Circuit", "response": ["The International Trophy was notable in 1952, in that it saw a rare victory for Hersham and Walton Motors when Lance Macklin had a win."]}, {"page": "Alta Car and Engineering Company", "response": ["While the F2 engine might have been overwhelmed by the chassis' bulk, tweaks made by Peter Whitehead to the unit in his car showed that the design had tuning potential. Alta engines had already been used by the HWM team since 1949, and from 1953 many more mechanics would come to know the Taylor-designed power plant. Peter Whitehead led the way by removing the engine from F2/5 and installing it into a Cooper T24 chassis, which he ran in the 1953 British Grand Prix. Also present at Silverstone that day were no fewer than four Alta-powered HWM cars. HWM had, the previous year, scored what was Alta's only significant victory, when Lance Macklin won the 1952 BRDC International Trophy race at Silverstone. Over the next few years 1.5L and 2.5L Alta engines would find their way into many British-built F1 hopefuls, the most successful of which were Connaught and Cooper. Ultimately the engine would prove to be capable of approximately . With the collapse of Connaught in 1959, the Alta name disappeared from Formula One for good."]}, {"page": "George Abecassis", "response": ["After the failure of this enterprise, Abecassis and Heath decided to construct their own cars under the HWM banner, but retaining Alta engines. Initially the HWM cars were designed to compete in the Formula Two class, but when the World Championship switched to Formula Two regulations in  HWM cars became eligible to compete in the Grand Prix events. During their prime, HWM employed such future stars as Stirling Moss and Peter Collins, and the Belgian Johnny Claes scored their first victory, in the Grand Prix des Frontières at a street circuit in Chimay, Belgium. Abecassis's HWM team also took a notable victory in the International Trophy race at Silverstone in 1952, this time with Lance Macklin at the wheel. With the reintroduction of Formula One cars to the World Championship in , Abecassis and Heath attempted to produce a competitive car using the 2.5-litre version of the Alta engine but it was not a success; HWM cars only contested two further Grand Prix events after 1953.", "|align=\"left\"|  Lance Macklin", "|align=\"left\"|  Lance Macklin"]}, {"page": "1952 Swiss Grand Prix", "response": ["|  Lance Macklin", "|  Lance Macklin", "|  Lance Macklin"]}, {"page": "1952 Belgian Grand Prix", "response": ["Maserati's new A6GCM was still not ready, and, to compound this, their lead driver Juan Manuel Fangio had suffered back injuries at the non-championship Monza Grand Prix. This meant that Ferrari were once again favoured for success in the race, with their driver lineup consisting of Alberto Ascari (in place of André Simon), Nino Farina and Piero Taruffi. There were also two privateer Ferrari entries: local driver Charles de Tornaco of Ecurie Francorchamps, and Louis Rosier. The Gordini team expanded their lineup to include Belgian driver Johnny Claes, alongside Behra, Manzon and Bira. American Robert O'Brien also drove a Simca-Gordini for this race. HWM also recruited a pair of Belgian drivers — Paul Frère and Roger Laurent — who raced alongside regular drivers Peter Collins and Lance Macklin. Stirling Moss switched from HWM to ERA for this race. A handful of other privateer entrants also took part, including future World Champion Mike Hawthorn, who made his debut in a Cooper-Bristol.", "|  Lance Macklin", "|  Lance Macklin", "|  Lance Macklin"]}, {"page": "1952 French Grand Prix", "response": ["Having won the previous weekend's Grand Prix de la Marne, Jean Behra, racing for Equipe Gordini, was among the favourites for the first French Grand Prix to be held at Rouen-Les-Essarts. Also driving for Gordini were regulars Robert Manzon and Prince Bira, alongside Maurice Trintignant, who replaced Johnny Claes from the lineup for the previous round. Claes entered the race in a Simca-Gordini under his own 'Ecurie Belge' label, which he had used in the 1950 and 1951 seasons. Ferrari retained their lineup of Ascari, Farina and Taruffi, who had locked out the front row of the grid in Belgium. There were also several privateer Ferrari entries: the Swiss duo of Rudi Fischer and Peter Hirt, representing Ecurie Espadon, the Italian pairing of Franco Comotti and Piero Carini, for Scuderia Marzotto, and Louis Rosier. HWM again ran regular drivers Lance Macklin and Peter Collins, this time alongside Frenchman Yves Giraud-Cabantous. While the factory Maserati team remained absent, their new car, the A6GCM, made its World Championship debut, driven by Philippe Étancelin of Escuderia Bandeirantes. Enrico Platé entered a pair of older Maseratis, the 4CLT/48 model, for Toulo de Graffenried and Harry Schell. Completing the grid were Peter Whitehead, in a privately run Alta, and Mike Hawthorn, who again took part in a Cooper-Bristol.", "|  Lance Macklin", "|  Lance Macklin", "|  Lance Macklin"]}, {"page": "1952 British Grand Prix", "response": ["Jean Behra was unable to take part in the British Grand Prix, having broken his shoulder blade at the non-championship Grand Prix de Sables d'Olonne the previous weekend. Consequently, Maurice Trintignant took over Behra's Gordini T16 for Silverstone, having driven a Simca-Gordini T15 at Rouen-Les-Essarts. The Gordini team also fielded regular drivers Robert Manzon and Prince Bira. As in the previous race, Belgian driver Johnny Claes entered a privateer Simca-Gordini under the 'Ecurie Belge' moniker. Ferrari stuck with the same three drivers — Alberto Ascari, Nino Farina and Piero Taruffi — who had monopolised the podium positions at the French Grand Prix. There were also a number of privateer Ferrari entrants: Fischer and Hirt for Ecurie Espadon, Peter Whitehead and Roy Salvadori. HWM continued their policy of partnering regulars Peter Collins and Lance Macklin with a local driver, in this case Duncan Hamilton. The Connaught team ran a quartet of Lea Francis-engined entries — McAlpine, Downing, Thompson and Poore — while the remainder of the grid was made up of a series of privateers of various constructors, including Coopers and Maseratis.", "|  Lance Macklin", "|  Lance Macklin", "|  Lance Macklin"]}, {"page": "1952 Dutch Grand Prix", "response": ["Luigi Villoresi, absent from the World Championship since the final round of the 1951 season, returned to the Ferrari lineup for the Dutch Grand Prix, replacing Piero Taruffi, alongside regulars Nino Farina and Alberto Ascari, the latter of which had clinched the Drivers' Championship title two weeks previously. Charles de Tornaco also drove a Ferrari at Zandvoort, on behalf of the Ecurie Francorchamps team. Gordini entered the same three drivers from the previous event, the French trio of Behra, Manzon and Trintignant, while Belgian driver Paul Frère drove an Ecurie Belge-entered Simca-Gordini. The HWM team partnered Britons Lance Macklin and Duncan Hamilton with the local driver Dries van der Lof. The only other Dutch driver on the grid was Jan Flinterman, who took part in a Maserati for Escuderia Bandeirantes alongside Chico Landi and Gino Bianco. The works Maserati team were once again absent from the grid, following an unsuccessful appearance in Germany. The field was completed by the Connaught of Ken Downing, Mike Hawthorn's Cooper-Bristol, Ken Wharton's Frazer-Nash and Stirling Moss in an ERA.", "|  Lance Macklin", "|  Lance Macklin", "|  Lance Macklin"]}, {"page": "1952 Italian Grand Prix", "response": ["Due to the dominance of the Ferrari team throughout 1952, the World Drivers' Championship had already been clinched a month prior to the season-ending Italian Grand Prix. Nevertheless, Ferrari entered five drivers for their home race, with their Dutch Grand Prix trio—World Champion Alberto Ascari, Nino Farina and Luigi Villoresi—being joined by Piero Taruffi and André Simon, both of whom had competed for the Scuderia at various points of the season. There were also a number of privateer Ferraris, including the Ecurie Espadon pairing of Fischer and Stuck, as well as Charles de Tornaco of Ecurie Francorchamps, Louis Rosier and Peter Whitehead. The works Maserati team appeared for the first and only time in the 1952 World Championship, running three cars for Felice Bonetto, Franco Rol and José Froilán González. Also running A6GCMs were the Escuderia Bandeirantes trio of Bianco, Cantoni and Landi, while Enrico Platé's drivers—Toulo de Graffenried and debutant Alberto Crespo—ran the older 4CLT/48 equipped with the team's own revised engines. Gordini retained their previous driver lineup of Behra, Manzon and Trintignant, while Johnny Claes drove a privateer Simca-Gordini at Monza. HWM entered a pair of cars for Peter Collins and Lance Macklin, with Australian Tony Gaze running a privateer HWM. The Connaught team, absent since the British Grand Prix, returned to the Championship with a three-car entry consisting of Stirling Moss (who had driven for ERA at the previous event), Dennis Poore and Kenneth McAlpine.", "|  Lance Macklin", "|  Lance Macklin", "|  Lance Macklin"]}, {"page": "1953 Dutch Grand Prix", "response": ["The Dutch Grand Prix, which had been held in August the previous year, moved to an earlier June calendar slot in 1953. Ferrari retained the same four drivers who had competed at Buenos Aires—Alberto Ascari, Luigi Villoresi, Nino Farina and Mike Hawthorn—while there was also a privateer Ferrari for Frenchman Louis Rosier. The Scuderia's most significant competition came from the Maserati team, who came to Zandvoort with three of their four drivers from the Argentine Grand Prix: Juan Manuel Fangio, José Froilán González and Felice Bonetto. Swiss driver Toulo de Graffenried raced in a privateer Maserati for Enrico Platé's team. Gordini also entered three cars for this event, with Maurice Trintignant and Harry Schell (who had shared Trintignant's car at Buenos Aires) being retained from their lineup for Argentina. Roberto Mieres made his Grand Prix debut in the team's third car. The Connaught works team retained Kenneth McAlpine and Stirling Moss from their lineup for the previous European race, the Italian Grand Prix, while fellow British driver Roy Salvadori also drove for the team, and Johnny Claes entered a privateer Connaught. HWM also stuck with the drivers who had competed for them in Monza—Peter Collins and Lance Macklin—while Ken Wharton completed the field in his privateer Cooper-Bristol.", "|  Lance Macklin", "|  Lance Macklin", "|  Lance Macklin"]}, {"page": "1953 Belgian Grand Prix", "response": ["Two weeks after the previous World Championship race, the Dutch Grand Prix, the teams headed to the Circuit de Spa-Francorchamps in Belgium. Ferrari were once again unchanged from the previous race, retaining the lineup of Alberto Ascari, Nino Farina, Luigi Villoresi and Mike Hawthorn, while there were also privateer Ferraris for Louis Rosier and the Ecurie Francorchamps duo of Jacques Swaters and Charles de Tornaco. The Maserati factory team added Johnny Claes and a third Argentine, Onofre Marimón, to their lineup of Juan Manuel Fangio and José Froilán González, while Felice Bonetto missed this race. Toulo de Graffenried drove the only privateer Maserati at Spa. Jean Behra, whose injuries prevented his participation at Zandvoort, returned for Gordini alongside Maurice Trintignant, and the American pairing of Harry Schell and Fred Wacker, while HWM called on the services of Paul Frère (as they had done the previous year) in their third car in addition to regulars Peter Collins and Lance Macklin. The field was completed by several privateers—Berger in a Simca-Gordini, Legat in a Veritas and Pilette in a Connaught.", "|  Lance Macklin", "|  Lance Macklin", "|  Lance Macklin"]}, {"page": "1953 French Grand Prix", "response": ["|  Lance Macklin", "|  Lance Macklin"]}, {"page": "1953 British Grand Prix", "response": ["|  Lance Macklin", "|  Lance Macklin"]}, {"page": "1953 Swiss Grand Prix", "response": ["|  Lance Macklin", "|  Lance Macklin"]}, {"page": "1953 Italian Grand Prix", "response": ["|  Lance Macklin", "|  Lance Macklin"]}, {"page": "1954 French Grand Prix", "response": ["|  Lance Macklin", "|  Lance Macklin"]}, {"page": "1955 Monaco Grand Prix", "response": ["|  Lance Macklin", "|  Lance Macklin"]}, {"page": "1955 British Grand Prix", "response": ["|  Lance Macklin", "|  Lance Macklin"]}, {"page": "1955 Formula One season", "response": ["|  Lance Macklin", "|align=\"left\"|  Lance Macklin"]}, {"page": "1954 Formula One season", "response": ["|  Lance Macklin", "|align=\"left\"|  Lance Macklin"]}, {"page": "1953 Formula One season", "response": ["|  Lance Macklin", "|align=\"left\"|  Lance Macklin"]}, {"page": "1952 Formula One season", "response": ["|  Lance Macklin", "|align=\"left\"|  Lance Macklin", "|  Lance Macklin"]}, {"page": "Peter Collins (racing driver)", "response": ["At HWM Collins he became part of a three-car team with Lance Macklin and Moss, and they competed in most of the F2 races in Britain and in Europe. Collins showed in speed, but the underfinanced HWM-Alta rarely finished a race. His best result was second place in the Grand Prix des Sables d'Olonne. Collins got his Formula One break in 1952, with HWM when he replaced Moss. His best result in a World Championship event that year was sixth in the French Grand Prix at Rouen-Les-Essarts.", "|align=\"left\"|  Lance Macklin"]}, {"page": "Hersham and Walton Motors", "response": ["|align=\"left\"|  Lance Macklin", "|align=\"left\"|  Lance Macklin", "|align=\"left\"|  Lance Macklin"]}, {"page": "Graham Whitehead", "response": ["|align=\"left\"|  Lance Macklin"]}, {"page": "Aston Martin DB2", "response": ["Three pre-production cars were entered for the 1949 24 Hours of Le Mans. One, which would become the development car for the production DB2, had the Lagonda straight-6, while the four-cylinder Aston Martin 2-litre unit powered the other two. After six laps the Lagonda-powered car, driven by Leslie Johnson, retired with overheating caused by failure of the water pump. One of the 2-litre cars was in 4th place and running without brakes when it crashed two hours short of the finish, fatally injuring driver Pierre Maréchal. The other finished 7th, crewed by Arthur Jones and Nick Haines.  A month later, the larger-engined car, driven by Leslie Johnson and Charles Brackenbury, finished 3rd in the Spa 24-hour race, where one of the 2-litre cars was driven to 5th by Nick Haines and Lance Macklin.", "For 1950 all three factory team cars were equipped with the Lagonda engine.  At the 1950 Le Mans race the one driven by  George Abecassis and Lance Macklin finished 5th, with Brackenbury and Reg Parnell bringing another home 6th, which won Aston Martin 1st and 2nd in the 3-litre class. Across the Atlantic, Briggs Cunningham drove his DB2 to 2nd in its class at the inaugural Sebring race meeting in December 1950. The factory team cars continued racing in Europe throughout 1951, including at Le Mans, where Macklin and Eric Thompson took 3rd overall, with Abecassis and Brian Shawe-Taylor 5th."]}, {"page": "1955 Le Mans disaster", "response": ["The crash started when Jaguar driver Mike Hawthorn pulled to the right side of the track in front of Austin-Healey driver Lance Macklin and started braking for his pit stop. Macklin swerved out from behind the slowing Jaguar into the path of Levegh, who was passing on the left in his much faster Mercedes-Benz 300 SLR. Levegh rear-ended Macklin at high speed, overriding Macklin's car and launching his own car through the air. Levegh's car skipped over a protective earthen berm at 200 km/h (125 mph) and made at least two impacts within the spectator area, the last of which caused the car to disintegrate, throwing him onto the track where he was instantly killed. Large pieces of debris, including the Mercedes' engine block, radiator, front suspension, and bonnet (hood), were sent flying into the packed spectator area in front of the grandstand. The rear of Levegh's car landed on the berm and exploded into flames.", "On lap 35, Hawthorn and Fangio were racing as hard as ever. In his biography, Hawthorn said he was \"momentarily mesmerized by the legend of the Mercedes superiority... Then I came to my senses and thought ‘Damn it, why should a German car beat a British car.'\"Nixon 1991, p.115Cannell 2011, p.71 The lap before, Hawthorn's pit crew had signalled for him to come in the next lap. He had just lapped Levegh (running sixth) after Arnage (one of the corners of the race track) and was determined to keep Fangio at bay as long as possible.Clarke 1997, p.119: Autosport Jun24 1955 Coming out of the Maison Blanche portion of the course, he rapidly caught Lance Macklin in his Austin Healey 100S, who had seen him and moved over to the right to let him pass. Putting another lap on Macklin coming up to the main straight, Hawthorn then raised his hand to indicate he was pitting and pulled across to the right (from Hawthorn's testimony).Laban 2001, p.116 What caught Macklin out though was that Hawthorn, using the Jaguar's advanced disc brakes, braked hard enough to slow his Jaguar from such a speed in time.Foster 2013, p.1968Whitaker 2014, p.88Anderson 2000, p.14"]}, {"page": "Eric Thompson (racing driver)", "response": ["In 1951 Thompson competed prominently in open-wheel racing. He competed in the Goodwood Lavant Cup in a Cooper finishing fifth and finished in the same position in a Bugatti Type 51 in a Boreham Libre event. He later competed in an ERA/Delage and Delahaye and other Libre races, and took part in sports car events with an Aston Martin DB2 in the RAC Tourist Trophy where he finished third in his class and eighth overall. For the works team, Thompson shared a DB2 with Lance Macklin in the Les 24 Heures du Mans where the pair clinched victory in the 3-litre class and finished third overall.", "|align=\"left\"|  Lance Macklin"]}, {"page": "Impact attenuator", "response": ["A Fitch barrier consists of sand-filled plastic barrels, usually yellow-colored with a black lid.  The \"Fitch Highway Barrier System\" was invented by race car driver John Fitch after the 1955 24 Hours of Le Mans race when his co-driver, Pierre Levegh rear-ended Austin-Healey driver Lance Macklin at high speed, launching his car through the air and into the spectator's area.  The car burst into flames and took the lives of Pierre and 84 spectators in one of the worst accidents in racing history.  He stated he was inspired by sand-filled fuel cans which he used to protect his tent from strafing during World War II. Early prototypes were self funded and tested due to low initial support. As a proof of concept Fitch used liquor barrels filled with sand to create the necessary impact attenuation, then personally crashed reinforced vehicles into them while recording with a high speed camera to capture the rate of deceleration."]}, {"page": "2002 in the United Kingdom", "response": ["*29 August – Lance Macklin, racing driver (born 1919)"]}, {"page": "1955 24 Hours of Le Mans", "response": ["At 6.20pm, at the end of lap 35 when the first pit-stops were due, the 1955 Le Mans disaster occurred. Having got the order from his Jaguar crew to pit, Hawthorn braked sharply in front of Lance Macklin's Austin-Healey.Clarke 1997, p.130: Road & Track Sept 1955 Macklin then braked hard, getting off the right-hand edge of the track and throwing up dust.Foster 2013, p.1968Whitaker 2014, p.88Anderson 2000, p.14 Macklin's car then veered back to the centre of the track, into the path of Levegh's Mercedes-Benz, which was running 6th having just gone a lap down. Travelling at 150 mph, Levegh's right-front wheel rode up onto the left rear corner of Macklin's, launching the car into the air and rolling end over end for 80 metres over spectators.", "The next round of the World Sports Car Championship at the Nürburgring was cancelled, as was the Carrera Panamericana.  The accident caused widespread shock and immediate bans on auto racing in many countries.  A number of racing teams including Mercedes-Benz, MG and Bristol had disbanded and withdrawn from racing by the end of the season.  The scale of the accident caused some drivers present, including Phil Walters (who had been offered a drive with Ferrari for the rest of the season), Sherwood Johnston, and John Fitch (after completing the season with Mercedes-Benz), to retire from racing. Fitch was coaxed out of retirement by his friend Briggs Cunningham to help the Chevrolet Corvette effort at Le Mans in 1960 and later worked to develop traffic safety devices including the sand-filled \"Fitch barrels\". Less than three months later, Lance Macklin decided to retire after being involved in a twin fatality accident during the 1955 RAC Tourist Trophy race at Dundrod Circuit. Juan-Manuel Fangio never raced at Le Mans again.", "|  Lance Macklin(private entrant)", "|  Lance Macklin Les Leston"]}, {"page": "1954 24 Hours of Le Mans", "response": ["Meanwhile, in the smaller classes, the pair of works OSCAs had an ample lead of 15 laps over the struggling Porsches and running in the top-10 overall. Yet within ten minutes, with just 2 hours to go, everything fell apart. First, the leading one of Giardini crashed and rolled at Mulsanne, then the one running second hit the barriers at Dunlop curve. Pierre Leygonie ran the short distance back to the pits to get equipment and advice from the pit-crew. He managed to get it going again and back to the pits to hand over to Lance Macklin but they were then disqualified at race-end for having abandoned the car. Moity 1974, p.52 To round off a bitter race for OSCA, their last car was running second in the S-1100 class but its transmission broke in the final laps of the race.", "|  Lance Macklin Pierre Leygonie James Simpson"]}, {"page": "1953 24 Hours of Le Mans", "response": ["Donald Healey this year had two collaborations: his last year with Nash Motors with a pair of long-tailed models, and a new partnership with the Austin Motor Company using its 2.7L engine, producing only 100 bhp but capable of 190 km/h. Bristol also arrived with two cars for Lance Macklin / Graham Whitehead and Jack Fairman / Tommy Wisdom, and managed by former Bentley Boy and Le Mans winner Sammy Davis. The rear-engined 450 coupés were ugly and noisy but the 2 litre engine could get them to nearly 230 km/h.Spurring 2011, p.167", "|  Lance Macklin Graham Whitehead"]}, {"page": "1952 24 Hours of Le Mans", "response": ["|  Lance Macklin Peter Collins"]}, {"page": "1951 24 Hours of Le Mans", "response": ["|  Lance Macklin Eric Thompson"]}]}}