{"wiki_id": "http://www.wikidata.org/entity/Q172830", "itemLabel": "Don Beauman", "itemDescription": "British racing driver (1928-1955)", "wikipedia_url": "https://en.wikipedia.org/wiki/Don_Beauman", "wikipedia_page": {"main": "Donald Bentley Beauman (26 July 1928  – 9 July 1955) was a British Formula One driver who took part in one World Championship Grand Prix.\nBeauman was born in Farnborough, Hampshire, the only son of Brigadier General Archibald Bentley Beauman CBE DSO and Bar (30 November 1888 – 22 March 1977). He had a career as a hotelier but began motor racing in 1950.\nBeauman ran a Cooper 500 for two years in Formula Three before switching to sports car racing, and took on Formula One in 1954 with a Connaught A-Type, sponsored by wealthy privateer Sir Jeremy Boles. He finished eleventh in the British Grand Prix at Silverstone. He achieved some success in Formula Two, with several third and fourth-place finishes and a second place in the Madgwick Cup at Goodwood. In 1955, the weekend before the British Grand Prix, he was killed when he crashed his Connaught during the Leinster Trophy race in Wicklow. He had set the fastest time of 82.94 mph (133.45 km/h) on his first lap but crashed near the Beehive pub on his second and was killed instantly. Beauman's death plus other fatal racing accidents that year brought an end to motor car racing at the Curragh.", "link_mentions": [{"page": "July 9", "response": ["*1955 – Don Beauman, English race car driver (b. 1928)"]}, {"page": "July 26", "response": ["*1928 – Don Beauman, English race car driver (d. 1955)"]}, {"page": "Curragh", "response": ["After The Emergency both motor cars and motorcycle racing took place on occasions drawing crowds up to 30,000. For eight years from 1947 until 1954 cars competed, while motorcycle racing continued until 1967. The first race was run by the Leinster Motor Club on 12 July 1947 over a  course known as the \"Short circuit\" but eight years later the death of Don Beauman during at a different Irish venue plus other fatal racing accidents in 1955 brought an end to motor car racing at the Curragh. The 1951 Wakefield Trophy was won by the then 22-year-old Stirling Moss."]}, {"page": "1954 British Grand Prix", "response": ["|  Don Beauman", "|  Don Beauman"]}, {"page": "1954 Formula One season", "response": ["|  Don Beauman", "|align=\"left\"|  Don Beauman"]}, {"page": "Connaught Engineering", "response": ["| Don Beauman"]}, {"page": "Oulton Park", "response": ["In August, Oulton Park saw its first international meeting when the Daily Dispatch sponsored the Oulton Park Gold Cup. Apart from the 11-year period when Aintree ran international Formula One races, it fell to Oulton Park to bring the major formulae to the northwest of England and the Gold Cup was run for all the major formulae: Formula One, Formula Two, Formula 5000 and the big sport cars. Its first running over the second new circuit of the year, the 2.761 mile International circuit, and was for Formula One; the entry was entirely British with the exception of Jean Behra in his Gordini. There were 19 starters; Stirling Moss started from the back of the grid in his new Maserati 250F which had only arrived from the factory on the morning of the race. By the end of lap one, he had passed twelve of his rivals and took the lead from Reg Parnell's Ferrari 625 on the fourth lap to win by 1min 14.4sec at the end of the 36-lap race. Bob Gerard's Cooper-Bristol and Don Beauman's Connaught were the only two other cars on the same lap as Moss. This was the first of Moss's victories in the Gold Cup – he went on to win it another four times, repeating the win in 1955, 1959, 1960 and 1961."]}, {"page": "1955 Le Mans disaster", "response": ["Meanwhile, Macklin's car, heavily damaged, rammed the left-side barrier, then veered to the right of the track into the pit lane, narrowly missing Kling's Mercedes-Benz, Roberto Mieres's Maserati, and Don Beauman's Jaguar, all of which were already in the pits refuelling before the accident. Macklin's car hit the unprotected pit-wall, just short of the Cunningham and Mercedes-Benz pits where Shell and Lockheed equipment were stationed, running down a policeman, a photographer and two officials (all seriously injured), then rebounded back across the track again to end up skating down the left-side fence for a second time. Macklin survived the incident without serious injury, jumping out of the wreck and over the bank."]}, {"page": "1955 24 Hours of Le Mans", "response": ["Jaguar arrived with three works D-types. This year's model had engine power increased from , for a top speed of almost .Spurring 2011, p.219 The team consisted of 1953 winners Tony Rolt and Duncan Hamilton; up-and-coming English star Mike Hawthorn (stolen from Ferrari) paired with rookie Ivor Bueb; and Jaguar test driver Norman Dewis sharing the third car with Don Beauman. They were backed up by D-Types entered by Belgium's Ecurie Francorchamps and from American Briggs Cunningham's team.", "Meanwhile, Don Beauman had planted his works Jaguar in the sandtrap at Arnage. Having taken over an hour to dig it out, he had just got it free after 10 pm when Colin Chapman came off at Arnage and smacked the Jaguar. Chapman quickly reversed and got going again only to be disqualified because he had restarted without the marshal's permissionSpurring 2011, p.234", "|  Don Beauman Norman Dewis"]}, {"page": "1955 in the United Kingdom", "response": ["*9 July – Don Beauman, racing driver (born 1928)"]}, {"page": "List of people from Hampshire", "response": ["*Don Beauman, racing driver, was born in Farnborough"]}, {"page": "1953 1000km of Nürburgring", "response": ["|  Don Beauman "]}, {"page": "1954 RAC Tourist Trophy", "response": ["|  Don Beauman"]}, {"page": "Norman Dewis", "response": ["Dewis drove a Jaguar D-Type in the 1955 24 Hours of Le Mans, with Don Beauman. The car failed to finish the race, retiring 106 laps into the race."]}]}}