{"wiki_id": "http://www.wikidata.org/entity/Q1723111", "itemLabel": "Kamlesh Patel, Baron Patel of Bradford", "itemDescription": "British politician (born 1960)", "wikipedia_url": "https://en.wikipedia.org/wiki/Kamlesh_Patel,_Baron_Patel_of_Bradford", "wikipedia_page": {"main": "Kamlesh Kumar Patel, Lord Patel of Bradford, OBE (born 28 September 1960) is a member of the House of Lords. Having been appointed an Officer of the Order of the British Empire (OBE) in the 1999 Birthday Honours, he was created a life peer as Baron Patel of Bradford, of Bradford in the County of West Yorkshire on 8 June 2006.A qualified Social Worker, he worked in inner city Bradford and then established a number of Third Sector agencies working with those misusing drugs and those with mental health problems; later moving to academia working with a number of universities.\nOn 19 March 2018, Lord Patel of Bradford was appointed by the Secretary of State for Education and the Secretary of State for Health & Social Care as the Chair of Social Work England.  Social Work England will be the new regulator for all child, family and adult social workers in England.\nLord Patel of Bradford was previously chair of the Mental Health Act Commission.  He was a Commissioner of the Healthcare Commission and The National Treatment Agency for Substance Misuse.  He has over 200 publications and has authored a number of national reports including The Patel Report into Prison Drug Treatment.\nLord Patel is Senior Independent Director of the England Wales Cricket Board (ECB), appointed in 2016.\nHe is Vice President of the British Board of Film Classification, appointed in May 2018.\nHe is President of the Royal Society for Public Health and the Institute of Healthcare Management; and Patron/Chairman of a number of not for profit organisations working in the health, education, social care and criminal justice sectors.\nHe is Senior Independent Director of Cygnet Healthcare and Chair of its UK Advisory Board.\nHe is Chair of the Independent Health Providers Network.\nHe is Chair of Breaking Barriers Innovations.\nHe is Chair of the India Business Group.\nHe is a member of Oxford Somerville India Centre.\nHe is Patron of Southampton University India Centre.\nHe is Advisor to the Global Policy Institute at Queen Mary University London.\nOn 5 November 2021 he was appointed as a director and chair of Yorkshire County Cricket Club, after the previous chairman Roger Hutton resigned following the result of investigation into racism at Yorkshire County Cricket Club.", "link_mentions": [{"page": "September 28", "response": ["*  1960   – Kamlesh Patel, Baron Patel of Bradford, English politician"]}, {"page": "List of barons in the peerages of Britain and Ireland", "response": ["#*Kamlesh Patel, Baron Patel of Bradford"]}, {"page": "List of people from Gujarat", "response": ["|Kamlesh Patel, Baron Patel of Bradford || Politician || British politician"]}, {"page": "Lord Patel", "response": ["*Kamlesh Patel, Baron Patel of Bradford, British politician"]}, {"page": "Baron Patel of Bradford", "response": ["#REDIRECT Kamlesh Patel, Baron Patel of Bradford"]}, {"page": "Lord Patel of Bradford", "response": ["#REDIRECT Kamlesh Patel, Baron Patel of Bradford"]}, {"page": "Kamlesh Kurmar Patel", "response": ["#REDIRECT Kamlesh Patel, Baron Patel of Bradford"]}, {"page": "Beckfoot Upper Heaton", "response": ["* Kamlesh Patel, Baron Patel of Bradford, OBE – politician and member of the House of Lords."]}, {"page": "Kamlesh", "response": ["*Kamlesh Patel, Baron Patel of Bradford (born 1960), British politician and life peer"]}, {"page": "List of ethnic minority politicians in the United Kingdom", "response": ["|Kamlesh Patel, Baron Patel of Bradford"]}, {"page": "Kamlesh Patel, Baron Patel", "response": ["#REDIRECT Kamlesh Patel, Baron Patel of Bradford"]}, {"page": "List of people with surname Patel", "response": ["*Kamlesh Patel, Baron Patel of Bradford, British politician"]}, {"page": "Kamlesh Patel", "response": ["*Kamlesh Patel, Baron Patel of Bradford"]}]}}