{"wiki_id": "http://www.wikidata.org/entity/Q173869", "itemLabel": "Alfred Tennyson", "itemDescription": "British poet and Poet Laureate of Great Britain and Ireland (1809-1892)", "wikipedia_url": "https://en.wikipedia.org/wiki/Alfred,_Lord_Tennyson", "wikipedia_page": {"main": "Alfred Tennyson, 1st Baron Tennyson  (6 August 1809 – 6 October 1892) was an English poet. He was the Poet Laureate during much of Queen Victoria's reign and remains one of the most popular British poets. In 1829, Tennyson was awarded the Chancellor's Gold Medal at Cambridge for one of his first pieces, \"Timbuktu\". He published his first solo collection of poems, Poems Chiefly Lyrical in 1830. \"Claribel\" and \"Mariana\", which remain some of Tennyson's most celebrated poems, were included in this volume. Although described by some critics as overly sentimental, his verse soon proved popular and brought Tennyson to the attention of well-known writers of the day, including Samuel Taylor Coleridge. Tennyson's early poetry, with its medievalism and powerful visual imagery, was a major influence on the Pre-Raphaelite Brotherhood.\nTennyson also excelled at penning short lyrics, such as \"Break, Break, Break\", \"The Charge of the Light Brigade\", \"Tears, Idle Tears\", and \"Crossing the Bar\". Much of his verse was based on classical mythological themes, such as \"Ulysses\", although \"In Memoriam A.H.H.\" was written to commemorate his friend Arthur Hallam, a fellow poet and student at Trinity College, Cambridge, after he died of a stroke at the age of 22. Tennyson also wrote some notable blank verse including Idylls of the King, \"Ulysses\", and \"Tithonus\". During his career, Tennyson attempted drama, but his plays enjoyed little success.\nA number of phrases from Tennyson's work have become commonplace in the English language, including \"Nature, red in tooth and claw\" (\"In Memoriam A.H.H.\"), \"'Tis better to have loved and lost / Than never to have loved at all\", \"Theirs not to reason why, / Theirs but to do and die\", \"My strength is as the strength of ten, / Because my heart is pure\", \"To strive, to seek, to find, and not to yield\", \"Knowledge comes, but Wisdom lingers\", and \"The old order changeth, yielding place to new\". He is the ninth most frequently quoted writer in The Oxford Dictionary of Quotations.\n\n", "link_mentions": [{"page": "Dante Alighieri", "response": ["Dante was instrumental in establishing the literature of Italy. His depictions of Hell, Purgatory and Heaven provided inspiration for the larger body of Western art and literature. He is cited as an influence on such English writers as Geoffrey Chaucer, John Milton and Alfred Tennyson, among many others. In addition, the first use of the interlocking three-line rhyme scheme, or the terza rima, is attributed to him. He is described as the \"father\" of the Italian language, and in Italy he is often referred to as  (\"the Supreme Poet\"). Dante, Petrarch, and Boccaccio are also called the  (\"three crowns\") of Italian literature."]}, {"page": "Edmund Spenser", "response": ["Spenser was called \"the Poet's Poet\" by Charles Lamb, and was admired by John Milton, William Blake, William Wordsworth, John Keats, Lord Byron, Alfred Tennyson and others. Among his contemporaries Walter Raleigh wrote a commendatory poem to The Faerie Queene in 1590, in which he claims to admire and value Spenser's work more so than any other in the English language. John Milton in his Areopagitica mentions \"our sage and serious poet Spenser, whom I dare be known to think a better teacher than Scotus or Aquinas\".Milton, John. Areopagitica.  In the eighteenth century, Alexander Pope compared Spenser to \"a mistress, whose faults we see, but love her with them all.\"Elliott, John, ed. The Prince of Poets. New York: New York University Press, 1968. 7–13. Print."]}, {"page": "Elizabeth Barrett Browning", "response": ["The couple came to know a wide circle of artists and writers including William Makepeace Thackeray, sculptor Harriet Hosmer (who, she wrote, seemed to be the \"perfectly emancipated female\") and Harriet Beecher Stowe. In 1849 she met Margaret Fuller, and the female French novelist George Sand in 1852, whom she had long admired. Among her intimate friends in Florence was the writer Isa Blagden, whom she encouraged to write novels.\"Isa Blagden\", in: The Brownings' Correspondence. Retrieved 13 May 2015. They met Alfred Tennyson in Paris, and John Forster, Samuel Rogers and the Carlyles in London, later befriending Charles Kingsley and John Ruskin.", "In London, John Kenyon, a distant cousin, introduced Elizabeth to literary figures including William Wordsworth, Mary Russell Mitford, Samuel Taylor Coleridge, Alfred Tennyson and Thomas Carlyle. Elizabeth continued to write, contributing \"The Romaunt of Margaret\", \"The Romaunt of the Page\", \"The Poet's Vow\" and other pieces to various periodicals. She corresponded with other writers, including Mary Russell Mitford, who would become a close friend and who would support Elizabeth's literary ambitions."]}, {"page": "Edward Lear", "response": ["* Poems and Songs by Alfred Tennyson (1853, 1859, 1860) Twelve total musical settings published, each being for a Tennyson poem."]}, {"page": "Isle of Wight", "response": ["* Poet Alfred Tennyson"]}, {"page": "January 9", "response": ["*1903 – Hallam Tennyson, 2nd Baron Tennyson, son of the poet Alfred Tennyson, becomes the second Governor-General of Australia."]}, {"page": "King Arthur", "response": ["In the early 19th century, medievalism, Romanticism, and the Gothic Revival reawakened interest in Arthur and the medieval romances. A new code of ethics for 19th-century gentlemen was shaped around the chivalric ideals embodied in the \"Arthur of romance\". This renewed interest first made itself felt in 1816, when Malory's Le Morte d'Arthur was reprinted for the first time since 1634. Initially, the medieval Arthurian legends were of particular interest to poets, inspiring, for example, William Wordsworth to write \"The Egyptian Maid\" (1835), an allegory of the Holy Grail. Pre-eminent among these was Alfred Tennyson, whose first Arthurian poem \"The Lady of Shalott\" was published in 1832.See  for the sources that Tennyson used when writing this poem Arthur himself played a minor role in some of these works, following in the medieval romance tradition. Tennyson's Arthurian work reached its peak of popularity with Idylls of the King, however, which reworked the entire narrative of Arthur's life for the Victorian era. It was first published in 1859 and sold 10,000 copies within the first week. In the Idylls, Arthur became a symbol of ideal manhood who ultimately failed, through human weakness, to establish a perfect kingdom on earth.See  and  for analyses of The Idylls of the King. Tennyson's works prompted a large number of imitators, generated considerable public interest in the legends of Arthur and the character himself, and brought Malory's tales to a wider audience.See, for example, . Indeed, the first modernisation of Malory's great compilation of Arthur's tales was published in 1862, shortly after Idylls appeared, and there were six further editions and five competitors before the century ended."]}, {"page": "Poetry", "response": ["A limerick is a poem that consists of five lines and is often humorous. Rhythm is very important in limericks for the first, second and fifth lines must have seven to ten syllables. However, the third and fourth lines only need five to seven. All of the lines must rhyme and have the same rhythm.  Practitioners of the limerick included Edward Lear, Lord Alfred Tennyson, Rudyard Kipling, Robert Louis Stevenson. ", "Notable narrative poets have included Ovid, Dante, Juan Ruiz, William Langland, Chaucer, Fernando de Rojas, Luís de Camões, Shakespeare, Alexander Pope, Robert Burns, Adam Mickiewicz, Alexander Pushkin, Edgar Allan Poe, Alfred Tennyson, and Anne Carson.", "Notable practitioners of elegiac poetry have included Propertius, Jorge Manrique, Jan Kochanowski, Chidiock Tichborne, Edmund Spenser, Ben Jonson, John Milton, Thomas Gray, Charlotte Smith, William Cullen Bryant, Percy Bysshe Shelley, Johann Wolfgang von Goethe, Evgeny Baratynsky, Alfred Tennyson, Walt Whitman, Antonio Machado, Juan Ramón Jiménez, William Butler Yeats, Rainer Maria Rilke, and Virginia Woolf."]}, {"page": "Ezra Pound", "response": ["In August 1908 Pound moved to London, carrying 60 copies of A Lume Spento.Baumann (1984), 357 English poets such as Maurice Hewlett, Rudyard Kipling, and Alfred Tennyson had made a particular kind of Victorian verse—stirring, pompous, and propagandistic—popular. According to modernist scholar James Knapp, Pound rejected the idea of poetry as \"versified moral essay\"; he wanted to focus on the individual experience, the concrete rather than the abstract.Knapp (1979), 25–27"]}, {"page": "Surrey", "response": ["* Alfred Tennyson (1809–1892) spent the latter part of his life, and died, in Haslemere."]}]}}