{"wiki_id": "http://www.wikidata.org/entity/Q17385945", "itemLabel": "Ross Gardler", "itemDescription": "British open source advocate", "wikipedia_url": "https://en.wikipedia.org/wiki/Ross_Gardler", "wikipedia_page": {"main": "Ross Gardler (born 10 December 1969 in Dundee, Scotland), is an open source software advocate who volunteers time to many open source projects and initiatives, in particular to the Apache Software Foundation.\nHe has served as a VP, Director and President of the Apache Software Foundation and currently (2017) holds the title of Executive Vice President. He is a committer on a number of Apache projects, though is more often seen providing community support than code. He can also be found in other projects and foundations acting as a mentor or community contributor.\nGardler's original career was as a manager and sound engineer for a well respected though \"undiscovered\" Dub Reggae band in Manchester, UK called C-Charge. This early music career lasted around eight years and ended with Ross selling the record label and management company he had created in order to return to formal education and study computer science in 1995.\nIt is during these studies that Ross first became involved in open source, initially as a user and later as a contributor where he claims that studying, using and contributing to open source software is far more educational than any of his other undertakings. Upon completing his undergraduate degree he went on to study for a PhD. in the field of component based software composition. In 2003 Ross married Heidi-Marie Brannan and the newlyweds moved to Trinidad and Tobago where Ross became a lecturer at the University of the West Indies. Here he worked to bring open source into his lecture series while creating the countries first native open source project (the now defunct Burrokeet e-learning content editor). He received an IBM Innovation Award in recognition of this work in 2004.\nThis award enabled Ross to return to the UK with his now pregnant wife and focus on his open source contributions. He acted as the Apache Software Foundations Google Summer of Code administrator in its first few years. This work led to the creation of the Apache Community Development Project in 2009 where Gardler acted as the first Vice President of Community Development. This Apache project continues to manage the foundations engagement with mentoring programs and other such activities.\nIn 2007 Ross and family moved to Oxford, UK where he took on the role of Manager at OSS Watch the publicly funded open source advisory service for the UK Higher and Further Education sector. In this role he focused on how openness in software development could help drive innovations in the academic sector. In 2011 he again returned to consulting work and in 2013 he and his family moved to Redmond, WA as Ross joined Microsoft Open Technologies, Inc. a wholly owned subsidiary of Microsoft which exists to \"further advance the company’s long-standing investments in openness including interoperability, open standards and open source.\".Shortly after joining Microsoft Open Technologies, Inc. the Apache Software Foundation board elected Gardler to act as President of the foundation. In 2015 Microsoft Open Technologies was merged into Microsoft and Ross moved to a team delivering open source on Azure.\nHe was the founding Program Manager on the Azure Container Service which, in 2016 attracted Brendan Burns, a co-founder of Kubernetes as lead architect. In 2017, the container startup company Deis was acquired to add significant technical strength to the team.\nThroughout his work at Microsoft Ross has continued to be fully engaged with open source projects and often speaks on the topic of innovation through open source at key events around the world. In 2021 Ross was elected to the board of OASIS Open in order to work \"with OASIS as it leverages the intersection of open source and open standards\".", "link_mentions": [{"page": "OSS Watch", "response": ["The OSS Watch team is made up of a balance of academic and business oriented people with a wide range of backgrounds. Between June 2007 and June 2010 the team was led by Ross Gardler, a recognised open source participant (Ross has served in many roles, including Vice President of Community Development, a member of the Board of Directors at The Apache Software Foundation, President of the ASF and mentor for many other project communities). In June 2011 Ross left to form a spin-out company (and later joined Microsoft Open Technologies, Inc in 2013) and was replaced as OSS Watch manager by Sander van der Waal. In September 2012, Scott Wilson of CETIS and the Apache Wookie project joined OSS Watch replacing Sander as Service Manager. The current team features three full-time staff and several other members with a variety of backgrounds from Computer Science to Anthropology. The organisation's advisory committee includes representatives from the academic, not-for-profit and business sectors.", "In June 2011 Ross Gardler and Steve Lee span out a company from OSS Watch. This company, OpenDirective, provides very similar services to OSS Watch in both the public and private sectors. This company remains closely connected with the University of Oxford and OSS Watch and seeks to expand the revenue streams available to OSS Watch as well as to provide more proactive support rather than just advice. OpenDirective is providing support to a number of the flagship projects that are of interest to the commercial sector while OSS Watch continues to provide services to those projects that are solely of interest to the academic sector."]}]}}