{"wiki_id": "http://www.wikidata.org/entity/Q17318849", "itemLabel": "William Rashleigh", "itemDescription": "British politician (1817-1871)", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Rashleigh_(1817%E2%80%931871)", "wikipedia_page": {"main": "William Rashleigh (16 April 1817 – 31 October 1871) was an English Conservative Party politician.\n\nHe was the eldest son of William Rashleigh I and his second wife Caroline Hinxman, daughter of Henry Hinxman of Ivychurch, Wiltshire.\nHe was a Member of Parliament (MP) for East Cornwall from 1841 to 1847. In 1855 he succeeded on the death of his father to the Menabilly estate near Fowey on the south coast of Cornwall.\nHe died in 1871. In 1843 he had married Hon. Catherine Stuart (died 1872), eldest daughter of the Scottish peer Robert Walter Stuart, 11th Lord Blantyre (1777–1830). He left no male progeny and was succeeded by his brother Jonathan Rashleigh (1820–1905).", "link_mentions": [{"page": "East Cornwall (UK Parliament constituency)", "response": ["|rowspan=\"2\"| William Rashleigh ||rowspan=\"2\"| Conservative"]}, {"page": "Menabilly", "response": ["Philip Rashleigh (1729–1811) landscaped the gardens and planted the woodland around the house and estate. William Rashleigh, his nephew, succeeded after Philip's death in 1811, and following a fire in 1822 rebuilt the house greatly extended in size.", "Philip Rashleigh III (1729–1811),RASHLEIGH, Philip (1729-1811), of Menabilly, nr. Fowey, Cornw. eldest son and heir, MP for Fowey. He was a renowned mineralogist who wrote many books on the subject and a well-known collector of mineral samples, for the storage of which he dedicated a room at Menabilly. Philip also started a coin collection which became one of the largest in the country. He landscaped the gardens and built the grotto at Polridmouth said to be made of \"every variety of English and foreign stones and shell\" and also planted the woodland around the house and elsewhere on the estate. In 1782 he married his cousin Jane Pole (died 1795), daughter of Rev. Carolus Pole by his wife Sarah Rashleigh, but died without issue, when his heir became his nephew William Rashleigh (1777–1855).", "===William Rashleigh I (1777–1855)===", "William Rashleigh I (1777–1855), nephew, MP for Fowey 1812–18, Sheriff of Cornwall in 1818. He was a member of the Church Missionary Society and built Tregaminion Chapel. In 1822 a fire broke out which led him to greatly extend the house.", "=== William Rashleigh II (1817–1871)===", "William Rashleigh II (1817–1871), eldest son by second marriage, JP, DL and MP for East Cornwall 1841–47. He travelled in the Middle East and whilst in Egypt he met a sheikh in Cairo who on hearing the name  Rashleigh asked if he knew Philip Rashleigh and told him that many years before as a prisoner of war in England Philip had invited him to Menabilly many times. In 1843 he married Hon. Catherine Stuart (died 1872), eldest daughter of the Scottish peer Robert Walter Stuart, 11th Lord Blantyre (1777–1830). He left no male progeny and was succeeded by his brother Jonathan Rashleigh (1820–1905)", "thumb|Evelyn William Rashleigh (1850–1926), of Stoketon, Saltash, Cornwall, younger son of Jonathan Rashleigh (1820–1905) of Menabilly.)  Royal Cornwall Museum, Truro", "Jonathan Rashleigh IV (1820–1905), brother of William Rashleigh (1817-1871), of Menabilly, Feniton Court in Devon, and Lissadrone, County Mayo, Ireland, the latter were the lands that were absorbed after his second marriage to Jane Elizabeth Pugh (1836-1902), daughter of Arthur Pugh, of Lissadrone, Co.Mayo.Bell’s Weekly Messenger, Saturday, 7 August 1869", "Rashleigh’s first wife died in 1852, leaving him a youthful widower with five small children: Caroline Mary Stuart (Rashleigh) Long, Jonathan Rashleigh, Alice Henrietta Rashleigh, Evelyn William Rashleigh and Mary Anna Rashleigh, during much of his middle life. He occupied some of his time during this period by serving as a member of the Metropolitan Board of Works, on which he represented the St.Pancras district, and as a member of the Metropolitan Asylums Board, including being Chairman of Cornwall County Lunatic Asylum Committee for twelve years 1873-1885.", "On 3rd of August 1869, Jonathan Rashleigh married an Irish heiress, Jane Elizabeth Pugh (1836-1902), the only daughter of Arthur Pugh, of Lissadrone, Co.Mayo. by whom he had four further children: Eleanor Elizabeth (Rashleigh) Tremayne, Arthur Rashleigh, Kathleen Rashleigh and  Rachel Jane Rashleigh. After his second marriage, Jonathan Rashleigh (1820-1905) together with his second wife and three children from the first marriage: Alice Henrietta Rashleigh, Evelyn William Rashleigh and Mary Anna Rashleigh, had moved in to his marital home - Fortfield House, Sidmouth, Devon. In 1871, he purchased the \"Feniton Court Estate not very many miles away in East Devon\".BNS Research Blog, by Hugh Pagan, 1 October 2019"]}, {"page": "William Rashleigh", "response": ["William Rashleigh may refer to:", "* William Rashleigh (MP for Fowey) (1777–1855), MP for Fowey 1812–18, Sheriff of Cornwall in 1818", "* William Rashleigh (1817–1871), English Conservative Party politician, MP for East Cornwall 1841–47", "* William Rashleigh (cricketer) (1867–1937), English cricketer who played first class cricket for Kent and Oxford University between 1885 and 1901"]}, {"page": "William Rashleigh (1817-1871)", "response": ["#REDIRECT William Rashleigh (1817–1871)"]}, {"page": "William Rashleigh (MP for Fowey)", "response": ["William Rashleigh (11 January 1777 – 14 May 1855) was an English politician and landowner from Cornwall.", "He died in 1855 at Kilmarth, near Menabilly. He had married twice: firstly Rachel, the daughter of William Stackhouse of Trehane, with whom he had two daughters; and secondly Caroline, the daughter of Henry Hinxman of Ivychurch, Wiltshire with whom he had two sons and four daughters. Menabilly descended to his son William Rashleigh II."]}]}}