{"wiki_id": "http://www.wikidata.org/entity/Q17308823", "itemLabel": "Frederic Bonney", "itemDescription": "British photographer", "wikipedia_url": "https://en.wikipedia.org/wiki/Frederic_Bonney", "wikipedia_page": {"main": "Frederic Bonney (1842–1921) was a British land owner and photographer. He took photographs at Momba Station in New South Wales in the 1870s and he was known for these and his anthropology. He was born and died in Rugeley, Staffordshire.", "link_mentions": [{"page": "Rugeley", "response": ["* Frederic Bonney FRS (1842–1921) British land owner, photographer and anthropologist"]}, {"page": "Thomas George Bonney", "response": ["Bonney was born in Rugeley, Staffordshire, England, the eldest son of the Reverend Thomas Bonney, headmaster of Rugeley Grammar School. His uncle was the Australian explorer Charles Bonney, and one of his brothers, Frederic Bonney, is remembered for his photography and ethnology in Australia."]}, {"page": "Charles Bonney", "response": ["Bonney was the youngest son of the Rev. George Bonney, a fellow of Jesus College, Cambridge, and his wife Susanna, née Knight. He was born at Sandon, Staffordshire, England. After his father died in 1826 his brother Thomas, headmaster of Rugeley Grammar School, gave him an education and a home for seven years. (Two of Thomas's sons, Edward and Frederic Bonney, later went to Australia.)"]}, {"page": "Bonney (surname)", "response": ["* Frederic Bonney, English anthropologist and photographer in Australia"]}, {"page": "List of Old Marlburians", "response": ["* Frederic Bonney, anthropologist and photographer"]}, {"page": "Pantyikali dialect", "response": ["The Pantyikali people of the Paakantyi were extensively studied and photographed in the 19th century by Frederic Bonney, the owner of Momba Station."]}, {"page": "Paakantyi", "response": ["Frederic Bonney was one of the earliest settlers in their area, and ran stock there for 15 years."]}, {"page": "Momba Station", "response": ["Momba Station on the Paroo River and the Darling River was established by the brothers Edward and Frederic Bonney. Frederic arrived in 1865 to join his brother after both of them had been attracted to the country by their uncle, Charles Bonney. Frederic Bonney sold the station and went back to the United Kingdom in 1881 due to his brother's poor health. Bonney however recorded some important anthropology through his writing and his enthusiasm for photography. Some of his original images were lost, but his work has been published in two books and they include photographs of the Paakantyi. These were the Aboriginal people who lived near the Paroo river who became labourers on the station.The People of the Paroo River: Frederick Bonney's Photographs by Jeanette Hope and Robert Lindsay, anu.edu.au, retrieved 19 June 2014"]}, {"page": "Nhaawuparlku", "response": ["It has been suggested that the Naualko might be classified as a northern branch of the Paakantyi. Norman Tindale, taking into consideration the distinctive word for 'yes' in their ethnonym, argues that the probabilities lie with their being an independent tribe. In addition, early settlers like Frederic Bonney, familiar with the area's tribes, treated them as a discrete group."]}]}}