{"wiki_id": "http://www.wikidata.org/entity/Q17385577", "itemLabel": "Ann Phoenix", "itemDescription": "British educationist", "wikipedia_url": "https://en.wikipedia.org/wiki/Ann_Phoenix", "wikipedia_page": {"main": "Ann Phoenix,  (born 27 March 1955) is a British psychologist and academic, whose research focuses on psychosocial issues related to identity. She is Professor of Psychosocial Studies at the Institute of Education, University College London. She was previously ESRC Professorial Fellow for the Transforming Experiences research programme. She was previously Co-Director of the Thomas Coram Research Unit, and Reader in Psychology at the Open University.", "link_mentions": [{"page": "Paul Gilroy", "response": ["Gilroy is a scholar of cultural studies and black Atlantic diasporic culture with interests in the \"myriad manifestations of black British culture\". He is the author of There Ain't No Black in the Union Jack (1987), Small Acts (1993), The Black Atlantic (1993), Between Camps (2000; also published as Against Race in the United States), and After Empire (2004; published as Postcolonial Melancholia in the United States), among other works. Gilroy was also co-author of The Empire Strikes Back: Race and Racism in 1970s Britain (1982), a path-breaking, collectively produced volume published under the imprint of the Centre for Contemporary Cultural Studies at Birmingham University, where he was a doctoral student working with the Jamaican intellectual Stuart Hall. Other members of the group include Valerie Amos, Hazel Carby and Pratibha Parmar.\"Meeting Stuart Hall\": Reflections on cultural theorist Stuart Hall. By Sara Ahmed, Gargi Bhattacharyya, Yasmin Gunaratnam, Vera Jocelyn, Patricia Noxolo, Pratibha Parmar, Ann Phoenix, Nirmal Puwar, Suzanne Scafe. Curated by Yasmin Gunaratnam for Media Diversified. OpenDemocracy, 20 February 2014."]}, {"page": "Hawke Government", "response": ["The Hawke Government carried out a series of other measures during its time in office. Upon taking office in 1983, a Community Employment Program was set up, providing a large number of work experience opportunities in the public and non-profit sectors. Together with smaller programs such as the Community Youth Support scheme (CYSS), this played a major role in both alleviating and reversing the effects of the 1982 economic recession. A Home and Community Care Program (HACC) was established to provide community-based services for frail aged people and people with disabilities,The Australian welfare state: key documents and themes by Jane Thomson and Anthony McMahon while to combat homelessness a Supported Accommodation Assistance program was introduced to assist those who are homeless, at risk of homelessness, or escaping domestic violence.Domestic Violence in Rural Australia by Sarah Wendt A bereavement payment equivalent to fourteen weeks pension for the surviving member of a pensioner couple was also introduced, together with an Asylum Seeker Assistance scheme to provide help to applicants for refugee status in need. A wide range of measures were introduced to protect the environment., such a Landcare program, which was established to promote environmental conservation.Ecotourism: a practical guide for rural communities by Sue Beeton In addition, spending on housing, education, and health was increased, while an anti-poverty trap package was introduced in the 1985 budget. That same year, rent assistance was extended to include unemployed and low-income working families.Welfare reform in rural places: comparative perspectives by Paul Milbourne The 1985 Tax Summit led to a reduction of loopholes and distortions in the tax system, while the Family Assistance Package (introduced in 1987) significantly strengthened the amount of income support for hundreds of thousands of low-income families. Some sole parents and unemployed persons benefited from other measures designed to reduce barriers to workforce participation, deal with their housing costs, and increase their incomes. In addition, a new Child Support Agency was established, designed to provide a more efficient system of maintenance and tackle child poverty. Funding for public housing and disadvantaged students was also considerably increased. Various measures were also introduced which enhanced the rights of women in the workplace. The Sex Discrimination Act of 1984 prohibited sex discrimination in employmentWork, family and the law by Jill Murray while the Affirmative Action (Equal Employment Opportunity for Women) Act of 1986 required all higher education institutions and all private companies with more than 100 employees to introduce affirmative action programmes on behalf of women.Working out: new directions for women's studies by Hilary Hinds, Ann Phoenix, and Jackie Stacey A year later, equal opportunity legislation for the Commonwealth Public Service was introduced. In 1986, a Disability Services Act was passed to expand opportunities for the participation of disabled persons in local communities.2000 Year Book Australia No. 82 by the Australian Bureau of Statistics"]}, {"page": "List of fellows of the British Academy elected in the 2010s", "response": ["* Ann Phoenix, Professor of Education, Institute of Education, University of London"]}, {"page": "Jackie Stacey", "response": ["In 1992, along with Hilary Hinds and Ann Phoenix, Jackie Stacey co-edited Working Out: New Directions for Women's Studies, an anthology that attempted to answer the question of where women's studies belonged. Stacey and her co-editors were especially interested in addressing the ambiguities and uncertainties that exist in the field. The title reflects their claim that women's studies is still \"working out\" how to respond negotiate its marginal standing inside mainstream academia.", "Working Out: New Directions for Women's Studies (1992) edited by Hilary Hinds, Ann Phoenix, and Jackie Stacey"]}]}}