{"wiki_id": "http://www.wikidata.org/entity/Q17355676", "itemLabel": "Theodosia Trollope", "itemDescription": "English poet, translator and writer (1816–1865)", "wikipedia_url": "https://en.wikipedia.org/wiki/Theodosia_Trollope", "wikipedia_page": {"main": "Theodosia Trollope (née Garrow; 1816–1865) was an English poet, translator, and writer known also for her marriage into the Trollope family. She married and bought a villa in Florence, Italy with her husband, Thomas Adolphus Trollope. Her hospitality made her home the centre of British society in the city. Her writings in support of the Italian nationalists are credited with changing public opinions.", "link_mentions": [{"page": "1865 in literature", "response": ["*April 13 – Theodosia Trollope, English-born writer (born 1816)"]}, {"page": "1816 in literature", "response": ["*November 28 – Theodosia Trollope (Theodosia Garrow), English poet and translator (died 1865)"]}, {"page": "Giuseppe Giusti", "response": ["A selection of Giuseppe Giusti's poetic works were translated by William Dean Howells in Modern Italian Poets (1887).Modern Italian Poets; Essays and Versions, by William Dean Howells Other parts were translated by Theodosia Trollope."]}, {"page": "English Cemetery, Florence", "response": ["Many famous people are buried in the graveyard: Elizabeth Barrett Browning (in a tomb designed by Frederic, Lord Leighton), Walter Savage Landor, Arthur Hugh Clough, Francesca Trollope, Fanny Trollope and her daughter-in-law Theodosia Trollope and three other family members, Isa Blagden, Thomas Southwood Smith, Hiram Powers, Joel Tanner Hart, Theodore Parker, Mary Farhill, Fanny, the wife of William Holman Hunt in a tomb he himself sculpted, Mary, the daughter of John Roddam Spencer Stanhope in a tomb he himself sculpted, Sir david Dumbreck, Doctor Bartolomeo Odicini, Louise, sister to Henry Adams, whose dying he describes in his 'Chaos' chapter in The Education of Henry Adams, two children of the Greek painter George Mignaty, whom Robert had paint Casa Guidi as it was when Elizabeth Barrett Browning died there; Nadezhda De Santis, a black Nubian slave brought to Florence at fourteen from Jean-François Champollion's 1827 expedition to Egypt and Nubia, while the French Royalist exile Félicie de Fauveau sculpted two tombs here."]}, {"page": "Charles Stuart-Wortley, 1st Baron Stuart of Wortley", "response": ["Lord Stuart of Wortley married Beatrice, daughter of Thomas and Theodosia Trollopethepeerage.com Charles Beilby Stuart-Wortley, 1st and last Baron Stuart of Wortley, retrieved 21 September 2014 (and niece of the author Anthony Trollope), in 1880. Beatrice died in July 1881 and Stuart married as his second wife Alice Sophia Caroline Millais (1862–1936), daughter of the artist John Everett Millais. Known to her family as Carrie, she and her husband shared an interest in music, playing the Grieg and Schumann concertos on two grand pianos at their home. Among her friends were the art critic Claude Phillips, the arts patron Frank Schuster, Lady Charles Beresford and the composer Edward Elgar to whom she was known as Alice and 'Windflower'."]}, {"page": "Francesco Dall'Ongaro", "response": ["His patriotic poems, Stornelli, composed in early life, had a great popular success; and he produced a number of plays, notably Fornaretto, Bianca Cappello, Fasma and Il Tesoro. Some opf his work was translated into English by Theodosia Trollope. His collected Fantasie drammatiche e liriche were published in his lifetime. In 1863 Francesco Dall'Ongaro presented his Italian drama, The Resurrection of Prince Marko."]}, {"page": "Casa Guidi", "response": ["The Browning household was a centre of British society in Florence although it was said that Theodosia Trollope's house was more care free. There was no animosity however and the Trollope's daughter played with the Browning's son Robert, known as Pen. After Pen's death in 1912 the apartment was bought by several Browning enthusiasts. By that time, Casa Guidi was in poor shape, and the apartment retained hardly any furniture or paintings. The Browning Society in New York restored it, before giving it to Eton College which undertook further work so that the building could be used as a study centre. Today, it is part of The Eton College Collections, but is administered by the Landmark Trust, who also look after the apartment above the one where John Keats died in Rome. When not being used by Eton boys, the property is available for holiday lets booked through the Landmark Trust.The Landmark Trust – Holiday at Casa Guidi"]}, {"page": "List of squares in Florence", "response": ["* Piazza dell'Indipendenza: It is a wide square located near piazza della Stazione and San Lorenzo market, with palaces typically bourgeois where lived Guido Nobili and Theodosia Trollope, Thomas Trollope and Fanny Trollope."]}, {"page": "Frances Eleanor Trollope", "response": ["Her younger sister Ellen Ternan became the mistress of Charles Dickens and because of his intercession she was recommended as a prospective governess to the child of his widowed friend Thomas Trollope, following the death of his wife Theodosia Trollope. Ternan soon married Tom Trollope despite an age difference of 25 years. The marriage took place within five months of her becoming a governess in Florence. She became his second wife.Claire Tomalin,The Invisible Woman, p.6 She also became the sister-in-law of Anthony Trollope and daughter-in-law of Frances Milton Trollope, whose biography Frances Trollope: Her Life and Literary Work from George III to Victoria she authored."]}, {"page": "Theodosia Gallow", "response": ["#REDIRECT Theodosia Trollope"]}, {"page": "Giovanni Battista Niccolini", "response": ["In 1846 his play, Arnold of Brescia: A Tragedy. was translated by the English immigrant Theodosia Trollope into English and published. This work was also taken up by Robert Browning. The work evoked the patriotism of those seeking to free Italy from the control of foreign and papal forces."]}, {"page": "Theodosia Abrams Fisher", "response": ["Theodosia Garrow died on 4 November 1849 in Torquay. Joseph Garrow went back to live in Florence with his daughter Theodosia Trollope, and is buried there with his daughter and stepdaughter."]}]}}