{"wiki_id": "http://www.wikidata.org/entity/Q17305951", "itemLabel": "Geoffrey Wainwright", "itemDescription": "British archaeologist (1937-2017)", "wikipedia_url": "https://en.wikipedia.org/wiki/Geoffrey_Wainwright_(archaeologist)", "wikipedia_page": {"main": "Geoffrey John Wainwright,  (19 September 1937 – 6 March 2017) was a British archaeologist specialising in prehistory. He was the Chief Archaeologist of English Heritage from 1989 to 1999, and visiting professor to a number of universities. He served as President of the Prehistoric Society from 1981 to 1985 and the Society of Antiquaries of London from 2007 to 2010.\n\n", "link_mentions": [{"page": "Stonehenge", "response": ["Proposed functions for the site include usage as an astronomical observatory or as a religious site.  More recently two major new theories have been proposed. Geoffrey Wainwright, president of the Society of Antiquaries of London, and Timothy Darvill, of Bournemouth University, have suggested that Stonehenge was a place of healing—the primeval equivalent of Lourdes. They argue that this accounts for the high number of burials in the area and for the evidence of trauma deformity in some of the graves. However, they do concede that the site was probably multifunctional and used for ancestor worship as well. Isotope analysis indicates that some of the buried individuals were from other regions. A teenage boy buried approximately 1550 BC was raised near the Mediterranean Sea; a metal worker from 2300 BC dubbed the \"Amesbury Archer\" grew up near the Alpine foothills of Germany; and the \"Boscombe Bowmen\" probably arrived from Wales or Brittany, France."]}, {"page": "Archaeological excavation", "response": ["This describes the use in excavations of various types and sizes of machines from small backhoes to heavy duty earth-moving machinery. Machines are often used in what is called salvage or rescue archaeology in developer-led excavation when there are financial or time pressures. Using a mechanical excavator is the quickest method to remove soil and debris and to prepare the surface for excavation by hand, taking care to avoid damaging archaeological deposits by accident or to make it difficult to identify later precisely where finds were located. The use of such machinery is often routine (as it is for instance with the British archaeological television series Time Team) but can also be controversial as it can result in less discrimination in how the archaeological sequence on a site is recorded. One of the earliest uses of earth-moving machinery was at Durrington Walls in 1967. An old road through the henge was to be straightened and improved and was going to cause considerable damage to the archaeology. Rosemary Hill describes how Geoffrey Wainwright \"oversaw large, high-speed excavations, taking bulldozers to the site in a manner that shocked some of his colleagues but yielded valuable if tantalising information about what Durrington had looked like and how it might have been used.\" Machines are used primarily to remove modern overburden and for the control of spoil. In British archaeology mechanical diggers are sometimes nicknamed \"big yellow trowels\"."]}, {"page": "Durrington Walls", "response": ["Richard Colt Hoare noted Durrington Walls in 1810, and observed that centuries of agriculture had left \"its form much mutilated\".Stonehenge and Avebury: The World Heritage Site. Rodney Legg. 2004. Geoffrey Wainwright excavated the route of the new A345 in 1966. He discovered the southern timber circle of Durrington Walls, as well as a smaller one slightly north of it."]}, {"page": "Mount Pleasant henge", "response": ["A narrow, 2 m deep palisade trench was also found running around the inside of the larger henge. Consisting of large oak timbers placed at 50 cm intervals it would have served as a huge barrier to the middle of the site. Evidence that the timber posts that had stood in the trench were burnt was also seen. The excavator, Geoffrey Wainwright, estimated that 1600 timbers had stood in the trench, enclosing an area of 45,000 m². Two entrances were found in the palisade, each only 1m wide. The timber enclosure was built around 500 years after the outer henge enclosure and caused the builders to remodel the enclosure earthworks."]}, {"page": "Geoffrey Wainwright", "response": ["Geoffrey Wainwright (1939 – 17 March 2020) was an English theologian. He spent much of his career in the United States and taught at Duke Divinity School. Wainwright made major contributions to modern Methodist theology and Christian liturgy, and played a significant role on producing the text Baptism, Eucharist and Ministry, as a member of the Faith and Order Commission of the World Council of Churches (WCC).", "Born in Monk Bretton, Barnsley, Yorkshire, England, in 1939, Geoffrey Wainwright was an ordained minister of the Methodist Church of Great Britain.  He received his university education in Cambridge, Geneva, and Rome.  He held the Dr. Théol. degree from Geneva and the Doctor of Divinity degree from Cambridge. He served as a circuit minister in Liverpool (1964–1966) and then as a missionary teacher and pastor in Cameroon, West Africa (1967–1973).  Returning to England, he taught scripture and theology at the Queen's College, Birmingham (1973–1979).  In 1979 he moved to Union Theological Seminary, New York, where he became the Roosevelt Professor of Systematic Theology.  He taught at Duke Divinity School from 1983 to his retirement in 2012, a part of Duke University in North Carolina, where he occupied the Robert Earl Cushman chair of Christian Theology.  Wainwright held visiting professorships at the University of Notre Dame, the Gregorian and Angelicum universities in Rome and the United Faculty of Theology in Melbourne, Australia.", "Wainwright served as president of the international Societas Liturgica (1983–1985) as well as of the American Theological Society (1996–1997). He was honoured by the publication of Ecumenical Theology in Worship, Doctrine, and Life: Essays Presented to Geoffrey Wainwright on his Sixtieth Birthday (1999). He was awarded the 2005 Johannes Quasten Medal by the Catholic University of America for \"excellence in theological scholarship\".  ", "He retired from Duke in 2012 and continued to make scholarly contributions in his retirement. He delivered a paper on \"The Second Vatican Council: The Legacy from a Methodist Perspective\" at the annual conference of the North American Academy of Ecumenists in Halifax in September 2012.Duke Divinity School, \" 'Divine Disproportion & Poetic Paradoxes: Charles Wesley at Chalcedon,' the Retirement Lecture of Professor Geoffrey Wainwright\" , March 22, 2012North American Academy of Ecumenists, \"2012 Annual Conference Schedule\" , "]}, {"page": "Excavations at Stonehenge", "response": ["Britain's Bournemouth University archaeologists, led by Geoffrey Wainwright, president of the London Society of Antiquaries, and Timothy Darvill, on September 22, 2008, found it may have been an ancient healing and pilgrimage site, since burials around Stonehenge showed trauma and deformity evidence: \"It was the magical qualities of these stones which ... transformed the monument and made it a place of pilgrimage for the sick and injured of the Neolithic world.\" Radio-carbon dating places the construction of the circle of bluestones at between 2,400 B.C. and 2,200 B.C., but they discovered charcoals dating 7,000 B.C., showing human activity in the site.uk.reuters.com, Stonehenge may have been pilgrimage site for sick It could be a primeval equivalent of Lourdes, since the area was already visited 4,000 years before the oldest stone circle, and attracted visitors for centuries after its abandonment.news.yahoo.com, UK experts say Stonehenge was place of healing guardian.co.uk, The magic of Stonehenge: new dig finds clues to power of bluestones"]}, {"page": "Cambrian Archaeological Association", "response": ["* 2002 Caernarfon and Lleyn: Dr Geoffrey Wainwright"]}, {"page": "2017 in the United Kingdom", "response": ["*6 March – Geoffrey Wainwright, 79, archaeologist."]}, {"page": "Deaths in March 2017", "response": ["*Geoffrey Wainwright, 79, British archaeologist.Geoff Wainwright obituary"]}, {"page": "Geoffrey J. Wainwright", "response": ["#REDIRECT Geoffrey Wainwright (archaeologist)"]}, {"page": "List of Maharaja Sayajirao University of Baroda people", "response": ["|Geoffrey Wainwright"]}, {"page": "Ian Stead", "response": ["Stead was an Inspector of Ancient Monuments for the UK Government. Along with Geoffrey Wainwright and Brian Davison, Stead was part of the 'Government digging team' working under the Chief Inspector of Ancient Monuments. With the Inspectorate he undertook excavations at Winterton Roman villa, Baldock, and Verulamium amongst many others. He subsequently worked as the deputy keeper of the Department of Prehistoric and Romano-British Antiquities of the British Museum. "]}]}}