{"wiki_id": "http://www.wikidata.org/entity/Q17379325", "itemLabel": "Peter Thorne", "itemDescription": "RAF officer", "wikipedia_url": "https://en.wikipedia.org/wiki/Peter_Thorne_(RAF_officer)", "wikipedia_page": {"main": "Air Commodore Peter Donald Thorne,  (3 June 1923 – 5 April 2014) was a fighter pilot and test pilot in the Royal Air Force (RAF), who held diplomatic posts in Tehran and Moscow during the 1970s.", "link_mentions": [{"page": "1923", "response": ["* June 3 – Peter Thorne, British Royal Air Force pilot (d. 2014)"]}, {"page": "Supermarine Swift", "response": ["The first production variant was a fighter designated the Swift F Mk 1, of which 18 were eventually built. It was powered by a single 7,500 lbf (33.4 kN)-thrust Avon 109 engine and carried an armament of two 30 mm ADEN cannons. On 25 August 1952, the first flight of a production standard Swift F 1 took place. Peter Thorne, who had been appointed as the senior RAF test pilot for the incoming Swift in 1954, came to doubt the aircraft's suitability; observations by Thorne and several other pilots noted the Swift to possess unusual handling qualities alongside a troublesome engine.\"Obituary: Air Commodore Peter Thorne.\" The Telegraph, 18 July 2014."]}, {"page": "Air Force Cross (United Kingdom)", "response": ["* Peter Thorne (1923–2014); awarded the AFC three times (1947, 1951, and 1956)."]}, {"page": "Peter Thorne", "response": ["Peter Thorne may refer to:", "*Peter Thorne (Australian footballer) (born 1960), Australian rules footballer and coach", "*Peter Thorne (climatologist), climatologist and professor of physical geography", "*Peter Thorne (English footballer) (born 1973), English football player", "*Peter Thorne (reporter), reporter and anchorman for WPIX-TV", "*Peter Thorne (RAF officer) (1923–2014), fighter pilot and test pilot"]}, {"page": "Thorne (surname)", "response": ["* Peter Thorne (disambiguation)", ":*Peter Thorne (Australian footballer) (born 1960), Australian rules footballer and coach", ":*Peter Thorne (climatologist), climatologist and professor of physical geography", ":*Peter Thorne (English footballer) (born 1973), English football player", ":*Peter Thorne (reporter), reporter and anchorman for WPIX-TV", ":*Peter Thorne (RAF officer) (1923–2014), fighter pilot and test pilot"]}, {"page": "Ronald Wingate", "response": ["From India he flew into Cairo Rear HQ with Peter Thorne to arrange the last operation of the Middle eastern campaign.  He had arrived on 24 October with orders from Mountbatten (SACSEA) and Fleming.  As if to continue a deception, he had visited the theatre in New Delhi on 20 December, and JSC on 29th.  Wingate radically reformed the 'mutual admiration society' in a restructuring of D Division.  To find out what notional information could be passed onto the Japanese by Peter Fleming in India about German intelligence to assist A Force and SEAC operations.  Wingate departed Cairo for the last time on 23 April 1945.  At the end of the war he teamed up with Jonny Bevan in the Far East, where he was warmly welcomed when he arrived at Manila to work with Goldbranson, the American agent.  The Americans were eager to hasten the end of the war, but Wingate steadied the ship, when the extent of US spycraft was an appearance by Douglas Fairbanks jr.Holt, pp.553, 640, 647. ."]}, {"page": "2014 in the United Kingdom", "response": ["**Peter Thorne, 90, fighter pilot and diplomat."]}, {"page": "Deaths in April 2014", "response": ["*Peter Thorne, 90, English fighter pilot and diplomat.Air Commodore Peter Thorne - obituary"]}, {"page": "Peter Thorne (raf officer)", "response": ["#REDIRECT Peter Thorne (RAF officer)"]}, {"page": "Jack Livesey (impostor)", "response": ["In 2004 Jack Livesey was convicted of benefit fraud for receiving nearly £30,000 in incapacity benefit while he was employed at the Imperial War Museum. He was sentenced to a suspended twelve-month jail term due to his supposed military service, and character references submitted by veterans including Air Commodore Peter Thorne and Major Gordon Corrigan, who knew Livesey and believed him to be a war hero."]}]}}