{"wiki_id": "http://www.wikidata.org/entity/Q173244", "itemLabel": "Vic Elford", "itemDescription": "British racecar driver", "wikipedia_url": "https://en.wikipedia.org/wiki/Vic_Elford", "wikipedia_page": {"main": "Victor Henry Elford (born 10 June 1935, in London) is a former sports car racing, rallying and Formula One driver from England. He participated in 13 World Championship F1 Grands Prix, debuting on 7 July 1968. He scored a total of 8 championship points.\nNicknamed \"Quick Vic\" by his peers Elford was mainly a famous sports car competitor as well as a successful rally driver, associated often with Porsche.", "link_mentions": [{"page": "June 10", "response": ["*1935 – Vic Elford, English racing driver"]}, {"page": "Sports car racing", "response": ["* Vic Elford, \"Reflections on a Golden Era of Motorsport\" – covers Vic's rallying, single seater and mostly sports car career in depth."]}, {"page": "Monte Carlo Rally", "response": ["| Vic Elford (GB) / David Stone (GB)", "| Vic Elford (GB)/ David Stone (GB)"]}, {"page": "Fuji Speedway", "response": ["Converted to a road course, the circuit opened in December 1965 and proved to be somewhat dangerous, with the wide banked turn (named \"Daiichi\") regularly resulting in major accidents. Vic Elford said:"]}, {"page": "AMC Javelin", "response": ["One Javelin race car had the distinction of having different sponsors and being piloted by Mark Donohue, Vic Elford, George Follmer, Peter Revson, and Roy Woods. This Javelin actually began life as a 1970 model, but was updated to 1971 sheet metal. The race car is now restored to its 1972 livery and is driven at Vintage Trans-Am events."]}, {"page": "24 Hours of Daytona", "response": ["Porsche repeated this show in their 1–2–3 win in the 1968 24 Hours. After the car of Gerhard Mitter had a big crash caused by tire failure in the banking, his teammate Rolf Stommelen supported the car of Vic Elford and Jochen Neerpasch. When the car of the longtime leaders Jo Siffert and Hans Herrmann dropped to second due to a technical problem, these two also joined the new leaders while continuing with their car. So Porsche managed to put 5 of 8 drivers on the center of the podium, plus Jo Schlesser and Joe Buzzetta finishing in third place, with only Mitter being left out.Motor Sport, March 1968, Pages 171–172. See also cover photograph and center spread.", "|  Vic Elford Jochen Neerpasch Rolf Stommelen Jo Siffert Hans Herrmann"]}, {"page": "12 Hours of Sebring", "response": ["|  Vic Elford Gérard Larrousse"]}, {"page": "Targa Florio", "response": ["|1968|| Vic Elford Umberto Maglioli||Porsche 907||6:28:47.9||720||111.112||10"]}, {"page": "Renault Alliance", "response": ["The Alliance provided many donor parts (engine and suspension) for the Sports Renault race car, a single make series created by the Sports Car Club of America (SCCA) in 1984. Designed by Roy Lunn, it was a low-cost purpose-built racer. The car was developed and manufactured by Renault/Jeep Sport USA in Livonia, Michigan, under direction of Vic Elford; with more than five hundred were built. Most cars still exist, although the majority have been converted to use a Ford engine (thus now known as Spec Racer Fords), and run in the SCCA club-racing program."]}, {"page": "Lotus Cortina", "response": ["Whilst the Cortina Lotus is somewhat overshadowed by the success of the Ford Escort in rallying, it performed admirably in the mid-1960s, which might be surprising, given its reputation for unreliability. The first Cortina Lotus to be rallied was a Cortina GT with the Lotus engine, in the 1963 Spa-Sofia-Liege rally in September, just to try out the engine, and driven by Henry Taylor to 4th place. The first outing in a rally by a Cortina Lotus proper was in the 1963 RAC Rally, campaigned again by Taylor, with co-driver Brian Melia. It finished 6th somehow, in spite of its A-bracket rear end needing constant attention. The A-bracket was persevered with by Vic Elford and David Seigle-Morris for the 1964 Tour de France Automobile, a 10-day,  event, as it was run completely on sealed roads, unlike the rough RAC Rally. Their car came 4th outright in the Touring Car category, and first in the Handicap category, in a mix of one-hour sprints, hillclimbs, and mountain road rallying.", "Still, the general dodginess of the A-bracket suspension meant that Ford decided to replace it with the more conventional GT rear suspension. This became available in June 1965, and while the car still seemed to be afflicted with bad luck, a few victories were racked up. Four of the newly updated cars competed in the Alpine rally of July 1965, and Vic Elford's car led outright, all the way. Well, until less than an hour from finishing, when a piece of the distributor fell out and delayed the car 26 minutes. All four cars retired from that year's RAC rally, which was severely snow-affected. The first works victory came in December 1965, when Roger Clark and Graham Robson won the Welsh International."]}, {"page": "Cosworth DFV", "response": ["|align=\"left\"|  Vic Elford"]}, {"page": "Kurt Ahrens Jr.", "response": ["In 1968, Ahrens Jr. joined the Porsche factory sports car team and shared victory with Jo Siffert in the 1969 Austrian 1000 km event. He co-drove the pole-setting Porsche 917 \"long tail\" at the 1969 24 Hours of Le Mans and the 1970 24 Hours of Le Mans, but neither car finished. In 1970, he partnered with Vic Elford to win the 1000km Nürburgring in a Porsche 908.", "|align=\"left\"|  Vic Elford"]}, {"page": "Rallycross", "response": ["The sport started as a TV show (with especially invited rally drivers), produced by Robert Reed of ABC television for ITVs World of Sport programme, at Lydden Circuit (between Dover and Canterbury) in Great Britain on Saturday, 4 February 1967. The first true rallycross was organised by Bud Smith († 1994) and the Tunbridge Wells Centre of the 750 MC, with the aid of Lydden Circuit owner Bill Chesson († 1999), and was won by later Formula One driver as well as 1968 Rally Monte Carlo winner Vic Elford in a showroom Porsche 911 of the British importer AFN, ahead of Brian Melia in his Ford Lotus Cortina and Tony Fall in a BMC Mini Cooper S."]}, {"page": "Brands Hatch", "response": ["The Manufacturers' World Championship came to Brands in early 1968, followed by the BOAC 500 on 7 April. The winner was the Ford GT40 Mk.1 of Jacky Ickx and Brian Redman from the Porsche 908 of Gerhard Mitter and Ludovico Scarfiotti, these two being the only cars to complete the full race distance of 218-laps. Two laps further down in third was another 907 driven by Vic Elford and Jochen Neerpasch and fourth place went to another GT40, driven by Paul Hawkins and David Hobbs.", "The BOAC 500 was once again the British round of the Manufacturers' World Championship and was a Porsche benefit, 908s taking the first three places, the winners being Jo Siffert and Brian Redman; the second place car of Vic Elford and Richard Attwood was two laps behind, with Gerhard Mitter and Udo Schütz third.", "Although the World Championship sports race was now BOAC 1000, but measured in kilometres, not miles, it was another Porsche benefit, the fearsome 917s taking the first three places from a 908; the first car home was the Pedro Rodríguez/Leo Kinnunen car from Vic Elford/Denny Hulme and Richard Attwood/Hans Herrmann. The 908 was driven by Gijs van Lennep and Hans Laine. The race was run over 235 laps at a speed of ."]}]}}