{"wiki_id": "http://www.wikidata.org/entity/Q17319052", "itemLabel": "Samuel Walker", "itemDescription": "English ironmaster", "wikipedia_url": "https://en.wikipedia.org/wiki/Samuel_Walker_(1779%E2%80%931851)", "wikipedia_page": {"main": "Samuel Walker (4 September 1779 – 30 January 1851) was an English ironmaster from Yorkshire.\nHe was the oldest son of Samuel Walker, an ironmaster in Masbrough.He was MP for Aldeburgh from 1818 to 1820.", "link_mentions": [{"page": "Samuel Walker", "response": ["Samuel Walker may refer to:", "*Samuel Walker (gymnast) (1883–1960), British gymnast and Olympic medalist", "*Samuel Walker (volleyball) (born 1995), Australian volleyball player", "*Samuel Walker (Massachusetts politician) (1793–1860), mayor of Roxbury, Massachusetts, 1851–1853", "*Samuel Walker (1779–1851), English ironmaster, MP for Aldeburgh 1818–20", "*Samuel Walker (soldier) (1822–1893), American politician, and soldier", "*Samuel Walker (Florida politician) (1825–1881), member of the Florida Legislature and mayor of Tallahassee", "*Sir Samuel Walker, 1st Baronet (1832–1911), Irish politician and lawyer", "*Samuel Walker of Truro (1714–1761), English evangelical clergyman", "*J. Samuel Walker, American historian and author", "*Samuel Walker (born 1942), American police accountability expert"]}, {"page": "Dalry, Edinburgh", "response": ["Lewis Terrace, Walker Terrace, Douglas Terrace, Cobden Terrace, Argyll Terrace, Bright Terrace, Atholl Terrace and McLaren Terrace and Breadalbane Terrace. Four of the streets are named after politicians, prominent in the Anti-Corn Law League; Richard Cobden, Duncan McLaren, John Bright and Samuel Walker. Another was named for Bailie David Lewis (editor of the Edinburgh-based weekly Reformer publication). and the other three names are places in Scotland. The colonies in Dalry were built between 1868 and 1870 by the Edinburgh Cooperative Building Company Limited, primarily to house Caledonian Railway workers. The Dalry Colonies are Category B Listed buildings."]}, {"page": "Aldeburgh (UK Parliament constituency)", "response": ["| Samuel Walker"]}, {"page": "Masbrough", "response": ["A large memorial to a celebrated iron magnate, Samuel Walker, stands behind the site once occupied by the 1760 Independent chapel (with a date stone of 1777), the Walker Mausoleum. After being closed as a place of worship, the chapel became a carpet showroom Allens of Rotherham, but was destroyed by fire in 2012. It is connected by a short foot subway and Chapel Walk to all the historic buildings in central Rotherham. There were further memorials and statues within the chapel building.Former Independent Chapel (1760)  The chapel's statue to Jonathan Walker (died 1807), who was at the heart of the iron industry that led to the local area's development, depicts the man leaning on a truncated column \"with head in hand\".Masbro' Independent Chapel, Bicentenary 1760–1960, Charles Chislett (ed), Sheffield ", "*Samuel Walker (1779–1851), ironmaster, lived at Masbrough Hall and owned an ironworks that flourished until the end of the Napoleonic Wars. He was MP for Aldeburgh from 1818 to 1820.History of Parliament Retrieved 1 December 2015"]}, {"page": "James Blair (MP)", "response": ["At the 1820 general election, Blair was returned for another rotten borough, this time Aldeburgh in Suffolk. It was owned by the Lancashire ironmaster Samuel Walker, who had bought it in 1818 for £39,000 (equivalent to £ in )."]}, {"page": "Samuel Walker (1779-1851)", "response": ["#REDIRECT Samuel Walker (1779–1851)"]}, {"page": "List of MPs elected in the 1818 United Kingdom general election", "response": ["|   Samuel Walker"]}, {"page": "Joshua Walker (MP)", "response": ["Joshua Walker (1786-1862) of Portland Place and Hendon Place, Middlesex, was a Member of Parliament for Aldeburgh in Suffolk, a pocket borough owned by his cousin Samuel Walker (1779–1851), MP,Taylor a notable ironmaster from Yorkshire."]}, {"page": "Rotherham Town Hall", "response": ["Following a protracted procurement process, the magistrates' new facilities at the Statutes, off Main Street, eventually became available and they were able to vacate the building in May 1994. A cannon, manufactured by Samuel Walker & Company in Masbrough and recovered from use on a naval vessel, was installed outside the building in 1995."]}]}}