{"wiki_id": "http://www.wikidata.org/entity/Q17385682", "itemLabel": "Brian Kennedy", "itemDescription": "British businessman", "wikipedia_url": "https://en.wikipedia.org/wiki/Brian_Kennedy_(businessman)", "wikipedia_page": {"main": "Brian Kennedy is a British businessman that has founded and sold several companies in the home improvement and energy sectors, in both the US and UK. He was also previously the majority owner of the Sale Sharks Rugby Union Club.According to The Sunday Times Rich List in 2019, Kennedy is worth £275 million.\n\n", "link_mentions": [{"page": "Clitheroe", "response": ["ICI founded a chemical plant in 1941, which was sold for a reported £260 million in September 2002, to Johnson Matthey. Conservatory manufacturer Ultraframe was started in Clitheroe, by John Lancaster in 1983. In March 1997, it floated on the stock exchange, being valued at £345 million in 2003. In June 2006, however, a downturn led to a takeover by Brian Kennedy's Latium Holdings."]}, {"page": "Stockport County F.C.", "response": ["With Stockport bottom of the First Division in October 2001, a home defeat against Millwall saw manager Andy Kilner sacked. Former England international Carlton Palmer was appointed in November 2001, but he failed to save the club from relegation to the third tier that season. Palmer was unable to build a team capable of returning to the First Division the next season. The summer of 2003 saw an ownership change. Elwood sold the club to Sale Sharks owner Brian Kennedy in a move that would see Sale play their home games at Edgeley Park. A new company, Cheshire Sport, was established, which combined ownership of Stockport County, Sale Sharks and the Edgeley Park stadium."]}, {"page": "Brian Kennedy", "response": ["Brian Kennedy may refer to:", "*Brian Kennedy (businessman), British businessman, majority owner of the Sale Sharks Rugby Union Club", "*Brian Kennedy (gallery director) (born 1961), art gallery director, director of the Peabody Essex Museum, Salem, Mass, USA", "*Brian Kennedy (journalist) (died 1991), journalist and activist who helped set up the London Lesbian and Gay Centre in 1985", "*Brian Kennedy (record producer) (born 1983), American songwriter, record producer, and musician", "*Brian Kennedy (singer) (born 1966), Irish singer-songwriter and author ", "*Brian Kennedy (hurler) (born 1992), Irish hurler", "*Brian Kennedy (basketball), American college basketball coach", "*Brian Kennedy (table tennis), English table tennis player"]}, {"page": "List of professional sports team owners", "response": ["* Brian Kennedy (?-present)"]}, {"page": "Disappearance of Madeleine McCann", "response": ["Hannah Marriott, \"Hanover calls time on McCanns\", PR Week, 21 November 2007; David Quainton, \"McCanns still fine-tuning PR\", PR Week, 19 September 2007.Giles Tremlett, \"With prejudice\", The Guardian, 17 September 2007. In September 2007 Brian Kennedy of Everest Windows stepped forward as a benefactor and offered to cover Clarence Mitchell's salary so that he could return. Mitchell resigned from his government position and started working for the McCanns full-time; he was later paid by Madeleine's Fund.\"Master of media circus for Madeleine McCann\", The Daily Telegraph, 24 April 2008..", "The McCanns set up Madeleine's Fund: Leaving No Stone Unturned Ltd on 15 May 2007, 12 days after the disappearance. Over 80 million people visited the fund's website in the three months after the disappearance. From September 2007, Brian Kennedy of Everest Windows supported the couple financially, and Kennedy's lawyer joined the fund's board of directors..  it had seven directors, including the McCanns.\"Officers\", Madeleine's Fund: Leaving No Stone Unturned Limited, Companies House, beta.companieshouse.gov.uk.", "Madeleine's Fund hired several firms of private investigators, causing friction with the Portuguese police. Shortly after the disappearance, an anonymous benefactor paid for the services of a British security company, Control Risks.; James Sturcke and agencies, \"McCanns still cling to hope, says spokesman\", The Guardian, 24 September 2007. There had reportedly been four independent sightings from North Africa; Brian Kennedy went to Morocco himself in September 2007 to look into one.Steven Swinford, John Follainin and Mohamed El Hamraoui, \"McCanns send sleuths to Morocco\", The Sunday Times, 30 September 2007. A Norwegian woman had reported seeing a girl matching Madeleine's description in a petrol station near Marrakesh, Morocco, on 9 May 2007; the child had reportedly asked the man she was with, in English, \"Can we see Mummy soon?\" When the witness returned home to Spain, she learned about the disappearance and telephoned the Spanish police. A month later, according to Kate McCann, the police had still not formally interviewed the woman, which led the McCanns to fear that leads were not being pursued. The McCanns themselves travelled to Morocco on 10 June 2007 to raise awareness. They spent the night at the British ambassador's residence and were briefed by consular staff and a Metropolitan police attaché.", "Brian Kennedy hired a Spanish agency, Método 3, for six months at £50,000 a month, which put 35 investigators on the case in Europe and Morocco. It seems the relationship came to an end in part because the head of the agency made several public statements that concerned the McCanns, including to CBS that \"We know the kidnapper. We know who he is and how he has done it.\" Another private investigator was David Edgar, a retired detective inspector hired in 2009 on the recommendation of the head of Manchester's Serious Crime Squad. Edgar released an e-fit in August that year of a woman said to have asked two British men in Barcelona, Spain, shortly after the disappearance, whether they were there to deliver her new daughter.\"Madeleine McCann investigators swamped with calls about new lead\", The Daily Telegraph, 7 August 2009; \"Madeleine McCann: E-fits of suspects\", The Daily Telegraph, 6 August 2009. Other private initiatives included a Portuguese lawyer financing the search of a reservoir near Praia da Luz in February 2008,Martina Smit, \"Divers search lake for Madeleine McCann\", The Daily Telegraph, 5 February 2008; \"'Underworld' tip leads to new Maddie hunt\", CNN, 12 March 2008; Howard Brereton, \"Spanish detective agency confirms bones found are not of missing Madeleine McCann\", Typically Spanish, 16 March 2008. and the use of ground radar by a South African property developer, Stephen Birch, who said in 2012 that scans showed there were bones beneath the driveway of a house in Praia da Luz.David Lohr, \"Madeleine McCann May Be Buried Under Driveway; Authorities Seem Unwilling To Investigate\", The Huffington Post, 20 September 2012.", "Netflix released an eight-part documentary series, The Disappearance of Madeleine McCann, on 15 March 2019. Interviewees included Jim Gamble, former head of the Child Exploitation and Online Protection Command; Alan Johnson, former British home secretary; Brian Kennedy, the British businessman who supported the McCanns financially; Justine McGuiness, the McCanns' former spokesperson; Gonçalo Amaral, former head of the PJ investigation; Robert Murat, the first arguido; Julian Peribañez, a former Método 3 private investigator; Sandra Felgueiras, a Portuguese journalist who covered the disappearance; and Anthony Summers and Robbyn Swan, authors of Looking for Madeleine (2014)."]}, {"page": "Reactions to the disappearance of Madeleine McCann", "response": ["The trustees of Madeleine's Fund announced in September that the fund would not be used to pay the McCanns' legal costs. Initially, the McCanns considered setting up a separate appeal fund for legal expenses. However, Richard Branson created a fund for the McCann's legal expenses, including those of their current advisor, Michael Caplan QC, a solicitor and partner in the London firm of Kingsley Napley. Stephen Winyard came out in December as having contributed £100,000 to the McCanns' defence fund, which paid for DNA tests carried out on the Renault Scénic hire car used by the McCanns. He also revealed Brian Kennedy as another donor."]}, {"page": "Sale Sharks", "response": ["Sale took 20,000 fans to Twickenham for the 1997 Pilkington Cup Final but Leicester won a mistake-ridden match 9–3. This interest quickly faded and the anticipated increased crowds never materialised and relegation from the Premier Division loomed until rugby union-playing local businessman Brian Kennedy came to the rescue late in the 1999–2000 season. Since then, the club has been on a sound financial footing."]}, {"page": "Ultraframe", "response": ["In July 2006 Ultraframe was acquired by Latium Plastic Holdings, including the Wendland Roofing system. Latium Enterprises (LE) is the hub based in Manchester, England and New York City, US. Latium owns a number of companies in the US and UK, all of which were either wholly or materially controlled by  Brian Kennedy  working with partner companies."]}, {"page": "History of Sale Sharks", "response": ["Sale took 20,000 fans to Twickenham for the 1997 Pilkington Cup Final but Leicester won a mistake-ridden match 9–3. This interest quickly faded and the anticipated increased crowds never materialised and relegation from the Premier Division loomed until rugby union-playing local businessman Brian Kennedy came to the rescue late in the 1999–2000 season. Since then, the club has been on a sound financial footing.", "In June 2016, Sale Sharks confirmed a takeover by an investment group, CorpAcq Ltd, led by Simon Orange. This ended Brian Kennedy's 16-year tenure in charge."]}]}}