{"wiki_id": "http://www.wikidata.org/entity/Q17305057", "itemLabel": "Chipzel", "itemDescription": "electronic musician from Northern Ireland", "wikipedia_url": "https://en.wikipedia.org/wiki/Chipzel", "wikipedia_page": {"main": "Niamh Houston (born 23 September 1991), better known by her stage name Chipzel, is a musician from Northern Ireland. She is best known for making chiptune music, particularly with a Game Boy. She is also a video game music composer, and is known for the soundtracks of games such as Super Hexagon, Interstellaria, and Dicey Dungeons. Her music is also featured in other games such as Just Shapes and Beats and Spectra.", "link_mentions": [{"page": "Chiptune", "response": ["Events take place all around the world that focus around the celebration and recognition of chiptune music. In the United States, during Super MAGFest—a yearly convention that hosts a variety of video game-related events—popular chiptune artists such as goto80 and Chipzel have previously performed on the Concert Hall mainstage. A chiptune-focused mainstage show (aptly named \"Chip Rave\") typically occurs on the third day of the convention within the concert hall and has featured countless prominent faces in the chiptune community."]}, {"page": "Strabane", "response": ["*Niamh Houston, better known as Chipzel, is a musician known for her 8-bit music"]}, {"page": "Fragment", "response": ["* Fragments, an EP by Chipzel"]}, {"page": "Disconnection", "response": ["* Disconnected, a 2010 album by Chipzel"]}, {"page": "Spectra", "response": ["* Spectra, a video game published by Mastertronic Group and scored by Chipzel"]}, {"page": "Blip Festival", "response": ["*Chipzel"]}, {"page": "Chime (video game)", "response": ["In July 2015, one of the developers of Chime, Ste Curran, launched a Kickstarter campaign for a sequel, titled Chime Sharp. The campaign was successfully funded on August 10, 2015, and an early access build of the game was released on Steam shortly after, featuring a song by Chipzel."]}, {"page": "Super Hexagon", "response": ["Super Hexagon is an independent twitch video game developed by Terry Cavanagh, with music composed by Chipzel. Originally released for iOS in September 2012, versions for Windows and macOS were released 3 months later, and Android, BlackBerry and Linux versions followed in early 2013.", "After Cavanagh used Chipzel's track \"Courtesy\" in the original Hexagon game, he again sought to use her music in the full game Super Hexagon. Chipzel happily obliged, and created a three-track chiptune soundtrack that was subsequently released as Super Hexagon EP. The soundtrack again included the track \"Courtesy\", as well as \"Focus\" from Chipzel's previous album Phonetic Symphony and a new track titled \"Otis\". Each track corresponded to a level in the game: \"Courtesy\" was used on the Hexagon level, \"Otis\" on the Hexagoner level, and \"Focus\" on the Hexagonest level. When a level in Super Hexagon is restarted, the track always starts off at a random place in order to keep players from feeling like they have to start back from the beginning every time.  Fittingly enough, the music that plays in the ending (lasting 60 seconds on Hyper Hexagonest) is a reversed and higher pitched version of Focus."]}, {"page": "Crypt of the NecroDancer", "response": ["The Xbox One version of the game added a sixth additional soundtrack by Chipzel.", "A free update to the PC version of the game was released on August 22, 2017, adding a seventh additional soundtrack by Masafumi Takada, consisting of arrangements from the Danganronpa franchise. The update also added in the Chipzel soundtrack from the Xbox One release."]}, {"page": "Adventure Time: The Secret of the Nameless Kingdom", "response": ["The game was announced on May 8, 2014. It was the last console Adventure Time game developed by WayForward Technologies and the first game in the series from American publisher Little Orbit. The game's director, Tomm Hulett, stated during a Q&A on Reddit, that he wanted to take all the negative feedback that they received for Hey Ice King! Why'd You Steal Our Garbage?!! and Explore the Dungeon Because I Don't Know!, which he also directed, in order to make the \"ultimate AT game\". The game's soundtrack was produced by Brave Wave Productions and was a collaborative work between Keiji Yamagishi, Eirik Suhrke, Niamh \"Chipzel\" Houston, Marco \"Monomirror\" Guardia and Ian Stocker. Composer Jake Kaufman also contributed a single piece of music, which was recycled from Explore the Dungeon Because I Don't Know!."]}, {"page": "Niamh Houston", "response": ["#REDIRECTChipzel"]}, {"page": "Niamh \"Chipzel\" Houston", "response": ["#REDIRECTChipzel"]}, {"page": "Niamh \"chipzel\" Houston", "response": ["#REDIRECTChipzel"]}, {"page": "Phonetic Symphony", "response": ["#REDIRECTChipzel"]}, {"page": "Niamh houston", "response": ["#REDIRECT Chipzel"]}, {"page": "Monaco: What's Yours Is Mine", "response": ["The soundtrack for Monaco was composed by Grammy-nominated Austin Wintory, who had previously composed scores for Flow and Journey. The original soundtrack and a remixed album called Gentleman's Private Collection were released on April 24, 2013. The soundtrack incorporates pianos and drums into what Christian Donlan of Eurogamer said was one of Wintory's best works yet. Schatz originally used licensed music but asked Wintory to replace some of it with original pieces. Wintory later persuaded Schatz that a complete original soundtrack was warranted. Wintory was excited by the request because it involved using humorous \"old-timey piano\", saying, \"when else am I ever going to be asked to write anything remotely like this?\" Gentleman's Private Collection contains remixes of the original soundtrack by other composers, including Peter Hollens, Tina Guo—who played the violin in the Journey soundtrack—and Chipzel who composed the soundtrack for Super Hexagon. The full soundtrack and Gentleman's Private Collection were released onto Wintory's microsite on Bandcamp."]}, {"page": "Brave Wave Productions", "response": ["*Chipzel"]}, {"page": "Dicey Dungeons", "response": ["Terry Cavanagh announced Dicey Dungeons in May 2018, after about three months of prior development, with an in-progress free version available for users to try up to this point. Cavanagh had planned to produce a commercial version of the game for release later in 2018. Dicey Dungeons is inspired by one of the first roguelike deck-builder games, Dream Quest. The game's art was created by Marlowe Dobbe, while its music was composed by Chipzel.", "Following its initial release exclusive to bandcamp, game soundtrack record label Materia Collective released the official soundtrack by Chipzel on 20 December 2019."]}, {"page": "Cadence of Hyrule", "response": ["Free downloadable content (DLC) for the game was added on December 18, 2019. It includes additional story-based content, with Octavo as the playable character, and a Dungeons mode. Three additional paid DLC were announced in July 2020, and can be purchased individually or as part of a Season Pass. The first, released on July 20, 2020, adds five playable characters to the game from both The Legend of Zelda and Crypt of the Necrodancer, each with their own special moves and attacks. The second, released on August 31, 2020, is a pack containing additional music tracks for the game arranged by Jules \"FamilyJules\" Conroy, Alex \"A_Rival\" Esquivel, and Chipzel. The final DLC, released on September 23, 2020, is a new adventure titled \"Symphony of the Mask\", starring the Skull Kid from The Legend of Zelda: Majora's Mask, which includes new maps, modes, and music. Additionally, a physical version of the game that includes all DLC was released on October 23, 2020."]}, {"page": "River City Girls", "response": ["Most of the game's staff was new, mostly regarding art, music, and animation. Composer \"Chipzel\" did most of the boss battle music and arranged the boss theme from the original River City Ransom. Megan McDuffee composed the tracks for the stages, cinematics, menus, and nearly everything else; some of McDuffee's pieces include vocal tracks she sung.Behind the Music of River City Girls: An Interview with Megan McDuffee  McDuffee also arranged music from River City Ransom and Kunio-tachi no Banka.  NateWantsToBattle and Dale North also contributed to the soundtrack, such as in the opening and ending songs.  Priscilla \"Rem\" Hamby, the illustrator of the webcomic Devil's Candy, was sought out to re-imagine the Kunio-kun characters.We Talk To WayForward About All Things River City Girls! (GoNintendo) Hamby also illustrated the cutscenes. Cristina Vee directed the voice actors as well as participated in the soundtrack. WayForward VFX artist Jordan Vine animated the sequences while Kevin Samuels from WayForward's SFX department added sound effects."]}, {"page": "List of chiptune artists", "response": ["* Chipzel"]}]}}