{"wiki_id": "http://www.wikidata.org/entity/Q1732387", "itemLabel": "Karl Miller", "itemDescription": "British journalist", "wikipedia_url": "https://en.wikipedia.org/wiki/Karl_Miller", "wikipedia_page": {"main": "Karl Fergus Connor Miller FRSL (2 August 1931 – 24 September 2014) was a British literary editor, critic and writer.Miller was born in the village of Loanhead, Midlothian, and was educated at the Royal High School of Edinburgh and Downing College, Cambridge, where he studied English; he was a Cambridge Apostle. He became literary editor of The Spectator and the New Statesman. Miller resigned from the latter over a disagreement with the magazine's editor Paul Johnson, over the extent to which the literary pages treated difficult subjects and also Johnson's disapproval of The Beatles and their fans.He was then editor of The Listener (1967–73) and subsequently of the London Review of Books, which he founded, from 1979 to 1992. He was also Lord Northcliffe Professor of Modern English Literature and head of the English Department at University College London from 1974 to 1992.\nMiller died on 24 September 2014, at the age of 83.", "link_mentions": [{"page": "August 2", "response": ["*  1931   – Karl Miller, English journalist and critic (d. 2014)"]}, {"page": "List of winners and shortlisted authors of the Booker Prize", "response": ["| rowspan=\"4\"| Karl Miller"]}, {"page": "Midlothian", "response": ["*Karl Miller (1931–2014), founding editor of the London Review of Books and Lord Northcliffe Professor of Modern English Literature at University College, London (1974–1992), born in Straiton."]}, {"page": "1979 in literature", "response": ["*October 25 – The London Review of Books is first issued, its founding editors being Karl Miller, Mary-Kay Wilmers and Susannah Clapp. For its first six months it appears as an insert to The New York Review of Books."]}, {"page": "1931 in literature", "response": ["*August 2 – Karl Miller, British writer and literary editor (died 2014)"]}, {"page": "1975 in literature", "response": ["*James Tait Black Memorial Prize for biography: Karl Miller, Cockburn's Millennium"]}, {"page": "James Hogg", "response": ["* The Electric Shepherd: A Likeness of James Hogg (2004) Karl Miller"]}, {"page": "New Statesman", "response": ["There was much less focus on a single political line in the back part of the paper, which was devoted to book reviews and articles on cultural topics. Indeed, with these pages managed by Janet Adam Smith, who was literary editor from 1952 to 1960, the paper was sometimes described as a pantomime horse: its back half was required reading even for many who disagreed with the paper's politics. This tradition would continue into the 1960s with Karl Miller as Smith's replacement."]}, {"page": "London Review of Books", "response": ["The LRB was founded in 1979, when publication of The Times Literary Supplement was suspended during the year-long lock-out at The Times. Its founding editors were Karl Miller, then professor of English at University College London, Mary-Kay Wilmers, formerly an editor at The Times Literary Supplement, and Susannah Clapp, a former editor at Jonathan Cape. For its first six months, it appeared as an insert in The New York Review of Books. It became an independent publication in May 1980. Its political stance has been described by Alan Bennett, a prominent contributor, as \"consistently radical\".Bennett, Alan, July 1996, in the Foreword to Jane Hindle (editor) London Review of Books: An Anthology, Verso, 1996.  \"The LRB has maintained a consistently radical stance on politics and social affairs\""]}, {"page": "Mary-Kay Wilmers", "response": ["After her graduation in 1960, she thought about becoming a translator at the United Nations, but instead went to work at the publishers Faber and Faber, employed at first as a secretary. On one occasion she thought she might be sacked for saying \"bugger\" in front of T. S. Eliot, whose letters she used to type up. She later became an editor at Faber and Faber, where she commissioned many books, among them Patriarchal Attitudes by Eva Figes, one of the first works of British feminism. She left Faber aged 29 to become deputy editor of The Listener, edited by Karl Miller, and in the 1970s had a spell at The Times Literary Supplement (TLS)."]}, {"page": "List of University of Cambridge people", "response": ["*Karl Miller (Downing)"]}, {"page": "James Tait Black Memorial Prize", "response": ["| 1975 || Brian Moore, The Great Victorian Collection ||\tKarl Miller, Cockburn's Millennium (Henry Cockburn) || "]}, {"page": "List of people associated with University College London", "response": ["* Karl Miller – Lord Northcliffe Professor of English Literature (1976–92); first editor, The London Review of Books"]}, {"page": "The Listener (magazine)", "response": ["* Karl Miller, 1967–1973"]}, {"page": "Loanhead", "response": ["*Karl Miller (1931–2014), British literary editor, critic and writer. He was a founding editor of the London Review of Books from 1979 until 1992. Before this, he was an editor of The Listener magazine from 1963 until 1973. Educated at the Royal High School, Edinburgh.Karl Miller – Loanhead, Midlothian-born and educated at The Royal High School"]}, {"page": "Harry Guest", "response": ["Harry Guest was educated at Malvern College and read Modern Languages at Trinity Hall, Cambridge. He wrote a thesis on Mallarmé at the Sorbonne. At Trinity Hall he co-edited the poetry magazine Chequer, which continued for eleven issues and published poems by Thom Gunn, Anne Stevenson, Ted Hughes, and Sylvia Plath, though there is no evidence to suggest he met Plath or Hughes.His co-editors for the first issue were Michael Bakewell, Ronald Hayman, Karl Miller and Michael Podro; the magazine was later taken over by Malcolm Ballin and Paul McQuial. See Chequer, 1 (1953) and David Miller and Richard Price, British Poetry Magazines 1914-2000: A History and Bibliography of Little Magazines, London: The British Library, 2006, 92. From 1955-66, he taught at Felsted School and Lancing College, and then moved to Japan, becoming a lecturer in English at Yokohama National University.Edward Lucie-Smith (ed), British Poetry since 1945, Harmondsworth, UK: Penguin, 1970, 363. He returned to England in 1972 and was Head of French at Exeter School until his retirement in 1991.Edward Lucie-Smith (ed), British Poetry since 1945 (revsd edn), Harmondsworth, UK: Penguin, 1985, 233. A selection of his poetry was included in Penguin Modern Poets 16. He was an Honorary Research Fellow at the University of Exeter and was awarded an honorary doctorate (LittD) by Plymouth University in 1998. Apart from his many collections of poetry, he is well known as a translator from the French and Japanese, and has published several novels and non-fiction books including the Traveller's Literary Companion to Japan (1994) and The Artist on the Artist (2000). His translations include a selected poems of Victor Hugo, The Distance, The Shadows (2002) and Post-War Japanese Poetry (with Lynn Guest and Kajima Shôzô, 1972). He lived in Exeter, and was married to the historical novelist Lynn Guest, they have two children.Harry Guest Shearsman TitlesHarry Guest  Anvil Press PoetryThe Writers of Wales Database  academi.org"]}, {"page": "Hugo Williams", "response": ["Williams's style evolved away from \"Review-style lyrical spareness\" while his subject matter became more personal and intimate in nature, culminating in his 1985 collection Writing Home, which the poet Mick Imlah called a \"classic of creative autobiography\". In it, according to the poet and critic Michael Hofmann, he made a \"complete and unexpected break with the tenets of economy, ceremony, care, melancholy and a kind of Oriental exquisiteness\" that had characterized his earlier work and began a \"loosening up\" that led his later work to \"the borderline between poetry and prose\" while bringing in \"more humour, sex, slapstick, and more of the world\". Williams credits his reading of Robert Lowell's Life Studies with the change, remarking that he was \"well into my career before I started writing about mummy and daddy and all that\". Karl Miller, who published many of Williams's poems in the London Review of Books during his tenure as editor, wrote in 1995 that his work was most admired for its \"directness, naturalness, unencumberedness\", while The London Magazine in 2014 described the poems in I Knew the Bride as \"blessed with a piercing clarity and unfailing readability."]}, {"page": "Ann Quin", "response": ["Quin is associated with a loosely constituted circle of 'experimental' authors in Sixties Britain, headed by B. S. Johnson and including Stefan Themerson, Rayner Heppenstall, Alan Burns and Eva Figes, influenced by Samuel Beckett and recent French fiction (Marguerite Duras, Alain Robbe-Grillet). They stood in opposition to the dominant tendency for social realism, manifest from John Osborne and John Wain to Karl Miller's Writing in England Today (Penguin, 1968).Gordon, Giles, \"Introduction\", to Ann Quin, Berg, Dalkey Archive, 2001. pp xii-xiv."]}, {"page": "John Michell (writer)", "response": ["Michell's impact on the hippie subculture was recognised by mainstream media, and he was invited to submit an article titled \"Flying saucers\" to The Listener in May 1968, which was accompanied by a critical piece by editor Karl Miller, in which Michell was described as \"less a hippy, perhaps, than a hippy's counsellor, one of their junior Merlins.\""]}, {"page": "Carl Miller", "response": ["Carl or Karl Miller may refer to:", "*Karl Miller (1931–2014), British writer", "*Karl Miller (footballer) (1913–1967), German international footballer"]}, {"page": "List of people educated at the Royal High School, Edinburgh", "response": ["* Karl Miller (born 1931), literary critic"]}, {"page": "The Dressmaker (Bainbridge novel)", "response": ["The Dressmaker was almost unanimously praised by critics. Karl Miller of the New York Review of Books called it \"a magnificent book\" about isolation and family strife. The Times Literary Supplement said that the novel was a \"remarkable achievement ... Miss Bainbridge's imagination pushes her towards nightmare, and her eye for detail is macabre.\"http://www.jiffynotes.com/a_study_guides/book_notes_add/mtcw_01/mtcw_01_00052.html"]}, {"page": "Visions Before Midnight", "response": ["Before being contracted by Observer editor David Astor, James had previously written one piece per month on television for The Listener and its editor, Karl Miller, had been an important influence on James. He had allowed him to, \"write a column which eschewed solemnity so thoroughly that it courted the frivolous. Like Lichtenberg Karl Miller appreciated the kind of joke that unveils a problem: if your gags had a serious reason for being there, they stayed in.\" James explains in the preface: \"Television was a natural part of my life. I loved watching it and I loved being on it. The second passion has since somewhat faded, but the first remains strong, and was very powerful at the time. I watched just about everything, including the junk. The screen teemed with unsummable activity. It was full of  visions, legends, myths, fables. T.V was scarcely something you could feel superior to. It was too various. What I had to offer was negative capability, a capability for submission to the medium. I was the first to submit myself to Alastair Burnet and find him fascinating. No critic before me had ever regarded David Vine as a reason for switching the set on.\""]}, {"page": "24 for 3", "response": ["24 for 3 is a 2007 novella by Jennie Walker (a pen name of English poet Charles Boyle); it won the 2008 McKitterick Prize.CB editions – publisher of new writing – About & News (awarded to authors over 40 for their first novel) and was selected by Karl Miller of the Times Literary Supplement as one of his books of the year in 2008.www.cbeditions.com Sonofabook: Good things. Monday, 1 December 2008"]}, {"page": "Janet Adam Smith", "response": ["In 1948, left a widow with four young children to educate, she returned to a salaried position in journalism, becoming first assistant literary editor (1949–52), then literary editor (1952–60), of the New Statesman, still the house magazine of the intellectual Left. It was sometimes described as a pantomime horse: its back half, over which she presided, was required reading even for many who disliked the paper's politics. She was a notably thorough literary editor. One of her successors, Karl Miller, recalled that \"Janet used to take the trouble of writing to people to tell them what was wrong with their articles\". Miller saw her – and himself – as \"Edinburgh reviewers, latter-day examples of an auld Scots element in literary journalism\".Cited by Allan Massie, obituary in The Scotsman, 14 September 1999.", "“Based in England throughout her adult life, she nevertheless remained committed to Scotland and Scottish literature. Karl Miller was right in seeing her as being an heir of the Edinburgh Reviewers, for she was one of the last representatives of the Scottish Enlightenment, marrying clear and bold thinking to generous feeling.\"Allan Massie, obituary in The Scotsman, 14 September 1999. This has been used extensively as a source for the present article. Minor amendments with the kind approval of the author."]}, {"page": "Rory McEwen (artist)", "response": ["McEwen was educated at the family home, Marchmont House in the Scottish Borders, by a French governess named Mademoiselle Philippe, and at Eton where he was taught by Wilfred Blunt who described him as \"perhaps the most gifted artist to pass through my hands\".  After his National Service in The Queen's Own Cameron Highlanders, he gained a degree in English at Trinity College, Cambridge, where, among others, he became friends with Karl Miller, Dudley Moore, Peter Cook, Jonathan Miller and Mark Boxer."]}, {"page": "Black Sea (book)", "response": ["Black Sea is a non-fiction book of travel and history by the Scottish writer Neal Ascherson. Its subject is the Black Sea and its surrounding lands. On its publication in 1995, the book received high praise from critics such as Richard Bernstein, Timothy Garton Ash, Karl Miller and Noel Malcolm. Black Sea won the Saltire Award for Literature in 1995 and the Los Angeles Times Book Award for History in 1996."]}, {"page": "1931 in Scotland", "response": ["* 2 August – Karl Miller, literary editor (died 2014 in England)"]}, {"page": "2014 in the United Kingdom", "response": ["**Karl Miller, 83, literary editor (The Listener, London Review of Books)."]}, {"page": "Deaths in September 2014", "response": ["*Karl Miller, 83, British literary editor (The Listener, London Review of Books).Karl Miller, founding editor of London Review of Books, dies at 83"]}, {"page": "Geoffrey Cannon", "response": ["Cannon's first published writings on popular culture appeared in 1962 in New Society, where he was a founder-member of the editorial staff. He worked in-house for the magazine, later becoming its design, art, production, and arts editor. From 1967, he began writing on popular culture for, and redesigned, The Listener, under the editorship of Karl Miller, and in 1968 began writing a weekly column on pop and rock music for The Guardian. Along with Tony Palmer of The Observer, a Sunday newspaper, he was one of the leading figures in the emergence of British rock criticism during the late 1960s. George Melly, who became The Observers first pop culture commentator in 1965, described the pair as seeking to \"establish a critical apparatus\" with which to evaluate contemporary popular music."]}]}}