{"wiki_id": "http://www.wikidata.org/entity/Q17308933", "itemLabel": "Richard Dalton", "itemDescription": "English draughtsman, engraver, and royal librarian; became an art dealer", "wikipedia_url": "https://en.wikipedia.org/wiki/Richard_Dalton_(librarian)", "wikipedia_page": {"main": "Richard Dalton (c.1715–1791) was an English draughtsman, engraver, and royal librarian. He later became an art dealer.", "link_mentions": [{"page": "Francesco Zuccarelli", "response": ["According to Henry Angelo, it was Richard Dalton, the royal librarian, who persuaded Zuccarelli to travel to England. Consul Smith was also likely involved in some way. A splendid canvas of the artist's early English period, signed and dated 1753, depicts a cheerful country festival. The Arcadian style remains his best known, where nature is transfigured into pleasant scenery, representing a platonic golden age, pervaded with beauty and love."]}, {"page": "Francesco Bartolozzi", "response": ["His first productions in Venice were plates in the style of Marco Ricci, Zuccarelli. He then moved for a short time in 1762 to Rome, where he completed a set of engravings representing frescoes at Grottaferrata by Domenichino depicting the life of St Nilus.  Those and his etchings of Old Master's works, began to draw attention throughout Europe. In 1763 he met Richard Dalton, the English Royal Librarian who was traveling in Italy looking for acquisitions for the King's collections. Dalton offered him an appointment as Engraver to the King; Bartolozzi accepted and left for London in 1764."]}, {"page": "Surveyor of the Queen's Pictures", "response": ["*Richard Dalton 1778–1791"]}, {"page": "Richard Dalton", "response": ["Richard Dalton may refer to:", "* Richard Dalton (canoeist) (born 1979), Irish-born, Canadian sprint canoer", "* Richard Dalton (cricketer) (born 1965), former English cricketer", "* Sir Richard Dalton (diplomat) (born 1948), British diplomat", "* Richard Dalton (librarian) (c. 1715–1791), English engraver and art dealer for George III", "* Richard Dalton (editor), former editor of the Whole Earth Software Catalog"]}, {"page": "Robert Strange (engraver)", "response": ["Strange went to Italy in 1760. His connections afforded him a passport for travel in France—this was the height of the Seven Years' War—and introductions through Johann Georg Wille to Johann Joachim Winckelmann and Anton Raphael Mengs, and through Horace Walpole to Horace Mann. He encountered Richard Dalton on a mission to copy Italian artworks that overlapped with his own plans, and a future rival in Francesco Bartolozzi. He returned to England in 1765, with an international reputation as engraver already established."]}, {"page": "Pediments of the Parthenon", "response": ["The head of Hermes disappeared between 1674 (drawing attributed to Carrey) and 1749 (drawing of Richard Dalton: he looked no longer the quarrel?, but already behind him. The bust of Iris was identified through the square holes at the shoulder blades, where her wings were originally attached. She wears a short tunic that the wind sticks to the forms of her body that can be divined in multiple folds. The tunic was retained by a thin belt, added in bronze and since lost."]}, {"page": "Richard Dalton (art dealer)", "response": ["#REDIRECTRichard Dalton (librarian)"]}, {"page": "The Madonna and Sleeping Child with the Infant St John the Baptist", "response": ["The work was much copied and referenced, most notably around 1605 by Domenichino (Louvre). It was recorded in inventories of the Farnese Collection at Palazzo del Giardino in Parma in 1678 and circa 1680 before being acquired in 1766 for George III by Richard Dalton - Dalton then also owned the black chalk, pen and ink sketch for it. The following year Francis Cotes produced a pastel portrait of George's wife Queen Charlotte holding their daughter Charlotte, Princess Royal and making a gesture similar to the Virgin Mary's in tribute to the acquisition of Il Silenzio."]}, {"page": "Mahmal", "response": ["Khalili Collection Hajj and Arts of Pilgrimage ARC pt-522.jpg|The mahmal passing through Cairo: 1791 illustration by the English engraver Richard Dalton"]}]}}