{"wiki_id": "http://www.wikidata.org/entity/Q1738596", "itemLabel": "Ken Dodd", "itemDescription": "English comedian, singer-songwriter and actor (1927-2018)", "wikipedia_url": "https://en.wikipedia.org/wiki/Ken_Dodd", "wikipedia_page": {"main": "Sir Kenneth Arthur Dodd  (8 November 1927 – 11 March 2018) was an English comedian, singer and occasional actor. He was described as \"the last great music hall entertainer\", and was primarily known for his live stand-up performances.\nA lifelong resident of Knotty Ash in Liverpool, Dodd's career as an entertainer started in the mid-1950s. His performances included rapid and incessant delivery of often surreal jokes, and would run for several hours, frequently past midnight. His verbal and physical comedy was supplemented by his red, white and blue \"tickling stick\" prop, and often introduced by his characteristic upbeat greeting of \"How tickled I am!\"   He interspersed the comedy with songs, both serious and humorous, and with his original speciality, ventriloquism. He also had several hit singles primarily as a ballad singer in the 1960s, and occasionally appeared in dramatic roles. He performed on radio and television, and popularised the characters of the Diddy Men.\nHe was knighted in the 2017 New Year Honours for services to entertainment and charity. His stage career lasted for over 60 years, and he continued to perform until the end of 2017; he died on 11 March 2018, aged 90.\n\n", "link_mentions": [{"page": "List of comedians", "response": ["* Ken Dodd (1927–2018)"]}, {"page": "Hamlet", "response": ["Kenneth Branagh adapted, directed, and starred in a 1996 film version of Hamlet that contained material from the First Folio and the Second Quarto. Branagh's Hamlet runs for just over four hours. Branagh set the film with late 19th-century costuming and furnishings, a production in many ways reminiscent of a Russian novel of the time; and Blenheim Palace, built in the early 18th century, became Elsinore Castle in the external scenes. The film is structured as an epic and makes frequent use of flashbacks to highlight elements not made explicit in the play: Hamlet's sexual relationship with Kate Winslet's Ophelia, for example, or his childhood affection for Yorick (played by Ken Dodd)."]}, {"page": "March 11", "response": ["*2018 – Ken Dodd, English comedian and singer (b. 1927)"]}, {"page": "Michael Palin", "response": ["Palin wrote most of his comedic material with fellow Python member Terry Jones. Before Monty Python, they had worked on other shows including the Ken Dodd Show, The Frost Report, and Do Not Adjust Your Set. Palin appeared in some of the most famous Python sketches, including \"Argument Clinic\", \"Dead Parrot sketch\", \"The Lumberjack Song\", \"The Spanish Inquisition\", \"Bicycle Repair Man\" and \"The Fish-Slapping Dance\". He also regularly played a Gumby.", "After finishing university in 1965 Palin became a presenter on a comedy pop show called Now! for the television contractor Television Wales and the West. At the same time Palin was contacted by Jones, who had left university a year earlier, for assistance in writing a theatrical documentary about sex through the ages. Although this project was eventually abandoned, it brought Palin and Jones together as a writing duo and led them to write comedy for various BBC programmes, such as The Ken Dodd Show, The Billy Cotton Bandshow, and The Illustrated Weekly Hudd. They collaborated in writing lyrics for an album by Barry Booth called Diversions. They were also in the team of writers working for The Frost Report, whose other members included Frank Muir, Barry Cryer, Marty Feldman, Ronnie Barker, Ronnie Corbett, Dick Vosburgh and future Monty Python members Graham Chapman, John Cleese and Eric Idle.", "*The Ken Dodd Show"]}, {"page": "November 8", "response": ["*  1927   – Ken Dodd, English singer and comedian (d. 2018)"]}, {"page": "1927", "response": ["** Ken Dodd, English comedian (d. 2018)"]}, {"page": "List of British comedians", "response": ["*Ken Dodd (1927–2018)", "*Ken Dodd (1927–2018)"]}, {"page": "Les Dawson", "response": ["On 1 June 2013 ITV broadcast Les Dawson: An Audience with That Never Was. The programme featured a Pepper's ghost projection of Dawson, presenting content for a 1993 edition of An Audience with... to be hosted by Dawson but unused due to his death two weeks before recording. The show served as a tribute and featured celebrities including Bruce Forsyth, Cilla Black, Terry Wogan and Ken Dodd. Also among the audience were Dawson's wife Tracy and daughter Charlotte (who was only eight months old when he died)."]}, {"page": "Ulverston", "response": ["In 2009, the comedian Ken Dodd unveiled a statue of Laurel and Hardy (by Graham Ibbeson) outside Coronation Hall in the town centre."]}, {"page": "Hamlet (1996 film)", "response": ["Hamlet is a 1996 film adaptation of William Shakespeare's play Hamlet, adapted and directed by Kenneth Branagh, who also stars as Prince Hamlet. The film also features Derek Jacobi as King Claudius, Julie Christie as Queen Gertrude, Kate Winslet as Ophelia, Michael Maloney as Laertes, Richard Briers as Polonius, and Nicholas Farrell as Horatio. Other cast members include Robin Williams, Gérard Depardieu, Jack Lemmon, Billy Crystal, Rufus Sewell, Charlton Heston, Richard Attenborough, Judi Dench, John Gielgud and Ken Dodd.", "*Ken Dodd as Yorick, the King's Jester, played in flashback entertaining the royals of Elsinore during the gravediggers scene."]}, {"page": "Lloyd's of London", "response": ["* Ken Dodd's teeth for $7.4m"]}, {"page": "Madame Tussauds", "response": ["| Michael Jackson ||  || Ken Dodd || The Duchess of Cambridge"]}, {"page": "1996 in film", "response": ["| Hamlet || Columbia Pictures / Castle Rock Entertainment || Kenneth Branagh (director/screenplay); Kenneth Branagh, Julie Christie, Billy Crystal, Gerard Depardieu, Charlton Heston, Derek Jacobi, Jack Lemmon, Rufus Sewell, Robin Williams, Kate Winslet, Timothy Spall, Rosemary Harris, Richard Attenborough, John Gielgud, Judi Dench, Reece Dinsdale, Richard Briers, Nicholas Farrell, Michael Maloney, Ian McElhinney, Ray Fearon, Brian Blessed, Simon Russell Beale, Don Warrington, Ravil Isyanov, John Mills, Ken Dodd, John Spencer-Churchill, 11th Duke of Marlborough || Drama || Live action"]}, {"page": "1999 in film", "response": ["| Alice in Wonderland || NBC / Hallmark Entertainment / Babelsberg International Film Produktion / Sparrowhawk Distribution || Nick Willing (director); Peter Barnes (screenplay); Tina Majorino, Miranda Richardson, Martin Short, Whoopi Goldberg, Simon Russell Beale, Robbie Coltrane, Ken Dodd, Heathcote Williams, Gene Wilder, George Wendt, Christopher Lloyd, Peter Ustinov, Ben Kingsley, Elizabeth Spriggs, Pete Postlethwaite, Liz Smith, Francis Wright, Richard Coombs, Ken Sansom, Donald Sinden, Jason Flemyng, Jason Byrne, Paddy Joyce, Ken Campbell, Peter Bayliss, Joanna Lumley, Sheila Hancock, Murray Melvin, Nigel Plaskitt, Peter Eyre, Hugh Lloyd, Christopher Ryan, Jeremy Brudenell, Dilys Laye, Christopher Greet || Adventure, Comedy, Family || Live action"]}, {"page": "Steptoe and Son", "response": ["* In 1966, they appeared on the BBC series The Ken Dodd Show in another live on stage sketch written by Galton and Simpson featuring Steptoe and Son on Blackpool beach, with Ken Dodd in the last two minutes as a strange golf professional. A telerecording of the show, broadcast on 24 July 1966, survives."]}, {"page": "Music hall", "response": ["* The variously titled Ken Dodd TV series recorded between 1959 and 1988 were heavily influenced by those traditions; up to his death in 2018, Dodd continued to tour a variety show including quick-fire stand-up comedy, songs, ventriloquism and sometimes other speciality acts."]}, {"page": "Blackpool", "response": ["Blackpool remains a summer entertainment venue but many local establishments now trade all year round. It is known for specialising in variety shows featuring entertainers catering to a broad range of tastes, from family-friendly Ken Dodd to the 'adults only' humour of Roy 'Chubby' Brown."]}, {"page": "Columbia Graphophone Company", "response": ["Under EMI, UK Columbia's releases were mainly licensed recordings from American Columbia until 1951 when American Columbia switched British distribution to Philips Records. UK Columbia continued to distribute American Columbia sister labels Okeh and Epic until 1968 when American Columbia's then parent CBS moved distribution of all its labels to the new CBS Records created from the purchase of Oriole Records (UK) in late 1964. The loss of American Columbia product had forced UK Columbia to groom its own talent such as Russ Conway, John Barry, Cliff Richard, the Shadows, Helen Shapiro, Frank Ifield, Rolf Harris, Freddie and the Dreamers, the Dave Clark Five, Shirley Bassey, Frankie Vaughan, Des O'Connor, Ken Dodd, the Animals, Herman's Hermits, Gerry and the Pacemakers, the Seekers, the Yardbirds, Jeff Beck, and Pink Floyd.Pink Floyd recorded their first three albums for Columbia Graphophone, then switched to Harvest; some of their recordings for Harvest were leased to the CBS Columbia label. Led by A&R man Norrie Paramor, the label was arguably the most successful in Britain in the rock era prior to the beat boom."]}, {"page": "The River", "response": ["* \"The River (Le Colline Sono In Fiore)\", a song by Ken Dodd"]}, {"page": "ITV Yorkshire", "response": ["On 28 February 1967, national and regional newspapers carried numerous advertisements from the Independent Television Authority, each requesting applicants for various new ITV contracts, one of which was Programme Contractor for Yorkshire Area (Contract D) – All Week. Ten formal bids were received by the closing date; another less-serious bid, Diddy TV, headed by comedian Ken Dodd withdrew their application. "]}, {"page": "Liverpool Lime Street railway station", "response": ["The main concourse features a pair of statues of comedian Ken Dodd and politician Bessie Braddock, a work entitled \"Chance Meeting\" by sculptor Tom Murphy, which were unveiled by Ken Dodd himself during June 2009. On 31 August 2014, the Earl of Wessex unveiled a memorial to the Liverpool Pals at the station. The memorial, which comprises two bronze friezes, was also sculpted by Tom Murphy. During 2014, former Platforms 1–5 were fully refurbished by national rail infrastructure maintenance company Network Rail."]}]}}