{"wiki_id": "http://www.wikidata.org/entity/Q17385828", "itemLabel": "Jeff Dexter", "itemDescription": "British DJ", "wikipedia_url": "https://en.wikipedia.org/wiki/Jeff_Dexter", "wikipedia_page": {"main": "Jeff Dexter (born Jeffrey Dexter Bedwell, 15 August 1946) is a British disc jockey (DJ), club promoter, record producer and former dancer, who rose to prominence in the mid-1960s as the resident DJ at the influential London club Middle Earth. He is closely associated with the Mod scene and popularising The Twist in England.\n\n", "link_mentions": [{"page": "Elephant and Castle", "response": ["* DJ, club promoter and music producer Jeff Dexter was born 15 August 1946 in Lambeth Hospital and grew up in Newington Butts, moving to Camberwell Road when he was ten years old."]}, {"page": "Linda Lewis", "response": ["During 1967, Linda Lewis formed White Rabbit with Junior Marvin, moving on to replace Marsha Hunt in the soul rock band The Ferris Wheel in 1970 and touring Europe with them. She also recorded the album Ferris Wheel (1970) and the single \"Can't Stop Now\" with them before the band broke up the same year. On 19 September 1970, Lewis appeared at the first Glastonbury Festival (where she jammed with Terry Reid and David Lindley), having been booked by the DJ and concert booker Jeff Dexter. After a chance meeting with Warner Bros. Records executive Ian Ralfini, Lewis signed to Warner Bros. Records imprint label Reprise. Lewis also worked as a session vocalist in this period, which led to her appearance on albums such as Possible Projection of the Future by Al Kooper, David Bowie's Aladdin Sane (1973), Cat Stevens's Catch Bull at Four (1972) and Hummingbird's first album Hummingbird (1975). She then signed to Family's new Warner Brothers distributed \"Raft\" label."]}, {"page": "Dexter (name)", "response": ["*Jeff Dexter (born 1946), British disc jockey, club promoter, record producer and dancer"]}, {"page": "\"Jeff Dexter\"", "response": ["#REDIRECT Jeff Dexter"]}, {"page": "Jeff Dexter (DJ)", "response": ["#REDIRECT Jeff Dexter"]}]}}