{"wiki_id": "http://www.wikidata.org/entity/Q17423536", "itemLabel": "David Lyon", "itemDescription": "British parliamentarian, died 1872", "wikipedia_url": "https://en.wikipedia.org/wiki/David_Lyon_(British_politician)", "wikipedia_page": {"main": "David Lyon Junior (1794–1872) was a West Indies merchant, Member of Parliament, and landowner. His portrait was painted by Sir Thomas Lawrence c. 1825, and is now in the Museum Thyssen-Bornemisza in Madrid.", "link_mentions": [{"page": "Charles Fremantle", "response": ["Fremantle died in 1869 and is buried in Brompton Cemetery, London. The grave lies against the east wall, near a more prominent monument to the politician David Lyon."]}, {"page": "Decimus Burton", "response": ["Burton was commissioned to design Holy Trinity Church at Tunbridge Wells in the neo-gothic style: he unwisely accepted the commission despite that he was 'neither by temperament nor training' qualified to design a work in this style, of which he knew little, and his design was censured, in addition to commended as a 'beautiful structure' and a 'handsome structure' which 'reflects great credit on the architect'. A more unanimously successful attempt to design in the neogothic style was St Mary's Church, Goring-by-Sea, which he redesigned, for the Tory MP David Lyon, between 1836 and 1838.", "* St Mary's Church, Goring-by-Sea (1836–38). Burton was commissioned by David Lyon to redesign the church."]}, {"page": "Brompton Cemetery", "response": ["* David Lyon MP West Indies merchant, landowner and client of Decimus Burton"]}, {"page": "List of Old Harrovians", "response": ["*David Lyon (1794–1872), MP for Bere Alston and subject of a Thomas Lawrence painting", "*David Lyon (1794–1872), West Indies merchant and MP"]}, {"page": "Bere Alston (UK Parliament constituency)", "response": ["|rowspan=\"2\"| David Lyon"]}, {"page": "Balintore Castle", "response": ["Balintore Castle was commissioned as a sporting lodge by David Lyon, MP, who had inherited a fortune made by his family through investments in the East India Company. Latterly the castle was used only during the shooting season."]}, {"page": "St Mary's Church, Goring-by-Sea", "response": ["Some evidence exists for a Saxon-era place of worship in Goring, but this is not certain.  A church on the present site, dedicated to Mary, was founded in the late 12th century.  It was in regular use for worship thereafter, and apart from some additions in the 14th century it remained structurally unchanged until the intervention of David Lyon in 1836–1837.  Lyon, a rich merchant, bought land and one of the manor houses in 1834, and set about transforming the area.  As well as demolishing the manor house and building Goring Hall, a new mansion, he commissioned architect Decimus Burton to redesign St Mary's Church.  The 12th-century building was partly demolished: Burton retained only the original arcades in the nave.  Lyon paid for the reconstruction himself.", "There are several monuments in various forms inside the church.  The oldest, dating from about 1490, are a pair of  brass effigies of a husband and wife.  A funerary hatchment dated 1860 commemorates Sir George Richard Brooke-Pechell, 4th Baronet, of the Pechell Baronetcy, who died in that year.  A bust commemorating Susan Cook, who died in 1707, has been praised as \"lively\" and \"full of femininity\".  A white marble sculpture created in 1841 by Francis Legatt Chantrey, commemorating Isabella Lyon (a relative of David Lyon), is considered less impressive but still of some merit."]}, {"page": "David Lyon", "response": ["David Lyon may refer to:", "*David Lyon (actor) (1941–2013), British actor", "*David Lyon (cricketer) (born 1943), English cricketer", "*David Lyon (designer) (born 1968), car designer", "*David Lyon (rugby) (born 1965), English rugby league and rugby union player", "*David Lyon (sociologist) (born 1948), professor of sociology at Queen's University, Kingston, Ontario", "*David Lyon (British politician) (1794–1872), West India merchant, Member of Parliament and landowner", "*David Lyon (Nigerian politician) (born 1970), disqualified governor-elect of Bayelsa State", "*David Lyons (disambiguation)"]}, {"page": "List of United Kingdom by-elections (1818–1832)", "response": ["|11 January 1831||Bere Alston||c*||Lord Lovaine||David Lyon||Succeeded to a peerage"]}, {"page": "List of MPs elected in the 1831 United Kingdom general election", "response": ["|rowspan=\"2\" | Bere Alston (two members)||David Lyon||"]}, {"page": "David Lyon (politician, 1794)", "response": ["#REDIRECT David Lyon (British politician)"]}, {"page": "David Lyon (politician, born 1794)", "response": ["#REDIRECT David Lyon (British politician)"]}]}}