{"wiki_id": "http://www.wikidata.org/entity/Q17485380", "itemLabel": "Francis Twiss", "itemDescription": "(1760-1827)", "wikipedia_url": "https://en.wikipedia.org/wiki/Francis_Twiss", "wikipedia_page": {"main": "Francis Twiss (bapt. 1759 – 1827) was an English drama critic, known as the compiler of a concordance to William Shakespeare.", "link_mentions": [{"page": "Mary Cowden Clarke", "response": ["In the year after her marriage, Cowden Clarke began her valuable Shakespeare concordance. The compilation occupied twelve years, a further four years being devoted to seeing it through the press. It was eventually issued in eighteen monthly parts (1844–1845), and in volume form in 1845 as The Complete Concordance to Shakespeare, being a Verbal Index to all the Passages in the Dramatic Works of the Poet. This work superseded the Copious Index to ... Shakespeare (1790) of Samuel Ayscough, and the Complete Verbal Index ... (1805–1807) of Francis Twiss."]}, {"page": "Samuel Ayscough", "response": ["Until Ayscough brought out his Index in 1790 there had been no concordance to Shakespeare. This was a speculation on the part of the publisher, John Stockdale, who paid 200 guineas for the index, which was designed to accompany his two-volume edition of the Dramatic Works. Here the words are arranged alphabetically with the lines in which they occur, then the name of the play, and in five separate columns the act, scene, page, column and line. The last three particulars refer only to the edition of 1790, but the index may be made to serve any other text. Francis Twiss compiled his Verbal Index in 1805; both were superseded by Mrs Cowden Clarke's Concordance of 1845. All three are devoted to the plays alone and are supplemented by Mrs Furness's Concordance to Shakespeare's Poems (1874). There was still no complete concordance to the entire works in the late 19th century."]}, {"page": "Horace Twiss", "response": ["Twiss was born at Bath, Somerset, the son of Francis Twiss (1760–1827) and his wife Frances née Kemble (sister of Sarah Siddons née Kemble). He was a Shakespearian scholar. In his youth he wrote light articles for newspapers; he became a successful lawyer and was appointed a Queen's Counsel in 1827. In 1820 he was elected to Parliament, where, with some interruptions, he sat until 1841, holding the office of Under-Secretary of State for War and the Colonies in 1828–1830. In 1844 he was appointed vice-chancellor of the Duchy of Lancaster, a well-paid post which enabled him to enjoy his popularity in London society. For some years he wrote for The Times, in which he first compiled the parliamentary summary, and his daughter married first Francis Bacon (d. 1840) and then J. T. Delane, both of them editors of that paper. He was the author of The Public and Private Life of Lord Chancellor Eldon, and other volumes. He died suddenly in London on 4 May 1849, aged 62. He was survived by his son, Quintin Twiss."]}, {"page": "Richard Twiss (writer)", "response": ["Born at Rotterdam on 26 April 1747, he was the son of an English merchant living in Holland; Francis Twiss the writer was his younger brother. With an ample fortune, he travelled, and visited Scotland. He then journeyed through Holland, Belgium, France, Switzerland, Italy, Germany, and Bohemia till 1770, when he returned to England. In 1772 he went to Spain and Portugal, returning the following year. He was elected a fellow of the Royal Society in 1774; but left it in 1794. In 1775 he visited Ireland."]}, {"page": "Quintin Twiss", "response": ["Quintin William Francis Twiss (13 March 1835 – 7 August 1900) was an English first-class cricketer and actor.", "The son of the politician Horace Twiss, he was born at Westminster in March 1835. Twiss was educated at Westminster School, before going up to Christ Church, Oxford. While at Oxford he developed an interest in acting and was known to Lewis Carroll, three years his senior. After graduating from Oxford, he became a clerk at the Treasury, though he maintained his status as a well known amateur actor by performing in numerous stage productions. He appeared in first-class cricket for the Gentlemen of England against the Gentlemen of Kent and Sussex at Canterbury in 1857. Batting twice in the match, he was dismissed in the Gentlemen of England's first-innings without scoring by South Norton, while in their second-innings he was dismissed for 4 runs by the same bowler. Twiss died at Westminster in August 1900. His extended family included his grandmother, the actress Frances Kemble, and his grandfather Francis Twiss."]}]}}