{"wiki_id": "http://www.wikidata.org/entity/Q1746678", "itemLabel": "Alma Taylor", "itemDescription": "British actress (1895-1974)", "wikipedia_url": "https://en.wikipedia.org/wiki/Alma_Taylor", "wikipedia_page": {"main": "Alma Louise Taylor (3 January 1895 – 23 January 1974) was a British actress.", "link_mentions": [{"page": "1927 in film", "response": ["*Quinneys, directed by Maurice Elvey and starring John Longden and Alma Taylor – (Britain)"]}, {"page": "1914 in film", "response": ["* April 6 – The Old Curiosity Shop directed by Thomas Bentley, starring Alma Taylor", "* The Basilisk (British/ Hepworth) written and directed by Cecil B. Hepworth, starring William Felton and Alma Taylor;  yet another adaptation of George du Maurier's 1894 novel Trilby; prints were tinted green for theatrical release.Kinnard,Roy (1995). \"Horror in Silent Films\". McFarland and Company Inc. Page 61. ."]}, {"page": "Alma Cogan", "response": ["Although Jewish, she attended St Joseph's Convent School in Reading. Her father was a singer, but it was Cogan's mother who had showbusiness aspirations for both her daughters (she had named Cogan after silent screen star Alma Taylor). Cogan first performed in public at a charity show at the Palace Theatre in Reading, and at the age of eleven, competed in the \"Sussex Queen of Song\" contest held at a Brighton hotel, winning a prize of £5."]}, {"page": "The Smallest Show on Earth", "response": ["The silent film shown in the film is Comin' Thro the Rye (1923) starring Alma Taylor. Taylor is among the uncredited viewers in the audience."]}, {"page": "List of female movie actors by name: T–V", "response": ["*Alma Taylor (1895–1974)"]}, {"page": "Tom Powers", "response": ["Thomas McCreery Powers was born in 1890 in Owensboro, Kentucky. His father, Colonel Joshua D. Powers, was a banker; his uncle was sculptor Hiram Powers. Tom Powers' mother loved the theatre and enrolled him at ballet school at age three. He entered the American Academy of Dramatic Arts at age 16, and he studied drama, wrote and produced plays, and practiced stage design in a small theatre in the attic of his home. Powers apprenticed to a pantomime troupe for ten years and became a star of Vitagraph Westerns. Powers appeared in over 70 silent films from 1911 to 1917 opposite such actors as Florence Turner, Harry T. Morey, Clara Kimball Young, Alma Taylor and John Bunny."]}, {"page": "Lost (1956 film)", "response": ["*Alma Taylor as Mrs. Bellamy (uncredited)"]}, {"page": "List of British films before 1920", "response": ["| Oliver Twist || Thomas Bentley || Alma Taylor, Harry Royston || Drama ||", "|Adrift on Life's Tide || Warwick Buckland || Alma Taylor, Flora Morris, Harry Royston || Drama ||", "| David Copperfield || Thomas Bentley || Reginald Sheffield, Alma Taylor || Drama || ", "| A Midnight Adventure || Frank Wilson || Alma Taylor, Jack Raymond, Harry Royston || Drama ||", "| By Whose Hand? || Warwick Buckland || Alma Taylor, Lionelle Howard, Stewart Rome || Crime ||", "| The Girl Who Lived in Straight Street || Warwick Buckland || Stewart Rome, Alma Taylor, Chrissie White || Drama || ", "| The Heart of Midlothian || Frank Wilson || Flora Morris, Violet Hopson, Alma Taylor, Stewart Rome || Historical ||", "| Justice || Frank Wilson || Alec Worcester, Alma Taylor, Stewart Rome || Crime ||", "| In the Shadow of Big Ben || Frank Wilson || Tom Powers, Alma Taylor, Jack Raymond || Thriller ||", "|The Old Curiosity Shop||Thomas Bentley||Warwick Buckland, Alma Taylor || Drama||", "| The Whirr of the Spinning Wheel || Frank Wilson || Alma Taylor, Stewart Rome, Alice De Winton || Romance ||", "|The Baby on the Barge||Cecil Hepworth||Alma Taylor, Stewart Rome||Drama||", "| Be Sure Your Sins || Cecil M. Hepworth || Alma Taylor, Stewart Rome, Violet Hopson || Drama ||", "| The Bottle || Cecil M. Hepworth || Albert Chevalier, Stewart Rome, Alma Taylor || Drama ||", "| The Golden Pavement || Cecil M. Hepworth || Alma Taylor, Stewart Rome, Lionelle Howard || Drama ||", "| A Lancashire Lass || Frank Wilson || Stewart Rome, Alma Taylor, Tom Powers || Crime ||", "| The Man Who Stayed at Home || Cecil M. Hepworth || Dennis Eadie, Violet Hopson, Alma Taylor || Thriller ||", "| Sweet Lavender || Cecil M. Hepworth || Henry Ainley, Chrissie White, Alma Taylor || Romance ||", "| The Traitor || Cecil M. Hepworth || Stewart Rome, Tom Powers, Alma Taylor || War || ", "|Annie Laurie||Cecil Hepworth||Alma Taylor, Stewart Rome||Romance||", "| Comin' Thro' the Rye ||Cecil M. Hepworth || Alma Taylor, Stewart Rome, Marguerite Blanche || Drama || ", "| Iris || Cecil M. Hepworth || Henry Ainley, Alma Taylor, Stewart Rome || Romance ||", "|The Marriage of William Ashe||Cecil M. Hepworth || Henry Ainley, Alma Taylor || Drama || ", "| Molly Bawn || Cecil M. Hepworth || Violet Hopson, Alma Taylor, Stewart Rome || Drama ||", "| Sowing the Wind || Cecil Hepworth || Henry Ainley, Alma Taylor, Stewart Rome || Romance ||", "| Trelawny of the Wells || Cecil Hepworth || Alma Taylor, Stewart Rome, Violet Hopson || Romance || ", "| The American Heiress || Cecil M. Hepworth || Alma Taylor, Violet Hopson, Stewart Rome || Crime ||", "| The Cobweb || Cecil M. Hepworth || Henry Edwards, Alma Taylor, Stewart Rome || Thriller ||", "| Merely Mrs. Stubbs || Henry Edwards || Alma Taylor, Lionelle Howard, Mary Rorke || Drama ||", "| Nearer My God to Thee || Cecil M. Hepworth || Henry Edwards, Alma Taylor || Drama ||", "| Boundary House || Cecil Hepworth || Alma Taylor, Gerald Ames || Drama ||", "| The Touch of a Child  || Cecil M. Hepworth || Alma Taylor, Henry Edwards, Stewart Rome || Drama || ", "| Broken in the Wars || Cecil Hepworth || Henry Edwards, Chrissie White, Alma Taylor || Drama ||", "|The Forest on the Hill||Cecil Hepworth||Alma Taylor, James Carew||Crime||", "| The Nature of the Beast || Cecil Hepworth || Alma Taylor Gerald Ames, James Carew || Drama ||", "| Sheba|| Cecil M. Hepworth || Alma Taylor, Gerald Ames, James Carew || Drama ||", "| Sunken Rocks || Maurice Elvey || Alma Taylor, Gerald Ames, James Carew || Drama ||"]}, {"page": "List of rediscovered films", "response": [" || Helen of Four Gates || Cecil Hepworth || Alma TaylorJames Carew || Found in a film vault in Quebec, Canada in 2008. However, footage from the film had been excerpted in the 1995 documentary Cinema Europe: The Other Hollywood. || http://www.halifaxcourier.co.uk/news/Silent-classic-Helen-of-Four.4520190.jp </span>The Halifax Courier, 9/24/08"]}, {"page": "List of British films of 1932", "response": ["|Bachelor's Baby||Harry Hughes||William Freshman, Henry Wenman, Alma Taylor||Comedy||"]}, {"page": "Trelawny of the 'Wells'", "response": ["In 1916, the play was adapted into a silent film Trelawny of the Wells directed by Cecil Hepworth and starring Alma Taylor, Stewart Rome, and Violet Hopson. The play was adapted a second time in 1928 by Metro-Goldwyn-Mayer as The Actress, directed by Sidney Franklin and starring Norma Shearer.  There was also a 1938 adaptation directed by Tyrone Guthrie."]}, {"page": "List of English people", "response": ["* Alma Taylor (1895–1974)"]}, {"page": "Ronald Colman filmography", "response": ["| Alma Taylor", "| Alma Taylor"]}, {"page": "Shadow of Egypt", "response": ["Shadow of Egypt is a 1924 British silent adventure film directed by Sidney Morgan and starring Carlyle Blackwell, Alma Taylor and Milton Rosmer. A European adventurer tries to steal from an ancient Egyptian tomb, only to become afflicted by a mysterious curse.", "* Alma Taylor as Lilian Westcott "]}, {"page": "Alma (given name)", "response": ["*Alma Taylor (1895–1974), British actress"]}, {"page": "Everybody Dance (film)", "response": ["Everybody Dance is a 1936 British musical film directed by Charles Reisner and starring Cicely Courtneidge, Ernest Truex, Percy Parsons and Alma Taylor. The film's sets were designed by Alex Vetchinsky. It was made at Islington Studios.", "* Alma Taylor as Rosemary Spurgeon"]}, {"page": "BFI 75 Most Wanted", "response": ["|1921 || The Narrow Valley || Cecil Hepworth ||Starring Alma Taylor, highly praised for its location shots of the South Downs countryside"]}, {"page": "The Narrow Valley", "response": ["* Alma Taylor as Victoria"]}, {"page": "Helen of Four Gates", "response": ["Helen of Four Gates is a 1920 British silent melodrama film directed by cinema pioneer Cecil Hepworth and starring Alma Taylor (in a dual role as mother and daughter), James Carew, and Gerald Ames.", "* Alma Taylor as Helen", "A critical evaluation of the film from a 21st-century perspective by Bryony Dixon notes: \"Hepworth's penchant for the British picturesque and the location shooting and composition are the film's strongest points. The scenes on the hilltops are stunning, composed with receding skylines in deep focus in the best tradition of Victorian photography.\"  However she also observes: \"the film feels slightly old fashioned due to Hepworth's unusual editing style which had not followed what was by then the accepted standards of film grammar. The continuity is occasionally spoiled by Hepworth's refusal to cut on action...despite sterling efforts by Alma Taylor and particularly James Carew, the performers are left floundering and resort to a gestural melodramatic manner on occasions.\"Helen of Four Gates (1920) Dixon, Bryony. BFI Screen Online. Retrieved 26 August 2010"]}, {"page": "Tansy (film)", "response": ["Tansy is a 1921 British silent drama film directed by Cecil Hepworth and starring Alma Taylor, Gerald Ames and James Carew.  The film was based on a popular rural novel of the time by Tickner Edwardes, and was filmed largely on location on the Sussex Downs.", "* Alma Taylor as Tansy Firle"]}, {"page": "The Baby on the Barge", "response": ["The Baby on the Barge is a 1915 British silent film drama directed by Cecil Hepworth and starring Alma Taylor and Stewart Rome.  No print of the film is known to survive and it is presumed lost.", "* Alma Taylor as Nellie Jennis"]}, {"page": "David Copperfield (1913 film)", "response": ["* Alma Taylor as Dora Spenlow"]}, {"page": "Comin' Thro the Rye (film)", "response": ["Comin' Thro the Rye is a 1923 British silent drama film directed by Cecil Hepworth and starring Alma Taylor and Ralph Forbes. The film was based on the 1875 novel of the same name by Helen Mathers. The title alludes to the Robert Burns 1782 poem \"Comin' Through the Rye\".", "*Alma Taylor as Helen Adair"]}, {"page": "A South Sea Bubble", "response": ["A South Sea Bubble is a 1928 British silent comedy adventure film directed by T. Hayes Hunter and starring Ivor Novello, Benita Hume and Alma Taylor.BFI.org The screenplay concerns a group of adventurers who head to the Pacific Ocean to hunt for buried treasure. It was made at Islington Studios.Wood p.66", "* Alma Taylor as Mary Ottery"]}, {"page": "Quinneys (1927 film)", "response": ["Quinneys is a 1927 British romance film directed by Maurice Elvey and starring John Longden, Alma Taylor and Henry Vibart.BFI.org It is an adaptation of the play Quinneys  by Horace Annesley Vachell. David Lean worked on the film as a camera assistant.Philips p.17 It was made by Gaumont British at their Lime Grove Studios. The screenplay concerns a British furniture salesman who buys some chairs from an American dealer, only to discover that they are fakes. ", "* Alma Taylor - Susan Quinney "]}, {"page": "Deadlock (1931 film)", "response": ["* Alma Taylor as Mrs. Tring "]}, {"page": "Violet Hopson", "response": ["Her first British film was Mr Tubby's Triumph made in 1910. From 1912 she worked for Cecil Hepworth, along with Alma Taylor, Chrissie White, James Carew, Gerald Ames and John MacAndrews. Hepworth famously promoted her as a \"Dear Delightful Villaness.\"Brian McFarlane(2003) The Encyclopedia of British Film p. 318, BFI Methuen, "]}, {"page": "Trelawny of the Wells (film)", "response": ["Trelawny of the Wells is a 1916 British silent romance film directed by Cecil Hepworth, and starring Alma Taylor, Stewart Rome, and Violet Hopson.BFI.org It is an adaptation of the 1898 play Trelawny of the Wells by Arthur Wing Pinero. The story was later filmed as a late silent by MGM in 1928 under the title The Actress, starring Norma Shearer.", "* Alma Taylor - Rose Trelawny"]}, {"page": "The House of Marney", "response": ["The House of Marney is a 1927 British silent crime film directed by Cecil Hepworth and starring Alma Taylor, John Longden and James Carew.BFI.org It was based on a novel by John Goodwin.", "* Alma Taylor - Beatrice Maxon "]}, {"page": "The Forest on the Hill", "response": ["The Forest on the Hill is a 1919 British silent crime film directed by Cecil Hepworth and starring Alma Taylor, James Carew and Gerald Ames.BFI.org It was based on a novel by Eden Philpotts.", "* Alma Taylor - Drusilla Whyddon "]}, {"page": "Mist in the Valley", "response": ["Mist in the Valley is a 1923 British silent crime film directed by Cecil Hepworth and starring Alma Taylor, G.H. Mulcaster and James Carew. It was based on a novel by Dorin Craig.", "* Alma Taylor - Margaret Yeoland "]}, {"page": "Anna the Adventuress", "response": ["Anna the Adventuress is a 1920 British silent drama film directed by Cecil Hepworth and starring Alma Taylor, Jean Cadell and James Carew. It is based on a novel by Phillips Oppenheim. Made by Hepworth Pictures at Walton Studios, it is now considered a lost film.", "* Alma Taylor as Anna / Annabel Pelissier "]}, {"page": "Annie Laurie (1916 film)", "response": ["Annie Laurie is a 1916 British silent romance film directed by Cecil Hepworth and starring Alma Taylor, Stewart Rome and Lionelle Howard.BFI.org It is loosely based on the poem Annie Laurie.", "* Alma Taylor ...  Annie Laurie "]}, {"page": "Two Little Drummer Boys", "response": ["Two Little Drummer Boys is a 1928 British silent comedy film directed by G. B. Samuelson and starring Georgie Wood, Derrick De Marney and Alma Taylor. The film was based on the 1899 play Two Little Drummer Boys by Walter Howard and was shot at Southall Studios. It was produced by a forerunner of Mancunian Films.Wagg p.42-43", "* Alma Taylor as Alma Carsdale"]}, {"page": "Broken in the Wars", "response": ["Broken in the Wars is a 1919 British silent drama film directed by Cecil Hepworth and starring Henry Edwards, Chrissie White and Alma Taylor.BFI.org The Pensions Minister John Hodge appeared in the film to promote the King's Fund, which supported recently demobilised ex-servicemen. The fund had been criticized by veterans' organisations on the grounds that it was a government backed charity providing relief that should have been provided by the state. The film attempts to assure audiences that the King's Fund is not a charity. A cobbler returning from the First World War is persuaded by his aristocratic former employer and the Pensions Minister to receive a grant that will enable him to open his own shop.Bamford p.5-6 It was made by Hepworth Picture Plays. The film is available to view online in the UK via the BFI Player", "* Alma Taylor - Lady Dorothea"]}, {"page": "Merely Mrs. Stubbs", "response": ["Merely Mrs. Stubbs is a 1917 British silent drama film directed by Henry Edwards and starring Edwards, Alma Taylor and Lionelle Howard.", "* Alma Taylor as Edith Dudley"]}, {"page": "Hepworth Pictures", "response": ["Around the time of the First World War, the company gradually switched from traditional short films to the feature films that increasingly dominated the world market.  It also developed many early stars of British cinema, including Alma Taylor, Stewart Rome, Violet Hopson, Chrissie White, Henry Edwards and Gerald Ames."]}, {"page": "Lilacs in the Spring", "response": ["*Alma Taylor as Woman in theater audience"]}, {"page": "The Marriage of William Ashe", "response": ["It was first adapted to film in a 1916 British production directed by Cecil Hepworth and starring Henry Ainley as William Ashe and Alma Taylor as Kitty Bristol.  A 1921 American silent film adaptation was directed by Edward Sloman and featured Wyndham Standing as Ashe and May Allison as Bristol.American Film Institute Catalog - Feature Films 1921-1930, p. 495 (1971)"]}, {"page": "Alf's Button (1920 film)", "response": ["Alf's Button is a 1920 British silent comedy film directed by Cecil Hepworth and starring Leslie Henson, Alma Taylor and Gerald Ames. It was based on the 1920 novel Alf's Button by William Darlington. The film is about a British soldier who discovers a magic coat button which summons a genie to grant his various wishes. It was remade as a sound film in 1930.", "* Alma Taylor as Liz"]}, {"page": "The Old Curiosity Shop (1914 film)", "response": ["The Old Curiosity Shop is a 1914 British silent drama film directed by Thomas Bentley and starring Mai Deacon, Warwick Buckland and Alma Taylor. It was based on the 1841 novel The Old Curiosity Shop by Charles Dickens, and was the first of three film adaptations of the story by Bentley. It was made by the Hepworth Company, the leading British film studio before the First World War.", "* Alma Taylor as Mrs. Quilp"]}, {"page": "Oliver Twist (1912 film)", "response": ["Oliver Twist is a 1912 British silent drama film directed by Thomas Bentley and starring Ivy Millais, Alma Taylor and Harry Royston. It is an adaptation of the 1838 novel Oliver Twist by Charles Dickens. It was the directorial debut of Bentley who went on to become a leading British director. It was the first in a series of Dickens adaptations by Bentley.", "* Alma Taylor as Nancy"]}]}}