{"wiki_id": "http://www.wikidata.org/entity/Q17489718", "itemLabel": "Lindsey Chapman", "itemDescription": "Television Presenter", "wikipedia_url": "https://en.wikipedia.org/wiki/Lindsey_Chapman", "wikipedia_page": {"main": "Lindsey Katherine Chapman is an English television and radio presenter.", "link_mentions": [{"page": "Hugh Fearnley-Whittingstall", "response": ["In August 2015, alongside Lindsey Chapman, he hosted a series of five daily programmes on BBC One, linked to three evening programmes Big Blue Live. The series concentrated on marine wildlife around the UK coast. "]}, {"page": "Matt Baker (presenter)", "response": ["In 2015, Baker co-hosted a three-part factual series Big Blue Live for BBC One. The series focussed on marine wildlife in Monterey Bay, California. He hosted alongside Steve Backshall, Liz Bonnin, Hugh Fearnley-Whittingstall and Lindsey Chapman."]}, {"page": "Robbie Savage", "response": ["In October 2012, along with 463 other players, Savage took part in BBC Radio 5 Live's attempt to set a new Guinness World Record for the 'most players in a continuous 5 a side exhibition match'. This was for BBC Children in Need along with comedian Lloyd Langford and BBC Radio 5 Live travel reporter Lindsey Chapman. Along with Ex-England cricketer Andrew Flintoff, Savage is part of a BBC Radio 5 Live podcast called Flintoff, Savage & The Ping Pong Guy, hosted by former table tennis player Matthew Syed, which discussed current sporting topics."]}, {"page": "Beverley High School", "response": ["*Lindsey Chapman (1995–2002), TV and radio presenter"]}, {"page": "Bobby Tulloch", "response": ["Tulloch started as an apprentice baker with his brother-in-law and remained in the trade until 1964, when after meeting George Waterston of the Royal Society for the Protection of Birds (RSPB), he was appointed as RSPB warden in Shetland. He was especially associated with the snowy owls that started breeding on the island of Fetlar in 1967. He featured in a number of BBC Natural History Unit programmes, including a personal recounting of his discovery of the snow owls nesting on Fetlar, originally broadcast in 1974 on the BBC Radio 4 programme The Living World and rebroadcast by Lindsey Chapman in 2019. (First broadcast in 1974.) (First broadcast in 1974.)"]}, {"page": "BBC Natural History Unit filmography", "response": ["| Big Blue UK || 2015 || Hugh Fearnley-Whittingstall and a team of marine enthusiasts follow the animals arriving and thriving in UK waters.|| Hugh Fearnley-Whittingstall (presenter), Lindsey Chapman (presenter), Richard Taylor-Jones (presenter) || No || No"]}, {"page": "Lloyd Langford", "response": ["In October 2012, along with 463 other players, Langford took part in BBC Radio 5 Live's attempt to set a new Guinness World Record for the ‘most players in a continuous 5 a side exhibition match’. This was for BBC Children in Need along with former footballer and TV pundit Robbie Savage and BBC Radio 5 Live travel reporter Lindsey Chapman."]}, {"page": "List of NFL players with chronic traumatic encephalopathy", "response": ["* Lindsey Chapman"]}, {"page": "California Golden Bears football statistical leaders", "response": ["|||Lindsey Chapman||22|| style=\"font-size:80%;\" |1991 1992 1993", "|||Lindsey Chapman||14||1993", "|||Lindsey Chapman||4||1993 || style=\"font-size:80%;\" |Stanford", "|||Lindsey Chapman||4||1993 || style=\"font-size:80%;\" |Hawaii"]}]}}