{"wiki_id": "http://www.wikidata.org/entity/Q17402693", "itemLabel": "Catherine Belsey", "itemDescription": "British literary critic and academic", "wikipedia_url": "https://en.wikipedia.org/wiki/Catherine_Belsey", "wikipedia_page": {"main": "Catherine Belsey (13 December 1940 – 14 February 2021) was a British literary critic and academic.", "link_mentions": [{"page": "Guilt (emotion)", "response": ["Guilt and its associated causes, advantages, and disadvantages are common themes in psychology and psychiatry. Both in specialized and in ordinary language, guilt is an affective state in which one experiences conflict at having done something that one believes one should not have done (or conversely, having not done something one believes one should have done). It gives rise to a feeling which does not go away easily, driven by 'conscience'. Sigmund Freud described this as the result of a struggle between the ego and the superego – parental imprinting. Freud rejected the role of God as punisher in times of illness or rewarder in time of wellness. While removing one source of guilt from patients, he described another. This was the unconscious force within the individual that contributed to illness, Freud in fact coming to consider \"the obstacle of an unconscious sense of guilt...as the most powerful of all obstacles to recovery.\"Sigmund Freud, On Metapsychology (PFL 11) pp. 390–1 For his later explicator, Lacan, guilt was the inevitable companion of the signifying subject who acknowledged normality in the form of the Symbolic order.Catherine Belsey, Shakespeare in Theory and Practice (2008) p. 25"]}, {"page": "Structuralism", "response": ["A potential problem for a structuralist interpretation is that it can be highly reductive; as scholar Catherine Belsey puts it: \"the structuralist danger of collapsing all difference.\"Belsey, Catherine. 1983. \"Literature, History, Politics.\" Pp. 17–27 in Literature and History 9. An example of such a reading might be if a student concludes the authors of West Side Story did not write anything \"really\" new, because their work has the same structure as Shakespeare's Romeo and Juliet. In both texts a girl and a boy fall in love (a \"formula\" with a symbolic operator between them would be \"Boy + Girl\") despite the fact that they belong to two groups that hate each other (\"Boy's Group - Girl's Group\" or \"Opposing forces\") and conflict is resolved by their deaths. Structuralist readings focus on how the structures of the single text resolve inherent narrative tensions. If a structuralist reading focuses on multiple texts, there must be some way in which those texts unify themselves into a coherent system. The versatility of structuralism is such that a literary critic could make the same claim about a story of two friendly families (\"Boy's Family + Girl's Family\") that arrange a marriage between their children despite the fact that the children hate each other (\"Boy - Girl\") and then the children commit suicide to escape the arranged marriage; the justification is that the second story's structure is an 'inversion' of the first story's structure: the relationship between the values of love and the two pairs of parties involved have been reversed."]}, {"page": "Very Short Introductions", "response": ["| 073 || Poststructuralism || Catherine Belsey ||  || || "]}, {"page": "Arden of Faversham", "response": ["* Catherine Belsey. \"Alice Arden's Crime.\" Staging the Renaissance. Ed. David Scott Kastan and Peter Stallybrass. New York: Routledge, 1991."]}, {"page": "Armada Portrait", "response": ["The queen's hand rests on a globe below a crown (probably not the state crown), \"her fingers covering the Americas, indicating England's [command of the seas] and [dreams of establishing colonies] in the New World\".Hearn, Dynasties, p. 88Andrew Belsey and Catherine Belsey, \"Icons of Divinity: Portraits of Elizabeth I\" in Gent and Llewellyen, Renaissance Bodies, p. 11–35  The queen is flanked by two columns behind, probably a reference to the famous impresa of Charles V, Philip II's father, which represented the Pillars of Hercules.Roy Strong; Art and Power; Renaissance Festivals 1450–1650, p 51, 1984, The Boydell Press;", "Art historians Andrew Belsey and Catherine Belsey have pointed out the striking geometry of the painting, with the repeating patterns of circles and arches described by the crown, the globe, and the sleeves, ruff, and gown worn by the queen. They also contrast the figure of the Virgin Queen wearing the large pearl symbolizing chastity suspended from her bodice and the mermaid carved on the chair of state, which they claim either represent female wiles luring sailors to their doom, or that the mermaid symbolises the executed Queen Mary. Elizabeth is facing away from the mermaid, possibly indicating that their conspiracies and Mary's execution have been put behind my Elizabeth. The crown also symbolises the English monarchy."]}, {"page": "Portraiture of Elizabeth I", "response": ["The queen's hand rests on a globe below the crown of England, \"her fingers covering the Americas, indicating England's [command of the seas] and [dreams of establishing colonies] in the New World\".Hearn 1995, p. 88Andrew Belsey and Catherine Belsey, \"Icons of Divinity: Portraits of Elizabeth I\" in Gent and Llewellyen, Renaissance Bodies, pp. 11–35 The Queen is flanked by two columns behind, probably a reference to the famous impresa of the Holy Roman Emperor, Charles V, Philip II of Spain's father, which represented the pillars of Hercules, gateway to the Atlantic Ocean and the New World.Strong 1984, p. 51"]}, {"page": "Ian Buchanan (philosopher)", "response": ["In 1997 he moved to the Department of English at the University of Tasmania. He remained there until 2002. Then, following a brief stint as a research fellow at the Centre for Comparative Literature and Cultural Studies at Monash University, he moved to Charles Darwin University to take up the foundation chair of communication, later as professor of communication and cultural studies. From 2003—2005 he was the president of the Cultural Studies Association of Australasia. In 2006 he moved to Cardiff University in Wales to take up the chair of critical and cultural theory vacated by Catherine Belsey. In 2011, Buchanan left Cardiff University, where he was based in the Centre for Critical and Cultural Theory."]}, {"page": "Belsey", "response": ["*Catherine Belsey (1940–2021), British literary critic and academic"]}, {"page": "List of Somerville College, Oxford, people", "response": ["*Catherine Belsey (1940–2021), literary critic and academic"]}, {"page": "Deaths in February 2021", "response": ["*Catherine Belsey, 80, British literary critic and academic, stroke.Catherine Belsey obituary"]}, {"page": "2021 in Wales", "response": ["**Catherine Belsey, literary critic and Fellow of the Learned Society of Wales, 80"]}]}}