{"wiki_id": "http://www.wikidata.org/entity/Q17450743", "itemLabel": "Nicholas Sekers", "itemDescription": "Industrialist, arts patron", "wikipedia_url": "https://en.wikipedia.org/wiki/Nicholas_Sekers", "wikipedia_page": {"main": "Sir Nicholas Thomas \"Miki\" Sekers  (born Miklós Szekeres, 12 December 1910  – 23 June 1972) was a British-based industrialist who, with his cousin, founded Sekers Fabrics. He was also a patron of the arts.", "link_mentions": [{"page": "Suzanne Balkanyi", "response": ["One of four daughters of a liberal intellectual Hungarian family, Suzanne Balkanyi was born in Budapest in 1922, and studied at the École Nationale Supérieure des Beaux-Arts, Paris. Her sister, Agota Anna Balkanyi, married the Hungarian-born British industrialist Nicholas Sekers."]}, {"page": "Szekeres", "response": ["* Nicholas Sekers (1910-1972), British industrialist, born Miklós Szekeres"]}, {"page": "Listed buildings in Moresby, Cumbria", "response": ["|Originally a barn, it was converted into a theatre in 1959 for Sir Nicholas Sekers, the interior being designed by Oliver Messel.  The original part is in stone, additions are in brick and timber, most of it is weatherboarded, and the roof is tiled.  The barn forms the auditorium, and the additions form the stage, offices and a bar.  The theatre seats 200 people, and its proscenium arch came from a hotel in Whitehaven."]}, {"page": "David Sekers", "response": ["He was born in 1943, the son of the Hungarian industrialist, Sir Nicholas Sekers, and his wife, Agota."]}, {"page": "Sekers, Nicholas", "response": ["#redirectNicholas Sekers"]}, {"page": "Moran Caplat", "response": ["Caplat was a keen yachtsman, and with war approaching he joined the Royal Navy Volunteer Supplementary Reserve (known unofficially as the \"Yachtsman's Reserve\"). During the Second World War he had a distinguished naval career, ending it as a Lieutenant Commander. In 1943 he married Diana Downton. They had two daughters and two sons, one of whom predeceased his parents.Forbes, Elizabeth. \"Moran Caplet: Commander for more than 30 years of 'the good ship Glyndebourne'\" , The Independent, 25 June 2003 Their daughter Simone married the historian David Sekers, son of the industrialist Nicholas Sekers."]}, {"page": "190-192 Sloane Street", "response": ["The ground floor showrooms were originally occupied by Sekers Fabrics, the British fabric manufacturer founded by Nicholas Sekers."]}, {"page": "Dennis Lennon", "response": ["Lennon designed the interiors at 190-192 Sloane Street, completed in 1965, and originally occupied by Sekers Silks, the British fabric manufacturer founded by Nicholas Sekers. His original interiors have not survived."]}, {"page": "Sekers", "response": ["* Nicholas Sekers (1910–1972), British industrialist"]}, {"page": "Agota Sekers", "response": ["#REDIRECT Nicholas Sekers"]}, {"page": "Miklós Szekeres", "response": ["#REDIRECT Nicholas Sekers"]}]}}