{"wiki_id": "http://www.wikidata.org/entity/Q17489803", "itemLabel": "Nipper Read", "itemDescription": "British police officer", "wikipedia_url": "https://en.wikipedia.org/wiki/Nipper_Read", "wikipedia_page": {"main": "Leonard Ernest \"Nipper\" Read, QPM (31 March 1925 – 7 April 2020) was a British police officer and boxing administrator.", "link_mentions": [{"page": "Kray twins", "response": ["Tony and Chris Lambrianou and Ronnie Bender helped clear up the evidence of this crime, and attempted to assist in the disposal of the body. With McVitie's body being too big to fit in the boot of the car, the body was wrapped in an eiderdown and put in the back seat of a car. Tony Lambrianou drove the car with the body and Chris Lambrianou and Bender followed behind. Crossing the Blackwall tunnel, Chris lost Tony's car and spent up to fifteen minutes looking around Rotherhithe area. They found Tony, outside St Mary's Church, where he had run out of fuel, McVitie's body still inside the car. The body was left in the car and the three gangsters returned home. Bender then went on to phone Charlie Kray informing them that it had been dealt with. When the Krays heard where they had left McVitie's corpse, the twins were livid and desperately phoned Foreman, who was then running a pub in Southwark, to see if he could dispose of the body. With dawn breaking, Foreman found the car, broke into it and drove the body to Newhaven where, with the help of a trawlerman, the body was bound with chicken wire and dumped in the English Channel.Read, Leonard. Nipper Read, The Man Who Nicked The Krays. Time Warner Paperbacks 2001. pp. 291–292.  This event started turning many people against the Krays, and some were prepared to testify to Scotland Yard as to what had happened, fearing that what happened to McVitie could easily happen to them.On Trial for Murder  p. 192", "Eventually, Scotland Yard decided to arrest the Krays on the evidence already collected, in the hope that other witnesses would be forthcoming once the Krays were in custody. On 8 May 1968, the Krays and 15 other members of the Firm were arrested. Exceptional measures were used to stop collusion between the accused. Nipper Read then secretly interviewed each of the arrested and offered each member of the Firm a deal if they testified against the others. Whilst in prison, the Krays had come up with a plan, which included having Scotch Jack Dickson to confess to the murder of Cornell, Ronnie Hart to take the McVitie murder and Albert Donoghue to stand for Mitchell. Donoghue told the twins directly that he was not prepared to be cajoled into pleading guilty, to the anger of the twins. He then informed Read via his mother that he was ready to cooperate. Read set up another secret interview and Donoghue was the first to tell the police everything that he knew."]}, {"page": "Leslie Grantham", "response": ["*The Krays: Dead Man Walking – Nipper Read"]}, {"page": "Leonard \"Nipper\" Read", "response": ["#REDIRECT Nipper Read"]}, {"page": "2020 in the United Kingdom", "response": ["*7 April – Nipper Read, 95, police officer and boxing administrator, COVID-19."]}, {"page": "Deaths in April 2020", "response": ["*Nipper Read, 95, British police officer and boxing administrator, COVID-19.Detective who jailed Kray twins dies 'after contracting coronavirus'"]}, {"page": "List of deaths due to COVID-19", "response": ["! scope=\"row\" | Nipper Read"]}, {"page": "Nipper Reid", "response": ["#redirect Nipper Read"]}, {"page": "Leonard Ernest Read", "response": ["#REDIRECT Nipper Read"]}, {"page": "The Krays: Dead Man Walking", "response": ["* Leslie Grantham as Nipper Read"]}, {"page": "The Krays: New Blood", "response": ["In November 2019, Richard John Taylor announced that due to the success of The Krays: Dead Man Walking, there would be a sequel. It was also announced that many of the cast would reprise their roles, along with several new cast members including Sherrie Hewson and Brian Capron. Late actor Leslie Grantham is to return as Nipper Read via use of archive footage. Although the film has yet to be filmed, it is expected to be released in 2023, although this may get pushed back due to the coronavirus. http://www.movieswithbutter.com/Uncategorized/Director-Richard-John-Taylor-Announces-THE-KRAYS-NEW-BLOOD"]}]}}