{"wiki_id": "http://www.wikidata.org/entity/Q17403014", "itemLabel": "Julie Verhoeven", "itemDescription": "Illustrator, designer, university academic", "wikipedia_url": "https://en.wikipedia.org/wiki/Julie_Verhoeven", "wikipedia_page": {"main": "Julie Verhoeven (born 16 May 1969) is a British illustrator and designer who has collaborated with brands such as Louis Vuitton, Versace and Peter Jensen. While she is recognised primarily for her work in fashion, she has also contributed illustrations to books, magazines and album covers. Her work has been widely exhibited, including at London's Hayward Gallery. She is a design academic at both Central Saint Martins and the Royal College of Art.\nWith recurring retro references – particularly to the 1970s and pop culture – her illustrations have been described as \"whimsical\" and \"Rock & Roll meets rainbow\". The Institute of Contemporary Arts (ICA) noted that: \"Her drawings, sculptures, assemblages, installations and video combine a rawness, at times reminiscent of punk, with a bewildering sensuality and a strong sense of colour and texture\".In a 2008 interview, she said: \"For the moment I am doing artist/designer... I would like to be regarded as an artist eventually\". In 2012, the Victoria & Albert Museum (V&A) acquired a large archive of her work (over 100 illustrations) for its permanent collection.\n\n", "link_mentions": [{"page": "Kent Institute of Art & Design", "response": ["* Julie Verhoeven, illustrator/artist and fashion designer"]}, {"page": "List of fashion designers", "response": ["* Julie Verhoeven"]}, {"page": "Maximalism", "response": ["Charlotte Rivers describes how \"maximalism celebrates richness and excess in graphic design\", characterized by decoration, sensuality, luxury and fantasy, citing examples from the work of illustrator Kam Tang and artist Julie Verhoeven.Rivers, Charlotte (2008). Maximalism: The Graphic Design of Decadence& Excess, p. 11. ."]}, {"page": "Verhoeven", "response": ["*Julie Verhoeven (born 1969), British illustrator and designer"]}, {"page": "Empire (Kasabian album)", "response": ["* Julie Verhoeven – illustrations"]}, {"page": "Fashion illustration", "response": ["* Julie Verhoeven (1969-)"]}, {"page": "Julie (given name)", "response": ["* Julie Verhoeven (born 1969), British illustrator and designer"]}, {"page": "Peter Jensen (fashion designer)", "response": ["Julie & Peter - A fur wall. An art exhibition with Julie Verhoeven", "AW 17-18 'Greatest hits' Womenswear collection. Items from over the last 10 years, including drawings of all the past muses by English artist Julie Verhoeven."]}, {"page": "Ben Moore (curator)", "response": ["Moore founded Art Below in 2006 to present contemporary art on space traditionally used for advertising in London Underground stations,\"The ArtLyst Power 100: 2013 Alternative Art Power List Unveiled,\" artlyst.com, 23 October 2013.Daisy Wyatt, \"Art Wars: Damien Hirst and Yinka Shonibare give Stormtrooper helmets a makeover,\" The Independent, 8 October 2013. debuting as an exhibition of 20 artists across 20 stations, staged by Moore and his younger brother, Simon Moore. The collective has since grown into an annual display showcasing established and emerging artists, and has collaborated with charities, universities, government and art organisations, with an aim to display progressive and provocative artwork.Konahrtist, \"Art Below by Ben Moore,\"  Empty Kingdom, 24 January 2011.Pippa Irvine, \"Interview with Art Below’s Ben Moore,\"  fadwebsite.com, 26 April 2010. For a fee, it allows artists to display their artwork on billboard space in the Underground, in line with Moore's belief that people should have the right to display their work in public. Moore has curated and produced exhibits for Art Below in London, Berlin, Tokyo, Los Angeles and New Orleans.\"Art Below to Unveil London Peace Plinth in Los Angeles,\"  fadwebsite.com, 5 April 2012. Art Below exhibits have included works by Banksy, Alison Jackson, Charles Bronson, Ben Eine, Antony Micallef, Mat Collishaw, Julie Umerle, Sarah Maple, Johan Andersson, Polly Morgan, Billy Childish, and Julie Verhoeven.Angus Montgomery, \"The Peace Project,\" Design Week, 28 September 2012.ArtLyst. 'Art of Angel Launches For London Art Fair Week'.09-01-2012. Retrieved 5 July 2014.BBC News. 'Charles Bronson artwork on London Underground'. 28-04-2010. Retrieved 9 August 2018."]}, {"page": "Clements Ribeiro", "response": ["In 2000, Clements and Ribeiro became joint creative directors for French fashion house Cacharel. The seven-year association received critical acclaim and saw Cacharel expand its distribution and collaborate with names such as Celia Birtwell, Peter Saville and Julie Verhoeven. They left Cacharel in summer 2007 and focused on relaunching Clements Ribeiro."]}, {"page": "Ravi Thornton", "response": ["Late 1990s – 2010. Thornton wrote several short stories in British urban underground illustration, graffiti, and writing magazine The Illustrated Ape, including The Lion & The Mistress and The Man With His Heart In His C*ck illustrated by Yuko Kondo and Julie Verhoeven respectively."]}, {"page": "Blackface in contemporary art", "response": ["*Julie Verhoeven's 2015 solo exhibition 'Whiskers Between My Legs' at the Institute of Contemporary Arts, London featured a video work of the same title where a blonde woman appears briefly in blackface. A promotional video for the same exhibition, titled \"Julie Verhoeven's Golden Nuggets\", was distributed via the ICA's YouTube channel and also features the artist in apparent blackface."]}, {"page": "Simon Holloway", "response": ["Holloway’s fashion career began in Paris in the 1990s, where he interned at Chloé for current Chanel designer Virginie Viard. Then, he moved to the United States in 1994, when he began designing menswear for the Australian-born, L.A.-based Richard Tyler. Julie Verhoeven, whom he hired at Richard Tyler, remembered the period like a fever dream: It was “highly charged—extensive collections, travel, fashion shows, fittings and late nights.” A subsequent tenure for Holloway in New York for Narciso Rodriguez was followed by a time with Ralph Lauren, with whom he worked closely on the womenswear collection from 2004 to 2007."]}]}}