{"wiki_id": "http://www.wikidata.org/entity/Q17403688", "itemLabel": "Muriel Pemberton", "itemDescription": "fashion designer, painter and academic", "wikipedia_url": "https://en.wikipedia.org/wiki/Muriel_Pemberton", "wikipedia_page": {"main": "Muriel Alice Pemberton RWS (8 September 1909 – 30 July 1993) was a British fashion designer, painter and academic.According to The Independent, she \"invented art-school training in fashion in Britain\".", "link_mentions": [{"page": "Tunstall, Staffordshire", "response": ["* Muriel Pemberton (1909-1993), fashion designer, painter and academic, born in Tunstall"]}, {"page": "John Russell Taylor", "response": ["Having developed a friendship with Alfred Hitchcock during the 1970s, he became Hitchcock's authorised biographer.John Russell Taylor. Hitch: The Life and Times of Alfred Hitchcock, Pantheon Books, 1978, dust jacket, . In 1978, after publishing Hitch, Taylor returned to the UK, becoming the art critic for The Times, a post that he held until 2005. His other books since 1978 include Strangers in Paradise: The Hollywood Emigres 1933–1950 (1983), and bio-critical studies of Ingrid Bergman (1983), Alec Guinness (1984), Vivien Leigh (1984), Orson Welles (1986), Elizabeth Taylor (1991), film historian John Kobal (2008) and the artists Edward Wolfe (1986), Peter Samuelson (1987), Robin Tanner (1989), Bernard Meninsky (1990), John Copley (1990), Muriel Pemberton (1993), Ricardo Cinalli (1993), Claude Monet (1995), Bill Jacklin (1997), Cyril Mann (1997), Peter Coker (2002), Zsuzsi Roboz (2005), Peter Prendergast (2006), Panayiotis Kalorkoti (2007), Carl Laubin (2007), Philip Sutton (2008), Kurt Jackson (2010), Philip Hicks (2013) and Paul Day (2016). More general books on art include Impressionist Dreams (1990) and Exactitude: Hyperrealist Art Today (2009)."]}, {"page": "Burslem School of Art", "response": ["* Muriel Pemberton, who \"invented art-school training in fashion in Britain\""]}, {"page": "Janey Ironside", "response": ["In 1956, at Robin Darwin's urging, Ironside was appointed as the Royal College of Art's professor of fashion, a post she was to hold until 1968. She replaced Madge Garland, whose assistant she had once been, in the post.Last-Year Reads: Janey Last-Year Girl, 2012. Retrieved 23 July 2014. The appointment came just as British fashion was about to enter its \"youthquake\" phase. According to Elizabeth Wilson, Ironside attributed this phenomenon to a combination of British eccentricity and the Welfare State and educational grants which allowed people with talent that would once have been wasted to go to college. Angela McRobbie described Ironside, along with Muriel Pemberton, as the key figures in enabling fashion to attain academic respectability in Britain."]}, {"page": "Muriel Rowe", "response": ["#REDIRECT Muriel Pemberton"]}, {"page": "List of alumni of the Royal College of Art", "response": ["* Muriel Pemberton"]}]}}