{"wiki_id": "http://www.wikidata.org/entity/Q17465726", "itemLabel": "Benjamin Bloom", "itemDescription": "musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Benjamin_Bloom_(musician)", "wikipedia_page": {"main": "Benjamin Bloom (born Benjamin David Groom; 23 August 1982) is a pianist, singer and songwriter from Ipswich, Suffolk, England, and is a former member of the band Rosalita. He also is known for his football-based YouTube channel where he does match reviews and podcasts.", "link_mentions": [{"page": "Benjamin Bloom", "response": ["Benjamin Bloom conducted research on student achievement. Through conducting a variety of studies, Bloom and his colleagues observed factors within the school environment as well as outside of it that can affect how children can learn. One example was the lack of variation in teaching. Bloom hypothesized if teachers adapted their teaching methods to the individual needs of each student, more children would receive the opportunity to learn better. This led to the creation of Bloom’s Mastery Learning procedure. This procedure required that teachers organize skills and concepts into instructional units approximately 1-2 weeks in length. At the end of the unit, the student would receive an assessment that would provide the student with constructive feedback on what the child learned from the unit. If a child lacked understanding on any of the major concepts of the unit, they would be assigned corrective assignments based on information they had trouble understanding. They would then take a second assessment focusing specifically on the skills and concepts they were instructed to practice on. This insures each student gains individualized instruction at a pace the child needs in order to learn at an optimum level. For students who showed mastery of the given unit, it is recommended they receive enrichment activities to further learning experiences. These activities are self-selected by the student and may come in the form of academic games, reports, special projects, etc.", "* Eisner, Eliot W. \"Benjamin Bloom: 1913-1999.\" Prospects, the quarterly review of comparative education (Paris, UNESCO: International Bureau of Education), vol. XXX, no. 3, September 2000. Retrieved from http://www.ibe.unesco.org/publications/ThinkersPdf/bloome.pdf on April 10, 2009.", "* Benjamin Bloom - Mastery Learning"]}, {"page": "Rosalita (band)", "response": ["September 2009 marked the debut performances of Kris Andrew's new band Jackknife Horsebox; former Rosalita guitar player Richard Tyler joined the fold immediately after the breakup of their old band. John Randell and Jay Goodrich joined with some old friends to form new collective The B.Goodes. Ben Groom has embarked upon a solo career under the pseudonym Benjamin Bloom. Since 2012, Jay Goodrich has played bass for Benjamin Bloom. All three acts show a significant departure in sound and genre when compared to Rosalita."]}, {"page": "Bloom (surname)", "response": ["* Benjamin Bloom (1913–1999), American educator", "* Benjamin Bloom (musician) (born 1982), English musician"]}]}}