{"wiki_id": "http://www.wikidata.org/entity/Q1749799", "itemLabel": "Edward William Barton-Wright", "itemDescription": "British businessman", "wikipedia_url": "https://en.wikipedia.org/wiki/Edward_William_Barton-Wright", "wikipedia_page": {"main": "Edward William Barton-Wright CE, FRSA, MJS (member of the Japan Society) (8 November 1860 – 13 September 1951) was an English entrepreneur specialising in both self defence training and physical therapy. He is remembered today as one of the first Europeans to both learn and teach Japanese martial arts and as a pioneer of the concept of hybrid martial arts.", "link_mentions": [{"page": "Martial arts", "response": ["Western interest in Asian martial arts arises towards the end of the 19th century, due to the increase in trade between the United States with China and Japan. Relatively few Westerners actually practiced the arts, considering it to be mere performance. Edward William Barton-Wright, a railway engineer who had studied jujutsu while working in Japan between 1894 and 1897, was the first man known to have taught Asian martial arts in Europe. He also founded an eclectic style named Bartitsu which combined jujutsu, judo, wrestling, boxing, savate and stick fighting."]}, {"page": "Mixed martial arts", "response": ["Another early example of mixed martial arts was Bartitsu, which Edward William Barton-Wright founded in London in 1899. Combining catch wrestling, judo, boxing, savate, jujutsu and canne de combat (French stick fighting), Bartitsu was the first martial art known to have combined Asian and European fighting styles, and which saw MMA-style contests throughout England, pitting European Catch wrestlers and Japanese Judoka champions against representatives of various European wrestling styles."]}, {"page": "Historical European martial arts", "response": ["Since the 1990s, there have emerged flourishing Historical European Martial Arts communities in Europe, North America, Australia and the wider English-speaking world. These groups are engaged in attempting to reconstruct Historical European Martial Arts using various training methods. Although the focus generally is on the martial arts of Medieval and Renaissance masters, nineteenth and early twentieth century martial arts teachers are also studied and their systems are reconstructed, including Edward William Barton-Wright, the founder of Bartitsu; combat savate and stick fighting master Pierre Vigny; London-based boxer and fencer Rowland George Allanson-Winn; French journalist and self-defence enthusiast Jean Joseph-Renaud; and British quarterstaff expert Thomas McCarthy."]}, {"page": "Gunji Koizumi", "response": ["* Edward William Barton-Wright"]}, {"page": "William Barton Wright", "response": ["Barton Wright married Janet Forlonge in 1858, whilst on leave in England. She was the daughter of William Forlonge, a pastoralist and politician in colonial Victoria and New South Wales, and grand-daughter of the Australian pioneer breeder of Merino sheep, Eliza Forlonge. They had six sons and three daughters. His third son Edward William Barton-Wright was a pioneering promoter of Asian martial arts in the Western world: see Bartitsu. His sister, Lydia, married Sir Molyneux Nepean, 2nd Baronet, of Mapperton House, of Loder’s Court, of Bothenhampton, Dorset, and of Lee Hall, Northumberland."]}, {"page": "Bartitsu", "response": ["In 1898, Edward William Barton-Wright, an English engineer who had spent the previous three years living in Japan, returned to England and announced the formation of a \"New Art of Self Defence\". This art, he claimed, combined the best elements of a range of fighting styles into a unified whole, which he had named Bartitsu. Barton-Wright had previously also studied \"boxing, wrestling, fencing, savate and the use of the stiletto under recognised masters\", reportedly testing his skills by \"engaging toughs (street fighters) until (he) was satisfied in their application.\" He defined Bartitsu (ばちつ) as meaning \"self defence in all its forms\"; the word was a portmanteau of his own surname and of \"Jujitsu\"."]}, {"page": "List of English inventions and discoveries", "response": ["* 1899: Mixed martial art (MMA) Bartitsu invented by Edward William Barton-Wright (1860–1951)."]}, {"page": "E. W. Barton-Wright", "response": ["#REDIRECT Edward William Barton-Wright"]}, {"page": "Will Thomas (novelist)", "response": ["Will Thomas, born 1958 in Bucks County, Pennsylvania, is a novelist who writes a Victorian mystery series featuring Cyrus Barker, a Scottish detective or \"private enquiry agent,\" and his Welsh assistant, Thomas Llewelyn.  The Barker/Llewelyn novels are set in the 1880s and often feature historical events, people, and movements.  Martial combat is a recurring theme throughout this hardboiled series.  In interviews, Thomas has said that Barker is based on men such as Richard Francis Burton and Edward William Barton-Wright, founder of Bartitsu."]}, {"page": "Yukio Tani", "response": ["The precise details of Tani's early jujutsu training in Japan are unclear, but he is known to have studied at the Fusen-ryu dojo, as Yukio's father and grandfather were friends with Fusen-ryu master Mataemon Tanabe. He also trained in Yataro Handa's jujutsu school in Osaka. In 1900, the nineteen-year old Yukio, his brother Kaneo and a fellow jujutsuka Seizo Yamamoto travelled to London by invitation of Edward William Barton-Wright, the founder of Bartitsu.The Original BJJ: New Discoveries and Speculations re. the Submission Grappling of British Jiu-Jitsu His brother and Yamamoto soon returned to Japan, but Yukio stayed in London and began appearing at music halls, giving demonstrations of jujutsu and placing challenges to all comers. Tani and Uyenishi were also employed as jujutsu instructors at Barton Wright's \"Bartitsu School of Arms and Physical Culture\" at 67b Shaftesbury Avenue in London's Soho district."]}, {"page": "Pierre Vigny", "response": ["In 1886, Vigny joined the Second Regiment of French Artillery at Grenoble. Leaving the army in 1898, he founded a school of arms and self defence in Geneva and then moved to London, where he became the chief instructor of the Bartitsu Club operated by Edward William Barton-Wright. Around this time, Vigny also established a tradition of annual exhibitions of combat sports and self defence skills."]}]}}