{"wiki_id": "http://www.wikidata.org/entity/Q17415327", "itemLabel": "Dorothy Ward", "itemDescription": "Pantomime and theatre actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Dorothy_Ward", "wikipedia_page": {"main": "Dorothy Ward (26 April 1890 – 30 March 1987) was an English actress who specialised in pantomimes, playing the principal boy roles, while her husband Shaun Glenville would play the dame roles. She had a successful 52 year career and played in over 40 pantomimes between 1905 and 1957.", "link_mentions": [{"page": "Pamela Colman Smith", "response": ["In 1903, Smith launched her own magazine under the title The Green Sheaf, with contributions by Yeats, Christopher St John (Christabel Marshall), Cecil French, A. E. (George William Russell), Gordon Craig (Ellen Terry's son), Dorothy Ward, John Todhunter, and others. The Green Sheaf  survived for a little over a year, a total of 13 issues."]}, {"page": "Fred Barnes (performer)", "response": ["Barnes was born at 219 Great Lister Street, Saltley, Birmingham, England.  The son of a butcher, Barnes became interested in performing as a result of going to see Vesta Tilley in 1895.  Encouraged by the popular pantomime performer Dorothy Ward,Richard Anthony Baker, British Music Hall: an illustrated history, Pen & Sword, 2014, , pp.125-127 he made his debut at the Gaiety Theatre, Birmingham in March 1906, and gave his first notable performance playing the Duke of Solihull in Cinderella at the Alexandra Theatre, Birmingham, the same year.  It was while starring in the pantomime that Barnes acquired his first agent and attracted the attention of another Birmingham-born music hall artist, George Lashwood, who, in Fred's own words, 'took me in hand... [placed] at my disposal, free and unasked, the lessons of his long and brilliant career'.Tomes, Jason. \"Barnes, Frederick Jester (1885–1938)\", Oxford Dictionary of National Biography, Oxford University Press, 2004, online edition, January 2011, accessed 12 June 2012 "]}, {"page": "Principal boy", "response": ["*Dorothy Ward"]}, {"page": "Pantomime dame", "response": ["*Shaun Glenville – (1884–1968), had a 50 year career in pantomime, often opposite his wife Dorothy Ward."]}, {"page": "I'm Forever Blowing Bubbles", "response": ["The song also became a hit with the public in British music halls and theatres during the early 1920s. Dorothy Ward was especially renowned for making the song famous with her appearances at these venues. The song was also used by English comedian \"Professor\" Jimmy Edwards as his signature tune—played on the trombone. Harpo Marx would play the song on clarinet, which would then begin emitting bubbles. The melody is quoted in the 1920s song \"Singing in the Bathtub\", and has frequently been used in animated cartoon sound tracks when bubbles are visible; it is also repeatedly sung by Tweety Bird."]}, {"page": "Tom Jones (Edward German)", "response": ["*Etoff, her Maid (non-speaking) – Dorothy Ward"]}, {"page": "Peter Glenville", "response": ["Born in Hampstead, London, into a theatrical family, Glenville was the son of Shaun Glenville (born John Browne, 1884–1968), an Irish-born comedian, and Dorothy Ward, both pantomime performers.Profile of Glenville's parents, John and Dorothy (née Ward) Browne. its-behind-you.com"]}, {"page": "Peelennium", "response": ["| Dorothy Ward"]}, {"page": "The Whirl of New York", "response": ["thumb|upright|Dorothy Ward, who played the role of  Cora Angélique in the premiere of The Whirl of New York.", "*Dorothy Ward (Cora Angélique)"]}, {"page": "Fred Godfrey", "response": ["Godfrey could write and arrange music as well as write lyrics. He also play the piano. He began selling songs around 1906, with his first success a year later, when he teamed up with lyricist Harry Castling to produce two songs, which Billy Williams (no relation) later recorded successfully. From 1911 until 1915, nearly every one of Williams' songs was composed by Godfrey. He also wrote songs for Florrie Forde, Mark Sheridan, Dorothy Ward, Shaun Glenville, Ella Retford and Vesta Victoria. Godfrey was only paid a few guineas for each song, a common occurrence at the time. Godfrey was not business minded and generally sold his songs outright (as was usual at the time), rather than receiving royalties.", "During World War I, he gained a reputation as a writer of war songs. His song \"Take Me Back to Dear Old Blighty\" was recorded by Dorothy Ward in 1916 and quickly became a hit.  On 26 January 1917 he was conscripted into the Royal Naval Air Service. He was transferred to the Royal Air Force in 1918, who released him from service to continue songwriting. In 1917, while he was away in the RNAS, \"Down Texas Way\", a song he had written the year, before was published and become a success. He is also credited with writing the lyric for \"Bless 'Em All\" in 1917. "]}, {"page": "List of Desert Island Discs episodes (1951–1960)", "response": ["|||Dorothy Ward||No book||A make-up box"]}, {"page": "Pardon My Pups", "response": ["*Dorothy Ward as Phyllis"]}, {"page": "The Flying Fool (1929 film)", "response": ["* Dorothy Ward as Mae Hopper"]}, {"page": "Mary Concepta Lynch", "response": ["To commemorate the end of the First World War, a small oratory was built at the convent, to house a statue sent in recognition of the men of the area who died in Belgium. The oratory was dedicated to the Sacred Heart in 1919. Beginning the next year, in 1920, Lynch first worked on the wall behind the statue, which stood above the altar, to provide a proper setting, in a Eastern Christian or Byzantine medieval style, and on the Gaelic script over the entrance door. After that she sought and was given permission to take on the whole interior of the oratory. The project was supported by her cousin Shaun Glenville and his wife Dorothy Ward who would regularly visit the convent. The couple were music hall entertainers, famous in their role as Pantomime dame and Principal boy, and raised funds for the oratory through benefit concerts. The studio of Joshua Clarke & Sons, father of Harry Clarke, created the seven stained-glass windows. One window is dedicated to her father, Thomas J. Lynch, represented by the Holy Family and another to Shaun Glenville and his family."]}, {"page": "Dandini (character)", "response": ["*Dorothy Ward"]}, {"page": "Prince's Theatre, Bristol", "response": ["*1914-15 –  Humpty Dumpty – Dorothy Ward and Shaun Glenville          "]}, {"page": "Shaun Glenville", "response": ["Shaun Glenville (born John Browne; 16 May 1884 – 28 December 1968) was an Irish actor who specialised in pantomime performances - he would play the dame while his wife Dorothy Ward would play the principal boy. The music hall historian Christopher Pulling called him one of the 'grand comedians of the music-halls'.Christopher Pulling, They Were Singing (And What They Sang About), (London: George G. Harrap, 1952), p. 52 He had a successful 62-year career and played in over 40 pantomimes.", "For a period Glenville was with the company of Fred Karno, and by 1909 he was appearing in pantomimes across Britain. In 1910 he was playing the Dame in the pantomime Little Jack Horner at Newcastle in which the principal boy was played by Dorothy Ward. The two were to marry on 13 May 1911 in a registry office.England & Wales, Civil Registration Marriage Index, 1837-1915 for Dorothy Ward (1911( - Ancestry.com  After Dorothy converted to Catholicism they held a Catholic marriage ceremony in Dublin the following year. Their son was the actor and director Peter Glenville (1913–1996). As a couple they had a long and successful career in pantomime, Ward as one of the leading principal boys and Glenville as 'a pantomime Dame without equal'.W. MacQueen-Pope, The Melodies Linger On: The Story of Music Hall, (London: W.H. Allen, 1950), p. 340 For 50 years they played mother and son.", "His stage appearances included: The Gay Lothario (1913); After The Girl and The Light Blues at the Gaiety Theatre, London (1914); the pantomime Humpty Dumpty with his wife Dorothy Ward at the Prince's Theatre, Bristol (1914–15); Razzle Dazzle at the Theatre Royal, Drury Lane (1916); tour of  Happy Go Lucky with Dorothy Ward (1918); Sergeant O’Toole in Quality Street at the Shubert Theatre and Doc Sniffkins in The Whirl of New York at the Winter Garden Theatre in New York (1921);Roles of Shaun Glenville - Playbill The American critic Dorothy Parker was savage in her criticism of Ward's performance in Quality Street - and Glenville fared little better, with Parker writing: 'They have also imported a comedian named Shaun Glenville to add a touch of humor to the proceedings. It is better to say nothing of Mr. Glenville's methods of comedy. One cannot speak of these whiffs of the dead past without breaking down'.Dorothy Parker, Dorothy Parker: Complete Broadway, 1918–1923, iUniverse LLC (2014) - Google Books p. 224"]}, {"page": "Chiswick Empire", "response": ["For the Christmas season each year the Empire put on a popular pantomime, with George Formby appearing in that for 1915 while the popular entertainers Dorothy Ward and Shaun Glenville appeared there in Jack and the Beanstalk in 1949. Alma Cogan was in the 1955 pantomime Aladdin and His Wonderful Lamp. In 1915 the Empire also saw Gladys Cooper, Marie Lloyd and Vesta Tilley. In January 1917 Clara Butt appeared in a number of charity matinees and Queen Alexandra attended a concert in aid of the Chiswick Memorial Homes."]}, {"page": "History of transgender people in the United Kingdom", "response": ["*1906 - Gwen Lally begins performing in London, and the duo Dorothy Ward and Shaun Glenville begin with Ward as principal boy playing Prince Charming"]}]}}