{"wiki_id": "http://www.wikidata.org/entity/Q174473", "itemLabel": "Rachel Podger", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Rachel_Podger", "wikipedia_page": {"main": "Rachel Podger (born 1968 in England) is a British violinist and conductor specialising in the performance of Baroque music.", "link_mentions": [{"page": "Guildhall School of Music and Drama", "response": ["*Rachel Podger (born 1968), violinist"]}, {"page": "The Four Seasons (Vivaldi)", "response": ["Surround sound versions of the piece have been issued on Super Audio CD by Richard Tognetti, Pinchas Zukerman, Jonathan Carney and Rachel Podger."]}, {"page": "Brecon", "response": ["October sees the annual 4-day weekend Brecon Baroque Music Festival, organised by leading violinist Rachel Podger."]}, {"page": "The Art of Fugue", "response": ["*Rachel Podger with Brecon Baroque (2017)"]}, {"page": "Trevor Pinnock", "response": ["*J. S. Bach: sonatas for violin and harpsichord BWV 1014–1019 with Rachel Podger (violin) and BWV 1019a and the sonatas for violin and continuo BWV 1021, 1023 with the addition of Jonathan Manson (viola da gamba), Channel Classics (2000)", "*Rameau: Pièces de Clavecin en Concerts with Rachel Podger and Jonathan Manson, Channel Classics (2002)"]}, {"page": "Gramophone Classical Music Awards", "response": ["*Artist of the Year: Rachel Podger", "*Baroque Instrumental – Biber Rosary Sonatas, Rachel Podger (violin) with Jonathan Manson (cello), (viol), David Miller (archlute), Marcin Swiatkiewicz (harps), (organ)", "*Concerto – Antonio Vivaldi, Violin Concertos, Op 4, La Stravaganza, Arte dei Suonatori, Rachel Podger Channel Classics CCS19598)"]}, {"page": "List of early music ensembles", "response": ["* Brecon Baroque (Rachel Podger): baroque orchestra", "* Palladian Ensemble, British instrumental ensemble (co-founded by Rachel Podger)"]}, {"page": "The English Concert", "response": ["*Rachel Podger – leader 1997–2002*Concert review from 1999 , Rachel Podger was leader and concerto soloist"]}, {"page": "Sonatas and Partitas for Solo Violin (Bach)", "response": ["*Rachel Podger, 1997–1999"]}, {"page": "Musica Viva", "response": ["* The 2017 Season featured Orchestra of the Age of Enlightenment with violinist Rachel Podger, Eighth Blackbird, Pacifica Quartet, Sitkovetsky Trio, Takács Quartet, Angela Hewitt, and piano-cello duo Nicolas Altstaedt and Aleksandar Madžar."]}, {"page": "The Harp Consort", "response": ["*Spanish Gypsies: Celtic and Spanish music in Shakespeare's England. Music by John Playford, Tobias Hume, Giles Farnaby, and others. Hille Perl (viola da gamba, lira viol, baroque guitar), Rachel Podger (baroque violin), Nancy Hadden (renaissance flute), Keith McGowan (shawm); and Steve Player (baroque guitar, gittern, bagpipes), Lee Santana (cittern, theorbo, baroque guitar), Michael Metzler (percussion), directed by Andrew Lawrence-King (harp, triple harp, Irish harp, Spanish harp, psaltery). BMG Ariola Classics DHM 05472 77516 2 (1999)."]}, {"page": "Pièces de clavecin en concerts", "response": ["*Channel Records, Trevor Pinnock (harpsichord), Rachel Podger (violin), Jonathan Manson (cello)"]}, {"page": "La stravaganza", "response": ["* Vivaldi, La Stravaganza, Rachel Podger (Violin), Channel Classics, 2003, CCS SA 19503. This recording won the Gramophone Award for Best Baroque Recording of 2003."]}, {"page": "European Union Baroque Orchestra", "response": ["The orchestra is completely renewed every year. Auditions take place in spring, with usually around 100 young baroque musicians applying for the 20–25 places in the ensemble. The successful applicants then come together for concert tours which take the talented young orchestra to all corners of Europe. Members of EUBO gain performing experience, working together under the inspirational leadership of Music Director Lars Ulrik Mortensen and some of the world's finest baroque musicians. Ton Koopman, Margaret Faultless, Roy Goodman, Enrico Onofri, Rachel Podger, Paul Agnew, Gottfried von der Goltz, Alfredo Bernardini, Sergio Azzolini and Amandine Beyer are amongst the artists who regularly work with EUBO."]}, {"page": "York Early Music Festival", "response": ["*Rachel Podger"]}, {"page": "Theatr Brycheiniog", "response": ["The theatre's patron is Rachel Podger; the late Michael Bogdanov was also patron prior to his death."]}, {"page": "List of contemporary classical violinists", "response": ["* Rachel Podger (born 1968)"]}, {"page": "Diapason d'Or", "response": ["* Rachel Podger; Mozart: Sonates pour violon et clavier, Vol. VII et VIII. Gary Cooper (pianoforte and clavecin). Channel Classics CCSSA28109"]}, {"page": "Podger", "response": ["* Rachel Podger (born 1968), English violinist"]}, {"page": "Gary Cooper (musician)", "response": ["Cooper made his Wigmore Hall solo recital debut on 1 December 2000 with a performance of Bach's complete Well-Tempered Clavier,Crankshaw (March 2001) and has frequently appeared as a recitalist both in the UK and in Europe. Several of his performances have been broadcast on BBC Radio 3, including his 22 November 2004 recital at the Cosmo Rodewald Concert Hall in ManchesterBBC Radio 3 (19 December 2004) and his 29 January 2006 Wigmore Hall performance of Mozart's sonatas for piano and violin with violinist Rachel Podger, broadcast live as part of the European Broadcasting Union's Mozart Day.BBC Radio 3 (29 January 2006)", "*Mozart: Sonatas for Keyboard & Violin – Gary Cooper (fortepiano), Rachel Podger (violin). Label: Channel Classics (in 8 volumes).  "]}, {"page": "List of SACD artists", "response": ["*Rachel Podger"]}, {"page": "List of people associated with the Royal Academy of Music", "response": ["* Rachel Podger (2005)"]}, {"page": "Royal Academy of Music Bach Prize", "response": ["* 2015: Rachel Podger"]}, {"page": "The Art of Fugue discography", "response": ["| Rachel Podger and Brecon Baroque || 2015 || || string quartet/harpsichord and various such instrumental combinations"]}, {"page": "The Night Shift (concert)", "response": ["Ticket prices are kept low, typically £8 in advance, £12 on the door and £4 for students. To date there have been over 7500 attendances at Night Shift events, with a peak audience of 1,200 at The Roundhouse on 29 January 2010, where Vladimir Jurowski conducted Beethoven’s Coriolan Overture and Symphony No. 7. The one-hour concert was presented by Alistair Appleton, accompanied by live video projections. Other artists to have appeared at The Night Shift include Robin Ticciati, Marin Alsop, Rachel Podger, Edward Gardner, Christian Tetzlaff, Eduardo Portal, Stephen Hough and Yannick Nézet-Séguin."]}, {"page": "Johannes Pramsohler", "response": ["Johannes Pramsohler was born 5 April 1980 in Sterzing in the autonomous Italian province of South Tyrol and studied at the Conservatorio Claudio Monteverdi in Bolzano, at the Paris Conservatoire CRR, at the Mozarteum Salzburg, at the Guildhall School of Music and Drama  and at the Royal Academy of Music in London. His main teachers were Georg Egger, Jack Glickman, Rachel Podger and Reinhard Goebel. Already during his studies he played with many of the leading period instrument orchestras such as Concerto Köln, the Orchestra of the Age of Enlightenment, Les Arts Florissants and the Academy of Ancient Music. As part of his career development he was member of the 2007 European Union Baroque Orchestra."]}, {"page": "Channel Classics Records", "response": ["Channel Classics Records released music from musicians like Iván Fischer and the Budapest Festival Orchestra, Dejan Lazić, Lavinia Meijer, Rachel Podger and Candida Thompson."]}, {"page": "East Cork Early Music Festival", "response": ["A number of Irish and international performers have appeared at the festival, including Emma Kirkby, Rachel Podger, Barthold and Wieland Kuijken, James Bowman, Rachel Brown, the Irish Baroque Orchestra, and Bob van Asperen."]}, {"page": "Six Sonatas for Violin and Harpsichord, BWV 1014–1019", "response": ["*Rachel Podger, Trevor Pinnock (harpsichord), Channel, 2002."]}, {"page": "2016 in classical music", "response": ["* Baroque Instrumental: Biber – Rosary Sonatas; Rachel Podger, Jonathan Manson, David Miller, Marcin Swiatkiewicz (Channel Classics)"]}, {"page": "2018 in classical music", "response": ["* Artist of the Year: Rachel Podger"]}, {"page": "Harpsichord Concerto in A major, BWV 1055", "response": ["* Rachel Podger, Brecon Baroque; 2010; Channel Classics CCS SA 30910"]}, {"page": "The Early Music Shop", "response": ["Indeed, Salts Mill has been used to host many Early Music Concerts since the business' move to Saltaire, such as a concert and workshop led by renowned early musicians Rachel Podger and Pamela Thorby, performances by Leeds Baroque Choir & Orchestra, and on regular occasions concerts led by Red Priest, a British Baroque instrumental band."]}, {"page": "Micaela Comberti", "response": ["The Micaela Comberti Chair for Baroque Violin at the Royal Academy of Music was established in September 2008 and is currently led by one of Comberti's pupils, Rachel Podger. The conservatoire also awards the Mica Comberti Prize on a yearly basis \"for the performance of any complete work by JS Bach for violin, viola or viola da gamba.\""]}]}}