{"wiki_id": "http://www.wikidata.org/entity/Q17426182", "itemLabel": "Lis Rhodes", "itemDescription": "British filmmaker", "wikipedia_url": "https://en.wikipedia.org/wiki/Lis_Rhodes", "wikipedia_page": {"main": "Lis Rhodes (born 1942) is a British artist and feminist filmmaker, known for her density, concentration, and poeticism in her visual works. She has been active in the UK since the early 1970s.", "link_mentions": [{"page": "Isaac Julien", "response": ["In 1980, Julien organised the Sankofa Film and Video Collective with Martina Attille, Maureen Blackwood, Nadine Marsh-Edwards, and Robert Crusz in response to the social unrest in Britain. Sankofa was \"dedicated to developing an independent black film culture in the areas of production, exhibition and audience\". He received a BA in fine-art film from Central Saint Martins School of Art, London (1984) where he worked alongside artists including Sandra Lahire, Malcolm Le Grice, Lis Rhodes, Vera Neubauer, Adam Finch, and Tina Keane, and completed his postdoctoral studies at Les entrepreneurs de l'audiovisuel européen, Brussels (1989)."]}, {"page": "London Film-Makers' Co-op", "response": ["Filmmakers associated with the group include Malcolm Le Grice, Peter Gidal, Michael \"Atters\" Attree,LFMC Cinema Events Programme: April/May 1987  Carolee Schneemann, Annabel Nicolson, Lis Rhodes, Gill Eatherley, Roger Hammond, Mike Dunford, Sandra Lahire, Vera Neubauer, David Crosswaite, Philip Goring, Sanchieboots, Fred Drummond, et al.Peter Gidal, Materialist Film (Routledge),John Smith,  Bart J. Moore-Gilbert, The Arts in the 1970s: Cultural Closure?, Routledge, 1994, p231.  and William Raban, who managed the LFMC workshop from 1972 - 76. Sally Potter made several short films at the LFMC in the early 1970s.Marsha MacCreadie, Women Screenwriters Today: Their Lives And Words, Praeger/Greenwood, 2006, p63. "]}, {"page": "List of British film directors", "response": ["*Lis Rhodes"]}, {"page": "List of avant-garde films of the 1980s", "response": ["|Lis Rhodes"]}, {"page": "List of avant-garde films of the 1970s", "response": ["|Lis Rhodes", "|Lis Rhodes", "|Lis Rhodes"]}, {"page": "Sandra Lahire", "response": ["Lahire studied Philosophy at the University of Newcastle-upon-Tyne (BA), Fine Art Film at St Martin's School of Art, London, (1984) and Film & Environmental Media at the Royal College of Art, London (MA 1986). It was at St Martin's that she entered the world of independent film, working with artists including Malcolm Le Grice, Lis Rhodes, Tina Keane, Vera Neubauer and studying alongside the film-maker Isaac Julien.", "Reflections on Lahire and her work by film-makers Sarah Pucill (who was her partner in the last 6 years of her life), Lis Rhodes (for whom Lahire wrote a score for her film Just About Now ) and Sarah Turner appeared in Vertigo magazine in Spring 2002."]}, {"page": "WACK! Art and the Feminist Revolution", "response": ["* Lis Rhodes (born 1942), British artist"]}, {"page": "Circles (film distributor)", "response": ["Circles was a feminist film and video distribution network in the UK, which was set up out of a desire to distribute and screen women's films on their own terms. It was founded in 1979 by feminist filmmakers Lis Rhodes, Jo Davis, Felicity Sparrow and Annabel Nicolson, publishing a 1980 catalogue including about 30 films, and it closed in 1991, largely due to funding issues that also prompted the merger of Circles and Cinema of Women, which led to the formation of Cinenova. A previous funding crisis in 1987, when funding by Tower Hamlets council had been withdrawn, had been resolved with replacement funding from the British Film Institute."]}, {"page": "Sarah Turner (filmmaker)", "response": ["As a student, Turner was mentored by the artists Tina Keane and Lis Rhodes. Like Rhodes, Turner was involved in the women’s film distributors, Circles and later Cinenova, where she had access to much early women’s and feminist moving image work. She has also stated that her influences include Black Audio Film Collective, Sankofa and Isaac Julien’s subsequent works."]}, {"page": "List of alumni of the Royal College of Art", "response": ["* Lis Rhodes"]}, {"page": "Lis (given name)", "response": ["*Lis Rhodes (born 1942), British artist and feminist filmmaker"]}]}}