{"wiki_id": "http://www.wikidata.org/entity/Q17522", "itemLabel": "Hertha Ayrton", "itemDescription": "English engineer, mathematician and inventor", "wikipedia_url": "https://en.wikipedia.org/wiki/Hertha_Ayrton", "wikipedia_page": {"main": "Phoebe Sarah Hertha Ayrton (28 April 1854 – 26 August 1923) was a British engineer, mathematician, physicist and inventor, and suffragette. Known in adult life as Hertha Ayrton, born Phoebe Sarah Marks, she was awarded the Hughes Medal by the Royal Society for her work on electric arcs and ripple marks in sand and water.\n\n", "link_mentions": [{"page": "Marie Curie", "response": ["She was the first person to win or share two Nobel Prizes, and remains alone with Linus Pauling as Nobel laureates in two fields each. A delegation of celebrated Polish men of learning, headed by novelist Henryk Sienkiewicz, encouraged her to return to Poland and continue her research in her native country. Curie's second Nobel Prize enabled her to persuade the French government into supporting the Radium Institute, built in 1914, where research was conducted in chemistry, physics, and medicine. A month after accepting her 1911 Nobel Prize, she was hospitalised with depression and a kidney ailment. For most of 1912, she avoided public life but did spend time in England with her friend and fellow physicist, Hertha Ayrton. She returned to her laboratory only in December, after a break of about 14 months."]}, {"page": "1854", "response": ["* April 28 – Hertha Ayrton, English engineer, mathematician and inventor (d. 1923)"]}, {"page": "1923", "response": ["* August 26 – Hertha Ayrton, English engineer, mathematician and inventor (b. 1854)"]}, {"page": "Arc lamp", "response": ["In the late nineteenth century, electric arc lighting was in wide use for public lighting. The tendency of electric arcs to flicker and hiss was a major problem. In 1895, Hertha Ayrton wrote a series of articles for The Electrician, explaining that these phenomena were the result of oxygen coming into contact with the carbon rods used to create the arc. In 1899, she was the first woman ever to read her own paper before the Institution of Electrical Engineers (IEE). Her paper was \"The Hissing of the Electric Arc\"."]}, {"page": "Kate Mulgrew", "response": ["| Hertha Ayrton"]}, {"page": "Local Heroes (British TV series)", "response": ["Hertha Ayrton: Invented way of clearing trenches of Mustard Gas."]}, {"page": "Negative resistance", "response": ["Negative resistance was first recognized during investigations of electric arcs, which were used for lighting during the 19th century. In 1881 Alfred NiaudetA. Niaudet, La Lumiere Electrique, No. 3, 1881, p. 287, cited in Encyclopædia Britannica, 11th Ed., Vol. 16, p. 660 had observed that the voltage across arc electrodes decreased temporarily as the arc current increased, but many researchers thought this was a secondary effect due to temperature. The term \"negative resistance\" was applied by some to this effect, but the term was controversial because it was known that the resistance of a passive device could not be negative.Emile Garcke, , also see letter by Andrew Gray on same page Beginning in 1895 Hertha Ayrton, extending her husband William's research with a series of meticulous experiments measuring the I–V curve of arcs, established that the curve had regions of negative slope, igniting controversy. Frith and Rodgers in 1896 with the support of the Ayrtons introduced the concept of differential resistance, dv/di, and it was slowly accepted that arcs had negative differential resistance. In recognition of her research, Hertha Ayrton became the first woman voted for induction into the Institute of Electrical Engineers."]}, {"page": "1899 in science", "response": ["* Hertha Ayrton becomes the first woman to read her own paper (on the electric arc) before the Institution of Electrical Engineers in London, of which soon afterwards she is elected the first female member."]}, {"page": "1906 in science", "response": ["* Hughes Medal – Hertha Ayrton"]}, {"page": "1923 in science", "response": ["* August 23 – Hertha Ayrton (born 1854), electrical engineer."]}, {"page": "Portsea Island", "response": ["Hertha Ayrton, British engineer, mathematician, physicist and inventor, was born there in 1854."]}, {"page": "Karl Blind", "response": ["After moving to Hampstead, London, Blind's family embraced the English education system and interests. Ottilie was involved in supporting women's suffrage, home rule for Ireland and the League of Nations. She organised working parties for the Serbian Red Cross during the First World War. She married a barrister Charles Hancock.  She is now best known for her endowment in 1925 of the Ottilie Hancock and Hertha Ayrton Fellowships at Girton College, Cambridge. Rudolph was educated at University College School and the Royal Academy. He was an artist and illustrator. His best known works were The Golden Gates, Christ the Consoler, The World’s Desire (subject to two court cases, one against the artist for alleged obscenity and indecency while the other was for delivery of the picture and damages against the artist's wife), Love’s Extasy, and The Throne of Grace. He married Annie Sarah and they had 3 sons."]}, {"page": "Notting Hill and Ealing High School", "response": ["*Hertha Ayrton, engineer, mathematician, physicist and inventor"]}, {"page": "Black Friday (1910)", "response": ["On 18 November 1910, in an attempt to resolve the parliamentary impasse arising from the House of Lords veto on Commons legislation, Asquith called a general election, and said that parliament would be dissolved on 28 November; all remaining time was to be given over to official government business. He did not refer to the Conciliation Bill. At noon on the same day the WPSU held a rally at Caxton Hall, Westminster. The event had been widely publicised, and the national press were prepared for the expected demonstration later in the day. From Caxton Hall, approximately 300 members—divided into groups of ten to twelve by the WSPU organiser Flora Drummond—marched to parliament to petition Asquith directly. The deputation was led by Emmeline Pankhurst. The delegates in the lead group included Dr Elizabeth Garrett Anderson, Dr Louisa Garrett Anderson, Hertha Ayrton and Princess Sophia Duleep Singh. The first group arrived at St Stephen's entrance at 1:20 pm. They were taken to Asquith's office where his private secretary informed them that the prime minister refused to see them. They were escorted back to St Stephen's entrance, where they were left to watch the demonstration."]}, {"page": "Ripple marks", "response": ["*Hertha Ayrton - pioneer in description of how ripples formed"]}, {"page": "Great Lives", "response": ["|Hertha Ayrton, physicist, and suffragette"]}, {"page": "Women in physics", "response": ["*1906: English physicist, mathematician and engineer Hertha Ayrton became the first female recipient of the Hughes Medal from the Royal Society of London. She received the award for her experimental research on electric arcs and sand ripples."]}, {"page": "List of British Jewish scientists", "response": ["* Hertha Ayrton, mathematician and engineer"]}, {"page": "1854 in the United Kingdom", "response": ["* 28 April – Hertha Ayrton, engineer, inventor and suffragette (died 1923)"]}, {"page": "1923 in the United Kingdom", "response": ["**Hertha Ayrton, engineer, inventor and suffragette (born 1854)"]}, {"page": "Louisa Garrett Anderson", "response": ["From 1903, Anderson had been active in organizations affiliated with the NUWSS, which advocated for gaining voting rights through peaceful means. Frustrated by the lack of progress on voting rights, in 1907, she became an active member of the more radical WSPU. On 18 November 1910, Anderson joined her mother, Emmeline Pankhurst, Alfred Caldecott, Hertha Ayrton, Mrs Elmy, Hilda Brackenbury, Princess Sophia Duleep Singh, and 300 women to petition Prime Minister Asquith for voting rights. The protest became known as Black Friday, due to the violence and sexual assault the protesters faced from the police and male bystanders. More than one hundred women were arrested, including Anderson, but all were released without charge. In 1912, she was imprisoned in Holloway, briefly, for her suffragette activities which included breaking a window by throwing a brick. In 1914, Anderson joined Agnes Harben and the new group of women and men: H. J. Gillespie, Gerald Gould, Bessie Lansbury and George Lansbury, Mary Neal, Emmeline Pethick-Lawrence, Julia Scurr and John Scurr, Evelyn Sharp, and Edith Ayrton, Louise Eates and Lena Ashwell  in starting the United Suffragists which grew to have branches in London, Liverpool, Edinburgh and Glasgow."]}, {"page": "List of women in mathematics", "response": ["* Hertha Ayrton (1854–1923), English engineer, mathematician, physicist, and inventor, winner of the Hughes Medal"]}, {"page": "List of Jewish mathematicians", "response": ["* Hertha Ayrton (1854–1923), mathematician and engineer"]}, {"page": "Hertha Marks", "response": ["#REDIRECT Hertha Ayrton"]}, {"page": "Phoebe Sarah Hertha Marks Ayrton", "response": ["#REDIRECT Hertha Ayrton"]}, {"page": "Phoebe Sarah Marks", "response": ["#REDIRECT Hertha Ayrton"]}, {"page": "Phoebe Sarah Hertha Marks", "response": ["#REDIRECT Hertha Ayrton"]}, {"page": "List of geological features on Venus", "response": ["| Ayrton Patera|| 6.0N || 227.3E || 85.0 || 1994 ||Hertha Ayrton, English physicist (1854–1923)."]}, {"page": "Evelyn Sharp (suffragist)", "response": ["Sharp in March 1912, also acted as go-between for the leaders of WSPU taking a cheque for £7,000 to be authorised by Christabel Pankhurst to transfer funds to the personal account of Hertha Ayrton to avoid confiscation after the Scotland Yard raid on the Clement's Inn offices."]}, {"page": "Ray Strachey", "response": ["Like some other female Mathematics graduates of the time, such as Margaret Dorothea Rowbotham and Margaret Partridge, Strachey developed an interest in engineering. She was discouraged by her mother Mary Berensen but nevertheless she took an electrical engineering class at Oxford University in 1910 and planned to study electrical engineering at the Technical College of the City and Guilds of London Institute in October 1910. She wrote to her aunt \"I have decided to go to London next winter for my engineering\" and that she had been encouraged and helped by Hertha Ayrton. She abandoned her plan due to marriage, but maintained her involvement with the Society of Women Welders which she had helped to found."]}, {"page": "Patricia Fara", "response": ["Her areas of particular academic interest include the role of portraiture and art in the history of science, science in the 18th century England during the Enlightenment and the role of women in science.  She has written about numerous women in science, mathematics, engineering, and medicine including: Hertha Ayrton, Lady Helen Gleichen, Mona Chalmers Watson, Helen Gwynne-Vaughan, Isabel Emslie Hutton, Flora Murray, Ida Maclean, Marie Stopes, and Martha Annie Whiteley. She has argued for expanded access to childcare as a means of increasing the retention of women in science. She has written and co-authored a number of books for children on science.  Fara is also a reviewer of books on history of science.  She has written the award-winning Science: A Four Thousand Year History (2009) Fara, Patricia (2009) Science: A Four Thousand Year History Oxford: Oxford University PressFerry, Georgina (2009) 'Under the Microscope' The Guardian 25 April 2009 Retrieved 16 August 2010 and Erasmus Darwin: Sex, Science, and Serendipity (2012).Fara, Patricia (2012) Erasmus Darwin: Sex, Science, and Serendipity Oxford: Oxford University Press Her most recent book is A Lab of One's Own: Science and Suffrage in the First World War\" (2017).Moore, Wendy (2018) 'A Lab of One’s Own: Science and Suffrage in the First World War by Patricia Fara review – trailblazing feminist' The Guardian 03 January 2018Bruton, Elizabeth (2018) 'When Suffragettes kicked open the lab door' Nature 10 January 2018 In 2013, Fara published an article in Nature (journal), stressing the fact that biographies of female scientists perpetuate stereotypes."]}, {"page": "Ayrton, Hertha", "response": ["#REDIRECT Hertha Ayrton"]}, {"page": "List of female fellows of the Royal Society", "response": ["The first recorded question of women being admitted to the Royal Society occurred in 1900, when Marian Farquharson, the first female fellow of the Royal Microscopical Society, sent a letter to the Council of the Royal Society petitioning that \"duly qualified women should have the advantage of full fellowship\". In its reply, the Council stated that the question of women fellows \"must depend on the interpretation to be placed upon the Royal Charters under which the Society has been governed for more than three hundred years\". When Hertha Ayrton was nominated for fellowship in 1902, her candidature was turned down on the basis that as a married woman she had no standing in law. The Sex Disqualification (Removal) Act 1919 made it illegal for an incorporated society to refuse admission on the grounds of an individual's sex or marital status. While the Society acknowledged the provision of section 1 of the Act in 1925, in reply to a question originally put to them by the Women's Engineering Society three years prior, it was not until 1943 that another woman was nominated for fellowship. Kathleen Lonsdale and Marjory Stephenson were duly elected in 1945, after a postal vote amending the Society's statutes to explicitly allow women fellows."]}, {"page": "Phoebe Sarah Hertha Ayrton", "response": ["#REDIRECT Hertha Ayrton"]}, {"page": "Phoebe Marks", "response": ["#REDIRECT Hertha Ayrton"]}]}}