{"wiki_id": "http://www.wikidata.org/entity/Q17523883", "itemLabel": "Matt Partridge", "itemDescription": "English footballer", "wikipedia_url": "https://en.wikipedia.org/wiki/Matt_Partridge", "wikipedia_page": {"main": "Matthew Nicholas Partridge (born 7 November 1993) is an English football defender who plays for National League South side Hungerford Town.\n\n", "link_mentions": [{"page": "2012–13 Reading F.C. season", "response": ["On 16 October it was revealed that Reading had taken Indian under-19 international Brandon Fernandes on a two-week trial from ASD Cape Town. Two days later Adam Le Fondre became the fourth player of the season to sign a new contract, penning a three-year deal and joining Adam Federici, Jem Karacan and Sean Morrison in committing his future to the club. The next day young defender Matt Partridge was the first player to depart during the month, joining Bognor Regis Town on a one-month loan.", "In a quiet month of loan activity young goalkeeper Jon Henly was the only outgoing player, joining Hungerford Town on 14 December on a one-month deal. On 17 December Reading were back at the Madejski Stadium to face Arsenal in what turned out to be another high scoring game between the two sides. The visitors took a 4–0 lead through Lukas Podolski and a Santi Cazorla hat-trick before the Royals gave themselves a lifeline with two quick goals from Le Fondre and Jimmy Kébé. Any hopes of a comeback were dashed after 80 minutes though when Theo Walcott scored Arsenal's fifth as the game finished 5–2. The following weekend Reading were away to Manchester City and despite putting in a much improved performance, they were beaten 1–0. The Royals held out for 93 minutes until Gareth Barry rose above Nicky Shorey to head past Adam Federici and snatch victory. Boxing day saw the visit of Swansea City with a 0–0 draw enough to end a run of seven straight defeats. Adam Le Fondre had a second half goal disallowed for handball though they created few other chances with Federici forced to pull off a number of saves to keep Swansea from scoring. On the same day Matt Partridge returned from his loan spell at Bognor Regis Town having spent two months with the Rocks. The last game of the month saw Reading clinch a vital 1–0 win over West Ham United at the Madejski. A mistake from James Collins allowed Pavel Pogrebnyak to score after just five minutes and the Royals held on for just their second win of the season. Despite a good end to the month, the team managed just four points from a possible 21 and remained in 19th place going into the new year. The year ended with the return of Simon Church from his loan spell at Huddersfield having been with the Yorkshire side since early November.", "| Matt Partridge", "| Matt Partridge", "| Matt Partridge"]}, {"page": "Reading F.C. Under-23s and Academy", "response": ["* Matt Partridge"]}, {"page": "2013–14 Reading F.C. season", "response": ["On 20 September, Reading signed Northern Ireland international defender Chris Baird on a free transfer following his release from Fulham. Matt Partridge joined Basingstoke Town on a one-month loan while Daniel Lincoln was on the move again, joining Harrow Borough on a similar deal. Baird went straight into the team for the game against Derby County at Pride Park which Reading won 3–1. The returning Pavel Pogrebnyak opened the scoring with his first goal for the club since January before doubling their lead with his second of the game. Will Hughes pulled on back for Derby but Nick Blackman's injury time strike secured the win for Reading. Billy Sharp joined on an emergency loan from Southampton late in the month. He was an unused substitute for the game against Birmingham City which Reading won 2–0 through two Danny Guthrie free kicks. Guthrie was later nominated for Championship Player of the Month but lost out to Ipswich Town striker David McGoldrick.", "Reading started the month with a 1–0 home win over Charlton Athletic with Billy Sharp scoring the only goal of the game, his first for the club. Young winger Shepherd Murombedzi joined Bognor Regis Town on a month's loan, whilst Karl Sheppard made his loan move to Shamrock Rovers permanent. The side then faced Bournemouth at the Madejski Stadium, losing 2–1. Having gone two goals down through Lewis Grabban and Matt Ritchie, a late Adam Le Fondre strike proved no more than a consolation. On 10 December, Sean Morrison and Jordan Obita signed new deals which will keep them with the club until summer 2017. A week later Reading travelled to Huddersfield Town and came away with a 1–0 win courtesy of a first half Billy Sharp header. The team then suffered back-to-back losses, going down 2–1 at home to Wigan Athletic and then 1–0 away to automatic promotion contenders Leicester City; Pavel Pogrebnyak scoring Reading's solitary goal. At the end of the month youngsters Matt Partridge and Daniel Lincoln joined Basingstoke Town and Farnborough respectively, while Lawson D'Ath's stay at Dagenham & Redbridge was extended for a further month. Reading ended the year with a third straight defeat after losing heavily away at Middlesbrough. Two goals from Grant Leadbitter and one from Albert Adomah gave the hosts a 3–0 win with the team's disappointment compounded when Kaspars Gorkšs was sent off for two bookable offences.", "Three days after the end of the season, five senior players were told that they would not be offered new contracts. Captain Jobi McAnuff, as well as fellow 2011–12 promotion winners Kaspars Gorkšs and Mikele Leigertwood departed after more than 400 combined appearances, along with Stuart Taylor and Wayne Bridge, who subsequently announced his retirement from football. The following week a further five professionals left with Lawson D'Ath the only one among them to have made a first team appearance for the club. The others to leave were Nick Arnold, Shepherd Murombedzi, Matt Partridge and Gozie Ugwu. Jake Taylor and Michael Hector, who both broke into the first team during the season, making nine appearances each, were offered new contracts along with five other young professionals.", "| Matt Partridge", "| Matt Partridge", "| Matt Partridge", "| Matt Partridge"]}, {"page": "2014–15 Reading F.C. season", "response": ["On 6 May, Reading announced that five players would be leaving upon the expiry of their contracts. Those departing were Stuart Taylor, Kaspars Gorkšs, Wayne Bridge, Mikele Leigertwood and club captain Jobi McAnuff. Youngsters Lawson D'Ath, Nick Arnold, Gozie Ugwu, Matt Partridge and Shepherd Murombedzi were also released whilst contract talks were taking place with Michael Hector, Jake Taylor and 18 other youth players. On 30 May youngsters Michael Hector and Jake Taylor signed new two-year contracts with the option of a third."]}, {"page": "2014–15 Dagenham & Redbridge F.C. season", "response": ["!scope=\"row\"|Matt Partridge"]}, {"page": "Mason Bloomfield", "response": ["Bloomfield was born in Westminster but raised in Edgware, and is of Jamaican descent. He played for the Ase Academy based in Edmonton before joining the youth system at Dagenham & Redbridge. In the summer of 2013, he started a two-year scholarship with the club. Whilst still in the youth team, he made his professional debut for the first team in a 2–0 defeat to Northampton Town in September 2014, replacing Matt Partridge as a last-minute substitute despite featuring in a youth team match the same morning. Later in the month he joined Isthmian League Division One North side Chatham Town on loan, making his debut in a 2–0 defeat to Romford. He scored his first goal for the club in a 2–1 victory over Harlow Town. He made his final appearance for the club in a 1–1 draw with Thamesmead Town, having made five appearances scoring once. In October 2014, he was sent out on loan to Southern Counties East Football League side Erith & Belvedere, scoring on his debut with a header in the 3–1 away win over Tunbridge Wells. He only went on to make two more appearances for the club before returning to Dagenham in November. In December 2014 he was moved out on loan again to Maldon & Tiptree of the Isthmian League Division One North."]}, {"page": "2015–16 Dagenham & Redbridge F.C. season", "response": ["|Matt Partridge", "!scope=\"row\"|Matt Partridge "]}, {"page": "2015–16 Newport County A.F.C. season", "response": ["| 1 September 2015 || DF ||  || Matt Partridge || Basingstoke Town || Free transfer || ", "| 10 May 2016 || DF ||  || Matt Partridge || Free agent || Released ||"]}]}}