{"wiki_id": "http://www.wikidata.org/entity/Q17508446", "itemLabel": "Richard Cockett", "itemDescription": "British historian, journalist and writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Richard_Cockett", "wikipedia_page": {"main": "Richard Cockett (born 1961) is a British historian, journalist and writer.He is a regional editor of The Economist, with experience in Mexico, Central America, Africa and Singapore. He was previously a senior lecturer in politics and history at Royal Holloway, University of London.", "link_mentions": [{"page": "Appeasement", "response": ["Positive opinion of appeasement was shaped partly by media manipulation.  The German correspondent for the Times of London, Norman Ebbutt, charged that his persistent reports about Nazi militarism were suppressed by his editor Geoffrey Dawson. Historians such as Richard Cockett, William Shirer, and Frank McDonough have confirmed the claim,Gossen, David J. \"Public opinion, Appeasement, and The Times : Manipulating Consent in the 1930s\" M.A. Thesis, History Department, University of British Columbia and also noted the links between The Observer and the pro-appeasement Cliveden Set.Frank McDonough, Neville Chamberlain, Appeasement, and the British Road to War (Manchester University Press,1998), pp. 114–19 The results of an October 1938 Gallup poll which showed 86% of the public believed Hitler was lying about his future territorial ambitions was censored from the News Chronicle at the last minute by the publisher, who was loyal to Chamberlain.Lynne Olson, Troublesome Young Men: The Rebels Who Brought Churchill to Power and Helped Save England (Farrar, Straus and Giroux;, 2008), pp. 178–79 For the few journalists who were asking challenging questions about appeasement – primarily members of the foreign press – Chamberlain often froze them out or intimidated them. When asked at press conferences about Hitler's abuse of Jews and other minority groups, he went so far as to denounce these reports as \"Jewish-Communist propaganda\".Olson, Lynne (2008) Troublesome Young Men: The Rebels Who Brought Churchill to Power and Helped Save England New York: Farrar, Straus and Giroux. pp. 120–22]", "Chamberlain's direct manipulation of the BBC was sustained and egregious.David Deacon, \"A Quieting Effect? The BBC and the Spanish Civil War (1936–1939).\" Media History, 18 (2), pp. 143–58 For example, Lord Halifax told radio producers not to offend Hitler and Mussolini, and they complied by censoring anti-fascist commentary made by Labour and Popular Front MPs. The BBC also suppressed the fact that 15,000 people protested the prime minister in Trafalgar Square as he returned from Munich in 1938 (10,000 more than welcomed him at 10 Downing Street).McDonough, Frank (1998) Neville Chamberlain, Appeasement, and the British Road to War Manchester: Manchester University Press. pp. 124–33] The BBC radio producers continued to censor news of Jewish persecution even after the war broke out, as Chamberlain still held out hopes of a quick armistice and did not want to inflame the atmosphere.Olson, Lynne (2008)Troublesome Young Men: The Rebels Who Brought Churchill to Power and Helped Save England New York: Farrar, Straus and Giroux. p. 258 As Richard Cockett noted:"]}, {"page": "David Astor", "response": ["* David Astor and The Observer by Richard Cockett. Has endpapers that are facsimiles of The Observer newspaper, with other black-and-white photographic plates of personnel linked to newspaper. 294 pages with an index. London: Andre Deutsch (1990). "]}, {"page": "Darfur", "response": ["Darfur ( ; ) is a region of western Sudan. Dār is an Arabic word meaning \"home [of]\" – the region was named Dardaju () while ruled by the Daju, who migrated from Meroë , and it was  renamed Dartunjur () when the Tunjur ruled the area. Darfur was an independent sultanate for several hundred yearsRichard Cockett Sudan: Darfur and the failure of an African state. 2010. Hobbs the Printers Ltd., Totten, Hampshire.  until it was incorporated into Sudan by Anglo-Egyptian forces in 1916. As an administrative region, Darfur is divided into five federal states: Central Darfur, East Darfur, North Darfur, South Darfur and West Darfur. Because of the War in Darfur between Sudanese government forces and the indigenous population, the region has been in a state of humanitarian emergency and genocide since 2003. The factors include religious and ethnic rivalry, and the rivalry between farmers and herders.Veronika Danielová, \"Darfur Crisis of 2003: Analysis of the Darfur Conflict from the Times of First Clashes to the Present Day.\" Ethnologia Actualis 1.14 (2014): 37-59.", "A pattern of skewed economic development continued after Sudan achieved political independence in 1956. The proxy wars between Sudan, Libya and Chad added an element of political instability.Roland Marchal, \"Chad/Darfur: how two crises merge.\" Review of African Political Economy 33.109 (2006): 467-482. online  Darfurians, mainly those who self-identified as \"Arab\" and \"African\" people, began to respond to the ideology of Arab supremacy propagated by Libyan leader Muammar al-Gaddafi (in power 1969-2011). A famine in the mid-1980s disrupted many societal structures and led to the first significant modern fighting amongst Darfuris. A low-level conflict continued for the next fifteen years, with the government co-opting and arming Arab Janjaweed militias against its enemies. The fighting reached a peak in 2003 with the beginning of the Darfur conflict, in which the resistance coalesced into a roughly cohesive rebel movement. Human-rights groups and the UN, March, 2004,Un.org came to regard the conflict  as one of the worst humanitarian disasters in the world. Insurgency and counter-insurgency have led to 480,000 deaths (the Khartoum government disputes the numbers). This has been labeled as Darfur genocide. \"By 2010 about 300,000 had died, according to the UN best estimate and about 3,000,000 were forced into refugee camps\"Richard Cockett Sudan: Darfur and the failure of an African state. 2010. p, 191. Hobbs the Printers Ltd., Totten, Hampshire.  Over 2.8 million people have become displaced since 2003, many of whom were children (see Lost Boys of Sudan). Many of these refugees have gone into camps where emergency aid has created conditions that, although extremely basic, are better than in the villages, which offer no protection against the various militias that operate in the region."]}, {"page": "Oliver Smedley", "response": ["Smedley was also a Liberal politician, standing against Rab Butler in Saffron Walden in the general elections of 1950 and 1951. In all he contested eighteen Parliamentary elections. According to Richard Cockett Smedley and Alfred Suenson-Taylor \"sought to keep the flames of Gladstonian Liberalism burning within the [Liberal] Party\" and to oppose the influence of William Beveridge and John Maynard Keynes.Cockett, p. 127. Smedley was a critic of what he considered to be the Liberal Party's abandonment of free trade and self-improvement. In a speech in Westminster on 8 November 1952 Smedley said:", "* Richard Cockett, Thinking the Unthinkable: Think-Tanks and the Economic Counter-Revolution, 1931–1983 (Fontana, 1995)."]}, {"page": "Antony Fisher", "response": ["In his book Thinking the Unthinkable, Richard Cockett sketched Fisher's role in supporting other emerging think-tanks around the world. Cockett wrote, \"On the strength of his reputation with the IEA, he was invited in 1975 to become co-director of the Fraser Institute in Vancouver, founded by the Canadian businessman T. Patrick Boyle in 1974. Fisher let the young director of the Fraser Institute, Dr Michael Walker, get on with the intellectual output of the Institute (just as he had given free rein to Seldon and Harris at the IEA) while he himself concentrated on the fund-raising side\". Cockett explained that after his success at the Fraser Institute, Fisher went to New York where in 1977 he set up the International Center for Economic Policy Studies (ICEPS), later renamed the Manhattan Institute. \"The incorporation documents for the ICEPS were signed by prominent attorney Bill Casey, later Director of the Central Intelligence Agency\". Cockett comments that \"under the directorship of William Hammett the Manhattan Institute became probably Fisher's greatest success after the IEA\"."]}, {"page": "John Casey (academic)", "response": ["John Casey was educated by the Irish Christian Brothers at St. Brendan's College, Bristol and subsequently at King's College, Cambridge, where he received a First in both parts of the English Tripos.'Cambridge University Tripos Results: English', Times, 21 June 1958; 'Cambridge Tripos Results', Times, 23 June 1960. He later returned as a lecturer in English at Gonville and Caius College.Profile at The University of Cambridge website Richard Cockett described Casey as a mentor to a whole generation of young Conservatives at Cambridge. When Casey celebrated fifty years as a Fellow of the College his party was attended by his friends Harold James, Ruth Scurr, Sir Noel Malcolm, Andrew Roberts, Simon Sebag Montefiore, Ben Schott, Mary Killen, Kwasi Kwarteng, Oliver Letwin, Sarah Sands, Sir Alan Fersht, Robin Holloway and John Simpson and Stephen Hawking.Charles Moore, 'Spectator's Notes: Hunting down dirty old men is not a challenge to the current culture', The Spectator (5 July 2014)."]}, {"page": "Harold Wincott", "response": ["According to one contemporary, Wincott had an \"enormous influence on City thinking\"; it was Wincott who invented the character Solomon Binding in his column as a joke on the numerous \"solemn and binding\" pledges made at TUC Conferences.Richard Cockett, Thinking the Unthinkable: Think-Tanks and the Economic Counter-Revolution, 1931 - 1983 (HarperCollins, 1995), p. 185. The Conservative politician John Biffen has claimed: \"If I had a mentor, it was probably Harold Wincott\".Cockett, p. 169."]}, {"page": "Nigel Vinson, Baron Vinson", "response": ["In 1974, Vinson joined Joseph and Margaret Thatcher as a co founder of the Centre for Policy Studies which, according to Thatcher, \"was where our Conservative revolution began.\" Vinson, who found the Centre's first premises, underwrote the lease and employed its staff, served as honorary treasurer as well as contributing to the intellectual life of the think-tank. The role of the Centre was \"to act as outsider, skirmisher, trail-blazer, to  moot new ideas and policies. Our task was to question the unquestioned, think the unthinkable, blaze new trails...\"Richard Cockett, Thinking the Unthinkable, Think Tanks and the Economic Counter Revolution,Harper Collins, London 1994 Vinson was the co-author of the Centre's first publication, Why Britain Needs a Social Market Economy (1974). According to Vinson's biographer he may have been influential in persuading Joseph not to stand for the Tory party leadership because the latter was temperamentally unsuited to the role, thereby setting the stage for Thatcher to enter the leadership race in 1975. When he resigned as CPS treasurer in 1980, Thatcher acknowledged in a personal letter of thanks the part Vinson had played in changing the direction of British politics: \"What has been achieved during the last six years by way of winning the intellectual argument in favour of free enterprise and against socialism and corporatism would never have been possible without your patient guidance and tireless ability to provide, and then maintain, the foundation stone on which we have built.\""]}, {"page": "Andrew Sykes", "response": ["In 1974 Sykes was a member of a Study Group set up by the Institute for the Study of Conflict which published a report in February of that year titled 'Sources of conflict in British Industry'.  Other members of the Study Group were Ken Watkins, Brian Crozier, Prof. A. R. Hersic of Bedford College, University of London and Prof. Raymond Thomas of the University of Bath. According to Richard Cockett 'the report claimed to be a comprehensive exposure of those politically motivated Trotskist of Communist-linked trade unionists within the trade union movement, who, under cover of legitimate industrial action, sought to create a revolutionary situation.  the ISC thus drew some grave conclusions about the threat to democracy in Britain:", "# Richard Cockett, Thinking the Unthinkable, London: Harper Collins, 1994, p. 223-4."]}, {"page": "Osama bin Laden's house in Khartoum", "response": ["Bin Laden arrived in Sudan in 1991 after falling out with Saudi Arabia's ruling family over their support for the United States in the Gulf War against Iraq. He purchased this property and another in Soba, a one-storey unfurnished mud house on the western bank  overlooking the Blue NileReeve2002,p.175 where he spent many weekends with his family. He lived in Sudan with his four wives, four sons and daughter. Although extremely wealthy, both houses were described as very modest on purpose to adhere to his ideals of humble living. During his time in the country he heavily invested in the infrastructure and in agriculture and businesses. When he lived there he was more known as a \"walking bank\" than a successful organizer of terrorist operations. Hassan al-Turabi allowed bin Laden to live in Sudan on the condition that he would invest in Sudan. It is estimated that he may have invested US$50 million in Sudan. His investments consisted of a bank, trading firm, Wadi al Aqiq, construction industry, which built roads throughout North Sudan, Militant activity of Osama bin Laden and the largest of all was the Al-Damazin Farms which employed 4,000 people, near the Upper Nile region close to the Ethiopian border.Richard Cockett Sudan: Darfur and the failure of an African state. 2010. p. 120, Hobbs the Printers Ltd., Totten, Hampshire.  All of these activities he managed with his nine-room office manned by veteran business men supported by 400 Sudanese men at a salary of $200 a month."]}, {"page": "South Sudan", "response": ["British colonial policy in Sudan had a long history of emphasizing development of the Arab north, and largely ignoring the Black African south, which lacked schools, hospitals, roads, bridges, and other basic infrastructure. After Sudan's first independent elections in 1958, the continued neglect of the southern region by the Khartoum government led to uprisings, revolt, and the longest civil war on the continent.Matthew LeRiche, Matthew Arnold. South Sudan: from revolution to independence. 2012. Columbia University Press. New York. Richard Cockett Sudan: Darfur and the failure of an African state. 2010. Hobbs the Printers Ltd., Totten, Hampshire.  Peoples affected by the violence included the Acholi, Anyuak, Baka, Balanda Bviri, Bari, Boya, Didinga, Dinka, Jiye, Kaligi, Kuku, Lotuka, Mundari, Murie, Nilotic, Nuer, Shilluk, Toposa and Zande.Matthew LeRiche, Matthew Arnold. South Sudan: from revolution to independence. 2012. Ethnic Groups and Flashpoints. p. xv. Columbia University Press. New York. "]}, {"page": "John Eibner", "response": ["Eibner was born and raised in upstate New York, but has lived for most of his adult life in Britain and Switzerland.Richard Cockett, Sudan: Darfur and the Failure of an African State, Yale University Press, 2010, p. 146 He is married with two daughters.", "In 1990, Eibner joined Christian Solidarity International.Richard Cockett, Sudan: Darfur and the Failure of an African State, Yale University Press, 2010, p. 151 During the Armenia-Azerbaijan War of 1992-1993, Eibner led CSI relief expeditions to CSI to Armenians in the blockaded territory of Nagorno-Karabakh, and to Azerbaijanis displaced from their homes in Nagorno-Karabakh.John Eibner and Caroline Cox, \"Ethnic Cleansing in Progress: War in Nagorno Karabakh,\" Institute for Religious Minorities in the Islamic World. http://sumgait.info/caroline-cox/ethnic-cleansing-in-progress/post-soviet-conflict.htm#humanitarian Retrieved October 13, 2011", "In 1992, the New Sudan Council of Churches invited Eibner to come to southern Sudan to observe the effect of the Sudanese civil war on Sudan's Christian population. The atrocities Eibner witnessed there, including mass slaughter and slave raiding by government-supported militias, led him to describe the Sudanese government's campaign against the south as \"genocide\" in an October 1992 article for Wall Street Journal Europe.  According to author Richard Cockett, Eibner's article marks the first use of the word \"genocide\" in connection with modern Sudan.Richard Cockett, Sudan: Darfur and the Failure of an African State, Yale University Press, 2010, p. 151"]}, {"page": "Bor massacre", "response": ["The Bor massacre was a massacre of an estimated 2,000 civilians in Bor on November 15, 1991 during the Second Sudanese Civil War. The massacreRichard Cockett Sudan: Darfur and the failure of an African state. 2010. Hobbs the Printers Ltd, Totton, Hampshire.  was carried out mostly by Nuer fighters from SPLA-Nasir, led by Riek Machar, and the militant group known as the Nuer White Army, shortly after Machar split off from the SPLA led by John Garang. Amnesty International said at least 2,000 Dinka were killed, though the real number may have been higher. In the years which followed, an estimated 25,000 more died from famine as their cattle were either stolen or shot and the fighting had displaced them from the land they had once cultivated. At the time, Riek Machar described the incident as \"propaganda\" and \"myth\". In 2012, he publicly apologized for his part in the massacre.You Tube Channel 4 UK TV Report by Mark Stucke Nov 1991Sudan Tribune August 31, 2007 http://www.sudantribune.com/spip.php?article23545. By Gatkuoth Lam. Dinka Bor Massacre"]}, {"page": "Cockett, Richard", "response": ["#redirectRichard Cockett"]}]}}