{"wiki_id": "http://www.wikidata.org/entity/Q17598455", "itemLabel": "Niall Johnson", "itemDescription": "English screenwriter", "wikipedia_url": "https://en.wikipedia.org/wiki/Niall_Johnson", "wikipedia_page": {"main": "Niall Johnson (born in 1964) is an English screenwriter and film director. He is best known for his 2005 comedy film Keeping Mum.", "link_mentions": [{"page": "Tindersticks", "response": ["* Dickon Hinchliffe has composed film music since 2002, and has been active as a full-time composer in this field since his departure from Tindersticks. Among his work are the soundtracks to Niall Johnson's Keeping Mum (2005), Joel Hopkins' Last Chance Harvey (2008), Sophie Barthes' Cold Souls (2009), James Marsh's Red Riding: In the Year of Our Lord 1980 (2009), Project Nim (2011), and Shadow Dancer; and Debra Granik's Oscar-nominated film Winter's Bone (2010), Lennon Naked (2010), Passion Play (2011), The Fields (2011), Rampart (2011), and Hit & Miss (2012), and more recently Locke (2013), Out of the Furnace (2013), series 3 of Peaky Blinders (2016), and Leave No Trace (2018)."]}, {"page": "Richard Russo", "response": ["Russo co-wrote the 1998 film Twilight with the director Robert Benton. Benton adapted Russo's Nobody's Fool as a 1994 film of the same title, starring Paul Newman, which he also directed. Russo wrote the teleplay for the HBO adaptation of Empire Falls, the screenplay for the 2005 film Ice Harvest, and the screenplay for the 2005 Niall Johnson film Keeping Mum, which starred Rowan Atkinson.", "*Keeping Mum (with Niall Johnson) (2005)"]}, {"page": "Keeping Mum", "response": ["Keeping Mum is a 2005 British black comedy film co written and directed by Niall Johnson and starring Rowan Atkinson, Kristin Scott Thomas, Maggie Smith and Patrick Swayze. It was produced by Isle of Man Film, Azure Films and Tusk Productions, and was released in the United Kingdom on 2 December 2005, by Summit Entertainment."]}, {"page": "Graham McTavish", "response": ["Disney's The Finest Hours, based upon the true story of a daring Coast Guard rescue in 1952, saw McTavish co-star opposite Chris Pine and Eric Bana in 2016. He then appeared, as himself, in director Yaniv Rokah's documentary Queen Mimi, which recounted the life of a homeless woman in Santa Monica, California. In 2017, McTavish starred in director Niall Johnson's western thriller The Stolen, followed by a cameo as King Atlan in the DC Comics/Warner Brothers film Aquaman. Director Adam Sigal's independent film Sargasso saw McTavish in a starring role in early 2019. Later that same year, it was announced that McTavish would star, opposite Anne Heche, in Specter Pictures' upcoming horror thriller Chasing Nightmares."]}, {"page": "List of American films of 2005", "response": ["| White Noise || Universal Pictures / Gold Circle Films || Geoffrey Sax (director); Niall Johnson (screenplay); Michael Keaton, Deborah Kara Unger, Chandra West, Ian McNeice, Mike Dopud, Nicholas Elia, Keegan Connor Tracy, Sarah Strange, Amber Rothwell, Suzanne Ristic, Mitchell Kosterman || Horror, Thriller || "]}, {"page": "List of British films of 2005", "response": ["|Keeping Mum||Niall Johnson ||Rowan Atkinson, Kristin Scott Thomas||Comedy ||"]}, {"page": "Murray McArthur", "response": ["|Niall Johnson"]}, {"page": "The Big Swap", "response": ["The Big Swap is a 1998 British drama film written and directed by Niall Johnson.  It discusses the exchanging sexual partners for one night between bunch of friends and how it affects their lives."]}, {"page": "Rupert Simonian", "response": ["| 2005 || Keeping Mum || Billy Martin the Bully || Isle of Man Film || Niall Johnson"]}, {"page": "List of British films of 2016", "response": ["|| Niall Johnson"]}, {"page": "List of British films of 2017", "response": ["|| Niall Johnson"]}, {"page": "AARP Movies for Grownups Award for Best Comedy", "response": ["|Niall Johnson"]}]}}