{"wiki_id": "http://www.wikidata.org/entity/Q1757629", "itemLabel": "Tim Wright", "itemDescription": "Welsh video game music composer", "wikipedia_url": "https://en.wikipedia.org/wiki/Tim_Wright_(Welsh_musician)", "wikipedia_page": {"main": "Tim Wright (born 31 July 1967), alias CoLD SToRAGE, is a Welsh video game music composer most known for his work in video game soundtracks such as Shadow of the Beast II, Agony, Lemmings, Wipeout and Colony Wars.\nHis first commercial works were created using the Commodore Amiga in the early 1990s and featured in computer games published by Psygnosis.\nWright left Sony in 1997 to form Jester Interactive with the key goal of developing music creation software for home consoles. In his role as creative director at Jester, he designed Music and Music 2000 for the PlayStation and MTV, along with Music Generator and Music 3000 for the PlayStation 2 before leaving along with his brothers to form Checkmate Solutions Limited.\nAt Checkmate, Wright developed several musical sequencing products for Empire Interactive plc. under the eJay brand. After several products were developed, Wright left to form his own company, Tantrumedia Limited.\nWright currently manages Tantrumedia Limited and their audio division where he composes music, designs music sequencing software and oversees the production of websites and other multimedia projects.\n\n", "link_mentions": [{"page": "List of Welsh people", "response": ["*Tim Wright aka. CoLD SToRAGE (born 1967), composer, singer, computer game audio"]}, {"page": "Lemmings (video game)", "response": ["Music was originally created by Brian Johnston (Scott's younger brother), who sampled bits of copyrighted music. This had been common practice, but at that point there was a growing awareness of music copyright. Psygnosis asked Tim Wright to replace the offending tracks, who often used arrangements and reworkings of classical and traditional music to avoid copyright problems. Music tracks in the game include: \"Galop Infernal\" from Orpheus in the Underworld (the music by Offenbach often used for the can-can), \"Rondo alla Turca\" from Mozart's Piano Sonata No. 11, \"Dance of the Reed Flutes\" from Tchaikovsky's Nutcracker Suite, \"Dance of the Little Swans\" from Tchaikovsky's Swan Lake, \"Ten Lemmings\" (a track that uses melodies from traditional song \"Ten Green Bottles\", Chopin's Piano Sonata No. 2 (the part used as funeral march), Wagner's \"Bridal Chorus\" (popularly known as \"Here Comes the Bride\")), \"London Bridge is Falling Down\", the English folk tune \"Forest Green\" (adapted into the hymn \"All Beautiful the March of Days\"), the carol \"O Little Town of Bethlehem\" mixed with the melody from the film The Good, the Bad and the Ugly, \"She'll Be Coming 'Round the Mountain\", and \"(How Much Is) That Doggie in the Window?\".", "Category:Video games scored by Tim Wright (Welsh musician)"]}, {"page": "Shadow of the Beast (1989 video game)", "response": ["Graphics from Shadow of the Beast and Shadow of the Beast II were featured in two special levels in the original Lemmings game (Amiga, Mega Drive, PC, Super NES, and Atari ST versions), called \"A Beast of a Level\" and \"A Beast II of a Level\". These references were supported by cameo versions of the title music from each version, in this case both pieces were arranged by Tim Wright."]}, {"page": "List of film score composers", "response": ["* Tim Wright"]}, {"page": "List of video game musicians", "response": ["*Tim Wright – Welsh composer who goes by the name CoLD SToRAGE, known for his work on Shadow of the Beast II, Shadow of the Beast III, Agony, Lemmings, Wipeout and Colony Wars"]}, {"page": "Agony (1992 video game)", "response": ["The theme song is by Tim Wright, a classically themed, piano-led instrumental. The title song was adapted without giving him proper credit by the keyboardist of Dimmu Borgir in the song \"Sorgens Kammer\" for their Stormblåst album.Agony notes at Psygnosiss The band did not know about this. Following several months of communication between Wright and Dimmu Borgir, and in a nod to the composer, the band did not include the track on a later re-recording of Stormblåst.Re-recording information at Punk TV The title song is also slightly different from the version that Wright originally submitted to Art & Magic. Franck Sauer advised Wright that he could source improved piano sounds for the piece, and requested permission to change them. Wright agreed, but did not hear the end result before the game went to the final master, and consequently some notes within the piece were transposed; this 'mistake' was also covered by Dimmu Borgir.", "Category:Video games scored by Tim Wright (Welsh musician)"]}, {"page": "Wipeout 2097", "response": ["Category:Video games scored by Tim Wright (Welsh musician)"]}, {"page": "Psygnosis", "response": ["* Tim Wright"]}, {"page": "Awesome (video game)", "response": ["The theme music was composed by Tim Wright. The box art for Awesome was painted by science fiction artist John Harris.", "The game has been referenced in other titles. Graphics and music from the game were featured in Psygnosis's later game Lemmings as in-jokes, in a Taxing-rated level called \"What an AWESOME Level\". These references were supported by cameo versions of the title music, arranged by the composer Tim Wright.", "Category:Video games scored by Tim Wright (Welsh musician)"]}, {"page": "Puggsy", "response": ["The Puggsy character originally appeared in an Amiga demo in 1990 named Puggs in Space, which was created and designed by Dionysus—a demogroup formed by Lee Carus, Alan McCarthy and Tim Wright. The management of Psygnosis was impressed by the demo, and asked Dionysus to develop a game based around Puggsy. However, the contract with Psygnosis to produce a game was short lived; Wright said the company \"didn't really 'get' where we were going with the game\". The demogroup was pulled out of the game's development, which was then shifted to Traveller's Tales. Psygnosis asked Traveller's Tales if they could develop a game using   the character from the demo. Puggsy was designed and programmed by Jon Burton, while Andy Ingram handled the graphic design and artwork for the game. While the character design for Puggsy was retained from the demo, the developers changed his colour from red to orange to prevent the consoles from colour bleeding. Wright recalled that Dionysus's version was going to be similar to LittleBigPlanet, while the Traveler's Tales' version was created as a standard platformer.", "*Webpage for Tim Wright, the musician & sound effects creator for the original AMIGA Demo", "Category:Video games scored by Tim Wright (Welsh musician)"]}, {"page": "CoLD SToRAGE", "response": ["#REDIRECT Tim Wright (Welsh musician)"]}, {"page": "Wipeout (video game)", "response": ["The game's electronica soundtrack was mostly composed by Welsh video game music composer Tim Wright under the alias CoLD SToRAGE. Additional music tracks were licensed from more established electronica acts to create the soundtracks for the PAL and Saturn versions of the game, as well as the promotional album, Wipeout: The Music. Additional music featured in the PAL version of the PlayStation game include tracks from Leftfield, The Chemical Brothers, and Orbital (also appearing on Wipeout: The Music), while the Saturn version includes three additional tracks by Rob Lord and Mark Bandola. Orbital's \"Wipeout (P.E.T.R.O.L.)\" was at least partially written before Burcombe met the musicians, and Leftfield's \"Afro Ride\" and The Chemical brothers' \"Chemical Beats\" are remixes of songs the artists had already recorded. The 1995 North American release, as well as the 1997 \"Greatest Hits\" reissue, only feature tracks by CoLD SToRAGE.", "Category:Video games scored by Tim Wright (Welsh musician)"]}, {"page": "Tantrumedia", "response": ["The Managing Director is Tim Wright, formerly of Checkmate Solutions Ltd. (Managing Director & co. founder), Jester Interactive Ltd. (Creative Director & co. founder), Psygnosis (Senior Sound Artist, Studio Liverpool) and Littlewoods plc. (PC Deputy Systems Manager Littlewoods Index)."]}, {"page": "Tim Wright (English musician)", "response": ["Tim Wright has been active as a musician and composer since the early 1990s, working predominantly at the experimental end of the spectrum of electronica and dance music. Besides his birth name, Wright has worked under various names, most notably Germ. He also worked under the name Tube Jerk, a solo project. He was a founding member of Sand, a five-piece experimental rock/jazz/electronic group. Other pseudonyms he has used include Pin, Moondog, Asphere, Speed Baby.", "==Tim Wright=="]}, {"page": "Tim Wright", "response": ["Tim Wright may refer to:", "* Tim Wright (American football) (born 1990), American football tight end", "* Tim Wright (bassist) (1952–2013), American bassist from Pere Ubu and DNA", "* Tim Wright (engineer), Formula One engineer", "* Tim Wright (English musician), English musician and recording artist", "* Tim Wright (rower) (born 1973), Australian lightweight rower", "* Tim Wright (Welsh musician) (born 1967), also known as CoLD SToRAGE, Welsh video game composer", "* Tim Wright, early guitarist of rock band Primus"]}, {"page": "Colony Wars", "response": ["The in-game soundtrack was written and produced by Tim Wright, who also composed music for the Wipeout series of games released by Psygnosis.", "Category:Video games scored by Tim Wright (Welsh musician)"]}, {"page": "Shadow of the Beast II", "response": ["The music for Beast 2 & 3 was composed and produced by Tim Wright. These titles featured a more extensive soundtrack and utilised ethnic samples taken from among other sources the same Korg M1 synthesizer that was sampled by David Whittaker for the original game (although in this case, it was the rack-mounted version the Korg M1/R). Beast 2 contained a total of 17 tracks, most notable of which are the title theme and the game over theme, both of which feature real sampled electric guitars.", "Category:Video games scored by Tim Wright (Welsh musician)"]}, {"page": "Krazy Ivan", "response": ["The game uses full motion video for its intro movie and a cut-scene between each level. The in-game soundtrack was written and produced by Mike Clarke and Tim Wright.", "Category:Video games scored by Tim Wright (Welsh musician)"]}, {"page": "List of Welsh musicians", "response": ["*Tim Wright aka. CoLD SToRAGE"]}, {"page": "July 31", "response": ["*  1967   – Tim Wright, Welsh composer"]}, {"page": "Microcosm (video game)", "response": ["The game used the latest Silicon Graphics computers at the time to render the graphics as realistically as possible. In 1991, the game was first seen in a demo for the Amiga CDTV. A port for the CD-i was planned and then canceled, but a prototype exists. The lead platform was the FM Towns, and development was funded in part by Fujitsu with the aim of making it a launch title for the console-styled version of the platform, the FM Towns Marty. The game engine was later purchased by Fujitsu for £250,000. The DOS and FM Towns versions feature an exclusive soundtrack by Rick Wakeman, which was replaced in other versions with a soundtrack by Tim Wright for licensing reasons. A promotional version of the game was later developed for Pfizer.", "Category:Video games scored by Tim Wright (Welsh musician)"]}, {"page": "Gravity Crash", "response": ["The game features music by video game musician Tim Wright, who composed a 16-track remix album and double 'A'-side single to complement the game.", "Category:Video games scored by Tim Wright (Welsh musician)"]}]}}