{"wiki_id": "http://www.wikidata.org/entity/Q17541299", "itemLabel": "Harvey Lisberg", "itemDescription": "British music manager", "wikipedia_url": "https://en.wikipedia.org/wiki/Harvey_Lisberg", "wikipedia_page": {"main": "Harvey Brian Lisberg (born 2 March 1940) is an English talent manager and impresario, best known for discovering Herman's Hermits in 1963.  In 1965, he signed songwriter Graham Gouldman, a founder member of 10cc, who Lisberg also managed, along with Godley & Creme, Tony Christie, Barclay James Harvest, Gordon Giltrap, Sad Café, Wax and others.", "link_mentions": [{"page": "Herman's Hermits", "response": ["Harvey Lisberg discovered them and signed on as their manager. He sent a plane ticket to London record producer Mickie Most so that he could fly to see the band play in Bolton. Most, already a success with the Animals, became the group's producer and controlled the band's output. He emphasised a simple and non-threatening clean-cut image.", "* Herman's Hermits at Harvey Lisberg"]}, {"page": "Peter Frampton", "response": ["*The Herd at Harvey Lisberg"]}, {"page": "Mickie Most", "response": ["Most had success with Herman's Hermits after being approached by their manager Harvey Lisberg at Derek Everett's suggestion. Their first Most production, \"I'm into Something Good\", went to No. 1 in September 1964, beginning a run of single and album sales (ten million over 12 months), the group for a time challenging The Beatles in popularity in the United States. His down-to-earth handling of the band, his business acumen and knack for selecting hit singles, established Most as one of the most successful producers in Britain and kept him in demand throughout the 1960s and 1970s."]}, {"page": "Neil Sedaka", "response": ["In 1972, Sedaka embarked on a successful English tour and was introduced by Harvey Lisberg to the four future members of 10cc (best known to American audiences for \"I'm Not in Love\" and \"The Things We Do for Love\") with whom he recorded the Solitaire album at their Strawberry Studios in Stockport issued by RCA in 1972. As well as the title track, \"Solitaire\", which was successfully covered by Andy Williams (UK Top 5 singles chart) and the Carpenters (US Top 20), it included two UK Top 40 singles, one of which (\"Beautiful You\") also charted briefly in America, Sedaka's first US chart appearance in ten years. \"Solitaire\" was the first collaboration between Sedaka and Phil Cody, whom Sedaka felt was an ideal lyricist for writing music in the singer-songwriter period; Sedaka and Cody \"clicked\" as songwriters and began a prolonged collaboration between the two. Sedaka took a different approach to songwriting with Cody compared to Greenfield, with whom he was arguing frequently near the end of their collaboration; whereas he allowed Greenfield in the studio during recording, he met with Cody off-site to write songs. Cody did not consider Sedaka to be a personal friend; he mainly saw his work with Sedaka as a work project to bring the singer into the modern era.", "On a business trip to New York in mid-1971, Harvey Lisberg, who was a longtime fan of Sedaka, asked Don Kirshner if he'd written anything new. Kirshner took Lisberg to a small room with a piano where Sedaka was already seated, and he tapped out a few songs. One of these was the Sedaka/Greenfield composition \"(Is This the Way to) Amarillo?\" which Lisberg loved and placed with his artist Tony Christie who recorded and released it in 1971. The song did relatively well on the UK Singles Chart, reaching the Top 20."]}, {"page": "Andrew Gold", "response": ["* Andrew Gold and Graham Gouldman songs at Harvey Lisberg"]}, {"page": "10cc", "response": ["Speaking in the BBC Four documentary I'm Not in Love: The Story of 10cc in 2015, Stewart explained that the band, three years into a five-year contract with King were earning a mere 4% of royalties. Creme made it clear that the band had fully intended to sign with Richard Branson's fledgling Virgin label, with the band's records to be released in the US through Atlantic. Stewart and Creme were about to go on holiday with their wives (Stewart and Creme are brothers-in-law through marriage), however, and had left their manager Harvey Lisberg with power of attorney to accept the Branson offer. No sooner had they left the country, but another higher bid arrived from Phonogram and was accepted by the management team, including Lisberg. Creme said that he felt \"horrified, embarrassed and disgusted - to this day I still am\"."]}, {"page": "Peter Noone", "response": ["Early in his career, he used the stage name Peter Novac. At 15, he became the lead singer, spokesman and frontman of Herman's Hermits, who were discovered by Harvey Lisberg.  As \"Herman\", the photogenic Noone appeared on the cover of many international publications, including Time Magazine's collage showing new faces in popular music."]}, {"page": "Barclay James Harvest", "response": ["After this album, they departed from EMI, moved management to Harvey Lisberg, and signed to Polydor; the move immediately resulting in greater sales. The next album, Everyone Is Everybody Else (1974) was voted 13th by listeners in Radio Caroline's 1977 Top 100 All Time Albums Chart. The band did a BBC Radio 1 session in 1974 for John Peel; Alan Freeman, however, would be the band's main champion on the station in the 1970s and again when he returned from 1989 to 1993. The double live album, Barclay James Harvest Live, which followed in late 1974, was the first to chart in the UK, reaching No. 40. Time Honoured Ghosts (1975), which has \"Titles\", recorded in the US, followed, and this too charted in the UK, reaching No. 32. Octoberon followed in 1976 and reached number 19 in the UK. They broke into the mainstream mainland European market with their 1977 set Gone to Earth, which contained the song \"Poor Man's Moody Blues\", a homage to the Moody Blues' song, \"Nights in White Satin.\""]}, {"page": "List of people from Manchester", "response": ["* Harvey Lisbergmusic and sporting manager who discovered Herman's Hermits"]}, {"page": "Wax (British band)", "response": ["Under the supervision of Harvey Lisberg, Gouldman's long-time manager, the pair started working on songs for a new album, and took the name Wax. They signed with RCA Records, and released three studio albums between 1986 and 1989. The band's best known singles during that period were \"Right Between the Eyes\" and \"Bridge to Your Heart with the latter being a European hit which was supported by European TV appearances including performances of the song on the renowned, high-profile British pop-music showcase Top of the Pops and the German series Peter's Pop Show.", "* Wax at Harvey Lisberg"]}, {"page": "Tony Christie", "response": ["Discovered and managed by Harvey Lisberg, he had three hits in 1971, beginning with \"Las Vegas\" which reached number 21 in the UK, and went on to have two Top Twenty hits in the UK Singles Chart with \"I Did What I Did for Maria\", which reached number two, and \"Is This the Way to Amarillo\", which peaked at number 18, all in 1971.  Subsequently, he had a minor hit with \"Avenues and Alleyways\" which reached number 37, and was the theme to the television series The Protectors.  In addition he charted with 'Drive Safely Darlin' in early 1976 which was recorded on the MCA label and reached 35 in the UK chart.  \"Is This the Way to Amarillo\" had sold more than one million copies by September 1972, and was awarded a gold disc. His early songs were dramatic big-voiced numbers, many of which were written by Mitch Murray and Peter Callander.", "*Tony Christie at Harvey Lisberg"]}, {"page": "Talent manager", "response": ["Modern talents managers are associated with all artistic fields, sports, as well as various fields in business. Talent agents have at times been covered in the music or art press almost as intently as artists themselves, for example the various talent agents who spearheaded the British Invasion of The Beatles and Herman's Hermits in the 1960s such as Brian Epstein, Allan Williams, Harvey Lisberg. Infamous examples in the music press include Allen Klein, manager of both The Beatles and The Rolling Stones. "]}, {"page": "The Herd (British band)", "response": ["The last months of 1968 were tempestuous times for the group. Steele left the group, to be replaced by Henry Spinetti. The group dumped their managers Howard and Blaikley, and briefly found a new mentor in Harvey Lisberg who after three months found himself so bogged down with their personnel problems that he politely withdrew his services. Most songs on their first and only album Paradise Lost were written by Peter Frampton and Andy Bown, just like their next single, \"Sunshine Cottage\".", "*The Herd at Harvey Lisberg"]}, {"page": "Carmel College, Oxfordshire", "response": ["* Harvey Lisberg, talent manager and impresario"]}, {"page": "Julie Driscoll", "response": ["*Julie Driscoll at Harvey Lisberg"]}, {"page": "Graham Gouldman", "response": ["At the same time Gouldman signed a management agreement with Harvey Lisberg, and while working by day in a men's outfitters shop and playing by night with his semi-professional band, he wrote a string of hit songs, many of them million sellers. Between 1965 and 1967 alone, he wrote \"For Your Love\", \"Heart Full of Soul\" and \"Evil Hearted You\" for the Yardbirds, \"Look Through Any Window\" (with Charles Silverman) and \"Bus Stop\" for the Hollies, \"Listen People\", \"No Milk Today\" and \"East West\" for Herman's Hermits, \"Pamela, Pamela\" and \"The Impossible Years\" for Wayne Fontana, \"Behind the Door\" for St. Louis Union (later covered by Cher), \"Tallyman\" for Jeff Beck and \"Going Home\", which was a 1967 Australian hit for Normie Rowe.", "* Graham Gouldman at Harvey Lisberg"]}, {"page": "Andy Peebles", "response": ["*Andy Peebles & His Famous Interview of John Lennon at Harvey Lisberg"]}, {"page": "Derek Leckenby", "response": ["Leckenby was born in Leeds. He was educated at William Hulme's Grammar School, Manchester, and commenced a civil engineering degree course at Manchester University before leaving to become a professional musician. He was performing with Manchester band The Wailers when music manager Harvey Lisberg recruited him for Herman's Hermits."]}, {"page": "Sad Café", "response": ["The group formed as a result of the unification of rock bands Mandalaband and Gyro. Its founder members were Paul Young (vocals), Ian Wilson (guitar), Vic Emerson (keyboards), Ashley Mulford (lead guitar), John Stimpson (bass) and Tony Cresswell (drums). Harvey Lisberg, who also managed 10cc, arranged for Eric Stewart to produce their third album, Facades, which included the top 3 single, \"Every Day Hurts\".", "* Sad Café at Harvey Lisberg"]}, {"page": "Strawberry Studios", "response": ["Another song recorded soon after, \"Umbopo\", released under the name of Doctor Father, became pivotal in the eventual decision by the four musicians to record as a band. When Gouldman was introduced to singer-songwriter Neil Sedaka in New York, Sedaka exclaimed: \"I just love your 'Umbopo'.\" Gouldman told Sedaka the song had been recorded at Strawberry and Sedaka asked if he could use the studio for his next album. Sedaka recorded two albums there – Solitaire (recorded in February and March 1972) and The Tra-La Days Are Over (1973). Harvey Lisberg also brought them Ramases who recorded his Space Hymns album (1971) there.  Manchester folk group Fivepenny Piece also recorded many of their albums at the studios."]}, {"page": "Time Honoured Ghosts", "response": ["Time Honoured Ghosts is the sixth studio album released by the English rock group, Barclay James Harvest in October 1975. The title was suggested by the wife of Harvey Lisberg, the band's manager at the time, though it is believed that she was quoting from another unknown source. It was recorded between May and July 1975 at the \"His Masters Wheels\" studio in San Francisco. It was produced by Elliot Mazer and released in October on the Polydor Records label."]}, {"page": "The Graham Gouldman Thing", "response": ["Gouldman recorded the album at Olympic Studios in London, a studio that would later be extensively used by Led Zeppelin. It was recorded with the assistance of John Paul Jones and Eddie Kramer, and both of whom would also achieve considerable success with Led Zeppelin. The liner notes acknowledge the use of \"some fabulous players on the sessions\", but do not name them. In sleeve notes for the 2004 CD re-release, Gouldman said his manager Harvey Lisberg suggested he make the album, reworking his hits and recording new songs."]}, {"page": "Ramases", "response": ["Several early singles (recorded with his wife, whom he renamed Selket or Seleka) failed to make any impact. In 1971, Harvey Lisberg signed Ramases to Vertigo Records, and recorded the album Space Hymns at Strawberry Studios in Stockport, backed by Eric Stewart, Graham Gouldman, Kevin Godley and Lol Creme, who would shortly after form the band 10cc. Space Hymns has the most expansive artwork Roger Dean was ever allowed to produce, with a 6-panel fold out cover depicting a church steeple (St George's Church, Stockport) lifting off into the cosmos. On the other side in infrared colour Ramases and Sel are shown holding aloft strands of wheat in a Demeter-like pose from the Eleusinian Mysteries. The lyrics deliver the same confident message.  (Note: many sources erroneously report that Ramases' real name was Martin Raphael, who was actually only the sitar player on Space Hymns.)Liner notes to Ramases Complete Discography", "In 2014 actor (and Ramases fan) Peter Stormare collected together (with the help of Selket and Harvey Lisberg) all of Ramases' surviving recordings, both released and unreleased, and compiled them into a six-disc boxed set."]}, {"page": "Both Sides of Herman's Hermits", "response": ["# \"For Love\" (Keith Hopwood, Derek Leckenby, Harvey Lisberg)"]}, {"page": "Neanderthal Man (song)", "response": ["The song was the first to be recorded at Strawberry Studios in Stockport, England, on new four-track Ampex equipment purchased by studio owners Eric Stewart, Graham Gouldman and Peter Tattersall. It featured a simple repeated chorus and a heavy drum rhythm that Gouldman's manager, Harvey Lisberg, has claimed became influential in pop music. He said: \"I think a lot of people were very influenced by 'Neanderthal Man', which was something new in drum sounds, using four drums on a four-track machine. When Gary Glitter came along with his records, I thought I could hear the same sort of sound deep down in there. I think there were a lot of other people who copied the sound, maybe unintentionally.\""]}, {"page": "Donna (10cc song)", "response": ["Band member Eric Stewart has said: \"We knew it had something. We only knew of one person who was mad enough to release it, and that was Jonathan King.\" The song was subsequently released on King's UK Records label. The band had considered releasing it under the name of \"Doctor Father Part Two\", resurrecting a band name they had used for their 1970 song \"Umbopo\". Band manager Harvey Lisberg said there was \"a vague sort of plan at that time to keep on bringing out records under different names until they got a hit\"."]}, {"page": "Harvey (name)", "response": ["* Harvey Lisberg, British talent manager and impresario"]}, {"page": "Mrs. Brown, You've Got a Lovely Daughter (EP)", "response": ["#\"Your Hand in Mine\" (Harvey Lisberg, Silverman)"]}, {"page": "Dandy (EP)", "response": ["#\"For Love\" (Keith Hopwood, Derek Leckenby, Harvey Lisberg)"]}, {"page": "Friday Brown", "response": ["In 1966 the singer-songwriter Graham Gouldman, along with Harvey Lisberg, the creator of Herman's Hermits, formed a group called High Society, which included Friday Brown, Peter Cowap, Christine Ebbrell and Keith Lawless. They issued \"People Passing By\", written by Goldman, accompanied by Phil Dennys, Clem Cattini of The Tornados and John Paul Jones, later of Led Zeppelin.  Gouldman went on to create Strawberry Studios in Stockport, where Friday Brown made some of her later recordings.", "* Friday Brown's page at Harvey Lisberg"]}, {"page": "When You've Gotta Go", "response": ["\"When You've Gotta Go\" was written by Lynsey de Paul (credited to her birth name, Lynsey Rubin) and Ron Roker. It was recorded by Solomon King at 10cc's Strawberry Studios and produced by Harvey Lisberg and released as a single in 1972. The single was a chart hit in Australia,Top 100 (ARIA Chart) Ryan, Gavin (2011). Australia's Music Charts 1988-2010. Mt. Martha, VIC, Australia: Moonlight Publishing and also spent four weeks on the Dutch \"Tipparade\", peaking at #17. It also appeared on the Polydor compilation album \"Doppel Pop Tops 3\"."]}]}}