{"wiki_id": "http://www.wikidata.org/entity/Q17508443", "itemLabel": "Richard Bogue", "itemDescription": "British Army officer", "wikipedia_url": "https://en.wikipedia.org/wiki/Richard_Bogue", "wikipedia_page": {"main": "Captain Richard Bogue (24 October 1782 – 18 October 1813) was an officer of the British Army, who commanded a Rocket Brigade company at the Battle of Leipzig, where he was killed.", "link_mentions": [{"page": "Congreve rocket", "response": ["Contrary to popular belief, rockets could not out-range the equivalent smooth bore guns of the period. In real terms, the maximum effective range for the 12-pounder rockets and for the six-pounder gun was some 1,400 yards or about 1,280 meters. However, the rate of fire with rockets could be higher than the equivalent muzzle loading ordnance.  The absence of weighty ordnance meant that fewer horses were required. Captain Richard Bogue needed just 105 horses for his troop, compared with the 220 of Captain Cavalié Mercer's troop.", "In May 1813, a detachment which had been training with rockets at Woolwich under Second Captain Richard Bogue RHA was inspected by a committee of Royal Artillery officers who recommended that it be tried in combat. On 7 June 1813, Bogue's unit was designated the \"Rocket Brigade\". At the same time as being granted its new title, The Rocket Brigade was ordered to be augmented and to proceed on active service, with orders to join the Army of the North commanded by Bernadotte, the Crown Prince of Sweden. Using the modified 12-pounder at low trajectory from ground firing-troughs, the brigade saw action at the Battle of Gohrde and at the Battle of Leipzig on 18 October 1813, where it was successfuly employed to attack the French stronghold of Paunsdorf, occupied by five French and Saxon battalions. Captain Bogue was however killed by a sharpshooter in the subsequent cavalry charge, and the village of Paunsdorf was eventually retaken by the French Imperial Guard. In the continuing campaign, the Rocket Brigade was also used in the sieges of Frederiksfort and Glückstadt, which surrendered on 13 December 1813 and 5 January 1814, respectively.  On 1 January 1814, the unit assumed the title of the \"2nd Rocket Troop RHA\" and on 18 January it received orders to join the force under the orders of Sir Thomas Graham in Holland."]}, {"page": "Battle of Leipzig", "response": ["The Coalition army was organized into four army-level commands: the Army of Bohemia under Karl von Schwarzenberg, the Army of Silesia under Blücher, the Army of Poland under Levin August von Bennigsen and the combined Prussian, Russian, and Swedish Army of the North under Bernadotte. The Swedes also had under their command a company of the British Rocket Brigade armed with Congreve rockets, under the command of Captain Richard Bogue."]}, {"page": "Battle of the Göhrde", "response": ["In spring 1813, Russian troops under Friedrich Karl von Tettenborn forced the French out of Hamburg and some northern areas of Hanover.  In the wake of Prussia's reentry into the war against France, the eastern areas of Hanover also rose against Napoleon.  Wallmoden then received overall command of all the Allied troops on the Lower Elbe:  troops from Prussia, Russia, the United Kingdom, Hanover, Hamburg, Mecklenburg and Sweden, including the Russian German legion, the Lützow Free Corps, the Hanseatic Legion and a part of the King's German Legion, under the overall command of Generalleutnant Ludwig von Wallmoden-Gimborn. Part of the British contingent was the newly formed Rocket Brigade under Capt Richard Bogue. On 7 September Bogue marched with half his brigade to join the main Army of the North, near Wittenburg. The other half of the brigade, under Lieut Thomas Fox Strangways joined the 4th Cavalry Division of General von Dornberg under General Wallmoden."]}, {"page": "O Battery (The Rocket Troop) Royal Horse Artillery", "response": ["The battery was formed on 1 January 1813. In that year the battery fought as the only British Army unit present at the Battle of Leipzig as 'The Rocket Brigade' under Captain Richard Bogue. It was attached to the bodyguard of Bernadotte, Crown Prince of Sweden. During the battle Bogue was killed in action after a successful attack on five French and Saxon battalions at Paunsdorf, and Lieutenant Fox-Strangways assumed command. In 1815, the battery fought with some of its rockets at the Battle of Waterloo, under Captain Edward Charles Whinyates. It served in the Crimean War, Second Anglo-Afghan War and the Second Boer War."]}, {"page": "Richard Zachariah Mudge", "response": ["Mudge married, on 1 September 1817, Alice Watson, daughter of James Watson Hull of Great Baddow and County Down, Ireland, and left two daughters, Jane Rosedew, who married the Rev. William Charles Raffles Flint, and died in 1883, and Sophia Elizabeth, who married the Rev. John Richard Bogue, son of Richard Bogue."]}, {"page": "Bogue, Richard", "response": ["#redirectRichard Bogue"]}]}}