{"wiki_id": "http://www.wikidata.org/entity/Q17580249", "itemLabel": "Jay Lynch", "itemDescription": "English footballer (born 1993)", "wikipedia_url": "https://en.wikipedia.org/wiki/Jay_Lynch_(footballer)", "wikipedia_page": {"main": "Jay Anthony Lynch (born 31 March 1993) is an English professional footballer who plays as a goalkeeper for  club Rochdale.", "link_mentions": [{"page": "Tyrone Mears", "response": ["In the 2013–14 season, Mears recovered from injury and having fallen out of favor under the management of Freedman, Mears was expected to leave the club in the summer, but stayed. By August, Mears made three appearances, playing twice in the League and once in the league against Blackburn Rovers on 31 August 2013. Afterwards, Mears never made another appearance again, as he remained out of favor by Freedman throughout the season, having become the club's third choice right back this season. At one point, Mears was set to join Blackpool on loan, but the move was in doubt, as he rejected the move. At the end of the 2013–14 season he was released by the club along with Chris Eagles, Zat Knight and Jay Lynch."]}, {"page": "Arran Lee-Barrett", "response": ["On 24 October 2013, he signed a short-term contract with Bolton Wanderers to provide competition for Andy Lonergan after both Ádám Bogdán and Jay Lynch had been ruled out of action with knee and back injuries respectively. BBC Sport. Retrieved 2013-10-24. He linked up again with his former manager Lennie Lawrence, an assistant manager to Dougie Freedman at Bolton. He later signed a contract extension until the end of the season. Following the conclusion of the season, Bolton Wanderers offered Lee-Barrett a new one-year deal but on 1 July, Bolton confirmed that he had left the club."]}, {"page": "2011–12 Bolton Wanderers F.C. season", "response": ["|align=\"left\"|43||align=\"left\"|GK||align=\"left\"| Jay Lynch"]}, {"page": "2012–13 Bolton Wanderers F.C. season", "response": ["|34||GK||align=\"left\"| Jay Lynch"]}, {"page": "2013–14 Bolton Wanderers F.C. season", "response": ["|34||GK||align=\"left\"| Jay Lynch", "Bolton's first piece of transfer activity following the opening of the loan transfer window was to send young striker Tom Eaves on loan to Rotherham United. The first incoming player of the loan transfer window for Bolton was Leicester City midfielder Neil Danns, who was brought in on a three-month deal. Following this, Bolton also signed midfielder Liam Feeney from Millwall, who also arrived on a three-month loan. After a month, Millwall chose to recall him. On the same day, Cardiff City's longest serving player Kevin McNaughton joined on a 28-day emergency loan deal. Following injuries to goalkeepers Ádám Bogdán and Jay Lynch in late October 2013, Bolton signed Arran Lee-Barrett on a short term contract as back up to Andrew Lonergan on 24 October. On the same day, reserve team center back, Cian Bolger joined League One team Colchester United on a month's loan. Meanwhile, Millwall activated the 28-day release clause in Liam Feeney's contract to take him back to The Den two months earlier than expected. On 31 October, youth duo Chris Lester and Conor Wilkinson joined Conference Premier side Chester on month-long loans."]}, {"page": "2014–15 Bolton Wanderers F.C. season", "response": ["On 5 May 2014, it was announced that four senior players would not have their contracts renewed. Club captain Zat Knight, Chris Eagles, Tyrone Mears and Jay Lynch were all released. On the same day the club confirmed that academy players Sam Bailey, Saul Hamer, Jordan Hendrie, James Kelly, Elliot Newby and Guillermo Torres would not have their contracts extended.", "Former Plymouth man Joe Mason rejoined the club on 11 August, signing on for another loan spell until the end of the 2014–15 season from Cardiff City, with whom he had recently agreed a new contract. The first released Bolton player to join a new club was 'keeper Jay Lynch, who joined Accrington Stanley on non-contract terms on 8 August, although he later joined Salford City.", "| align=\"left\" |  Jay Lynch"]}, {"page": "2019 FA Trophy Final", "response": ["|GK ||1 || Jay Lynch"]}, {"page": "2019–20 Rochdale A.F.C. season", "response": ["|12||Jay Lynch||GK||||Salford||||12||0||AFC Fylde||19 August 2019||Free||2021", "|12||||GK||Jay Lynch                                                ||1||0||0||0||0||0||0||0||0||0||0||0||1||0||0", "| 19 August 2019 || GK ||  || Jay Lynch ||  AFC Fylde || Free transfer || "]}, {"page": "2019 National League play-off Final", "response": ["|GK||1||Jay Lynch"]}, {"page": "Jay Lynch (disambiguation)", "response": ["Jay Lynch may refer to:", "* Jay Lynch (d. 1919) Lynching victim in Lamar, Missouri on May 28, 1919", "* Jay Lynch (footballer) (b. 1993)"]}]}}