{"wiki_id": "http://www.wikidata.org/entity/Q17626674", "itemLabel": "Gerald FitzGibbon", "itemDescription": "Irish barrister and judge", "wikipedia_url": "https://en.wikipedia.org/wiki/Gerald_FitzGibbon_(judge,_born_1837)", "wikipedia_page": {"main": "Gerald FitzGibbon  (1837 – 14 October 1909) was an Irish barrister and judge, who is regarded as one of the outstanding Irish jurists of his time. He came from a family which produced three generations of eminent lawyers, with the  father, son and grandson each bearing the name Gerald FitzGibbon.", "link_mentions": [{"page": "Sir Samuel Walker, 1st Baronet", "response": ["He was  a lawyer of great ability,  and went on to become one of a remarkable group of Irish judges,  which included  Christopher Palles, Hugh Holmes, and Gerald FitzGibbon, who gave the Irish Court of Appeal, in the years 1890–1910, a reputation for judicial eminence which has never  been equalled by any other Irish Court, and could bear comparison with any equivalent English court."]}, {"page": "Solicitor-General for Ireland", "response": ["*Gerald FitzGibbon: 3 March 1877 – 1878"]}, {"page": "Hugh Holmes", "response": ["The quality of his judgments was very high and Holmes, together with Christopher Palles and Gerald FitzGibbon, is credited with earning for the Irish Court of Appeal  its reputation as perhaps the strongest tribunal in Irish legal history.Delaney,V.T.H.  Christopher Palles Alan Figgis and Co. 1960 p.158 His retirement, followed by  that of Palles (FitzGibbon had died in 1909), caused a loss of expertise in the Court of Appeal from which its reputation never recovered. Among his more celebrated remarks is that the Irish \"have too much of a sense of humour to dance around a maypole\".Abercromby v Fermoy Town Commissioners [1900]1 I.R 302 at 314 His judgment in The SS Gairloch remains the authoritative statement in Irish law on the circumstances  in which  an appellate court can  overturn findings of fact made by the trial judge.Gairloch, the S.S. ,  Aberdeen Glenline Steamship Co. v Macken [1899] 2 I.R. 1"]}, {"page": "Lords Justices of Ireland", "response": ["After the Acts of Union 1800, de facto executive power shifted from the viceroy to the Chief Secretary for Ireland, and the Lords Justices like the viceroy exercised only formal power. A newly arrived Lord Lieutenant would be escorted in state from Dunleary (later Kingstown) harbour to the Presence Chamber of Dublin Castle, where the Lords Justices were seated. The party would proceed to the Council Chamber, where the Lord Lieutenant would present his letters patent to the Privy Council, and another letter to the Lords Justices demanding the handover of the sword of state.Travers 1981 pp.2–3 Up to the mid nineteenth century the usual Lords Justices were the Lord Chancellor, Church of Ireland Archbishop of Armagh or of Dublin, and Commander-in-Chief, Ireland.;  In 1868 it was ruled that a warrant signed in 1866 by only one of the three then Lords Justices was valid, because the patent appointing them allowed for this in case of absence \"occasioned by sickness or any other necessary cause\", and the cause did not have to be stated. After the Church of Ireland was disestablished in 1871, its prelates were no longer made Lords Justices, and usually only two were sworn in or the third was a second senior judge. Increasingly as the 19th century progressed, Lords Justices were sworn in during short absences from Dublin of the Lord Lieutenant, avoiding delay in validating the growing number of orders in council for routine administration. From 1890 to 1921 such absences averaged eight a year, lasting from days up to more than a month.Travers 1981 p.27 For example, there were eleven occasions in 1897 in which various subsets of six men were sworn Lords Justices — usually three at a time, but four on two occasions and two on one occasion — the six being Somerset Lowry-Corry, 4th Earl Belmore,  Commander-in-Chief Earl Roberts, and four members of the Court of Appeal in Ireland (the Lord Chancellor, Vice-Chancellor, and Master of the Rolls, and Gerald FitzGibbon).The Edinburgh Gazette 1897 pp. 25, 53, 185, 221, 273, 433, 511, 881, 1081, 1193, 1260  In the Irish revolutionary period the Conscription Crisis of 1918 led prime minister David Lloyd George to suggest replacing the Lord Lieutenant on an emergency basis with three Lords Justices.Travers 1981 pp.35, 85 It proved impossible to find three willing to serve; St John Brodrick, 1st Earl of Midleton was prepared to preside but demanded more control of policy than Lloyd George would cede.Travers 1981 pp.36, 38 "]}]}}