{"wiki_id": "http://www.wikidata.org/entity/Q1769189", "itemLabel": "William Gerhardie", "itemDescription": "British writer", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Gerhardie", "wikipedia_page": {"main": "William Alexander Gerhardie OBE FRSL (21 November 1895 – 15 July 1977) was an Anglo-Russian novelist and playwright. His first novel, Futility (1922), drew on his experiences of fighting the Bolsheviks in pre-revolutionary Russia.", "link_mentions": [{"page": "Anton Chekhov", "response": ["For the writer William Boyd, Chekhov's historical accomplishment was to abandon what William Gerhardie called the \"event plot\" for something more \"blurred, interrupted, mauled or otherwise tampered with by life.\"\"For the first time in literature the fluidity and randomness of life was made the form of the fiction. Before Chekhov, the event-plot drove all fictions.\" William Boyd, referring to the novelist William Gerhardie's analysis in Anton Chekhov: A Critical Study, 1923. \"A Chekhov Lexicon\" by William Boyd, The Guardian, 3 July 2004. Retrieved 16 February 2007."]}, {"page": "Russian Civil War", "response": ["* Futility (1922) by William Gerhardie"]}, {"page": "Polyglot (disambiguation)", "response": ["* The Polyglots, a 1925 novel by Anglo-Russian William Gerhardie"]}, {"page": "1922 in literature", "response": ["*William Gerhardie – Futility"]}, {"page": "1925 in literature", "response": ["* William Gerhardie – The Polyglots"]}, {"page": "Harriet Cohen", "response": ["William Gerhardie cast Cohen as the heroine Helen Sapphire in the book Pending Heaven and much of what is written mirrors Cohen's own life and character as well as her turbulent relationship with Gerhardie.  Helen Sapphire is a musician who performs successfully all over Europe. She plays the harp and the piano. Gerhardie personified himself in the central character of Max who dreams about Helen."]}, {"page": "Olivia Manning", "response": ["After living in a series of rented flats, in 1951 the couple moved to a house in St. John's Wood, where they sublet rooms to lodgers such as the actors Julian Mitchell and Tony Richardson. Fuelled by plenty of gin and tonic to cover her shyness, Manning could be a witty participant in London's literary scene; as in childhood she was given to making boastful inventions, such as claiming a family relationship to Marie Belloc Lowndes and that she had received a marriage proposal from Anthony Burgess the morning after his wife's death. Her insecurities also showed in other ways: she was very anxious about finances, and always alert for ways to make and save money. After the war both she and Smith were unfaithful. At parties, Smith would regularly ask other women if they were interested in extramarital encounters, while Manning claimed to have had affairs with both William Gerhardie and Henry Green, and engaged in an unrequited pursuit of her lodger, Tony Richardson. Jerry Slattery, her doctor, became her long-term lover; her affair came as a shock to Smith, who felt he must have disappointed his wife. After a difficult start, Smith adjusted and soon became a close friend of Slattery. Manning's adultery in some ways made it easier for Smith to justify his own frequent affairs, including his longstanding relationship with Diana Robson, who was to become his second wife. Manning never paid undue attention to his infidelities, usually responding, \"you know what Reggie's like\". The two never contemplated divorce, believing that marriage was a lifelong commitment.", "In contrast to other women's war fiction of the period, Manning's works do not recount life on the home front. Instead, her Irish and Second World War fiction observe combatants and non-combatants at the front and behind the lines. Wars, in Manning's view, are battles for place and influence, and \"with her range of images and illusions, Manning reminds us that wars over land have been a constant\". Her books do not celebrate British heroism nor the innocence of civilians, emphasising instead that the causes and dangers of war come as much from within as from without, with the gravest threats coming from fellow Britons. Military men are far from heroic, and official British responses are presented as farcical. In the Fortunes of War, the conflict is viewed largely from the perspective of a civilian woman, an observer, though later books include Simon Boulderstone's soldier's view of battle. Views differ on her success in the Fortunes of War battlescenes; initial reviews by Auberon Waugh and Hugh Massie criticised them as implausible and not fully realised, but later commentators have describing her depiction of battle as vivid, poignant and largely convincing. Her books serve as an indictment of war and its horrors; William Gerhardie noted in 1954 of Artist among the Missing that \"it is war seen in a compass so narrowed down that the lens scorches and all but ignites the paper\". There is a strong focus of the impermanence of life; death and mortality are a constant presence and preoccupation for civilian and soldier alike, and repetition – of stories, events and deaths – used to give \"the impression of lives trapped in an endless war\" for which there is no end in sight."]}, {"page": "List of University of Cambridge people", "response": ["*William Gerhardie (unknown)"]}, {"page": "William Gerhardi", "response": ["#REDIRECT William Gerhardie"]}, {"page": "W. Gerhardie", "response": ["#REDIRECT William Gerhardie"]}, {"page": "W. Gerhardi", "response": ["#REDIRECT William Gerhardie"]}, {"page": "New Directions Publishing", "response": ["* William Gerhardie (Russia)"]}, {"page": "Devil in the arts and popular culture", "response": ["*William Gerhardie's Memoirs of Satan (1932, reprint edition by Faber and Faber, 2011. )"]}, {"page": "John Rothenstein", "response": ["John Rothenstein was born in London in 1901, the son of Sir William Rothenstein. The family was connected to the Bloomsbury Set. John Rothenstein studied at Worcester College, Oxford, and became friends with T. E. Lawrence. He shared rooms with novelist William Gerhardie.Dido Davies, \"William Gerhardie: A Biography\" "]}, {"page": "William Alexander Gerhardie", "response": ["#redirect William Gerhardie"]}, {"page": "Futility", "response": ["*Futility, a 1922 novel by William Gerhardie"]}, {"page": "Any Human Heart", "response": ["Boyd said he was partially inspired by the generation of English writers who matured between the wars: \"I am fascinated by the life and work of that generation of English writers who were born at the beginning of the century and reached maturity by the time of World War II. People like Evelyn Waugh and Graham Greene and Anthony Powell, obviously, but also less well known writers—Henry Green, Lawrence Durrell, Cyril Connolly and William Gerhardie. The last two in particular lurk closely behind Logan.\" Both real and imagined characters are blended into this context, where historical personages are typically used to concentrate the historical significance of a novel's plot, Mountstuart's encounters with them are superficial, leaving only an impression of both parties' small-mindedness. John Mullan found the conceit most effective during the New York journal, where Boyd satirises figures in the Abstract Expressionist movement during the 1950s \"whose characters seem almost beyond invention.\""]}, {"page": "Gianni Celati", "response": ["Celati has translated works by Jonathan Swift, William Gerhardie, Herman Melville, Stendhal, Louis Ferdinand Céline, Mark Twain, Roland Barthes, Jack London, Henri Michaux, Georges Perec, and others."]}, {"page": "Middlesex Hospital", "response": ["*William Gerhardie, novelist and playwright (1977)Article by Michael Holroyd."]}, {"page": "20th century in literature", "response": ["* Futility by William Gerhardie (Russia, England)"]}, {"page": "The Polyglots", "response": ["#REDIRECT William Gerhardie"]}, {"page": "Gerhardie, William", "response": ["#redirectWilliam Gerhardie"]}]}}