{"wiki_id": "http://www.wikidata.org/entity/Q176524", "itemLabel": "John Bright", "itemDescription": "British Radical and Liberal statesman 1811-1889", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Bright", "wikipedia_page": {"main": "John Bright (16 November 1811 – 27 March 1889) was a British Radical and Liberal statesman, one of the greatest orators of his generation and a promoter of free trade policies.\nA Quaker, Bright is most famous for battling the Corn Laws. In partnership with Richard Cobden, he founded the Anti-Corn Law League, aimed at abolishing the Corn Laws, which raised food prices and protected landowners' interests by levying taxes on imported wheat. The Corn Laws were repealed in 1846. Bright also worked with Cobden in another free trade initiative, the Cobden–Chevalier Treaty of 1860, promoting closer interdependence between Great Britain and the Second French Empire. This campaign was conducted in collaboration with French economist Michel Chevalier, and succeeded despite Parliament's endemic mistrust of the French.\nBright sat in the House of Commons from 1843 to 1889, promoting free trade, electoral reform and religious freedom. He was almost a lone voice in opposing the Crimean War; he also opposed William Ewart Gladstone's proposed Home Rule for Ireland. He saw himself as a spokesman for the middle class and strongly opposed the privileges of the landed aristocracy. In terms of Ireland, he sought to end the political privileges of Anglicans, disestablished the Church of Ireland, and began land reform that would turn land over to the Catholic peasants. He coined the phrase \"The mother of parliaments.\"", "link_mentions": [{"page": "Andrew Carnegie", "response": ["Carnegie was involved in philanthropic causes, but he kept himself away from religious circles. He wanted to be identified by the world as a \"positivist\". He was highly influenced in public life by John Bright.", "Influenced by his \"favorite living hero in public life\" John Bright, Carnegie started his efforts in pursuit of world peace at a young age,Autobiography, Ch. 21, pp. 282–83 and supported causes that opposed military intervention. His motto, \"All is well since all grows better\", served not only as a good rationalization of his successful business career, but also his view of international relations."]}, {"page": "Benjamin Disraeli", "response": ["For many years in his parliamentary career Disraeli hoped to forge a paternalistic Tory-Radical alliance, but he was unsuccessful. Before the Reform Act 1867, the working class did not possess the vote and therefore had little political power. Although Disraeli forged a personal friendship with John Bright, a Lancashire manufacturer and leading Radical, Disraeli was unable to persuade Bright to sacrifice his distinct position for parliamentary advancement. When Disraeli attempted to secure a Tory-Radical cabinet in 1852, Bright refused.Trevelyan, p. 207"]}, {"page": "Liberal Party (UK)", "response": ["As early as 1839, Russell had adopted the name of \"Liberals\", but in reality his party was a loose coalition of Whigs in the House of Lords and Radicals in the Commons. The leading Radicals were John Bright and Richard Cobden, who represented the manufacturing towns which had gained representation under the Reform Act. They favoured social reform, personal liberty, reducing the powers of the Crown and the Church of England (many Liberals were Nonconformists), avoidance of war and foreign alliances (which were bad for business) and above all free trade. For a century, free trade remained the one cause which could unite all Liberals."]}, {"page": "Capitalism", "response": ["Industrial Britain eventually abandoned the protectionist policy formerly prescribed by mercantilism. In the 19th century, Richard Cobden (1804–1865) and John Bright (1811–1889), who based their beliefs on the Manchester School, initiated a movement to lower tariffs. In the 1840s Britain adopted a less protectionist policy, with the 1846 repeal of the Corn Laws and the 1849 repeal of the Navigation Acts. Britain reduced tariffs and quotas, in line with David Ricardo's advocacy of free trade."]}, {"page": "Classical liberalism", "response": ["Classical liberalism was the dominant political theory in Britain from the early 19th century until the First World War. Its notable victories were the Catholic Emancipation Act of 1829, the Reform Act of 1832 and the repeal of the Corn Laws in 1846. The Anti-Corn Law League brought together a coalition of liberal and radical groups in support of free trade under the leadership of Richard Cobden and John Bright, who opposed aristocratic privilege, militarism, and public expenditure and believed that the backbone of Great Britain was the yeoman farmer. Their policies of low public expenditure and low taxation were adopted by William Gladstone when he became Chancellor of the Exchequer and later Prime Minister. Classical liberalism was often associated with religious dissent and nonconformism."]}, {"page": "Manchester", "response": ["Two large squares hold many of Manchester's public monuments. Albert Square has monuments to Prince Albert, Bishop James Fraser, Oliver Heywood, William Gladstone and John Bright. Piccadilly Gardens has monuments dedicated to Queen Victoria, Robert Peel, James Watt and the Duke of Wellington. The cenotaph in St Peter's Square is Manchester's main memorial to its war dead. Designed by Edwin Lutyens, it echoes the original on Whitehall in London. The Alan Turing Memorial in Sackville Park commemorates his role as the father of modern computing. A larger-than-life statue of Abraham Lincoln by George Gray Barnard in the eponymous Lincoln Square (having stood for many years in Platt Fields) was presented to the city by Mr and Mrs Charles Phelps Taft of Cincinnati, Ohio, to mark the part Lancashire played in the cotton famine and American Civil War of 1861–1865. A Concorde is on display near Manchester Airport."]}, {"page": "March 27", "response": ["*1889 – John Bright, English politician, Secretary of State for Business, Innovation and Skills (b. 1811)"]}, {"page": "November 16", "response": ["*1811 – John Bright, English academic and politician (d. 1889)"]}, {"page": "Parliament", "response": ["The British Parliament is often referred to as the Mother of Parliaments (in fact a misquotation of John Bright, who remarked in 1865 that \"England is the Mother of Parliaments\") because the British Parliament has been the model for most other parliamentary systems, and its Acts have created many other parliaments. Many nations with parliaments have to some degree emulated the British \"three-tier\" model known as the Westminster system. Most countries in Europe and the Commonwealth have similarly organised parliaments with a largely ceremonial head of state who formally opens and closes parliament, a large elected lower house and a smaller, upper house."]}]}}