{"wiki_id": "http://www.wikidata.org/entity/Q17627299", "itemLabel": "Michael Platt", "itemDescription": "Hedge Fund Manager", "wikipedia_url": "https://en.wikipedia.org/wiki/Michael_Platt_(financier)", "wikipedia_page": {"main": "Michael Edward Platt (born 12 December 1968) is a British billionaire hedge fund manager. He is the co-founder and managing director of BlueCrest Capital Management, Europe's third-largest hedge-fund firm which he co-founded in 2000.\nHe is Britain's wealthiest hedge fund manager according to the Bloomberg Billionaires Index, with an estimated wealth of US$10.2 billion.\n\n", "link_mentions": [{"page": "Hedge fund", "response": ["* Michael Platt of BlueCrest Capital Management (UK), Europe's third-largest hedge-fund firm "]}, {"page": "List of British billionaires by net worth", "response": ["|Michael Platt", "| 367 || Michael Platt || 4.5 billion || hedge funds"]}, {"page": "Wolfe von Lenkiewicz", "response": ["Lenkiewicz was represented by All Visual Arts Gallery directed by Joe la Placa. He painted in a 19th century Roman studio for several months and completed a life size reinterpretation of Théodore Géricault's Raft of the Medusa. After having left Italy, the monumental painting was exhibited at the London gallery AVA with the support of Michael Platt of BlueCrest Capital Management. "]}, {"page": "BlueCrest Capital Management", "response": ["BlueCrest Capital Management is a British-American hedge fund which was founded by British billionaire Michael Platt and  American William Reeves in 2000. The New York City-based company  has registered offices in Geneva, Singapore, Boston, Connecticut, Toronto, São Paulo, Hong Kong and Jersey.   BlueCrest Capital Management is Europe’s third-biggest hedge-fund firm, managing over £30 billion. The firm's employees are estimated to number c.600.", "Forbes estimated Michael Platt's net worth to be US$8 billion in 2019."]}, {"page": "Michael Platt (finance)", "response": ["#REDIRECT Michael Platt (financier)"]}, {"page": "Michael Platt", "response": ["Mike or Michael Platt may refer to:", "* Michael Platt (financier) (born 1968), financier", "* Michael Platt Jr. (born 1974), public official", "* Michael Platt (rugby league) (born 1984), Ireland international rugby league player"]}]}}