{"wiki_id": "http://www.wikidata.org/entity/Q17626643", "itemLabel": "Jackie Foster", "itemDescription": "English footballer (born 1903)", "wikipedia_url": "https://en.wikipedia.org/wiki/Jackie_Foster", "wikipedia_page": {"main": "John Thomas Foster (21 March 1903 – after 1936) was an English professional footballer and coach who played as an outside right. He made over 430 appearances in the Football League for seven clubs, most notably for Brentford, Halifax Town, Ashington and Barrow.", "link_mentions": [{"page": "Cecil Blakemore", "response": ["Blakemore and Bristol City teammate Jackie Foster signed for Third Division South club Brentford on 2 May 1929. He quickly established himself in the team, scoring 15 goals in 43 appearances during the 1929–30 season, a campaign in which the Bees set a record of 21 home wins. Blakemore made another 40 appearances the following year, scoring 13 goals, before leaving Brentford in May 1931. Blakemore scored 28 goals in 83 games during two seasons at Griffin Park."]}, {"page": "1929–30 Brentford F.C. season", "response": ["Brentford manager Harry Curtis tinkered with his squad in the 1929 off-season, releasing half backs Jack Beacham, Stephen Dearn and a number of young forwards who failed to make the grade during the previous season. In came full back Tom Adamson, half backs Reginald Davies (the new captain), Harry Salt and forwards Cecil Blakemore, Jackie Foster, Billy Lane and John Payne. Brentford went on to have their best season at that time in the Football League, ending 1929 in second place and ascending to the top of the Third Division South on 25 January 1930. The good results were due to a consistently fit starting XI, which went unchanged for 21 consecutive matches in all competitions between 2 November 1929 and 15 March 1930, a club record. Top spot was held onto until a 0–0 draw with Exeter City on 29 March saw Plymouth Argyle overtake the Bees and automatic promotion was effectively conceded after successive defeats in mid-April. Brentford finished as runners-up and would remain in the Third Division South for 1930–31. The Bees finished the season with four players scoring 15 goals or more – Billy Lane (33), Jack Lane (19), John Payne (16) and Cecil Blakemore (15).", "|Jackie Foster", "||| style=\"text-align:left;\" |Jackie Foster", "| style=\"text-align:left;\" |Jackie Foster||6||0||6", "| Jackie Foster"]}, {"page": "1930–31 Brentford F.C. season", "response": ["|Jackie Foster", "||| style=\"text-align:left;\" |Jackie Foster", "| style=\"text-align:left;\" |Jackie Foster||1||0||1"]}, {"page": "1931–32 Brentford F.C. season", "response": ["Brentford manager Harry Curtis' additions to his squad for the 1931–32 Third Division South season were minor – backup goalkeeper Dave Smith, amateur half back Jackie Gibbons and forwards George Cook, George Robson and Bert Stephens. The team had a very strong first half of the season, rising to the top of the table by 5 December 1931 and staying there until 13 February 1932, when a run of just five defeats in 31 matches in all competitions came to an end. Billy Lane kept up his prolific goalscoring form from the previous two seasons, scoring 20 goals in a 27 match spell, with Jackie Foster, Bill Berry and Jackie Gibbons also supporting with regular goals.", "|Jackie Foster", "||| style=\"text-align:left;\" |Jackie Foster", "| style=\"text-align:left;\" |Jackie Foster||12||0||12"]}, {"page": "1932–33 Brentford F.C. season", "response": ["|Jackie Foster", "||| style=\"text-align:left;\" |Jackie Foster", "| style=\"text-align:left;\" |Jackie Foster||2||0||2", "| Jackie Foster"]}, {"page": "History of Brentford F.C. (1889–1954)", "response": ["It was all change at Griffin Park during the 1926 off-season, with former Gillingham boss Harry Curtis being installed as manager. Just 9 members of the previous season's squad were retained, but despite mid-table finishes over the following three seasons, Curtis slowly rebuilt the squad with successful full back acquisitions William Hodge, Alexander Stevenson, half backs Jimmy Bain, Reginald Davies and forwards Bill Berry and Jack Phillips. The 1929–30 Third Division South season provided the foundation for the Bees' future success, with the club's unbeaten home record of 21 wins setting a national record which still stands today. Important future signings were made, including outside right Jackie Foster, centre forward Billy Lane, left back Tom Adamson and a masterstroke, local non-league centre half Joe James, who would go on to become one of the club's greatest midfielders. Though Brentford won a club-record 28 league matches, failure to mirror that form away from Griffin Park denied the club promotion to the Second Division after finishing as runners-up to Plymouth Argyle. Third and fifth-place finishes followed in the 1930–31 and 1931–32 seasons respectively, despite the sales of key forwards Jack Lane and Billy Lane, but a sound investment was made in inside forward George Robson, and the acquisition of England amateur international left half Jackie Burns proved to be a coup."]}]}}