{"wiki_id": "http://www.wikidata.org/entity/Q17626993", "itemLabel": "William Nott-Bower", "itemDescription": "British police commissioner", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Nott-Bower", "wikipedia_page": {"main": "Sir John William Nott-Bower, KCVO (20 March 1849 – 4 February 1939) was a British officer and Commissioner of the City of London Police.", "link_mentions": [{"page": "City of London Police", "response": ["*Captain Sir William Nott-Bower (1902–1925)"]}, {"page": "Siege of Sidney Street", "response": ["The posters of Gardstein proved effective, and late on New Year's Day a member of the public came forward to provide information about Svaars and Sokoloff. The informant told police that the men were hiding at 100 Sidney Street, along with a lodger, Betty Gershon, who was Sokoloff's mistress. The informant was persuaded to visit the property the following day to confirm the two men were still present. A meeting took place on the afternoon of 2 January to decide the next steps. Wensley, high-ranking members of the Metropolitan force and Sir William Nott-Bower, the Commissioner of the City Police, were present."]}, {"page": "John Nott-Bower", "response": ["Nott-Bower was the son of William Nott-Bower, then Chief Constable of Liverpool City Police and later Commissioner of the City of London Police, and the great  grandson of Major-General Sir William Nott. He was educated at Tonbridge School and joined the Indian Police Service by competitive examination in 1911. He was posted to the United Provinces and served there until 1921, when he returned to England to work at the India Office in London. On 21 June 1918 he was commissioned a Second Lieutenant in the Indian Army Reserve of Officers, he resigned the commission in 1922."]}, {"page": "Louisa Nott-Bower", "response": ["Yorke married Sir Edmund Ernest Nott-Bower (1853-1933), a barrister, in 1886, and they had three children, George, Marianne, and Reginald. William Nott-Bower, Chief Constable of the City of London Police, was her brother-in-law; her nephew, Sir John Nott-Bower, was a later Chief Constable. Louisa Nott-Bower died in London in 1925, aged 64 years.\"Lady Nott-Bower Ill\" Evening News (5 September 1925): 18. via Newspapers.com"]}, {"page": "Frederick Wodehouse", "response": ["In 1890 Wodehouse joined the City of London Police as Assistant Commissioner. In March 1902 he narrowly lost the election (by 95 votes to 100) of the Court of Common Council to replace Sir Henry Smith as Commissioner, although he had been Acting Commissioner since Smith's retirement at Christmas 1901.\"The New Commissioner of City Police\", The Times, 22 March 1902 He initially agreed to stay as deputy to the new Commissioner, Captain William Nott-Bower, but on 1 October 1902 he transferred to the Metropolitan Police as Assistant Commissioner (Executive), responsible for executive business, supplies and buildings. This post became known as Assistant Commissioner \"B\" after a fourth Assistant Commissioner was appointed in 1909. Wodehouse retired on 31 October 1918.J. F. Moylan, Scotland Yard and the Metropolitan Police, 1929"]}, {"page": "List of Vanity Fair (British magazine) caricatures (1910–1914)", "response": ["| 1911-09-2020 Sep 1911|| Nott-BowyerCapt Sir William Nott-Bower||City Police||RAY||M 1297||25px"]}, {"page": "William Nott Bower", "response": ["#REDIRECT William Nott-Bower"]}, {"page": "King Edward VII Police Coronation Medal", "response": ["*William Nott-Bower, Commissioner of the City of London Police."]}, {"page": "Nott-Bower, William", "response": ["#redirectWilliam Nott-Bower"]}]}}