{"wiki_id": "http://www.wikidata.org/entity/Q17626531", "itemLabel": "Catherine Raisin", "itemDescription": "British geologist", "wikipedia_url": "https://en.wikipedia.org/wiki/Catherine_Raisin", "wikipedia_page": {"main": "Catherine Alice Raisin (24 April 1855 – 13 July 1945) was one of the most important early female geologists in Britain. Her research was primarily in the field of microscope petrology and mineralogy. She was the Head of the Geology department at Bedford College for Women, in London for 30 years, and strived for women's equality in education. Raisin was the first woman in Britain to lead a university geology department. She was also the Head of the Botany department at the Bedford College for Women.\n\n", "link_mentions": [{"page": "Ida Slater", "response": ["After undertaking research, she was appointed a demonstrator for Catherine Raisin, employed to help run the department and laboratories, at the new laboratory rooms for geology and botany (established 1897) at Bedford College (London) in 1910. She held that post for two years."]}, {"page": "Catherine Alice Raisin", "response": ["#REDIRECT Catherine Raisin"]}, {"page": "Somerville Club", "response": ["#REDIRECT Catherine Raisin"]}, {"page": "Doris Reynolds", "response": ["Doris Livesey Reynolds was born on 1 July 1899 in Manchester, to parents Alfred Reynolds and Louisa Livesey. Her parents moved to Manchester from Belfast just before her birth. Reynolds first attended school in Essex, then going on to Bedford College, graduating with a degree in geology in 1920. Whilst at Bedford, she studied under two of the most famous female geologists of the time, Catherine Raisin and Gertrude Ellis, who encouraged her interest in petrology."]}, {"page": "Helen Marguerite Muir-Wood", "response": ["Born in Hampstead, England, Helen Marguerite Muir-Wood studied geology at the University of London's Bedford College under Catherine Raisin. In 1919, she took a part-time job at the London Natural History Museum, rising through the ranks of geology assistants to become, in 1955, the first woman appointed Deputy Keeper of Palaeontology for the museum. She officially retired in 1961 but continued to do some work at the museum for another four years."]}, {"page": "Raisin, Catherine Alice", "response": ["#redirect Catherine Raisin"]}, {"page": "Raisin (surname)", "response": ["* Catherine Raisin (1855–1945), British geologist"]}, {"page": "Miss C. A. Raisin", "response": ["#REDIRECT Catherine Raisin"]}, {"page": "Mary Kingdon Heslop", "response": ["Mary Kingdon Heslop was born and brought up in Egypt. She graduated in physics and geology from Armstrong College, Durham in 1906. She remained there as a research fellow. In 1909 she gained a M.Sc in 1909 for her work on igneous petrology, in which she pioneered the use of colour photomicrography and published several papers on the igneous dykes of Northern England. After becoming a demonstrator at Newcastle, she moved to Bedford College, London under Catherine Raisin. "]}]}}