{"wiki_id": "http://www.wikidata.org/entity/Q17626863", "itemLabel": "Michael Sherard", "itemDescription": "British fashion designer, later fashion academic", "wikipedia_url": "https://en.wikipedia.org/wiki/Michael_Sherard", "wikipedia_page": {"main": "Michael Sherard (17 July 1910 – 26 December 1998) was a British fashion designer and a member of the Incorporated Society of London Fashion Designers, which represented the British couture industry in the wartime and post-war years. Operating his own label from the 1940s to 1960s, he is remembered primarily for his evening and occasion gowns. He also helped train future British designers, including Caroline Charles, and was later a design academic.", "link_mentions": [{"page": "Berkhamsted School", "response": ["*Michael Sherard (1910–1998), born Malcolm Sherrard, fashion designer and academic "]}, {"page": "List of fashion designers", "response": ["* Michael Sherard"]}, {"page": "Albany (London)", "response": ["* Michael Sherard, fashion designer."]}, {"page": "Westminster School of Art", "response": ["* Michael Sherard, fashion designer"]}, {"page": "Incorporated Society of London Fashion Designers", "response": ["*Michael Sherard – 1949"]}, {"page": "Caroline Charles", "response": ["Charles did an apprenticeship at Michael Sherard's couture house, after which she worked with Mary Quant, and then worked for a year with the photographer Tony Rawlinson."]}, {"page": "Peter Russell (fashion designer)", "response": ["His chief assistant, Scottish-born Isa Macdonald, had studied at Chelsea School of Art and over time rose to become business manager and director – The Sydney Morning Herald described her as a key player, saying: \"Miss Macdonald dominates the House of Peter Russell\". The house also employed Michael Sherard – who would later set up his own successful couture house – as an assistant before the war."]}, {"page": "Murray Arbeid", "response": ["His first job was with a garment house in Wigmore Street, close to Oxford Street, where he earned 28 shillings and sixpence a week. In 1952, he was apprenticed to Michael Sherard, a member of the elite Incorporated Society of London Fashion Designers and known for his occasion and evening wear. Joining the firm a year before the coronation of Queen Elizabeth meant Arbeid was thrown into a busy environment as Britain's high society ladies refurbished their wardrobes.", "At Michael Sherard, Arbeid was taught by Mme Raymond, who had once been an apprentice of Madeleine Vionnet, and later the skilled dressmaker Alice Edwards – both of whom had impeccable Paris contacts as well as expertise. Edwards, in particular, helped Arbeid to develop his customer manner."]}, {"page": "List of people from Berkhamsted", "response": ["* Michael Sherard (1910–1998), born Malcolm Sherrard, fashion designer and academic"]}, {"page": "Sherard (name)", "response": ["* Michael Sherard (1910–1998), British fashion designer"]}, {"page": "Deaths in December 1998", "response": ["*Michael Sherard, 88, British fashion designer."]}, {"page": "Sherard, Michael", "response": ["#redirectMichael Sherard"]}]}}