{"wiki_id": "http://www.wikidata.org/entity/Q1772954", "itemLabel": "Steve Barker", "itemDescription": "British film director and screenwriter", "wikipedia_url": "https://en.wikipedia.org/wiki/Steve_Barker_(film_director)", "wikipedia_page": {"main": "Steve Barker (born 4 April 1971) is an English film director and screenwriter. He wrote and directed the short-film Magic Hour (2002) starring John Simm. In 2008 he made his directorial feature film debut Outpost, starring Ray Stevenson and Richard Brake.", "link_mentions": [{"page": "List of zombie films", "response": ["| Outpost || Steve Barker || 2008 || || ", "| Outpost: Black Sun || Steve Barker || 2012 || || ", "| The Rezort || Steve Barker || 2015 || || "]}, {"page": "Outpost (2008 film)", "response": ["Outpost is a 2008 British war horror film, directed by Steve Barker and written by Rae Brunton, about a rough group of experienced mercenaries who find themselves fighting for their lives after being hired to take a mysterious businessman into the woods to locate a World War II-era military bunker."]}, {"page": "42nd Writers Guild of America Awards", "response": ["* Not Necessarily the News (HBO) – Nancy Harris, Larry Arnstein, Steve Barker, Joe Guppy, Matt Neuman, Duncan Scott McGibbon, Jon Ross, Lane Sarasohn, Steve Young, Merrill Markoe, Tom Kramer, Peter Ocko"]}, {"page": "Roman Osin", "response": ["| Steve Barker"]}, {"page": "List of British films of 2007", "response": ["|Outpost||Steve Barker ||Ray Stevenson, Julian Wadham||Horror ||"]}, {"page": "Theo Green", "response": ["In 2009 Theo Green wrote the score for Warp Films' thriller Hush,: TCM Turner Classic Movies. directed by Mark Tonderai. In 2012 he teamed up with Mark Tonderai a second time for the Jennifer Lawrence-starring suspense thriller, House at the End of the Street, creating a score that was awarded the ASCAP PRS Film Award. The film occupied the top position at the US Box Office on its opening weekend, going on to make over $45m from a budget under $7m.The Numbers: House at the End of the Street Box Office Since then, Green has composed the scores for Kidulthood director Menhaj Huda's Comedown, Steve Barker's follow up to his film \"Outpost\" - Outpost: Black Sun and Shan Khan's Honour starring Paddy Considine."]}, {"page": "James Seymour Brett", "response": ["Brett also scored the music for the horror feature Outpost, directed by Steve Barker. In addition, Brett has written, orchestrated and conducted for the 2007 releases of Transformers for DreamWorks and The Nanny Diaries for The Weinstein Company.", "| Steve Barker"]}, {"page": "List of horror films of 2008", "response": ["| Steve Barker || Julian Rivett, Ray Stevenson, Richard Brake || United Kingdom || "]}, {"page": "List of people from Blackpool", "response": ["*Steve Barker (born 1971), film director and screenwriter"]}, {"page": "List of British films of 2012", "response": ["|| Director: Steve Barker   Cast: Catherine Steadman, Richard Coyle, Clive Russell, Michael Byrne, Johnny Meres"]}, {"page": "List of films broadcast by Horror Channel", "response": ["| Steve Barker"]}, {"page": "List of World War II science fiction, fantasy, and horror films", "response": ["|Steve Barker", "|Steve Barker"]}, {"page": "Steve Barker", "response": ["* Steve Barker (film director), (born 1971), English film director and screenwriter", "* Steve Barker (soccer), (born 1967), South African footballer "]}, {"page": "Outpost: Black Sun", "response": ["Outpost: Black Sun, also known as Outpost 2, is a 2012 British horror film directed by Steve Barker, based on a script written by himself and Rae Brunton. It is a sequel to Barker's 2008 film Outpost. The film was later followed by Outpost: Rise of the Spetsnaz, the third entry in the series."]}, {"page": "Outpost: Rise of the Spetsnaz", "response": ["Outpost: Rise of the Spetsnaz, also known as Outpost 3, is a 2013 British sci-fi horror film and is the third and final entry in the Outpost film series. Unlike its predecessors Outpost and Outpost: Black Sun, Rise of the Spetsnaz was not directed by Steve Barker and was instead directed by Kieran Parker, who had served as a producer on both of the prior films. The film had its world premiere on 27 June 2013 at the Edinburgh International Film Festival. Rise of the Spetsnaz serves as a prequel to the series and is set during World War II and expands upon the creation of the invincible supernatural soldiers."]}, {"page": "Zacarías M. de la Riva", "response": ["In 2015, he composed music for three feature films. One was Mexican animated film, Un Gallo con Muchos Huevos, which was the first Mexican animated movie to receive a wide release in United States. Another was French experimental film, Evolution, directed by Lucile Hadzihalilovic, which won the Special Jury Prize at San Sebastian’s film festival. The third was an English horror movie, The Rezort, directed by Steve Barker.", "| Steve Barker"]}, {"page": "The Rezort", "response": ["The Rezort is a 2015 British zombie horror film directed by Steve Barker and written by Paul Gerstenberger. It stars Dougray Scott, Jessica De Gouw and Martin McCann.  After humanity wins a devastating war against zombies, the few remaining undead are kept on a secure island, where they are hunted for sport.  When something goes wrong with the island's security gates, the zombies attack the guests and the world faces the possibility of a new outbreak."]}, {"page": "Barker, Steve", "response": ["#redirectSteve Barker (film director)"]}, {"page": "Writers Guild of America Award for Television: Best Comedy/Variety – Specials", "response": ["| Not Necessarily the News || Nancy Harris, Larry Arnstein, Steve Barker, Joe Guppy, Matt Neuman, Duncan Scott McGibbon, Jon Ross, Lane Sarasohn, Steve Young, Merrill Markoe, Tom Kramer, Peter Ocko || HBO"]}]}}