{"wiki_id": "http://www.wikidata.org/entity/Q1779020", "itemLabel": "Godric of Finchale", "itemDescription": "English merchant and saint", "wikipedia_url": "https://en.wikipedia.org/wiki/Godric_of_Finchale", "wikipedia_page": {"main": "Godric of Finchale (or St Goderic) (c. 1070 – 21 May 1170) was an English hermit, merchant and popular medieval saint, although he was never formally canonised. He was born in Walpole in Norfolk and died in Finchale in County Durham.\n\n", "link_mentions": [{"page": "List of saints", "response": ["| Godric of Finchale"]}, {"page": "1170", "response": ["* May 21 – Godric of Finchale, English hermit and merchant "]}, {"page": "Pilgrim", "response": ["*Godric of Finchale"]}, {"page": "Durham, England", "response": ["*Godric of Finchale (c. 1065–1170), popular medieval saint, briefly served as doorkeeper at St Giles Hospital in Durham before becoming a hermit."]}, {"page": "Frederick Buechner", "response": ["The Book of Bebb tetralogy proved to be one of Buechner's most well-known works. Published in the years from 1972–1977, it brought Buechner to a much wider audience, and gained him very positive reviews (Lion Country, the first book in the series, was a finalist for the National Book Award in 1971). Of writing the series, Buechner says: \"I had never known a man like Leo Bebb and was in most ways quite unlike him myself, but despite that, there was very little I had to do by way of consciously, purposefully inventing him. He came, unexpected and unbidden, from a part of myself no less mysterious and inaccessible than the part where dreams come from; and little by little there came with him a whole world of people and places that was as heretofore unknown to me as Bebb was himself.\"Buechner, Frederick (1982). Now and Then: A Memoir of Vocation. HarperSanFrancisco. p. 97.  In this series, Buechner experimented for the first time with first-person narrative, and discovered that this, too, opened new doors. His next work, Godric, published in 1980, was nominated for the Pulitzer Prize. The novel, a historical fiction, is written in the first person from the perspective of Saint Godric of Finchale, a 12th-century English hermit."]}, {"page": "Godric", "response": ["*Godric of Finchale (c. 1060–1170), Anglo-Saxon saint", "* Godric (novel), a 1981 Pulitzer-nominated book by Frederick Buechner about Godric of Finchale"]}, {"page": "Godric (novel)", "response": ["Godric is the tenth novel by the American author and theologian, Frederick Buechner. Set in the eleventh and twelfth centuries, the novel tells the semi-fictionalised life story of the medieval Roman Catholic saint, Godric of Finchale.  It was first published in 1980 by Atheneum, New York, and was a finalist for the 1981 Pulitzer Prize."]}]}}