{"wiki_id": "http://www.wikidata.org/entity/Q177346", "itemLabel": "Charles Granville Bruce", "itemDescription": "British mountain climber", "wikipedia_url": "https://en.wikipedia.org/wiki/Charles_Granville_Bruce", "wikipedia_page": {"main": "Brigadier-General The Honourable Charles Granville Bruce, CB, MVO (7 April 1866 – 12 July 1939) was a veteran  Himalayan mountaineer and leader of the second and third British expeditions to Mount Everest in 1922 and 1924. In recognition of the former he was awarded a special prize at the conclusion of the first ever Winter Olympics.", "link_mentions": [{"page": "Henry Bruce, 1st Baron Aberdare", "response": ["* the youngest was the mountaineer Charles Granville Bruce. "]}, {"page": "Mountaineering", "response": ["In 1899, 1903, 1906, and 1908 American mountaineer Fanny Bullock Workman (one of the first professional female mountaineers) made ascents in the Himalayas, including one of the Nun Kun peaks (). A number of Gurkha sepoys were trained as expert mountaineers by Charles Granville Bruce, and a good deal of exploration was accomplished by them."]}, {"page": "1924 Winter Olympics", "response": ["At the closing of the Games, a prize was awarded for a sport that did not lend itself to tournament competition: Pierre de Coubertin presented a prize for 'alpinisme' (mountaineering) to Charles Granville Bruce, the leader of the British expedition that had attempted to climb Mount Everest in 1922."]}, {"page": "List of Old Harrovians", "response": ["*Brigadier-General Charles Granville Bruce (1866–1939)Harrow, 1800–1911, p. 562"]}, {"page": "Timeline of Mount Everest expeditions", "response": ["The second British expedition, under General Charles Granville Bruce and climbing leader Lt-Col. Edward Lisle Strutt, and containing Mallory, returned for a full-scale attempt on the mountain. On May 22, they climbed to 8,170 m (26,800 ft) on the North Ridge before retreating. They were the first humans to climb above  on a mountain.  The scope of this accomplishment is reflected by the fact that there are only 14 mountains on earth—the eight-thousanders—that reach and exceed 8,000 metres. At that moment, Mallory and Strutt had exceeded the summit of all but five other mountains on the planet."]}, {"page": "Kenneth Mason (geographer)", "response": ["* Charles Granville Bruce"]}, {"page": "Charles Bruce", "response": ["* Charles Granville Bruce (1866–1939), British mountaineer"]}, {"page": "Alpine Club (UK)", "response": ["*1923–1926: Charles Granville Bruce"]}, {"page": "George Finch (chemist)", "response": ["A member of the second British expedition under General Charles Granville Bruce to Mount Everest, on 23 May 1922 Finch and Captain Geoffrey Bruce reached an elevation of 27,300 feet (8,321 m) on the north ridge before retreating.Capt. C. Geoffrey Bruce Finch fell out with the Everest Committee after 1922, but his pioneering work on oxygen, which he pursued with messianic zeal, remained crucial to future expeditions. In the Alps, Finch was on the first ascent of the North Face Diagonal or \"Finch Route\" on the Dent d'Hérens, which he climbed with T. G. B. Forster and R. Peto on 2 August 1923. Finch was also a keen skier and was a founding member of the Alpine Ski Club in 1908. He was a lifelong advocate and supporter of the Alpine Club and would later become its president."]}, {"page": "Philip Napier Miles", "response": ["Philip Napier Miles JP DLitt h.c. (Bristol) (21 January 1865 – 19 July 1935) was a prominent and wealthy citizen of Bristol, UK, who left his mark on the city, especially on what are now its western suburbs, through his musical and organisational abilities and through good works of various kinds. He was the only son of Philip William Skynner Miles (1816–1881), a major promoter and developer of the docks at Avonmouth, who was the eldest son of Philip John Miles (1773–1845) by his second marriage to Clarissa Peach (1790–1868), and Pamela Adelaide Napier, daughter of the soldier (distinguished in the Peninsular War) and military historian General Sir William Francis Patrick Napier. He was therefore half-nephew of Sir William Miles, 1st Baronet, half-cousin of Sir Philip John William Miles, 2nd Baronet, both Conservative politicians, and cousin of the fashionable portrait painter Frank Miles, gentleman cricketer Robert Miles and Mount Everest explorer, General The Hon Charles Granville Bruce. He was educated at Harrow School and Oriel College, Oxford, and was selected as High Sheriff of Gloucestershire for 1916–17."]}, {"page": "1866 in Wales", "response": ["*7 August — Charles Granville Bruce, mountaineer (died 1939)"]}, {"page": "Edward F. Norton", "response": ["In 1924, he took over leadership of the expedition when General Charles Granville Bruce fell ill, and Norton was praised for handling affairs in the aftermath of the disappearance of George Mallory and Andrew Irvine."]}, {"page": "Hugh Ruttledge", "response": ["In 1933 permission was granted to the British by the authorities in Tibet for a further attempt on the mountain. The Mount Everest Committee's task of finding a leader for this, the fourth British expedition, was made difficult by the incapacity of Charles Granville Bruce (the leader of previous British expeditions to the mountain), and the unwillingness of Major Geoffrey Bruce and Brigadier E. F. Norton to assume the role. As Ruttledge wrote, 'it was necessary to find someone with experience of Himalayan peoples as well as with mountaineering knowledge, and eventually the lot fell upon me'.Hugh Ruttledge, \"The Mount Everest Expedition, 1933\", The Geographical Journal, Vol. 83, No. 1 (Jan. 1934), p. 1"]}, {"page": "World altitude record (mountaineering)", "response": ["Nine years later, another claim to the world altitude record was made by Martin Conway in the course of his expedition to the Karakoram in 1892. Together with Matthias Zurbriggen and Charles Granville Bruce, Conway made an attempt on Baltoro Kangri and on 25 August reached a subsidiary summit which he named Pioneer Peak. The barometer showed a height of 22,600 ft (6,900 m) which Conway optimistically rounded up to 23,000 ft (over 7,000 m). However, Pioneer Peak has since been measured at only ."]}, {"page": "John Morris (anthropologist)", "response": ["Morris served in the army from 1915 to 1934. After serving in the trenches during the First World War, he transferred to the Indian Army's 3rd Gurkha Rifles.Transcript of Desert Island Discs appearance, in BBC archives He took part in two attempts to climb Mount Everest; the first under General Charles Granville Bruce and climbing leader Lt-Col Edward Lisle Strutt in 1924, and the second in 1936 under Hugh Ruttledge. On the latter, his personal servant was Tenzing Norgay, who made the first ascent of Mount Everest with Edmund Hillary in 1953."]}, {"page": "Grande Médaille d'Or des Explorations", "response": ["|Charles Granville Bruce|| for the Everest Expedition of 1922"]}]}}