{"wiki_id": "http://www.wikidata.org/entity/Q17742094", "itemLabel": "David Miers", "itemDescription": "British diplomat", "wikipedia_url": "https://en.wikipedia.org/wiki/David_Miers", "wikipedia_page": {"main": "Sir Henry David Alastair Capel Miers  (born 10 January 1937), commonly known as Sir David Miers, is a British retired ambassador.", "link_mentions": [{"page": "Islamic Jihad Organization", "response": ["* 20 September 1984. 1984 U.S. embassy annex bombing. In Christian East Beirut the US embassy was bombed by a suicide van bomber with 3000 pounds of explosives. 14 were killed, including two Americans, and dozens were injured. They had moved to a \"quiet residential suburb of hillside villas and luxury apartments\" after the 1983 bombing.  Ambassador Reginald Bartholomew and visiting British Ambassador David Miers were buried under rubble but rescued with only minor injuries.  Islamic Jihad took credit in an anonymous phone call vowing, \"The operation comes to prove that we will carry out our previous promise not to allow a single American to remain on Lebanese soil. ... we mean every inch of Lebanese territory. ...\"Wright, Robin, Sacred Rage, Simon & Schuster, 2001, p. 107"]}, {"page": "Miers", "response": ["*Sir David Miers (born 1937), British ambassador"]}, {"page": "List of ambassadors of the United Kingdom to the Netherlands", "response": ["* 1993–1996: Sir David Miers"]}, {"page": "List of ambassadors of the United Kingdom to Greece", "response": ["*1989–1993: Sir David Miers"]}, {"page": "List of ambassadors of the United Kingdom to Lebanon", "response": ["*1983–1985: Sir David Miers"]}, {"page": "1984 United States embassy annex bombing in Beirut", "response": ["The explosion \"ripped off the front of the embassy, shredding glass, bending steel bars and destroying cars in a nearby parking lot.\" The attack killed a total of 24 people (including the suicide bomber). Only two of the dead were American: Chief Warrant Officer Kenneth V. Welch of the U.S. Army and Petty Officer 1st Class Michael Ray Wagner of the U.S. Navy, who were both assigned to the U.S. Defense Attache Office in Beirut. The majority of those killed were Lebanese, \"either local employees or people seeking visas\". Of the injured, the U.S. Ambassador, Reginald Bartholomew, was slightly hurt, as well as the British Ambassador, David Miers, who was meeting with Bartholomew at the time of explosion."]}, {"page": "Sir David Miers", "response": ["#REDIRECT David Miers"]}, {"page": "Miers, David", "response": ["#redirectDavid Miers"]}]}}