{"wiki_id": "http://www.wikidata.org/entity/Q177315", "itemLabel": "Jim Clunie", "itemDescription": "Scottish footballer and manager (1933-2003)", "wikipedia_url": "https://en.wikipedia.org/wiki/Jim_Clunie", "wikipedia_page": {"main": "Jim Clunie (4 September 1933 — 12 May 2003) was a Scottish football player and manager.\nClunie played in three cup finals for Aberdeen. These were the 1954 and 1959 Scottish Cup Finals, which they lost 2–1 to Celtic and 3–1 to St Mirren, and the 1955 Scottish League Cup Final which Aberdeen won 2–1 against St Mirren. He transferred to St Mirren in 1960, for whom he played in the 1962 Scottish Cup Final.\nClunie was the first player to be substituted in a Scottish match, when he was replaced by Archie Gemmill after 23 minutes of the Scottish League Cup tie against Clyde on 13 August 1966.In 1976, Clunie was a coach at Southampton when the club won the FA Cup by beating Manchester United 1-0 in the 1976 FA Cup Final.Clunie went on to manage St Mirren from 1978 to 1981, replacing Alex Ferguson. He took St Mirren into Europe for the first time ever after they finished third in the league in 1981. Clunie also managed Kilmarnock from 1981 to 1985.", "link_mentions": [{"page": "Grimsby Town F.C.", "response": ["|  Jim Clunie"]}, {"page": "St Mirren F.C.", "response": ["*Jim Clunie (June 1978 – Nov 80)"]}, {"page": "Archie Gemmill", "response": ["Gemmill was born in Paisley, Renfrewshire. His early career at St Mirren was ruined by a succession of injuries, not least a broken ankle in early 1966. He was sent on to replace Jim Clunie on 13 August 1966 in a Scottish League Cup tie at Shawfield to become the first tactical substitute in Scottish football history.Archie Gemmill player profile , www.stmirren.info Gemmill was sold for £13,000 to Preston North End."]}, {"page": "Substitute (association football)", "response": ["Archie Gemmill of St Mirren was the first substitute to come on in a Scottish first-class match, on 13 August 1966 in a League Cup tie against Clyde when he replaced Jim Clunie after 23 minutes."]}, {"page": "Billy Thomson (footballer, born 1958)", "response": ["Jim Clunie signed the 20-year-old for St Mirren for £50,000 in August 1978. He played for the Paisley club for six seasons, making 317 first team appearances. His debut was against Dumbarton in the League Cup. He broke through to the Scotland squad and was to collect seven full caps, all while with the Saints. Thomson enjoyed good form at club level, being well remembered particularly for UEFA Cup saves from AS Saint-Étienne's Johnny Rep and Laurent Roussey."]}]}}