{"wiki_id": "http://www.wikidata.org/entity/Q1778378", "itemLabel": "Jim O'Brien", "itemDescription": "association football player", "wikipedia_url": "https://en.wikipedia.org/wiki/Jim_O%27Brien_(footballer,_born_1987)", "wikipedia_page": {"main": "James John O'Brien (born 28 September 1987) is a professional footballer who plays as a central midfielder for Notts County.\nBorn in Scotland, he represented Ireland at youth international level.", "link_mentions": [{"page": "Coventry City F.C.", "response": ["|  Jim O'Brien", "|  John Fleck 47 Jim O'Brien 47"]}, {"page": "Liam Miller", "response": ["Miller was left without a club after the summer transfer window closed on 31 August 2009, and he was training with clubs in Ireland to maintain his fitness. He called Hibernian manager John Hughes to offer his services. Hughes, who was surprised that Miller was available to him on a free transfer, offered a two-year contract that Miller signed on 11 September. Miller quickly established himself in the Hibs first team, with Graham Spiers describing him as the \"king of Hibs\" after a 1–1 draw against Rangers at Ibrox. His early performances for Hibs were rewarded with the SPL player of the month award for October 2009. On 20 February, he was sent off in the first half of a 1–0 loss at Motherwell for fouling Jim O'Brien. Despite a downturn in form, Hibs finished fourth in the 2009–10 Scottish Premier League and qualified for European competition. Miller was named in the PFA Scotland Team of the Year for 2009–10."]}, {"page": "Jim O'Brien", "response": ["Jim O'Brien may refer to:", "*Jim O'Brien (basketball, born 1950), American coach for Emerson College, Ohio State and Boston College", "*Jim O'Brien (basketball, born 1951), American player for the New York Nets and Memphis Sounds", "*Jim O'Brien (basketball, born 1952), American coach for the Boston Celtics, Philadelphia 76ers, and Indiana Pacers", "*Jim O'Brien (American football) (born 1947), professional football player", "*Jim O'Brien (Australian footballer) (1936–1996), Australian rules footballer for St Kilda", "*Jim O'Brien (footballer, born 1987), Scottish footballer", "*Jim O'Brien (Limerick hurler) (born 1945), Irish hurler for Limerick", "*Jim O'Brien (Tipperary hurler), Irish hurler", "*Jim O'Brien (ice hockey) (born 1989), American ice hockey center", "*Jim O'Brien (director) (1947–2012), Scottish-born stage and television director", "*Jim O'Brien (reporter) (1939–1983), reporter and television personality", "*Jim O'Brien, founder and CEO of oil spill cleanup company The O'Brien's Group"]}, {"page": "Barry Robson", "response": ["On the final morning of the January 2008 transfer window, Robson was in negotiations to move to Celtic after they had a \"seven figure\" bid, plus Celtic player Jim O'Brien on loan until the end of the season, accepted by United. He signed for Celtic that evening."]}, {"page": "Martin Cranie", "response": ["In the 2013–14 season, Cranie was featured in the first team in the opening game of the season, a 4–0 loss against Wigan Athletic. However, Cranie was soon sidelined with a knee injury and was out for some time. After making his recovery, Cranie made his first team return, as a substitute in the 46th minute, in a 3–2 loss against Nottingham Forest on 14 September 2013. With the absence of Stephen Dawson, Cranie took over his captaincy temporarily and captained his first match – a 2–1 loss to Leicester City. Cranie provided an assist for Jim O'Brien, which turned out to be the only goal, in a 1–0 win over Millwall on 22 February 2014. Between 28 September 2013, and 11 March 2014, Cranie captained the club for half of the season until he suffered a hamstring tear during a match against Leicester City, requiring several weeks recovery. Cranie returned to the first team on 15 April 2014 in a 2–1 win over Charlton Athletic. After this, Cranie was featured for the last five games, but was unable to help the club survive relegation from the SkyBet Championship. Cranie was awarded the club's Players' Player of the Year for the second time by his teammates."]}, {"page": "James O'Brien(footballer)", "response": ["#REDIRECT Jim O'Brien (footballer, born 1987)"]}, {"page": "Chris Humphrey", "response": ["After Jim O'Brien moved to Barnsley in 2010, Humphrey began to play more regularly for the first team. In the Europa League third round against Aalesunds FK, Humphrey played a key role, providing an assist in both legs helping 'Well ease into to the next round. Having begun to nail down a regular place in the team, Humphrey scored his first goal for Motherwell, just three minutes into a 3–1 win against St Mirren. On 28 January 2011, Humphrey was offered a one-year extension to his contract, an offer he was delighted to accept. A few months later, on 30 March 2011, he scored his second goal of the season, in a Scottish Cup quarter-final replay against Dundee United, which Motherwell won 3–0 to send the club through to the semi-final. Days later, he scored his third goal of the season, in a 2–1 win over Aberdeen. Having previously gone 28 games without scoring, Humphrey incredibly made it 3 goals in 3 games when he scored against Dundee United in a 2–1 league win. In the final of the Scottish Cup, Humphrey started as Motherwell lost 3–0 against Celtic. After the match, Humphrey stated his disappointment at the loss, but praised his teammates and the fans."]}]}}