{"wiki_id": "http://www.wikidata.org/entity/Q17711612", "itemLabel": "Jak Alnwick", "itemDescription": "English footballer (born 1993)", "wikipedia_url": "https://en.wikipedia.org/wiki/Jak_Alnwick", "wikipedia_page": {"main": "Jak Alnwick (born 17 June 1993) is an English professional footballer who plays as a goalkeeper for Scottish Premiership side St Mirren.\nHe turned professional at Newcastle United in 2008, and went on to represent England at under-17 and under-18 levels. He spent time on loan at Gateshead in the 2011–12 season and played eight Premier League games for Newcastle in the 2014–15 season. He joined Bradford City on loan in March 2015, and Port Vale on a free transfer that August. He was sold to Rangers for an undisclosed fee in January 2017, though spent the 2018–19 season loan at Scunthorpe United after failing to earn a first-team place. He joined Blackpool on loan for the 2019–20 season. He joined St Mirren on a free transfer in June 2020.", "link_mentions": [{"page": "Prudhoe", "response": ["* Jak Alnwick, Footballer (Goalkeeper), who currently plays for Scottish premiership team St. Mirren, and his brother Ben Alnwick, Footballer (Goalkeeper), who played for Bolton Wanderers, were born in Prudhoe."]}, {"page": "Jak", "response": ["* Jak Alnwick (born 1993), English football goalkeeper"]}, {"page": "Michael Brown (footballer, born 1977)", "response": ["Bruno Ribeiro resigned as manager of Port Vale on 26 December 2016, and Brown was placed in temporary charge. Four days later Vale recorded a 1–0 home victory over Chesterfield in Brown's first match in charge. In the January transfer window he was forced to sell goalkeeper Jak Alnwick and reigning Player of the Year Anthony Grant, whilst top-scorer Alex Jones's loan deal expired and six other players left the club; Brown brought in youngsters Callum Guy, Tyler Walker, Olamide Shodipo, Axel Prohouly and Leo Fasan on loan, and signed Scott Tanser, Chris Eagles and Danny Pugh on free transfers. However his team were dogged by injury problems, and Brown told the media that if he could keep the Vale out of the relegation zone that would be an achievement \"off the scale\". Having scored just one goal in their final seven games, Vale were relegated at the end of the campaign after drawing their final game 0-0 with Fleetwood, finishing one point short of safety."]}, {"page": "Rob Page", "response": ["Page needed to avoid a poor start to the 2015–16 season as chairman Norman Smurthwaite warned he was prepared to make \"ruthless decisions\" if the club were struggling by September. Page made nine new signings during pre-season – Sam Kelly, Sam Foley, Anthony Grant, Ben Purkiss, Remie Streete, A-Jay Leitch-Smith, Jak Alnwick, Uche Ikpeazu, and Ryan Inniss – citing the need to sign players who \"desire success\". He was nominated for the League One Manager of the Month award in November following a sequence of three wins out of four which moved Vale to the fringes of the promotion race. However a defeat to League Two side Exeter City in the Second Round of the FA Cup brought speculation over Page's future as manager. He retained his position however, and was named as Football League manager of the week after his side overcame a 2–0 half-time deficit to beat Peterborough United 3–2 on 12 March. He led the club to a 12th-place finish he was linked with various management vacancies in the summer."]}, {"page": "Jamie Langfield", "response": ["Langfield was re-registered as a player and was on the bench for St Mirren's Scottish Premiership game against Hibernian in September 2020 after goalkeepers Jak Alnwick, Dean Lyness and Peter Urminsky were all ruled out due to COVID‑19 protocols."]}, {"page": "Tyne–Wear derby", "response": ["On 21 December 2014, Adam Johnson scored a late goal in the 90th minute past goalkeeper Jak Alnwick at St James' Park, ensuring that Sunderland had defeated Newcastle in four consecutive derbies - a new record and also Sunderland's third consecutive victory at St James' Park. On 5 April 2015 Sunderland again defeated Newcastle to make it five derby wins in a row and complete the double victory over Newcastle for a second consecutive season; Jermain Defoe scored from 22 yards on the stroke of half-time to give Sunderland victory. On 25 October 2015 Sunderland once again defeated Newcastle to make it a record sixth consecutive derby victory. A penalty from Adam Johnson opened the scoring which saw Newcastle down to 10 men with Fabricio Coloccini sent off as a result. Then a goal from Billy Jones and a Steven Fletcher volley sealed the win. The most recent meeting of the two sides, on 20 March 2016 at St James' Park, ended in a 1–1 draw, with Jermain Defoe opening the scoring for Sunderland before Aleksandar Mitrovic equalised for Newcastle."]}, {"page": "Chris Neal", "response": ["He missed the start of the 2015–16 season after picking up an ankle injury in pre-season, and only returned to match fitness at the end of October. He joined league rivals Doncaster Rovers on a 28-day loan on 1 February as manager Darren Ferguson looked to provide competition for Thorsten Stuckmann and Marko Maroši. Neal stated that he joined \"Donny\" in order to play first team football. He played two games at Keepmoat Stadium before his loan spell was ended by Port Vale on 20 February as injury to Jak Alnwick restored Neal to the Vale first team. He retained his first team place at Vale until on 18 March, when he joined Bury on loan until the end of the season. After making a good start to his time at Gigg Lane, he told the Bury Times that he hoped to join the club permanently on a free transfer. He was released by Port Vale upon the expiry of his contract at the end of the season. In December 2019, local newspaper The Sentinel ran a poll of fans to debate Port Vale's best goalkeeper of the 2010s; Neal finished in second-place with 30% of the vote, behind Scott Brown (44%) and ahead of Jak Alnwick (26%)."]}, {"page": "Bruno Ribeiro", "response": ["In June 2016, he was appointed manager of English League One club Port Vale on a three-year contract. He oversaw a complete overhaul of the playing staff, signing an influx of foreign talent including Rigino Cicilia, Anthony de Freitas, Kjell Knops, Calvin Mac-Intosch, Quentin Pereira, Kiko, Carlos Saleiro, Paulo Tavares, Chris Mbamba, Sébastien Amoros, Miguel Santos, and Gëzim Shalaj; as well as British players Anton Forrester and Jerome Thomas, Nathan Ferguson, and Martin Paterson; with Alex Jones and Sam Hart also joining on loan. However it would be 20-year old centre-back Nathan Smith who would prove to be the club's best player; Riberio handed him his debut on the opening day of the season, and Smith would retain his first-team place long after Riberio's departure. He appointed Jak Alnwick, Ben Purkiss and Anthony Grant as joint-captains, and got off to a good start by winning his first six home games at Vale Park. He was named as the Football League Paper's League One Manager of the Day after Vale defeated Scunthorpe United 3–1 on 27 August. However they entered Christmas in 17th-place, leaving chairman Norman Smurthwaite to declare that 'Plan B' had been triggered, meaning the signing of \"seasoned, higher grade\" players, whilst he admitted he felt \"a little bit hoodwinked\" as Ribeiro's friends in the game (José Mourinho, Aitor Karanka, and Carlos Carvalhal) had provided him with glowing references but had thus far failed to lend any of their players to the Vale. Ribeiro resigned as manager of Port Vale on 26 December, hours after witnessing his side lose 1–0 at home to Walsall. Assistant manager Michael Brown took charge on a caretaker basis, but could not arrest the decline as the club went on to be relegated at the end of the 2016–17 season."]}, {"page": "Newcastle United F.C. Reserves and Academy", "response": ["*2011: Jak Alnwick"]}, {"page": "Scott Brown (footballer, born April 1985)", "response": ["He was named on the EFL team of the week after keeping a clean sheet in a 1–0 win over local rivals Crewe Alexandra at Gresty Road on 2 November. The following month local newspaper The Sentinel named him as Port Vale's best goalkeeper of the 2010s following a public vote; he finished with 44% of the votes, ahead of Chris Neal (30%) and Jak Alnwick (26%). He made 45 appearances during the 2019–20 season, with Jonny Maddison standing in for just one EFL Trophy game."]}, {"page": "List of Bradford City A.F.C. players (1–49 league appearances)", "response": ["|Jak Alnwick||||2015||1||0||"]}, {"page": "Ben Purkiss", "response": ["New manager Bruno Ribeiro appointed Purkiss as joint-captain, along with Jak Alnwick and Anthony Grant, in July 2016.  He played 12 of the club's first 15 league matches of 2016–17, though was twice unexpectedly dropped from the matchday squad entirely despite not being injured on either occasion. Chairman Norman Smurthwaite confirmed that there had been an issue between Purkiss and Ribeiro. However it was reported that Purkiss was unable to return to the first team due to a shoulder injury. He made his return to action under caretaker-manager Michael Brown on 30 December, days after Ribeiro's resignation. Pukiss went on to state that he had been genuinely injured and that rumours of a falling out with Ribeiro were an exaggeration. Vale were relegated at the end of the season, after which Purkiss questioned the fitness and conditioning of the squad.  After a public vote held in December 2019, he was named by The Sentinel as Port Vale's third-best right-back of the 2010s with 11% of the vote, behind Adam Yates (62%) and James Gibbons (27%)."]}, {"page": "Sunderland A.F.C. Reserves and Academy", "response": ["* Jak Alnwick"]}, {"page": "2011–12 Newcastle United F.C. season", "response": ["|  Jak Alnwick"]}, {"page": "2012–13 Newcastle United F.C. season", "response": ["| Jak Alnwick"]}]}}