{"wiki_id": "http://www.wikidata.org/entity/Q17747175", "itemLabel": "Mark Pennington", "itemDescription": "Professor of Political Economy and Public Policy at King's College London", "wikipedia_url": "https://en.wikipedia.org/wiki/Mark_Pennington", "wikipedia_page": {"main": "Mark Pennington is a British political scientist and economist. He serves as a Professor of Political Economy and Public Policy at King's College London.", "link_mentions": [{"page": "Green belt", "response": ["Inherently partial critics include Mark Pennington and the economics-heavy think tanks such as the Institute of Economic Affairs who would see a reduction in many green belts. Such studies focus on widely inherent limitations of green belts. In most examples only a small fraction of the population uses the green belt for leisure purposes. The IEA study claims that a green belt is not strongly causally linked to clean air and water. Rather, they view the ultimate result of the decision to green-belt a city as one to prevent housing demand within the zone to be met with supply, thus exacerbating high housing prices and stifling competitive forces in general. "]}, {"page": "Institute of Economic Affairs", "response": ["* Mark Pennington, IEA Political Economy Fellow"]}, {"page": "List of people associated with the University of London", "response": ["* Mark Pennington (LSE & KCL)"]}, {"page": "Pennington (surname)", "response": ["* Mark Pennington, British political scientist", "* Bill Pennington (1956), William Mark Pennington, US journalist"]}, {"page": "Anti-globalization movement", "response": ["Members of the anti-globalization movement argue that positive data from countries which largely ignored neoliberal prescriptions, notably China, discredits the evidence that pro-globalists present. Concerning the parameter of per capita income growth, development economist Ha-Joon Chang argues that considering the record of the last two decades the argument for continuing neoliberal policy prescriptions are \"simply untenable\", and commented: \"It depends on the data we use, but roughly speaking, per capita income in developing countries grew at 3% per year between 1960 and 1980, but has grown only at about 1.5% between 1980 and 2000. And even this 1.5% will be reduced to 1%, if we take out India and China, which have not pursued liberal trade and industrial policies recommended by the developed countries.\"  Economist and political scientist Mark Pennington and NYU professor of economics William Easterly have individually accused Chang of employing strawman arguments, ignoring counter-data, and failing to employ basic scientific controls to his claims."]}, {"page": "Free Market Fairness", "response": ["In the peer-reviewed academic journal Critical Review: A Journal of Politics and Society, Mark Pennington, a Professor of Political Economy at King's College, London suggests the book \"offers a challenging and innovative case for classical liberalism.\"Mark Pennington, [Realistic Idealism and Classical Liberalism: Evaluating Free Market Fairness], Critical Review: A Journal of Politics and Society, 08 Oct 2014 In another peer-reviewed academic journal, The Journal of Politics, Eric MacGilvray, a Professor of Political Science at Ohio State University offered a similarly positive review, starting with \"I find a lot to praise in Free Market Fairness.\"Eric MacGilvray, , The Journal of Politics, Volume 75, Issue 02, April 2013 He went on to critique Tomasi's use of the word \"libertarian\" as both pro-free market and \"high liberal.\" Moreover, in The Mises Review, the journal of the libertarian think tank Ludwig von Mises Institute, David Gordon praised the book, adding \"every reader of his book will learn a great deal from it.\"David Gordon, Free Market Fairness , Mises Review, Volume 18, Number 1, January 2012"]}, {"page": "CEVRO Institute", "response": ["Friedrich von Wieser Memorial Prize recipients include: Robert Higgs (2006), Boudewijn Bouckaert (2007), Bruno Frey (2008), Richard Epstein (2010), Terry L. Anderson (2011), Michael Munger (2014), Mark Pennington (2016), Bruce Caldwell (2017), Leszek Balcerowicz (2018)."]}, {"page": "Pennington, Mark", "response": ["#redirectMark Pennington"]}]}}