{"wiki_id": "http://www.wikidata.org/entity/Q178195", "itemLabel": "Luke Moore", "itemDescription": "British association football player (b. 1986)", "wikipedia_url": "https://en.wikipedia.org/wiki/Luke_Moore", "wikipedia_page": {"main": "Luke Isaacc Moore (born 13 February 1986) is an English former professional footballer who played as a striker. Moore represented England at England U21 level and is the younger brother of former professional footballer Stefan Moore.", "link_mentions": [{"page": "February 13", "response": ["*1986 – Luke Moore, English footballer"]}, {"page": "Hodge Hill", "response": ["*Luke Moore, footballer attended Hodge Hill College"]}, {"page": "Stefan Moore", "response": ["He is a product of the Aston Villa Academy where he came through the ranks with his younger brother, Luke Moore, who went on to play for Aston Villa and other teams in the Premier League. Dropping into non-league football in his mid-twenties Moore became a prolific goalscorer at that level.", "He attended Hodge Hill Sports and Enterprise College, in Hodge Hill, Birmingham. He has a younger brother, Luke Moore who is a professional footballer, and the two were teammates at Aston Villa. Moore owned a taxi firm in Water Orton, Warwickshire, before selling it in 2015."]}, {"page": "List of foreign MLS players", "response": ["*Luke Moore – Chivas USA, Toronto – 2014–15"]}, {"page": "Ibrahima Sonko", "response": ["Sonko's first season in the Premier League was eventful. He received a straight red card against Aston Villa for tripping Luke Moore in the penalty area, meaning Reading lost 2–1. He was the subject of further controversy in a match against Chelsea on 14 October 2006, when his challenge left goalkeeper Carlo Cudicini unconscious. Cudicini was carried off the field wearing a neck brace. Sonko stated that he was scared after receiving death threats in connection with the Chelsea match. On 11 December 2006, Sonko signed an extension to his contract with Reading, keeping him at the Madejski Stadium until the summer of 2010. However, on 20 January 2007, he injured knee ligaments when he fell awkwardly whilst playing for Reading in their 3–1 home win against Sheffield United, and it was subsequently announced that he would miss the rest of the 2006–07 season. Sonko played a total of 23 times on 2006–07 as Reading ended the season in 8th position."]}, {"page": "Stephen Dobbie", "response": ["After Luke Moore was signed from West Bromwich Albion, Dobbie continued to be an unused substitute. On 22 February 2011, away to Coventry City, Dobbie appeared from the substitute's bench to score the only goal in a 1–0 victory. This was Dobbie's first goal in five months. On 8 March 2011, Dobbie opened the scoring with an early goal at home to Watford, as the match finished in a 1–1 draw. Dobbie scored three goals in the last two games of the season that helped the Swans finish third in the division.", "After the Swans were promoted to the Premier League, Dobbie made his league debut for the club in a 4–0 defeat versus Manchester City. Dobbie had seven appearances in the Premier League without scoring a goal. Dobbie twisted his left ankle under a challenge from Kyle Naughton and suffered an injury. Dobbie's injury kept him out of action for a week until he returned to action versus Manchester United. After eight appearances in the Premier League, Dobbie found himself down the pecking order behind strikers Danny Graham, Leroy Lita, Luke Moore and new signing Rory Donnelly. Finding his first-team appearances limited, manager Brendan Rodgers allowed Dobbie to leave on loan after his former club Blackpool had enquired about his availability. Birmingham City also enquired on his availability, although lack of finances meant that the club could only get Dobbie on loan with a view to a permanent deal at the end of his loan spell. However, neither the Blues nor the Seasiders signed him on loan before the close of the transfer window on 31 January 2012. After failing to find a loan deal in the January transfer window, Rodgers understood Dobbie's frustration at his lack of first-team opportunities, although he did not allow Dobbie to leave the club on loan, as he could be required to play in the first-team if other players were out injured."]}, {"page": "Kemy Agustien", "response": ["Ahead of the 2013–14 season, Agustien, along with Alan Tate, Luke Moore and Leroy Lita, was left out of the squad for the pre-season tour, which led their future uncertain. During July 2013, Agustien transferred to Championship club Brighton & Hove Albion signing a two-year contract, however the deal was delayed for a number of days whilst awaiting international clearance which was finally completed on 1 August. Agustien made his debut for Brighton during a pre-season friendly game against Norwich City which finished 1–1. He made 14 appearances in all competitions in his first season, but only 3 in his second, which was disrupted by injury. He was released when his contract expired at the end of the 2014–15 season."]}, {"page": "List of foreign Süper Lig players", "response": ["*Luke Moore – Elazığspor 2013–14"]}, {"page": "Aston Villa F.C. Under-23s and Academy", "response": ["In 1999–2000, the FA Premier Reserve League was set up, Villa were one of the founding members, and were split into the Northern section of the league. Three disappointing seasons followed, however in the 2003–04 season, inspired by brothers Stefan Moore and Luke Moore, Villa eased to their first title. In the two seasons which followed (2004–05 and 2005–06), Villa agonisingly finished both campaigns as runners-up, both times to Manchester United. In the 2006–07 season, for the first time since its introduction, the FA Premier Reserve League excluded Coca-Cola Championship teams from playing in the league, with the 20 senior English Premiership teams parallelling the teams involved in the FA Premier League. This also meant that due to geographical circumstances, Aston Villa Reserves were switched from the Northern Division, to the Southern equivalent, for the first time since the start of the original format in 1999. Villa eventually finished 4th - winning 9 out of their 18 games, with Luke Moore the top goalscorer, with 7. The season saw the impressive development of several youngsters, most notably including Zoltán Stieber, Shane Lowry and Stephen O'Halloran, all of which were rewarded with first-team opportunities in the pre-season fixtures, prior to the 2007–08 season.", "|Luke Moore"]}, {"page": "Marvin Chávez", "response": ["On December 16, 2011, Chávez was traded to the San Jose Earthquakes in exchange for allocation money.Quakes trade for FCD midfielder Marvin Chavez – San Jose Earthquakes He had a breakout season in 2012 for San Jose as he made 27 league appearances and recorded 3 goals and 13 assists in helping his new club capture the 2012 Supporters Shield. His stay in San Jose ended on January 7, 2014, when he was traded to the Colorado Rapids in exchange for his former FC Dallas teammate Atiba Harris. Colorado was not a good fit for Chávez. He played only 39 minutes for the club before being traded to Chivas USA on May 8, 2014, in exchange for Luke Moore."]}, {"page": "2008–09 Aston Villa F.C. season", "response": ["The club's first summer signing was the permanent capture of on-loan West Brom centre-back, Curtis Davies, in July, while their first sale was made in May, as Luke Moore completed a move to West Brom in an initial £3 million deal, after he had spent the second half of the 2007–08 season there on loan.", "Luke Moore made his loan move to West Bromwich Albion a permanent deal  Defender Olof Mellberg left the club to sign for Italian giants Juventus after seven years at Aston Villa. Thomas Sørensen was also released at the end of his contract after 5 years of service, Stoke City eventually signed the Denmark international on a free transfer. Twins Damian and Yago Bellon left Villa after 2 years with the club, as Damian signed for FC Vaduz in Liechtenstein, whilst Yago joined Swiss side FC St. Gallen. Elsewhere, Irish youngster Danny Earls joined American USL team Rochester Rhinos, and defender Erik Lund returned home to join IFK Göteborg in Sweden. Lund was the only released youngster who played for the first-team during his time with the club, coming on as a substitute in a pre-season victory over Walsall in August 2007. Shaun Maloney was the last to leave the club in the summer transfer window, returning to Celtic after a frustrating spell under Martin O'Neill.", "| Luke Moore"]}, {"page": "List of people with surname Moore", "response": ["*Luke Moore (born 1986), English footballer"]}, {"page": "All-time Chivas USA roster", "response": ["*  Luke Moore"]}, {"page": "Gale Agbossoumonde", "response": ["On May 8, 2014, Agbossoumonde was involved in a three-team trade when the Colorado Rapids traded Marvin Chávez to Chivas USA for Luke Moore, who was immediately traded by Colorado to Toronto FC for Agbossoumonde. At the conclusion of the 2014 season, Colorado declined Agbossoumonde's contract option for 2015."]}, {"page": "2009–10 West Bromwich Albion F.C. season", "response": ["|bgcolor=\"#CCFFCC\"| 15 Jul ||bgcolor=\"#CCFFCC\"| Nafta Lendava(Slovenian PrvaLiga) ||bgcolor=\"#CCFFCC\"| A ||bgcolor=\"#CCFFCC\"| W 3 – 0 ||bgcolor=\"#CCFFCC\"| – ||bgcolor=\"#CCFFCC\"| Luke Moore, Jonathan Greening, Jonas Olsson", "|bgcolor=\"#CCFFCC\"| 22 Jul ||bgcolor=\"#CCFFCC\"| Shrewsbury Town(Football League Two) ||bgcolor=\"#CCFFCC\"| A ||bgcolor=\"#CCFFCC\"| W 2 – 0 ||bgcolor=\"#CCFFCC\"| 2,437 ||bgcolor=\"#CCFFCC\"| Luke Moore, Robert Koren", "|bgcolor=\"#FFFFCC\"| 25 Jul ||bgcolor=\"#FFFFCC\"| Walsall(Football League One) ||bgcolor=\"#FFFFCC\"| A ||bgcolor=\"#FFFFCC\"| D 2 – 2 ||bgcolor=\"#FFFFCC\"| 4,358 ||bgcolor=\"#FFFFCC\"| Luke Moore, Craig Beattie"]}]}}