{"wiki_id": "http://www.wikidata.org/entity/Q178602", "itemLabel": "Laurence Payne", "itemDescription": "British actor and writer (1919-2009)", "wikipedia_url": "https://en.wikipedia.org/wiki/Laurence_Payne", "wikipedia_page": {"main": "Laurence Stanley Payne (5 June 1919 – 23 February 2009) was an English actor and novelist.", "link_mentions": [{"page": "Peter Finch", "response": ["*An Italian Straw Hat by Eugène Labiche and Marc Michel adapted by Thomas Walton, as Mons Beaujolais – Old Vic Theatre, London, 1953 – directed by Denis Carey with Laurence Payne, Paul Rogers, Jane Wenham, Gudrun Ure"]}, {"page": "The Three Musketeers", "response": ["*The Three Musketeers, a 1954 BBC adaptation in six 30-minute episodes, starring Laurence Payne, Roger Delgado, Paul Whitsun-Jones and Paul Hansard"]}, {"page": "The Murder of Roger Ackroyd", "response": ["Laurence Payne as Roger Ackroyd"]}, {"page": "Charles de Batz de Castelmore d'Artagnan", "response": ["*Laurence Payne in The Three Musketeers (TV serial) (1954)"]}, {"page": "The Two Gentlemen of Verona", "response": ["The first television adaptation was in 1952, when BBC Television Service broadcast Act 1 of the play live from the Bristol Old Vic. Directed by Denis Carey, the production starred John Neville as Valentine, Laurence Payne as Proteus, Gudrun Ure as Silvia and Pamela Ann as Julia."]}, {"page": "Sexton Blake", "response": ["ITV broadcast Rediffusion/Thames Television's Sexton Blake featuring Laurence Payne as Blake and Roger Foss as Tinker from Monday 25 September 1967 to Wednesday 13 January 1971.  In keeping with Sexton Blake's classic print adventures, Payne's Blake drove a white Rolls-Royce named \"The Grey Panther\" and owned a bloodhound named Pedro. The show was produced originally by Ronald Marriott for Associated Rediffusion, with Thames Television assuming production in 1968.", "During rehearsals for the show in 1968, Laurence Payne was blinded in his left eye by a rapier.", "* Laurence Payne as Sexton Blake"]}, {"page": "The Trollenberg Terror", "response": ["The Trollenberg Terror (released as The Crawling Eye in the United States) is a 1958 British science fiction drama film, produced by Robert S. Baker and Monty Berman, directed by Quentin Lawrence, that stars Forrest Tucker, Laurence Payne, Jennifer Jayne and Janet Munro. The special effects were handled by Les Bowie. The story was based on a 1956 British ITV \"Saturday Serial\" television programme\"'The Trollenberg Terror'.\" IMDb  Retrieved: 20 January 2015. written by George F. Kerr, Jack Cross and Giles Cooper, under the collective pseudonym of \"Peter Key\". The film was distributed in the UK by Eros Films Ltd. in October 1958 as The Trollenberg Terror, and in the US by Distributors Corporation of America as The Crawling Eye on 7 July 1958 as a double feature with fellow British sci-fi The Strange World of Planet X (a.k.a. Cosmic Monsters in the United States).", "* Laurence Payne as Philip Truscott"]}, {"page": "Johnny Ringo", "response": ["* The Gunfighters (1966), the seventh serial of the third season of Doctor Who, portrayed by Laurence Payne. Inaccurately depicted Ringo as one of the Cowboys killed in the Gunfight at the O.K. Corral."]}, {"page": "The Two Doctors", "response": ["The serial is set on an alien space station and in and around Seville. In the serial, the alien time traveller the Sixth Doctor (Colin Baker), his former travelling companion Jamie McCrimmon (Frazer Hines) and his current companion Peri Brown (Nicola Bryant) work to save the younger Second Doctor (Patrick Troughton) from the biogeneticist Dastari (Laurence Payne), who intends to steal the knowledge of how to travel in time from the Second Doctor's genetic make-up."]}, {"page": "Ill Met by Moonlight (film)", "response": ["*Laurence Payne as Manoli"]}, {"page": "Ben-Hur (1959 film)", "response": ["* Laurence Payne as Joseph"]}, {"page": "The Leisure Hive", "response": ["Laurence Payne had previously played Johnny Ringo in The Gunfighters (1966) and later played Dastari in The Two Doctors (1985). Nigel Lambert would later voice the 'Priest Triangle' in \"War of the Sontarans\" and \"Once, Upon Time\"."]}, {"page": "Barabbas (1961 film)", "response": ["* Laurence Payne as Disciple"]}, {"page": "The Gunfighters", "response": ["Laurence Payne later played Morix in The Leisure Hive (1980) and Dastari in The Two Doctors (1985). Lynda Baron would later appear in the serial Enlightenment (1983), in the role of Captain Wrack, and as Val in the 2011 episode \"Closing Time\"."]}, {"page": "The Three Musketeers in film", "response": ["*The Three Musketeers, a 1954 BBC adaptation in six 30-minute episodes, starring Laurence Payne, Roger Delgado, Paul Whitsun-Jones and Paul Hansard"]}, {"page": "Shakespeare: The Animated Tales", "response": ["* Laurence Payne as Duncan"]}, {"page": "The Pupil (short story)", "response": ["*The Pupil was adapted into a play, The Magpies, by Michael Dyne and performed as an episode in the ITV Television Playhouse drama (7 February 1957), starring Laurence Payne as Pemberton and Andrew Irvine as Morgan.The Magpies. Listed in Season 2 (1956-57) at the ITV Television Playhouse website. Retrieved on 17 August 2016"]}, {"page": "Vampire Circus", "response": ["* Laurence Payne as Professor Albert Müller", "Three of the cast - Laurence Payne, Adrienne Corri and Lalla Ward - would be reunited in the 1980 season of the British sci-fi/fantasy series Doctor Who in the serial The Leisure Hive. David Prowse, who later played Darth Vader in the first Star Wars trilogy, appears in a silent role as the circus strongman. Robin Sachs played the part of Ethan Rayne in Buffy the Vampire Slayer and as the space conqueror Sarris in the science-fiction comedy Galaxy Quest. Robin Sachs and Lynne Frederick also featured, as lovers Thomas Culpeper and Katherine Howard, in Henry VIII and his Six Wives (1973). In Stanley Kubrick's 1971 film of A Clockwork Orange, Corri had played the wife of writer F. Alexander, being ravaged by Alex and his droogs who left her husband crippled, to be shown later relying on the care of bodybuilder \"Julius\", portrayed by Prowse."]}, {"page": "Richard of Bordeaux", "response": ["For BBC radio, Griffith Jones played the young King in 1946. Probably because its brand of 1930s pacifism became discredited as appeasement, the play is rarely revived. However, Laurence Payne played the King at the old theatre at Guildford after the War, when Kenneth Williams was John Maudelyn. Gielgud himself reprised his stage role at the microphone in 1941 and 1952. Some of the latter broadcast can be heard on a commercially released recording of Gielgud's audio work. Martin Jarvis was well-received as Richard in a 1974 radio production. Gielgud wrote a letter of congratulation to Jarvis on his performance."]}, {"page": "Edgar Allan Poe in popular culture", "response": ["* The Tell-Tale Heart (1960) depicts Poe dreaming the story. Poe is played by Laurence Payne."]}, {"page": "The Tell-Tale Heart (1960 film)", "response": ["*Laurence Payne ..... Edgar Marsh"]}, {"page": "2009 in film", "response": ["| style=\"text-align:center;\"| 23 || Laurence Payne || style=\"text-align:center;\"| 89 || style=\"text-align:center;\"| UK || style=\"text-align:center;\"| Actor || "]}, {"page": "List of horror films of the 1950s", "response": ["| Quentin Lawrence || Forrest Tucker, Laurence Payne, Jennifer Jayne || United Kingdom ||"]}, {"page": "List of rediscovered films", "response": [" || Crosstrap || Robert Hartford-Davis || Laurence Payne || British B movie thriller much criticized at the time for its violence. The film vanished without trace for decades until a negative print was found in a film lab in the early 2010s."]}, {"page": "List of science fiction films of the 1950s", "response": ["|The Trollenberg Terror||Quentin Lawrence||Forrest Tucker, Laurence Payne, Janet Munro||United Kingdom||U.S. title: The Crawling Eye."]}, {"page": "List of British films of 1958", "response": ["|The Trollenberg Terror||Quentin Lawrence||Forrest Tucker, Laurence Payne||Science fiction||"]}, {"page": "List of British films of 1960", "response": ["|The Tell-Tale Heart||Ernest Morris ||Laurence Payne, Adrienne Corri||Horror ||"]}, {"page": "List of British films of 1961", "response": ["|The Court Martial of Major Keller||Ernest Morris||Laurence Payne, Susan Stephen||Drama||", "|The Third Alibi||Montgomery Tully||Laurence Payne, Patricia Dainton||Thriller||"]}, {"page": "List of British films of 1962", "response": ["|Crosstrap||Robert Hartford-Davis ||Laurence Payne, Jill Adams||Crime ||"]}, {"page": "There's a Girl in My Soup (play)", "response": ["The show was directed by Bob Chetwyn and the first cast featured Donald Sinden, Barbara Ferris, Jon Pertwee and Clive Francis. The producer was Michael Codron. The record-breaking success of the show put Codron on the map as a producer. In June 1967 the role of Robert Danvers was taken over by Gerald Flood, who played the role until December 1968, when Peter Byrne took over the role until 1970, when Charles 'Bud' Tingwell played the part until the show closed. The role of Andrew Hunter was played by William Franklyn, who was succeeded in June 1968 by Richard Coleman. The role of Marion was played by Belinda Carroll. In 1969 the play transferred to the Comedy Theatre, starring Peter Byrne, Karen Kessey and Richard Coleman. Karen Kessey played Marion for two years, never missing a performance.  Later the production starred Charles Tingwell, Gay Singleton and Richard Coleman. Richard Coleman understudied the role of Robert Danvers and played the part occasionally, when required to do so.  The play was taken out on a tour of the UK in 1973, with Danvers reprised by Gerald Flood, who ultimately played the role for over 650 performances. During the tour Andrew was played by Laurence Payne and John Hart Dyke and Marion was portrayed by Katy Manning and Anne Aston."]}, {"page": "Le Voyageur sans bagage", "response": ["*Gaston – Laurence Payne"]}, {"page": "Robert Marsden", "response": ["In Fry's The Boy with a Cart, he played one of the brothers in the West End with Richard Burton, and a different one on TV.  At the Guildford Repertory Theatre in 1951 he was Claudius to the Hamlet of Laurence Payne.  The leading critic J. C. Trewin wrote of him as a Claudius \"who, for all his draughts of Rhenish, was a regal statesman\". J. C. Trewin, Five & Eighty Hamlets (London: Hutchinson, 1987), pp. 79-80"]}, {"page": "Train of Events", "response": ["The second story, \"The Prisoner-of-War\", is about Richard (Laurence Payne) and Ella (Joan Dowling). He is a prisoner of war (POW) on the run who doesn't wish to return to Germany. They have hitherto endured a miserable secret life in assorted seedy lodgings and Ella is hoping they can start again abroad. However, she has stolen money from her landlady to pay her fare and there is only enough for one of them to emigrate. Selflessly, she intends it be him. ", "* Laurence Payne as Richard"]}, {"page": "King Duncan", "response": ["Vincent Regan played King Duncan in \"ShakespeaRe-Told\" Macbeth (2005), Ray Winstone in Macbeth on the Estate (1997), Laurence Payne in \"Shakespeare: The Animated Tales\" Macbeth (1992), Griffith Jones in A Performance of Macbeth (1979), and Jacques Mauclair in Macbett (1974), Kevin Coughlin on the \"Goodyear Television Playhouse\" (1955), and Lee Patterson on the \"Douglas Fairbanks, Jr., Presents\" Dream Stuff (1954).  Other television performers of the role include Philip Madoc (1998), Mark Dignam (1983), Powys Thomas (1961), Malcolm Keen (1960), Leo G. Carroll (1949), Arthur Wontner (1949)."]}, {"page": "The Court Martial of Major Keller", "response": ["The Court Martial of Major Keller is a 1961 British film directed by Ernest Morris and written by Brian Clemens. It stars Laurence Payne, Susan Stephen and Austin Trevor. The film recounts the court martial for murder of Major Keller, a British army officer during the Second World War. He is charged with killing his superior officer, but remains silent, refusing to defend himself.", "* Laurence Payne as Major Keller  "]}, {"page": "Deaths in February 2009", "response": ["*Laurence Payne, 89, British actor (Sexton Blake)."]}, {"page": "Embassy Theatre (London)", "response": ["*Hamlet, March 1953 with Laurence Payne in the title role,Laurence Payne obituary, The Times George Coulouris, Christine Finn"]}]}}