{"wiki_id": "http://www.wikidata.org/entity/Q1782136", "itemLabel": "Konrad Jarnot", "itemDescription": "English baritone", "wikipedia_url": "https://en.wikipedia.org/wiki/Konrad_Jarnot", "wikipedia_page": {"main": "Konrad Jarnot (born 1972) is an English baritone who works in opera and oratorio and is a notable performer of Lieder. He is a professor at the Robert Schumann Hochschule.", "link_mentions": [{"page": "Guildhall School of Music and Drama", "response": ["* Konrad Jarnot (born 1972), baritone"]}, {"page": "Sea Pictures", "response": ["*Konrad Jarnot (baritone), Reinild Mees (piano) Elgar: Complete Songs for Voice and Piano Vol. 1 Channel Classics Records CCS SA 27507"]}, {"page": "List of people from Brighton and Hove", "response": ["*Konrad Jarnot, opera singer"]}, {"page": "Adrianne Pieczonka", "response": ["* Erich Wolfgang Korngold: Complete Songs (Sämtliche Lieder). Konrad Jarnot, Reinild Mees, piano (2015, Capriccio)"]}, {"page": "ARD International Music Competition", "response": ["*1st Prize: Konrad Jarnot, Great Britain"]}, {"page": "Christoph Prégardien", "response": ["*J.S. Bach: Johannes-Passion BWV 245, Philippe Herreweghe, Collegium Vocale Gent, Christoph Prégardien, Konrad Jarnot (Vox Christi), Camilla Tilling, Ingeborg Danz, Jan Kobow, Peter Kooy 2007"]}, {"page": "A Song of Autumn", "response": ["*Elgar: Complete Songs for Voice & Piano Konrad Jarnot (baritone), Reinild Mees (piano)"]}, {"page": "Like to the Damask Rose", "response": ["*Elgar: Complete Songs for Voice & Piano Konrad Jarnot (baritone), Reinild Mees (piano)"]}, {"page": "Queen Mary's Song", "response": ["*Elgar: Complete Songs for Voice & Piano Konrad Jarnot (baritone), Reinild Mees (piano)"]}, {"page": "Come, Gentle Night!", "response": ["*Elgar: Complete Songs for Voice & Piano performed by Konrad Jarnot (baritone), with Reinild Mees (piano)"]}, {"page": "Ruth Ziesak", "response": ["In concert she appeared and recorded with the  and took part in the project of Ton Koopman to record the complete vocal works of Johann Sebastian Bach with the Amsterdam Baroque Orchestra & Choir. In 2011 she performed the Liebesliederwalzer of Brahms and Spanische Liebeslieder op. 138 of Schumann with Anke Vondung, Werner Güra and Konrad Jarnot at the Rheingau Musik Festival at Schloss Johannisberg.Auf Tränen folgt Sehnen / RMF II Schumanns Vokalquartette auf Schloss Johannisberg Axel Zibulski, Wiesbadener Tagblatt 15 July 2011 "]}, {"page": "Ingeborg Danz", "response": ["* J.S. Bach: Johannes-Passion BWV 245 BWV 245, Philippe Herreweghe, Collegium Vocale Gent, Christoph Prégardien (Evangelist), Konrad Jarnot (Vox Christi), Camilla Tilling, Ingeborg Danz, Jan Kobow, Peter Kooy 2007"]}, {"page": "Jan Kobow", "response": ["* J.S. Bach: Johannes-Passion BWV 245 BWV 245, Philippe Herreweghe, Collegium Vocale Gent, Christoph Prégardien (Evangelist), Konrad Jarnot (Vox Christi), Camilla Tilling, Ingeborg Danz, Jan Kobow, Peter Kooy 2007"]}, {"page": "Camilla Tilling", "response": ["*J.S. Bach: Johannes-Passion BWV 245 BWV 245, Philippe Herreweghe, Collegium Vocale Gent, Christoph Prégardien (Evangelist), Konrad Jarnot, Camilla Tilling, Ingeborg Danz, Jan Kobow, Peter Kooy 2007; Mozart's Great Mass in c minor K.427 [Paul McCreesh][Gabrieli Consort] 2005."]}, {"page": "Four Last Songs discography", "response": ["|2005 || Konrad Jarnot || Helmut Deutsch, piano"]}, {"page": "Werner Güra", "response": ["In 2011, he performed the Liebesliederwalzer of Brahms and Spanische Liebeslieder op. 138 of Schumann with Ruth Ziesak, Anke Vondung and Konrad Jarnot at the Rheingau Musik Festival at Schloss Johannisberg.Auf Tränen folgt Sehnen / RMF II Schumanns Vokalquartette auf Schloss Johannisberg Axel Zibulski, Wiesbadener Tagblatt 15 July 2011 "]}, {"page": "Vox Christi", "response": ["*Konrad Jarnot"]}, {"page": "Ulrich Cordes", "response": ["Cordes first studied sacred music at the Hochschule für Musik Köln (A-Exam in 2003) with Winfried Bönig and Margaretha Hürholz, among others. He continued studying voice. In 2005 he was able to study at the CNSMDP in Paris with Pierre Mervant as a Socrates Fellow. From 2005-2006, he studied in Cologne with Christoph Prégardien. After his diploma in 2008, he took part in Prégardien's \"voice studio\", finishing with Konzertexamen (concert exam) in 2010. He took masterclasses with Claudia Visca and Konrad Jarnot. Since 2008 he has continued working with Jarnot. He was awarded a second prize in the competition \"Podium Junger Gesangssolisten\" of the Verband Deutscher Konzertchöre (VDKC) in 2008.", "In 2008, his interpretation of the Evangelist in Bach's St John Passion in Cologne was termed \"excellent, a factual witness showing empathy at times\". He also performed the \"great arias\" in the two performances. In 2008, he sang the part of Uriel in several performances of Haydn's Die Schöpfung, in three churches of Berlin, in Bonn and in the . In 2009, he was the Evangelist in Bach's St Matthew Passion in St. Martin, Idstein, with Andreas Pruys (vox Christi), Katia Plaschka, Anne Bierwirth and Klaus Mertens. He performed several parts in Handel's Saul, the title role sung by Konrad Jarnot, with the Münchener Bach-Chor, conducted by Hansjörg Albrecht."]}, {"page": "Gold Medal of the Guildhall School of Music and Drama", "response": ["*1997: Konrad Jarnot"]}, {"page": "Jarnot", "response": ["* Konrad Jarnot (born 1972), English baritone"]}, {"page": "Anke Vondung", "response": ["At the 2011 Rheingau Musik Festival, she performed the Liebesliederwalzer by Brahms and Spanische Liebeslieder, op. 138, by Schumann with Ruth Ziesak, Werner Güra and Konrad Jarnot at Schloss Johannisberg.Auf Tränen folgt Sehnen / RMF II Schumanns Vokalquartette auf Schloss Johannisberg  Axel Zibulski, Wiesbadener Tagblatt, 15 July 2011 "]}, {"page": "Schiersteiner Kantorei", "response": ["Recordings have included Bach's St John Passion (2003) and St Matthew Passion (2006), with Christoph Prégardien as the Evangelist, Konrad Jarnot and Klaus Mertens as the Vox Christi, soprano Siri Thornhill, alto Matthias Rexroth and bass Markus Flaig. In 2009, the choir performed Handel's Solomon at the Marktkirche with Andreas Scholl in the title role, tenor Andreas Karasiak and bass Gotthold Schwarz. In its 50th year, the choir performed Bach's St Matthew Passion in the Marktkirche on 31 March 2012."]}, {"page": "Amanda Roocroft", "response": ["*Elgar: Complete Songs (Vols. 1 and 2) – Amanda Roocroft (soprano); Konrad Jarnot (baritone); Reinild Mees (piano). Vol. 1 recorded in 2007; Vol. 2 recorded in April 2008 and January 2009. Label: Channel Classics (CD)  "]}, {"page": "Rudolf Piernay", "response": ["His pupils include, among others, Bryn Terfel, Ema Nikolovska, Markus Brutscher, Melanie Diener,Melanie Diener on Bolchoi Theatre Hanno Müller-Brachmann, Caroline Melzer, Michael Volle,Michael Volle on Opéra de Paris Stephanie Hampl, Hanna-Elisabeth Müller, Jens Hamann, James Martin, Martin Wistinghausen and Konrad Jarnot. "]}]}}