{"wiki_id": "http://www.wikidata.org/entity/Q1790396", "itemLabel": "Thomas Overbury", "itemDescription": "(1581–1613)  English poet and essayist", "wikipedia_url": "https://en.wikipedia.org/wiki/Thomas_Overbury", "wikipedia_page": {"main": "Sir Thomas Overbury (baptized 1581 – 14 September 1613) was an English poet and essayist, also known for being the victim of a murder which led to a scandalous trial. His poem A Wife (also referred to as The Wife), which depicted the virtues that a young man should demand of a woman, played a large role in the events that precipitated his murder.", "link_mentions": [{"page": "Anagram", "response": ["When it comes to the 17th century and anagrams in English or other languages, there is a great deal of documented evidence of learned interest. The lawyer Thomas Egerton was praised through the anagram gestat honorem ('he carries honor'); the physician George Ent took the anagrammatic motto genio surget ('he rises through spirit/genius'), which requires his first name as Georgius. James I's courtiers discovered in \"James Stuart\" \"a just master\", and converted \"Charles James Stuart\" into \"Claims Arthur's seat\" (even at that point in time, the letters I and J were more-or-less interchangeable). Walter Quin, tutor to the future Charles I, worked hard on multilingual anagrams on the name of father James. A notorious murder scandal, the Overbury case, threw up two imperfect anagrams that were aided by typically loose spelling and were recorded by Simonds D'Ewes: \"Francis Howard\" (for Frances Carr, Countess of Somerset, her maiden name spelled in a variant) became \"Car findes a whore\", with the letters E hardly counted, and the victim Thomas Overbury, as \"Thomas Overburie\", was written as \"O! O! a busie murther\" (an old form of \"murder\"), with a V counted as U.Early Stuart LibelsEarly Stuart Libels"]}, {"page": "September 14", "response": ["*1613 – Thomas Overbury, English poet"]}, {"page": "September 15", "response": ["*1613 – Thomas Overbury, English poet and author (b. 1581)"]}, {"page": "1613", "response": ["* September 14 – Thomas Overbury, English poet and essayist (murdered) (b. 1581)"]}, {"page": "1615", "response": ["* Mary Talbot, Countess of Shrewsbury, is released from the Tower of London, in recognition of her role in helping to discover the murder of Sir Thomas Overbury."]}, {"page": "1616", "response": ["* May 25 – King James I of England's former favourite, the Earl of Somerset, and his wife Frances, are convicted of the murder of Thomas Overbury in 1613. They are spared death, and are sentenced to imprisonment in the Tower of London (until 1622). Although the King has ordered the investigation of the poet's murder and allowed his former court favorite to be arrested and tried, his court, now under the influence of  George Villiers, gains the reputation of being corrupt and vile. The sale of peerages (beginning in July) and the royal visit of James's brother-in-law, Christian IV of Denmark, a notorious drunkard, add further scandal."]}, {"page": "1581", "response": ["** Thomas Overbury, English poet and essayist (d. 1613)"]}, {"page": "Robert Devereux, 3rd Earl of Essex", "response": ["Essex was married at age 13 to the 14-year-old Frances Howard; he was then sent on a European tour from 1607 to 1609, apparently without having consummated the marriage. Meanwhile, his wife began an affair with Robert Carr, Viscount Rochester, a favourite of King James I. After Essex's return, Frances sought an annulment on the grounds of impotence. Essex claimed that he was only impotent with her and had been perfectly capable with other women, adding that she \"reviled him, and miscalled him, terming him a cow and coward, and beast.\" The divorce was a public spectacle and it made Essex a laughing-stock at court. It was small comfort that the finding that Frances was still a virgin was greeted with equal derision: as a popular ballad put it The Dame was inspected, but fraud interjected a Maid of greater perfection. The annulment was granted on 25 September 1613, and Frances Howard married her lover, who had been made 1st Earl of Somerset, on 26 December 1613. Three years later the Somersets were tried by a panel of Lords for their part in the murder of Sir Thomas Overbury; Essex sat as a juror in the trial of his former wife and pressed the King to send her to the scaffold. Both were condemned to death, but the sentence was never carried out."]}, {"page": "Theophrastus", "response": ["His book Characters () contains thirty brief outlines of moral types. They are the first recorded attempt at systematic character writing. The book has been regarded by some as an independent work; others incline to the view that the sketches were written from time to time by Theophrastus, and collected and edited after his death; others, again, regard the Characters as part of a larger systematic work, but the style of the book is against this. Theophrastus has found many imitators in this kind of writing, notably Joseph Hall (1608), Sir Thomas Overbury (1614–16), Bishop Earle (1628), and Jean de La Bruyère (1688), who also translated the Characters. George Eliot also took inspiration from Theophrastus' Characters, most notably in her book of caricatures, Impressions of Theophrastus Such. Writing the \"character sketch\" as a scholastic exercise also originated in Theophrastus's typology."]}, {"page": "Thomas Campion", "response": ["He was implicated in the murder of Sir Thomas Overbury, but was eventually exonerated, as it was found that he had unwittingly delivered the bribe that had procured Overbury's death.Thomas Campion (UXL encyclopedia of world biography, 2003)."]}, {"page": "List of works published posthumously", "response": ["* Thomas Overbury — A Wife, Characters, The Remedy of Love, Observations in Foreign Travels", "* Thomas Overbury — Observations in Foreign Travels"]}, {"page": "1613 in literature", "response": ["*September 15 – Sir Thomas Overbury, English poet and essayist (probably poisoned, born 1581)"]}, {"page": "1608 in literature", "response": ["*June 19 – Thomas Overbury is knighted."]}, {"page": "1601 in literature", "response": ["**Thomas Overbury meets Robert Carr, 1st Earl of Somerset, and they become firm friends."]}, {"page": "1581 in literature", "response": ["*June 18 (date of baptism) – Thomas Overbury, English poet and essayist (died 1613)"]}, {"page": "James VI and I", "response": ["The Howard party, consisting of Northampton, Suffolk, Suffolk's son-in-law Lord Knollys, and Charles Howard, Earl of Nottingham, along with Sir Thomas Lake, soon took control of much of the government and its patronage. Even the powerful Carr fell into the Howard camp, hardly experienced for the responsibilities thrust upon him and often dependent on his intimate friend Sir Thomas Overbury for assistance with government papers.Sir Francis Bacon, speaking at Carr's trial, quoted by : \"Packets were sent, sometimes opened by my lord, sometimes unbroken unto Overbury, who perused them, registered them, made table-talk of them, as they thought good. So I will undertake the time was, when Overbury knew more of the secrets of state, than the council-table did.\" Carr had an adulterous affair with Frances Howard, Countess of Essex, daughter of the Earl of Suffolk, whom James assisted by securing an annulment of her marriage to free her to marry Carr."]}, {"page": "Thomas Dekker (writer)", "response": ["As might be expected, Dekker turned his experience in prison to profitable account. Dekker His Dreame (1620) is a long poem describing his despairing confinement; he contributed six prison-based sketches to the sixth edition (1616) of Sir Thomas Overbury's Characters; and he revised Lanthorne and Candlelight to reflect what he had learned in prison."]}, {"page": "Cyril Tourneur", "response": ["A difficult allegorical poem called The Transformed Metamorphosis (1600) is Tourneur's earliest extant work; an elegy on the death of Prince Henry, son of James I of England, is the latest (1613). Tourneur's other non-dramatic works include a prose pamphlet, Laugh and Lie Down (1605),Works of Cyril Tourneur, ed. Allardyce Nicoll (1929), pp. 273-296. some contributions to Sir Thomas Overbury's Book of Characters and an epicede on Sir Francis Vere. This poem conveys the poet's ideal conception of a perfect knight or happy warrior."]}, {"page": "The Scarlet Letter", "response": ["* Sir Thomas Overbury and Dr. Forman were the subjects of an adultery scandal in 1615 in England. Dr. Forman was charged with trying to poison his adulterous wife and her lover. Overbury was a friend of the lover and was perhaps poisoned.", "* Reid, Alfred S. Sir Thomas Overbury's Vision (1616) and Other English Sources of Nathaniel Hawthorne's 'The Scarlet Letter. Gainesville, FL: Scholar's Facsimiles and Reprints, 1957."]}, {"page": "William Monson (Royal Navy officer)", "response": ["Monson's elder brother, Sir Thomas Monson (1564–1641), was one of James I's favourites, and was made a baronet in 1611. He held a position of trust at the Tower of London, a circumstance which led to his arrest as one of the participators in the murder of Sir Thomas Overbury. He was, however, soon released. His eldest son was Sir John Monson, Bart. (1600–1683), a member of parliament under Charles I, and another son was Sir William Monson (c. 1607–1678), who was created an Irish peer as Viscount Monson of Castlemaine in 1628. Having been a member of the court which tried Charles I the viscount was deprived of his honours and was sentenced to imprisonment for life in 1661. Sir John Monson's descendant, another Sir John Monson, Bart. (1693–1748), was created Baron Monson in 1728. His youngest son was George Monson (1730–1776), who served with the English troops in India from 1758 to 1763. The baron's eldest son was John, the 2nd baron (1727–1774), whose son William Monson (1760–1807) served in the Mahratta War under General Lake. William's only son William John (1796–1862) became 6th Baron Monson in succession to his cousin Frederick John, the 5th baron, in October 1841. His son William John, the 7th baron (1829–1898), was created Viscount Oxenbridge in 1886. When he died without sons in 1898 the viscounty became extinct, but the barony descended to his brother Debonnaire John (1830–1900), whose son Augustus Debonnaire John (b. 1868) became 9th Baron Monson in 1900. Another of Viscount Oxenbridge's brothers was Sir Edmund John Monson, Bart. (b. 1834), who, after filling many other diplomatic appointments, was British ambassador in Paris from 1896 to 1904."]}, {"page": "Robert Carr, 1st Earl of Somerset", "response": ["Robert Kerr was born in Wrington, Somerset, England, the younger son of Sir Thomas Kerr (Carr) of Ferniehurst, Scotland, by his second wife, Janet Scott, sister of Walter Scott of Buccleuch.James Balfour Paul, The Scots Peerage, vol. 2 (Edinburgh, 1905), p. 231, and vol. 5 (Edinburgh, 1908), pp. 69–70. About the year 1601, while an obscure page to Sir George Home, he met Thomas Overbury in Edinburgh. The two became friends and travelled to London together. Overbury soon became Carr's secretary. When Carr embarked on his career at court, Overbury became mentor, secretary, and political advisor to his more charismatic friend, the brain behind Carr's steady rise to prominence.", "The rise and fall of Robert Carr and his relationship to Thomas Overbury are the subject of Rafael Sabatini's 1930 novel The Minion, written shortly before Sabatini's divorce from his first wife in 1931. (Given The Minions more tragic tone, it may have been Sabatini's divorce that tainted his normally optimistic, hero-wins-out writing style.)"]}, {"page": "Dodona's Grove", "response": ["Covered in the poem are the Spanish match, the Gunpowder Plot, the murder of Thomas Overbury, and the assassination of Buckingham. The political criticisms in Dodona's Grove may have contributed to Howell's imprisonment in 1643."]}, {"page": "George Calvert, 1st Baron Baltimore", "response": ["In 1611, James employed Calvert to research and transcribe his tract against the Dutch Protestant theologian Conrad Vorstius (1569–1622).Krugler, p. 36. The following year, Cecil died, and Calvert acted as one of the four executors of his will. The king's favourite, Sir Robert Carr, first Earl of Somerset (1587–1645), Viscount Rochester, assumed the duties of secretary of state and recruited Calvert to assist with foreign policy, in particular the Latin and Spanish correspondence.Krugler, p. 37. Carr, soon raised to the earldom of Somerset, was not a success in the job, and fell from favour partly as a result of the murder of Thomas Overbury (1581–1613), to which Carr's wife Frances, the former Countess of Essex and later Somerset (1590–1632), pleaded guilty in 1615. Carr's place as James's principal favourite was now taken by the handsome George Villiers, 1st Duke of Buckingham (1592–1628), with whom James was said to have been infatuated.Stewart, p. 265."]}, {"page": "Richard Savage (poet)", "response": ["Savage's first certain work was a poem satirizing Bishop Hoadly, entitled The Convocation, or The Battle of Pamphlets (1717), which he afterwards tried to suppress. He adapted from a Spanish comedy, Love in a Veil, (acted 1718, printed 1719), which gained him the friendship of Sir Richard Steele, who became his first patron, and of Robert Wilks. With Steele, however, he soon quarrelled. In 1723 he played without success in the title role of his tragedy, Sir Thomas Overbury (1723), which nonetheless provided him a considerable amount of notoriety.", "When in Wales, Savage lived in Swansea, then in England at Bristol, where he completed a new version of Sir Thomas Overbury. Harassed by creditors and abandoned by friends, Savage reverted to a nocturnal existence.", "*Sir Thomas Overbury (1723)"]}, {"page": "Thomas Howard, 1st Earl of Suffolk", "response": ["In 1615, however, Suffolk's fall began. James had become deeply infatuated with Sir George Villiers, and Suffolk's daughter Frances, now Countess of Somerset, was implicated in the poisoning of Sir Thomas Overbury. Suffolk was accused by James of complicity with Somerset in trying to suppress investigation of the crime, but successfully weathered the storm. However, Suffolk then made the mistake of attempting to undermine the rising power of Villiers by grooming another handsome young man to succeed him in James's favour. Completely unsuccessful, this only provoked a counterattack by Villiers, now (1618) Marquess of Buckingham, upon Suffolk's conduct as Lord High Treasurer."]}, {"page": "Henry Howard, 1st Earl of Northampton", "response": ["Henry Howard, 1st Earl of Northampton KG (25 February 154015 June 1614) was an important English aristocrat and courtier. He was suspect as a crypto-Catholic throughout his life, and went through periods of royal disfavour, in which his reputation suffered greatly. He was distinguished for learning, artistic culture and his public charities. He built Northumberland House in London and superintended the construction of the fine house of Audley End. He founded and planned several hospitals. Francis Bacon included three of his sayings in his Apophthegms, and chose him as \"the learnedest councillor in the kingdom to present to the king his Advancement of Learning.\" After his death, it was discovered that he had been involved in the murder of Sir Thomas Overbury.", "thumb|Thomas Overbury", "He assisted his great-niece, Lady Essex, in obtaining her divorce from her husband (son of the 2nd Earl of Essex whom Northampton had followed in the 1590s) in order to marry the favourite Somerset, whose mistress she already was. While Northampton may have treated this as routine intrigue, the outcome was a major murder scandal. Both Northampton and her father Thomas Howard, 1st Earl of Suffolk represented her in an interview with Essex held at Whitehall in May 1613, in the hope of obtaining his assent to a divorce. Essex proved uncompliant, and Northampton contrived that the case should be brought before a special commission. When, however, the divorce was obtained, Somerset's intimate acquaintance, Sir Thomas Overbury, dissuaded him from pursuing the project of marriage with Lady Frances. Northampton recommended, on slender grounds, Overbury's imprisonment in the Tower of London, and contrived that a friend of the Howard family, Sir Gervase Helwys, should be appointed Lord Lieutenant of the Tower. Helwys frequently wrote to Northampton about Overbury's conduct and health. In his extant letters to Helwys Northampton writes with contempt of Overbury and expresses a desire that his own name should not be mentioned in connection with his imprisonment, but he introduced to Helwys John Craig, one of the royal physicians, to report on the prisoner's health. Overbury died in September, 1613. When the matter was judicially investigated, after Northampton too had died, his political enemies credited him with a direct hand in the murder. Overbury had died from the effects of poison administered by the direction of Lady Essex."]}, {"page": "Frances Carr, Countess of Somerset", "response": ["Sir Thomas Overbury, a close friend and advisor of Somerset, had tried to advise Somerset not to marry Frances Howard, but the Howard family and their allies were powerful. The Howard faction persuaded the king to offer Overbury the post of Ambassador to Russia, knowing he would refuse in order to stay in England by Somerset's side. When he did so, the king viewed this as an insult and imprisoned Overbury in the Tower of London, where he died. The annulment of Frances and Essex's marriage went through eleven days after Overbury's death, in September 1613."]}, {"page": "Ralph Winwood", "response": ["Having returned to England Sir Ralph became secretary of state and Privy Councillor from 1614 until his death and a Member of Parliament (MP) for Buckingham. In the House of Commons he defended the king's right to levy impositions.  Created principal Secretary of state on Somerset's demise, Winwood held the office from March 1614 to his death during the Addled Parliament.  Winwood was responsible for the inquiry into the murder of Sir Thomas Overbury and the release of Raleigh from the Tower in 1616. Raleigh was urged by Winwood to attack the Spanish fleet and the Spanish settlements in South America.  Spanish envoys at Court of St James's made several written complaints about the secretary's share in this undertaking to the King at Whitehall Palace.  In the midst of this latest foreign policy crisis, Sir Ralph Winwood died in London on 28 October 1617.  It can hardly be doubted, wrote Gardiner, that, if he had lived till the following summer, he would have shared in Raleigh's ruin."]}, {"page": "Robert Killigrew", "response": ["In June 1612, Killigrew was noted as \"one of Carr's favourites\" according to John Chamberlain. The following May, he was committed to the Fleet Prison for an unknown offence. Having become famous for his concoctions of drugs and cordials, he was at first suspected of complicity in the death of Sir Thomas Overbury in September 1613, but was subsequently officially exonerated."]}, {"page": "Francis Rous", "response": ["As legal training was then considered part of an education, he attended the Middle Temple for a short period in 1601, but moved to Landrake, in Cornwall. There are few details of his life prior to 1626, although in 1641, Rous claimed he spent some of 1609 travelling in Europe with Sir Thomas Overbury, victim in one of the most famous murder cases of the period."]}, {"page": "Hic Mulier", "response": ["Hic Mulier quotes twelve lines from Thomas Overbury's notorious poem A Wife. The currency of this reference is reflected in Overbury's being identified solely by his initials."]}, {"page": "Haec-Vir", "response": ["What is clear is that a number of social and political developments made cross-dressing more threatening. The perception of political corruption and homosexuality at court on the one hand, and the rising intolerance and vehemence of the Puritans on the other, contributed to a heavily polarized social scene in which tolerance or compromise became progressively more difficult. As regards women, scandals such as the murder of Thomas Overbury revealed some women in a light that was conducive to misogynistic fears. As regards men, the long era of peace enforced by James's foreign policy was assumed to lead to \"soft\" men; there was, for some English people, a noted contrast between the delicate Jacobean courtier and the idealized martial courtier remembered from Elizabeth I's day. Finally, the promulgation of the Statutes of Apparel in 1574 may have served to remind some English people of the traditional limits on freedom of dress."]}, {"page": "Simon Forman", "response": ["Simon Forman (31 December 1552 – 5 or 12 September 1611) was an Elizabethan astrologer, occultist and herbalist active in London during the reigns of Queen Elizabeth I and James I of England. His reputation, however, was severely tarnished after his death when he was implicated in the plot to kill Sir Thomas Overbury. Astrologers continued to revere him, while writers from Ben Jonson to Nathaniel Hawthorne came to characterize him as either a fool or an evil magician in league with the Devil.", "Five years after his death he was implicated in the murder of Thomas Overbury when two of his patients, Lady Frances Howard and Mrs Anne Turner, were found guilty of the crime. During the testimony of Howard's trial, lawyers hurled accusations at Forman, claiming that he had given Lady Essex the potion with which she plotted to kill Overbury. During the trial he was described by Sir Edward Coke, Lord Chief Justice of the King's Bench as the \"Devil Forman\"; the result being that his reputation was severely tarnished."]}, {"page": "William Wade (English politician)", "response": ["He retired from public life in 1613, at the instigation of Frances Howard, Countess of Essex. She wanted Wade replaced with a less honest Lieutenant of the Tower, Sir Gervase Helwys, as part of her scheme to murder the prisoner Thomas Overbury, who was opposed to her affair with Robert Carr."]}, {"page": "Miriam Allen deFord", "response": ["She also wrote The Overbury Affair, which involves events during the reign of James I of Britain surrounding the murder of Sir Thomas Overbury. For the latter work she received a 1961 Edgar Award from the Mystery Writers of America for Best Fact Crime book. She worked for Humanist magazine and she was one of the signers of the Humanist Manifesto."]}, {"page": "Knollys family", "response": ["Through his second wife Elizabeth Howard (1586–1658), daughter of Thomas Howard, 1st Earl of Suffolk, William was related to Frances, Countess of Somerset, and when this lady was tried for the murder of Sir Thomas Overbury her relatives were regarded with suspicion; consequently Lord Wallingford resigned the treasurership of the household and two years later the mastership of the Court of Wards, an office which he had held since 1614. However, he regained the royal favour, and was created earl of Banbury in 1626. He died in London on 25 May 1632."]}, {"page": "List of years in poetry", "response": ["* 1614 in poetry A Wife,  poem by Sir Thomas Overbury published posthumously", "* 1613 in poetry Death of Thomas Overbury English poet", "* 1581 in poetry Jerusalem Delivered by Torquato Tasso; Birth of Thomas Overbury English poet (d.1613)"]}, {"page": "Sir Thomas Monson, 1st Baronet", "response": ["He was created a hereditary baronet in 1611, one of the first in the Baronetage of England. But in 1615 his position of trust at the Tower of London brought about a situation which led to his arrest as one of the participators in the 1613 murder of Sir Thomas Overbury. He was eventually released however, after a year in the Tower, his reputation and finances ruined."]}, {"page": "Théodore de Mayerne", "response": ["When Henri IV was murdered in 1610, Mayerne moved to England, again by invitation. In 1611 he became first physician of James I and his queen, succeeding Martin Schöner. He also treated most members of the royal court, including Sir Robert Cecil and Henry Frederick, Prince of Wales. His inability to successfully treat those two individuals, together with his closeness to the scandal surrounding the murder of Sir Thomas Overbury coloured his first years in England. Nevertheless, he was sometimes sent on diplomatic missions to France."]}, {"page": "Mary Talbot, Countess of Shrewsbury", "response": ["In 1615, Mary was released from the Tower, partly in recognition of her role in detecting the murder of Sir Thomas Overbury, and partly because her husband was very ill.Durant p.209 In 1618, she was called to give evidence in the course of an inquiry into the rumors that Arbella had secretly given birth to a child. Mary refused to testify, saying she had sworn a binding oath not to, and was returned to the Tower, where she remained until 1623, occupying the best lodgings.Durant p.209 Mary was not easily intimidated: Dorothy L. Sayers in her novel Gaudy Night described her as \"uncontrollable by her menfolk,  undaunted by the Tower, and contemptuously silent before the Privy Council\". Francis Bacon remarked that while Lord Shrewsbury was a \"great person\", there was \"a greater than he, which is my Lady of Shrewsbury.\""]}]}}