{"wiki_id": "http://www.wikidata.org/entity/Q1791002", "itemLabel": "T. S. Ashton", "itemDescription": "English economist, historian & scholar", "wikipedia_url": "https://en.wikipedia.org/wiki/T._S._Ashton", "wikipedia_page": {"main": "Thomas Southcliffe Ashton (1889–1968) was an English economic historian. He was professor of economic history at the London School of Economics at the University of London from 1944 until 1954, and Emeritus Professor until his death in 1968. His best known work is the 1948 textbook The Industrial Revolution (1760–1830), which put forth a positive view on the benefits of the era.\nHe donated money to provide the T. S. Ashton Prize, an annual award from the Economic History Society. The prize is currently £750 and is awarded at every other annual conference to the author of the best article accepted for publication in the Economic History Review in the previous two calendar years.\nFollowing a BBC Freedom of Information request in January 2012, it was revealed that Ashton turned down a knighthood in 1957.", "link_mentions": [{"page": "Industrial Revolution", "response": ["The precise start and end of the Industrial Revolution is still debated among historians, as is the pace of economic and social changes. Eric Hobsbawm held that the Industrial Revolution began in Britain in the 1780s and was not fully felt until the 1830s or 1840s, while T. S. Ashton held that it occurred roughly between 1760 and 1830. Rapid industrialization first began in Britain, starting with mechanized spinning in the 1780s, with high rates of growth in steam power and iron production occurring after 1800. Mechanized textile production spread from Great Britain to continental Europe and the United States in the early 19th century, with important centres of textiles, iron and coal emerging in Belgium and the United States and later textiles in France."]}, {"page": "Economic history", "response": ["* T. S. Ashton"]}, {"page": "Riot", "response": ["Food riots are caused by harvest failures, incompetent food storage, hoarding, poisoning of food, or attacks by pests like locusts. When the public becomes desperate from such conditions, groups may attack shops, farms, homes, or government buildings to obtain bread or other staple foods like grain or salt. T. S. Ashton, in his study of food riots among colliers, noted that \"the turbulence of the colliers is, of course, to be accounted for by something more elementary than politics: it was the instinctive reaction of virility to hunger.\"Ashton, T. S., and Joseph Sykes. 1967. The Coal Industry of the Eighteenth Century. 2d ed. New York: A. M. Kelley. p. 131. Charles Wilson noted, \"Spasmodic rises in food prices provoked keelmen on the Tyne to riot in 1709, tin miners to plunder granaries at Falmouth in 1727.\" In the 1977 Egyptian Bread Riots, hundreds of thousands of people rioted after food subsidies stopped and prices rose."]}, {"page": "T. S. Ashton Prize", "response": ["The T. S. Ashton Prize, established with funds donated by the late Professor T. S. Ashton (1889-1968), is awarded biennially by the Economic History Society to the author of the best article accepted for publication in the Economic History Review in the previous two calendar years, who satisfies at least one of the following conditions at time of submission:", "The December 1968 issue of the Review carried a brief obituary of Professor T. S. Ashton (1889-1968) by A. H. John and a flier announcing the intention to establish the Prize, initially endowed by Mrs Ashton with the sum of £500. Further donations were sought from EHS members and an initial prize suggested of £50, to be awarded annually. The Prize was formally announced in the April 1970 issue of the Review. In 1981, the value of the Prize was raised to £150, with the intention of making an award every other year. The value was raised to its current value of £750 in 1998."]}, {"page": "T.S. Ashton", "response": ["#REDIRECT T. S. Ashton"]}, {"page": "Thomas Southcliffe Ashton", "response": ["#REDIRECT T. S. Ashton"]}, {"page": "T S Ashton", "response": ["#REDIRECT T. S. Ashton "]}, {"page": "TS Ashton", "response": ["#REDIRECT T. S. Ashton "]}, {"page": "Outline of economics", "response": ["* T. S. Ashton"]}, {"page": "Ashton (surname)", "response": ["*T. S. Ashton (1889–1968), English economic historian"]}, {"page": "Thomas Ashton", "response": ["*T. S. Ashton (Thomas Southcliffe Ashton, 1899–1968), English economic historian"]}, {"page": "List of people who have declined a British honour", "response": ["*T. S. Ashton, economic historian, Professor of Economic History, University of London (in 1957)."]}, {"page": "List of fellows of the British Academy elected in the 1950s", "response": ["* Professor T. S. Ashton"]}]}}