{"wiki_id": "http://www.wikidata.org/entity/Q1797795", "itemLabel": "L. T. C. Rolt", "itemDescription": "English historian and biographer", "wikipedia_url": "https://en.wikipedia.org/wiki/L._T._C._Rolt", "wikipedia_page": {"main": "Lionel Thomas Caswall Rolt (usually abbreviated to Tom Rolt or L. T. C. Rolt) (11 February 1910 – 9 May 1974) was a prolific English writer and the biographer of major civil engineering figures including Isambard Kingdom Brunel and Thomas Telford. He is also regarded as one of the pioneers of the leisure cruising industry on Britain's inland waterways, and was an enthusiast for vintage cars and heritage railways. He played a pioneering role in both the canal and railway preservation movements.", "link_mentions": [{"page": "M. R. James", "response": ["H. Russell Wakefield's supernatural fiction was strongly influenced by the work of James.Morgan, Chris (1985). \"H. Russell Wakefield\". In Bleiler, E. F., ed., Supernatural Fiction Writers. New York: Scribner's. pp. 617–622.  A large number of British writers deliberately wrote ghost stories in the Jamesian style; these writers, sometimes described as the \"James Gang\", include A. N. L. Munby, E. G. Swain, \"Ingulphus\" (pseudonym of Sir Arthur Gray, 1852–1940), Amyas NorthcoteWilson, Neil (2000). Shadows in the Attic: A Guide to British Supernatural Fiction, 1820–1950. London: British Library. p. 383. . \"The author's [Northcote's] tales are firmly in the style of M. R. James' antiquarian school of traditional ghost stories.\" and R. H. Malden, although some commentators consider their stories to be inferior to those of James himself.Joshi, S. T. (2005). \"Introduction\". Count Magnus and Other Ghost Stories by M. R. James. London: Penguin.  Although most of the early Jamesian writers were male, there were several notable female writers of such fiction, including Eleanor Scott (pseudonym of Helen M. Leys, 1892–1965) in the stories of her book Randall's Round (1929)Pardoe, Rosemary (2001). \"The James Gang\". Meddling with Ghosts: Stories in the Tradition of M. R. James. London: British Library. pp. 267–87.  and D. K. Broster in the collection Couching at the Door: Strange and Macabre Tales (1942). L. T. C. Rolt also modelled his ghost stories on James's work, but, unlike other Jamesian writers, set them in industrial locations, such as mines and railways.Wilson, Neil (2000). Shadows in the Attic: A Guide to British Supernatural Fiction, 1820–1950. London: British Library. pp. 433–34. "]}, {"page": "Thomas Telford", "response": ["*Thomas Telford L. T. C. Rolt, Longmans (1958)"]}, {"page": "Gaspard Monge", "response": ["After finishing his education in 1764 he returned to Beaune, where he made a large-scale plan of the town, inventing the methods of observation and constructing the necessary instruments; the plan was presented to the town, and is still preserved in their library. An officer of engineers who saw it wrote to the commandant of the École Royale du Génie at Mézières, recommending Monge to him and he was given a job as a draftsman. L. T. C. Rolt, an engineer and historian of technology, credited Monge with the birth of engineering drawing. When in the Royal School, he became a member of Freemasonry, initiated into ″L’Union parfaite″ lodge.Alain Queruel, Les franc-maçons de l'Expédition d'Egypte (Editions du Cosmogone, 2012). Snezana Lawrence et Mark McCartney, Mathematicians and their Gods : Interactions between mathematics and religious beliefs (OUP Oxford, 2015). Emmanuel Pierrat et Laurent Kupferman, Le Paris des Francs-Maçons (Le Cherche Midi, 2013)"]}, {"page": "Narrowboat", "response": ["*L. T. C. Rolt"]}, {"page": "Chester", "response": ["* L. T. C. Rolt (1910–74), engineering historian,  born in ChesterBuchanan, R. Angus (2004) 'Rolt, (Lionel) Thomas Caswall (1910–1974)', Oxford Dictionary of National Biography, Oxford University Press , Retrieved on 23 April 2008."]}, {"page": "Engineering drawing", "response": ["Technical drawing has existed since ancient times. Complex technical drawings were made in renaissance times, such as the drawings of Leonardo da Vinci. Modern engineering drawing, with its precise conventions of orthographic projection and scale, arose in France at a time when the Industrial Revolution was in its infancy. L. T. C. Rolt's biography of Isambard Kingdom Brunel. says of his father, Marc Isambard Brunel, that \"It seems fairly certain that Marc's drawings of his block-making machinery (in 1799) made a contribution to British engineering technique much greater than the machines they represented. For it is safe to assume that he had mastered the art of presenting three-dimensional objects in a two-dimensional plane which we now call mechanical drawing. It had been evolved by Gaspard Monge of Mezieres in 1765 but had remained a military secret until 1794 and was therefore unknown in England.\""]}, {"page": "1910 in literature", "response": ["*February 11 – L. T. C. Rolt, English biographer and writer of ghost stories (died 1974)"]}, {"page": "National Railway Museum", "response": ["The Beeching Report recommended that British Rail should stop running museums, and a campaign was led by transport historian L. T. C. Rolt and others such as the historian Jack Simmons to create a new museum."]}, {"page": "1944 in literature", "response": ["*L. T. C. Rolt – Narrow Boat"]}, {"page": "1974 in literature", "response": ["*May 9 – L. T. C. Rolt, English biographer and writer of ghost stories (born 1910)"]}, {"page": "History of the British canal system", "response": ["The establishment in 1946 of a group called the Inland Waterways Association by L. T. C. Rolt and Robert Aickman helped revive interest in the UK's canals to the point where they are a major leisure destination. In the 1960s the infant canal leisure industry was only just sufficient to prevent the closure of the remaining canals, but then the pressure to maintain canals for leisure purposes increased. Although out of commercial or leisure use, many canals survived because they formed part of local water supply and drainage networks. From the 1970s, increasing numbers of closed canals were restored by enthusiast volunteers. "]}, {"page": "Bioluminescence", "response": ["Before the development of the safety lamp for use in coal mines, dried fish skins were used in Britain and Europe as a weak source of light. (ISBN refers to the David & Charles reprint of 1968 with an introduction by L. T. C. Rolt) This experimental form of illumination avoided the necessity of using candles which risked sparking explosions of firedamp. Another safe source of illumination in mines was bottles containing fireflies. In 1920, the American zoologist E. Newton Harvey published a monograph, The Nature of Animal Light, summarizing early work on bioluminescence. Harvey notes that Aristotle mentions light produced by dead fish and flesh, and that both Aristotle and Pliny the Elder (in his Natural History) mention light from damp wood. He also records that Robert Boyle experimented on these light sources, and showed that both they and the glowworm require air for light to be produced. Harvey notes that in 1753, J. Baker identified the flagellate Noctiluca \"as a luminous animal\" \"just visible to the naked eye\",Harvey cites this as Baker, J.: 1743–1753, The Microscope Made Easy and Employment for the Microscope. and in 1854 Johann Florian Heller (1813–1871) identified strands (hyphae) of fungi as the source of light in dead wood."]}, {"page": "Stone, Staffordshire", "response": ["* L. T. C. Rolt, (1910 – 1974)OXFORDSHIRE BLUE PLAQUES SCHEME retrieved 29 September 2017 author of ‘Narrowboat’ and several engineering biographies"]}, {"page": "SS Great Eastern", "response": ["After Great Eastern's scrapping, rumours spread that the shipbreakers had found the remains of trapped worker(s) entombed in her hull—likely inspired by tales spread by her crew of a phantom riveter who had been sealed in the ship's hull. The legend was first widely noted on by James Dugan in 1952, who quoted a letter from a Captain David Duff, and many later sources cite Dugan's work. Other authors, notably L. T. C. Rolt in his biography of Brunel, have dismissed the claim (noting such a discovery would have been recorded in company logs and received press attention), but the legend has become widely mentioned in books and articles about nautical ghost stories. Brian Dunning wrote about the legend in 2020, noting that while it was technically impossible to prove or disprove, the incident could not have happened given the lack of evidence being found during the numerous times Great Eastern was being repaired."]}, {"page": "List of works titled after Shakespeare", "response": ["*Sleep No More by L. T. C. Rolt (II.ii)", "*Hear not my Steps by L. T. C. Rolt (II.i)"]}, {"page": "Newcomen Society", "response": ["* L. T. C. Rolt"]}, {"page": "Canals of the United Kingdom", "response": ["In the latter half of the 20th century, while the use of canals for transporting goods was dying out, there was a rise in interest in their history and potential use for leisure.  A large amount of credit for this is usually given to L. T. C. Rolt, whose book Narrow Boat about a journey made in the narrowboat Cressy was published in 1944. A key development was the foundation of the Inland Waterways Association, and the establishment of fledgling weekly boat-hire companies, following the example of such companies on the Norfolk Broads, which had long been used for leisure boating. The authority responsible for the canals, the British Waterways Board, encouraged this process from the late 1950s by operating a fleet of holiday hire boats, initially converted from cut-down working boats."]}]}}