{"wiki_id": "http://www.wikidata.org/entity/Q179196", "itemLabel": "Alicia Markova", "itemDescription": "English ballerina and a choreographer, director and teacher of classical ballet", "wikipedia_url": "https://en.wikipedia.org/wiki/Alicia_Markova", "wikipedia_page": {"main": "Dame Alicia Markova DBE (1 December 1910 – 2 December 2004) was a British ballerina and a choreographer, director and teacher of classical ballet. Most noted for her career with Sergei Diaghilev's Ballets Russes and touring internationally, she was widely considered to be one of the greatest classical ballet dancers of the twentieth century. She was the first British dancer to become the principal dancer of a ballet company and, with Dame Margot Fonteyn, is one of only two English dancers to be recognised as a prima ballerina assoluta. Markova was a founder dancer of the Rambert Dance Company, The Royal Ballet and American Ballet Theatre, and was co-founder and director of the English National Ballet.", "link_mentions": [{"page": "December 2", "response": ["*2004 – Alicia Markova, English ballerina and choreographer (b. 1910)"]}, {"page": "December 1", "response": ["*1910 – Alicia Markova, English ballerina and choreographer (d. 2004)"]}, {"page": "Sergei Diaghilev", "response": ["Diaghilev was known as a hard, demanding, even frightening taskmaster. Ninette de Valois, no shrinking violet, said she was too afraid to ever look him in the face. George Balanchine said he carried around a cane during rehearsals, and banged it angrily when he was displeased. Other dancers said he would shoot them down with one look, or a cold comment. On the other hand, he was capable of great kindness, and when stranded with his bankrupt company in Spain during the 1914–18 war, gave his last bit of cash to Lydia Sokolova to buy medical care for her daughter. Alicia Markova was very young when she joined the Ballets Russes and would later say that she had called Diaghilev \"Sergypops\" and he had said he would take care of her like a daughter.", "Dancers such as Alicia Markova, Tamara Karsavina, Serge Lifar, and Lydia Sokolova remembered Diaghilev fondly, as a stern but kind father-figure who put the needs of his dancers and company above his own. He lived from paycheck to paycheck to finance his company, and though he spent considerable amounts of money on a splendid collection of rare books at the end of his life, many people noticed that his impeccably cut suits had frayed cuffs and trouser-ends. The film The Red Shoes is a thinly disguised dramatization of the Ballets Russes."]}, {"page": "1910", "response": ["** Dame Alicia Markova, British ballerina (d. 2004)"]}, {"page": "Anna Pavlova", "response": ["After leaving Russia, Pavlova moved to London, England, settling, in 1912, at the Ivy House on North End Road, Golders Green, north of Hampstead Heath, where she lived for the rest of her life. The house had an ornamental lake where she fed her pet swans, and where now stands a statue of her by the Scots sculptor George Henry Paulin. The house was featured in the film Anna Pavlova. It used to be the London Jewish Cultural Centre, but a blue plaque marks it as a site of significant historical interest being Pavlova's home. While in London, Pavlova was influential in the development of British ballet, most notably inspiring the career of Alicia Markova. The Gate pub, located on the border of Arkley and Totteridge (London Borough of Barnet), has a story, framed on its walls, describing a visit by Pavlova and her dance company."]}, {"page": "Ilkley", "response": ["In 1975, David Gayle founded the Yorkshire Ballet Seminars which brought distinguished names in dance, like Alicia Markova, to Ilkley College of Education. In 1978, Ilkley College of Education merged with Bingley College of Education to become Ilkley College. In 1982, Ilkley College merged with Bradford College to become Bradford and Ilkley Community College. In 1999, the Ilkley campus of Bradford and Ilkley Community College closed despite opposition. The campus had occupied a  site at Wells House, which was sold for housing after its closure."]}, {"page": "Ninette de Valois", "response": ["In 1923, de Valois joined the Ballets Russes, a renowned ballet company founded by the Russian impresario Sergei Diaghilev. She remained with the company for three years, performing around Europe and being promoted to the rank of Soloist, and creating roles in some of the company's most famous ballets, including Les biches and Le Train Bleu. During this time, she was also mentor to Alicia Markova who was only a child at the time, but would eventually be recognised as a Prima Ballerina Assoluta and one of the most famous English dancers of all time.  Later in her life, Valois said that everything she knew about how to run a ballet company she learned from working with Diaghilev. She stepped back from regular intense dancing in 1924, after doctors detected damage from a previously undiagnosed case of childhood polio.", "At its formation, the Vic-Wells Ballet had only six female dancers, with de Valois working as lead dancer and choreographer.  The company performed its first full ballet production on 5 May 1931 at the Old Vic, with Anton Dolin as guest star. Its first performance at Sadler's Wells Theatre came a few days later, on 15 May 1931.  As a result of the success of the company, de Valois hired new dancers and choreographers.  She retired fully from the stage herself in 1933, after Alicia Markova joined the company and was appointed as Prima Ballerina."]}, {"page": "Jessie Matthews", "response": ["Matthews was the subject of This Is Your Life in 1961. Previously, for the same show, in January 1960, she had appeared in a televised recorded message for Alicia Markova, broadcast from Matthews' home in Melbourne, Australia. Further guest appearances on This is Your Life were made by Matthews for comedian Sandy Powell, dancer Sir Anton Dolin, actor Andrew Sachs and comedian Janet Brown."]}, {"page": "Eurovision Young Dancers 1985", "response": ["* – Alicia Markova"]}, {"page": "Robert Helpmann", "response": ["Sir Robert Murray Helpmann, CBE (né Helpman, 9 April 1909 – 28 September 1986) was an Australian ballet dancer, actor, director and choreographer. After early work in Australia he moved to Britain in 1932, where he joined the Vic-Wells Ballet under its creator, Ninette de Valois. He became one of the company's leading men, partnering Alicia Markova and later Margot Fonteyn. When Frederick Ashton, the company's chief choreographer, was called up for military service in the Second World War Helpmann took over from him while continuing as a principal dancer.", "In April 1934 de Valois created a new ballet, The Haunted Ballroom, with Helpmann and Alicia Markova in the leading roles. The Times commented that of the soloists Helpmann \"had the greatest opportunities, and made fine use of them\".\"Sadler's Wells Ballet\", 4 April 1934, p. 10 He co-starred with Markova in Swan Lake, danced in operas, and appeared at the Open Air Theatre, Regent's Park. In 1935 he was leading dancer in the revue Stop Press, with music by Irving Berlin.\"Adelphi Theatre\", The Times, 22 February 1935, p. 12 At Sadler's Wells he danced the principal role in another new de Valois ballet, The Rake's Progress, and in 1936 Frederick Ashton choreographed a highly romantic ballet, Apparitions, to music by Liszt, featuring Helpmann and the teenaged Margot Fonteyn. Sorley Walker writes that he and Fonteyn were a \"perfectly matched partnership\", exemplified by \"their superb rendering of the Aurora pas de deux in The Sleeping Beauty\". As well as romantic leading roles, Helpmann became known for his gift for comedy. Sorley Walker singles out his roles in Coppélia, Ashton's A Wedding Bouquet and de Valois's The Prospect Before Us. Character roles included the doddery Red King in de Valois' Checkmate, which he first danced at the age of 28 and last danced in 1986 when he was 77."]}, {"page": "Cecchetti method", "response": ["Initially, Cecchetti passed on his method by teaching it to his pupils and professional dancers, including well known dancers of the early 20th century, such as Anna Pavlova, Alicia Markova, George Balanchine and Serge Lifar. Many of his students later taught the Cecchetti method, including Ninette de Valois, Marie Rambert, Laura Wilson, Margaret Craske and Olga Preobrajenska. A number of professional ballet schools have historically used the Cecchetti method, including the Royal Ballet School, Rambert Ballet School, National Ballet School of Canada, and the Australian Ballet School."]}, {"page": "Lyric Opera of Chicago", "response": ["Fox also used her formidable persuasive powers on artists other than singers: she was able to bring Rudolph Nureyev to make his debut on an American opera stage at the Lyric; Vera Zorina, Alicia Markova, Erik Bruhn and Maria Tallchief also danced at the Lyric, and George Balanchine created choreography for the Lyric. The Italian composer Pino Donati was her artistic director. Bruno Bartoletti was principal conductor, but other conductors included Tullio Serafin, Dimitri Mitropoulos and Artur Rodziński. Christoph von Dohnányi and Sir Georg Solti chose the Lyric for their American operatic debuts. Franco Zeffirelli staged operas as did Harold Prince. After retiring from dancing, Tallchief moved to Chicago where she served as director of ballet for the Lyric from 1973 to 1979. In 1974, she founded Lyric Opera's ballet school, where she taught the Balanchine technique. "]}, {"page": "List of dance personalities", "response": ["* Alicia Markova"]}, {"page": "Giselle", "response": ["The ballet was staged by Diaghilev's Ballets Russes later in 1911 at the Royal Opera, Covent Garden, with Tamara Karsavina and Nijinsky as Giselle and Albrecht. Anna Pavlova danced Giselle with her own company in 1913. Alicia Markova danced the role with the Vic-Wells Ballet in 1934, and Margot Fonteyn took the role in 1937 when Markova left the company. The English loved Giselle. In 1942, for example, three different companies were dancing the ballet in London."]}, {"page": "Frederick Ashton", "response": ["Rambert sought to widen the horizons of her students, taking them to see London performances by the Diaghilev Ballet. They had a great influence on Ashton – most particularly Bronislava Nijinska's ballet Les biches.Ford, p. 89. In 1930 Ashton created an innovative ballet, Capriol Suite, using Peter Warlock's 1926 suite of the same name. The music was based on 16th-century French music, and Ashton researched the dances of the earlier era, and created a period piece with \"basse danse, pavane, tordion, and bransle – smoothly mixing robust masculine leaps with courtly duets.\" The following year Rambert founded the Ballet Club, forerunner of the Ballet Rambert, with Alicia Markova as prima ballerina and Ashton as the main choreographer and one of the leading dancers.", "It was based on a step used by Anna Pavlova in a gavotte that she frequently performed. Alicia Markova recalled in 1994 that Ashton had first used the step in a short ballet that concluded Nigel Playfair's 1930 production of Marriage à la Mode. It is not seen in Ashton's 1931 Façade, but after that, it became a feature of his choreography. The critic Alastair Macaulay writes:"]}, {"page": "Markov", "response": ["*Dame Alicia Markova (1910–2004), British prima ballerina"]}, {"page": "Sadler's Wells Theatre", "response": ["Also in 1925, Baylis began collaborating with the ballet teacher Ninette de Valois, a former dancer with Sergei Diaghilev's Ballets Russes. At the time, de Valois was teaching in her own dance school, the Academy of Choreographic Art, but had contacted Baylis with a proposal to form a repertory ballet company and school. So in 1931 when Sadler's Wells was reopened, de Valois was allocated rehearsal rooms in the theatre and established the Sadler's Wells Ballet School and the Vic-Wells Ballet. The ballet company performed at both the Sadler's Wells and Old Vic theatres. The company grew as the school trained new dancers to join the company. The first principal dancers of the Vic-Wells ballet were Alicia Markova and Anton Dolin and the founder choreographer was Frederick Ashton, all three having been working with the Ballet Club of Marie Rambert."]}, {"page": "Erik Bruhn", "response": ["The turning point in Bruhn's international career came on 1 May 1955 with his début in the role of Albrecht in Giselle partnering Dame Alicia Markova, nearly twenty years his senior, in a matinée with Ballet Theatre in New York after only three days of rehearsal.Bruhn, Erik Beyond Technique (1968)  The performance caused a sensation. Dance critic John Martin, writing in The New York Times, called it \"a date to write down in the history books, for it was as if the greatest Giselle of today were handing over a sacred trust to what is probably the greatest Albrecht of tomorrow.\" In an article entitled \"The Matinée that Made History\" in Dance News in June 1955, P. W. Machester wrote:"]}, {"page": "Margot Fonteyn", "response": ["Dame Margaret Evelyn de Arias DBE (née Hookham; 18 May 191921 February 1991), known by the stage name Margot Fonteyn, was an English ballerina. She spent her entire career as a dancer with the Royal Ballet (formerly the Sadler's Wells Theatre Company), eventually being appointed prima ballerina assoluta of the company by Queen Elizabeth II. Beginning ballet lessons at the age of four, she studied in England and China, where her father was transferred for his work. Her training in Shanghai was with George Goncharov, contributing to her continuing interest in Russian ballet. Returning to London at the age of 14, she was invited to join the Vic-Wells Ballet School by Ninette de Valois. She succeeded Alicia Markova as prima ballerina of the company in 1935. The Vic-Wells choreographer, Sir Frederick Ashton, wrote numerous parts for Fonteyn and her partner, Robert Helpmann, with whom she danced from the 1930s to the 1940s.", "In 1935, Fonteyn had her solo debut, playing Young Tregennis in The Haunted Ballroom. That same year, Sir Frederick Ashton created the role of the bride in his choreography of Stravinsky's Le baiser de la fée specifically for her. Though he appreciated her lyric qualities and found her elegant, Ashton said of her early years that Fonteyn had brittle stubbornness and lacked polish. In spite of her perceived shortcomings, he cast her as the lead, playing the Creole girl in his production, Rio Grande. When Alicia Markova, the first Prima Ballerina of the company, left the Vic-Wells later in 1935, Fonteyn shared the lead with other members of the company, but quickly rose to the top of the field of dancers. That year, she spent her summer holidays in Paris, where she studied with the exiled Russian ballerinas Olga Preobrajenska, Mathilde Kschessinska, and Lubov Egorova. She returned for further studies with them the following summers. "]}, {"page": "Anton Dolin (ballet dancer)", "response": ["Dolin was born in Slinfold in Sussex as Sydney Francis Patrick Chippendall Healey-Kay but was generally known as Patrick Kay or \"Pat\" to his friends. He was the second of three sons of Henry George Kay (1852-1922) and his wife, Helen Maude Chippendall Healey (1869-1960), from Dublin. He trained at Serafina Astafieva's school at The Pheasantry in London's King's Road.Decharne, Max. (2005) King's Road: The Rise and Fall of the Hippest Street in the World. London: Weidenfeld & Nicolson, p. 23.  He joined Sergei Diaghilev's Ballets Russes in 1921, was a principal there from 1924, and was a principal with the Vic-Wells Ballet in the 1930s. There he danced with Alicia Markova, with whom he went on to found the Markova-Dolin Ballet and the London Festival Ballet.", "Dolin wrote several books, including the autobiography Ballet Go Round (1938) and Alicia Markova: Her Life and Art (1953). "]}, {"page": "Royal Academy of Dance", "response": ["*Alicia Markova, English prima ballerina assoluta and co-founder of English National Ballet"]}, {"page": "2004 in the United Kingdom", "response": ["**Alicia Markova, ballerina (born 1910)"]}, {"page": "Bronislava Nijinska", "response": ["\"She was a very strong dancer, and danced very athletically for a lady, and had a big jump,\" commented Frederic Franklin, a dancer and ballet master. \"She had incredible endurance, and seemed never to be tired,\" recalled Anatole Vilzak, who was a principal dancer in many of her mature choreographies.Baer (1986), pp. 74-77: Vilzak for Ballets Russes, Teatro Colón, Ida Rubinstein. English dancer Lydia Sokolova, noting her lack of makeup, thought she appeared \"a most unfeminine woman, though there was nothing particularly masculine about her character. Thin but immensely strong, she had iron muscles in her arms and legs, and her highly developed calf muscles resembled Vaslav's; she had the same way of jumping and pausing in the air.\" Alicia Markova, a prima ballerina absoluta of Britain, concluded that Nijinska \"was a strange combination, this terrific strength, and yet there was a softness.\"Garafola (2005), pp. 199–200 (four quotes).Harss (2017): Garafola currently working on a Nijinska biography.", "She was twenty-five. The 1915 program described her as \"the celebrated prima ballerina-artist of the State Ballet\". The music for her dance creation Autumn Song was by Pyotr Ilyich Tchaikovsky, and for The Doll by Anatoly Liadov. On that program, performed at the Narodny Dom [People's House], were also ballets choreographed by Michel Fokine of Ballets Russes, to be danced by Nijinska and her husband. Her choreography for Autumn Song, \"the more important\" of her two solos, \"owed a debt to Fokine\".Garafola (2005), pp. 194–195, at 194 (quotes). Autumn Song's choreography was not lost. In the 1930s Nijinska taught it to Alicia Markova who in 1953 performed the ballet for television.", "Alicia Markova was a leading ballerina of London. In 1935 she left the Vic-Wells ballet company of Ninette de Valois, where she had excelled in classical roles. She left to \"form the Markova-Dolin Company (1935–1938), with Bronislava Nijinsky as chief choreographer.\" Irish dancer Anton Dolin had worked with Ballets Russes starting in 1921. Later he was the 'handsome swimmer' in Nijinska's 1924 Le Train Bleu. During the 1930s he became a frequent dance partner of Markova. He joined American Ballet Theatre in 1940.de Mille (1990), pp. 26, 27 (quote re Markova, Nijinska); re Dolin, pp. 26, 28.Koegler (1977), p. 161 (Dolin), pp. 347-348 (Markova).", "In the 1930s Nijinska gave Alicia Markova 'creative sessions' in ballet, including instructions for her own choreographies. In particular she taught Markova an early work of hers from Kiev: Autumn Song to music by Tchaikovsky. Nijinska had originally danced it barefoot wearing a tunic of her own design. In 1953 Markova performed this solo ballet for a variety show on NBC television.Garafola (2005), pp. 194–195, re Autumn Song for NBC television's Show of Shows.Kisselgoff (1986), 'creative sessions'.Baer (1986), p. 73: Autumn Song (1915).", "Throughout her career, starting earlier than her 1919 'L'Ecolé de Mouvement' in Kiev, Nijinska had taught dance. A ballet role to her colleagues she'd demonstrate, or to the cast her newly created choreographies. In 1922 she had started teaching at Ballets Russes, taking over from Enrico Cecchetti.Sokolova (1960, 1989), p. 229.Cf. Garafola (1989), p. 435, n61. Among her earlier students: Serge Lifar in revolutionary Kiev; Anton Dolin, Lydia Sokolova, Frederick Ashton, Alicia Markova, Irina Baronova, David Lichine in interwar Europe; Lucia Chase in New York.Sokolova (1960, 1989), re Dolin p. 213; re Sokolova p. 226 and cf. pp. 216, 79, 74, 68, 66.Koegler (1977), p. 114 (Lifar, Ashton, Markova, Chase).García-Márquez (1990), p. 146 (Baronova);  pp. 83, 85 (Lichine). Her auditions in the 1930s were conducted in the form of a short class.Severn (1988), at pp. 691-692 in Gottlieb (2008)."]}, {"page": "George Zoritch", "response": ["In 1951, Zoritch went to France and joined Le Grand Ballet du Marquis de Cuevas. Based in Cannes in summer and Deauville in winter, this company had regular seasons in Paris and often toured in France and other countries of western Europe. Wherever it performed, it was extremely popular with audiences. It had an illustrious roster of ballerinas, including Tamara Toumanova, Alicia Markova, and Nathalie Krassovska, and a strong repertory of Russian classics as well as works by Harold Lander, George Balanchine, George Skibine, and John Taras.Irène Lidova, \"Grand Ballet du Marquis de Cuevas,\" in International Encyclopedia of Dance, edited by Selma Jeanne Cohen and others (New York: Oxford University Press, 1998), vol. 3, p. 226. Zoritch danced the princely roles but was often cast in works that showcased the beauty of his physical features rather than the artistry of his dancing. He once took eighteen curtain calls after a performance of Le Spectre de la Rose, in a new version choreographed by Bronislava Nijinska. Costumed as the Spectre in a sheer, rose-colored body stocking with a single strand of small roses trailing across his bare chest and over one shoulder, his beautifully proportioned figure was perfectly revealed. It is little wonder at the audience's prolonged applause. There is a famous photograph by Maurice Seymour of Zoritch in this role, standing in repose with arms curved softly aloft, that has been much admired and frequently reproduced.Maurice Seymour, photograph of George Zoritch in costume for Le Spectre de la Rose, in Jerome Robbins Dance Division of the New York Public Library for the Performing arts."]}, {"page": "American Ballet Theatre", "response": ["* Alicia Markova (1941–1946)"]}, {"page": "2004 in British music", "response": ["*2 December – Alicia Markova, 94, ballerina"]}, {"page": "Frederic Franklin", "response": ["While performing internationally with the Ballet Russe de Monte Carlo, Franklin and Alexandra Danilova created one of the legendary ballet partnerships of the twentieth century. Among the other ballerinas he partnered were Alicia Markova, Yvette Chauviré, Moira Shearer, Rosella Hightower, Maria Tallchief, Tamara Toumanova, and Alicia Alonso. In addition, he performed roles such as the Baron in Gaite Parisienne, the Baron in Night Shadow (La Sonnambula), and the Champion Roper in Rodeo."]}, {"page": "Royal Alexandra Theatre", "response": ["* Alicia Markova"]}, {"page": "Maude Lloyd", "response": ["On returning to England in 1930, Lloyd was among Rambert's students who became founding members of her Ballet Club, the performing group from which Ballet Rambert was to evolve.Marie Rambert, Quicksilver: An Autobiography (London: Macmillan, 1972). She danced with this group at several West End theaters and on tours outside London, as well as appearing in repertory works with the Camargo Society. From 1930 onward, she was a leading dancer in the regular Sunday performances of Rambert's Ballet Club at the Mercury Theatre in Notting Hill Gate.Peter Williams, \"Lloyd, Maude,\" in International Encyclopedia of Dance, edited by Selma Jeanne Cohen and others (New York: Oxford University Press, 1998), vol. 4, p. 215. Other members of the club included emerging choreographers Frederick Ashton, Antony Tudor, and Andrée Howard, each of whom would respond to Lloyd's technical ability, as well as her intelligence, elegance, and sensitivity, by creating roles for her in their works.David Vaughan, Frederick Ashton and His Ballets (New York: Knopf, 1977).Donna Perlmutter, Shadowplay: The Life of Antony Tudor (New York: Viking, 1991).Katherine Sorley Walker, \"The Choreography of Andrée Howard,\" Dance Chronicle (New York), 13.3 (Winter 1980-81), pp. 265 et seq. With occasional brief absences—to dance with other British companies and to visit South Africa once more, in 1932—Lloyd remained with Ballet Rambert until 1940. She followed Pearl Argyle and Alicia Markova, the company's first ballerinas, in many of their created roles but soon had new roles of her own."]}, {"page": "Léonide Massine", "response": ["A month after premiering Gaîté Parisienne Massine produced Seventh Symphony, to Beethoven's score. It premiered on 5 May 1938 in Monte Carlo, with Alicia Markova, Nini Theilade, Frederic Franklin, and Igor Youskevitch as the principal dancers."]}, {"page": "Dame Alicia Markova", "response": ["#REDIRECT Alicia Markova"]}, {"page": "The Royal Ballet", "response": ["Sadler's Wells reopened in 1931 and the Vic-Wells Ballet and Vic-Wells Ballet School were established in premises at the theatre. These would become the predecessors of today's Royal Ballet, Birmingham Royal Ballet and Royal Ballet School. Prior to her return to Britain, Ninette de Valois had been a member of the Ballets Russes, one of the most renowned and influential ballet companies of the 20th century. The company disbanded in 1929 following the death of its founder Serge Diaghilev. When de Valois formed the Vic-Wells Ballet, she employed some of the company's former stars, including Alicia Markova and Anton Dolin, who joined as Principal dancers, and Tamara Karsavina, who worked with the company as an advisor. The Founder Musical Director was the conductor and composer Constant Lambert who had considerable artistic as well as musical influence over the early years of the company.Vaughan D. Frederick Ashton and his Ballets. A & C Black Ltd, London, 1977.", "The first was Alicia Markova who, having been mentored by Ninette de Valois as a member of Serge Diaghilev's Ballets Russes, was invited to become one of the founder dancers of the Royal Ballet. She was designated the company's first Prima ballerina, and was later recognised as a Prima ballerina assoluta.", "*Dame Alicia Markova, DBE"]}, {"page": "Royal Ballet School", "response": ["The Royal Ballet School is unique in having trained four of only a small number of dancers in history to have been recognised as prima ballerina assoluta, the ultimate honorary title for a ballerina. Exclusively trained at The Royal Ballet School and dancing her entire professional career with The Royal Ballet, Margot Fonteyn was appointed prima ballerina assoluta of the company by Queen Elizabeth II in 1979. Having trained at The Royal Ballet School from 1959 to 1966, Eva Evdokimova would go on to become an international guest ballerina, being recognised as a prima ballerina assoluta following her performances with the Kirov Ballet in the late 1970s. The title was later recognised officially by the German Senate. Phyllis Spira began training at the Royal Ballet School in 1959, joining the Royal Ballet touring company in 1960. Choosing to shun an international ballet career, she returned to her native South Africa, where she danced the majority of her career with CAPAB ballet, today's Cape Town City Ballet. She was appointed prima ballerina assoluta by the State President of South Africa in 1984. Most recently, Royal Ballet School graduate Alessandra Ferri was appointed prima ballerina assoluta of La Scala Theatre Ballet in 1992. Citing Alessandra Ferri as prima ballerina assoluta of La Scala Another British ballerina, Alicia Markova, was also tutored by Royal Ballet School founder Ninette de Valois, and would go on to be a leading ballerina with the Ballets Russes, the first Prima Ballerina of The Royal Ballet, a founder ballerina with American Ballet Theatre, and co-founder of English National Ballet who now recognise her as the company's prima ballerina assoluta. Although not trained at The Royal Ballet School, this direct connection with school founder Ninette de Valois brings the total up to five."]}, {"page": "Lilian Baylis", "response": ["In 1925, Baylis began a campaign to re-open the derelict Sadler's Wells Theatre, something she finally achieved with a gala opening on 6 January 1931 of a production of Shakespeare's Twelfth Night starring John Gielgud as Malvolio and Ralph Richardson as Toby Belch. Acquiring Sadler's Wells enabled Baylis to develop her plans for a dance company,  something she had wished to do since 1928 when she hired Ninette de Valois to improve the standard of dancing in operas and plays at the Old Vic. For several years the opera, drama and ballet companies known as the \"Vic-Wells\" companies, moved between the Old Vic and Sadler's Wells but by 1935 the ballet company, which now included Margot Fonteyn and Robert Helpmann, with guest appearances from Alicia Markova and Anton Dolin, tended to perform at Sadler's Wells. Musical direction was by Constant Lambert, and choreography for new works by de Valois and rising star Frederick Ashton. The ballet company's descendants today are the Royal Ballet and the Birmingham Royal Ballet. Today the Sadler's Wells Theatre is primarily a dance venue."]}, {"page": "Celia Franca", "response": ["Franca was born Celia Franks in London, England, the daughter of an East End tailor. Her family were Polish Jewish immigrants.\"York grad writes first biography of National Ballet Founder Celia Franca\". Aumni News, 2011-11-29. York University. She began to study dance at the age of four and was a scholarship student at the Guildhall School of Music and the Royal Academy of Dance.\"National Ballet founder dies at 85\". The Globe and Mail, Sandra Martin, 19 February 2007 She made her professional debut aged 14. She successfully auditioned for Marie Rambert's ballet company in 1936. She changed her name to Franca in emulation of Alicia Marks, who changed hers to Alicia Markova.Obituary, Jewish Chronicle, 13 April 2007, p. 20 She entered into the first of three marriages, to fellow dancer Leo Kersley.\"Shedding new light on Celia Franca\". Toronto Star, Michael Crabb, 13 Dec. 2011"]}, {"page": "Vladimir Tretchikoff", "response": ["His Chinese Girl, a 1952 painting featuring Eastern model, Monika Pon-su-san,\"Face to face with the woman who is Tretchi's Chinese Girl\", Mail & Guardian (Johannesburg), 20 May 2011 with blue-green skin, is one of the best selling prints of the twentieth century. Prints of the painting became widespread during the 1950s and 1960s, and the painting was featured in various plays and television programmes including Alfred Hitchcock's Frenzy (1972) and, with a drawn moustache, in an episode of Monty Python's Flying Circus. Other popular paintings of oriental figures were Miss Wong, Lady from Orient, and Balinese Girl. He said of British prima ballerina assoluta, Alicia Markova, who sat for Alicia Markova \"The Dying Swan\", that she was his most stimulating sitter.", "*Alicia Markova \"The Dying Swan\""]}, {"page": "Mathilde Kschessinska", "response": ["After the October Revolution, Kschessinskaya moved first to the French Riviera and then to Paris, where she married, in 1921, one of the tsar's cousins, Grand Duke Andrei Vladimirovich of Russia, the possible father of her son Vova. Although Kschessinskaya's life in Paris was modest compared with the lavish life she had enjoyed in Russia, she lived on happily for over 50 years. In 1925, she converted from Catholicism to Russian Orthodoxy and took the name Maria. In 1929, she opened her own ballet school, where she taught such students as Dame Margot Fonteyn, Dame Alicia Markova, André Eglevsky, Tatiana Riabouchinska, Tamara Toumanova, Mona Inglesby  and Maurice Béjart. She performed for the last time at the age of 64, for a charity event with The Royal Ballet at Covent Garden."]}, {"page": "Prima ballerina assoluta", "response": ["Other dancers awarded the title include Anneli Alhanko from Sweden, Alicia Alonso from Cuba, Alessandra Ferri from Italy,\"Ballet Company\".  Teatro alla Scala. Ballet Company, citing appointment as prima ballerina assoluta of La Scala in 1992. (archived link, 10 July 2010) and Alicia Markova and Margot Fonteyn from England.", " | Alicia Markova"]}, {"page": "Jacob's Pillow Dance", "response": ["Significant debt forced Shawn to consider sale of the property.  In 1940, he leased the property to dance teacher Mary Washington Ball, but her summer festival was also financially unsuccessful.  British ballet stars Alicia Markova and Anton Dolin learned of Shawn's financial difficulties, and decided to acquire the property.  With financial backing and fundraising support from millionaire Reginald Wright, $50,000 was raised to purchase the property and construct a theater building.  The summer dance festival was revived, and Shawn was retained as its director until his death in 1972."]}, {"page": "English National Ballet", "response": ["English National Ballet is a classical ballet company founded by Dame Alicia Markova and Sir Anton Dolin as London Festival Ballet and based in London, England. Along with The Royal Ballet, Birmingham Royal Ballet, Northern Ballet and Scottish Ballet, it is one of the five major ballet companies in Great Britain.  English National Ballet is one of the foremost touring companies in Europe, performing in theatres throughout the UK as well as conducting international tours and performing at special events. The Company employs approximately 67 dancers and a symphony orchestra, (English National Ballet Philharmonic). In 1984 Peter Schaufuss became director and changed the name to English National Ballet and founded the school English National Ballet School, which is independent from the ballet company but joining the company premises in the new building. The Company regularly performs seasons at the London Coliseum and has been noted for specially staged performances at the Royal Albert Hall. In 2014 English National Ballet became an Associate Company of Sadler's Wells.", "English National Ballet was founded in 1950 as Gala Performances of Ballet by the British dance couple, Alicia Markova and Anton Dolin. The Company later adopted the name Festival Ballet, then London Festival Ballet, and in June 1989, English National Ballet."]}, {"page": "Rosella Hightower", "response": ["She joined the de Basil Ballet in 1946, which was performing under the name Original Ballet Russe. Hightower received acclaim from John Martin of The New York Times after a March 1947 performance of Giselle by the Original Ballet Russe at the Metropolitan Opera House. After Alicia Markova, who had been scheduled to dance the title role, became sick, Hightower was called in as her replacement, and learned the part she had never danced before in some five hours of rehearsal with dancer/choreographer Anton Dolin. Martin's review stated that the \"Original Ballet Russe had planned no novelty for the opening of its season... but there was a major one on its program nevertheless. This was the unscheduled first appearance of Rosella Hightower in the title role of Giselle\", calling it \"a thoroughly admirable achievement, which brought an ovation from the audience\".Martin, John. \"Rosella Hightower Scores in Giselle Role, Replacing Markova, as Ballet Russe Opens\", The New York Times, March 21, 1947. Accessed November 5, 2008. Three days later, Martin's review of Swan Lake called Hightower \"the newest star on the ballet horizon\" after her two performances with Dolin and then André Eglevsky as her partnerMartin, John. \"THE BALLET RUSSE AT METROPOLITAN; Rosella Hightower Seen Twice in 'Swan Lake\" – Monte Carlo Troupe at City Center\", The New York Times, March 24, 1947. Accessed November 5, 2008."]}, {"page": "Harringay Arena", "response": ["From 27 August to 1 September, along with Empress Hall, Earl's Court, Harringay Arena was the venue for a series of five gala performances by Alicia Markova, Anton Dolin and the Ballet Rambert. The success of these performances led to the formation of the English National Ballet."]}, {"page": "Enrico Cecchetti", "response": ["Among his notable students there were:  Anna Pavlova, Cia Fornaroli, Pierina Legnani, Léonide Massine, Attilia Radice, Vaslav Nijinsky, Tamara Karsavina, Dame Ninette de Valois, Dame Marie Rambert, Gisella Caccialanza, Vincenzo Celli, Luigi Albertieri, Dame Alicia Markova, Olga Preobrajenskaja, Matilda Kšesinskaja, Serge Lifar, George Balanchine, Ruth Page."]}, {"page": "Doctor of Music", "response": ["The Doctor of Music degree has also been awarded honoris causa when presented to musicians and composers such as: Joseph Haydn, Richard Strauss, Pyotr Ilyich Tchaikovsky, Franz Liszt, Johannes Brahms, Felix Mendelssohn, Sir Simon Rattle in classical music, and Joan Baez, Matthew Bellamy, David Bowie, Phil Collins, Bruce Dickinson, Celine Dion, Irene Dunne, Bob Dylan, Kenny Garrett, Sir Barry Gibb, Robin Gibb, David Gilmour, Milt Hinton, Billy Joel, Nik Kershaw, Sir Elton John, B.B. King, Mark Knopfler, Annie Lennox, Jon Lord, Sir Paul McCartney, Joni Mitchell, Sir Van Morrison, Jimmy Page, Paul Simon, Joe Walsh, Brian Wilson, Stevie Wonder and Neil Young in popular music. It has also been awarded as an honorary degree to musical artists who were not composers, including the ballet dancers Dame Alicia Markova and Dame Beryl Grey, as well as female royalty regardless of their experience in music."]}, {"page": "Pas de Quatre (Perrot)", "response": ["Nearly one hundred years later, in 1941, a new version of Pas de quatre was staged by choreographer Anton Dolin. The dancers he used were, in order of appearance: Nathalie Krassovska as Lucile Grahn, Mia Slavenska as Carlotta Grisi, Alexandra Danilova as Fanny Cerrito, and Alicia Markova as Marie Taglioni. Since then many ballet companies have performed the piece."]}, {"page": "Avenue of Stars, London", "response": ["*Alicia Markova"]}]}}