{"wiki_id": "http://www.wikidata.org/entity/Q1799574", "itemLabel": "Vic Hoyland", "itemDescription": "British composer", "wikipedia_url": "https://en.wikipedia.org/wiki/Vic_Hoyland", "wikipedia_page": {"main": "Vic Hoyland (born 11 December 1945) is a British composer.\nHe was born in Wombwell, Yorkshire, England.\nEducated at Hull and York universities (where he completed his PhD), Hoyland was Haywood Fellow at the University of Birmingham where he became Professor in Composition until his retirement in 2011. He now lives in the North Yorkshire moors.\nInfluenced by Luciano Berio and Franco Donatoni, Hoyland has composed pieces for the BBC Symphony Orchestra, the Arditti Quartet and the Lindsay String Quartet. A CD of two orchestral works, Vixen and In Transit, featuring the BBC Symphony Orchestra under Martyn Brabbins was released by NMC in 2002.\n\n", "link_mentions": [{"page": "Birmingham Contemporary Music Group", "response": ["2009: Vic Hoyland: Hey Presto!... moon - flower - bat"]}, {"page": "John Abram", "response": ["Born in England, Abram became interested in music when he was six; he began composing in his teenage years. He took composition lessons with Roger Marsh and Peter Dickinson at Keele University,John Abram  at Canadian Music Centre Atlantic Hub also studying the recorder with Alan Davis; since that time he has also studied composition with Vic Hoyland, Bernard Rands, and Boguslav Schäffer. Abram graduated in 1980 with a Bachelor of Science degree, earning his master's in composition in 1982. Upon leaving school, he moved to London, where he helped found the new music ensemble George W. Welch."]}, {"page": "Jonty Harrison", "response": ["Jonty Harrison studied with Bernard Rands at the University of York, graduating with a DPhil in Composition in 1980. Between 1976 and 1980 he lived in London, working at the National Theatre (where he produced the tape components for many productions, including Tamburlaine the Great, Julius Caesar, Brand and Amadeus) and City University. In 1980 he joined the Music Department of The University of Birmingham, where he was Professor of Electroacoustic Composition, as well as Director of BEAST (Birmingham ElectroAcoustic Sound Theatre) and the Electroacoustic Music Studios; for ten years he was Artistic Director of the department's annual Barber Festival of Contemporary Music. He has played an active role in musical life, making conducting appearances with the Birmingham Contemporary Music Group (most notably conducting Stockhausen's Momente in Birmingham, Huddersfield and London), the University New Music Ensemble and the University Orchestra (most recently in Stravinsky's Le sacre du printemps and Vic Hoyland's Vixen). He was a Board member of Sonic Arts Network (SAN) for many years (and Chair between 1993 and 1996). He has also been on the Council and Executive Committee of the Society for the Promotion of New Music and was a member of the Music Advisory Panel of The Arts Council of Great Britain."]}, {"page": "University of York Music Press", "response": ["* Vic Hoyland"]}, {"page": "Victor Hoyland", "response": ["#REDIRECT Vic Hoyland"]}, {"page": "Adina Izarra", "response": ["Adina Izarra was born in Caracas, Venezuela. She studied music under  Alfredo del Mónaco in Caracas and received her Ph.D. in composition from York University, England, in 1988, after studying with Vic Hoyland."]}, {"page": "Michael Wolters", "response": ["Michael Wolters is a British composer of German origin. He was born in 1971 in Mönchengladbach, Germany, grew up in Niederkrüchten, a small German village on the Dutch border and now lives in Birmingham, UK. After working as a care worker in a children's home and a runner at several theatres in Germany and Scarborough he studied Applied Theatre Studies at Justus-Liebig-Universität Giessen, Germany and Composition and Theatre Studies at the University of Huddersfield (BA, MA) and finally received his PhD in Composition from the University of Birmingham in 2003. His composition teachers include Christopher Fox, Heiner Goebbels, Patric Standford and Vic Hoyland. Since 2009 he has been Deputy Head of Composition at Birmingham Conservatoire. He is a founder member of the artists' collective New Guide to Opera."]}, {"page": "Roland Dahinden", "response": ["He was born in Zug, Switzerland. He studied the trombone and composition at Musikhochschule Graz with Erich Kleinschuster and Georg Friedrich Haas, at Scuola di Musica di Fiesole Florenz with Vinko Globokar). He earned an MA at Wesleyan University in Connecticut (1994), studying with Anthony Braxton, Alvin Lucier and a PhD at Birmingham University, England (2002), studying with Vic Hoyland. In 2003, he was awarded the \"werkjahr\" prize of the art council of the Canton of Zug, Switzerland."]}, {"page": "Hoyland (surname)", "response": ["*Vic Hoyland (born 1945), English classical composer"]}]}}