{"wiki_id": "http://www.wikidata.org/entity/Q1797980", "itemLabel": "Sukie Smith", "itemDescription": "British actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Sukie_Smith", "wikipedia_page": {"main": "Sukie Smith (born 23 September 1964) is a British actress and musician. Her credits include the role of Rachel Branning in EastEnders in 2006, as well as appearances in Peak Practice and Doctors. She also appeared in several films, including Lawless Heart and Topsy Turvy.\nShe is an accomplished composer and has written the soundtrack for Hush Your Mouth, the debut feature for Neophyte Films directed by Tom Tyrwhitt. Smith writes and records songs and poems, which are performed under the name Madam. She has collaborated with artists such as Saskia Volde to make the Tate Gallery exhibited piece \"Placebo\". Her shows are regularly attended by English artists such as Georgina Starr, Paul Noble and Tim Noble and Sue Webster.", "link_mentions": [{"page": "1999 in film", "response": ["| Topsy-Turvy || USA Films / Pathé Distribution || Mike Leigh (director/screenplay); Jim Broadbent, Allen Corduner, Lesley Manville, Ron Cook, Eleanor David, Timothy Spall, Vincent Franklin, Martin Savage, Dexter Fletcher, Dorothy Atkinson, Shirley Henderson, Kevin McKidd, Louise Gold, Michael Simkins, Andy Serkis, Naoko Mori, Sukie Smith, Theresa Watson, Ashley Jensen, Mark Benton, Steve Speirs, Sam Kelly, Jonathan Aris, Alison Steadman, Adam Searle, Katrin Cartlidge, Brid Brennan || Musical, Drama || Live action"]}, {"page": "1990 in film", "response": ["| The Witches || Warner Bros. Pictures || Nicolas Roeg (director); Allan Scott (screenplay); Anjelica Huston, Mai Zetterling, Jasen Fisher, Rowan Atkinson, Jane Horrocks, Charlie Potter, Anne Lambton, Angelique Rockas, Annabel Brooks, Sukie Smith, Bill Paterson, Brenda Blethyn, Jenny Runacre, Emma Relph, Rose English, Nora Connolly, Rosamund Greenwood, Darcy Flynn, Vincent Marzello, Elsie Eide, Grete Nordrå, Ola Otnes, Merete Armand, Jim Carter, Roberta Taylor, Stella Tanner, Barbara Hicks, Michael Palin || Comedy, Fantasy || Live action"]}, {"page": "Topsy-Turvy", "response": ["* Sukie Smith as Clothilde, Sullivan's maid"]}, {"page": "Peak Practice", "response": ["*Kirsty Attwood – Sukie Smith (recurring 1996, guest 1997)"]}, {"page": "List of former EastEnders characters", "response": ["| Sukie Smith"]}, {"page": "The Witches (1990 film)", "response": ["* Sukie Smith as Marlene, a maid at the hotel"]}, {"page": "Bradley Branning", "response": ["Bradley was conceived when his parents, Max (Jake Wood) and Rachel (Sukie Smith; Pooky Quesnel), were just 18 years old. The three of them lived happily as a family for nearly six years. However, Max could not cope with being a young husband and father and eventually began an affair with an 18-year-old girl, Tanya Cross (Jo Joyner). When Tanya became pregnant, Max left his wife and son to marry his mistress. Bradley never fully recovered from his father's abandonment."]}, {"page": "Branning family", "response": ["Between 2006 and 2012, new influx of Branning's joined the show - Max Branning (Jake Wood), his wife Tanya (Jo Joyner) and their children Lauren (Madeline Duggan/Jacqueline Jossa) and Abi (Lorna Fitzgerald). Max and Tanya later had another child Oscar Branning in 2007. Max's son with his ex-wife Rachel (Sukie Smith/Pooky Quesnel); Bradley Branning (Charlie Clements) was introduced earlier in 2006. Jim's son Jack Branning (Scott Maslen) and his daughter Penny Branning (Mia Mckenna-Bruce) were introduced in 2007 and 2008, as well as Bianca's children Liam Butcher (James Forde), Tiffany Dean (Maisie Smith), Morgan Jackson-King (Devon Higgs) and her ward Whitney Dean (Shona McGarty) in 2008. Suzy Branning (now played by Maggie O'Neill) also returned to the show for a five months the same year. In February 2010, Carol returned to the show with her son Billie, who was killed off months later. Once again in 2011, the Branning family were rejuvenated with the return of Derek Branning (now played by Jamie Foreman), alongside the introduction of his children Joey Branning (David Witts) and Alice Branning (Jasmyn Banks) the following year. Carol's daughter Sonia returned in 2014 with her daughter Bex Fowler (Jasmine Armfield), as did Robbie in both 2015 and 2017 and Bianca in 2019.", "The Branning family were introduced as an extension to the established Jackson family consisting of Carol Jackson (Lindsay Coulson), her children Bianca Jackson (Patsy Palmer), Robbie Jackson (Dean Gaffney), Sonia Fowler (Natalie Cassidy) and Billie Jackson (Devon Anderson), her husband Alan Jackson (Howard Antony) and his grandmother Blossom Jackson (Mona Hammond). Carol's father Jim Branning, played by John Bardon, had appeared in the show in 1996 as a guest character and was reintroduced in 1999 as a regular by Matthew Robinson. Three other of Jim's children, April Branning (Debbie Arnold), Derek Branning (Terence Beesley) and Sue Branning (Julie Christian-Young) also appeared in 1995 and 1996, as well as his first wife Reenie Branning (Joy Graham), who died off screen in 1999, allowing Jim to move in with his grandchildren. Jim was paired romantically with Dot Cotton (June Brown), and the couple married on screen in February 2002. The family was extended in 2005 with the arrival of Jim's grandson Bradley Branning (Charlie Clements), in January 2006. Bradley's arrival prompted a series of complaints from residents in the Hertfordshire town of Tring, where Bradley had allegedly lived before he moved to East London, as they thought their town had been portrayed as \"snobbish\". The BBC responded by saying that Tring was chosen following a storyline conference in the town, where the production team enjoyed their stay, saying that Bradley was not a snob but was portrayed as a character who led a sheltered life because his father left him when he was young. In 2006, scriptwriters decided to pair Bradley with the character Stacey Slater, played by Lacey Turner. Meanwhile, actor Jake Wood was introduced as Bradley's estranged father Max Branning, along with his second wife Tanya Branning (Jo Joyner) and their two daughters Lauren Branning (Madeline Duggan from 2006 to 2010, Jacqueline Jossa since 2010) and Abi Branning (Lorna Fitzgerald). Max, a serial womaniser, had left Bradley with his mother Rachel Branning, played by Sukie Smith in 2006 and Pooky Quesnel from 2007 onwards, after an affair with Tanya, and had not seen his son for several years. Max arrived with a mistress, Gemma Clewes (Natalie J. Robb), who was warned off by Bradley. Scott Maslen was announced as the latest member of the Branning clan, Jim's youngest son Jack Branning, in July 2007. Minor appearances followed from Jack's ex-wife Selina Branning and daughter Penny Branning (Mia McKenna-Bruce). Sue, renamed Suzy, was reintroduced in 2008 played by Maggie O'Neill, though she departed later that year. Bardon suffered a stroke in 2007, and a storyline was written in which Jim tended to a sick Carol, and suffered a stroke while he was there. Dot and Jim remained together, with Jim making sporadic appearances throughout 2008 and 2009 to visit Dot, and Bardon made a more permanent return to the show in late 2009, which lasted until 2011."]}, {"page": "List of EastEnders characters (2006)", "response": ["Rachel Branning is played by Sukie Smith in 2006, and Pooky Quesnel from 2007 to 2010. She is the mother of Bradley Branning (Charlie Clements), and former wife of Max (Jake Wood). She arrives in Albert Square after Bradley's grandfather Jim (John Bardon) threw him out."]}, {"page": "Pooky Quesnel", "response": ["She played Dr Monica Broome in the first series of Cardiac Arrest and DC Grace Harris in the first two series of Thief Takers. She had a recurring role in the third series of Cold Feet as Emma Keaton and returned to medical dramas in 2006, playing Dr Christine Whelan in The Golden Hour. In 2007, she starred as Nita in the BBC One series True Dare Kiss, and later that year began a recurring role in EastEnders as Rachel Branning, taking over the character from Sukie Smith. In February 2008, she played the spoken title role in a City of Birmingham Symphony Orchestra production of Stravinsky's Perséphone, broadcast on BBC Radio 3. In July 2008, she appeared in an episode of the ITV murder mystery series, Midsomer Murders as journalist Julie Benson, and in an episode of George Gently entitled \"The Burning Man\", playing the character Wanda Lane. In March 2010, she appeared as Maureen in BBC One's second series of Five Days. She also played the spaceship captain in the Doctor Who 2010 Christmas special, \"A Christmas Carol\". In November 2010, she appeared as Christopher Eccleston's character's wife in Jimmy McGovern's Accused."]}, {"page": "A Summer Story", "response": ["* Sukie Smith - Betsy "]}, {"page": "Madam (band)", "response": ["Madam is a five-piece London based band, fronted by Sukie Smith. Their music is often described as possessing a smoky, nocturnal quality with a pop sensibility that has led to comparisons to artists such as Portishead, The Velvet Underground, PJ Harvey and Cat Power, as well as more mainstream artists such as Goldfrapp and Fleetwood Mac."]}, {"page": "Brand New-U", "response": ["*Sukie Smith as Waitress 'Sarah'"]}, {"page": "Hetty Feather (TV series)", "response": ["| Madame Adeline || Sukie Smith || 1x09–1x10"]}, {"page": "Sukie (disambiguation)", "response": ["* Sukie Smith (born 1964), English actress and musician"]}]}}