{"wiki_id": "http://www.wikidata.org/entity/Q17986758", "itemLabel": "John Lucas", "itemDescription": "British painter", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Lucas_(painter)", "wikipedia_page": {"main": "John Lindsay Lucas (1807–1874) was an English portrait painter.", "link_mentions": [{"page": "John Lucas", "response": ["John Lucas may refer to:", "*John Lucas (Australian politician) (1818–1902), Australian politician in New South Wales", "*John Lucas (MP for Colchester) (by 1512–1556), MP for Colchester", "*John Lucas (MP for Gloucester), Member of Parliament in 1311", "*John Lucas II (born 1953), American professional basketball player and head coach", "*John Lucas III (born 1982), American professional basketball player and assistant coach", "*John Lucas (cricketer) (1922–2008), West Indian and Canadian cricketer", "*John Lucas (footballer) (1869–1953), Australian rules footballer for Geelong", "*Jack Lucas (footballer) (John Lucas, born 1961), Australian rules footballer for Sydney", "*John Lucas (British Army officer) (1921–2013), British soldier with the Chindits", "*John Lucas (VC) (1826–1892), Irish recipient of the Victoria Cross", "*John Lucas, 1st Baron Lucas of Shenfield (1606–1671), English Royalist soldier, industrialist and landowner", "*John Lucas (comics), American comic book artist", "*John Lucas (historian) (1684–1750), historian of Warton, Lancashire, England", "*John Lucas (painter) (1807–1874), English artist", "*John Lucas (philosopher) (1929–2020), British philosopher", "*John Lucas (poet) (born 1937), British poet, critic, travel writer, literary historian, anthologist and publisher", "*John Lucas (priest) (1921–1992), Archdeacon of Totnes", "*St. John Lucas (1879–1934), English poet"]}, {"page": "Nicholas Conyngham Tindal", "response": ["Chelmsford Museum holds a portrait by John Lucas (1807–1874), and portraits of his parents Robert Tindal, by John Jackson (1778–1831) and Sally Tindal, née Pocock (by an unknown artist)."]}, {"page": "John Seymour Lucas", "response": ["John Seymour Lucas  (21 December 1849 – 8 May 1923) was a Victorian English historical and portrait painter, as well as an accomplished theatrical costume designer. He was born into an artistic London family (he was the nephew of the painter John Lucas), and originally trained as a woodcarver, but turned his attention to portrait painting and entered first the St. Martin's Lane Art School and later the Royal Academy Schools. Here he met fellow artist Marie Cornelissen from France, whom he married in 1877. Lucas' artistic education included extensive travels around Europe, particularly Holland and Spain, where he studied the Flemish and Spanish masters. He first started exhibiting in 1872, was elected an associate member of the Royal Academy in 1886,https://www.royalacademy.org.uk/art-artists/exhibition-catalogue/ra-sec-vol118-1886 and a full Royal Academician in 1899.https://www.royalacademy.org.uk/art-artists/exhibition-catalogue/ra-sec-vol131-1899"]}, {"page": "John Lucas (artist)", "response": ["#REDIRECT John Lucas (painter)"]}, {"page": "List of burials at Kensal Green Cemetery", "response": ["* John Lucas (1807–1874)"]}, {"page": "Institute for Contemporary Art, Richmond", "response": ["Great Force was an exhibition at the ICA which took as its theme the idea of great force expressed by James Baldwin and addressed \"the force of whiteness, the counter-force of black resistance, and the persistence of the color line in the United States.\" The exhibition opened in October 2019 and extended through January 5, 2020. Exhibiting artists included: Radcliffe Bailey, Benae Beamon, Kevin Beasley, Alexandra Bell, Paul Stephen Benjamin, Sedrick Chisom, Tony Cokes, Bethany Collins, Aria Dean, Tomashi Jackson, Richard Kennedy, Pope.L, Charlotte Lagarde, Glenn Ligon, Mores McWreath, Troy Michie, Shani Peters, Robert Pruitt, John Lucas & Claudia Rankine, Paul Mpagi Sepuya, Xaviera Simmons, Sable Elyse Smith, Carrie Mae Weems, and The Racial Imaginary Institute."]}, {"page": "Colchester Town Hall", "response": ["Works of art in the town hall include a painting depicting a spotted dog, with the Golden Horn in the background, by Otto Hoynck, a painting depicting merrymaking in a Flemish Village by David Vinckboons and a painting depicting Dutch Protestants fleeing from religious persecution by the Duke of Alba and seeking permission to live in Colchester in 1570 by the local artist, Harry Becker. There is also a portrait of the former Speaker of the House of Commons, Lord Colchester, by James Lonsdale as well as a portrait of the former local member of parliament, Charles Gray Round, by John Lucas."]}]}}