{"wiki_id": "http://www.wikidata.org/entity/Q179374", "itemLabel": "Robert Owen", "itemDescription": "Welsh social reformer (1771-1858)", "wikipedia_url": "https://en.wikipedia.org/wiki/Robert_Owen", "wikipedia_page": {"main": "Robert Owen (; 14 May 1771 – 17 November 1858) was a Welsh textile manufacturer, philanthropist and social reformer, and a founder of utopian socialism and the cooperative movement. He strove to improve factory working conditions, promoted experimental socialistic communities, and sought a more collective approach to child rearing, including government control of education. He gained wealth in the early 1800s from a textile mill at New Lanark, Scotland. Having trained as a draper in Stamford, Lincolnshire he worked in London before relocating aged 18 to Manchester and textile manufacturing. In 1824, he moved to America and put most of his fortune in an experimental socialistic community at New Harmony, Indiana, as a preliminary model for his Utopian society. It lasted about two years; other Owenite Utopian communities also failed. In 1828, Owen returned to London, where he continued to champion the working class, lead in developing cooperatives and the trade union movement, and support child labour legislation and free co-educational schools.", "link_mentions": [{"page": "Amos Bronson Alcott", "response": ["Modern critics often fault Alcott for not being able to financially support his family. Alcott himself worried about his own prospects as a young man, once writing to his mother that he was \"still at my old trade—hoping.\" Alcott held his principles above his and his family's well-being. Shortly before his marriage, for example, his future father-in-law Colonel Joseph May helped him find a job teaching at a school in Boston run by the Society of Free Enquirers, followers of Robert Owen, for a lucrative $1,000 to $1,200 annual salary. He refused it because he did not agree with their beliefs, writing, \"I shall have nothing to do with them.\""]}, {"page": "Alfred Russel Wallace", "response": ["Wallace then moved to London to board with his older brother John, a 19-year-old apprentice builder. This was a stopgap measure until William, his oldest brother, was ready to take him on as an apprentice surveyor. While in London, Alfred attended lectures and read books at the London Mechanics Institute (current Birkbeck, University of London). Here he was exposed to the radical political ideas of the Welsh social reformer Robert Owen and of Thomas Paine. He left London in 1837 to live with William and work as his apprentice for six years. At the end of 1839, they moved to Kington, Herefordshire, near the Welsh border, before eventually settling at Neath in Wales. Between 1840 and 1843, Wallace did land surveying work in the countryside of the west of England and Wales.Raby Bright Paradise pp. 77–78.Ross A. Slotten. The Heretic in Darwin's Court:The Life of Alfred Russel Wallace.Columbia University Press, June 2004.pp. 11–14. By the end of 1843, William's business had declined due to difficult economic conditions, and Wallace, at the age of 20, left in January.", "Spiritualism appealed to many educated Victorians who no longer found traditional religious doctrine, such as that of the Church of England, acceptable yet were unsatisfied with the completely materialistic and mechanical view of the world that was increasingly emerging from 19th-century science.Slotten p. 4. However, several scholars who have researched Wallace's views in depth have emphasised that, for him, spiritualism was a matter of science and philosophy rather than religious belief. Among other prominent 19th-century intellectuals involved with spiritualism were the social reformer Robert Owen, who was one of Wallace's early idols,Slotten p. 232. the physicists William Crookes and Lord Rayleigh, the mathematician Augustus De Morgan, and the Scottish publisher Robert Chambers.Shermer p. 183."]}, {"page": "Charles Babbage", "response": ["John Ruskin went further, to oppose completely what manufacturing in Babbage's sense stood for. Babbage also affected the economic thinking of John Stuart Mill. George Holyoake saw Babbage's detailed discussion of profit sharing as substantive, in the tradition of Robert Owen and Charles Fourier, if requiring the attentions of a benevolent captain of industry, and ignored at the time.George Jacob Holyoake, The History of Co-operation in England: its literature and its advocates, vol. 2 (1879) pp. 228–32; archive.org."]}, {"page": "George Eliot", "response": ["In 1836 her mother died and Evans (then 16) returned home to act as housekeeper, but she continued correspondence with her tutor Maria Lewis. When she was 21, her brother Isaac married and took over the family home, so Evans and her father moved to Foleshill near Coventry. The closeness to Coventry society brought new influences, most notably those of Charles and Cara Bray. Charles Bray had become rich as a ribbon manufacturer and had used his wealth in the building of schools and in other philanthropic causes. Evans, who had been struggling with religious doubts for some time, became intimate friends with the radical, free-thinking Brays, whose \"Rosehill\" home was a haven for people who held and debated radical views. The people whom the young woman met at the Brays' house included Robert Owen, Herbert Spencer, Harriet Martineau, and Ralph Waldo Emerson. Through this society Evans was introduced to more liberal and agnostic theologies and to writers such as David Strauss and Ludwig Feuerbach, who cast doubt on the literal truth of Biblical texts. In fact, her first major literary work was an English translation of Strauss's Das Leben Jesu kritisch bearbeitet  as The Life of Jesus, Critically Examined (1846), which she completed after it had been left incomplete by Elizabeth \"Rufa\" Brabant, another member of the \"Rosehill Circle\"."]}, {"page": "Harmony Society", "response": ["In 1804, while Rapp and his associates remained in the United States looking for a place to settle, his followers sailed to America aboard several vessels and made their way to western Pennsylvania, where they waited until land had been selected for their new settlement.Arndt, George Rapp's Harmony Society, p. 65–69. Rapp was able to secure a large tract of land in Pennsylvania and started his first commune, known as Harmonie or Harmony, in Butler County, Pennsylvania,Arndt, George Rapp's Harmony Society, p. 72. where the Society existed from 1804 to 1815.Karl J. R. Arndt, The Harmony Society from its beginnings in Germany in 1785 to its Liquidation in the United States in 1905 (Philadelphia: American Philosophical Society, 1953), p. 189. It soon grew to a population of about 800, and was highly profitable. Ten years later, the town was sold and the Harmonists moved westward to the Indiana Territory, where they established the town of Harmony, now called New Harmony, Indiana, and remained there from 1815 to 1825. The Indiana settlement was sold to Robert Owen and was renamed New Harmony. Ten years after the move to Indiana the commune moved again, this time returning to western Pennsylvania, and named their third and final town Economy ('Ökonomie' in German). The Harmonists lived in Economy until the Society was dissolved in 1905.", "On January 3, 1825, the Harmonists and Robert Owen, a Welsh-born industrialist and social reformer, came to a final agreement for the sale of the Society's land and buildings in Indiana for $150,000. Owen named the town New Harmony, and by May, the last of the Harmony Society's remaining members returned to Pennsylvania.Arndt, George Rapp's Harmony Society, p. 298."]}, {"page": "Industrial Revolution", "response": ["In other industries, the transition to factory production was not so divisive. Some industrialists themselves tried to improve factory and living conditions for their workers. One of the earliest such reformers was Robert Owen, known for his pioneering efforts in improving conditions for workers at the New Lanark mills, and often regarded as one of the key thinkers of the early socialist movement.", "Working people also formed friendly societies and co-operative societies as mutual support groups against times of economic hardship. Enlightened industrialists, such as Robert Owen also supported these organisations to improve the conditions of the working class."]}, {"page": "Individualist anarchism", "response": ["William Godwin's influenced \"the socialism of Robert Owen and Charles Fourier. After success of his British venture, Owen himself established a cooperative community within the United States at New Harmony, Indiana during 1825. One member of this commune was Josiah Warren, considered to be the first individualist anarchist. After New Harmony failed, Warren shifted his ideological loyalties from socialism to anarchism. According to anarchist Peter Sabatini, this \"was no great leap, given that Owen's socialism had been predicated on Godwin's anarchism\".Peter Sabatini. \"Libertarianism: Bogus Anarchy\"", "Josiah Warren is widely regarded as the first American anarchistPalmer, Brian (2010-12-29) What do anarchists want from us?, Slate.com and the four-page weekly paper he edited during 1833, The Peaceful Revolutionist, was the first anarchist periodical published,William Bailie,  Josiah Warren: The First American Anarchist  –  A Sociological Study, Boston: Small, Maynard & Co., 1906, p. 20 an enterprise for which he built his own printing press, cast his own type and made his own printing plates. Warren was a follower of Robert Owen and joined Owen's community at New Harmony, Indiana. Warren termed the phrase \"Cost the limit of price\", with \"cost\" here referring not to monetary price paid but the labor one exerted to produce an item.\"A watch has a cost and a value. The COST consists of the amount of labor bestowed on the mineral or natural wealth, in converting it into metals…\". Warren, Josiah. Equitable Commerce Therefore, \"[h]e proposed a system to pay people with certificates indicating how many hours of work they did. They could exchange the notes at local time stores for goods that took the same amount of time to produce\". He put his theories to the test by establishing an experimental \"labor for labor store\" called the Cincinnati Time Store where trade was facilitated by notes backed by a promise to perform labor. The store proved successful and operated for three years after which it was closed so that Warren could pursue establishing colonies based on mutualism. These included Utopia and Modern Times. Warren said that Stephen Pearl Andrews' The Science of Society (published in 1852) was the most lucid and complete exposition of Warren's own theories.Charles A. Madison. \"Anarchism in the United States\". Journal of the History of Ideas, Vol. 6, No. 1. (Jan., 1945), p. 53 Catalan historian Xavier Diez report that the intentional communal experiments pioneered by Warren were influential in European individualist anarchists of the late 19th and early 20th centuries such as Émile Armand and the intentional communities started by them."]}, {"page": "Ithaca Hours", "response": ["While doing research into local economics during 1989, Glover had seen an \"Hour\" note 19th century British industrialist Robert Owen issued to his workers for spending at his company store.  After Ithaca HOURS began, he discovered that Owen's Hours were based on Josiah Warren's \"Time Store\" notes of 1827."]}, {"page": "Individualism", "response": ["In the English language, the word individualism was first introduced as a pejorative by utopian socialists such as the Owenites in the late 1830s, although it is unclear if they were influenced by Saint-Simonianism or came up with it independently. A more positive use of the term in Britain came to be used with the writings of James Elishama Smith, who was a millenarian and a Christian Israelite. Although an early follower of Robert Owen, he eventually rejected its collective idea of property and found in individualism a \"universalism\" that allowed for the development of the \"original genius\". Without individualism, Smith argued that individuals cannot amass property to increase one's happiness. William Maccall, another Unitarian preacher and probably an acquaintance of Smith, came somewhat later, although influenced by John Stuart Mill, Thomas Carlyle and German Romanticism, to the same positive conclusions in his 1847 work Elements of Individualism.", "Past and present currents and movements commonly described as libertarian socialist include anarchism (especially anarchist schools of thought such as anarcho-communism, anarcho-syndicalism, collectivist anarchism, green anarchism, individualist anarchism,An Anarchist FAQ. \"(Benjamin) Tucker referred to himself many times as a socialist and considered his philosophy to be \"Anarchistic socialism.\"Armand, Émile (1907). \"Anarchist Individualism as a Life and Activity\". French individualist anarchist Émile Armand shows clearly opposition to capitalism and centralized economies when he said that the individualist anarchist \"inwardly he remains refractory – fatally refractory – morally, intellectually, economically (The capitalist economy and the directed economy, the speculators and the fabricators of single are equally repugnant to him.)\"Sabatini, Peter (1994–1995). \"Libertarianism: Bogus Anarchy\". Anarchist Peter Sabatini reports that in the United States \"of early to mid-19th century, there appeared an array of communal and \"utopian\" counterculture groups (including the so-called free love movement). William Godwin's anarchism exerted an ideological influence on some of this, but more so the socialism of Robert Owen and Charles Fourier. After success of his British venture, Owen himself established a cooperative community within the United States at New Harmony, Indiana during 1825. One member of this commune was Josiah Warren (1798–1874), considered to be the first individualist anarchist.\"Chartier, Gary; Johnson, Charles W. (2011). Markets Not Capitalism: Individualist Anarchism Against Bosses, Inequality, Corporate Power, and Structural Poverty. Brooklyn: Minor Compositions/Autonomedia. Back cover. \"It introduces an eye-opening approach to radical social thought, rooted equally in libertarian socialism and market anarchism.\" mutualism,\"A Mutualist FAQ: A.4. Are Mutualists Socialists?\" . and social anarchism) as well as communalism, some forms of democratic socialism, guild socialism,Masquelier, Charles (2014). Critical Theory and Libertarian Socialism: Realizing the Political Potential of Critical Social Theory. New York and London:  Bloombury. p. 190. \"It is by meeting such a twofold requirement that the libertarian socialism of G.D.H. Cole could be said to offer timely and sustainable avenues for the institutionalization of the liberal value of autonomy [...].\" libertarian MarxismPrichard, Alex; Kinna, Ruth; Pinta, Saku; Berry, Dave, eds. (December 2012). Libertarian Socialism: Politics in Black and Red. Palgrave Macmillan. p. 13. \"Locating libertarian socialism in a grey area between anarchist and Marxist extremes, they argue that the multiple experiences of historical convergence remain inspirational and that, through these examples, the hope of socialist transformation survives.\" (autonomism, council communism,Boraman, Toby (December 2012). \"Carnival and Class: Anarchism and Councilism in Australasia during the 1970s\". In Prichard, Alex; Kinna, Ruth; Pinta, Saku; Berry, Dave, eds. Libertarian Socialism: Politics in Black and Red. Palgrave Macmillan. p. 268. \"Councilism and anarchism loosely merged into 'libertarian socialism', offering a non-dogmatic path by which both council communism and anarchism could be updated for the changed conditions of the time, and for the new forms of proletarian resistance to these new conditions.\" left communism, and Luxemburgism, among others),Bookchin, Murray (1992). \"The Ghost of Anarcho-Syndicalism\".Graham, Robert. \"The General Idea of Proudhon's Revolution\". participism, revolutionary syndicalism and some versions of utopian socialism.Bromley, Kent (1906). \"Preface\". In Kropotkin, Peter. The Conquest of Bread. London and New York City: G. P. Putnam's Sons."]}, {"page": "Trade union", "response": ["In 1834, the Welsh socialist Robert Owen established the Grand National Consolidated Trades Union. The organization attracted a range of socialists from Owenites to revolutionaries and played a part in the protests after the Tolpuddle Martyrs' case, but soon collapsed."]}, {"page": "Libertarian socialism", "response": ["A form and socialist wing of left-libertarianism,Long, Roderick T. (2012). \"Anarchism\". In Gaus, Gerald F.; D'Agostino, Fred, eds. The Routledge Companion to Social and Political Philosophy. p. 227. \"In its oldest sense, it is a synonym either for anarchism in general or social anarchism in particular. Later it became a term for the left or Konkinite wing of the free-market libertarian movement, and has since come to cover a range of pro-market but anti-capitalist positions, mostly individualist anarchist, including agorism and mutualism, often with an implication of sympathies (such as for radical feminism or the labor movement) not usually shared by anarcho-capitalists. In a third sense it has recently come to be applied to a position combining individual self-ownership with an egalitarian approach to natural resources; most proponents of this position are not anarchists\". past and present currents and movements commonly described as libertarian socialist include anarchism (especially anarchist schools of thought such as anarcho-communism, anarcho-syndicalism, collectivist anarchism, green anarchism, individualist anarchism,An Anarchist FAQ. \"(Benjamin) Tucker referred to himself many times as a socialist and considered his philosophy to be \"Anarchistic socialism.\"Armand, Émile (1907). \"Anarchist Individualism as a Life and Activity\". French individualist anarchist Émile Armand shows clearly opposition to capitalism and centralized economies when he said that the individualist anarchist \"inwardly he remains refractory – fatally refractory – morally, intellectually, economically (The capitalist economy and the directed economy, the speculators and the fabricators of single are equally repugnant to him.)\"Sabatini, Peter (1994–1995). \"Libertarianism: Bogus Anarchy\". Anarchist Peter Sabatini reports that in the United States \"of early to mid-19th century, there appeared an array of communal and \"utopian\" counterculture groups (including the so-called free love movement). William Godwin's anarchism exerted an ideological influence on some of this, but more so the socialism of Robert Owen and Charles Fourier. After success of his British venture, Owen himself established a cooperative community within the United States at New Harmony, Indiana during 1825. One member of this commune was Josiah Warren (1798–1874), considered to be the first individualist anarchist.\"Chartier, Gary; Johnson, Charles W. (2011). Markets Not Capitalism: Individualist Anarchism Against Bosses, Inequality, Corporate Power, and Structural Poverty. Brooklyn: Minor Compositions/Autonomedia. Back cover. \"It introduces an eye-opening approach to radical social thought, rooted equally in libertarian socialism and market anarchism.\" mutualism\"A Mutualist FAQ: A.4. Are Mutualists Socialists?\" . and social anarchism) as well as communalism, some forms of democratic socialism, guild socialism,Masquelier, Charles (2014). Critical Theory and Libertarian Socialism: Realizing the Political Potential of Critical Social Theory. New York and London: Bloombury. p. 190. \"It is by meeting such a twofold requirement that the libertarian socialism of G.D.H. Cole could be said to offer timely and sustainable avenues for the institutionalization of the liberal value of autonomy [...].\" libertarian MarxismPrichard, Alex; Kinna, Ruth; Pinta, Saku; Berry, Dave, eds. (December 2012). Libertarian Socialism: Politics in Black and Red. Palgrave Macmillan. p. 13. \"Locating libertarian socialism in a grey area between anarchist and Marxist extremes, they argue that the multiple experiences of historical convergence remain inspirational and that, through these examples, the hope of socialist transformation survives.\" (autonomism, council communism,Boraman, Toby (December 2012). \"Carnival and Class: Anarchism and Councilism in Australasia during the 1970s\". In Prichard, Alex; Kinna, Ruth; Pinta, Saku; Berry, Dave, eds. Libertarian Socialism: Politics in Black and Red. Palgrave Macmillan. p. 268. \"Councilism and anarchism loosely merged into 'libertarian socialism', offering a non-dogmatic path by which both council communism and anarchism could be updated for the changed conditions of the time, and for the new forms of proletarian resistance to these new conditions.\" left communism and Luxemburgism, among others),Bookchin, Murray (1992). \"The Ghost of Anarcho-Syndicalism\".Graham, Robert. \"The General Idea of Proudhon's Revolution\". participism, revolutionary syndicalism and some versions of utopian socialism.Bromley, Kent (1906). \"Preface\". In Kropotkin, Peter. The Conquest of Bread. London and New York City: G. P. Putnam's Sons.", "Anarchist Peter Sabatini reports that in the United States of early to mid-19th century, \"there appeared an array of communal and \"utopian\" counterculture groups (including the so-called free love movement). William Godwin's anarchism exerted an ideological influence on some of this, but more so the socialism of Robert Owen and Charles Fourier. After success of his British venture, Owen himself established a cooperative community within the United States at New Harmony, Indiana during 1825. One member of this commune was Josiah Warren (1798–1874), considered to be the first individualist anarchist\".Peter Sabatini. \"Libertarianism: Bogus Anarchy\". Theanarchistlibrary.org (December 3, 2009). Retrieved on December 28, 2011.", "Pi i Margall was a dedicated theorist in his own right, especially through book-length works such as La reacción y la revolución (Reaction and revolution, from 1855), Las nacionalidades (Nationalities, 1877) and La Federación (Federation) from 1880. On the other hand, Fermín Salvochea was a mayor of the city of Cádiz and a president of the province of Cádiz. He was one of the main propagators of anarchist thought in that area in the late 19th century and is considered to be perhaps the most beloved figure in the Spanish anarchist movement of the 19th century.Bookchin, Murray (1998). The Spanish Anarchists. pp. 111–14FERMÍN SALVOCHEA ÁLVAREZ, CGT. BIOGRAFÍAS (English translation), accessed April 2009 Ideologically, he was influenced by Charles Bradlaugh, Robert Owen and Thomas Paine, whose works he had studied during his stay in England as well as by Peter Kropotkin, whom he read later. In Spain, he had contact with the anarchist thinkers and members of the Bakuninist Alliance, including Anselmo Lorenzo and Francisco Mora."]}, {"page": "List of agnostics", "response": ["* Robert Owen (1771–1858): Welsh social reformer; a founder of utopian socialism and the cooperative movement"]}, {"page": "Left-wing politics", "response": ["Today in the Western world, those on the Left generally support secularization and the separation of church and state. However, religious beliefs have also been associated with many left-wing movements such as the progressive movement, the Social Gospel movement, the civil rights movement, the anti-war movement, the anti-capital punishment movement and Liberation Theology. Early utopian socialist thinkers such as Robert Owen, Charles Fourier and the Comte de Saint-Simon based their theories of socialism upon Christian principles. From St. Augustine of Hippo's City of God through St. Thomas More's Utopia, major Christian writers defended ideas that socialists found agreeable and advocated for. Other common leftist concerns such as pacifism, social justice, racial equality, human rights and the rejection of capitalism and excessive wealth can be found in the Holy Bible. "]}, {"page": "Labour law", "response": ["The rapid industrialisation of manufacturing at the turn of the 19th century led to a rapid increase in child employment, and public opinion was steadily made aware of the terrible conditions these children were forced to endure. The Cotton Mills and Factories Act 1819 was the outcome of the efforts of the industrialist Robert Owen and prohibited child labour under nine years of age and limited the working hours to twelve. A great milestone in labour law was reached with the Factories Act 1833, which limited the employment of children under eighteen years of age, prohibited all night work and, crucially, provided for inspectors to enforce the law. Pivotal in the campaigning for and the securing of this legislation were Michael Sadler and the Earl of Shaftesbury. This act was an important step forward, in that it mandated skilled inspection of workplaces and rigorous enforcement of the law by an independent governmental body."]}, {"page": "May 14", "response": ["*1771 – Robert Owen, Welsh businessman and social reformer (d. 1858)"]}, {"page": "Robert Fulton", "response": ["Fulton became caught up in the enthusiasm of the \"Canal Mania\". In 1793 he began developing his ideas for tugboat canals with inclined planes instead of locks. He obtained a patent for this idea in 1794, and also began working on ideas for the steam power of boats. He published a pamphlet about canals and patented a dredging machine and several other inventions. In 1794, he moved to Manchester to gain practical knowledge of English canal engineering. While there he became friendly with Robert Owen, a cotton manufacturer and early socialist. Owen agreed to finance the development and promotion of Fulton's designs for inclined planes and earth-digging machines; he was instrumental in introducing the American to a canal company, which awarded him a sub-contract. But Fulton was not successful at this practical effort and he gave up the contract after a short time.Boyes, Graham. The Peak Forest Canal. ."]}, {"page": "River Clyde", "response": ["That is where the late 17th- and early 18th-century industrialists David Dale and Robert Owen built mills and the model settlement of New Lanark on the banks of the Clyde. The mills harnessed the power of the Falls of Clyde, the most spectacular of which is Cora Linn. A hydroelectric power station still generates electricity there today, although the mills have now become a museum and World Heritage Site."]}, {"page": "Socialism", "response": ["Initial use of socialism was claimed by Pierre Leroux, who alleged he first used the term in the Parisian journal Le Globe in 1832. Leroux was a follower of Henri de Saint-Simon, one of the founders of what would later be labelled utopian socialism. Socialism contrasted with the liberal doctrine of individualism that emphasized the moral worth of the individual whilst stressing that people act or should act as if they are in isolation from one another. The original utopian socialists condemned this doctrine of individualism for failing to address social concerns during the Industrial Revolution, including poverty, oppression, and vast wealth inequality. They viewed their society as harming community life by basing society on competition. They presented socialism as an alternative to liberal individualism based on the shared ownership of resources.Marvin Perry, Myrna Chase, Margaret Jacob, James R. Jacob. Western Civilization: Ideas, Politics, and Society – From 1600, Volume 2. Ninth Edition. Boston: Houghton Mifflin Harcourt Publishing Company, 2009. p. 540. Saint-Simon proposed economic planning, scientific administration and the application of scientific understanding to the organisation of society. By contrast, Robert Owen proposed to organise production and ownership via cooperatives. Socialism is also attributed in France to Marie Roch Louis Reybaud while in Britain it is associated to Owen, who became one of the fathers of the cooperative movement.Oxford English Dictionary, etymology of socialismRussell, Bertrand (1972). A History of Western Philosophy. Touchstone. p. 781", "West European social critics, including Louis Blanc, Charles Fourier, Charles Hall, Robert Owen, Pierre-Joseph Proudhon and Saint-Simon were the first modern socialists who criticised the poverty and inequality of the Industrial Revolution. They advocated reform, Owen advocating the transformation of society to small communities without private property. Owen's contribution to modern socialism was his claim that individual actions and characteristics were largely determined by their social environment. On the other hand, Fourier advocated Phalanstères (communities that respected individual desires, including sexual preferences), affinities and creativity and saw that work has to be made enjoyable for people.\"In Fourier's system of Harmony all creative activity including industry, craft, agriculture, etc. will arise from liberated passion—this is the famous theory of \"attractive labour.\" Fourier sexualises work itself—the life of the Phalanstery is a continual orgy of intense feeling, intellection, & activity, a society of lovers & wild enthusiasts....The Harmonian does not live with some 1600 people under one roof because of compulsion or altruism, but because of the sheer pleasure of all the social, sexual, economic, \"gastrosophic,\" cultural, & creative relations this association allows & encourages\".\"The Lemonade Ocean & Modern Times A Position Paper by Hakim Bey Owen and Fourier's ideas were practiced in intentional communities around Europe and North America in the mid-19th century.", "Utopian socialism is a term used to define the first currents of modern socialist thought as exemplified by the work of Henri de Saint-Simon, Charles Fourier and Robert Owen which inspired Karl Marx and other early socialists. However, visions of imaginary ideal societies, which competed with revolutionary social democratic movements, were viewed as not being grounded in the material conditions of society and as reactionary. Although it is technically possible for any set of ideas or any person living at any time in history to be a utopian socialist, the term is most often applied to those socialists who lived in the first quarter of the 19th century who were ascribed the label \"utopian\" by later socialists as a negative term in order to imply naivete and dismiss their ideas as fanciful or unrealistic.", "The role and use of money in a hypothetical socialist economy is a contested issue. Nineteenth century socialists including Karl Marx, Robert Owen, Pierre-Joseph Proudhon and John Stuart Mill advocated various forms of labour vouchers or labour credits, which like money would be used to acquire articles of consumption, but unlike money they are unable to become capital and would not be used to allocate resources within the production process. Bolshevik revolutionary Leon Trotsky argued that money could not be arbitrarily abolished following a socialist revolution. Money had to exhaust its \"historic mission\", meaning it would have to be used until its function became redundant, eventually being transformed into bookkeeping receipts for statisticians and only in the more distant future would money not be required for even that role.Leon Trotsky: The Revolution Betrayed (1936). Chapter 4: \"Having lost its ability to bring happiness or trample men in the dust, money will turn into mere bookkeeping receipts for the convenience of statisticians and for planning purposes. In the still more distant future, probably these receipts will not be needed.\"", "As part of the larger socialist movement, it seeks to distinguish itself from Bolshevism, Leninism and Marxism–Leninism as well as social democracy.\"It is forgotten that the early defenders of commercial society like [Adam] Smith were as much concerned with criticising the associational blocks to mobile labour represented by guilds as they were to the activities of the state. The history of socialist thought includes a long associational and anti-statist tradition prior to the political victory of the Bolshevism in the east and varieties of Fabianism in the west. John O´Neil.\" The Market: Ethics, knowledge and politics. Routledge. 1998. p. 3 Past and present political philosophies and movements commonly described as libertarian socialist include anarchism (anarcho-communism, anarcho-syndicalism collectivist anarchism, individualist anarchism\"(Benjamin) Tucker referred to himself many times as a socialist and considered his philosophy to be \"Anarchistic socialism.\" An Anarchist FAQ by Various AuthorsFrench individualist anarchist Émile Armand shows clearly opposition to capitalism and centralised economies when he said that the individualist anarchist \"inwardly he remains refractory—fatally refractory—morally, intellectually, economically (The capitalist economy and the directed economy, the speculators and the fabricators of single are equally repugnant to him.)\"\"Anarchist Individualism as a Life and Activity\" by Emile ArmandAnarchist Peter Sabatini reports that in the United States \"of early to mid-19th century, there appeared an array of communal and \"utopian\" counterculture groups (including the so-called free love movement). William Godwin's anarchism exerted an ideological influence on some of this, but more so the socialism of Robert Owen and Charles Fourier. After success of his British venture, Owen himself established a cooperative community within the United States at New Harmony, Indiana during 1825. One member of this commune was Josiah Warren (1798–1874), considered to be the first individualist anarchist\"Peter Sabatini. \"Libertarianism: Bogus Anarchy\" and mutualism), autonomism, Communalism, participism, libertarian Marxism (council communism and Luxemburgism),Murray Bookchin, Ghost of Anarcho-Syndicalism; Robert Graham, The General Idea of Proudhon's Revolution revolutionary syndicalism and utopian socialism (Fourierism).Kent Bromley, in his preface to Peter Kropotkin's book The Conquest of Bread, considered early French utopian socialist Charles Fourier to be the founder of the libertarian branch of socialist thought, as opposed to the authoritarian socialist ideas of [François-Noël] Babeuf and [Philippe] Buonarroti]].\" Kropotkin, Peter. The Conquest of Bread, preface by Kent Bromley, New York and London, G.P. Putnam's Sons, 1906."]}, {"page": "1830s", "response": ["There were protests and significant unrest during the decade.  In May and June 1831 in Wales, coal miners and others rioted for improved working conditions in what was known as the Merthyr Rising. William Howley Archbishop of Canterbury has his coach attacked by an angry mob on his first official visit to Canterbury in 1832.  In 1834, Robert Owen organized the Grand National Consolidated Trades Union, an early attempt to form a national union confederation.  In May 1838, the People's Charter was drawn up in the United Kingdom, demanding universal suffrage.  Chartism continued to gain popularity, leading to the Newport Rising in 1839, the last large-scale armed rebellion against authority in mainland Britain."]}, {"page": "1820s", "response": ["* 1820: Robert Owen devises the labour voucher."]}, {"page": "1858", "response": ["* November 17 – Robert Owen, British social reformer (b. 1771)"]}, {"page": "1827", "response": ["* November – The term \"socialist\" is coined by Robert Owen in his London periodical, The Co-operative Magazine and Monthly Herald.John Harrison, Robert Owen and the Owenites in Britain and America: The Quest for the New Moral World (Routledge, 2009) p35James H. Billington, Fire in the Minds of Men: Origins of the Revolutionary Faith (Transaction Publishers, 1999) p245\"Socialism\", in Keywords: A Vocabulary of Culture and Society, by Raymond Williams (Oxford University Press, 2014) p224"]}, {"page": "1834", "response": ["* February 13 – Robert Owen organizes the Grand National Consolidated Trades Union in the United Kingdom.G. D. H. Cole, Attempts at General Union (Taylor & Francis, 2010) p122"]}]}}