{"wiki_id": "http://www.wikidata.org/entity/Q1792237", "itemLabel": "Norah Lofts", "itemDescription": "British writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Norah_Lofts", "wikipedia_page": {"main": "Norah Lofts, née Norah Ethel Robinson, (27 August 1904 – 10 September 1983) was a 20th-century best-selling British author. She also wrote under the pen names Peter Curtis and Juliet Astley. She wrote more than fifty books specialising in historical fiction, but she also wrote some mysteries and non-fiction and short stories. Many of her novels, including her Suffolk Trilogy, follow the history of  specific houses and their residents over several generations.", "link_mentions": [{"page": "August 27", "response": ["*  1904   – Norah Lofts, English author (d. 1983)"]}, {"page": "Eleanor of Aquitaine", "response": ["Also Norah Lofts wrote a fictionalized biography of her, entitled in various editions Queen in Waiting or Eleanor the Queen, and including some romanticized episodes—starting off with the young Eleanor planning to elope with a young knight, who is killed out of hand by her guardian, in order to facilitate her marriage to the King's son."]}, {"page": "Suffolk", "response": ["Hip hop DJ Tim Westwood is originally from Suffolk and the influential DJ and radio presenter John Peel made the county his home. Contemporary painter, Maggi Hambling, was born, and resides, in Suffolk. Norah Lofts, author of best-selling historical novels, lived for decades in Bury St. Edmunds where she died and was buried in 1983. Sir Peter Hall the founder of the Royal Shakespeare Company was born in Bury St. Edmunds, and Sir Trevor Nunn the theatre director was born in Ipswich."]}, {"page": "September 10", "response": ["*  1983   – Norah Lofts, English author (b. 1904)"]}, {"page": "Johann Friedrich Struensee", "response": ["* The Lost Queen (1969, historical novel) by Norah Lofts"]}, {"page": "Jassy", "response": ["* Jassy, a novel by Norah Lofts"]}, {"page": "Louis VII of France", "response": ["Louis is a character in Jean Anouilh's 1959 play Becket. In the 1964 film adaptation he was portrayed by John Gielgud, who was nominated for the Academy Award for Best Supporting Actor. He was also portrayed by Charles Kay in the 1978 BBC TV drama series The Devil's Crown. He has a role in Sharon Kay Penman's novels When Christ and His Saints Slept and Devil's Brood. The early part of Norah Lofts' biography of Eleanor of Aquitaine deals considerably with Louis VII, seen through Eleanor's eyes and giving her side in their problematic relationship. Louis is one of the main characters in Elizabeth Chadwick's novel The Summer Queen."]}, {"page": "Berengaria of Navarre", "response": ["*The Lute Player by Norah Lofts"]}, {"page": "Thomas Seymour, 1st Baron Seymour of Sudeley", "response": ["Norah Lofts, in her biography of Walter Raleigh Here Was a Man, suggests that Elizabeth was attracted to Raleigh because he reminded her of Seymour."]}, {"page": "Rosamund Clifford", "response": ["* Rosamund is a character in the novel Eleanor the Queen (1955, 1983) by Norah Lofts."]}, {"page": "The Fens", "response": ["* Norah Lofts features a character called Ethelreda Benedict, who comes from a small island in the Fens in the 17th century, in the second book of her \"House\" trilogy, The House at Old Vine."]}, {"page": "Arthur, Prince of Wales", "response": ["Arthur has been featured in several historical fiction novels, such as The King's Pleasure, by Norah Lofts, Three Sisters, Three Queens by Philippa Gregory and Katherine, The Virgin Widow, by Jean Plaidy. In The Constant Princess, by Philippa Gregory, Catherine promises Arthur to marry his brother, thus fulfilling not only her own destiny of becoming Queen of England but also the couple's plans for the future of the kingdom. The Alteration, by Kingsley Amis, is an alternate history novel centred on the \"War of the English Succession\" during which Henry VIII attempts to usurp the throne of his nephew, Stephen II, Arthur and Catherine's son."]}, {"page": "Bury St Edmunds", "response": ["Author Norah Lofts, though born in Shipham, Norfolk, bases many of her stories in Baildon, a fictionalised Bury St Edmunds, where she was educated and lived."]}, {"page": "Blondel de Nesle", "response": ["Throughout the nineteenth century, the legend became a key component in the mythology surrounding Richard. Some later twentieth century novelists,  placed a homosexual interpretation on his supposed relationship with the king. Norah Lofts in The Lute Player (1951) has Richard make a (rather gentlemanly) approach to Blondel, which is refused, Blondel's  heart and devotion being entirely given to Richard's neglected wife Berengaria. "]}, {"page": "Prince Edward, Duke of York and Albany", "response": ["*Prince Edward is an important character in Norah Lofts' historical novel The Lost Queen (1969), chronicling the life of his youngest sister, Caroline Matilda, Queen Consort of Denmark and Norway as wife of King Christian VII. Edward is mentioned as having had a special link with her, stronger than with his other siblings. The book also depicts Edward as having planned shortly before his death to elope with a commoner woman with whom he was in love, marry her in Russia and never go back to Britain – which is not firmly attested in historical sources."]}, {"page": "Nigel Kneale", "response": ["In 1966 Kneale worked again for Hammer Film Productions when he adapted Norah Lofts's 1960 novel The Devil's Own into the horror film The Witches. Kneale had worked on the screenplay for the adaptation in 1961, the same year in which he had begun to adapt Quatermass and the Pit for Hammer. Like The Witches, the film version of Quatermass and the Pit took several years to reach the screen, eventually being released in 1967. Roy Ward Baker directed, with Andrew Keir starring as Quatermass. Kneale was much happier with this version than the previous Hammer Quatermass adaptations, and the film was described by The Independent in 2006 as \"one of the best ever Hammer productions.\" Quatermass and the Pit was Kneale's final credited film work; 1979's The Quatermass Conclusion was only released to cinemas in overseas markets after it was made for television in the UK, and he had his name removed from the credits of Halloween III: Season of the Witch (1982)."]}, {"page": "Eye of the Devil", "response": ["Anthony Boucher praised the novel The Day of the Arrow (1964) in his Criminals at Large column in The New York Times' March 1, 1964 edition. Observing that, although “men can enjoy them very much indeed”, “the Daphne Du Maurier— Mary Stewart—Victoria Holt sort of novel of mystery, menace and romance, is addressed primarily to a feminine audience...(Therefore) It is somewhat comforting...to encounter (this novel) which tells very much the same kind of brooding, atmospheric story, in very much the same kind of setting (an ancestral castle in the Auvergne), but from a male viewpoint and with a mind working in a completely masculine manner. And I hope that women may enjoy this as much as I have enjoyed, say, Norah Lofts or Evelyn Berckman—with both of whom the tale shares certain affinities...The castle and its village are called Bellac, but this is very far (geographically and spiritually) from the birthplace off Jean Giraudoux. This is a setting for highly civilized and aristocratic nightmare, as a young Scottish painter tries to identify the sinister forces that are taking control of his friend the Marquis. The answer will come as no surprise to anyone who has ever leafed through The Golden Bough, but its obviousness in no way diminishes its power. The book is as full of tantalizing and terror‐hinting symbols as a pack of tarot cards, and as oddly vivid in its invented folklore as Ngaio Marsh's Death of a Fool. The character of the young painter is not in the film,"]}, {"page": "Frederick, Hereditary Prince of Denmark", "response": ["Prince Frederick is an important character in Norah Lofts' historical novel The Lost Queen (1969), chronicling the tragic marriage of King Christian VII and Queen Caroline Matilda. The book suggests that Frederick was himself in love with the Queen and jealous of her lover Johann Friedrich Struensee – which is not firmly attested in historical sources."]}, {"page": "Madeleine Smith", "response": ["Other novels based on the case include The House in Queen Anne's Square (1920) by William Darling Lyell, Lovers All Untrue (1970) by Norah Lofts, and Alas, for Her That Met Me! (1976) by Mary Ann Ashe (pseudonym of Christianna Brand). Alanna Knight's Murder in Paradise (2008) includes Madeleine Smith, William Morris and George Wardle as peripheral characters, including a story of how Madeleine met George."]}, {"page": "Elizabeth Raleigh", "response": ["Norah Lofts in her 1936 fictionalized biography of Walter Raleigh, Here Was a Man, depicted a full-fledged love triangle, with the two Elizabeths - the Queen and the much younger Lady in Waiting - fiercely competing for Walter Raleigh's love and deeply hating each other. There is no clear historical evidence that things went that far. In later parts of the book, Elizabeth Raleigh is depicted as trying to get Walter to leave the court and live quietly with her at Sherborne, and feeling neglected and abandoned when he returned to the Queen's favor, and as loyally standing by him during his disgrace under King James and voluntarily sharing his twelve years of imprisonment in the Tower.   "]}, {"page": "Caroline Matilda of Great Britain", "response": ["*Norah Lofts – The Lost Queen (1969)"]}, {"page": "Peter Curtis", "response": ["*Norah Lofts (1904–1983), British author, one of whose pen names is Peter Curtis"]}, {"page": "Nora Lofts", "response": ["#REDIRECT Norah Lofts"]}, {"page": "Constance Kent", "response": ["*Norah Lofts' novel Out of the Dark (1978), in which Constance is called Charlotte Cornwall, is based on the murder case as recounted here."]}, {"page": "7 Women", "response": ["7 Women, also known as Seven Women, is a 1966 Panavision drama film directed by John Ford and starring Anne Bancroft, Sue Lyon, Margaret Leighton, Flora Robson, Mildred Dunnock, Betty Field, and Anna Lee, with Eddie Albert, Mike Mazurki, and Woody Strode. Made by Metro-Goldwyn-Mayer, it was produced by Bernard Smith and John Ford, from a screenplay by Janet Green and John McCormick, based on the short story \"Chinese Finale\" by Norah Lofts. The music score was by Elmer Bernstein and the cinematography by Joseph LaShelle. This was the last feature film directed by Ford, ending a career that spanned 53 years."]}, {"page": "Reader's Digest Condensed Books", "response": ["* How Far to Bethlehem? - Norah Lofts", "* The King's Pleasure - Norah Lofts"]}, {"page": "The Witches (1966 film)", "response": ["The Witches, released in the United States as The Devil's Own, is a 1966 British horror film directed by Cyril Frankel and starring Joan Fontaine, Alec McCowen, Kay Walsh, Ann Bell, Ingrid Boulting (billed as Ingrid Brett) and Gwen Ffrangcon Davies. Made by Hammer Films, it was adapted by Nigel Kneale from the 1960 novel The Devil's Own by Norah Lofts, published under the pseudonym Peter Curtis."]}, {"page": "County Upper School", "response": ["*Norah Lofts (1904-1983), best-selling British author."]}, {"page": "Book League of America", "response": ["* Bless This House, by Norah Lofts, 1955"]}, {"page": "Juliana Maria of Brunswick-Wolfenbüttel", "response": ["* The Lost Queen (1969, historical novel) by Norah Lofts"]}, {"page": "Maggy Whitehouse", "response": ["Whitehouse is also literary agent for the British novelist Norah Lofts."]}, {"page": "Cultural depictions of Richard I of England", "response": ["*He features in Graham Shelby's The Kings of Vain Intent and, more centrally, in The Devil is Loose, Norah Lofts' The Lute-Player, Jean Plaidy's The Heart of the Lion, Cecelia Holland's The King's Witch, and Sharon Kay Penman's The Devil's Brood and Lionheart. "]}, {"page": "Jassy (film)", "response": ["Jassy is a 1947 British colour film historical melodrama set in the early 19th century, based on a novel by Norah Lofts. It is a Gainsborough melodrama, the only one to be made in Technicolor.Cook p.114 It was the last \"official\" Gainsborough melodrama.Gainsborough Melodrama at BFI Screenonline", "The film was based on a novel by Norah Lofts, originally published in 1944. Film rights were bought by Gainsborough Pictures who in 1946 saw Maurice Ostrer replaced as head of production by Sydney Box. In his last years, Ostrer had specialized in making melodramas that had been highly lucrative to the studio, many of which starred Margaret Lockwood. Box wanted to expand the variety of Gainsborough's output, but when he arrived Jassy was the only script ready to go into production. It would have been more expensive to let the sound stages go idle so the film went ahead.Andrew Spicer, \"The Apple of Mr. Rank’s Mercatorial Eye’: Managing Director of Gainsborough Pictures p 105 In August 1946 Box announced Gainsborough would make Jassy."]}, {"page": "Cultural depictions of Anne Boleyn", "response": ["There have been various treatments of her life by popular historians such as Marie Louise Bruce, Hester W. Chapman, Norah Lofts, Carolly Erickson, Alison Weir, Lady Antonia Fraser and Joanna Denny. In film, television and the performing arts, she has been played by a variety of well-known actresses and sopranos, including Clara Kimball Young, Merle Oberon, Joyce Redman, Geneviève Bujold (Oscar-nominated), Maria Callas, Beverly Sills, Dame Dorothy Tutin, Dame Joan Sutherland, Charlotte Rampling, Vanessa Redgrave, Helena Bonham Carter, Jodhi May, Natalie Portman, Natalie Dormer and Claire Foy.", "* She was the main character in The Concubine by Norah Lofts (1963) ."]}, {"page": "List of winners of the National Book Award", "response": [":1936, Norah Lofts, (short stories), I Met a Gypsy"]}, {"page": "Gainsborough melodramas", "response": ["The next film, Jassy (1947), marked the official end of the Gainsborough melodrama period, and was the only one of the sequence of films to be made in Technicolor. Adapted from the novel of the same name by Norah Lofts, the film tells the story of a young gypsy woman pursued by superstitious villagers as a witch, due to her being gifted with second sight, and how she is saved from persecution and employed as a housekeeper by the son of a country gentleman and his family. However, the family has lost their stately country home due to the father's drinking and gambling, and the young woman plans to use her talent to raise her social standing and return the property to the son, whom she loves. Gainsborough described the box office performance of the film as \"excellent\", and it was the seventh most popular movie at the British box office upon its release in 1947;British Films were Popular in 1947. (21 February 1948). Tribune. (394). New South Wales. p5. Retrieved 30 September 2017 via National Library of AustraliaJames Mason 1947 Film Favourite. (2 Jan 1948). The Irish Times. Dublin. p7. Retrieved 30 September 2017 by 1953, it had accumulated a net revenue of £200,000."]}, {"page": "Mary Boleyn", "response": ["* The Concubine: A Novel Based Upon the Life of Anne Boleyn by Norah Lofts (1963)", "* Anne Boleyn by Norah Lofts (1979)"]}]}}