{"wiki_id": "http://www.wikidata.org/entity/Q1804523", "itemLabel": "Lisa Williams", "itemDescription": "English psychic", "wikipedia_url": "https://en.wikipedia.org/wiki/Lisa_Williams_(psychic)", "wikipedia_page": {"main": "Lisa Michelle Williams (born 19 June 1973 in Redditch, England) is a self-proclaimed psychic and medium, who has starred in two shows on Lifetime Television: Lisa Williams: Life Among the Dead (2006–2007) and Lisa Williams: Voices From the Other Side (2008).\nWilliams also appeared on Deal or No Deal when the episode aired on NBC on 31 March 2008. She also made a guest appearance in one of Lifetime's other shows, America's Psychic Challenge.\nIn 2004, Williams gave a reading to a senior staff member of TV host Merv Griffin. As a result, Griffin worked with her to host a show of her own. Lisa Williams: Life Among the Dead aired for two seasons on the Lifetime network (2006-2007).  Her show Lisa Williams: Voices From the Other Side ran for five consecutive nights on the network in October 2008.  The shows followed Williams on a typical day, as she claims to communicate with the dead, investigates haunted houses, and conducts other spirit-seeking activities.\nIn March 2009 Williams toured Australia.", "link_mentions": [{"page": "Princess Märtha Louise of Norway", "response": ["In 2014, Princess Märtha Louise faced some criticism due to her association with British clairvoyant, Lisa Williams. Williams was in Oslo on 14 September 2014, and gave a seminar for Soulspring, formerly known as the Angel School, which Princess Märtha Louise co-founded. Williams is known for her claims that she can communicate with the deceased. The Soulspring website carried the following message: \"We in Soulspring do not communicate with dead souls in our work. And here is where our work is separate from Lisa's. To be completely honest, we don't see the point of contacting the dead. They passed over to the other side for a reason and should be allowed to stay there.\" No one representing the royal family commented."]}, {"page": "John Safran", "response": ["During the program's run, Safran and Maguire were able to get interviews from people such as religious scholar Reza Aslan, Julian Assange's mother Christine, The Exorcist star Linda Blair,  philosopher and School of Life founder Alain de Botton, writer, retired prison doctor and psychiatrist Theodore Dalrymple, West Memphis Three Damien Echols, antitheist Christopher Hitchens, conspiracy theorist David Icke, former white supremacist skinhead Frank Meeink, pro-euthanasia doctor Philip Nitschke, The Act of Killing director Joshua Oppenheimer, journalist and writer Jon Ronson, true crime writer and Ted Bundy co-worker Ann Rule,  the Lizardman Erik Sprague, African-American pro-Israel political activist and Zionist Chloé Valdary, Jewish activist against child sexual abuse Manny Waks, psychic Lisa Williams and John Safran's dad, Alex."]}, {"page": "Lily Dale, New York", "response": ["Lily Dale's year-round population is estimated to be 275. Each year approximately 22,000 visitors come for classes, workshops, public church services and mediumship demonstrations, lectures, and private appointments with mediums.Schwartz, Stephan A. \"Spirit World\", American Heritage, April/May 2005. In recent years, guest lecturers have included Lisa Williams, Dee Wallace, members of Ghost Hunters, Tibetan monks, James Van Praagh, Dr. Wayne Dyer, and Deepak Chopra.", "A large population of people associated with Spiritualism reside in Lily Dale year round.  Television mediums Lisa Williams and Michelle Whitedove have homes here."]}, {"page": "Lisa Williams", "response": ["Lisa Williams may refer to:", "*Lisa Williams (psychic) (born 1973), English claimed psychic and healer", "*Lisa Williams (poet) (born 1966), American poet", "*Lisa Williams (footballer) (born 1991), Australian rules footballer"]}, {"page": "Sunday Night Safran", "response": ["During the program's run, Safran and Fr Maguire were able to get interviews from people such as religious scholar Reza Aslan, Julian Assange's mother Christine, The Exorcist star Linda Blair,  Pulitzer Prize winning journalist Katherine Boo, philosopher and School of Life founder Alain de Botton, writer, retired prison doctor and psychiatrist Theodore Dalrymple, longest-serving Australian Foreign Minister Alexander Downer, West Memphis Three Damien Echols, detained Al Jazeera journalist Peter Greste, antitheist Christopher Hitchens, Dame Edna creator Barry Humphries, conspiracy theorist David Icke, television evangelist and exorcist Bob Larson, Serbian political activist Srđa Popović, former white supremacist skinhead Frank Meeink, pro-euthanasia doctor Philip Nitschke, The Act of Killing director Joshua Oppenheimer, journalist and writer Jon Ronson, true crime writer and Ted Bundy co-worker Ann Rule,  Australian Race Discrimination Commissioner  Tim Soutphommasane, the Lizardman Erik Sprague, African-American pro-Israel political activist and Zionist Chloé Valdary, Jewish activist against child sexual abuse Manny Waks, psychic Lisa Williams, American parodist \"Weird Al\" Yankovic and John Safran's dad, Alex. "]}, {"page": "List of channelers (mediumship)", "response": ["* Lisa Williams"]}]}}