{"wiki_id": "http://www.wikidata.org/entity/Q18002672", "itemLabel": "Lee Hardcastle", "itemDescription": "British animator, film director and screenwriter", "wikipedia_url": "https://en.wikipedia.org/wiki/Lee_Hardcastle", "wikipedia_page": {"main": "Lee Hardcastle (born 21 January 1985) is a British animator who specialises in stop-motion techniques. He is famous for his hand-made independent animations. His work includes original remakes of emblematic 1980s action and horror films, as well as parodies of animated series and video clips. His work is known for its violent and gory content.", "link_mentions": [{"page": "Dan Haigh", "response": ["GUNSHIP have a reputation for creating innovative and interesting music videos and have collaborated with film director John Carpenter on their claymation homage to 1980s nostalgia \"Tech Noir\" co-written and directed by GUNSHIP and Lee Hardcastle. John Carpenter is quoted as describing GUNSHIP as “nice and cool.” and that Gunships ‘Tech Noir’ is “One of my favorite songs of the year. Gunship rules.” He also went on to say “It would be fun to collaborate with Gunship.” GUNSHIP have also created the \"first music video made in the GTA 5 Rockstar editor\"  for their song \"The Mountain\" and made a music video entirely from pixel art with Jason Tammemagi for their song \"Revel In Your Time\""]}, {"page": "The Raid (2011 film)", "response": ["A stop-motion short depicting the plot of The Raid as clay-animated cats, made by Lee Hardcastle released on 11 May 2012, was included in the special features disc. A flash animated teaser trailer spoof depicting The Raid as a '90s anime, made by Philip Askins released on 19 May 2012, was also included in the special features."]}, {"page": "The ABCs of Death", "response": ["The ABCs of Death is a 2012 American anthology horror comedy film produced by international producers and directed by filmmakers from around the world. The film contains 26 shorts, each by different directors spanning fifteen countries, including Nacho Vigalondo, Kaare Andrews, Adam Wingard, Simon Barrett, Banjong Pisanthanakun, Ben Wheatley, Lee Hardcastle, Noboru Iguchi, Ti West, and Angela Bettis.", "A contest was held for the role of the 26th director. The winner was UK-based director Lee Hardcastle, who submitted the claymation short for T.", "|Lee Hardcastle", "|In this claymation short, a child is being taught how to use the toilet by his parents. The toilet suddenly grows teeth and eyeballs and telepathically locks the door. It brutally kills and devours the child's parents before lunging at the child, revealing it all to be a nightmare. The child decides to use the toilet for real, but a loose screw frightens him, leading to him getting his head stuck in the toilet seat. His father laughs upon seeing him, but the toilet tank then comes loose and falls, crushing the child's head and causing the father to scream in horror.Cast: Kim Richardson as Mum (voice), Lee Hardcastle as Dad (voice)NOTE: This short spawned a sequel called Ghost Burger, where it is revealed that the child survived his injuries."]}, {"page": "Rick and Morty", "response": ["In 2017, Adult Swim released a series of claymation short films called Rick and Morty: The Non-Canonical Adventures on YouTube. They were created by Lee Hardcastle, and parody films in the horror and science fiction genres."]}, {"page": "List of Rick and Morty episodes", "response": ["On October 26, 2016, Adult Swim began releasing a web series of claymation shorts, Rick and Morty: The Non-Canonical Adventures. Written and directed by Lee Hardcastle, the shorts follow Rick and Morty characters into parodies of scenes from various science-fiction and horror films. The title of each short is the same as that of the film the short is parodying, and each episode ends with the Adult Swim logo [as] integrated in the scene. On November 1, 2019, Hardcastle released a video compiling all the shorts, while also releasing the last ten previously unreleased shorts. Additional shorts were later released in 2021."]}, {"page": "The Belko Experiment", "response": ["The film was promoted through a series of four claymation shorts directed by Lee Hardcastle which, according to website io9 (where they debuted),  \"features exaggerated versions of The Belko Experiment’s characters, and offers a taste of the level of violence and humor you’ll see when the actual movie opens\". The movie was also promoted with a video game, \"'Belko Experiment’ Escape Room in VR\" released for virtual reality platforms."]}, {"page": "Draft talk:Lee Hardcastle", "response": ["I have just modified one external link on Lee Hardcastle. Please take a moment to review my edit. If you have any questions, or need the bot to ignore the links, or the page altogether, please visit this simple FaQ for additional information. I made the following changes:"]}]}}