{"wiki_id": "http://www.wikidata.org/entity/Q180367", "itemLabel": "Charles Bugbee", "itemDescription": "British water polo player", "wikipedia_url": "https://en.wikipedia.org/wiki/Charles_Bugbee", "wikipedia_page": {"main": "Charles G. Bugbee (29 August 1887 – 18 October 1959) was a British water polo player who competed in the 1912 Summer Olympics, the 1920 Summer Olympics, and the 1924 Summer Olympics.He was part of the British water polo team, which won gold medals in 1912 and 1920. He also participated in the 1924 Olympic water polo tournament, but the British team lost their first-round game. A City of London policeman, he served in the Great War as a leading mechanic in the Royal Naval Air Service, from May 1915 until April 1918 and then in the R.A.F. until 1919. In addition to his Olympic medals, he was awarded the 1914/15 Star, British War and Victory Medals, and the 1911 City of London Police Coronation Medal.", "link_mentions": [{"page": "Great Britain at the 1924 Summer Olympics", "response": ["* Charles Bugbee"]}, {"page": "List of Olympic medalists in water polo (men)", "response": ["|Isaac BenthamCharles BugbeeGeorge CornetArthur Edwin HillPaul RadmilovicCharles SmithGeorge Wilkinson", "|valign=top|Charles BugbeeWilliam Henry DeanChristopher JonesWilliam PeacockNoel PurcellPaul RadmilovicCharles Smith"]}, {"page": "Water polo at the 1924 Summer Olympics", "response": ["| 8 ||align=left| Harold AnnisonJohn BuddCharles BugbeeRichard HodgsonArthur HuntPaul RadmilovicCharles Sydney SmithD. EdwardR. HastonWilliam Peacock"]}, {"page": "Water polo at the 1920 Summer Olympics", "response": ["|   Charles Sydney SmithPaul RadmilovicCharles BugbeeNoel PurcellChristopher JonesWilliam PeacockWilliam Henry Dean"]}, {"page": "Water polo at the 1912 Summer Olympics", "response": ["|  Charles Sydney SmithGeorge CornetGeorge WilkinsonCharles BugbeeArthur Edwin HillPaul RadmilovicIsaac Bentham"]}, {"page": "Noel Purcell (sportsman)", "response": ["At the 1920 Summer Olympics, Purcell was a member of the Great Britain team that won the gold medal.  It was originally intended that Great Britain would be represented by the England national team. However, in a final trial game, England were beaten 6–0 by a Rest of Great Britain team featuring Purcell. This subsequently saw Purcell included in the Olympic squad. Although representing Great Britain, pictures from the Olympics, show Purcell wearing a swimming costume with a shamrock and the word \"Ireland\" on it. In the Olympic final, Great Britain beat Belgium 3–2 to win the gold medal. Other members of the team included Charles Sydney Smith, Paul Radmilovic, Charles Bugbee, Christopher Jones, William Peacock and William Henry Dean.David Needham: Ireland’s First Real World Cup -The Story of the 1924 Ireland Olympic Football Team (2012, The Manuscript Publisher) "]}, {"page": "List of 1912 Summer Olympics medal winners", "response": ["|style=\"width:12em\"|  Charles Sydney SmithGeorge CornetGeorge WilkinsonCharles BugbeeArthur Edwin HillPaul RadmilovicIsaac Bentham"]}, {"page": "Bugbee", "response": ["*Charles Bugbee (1887–1959), British Olympic water polo player"]}, {"page": "Bugbee, Charles", "response": ["#redirectCharles Bugbee"]}, {"page": "Water polo at the 1920 Summer Olympics – Men's team squads", "response": ["* Charles Bugbee"]}, {"page": "List of Olympic champions in men's water polo", "response": ["| 1920 || style=\"text-align: left;\" data-sort-value=\"Bugbee, Charles\" | Charles Bugbee || style=\"text-align: right;\" |  || style=\"text-align: left;\" |  || style=\"text-align: left;\" |  || FP || 1912–1920 || 25/33", "| P1 || style=\"text-align: left;\" data-sort-value=\"Bugbee, Charles\" | Charles Bugbee || FP || style=\"text-align: left;\" |  || style=\"text-align: right;\" | || style=\"text-align: right;\" |  || style=\"text-align: left;\" |  || No || ", "| P2 || style=\"text-align: left;\" data-sort-value=\"Bugbee, Charles\" | Charles Bugbee || FP || style=\"text-align: left;\" |  || style=\"text-align: right;\" | || style=\"text-align: right;\" |  || style=\"text-align: left;\" |  || Yes || "]}]}}