{"wiki_id": "http://www.wikidata.org/entity/Q1801047", "itemLabel": "Tim Seely", "itemDescription": "British actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Tim_Seely", "wikipedia_page": {"main": "Tim Seely (born 10 June 1935) is an English film, radio, television and theatre actor.", "link_mentions": [{"page": "1995 in film", "response": ["| Annie: A Royal Adventure! || Sony Pictures Television / Rastar Television / TriStar Television || Ian Toynton (director); Trish Soodik (screenplay); Ashley Johnson, Joan Collins, George Hearn, Ian McDiarmid, Emily Ann Lloyd, Camilla Belle, Crispin Bonham-Carter, Perry Benson, Carol Cleveland, George Wood, Ian Redford, Timothy Bateson, Ann Morrish, Tim Seely, Mary Kay Bergman, Sam Stockman, Edward Highmore, Antony Zaki, David Tse, Jayne Ashbourne, Buffy Davis, Deborah MacLaren, David King, Roger Bizley, Sam Mancuso || Comedy, Family || Live action"]}, {"page": "1991 in film", "response": ["| King Ralph || Universal Pictures || David S. Ward (director/screenplay); John Goodman, Peter O'Toole, John Hurt, Camille Coduri, Ann Beach, Jack Smethurst, Richard Griffiths, Leslie Phillips, James Villiers, Joely Richardson, Niall O'Brien, Julian Glover, Judy Parfitt, Leo Jean, Ed Stobart, Rudolph Walker, Michael Johnson, Tim Seely || Comedy || Live action"]}, {"page": "1979 in film", "response": ["| Agatha || Warner Bros. / Casablanca FilmWorks / First Artists || Michael Apted (director); Kathleen Tynan, Arthur Hopcraft (screenplay); Dustin Hoffman, Vanessa Redgrave, Timothy Dalton, Helen Morse, Celia Gregory, Paul Brooke, Carolyn Pickles, Timothy West, Tony Britton, Alan Badel, Robert Longden, Donald Nithsdale, Yvonne Gilan, Sandra Voe, Barry Hart, David Hargreaves, Tim Seely, Jill Summers, Chris Fairbank, Liz Smith, Peter Arne || Drama, Thriller || Live Action"]}, {"page": "The Mystery of Edwin Drood", "response": ["The Mystery of Edwin Drood (1960) was a British television miniseries in eight episodes, starring Donald Sinden as John Jasper,  Richard Pearson as Rev. Crisparkle and Tim Seely as Edwin Drood. This serial is believed to be lost, as no recordings or photographs are known to exist."]}, {"page": "Valiant Comics", "response": ["On January 7, 2019, Valiant announced it had hired former JHU Comic Books manager Dani Ward as its Sales Manager. On January 9, 2019, Valiant announced it had hired former Marvel assistant editor Heather Antos as an editor. The following month Valiant announced an ongoing Psi Lords series written by Fred Van Lente and drawn by Renato Guedes that will launch in July 2019. This would be followed in subsequent months by announcements of new series. On March 14 Valiant announced a new Bloodshot ongoing series would launch in September 2019, written by Tim Seely and drawn by Brett Booth. The series will launch with a one-shot written by Seely which will be released on May 4, 2019 as part of Free Comic Book Day. The first three issues will be collected and released as a trade paperback in December to coincide with the release of the Bloodshot movie on February 21, 2020. On April 17 editor Heather Antos announced on Twitter that a new X-O Manowar ongoing series would launch in November 2019, written by Dennis Hopeless and drawn by Emilio Laiso. On July 11 a four-issue mini-Ninjak series was scheduled to debut that October, written by Cullen Bunn and drawn by Ramon F. Bachs."]}, {"page": "Agatha (film)", "response": ["* Tim Seely as Capt. Rankin"]}, {"page": "Mutiny on the Bounty (1962 film)", "response": ["* Tim Seely: Edward 'Ned' Young (Midshipman)"]}, {"page": "Seely", "response": ["* Tim Seely (born 1935), British movie and theatre actor"]}, {"page": "List of former Emmerdale characters", "response": ["|Sir Thomas Weir || Tim Seely || 1994–1995"]}, {"page": "Please Turn Over", "response": ["* Tim Seely - Robert Hughes, the playwright"]}, {"page": "Annie: A Royal Adventure!", "response": ["* Tim Seely as The King"]}, {"page": "Sally's Irish Rogue", "response": ["Sally's Irish Rogue  is a 1958 British comedy film directed by George Pollock and starring Julie Harris, Harry Brogan and Tim Seely.  It was based on the play The New Gossoon by George Shiels, and was released in the U.S. as The Poacher's Daughter. Filming took place at Ardmore Studios in Dublin.", "* Tim Seely ...  Luke Carey"]}, {"page": "The Mystery of Edwin Drood (miniseries)", "response": ["The BBC previously adapted Edwin Drood into eight thirty minute episodes, broadcast in weekly parts from 28 September to 16 November 1960. It starred Donald Sinden as John Jasper, Richard Pearson as Rev. Crisparkle, Tim Seely as Edwin Drood and Barbara Brown as Rosa Bud, with each episode featuring an introduction by actor Michael Ingrams. This serial is believed to have been lost during the BBC's archival purge in the 1960s and 70s, and virtually nothing else is known about it beyond the rest of the cast and the episode titles. No photographs are known to exist either, leaving no visual record on any aspect of the production. Seely is credited for the final episode, suggesting it may have shared the same twist ending as the 2012 version."]}]}}