{"wiki_id": "http://www.wikidata.org/entity/Q18009204", "itemLabel": "Sheridan Barnett", "itemDescription": "British fashion designer", "wikipedia_url": "https://en.wikipedia.org/wiki/Sheridan_Barnett", "wikipedia_page": {"main": "Sheridan Barnett (born 1951) is a British former fashion designer who worked with London boutique Quorum and launched the brand Barnett and Brown with Sheilagh Brown during the late 1970s. He went on to combine own-brand design with freelance work for names such as Jaeger, Norman Hartnell and Reldan, also working as a university academic. Barnett won Bath Museum of Costume's Dress of the Year award in 1983.", "link_mentions": [{"page": "List of fashion designers", "response": ["* Sheridan Barnett"]}, {"page": "Alfred Radley", "response": ["In 1968 Radley acquired Quorum with its famous designers Ossie Clark, Alice Pollock and Celia Birtwell. While Ossie Clark flourished under the Quorum label, Radley promoted the careers of many designers including: Betty Jackson, Sheilagh Brown, Sheridan Barnett, Wendy Dagworthy, Rosemary Bradford and Terence Nolder (who in 1980 won the British Eveningwear Designer Award and The British Designer of the Year Award in 1981)"]}, {"page": "Dress of the Year", "response": [": Sheridan Barnett"]}, {"page": "Alice Pollock", "response": ["Quorum provided a shop window for the work of many young designers, and began featuring Clark's work in 1965. Other Quorum designers included Michael Rainey (before he launched his own boutique Hung On You in winter 1965), Sheridan Barnett, who later launched label Barnett and Brown with Sheilagh Brown and the textile designer Frances Ronaldson, who went on to marry Pollock's ex-husband, Nick Pollock. Pollock designed for the label into the 1970s. She and Clark parted ways in 1973 and Clark and Birtwell's marriage ended the following year."]}, {"page": "Stirling Cooper", "response": ["Jef Cooper asked Sheridan Barnett & Sheilagh Brown to create the Look & design the clothes for his new brand called Coopers.", "Jef kept the wonderful Stirling Cooper shop in Wigmore St . Working  out of the studios in South Molton St & Clifford St, Sheridan Barnett & Sheilagh Brown created iconic clothes that were  featured in all the most  influential  fashion magazines & media of the time .(see Sunday Times editorial by  Michael Roberts and Molly Parkin, photographs by Guy Bourdin   6/8/72 ). After a year, they  moved on to join Ossie Clark & Alice Pollock at Quorum, where they created some of the most iconic fashion looks of the decade . They went on, several years later, to creat their own, critically acclaimed, collections under the Jazz label.", "By 1970, Stirling Cooper was producing handbags, belts and accessories that were stocked by the new Bata shoe shop on Oxford Street. Jane Whiteside's original design direction for womenswear was continued by a team of young designers, including Sheilagh Brown – also from the Royal College of Art and later to work with Sheridan Barnett – Phyllis Collins and Judy (Judith) Ullman; Ullman would later design for Moons. Price remained with Stirling Cooper until late 1971, moving on to the boutique Che Guevara.", "In 1972, original partners Ronnie Stirling and Jeff Cooper split – reportedly due to the pressures of the business. Jeff Cooper joined Radley/Quorum after working with Sheilagh Brown and Sheridan Barnett on the Coopers brand, while Ronnie Stirling remained at the helm of Stirling Cooper."]}, {"page": "Sheilagh Brown", "response": ["Sheilagh Brown is a British fashion designer who began her career in the 1960s, as part of the Swinging London scene. She was among the designers for Stirling Cooper, working subsequently at Coopers and Quorum, before establishing the label Barnett and Brown with Sheridan Barnett.", "When the Stirling Cooper partnership split, Brown moved on with Jeff Cooper and Sheridan Barnett to found Coopers, a high-fashion brand located just off Savile Row. This had its own store, but also retailed through stores such as Miss Selfridge. Two years later, Brown and Barnett took over from Alice Pollock and Ossie Clark as head designers at Quorum. Describing the atmosphere, Brown has said: \"It was every designer's dream job. It was insane, with Alice working on her collection, stark naked on hot days. Crazed models drifted into my studio and drank my cloudy paint water!\"", "Brown's own label designs for Jeffrey Rogers proved so successful that she began designing for its more upmarket Portrait label as well. Brown noted that this was a very different way of working, not least because store buyers had more control over the overall styling and merchandising of garments once they arrived in store, adding: \"The discipline of working within a strict budget is surprisingly exhilarating\". Brown also maintained her own more upmarket label, with outfits costing upwards of £200, but Brenda Polan said this was a bonus. \"Jeffrey Rogers's masterstroke is that he has made the connection between designer and mass market less tenuous\". In 1984, Brown's designs were exhibited at a British fashion event held at Olympia for international fashion buyers – described as a \"coming of age\" for the fashion industry – since all the ready-to-wear designers were under one roof and exhibited so that buyers and journalists could see their work. Others exhibiting included BodyMap, Wendy Dagworthy, Betty Jackson, Roland Klein and Sheridan Barnett.", "Brown's involvement in shaping high fashion's move from elite couture into edgy styles for mass manufacturing – notably with Stirling Cooper – was profiled in an interview for the Design Museum's 2009 exhibition Super Contemporary. Her eponymous designs with Sheridan Barnett are included within the archive of the Victoria and Albert Museum.", "* V&A collections: coat, hat and veil by Sheridan Barnett with dress by Sheilagh Brown "]}, {"page": "Jeffrey Rogers", "response": ["In the early 1980s, Rogers had six different labels within the Jeffrey Rogers group. He began more high-fashion and upmarket collaborations, working first with two former Royal College of Art students Meghumi Ohki and Barbara Kennington on the Lumiere brand they had launched in 1977; they had the design background but wanted his input into the business side.  In 1983, he collaborated with Sheilagh Brown, a high-fashion designer who had formerly worked with Stirling Cooper and Sheridan Barnett among others, and was then principal lecturer in fashion at Central Saint Martins. Initially the idea was to give her students the opportunity to design garments for commercial production. This, as described by Rogers, was an abysmal failure, but he liked working with Brown and invited her to design for him. Brown's own label designs proved so successful that she began designing for Jeffrey Rogers' more upmarket Portrait label as well."]}]}}