{"wiki_id": "http://www.wikidata.org/entity/Q18044705", "itemLabel": "Iliess Macani", "itemDescription": "English rugby league footballer", "wikipedia_url": "https://en.wikipedia.org/wiki/Iliess_Macani", "wikipedia_page": {"main": "Iliess Macani (born 6 December 1993) is an English rugby league footballer who plays for the London Skolars in the Betfred League 1. He plays primarily as a winger or fullback at equal abilities and can also play as a centre.\nHe previously played for the London Broncos. Macani came through the London Broncos Scholarship and Academy teams and also played for the London Skolars juniors.", "link_mentions": [{"page": "Ilies Macani", "response": ["#REDIRECT Iliess Macani"]}, {"page": "2017 Bradford Bulls season", "response": ["The administrators announced that two last minute bids were unsuccessful and therefore the club was liquidated. Following this news, winger James Clare signed for Leigh Centurions on a two-year deal. This sparked an exodus at Odsal as players became free agents. Academy products Tom Olbison, Alex Mellor and Adam O'Brien all signed with Super League clubs as Olbison joined Widnes Vikings with Mellor and O'Brien joining the Huddersfield Giants on long term deals. Top try scorer Kris Welham attracted numerous offers before settling on Salford Red Devils and second rower Jason Walton signed with RFL Championship side Featherstone Rovers. Superstar fullback Kieren Moss and prop Ben Kavanagh also signed for Hull Kingston Rovers. The Rugby Football League (RFL) accepted a bid to found a new club in Bradford. It was announced that Andrew Chalmers and a former Wigan Warriors coach, Graham Lowe, were the successful new owners. They immediately signed veteran halfback Leon Pryce and released coach Rohan Smith. In addition to this they declined to offer Aussie halfback Dane Chisholm a contract with the new club. During the owners press conference they revealed that Manly Sea Eagles legend Geoff Toovey would become the Bulls new coach for the 2017 season, in addition to this Leon Pryce was revealed as the captain. Australian second rower Lachlan Burr signed for Leigh Centurions. The Bulls re-signed the rest of the off contract players. With a makeshift side the Bulls lost 10-28 to a strong Huddersfield Giants side with Joe Keyes and Ross Oakes scoring for Bradford, Keyes kicked a conversion. Second-row forward Colton Roche put pen to paper on a deal to join the Bulls for the 2017 season from York City Knights. In the final pre-season match, Bradford narrowly lost 24-25 to League 1 side Keighley Cougars. New signing Roche scored the opening try before young hooker Joe Lumb scored. Oakes carried on from the previous week and scored whilst Iliess Macani also went over for a try, Keyes kicked three goals and Oscar Thomas kicked a conversion. Squad numbers were released at the end of the month, with Pryce receiving the number 6 shirt.", "Reinforces were made to the squad as Leeds Rhinos loaned out halfback Jordan Lilley, second row Josh Jordan-Roberts, hooker Sam Hallas and prop Mikolaj Oledzki on a 1-month loans to the Bulls ahead of the opening game. The opening game of the season saw the Bulls lose 24-54 to RFL Championship favourites Hull Kingston Rovers. The Bulls took an early lead through young prop Liam Kirk before Hull KR scored a few tries to take the lead. Academy graduate Ross Oakes also scored before fan favourite Ethan Ryan raced 80m to score an interception try ten minutes from full-time. Iliess Macani scored a consolation try after a Jordan Lilley intercept whilst fullback Oscar Thomas kicked four conversions. Following the defeat the Bulls announced the capture of young Samoan rugby sevens star Phoenix Hunapo-Nofoa on a 1-year deal. The first home game of the season saw 4,051 people watch the Bulls narrowly lose 14-22 to  the Rochdale Hornets. Youngster James Bentley and Thomas both scored tries whilst Thomas kicked 3 goals in the defeat. After being out powered in the pack the Bulls announced the signing of French international, second row forward Kevin Larroyer on a 1-month loan deal from Castleford Tigers. Bradford added more experience signing ex-international Scott Moore on a 4-game trial and also utility back Lee Smith on a 2-year deal.", "*Round 1: Iliess Macani, Colton Roche, Jon Magrin, Ross Peltier, Brandan Wilkinson, Jordan Lilley, Sam Hallas, Josh Jordan-Roberts and Mikolaj Oledzki all made their debuts for the Bulls.", "*Round 1: Iliess Macani and Liam Kirk scored their 1st tries for the Bulls.", "|5|| Iliess Macani ||W ||W", "|5|| Iliess Macani ||W ||W ||W ||W ||W ||B ||W ||W ||x ||B ||W ||12px ||B ||W ||W ||W ||W ||12px ||12px ||12px ||12px ||W ||W ||- ||W ||W ||W ||W ||W ||W ||W ", "|5|| Iliess Macani ||W", "|Iliess Macani", "|align=center| Iliess Macani"]}, {"page": "2018 Bradford Bulls season", "response": ["Off-contract winger Iliess Macani departed the Bulls and signed for RFL Championship side Sheffield Eagles on a 1-year deal. It was announced that the Bulls would play local rivals Halifax in a festive Boxing Day friendly, the first the Bulls have participated in since 2012. Following this it was also confirmed that the Bulls would play Sheffield Eagles in a friendly as a part of the Dane Chisholm transfer midway through last season. Young second-row forward Liam Johnson followed the footsteps of Mikey Wood and joined the Bulls from Super League side Huddersfield Giants on a season long loan. The fixtures for the 2018 season were announced and the Bulls would kick off the campaign away to York City Knights on 18 February, before hosting the London Skolars at home on 4 March. The highly anticipated derby with local rivals Keighley Cougars were scheduled on 11 March (away) and 2 September (home). It was also revealed that head coach Geoff Toovey would not be returning to the Bulls and in the meantime Leigh Beattie will take up the interim head coach role until a new coach is appointed. Championship side Dewsbury Rams released details to two friendlies, with one being against the Bulls on 21 January at Crown Flatt, meanwhile Bradford announced that they would face Keighley Cougars in a friendly match on 11 February for the Joe Philips Memorial trophy. Sheffield Eagles announced that they would face Bradford in a friendly in 2018 as part of the deal which brought superstar halfback Dane Chisholm to the Bulls in 2017, the tie will be played on 11 January. The newest team in rugby league, Toronto Wolfpack also announced a ground breaking Transatlantic Challenge which would see them face the Bulls in a pre-season match in 2018 and 2019, with the 2018 fixture being played at Odsal on 26 January and the 2019 fixture likely to be played in Canada or the United States to promote the sport. Prop forward Jon Magrin who featured for the Bulls 25 times in 2017 decided to sign with Championship side Sheffield Eagles on a 2-year deal joining fellow former teammate Iliess Macani.", "Top points scorer from last season Oscar Thomas followed former Bulls Iliess Macani and Jon Magrin by signing with RFL Championship side Sheffield Eagles on a one-year deal. The next friendly for the Bulls saw them overcome RFL Championship side Sheffield Eagles 12-6 in a very defensive match which saw Steve Crossley and Dalton Grant claim tried for Bradford whilst youngster Rowan Milnes kicked two goals. The following game saw the Bulls field a young side away at Dewsbury Rams for former player Paul Sykess' testimonial. The Bulls lost the match 24-0. During a press conference it was revealed that the Bulls had entered a dual registration with Championship side Toronto Wolfpack. Also in this press conference the Bulls announced the signing of fullback Gregg McNally on a two-year deal from Leigh Centurions and also revealed the new red 2018 away kit. The Bulls faced their new dual registration partners in a friendly, however the Toronto side outclassed the Bradford side who lost the match 34-0.", "|align=center| Iliess Macani"]}, {"page": "2017 London Broncos season", "response": ["|  Iliess Macani || Bradford Bulls || 2 Years || August 2016"]}, {"page": "2019 London Skolars season", "response": ["|align=center| Iliess Macani", "|align=center| Iliess Macani", "|align=center| Iliess Macani", "|align=center| Iliess Macani"]}, {"page": "2021 RFL League 1", "response": ["|  Iliess Macani"]}]}}