{"wiki_id": "http://www.wikidata.org/entity/Q18044016", "itemLabel": "Hannah Arterton", "itemDescription": "British actor and singer", "wikipedia_url": "https://en.wikipedia.org/wiki/Hannah_Arterton", "wikipedia_page": {"main": "Hannah Jane Arterton (born 26 January 1989) is an English actress. She attended Gravesend Grammar School for Girls and graduated from the Royal Academy of Dramatic Art in 2011. She has most notably appeared in the television series The Five (2016) and Safe (2018), and in the film Walking on Sunshine (2014).", "link_mentions": [{"page": "1989 in film", "response": ["* January 26 – Hannah Arterton, American actress"]}, {"page": "South Norwood", "response": ["* Hannah Arterton - actress, lives in South Norwood."]}, {"page": "Daniel Schaffer", "response": ["*Peripheral (2019) – screenwriter. Directed by Paul Hyett, starring Hannah Arterton, Tom Conti."]}, {"page": "1989 in the United Kingdom", "response": ["** Hannah Arterton, actress"]}, {"page": "List of alumni of the Royal Academy of Dramatic Art", "response": ["*Hannah Arterton (BA Acting 2011)"]}, {"page": "If I Could Turn Back Time", "response": ["In the film Walking on Sunshine, there is a version of this song performed by the protagonists Taylor (Hannah Arterton) and Raf (Giulio Berruti)."]}, {"page": "Mayfield Grammar School", "response": ["* Hannah Arterton, actress"]}, {"page": "Gemma Arterton", "response": ["Arterton was born at North Kent Hospital in Gravesend with polydactyly, a condition resulting in extra fingers which a doctor removed shortly after her birth. Her mother, Sally-Anne Heap, runs a cleaning business, and her father, Barry J. Arterton, is a welder.- -  They divorced during Arterton's early childhood, and she grew up in a council estate with her mother and younger sister, Hannah Arterton, who is also an actress.-  Her matrilineal great-grandmother was a German-Jewish concert violinist.", "In 2019, Arterton appeared in the Netflix comedy Murder Mystery (which stars Adam Sandler, Jennifer Aniston and Luke Evans). Despite the film's largely negative reviews, it was watched by 30.9 million Netflix account-holders in its first three days of release, then a record for the streaming service. In the same year, Arterton played the socialite and author Vita Sackville-West in Vita and Virginia, a film about the romantic relationship between Arterton's character and Virginia Woolf which was the inspiration for Woolf's novel Orlando: A Biography. Arterton is credited as executive producer of the film.-  She also produced and starred in the short film Hayley Alien, which was written and directed by her sister and co-star, Hannah Arterton."]}, {"page": "Atlantis (TV series)", "response": ["*Hannah Arterton as Korinna"]}, {"page": "List of British films of 2014", "response": ["|| Director: Joanna Coates   Cast: Josh O'Connor, Hannah Arterton, Rea Mole, Daniel Metz"]}, {"page": "Walking on Sunshine (film)", "response": ["* Hannah Arterton as Taylor"]}, {"page": "Hide and Seek (2014 film)", "response": ["* Hannah Arterton as Charlotte"]}, {"page": "The Five (TV series)", "response": ["* Hannah Arterton as D.C. Ally Caine, Danny's partner"]}, {"page": "Burn Burn Burn", "response": ["* Hannah Arterton as Sophie"]}, {"page": "The Convent (2018 film)", "response": ["* Hannah Arterton as Persephone"]}, {"page": "Safe (TV series)", "response": ["* Hannah Arterton as Emma Castle, Detective Constable relocated from the big city"]}, {"page": "List of British films of 2018", "response": ["|| Director: Paul Hyett  Cast: Michael Ironside, Rosie Day, Hannah Arterton"]}, {"page": "Arterton", "response": ["*Hannah Arterton (born 1989), English actress, sister of Gemma"]}]}}