{"wiki_id": "http://www.wikidata.org/entity/Q18016183", "itemLabel": "Tom Beere", "itemDescription": "English footballer (born 1995)", "wikipedia_url": "https://en.wikipedia.org/wiki/Tom_Beere", "wikipedia_page": {"main": "Thomas Keith Robert Beere (born 27 January 1995) is an English footballer who plays as a midfielder for Tonbridge Angels.", "link_mentions": [{"page": "AFC Wimbledon", "response": ["The 2015–16 season was AFC Wimbledon's fifth consecutive season in League Two. Despite getting the season off to a mediocre start, the Dons finished the season strongly, winning seven out of their last 10 league matches to ensure that the club would confirm their highest ever League Two finish of seventh place and qualification to the 2016 Football League play-offs. A record home attendance of 4,870 turned out to see AFC Wimbledon beat Accrington Stanley 1–0 in the first leg of the play-off semi-final on 14 May 2016 (exactly 28 years to the day since the original Wimbledon won the 1988 FA Cup Final against Liverpool) following a dramatic extra time winner from academy product Tom Beere. This goal ultimately proved to be the difference between the two sides as AFC Wimbledon went on to win 3–2 on aggregate after a 2–2 draw in the reverse fixture. This win earned them a place in the play-off final at Wembley Stadium against Plymouth Argyle. The fixture was scheduled for 30 May 2016, exactly 14 years to the day since the club's foundation. AFC Wimbledon ultimately triumphed 2–0 on the day in front of a crowd of 57,956."]}, {"page": "AFC Wimbledon Development Squad and Academy", "response": ["*  Tom Beere"]}, {"page": "2014–15 AFC Wimbledon season", "response": ["| 21 || MF ||  || Tom Beere || 0 || 0 || 0 || 0 || 0 || 0 || 1 || 0 || 1 || 0"]}, {"page": "2015–16 AFC Wimbledon season", "response": ["| MF ||  || 16 || Tom Beere || 0 ||  1 || 0 || 0 || 0 || 1", "| 16 || MF ||  || Tom Beere || 1 || 0 || 0 || 0 || 0 || 0 || 0 || 0 || 0 || 0 || 1 || 0", "| align=\"center\" | Tom Beere", "| align=\"center\" | Tom Beere"]}, {"page": "2016 Football League Two play-off Final", "response": ["Wimbledon's opponents in their play-off semi-final were Accrington Stanley with the first match of the two-legged tie being played on 14 May 2016 at Kingsmeadow in Greater London.  After a goalless first half in which no shots on target were made by either side, Tom Beere's low shot three minutes into injury time beat Neil Etheridge in the Accrington goal to ensure the match ended 1–0.  The second leg of the semi-final play-off took place four days later at the Crown Ground in Accrington.  Josh Windass levelled the tie with a penalty six minutes before half-time after Scott Brown was fouled.  Piero Mingoia then put Accrington ahead on aggregate with a strike in the 59th minute.  Midway through the second half, a header from Adebayo Akinfenwa made it 2–1 and with no further change to the scoreline, the game went into extra time.  Lyle Taylor then scored after Etheridge had saved an effort from Jake Reeves, and Wimbledon progressed to the final with a 3–2 aggregate victory."]}, {"page": "2016–17 AFC Wimbledon season", "response": ["|16||Tom Beere||CM/RM|||||Southwark||||29||1||0||0||Academy||6 May 2014||Trainee||1 July 2017", "| 16 || MF ||  || Tom Beere || 0 || 0 || 0 || 0 || 0 || 0 || 1 || 0 || 1 || 0", "| align=\"center\" | Tom Beere"]}, {"page": "2017–18 AFC Wimbledon season", "response": ["| align=\"center\" | Tom Beere"]}, {"page": "Beere", "response": ["* Tom Beere"]}]}}