{"wiki_id": "http://www.wikidata.org/entity/Q1800397", "itemLabel": "Julie Gardner", "itemDescription": "television producer", "wikipedia_url": "https://en.wikipedia.org/wiki/Julie_Gardner", "wikipedia_page": {"main": "Julie Ann Gardner, MBE (born 4 June 1969) is a Welsh television producer. Her most prominent work has been serving as executive producer on the 2005 revival of Doctor Who and its spin-off shows Torchwood and The Sarah Jane Adventures. She worked on Doctor Who from 2003 to 2009 before moving to Los Angeles to work at BBC Worldwide. In 2015, Gardner co-founded the production company Bad Wolf, best known for the BBC TV series His Dark Materials, on which Gardner also serves as an executive producer.", "link_mentions": [{"page": "Doctor Who", "response": ["Licensed media such as novels and audio plays provided new stories, but, as a television programme, Doctor Who remained dormant until 2003. In September of that year, BBC Television announced the in-house production of a new series, after several years of attempts by BBC Worldwide to find backing for a feature film version. The executive producers of the new incarnation of the series were writer Russell T Davies and BBC Cymru Wales head of drama Julie Gardner."]}, {"page": "Sontaran", "response": ["Most of the Sontarans depicted in the television series have had short names, many beginning with an initial 'st' sound. Examples include Styre (The Sontaran Experiment), Stor (The Invasion of Time), Stike (The Two Doctors), Staal (\"The Sontaran Stratagem\" / \"The Poison Sky\"), Stark (\"The Pandorica Opens\"), Strax and Stenck (\"The Vanquishers\"); others are Skorr (\"The Sontaran Stratagem\" / \"The Poison Sky\"), Ritskaw and Kragar (\"The Halloween Apocalypse\"), Skaak (\"War of the Sontarans\"), Linx (The Time Warrior), Varl (The Two Doctors), Jask (\"The End of Time\") and Kaagh (The Sarah Jane Adventures)). Elements of the Sontaran military structure mentioned in the series include the \"Sontaran G3 Military Assessment Survey\" and the \"Grand Strategic Council\",The Sontaran Experiment, Writers Bob Baker and Dave Martin, Director Rodney Bennett, Producer Philip Hinchcliffe. Doctor Who. BBC One, London. 22 February – 1 March 1975. the Ninth Sontaran Battle Group,The Two Doctors, Writer Robert Holmes, Director Peter Moffatt, Producer John Nathan-Turner. Doctor Who. BBC One, London. 16 February – 2 March 1985. the \"Fifth Army Space Fleet of the Sontaran Army Space Corps\",The Time Warrior, Writer Robert Holmes, Director Alan Bromly, Producer Barry Letts. Doctor Who. BBC One, London. 15 December 1973 – 5 January 1974. and the \"Tenth Sontaran Battle Fleet\".\"The Sontaran Stratagem\", Writer Helen Raynor, Director Douglas Mackinnon, Producer Susie Liggat, Executive Producers Russell T Davies, Julie Gardner, Phil Collinson. Doctor Who. BBC One, Cardiff. 26 April 2008. Military titles include Commander, Group Marshal, Field Major, and General. Agnomens include \"the Undefeated\", \"the Bloodbringer\", \"the Avenger\", and \"the Slayer\".", "Sontarans reproduce asexually and all the Sontarans depicted in the television series are of one gender; referred to with masculine pronouns, however it is not known if they possess distinctly male physiologies. General Staal comments that \"words are the weapons of womenfolk\" and that the clone of Martha Jones performed well \"for a female\"\"The Poison Sky\", Writer Helen Raynor, Director Douglas Mackinnon, Producer Susie Liggat, Executive Producers Russell T Davies, Julie Gardner, Phil Collinson. Doctor Who. BBC One, Cardiff. 3 May 2008. as commentary on the gender inequalities of other species. This typifies a Sontaran trait: interested only in the strongest fighters in any group or race. Despite this, Strax appeared perfectly comfortable with the prospect of wearing dresses in \"The Battle of Demon's Run - Two Days Later\";After Vastra lists \"some spectacular dresses\" among aspects of their lives, Strax asks if they need a \"man one\". \"No,\" they both reply. \"Am I the man one?\" \"No!\" \"So, dresses then,\" he confidently declares as he joins them to leave. he ultimately dressed in human gentleman's attire, nevertheless.\"The Great Detective\", \"Vastra Investigates\", \"The Snowmen\", \"The Crimson Horror\", and \"The Name of the Doctor\". In The Time Warrior, when Linx examines Sarah Jane, he comments on how the human reproduction system is 'inefficient' and that humans 'should change it'. As multiple genders are foreign to them, Sontarans are known to confuse the human male and female sexes; Strax routinely addresses young women as \"Boy\"Strax calls Jenny Flint \"Boy\" in both \"A Good Man Goes to War\" and \"The Battle of Demon's Run - Two Days Later\", as he does Victorian-era Clara Oswald in \"The Snowmen\" and 20th-21st century Clara Oswald in \"The Crimson Horror\" and vice versa,Strax addresses a Glaswegian telegram boy as \"Girl\" in \"The Name of the Doctor\", and claims not to have known that River Song was a woman.\"The Name of the Doctor\""]}, {"page": "Culture of Wales", "response": ["The decision by Julie Gardner, Head of Drama for BBC Wales, to film and produce the 2005 revived version of Doctor Who in Wales is widely seen as a bellwether moment for the industry for the nation. This in turn was followed by the opening of the Roath Lock production studios in Cardiff. Recent English language programmes that have been filmed in Wales include Sherlock and His Dark Materials, while other popular series, such as Hinterland (Y Gwyll) and Keeping Faith (Un Bore Mercher) have been filmed in both Welsh and English."]}, {"page": "Neath", "response": ["*Julie Gardner (1969– ), television producer previously responsible for Doctor Who and its spin-off Torchwood, former executive producer of Scripted Projects at BBC Worldwide and co-founder of Bad Wolf Productions;"]}, {"page": "List of Doctor Who episodes (2005–present)", "response": ["In 2005, the BBC relaunched Doctor Who after a 15-year absence from episodic television, with Russell T Davies, Julie Gardner, and Mal Young as executive producers, Phil Collinson as producer, and Christopher Eccleston taking the lead role of the Ninth Doctor."]}, {"page": "Russell T Davies", "response": ["Davies' association with Casanova began when London Weekend Television producers Julie Gardner, Michele Buck, and Damien Timmer approached him to write a 21st-century adaptation of Casanova's memoirs. He accepted to script the series because it was \"the best subject in the world\" and, after reading the memoirs, sought to create a realistic depiction of Casanova instead of further perpetuating the stereotype of a hypersexual lover. The series was originally written for ITV, but was turned down after he could not agree on the length of the serial. Shortly after ITV declined to produce Casanova, Gardner took up a position as Head of Drama at BBC Wales and brought the concept with her. The BBC agreed to fund the series, but could only release the money required if a regionally based independent company produced the series. Davies turned to Shindler, who agreed to become the serial's fifth executive producer.", "Davies' pitch for Doctor Who was the first one he wrote voluntarily; previously, he opted to outline concepts of shows to commissioning executives and offer to write the pilot episode because he felt a pitch made him \"feel like [he's] killing the work\". The fifteen-page pitch outlined a Doctor who was \"your best friend; someone you want to be with all the time\", the 19-year-old Rose Tyler (Billie Piper) as a \"perfect match\" for the new Doctor, avoidance of the 40-year back story \"except for the good bits\", the retention of the TARDIS, sonic screwdriver, and Daleks, removal of the Time Lords, and a greater focus on humanity. His pitch was submitted for the first production meeting in December 2003 and a series of thirteen episodes was obtained by pressure from BBC Worldwide and a workable budget from Julie Gardner.", "On 24 September 2021, the BBC announced Davies would return as Doctor Who showrunner; he will succeed Chibnall—who will depart the show after the 2022 BBC Centenary special—for the show's 60th anniversary in 2023 and beyond. Davies will be joined by the Bad Wolf production company, which was founded by former Doctor Who executive producer Julie Gardner and former BBC head of drama Jane Tranter."]}, {"page": "Glynneath", "response": ["* Julie Gardner, television producer, responsible for the successful relaunch of Doctor Who."]}, {"page": "Rose (Doctor Who episode)", "response": ["Billie Piper's casting as Rose Tyler was announced in May 2004. According to executive producer Julie Gardner, former pop star Piper \"fits the bill perfectly\" as a \"unique, dynamic partner for Christopher Eccleston\". Davies described Rose as \"the ordinary person who stumbles into something extraordinary and finds herself their equal.\" Camille Coduri and Noel Clarke were also cast to play Rose's mother and boyfriend then named Judy and Muggsy respectively; Davies wanted to include these characters to \"make her real\" and to \"give her a life\". Rose's family is also working-class, which had rarely been seen in companions on the show."]}, {"page": "Jane Tranter", "response": ["In the summer of 2015, Tranter set up a production company with Julie Gardner based in Cardiff, Wales and Los Angeles, California. The company was named Bad Wolf in homage to a Doctor Who storyline. Bad Wolf's first production, The Night Of, was nominated for thirteen Emmys in 2017, of which it won five. The company has since gone on to produce shows like His Dark Materials and A Discovery of Witches. She, along with Julie Gardener, will be returning to Doctor Who when Russell T Davies returns as show-runner in 2023."]}, {"page": "The Doctor (Doctor Who)", "response": ["In \"The End of Time\", a mysterious individual, referred to only in the credits as \"The Woman\", appears unexpectedly to Wilfred Mott throughout both episodes. She is later revealed to be a dissident Time Lady, who opposed the Time Lord High Council's plan to escape the Time War. When she reveals her face to the Doctor, his reaction indicates that he recognises her. Julie Gardner, in the episode's commentary, states that while some have speculated that the Time Lady is the Doctor's mother, neither she nor Russell T. Davies is willing to comment on her identity. When later asked by Wilfred who she was, the Doctor evades answering the question, making their connection unclear. In Doctor Who: The Writer's Tale – The Final Chapter, Russell T Davies states that he created the character to be the Doctor's mother and this is what actress Claire Bloom was told when she was cast.", "The Doctor's relationship with Rose intensifies after he regenerates into the Tenth Doctor. In \"New Earth\" (2006), Rose's body is temporarily inhabited by Cassandra, who kisses the Doctor romantically. This is one of the few scenes in the entire programme where the Doctor is kissed romantically by his companion. In \"School Reunion\" (2006), the arrival of the Doctor's previous companion Sarah Jane Smith and his reaction to seeing her again prompts jealousy and worry from Rose, and Sarah all but admits that she has long been in love with the Doctor. The Doctor also expresses dismay at having his companions age while he regenerates. In the episode, \"The Girl in the Fireplace\" (2006) (written by Steven Moffat), the Doctor develops a romantic relationship with Madame de Pompadour, with whom he shares a passionate kiss. She even takes him away to \"dance\", but how far the metaphor (coined in the episode \"The Doctor Dances\") is taken is not seen on screen. Rose does not openly exhibit jealousy towards Madame de Pompadour. In the novel The Stone Rose, by Jacqueline Rayner, the Doctor kisses Rose after she saves him from being petrified, with it being described as \"a kiss of gratitude and joy and unspeakable pleasure at being alive\". In \"The Impossible Planet\" (2006), the Doctor and Rose share an awkward moment when they have to consider settling down in one time period and Rose suggests they do so together. She later plants a kiss for good luck on the Doctor's spacesuit prior to his descent into the pit. In \"The Satan Pit\" the Doctor, fearing for his life, tells someone \"If you see Rose, tell her... tell her... oh, she knows.\" In \"Doomsday\", when the Doctor says his goodbye to Rose, she finally tells him that she loves him. He begins to reply, but the message is cut off, and he is unable to reciprocate; in the episode's audio commentary, executive producer Julie Gardner had stated that \"he absolutely was going to say it... he was going to tell her he loved her.\""]}, {"page": "History of Doctor Who", "response": ["Davies was made the chief writer and Executive Producer of the new series (called Series One instead of continuing the numbering with Season 27, although the narrative thread continued from the old series rather than starting afresh), and other writers included Mark Gatiss, Steven Moffat, Paul Cornell and Rob Shearman. The Producer was Phil Collinson and the other Executive Producers were Mal Young (although he subsequently left the BBC midway through production at the end of 2004), and BBC Wales Head of Drama, Julie Gardner. A new arrangement of the theme tune was composed by Murray Gold. Gardner later commented that the choice of Cardiff as the base for filming the series was the result of a combination of factors. She and Davies, who had worked together on the BBC drama series Casanova starring David Tennant, were both from Wales; the BBC was looking to move more of its productions away from London, and there was a good variety of filming locations in the area."]}, {"page": "Rose Tyler", "response": ["Lead writer and executive producer Russell T Davies chose the name Rose because he considered it a \"good luck charm\" after he used it for Lesley Sharp's character in Bob & Rose. His desire to make the show \"essentially British\" was another justification: he considered Rose to be \"the most British name in the world\" and feminine enough to subvert a recent trend of female companions having \"boyish\" names, such as Peri, Benny, Charley, and Ace. Davies also frequently uses the surname \"Tyler\" in his work —previous characters he created with the surname include Ruth Tyler in Revelations (1994), Vince Tyler in Queer as Folk (1999), and Johnny Tyler in The Second Coming (2003) —due to his affection for how the surname is spelled and pronounced. Davies also used the surname \"Tyler\" in his Doctor Who New Adventures book \"Damaged Goods\". The casting of Piper as Rose was announced on by the BBC on 24 May 2004. Head of Drama for BBC Wales Julie Gardner commented that the former pop star \"fits the bill perfectly\" as a \"unique, dynamic partner for Christopher Eccleston\". Whilst some fans —including a representative of the Doctor Who Appreciation Society —were enthusiastic about the announcement, others felt it was \"publicity stunt\" casting and questioned Piper's acting credentials. One of the factors that influenced Piper's acceptance of the role was that she was able to relate the character of Rose to her own experiences as a teenager."]}, {"page": "Casanova (2005 TV serial)", "response": ["The series was originally commissioned from Davies by Executive Producer Julie Gardner when she was working at Granada-owned London Weekend Television. However, after Gardner moved on to become Head of Drama at BBC Wales in 2003, she commissioned Davies to write the drama for the BBC instead, as part of the deal that also saw him installed as the chief writer and Executive Producer of Doctor Who (in which Tennant later played the Doctor's tenth incarnation), also being overseen by Gardner and made at BBC Wales. It was Tennant's role as Giacomo that led to Davies casting him in Doctor Who as the Tenth Doctor."]}, {"page": "List of Doctor Who producers", "response": ["|Julie Gardner"]}, {"page": "Aliens of London", "response": ["The production of the episode was overseen by executive producers Russell T Davies, Julie Gardner and Mal Young, and regular producer Phil Collinson."]}, {"page": "Mickey Smith", "response": ["In accepting the role Noel Clarke comments that he \"had to have a lot of faith\" in executive producers Russell T Davies and Julie Gardner because he felt the series was not of high quality at the time of its previous cancellation. Mickey was created alongside Rose's mother Jackie in order to explore the question of who is left behind after a companion leaves earth to travel with the Doctor. Russell T Davies created the two characters and returned frequently to them in order to make Rose \"real\" and \"give her a life\". Whilst Billie Piper, who played Rose, felt that the character of Rose was \"ruthless\" in abandoning elements from her home life, Clarke commented that he felt anybody would do the same, stating \"who can blame her really?\" He felt that Rose's relationship with Mickey consisted of her \"sitting on the couch, watching him watch football\". Retrospectively viewing the episode \"Rose\" in 2009, Davies identifies Mickey's characterisation as \"naturally selfish\"—in the same vein he identifies many of his characters—drawing into question his \"mysterious emails\" and the fact he \"abandons Rose for the football down the pub\". He suggests that the character \"deserved to lose his girlfriend, right from the start\". Clarke feels the character of Mickey wasn't widely liked in the first series, admitting that he also saw the part as a \"kids’ TV\" role."]}, {"page": "Jackie Tyler", "response": ["In creating Rose as a new companion for the 2005 revival of Doctor Who executive producer and lead writer Russell T Davies felt that it would be necessary to examine the questions of \"do her family miss her?\" and \"has she gone missing?\" which he believed to be unavoidable questions. Davies created Jackie and Mickey and provided a story structure that would see Rose return frequently to them in order to make her \"real\" and to \"give her a life\". In Davies' original pitch for the series, Jackie was initially named Judy Tyler.Russell, p.53 The roles of Jackie and Mickey were cast alongside other guest characters for the 2005 series' first production block including Joseph Green and Indra Ganesh from \"Aliens of London\" and \"World War Three\". Camille Coduri was suggested to casting director Andy Pryor and the other members of the production team by executive producer Mal Young. Both producer Phil Collinson and executive producer Julie Gardner felt that Coduri and Billie Piper (Rose) physically resembled each other and this aided the portrayal of their mother/daughter relationship. Discussing Coduri's casting, Collinson stated that she \"understood what Jackie was, from the very first scene she read\". Coduri was already \"very familiar\" with Davies' work as writer and executive producer and so \"was very excited and quite terrified\" about being part of the series because of her level of respect for him.Russell, p.54"]}, {"page": "The Parting of the Ways", "response": ["According to Russell T Davies in Doctor Who Magazine, Jack was left behind because they wanted to explore the effects of the regeneration on Rose (noting that Jack would have taken the regeneration \"in his stride\"). Jack returned in the Doctor Who spin-off series Torchwood, which began broadcasting in October 2006. In an interview in Doctor Who Magazine, Russell T Davies stated that an alternate ending for this episode was written and filmed, with the intention that it would be shown to press previewers to hide the secret of the regeneration. The \"false\" ending would have featured similar dialogue to the televised final scene, but the TARDIS would have scanned Rose and the viewers would have seen the display read: \"LIFEFORM DYING\". Davies considered this scene inferior to the one actually shown but suggested that it might be suitable as an extra on a DVD someday. On the DVD commentary, executive producer Julie Gardner and Billie Piper briefly discuss this ending, which Gardner describes as featuring Rose's death; unlike Davies, Gardner expresses doubts that it will be issued on DVD (it was not included in the Series 1 DVD set). "]}, {"page": "Pete Tyler", "response": ["Simon Pegg, who ultimately played the Editor in \"The Long Game\", was reported as being in line to play Pete, before having to pass on the episode. Paul Cornell, who wrote the episode \"Father's Day\" states that he based the character of Pete on his own father, who attempted many different jobs one of which was, like Pete, selling health drinks. In the episode after assuming responsibility for the destructive time paradox, Pete assures Rose \"I'm your dad, it's my job for it to be my fault\". This line was taken from something Cornell's father once said to him. An item of discussion between the production staff was over who would rescue Rose from falling into the void in second series finale \"Doomsday\"; executive producer's Russell T Davies and Julie Gardner wanted Pete to rescue her, while Noel Clarke and Phil Collinson wanted Mickey. The role was ultimately given to Pete, to emphasise that he had accepted Rose as a surrogate daughter."]}, {"page": "Jack Harkness", "response": ["Actor John Barrowman himself was a key factor in the conception of Captain Jack. Barrowman says that at the time of his initial casting, Davies and co-executive producer, Julie Gardner had explained to him that they \"basically wrote the character around [John]\". Davies had singled out Barrowman for the part. On meeting him, Barrowman tried out the character using his native Scottish accent, his normal American accent, and an English accent; Davies decided it \"made it bigger if it was an American accent\". Barrowman recounts Davies as having been searching for an actor with a \"matinée idol quality\", telling him that \"the only one in the whole of Britain who could do it was you\". A number of television critics have compared Barrowman's performances as Captain Jack to those of Hollywood actor Tom Cruise.", "During Jack's initial appearances in Doctor Who, Russell T Davies held a \"half-hearted\" theory that Jack would dress specific to the time period he was in, to contrast the Doctor who dresses the same wherever and whenever he goes. He is introduced wearing a greatcoat in World War II-set episodes, but changes to modern day jeans in contemporary episode \"Boom Town\" and black leather in futuristic episodes. Davies admits that this was a \"bit of a lame idea\" and decided that Jack \"never looked better than when he was in his World War II outfit\". From the pilot of Torchwood onwards, Harkness once again wears period military clothes from the second World War, including braces and an officer's wool greatcoat in every appearance. Costume designer Ray Holman commented in a Torchwood Magazine interview that \"We always wanted to keep the World War Two hero look for him, so all his outfits have a 1940s flavour.\" Because the character was expected to \"be running around a lot\", Holman redesigned his RAF group captain's greatcoat from Doctor Who to make it more fluid and less \"weighty\". Jack's other costumes are \"loosely wartime based\", such as the trousers are \"getting more and more styled to suit his figure\". Holman explains that there are actually five Captain Jack coats used on the show. The \"hero version\" is used for most scenes, while there is also a wetcoat made with pre-shrunk fabric, running coat which is slightly shorter to prevent heels getting caught, and two \"stunt coats\" that had been \"hero coats\" in the first series.\" Davies feels the military uniform reinforces the idea that the character \"likes his Captain Jack Harkness identity\". Julie Gardner describes the coat as \"epic and classic and dramatic\", while director Brian Kelly believes it gives Jack \"a sweep and a presence\".", "A press release for Torchwood Series Four states that Jack is brought back to Earth because of his \"unstated love\" for Gwen, who in turn still feels for Jack and misses the exciting life she once led beside him.Torchwood The New World, Press Release. Starz.com. Whilst Miracle Day lead writer Russell T Davies states in response to a question posed by AfterElton that he \"hates\" the idea of romantic tension between Gwen and Jack, executive producer Julie Gardner answers by stating \"They love each other. Of course they do.\" Myles believes that in series four, Gwen and Jack have a \"love-hate-love relationship\" resembling in different ways a sibling relationship, a marital relationship and also \"the strongest friendship\". Episode seven of Miracle Day features a scene where Jack threatens Gwen with violence after she states she would have him killed to save her daughter. Writer Jane Espenson explains that the two characters have different needs and that this means they inevitably \"clash like steel blades\". Simon Brew of Den of Geek praises the dynamic between Gwen and Jack in series four, describing them as \"a terrific double act\" and states that \"Torchwood is at, or near, its best when the two of them are working in tandem\".", "Following the character's initial introduction in the revived series 1 of Doctor Who, the character became incredibly popular with fans, to the extent that Russell T Davies and Julie Gardner created a spin-off series, Torchwood, primarily centred around the character. The Times described the undeniable success of the character as having propelled actor John Barrowman to \"National Treasure status\". For his role as Captain Jack, John Barrowman was nominated for Best Actor at the 2007 BAFTA Cymru Awards, and again for Children of Earth at the 2010 TV Choice Awards, against Eleventh Doctor actor Matt Smith. Harkness was also listed number nine in TV Squad's \"Ten Most mysterious characters on television\", behind the Tenth Doctor, who was listed number three. John Barrowman, who is himself gay, has ranked in the Independent on Sunday Pink List, a list of the most influential gay people in Britain, in 2007, 2008, and 2009 with the Independent commenting that \"Proof of his popularity came with the continued runaway success of his bisexual Captain Jack Harkness on Russell T Davies's Torchwood\". Part of Jack's mystique was his sex appeal, swashbuckling heroism and sexual appetite. In anticipation of the character's return to Doctor Who in series 3 after a successful run in the first series of Torchwood, mainstream media hailed his return."]}, {"page": "Face of Boe", "response": ["Writer Russell T Davies, in the episode's commentary, called the implication of this scene \"a theory\" as to the Face of Boe's origins, prompting Executive Producer Julie Gardner to urge him to \"stop back-pedalling\" about the two characters being the same. Davies also said that after writing the scene he inserted a line in the ADR recording for \"Gridlock\" in which the Face of Boe calls the Doctor \"old friend\". Davies has avoided making the relationship between Jack and Boe explicit, stating \"the moment it became very true or very false, the joke dies\". He has refused the publication of spin-off novels and comic books that have tried to definitively link the two. However, in 2020, he seemingly confirmed in a tweet that Jack Harkness is The Face of Boe."]}, {"page": "The Christmas Invasion", "response": ["This episode was released together with \"New Earth\" as a basic DVD with no special features on 1 May 2006, and as part of a second series boxset on 20 November 2006. This release included an in-vision commentary with Russell T Davies, Julie Gardner (Head of Drama for BBC Wales) and Phil Collinson, recorded before the story aired. This commentary was also made available as an MP3 on the BBC Doctor Who website.", "*Commentary track by Phil Collinson, Russell T Davies and Julie Gardner (MP3)"]}, {"page": "Torchwood", "response": ["The first three series of Torchwood were produced in-house by BBC Wales. The Head of Drama at the time of the first series, Julie Gardner, served as executive producer alongside Davies. The first two episodes of series 1 of Torchwood premiered on 22 October 2006 on BBC Three and BBC HD. Series 2 premiered on BBC Two and BBC HD on 16 January 2008. The third series, a five-part mini-series titled Torchwood: Children of Earth, aired on BBC One and BBC HD between 6 and 10 July 2009."]}, {"page": "Life on Mars (British TV series)", "response": ["Later, Channel 4 drama executive John Yorke substantially redeveloped the original script, focusing on a double act between Sam Tyler and Gene Hunt. Senior management eventually decided not to pursue the idea, with Graham stating that the reaction to the idea was: \"It's going to be silly\", as told to Radio Times. The series eventually attracted the attention of BBC Wales' Julie Gardner, who persuaded the Head of Drama for the BBC, Jane Tranter, to commission the programme from BBC Wales for BBC One. John Yorke left Channel 4 to rejoin the BBC and together with Julie Gardner, he acted as joint commissioning editor on the show for its entire run."]}]}}