{"wiki_id": "http://www.wikidata.org/entity/Q18009174", "itemLabel": "Jane Longstaff", "itemDescription": "British malacologist", "wikipedia_url": "https://en.wikipedia.org/wiki/Jane_Longstaff", "wikipedia_page": {"main": "Mary Jane Longstaff,  (née Donald; 27 August 1855 – 19 January 1935) was a British malacologist, specialising in fossil gastropods of the Palaeozoic.", "link_mentions": [{"page": "Longstaff", "response": ["*Jane Longstaff (1855–1935), British malacologist"]}, {"page": "List of paleontologists", "response": ["* Jane Longstaff (England, 1855-1935)"]}, {"page": "Mary Jane Longstaff", "response": ["#REDIRECT Jane Longstaff"]}, {"page": "Mary Jane Donald", "response": ["#REDIRECT Jane Longstaff"]}, {"page": "Jane Donald Longstaff", "response": ["#REDIRECT Jane Longstaff"]}, {"page": "Jane Donald", "response": ["#REDIRECT Jane Longstaff"]}, {"page": "Elizabeth Gray (fossil collector)", "response": ["Elizabeth Gray's work was drawn upon by many publications, such as Charles Lapworth's Girvan Succession of 1882. Lapworth noted her work's significance as \"the very first collection in which the exact localities and horizons of every individual fossil...[were] written down at the time of collection.\" Elizabeth was offered the chance to learn how to scientifically describe her own finds by Doctor Ramsay Traquair of the Royal Scottish Museum, but she wanted to concentrate on finding specimens for others to study as she felt that others had more experience. The palaeontologist Thomas Davidson benefited from Gray's lack of interest and he described collections of fossils that Gray sent to him between 1857 and 1885. In 1878–1880, R. Etheridge and H. Alleyne Nicholson published a Monograph of the Silurian Fossils of the Girvan District in Ayrshire using Gray's collection. When Nicholson's funding ran out so did his interest and Gray turned to F.R.Cowper Reed of Cambridge for assistance. He was thought of as a recluse but he was able to publish several papers based on Gray's fossils and it is thought that he never visited the site to see where they had been collected. William Kingdon Spencer worked on her fossils as did Jane Longstaff who sorted out the fossil gastropods. Gray was constantly organising and begging for assistance to ensure that her finds were described correctly and to this end she had a long and at times impatient correspondence with Francis Bather at the British Museum."]}, {"page": "Mary Longstaff", "response": ["#REDIRECT Jane Longstaff"]}, {"page": "George Blundell Longstaff", "response": ["George was the second son of George Dixon Longstaff, a physician in Wandsworth, and Maria Blundell. He was educated at Rugby and New College, Oxford and after obtaining a degree in 1871 in  natural science he studied medicine at St. Thomas's Hospital, obtaining a Mead Medal, and graduated B.M. in 1876 but he never practiced medicine. He worked for fourteen years as the representative for Wandsworth in the London County Council. An interest in entomology was sparked at an early age, influenced by his uncle William Spence. An injury to his eye while studying at Oxford however put an end to his entomological studies but he took a keen interest on a trip through India and Sri Lanka in 1903-4 accompanied by his second wife, the geologist Mary Jane Longstaff. He collected some 14000 specimens which were donated to the Hope collection at Oxford and he wrote a book Butterfly Hunting in Many Lands (1912). He also took an interest in demographic statistics and published Studies in statistics, social, political, and medical (1891)."]}, {"page": "Miss Jane Donald", "response": ["#REDIRECT Jane Longstaff"]}]}}