{"wiki_id": "http://www.wikidata.org/entity/Q18001128", "itemLabel": "Nikki Fox", "itemDescription": "English broadcaster, presenter and documentary maker", "wikipedia_url": "https://en.wikipedia.org/wiki/Nikki_Fox", "wikipedia_page": {"main": "Nikki Fox (born 3 March 1980) is an English broadcaster, presenter and documentary maker. She is a Sony Award-winning journalist who presents for television and network radio. Fox was born with muscular dystrophy. Fox appeared on various TV and Radio shows including Watchdog, The One Show, How to Look Good Naked, and Rip-Off Britain.\nFox was born with muscular dystrophy and has used a wheelchair for the majority of her adult life.", "link_mentions": [{"page": "BBC Radio Norfolk", "response": ["Local and regional awards have included a win in the Best Radio Programme category at the 2009 Creative East Awards for the show Treasure Quest. At the 2006 EDF Energy East of England Media Awards the station's Paul Moseley won the Radio Journalist of the Year award. He repeated this feat in 2007, becoming the first two-time winner of the award. In 2009 Nikki Fox won the title, and at the 2010 ceremony Nicky Price was joint-winner of the Sports Journalist of the Year category, while the Nick Conrad show took the Radio News/Current Affairs Programme of the Year title."]}, {"page": "Watchdog (TV programme)", "response": ["In the course of its history, Watchdog would spawn a number of spin-off shows, and be presented by a variety of hosts. It started as a feature on Nationwide in 1980 before it became a standalone series in 1985.  After 35 years, and with more than a thousand episodes aired, the BBC announced in February 2020 that Watchdog would cease to exist as a standalone series, becoming a segment on  The One Show. The segment would be presented by Matt Allwright and Nikki Fox.", "On 10 September 2015, after having spent a total of 15 years presenting the programme, Robinson left the programme to focus on her commitments to assisting with the production of BBC's Britain's Spending Secrets. Her departure led to Raworth replacing her as the new host, with Michelle Ackerley joining alongside her, Collins and Allright. On 22 June 2016, Hollins announced his decision to step down as co-host, whereupon after his departure, Allright was reassigned as one of the main presenters alongside Raworth, while Ackerly was demoted to being a co-presenter, with Nikki Fox and Steph McGovern being added to the lineup, with the show being moved to Dock10 studios, MediaCityUK. In 2017, Raworth and Ackerly left the programme, leading to McGovern joining Allright as a main presenter; the show was given a more permanent studio at dock10 studios for the 2017 series.", "On 21 February 2020, the BBC announced that Watchdog will cease to be broadcast as a standalone series, but will be aired instead as a feature in The One Show. The segment on The One Show will be presented by Matt Allwright and Nikki Fox.", "| 2016 || Sophie Raworth and Matt Allwright || Michelle Ackerley, Steph McGovern and Nikki Fox", "| 2017–19 || Matt Allwright and Steph McGovern || Nikki Fox"]}, {"page": "List of current BBC newsreaders and reporters", "response": ["*Nikki Fox – MediaCityUK"]}, {"page": "Celebrity Mastermind", "response": ["| Nikki Fox || Kate Bush || 4th"]}, {"page": "List of Would I Lie to You? episodes", "response": ["|Nikki Fox and Miles Jupp"]}, {"page": "Fox (surname)", "response": ["* Nikki Fox (born 1980), BBC disability news correspondent"]}, {"page": "2014 in British television", "response": ["|Award-winning journalist Nikki Fox is appointed as BBC News's first Disability Correspondent."]}, {"page": "2016 in British television", "response": ["|The BBC consumer affairs programme Watchdog confirms that journalists Steph McGovern and Nikki Fox will join its presenting team."]}]}}