{"wiki_id": "http://www.wikidata.org/entity/Q1801816", "itemLabel": "Lancelot Andrewes", "itemDescription": "English bishop and scholar", "wikipedia_url": "https://en.wikipedia.org/wiki/Lancelot_Andrewes", "wikipedia_page": {"main": "Lancelot Andrewes (1555 – 25 September 1626) was an English bishop and scholar, who held high positions in the Church of England during the reigns of Elizabeth I and James I. During the latter's reign, Andrewes served successively as Bishop of Chichester, of Ely, and of Winchester and oversaw the translation of the King James Version of the Bible (or Authorized Version). In the Church of England he is commemorated on 25 September with a lesser festival.", "link_mentions": [{"page": "Anglican Communion", "response": ["Protracted conflict through the 17th century, with radical Protestants on the one hand and Roman Catholics who recognised the primacy of the Pope on the other, resulted in an association of churches that was both deliberately vague about doctrinal principles, yet bold in developing parameters of acceptable deviation. These parameters were most clearly articulated in the various rubrics of the successive prayer books, as well as the Thirty-Nine Articles of Religion (1563). These articles have historically shaped and continue to direct the ethos of the communion, an ethos reinforced by its interpretation and expansion by such influential early theologians such as Richard Hooker, Lancelot Andrewes and John Cosin."]}, {"page": "Anglicanism", "response": ["The faith of Anglicans is founded in the Scriptures and the Gospels, the traditions of the Apostolic Church, the historical episcopate, the first four ecumenical councils, and the early Church Fathers (among these councils, especially the premier four ones, and among these Fathers, especially those active during the five initial centuries of Christianity, according to the quinquasaecularist principle proposed by the English bishop Lancelot Andrewes and the Lutheran dissident Georg Calixtus). Anglicans understand the Old and New Testaments as \"containing all things necessary for salvation\" and as being the rule and ultimate standard of faith. Reason and tradition are seen as valuable means to interpret scripture (a position first formulated in detail by Richard Hooker), but there is no full mutual agreement among Anglicans about exactly how scripture, reason, and tradition interact (or ought to interact) with each other. Anglicans understand the Apostles' Creed as the baptismal symbol and the Nicene Creed as the sufficient statement of the Christian faith.", "Amongst the early Anglican divines of the 16th and 17th centuries, the names of Thomas Cranmer, John Jewel, Matthew Parker, Richard Hooker, Lancelot Andrewes, and Jeremy Taylor predominate. The influential character of Hooker's Of the Laws of Ecclesiastical Polity cannot be overestimated. Published in 1593 and subsequently, Hooker's eight-volume work is primarily a treatise on church-state relations, but it deals comprehensively with issues of biblical interpretation, soteriology, ethics, and sanctification. Throughout the work, Hooker makes clear that theology involves prayer and is concerned with ultimate issues and that theology is relevant to the social mission of the church."]}, {"page": "Episcopal polity", "response": ["Anglican opinion has differed as to the way in which episcopal government is de jure divino (by the Divine Right of Kings). On the one hand, the seventeenth century divine, John Cosin, held that episcopal authority is jure divino, but that it stemmed from \"apostolic practice and the customs of the Church ... [not] absolute precept that either Christ or His Apostles gave about it\" (a view maintained also by Hooker).Cosin, Works, Vol. IV (Oxford, 1855), p. 402 In contrast, Lancelot Andrewes and others held that episcopal government is derived from Christ via the apostles. Regardless, both parties viewed the episcopacy as bearing the apostolic function of oversight which both includes, and derives from, the power of ordination, and is normative for the governance of the church. The practice of apostolic succession both ensures the legitimacy of the church's mission and establishes the unity, communion, and continuity of the local church with the universal church. This formulation, in turn, laid the groundwork for an independent view of the church as a \"sacred society\" distinct from civil society, which was so crucial for the development of local churches as non-established entities outside England, and gave direct rise to the Catholic Revival and disestablishmentarianism within England."]}, {"page": "King James Version", "response": ["* First Westminster Company, translated Genesis to 2 Kings: Lancelot Andrewes, John Overall, Hadrian à Saravia, Richard Clarke, John Layfield, Robert Tighe, Francis Burleigh, Geoffrey King, Richard Thomson, William Bedwell;"]}, {"page": "Macbeth", "response": ["The play utilizes a few key words that the audience at the time would recognize as allusions to the Plot. In one sermon in 1605, Lancelot Andrewes stated, regarding the failure of the Plotters on God's day, \"Be they fair or foul, glad or sad (as the poet calleth Him) the great Diespiter, 'the Father of days' hath made them both.\" Shakespeare begins the play by using the words \"fair\" and \"foul\" in the first speeches of the witches and Macbeth. In the words of Jonathan Gil Harris, the play expresses the \"horror unleashed by a supposedly loyal subject who seeks to kill a king and the treasonous role of equivocation. The play even echoes certain keywords from the scandal—the 'vault' beneath the House of Parliament in which Guy Fawkes stored thirty kegs of gunpowder and the 'blow' about which one of the conspirators had secretly warned a relative who planned to attend the House of Parliament on 5 November...Even though the Plot is never alluded to directly, its presence is everywhere in the play, like a pervasive odor.\""]}, {"page": "Pembroke College, Cambridge", "response": ["File:Lancelot Andrewes by Simon de Passe 1618.jpg|Lancelot Andrewes, English bishop and translator", "|Lancelot Andrewes"]}, {"page": "September 25", "response": ["*1626 – Lancelot Andrewes, English bishop and scholar (b. 1555)", "**Lancelot Andrewes (Church of England)"]}, {"page": "T. S. Eliot", "response": ["On 29 June 1927, Eliot converted from Unitarianism to Anglicanism, and in November that year he took British citizenship. He became a churchwarden of his parish church, St Stephen's, Gloucester Road, London, and a life member of the Society of King Charles the Martyr.Plaque on interior wall of Saint Stephen'sObituary notice in Church and King, Vol. XVII, No. 4, 28 February 1965,−− p. 3. He specifically identified as Anglo-Catholic, proclaiming himself \"classicist in literature, royalist in politics, and anglo-catholic  in religion\".Specific quote is \"The general point of view [of the essays] may be described as classicist in literature, royalist in politics, and anglo-catholic  in religion\", in preface by T. S. Eliot to For Lancelot Andrewes: Essays on style and order (1929).Books: Royalist, Classicist, Anglo-Catholic, 25 May 1936, Time. About 30 years later Eliot commented on his religious views that he combined \"a Catholic cast of mind, a Calvinist heritage, and a Puritanical temperament\". He also had wider spiritual interests, commenting that \"I see the path of progress for modern man in his occupation with his own self, with his inner being\" and citing  Goethe and Rudolf Steiner as exemplars of such a direction.Radio interview on 26 September 1959, Nordwestdeutscher Rundfunk, as cited in ", "* For Lancelot Andrewes (1928)"]}, {"page": "1626", "response": ["* September 25 – Lancelot Andrewes, English scholar (b. 1555)"]}, {"page": "1616", "response": ["* November 5 – Bishop Lancelot Andrewes preaches the annual Gunpowder Treason sermon before King James I of England at Whitehall (both were intended victims)."]}, {"page": "1555", "response": ["** Lancelot Andrewes, English clergyman and scholar (d. 1626)"]}, {"page": "Westminster Abbey", "response": ["It was at Westminster Abbey that six companies of eminent churchmen led by Lancelot Andrewes, Dean of Westminster, newly translated the Bible into English, so creating the King James Version in the early 17th century. The Joint Committee responsible for assembling the New English Bible also met twice a year at Westminster Abbey in the 1950s and 1960s."]}, {"page": "Henry Vaughan", "response": ["The first volume of Silex Scintillans was followed by The Mount of Olives, or Solitary Devotions (1652), a prose book of devotions providing prayers for various stages in the day, for prayer in church and for other purposes. It appears as a \"companion volume\" to the Book of Common Prayer, to which it alludes frequently, although it had been outlawed under the Commonwealth. The work was also influenced by Lancelot Andrewes's Preces Privatae (1615) and John Cosin's Collection of Private Devotions (1627).Oxford Companion to English Literature, s.v. Henry Vaughan Retrieved 24 November 2018. Flores Solitudinis (1654) contains translations from the Latin of two works by the Spanish Jesuit Juan Eusebio Nieremberg, one by a 5th-century Bishop of Lyon, Eucherius, and by Paulinus of Nola, of whom Vaughan wrote a prose life."]}, {"page": "Wisbech", "response": ["Isaac Casaubon recorded in his diary his visit to Wisbech on 17 August 1611. He accompanied Lancelot Andrewes, bishop of Ely, from the episcopal palace at Downham."]}, {"page": "Merchant Taylors' School, Northwood", "response": ["The school's old boys, called Old Merchant Taylors (OMTs), include naturalists, poets, actors, academics, politicians, authors, sportsmen, and military figures, including three winners of the Victoria Cross award. OMTs include, Lancelot Andrewes, the translator of the King James’ Bible; John Walter, founding editor of The Times; John Sulston, Nobel laureate in Physiology and Medicine; General Sir Richard Barrons, former Commander Joint forces command: E. H. Carr, the historian, Boris Karloff, the actor, Sir James Jeans the Astronomer Royal; Lord Coggan, Archbishop of Canterbury,  Major-General Lord Robert Clive, and more. There is also a strong OMT presence in both Houses of Parliament.", "| Lancelot Andrewes", "* Lancelot Andrewes, Bishop of Winchester and translator of the King James Bible"]}, {"page": "Barbican Estate", "response": ["* Andrewes House – named after Lancelot Andrewes a 16th-century English bishop and scholar"]}, {"page": "Isaac Casaubon", "response": ["Casaubon found great success in England. English Bishop John Overall received him and his whole family into the deanery of St Paul's, and entertained him there for a year.  Lancelot Andrewes, then Bishop of Ely, also became Casaubon's friend, taking him to Cambridge, where he met with a most gratifying reception from the notabilities of the university. They went on together to Little Downham,Pattison, Mark. \"Isaac Casaubon, 1559-1614\", p. 349. where Casaubon spent six weeks of the summer of 1611, in which year he became naturalized. He accompanied the bishop on visits to nearby towns including Doddington and Wisbech."]}, {"page": "16th century in literature", "response": ["*1555 – Lancelot Andrewes"]}, {"page": "17th century in literature", "response": ["* 1626 – Lancelot Andrewes; Samuel Purchas"]}, {"page": "1626 in literature", "response": ["*November – The deaths of Lancelot Andrewes and Nicholas Felton, Bishop of Ely, prompt John Milton, then a student at Cambridge, to write elegies in Latin for both.", "**Lancelot Andrewes, English scholar and bishop (born 1555)"]}, {"page": "1601 in literature", "response": ["*July – Lancelot Andrewes becomes Dean of Westminster."]}, {"page": "1598 in literature", "response": ["**Lancelot Andrewes turns down the bishoprics of Ely and Salisbury."]}, {"page": "1555 in literature", "response": ["**Lancelot Andrewes, English scholar and bishop (died 1626)"]}]}}