{"wiki_id": "http://www.wikidata.org/entity/Q18062090", "itemLabel": "Tom Barber", "itemDescription": "English cricketer (born 1995)", "wikipedia_url": "https://en.wikipedia.org/wiki/Tom_Barber_(cricketer)", "wikipedia_page": {"main": "Thomas Edward Barber (born 8 August 1995) is an English cricketer. Born in Poole, Dorset, Barber is a left-arm fast bowler who bats right-handed.\nBarber is a steadily progressing left-arm seamer who has been a fixture for the England U19s since the South Africa tour of 2012. He has played for the Hampshire academy in the Southern Premier League and was given opportunities for Hampshire second XI in 2013 and was awarded a scholarship contract for 2014.\nBarber made his Hampshire debut against a touring Sri Lanka A side on 14 August 2014. Barber finished with figures of 0/28 from 4 overs in the game which was later rain abandoned. Barber would go on to make his 'competitive' debut for Hampshire just a week later in a Royal London 50 over match against Yorkshire. Barber fought hard in a losing cause in this match finishing with his best figures so far in his short career of 2/22 from 4 overs, dismissing Yorkshire batsmen Kane Williamson (33) and Yorkshire captain Andrew Gale (0) in consecutive balls. Barber though was dismissed is the first innings while batting for 0 from only 2 balls by Adil Rashid as Hampshire were defeated by 6 wickets.\nBarber has also featured regularly for the England U19s featuring heavily in a tour series against South Africa U19s in 2012.\nOn 30 May 2017, Barber signed for Middlesex until the end of the season. He made his Twenty20 cricket debut for Middlesex in the 2017 NatWest t20 Blast on 3 August 2017. He made his first-class debut for Middlesex in the 2018 County Championship on 27 April 2018.He signed a one-year contract with Nottinghamshire on 17 January 2020.", "link_mentions": [{"page": "Dorset County Cricket Club", "response": ["* Tom Barber"]}, {"page": "Brad Wheal", "response": ["Wheal impressed Benkestein and was offered a development contract with Hampshire for the 2015 season due to a shortage of fast bowlers at the county, with only Chris Wood and Tom Barber as available backups to the first team side."]}, {"page": "Tom Barber", "response": ["Tom Barber may refer to:", "*Tom Barber (artist), cover artist for Weird Tales", "*Tom Barber (cricketer) (born 1995), English cricketer", "*Tom Barber (golfer) (1894–1936),English professional golfer", "*Tom Barber (Big Brother) (born 1996), English Big Brother contestant", "*Tom Barber (architect/designer) (1946-2018), Australian Architect/Designer/Mathematician/Activist"]}]}}