{"wiki_id": "http://www.wikidata.org/entity/Q18022548", "itemLabel": "Corrie Dick", "itemDescription": "Scottish jazz drummer and composer", "wikipedia_url": "https://en.wikipedia.org/wiki/Corrie_Dick", "wikipedia_page": {"main": "Corrie Dick is a Scottish jazz musician (drums, percussion, vocals) and composer based in London. He is recognised for his fluency, gritty sound and euphoric abandon on the drum kit and for his poignant and earthy compositional style.He comes from a small family with musical and artistic parents. His sole brother Garry Dick, two and a half years his minor, is an accomplished chef in the West of Scotland.", "link_mentions": [{"page": "1990 in jazz", "response": ["* 20 – Corrie Dick, Scottish drummer, percussionist, vocalist, and composer."]}, {"page": "List of years in jazz", "response": ["* 1990 in jazz, deaths of Al Sears, Art Blakey, Arthur Österwall, Asser Fagerström, Bernard Addison, Betty Glamann, Bill Hardman, Buschi Niebergall, Chester Zardis, Chris McGregor, Clyde McCoy, Dave Wilkins, Dexter Gordon, Dudu Pukwana, Eje Thelin, Elizete Cardoso, Emily Remler, Francis Coppieters, Frank Wright, Freddie Kohlman, Fritz Schulz-Reichel, George Desmond Hodnett, Georgie Auld, Harry Leahey, Harry South, Howard Roberts, Hubert Rostaing, Jack Noren, Joe Turner, John Madrid, June Christy, King Perry, Lee Castle, Lou Blackburn, Louis Nelson, Lowell Davidson, Major Holley, Mel Lewis, Pearl Bailey, Peter van Steeden, Phil Napoleon, Russell Jacquet, Sam Taylor, Sammy Davis Jr., Sarah Vaughan, Sing Miller, Walter Davis Jr., William Leavitt, and Xavier Cugat; births Alper Tuzcu, Austin Peralta, Benjamin Kheng, Charlotte Dos Santos, Corrie Dick, Diknu Schneeberger, Jonathan Barber, Jonathan Chua, Kimbra Lee Johnson, Laura Jurd, Marthe Wang, Martin Masakowski, Mette Henriette, Ole Mofjell, Rita Ora, Sandra Riley Tang, Sebastian Nordström, and Torgeir Standal."]}, {"page": "Corrie (given name)", "response": ["*Corrie Dick (born 1990), British musician "]}, {"page": "Dinosaur (band)", "response": ["Dinosaur are a British jazz quartet founded in 2010.  The band comprises Laura Jurd on trumpet and synthesizers, Elliot Galvin on keyboards and synthesizers, Corrie Dick on drums, and Conor Chaplin on bass."]}, {"page": "Together, As One", "response": ["*Corrie Dick – drums"]}, {"page": "Elliot Galvin", "response": ["Some performances have featured Corrie Dick on drums."]}, {"page": "Lauren Kinsella", "response": ["* 2014Under the Moon (Edition), with Laura Jurd, Alex Roth, and Corrie Dick"]}, {"page": "Rob Luft", "response": ["| 2017 || Riser || Edition Records || with Joe Wright (sax), Joe Webb (keyboards), Tom McCredie (bass), Corrie Dick (drums)", "| 2020 || Life Is The Dancer || Edition Records || with Joe Wright (sax), Byron Wallen (trumpet), Luna Cohen (backing vocals), Joe Webb (keyboards), Tom McCredie (bass), Corrie Dick (drums)"]}, {"page": "Letters I Haven't Written", "response": ["* Corrie Dick – percussion, drums, backing vocals"]}]}}