{"wiki_id": "http://www.wikidata.org/entity/Q1803383", "itemLabel": "Ivan Sharpe", "itemDescription": "English footballer (1889-1968)", "wikipedia_url": "https://en.wikipedia.org/wiki/Ivan_Sharpe", "wikipedia_page": {"main": "Ivan Gordon Sharpe (15 June 1889 – 9 February 1968) was an English amateur footballer. Although an amateur himself, he played for several professional clubs, including Watford, Derby County— with whom he won the Football League First Division in 1911–12–and later Leeds United. He represented the England national amateur football team, and also the Great Britain Olympic football team, with whom he won an Olympic gold medal at the 1912 games in Sweden. He is also one of very few players to have played for both Leeds City (65 appearances and 17 goals) and Leeds United (1 appearance 0 goals).After retirement he enjoyed a long career as a sports journalist, becoming president of the Football Writers Association. He served as editor of the Athletic News Football Annual and also of the Athletic News Cricket Annual. In 1936 he was selected by the BBC to be one of two journalists (the other being Norman Creek) who for the first time provided live commentary on the FA Cup Final. He continued to contribute a hard-hitting article to the Wolverhampton Wanderers match day programme for many years right up to his death. He produced a volume of memoirs \"40 Years in Football\" in 1954, as well as writing \"Soccer Top Ten\" in 1962, detailing his ten favorite players.", "link_mentions": [{"page": "Leeds City F.C.", "response": ["In the wake of its demise, Leeds United was formed, and entered the Football League the following year. None of the players auctioned ever played for the new Leeds United, but winger Ivan Sharpe, who had scored 17 goals in 65 appearances for City between 1913 and 1915, spent 2½ years at United between 1920 and 1923 only making one appearance and right-half Harry Sherwin, who left City just five months before its dissolution, went on to score twice in 107 games for United between 1921 and 1925."]}, {"page": "Football at the 1912 Summer Olympics", "response": ["|FW || || Ivan Sharpe", "|style=\"width:12em\" valign=top|   Arthur BerryRonald BrebnerThomas BurnJoseph DinesEdward HanneyGordon HoareArthur KnightHenry LittlewortDouglas McWhirterIvan SharpeHarold StamperHarold WaldenVivian WoodwardGordon Wright"]}, {"page": "Football at the Summer Olympics", "response": ["In the London Games of 1908 a proper international tournament was organised by the Football Association, featuring just six teams. The number of teams rose to eleven in 1912, when the competition was organised by the Swedish Football Association. Many of these early matches were unbalanced, as evidenced by high scoring games; two players, Sophus Nielsen in 1908 and Gottfried Fuchs in 1912, each scored ten goals in a single match. All players were amateurs, in accordance with the Olympic spirit, which meant that some countries could not send their full international team. The National Olympic Committee for Great Britain and Ireland asked the Football Association to send an English national amateur team. Some of the English members played with professional clubs, most notably Derby County's Ivan Sharpe, Bradford City F.C. Harold Walden and Chelsea's Vivian Woodward. England won the first two official tournaments convincingly, beating Denmark both times."]}, {"page": "Alan Morton", "response": ["It was in the 1928 full international in London where Morton, as part of an under-rated Scottish side that beat England 5‑1 in driving rain to record a famous triumph, earned the moniker: \"Wembley Wizard\". Three of Morton's crosses were converted by Huddersfield Town's Alex Jackson. Ivan Sharpe, the ex‑player and writer, commented on the victory: \"England were not merely beaten. They were bewildered – run to a standstill, made to appear utterly inferior by a team whose play was as cultured and beautiful as I ever expect to see.\""]}, {"page": "Anthony Holden", "response": ["He is a dedicated Arsenal fan and has a season ticket to the Emirates.\"Melvyn Bragg on becoming a fan - Arsenal, 1989\", The Guardian (17 May 2009) Holden's maternal grandfather was Ivan Sharpe, the England international footballer and Olympic gold medallist who later became a celebrated sports writer.The Peerage: Anthony Holden"]}, {"page": "List of Olympic medalists in football", "response": ["|valign=top| Arthur BerryRonald BrebnerThomas BurnJoseph DinesEdward HanneyGordon HoareArthur KnightHenry LittlewortIvan SharpeHarold WaldenVivian Woodward   Douglas McWhirterThe database of the International Olympic Committee lists only the eleven players as medalists for each nation, who played in the first match for their nation. This list contains these eleven players, as well as all other players who made at least one appearance for their team during the tournament.Harold StamperGordon Wright"]}, {"page": "Wembley Wizards", "response": ["Ivan Sharpe, the ex-player and writer, commented on the victory for the Athletic News: \"England were not merely beaten. They were bewildered – run to a standstill, made to appear utterly inferior by a team whose play was as cultured and beautiful as I ever expect to see.\" More than 30 years later he was still writing the same thing, adding that he had never seen a performance to match it in all the time that he had been watching football."]}, {"page": "1936 FA Cup Final", "response": ["It was the first year that commentators were used in the broadcast of an FA Cup final, with the BBC describing it as an \"experiment\". The first commentators were Ivan Sharpe and Norman Creek, who broadcast from 2:30 pm onwards before the game to take in the pre–match entertainment."]}, {"page": "Football at the 1912 Summer Olympics – Men's team squads", "response": ["| - || FW ||align=\"left\"| Ivan Sharpe || 1889-06-15 || 23 || 2+0 ||align=\"left\"|  Derby County || 3 || 0"]}, {"page": "Football at the 1912 Summer Olympics – Matches", "response": ["| FW || || Ivan Sharpe", "| FW || || Ivan Sharpe", "|FW || || Ivan Sharpe"]}, {"page": "Nationwide Football Annual", "response": ["Two long-serving previous editors were 'Tityrus' (otherwise J A H Catton, editor of the Athletic News 1900–1924)Brake L & Demoor M, Dictionary of nineteenth-century journalism in Great Britain and Ireland, 2009.  Retrieved 19 October 2011 and Ivan Sharpe (c. 1928–1956). Other editors or joint-editors appearing on the front covers or title pages include ", "| Ivan Sharpe", "| Ivan Sharpe", "| Ivan Sharpe", "| Ivan Sharpe", "| Ivan Sharpe", "| Ivan Sharpe", "| Ivan Sharpe", "| Ivan Sharpe", "| Ivan Sharpe", "| Ivan Sharpe", "| Ivan Sharpe & David Jack"]}, {"page": "Athletic News Cricket Annual", "response": ["After World War II it reappeared as the Athletic News Cricket and Golf Annual (1946), then subsequently – from its 50th yearCopac library catalogues – as the Sunday Chronicle Cricket and Golf Annual (1947-1954),Taken from front covers of original annuals before one last year as the Sunday Chronicle Cricket Annual (1955). Like its companion volume the Athletic News Football Annual it was for many years edited by ‘Tityrus’ (J A H Catton)Brake L & Demoor M, Dictionary of nineteenth-century journalism in Great Britain and Ireland, 2009.  Retrieved 19 October 2011 and afterwards by Ivan Sharpe.", "| Ivan Sharpe", "| Ivan Sharpe", "| Ivan Sharpe", "| Ivan Sharpe", "| Ivan Sharpe", "| Ivan Sharpe", "| Ivan Sharpe", "| Ivan Sharpe", "| Ivan Sharpe", "| Ivan Sharpe", "| Ivan Sharpe", "| Ivan Sharpe", "| Ivan Sharpe", "| Ivan Sharpe", "| Ivan Sharpe"]}, {"page": "1913 FA Charity Shield", "response": ["Hampton completed his hat-trick after five minutes of the second half, but then the Amateurs took control. Sam Hardy kept out shots from Dick Healey, Ivan Sharpe and Herbert Farnfield before being beaten twice in five minutes. After a \"great shot\" from Preston North End winger George Barlow, the Amateurs' second was touched in by Farnfield after a move involving four players brought the ball all the way down the field. It was, according to the pseudonymous 'Reflector', writing in the Mirror, \"easily the best of the match.\" Confusion between goalkeeper Ronald Brebner and full-back Thomas Burn presented Hampton with his fourth, and Holley completed the scoring late on.", "|Forward|| Ivan Sharpe||Leeds City"]}, {"page": "List of 1912 Summer Olympics medal winners", "response": ["|style=\"width:12em\" valign=top|   Arthur BerryRonald BrebnerThomas BurnJoseph DinesEdward HanneyGordon HoareArthur KnightHenry LittlewortDouglas McWhirterIvan SharpeHarold StamperHarold WaldenVivian WoodwardGordon Wrightthumb|right|200px|The Great Britain squad"]}, {"page": "1936 FA Charity Shield", "response": ["The second half of the match was broadcast with live commentary by Ivan Sharpe on the BBC's Northern radio station."]}]}}