{"wiki_id": "http://www.wikidata.org/entity/Q18128622", "itemLabel": "Craig Tanner", "itemDescription": "Footballer (born 1994)", "wikipedia_url": "https://en.wikipedia.org/wiki/Craig_Tanner_(footballer)", "wikipedia_page": {"main": "Craig David Tanner (born 27 October 1994) is an English professional footballer who plays as a striker or winger who plays for Ebbsfleet United. Tanner began his career with Reading and spent time on loan at AFC Wimbledon and Plymouth Argyle (twice) before joining Motherwell in June 2017.", "link_mentions": [{"page": "Gaël Bigirimana", "response": ["Bigirimana signed a two-year contract with Scottish Premiership club Motherwell on 2 June 2017. He made his debut on 15 July in a Scottish League Cup group match away to Queen's Park, starting and assisting a goal by Craig Tanner. On 9 August in the second round of the competition, he scored his first goal for the Well in a 3–2 extra-time win at Ross County."]}, {"page": "List of Motherwell F.C. players", "response": ["|Craig Tanner||27||||2017–||2||0||"]}, {"page": "Reading F.C. Under-23s and Academy", "response": ["* Craig Tanner", "| Craig Tanner"]}, {"page": "2013–14 Reading F.C. season", "response": ["Having been unable to agree a new contract over the course of the season, Alex Pearce eventually agreed a new two-year deal in June. Hal Robson-Kanu also agreed a new three-year contract, ending speculation linking him with a move to the Premier League. Goalkeepers Stuart Taylor and Jonathan Henly signed a new one and two-year contracts respectively, while four other out-of-contract players, including Lawson D'Ath also committed their futures to the club. Seven Academy graduates signed professional contracts and were given squad numbers for the first time, including Jake Cooper who was given a three-year deal. They were joined in the senior squad by Craig Tanner and Aaron Tshibola who signed professionally as youngsters in 2011.", "The under-21 squad, playing as a \"Reading XI\", started their pre-season on the same day as the senior team and won 1–0 away to Basingstoke Town through a Shepherd Murombedzi goal. Three days later they comfortably beat Dartford 4–0 thanks to goals from Gozie Ugwu, Aaron Tshibola and a double from Craig Tanner. Another goal from Ugwu, one from Tarique Fosu-Henry and an own goal helped the youngsters earn a 3–3 draw against newly promoted League Two side Newport County. They played further games away to Boreham Wood, which they drew 1–1 courtesy of a De'Juane Taylor-Crossdale penalty, and Fulham, which finished 3–3, before a 3–2 win over Bristol City with Jake Taylor among the scorers.", "The under-21s began their season with a 4–2 over Newcastle United at the Madejski Stadium, Gozie Ugwu scoring twice. Despite a successful start, the team won just one of their next seven games, a 3–2 victory against Southampton with Ugwu again scoring twice, and lost the other six, including a 4–0 defeat to Wolverhampton Wanderers. Due to new rules which came into effect for the 2013–14 season, Reading could only play three games at their training ground and therefore chose to play a number of their games at Basingstoke Town's Camrose ground. In November they beat Queens Park Rangers in the first round of the inaugural U21 Premier League Cup, though, after one further league game, a 1–1 draw with Norwich City, they ended 2013 second from bottom of the table. Reading began 2014 in better form, picking up four wins from seven in the league and beating Watford, Wolves and Arsenal in the U21 Cup to advance to the final. The side faced Manchester City in the two-legged final and, despite leading 2–0 after 31 minutes through Uwgu and Craig Tanner, lost the first leg at the City of Manchester Stadium 3–2. The return leg at the Madejski saw over 3,000 watch as the under-21s won the game 2–0, giving them a 4–3 aggregate victory to win the inaugural competition. Despite the cup run, the under-21s finished the season in poor form in the league, winning two and losing four of the seven games following the semi final win at Arsenal. The run saw the team finish 17 out of 22 teams and consigned them to Division Two of the Under-21 Premier League for 2014–15. Craig Tanner finished as the team's top scorer with 13 goals while Ugwu was in second place with 12.", "| Craig Tanner"]}, {"page": "2014–15 Reading F.C. season", "response": ["Reading started their season on 9 August with a 2–2 away draw at Wigan Athletic, with Shaun Cummings and Sean Morrison getting Reading's goals after Callum McManaman opened the scoring for Wigan and James McArthur scored a 93rd-minute equaliser. Three days later, on 12 August, Reading faced Newport County in the League Cup at home. Reading ran out 3–1 winners, with their goals coming from Pavel Pogrebnyak, Nick Blackman and debutante Craig Tanner. Reading won their next game, on 16 August, against Ipswich Town thanks to a Jake Taylor goal, before losing their next two games, 2–1 at home to Huddersfield Town and 4–0 away to Nottingham Forest. Reading finished August with back to back wins, 1–0 away to Scunthorpe United in the Second round of the League Cup, Jake Taylor scoring, and 1–0 away to Middlesbrough with Simon Cox scoring.", "On 10 January Reading drew 0–0 at home to Middlesbrough, in a game that saw Jem Karacan make his return from a long term knee-injury, coming on as an 86th-minute substitute for Jamie Mackie. Defender Shaun Cummings left the club on 12 January, moving to Millwall two days later for an undisclosed fee. Reading lost their next game, a 2–1 away defeat to Fulham on 17 January, with Pavel Pogrebnyak scoring Reading's only goal. The following week Polish International goalkeeper, Jakub Słowik, joined the club on a week-long trial. On 22 January, Reading signed Jure Travner on a contract with the club till the end of the season, and Nathaniel Chalobah on loan till the end of the season from Chelsea, whilst youngster Craig Tanner signed a new contract till the summer of 2017 and joined AFC Wimbledon on a season-long youth loan. The next day Royston Drenthe left club, signing for Kayseri Erciyesspor of the Turkish Süper Lig on a permanent basis.", "| Craig Tanner", "| Craig Tanner", "||FW||||27||Craig Tanner||0||0||1||1"]}, {"page": "2014–15 AFC Wimbledon season", "response": ["| align=\"center\" | Craig Tanner"]}, {"page": "2015–16 Reading F.C. season", "response": ["Defender Andrew Taylor joined Reading on a season-long loan from Wigan Athletic on 5 August, with Craig Tanner moving to Plymouth Argyle on loan to Plymouth Argyle on the same day until January 2016. Young keeper joined Chesham United on a Four-Month loan deal two days later, before midfielder Jake Taylor left on a season-long loan to Motherwell, and Hope Akpan joined Blackburn Rovers on a permanent deal on 11 August. The following day Reading announced the signing of Paolo Hurtado on a three-year contract from Paços de Ferreira. On 18 August, midfielder Álex Fernández joined the club on a season-long loan deal from RCD Espanyol.", "On 5 January, Dominic Samuel extended his loan stay at Gillingham until 28 January. The next day, 6 January, Nick Blackman moved to Derby County for an undisclosed fee, and Craig Tanner extended his loan deal at Plymouth Argyle until the end of the season.", "| 5 August 2015 || FW ||  || Craig Tanner || Plymouth Argyle || end of season || ", "| Craig Tanner"]}, {"page": "2015–16 Plymouth Argyle F.C. season", "response": ["|27||Craig Tanner||SS||||Reading||||38||6||Reading||5 August 2015||Loan||7 May 2016", "| 27|| || SS|| Craig Tanner || 25 || 24 || 6 || 6 || 0", "| 5 August 2015 || SS ||  || Craig Tanner || Reading || 7 May 2016 || "]}, {"page": "Craig Tanner", "response": ["Craig Tanner may refer to:", "* Craig Tanner (producer) (born 1974), American film director, film producer and editor", "* Craig Tanner (footballer) (born 1994), English footballer"]}, {"page": "2016–17 Colchester United F.C. season", "response": ["Referee Kevin Johnson was forced to leave the field on a stretcher during Colchester's tie with Plymouth Argyle following a collision with Jimmy Spencer on 29 October. Craig Tanner had opened the scoring for the home side on 16 minutes, but a Craig Slater free kick levelled the score after 31-minutes. Following a ten-minute delay for Kevin Johnson's injury, Ryan Donaldson capitalised on a defensive mix-up to put his side 2–1 up. Plymouth held on for 16-minutes of injury time to condemn Colchester to a ninth consecutive game without victory."]}, {"page": "2016–17 Reading F.C. season", "response": ["Reading loaned Craig Tanner to Plymouth Argyle, and signed Liechtenstein international midfielder Sandro Wieser to a three-year contract the next day.", "The club also announced on 12 May that Harrison Bennett, Aaron Kuhl, Stuart Moore, Joe Tupper, Terence Vancooten, Sean Long, Craig Tanner, Jack Denton, Dominic Hyam and Harry Cardwell would be leaving the club on the expiration of their contract.", "|18 August 2016||FW||||Craig Tanner||Plymouth Argyle||16 January 2017||", "|16 January 2017||FW||||Craig Tanner||Plymouth Argyle||End of season||", "| Craig Tanner", "| Craig Tanner"]}]}}