{"wiki_id": "http://www.wikidata.org/entity/Q18164593", "itemLabel": "Brian Unwin", "itemDescription": "British civil servant and historian", "wikipedia_url": "https://en.wikipedia.org/wiki/Brian_Unwin", "wikipedia_page": {"main": "Sir James Brian Unwin  (born 21 September 1935) is a former British civil servant and an author.  He was chairman of the board of HM Customs and Excise and president of the European Investment Bank. He is also an author of historical non-fiction.", "link_mentions": [{"page": "European Investment Bank", "response": ["* Sir Brian Unwin (UK): April 1993 – December 1999"]}, {"page": "Brookfield Community School, Chesterfield", "response": ["* Sir Brian Unwin, President from 1993-99 of the European Investment Bank, and from 2001-13 of the European Centre for Nature Conservation, and Chairman from 1987-93 of HM Customs and Excise"]}, {"page": "ICMA Centre", "response": ["Established in 1991 with funding provided by the International Capital Market Association (ICMA) in Zurich through a partnership with the University of Reading, the centre is housed in a purpose-built modernist building, and was formally opened in March 1998 by Sir Brian Unwin, then President of the European Investment Bank."]}, {"page": "1990 Birthday Honours", "response": ["* James Brian Unwin, CB, Chairman, Board of HM Customs and Excise."]}, {"page": "Bob Scott (businessman)", "response": ["Scott was born in Minehead, Somerset, the eldest son of diplomat Sir David Aubrey Scott  and Vera Kathleen Ibbitson. He has a younger brother, Andrew, and a sister, Diana, married Sir Brian Unwin. Timothy Frank Siward Scott   was his uncle. He attended Haileybury and Imperial Service College and Merton College, Oxford where he studied dramatic arts."]}, {"page": "David Aubrey Scott", "response": ["*Diana Susan Scott, Lady Unwin (born 1942), married Sir Brian Unwin"]}, {"page": "1986 Birthday Honours", "response": ["*James Brian Unwin, Deputy Secretary, Cabinet Office."]}, {"page": "The Federal Trust", "response": ["*Sir Brian Unwin President, European Centre for Nature Conservation/Honorary President, European Investment Bank"]}, {"page": "Unwin, Brian", "response": ["#redirectBrian Unwin"]}, {"page": "James Brian Unwin", "response": ["#REDIRECT Brian Unwin"]}]}}