{"wiki_id": "http://www.wikidata.org/entity/Q18169281", "itemLabel": "James Murrell", "itemDescription": "British cunning man; professional folk magician (c. 1785 - 1860)", "wikipedia_url": "https://en.wikipedia.org/wiki/James_Murrell", "wikipedia_page": {"main": "James Murrell (c. 1785 – 16 December 1860), also known as Cunning Murrell, was an English cunning man, or professional folk magician, who spent most of his life in the town of Hadleigh in the eastern English county of Essex. In this capacity, he reportedly employed magical means to aid in healing both humans and animals, exorcising malevolent spirits, countering witches, and restoring lost or stolen property to its owner.\nBorn in Rochford, Essex, Murrell grew up in the area before moving to Southwark in London, where he was married in 1812. He had seventeen children with his wife, and the family later moved back to Essex, settling in Hadleigh, where Murrell gained work as a shoemaker. At some point he also began working as a cunning man, gaining fame for his work in this field on both sides of the Thames Estuary. Describing himself as \"the Devil's Master\", he cultivated an air of mystery about himself, also experimenting with the creation of iron witch bottles. On a number of occasions his magical activities gained the attention of the local press. Although many residents valued his services and viewed him as a good and benevolent individual, his activities proved controversial and divisive. Many educated figures criticised what they saw as his role in encouraging superstition among the local population; his death certificate recorded his profession as that of a \"quack doctor\".\nMurrell's fame greatly increased after his death when he was made the subject, albeit in a highly fictionalised form, of a 1900 novel by Arthur Morrison. Morrison also produced a more objective study of the cunning man, published in The Strand magazine. During the 1950s, the folklorist Eric Maple conducted further research on Murrell, finding much local folklore still surrounding him in the Hadleigh area, including the allegation that he had the ability to fly and to instantaneously transport himself vast distances. Murrell has continued to attract the attention of historians and folklorists studying English folk magic, and is referenced in works by scholars like Ronald Hutton, Owen Davies, and Ralph Merrifield.", "link_mentions": [{"page": "Cunning folk in Britain", "response": ["There were also claims that certain cunning folk occasionally performed bewitching or cursing for a fee, which under some definitions would make them witches as well as cunning people.Davies 2003. pp. 111–112. The folklorist Eric Maple, after examining several 19th-century cunning folk in Essex, noted that one of them, George Pickingill, also performed cursing for clients, but that the other whom he examined, James Murrell, considered it immoral and so did not.Maple 1960. p. 247. Indeed, other Essex cunning folk were associated with witchcraft, notably in the village of Sible Hedingham, where there lived an elderly French cunning man who had previously had his tongue cut out, and was consequently dumb, as well as being deaf. As a result he was known as \"Dummy\" in the local community, who generally disliked him, largely because of his 'otherness' in being both foreign and disabled, and rumours spread that he was a witch who would curse them. In 1863 a drunken mob attacked him, throwing him in a river to see if he would sink or float (a traditional method of identifying a witch, who it was believed would float, whereas an innocent would sink), but the resulting shock killed the elderly man, who was in his eighties.Hutton 1999. pp. 87–88. Another notable case of a cunning person performing cursing and malevolent witchcraft comes from nineteenth-century Norwich, where a wise woman who went by the pseudonym of \"Virtue\" used to demand gifts from her neighbours, threatening them with cursing if they refused.Hutton 1999. p. 97.", "There are also examples of academic studies into specific British cunning folk. In 1960, the folklorist Eric Maple published articles on two nineteenth-century cunning men in East Anglia, James Murrell and George Pickingill. In 2004, Jason Semmens published a study of a nineteenth-century Cornish cunning-woman as The Witch of the West: Or, The Strange and Wonderful History of Thomasine Blight.Semmens 2004."]}, {"page": "Seventh son of a seventh son", "response": ["* James Murrell was the seventh son of a seventh son, according to investigations by Arthur Morrison."]}, {"page": "Hadleigh, Essex", "response": ["In the 19th century, Hadleigh was the home of the cunning man James Murrell. He died in the town in December 1860."]}, {"page": "George Pickingill", "response": ["Pickingill was brought to wider public attention in the early 1960s by the folklorist Eric Maple. As part of his research into beliefs regarding folk magic and witchcraft in nineteenth-century Essex, Maple had interviewed a number of Canewdon residents and collected their stories about Pickingill and his reputation as a cunning man. According to their accounts, Pickingill attracted visitors from around Essex seeking his magical help, for which he did not charge. They attributed to him the power to control animals, to command imps to do his bidding, and to wield power over either six or nine malevolent witches who lived in Canewdon. It was also claimed that he was able to coerce assistance and beer from local residents by threatening to place a curse upon them or their belongings. Although it has been suggested that local people were inventing claims to please Maple, many of which were based on older tales regarding the Essex cunning man James Murrell, subsequent research by historian Ronald Hutton has confirmed aspects of the folklorist's original accounts.", "Maple noted that, unusually—given his role as a cunning man—Pickingill did not charge for his services, but did receive some money from visitors, and that his recorded roles included restoring lost property and curing minor ailments, both of which were common practices amongst British cunning folk. According to one account, he cured a woman of rheumatism by transferring the ailment to her father. Maple wrote that Pickingill was known to use cursing and malevolent magic on occasion, something that the folklorist contrasted with the activities of other contemporary cunning folk that he had studied, such as James Murrell. At harvest time, Maple recorded, Pickingill was known to wander around the field threatening to bewitch farm machinery, with many farmers thus offering him beer so that he would leave them alone. He was also recorded as coercing local people to obtain water for him from the village pump by threatening to set upon them white mice, a rodent which in local folklore was associated with misfortune. Another tale that Maple recorded also associated Pickingill with white mice; according to this, a visitor travelled to the cunning man's cottage only to find him lying in bed, with the mice suckling from his nipples.", "However, claims have since been made that Pickingill was not a cunning man or involved in folk magic at all. Local Canewdon historian Sylvia Webster expressed her view to Howard that tales regarding Pickingill's magical practices had been invented by the locals of Canewdon to impress Maple. Supporting this position, she highlighted that there was no evidence to suggest that Pickingill was a cunning man prior to Maple's publications. Similarly, Richard Ward argued that the contemporary obituaries and interviews conducted with Pickingill had shown no evidence of any magical activities, when such might have been expected. Ward suggested that many of the stories regarding Pickingill's magical activities were adapted from those of a genuine Essex cunning man, James Murrell. Hutton responded critically to Ward's claims, highlighting his own investigations into the local folklore and his interview with Taylor to express the view that there \"seems little doubt\" that Pickingill was a cunning man, although \"there are still questions over what sort of one he was\". At the same time, Hutton also accepted the possibility that some of the legends associated with Murrell had come to be associated with Pickingill, although stated that this seemed to be \"incapable of solid proof\". In his counter-response to Hutton, Ward accepting that Pickingill could have been associated with \"some apparent supernatural control or knowledge of horses\" as Taylor had claimed, but that this did not automatically make him a cunning man, for which there remained no contemporary historical evidence."]}]}}