{"wiki_id": "http://www.wikidata.org/entity/Q1811424", "itemLabel": "Cyril Mackworth-Praed", "itemDescription": "sport shooter", "wikipedia_url": "https://en.wikipedia.org/wiki/Cyril_Mackworth-Praed", "wikipedia_page": {"main": "Cyril Winthrop Mackworth-Praed (21 September 1891 – 30 June 1974) was a British sport shooter who competed in the 1924 Summer Olympics.In 1924 he won the gold medal as member of the British team in the team running deer, double shots event. He also won two silver medals in the running deer, single shots and double shots competition.\nIn the 1924 Summer Olympics he also participated in the following events:\nTeam 100 metre running deer, single shots - fourth place\nTeam clay pigeons - eighth place\nindividual trap - result unknownHe also competed at the 1952 Summer Olympics.\nHe was also a well-known ornithologist and entomologist, specialized in the birds of Africa and author of the 7-volume Handbook of the Birds of Africa.", "link_mentions": [{"page": "List of ornithologists", "response": ["*Cyril Mackworth-Praed – England"]}, {"page": "African silverbill", "response": ["The African silverbill was formally described in 1789 by the German naturalist Johann Friedrich Gmelin under the binomial name Loxia cantans. The specific epithet is from Latin and means \"singing\". Gmemlin specified the locality as Africa but this was restricted to Dakar in Senegal by William Lutley Sclater and Cyril Mackworth-Praed in 1918. It is now placed in the genus Euodice that was introduced in 1862 by the German naturalist Ludwig Reichenbach."]}, {"page": "Great Britain at the 1952 Summer Olympics", "response": ["* Cyril Mackworth-Praed"]}, {"page": "List of Olympic medalists in shooting", "response": ["|style=\"width:12em\"| Cyril Mackworth-PraedPhilip NeameHerbert PerryAllen Whitty"]}, {"page": "Great Britain at the 1924 Summer Olympics", "response": ["|rowspan=3| Cyril Mackworth-Praed", "| John Faunthorpe  Cyril Mackworth-Praed  John O'Leary  Alexander Rogers", "| Cyril Mackworth-Praed  Philip Neame  Herbert Perry  Allen Whitty", "| William Grosvenor  Enoch Jenkins  Hans Larsen  Cyril Mackworth-Praed  George Neal  John O'Leary"]}, {"page": "Common waxbill", "response": ["The common waxbill was formally described by the Swedish naturalist Carl Linnaeus in 1758 in the tenth edition of his Systema Naturae under the binomial name Loxia astrild. The etymology of astrild is uncertain. It may either be from a German or Dutch avicultural term for a waxbill or alternatively it may be a misprint for Estrilda. Linnaeus based his description on the \"Wax Bill\" that had been described and illustrated in 1751 by the English naturalist George Edwards in his A Natural History of Uncommon Birds. Linnaeus specified the locality as \"Canaries, America, Africa\" but this was restricted to Cape Town in South Africa by William Lutley Sclater and Cyril Mackworth-Praed in 1918. This species is now placed in the genus Estrilda that was introduced in 1827 by the English naturalist William John Swainson."]}, {"page": "Shooting at the 1924 Summer Olympics", "response": ["|Cyril Mackworth-PraedPhilip NeameHerbert PerryAllen Whitty"]}, {"page": "Shooting at the 1924 Summer Olympics – Men's 100 meter team running deer, single shots", "response": ["|align=left| Cyril Mackworth-Praed || 6 || - || 3 || 1 || - || - || 41 || 3"]}, {"page": "Shooting at the 1924 Summer Olympics – Men's 100 meter team running deer, double shots", "response": ["The new Olympic champion in the individual competition Ole Lilloe-Olsen finished second with as part of the Norwegian team. British shooter Cyril Mackworth-Praed won this, his first gold medal, in a team event, having already won silver medals in two individual events.", "Cyril Mackworth-Praed was able to score 76 rings as Ole Lilloe-Olsen did in the individual competition.", "|align=left| Cyril Mackworth-Praed || 5 || 6 || 9 || - || - || - || 76 || 1"]}, {"page": "Shooting at the 1924 Summer Olympics – Men's trap", "response": ["|align=left| Cyril Mackworth-Praed ||align=left|  || unknown"]}, {"page": "Shooting at the 1924 Summer Olympics – Men's team trap", "response": ["|align=left| Cyril Mackworth-Praed || 80 || 43"]}, {"page": "Cyril Winthrop Mackworth Praed", "response": ["#REDIRECT Cyril Mackworth-Praed"]}, {"page": "Cyril Winthrop Mackworth-Praed", "response": ["#REDIRECT Cyril Mackworth-Praed"]}, {"page": "List of British sport shooters", "response": ["* Cyril Mackworth-Praed"]}, {"page": "Praed", "response": ["*Cyril Mackworth-Praed (1891–1974), British Olympic athlete"]}, {"page": "C. W. Mackworth-Praed", "response": ["#REDIRECTCyril Mackworth-Praed"]}]}}