{"wiki_id": "http://www.wikidata.org/entity/Q18162005", "itemLabel": "Rhodes", "itemDescription": "British singer-songwriter", "wikipedia_url": "https://en.wikipedia.org/wiki/Rhodes_(singer)", "wikipedia_page": {"main": "David Rhodes, stagename Rhodes (stylised RHODES) (born 1988), is an English singer and songwriter from Baldock, Hertfordshire, England. He released his debut EP Raise Your Love on Hometown Records in October 2013 and released his second EP Morning on Rhodes Music on 12 May 2014. His debut album Wishes was released on 18 September 2015.\n\n", "link_mentions": [{"page": "Rhodes (disambiguation)", "response": ["Rhodes is the Greek Dodecanese island where the Colossus of Rhodes stood.", "Rhodes may also refer to:", "* Rhodes (regional unit), Greece", "** Rhodes (city), the main settlement on the island of Rhodes, Dodecanese, Greece", "* Rhodes, Moselle, a commune of the Moselle department, France", "* Rhodes, Greater Manchester, a village in England", "* Appenzell Ausserrhoden, a canton in Switzerland also known as Appenzell Outer Rhodes", "* Appenzell Innerrhoden, a canton in Switzerland also known as Appenzell Inner Rhodes", "* Rhodes, Indiana, an unincorporated community", "* Rhodes, Iowa, a city", "* Rhodes Hill, a summit of Savage Mountain, Maryland", "* Rhodes, Michigan, an unincorporated community", "* Rhodes, Montana, a census-designated place", "* Rhodes, Eastern Cape, a small tourist town in South Africa", "* Rhodes, New South Wales, Australia", "* Rhodes (surname)", "* Rhodes (singer), stagename of David Rhodes, a British musician, singer and songwriter", "* Cecil John Rhodes 19th century South African politician", "*Cecil Rhodes (disambiguation) Disambiguation of \"Cecil Rhodes\".", "* Mr. Rhodes, an American television sitcom", "* Rhodes (TV series), a 1996 British television series about the life of Cecil Rhodes", "* Rhodes Singers, concert choir of Rhodes College in Memphis, Tennessee", "*Rhodes of Africa, a 1936 film about the life of Cecil John Rhodes.", "*Rhodes, a fictional town in the video game Red Dead Redemption 2 ", "* Rhodes Brothers, a department store in Tacoma, WA", "* Rhodes piano, an electric piano invented by Harold Rhodes", "* Rhodes College, a college in Memphis, Tennessee", "* Rhodes Preparatory School, formerly in Manhattan, New York City", "* Rhodes Scholarship, an international postgraduate award for students to study at the University of Oxford", "* Rhodes State College, a college in Lima, Ohio named after James A. Rhodes", "* Rhodes University, a college in Grahamstown, South Africa", "* Rhodes (grape), a synonym for the Athiri grape used to make Retsina on the Island of Rhodes", "* Metropolis of Rhode, the Greek Orthodox metropolitan see covering the island of Rhodes", "* Rhodes Framework, a framework for developing smartphone applications", "* Rhodes Trail Run, a 52 km trail run that takes place in the southern Drakensberg of South Africa", "* Rhodes grass (Chloris gayana), a species of grass native to Africa but found throughout the tropical and subtropical world", "* USS Rhodes (DE-384) (1943–1963), a U.S. Navy destroyer escort", "* Justice Rhodes (disambiguation)"]}, {"page": "Glastonbury Festival line-ups", "response": ["* Rhodes"]}, {"page": "Rhodes Singers", "response": ["rightThe Rhodes Singers are a noted undergraduate choir from Rhodes College in Memphis, TN, specializing in smaller, unaccompanied chamber music works.  They are directed by Dr. William Skoog.", "The Rhodes Singers were established in 1937 as the concert choir for the College by music professor and composer Burnet C. Tuthill, who joined the college faculty in 1935. Tuthill, son of the architect of New York’s Carnegie Hall, was a clarinetist who also founded the group that was to become the Memphis Symphony Orchestra. Professor Tuthill established the tradition of the annual choir tour throughout the United States; in 1976, his successor, Professor Tony Lee Garner ’65, led the inaugural international concert tour, bringing sacred music and southern spirituals to Romania in conjunction with Friendship Ambassadors.  Professor Garner also created the MasterSingers Chorale in the early 1990s, bringing together alumni and community singers.", "Dr. Tim Sharp followed Garner as conductor of Rhodes Singers and the MasterSingers Chorale in 2000. In 2001 Rhodes Singers toured in Italy and Switzerland and were the featured choir at the International Church Music Festival in Bern, Switzerland, directed by Sir David Willcocks. In 2002 the Rhodes Singers were featured with composer Morten Lauridsen in the performance of his \"Les Chansons des Roses\" with the composer in residence. In 2004 the Rhodes Singers, along with the Rhodes Mastersingers Chorale performed a program of Morten Lauridsen's works at Carnegie Hall in New York City.  The concert featured Lauridsen's \"Mid-Winter Songs,\" \"Madrigali: Six \"Firesongs\" on Italian Renaissance Poems,\" \"O Magnum Mysterium,\" \"Les Chanson des Roses,\" and \"Lux Aeterna,\" with Lauridsen accompanying the Singers on the \"Dirait-on\" movement of \"Les Chanson des Roses.\" In the Spring of 2006 the Rhodes Singers took their music overseas once again, touring England and performing in such venues as Canterbury Cathedral, Arundel Cathedral, Winchester Cathedral, Christ Church Cathedral, Oxford, St Catharine's College, Cambridge, and St. Paul's Cathedral in London.  In the Fall of 2006 the Rhodes Singers returned to Carnegie Hall to perform the Carnegie Hall premiere of Morten Lauridsen's \"Nocturnes\" and \"Lux Aeterna,\" again with the composer accompanying them at the piano for the \"Nocturnes.\"  The Rhodes Singers have several recordings to their credit, most recently recording \"Christmas at St. Mary's Vol. V.\" In 2008, Sharp became Executive Director of the American Choral Directors Association, and was followed a year later by Dr. William Skoog.", "Today, the Rhodes Singers perform many concerts annually, tour throughout the United States, and every three years tour internationally.", "Rhodes Singers have established a tradition of choral excellence throughout the region. This choir of sixty singers focus on smaller choral works often from the unaccompanied choral tradition. Membership in Rhodes Singers is based upon an audition. One hour college credit is available each semester for performing in Rhodes Singers.", "*The Rhodes Singers", "*Rhodes College", "Category:Rhodes College"]}, {"page": "Joel Pott", "response": ["| Rhodes"]}, {"page": "Kygo", "response": ["In the beginning of March 2016, Kygo announced that his debut studio album was going to be released on 13 May 2016, under the title Cloud Nine. He also announced that he would be releasing three promotional singles, leading up to the release of the album. The first of these singles, which was released 18 March 2016, was entitled \"Fragile\", which features vocals and was collaborated with Labrinth. The second single came out on 1 April 2016 and was called \"Raging\", which features vocals from the Irish band Kodaline and was also co-written by James Bay. The third and last single was released on 22 April 2016 and was entitled \"I'm In Love\", featuring vocals from James Vincent McMorrow. Kygo's debut studio album was released on 13 May 2016. Other collaborations were revealed to include Parson James, Tom Odell, Kodaline, Conrad Sewell, John Legend, James Vincent McMorrow, Foxes, Rhodes, Matt Corby, Maty Noyes, Julia Michaels and Angus & Julia Stone."]}, {"page": "Charlie Fink", "response": ["Fink produced Laura Marling's first album Alas I Cannot Swim, which was nominated for the Mercury Music Prize. He has also produced music for Charlotte Gainsbourg, Jay Jay Pistolet and Rae Morris. Since 2014 he has co-written and produced music with artists such as Foxes, Rhodes and Eliot Sumner."]}, {"page": "David Rhodes", "response": ["David Rhodes may refer to:", "* David Rhodes (author) (born 1946), American novelist", "* David Rhodes (cricketer) (1847–1937), English-born New Zealand cricketer", "* David Rhodes (footballer) (1948–2013), former Australian rules footballer", "* David Rhodes (kayaker) (born 1975), Australian sprint canoeist", "* David Rhodes (media executive) (born 1973), president of CBS News", "* David Rhodes (guitarist) (born 1956), English guitarist, songwriter, composer and former member of Random Hold", "* Rhodes (singer) (born 1988), stagename of David Rhodes, a British musician, singer and songwriter", "* Dave Rhodes, infamous Usenet spammer"]}, {"page": "Birdy (singer)", "response": ["In August 2015, Birdy co-wrote \"Let It All Go\" with Rhodes. The single was released on 11 September 2015 via digital download in the UK. In October 2015, Birdy performed a cover of Firestone, originally by Kygo ft. Conrad Sewell on BBC Radio 1's Live Lounge. This track featured on the BBC Radio 1's Live Lounge 2015 album."]}, {"page": "Love Me like You Do", "response": ["In March 2015, Circa Waves performed a rock cover at BBC Radio 1's Live Lounge. That same month, James Arthur covered the song for MTV. In May 2015, Ella Henderson delivered an acoustic cover at Spin 1038 Live Room. In September 2015, Rhodes covered the song at BBC Radio 1's Live Lounge."]}, {"page": "Phil Taggart", "response": ["Taggart owns an independent record label called Hometown Records. The labels first release was Raise Your Love, an EP by Rhodes on 28 October 2013. They have gone on to sign and release music from Rat Boy, Rejjie Snow, Inheaven, TOUTS, Wildes, Yonaka, Grace Acladna, Speelburg, Love Ssega."]}, {"page": "Alle Farben", "response": ["! scope=\"row\"| \"H.O.L.Y.\" (with Rhodes)", "* 2015: Mantra feat. Lydia Rhodes - Away (Alle Farben Remix) (Ultra Records, LLC)"]}, {"page": "List of 2015 albums", "response": ["| Koko ga Rhodes da, Koko de Tobe!", "| Rhodes"]}, {"page": "RHODES (musician)", "response": ["#REDIRECT Rhodes (singer)"]}, {"page": "Cloud Nine (Kygo album)", "response": ["Cloud Nine is the debut studio album by Norwegian DJ and record producer Kygo and features the likes of Maty Noyes, Conrad Sewell, Parson James, Tom Odell, Foxes, Matt Corby, Rhodes, Will Heard, Julia Michaels, James Vincent McMorrow, Kodaline, Labrinth, John Legend and Angus & Julia Stone. It was released on 13 May 2016 by Sony Music and Ultra Music."]}, {"page": "Let It All Go (Rhodes and Birdy song)", "response": ["\"Let It All Go\" is a song by British musician, singer and songwriter Rhodes and English musician Birdy. It was released as a digital download on 11 September 2015 in the United Kingdom, as the second single from Rhodes' debut studio album, Wishes (2015).Let It All Go (Radio Edit) - Single by RHODES & Birdy on iTunes The song was written and produced by Rhodes and Birdy.", "The music video for the song was published on the official Birdy YouTube channel on 11 August 2015. It was filmed in Edinburgh, and features Birdy and Rhodes singing in a purple valley. It has currently amounted over 86 million views."]}, {"page": "Kygo discography", "response": ["! scope=\"row\"| \"Not Alone\"(featuring Rhodes)"]}, {"page": "Your Soul (Holding On)", "response": ["#REDIRECT Rhodes (singer)"]}, {"page": "Your Soul", "response": ["#REDIRECT Rhodes (singer)"]}, {"page": "Rhodes (musician)", "response": ["#REDIRECT Rhodes (singer)"]}, {"page": "RHODES (singer)", "response": ["#REDIRECT Rhodes (singer)"]}, {"page": "Dark Matter (CamelPhat album)", "response": ["The sixth single \"For a Feeling\" a collaboration with Artbat and featuring vocals from Rhodes, was released on 24 April 2020. In addition, Ministry of Sound premiered the track on YouTube a week before its initial release. Even though released in 2020, the song was continuously getting praised and held in the highest regards in 2019 when it was featured as an unknown track within the sets of acts, such as Tale of Us."]}]}}