{"wiki_id": "http://www.wikidata.org/entity/Q18160045", "itemLabel": "Edward Ashworth", "itemDescription": "British artist, architect and surveyor (1814-1896)", "wikipedia_url": "https://en.wikipedia.org/wiki/Edward_Ashworth", "wikipedia_page": {"main": "Edward Ashworth (1814 – 1896) was an English artist and architect from Devon, England, considered to be the West Country's leading ecclesiastical architect.  He was elected a member of the Exeter Diocesan Architectural Society in 1847.\n\n", "link_mentions": [{"page": "Dulverton", "response": ["The parish Church of All Saints in Bank Square has a tower from the 15th century, which was extensively restored between 1853 and 1855 when the rest of church was rebuilt by Edward Ashworth. It has been designated as Grade II* listed building."]}, {"page": "Christow", "response": ["Inside the church are monuments including two to Admiral Edward Pellew, 1st Viscount Exmouth and his son the 2nd Viscount, both of whom died in 1833. The church was restored in 1862 to designs by the architect Edward Ashworth. It is a Grade I listed building."]}, {"page": "Doddiscombsleigh", "response": ["The church was extensively restored and rebuilt by the architect Edward Ashworth in the late 1870s."]}, {"page": "St Michael and All Angels Church, Bude", "response": ["It was originally built in 1834 by George Wightwick for Sir Thomas Dyke Acland, 10th Baronet as a Chapel of Ease to Stratton Parish Church.  The church was expanded in 1878 by Edward Ashworth for Sir Thomas Dyke Acland, 11th Baronet. It became a listed building on 9 September 1985."]}, {"page": "St Peter's Church, Tiverton", "response": ["The church dates from 1073. Several restorations have been undertaken, in 1825–1829 by G.A. Boyce, and in 1853–1856 by Edward Ashworth of Exeter."]}, {"page": "Church of St John the Baptist, Heathfield", "response": ["The current tower remains from the 13th century building however the rest of the church, including the chancel was largely rebuilt as part of Victorian restoration in the 1841 by Edward Ashworth, with the vestry being added in 1869 and 1860. At this time box pews and the font were removed and replaced."]}, {"page": "Church of All Saints, Dulverton", "response": ["The tower of All Saints Church in Bank Square survives from the 15th century building, however the rest of the church was extensively restored between 1853 and 1855 when it was largely rebuilt by Edward Ashworth."]}, {"page": "Church of St Mary, Bideford", "response": ["The present church was built of stone rubble with limestone details by Edward Ashworth in 1862–5 to replace a Norman church of 1260 which in turn was built on the site of a Saxon church of cob and wattle which was standing at the time of the Norman Conquest. Various fittings and monuments were retained from the old church. The solidly built tower is from 1260 and is all that survives of the original building; it is finished with a battlemented parapet and holds a peal of eight bells, five of which were cast in 1722 and three in 1876. To the right of the tower is the town's War Memorial showing the names of those who died in the two World Wars.'A Guide to St Mary's: the Parish Church of Bideford' pg 5"]}, {"page": "Church of St Mary Steps, Exeter", "response": ["In the late 19th century the church was restored by the architect Edward Ashworth."]}]}}