{"wiki_id": "http://www.wikidata.org/entity/Q18169303", "itemLabel": "Steven Conway", "itemDescription": "English boxer", "wikipedia_url": "https://en.wikipedia.org/wiki/Steven_Conway_(boxer)", "wikipedia_page": {"main": "\"Super\" Steven Conway (born 6 October 1977 in Hartlepool) is an English professional Super feather/Light/Light welter/Welter/Light middleweight boxer of the 1990s and 2000s who as a professional won the International Boxing Organization (IBO) World light middleweight title against Mihaly Kotai, and lost it to Attila Kovács, and was a challenger for the World Boxing Organization (WBO) Inter-Continental super-featherweight title against Gary Thornhill, and the British Boxing Board of Control (BBBofC) British super featherweight title against Alex Arthur.", "link_mentions": [{"page": "Alex Arthur", "response": ["After winning 11 fights in a row and picking up a couple of fringe titles on the way, Arthur managed to get a crack at the vacant British Super Featherweight title when he challenged Dewsbury's Steven Conway at the Braehead Arena in Glasgow on 19 October 2002.  The win established Arthur as a force on the domestic scene and he followed up the victory with two defences against Carl Greaves and fellow Scot Willie Limond.  One more victory would have given him the Lonsdale belt for keeps and that was when the undefeated prospect with a record of 16–0 ran into Longford's Michael Gomez.", "|align=left| Steven Conway"]}, {"page": "Anthony Small", "response": ["|style=\"text-align:left;\"| Steven Conway"]}, {"page": "Prizefighter series", "response": ["Prizefighter 3 took place on 24 October 2008 back at the York Hall and featured a different weight class to the previous two events with welterweights competing for the main prize. Fighters taking part in the competition were former European champion Ted Bami; English champions Nigel Wright and Ross Minter; Former ABA champion Michael Lomax; Commonwealth challenger Craig Dickson; Midlands Area champion Mark Lloyd; Former IBO light middleweight champion Steven Conway, and Andrew Ferrans."]}, {"page": "Steve Conway", "response": ["* Steven Conway (boxer) (born 1977), English boxer of the 1990s and 2000s"]}, {"page": "Keith Tate", "response": ["Keith Tate established the Cleckheaton Boxing Academy in 1975, and has produced 30 national champions as professional boxers, including the British Super featherweight champion boxer Gary 'Five Star' Sykes, and 3 world champions; James 'Roberttown Rocket' Hare, Mark 'Hobbo' Hobson, and 'Super' Steven Conway."]}]}}