{"wiki_id": "http://www.wikidata.org/entity/Q18163801", "itemLabel": "Tom Gutteridge", "itemDescription": "British television director, producer and executive", "wikipedia_url": "https://en.wikipedia.org/wiki/Tom_Gutteridge", "wikipedia_page": {"main": "Thomas Michael Gillan Gutteridge (born 2 February 1952) is a British television director, producer and executive.  He was formerly Chief Executive of FremantleMedia NA, having previously been founder and Chief Executive of Mentorn, from 1985 to 2001.  In 2016 he was appointed Executive Producer of the television series BattleBots, which, after two seasons on ABC, in 2018 moved to the Discovery and Science Channels.  He started his career as a BBC journalist.", "link_mentions": [{"page": "Song and Dance", "response": ["The musical had its world premiere on March 26, 1982 at the Palace Theatre, where it ran for 781 performances, with direction by Tom Gutteridge Marti Webb performed the Song half; she subsequently was succeeded by Gemma Craven, Lulu, and Liz Robertson. Carol Nielsson, Webb's original understudy took over the role with two hour notice when Lulu damaged her voice after a foldback monitor failed during a performance. The Dance portion was choreographed by Anthony Van Laast and featured Wayne Sleep and Jane Darling."]}, {"page": "Robot Wars (TV series)", "response": ["Between 1995 and 1997, three further Robot Wars events took place in America and in 1995, Profile Records partnered with production company Mentorn to produce and televise a Robot Wars event in the UK. Mentorn acquired the worldwide television rights from Profile in 1995 after Tom Gutteridge (the head of Mentorn) had seen an amateur tape of a San Francisco event.", "Profile sought no input or consent from Thorpe before doing this and this aggravated the already troubled relationship between Thorpe and Profile Records and indirectly spurred legal disagreements surrounding the ownership of the Robot Wars concept. The legal proceedings surrounding these would last until 6 February 2002. Mentorn used Thorpe as a Consultant on the series, however and the initial series of Robot Wars in the UK was broadcast over six weeks in February and March 1998. It was an immediate hit, with more than two million viewers and a further 18 episodes were commissioned by the BBC that year. 155 episodes were produced in total and the show was seen in 26 countries. Two series were produced in the US for The National Network (now Paramount Network) and a version was also shown on Nickelodeon. TechTV (and later G4techTV/G4) in the US aired the UK series proper. Series were also produced in many European countries. Although the series had various directors and producers, all were produced in the UK by Mentorn and executive produced by Tom Gutteridge and Steve Carsey. The initial series were staged in various film studios around London but the stage and pit area became too large to fit into any of the conventional studios, so filming was later moved to an aircraft hangar at RAF Newton."]}, {"page": "Space Precinct", "response": ["The series was created by Gerry Anderson and was a mix of science fiction and police procedural that combined elements of many of Anderson's previous series such as Space: 1999, UFO and Thunderbirds, but with an added dash of Law & Order and Dragnet. Anderson was executive producer with Tom Gutteridge. One of the series' directors was John Glen, who had previously directed five James Bond films."]}, {"page": "A Kick Up the Eighties", "response": ["The show was created by Tom Gutteridge (producer/director) and Sean Hardie (executive producer). Colin Gilbert was script editor. Series One, comprising six shows, was broadcast on BBC2 from 21 September 1981 to 26 October 1981. Series Two, comprising four shows, was broadcast on BBC2 between 3 January 1984 and 24 January 1984. A contemporary sketch show with a nod to the then emerging wave of alternative comedy, a strong team combined to perform short sketches and various musical parodies."]}, {"page": "Blue Suede Shoes: A Rockabilly Session", "response": ["Blue Suede Shoes: A Rockabilly Session was a televised concert that was taped live at Limehouse Studios in London, England on 21 October 1985. The show featured rock n' roll pioneer Carl Perkins along with friends as guest stars, including Eric Clapton, former Beatles George Harrison and Ringo Starr, as well as Dave Edmunds who acted as musical director for the show. Most of the repertoire performed in the concert consisted of Perkins' classic rockabilly songs from the 1950s. It was directed by Tom Gutteridge. The concert special was originally broadcast in 1985 on Channel 4 in the UK and on Cinemax in 1986 with introductory comments by Johnny Cash, Roy Orbison, and Jerry Lee Lewis. The show was shown on Channel 4 on 1 January 1986. Perkins performed 16 songs, with two encores, in an extraordinary performance. Perkins and his friends ended the session by singing his most famous song, 30 years after its writing, which brought Perkins to tears. The concert is a memorable highlight of Carl Perkins' later career and has been highly praised by fans for the spirited performances delivered by Perkins and his famous guests. It was the first public performance by George Harrison in more than ten yearsInglis, Ian, The Beatles in Hamburg, page 171, Reaktion Books 15 June 2012 An edited version of the program is available for viewing on YouTube."]}, {"page": "Anneka Rice", "response": ["Rice married theatre boss Nick Allott in 1988, with whom she has two sons, Thomas Alexander D, born in 1989 and Joshua James, born in 1990. She had another son with TV executive Tom Gutteridge in 1997."]}, {"page": "York Student Television", "response": ["YSTV first broadcast on 21 November 1967 from the university's chemistry department, before moving to a permanent home in the physics department.This was actually the studio of the University's Audio-visual Department and YSTV generally borrowed it for an hour or so across lunchtimes. In 1977 the usual grant from the Students' Union of £300/year was increased to £3000 and this allowed the conversion of a Preparation Room behind the main Physics Department Lecture Hall into a small but exclusive studio for YSTV. At around the same time the society bought its first Sony Rover, which consisted of a black and white camera, smaller than the studio cameras, linked by cable to a reel-to-reel recording machine using half-inch video tape. This allowed much greater flexibility in producing programmes than before when students had been restricted to the studio. Here it remained for over two decades, until in June 1993 the University asked YSTV to vacate. Following a campaign supported by students, York University Students' Union, Greg Dyke and Tom Gutteridge, YSTV were offered a new studio on campus in Goodricke College (later becoming James College) which was officially opened by Greg Dyke on 29 October 1994."]}, {"page": "Gutteridge", "response": ["* Tom Gutteridge (born 1952), British television producer"]}, {"page": "British Academy Television Award for Best Entertainment Programme", "response": ["| The Hot Shoe Show || Tom Gutteridge", "| Robot Wars || Tom Gutteridge, Stephen Carsey, Bill Hobbins"]}, {"page": "01-for London", "response": ["01-for London was a Thames Television programme broadcast on  ITV in South-East England between 1987 and 1992.  It was a weekly arts listings programme developed in conjunction with Time Out magazine.  The programme was produced by Tom Gutteridge and Mentorn Films.  Its presenters includes Richard Jobson, Neil Mullarkey, Mark Webster and Kathy Lette.", "01-for London was first broadcast in South-East England in 1987.  It was a weekly arts listings show produced by Tom Gutteridge and Mentorn Films for Thames Television, the regional ITV franchise holder.  It was developed in conjunction with Time Out, the weekly \"whats-on\" magazine for London.  The programme co-sponsored a series of annual London arts awards with the magazine."]}]}}