{"wiki_id": "http://www.wikidata.org/entity/Q18166342", "itemLabel": "Henry Scott", "itemDescription": "Australian politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Henry_Scott_(Mayor_of_Adelaide)", "wikipedia_page": {"main": "Henry Scott (1836 – 16 December 1913) was a South Australian businessman, politician and mayor of Adelaide", "link_mentions": [{"page": "Crafers, South Australia", "response": ["The Church of the Epiphany, Epiphany Place, Crafers has played a prominent role in the life of the district since it was built in 1878 on land donated by Henry Scott. It has a splendid music tradition, a lively choir and one of the finest pipe-organs in South Australia.  The Church of the Epiphany is a favourite church for many couples for their marriage service."]}, {"page": "Henry Scott", "response": ["Henry Scott may refer to:", "* Henry Scott, 1st Earl of Deloraine (1676–1730), Scottish peer and army officer", "* Henry Scott, 3rd Duke of Buccleuch (1746–1812), Scottish peer", "* Henry Scott (Mayor of Adelaide) (1836–1913), mayor from 1877 to 1878 and Legislative Council member from 1874 to 1891", "* Henry Scott (English cricketer) (1851–1941), cricketer in the 1880s"]}, {"page": "List of historic houses in South Australia", "response": ["|100px || Benacre || 1875 ||  || 6 || Benacre Place || Glen Osmond ||  || Private home || T. B. StrangwaysHenry ScottThomas Graves1906 John Lewis1924 Lance LewisListed on the Register of the National Estate.Benacre, Australian Heritage Database, www.environment.gov.au"]}, {"page": "Royal Geographical Society of Australasia", "response": ["* Henry Scott"]}, {"page": "Benacre, Glen Osmond", "response": ["In 1861, Henry Scott (Mayor of Adelaide) married Emily Gooch but the couple remained childless.Carol Fort (2008) Keeping a trust: South Australia's Wyatt Benevolent Institution and its founder, Pg 115  In the mid-1870s they purchased the property and named it \"Benacre\" after Emily's ancestral home, Benacre Hall,Benacre Hall , The Benacre Estate, www.benacre.co.uk in Benacre, Suffolk. They lived at Benacre in Glen Osmond and Boode House Mount Lofty, and were generous and entertaining hosts; during the Scott’s tenure of some 30 years, they hosted countless social events."]}, {"page": "Henry Scott (mayor)", "response": ["#REDIRECT Henry Scott (Mayor of Adelaide)"]}, {"page": "Ebenezer Cooke (politician)", "response": ["* ( – 6 July 1924) was educated at Mr. Martin's school at Port Adelaide, Thomas Caterer's Norwood Grammar School and St. Peter's College was accountant for Henry Scott, followed his father as accountant and acting manager of the English and Australian Copper Company, then for the Chaffey Brothers. He briefly worked in Western Australia, Queensland and New South Wales before settling down in Camberwell, Victoria, working for H. C. Stezl, shipping agents of Melbourne. He married Ada Grace Rosetta Collins of Bendigo on 8 March 1893 and had two daughters. He was a keen mathematician and the author of The A.B.C. Perpetual Calendar (1920).Obituary South Australian Register 12 July 1924 p.14 accessed 12 November 2011"]}, {"page": "Abraham Scott", "response": ["Abraham, a brother of Henry Scott (1836–1913), was a son of Thomas Scott, of Boode House, near Braunton, in Devonshire, a member of an old Scottish family, and was educated in Bristol. He emigrated to South Australia and set up in business as a wool merchant.  Around 1854 his brother Henry arrived and began working in his office, and took over the business around 1866."]}, {"page": "William Scott (politician)", "response": ["Scott died at his home \"Brookside\", Magill and was buried in the West Terrace Cemetery. He was not related to other South Australian MLC's Abraham Scott and Henry Scott. The \"Brookside\" home was still in the hands of J. Scott, but the vineyard was owned by J. Taylor Holmes."]}, {"page": "Members of the South Australian Legislative Council, 1877–1881", "response": ["|| Henry Scott || 1878–1891 ||  || elected Sep. 1878"]}, {"page": "Members of the South Australian Legislative Council, 1881–1885", "response": ["|| Henry Scott || 1878–1891 ||  || "]}, {"page": "Members of the South Australian Legislative Council, 1885–1888", "response": ["|| Henry Scott || Central ||  || 1878–1891 || re-elected 1885"]}, {"page": "Members of the South Australian Legislative Council, 1888–1891", "response": ["|| Henry Scott || Central ||  || 1878–1891 || "]}, {"page": "List of South Australian Legislative Council by-elections", "response": ["|Henry ScottAllan CampbellJohn HodgkissCharles Burney Young"]}, {"page": "Julia Farr Centre", "response": ["*Henry Scott 1913) to 1907"]}, {"page": "St John's Church, Adelaide", "response": ["*Henry Scott"]}, {"page": "Central District (South Australian Legislative Council)", "response": ["|rowspan=3| Henry Scott"]}, {"page": "Lady Kintore Cottages", "response": ["Those present included Her Excellency the Countess of Kintore (wife of the Governor of South Australia), Lady Colton, Miss Baker, Rev. W. R. Fletcher, Canon Sunter, Rabbi Boas, (Methodist) Rev. J. B. Stephenson, J. H. Finlayson, J. Marshall, J. L. Bonython, J. J. Green, Henry Scott, and L. P. Lawrence. A committee was formed consisting of Lady Downer, Lady Colton, Mrs. Birks, Miss Baker, Mrs. D. W. Duffield, Chief Justice Way, Henry Scott, D. Murray. F. W. Bullock, G. C. Knight, J. Marshall, J. J. Green, and J. Moss Solomon (secretary)."]}]}}