{"wiki_id": "http://www.wikidata.org/entity/Q18171697", "itemLabel": "Dean Smith", "itemDescription": "English football forward (1958-2009)", "wikipedia_url": "https://en.wikipedia.org/wiki/Dean_Smith_(footballer,_born_1958)", "wikipedia_page": {"main": "Dean Smith (28 November 1958 – 17 April 2009) was an English professional footballer who played as a forward in the Football League for Leicester City and Brentford.", "link_mentions": [{"page": "Shepshed Dynamo F.C.", "response": ["* Dean Smith"]}, {"page": "Dean Smith (footballer, born 1971)", "response": ["Dean Smith (born 19 March 1971) is an English professional football manager and former player who is the head coach of  club Norwich City.", "Smith is married, and has two children - a son and daughter. Speaking in December 2019, he said that his family, coupled with his experiencing playing and managing in the lower leagues, have helped him to stay grounded and deal with the perceived pressure of managing a Premier League team. He is a keen chess player and was a West Midlands school chess champion as a child. His father, Ron, was an Aston Villa supporter, and a steward at Villa Park. Towards the end of his life, Ron Smith suffered from dementia and was not aware that his son had become Aston Villa manager. On the eve of the 2019 play-off final, Dean Smith visited his father and told him \"The next time I see you, I'll be a Premier League manager.\" Ron Smith died on 27 May 2020 after contracting COVID-19."]}, {"page": "Dean Smith (disambiguation)", "response": ["Dean Smith (1931–2015) was an American college basketball coach.", "Dean Smith may also refer to:", "*Dean Smith (Australian politician) (born 1969), Australian senator", "*Dean Smith (Canadian politician) (born 1928), former political figure in British Columbia, Canada", "*Dean Smith (sprinter) (born 1932), American Olympic track and field athlete and stuntman", "*Dean Smith (footballer, born 1971), English football player and manager of Norwich City", "*Dean Smith (footballer, born 1958) (1958–2009), English football player for Leicester City and Brentford", "*Dean Smith (racing driver) (born 1988), British racing driver", "*Dean Smith (pilot) (1899–1987), American airmail pilot", "*Dean Smith (engineer), Walter Byers Award winner", "*Dean Smith (actor) (born 1990), starred in Waterloo Road"]}, {"page": "Dean Smith (footballer born 1958)", "response": ["#REDIRECT Dean Smith (footballer, born 1958)"]}, {"page": "1978–79 Brentford F.C. season", "response": ["Fears that Brentford's largely-unchanged squad would be out of its depth in the Third Division were heightened after the season began with a 7–1 aggregate defeat to fellow third-tier side Watford in the first round of the League Cup. A dire start to the league season, which had seen Brentford sink into the relegation places by the end of September 1978, led manager Bill Dodgin Jr. to act in the transfer market. Potentially club-record breaking bids for Watford's Alan Mayes, Queens Park Rangers' Tony Hazell and Bristol City's John Bain were all rejected, but Dodgin did manage to sign defender Jim McNichol and forward Dean Smith, with McNichol's transfer from Luton Town setting a new club-record incoming fee of £30,000. While McNichol would instantly impress and go on to be voted the Supporters' Player of the Year, Smith (who had been signed to support the misfiring Steve Phillips and Andrew McCulloch) would only score sporadically during the rest of the season.", "|Dean Smith", "| style=\"text-align:left;\" |Dean Smith", "| style=\"text-align:left;\" |Dean Smith", "| Dean Smith"]}, {"page": "1979–80 Brentford F.C. season", "response": ["|Dean Smith", "| style=\"text-align:left;\" |Dean Smith", "| style=\"text-align:left;\" |Dean Smith"]}, {"page": "1980–81 Brentford F.C. season", "response": ["Brentford had a mixed start to the season, exiting the League Cup at the first hurdle, but three wins and two draws from six matches in September 1980 put the club in 6th position. Gradually the season played itself out into one of consolidation in mid-table, with Callaghan continuing to overhaul his squad. Forwards Gary Johnson and Lee Frost arrived from Chelsea in December 1980 for a £30,000 fee, while squad members Willie Graham, Iori Jenkins and Dean Smith were released in February 1981. Brentford ended the season in 9th place, off the back of a run of just two defeats in the final 21 matches. Bob Booker finished the season as the team's top scorer in league matches, with a meagre seven goals.", "|Dean Smith", "| style=\"text-align:left;\" |Dean Smith", "| style=\"text-align:left;\" |Dean Smith", "| Dean Smith"]}]}}