{"wiki_id": "http://www.wikidata.org/entity/Q18125260", "itemLabel": "Graham Shillington", "itemDescription": "Northern Irish police officer", "wikipedia_url": "https://en.wikipedia.org/wiki/Graham_Shillington", "wikipedia_page": {"main": "Sir Robert Edward Graham Shillington (2 April 1911 – 14 August 2001) was a senior Northern Irish police officer. He served as Chief Constable of Royal Ulster Constabulary from 1970 to 1973.", "link_mentions": [{"page": "Royal Ulster Constabulary", "response": ["*Chief Constable Sir Graham Shillington, from November 1970."]}, {"page": "Shillington", "response": ["* Graham Shillington, chief officer of the Royal Ulster Constabulary (1970-1973)"]}, {"page": "William Conway (cardinal)", "response": ["A local priest, Father James Chesney, had been long rumoured to have been a leader of the IRA unit responsible for the murders. Hutchinson revealed that following the outrage, Father Chesney had been transferred by the Church across the border up to Moville, a small town in Inishowen in the north of County Donegal in the Republic of Ireland, following discussions between Cardinal Conway, the then Primate of All Ireland, and William Whitelaw, who was then the British Government's Secretary of State for Northern Ireland. Almost all of Inishowen lies within the Diocese of Derry. This transfer was done with the full knowledge of Sir Graham Shillington, the Chief Constable of the Royal Ulster Constabulary (RUC), who \"would have preferred that Chesney be transferred to Tipperary\"."]}, {"page": "Claudy bombing", "response": ["* In December 1972, William Whitelaw met the head of the Catholic Church in Ireland, Cardinal William Conway, to discuss the issue. According to a Northern Ireland Office official, \"the Cardinal said he knew the priest was 'a very bad man' and would see what could be done\". The church leader mentioned \"the possibility of transferring him to Donegal\". In response to this memo, RUC Chief Constable Sir Graham Shillington noted: \"I would prefer transfer to Tipperary.\""]}, {"page": "James Flanagan (police officer)", "response": ["In 1961 he was promoted to County Inspector and was appointed an OBE, just before the outbreak of the Troubles, in June 1968. In June 1970 he was appointed Assistant Chief Constable and in July 1973 he was appointed a CBE, becoming Chief Constable on 1 November 1973, replacing Sir Graham Shillington. In July 1974 he survived an IRA bombing attempt on a plane he was travelling in"]}, {"page": "1973 in Northern Ireland", "response": ["* 1 November – James Flanagan, first and only Roman Catholic Chief Constable of the Royal Ulster Constabulary, replaces Graham Shillington."]}, {"page": "David Graham Shillington", "response": ["Major David Graham Shillington PC(NI) (10 December 1872 – 22 January 1944) was an Ulster Unionist politician.", "Shillington and his wife Sarah Louisa (née Collen) lived at Ardeavon, Killycomain Road, Portadown,The Linen Houses of the Bann Valley: The Story of Their Families, Kathleen Rankin, Ulster Historical Foundation, 2007, p. 206A Call to Arms- Portadown and the Great War, Richard Edgar, 2014, pp. 238-239 and had six children. The youngest was (Robert Edward) Graham Shillington, who would become the Chief Constable of Royal Ulster Constabulary. Son Thomas Graham Shillington served with the 9th Royal Irish Fusiliers, and was killed in action in 1917 aged 19, during the First World War. Victoria Cross recipient Lieutenant Geoffrey St. George Shillington Cather was the son of Shillington's sister.A Call to Arms- Portadown and the Great War, Richard Edgar, 2014, pp. 238-239"]}, {"page": "Thomas Shillington", "response": ["By his wife, his first cousin, Sarah, daughter of Thomas Averell Shillington (1800-1874), of Tavanagh House, Portadown,Walford's County Families of the United Kingdom, 1913, p. 1073 he had issue including a son, Thomas Averell Shillington, who took over the Castleisland Linen Company until its liquidation in 1929.The Linen Houses of the Bann Valley: The Story of Their Families, Kathleen Rankin, Ulster Historical Foundation, 2007, p. 209 His cousin (and nephew by marriage) was the politician David Graham Shillington, father of Chief Constable of the Royal Ulster Constabulary Graham Shillington.The Linen Houses of the Bann Valley: The Story of Their Families, Kathleen Rankin, Ulster Historical Foundation, 2007, pp. 203-209"]}, {"page": "1970 Birthday Honours", "response": ["* Robert Edward Graham Shillington, , Deputy Chief Constable, Royal Ulster Constabulary."]}, {"page": "1972 Birthday Honours", "response": ["*Robert Edward Graham Shillington, , Chief Constable, Royal Ulster Constabulary."]}, {"page": "Anthony Peacocke", "response": ["During the increasingly violent period in Northern Ireland in 1969, Peacocke initially resisted the deployment of the British ArmyRyder, p. 109 although changed his view, after a telephone call from Graham Shillington, the Deputy Inspector-General, early in the morning of 13 August.Ryder, p. 112"]}, {"page": "Deaths in August 2001", "response": ["*Sir Graham Shillington, 90, Northern Irish police officer.Sir Graham Shillington Ulster police chief who first called in the army"]}]}}