{"wiki_id": "http://www.wikidata.org/entity/Q18162568", "itemLabel": "Gwyllym Lloyd Wardle", "itemDescription": "British politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Gwyllym_Lloyd_Wardle", "wikipedia_page": {"main": "Gwyllym Lloyd Wardle (c. 1762–1833) was a Welsh army officer and politician.", "link_mentions": [{"page": "Mary Anne Clarke", "response": ["With Gwyllym Lloyd Wardle, Francis Wright, and Daniel Wright:"]}, {"page": "List of Old Harrovians", "response": ["*Gwyllym Lloyd Wardle (c. 1762–1833), MP for Okehampton (1807–1812)"]}, {"page": "1795–1820 in Western fashion", "response": ["File:Gwyllym Lloyd Wardle by Arthur William Devis.jpg|8 – 1809", "#Portrait of Gwyllym Lloyd Wardle depicts him in a dark coat over a tan waistcoat and high collar and cravat, 1809."]}, {"page": "1809 in the United Kingdom", "response": ["* 25 May – Prince Frederick, Duke of York and Albany, the king's second son, is forced to resign as Commander-in-Chief of the Forces following a scandal in which his ex-mistress Mary Anne Clarke admits before the House of Commons to having sold army commissions with his knowledge (first raised in the House on 27 January by Gwyllym Lloyd Wardle). Clarke publishes her memoirs this year."]}, {"page": "William Frend (reformer)", "response": ["In 1806 he took part in the formation of the Rock Life Assurance Company, to which he was appointed as actuary. He continued in radical activities, participating around 1810 in a fundraising committee, with Timothy Brown, John Cartwright, William Cobbett, and Robert Waithman, to support Gwyllym Lloyd Wardle."]}, {"page": "Sheriff of Caernarvonshire", "response": ["*3 February 1803: Gwyllym Lloyd Wardle, of Wernfawr"]}, {"page": "Okehampton (UK Parliament constituency)", "response": ["| Gwyllym Lloyd Wardle"]}, {"page": "Arthur William Devis", "response": ["File:Gwyllym Lloyd Wardle by Arthur William Devis.jpg|Gwyllym Lloyd Wardle (1809)"]}, {"page": "James Glenie", "response": ["In 1804, Glenie left for England, leaving his wife, Mary Anne Locke, behind. A witness for the crown in the 1809 trial of Gwyllym Lloyd Wardle, he was severely criticised by Lord Ellenborough, the judge, and lost his reputation and positions. He died in poverty in Pimlico and was buried in the churchyard of St Martin-in-the-Fields in central London. "]}, {"page": "John Drakard", "response": ["* Drakard's Edition of the Public and Private Life of Colonel Wardle. … Introduced by an original Essay on Reform, &c., Stamford [1810?]. On Gwyllym Lloyd Wardle."]}, {"page": "Colonel Wardle", "response": ["#REDIRECT Gwyllym Lloyd Wardle"]}, {"page": "Gwyllym Wardle", "response": ["#REDIRECT Gwyllym Lloyd Wardle"]}, {"page": "William Hamilton Reid", "response": ["*Memoirs of the Life of Colonel Wardle, 1808; on Gwyllym Lloyd Wardle "]}, {"page": "List of MPs elected in the 1807 United Kingdom general election", "response": ["| Gwyllym Lloyd Wardle"]}]}}