{"wiki_id": "http://www.wikidata.org/entity/Q18128182", "itemLabel": "Dominic Smith", "itemDescription": "British gymnast", "wikipedia_url": "https://en.wikipedia.org/wiki/Dominic_Smith_(gymnast)", "wikipedia_page": {"main": "Dominic Smith (born 23 August 1993) is a British male acrobatic gymnast. With Alice Upcott, he was awarded the gold medal in the 2013 World Games, the gold medal at the 2013 Acrobatic Gymnastics European Championships and the silver medal in the 2014 Acrobatic Gymnastics World Championships.Since June 2012, Smith is a member of Spelbound, the gymnastic group who rose to fame in 2010, winning the fourth series of Britain's Got Talent. The prize was £100,000 and the opportunity to appear at the 2010 Royal Variety Performance.", "link_mentions": [{"page": "Gymnastics at the World Games", "response": ["|Dominic SmithAlice Upcott"]}, {"page": "Spelbound", "response": ["The troupe then remained unchanged for approximately 17 months until April 2012 when original members Leighanne Cowler and Amy Mackenzie stepped down. Leighanne, who is a gymnastics coach, decided to focus all her attention on her coaching career and Amy, who had been training as a competition base since retiring as a top in October 2011, wanted to focus fully on her competition career and upcoming GCSE's, they were both replaced by senior women's pair Alanna Baker and Poppy Spalding. In June 2012 Adam McAssey left the troupe to also focus on his coaching career and was replaced by Alice Upcott's competition partner Dominic Smith.", "In 2015 after winning Gold at the World Acrobatic Championships, Elise Matthews, Georgia Lancaster and Millie Spalding, retired from the sport and also left Spelbound. As well as the women's trio retiring, Alice Upcott and Dominic Smith, also did. Alice is now currently working with Michael Flatley's Lord of the Dance: Dangerous Games starring as Little Spirit.", "| Dominic Smith (2012–2014) || colspan=\"3\" | || colspan=\"3\" style=\"text-align:center; background:green;\" | || colspan=\"1\" | "]}, {"page": "2013 Acrobatic Gymnastics European Championships", "response": ["|Dominic SmithAlice Upcott", "|Dominic SmithAlice Upcott"]}, {"page": "2014 Acrobatic Gymnastics World Championships", "response": ["| Dominic SmithAlice Upcott", "| style=\"text-align:left;\" | Dominic SmithAlice Upcott || 11.870 || 8.650 || 9.000 || 0.000 || 29.520"]}, {"page": "2014 Acrobatic Gymnastics World Championships – Mixed pairs qualification", "response": ["| style=\"text-align:left;\"| Dominic SmithAlice Upcott || 29.010 || 28.825 || 29.645 || 87.480||Q"]}, {"page": "Alice Upcott", "response": ["Alice Upcott (born 14 February 1998) is a retired British female acrobatic gymnast and the sister of Edward Upcott, world champion in 2010. With Dominic Smith, she was awarded the gold medal in the 2013 World Games, the gold medal at the 2013 Acrobatic Gymnastics European Championships and the silver medal in the 2014 Acrobatic Gymnastics World Championships.", "In 2011, Upcott competed at the European Championships in Bulgaria, this time as a junior (12-18) mixed pair with Dominic Smith. They won a bronze medal in the dynamic discipline and finished with a silver medal overall. In 2012, Upcott and Smith won the British Championships before competing at the World Championships in Orlando Florida where they won a silver medal. "]}, {"page": "List of 2013 World Games medal winners", "response": ["| Dominic SmithAlice Upcott"]}, {"page": "Dominic Smith", "response": ["Dominic Smith may refer to:", "*Dominic Smith (baseball) (born 1995), American baseball player", "*Dominic Smith (gymnast) (born 1993), British acrobatic gymnast", "*Dominic Smith (footballer, born 1995), English footballer", "*Dominic Smith (footballer, born 1996), English footballer", "*Dynamite MC (born Dominic Smith, born 1973), English MC", "*Dominic Smith (author) (born 1971), Australian-American novelist"]}]}}