{"wiki_id": "http://www.wikidata.org/entity/Q1811844", "itemLabel": "Lee Ingleby", "itemDescription": "British actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Lee_Ingleby", "wikipedia_page": {"main": "Lee David Ingleby (born 28 January 1976) is an English film, television and stage actor.\nHe is best known for his roles as Detective Sergeant/Detective Inspector John Bacchus in the BBC drama Inspector George Gently, as Stan Shunpike in Harry Potter and the Prisoner of Azkaban and the role of Paul Hughes, the father of an autistic child, Joe, in a BBC drama, The A Word.", "link_mentions": [{"page": "Inspector Morse", "response": ["An Inspector Morse stage play appeared in 2010, written by Alma Cullen (writer of four Morse screenplays for ITV). The part of Morse was played by Colin Baker. The play, entitled Morse—House of Ghosts, saw DCI Morse looking to his past, when an old acquaintance becomes the lead suspect in a murder case that involves the on-stage death of a young actress. The play toured the UK from August to December 2010. It was broadcast by BBC Radio 4 on 25 March 2017 with Neil Pearson playing Morse and Lee Ingleby playing Lewis."]}, {"page": "1976", "response": ["** Lee Ingleby, British voice artist"]}, {"page": "The World According to Garp", "response": ["BBC Radio 4's Classic Serial broadcast a three-part adaptation of the novel by Linda Marshall Griffiths in January 2014. The production was directed by Nadia Molinari and featured Miranda Richardson as Jenny, Lee Ingleby as Garp, Jonathan Keeble as Roberta and Lyndsey Marshal as Helen."]}, {"page": "The Wind in the Willows", "response": ["* The Wind in the Willows, another live-action TV film in 2006 with Lee Ingleby as Mole, Mark Gatiss as Ratty, Matt Lucas as Toad, Bob Hoskins as Badger, and also featuring Imelda Staunton, Anna Maxwell Martin, Mary Walsh and Michael Murphy."]}, {"page": "The Day of the Triffids", "response": ["| Coker || Malcolm Hayes || Peter Sallis || Lee Ingleby"]}, {"page": "2003 in film", "response": ["| Master and Commander: The Far Side of the World || 20th Century Fox / Miramax Films / Universal Pictures || Peter Weir (director/screenplay); John Collee (screenplay); Russell Crowe, Paul Bettany, Billy Boyd, James D'Arcy, Edward Woodall, Bryan Dick, Chris Larkin, Robert Pugh, Max Benitz, Max Pirkis, Jack Randall, Lee Ingleby, Richard Pates, Richard McCabe, Ian Mercer, Tony Dolan, David Threlfall, Joseph Morgan, George Innes, William Mannering, Patrick Gallagher, Alex Palmer, John DeSantis, Ousmane Thiam, Mark Lewis Jones, Thierry Segall || Adventure, Drama, Period || || Live Action"]}, {"page": "1998 in film", "response": ["| Ever After || 20th Century Fox || Andy Tennant (director/screenplay); Susannah Grant, Tracey Trench (producer screenplay); Drew Barrymore, Anjelica Huston, Dougray Scott, Megan Dodds, Melanie Lynskey, Patrick Godfrey, Lee Ingleby, Timothy West, Judy Parfitt, Richard O'Brien, Jeroen Krabbé || Romance, Comedy, Drama || Live action"]}, {"page": "1976 in film", "response": ["*January 28 – Lee Ingleby, English film, television and stage actor"]}, {"page": "Burnley", "response": ["Possibly the best-known Burnley figure in the field of entertainment is actor Ian McKellen, who was born in the town in 1939. There is a blue plaque on the house where he lived, but where he says he was not born. Other actors born in the town include Mary Mackenzie, Irene Sutcliffe, Julia Haworth, Richard Moore,www.thisislancashire.co.uk. Accessed 22 October 2007. Alice Barry,Urban Talent Acting Agency . Accessed 22 October 2007. Jody Latham,www.tv.com Accessed 22 October 2007. Kathy Jamieson, Hannah Hobley, Natalie Gumede and Lee Ingleby. Coronation Street regular Malcolm Hebden grew up in the town. Screenwriter Paul Abbott, creator of Shameless, and television producer and executive Peter Salmon were also born here.\"Salmon's leap of faith\", The Guardian, 11 December 2006. Accessed 22 October 2007."]}, {"page": "Middlesbrough", "response": ["In March 2013, Middlesbrough was used as a stand in for Newcastle 1969 in BBC's Inspector George Gently starring Martin Shaw and Lee Ingleby; the footage appeared in the episode \"Gently Between The Lines\" (episode 1 of series 6)."]}, {"page": "List of Doctor Who supporting characters", "response": ["*Samson Griffin (Lee Ingleby) (Big Finish Productions)"]}, {"page": "Bob the Builder", "response": ["In October 2014, Bob the Builder was revamped by Mattel for a new series to be aired on Channel 5's Milkshake! in 2015. Amongst the changes were a complete overhaul of the cast, with Harry Potter actor Lee Ingleby replacing Neil Morrissey as the voice of Bob, and Joanne Froggatt and Blake Harrison also confirmed as the voices of Wendy and Scoop respectively. The setting and appearance of the characters also changed, with Bob and his team moving to the bustling metropolis of Spring City. An American localization of the new series debuted on PBS Kids in November 2015. The changes have been criticized by fans of the original version."]}, {"page": "Master and Commander: The Far Side of the World", "response": ["* Lee Ingleby as Midshipman Hollom"]}, {"page": "Hustle (TV series)", "response": ["The programme retained all of the lead actors from the first series; guest actors appearing in the second run included Lee Ingleby, Fay Ripley, and Robert Llewellyn. The second series was broadcast on BBC One from 29 March 2005, to a first-night audience of 6.7 million."]}, {"page": "Harry Potter and the Prisoner of Azkaban (film)", "response": ["Pam Ferris portrays Aunt Marge, Vernon's sister; Lee Ingleby plays Stan Shunpike, conductor of the Knight Bus; and Jim Tavaré appears as Tom, innkeeper of The Leaky Cauldron, replacing Derek Deadman from the first film. Dawn French plays the Fat Lady, a painting at Hogwarts, replacing Elizabeth Spriggs from the first film. Julie Christie appears as Madam Rosmerta, the barmaid at the Three Broomsticks. Warwick Davis appears as the conductor of the Hogwarts choir. The role was offered to him by producer David Heyman due to Filius Flitwick, Davis' original role, being absent from the script. The change in appearance for the new character later became Flitwick's look for the rest of the series."]}, {"page": "Brierfield, Lancashire", "response": ["*Lee Ingleby, actor"]}, {"page": "List of Harry Potter cast members", "response": ["| Lee Ingleby"]}, {"page": "Ever After", "response": ["* Lee Ingleby as Gustave"]}, {"page": "Nicholas Nickleby", "response": ["In 2001, ITV produced The Life and Adventures of Nicholas Nickleby winning a BAFTA and an RTS award for costume design. It was directed by Stephen Whittaker. It features James D'Arcy, Charles Dance, Pam Ferris, Lee Ingleby, Gregor Fisher, Tom Hollander, J. J. Feild and Tom Hiddleston."]}, {"page": "Soldier Soldier", "response": ["*Lee Ingleby as Kevin Fitzpatrick (Series 7)"]}, {"page": "Martin Shaw", "response": ["From 2007 until 2017 he played the title role in the BBC TV series Inspector George Gently alongside co-star Lee Ingleby."]}, {"page": "Early Doors", "response": ["*Dean (Lee Ingleby) - Mel's boyfriend in Series 2. Dean seems to be liked by Ken and is a typical jack the lad type who gets on well with most if not all of the regulars. It is loosely implied on some occasions that Joan may have feelings for Dean. "]}, {"page": "Edgar Wright", "response": ["! Lee Ingleby"]}, {"page": "London Academy of Music and Dramatic Art", "response": ["*Lee Ingleby – (Harry Potter and the Prisoner of Azkaban, Inspector George Gently)"]}, {"page": "Wirral Peninsula", "response": ["Sky One's 2016 thriller, The Five, starring Lee Ingleby shot scenes around Wirral including in Port Sunlight."]}, {"page": "Haven (film)", "response": ["* Lee Ingleby as Patrick"]}, {"page": "1976 in British television", "response": ["* 28 January — Lee Ingleby, actor"]}, {"page": "Richard Armitage (actor)", "response": ["Armitage appeared in a two-part 2006/07 Christmas/New Years special of The Vicar of Dibley, as Harry Kennedy, the vicar's new love interest (and eventual husband). He reprised the role in 2007 for Red Nose Day. On 8 April 2007, he played biker Ricky Deeming in the detective drama George Gently with Martin Shaw and Lee Ingleby. On 9 May 2007, he appeared in the BBC Four production of Miss Marie Lloyd – Queen of The Music Hall playing Marie Lloyd's first husband, Percy Courtenay. He also appeared in the Granada TV production of Agatha Christie's novel Ordeal by Innocence as the character Philip Durrant."]}, {"page": "Nemesis (Christie novel)", "response": ["* Lee Ingleby as Detective Constable Colin Hards"]}, {"page": "Anne Reid", "response": ["In 2013, she appeared in the second series of the BBC drama Prisoners' Wives as Margaret. She also starred with Katherine Kelly in The Last Witch, part of a series of original dramas for Sky Living and appeared in the final Agatha Christie's Poirot mystery, Curtain: Poirot’s Last Case as Daisy Luttrell. The following year, she guest-starred in \"Sardines\", the first episode of the BBC anthology series Inside No. 9. She also starred alongside Lee Ingleby and Ralf Little in the six-part BBC drama series Our Zoo."]}, {"page": "List of companions in Doctor Who spin-offs", "response": ["Samson Griffin and his sister Gemma are companions of the Eighth Doctor in the Big Finish audio adventure Terror Firma. The characters are played by Lee Ingleby and Lizzie Hopley. They meet the Doctor in Folkestone library, where Samson is a librarian, and follow him into the TARDIS. While exploring a time cruiser Samson and Gemma are captured by Davros, who gains control of their minds. While Davros monitors the Doctor's activities through Samson, he infects Gemma with a deadly virus that mutates humans into Daleks, using her to spread the disease around the world and pave the way for Davros to conquer the planet with a new race of Daleks. Eventually the Doctor frees Samson from Davros' control. Gemma's exact fate is left open to question. Another companion of the Doctor, C'rizz, tells the Doctor she has died, although it is implied that C'rizz has killed her. The Doctor returns Samson to Folkestone where, with his mother Harriet, a leader of the human resistance, he begins helping to rebuild Earth."]}, {"page": "Grindhouse (film)", "response": ["Edgar Wright's contribution, Don't, was produced in the style of a 1970s' Hammer House of Horror film trailer. The trailer featured appearances from Jason Isaacs, Matthew Macfadyen, singer Katie Melua, Lee Ingleby, Georgina Chapman, Emily Booth, Stuart Wilson, Lucy Punch, Rafe Spall, Wright regulars Simon Pegg and Nick Frost, and a voice-over by Will Arnett. Mark Gatiss, MyAnna Buring, Peter Serafinowicz, Michael Smiley, and Nicola Cunningham (who played the zombie \"Mary\" in Shaun of the Dead), among others, made uncredited cameo appearances. To get the necessary 1970s look, Wright used vintage lenses and old-style graphics. During editing, he scratched some of the film with steel wool and dragged it around a parking lot to make it appear neglected by wayward projectionists. According to Wright, \"In the '70s, when American International would release European horror films, they'd give them snazzier titles. And the one that inspired me was this Jorge Grau film: In the UK, it's called The Living Dead at Manchester Morgue. In Spain and in Italy, I think it's called Do Not Speak Ill of the Dead. But in the States, it was called Don't Open the Window. I just loved the fact that there isn't a big window scene in the film—it's all based around the spin and the voiceover not really telling you what the hell is going on in the film.\" On the Charlie Rose talk show, Quentin Tarantino also pointed out another aspect of American advertising of British films in the 1970s that was being referenced—none of the actors has any dialogue in the trailer, as if the trailer was intentionally edited to prevent American viewers from realizing that the film is British."]}, {"page": "Terror Firma", "response": ["*Samson Griffin — Lee Ingleby"]}, {"page": "Ingleby", "response": ["* Lee Ingleby (born 1976), British film, television, and stage actor"]}, {"page": "Chris Lang", "response": ["In 2007, he co-formed TXTV through which he now makes much of his original drama, and through which he co-created, wrote and executive produced Innocent, a four-part thriller starring Lee Ingleby, Hermione Norris, Nigel Lindsay and Angel Coulby. which broadcast on 14–17 May 2018 to a consolidated first night audience of 8.05 million, making it the most watched new ITV drama of the year, with The Daily Express calling it - 'Spellbinding...the TV drama that has got the whole nation watching\"."]}, {"page": "List of supporting Harry Potter characters", "response": ["Stan was portrayed by Lee Ingleby in the film adaptation of Prisoner of Azkaban."]}, {"page": "The Headsman", "response": ["*Lee Ingleby as Bernhard"]}, {"page": "Noni Răzvan Ene", "response": ["Noni had a successful stint with Cat Music, mostly with the song Give me the sunlight produced by Sunrise Inc but then signed with Walt Disney Records in 2010 by releasing the Romanian version for \"Wouldn't Change a Thing\" and Sindrum Media in 2012. He became recognized as a solo artist after lending his vocals to the songs \"Unbreakable\" by Astra Electronics sing by Noni in premiere at Antena 1 during the show \"Neatza with Răzvan and Dani\", and \"No te puedo olvidar\", which was a European success, in countries such as Romania, Spain, and Azerbaijan. His debut studio album, Îţi mulţumesc (2010) released by OVO Music influence Rachel Talalay who invite Noni to appear in the movie The Wind in the Willows, which starring Matt Lucas (Mr. Toad), Bob Hoskins (Badger), Mark Gatiss (Ratty), and Lee Ingleby (Mole)."]}, {"page": "John Mitchell (musician)", "response": ["Mitchell's latest music project is a solo project called Lonely Robot, whose album Please Come Home was released on 23 February 2015. It features a number of guest artists including Peter Cox, Steve Hogarth, Jem Godfrey, Nik Kershaw, and British actor Lee Ingleby. The albums The Big Dream released in April 2017 and Under Stars (April 2019), followed."]}, {"page": "The Life and Adventures of Nicholas Nickleby (2001 film)", "response": ["*Lee Ingleby as Smike"]}, {"page": "List of Irish films", "response": ["| Borstal Boy || Peter Sheridan || Shawn Hatosy, Danny Dyer, Lee Ingleby and Michael York || Romantic Drama||"]}]}}