{"wiki_id": "http://www.wikidata.org/entity/Q18125441", "itemLabel": "Aaron Collins", "itemDescription": "Welsh association football player (born 1997)", "wikipedia_url": "https://en.wikipedia.org/wiki/Aaron_Collins_(footballer)", "wikipedia_page": {"main": "Aaron Graham John Collins (born 27 May 1997) is a Welsh professional footballer who plays as a striker for Bristol Rovers.", "link_mentions": [{"page": "Newport County A.F.C.", "response": ["The team competes in the Under-18 Football League Youth Alliance. A number of the academy graduates have progressed to the senior squad including Andrew Hughes, Lee Evans, Regan Poole, Aaron Collins, Tom Owen-Evans, Kieran Parselle and Lewis Collins."]}, {"page": "Collins (surname)", "response": ["*Aaron Collins (1930–1997), American singer/songwriter", "*Aaron Collins (born 1997), Welsh footballer"]}, {"page": "Aaron Collins (singer)", "response": ["Aaron Collins (September 3, 1930 – March 27, 1997) was an American rhythm and blues singer and songwriter, most active in the 1950s and 1960s.", "Collins grew up in Arkansas and sang in church.  After three years in a gospel group in Michigan, he moved to California.  There he joined a spiritual group called the Santa Monica Soul Seekers (whose members later became the Cadets/the Jacks). Collins is best known as being a singer with the doo wop groups the Cadets, the Jacks, and the Flares.  The Cadets are best known for their hit \"Stranded in the Jungle\" in 1956.  The Jacks' biggest hit was \"Why Don't You Write Me?\" in 1955.  \"Foot Stomping\" was the Flares' big hit in 1961.  The lead vocals in these groups were usually done by Aaron Collins, Willie Davis, or Will \"Dub\" Jones.  While Collins was still a member of the Cadets and the Jacks, a solo album was released in 1957 called Calypso USA.  Two recordings from this album, \"Pretty Evey\" and \"Rum Jamaica Rum\", were released as a single by Aaron Collins and the Cadets in 1957.  These recordings were actually by Collins and a white studio group and not the Cadets.", "He released a couple of solo records in the 1960s.   Other records were released in the early 1960s as by the Peppers and the Thor-Ables.  These two groups were actually members of the Cadets and the Flares including Willie Davis and Aaron Collins.  Collins was also part owner of MJC Records in the early 1960s with Cadets members Lloyd McCraw and Will \"Dub\" Jones.", "* Pretty Evey/Rum Jamaica Rum (Modern #1019) (1957) (as Aaron Collins and the Cadets)"]}, {"page": "List of people from Newport", "response": ["* Aaron Collins"]}, {"page": "List of Newport County A.F.C. records and statistics", "response": ["*Received: £100,000+ (undisclosed) from Wolverhampton Wanderers for Aaron Collins, 22 January 2016."]}, {"page": "List of Newport County A.F.C. players", "response": ["*  Aaron Collins"]}, {"page": "2014–15 Newport County A.F.C. season", "response": ["|39||Aaron Collins||FW||||Newport || ||3||0||Youth system||15 September 2014||Trainee||2015", "|8 January 2015||FW|| Aaron Collins|| Merthyr Town||8 March 2015"]}, {"page": "2015–16 York City F.C. season", "response": ["York dropped to the bottom of the table after being beaten 1–0 away by Yeovil, who in turn moved above York; their goal came from a Matthew Dolan penalty scored late in the first half. Fewster's loan was extended to the end of the season, while McEvoy was signed permanently for the rest of 2015–16. Burnley right-back Luke Hendrie and Newcastle United centre-back Kyle Cameron were signed on one-month loans, while Ntumba Massanka joined on loan from Burnley until the end of the season. Godfrey joined Premier League club Norwich City for an undisclosed fee, believed to be £150,000, with further clauses that could take the figure to £1 million if met. The money was to be invested on strengthening the team, and York immediately replaced Godfrey with Hull City midfielder Matty Dixon, who signed a one-and-a-half-year contract on a free transfer. York lost 1–0 at home to fellow strugglers Newport, who had only appointed their manager Warren Feeney a day earlier. The loss came after Aaron Collins scored in the eighth minute. Marvin McCoy and Straker left the club by mutual consent, while McCombe and Nolan were also offered severance packages."]}, {"page": "2015–16 Newport County A.F.C. season", "response": ["In the League Trophy Newport were home to Swindon Town. With the game finishing 1–1 it entered a penalty shootout. With Aaron Collins missing the seventh penalty and Will Randall scoring his, Swindon went through 7–6.", "| 22 January 2016 || FW ||  || Aaron Collins || Wolverhampton Wanderers || Undisclosed ||"]}, {"page": "2015–16 Wolverhampton Wanderers F.C. season", "response": ["| 22 January 2016 ||  Aaron Collins || style=\"text-align:center;\"|  Newport County || style=\"text-align:center;\"| £75,000"]}, {"page": "Aaron Collins (rugby union)", "response": ["Aaron Collins (born 25 June 1971 in New Zealand) is a New Zealand rugby union player and now coach. He normally played at the Centre position; and previously played for Glasgow Warriors and Glasgow Academicals and West of Scotland.", "By virtue of a grandfather born in Blackburn, West Lothian - Aaron Collins was Scottish-Qualified - and in 1994 he was also playing in Scotland for Glasgow Academicals. "]}, {"page": "List of Morecambe F.C. seasons", "response": ["| Aaron Collins"]}, {"page": "2016–17 Wolverhampton Wanderers F.C. season", "response": ["| 31 August 2016 || Aaron Collins || style=\"text-align:center;\"|  Notts County || style=\"text-align:center;\"| 9 January 2017", "| 23 March 2017 || Aaron Collins || style=\"text-align:center;\"|  Tranmere Rovers || style=\"text-align:center;\"| End of season"]}, {"page": "2016–17 Notts County F.C. season", "response": ["|39||||CF||Aaron Collins                  ||2||1||0||0||3", "|39||||CF||Aaron Collins                 ||1||0||1||0||0||0||0||0||0||0||0||0||1||0||1", "| 31 August 2016 || CF ||  || Aaron Collins || Wolverhampton Wanderers || 9 January 2017 || "]}, {"page": "2017–18 Wolverhampton Wanderers F.C. season", "response": ["| 3 January 2018 || Aaron Collins ||align=\"center\"| Newport County ||align=\"center\"| End of season"]}, {"page": "2017–18 Newport County A.F.C. season", "response": ["| 4 January 2018 || CF ||  || Aaron Collins || Wolverhampton Wanderers || End of season || Collins joins Newport on loan"]}, {"page": "2017 National League play-off Final", "response": ["|FW||39||Aaron Collins"]}]}}