{"wiki_id": "http://www.wikidata.org/entity/Q182408", "itemLabel": "Glenda Jackson", "itemDescription": "British politician and actress (born 1936)", "wikipedia_url": "https://en.wikipedia.org/wiki/Glenda_Jackson", "wikipedia_page": {"main": "Glenda May Jackson  (born 9 May 1936) is an English actress and politician. She has won the Academy Award for Best Actress twice, receiving the first for her role as Gudrun Brangwen in the romantic drama film Women in Love (1970) and the second for her role as Vickie Allessio in the romantic comedy film A Touch of Class (1973). She also received praise for her performances as Alex Greville in the drama film Sunday Bloody Sunday (1971) and Elizabeth I in the BBC television serial Elizabeth R (1971), winning two Primetime Emmy Awards for the latter. In 2018, she won the Tony Award for Best Actress in a Play for her role in a revival of Edward Albee's Three Tall Women, thus becoming one of the few performers to have achieved the \"Triple Crown of Acting\" in the US.\nJackson took a hiatus from acting to take on a career in politics from 1992 to 2015, and was elected as the Labour Party MP for Hampstead and Highgate in the 1992 general election. She served as a junior transport minister from 1997 to 1999 during the government of Tony Blair, later becoming critical of Blair. After constituency-boundary changes, she represented Hampstead and Kilburn from 2010. In the 2010 general election, her majority of 42 votes was one of the closest results of the entire election. She stood down at the 2015 general election and returned to acting.\n\n", "link_mentions": [{"page": "May 9", "response": ["*  1936   – Glenda Jackson, English actress and politician "]}, {"page": "1936", "response": ["** Glenda Jackson, English actress and politician"]}, {"page": "Battle of Trafalgar", "response": ["*Bequest to the Nation (released in the US as The Nelson Affair) a 1973 British historical drama film, directed by James Cellan Jones, and starring Glenda Jackson, Peter Finch, and Michael Jayston. The majority of the film revolves around Nelson’s shore leave with Lady Hamilton, followed by Nelson’s recall to duty and the climatic Battle of Trafalgar. "]}, {"page": "Robert Devereux, 2nd Earl of Essex", "response": ["* The Earl of Essex was portrayed by Robin Ellis in the fifth and sixth episodes of the BBC series Elizabeth R (1971) starring Glenda Jackson as Elizabeth I."]}, {"page": "Roald Dahl", "response": ["In 1965, his wife Patricia Neal suffered three burst cerebral aneurysms while pregnant with their fifth child, Lucy. Dahl took control of her rehabilitation over the next months; Neal had to re-learn to talk and walk, but she managed to return to her acting career. This period of their lives was dramatised in the film The Patricia Neal Story (1981), in which the couple were played by Glenda Jackson and Dirk Bogarde."]}, {"page": "King Lear", "response": ["King Lear has been performed by esteemed actors since the 17th century, when men played all the roles. From the 20th century, a number of women have played male roles in the play; most commonly the Fool, who has been played (among others) by Judy Davis, Emma Thompson and Robyn Nevin. Lear himself has been played by Marianne Hoppe in 1990, by Janet Wright in 1995, by Kathryn Hunter in 1996–97, and by Glenda Jackson in 2016 and 2019.", "Lear was played on Broadway by Christopher Plummer in 2004 and Glenda Jackson in 2019, with Jackson reprising her portrayal from a 2016 production at The Old Vic in London."]}, {"page": "Stevie Smith", "response": ["Florence Margaret Smith, known as Stevie Smith (20 September 1902 – 7 March 1971), was an English poet and novelist. She won the Cholmondeley Award and was awarded the Queen's Gold Medal for Poetry. A play, Stevie by Hugh Whitemore, based on her life, was adapted into a film starring Glenda Jackson.", "Smith died of a brain tumour on 7 March 1971. Her last collection, Scorpion and other Poems was published posthumously in 1972, and the Collected Poems followed in 1975. Three novels were republished and there was a successful play based on her life, Stevie, written by Hugh Whitemore. It was filmed in 1978 by Robert Enders and starred Glenda Jackson and Mona Washbourne.ODNB entry."]}]}}