{"wiki_id": "http://www.wikidata.org/entity/Q1820463", "itemLabel": "Les Bubb", "itemDescription": "British mime", "wikipedia_url": "https://en.wikipedia.org/wiki/Les_Bubb", "wikipedia_page": {"main": "Les Bubb is a British mime artist.", "link_mentions": [{"page": "Physical theatre", "response": ["*Les Bubb"]}, {"page": "Eat the Rich (film)", "response": ["* Les Bubb as Waiter"]}, {"page": "Haldane Duncan", "response": ["Duncan made a nostalgic return to Scottish Television to direct the one-off sports drama The Game in 1998. This told the tale of \"a Rangers fanatic and a Celtic fanatic [who] put aside their differences and unite behind the Scottish team for the 1978 World Cup from the comfort of their couch\".The Game (1998 TV sports drama), director: BFI.org.uk website. Retrieved on 15 March 2008. It featured Alex Norton, Andy Gray, Phyllis Logan and Forbes Masson. In early 1999, he directed several instalments of the children's television show Hububb, a vehicle for kids' comic Les Bubb, featuring Elaine C Smith, Ford Keirnon and Greg Hemphill."]}, {"page": "Everyman and Playhouse Youth Theatre", "response": ["Many notable actors, musicians, writers, and other entertainers developed their interest in the performing arts at the Youth Theatre, such as Les Bubb, Malandra Burrows, Stephen Graham,\"Is this it?\" Guardian.co.uk, 30 May 2009 (Retrieved: 17 July 2009)Barkham, Patrick; \"'Gizza job, CBeebies'\" Guardian.co.uk, 1 July 2009 (Retrieved: 17 July 2009) Ian Hart,Collinson, Dawn; \"An elementary good doctor\" LiverpoolEcho.co.uk, 24 December 2002 (Retrieved: 17 July 2009) Gillian Kearney,Jones, Catherine; \"We’ve got talent! £25m Culture project launched\" LiverpoolEcho.co.uk, 23 September 2008 (Retrieved: 17 July 2009) Spencer Leigh, the McGann brothers (Joe, Mark, Paul, and Stephen),\"Joe McGann talks about TV, theatre and his latest Liverpool show Lost Monsters\" LiverpoolEcho.co.uk, 8 May 2009 (Retrieved: 17 July 2009) Katherine Rose Morley, David Morrissey,\"Everyman Youth Theatre 'coming home' after 13 years\" LiverpoolDailyPost.co.uk, 25 October 2006 (Retrieved: 17 July 2009) Con O'Neill,Shennan, Paddy; \"Crime time TV\" LiverpoolEcho.co.uk, 5 July 2008 (Retrieved: 17 July 2009) Angie Sammons, Michael Starke,Grant, Peter; \"Visions of youth\" icLiverpool.co.uk, 15 September 2006 (Retrieved: 17 July 2009) Heidi Thomas, and Cathy Tyson."]}, {"page": "Bubb", "response": ["* Les Bubb, mime artist from the UK"]}, {"page": "Hububb", "response": ["Hububb is a Children's Television programme broadcast on BBC One in the United Kingdom, it was named after Les Bubb who also played the title character with the same name. The show ran from 1997 until 2001. Five series of the show were made.Hububb Fan It was repeated on the CBBC Channel in 2002.", "* Les Bubb - Les Bubb.imbd Hububb", "* Les Bubb"]}, {"page": "Emil Wolk", "response": ["Between 1997 and 2001, Wolk appeared in the CBBC series Hububb where he played various characters and starred alongside Les Bubb, Ben Keaton, Elaine C. Smith and Miltos Yerolemou."]}, {"page": "Melville Monument", "response": ["In the children's television series Hububb, which aired on CBBC from 1997 to 2001, the main character, played by mime artist Les Bubb, lives in the Melville Monument."]}]}}