{"wiki_id": "http://www.wikidata.org/entity/Q18216805", "itemLabel": "Edward Fraser", "itemDescription": "British local politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Edward_Fraser", "wikipedia_page": {"main": "Sir Edward Henry Fraser  (15 February 1851 – 10 November 1921) was an English solicitor who was Mayor of Nottingham on four occasions.He was born in Nottingham and privately educated. He became a solicitor by profession, was appointed the first Secretary of the Nottingham Incorporated Law Society and in 1892 elected its President.In 1876, he was elected a town councillor for Nottingham, served as Sheriff of Nottingham for 1884–85, was made an Alderman in 1889 and elected Mayor of Nottingham for three successive years in 1896–1899. He was chosen a fourth time in 1910 and knighted in 1908. In 1898 he was also conferred with a D.C.L by the Archbishop of Canterbury. He was an unsuccessful candidate in the Parliamentary election of 1900.\nHe acted as Chairman of the Corporation Finances Committee, was Chairman of the Derwent Water Board and a Governor of Nottingham University College. He was also a Director of various commercial companies, including the Great Central Railway and the Nottingham Permanent Benefit Building Society. As Clerk to the Governors he was also responsible for the finances of Nottingham High School.\nHe was granted the Freedom of the City of Nottingham and his portrait hangs in the Guildhall.\nIn 1877, he married Jane Keightley, daughter of Charles Keightley. They had one son and three daughters. He died at Wellington House, Nottingham.", "link_mentions": [{"page": "National Liberal Club", "response": ["*Sir Edward Fraser, Mayor of Nottingham 1896–99"]}, {"page": "GCR Class 11E", "response": ["|432 ||October 1913 ||Sir Edward Fraser ||October 1955"]}, {"page": "Thomas Dumaresq", "response": ["Thomas Dumaresq, who was a Captain at the time of the Battle of the Saintes, which was a battle in the West Indies between the British Navy and French Navy. Dumaresq Commanded the HMS Repulse in the center under Admiral Sir George Rodney. His crew, what is described by Edward Fraser as \"smart set of Guernsey lads\" would suffer 3 deaths and 11 wounded. In the aftermath of the Battle of the Saintes Dumaresq, now in command of the HMS Alfred would take part of the Battle of the Mona Passage under Rear-Admiral Sir Samuel Hood."]}]}}