{"wiki_id": "http://www.wikidata.org/entity/Q1822081", "itemLabel": "Lewis Chalmers", "itemDescription": "English footballer (born 1986)", "wikipedia_url": "https://en.wikipedia.org/wiki/Lewis_Chalmers", "wikipedia_page": {"main": "Lewis John Chalmers (born 4 February 1986) is an English professional footballer who plays as a midfielder.\nHaving started playing football at Fletcher Moss Rangers, he moved to Altrincham he then moved on to Aldershot Town where he made several loan appearances for Crawley Town and Oxford United before joining Macclesfield Town on a free transfer in 2009. He has since played for a series of non league clubs including Radcliffe Borough and FC United of Manchester.", "link_mentions": [{"page": "Derek Niven", "response": ["In July 2012 he began training with Conference National side Grimsby Town, alongside former Macclesfield Town player Lewis Chalmers. After impressing in the club's 12–3 victory over Grimsby Borough he was offered a contract by the club, while Chalmers was released.http://www.grimsby-townfc.co.uk/page/NewsDetail/0,,10417~2848786,00.html On 16 July 2012 he signed a one-year contract with the club.http://www.grimsby-townfc.co.uk/page/NewsDetail/0,,10417~2850218,00.html Niven was ever present for the club in the centre of midfield with Craig Disley and helped play a part in the club's promotion and FA Trophy run in. Grimsby missed out on lifting silverware at Wembley Stadium having been defeated on penalties to Wrexham, and later lost out in the play-offs to Newport County. Town released Niven on 2 May 2013."]}, {"page": "Anthony Charles", "response": ["Charles was loaned to Aldershot Town for the end of the 2006–07 season, his second spell with the club and made the deal permanent after being released by Barnet. He was a championship winning defender in the 2007–08 season, and in recognition of this feat he was named in the Conference Premier team of the year along with Aldershot's Nikki Bull, Ben Harding, Lewis Chalmers and John Grant. At the end of the 2007–08 season, Charles signed a new two-year contract. Charles was a regular starter for Aldershot Town, in their first season back in the Football League and he was rewarded with a double award by winning the Supporters Club Player of the Season Award and Players Player Award. In June 2010, Charles signed a new one-year contract with Aldershot Town."]}, {"page": "Chalmers (surname)", "response": ["*Lewis Chalmers (born 1986), Association football player for Aldershot Town"]}, {"page": "2009–10 Aldershot Town F.C. season", "response": ["| Lewis Chalmers"]}, {"page": "2009–10 Oxford United F.C. season", "response": ["|align=\"left\"|17||align=\"left\"|MF||align=\"left\"|Lewis Chalmers"]}, {"page": "2010–11 Aldershot Town F.C. season", "response": ["|MF|| Lewis Chalmers ||  Macclesfield Town || Free || 30 Jun 2010"]}, {"page": "2010–11 Macclesfield Town F.C. season", "response": ["|align=\"left\"| Lewis Chalmers", "| Lewis Chalmers"]}, {"page": "2011–12 Macclesfield Town F.C. season", "response": ["|= ||MF || ||7 ||Lewis Chalmers || 3 || 0 || 0 || 0 || 3", "|7 || ||MF ||Lewis Chalmers || 2 || 0 || 0 || 0 || 0 || 0 || 0 || 0 || 2 || 0"]}, {"page": "Fletcher Moss Rangers F.C.", "response": ["*Lewis Chalmers"]}]}}