{"wiki_id": "http://www.wikidata.org/entity/Q18205640", "itemLabel": "Melanie Bromley", "itemDescription": "British journalist", "wikipedia_url": "https://en.wikipedia.org/wiki/Melanie_Bromley", "wikipedia_page": {"main": "Melanie Bromley (born September 30, 1974) is an American-based British-born entertainment journalist and broadcaster who is currently Head of News Operations & Chief News Correspondent for E! News, where she covers celebrity news.", "link_mentions": [{"page": "Us Weekly", "response": ["In February 2001, Wenner partnered with The Walt Disney Company. Bonnie Fuller worked as editor-in-chief of the publication from 2002 to 2003. She redesigned the title, creating the modern celebrity newsweekly. She created such signature sections as \"Stars Are Just Like Us.\" In July 2003, Janice Min took over as editor in chief with Victoria Lasdon Rose as publisher, and Michael Steele as executive editor. Steele took over for Min in 2009. Melanie Bromley served as the magazine's West Coast bureau chief from 2007 to 2012."]}, {"page": "E! News", "response": ["* Melanie Bromley – Chief news correspondent (2012–2020)"]}, {"page": "Sarah-Jane Crawford", "response": ["On 19 May 2018, Crawford was a co-presenter of E!’s royal wedding coverage of Prince Harry and Meghan Markle’s wedding live from Windsor Castle alongside Giuliana Rancic, Melanie Bromley and Brad Goreski. This telecast was broadcast live in both the US and UK and repeated throughout the next 12 hours afterwards. E!’s coverage was broadcast on their local networks globally. As well as this Crawford appeared in a number of specials about the royal wedding for broadcast on E! in the US which were later aired in the UK in the week leading up to the ceremony."]}, {"page": "Glam God with Vivica A. Fox", "response": ["* Melanie Bromley \"British Invasion\" - US Magazine Editor"]}, {"page": "Wedding of Prince Harry and Meghan Markle", "response": ["Coverage of the royal wedding in the UK was shown on BBC One, ITV, Sky News, CNN (International) and E! (Europe)  The wedding was also streamed live online on YouTube via the British Monarchy's official The Royal Channel. The BBC's chief news anchor Huw Edwards hosted coverage for BBC TV with Desert Island Discs host Kirsty Young and BBC Radio 2 DJ Dermot O'Leary. The BBC Radio coverage was co-hosted by Claire Balding, Jonny Dymond, Gemma Cairney, Jane Garvey, Paddy O'Connell, Aasmah Mir, Rachel Burden, Alistair Bruce-Ball and Julian Worricker. Phillip Schofield and Julie Etchingham hosted coverage for ITV. Kay Burley, Anna Botting and Alastair Bruce, among others, hosted coverage for Sky. Giuliana Rancic, Sarah-Jane Crawford, Melanie Bromley and Brad Goreski hosted coverage for E!."]}]}}