{"wiki_id": "http://www.wikidata.org/entity/Q18283641", "itemLabel": "Pat Griffith", "itemDescription": "British racing driver", "wikipedia_url": "https://en.wikipedia.org/wiki/Pat_Griffith", "wikipedia_page": {"main": "Pat Griffith (26 April 1926 – 28 January 1980) was an English racing driver, who raced for the works Aston Martin team during the early 1950s, winning the 1953 RAC Tourist Trophy. However, after a bad crash the 1954 12 Hours of Hyères, he retired to concentrate on the family business.", "link_mentions": [{"page": "George Abecassis", "response": ["|align=\"left\"|  Pat Griffith", "|align=\"left\"|  Pat Griffith"]}, {"page": "Peter Collins (racing driver)", "response": ["Meanwhile, he had better success in sportscars. Throughout the first half of the 1950s, Collins was a stalwart performer for the Aston Martin team, scoring a sensational victory at the 1952 Goodwood Nine Hours race. The following year he took the Aston Martin DB3S he shared with Pat Griffith to victory in the RAC Tourist Trophy at Dundrod. Further successes included second places in an Aston Martin DB3S at Le Mans in 1955 and 1956 with Paul Frère and Moss respectively.", "|align=\"left\"|  Pat Griffith", "|align=\"left\"|  Pat Griffith"]}, {"page": "Graham Whitehead", "response": ["|align=\"left\"|  Pat Griffith"]}, {"page": "Goodwood Circuit", "response": ["|Peter Collins/Pat Griffith"]}, {"page": "1952 24 Hours of Le Mans", "response": ["|  Dennis Poore Pat Griffith"]}, {"page": "1953 World Sportscar Championship", "response": ["|  Peter Collins Pat Griffith"]}, {"page": "1954 1000 km Buenos Aires", "response": ["The race was held over 106 laps of the 5.888 miles Autódromo Municipal-Avenida Paz, giving a distance of 624.162 miles (1,000 km). In the race, the factory Ferrari won ahead of the privately entered Ferrari 250 MM of Alfonso de Portago and Harry Schell , as well as the Aston Martin DB3S by Peter Collins and Pat Griffith. At the lap 14, car number 42 (private Aston Martin DB3 chassis number one) driven by Greene and Stabile) got under fire and caused death of Eric Forrest Greene.", "|  Pat Griffith"]}, {"page": "Bicycling (magazine)", "response": ["* Norman Sheil, Pat Griffith, Grand Prix training manual II, 1982/1984, "]}, {"page": "Douglas Circuit", "response": ["|   Pat Griffith"]}, {"page": "British Empire Trophy", "response": ["|  Pat Griffith"]}, {"page": "1953 1000km of Nürburgring", "response": ["|  Pat Griffith"]}, {"page": "1953 RAC Tourist Trophy", "response": ["The race was won by Peter Collins and Pat Griffith, driving an Aston Martin DB3S.", "A total 45 cars were registered for this event, of which only 28 arrived for practice and qualifying. None of the leading works teams made the trip across to Northern Ireland from mainland Europe. However, from England, the two works teams of Jaguar Cars Ltd. and Aston Martin took part. The team from Coventry arrived with three cars, Jaguar C-Types for the all British pairings of Tony Rolt/Duncan Hamilton, Stirling Moss/Peter Walker and Peter Whitehead/Ian Stewart. Aston Martin also brought along three of their DB3S, with Reg Parnell pairing up alongside Eric Thompson. Roy Salvadori/Dennis Poore and Peter Collins/Pat Griffith made up the crew of the other two Astons. Also from England came three works entered Frazer Nash Le Mans Mk IIs and Kieft-Bristols.", "|  Pat Griffith"]}, {"page": "1954 Mille Miglia", "response": ["|  Pat Griffith"]}, {"page": "1954 RAC Tourist Trophy", "response": ["Scuderia Ferrari, who could win the World Championship on the streets of County Antrim, entered two Ferrari 750 Monzas for the Le Mans winners José Froilán González and Maurice Trintignant, back-up by Mike Hawthorn and Umberto Maglioli. Hoping the keep the championship alive, Scuderia Lancia sent two of their D24s and two D25s (re-bodied D24s) over. Amongst their line-up was Juan Manuel Fangio and Alberto Ascari.  From England, the two work teams of Jaguar Cars Ltd. and Aston Martin. The team from Coventry arrived with three cars, Jaguar D-Types for the all British pairings of Tony Rolt/Duncan Hamilton; Stirling Moss/Peter Walker and Peter Whitehead/Ken Wharton. David Brown also brought along three of his team’s DB3S, with Reg Parnell pairing up alongside Roy Salvadori. Graham Whitehead/Dennis Poore and winners of last year’s RAC Tourist Trophy, Peter Collins/Pat Griffith made up the crew of the other two Astons. Also from England came works entries from  Automobiles Frazer Nash, Lotus Engineering, HWM  and Kieft Cars. There were joined manufactures teams from Maserati, Osca and Deutsch et Bonnet.http://www.racingsportscars.com/entry/Dundrod-1954-09-11-2305.html", "|  Pat Griffith"]}]}}