{"wiki_id": "http://www.wikidata.org/entity/Q1820792", "itemLabel": "Leslie Halliwell", "itemDescription": "British film critic (1929-1989)", "wikipedia_url": "https://en.wikipedia.org/wiki/Leslie_Halliwell", "wikipedia_page": {"main": "Robert James Leslie Halliwell (23 February 1929 – 21 January 1989) was a British film critic, encyclopaedist and television impresario who in 1965 compiled The Filmgoer's Companion, the first one-volume encyclopaedia devoted to all aspects of the cinema. He followed it a dozen years later with Halliwell's Film Guide, another monumental work of effort and devotion. In the era before the internet, Halliwell's books were regarded as the number one source for movie information, and his name became synonymous with film knowledge and research. Anthony Quinton wrote in the Times Literary Supplement in 1977:\n\nImmersed in the enjoyment of these fine books, one should look up for a moment to admire the quite astonishing combination of industry and authority in one man which has brought them into existence.\nIn his capacity as chief buyer for the ITV network, Halliwell was further responsible for bringing to British television screens some of the most popular films and shows of the 1970s and 1980s, including The Six Million Dollar Man, Charlie's Angels, The Incredible Hulk, The A-Team, The Winds of War, Jaws, Star Wars and the James Bond movies.Halliwell's promotion of the cinema through his books and seasons of 'golden oldies' on Channel 4 won him awards from the London Film Critics' Circle, the British Film Institute and a posthumous BAFTA.", "link_mentions": [{"page": "The Big Fisherman", "response": ["Leslie Halliwell in his Film and Video Guide (5th edition, 1985) dismissed it as a \"well-meaning but leaden adaptation of a bestselling novel which followed on from The Robe. He concluded that it is \"too reverent by half, and in many respects surprisingly incompetent.\" Halliwell's quoted Monthly Film Bulletin (\"its overall flatness of conception and execution is a stiff price to pay for the lack of spectacular sensationalism characterizing its fellow-epics\") and The Hollywood Reporter (\"the picture is three hours long, and, except for those who can be dazzled by big gatherings of props, horses and camels, it is hard to find three minutes of entertainment in it\")."]}, {"page": "East Lynne", "response": ["Leslie Halliwell cited in the 7th edition of 'Halliwell's Film Guide', (page 325), that the 1930 feature film, 'Ex-Flame', (starring Neil Hamilton), was \"A modernized version\", providing \"... Unintentional ...laughs\". He went on to quote Variety (magazine)'s contemporary review of it as \"..Mush stuff for the women\"."]}, {"page": "The Big House (1930 film)", "response": ["British references had some positive words for the film, with the 1984 edition of David Shipman's The Good Film and Video Guide giving 1 star out of 4 (\"Recommended with reservations\"), noting that it is \"[An] untypical MGM film, about prison life which is now laughably conventional but was then very influential\". Shipman describes Wallace Beery and Chester Morris as \"two old lags\" and Robert Montgomery as \"the wealthy guy too weak for the system\". Leslie Halliwell in the 5th edition (1985) of his Film and Video Guide, rated it 2 stars out of 4 and described it as an \"[A]rchetypal prison melodrama and a significant advance in form for early talkies.\""]}, {"page": "Lost Horizon (1937 film)", "response": ["In 1942, the film was re-released as The Lost Horizon of Shangri-La. A lengthy drunken speech delivered by Robert Conway, in which he cynically mocks war and diplomacy, had already been deleted in the general release version. Capra felt the film made no sense without the scene, and in later years film critic Leslie Halliwell described the missing 12 minutes as \"vital\".Halliwell 1982, pp. 180–183. They were restored years later."]}, {"page": "Dawn of the Dead (1978 film)", "response": ["Similar to the preceding Night of the Living Dead, some critical reviewers did not like the gory special effects. Particularly displeased at the large amount of gore and graphic violence was The New York Times critic Janet Maslin, who claimed she walked out after the first 15 minutes due to \"a pet peeve about flesh-eating zombies who never stop snacking,\" and Gene Shalit of NBC's Today show dismissed it as \"Yawn of the Living.\" Others, particularly Variety, attacked the film's writing, suggesting that the violence and gore detract from any development of the characters, making them \"uninteresting\", resulting in a loss of impact. Variety wrote: \"Dawn pummels the viewer with a series of ever-more-grisly events — shootings, knifings, flesh tearings - that make Romero's special effects man, Tom Savini, the real \"star\" of the film—the actors are as woodenly uninteresting as the characters they play.\" Pauline Kael wrote that, in contrast to the \"truly frightening\" Night of the Living Dead, \"you begin to laugh with relief that you're not being emotionally challenged or even affected; [Dawn of the Dead is] just a gross-out.\" Leslie Halliwell of Halliwell's Film Guide stated the film was \"occasionally laughable, otherwise sickening or boring.\""]}, {"page": "The Bank Dick", "response": ["Harrison's Reports called it \"A good program comedy. W.C. Fields is at his best and for that reason the picture should go over very well with his fans.\" John Mosher of The New Yorker wrote that \"there is often an incident or gesture reminiscent of the Mack Sennett comedies. At times, the movie even smacks of those old days so exactly that you almost believe it must be a revival of some classic. There's nothing antiquated about it, however, no stale, museum starchiness, and the scandalous Mr. Fields has to be forgiven his outrageous behavior, since he is so simply and honestly funny.\" Film critic Leslie Halliwell deemed it \"Imperfect, but probably the best Fields vehicle there is\", and W.C. Fields biographer Robert Lewis Taylor called it \"One of the great classics of American comedy\"."]}, {"page": "Double Indemnity", "response": ["The film's critical reputation has only grown over the years. In 1977, Leslie Halliwell gave it a 4-star (top) rating, and wrote: \"Brilliantly filmed and incisively written, perfectly capturing the decayed Los Angeles atmosphere of a Chandler novel, but using a simpler story and more substantial characters.\"Walker, John (ed.) Halliwell's Film Guide, New York: HarperPerennial, 1994, p. 344  In a 1998 review for his \"Great Films\" series, film critic Roger Ebert thought the romance between MacMurray and Stanwyck showed \"little psychological depth\", while MacMurray and Robinson showed the \"genuine emotion\" of a surrogate father-son relationship that represented the film's heart. Ebert praised director Wilder and cinematographer Seitz. He wrote \"The photography by John F. Seitz helped develop the noir style of sharp-edged shadows and shots, strange angles and lonely Edward Hopper settings.\"Roger Ebert \"Double Indemnity (1944)\","]}, {"page": "The Prisoner of Zenda", "response": ["* The Prisoner of Zenda (1937): Starring Ronald Colman as Rassendyll and Rudolph, Madeleine Carroll as Princess Flavia, Raymond Massey as Michael, Douglas Fairbanks Jr. as Rupert of Hentzau, C. Aubrey Smith as Colonel Zapt and David Niven as Captain Fritz von Tarlenheim. David O. Selznick decided to produce the film, partly as a comment on the Edward VIII abdication crisis,The Brits in Hollywood Sheridan Morley, Robson Books 2006, p. 161,  and it was directed by John Cromwell. Of the many film adaptations, this is considered by many to be the definitive version.VideoHound's Golden Movie Retriever 2008, Visible Ink Press  Leslie Halliwell puts it at No. 590 of all the films ever made, saying that the \"splendid schoolboy adventure story\" of the late Victorian novel is \"perfectly transferred to the screen\",Halliwell's Top 1000, John Walker, HarperCollins Entertainment  and quotes a 1971 comment by John Cutts that the film becomes more \"fascinating and beguiling\" as time goes by. Halliwell's Film Guide 2008 calls it \"one of the most entertaining films to come out of Hollywood\".Halliwell's Film Guide 2008, David Gritten, HarperCollins Entertainment "]}, {"page": "Rio Bravo (film)", "response": ["In the United Kingdom, Rio Bravo was not originally even reviewed for Sight & Sound;The Movie article by Phil Hardy, 1980 Leslie Halliwell gave the film two out of four stars in his Film Guide, describing it as a \"cheerfully overlong and slow-moving Western\" that was nevertheless \"very watchable for those with time to spare\".Halliwell, Leslie (1979). Halliwell's Film Guide to 8,000 English Language Films, Hart-Davis, MacGibbon, Granada. The film was taken more seriously by British critics such as Robin Wood, who rated it as his top film of all time and wrote a book on it in 2003 for the British Film Institute, publishers of Sight & Sound. Pauline Kael called the film \"silly, but with zest; there are some fine action sequences, and the performers seem to be enjoying their roles.\" Rio Bravo was the second highest-ranking Western (63rd overall) in the 2012 Sight & Sound critics' poll of the greatest films ever made. In 2008, the American Film Institute nominated this film for its Top 10 Western Films list."]}, {"page": "Hud (1963 film)", "response": ["Leonard Maltin's Movie Guide gave Hud four stars out of four. Maltin called the picture \"An excellent story of moral degradation, with impeccable performances by all\". Steven H. Scheuer's Movies on TV also gave the film four stars out of four; Scheuer called it \"a must for movie-drama fans\", and said the cast was \"superb\". In Film and Video Guide Leslie Halliwell gave Hud four stars out of four, calling it \"unique\". Allmovie gave Hud five stars out of five, calling the film \"a warning shot for the Sixties\" and saying that its \"generational conflict would prove prescient\". It praised Howe's cinematography, which gave the film \"an authentic Western feel\"."]}, {"page": "Now, Voyager", "response": ["Leslie Halliwell wrote in Halliwell's Film Guide: \"A basically soggy script gets by, and how, through the romantic magic of its stars, who were all at their best; and suffering in mink went over very big in wartime.\"Halliwell's Film Guide, 1992, p. 818"]}, {"page": "The Great Escape (film)", "response": ["Critical and public response has mostly been enthusiastic, with a \"Certified Fresh\" 94% rating on Rotten Tomatoes.  In 1963, The New York Times critic Bosley Crowther wrote: \"But for much longer than is artful or essential, The Great Escape grinds out its tormenting story without a peek beneath the surface of any man, without a real sense of human involvement. It's a strictly mechanical adventure with make-believe men.\" British film critic Leslie Halliwell described it as \"pretty good but overlong POW adventure with a tragic ending\". The Time magazine reviewer wrote in 1963: \"The use of colour photography is unnecessary and jarring, but little else is wrong with this film. With accurate casting, a swift screenplay, and authentic German settings, Producer-Director John Sturges has created classic cinema of action. There is no sermonizing, no soul probing, no sex. The Great Escape is simply great escapism\"."]}, {"page": "Caligula (film)", "response": ["Caligula continued to garner negative reception long after its release. It has been reappraised by some critics; review aggregate Rotten Tomatoes gives the film a negative score of 23% based on 30 reviews, with an average rating of 3.06/10. The site's critical consensus reads, \"Endlessly perverse and indulgent, Caligula throws in hardcore sex every time the plot threatens to get interesting.\" Leslie Halliwell said Caligula was \"a vile curiosity of interest chiefly to sado-masochists\".Photoplay Magazine, Volume 38, 1987 (p.38) Time Out London called it \"a dreary shambles\". Positive criticism of the film came from Moviehole reviewer Clint Morris, who awarded it 3 stars out of 5, calling it \"[a] classic in the coolest sense of the word\". New Times critic Gregory Weinkauf gave the film 3 out of 5, calling it \"Kinda dumb and tacky, but at least it's a real movie\". Arkansas Democrat-Gazette reviewer Philip Martin also gave the film 3 out of 5."]}, {"page": "A Hard Day's Night (film)", "response": ["The film was a financial and critical success and was nominated for two Academy Awards including Best Original Screenplay. Forty years after its release, Time magazine rated it as one of the 100 all-time great films. In 1997, British critic Leslie Halliwell described it as a \"comic fantasia with music; an enormous commercial success with the director trying every cinematic gag in the book\" and awarded it a full four stars. The film is credited as being one of the most influential of all musical films, inspiring numerous spy films, the Monkees' television show and pop music videos, and various other low-budget musical film vehicles starring British pop groups, such as the Gerry and the Pacemakers film Ferry Cross the Mersey and John Boorman's vehicle for The Dave Clark Five, Catch Us If You Can.", "Time magazine called the film \"One of the smoothest, freshest, funniest films ever made for purposes of exploitation.\" Film critic Roger Ebert described the film as \"one of the great life-affirming landmarks of the movies\", and added it to his list of The Great Movies. In 2004, Total Film magazine named A Hard Day's Night the 42nd greatest British film of all time. In 2005, Time.com named it one of the 100 best films of the last 80 years. Leslie Halliwell gave the film his highest rating, four stars, the only British film of 1964 to achieve that accolade.", "British critic Leslie Halliwell states the film's influence as \"it led directly to all the kaleidoscopic swinging London spy thrillers and comedies of the later sixties\". In particular, the visuals and storyline are credited with inspiring The Monkees' television series. The \"Can't Buy Me Love\" segment borrowed stylistically from Richard Lester's earlier The Running Jumping & Standing Still Film, and it is this segment, in particular using the contemporary technique of cutting the images to the beat of the music, which has been cited as a precursor of modern music videos. Roger Ebert goes even further, crediting Lester for a more pervasive influence, even constructing \"a new grammar\": \"he influenced many other films. Today when we watch TV and see quick cutting, hand-held cameras, interviews conducted on the run with moving targets, quickly intercut snatches of dialogue, music under documentary action and all the other trademarks of the modern style, we are looking at the children of A Hard Day's Night\". Film theorist James Monroe writes, \"The lively 1960s films of Richard Lester—especially his Musicals A Hard Day's Night (1964), Help! (1965), and A Funny Thing Happened on the Way to the Forum (1966)—popularized jump cuts, rapid and 'ungrammatical' cutting. Over time, his brash editorial style became a norm, now celebrated every night around the world in hundreds of music videos on MTV and in countless commercials.\" A Hard Day's Night also inspired a 1965 film featuring Gerry and the Pacemakers, entitled Ferry Cross the Mersey. In an interview for the DVD re-release of A Hard Day's Night, Lester said he had been labelled the father of MTV and had jokingly responded by asking for a paternity test."]}, {"page": "Notorious (1946 film)", "response": ["Writing in The New York Times, Bosley Crowther praised the film, writing, \"Mr. Hecht has written, and Mr. Hitchcock has directed in brilliant style, a romantic melodrama which is just about as thrilling as they come—velvet smooth in dramatic action, sharp and sure in its characters, and heavily charged with the intensity of warm emotional appeal.\"Crowther, Bosley. \"The Screen in Review.\" The New York Times, August 16, 1946 Leslie Halliwell, usually terse, almost glowed about Notorious: \"Superb romantic suspenser containing some of Hitchcock's best work.\"Walker, John, ed. Halliwell's Film Guide. New York: Harper Perennial. . p. 873 Decades later, Roger Ebert also praised the film, adding it to his \"Great Movies\" list and calling it \"the most elegant expression of the master's visual style\".Ebert, R.Great Movies:Notorious, August 17, 1997. Chicago Sun-Times. Retrieved 6 September. On the website Rotten Tomatoes, the film has an overall positive rating of 96%, with an average rating of 8.9/10 based on 48 reviews, with a consensus of: \"Sublime direction from Hitchcock, and terrific central performances from Ingrid Bergman and Cary Grant make this a bona-fide classic worthy of a re-visit.\""]}, {"page": "Strangers on a Train (film)", "response": ["Conversely, Bosley Crowther of The New York Times criticized the film: \"Mr. Hitchcock again is tossing a crazy murder story in the air and trying to con us into thinking that it will stand up without support. ... Perhaps there will be those in the audience who will likewise be terrified by the villain's darkly menacing warnings and by Mr. Hitchcock's sleekly melodramatic tricks. ... But, for all that, his basic premise of fear fired by menace is so thin and so utterly unconvincing that the story just does not stand.\" Leslie Halliwell felt that Hitchcock was \"at his best\" and that the film \"makes superior suspense entertainment,\" but called the story \"unsatisfactory.\"Halliwell, Leslie, with John Walker, ed. (1994). Halliwell's Film Guide. New York: Harper Perennial. . p. 1139"]}, {"page": "Sid and Nancy", "response": ["Not all reviews of the film were positive. Leslie Halliwell, in a negative appraisal, reiterated a line from a review that appeared in Sight & Sound: \"Relentlessly whingeing performances and a lengthy slide into drugs, degradation and death make this a solemnly off-putting moral tract.\"Halliwell, Leslie (1995) Halliwell's Film Guide: 11th Edition, John Walker (ed.). HarperCollins. p. 1033. ."]}, {"page": "Seven Days in May", "response": ["British references also show high regard for the film, with TimeOut Film Guides founding editor Tom Milne indicating that \"conspiracy movies may have become more darkly complex in these post-Watergate days of Pakula and paranoia, but Frankenheimer's fascination with gadgetry (in his compositions, the ubiquitous helicopters, TV screens, hidden cameras and electronic devices literally edge the human characters into insignificance) is used to create a striking visual metaphor for control by the military machine. Highly enjoyable.\" In his Film Guide, Leslie Halliwell provided 3 stars (out of 4), describing it as an \"absorbing political mystery drama marred only by the unnecessary introduction of a female character. Stimulating entertainment.\" David Shipman in his 1984 The Good Film and Video Guide gives 2 (out of 4) stars, noting that it is \"a tense political thriller whose plot is plotting\"."]}, {"page": "List of films considered the worst", "response": ["No Orchids for Miss Blandish, a British gangster film adapted from the 1939 novel by James Hadley Chase, received a very hostile reception from the press. This was mainly due to the film's high (for the time) level of sexual and violent content, but also because its attempt to portray Americans using a largely British cast (including an early role for Sid James) was seen as unconvincing. The British film journal Monthly Film Bulletin called it \"the most sickening exhibition of brutality, perversion, sex and sadism ever to be shown on a cinema screen\". The Sunday Express film reviewer called No Orchids for Miss Blandish \"the worst film I have ever seen\". The Australian newspaper The Age also gave a harsh review: \"No Orchids for Miss Blandish is not only a disgrace to the studio that made it, but it also reflects on the British industry as a whole ... the entire production is unpardonable.\" Cliff Goodwin, discussing No Orchids For Miss Blandish's initial reception, notes it was \"unanimously dubbed 'the worst film ever made. Later reviews of the film were equally antipathetic. No Orchids for Miss Blandish was described by British film reviewer Leslie Halliwell as a \"hilariously awful gangster film ... one of the worst films ever made\". Leonard Maltin's Classic Movie Guide states that No Orchids for Miss Blandish \"aspires to be a Hollywood film noir and misses by a mile.\"", "Fire Maidens from Outer Space, a low-budget British space opera film (known in the US as Fire Maidens of Outer Space), is about a group of astronauts visiting an all-female society on a moon of Jupiter.DVD Drive-In This film developed a negative reputation for its poor special effects (including a scene on the alien planet in which an automobile is visible driving past).Fire Maidens Of Outer Space. DVD Talk, August 13, 2013. Retrieved January 21, 2014. Leslie Halliwell described Fire Maidens from Outer Space as \"a strong contender for the title of the worst movie ever made, with diaphanously clad English gals striking embarrassed poses against cardboard sets\".John Walker (ed.) Halliwell's Film and Video Guide 2000, London and New York; HarperCollins, 1999,  (p.287). British film historian I.Q. Hunter included it in his list of candidates for \"the worst British film ever made\".I. Q Hunter, \"From Window Cleaner to Potato Man\" in British Comedy Cinema, edited by I.Q. Hunter and Laraine Porter. Routledge, 2012. . (p.154) The DVD Talk website's review claimed it \"may be among the worst-ever professionally produced science fiction films\". In November 1992, the film was featured in an episode of Mystery Science Theater 3000.", "The Swarm is a 1978 horror film about a killer bee invasion of Texas, directed and produced by Irwin Allen. Despite its all-star cast (including Michael Caine, Henry Fonda, Richard Widmark and Olivia de Havilland), it was a box-office failure and was excoriated by reviewers.Halliwell's film and video guide 2002 edited by John Walker. London. HarperCollins Entertainment, 2001.  (p. 804). On its UK release, The Sunday Times described The Swarm as \"simply the worst film ever made\".The worst movie ever? The Guardian, April 26, 2001. Retrieved March 29, 2014. Leslie Halliwell described it as a \"very obvious disaster movie with risible dialogue\". The Guardian article on The Swarm stated, \"You could pass it all off as a sick joke, except it cost twelve million dollars, twenty-two million bees, and several years of someone's life.\" Barry Took, reviewing it for Punch, stated, \"the story is of a banality matched only by the woodenness of the acting\". Time Out magazine called The Swarm a \"risibly inadequate disaster movie\".\"The Swarm\" Retrieved March 29, 2014. The Swarm is included in several \"worst movie\" books, including the Medved brothers' The Golden Turkey Awards,Mikel J. Koven, Film, Folklore and Urban Legends. Scarecrow Press, 2008  (p. 91) and The Official Razzie Movie Guide. It soon gained a cult status (enough so that Warner Archive released the extended version on Blu-ray).Warner Archive Releasing Extended Version of 1978's ‘The Swarm’ on Blu-ray-Bloody DisgustingOn This Day in Horror History: The Mind Boggling ‘The Swarm’ Hit Theaters-Addicted to Horror", "The adventure film Tarzan, the Ape Man, loosely based on the novel Tarzan of the Apes by Edgar Rice Burroughs, stars Miles O'Keefe (who would later become famous in the 1984 Conan the Barbarian knock-off Ator the Invincible alongside its sequel featured in two episodes of the TV series Mystery Science Theater 3000) in the title role and Bo Derek as his partner Jane Parker, and is told from Jane's point of view.Tarzan, The Ape Man - The Cinema Snob on YouTube Despite being a box office success, it was poorly received by critics upon its release, due to its poor screenplay, bad acting, and unintentional humor. Leonard Maltin, writing for his Movie Guide, stated that the film \"lacks action, humor and charm\", and considered it so bad that it \"nearly forced editors of this book to devise a rating lower than BOMB\". Leslie Halliwell was equally harsh; he described Tarzan, the Ape Man as \"certainly the worst of the Tarzan movies and possibly the most banal film so far made; even the animals give poor performances\".Leslie Halliwell, John Walker, Halliwell's Film Guide. HarperPerennial, 1996 (p. 1119). Writer Thomas S. Hischak described it thus: \"Produced and directed without a shred of talent by John Derek, Tarzan, the Ape Man often ranks high in the lists of the worst movies ever made.\"Thomas S. Hischak, American Literature on Stage and Screen: 525 Works and Their Adaptations McFarland, 2012.  (p. 237) Film critic John Nesbit considered it \"my pick for worst film ever\", while Matt Brunson of Creative Loafing wrote, \"this cinematic atrocity truly is one of the all-time worsts\". Tarzan, the Ape Man was nominated for six awards at the 2nd Golden Raspberry Awards, winning one for Worst Actress (Bo Derek). It holds a 10% rating on Rotten Tomatoes based on 20 reviews."]}, {"page": "St Catharine's College, Cambridge", "response": ["|Leslie Halliwell"]}, {"page": "Miniseries", "response": ["Several commentators have offered more precise definitions of the term. In Halliwell's Television Companion (1987), Leslie Halliwell and Philip Purser suggested that miniseries tend to \"appear in four to six episodes of various lengths\",Halliwell, Leslie, and Peter Purser, Halliwell's Television Companion, London: Paladin, 1987 while Stuart Cunningham in Textual Innovation in the Australian Historical Mini-series (1989) defined a miniseries as, \"a limited run program of more than two and less than the 13-part season or half season block associated with serial or series programming\".Cunningham, Stuart. \"Textual Innovation in the Australian Historical Mini-series\", chapter in Australian Television: Programs, Pleasures and Politics, Sidney: Allen and Unwin, 1989 With the proliferation of the format in the 1980s and 90s, television films broadcast over even two or three nights were commonly referred to as miniseries in the US."]}, {"page": "Sorcerer (film)", "response": ["In Leonard Maltin's annual \"TV Movies\" ratings book, the film receives only two-and-a-half out of four stars, with the critique, \"Expensive remake of The Wages of Fear never really catches hold despite a few astounding scenes.\" In Leslie Halliwell's Halliwell's Film Guide, the evaluation is even more harsh, and the author found the film \"truly insulting\", going as far as to say: \"Why anyone would want to spend 20 million dollars on a remake of The Wages of Fear, do it badly, and give it a misleading title is anybody's guess. The result is dire.\" Andrew Sarris in his July 18, 1977, review for The Village Voice summarized the film as \"a visual and aural textbook on everything that is wrong with current movies,\" as well as stating that the movie reset Friedkin's status to the beginning of his career, and compared him unfavourably to Clouzot, John Huston and David Lean, declaring that \"he has not come close to matching their craftsmanship.\" Robert C. Cumbow in the September 1977 issue of Movietone News also panned the film, criticizing camera placement as \"faulty\", which in his opinion led to substandard exposition. Moreover, he also deemed the film's editing \"ridiculous\" and thought Sorcerer lacked character involvement. John Marlowe of The Miami News assessed the movie's dialogues unfavourably, stating that \"Sorcerer's dialog is kept to such a minimum that not only you don't feel for these four losers, but you never really get to know them.\" He also considered the film's mixture of realist and surrealist moments as \"pain in the mind\". Peter Biskind described the film as \"self-consciously arty and pretentious [...] fatally trapped between America and Europe, commerce and art,\" claiming the end result represented \"the worst of both worlds\", as well as noting that the audience of the time was strikingly different from the one that adored The French Connection. Films Illustrated summarized Sorcerer as an inferior sequel, \"below the usual par\", in spite of the involvement of reputable lead actor Scheider and a \"topnotch director\", Friedkin. In the August 1997 issue of The Progressive, Kenneth Turan praised the movie's narrative set-up; however, he thought that in spite of it, it was impossible to attach oneself to the characters. He concluded the review by saying that with \"films like this, feeling is everything.\"Turan (1997), p. 39 One complaint was that some of the scene cuts were too abrupt.  Gene Siskel claimed that the characters \"seem to be a little cold\", as well as expressing an opinion that the special effects overpowered the protagonists."]}, {"page": "Exorcist II: The Heretic", "response": ["Leslie Halliwell described the film as a \"highly unsatisfactory psychic melodrama which ... falls flat on its face along some wayward path of metaphysical and religious fancy. It was released in two versions and is unintelligible in either\". Leonard Maltin described the film as a \"preposterous sequel ... Special effects are the only virtue in this turkey\". Steven Scheuer wrote, \"This may be the worst sequel in the history of film\". Danny Peary dismissed Exorcist II as \"absurd.\" In his 1984 book The Hollywood Hall of Shame, Michael Medved called the film \"a thoroughly wretched piece of work\", and added, \"Richard Burton is a laugh a minute\". Edward Margulies called the film a \"calamitious, head-scratching, sequel ... a rollicking mess\" and wondered \"whatever possessed them?\" The Blockbuster Entertainment Guide to Movies & Videos gave this film its lowest possible rating and dismissed its story as \"the expected demonic shenanigans\"."]}, {"page": "Days of Thunder", "response": ["Despite the film's commercial success, it received mixed reviews from critics who mostly shrugged off the sometimes over-the-top special effects and plot which greatly resembled the earlier Bruckheimer, Simpson, Scott and Cruise vehicle Top Gun, which had been hugely successful four years earlier. Halliwell's Film Guide dismissed Days of Thunder as \"An over familiar story rendered no more interestingly than usual\",Halliwell's Film Guide, Halliwell's Film Guide Leslie Halliwell, John Walker. HarperPerennial, 1996 (p. 288). while the Monthly Film Bulletin described it as \"simply a flashy, noisy star vehicle for Tom Cruise, one which – like the stock car he drives – goes around in circles getting nowhere\". It holds a rating of 38% on Rotten Tomatoes based on 65 reviews, with the site's consensus stating: \"Days of Thunder has Tom Cruise and plenty of flash going for it, but they aren't enough to compensate for the stock plot, two-dimensional characters, and poorly written dialogue.\" The film was nominated for the Academy Award for Best Sound (Charles M. Wilborn, Donald O. Mitchell, Rick Kline and Kevin O'Connell)."]}, {"page": "Bambi", "response": ["Today, however, Bambi is viewed as one of the greatest animated films ever made. On the review aggregator website Rotten Tomatoes, the film has an approval rating of 90% based on 52 reviews with an average rating of 8.30/10. The website consensus reads: \"Elegantly animated and deeply touching, Bambi is an enduring, endearing, and moving Disney classic.\" Critics Mick Martin and Marsha Porter call the film \"the crowning achievement of Walt Disney's animation studio\".Mick Martin,Marsha Porter DVD&Video Guide 2005.Ballantine 2004. English film historian Leslie Halliwell wrote that Bambi was \"one of Disney's most memorable and brilliant achievements with a great comic character in Thumper and a climactic forest fire sequence that is genuinely thrilling\". He concluded that it was  \"a triumph of the animator's arts.\""]}, {"page": "Star (classification)", "response": ["Critics have different ways of denoting the lowest rating when this is a \"zero\". Some such as Peter Travers display empty stars. Jonathan Rosenbaum and Dave Kehr use a round black dot. Leslie Halliwell uses a blank space. The Globe and Mail uses a \"0\", or as their former film critic dubbed it, the \"death doughnut\". Roger Ebert used a thumbs-down symbol. Other critics use a black dot.", "Critics also do not agree on what the lower ratings signify, let alone the lowest rating. While Maltin's and Scheuer's guides respectively explain that lowest rated films are \"BOMB(s)\" and \"abysmal\", British film critic Leslie Halliwell instead writes that no star \"indicates a totally routine production or worse; such films may be watchable but are at least equally missable.\" Like Halliwell and Dave Kehr, film critic Jonathan Rosenbaum believes one-star films have some merit, however unlike Halliwell, Rosenbaum believes that no stars indicate a \"worthless\" movie. Roger Ebert occasionally gave zero stars to films he deemed \"artistically inept and morally repugnant.\" Scheuer's guide calls \"one and a half star\" films \"poor\", and \"one star\" films \"bad\"."]}, {"page": "Richard Cromwell (actor)", "response": ["Leslie Halliwell in The Filmgoer's Companion, summed up Cromwell's enduring appeal when he described him as \"a leading man, [the] gentle hero of early sound films.\""]}, {"page": "The First of the Few", "response": ["Among modern critics, Leslie Halliwell wrote that the film is a \"low-key but impressive biopic with firm acting and good dialogue scenes. Production values slightly shaky.\" AllMovie noted that the film \"gets the essentials correct, and is surprisingly suspenseful for a bio-pic of this type\". Leonard Maltin gave the film three out of four stars, and called it a \"good biographical drama\"."]}, {"page": "List of University of Cambridge people", "response": ["*Leslie Halliwell (St Catharine's)"]}, {"page": "Kiss the Girls and Make Them Die", "response": ["The sole British cinema compiler to acknowledge the film, Leslie Halliwell in his 1985 Film and Video Guide 5th edition, gave no stars (Halliwell's top rating is 4), dismissing it as a \"[P]atchy James Bond spoof.\""]}, {"page": "A Message to Garcia", "response": ["There have been two movies based on the essay, both titled A Message to Garcia. The first, a silent movie made in 1916 by Thomas A. Edison, Inc., was directed by Richard Ridgely and featured Robert Conness, Mabel Trunnelle, and Charles Sutton. As noted on the Turner Classic Movie site, \"accuracy was not really a concern\". The second film was produced in 1936 by Twentieth Century Fox and directed by George Marshall. It featured John Boles as Andrew Rowan, Wallace Beery, Barbara Stanwyck,  Alan Hale, Herbert Mundin, Mona Barrie, and Enrique Acosta as Garcia—an \"agreeable embroidery\" according to Leslie Halliwell.Leslie Halliwell, Halliwell's Film Guide (New York: Harper Perennial, 1996) 755."]}, {"page": "Portrait of Jennie", "response": ["When Portrait of Jennie was released in December 1948, it was not a success, but today it is considered a classic in the fantasy genre For example, it was one of the top fifty Fantasy Films nominated by the AFI in 2008 -   with a 91% \"fresh\" rating on Rotten Tomatoes. Upon its release, The New York Times reviewer Bosley Crowther called it \"deficient and disappointing in the extreme;\" but the Variety reviewers found the story was \"told with style, taste and dignity.\"Variety Staff. \"Portrait of Jennie is an unusual screen romance. The story of an ethereal romance between two generations is told with style, taste and dignity.,\" Variety (Dec. 31, 1947). Later film critics have also given the film strong praise. Leslie Halliwell wrote that it was \"presented with superb persuasiveness by a first-class team of actors and technicians\".Halliwell's Film and Video Guide 1999 (1999), ed. J.Walker, p. 635."]}, {"page": "Dante's Inferno (1935 film)", "response": ["The film uses a conventional story of greed and dishonesty to project an image of the Inferno conjured up in Dante's 14th-century epic poem. Director Lachman had established a substantial reputation as a painter before embarking on a Hollywood career and he summoned his artistic vision to realise Dante's work in cinematographic form, drawing on the engravings of Gustave Doré. The film's reputation pivots on the 10 minute vision of the Inferno and reception has been mixed.  Leslie Halliwell described it as \"one of the most unexpected, imaginative and striking pieces of cinema in Hollywood's history,\" while Variety held that it was, \"a pushover for vigorous exploitation.\" "]}, {"page": "Loving You (1957 film)", "response": ["Leonard Maltin's Movie Guide rated Loving You with 2½ stars out of 4, the review declared: \"Elvis' second movie is highlighted by his performance of 'Teddy Bear' and the title tune\". Meanwhile, Steven H. Scheuer's Movies on TV lowered the rating to 2 stars out of 4. Scheuer opined that the film was \"tailor-made for Presley and his tunes, the story matters little—too little, if one doesn't dig Elvis\". Videohound's Golden Movie Retriever rated it with 2 bones out of 4. Michael Weldon, in  Psychotronic Encyclopedia of Film, gave a positive review: \"Elvis at his best, top-billed for the first time\". Leslie Halliwell, in his Film and Video Guide, felt the opposite, giving zero stars out of 4, and dismissed it as an \"empty-headed, glossy star vehicle\"."]}, {"page": "The Swarm (1978 film)", "response": ["The Sunday Times described The Swarm as \"simply the worst film ever made\",The worst movie ever? The Guardian, April 26, 2001. Retrieved February 4, 2014. while Time Out magazine called The Swarm a \"risibly inadequate disaster movie\".\"The Swarm\" Retrieved March 1, 2014. Leslie Halliwell called The Swarm a \"very obvious disaster movie with risible dialogue\", and suggested its commercial failure was partly due to the fact that prior to its release, several American television movies with similar plots had been broadcast. TV Guide said- 'The Swarm is a B movie in every sense of the term. Somehow disaster-movie king Allen convinced top Hollywood stars (including five Oscar winners) to appear in this nonsense'.The Swarm reviews at TV Guide"]}, {"page": "Tarzan, the Ape Man (1981 film)", "response": ["The film was widely panned upon its release. Film critic and historian Leonard Maltin considers this one of the worst films ever to appear in his popular TV, Movie and Video Guide (now simply Movie Guide): \"Deranged 'remake' lacks action, humor and charm; Forget about comparisons to Johnny Weissmuller; O'Keefe makes Elmo Lincoln seem like Edwin Booth.\"  Leslie Halliwell described Tarzan, the Ape Man as  \"certainly the worst of the Tarzan movies and possibly the most banal film so far made; even the animals give poor performances\". In a discussion of Tarzan films, Thomas S. Hischak was also negative: \"Produced and directed without a shred of talent by John Derek, Tarzan, the Ape Man often ranks high in the lists of the worst movies ever made\".Thomas S. Hischak, |American Literature on Stage and Screen: 525 Works and Their Adaptations McFarland, 2012.  (p. 237)."]}, {"page": "Green for Danger (film)", "response": ["The film has also been highly praised by critics. The Monthly Film Bulletin said: \"Though the story has plenty of improbabilities when considered in cold blood, this thriller holds one well when on the screen. Alastair Sim is most amusing as the self-important detective who enjoys tormenting his suspects, but who comes a partial cropper despite his assurance.\"Volume 14, No.157, January 1947, page 3 at Monthly Film Bulletin Leslie Halliwell noted that it was a \"classic comedy-thriller, with serious detection balanced by excellent jokes and performances, also by moments of fright\".Halliwell's Film and Video Guide 1999 (1999), ed. J.Walker, p. 338  François Truffaut later argued the film \"didn't quite come off\". The New York Times stated: \"Sidney Gilliat and Frank Launder have laid deftly humorous hands on the subject of murder. And, while they manage to keep the spectator chuckling most of the time, they never for a moment lose sight of a mystery film's prime purpose—that is, to intrigue and startle the onlooker.What more could one ask? In the case of Green For Danger one could reasonably request just a bit more justification for the solution, which, truth to tell, is bewildering.\"{{cite web |url=https://www.nytimes.com/1947/08/08/archives/green-for-danger-new-british-mystery-with-alastair-sim-as-detective.html |title=' Green for Danger,' New British Mystery, With Alastair Sim as Detective, Bill at Winter Garden -- Musical at the Globe |date=August 8, 1947"]}, {"page": "The Hallelujah Trail", "response": ["Among British references, Leslie Halliwell, in his Film and Video Guide (5th edition, 1985), gave no stars (Halliwell's top rating is 4), dismissing it as an \"[A]bsurdly inflated, prolonged, uninventive comedy western with poor narrative grip; all dressed up and nowhere to go\"."]}]}}