{"wiki_id": "http://www.wikidata.org/entity/Q182655", "itemLabel": "Rod Stewart", "itemDescription": "British singer", "wikipedia_url": "https://en.wikipedia.org/wiki/Rod_Stewart", "wikipedia_page": {"main": "Sir Roderick David Stewart  (born 10 January 1945) is a British rock and pop singer, songwriter, and record producer. Born and raised in London, he is of Scottish and English ancestry. With his distinctive raspy singing voice, Stewart is one of the best-selling music artists of all time, having sold over 250 million records worldwide. He has had 10 number-one albums and 31 top ten singles in the UK, 6 of which reached number one. Stewart has had 16 top ten singles in the US, with four reaching number one on the Billboard Hot 100. He was knighted in the 2016 Birthday Honours for services to music and charity.Stewart's music career began in 1962 when he took up busking with a harmonica. In 1963, he joined The Dimensions as harmonica player and vocalist. In 1964, Stewart joined Long John Baldry and the All Stars before moving to the Jeff Beck Group in 1967. Joining Faces in 1969, he also maintained a solo career releasing his debut album that same year. Stewart's early albums were a fusion of rock, folk music, soul music, and R&B.  His third album, 1971's Every Picture Tells a Story, was his breakthrough, topping the charts in the UK, US, Canada and Australia, as did its ballad \"Maggie May\". His 1972 follow-up album, Never a Dull Moment, also reached number one in the UK and Australia, while going top three in the US and Canada. Its single, \"You Wear It Well\", topped the chart in the UK and was a moderate hit elsewhere.\nAfter Stewart had a handful more UK top ten hits, the Faces broke up in 1975. Stewart's next few singles were ballads with \"Sailing\", off the 1975 UK and Australian number-one album, Atlantic Crossing, becoming a hit in the UK and the Netherlands (number one), Germany (number four) and other countries, but barely charting in North America. A Night on the Town (1976), his fifth straight chart-topper in the UK, began a three-album run of going number one or top three in North America, the UK and Australia with each release. That album's \"Tonight's the Night (Gonna Be Alright)\" spent almost two months at number one in the US and Canada, and made the top five in other countries. Foot Loose & Fancy Free (1977) contained the major hit \"You're In My Heart (The Final Acclaim)\" as well as the rocker \"Hot Legs\". Blondes Have More Fun (1978) and its disco-tinged \"Da Ya Think I'm Sexy\" both went to number one in Canada, Australia and the US, with \"Da Ya Think I'm Sexy\" also hitting number one in the UK and the top ten in other countries.  Stewart's albums regularly hit the upper rungs of the charts in the Netherlands throughout the 70s and in Sweden from 1975 onward.\nAfter a disco and new wave period in the late 1970s and early 1980s, Stewart's music turned to a soft rock/middle-of-the-road style, with most of his albums reaching the top ten in the UK, Germany and Sweden, but faring less well in the US. The single \"Rhythm of My Heart\" was a top five hit in the UK, US and other countries, with its source album, 1991's Vagabond Heart, becoming, at number ten in the US and number two in the UK, his highest-charting album in a decade. In 1993, he collaborated with Bryan Adams and Sting on the power ballad \"All for Love\", which went to number one in many countries. In the early 2000s, he released a series of successful albums interpreting the Great American Songbook. In 2008, Billboard magazine ranked him the 17th most successful artist on the \"Billboard Hot 100 All-Time Top Artists\". A Grammy and Brit Award recipient, he was voted at No. 33 in Q Magazine's list of the Top 100 Greatest Singers of all time  As a solo artist, Stewart was inducted into the US Rock and Roll Hall of Fame in 1994, the UK Music Hall of Fame in 2006, and he was inducted a second time into the US Rock and Roll Hall of Fame in 2012 as a member of Faces.", "link_mentions": [{"page": "Amazing Grace", "response": ["Aretha Franklin and Rod Stewart also recorded \"Amazing Grace\" around the same time, and both of their renditions were popular. All four versions were marketed to distinct types of audiences, thereby assuring its place as a pop song.Turner, p. 192. Johnny Cash recorded it on his 1975 album Sings Precious Memories, dedicating it to his older brother Jack, who had been killed in a mill accident when they were boys in Dyess, Arkansas. Cash and his family sang it to themselves while they worked in the cotton fields following Jack's death. Cash often included the song when he toured prisons, saying \"For the three minutes that song is going on, everybody is free. It just frees the spirit and frees the person.\""]}, {"page": "Alexis Korner", "response": ["In 1961, Korner and Davies formed Blues Incorporated,   initially a loose-knit group of musicians with a shared love of electric blues and R&B music. The group included, at various times, Charlie Watts, Jack Bruce, Ginger Baker, Long John Baldry, Graham Bond, Danny Thompson and Dick Heckstall-Smith. It also attracted a wider crowd of mostly younger fans, some of whom occasionally performed with the group, including Mick Jagger, Keith Richards, Brian Jones, Geoff Bradford, Rod Stewart, John Mayall and Jimmy Page."]}, {"page": "Banjo", "response": ["Six-string banjos known as banjo guitars basically consist of a six-string guitar neck attached to a bluegrass or plectrum banjo body, which allows players who have learned the guitar to play a banjo sound without having to relearn fingerings. This was the instrument of the early jazz great Johnny St. Cyr, jazzmen Django Reinhardt, Danny Barker, Papa Charlie Jackson and Clancy Hayes, as well as the blues and gospel singer Reverend Gary Davis. Today, musicians as diverse as Keith Urban, Rod Stewart, Taj Mahal, Joe Satriani, David Hidalgo, Larry Lalonde and Doc Watson play the six-string guitar banjo. They have become increasingly popular since the mid-1990s."]}, {"page": "Copacabana, Rio de Janeiro", "response": ["* On December 31, 1994, the New Year's Eve celebrations featured a Rod Stewart concert with an attendance of 3.5 million, making it the largest concert crowd ever. More recently, the beach has been a site for huge free concerts unrelated to the year-end festivities. On March 21, 2005, Lenny Kravitz performed there in front of 300,000 people, on a Monday night. On February 18, 2006, a Saturday, The Rolling Stones surpassed that mark by far, attracting over 1.5 million people to the beach.", "An assessment made during the New Year's Eve 1992 highlighted the risks associated with increasing crowd numbers on Copacabana beach after the fireworks display. Since the 1993-94 event concerts have been held on the beach to retain the public. The result was a success with egress spaced out over a period of 2 hours without the previous turmoil, although critics claimed that it denied the spirit of the New Year's tradition of a religious festival with fireworks by the sea. The following year Rod Stewart beat attendance records. Finally, the Tribute to Tom Jobim - with Gal Costa, Gilberto Gil, Caetano Veloso, Chico Buarque, and Paulinho da Viola - consolidated the shows at the Copacabana Réveillon."]}, {"page": "Disco", "response": ["At the height of its popularity, many non-disco artists recorded songs with disco elements, such as Rod Stewart with his \"Da Ya Think I'm Sexy?\" in 1979. Even mainstream rock artists adopted elements of disco. Progressive rock group Pink Floyd used disco-like drums and guitar in their song \"Another Brick in the Wall, Part 2\" (1979),It was producer Bob Ezrin's idea to incorporate a disco riff, as well as a second-verse children's choir, into \"Another Brick in the Wall, Part 2\". A few other Pink Floyd songs of the 1970s incorporated disco elements, especially songs like Part 8 of \"Shine On You Crazy Diamond\" (1975), \"Pigs (Three Different Ones)\" (1977), and \"Young Lust\" (1979), which all featured a funky, syncopated bass line. which became their only number-one single in both the US and UK. The Eagles referenced disco with \"One of These Nights\" (1975)Don Henley commented on \"One of These Nights\"'s disco connection in the liner notes of The Very Best Of, 2003. and \"Disco Strangler\" (1979), Paul McCartney & Wings with \"Silly Love Songs\" (1976) and \"Goodnight Tonight\" (1979), Queen with \"Another One Bites the Dust\" (1980), the Rolling Stones with \"Miss You\" (1978) and \"Emotional Rescue\" (1980), Stephen Stills with his album Thoroughfare Gap (1978), Electric Light Orchestra with \"Shine a Little Love\" and \"Last Train to London\" (both 1979), Chicago with \"Street Player\" (1979), the Kinks with \"(Wish I Could Fly Like) Superman\" (1979), the Grateful Dead with \"Shakedown Street\", The Who with \"Eminence Front\" (1982), and the J. Geils Band with \"Come Back\" (1980). Even hard rock group KISS jumped in with \"I Was Made For Lovin' You\" (1979),Paul Stanley, a guitarist for the rock group Kiss became friends with Desmond Child and, as Child remembered in Billboard, \"Paul and I talked about how dance music at that time didn't have any rock elements.\" To counteract the synthesized disco music dominating the airwaves, Stanley and Child wrote, \"I Was Made For Loving You.\" So, \"we made history,\" Child further remembered in Billboard, \"because we created the first rock-disco song.\"  and Ringo Starr's album Ringo the 4th (1978) features a strong disco influence.", "By the end of the 1970s, anti-disco sentiment developed among rock music fans and musicians, particularly in the United States.Encyclopedia of Contemporary American Culture, ,  (2001) p. 217: \"In fact, by 1977, before punk rock spread, there was a 'disco sucks' movement sponsored by radio stations that attracted some suburban white youth, who thought that disco was escapist, synthetic, and overproduced.\" Disco was criticized as mindless, consumerist, overproduced and escapist. Also see Encyclopedia of Contemporary American Culture, ,  (2001) p. 217. The slogans \"Disco sucks\" and \"Death to disco\" became common. Rock artists such as Rod Stewart and David Bowie who added disco elements to their music were accused of selling out.Robert Christgau: Pazz & Jop 1978: New Wave Hegemony and the Bebop Question  Robert Christgau for the Village Voice Pop & Jop Poll January 22, 1978, 1979"]}, {"page": "David Janssen", "response": ["David Janssen died of a sudden heart attack in the early morning of February 13, 1980, at his home in Malibu, California, at the age of 48. At the time of his death, Janssen was filming the television movie Father Damien. Janssen was buried at the Hillside Memorial Park Cemetery in Culver City, California. A non-denominational funeral was held at the Jewish chapel of the cemetery on February 17. Suzanne Pleshette delivered the eulogy at the request of Janssen's widow. Milton Berle, Johnny Carson, Tommy Gallagher, Richard Harris, Stan Herman, Rod Stewart and Gregory Peck were among Janssen's pallbearers. Honorary pallbearers included Jack Lemmon, George Peppard, James Stewart and Danny Thomas."]}, {"page": "England", "response": ["In popular music, many English bands and solo artists have been cited as the most influential and best-selling musicians of all time. Acts such as The Beatles, Led Zeppelin, Pink Floyd, Elton John, Queen, Rod Stewart, David Bowie, The Rolling Stones and Def Leppard are among the highest-selling recording artists in the world. Many musical genres have origins in (or strong associations with) England, such as British invasion, progressive rock, hard rock, Mod, glam rock, heavy metal, Britpop, indie rock, gothic rock, shoegazing, acid house, garage, trip hop, drum and bass and dubstep.."]}, {"page": "Electric Light Orchestra", "response": ["The band was then rejoined by Kaminski, Clark and Morgan, adding Martin Smith on bass guitar, and proceeded to perform a small number of live ELO performances in 1986, including shows in England and Germany along with US appearances on American Bandstand, Solid Gold, then at Disneyland that summer. The Birmingham Heart Beat Charity Concert 1986 was a charity concert organised by Bevan in ELO's hometown of Birmingham on 15 March 1986, and ELO performed. A hint of Lynne's future was seen when George Harrison appeared onstage during the encore at Heartbeat, joining in the all-star jam of \"Johnny B. Goode\". ELO's last performance for several years occurred on 13 July 1986 in Stuttgart, Germany playing as opening act to Rod Stewart. With Lynne no longer under contractual obligation to attend further scheduled performances, ELO effectively disbanded after that final show in Stuttgart in 1986, but there was no announcement made of it for the next two years, during which George Harrison's Lynne-produced album Cloud Nine and the pair's follow-up (with Roy Orbison, Bob Dylan and Tom Petty as Traveling Wilburys) Traveling Wilburys Vol. 1 were released."]}, {"page": "Fleetwood Mac", "response": ["Fleetwood Mac were formed in July 1967 in London, England, when Peter Green left the British blues band John Mayall & the Bluesbreakers. Green had previously replaced guitarist Eric Clapton in the Bluesbreakers and had received critical acclaim for his work on their album A Hard Road. Green had been in two bands with Mick Fleetwood, Peter B's Looners and the subsequent Shotgun Express (which featured a young Rod Stewart as vocalist), and suggested Fleetwood as a replacement for drummer Aynsley Dunbar when Dunbar left the Bluesbreakers to join the new Jeff Beck/Rod Stewart band.Brunning, B (1998): Fleetwood Mac – The First 30 Years. London: Omnibus Press. p18 John Mayall agreed and Fleetwood joined the Bluesbreakers."]}, {"page": "John Peel", "response": ["Peel was an occasional presenter of Top of the Pops on BBC1 from the late 1960s until the 1990s, and in particular from 1982 to 1987 when he appeared regularly. In 1971 he appeared not as presenter but performer, alongside Rod Stewart and the Faces, pretending to play mandolin on \"Maggie May\". He often presented the BBC's television coverage of music events, notably the Glastonbury Festival.", "After separation from his first wife, Peel's personal life began to stabilise, as he found friendship and support from new Top Gear producer John Walters—and from his girlfriend Sheila Gilhooly, whom he identified on-air as \"the Pig\". Peel married Sheila on 31 August 1974. The reception was in London's Regent's Park, with Walters as best man. Peel wore Liverpool football colours (red) and walked down the aisle to the song \"You'll Never Walk Alone\". Their sheepdog, Woggle, served as a bridesmaid. Rod Stewart and Graham Chapman attended."]}, {"page": "January 10", "response": ["*  1945   – Rod Stewart, British singer-songwriter"]}, {"page": "Jeffrey Archer", "response": ["When Saddam Hussein suppressed Kurdish uprisings in 1991, Archer, with the Red Cross, set up the charity Simple Truth, a fundraising campaign on behalf of the Kurds. In May 1991, Archer organised a charity pop concert, starring Rod Stewart, Paul Simon, Sting and Gloria Estefan, who all performed free of charge. Archer stated that his charity had raised £57,042,000, though it was later reported that only £3 million came from the Simple Truth concert and appeal, the rest from aid projects sponsored by the British and other governments, with significant amounts pledged before the concert. The charity would later incur further controversy. Having been previously rejected, Archer was made a life peer on 27 July 1992 as Baron Archer of Weston-super-Mare, of Mark in the County of Somerset. Prime Minister John Major recommended him largely because of Archer's role in aid to the Kurds. Archer and Major had been friends for a number of years."]}, {"page": "Kevin Spacey", "response": ["Kevin Spacey Fowler was born in South Orange, New Jersey, to Kathleen Ann (née Knutson), a secretary, and Thomas Geoffrey Fowler, a technical writer and data consultant.(1990), Fowler, Kevin Spacey\", in  Spacey has an older brother, Randy Fowler, who is a limousine driver and Rod Stewart impersonator in Boise, Idaho, and a sister, Julie Ann Fowler Keir, an office worker. His family relocated to Southern California when he was four years old. Randy Fowler (from whom Spacey is estranged) has stated that their father, whom he described as a racist \"Nazi supporter\", was sexually and physically abusive, and that Spacey had shut down emotionally and become \"very sly and smart\" to avoid whippings."]}, {"page": "London", "response": ["London has numerous venues for rock and pop concerts, including the world's busiest indoor venue, The O2 Arena and Wembley Arena, as well as many mid-sized venues, such as Brixton Academy, the Hammersmith Apollo and the Shepherd's Bush Empire. Several music festivals, including the Wireless Festival, South West Four, Lovebox, and Hyde Park's British Summer Time are all held in London. The city is home to the original Hard Rock Cafe and the Abbey Road Studios, where The Beatles recorded many of their hits. In the 1960s, 1970s and 1980s, musicians and groups like Elton John, Pink Floyd, Cliff Richard, David Bowie, Queen, The Kinks, The Rolling Stones, The Who, Eric Clapton, Led Zeppelin, The Small Faces, Iron Maiden, Fleetwood Mac, Elvis Costello, Cat Stevens, The Police, The Cure, Madness, The Jam, Ultravox, Spandau Ballet, Culture Club, Dusty Springfield, Phil Collins, Rod Stewart, Adam Ant, Status Quo and Sade, derived their sound from the streets and rhythms of London."]}, {"page": "Jonathan Smeeton", "response": ["*1980s: REO Speedwagon; Al Jarreau; WHAM!; Journey; Graham Nash; Rod Stewart; The Pointer Sisters; Tina Turner; Mike Oldfield; Jefferson Airplane; Sheila E; Mike and the Mechanics; Yoko Ono; The Thompson Twins; The Pet Shop Boys; Peter Gabriel; Amnesty International; Tears for Fears; George Michael; Paul Simon; Lou Reed; Miles Davis."]}, {"page": "Music radio", "response": ["This preference for younger listeners caused the decline of the \"Big Band\" or \"Standards\" music formats that covered music from the 1930s to the 1950s.  As the audience grew too old for advertisers, the radio stations that carried these formats saw a sharp loss of ratings and revenue.  This left them with no choice but to adopt more youthful formats, though the Standards format (also known as the Great American Songbook from the series of albums produced by rocker Rod Stewart) has undergone something of an off-air revival, with artists such as Stewart, Tony Bennett and Queen Latifah putting their own interpretation on the music."]}, {"page": "Rock music", "response": ["The origins of glam rock are associated with Marc Bolan, who had renamed his folk duo to T. Rex and taken up electric instruments by the end of the 1960s. Often cited as the moment of inception is his appearance on the BBC music show Top of the Pops in March 1971 wearing glitter and satins, to perform what would be his second UK Top 10 hit (and first UK Number 1 hit), \"Hot Love\".Mark Paytress, Bolan – The Rise And Fall of a 20th Century Superstar (Omnibus Press 2002) , pp. 180–181. From 1971, already a minor star, David Bowie developed his Ziggy Stardust persona, incorporating elements of professional make up, mime and performance into his act.P. Auslander, \"Watch that man David Bowie: Hammersmith Odeon, London, July 3, 1973\" in I. Inglis, ed., Performance and Popular Music: History, Place and Time (Aldershot: Ashgate, 2006), , p. 72. These performers were soon followed in the style by acts including Roxy Music, Sweet, Slade, Mott the Hoople, Mud and Alvin Stardust. While highly successful in the single charts in the United Kingdom, very few of these musicians were able to make a serious impact in the United States; Bowie was the major exception becoming an international superstar and prompting the adoption of glam styles among acts like Lou Reed, Iggy Pop, New York Dolls and Jobriath, often known as \"glitter rock\" and with a darker lyrical content than their British counterparts.P. Auslander, \"Watch that man David Bowie: Hammersmith Odeon, London, July 3, 1973\" in Ian Inglis, ed., Performance and Popular Music: History, Place and Time (Aldershot: Ashgate, 2006), , p. 80. In the UK the term glitter rock was most often used to refer to the extreme version of glam pursued by Gary Glitter and his support musicians the Glitter Band, who between them achieved eighteen top ten singles in the UK between 1972 and 1976.D. Thompson, \"Glitter Band\" and S. Huey, \"Gary Glitter\", in Bogdanov et al., 2002, p. 466. A second wave of glam rock acts, including Suzi Quatro, Roy Wood's Wizzard and Sparks, dominated the British single charts from about 1974 to 1976. Existing acts, some not usually considered central to the genre, also adopted glam styles, including Rod Stewart, Elton John, Queen and, for a time, even the Rolling Stones. It was also a direct influence on acts that rose to prominence later, including Kiss and Adam Ant, and less directly on the formation of gothic rock and glam metal as well as on punk rock, which helped end the fashion for glam from about 1976. Glam has since enjoyed sporadic modest revivals through bands such as Chainsaw Kittens, the DarknessR. Huq, Beyond Subculture: Pop, Youth and Identity in a Postcolonial World (Abingdon: Routledge, 2006), , p. 161. and in R&B crossover act Prince.P. Auslander, Performing Glam Rock: Gender and Theatricality in Popular Music (Ann Arbor, MI: University of Michigan Press, 2006), , p. 227."]}, {"page": "Star Trek: Enterprise", "response": ["The franchise was known for typically using orchestral themes, but Berman said that the theme tune would be more \"contemporary\" than heard in previous series and a \"little hipper\". The theme was revealed to be a cover of the Rod Stewart single \"Faith of the Heart\", by British tenor Russell Watson. Stewart's song had originally appeared on the soundtrack to the 1998 film Patch Adams. For the use in Enterprise, it was retitled to \"Where My Heart Will Take Me\", but prompted a negative reaction from existing Star Trek fans. These included an online petition to have the song removed, and there was a protest held outside of Paramount Studios. Executive producers Braga and Berman both defended the choice, with Berman saying that the fan response was split over the song while Braga said that some people found the song \"uplifting\". The U2 song 'Beautiful Day' had been used as a temp track on the test reels before \"Faith of the Heart\" was chosen."]}, {"page": "Super Bowl XXIII", "response": ["At the end of NBC's telecast, they played Rod Stewart's \"Forever Young\" against highlights of the past few months of sporting events to air on the network: The Summer Olympics from Seoul, the World Series between the Los Angeles Dodgers and Oakland Athletics, the Fiesta Bowl between the Notre Dame Fighting Irish and West Virginia Mountaineers, and finally Super Bowl XXIII. And then during the closing credits, NBC used the instrumental tune \"Everglade Run\" by Yanni."]}, {"page": "Sex Pistols", "response": ["With the official UK record chart for Jubilee week about to be released, the Daily Mirror predicted that \"God Save the Queen\" would be number one. As it turned out, the record placed second, behind the Rod Stewart single \"I Don't Want to Talk About It\" in its fourth week at the top. Many believed that the record had actually qualified for the top spot, but that the chart had been rigged to prevent a spectacle. McLaren later claimed that CBS Records, which was distributing both singles, told him that the Sex Pistols were actually outselling Stewart two to one. There is evidence that an exceptional directive was issued by the British Phonographic Institute, which oversaw the chart-compiling bureau, to exclude sales from record-company operated shops such as Virgin's for that week only.Savage, Jon, England's Dreaming, pp. 364–365; "]}, {"page": "Tom Waits", "response": ["Waits recorded his eighth studio album, Rain Dogs, at the RCA Studios in mid 1985. Waits called the album \"kind of an interaction between Appalachia and Nigeria\". Keith Richards played on several tracks; Richards later acknowledged Waits's encouragement of his first solo album, Talk is Cheap. The filmmaker Jean-Baptiste Mondino directed a music video of the Rain Dogs track \"Downtown Train\". The song was subsequently covered by Patty Smyth in 1987, and later by Rod Stewart, where it reached the top five in 1990. In 1985, Rolling Stone magazine named Waits its \"Songwriter of the Year\", and in 2003 it would rank Rain Dogs among the 500 Greatest Albums of All Time. In September 1985, his son Casey was born. Waits assembled a band and went on tour, kicking it off in Scotland in October before proceeding around Europe and then the US. He changed the setlist for each performance; most of the songs chosen were from his two Island albums.", "Many different musicians have covered his songs. In 1995, Holly Cole released an album of Waits's covers, Temptations, while in 2008 Scarlett Johansson did the same with her debut album, Anywhere I Lay My Head. Bruce Springsteen had a commercial success with his cover of Waits's “Jersey Girl\", as did Rod Stewart with his covers of Waits tracks \"Downtown Train\" and \"Tom Traubert's Blues\". Johnny Cash covered \"Down There by the Train\" on his 1994 album, American Recordings, calling Waits \"a very special writer, my kind of writer\". Willie Nelson included a cover of a Waits track on his album, It Always Will Be. The Ramones covered \"I Don't Wanna Grow Up\" on their final album, Adios Amigos, while Bob Seger covered \"Blind Love\",\"New Coat of Paint\", and \"Downtown Train\", and Norah Jones included a song Waits wrote for her, \"Long Way Home\", on her album Feels Like Home. Singer-songwriter Tori Amos included a cover of Waits's song \"Time\" on her 2001 cover album Strange Little Girls; she performed the song on the David Letterman Show, the first musical performance on the show after 9/11."]}, {"page": "The Rolling Stones", "response": ["The Stones needed a new guitarist, and the recording sessions for the next album, Black and Blue (1976) (No. 2 in the UK, No. 1 in the US), in Munich provided an opportunity for some guitarists hoping to join the band to work while trying out. Guitarists as stylistically disparate as Peter Frampton and Jeff Beck were auditioned as well as Robert A. Johnson and Shuggie Otis. Both Beck and Irish blues rock guitarist Rory Gallagher later claimed they had played without realising they were being auditioned. American session players Wayne Perkins and Harvey Mandel also tried out, but Richards and Jagger preferred for the band to remain purely British. When Ronnie Wood auditioned, everyone agreed he was the right choice. He had already recorded and played live with Richards, and had contributed to the recording and writing of the track \"It's Only Rock 'n Roll\". He had declined Jagger's earlier offer to join the Stones, because of his commitment to the Faces, saying \"that's what's really important to me\". Faces' lead singer Rod Stewart went so far as to say he would take bets that Wood would not join the Stones."]}, {"page": "United Kingdom", "response": ["The Beatles have international sales of over 1 billion units and are the biggest-selling and most influential band in the history of popular music. Other prominent British contributors to have influenced popular music over the last 50 years include The Rolling Stones, Pink Floyd, Queen, Led Zeppelin, the Bee Gees, and Elton John, all of whom have worldwide record sales of 200 million or more. The Brit Awards are the BPI's annual music awards, and some of the British recipients of the Outstanding Contribution to Music award include; The Who, David Bowie, Eric Clapton, Rod Stewart, The Police, and Fleetwood Mac (who are a British-American band).\"Brit awards winners list 2012: every winner since 1977\". The Guardian (London). Retrieved 28 February 2012. More recent UK music acts that have had international success include George Michael, Oasis, Spice Girls, Radiohead, Coldplay, Arctic Monkeys, Robbie Williams, Amy Winehouse, Adele, Ed Sheeran, One Direction and Harry Styles."]}, {"page": "Summerfest", "response": ["| Rod Stewart ||  "]}, {"page": "1960s", "response": ["* Rod Stewart"]}, {"page": "1970s", "response": ["* Rod Stewart"]}, {"page": "1945", "response": ["** Rod Stewart, British rock singer"]}, {"page": "1979", "response": ["* January 9 – The Music for UNICEF Concert is held at the United Nations General Assembly to raise money for UNICEF and promote the Year of the Child. It is broadcast the following day in the United States and around the world. Hosted by the Bee Gees, other performers include Donna Summer, ABBA, Rod Stewart and Earth, Wind & Fire. A soundtrack album is later released."]}, {"page": "Stevie Nicks", "response": ["Rod Stewart and Nicks co-headlined The Heart and Soul tour. Launched March 20, 2011, in Fort Lauderdale, Florida, the tour united the two singers for a series of arena concerts throughout North America – with performances in New York, Toronto, Los Angeles, Philadelphia, Chicago, Detroit, Tampa, Montreal, and more.", "Nicks joined Rod Stewart in the summer of 2012 for another leg of the Heart and Soul tour, and resumed the In Your Dreams tour in June 2012."]}, {"page": "Mick Fleetwood", "response": ["Keyboard player Peter Bardens lived only a few doors away from Fleetwood's first home in London, and upon hearing of the proximity of an available drummer, Bardens gave Fleetwood his first gig in Bardens' band the Cheynes in July 1963, thus seeding the young drummer's musical career. It would take him from the Cheynes—with whom he supported early gigs by the Rolling Stones and the Yardbirds—to stints in the Bo Street Runners, where he replaced original drummer Nigel Hutchinson, who had enjoyed brief television fame on Ready Steady Go!. However, by April 1965, when Fleetwood joined the band, it was fading into obscurity. By February 1966, Bardens, who had left the group, called on Fleetwood to join his new band, the Peter Bs, which soon expanded to become Shotgun Express (with Rod Stewart). Peter Green, who was a guitarist in the Peter Bs,  left to  join John Mayall & the Bluesbreakers, followed  by  Fleetwood in April 1967. His  new  band already featured John McVie."]}, {"page": "Todd Rundgren", "response": ["Hermit of Mink Hollow was released in May 1978. Popularly viewed as his most immediately accessible work since Something/Anything?, it received more public attention and radio airplay than most of Rundgren's efforts since A Wizard, a True Star and was heralded as a \"return to form\" after the string of prog records with Utopia. In the US, the LP peaked at number 36, while single \"Can We Still Be Friends\" reached number 29. The song became Rundgren's most-covered, with versions by Robert Palmer, Rod Stewart, Colin Blunstone, and Mandy Moore. To promote the work, Rundgren undertook an American tour playing at smaller venues including The Bottom Line in New York and The Roxy in Los Angeles. These shows resulted in the double live album Back to the Bars, which featured a mixture of material from his solo work and Utopia, performed with backing musicians including Utopia,  "]}, {"page": "Glam rock", "response": ["The UK charts were inundated with glam rock acts from 1971 to 1975. The March 1971 appearance of T. Rex frontman Marc Bolan on the BBC's music show Top of the Pops, wearing glitter and satins, is often cited as the beginning of the movement. Other British glam rock artists include David Bowie, Mott the Hoople, Sweet, Slade, Mud, Roxy Music and Gary Glitter. Those not central to the genre, such as Elton John, Rod Stewart and Freddie Mercury of Queen, also adopted glam styles. In the United States the scene was much less prevalent, with Alice Cooper and Lou Reed the only American artists to score a hit. Other American glam artists include New York Dolls, Sparks, Suzi Quatro, Iggy Pop and Jobriath. It declined after the mid-1970s, but influenced other musical genres including punk rock, glam metal, New Romantic, deathrock and gothic rock.", "In the UK, the term glitter rock was most often used to refer to the extreme version of glam pursued by Gary Glitter and the independent band with whom he often performed known as the Glitter Band. The Glitter Band and Gary Glitter had between them eighteen top ten singles in the UK between 1972 and 1975.V. Bogdanov, C. Woodstra and S. T. Erlewine, All Music Guide to Rock: the Definitive Guide to Rock, Pop, and Soul (Milwaukee, WI: Backbeat Books, 3rd edn., 2002), , p. 466. A second wave of glam rock acts, including Suzi Quatro, Roy Wood's Wizzard and Sparks, had hits on the British single charts in 1973 and 1974. Quatro directly inspired the pioneering Los Angeles based all-girl group The Runaways.P. Auslander, Performing Glam Rock: Gender and Theatricality in Popular Music (Ann Arbor, MI: University of Michigan Press, 2006), , pp. 222-3. Existing acts, some not usually considered central to the genre, also adopted glam styles, including Rod Stewart, Elton John, Queen and, for a time, The Rolling Stones. After seeing Marc Bolan wearing Zandra Rhodes-designed outfits, Freddie Mercury enlisted Rhodes to design costumes for the next Queen tour in 1974. Punk rock, often seen as a reaction to the artifice of glam rock, but using some elements of the genre, including makeup and involving cover versions of glam rock records,S. Frith and A. Goodwin, On Record: Rock, Pop, and the Written Word (Pantheon Books, 1990), , p. 88. helped end the fashion for glam from about 1976."]}, {"page": "Robbie Williams", "response": ["On 22 November, Williams released his first Christmas album titled The Christmas Present, which features guest appearances from boxer Tyson Fury, Rod Stewart, Jamie Cullum, Helene Fischer and Bryan Adams. The album debuted at number two on the UK Charts behind Coldplay's Everyday Life. The album sold over 67,000 copies, which is identical sales to his previous studio album release The Heavy Entertainment Show, Williams also sold over 10,000 cassettes in 7 days, which is the most in two decades. The following week saw Williams' album go to #1 in the UK, outselling the nearest competitor Rod Stewart by 5,000 copies. This was Williams' 13th UK number one album, tying Elvis Presley for the most UK number one albums."]}, {"page": "Bonnie Tyler", "response": ["In February 2019, Tyler released “Hold On” as the lead single from her seventeenth studio album, Between the Earth and the Stars. Produced by David Mackay, the album features duets with Rod Stewart, Francis Rossi and Cliff Richard, with songs written by Barry Gibb and Amy Wadge, among others.", "Tyler's music contains elements of country, rock, pop, blues and Celtic. Her voice has been likened to Rod Stewart and Kim Carnes as a result of her vocal cord nodule operation in the 1970s, sometimes even being referred to as \"the female Rod Stewart,\" and, after her collaborations with Jim Steinman, \"the female Meat Loaf.\" Soon after her operation, when recording her second album, Natural Force, the studio band complimented Tyler's changed voice. Reviewers from AllMusic have described Tyler's voice as \"inimitable,\" \"wonderfully gritty,\" and an \"effective instrument\" for drawing notice to her first managers, Ronnie Scott and Steve Wolfe."]}, {"page": "Wiesbaden", "response": ["*Wiesbaden's Bowling Green has been very popular in recent years since various open-air concerts have been held there by artists like Elton John (2009, 2011 & 2019), Rod Stewart (2009), Eric Clapton (2008), R.E.M. (2003), Sting (2001), Bryan Adams (2000), Simply Red (1999), José Carreras (1992), and Luciano Pavarotti (1993). Lionel Richie and Plácido Domingo (2nd time in Wiesbaden) have also performed there."]}, {"page": "Led Zeppelin (album)", "response": ["The album was advertised in selected music papers under the slogan \"Led Zeppelinthe only way to fly\". It initially received poor reviews. In a stinging assessment, Rolling Stone magazine asserted that the band offered \"little that its twin, the Jeff Beck Group, didn't say as well or better three months ago… to fill the void created by the demise of Cream, they will have to find a producer, editor and some material worthy of their collective talents\", calling Page a \"limited producer\" and criticizing his writing skills. It also called Plant \"as foppish as Rod Stewart, but nowhere near so exciting\". Because of the bad press, Led Zeppelin avoided talking to them throughout their career. Eventually, their reputation as a good live band recovered by word-of-mouth."]}, {"page": "Coventry", "response": ["* Coventry Building Society Arena: located  north of the city centre, the 32,600 capacity sports stadium which is home to the city's only professional football team Coventry City, who play in the second tier of English football, and is also used to hold major rock concerts for some of the world's biggest acts, including Oasis, Bon Jovi, Coldplay, Lady Gaga, Rod Stewart, Kings of Leon and the Red Hot Chili Peppers. It was also one of the venues chosen for the footballing events at the 2012 Olympic Games. The adjacent Jaguar Exhibition Hall is a 6,000-seat events venue for hosting a multitude of other acts."]}, {"page": "Deep Purple", "response": ["In March 1968, Lord, Blackmore, Simper and Woodman moved into Deeves Hall, a country house in South Mimms, Hertfordshire.Dafydd Rees, Luke Crampton (1999). \"Rock stars encyclopedia\" p.279. DK Publishing.Frame, Pete (2000). \"Pete Frame's Rocking Around Britain\" p.54. Music Sales Group, 2000 The band would live, write and rehearse at the house; it was fully kitted out with the latest Marshall amplification and, at Lord's request, a Hammond C3 organ. According to Simper, \"dozens\" of singers were auditioned (including Rod Stewart and Woodman's friend Dave Curtiss) until the group heard Rod Evans of club band the Maze, and thought his voice fitted their style well. Tagging along with Evans was his band's drummer Ian Paice. Blackmore had seen an 18-year-old Paice on tour with the Maze in Germany in 1966, and had been impressed by his drumming. The band hastily arranged an audition for Paice, given that Woodman was vocally unhappy with the direction of the band's music. Both Paice and Evans won their respective jobs, and the line-up was complete.Welch, Chris. \"The Story of Deep Purple.\" In Deep Purple: HM Photo Book, copyright 1983, Omnibus Press."]}, {"page": "Ella Fitzgerald", "response": ["In 2012, Rod Stewart performed a \"virtual duet\" with Ella Fitzgerald on his Christmas album Merry Christmas, Baby, and his television special of the same name."]}, {"page": "Richard Lloyd (guitarist)", "response": ["When Lloyd was in his middle teens, he met a fellow guitarist from Brooklyn named Velvert Turner. Turner claimed he knew Jimi Hendrix. Per Turner, Hendrix considered Turner his \"little brother\", and took him on as his protégé, inviting him to various clubs and teaching him guitar from Hendrix's apartment on W 12th St. As Turner and Lloyd were best friends, Turner asked for permission to teach Lloyd what he was learning, and so Lloyd and Turner began practicing together under the teaching auspice of Hendrix. Lloyd frequently attended Hendrix's shows, as well as those of other well-known acts such as Led Zeppelin, The Who, The Jeff Beck Group with Rod Stewart, The Allman Brothers Band, and the Grateful Dead."]}, {"page": "Ben Elton", "response": ["His second compilation musical was Tonight's the Night, based on the songs of Rod Stewart, which opened in London's West End in November 2003."]}]}}