{"wiki_id": "http://www.wikidata.org/entity/Q18298305", "itemLabel": "John Meiklejohn", "itemDescription": "Meiklejohn, John Miller Dow (1836-1920), writer of school books", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Meiklejohn", "wikipedia_page": {"main": "John Miller Dow Meiklejohn (; 11 July 1836 – 5 April 1902) was a Scottish academic, journalist and author known for writing school books.", "link_mentions": [{"page": "Matthew Fontaine Maury Meiklejohn", "response": ["Meiklejohn was the son of Professor John Meiklejohn, of the University of St. Andrews, and was educated at Madras College and Fettes College. He was 28 years old, and a captain in the 2nd Battalion, The Gordon Highlanders, British Army during the Second Boer War when the following deed took place at the Battle of Elandslaagte for which he was awarded the VC."]}, {"page": "Louise Chandler Moulton", "response": ["One of Moulton's most appreciative, scholastic, and discriminating critics was Professor John Meiklejohn. He has said with authority that she deserved to be classed with the best Elizabethan lyricists in her lyrics,—with Robert Herrick and Thomas Campion and Shakespeare,—while in her sonnets she might rightly take a place with John Milton and William Wordsworth and Christina Rossetti. \"I cannot tell you how keen and great enjoyment (sometimes even rapture),\" he wrote her, \"I have got out of your exquisite lyrics.\" In a series of \"Notes,\" following the poems, line by line, he asserted that the poet won her success by the simplest means and plainest words, as true genius always does, and that her pages were full of emotional and imaginative meaning, Nature and Poetry uniting in an indissoluble whole; and Shelley himself, he said, would have been proud to own certain of the lines. The poem \"Quest\" he found so beautiful that, in his own words, it was \"difficult to speak of it in perfectly measured and unexaggerated language.\" Of the poem \"Wife to Husband\" he said that \"the tenderness, the sweet and compelling rhythm, are worthy of the best Elizabethan days.\" The sonnet, \"A Summer's Growth,\" \"unites,\" he says, the \"passion of such Italian poets as Dante with the imagination of modern English.\" This was in relation to her first volume, \"Swallow Flights\"; and in conclusion he said: \"This poet must look for her brothers in the sixteenth and seventeenth centuries among the noble and intense lyrists. Her insight, her subtlety, her delicacy, her music, are hardly matched, and certainly not surpassed by Herrick or Campion or Crashaw or Carew or Herbert or Vaughan.\""]}, {"page": "John Miller Dow Meiklejohn", "response": ["#REDIRECT John Meiklejohn"]}, {"page": "J. M. D. Meiklejohn", "response": ["#REDIRECT John Meiklejohn"]}, {"page": "Meiklejohn, John", "response": ["#redirectJohn Meiklejohn"]}]}}