{"wiki_id": "http://www.wikidata.org/entity/Q18207163", "itemLabel": "Mark Gleghorne", "itemDescription": "British field hockey player", "wikipedia_url": "https://en.wikipedia.org/wiki/Mark_Gleghorne", "wikipedia_page": {"main": "Mark Gleghorne (born 19 May 1985) is a field hockey player from Northern Ireland who has represented Ireland, England and Great Britain at international level. He represented Great Britain at the 2016 Summer Olympics. Gleghorne was a member of the England teams that won the bronze medals at the 2014 and 2018 Commonwealth Games and at the 2017 Men's EuroHockey Nations Championship. He also represented England at the 2014 and 2018 Men's Hockey World Cups. At club level, Gleghorne was a member of the Instonians team that won the Irish Senior Cup in both 2002 and 2004. He was also a member of the Punjab Warriors team that won the 2016 Hockey India League title. Gleghorne is a member of a family of field hockey internationals. His younger brother, Paul, is an Ireland international. Two of his aunts, Margaret Gleghorne and Jackie McWilliams, were also Ireland and Great Britain women's internationals.", "link_mentions": [{"page": "Instonians", "response": ["* Mark Gleghorne", "* Mark Gleghorne", "* Mark Gleghorne", "* Mark Gleghorne; field hockey – 2016"]}, {"page": "Great Britain men's national field hockey team", "response": ["*Mark Gleghorne"]}, {"page": "Jackie McWilliams", "response": ["McWilliams worked as a schoolteacher at Ballymena Primary School.  She also helped coach both the Ulster women's field hockey team  and Ballymena Academy.  Two of McWilliams' nephews are senior men's field hockey internationals. Her sister, Anne, is the mother of Paul and Mark Gleghorne. Paul has played for Ireland while his brother, Mark has played for Ireland, England and Great Britain. "]}, {"page": "HC 's-Hertogenbosch", "response": ["* Mark Gleghorne", "* Mark Gleghorne"]}, {"page": "Ireland men's national field hockey team", "response": ["* Mark Gleghorne – 2016"]}, {"page": "Ulster Hockey Union", "response": ["* Mark Gleghorne", "* Mark Gleghorne", "* Mark Gleghorne"]}, {"page": "Men's field hockey Qualifying Tournaments for the 2008 Summer Olympics", "response": ["| Mark Gleghorne"]}, {"page": "Beeston Hockey Club", "response": ["* Mark Gleghorne", "* Mark Gleghorne", "* Mark Gleghorne"]}, {"page": "Mumbai Magicians", "response": ["|style=\"text-align:left\"|Mark Gleghorne"]}, {"page": "Punjab Warriors", "response": ["|style=\"text-align:left\"|Mark Gleghorne "]}, {"page": "2014 Hockey India League players' auction", "response": ["|  Mark Gleghorne"]}, {"page": "List of 2014 Hockey India League team rosters", "response": ["|style=\"text-align:left\"|Mark Gleghorne"]}, {"page": "Hockey at the 2014 Commonwealth Games", "response": ["| George Pinner Iain Lewers Daniel Fox Barry Middleton Henry Weir Ashley Jackson Simon Mantell Harry Martin Michael Hoare David Condon Mark Gleghorne Phil Roper Ollie Willars Adam Dixon Alastair Brogdon Nicholas Catlin "]}, {"page": "England at the 2014 Commonwealth Games", "response": ["*Mark Gleghorne"]}]}}