{"wiki_id": "http://www.wikidata.org/entity/Q1820771", "itemLabel": "Leslie Banks", "itemDescription": "actor (1890-1952)", "wikipedia_url": "https://en.wikipedia.org/wiki/Leslie_Banks", "wikipedia_page": {"main": "Leslie James Banks CBE (9 June 1890 – 21 April 1952) was an English stage and screen actor, director and producer, now best remembered for playing gruff, menacing characters in black-and-white films of the 1930s and 1940s, but also the Chorus in Laurence Olivier's wartime version of Henry V.", "link_mentions": [{"page": "April 21", "response": ["*1952 – Leslie Banks, American actor, director and producer (b. 1890)"]}, {"page": "June 9", "response": ["*1890 – Leslie Banks, English actor, director, and producer (died 1952)"]}, {"page": "1952", "response": ["** Leslie Banks, British actor (b. 1890)"]}, {"page": "Goodbye, Mr. Chips", "response": ["Barbara Burnham adapted the book for a stage production in three acts, which was first performed at the Shaftesbury Theatre on 23 September 1938, with Leslie Banks as Mr. Chips and Constance Cummings as his wife Katherine. It ran for over 100 performances until 14 January 1939."]}, {"page": "Peter Lorre", "response": ["Michael Newton wrote in an article for The Guardian in September 2014 of his scenes with Leslie Banks in the film: \"Lorre cannot help but steal each scene; he's a physically present actor, often, you feel, surrounded as he is by the pallid English, the only one in the room with a body.\"Michael Newton \"Peter Lorre: master of the macabre\", The Guardian, September 12, 2014 After his first two American films, Lorre returned to England to feature in Hitchcock's Secret Agent (1936).Philip French \"Peter Lorre: a great screen actor remembered\", The Observer, August 31, 2014. Lorre and his first wife, actress Celia Lovsky, boarded a Cunard liner in Southampton on July 18, 1934, to sail for New York a day after shooting had been completed on The Man Who Knew Too Much, having gained visitor's visas to the United States."]}, {"page": "Robert Donat", "response": ["He had the title role in the film The Young Mr. Pitt (1942) for 20th Century Fox and played Captain Shotover in a new staging of Heartbreak House at the Cambridge Theatre in London from 1942 to 1943. For MGM British he starred in the film The Adventures of Tartu (1943), with Valerie Hobson. Donat wanted to play the Chorus in Olivier's Henry V, but the role went to Leslie Banks."]}, {"page": "Charles James Fox", "response": ["* Leslie Banks in the 1947 film Mrs. Fitzherbert"]}, {"page": "Michael Redgrave", "response": ["Redgrave joined the Royal Navy as an ordinary seaman in July 1941, () but was discharged on medical grounds in November 1942.Redgrave provided his friend the actor and writer Godfrey Winn (also in the Navy at the time), with a memorable signal his ship made. The aircraft carrier HMS Illustrious was in collision with another carrier, HMS Formidable in poor weather visibility in the Atlantic, after the collision Illustrious signalled: \"If you touch me in that place again, I shall scream\".  Having spent most of 1942 in the Reserve he managed to direct Lifeline (Norman Armstrong) starring Frank Pettingell at the Duchess Theatre in July; and The Duke in Darkness (Patrick Hamilton) starring Leslie Banks at the St James's Theatre in October, also taking the role of Gribaud.The Great Stage Stars, Sheridan Morley, and Who's Who in the Theatre 1981"]}, {"page": "War and Peace", "response": ["* The BBC Home Service broadcast an eight-part adaptation by Walter Peacock from 17 January to 7 February 1943 with two episodes on each Sunday. All but the last instalment, which ran for one and a half hours, were one hour long. Leslie Banks played Pierre while Celia Johnson was Natasha."]}, {"page": "Equity (British trade union)", "response": ["* 1948: Leslie Banks"]}, {"page": "1933 in music", "response": ["* I Am Suzanne, starring Lilian Harvey, Gene Raymond and Leslie Banks. Directed by Rowland V. Lee."]}, {"page": "List of years in television", "response": ["*  1938: DuMont Laboratories manufactures and sells the first all-electronic television sets to the public. Baird gives the first public demonstration of color projection television. The BBC broadcasts the world's first ever television science fiction (R.U.R.), and television crime series (Telecrime); in one of the lengthiest experimental television broadcasts, the BBC broadcasts a 90-minute version of Edmond Rostand's Cyrano de Bergerac, starring Leslie Banks, Constance Cummings, and James Mason."]}, {"page": "1952 in film", "response": ["*April 21 – Leslie Banks, actor (born 1890), The Most Dangerous Game, Jamaica Inn"]}, {"page": "1942 in film", "response": ["*The Big Blockade, starring Leslie Banks, Michael Redgrave and Will Hay – (UK)", "*Went the Day Well?, directed by Cavalcanti, starring Leslie Banks and Mervyn Johns – (GB)"]}, {"page": "1941 in film", "response": ["*Cottage to Let, directed by Anthony Asquith, starring Leslie Banks, Alastair Sim, John Mills – (GB)"]}, {"page": "1940 in film", "response": ["*Dead Man's Shoes, directed by Thomas Bentley, starring Leslie Banks – (GB)"]}, {"page": "1935 in film", "response": ["*Trans-atlantic Tunnel, starring Richard Dix and Leslie Banks (GB)"]}, {"page": "1934 in film", "response": ["*The Man Who Knew Too Much, directed by Alfred Hitchcock, starring Leslie Banks, Edna Best and Peter Lorre – (GB)", "*Red Ensign, starring Leslie Banks – (GB)"]}, {"page": "1932 in film", "response": ["*The Most Dangerous Game, starring Joel McCrea, Fay Wray, Leslie Banks and Robert Armstrong, involving much of the same cast and crew of the following year's King Kong."]}, {"page": "Lost in the Stars", "response": ["A Broadway revival opened at the Imperial Theatre on April 18, 1972, and closed on May 20 after 39 performances and 8 previews. Directed by Gene Frankel with choreography by Louis Johnson, the cast featured Rod Perry as Leader, Brock Peters as Stephen Kumalo, Leslie Banks as James Jarvis, and Rosetta LeNoire as Grace Kumalo. Peters was nominated for the Tony Award Best Actor in a Musical and the Drama Desk Award Outstanding Performance; Gilbert Price was nominated for the Tony Award Best Featured Actor in a Musical.", "* James Jarvis – Leslie Banks"]}, {"page": "Will Hay", "response": ["During Hay's tenure with Ealing he was credited as a director in three of his films, The Black Sheep of Whitehall, The Goose Steps Out and My Learned Friend. In all three, he co-directed with Basil Dearden. In 1942, he starred in a short information film, Go to Blazes alongside Thora Hird and Muriel George. The film was set during the Blitz and his role was a dim-witted father who tried unsuccessfully to defuse a bomb which had landed near his house, the bomb is only defused through the help of his daughter, portrayed by Hird. Also in 1942, he made an appearance in the propaganda film, The Big Blockade among other prolific actors of the time, including Leslie Banks, John Mills and Michael Redgrave."]}, {"page": "West Derby", "response": ["Well known residents of West Derby have include William Lassell who built an observatory at his house \"Starfield\" in West Derby, a suburb of Liverpool. There he had a 24-inch (610 mm) reflector telescope, for which he pioneered the use of an equatorial mount for easy tracking of objects as the Earth rotates.  Others include Shakespearian actor Leslie Banks, the Beatles' first drummer Pete Best, who lived in Haymans Green, the home of the Casbah Club, where members of the future Beatles—John Lennon, Paul McCartney, and George Harrison, along with Ken Brown, as the Quarry Men—were the original house band; Herbert Haresnape, Olympic swimmer 1908, 1912, Bill Shankly the Liverpool F.C. football manager, whose house overlooked Bellefield; Carla Lane the scriptwriter lived close by, as did Eddie Braben, the scriptwriter for Morecambe and Wise, Bessie Braddock the Liverpool Exchange Division MP and Olympic bronze medal boxer, David Price. Albert Menotti Haynes was born and lived in West Derby, he worked as a railway clerk before emigrating to Argentina and founded the Editorial Haynes publishing empire; he and his wife were also involved in founding Northlands School.  Trent Alexander-Arnold of Liverpool F.C. was born in West Derby near the Melwood Training Centre."]}, {"page": "Noël Coward Theatre", "response": ["revival of Romeo and Juliet which had the longest run on record for that play: 186 performances. Peggy Ashcroft played Juliet and Edith Evans was the Nurse; Laurence Olivier played Romeo, and Gielgud Mercutio for the first part of the run and then exchanged roles. Gielgud concluded with Chekhov's The Seagull, directed by Theodore Komisarjevsky, a production that, according to The Times showed the play as \"among the supreme masterpieces of the theatre\".\"New Theatre\", The Times, 21 May 1936, p. 14 After Gielgud's tenure there was more Shakespeare at the New: As You Like with Edith Evans and Michael Redgrave; The Taming of the Shrew with Evans and Leslie Banks; and Macbeth with Olivier and Judith Anderson (all 1937)."]}, {"page": "The Most Dangerous Game", "response": ["The story has been adapted numerous times, most notably as the 1932 RKO Pictures film The Most Dangerous Game, starring Joel McCrea and Leslie Banks, and for a 1943 episode of the CBS Radio series Suspense, starring Orson Welles. It has been called the \"most popular short story ever written in English.\" Upon its publication, it won the O. Henry Award. "]}, {"page": "Todd Duncan", "response": ["In 1938, Duncan appeared on the London stage at the Theatre Royal, Drury Lane in C.B.Cochran's musical production The Sun Never Sets. The cast included fellow American Adelaide Hall, Leslie Banks, Edna Best and Stewart Granger. The musical was adapted by Pat Wallace and Guy Bolton from various stories written by Edgar WallaceSpectator review 16 June 1938 (retrieved 19 December 2014): http://archive.spectator.co.uk/article/17th-june-1938/16/stage-and-screen and the show included original music by Cole Porter. Costumes were designed by Elizabeth Haffenden.The Sun Never Sets costume designs are in the Drury Lane Design Collection archive: (retrieved 19 December 2014): by http://archiveshub.ac.uk/data/gb71-thm/86 One of the numbers Duncan sang was 'River God'. After the London run closed, Duncan and Adelaide Hall from the original cast toured Britain with the production.Newspaper article about Adelaide Hall's imminent tour of Britain in The Sun Never Sets (retrieved 19 December 2014: https://news.google.com/newspapers?nid=2238&dat=19380827&id=DRAmAAAAIBAJ&sjid=ov0FAAAAIBAJ&pg=5109,781553"]}, {"page": "Debt of Honour", "response": ["Debt of Honour is a 1936 British drama film directed by Norman Walker and starring Leslie Banks, Will Fyffe, Geraldine Fitzgerald and Garry Marsh. Based on a story by Sapper, and scripted by Tom Geraghty and Cyril Campion, the film is also known as The Man Who Could Not Forget.Debt of Honour (1936), BFI.", "* Leslie Banks as Major Jimmie Stanton"]}, {"page": "The Small Back Room", "response": ["* Leslie Banks as Colonel A.K. Holland"]}, {"page": "Henry V. Esmond", "response": ["His plays were also well received in the United States where nine of them were produced on Broadway between 1899 and 1907. For the next Broadway production, Eliza Comes to Stay, Esmond travelled to New York to appear alongside his wife and the popular actor Leslie Banks. This proved to be the greatest success of his career. He continued writing, acting and touring until his sudden death in Paris caused by pneumonia.\"Death of Mr H. V. Esmond\", The Times, 18 April 1922, p. 12 He is buried in the Old Cemetery of Saint-Germain-en-Laye near Paris.Cimetières de France et d'ailleurs"]}, {"page": "List of people from Merseyside", "response": ["* Leslie Banks: Actor"]}, {"page": "Madeleine Smith", "response": ["Smith's story was the basis for several plays including the distinguished David Lean film Madeleine (1950), starring Ann Todd, Ivan Desny and Leslie Banks. Jack House's book Square Mile of Murder (1961), which contains a section on Smith, formed the basis for a BBC television version in 1980. A television play based upon the case, Killer in Close-Up: The Trial Of Madeleine Smith, written by George F. Kerr, was also produced by Sydney television station ABN-2, broadcast on 13 August 1958."]}, {"page": "Went the Day Well?", "response": ["*Leslie Banks as Oliver Wilsford, the treacherous squire"]}, {"page": "The Arsenal Stadium Mystery", "response": ["The film is a murder mystery set, as the title suggests, at the Arsenal Stadium, Highbury, London, then the home of Arsenal Football Club, who were at the time one of the dominant teams in English football. The backdrop is a friendly match between Arsenal and The Trojans, a fictitious amateur side. One of the Trojans' players drops dead during the match and when it is revealed he has been poisoned, suspicion falls on his teammates as well as his former mistress. Detective Inspector Slade (Leslie Banks) is called in to solve the crime.", "*Leslie Banks as Insp. Anthony Slade "]}, {"page": "The Man Who Knew Too Much (1934 film)", "response": ["The Man Who Knew Too Much is a 1934 British thriller film directed by Alfred Hitchcock, featuring Leslie Banks and Peter Lorre, and released by Gaumont British. It was one of the most successful and critically acclaimed films of Hitchcock's British period.", "Bob and Jill Lawrence (Leslie Banks and Edna Best), a British couple on a trip to Switzerland with their daughter Betty (Nova Pilbeam), befriend Frenchman Louis Bernard (Pierre Fresnay), who is staying at their hotel. Jill is participating in a clay pigeon shooting contest. She reaches the final but loses to a male sharpshooter, Ramon (Frank Vosper), because at the crucial moment she is distracted by a chiming watch belonging to Abbott (Peter Lorre).", "* Leslie Banks as Bob Lawrence"]}, {"page": "Zoltan Korda", "response": ["In London, he made his English-language directorial debut with the sound drama Men of Tomorrow (1932). He gained wide respect for the adventure film Sanders of the River (1935), starring the American actor Paul Robeson and Leslie Banks. The film proved a significant commercial and critical success, giving Korda the first of his four nominations for \"Best Film\" at the Venice Film Festival. Korda and Robert Flaherty won the Venice festival's \"Best Director\" award for Elephant Boy (1937)."]}, {"page": "Barré Lyndon", "response": ["Born in London, he may be best remembered for his stage play The Man in Half Moon Street, which opened at London's New Theatre on 22 March 1939 and ran for 172 performances, starring Leslie Banks, Malcolm Keen and Ann Todd,Blood on the Stage, 1925-1950: Milestone Plays of Crime, Mystery, and Detection: An Annotated Repertoire by Amnon Kabatchnik, 2009 as well as for three screenplays from the 1940s: The Lodger (1944), Hangover Square (1945) and The Man in Half Moon Street (1945). The last was remade by Hammer Film Productions in 1959 as The Man Who Could Cheat Death."]}, {"page": "Jamaica Inn (film)", "response": ["* Leslie Banks as Joss Merlyn", "Besides Laughton and O'Hara, secondary characters are played by several notable stage-and-screen character actors of the time, including \"bruiser-type\" actor Leslie Banks (who played Count Zaroff in The Most Dangerous Game) as Joss Merlyn, and Robert Newton as Jem Trehearne, a suave young secret-police agent."]}, {"page": "Fire Over England", "response": ["Elizabeth's chief advisers are the Lord Treasurer, Lord Burleigh (Morton Selten), and her longtime admirer, Robert Dudley, Earl of Leicester (Leslie Banks). Burleigh's 18-year-old granddaughter Cynthia (Vivien Leigh) is one of Elizabeth's ladies-in-waiting, and the ageing queen is plagued by jealousy of the girl's beauty and vivacity.", "* Leslie Banks as 'Robin', the Earl of Leicester"]}, {"page": "List of film adaptations of Cyrano de Bergerac", "response": ["* Cyrano de Bergerac (1938 film), a live television adaptation starring James Mason and Leslie Banks"]}, {"page": "Madeleine (1950 film)", "response": ["Madeleine is a 1950 British film noir directed by David Lean, based on a true story of Madeleine Smith, a young Glasgow woman from a wealthy family who was tried in 1857 for the murder of her lover, Emile L'Angelier. The trial was much publicised in the newspapers of the day and labelled \"the trial of the century\". Lean's adaptation of the story starred his wife, Ann Todd, with Ivan Desny as her character's French lover. Norman Wooland played the respectable suitor and Leslie Banks the authoritarian father, both of whom are unaware of Madeleine's secret life. Lean made the film primarily as a \"wedding present\" to Todd, who had previously played the role onstage. He was never satisfied with the film and cited it as his least favourite feature-length movie.", "* Leslie Banks as Mr. James Smith"]}, {"page": "Red Ensign (film)", "response": ["*Leslie Banks as David Barr"]}, {"page": "The Most Dangerous Game (1932 film)", "response": ["The Most Dangerous Game is a 1932 American pre-Code horror film, directed by Irving Pichel and Ernest B. Schoedsack, starring Joel McCrea, Fay Wray and Leslie Banks. The movie is an adaptation of the 1924 short story of the same name by Richard Connell; it is the first film version of the story. The plot concerns a big game hunter who deliberately strands a group of luxury yacht passengers on a remote island where he can hunt them for sport. The producing team included Ernest B. Schoedsack and Merian C. Cooper, co-directors of King Kong (1933). The film was shot at night on the King Kong jungle sets."]}, {"page": "The Big Blockade", "response": ["The Big Blockade is a 1942 British black-and-white war propaganda film in the style of dramatised documentary. It is directed by Charles Frend and stars Will Hay, Leslie Banks, Michael Redgrave and John Mills. It was produced by Michael Balcon for Ealing Studios, in collaboration with the Ministry of Economic Warfare. It intersperses actual film footage with sections of acting.", "*Leslie Banks as Taylor, Civil Service"]}, {"page": "Kathleen Warner", "response": ["Kathleen Davis was also in the cast of the 1936 play about Toussaint Louverture by C. L. R. James (her friend from Trinidad) that was staged in London's West End starring Robeson.Christian Høgsbjerg, Introduction to Toussaint Louverture: The Story of the Only Successful Slave Revolt in History – A Play in Three Acts by C. L. R. James, Duke University Press, 2013, p. 18. In addition she acted in several films, including in a leading role in Debt of Honour (1936), starring Leslie Banks."]}, {"page": "Banks (surname)", "response": ["*Leslie Banks, British actor and director"]}]}}