{"wiki_id": "http://www.wikidata.org/entity/Q1827788", "itemLabel": "Lisa St Aubin de Terán", "itemDescription": "novelist", "wikipedia_url": "https://en.wikipedia.org/wiki/Lisa_St_Aubin_de_Ter%C3%A1n", "wikipedia_page": {"main": "Lisa St Aubin de Terán (born 2 October 1953) is an English novelist, writer of autobiographical fictions, and memoirist. Her father was the Guyanese writer Jan Carew.", "link_mentions": [{"page": "Granta", "response": ["*Lisa St Aubin de Terán"]}, {"page": "John Llewellyn Rhys Prize", "response": ["|1983 || Lisa St Aubin de Terán || The Slow Train to Milan || "]}, {"page": "James Allen's Girls' School", "response": ["* Lisa St Aubin de Terán (born 1953), author (briefly )"]}, {"page": "Saint-Aubin", "response": ["* Lisa St Aubin de Terán (b. 1953), English novelist"]}, {"page": "George MacBeth", "response": ["He resigned from the BBC to take up novel-writing; he introduced a series of thrillers involving the spy, Cadbury.  In his later post-BBC years, after divorcing his first wife, he married the novelist Lisa St Aubin de Terán, with whom he had a child, Alexander Morton George MacBeth. After a divorce, he moved with his new wife, Penny, to Ireland to live at Moyne Park, Abbeyknockmoy, near Tuam in County Galway. A few months later, George MacBeth was diagnosed as suffering from motor neurone disease, of which he died in early 1992. In the last poetry he wrote, MacBeth provides an anatomy of a cruel disease and the destruction it caused two people deeply in love. Penny and George had two children, Diana (\"Lally\") Francesca Ronchetti MacBeth and George Edward Morton Mann MacBeth."]}, {"page": "Jan Carew", "response": ["Jan Carew died at his home in Louisville, Kentucky, USA, at the age of 92,\"Renown Guyanese author Jan Carew dies\", Guyana Chronicle Online, 8 December 2012. survived by his widow Dr Joy Gleason,Eusi Kwayana, \"Jan Carew - Mission Within the Mission\", ChickenBones: A Journal. his daughters Lisa St Aubin de TeránLisa St Aubin de Terán, Memory Maps, 2002. and Shantoba Eliza Carew, and his son, David Christopher Carew.Obituary: Jan R. Carew, The Courier-Journal, 9 December 2012."]}, {"page": "1985 in poetry", "response": ["* Lisa St Aubin de Terán, The High Place"]}, {"page": "1983 in poetry", "response": ["* Eric Gregory Award: Martin Stokes, Hilary Davies, Michael O'Neill, Lisa St Aubin de Terán, Deidre Shanahan"]}, {"page": "Lisa St Aubin de Teran", "response": ["#REDIRECT Lisa St Aubin de Terán"]}, {"page": "Ed Victor", "response": ["*Lisa St Aubin de Terán"]}, {"page": "Lisa St Aubin de Téran", "response": ["#REDIRECT Lisa St Aubin de Terán"]}, {"page": "Great Railway Journeys", "response": ["|#2.5 || \"Santos to Santa Cruz\" || 1994-02-10 || Lisa St Aubin de Terán || Brazil, Bolivia"]}, {"page": "Lisa Saint Aubin de Terán", "response": ["#REDIRECT Lisa St Aubin de Terán"]}, {"page": "Lisa Saint Aubin de Teran", "response": ["#REDIRECT Lisa St Aubin de Terán"]}, {"page": "Lisa St Aubin De Teran", "response": ["#REDIRECT Lisa St Aubin de Terán"]}, {"page": "Robbie Duff Scott", "response": ["His work has been described by The Independent as: Stuffed, late-Victorian style, with symbolic properties: images of fading youth, broken glass, spent matches, images of absence and restlessness, patterns in the dust where there was once a picture or a key, abandoned fruit, images of weather and forest and sea creeping into the brittle urban lives of his traumatised dames.Walsh, John. \"The Arts: The melancholy of anatomy\" The Independent, 18 October 2000. Retrieved from findarticles.com, 2 March 2009.He was the third husband of author, Lisa St Aubin de Terán and from the mid 1980s they lived in various parts of Italy, settling eventually in Umbria where their daughter Florence was born.", "In 1982 he received a letter from the poet George Macbeth, who had seen a painting of Duff-Scott's at The National Portrait Gallery (Self portrait on a chaise-longue). Macbeth wrote asking him if he would paint a portrait of his wife, the novelist Lisa St Aubin de Terán, whom Duff-Scott eventually married.Walsh, John. \"The Arts: The melancholy of anatomy\" The Independent, 18 October 2000. Retrieved from findarticles.com, 2 March 2009.", "He was the third husband of author, Lisa St Aubin de Terán and from the mid 1980s they lived in various parts of Italy, settling eventually in Umbria. Duff-Scott features prominently in his former wife's autobiographical work, ′′A Valley in Italy: Confessions of a House Addict′′,https://www.amazon.co.uk/Valley-Italy-Confessions-House-Addict/dp/0241132347 describing her experience of restoring their dilapidated palazzo, deep in the Umbrian hills."]}, {"page": "Bloomsbury Classics", "response": ["*Keepers of the House by Lisa St Aubin de Terán"]}, {"page": "Hacienda (disambiguation)", "response": ["* The Hacienda (book), a 1988 memoir by Lisa St Aubin de Terán"]}, {"page": "Keepers of the House", "response": ["Keepers of the House is the debut novel of Lisa St Aubin de Terán, published as The Long Way Home in the US. The novel is autobiographicalGeoffrey Elborn, \"Lisa St. Aubin de Teran Biography\" jrank.org., and set in a Venezuelan valley beset by drought. First published in 1982 by Jonathan Cape it won the Somerset Maugham Award."]}, {"page": "Lisa St. Aubin De Teran", "response": ["#REDIRECT Lisa St Aubin de Terán"]}, {"page": "Jonathan Boardman", "response": ["Since 2018 he has been Vicar of St Paul's Church, Clapham.Parish web-site His book Rome, A Cultural and Literary History, with a foreword by Lisa St Aubin de Terán was published by Signal Books (Revised Second Edition 2006) ."]}, {"page": "The Bay of Silence", "response": ["The Bay of Silence is a 2020 internationally co-produced thriller film directed by Paula van der Oest from a screenplay by Caroline Goodall, based on the 1986 novel of the same name by Lisa St Aubin de Terán. It stars Claes Bang, Olga Kurylenko, Alice Krige, Assaad Bouab and Brian Cox.", "In April 2018, it was announced Claes Bang, Olga Kurylenko and Brian Cox had joined the cast of the film, with Paula van der Oest directing from a screenplay by Caroline Goodall, based upon the novel of the same name by Lisa St Aubin de Terán."]}, {"page": "List of women writers (M–Z)", "response": ["*Lisa St Aubin de Terán (b. 1953, England), nv. & mem."]}]}}