{"wiki_id": "http://www.wikidata.org/entity/Q18391195", "itemLabel": "Ross MacGibbon", "itemDescription": "British ballet dancer", "wikipedia_url": "https://en.wikipedia.org/wiki/Ross_MacGibbon", "wikipedia_page": {"main": "Ross MacGibbon (born 29 January 1955) is a British former ballet dancer, and now a film maker, especially for ballet and opera.\nRoss MacGibbon danced with the Royal Ballet from 1973-86.MacGibbon's won the 1998 International Emmy Award for his film of Kenneth MacMillan's final ballet, The Judas Tree.", "link_mentions": [{"page": "Peter and the Wolf", "response": ["| Ross MacGibbon, director (video)"]}, {"page": "Kenneth MacMillan", "response": ["| Wayne Eagling, Alessandra Ferri, Stephen Jefferies, Guy Niblett, David Drew, Jonathan Burrows, Jonathan Cope, Antony Dowson, Ross MacGibbon, Bruce Sansom, Stephen Sheriff"]}, {"page": "Jonathan Burrows (choreographer)", "response": ["*The Far End of the Garden. A profile of choreographer Jonathan Burrows (film, dir. Ross MacGibbon, A Beaulieu Films production for BBC Television and Arts Council Films, 1991)"]}, {"page": "The Dancer's Body", "response": ["The executive producer of the series was Ross MacGibbon; the series producer was Robert Eagle. The directors included Andy King-Dabbs, Diana Hill and Deborah May."]}, {"page": "Romeo and Juliet (MacMillan)", "response": ["Since then it has been live streamed and recorded multiple times, the most recent of which being the 2012 filmed production of the ballet starring Lauren Cuthbertson and Federico Bonelli, filmed by Ross MacGibbon.MacGibbon, 2012 A 90-minute abridgment by writer-producers (and dancers) Michael Nunn and William Trevitt for BBC television was broadcast in 2020 on PBS Great Performances."]}, {"page": "List of films based on Romeo and Juliet", "response": ["* Romeo and Juliet with the Royal Ballet (2007); TV broadcast of a stage production of Kenneth MacMillan's ballet to Prokofiev's score, from the Royal Opera House; directed by Ross MacGibbon (UK)"]}, {"page": "List of Elstree Studios productions", "response": ["| The Art of Touch || Ballet || || Ross MacGibbon || Siobhan Davies Dance Co."]}, {"page": "List of LGBT-related films of 2012", "response": ["| Swan Lake || Ross MacGibbon, Matthew Bourne || United States || Drama, musical || Richard Winsor, Dominic North, Nina Goldman, Madelaine Brennan, Steve Kirkham, Joseph Vaughan ||A modern interpretation of Tchaikovsky's ballet Swan Lake, with replacing the female corps de ballet with male dancers and filmed in 3D"]}, {"page": "Gloria (ballet)", "response": ["The first performance was at the Royal Opera House, Covent Garden on 13 March 1980. The lead roles were danced by Wayne Eagling, Jennifer Penney, Julian Hosking and Wendy Ellis. The soprano soloist was Teresa Cahill; the conductor was Ashley Lawrence; designs (scenery and costumes) were by Andy Klunder,Percival, John. \"Gloria\", The Times, 14 March 1980, p. 13 with lighting by Bill Besant.Gloria. About the House, Vol.5, No.12, Summer 1980, p18-19. Also named among the first cast were Ross MacGibbon, Ashley Page, Fiona Chadwick and Genesia Rosato."]}, {"page": "Different Drummer (ballet)", "response": ["* Ross MacGibbon"]}, {"page": "Isadora (ballet)", "response": ["* Ross MacGibbon – Man on the Beach"]}, {"page": "List of John Hurt performances", "response": ["| Ross MacGibbon"]}]}}