{"wiki_id": "http://www.wikidata.org/entity/Q1833409", "itemLabel": "Richard Phillips", "itemDescription": "American painter", "wikipedia_url": "https://en.wikipedia.org/wiki/Richard_Phillips_(American_painter)", "wikipedia_page": {"main": "Richard Phillips (born 1962) is an American artist. He was born in Marblehead, Massachusetts, and lives in New York City. In the 1990s he worked at the Guggenheim Museum as an art handler. He paints in a photo-realistic or hyper-realistic style. \nPhillips created a Sasha Grey short film for the Gagosian Gallery in 2011, and a Sasha Grey portrait for the Frieze Art Fair in 2013. In 2013 he collaborated with Playboy magazine to create a roadside installation near Marfa, Texas: he mounted a black-painted 1970s muscle car on an inclined concrete plinth beside a large symbol from the magazine. The installation was later moved. Phillips's first exhibition in a museum was at Dallas Contemporary in 2014.", "link_mentions": [{"page": "Visionaire", "response": ["They first curated shows for their former SoHo offices, including works by Inez & Vinoodh, Alex Katz, Vivienne Westwood and Malcolm McLaren, and Richard Phillips. The 2006 show “Megazines” displayed back issues of current and out-of-print independent publications."]}, {"page": "Richard Phillips", "response": ["Richard Phillips may refer to:", "*Richard Phillips (American painter) (born 1962), artist from the United States", "*Richard Phillips (athlete) (born 1983), sprinter from Jamaica", "*Richard Phillips (chemist) (1778–1851), British chemist", "*Richard Phillips (English painter) (1681–1741), London portrait painter", "*Richard Phillips (merchant mariner) (born 1955), captain of the MV Maersk Alabama taken hostage by Somali pirates in April 2009", "*Richard Phillips (MP) (c. 1640–1720), British Member of Parliament for Ipswich", "*Sir Richard Phillips (publisher) (1767–1840),  British author and publisher, founder of the Monthly Magazine"]}, {"page": "Days Go By (Dirty Vegas song)", "response": ["\"Days Go By\" is a song by British electronic band Dirty Vegas from their self-titled first album. The single artwork was done by American artist Richard Phillips. The song was released in the United Kingdom on 7 May 2001 as the group's debut single, when it initially peaked at number 27 on the UK Singles Chart."]}, {"page": "Dirty Vegas (album)", "response": ["The album features the radio hit \"Days Go By\" which was also used in a commercial for the Mitsubishi Eclipse and in the video game, DDRMAX2: Dance Dance Revolution. The album artwork is done by American artist Richard Phillips."]}, {"page": "Massachusetts College of Art and Design", "response": ["* Richard Phillips (painter)"]}, {"page": "First Impressions of Earth", "response": ["*\"Scout\" by Richard Phillips"]}, {"page": "Dallas Contemporary", "response": ["thumb|251x251px|Richard Phillips' Playboy Marfa sculpture, installed at Dallas Contemporary, 2014-2017", "Landmark exhibitions have featured renowned artists such as Nic Nicosia (2006); Vernon Fisher (2009); James Gilbert (2010); Michel Verjux (2011); Juergen Teller (2011); Rob Pruitt (2011); Inez Van Lamsweerde and Vinoodh Matadin (2012); Walter Van Beirendonck (2013); Richard Phillips (2014); Julian Schnabel (2014); Mario Testino (2014); Nate Lowman (2015); Nadia Kaabi-Linke (2015); David Salle (2015); and Yoshitomo Nara (2021)."]}, {"page": "Peter Doroshenko", "response": ["In the last twenty-five years, Doroshenko has organized exhibitions including: Michaël Borremans, Ross Bleckner, Candice Breitz, Maurizio Cattelan, Francesco Clemente, Dan Colen, Sam Durant, Eric Fischl, Dominique Gonzales-Foerster, Meschac Gaba, Kendell Geers, Loris Gréaud, Andreas Gursky, Pierre Huyghe, Luisa Lambri, Ange Leccia, John McCracken, Boris Mikhailov, Mariko Mori, Philippe Parreno, João Penalva, Richard Phillips, Bojan Sarcevic, Kimsooja, David Salle, Julian Schnabel, Pascal Marthine-Tayou, Juergen Teller, Barthélémy Toguo, Salla Tykka, Sam Taylor-Johnson, Piotr Uklanski, and Liu Xiaodong."]}, {"page": "Lindsay Lohan", "response": ["Lohan had not appeared on Saturday Night Live since 2006, when she hosted the show for the fourth time in March 2012. Her appearance received mixed to negative reviews. Critics appreciated the self-deprecating references to her personal troubles, but also commented that she largely played a supporting role. The episode had the second highest ratings of the season with 7.4 million viewers. In May 2012, Lohan appeared briefly, as a celebrity judge, on the television series Glee, in the episode \"Nationals.\" Lohan stars as a surfer in the art film First Point by artist Richard Phillips. It debuted at Art Basel in June 2012 and features a score by Thomas Bangalter from Daft Punk. Comments from critics on Lohan's work were mixed.Lohan starred as Elizabeth Taylor in the biographical made-for-TV movie Liz & Dick, which premiered on the Lifetime cable channel in November 2012. Reviews of Lohan's performance were largely, but not unanimously, negative. The Hollywood Reporter said she was \"woeful\" while Variety called her \"adequate.\" Entertainment Weekly described the premiere ratings of 3.5 millions as \"a little soft.\" During the production, paramedics were called to Lohan's hotel room, treating her for exhaustion and dehydration. In April 2013, the horror comedy Scary Movie 5 was released, where Lohan appears as herself alongside Charlie Sheen in the opening sketch. While the movie itself was panned by critics, a few reviewers found Lohan's and Sheen's to be one of the better scenes. Lohan also guest-starred as herself in an April 2013 episode of Sheen's comedy series Anger Management."]}, {"page": "Sasha Grey", "response": ["In 2010, Grey was one of four actors who appeared in  Julião Sarmento's video installation Leporello and was featured in the Richardson magazine A4. Richard Phillips made a short film called Sasha Grey in the Chemosphere for the Gagosian Gallery in 2011 and also portrayed her for the Frieze Art Fair in 2013. Hypocrite Design described Sasha Grey in the film as a \"perpetually evolving figure\". In an interview with Allure in 2018, Grey said her look was \"definitely punk-inspired, definitely the anti-aesthetic, and I've definitely grown out of that because I'm older\"."]}, {"page": "Tamaryn", "response": ["In May 2011, Tamaryn's song \"Cascades\" was rearranged to provide the soundtrack to artist Richard Phillips' short film Lindsay Lohan, which starred the actress herself."]}, {"page": "Taylor Steele (filmmaker)", "response": ["In 2012, Steele worked with artist Richard Phillips to co-direct the short film First Point, starring Lindsay Lohan. Thomas Bangalter from Daft Punk did the score and Jay Rabinowitz who worked on Requiem for a Dream and The Tree of Life, edited the short film."]}, {"page": "Errol Sawyer", "response": ["Art critic and former museum director Julian Spalding described Sawyer as \"a classical black and white photographer in the Henri Cartier-Bresson tradition, using the camera at its simplest and most challenging, as a trap for catching time.\"http://www.julianspalding.net/JS/Errol_Sawyer.html  Writing for the World Socialist Web Site, painter  Richard Phillips remarked \"Errol Sawyer is a rare figure in contemporary photography: someone who worked in the often faddish and superficial world of high-end commercial photography but still retains his artistic integrity and creative spirit.\""]}, {"page": "The Cultivist", "response": ["In the first of its launch, the number of members was capped at 1,000. The community of art lovers has since grown exponentially in regions like: the US West Coast, France, and Mexico. More than half of its members are collectors and its founding members include artists Marina Abramović, Glenn Kaino, and Richard Phillips."]}]}}