{"wiki_id": "http://www.wikidata.org/entity/Q18377442", "itemLabel": "Jack Dunfee", "itemDescription": "British racing driver", "wikipedia_url": "https://en.wikipedia.org/wiki/Jack_Dunfee", "wikipedia_page": {"main": "Jack Lawson Dunfee (26 October 1901 – 13 September 1975) was a British motor racing driver, theatrical impresario, and later farmer who was one of the \"Bentley Boys\" at Brooklands before the Second World War.", "link_mentions": [{"page": "Bentley Boys", "response": ["* Jack Dunfee"]}, {"page": "1930 24 Hours of Le Mans", "response": ["Back in 1928, Barnato's fellow race-winner, Sir Henry “Tim” Birkin had seen the threat posed by the new supercharged Mercedes and Alfa Romeos to Bentley's dominance of touring car racing. He had approached W. O. Bentley and Barnato about supercharging the green cars. Barnato was not convinced and W.O loathed the idea.Laban 2001, p.65-6 He eventually found an investor in the form of young heiress, and keen motorist, Dorothy Paget (who already owned a Mercedes-Benz SSK). The cars were not race-ready in time for the 1929 race; however Barnato quietly approved sufficient funds to allow the required production quantity to be met. Based on the 4½ Litre model, a massive, distinctive Roots supercharger was fitted in front of the radiator. This boosted the engine output from 130 to 240 bhp. However, it also raised the fuel consumption and its front-end weight gave the car noticeable understeer. Improved over the close-season, a team of three “Blower Bentleys” arrived, managed by former Bentley-driver and Lagonda team-manager Bertie Kensington-Moir. Birkin renewed his 1928 Le Mans partnership with Jean Chassagne, while race-winner Dudley Benjafield drove with former Alfa Romeo test-driver (and now British resident) Giulio Ramponi. The third car was driven by Boris Harcourt-Wood and Jack Dunfee, Clive's older brother.Spurring 2017, p.24-5", "|  Beris Harcourt-Wood  Jack Dunfee"]}, {"page": "1929 24 Hours of Le Mans", "response": ["The remaining four cars were the reliable 4½-litre tourers, the chassis strengthened after the issues from the previous year.Clausager 1982, p.39 They were assigned to more of the “Bentley Boys”: Frank Clement / Jean Chassagne, Benjafield with Baron André d’Erlanger and Glen Kidston/Jack Dunfee. The fourth car, of Earl Howe/Bernard Rubin, had only a week earlier been used in a 24-hour record-breaking attempt at Montlhéry by Mary Petre and her husband Victor Bruce. The experienced driving squad was supported by Bertie Kensington-Moir, back from Lagonda as team manager, and Walter Hassan as lead mechanic.", "|  Glen Kidston Jack Dunfee", "|  Glen Kidston Jack Dunfee"]}, {"page": "Glen Kidston", "response": ["|align=left|  Jack Dunfee"]}, {"page": "1931 French Grand Prix", "response": ["|  Jack Dunfee"]}, {"page": "1931 Grand Prix season", "response": ["|  Jack Dunfee", "A strong privateer field was entered: Wimille and Lehoux in their Bugattis, Caracciola and Ivanowski had their 7-litre Mercedes – the first time German cars had raced at the Grand Prix since 1914. The race also attracted a significant British contingent; Earl Howe, having just won the Le Mans 24-hour the week before in his Alfa Romeo 8C-2300 tourer, Spurring 2017, p.84 Ludvigsen 2008, p.73 now had a new Bugatti Type 51, while his victorious co-driver Tim Birkin ran a Maserati 26M. “Williams” ran his 2-litre Bugatti, William Scott had a 5-year old Delage and Jack Dunfee had a 1925 Sunbeam. All in all there were 23 starters. In practice Bugatti again found, as at Le Mans a week earlier, that their Michelin tyres were failing. They were going to withdraw but Williams still had a set of Dunlop tyres to test with. A full set of tyres was flown out overnight from England for the team and in gratitude gave “Williams” a third works car for the race, rejoining the team.", "|align=\"left\"|  Jack Dunfee"]}, {"page": "1932 Grand Prix season", "response": ["Racing in Great Britain centred on Brooklands and because of the limited number of drivers in each class, were invariably run as handicap ‘scratch’ races. British interest was less in grand-prix racing than for land speed records and sports car racing – given the fame that the Bentley Boys had achieved at Le Mans. This year, one of two formal races held at Brooklands was the inaugural British Empire Trophy run as a pair of heats with a 100-mile final. This saw the land-speed-record monsters of John Cobb (10.6-litre V12 Delage) and George Eyston (8-litre Panhard) matched against each other. Other entries included Woolf Barnato's Bentley Speed Six, driven by Jack Dunfee, and Tim Birkin in his 4.5-litre Blower Bentley. Earl Howe in his 1.5-litre supercharged Delage won the first heat from Henken Widengren, while Eyston won the second. The six finalists lined up side-by-side on the wide track. Cobb took the lead using the Delage's phenomenal acceleration, pursued by Eyston, the two Bentleys, Howe and Widengren. Then he eased off to conserve his tyres, allowing Birkin to overtake and take the lead. However, twenty minutes in at the halfway point, the Bentley’s cylinder head cracked fatally soon after the radiator had run dry. Eyston took the lead until he too eased off to conserve his tyres. Cobb pushed again to overtake and for the final ten laps the two duelled for the lead with Cobb just winning by a car-length from Eyston. Howe was third after Dunfee was mistakenly stopped a lap early by an over-zealous track official. A protest was lodged by Eyston's crew saying Cobb had been deliberately blocking. The result was overturned until a fortnight later when an appeal by Cobb saw the result reversed back again."]}, {"page": "Clive Dunfee", "response": ["Dunfee was the third of four sons of Colonel Vickers Dunfee and the younger brother of Jack Dunfee, also a motor racer. He took part in the 1930 24 Hours of Le Mans and in the same year married the actress Jane Baxter one of the leading ladies of the British cinema in the Thirties. ", "In 1932 the Dunfee brothers raced the BRDC 500 Miles Race at Brooklands, in the \"Old Number One\" Bentley Speed Six, with a brand new 8-litre engine installed. After the first driving stint Jack Dunfee was in fourth place when he entered the pits. Clive took over, and shortly after, in passing Earl Howe's Bugatti, he went too high up the banking, putting the wheel of his car over the lip. The car cartwheeled over the top, hit a large tree and plunged down through the trees to the road below. Dunfee was thrown out and killed instantly. His wife was watching the race when he crashed to his death."]}, {"page": "Audrey White", "response": ["In 1953, White married theatrical impresario, farmer, and former Brooklands racing driver Jack Dunfee\"The Poster Bride Weds\", Daily Mirror, 20 July 1953, p. 4. but the marriage failed. In 1964, she married Christopher Henry Beaumont Pease, 2nd Lord Wardington, thus becoming Lady Wardington. The couple adopted three children. Lord Wardington was an enthusiastic book collector and together they attended many bibliographic events. Lady Wardington devoted herself to charitable causes from Meals on Wheels to local campaigns. She set up a course to teach women money management and wrote the Superhints books for charity from suggestions she canvassed from her many, often upper-class, friends."]}, {"page": "Dunfee", "response": ["*Jack Dunfee, British race car driver"]}]}}