{"wiki_id": "http://www.wikidata.org/entity/Q18355169", "itemLabel": "Sarah Corbett", "itemDescription": "English poet", "wikipedia_url": "https://en.wikipedia.org/wiki/Sarah_Corbett_(poet)", "wikipedia_page": {"main": "Sarah Corbett (born 1970) is a British poet.She graduated with a degree in English and Sociology from the University of Leeds in 1992, an MA in Creative Writing from the University of East Anglia in 1998, and a PhD in Creative and Critical Writing from the University of Manchester in 2013. She has published five collections of poetry, including the verse-novel, 'And She Was' (2015) and 'A Perfect Mirror' (2018). The Red Wardrobe won an Eric Gregory Award in 1998, and was shortlisted for the T. S. Eliot Prize and Forward Prize. She is a Lecturer at Lancaster University, having previously taught for the Open University.", "link_mentions": [{"page": "Eric Gregory Award", "response": ["*1997: Matthew Clegg, Sarah Corbett, Polly Clark, Tim Kendall, Graham Nelson, Matthew Welton"]}, {"page": "Corbett (surname)", "response": ["* Sarah Corbett, British poet born 1970, received Eric Gregory Award 1997"]}, {"page": "Sarah Corbett", "response": ["Sarah Corbett is a speaker, professional activist, author and the founder of Craftivist Collective, a social enterprise which uses the technique of craftivism - combining craft and activismAlexi D., ‘It sounds quirky, but it really does work’: craftivist Sarah Corbett on the power of positive crafting, Time Out, 22 December 2016. Retrieved 28 September 2017  - to engage people in social justice issues \"in a quiet, non-confrontational manner involving pretty, handcrafted gestures of defiance.\"Alexi Duggins, Is there a protest message in your new jacket's pocket? You've been shop-dropped, The Guardian, 18 September 2017. Retrieved 28 September 2017", "She wrote A Little Book of Craftivism which was published in 2013,Corbett, Sarah (2013). A Little Book of Craftivism. Cicada.How a piece of fabric can change the world: Sarah Corbett at TEDxBrixton, youtube.com, 23 October 2013. Retrieved 7 January 2014 and How To Be A Craftivist, published in 2017.Corbett, Sarah (2017). How To Be A Craftivist. Unbound.", "Corbett has \"a huge passion for craft\".Nikki Shaill, Craftivist Collective, Lady Craft zine for Ladyfest Ten, Summer 2010 She has no formal training as an artist or craftsperson, saying \"I can do it anyone can do it.\" Her main craft is cross-stitch,Holly Howe, Sarah Corbett, House, Autumn 2010 which she often uses to make mini-protest banners. She has described her work as using \"creativity to make the public aware of the struggles people are still going through\".DK Goldstein, Make a Stand, Pica Pica magazine, 2010", "Work by Sarah Corbett has been exhibited and sold in art exhibitions including:", "* 'Gentle Protest' in Stockholm.Sarah Corbett Gentle Protest hv-textil.se. Retrieved 13 September 2017", "Corbett's 2016 talk Activism Needs Introverts was featured on the TED homepage in November 2017 and has generated over 1 million views since. Sarah Corbett: Activism needs Introverts ted.com. Retrieved 23 November 2017"]}]}}