{"wiki_id": "http://www.wikidata.org/entity/Q1846089", "itemLabel": "Ambrose McEvoy", "itemDescription": "English painter (1878-1927)", "wikipedia_url": "https://en.wikipedia.org/wiki/Ambrose_McEvoy", "wikipedia_page": {"main": "Arthur Ambrose McEvoy  (12 August 1877 – 4 January 1927) was an English artist. His early works are landscapes and interiors with figures, in a style influenced by James McNeill Whistler. Later he gained success as a portrait painter, mainly of women and often in watercolour.", "link_mentions": [{"page": "Gwen John", "response": ["From 1895 to 1898, she studied at the Slade School of Art, where the program was modeled after the French atelier method (various levels of student working under a master artist).Foster 1999, p. 10. It was the only art school in the United Kingdom that allowed female students, although there was generally no mixing of men and women on the grounds, in classes, or in corridors.Tamboukou pp. 4–5. Like her younger brother, Augustus, who had begun his studies there in 1894,Langdale; Jenkins; John 1986, p. 9. she studied figure drawing under Henry Tonks.Uglow, p. 284. During this period, she and Augustus shared living quarters, and further reduced their expenses by subsisting on a diet of nuts and fruit. She developed a close relationship with the woman who would become her brother's wife, Ida Nettleship. At this time, she also had a relationship with another of her brother's friends, Arthur Ambrose McEvoy, which turned out to be an unhappy one.Langdale 1987, p. 22. Good friends also included Ursula Tyrwhitt and Gwen Salmond.Tamboukou, p. 5. John won the Melvill Nettleship Prize for Figure Composition in her final year at Slade.", "In 1898 she made her first visit to Paris with two friends from the Slade, and while there she studied under James McNeill Whistler at his school, Académie Carmen. She returned to London in 1899, and  exhibited her work for the first time in 1900, at the New English Art Club (NEAC).Foster 1999, p. 77.. With Arthur Ambrose McEvoy becoming engaged to Mary Mary Edwards at the end of 1900 \"an awkward period ensued with Gwen living at the McEvoy family home in Bayswater\", where \"she had continued living\", \"while Ambrose and Mary moved down to Shrivenham in Oxfordshire\" c. 1903Augustus John: The New Biography 2010, Sir Michael Holroyd, loc.2961", "Throughout her life John was attracted to people of both sexes. As a student she had an affair with fellow artist Ambrose McEvoy. Although Auguste Rodin was her great love, she had a number of same-sex relationships. Whilst at Slade she developed a passion for an unnamed woman which her brother Augustus describes in his autobiography Chiaroscuro and whilst walking to Paris with Dorelia, she developed a passion for a married girl, who then followed them to Paris. Rodin, who had a sexual relationship with his assistant Hilda Flodin, drew erotic drawings of Flodin and John together. The German painter Ida Gerhardi fell in love with John but it was not reciprocated. John's last passion was Véra Oumançoff, for whom she developed an obsession, much to the discomfort of Véra.Shopland, Norena 'Like a shadow I am' from Forbidden Lives: LGBT stories from Wales Seren Books (2017)"]}, {"page": "New English Art Club", "response": ["Historic NEAC members and exhibitors include: Thomas Kennington (founder member and first secretary), Prof Fred Brown (founder member), Frank Bramley (foundation member), Walter Sickert, William Orpen, Augustus John, Gwen John, Ambrose McEvoy, Philip Wilson Steer, Henry Tonks, James Whitelaw Hamilton, Alfred William Rich, James Dickson Innes, Margaret Preston, Charles Wellington Furse, Katie Edith Gliddon, William Rothenstein, Lindsay Bernard Hall, Thomas Cooper Gotch, Mary Sargant Florence, Henry Strachey, Clare Atwood, Evelyn Dunbar, Eve Garnett, Frank McEwen, James Jebusa Shannon, Cecil Mary Leslie, Mary Elizabeth Atkins, William Brown Macdougall, Neville Bulwer-Lytton, 3rd Earl of Lytton, Muirhead Bone, Robert Polhill Bevan, Dugald Sutherland MacColl, Neville Lewis, Charles Holmes, Carron O Lodge, Geoffrey Tibble, Alexander Mann, Hercules Brabazon Brabazon, Thomas Esmond Lowinsky, Frank Hughes, Albert Julius Olsson, Helen Margaret Spanton,Suffolk Painters: Suffolk Painters, accessdate: March 9, 2016 Margaret Green and Leslie Donovan Gibson."]}, {"page": "1909 in art", "response": ["* Ambrose McEvoy – Euphemia"]}, {"page": "1900 in art", "response": ["* Ambrose McEvoy – Bessborough Street, Pimlico (Tate)"]}, {"page": "Eugenia Errázuriz", "response": ["The couple settled in Paris, where Eugenia attracted a high-profile following. In the autumn of that year, they met John Singer Sargent while they were visiting Venice, possibly on their honeymoon, and seeing José's brother who had taken a studio with Sargent at the Palazzo Rezzonico. Described as an extraordinary beauty, with a beaked nose and raven hair, she was painted by SargentRichardson, John Sacred Monsters, Sacred Masters: Beaton, Capote, Dalí, Picasso, Freud, Warhol, and More Random House, 2001. . See pages 3 – 16 (who had previously painted Madame Subercaseaux in 1880). Sargent became very fond of Madame Errázuriz and would paint her several times. Besides Sargent, she was also painted by Jacques-Emile Blanche (French painter 1861–1942), Giovanni Boldini, Paul Helleu, Augustus John, Ambrose McEvoy, and Pablo Picasso."]}, {"page": "Crudwell", "response": ["*Ambrose McEvoy (1878–1927), artistClaude Johnson, ed., The Works of Ambrose McEvoy from 1900 to May 1919, 1919."]}, {"page": "Maggie Laubser", "response": ["At the outbreak of World War I she went to London. She initially stayed in Huntingdonshire and then, in October 1914, moved to a London hotel and registered at the Slade School of Art for the period October 1914 to March 1919.  Henry Tonks, Walter Westley Russell and Ambrose McEvoy taught her drawing, while Philip Wilson Steer lectured her in painting. It seems that she never painted during her time at the Slade, instead concentrating her efforts on drawing of portraiture and figure studies. Laubser returned to South Africa briefly in 1915 to visit the new family farm at Oortmanspost, near Klipheuwel in the Cape Province and again in March 1919, after her studies were concluded."]}, {"page": "Edna Clarke Hall", "response": ["The young Edna Waugh showed an early talent for drawing. When she was fourteen, a barrister friend of her father, William Clarke Hall (1866-1932) arranged for her to enter the Slade School of Fine Art. Whilst there, Edna was taught by Henry Tonks, \"the most renowned and formidable teacher of his generation\".\"Tonks, Henry\"  The Oxford Dictionary of Art. Ed. Ian Chilvers. Oxford University Press, 2004. She studied alongside Gwen and Augustus John, Ida Nettleship, Ambrose McEvoy and Albert Rutherston, and made many drawings and etchings of her new friends. She won many prizes and certificates for her drawings and in 1897 was awarded a Slade scholarship. Although a couple of oil paintings, painted under Gwen John's guidance, exist, Edna's favoured medium as a painter was watercolour.Still Life of a Basket on a Chair, 1900, collection of the Tate Gallery. Accessed 3 February 2012Benjamin Waugh c.1904, Painted by Edna Clarke Hall, accessed 3 February 2012. Accessed 23 May 2012."]}, {"page": "McEvoy", "response": ["* Ambrose McEvoy (1878–1927), English artist"]}, {"page": "Lowes Dalbiac Luard", "response": ["Luard was born in Calcutta, the son of a colonel in the Royal Engineers. Educated in England, and having won a place at the University of Oxford to study mathematics at Balliol, he decided instead to study art, and in 1892 enrolled at the Slade School of Fine Art in London, where his contemporaries included Augustus John and Ambrose McEvoy. He left the Slade in 1897 and then studied in Paris under Lucien Simon and Rene Menard. He moved to Paris in 1905 with his wife Louey and their baby daughter Veronica and, except for the war years, lived in the city for almost thirty years. In Paris he became well known for his paintings and drawings of large working horses. Two of his most notable paintings, Timberhauling on the Seine (1914) and Percherons at Water (1911), are from this period. "]}, {"page": "Arthur Ambrose McEvoy", "response": ["#redirect Ambrose McEvoy"]}, {"page": "Archibald Walter Buckle", "response": ["Buckle's medals—the DSO and three Bars, the trio of the 1914 Star (awarded for service when he was a petty officer), the British War Medal, the Victory Medal (known as \"Pip, Squeak and Wilfred\"), and his RNVR Long Service and Good Conduct Medal—are held by the Imperial War Museum, along with a portrait by Ambrose McEvoy."]}, {"page": "Maud Nelke", "response": ["*Date Unknown, Maud as a young woman (Oil on canvas). Ambrose McEvoy. Private Collection "]}, {"page": "D. L. Ghilchik", "response": ["He was born in Botoșani, Romania, the son of Abraham Josef Ghilchik, who traded in lace and linen, and his wife Sali. The family settled in Salford, England, in 1920, where Ghilchik enrolled at the Manchester School of Art and studied under Adolphe Valette from 1907 to 1915. At the School he met fellow student Josephine Matley Duddle (1890–1981), marrying her in Chelsea in the last quarter of 1915. Their daughter Sybil became an opera singer with the D'Oyly Carte Opera Company.Stone, David. \"Sybil Ghilchik\", Who Was Who in the D'Oyly Carte Opera Company, 11 July 2002, accessed 22 June 2018 Ghilchik continued his studies at the Slade School of Fine Art under Henry Tonks and Ambrose McEvoy."]}, {"page": "Esther Hope", "response": ["Hope's early education was at Miss Bowen's School in Christchurch. Her first art teachers included Captain Edwyn Temple and Margaret Stoddart. After travelling to England, Hope's art education included attending the Slade School of Fine Art in London, receiving tuition from Henry Tonks, John Peter Russell, and Ambrose McEvoy. While in London she also studied at the Chelsea College of Arts under Ernest Borough Johnson and Frank Spenlove-Spenlove."]}, {"page": "Lois Sturt", "response": ["She became famous as the most painted woman of England: at just 20 years old, she had already seven portraits taken, including 4 sketches by Etienne Drian, studies in oil by Ambrose McEvoy, Olive Snell and Gerald Kelly and a self-portrait. All seven were exhibited in 1921 at the annual show of the National Portrait Gallery. She attended the Slade School of Art and scandalizing society, she opened her own art studio in Chelsea. Wyndham Lewis said she was \"the most beautiful debutante of her day\" and Barbara Cartland said she was \"fiery, impetuous, and with dark, flashing eyes.\"", "thumb|left|1920 – \"Portrait of the Hon. Lois Sturt\" by Ambrose McEvoy (Crudwell, Wilts, 1878–1927, London). Oil on canvas", "File:Ambrose McEvoy, Lois Sturt, 1.jpg| by Ambrose McEvoy, 1920", "File:Ambrose McEvoy, Lois Sturt, 2.jpg| by Ambrose McEvoy, 1920", "File:Ambrose McEvoy, Lois Sturt, 3.jpg| by Ambrose McEvoy, 1920"]}, {"page": "Mary McEvoy (artist)", "response": ["McEvoy was born in Freshford in Somerset and studied at the Slade School of Art in London. Between 1900 and 1906 she was a regular exhibitor with the New English Art Club. In 1902 she married the artist Ambrose McEvoy and in due course gave up a full-time art career although she worked with her husband on at least one major project. In 1909 Ambrose McEvoy was commissioned to paint a series of decorations for St Columba's Church, Long Tower in Derry which were to consist of three original works and twenty-two copies of bible scenes as depicted by Old Masters. While Ambrose created the three original pieces, it is believed that Mary worked on the twenty-two copies, finding suitable sources, making cartoons and then painting enlarged versions onto copper panels for the church."]}, {"page": "Rosa Waugh Hobhouse", "response": ["In 1897, at the age of fifteen, Hobhouse began an art school training at the Slade School of Fine Art, London. Her sister Edna, three years older, had already been studying there for four years, and Hobhouse found herself drawn into her sister’s wide circle of art school friends who included Augustus John, Gwen John, Ambrose McEvoy and Albert Rutherston. Edna (later Edna Clarke Hall) frequently drew Rosa, as did Augustus and Gwen John."]}, {"page": "Charles McEvoy", "response": ["Charles McEvoy (1879–1929) was a British playwright and stage director. He was originally a journalist before switching to creative writing in 1907, becoming known for his realism. His 1923 play The Likes of Her was adapted into a 1931 film Sally in Our Alley.Goble p.317 His brother was the artist Ambrose McEvoy."]}, {"page": "Catherine Gardiner", "response": ["As a teenager she became a stage actress and was employed in various productions in the West End of London. She went under the pseudonym of Joan Gordon and was usually employed to undertake minor character roles.She played Mrs. Helman in ’The New Ghetto’ (by Hungarian playwright Theodor Herzl) The London Pavilion Theatre, reviewed in The Era, 25 June 1919 At the same time she was an artist’s model, who sat for a wide number professional artist’s including, Augustus John, Ambrose McEvoy, Alfred Munnings and Walter Westley Russell (later Keeper of the Royal Academy Schools)."]}]}}