{"wiki_id": "http://www.wikidata.org/entity/Q18408", "itemLabel": "Horace Barks", "itemDescription": "Lord Mayor of Stoke-on-Trent", "wikipedia_url": "https://en.wikipedia.org/wiki/Horace_Barks", "wikipedia_page": {"main": "Horace Barks, OBE (1895-1983) was Lord Mayor of Stoke-on-Trent in 1951–2.\nBarks was born in Ipstones in the countryside near Stoke-on-Trent and came from a working-class background. His experiences in World War I left him with pacifist beliefs and experience of railway operations.  After the war he became a train guard and, in 1921, a member of the Labour Party, the dominant party in Stoke-on-Trent during the twentieth century. He was elected a Stoke councillor in 1930 and made an Alderman in 1948. He served as Mayor for 1951–52.Barks' cultural interests included Esperanto and the writer Arnold Bennett.  Barks and his son Guy were active in the Arnold Bennett Society, which is based in Stoke-on-Trent.  The reference library in the city is named after Barks.", "link_mentions": [{"page": "Barlaston", "response": ["* Horace Barks OBE (1895-1983) Lord Mayor of Stoke-on-Trent in 1951–2, cultural interests were Esperanto and the writer Arnold Bennett."]}, {"page": "Smallthorne", "response": ["A Lord Mayor of Stoke-on-Trent in the 1950s, Horace Barks was a strong advocate of Esperanto (gaining the nickname Mr Esperanto). When 'The Green Star', a Smallthorne pub, was being built Barks requested that the brewery add the words 'la verda stelo' (the pub's name in Esperanto) onto the side of the building (the green star is a symbol of Esperanto). The brewer agreed. Green Star Public House, Esperanto Way, Smallthorne, Stoke-on-Trent", "The office and administrative centre of 'Esperanto-Asocio de Britio' (Esperanto Association of Britain) is just outside Stoke-on-Trent in the Wedgwood Memorial College, Barlaston. Horace Barks helped set up the first courses there in 1960."]}, {"page": "Wedgwood Memorial College", "response": ["Between 1960 and 2011, the last opportunity prior to its 2012 closure, Wedgwood Memorial College offered a week-long Esperanto summer school every August. This came about partly through the influence of Horace Barks, the Lord Mayor of Stoke-on-Trent, who was an advocate of Esperanto."]}, {"page": "List of Carnegie libraries in Europe", "response": ["* Solon Carnegie Library, no building provided. This academic library comprised books on ceramics. The collection is now in the Horace Barks Reference Library, Stoke-on-Trent."]}, {"page": "Horace (given name)", "response": ["*Horace Barks (1895–1983), English mayor"]}]}}