{"wiki_id": "http://www.wikidata.org/entity/Q18527726", "itemLabel": "Ruby Levick", "itemDescription": "Welsh sculptor (1871–1940)", "wikipedia_url": "https://en.wikipedia.org/wiki/Ruby_Levick", "wikipedia_page": {"main": "Ruby Winifred Levick (11 September 1871 – 31 March 1940) was a Welsh sculptor and medallist who had many of her works exhibited at the Royal Academy.", "link_mentions": [{"page": "George Murray Levick", "response": ["Levick was born in Newcastle upon Tyne, the son of civil engineer George Levick and Jeannie Sowerby. His elder sister was the sculptor Ruby Levick. He studied medicine at St Bartholomew's Hospital and was commissioned a surgeon in the Royal Navy in November 1902. He was secretary of the Royal Navy Rugby Union at its founding in 1907."]}, {"page": "Édouard Lantéri", "response": ["* Ruby Levick"]}, {"page": "List of artworks in the collection of the Royal Society of Chemistry", "response": ["The bronze bust of Sir Humphry Davy was created by Ruby Levick and is a reproduction of an earlier sculpture by Miss Moore, donated to the Chemical Society by Rudolph Messell in 1900. At the Annual General Meeting of the Chemical Society of 29 March, Sir Thomas Edward Thorpe (President of the Society), reported on the gift of this work:", "Ruby Levick was a Welsh sculptor and medallist who had many of her works exhibited at the Royal Academy.", "The bronze bust of John Dalton was also created by Ruby Levick and was donated to the Chemical Society in 1903 by its former President Sir Thomas Edward Thorpe, as also attested by the inscription engraved on the bust's base: \"John Dalton presented by T.E. Thorpe CB. L.L.D. F.R.S. past President in commemoration of the centenary of the enunciation of the atomic theory\"."]}, {"page": "List of women artists associated with Wales", "response": ["*Ruby Levick (c.1872–1940), sculptor"]}, {"page": "List of Welsh women", "response": ["*Ruby Levick (c.1872–1940), sculptor"]}, {"page": "Margaret Giles", "response": ["Giles was born in Clifton, Bristol, the daughter of Richard William Giles, a barrister, and Frances Elizabeth Giles. Her older sister was the painter Frances Giles. Margaret was educated at Kensington High School and in Brussels and Heidelberg. She spent eight years at the National Art Training School, NATS, in London. Among her contemporaries at NATS, which became the Royal College of Art in 1896, were a number of other female sculptors including Ruby Levick, Esther Moore, Florence Steele, Lilian Simpson and Lucy Gwendolen Williams. During the 1890s Giles won a number of national art prizes with her model Hero winning the Art Union of London's statuette competition in 1895. Giles was a regular exhibitor at the Royal Academy in London, with the Arts and Crafts Exhibition Society and with the Royal West of England Academy in Bristol, of which she was a member. At the Royal Academy she showed a number of sculptures, reliefs and medals, including one for hospital nurses and another for the Royal Horticultural Society. Between 1884 and 1912 Giles also exhibited works at the Royal Glasgow Institute of the Fine Arts, the Royal Scottish Academy and with the Ridley Art Club. She married engineer Bernard Maxwell Jenkin in 1898."]}, {"page": "Esther Moore", "response": ["Esther Moore worked as a designer for a silversmith until she won a scholarship to the National Art Training School, NATS, where she was taught by the sculptor Édouard Lantéri. Among her contemporaries at NATS, which became the Royal College of Art in 1896, were a number of other female sculptors including Margaret Giles, Ruby Levick, Florence Steele, Lilian Simpson and Lucy Gwendolen Williams. After further training in Paris, Moore established a studio in Chiswick and began exhibiting at the Royal Academy, RA, in London. Between 1890 and 1919 she showed some 19 pieces at the RA, including Art Nouveau statuettes and busts. In 1893 she won a silver medal in the National Art Competition and in 1896 exhibited several pieces, including a cabinet she designed with the architect Charles Harrison Townsend, at the Arts and Crafts Exhibition Society. For the Della Robbia Pottery in Birkenhead, Moore designed decorative sculptures and household items including lamps and light fittings. During her career Moore also designed silver and bronze panels, memorials and decorative jewellery, and she exhibited with the Society of Women Artists, with the Royal Scottish Academy, at the Walker Art Gallery in Liverpool and at the Paris Salon. Her work was featured in both The Studio and The Art Journal magazines during her life."]}, {"page": "Lilian Simpson", "response": ["During the 1890s, Simpson was a student at the National Art Training School, NATS, in London where she was taught by the sculptor Édouard Lantéri. Among her contemporaries at NATS, which became the Royal College of Art in 1896, were a number of other notable female sculptors including Margaret Giles, Ruby Levick, Esther Moore, Florence Steele and Lucy Gwendolen Williams. In 1894 Simpson won a gold medal and travelling scholarship in the National Art Competition for a silver low relief book cover. While still a student, Simpson had two pieces of work, including a bronze casket, shown at the Royal Academy in London and also exhibited with the Arts and Crafts Exhibition Society.In 1896 and 1897 her work was also included in exhibitions in Leeds and Liverpool. In 1897 she used the travelling scholarship she had won in 1894 to travel and study in Italy. There she contracted typhoid fever and died later that year aged 26. The British Library now holds her 1894 book cover."]}, {"page": "Florence Steele", "response": ["Between 1892 and 1896 Steele studied at the National Art Training School, NATS, in London where she was taught by the sculptor Édouard Lantéri. Among her contemporaries at NATS, which became the Royal College of Art in 1896, were a number of other female students who became notable sculptors including Margaret Giles, Ruby Levick, Esther Moore, Lilian Simpson and Lucy Gwendolen Williams. While at NATS, Steele won several prizes including a gold medal in 1894. In 1896 Steele established a studio in Hammersmith in west London and soon came to be highly regarded as an art nouveau designer and metalworker.  She created a large amount of work in silver including jewellery, mirror frames, caskets, walking stick heads, christening cups and alms dishes and, in bronze, portrait medallions and sundials."]}]}}