{"wiki_id": "http://www.wikidata.org/entity/Q18528540", "itemLabel": "Elizabeth Cobbold", "itemDescription": "English poet, artist, geologist", "wikipedia_url": "https://en.wikipedia.org/wiki/Elizabeth_Cobbold", "wikipedia_page": {"main": "Elizabeth Cobbold or Carolina Petty Pasty born Elizabeth Knipe (1767–17 October, 1824) was a British writer and poet.", "link_mentions": [{"page": "Mary Anne Keeley", "response": ["Goward's singing talents were noticed by the Ipswich writer Elizabeth Cobbold and she encouraged her to take to the stage.J. M. Blatchly, ‘Cobbold , Elizabeth (1765–1824)’, Oxford Dictionary of National Biography, Oxford University Press, 2004; online edn, Jan 2014 accessed 15 Jan 2015 After some experience in the provinces, she first appeared on the stage in London on 2 July 1825 in the opera Rosina.  It was not long before she gave up singing parts in favour of drama proper, where her powers of character-acting could have scope."]}, {"page": "Margaret Catchpole", "response": ["Catchpole had little education and worked as a servant for different families until being employed  in May 1793 as under-nurse and under-cook by the writer Elizabeth Cobbold at her house on St Margarets Green in Ipswich.J. M. Blatchly, 'Cobbold , Elizabeth (1765–1824)’, Oxford Dictionary of National Biography, Oxford University Press, 2004; online edn, Jan 2014 accessed 15 Jan 2015 Her husband was a brewer and member of the prosperous Ipswich Cobbold family. Here Catchpole was virtually part of the family and was responsible for saving the lives of children in her care three times. She also learned to read and write here."]}, {"page": "Cliff Brewery", "response": ["Nearby Cliff House was the home of John Cobbold and Elizabeth Cobbold before they moved to live at Holywells Park, Ipswich in 1814.J. M. Blatchly, ‘Cobbold , Elizabeth (1765–1824)’, Oxford Dictionary of National Biography, Oxford University Press, 2004; online edn, January 2014 accessed 15 January 2015 It became the Brewery Tap public house."]}, {"page": "Holywells Park", "response": ["The land was bought by John Cobbold in 1812 who brought his wife Elizabeth Cobbold and their large family here to live in 1814.. Cobbold later began using the areas natural springs to produce beer. In 1814 Holywells House was completed on the site of an old farmhouse (this building was demolished in 1962 due to wood rot and only the stable block remains). In 1935 the land at Holywells was presented to the people of Ipswich by Lord Woodbridge and then opened to the public in 1936. Holywells park is now a designated a Conservation Area and is on the English Heritage register of historic parks and gardens of special historic interest"]}, {"page": "1824 in poetry", "response": ["* October 17 – Elizabeth Cobbold (born 1765), English poet"]}, {"page": "1824 in the United Kingdom", "response": ["* 17 October – Elizabeth Cobbold, poet (born 1767)"]}, {"page": "1765 in poetry", "response": ["* February 11 – Elizabeth Cobbold, née Knipe (died 1824), English poet"]}, {"page": "Cobbold", "response": ["* Elizabeth Cobbold (1765–1824), British writer and poet"]}, {"page": "Cobbold family", "response": ["* Elizabeth Cobbold (1765–1824) "]}, {"page": "Ann Candler", "response": ["The Ipswich Journal (17 September 1814) attributed the following poems also to her; \"A Paraphrase of the 5th chap. of the 2nd Book of Kings\"; the \"History of Joseph, in an Address to a Young Man\"; and the \"Life of Elijah the Prophet\", which probably appeared in the Journal from 1790 onwards. By 1800 it was proposed to publish a short volume of Ann Candler's work by subscription; and by 24 May 1802 she was under a roof of her own at Copdock, just by Sproughton, near a married daughter. A book was created with local writer Elizabeth Cobbold serving as editor.J. M. Blatchly, ‘Cobbold, Elizabeth (1765–1824)’, Oxford Dictionary of National Biography, Oxford University Press, 2004; online edn, Jan 2014 accessed 15 Jan 2015 Her book, Poetical Attempts was published at Ipswich in 1803."]}, {"page": "Eliza Knipe", "response": ["#REDIRECT Elizabeth Cobbold"]}, {"page": "John Cobbold (1774–1860)", "response": ["He was the first son of John Cobbold and Elizabeth Wilkinson, who together had 15 children before Elizabeth's death in 1790. His father remarried Elizabeth Knipe better known as the writer Elizabeth Cobbold."]}, {"page": "Cobbold, Elizabeth", "response": ["#redirectElizabeth Cobbold"]}, {"page": "Margaret Catchpole Public House", "response": ["The building was named after Margaret Catchpole, previously a servant of the writer Elizabeth Cobbold. After providing good service to the Cobbold's, she left their employ. However, in 1797 she stole a horse from them to ride to London to find her lover. She was arrested and after being found guilty in a trial she was sentenced to death, subsequently commuted to transportation to Australia. Her story was subsequently turned into a novel by Elizabeth's son, Richard Cobbold, in 1845 and has remained popular ever since."]}, {"page": "Laetitia Jermyn", "response": ["Jermyn also wrote a memoir of her friend, the poet and naturalist Elizabeth Cobbold, published in 1825. The work was described as 'rhapsodic', highlighting the 'versatility and universality of her [Cobbold's] genius'."]}, {"page": "History of transgender people in the United Kingdom", "response": ["*1825 - Mary Anne Keeley appears in London opera after being noticed by Elizabeth Cobbold"]}]}}