{"wiki_id": "http://www.wikidata.org/entity/Q18572183", "itemLabel": "Alfred Smee", "itemDescription": "English chemist and surgeon", "wikipedia_url": "https://en.wikipedia.org/wiki/Alfred_Smee", "wikipedia_page": {"main": "Alfred Smee FRS, FRCS (18 June 1818, Camberwell – 11 January 1877, Finsbury Circus) was an English surgeon, chemist, metallurgist, electrical researcher and inventor. He was also an orchid enthusiast.Born the second son of William Smee, accountant-general to the Bank of England, Alfred Smee entered in November 1829 St Paul's School, London and in October 1834 became a medical student at King's College, London. During most of his student life, he lived at his father's official residence within the Bank of England and there did research on chemistry and electro-metallurgy which made him famous a few years later. After King's College, he entered St Bartholomew's Hospital, became a surgical assistant to Sir William Lawrence, 1st Baronet, and received in April 1840 his diploma as a member of the Royal College of Surgeons. Smee became a consulting surgeon at the London Institution and specialised in diseases of the eye. During this time as a consulting surgeon he also continued his chemical and electro-metallurgical research and developed the Smee's battery (zinc plate and silver plate, coated with platinum black, in sulphuric acid), for which he was awarded the gold Isis medal from the Society of Arts. In 1840 he published a valuable treatise on electro-metallury dealing with the principles of reduction of metals in different states.\nHe was appointed surgeon to the Bank of England in January 1841, a post which had been especially created for him by the directors, upon the recommendation of Sir Astley Cooper, who thought that the bank could turn his scientific genius to good account. He invented a durable writing-ink in 1842, and in 1854, with Mr. Hensman, the engineer, and Mr. Coe, the superintendent of printing at the bank, perfected the present system of printing the cheques and notes. Certain modifications were introduced into the manufacture of the notes to prevent or render it impossible any longer to split them. His paper on ‘New Bank of England Note and the Substitution of Surface Printing from Electrotypes for Copperplate Printing’ was read before the Society of Arts in 1854. He was elected a fellow of the Royal Society on 10 June 1841, and in February 1842 he became surgeon to the Royal General Dispensary in Aldersgate Street.\nHis 1849 treatise Elements of Electro-Biology was a pioneering effort in electrical physiology and in 1850 a popular version was published with the title Instinct and Reason. At the London Institution he helped to establish in 1854 a long-lived system of educational lectures.Smee is credited with the first sighting (29 June 1861) of the Great Comet of 1861 in the northern hemisphere (previously discovered on 13 May 1861 in the southern hemisphere by John Tebbutt).\nIn the later part of his life Smee maintained an experimental garden at Wallington Bridge, in the hamlet of Wallington, in the parish of Beddington, in the county of Surrey; the garden covered 7.925 acres of land and water.He married Elizabeth Hutchison on 2 June 1840 in London. They had a son and two daughters. Elizabeth Mary Smee (1843-1919) married William Odling and published a memoir of her father in 1878. Alfred Hutchison Smee (1841–1901) became a physician who was elected a Fellow of the Chemical Society and a Fellow of the Royal Statistical Society. Alfred Hutchison Smee cultivated orchids and created experimental hybrids; the orchid Saccolabium smeeanum Rchb. f. is named for him.", "link_mentions": {}}}