{"wiki_id": "http://www.wikidata.org/entity/Q1858252", "itemLabel": "Ralph Hodgson", "itemDescription": "British writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Ralph_Hodgson", "wikipedia_page": {"main": "Ralph Hodgson (9 September 1871 – 3 November 1962), Order of the Rising Sun (Japanese 旭日章), was an English poet, very popular in his lifetime on the strength of a small number of anthology pieces, such as The Bull. He was one of the more 'pastoral' of the Georgian poets. In 1954, he was awarded the Queen's Gold Medal for Poetry.\nHe seems to have covered his tracks in relation to much of his life; he was averse to publicity. This has led to claims that he was reticent. Far from that being the case, his friend Walter De La Mare found him an almost exhausting talker; but he made a point of personal privacy. He kept up a copious correspondence with other poets and literary figures, including those he met in his time in Japan such as Takeshi Saito.\nHis poem The Bells of Heaven was ranked 85th in the list of Classic FM's One Hundred Favourite Poems. Quoting from the biography which accompanied the poem: \"He was one of the earliest writers to be concerned with ecology, speaking out against the fur trade and man's destruction of the natural world.\"", "link_mentions": [{"page": "List of English-language poets", "response": ["*Ralph Hodgson (1871–1962, E/US)"]}, {"page": "Man'yōshū", "response": ["In 1940, Columbia University Press published a translation created by a committee of Japanese scholars and revised by the English poet, Ralph Hodgson. This translation was accepted in the Japanese Translation Series of the United Nations Educational, Scientific and Cultural Organization (UNESCO).Nippon Gakujutsu Shinkōkai, p. ii."]}, {"page": "Minerva, Ohio", "response": ["* Ralph Hodgson – poet"]}, {"page": "Darlington", "response": ["* Ralph Hodgson – poet"]}, {"page": "1954 in literature", "response": ["*Queen's Gold Medal for Poetry: Ralph Hodgson"]}, {"page": "Georgian Poetry", "response": ["Lascelles Abercrombie - Gordon Bottomley - Rupert Brooke - W. H. Davies - Walter de la Mare - John Drinkwater - J. E. Flecker - W. W. Gibson - Ralph Hodgson - D. H. Lawrence - F. Ledwidge - John Masefield - Harold Monro - James Stephens", "Herbert Asquith - Maurice Baring - Gordon Bottomley - W. H. Davies - Walter de la Mare - John Drinkwater - John Freeman - W. W. Gibson - Robert Graves - Ralph Hodgson - John Masefield - Harold Monro - Robert Nichols - Isaac Rosenberg - Siegfried Sassoon - J. C. Squire - James Stephens - W. J. Turner"]}, {"page": "Harold Monro", "response": ["Lascelles Abercrombie, Richard Aldington, John Alford, A. C. Benson, Laurence Binyon, Edmund Blunden, W. S. Blunt, Gordon Bottomley, Robert Bridges, Rupert Brooke, Samuel \"Erewhon\" Butler, Roy Campbell, G. K. Chesterton, Richard Church, Padraic Colum, A. E. Coppard, Frances Cornford, John Davidson, W. H. Davies, Jeffery Day, Walter de la Mare, Lord Alfred Douglas, John Drinkwater, Helen Parry Eden, T. S. Eliot, Vivian Locke Ellis, Michael Field, J. E. Flecker, F. S. Flint, John Freeman, Stella Gibbons, Wilfrid Gibson, Robert Graves, Thomas Hardy, H. D., Philip Henderson, Maurice Hewlett, Ralph Hodgson, Gerard Manley Hopkins, A. E. Housman, Ford Madox Hueffer, T. E. Hulme, Aldous Huxley, James Joyce, Rudyard Kipling, D. H. Lawrence, Cecil Day-Lewis, John Masefield, R. A. K. Mason, Charlotte Mew, Alice Meynell, Viola Meynell, Harold Monro, T. Sturge Moore, Edwin Muir, Henry Newbolt, Robert Nichols, Alfred Noyes, Wilfred Owen, J. D. C. Pellow, H. D. C. Pepler, Eden Phillpotts, Ezra Pound, Peter Quennell, Herbert Read, Isaac Rosenberg, Siegfried Sassoon, Geoffrey Scott, Edward Shanks, Fredegond Shove, Edith Sitwell, Osbert Sitwell, Sacheverell Sitwell, Stephen Spender, J. C. Squire, James Stephens, Edward Thomas, W. J. Turner, Sylvia Townsend Warner, Max Weber, Anna Wickham, Humbert Wolfe, William Butler Yeats"]}, {"page": "Palgrave's Golden Treasury", "response": ["William Blake – Walter Savage Landor – T. L. Peacock – John Clare – W. C. Bryant – George Darley – William Barnes – Thomas Lovell Beddoes – Ralph Waldo Emerson – Elizabeth Barrett Browning – H. W. Longfellow – Edward Fitzgerald – Edgar Allan Poe – Alfred Tennyson – Robert Browning – Aubrey de Vere – Emily Brontë – A. H. Clough – Charles Kingsley – Herman Melville – Walt Whitman – Jean Ingelow – Matthew Arnold – William Cory – Coventry Patmore – William Allingham – Sydney Dobell – George Meredith – D. G. Rossetti – Emily Dickinson – Christina Rossetti – Richard Watson Dixon – William Morris – Warren de Tabley – Algernon Charles Swinburne – Thomas Hardy – Robert Bridges – Gerard Manley Hopkins – Andrew Lang – A. W. E. O’Shaughnessy – R. L. Stevenson – John Davidson – A. E. Housman – Francis Thompson – Mary E. Coleridge – Rudyard Kipling – W. B. Yeats – Ernest Dowson – Lionel Johnson – Laurence Binyon – Edwin Arlington Robinson – Hilaire Belloc – T. Sturge Moore – W. H. Davies – Ralph Hodgson – Walter de la Mare – G. K. Chesterton – Robert Frost – John Masefield – Edward Thomas – Harold Monro – Padraic Colum – James Stephens – James Elroy Flecker – D. H. Lawrence – Ezra Pound – Andrew Young – Siegfried Sassoon – Rupert Brooke – Edwin Muir – Edith Sitwell – T. S. Eliot – John Crowe Ransom – W. J. Turner – Dorothy Wellesley – V. Sackville-West – Wilfred Owen – Lilian Bowes Lyon – Robert Graves – Edmund Blunden – F. R. Higgins – William Soutar – Roy Campbell – C. Day-Lewis – John Betjeman – W. H. Auden – Louis MacNeice – Stephen Spender – George Barker – Laurie Lee – Henry Reed – Dylan Thomas – Alun Lewis – David Gascoyne – Sidney Keyes", "Dannie Abse – Fleur Adcock – William Alexander, Earl of Stirling – Kingsley Amis – Simon Armitage – Matthew Arnold – W. H. Auden – Francis Bacon, Lord Verulam – Anna Laetitia Barbauld – George Barker – Richard Barnfield – Francis Beaumont – Patricia Beer – John Betjeman – Laurence Binyon – Thomas Blackburn – Edmund Blunden – Eavan Boland – Ronald Bottrall – Robert Bridges – George Mackay Brown – Elizabeth Barrett Browning – Robert Browning – Alan Brownjohn – Robert Burns – George Gordon Noel, Lord Byron – Norman Cameron – Roy Campbell – Thomas Campbell – Thomas Campion – Thomas Carew – Henry Carey – Lewis Carroll – Charles Causley – Colley Cibber – John Clare – Austin Clarke – Jack Clemo – Arthur Hugh Clough – Hartley Coleridge – Samuel Taylor Coleridge – John Collins – William Collins – Tony Connor – Henry Constable – David Constantine – Abraham Cowley – William Cowper – Richard Crashaw – Robert Crawford – Allan Cunningham – Samuel Daniel – George Darley – Donald Davie – W. H. Davies – Dick Davis – Thomas Dekker – Walter de la Mare – Lord De Tabley – Richard Watson Dixon – Keith Douglas – Ernest Dowson – Michael Drayton – William Drummond – John Dryden – Carol Ann Duffy – Helen Dunmore – Douglas Dunn – Lawrence Durrell – Thomas Stearns Eliot – Alistair Elliot – Jean Elliot – William Empson – D. J. Enright – Gavin Ewart – James Fenton – Roy Fisher – Edward FitzGerald – John Fletcher – Veronica Forrest-Thomson – John Fuller – Roy Fuller – Elizabeth Garrett – David Gascoyne – John Gay – Oliver Goldsmith – Robert Graham – Robert Graves – Thomas Gray – Thom Gunn – Michael Hamburger – Ian Hamilton – Thomas Hardy – Tony Harrison – Seamus Heaney – John Heath-Stubbs – George Herbert – Robert Herrick – Thomas Heywood – Geoffrey Hill – Ralph Hodgson – David Holbrook – Molly Holden – Thomas Hood – Gerard Manley Hopkins – A. E. Housman – Ted Hughes – T. E. Hulme – Elizabeth Jennings – Lionel Johnson – Ben Jonson – Patrick Kavanagh – John Keats – Sidney Keyes – Thomas Kinsella – Rudyard Kipling – James Kirkup – Charles Lamb – Walter Savage Landor – Philip Larkin – D. H. Lawrence – Edward Lear – Laurie Lee – Alun Lewis – Cecil Day-Lewis – Lady Anne Lindsay – Thomas Lodge – John Logan – Michael Longley – Richard Lovelace – Edward Lowbury – John Lyly – George MacBeth – Norman MacCaig – Hugh MacDiarmid – Louis MacNeice – Derek Mahon – Christopher Marlowe – Andrew Marvell – John Masefield – George Meredith – William Julius Mickle – John Milton – Thomas Moore – William Morris – Andrew Motion – Edwin Muir – Paul Muldoon – Carolina, Lady Nairne – Thomas Nash – Robert Nichols – Norman Nicholson – Bernard O'Donoghue – Wilfred Owen – Coventry Patmore – Tom Paulin – Ambrose Philips – Alexander Pope – Peter Porter – Jonathan Price – F. T. Prince – Matthew Prior – Craig Raine – Peter Redgrove – Henry Reed – Anne Ridler – Michael Riviere – W. R. Rodgers – Samuel Rogers – Isaac Rosenberg – Alan Ross – Christina Georgina Rossetti – Dante Gabriel Rossetti – Carol Rumens – Lawrence Sail – Siegfried Sassoon – Vernon Scannell – Sir Walter Scott – Peter Scupham – Sir Charles Sedley – George Sewell – William Shakespeare – Percy Bysshe Shelley – James Shirley – Sir Philip Sidney – Jon Silkin – C. H. Sisson – Edith Sitwell – Iain Crichton Smith – Stevie Smith – Robert Southey – Bernard Spencer – Stephen Spender – Edmund Spenser – Jon Stallworthy – Anne Stevenson – Sir John Suckling – Algernon Charles Swinburne – Joshua Sylvester – Alfred, Lord Tennyson – Dylan Thomas – Edward Thomas – R. S. Thomas – Francis Thompson – James Thomson (The Seasons) – James Thomson (B.V.) – Anthony Thwaite – Terence Tiller – Charles Tomlinson – The Shepherd Tony – Henry Vaughan – Edward Vere, Earl of Oxford – John Wain – Ted Walker – Edmund Waller – Vernon Watkins – John Webster – Robert Wells – Lawrence Whistler – Hugo Williams – George Wither – Charles Wolfe – William Wordsworth – Sir Henry Wotton – David Wright – Kit Wright – Sir Thomas Wyat – William Butler Yeats – Andrew Young"]}, {"page": "Hodgson", "response": ["* Ralph Hodgson (1871–1962), English poet"]}, {"page": "Oxford Book of Modern Verse 1892–1935", "response": ["*Ralph Hodgson"]}, {"page": "The New Oxford Book of English Verse 1250–1950", "response": ["William Allingham - Matthew Arnold - W. H. Auden - William Barnes - Richard Barnfield - John Beaumont - Thomas Lovell Beddoes - Aphra Behn - Hilaire Belloc - John Betjeman - Laurence Binyon - William Blake - Edmund Blunden - Mark Alexander Boyd - Nicholas Breton - Robert Bridges - Emily Brontë - Rupert Brooke - William Browne of Tavistock - Elizabeth Barrett Browning - Robert Browning - John Bunyan - Robert Burns - Samuel Butler - John Byrom - George Gordon Noel Byron - Thomas Campbell - Thomas Campion - Thomas Carew - Lewis Carroll - George Chapman - Thomas Chatterton - Geoffrey Chaucer - G. K. Chesterton - Henry Chettle - John Clare - John Cleveland - Arthur Hugh Clough - Samuel Taylor Coleridge - William Collins - William Congreve - Richard Corbet - William Cornish - William Cory - Abraham Cowley - George Crabbe - Richard Crashaw - Samuel Daniel - George Darley - William Davenant - John Davidson - John Davies - W. H. Davies - Cecil Day-Lewis - Walter de la Mare - Richard Watson Dixon - John Donne - Keith Douglas - Ernest Dowson - Michael Drayton - William Drummond of Hawthornden - John Dryden - William Dunbar - Edward Dyer - T. S. Eliot - William Empson - Richard Fanshawe - Edward Fitzgerald - James Elroy Flecker - Giles Fletcher - Phineas Fletcher - John Ford - Roy Fuller - George Gascoigne - John Gay - Sidney Godolphin - Oliver Goldsmith - James Graham - Robert Graves - Thomas Gray - Robert Greene - Fulke Greville - William Habington - Thomas Hardy - William Ernest Henley - George Herbert - Lord Herbert of Cherbury - Robert Herrick - Ralph Hodgson - Thomas Hood - Gerard Manley Hopkins - A. E. Housman - Henry Howard, Earl of Surrey - James Leigh Hunt - Lionel Johnson - Samuel Johnson - Ben Jonson - Thomas Jordan - James Joyce - John Keats - Henry King - Rudyard Kipling - Francis Kynaston - Charles Lamb - Walter Savage Landor - William Langland - D. H. Lawrence - Edward Lear - Alun Lewis - Thomas Lodge - Richard Lovelace - John Lyly - Thomas Babington Macaulay - Louis MacNeice - Christopher Marlowe - Andrew Marvell - John Masefield - George Meredith - Alice Meynell - John Milton - Thomas Moore - Thomas Osbert Mordaunt - William Morris - Edwin Muir - Anthony Munday - Thomas Nashe - Charles of Orleans - Wilfred Owen - Coventry Patmore - Thomas Love Peacock - George Peele - Alexander Pope - Ezra Pound - Winthrop Mackworth Praed - Matthew Prior - Francis Quarles - Kathleen Raine - Walter Raleigh - Thomas Randolph - Henry Reed - Anne Ridler - Samuel Rogers - Isaac Rosenberg - Christina Rossetti - Dante Gabriel Rossetti - Charles Sackville - Thomas Sackville - Siegfried Sassoon - John Scott of Amwell - Walter Scott - Charles Sedley - William Shakespeare - Percy Bysshe Shelley - William Shenstone - James Shirley - Philip Sidney - Edith Sitwell - John Skelton - Christopher Smart - Stevie Smith - Robert Southwell - Stephen Spender - Thomas Stanley - Robert Louis Stevenson - William Strode - John Suckling - Jonathan Swift - Algernon Charles Swinburne - Alfred Tennyson - Chidiock Tichborne - Dylan Thomas - Francis Thompson - James Thomson (The Seasons) - James Thomson ('B.V.') - Aurelian Townsend - Thomas Traherne - Walter James Turner - Henry Vaughan - Edmund Waller - Isaac Watts - John Webster - Charles Wesley - Robert Wever - Oscar Wilde - John Wilmot - George Wither - Charles Wolfe - William Wordsworth - Henry Wotton - Thomas Wyatt - W. B. Yeats"]}, {"page": "The Faber Book of Twentieth Century Verse", "response": ["L. Aaronson - Lascelles Abercrombie - Dannie Abse - Drummond Allison - W. H. Auden - George Barker - William Bell - John Betjeman - Laurence Binyon - Thomas Blackburn - Edmund Blunden - Wilfrid Scawen Blunt - Robert Bridges - Rupert Brooke - Norman Cameron - Roy Campbell - Maurice Carpenter - Charles Causley - G. K. Chesterton - Alex Comfort - A. E. Coppard - John Davidson - Idris Davies - W. H. Davies - Walter de la Mare - C. M. Doughty - Keith Douglas - Lawrence Durrell - T. S. Eliot - William Empson - James Elroy Flecker - David Gascoyne - Wilfrid Gibson - W. S. Graham - Robert Graves - Thomas Hardy - H. D. - Thomas Hennell - Rayner Heppenstall - Ralph Hodgson - A. E. Housman - James Joyce - Patrick Kavanagh - Sidney Keyes - Rudyard Kipling - James Kirkup - D. H. Lawrence - Laurie Lee - Alun Lewis - C. Day Lewis - Hugh MacDiarmid - Patrick MacDonogh - Louis MacNeice - John Masefield - Harold Monro - T. Sturge Moore - Edwin Muir - Henry Newbolt - Robert Nichols - Norman Nicholson - Wilfred Owen - Herbert Palmer - Ruth Pitter - William Plomer - Paul Potts - Ezra Pound - F. T. Prince - Kathleen Raine - Herbert Read - Edgell Rickword - Anne Ridler - W. R. Rodgers - Isaac Rosenberg - Siegfried Sassoon - John Short - Edith Sitwell - Stevie Smith - Sydney Goodsir Smith - Stephen Spender - J. C. Squire - Arthur Symons - Dylan Thomas - Edward Thomas - W. J. Turner - Dorothy Wellesley - Vernon Watkins - Anna Wickham - Charles Williams - W. B. Yeats - Andrew Young"]}, {"page": "Oxford poetry anthologies", "response": ["Henry Aldrich - William Allingham - Drummond Allison - John Amner - Matthew Arnold - W. H. Auden - Philip Ayres - William Baldwin - George Barker - Jane Barker - Clement Barksdale - Richard Barnfield - Thomas Bastard - Francis Beaumont - Samuel Beckett - Thomas Lovell Beddoes - Thomas Beedome - Hilaire Belloc - Sir William Berkeley - John Berryman - John Betjeman - Elizabeth Bishop - Thomas Blackburn - William Blake - Edmund Blunden - Francis William Bourdillon - Anne Bradstreet - Robert Bridges - John Digby, Earl of Bristol - Emily Brontë - Elizabeth Barrett Browning - Robert Browning - John Bunyan - Robert Burns - George Gordon, Lord Byron - Norman Campbell - Roy Campbell - Thomas Campion - Thomas Carew - George Chapman - Thomas Chatterton - Geoffrey Chaucer - G. K. Chesterton - Richard Church - John Ciardi - Arthur Hugh Clough - Mary Coleridge - Samuel Taylor Coleridge - William Collins - William Congreve - Frances Cornford - William Johnson Cory - Francis Coutts - William Cowper - George Crabbe - Hart Crane - Stephen Crane - Richard Crashaw - Robert Creeley - John Crowne - E. E. Cummings - J. V. Cunningham - George Daniel - Sir William Davenant - John Davies of Hereford - W. H. Davies - C. Day-Lewis - Walter De La Mare - Sir John Denham - John Warren, Lord De Tabley - Emily Dickinson - Robert Dodsley - John Donne - Ernest Dowson - William Drummond of Hawthornden - John Dryden - Alan Dugan - Sir Edward Dyer - Clifford Dyment - Richard Eberhart - T. S. Eliot - Ralph Waldo Emerson - William Empson - D. J. Enright - Robert Devereux, Earl of Essex - Sir George Etherege - Gavin Ewart - Mildmay Fane, Earl of Westmorland - Sir Richard Fanshawe - Robert Fitzgerald - Thomas Fitzgerald - Thomas Flatman - James Elroy Flecker - Richard Flecknoe - John Fletcher - Phineas Fletcher - Ford Madox Ford - John Ford - Robert Francis - John Freeman - Robert Frost - Roy Fuller - John Gay - Oliver Goldsmith - Robert Graves - Thomas Gray - Fulke Greville - Ivor Gurney - John Hall - Thomas Hardy - Sir John Harington - Seamus Heaney - Robert Heath - Anthony Hecht - Edward, Lord Herbert of Cherbury - George Herbert - Robert Herrick - Thomas Heywood - Aaron Hill - Ralph Hodgson - A. D. Hope - Gerard Manley Hopkins - A. E. Housman - Ted Hughes - T. E. Hulme - Randall Jarrell - Robinson Jeffers - Elizabeth Jennings - Esther Johnson - Sir William Jones - Ben Jonson - Patrick Kavanagh - P. J. Kavanagh - John Keats - X. J. Kennedy - Henry King - Galway Kinnell - Rudyard Kipling - Mary Lamb - Walter Savage Landor - George Granville, Lord Landsdowne - Philip Larkin - D. H. Lawrence - Laurie Lee - Vachel Lindsay - Richard Lovelace - James Russell Lowell - Robert Lowell - Robert Bulwer-Lytton - Norman MacCaig - Hugh MacDiarmid - Patrick MacDonogh - Phyllis McGinley - Louis MacNeice - Derek Mahon - Edward May - Herman Melville - William Meredith - James Merrill - W. S. Merwin - Charlotte Mew - Alice Meynell - James Michie - Thomas Middleton - Edna St. Vincent Millay - John Milton - Adrian Mitchell - Lady Mary Wortley Montagu - James Graham, Marquis of Montrose - Marianne Moore - Thomas Moore - Thomas Nashe - Howard Nemerov - Margaret Cavendish, Duchess of Newcastle - William Cavendish, Duke of Newcastle - Norman Nicholson - Dudley, Lord North - Wilfred Owen - Edward de Vere, Earl of Oxford - Philip Pain - Coventry Patmore - William Pattison - Thomas Love Peacock - George Peele - Katherine Philips - Eden Phillpotts - Sylvia Plath - Alexander Pope - Ezra Pound - F. T. Prince - Matthew Prior - Francis Quarles - Sir Walter Ralegh - Thomas Randolph - John Crowe Ransom - James Reeves - Edwin Arlington Robinson - John Wilmot, Earl of Rochester - W. R. Rodgers - Theodore Roethke - Christina Rossetti - Dante Gabriel Rossetti - Samuel Rowlands - George William Russell - Thomas Rymer - Charles Sackville, Earl of Dorset - Carl Sandburg - Siegfried Sassoon - Sir Walter Scott - William Shakespeare - Percy Bysshe Shelley - William Shenstone - Sir Edward Sherburne - James Shirley - Sir Philip Sidney - James Simmons - C. H. Sisson - Edith Sitwell - John Skelton - Jonathan Smedley - Stevie Smith - William Jay Smith - Robert Southey - Muriel Spark - Sir John Squire - Sir Richard Steele - James Stephens - Wallace Stevens - Anne Stevenson - Robert Louis Stevenson - Trumbull Stickney - William Strode - Jonathan Swift - Arthur Symons - J. M. Synge - Nahum Tate - Alfred, Lord Tennyson - A. S. J. Tessimond - Dylan Thomas - Edward Thomas - R. S. Thomas - Francis Thompson - Henry Thoreau - Thomas Traherne - George Turbervile - John Updike - Mark Van Doren - Henry Vaughan - Edmund Waller - William Walsh - Vernon Watkins - Samuel Wesley - Walt Whitman - John Greenleaf Whittier - Anna Wickham - John Wigson - Richard Wilbur - Oscar Wilde - William Carlos Williams - Anne Finch, Countess of Winchilsea - William Wordsworth - Judith Wright - Sir Thomas Wyatt - Elinor Wylie - W. B. Yeats - Andrew Young"]}, {"page": "Queen's Gold Medal for Poetry", "response": ["* 1954: Ralph Hodgson"]}, {"page": "Flying Fame Press", "response": ["#REDIRECT Ralph Hodgson"]}, {"page": "Poems of Today", "response": ["A. E. - Lascelles Abercrombie - H. C. Beeching - Hilaire Belloc - Laurence Binyon - W. S. Blunt - Robert Bridges - Rupert Brooke - William Canton - P. R. Chalmers - G. K. Chesterton - Mary E. Coleridge - Padraic Colum - Frances Cornford - A. S. Cripps - John Davidson - W. H. Davies - Walter De la Mare - John Drinkwater - J. E. Flecker - Edmund Gosse - Gerald Gould - Ralph Hodgson - Laurence Housman - Lionel Johnson - Rudyard Kipling - Shane Leslie - Rose Macaulay - J. W. Mackail - John Masefield - George Meredith - Alice Meynell - T. Sturge Moore - Sir Henry Newbolt - J. B. B. Nichols - Alfred Noyes - Sir A. T. Quiller-Couch - Ernest Radford - Ada Smith - R. L. Stevenson - Arthur Symons - Francis Thompson - Herbert Trench - Katharine Tynan - William Watson - Margaret L. Woods - W. B. Yeats", "A. E. - Herbert Asquith - Maurice Baring - Hilaire Belloc - Laurence Binyon - Edmund Blunden - F. S. Boas - Eva Gore-Booth - Gordon Bottomley - F. W. Bourdillon - Robert Bridges - Rupert Brooke - T. E. Brown - A. H. Bullen - E. K. Chambers - G. K. Chesterton - Padraic Colum - The Marquess of Crewe - Walter De la Mare - Geoffrey Dearmer - John Drinkwater - V. L. Edminson - Michael Field - J. E. Flecker - John Freeman - Margaret C. Furse - John Galsworthy - Wilfred Wilson Gibson - Julian Grenfell - Thomas Hardy - F. W. Harvey - Ralph Hodgson - W. N. Hodgson - A. E. Housman - Aldous Huxley - Violet Jacob - Francis Ledwidge - Winifred M. Letts - Sidney Royse Lysaght - Rose Macaulay - Alasdair MacGregor - E. A. Mackintosh - John Masefield - Beatrice Mayor - Charlotte Mew - Alice Meynell - Harold Monro - T. Sturge Moore - F. W. Moorman - Gilbert Murray - Sir Henry Newbolt - Robert Nichols - Madeleine Nightingale - Moira O'Neill - Seamus O'Sullivan - Joseph M. Plunkett - Madeleine Caron Rock - Lady Margaret Sackville - Siegfried Sassoon - Edward Shanks - Charles Hamilton Sorley - Sir Cecil Spring Rice - James Stephens - Edward Wyndham Tennant - Edward Thomas - Francis Thompson - Herbert Trench - W. J. Turner - Evelyn Underhill - Lucy Whitmell - T. P. Cameron Wilson - W. B. Yeats", "C. Colleer Abbott - John Arlott - W. H. Auden - George Barker - John Bayliss - Frances Bellerby - John Betjeman - Laurence Binyon - Edmund Blunden - Ronald Bottrall - Lilian Bowes Lyon - C. W. Brodribb - Gerald Bullett - Guy Butler - John Buxton - Roy Campbell - Demetrios Capetanakis - Joyce Cary - Richard Church - Alex Comfort - R. N. Currey - W. H. Davies - Walter De La Mare - Patric Dickinson - Keith Douglas - Adam Drinan - Clifford Dyment - T. S. Eliot - Arundell Esdaile - G. S. Fraser - Roy Fuller - Jill Furse - H. W. Garrod - Viola Garvin - David Gascoyne - Wilfrid Gibson - O. St. J. Gogarty - Helen Granville-Barker - Robert Graves - Geoffrey Grigson - Stephen Haggard - J. C. Hall - G. Rostrevor Hamilton - Christopher Hassall - John Heath-Stubbs - J. F. Hendry - Charles Hepburn - F. R. Higgins - Ralph Hodgson - Seán Jennett - Frank Kendon - Sidney Keyes - James Kirkup - Laurie Lee - John Lehmann - Alun Lewis - C. Day-Lewis - C. S. Lewis - Emanuel Litvinoff - Sylvia Lynd - Donagh MacDonagh - Louis MacNeice - John Masefield - E. H. W. Meyerstein - Francis Meynell - Edwin Muir - Norman Nicholson - Herbert Palmer - V. de Sola Pinto - Ruth Pitter - William Plomer - F. T. Prince - John Pudney - Kathleen Raine - Herbert Read - Henry Reed - Alexander Reid - Anne Ridler - W. R. Rodgers - Alan Rook - A. L. Rowse - V. Sackville-West - Siegfried Sassoon - E. J. Scovell - Ian Serraillier - John Short - Edith Sitwell - Osbert Sitwell - Martyn Skinner - Stevie Smith - Stanley Snaith - Helen Spalding - Stephen Spender - James Stephens - L. A. G. Strong - Hal Summers - A. S. J. Tessimond - Dylan Thomas - Terence Tiller - Henry Treece - R. C. Trevelyan - W. J. Turner - John Waller - Rex Warner - Vernon Watkins - Dorothy Wellesley - Laurence Whistler - W. B. Yeats - Andrew Young"]}, {"page": "Holbrook Jackson", "response": ["At the same period he set up in 1912 or 1913 the Flying Fame Press, with the poet Ralph Hodgson and designer Claud Lovat Fraser. This was the beginning of a long association with small press and the worlds of typography and book collecting, on which he wrote extensively. He was in the short-lived Fleuron Society (1923) with Stanley Morison, Francis Meynell, Bernard Newdigate and Oliver Simon. He did more, as a patron of the Pelican Press amongst others, to encourage the raising of production standards of books."]}, {"page": "The Clientele", "response": ["Their music has often been noted for its reverb-rich production  and MacLean's distinctive breathy vocals (an effect achieved partly by MacLean singing with a microphone plugged into a guitar amplifier) and fingerstyle guitar technique. Their lyrics take a strong inspiration from surrealist literature and art from the early 20th century; \"We Could Walk Together\" quotes a line (\"like a silver ring thrown into the flood of my heart\") from a 1928 poem by French surrealist Joë Bousquet; in its final two verses, the song \"What Goes Up\" quotes the poem \"Stupidity Street\" by Ralph Hodgson in its entirety. "]}, {"page": "1954 in poetry", "response": ["* King's Gold Medal for Poetry: Ralph Hodgson"]}, {"page": "Wesley D. Sweetser", "response": ["* Ralph Hodgson — a Bibliography by Wesley D. Sweetser. Garland, New York, 1980."]}, {"page": "1962 in poetry", "response": ["* November 3 – Ralph Hodgson, 91 (born 1871), English poet"]}, {"page": "1961 in poetry", "response": ["* Ralph Hodgson, Collected Poems"]}, {"page": "1933 in poetry", "response": ["*Ralph Hodgson"]}, {"page": "Reynolds Stone", "response": ["Sylvia Townsend Warner wrote poems to complement a series of wood engravings that Stone had already completed. The result was Boxwood (1957), a limited edition of 500 copies, an extended new edition of which was published in 1960. Stone continued with A Sociable Plover by Eric Linklater (1957) and The Skylark and other poems by Ralph Hodgson (1958)."]}, {"page": "1871 in poetry", "response": ["* September 9 – Ralph Hodgson (died 1962), British"]}, {"page": "Literary Taste: How to Form It", "response": ["* Ralph Hodgson"]}, {"page": "Charles Dalmon", "response": ["Dalmon was a contributor to The Yellow Book, and was published in The Living Age, in the mid-1890s. His poems subsequently appeared in many anthologies,Including his Camelot in the 1929 John Drinkwater Twentieth-Century Poetry. but his reputation was never bright.A review in The Daily Telegraph > (25 June 2006) noted that John Betjeman was a fan, classing Dalmon with \"dim and half-forgotten poets\" such as Theodore Wratislaw, William Renton and Edmund John. Jean Moorcroft WilsonIn her Siegfried Sassoon, volume II (1918-1967) from 2003, p.257. notes that Siegfried Sassoon and Ralph Hodgson planned to publish \"small, neglected authors\", into which group Dalmon fell with Thomas Ashe and Primovard Dugard."]}, {"page": "Claud Lovat Fraser", "response": ["In 1913, along with Holbrook Jackson and the poet Ralph Hodgson, Lovat Fraser established a small publishing firm called The Sign of the Flying Fame to produce decorative poetry broadsides and chapbooks. Although printed in limited editions and often hand-coloured, they were affordably priced and were intended to make poetry more accessible to the general public."]}, {"page": "A Little Treasury of Modern Poetry", "response": ["Gerard Manley Hopkins, Francis Thompson, James Stephens, A. E. Housman, Thomas Hardy, Delmore Schwartz, Vernon Watkins, Stephen Spender, Conrad Aiken, Henry Treece, George Barker, Elizabeth Bishop, T. S. Eliot, Theodore Spencer, Dylan Thomas, W. B. Yeats, Léonie Adams, Yvor Winters, Edwin Muir, W. R. Rodgers, Robert Graves, R. P. Blackmur, Walter de la Mare, W. J. Turner, Robert Frost, Louis MacNeice, Muriel Rukeyser, Albie Huston Evans, Elinor Wylie, Robert Penn Warren, W. H. Davies, Robert Bridges, E. E. Cummings, John Manifold, Geoffrey Grigson, Emily Dickinson, W. H. Auden, Robinson Jeffers, Helen Hoyt, Maxwell Bodenheim, Patrick Orr, Richard Eberhart, Edwin Arlington Robinson, Allen Tate, Edgar Lee Masters, John Crowe Ransom, John Hall Wheelock, Harold Monro, Mark Van Doren, John Peale Bishop, Sidney Keyes, John Berryman, Hart Crane, Frederic Prokosch, Julian Symons, Karl Shapiro, Dunstan Thompson, F. T. Prince, Wilfred Owen, alan Seeger, Roy Fuller, Shaemas O'Sheel, Herbert Read, Winfield Townley Scott, Rupert Brooke, Isaac Rosenberg, Edith Sitwell, Marianne Moore, Rolfe Humphries, Oscar Williams, Jean Garrigue, D. H. Lawrence, Gene Derwood, Alex Comfort, Timothy Corsellis, Alun Lewis, Lawrence Durrell, Archibald MacLeish, John Masefield, Wallace Stevens, Glenway Wescott, Marshall Schact, Edna St. Vincent Millay, Sara Teasdale, Esther Mathews, A. E. Coppard, Louise Bogan, John Thompson, Jr, H. D., James Joyce, Anne Ridler, W. J. Turner, Ezra Pound, Edwin Denby, Michael Roberts, Edward Thomas, John Drinkwater, Edith Wyatt, George Santayana, D. S. Savage, William Empson, Hildegarde Flanner, Edwin Markham, Vachel Lindsay, Ben Maddow, Alfred Hayes, William Carlos Williams, Sarah Norcliffe Cleghorn, Roy Campbell, Terence Heywood, John Davidson, Ralph Hodgson, Rudyard Kipling, Peter Quennell, F. R. Higgins, John Malcolm Brinnin, Frances Cornford, H. H. Lewis, John Betjeman, G. K. Chesterton, E. V. Swart, Philip O'Connor, Ogden Nash, David Daiches, Kenneth Fearing, W. S. Gilbert, Marsden Hartley, Geoffrey Taylor, Gelett Burgess, Gavin Ewart, Arnold Bennett, C. D. B. Ellis, Gertrude Stein, Anthony Euwer, \"Emanuel Morgan\", Harry Graham, Oliver St. John Gogarty."]}, {"page": "Big Budget", "response": ["Notable contributors include Jack Butler Yeats (Signor McCoy the Circus, John Duff-Pie, Little Boy Pink, and Kiroskewero the Detective), and Ernest Wilkinson (Doings of Von Puff, Von Eye, Iko Italiano and Von Sausage the Dog), C. H. Chapman, and Ralph Hodgson under the pseudonym \"Yorick.\"  It is also notable as the first publication to publish the work of cartoonist David Low, a three-strip cartoon in 1902, when he was aged only 11."]}]}}