{"wiki_id": "http://www.wikidata.org/entity/Q18572319", "itemLabel": "William Nolan", "itemDescription": "Roman Catholic bishop", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Nolan_(bishop)", "wikipedia_page": {"main": "William Nolan (born 26 January 1954) is the current Roman Catholic Bishop of Galloway.", "link_mentions": [{"page": "Bishop of Galloway", "response": ["The diocese was resurrected on 4 March 1878 from the Vicariate Apostolic of the Western District.  The church of Saint Andrew in Dumfries served as pro-cathedral until it was destroyed by a fire in May 1961 and the seat moved to Ayr in 1962.  The current bishop, appointed 2014,  is the Right Reverend William Nolan the 8th Bishop of Galloway. The diocese covers an area of 9,332 km².  The see is in the Ecclesiastical City of Ayr. Until 2007 the seat was located at the Cathedral Church of the Good Shepherd which was built in 1957. In early 2007 Pope Benedict XVI accepted the petition of Right Reverend John Cunningham, the 7th Bishop of Galloway, to move the seat to St Margaret's Church, Ayr. After this took place, the Church of the Good Shepherd was closed and largely demolished.", "|22 November 2014 to present||William Nolan||Priest; ordained 22 February 2015"]}, {"page": "Bishops' Conference of Scotland", "response": ["**Bishop William Nolan"]}, {"page": "Roman Catholic Diocese of Motherwell", "response": ["*William Nolan, appointed Bishop of Galloway in 2014", "Another priest of the diocese, William Nolan, is the current bishop of the Diocese of Galloway. Both Bishop Nolan and Bishop Taylor are former parish priests of Our Lady of Lourdes, East Kilbride who later became Bishop of Galloway."]}, {"page": "Scots College (Rome)", "response": ["*William Nolan (born 1954), Bishop of Galloway"]}, {"page": "John Cunningham (bishop)", "response": ["Cunningham retired on 22 November 2014 when Pope Francis' appointment of William Nolan as his successor was announced. He died on 1 December 2021, at the age of 83."]}, {"page": "William Nolan", "response": ["* William Nolan (bishop) (born 1954), Bishop of Galloway, Scotland"]}, {"page": "Roman Catholic Diocese of Galloway", "response": ["The eighth and present bishop of the diocese is the Right Reverend William Nolan.", "* William Nolan  (appointed 22 November 2014, ordained and installed 14 February 2015)"]}, {"page": "Simon Beveridge", "response": ["On 17 June 2017, Beveridge was ordained as a deacon of the Roman Catholic Church by Robert Byrne, Auxiliary Bishop for Birmingham. Beveridge serves the Personal Ordinariate of Our Lady of Walsingham in Scotland. He was ordained to the priesthood by William Nolan, Bishop of Galloway, on 14 December 2017."]}]}}