{"wiki_id": "http://www.wikidata.org/entity/Q18531749", "itemLabel": "Zoe Dyke", "itemDescription": "Dyke [née Bond], (Millicent) Zoë, Lady Dyke (1896–1975), pioneer of British sericulture", "wikipedia_url": "https://en.wikipedia.org/wiki/Zoe_Dyke", "wikipedia_page": {"main": "Zoe Dyke (6 February 1896 – 12 February 1975) was a British pioneer of British sericulture. The silk created in her businesses has been used by British Royalty including the wedding dresses of Queen Elizabeth II and Diana, Princess of Wales.", "link_mentions": [{"page": "Ayot St Lawrence", "response": ["During the 1950s, the silk-maker Zoe Dyke (1896–1975) moved her business to Ayot House.John Martin, \"Dyke, (Millicent) Zoë, Lady Dyke (1896–1975)\", Oxford Dictionary of National Biography, Oxford University Press, 2004; online edn, Oct 2007 accessed 12 July 2017 The historical novelist, biographer and children's writer Carola Oman, Lady Lenanton (1897–1978) lived at Bride Hall with her husband. She died there on 11 June 1978.Mark Bostridge: \"Oman, Carola Mary Anima (married name Carola Mary Anima Lenanton, Lady Lenanton)\" Oxford Dictionary of National Biography, Oxford University Press, 2004. Retrieved 10 April 2019."]}, {"page": "Sir William Hart Dyke, 7th Baronet", "response": ["Hart Dyke married Lady Emily Caroline Montague, daughter of the 7th Earl of Sandwich, in 1870. He died in July 1931, aged 93, and was succeeded in the baronetcy by his fourth and only surviving son, Oliver. Oliver was married to Zoe Dyke who farmed silk worms.John Martin, ‘Dyke , (Millicent) Zoë, Lady Dyke (1896–1975)’, Oxford Dictionary of National Biography, Oxford University Press, 2004; online edn, Oct 2007 accessed 12 July 2017 The elder Lady Hart Dyke survived her husband by only a month and died in August 1931.thepeerage.com"]}, {"page": "Lullingstone Castle", "response": ["Zoe Dyke created the Lullingstone Silk Farm here which was visited by Queen Mary and as a result it created silk for the coronation robe of King George VI. The farm has since moved away but has produced silk for other important Royal events including the Wedding dress of Princess Elizabeth and the Wedding dress of Lady Diana Spencer."]}, {"page": "Ayot Park", "response": ["In the 1950s the house was used by Zoe Dyke's silk farming business, which relocated from Lullingstone Castle.John Martin, ‘Dyke , (Millicent) Zoë, Lady Dyke (1896–1975)’, Oxford Dictionary of National Biography, Oxford University Press, 2004; online edn, Oct 2007 accessed 12 July 2017"]}]}}