{"wiki_id": "http://www.wikidata.org/entity/Q18593098", "itemLabel": "Helen Gladstone", "itemDescription": "English educationist", "wikipedia_url": "https://en.wikipedia.org/wiki/Helen_Gladstone", "wikipedia_page": {"main": "Helen Gladstone (1849 – 19 August 1925) was a British educationist and vice-principal at Newnham College in Cambridge.\n\n", "link_mentions": [{"page": "William Ewart Gladstone", "response": ["* Helen Gladstone (28 August 1849 – 19 August 1925), Vice-Principal of Newnham College, Cambridge"]}, {"page": "Katharine Stephen", "response": ["Katharine Stephen worked at Newnham College, Cambridge. She first joined the college as Helen Gladstone's secretary, and worked with Anne Jemima Clough to teach working men on Sunday mornings in St Matthew's Schoolroom, Barnwell. She was appointed Librarian of Newnham's 'first purpose-built library' in 1888. She went on to become Vice-Principal and, in 1911, Principal of the college during the First World War years, and kept her seat on the Council after her retirement in 1920."]}, {"page": "Auguste Schlüter", "response": ["Auguste Schlüter was born in the Kingdom of Hanover, 27 June 1849. Her life changed when she was seventeen as she was in England where she was employed by the politician and Prime Minister William and Catherine Gladstone. Schlüter did not speak much English but she decided to keep a diary as she worked as a maid looking after two of her employer's daughters, Mary and Helen Gladstone."]}, {"page": "Blackfriars Settlement", "response": ["The Women's University Settlement was founded after a talk by Henrietta Barnett to the Cambridge Ladies' Discussion Society.  Toynbee Hall had been founded in 1884, and female students resolved to set up a similar project. Representatives from Girton College and Newnham College at Cambridge University, and Lady Margaret Hall and Somerville College at Oxford University, formed the Women's University Association. A Newnham student Alice Gruner was appointed Head Worker, and the organization was based at her house at 44 Nelson Square, Southwark. Other Newnham students involved in the venture included Mary Paley Marshall, Nora Sidgwick, and the Prime Minister's daughter Helen Gladstone. Octavia Hill, who became a housing reformer and founder of the National Trust, was also an active member. In 1888 the Association was renamed the Women's University Settlement. Gruber resigned as Warden, and in 1891 a paid Warden, Margaret Sewell, was appointed. By 1895 the Settlement had 31 resident and 61 non-resident workers. It organized children's clubs, holiday treats and classes in music and dance for local children. Helen Gladstone served as Warden in the early twentieth century. ", "By 1912 the Settlement had started to train social workers for work elsewhere. However, its lack of institutional funding forced a public appeal for funds, to buy a hall and ensure a secure financial footing.Avebury, Thomas Barlow, Charles Booth, C. Roden Buxton, Helen Gladstone, Alfred Marshall, Henry A. Miers, Henry E. Roscoe and Eleanor Mildred Sidgwick, 'The Women's University Settlement In Southwark', The Times, 3 June 1912, p. 7. In 1926 the Settlement's activities included a baby centre, a mixed children's club for boys and girls, the Southwark Boys' Aid Association, work on care committees and remedial exercises and light treatment for children. Graham Wallas, presiding at the organization's AGM, saw it as exemplifying the way in which social work had moved from Victorian amateurism to professional activity on scientific lines.\"Women's University Settlement: Professor Graham Wallas on Social Work\", The Times, 24 March 1926, p. 18. Wyndham Deedes reported ongoing growth at the 1929 AGM: a nursing school, a clothes sale section and a legal aid department had been established, and the number of children under the Settlement's infant welfare section had risen to 1,200.'Women's University Settlement', The Times, 21 March 1929, p. 13."]}, {"page": "Alice Gruner", "response": ["In 1887, Gruner was among the founders of the Women's University Settlement, Southwark. Alongside Gruner and other Cambridge University graduates, the original committee included educationist Helen Gladstone and social reformer Octavia Hill. Following the example of the growing University Settlement movement, their aim was to \"promote the welfare of the poorer districts of London, more especially of the women and children, by devising and advancing schemes which tend to elevate them, and by giving them additional opportunities in education and recreation\"."]}, {"page": "Margaret Sewell", "response": ["In 1901 Helen Gladstone replaced Sewell as Warden, after ten years in the post and some poor health.", "thumb|Helen Gladstone House, Nelson Square, Southwark, 2014 photograph"]}]}}