{"wiki_id": "http://www.wikidata.org/entity/Q18528792", "itemLabel": "Lydia Sellon", "itemDescription": "British founder of the Society of the Most Holy Trinity", "wikipedia_url": "https://en.wikipedia.org/wiki/Lydia_Sellon", "wikipedia_page": {"main": "Lydia Sellon or Priscilla Lydia Sellon (1821 – 20 November 1876) was a British founder of an Anglican women's order. The Church of England established November 20 as a holy day to commemorate her work.", "link_mentions": [{"page": "Henry Phillpotts", "response": ["In 1848 he placed an appeal in The Guardian of 5 January 1848, for help for the poor of Devonport; his request was answered by Lydia Sellon who was just about to travel to Italy for her health. Philpott's inspiration of Sellon led to the formation of an Anglican order which Sellon led."]}, {"page": "Plymouth College", "response": ["In 1976, the first girls were admitted to the school's sixth form. It became fully coeducational in 1995. In 2004, the school absorbed St Dunstan's Abbey School, an independent school for girls that had been founded by Lydia Sellon.A Sermon , Ascot Priory, retrieved 26 April 2015 The combined school is still known as Plymouth College and remains at Ford Park, near Mutley Plain, just north of the city centre. The preparatory school was located a mile south-west, within the gated Millfields complex at Stonehouse until 2021,when it was moved onto the main Ford Park site. "]}, {"page": "Grosmont, Monmouthshire", "response": ["The Anglican \"saint\" Lydia Sellon was brought up at Port-y-seal in Grosmont in the 1820s before she went on to found and lead a religious order for women.Peter G. Cobb, ‘Sellon, (Priscilla) Lydia (1821–1876)’, Oxford Dictionary of National Biography, Oxford University Press, 2004 accessed 26 April 2015"]}, {"page": "1848 in the United Kingdom", "response": ["* New Anglican sisterhoods founded: Society of the Most Holy Trinity (the 'Devonport Sisters' or Ascot Priory) is established by Lydia Sellon to minister to the poor in the seafaring community of Devonport and the Community of St Mary the Virgin is founded at Wantage."]}, {"page": "List of monastic houses in Devon", "response": ["|Sisters of the Most Holy Trinityfounded by Priscilla Lydia Sellon with the support of the Henry Phillpott, Bishop of Exeter;History , Ascot Priory, retrieved 25 April 2015transferred to Berkshire 1906;property transferred to St Mary the Virgin at Wantage, who continued in use as St Dunstan Abbey School for Girls"]}, {"page": "Frances Margaret Taylor", "response": ["Frances developed a desire to serve the poor and vulnerable of London. In 1849 she made an abortive application to become a member of St John's House, based in Fitzroy Square, a nursing school which also functioned as an Anglican religious community.London Metropolitan Archives In 1848 her sisters Emma and Charlotte had joined an Anglican Sisterhood, the Sisters of Mercy of the Holy Trinity (Devonport) founded by Priscilla Lydia Sellon. Frances followed suit around 1852, as a 'visitor', and she appears to have stayed for two years. She was involved in nurse training and hospital work at Bristol, and she appears to have served as a nurse in Plymouth during the cholera epidemic of 1853.Thomas Jay Williams, Priscilla Lydia Sellon (1965) By that time, like her sister Charlotte, she had come to realise that her vocation lay elsewhere.The most important secondary source for the life of Frances Taylor is the biography by Fr F. C. Devas SJ, based on the congregational archives and the Taylor family papers, and on the unpublished 'memoir' by her contemporary, Sister Mary Campion Troughton SMG (1908), held in the congregational archives."]}, {"page": "Ascot Priory", "response": ["The community was established by Lydia Sellon in 1849 as the Society of the Most Holy Trinity, the second Anglican sisterhood, to minister to the poor in the seafaring community of Devonport, hence their popular name, the Devonport Sisters. The society expanded rapidly, and in the 1850s absorbed London communities, including the first-established, the Sisterhood of the Holy Cross (\"Park Village Community\")."]}, {"page": "St Dunstan's Abbey", "response": ["St Dunstan's Abbey, Plymouth was an abbey in Plymouth, Devon, England. The Sisters of the Most Holy Trinity under Priscilla Lydia Sellon with the support of the Henry Phillpotts, Bishop of Exeter founded an Anglican convent in New North Road.History , Ascot Priory, retrieved 25 April 2015"]}, {"page": "Former religious orders in the Anglican Communion", "response": ["The Society of the Most Holy Trinity, also known more simply as the Society of the Holy Trinity, was established by Lydia Sellon in 1849, the second Anglican religious order established for women, to minister to the poor in the seafaring community of Devonport, hence their popular name, the Devonport Sisters. The Society expanded rapidly, and in the 1850s absorbed several smaller London communities, including the first-established, the Sisterhood of the Holy Cross (or 'Park Village Community'). The order grew large and very active, from its work with Florence Nightingale in the Crimea, to the establishing of a convalescent hospital and a grammar school (St Christopher's). The rule of the order was based on that of St Francis de Sales.See \"Guide to the Religious Communities of the Anglican Communion\", Mowbrays, 1951, page 53. From 1860, the community was resident at Ascot Priory in Berkshire, which remained its headquarters until the closure of the community in 2004. At the start of the 2000s the community had grown very small, and some sisters were placed with other (larger) orders, such as Sr Rosemary SHT who lived her final years with the Community of the Holy Name. The last sister was Reverend Mother Cecilia SHT, who joined the community in 1935, having been born in 1914, and offered herself as a postulant at the age of 18. She died on 12 February 2004, aged 89, and thus ended the life of the Society. Before her death, Mother Cecilia established a trust to ensure that the buildings at Ascot Priory continued to be used for the good of the Church of England and of society in general, principally in the care of the elderly, but also through the provision of facilities for retreats and conferences."]}, {"page": "Priscilla Lydia Sellon", "response": ["#REDIRECTLydia Sellon"]}, {"page": "Sellon", "response": ["*Lydia Sellon (1821–1876), British founder of an Anglican women's order"]}]}}