{"wiki_id": "http://www.wikidata.org/entity/Q18530684", "itemLabel": "Andrew Rae Gilchrist", "itemDescription": "physician and cardiologist", "wikipedia_url": "https://en.wikipedia.org/wiki/Andrew_Rae_Gilchrist", "wikipedia_page": {"main": "Prof Andrew Rae Gilchrist CBE  PRCPE FRSE FRCP (7 July 1899 – 1 March 1995) was a Scottish cardiologist who served as President of the Royal College of Physicians of Edinburgh 1957 to 1960. He was its longest serving Fellow: 1929 to 1995 (66 years). He did extensive work on anti-coagulants. In 1959 he was a co-founder of the British Heart Foundation, a charity raising funds for heart research.", "link_mentions": [{"page": "1961 Birthday Honours", "response": ["* Andrew Rae Gilchrist, , Physician and Consultant in Cardiology, Edinburgh Royal Infirmary."]}, {"page": "List of presidents of the Royal College of Physicians of Edinburgh", "response": ["| Andrew Rae Gilchrist"]}, {"page": "Alexander Rae Gilchrist", "response": ["#REDIRECT Andrew Rae Gilchrist"]}, {"page": "Hamish Watson (paediatrician)", "response": ["Following his graduation, Watson spent his national service in Africa as RMO, Nigeria Regiment. Watson returned to Edinburgh with a small collection of animals bound for the zoo.  His medical career continued at the Royal Infirmary of Edinburgh where he was strongly influenced by cardiologist Andrew Rae Gilchrist, who established the cardiology department at the Infirmary. Two years later, Watson moved to St Andrews University Department of Medicine under Sir Ian Hill, working in Dundee hospitals.  Watson's early research was in the field of anticoagulant therapy but the tragic death of his young son from severe congenital heart disease, provided the impetus for him to undertake pioneering research work in congenital heart disease in children.  From this, Watson developed a diagnostic and treatment technique which involved the insertion of narrow tubes into the heart – cardiac catheterisation. Watson went on to establish the first coronary care unit in Tayside and was appointed both Post-graduate Dean at the University of Dundee and head of the Cardiology Department at Dundee Royal Infirmary.  Watson was editor of the 1968 multi-authored book, Paediatric Cardiology which became a standard text for students. Watson was influential in the establishment of the European Association of Paediatric Cardiologists, becoming its first president. Watson was also a Fellow of the American College of Cardiology, and in 1987, joint chairman of the British Cardiac Society and a trustee of the Royal College of Physicians of Edinburgh."]}, {"page": "Extramural medical education in Edinburgh", "response": ["* James Ormiston Affleck, Byrom Bramwell, William Russel, George Alexander Gibson, Robert William Philip, John Comrie, Douglas Chalmers Watson, Andrew Rae Gilchrist, T R R Todd, David Murray Lyon (Medicine)"]}]}}