{"wiki_id": "http://www.wikidata.org/entity/Q18527623", "itemLabel": "George Trevor", "itemDescription": "Church of England clergyman and writer", "wikipedia_url": "https://en.wikipedia.org/wiki/George_Trevor", "wikipedia_page": {"main": "George Trevor (30 Jan. 1809–18 June 1888) was an English divine, and writer on divinity matters.\nTrevor was born at Bridgwater, Somerset, on 30 Jan. 1809, was the sixth son of Charles Trevor, an officer in the customs at Bridgwater, and afterwards at Belfast. His paternal grandmother, Harriet, was the sister of Horatio and James Smith, the authors of ‘Rejected Addresses.’ He was educated at a day school at Bridgwater, and on 25 May 1825 entered the India House, London, as a clerk. He was contemporary with John Stuart Mill, who entered on 21 May 1823. In London he made the acquaintance of the D'Israelis, and with Benjamin attended political meetings. On 6 Feb. 1832 he matriculated from Hertford College, Oxford, and contrived to keep his terms while discharging his duties as clerk. He graduated B.A. in 1846 and M.A. in 1847, and was a prominent speaker at the Oxford Union In September 1833 he contributed to ‘Blackwood's Magazine’ an English verse translation of the ‘Nautilus’ of Callimachus, which the editor, Christopher North, praised warmly. It was the first of several similar essays. In 1835, after he had resigned his clerkship at the East India House, he was ordained deacon, and received priest's orders in the year following. From 1836 to 1845 he was chaplain to the East India Company in the Madras establishment, ministering at Madras for a year, and then at Bangalore. His labours were not confined to the European population, and he founded a flourishing Tamil mission.\nTrevor was an enthusiastic champion of high-church opinions when in 1845 he returned to England. Soon afterwards he was appointed resident deputy of the Society for the Propagation of the Gospel in the province of York. In 1847 he was instituted rector of All Saints, Pavement, York, and at the same time received a non-residentiary canonry in York Cathedral, with the prebendal stall of Apesthorp. In 1850 he was appointed chaplain of Sheffield parish church, and took up his residence in the town. He was, however, prevented from preaching in the church by the successive vicars, Dr. Thomas Sutton and Dr. Thomas Sale, on account of his sacramentarian views. To rebut the suspicion of Roman Catholic sympathies, he gave a series of lectures on the Reformation, which drew large crowds. His right to the office and endowments was established by proceedings in chancery and the queen's bench, but the pulpit remained closed to him, and he eventually returned to York in 1855, leaving a curate in charge at Sheffield. In the spring of 1858 he made a temporary removal to London, engaging himself for two years as preacher at St. Philip's, Regent Street.\nIn 1860, on the accession of Charles Thomas Longley to the archbishopric of York, the powers of the northern convocation were restored, after they had long lain dormant. This revival was largely due to Trevor's strenuous efforts. In 1847 he had been returned proctor for the chapter of York, and had moved to elect a prolocutor, with a view to proceeding to business. Convocation was, however, according to custom, immediately adjourned, and nothing further was done towards re-establishing its active functions during the life of the archbishop, Thomas Musgrave. In 1852 Trevor published The Convocations of the two Provinces, their origin, constitution, and forms of proceeding, a work which had considerable influence on clerical opinion, and in the same year he was returned proctor for the archdeaconry of York.\nOn the union of the two houses of convocation, after the accession of William Thomson in 1862, Trevor was appointed synodal secretary, and in that capacity greatly extended the representative character of convocation. In 1868, quitting York, he retired to the living of Burton Pidsea in Holderness, and in 1871 he was translated by the archbishop to the rectory of Beeford with Lisset and Dunnington. In 1874 he received by diploma from Trinity College the degree of D.D., in recognition of his great work, The Catholic Doctrine of the Holy Eucharist. A new enlarged edition appeared in 1875, with an appendix of authorities in the original Greek and Latin, bearing a dedication to Walter Farquhar Hook, dean of Chichester, to whose school of thought Trevor belonged. In this treatise he vindicated the Anglican doctrine of the eucharist against the Roman, Lutheran, and Zwinglian conceptions. It was considered by Hook the standard work on the subject. In 1880 Trevor received the honorary degree of M.A. from the university of Durham, and in 1886 that of D.D. He died on 18 June 1888 in the rectory of his son, George Wilberforce Trevor, at Marton, near Middlesbrough, in Yorkshire, and was buried at Beeford. A memorial tablet was erected to his memory in the north aisle of the choir of York minster. On 12 July 1836 he married Elizabeth, daughter of Christopher Philip Garrick of Richmond, Surrey, the grandson of George Garrick, David Garrick's brother. By her he left several children, including Frederick Trevor. Trevor was well known both as an orator and an author. At the Oxford Union he was regarded as Gladstone's successor, and in later life he was famous for his eloquence.", "link_mentions": [{"page": "Trevor, George", "response": ["#redirectGeorge Trevor"]}, {"page": "Frederick Trevor", "response": ["The son of The Reverend George Trevor, he was born at Madras in British India. He was educated in England at Marlborough College, where he played for the college cricket eleven, featuring in their first match against Rugby School in 1855. Trevor later played first-class cricket for the Marylebone Cricket Club (MCC), making a single appearance against Middlesex in 1864. Batting twice in the match, he was dismissed for 8 runs in the MCC first innings by Thomas Hearne, while in their second innings he was dismissed by the same bowler for 4 runs. He served as a civil servant at the India Office, where he rose to become director of funds. He was made a Companion to the Order of the Indian Empire in the 1900 New Year Honours. Trevor died at Richmond Hill in February 1925; he was last surviving Old Marlburian from the 1855 Marlborough v Rugby match."]}]}}