{"wiki_id": "http://www.wikidata.org/entity/Q18528362", "itemLabel": "Edward Saker", "itemDescription": "British actor and theatre manager", "wikipedia_url": "https://en.wikipedia.org/wiki/Edward_Saker", "wikipedia_page": {"main": "Edward Sloman Saker (30 September 1838 – 29 March 1883) was a British actor-manager. He was assisted in all things by his wife Emily Saker.", "link_mentions": [{"page": "Saker", "response": ["* Edward Saker (1838–1883), British actor-manager"]}, {"page": "Lionel Brough", "response": ["Brough repeated The Forty Thieves in Liverpool, where Alexander Henderson, manager of the Prince of Wales Theatre in that city, was impressed enough to engage Brough for his company.  In his Who's Who entry, Brough recorded: \"joined theatrical profession (permanently) at Prince of Wales's, Liverpool, 1863.\"\"Brough, Lionel\", Who Was Who, A & C Black, 1920–2008; online edn, Oxford University Press, December 2007, accessed 25 May 2009 The company there included Squire Bancroft and John Hare. In 1864, he performed there as Iago in Ernani opposite Lydia Thompson and Lavinia in The Miller and His Men. He also performed at other Liverpool theatres in the 1860s, including the Amphitheatre and the Alexandra, at the last of which he performed with Edward Saker, with whom he also toured.Broadbent, R. J. Annals of the Liverpool Stage, pp. 274, 278, 308 and 316–17 Edward Howell: Liverpool (1908)"]}, {"page": "Robert Henry Wyndham", "response": ["Among the parts allotted to him during the ensuing season were Mercutio, Charles Surface in The School for Scandal, and Rashleigh Osbaldistone in Rob Roy by William Henry Murray. In 1846 he married Rose, daughter of minor actor William Saker and sister of Edward Saker. She developed a special aptitude for training juvenile troupes in ballet and pantomime. In May 1849 Wyndham appeared at the Adelphi Theatre, Edinburgh, as Orlando, and in 1850 he was Brycefield in Marston's Strathmore."]}, {"page": "Edward Sloman Saker", "response": ["#REDIRECT Edward Saker"]}, {"page": "Emily Saker", "response": ["#REDIRECT Edward Saker"]}, {"page": "Robert Brough (actor)", "response": ["His parents had ambitions for him in the world of commerce, but he soon decided on a stage career, and Edward Saker found a part for him in his show Little Em'ly, an adaptation of David Copperfield, in Glasgow in 1870."]}]}}