{"wiki_id": "http://www.wikidata.org/entity/Q18529964", "itemLabel": "Jane Strachey", "itemDescription": "British suffragist, editor", "wikipedia_url": "https://en.wikipedia.org/wiki/Jane_Maria_Strachey", "wikipedia_page": {"main": "Jane Maria Strachey, Lady Strachey (13 March 1840 – 14 December 1928) was an English suffragist and writer. Her father was a British colonial administrator and she later married her father's secretary, Sir Richard Strachey, and ten of their children survived into adulthood. She was an outspoken advocate for the right of women to vote and involved her daughters in her campaigning. She wrote two books for children.", "link_mentions": [{"page": "Mud March (suffragists)", "response": ["The task of organising the event, scheduled for Saturday, 9 February 1907, was delegated to Pippa Strachey of the Central Society for Women's Suffrage. Her mother, Lady Jane Strachey, a friend of Fawcett, was a long-standing suffragist, but Pippa Strachey had shown little interest in the issue before a meeting with Emily Davies, who quickly converted her to the cause. She took on the organisation of the London march with no experience of doing anything similar, but carried out the task so effectively that she was given responsibility for the planning of all future large processions of the NUWSS. On 29 January the executive committee of the London Society determined the order of the procession and arranged for advertisements to be placed in the Tribune and The Morning Post.", "By around 2:30 pm the march had formed a line that stretched far down Rotten Row. It set off in the drenching rain, with a brass band leading and Lady Frances Balfour, Millicent Fawcett and Lady Jane Strachey at the head of the column. The procession was followed by a phalanx of carriages and motor cars, many of which carried flags bearing the letters \"WS\", red and white banners and bouquets of red and white flowers.  Around 7,000 red and white rosettes had been provided for the marchers by the manufacturing company of Maud Arncliffe-Sennett, an actor and leader among the London Society for Women's Suffrage and the Actresses Franchise League. "]}]}}