{"wiki_id": "http://www.wikidata.org/entity/Q18546161", "itemLabel": "Enid Essame", "itemDescription": "English headmistress at Queenswood", "wikipedia_url": "https://en.wikipedia.org/wiki/Enid_Essame", "wikipedia_page": {"main": "Enid Mary Essame aka  \"Emma\" Essame (5 December 1906 – 19 December 1999) was a British headmistress whose whole career was teaching at Queenswood School. She led the school from 1944 to 1971.", "link_mentions": [{"page": "Girls' Schools Association", "response": ["Enid Essame of Queenswood School was an honorary secretary before she became president in 1960. She was succeeded by Diana Reader Harris in 1964. She served until 1966 organising a considered response to the influential Plowden Report. It was established in 1974 following the amalgamation of two of the AHM's sub-groups: the Association of Heads of Girls' boarding Schools and the Association of Independent and Direct Grant Schools. It moved from London to new headquarters in Leicester in 1984, where it shared offices with the Association of School and College Leaders (ASCL) before moving to its current office, still in Leicester."]}, {"page": "Diana Reader Harris", "response": ["While still at Sherborne, Reader Harris was involved in several outside bodies. In 1964 she became the chair of the Association of Headmistresses taking over from Enid Essame. She served till 1966 when she was organising the association's response to the Plowden Report. She was at various times a member of Dorset Education Committee, the Independent Television Authority, the councils of the National Youth Orchestra and the Outward Bound Trust, the Church Missionary Society, where as its first woman presidentChurch Missionary Society website . Retrieved 6 September 2010. she brought it to espouse the 1980 Brandt Report on bridging the North-South divide, and Christian Aid, where she was also chairman in 1978–1983. She joined the council of the Royal Society of Arts in 1975 and chaired it in 1979–1981. She was a governor of Godolphin School, Salisbury, from 1975 to 1986."]}, {"page": "The Newark Academy", "response": ["* Enid Essame, Headmistress from 1943 to 1971 of Queenswood School, and President from 1962 to 1964 of the Association of Headmistresses of Boarding Schools (now the Girls' Schools Association)"]}, {"page": "Ethel Trew", "response": ["Under her leadership the school moved to Sheepwell House in Hatfield, Hertfordshire in 1925 and a preparatory school was established. The oversaw the building of the new school and she took a string interest in the chapel. The school planned for the future and Enid Essame was identified as her replacement and Essame was sent on a fact-finding sabbatical to the US in 1934."]}]}}