{"wiki_id": "http://www.wikidata.org/entity/Q18527751", "itemLabel": "Ruth Cavendish Bentinck", "itemDescription": "(1867–1953), women's suffragist and socialist", "wikipedia_url": "https://en.wikipedia.org/wiki/Ruth_Cavendish_Bentinck", "wikipedia_page": {"main": "Ruth Mary Cavendish-Bentinck born Ruth Mary St Maur (21 October 1867 – 28 January 1953) was a Moroccan-born British aristocrat, suffragist and socialist. Her library was the basis for what is now the Women's Library.", "link_mentions": [{"page": "Women's Library", "response": ["The Women's Library is England's main library and museum resource on women and the women's movement, concentrating on Britain in the 19th and 20th centuries. It has an institutional history as a coherent collection dating back to the mid-1920s, although its \"core\" collection dates from a library established by Ruth Cavendish Bentinck in 1909. Since 2013, the library has been in the custody of the London School of Economics and Political Science (LSE), which manages the collection as part of the British Library of Political and Economic Science in a dedicated area known as the Women's Library.", "The Women's Library traces its roots to the London Society for Women's Suffrage, a group established in 1867 to campaign for the right to vote. The \"core\" collection was the Cavendish-Bentinck library that was founded in 1909 by Ruth Cavendish Bentinck.Doughan, David, \"Bentinck, Ruth Mary Cavendish- (1867–1953)\", Oxford Dictionary of National Biography, Oxford University Press, 2004; online edn, May 2006. Retrieved 25 November 2017. The collection was organised by the inaugural librarian, Vera Douie, who was appointed on 1 January 1926. At this time, and for many years afterward, it was called the Women's Service Library, in accordance with the name of the society which since the outbreak of World War I had been called the London Society for Women's Service. Douie remained in post for 41 years, during which time she took a small but interesting society library and turned it into a major resource with an international reputation."]}, {"page": "Harold St Maur", "response": ["St Maur was born in Brighton in 1869,\"The Popular Guide to the House of Commons\", January 1911 (Pall Mall Gazette \"Extra\"), p. 82-83. the illegitimate son of Edward Seymour, Earl St Maur, and grandson of Edward Seymour, 12th Duke of Somerset. He had a sister, Ruth Cavendish Bentinck, who was a noted suffragist. His mother was a 19-year-old half-gipsy maid named Rosina Elizabeth Swan of Higham, near Bury St. Edmunds;The Times, 26 March 1925 St Maur's father died within months of his birth."]}, {"page": "Reginald Hoare", "response": ["In 1922, he married Lucy Joan Cavendish-Bentinck (1889–1971), the elder daughter of William George Frederick Cavendish-Bentinck and Ruth Cavendish Bentinck. Lucy's grandfathers were Ferdinand Seymour, Earl St. Maur (son of Edward Seymour, 12th Duke of Somerset) and the Rt. Hon. George Cavendish-Bentinck (grandson of William Cavendish-Bentinck, 3rd Duke of Portland).  Lucy's brothers, Ferdinand and Victor, were the 8th and 9th Duke of Portland, respectively.  Together, Reginald and Lucy were the parents of one child:"]}, {"page": "List of Fabian Tracts (1884–1915)", "response": ["151. The Point of Honour. A Correspondence on Aristocracy and Socialism. 16 pp. Mrs. Ruth Cavendish Bentinck."]}, {"page": "Florence Gertrude de Fonblanque", "response": ["Fonblanque decided to mount a march from Edinburgh to London to draw attention to the women's suffrage cause. She initially thought that walking to Edinburgh would be a good idea but it was decided to march from Edinburgh so that the march could end its publicity in London.  Only six women including Agnes BrownEleanor Gordon, ‘Brown, Agnes Henderson (1866–1943)’, Oxford Dictionary of National Biography, Oxford University Press, 2004; online edn, May 2007 accessed 18 November 2017 and Sarah Benett, who was the Treasurer of the Women's Freedom League set off on 21 October 1912.  Fonblanque's sister and Ruth Cavendish Bentinck helped with the organisation. As they and Fonblanque traveled from Scotland to London they gathered signatures on a petition and coverage in the newspapers. Fonblanque ensure that they were dressed in brown with rosettes and bright green cockades and they were known as the \"Brown Women\". They followed the route of the A1 and they were joined by dignitaries along the way. On one day near Berwick they walked over 30 miles before the now seven marchers were welcomed by the local member of parliament. Their numbers swelled slowly - when they passed through Grantham in November there were twelve walkers including Fonblanque.", "There were reports that Fonblanque and Ruth Cavendish Bentinck had founded an organisation of non aligned suffragists in 1913. The Qui Vive Corps would wear the brown, green and white uniform described above. It was intended that these would attend any suffrage inspired event.David Doughan, ‘Bentinck, Ruth Mary Cavendish- (1867–1953)’, Oxford Dictionary of National Biography, Oxford University Press, 2004; online edn, May 2006 accessed 25 November 2017 The Qui Vive Corps were involved in campaigning for the Labour Party in Derbyshire and Staffordshire because they objected to the Liberal Party's policy which was against women getting the vote."]}, {"page": "Ruth Cavendish-Bentinck", "response": ["#REDIRECT Ruth Cavendish Bentinck"]}, {"page": "Mortons House Hotel, Corfe Castle", "response": ["Ruth Cavendish Bentinck, his wife, became a famous suffragette and political activist.Women’s History Network. Online reference In 1911 she wrote a letter from Morton’s House which is still noteworthy in which she railed against changes to fair wage legislation. She thought these changes would damage the next generation as working men were struggling to feed their families, she said, and widows were expected to be grateful for a pittance to raise their fatherless children: “The West Country labourer is supposed to live on the beauty of his scenery and his picturesque (and too often insanitary) house,”Ruth Cavendish Bentinck article. Online reference "]}]}}