{"wiki_id": "http://www.wikidata.org/entity/Q18559730", "itemLabel": "Elizabeth Surr", "itemDescription": "UK educational reformer, died California (1825-1901)", "wikipedia_url": "https://en.wikipedia.org/wiki/Elizabeth_Surr", "wikipedia_page": {"main": "Elizabeth Surr (1820 – 1901) was a British educational reformer. She was successful in getting elected to the London School Board where she led the exposure of mistreatment of children in industrial schools.", "link_mentions": [{"page": "London School Board", "response": ["The LSB, at the time of its creation had one of the broadest mandates of any elected body in Britain. Unusually, women were permitted to vote on the same terms as men for the school boards and also to stand for election. Three women stood in the first board election in 1870: Elizabeth Garrett, who topped the poll, Emily Davies, who also won election, and Maria Georgina Grey.  When the second elections were held, in 1873, Garrett and Davies stood down, to be replaced by Jane Agnes Chessar and Alice Cowell, while in 1876, Florence Fenwick Miller, Elizabeth Surr, Helen Taylor and Alice Westlake all won election.Patricia Hollis, Ladies Elect: Women in English Local Government 1865-1914, pp.75-90"]}, {"page": "Helen Taylor (feminist)", "response": ["A zealous advocate of the reform of the industrial schools, Taylor, Elizabeth Surr and Florence Fenwick Miller brought to public notice in 1882 certain scandals imputed to St. Paul's Industrial School. Thomas Scrutton owned the school, food intended for the boys was diverted to the governor and the staff, the boys were not clothed or fed well, there was excessive punishments including manacles and handcuffs. Taylor accused Scrutton of taking some of the money and for being responsible for the deaths of boys at the St Paul's school. The home secretary instituted an inquiry, and the school was ordered to be closed. In June 1882, Thomas Scrutton, a member of the school board and chairman of its industrial schools sub-committee, brought an action for libel against Taylor. Sir Henry Hawkins was the judge, Sir Edward George Clarke was Taylor's counsel, Sir Charles Russell, afterwards Lord Russell of Killowen, was for the plaintiff. On the fourth day, 30 June, Taylor's case broke down on the plea of justification, and she paid the plaintiff £1,000 by consent. The judge acknowledged Taylor's public spirit and exonerated her from any personal malice. The actions brought about a reform of the London industrial schools. Scrutton had to resign as chair and later as a member of the school board."]}, {"page": "George Wallington Grabham", "response": ["Grabham was born in Rochford, Essex, England on 1 September 1836. He was one of at least eleven children born to Sarah (born Fry) and John Grabham. He had at least four sisters including the education reformer Elizabeth Surr. He and three of his brothers went into medicine including Michael Comport Grabham who worked on Madeira."]}, {"page": "List of members of the London School Board", "response": ["| Elizabeth Surr", "| Elizabeth Surr"]}, {"page": "Florence Miller", "response": ["Miller made an unsuccessful marriage with Frederick Alfred Ford; they had two daughters, but separated. L. A. Flammang, in a review of a biography of Miller, notes that Ford contributed little to the family and suggests that, in part, the volume of Miller's output was related to her straitened economic circumstances. Miller continued to use her own name after the marriage (Frederick Rogers noting that she changed it from Miss Fenwick Miller to Mrs. Fenwick Miller), leading to litigation seeking to remove her from her London School Board office for sitting under an illegal name: Miller prevailed, and the case established the precedent that women need not take the surname of their husband. Litigation happened with respect to the school boards. Helen Taylor, Elizabeth Surr and Miller brought to public notice in 1882 certain scandals at St. Paul's Industrial School. The home secretary instituted an inquiry, and the school was ordered to be closed. In June 1882, Thomas Scrutton, a member of the school board and chairman of its industrial schools sub-committee, brought an action for libel against Taylor."]}]}}