{"wiki_id": "http://www.wikidata.org/entity/Q18572209", "itemLabel": "Alice Walker", "itemDescription": "1900–1982, British literary scholar", "wikipedia_url": "https://en.wikipedia.org/wiki/Alice_Walker_(scholar)", "wikipedia_page": {"main": "Alice Walker (8 December 1900 – 14 October 1982) was a British literary scholar of the he Elizabethan and Jacobean writer Thomas Lodge and of the poet and playwright William Shakespeare.", "link_mentions": [{"page": "Alice Walker", "response": ["Walker has written several other novels, including The Temple of My Familiar and Possessing the Secret of Joy (which featured several characters and descendants of characters from The Color Purple). She has published a number of collections of short stories, poetry, and other writings. Her work is focused on the struggles of black people, particularly women, and their lives in a racist, sexist, and violent society.\"Analyzing Characterization and Point of View in Alice Walker's Short Fiction\". ", "In 2000, Walker released a collection of short fiction, based on her own life, called The Way Forward Is With a Broken Heart, exploring love and race relations. In this book, Walker details her interracial relationship with Melvyn Rosenman Leventhal, a civil rights attorney who was also working in Mississippi. The couple married on March 17, 1967, in New York City, since interracial marriage was then illegal in the South, and divorced in 1976. They had a daughter, Rebecca, together in 1969. Rebecca Walker, Alice Walker's only child, is an American novelist, editor, artist, and activist. The Third Wave Foundation, an activist fund, was co-founded by Rebecca and Shannon Liss-Riordan. Her godmother is Alice Walker's mentor and co-founder of Ms. Magazine, Gloria Steinem.", "In 2013, Alice Walker published two new books, one of them entitled The Cushion in the Road: Meditation and Wandering as the Whole World Awakens to Being in Harm's Way. The other was a book of poems entitled The World Will Follow Joy Turning Madness into Flowers (New Poems).", "Walker met Martin Luther King Jr. when she was a student at Spelman College in the early 1960s. She credits King for her decision to return to the American South as an activist in the Civil Rights Movement. She took part in the 1963 March on Washington. Later, she volunteered to register black voters in Georgia and Mississippi.Walker Interview transcript and audio file on \"Inner Light in A time of darkness\", Democracy Now! Retrieved February 10, 2010.\"Pulitzer-Winning Writer Alice Walker & Civil Rights Leader Bob Moses Reflect on an Obama Presidency\", Democracy Now! video on the African-American vote, January 20, 2009. Retrieved February 10, 2010.", "On June 23, 2011, she announced plans to participate in an aid flotilla to Gaza that attempted to break Israel's naval blockade. Her participation in the 2011 Gaza flotilla prompted an op-ed, headlined \"Alice Walker's bigotry,\" written by American law professor Alan Dershowitz in The Jerusalem Post. Dershowitz said, by participating in the flotilla to evade the blockade, she was \"provid[ing] material support for terrorism.\"", "Phalia (Portrait of Alice Walker) (1989) is a photograph by Maud Sulter from her Zabat series originally produced for the Rochdale Art Gallery in England.The Art of Feminism by Lucinda Gosling, Hilary Robinson, Amy Tobin, Helena Reckitt, Xabier Arakistain, and Maria Balshaw (December 25, 2018) Chronicle Books LLC", "* Pema Chodron and Alice Walker in Conversation (1999)", "*Alice Walker's official website", "*Alice Walker: Beauty in Truth – full video of biography film at PBS.org", "*Stuart A. Rose Manuscript, Archives, and Rare Book Library, Emory University: Alice Walker papers, circa 1930–2014 (MSS 1061)"]}, {"page": "Walker (surname)", "response": ["*Alice Walker (born 1944), American author", "*Alice Walker (scholar) (1900–1982), British scholar"]}, {"page": "Mercy Oduyoye", "response": ["When Oduyoye finished her studies at Cambridge, she taught at Princeton University in the 1960s. In the 1970s, she taught other campuses in the United States, Europe, and Africa few are Harvard University, Union Theological Seminary, and the University of Ibadan. In this period of teaching, she realized that “people who wrote about Africa and Christianity in Africa, were not Africans.” Also, the Africans who wrote about Christianity were men, having only “male face in mind.\" These facts made Oduyoye continue to pursue activism in challenging the status quo in Africa where women were silenced, in this case voicing for African women and theology. As she notes, “liberation theology became my theology voice.” Oduyoye led a few organizations besides her teaching career, such as the Ecumenical Association of Third-World Theologian (EATWOT). From 1967 to 1979, she was youth education secretary for the World Council of Churches; from 1987 to 1994, she was Deputy General Secretary for the same organization. She has taught at Harvard University, Union Theological Seminary, and the University of Ibadan. She has also served as president of the World Student Christian Federation and founded the Circle of Concerned African Women Theologians in 1989. During her time in the US, Oduyoye experienced the Black Liberation theology and womanist theologymovements. The subject “liberation theology was not sensitive to feminist issues\" was a criticism from Oduyoye. She saw issues of sexuality that feminist in the western part of the world stress as their main topic not applicable to African women. In the US, Alice Walker brought about a campaign through a novel and documentary, Mary Daly published Gyn/ecology on the issues of genital mutilation as a primary concern for all women. Contrary to this, Oduyoye says that womanist theology from the African perspective underlines poverty and discrimination upon women. Secondly, the problem for Oduyoye was Westerners only report about the good works of the missionaries and their benefit upon the population of Africa, all too good to be true. She disrupts the above narrative and insists Africans have a culture and tradition nonconformitive to western ideals. For Oduyoye, “the Bible is not British culture or French culture or European culture.” In totality, her work around African women's theology, in this case, was improving what African men have started. Theology in Africa was a two-winged theology, where men and women were making the appropriate improvement together, narrating two necessary viewpoints. The approach missionaries had on converting a person to Christianity by giving up one's culture seemed inappropriate. Oduyoye saw the need to revitalize African theology as “...a prerequisite to other independences.\" Oduyoye has written four books and more than eighty articles focusing on Christian theology from a feminist and African perspective. Oduyoye has been awarded honorary degrees by University of Amsterdam (1991), Stellenbosch University the University of the Western Cape in 2002 and Yale University in 2008.Mary E. O'Leary, \"Yale graduates 3,100 under sunny skies\", New Haven Register, 27 May 2008."]}, {"page": "Rose Mary Crawshay Prize", "response": ["|Alice Walker"]}]}}