{"wiki_id": "http://www.wikidata.org/entity/Q18528276", "itemLabel": "Henry Robert Addison", "itemDescription": "British playwright and army officer", "wikipedia_url": "https://en.wikipedia.org/wiki/Henry_Robert_Addison", "wikipedia_page": {"main": "Henry Robert Addison (1805–1876), sometimes erroneously called Captain Addison, was born in Calcutta. He became a cornet in the 2nd Dragoon Guards on 12 July 1827, and was promoted to lieutenant on 15 March 1831, which rank he held until 21 June 1833, when he was placed on half pay. He began writing for the stage in 1830 and was the author of about sixty dramas and farces. He was lessee of Queen's Theatre, London from August 1836 to 1837. He wrote many songs and articles in monthly magazines. He was author of about twelve novels and stories. He edited Who's Who from 1849 to 1850. He was special correspondent of a morning paper at the Paris exhibition in 1867. He was deputy chairman of London steamboat company. He died at Albion St., Hyde Park, London, on 24 June 1876, aged 71.", "link_mentions": [{"page": "Who's Who (UK)", "response": ["Who's Who has been published since 1849.\"More about Who's Who\". OUP. It was originally published by Baily Brothers.\"Albert Nelson Marquis\" in \"Obituary Notes\" (1944) 145 Publishers Weekly 130 Google Books Since 1897, it has been published by A & C Black. From 1849 to 1850, Who's Who was edited by Henry Robert Addison,Frederic Boase. \"Addison, Henry Robert\" in Modern English Biography. 1892. Volume 1. Page 1819.  from 1851 to 1864 by Charles Henry Oakes,Frederic Boase. \"Oakes, Charles Henry\" in Modern English Biography. 1897. Volume 2. Page 1871. from 1865 by William John Lawson and from 1897 to 1899 by Douglas Brooke Wheelton Sladen.\"Who's Who\". National Library of Australia Catalogue. Subsequent editions do not disclose the identity of their editor.Margaretta Jolly (ed). \"Who's Who\" in Encyclopedia of Life Writing: Autobiographical and Biographical Forms. Fitzroy Dearborn Publishers. 2001. Routledge. 2013. . Volume 1. Page 939."]}, {"page": "Addison (name)", "response": ["* Henry Robert Addison (1805–1876), writer"]}, {"page": "Edward Loder", "response": ["*Saved by a Song, operetta by Henry Robert Addison (21 December 1868 (posthumous), Princess's Theatre, London)"]}, {"page": "Henry R. Addison", "response": ["#REDIRECT Henry Robert Addison"]}, {"page": "1840 in Belgium", "response": ["*Alexandre Ferrier de Tourettes, Belgium Historical and Picturesque, translated by Henry Robert Addison (Brussels)"]}, {"page": "1843 in Belgium", "response": ["* Henry Robert Addison, Belgium as she is (Brussels and Leipzig, C. Muquardt)On Google Books"]}]}}