{"wiki_id": "http://www.wikidata.org/entity/Q18546377", "itemLabel": "Gravener Henson", "itemDescription": "English workers' leader and author", "wikipedia_url": "https://en.wikipedia.org/wiki/Gravener_Henson", "wikipedia_page": {"main": "John Gravener Henson, (1785 – 15 November 1852) was a workers' leader from Nottingham, England, and a historian of the framework knitters. E. P. Thompson saw him as one of three outstanding figures in the early English working-class movement.", "link_mentions": [{"page": "Calverton, Nottinghamshire", "response": ["The myths surrounding Lee, including the supposed reasons for the invention, a girl-friend or wife and an alleged refusal by Queen Elizabeth to grant a patent, seem to stem from a volume of 1831 called History of the Framework Knitters by Gravener Henson (1785–1852), a prominent workers' leader of the time. Henson stated that he had got the greater part of his information about Lee from certain 'ancient stocking makers' who all gave a similar account, and that the authenticity of the story is 'in some measure confirmed by the arms of the London Framework Knitters, which consist of a stocking-frame without the woodwork, with a clergyman on one hand and a woman on the other, as supporters.'G. Henson, The Civil, Political and Mechanical History of the Framework Knitters in Europe, America &c(1831), pp. 38–9,43,45–8 Some of the myths were made visual in Alfred Elmore's familiar oil painting of 1847, The Origin of the Stocking Loom in the Nottingham Castle Museum.Origin of the Stocking Loom in the Nottingham Castle Museum"]}, {"page": "John Gast (activist)", "response": ["E. P. Thompson suggested, in The Making of the English Working Class, that in the history of working-class movements between 1780 and 1832, he was one of three, with John Doherty and Gravener Henson, who had been outstanding leaders.E. P. Thompson,  The Making of the English Working Class  (1963), p.774"]}, {"page": "Coldbath Fields Prison", "response": ["*John Gravener Henson, workers’ leader and historian of framework-knitters"]}, {"page": "List of people from Nottingham", "response": ["*(1785–1852) Gravener Henson, Nottingham workers' leader and historian of the framework knitters, was born in Nottingham.E. P. Thompson, The Making of the English Working Class (1963), p. 774."]}, {"page": "John Doherty (trade unionist)", "response": ["E. P. Thompson suggested, in The Making of the English Working Class, that in the history of working-class movements between 1780 and 1832, he was one of three, with Gravener Henson and John Gast, who had been outstanding leaders.E. P. Thompson,  The Making of the English Working Class  (1963), p.774"]}, {"page": "Gravenor Henson", "response": ["#REDIRECT Gravener Henson "]}]}}