{"wiki_id": "http://www.wikidata.org/entity/Q18607498", "itemLabel": "Luke Somers", "itemDescription": "British photojournalist", "wikipedia_url": "https://en.wikipedia.org/wiki/Luke_Somers", "wikipedia_page": {"main": "Luke Daniel Somers (29 August 1981 – 6 December 2014) was a British-born American photojournalist who had been held hostage by the militant Islamist group al-Qaeda in the Arabian Peninsula (AQAP) in Yemen. He was a dual citizen of the United Kingdom and the United States. He traveled to Egypt before settling in Yemen.Somers was described by his friend as \"a great man with a kind heart who really loves the Yemeni people and the country ... He was so dedicated in trying to help change Yemen's future, to do good things for the people that he didn't leave the country [Yemen] his entire time here.\"", "link_mentions": [{"page": "December 6", "response": ["*  2014   – Luke Somers, English-American photographer and journalist (b. 1981)"]}, {"page": "Luke (given name)", "response": ["*Luke Somers (1981–2014), American photojournalist"]}, {"page": "Aafia Siddiqui", "response": ["In March 2017, Al-Qaeda in the Arabian Peninsula leader Qasim al-Raymi said that his group demanded the release of Siddiqui in exchange for Luke Somers, an American journalist kidnapped in Yemen in September 2013.  Somers was killed during a rescue attempt in December 2014.https://www.nytimes.com/2014/12/07/world/middleeast/hostage-luke-somers-is-killed-in-yemen-during-rescue-attempt-american-official-says.html"]}, {"page": "Al-Qaeda in the Arabian Peninsula", "response": ["In December 2014, the group released a video depicting Luke Somers, a journalist whom they were holding hostage. On 26 November, U.S. Navy SEALs and Yemeni special forces attempted a hostage rescue where eight hostages, none American, were freed, but Luke Somers and four others had been moved to another location by AQAP prior to the raid. The nationalities of the eight hostages rescued were six Yemenis, one Saudi, and one Ethiopian. On 6 December, 40 SEALs used V-22 Ospreys to land a distance from the compound where Somers and Korkie were kept at about 1 a.m. local time, according to a senior defense official. An AQAP fighter apparently spotted them while relieving himself outside, a counter-terrorism official with knowledge of the operation told ABC News, beginning a firefight that lasted about 10 minutes. According to CBS News, dog barking could have alerted the hostage-takers of the operation. When the American soldiers finally entered the building where Somers and Korkie were kept, they found both men alive, but gravely wounded. Korkie and Somers died some minutes later despite attempts to save them."]}, {"page": "Somers (surname)", "response": ["*Luke Somers (1981–2014), British-American photojournalist who was kidnapped in 2013"]}, {"page": "2014 in aviation", "response": ["*  Inserted by helicopter into a remote region in northern Yemen, United States Navy SEALs and Yemeni special forces rescue eight hostages – six Yemenis, a Saudi, and an Ethiopian – held by al-Qaeda in the Arabian Peninsula (AQAP), but fail to find American hostage Luke Somers and four others they had hoped to rescue. AQAP had moved them to another location prior to the raid.", "* V-22 Ospreys carry a team of United States Navy SEALs from the amphibious assault ship  in an operation to rescue two hostages – American Luke Somers and South African Pierre Korkie – from an al-Qaeda in the Arabian Peninsula compound in southern Yemen. Coming under fire, the SEALs suffer no casualties but find the two hostages gravely wounded. The Ospreys evacuate both men to Makin Island, but neither survives."]}, {"page": "2014 in the United Kingdom", "response": ["* 6 December – Luke Somers, 33, photojournalist and AQAP hostage."]}, {"page": "Deaths in December 2014", "response": ["*Luke Somers, 33, British-born American photojournalist and AQAP hostage, shot.US hostage Luke Somers dies after rescue bid"]}, {"page": "2014 hostage rescue operations in Yemen", "response": ["The 2014 hostage rescue operations in Yemen  were missions to rescue hostages held by Al-Qaeda in the Arabian Peninsula (AQAP) in Yemen. The first attempt on 26 November 2014 rescued 8 hostages, but five hostages, including the American journalist Luke Somers, were moved by AQAP to another location prior to the raid. The second attempt by U.S. Navy SEALs once again attempted to rescue the hostages, but Luke Somers and South African teacher Pierre Korkie were killed by AQAP during the raid in Shabwah Governorate of Yemen. Although the majority of hostages had been rescued, the operation was still seen as a failure in the West. The media particularly criticised the inability of American forces to rescue Somers.", "On 26 November 2014, a reinforced troop of U.S. Navy SEALs from DEVGRU supported by US-trained Yemeni special forces launched nighttime hostage rescue mission on a small number of caves in Hadhramaut Governorate. They landed at an off-set helicopter landing zone several kilometres away and patrolled on foot to the target area. In their assault on the cave, they killed 7 AQAP terrorists with one Yemeni SOF operator minorly wounded.Neville, Leigh,  Special Forces in the War on Terror (General Military), Osprey Publishing, 2015 , p.302 8 hostages, none American, were freed, but Luke Somers and four others had been moved to another location by AQAP prior to the raid. The nationalities of the eight hostages rescued were six Yemenis, one Saudi, and one Ethiopian or Nigerian. The SEALs conducted SSE and MH-60 helicopters flown by Nightstalkers extracted them.Neville, Leigh,  Special Forces in the War on Terror (General Military), Osprey Publishing, 2015 , p.303"]}, {"page": "Nasser bin Ali al-Ansi", "response": ["Nasser bin Ali al-Ansi (October 1975 – April 21, 2015) was a senior leader of Al-Qaeda in the Arabian Peninsula (AQAP) based in Yemen. Al-Ansi appeared in many of AQAP's propaganda videos, claiming the kidnap of US photojournalist Luke Somers and the Charlie Hebdo attack in Paris. On 7 May 2015, AQAP announced that al-Ansi was killed in a US drone strike."]}, {"page": "List of journalists killed in Yemen", "response": ["|Luke Somers", "|Luke Somers was killed as a result of a United States rescue operation and died 6 December 2014 shortly after being extracted."]}, {"page": "List of solved missing person cases: post-2000", "response": ["|People of various nationalities held as hostages by AQAP militants, whose rescue was the target of a joint American–Yemeni operation between November 26 and December 6, 2014. While most were rescued, two men, English–American journalist Luke Somers and South African teacher Pierre Korkie, were killed before they could be rescued.The NY Times, 2 Hostages Killed in Yemen as U.S. Rescue Effort Fails, By KAREEM FAHIM and ERIC SCHMITT (DEC. 6, 2014), \"In the village where the rescue attempt took place, in the southern province of Shabwah, a tribal leader, Tarek al-Daghari al-Awlaki, said the American commandos had raided four houses, killing at least two militants but also eight civilians.\""]}, {"page": "Somers, Luke", "response": ["#redirectLuke Somers"]}]}}