{"wiki_id": "http://www.wikidata.org/entity/Q18671171", "itemLabel": "Florence Balgarnie", "itemDescription": "Balgarnie, Florence (1856–1928), feminist and temperance campaigner", "wikipedia_url": "https://en.wikipedia.org/wiki/Florence_Balgarnie", "wikipedia_page": {"main": "Florence Balgarnie  (19 August 1856 – 25 March 1928) was a British suffragette, speaker, pacifist, feminist, and temperance activist. Characterised as a \"staunch Liberal\", and influenced by Lydia Becker, Balgarnie began her support of women's suffrage from the age of seventeen.", "link_mentions": [{"page": "Scarborough, North Yorkshire", "response": ["* Florence Balgarnie (1856–1928), suffragette, speaker, pacifist, feminist, temperance activist."]}, {"page": "Ida B. Wells", "response": ["On the last night of her second tour, the London Anti-Lynching Committee was established – reportedly the first anti-lynching organization in the world. Its founding members included many notables such as the Duke of Argyll, Sir John Gorst, the Archbishop of Canterbury, Lady Henry Somerset and some twenty Members of Parliament, with activist Florence Balgarnie as the honorary secretary."]}, {"page": "List of suffragists and suffragettes", "response": ["* Florence Balgarnie (1856–1928) – British suffragette, speaker, pacifist, feminist, temperance activist"]}, {"page": "National Union of Women's Suffrage Societies", "response": ["*Florence Balgarnie"]}, {"page": "Florence (given name)", "response": ["* Florence Balgarnie (1856–1928), British suffragette, speaker, pacifist, feminist, temperance activist"]}, {"page": "White Ribbon Association", "response": ["* Florence Balgarnie"]}, {"page": "First Conference of the International Woman Suffrage Alliance", "response": ["* Florence Balgarnie"]}, {"page": "Jane Taylour", "response": ["Taylour delivered a number of lectures in Gainsborough, Lincolnshire. On 12 March 1885 she was one of several speakers at the Temperance Hall, along with Florence Balgarnie, Jessie Tod, and Ann Radford McCormick. She returned two years later on 18 January 1887 to give a lecture on allowing women greater political and social equality with men, and returned to Gainsborough again on 31 May 1885 on women and politics at the Methodist Mutual Improvement Association."]}, {"page": "Laura M. Johns", "response": ["Her last work consisted of thirty conventions, beginning in Kansas City, Kansas in February, 1892, and held in various important cities of the State. In those conventions, she had as speakers Rev. Anna Howard Shaw, Mrs. Clara H. Hoffman, Florence Balgarnie, and Mary Seymour Howell. As workers and speakers from the ranks in Kansas there were Lucy Browne Johnston, May Belleville Brown, Mrs. Shelby-Boyd, Mrs. Denton and Elizabeth E. Hopkins. Johns was enabled to lift the financial burden, of this undertaking by the generous gift of  from Rachel Foster Avery, of Philadelphia. "]}, {"page": "List of Missouri suffragists", "response": ["*Florence Balgarnie."]}]}}