{"wiki_id": "http://www.wikidata.org/entity/Q18674009", "itemLabel": "Joseph Glass", "itemDescription": "English philanthropist and inventor of machinery for sweeping chimneys", "wikipedia_url": "https://en.wikipedia.org/wiki/Joseph_Glass_(inventor)", "wikipedia_page": {"main": "Joseph Glass (1791/2 – 29 December 1867) was the inventor of a successful chimney-sweeping apparatus, and a campaigner against boys being employed in sweeping chimneys.", "link_mentions": [{"page": "List of inventors", "response": ["*Joseph Glass (1791–1867), England – chimney-sweeping apparatus"]}, {"page": "Chimney sweep", "response": ["The first mechanical sweeper was invented by George Smart in 1803 but was resisted in the UK and the US. Joseph Glass marketed an improved sweeping machine in 1828; he is credited with being the inventor of the modern chimney sweep's brush. In the northern US, whites gave up the trade and employed black sweep-boys from the South. After regulation finally took hold in 1875 in the UK and the turn of the century in the US, the occupation became romanticized in popular media."]}, {"page": "Benjamin Meggot Forster", "response": ["Around 1802 Forster was a founder of the Society for the Suppression of Climbing Chimney-Sweepers (properly from 1803 the SSNCB, Society for Superseding the Necessity of Climbing Boys), and took an interest in the inventions in the field of chimney sweeping, by George Smart and Joseph Glass. In 1819 he reported to its committee on the case of two small girls as sweeps, working at Windsor Castle. In fact four other members of the committee were from the Forster family.Others involved on the committee were John Julius Angerstein, Thomas Charles Bunbury, Thomas Everett, Stephen Lushington, Matthew Montagu, John Russell, 6th Duke of Bedford, and Henry Thornton. See Niels van Manen, The Climbing Boy Campaigns in Britain c. 1770-1840 (Ph.D. dissertation) p. 75 note 84. He framed the Child Stealing Act 1814. It was introduced as a bill in parliament on 17 May 1814, by William Smith."]}, {"page": "Glass, Joseph", "response": ["#REDIRECT Joseph Glass (inventor)"]}, {"page": "Joseph Glass", "response": ["Joseph Glass may refer to:", "* Joseph Glass (inventor) (1791–1867), English inventor of chimney-sweeping apparatus", "* Joseph Glass (potter) (fl. 1670–1701), English potter"]}]}}