{"wiki_id": "http://www.wikidata.org/entity/Q18683953", "itemLabel": "Alize Lily Mounter", "itemDescription": "British model", "wikipedia_url": "https://en.wikipedia.org/wiki/Alize_Lily_Mounter", "wikipedia_page": {"main": "Alize Lily Mounter (born 29 September 1988) is a Welsh actress, journalist, model and beauty queen who was crowned Miss England in 2011. She represented England at the 61st Miss World in London, where she made the Top 7 and was ranked 4th place overall. She received the titles of Miss World Europe, Miss United Kingdom and Miss World Beach Beauty.  Later she represented the United Kingdom at Miss International on 21 October 2012 in Okinawa, Japan.", "link_mentions": [{"page": "Miss World", "response": ["| Alize Lily Mounter"]}, {"page": "Miss United Kingdom", "response": ["| Alize Lily Mounter", "| Alize Lily Mounter"]}, {"page": "Miss England", "response": ["The title of Miss England 2011 was won by Alize Lily Mounter who was classed as the favourite to win the competition. Mounter would later compete in the Miss World 2011 where she was among the top seven contestants on the final night, finishing in 4th place. She was also awarded the title of Miss World Europe, a first for England, after finishing as the highest ranked delegate from Europe in the competition.", "| Alize Lily Mounter"]}, {"page": "Miss Universe Great Britain", "response": ["| Alize Lily Mounter"]}, {"page": "Claire Evans", "response": ["In 2009, Evans won the title of Miss UK Hawaiian Tropic and represented the UK at the 2009 international finals in the autumn. In that same year, Evans successfully completed a course in London for a career as a freelance fashion, photographic and creative media makeup artist and has worked on many high-fashion shoots and for Yes London brand at London Fashion week. TV work includes BBC series Elizabeth's Wales, makeup artist for BBC's presenter Sian williams and the coverage of the Queens Jubilee Celebrations, X-Factor Rhydian Roberts show and celebrity guests, Andrew Lloyd Webber 'Finding Dorothy' West End Wizard of Oz star Sophie Evans, Jonathan show, Bryn Terfel Ysgoloriaeth and many more. Her talent for makeup artistry saw her commissioned by Universal France for the filming of French artist Garou. Travelling internationally, her recent commission was for two leading fashion brands in the Bahamas. Evans was a makeup artist for Miss England Alize Lily Mounter Miss World portfolio. From 2008 to 2009, Evans was the girlfriend of Wales Scrum half and British Lion Mike Phillips; they lived together in Penarth until their split."]}, {"page": "Alizé (given name)", "response": ["* Alize Lily Mounter (born 1988), Welsh journalist and beauty queen"]}, {"page": "Miss World 2011", "response": ["* – Alize Lily Mounter", "*  England - Alize Lily Mounter", "|  || Alize Lily Mounter || 22 || London"]}, {"page": "Miss International 2012", "response": ["*  – Alize Lily Mounter", "|  ||Alize Lily Mounter|| 24 ||  || London"]}]}}