{"wiki_id": "http://www.wikidata.org/entity/Q18640618", "itemLabel": "Leonard Green", "itemDescription": "British cricketer (1890-1963)", "wikipedia_url": "https://en.wikipedia.org/wiki/Leonard_Green_(cricketer)", "wikipedia_page": {"main": "Leonard Green  (1 February 1890 – 2 March 1963) was an English cricketer active from 1922 to 1935 who played for Lancashire, and a Territorial Army officer who commanded the 125th (Lancashire Fusiliers) Brigade from 1934 to 1938. He was born and died in Whalley, Lancashire. Green was born in a house built by his Father, Roger Green, who represented the Whalley Cricket Club at the 1864 meeting which led to the foundation of Lancashire County Cricket Club. At the time of his death, he lived in the Manor House which he shared with his brother James.", "link_mentions": [{"page": "Lancashire County Cricket Club", "response": ["After the war Lancashire developed a very strong batting side, including Ernest Tyldesley and Johnny Tyldesley, both Test batsmen. In 1920, Lancashire finished runner up and bowlers Harry Dean and Lawrence Cook took 274 wickets between them. During 1921, interest in cricket reached an all-time high, with over 250,000 people attending Old Trafford and over 4,500 members. 1922 was a year of contradictions, a strong team winning seven out of fifteen matches by an innings, but still managing to lose seven and finish 5th; that season Cec Parkin and Lawrence Cook mustered 308 wickets between them and Ernest Tyldesley scored over 2,000 runs. Retrieved on 20 October 2007. Lancashire's steady progress was capped by a hat trick of championship titles between 1926 and 1928 under the captaincy of Leonard Green. In the 1926 victory, Ernest Tyldesley and Harry Makepeace each scored over 2,000 runs. In 1927, Charlie Hallows scored six centuries and the bowling attack was led by Dick Tyldesley and Ted McDonald with support from Frank Sibbles. In 1928, Frank Watson and Ernest Tyldesley scored over 2,000 runs each and George Duckworth claimed 107 victims and earned recognition as one of Wisden's five Cricketers of the Year. At the end of the season Leonard Green decided to retire with a record of three successive championships and 42 wins against just three defeats. Retrieved on 20 October 2007."]}, {"page": "Leonard Green", "response": ["Leonard Green may refer to:", "*Leonard Green & Partners, a private equity firm based in Los Angeles", "*Leonard I. Green (1934–2002), founding partner of leveraged buyout firm Leonard Green & Partners", "*Leonard Green (Friends), a fictional character on the television series Friends", "*Leonard Green (cricketer) (1890–1963), English cricketer", "*Leonard Greene (1918–2006), American inventor and engineer"]}, {"page": "High Sheriff of Lancashire", "response": ["*1954 Col. Leonard Green of The Manor House, Whalley"]}, {"page": "List of Lancashire County Cricket Club captains", "response": ["* Leonard Green 1926–1928", "* Leonard Green (born Whalley) 1926–1928"]}, {"page": "List of Marylebone Cricket Club players (1919–1939)", "response": ["* Leonard Green (1927) : L. Green (Lancashire)"]}]}}