{"wiki_id": "http://www.wikidata.org/entity/Q18686132", "itemLabel": "David Firth", "itemDescription": "actor, Singer, writer", "wikipedia_url": "https://en.wikipedia.org/wiki/David_Firth_(actor)", "wikipedia_page": {"main": "David Firth (born 15 March 1945) is an English actor, writer and singer for stage, film and television. Firth was a member of the original cast of Phantom of the Opera with Michael Crawford and Sarah Brightman.", "link_mentions": [{"page": "The Phantom of the Opera (1986 musical)", "response": ["| align=\"center\"| David Firth"]}, {"page": "Passion (musical)", "response": ["| style=\"text-align:center;\" | David Firth"]}, {"page": "The Upside of Anger", "response": ["* David Firth as David Sr."]}, {"page": "The Bed of Nails (Yes Minister)", "response": ["| David Firth"]}, {"page": "The Fix (musical)", "response": ["|colspan='1' align=center| David Firth"]}, {"page": "List of American films of 2005", "response": ["| The Upside of Anger || New Line Cinema || Mike Binder (director/screenplay); Joan Allen, Kevin Costner, Erika Christensen, Keri Russell, Alicia Witt, Evan Rachel Wood, Mike Binder, Tom Harper, Sarah Coomes, Dane Christensen, Danny Webb, Magdalena Manville, Suzanne Bertish, David Firth, Rod Woodruff, Stephen Greif, Arthur Penhallow || Comedy, Drama ||"]}, {"page": "David Firth", "response": ["David Firth was born in Doncaster, South Yorkshire in 1983.  He is the son of Graham and Rosemary Firth, both of whom are retired art teachers. Firth developed an interest in animation and filmmaking around the age of 13, and began producing online content around 1998, creating humorous websites and videos with help from friends, which were hosted on Geocities and Tripod. He briefly studied at the Hull campus of the University of Lincoln, but left without completing his degree  and is currently living in Leeds.", "* Interview with David Firth at Personal Halfquake", "* BBC Comedy – David Firth animations", "* Interview with David Firth on Red Bar Radio", "* David Firth's Patreon Page"]}, {"page": "Sorry, I'm a Stranger Here Myself", "response": ["Sorry, I'm a Stranger Here Myself is a British sitcom that aired for two seasons from 15 June 1981 to 18 May 1982. It was co-created by actor David Firth and Shelley and It Takes a Worried Man creator Peter Tilbury. The first series was co-written by Firth and Tilbury, and the second one by Firth alone."]}, {"page": "Casualty (series 20)", "response": ["*David Firth as Richard Bardon (episode 48)"]}, {"page": "Casualty (series 21)", "response": ["*David Firth as Richard Bardon (episodes 6−21)"]}, {"page": "List of Old Bedford Modernians", "response": ["* David Firth (born 1945), actor (Casualty, Midsomer Murders), screenwriter (Home James!), singer (original cast of Phantom of the Opera) "]}, {"page": "Marilyn! the Musical", "response": ["Directed by Larry Fuller, with whom Lawrence had worked on Evita, the principal cast also included John Christie, John Bennett, David Firth, Bruce Barry and Judith Bruce.", "*Arthur Miller - David Firth"]}]}}