{"wiki_id": "http://www.wikidata.org/entity/Q18685811", "itemLabel": "Michael Dulin", "itemDescription": "American composer", "wikipedia_url": "https://en.wikipedia.org/wiki/Michael_Dulin", "wikipedia_page": {"main": "Michael Dulin is an American pianist and composer. In addition to performing his original music, Dulin has appeared both solo and with orchestra in performances of classical music. He has also toured as keyboardist with the Motown group, the Temptations.Four of Dulin's albums The One I Waited For, Atmospheres, Follow The River and Timeless II have reached the #1 spot on the Zone Music Reporter (formerly New Age Reporter or NAR) Top 100 Radio Airplay Chart.\n Two of his albums have been awarded the New Age Reporter's NAR Lifestyle Music Award in 2004, its inaugural year for Atmospheres (Best Instrumental Album – Piano), and again in 2005 for Timeless (Best Neo-Classical Album). Dulin was also a finalist in the Carnegie Hall International Piano Competition in 1985, and was awarded the Silver Medal in the Second Annual International Audio-Video Competition in New York.It has been noted that while Dulin has a strong classical music background, his music is reminiscent of New Age. Dulin has cited Philip Aaberg, David Lanz, Keiko Matsui and Clara Ponty as some of the artists whose work he has admired. Dulin and his business partner, Dan Whiteside, own and operate Equity Digital, a music label, and PSI Digital, a digital recording facility both located in Birmingham, Alabama.\n\n", "link_mentions": [{"page": "David Nevue", "response": ["Whisperings started out as part of the Live365.com family of independent online radio stations, but eventually grew beyond just Live365.com. Most listeners now tune in via the Whisperings web site, iTunes radio or Windows Media Tuner. Whisperings radio is supported by paid subscriptions from listeners who prefer commercial-free broadcasts. 273 artists are featured on the broadcast, including Joe Yamada, David Lanz, David Nevue, Josh Winiberg, Peter Kater, Michael Dulin, Wayne Gratz, Isadar, Louis Landon, Robin Spielberg and Suzanne Ciani."]}, {"page": "Zone Music Reporter", "response": ["The Zone Music Reporter sponsors the yearly ZMR Awards yearly (Formerly the NAR LifeStyle Music Awards) since 2004.  Past winners include Marc Enfroy, Paul Adams, Michael Dulin, Jeff Oster, Bill Leslie, Jeff Pearce, Áine Minogue, Peter Kater, Will Ackerman, Starr Parodi, Al Conti, Michael DeMaria, Aomusic, Fiona Joy, and Amethystium.ZMR 2008 AwardsZMR 2011 Awards "]}, {"page": "Dulin, Michael", "response": ["#redirectMichael Dulin"]}]}}