{"wiki_id": "http://www.wikidata.org/entity/Q186951", "itemLabel": "Young Tom Morris", "itemDescription": "Scottish professional golfer", "wikipedia_url": "https://en.wikipedia.org/wiki/Young_Tom_Morris", "wikipedia_page": {"main": "Thomas Morris (20 April 1851 – 25 December 1875), known as Young Tom Morris and also Tommy Morris, was a Scottish professional golfer. He is considered one of the pioneers of professional golf, and was the first young prodigy in golf history. He won four consecutive titles in the Open Championship, an unmatched feat, and did this by the age of 21.\nMorris was born in St Andrews, the \"Home of Golf\", and died there on Christmas Day, 1875, aged 24. His father, Old Tom Morris, was the greenkeeper and professional of the St Andrews Links, and himself won four of the first eight Open Championships. Young Tom's first Open Championship win – in 1868 at age 17 – made him the youngest major champion in the PGA, a record which still stands.", "link_mentions": [{"page": "December 25", "response": ["*1875 – Young Tom Morris, Scottish golfer (b. 1851)"]}, {"page": "List of historical drama films and series set in Near Eastern and Western civilization", "response": ["| Tommy's Honour || 2016 || 1866–1876 || The complex and bittersweet relationship between the pioneering and legendary Scottish golfing champions Old Tom Morris and Young Tom Morris."]}, {"page": "1875", "response": ["* December 25 – Young Tom Morris, Scottish golfer (b. 1851)"]}, {"page": "1851", "response": ["* April 20 – Young Tom Morris, Scottish golfer (d. 1875)"]}, {"page": "The Open Championship", "response": ["A year later, it became \"open\" to amateurs as well as professionals. Ten professionals and eight amateurs contested the event, with Old Tom Morris winning the championship by 4 shots from Willie Park, Sr. A prize fund (£10) was introduced in 1863 split between 2nd, 3rd and 4th (the winner only received the Challenge Belt). From 1864 onwards a cash prize was also paid to the winner. Before this the only financial incentive was scheduling Prestwick's own domestic tournament the same week, this allowed professionals to earn a few days' work caddying for the wealthier gentlemen. Willie Park, Sr. went on to win two more tournaments, and Old Tom Morris three more, before Young Tom Morris won three consecutive titles between 1868 and 1870. The rules stated that he was allowed to keep the belt for achieving this feat. Because no trophy was available, the tournament was not held in 1871.", "On 11 September 1872 agreement was reached between Prestwick, the Honourable Company of Edinburgh Golfers and The Royal and Ancient Golf Club. They decided that each of the three clubs would contribute £10 towards the cost of a new trophy, which was to be a silver claret jug, known officially as The Golf Champion Trophy, and hosting of the Open would be rotated between the three clubs. These decisions were taken too late for the trophy to be presented to the 1872 Open champion, who was once again Young Tom Morris. Instead, he was awarded with a medal inscribed 'The Golf Champion Trophy', although he is the first to be engraved on the Claret Jug as the 1872 winner. Medals have been given to, and kept by the winner ever since. Young Tom Morris died in 1875, aged 24.", "From 1860 to 1870, the winner received the challenge belt. When this was awarded to Young Tom Morris permanently for winning three consecutive tournaments, it was replaced by the gold medal (1872 onwards), and the claret jug (1873 onwards).", "*Youngest winner: Young Tom Morris (), 1868.", "*Most consecutive victories: 4, Young Tom Morris (1868, 1869, 1870, 1872 – there was no championship in 1871).", "|align=center|14th || align=center|1874 ||  Mungo Park || align=center|159 || || 2 strokes ||  Young Tom Morris  || align=center|20 || align=\"center\" |8 || Musselburgh", "|align=center|12th || align=center|1872 ||  Young Tom Morris (4) || align=center|166 || || 3 strokes ||  Davie Strath || align=center|Not known || align=\"center\" |8 || Prestwick", "|align=center|11th || align=center|1870 ||  Young Tom Morris (3) || align=center|149 || || 12 strokes ||  Bob Kirk (2nd) Davie Strath (3rd) || align=center|12|| align=\"center\" |6 || Prestwick", "|align=center|10th || align=center|1869 ||  Young Tom Morris (2) || align=center|157 || || 11 strokes ||  Bob Kirk || align=center|12|| align=\"center\" |6 || Prestwick", "|align=center|9th || align=center|1868 ||  Young Tom Morris || align=center|154 || || 3 strokes ||  Old Tom Morris || align=center|12 || align=\"center\" |6 || Prestwick"]}, {"page": "Three-peat", "response": ["*1868-1872  Young Tom Morris (four-peat)"]}, {"page": "Harry Vardon", "response": ["Within a few years he became golf's first superstar since the days of Young Tom Morris. In 1896, Vardon won the first of his six Open Championships (a record that still stands today). Vardon had great rivalries with James Braid and J.H. Taylor, who each won five Open Championships; together the three formed the 'Great Triumvirate', and dominated worldwide golf from the mid-1890s to the mid-1910s. These rivalries enormously increased the public's interest in golf."]}, {"page": "Jason Connery", "response": ["In 2016, Connery directed Tommy's Honour, a film celebrating the lives of golf pioneers Old Tom Morris and Young Tom Morris.\"My dad is excited about my latest movie\". Bunkered. 12 February 2014 The film opened the 2016 Edinburgh International Film Festival on 15 June 2016,White, James. \"Tommy's Honour opened the 70th Edinburgh International Film Festival\". Empire. 27 April 2016.Tommy's Honour at the IMDb. Retrieved 21 February 2016.Wiseman, Andreas. \"Peter Mullan, Jack Lowden to star in golf drama Tommy's Honour\". Screen Daily. 17 July 2015. and won Best Feature Film at the 2016 British Academy Scotland Awards."]}, {"page": "World Golf Hall of Fame", "response": ["*1975  Young Tom Morris"]}, {"page": "Timeline of golf history (1851–1945)", "response": ["Young Tom Morris, age 17, wins the first of four successive Open Championships. His streak would include an 11-stroke victory in 1869 and a 12-stroke victory in 1870 (in a 36-hole format). His 149 in the 1870 Open over 36 holes is a stroke average that would not be equalled until the invention of the rubber-cored ball.", "Young Tom Morris wins his third consecutive Open Championship, thus winning permanent possession of the Belt.", "Young Tom Morris wins his fourth consecutive Open Championship.", "Young Tom Morris dies at age 24. He did not emotionally recover from the death of both his wife and their daughter in childbirth earlier that year.", "Bob Ferguson of Musselburgh, losing The Open in extra holes, comes one victory shy of equalling Young Tom Morris' record of four consecutive titles. Ferguson ends up later in life penniless, working out of the Musselburgh caddy-shack."]}, {"page": "Men's major golf championships", "response": ["* 1868–72:  Young Tom Morris 1868 Open, 1869 Open, 1870 Open, 1872 Open (No Open Championship played in 1871)", "|  || Young Tom Morris || align=center|12 || 1870 Open Championship || Prestwick", "|  || Young Tom Morris || align=center|11 || 1869 Open Championship || Prestwick"]}, {"page": "Old Tom Morris", "response": ["Thomas Mitchell Morris (16 June 1821 – 24 May 1908), otherwise known as Old Tom Morris, and The Grand Old Man of Golf, was a Scottish golfer. He was born in St Andrews, Fife, the \"home of golf\" and location of the St Andrews Links, and died there as well. Young Tom Morris (died 1875), also a golfer, was his son.", "Morris held the record for the largest margin of victory in a major championship (13 strokes in the 1862 Open Championship), which stood until Tiger Woods won the 2000 US Open by 15 strokes. He became the second player to break 80 over the Old Course, scoring 79; Robertson had been the first to do it. Once his son Young Tom Morris became an accomplished player in his own right by his mid-teens, in the mid-1860s, father and son formed a team for challenge matches, usually played by alternate shot (foursomes play), where they proved very successful. Their partnership, although not exclusive, would continue until the death of Young Tom in 1875.", "He is buried against the eastern wall of the churchyard of St Andrew's Cathedral. The grave is simple but stands beneath the highly notable monument to his son, Young Tom Morris, which carries a bronze statue of the golfer in high relief against a white background, and is visible across the breadth of the churchyard. His grave attracts thousands of golfers each year who wish to pay homage to this golfing hero.", "The 2016 film Tommy's Honour depicts the lives and careers of Old Tom and his son, and focuses on their complex and bittersweet relationship. It is based on Kevin Cook's Herbert Warren Wind Book Award–winning 2007 biography, Tommy's Honor: The Story of Old Tom Morris and Young Tom Morris, Golf's Founding Father and Son.", "Old and Young Tom Morris.jpg|Old Tom Morris with Young Tom Morris, "]}, {"page": "Young Tom Morris", "response": ["Thomas Morris (20 April 1851 – 25 December 1875), known as Young Tom Morris and also Tommy Morris, was a Scottish professional golfer. He is considered one of the pioneers of professional golf, and was the first young prodigy in golf history. He won four consecutive titles in the Open Championship, an unmatched feat, and did this by the age of 21.", "Old Tom Morris with Young Tom Morris, |thumb|right|250px", "The 2016 film Tommy's Honour depicts the lives and careers of Old Tom (Peter Mullan) and Young Tom (Jack Lowden), and focuses on their complex and bittersweet relationship. It is based on Kevin Cook's Herbert Warren Wind Book Award–winning 2007 biography, Tommy's Honor: The Story of Old Tom Morris and Young Tom Morris, Golf's Founding Father and Son."]}, {"page": "Tom Morris, Jr", "response": ["#REDIRECT Young Tom Morris"]}]}}