{"wiki_id": "http://www.wikidata.org/entity/Q18671241", "itemLabel": "George Stringer Bull", "itemDescription": "Church of England clergyman and social reformer", "wikipedia_url": "https://en.wikipedia.org/wiki/George_Stringer_Bull", "wikipedia_page": {"main": "George Stringer Bull (1799–1865) was an English missionary and cleric, a social and industrial reformer in the Bradford area.", "link_mentions": [{"page": "George Bull (disambiguation)", "response": ["*George Stringer Bull (1799–1865), English cleric and activist"]}, {"page": "Frances Mary Richardson Currer", "response": ["Frances Currer gave money to the North Bierley chapel. Its foundation dated back to Richard Richardson (1708–1781), son of Dr. Richard Richardson, and it had been licensed in 1766. It was only in her time, however, that it was consecrated, in 1824, and she became its patron. It was enlarged at her expense in the following years, and became a chapel of ease. She put up a vicarage there in 1827, for George Stringer Bull."]}, {"page": "John Wood (Bradford manufacturer)", "response": ["In 1831 Wood recruited to the cause George Stringer Bull, a curate at Bierley Chapel (in what is now the City of Bradford) who went on to lobby Lord Ashley, a key figure in factory act legislation put to the House of Commons. At Bowling, then a township just outside Bradford, Wood set up a factory school, with teacher Matthew Balme. Balme was a protégé of Bull, who taught at Bowling for 14 years, and like Bull was a stalwart of the Ten Hours agitation. He later was an associate in the factory reform movement of \"Squire\" Auty and William Edward Forster."]}, {"page": "James Bardsley (priest)", "response": ["After tuition by the Rev. Thomas Rogers at Wakefield Grammar School, Bardsley was a pupil of John Barber at Wilsden, and like Barber was a temperance activist. In the politics of reform, he was a supporter of the 1832 Bill. John Wareing Bardsley, his son, wrote in 1901 of his parents as \"holding firmly to the old Evangelical school with a tendency to Puritan asceticism\". He was also an associate of George Stringer Bull. Under Bull's influence, he took part in the Ten Hours Bill agitation and factory movement, with Richard Oastler.", "Later in the 1830s Bardsley became curate at Bierley Chapel, then just outside Bradford. There he was from 1837 assistant to George Stringer Bull, and had the whole chapel salary; Bull may have relied on support from John Wood. Caught up in a ramifying dispute involving William Scoresby, the vicar of Bradford, Bardsley resigned. He had had expectations of Bull's position at St James's, the new church built by Wood; but Scoresby's efforts to keep Bradford's churches financed by a 50% levy on surplice fees saw Bull and Bardsley leave the area, while Wood closed St James's."]}, {"page": "St John the Evangelist, Bierley", "response": ["*1826 George Stringer Bull"]}]}}