{"wiki_id": "http://www.wikidata.org/entity/Q18674099", "itemLabel": "Lilian Knowles", "itemDescription": "British economic historian and first female professor of Economic History at the London School of Economics and Political Science", "wikipedia_url": "https://en.wikipedia.org/wiki/Lilian_Knowles", "wikipedia_page": {"main": "Lilian Charlotte Anne Knowles (née Tomn; 1870–1926) was a British historian and Professor of Economic History at the London School of Economics (LSE) in the 1920s. She was the first female Dean of the Economic History Faculty in the University of London. \n\n", "link_mentions": [{"page": "List of historians", "response": ["*Lilian Knowles (1870–1926), English economic historian"]}, {"page": "List of people associated with the London School of Economics", "response": ["*Lilian Knowles, First female professor of Economic History and first female Dean of Faculty, 1920s"]}, {"page": "St Clement, Cornwall", "response": ["* Lilian Knowles (1870-1926), economic historian and scholar (LSE), was born in St Clement"]}, {"page": "Truro High School", "response": ["* Lilian Knowles (1870-1926), professor of economic history at LSE and Britain's second professor of the subject"]}, {"page": "Steamboat ladies", "response": ["* Lilian Knowles (1870–1926), historian and professor of economic history"]}, {"page": "Alice Clark", "response": ["Alice Clark studied at the London School Economics (LSE) under the supervision of Lilian Knowles. Alice Clark argued that in 16th century England, women were engaged in many aspects of industry and agriculture. The home was a central unit of production and women played a central role in running farms, and some trades and landed estates. Their useful economic roles gave them a sort of equality with their husbands. However, Clark argues, as capitalism expanded in the 17th century, there was more and more division of labour with the husband taking paid labour jobs outside the home, and the wife reduced to unpaid household work. Middle-class women were confined to an idle domestic existence, supervising servants; lower-class women were forced to take poorly paid jobs. Capitalism, therefore, had a negative effect on powerful women.Alice Clark, Working life of women in the seventeenth century (1919)."]}, {"page": "African historiography", "response": ["The historical works of the time were predominantly written by scholars of the various European powers and were confined to individual nations, leading to disparities in style, quality, language and content between the many African nations. These works mostly concerned the activities of the European powers and centered on events concerning economic and military endeavors of the powers in the region. Examples of British works were Lilian Knowles' The Economic Development of the British Overseas Empire and Allan McPhees The Economic Revolution in British West Africa, which discuss the economic achievements of the British empire and the state of affairs in African nations controlled by Britain."]}, {"page": "List of women writers (A–L)", "response": ["*Lilian Knowles (1870–1926), economic historian"]}]}}