{"wiki_id": "http://www.wikidata.org/entity/Q18687874", "itemLabel": "David Hulin", "itemDescription": "Commercials director", "wikipedia_url": "https://en.wikipedia.org/wiki/David_Hulin", "wikipedia_page": {"main": "David Hulin (born 1975) is a British born Animation Director and VFX Director based in New York, best known for creating iconic animated characters such as the GEICO Gecko, Post Office Ants (UK),  Nigel the Xyzal Owl, The Lactaid Cow, as well as creatively leading many other iconic campaigns for Fedex, GE, Pepsi, M&Ms, Speedy (Alka Seltzer). David has gained a great reputation for his significant contribution to the Computer Graphics and Visual Effects industry over the last two decades.", "link_mentions": [{"page": "Alka-Seltzer", "response": ["In December 2010, Alka-Seltzer began a series of new commercials featuring Speedy, using a CG character, created by Animation Director David Hulin, to recreate the stop-motion puppetry of the 1950s and 1960s, with Speedy voiced by Debi Derryberry."]}, {"page": "Surrey Institute of Art & Design, University College", "response": ["* David Hulin, animator and director"]}, {"page": "Bristol Cathedral Choir School", "response": ["*David Hulin, (born 1975), director and animation director"]}, {"page": "GEICO advertising campaigns", "response": ["The company's ads sometimes focus on its reptilian mascot, the GEICO Gecko, an anthropomorphic day gecko, who was created by the Martin Agency. The character was modified in November 2005 to a CGI character by animation director David Hulin and his team at Framestore. The gecko first appeared on August 26, 1999, during the Screen Actors Guild strike that prevented the use of live actors.Gecko wasn't first choice for GEICO. USA Today, 16 July 2006. Retrieved 16 February 2007. The original commercial features a gecko voiced by actor Kelsey Grammer who climbs onto a microphone on a podium and utters, \"This is my final plea: I am a gecko, not to be confused with GEICO, which could save you hundreds on car insurance. So, stop calling me.\" Later \"wrong number\" ads used Dave Kelly as the voice of the gecko. In the subsequent commercials with British actor Jake Wood, the gecko speaks with an English Cockney accent.Weir, William (21 February 2006). \"Little Lizard Says 'Ello To A New Inflection\", The Hartford Courant, Retrieved 2012-02-11. This style was mimicked by voice actor Andrew Randall for a 2013 commercial on the music streaming service Pandora. "]}, {"page": "5th Visual Effects Society Awards", "response": ["GEICO - Chat – David Hulin, Seth Gollub, Andy Walker, Jenny Bischsel", "*Coke - The Greatest Gift – David Hulin, Nathan Hughes, Jenny Bichsel, Andy Walker"]}, {"page": "1st Visual Effects Society Awards", "response": ["*Dinotopia - Marooned & Making Good – Guy Hudson, Sharon Fitzgerald, Frazer Churchill, David Hulin"]}, {"page": "Hulin, David", "response": ["#redirectDavid Hulin"]}, {"page": "Visual Effects Society Award for Outstanding Visual Effects in a Photoreal Episode", "response": ["| Dinotopia || \"Marooned/Making Good\" || Guy Hudson, Sharon Fitzgerald, Frazer Churchill, David Hulin || ABC"]}]}}