{"wiki_id": "http://www.wikidata.org/entity/Q18686111", "itemLabel": "George E. Felton", "itemDescription": "British computer scientist (1921-2019)", "wikipedia_url": "https://en.wikipedia.org/wiki/George_E._Felton", "wikipedia_page": {"main": "George Eric Felton (3 February 1921 – 14 June 2019) was a British computer scientist. He undertook pioneering work in the field of operating systems and programming software and is the father of the GEORGE Operating System. He held the world record for the computation of π.", "link_mentions": [{"page": "1921 in the United Kingdom", "response": ["* 3 February – George E. Felton, French-born computer scientist (died 2019)"]}, {"page": "Chronology of computation of π", "response": ["|George E. Felton", "|George E. Felton"]}, {"page": "GEORGE (operating system)", "response": ["In December 1964 ICT set up an Operating Systems Branch to develop a new operating system for the 1906/7.  The branch was initially staffed with people being released by the end of work on the OMP operating system for the Ferranti Orion.  The initial design of the new system, named George after George E. Felton head of the Basic Programming Division, was based on ideas from the Orion and the spooling system of the Atlas computer."]}, {"page": "Felton (surname)", "response": ["*George E. Felton, British Computer Scientist"]}, {"page": "ICT 1900 series", "response": ["In December 1964 ICT set up an Operating Systems Branch to develop a new operating system for the 1906/7.  The branch was initially staffed with people being released by the end of work on the OMP operating system for the Ferranti Orion.  The initial design of the new system, named George in part after George E. Felton, head of the Basic Programming Division, was based on ideas from the Orion and the spooling system of the Atlas computer."]}, {"page": "Deaths in June 2019", "response": ["*George E. Felton, 98, British computer scientist, developer of GEORGE operating system.Much Loved: George Eric Felton"]}, {"page": "February 1921", "response": ["*Born: George E. Felton, British computer scientist who developed the GEORGE series of operating systems, in Paris, France (d. 2019)"]}]}}