{"wiki_id": "http://www.wikidata.org/entity/Q18672785", "itemLabel": "William Harrison", "itemDescription": "English singer and opera manager", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Harrison_(singer)", "wikipedia_page": {"main": "William Harrison (15 June 1813 – 9 November 1868) was an English tenor and opera impresario. He was best known for creating roles in new operas by British composers from the 1840s to the early 1860s. Among those who composed for him were William Vincent Wallace, Michael William Balfe and Julius Benedict. After working for Alfred Bunn at the Theatre Royal, Drury Lane, Harrison set up a company in partnership with the soprano Louisa Pyne, which enjoyed success in North America and London in the 1850s.", "link_mentions": [{"page": "Kentish Town", "response": ["* William Harrison, popular tenor and actor"]}, {"page": "Royal Opera House", "response": ["The Royal English Opera company under the management of Louisa Pyne and William Harrison, made their last performance at Theatre Royal, Drury Lane on 11 December 1858 and took up residence at Covent Garden on 20 December 1858 with the premiere of Michael Balfe's SatanellaReviews, \"Drury-Lane Theatre\", The Times, 13 December 1858, p. 10. - the first opera to have its world premiere at the new theatre - and continued there until 1864."]}, {"page": "Charles Santley", "response": ["In the first years after his return to England, Santley used often to sing buffo duets (for example 'Che l'antipatica vostra figura' from Ricci's Chiara di Rosemberg) with Giorgio Ronconi and Giovanni Belletti, at parties held by the influential critic H. F. Chorley.  In 1859 he made his debut at Covent Garden as Hoel in Meyerbeer's opera Dinorah.C. Santley, 'The Art of Singing and Vocal Declamation' (Macmillan and Co., London 1908), pp. 15-17. In the same season he sang in the English Il trovatore (Di Luna), The Rose of Castille, Satanella, La sonnambula, and as Rhineberg in Wallace's Lurline, with William Harrison and Louisa Pyne. Wallace transcribed the latter role (originally for bass) to suit his higher register, and composed the character's part in the final act expressly for him.Santley, 'The Art of Singing' (1908), pp. 17-18. Dinorah also received a royal command performance before Queen Victoria and Prince Albert. He was also able to fit in performances of Gluck's Iphigénie en Tauride in Manchester, with Sims Reeves and Catherine Hayes, for Charles Hallé. These were twice repeated at the residence of Lord Ward in Park Lane, London."]}, {"page": "William Harrison", "response": ["William Harrison may refer to:", "* William Harrison Jr. (c. 1750–1789), delegate for Maryland in the U.S. Continental Congress of 1786 and 1787", "* William Harrison (Canadian politician) (1834–1922), saddlemaker, historian and reeve of Richmond Hill, Ontario", "* William Harrison (MP) (baptised 1619 –1643), English Member of Parliament and Royalist soldier", "* William Harrison (Welsh footballer) (1872–?), Wrexham F.C. and Wales international footballer", "* Billy Harrison (footballer, born 1901) (William Harrison, 1901–1984), English football player", "* William Harrison (cricketer, born 1875) (1875–1937), English cricketer and High Sheriff of Staffordshire", "* William Harrison (cricketer, born 1838) (1838–1912), English cricketer and British Army officer", "* William Harrison (Archpriest of England) (c. 1553–1621), English Roman Catholic priest", "* William Harrison (priest) (1534–1593), English clergyman", "* William Harrison (bishop) (1837–1920), Anglican bishop", "* William Harrison (sea captain) (1812–1860), British merchant navy officer", "* William Harrison (author) (1933–2013), author of \"Roller Ball Murder\" and the screenplay for Rollerball", "* William Harrison (poet) (1685–1713), English poet and diplomat", "* William Harrison (instrument maker) (1728–1815), son of John Harrison, inventor of the chronometer", "* William Harrison (physician) (1935–2010), American obstetrician", "* William Harrison (singer) (1813–1868), English tenor and opera impresario"]}, {"page": "The Bohemian Girl", "response": ["|William Harrison"]}, {"page": "Maritana", "response": ["||Don Cæsar de Bazan ||tenor ||William Harrison"]}, {"page": "Louisa Pyne", "response": ["Louisa Pyne was the manager, with the tenor William Harrison, of the Pyne & Harrison Opera Company which toured the Americas in the 1850s. In 1857 she and Harrison founded the Pyne and Harrison English Opera Company\"Reviews, Lyceum Theatre\", The Times, 27 December 1857, pg.10\"Reviews, Lyceum Theatre\", The Times, 22 September 1857, pg. 12 at the Lyceum Theatre, London.\"Reviews, Royal English Opera\", The Times, 18 October 1864, pg. 12 The company later moved to the Theatre Royal, Drury Lane and, in 1858, under the shortened name of the Royal English Opera, gained a lease at what is now the Royal Opera House in Covent Garden from December 1858 until 1864. The following year, Pyne, along with William Harrison, W. H. Weiss and Madame Weiss,  formed a new company under E.T. Smith at Astley's Theatre Royal.\"Reviews, Astley's Theatre\", The Times, 7 June 1865, pg. 12  On 12 October 1868, she married the singer Frank H. Bodda remaining so until his death aged 69 on 14 March 1892.\"Deaths\", The Times, 15 March 1892, pg. 1 "]}, {"page": "The Lily of Killarney", "response": ["|William Harrison"]}, {"page": "The Desert Flower", "response": ["Both Halevy's Jaguarita l'Indienne and The Desert Flower probably owe their origins to the factual account by Captain John Gabriel Stedman of his adventures in Surinam/Dutch Guiana, titled The Narrative of a Five Years Expedition against the Revolted Negroes of Surinam (1796).  The last opera to be completed by Wallace, its premiere on 12 October 1863 at Covent Garden opened the 8th and final season of Louisa Pyne and William Harrison's English Opera Company. The Prince of Wales was in the audience, and Louisa Pyne herself sang the role of Oanita, with Harrison as Captain Maurice. A contemporary review pronounced  the songs \"pretty\" and the music \"pleasing\" but noted that \"there are no passages which, by their brilliancy and sweetnesss, raise the work to the heights which the composer has achieved in some of his former operas.\"The Rose, the Shamrock and the Thistle, p. 223. See also Wyndham (1906) p. 243. ", "|Captain Maurice || tenor || William Harrison"]}, {"page": "Lurline (opera)", "response": ["|Count Rudolph, a young nobleman || tenor || William Harrison"]}, {"page": "The Rose of Castille", "response": ["After the closure in 1852 of Her Majesty's Theatre, Balfe, who had conducted the Italian Opera there since the departure of Michael Costa in 1846, embarked on extensive tours of European theatres, visiting Berlin, Vienna, Saint Petersburg and Trieste.  In 1857, he returned to London and composed six new English operas for the Pyne-Harrison Opera Company, founded by the soprano Louisa Pyne and the tenor William Harrison, which after touring Britain for four years had sailed for New York in 1854.  The Rose of Castille was the first and most successful of these operas, and the only one to premiere at the Lyceum before the company moved (via Drury Lane) to the rebuilt Royal Opera House, Covent Garden, where the remaining five premiered between 1858 and 1863.", "|William Harrison"]}, {"page": "Matilda of Hungary", "response": ["|George Podiebrad, a Moravian mountaineer || tenor || William Harrison"]}, {"page": "The Armourer of Nantes", "response": ["The Armourer of Nantes is an opera in three acts, with music by Michael William Balfe and libretto by J. V. Bridgman. The opera is based on Victor Hugo's 1833 play Marie Tudor and set in Nantes, France, in 1498.  The opera was first produced at Covent Garden, under the management of Louisa Pyne and William Harrison, on 12 February 1863.George Grove, A Dictionary of Music and Musicians, \"Armourer of Nantes,\" 1900.", "|Raoul, the Armourer||tenor||William Harrison"]}, {"page": "Old Broadway Theatre", "response": ["The eighth season opened August 21, 1854, with Barrett as stage manager, replacing Mr. Barry. Miss Davenport played two engagements totaling four weeks, in Camille and Adrienne and opposite Conway in both Ingomar and Evadne. E. L. Davenport played five weeks, two of them with his wife, Fanny Vining, who made her American debut (opposite her husband) March 2 in Love's Sacrifice.  He performed as Richard III, Brutus, Rolla in Pizarro, Hercule in Civilization, St. Pierre in James Sheridan Knowles' The Wife, and William in Black-Eyed Susan, and in two plays by J. H. Wilkins, The Egyptian, and St. Marc, the latter with Ponisi and Conway.  Vining played opposite her husband in Hamlet, The Lady of Lyons, Othello, Much Ado About Nothing, and W. Robson's Love and Loyalty. She also played a week without him, opposite Conway, in Romeo and Juliet, The Love Chase, and a new comedy called Charity's Love. A double bill of A New Way to Pay Old Debts (Davenport only), and Charity's Love (Vining and Conway) closed their engagement on May 26. Forrest appeared nine weeks in two engagements, performing in Pizarro, Brutus, The Lady of Lyons, and Coriolanus, among his other roles.  William Harrison and Louisa Pyne performed twelve and a half weeks of opera, including La sonnambula, The Bohemian Girl, William Vincent Wallace's Maritana, Fra Diavolo, The Crown Diamonds, The Beggars' Opera, Guy Mannering, The Enchantress, and Cinderella. Agnes Robertson played three weeks, in The Maid With the Milking Pail, The Young Actress, and Asmodeus, as Carlo. She also appeared as Andy Blake, Don Leander, the Fairy Star, and Bob Nettles. Her husband, Dion Boucicault, appeared with her the last week. A Midsummer Night's Dream was revived for one week. Eloise Bridges began a two-week run March 12. The season ended on June 2, 1855. There followed summer seasons by Mr. and Mrs. Barney Williams (June 25 – July 31) and Gabriel Ravel et al. (August 6 – September 15).", "The ninth season opened September 17, 1855, with Blake as stage director. Opening night featured E. L. Davenport in 'Richard III, with Charles Fisher as Richmond. King Charming opened Christmas Eve, 1855, and Sea of Ice was added to the bill January 14. These extravaganzas closed January 26. J. W. Wallack Jr. played January 28 – February 6, including the New York premiere of Leon, or The Iron Mask, an historical play by William Bayle Bernard, with Ponisi and Fisher in the cast. Wallack also acted in Romeo and Juliet, The Stranger, Love's Sacrifice, and The Lady of Lyons, opposite Jane Coombs. King Charming played again February 7 – 15. On February 18, the equestrian dramatic spectacle Herne, the Hunter, adapted by Mr. N. B. Clarke from an historical romance by William Harrison Ainsworth, began a three-week run, with a stud of horses from Nixon & Myers.Slout (ed.): Nixon, James M. This was followed on March 10 by The Cataract of the Ganges for one week, and then Timour the Tartar was added to the bill (with The Cataract of the Ganges) for one week. Finally, a week of Mazeppa was given, ending the six-week equestrian run. The Keller Company, famous for their stage tableaux, appeared for two weeks beginning March 31. The Williamses played seven weeks, April 14 –  May 31, followed by three weeks of the stock company, ending the season on June 21, 1856."]}, {"page": "Owners, lessees and managers of the Royal Opera House, Covent Garden", "response": ["| rowspan=\"3\" | 1849 – 1877 Frederick Gye Sub-lessees:1856: Professor Anderson 1856-64 (part): Louisa Pyne & William Harrison Various dates: Colonel MaplesonMapleson went to the USA and put on opera at the New York Academy of Music. His nephew Lionel Mapleson created the Mapleson Cylinders at the 'old' Metropolitan Opera House during the last years of Maurice Grau's directorship there. Grau was also manager of Covent Garden 1897-1900 for the Syndicate."]}]}}