{"wiki_id": "http://www.wikidata.org/entity/Q18640342", "itemLabel": "Låpsley", "itemDescription": "British singer-songwriter", "wikipedia_url": "https://en.wikipedia.org/wiki/L%C3%A5psley", "wikipedia_page": {"main": "Holly Lapsley Fletcher (born 7 August 1996), known by the stage name Låpsley, is an English singer, songwriter, musician and producer. Her debut album Long Way Home was released on 4 March 2016.", "link_mentions": [{"page": "Å", "response": ["British producer and singer Låpsley uses it in her stage name."]}, {"page": "Blackpool", "response": ["Songs that mention Blackpool in the lyrics include \"Elvis Impersonator: Blackpool Pier\", the opening track of the Manic Street Preachers album Everything Must Go, which contains the lyric \"20ft high off Blackpool Promenade\" amongst other references to Blackpool. The opening line of Soft Cell's 1982 \"Say Hello, Wave Goodbye\" hit (later a hit for David Gray in 1998) \"Standing at the door of the Pink Flamingo, Crying in the rain\" is believed to be a reference to Blackpool's famous gay nightclub The Flamingo. Låpsley's chillout song \"Painter (Valentine)\" includes the lines \"you can paint these wings and make me fly / crush coming over like the R.E.M kind / orange in the colour like Blackpool on the sunrise\"."]}, {"page": "Southport", "response": ["* Låpsley, musician"]}, {"page": "Rock Werchter", "response": ["| Skunk Anansie SX Unknown Mortal Orchestra Låpsley Elle King Aurora"]}, {"page": "XL Recordings", "response": ["* Låpsley"]}, {"page": "Reading and Leeds Festivals line-ups", "response": ["*Låpsley"]}, {"page": "Paul Staveley O'Duffy", "response": ["In the 2000s to date O'Duffy continues to collaborate with artists and songwriters including Charlotte OC, Låpsley, Purple Ferdinand, Andreya Triana and Ella Eyre."]}, {"page": "Glastonbury Festival line-ups", "response": ["* Låpsley"]}, {"page": "Latitude Festival", "response": ["<BR>Låpsley"]}, {"page": "BBC Radio 1's Big Weekend", "response": ["|Phoebe Bridgers and Arlo Parks (2020)  Foals (2020)  Haim (2020)  Lianne La Havas (2020)  Thom Yorke (2018)  Griff (2021)  Tom Grennan (2020)  Dodie (2019)  Låpsley (2020)  Clairo (2019)  Alessia Cara (2018)  King Princess (2019)  Mac Demarco (2019)"]}, {"page": "List of Live Lounge cover versions", "response": ["|Låpsley || \"Pillowtalk\" by Zayn || 3 March 2016"]}, {"page": "Osheaga Festival", "response": ["Friday: La famille Ouellette, Safia Nolin, Dear Rouge, White Lung, Marian Hill, Låpsley"]}, {"page": "Haldern Pop", "response": ["| Alcoholic Faith Mission, AnnenMayKantereit, Bear’s Den, Benjamin Booker, Bernd Begemann & Die Befreiung, Big Sixes (UK), Bilderbuch, Cantus Domus (DE), Courtney Barnett, Dan Deacon, Delta Rae, dEUS, Die Sonne, DMA’S (AUS) , Dotan, Douglas Dare, Family of the Year, Father John Misty, Frances (UK), Grandbrothers (DE), Heisskalt (DE), Ibeyi, Iceage, Intergalactic Lovers, Johann Sebastian Bach (Musik von ihm), Kapok (NL), Kate Tempest, Kiasmos, Kiko King & creativemaze (DE), Låpsley, Laura Marling, Liam Ó Maonlai & Peter O’Toole, Low Roar, Magnus, Mammút, Marcus Wiebusch, Mark Geary feat. Grainne Hunt, Nils Frahm, Olli Schulz, Public Service Broadcasting, Puts Marie (CH), Rae Morris, Savages, Soak, Someday Jacob, stargaze & André de Ridder, Steve Gunn, Sunset Sons, Terra Profonda, The Bronze Medal (UK), The Districts, The Slow Show, The War On Drugs, Tor Miller, Tora, Tour Of Tours, Viet Cong, Villagers, White Fence, Woods of Birnam (DE).", "| Ala.ni, Albin Lee Meldau, Alex Vargas, Algiers, Arthur Beatrice, Ben Caplan & The Casual Smokers, The Besnard Lakes, Cantus Domus, Damien Rice, Daughter, Die Nerven, Drangsal, Ebbot Lundberg & The Indigo Children, Elias, Fai BaBa, Frost (Heiner), Frightened Rabbit, Heisskalt, Hothouse Flowers 3, Hubert von Goisern, GoGo Penguin, Glen Hansard, The Graveltones, Izzy Bizu, Jack Garratt, Jambinai, Jason Isbell, Julia Holter, Låpsley, Loney Dear, The Lytics, Martin Kohlstedt, Me + Marie, Melanie de Biasio, Michael Kiwanuka, Minor Victories, Money, Monobo Son, The Rad Trads, Rationale, Roo Panes, Samm Henshaw, Sara Hartman, Stargaze, The Strypes, St. Paul and The Broken Bones, Thees Uhlmann, The Vryll Society, This Is the Kit, Walking on Cars, Whitney, Wintergatan, Woman (DE), Yak."]}, {"page": "Greenbank High School", "response": ["* Holly Fletcher, Låpsley, singerhttp://www.champnews.com/newsdetail.aspx?ID=GN4_ART_104950"]}, {"page": "List of people from York", "response": ["*Låpsley (born 1996)"]}, {"page": "Sound of...", "response": ["| Kwabs, Låpsley, Novelist, Rae Morris, Shamir, Shura, Slaves, SOAK, Sunset Sons, Wolf Alice", "The longlist for the Sound of 2015 poll was revealed on 1 December 2014. The acts nominated were George the Poet, James Bay, Kwabs, Låpsley, Novelist, Rae Morris, Raury, Shamir, Shura, Slaves, SOAK, Stormzy, Sunset Sons, Wolf Alice and Years & Years. On 9 January 2015, Years & Years were announced as the winners on Radio 1 by Huw Stephens."]}, {"page": "List of gay, lesbian or bisexual people: L", "response": ["| Låpsley"]}, {"page": "Livingston Recording Studios", "response": ["Gold sold Livingston to global recording studio directory Miloco Studios in 2012, who renovated the studio in October of that year and re-launched the studio alongside producer Mike Crossey. Since then artists such as The 1975, Arctic Monkeys, Låpsley, Gin Wigmore, Hozier and Ben Howard have all worked on projects at Livingston Studios with Mike Crossey", "*Låpsley"]}, {"page": "Lapsley", "response": ["*Låpsley, a British singer-songwriter and electronic music artist"]}, {"page": "London Calling (festival)", "response": ["| 30 and 31 October 2015 || The Big Moon, INHEAVEN, Mike Krol, Marlon Williams, Charlotte OC, LA Priest, Plastic Mermaids, Pumarosa, Dornik, Chastity Belt, Formation, White, Bully, Låpsley, Holy Holy, Circa Waves, Swim Deep, The Jacques, Spiritualized, Waxahatchee, Lower Dens, Kurt Vile, Howard ."]}, {"page": "The National discography", "response": ["| \"Bad Stuff Happens in the Bathroom\" (with Låpsley)"]}, {"page": "Coachella Festival line-ups", "response": ["* Låpsley"]}, {"page": "Rodaidh McDonald", "response": ["| Låpsley", "| Låpsley"]}, {"page": "Charlie Hugall", "response": ["| rowspan=\"2\"| Låpsley", "| Låpsley, Rodaidh McDonald, Tourist", "| Låpsley, Rodaidh McDonald, ROMANS"]}, {"page": "DJ Koze", "response": ["Since 2009 he runs the label Pampa Records. With his on Pampa Records released album 2013 Amygdala he entered for the first time the official German and Swiss charts. In addition, he was honored for the Echo Award 2014 with the Critics Award. On June 15, 2015, the 50th edition of the DJ Mix series DJ Kicks, was released on the Berlin label Studio !K7, which attracted a great deal of national and international attention. In 2017, he was nominated for two Electronic Music Awards for Record of the Year and Remix of the Year, both for his Extended Disco Version of Låpsley's \"Operator\".", "* Låpsley – Operator (DJ Koze Remix) (XL)"]}, {"page": "List of UK Independent Singles Breakers Chart number ones of the 2010s", "response": ["| Låpsley", "| Låpsley", "!scope=row|Låpsley"]}, {"page": "List of 2015 albums", "response": ["| Låpsley"]}, {"page": "Låpsley (musician)", "response": ["#REDIRECT Låpsley"]}, {"page": "Jin Jin (musician)", "response": ["| Amber Van Day, Charli XCX, Jax Jones, Joel Corry, Kamille Purcell, Lewis Thompson, Låpsley, Neave Applebaum, Nonô, RØRY, Saweetie, Stromae"]}, {"page": "Jimmy Napes", "response": ["| Låpsley || \"Hurt Me\" || Long Way Home"]}, {"page": "Tourist (musician)", "response": ["| Låpsley", "| Låpsley, Rodaidh McDonald, Charlie Hugall"]}, {"page": "Romans (musician)", "response": ["|Låpsley"]}, {"page": "Bergenfest", "response": ["*Låpsley"]}, {"page": "List of 2016 albums", "response": ["| Låpsley"]}, {"page": "Matt Colton", "response": ["* Låpsley - Hurt me 2015 "]}, {"page": "Pillowtalk (song)", "response": ["Cover versions of \"Pillowtalk\" have been uploaded to YouTube by SoMo,SoMo - Pillowtalk (Zayn Rendition), Niki and Gabi, Conor Maynard, Tanner Patrick,ZAYN - PILLOWTALK Cover by Tanner Patrick (PILLOW TALK), Tanner Patrick, YouTube  The Vamps,Zayn - Pillowtalk (Cover By The Vamps), The Vamps, YouTube Alex Aiono, Julio D, and Boyce Avenue. JoJo performed a live rendition at concerts in Cologne and London. Låpsley performed a cover version on BBC Radio 1's Live Lounge. Shaun Reynolds and Kaycee da Silva uploaded a cover version of \"Pillowtalk\" on YouTube.ZAYN - PILLOWTALK // (Shaun Reynolds & Kaycee Da Silva Cover), Shaun Reynolds, YouTubeZayn - Pillowtalk (Kaycee da Silva & Shaun Reynolds Cover), Kaycee Da Silva, YouTube The Gregory Brothers uploaded a tongue-in-cheek, uptempo cover to YouTube as part of their \"Happy Sad Songs\" series. It is re-envisioned as an alternative electro rock song, partially inspired by The Strokes. Stwo released a remix of \"Pillowtalk\" on SoundCloud. In season 10 of The Voice, contestant Bryan Bautista performed a rendition of \"Pillowtalk\". American rapper Tyler, The Creator released a remix of \"Pillowtalk\" in June 2016. It was danced by Terrell Owens and his partner on Dancing with the Stars (U.S. season 25)"]}, {"page": "Long Way Home (Låpsley album)", "response": ["Long Way Home is the debut studio album written and produced by British singer, songwriter and musician Låpsley. It was released on 4 March 2016 through XL Recordings.", "Category:Låpsley albums"]}, {"page": "Glastonbury Festival 2016", "response": ["Låpsley"]}]}}