{"wiki_id": "http://www.wikidata.org/entity/Q18624768", "itemLabel": "Sue Williams", "itemDescription": "British artist (1956)", "wikipedia_url": "https://en.wikipedia.org/wiki/Sue_Williams_(artist)", "wikipedia_page": {"main": "Sue Williams (born 1956 in Cornwall) is a British visual artist, trained, living and working in Wales.", "link_mentions": [{"page": "My Bed", "response": ["Art world predecessors to Emin's personal disclosure work include artists Carolee Schneemann, Sue Williams, Karen Finley, Jo Spence, and David Wojnarowicz."]}, {"page": "List of people with surname Williams", "response": ["*Sue Williams (artist) (born 1956), Welsh visual artist"]}, {"page": "List of 20th-century women artists", "response": ["*Sue Williams (born 1956), British visual artist"]}, {"page": "Susan Williams", "response": ["*Sue Hamilton (actress) (1945–1969), American model and actress also known as Sue Williams", "*Sue Williams (artist) (born 1956), Welsh visual artist", "*Sue Williams (painter) (born 1954), American artist"]}, {"page": "Cardiff School of Art & Design", "response": ["*Sue Williams, painter, awarded the Eisteddfod Gold Medal for Fine Art in 2000"]}, {"page": "Amy Pleasant", "response": ["Pleasant received a BFA from The School of the Art Institute of Chicago and an MFA from the Tyler School of Art at Temple University. Pleasant is best known for her figurative, free associative paintings and drawings that explore simple, daily acts in slowly unfolding narratives. In an article from Art in America, Max Henry wrote that her work “chronicles everyday life…full of existential angst and loneliness, her paintings are able to evoke an empathetic response from the viewer.”  David Moos wrote of Pleasant’s work that through “fragments of overlapping narratives” the viewer is allowed to “glimpse the formation of images” and is “made aware of how the painter makes decisions in paint, amending a passage and visibly editing the composite image.”  Martha Schwendener, art critic for The New York Times and critic of photography at the Yale School of Art, reviewed Pleasant's work in the contemporary art periodical Artforum, stating that Pleasant's paintings are “laid out in grids which collectively hint at angst-ridden narratives” which are stylistically reminiscent of “early Sue Williams paintings—the vitriolic feminist ones—or comics whose narrative core has disintegrated, leaving behind only the shame, fear, or desire that instigated them in the first place.”"]}, {"page": "List of Welsh artists", "response": ["*Sue Williams (born 1956), visual artist"]}, {"page": "List of women artists associated with Wales", "response": ["*Sue Williams (born 1956), visual artist"]}, {"page": "It Is Almost That", "response": ["Contributors to It Is Almost That are Eleanor Antin, Bambanani Women's Group, Fiona Banner, Louise Bourgeois, Theresa Hak Kyung Cha, Cozette de Charmoy, Ann Hamilton, Jane Hammond, Susan Hiller, Dorothy Iannone, Bhanu Kapil & Rohini Kapil, Helen Kim, Alison Knowles, Ketty La Rocca, Bernadette Mayer, Adrian Piper, Charlotte Salomon, Geneviéve Seillè, Molly Springfield, Cole Swensen & Shari DeGraw, Suzanne Treister, Erica Van Horn & Laurie Clark, Carrie Mae Weems, Hannah Weiner, Sue Williams, and Unica Zürn."]}, {"page": "List of Welsh women", "response": ["*Sue Williams (born 1956), visual artist"]}]}}