{"wiki_id": "http://www.wikidata.org/entity/Q18681520", "itemLabel": "Mary Heron", "itemDescription": "Heron, Mary (fl. 1786–1792), poet and writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Mary_Heron", "wikipedia_page": {"main": "Mary Heron (fl. 1786-1792) was an English writer who probably lived in or near Durham in the 1780s and 1790s.\nShe was the author of three books of poetry and an epistolary novel, all published in Newcastle. Her 1786 book, Sketches of Poetry, named her as \"Mary Heron of Durham\" on the title page, and advertisements for her Odes, &c. on various occasions in 1792 described her the same way, while the preface to it is signed from Durham. The city is mentioned in several poems, and the countryside nearby is the theme for verses about the banks of the River Wear (dated 1781), Lumley Castle (1785) and Finchale Abbey (Fankal Abbey 1784).\nHeron's Odes include poems about current affairs, especially the French Revolution. She defends her interest in such matters in the preface, and admits to \"feeling some anxiety\" about how her work will be received. Women would be \"an inferior order of beings\" if they were \"totally ignorant\" of momentous events in a neighbouring country or \"destitute of feeling for their fellow creatures\". Since they are \"often the first victims\" of upheaval it is not unreasonable for them to give \"their humble opinion\". They should not, however, be active in public, political life like their \"lords and masters\". She points out that her Ode to Reformation supports \"moderation\" even while implying that England is not free of injustice, and says that \"the love of our country, and a knowledge of its constitution are virtues\". Julia Gasper, writing in the Oxford Dictionary of National Biography, considers that Heron \"had thought carefully about gender politics and that her opinions were advanced for the time\".As well as writing about nature and socio-political topics, Heron composed various poems commemorating a death or addressed to an individual. Several of these touch on the theme of motherhood.", "link_mentions": [{"page": "Heron (surname)", "response": ["*Mary Heron (fl. 1786–1792), English writer"]}]}}