{"wiki_id": "http://www.wikidata.org/entity/Q18672027", "itemLabel": "John Muir", "itemDescription": "Scottish merchant  (1828–1903)", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Muir_(businessman)", "wikipedia_page": {"main": "Sir John Muir, 1st Baronet DL JP (1828–1903) was a Scottish businessman who served as Lord Provost of Glasgow from 1889 to 1892. He founded Finlay Muir & Co, one of the world's largest 19th century companies.\n\n", "link_mentions": [{"page": "John Muir (disambiguation)", "response": ["John Muir (1838–1914) was a Scottish-born American environmentalist and author.", "John Muir may also refer to:", "* John Muir (indologist) (1810–1882), British linguist", "* John Muir (businessman) (1828-1903), Scottish businessman, founder of Finlay Muir & Co, and Lord Provost of Glasgow", "* John Muir (South African naturalist) (1874–1947), Scottish-born South African physician, naturalist and historian", "* John Muir (footballer, born 1903), Scottish footballer", "* John Muir (engineer) (1918–1977), American engineer and author", "* John Muir (footballer, born 1947), Scottish footballer", "* John Muir (judge) (fl. c. 2000), judge on the Supreme Court of Queensland, Australia", "* John Muir College, an undergraduate college of the University of California, San Diego", "* \"John Muir\", a song by Schoolboy Q from Blank Face LP", "* John Muir Award (disambiguation)", "* John Muir Branch Library, Los Angeles", "* John Muir Country Park, East Lothian, Scotland", "* John Muir Health, a health care service", "* John Muir National Historic Site, in the San Francisco Bay area, California", "* John Muir Parkway, part of California State Route 4", "* John Muir Publications, an American publisher best known for publishing Rick Steves, acquired by Avalon Publishing Group", "* John Muir Trail, California", "* John Muir Trail (Tennessee)", "* John Muir Trust, a Scottish charity", "* John Muir Way, a coastal path in East Lothian", "* John Muir Wilderness, California"]}, {"page": "Sir John Muir", "response": ["#REDIRECT John Muir (businessman)"]}, {"page": "4th (Glasgow, 1st Northern) Lanarkshire Rifle Volunteer Corps", "response": ["* Sir John Muir, 1st Baronet, Lord Provost of Glasgow, appointed 14 November 1891"]}, {"page": "James Finlay & Co", "response": ["James Finlay & Co was formed in 1750 and under the leadership of Kirkman Finlay became one of Scotland’s leading cotton manufacturers and merchants. In the 1860s the firm came under the control of John Muir and diversified into Indian tea plantations. The cotton business was eventually closed and, after an unsuccessful period of diversification, Finlay concentrated on its core interests of tea and other agricultural produce. In 2000, the firm was acquired by John Swire & Son.", "==Sir John Muir==", "One of the new partners appointed in 1861 was John Muir.  That was the year the American Civil War started; supplies of cotton were curtailed and the cotton mills were closed. John Muir turned to India to source the firm's cotton and opened offices in Calcutta and Bombay.  Muir gradually built up his capital in the firm and by 1871 he owned 8 of the 30 shares. John Finlay died in 1873 and when Archibald Buchanan retired in 1883, Muir became the sole owner of James Finlay & Co. The Calcutta branch was formed as Finlay Muir and first acted as agency business for cotton and other goods. Muir then diversified into the manufacture of jute, forming the Champdany Jute Company in 1873. A second mill was added in 1880 with the purchase of the Acland Mill, later renamed as the Wellington Jute Mills. The two spinning mills employed 5,000 workers.", "In 1882 the firm’s Scottish cotton mills were declared unremunerative and John Muir and the junior partners agreed to invest \"a considerable amount of capital\" in two tea companies. According to Brogan. he diverted most of the firm’s resources to this entirely new venture. \"The general business of merchant and agent was well understood by the firm, but the development and management of tea estates was something entirely new.\"  John Finlay & Co was to act for the tea companies in Glasgow and the joint partnership of Finlay Muir & Co, in Calcutta as agents in India.", "Like Kirkman Finlay before him, Sir John Muir’s commercial achievements brought public recognition.  He too became a Lord Provost and was created a Baronet in 1892.  By the time of his death in 1903, Finlay had 74,000 acres planted and employed 70,000 Indian workers and a large staff of superintendents, managers and assistants from Scotland. It was the leading Indian tea supplier in the UK market.", "Sir John Muir had four sons and six daughters. Upon his death in 1903, the business was supervised by trustees and the management was led by the eldest son, Alexander Kay Muir. In 1909 a private limited company was formed to consolidate the various interests of James Finlay. These included the Glasgow merchanting business and the Catrine and Deanston Mills, the interests of the firm in the Liverpool and London merchanting businesses, and all the interests of Finlay Muir in the Indian sub-continent."]}]}}