{"wiki_id": "http://www.wikidata.org/entity/Q18671187", "itemLabel": "Francis Hart", "itemDescription": "British rheumatologist,1909–2004", "wikipedia_url": "https://en.wikipedia.org/wiki/Francis_Dudley_Hart", "wikipedia_page": {"main": "Francis \"Frank\" Dudley Hart  (1909–2004) was a British rheumatologist.After education at Grosvenor School in Edwalton, Nottinghamshire, Frank Dudley Hart spent two years studying in an Anglican seminary before switching to the study of medicine in Edinburgh. He graduated MB ChB in 1933 from the medical school of the University of Edinburgh. From 1933 to 1938 he held junior appointments at the Royal Hospital for Sick Children, Edinburgh, Paddington Green Children's Hospital, Royal Northern Hospital, and Royal Brompton Hospital. At Westminster Hospital he was appointed a registrar and then a senior registrar.In 1939 in anticipation of the bombing of London, the people at Westminster Hospital were evacuated — Hart and three other surgeons remained to run the evacuated hospital as a casualty clearing station. In 1942 he joined the RAMC. He served as a major in charge of a medical division of the RAMC in Iraq, North Africa and Italy and was mentioned in despatches. He attained the rank of lieutenant colonel. At the Westminster Hospital he was appointed in 1946 an assistant physician and later a consultant physician. He remained in that post until his retirement from the National Health Service in 1974. Until 1987 he continued in private practice.Hart was the first to recognise that ankylosing spondylitis is a different disease from rheumatoid arthritis. He was elected FRCP in 1949.In 1952, Hart chaired the Royal College of Physicians committee on rheumatology and put forth a plan for a research institute devoted to rheumatology. Mathilda Marks Kennedy, one of the five children of Michael Marks, gave half a million pounds to establish the Kennedy Institute of Rheumatology, affiliated to Charing Cross Hospital.Under the auspices of the Royal College of Physicians, he delivered in 1975 the Bradshaw Lecture on Inflammatory disease and its control in the different rheumatic disorders. He wrote, or contributed to, more than 20 medical books and 200 scientific papers.\nHart wrote and broadcast for a lay audience, was the author of Overcoming Arthritis (1981) and for many years — until 1998, when he was nearly 90 — wrote a regular column in Arthritis Today, the Arthritis Research Campaign's quarterly magazine, answering readers' questions.\nIn the late 1920s and early 1930s he paid for his medical school education by playing the saxophone in nightclubs.\nHe was a capable musician and could play more than 15 instruments. He produced six long play records of his compositions, including his 'rheumatological song cycle', in which he put the story of modern rheumatology to music, building up his own accompaniment by successive synchronised tape recordings.\nHart married in 1944. He was predeceased by his wife and upon his death was survived by three children and two grandchildren.", "link_mentions": []}}