{"wiki_id": "http://www.wikidata.org/entity/Q18761918", "itemLabel": "Charles Pye", "itemDescription": "English engraver", "wikipedia_url": "https://en.wikipedia.org/wiki/Charles_Pye_(engraver)", "wikipedia_page": {"main": "Charles Pye Jr. (Birmingham 1777–1864) was a British engraver from Birmingham. He illustrated topographical subjects, and published a Holy Family after Michelangelo.", "link_mentions": [{"page": "Charles Pye", "response": ["Charles Pye  (chr: 24 September 1820 – 12 July 1876) was an English recipient of the Victoria Cross, the highest and most prestigious award for gallantry in the face of the enemy that can be awarded to British and Commonwealth forces.", "Charles Pye is not to be confused with Lieutenant-Colonel Charles Colquhoun Pye (11 Nov 1834 – 17 Feb 1872), son of Henry John Pye and Mary Anne Walker of Clifton Campville, Staffordshire.  Charles Colquhoun Pye was not the recipient of the Victoria Cross.", "Charles Pye was the eldest child of Thomas Pye and Alice Hall. Born in 1820 his birth date is unknown.  His baptism occurred on 24 September 1820 at St Mary's church, Castle Church, Staffordshire.  Charles was probably a few months old when he was baptised.  His death certificate and obituary state he was 56 years old when he died, which suggests he was born prior to July 1820.", "In 1862 Charles Pye took his discharge and emigrated to New Zealand with his wife and stepdaughter. Here he was appointed Captain of the Auckland Militia in July 1863, and the following year as Captain of the Colonial Defence Force. He served at Hairini and Te Ranga in the Bay of Plenty and a redoubt near Tauranga, Pye's Pa was named in his honour.", "Following his discharge Charles Pye lived at Papakura ", "File:Medal, decoration (AM 2001.25.838-2).jpg|Obverse of Victoria Cross awarded to Charles Pye", "File:Medal, campaign (AM 2001.25.839-2).jpg|Gwalior Campaign Star 29 December 1843 awarded to Private Charles Pye", "File:Medal, campaign (AM 2001.25.842-2).jpg|Indian Mutiny Medal 1857–58 with bars for Lucknow and Relief of Lucknow awarded to Ensign Charles Pye, 53rd Regiment", "File:Medal, campaign (AM 2001.25.840-1).jpg|Sutlej Campaign Medal 1845-46 awarded to Corporal Charles Pye, 31st Regiment", "File:Medal, campaign (AM 2001.25.843-2).jpg|New Zealand Medal 1860-66 awarded to Captain Charles Pye, Colonial Defence Force", "File:Medal, decoration (AM 2001.25.838-3).jpg|Reverse of Victoria Cross awarded to Charles Pye", "File:Medal, campaign (AM 2001.25.839-5).jpg|Reverse of Gwalior Campaign Star 29 December 1843 awarded to Private Charles Pye", "File:Medal, campaign (AM 2001.25.840-11).jpg|Engraving on Indian Mutiny Medal awarded to Ensign Charles Pye, 53rd Regiment", "File:Medal, campaign (AM 2001.25.843-3).jpg|Reverse of New Zealand Medal 1860-66 awarded to Captain Charles Pye, Colonial Defence Force", "File:Medal, campaign (AM 2001.25.843-9).jpg|Engraving on New Zealand Medal 1860-66 awarded to Captain Charles Pye, Colonial Defence Force", "*Burial location of Charles Pye \"Victoria, Australia\"", "*News item \"Charles Pye's Victoria Cross donated to the Auckland Museum\""]}, {"page": "James Duffield Harding", "response": ["He was apprenticed to the engraver Charles Pye, but left him after only a year to concentrate on painting watercolours, and when he was 18 he was awarded a silver medal by the Society of Arts. In 1818 he showed with the Society of Painters in Watercolours, (known as the \"Old Watercolour Society or OWCS from 1831)  for first time. He was to contribute to its exhibitions for the rest of his life. He was elected an associate of the society in 1820 and a full member in 1821. In 1843 he took up oil painting, and exhibited many landscapes in that medium at the Royal Academy. In 1847 he resigned his membership of the OWCS , hoping to be elected a member of the academy; but, after nine years without success,  he withdrew his candidature, and was re-elected to the OWCS."]}, {"page": "Charles John Smith", "response": ["He was born in 1803 at Chelsea where his father, James Smith, practised as a surgeon. He was a pupil of Charles Pye, and became an engraver of book illustrations of a topographical and antiquarian character.  He was elected a Fellow of the Society of Antiquaries in 1837, and died of paralysis in Albany Street, London, on 23 November 1838."]}, {"page": "John Pye", "response": ["He was the second son of Charles Pye of Birmingham, where he was born on 7 November 1782; his mother was a daughter of John Radclyffe, also of Birmingham, and aunt of William Radclyffe the engraver. His brother Charles Pye was also an engraver. His father published an account of Birmingham, a geographical dictionary, and several series of plates of provincial coins and tokens. These engraved by himself, with the assistance of his son John, who was removed from school when still a child, and received his first instruction in engraving from his father. Later he was a pupil of Joseph Barber of Birmingham, and was then apprenticed to a plate-engraver named Tolley."]}, {"page": "Britannia Depicta", "response": ["* Charles Pye (engraver) 1777–1864"]}, {"page": "Charles Pye (Birmingham)", "response": ["#REDIRECT Charles Pye (engraver)#Charles Pye senior"]}, {"page": "Charles Pye senior", "response": ["#REDIRECT Charles Pye (engraver)"]}]}}