{"wiki_id": "http://www.wikidata.org/entity/Q18756744", "itemLabel": "Helen Crawfurd", "itemDescription": "Scottish suffragette and communist (1877-1954)", "wikipedia_url": "https://en.wikipedia.org/wiki/Helen_Crawfurd", "wikipedia_page": {"main": "Helen Crawfurd Anderson (9 November 1877 – 18 April 1954) was a Scottish suffragette, rent strike organiser, Communist activist and politician. Born in Glasgow, she was brought up there and in the London area.", "link_mentions": [{"page": "Independent Labour Party", "response": ["including economist Emile Burns, journalist R. Palme Dutt, and the future Member of Parliament Shapurji Saklatvala, along with Charles Barber, Ernest H. Brown, Helen Crawfurd, C. H. Norman, and J. Wilson.  They called themselves the Left Wing Group of the ILP."]}, {"page": "Red Clydeside", "response": ["Helen Crawford was opposed to conscription and, although there were anti-war and anti-conscription campaigns in organisations such as the WIL being organised and run by middle class women, few working class women were involved in Scotland.  Frustration on her part on their lack of representation, Helen Crawfurd organised a grassroots meeting called 'The Great Womens Peace Conference' involving socialist-minded women in June 1916.  From this meeting, and alongside her fellow Rent Striker Agnes Dollan, The Women's Peace Crusade (WPC) arose  in November 1916 in Govan, Glasgow.  As intended, the organisation initially attracted workingclass women in Govan to activism, and with open air meetings throughout Glasgow, Edinburgh and within Lowland Scotland they began to extend their reach. By 1917, street meetings were regularly being held all around the districts of Glasgow and beyond, including Partick, Maryhill, Bridgeton, Parkhead, Govan, Govanhill, Whiteinch, Shettleston, Springburn, Possilpark, Bellahouston, Rutherglen, Paisley,  Overnewton Barrhead, Cambuslang, Blantyre, Alloa, Cowdenbeath, Drongan, Drumpark, Douglas Water and Lanark. As a further indicator of their success, a mass demonstration was organised by the WPC on Sunday 8 July 1917, in which processions marched to the sound of music and the flying of banners from two sides of the city to the famous Glasgow Green in the centre of the city.  As the two streams of Crusaders approached the green they merged into a huge colourful and noisy demonstration of around 14,000 participants.", "John Maclean of the British Socialist Party organised the Scottish Federation of Tenants' Associations in 1913 to fight against rent increases and championed public housing. In 1914 the Independent Labour Party Housing Committee and the Women's Labour League formed the Glasgow Women's Housing Association. Under the leadership of Mary Barbour, Mary Laird, Helen Crawfurd, Mary Jeff and Jessie Stephen the Glasgow Women's Housing Association became the driving force behind the rent strike that started in May 1915 in the industrialised area of Govan. Tenants refused to pay the latest increase in rents and staged mass demonstrations against evictions, resulting in violent confrontations. With the start of the First World War local young men left Glasgow to serve in the army overseas, and the first violent protest in the Govan district took place in April to resist the eviction of a soldier's family. As evictions were repeatedly attempted with support from the police, women attacked the factors and the sheriffs' men."]}, {"page": "Rent strike", "response": ["During the Irish Land War of the 1880s and during World War I when the landlords of tenement buildings in Glasgow sought to take advantage of the influx of shipbuilders coming into the city and the absence of many local men to raise rents on the tenements' remaining residents. These women left behind were seen as an easy target and were faced with a rent increase of up to 25% and would be forcibly evicted by bailiffs if they failed to pay. As a result of this rent increase, there was a popular backlash against the landlords and a rent strike was initiated. This was led by Mary Barbour, Mary Burns Laird, Helen Crawfurd, Agnes Dollan, and other women who were dubbed 'Mrs. Barbour's Army'. During rent strikes, women would forcibly prevent the bailiffs from entering the tenements to deliver eviction notices by pelting them with flour bombs, pulling down their trousers, or throwing them into the 'midden' (trash) in the back court of tenement buildings. The strikes soon spread and became an overwhelming success, moving out from Glasgow and on to other cities throughout the UK, that the government, on 27 November 1915, introduced legislation to restrict rents to the pre-war level."]}, {"page": "List of suffragists and suffragettes", "response": ["* Helen Crawfurd (1877–1954) – suffragette, rent strike organiser and communist activist"]}, {"page": "J. T. Murphy", "response": ["In January 1920 Murphy travelled illegally to Soviet Russia, where he attended with John S. Clarke, Helen Crawfurd, Williie Gallacher, Wlliam McLaine, Sylvia Pankhurst, Marjory Newbold, Tom Quelch, Dave Ramsay and Jack Tanner at the 2nd World Congress of the Comintern as delegate for the Shop Stewards Movement. Murphy also was a delegate to the First World Congress of the Red International of Labor Unions (RILU) in July 1921, which elected him a member of the organisation's Executive Committee."]}, {"page": "Shapurji Saklatvala", "response": ["The Bolshevik Revolution in Russia of November 1917 was an inspiration to Saklatvala, and following the establishment of the Communist International in 1919, he became active in attempting to affiliate the ILP with that new organisation. Saklatvala joined with Emile Burns, R. Palme Dutt, J. Walton Newbold, Helen Crawfurd, and others as part of an organised faction called the Left Wing Group of the ILP which was dedicated to this effort.James Klugmann, History of the Communist Party of Great Britain: Volume One: Formation and Early Years, 1919–1924. London: Lawrence and Wishart, 1968; p. 26. When the affiliation drive by Saklatvala and the ILP's left wing ended in failure in the party's March 1921 national conference, Saklatvala left the organisation with the others in the Left Wing Group to join the new Communist Party of Great Britain (CPGB)."]}, {"page": "Mary Barbour", "response": ["Barbour first became politically active, joining and becoming an active member of the Kinning Park Co-operative Guild. Barbour's political activism began in earnest in leading the South Govan Women's Housing Association during the Glasgow rent strikes of 1915, when she actively organised tenant committees and eviction resistance. The protestors became known as \"Mrs Barbour's Army\", and included Agnes Dollan, Helen Crawfurd, Mary Laird, and Mary Jeff.", "Barbour was a founder of the Women's Peace Crusade (WPC) at the \"Great Women's Peace Conference\" in June 1916, with Helen Crawfurd and Agnes Dollan. These women also worked with Agnes Harben and others across Britain.", "Helen Crawfurd in her unpublished memoir recounts how during the rent-strike factors would try to collect the rental increases by resorting to the blackmail of social humiliation. The ploy was to dupe individual household tenants into believing that everyone else in the close had paid up. Upon one of these occasions Barbour drafted in men from Govan's shipyards, led them to the factor's office and demanded the amount of the increase be returned. 'Faced with thousands of black-faced workers the factor handed over the money' Crawfurd recalls."]}, {"page": "List of delegates of the 2nd Comintern congress", "response": ["**Helen Crawfurd"]}, {"page": "Charlotte Despard", "response": ["In 1919, she was one of twenty British delegates to the Women's International League Congress in Zurich (12–17 May). She is pictured next to Helen Crawfurd from Glasgow.  She kept in communication with other suffragists, such as Daisy Solomon."]}, {"page": "Women's Peace Council", "response": ["Helen Crawfurd: Member of the Women's Peace Council and one of the organizers of the Glasgow branch of the Women's International League in 1915. She was also one of the organizers for the Women's Peace Crusade in 1916. In 1920 she was one of the founders of the Communist Party of Great Britain, and in 1927 she helped establish the League Against Imperialism."]}, {"page": "Duke Street Prison", "response": ["Helen Crawfurd Anderson was imprisoned in Duke Street Prison in March 1914 after breaking two windows of the Army Recruiting Office in Gallowgate, as a protest against the arrest two days previously of Mrs Pankhurst. Helen was sentenced to ten days in prison but went on hunger strike and was released after eight days under the Prisoners (Temporary Discharge for Ill Health) Act 1913.  She was then rearrested and returned to prison, but again released, in a very weak physical condition, after a second hunger strike. Members of the Women's Social and Political Union gathered at the prison gates and were noted as picketing the prison day and night during her incarceration. On March 16, 1914, suffragette Jean Lambie attacked Dr James Devon, Prison Commissioner, as he entered the prison, striking him in the face with a horsewhip. She then delivered an address on force-feeding to the crowd outside the prison."]}, {"page": "Clyde Workers' Committee", "response": ["The initial demands for higher pay were largely successful,William Knox, James Maxton, p.20 and the committee took up the matter of high rents - an influx of workers to staff the factories producing war materials had pushed up rents.Ian F. W. Beckett, The Making of the First World War  Opposition to this was led by a group of working-class women, including Mary Barbour, Mary Burns Laird, Helen Crawfurd, Agnes Dollan and Mary Jeff, and culminated in a rent strike of 25,000 tenants by October 1915.Jill Liddington, The Road to Greenham Common: Feminism and Anti-militarism in Britain Since 1820, p.114  The committee threatened to call a general strike on the matter, and the government responded by introducing the national Rent Restriction Act.L. J. Macfarlane, The British Communist Party, p.41"]}, {"page": "Jack Tanner (trade unionist)", "response": ["During World War I, Tanner worked as an engineer in France and was active in the then-syndicalist Confédération Générale du Travail. He returned to London in 1917 and became active in the Shop Stewards' Movement, and in 1920 along with others such as John S. Clarke, Helen Crawfurd, Williie Gallacher, Wlliam McLaine, JT Murphy, Sylvia Pankhurst, Tom Quelch, Dave Ramsay and Marjory Newbold, attended the Second Congress of the Communist International. He did join the Communist Party of Great Britain but left after only eight months, though he remained close to colleagues who stayed in the party."]}]}}