{"wiki_id": "http://www.wikidata.org/entity/Q18737087", "itemLabel": "Keith Lawrence", "itemDescription": "Footballer (born 1954)", "wikipedia_url": "https://en.wikipedia.org/wiki/Keith_Lawrence_(footballer)", "wikipedia_page": {"main": "Keith Derek Lawrence (born 25 March 1954) is an English retired professional football central defender who played in the Football League for Brentford.\n\n", "link_mentions": [{"page": "West London derby", "response": ["* Keith Lawrence – first Chelsea, then Brentford."]}, {"page": "Keith Lawrence", "response": ["Keith Lawrence may refer to:", "* Keith Lawrence (RAF officer) (1919–2016), Royal Air Force officer", "* Keith Lawrence (politician) (1891–1978), Democratic politician from Ohio", "* Keith Lawrence (rugby), in 1987 Rugby World Cup", "* Keith Lawrence (footballer) (born 1954), English football centre back"]}, {"page": "1974–75 Brentford F.C. season", "response": ["Off the back of Brentford's lowest finish in the Football League since the 1925–26 season, only three players were signed – defender Keith Lawrence on a permanent deal from Chelsea, goalkeeper Steve Sherwood on a season-long loan from Chelsea and Wimbledon midfield trialist Graham Smith. Two long-serving players were released, winger John Docherty and full back Alan Hawley.White, p. 295-297. New chairman Les Davey announced that the club would move to a new stadium in West London and that there was talk of a £1,000,000 takeover bid by local firm Brentford Nylons, but nothing came of either plan.", "|Keith Lawrence", "| style=\"text-align:left;\" |Keith Lawrence", "| style=\"text-align:left;\" |Keith Lawrence", "| Keith Lawrence"]}, {"page": "1975–76 Brentford F.C. season", "response": ["|Keith Lawrence", "| style=\"text-align:left;\" |Keith Lawrence", "| style=\"text-align:left;\" |Keith Lawrence", "| Keith Lawrence"]}, {"page": "1976–77 Brentford F.C. season", "response": ["After Brentford's lowest-ever finish in the Fourth Division at the end of the previous season, manager John Docherty released defenders Alan Nelmes and Keith Lawrence and replaced them with John Fraser and Bobby Goldthorpe respectively.White, p. 301-304. Also arriving at Griffin Park were defender Keith Pritchett and midfielder Steve Aylott, while teenagers Danis Salman, Gary Rolph, Graham Cox and Paul Walker all signed apprentice professional contracts. A catalogue of injuries to Fraser, Aylott, Riddick, Sweetzer, McCulloch, Allen and Johnson and a failure to win any of the first six games of the season led to manager Docherty quitting the club, after failing to win a vote of confidence from chairman Dan Tana. Physiotherapist Eddie Lyons was put in caretaker charge of the team for one match before Bill Dodgin Jr. was appointed manager on 16 September 1976, who followed in his father's footsteps by taking over the role."]}]}}