{"wiki_id": "http://www.wikidata.org/entity/Q18735376", "itemLabel": "Thomas Onwhyn", "itemDescription": "English illustrator", "wikipedia_url": "https://en.wikipedia.org/wiki/Thomas_Onwhyn", "wikipedia_page": {"main": "Thomas Onwhyn (c.1811 – 21 January 1886) was an English artist, illustrator, engraver, satirist, and cartoonist. He also published an illustrated pirate edition of The Pickwick Papers in 1837 under the pen-name of \"Samuel Weller\", after Dicken's character in the book. He may have also used other pseudonyms including Peter Paul Palette. He also published tourist guides to various parts of England and Wales.\n\nThomas was born in Clarkenwell where his father Joseph was a bookseller, printer, publisher, and newsagent on Catherine Street, Strand, while his mother Fanny was an accomplished artist who drew portraits of stage actors of the period although as an artist she was often credited as \"Mr F. Onwhyn\". The Lancet was in its early years published by Joseph Onwhyn. The date of birth of Thomas is unknown and the year of birth varies across sources with some giving it as 1813 or 1814 and there is no documented record other than his death certificate in which the age indicated would suggest that he was born in 1811. He was the oldest of several siblings. Thomas trained as an artist, illustrator and engraver and was active from 1836 to 1861. His younger brother Frederick died in a lunatic asylum at Stoke Newington on 31 May 1867 and some biographies confound this to state that Joseph \"suffered a mental breakdown after taking on the publication of the satirical magazine The Owl\".\n\nOnwhyn contributed to a number of publications including The Age, Bell’s Life in London and Sporting Chronicle, The Penny Satirist, The Satirist, or, The Censor of the Times, and The English Gentleman. He also contributed to The Punch where some of his illustrations carry the initials O.T. or T.O.Onwhyn illustrated an edition of the Pickwick Papers under the pseudonym Samuel Weller. He also illustrated an edition from Grattan of Nicholas Nickleby (1839) which Dickens referred to in a letter of 13 July 1838 commenting on ‘the singular Vileness of the Illustrations’ (Letters of Charles Dickens, 1.414).Onwhyn married Marian in 1866 and they had sons Thomas and Herbert.\n\n", "link_mentions": [{"page": "Aesop's Fables", "response": ["While musical settings of La Fontaine's Fables began appearing in France within a few decades of their publication, it was not until the 19th century that composers began to take their inspiration directly from Aesop. One of the earliest was Charles Valentin Alkan's Le festin d'Ésope (\"Aesop's Feast\", 1857), a set of piano variations in which each is said to depict a different animal or scene from Aesop's fables. In Victorian England there were several piano arrangements of fables versified (with no particular skill) by their composers. 1847 saw the anonymous Selection of Aesop's Fables Versified and Set to Music with Symphonies and Accompaniments for the Piano Forte, which contained 28 fables.Joachim Draheim, Vertonungen antiker Texte vom Barock bis zur Gegenwart, Amsterdam 1981, Bibliography, p. 111 It was followed in that same year by Olivia Buckley Dussek's selection, illustrated by Thomas Onwhyn.Bell’s Life in London and Sporting Chronicle, 21 March 1847 p3, reproduced in \"Thomas Onwhyn: a Life in Illustration\", Plymouth University, p.64 Twelve were also set by W. Langton Williams (c.1832-1896) in his Aesop’s Fables, versified & arranged for the piano forte (London, 1870s),PDF in Toronto Public Library the jocular wording of which was strongly deprecated by The Musical Times.The Musical Times, 1 December 1879, p.659"]}, {"page": "Henry Cockton", "response": ["In 1839 Henry Cockton commenced writing The Life and Adventures of Valentine Vox the Ventriloquist. Published by Robert Tyas of London, in the monthly serial format, popularised by Charles Dickens, it was an immediate success, enjoying great popularity and acclaim.  Illustrations by Thomas Onwhyn were a prominent feature of this, and most of Henry Cockton's later novels. The first three chapters are set 'in one of the most ancient and populous boroughs in the county of Suffolk', a thinly disguised Bury St. Edmunds. Valentine Vox teaches himself ventriloquism after seeing a performer in a local tavern, then uses his skills to create mayhem and mischief.  Fearing this will lead him into trouble, his family send him to stay with his uncle Grimwood Goodman in London. This provides unlimited opportunities to perform pranks, such as disrupting political meetings, theatrical performances, educational lectures and social events. Valentine develops a close friendship with Grimwood. Fearing that Grimwood will re-write his will in Valentine's favour, unscrupulous relatives have Grimwood confined in a private lunatic asylum, where he undergoes many horrific experiences. Eventually Valentine finds Grimwood, and liberates him, not by using ventriloquism, but by paying for his release. At the novel's conclusion, Valentine marries the love interest, Louise Raven, and abandons ventriloquism. Valentine's activities as a ventriloquist are quite incredible, showing an impossible, almost super-human level of ability: by the end of the book he has duped literally hundreds of people from all walks of life in all situations, not one of whom ever suspects him. Yet the novel contains no technical information about ventriloquism, and it is doubtful if the author had any practical knowledge of the subject. The completed work contained a preface by Henry Cockton, outlining the scandal of private lunatic asylums. As with Charles Dickens in Oliver Twist and Nicholas Nickleby, he clearly intended to draw attention to a social issue about which he felt strongly.John Sutherland, The Longman Companion to Victorian Fiction (1988) 648; Steven Connor, Dumbstruck, a Cultural History of Ventriloquism (2000) 316-23; Halliday (2017) 4–7."]}]}}