{"wiki_id": "http://www.wikidata.org/entity/Q18753443", "itemLabel": "C. H. Collins Baker", "itemDescription": "English art historian and painter", "wikipedia_url": "https://en.wikipedia.org/wiki/C._H._Collins_Baker", "wikipedia_page": {"main": "Charles Henry Collins Baker  (24 January 1880 – 3 July 1959) was an English art historian and painter.", "link_mentions": [{"page": "Kenneth Clark", "response": ["At about the same time as accepting MacDonald's offer of the directorship, Clark had declined one from King George V's officials to succeed C. H. Collins Baker as Surveyor of the King's Pictures. He felt that he could not do justice to the post in tandem with his new duties at the gallery. The king, determined to succeed where his staff had failed, went with Queen Mary to the National Gallery and persuaded Clark to change his mind.Stourton, pp. 1–2 The appointment was announced in The London Gazette in July 1934;\"Surveyor of the King's Pictures\", The Times, 4 July 1934, p. 14 Clark held the post for the next ten years.\"The King's Pictures\", The Times, 28 April 1945, p. 4"]}, {"page": "Ernest Waterlow", "response": ["*C. H. Collins Baker, Sir E. A. Waterlow, R.A., P.R.W.S. (London: Art Journal Office, 1906)."]}, {"page": "Surveyor of the Queen's Pictures", "response": ["*C. H. Collins Baker  1928–1934"]}, {"page": "Charles Holmes", "response": ["*The Making of the National Gallery, 1824–1924. An historical sketch, 1924 (together with C. H. Collins Baker)"]}, {"page": "Cornelius Johnson (artist)", "response": ["His early works (for example the 1620 portrait of Sir Alexander Temple) were described by C. H. Collins Baker as \"flat wooden and inanimate\".Burlington Magazine review of volume 10 of the Walpole Society Vol. 42, No. 241 (Apr., 1923), p. 203 Within a year, he has made \"an astonishing advance\" and his modelling becomes full and \"his temper established\". His earliest three-quarter length work is a pair of portraits of Thomas Boothby and his wife painted in 1619 and sold by the Weiss Gallery in 1988.Numbers 123 and 124 in Weiss Gallery's 25th Anniversary publication Another three-quarter length portrait (of Lord Keeper Coventry) is dated 1623, and shows a certain lack of skill in dealing with the body, which is overcome in later works.Waterhouse, 61"]}, {"page": "William Blake's illustrations of On the Morning of Christ's Nativity", "response": ["The illustrations themselves do not make the dating any easier- the edges of the \"Thomas set\" were trimmed before sale at Sotheby's, leaving \"18\" or \"180\" on most of the sheets.Butlin 390 Only The Night of Peace bears the full date of 1809. The Butts set is entirely undated- dates from 1803 to 1817 have been proposed for it.Werner 117 Behrendt argues that the Butts set predates the Thomas set by six years,Behrendt, Stephen C. Blake's Illustrations to Milton's Nativity Ode, in Philological Quarterly, LV, Winter 1976, pp. 65-95. Quoted in Butlin, 390 and Collins Baker and R.R. Wark place it in 1809, but earlier than the Thomas set.C. H. Collins Baker, enlarged and revised by R.R. Wark, Catalogue of William Blake's Drawings and Paintings in the Huntington Library. First published 1938. Quoted in Butlin, 390"]}, {"page": "James Moore (furniture designer)", "response": ["Early references to Moore are in the Duke of Montagu's domestic expenses, 1708,There is furniture by Moore at Boughton House, Northamptonshire, including a table bearing the cypher and coronet of Ralph Montagu as earl, therefore dating before 1705. and the entry in the accounts of Lord Hervey, soon created Earl of Bristol, for \"glass piers & sconces\", 1710. Moore and his son, James Moore the younger, were among craftsmen furnishing Cannons for James Brydges, 1st Duke of ChandosC. H. Collins Baker and M. Baker, The Life and Times of James Brydges, First Duke of Chandos, 1949:197. A gilt gesso table from Stowe House, now at the Victoria and Albert is in the unmistakable style of James Moore; it bears the cypher and baron's coronet of Richard Temple, Lord Cobham, and can be dated 1714–18 on that basis.Temple was created a baron in 1714 and raised to a viscount in 1718 (noted by Edwards and Jourdain 1955:43)."]}, {"page": "Capel family", "response": ["It was bought from Leggatt Brothers in 1970 for £28,350, £3,000 of which was contributed by ArtFund. The provenance was given as Cassiobury, the family home of the earls of Essex.ArtFund C. H. Collins Baker notes that it was at Cassiobury in 1912."]}]}}