{"wiki_id": "http://www.wikidata.org/entity/Q18753675", "itemLabel": "Cliff Myers", "itemDescription": "English footballer (1946-2019)", "wikipedia_url": "https://en.wikipedia.org/wiki/Cliff_Myers", "wikipedia_page": {"main": "Clifford William Myers (23 September 1946 – 8 February 2019) was an English professional footballer who played in the Football League for Torquay United, Charlton Athletic and Brentford as a utility player. He went on to have a long career in non-League football and is regarded as a cult hero amongst the supporters of Yeovil Town, for whom he made 329 appearances.", "link_mentions": [{"page": "Salisbury City F.C.", "response": ["* Cliff Myers"]}, {"page": "Minehead A.F.C.", "response": ["* Cliff Myers"]}, {"page": "List of Torquay United F.C. seasons", "response": ["|align=left|Cliff Myers||8"]}, {"page": "1967–68 Brentford F.C. season", "response": ["The positive outcome of the events of 19 January 1967 meant that Brentford would stay in business long enough to compete in the 1967–68 Fourth Division season. A syndicate headed by Ron Blindell had taken over the shares of former chairman Jack Dunnett and assumed control of the club, with Blindell as chairman. With a £100,000 debt (equivalent to £ in ) needing to be paid by 30 June 1968, drastic cost-cutting measures were enacted at Griffin Park. Brentford's reserve and youth teams were scrapped and a mass clear-out of the squad led to just 16 professionals being retained. Having been installed in the role full-time, manager Jimmy Sirrel was permitted to sign a small number of players, including Chelsea youth product Alan Nelmes and Charlton Athletic's inside forward Cliff Myers.", "Injuries to John Richardson and George Thomson prior to the opening match of the season left Brentford with just 15 fit players and a lack of personnel would be a running saga during the campaign. Regular goals from John Docherty and Ian Lawther in the early months of the season helped Brentford tread water in mid-table and then slowly rise towards the promotion places, coming as high as 6th place by early December 1967. Hopes of money-raising runs in the FA Cup and League Cup were extinguished with first round defeats in each competition, but chairman Blindell had revealed the positive news in November that the club was more or less breaking even. 9 defeats and just one victory in a 12-match spell between December 1967 and February 1968 undid all the good early-season work and dropped the Bees back into mid-table. Manager Sirrel was permitted to spend £12,000 on attackers Ron Fenton and Allan Mansley in January 1968, but was forced to sell Cliff Myers and top-scorer John Docherty to balance the books.", "|Cliff Myers", "| style=\"text-align:left;\" |Cliff Myers", "| style=\"text-align:left;\" |Cliff Myers", "| Cliff Myers", "| Cliff Myers"]}, {"page": "2018–19 in English football", "response": ["* 8 February 2019: Cliff Myers, 72, Charlton Athletic, Brentford and Torquay United utility player."]}, {"page": "2019 in the United Kingdom", "response": ["**Cliff Myers, 72, English footballer (Charlton Athletic, Yeovil Town, Torquay United)."]}, {"page": "Deaths in February 2019", "response": ["*Cliff Myers, 72, English footballer (Charlton Athletic, Yeovil Town, Torquay United).Star of the 60s and 70s passes away"]}]}}