{"wiki_id": "http://www.wikidata.org/entity/Q18737261", "itemLabel": "Robin Whetherly", "itemDescription": "English cricketer (1916-1943)", "wikipedia_url": "https://en.wikipedia.org/wiki/Robin_Whetherly", "wikipedia_page": {"main": "Robin Evelyn Whetherly MC (23 July 1916 – 27 November 1943) was an English first-class cricketer and soldier who died in action in World War II.\nThe son of Lieutenant Colonel William Stobart Whetherly, a decorated veteran of the Boer War and World War I, Whetherly was educated at Harrow School, where he kept wicket for the first XI in his final year, 1935, before going up to Magdalen College, Oxford, to read history.He played several matches as a wicket-keeper for Oxford University in 1937 and 1938, but was overlooked for the annual match against Cambridge University in favour of Michael Matthews in 1937 and Roger Kimpton in 1938. He usually batted in the lower order, his only innings of more than 22 coming in the match against Marylebone Cricket Club (MCC) at Lord's in 1937 when he batted at number four and made 63, adding 132 for the third wicket with Mandy Mitchell-Innes.After working for a travel agency, he accepted a commission in the 1st King's Dragoon Guards on the outbreak of World War II. He served in Libya, where in April 1941 his regiment was attacked by the Afrika Korps. For his actions during the battle, in which he saved many of his men from capture, he was awarded the Military Cross. He continued to serve in North Africa until 1943, when he joined the Special Operations Executive, and parachuted into Yugoslavia to serve as part of Macmis under Fitzroy Maclean, in assisting the Yugoslav Partisans. He died at Glamoc Airfield near Glamoč in November 1943 while on a Dornier Do 17 piloted by Croatian Air Force defectors. The plane was strafed with bombs and machine-guns by a Heinkel He 46, and Whetherly was killed by a bomb strike that hit while he and others were climbing out of the Dornier.\n\n", "link_mentions": [{"page": "Eastern Approaches", "response": ["Officers and soldiers under Maclean's command included Peter Moore of the Royal Engineers; Mike Parker, Deputy Assistant Quartermaster general; Gordon Alston; John Henniker-Major, a career diplomat; Donald Knight, and Robin Whetherly."]}, {"page": "List of Old Harrovians", "response": ["*Robin Whetherly (1916–1943), English first-class cricketer killed in World War IIWisden Cricketer's Almanack 1944, \"Obituaries during the war, 1943\""]}, {"page": "Maurice Jewell", "response": ["Jewell captained a team of amateur cricketers (some of whom had once played first-class cricket) under the name the Gentlemen of Worcestershire. This team included Peter Huntington-Whiteley and Robin Whetherly. They were ordered not to lose by the MCC because of the growing tensions between the UK and Nazi Germany. The Gentlemen of Worcestershire won all three matches comfortably. "]}, {"page": "Yugoslavia and the Allies", "response": ["Robin Whetherly"]}, {"page": "Michael England", "response": ["Born at Midgham, Berkshire, England, was educated at Eton College, where he was in the Eton XI in 1936 and 1937.  It was in 1936 that he made his debut for Berkshire in the Minor Counties Championship against Hertfordshire, though his schooling commitments limited him to one appearance each in 1936 and 1937.  He later attended Magdalen College, Oxford, while studying there he made his first-class debut for Oxford University Cricket Club against Leicestershire in 1938.  In this match, he scored 11 runs in Oxford University's first-innings, before being dismissed by William Flamson, while in their second-innings he wasn't required to bat.  In Leicestershire's first-innings, he took 2 catches behind the stumps, with the match ending in a draw.  He made a second first-class appearance for the university the following season against the Minor Counties.  He scored 5 runs in Oxford University's first-innings, before being dismissed by Francis Appleyard, while in their second-innings he scored 43 not out.  He also took a further two catches behind the stumps, with the match ending in a Minor Counties victory by 4 wickets.  His appearances in the team were limited due to the number of wicket-keepers that were used by Oxford University during this time, such as Robin Whetherly, Hector Jelf, Peter Blagg and Manning Clark."]}, {"page": "List of cricketers who were killed during military service", "response": ["|Robin Whetherly"]}, {"page": "Maclean Mission", "response": ["Thirty-two-year-old Maclean, a former diplomat realised that the mission would require professional soldiers, explosive, intelligence and supply experts as well as people with political experience.  Hence, he picked cavalry officer Robin Whetherly (27), SAS Major Vivian Street and John Henniker-Major (27) another soldier-diplomat to accompany him.  Later, they were joined by three sappers: Peter Moore, Donald Knight and Mike Parker who was to be in charge of supply logistics and Gordon Alston (25), an intelligence officer.  The security was assigned to Sgt Duncan, Cpl Dickson (Scots Guards) and Cpl Kelly (Seaforth Highlanders) and communication to two wireless operators.  Just before the departure, they were joined by an American Major Linn \"Slim\" Farish (41), who claimed that he could build aerodromes.  It was decided to leave two officers, David Satow and Sgt Charlie Button behind as rear-link and supply support.Maclean, pp. 294-298", "By the time they re-established full communications, a tragedy occurred.  Partisans had captured a small German aeroplane and were intending to fly out the delegation themselves.  They had informed Bari in order to warn the RAF and anti-aircraft batteries not to shoot at their small aeroplane with German markings and refuelled.  On 27 Nov 1943,Deakin, p. 253 at first light, as the passengers and those who had come to see them off had gathered around the aircraft, they had noticed a small German observation plane.  It flew quickly very low over their heads and dropped two small bombs.  One exploded near Robin Whetherly and killed him.  The other hit the aircraft, destroying it completely and killing Donald Knight and Ribar, and wounding Milojević.Maclean, pp. 397-398McConville, pp. 95-96"]}]}}