{"wiki_id": "http://www.wikidata.org/entity/Q18715993", "itemLabel": "William Brodribb", "itemDescription": "Australian pastoralist and politician", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Adams_Brodribb", "wikipedia_page": {"main": "William Adams Brodribb (27 May 1809 – 31 May 1886) was an Australian pastoralist and politician.He was born in London on 27 May 1809.  His father, also William Adams Brodribb, was an attorney who was convicted of administering unlawful oaths in 1816 and transported for seven years. He arrived at Sydney in Sir William Bensley in March 1817, and was sent to Hobart. In February 1818 his wife and children arrived at Hobart in Duke of Wellington. They settled on a farm near New Norfolk and three more sons were born.\nIn April 1835 William junior moved to New South Wales and became a partner in a cattle station. In 1836 he overlanded the second draft of cattle to Melbourne.  On returning from Port Phillip Brodribb relocated to what later became the site of Gundagai.  In August Brodribb  petitioned for a punt over the Murrumbidgee near his Gundagai hut and in January 1838 Deputy Surveyor General Samuel Perry reported that 'a better site could not have been chosen for a Town of the first class' in reference to Gundagai. In 1841, following Strzelecki, he formed an expedition to Gippsland which named Port Albert, the Latrobe River, the Albert River and explored inland.\nIn 1843 he became manager of the Monaro runs of William Bradley. For the next twelve years he lived on Coolringdon station near Cooma.  In 1855 he settled on the Wanganella run, near Deniliquin.  He owned a series of properties in western New South Wales until retiring to Sydney in 1879.\nAt the 1859 election he was a candidate for the seat Balranald in the New South Wales Legislative Assembly, but was unsuccessful. In July 1861 Brodribb won the seat of Brighton in the Victorian Legislative Assembly, but resigned the following year. His brother Kenric was also a member of the Victorian Legislative Assembly, representing St Kilda from 1861 to 1864. He made a further attempt for a seat in the NSW Legislative Assembly at the  1864-65 election for Monara, but was unsuccessful.He was elected to the New South Wales Legislative Assembly at the November 1880 election for the seat of Wentworth, but he served for barely a year before he resigned to accept appointment to the Legislative Council in December 1881, where he remained until his death.Brodribb published an autobiography in 1883.He died in Sydney on 31 May 1886 (aged 77) and was buried with his family in St Andrew's Graveyard, Brighton, Victoria.\n\n", "link_mentions": [{"page": "Traralgon", "response": ["In June 1840, a party consisting of Tarra, Riley, John Rutledge and Shoalhaven Indigenous man John Pigeon went on a second expedition to retrieve the lost horses and managed to retrieved one, by travelling through the mountains of West Gippsland, across a path that would roughly trace the present-day Princes Highway. A third expedition was made from Port Albert to Latrobe Valley in March 1841 that included William Brodribb, Alexander Kinghorne, Norman McLeod and Kirsopp with Tarra as their guide. In June 1841, a fourth expedition was made along the same route by William's brother Albert Brodribb, pastoralist Edward Hobson, Dr Edward Barker and four Boon wurrung men."]}, {"page": "Electoral district of Brighton", "response": ["| William Brodribb"]}, {"page": "Electoral district of Wentworth", "response": ["| William Brodribb"]}, {"page": "Members of the New South Wales Legislative Assembly, 1880–1882", "response": ["| Brodribb, WilliamWilliam Brodribb "]}, {"page": "List of New South Wales state by-elections", "response": ["||Wentworth||William Brodribb|| Appointed to the Legislative Council|| 23 January 1882 || Edward Quin"]}, {"page": "List of Victorian state by-elections", "response": ["|William Brodribb"]}, {"page": "Electoral results for the district of Brighton", "response": ["| William Brodribb"]}, {"page": "Candidates of the 1880 New South Wales colonial election", "response": ["|Wentworth || |William Brodribb || "]}, {"page": "Candidates of the 1864–65 New South Wales colonial election", "response": ["|Monaro || |James Martin || William Brodribb  William Grahame"]}, {"page": "Candidates of the 1859 New South Wales colonial election", "response": ["|Balranald || |Augustus Morris || William Brodribb"]}, {"page": "January 1882 East Macquarie colonial by-election", "response": ["Webb, William Brodribb, John Sutherland and Samuel Terry were appointed to the Legislative Council at the same time, and the by-elections for Mudgee, Redfern and Wentworth were held between 11 and 23 January."]}, {"page": "Electoral results for the district of Wentworth", "response": ["| William Brodribb"]}, {"page": "1882 Wentworth colonial by-election", "response": ["A by-election was held for the New South Wales Legislative Assembly electorate of Wentworth on 23 January 1882 because of the resignation of William Brodribb to accept an appointment to the Legislative Council.", "| William Brodribb resigned, and summoned to the Legislative Council. ", "William Brodribb resigned to accept an appointment to the Legislative Council."]}]}}