{"wiki_id": "http://www.wikidata.org/entity/Q18748706", "itemLabel": "Tony Mahoney", "itemDescription": "Footballer (born 1959)", "wikipedia_url": "https://en.wikipedia.org/wiki/Tony_Mahoney", "wikipedia_page": {"main": "Anthony Joseph Mahoney (born 29 September 1959) is an English retired professional footballer who played in the Football League for Fulham, Brentford and Crystal Palace as a forward. He later forged a career in non-League football and played a decade with Canvey Island. Mahoney is the tenth-youngest-ever Fulham debutant.", "link_mentions": [{"page": "West London derby", "response": ["* Tony Mahoney – first Fulham, then Brentford."]}, {"page": "Keith Cassells", "response": ["Cassells dropped back down to the Third Division to join Brentford for a £25,000 fee in February 1983. Signed as a replacement for the injured Tony Mahoney, over the following  seasons he proved himself to be \"a powerful-running frontman\" and \"a consistent, if unspectacular goalscorer\". A switch to the right wing during the 1984–85 season saw Cassells finish the season as the team's leading league goalscorer (12) and the team's joint-leading goalscorer (18, with Gary Roberts). He also helped the team to the 1985 Football League Trophy Final and the match proved to be his final Brentford appearance. After rejecting a new contract, Cassells departed Griffin Park in August 1985 and finished his Bees career with 102 appearances and 28 goals."]}, {"page": "Kevin Lock", "response": ["On Saturday 21 February 1981, Lock was the best man at Fulham teammate Tony Mahoney's wedding in Grays and the pair played for Fulham later that day. After leaving football in 1998, Lock entered the pub trade."]}, {"page": "Mahoney", "response": ["*Tony Mahoney (1959– ), English professional football striker"]}, {"page": "Fred Callaghan", "response": ["Callaghan would go on to manage Brentford for three-and-a-half seasons and presided over an overhaul of the squad and coaching structure at Griffin Park. The 1980–81 season saw the arrival of player/assistant manager Ron Harris, a re-formation of the youth setup and the arrivals of Terry Hurlock, David Crown and Gary Roberts. Callaghan added Stan Bowles and Chris Kamara to the midfield during the 1981–82 season and forwards Francis Joseph and Tony Mahoney in 1982–83, but the team's form went into decline during the 1983–84 season and he was sacked in February 1984. Callaghan's three seasons as permanent manager resulted in 9th, 8th and 9th-place finishes respectively in the Third Division."]}, {"page": "List of Brentford F.C. records and statistics", "response": ["** 1982–83, Third Division (Francis Joseph, Gary Roberts, Tony Mahoney)"]}, {"page": "1982–83 Brentford F.C. season", "response": ["After many failed attempts, Brentford manager Fred Callaghan finally signed what would prove to be a potent strike partnership during the 1982 off-season – Francis Joseph from Wimbledon and Tony Mahoney from Fulham.White, p. 318-320. Goalkeeper David McKellar's contract was terminated after a serious breach of club discipline and he was replaced by former Chelsea goalkeeper Petar Borota, though Barota would only appear in three Football League Group Cup fixtures before being in turn replaced by Paddy Roche. The defensive ranks were cleared out, with Pat Kruse, Mark Hill, Robbie Johnson, Paul Shrubb and Kevin Teer all released.Croxford, Lane & Waterman, p. 65. Experienced former Chelsea defender Graham Wilkins arrived on a free transfer.", "Brentford had a busy first half of the season, reaching the fourth round of the League Cup for the first time in club history, knocking out higher-division clubs Blackburn Rovers and Swansea City in the second and third rounds before falling to First Division club Nottingham Forest at the City Ground. The Bees advanced to the second round of the FA Cup before suffering a disappointing replay defeat to Fourth Division club Swindon Town. Forward Tony Mahoney, who had up until that point scored 15 goals in 28 appearances, broke his leg in three places during the defeat.", "Despite heavy scoring from forwards Francis Joseph, Tony Mahoney and winger Gary Roberts during the first half of the season, Brentford's league form was patchy and 10 defeats from 14 matches between late December 1982 and early March 1983 ultimately killed hopes of a promotion challenge. Manager Fred Callaghan signed Southampton forward Keith Cassells in a bid to replace Tony Mahoney's goals and while there was an upturn in form during the final two months of the season, Brentford could finish no higher than 9th. The Bees finished the season with the best overall and best away attacking record in the Third Division.", "* Three goalscorers with 10 or more goals by Christmas Day (all competitions): Francis Joseph, Gary Roberts, Tony Mahoney", "|Tony Mahoney", "| style=\"text-align:left;\" |Tony Mahoney", "| style=\"text-align:left;\" |Tony Mahoney", "| Tony Mahoney"]}, {"page": "1983–84 Brentford F.C. season", "response": ["After two seasons in which, were not for bad mid-season form, strong run-ins may have yielded a promotion challenge, Brentford manager Fred Callaghan kept his squad together. Save for the retirement of key midfielder Stan Bowles, his replacement with Terry Bullivant was the only significant piece of transfer activity at Griffin Park during the 1983 off-season.White, p. 321-323. Goalkeeper Trevor Swinburne arrived to provide competition for Paddy Roche and with forward Tony Mahoney still not fully fit after recovering from a broken leg, Bill Garner was brought in from non-league football on non-contract terms.", "Assistant Frank Blunstone took caretaker charge of the team for one match before the appointment of former Leicester City manager Frank McLintock on 9 February, who installed former Brentford player John Docherty as his assistant. McLintock took over a club in 21st position with 20 matches to play and conducted an overhaul of the playing staff, selling centre back Alan Whitehead and bringing in right back Bobby Fisher midfielder Tommy Finney from Cambridge United, plus Nigel Gray and Bill Roffey on loan. Attacker Bob Booker was recalled to the starting lineup, Ian Bolton and Tony Mahoney were dropped, Terry Bullivant and Graham Wilkins departed on loan and Stan Bowles retired for a second time.", "|Tony Mahoney", "| style=\"text-align:left;\" |Tony Mahoney", "| style=\"text-align:left;\" |Tony Mahoney", "| Tony Mahoney"]}, {"page": "1984–85 Brentford F.C. season", "response": ["Frank McLintock began his preparations for his first full season as Brentford manager by trimming his squad, releasing goalkeeper Paddy Roche, defenders Jim McNichol, Ian Bolton, Graham Wilkins and forward Tony Mahoney.White, p. 324-326. His only significant signings were left back Jamie Murray from Cambridge United for £27,500 and centre back Steve Wignall from Colchester United for a £18,000 fee."]}]}}