{"wiki_id": "http://www.wikidata.org/entity/Q18762133", "itemLabel": "William Pym", "itemDescription": "British military surgeon", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Pym", "wikipedia_page": {"main": "Sir William Pym, KCH (1772 – 18 March 1861) was a British military surgeon.", "link_mentions": [{"page": "Samuel Pym", "response": ["Sir Samuel Pym KCB (1778–1855) was a British admiral, brother of Sir William Pym."]}, {"page": "Colin Chisholm (medical writer)", "response": ["*An Essay on the Malignant Pestilential Fever introduced into the West India Islands from Boulam, on the coast of Guinea, as it appeared in 1793 and 1794, London, 1795 (second edition, much enlarged, 2 vols. London, 1801). This work on \"pestilential fever\" (a generic term—the disease is now recognised as yellow fever) was based on Chisholm's experiences on Grenada in 1793. A ship, the Hankey, arrived carrying infectious disease presumed to be from Bolama, in what is now Guinea-Bissau. Chisholm gave an account, designed to identify the cause of disease in Grenada as contagion. The theory of contagious disease being contentious, there was criticism, and the second edition amplified the argument with the example of the American Yellow Fever Epidemic of 1793. Subsequently the term \"Bulam fever\" was applied to yellow fever, and William Pym wrote on it under that name in 1815."]}, {"page": "Contingent contagionism", "response": ["The Medico-chirurgical Review in 1824 wrote that it had \"always advocated\" the doctrine of contingent contagion in the case of yellow fever \"and indeed in most fevers\". Having mentioned William Pym (contagionist) and Edward Nathaniel Bancroft (anti-contagionist) as extremists, it went on to say (italics in the original)"]}, {"page": "List of Knights Commander of the Royal Guelphic Order", "response": ["|Sir William Pym"]}, {"page": "Sir William Pym", "response": ["#REDIRECT William Pym"]}, {"page": "Pym, William", "response": ["#redirectWilliam Pym"]}]}}