{"wiki_id": "http://www.wikidata.org/entity/Q18729981", "itemLabel": "Anna Lindsay", "itemDescription": "Scot (1845–1903), women's activist", "wikipedia_url": "https://en.wikipedia.org/wiki/Anna_Lindsay_(activist)", "wikipedia_page": {"main": "Anna Lindsay (née Dunlop; 24 June 1845 – 1 March 1903) was a Scottish women's activist. She was to be one of the founders of the Glasgow Association for the Higher Education of Women and her name was said to be synonymous with the women's movement in Scotland. She was the first chair of the Scottish Women's Liberal Federation.", "link_mentions": [{"page": "Anna Lindsay", "response": ["Anna Lindsay may refer to:", "* Anna Lindsay (activist) (1845–1903), Scottish women's activist"]}, {"page": "Anne Lindsay", "response": ["*Anna Lindsay (activist) (1845–1903), Scottish women's activist"]}, {"page": "Thomas Martin Lindsay", "response": ["Lindsay studied divinity at the University of Glasgow and then at the University of Edinburgh. In 1869 he entered the ministry of the Free Church of Scotland, and in 1872 was appointed Professor of Church History at the Free Church College, Glasgow. He was then living at \"Thornliebank\" on Ann Street in the Hillhead districtGlasgow Post Office Directory 1875 when he married Anna Dunlop. Anna Lindsay had just been a student in Edinburgh.", "Lindsay married Anna Dunlop. The Glasgow Association for the Higher Education of Women was started at the suggestion of Mrs Jean Campbell in 1868. Anna Lindsay was one of its founders. Lindsay's name was said to be synonymous with the women's movement in Scotland.K. D. Reynolds, ‘Lindsay, Anna (1845–1903)’, Oxford Dictionary of National Biography, Oxford University Press, 2004 accessed 14 Oct 2017 Their children included Alexander Lindsay, 1st Baron Lindsay of Birker, Professor of Moral Philosophy in the University of Glasgow, Master of Balliol College, and Vice-Chancellor of the University of Oxford.Lindsay, Alexander Dunlop, 1st Baron Lindsay of Birker, in Oxford Dictionary of National Biography at oxforddnb.com(subscription site), accessed 20 June 2013"]}]}}