{"wiki_id": "http://www.wikidata.org/entity/Q18720308", "itemLabel": "Shanika Warren-Markland", "itemDescription": "actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Shanika_Warren-Markland", "wikipedia_page": {"main": "Shanika Warren-Markland is a British actress. Markland is known for her roles in More Than Love and 4.3.2.1.", "link_mentions": [{"page": "Noel Clarke", "response": ["His next project, 4.3.2.1., a heist movie, was released on 2 June 2010, and starred Tamsin Egerton, Emma Roberts, Shanika Warren-Markland and Adam Deacon. The film was shot in London and New York. He played an uncredited role in 2012's Ghost Rider: Spirit of Vengeance as a priest. The scene was cut from the movie, but can be seen in the Deleted Scenes in the Special Features of the DVD."]}, {"page": "All Saints Catholic College, North Kensington", "response": ["* Shanika Warren-Markland, actress"]}, {"page": "List of American films of 2008", "response": ["| Adulthood ‡ || Lionsgate || Noel Clarke (director/screenplay); Noel Clarke, Adam Deacon, Scarlett Alice Johnson, Femi Oyeniran, Red Madrell, Jacob Anderson, Ben Drew, Wil Johnson, Nathan Constance, Adjoa Andoh, Madeleine Fairley, Danny Dyer, Lindsey Jordan, Kiera Booth, Arnold Oceng, Don Klass, Troy Glasgow, David Ajala, Pierre Mascolo, Shanika Warren-Markland || Drama"]}, {"page": "Adulthood (film)", "response": ["*Shanika Warren-Markland as Kayla"]}, {"page": "4.3.2.1.", "response": ["* Shanika Warren-Markland as Kerrys"]}, {"page": "Demons Never Die", "response": ["While at home alone, Amber (Tulisa Contostavlos) is attacked and murdered, with her murder being passed off as a suicide by police investigator Bates (Ashley Walters). A group of troubled teens, made up of Archie (Robert Sheehan), Ricky (Jacob Anderson), Ashleigh (Shanika Warren-Markland), Cain (Femi Oyeniran), Samantha (Emma Rigby),  James (Jack Doolan), Jasmine (Jennie Jacques) and Kenny (Jason Maza) have been contemplating suicide for a long time, and after hearing of Amber's death, decide to make a suicide pact and kill themselves at Ashleigh's upcoming party. However, as Samantha is making a suicide diary in the college's dressing room, she is stabbed to death by a masked killer. After Ashleigh leaves her house, Kenny breaks in with his friend, Davey (Andrew Ellis), to set up cameras around her house, so the group's suicide can be recorded, and Davey can exclusively release the footage. Meanwhile, Archie and Jasmine start a romance, which leads to Archie suggesting he and Jasmine remove themselves from the suicide pact, but this repels Jasmine.", "* Shanika Warren-Markland as Ashleigh"]}, {"page": "List of British films of 2013", "response": ["|| Director: Destiny Ekaragha   Cast: OC Ukeje, Adelayo Adedayo, Shanika Warren-Markland, Malachi Kirby"]}, {"page": "List of Nigerian films of 2015", "response": ["| Gone Too Far! || Destiny Ekaragha || OC UkejeAdelayo AdedayoShanika Warren-Markland  Malachi Kirby || Comedy || Poisson Rouge Pictures  British Film Institute  FilmOne Distribution ||"]}, {"page": "Gone Too Far! (film)", "response": ["Gone Too Far! is a 2013 British Nigerian comedy-drama film, directed by Destiny Ekaragha. It stars OC Ukeje, Adelayo Adedayo, Shanika Warren-Markland and Malachi Kirby. It was released in Nigeria on 16 January 2015.", "*Shanika Warren-Markland as Armani"]}, {"page": "Brotherhood (2016 film)", "response": ["* Shanika Warren-Markland as Kayla"]}]}}