{"wiki_id": "http://www.wikidata.org/entity/Q18710612", "itemLabel": "Frank Atkinson", "itemDescription": "English museum diretor", "wikipedia_url": "https://en.wikipedia.org/wiki/Frank_Atkinson_(museum_director)", "wikipedia_page": {"main": "Frank Atkinson  (13 April 1924 – 30 December 2014) was a British museum director and curator. Atkinson is best known for creating the Beamish Museum near Stanley, County Durham, an open-air 'living' museum on the history of the north of England with a focus on the changes brought to both urban and rural life by the industrialisation of the early 20th century.", "link_mentions": [{"page": "Lucinda Lambton", "response": ["Lambton spent six years at Queen's Gate School, London, then went to a finishing school in Florence, but she ended her education without gaining any qualifications and became a professional photographer working for various newspapers including the Evening Standard. Her first assignment was working for historian Frank Atkinson who was collecting artefacts to form the basis of Beamish Museum."]}, {"page": "Beamish Museum", "response": ["The idea for an open air regional museum came from the then-director of the Bowes Museum, Frank Atkinson (b. 1924, d. 2014). Inspired by Scandinavian folk museums, and realising the North East's traditional industries and communities were disappearing, in 1958, days after taking up his post at Bowes, Atkinson presented a report to Durham County Council urging that a collection of items of everyday history on a large scale should begin as soon as possible, so that eventually an open air museum could be established. As well as objects, Atkinson was also aiming to preserve the region's customs and dialect. He stated the new museum should \"attempt to make the history of the region live\" and illustrate the way of life of ordinary people. He hoped the museum would be run by, be about and exist for the local populace, desiring them to see the museum as theirs, featuring items collected from them.p. 116-119, The Essential Guide to Beamish, 2014, Beamish Museum", "Beamish was the first English museum to be financed and administered by a consortium of county councils (Cleveland, Durham, Northumberland and Tyne and Wear) The museum is now operated as a registered charity, but continues to receive support from local authorities - Durham County Council, Sunderland City Council, Gateshead Council, South Tyneside Council and North Tyneside Council.p. 127, The Essential Guide to Beamish, 2014, Beamish Museum The supporting Friends of Beamish organisation was established in 1968. Frank Atkinson retired as director in 1987. The museum has been 96% self-funding for some years (mainly from admission charges).", "Chophill Colliery was closed by the National Coal Board in 1962, but the winding engine and tower were left in place. When the site was later leased, Beamish founder Frank Atkinson intervened to have both spot listed to prevent their demolition. After a protracted and difficult process to gain the necessary permissions to move a listed structure, the tower and engine were eventually relocated to the museum, work being completed in 1976. The winding engine itself is the only surviving example of the type which was once common, and was still in use at Chophill upon its closure. It was built in 1855 by J&G Joicey of Newcastle, to an 1800 design by Phineas Crowther."]}, {"page": "Ovingham", "response": ["The vicarage was, in medieval times, a cell for three Augustinian canons of Hexham, and was rebuilt in the seventeenth century. It was formerly the residence of the late Frank Atkinson, who did so much to establish the Beamish Museum and also the Bewick Trust at Cherryburn. Bewick received his education in the vicarage and the church.", "*Frank Atkinson (1924–2014), founding director of the Beamish Museum, lived in the village from 1982 until his death in 2014."]}, {"page": "Holgate School, Barnsley", "response": ["* Frank Atkinson CBE, Director from 1970 to 1987 of Beamish Museum, President from 1974 to 1975 of the Museums Association"]}, {"page": "Animal, Vegetable, Mineral?", "response": ["| 22 August 1971 || Barry Cunliffe || Beamish Museum ||Neil Cossons, Norman Hammond, Kenneth Hudson || With Frank Atkinson.", "| Frank Atkinson || Challenger || One episode, 1971"]}, {"page": "1995 New Year Honours", "response": ["*Frank Atkinson, , lately Member, Museums and Galleries Commission. For services to the Development of Museums."]}, {"page": "2014 in the United Kingdom", "response": ["**Frank Atkinson, 90, museum director (Beamish Museum)."]}, {"page": "Deaths in December 2014", "response": ["*Frank Atkinson, 90, British museum director (Beamish Museum).Frank Atkinson obituary"]}, {"page": "Frank Atkinson", "response": ["Frank Atkinson may refer to:", "* Frank Atkinson (American football) (born 1941), American football defensive lineman", "* Frank Atkinson (actor) (1893–1963), British actor and writer", "* Frank Atkinson (museum director) (1924–2014), British museum director and curator", "* R. Frank Atkinson (1869–1923), British architect"]}]}}