{"wiki_id": "http://www.wikidata.org/entity/Q18819466", "itemLabel": "Harold Kent", "itemDescription": "British lawyer and civil servant", "wikipedia_url": "https://en.wikipedia.org/wiki/Harold_Kent", "wikipedia_page": {"main": "Sir Harold Simcox Kent  (11 November 1903 – 4 December 1998) was a British lawyer.\n\n", "link_mentions": [{"page": "Dean of the Arches", "response": ["|1972–1976||Sir Harold Kent"]}, {"page": "Court of Peculiars", "response": ["* Sir Harold Kent, 19721976"]}, {"page": "Chancery Court of York", "response": ["*Sir Harold Kent, 1972–1976"]}, {"page": "Court of the Vicar-General of the Province of Canterbury", "response": ["*Sir Harold Kent, GCB QC 1971-1976"]}, {"page": "Security Commission", "response": ["| Lord Justice WinnSir Dudley WardSir Harold Kent"]}, {"page": "Harry Kent", "response": ["*Harold Kent, Dean of Arches"]}, {"page": "Deaths in December 1998", "response": ["*Sir Harold Kent, 95, British lawyer and public servant, HM Procurator General and Treasury Solicitor."]}, {"page": "Harold Simcox Kent", "response": ["#REDIRECT Harold Kent"]}, {"page": "Arthur Thring", "response": ["Thring was called to the bar in 1887 and practised at parliamentary committees and government inquiries. He was appointed Second Parliamentary Counsel in 1902 and the following year became First Parliamentary Counsel, in which office he was responsible for drafting legislation relating to the People's Budget (1909), the National Insurance Act 1911, the Parliament Act 1911, the Representation of the People Act 1918 and many wartime bills. According to Sir Harold Kent, Lord Simon said of Thring: \"Such a capable fellow, very hard-working, full of common sense ... The only trouble was, he couldn't draft!\"Taken from Kent's memoirs In on the Act: Memoirs of a Lawmaker (Macmillan, 1979), and quoted in a review of that work by A. G. D. (Statute Law Review, vol. 1, no. 3 (1980), p. 187). The Times was more sympathetic, recalling that \"If as a draftsman Thring will not be placed in the same rank as his famous uncle, Lord Thring, Ilbert, or Chalmers, his reputation, in times more difficult than theirs, stood the test of legal interpretation\". In 1917, he became Clerk of the Parliaments, serving until retirement in 1930."]}, {"page": "Ellice Eadie", "response": ["She was called to the bar by Gray's Inn on 26 January 1937 and was given the three-year Arden Scholarship. Eadie gave tuition to women law students at Oxford and was a pupil of Lincoln's Inn's Milner Holland and Richard Lee Metcalfe; she remained with Holland as his \"devil\" after completing her pupilage. In October 1939, Eadie joined the Office of the Parliamentary Counsel to the Treasury, becoming assistant to Harold Kent, the future Treasury Solicitor. She remained in the position for two years before joining the Women's Auxiliary Air Force (WAAF) in 1941. Eadie left the WAAF as a flight officer in 1946 and joined the Board of Trade's solicitor's department that same year. In 1949, she returned to the renamed Office of the Parliamentary Counsel, attaining promotion to Deputy Counsel seven years later, becoming the first female under-secretary rank lawyer in the Civil Service. "]}]}}