{"wiki_id": "http://www.wikidata.org/entity/Q18811231", "itemLabel": "Samuel Carter", "itemDescription": "English lawyer (1805-1878)", "wikipedia_url": "https://en.wikipedia.org/wiki/Samuel_Carter_(Coventry_MP)", "wikipedia_page": {"main": "Samuel Carter (15 May 1805 – 31 January 1878) was a Member of Parliament for his native city of Coventry, and solicitor to two major railway companies (the London and North Western Railway and Midland Railway) for nearly four decades during the development of Britain's rail network.", "link_mentions": [{"page": "May 15", "response": ["*1805 – Samuel Carter, English railway solicitor and Member of Parliament (MP) (d. 1878)"]}, {"page": "Unitarianism", "response": ["Notable Unitarians include classical composers Edvard Grieg and Béla Bartók; Ralph Waldo Emerson, Theodore Parker, Yveon Seon and Thomas Lamb Eliot in theology and ministry; Oliver Heaviside, Erasmus Darwin, Joseph Priestley, John Archibald Wheeler, Linus Pauling, Sir Isaac Newton and inventor Sir Francis Ronalds in science; George Boole in mathematics; Susan B. Anthony in civil government; Frances Ellen Watkins Harper, Whitney Young of the National Urban League, and Florence Nightingale in humanitarianism and social justice; John Bowring, Samuel Taylor Coleridge and Elizabeth Gaskell in literature; Frank Lloyd Wright in the arts; Josiah Wedgwood, Richard Peacock and Samuel Carter MP in industry; Thomas Starr King in ministry and politics; and Charles William Eliot in education. Julia Ward Howe was a leader in the woman suffrage movement, the first ever woman to be elected to the Academy of Arts and Letters, and author of the Battle Hymn of the Republic, volumes of poetry, and other writing. Although raised a Quaker, Ezra Cornell, founder of Cornell University in Ithaca, New York, attended the Unitarian church and was one of the founders of Ithaca's First Unitarian Church. Eramus Darwin Shattuck, a signatory to the Oregon State Constitution, founded the first Unitarian Church in Oregon in 1865.The Centennial History of Oregon 1811–1912 by Joseph Gaston, p. 582."]}, {"page": "List of Unitarians, Universalists, and Unitarian Universalists", "response": ["* Samuel Carter (1805–1878) – British MP and early railway solicitor"]}, {"page": "Kenilworth", "response": ["*Samuel Carter MP (1805–1878), inherited property in Kenilworth and is buried in the graveyard of St Nicholas. "]}, {"page": "London and North Western Railway", "response": ["* 1830–1861 — Samuel Carter, with continuing role for subsidiary companies"]}, {"page": "Midland Railway", "response": ["* Samuel Carter MP 1835 – 1868"]}, {"page": "Reform Club", "response": ["* Samuel Carter"]}, {"page": "Birmingham New Street railway station", "response": ["New Street station was built in central Birmingham by the London and North Western Railway (LNWR) between 1846 and 1854, on the site of several streets in a marshy area known as \"The Froggery\", replacing several earlier rail termini on the outskirts of the centre, most notably Curzon Street, which had opened in 1838, and was no longer adequate for the level of traffic. Samuel Carter, solicitor to both LNWR and the Midland Railway, managed the conveyancing."]}, {"page": "Birmingham Snow Hill railway station", "response": ["It was never intended to be the main station, but the railway was prevented from reaching its original intended terminus at Curzon Street; London and North Western Railway's engineer Robert Stephenson and solicitor Samuel Carter argued in parliament that there would be safety risks in rival companies sharing the congested connection into their station. The original station was a simple temporary wooden structure, consisting of a large wooden shed covering the platforms. In 1871 it was rebuilt, and replaced with a permanent structure. The 1871 station had two through platforms, and bay platforms at the Wolverhampton end, covered by an arched roof. Access to the station was from Livery Street from the side. Trains from the south arrived through Snow Hill Tunnel, built by the cut-and-cover method, and in a cutting from Temple Row to Snow Hill. The cutting was roofed over in 1872 and the Great Western Arcade built on top."]}, {"page": "Settle–Carlisle line", "response": ["The route through Ingleton is closed, but the major structures, Low Gill and Ingleton viaducts, remain. It was a well-engineered line suitable for express passenger running, but its potential was never realised due to the rivalry between the companies. The Midland board decided that the only solution was a separate route to Scotland. Surveying began in 1865, and in June 1866, Parliamentary approval was given to the Midland's bill, for which Samuel Carter was solicitor. Soon afterwards, the Overend-Gurney banking failure sparked a financial crisis in the UK. Interest rates rose sharply, several railways went bankrupt and the Midland's board, prompted by a shareholders' revolt, began to have second thoughts about a venture whose estimated cost was £2.3 million (equivalent to £ in ). As a result, in April 1869, with no work started, the company petitioned Parliament to abandon the scheme it had earlier fought for. However Parliament, under pressure from other railways which would benefit from the scheme that would cost them nothing, refused, and construction commenced in November that year."]}, {"page": "St Pancras railway station", "response": ["In 1862, traffic for the second International Exhibition suffered extensive delays over the stretch of line into London over the GNR's track; the route into the city via the L&NWR was also at capacity, with coal trains causing the network at  and elsewhere to reach effective gridlock. This was the stimulus for the MR to build its own line to London from Bedford, which would be just under  long. Samuel Carter was solicitor for the parliamentary bill, which was sanctioned in 1863."]}, {"page": "Battle, East Sussex", "response": ["Telham Hill is about one mile (1.6 km) south-east of Senlac Hill, in East Sussex, England. It was from Telham Hill that William the Conqueror's army first caught sight of the English army forming up on Senlac Hill, for the battle of Hastings, 14 October 1066. In the later 19th century it was owned and farmed by Samuel Carter as part of his Quarry Hill estate."]}, {"page": "Birmingham and Bristol Railway", "response": ["In 1846, the Bristol and Birmingham and Midland Railways Act allowed the lines to merge and become part of the  Midland Railway. The bill was managed by Samuel Carter, who was solicitor to both Midland and LNWR."]}, {"page": "Birmingham and Derby Junction Railway", "response": ["The Hampton branch was removed, but when the Midland Counties presented its bill, it still contained the Erewash line (although it was later dropped on the insistence of the North Midland Railway). Samuel Carter, the Birmingham and Derby solicitor, immediately issued the statutory notices for its branch and was able to incorporate it in the act. Royal assent for the Birmingham and Derby Junction Railway Bill was given on 19 May 1836 with the active support of the Prime Minister Robert Peel, the member for Tamworth. The branch later became known as the Stonebridge Railway."]}, {"page": "Bristol and Gloucester Railway", "response": ["The Great Western Railway secured a clause in the Act of Amalgamation requiring the Midland to maintain \"two lines of railway of the same gauge as the Great Western Railway\" between Bristol and Standish, with running powers over them for the GWR. In 1848 Midland obtained an Act authorising them to add narrow (standard) gauge rails between Bristol and Standish and to lay a separate narrow gauge double track from Standish into Gloucester. This Bill, as well as those for the amalgamation, were the responsibility of the Midland's solicitor Samuel Carter."]}, {"page": "Stonebridge Railway", "response": ["Two of the most famous men in the history of the Midland Railway were associated with this line - Sir James Joseph Allport (who started his career as a traffic agent in Hampden in Arden), and Matthew Kirtley (who was once the locomotive superintendent of the B&DJR). Samuel Carter was solicitor."]}, {"page": "Oxford, Worcester and Wolverhampton Railway", "response": ["In January 1851 a further special shareholders' meeting was held. Lord Ward, newly elected as Chairman, told the meeting that it was time for the OW&WR to take control of its own destiny, forsaking reliance on others (meaning the GWR); and raising a further £850,000 of capital in 6% preference shares. He began negotiations with George Carr Glyn and Samuel Carter of the London and North Western Railway but with mixed success."]}, {"page": "Great Malvern railway station", "response": ["Great Malvern station was opened by the Worcester and Hereford Railway in 1860 and the present buildings, by architect Edmund Wallace Elmslie, were completed in 1862. The Midland Railway and the London and North Western Railway collaborated on the construction cost; the solicitor, Samuel Carter, was also solicitor to both of these major companies. It was later absorbed by the Great Western Railway."]}, {"page": "Railways in Hereford", "response": ["This railway was opened by the Worcester and Hereford Railway in stages from 1859 to 1861 with the final section Malvern Wells to Shelwick Junction (Hereford) opened on 17 September 1861. Midland Railway and the London and North Western Railway both collaborated in the line - the solicitor, Samuel Carter, was also solicitor to both of these major companies."]}, {"page": "Coventry (UK Parliament constituency)", "response": ["| Samuel Carter"]}, {"page": "Francis Ronalds", "response": ["Several of Ronalds' eleven brothers and sisters also led noteworthy lives.  His youngest brother Alfred authored the classic book The Fly-fisher's Entomology (1836) before migrating to Australia and their brother Hugh was one of the founders of the city of Albion in the American Midwest. His sisters married Samuel Carter – a railway solicitor and MP – and sugar-refiner Peter Martineau, the son of Peter Finch Martineau. Another sister Emily epitomised the family's interest in social reform through her collaborations with early socialists Robert Owen and Fanny Wright.", "Ronalds had a very modest and retiring nature and did little to publicise his work through his life. During his last years, however, his key accomplishments became well known and revered in the scientific community, aided in particular by his friends Josiah Latimer Clark and Edward Sabine and his brother-in-law Samuel Carter.  He was knighted at the age of 82.  Colleagues at the Society of Telegraph Engineers regarded him as \"the father of electric telegraphy\", while his continuously recording camera was noted to be \"of extreme importance to meteorologists and physicists, and… employed in all first-rate observatories\". His portrait was painted by Hugh Carter. Commemorative plaques have been installed on two of his former homes and a road was named after him in Highbury. Ronalds Point in Antarctica is named after Francis Ronalds."]}, {"page": "West London Railway", "response": ["The new line opened on 2 March 1863. The LNWR and the GWR leased the original WLR between them.H P White, London Railway History, David & Charles, Newton Abbot, 1971,  At this time Samuel Carter served as solicitor, as he had done as early as 1845.  "]}, {"page": "Samuel Carter", "response": ["Samuel Carter may refer to:", "* Samuel Carter (Canadian politician) (1859–1944), Ontario manufacturer and political figure", "* Samuel Carter (Coventry MP) (1805–1878), Railway solicitor and MP for Coventry", "* Samuel Carter (Tavistock MP) (1814–1903), MP for Tavistock", "* Samuel Carter (bishop) (1919–2002), Roman Catholic Archbishop of Kingston in Jamaica"]}, {"page": "Sir Henry Jackson, 2nd Baronet", "response": ["Jackson first stood for Parliament at the 1865 general election, when he was unsuccessful in his native borough of Birkenhead. After the death in 1867 of Morgan Treherne, one of the two MPs for Coventry, Jackson won the resulting by-election on 23 July 1867.Craig, op. cit., p. 100 The result was declared void after an election petition, but fellow Liberal Samuel Carter was elected in his place. When he and Jackson stood again at the 1868 general election, both seats were won by Conservatives. Jackson was returned to the House of Commons at the 1874 general election, and was re-elected in 1880."]}, {"page": "Essex Street Chapel", "response": ["* Samuel Carter, railway solicitor and MP "]}, {"page": "List of United Kingdom by-elections (1857–1868)", "response": ["|Samuel Carter"]}, {"page": "Church of the Messiah, Birmingham", "response": ["Early members of the congregation included members of the Martineau family who would produce many Birmingham Lord Mayors throughout the 19th and 20th centuries and Samuel Carter. Joseph Chamberlain, and his son Neville Chamberlain, prime minister 1937–1940, attended services in this church."]}, {"page": "Birmingham Philosophical Institution", "response": ["* John Corrie FRS (President 1807 and 1812–39) – uncle of Samuel Carter"]}, {"page": "Alexander Blair (writer)", "response": ["Blair was a friend of Thomas Wright Hill, and also of Samuel Carter, a Coventry lawyer and a younger man. Hugh Carter, son of Samuel, painted his portrait."]}, {"page": "Hugh Carter (painter)", "response": ["He was born in Birmingham on 4 March 1837, the son of Samuel Carter, a railway solicitor. John Corrie Carter was his younger brother. After the family came to London, he studied for a short time at the Heatherley School of Fine Art and then with John William Bottomley, Alexander Johnson, Francis William Topham, and John Phillip. He also worked at Düsseldorf under Karl Franz Eduard von Gebhardt."]}, {"page": "Samuel Carter (Tavistock MP)", "response": ["Samuel Carter (11 November 1814 – 30 December 1903) was a British Radical politician and lawyer.", "*  (Note: This source incorrectly confuses with Samuel Carter (Coventry MP))"]}, {"page": "Samuel Carter (British politician)", "response": ["#REDIRECT Samuel Carter (Coventry MP)"]}, {"page": "John Corrie Carter", "response": ["Born at Islington Row, Birmingham, Corrie Carter was the third son of Maria (youngest sister of inventor Sir Francis Ronalds) and solicitor Samuel Carter.  The painter Hugh Carter was his brother.  He married Amy Josephine Lonsdale, the granddaughter of Bishop John Lonsdale, on 31 October 1876 at Lichfield Cathedral. The couple had no children.  Around 1880 he and Amy purchased an estate at Rhayader, in Radnorshire, Wales, and he died and was buried there approaching 50 years later."]}]}}