{"wiki_id": "http://www.wikidata.org/entity/Q18810040", "itemLabel": "Alfred Lubbock", "itemDescription": "English Cricketer (1845-1916)", "wikipedia_url": "https://en.wikipedia.org/wiki/Alfred_Lubbock", "wikipedia_page": {"main": "Alfred Lubbock (31 October 1845 – 17 July 1916) was an English insurance underwriter and banker. He is best known as an amateur cricketer who played first-class cricket for a variety of sides including Kent County Cricket Club and the Marylebone Cricket Club between 1863 and 1875. He was considered to be one of the best batsman of his era, comparable to WG Grace, and also played association football, playing for Old Etonians in the 1875 FA Cup Final.", "link_mentions": [{"page": "1875 FA Cup Final", "response": ["|FW ||  || Alfred Lubbock"]}, {"page": "Conrad Wallroth", "response": ["Wallroth, died at Compton Grange Godalming, Surrey at the age of 74. Wallroth's sister Louisa married Alfred Lubbock a Kent cricketer."]}, {"page": "George Wootton", "response": ["1867 was Wootton's most successful season ever with 142 wickets in just nineteen games; though he again failed against the Gentlemen where Alfred Lubbock and E.M. Grace made large scores, he was more terrifying than ever elsewhere until August. The exceptionally hot and dry summer of 1868, however, saw him lose a little of his deadliness with thirty-six fewer wickets, but Wootton recovered this ground for one last time in 1869 before, at the beginning of the 1870s, losing his skill for good just before the heavy roller and motor mower eliminated the shooters that made him so feared. Wootton took ninety wickets in 1870, but was so ineffective after May in 1871 with the first extensive use of heavy rollers, as to drop out of first-class cricket at the end of July with a mere ten wickets in eight games. A few deadly games in 1872 suggested he was still capable of terrorising batsmen at Lord's, but around this time Wootton showed an interest in giving up cricket for a career as a farmer, which he did following a benefit in 1873."]}, {"page": "Lubbock (surname)", "response": ["* Alfred Lubbock (1845–1916), Kent county cricketer"]}, {"page": "List of Gentlemen cricketers (1841–1962)", "response": ["* Alfred Lubbock (1866–1871)"]}, {"page": "Basil Lubbock", "response": ["He was born 9 September 1876 at Rowley Bank, Arkley, Hertfordshire, the second of five children. His father, who was also named Alfred Lubbock, had married his mother, Louisa Wallwroth, in 1875. Alfred senior worked as an underwriter for Lloyd's of London and was a director in Robarts, Lubbock & Co, a private bank founded in 1772.Sir John William Lubbock, 3rd Bt., The Peerage. Retrieved 2018-12-15.  He was descended from Sir John Lubbock, 2nd Baronet. Michael Leek, “A reappraisal of the life and work of Basil Lubbock,” The Mariner’s Mirror, 100 (4) November 2014, p.434"]}, {"page": "List of Marylebone Cricket Club players (1864–1894)", "response": ["* Alfred Lubbock (1866–1869) : A. Lubbock (Kent)"]}, {"page": "List of Gentlemen of Kent cricketers", "response": ["*Alfred Lubbock"]}]}}