{"wiki_id": "http://www.wikidata.org/entity/Q1888972", "itemLabel": "R. H. Bruce Lockhart", "itemDescription": "British writer, spy and diplomat (1887-1970)", "wikipedia_url": "https://en.wikipedia.org/wiki/R._H._Bruce_Lockhart", "wikipedia_page": {"main": "Sir Robert Hamilton Bruce Lockhart, KCMG (2 September 1887 – 27 February 1970) was a British diplomat, journalist, author, secret agent, and footballer. His 1932 book Memoirs of a British Agent became an international bestseller and brought him to the world's attention by telling of his failed effort to sabotage the Bolshevik Revolution in Moscow in 1918. His co-conspirators were double agents working for the Bolsheviks. In the end, the \"Lockhart Plot\" was revealed as a cunning sting operation controlled by Felix Dzerzhinsky with the goal of discrediting the British and French governments.", "link_mentions": [{"page": "Sidney Reilly", "response": ["Reilly disappeared in Soviet Russia in the mid-1920s, lured by Cheka's Operation Trust. British diplomat and journalist R. H. Bruce Lockhart publicised his and Reilly's 1918 exploits to overthrow the Bolshevik regime in Lockhart's 1932 book Memoirs of a British Agent. This became an international best-seller and garnered global fame for Reilly. The memoirs retold the efforts by Reilly, Lockhart, and other conspirators to sabotage the Bolshevik revolution while still in its infancy."]}, {"page": "Jäneda", "response": ["In the early 1900s the manor was owned by Countess, later Baroness, Moura (Maria Zakrevskaya Benckendorff) Budberg, who has been called the \"Mata Hari of Russia\" and who was close to Sir R. H. Bruce Lockhart, Russian writer Maxim Gorky and H. G. Wells."]}, {"page": "Allied intervention in the Russian Civil War", "response": ["The perception of betrayal removed whatever reservations the Allied Powers had about overthrowing the Bolsheviks. According to William Henry Chamberlin, even before Brest-Litovsk, \"Downing Street contemplated a protectorate over the Caucasus and the Quai d'Orsay over Crimea, Bessarabia and Ukraine\" and began negotiating deals for funding White generals to bring them into being. R. H. Bruce Lockhart and another British agent and a French official in Moscow tried to organize a coup that would overthrow the Bolshevik regime. They were dealing with double agents and were exposed and arrested.John W. Long, \"Plot and counter‐plot in revolutionary Russia: Chronicling the Bruce Lockhart conspiracy, 1918.\" Intelligence and National Security 10#1 (1995): 122–143. French and British support for the Whites was also motivated by a desire to protect the assets they had acquired through extensive investment in Tsarist Russia."]}, {"page": "Reilly, Ace of Spies", "response": ["The series was written by Troy Kennedy Martin, and based on the 1967 book Ace of Spies by Robin Bruce Lockhart, whose father R. H. Bruce Lockhart was one of Reilly's fellow spies. Sam Neill stars as the eponymous character. The theme music is the romance movement from Dmitri Shostakovich's The Gadfly Suite, though Shostakovich is not actually credited (Harry Rabinowitz is credited with the music).", "* Ian Charleson as R. H. Bruce Lockhart"]}, {"page": "Rob Lockhart", "response": ["Lockhart was born in Ayrshire, Scotland. His mother was Florence Stuart Macgregor, while other ancestors included Bruces, Hamiltons, Cummings, Wallaces and Douglases. His brother, the writer R. H. Bruce Lockhart, claimed that \"There is no drop of English blood in my veins.\"R. H. Bruce Lockhart, My Scottish Youth (B&W Publishing, Edinburgh, 1993), , pp 313–353 Another brother, J. H. Bruce Lockhart, was headmaster of Sedbergh School, while his nephews Rab Bruce Lockhart and Logie Bruce Lockhart went on to become headmasters of Loretto and Gresham's. Another nephew, J. M. Bruce Lockhart, was an intelligence officer. He married Margaret Amy Campbell on 2 September 1918 in Mussorie, India. They had one daughter, Mary Mavora Lockhart, who was born in 1919."]}, {"page": "Robert Lockhart", "response": ["* Sir R. H. Bruce Lockhart (1887–1970), British journalist, author, and secret agent"]}, {"page": "Trịnh Cương", "response": ["Trịnh Cương tried various legislative means to solve the problem. He tried to limit private land holdings. He tried to redistribute the communal fields of the small villages. Nothing really worked and the problem became very serious over the succeeding decades. According to historian R. H. Bruce Lockhart, the governmental reforms enacted by Trịnh Cương and his great-grandfather, Trịnh Căn, made the government more effective but, they also made the government more of a burden to the people. This had the effect of increasing the hatred felt by the people towards the Trịnh rulers in Hanoi."]}, {"page": "Moura Budberg", "response": ["Before the October Revolution, Moura worked in the Russian embassy in Berlin, where she became acquainted with British diplomat R. H. Bruce Lockhart. Upon the assassination of her husband in 1919, she was arrested on suspicion of spying for the United Kingdom and was transferred to the Lubyanka prison. Lockhart, who mentioned her under her given name in his 1932 book Memoirs of a British Agent,Sir Robert Bruce Lockhart, Memoirs of a British Agent (1932); 384 pp; Reprinted Macmillan (January 1975)   tried to vouch for her but was detained as well for a couple of weeks. They had been loversMystery of Nick Clegg's 'Mata Hari' aunt and a plot to kill Lenin  and she became pregnant by him, but the pregnancy miscarried.\"Epilogue\" by Robin Bruce Lockhart (2003) in Memoirs of a British Agent by R. H. Bruce Lockhart (2003 edition by the Folio Society), pg 267. (Lockhart's book was made into an American movie in 1934, British Agent,  in which he was played by Leslie Howard (\"Stephen Locke\") and she by Kay Francis (\"Elena Moura\").  "]}, {"page": "Robert Bruce Lockhart", "response": ["#REDIRECT R. H. Bruce Lockhart"]}, {"page": "R.H. Bruce Lockhart", "response": ["#REDIRECT R. H. Bruce Lockhart"]}, {"page": "Bruce Lockhart family", "response": ["thumb|R. H. Bruce Lockhart,in Malaya, 1909", "Robert Bruce Lockhart married Florence Stewart McGregor (1864–1928), who had been born in Riverton, New Zealand. Both were Scottish by descent, and in My Scottish Youth, their eldest son claimed \"There is no drop of English blood in my veins.\"R. H. Bruce Lockhart, My Scottish Youth (Reprinted by B&W Publishing, Edinburgh, 1993, ), pp. 313–353 Their children were:"]}, {"page": "Robin Bruce Lockhart", "response": ["Bruce Lockhart was the only son of British spy R. H. Bruce Lockhart and was educated at Eagle House School and the Royal Naval College, Dartmouth. During the Second World War he served in British naval intelligence, and was stationed in Singapore, where he met and married his first wife, Peggy in 1942.Thomas B. Allen, Declassified: 50 Top-Secret Documents That Changed History (Simon and Schuster, 2008) p. 109 After the War he pursued a career in journalism, working for the Beaverbrook Press in London, Manchester and Glasgow. He later became a stock broker, while continuing to pursue his literary interests. He lived in Sussex and France. "]}, {"page": "Michael Curtiz filmography", "response": ["| With Leslie Howard, Kay Francis, William Gargan; based on a book by R. H. Bruce Lockhart"]}, {"page": "R H Bruce Lockhart", "response": ["#REDIRECT R. H. Bruce Lockhart "]}, {"page": "RH Bruce Lockhart", "response": ["#REDIRECT R. H. Bruce Lockhart "]}, {"page": "F. A. Macquisten", "response": ["*R. H. Bruce Lockhart. The Diaries of Sir Robert Bruce Lockhart, 1915–1938, pp. 127–128"]}]}}