{"wiki_id": "http://www.wikidata.org/entity/Q1887085", "itemLabel": "John Hawken", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Hawken", "wikipedia_page": {"main": "John Christopher Hawken (born 9 May 1940 in Bournemouth) is an English keyboard player. He studied classical piano between the ages of four and eighteen before acquiring a taste for rock and roll. Hawken's first band was the Cruisers Rock Combo (1960 to 1962) but he is possibly best known for his contributions to various versions of The Nashville Teens (1962 to 1968). He was then a founding member of Renaissance in 1969.\nHe also played in Spooky Tooth, Third World War, Vinegar Joe, Strawbs and Illusion, as well as being a session musician.", "link_mentions": [{"page": "Renaissance (band)", "response": ["The original line-up included two former members of the Yardbirds, Keith Relf and Jim McCarty, along with John Hawken, Louis Cennamo and Relf's sister Jane Relf. They intended to put \"something together with more of a classical influence\".Romano, Will (2010). Mountains Come Out of the Sky: An Illustrated History of Prog Rock (1st Ed.). Montclair, NJ: Blackbeat Books. p. 130.  Renaissance was born, and the band released a studio album in 1969, and another in 1971. Subsequently, John Tout replaced Hawken on keyboards, followed by a period of high turnover of musicians until the \"classic line-up\" of Annie Haslam, John Tout, Michael Dunford, Jon Camp, and Terry Sullivan was established, although none of them were in the original band. They were assisted with lyrics on many songs from Cornish poet Betty Thatcher-Newsinger. From 1972 to 1979 Renaissance released seven successful studio albums, toured extensively, and sold out three nights in a row at Carnegie Hall with Tony Cox conducting the New York Philharmonic.Snider, Charles (2007). The Strawberry Bricks Guide to Progressive Rock (1st ed.). Chicago: Strawberry Bricks. p. 233. ", "In January 1969, Relf and McCarty organized a new group devoted to experimentation with rock, folk, and classical forms. In his book Mountains Come Out of the Sky: An Illustrated History of Prog Rock, Will Romano quoted McCarty: \"Toward the end of the Yardbirds we wanted to do something a bit more poetic, if you like, not so heavy. A bit more folky... We had had enough of heavy rock.\" This quintet—Relf on guitar and vocals, McCarty on drums and vocals, plus bassist Louis Cennamo, pianist John Hawken, and Relf's sister Jane as an additional vocalist—released a pair of albums on Elektra (US) and Island (UK-ILPS 9114), the first one, titled simply Renaissance (1969), being produced by fellow ex-Yardbird Paul Samwell-Smith.", "The two remaining original members left in late 1970; Jane Relf was replaced by American folk singer Anne-Marie \"Binky\" Cullom, then John Hawken left to join Spooky Tooth and pianist John Tout replaced him. There is an extant video (released on the DVD \"Kings & Queens\" in 2010) of that line-up performing five songs on a German TV program (Muzik-Kanal). The plan at the time was that Relf and McCarty would remain involved as non-performing members – Relf as a producer and McCarty as a songwriter. Both were present when singer Annie Haslam successfully auditioned in January 1971 to replace the departing Cullom (who would later marry drummer Terry Slade and retire from the music scene). While McCarty would go on to write songs for the new band, Relf's involvement would be short-lived. Dunford soon emerged as a prolific composer, and continued the writing partnership with Thatcher, who would go on to write most of the lyrics for the band's 1970s albums."]}, {"page": "The Nashville Teens", "response": ["Art Sharp (born Arthur Sharp, 26 May 1941, Woking, Surrey) began his career in music as manager of Aerco Records in Woking, Surrey. The group's line-up eventually comprised singers Sharp and Ray Phillips (born Ramon John Philips, 16 January 1939, Tiger Bay, Cardiff, South Wales), with former Cruisers Rock Combo members John Hawken (piano), Mick Dunford (lead guitar) (born Michael Dunford, 8 July 1944, Addlestone, Surrey died 20 November 2012, Surrey), Pete Shannon (born Peter Shannon Harris, 23 September 1941, Antrim, County Antrim, Northern Ireland) (bass) and Dave Maine (drums). Roger Groome replaced Maine shortly afterward but was in turn replaced by Barry Jenkins in 1963, the year a third vocalist, Terry Crowe (born Terence Crowe, 1941, Woking, Surrey) joined briefly and Dunford left, to be replaced by John Allen (born John Samuel Allen, 23 April 1945, St Albans, Hertfordshire). (Crowe and Dunford formed \"The Plebs\" with Danny McCulloch and Derek (Degs) Sirmon and were re-united with Hawken in Renaissance in 1970). There was also another member, Derek Gentle (vocals), who was diagnosed with cancer in the summer of 1962 and had to leave the band. He died in June 1963.", "*John Hawken – keyboards (1962–68)"]}, {"page": "List of Moog synthesizer players", "response": ["*John Hawken – Strawbs"]}, {"page": "Third World War (band)", "response": ["At the time the album was released, the band had yet to play live. In the summer of 1971 Avery, Fenton and Stamp reconfigured the group to get \"the 'best' live grouping,\" which was Stamp, Avery, John Hawken on piano, John Knightsbridge on lead guitar, and Paul Olsen  on drums. They toured Finland, playing 35 gigs in 30 days, and then went on to perform at a number of festivals across Europe. 1971 also saw the release of the band's two singles, \"Ascension Day\"/\"Teddy Teeth Goes Sailing\" and \"A Little Bit Of Urban Rock\"/\"Working Class Man\", both of which appeared on Fly Records."]}, {"page": "Strawbs", "response": ["Cousins and Lambert rebuilt the band, adding John Hawken (formerly of The Nashville Teens and Renaissance) on keyboards, Rod Coombes formerly with Stealers Wheel and Chas Cronk on bass. This line-up recorded the 1974  Hero and Heroine and Ghosts, and tended to concentrate on the North American market with relatively little touring in the UK.  Strawbs still retain a great fan-base today in the US and Canada. Hero And Heroine went platinum in Canada, and both albums sold extremely well in the US too.  A further album, Nomadness, recorded without Hawken, was less successful, and was their last for A&M Records.", "For that particular recording, and other concerts on the same tour, vocalist and bass player John Ford (member of an earlier Strawbs line-up) flew over from New York to perform with members of the Hero and Heroine line-up. The Hero and Heroine line-up toured again in 2007 in the UK, including gigs at the Robin 2 (Bilston), The Stables (Wavendon), and several locations in Southern and South-Western England.  This line-up also toured the UK and US in May–June 2008. Following the end of the US Tour, John Hawken announced his intention to leave the group. The remaining four members (the Nomadness line-up) continued as the core of the electric band.  In January 2009, it was announced that Oliver Wakeman, would be playing keyboards with the band on tours of Canada, the UK and Italy."]}, {"page": "Spooky Tooth", "response": ["In the autumn of 1970 the band embarked on a European tour that was undertaken with a line-up of Harrison, Grosvenor, Kellie, keyboardist John Hawken (ex-Nashville Teens) and bassist Steve Thompson. After this, the group disbanded, though Harrison and Wright reformed Spooky Tooth in September 1972 with a different line-up.", "*John Hawken - keyboards (1970)", "* John Hawken – keyboards"]}, {"page": "Vinegar Joe (band)", "response": ["Tim Hinkley took over from Thompson on keyboards and was succeeded by John Hawken. Drummer Rob Tait played the first series of live shows succeeded by John Woods. Mike Deacon took over on keyboards. During recording of their second album, Rock'n Roll Gypsies, also released in 1972, Keef Hartley played drums. Guitarist Jim Mullen also joined the band for this record and played on the US tour. The artwork for the album was supplied by Hipgnosis. Drummer Pete Gavin joined the band prior to the US tour and recording of their third and final album Six Star General released in 1973. The band dissolved in the spring of 1974. Alan Powell played drums during the band's final weeks.", "*John Hawken - keyboards (1972)"]}, {"page": "Hawken", "response": ["* John Hawken (born 1940), English keyboard player"]}, {"page": "Illusion (band)", "response": ["Illusion were intended to be a reunion of the original line-up of Renaissance (whose second 1971 album was titled Illusion), but singer and guitarist Keith Relf died before the project was realised. Thereafter, the band's new lineup featured Louis Cennamo on bass, John Hawken on keyboards, Jim McCarty moved from drums to play acoustic guitar and share vocals with Jane Relf, while Eddie McNeill replaced him on drums and John Knightsbridge (from Third World War, and later of Ruthless Blues) played lead guitar.", "* John Hawken – keyboards", "* John Hawken – piano, synthesizers, Mellotron, Hammond organ, Fender Rhodes electric piano, harpsichord", "* John Hawken – piano, synthesizers, Mellotron, Hammond organ, Fender Rhodes electric piano, harpsichord", "* John Hawken – piano, analogue synthesizers (Moog/ARP), Mellotron (original), Hammond organ, Fender Rhodes electric piano, harpsichord", "* John Hawken – piano, keyboards", "* John Hawken website"]}, {"page": "Cruisers Rock Combo", "response": ["The Cruisers Rock Combo was a British rock band of the early 1960s. Formed in Addlestone, Surrey in 1960, their original line-up comprised singers Tony Gallagher, Kenny King and Chris Wing, backed by Mick Dunford (lead guitar), John Hawken (piano), Pete Harris (bass), and Dave Maine (drums). The singers departed at around the same time that neighbouring band The Nashville Teens split; the remaining Cruisers joined the Teens' singers Ray Phillips and Arthur Sharp to form the Mark Two version of The Nashville Teens."]}, {"page": "That'll Be the Day (film)", "response": ["That'll Be the Day is a 1973 British coming of age drama film directed by Claude Whatham, written by Ray Connolly, and starring David Essex, Rosemary Leach and Ringo Starr. Set primarily in the late 1950s and early 1960s, the film tells the story of Jim MacLaine (Essex), a British teenager raised by his single mother (Leach). Jim rejects society's conventions and pursues a hedonistic and sexually loose lifestyle, harming others and damaging his close relationships in the process. The cast also featured several prominent musicians who had lived through the era portrayed, including Starr, Billy Fury, Keith Moon, and John Hawken.  ", "Ringo Starr was cast as Mike after Connolly, who had never been to a holiday camp, consulted him and former Beatles road manager Neil Aspinall about their Butlins memories. Aspinall also helped to put together the camp band that appeared in the film. Several roles were played by prominent musicians who had lived through the same era portrayed in the film, including Starr, Billy Fury, Keith Moon of the Who, and John Hawken of the Nashville Teens."]}, {"page": "Meet The Smithereens!", "response": ["*John Hawken – piano on \"Little Child\" and \"Not a Second Time\""]}, {"page": "Renaissance (Renaissance album)", "response": ["*John Hawken - piano, harpsichord"]}, {"page": "Illusion (Renaissance album)", "response": ["Following an American tour to support their first album, the band returned to the studio in the spring of 1970 to begin work on their second. The band recorded \"Love Goes On\", \"Golden Thread\", \"Love Is All\", and \"Face of Yesterday\" before they began to fall apart. Keith Relf and Jim McCarty were the first to leave, deciding to cease as performing members but remain involved with production and composition for the band. John Hawken recruited singer Terry Crowe and guitarist Michael Dunford (both from Hawken's previous band The Nashville Teens), as well as session drummer Terry Slade to replace Relf and McCarty. Louis Cennamo left shortly afterwards to join Colosseum. Bassist Neil Korner, another former member of The Nashville Teens, replaced him.", "This new 6-person line-up, recorded a Dunford composition, \"Mr. Pine\". However, due to a lack of material for the album, the (already disbanded) original line-up got back together, minus Hawken and plus guest keyboardist Don Shinn, to record \"Past Orbits of Dust\". Shortly after recording was complete, the only two remaining original members - Jane Relf and John Hawken - left the band, to be replaced by Anne-Marie \"Binky\" Cullom and John Tout, respectively.", "*John Hawken – keyboards"]}]}}