{"wiki_id": "http://www.wikidata.org/entity/Q1886993", "itemLabel": "John Stanley Gardiner", "itemDescription": "British zoologist and oceanographer", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Stanley_Gardiner", "wikipedia_page": {"main": "John Stanley Gardiner (1872–1946) was a British zoologist.", "link_mentions": [{"page": "Wolfson College, Cambridge", "response": ["After the Second World War, the number of graduates of other universities who went to Cambridge to do research increased significantly. The university therefore decided to found University College in 1965 to help accommodate these students. The college was based at Bredon House, a property built in the early twentieth century by John Stanley Gardiner, who was a Professor of Zoology at the university from 1909 to 1937. He donated the house, with its long narrow garden running from Barton Road to Selwyn Gardens, to the university upon his death in 1946. The college then purchased further property on its eastern boundary."]}, {"page": "Lepidodactylus", "response": ["The specific name, gardineri, is in honor of British zoologist John Stanley Gardiner."]}, {"page": "Atolls of the Maldives", "response": ["* John Stanley Gardiner, The Formation of the Maldives. The Geographical Journal, Vol. 19, No. 3. Cambridge 1902."]}, {"page": "Professor of Zoology (Cambridge)", "response": ["* John Stanley Gardiner (1909)"]}, {"page": "John Gardiner", "response": ["*John Stanley Gardiner (1872–1946), British zoologist"]}, {"page": "Linnean Medal", "response": ["*1936: John Stanley Gardiner"]}, {"page": "Harold Munro Fox", "response": ["When the First World War broke out, he enlisted in the Royal Army Service Corps and served with the City of London Yeomanry in the Balkans, Egypt, Salonika (Thessaloniki), and Palestine. It was then when he changed his name from Fuchs to Fox by deed poll. While he was stationed in Egypt, he met his first wife, Léonie Thérèse Roger, the daughter of Henri Roger, a French people official of the Suez Canal Company. They married in 1917. After the war, Fox spent six months back in London working with MacBride again, and also worked at the Marine Biological Association again for some time. However, in 1919 he returned to Cairo on invitation by Edward Hindle to join his staff at the Cairo School of Medicine as lecturer (1919–1923). During this time he finished a thesis on the flagellate protozoan Bodo, the research on which he had begun at Plymouth, and presented it to Gonville and Caius College, Cambridge to apply for fellowship. His application was accepted in 1920, but he took up the post only in 1923. In Cambridge, he and John Stanley Gardiner organised an expedition to study the fauna of the Suez Canal during 1924–1925."]}, {"page": "Gardiner's Seychelles frog", "response": ["Gardiner's Seychelles frog (Sechellophryne gardineri) is a small frog of the family Sooglossidae and endemic to the Seychelles. It is named after John Stanley Gardiner, English zoologist and oceanographer."]}, {"page": "Clive Forster-Cooper", "response": ["In 1900, Forster Cooper travelled with John Stanley Gardiner to the Maldive and Laccadive Islands to undertake collections and study the formation of coral reefs. From 1902 to 1903 he was naturalist to the North Seas Fisheries Commission Scientific Investigations, sailing around the Indian Ocean, taking soundings and collecting fauna and flora of the Seychelles."]}, {"page": "Gardiner's burrowing skink", "response": ["The specific name, gardineri, is in honor of British zoologist John Stanley Gardiner."]}, {"page": "Ascaltis gardineri", "response": ["Ascaltis gardineri is a species of calcareous sponge in the family Leucascidae from India and the Seychelles. The species is named after the British zoologist John Stanley Gardiner."]}, {"page": "Longtail dragonet", "response": ["Callionymus gardineri, the longtail dragonet, is a species of dragonet native to the western Indian Ocean.  It can be found at depths of from .  This species grows to a length of  TL. The specific name honours the British zoologist John Stanley Gardiner (1872-1946)."]}, {"page": "List of fellows of the Royal Society G, H, I", "response": ["| John Stanley Gardiner||07/05/1908||24 January 1872 – 28 February 1946"]}, {"page": "Lancelot Alexander Borradaile", "response": ["As well as these generalist works, Borradaile also worked as a carcinologist. He published an important monograph On the Pontoniinae in 1917, based on material collected by the 1905 Percy Sladen Trust Expedition to the Indian Ocean, led by John Stanley Gardiner. He worked extensively on crabs and similar animals, and coined the term \"carcinisation\" to describe \"one of the many attempts of Nature to evolve a crab\". PDF He is commemorated in the scientific names Metapenaeopsis borradaili, Athanas borradailei, Corallianassa borradailei, Accalathura borradailei and Petrolisthes borradailei.", "He was born on 26 September 1872 to a \"merchant in the African trade\". He studied at Selwyn College, University of Cambridge, on the natural sciences tripos. He graduated with a first-class honours B.A. in 1893; the M.A. followed in 1897. In 1895, he began demonstrating in zoology at Cambridge, and also starting investigating variation in crustaceans, under William Bateson. In 1899, he accompanied John Stanley Gardiner on an expedition to Ceylon (Sri Lanka) and Minikoi (Minicoy), where he studied various aspects of crustacean biology, especially the terrestrial crabs. For his further work on crabs and shrimp, he was awarded the higher doctorate Sc.D. in 1922."]}, {"page": "List of fellows of the Royal Society elected in 1908", "response": ["#John Stanley Gardiner  (1872–1946)"]}, {"page": "Chaetodon gardineri", "response": ["Chaetodon gardineri was first formally described in 1939 by the English ichthyologist John Roxborough Norman (1898-1944) with the type locality given as Muscat. The specific name honours British zoologist John Stanley Gardiner (1872-1946) who was Secretary to the Committee of the John Murray Expedition to the Indian Ocean in 1933-34, on which the type of this species was collected. This species is tentatively placed in the large subgenus Rabdophorus which might warrant recognition as a distinct genus."]}, {"page": "Norman Bertram Marshall", "response": ["In 1933 Marshall entered Downing College, Cambridge as an exhibitor, supported by scholarships from both the Cambridgeshire County Council and the Board of Education. He gained a double first in the Natural Sciences Tripos, having read Zoology Part II. As an undergraduate he was interested in embryology and this led to him being introduced by his professor John Stanley Gardiner to E.S. Russell, whose book The Interpretation of Development and Heredity Marshall had admired. Russell at the time was Director of Fisheries Investigations at the Ministry of Agriculture and Fisheries and they discussed fish biology but Marshall was set on pursuing his interest in embryology. However, Gardiner advised Freddy to broaden his horizons and introduced him to a Commander Hawkridge who had an office insuring fishing boats in Hull. Hawkridge was able to arrange berths for Marshall on fishing boats during his vacation, which allowed Marshall to visit the waters off Iceland three times and Bear Island and the Faroes once each. It was on these voyages that Marshall was first introduced to the macrourid fish on which he would become an authority. These trips may have had some influence on Marshall's decision to give up embryology and to apply for a post as a marine biologist in Hull."]}, {"page": "Rotuman forest gecko", "response": ["The Rotuman forest gecko or Rotuma forest gecko (Lepidodactylus gardineri) is a species of gecko. It is endemic to Rotuma Island (Fiji). It is named after John Stanley Gardiner."]}]}}