{"wiki_id": "http://www.wikidata.org/entity/Q18810989", "itemLabel": "Joe Craddock", "itemDescription": "English footballer (1902-1976)", "wikipedia_url": "https://en.wikipedia.org/wiki/Joe_Craddock_(footballer)", "wikipedia_page": {"main": "Claude William Craddock (3 August 1902 – October 1976) was an English professional football forward who played in the Football League for Rochdale, Brentford, Gillingham and Darlington. He also played in the Scottish Football League for Dundee.", "link_mentions": [{"page": "Sheppey United F.C.", "response": ["* Joe Craddock"]}, {"page": "Bill Berry (footballer, born 1904)", "response": ["Together with Gillingham teammates Wally Barnard, Charlie Reddock, Charlie Butler and Joe Craddock, Berry followed former Gillingham manager Harry Curtis to Third Division South club Brentford in May 1926. He failed to fully make the outside left berth his own and was dropped to the reserve team for the 1929–30 season. He returned to the first team in good form during the 1930–31 season, scoring 19 goals in 37 appearances. The signing of Arthur Crompton in February 1932 signalled the beginning of the end of Berry's time at Griffin Park and after making just one appearance during the early months of the 1932–33 season, he left the club in November 1932. He made 148 appearances and scored 44 goals in just over five seasons with the Bees."]}, {"page": "List of Brentford F.C. players (1–24 appearances)", "response": ["Players who finished their Brentford careers with 24 appearances are Micky Cook, Joe Craddock, Ryan Denys, Micky Droy, Brian Etheridge, Tommy Finney, Scott Fitzgerald, John Halls, Tommy Leigh, Roddy McLeod, Sammy Moore, Sidney Mulford, Mark Peters and Harry Stott. Roddy McLeod scored 14 goals in his 24 appearances and is the highest scorer on this list."]}, {"page": "Joe Craddock", "response": ["Joe Craddock  (born September 7, 1985) is an American football coach. He was formerly the offensive coordinator and QB coach at the University of Arkansas. He played professionally in the Italian Football League. He played his college football at Middle Tennessee State. "]}, {"page": "1926–27 Brentford F.C. season", "response": ["After just one top-half finish in the Third Division South since entering the Football League in 1920, Brentford appointed former Gillingham manager Harry Curtis to the position on a one-year contract in May 1926. The club was still seeking a winning formula, after generally poor league placings from previous managers Fred Halliday and Archie Mitchell. The directors of the club cleared the decks and retained just 9 of the previous season's squad. Curtis brought with him assistant trainer Jack Cartmell (an ex-Brentford player) and five Gillingham players – full backs Wally Barnard and Charlie Butler, half back Charlie Reddock and forwards Bill Berry and Joe Craddock. Former Gillingham half back Frank Marshall later signed in January 1927. Jim Ferguson replaced the departed John Thomson in goal and defenders John Hodgson, Ted Winship, half backs Bert Bellamy, Joe Hodnett and forwards George Anderson and Stephen Dearn were also signed.", "|Joe Craddock", "| style=\"text-align:left;\" |Joe Craddock", "| style=\"text-align:left;\" |Joe Craddock", "| Joe Craddock"]}, {"page": "1927–28 Brentford F.C. season", "response": ["|Joe Craddock", "| style=\"text-align:left;\" |Joe Craddock", "| style=\"text-align:left;\" |Joe Craddock", "| Joe Craddock"]}]}}