{"wiki_id": "http://www.wikidata.org/entity/Q18814", "itemLabel": "Jessie J", "itemDescription": "English singer", "wikipedia_url": "https://en.wikipedia.org/wiki/Jessie_J", "wikipedia_page": {"main": "Jessica Ellen Cornish (born 27 March 1988), known professionally as Jessie J, is an English singer-songwriter. Born and raised in London, she began her career on stage, aged 11, with a role in the West End musical Whistle Down the Wind. She studied at the BRIT School before signing with Gut Records and striking a songwriting deal with Sony/ATV Music Publishing.\nAfter signing with Republic Records, Jessie J came to prominence following the release of her debut single \"Do It Like a Dude\". Her following single \"Price Tag\" topped the charts in nineteen countries including the UK and was followed by the release of her debut album, Who You Are (2011), which peaked at number two in the UK. Other singles from the album included \"Nobody's Perfect\", \"Who You Are\", \"Domino\" and \"Laserlight\", all of which peaked within the top ten on the UK Singles Chart, making Jessie J the first British female artist to have six top-ten singles from a sole studio album. \"Domino\" also attained further international success, peaking at number six on the US Billboard Hot 100 and becoming her second number-one single in the UK. In 2012, Jessie J performed at the Queen's Diamond Jubilee Concert outside Buckingham Palace in June, as well as the closing ceremony of the 2012 Olympic Games in London on 12 August.\nHer second album Alive (2013) peaked within the top five on the UK Albums Chart and also included the top-five singles \"Wild\" and \"It's My Party\". The release of her third album Sweet Talker (2014) was preceded by the single \"Bang Bang\" which debuted at number one in the UK and went multi-platinum worldwide. The album made the top five in the UK and peaked at number ten on the US Billboard 200, her highest-charting album in the US. As of January 2015, Jessie J had sold over 20 million singles and 3 million albums worldwide.Citing various influences, Jessie J is recognised for an unconventional musical and performance style that mixes soul vocals with contemporary R&B, pop, electropop, and hip-hop beats. She has received various accolades throughout her career, including the 2011 Critics' Choice Brit Award and the BBC's Sound of 2011. Jessie J has supported various charitable causes, and has appeared on the UK charity telethons BBC Children in Need and Comic Relief. She has served as a coach on the competition series The Voice UK, The Voice Australia and The Voice Kids UK. In 2018, Jessie J received widespread recognition in China following her appearance in the Hunan TV reality program Singer (previously called I Am a Singer).", "link_mentions": [{"page": "BBC Radio 1", "response": ["In 2010 the event was renamed 'BBC Radio 1's Teen Awards', and includes awards given to celebrities and particularly inspirational young people. Now hosted at Wembley Arena, the event has included guests such as One Direction, Tinie Tempah, Fall Out Boy and Jessie J."]}, {"page": "Belfast", "response": ["In November 2011, Belfast became the smallest city to host the MTV Europe Music Awards. The event was hosted by Selena Gomez and celebrities such as Justin Bieber, Jessie J, Hayden Panettiere, and Lady Gaga travelled to Northern Ireland to attend the event, held in the Odyssey Arena."]}, {"page": "Eden Project", "response": ["|Jessie J"]}, {"page": "March 27", "response": ["*1988 – Jessie J, English singer-songwriter"]}, {"page": "1988", "response": ["** Jessie J, English singer and songwriter"]}, {"page": "Seal (musician)", "response": ["In 2012, Seal was one of the four vocal coaches in the first season of the Australian version of the reality singing competition The Voice. He was the coach of the series winner Karise Eden. Seal returned to The Voice season two, which debuted on 7 April 2013, where he became the winning coach once again, coaching eventual winner Harrison Craig. He did not return for the third season in 2014 with the Nine Network stating that Seal \"will take a break from the third season of The Voice to focus on music and material for a new album.\" Channel NINE announced on 8 November 2016 that Seal would be returning alongside Delta Goodrem to The Voice as a coach in 2017, replacing Jessie J after a three-year hiatus."]}, {"page": "Queen (band)", "response": ["On 12 August 2012, Queen performed at the closing ceremony of the 2012 Summer Olympics in London. The performance at London's Olympic Stadium opened with a special remastered video clip of Mercury on stage performing his call and response routine during their 1986 concert at Wembley Stadium. Following this, May performed part of the \"Brighton Rock\" solo before being joined by Taylor and solo artist Jessie J for a performance of \"We Will Rock You\"."]}, {"page": "Freddie Mercury", "response": ["Tribute was paid to Queen and Mercury at the closing ceremony of the 2012 Summer Olympics in London. The band's performance of \"We Will Rock You\" with Jessie J was opened with a video of Mercury's \"call and response\" routine from 1986's Wembley Stadium performance, with the 2012 crowd at the Olympic Stadium responding appropriately. The frog genus Mercurana, discovered in 2013 in Kerala, India, was named as a tribute because Mercury's \"vibrant music inspires the authors\". The site of the discovery is very near to where Mercury spent most of his childhood. In 2013, a newly discovered species of damselfly from Brazil was named Heteragrion freddiemercuryi, honouring the \"superb and gifted musician and songwriter whose wonderful voice and talent still entertain millions\" — one of four similar damselflies named after the Queen bandmates, in tribute to Queen's 40th anniversary."]}, {"page": "Brian May", "response": ["Queen performed at the closing ceremony of the 2012 Summer Olympics in London on 12 August 2012. May performed part of the \"Brighton Rock\" solo before being joined by Taylor and solo artist Jessie J for a performance of \"We Will Rock You\". On 16 September 2012, May appeared at the Sunflower Jam charity concert at the Royal Albert Hall, performing alongside bassist John Paul Jones (of Led Zeppelin), drummer Ian Paice (of Deep Purple), and vocalists Bruce Dickinson (of Iron Maiden) and Alice Cooper."]}, {"page": "Tom Jones (singer)", "response": ["In March 2012, Jones became a coach on the BBC talent show The Voice UK. Jones was joined by will.i.am, Jessie J and Danny O'Donoghue. He mentored Leanne Mitchell to win the first series. Jones returned to coach in 2013, 2014 and 2015. In August 2015, it was announced that Jones's contract with the show would not be renewed and that he would be replaced by Boy George. Jones criticised BBC executives for \"sub-standard behaviour\", having not consulted with him and informing him only 24 hours before the official announcement."]}, {"page": "Northampton", "response": ["Popular annual events include Northampton Carnival, the Beer Festival, the Dragonboat Race, the Umbrella Fair, Diwali celebrations and St Crispins Fair. Northampton Balloon Festival used to be a major event in Northampton, but since being scaled down, it has been poorly attended. Northampton Music Festival has been celebrated every year since 2007 in the town centre. A smaller music festival A Walk in the Park has been put on since 2008 in Wootton. A new music festival, Alive at Delapré, debuted in the summer of 2013 and has since attracted artists like Alfie Boe, Boyzone, Jessie J, James Morrison, McBusted, Paul Weller and The Wanted."]}, {"page": "Ricky Martin", "response": ["Since Martin's debut as a coach on The Voice Australia in 2013, he continued as a coach in Season 3 in 2014 alongside will.i.am, Kylie Minogue and Joel Madden. He returned to the panel alongside Delta Goodrem, Benji Madden (teamed up with his brother Joel Madden), and newcomer Jessie J in 2015; before leaving the show before the fifth series to focus on music commitments."]}, {"page": "British Invasion", "response": ["The latest movement came in the mid-to-late 2000s when British R&B and soul artists such as Amy Winehouse, Estelle, Joss Stone, Duffy, Natasha Bedingfield, Florence Welch, Adele, Floetry, Jessie J, Leona Lewis, Jay Sean and Taio Cruz enjoyed huge success in the US charts, which led to talk of a \"Third British Invasion\" or a \"British Soul Invasion\". Boyband One Direction have also been described as being a major part of a new \"British Invasion\" due to them being the first British band to have their debut album at number-one on the US charts along with their overall dominance in America."]}, {"page": "Island Records", "response": ["Artists who have signed to Island Records include Bob Marley, Nick Drake, Queen, Jethro Tull, Grace Jones, King Crimson, Emerson, Lake & Palmer, Brian Eno, Demi Lovato, Ariana Grande, Sabrina Carpenter, Avicii, Poppy, Cat Stevens, Kevin McDermott Orchestra, Tove Lo, Sparks, the Cranberries, Tracy Bonham, Roxy Music, Bishop Briggs, Hozier, Blackbear, Pulp, Fall Out Boy, the Killers, Loser, Leona Lewis, U2, Mumford & Sons, Iggy Azalea, Amy Winehouse, Tom Waits, Ben Howard, James TW, Florence and the Machine, Sigrid, John Newman, Local H, Catfish and the Bottlemen, Sandy Denny, Disclosure, Big Shaq, the Weeknd, Keane, Annie Lennox, JP Cooper, PJ Harvey, Janet Jackson, John Martyn, Nick Jonas, KSI, Robyn, Shawn Mendes, Jessie J, Scarlxrd, Laleh, and the Streets."]}, {"page": "London Borough of Redbridge", "response": ["* Jessie J (born 1988), singer"]}, {"page": "Synth-pop", "response": ["American singer Kesha has also been described as an electropop artist, with her electropop debut single \"Tik Tok\" topping the Billboard Hot 100 for nine weeks in 2010. She also used the genre on her comeback single \"Die Young\". Mainstream female recording artists who have dabbled in the genre in the 2010s include Madonna, Taylor Swift, Katy Perry, Jessie J, Christina Aguilera, and Beyoncé."]}, {"page": "Brandy Norwood", "response": ["Norwood's vocal stylings have had a significant impact on the music industry, most notably with contemporary R&B, pop and gospel genres, where she is often subjectively referred to as the \"Vocal Bible\". Her work has influenced numerous artists, including Jessie J, JoJo, Bridget Kelly, Olivia, Ariana Grande, Emeli Sandé, Jordin Sparks, Ryan Destiny, Tank, Teyana Taylor, Lil' Mo, Megan Rochell, and Elle Varner, while Norwood's vocals have been praised by several of her peers, including Natasha Bedingfield, Missy Elliott, Jennifer Hudson, Syleena Johnson, Gladys Knight,"]}, {"page": "Fan (person)", "response": ["Celebrities have positively reacted to their \"stan\" followings. Notably, English singer-songwriter Jessie J had this to say about her stans, \"They support me and buy my albums and singles, and they stand outside hotels, and they come to shows, and they get tattoos of my lyrics and they cut their hair like me. You have to love your fans. That's why I call them my Heartbeats, because without them I wouldn't be here\". In 2012, after Jessie J broke her own leg, a stan broke her own leg to emulate the injury. The fan tracked down Jessie J's personal address and sent her a photograph of the self-inflicted injury. The singer was horrified and decided to increase her security."]}, {"page": "Extended play", "response": ["A 2019 article in Forbes discussing Miley Cyrus' decision to release her then-upcoming seventh studio album Plastic Hearts as a trilogy of three EPs stated: \"By delivering a trio of EPs throughout a period of several months, Miley is giving her fans more of what they want, only in smaller doses. When an artist drops an album, they run the risk of it being forgotten in a few weeks, at which point they need to start work on the follow-up, while still promoting and touring their recent effort. Miley is doing her best to game the system by recording an album and delivering it to fans in pieces.\" Major-label pop musicians who had previously employed such release strategies include Colbie Caillat with her fifth album Gypsy Heart (2014) being released following an EP of the album's first five tracks known as Gypsy Heart: Side A three months prior to the full album; and Jessie J's fourth studio album R.O.S.E. (2018) which was released as four EPs in as many days entitled R (Realizations), O (Obsessions), S (Sex) and E (Empowerment)."]}, {"page": "1980 in music", "response": ["*April 26 – Channing Tatum, American dancer, performer and actor (Jessie J, Jenna Dewan) "]}, {"page": "1988 in music", "response": ["*March 27 – Jessie J, English singer-songwriter"]}, {"page": "1998 in music", "response": ["*October 28 – Ellie Drennan, Australian singer-songwriter, The Voice Australia winner of series 4, Jessie J was her coach"]}, {"page": "Timeline of musical events", "response": ["**Jessie J releases her debut studio album, Who You Are"]}, {"page": "List of soul musicians", "response": ["*Jessie J"]}, {"page": "List of singer-songwriters", "response": ["* Jessie J"]}, {"page": "Black Eyed Peas", "response": ["On August 31, 2016, the Black Eyed Peas released a new version of their 2003 song \"Where Is the Love?\". The song, titled \"#WHERESTHELOVE\", is credited to \"The Black Eyed Peas featuring The World\". The song, as well as the accompanying video feature all four members of the group, will.i.am, Fergie, apl.de.ap, and Taboo, and many other popular artists such as Justin Timberlake, DJ Khaled, and Jessie J. It is the group's most recent work with Fergie, and her last live performance with them happened in 2015. On June 3, 2017, they performed at the opening ceremony of the 2017 UEFA Champions League Final in the Millennium Stadium, Cardiff, Wales. The performance, which included a pyrotechnic display, ran long and delayed the second-half kickoff by several minutes. On June 2, 2017, a Billboard article rumored that Fergie was departing from the band. will.i.am initially dismissed this, but they announced that she was taking a break from the group to work on her second solo album Double Dutchess, while the remaining members were working on the graphic novel Masters of the Sun."]}, {"page": "Mary J. Blige", "response": ["In early 2013, reports surfaced that Blige was recording a Christmas album. The album, titled, A Mary Christmas was released on October 15, 2013, through Matriarch and Verve Records, her first release with the latter. The album includes collaborations with Barbra Streisand, the Clark Sisters, Marc Anthony and Jessie J. In early December, A Mary Christmas became Blige's 12th top ten album after it rose to No. 10 in its eight week."]}, {"page": "Pinkpop Festival", "response": ["- Jessie J"]}, {"page": "We Will Rock You", "response": ["*2012: English pop singer Jessie J performed the song live with Brian May and Roger Taylor at the closing ceremony of the 2012 Summer Olympics in London on 12 August."]}, {"page": "MTV Video Music Awards", "response": ["The 2014 show was held at The Forum in Inglewood, California. Miley Cyrus won Video of the Year for \"Wrecking Ball\" and got a young homeless man named Jesse to accept the award on her behalf. His speech was a call-to-action to help raise awareness to the homeless youth of America. Ariana Grande, Nicki Minaj and Jessie J opened the show. Beyoncé closed the show by performing a 16-minute medley of songs from her self-titled fifth studio album. After the performance, her husband Jay Z and daughter Blue Ivy presented the Video Vanguard Award to her.Beyoncé's 2014 VMA Performance: Fearless, Feminist, Flawless, Family Time MTV.com, Retrieved August 25, 2014"]}, {"page": "Coco Lee", "response": ["In 2016, she competed in the fourth season of the Chinese reality show I Am A Singer, but she admitted she faded out as a singer since 2014 due to bronchitis. However, she recovered from it and participate, and eventually gone on to win the competition, making her the first non-mainland Chinese singer to win the series. Lee later returned as guest singers for two more seasons (which now rebranded with the new title Singer), on the fifth season during the biennial concert, and on the sixth season as with a guest performer for Jessie J, the eventual winner for that season."]}, {"page": "List of best-selling singles in the United States", "response": ["| Jessie J, Ariana Grande and Nicki Minaj"]}, {"page": "Whistle Down the Wind (1996 musical)", "response": ["The role of The Man was later played by Jérôme Pradon and Glenn Carter, and Swallow was played by Laura Michelle Kelly. The children's cast included Jessica Cornish (now known as Jessie J), Anne-Marie, Hannah Tointon, James Buckley, Hannah Cooper, Matthew Thomas, Jade Ewen, Jay Asforis, Sam Gillam and Cassie Compton."]}, {"page": "Stadium of Light", "response": ["On 20 June 2013 Rihanna performed a sold-out show at the stadium as part of the European leg of her Diamonds World Tour. Rihanna was scheduled to return to the stadium during her Anti World Tour, but the concert was cancelled. 2013 also saw the stadium hold the first of two 'North East Live' concerts, a music festival featuring artists such as Little Mix and Jessie J."]}, {"page": "Jounieh", "response": ["Every summer, Jounieh International Festival hosts national and international icons, like Mika, Jessie J, Imagine Dragons, Jason Derulo and many others.http://www.jouniehinternationalfestival.com/"]}, {"page": "Wolff–Parkinson–White syndrome", "response": ["* Jessie J, British musician"]}, {"page": "Music of the United Arab Emirates", "response": ["Teenage pop singer Esther Eden enjoyed significant local exposure after being handpicked by British star Jessie J to guest onstage at 2014's Redfest DXB festival. Eden was later signed by Universal Music MENA and performed as a solo artist at the same festival a year later."]}, {"page": "College of the Holy Cross", "response": ["* Spring Weekend: The Spring Weekend, organized by the Campus Activities Board (CAB), is an annual event which marks the end of classes. Always held the week before finals, events include the Spring Carnival, fireworks, and a Spring Concert. In the past, invited performers have included the Pat McGee Band (2001), Wyclef Jean (2002), Third Eye Blind (2003, 2016), Howie Day (2004), The Roots (2004), Fabolous and The Starting Line (2005), Phantom Planet (2006), Guster (2006), Lupe Fiasco (2009), Drake (2010), J.Cole and the Far East Movement (2011), and Mac Miller and Walk the Moon (2013). Nelly and The Knocks performed a sold-out show in 2014. DJ Pup Dawg opened for Jessie J in 2015.Holy Cross: CAB  In 2016, the recording artist JoJo opened for the headliner Third Eye Blind. The group Timeflies opened for T-Pain in 2017."]}, {"page": "Ronan Keating", "response": ["On 24 December 2015, Keating was announced as Ricky Martin's replacement on The Voice Australia. Keating joined Jessie J, Delta Goodrem and The Madden Brothers on the show. On 7 December 2016, Keating announced his departure from the show after one season. He was replaced by Kelly Rowland.", "On Christmas Eve 2015, during the broadcast of Carols by Candlelight on Channel 9 Australia, it was announced that Keating would be returning to Australian TV screens in 2016 as a coach on the fifth season of The Voice Australia, joining other coaches Jessie J, Delta Goodrem and The Madden Brothers."]}, {"page": "David Foster", "response": ["In 2013, Foster produced Mary J. Blige's first Christmas album A Mary Christmas released October 15 of that year. The album includes 12 classics such as swing-styled \"Rudolph the Red-Nosed Reindeer\". It also features artists Marc Anthony, Jessie J, The Clark Sisters, Barbra Streisand, and Chris Botti. Foster produced Andrea Bocelli's album, Passione, released in January 2013. The album is a collection of Mediterranean love songs featuring duets with Jennifer Lopez, Nelly Furtado, and a virtual duet with Edith Piaf.Andrea Bocelli To Release New Album 'Passione' Featuring Jennifer Lopez and Nelly Furtado."]}, {"page": "Jared Leto", "response": ["After the strong relationship between Thirty Seconds to Mars and its audience, Leto launched the social media management and digital marketing company The Hive. It is based in Studio City, Los Angeles and focuses on creative community building. In recent years, it has expanded to other artists such as Jessie J and Semi Precious Weapons. In 2010, Leto launched The One and Only Golden Tickets, a full service company which operates worldwide and manages exclusive services for concerts, festivals, and events. In 2013, the company was renamed Adventures In Wonderland."]}, {"page": "Croydon", "response": ["Croydon is home to the BRIT School for performing arts and technology, based in Selhurst, which has produced stars such as Adele, Jessie J, Amy Winehouse, Leona Lewis, Katie Melua, Katy B, Kate Nash, Imogen Heap, Rizzle Kicks, Dane Bowers and members of the Feeling & the Kooks. Independent of such institutions, Croydon is also the home of artists like Nosferatu D2, Magic Brother, Bad Sign, Cassettes and Grimecore band Caine."]}, {"page": "Dizzee Rascal", "response": ["| rowspan=\"2\"|\"Wild\" (with Jessie J & Big Sean)"]}, {"page": "McFly", "response": ["McFly confirmed that they would embark an original 18-date tour (21 later) to promote their 2012 Memory Lane: The Best of McFly album which would run from April–May. They were joined for some for these dates by James Bourne. McFly went on several writing trips for the writing stage of this album and worked with Matt Willis and Bourne in writing. Titles for songs were to be \"Hyperion\", \"Break Me\", \"We Were Only Kids\", \"Dare You To Move\", \"Hammer Ring\", \"Josephine\", \"Love Is Easy\", \"Do Watcha\", \"Cherry Cola\", \"Red\", \"Love Is on the Radio\" and \"Touch the Rain\". \"Love Is Easy\" was released as a single in 2012 while \"Do Watcha\" and \"Cherry Cola\" were both featured on Memory Lane: The Best of McFly. \"Red\" and \"Touch the Rain\" were both previewed during McFly's Keep Calm and Play Louder tour in 2012. \"Love Is on the Radio\" was previewed during McFly's 10th anniversary shows at the Royal Albert Hall in 2013. \"Love Is on the Radio\", the first single taken from their new album, was released on 24 November. The album was due to be released in the northern spring of 2014, but this has been put on hold. In the McBusted biography by Jennifer Parker it was hinted that the sixth album was abandoned in favour of the debut album of McBusted. In November 2013, the band wrote and performed the new theme tune to The Paul O'Grady Show. McFly expressed their interest in a possible collaboration with Jessie J but have made no official plans."]}, {"page": "The Big Chill (music festival)", "response": ["The Big Chill was an annual festival of alternative, dance and chill-out music and comedy, held in the grounds of Eastnor Castle during early August. The 2011 line-up included The Chemical Brothers, Kanye West, Rodrigo Y Gabriela, Jessie J, Robert Plant, Calvin Harris, Neneh Cherry, Aloe Blacc, Chipmunk, Katy B & Example. The festival has not been staged since 2011.", "2011 Eastnor Castle: The Chemical Brothers, Kanye West, Rodrigo y Gabriella, Empire of The Sun, Jessie J, Robert Plant & The Band of Joy, Neneh Cherry, Metronomy, Warpaint, Wild Beasts, Bullitts, Femi Kuti & The Positive Force, Norman Jay, Ariel Pink's Haunted Graffiti, Crystal Fighters..."]}, {"page": "Max Martin", "response": ["===Jessie J===", "Max Martin first worked with Jessie J on her international hit \"Domino\".Lane, Dan. (2 January 2013) The Official Top 40 Biggest Selling Singles Of 2012 revealed!. Officialcharts.com. Retrieved on 2 January 2017. It also achieved top ten success in other countries such as Canada and Australia. Following the success of \"Domino\", Martin co-produced \"Bang Bang\" (2014) for Jessie J,  Ariana Grande and Nicki Minaj."]}]}}