{"wiki_id": "http://www.wikidata.org/entity/Q18810690", "itemLabel": "Edwin Cooper", "itemDescription": "British architect", "wikipedia_url": "https://en.wikipedia.org/wiki/Edwin_Cooper_(architect)", "wikipedia_page": {"main": "Sir Thomas Edwin Cooper RA FRIBA (21 October 1874 – 24 July 1942) was an English architect. His work has been described as \"essentially Classical, and sometimes powerfully Baroque.\"\n\n", "link_mentions": [{"page": "1942", "response": ["* July 24 – Edwin Cooper, British architect (b. 1874)"]}, {"page": "Thurrock", "response": ["thumb|right|The State Cinema in 2007 There are a number of examples of Art Deco architecture in Thurrock. The baggage hall at Tilbury was opened in 1930. It has an art deco interior, designed by Sir Edwin Cooper and is a grade II listed building. The State cinema is also a listed building and dates from 1938. It is one of the few surviving examples of 1930s cinema architecture. It has the original cinema organ which can still be played. However, in the early 21st century the building became disused and faced dereliction. In September 2015 it was announced that J D Wetherspoon had bought the property for conversion to a public house. Building of the Bata Shoes estate in East Tilbury was begun in 1933, and this is now a conservation area."]}, {"page": "Metropolitan Borough of St Marylebone", "response": ["Following a competition in 1911, Sir Edwin Cooper was commissioned to design Marylebone Town Hall. The building, in Marylebone Road was built 1914–20. The building is faced with Portland stone and is an example of Edwardian Graeco-Roman classicism, with a tower in the style of Christopher Wren and fluted columns. Cooper also designed the 1938–39 extension in a simpler style to house the public library.Nikolaus Pevsner, The Buildings of England – London except the Cities of London and Westminster, Harmondsworth, 1952"]}, {"page": "Lloyd's building", "response": ["The first Lloyd's building (address 12 Leadenhall Street) had been built on this site in 1928 to the design of Sir Edwin Cooper. In 1958, due to expansion of the market, a new building was constructed across the road at 51 Lime Street (now the site of the Willis Building). Lloyd's now occupied the Heysham Building and the Cooper Building."]}, {"page": "1874 in architecture", "response": ["*October 21 – Edwin Cooper, English architect (died 1942)"]}, {"page": "1942 in architecture", "response": ["* July 24 – Sir Edwin Cooper, English architect (born 1874)"]}, {"page": "1931 in architecture", "response": ["* RIBA Royal Gold Medal – Edwin Cooper."]}, {"page": "Leadenhall Street", "response": ["12 Leadenhall Street - a stone arch is all that remains of the former Lloyd’s Building, which was built in 1928 and demolished in 1979. The arch was designed by Sir Edwin Cooper in 1922 as a war memorial for the Lloyd’s Rooms at the Royal Exchange, and moved to Leadenhall Street in 1928. From 1729 to 1861 this site was occupied by East India House."]}, {"page": "Royal Gold Medal", "response": ["|Sir Edwin Cooper"]}, {"page": "Architecture of London", "response": ["File:London 12 2002 5070.JPG|Port of London Authority Building (1912‒1922) by Edwin Cooper, an opulent example of the Beaux-Arts style."]}, {"page": "South London Hospital for Women and Children", "response": ["After the First World War, the hospital expanded, with new departments being added for dermatology (1922) and urology (1924). Radium treatment for cancer was performed between 1924 and the opening of the specialist Marie Curie Hospital in Hampstead in 1929. The hospital buildings were enlarged when the imposing Wrennaissance Baroque style frontage building (designed by leading 20th-century architect Sir Edwin Cooper – architect of the Port of London HQ opposite the Tower of London and another grand hospital building in Greenwich which is of a very similar style) was opened in 1929. Only 3/4 of this building was completed leaving the southern end-pavilion missing creating an unsightly gap for the remainder of the 20th Century. Further extensions were completed in the 1950s. By the 1930s, however, the need for wholly female-staffed hospitals to provide positions for women had reduced greatly, as equality of career opportunities for women in mainstream, mixed-staffed hospitals started to emerge, and the future of such hospitals began to be called into question. Although several women-only hospitals began to admit men during the 1930s, the South London Hospital's fundraising was sufficiently effective to allow it retain its original staffing policy. The terms of its founding donation were so strict that Chadburn claimed an Act of Parliament had been required for male soldiers to be treated during the Second World War (cited by Elston).", "The original hospital building was by leading architect Sir Edwin Cooper, and has been described as a 'most impressive landmark building and a good example of neo-classical 1920s architecture'.Bird E. (1998) 'Appeal decision: demolition of unlisted historic buildings in a conservation area rejected' Context 59: 21 (accessed 21 August 2007)"]}, {"page": "Pavilion Theatre, Bournemouth", "response": ["By the 1920s, the orchestra felt that the Bournemouth Winter Gardens was no longer a suitable venue and requested a more accommodating hall be built. In 1923, a competition was held to design the concert room, chaired by Edwin Cooper. The winners were by G Wyville Home and Shirley Knight, whose design was consulted with Owen Williams. Construction began in September 1925 with the laying of the foundation stone.(FROM OUR SPECIAL CORRESPONDENT.). \"Music Pavilion For Bournemouth.\" Times, 24 Sept. 1925, p. 10. The Times Digital Archive, https://link.gale.com/apps/doc/CS168892728/TTDA?u=kccl&sid=TTDA&xid=344faf91. Accessed 3 Mar. 2020. On 19 March 1929, the building was opened by the Duke of Gloucester. It had cost £250,000.\"Royal Visit To Bournemouth.\" Times, 18 Mar. 1929, p. 11. The Times Digital Archive, https://link.gale.com/apps/doc/CS187113586/TTDA?u=kccl&sid=TTDA&xid=bc097687. Accessed 3 Mar. 2020."]}, {"page": "The Twentieth Century Society", "response": ["*The catalyst for establishing the society in 1979 was the proposal to replace Sir Edwin Cooper's classical 1928 building for Lloyd's of London with a new building by Richard Rogers. The society's protests were too late, and Rogers' Lloyd's building was completed in 1986 (and was itself listed Grade I in 2011)."]}, {"page": "Scarborough College", "response": ["The foundation stone for Scarborough College was laid in 1898, and the school opened on 18 September 1901. The building was designed by Edwin Cooper and later became Grade II listed. By 1907, the school had 70 boys. Following the German Navy's Raid on Scarborough, Hartlepool and Whitby in December 1914, the headmaster decided Scarborough was too unsafe for pupils so the school evacuated to Park Hotel, Keswick for a year. During World War II, pupils were evacuated to Marske Hall, Swaledale, from 1940 to 1946. The Royal Air Force (RAF) commandeered the school site and used it as the base of No. 17 Initial Training Wing, which provided basic training in aircraft mechanics, navigation, meteorology, drill, and physical fitness. Among the trainees who graduated No. 17 ITW was Michael Beetham, later Chief of the Air Staff during the Falklands War."]}, {"page": "Guildhall, Kingston upon Hull", "response": ["The current guildhall, which was designed by Sir Edwin Cooper to accommodate the civic offices and law courts, was built by Quibell, Son & Green of Hull between 1906 and 1914. The eastern end of the current guildhall lies on the site of Brodrick's guildhall. The main frontage on Alfred Gelder Street was built with a central feature flanked by two long colonnades with pavilions at either end. Large sculptures by Albert Hodge, one of a female figure on a boat drawn by seahorses and the other of a figure in a chariot flanked by lions, were placed on each of the pavilions. A clock built by Cooke and Johnson was transferred from Brodrick's guildhall to the new building."]}, {"page": "List of city and town halls in England", "response": ["|Grade II* listed ().Architect: Edwin Cooper.", "|Grade II* listed ().Architect: Sir Edwin Cooper."]}, {"page": "10 Trinity Square", "response": ["The Beaux Arts structure was designed by Sir Edwin Cooper and built by John Mowlem & Co in 1912–22 as the new headquarters of the Port of London Authority. It was opened by David Lloyd George, then the British Prime Minister, in 1922, in the presence of the architect and Lord Devonport, the Authority's first chairman. At the time, it was one of the city's tallest buildings."]}, {"page": "Royal Star and Garter Home, Richmond", "response": ["The Royal Star and Garter Home on Richmond Hill, in Richmond, London, was built between 1921 and 1924 to a design by Sir Edwin Cooper, based on a plan produced by Sir Giles Gilbert Scott in 1915,  to provide accommodation and nursing facilities for 180 seriously injured servicemen."]}, {"page": "Hope Bagenal", "response": ["Bagenal, known by his second name, Hope, was born in Dublin, but the family moved to England when he was two years old. He attended various schools as his father moved first to the North, and then to East Anglia, finishing at Uppingham School. From 1905 to 1909 he studied engineering at Leeds University, but left without qualifying. He then joined an architectural practice in London and studied at the Architectural Association. In 1911 Bagenal joined Edwin Cooper and worked on the Port of London Authority building."]}, {"page": "List of Royal Academicians", "response": ["| Edwin Cooper   ||align=\"center\" |  1937  || Treasurer 1940–42"]}, {"page": "Edwin Cooper", "response": ["Edwin Cooper may refer to:", "* Edwin Cooper (architect) (1874–1942), English architect", "* Edwin Cooper (artist) (1785–1833), English artist"]}, {"page": "List of officers of the Royal Academy of Arts", "response": ["|Edwin Cooper ||5 Dec 1940 – 24 Jun 1942"]}, {"page": "1923 New Year Honours", "response": ["* Thomas Edwin Cooper, , Architect of Port of London Authority's new buildings."]}, {"page": "Sybil Cooper", "response": ["Sybil Cooper, daughter of the distinguished architect Sir Edwin Cooper, was born in London, England, in January 1900. She attended Girton College, Cambridge and took the Natural Sciences Tripos in 1922. She became a research assistant upon graduation to Edgar Adrian, studying nerve and muscle physiology, before receiving her Ph.D in 1927. Cooper then became a research student and then a research fellow at St Hilda's College, Oxford with the physiologist Charles Scott Sherrington while working as a demonstrator in anatomy for the University of Oxford. During this time, she married R. S. Creed in 1933; he was a demonstrator in physiology. She resigned her position in 1934 and had the first of her four children the following year. Able to afford household help, she took an unpaid position as a lecturer in natural science at St. Hilda's in 1940 and received a paid position as a research fellow there in 1946 that she maintained until her retirement in 1968. She was killed in an automobile accident in 1970.Ogilvie & Harvey, pp. 592–93"]}, {"page": "Thomas Edwin Cooper", "response": ["#REDIRECT Edwin Cooper (architect)"]}, {"page": "Jessica Mary Albery", "response": ["As there was little work available at the time when she completed her training, she began her career by observing buildings under construction in the City of London, in particular Sir Edwin Cooper's Royal Mail Office. At this time she worked for several months with her fellow student and friend Judith Ledeboer. During the 1930s she worked as an architect in Ledeboer's office and also in that of another former Architectural Association student, Judith Townsend. It was in this period that she designed and built five chalk pisé houses, influenced by the Arts and Crafts style, near Andover, Hampshire; these were built by local labourers under a foreman supervised by Albery, drawing on her experience of working on building sites."]}, {"page": "Marylebone Town Hall", "response": ["The foundation stone for the new building was laid by the Princess Royal on 8 July 1914. The new building was designed by Sir Edwin Cooper in the Edwardian Graeco-Roman classicist style and built by Messrs John Greenwood. After a pause in construction caused by the First World War, it was officially opened by Prince Albert on 27 March 1920. The design involved a symmetrical main frontage with 13 bays facing onto Marylebone Road; the central section of five bays featured a two-storey tetrastyle portico with full height Corinthian order columns; the doorway was flanked by windows on the ground floor; there were further windows on the first floor and smaller windows on the second floor; a colonnaded tower was erected on the roof."]}]}}