{"wiki_id": "http://www.wikidata.org/entity/Q18808371", "itemLabel": "Thomas Blanco White", "itemDescription": "British lawyer (1915-2006)", "wikipedia_url": "https://en.wikipedia.org/wiki/Thomas_Blanco_White", "wikipedia_page": {"main": "Thomas Anthony Blanco White QC (19 January 1915 – 12 January 2006) was a British patent  lawyer, and an inductee to the IP Hall of Fame in 2010. He was described in his Times obituary as \"the best intellectual property lawyer to have practised in England since Fletcher Moulton\" and \"cultured, straight-talking lawyer who was without peer on intellectual property issues.\"", "link_mentions": [{"page": "Thomas White", "response": ["* Thomas Blanco White (1915–2006), British patent lawyer"]}, {"page": "Maud Pember Reeves", "response": ["She was a conscientious grandmother, her grandchildren included architect Margaret Justin Blanco White and Thomas Blanco White. She nursed both William and her sister through their final illnesses. Amber described her mother as \"serious-minded\" and \"obviously chaste to the last degree\". Her focus on the needs of others was as austere as her prose, but the unflinching eye for detail and clamour of voices in Round about a Pound a Week dramatized both the \"almost intolerable conditions\" of women's daily lives and Fabian feminism's response."]}, {"page": "List of patent attorneys and agents", "response": ["*Thomas Blanco White, British patent lawyer; inductee to the IP (Intellectual property) Hall of Fame in 2010"]}, {"page": "List of Old Greshamians", "response": ["*Thomas Blanco White QC, British patent lawyer", "*Thomas Blanco White – patent barristerThomas Blanco White, obituary in The Times online, 2006"]}, {"page": "Justin Blanco White", "response": ["Margaret Justin Blanco White was born at 30 Pembroke Square, Kensington, London, on 11 December 1911. Her father was George Rivers Blanco White KC, and her mother the writer Amber Reeves. Her brother was Thomas Blanco White, an intellectual property lawyer. She had an older half sibling Anna-Jane whose father was H.G. Wells. Her maternal grandparent were William Pember Reeves and Maud Pember Reeves."]}, {"page": "G. R. Blanco White", "response": ["On 7 May 1909, he married Amber Reeves, feminist writer, scholar and campaigner. She was the daughter of William Pember Reeves and his wife Maud Pember Reeves. She bore a daughter Anna-Jane in December that year whose biological father was the author H.G. Wells (though Blanco White was Anna's legal father). The Blanco-Whites later had daughter Margaret Justin Blanco White (1911–2001), who became an architect, and a son Thomas Blanco White (1915–2006), a patent lawyer. Through Margaret he was the grandfather of anthropologist Caroline Humphrey and mathematician Dusa McDuff."]}]}}