{"wiki_id": "http://www.wikidata.org/entity/Q18813188", "itemLabel": "Edward Owen Greening", "itemDescription": "British co-operator and radical activist", "wikipedia_url": "https://en.wikipedia.org/wiki/Edward_Owen_Greening", "wikipedia_page": {"main": "Edward Owen Greening (17 August 1836 – 5 March 1923) was a British co-operative and radical activist.\nBorn in Warrington, Greening grew up in Bedford, Lancashire and then Manchester, as his father's wire-drawing business moved location.  He was educated at a Quaker school on Mount Street in Manchester, but left when he was thirteen years old, to become an apprentice wire-drawer.  Three years later, he was promoted to an office position, and he began taking evening classes.  Greening's father emigrated to Canada in 1855, and Greening took the opportunity to start his own wire-drawing business with a brother.  This proved successful.From an early age, Greening became involved in local radical causes, including the Anti-Slavery Society, the United Kingdom Alliance, and the Union and Emancipation Society.  In particular, he became joint honorary secretary of the last of these, and lectured around the country in support of its aim, supporting the north in the American Civil War.  He was a founder of the Manchester and Salford Manhood Suffrage League - the local section of the Reform League - and also became interested in co-operation, beginning to incorporate the ideas into his own business.  He also helped fund a significant number of co-operative ventures, most of which proved unsuccessful.  The key exception was the Agricultural and Horticultural Association, also known as the \"One and All Association\", which provided agricultural tools, seeds, and related items.In 1867, Greening became the founder and editor of Industrial Partnership Record, which the following year became Social Economist, Greening then sharing editing duties with G. J. Holyoake.  That year, he also organised a national conference of co-operative activists, in Manchester, the immediate predecessor of the modern Co-operative Congress.Greening stood in Halifax at the 1868 UK general election, with the backing of a local committee of radical workers.  Although he did not receive the backing of the Reform League, its local branch did support his candidacy.  However, he was easily defeated by two official Liberal Party candidates.Later in 1868, Greening moved to London, to become managing director of the One and All.  His wire-drawing business collapsed in 1870, and he thereafter remained focused on his co-operative interests.  He founded the Co-operative Institute and the annual National Co-operative Festival.  He was a founder of the International Co-operative Alliance, chairing its first conference, and was its secretary from 1895 until 1902.  He was also a founder of the Co-operative Productive Federation, and the Labour Association.The One and All closed in 1915, its business affected by World War I, and this left Greening short of money.  Co-operative societies twice organised testimonial funds for him, and he remained active in the movement.  In 1917, he moved the motion opposing the formation of the Co-operative Party, as he believed that the movement should be represented through existing political parties. By the autumn of 1917 he had changed his mind and at the party's emergency conference he said that \"after the great vote at Swansea he recognised that it was necessary that the experiment should be made in direct representation\".Greening married twice, the first in 1860 to Emily Hepworth. Greening died at his home in Lee, London on 5 March 1923 and was buried in Hither Green Cemetery.", "link_mentions": [{"page": "International Co-operative Alliance", "response": [":1895: Edward Owen Greening"]}, {"page": "Aspatria Agricultural Cooperative Society", "response": ["In 1869, a quantity of artificial ‘turnip’ manure priced at £7.50p per ton arrived in the Aspatria district. Of the recipients John Twentyman of Hawkrigg Farm, and William Norman of High Close, bought 5 tons and 2 tons respectively. Norman, a qualified chemist,West Cumberland Times 5 March 1910 doubted the integrity of the declared chemical properties and sought verification from former colleague, Thomas Anderson, of Glasgow University. Anderson confirmed Norman's suspicions, as the manure contained only 13 per cent of soluble phosphates with a value of £2 50p per ton.Carlisle Journal 4 October 1869  In the meantime, Twentyman, acting independently applied the manure to a field of turnips and experienced disappointing results. The two neighbours met through the intermediary of local veterinary surgeon Henry Thompson MRCVS who suggested they form an Agricultural Society at Aspatria, with the primary aim of initiating an annual Agricultural Show. It was during a speech at the inaugural show dinner, in September 1869, that Sir Wilfrid Lawson, 2nd Baronet of Brayton advised local farmers to follow his example and join the Agricultural and Horticultural Association, established by Edward Owen Greening at Manchester two years earlier.Carlisle Journal 28 September 1869 Twentyman took the initiative one stage further and organised a meeting of local landlords and tenant farmers with a view of establishing a small company for buying fertilisers and feed stuff at a guaranteed quality. At a meeting on 24 January 1870, twenty members agreed to draw up a list of rules, adopt a motto ‘each for all and all for each’, appoint Henry Thompson as secretary, on an initial salary of £65 per annum, and to purchase 160 subscription shares at £1 each.Carlisle Journal 3 December 1869 On 14 April the society, the first of its kind in Cumberland, registered the company under the Industrial and Provident Societies Act 1893."]}, {"page": "William Henry Brown (journalist)", "response": ["Brown had known leading members of the co-operative movement from an early age, through his father. He worked with Edward Owen Greening to form the International Co-operative Alliance, and from 1895 to 1916 worked for the Co-operative News, for most of the time as its London correspondent. He then moved to Manchester to work in the publicity department of the Co-operative Wholesale Society, as editor of the Producer, also working on writing histories of several local co-operative societies."]}, {"page": "Edward Greening", "response": ["#REDIRECT Edward Owen Greening"]}]}}