{"wiki_id": "http://www.wikidata.org/entity/Q18877209", "itemLabel": "Henry Langhorne Thompson", "itemDescription": "English army officer", "wikipedia_url": "https://en.wikipedia.org/wiki/Henry_Langhorne_Thompson", "wikipedia_page": {"main": "Harry Langhorne Thompson, CB (21 September 1829 – 13 June 1856) was a British Army officer.\nThompson was born at the cottage, Clumber Park, the son of Jonathan Thompson of Sherwood Hall, Nottinghamshire, receiver-general of crown rents for the northern counties, by his wife Anne, daughter of Colonel Ralph Smyth, Royal Artillery. His brother Sir Ralph Wood Thompson was later Permanent Under-Secretary of State for War.\nThompson was educated at Eton College, and on 20 December 1845 received the commission of ensign in the East Indian Company's army. On 20 August 1846 he was appointed to the 68th Bengal Native Infantry, and on 12 February 1850 was promoted lieutenant. He took part in the Second Anglo-Burmese War in 1852 and 1853, receiving a wound which necessitated his return to England. For his services he received the Pegu medal. \nIn 1854 he volunteered in the Turkish Army, received the rank of major, and, after visiting the Crimea, proceeded to Kars, where he arrived in March 1855. Under the command of Colonel Fenwick Williams, he gave important assistance in strengthening the fortifications. He distinguished himself in repelling the Russian assault on 29 September, crushing the Russian columns by his fire from Arab Tabia. His bravery won the admiration of the besiegers, and, on the surrender of Kars in November, Nikolay Muravyov-Karsky, the Russian commander, returned him his sword. On 9 November he was appointed captain unattached in the British Army; on 7 February 1856 he received the third class of the Turkish Order of the Medjidie; and on 10 May was nominated an honorary CB. \nHe died unmarried at 70 Gloucester Street, Belgrave Road, on 13 June 1856, immediately after his return from Russia, where he had been detained a prisoner of war. He was buried in Brompton Cemetery. A mural tablet by George Gammon Adams was erected to his memory in St. Paul's Cathedral by public subscription. His letters, which give an account of the siege of Kars, were published in Lake's ‘Kars and our Captivity in Russia’ (2nd ed. 1856).", "link_mentions": [{"page": "George Gammon Adams", "response": ["*Monument to Captain Henry Langhorne Thompson (1856) in St Paul's Cathedral"]}, {"page": "Ralph Wood Thompson", "response": ["Thompson was the son of Jonathan Thompson of Sherwood Hall, Nottinghamshire, receiver-general of Crown rents for the northern counties, by his wife Anne, daughter of Ralph Smyth, colonel in the Royal Artillery. A brother, Captain Henry Langhorne Thompson, gained fame for his part in the defence of Kars."]}, {"page": "Harry Langhorne Thompson (Army officer)", "response": ["#REDIRECT Henry Langhorne Thompson"]}]}}