{"wiki_id": "http://www.wikidata.org/entity/Q18921938", "itemLabel": "Ian Thomson", "itemDescription": "travel writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Ian_Thomson_(writer)", "wikipedia_page": {"main": "Ian Thomson (born 1961) is an English author, best known for his biography Primo Levi (2002), and reportage, The Dead Yard: Tales of Modern Jamaica (2009)", "link_mentions": [{"page": "Yukio Mishima", "response": ["That same year, he wrote , a humorous story about a man who, after failing to commit suicide, advertises his life for sale. In a review of the English translation, novelist Ian Thomson called it a \"pulp noir\" and a \"sexy, camp delight,\" but also noted that, \"beneath the hard-boiled dialogue and the gangster high jinks is a familiar indictment of consumerist Japan and a romantic yearning for the past.\""]}, {"page": "Lloyd Bradley", "response": ["Bradley's Bass Culture (2001) is a book on reggae music. He was associate producer of the BBC2 series Reggae: The Story of Jamaican Music. His most recent book is Sounds Like London: 100 Years of Black Music in the Capital, which was published to positive reviews in 2013.Ian Thomson, \"Sounds Like London by Lloyd Bradley, review\" (\"a lively history of the enduring impact of black music on British life\"), The Telegraph, 22 September 2013.Sukhdev Sandhu, \"Sounds Like London by Lloyd Bradley – review\" (\"A welcome homage to London's black musicians covers the styles that other surveys miss\"), The Guardian, 22 August 2013.Margaret Busby, \"Book review: Sounds Like London: 100 Years Of Black Music In The Capital, By Lloyd Bradley\" (\"This survey of the capital's black music-makers is not just a fine anthology but also social history\"), The Independent, 20 September 2013.Bim Adewunmi, \"Sounds Like London by Lloyd Bradley: An intensive, lovingly written account of 100 years of black music in the capital\", New Statesman, 22 August 2013."]}, {"page": "Houngan", "response": [". Houngans are responsible for keeping the vitality of Haitian Vodou alive and adapting it to 21st century needs. Author Ian Thomson stated that a \"voodoo priest is usually an astute businessman,\" proving that both the houngan and the Haitian Vodou religion are flexible and able to adapt to their changing environments to survive."]}, {"page": "If This Is a Man", "response": ["Levi began to write in February 1946, with a draft of what would become the final chapter recording his most recent memories of Auschwitz. According to Ian Thomson, Levi worked over the next ten months with concentrated energy and extreme facility. Levi told him that the words poured out of him \"like a flood which has been dammed and suddenly rushes forth\".Thomson (2003), p.229. In the daytime Levi was working at a paint factory north-east of Turin. Mostly he wrote in the evenings and late into the night, although Levi said that the chapter The Canto of Ulysses was written almost entirely in a single, half-hour lunch break.Thomson, pp.226 and 230—231. The first manuscript was completed in December 1946 and required considerable editorial work. His future wife, Lucia Morpurgo, helped him to shape the book, giving it a clear sense of direction.Thomson (2003), p.241."]}, {"page": "Claudia Jones", "response": ["* Ian Thomson, \"Here To Stay\", article on Donald Hinds, referencing Claudia Jones."]}, {"page": "Edward Stanford Travel Writing Awards", "response": ["*  Ian Thomson, The Dead Yard"]}, {"page": "Charlie Phillips (photographer)", "response": ["Accompanying the publication of a limited-edition book of the same title (successfully funded by Kickstarter),Eddie Otchere, \"Charlie Phillips presents How Great Thou Art\", Kickstarter. How Great Thou Art has been called \"a new landmark in British photography. The question of life and death and the cultural responses to death through funerals in the Caribbean community has featured sporadically in various photographic oeuvres before but no one has explored this subject in such depth and in such a participatory and embedded manner as evidenced by Charlie Phillips.\"Paul Goodwin, \"The Art of Charlie Phillips\", foreword in How Great Thou Art: Fifty Years of African Caribbean Funerals in London, King/Otchere Productions, 2014. In The Spectator, Ian Thomson wrote: \"In Phillips’s moving and often beautiful images, dating from 1962 to the present, the bereaved are seen to face the mystery of the end of life in stush black suits, spidery hat veils, Rastafari head-ties, spiffy trilbies and strictly-come-dancehall white socks.... Anyone feeling a bit like death in the run-up to Christmas should invest in a copy of How Great Thou Art — and feel revivified.\"Ian Thomson, \"Death wears bling: the glory of London’s Caribbean funerals\" , The Spectator, 29 November 2014."]}, {"page": "Béla Zsolt", "response": ["English writer Ian Thomson has written:"]}, {"page": "Ian Thomson", "response": ["Ian Thomson may refer to:", "*Ian Thomson (colonial administrator) (1920–2008), British colonial administrator in Fiji and Administrator of the British Virgin Islands", "*Ian Thomson (cricketer) (1929–2021), English cricketer who played five Test matches", "*Ian Thomson (rugby union) (1930–2014), Scottish rugby union player", "*Ian Thomson (Australian rules footballer) (born 1949), former VFL and WAFL player", "*Ian Thomson (rugby league) (born 1956), Australian rugby league footballer and administrator", "*Ian Thomson (writer) (born 1961), English author", "*Ian Thomson (umpire) (born 1963), Australian-born cricket umpire who represents Hong Kong", "*Ian Thomson (architect) (fl. 1978–1988),  New South Wales Government Architect"]}, {"page": "Heinemann Award", "response": ["*2003 Primo Levi by Ian Thomson"]}, {"page": "The Almost Nearly Perfect People", "response": ["* Ian Thomson of The Guardian described the book as \"informative, if strenuously humorous\", but felt that Booth's \"schoolboy humour\" was at times \"pretty embarrassing\"."]}, {"page": "Ian Thomson (author)", "response": ["#REDIRECTIan Thomson (writer)"]}, {"page": "Miguel Cullen", "response": ["Cullen's poetry has been described as imagistic, inflected with urban vernacular, and preoccupied with iconic film and urban music references to create a delicate, interconnected world. The critic Ian Thomson (writer) compared him to Ezra Pound,   citing his \"allusions from Greek mythology (colliding) with sound system culture (and) pavement pounding street demotic\". The poet Simon Barraclough"]}, {"page": "Donald Hinds", "response": ["Between 1959 and 1963 Hinds was also broadcasting on BBC Caribbean, often reading short stories based on his experiences working on the buses. After The Observer published a piece by him on West Indians schoolchildren in Britain, he was approached by a literary agent, which led to the commissioning of a book by Heinemann. Receiving an advance of £100 — the equivalent at the time of eight weeks’ wages as a bus conductor — Hinds was emboldened to leave his job with London Transport to concentrate on his writings, and Journey to an Illusion: The West Indian in Britain — a series of interviews, together with autobiographical writing and social comment — was first published in 1966. \"One of the great works of journalism to have come out of the Jamaican-British encounter\",Ian Thomson, \"‘Mother Country: In the Wake of a Dream’, by Donald Hinds. ‘When I Came to England’, edited by Z. Nia Reynolds\", Financial Times, 15 April 2015. the book was reissued in 2001 by Bogle-L'Ouverture Press and, in the words of Anne Walmsley, \"Journey to an Illusion remains a classic of the West Indian immigrant experience.\"Walmsley (1992), p. 237.", "In 2014 Hansib published his first novel, Mother Country: In the Wake of a Dream, set in Brixton in the 1950s and dealing with the dreams and realities lived by Jamaicans who settled in the \"Mother Country\" during that era.Adwoa Korkoh, \"Donald Hinds: Keeping the memories alive\", Angela Cobbina, 9 October 2014. Describing it as \"an absorbing hybrid of fiction and reportage\" in a Financial Times review, Ian Thomson says: \"Mother Country, a work of documentary authenticity and rare narrative verve, takes us to the heart of the West Indian immigrant experience in postwar London.\""]}, {"page": "Life for Sale", "response": ["Writing for the Evening Standard, Ian Thomson gave the novel a rave review, calling it \"a sexy, camp delight. Beneath the hard- boiled dialogue and the gangster high jinks is a familiar indictment of consumerist Japan and a romantic yearning for the past.\""]}, {"page": "Kerry Young (author)", "response": ["Young took up fiction while still a full-time youth work consultant, beginning her first novel, Pao, in 2003.Wacker, Julian, \"Outside the Boxes: An interview with Kerry Young\", Wasafiri, Vol. 32, No. 4, December 2017, pp. 23–27. Eventually published in 2011 by Bloomsbury, Pao was shortlisted for the Costa First Novel Award, the East Midlands Book Award and the Commonwealth Book Prize.\"Kerry Young\" at SI Leeds Literary Prize. The story is told in the voice of the book's Chinese-Jamaican main protagonist, Pao,Prater, Tzarina T. (2014), \"'We are Jamaicans. We are Brothers': History, Brotherhood, and Independence in Kerry Young’s Pao\", Anthurium: A Caribbean Studies Journal, Vol. 11, Issue 2, Article 5. and as described by Stevie Davies in The Guardian, \"Kerry Young's heartfelt, sparky and affecting debut novel is a chronicle of multicultural Jamaica, both in its cultural richness and in its strife and tensions. The first-person narrator, writing in a version of local patois, is of Chinese descent, belonging to a community of Chinese immigrants that began in the mid 19th century and came to be resented by black inhabitants in proportion to its business success. ...Young's is a narrative of confusion and conflict, both in the political world and within the self. ...The complexity of Jamaican society in Pao is fascinating and bewildering.\"Davies, Stevie (23 September 2011), \"Pao by Kerry Young - review | A vivid portrayal of the complexities of Jamaica's violent underworld\", The Guardian. For James Urquhart in The Independent, \"Kerry Young's energetic debut novel is a pacy but absorbing saga of domestic struggle and gangland manoeuvring set against the violent backdrop of postwar Jamaican politics.\"Urquhart, James, \"Pao, By Kerry Young – The gangster who just wants to be loved\", The Independent. Writing in The Observer Ian Thomson stated that Pao \"confirms Young as a gifted new writer. Her novel is a blindingly good read in parts, both for its mesmeric story-telling and the quality of its prose.\""]}, {"page": "Alexander Larman", "response": ["Writing in The Times, Matthew Denison writes, of Blazing Star, that \"Larman is at pains to rescue his subject from his status as one-dimensional bad boy ... He mostly succeeds,\" praising the book as \"engagingly partisan and elegantly informative.\"Dennison, Matthew Blazing Star by Alexander Larman, The Times, 28 June 2014 In The Guardian, Ian Thomson states that though \"The biography is not without its faults ...  Larman takes us through the high adventure of Rochester's life and loves\" and \"paints a picture of a great poet who flared brightly before burning out.\"Thomson, Ian Blazing Star: The Life and Times of John Wilmot, Earl of Rochester review – the wild man of the Restoration, The Guardian, 20 July 2014"]}]}}