{"wiki_id": "http://www.wikidata.org/entity/Q1899423", "itemLabel": "John Gale", "itemDescription": "British poker player", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Gale_(poker_player)", "wikipedia_page": {"main": "John Gale (13 December 1953 – 18 November 2019) was an English professional poker player based in Bushey, Hertfordshire.\nGale started playing Texas hold 'em in mid-2004. He first made a name for himself by qualifying for the World Poker Tour (WPT) 2005 PokerStars Caribbean Poker Adventure tournament in The Bahamas in an online satellite tournament. He went on to win the first place prize of $890,600, outlasting a 461 player field in his first major live tournament.\nUpon returning to his management consultant job, he found less of an interest in day-to-day activities and sold the business to concentrate on poker full-time.\nGale finished in the money on the European Poker Tour the next month, and finished in the money four times during the 2005 World Series of Poker, including a second-place finish to Brian Wilson in the $5,000 pot limit hold 'em event. He also made it through to day 2 of the $10,000 no limit hold 'em main event.\nAt the 2006 WSOP, Gale won Event #29 (a $2,500 Pot Limit Hold'em event) when his K♣ 9♠ defeated Maros Lechman's A♠ 6♠ on a board of T♣ 9♦ 7♣ 5♠ 2♣ in the final hand. Gale was awarded $374,849 along with a WSOP bracelet.\nDuring the 2015 WSOP, Gale won Event #18 (a $1,000 Turbo No Limit Hold'em event). He secured the victory over Gary Luther in heads-up play when he was re-raised all in pre-flop holding 2♣ 2♥ versus Luther's A♣ 3♠. Gale called and the board ran out 8♥ 4♥ 4♦ 10♠ 9♣ giving him the winning hand. He was awarded $298,290 and his second WSOP bracelet.\nAs of 2015, his total live tournament winnings exceed $3,600,000. His 10 cashes as the WSOP account for $954,900 of those winnings.Gale died on 18 November 2019 at the age of 65.", "link_mentions": [{"page": "World Poker Tour", "response": ["| John Gale"]}, {"page": "Bushey", "response": ["*John Gale, poker player"]}, {"page": "Mike Tindall", "response": ["During his recuperation from another injury in 2005, Tindall entered the British Poker Open tournament, finishing in 3rd place in his heat before being eliminated by John Gale. On 18 November 2006, Tindall made his first Guinness Premiership start of the season against third-placed Wasps. Troubled by a calf injury into the 2006/07 season, he made only two appearances as a replacement, against Worcester and Irish. Tindall came back from his injury however with a much more highly rated run of form. "]}, {"page": "2005 World Series of Poker", "response": ["| John Gale"]}, {"page": "Joe Hachem", "response": ["Also in the 2006 World Series, Hachem finished fourth in the $2,500 pot limit hold'em tournament, which had a starting field of 562 players. In the final table, Hachem eliminated Lee Grove with a pair of kings and Alex Jacob with three queens. But Hachem was eliminated after once again taking a bad beat on the river. He moved all in against John Gale with  on a , against Gale's . Gale eliminated Hachem after catching an ace of spades on the river. Hachem earned $90,482 for the fourth-place finish, and Gale eventually won the tournament."]}, {"page": "World Poker Tour season 3 results", "response": ["| 1st || John Gale || $890,000"]}]}}