{"wiki_id": "http://www.wikidata.org/entity/Q189119", "itemLabel": "E. M. Forster", "itemDescription": "English novelist (1879-1970)", "wikipedia_url": "https://en.wikipedia.org/wiki/E._M._Forster", "wikipedia_page": {"main": "Edward Morgan Forster  (1 January 1879 – 7 June 1970) was an English fiction writer, essayist and librettist. Many of his novels examine class difference and hypocrisy, including A Room with a View (1908), Howards End (1910) and A Passage to India (1924). The last brought him his greatest success. He was nominated for the Nobel Prize in Literature in 16 separate years.", "link_mentions": [{"page": "Anthony Hopkins", "response": ["In 1992, Hopkins starred in Merchant-Ivory's period film based on the E. M. Forster novel Howards End. Hopkins acted alongside Emma Thompson and Helena Bonham Carter where he played the cold businessman Henry Wilcox. The film received enormous critical acclaim, with critic Leonard Maltin calling it \"extraordinarily good on every level.\" The following year, Hopkins reunited with Merchant-Ivory and Emma Thompson in The Remains of the Day (1993), a film set in 1950s post-war Britain based on the novel by Kazuo Ishiguro. The film was ranked by the British Film Institute as one of the 64th greatest British film of the 20th century.British Film Institute – Top 100 British Films (1999). Retrieved 27 August 2016 Starring as the butler Stevens, Hopkins named it among his favourite films. He was nominated for an Academy Award for Best Actor for his performance, and received the BAFTA Award for Best Actor."]}, {"page": "Cinema of the United Kingdom", "response": ["It prompted a cycle of period films – some with a large budget for a British film, such as David Lean's final film A Passage to India (1984), alongside the lower-budget Merchant Ivory adaptations of the works of E. M. Forster, such as A Room with a View (1986). But further attempts to make 'big' productions for the US market ended in failure, with Goldcrest losing its independence after Revolution (1985) and Absolute Beginners (1986) were commercial and critical flops. Another Goldcrest film, Roland Joffé's The Mission (also 1986), won the 1986 Palme d'Or, but did not go into profit either. Joffé's earlier The Killing Fields (1984) had been both a critical and financial success. These were Joffé's first two feature films and were amongst those produced by Puttnam."]}, {"page": "George Orwell", "response": ["In August 1941, Orwell finally obtained \"war work\" when he was taken on full-time by the BBC's Eastern Service. When interviewed for the job he indicated that he \"accept[ed] absolutely the need for propaganda to be directed by the government\" and stressed his view that, in wartime, discipline in the execution of government policy was essential. He supervised cultural broadcasts to India to counter propaganda from Nazi Germany designed to undermine imperial links. This was Orwell's first experience of the rigid conformity of life in an office, and it gave him an opportunity to create cultural programmes with contributions from T. S. Eliot, Dylan Thomas, E. M. Forster, Ahmed Ali, Mulk Raj Anand, and William Empson among others."]}, {"page": "Gerolamo Cardano", "response": ["English novelist E. M. Forster's Abinger Harvest, a 1936 volume of essays, authorial reviews and a play, provides a sympathetic treatment of Cardano in the section titled 'The Past'. Forster believes Cardano was so absorbed in \"self-analysis that he often forgot to repent of his bad temper, his stupidity, his licentiousness, and love of revenge\" (212)."]}, {"page": "Hertfordshire", "response": ["The eponymous residence in E. M. Forster's novel Howards End was based on Rooks Nest House just outside Stevenage."]}, {"page": "January 1", "response": ["*1879 – E. M. Forster, English author and playwright (d. 1970)"]}, {"page": "June 7", "response": ["*1970 – E. M. Forster, English novelist, short story writer, essayist (b. 1879)"]}, {"page": "Prometheus Award", "response": ["* 2012  E. M. Forster, \"The Machine Stops\""]}, {"page": "Pacifism", "response": ["Bertrand Russell argued that the necessity of defeating Adolf Hitler and the Nazis was a unique circumstance in which war was not the worst of the possible evils; he called his position relative pacifism. Shortly before the outbreak of war, British writers such as E. M. Forster, Leonard Woolf, David Garnett and Storm Jameson all rejected their earlier pacifism and endorsed military action against Nazism.Ian Patterson, \"Pacifists and Conscientious Objectors\", in Adam Piette and Mark Rawlinson, The Edinburgh Companion to Twentieth-Century British and American War Literature, Edinburgh University Press 2012.   (p. 311). Similarly, Albert Einstein wrote: \"I loathe all armies and any kind of violence; yet I'm firmly convinced that at present these hateful weapons offer the only effective protection.\"Quoted on Albert Einstein  at Peace Pledge Union, and but also discussed in detail in articles in Einstein, Albert (1954), Ideas and Opinions, New York: Random House,  The British pacifists Reginald Sorensen and C. J. Cadoux, while bitterly disappointed by the outbreak of war, nevertheless urged their fellow pacifists \"not to obstruct the war effort.\"Martin Ceadel, Pacifism in Britain, 1914–1945 : The Defining of a Faith. Oxford : Clarendon Press, 1980.  (pp. 298–99)."]}, {"page": "Walter Scott", "response": ["Although he continued to be extremely popular and widely read, both at home and abroad,\"…it would be difficult to name, from among both modern and ancient works, many read more widely and with greater pleasure than the historical novels of … Walter Scott.\" – Alessandro Manzoni, On the Historical Novel. Scott's critical reputation declined in the last half of the 19th century as serious writers turned from romanticism to realism, and Scott began to be regarded as an author suitable for children. This trend accelerated in the 20th century. For example, in his classic study  Aspects of the Novel (1927), E. M. Forster harshly criticized Scott's clumsy and slapdash writing style, \"flat\" characters, and thin plots. In contrast, the novels of Scott's contemporary Jane Austen, once appreciated only by the discerning few (including, as it happened, Scott himself) rose steadily in critical esteem, though Austen, as a female writer, was still faulted for her narrow (\"feminine\") choice of subject matter, which, unlike Scott, avoided the grand historical themes traditionally viewed as masculine."]}, {"page": "Thomas Pynchon", "response": ["Pynchon's work also has similarities with writers in the modernist tradition who wrote long novels dealing with large metaphysical or political issues, such as Ulysses by James Joyce, A Passage to India by E. M. Forster, The Apes of God by Wyndham Lewis, The Man Without Qualities by Robert Musil and the U.S.A. trilogy by John Dos Passos. Pynchon explicitly acknowledges his debt to Beat Generation writers, and expresses his admiration for Jack Kerouac's On the Road in particular. He also outlines the specific influence on his own early fiction of literary works by T. S. Eliot, Ernest Hemingway, Henry Miller, Saul Bellow, Herbert Gold, Philip Roth, Norman Mailer, John Buchan and Graham Greene, and non-fiction works by Helen Waddell, Norbert Wiener and Isaac Asimov."]}, {"page": "Lord of the Flies", "response": ["A turning point occurred when E. M. Forster chose Lord of the Flies as his \"outstanding novel of the year.\" Other reviews described it as \"not only a first-rate adventure but a parable of our times\". In February 1960, Floyd C. Gale of Galaxy Science Fiction rated Lord of the Flies five stars out of five, stating that \"Golding paints a truly terrifying picture of the decay of a minuscule society ... Well on its way to becoming a modern classic\"."]}, {"page": "W. H. Auden", "response": ["* Journey to a War (London, New York, 1939; verse and prose, with Christopher Isherwood) (dedicated to E. M. Forster)."]}]}}