{"wiki_id": "http://www.wikidata.org/entity/Q18917609", "itemLabel": "George Bruce", "itemDescription": "Bruce, George Robert (1909–2002), poet, critic, and radio and television producer", "wikipedia_url": "https://en.wikipedia.org/wiki/George_Bruce_(poet)", "wikipedia_page": {"main": "George Bruce (10 March 1909 – 25 July 2002)  was a Scottish poet and radio journalist.He graduated from the Fraserburgh Academy and Aberdeen University.He was a BBC producer at Aberdeen (1946-1956) and Edinburgh (1956-1970). He co-produced the radio programmes Scottish Art and Letters and Arts Review. Later he was fellow in creative writing   at Glasgow University (1971–73) and visiting professor in US and Australia. In 1975-1976 he was the executive editor of The Scottish Review.In 1984 he was awarded OBE. His book Pursuit won the Saltire Society award (1999) for Scottish Book of the Year. His portrait (oil on panel, by Colin Dunbar, 1970) is in the collection of the Scottish National Portrait Gallery.\n\n", "link_mentions": [{"page": "Fraserburgh", "response": ["*George Bruce (1909–2002): Poet of the Scottish literary renaissanceGeorge Bruce Poet of the Scottish literary renaissance independent.co.uk, 29 July 2002"]}, {"page": "Modern Scottish Poetry", "response": ["Margot Robert Adamson - Marion Angus - George Bruce - Helen B. Cruickshank - Adam Drinan - John Ferguson - G. S. Fraser - Robert Garioch - W. S. Graham - Alexander Gray - George Campbell Hay - J. F. Hendry - Violet Jacob - William Jeffrey - Maurice Lindsay - Norman MacCaig - Hugh MacDiarmid - Pittendrigh MacGillivray - Albert MacKie - Hamish Maclaren - Sorley MacLean - Robert MacLellan - Donald MacRae - William Montgomerie - Edwin Muir - R. Crombie Saunders - Tom Scott - Ann Scott-Moncrieff - Donald Sinclair - Sydney Goodsir Smith - William Soutar - Lewis Spence - Muriel Stuart - Ruthven Todd - Andrew Young - Douglas Young"]}, {"page": "George Sutherland Fraser", "response": ["A. Alvarez - Kingsley Amis - W. G. Archer - Patricia Avis - Bernard Bergonzi - Thomas Blackburn - Arthur Boyars - Alan Brownjohn - George Bruce - Charles Causley - Robert Conquest - Hilary Corke - Maurice James Craig - Donald Davie - Paul Dehn - Keith Douglas - Lawrence Durrell - D. J. Enright - Iain Fletcher - Roy Fuller - Robert Garioch - David Gascoyne - W. S. Graham - Thom Gunn - J. C. Hall - Michael Hamburger - Jacquetta Hawkes - John Heath-Stubbs - Geoffrey Hill - John Holloway - Elizabeth Jennings - Peter Johnson - Sidney Keyes - Thomas Kinsella - James Kirkup - Philip Larkin - Laurie Lee - Alun Lewis - Christopher Logue - Rob Lyle - George MacBeth - Norman MacCaig - Mairi MacInnes - Ewart Milne - Richard Murphy - Norman Nicholson - Kathleen Nott - Philip Oakes - Jonathan Price - F. T. Prince - Henry Reed - Anne Ridler - W. R. Rodgers - Alan Ross - E. J. Scovell - Tom Scott - Martin Seymour-Smith - John Short - Jon Silkin - Burns Singer - Robin Skelton - Sydney Goodsir Smith - Bernard Spencer - R. S. Thomas - Terence Tiller - Charles Tomlinson - Constantine Trypanis - John Wain - John Waller - Vernon Watkins - Gordon Wharton - Sheila Wingfield - Diana Witherby - David Wright"]}, {"page": "Penguin poetry anthologies", "response": ["Drummond Allison - Kenneth Allott - Patrick Anderson - W. H. Auden - George Barker - John Bayliss - William Bell - Peter Black - George Bruce - Demetrios Capetanakis - Leonard Clark - Alex Comfort - Dorian Cooke - R. N. Currey - Paul Dehn - Patric Dickinson - Keith Douglas - Lawrence Durrell - D. J. Enright - Robin Fedden - G. S. Fraser - Ernest Frost - Roy Fuller - Roland Gant - Wrey Gardiner - David Gascoyne - W. S. Graham - K. R. Gray - Bernard Gutteridge - Michael Hamburger - John Heath-Stubbs - Alexander Henderson - J. F. Hendry - John Jarmain - Seán Jennett - Sidney Keyes - Francis King - James Kirkup - Christopher Lee - Laurie Lee - Patrick Leigh Fermor - Alun Lewis - C. Day-Lewis - Reg Levy - Robert Liddell - Emanuel Litvinoff - Norman MacCaig - Neil McCallum - Louis MacNeice - Roland Mathias - J. S. Mollison - James Monahan - Jane Moore - Nicholas Moore - Norman Nicholson - Julian Orde - David Paul - Mervyn Peake - F. T. Prince - Kathleen Raine - Henry Reed - Anne Ridler - Iver Roberts-Jones - W. R. Rodgers - Alan Rook - Alan Ross - Vernon Scannell - Francis Scarfe - Lawrie Scarlett - Bernard Spencer - Stephen Spender - Hal Summers - Julian Symons - Dylan Thomas - R. S. Thomas - Frank Thompson - Terence Tiller - Ruthven Todd - Henry Treece - James Walker - Vernon Watkins - Paul Widdows"]}, {"page": "George Bruce", "response": ["George Bruce may refer to:", "*George Bruce of Carnock (c. 1550–1625), Scottish engineer", "*George Bruce (industrialist) (1781–1866), Scottish-American inventor and businessman, awarded the first US design patent, for fonts", "*George Bruce (industrialist) (1781–1866), American industrialist and inventor", "*George Bruce (footballer) (1879–1928), Australian rules footballer", "*George Bruce (poet) (1909–2002), Scottish poet", "*George Bruce (bishop) (born 1942), bishop of the Anglican Diocese of Ontario", "*George Bruce (screenwriter), Two Years Before the Mast"]}, {"page": "Joseph Macleod", "response": ["In 1938, Macleod became an announcer and newsreader at the BBC, and he began to write and publish poetry under the pseudonym \"Adam Drinan\". These poems dealt with the Highland clearances, and described the Scottish landscape in rich detail, using Gaelic assonances. He was one of the first to succeed in rendering the qualities of Gaelic poetry in English. These poems and verse plays won praise from many Scottish writers – Naomi Mitchison, Norman MacCaig, Edwin Muir, Compton Mackenzie, George Bruce, Sydney Goodsir Smith, Maurice Lindsay, and many more. Macleod's \"Drinan\" poetry was in much demand in both England and Scotland, as well as Ireland and the US. Editors such as Tambimuttu (of Poetry (London)), Maurice Lindsay (Poetry (Scotland)) and John Lehmann (Hogarth Press and New Writing), all requested and published many of his poems in the 1940s. Both \"Drinan\" and Macleod are included in Kenneth Rexroth's New British Poets anthology (1949), published for New Directions. The \"Drinan\" pseudonym was not publicly revealed until 1953, after which Hugh MacDiarmid commented it was \"so long one of the best-kept secrets of the contemporary literary world\".Hugh MacDiarmid. From 'The Poetry of Joseph Macleod' in The Raucle Tongue: Hitherto Uncollected Prose, Volume III, Eds. Angus Calder, Glen Murray and Alan Riach. Manchester: Carcanet Press, p. 312.   Adrian Stokes received and dealt with Macleod's 'Drinan' correspondence."]}, {"page": "Saltire Society Literary Awards", "response": ["| 1999 || Pursuits || George Bruce ||"]}, {"page": "Fraserburgh Academy", "response": ["*George Bruce, (1909-2002), poet"]}, {"page": "Deaths in July 2002", "response": ["*George Bruce, 93, Scottish poet and BBC producer."]}, {"page": "Matuschka", "response": ["After taking the course of George Bruce at Prescott, she was invited by Bruce to publish her poetry in a Scottish Anthology called Arkos, which he edited. He selected a suite of Matuschka's poems entitled Visions from a Locked Ward for the 1974 edition."]}]}}