{"wiki_id": "http://www.wikidata.org/entity/Q189990", "itemLabel": "Antony Hewish", "itemDescription": "English physicist and radio astronomer (1924-2021)", "wikipedia_url": "https://en.wikipedia.org/wiki/Antony_Hewish", "wikipedia_page": {"main": "Antony Hewish  (11 May 1924 – 13 September 2021) was a British radio astronomer who won the Nobel Prize for Physics in 1974 (together with fellow radio-astronomer Martin Ryle) for his role in the discovery of pulsars. He was also awarded the Eddington Medal of the Royal Astronomical Society in 1969.", "link_mentions": [{"page": "Fred Hoyle", "response": ["Hoyle was also at the centre of two unrelated controversies involving the politics for selecting the winner of the Nobel Prize for Physics. The first came when the 1974 prize went, in part, to Antony Hewish for his leading role in the discovery of pulsars. Promptly Hoyle made an off-the-cuff remark to a reporter in Montreal that \"Yes, Jocelyn Bell was the actual discoverer, not Hewish, who was her supervisor, so she should have been included.\" This remark received widespread international coverage. Worried about being misunderstood and by British libel laws, Hoyle carefully composed a letter of explanation to The Times."]}, {"page": "May 11", "response": ["*1924 – Antony Hewish, English astronomer and academic, Nobel Prize laureate (d. 2021)"]}, {"page": "November 28", "response": ["*1967 – The first pulsar (PSR B1919+21, in the constellation of Vulpecula) is discovered by two astronomers Jocelyn Bell Burnell and Antony Hewish."]}, {"page": "Neutron star", "response": ["As the star's core collapses, its rotation rate increases as a result of conservation of angular momentum, and newly formed neutron stars hence rotate at up to several hundred times per second. Some neutron stars emit beams of electromagnetic radiation that make them detectable as pulsars. Indeed, the discovery of pulsars by Jocelyn Bell Burnell and Antony Hewish in 1967 was the first observational suggestion that neutron stars exist. The radiation from pulsars is thought to be primarily emitted from regions near their magnetic poles. If the magnetic poles do not coincide with the rotational axis of the neutron star, the emission beam will sweep the sky, and when seen from a distance, if the observer is somewhere in the path of the beam, it will appear as pulses of radiation coming from a fixed point in space (the so-called \"lighthouse effect\"). The fastest-spinning neutron star known is PSR J1748-2446ad, rotating at a rate of 716 times a second or 43,000 revolutions per minute, giving a linear speed at the surface on the order of  (i.e., nearly a quarter the speed of light).", "At the meeting of the American Physical Society in December 1933 (the proceedings were published in January 1934), Walter Baade and Fritz Zwicky proposed the existence of neutron stars, less than two years after the discovery of the neutron by James Chadwick. In seeking an explanation for the origin of a supernova, they tentatively proposed that in supernova explosions ordinary stars are turned into stars that consist of extremely closely packed neutrons that they called neutron stars. Baade and Zwicky correctly proposed at that time that the release of the gravitational binding energy of the neutron stars powers the supernova: \"In the supernova process, mass in bulk is annihilated\". Neutron stars were thought to be too faint to be detectable and little work was done on them until November 1967, when Franco Pacini pointed out that if the neutron stars were spinning and had large magnetic fields, then electromagnetic waves would be emitted. Unbeknown to him, radio astronomer Antony Hewish and his research assistant Jocelyn Bell at Cambridge were shortly to detect radio pulses from stars that are now believed to be highly magnetized, rapidly spinning neutron stars, known as pulsars.", "In 1965, Antony Hewish and Samuel Okoye discovered \"an unusual source of high radio brightness temperature in the Crab Nebula\". This source turned out to be the Crab Pulsar that resulted from the great supernova of 1054.", "In 1967, Jocelyn Bell Burnell and Antony Hewish discovered regular radio pulses from PSR B1919+21. This pulsar was later interpreted as an isolated, rotating neutron star. The energy source of the pulsar is the rotational energy of the neutron star. The majority of known neutron stars (about 2000, as of 2010) have been discovered as pulsars, emitting regular radio pulses.", "In 1974, Antony Hewish was awarded the Nobel Prize in Physics \"for his decisive role in the discovery of pulsars\" without Jocelyn Bell who shared in the discovery."]}, {"page": "List of physicists", "response": ["*Antony Hewish – U.K. (1924–2021) Nobel laureate"]}, {"page": "1974", "response": ["* Physics – Sir Martin Ryle, Antony Hewish"]}, {"page": "1924", "response": ["* May 11 – Antony Hewish, English radio astronomer, recipient of the Nobel Prize in Physics (d. 2021)"]}, {"page": "1967", "response": ["* August 6 – A pulsar is noted by Jocelyn Bell and Antony Hewish. The discovery is first recorded in print in 1968: \"An entirely novel kind of star came to light on Aug. 6 last year [...]\". The date of the discovery is not recorded.", "* November 28 – The first pulsar to be discovered by Earth observers is found in the constellation of Vulpecula by astronomers Jocelyn Bell Burnell and Antony Hewish, and is given the name PSR B1919+21."]}, {"page": "Phased array", "response": ["Adolf Prasch, ed., Die Fortschritte auf dem Gebiete der Drahtlosen Telegraphie [Progress in the field of wireless telegraphy] (Stuttgart, Germany: Ferdinand Enke, 1906), vol. 4, pages 184–185. During World War II, Nobel laureate Luis Alvarez used phased array transmission in a rapidly steerable radar system for \"ground-controlled approach\", a system to aid in the landing of aircraft. At the same time, the GEMA in Germany built the Mammut 1.http://www.100jahreradar.de/index.html?/gdr_5_deutschefunkmesstechnikim2wk.html  Mamut1 first early warning PESA Radar It was later adapted for radio astronomy leading to Nobel Prizes for Physics for Antony Hewish and Martin Ryle after several large phased arrays were developed at the University of Cambridge Interplanetary Scintillation Array. This design is also used for radar, and is generalized in interferometric radio antennas."]}, {"page": "Sussex", "response": ["In the 20th century, Frederick Soddy won the Nobel Prize in Chemistry for his work on radioactive substances, and his investigations into the origin and nature of isotopes. Frederick Gowland Hopkins shared the Nobel Prize in Physiology or Medicine in 1929 with Christiaan Eijkman, for discovering the growth-stimulating vitamins. Martin Ryle shared the Nobel Prize for Physics in 1974 with Cornishman Antony Hewish, the first Nobel prize awarded in recognition of astronomical research. While working at the University of Sussex, Harold Kroto won the 1996 Nobel Prize in Chemistry with Richard Smalley and Robert Curl from Rice University in the US for the discovery of fullerenes. David Mumford is a mathematician known for distinguished work in algebraic geometry and then for research into vision and pattern theory. He won the International Mathematical Union's Fields Medal in 1974 and in 2010 was awarded the United States National Medal of Science."]}, {"page": "John Polkinghorne", "response": ["* Questions of Truth: Fiftyone Responses to Questions about God, Science and Belief, with Nicholas Beale; foreword by Antony Hewish (Westminster John Knox 2009) "]}, {"page": "2021", "response": ["** Antony Hewish, English Nobel radio astronomer (b. 1924)"]}]}}