{"wiki_id": "http://www.wikidata.org/entity/Q18922228", "itemLabel": "Evelyn Simpson", "itemDescription": "English literary scholar", "wikipedia_url": "https://en.wikipedia.org/wiki/Evelyn_M._Simpson", "wikipedia_page": {"main": "Evelyn Mary Simpson (2 September 1885 – 8 September 1963) was an English literary critic and scholar, and the first woman to earn a D.Phil. from Oxford University. Though she was required to relinquish her appointment at St Hugh's College, Oxford upon marrying in 1921, Simpson continued her work as an independent scholar.  She is best known for her scholarship on John Donne, including a magisterial edition of his sermons and editions of other prose works, but she wrote on other topics in English Renaissance literature as well.", "link_mentions": [{"page": "John Donne", "response": ["The idea that Donne's writings reflect two distinct stages of his life remains common; however, many scholars have challenged this understanding. In 1948, Evelyn Simpson wrote, \"a close study of his works... makes it clear that his was no case of dual personality. He was not a Jekyll-Hyde in Jacobean dress... There is an essential unity underlying the flagrant and manifold contradictions of his temperament.\"Simpson, Evelyn (1948). A Study of the Prose Works of John Donne. Oxford University Press. pp. 4–5."]}, {"page": "Devotions upon Emergent Occasions", "response": ["The Devotions have received a mixed reaction from critics. Evelyn Simpson described it as \"a curious little book\", and wrote that \"[a]s a manual of devotion [the Devotions] compares unfavourably with the Devotions of Bishop Andrewes or the Holy Living of Jeremy Taylor. It is too introspective, too metaphysical, too much overloaded with learning of different kinds\". Helen C. White described it as the output of an \"anxious and restless mind\"."]}, {"page": "Evelyn Simpson", "response": ["Evelyn Simpson may refer to:", "* Evelyn Simpson Curenton (born 1953), American composer, pianist, organist, and vocalist"]}]}}