{"wiki_id": "http://www.wikidata.org/entity/Q1894122", "itemLabel": "Marcus Creed", "itemDescription": "British conductor", "wikipedia_url": "https://en.wikipedia.org/wiki/Marcus_Creed", "wikipedia_page": {"main": "Marcus Creed (April 19, 1951) is an English conductor.\nBorn in Eastbourne, Sussex (South England), he was educated at Eastbourne Grammar School, King's College, Cambridge, Christ Church, Oxford, and Guildhall School in London.  He moved to Germany in 1976 and worked firstly as a coach and chorusmaster at the Deutsche Oper Berlin. From 1987 to 2001 he was artistic director of the RIAS Kammerchor and worked with the Berlin Scharoun Ensemble as a pianist and conductor and conducted the Staatskapelle Berlin and Deutsches Symphonie-Orchester Berlin as well as the Akademie für Alte Musik Berlin. \nIn 2003, he was appointed artistic director of the SWR Vokalensemble Stuttgart. He was appointed chief conductor of The Danish National Vocal Ensemble in 2014 with whom he won a Diapason d'Or. Since 1998 he has also been a professor for choral conducting at the Hochschule für Musik Köln.", "link_mentions": [{"page": "Ode for the Birthday of Queen Anne", "response": ["*Andreas Scholl (countertenor), Helene Guilmette (soprano), Andreas Wolf (bass), Vocalconsort Berlin, Akademie fur Alte Musik Berlin, Marcus Creed (conductor). Harmonia Mundi 0794881924325. Released 2005."]}, {"page": "Collegium Vocale Gent", "response": ["Besides using its own baroque orchestra, Collegium Vocale Gent has worked with several historically informed instrumental ensembles, including the Orchestre des Champs Elysées, Freiburger Barockorchester and Akademie für Alte Musik Berlin. It also works with prominent symphony orchestras such as deFilharmonie (Royal Flemish Philharmonic), the Rotterdam Philharmonic Orchestra, the Budapest Festival Orchestra and Amsterdam’s Royal Concertgebouw Orchestra. The ensemble has worked with Nikolaus Harnoncourt, Sigiswald Kuijken, René Jacobs, Paul Van Nevel, Iván Fischer, Marcus Creed, Kaspars Putnins, Yannick Nézet-Séguin and other leading conductors. The vocalists of Collegium Vocale Gent are trained by Christoph Siebert who has also conducted performances at international festivals."]}, {"page": "Cheryl Studer", "response": ["* Strauss Choral Works, recorded 9/84, RIAS Kammerchor, Uwe Gronostay, Marcus Creed, Deutsche Schallplatten"]}, {"page": "All-Night Vigil (Rachmaninoff)", "response": ["|Marcus Creed"]}, {"page": "Akademie für Alte Musik Berlin", "response": ["About 30 musicians form the core of the orchestra. They perform under the leadership of their four concertmasters Midori Seiler, Stephan Mai, Bernhard Forck and Georg Kallweit or guest conductors like René Jacobs, Marcus Creed, Daniel Reuss, Peter Dijkstra and Hans-Christoph Rademann."]}, {"page": "Jephtha (Handel)", "response": ["||Marcus Creed,RIAS‐Kammerchor,Akademie Fur Alte Musik Berlin"]}, {"page": "Hochschule für Musik und Tanz Köln", "response": ["* Marcus Creed"]}, {"page": "Gruppen", "response": ["*1996. Berliner Philharmoniker, cond. Friedrich Goldmann (orchestra 1), Claudio Abbado (orchestra 2), Marcus Creed (orchestra 3). Recorded Berlin, Philharmonie, Grosser Saal, December 1994. (with Kurtág, Grabstein für Stephan, op. 15c, and Stele, op. 33). DG 447 761-2; also issued on DG 940 462-2. Reissued in 2012 on Deutsche Grammophon 001708102."]}, {"page": "Maurice Steger", "response": ["He has performed with celebrated artists such as Thomas Quasthoff, Dorothea Röschmann, Howard Griffiths, Cecilia Bartoli, Hilary Hahn, Laurence Cummings, Igor Oistrakh, Marcus Creed, Jörg Faerber, Fabio Biondi, Sandrine Piau, Andrew Manze, Sol Gabetta, Diego Fasolis, Albrecht Mayer and Ruth Ziesak. In recital he is regularly accompanied by Naoki Kitaya and the Continuo Consort, by Sebastian Wienand, Alexander Weimann and by Sergio Ciomei."]}, {"page": "Concerto Köln", "response": ["Their repertory stretches from early Baroque on through the Classical Era and as far into the nineteenth century as Wagner. They have also done a number of collaborative works, such as a disc juxtaposing Turkish folk music with pieces in a Turkish style by composers such as Mozart. They have recorded frequently with, among others, René Jacobs, Daniel Harding, Louis Langrée, David Stern, Ivor Bolton, Marcus Creed, Christopher Moulds and Evelino Pidò."]}, {"page": "Diapason d'Or", "response": ["* Musique Chorale: Messiaen: \"L'Amour et la Foi\", Danish National Vocal Ensemble, Danish National Concert Choir, Danish National Chamber Orchestra, Marcus Creed. OUR Recordings (SACD)."]}, {"page": "Mass No. 2 (Bruckner)", "response": ["Of the recordings from the LP era, Eugen Jochum's recording with the Bavarian Radio Symphony Orchestra and Chorus on Deutsche GrammophonL.T. Lovallo, p. 28 has been remastered to CD. Matthew Best's more recent recording with the Corydon Singers has been critically acclaimed.S. Johnson, p. 361 Other excellent recordings, according to Hans Roelofs, are i.a. those by Roger Norrington, Hellmut Wormsbächer, Philippe Herreweghe, Simon Halsey, Frieder Bernius, Ingemar Månsson, Helmuth Rilling, Marcus Creed, Winfried Toll and Otto Kargl.", "* Marcus Creed, SWR Vokalensemble Stuttgart, Mitglieder des Radio-Sinfonieorchesters Stuttgart des SWR, Anton Bruckner – Mass in E minor - Motets – CD: Hänssler Classic SACD 93.199, 2007"]}, {"page": "London Philharmonic Choir", "response": ["Neville Creed was the former head of music at Tiffin School and conductor of the Bournemouth and Guildford choirs. He collaborated with the LPC by preparing the Tiffin Boys' Choir on the Mahler Eight recording in 1987. His brother, Marcus Creed, is also a noted English conductor, now based in Germany.Snowman, p. 78 Creed's enthusiasm and drive enabled the LPC to undertake a membership drive and to build up morale. The choir was able to give creditable performances with the LPO at the Royal Festival Hall in the 1994/95 LPO concert season of the Britten and Verdi Requiems under Welser-Möst, Berlioz concerts with Norrington, Beethoven's Ninth and Bruckner's Te Deum with Haitink, and two performances of Verdi's Aida with Zubin Mehta.Snowman, pp. 78–79"]}, {"page": "Stabat Mater (Rossini)", "response": ["** Marcus Creed, conductor", "** Decca 460781-2Glass, Herbert (2004): \"The present production emerges several sizes too large in terms of orchestral and choral weight. ... The numerous CD versions of the Stabat Mater include large-scale affairs such as the present one and those under Kertész, Giulini, Muti, and Chung, and the period editions under Marcus Creed and Christoph Spering, both with accomplished, less hefty solo ensembles and correspondingly smaller orchestral and choral forces. None is without its points of interest, but as overall satisfying encounters with this wonderfully entertaining work, I’ll take the lightweights, first choice being Spering’s (on the Opus 111 label) for its verve and clarity, and for contralto Sara Mingardo’s standout contribution.\" Fanfare Vol. 27 (3), January/February 2004. Accessed 29 July 2010. Subscription required."]}, {"page": "Andreas Karasiak", "response": ["In the field of historically informed performance he has worked with Gustav Leonhardt, Marcus Creed and Philippe Herreweghe, taking part in the project of Ton Koopman and the Amsterdam Baroque Orchestra & Choir Dieterich Buxtehude – Opera Omnia to record the complete works of Dieterich Buxtehude (begun 2005, in progress). He has also performed with Helmuth Rilling and Sylvain Cambreling, among others."]}, {"page": "Gabriele Schreckenbach", "response": ["She recorded Bach cantatas with the Gächinger Kantorei and Helmuth Rilling. She recorded choral works of Mozart, his Waisenhausmesse K. 139 and rarely performed pieces, with the RIAS Kammerchor and the Berlin Radio Symphony Orchestra, conducted by Marcus Creed.Mozart. Choral Works on the Gramophone Archive She recorded the part of Ursula in the opera Feuersnot of Richard Strauss with Erich Leinsdorf and parts in three operas of Paul Hindemith with Gerd Albrecht, who also conducted recordings of Die Gezeichneten of Franz Schreker and Der Corregidor of Hugo Wolf.Gabriele Schreckenbach on Catálogo de OperaclassPaul Hindemith CD Stage Works, Vocal Works She recorded the part of Iocaste in Stravinsky's Oedipus rex with Ferdinand Leitner. In 1994 she was appointed professor at the Hochschule für Künste Bremen.Gabriele Schreckenbach on bach-cantatas"]}, {"page": "RIAS Kammerchor", "response": ["* Marcus Creed (1987–2003)"]}, {"page": "Netherlands Bach Society", "response": ["* 2003: Marcus Creed"]}, {"page": "Tim Mead", "response": ["Mead has performed with many leading interpreters including conductors Howard Arman, Harry Bicket, Ivor Bolton, William Christie, Stephen Cleobury, Marcus Creed, Laurence Cummings, Christian Curnyn, Alan Curtis, Ottavio Dantone, Paul Goodwin, Emmanuelle Haïm, Thomas Hengelbrock, Vladimir Jurowski, Raymond Leppard, Nicholas Kraemer, Alessandro de Marchi, Nicholas McGegan, Marc Minkowski, James O'Donnell, Antonio Pappano, Hans-Christoph Rademann, Andreas Spering, Masaaki Suzuki and Jos van Veldhoven. He has collaborated with opera directors including David Alden, Robert Carsen, Doris Dörrie, Stephen Langridge, David McVicar, Katie Mitchell, Ole Anders Tandberg, Deborah Warner and Chen Shi-Zheng."]}, {"page": "Preis der Europäischen Kirchenmusik", "response": ["*2010: Marcus Creed"]}, {"page": "Clytus Gottwald", "response": ["* Clytus Gottwald: Transkriptionen. SWR Vokalensemble Stuttgart, Marcus Creed. Carus 83.181."]}, {"page": "SWR Vokalensemble", "response": ["*Marcus Creed (2003-2020)"]}, {"page": "Missa Brevis (Bernstein)", "response": ["Other recordings include those by the SWR Vokalensemble, conducted by Marcus Creed;Bernstein, Leonard. Missa Brevis. Southwest Radio Vocal Ensemble Stuttgart. Marcus Creed, cond. Recorded 2014. Haenssler Classics B00HZOY0TG, 2014, compact disc. Stephen Layton with Polyphony;Hyperion 67929, 2015. and Marin Alsop with the São Paulo Symphony Orchestra.Naxos 8559742, 2015."]}, {"page": "2011 Echo Klassik Awards", "response": ["**20th/21st century – Marcus Creed/SWR Vokalensemble Stuttgart - Heitor Villa-Lobos: Chorwerke"]}, {"page": "Georg Poplutz", "response": ["Poplutz made his operatic debut at the Theater Gießen in 2004, in Monteverdi's L'incoronazione di Poppea. In 2005 he recorded the part of Balouard in Étienne Méhul's opera L'irato, conducted by ). In the field of historically informed performance, Poplutz has collaborated as a soloist with conductors such as Marcus Creed, Helmut Müller-Brühl, Peter Neumann (de), Ralf Otto, Wolfgang Schäfer and Winfried Toll. In 2005, he sang tenor parts in Bach cantatas with Martin Lutz conducting performances in services in the Marktkirche in Wiesbaden and the Katharinenkirche in Frankfurt, documented in a recording of Du Hirte Israel, höre, BWV 104. He was awarded the Mendelssohn-Preis of the Frankfurt Mendelssohn-Gesellschaft, founded by , in 2009, and performed the tenor solo part in the composer's oratorio Elias with the , conducted by Christmann, in the Alte Oper. With them, he was in 2011 a soloist in Paulus, along with Elisabeth Scholl and conducted by Mathias Breitschaft. In 2013, he recorded the part of the Evangelist in Bach's Christmas Oratorio (parts 4 to 6) with the Kantorei Barmen-Gemarke, conducted by Wolfgang Kläsener. He sang the tenor solo in Bach's Mass in B minor in St. Martin, Idstein, with the orchestra L'arpa festante conducted by Franz Fink. In 2014, he performed cantatas by Georg Philipp Telemann with the Rheinische Kantorei, conducted by Hermann Max, at festivals such as the Magdeburger Telemann-Festtage."]}, {"page": "Virga Jesse (Bruckner)", "response": ["* Marcus Creed, SWR Symphony Orchestra and Stuttgart-Radio Vocal Ensemble, Mass in E minor and Motets – CD: Hänssler Classic SACD 93.199, 2007"]}, {"page": "Os justi (Bruckner)", "response": ["* Marcus Creed, SWR Symphony Orchestra and Stuttgart-Radio Vocal Ensemble, Mass in E minor and Motets – CD: Hänssler Classic SACD 93.199, 2007"]}, {"page": "Peter Dijkstra", "response": ["Born in Roden, Drenthe, Dijkstra sang in his youth in Jongenskoor Roder, a boys' choir, which his father, Bouwe Dijkstra, founded in 1985. He sang the Cantatas of J. S. Bach with the likes of Gustav Leonhardt, Sigiswald Kuijken and Max van Egmond in Amsterdam. Later he studied singing and conducting at the Royal Conservatory of The Hague, at the Hochschule für Musik und Tanz Köln with Marcus Creed, and at the Royal College of Music in Stockholm with Jorma Panula. He also attended master classes with Eric Ericson and Tõnu Kaljuste. He led the ensemble The Gents.International Record Review - Volume 4 2003 - Page 26 \"A different perspective by Francis Knights of the Tudor sacred repertoire, from across the Channel, comes from The Gents, an all-male Dutch chamber choir conducted by Peter Dijkstra.\"Das Orchester - Volume 54, Issues 1-6 - Page 44 2006 \"... und ein Jahr später mit brillantem Altus oder ob als 18-Jähriger begleitet von dem von ihm bisher geleiteten renommierten Männer-Vocalensemble „The Gents\": Peter Dijkstra verfügte und verfügt über wunderbare stimmliche Fähigkeiten.\"BBC Music Magazine - Volume 13, Issues 7-13 - Page 69 2005  \"The Gents, a Dutch group emanating from Roden Boys Choir, \"Mens en Melodie - Volume 59 - 2004 -Page 35 \"De jonge Nederlandse dirigent Peter Dijkstra wordt per september 2005 artistiek leider van het Chor des Bayerischen ... Hij maakte in Nederland al furore met zijn eigen gezelschap The Gents en hij deed het goed bij onder andere het ..\""]}, {"page": "Pange lingua, WAB 33", "response": ["* Marcus Creed, SWR Symphony Orchestra and Stuttgart-Radio Vocal Ensemble, Mass in E minor and Motets – CD: Hänssler Classic SACD 93.199, 2007"]}, {"page": "Hans Jörg Mammel", "response": ["Mammel received first musical training as a member of the boys' choir Stuttgarter Hymnus-Chorknaben. After aborted legal studies, he studied at the Hochschule für Musik Freiburg with Winfried Toll, Werner Hollweg and Ingeborg Most. After several master classes in Europe, Mammel collaborated with conductors such as Thomas Hengelbrock, Markus Teutschbein, Marcus Creed and Philippe Herreweghe. Mammel's repertoire includes major concert works and operas including song cycles and contemporary music. He has participated in premieres of works by Karlheinz Stockhausen."]}, {"page": "Michael Ostrzyga", "response": ["Ostrzyga was born in Castrop-Rauxel, North Rhine-Westphalia in Germany, where he was initially trained in piano, organ, and choral activities by Bruno Zaremba before studying conducting with renowned conductor Marcus Creed, composition with Friedrich Jaecker, and piano with Peter Degenhardt."]}, {"page": "Andreas Weller", "response": ["Weller has collaborated with conductors of historically informed performances such as Frieder Bernius, Marcus Creed, Daniel Harding, Thomas Hengelbrock, Philippe Herreweghe, Hartmut Höll, Konrad Junghänel, Ton Koopman, Sigiswald Kuijken, Jun Märkl, Helmuth Rilling, Masaaki Suzuki and Roger Vignoles. He has worked with the ensembles The King's Singers and Les Arts Florissants. He appeared at international festivals such as the Soundstreams Festival in Toronto and the Festival van Vlaanderen."]}, {"page": "Christoph Siebert", "response": ["As a guest he has prepared the Rundfunkchor Berlin for a concert with Simon Rattle and the Berlin Philharmonic. He has worked with the Vokalconsort Berlin, the Deutsche Kammerphilharmonie Bremen, the Freiburger Barockorchester and the Chapelle Royale, and with conductors such as Sylvain Cambreling, Marcus Creed, Attilio Cremonesi, Paavo Järvi, Louis Langrée, Neville Marriner and John Nelson. He prepared the Frauenchor des Europachores Frankfurt (women's choir of the Europe Choir Frankfurt) for a performance of Mahler's Third Symphony, performed at the Alte Oper Frankfurt on 4 February 2015 with Nathalie Stutzmann, the Limburger Domsingknaben and the hr-Sinfonieorchester conducted by Andrés Orozco-Estrada. The performance was broadcast by Hessischer Rundfunk."]}, {"page": "Philipp Ahmann", "response": ["Ahmann studied conducting at the Musikhochschule Köln with Marcus Creed. "]}, {"page": "Lord, have mercy upon us (Mendelssohn)", "response": ["The motet was recorded, with other motets by Mendelssohn, by the RIAS Kammerchor conducted by Marcus Creed. In 2005, it was recorded by the St John's College Choir Cambridge, conducted by David Hill. The Chamber Choir of Europe recorded it to conclude a collection of Mendelssohn's choral works, conducted by Nicol Matt, in 2006."]}, {"page": "Mozart Mass K. 139 (Claudio Abbado recording)", "response": ["Sadie revisited the album on CD in Gramophone in August 1989, comparing it with a new version of the Mass conducted by Marcus Creed.Mozart, W. A.: Mass K. 139, Waisenhaus-Messe, cond. Marcus Creed, Capriccio/Target CD, 10169, 1989 Abbado's disc, he wrote, had \"superlative women soloists - Gundula Janowitz at her sweetest and most graceful, Frederica von Stade warm and musicianly as always\". But his opinion of Abbado's tenor and bass was slightly harsher than when he had critiqued them on vinyl. Wiesław Ochman was now judged to be lacking in charm and no better than adequate, and Kurt Moll was \"rather heavy and clumsy\". The Vienna State Opera Chorus was still \"precise and well-focused\", however. Abbado's conducting had both good points and bad. He elicited a performance that was lively, lucid, polished and nicely phrased, and he was skilled at managing those parts of the score where the 12-year-old Mozart's ideas were least coherent. On the downside, his tempi were sometimes slower than the music called for, and he treated Mozart's less solemn passages too gravely. As for Creed's newer recording, it was true that his line-up of soloists was not as starry as Deutsche Grammophon's. But Celia Linsley, if not blessed with Janowitz's tonal beauty, sang with grace and charm; Werner Hollweg summoned up intensity when required; and Walton Grönroos seemed more at home in the Mass's idiom than Moll did. Although Creed's performance was not as glossy as Abbado's, his sprightlier conducting and Capriccio's inclusion of some worthwhile fill-up items made his disc marginally the more enticing.Gramophone, August 1989, p. 350"]}]}}