{"wiki_id": "http://www.wikidata.org/entity/Q1897360", "itemLabel": "Marie Hall", "itemDescription": "British violinist (1884–1956)", "wikipedia_url": "https://en.wikipedia.org/wiki/Marie_Hall", "wikipedia_page": {"main": "Marie Pauline Hall (8 April 1884 – 11 November 1956) was an English violinist.", "link_mentions": [{"page": "1921 in the United Kingdom", "response": ["* 14 June – First performance of the orchestral version of Vaughan Williams's The Lark Ascending conducted by Adrian Boult with Marie Hall as violin soloist in a concert at the Queen's Hall in London."]}, {"page": "1920 in the United Kingdom", "response": ["* 15 December – Vaughan Williams' The Lark Ascending is premiered in its original version for violin and piano with Marie Hall as violinist at Shirehampton near Bristol."]}, {"page": "Violin Concerto (Elgar)", "response": ["The first recording of the concerto was a truncated version made by the Gramophone Company under the HMV label in December 1916, using the acoustic process, the technical limitations of which necessitated drastic rearrangement of the score. There were two 12-inch discs: D79-80.  The soloist was Marie Hall, and the unnamed orchestra was conducted by the composer.Kennedy (1987), p. 302 Electrical recording, introduced in the 1920s, gave a greatly improved dynamic range and realism, and the two leading English record companies, Columbia and HMV both made recordings of the concerto that remain in the catalogue."]}, {"page": "Viotti Stradivarius", "response": ["Viotti owned two Stradivari violins of 1709. The other instrument, which was subsequently owned by Marie Hall, is now owned by the Chi-Mei Collection. He also owned a Stradivari violin of 1712, which became part of the Henry Hottinger Collection. Since 1965, it has been owned by Isaac Hurwitz. See List of Stradivarius instruments"]}, {"page": "Shirehampton", "response": ["As Shirehampton and Avonmouth grew, the squires of Kings Weston House, notably Philip Napier Miles (1865–1935), gave many benefactions to the district, including land for churches, war memorials and social amenities. Among these important gifts was the Public Hall of 1904,Helme 2004. whose main claim to fame is perhaps that it was the venue of the first performance of Vaughan Williams's rhapsody The Lark Ascending, in its original version for solo violin and piano, played by the violinst Marie Hall, a friend of Vaughan Williams from his visits to Kings Weston house, in 1920. Little Park (or Shirehampton Park) was given to the National Trust after World War I, and is used as a golf course."]}, {"page": "František Drdla", "response": ["Although he composed three operettas, a violin concerto, several orchestral works and two piano trios, international fame came to Drdla as a result of composing lighter music in the late romantic style. These works generally mixed popular Bohemian (Czech) or Hungarian melodies and presented them  à la viennoise. Among the best known of such works are Souvenir (1904), Vision (1906) and Hey, Hay! (1908) written for violin with piano. Hey, Hay! became popular in more than a dozen different versions including those for orchestra, piano quintet, and string quartet. Drdla's compositions were popularized by violinists Jan Kubelík, Marie Hall, Mischa Elman, Joseph Szigeti, Váša Příhoda and others.", "* Op. 22 – Mazurka No.1 (\"Marie Hall Mazurka\") in G major for violin and piano (1905)"]}, {"page": "Hall (surname)", "response": ["*Marie Hall (1884–1956), English violinist"]}, {"page": "List of string quartet ensembles", "response": ["*Marie Hall"]}, {"page": "Template talk:Infobox artist", "response": ["i noticed twice today presence of \"musical artist\" as short description below person name. Kathleen Parlow and Marie Hall does not contain Short description, yet they show short description? is this intentional? চামুণ্ডা/ashtamatrikas[আলাপ/talk] 06:27, 15 September 2021 (UTC)"]}, {"page": "List of compositions by Gustav Holst", "response": ["| Chamber music || align=center|56 || align=center|  || align=center|1904? || Valse-Étude || for violin and piano || dedicated to Marie Hall"]}, {"page": "Philip Napier Miles", "response": ["Miles was a friend and supporter of Ralph Vaughan Williams, whose violin rhapsody \"The Lark Ascending\" was first performed by Marie Hall (with piano accompaniment) in 1920 at Shirehampton Public Hall\"Shirehampton Public Hall\", website article by Ralph Hack (1998)  at his instigation.  He also founded the Avonmouth Choral Society and was president of the Bristol Madrigal Society (1910–1914).  He organised operatic seasons at Shirehampton, later the Victoria Rooms, Clifton, and, in 1926 the Theatre Royal, Bristol, and some of his own operas were staged at these venues.  His wish had been to establish an English national opera-house, but it was not to be fulfilled. At Shirehampton, he was openly trying to emulate Rutland Boughton's \"village opera\" at Glastonbury.  For these services to music, he was awarded an honorary doctorate of letters by the University of Bristol in 1925."]}, {"page": "Mary Pauline Hall", "response": ["#REDIRECT Marie Hall"]}, {"page": "List of Stradivarius instruments", "response": ["|Marie Hall", "|Named after violinist Marie Hall."]}, {"page": "Mary Hall (disambiguation)", "response": ["*Marie Hall (1884–1956), English violinist "]}, {"page": "Elgar Violin Concerto discography", "response": ["|Marie Hall"]}, {"page": "Stanisław Barcewicz", "response": ["As an indication of his standing, other violinists in the collection include Joseph Joachim, Eugène Ysaÿe, Pablo de Sarasate, Arnold Rosé, Jan Kubelík, Willy Burmester, Jacques Thibaud, Marie Hall, Franz von Vecsey, Joseph Szigeti and Fritz Kreisler."]}, {"page": "British Symphony Orchestra", "response": ["The British Musical Society, founded in 1917, gave two concerts in June at the Queen's Hall with the British Symphony Orchestra. At the first, Sir Eugene Goossens and Boult conducted an all-British concert on 14 June 1921: Josef Holbrooke - Overture to The Children; Vaughan Williams - The Lark Ascending; Sir Eugene Goossens - symphonic poem,  The Eternal Rhythm; Cyril Scott - Piano Concerto (the composer at the pianoforte); and Holst's The Planets. This concert included the first performance of the orchestral version of The Lark Ascending, played by Marie Hall who owned a Viotti Stradivarius.", "From January 1934 to January 1935 a British Symphony Orchestra appeared in three National Sunday League Concerts at the London Palladium, all conducted by Charles Hambourg. 7 January 1934: orchestral concert. 4 November 1934: the violin soloist was Marie Hall, who had given the first performance of The Lark Ascending with an earlier British Symphony Orchestra in June 1921. On 13 January 1935 the concert included the duo-piano team of Vronsky & Babin. Held at RCM."]}, {"page": "1921 in British music", "response": ["*14 June – First performance of the orchestral version of Vaughan Williams's The Lark Ascending conducted by Adrian Boult with Marie Hall as violin soloist in a concert at the Queen's Hall in London."]}, {"page": "1920 in British music", "response": ["*15 December – Vaughan Williams' The Lark Ascending is premiered in its original version for violin and piano with Marie Hall as violinist at Shirehampton near Bristol."]}, {"page": "Vivien Chartres", "response": ["Chartres gave a recital at the Queen's Hall, London, in 1904, during the same week as appearances by Marie Hall, Mischa Elman, and other child violinists.\"Musical Prodigies\" The Bystander (March 28, 1906): 23. \"To hear this small dot attack the G minor concerto by Bruch and the Moïse fantasie was something of a revelation,\" commented one reviewer.Gamba, \"Violinists at Home and Abroad\" The Strad (May 1904): 36-38. Her mother and manager exaggerated her youth, and publicized her as being nine, not eleven, years old. Critics scolded Vivanti for allowing the child to be overworked and overexposed.\"Oldham Orchestral Society\" The Guardian (December 21, 1907): 7. via Newspapers.com Charged under a new law meant to prevent the exploitation of very young children, her mother and manager were fined, and the manager, Narciso Vert, died in June 1905, from a heart attack attributed to the stress.Simon McVeigh, \"'As Sand on the Sea Shore': Women Violinists in London's Concert Life around 1900\" in Emma Hornby, David Nicholas Maw, eds., Essays on the History of English Music in Honour of John Caldwell (Boydell and Brewer 2010): 243. Anne Urbancic, \"Staging Motherhood: Considering Annie Vivanti's Fact and Fiction\" in Patrizia Sambuco, ed., Italian Women Writers, 1800–2000: Boundaries, Borders, and Transgression (Rowman & Littlefield 2014): 81-91.  Vivien Chartres appeared at Queen's Hall again in 1906.\"Current Events and Concert Notes\" The Violin Times (August 1906): 115."]}, {"page": "The Lark Ascending (Vaughan Williams)", "response": ["It is not known when and where Vaughan Williams composed the piece. The original manuscript has been lost.Ford, Tom. \"The Lark's First Flight\", Limelight, August 2013, p. 49 The soloist for whom the work was written and to whom it is dedicated was Marie Hall, a leading British violinist of the time, a former pupil of Edward Elgar, and celebrated for her interpretation of that composer's Violin Concerto.Howes, p. 97 She worked with Vaughan Williams on the new piece before the premiere, and may have influenced some details of the score, though if so, the extent is unknown.Lee, p. 441"]}]}}