{"wiki_id": "http://www.wikidata.org/entity/Q18921780", "itemLabel": "Max George", "itemDescription": "British Singer, Songwriter and Actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Max_George", "wikipedia_page": {"main": "Maximillian Albert George (born 6 September 1988) is an English singer, songwriter, radio presenter and actor. He is best known as the lead singer of The Wanted.\nGeorge started his career as a footballer, playing for Preston North End. After an injury ended his football career, he decided to pursue a music career. George made his singing debut with the band Avenue. After the group disbanded in 2009, George joined the newly formed band, The Wanted. In 2014, following The Wanted's success in the United States, he landed his first acting role in the sixth season of the American television series Glee in the role of Clint, the leader of \"Vocal Adrenaline\".In 2013, George starred in the E! channel reality series The Wanted Life.\n\n", "link_mentions": [{"page": "1988 in music", "response": ["** Max George, British singer-songwriter and actor"]}, {"page": "1988 in American television", "response": ["|Max George  "]}, {"page": "Hits Radio", "response": ["! scope=\"row\"|  Max George"]}, {"page": "Strictly Come Dancing", "response": ["| Max George", "| Max George", "| Michelle Visage & Giovanni PerniceNicola Adams & Katya JonesMax George & Dianne Buswell"]}, {"page": "Steve Mac", "response": ["| Max George", "| Max George"]}, {"page": "1988 in the United Kingdom", "response": ["* 6 September – Max George, singer"]}, {"page": "Michelle Keegan", "response": ["Keegan was in a relationship with The Wanted singer Max George from December 2010. The couple became engaged in June 2011, but ended their relationship the following year. In September 2013, after a nine-month courtship, the actress announced her engagement to Mark Wright. They married on 24 May 2015."]}, {"page": "List of people on the cover of Attitude magazine", "response": ["|September 2011||Max George"]}, {"page": "Hits Radio Manchester", "response": ["* Max George (Friday Night Hits)"]}, {"page": "Celebrity Juice", "response": ["*Max George"]}, {"page": "Lindy Robbins", "response": ["| Max George ||Barcelona (single)|| Writer"]}, {"page": "List of Strictly Come Dancing contestants", "response": ["| Max George"]}, {"page": "The Wanted", "response": ["The Wanted are a British-Irish boy band consisting of members Max George, Siva Kaneswaran, Jay McGuiness, Tom Parker and Nathan Sykes. They formed in 2009 and were signed worldwide to Universal Music subsidiaries Island Records and Mercury Records, and managed by Scooter Braun. According to the British Phonographic Industry (BPI), the band has been certified for 600,000 albums and 2 million singles in the UK. Their nominations include 14 World Music Awards, two Brit Awards, an American Music Award, and a MTV Video Music Award.", "* Max George – lead and backing vocals"]}, {"page": "All Time Low (The Wanted song)", "response": ["After forming and being signed to Geffen Records in 2010 through mass auditioning, the Wanted recorded \"All Time Low\". It was one of six songs recorded by the band at the time for their debut album due for release in late 2010. The track was co-written by its producer Steve Mac in collaboration with Wayne Hector and Ed Drewett. It was mixed by Dann Pursey and Ren Swan. Lyrically, \"All Time Low\" is written in reference to rising from the difficulty of having someone special constantly on your mind. Speaking to Orange UK, Max George interpreted what the song was about: \"It's basically about a girl you can't get out of your mind - whatever you do, you just can't - and it describes how to get up from this all time low.\" Orange UK described \"All Time Low\" as having a \"lovesick\" theme to it. The lines \"Waiting at the station/I'm late for work, a vital presentation\" were said to take reference to Microsoft PowerPoint by music website Popjustice, while the line \"I'm in pieces, seems like peace is the only thing I'll never know\" was highlighted by Fraser McAlpine of the BBC as being the most memorable in the song in addition to having a devilish internal rhyme. \"All Time Low\" acts as the Wanted's debut single and first single from their debut album.", "* Vocals – Tom Parker, Nathan Sykes, Jay McGuiness, Max George, Siva Kaneswaran"]}, {"page": "Ed Drewett", "response": ["! scope=\"row\"| \"Barcelona\" by Max George ", "! scope=\"row\"| \"Til I Met You\" by Max George "]}, {"page": "Heart Vacancy", "response": ["Four years after the band's hiatus in 2014, Tom Parker, Max George and Jay McGuiness performed the song as a three piece at Parker's wedding to his fiancé Kelsey in July 2018.", "*Vocals – Tom Parker, Nathan Sykes, Jay McGuiness, Max George, Siva Kaneswaran"]}, {"page": "Max George (The Wanted)", "response": ["#REDIRECT Max George"]}, {"page": "Lose My Mind (The Wanted song)", "response": ["Popjustice made \"Lose My Mind\" their \"song of the day\" on 12 November 2010. A writer for website Female First called the song \"an anthemic rock ballad that shows off [the members'] characteristically mature, edgy vocals and breaks them out of the traditional boyband mould.\" Nick Levine of Digital Spy gave the song four stars out of five and praised the song for its \"brilliantly melodramatic lyrics\" and \"punchy\" chorus, while complimenting Max George's heavily auto-tuned vocals. Following the performance of \"Lose My Mind\" on The X Factor, the song entered the UK Singles Chart at number 29 and the Scottish Singles Chart at number 24 on 5 December 2010, three weeks before its official single release. It left the UK Singles Chart on the week of 23 January 2011 after spending seven weeks in the chart.", "*Lead and backing vocals – Tom Parker, Nathan Sykes, Jay McGuiness, Max George, Siva Kaneswaran"]}, {"page": "Gold Forever", "response": ["\"Gold Forever\" was written by Steve Mac, Wayne Hector and Claude Kelly, and it was produced by Mac. Steve Mac and Wayne Hector previously wrote the band's debut single \"All Time Low\" (2010) which charted at number one in the UK. It was announced as the lead single from The Wanted's upcoming second studio album and the 2011 Comic Relief single on 10 February 2011. It was described as \"a ballad you can rave to\". Band member Max George explained the meaning of the song: \"This song is about a day in your life that you never forget. It's an upbeat, feel-good track and our favourite so far. We're really excited to get it out there, and delighted that it is supporting such a great cause.\" The Wanted performed \"Gold Forever\" live on Red Nose Day 2011 on 18 March 2011. They also performed it live on BBC Radio 1's Live Lounge on 16 March 2011."]}, {"page": "Lightning (song)", "response": ["The song was written by Steve Mac, Wayne Hector and Ed Drewett. It was first premiered during the band's Spring 2011 tour, where many fans assumed it to be the first single from Battleground. The song kicks off with a thumping electronic beat, as Tom's raspy vocals come in: \"You're in control, pressing pause on my heartbeat...\". During the chorus, the band sing: \"I know it's a little bit frightening, we might as well be playing with lightning now-ow-ow.\" Band member Tom Parker said of the song, \"We all felt it was a sound like we've never done before. It's the perfect prelude to the album, and a great song to get you in the mood for a party.\" The song premiered on mainstream radio on 17 September 2011. Band member Max George said of the song, \"It was only really meant as a filler track. Something to keep the fans interested on the weeks leading up to the album release. We never knew it would be so successful.\"http://popdash.com/news/7617/the-wanted-criticise-frankie-cocozza-tease-new-collaborations"]}, {"page": "Glad You Came", "response": ["The music video was created by Director X and was filmed in Ibiza, Spain. It sees the band on the beach, in a club and at a houseparty each with an individual woman. It was uploaded to YouTube on 10 June 2011. Jay McGuiness revealed to MTV UK: \"The theory of the video was take The Wanted to Ibiza and just film everything and then just cut bits that were useable. But the girls were models, they weren't just girls we picked.\" However Max George admitted: \"Actually no, the girl I had to spend time with was just literally picked up off the street after a night out.\" The video has achieved over 212 million views on YouTube as of September, 2021; becoming their most watched video on the site. It also starred a cameo from footballer John-Joe O'Toole."]}, {"page": "Battleground (album)", "response": ["In January 2011, the group began work on their second studio album with previous songwriter and producer Steve Mac. In February 2011, it was revealed the group would be releasing the official Comic Relief single for 2011. In April 2011, the group embarked on their first headline tour, playing 16 dates in 13 different UK cities. The tour was in support of their debut album The Wanted but whilst on tour, the group previewed the song, \"Lightning\" from their new album. The track was co-written by the band and Ed Drewett. Max George confirmed on 28 September that the album was complete and the following day, Nathan Sykes confirmed the album would be released with the title Battleground."]}, {"page": "Warzone (song)", "response": ["\"Warzone\" is a song by British-Irish boy band The Wanted, released as the fourth and final single from their second studio album, Battleground (2011). It is also featured on the special edition of their self-titled EP. It was released on 26 December 2011. The electropop ballad contains elements of dubstep, and was written by band members Nathan Sykes and Max George, alongside Jack McManus and producer Harry Sommerdahl."]}, {"page": "I Found You (The Wanted song)", "response": ["Nathan Sykes told Digital Spy about the song: \"We're doing a video for it in a couple of weeks as well in LA, which is really exciting. We are just trying to lock down all the ideas for it now.\" Max George added: \"We've been working on our next album for, like, the last six months, but it's still not ready yet. We're still working away on that and we've got plenty more travelling to do yet, so I'm not actually sure when the album is going to be ready.\""]}, {"page": "Walks Like Rihanna", "response": ["*Max George – vocals"]}, {"page": "Max George (pop star)", "response": ["#REDIRECT Max George"]}, {"page": "The Wanted Life", "response": ["| Max George"]}, {"page": "List of people educated at Bolton School", "response": ["* Max George (born 1988), singer in the boy band The Wanted"]}, {"page": "Word of Mouth (The Wanted album)", "response": ["The Wanted began working on recording new material in November 2011, shortly after the release of their second studio album, Battleground. The band confirmed that they had worked with a number of different producers and collaborators whilst writing the material, in order to make something that would appeal to both American and British audiences. It was initially rumoured that the material that they were recording would be for a repackaged version of Battleground, which would contain a total of seven tracks which failed to make the initial cut, plus two brand new recordings, but this idea was later dismissed by band members Max George and Siva Kaneswaran. It was later revealed that the band had recorded a duet with a \"female mega-star\", rumoured to be Rihanna and the track, rumoured to be titled \"Jealousy\" would appear on their next album. Despite this, the band said that after the song had been mixed, tuned and finalised, the final mix \"didn't cut it\", and as such, the song had been completely scrapped, and was not going to be released."]}, {"page": "We Own the Night (The Wanted song)", "response": ["The music video directed by Frank Borin premiered on 11 August 2013, at a total length of three minutes and thirty-seven seconds. It features The Wanted in a pub, dancing with their friends and drinking alcohol. Nathan Sykes is seen sitting at the piano, Tom Parker is seen playing the acoustic guitar, Max George is seen socialising with a group of girls, and Jay McGuiness and Siva Kaneswaran are at the bar, talking to the barmaid and dancing. The video has since gathered over 48 million views on Vevo."]}]}}