{"wiki_id": "http://www.wikidata.org/entity/Q18917441", "itemLabel": "Edith Marvin", "itemDescription": "[née Deverell] (1872–1958), British inspector of schools", "wikipedia_url": "https://en.wikipedia.org/wiki/Edith_Marvin", "wikipedia_page": {"main": "Edith Mary Marvin, born Edith Mary Deverell (29 July 1872 – 20 May 1958) was a British inspector of schools.", "link_mentions": [{"page": "Eleanor Rathbone", "response": ["Rathbone was the daughter of the social reformer William Rathbone VI and his second wife, Emily Acheson Lyle. She spent her early years in Liverpool. Her family encouraged her to concentrate on social issues; the family motto was \"What ought to be done, can be done.\" Rathbone went to Kensington High School (now Kensington Prep School), London; and later went to Somerville College, Oxford, over the protests of her mother, and supported by Classics coaching from Lucy Mary Silcox. She studied with tutors outside of Somerville, which at that time did not yet have a Classics tutor, taking Roman History with Henry Francis Pelham, Moral Philosophy with Edward Caird, and Greek History with Reginald Macan. Some of these classes were taken together with Barbara Bradby, a lifelong friend. Rathbone was devoted to her studies, taking little part in the entertainments available to female students such as games, and engaging in limited socialising with male students. Her handwriting was reportedly so poor that she had to dictate her final exam papers to a typist, and she received a result in the Second class. In 1894 she was one of the seven founding members of the \"Associated Prigs\". This was the unofficial name of the discussion group that met on Sundays evenings. The first meeting was in Edith Marvin's room. They never agreed a name or leader but the group would keep notes and the links established were valuable after they left Somerville. Another founder members was Mildred Pope and other early members were Margery Fry and Hilda Oakeley."]}, {"page": "Arthur Lyon Bowley", "response": ["Bowley produced a stream of studies of British economic statistics, beginning in the 1890s with work on trade and on wages and income. His 1900 publication Wages in the United Kingdom in the Nineteenth Century was created using the unpaid assistance of Edith Marvin when she was a researcher at the London School of Economics. Proceeding to studies of national income in the 1920s and –30s. Specially noteworthy was his collaboration with Josiah Stamp on a comparison of the UK national income in 1911 and 1924. (Official national income statistics date only from the Second World War.) From around 1910 Bowley worked on social statistics as well. In aim, the work was a continuation of such surveys of social conditions as Charles Booth's \"Life and Labour of the People in London\" (1889–1903) and Seebohm Rowntree's \"Poverty, A Study of Town Life\" (1901). The methodological innovation was the use of sampling techniques. Bowley gave a detailed exposition of his approach to sampling in a 62-page paper published in 1926. The culmination of Bowley's work on social surveys was the monumental New Survey of London Life and Labour. Even in the 1930s his research could take a new direction, as when he collaborated with his junior colleague R. G. D. Allen on an econometric study of family expenditure., p. 159: \"Bowley's major contribution to econometrics was the path-breaking text Family Expenditure (1935) which he wrote in collaboration with R. G. D. Allen\"."]}, {"page": "Mildred K. Pope", "response": ["Mildred Pope was educated at Edgbaston High School, Birmingham. She read French at Somerville College, Oxford, and in 1893 was placed in the first-class of the Oxford University women's examination. Interested in Old French philology, as an undergraduate \"she had to rely mainly on tuition by correspondence from Paget Toynbee at Cambridge\".'Obituary: Prof. Mildred K. Pope', The Manchester Guardian, 18 September 1956 She taught at Somerville College, Oxford, first as a librarian, and from 1894 as a lecturer. She spent the 1894 summer vacation studying with Fritz Neumann at Heidelberg. In that year she was one of the seven founding members of the Associated Prigs. This was the unofficial name of the discussion group that met on Sundays evenings. They never agreed a name or leader but the group would keep notes and the links established were valuable after they left Somerville. Other founder members included Eleanor Rathbone and Edith Marvin."]}, {"page": "List of Somerville College, Oxford, people", "response": ["*Edith Marvin (1872–1958), inspector of schools"]}]}}