{"wiki_id": "http://www.wikidata.org/entity/Q18968", "itemLabel": "James DeGale", "itemDescription": "British boxer", "wikipedia_url": "https://en.wikipedia.org/wiki/James_DeGale", "wikipedia_page": {"main": "James Frederick DeGale  (born 3 February 1986) is a British former professional boxer who competed from 2009 to 2019. He held the IBF super-middleweight title twice between 2015 and 2018, and regionally the European and British super-middleweight titles between 2010 and 2012.\nDeGale represented Great Britain at the 2008 Olympics as an amateur, winning a gold medal in the middleweight division. He also won silver at the 2007 and 2008 EU Championships, and bronze at the 2006 Commonwealth Games. By later becoming IBF champion, he became the first British boxer in history to win both an Olympic gold medal and a professional world title.", "link_mentions": [{"page": "Harlesden", "response": ["*James DeGale"]}, {"page": "Pay-per-view", "response": ["| George Groves vs. James DeGale"]}, {"page": "The Big Fat Quiz of the Year", "response": ["In-studio guest questions came from Strictly Come Dancing contestants Jodie Kidd and Mark Foster, and 2008 Olympics Team GB gold medalists Christine Ohuruogu and James DeGale. Pre-recorded guest questions came from Katy Perry, the Fonejacker, Alan Carr, Sarah Silverman and Sir Alan Sugar. Jon Snow gave news reports on \"That's Not My Name\" and \"I Kissed A Girl\". John Hurt read from the autobiographies of Les Dennis and Christopher Biggins. The children from Mitchell Brook Primary School also returned acting out the divorce of Paul McCartney and Heather Mills and Jay-Z headlining that year's Glastonbury Festival."]}, {"page": "Lonsdale (clothing)", "response": ["On 25 March 2010, Lonsdale celebrated the 50th anniversary of the brand by holding the Lonsdale Challenge at the Liberty Boxing Gym in Nottingham, England. The event featured Lonsdale-sponsored boxers Carl Froch, James DeGale and Tony Jeffries in various boxing-related challenges.Happy 50th Birthday Lonsdale URN. Retrieved 10 May 2010", "*  James DeGale"]}, {"page": "Black British people", "response": ["In the sport of boxing, there have been multiple Black British world champions, including Lennox Lewis (three-time heavyweight world champion, two-time lineal champion, the most recent heavyweight to hold the undisputed championship, and widely viewed as one of the greatest boxers of all-time), Frank Bruno, Chris Eubank Sr., Nigel Benn, David Haye, Kell Brook, James DeGale, Anthony Joshua and Lawrence Okolie."]}, {"page": "Lucian Bute", "response": ["In mid-2015, it was announced that Bute would take part in a title fight against IBF super-middleweight champion James DeGale. The fight was DeGale's first defence of the IBF belt, and took place in Bute's adopted home-town of Quebec on 28 November 2015. After 12 rounds, the fight went to the judge's scorecards, and DeGale was awarded a unanimous decision; 116-112, 117-111, 117-111. Despite suffering the third loss of his career, Bute emerged with credit from what several commentators described as an exciting fight.", "|style=\"text-align:left;\"| James DeGale"]}, {"page": "Braehead Arena", "response": ["On 12 March, it hosted Stephen Simmons professional boxing debut match against fellow Briton Nick Okoth and won 1:36 minutes into the seconds of four rounds by way of TKO. It was followed by James DeGale's tenth professional match which was against Frenchman Alpay Kobal and won 1:37 minutes into the fifth of eight rounds by way of TKO. That was followed by Ricky Burn's defence of his WBO Super Featherweight title against Ghanaian Joseph Laryea and won after his opponent retired before the seventh of twelve rounds."]}, {"page": "Lee Cook", "response": ["Lee is a second cousin of Olympic gold medal boxer James DeGale. Lee also co commentates for local radio as well as QPR's in-house media outlet."]}, {"page": "Andre Dirrell", "response": ["On May 23, 2015, Andre Dirrell fought against British star James DeGale at the Agganis Arena in Boston. DeGale gained two knockdowns in the second round, which proved to be the difference as he won a unanimous decision over Dirrell to win a 168-pound world title. DeGale won 114-112 on two judges’ scorecards and 117-109 on the third.", "|style=\"text-align:left;\"| James DeGale"]}, {"page": "List of world super-middleweight boxing champions", "response": ["| James DeGale", "| James DeGale"]}, {"page": "List of IBF world champions", "response": ["|align=left |  James DeGale()", "|align=left |  James DeGale (2)"]}, {"page": "Mohamed Hikal", "response": ["At the 2008 Olympics, he lost his first bout to James DeGale.  At the 2012 Olympics he lost in the first round to Soltan Migitinov."]}, {"page": "Bermane Stiverne", "response": ["In 2019, Stiverne faced undefeated British heavyweight contender Joe Joyce (7-0, 7 KOs) on the undercard of Chris Eubank Jr. vs. James DeGale on February 23. Joyce was ranked #5 by the WBA at heavyweight. Joyce opened up by throwing power shots and pressing the opponent. Outshaped 40-years-old Stiverne had some successful counterattacks but stayed passive most of the time. The fight was stopped by the referee in the 6th round, Stiverne losing by TKO."]}, {"page": "Paul Smith (boxer)", "response": ["Smith boxed Beijing 2008 gold medalist, James DeGale at the Echo Arena, Liverpool on 11 December 2012. The fight was stopped in the ninth round as DeGale landed back-to-back left hooks on Smith, causing the latter to lose his British super-middleweight title.", "|style=\"text-align:left;\"| James DeGale"]}, {"page": "Majority draw", "response": ["|Badou Jack vs. James DeGale"]}, {"page": "Fulgencio Zúñiga", "response": ["|align=left| James DeGale"]}, {"page": "Caleb Truax", "response": ["|align=left| James DeGale", "|align=left| James DeGale"]}]}}