{"wiki_id": "http://www.wikidata.org/entity/Q1892933", "itemLabel": "Walter B. Woodbury", "itemDescription": "English inventor and photographer", "wikipedia_url": "https://en.wikipedia.org/wiki/Walter_B._Woodbury", "wikipedia_page": {"main": "Walter Bentley Woodbury (26 June 1834 – 5 September 1885) was an inventor and pioneering English photographer. He was an early photographer in Australia and the Dutch East Indies (now part of Indonesia). He also patented numerous inventions relating to various aspects of photography, his best-known innovation being the woodburytype photomechanical process.", "link_mentions": [{"page": "Woodbury", "response": ["* Walter B. Woodbury (1834–1885), British inventor and pioneering photographer"]}, {"page": "List of photographers", "response": ["* Walter B. Woodbury (1834–1885)"]}, {"page": "Photography in Australia", "response": ["thumb|right|Walter B. Woodbury, c1855"]}, {"page": "James Page", "response": ["*James Page (photographer), partner of Walter B. Woodbury in Woodbury & Page"]}, {"page": "Pierre Rossier", "response": ["Thanks to a number of documents of the time, it is now certain that Negretti and Zambra's photographs of China and Japan were taken by Rossier, but for many years it was thought that they might have been taken by either Walter B. Woodbury, who also had dealings with Negretti and Zambra but was based in Batavia (now Jakarta), or Abel Gower, who was an amateur photographer in Japan. The Leiden University photograph collection includes a portrait, allegedly of Gower, signed \"P. Rossier\", and in 1859 Rossier and Gower shared passage aboard HMS Sampson from Nagasaki to Edo.Rather than Gower, the portrait sitter is now considered to be John MacDonald, a member of the British Legation (Bennett PiJ, 45; 117, fig. 141)."]}, {"page": "Woodburytype", "response": ["The process was introduced by the English photographer Walter B. Woodbury and was in use during the final third of the 19th century, most commonly for illustrating fine books with photographic portraits. It was ultimately displaced by halftone processes that produced prints of lower quality but were much cheaper.", "The Woodburytype process was invented by Walter B. Woodbury and patented in 1864.Ovenden, 216; Rosenblum, 198; Bloom, 30. Auer and Auer give the date of its invention as 1866. It was the first successful photomechanical process fully able to reproduce the delicate continuous tone of photographs. It produced true middle values and did not make use of a screen or other image deconstruction method. It was often considered the most perfect, most beautiful photomechanical process and inspired a number of books, magazines, and special edition printings between 1864 and 1910. When attempts were made to adopt Woodburytype to rotary printing, the process could not compete with the quickly developing collotype and halftone photomechanical processes that almost completely replaced Woodburytype by the end of the nineteenth century."]}, {"page": "Abel Gower", "response": ["For many years it was believed that either Gower or Walter B. Woodbury was commissioned by the London firm Negretti and Zambra to photograph China and Japan between 1857 and 1860. It is now known that Pierre Rossier was the photographer in question. The Leiden University photograph collection includes a portrait of Gower, signed \"P. Rossier\", and in 1859 Rossier and Gower shared passage on  from Nagasaki to Edo.Bennett."]}, {"page": "Walter Woodbury", "response": ["#REDIRECT Walter B. Woodbury"]}, {"page": "Walter Bentley Woodbury", "response": ["#REDIRECT Walter B. Woodbury"]}, {"page": "Woodbury Glacier", "response": ["Woodbury Glacier () is a glacier just west of Montgolfier Glacier, flowing into Piccard Cove, Wilhelmina Bay, on the west coast of Graham Land. Mapped by the Falkland Islands Dependencies Survey (FIDS) from air photos taken by Hunting Aerosurveys Ltd. in 1956–57. Named by the United Kingdom Antarctic Place-Names Committee (UK-APC) in 1960 for Walter B. Woodbury (1834–1885), English pioneer of photomechanical printing in 1865 and of serial film cameras for use in balloons and kites in 1877."]}, {"page": "Hotel des Indes (Batavia)", "response": ["On the advice of none other than patron Eduard Douwes Dekker, Wyss changed the name of the hotel to the much more chic-sounding Hotel des Indes in 1856. In 1860, Wyss sold the hotel to the Frenchman Cresonnier. Louis Couperus, yet another writer, became a regular patron. Cresonnier commissioned the British photographers Walter B. Woodbury (1834–1885) and James Page (1833–1865) to photographically capture the hotel for an advertisement campaign."]}, {"page": "Jacobus Anthonie Meessen", "response": ["Meessen and his wife departed for the Indies in 1864, first arriving in Batavia, where Meessen established a photo studio in early 1867. He was one of the few photographers active in the Indies in the 1860s; contemporaries included Isidore van Kinsbergen, Adolph Schaefer, and the commercial firm of Woodbury and Page (operated by Walter B. Woodbury and James Page). Meessen hoped to eventually take images of the Indies' various lands and people. From May to August, he was in Sumatra, first in Padang and later in the Minang Highlands. There he offered various photographic services, including double and family portraits. When he returned to Batavia in September, he opened another studio, offering portraits and selling prints of landscapes."]}, {"page": "Woodbury & Page", "response": ["#REDIRECT Walter B. Woodbury"]}, {"page": "Woodbury and Page", "response": ["#REDIRECT Walter B. Woodbury"]}]}}