{"wiki_id": "http://www.wikidata.org/entity/Q18921806", "itemLabel": "Louis Greatorex", "itemDescription": "British actor", "wikipedia_url": "https://en.wikipedia.org/wiki/Louis_Greatorex", "wikipedia_page": {"main": "Louis Greatorex (born 30 December 1996) is a British actor from Duffield, Derbyshire. His television credits include the BBC1 drama series Last Tango in Halifax, in which he has played Lawrence Elliot since 2012.", "link_mentions": [{"page": "Greatorex", "response": ["*Louis Greatorex (born 1996), English actor"]}, {"page": "Last Tango in Halifax", "response": ["Other characters introduced in the first series include Caroline's husband John (Tony Gardner) and his lover Judith (Ronni Ancona), Gillian's brother-in-law, Robbie (Dean Andrews), and Paul (Sacha Dhawan), a youth with whom Gillian has a sexual relationship. Josh Bolt plays Gillian's son Raff, whilst Edward Ashley and Louis Greatorex play Caroline's teenage sons William and Lawrence. The second series expanded the families of Alan and Celia. Timothy West appears as Alan's brother Ted whilst Gemma Jones plays Celia's sister Muriel. The third series later introduces Rupert Graves as Gary, who is revealed to be Alan's illegitimate son, and Michelle Hurst as Kate's mother Ginika."]}, {"page": "Caroline Dawson", "response": ["Caroline is introduced in Last Tango in Halifaxs series premiere (2012), as a successful headmistress dealing with the fallout of her husband's affair and her own clandestine liaison with Kate. At the climax of the episode she is shocked to learn that her mother Celia has decided to marry Alan; an old love interest she had recently met for the first time in sixty years. She is also shocked upon discovering that Alan is father to Gillian, a working-class woman who Caroline has previously insulted. After learning that John is still seeing his lover Judith (Ronni Ancona), Caroline tells him he has no right to carry on living in their marital home. She grows closer to Kate, and explains to her that she finds it hard to be open with her feelings, having long suppressed her emotions. In the following episode, Caroline grows closer to Gillian after their respective parents go missing. She admits to John that she has moved on and began seeing someone else. When Caroline makes her relationship with Kate official, her eldest son William (Edward Ashley) takes it in his stride, but her younger son Lawrence (Louis Greatorex) is upset. When Judith arrives at Caroline's house she learns of the relationship and informs John who tells Celia. Celia refuses to accept that her daughter is gay and her bigoted words and attitude at a dinner party drive Kate away. Caroline has an angry argument with her mother, blaming her for her emotional repression and for ruining her chance of happiness with Kate. She reminds her that she had previously tried to come out to her at the age of 18, and that it had been her prejudices that had forced her to live a closeted existence. Celia, realising that she may have ruined her relationship with both her daughter and the liberal-minded Alan, is compelled to ask Kate to give Caroline another chance."]}, {"page": "Safe (TV series)", "response": ["* Louis Greatorex as Henry Mason, Sophie's teenage son"]}, {"page": "The Last Post (TV series)", "response": ["*Louis Greatorex as Lance Corporal Paul Stoneham"]}, {"page": "The Bay (TV series)", "response": ["*Louis Greatorex as Sam Hesketh"]}]}}