{"wiki_id": "http://www.wikidata.org/entity/Q1894021", "itemLabel": "Henry FitzJames", "itemDescription": "1st Duke of Albemarle in the Jacobite peerage", "wikipedia_url": "https://en.wikipedia.org/wiki/Henry_FitzJames", "wikipedia_page": {"main": "Henry FitzJames (6 August 1673 – 16 December 1702), titular 1st Duke of Albemarle in the Jacobite peerage, was the illegitimate son of King James II of England and VII of Scotland by Arabella Churchill, sister of the first Duke of Marlborough.", "link_mentions": [{"page": "1702", "response": ["* December 16 – Henry FitzJames, illegitimate son of King James II of England and VII of Scotland by Arabella Churchill (b. 1673)"]}, {"page": "House of Stuart", "response": ["*****  Henry FitzJames (illegitimate)"]}, {"page": "Duke of Albemarle", "response": ["* Henry FitzJames, \"1st Duke of Albemarle\" (1673–1702), illegitimate son of James II was created a peer by his father in exile"]}, {"page": "Jacobite peerage", "response": ["||Duke of Albemarle||13 January 1696||FitzJames||extinct 27 December 1702||England||for Henry FitzJames, an illegitimate son of King James II and VII. He also bore the title of Grand Prior of England.||"]}, {"page": "List of the priors of Saint John of Jerusalem in England", "response": ["* Henry FitzJames, Grand Prior 1689-1701."]}, {"page": "Earl of Rochford", "response": ["*Henry FitzJames, illegitimate son of James II, created Duke of Albemarle, together with the subsidiary titles of Earl of Rochford and Baron Romney, by his father on 13 January 1696."]}, {"page": "James II of England", "response": ["| Henry FitzJames, 1st Duke of Albemarle"]}, {"page": "List of nicknames of European royalty and nobility: G", "response": ["* the Great Prior: Henry FitzJames"]}, {"page": "Henry FitzJames, 1st Duke of Albemarle", "response": ["#REDIRECT Henry FitzJames"]}, {"page": "1673 in England", "response": ["* August – Henry FitzJames, illegitimate son of James II (died 1702)"]}, {"page": "Henry Fitzjames, 1st Duke of Albemarle", "response": ["#REDIRECT Henry FitzJames"]}, {"page": "Honora Burke", "response": ["She died on 16 January 1698 of consumption, leaving her husband in \"great grief\". She was buried in the Convent of English Benedictines in Pontoise. Her burial was attended many prominent Jacobites: Henry FitzJames (Berwicks's brother), Lord Perth, Melfort, Richard Hamilton, James Porter, Lord Waldegrave, and Dominic Maguire (the Primate of all Ireland)."]}, {"page": "Colonel Bryan Magauran", "response": ["Another Mág Samhradháin was a captain in the infantry regiment of Colonel Henry FitzJames (1st Duke of Albemarle in the Jacobite peerage) under the command of Lieutenant-Colonel Thomas Corbet. His first name is not given but he was probably a relation of Brian Mág Samhradháin."]}, {"page": "Daniel O'Donnell (Irish Brigade)", "response": ["O'Donnell was born in 1666, and was appointed a captain of foot in King James's army 7 December 1688, and in 1689 was acting colonel. Passing into the service of France after the treaty of Limerick, he could only obtain the rank of captain in the marine regiment of the Irish Brigade. This regiment had been raised in Ireland for King James in 1689, and was commanded by Henry FitzJames, grand prior of England, a natural son of the king and brother of the Duke of Berwick. O'Donnell, whose commission was dated 4 February 1692, served with this regiment on the coast of Normandy during the projected invasion of England, which was averted by Edward Russell's victory at the naval Battle of La Hogue, and afterwards in Germany in the campaigns of 1693–1695."]}]}}