{"wiki_id": "http://www.wikidata.org/entity/Q18954181", "itemLabel": "Emma Stirling", "itemDescription": "Stirling, Emma Maitland (1838/9–1907), activist in child welfare and emigration to Canada", "wikipedia_url": "https://en.wikipedia.org/wiki/Emma_Stirling", "wikipedia_page": {"main": "Emma Maitland Stirling (1839 - 1907) was a British activist in child welfare and in arranging their emigration to Canada. She created the organisation that became the Scottish Society for the Prevention of Cruelty to Children (a.k.a. Children 1st), but her contribution was not acknowledged in their history.", "link_mentions": [{"page": "Aylesford, Nova Scotia", "response": ["*Emma Maitland Stirling, philanthropistEmma Stirling's Work for Children, Youth and Young Women, 1894–95 by Julielynne Marie AndersonGirard, Philip. \"Stirling, Emma Maitland\". Oxford Dictionary of National Biography. 2004 edition. Online, www.oxforddnb.com (accessed on various dates 2007).Girard, Philip. \"Children, Church, Migration and Money: Three Tales o f Child Custody in Nova Scotia.\" Children's Voices in Atlantic Literature and Culture: Essays on Childhood. Edited by Hilary Thompson. Guelph: Canadian Children's Press, 1997.10-23; Girard, Philip. \"Victorian Philanthropy and Child Rescue: The Career of Emma Stirling in Scotland and Nova Scotia, 1860–95.\" Myth, Migration and the Making of Memory: Scotia and Nova Scotia c. 1700–1990. Edited by Marjory Harper and Michael E. Vance. Halifax: The Gorsebrook Research Institute, 1999.218-231."]}, {"page": "Children 1st", "response": ["The official history of the society ignores the role of Emma Stirling which the Oxford Dictionary of National Biography believes may be due to her gender or a legal dispute, but it was Stirling who created the first, and later eight, home for abused and neglected Scottish children in 1884.Philip Girard, 'Stirling, Emma Maitland (1838/9–1907)’, Oxford Dictionary of National Biography, Oxford University Press, 2004 accessed 9 Aug 2017 Another source agrees that Stirling's Edinburgh society was the precursor of the Scottish Society for the Prevention of Cruelty to Children."]}, {"page": "Emma Maitland Stirling", "response": ["#REDIRECT Emma Stirling"]}]}}