{"wiki_id": "http://www.wikidata.org/entity/Q18915223", "itemLabel": "Walter Myers", "itemDescription": "British pathologist", "wikipedia_url": "https://en.wikipedia.org/wiki/Walter_Myers_(physician)", "wikipedia_page": {"main": "Walter Myers BSc, MA, MB BChir, MRCS, LRCP (28 March 1872 – 20 January 1901) was a British physician, toxicologist and parasitologist who died of yellow fever aged 28 while studying the disease in Brazil.", "link_mentions": [{"page": "Walter Myers", "response": ["Walter Myers may refer to:", "*Walter Myers (physician), British physician, toxicologist and parasitologist"]}, {"page": "Walter Churchill", "response": ["Group captain Walter Myers Churchill,  (24 November 1907 – 27 August 1942) was a Royal Air Force pilot and flying ace during World War II.", "Churchill was named after his uncle Walter Myers, an eminent physician and bacteriologist who died in 1901 aged 28. He was educated at Sedbergh School,\"Deaths.\" Times [London, England] 3 August 1943: 6. The Times Digital Archive. Web. 3 April 2013. and in 1926 read Modern Languages at King's College, Cambridge. He then became an aeronautical engineer with Armstrong Siddeley Motors, Coventry, after which he started an aviation precision engineering company, Churchill Components (Coventry) Ltd, in 1937, which supplied machined parts such as exhaust valves for radial aero-engines to Armstrong Siddeley. After being blitzed out of Coventry in 1941, the company re-located to Market Bosworth.History of JJ Churchill Ltd The company worked for Sir Frank Whittle, the jet-engine pioneer, and it machined compressor blades for the gas-turbine engines in the early 1940s.", "* 31 May 1940: Flight Lieutenant Walter Myers Churchill is awarded the Distinguished Flying Cross:", "* 31 May 1940: Flight Lieutenant Walter Myers Churchill DFC (90241) is appointed a Companion of the Distinguished Service Order:"]}, {"page": "Herbert Durham", "response": ["In June 1900 under the auspices of the Liverpool School of Tropical Medicine and accompanied by fellow eminent Cambridge parasitologist , Dr Walter Myers, Durham led the Yellow Fever Expedition to Brazil.The Times, 20 Feb 1901; pg. 4; Issue 36383The Wellcome Library In 1881 the Cuban epidemiologist Dr Carlos Finlay was the first to theorise that yellow fever was transmitted by mosquitoes, but this remained unproven in the wider scientific community. While en route to Brazil they visited the U.S. Naval Hospital in Washington where they met U. S. Surgeon General George Miller Sternberg who is considered the first U.S. bacteriologist, and then proceeded to Havana where they met Dr Finlay and his co-workers on 25 July 1900, and also the U.S. Army Yellow Fever Commission, led by Dr Walter Reed, which subsequently confirmed Dr Finlay's theory. Among Reed's team was bacteriologist Dr Jesse Lazear who died a month later on 26 September aged 34 while investigating the disease. On 24 August Durham and Myers arrived in Pari (modern day Belem) in the northern state of Pará, Brazil, where they established a laboratory to study the transmission of the disease and were among the first to establish its transmission by mosquitoes. Durham and Myers were aware of the risks that they were taking; however, on 16 January 1901, after conducting the fourteenth autopsy on victims of yellow fever both men found they were themselves infected. They were transferred to the Domingos Freire Isolation Hospital in Pari where Durham recovered but Myers died four days later, aged 28.Obituary of Dr Walter Myers in the British Medical Journal BMJ 1901;1:310The National Archives In his subsequent report Durham deduced that they had both been infected through mosquito bites."]}, {"page": "Alfredo Kanthack", "response": ["Shortly before his death he recommended one of his promising students, Walter Myers, for a John Lucas Walker scholarship."]}, {"page": "List of alumni of Gonville and Caius College, Cambridge", "response": ["*Walter Myers – physician and parasitologist"]}]}}