{"wiki_id": "http://www.wikidata.org/entity/Q1900377", "itemLabel": "Mark Ridley", "itemDescription": "British zoologist", "wikipedia_url": "https://en.wikipedia.org/wiki/Mark_Ridley_(zoologist)", "wikipedia_page": {"main": "Mark Ridley (born 1956) is a British zoologist and writer on evolution.\nHe studied at both Oxford and Cambridge in the 1980s (his doctoral advisor being Richard Dawkins), and later worked at Emory University. As of 2010 he worked as a research assistant at the Department of Zoology, Oxford University. Ridley has worked on the evolution of reproductive behaviour and written a number of popular accounts of evolutionary biology, including articles for the New York Times, The Sunday Times, Nature, New Scientist and The Times Literary Supplement. He is sometimes confused with Matt Ridley, another writer on evolution who is also from the UK.", "link_mentions": [{"page": "Matt Ridley", "response": ["In 2006, Ridley contributed a chapter to Richard Dawkins: How a Scientist Changed the Way We Think, a collection of essays in honour of his friend Richard Dawkins (edited by his near-namesake Mark Ridley)."]}, {"page": "Royal Society Prizes for Science Books", "response": ["* Mendel's Demon by Mark Ridley"]}, {"page": "Mark Ridley", "response": ["Mark Ridley may refer to:", "* Mark Ridley (physician) (1560–1624), English physician and mathematician", "* Mark Ridley (zoologist) (born 1956), English zoologist", "* Mark Ridley-Thomas (born 1954), Californian politician"]}, {"page": "Helena Cronin", "response": ["The evolutionary zoologist Mark Ridley, reviewing The Ant and the Peacock in the New York Times, writes that it is a \"fine book\" in which Cronin uses our modern understanding of altruism (the ant) and \"dangerously gaudy sexual ornamentation\" (the peacock). Ridley notes that there are two reasons for sex differences like the peacock's train, and that Cronin explains them through the debate of Charles Darwin and Alfred Russel Wallace. Darwin proposed female choice: female aesthetics drive male displays. Wallace both \"ignored Darwin's problem\" (ornamentation) and \"denied Darwin's solution\" (female choice rather than natural selection). In Ridley's opinion, \"The subtlest and most original insights in \"The Ant and the Peacock\" concern differences between Darwin's ideas and modern ideas.\" The review of The Ant and the Peacock in Biology and Philosophy was favorable.\""]}, {"page": "Marian Dawkins", "response": ["* Living with the Selfish Gene. One of  the collected essays in  Richard Dawkins: How a Scientist Changed the Way We Think. Editors: Alan Grafen, Mark Ridley. Oxford University Press. 2006."]}, {"page": "Mark (given name)", "response": ["*Mark Ridley (zoologist) (born 1956), British zoologist and writer on evolution", "*Mark Ridley (disambiguation)"]}, {"page": "Paleobiology", "response": ["* Mark Ridley, ed. (2004). Evolution.  Oxford, England: Oxford University Press.  and .  An anthology of analytical studies in paleobiology."]}, {"page": "Richard Dawkins: How a Scientist Changed the Way We Think", "response": ["Richard Dawkins: How a Scientist Changed the Way We Think is a festschrift of 25 essays written in recognition of the life and work of Richard Dawkins. It was published in 2006, to coincide with the 30th anniversary of the publication of The Selfish Gene. A wide range of topics is covered from many fields including evolutionary biology, philosophy, and psychology. Space is also given to writers who are not in full agreement with Dawkins. The book is edited by two of Dawkins' former PhD students, Alan Grafen and Mark Ridley. ()"]}, {"page": "Guy Coburn Robson", "response": ["Robson is best known for his major book The Variations of Animals in Nature (co-authored with O. W. Richards, 1936) which argued that although the fact of evolution is well established, the mechanisms are largely hypothetical and undemonstrated.Allee, W. C. (1937). The Variation of Animals in Nature: A Critical Summary and Judgment of Evolutionary Theories by G. C. Robson, O. W. Richards. American Journal of Sociology 42 (4): 596–597. The book claims that most differences among animal populations and related species are non-adaptive. It was published before major developments in the modern synthesis and contains critical evaluation of natural selection. It was positively reviewed in science journals in the 1930s.G. S. C. (1936). The Variation of Animals in Nature. Nature 137: 680–681. Zoologist Mark Ridley has noted that \"Robson and Richards suggested that the differences between species are non-adaptive and have nothing to do with natural selection.\"Ridley, Mark. (1993). Evolution. Blackwell Scientific. p. 17. "]}, {"page": "Alan Grafen", "response": ["Alan Grafen  is a Scottish ethologist and evolutionary biologist. He currently teaches and undertakes research at St John's College, Oxford.http://users.ox.ac.uk/~grafen/ Alan Grafen's Web Page at Oxford University Along with regular contributions to scientific journals, Grafen is known publicly for his work as co-editor (with Mark Ridley) of the 2006 festschrift Richard Dawkins: How a Scientist Changed the Way We Think, honouring the achievements of his colleague and former academic advisor. He has worked extensively in the field of biological game theory, and, in 1990, devised a model showing that Zahavi's well-known handicap principle could theoretically exist in natural populations."]}, {"page": "The Oxford Book of Modern Science Writing", "response": ["*The Explanation of Organic Diversity by Mark Ridley"]}, {"page": "Dawkins vs. Gould", "response": ["To Gould, there is a conservative pattern of history indicated by a reduction in disparity as measured by both the lack of new body plans and the lack of any major modifications of old ones. Given that evolution in general has not ceased in the past 500 million years, this poses a number of questions. However, Dawkins and more so his former student Mark Ridley think Gould's basic claim about history's pattern is incorrect. Central to Ridley's approach is cladistics, in which the purpose of biological systematics is to discover and represent genealogical relationships between species. Biological classifications are thus evolutionary genealogies, where only monophyletic groups (e.g. genera, families, orders, classes, phyla) are recognised and named. To cladists, similarity and dissimilarity are not objective features of the living world; they are products of human perceptions. Thus, whereas some morphological and physiological differences are more salient to us, and more striking or surprising, this is a fact about us, not the history of life. Conversely, genealogical reconstructions—who is related to whom—are objective facts independent of the observer's perception. Sterelny discusses how both cladists and Dawkins think that Gould overestimates Cambrian disparity, and he notes that while the distinction between disparity and diversity is very plausible, in the absence of a good account of the nature of disparity, and objective measures, \"the existence of Gould's puzzling pattern remains conjectural\". (p. 141)"]}, {"page": "Precambrian rabbit", "response": ["Several authors have written that J. B. S. Haldane (1892–1964) said that the discovery of a fossil rabbit in Precambrian rocks would be enough to destroy his belief in evolution. However these references date from the 1990s or later. In 1996 Michael J. Benton cited the 1993 edition of Mark Ridley's book Evolution, Richard Dawkins wrote in 2005 that Haldane was responding to a challenge by a \"Popperian zealot\". In 2004 Richa Arora wrote that the story was told by John Maynard Smith (1920–2004) in a television programme.  John Maynard Smith attributed the phrase to Haldane in a conversation with Paul Harvey in the early 1970s."]}, {"page": "Gordon Rattray Taylor", "response": ["Zoologist Mark Ridley negatively reviewed the book concluding that Taylor had a \"complete lack of biological imagination\". Ridley states that Taylor appears to have failed to have familiarised himself with Darwinian thinking before criticising it, and particularly that Taylor has made the \"familiar and elementary\" mistake of conflating natural selection with chance. Ridley states that Taylor's alternative to Darwinian evolution is described \"only in general outline\", involving \"Lamarckism and other inarticulated internal factors\"."]}, {"page": "List of festschrifts", "response": ["|Alan Grafen and Mark Ridley"]}, {"page": "Ridley (name)", "response": ["* Lancelot Ridley (died 1576), divinity rector of Stretham and father of physician Mark Ridley", "* Mark Ridley (physician) (1560–1624), English physician and mathematician", "* Mark Ridley (zoologist) (born 1956), English zoologist"]}]}}