{"wiki_id": "http://www.wikidata.org/entity/Q190151", "itemLabel": "Bruce Dickinson", "itemDescription": "English singer", "wikipedia_url": "https://en.wikipedia.org/wiki/Bruce_Dickinson", "wikipedia_page": {"main": "Paul Bruce Dickinson (born 7 August 1958) is an English musician who is the lead singer of the heavy metal band Iron Maiden since 1981.\nDickinson began his career in music fronting small pub bands in the 1970s while attending school in Sheffield and university in London. In 1979, he joined British new wave heavy metal band Samson, with whom he gained some popularity under the stage name \"Bruce Bruce\" and performed on two studio records. He left Samson in 1981 to join Iron Maiden, replacing Paul Di'Anno, and debuted on their 1982 album The Number of the Beast. During his first tenure in the band, they issued a series of US and UK platinum and gold albums in the 1980s and early 1990s.\nDickinson quit Iron Maiden in 1993 (being replaced by Blaze Bayley) to pursue his solo career, which saw him experiment with a wide variety of heavy metal and rock styles. He re-joined the band in 1999, along with guitarist Adrian Smith, with whom he has released six subsequent studio albums. Since his return to Iron Maiden, he issued one further solo record in 2005, Tyranny of Souls. His younger cousin, Rob Dickinson, is the former lead singer of British alternative rock band Catherine Wheel, while his son, Austin, fronted the metalcore band Rise to Remain.\nOutside his career in music, Dickinson has pursued a number of other activities. He undertook a career as a commercial pilot for Astraeus Airlines, which led to a number of media-reported ventures such as captaining Iron Maiden's converted charter aeroplane, Ed Force One, during their world tours. Following Astraeus' closure, he created his own aircraft maintenance and pilot training company, Cardiff Aviation, in 2012. Dickinson presented his own radio show on BBC Radio 6 Music from 2002 to 2010, and has also hosted television documentaries, authored novels and film scripts, created a beer with Robinsons Brewery and competed at fencing internationally.", "link_mentions": [{"page": "August 7", "response": ["*  1958   – Bruce Dickinson, English singer-songwriter and guitarist"]}, {"page": "And did those feet in ancient time", "response": ["Blake's lyrics have also been set to music by other composers without reference to Parry's melody. Tim Blake (synthesiser player of Gong) produced a solo album in 1978 called Blake's New Jerusalem, including a 20-minute track with lyrics from Blake's poem. Mark E. Smith of The Fall interpolated the verses with a deadpan rant against his native land in the track \"Dog is life/Jerusalem\" from the 1988 ballet score \"I Am Kurious Oranj\". The words, with some variations, are used in the track \"Jerusalem\" on Bruce Dickinson's album The Chemical Wedding, which also includes lines from book two of Milton. Finn Coren also created a different musical setting for the poem on his album The Blake Project: Spring. The Verve also referenced the song in their 2008 song Love Is Noise from the album Forth. Lead singer and writer Richard Ashcroft said that Blake had influenced the lyric 'Will those feet in modern times' from the song.https://www.youtube.com/watch?v=9rXLSWrFVqg The Verve – Love is Noise (Interview) – \"Look at it in the first few lines, as a kind of remake of Jerusalem by William Blake, rather than those feet in ancient times, its those feet in modern times.\" This is not the first Verve song influenced by Blake, as their previous single History also featured the lyrics \"I wandered lonely streets/Behind where the old Thames does flow/And in every face I meet\", referencing Blake's \"London\"."]}, {"page": "G. K. Chesterton", "response": ["Chesterton's hymn \"O God of Earth and Altar\" was printed in The Commonwealth and then included in the English Hymnal in 1906. Several lines of the hymn are sung in the beginning of the song \"Revelations\" by the British heavy metal band Iron Maiden on their 1983 album Piece of Mind. Lead singer Bruce Dickinson in an interview stated \"I have a fondness for hymns. I love some of the ritual, the beautiful words, Jerusalem and there was another one, with words by G.K. Chesterton O God of Earth and Altar – very fire and brimstone: 'Bow down and hear our cry'. I used that for an Iron Maiden song, \"Revelations\". In my strange and clumsy way I was trying to say look it's all the same stuff.\""]}, {"page": "Metallica (album)", "response": ["Iron Maiden vocalist Bruce Dickinson said that Metallica should be given huge credit for \"grabbing the opportunity when it came up, taking the risk and deservedly reaping the enormous rewards\", and that their achievement with the album cannot be underestimated. He also shared his thoughts on it as well, \"It's one of those seminal albums that just gets it right. It's extremely well-produced, and every note on that album is totally under control. I admire how they did it, and what they did with the songs, and it was very effective: it undoubtedly did help push metal into the mainstream.\""]}, {"page": "Monty Python", "response": ["In 2009, to commemorate the 40th anniversary of the first episode of Monty Python's Flying Circus, a six-part documentary entitled Monty Python: Almost the Truth (Lawyers Cut) was released, featuring interviews with the surviving members of the team, as well as archive interviews with Graham Chapman and numerous excerpts from the television series and films.\"Monty Python – Almost the Truth: the BBC Lawyers' Cut\". BBC. Retrieved 22 August 2019 Each episode opens with a different re-recording of the theme song from Life of Brian, with Iron Maiden vocalist and Python fan Bruce Dickinson performing the sixth."]}, {"page": "1958", "response": ["** Bruce Dickinson, English musician (Iron Maiden)"]}, {"page": "Brian May", "response": ["Queen performed at the closing ceremony of the 2012 Summer Olympics in London on 12 August 2012. May performed part of the \"Brighton Rock\" solo before being joined by Taylor and solo artist Jessie J for a performance of \"We Will Rock You\". On 16 September 2012, May appeared at the Sunflower Jam charity concert at the Royal Albert Hall, performing alongside bassist John Paul Jones (of Led Zeppelin), drummer Ian Paice (of Deep Purple), and vocalists Bruce Dickinson (of Iron Maiden) and Alice Cooper."]}, {"page": "John Paul Jones (musician)", "response": ["Brian May of Queen, drummer Ian Paice of Deep Purple, and vocalists Bruce Dickinson of Iron Maiden and Alice Cooper.\"Led Zeppelin, Iron Maiden and Queen band members perform at charity rock show\" . NME. Retrieved 4 November 2012"]}, {"page": "Rock and Roll Hall of Fame", "response": ["In 2018, Bruce Dickinson of Iron Maiden criticized the Hall of Fame by calling it \"an utter and complete load of bollocks ... run by a bunch of sanctimonious bloody Americans who wouldn’t know rock 'n' roll if it hit them in the face.\" Dickinson has also expressed an overall distaste for the Hall of Fame entity, arguing that \"if you put [music] in a museum, then it's dead.\" Iron Maiden had been eligible for induction since 2004. Hard rock and heavy metal website Blabbermouth.net observed how it had taken Kiss 15 years to be inducted and Deep Purple 23 years. Regarding his band's non-induction into the Hall, Judas Priest bassist Ian Hill stated in a 2019 interview, \"I don't think they like heavy metal music in general.\"  In 2018, when British rock band Dire Straits were inducted, Grammy Award winner and bandleader Mark Knopfler did not attend the ceremony and offered no official explanation.  Several people criticized the 2020 inductions because Dave Matthews Band were not part of the class despite them topping the fan vote."]}, {"page": "Dave Mustaine", "response": ["Mustaine used B.C. Rich guitars early in his career (and for his entire duration with Metallica), most notably a B.C. Rich Bich 10 string with just the regular six strings. First the guitar started in a natural finish, but Mustaine painted it black around the time 'Peace Sells' was released. In 1987, he switched to Jackson Guitars. In March 2009, while he was guest hosting Bruce Dickinson's Friday night radio show, Mustaine attributed his choice of the Flying V guitar to being a fan of UFO's Michael Schenker when he was growing up."]}, {"page": "Bon Jovi", "response": ["After two moderately successful albums, the group changed its approach and hired professional songwriter Desmond Child as a collaborator. Bruce Fairbairn was chosen to produce and, in early 1986, Bon Jovi moved to Vancouver, Canada to spend six months recording a third album. They named it Slippery When Wet after visiting a strip club in Vancouver. On August 16, 1986, Slippery When Wet was released and it spent eight weeks atop the Billboard 200. The first two singles from the album, \"You Give Love a Bad Name\" and \"Livin' on a Prayer\", both hit number one on the Billboard Hot 100. Slippery When Wet was named 1987's top-selling album by Billboard, and \"Livin' On A Prayer\" won an MTV Video Music Award for Best Stage Performance. The band won an award for Favorite Pop/Rock Band at the American Music Awards and an award for Favorite Rock Group at the People's Choice Awards. When Slippery When Wet was released in August 1986, Bon Jovi was the support act for 38 Special. By the end of 1986, Bon Jovi were well into six months of headline dates in arenas across America. In August 1987, they headlined England's Monsters of Rock festival. During their set, Dee Snider, Bruce Dickinson and Paul Stanley guested to perform \"We're an American Band\". The band ended the year having headlined 130 shows in the \"Tour Without End\", grossing $28,400,000. Asked what this breakthrough to worldwide fame meant, Jon Bon Jovi said, \"Everything is bigger, and it moves twice as fast. You're recognized twice as often. This is bigger, the whole world gets bigger. You have to sell more records, be huger. You get smarter and you understand the business a little more, so it's more responsibility. You understand it now, and you want to make sure everything goes right\"."]}, {"page": "Portmeirion", "response": ["*Iron Maiden recorded a song called \"The Prisoner\" on their 1982 album, The Number of the Beast. In a documentary programme about that album (as part of the Classic Albums TV series), lead singer Bruce Dickinson wanders through the avenues of Portmeirion and describes how the song was written and how the band's manager obtained permission from Patrick McGoohan to use dialogue from the show in the song's introduction."]}, {"page": "Catherine Wheel (band)", "response": ["Catherine Wheel formed in 1990, comprising singer-guitarist Rob Dickinson (cousin of Iron Maiden's Bruce Dickinson), guitarist Brian Futter, bassist Dave Hawes, and drummer Neil Sims. Hawes had previously played in a Joy Division-influenced band called Eternal. They took their moniker from the firework known as the Catherine wheel, which in turn had taken its name from the medieval torture device of the same name. The band was sometimes included in the shoegazing scene, characterized by bands that made extensive use of guitar feedback and droning washes of noise, as well as their continuous interaction with extensive numbers of effects pedals on the stage floor."]}, {"page": "Dream Theater", "response": ["After the fourth show, Charlie Dominici was let go because the band was starting to feel the limitations of his voice based upon the vocal style they wanted. The band was looking for a singer with a style more like Bruce Dickinson or Geoff Tate, and Dominici's stage presence was not what they wanted for a front man. Shortly after, however, the band Marillion asked Dream Theater to open for them at a gig at the Ritz in New York, so Dominici was given the opportunity to perform one last time. It would be another two years before Dream Theater had a replacement vocalist.", "Following Dominici's departure, Dream Theater fought successfully to be released from their contract with Mechanic, and set about auditioning singers and writing material for their next album. In their search for a new singer, they auditioned over 200 people, among them former Fates Warning front man John Arch. John ultimately decided that his personal commitments were more important and he opted not to join the band. On June 9, 1990, at a gig at Sundance in Bay Shore, New York, Dream Theater introduced Steve Stone as their new singer after playing half the set as an instrumental band. Stone had successfully recorded demos with Dream Theater, but he was fired following a single, ill-fated live performance. According to Mike Portnoy, Stone moved around the stage in a rather odd manner, seemingly doing a bad impression of Bruce Dickinson. Additionally, he shouted \"Scream for me Long Beach!\" several times throughout the show (Dickinson can be heard saying this on Iron Maiden's live album Live After Death), although they were actually performing in Bay Shore. The audience was immediately turned off by the new singer.  It was five months before Dream Theater played another show, this time all-instrumental (under the name YtseJam). Until 1991, the band remained focused in an attempt to hire another singer and writing additional music. It was during this period that they wrote the majority of what would become Images and Words (1992)."]}, {"page": "Chiswick", "response": ["Among those who have lived in Chiswick are the novelist Anthony Burgess (1917–1993), at 24 Glebe Street in the mid-1960s; the playwright Harold Pinter (1930-2008) who lived at 373 Chiswick High Road; the pianist and broadcaster Sidney Harrison (1903-1986) who in the 1960s lived at 57 Hartington RoadMusical Times No 1426, December 1961, p 749 (Front Matter) and later at 37 The Avenue;Writers Directory, 1980-1982, p 534 the musical double act Bob and Alf Pearson, Bob (1907–1985) on Netheravon Road in the 1940s, and Alf (1910–2012) on Linden Gardens in the 1950s; the pop artist Peter Blake (1932–), in Chiswick since 1967, with a \"vast\" studio in a former ironmonger's warehouse; the actor Hugh Grant (1960– ), who grew up in Chiswick, living next to Arlington Park Mansions on Sutton Lane; the singer Bruce Dickinson (1958– ) of the band Iron Maiden; the TV presenter Kate Humble (1968– ); the actress Elizabeth McGovern (1961– ) and her husband, film director Simon Curtis (1960– ); American lawyer John Lowenthal (1925–2003), and model Cara Delevingne (1992– )."]}, {"page": "Slipknot (band)", "response": ["The members of Slipknot are also influenced by Kiss, Black Sabbath, Slayer, Jimi Hendrix, Deicide, Pantera, Anthrax, Metal Church, Judas Priest, Megadeth, Sepultura, White Zombie, Alice in Chains, Malevolent Creation, Danny Heifetz, Nine Inch Nails, Neurosis, Led Zeppelin, Queen, The Melvins, N.W.A, Skinny Puppy, Mayhem, Dimmu Borgir, Iron Maiden, Emperor, Beastie Boys, Morbid Angel, Cannibal Corpse, Misfits, Gorefest, Run-DMC, Black Flag, Dead Kennedys, and Metallica. Taylor has spoken of his admiration for vocalists Freddie Mercury, Bruce Dickinson, David Lee Roth, Bruce Springsteen and James Hetfield. In 1999, Chris Fehn said Sid Wilson is influenced by jungle music and rave music."]}, {"page": "Jethro Tull (band)", "response": ["Jethro Tull's influence on musicians includes Iron Maiden's Steve Harris and Bruce Dickinson, Pearl Jam's Eddie Vedder, Dream Theater's John Myung, Blind Guardian's Marcus Siepen, Joe Bonamassa, the Decemberists' Jenny Conlee and folk doom metal band Blood Ceremony. Rush's Geddy Lee, for example, said about Jethro Tull: \"I was a massive Tull fan from very young ... and, I hope, that too reflects in Rush. I was mesmerised by Ian Anderson. His presentation was simply magical and he delivered it with such a sense of humour and great style ... We [of Rush] saw it as a huge challenge to try and create something that can seem so dynamic onstage.\""]}, {"page": "Comic Relief", "response": ["| Smear Campaign (Bruce Dickinson, Rowan Atkinson, Angus Deayton)"]}, {"page": "Kill Devil Hills, North Carolina", "response": ["* The 2005 heavy metal album Tyranny of Souls by Iron Maiden frontman Bruce Dickinson features a track named \"Kill Devil Hill\".  The song is about the flight made by the Wright brothers."]}, {"page": "Alice Cooper", "response": ["Cooper supported Iron Maiden on their Maiden England World Tour from June to July 21, 2012, and then headlined Bloodstock Open Air on Sunday August 12. On September 16, 2012, Cooper appeared at the Sunflower Jam charity concert at the Royal Albert Hall, London, performing alongside Brian May lead guitarist of Queen, bass guitarist John Paul Jones of Led Zeppelin, drummer Ian Paice of Deep Purple, and Iron Maiden vocalist Bruce Dickinson.", "In 1999, Cleopatra Records released Humanary Stew: A Tribute to Alice Cooper featuring a number of contributions from rock and metal all-star collaborations, including Dave Mustaine, Roger Daltrey, Ronnie James Dio, Slash, Bruce Dickinson and Steve Jones. Sonic.net described it as \"intriguing combinations of artists and material\" while Allmusic.com noted \"the novel approach will definitely hold interested listeners' attention\"."]}, {"page": "Stomp 442", "response": ["In a 1996 interview with Tom Russell of Glasgow-based radio Clyde 1, Bruce Dickinson revealed that the original design for the cover art was done for his album Balls to Picasso – originally to be titled Laughing in the Hiding Bush – but he couldn't afford it. His album's title was changed and he drew two squares on a toilet wall for the cover."]}, {"page": "Eddie Vedder", "response": ["Other singers like Roger Daltrey of the Who and Bruce Dickinson of Iron Maiden have praised him for his singing ability. Hit Parader magazine placed him at number 23 on their list of the \"Top 100 Metal Vocalists of All Time\". His solo album Into the Wild was ranked at no. 20 on the list of Top 20 Rock 'n' Roll Solo Albums by Consequence of Sound."]}, {"page": "List of one-hit wonders on the UK Singles Chart", "response": ["In 1991, Gareth Hale and Norman Pace were a comedy double-act known at the time for starring in their own sketch comedy series on ITV. \"The Stonk\", a charity single for Comic Relief, was produced by Queen guitarist Brian May, who also performed on the song, had his name printed on the front coverLondon Records 90 Ltd LON 296/LON 296CD/869 363-2 and was part of the charity supergroup on the record called the Stonkers. \"The Stonk\", was based on a fictitious dance craze and was co-written by the two comedians along with Joe Griffiths. Other musicians performing on the single, besides Brian May playing keyboards and guitar, were David Gilmour and Tony Iommi on guitar, with Neil Murray on bass guitar. Cozy Powell, Roger Taylor and Rowan Atkinson – appearing as his character Mr. Bean – performed on drums. Joe Griffiths and Mike Moran contributed on keyboard. Hale & Pace never released another single, while Rowan Atkinson was featured on the follow-up single \"(I Wanna Be) Elected\", credited to Mr Bean and Smear Campaign ft Bruce Dickinson, another top ten hit for Comic Relief."]}, {"page": "Arthur Brown (musician)", "response": ["Brown returned to England in 1996. In 1997, he re-recorded \"Fire\" with German band Die Krupps, while in 1998, he provided a spoken-word performance on Bruce Dickinson's The Chemical Wedding album, reading a portion of three poems by William Blake, and appeared as Satan in Dickinson's music video for \"Killing Floor\". He was narrator for the Pretty Things' live performance of their album S. F. Sorrow (1998) at Abbey Road Studios. He also appeared on television, guesting on Kula Shaker track \"Mystical Machine Gun\" several times during 1999.", "Though Brown has had limited commercial success and has never released another recording as commercially successful as \"Fire\", he has been a significant influence on Alice Cooper,Marshall 2005, pp. 85 and 153. David Bowie, Peter Gabriel,Marshall 2005, p. 175. Marilyn Manson, George Clinton,Marshall 2005, p. 172. Kiss, King Diamond, and Bruce Dickinson of Iron Maiden,Marshall 2005, p. 103. among others, and his songs have been covered or sampled by a range of artists including Ozzy Osbourne, the Prodigy, Marilyn Manson, the Who and Death Grips.\"Arthur Brown on Shock Rock, Hendrix, Close Calls With Fire\". Rolling Stone. Retrieved 29 December 2017", "* 1998 – The Chemical Wedding (Bruce Dickinson)"]}, {"page": "Iron Maiden", "response": ["As pioneers of the new wave of British heavy metal movement, Iron Maiden achieved initial success during the early 1980s. After several line-up changes, the band went on to release a series of UK and US platinum and gold albums, including 1980's debut album, 1981's Killers, 1982's The Number of the Beast, 1983's Piece of Mind, 1984's Powerslave, 1985's live release Live After Death, 1986's Somewhere in Time, 1988's Seventh Son of a Seventh Son, 1990's No Prayer for the Dying, and 1992's Fear of the Dark. In 1982 the band released its album The Number of the Beast, the first with Bruce Dickinson, who replaced Paul Di'Anno as lead singer. This was a turning point in their career, helping establish Iron Maiden as one of heavy metal's most important artists. The Number of the Beast is among the most popular heavy metal albums of all time, having sold almost 20 million copies worldwide.", "Since the return of lead vocalist Bruce Dickinson and guitarist Adrian Smith in 1999, the band has undergone a resurgence in popularity, with a series of new albums and highly successful tours. Their 2010 album, The Final Frontier, peaked at No. 1 in 28 countries and received widespread critical acclaim. The sixteenth studio album, The Book of Souls, was released on 4 September 2015 to similar success, debuting at number one in the album charts of 24 countries with physical sales and summary in 43 territories with physical and digital sales. The seventeenth studio album Senjutsu was released on 3 September 2021 and eventually reached No. 1 in 23 countries.", "After a meeting with Rod Smallwood at the Reading Festival, Bruce Dickinson, previously of Samson, auditioned for Iron Maiden in September 1981 and was immediately hired. The following month, Dickinson went out on the road with the band on a small headlining tour in Italy, as well as a one-off show at the Rainbow Theatre in the UK. For the last show, and in anticipation of their forthcoming album, the band played \"Children of the Damned\" and \"22 Acacia Avenue\", introducing fans to the sound towards which they were progressing.", "Iron Maiden also made their debut appearance in South America, where they co-headlined (with Queen) the Rock in Rio festival to an estimated 350,000 in attendance. The tour was physically gruelling for the band, who demanded six months off when it ended (although this was later reduced to four months). This was the first substantial break in the group's history, including the cancellation of a proposed supporting tour for the new live album, with Bruce Dickinson threatening to quit unless the tour ended. In October 1985 Iron Maiden published their first double live album, Live After Death, which was a critical and commercial success, peaking at No. 19 on the Billboard 200 and No. 2 in the UK. The album was recorded at Long Beach Arena and also features additional tracks from four nights at London's Hammersmith Apollo. Live After Death is widely regarded as one of the greatest live albums of all time and has been described by Classic Rock as \"the last great live album of the vinyl era\" and seminal heavy metal live release. Along with the album a same-titled official video was also released and debuted at No. 1 in the UK charts and topped music video charts worldwide. Live After Death live video was digitally remastered and released in 2008 as a part of the \"History of Iron Maiden\" series. In November 1985, Iron Maiden were named the best rock and metal band in the world and awarded at Public Choice International. This recognition sealed their status as the biggest heavy metal band in the world.", "During another break in 1989, guitarist Adrian Smith released a solo album with his band ASAP, entitled Silver and Gold. Vocalist Bruce Dickinson began work on a solo album with former Gillan guitarist Janick Gers, releasing Tattooed Millionaire in 1990, followed by a tour. At the same time, to mark the band's ten-year recording anniversary, Iron Maiden released a compilation collection, The First Ten Years, a series of ten CDs and double 12-inch singles. Between 24 February and 28 April 1990, the individual parts were released one-by-one, each containing two of Iron Maiden's singles, including the original B-sides. Band also released the career spanning video compilation entitled The First Ten Years: The Videos in 1992 re-issued as From There to Eternity. The 1980s were closed by the group with over 25 million albums sold, of which 10 million in the US, over five million videos were sold only in the US, which gave Iron Maiden six of 120 Gold and Platinum certificates received worldwide. All those achievements sealed the group's status as the largest representative of the heavy metal genre. Musicians set new records in the UK: six Top 5 singles in the Top 5, 10 double maxi-singles in the Top 10, the highest position ever for a debut single from a rock band, the most albums in the Top 10 for a British performer, excluding The Rolling Stones, The Beatles and Queen, 20 singles consecutively released on the charts.", "Soon afterwards, Iron Maiden regrouped to work on a new studio record. During the pre-production stages, Adrian Smith left the band due to differences with Steve Harris, regarding the direction the band should be taking, disagreeing with the \"stripped down\" style that they were leaning towards. Janick Gers, having worked on Dickinson's solo project, was chosen to replace Smith, and became the band's first new member in seven years. The album, No Prayer for the Dying, was released in October 1990. It contained hit singles as \"Holy Smoke\" and \"Bring Your Daughter... to the Slaughter\", the band's first (and to date, only) UK Singles Chart No. 1, originally recorded by Dickinson's solo outfit for the soundtrack to A Nightmare on Elm Street 5: The Dream Child. The song was banned by the BBC and only a 90-second live clip on Top of the Pops was shown. In 1990 Bruce Dickinson received the Golden Raspberry Awards in category The Worst Original Song for the band's most successful single in Great Britain. The album debuted at No. 2 in the UK albums chart and No. 17 on the Billboard 200. No Prayer for the Dying signalled the return of Iron Maiden to the roots of theirs musical style, in particular in its simplicity of composition and raw sound.", "Fear of the Dark Tour 1992 included 66 concerts played on five continents for well over a million fans. The band presented a powerful and elaborated lighting rig (over 1000 lamps and lasers) and scenery partly reminiscent of the 1980s. The setting of the Monsters of Rock concerts was completed by the huge Eddie crowning the stage and screens. Iron Maiden made their first appearance in Iceland and returned to Oceania after a seven-year hiatus. The tour in Japan was the largest in the history of the group. The tour witnessed the personal conflicts between Bruce Dickinson and rest of the band.", "In 1993, Bruce Dickinson left the band to further pursue his solo career, but agreed to remain for a farewell tour and two live albums (later re-released in one package). The first, A Real Live One, featured songs from 1986 to 1992, and was released in March 1993. The second, A Real Dead One, featured songs from 1980 to 1984, and was released after Dickinson had left the band. The tour did not go well, with Steve Harris claiming that Dickinson would only perform properly for high-profile shows, and that at several concerts, he would only mumble into the microphone. Dickinson denied that he was under-performing, stating that it was impossible to \"make like Mr Happy Face if the vibe wasn't right\", and that news of his exit from the band had prevented any chance of a good atmosphere during the tour. On May 1, 1993 the band performed at the \"Primo Maggio Free Festival\" in Rome, Piazza San Giovanni. According to different sources the crowd was estimated between 500,000 and one million people. The band toured an extensive Italian leg and visited Russia for the very first time, playing three consecutive nights at Moscow's Olympic Stadium. Bruce Dickinson played his farewell show with Iron Maiden on August 28, 1993. The show was filmed, broadcast by the BBC, and released on video under the name Raising Hell.", "While the group were considering a replacement for Bayley, Rod Smallwood convinced Steve Harris to invite Bruce Dickinson back into the band. Although Harris admitted that he \"wasn't really into it\" at first, he then thought, \"'Well, if the change happens, who should we get?' The thing is, we know Bruce and we know what he's capable of, and you think, 'Well, better the devil you know.' I mean, we got on well professionally for, like, eleven years, and so ... after I thought about it, I didn't really have a problem with it.\"", "During the 2000–2002 tour, Iron Maiden played 91 shows for over two million people in 33 countries. The band visited big arenas, stadiums and performed at the biggest festivals. The world tour dubbed \"Metal 2000 Tour\" was a great undertaking, the main aim of which was to restore the concert glory of the band from the 80's. Iron Maiden used huge lighting equipment with moving parts and 600 lamps, pyrotechnics, a walking and a large wicker Eddie with dancers in the center, a burning cross lifting Bruce Dickinson up, backdrops and conceptual scenery related to the Brave New World album cover illustration. In addition to their touring success, the musicians have been nominated twice for the annual US music award Grammy Awards and received the Ivor Novello Awards for an international achievement. Iron Maiden was hailed as the most successful British metal group on British Channel 4, and The Number of the Beast album was included in the prestigious Eagle Vision's \"Classic Albums\" series. In 2001 band won Online Music Awards Germany in category \"Best Artist Website\".", "Dance of Death Tour 2003–04 started in September 2003 and was the band's most theatrical tour to date. The stage portrayed medieval castle with an opening gates, Grim Reaper's sculptures on sides, the towers and two versions of Eddie as the ominus Grim Reaper character. Bruce Dickinson used many props such as the black coat, carnival masks, the throne, World War I uniform and helmet. During presentation of the \"Paschendale\" song fans could see the dead soldiers' mannequins, trenches and the lighting system imitated flashes of explosions that echoed through the powerful sound system. Iron Maiden played 53 shows visiting European indoor arenas, North America, Latin American stadiums and Japan. Musicians took a part in charity football events called Music SoccerSix. In 2004 Iron Maiden received Nordoff-Robbins Silver Clef in category \"Special Achievement Award\". During the album tour, the band's performance at Westfalenhalle, in Dortmund, Germany, was recorded and released in August 2005 as a live album and DVD, entitled Death on the Road.", "On 15 March, a new compilation to accompany 2009's Somewhere Back in Time was announced. Entitled From Fear to Eternity, the original release date was set at 23 May, but was later delayed to 6 June. The double disc set covers the period 1990–2010 (the band's most recent eight studio albums), and, as on Somewhere Back in Time, live versions with Bruce Dickinson were included in place of original recordings which featured other vocalists, in this case Blaze Bayley.", "Maiden England World Tour stage set was built in an Arctic-style in many aspects reminding Seventh Tour of a Seventh Tour. The band presented wraparound stage including some special platforms and podiums. Stage set and backdrops portrayed a dozen of the frozen pictures of Eddie monster. Fans could see the three incarnations of band's mascot and movable, custom-made elements of stage props as organs with silver pipes, frozen sculptures of Eddie, the crystal ball and movable lighting rig imitating construction from an era of 1988. Iron Maiden decided to extend the pyrotechnics using even more than on previous tours, as Bruce Dickinson said \"we like to alternate it every other year, because if you get the reputation that you've got to go and see a band because of the pyro and then you don't do the pyro, people think, 'Oh, I won't bother then.\" The tour was even bigger logistical challenge than a few previous ones. Michele Stokley, organiser of Sarnia Bayfest stated, Iron Maiden \"brought 22 tractor trailers and the [six] buses full of equipment for the show\".", "Iron Maiden closed their Maiden England World Tour in July 2014 headlining at Sonisphere Festival, Knebworth. Musicians have impressed the crowds by having The Great War Display Team featuring Bruce Dickinson among its pilots, stage a sensational aerial dogfight in the skies above the Festival with band's frontman flying his very own WW1 German Fokker Dr1, just hours before taking to the stage. Iron Maiden headlining show marked the final chapter in the band's trilogy of tours performing their 80's repertoire. The historical tour was another big commercial success in band's career. Over three years, 100 shows were undertaken in 32 countries before an estimated audience of not less than two million and a seven hundred thousand people. Throughout the tour, consistent praise was received from music critics, with the band's performances and the stage show receiving very particular acclaim. Third retrospective tour established Iron Maiden's status as a stadium–filling band.", "Following confirmation from the group that 2010's The Final Frontier would not be their last album, Bruce Dickinson revealed plans for a sixteenth studio record in July 2013, with a potential release date in 2015. In February 2015, drummer Nicko McBrain revealed that a new album had been completed, although the release was put on hold as Dickinson was recovering from treatment for a cancerous tumour found on his tongue. On 15 May, after Dickinson was cleared for activities, manager Rod Smallwood confirmed that the album would be released in 2015, although the band would not tour until 2016 to allow Dickinson to continue recuperating. On 18 June 2015, the band's website announced its title, The Book of Souls, and confirmed a release date of 4 September 2015. It is the band's first original studio album not to be issued by EMI outside North America, following Parlophone's acquisition by Warner Music Group in 2013. It was a critical and commercial success, becoming the band's fifth UK No. 1 album and second No. 4 on Billboard 200 in the US. The new release reached number one positions in the album charts of 43 countries. Iron Maiden received many accolades and prestigious awards including The Rocks Awards, Silver Clef Award in recognition of outstanding contribution to UK music, Bandit Rock Awards, Classic Rock Roll of Honour Awards, ECHO Award, Kerrang! Awards, Loudwire Awards, Burrn! Awards, Metal Hammer Germany Awards, Golden Gods Awards among many others. The Book of Souls went Gold and Platinum in twenty countries.", "The individual segments of the stage design, were placed on the stage's podium, as well as the two stepped towers placed in the back of the stage on its extreme sides. Initially they were turned in the opposite direction to the original, during the presentation of selected inscriptions which were properly illuminated, creating the effect of the real buildings. Panoramic backdrops have been changed with each song referred to the graphic convention and paintings from the Mayan era, originally included in the booklet of the promoted album. Bruce Dickinson changed his costumes several times and used a variety of props. Another attraction was an eight-meter long inflatable devil goat doll, emerging from behind the stage during the presentation of \"The Number of the Beast\" song.", "As many previous releases band's seventeenth studio effort was critically acclaimed and commercially successed album, especially appreciated for its ambitious epic scope. The band decided to continue postponed Legacy of the Beast Tour in 2022 adding next 30+ dates in North America and some new territories in Europe. Tour production was planned as even more spectacular with using a brand new scenery dedicated to Senjutsu album and including the setlist changes to perform songs from the seventeenth studio effort. Iron Maiden manager Rod Smallwood commented: \"Next summer we will finally get to play the huge European stadium and festival tour for Legacy of the Beast originally set for 2020. The new show will be even more spectacular so after our visit to Rock in Rio early September 2022 we have decided to take it back to our fans in North America and Mexico too, playing in cities or venues we did not get to last time we toured in 2019. We are also adding some of the great cities of eastern Europe we were not initially visiting! We’ll be making a couple of additions and changes to the production and setlist to include some songs from our new album Senjutsu and are making the 2022 version of Legacy of the Beast even more spectacular than the acclaimed original show. You can be sure that we will still be featuring all the \"hits\" and the key elements of the original tour like the Spitfire, Icarus, Hell, flamethrowers and pyro and the rest - but we will shake it up a bit and Trooper Eddie will have serious competition in the new \"Senjutsu world\" we are adding\". During an appearance on the \"Talk Is Jericho\" podcast, Bruce Dickinson confirmed that Iron Maiden is planning to stage a tour where it will perform Senjutsu double album, in its entirety.", "M. Shadows of Avenged Sevenfold stated that Iron Maiden \"are by far the best live band in the world and their music is timeless\", while Trivium singer Matt Heafy comments that \"without Iron Maiden, Trivium surely wouldn't exist\". Slipknot and Stone Sour frontman Corey Taylor said that \"Steve Harris does more with four fingers than I've ever seen anybody do. And Bruce Dickinson? Dude! To me, he was the quintessential old-school heavy metal singer. He could hit notes that were just sick, and he was a great showman. Everything made me a fan. And there wasn't a dude that I hung out with that wasn't trying to draw Eddie on their schoolbooks\", while their music also helped Jesper Strömblad of In Flames to pioneer the melodic death metal genre, stating that he had wanted to combine death metal with Iron Maiden's melodic guitar sounds. Viking metallers of Swedish band Amon Amarth stated Iron Maiden is one of their biggest influence also participated in Iron Maiden's Legacy of the Beast RPG game project. Chris Impellitteri stated Iron Maiden have influenced \"virtually every heavy metal band in existence with their music, brand, and of course talent!\"", "Bruce Dickinson is the most active in media member of the band. Iron Maiden frontman presented Bruce Dickinson's Friday Rock Show on BBC radio station 6 Music from 2002 to 2010. In addition to his show on 6 Music, Dickinson also hosted a series entitled Masters of Rock on BBC Radio 2 from 2003 to 2007. His singing and episode acting were presented in The Club Paradise, Mr Bean's Elected, and A Nightmare on Elm Street: The Dream Child Dickinson's aviation passion and storytelling talent were reflected in Flying Heavy Metal (Discovery Series) among many other documents.", "Contrary to the accusations, the band have always denied the notion that they are Satanists, with lead vocalist, Bruce Dickinson, doing so on-stage in the Live After Death concert video. Steve Harris has since commented that, \"It was mad. They completely got the wrong end of the stick. They obviously hadn't read the lyrics. They just wanted to believe all that rubbish about us being Satanists.\" Harris has also stated that \"The Number of the Beast\" song was inspired by a nightmare he had after watching Damien: Omen II, and also influenced by Robert Burns' \"Tam o' Shanter\". Furthermore, the band's drummer, Nicko McBrain, has been a born-again Christian since 1999.", "Singer Bruce Dickinson, who typically works in collaboration with guitarist Adrian Smith, has an operatic vocal style, inspired by Arthur Brown, Peter Hammill, Ian Anderson and Ian Gillan, and is often considered to be one of the best heavy metal vocalists of all time. Although Nicko McBrain has only received one writing credit, on the Dance of Death album, Harris often relies on him while developing songs. Adrian Smith commented, \"Steve loves playing with him. [They] used to work for hours going over these bass and drum patterns.\"", "* Bruce Dickinson – lead vocals (1981–1993, 1999–present), piano (2015)"]}, {"page": "The Number of the Beast (album)", "response": ["The Number of the Beast is the third studio album by English heavy metal band Iron Maiden. It was released on 22 March 1982 in the United Kingdom by EMI Records and in the United States by Harvest and Capitol Records. The album was their first to feature vocalist Bruce Dickinson and their last with drummer Clive Burr.", "The Number of the Beast is Iron Maiden's only album to include songwriting credits for Clive Burr, and was the band's first album to feature writing by guitarist Adrian Smith. In addition, the release saw Steve Harris adopt a different approach to writing, which would cater more for new vocalist Bruce Dickinson. The album's producer Martin Birch remarked, \"I simply didn't think [former vocalist Paul Di'Anno] was capable of handling lead vocals on some of the quite complicated directions I knew Steve wanted to explore ... When Bruce joined, it opened up the possibilities for the new album tremendously.\"", "thumb|left|Bruce Dickinson and Steve Harris performing in 1982. The Beast on the Road tour was marred by several protests organised by religious activists in the US.", "*Bruce Dickinson – lead vocals"]}, {"page": "1981 in music", "response": ["*26 September – Iron Maiden hires Samson lead singer Bruce Bruce AKA Bruce Dickinson to replace Paul Di'Anno. Dickinson will finish off the last 7 dates of the Killer World Tour. ", "*26 October – Iron Maiden plays its first show with Bruce Dickinson as the new lead singer in Bologna, Italy."]}, {"page": "1982 in music", "response": ["* March 22 – Iron Maiden release The Number of the Beast, the critically acclaimed yet controversial album often hailed as Iron Maiden's greatest. This was Iron Maiden's first album to feature singer Bruce Dickinson and their first to hit number one in the UK charts."]}, {"page": "1989 in music", "response": ["* Iron Maiden guitarist Adrian Smith leaves the band and is replaced by ex-Gillan guitarist Janick Gers who had most recently worked with Bruce Dickinson on his solo project."]}, {"page": "1990 in music", "response": ["| Tattooed Millionaire || Bruce Dickinson ||-"]}, {"page": "1993 in music", "response": ["*August 28 – Bruce Dickinson plays his final show with Iron Maiden (until his return in 1999) in London. The show is broadcast on British television, and later released on VHS and DVD."]}, {"page": "1994 in music", "response": ["| Balls to Picasso || Bruce Dickinson || Europe; released in US on 7/26"]}, {"page": "1995 in music", "response": ["| Alive in Studio A || Bruce Dickinson || Live"]}, {"page": "1996 in music", "response": ["| Skunkworks || Bruce Dickinson ||-"]}, {"page": "1997 in music", "response": ["| Accident of Birth || Bruce Dickinson ||-"]}, {"page": "1998 in music", "response": ["| The Chemical Wedding || Bruce Dickinson ||-"]}, {"page": "1999 in music", "response": ["*February 10 – Iron Maiden announces that singer Bruce Dickinson and guitarist Adrian Smith have rejoined the band.", "| Scream for Me Brazil || Bruce Dickinson || Live"]}, {"page": "2001 in music", "response": ["| The Best of Bruce Dickinson || Bruce Dickinson || Compilation"]}, {"page": "1958 in music", "response": ["* August 7 – Bruce Dickinson, singer (Iron Maiden)"]}, {"page": "Sharon Osbourne", "response": ["A series of high-selling albums and world tours followed through the 1980s, eventually bringing about Ozzy's popularity. In 1996, Osbourne created the Ozzfest summer touring festival. It went on to become a regular rock occasion and celebrated a 10th anniversary in 2006. By 2007, the ticket prices had reached £76 and Osbourne announced that the tickets would be free to allow more people the opportunity to attend the concert. Prior to the founding of Ozzfest, Osbourne approached Lollapalooza, another rock/pop festival, to request that Ozzy play at that year's festival, only to be rejected and told that Ozzy was \"uncool\" and too drugged up. It was then that she decided to launch her own festival. Controversy ensued when she pulled the plug on Iron Maiden's set three times in one performance. She also harassed the singer Bruce Dickinson, and threw eggs at the band.", "At Iron Maiden's last Ozzfest performance, on 20 August 2005 at the Hyundai Pavilion at Glen Helen in San Bernardino, California, several negative events took place, allegedly the fault of Sharon Osbourne. Osbourne's actions were reportedly in retaliation to lead singer Bruce Dickinson slighting reality TV, with claims that this was an attack on Ozzy Osbourne himself.", "During the first Iron Maiden song, several members of the front row of the crowd (reportedly a combination of Osbourne's entourage and a few members from other bands persuaded by Osbourne or her entourage) were reported to have bombarded the band with eggs, bottle caps, and ice. Some reports also say that Sharon's daughter, Kelly, was throwing objects at the band. During three of Iron Maiden's songs, the PA system was switched off, cutting power to Dickinson's microphone and the band's instruments. In audio captured during the concert, it is reported that Dickinson can be heard accusing the festival's organisers of deliberately cutting off the band's power. Also unknown to Iron Maiden, played secretly through the PA at the very beginning and end of their set was a tape with the chant \"Ozzy – Ozzy – Ozzy\". On Iron Maiden's departure, Sharon made a few statements on stage in front of the 40,000 people in attendance. She told the audience that while she \"absolutely loved Iron Maiden,\" she thought lead singer Bruce Dickinson was a \"prick\" and had \"disrespected Ozzfest since they began their stint with the tour.\" Her words were met with booing, and soon afterwards she walked off the stage."]}, {"page": "Christopher Walken", "response": ["Walken has also played the lead in the Shakespeare plays Hamlet, Macbeth, Romeo and Juliet, and Coriolanus. He is a popular guest-host of Saturday Night Live, hosting seven times. His most notable roles on the show include record producer Bruce Dickinson in the \"More Cowbell\" sketch; the disgraced Confederate officer Colonel Angus; and multiple appearances in the Continental sketch. He has also appeared in Hallmark Hall of Fame's Sarah, Plain and Tall (1991), which earned him a Primetime Emmy Award nomination.", "One of Walken's more famous SNL performances was a spoof of Behind the Music, featuring a recording session of Blue Öyster Cult's \"(Don't Fear) the Reaper\". In the guise of record producer Bruce Dickinson (not to be confused with the real Bruce Dickinson, lead singer for Iron Maiden), Walken makes passionate and slightly unhinged speeches to the band and is obsessed with getting \"More Cowbell\" into the song. The phrase \"I gotta have more cowbell\" has since been adapted to merchandise. The producer who suggested the cowbell on the original BÖC recording is David Lucas."]}, {"page": "Worksop", "response": ["*Bruce Dickinson (b.1958), singer with Iron Maiden"]}, {"page": "Sepultura", "response": ["On July 6, 2010, it was announced that Sepultura were signed with Nuclear Blast Records, and would release their first album for the label in 2011. The band confirmed that there would be no reunion of the classic lineup. By the end of 2010, the band began writing new material and entered the studio to begin recording their 12th album with producer Roy Z (Judas Priest, Halford, Iron Maiden's Bruce Dickinson, Helloween and Andre Matos). On March 1, 2011, Sepultura had completed recording their new album, entitled Kairos, which was released in June 2011."]}, {"page": "Timeline of musical events", "response": ["*1958 in music, 1958 in British music, 1958 in Norwegian music – Death of Ralph Vaughan Williams; Cannonball Adderley records Somethin' Else; Art Blakey and the Jazz Messengers, Moanin'; Alvin and the Chipmunks release \"The Chipmunk Song (Christmas Don't Be Late)\", Bruce Dickinson, Nikki Sixx, Prince, Madonna and Michael Jackson are born. Born Bossa Nova a Brazilian kind of music. Carl Ruggles, Exaltation in honour of his late wife, Charlotte. Cliff Richard and The Drifters release Move It, considered Britain's first rock and roll hit single. Little Richard enters seminary, Birth of Fernando de la Mora (tenor)"]}, {"page": "Mr. Bean", "response": ["Mr. Bean also made a Comic Relief record in 1992, entitled \"(I Want To Be) Elected\" and which was credited to 'Mr. Bean and Smear Campaign featuring Bruce Dickinson'. It was a cover of the Alice Cooper song of the same name, and reached number 9 in the UK singles chart.\"I want to be Elected\" disc information. Retrieved 14 March 2008."]}]}}