{"wiki_id": "http://www.wikidata.org/entity/Q190626", "itemLabel": "Aaron Klug", "itemDescription": "British chemist and biophysicist", "wikipedia_url": "https://en.wikipedia.org/wiki/Aaron_Klug", "wikipedia_page": {"main": "Sir Aaron Klug  (11 August 1926 – 20 November 2018) was a Lithuanian-born British biophysicist and  chemist. He was a winner of the 1982 Nobel Prize in Chemistry for his development of crystallographic electron microscopy and his structural elucidation of biologically important nucleic acid-protein complexes.\n\n", "link_mentions": [{"page": "August 11", "response": ["*1926 – Aaron Klug, Lithuanian-English chemist and biophysicist, Nobel Prize laureate (d. 2018)"]}, {"page": "Capsid", "response": ["The icosahedral structure is extremely common among viruses. The icosahedron consists of 20 triangular faces delimited by 12 fivefold vertexes and consists of 60 asymmetric units. Thus, an icosahedral virus is made of 60N protein subunits. The number and arrangement of capsomeres in an icosahedral capsid can be classified using the \"quasi-equivalence principle\" proposed by Donald Caspar and Aaron Klug. Like the Goldberg polyhedra, an icosahedral structure can be regarded as being constructed from pentamers and hexamers. The structures can be indexed by two integers h and k, with h \\ge 1 and k \\ge 0; the structure can be thought of as taking h steps from the edge of a pentamer, turning 60 degrees counterclockwise, then taking k steps to get to the next pentamer. The triangulation number T for the capsid is defined as:"]}, {"page": "Chromatin", "response": ["|Aaron Klug (MRC Laboratory of Molecular Biology)"]}, {"page": "Crystallography", "response": ["*Vega Science Trust Interviews on Crystallography Freeview video interviews with Max Perutz, Rober Huber and Aaron Klug."]}, {"page": "Francis Crick", "response": ["Crick died of colon cancer on the morning of 28 July 2004 at the University of California, San Diego (UCSD) Thornton Hospital in La Jolla; he was cremated and his ashes were scattered into the Pacific Ocean. A public memorial was held on 27 September 2004 at the Salk Institute, La Jolla, near San Diego, California; guest speakers included James Watson, Sydney Brenner, Alex Rich, Seymour Benzer, Aaron Klug, Christof Koch, Pat Churchland, Vilayanur Ramachandran, Tomaso Poggio, Leslie Orgel, Terry Sejnowski, his son Michael Crick, and his youngest daughter Jacqueline Nichols. A private memorial for family and colleagues was held on 3 August 2004.", "In 1976, Crick addressed the origin of protein synthesis in a paper with Sydney Brenner, Aaron Klug, and George Pieczenik. In this paper, they speculate that code constraints on nucleotide sequences allow protein synthesis without the need for a ribosome. It, however, requires a five base binding between the mRNA and tRNA with a flip of the anti-codon creating a triplet coding, even though it is a five-base physical interaction. Thomas H. Jukes pointed out that the code constraints on the mRNA sequence required for this translation mechanism is still preserved.", "* Torsten Krude (Ed.); DNA Changing Science and Society () CUP 2003. (The Darwin Lectures for 2003, including one by Sir Aaron Klug on Rosalind Franklin's involvement in the determination of the structure of DNA)."]}, {"page": "November 20", "response": ["*  2018   – Aaron Klug, Lithuanian-English chemist and biophysicist, Nobel Prize laureate (b. 1926)"]}, {"page": "Trinity College, Cambridge", "response": ["|Aaron Klug"]}, {"page": "Peterhouse, Cambridge", "response": ["Peterhouse alumni are notably eminent within the natural sciences, including scientists Lord Kelvin, Henry Cavendish, Charles Babbage, James Clerk Maxwell, James Dewar, Frank Whittle, and five Nobel prize winners in science: Sir John Kendrew, Sir Aaron Klug, Archer Martin, Max Perutz, and Michael Levitt. Peterhouse alumni also include the Archbishop of Canterbury John Whitgift, Lord Chancellors, Lord Chief Justices, as well as Oscar-winning film director Sam Mendes, and comedian David Mitchell. British Prime Minister Augustus FitzRoy, 3rd Duke of Grafton, and Elijah Mudenda, second prime minister of Zambia, also studied at the college.", "* Sir Aaron Klug – Chemistry (1982) for his development of crystallographic electron microscopy."]}, {"page": "1926", "response": ["** Aaron Klug, Lithuanian-English chemist, Nobel Prize laureate (d. 2018)"]}, {"page": "1982", "response": ["* Chemistry – Aaron Klug"]}, {"page": "Max Perutz", "response": ["*Krude, Torsten, ed., 2003. DNA Changing Science and Society. Cambridge Univ. Press. . Being the Darwin Lectures for 2003, including one by Sir Aaron Klug on Rosalind Franklin's role in determining the structure of DNA."]}]}}