{"wiki_id": "http://www.wikidata.org/entity/Q1900449", "itemLabel": "Mark Stewart", "itemDescription": "English musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Mark_Stewart_(English_musician)", "wikipedia_page": {"main": "Mark Stewart (born 28 April 1960) is an English musician and founding member of The Pop Group. A pioneer of post-punk and industrial hip-hop, he has recorded for On-U Sound Records and Mute Records.", "link_mentions": [{"page": "Trip hop", "response": ["Another influence came from Gary Clail's Tackhead soundsystem. Clail often worked with former The Pop Group singer Mark Stewart. The latter experimented with his band Mark Stewart & the Maffia, which consisted of New York session musicians Skip McDonald, Doug Wimbish, and Keith LeBlanc, who had been a part of the house band for the Sugarhill Records record label. Produced by Adrian Sherwood, the music combined hip hop with experimental rock and dub and sounded like a premature version of what later became trip hop. In 1993, Kirsty MacColl released \"Angel\", one of the first examples of the genre crossing over to pop, a hybrid that dominated the charts toward the end of the 1990s."]}, {"page": "Sex Pistols", "response": ["The Sex Pistols evolved from The Strand, a London band formed in 1972 with working-class teenagers Steve Jones on vocals, Paul Cook on drums and Wally Nightingale on guitar. According to a later account by Jones, both he and Cook played on instruments they had stolen. Early line-ups of The Strand—sometimes known as The Swankers—also included Jim Mackin on organ and Stephen Hayes (and later, briefly, Del Noones) on bass.Savage, Jon. England's Dreaming, pp. 77–79; Strongman, Phil, Pretty Vacant, p. 84. The band members regularly hung out at two clothing shops on the King's Road in Chelsea, London: John Krivine and Steph Raynor's Acme Attractions (where Don Letts worked as manager)Strongman, Phil, Pretty Vacant, p. 87; Savage, Jon, England's Dreaming, p. 96. and Malcolm McLaren and Vivienne Westwood's Too Fast to Live, Too Young to Die. McLaren's and Westwood's shop had opened in 1971 as Let It Rock, with a 1950s revival Teddy Boy theme. It had been renamed in 1972 to focus on another revival trend, the '50s rocker look associated with Marlon Brando. As John Lydon later observed, \"Malcolm and Vivienne were really a pair of shysters: they would sell anything to any trend that they could grab onto.\"Robb, John, Punk Rock, p. 83. The shop became a focal point of the punk rock scene, bringing together participants such as the future Sid Vicious, Marco Pirroni, Gene October, and Mark Stewart, among many others.Robb, John, Punk Rock, pp. 83–84, 86–87, 89, 102, 105. Jordan, the wildly styled shop assistant, is credited with \"pretty well single-handedly paving the punk look\".Robb, John, Punk Rock, p. 84."]}, {"page": "Tricky (musician)", "response": ["In 1991, before the release of Massive Attack's album Blue Lines, he met Martina Topley-Bird in Bristol. Some time later she came to his house, and mentioned to Tricky and Mark Stewart that she could sing. Martina was only fifteen years old, but her \"honey-coated vox\" impressed them and they recorded a song called \"Aftermath\" (although The Face '95 mentions that the first song they recorded together was called \"Shoebox\"). Tricky showed \"Aftermath\" to Massive Attack, but they were not interested. So in 1993 he decided to press a few hundred vinyl copies of the song. He cut it directly off the tape, so that the song is basically \"just bassline and hiss\". (NME 1994). In 1995, a white label got him a contract with Island Records and he started to record his first solo album, Maxinquaye."]}, {"page": "1983 in music", "response": ["| Learning to Cope with Cowardice || Mark Stewart ||-"]}, {"page": "Alec Empire", "response": ["* 1998 – Mark Stewart (Remix: Consumed) / Mute Records"]}, {"page": "Mute Records", "response": ["In 1985, a new incarnation of Simon Bonney's Crime & the City Solution formed, including ex-Birthday Party members Mick Harvey and Rowland S. Howard. The new line-up released the EP The Dangling Man and later the mini-album Just South of Heaven. Mute released the single \"Hypnotized\" in May 1985, by newly signed artist Mark Stewart, produced by Adrian Sherwood.\"Mute Records – Hypnotized\". Retrieved 9 November 2010. Stewart recorded his first album for Mute, As the Veneer of Democracy Starts to Fade, in November 1985, also produced by Sherwood, under the name Mark Stewart and the Mafia.\"Mute Records – As the Veneer of Democracy Starts to Fade\". Retrieved 9 November 2010. Nick Cave and the Bad Seeds released their second album, The Firstborn Is Dead, recorded at the Berlin recording studio, Hansa Tonstudio, co-produced by Flood.\"Mute Records – The Firstborn Is Dead\". Retrieved 17 November 2010.", "Mute released Mark Stewart's album, Metatron, in May 1990, which included the single, \"Hysteria\". Stewart continued working with producer Adrian Sherwood.\"Mute Records – Metatron\". Retrieved 18 November 2010. Mute signed Goldfrapp in 1999, consisting of Alison Goldfrapp and Will Gregory.Simpson, Dave. \"The Friday Interview\". The Guardian. 4 May 2001. Retrieved 29 October 2010. The duo began recording their debut album, Felt Mountain, in a hired cottage in Wiltshire, South West England. Goldfrapp completed the recording after six months, and the album was released in September 2000."]}, {"page": "Adamski", "response": ["As a producer, his songs at that time also included a collaboration with musician Danny Williams. In 2007, he released a remake of The Pop Group's 1979 single \"We Are All Prostitutes\" with Mark Stewart which appeared on a number of compilations. His single \"ApeX\" was released on Kitsuné Music in 2006. In 2009, he began to release more material on Shir Khan's record label."]}, {"page": "Martina Topley-Bird", "response": ["In 1993, as a teenager at Clifton College, Topley-Bird was discovered by trip hop pioneer Tricky when he saw her sitting on a wall near his house, singing to herself. \"That's really how it happened,\" she recalled. \"It's one of those things people are always surprised to find out is true. I remember the graveyard behind the wall. A few weeks later, I went around to his house with some friends. We'd been drinking cider after our GCSEs. We were banging on his door, but he wasn't in. Then Mark Stewart, who lived there, came up to us and said: \"Yeah, this is Tricky's house, jump in through the window.\" So I jumped through, opened the door and we got mashed.\""]}, {"page": "Pigbag", "response": ["When Hamlin heard that Simon Underwood had left The Pop Group he invited him to join the nascent band (to replace Mark Smith who had left by this point), the band then trading under the tentative title \"Us Corporation\". Through a friend who knew Mark Stewart, The Pop Group's vocalist, Hamlin and Johnstone acquired Underwood's address and hitched down to Bristol to convince him, using tape recordings of their jam sessions. To their surprise Underwood agreed, also suggesting his friend Ollie Moore as tenor sax player."]}, {"page": "Tackhead", "response": ["During a visit to New York City, to help with a remix, London-based producer Sherwood (already noted in the dub music scene) met Leblanc, and they began to collaborate. Soon the trio of Wimbish, Leblanc and McDonald were producing tracks on Sherwood's On-U Sound record label. One of their earlier collaborations was as \"Mark Stewart and the Maffia\", which featured Stewart, former member of The Pop Group on vocals. Their first LP produced under that name As the Veneer of Democracy Starts to Fade was amongst the most industrial, noise-oriented and uncompromising of the group's output, described by John Leland as \"a scary mess of random sounds, spoken words, and tiny snippets of music, processed and distorted to a grating electric edge.\""]}, {"page": "CEvin Key", "response": ["Key's initial interest in experimenting with electronic music came from a dream he had as a kid; this dream was depicted on the cover of his 2003 album The Dragon Experience. Later on, he discovered a publication called Contact List for Electronic Music by Alex Douglas, which introduced him to the tape-trading community. He named Throbbing Gristle, Cabaret Voltaire, Portion Control, and the album The Bridge by Thomas Leer and Robert Rental as early influences on Skinny Puppy. In an interview with Alternative Press, he mentioned Fad Gadget, The Human League, John Foxx, Bourbonese Qualk, and Mark Stewart as having a large impact on him in his youth. He credits his style of drumming to an interest in Latin and African percussion, as well as rap music, industrial music, and early 70s rock."]}, {"page": "The Pop Group", "response": ["The Pop Group are an English band formed in Bristol in 1977 by vocalist Mark Stewart, guitarist John Waddington, bassist Simon Underwood, guitarist/saxophonist Gareth Sager, and drummer Bruce Smith. Their work in the late 1970s crossed diverse musical influences including dub, funk, and free jazz with radical politics, helping to pioneer post-punk music.", "The Pop Group was formed in 1977 in Bristol when teenager Mark Stewart set out to start a funk group with schoolmates John Waddington and Simon Underwood. Inspired by the energy of punk rock but feeling the style to be too conservative, the group drew influence from the avant-garde, black music styles such as free jazz and dub, and radical political traditions. Guitarist Gareth Sager and drummer Bruce Smith were eventually added to the group. Soon after forming, they began to gain notoriety for their live performances and were signed to Radar Records. They appeared on the cover of the NME. The band donated the proceeds from their first high-profile tour to Amnesty International. They issued their debut single \"She Is Beyond Good and Evil\" in March 1979 and their debut album Y  in April of that year, both to acclaim but relatively low sales figures. Regardless, their moderate success was sufficient to convince Rough Trade to sign the band. During this period, Dan Catsis replaced Underwood on bass.", "In 2010, the Pop Group reunited with three of the original five members: Mark Stewart, Gareth Sager, and Bruce Smith. The 1980 LP We Are Time was reissued worldwide on 20 October 2014, and the band released a compilation of rarities titled Cabinet of Curiosities. In support of the reissues, the band undertook a seven-day tour of the UK, and in February 2015, released Citizen Zombie, their first studio album in 35 years. They went a worldwide tour with dates in the U.S., Japan, and Australia, followed by an extensive European tour culminating in festival appearances including two live sets at Glastonbury.", "* Trailer for the Pop Group/Mark Stewart documentary"]}, {"page": "Adrian Sherwood", "response": ["In 2006 he released his second album Becoming a Cliché, again with numerous artists such as Perry, the late Bim Sherman, Dennis Bovell, Little Roy, LSK, Samia Farah, Raiz and Mark Stewart. A limited edition, 2-disc version was released simultaneously with the second disc titled Dub Cliché."]}, {"page": "This Heat", "response": ["Bands and artists that have called This Heat either an influence or a favourite include Steve Albini, Alexis Taylor, Dan Snaith, Avey Tare, Amen Dunes, Women, Preoccupations, Nurse With Wound, Palm, Squid, Mark Stewart, The Dead C, Daniel O'Sullivan, Disco Inferno, Elias Rønnenfelt, Marc Hollander, Family Fodder, Matt Johnson, 23 Skidoo, David Grubbs, Volcano the Bear, Dazzling Killmen, Nisennenmondai, Korekyojinn, Steven Wilson, The Sound of Animals Fighting, Yoshida Tatsuya, 75 Dollar Bill, Horse Lords, Mika Taanila, FRIGS,  Warm Ghost, Justin Pearson, Bo Ningen, Pinkish Black,  Young Knives, AIDS Wolf, Controlled Bleeding, These New Puritans, Eyeless in Gaza, Six Finger Satellite, Trans Am, Dave Kerman, Guapo, Chrome Hoof, Ut, Heiner Goebbels, and many others."]}, {"page": "List of dub artists", "response": ["*Mark Stewart"]}, {"page": "List of industrial music genres", "response": ["Industrial hip hop fuses the themes and aesthetics of industrial with hip hop music. Its origins are in the work of Mark Stewart and Adrian Sherwood. In 1985, Stewart, former Pop Group singer, released As the Veneer of Democracy Starts to Fade, applying the cut-up style of industrial music with the house band of Sugar Hill Records (Doug Wimbish, Keith Leblanc, and Skip McDonald). Sherwood was a major figure in British dub music, as well as working with industrial groups such as Cabaret Voltaire, Einstürzende Neubauten, Ministry, KMFDM, and Nine Inch Nails. Tackhead, a collaboration between Sherwood and the Sugar Hill band, picked up where Stewart left off. The Disposable Heroes of Hiphoprisy, from San Francisco, and Meat Beat Manifesto, from the UK, are also early representatives of the style. The later work of Broadrick's Godflesh, as well as his collaborations with Kevin Martin, Ice, and Techno Animal, are examples of industrial hip hop. Saul Williams, a slam poet, also performs in the style. Other notable contributors include CX KidtroniK, clipping., B L A C K I E, Death Grips, JPEGMafia, Dälek, and Electric Caves."]}, {"page": "Ari Up", "response": ["Up's first full-length solo album, Dread More Dan Dead, was released in 2005. She appeared on Lee \"Scratch\" Perry's Repentance (2008), and performed a duet on a cover version of Mike Hugg's song \"Mister, You're a Better Man Than I\" on Mark Stewart's Edit (2008)."]}, {"page": "On-U Sound Records", "response": ["On-U Sound Records is an English record label known for releasing its own unique flavour of dub music since the 1980s. The label was founded by Adrian Sherwood in 1979/1980 and is home to acts such as Tackhead, Dub Syndicate, African Head Charge, Akabu, The London Underground, Little Annie, Creation Rebel, Mark Stewart, Gary Clail (who would have a number of Top 40 hits, like \"Human Nature\", credited to Gary Clail On-U Sound System), New Age Steppers, Audio Active, Asian Dub Foundation, and the dub collective Singers & Players."]}, {"page": "Southern Studios", "response": ["*Mark Stewart & The Maffia"]}, {"page": "Meltdown (festival)", "response": ["| Massive Attack, Gong, Yellow Magic Orchestra, Reggae Acoustic Songbook, Princess Malachi, Elbow, Fleet Foxes, The Heritage Orchestra: Music from Blade Runner, Stiff Little Fingers, Mark Stewart, The Maffia, Adrian Sherwood, The Shortwave Set, Martina Topley, Grace Jones, Dälek, The Cool Kids, Shape Of Broad Minds, Flying Lotus, PVT, Gang Of Four, Tom Tom Club, Terry Callier, Aloe Blacc, Tunng, Leila, Saxon Sound System with Musclehead, Tippa Irie, Trevor Sax and Papa Levi, Silent Disco with guests DJs including Four Tet and Peaches"]}, {"page": "Y (album)", "response": ["* Mark Stewart – vocals"]}, {"page": "Maxinquaye", "response": ["Maxinquaye is the debut album by English rapper and producer Tricky, released on 20 February 1995 by 4th & B'way Records. In the years leading up to the album, Tricky had grown frustrated with his limited role in the musical group Massive Attack and wanted to pursue an independent project. Shortly after, he discovered vocalist Martina Topley-Bird – who he felt would offer another dimension to his lyrics – and signed a solo contract with 4th & B'way in 1993. Tricky recorded Maxinquaye the following year, primarily at his home studio in London, with Topley-Bird serving as the album's main vocalist, while Alison Goldfrapp, Ragga and Mark Stewart performed additional vocals.", "Tricky eventually grew frustrated with his role in Massive Attack, finding it limiting, and wanted to record an album with a female vocalist whose singing would offer another dimension to his lyrics and their meaning. In 1993, he discovered Martina Topley-Bird, then a teenager at Clifton College, when he saw her sitting against a wall near his house, singing to herself. \"That's really how it happened\", she recalled. \"A few weeks later, I went around to his house with some friends. We'd been drinking cider after our GCSEs. We were banging on his door, but he wasn't in. Then Mark Stewart, who lived there, came up to us and said: 'Yeah, this is Tricky's house, jump in through the window.'\"", "* Mark Stewart – vocals"]}, {"page": "Shoot the Boss", "response": ["Reviews for the album were generally favourable. NME described the album's opening as \"gut-stabbingly groovy stuff\" but was disappointed when the pace slowed midway through the album, concluding \"you have to applaud the boy Carter's intermittent touch of genius. Otherwise, you're bound to conclude that if they'd curtailed a third of the 72 minutes, it would be a much more consistent and vibey listen\". In the US Shoot the Boss was well-received, with reviewers hailing the record's rough edges and reggae influences as a refreshing alternative to current dance music. Rolling Stone claimed that the album boasts \"deep and dubby dance mixes, reggae toasting and puréed sample soups thick enough to clog a speaker\", and has \"a ragged, street-smart edge too seldom found on the polished postmodern dance floor\". Spin declared that \"Monkey's Mafia's first full-length is a delightfully messy and rambunctious effort... Shoot the Boss captures the spirit of contemporary British multiculture in a way that really hasn't been accomplished since the end of the '70s – when the Clash, the Slits, Mark Stewart of the Pop Group, and other punky-reggae types discovered the vast legacy of Jamaican music.\" The A.V. Club called the record \"a tough-sounding but danceable and highly musical mini-revolt\" and praised Carter for standing out from the other big beat artists of the time, saying, \"his music is much more diverse and satisfying... his songs never veer far from the music he loves, and the album doesn't make lazy concessions to the charts or the clubs\". Allmusic stated that \"Shoot the Boss shows that although Carter is interested in electronic dance, he wants to also keep a 'human' element to his music\" and that by including a full band \"Monkey Mafia contains the best of both worlds\"."]}, {"page": "Kevin Martin (British musician)", "response": ["The Bug's second album, Pressure was released on Rephlex Records in 2003. It included a number of more ambient, dub-influenced tracks alongside the ragga-tinged onslaughts. The Razor X singles were compiled on the Killing Sound album (along with newer material) which was released by Rephlex in 2006. Bug projects have included collaborations with a number of singers and MCs including Cutty Ranks, Flow Dan, Warrior Queen. Ras B and Miss Red. In 2005 he collaborated with Mark Stewart and Keith Levene and has released records on Rephlex, Tigerbeat6 and Klien Records. The Bug produced some radio sessions, including a clash with Soundmurderer on John Peel and a 2006 Breezeblock session with 10 MCs."]}, {"page": "Nick Sheppard", "response": ["Sheppard was educated at Bristol Grammar School, one of Bristol's leading public schools, and was in the same year as fellow musician Mark Stewart of The Pop Group. He started at 16 with The Cortinas, named after a well-known British car, the Ford Cortina. The band moved from R&B towards covering songs by punk forerunners like the New York Dolls and The Stooges. \"In retrospect, I suppose we were very hip,\" Sheppard says. \"We were listening to the right records, as we were right there at the right time.\" The Cortinas' singles, \"Fascist Dictator\" and \"Defiant Pose\" both appeared on Step Forward, the label run by Police manager Miles Copeland, as did their only album \"True Romances\". The band split up in September 1978, after which Sheppard played in a number of bands, including The Viceroys and The Spics, a Bristol-based big band."]}, {"page": "Russell Haswell", "response": ["In 2002 his debut compact disc Live Salvage 1997–2000 (Mego) received Prix Ars Electronica Honorable Mention for Digital Musics. In 2005 and 2006 he curated two London-based All Tomorrow's Parties club events, entitled 'Easy to Swallow', intended for the \"broad-minded\" the events showcased: Carl Michael von Hausswolff, Yasunao Tone + Hecker, Mark Stewart and the Maffia, Aphex Twin, Whitehouse, Surgeon + Regis Present: British Murder Boys, Lee Dorrian, Pita, Earth, Autechre, Robert Hood (ex-Underground Resistance)."]}, {"page": "Mark Stewart", "response": ["Mark Stewart may refer to:", "*Mark Stewart (American football) (born 1959), football player", "*Mark Stewart (artist) (born 1951), watercolor artist", "*Mark Stewart (baseball) (1889–1932), American baseball player", "*Mark Stewart (American musician), New York City based multi-instrumentalist", "*Mark Stewart (footballer) (born 1988), Scottish footballer", "*Mark Stewart (English musician) (born 1960),  founding member of The Pop Group", "**Mark Stewart (album)", "*Mark Stewart (politician) (born 1979), Queensland MP", "*Mark Stewart (cyclist) (born 1995), Scottish track cyclist", "*Mark Stewart (rugby union), Scottish rugby union player"]}, {"page": "For How Much Longer Do We Tolerate Mass Murder?", "response": ["* Mark Stewart – vocals"]}, {"page": "Jim Johnston (English musician)", "response": ["In 2015, he released his second solo album, After All the Wishing…. This time featuring guest vocals from Bristol post-punk musician Mark Stewart from The Pop Group. The track \"Count Your Coppers\" featured on BBC Introducing, and also on the Tom Robinson mix tape on BBC 6 Music in February 2015."]}, {"page": "Heligoland (album)", "response": ["Many other guest vocalists recorded sessions during the duo's post-100th Window era but are not featured on the album, including: Stephanie Dosen, Yolanda Quartey of Phantom Limb – effectively Robot Club's band) and Jhelisa (Anderson, who had previously recorded in 2002 in the studio for material that was not included on 100th Window); and, mostly during the pre-Collected time – Mike Patton, Aku and Akwetey Orraca-Tetteh and Devang Shah of Dragons of Zynth, Elizabeth Fraser, Terry Callier, Fredo Viola, Debbie Clare, Beth Orton and Dot Allison. Mos Def and Leslie Feist were named as artists scheduled for recording sessions back in 2004. Backing tracks from Grant Marshall's side of Massive Attack's writing (mainly facilitated by and done with Robot Club) are known to have been sent to Alice Russell, and prepared for Sharon Jones, Patti Smith and David Bowie during the era but collaboration did not come to fruition, nor did talks with Tom Waits or Tricky, in terms of featuring as guest vocalists on the record. Post-punks Mark Stewart and Keith Levene were pictured inside Del Naja's 100 Suns studio in 2009, but played no part on the album."]}, {"page": "Grooves (magazine)", "response": ["* Yasanao Tone, Tim Hecker, Mark Stewart, Aphex Twin, Whitehouse"]}, {"page": "Sofa Surfers (band)", "response": ["Several guests cooperated on the album Encounters - for example Sensational, Oddateee, Jeb Loy Nichols, DJ Collage, Lil Desmond Levy, Junior Delgado, Dawna Lee, Mark Stewart and MC Santana. On the album called Sofa Surfers sings Mani Obeya."]}, {"page": "Bass Is Maternal", "response": ["Smith & Mighty, consisting of Rob Smith and Ray Mighty, formed in Bristol in the 1987. They became innovators of the Bristol sound, with initial endeavours including cutting up samples of pianist Erik Satie and applying them to hip hop-reggae rhythms, and recording with Pop Group member Mark Stewart on \"Stranger Than Love\". Alongside producing fellow Bristolian act Massive Attack's debut single \"Any Love\" and Fresh 4's sole hit \"Wishing on a Star\", Smith & Mighty released off-kilter covers of the Burt Bacharach and Hal David songs \"Walk on By\" and \"Anyone Who Had a Heart.\" These covers were ragga jungle recordings that highlighted the duo's interest in introducing pop song forms to experimental dance music."]}, {"page": "Soul Jazz Records", "response": ["*SJR113 Mark Stewart - Kiss the Future"]}, {"page": "Trinity Centre", "response": ["As a music venue, Trinity was a melting pot for the different styles popular at the time, from reggae through ska to punk. From this came a post-punk scene which blended many of these influences. Trinity saw regular performances from local acts such as Mark Stewart and The Pop Group, who through their collaborations with artists and producers from the reggae scene, as well as artists such as On-U Sound System and Gary Clail laid the foundations for the later trip hop genre, known as the \"Bristol Sound\"."]}, {"page": "Music of La Femme Nikita", "response": ["* Mark Stewart – Red Zone"]}, {"page": "William Blake in popular culture", "response": ["In 1983, Mark Stewart of The Pop Group recorded a version of Jerusalem with various On-U label associates under the name 'Mark Stewart & The Maffia', on the Jerusalem_(EP), which makes heavy and repeated use of treated samples of Hubert Parry's setting of the song."]}, {"page": "Black Is the Color of My True Love's Hair", "response": ["| Mark Stewart & Richard H. Kirk"]}, {"page": "Little Axe", "response": ["After leaving Sugarhill, McDonald, Wimbish, and drummer Keith LeBlanc began working with Adrian Sherwood, and eventually formed the trio into the industrial/dub group Tackhead, initially fronted by Gary Clail and later Bernard Fowler. McDonald would also collaborate with Sherwood on other projects, including albums by African Head Charge and Mark Stewart."]}, {"page": "The Beatnigs", "response": ["The Beatnigs were an American, San Francisco-based band, which combined hardcore punk, industrial and hip hop influences, described as \"a kind of avant-garde industrial jazz poets collective\".The Rough Guide to Rock, Peter Buckle, ed. Rough Guides (2003)   The band was the initial collaboration of Michael Franti and Rono Tse, who would later form The Disposable Heroes of Hiphoprisy, and Kevin Carnes who would later form Broun Fellinis. The band's stage performance included the use of power tools such as a rotary saw on a metal bar to create industrial noise and pyrotechnics.Watrous, P. (1998) Rock From the Beatnigs, New York Times November 13, 1988  The Beatnigs released an LP  (virus065, Jan 1988) and 12\" EP of their most famous song,Friskics-Warren, W. (2005) I'll Take You There: Pop Music And the Urge for Transcendence Continuum International Publishing Group. Goodwin, A. (1991). Popular music and postmodern theory Cultural studies 5:174-198 \"Television: The Drug of the Nation (virus071, remixed by Adrian Sherwood, Gary Clail, and Mark Stewart) on Alternative Tentacles in 1988.Robbins, IA (1991) The Trouser Press Record Guide, 4th ed. Maxwell Macmillan International,   That same year the played their NYC debut at the New Music Seminar,Watrous, P. (1998) Rock by Any Other Name Is \"Alternative\" New York Times July 15, 1988 and recorded for the BBC's Peel Sessions.  The single was reissued by Alternative Tentacles in 2002, and the album was planned for a CD re-release while made available on iTunes and other digital retailers. One venue for the band was Barrington Hall."]}, {"page": "Industrial hip hop", "response": ["The origins of industrial hip hop are in the work of Mark Stewart, Bill Laswell, and Adrian Sherwood. In 1985, former The Pop Group singer Mark Stewart released As the Veneer of Democracy Starts to Fade, an application of the cut-up style of industrial music, with the house band of Sugar Hill Records (Doug Wimbish, Keith Leblanc, and Skip McDonald).Mark Fisher, \"Prometheus Unbound\". p. 32. The Wire 293. July 2008 In 1986, The Beatnigs were formed in San Francisco. As a collaboration between Michael Franti, Rono Tse and Kevin Carnes, The Beatnigs combined hardcore punk, industrial and hip hop influences, described as \"a kind of avant-garde industrial jazz poets collective\".The Rough Guide to Rock, Peter Buckle, ed. Rough Guides (2003)  The band's stage performance included the use of power tools such as a rotary saw on a metal bar to create industrial noise and pyrotechnics.Watrous, P. (1998) Rock From the Beatnigs, New York Times November 13, 1988 In the late 1980s, Laswell's Material project began to take increasing influence from hip hop. Adrian Sherwood was a major figure in British dub, as well as working with industrial groups such as Cabaret Voltaire, Einstürzende Neubauten, Ministry, KMFDM, and Nine Inch Nails.", "Tackhead, a collaboration between Sherwood and the Sugar Hill band, picked up where Mark Stewart left off.Stephen Troussé, Portishead review, Uncut,  Access date: October 7, 2008. The Disposable Heroes of Hiphoprisy and Consolidated from San Francisco,Ben Wood, \"Michael Franti: A New Bob Marley?\", Suite 101, May 31, 2007.Cornelius Swart, \"The Subsistence Musician: Consolidated's Heart and Soul\", The Portland Mercury, March 22, 2001. MC 900 Ft. Jesus from Texas and Meat Beat Manifesto from the UK are also early representatives of the style. The industrial group 23 Skidoo, Miles Davis's album On the Corner, and the Nine Inch Nails single \"Down in It\" are also important precedents for the style."]}, {"page": "New Age Steppers", "response": ["New Age Steppers were a dub collective from the United Kingdom, formed by producer Adrian Sherwood and featuring members of various prominent 1970s UK post-punk groups, including Ari Up and Viv Albertine of the Slits, Mark Stewart and Bruce Smith of The Pop Group, Keith Levene of Public Image Ltd, John Waddington of Rip Rig + Panic, and Vicky Aspinall of The Raincoats. Other musicians included associates of Sherwood's On-U Sound label, including George Oban, Style Scott, and Eskimo Fox."]}]}}