{"wiki_id": "http://www.wikidata.org/entity/Q190220", "itemLabel": "Philip Pullman", "itemDescription": "English author", "wikipedia_url": "https://en.wikipedia.org/wiki/Philip_Pullman", "wikipedia_page": {"main": "Sir Philip Pullman CBE, FRSL (born 19 October 1946) is an English writer. His books include the fantasy trilogy His Dark Materials and The Good Man Jesus and the Scoundrel Christ, a fictionalised biography of Jesus. In 2008, The Times named Pullman one of the \"50 greatest British writers since 1945\". In a 2004 BBC poll, he was named the eleventh most influential person in British culture. He was knighted in the 2019 New Year Honours for services to literature.Northern Lights, the first volume in His Dark Materials, won the 1995 Carnegie Medal of the Library Association as the year's outstanding English-language children's book. For the 70th anniversary it was named in the top ten by a panel composing the public election for an all-time favourite. It won the public vote from the shortlist and was named all-time \"Carnegie of Carnegies\" in June 2007. It was filmed under the book's US title, The Golden Compass. In 2003, His Dark Materials trilogy ranked third in the BBC's The Big Read, a poll of 200 top novels voted by the British public.", "link_mentions": [{"page": "Alan Garner", "response": ["In the fiftieth anniversary edition of The Weirdstone of Brisingamen, published by HarperCollins in 2010, several notable British fantasy novelists praised Garner and his work. Susan Cooper related that \"The power and range of Alan Garner's astounding talent has grown with every book he's written\", whilst David Almond called him one of Britain's \"greatest writers\" whose works \"really matter\". Philip Pullman, the author of the His Dark Materials trilogy, went further when he remarked that:"]}, {"page": "Ansible", "response": ["* Philip Pullman, in the 2000 novel The Amber Spyglass, part of the His Dark Materials trilogy."]}, {"page": "C. S. Lewis", "response": ["Many books have been inspired by Lewis, including A Severe Mercy by his correspondent and friend Sheldon Vanauken. The Chronicles of Narnia has been particularly influential. Modern children's literature has been more or less influenced by Lewis's series, such as Daniel Handler's A Series of Unfortunate Events, Eoin Colfer's Artemis Fowl, Philip Pullman's His Dark Materials, and J. K. Rowling's Harry Potter. Pullman is an atheist and is known to be sharply critical of C. S. Lewis's work, accusing Lewis of featuring religious propaganda, misogyny, racism, and emotional sadism in his books. However, he has also modestly praised The Chronicles of Narnia for being a \"more serious\" work of literature in comparison with Tolkien's \"trivial\" The Lord of the Rings. Authors of adult fantasy literature such as Tim Powers have also testified to being influenced by Lewis's work."]}, {"page": "Fantasy film", "response": ["Following the success of these ventures, Hollywood studios have greenlighted additional big-budget productions in the genre. These have included adaptations of the first, second, and third books in C. S. Lewis' The Chronicles of Narnia series and the teen novel Eragon, as well as adaptations of Susan Cooper's The Dark Is Rising, Cornelia Funke's Inkheart, Philip Pullman's The Golden Compass, Holly Black's The Spiderwick Chronicles, Nickelodeon's TV show Avatar: The Last Airbender, and the Fantasia segment (along with Johann Wolfgang von Goethe's original poem) The Sorcerer's Apprentice"]}, {"page": "Galatea", "response": ["* Galatea, a 1976 novel by Philip Pullman"]}, {"page": "Ian McKellen", "response": ["In 2007, McKellen narrated the romantic fantasy adventure film Stardust starring Charlie Cox and Claire Danes, which was a critical and financial success. That same year, he lent his voice to the armored bear Iorek Byrnison in the Chris Weitz-directed fantasy film The Golden Compass based on the acclaimed Philip Pullman novel Northern Lights and starred Nicole Kidman and Daniel Craig. The film received mixed reviews but was a financial success."]}, {"page": "J. K. Rowling", "response": ["Rowling has been compared to Enid Blyton, who also wrote in simple language about groups of children and long held sway over the British children's market. She has also been described as an heir to Roald Dahl. Some critics view Harry Potter rise, along with the concurrent success of Philip Pullman's His Dark Materials, as part of a broader shift in reading tastes: a rejection of literary fiction in favour of plot and adventure. This is reflected in the BBC's 2003 \"Big Read\" survey of the UK's favourite books, where Pullman and Rowling ranked at numbers 3 and 5, respectively, with very few British literary classics in the top 10."]}, {"page": "John Milton", "response": ["The title of Philip Pullman's His Dark Materials trilogy is derived from a quotation, \"His dark materials to create more worlds\", line 915 of Book II in Paradise Lost. Pullman was concerned to produce a version of Milton's poem accessible to teenagers, and has spoken of Milton as \"our greatest public poet\"."]}, {"page": "List of agnostics", "response": ["* Philip Pullman (born 1946): English children's author of the trilogy His Dark Materials; has said that he is technically an agnostic, though he also calls himself an atheist."]}, {"page": "Lee Van Cleef", "response": ["* Philip Pullman, author of the bestselling trilogy His Dark Materials, stated that the first name of his fictional American explorer, airman, and crack marksman Lee Scoresby was a reference to Van Cleef, with the character's surname as an homage to the famous Arctic explorer William Scoresby."]}, {"page": "Oxford", "response": ["* Philip Pullman, undergraduate at Exeter, teacher and resident in the city.", "* His Dark Materials trilogy (1995 onwards) by Philip Pullman ", "* Sir Philip Pullman : 24 January 2007."]}, {"page": "October 19", "response": ["*  1946   – Philip Pullman, English author and academic"]}, {"page": "Polar bear", "response": ["Polar bears are popular in fiction, particularly in books for children or teenagers. For example, The Polar Bear Son is adapted from a traditional Inuit tale. The animated television series Noah's Island features a polar bear named Noah as the protagonist. Polar bears feature prominently in East (North Child in the UK) by Edith Pattou,East (2003), A novel by Edith Pattou, Fantastic Fiction The Bear by Raymond Briggs (adapted into an animated short in 1998),The Bear, Toonhound and Chris d'Lacey's The Fire Within series.The Fire Within , Chris d'Lacey's official website The panserbjørne of Philip Pullman's fantasy trilogy His Dark Materials are sapient, dignified polar bears who exhibit anthropomorphic qualities, and feature prominently in the 2007 film adaptation of The Golden Compass. The television series Lost features polar bears living on the tropical island setting."]}, {"page": "Faster-than-light communication", "response": ["Similar devices are present in the works of numerous others, such as Frank Herbert and Philip Pullman, who called his a lodestone resonator."]}, {"page": "The Chronicles of Narnia", "response": ["Philip Pullman's fantasy series, His Dark Materials, is seen as a response to The Chronicles. Pullman is a self-described atheist who wholly rejects the spiritual themes that permeate The Chronicles, yet his series nonetheless addresses many of the same issues and introduces some similar character types, including talking animals. In another parallel, the first books in each series – Pullman's Northern Lights and The Lion, the Witch, and the Wardrobe – both open with a young girl hiding in a wardrobe.", "Philip Pullman, inimical to Lewis on many fronts, calls the Narnia stories \"monumentally disparaging of women\". His interpretation of the Susan passages reflects this view:"]}, {"page": "University of Oxford", "response": ["Writers associated with Oxford include Vera Brittain, A.S. Byatt, Lewis Carroll, Penelope Fitzgerald, John Fowles, Theodor Geisel, Robert Graves, Graham Greene, Joseph Heller, Christopher Hitchens, Aldous Huxley, Samuel Johnson, Nicole Krauss, C. S. Lewis, Thomas Middleton, Iris Murdoch, V.S. Naipaul, Philip Pullman, Dorothy L. Sayers, Vikram Seth, J. R. R. Tolkien, Evelyn Waugh, Oscar Wilde, the poets Percy Bysshe Shelley, John Donne, A. E. Housman, Gerard Manley Hopkins, W. H. Auden, T. S. Eliot and Philip Larkin, and seven poets laureate: Thomas Warton, Henry James Pye, Robert Southey, Robert Bridges, Cecil Day-Lewis, Sir John Betjeman, and Andrew Motion.", "Famous literary works range from Brideshead Revisited by Evelyn Waugh, which in 1981 was adapted as a television serial, to the trilogy His Dark Materials by Philip Pullman, which features an alternate-reality version of the university and was adapted for film in 2007 and as a BBC television series in 2019."]}, {"page": "William Blake", "response": ["Much of the central conceit of Philip Pullman's fantasy trilogy His Dark Materials is rooted in the world of Blake's The Marriage of Heaven and Hell. Canadian music composer Kathleen Yearwood is one of many contemporary musicians that have set Blake's poems to music. After World War II, Blake's role in popular culture came to the fore in a variety of areas such as popular music, film, and the graphic novel, leading Edward Larrissy to assert that \"Blake is the Romantic writer who has exerted the most powerful influence on the twentieth century.\"Edward Larrissy. Blake and Modern Literature. Houndmills: Palgrave, 2006. p. 1."]}, {"page": "Zeppelin", "response": ["Zeppelins are often featured in alternate history and parallel universe fiction. They feature prominently in the popular fantasy novels of the His Dark Materials trilogy and The Book of Dust series by Philip Pullman. In the American science fiction series, Fringe, Zeppelins are a notable historical idiosyncrasy that helps differentiate the series' two parallel universes, also used in Doctor Who in the episodes \"The Rise of the Cybermen\" and \"The Age of Steel\" when the TARDIS crashes in an alternate reality where Britain is a 'People's Republic' and Pete Tyler, Rose Tyler's father, is alive and is a wealthy inventor.Hanson, Andrew. \"Pinkner and Wyman: the Evil Geniuses behind Fringe.\" Los Angeles Times, 20 May 2010. Retrieved: 17 June 2011. They are also seen in the alternate reality 1939 plot line in the film Sky Captain and the World of Tomorrow, and have an iconic association with the steampunk subcultural movement in broader terms. In 1989, Japanese animator Miyazaki released Kiki's Delivery Service, which features a Zeppelin as a plot element. A Zeppelin was used in Indiana Jones and the Last Crusade, when Jones and his father try to escape from Germany in a Zeppelin."]}, {"page": "1946", "response": ["* October 19 – Philip Pullman, English author"]}, {"page": "His Dark Materials", "response": ["His Dark Materials is a trilogy of fantasy novels by Philip Pullman consisting of Northern Lights (1995; published as The Golden Compass in North America), The Subtle Knife (1997), and The Amber Spyglass (2000). It follows the coming of age of two children, Lyra Belacqua and Will Parry, as they wander through a series of parallel universes. The novels have won a number of awards, including the Carnegie Medal in 1995 for Northern Lights and the 2001 Whitbread Book of the Year for The Amber Spyglass. In 2003, the trilogy was ranked third on the BBC's The Big Read poll.\"BBC – The Big Read\". BBC. April 2003. Retrieved 26 July 2019", "Category:Novels by Philip Pullman"]}, {"page": "Norfolk", "response": ["* Philip Pullman, author, born in Norwich"]}, {"page": "Diana Wynne Jones", "response": ["Jones has been cited as an inspiration and muse for several fantasy and science fiction authors including Philip Pullman, Terry Pratchett, Penelope Lively, Robin McKinley, Dina Rabinovitch, Megan Whalen Turner, J.K. Rowling and Neil Gaiman, with Gaiman describing her as \"quite simply the best writer for children of her generation\". Her work has been nominated for several awards. She was twice a finalist for the Hugo Award, nominated fourteen times for the Locus Award, seven times for the Mythopoeic Award (which she won twice), twice for a British Fantasy Award (won in 1999), and twice for a World Fantasy Award, which she would also win in 2007."]}, {"page": "River Thames", "response": ["Science-fiction novels make liberal use of a futuristic Thames. The utopian News from Nowhere by William Morris is mainly the account of a journey through the Thames valley in a socialist future. The Thames also features prominently in Philip Pullman's His Dark Materials trilogy, as a communications artery for the waterborne Gyptian people of Oxford and the Fens, and as a prominent setting for his novel La Belle Sauvage."]}, {"page": "Children's literature", "response": ["Philip Pullman's His Dark Materials is an epic trilogy of fantasy novels consisting of Northern Lights (1995, published as The Golden Compass in North America), The Subtle Knife (1997), and The Amber Spyglass (2000). It follows the coming of age of two children, Lyra Belacqua and Will Parry, as they wander through a series of parallel universes. The three novels have won a number of awards, most notably the 2001 Whitbread Book of the Year prize, won by The Amber Spyglass. Northern Lights won the Carnegie Medal for children's fiction in 1995.", "Geoffrey Trease and Rosemary SutcliffHunt, 1995, (p. 208–209) brought a new sophistication to the historical adventure novel. Philip Pullman in the Sally Lockhart novels and Julia Golding in the Cat Royal series have continued the tradition of the historical adventure."]}, {"page": "List of science-fiction authors", "response": ["*Philip Pullman (born 1946)"]}, {"page": "Adamant", "response": ["*In the His Dark Materials trilogy by Philip Pullman, in the third book, The Amber Spyglass (2000), Lord Asriel's tower is made of adamant."]}, {"page": "List of children's literature writers", "response": ["*Philip Pullman (born 1946) – His Dark Materials trilogy, Clockwork, The Firework-Maker's Daughter"]}, {"page": "List of fantasy authors", "response": ["* Philip Pullman, (born 1946) author of His Dark Materials trilogy"]}, {"page": "The Weirdstone of Brisingamen", "response": ["In the fiftieth anniversary edition of The Weirdstone of Brisingamen, published by HarperCollins in 2010, several notable British fantasy novelists praised Garner and his work. Susan Cooper related that \"The power and range of Alan Garner's astounding talent has grown with every book he's written\", whilst David Almond called him one of Britain's \"greatest writers\" whose works \"really matter\".Pullman et al 2010. p. 02. Philip Pullman, the author of the His Dark Materials trilogy, went further when he remarked that:", "Philip Pullman also gave it high praise, stating \"Alan Garner is indisputably the great originator, the most important British writer of fantasy since Tolkien.\"  Neil Gaiman has observed that \"Alan Garner’s fiction is something special. Garner’s fantasies were smart and challenging, based in the here and now, in which real English places emerged from the shadow of folklore, and in which people found themselves walking, living and battling their way through the dreams and patterns of myth.\""]}, {"page": "Carnegie Medal (literary award)", "response": ["* Philip Pullman, His Dark Materials 1: Northern Lights (1995)", "To commemorate the 70th anniversary of the Carnegie Medal in 2007, CILIP created a 'Living Archive' on the Carnegie Medal website with information about each of the winning books and conducted a poll to identify the nation's favourite Carnegie Medal winner, to be named the \"Carnegie of Carnegies\". The winner, announced on 21 June 2007 at the British Library, was Northern Lights by Philip Pullman (1995). It was the expected winner, garnering 40% of the votes in the UK, and 36% worldwide.", "* Philip Pullman, Northern Lights, (Scholastic, 1995)", "* * Philip Pullman, Northern Lights (Scholastic) — first of a trilogy, His Dark Materials", "* Philip Pullman, Clockwork (Doubleday), illus. Peter Bailey", "*+ Philip Pullman, The Amber Spyglass (Scholastic) — third of a trilogy, His Dark Materials", "* Philip Pullman, The Scarecrow and his Servant (Doubleday), 8+"]}, {"page": "Amanda Craig", "response": ["Craig is particularly interested in fairy-tales and children's fiction, and was one of the first critics to praise J. K. Rowling, Philip Pullman, Cressida Cowell, Stephenie Meyer, Anthony Horowitz, Malorie Blackman and Suzanne Collins."]}, {"page": "List of fictional computers", "response": ["* Ordinator, the name used for any computer in the parallel universe occupied by Lyra in the novel Northern Lights by Philip Pullman (1995)"]}, {"page": "Brasenose College, Oxford", "response": ["In May 2018 author Philip Pullman opened the extensively renovated Greenland Library following a £4 million project to provide a better working space for students (architects - Lee/Fitzgerald). The library works were funded by three college alumni, Duncan Greenland, James Del Favero and Gerald Smith. Two reading rooms are named in honour of Del Favero and Smith respectively with the overall library taking Greenland’s name The renovations won an RIBA regional RIBA Conservation award in 2019."]}, {"page": "Christ Church, Oxford", "response": ["The college buildings and grounds are the setting for parts of Evelyn Waugh's Brideshead Revisited, as well as a small part of Lewis Carroll's Alice's Adventures in Wonderland. More recently it has been used in the filming of the movies of J. K. Rowling's Harry Potter series and also the film adaptation of Philip Pullman's novel Northern Lights (the film bearing the title of the American edition of the book, The Golden Compass). Distinctive features of the college's architecture have been used as models by a number of other academic institutions, including the NUI Galway, which reproduces Tom Quad. The University of Chicago, Cornell University, and Kneuterdijk Palace have reproductions of Christ Church's dining hall (in the forms of Hutchinson Hall, the dining hall of Risley Residential College, and the Gothic hall of Kneuterdijk Palace, respectively). ChristChurch Cathedral in New Zealand, after which the City of Christchurch is named, is itself named after Christ Church, Oxford. Stained glass windows in the cathedral and other buildings are by the Pre-Raphaelite William Morris group with designs by Edward Burne-Jones.Edward Burne-Jones Southgate Green Association \"His work included both stained-glass windows for Christ Church in Oxford and the stained glass windows for Christ Church on Southgate Green.\"PreRaphaelite Painting and Design  University of Texas"]}, {"page": "Exeter College, Oxford", "response": ["The college is located on Turl Street, where it was founded in 1314 by Devon-born Walter de Stapledon, Bishop of Exeter, as a school to educate clergymen. At its foundation Exeter was popular with the sons of the Devonshire gentry, though has since become associated with a much broader range of notable alumni, including William Morris, J. R. R. Tolkien, Richard Burton, Roger Bannister, Alan Bennett, and Philip Pullman.", "Exeter College is the basis for the fictional Jordan College in Philip Pullman's novel trilogy His Dark Materials. The 2007 film version of the first novel, The Golden Compass (originally Northern Lights), used the college for location filming.", "Amongst Exeter's alumni are many writers, including J. R. R. Tolkien, Martin Amis and Philip Pullman; Roger Bannister, the first man to run a mile in under four minutes; the actors Richard Burton and Imogen Stubbs; Liaquat Ali Khan, the first prime minister of Pakistan, John Kufuor, the former President of Ghana and Pedro Pablo Kuczynski, former president of Peru."]}, {"page": "Lady Margaret Hall, Oxford", "response": ["* Philip Pullman"]}, {"page": "Hay-on-Wye", "response": ["Past speakers at the festival have included Noam Chomsky, Brian Eno, Kimberlé Crenshaw, Philip Pullman, Diane Abbott, Steven Pinker and Laurie Penny, among others. Music headliners have included Clean Bandit, Hot Chip, and Donovan. Comedians have included James Acaster, Sarah Pascoe, and Phil Wang."]}, {"page": "Misotheism", "response": ["*Misotheism first appears in a dictionary in 1907.New English Dictionary, under miso-; also explicitly in 1913, Noah Webster's Dictionary of the English Language . The Greek  () is found in Aeschylus (Agamemnon 1090). The English word appears as a nonce-coinage, used by Thomas de Quincey in 1846.\"On Christianity As An Organ of Political Movement\" (1846). It is comparable to the original meaning of Greek  of \"rejecting the gods, rejected by the gods, godforsaken\". Strictly speaking, the term connotes an attitude towards the gods (one of hatred) rather than making a statement about their nature. Bernard Schweizer (2002) stated \"that the English vocabulary seems to lack a suitable word for outright hatred of God... [even though] history records a number of outspoken misotheists\", believing \"misotheism\" to be his original coinage. Applying the term to the work of Philip Pullman (His Dark Materials), Schweizer clarifies that he does not mean the term to carry the negative connotations of misanthropy: \"To me, the word connotes a heroic stance of humanistic affirmation and the courage to defy the powers that rule the universe.\"Bernard Schweizer, 'Religious Subversion in His Dark Materials in: Millicent Lenz, Carole Scott (eds.) His Dark Materials Illuminated: Critical Essays On Philip Pullman's Trilogy (2005), p. 172, note 3.", "Misotheistic and/or dystheistic expression has a long history in the arts and in literature. Bernard Schweizer's book Hating God: The Untold Story of Misotheism is devoted to this topic. He traces the history of ideas behind misotheism from the Book of Job, via Epicureanism and the twilight of Roman paganism, to deism, anarchism, Nietzschean philosophy, feminism, and radical humanism. The main literary figures in his study are Percy Bysshe Shelley, Algernon Swinburne, Zora Neale Hurston, Rebecca West, Elie Wiesel, Peter Shaffer, and Philip Pullman. Schweizer argues that literature is the preferred medium for the expression of God-hatred because the creative possibilities of literature allow writers to simultaneously unburden themselves of their misotheism, while ingeneously veiling their blasphemy.Bernard Schweizer, Hating God: The Untold Story of Misotheism (2010).", "By the 1970s, Harlan Ellison even described dystheism as a bit of a science fiction cliché. Ellison himself has dealt with the theme in his \"The Deathbird\", the title story of Deathbird Stories, a collection based on the theme of (for the most part) malevolent modern-day gods. Lester del Rey's \"Evensong\" (the first story in Harlan Ellison's much-acclaimed Dangerous Visions anthology), tells the story of a fugitive God hunted down across the universe by a vengeful humanity which seeks to \"put him in his place\". \"Faith of Our Fathers\" by Philip K. Dick, also from the same anthology, features a horrifying vision of a being, possibly God, who is all-devouring and amoral. Philip Pullman's previously mentioned trilogy, His Dark Materials, presented the theme of a negligent or evil God to a wider audience, as depicted in the 2007 film The Golden Compass based on the first book of this trilogy."]}, {"page": "Contemporary fantasy", "response": ["* Philip Pullman's His Dark Materials trilogy - The trilogy takes place across several universes including \"ours\"."]}, {"page": "The Fens", "response": ["*Philip Pullman: Northern Lights"]}, {"page": "Samuel West", "response": ["West has recorded over one hundred audiobooks, among which are the Shakespeare plays All's Well That Ends Well, Coriolanus, Henry V, The Merchant of Venice, A Midsummer Night's Dream, Much Ado About Nothing, Richard II and Macbeth (directed by Steven Berkoff), the Wind on Fire trilogy by William Nicholson (The Wind Singer, Slaves of the Mastery and Firesong), the Arthur trilogy by Kevin Crossley-Holland (The Seeing Stone, At the Crossing Places and King of the Middle March), five books by Sebastian Faulks (Charlotte Gray, Birdsong, The Girl at the Lion d'Or, Human Traces and A Possible Life), four by Michael Ridpath (Trading Reality, Final Venture, Free to Trade, and The Marketmaker), two by George Orwell (Nineteen Eighty-Four and Homage to Catalonia), two by Mary Wesley (An Imaginative Experience and Part of the Furniture), two by Robert Goddard (Closed Circle and In Pale Battalions) and several compilations of poetry (Realms of Gold: Letters and Poems of John Keats, Bright Star, The Collected Works of Shelley, Seven Ages, Great Narrative Poems of the Romantic Age and A Shropshire Lad). Also Faust, Bomber, Doctor Who: The Vengeance of Morbius, Empire of the Sun,  Brighton Rock, Fair Stood the Wind for France,  Fluke, Great Speeches in History, How Proust Can Change Your Life,  Lady Windermere's Fan, Peter Pan, The Alchemist, The Day of the Triffids,  The Hairy Hands, The Lives of Christopher Chant, The Man Who Made Husbands Jealous, The Queen's Man, The Solitaire Mystery, The Swimming Pool Library, The Two Destinies, The Velveteen Rabbit, The Way I Found Her, The Way to Dusty Death, The Woodlanders, Under the Net, Wuthering Heights and Philip Pullman's Grimm Tales for Young and Old.", "Samuel West has received nine AudioFile Earphones Awards for his narration: The Day of the Triffids by John Wyndham (1996), Peter Pan by J.M.Barrie (1997), Charlotte Gray by Sebastian Faulks (1999), The Way I Found Her by Rose Tremain (2000), The Swimming Pool Library by Alan Hollinghurst (2007), Faust by Goethe (2011),  A Shropshire Lad by A. E. Housman (2011), A Possible Life by Sebastian Faulks (2012) and Philip Pullman's Grimm Tales for Young and Old (2013)"]}, {"page": "Pullman", "response": ["* Philip Pullman (born 1946), English writer"]}, {"page": "Tom Courtenay", "response": ["In 2007, Courtenay appeared in two films: Flood, a disaster epic in which London is overwhelmed by floods, and The Golden Compass, an adaptation of Philip Pullman's novel, playing the part of Farder Coram. In 2008, he appeared in the BBC adaptation of Little Dorrit by Charles Dickens, playing William Dorrit, and the Christmas edition of The Royle Family, playing David (Senior). In March 2011, he joined the cast of Gambit, a film starring fellow RADA alumnus Alan Rickman that began filming in May. The film was released in Great Britain in November 2012. In 2012, he co-starred in Quartet, directed by Dustin Hoffman."]}, {"page": "Bunhill Fields", "response": ["In 2006–07, members of the group The Friends of William Blake established the original location of his grave, and proposed placing a new memorial there. In the form of a ledger stone, with lettering by Lida Cardozo Kindersley, this was finally unveiled on 12 August 2018 by Philip Pullman, President of the Blake Society."]}, {"page": "Colin Wilson", "response": ["In 2016 the first full-length biography of Wilson, reviewing his entire life's work, Beyond the Robot: The Life and Work of Colin Wilson, by Gary Lachman, appeared. It received a positive endorsement from Philip Pullman, who wrote that \"Wilson was always far better and more interesting than fashionable opinion claimed, and in Lachman he has found a biographer who can respond to the whole range of his work with sympathy and understanding, in a style which, like Wilson's own, is always immensely readable.\" Michael Dirda in The Washington Post called Wilson a \"controversial writer who explored the nature of human consciousness in dozens of books\" and said that Lachman, a \"leading student of the western esoteric tradition, writes with \"exceptional grace, forcefulness, and clarity.\"\"Ufos, alien abductions, the occult: to one man, the building blocks of scholarship\" Michael Dirda The Washington Post 31 August 2016. Brett Taylor \"enjoyed\" the biography, but said that \"a more critical author might have written a book that argued for the subject's worth in a broader and more convincing context. Lachman displays credulity on occult matters and an admiration for Wilson's sometimes dodgy philosophy.\""]}, {"page": "Royal National Theatre", "response": ["* His Dark Materials, a two-part adaptation of Philip Pullman's novel directed by Nicholas Hytner starring Anna Maxwell Martin, Dominic Cooper, Patricia Hodge and Niamh Cusack (2003)"]}, {"page": "Julie Walters", "response": ["In 2003, Walters starred as a widow (Annie Clark) determined to make some good come out of her husband's death from cancer in Calendar Girls, which starred Helen Mirren. In 2005, she again starred as an inspirational real-life figure, Marie Stubbs in the ITV1 drama Ahead of the Class. In 2006, she came fourth in ITV's poll of the public's 50 Greatest Stars, coming four places above frequent co-star Victoria Wood. In 2006, she starred in the film Driving Lessons alongside Rupert Grint (who played her son Ron in Harry Potter), and had a leading role in the BBC's adaptation of Philip Pullman's novel The Ruby in the Smoke."]}]}}