{"wiki_id": "http://www.wikidata.org/entity/Q1900472", "itemLabel": "Tony Eccles", "itemDescription": "British darts player", "wikipedia_url": "https://en.wikipedia.org/wiki/Tony_Eccles", "wikipedia_page": {"main": "Tony Eccles (born 8 January 1970) is an English former professional darts player. Nicknamed The Viper, he played in both the British Darts Organisation (BDO) and the Professional Darts Corporation (PDC). He reached the quarter-finals of the BDO World Darts Championship twice and is a former winner of the Dutch Open, British Open and British Pentathlon.\n\n", "link_mentions": [{"page": "Kevin Painter", "response": ["Painter's results in the televised majors in 2008 were not as might have been expected from the World Championship – he was once again defeated by Osborne in the third round of the UK Open and lost in the first round of the Las Vegas Desert Classic against the eventual champion Taylor. Painter averaged 104 (the third highest average of the tournament) and did not miss a double in the match, but was still defeated 6–4. His poor record at the World Matchplay continued as he suffered a first round loss in the 2008 event to Tony Eccles. He lost in a deciding leg to Colin Lloyd in the second round of the World Grand Prix (having missed three darts to win the match) and finished bottom of his group in the 2008 Grand Slam of Darts. However, his success in non-televised events was considerably better including an appearance in the Bristol Players Championship final – losing 3–2 to Dennis Priestley. This was his first PDC final since September 2006."]}, {"page": "Jelle Klaasen", "response": ["As World Champion, he was invited to the 2006 World Darts Trophy in his home country, but lost 0–3 to Tony Eccles in the first round. In 2007, he won in the first round 3–1 against reigning PDC world champion van Barneveld, shortly after that he lost in the second round to Andy Hamilton."]}, {"page": "Shaun Greatbatch", "response": ["Shaun's family is said by commentators to have a rich darting pedigree. His Welsh mother, Sandra, reached the semi-finals of the Women's World Championship in 2002 and was a Women's World Masters finalist in 1992 and 1997. Shaun lost in the first round of the BDO World Darts Championship in his first four occasions, 2001 against then reigning champion Ted Hankey, in 2003 against Colin Monk, 2004 against James Wade and 2005 against Mike Veitch. This dubious honour ended in the 2006 World Championship, where Shaun finally won in five sets against Niels de Ruiter. He went on to reach the semi-finals, losing to eventual champion Jelle Klaasen. The result means he did not need to qualify for the 2007 championship where he lost in the second round to Tony Eccles. In 2008 the first round jinx came back to haunt him as he was beaten by Martin Phillips.", "* 2007: 2nd Round (lost to Tony Eccles 0–4)"]}, {"page": "Adrian Lewis", "response": ["Lewis reached the final of the 2011 PDC World Darts Championship courtesy of victories over Tony Eccles, Mark Dudbridge, Robert Thornton, Vincent van der Voort and Mark Webster en route to the final, where he played Gary Anderson. The match-up ensured that, for the first time, the winner of the PDC World Championship would not have previously succeeded in the rival BDO World Championship. Lewis himself became the only player to have reached the PDC final without playing full-time on the BDO circuit."]}, {"page": "James Wade", "response": ["Wade made his debut in the Premier League as he was in the top four of the Order of Merit and on the opening night became the first player to defeat Taylor in the tournament's three-year history, winning the match 8 legs to 6. Taylor however exacted revenge with a 16–8 victory in the final on 26 May 2008 after Wade had defeated van Barneveld in the semi-finals. Incredibly, Wade claimed his third major title in a year at the UK Open, by beating American Gary Mawson 11–7 in the final. The following month, he reached the finals of the Las Vegas Desert Classic, losing 13–7 to Taylor. Then in July he reached his third World Matchplay final in a row, losing for the second time in three years in the final to Taylor 18–9, making this the third major final loss of the year against Taylor. In the defence of his World Grand Prix title he lost to Tony Eccles in the first round. He returned to form to claim two Players Championship titles in the autumn and also hit his first televised nine-darter in a second round loss to Gary Anderson at the Grand Slam of Darts."]}, {"page": "2007 BDO World Darts Championship", "response": ["*Tony Eccles 50–1", "#  Tony Eccles", "Tony Eccles, seeded four but a 50/1 outsider for the title beat promising Welshman Mark Webster in straight sets. Webster failed to show the form that took him to a Europe Cup singles title and like van Gerwen earlier in the evening, his Lakeside debut ended in defeat.", "The second round of the tournament got underway with the first four matches from the top half of the draw. This half had seen few shocks in terms of the seedings, with only the number 9 seed, Vincent van der Voort, losing in the first round. The trend continued in the second round as Martin Adams (seeded 1), Tony Eccles (4), Mervyn King (5) and Ted Hankey (8) all made it to the quarter-finals. Out of the four, Hankey had the most difficulty in progressing: he was 2–0 and 3–2 down against Davy Richardson, before a maximum 170 checkout at the start of the final set finally swung the match in his favour. Richardson had been battling the pain of broken ribs in the tournament.", "Day six saw the first two quarter-finals settled, as top seed Martin Adams saw off 2000 champion Ted Hankey 5–3 while Mervyn King beat Tony Eccles 5–4. King hit ten 180s in his match while coming from 3–0 behind, before revealing in his post-match interview that he had nearly walked out of the tournament in response to speculation about a possible switch to the PDC. He said, \"I nearly packed my darts away and went home. You nearly didn't have a quarter-final. It was that close.\""]}, {"page": "2002 BDO World Darts Championship", "response": ["Adams compiled scores of 3–0 and 3–1 to lead 2–0 over Johnstone. He completed a 3–0 whitewash after defeating Johnstone 3–2 in the third set. Ted Hankey, the 2000 champion and seventh seed, defeated Jarkko Komula 3–2. Both players equalled the score and forced the game to enter a final set decider that Hankey won 3–0. Afterwards Komula said he was annoyed because he was not informed of tournament organisers moving the game's start time by two hours to allow it to be televised. Jones twice recovered from being one set behind Tony Eccles to win 3–2. Mike Veitch, who participated in the competition for the first time since the 1990 edition, was whitewashed 3–0 by Co Stompé after protracted play. Sixth seed Bob Taylor progressed to the second round for the first time since the 1994 championship with a 3–0 victory over Ferrell with a match-winning 102 checkout."]}, {"page": "2003 BDO World Darts Championship", "response": ["Bob Taylor progressed past the first round for the second year in a row with a 3–0 whitewash of Peter Hunt from set victories of 3–2 and 3–1×2. In their maiden television appearances, Darryl Fitton defeated Burton 3–1 with set victories of 3–0, 3–2 and 3–1. Martin Adams, the number four seed and England captain, claimed the opening set against Co Stompé. He beat Stompé in the second set and won 3–1 with a 138 checkout. Wagner won the opening set against Gary Robson 3–2. Robson took set two after Wagner missed multiple chances to hit the double ten ring. Wagner took two more sets from six consecutive legs for a 3–1 victory. In the match between Van Barneveld and Matt Clark, the latter began with a maximum before the former took the first set. He then claimed six legs in a row to win 3–1. Erik Clarys defeated the seventh seed Tony Eccles 3–1 after a minor challenge from Eccles in set three. Sub-par play from Shaun Greatbatch saw him whitewashed 3–0 by Colin Monk; Greatbatch was able to force the second set to conclude with a final leg decider before he missed the double rings in the following set."]}, {"page": "2006 BDO World Darts Championship", "response": ["#  Tony Eccles"]}, {"page": "Tony David", "response": ["David went into the 2003 World Championship at the Lakeside as the number 1 seed and pre-tournament favourite after his 2002 successes. The defence of his world title started creditably as he defeated Brian Sorensen and Vincent van der Voort in his first two matches, but ended with a surprising 0–5 loss at the quarter-final stage to Ritchie Davies of Wales. After that defeat, David has failed to win another match at the Lakeside event. He went out in the first round in 2004 to Darryl Fitton and in 2005 to Tony Eccles. He failed to qualify for the 2006 or 2007 events. He returned to Lakeside in 2008 but lost in the first round to Gary Robson.", "* 2005: 1st round (lost to Tony Eccles 2–3)"]}, {"page": "Per Laursen", "response": ["On his television debut in the 2006 BDO World Darts Championship, he defeated number five seed Tony Eccles in the first round but lost to Shaun Greatbatch in round two."]}, {"page": "2007 in darts", "response": ["*27 – Tony Eccles wins the German Gold Cup in Bremen beating Dutchman Remco van Eijden by 3 sets to 1 to claim the €700 first prize. Heike Ernst beat Thea Kaaijk to take the women's title.", "*14 – Tony Eccles wins the Norway Open (a WDF category 3) event in Tønsberg beating Dutchman Hans Blijs in the final. England's Dee Bateman surprises Karin Krappen to take the women's title.", "*4 – Tony Eccles adds to the exodus of players from the BDO by joining the PDPA/PDC on the eve of the 2007 UK Open. Eccles was ranked number two in the WDF rankings at the time and sacrifices his place in the England World Cup team.", "|align=right| Mervyn King  ||align=center| 5–4 ||  Tony Eccles", ":Men's Singles Semi-Finals (Losers €170) Tony Eccles 2–0 Jyhan Artut; Remco van Eijden 2–1 Michael Klönhammer.", ":Final (Winner €350 Runner-up €350) Tony Eccles 3–1 Remco van Eijden (0–2, 2–1, 2–0, 2–1)"]}, {"page": "Darryl Fitton", "response": ["After a quiet 2012 season, Fitton entered the 2013 BDO World Darts Championship as the 16th seed. He narrowly defeated Benito van de Pas 3-2 in the first round to secure his first win at Lakeside since 2009. He then caused a big upset by defeating top seed Stephen Bunting 4-2 in the second round. In the quarter-final, Fitton was defeated 5-2 by Wesley Harms. Fitton's form improved after this but his 2014 World Championship was ended in the first round by Tony Eccles, in Eccles's last tournament before being convicted of child grooming. The following year, Fitton reached the quarter-finals again beating previous year's runner-up Alan Norris en route, before losing to Glen Durrant.", "* 2014: 1st Round (lost to Tony Eccles 1-3)"]}, {"page": "Mark Webster (darts player)", "response": ["He first came to prominence in 1996, winning the 1996 WDF Europe Cup, and making the semi-finals of the 2006 Winmau World Masters. In other BDO/WDF tournaments during 2006, he won the Northern Ireland Open and reached the semi-finals of the Welsh Open. However, he underperformed in the subsequent 2007 World Championship, losing on his debut to Tony Eccles 3–0 in the first round.", "He began 2010 poorly with repeated early exits in Floor events but found form by a few quarter final appearances and by reaching consecutive semi-finals in a Players Championship and UK Open Qualifier 8 in Wigan during May. This cemented his qualification for the 2010 UK Open Darts. However he was knocked out in his first match against Tony Eccles.", "* 2007: First round (lost to Tony Eccles 0–3)"]}, {"page": "2008 PDC World Darts Championship", "response": ["The 16 PDPA members were made up from the top eight players (who had not already qualified) in the PDC Pro Tour Events during 2007: Jelle Klaasen, Mark Walsh, Tony Eccles, Michael van Gerwen, Steve Brown, Dave Askew, Jason Clark and Matt Clark.Current Players Championship Order of Merit  Top eight will qualify for World Championship", "#  Tony Eccles", "|align=\"left\"|  Tony Eccles", ":Tony Eccles 1–3 Wayne Jones ", "The talking point of the day may have been the Adrian Lewis v Tony Eccles clash. Eccles started in sensational fashion winning the first eight legs, but couldn't close out the third set. He missed two darts at a double for a 3–0 sets lead and then Lewis started a fightback winning the next three sets to lead 3–2. Eccles fought back himself to level the match, but controversy came in the final set when the scores were level at 2 legs each. Lewis took an unscheduled comfort break just minutes after a scheduled one and when he came back he found his rhythm to win the next two legs and make the quarter finals.", ":Adrian Lewis 4–3 Tony Eccles (0–3, 0–3, 3–2, 3–0, 3–2, 1–3, 4–2)"]}, {"page": "Wayne Jones (darts player)", "response": ["He didn't make it to the Lakeside Country Club for the BDO World Championship until 2001, losing to Andy Fordham in the second round. He made it to the quarter-finals of the 2002 event by beating Tony Eccles and Ted Hankey but lost 1–5 to Martin Adams.", "* 2008: First round (lost to Tony Eccles 0–3)"]}, {"page": "2007 Las Vegas Desert Classic", "response": ["Monday's qualifiers were Wes Newton, Steve Maish, Kevin Painter, Steve Beaton, Colin Osborne, Mervyn King, Ray Carver and Dennis Smith. Tuesday's qualifiers were Alan Tabern, Mark Dudbridge, John Ferrell, Tony Eccles, Stuart Holden, Andy Smith, Steve Smith, Vincent van der Voort."]}, {"page": "2007 International Darts League", "response": [":Tony Eccles 6–3 Andy Hamilton", ":Tony Eccles 6–4 Terry Jenkins", ":Michael van Gerwen 6–5 Tony Eccles", "| 2 || style=\"text-align:left;\"|  Tony Eccles || 2|| 17 || 13", ":James Wade 7–2 Tony Eccles", ":Scott Waites 7–3 Tony Eccles", ":Mark Webster 7–4 Tony Eccles", "| 4 || style=\"text-align:left;\"|  Tony Eccles || 0|| 9 || 21", "#   Tony Eccles"]}, {"page": "Steve Maish", "response": ["Maish qualified for the 2008 PDC World Darts Championship, he defeated former World Champion Dennis Priestley  but lost in the second round to Tony Eccles.", "*2008: 2nd Round (lost to Tony Eccles 3–4)"]}, {"page": "Remco van Eijden", "response": ["In November 2008, van Eijden began playing on the PDC circuit, playing in the two PDPA Players Championships in the Netherlands, reaching the quarter finals in the second event. He then reached the third round of the PDC German Darts Championship. He then played in the 2009 PDC World Darts Championship having been offered and accepted an SBS6 wildcard. The wildcard originally went to Co Stompé, but after winning the German Darts Championship, Stompé qualified as the top Continental player in the PDC Order of Merit and van Eijden was given the spot instead.  By accepting the wildcard, van Eijden also joined the PDC circuit full-time.  He defeated Russian ladies champion Anastasia Dobromyslova in the preliminary round and then faced 30th seed Tony Eccles in the first round. He came from two sets down to level at two apiece before eventually losing three sets to two.", "* 2009: 1st round (lost to Tony Eccles 2–3)"]}, {"page": "Robbie Green", "response": ["Despite winning no titles during 2013, Green had better success in the majors as he reached the semi-final of the Winmau World Masters, eliminating world champion Scott Waites before losing 6-3 to James Wilson. He followed this up with his best showing at the BDO World Championship, maintaining a 90+ tournament average in wins over Richie George (3-0), Gary Robson (4-1), and a 5-2 win over Tony Eccles in which he hit back-to-back checkouts of 125 and 164, to reach the semi-finals at Lakeside for the first time in his career, where he was defeated by top seed Stephen Bunting 1-6. He then won the Isle of Man tournament beating James Wilson in the final 5-1 with an incredible average of 114.65.http://www.bdodarts.com/2484/08-03-2014/Isle_of_Man_Open_2014_Results"]}, {"page": "2008 UK Open", "response": ["*Kevin Painter 6 V 2 Tony Eccles"]}, {"page": "2008 US Open (darts)", "response": ["Five American players made it through to the last 16 as there were a series of shock results on the opening day of the event. The biggest shock was when Gary Mawson beat world number one and five-time former World Champion, Raymond van Barneveld in the last 32. Current World Champion, John Part went out in round two to Roger Carter who also progressed to the last 16. Bill Davis beat Tony Eccles to reach Saturday's main stage competition. David Fatum and Ray Carver completed the American line-up of five in the last 16.", ":Tony Eccles 3–0 Rob Petelin", ":Tony Eccles 3–2 Paul Cooper", ":Tony Eccles 3–2 Barrie Bates", ":Bill Davis 3–2 Tony Eccles"]}, {"page": "2006 International Darts League", "response": [":Tony Eccles 6–3 Michael van Gerwen", ":Tony Eccles 1–6 Colin Lloyd", ":Tony Eccles 6–1 Martin Atkins", "| 3 || align=\"left\"|  Tony Eccles || 2|| 13 || 10"]}, {"page": "Mareno Michels", "response": ["Michels made three quarter final appearances in the BDO Open events in 2005, doing so in the Welsh Open, English Open and the German Open. He followed it up with another quarter final appearance, this time at the World Darts Trophy, one of the WDF majors. He defeated Tony Martin and Simon Whitlock before losing to Mervyn King. He then made the final of the Swedish Open, losing to Tony Eccles."]}, {"page": "2008 World Matchplay", "response": ["#  Tony Eccles (Second round)", "|align=\"left\"|  Tony Eccles"]}, {"page": "2008 World Grand Prix (darts)", "response": ["Phil Taylor won his eighth Grand Prix title with a 6-2 victory over Raymond van Barneveld in the final watched by 355,000 viewers. James Wade was the defending champion, however lost 2-1 to Tony Eccles in the first round.", ":#  Tony Eccles (Second round)"]}, {"page": "Erik Clarys", "response": ["Clarys caused a major upset by winning the 1995 Winmau World Masters. Amongst his victims were future World and Masters champions Andy Fordham and Martin Adams before beating reigning Masters and World champion Richie Burnett in the final. Clarys continued to do well in tournaments, winning the Belgium National Championship four times, the Belgium Gold Cup three times, the Dortmund Open three times as well as the 1999 Swedish Open. Despite this however, he wasn't able to match these performances in other major tournaments. He played in six BDO World Championships, losing in the first round in his first four visits. He finally won a match at the Lakeside in the fifth time of asking in 2002, beating Andree Welge before losing in the second round to Raymond van Barneveld. In 2003, Clarys beat Tony Eccles and Robert Wagner en route to the quarter finals, eventually losing again to Barneveld despite hitting a 170 checkout."]}, {"page": "Darin Young", "response": ["Young has appeared in five successive Las Vegas Desert Classics, reaching the second round in four of them. In 2004, he beat Lionel Sams in the first round before losing to Wayne Mardle. In 2005, he defeated Andy Hamilton in round one, but lost in the second round to Canadian John Part. 2006 saw a first round exit for Young in the Desert Classic, losing to Raymond van Barneveld, who was making his debut in the event. In 2007, Young defeated another Desert Classic debutant Tony Eccles in round one, but lost to Dennis Smith 8–7 in the second round. In the 2008 Desert Classic, Young defeated qualifier Martin Burchell in the first round before losing to Adrian Gray in the second round."]}, {"page": "2009 PDC World Darts Championship", "response": ["|align=\"left\"|  Tony Eccles", ":Tony Eccles 3–2 Remco van Eijden (3–0, 3–2, 2–3, 2–3, 3–1)", "The final game of the afternoon also went to a deciding set though it did not look to be at first as thirtieth seed Tony Eccles shot to a 2–0 in sets lead against Remco van Eijden, the conqueror of Ladies World Champion Anastasia Dobromyslova in the preliminary round. Eccles included a 164 checkout in the first set, which he won 3–0, and though the second set was closer in going to a deciding leg, Eccles came out on top to give himself a strong lead. However, the match was far from over as van Eijden took the third set in a deciding leg with a gutsy 116 checkout, and in the deciding leg of the fourth Eccles missed five darts for the match before van Eijden levelled the match. 'The Viper' Eccles lost the first leg in the deciding set as van Eijden took the lead for the first time, but this provoked him into heavy scoring as he won the next three legs without reply to finally win the match.", "Brendan Dolan gave third seed James Wade a great scare in the first set of their match – he missed six darts for the set before an under-par Wade, who averaged 88, hit an important 106 checkout to take it and break Dolan's spirit. From then on Wade took six of the next seven legs in winning the following two sets and won the match with a thirteen dart finish to set up a match with Tony Eccles, who had famously knocked Wade out in the first round of the 2008 World Grand Prix as 'The Machine' was the defending champion at the time. The next match was another straight-sets victory for a seed – nineteenth seed Vincent van der Voort won the final first round match 3–0 against Hungarian Nándor Bezzeg. The first set went to a deciding leg but van der Voort took it under pressure, and like Wade he dropped only one leg in taking the next two sets – a 106 checkout, five 180s, and a 90 average from 'Greased Lightning' proved enough to dispatch the Eastern European qualifier and end the first round.", ":James Wade 4–2 Tony Eccles (3–0, 1–3, 3–1, 3–1, 0–3, 3–2)"]}, {"page": "2009 Players Championship Finals", "response": ["|align=\"left\"| Tony Eccles"]}, {"page": "Bill Davis (darts player)", "response": ["Davis reached the semi final of the North American Darts Championship on the eve of the 2008 US Open, losing to eventual winner Darin Young. He then reached the last 16 of the US Open, defeating Tony Eccles before losing to surprise package David Fatum who went on to reach the semi finals. He also qualified for the 2008 Desert Classic through the US Order of Merit, losing in the first round to Mark Walsh."]}, {"page": "Brendan Dolan", "response": ["Dolan qualified for the World Championship via the Players Championship Order of Merit and won his first game at the event by defeating Tony Eccles 3–1 in the first round, but lost 4–0 in the second to Raymond van Barneveld, who hit a nine-dart finish in the match. He qualified for the Players Championship Finals for the first time but lost 6–5 to Adrian Lewis in the first round."]}, {"page": "Shane O'Connor (darts player)", "response": ["O'Connor won the 2008 Irish Matchplay which earned him a place in the 2009 PDC World Darts Championship. He later reached the semi finals of the Gleneagle Irish Masters, beating Jacko Barry 4-0 and Tony Eccles 5–0, eventually losing 5-4 to the eventual winner Michael van Gerwen."]}, {"page": "2009 World Matchplay", "response": ["#  Tony Eccles (First round)", "|align=\"left\"|  Tony Eccles"]}, {"page": "2010 PDC World Darts Championship", "response": ["|align=\"left\"|  Tony Eccles"]}, {"page": "2009 UK Open", "response": ["| Tony Eccles", "| Tony Eccles"]}, {"page": "2009 Las Vegas Desert Classic", "response": ["Jelle Klaasen beat Mark Webster, a former BDO world champion, James Barton and Dennis Smith with checkouts of 146 and 149 in the final two legs of his fifth round match to qualify. Fellow Dutchman Vincent van der Voort was the second qualifier, defeating Louis Blundell, Ian Jopling, Ken MacNeil and Tony Eccles. Co Stompé achieved two 5–0 whitewashes before beating Jacko Barry 5–2, Michael van Gerwen 5–4 and whitewashing Nick Fullwell to qualify. Peter Wright, who entered the top 100 in 2009, beat Andy Smith 5–3 to debut in the tournament. Simon Whitlock, who was undefeated on the 2009 DartPlayers Australia circuit, won his first three matches over Chris Edwards, Bernard Prenter and Gary Mawson without losing a leg before beating Mark Dudbridge and Barrie Bates to return to PDC competition. Jamie Caven made 14, 11 and 13-dart finishes in his 5–4 victory over Shane O'Connor, becoming the last player to qualify from the first day's play."]}, {"page": "2009 Championship League Darts", "response": ["1. Phil Taylor  | 2. James Wade | 3. Raymond van Barneveld | 4. John Part | 5. Terry Jenkins | 6. Mervyn King | 7. Ronnie Baxter | 8. Adrian Lewis | 9. Colin Lloyd | 10. Alan Tabern | 11. Dennis Priestley | 12. Colin Osborne | 13. Wayne Mardle | 14. Mark Walsh | 15. Kevin Painter | 16. Andy Hamilton | 17. Robert Thornton | 18. Vincent van der Voort | 19. Denis Ovens | 20. Peter Manley | 21. Mark Dudbridge | 22. Jelle Klaasen | 23. Wayne Jones | 24. Andy Smith | 25. Roland Scholton | 26. Kirk Shepherd | 27. Co Stompé | 28. Tony Eccles | 29. Micheal van Gerwen | 30. Barrie Bates", ":* Tony Eccles", ":* Tony Eccles", "| 5 || align=\"left\"|  Tony Eccles  || 7 || 4 || 3 || −2 || 8", "|align=right| Co Stompé  ||align=center| 4 – 6 ||  Tony Eccles", "|align=right| Tony Eccles  ||align=center| 2 – 6 ||  Terry Jenkins", "|align=right| Tony Eccles  ||align=center| 3 – 6 ||  Jelle Klaasen", "|align=right| Tony Eccles  ||align=center| 6 – 3 ||  Kirk Shepherd", "|align=right| Wayne Jones  ||align=center| 6 – 4 ||  Tony Eccles", "|align=right| Andy Smith  ||align=center| 5 – 6 ||  Tony Eccles", "|align=right| Tony Eccles  ||align=center| 6 – 5 ||  Adrian Lewis", "| 5 || align=\"left\"|  Tony Eccles  || 7 || 4 || 3 || +3 || 8", "|align=right| Tony Eccles  ||align=center| 6 – 4 ||  Roland Scholten", "|align=right| Tony Eccles  ||align=center| 6 – 3 ||  Kirk Shepherd", "|align=right| Adrian Lewis  ||align=center| 6 – 5 ||  Tony Eccles", "|align=right| Michael van Gerwen  ||align=center| 6 – 5 ||  Tony Eccles", "|align=right| Tony Eccles  ||align=center| 6 – 5 ||  Terry Jenkins", "|align=right| Tony Eccles  ||align=center| 1 – 6 ||  Barrie Bates", "|align=right| Wayne Jones  ||align=center| 2 – 6 ||  Tony Eccles"]}]}}