{"wiki_id": "http://www.wikidata.org/entity/Q1900131", "itemLabel": "Mark Hylton", "itemDescription": "British darts player", "wikipedia_url": "https://en.wikipedia.org/wiki/Mark_Hylton_(darts_player)", "wikipedia_page": {"main": "Mark Hylton (born 30 May 1966 from Rugeley) is a former English professional darts player. He played in Professional Darts Corporation events.", "link_mentions": [{"page": "Phil Taylor (darts player)", "response": ["Taylor went on to win the World Matchplay for a record 12th time in 18 years in 2011. He beat Mark Hylton 10–8 in the 1st round, Wayne Jones 13–7 in the 2nd round, Wes Newton 16–5 in the quarter-final, Andy Hamilton 17–9 in the semi-final and James Wade 18–8 in the final. His overall tournament average was more than 106."]}, {"page": "Steve Beaton", "response": ["At the 2010 Grand Slam of Darts, Beaton produced a major upset by beating three-time defending champion Phil Taylor 16–14 in the quarter-finals, having trailed 9–13 and 11–14. Earlier in the week, Beaton had needed to defeat Paul Nicholson 5–3 or better at the round robin stage to stay in the tournament (he won 5–1), and followed that up with a 10–6 win over Ted Hankey who had himself defeated Taylor in his group. Beaton was defeated by eventual champion Scott Waites 16–9 in the semi-final. Despite his good form in 2010 he was narrowly defeated in the first round of the 2011 PDC World Darts Championship by Mark Hylton eventually losing by 3 sets to 2. The following year, Beaton recovered from two sets and three match darts down against Magnus Caris to win 3–2, but was beaten by Simon Whitlock 1–4 in the second round.", "*2011: First round (lost to Mark Hylton 2–3)"]}, {"page": "Vincent van der Voort", "response": ["Van der Voort beat Mark Hylton 3–2 in the first round of the 2012 World Championship in a thrilling match. His second round tie also went to a deciding set against Andy Hamilton, but this time the Dutchman was on the wrong end and exited the tournament by 3 sets to 4."]}, {"page": "Colin Lloyd", "response": ["* 2011: Second round (lost to Mark Hylton 2–4)"]}, {"page": "Gary Anderson (darts player)", "response": ["Anderson qualified for the 2010 Grand Slam of Darts, and went into the tournament as the number six seed. Anderson defeated Mark Hylton, Mark Webster and Wayne Jones in the group stage to finish top of his group. In the second round he defeated Colin Osborne 10–3 to again play Jones in the quarter finals. Anderson led 15–12 before Jones took the last four legs to win the match 16–15."]}, {"page": "Mark Webster (darts player)", "response": ["Due to his 3rd-place finish at the previous World Championship Webster qualified for the 2010 Grand Slam of Darts. Despite losing 5–2 to Wayne Jones in his first game a 5–3 win over Mark Hylton left him with a chance to qualify however even though he beat Gary Anderson 5–3 it was not enough as he missed multiple doubles to win the match with the required scoreline of 5–1 to qualify.", "He continued this good form into the 2011 PDC World Darts Championship in which he knocked out Steve Maish, number 8 seed Ronnie Baxter and Mark Hylton in the early rounds losing only 1 set between them. In the quarter-final he knocked out 15-time and defending world champion Phil Taylor by 5 sets to 2 to reach his second successive World Championship semi-final. He lost 6–4 to Adrian Lewis in the semi-finals, continuing the trend of players beating Taylor but going on to lose their next match when the event is televised. This earned him £50,000 and Moved him into the top 16 of the PDC rankings for the first time at number 13."]}, {"page": "Peter Wright (darts player)", "response": ["Wright won a match at the World Championship for the first time in 2011 by beating Co Stompé 3–1 and then saw off Paul Nicholson to face defending champion Phil Taylor in the third round. Wright lost 4–1 and averaged a very respectable 96.56. He enjoyed a good run at the UK Open which was ended in the last 16 by Mark Hylton and played in his second World Matchplay where Simon Whitlock beat him 10–7 in the first round. Wright's first quarter-final appearance in a major event came at the European Championship with victories over John Part and Gary Anderson, before losing again to Whitlock this time 10–6. His form continued by reaching the final of the 18th Players Championship of the year and a 6–2 loss to Anderson. Wright defeated Denis Ovens 6–4 in the opening round of the Players Championship Finals but lost 8–6 to Wes Newton in the subsequent round."]}, {"page": "2010 Grand Slam of Darts", "response": ["|  Wes Newton John Henderson Mark Hylton Justin Pipe", "|4||style=\"text-align:left;\"| Mark Hylton (Q)", "|align=left|  Mark Hylton 90.52", "|align=right| 87.98 Mark Hylton ", "|align=right| 86.21 Mark Hylton ", "|align=\"left\"|  Mark Hylton"]}, {"page": "2011 PDC World Darts Championship", "response": ["#  Mark Hylton", "|align=\"left\"|  Mark Hylton"]}, {"page": "2010 PDC Pro Tour", "response": ["|  Mark Hylton"]}, {"page": "2011 in darts", "response": ["|align=right| Denis Ovens  ||align=center| 10–6 ||  Mark Hylton", "|align=right|   Mark Hylton  ||align=center| 1–4 ||  Richie Burnett"]}, {"page": "Ian White (darts player)", "response": ["He qualified for his first PDC World Championship in 2012, where he was beaten 1-3 by Robert Thornton in the last 64. He threw a nine-dart finish in the opening Players Championship event of the season in a first round match against Mark Hylton. White reached the semi-finals of the event, where he was beaten 4-6 by the eventual winner Justin Pipe. In April, he earned a place in the European Tour Event 1 in Vienna by defeating Adrian Gray in the UK qualifier. He played Colin Lloyd in the first round and lost 3–6, with his opponent averaging 111. In May, he reached the final of the Players Championship Event 5 where he lost 2–6 to Dave Chisnall. He also qualified for the third European Tour Event with a win over John Scott, but was then beaten by Raymond van Barneveld 2–6 in the first round in Düsseldorf. By July, White had reached two semi-finals and two finals in PDC events in 2012, meaning he qualified for the World Matchplay for the first time in his career due to being the sixth highest player on the ProTour Order of Merit who was not in the world's top 16. He played Vincent van der Voort in the first round and took out 164 and 161 finishes in a 10–5 victory to set up a last 16 fixture with 12-time World Matchplay champion Phil Taylor, which he lost 3–13."]}, {"page": "2011 UK Open", "response": ["|align=right| Brian Woods  ||align=center| 1 – 4 ||  Mark Hylton", "|align=right| Geoff Whitworth  ||align=center| 1 – 4 ||  Mark Hylton", "|align=right| Andy Jenkins  ||align=center| 0 – 9 ||  Mark Hylton", "|align=right| Mark Hylton  ||align=center| 9 – 2 ||  Andrew Gilding", "|align=right| Peter Wright  ||align=center| 7 – 9 ||  Mark Hylton", "|align=right| (99.29) Denis Ovens  ||align=center| 10–6 ||  Mark Hylton (98.88)"]}, {"page": "2011 World Matchplay", "response": ["#  Mark Hylton (First round)", "|align=\"left\"|  Mark Hylton "]}, {"page": "Kim Huybrechts", "response": ["Huybrechts made the final of the first UK Open qualifier, losing out to Wes Newton 3–6 after earlier beating Scott Rand, Simon Whitlock, Vincent van der Voort, Mark Stephenson, Mark Hylton, Michael van Gerwen and Stuart White. Huybrechts earned a place in the European Tour 1 event in Vienna by defeating Tonči Restović and Jerry Hendricks in the European qualifier. He enjoyed 6–3 and 6–0 wins over Andy Smith and Vincent van der Voort respectively, before losing in the third round to James Wade 1–6. Huybrechts threw a nine-darter in a third round match in the seventh UK Open qualifier of the season against Terry Jenkins, but went on to lose 4–6. "]}, {"page": "2011 World Grand Prix (darts)", "response": [":#  Mark Hylton (Quarter-finals)"]}, {"page": "2011 Players Championship Finals (2)", "response": ["|align=\"left\"| Mark Hylton"]}, {"page": "2012 PDC World Darts Championship", "response": ["#  Mark Hylton", "|align=\"left\"|  Mark Hylton"]}, {"page": "December 2011 in sports", "response": ["***Vincent van der Voort  3–2 Mark Hylton "]}, {"page": "LPKD The Hasbury Inn Darts", "response": ["The LPKD The Hasbury Inn was an open darts tournament. The event has been held six times (three in 2010 and three in 2011). Mark Hylton is the last champion."]}, {"page": "PDC Awards Dinner", "response": ["| Mark Hylton", "Mark Hylton"]}, {"page": "2012 UK Open", "response": ["| Mark Hylton", "| Mark Hylton", "| Mark Hylton"]}, {"page": "John Scott (darts player)", "response": ["Scott made his major debut at the 2012 UK Open at the Reebok Stadium in Bolton. He lost out 4–2 to Brian Woods in the preliminary round. He qualified via the UK Open Order of Merit in tied 96th place with a total of £600 - winning £200 in three of the eight qualifying events. Scott also qualified for the Austrian Darts Open by defeating Mark Hylton in the qualifying event. He lost 6–5 in the first round of the main event to Denis Ovens."]}, {"page": "2012 German Darts Masters", "response": ["Gary Anderson was banned from playing in this tournament, along with the Dutch Darts Masters and the European Championship. Also, Jelle Klaasen, Phil Taylor and Mark Hylton did not compete, with their opponents (Steve Beaton, Andy Jenkins and Jerry Hendriks respectively) receiving byes to the second round."]}, {"page": "Mark Hylton", "response": ["Mark Hylton may refer to:", "* Mark Hylton (sprinter) (born 1976), former British 400 metres sprinter", "* Mark Hylton (darts player) (born 1966), English darts player"]}, {"page": "Andrew Gilding", "response": ["Gilding made his television debut at the 2011 UK Open at the Reebok Stadium in Bolton as a pub qualifier. He defeated Brendan Dolan, Matt Clark, Andy Hamilton before losing 9–2 to Mark Hylton in the last 32 earning himself £2,000 in the process.", "Gilding's best result of 2012 was getting to the quarter-finals at the UK Open Qualifier 7 at the NIA Community Hall, Birmingham defeating Joe Cullen, Scott Rand, Mark Hylton and Simon Whitlock before losing 6–3 to Kevin Painter. He headed into 2013 ranked world number 73. Gilding failed to qualify for the 2013 UK Open as he finished 142nd on the Order of Merit, outside of the top 96 who claimed their places. In October, he reached his first semi-final in a PDC ranking event at the tenth Players Championship of the year. Gilding saw off the likes of Dave Chisnall and 2008 BDO World Championship winner Mark Webster before losing 6–2 to five-time world champion Raymond van Barneveld. However, at the end of the year his tour card status expired and Gilding was ranked 78th in the world, outside the top 64 who remain on the tour. He entered Q School in an attempt to regain his place and was successful on the first day by beating Jamie Bain 5–0 in his last match."]}]}}