{"wiki_id": "http://www.wikidata.org/entity/Q1905056", "itemLabel": "Martin Shaw", "itemDescription": "British composer, theatre producer and conductor", "wikipedia_url": "https://en.wikipedia.org/wiki/Martin_Shaw_(composer)", "wikipedia_page": {"main": "Martin Edward Fallas Shaw  (1875–1958) was an English composer, conductor, and (in his early life) theatre producer. His over 300 published works include songs, hymns, carols, oratorios, several instrumental works, a congregational mass setting (the Anglican Folk Mass), and four operas including a ballad opera.\n\n", "link_mentions": [{"page": "Pierrot", "response": ["It was neither the Aesthetic nor the popular Pierrot that claimed the attention of the great theater innovator Edward Gordon Craig.  The appeal of the mask seems to have been the same that drew Craig to the \"Über-Marionette\": the sense that Pierrot was a symbolic embodiment of an aspect of the spiritual life—Craig invokes William Blake—and in no way a vehicle of \"blunt\" materialistic Realism.Craig, p. 89.  Craig's involvement with the figure was incremental.  In 1897, Craig, dressed as Pierrot, gave a quasi-impromptu stage-reading of Hans Christian Andersen’s story \"What the Moon Saw\" as part of a benefit for a destitute and stranded troupe of provincial players.Martin Shaw, How We Met—Edward Gordon Craig and Martin Shaw.  Two years later, in his journal The Page, he published (under the pseudonym \"S.M. Fox\"). a short story, \"The Last of the Pierrots\", which is a shaming attack upon the modern commercialization of Carnival. However, his most important contribution to the Pierrot canon was not to appear until after the turn of the century (see Plays, playlets, pantomimes, and revues below)."]}, {"page": "Southwold", "response": ["*Martin Shaw OBE FRCM (1875–1958), theatre producer, composer and conductor"]}, {"page": "Sarojini Naidu", "response": ["*1917: \"The Song of the Palanquin Bearers,\" lyrics by Naidu and music by Martin Shaw, London: Curwen"]}, {"page": "1958 in music", "response": ["* October 24 – Martin Shaw, composer, 83"]}, {"page": "Carol (music)", "response": ["*The Oxford Book of Carols ed. Percy Dearmer, Martin Shaw and Ralph Vaughan Williams (1928)"]}, {"page": "Edward Gordon Craig", "response": ["Craig's first productions, Purcell's Dido and Aeneas, Handel's Acis and Galatea (both inspired and conducted by his lifelong friend Martin Shaw, who founded the Purcell Operatic Society with him to produce them), and Ibsen's The Vikings at Helgeland, were produced in London. The production of Dido and Aeneas was a considerable success and highly influential in reviving interest in the music of Purcell, then so little known that three copies of The Times review were delivered to the theatre: one addressed to Mr Shaw, one to Mr Craig, and one to Mr Purcell. Craig concentrated on keeping his designs simple, so as to set-off the movements of the actors and of light, and introduced the idea of a \"unified stage picture\" that covered all the elements of design."]}, {"page": "Struwwelpeter", "response": ["Geoffrey Shaw's Struwelpeter, produced in 1914, featured the song \"Conrad Suck-a-Thumb\" by Martin Shaw."]}, {"page": "Good King Wenceslas", "response": ["A similar sentiment is expressed by the editors (Percy Dearmer, Martin Shaw and Ralph Vaughan Williams) in the 1928 Oxford Book of Carols, which is even more critical of Neale's carol."]}, {"page": "St Martin-in-the-Fields", "response": ["*Martin Shaw 1920–1924"]}, {"page": "Sebastian Shaw (actor)", "response": ["Shaw was one of three children born to Dr. Geoffrey Shaw, the music master at Gresham's School, a Norfolk independent boarding school, where Shaw began his education.Leech, Richard. \"Better Than Beefcake: Sebastian Shaw\", The Guardian, 29 December 1994, Features (section), p. T12. His uncle, Martin Shaw, was a composer of church music, and his family's love of music heavily influenced Shaw's career path.\"Sebastian Shaw\", The Times, 30 December 1994, Features (section)."]}, {"page": "Christopher Fry", "response": ["* Thursday's Child (1939), music by Martin Shaw"]}, {"page": "Anglican church music", "response": [": Sung Eucharist is a musical setting of the service of Holy Communion. Naming conventions may vary according to the churchmanship of the place of worship; in churches that tend towards a low church or broad church style of worship, the terms Eucharist or Communion are common, while in high church worship, the more Catholic term Mass may be used. Musical pieces corresponding to the liturgical pattern of the Ordinary of the Mass (Kyrie, Gloria, Credo, Sanctus & Benedictus, Agnus Dei) may be sung by the choir or congregation. Many English-language settings of the communion service have been written, such as those by Herbert Howells and Harold Darke; simpler settings suitable for  congregational singing are also used, such as the services by John Merbecke or Martin Shaw. In high church worship, Latin Mass settings are often preferred, such as those by William Byrd."]}, {"page": "List of Anglican church composers", "response": ["*Martin Shaw"]}, {"page": "I Saw Three Ships", "response": ["An arrangement by Martin Shaw appears in the Oxford Book of Carols.The Oxford Book of Carols (1928) p.36. The Carols for Choirs series of carol books features arrangements of the carol by both Sir David Willcocks and John Rutter. Organist Simon Preston and former conductor of the Choir of King's College, Cambridge, Sir Philip Ledger, have also written arrangements that the choir have performed at the Festival of Nine Lessons and Carols in recent years. There is also a more recent choral arrangement by British composer Richard Fox.  This carol is also featured in the musical Caroline, or Change, but as a counterpoint. Adapted by Jon Schmidt on Jon Schmidt Christmas album. John Renbourn has arranged it (in a rather free adaptation) for guitar. The song appears on Nat King Cole's 1960 album The Magic of Christmas (l/k/a \"The Christmas Song\"), arranged by Ralph Carmichael."]}, {"page": "Blythburgh", "response": ["*Dr Martin Shaw - hymn music"]}, {"page": "The New Oxford Book of Carols", "response": ["The original Oxford Book of Carols was first published in 1928 by OUP. It was edited by Percy Dearmer,  Martin Shaw, and the noted composer and scholar of English folk-song  Ralph Vaughan Williams. The book was highly influential as it introduced British choirs and church congregations (who were more accustomed to Victorian hymn tunes) to a form of Christmas music rooted in traditional folk music."]}, {"page": "Royal Hospital School", "response": ["*\"Go Forth With God\" by Martin Shaw to the tune of Toc H."]}, {"page": "Percy Dearmer", "response": ["Percival Dearmer (1867–1936), known as Percy Dearmer, was an English priest and liturgist best known as the author of The Parson's Handbook, a liturgical manual for Anglican clergy, and as editor of The English Hymnal. A lifelong socialist, he was an early advocate of the public ministry of women (but not their ordination to the priesthood) and concerned with social justice. Dearmer, with Ralph Vaughan Williams and Martin Shaw, is credited with the revival and spread of traditional and medieval English musical forms. His ideas on patterns of worship have been linked to the Arts and Crafts Movement, while Dearmer and Vaughan Williams' English Hymnal reflects the influence both of artistic and folkloric scholarship and  Christian Socialism. Dearmer ended his life as Canon of Westminster Abbey, from where he ran a canteen for the unemployed.", "Working with the renowned composer Ralph Vaughan Williams as musical editor, Dearmer published The English Hymnal in 1906. He again worked with Vaughan Williams and Martin Shaw to produce Songs of Praise (1925) and the Oxford Book of Carols (1928). These hymnals have been credited with reintroducing many elements of traditional and medieval English music into the Church of England, as well as carrying that influence well beyond the church, and from a political point of view bearing the imprint of Christian Socialism.", "* The English Carol Book  (with Martin Shaw). 1913.", "* The English Carol Book (with Martin Shaw), 2nd ed. 1919.", "* Songs of Praise (with Martin Shaw and Ralph Vaughan Williams). Oxford University Press, 1925.", "* The Oxford Book of Carols (with Martin Shaw and Ralph Vaughan Williams). Oxford University Press, 1928.", "* Songs of Praise Enlarged Edition  (with Martin Shaw and Ralph Vaughan Williams) Oxford University Press, 1931."]}, {"page": "Carols for Choirs", "response": [" ||  Martin Shaw (arr.)", " ||  Martin Shaw (arr.)"]}, {"page": "List of organ composers", "response": ["* Martin Shaw "]}, {"page": "Full Fathom Five", "response": ["** Composition by Martin Shaw (composer)"]}, {"page": "All Things Bright and Beautiful", "response": ["It is also frequently sung to the tune , a melody that was adapted from a 17th-century folk tune, \"The Twenty-Ninth of May\", published in The Dancing Master in 1686. The melody may have political origins in the English Civil War, and its name  is thought to be a reference to the Royal Oak, a tree at Boscobel, Shropshire in which King Charles II hid himself in 1651. This tune was first arranged for the hymn by Martin Shaw in 1916, published in his book for children, Song Time. This arrangement became widely associated with the hymn after it was included in Songs of Praise (hymnal). "]}, {"page": "Mont Campbell", "response": ["Born to Mary Elizabeth Shaw (\"Jackie\") and Lieutenant Colonel H.A.L. Montgomery Campbell of the Royal Tank Regiment (\"Archie\"), in Ismaïlia, Egypt, Campbell was named Martin after his grandfather, the composer Martin Shaw. The family moved to Kenya in 1951, where they lived until their return to the UK in 1962, their son having preceded them by a year."]}, {"page": "Hymns of The Church of Jesus Christ of Latter-day Saints (1985 book)", "response": ["| 143 ||  Let the Holy Spirit Guide || Penelope Moody Allen || Martin Shaw || "]}, {"page": "One Tree Hill College", "response": ["The college has its own prayer, implemented during John Rose's principalship. One Tree Hill also has its own hymn, Martin Shaw's 'Go Forth With God', which came into use during Ron Stacey's foundation principalship."]}, {"page": "The Oxford Book of Carols", "response": ["The Oxford Book of Carols is a collection of vocal scores of Christmas carols and carols of other seasons. It was first published in 1928 by Oxford University Press and was edited by Percy Dearmer,  Martin Shaw and Ralph Vaughan Williams. It became a widely used source of carols among choirs and church congregations in Britain."]}, {"page": "I syng of a mayden", "response": ["Since the rediscovery of the text, many composers have set the text to music, amongst them diverse choral or vocal interpretations by Martin Shaw,William Emmett Studwell, The Christmas Carol Reader (New York: Haworth Press, 1995) , 43 Patrick Hadley,David Willcocks, Kings College Choir, Cambridge, Argo RG 240 (Mono) ZRG 5240 (stereo) Roger Quilter,Roger Quilter, An old carol, for voice & piano, Op.25, No.3 John Gerrish, Gustav Holst,Gustav Holst, \"I sing of a maiden\", Four Songs for Voice and Violin op. 35 no. 3 (1916-7) Arnold BaxLewis Foreman, Bax: a composer and his times, (Woodbridge: Boydell Press, 2007) , 217. Peter Warlock,As Dew in Aprylle, The Choral Music Of Peter Warlock - Volume 4 (Peter Warlock Society, Thames Publishing) R.R. Terry,Richard R. Terry, \" I Sing of a Mayden\" in Twelve Christmas Carols. (London: J. Curwen & Sons, 1912) 18. Lennox Berkeley, Benjamin Britten (\"As Dewe in Aprille\" in his Ceremony of Carols),Benjamin Britten, A Ceremony of Carols Op. 28 (1942) Ronald Corp (1975), Philip Lawson a setting published by Walton Music, John Adams (as the chorus \"I Sing of a Maiden\" in his opera-oratorio El Niño), and Bob Chilcott (in his \"Salisbury Vespers\"). The work is also regularly performed by the Mediaeval Baebes. The setting composed by Miklós Rózsa is also included in the 1953 Knights of the Round Table film score."]}]}}