{"wiki_id": "http://www.wikidata.org/entity/Q1904834", "itemLabel": "Martin Robertson", "itemDescription": "British classical archaeologist", "wikipedia_url": "https://en.wikipedia.org/wiki/Martin_Robertson", "wikipedia_page": {"main": "Charles Martin Robertson (11 September 1911 – 26 December 2004) was a British classical scholar and poet. He specialised in the art and archaeology of Ancient Greece.", "link_mentions": [{"page": "Thomas Dolby", "response": ["Dolby was born Thomas Morgan Robertson in London, England, to (Theodosia) Cecil, née Spring Rice (1921–1984) and Martin Robertson (1911–2004), an internationally distinguished professor of classical Greek art and archaeology at the University of London, Oxford University, and Trinity College, Cambridge. In at least one interview in the 1980s, Dolby claimed, \"I was born in Cairo, because my father is an archaeologist\" — many subsequent articles have republished or reprinted this spurious claim."]}, {"page": "Parthenon Frieze", "response": ["The following ranks W21–1 along with N75–136 and S1–61 are all of horsemen and constitute 46% of the whole frieze. They are divided into two lines of ten ranks – the same number as that of the Attic tribes.The Athenian cavalry was organised by tribe of phylai and commanded by ten officers known as phlyarchs All figures are beardless youths with the exception of two, W8 and W15, who along with S2–7 wear Thracian dress of fur cap, a patterned cloak, and high boots; these have been identified by Martin Robertson as hipparchs.Robertson, Frantz, 1975, p.46 Next are the four-horse chariots, each with charioteer and armed passenger, there are ten on the south frieze and eleven on the north. Since these passengers are sometimes depicted as dismounting they may be taken to represent the apobatai, participants in the ceremonial race found in Attica and Boeotia.Kyle, 1993, see Neils, 2001, p.138", "Interpretations of the figures varies. The twelve seated deities are taken to be the Olympians, they are one third taller than any other figure on the frieze and are arranged in two groups of six on diphroi (backless) stools, common forms of ancient furniture, with the exception of Zeus who is enthroned. Their backs are turned to what must be the culminating event of the procession E31–35; five figures (three children and two adults, and although badly corroded, the two children on the left appear to be girls bearing objects on their heads,Either baskets, Wesenberg, 1995, or stools, Boardman, 1999, pp.305–330 while a third, perhaps a boy,Brommer,1977, pp.269–70 may identify the existence of a temple boy of Athena in Athens, see also Harrison, The Web of History: A conservative reading of the Parthenon Frieze in Neils, 1996, p.204 assisting an adult who may be the archon basileus, in folding a piece of cloth. This frieze often is interpreted as the presentation of Athena’s peplos, perhaps by the arrhephoroi, but debate exists regarding who the figures represent more than what ritual is represented.While it is largely uncontroversial (pace Connelly) that this scene is the presentation of the peplos, since that was the purpose of the Panathenaic procession, the identification of these figures is not. It may be that the two girls, E 31-2, are the diphrophoroi, metic girls who carried the stools for the kanephoroi, but Neils, 2001, p.168 dismisses this argument since they evidently play a central role in the cult of Athena here. She also notes that the arrephoroi were involved in the weaving of the peplos, specifically warping the looms for it during the festival of Chalkeia nine months earlier. The figure E35 was identified as a girl by Stuart and Revett, an ascription repudiated by Adolf Michaelis in 1871. That this figure was a boy was the orthodox interpretation until Martin Robertson pointed out the presence of venus rings on her neck, Robertson, Frantz, 1975. See also Neils, 2001, p.169."]}, {"page": "Seated Hermes", "response": ["Martin Robertson (1975, vol I:474) classifies it as a Roman copy, made before AD 79, needless to say, of a Greek bronze original of the late fourth or early third century BC, in the tradition of Lysippos, whose name has been invoked in connection with the sculpture since its first reappearance. Margarete Bieber classifies it as \"school of Lysippos\" and dates it ca 100 BC.Bieber 1961:162 Many bronze statues posed on actual rocks must have been set up in late Hellenistic and Roman gardens, where, Brunilde Sismondo Ridgway suggests,Ridgway, \"The Setting of Greek Sculpture\" Hesperia 40.3 (July - September 1971:336-356) pp 346f. natural boulders \"increased the idyllic aspect of the composition.\" The Hermes rests his hand casually on the (restored) rock, integrating the composition."]}, {"page": "Charles Robertson", "response": ["*Charles Martin Robertson (1911–2004), British classical scholar and poet"]}, {"page": "Medusa Rondanini", "response": ["The Medusa Rondanini may be a Roman copy of a classical work of the fifth century BC,Adolph Furtwängler, Meisterwerke der griechischen Plastik, 1893 dated the model in the mid-fifth century; he had previously dated it in the fourth century, in Roscher, Ausführliches Lexikon der griechischen und römischen Mythologie, I (Leipzig/Berlin, 1886-90:1724), s.v. \"Gorgones\" and \"Gorgo\", as Janer Danforth Belson pointed out (Belson, \"The Medusa Rondanini: A New Look\" American Journal of Archaeology 84.3 (July 1980:373-378) p. 374. a model attributed to one or another Athenian sculptor of the age of Phidias.  Alternatively, it may have been modeled after a classicising Hellenistic work of the late fourth century BC. If it is of the fifth century,  Janer Danforth Belson has pointed out,Belson 1980:373-378. it is the first of the \"beautiful gorgoneion\" type to appear in Greek art by more than a century,Evelyn B. Harrison, in American Journal of Archaeology 81 (1977:162-75) p. 163. and unparalleled in any contemporaneous representation of the Medusa head. Martin Robertson, following Furtwängler's attribution to Phidias, remarked that it would be unlikely for the beautiful face of the Medusa to be juxtaposed with the beautiful face of the goddess, whose gorgoneion retained its fearful archaic appearance.Robertson, A History of Greek art (Cambridge University Press) 1975:314. "]}, {"page": "Jocelyn Toynbee", "response": ["Toynbee was elected a Fellow of the Society of Antiquaries (FSA) in 1943. She was awarded the medal of the Royal Numismatic Society in 1948. In 1952, she was elected a Fellow of the British Academy (FBA). In 1956 she was awarded the Huntington Medal of the American Numismatic Society. She was elected a Foreign Honorary Member of the American Academy of Arts and Sciences in 1973.  In 1977, an edited volume of 20 papers was published in honour of Toynbee, in which Martin Robertson states that “No one has done more than she – no one perhaps so much – to establish and make clear the profound unity of the Greco-Roman artistic tradition”. A further collected volume of papers in memory of Toynbee was published in 1988."]}, {"page": "Robertson (surname)", "response": ["*Charles Martin Robertson (1911–2004), British classical scholar and poet"]}, {"page": "Donald Struan Robertson", "response": ["Robertson and his first wife, Petica Coursolles, née Jones (1883–1941), were parents to Charles Martin Robertson, an eminent scholar of Greek vase painting, and Giles Henry Robertson, Professor of Fine Art at the University of Edinburgh."]}, {"page": "Charles Martin Robertson", "response": ["#REDIRECT Martin Robertson"]}, {"page": "Charlie Siem", "response": ["* Charlie Siem – Tony Banks: six pieces for orchestra - The City of Prague Philharmonic Orchestra - Martin Robertson - Paul Englishby - Naxos"]}, {"page": "Frode Berg", "response": ["Frode Berg (born 24 October 1971) is a Norwegian bassist, known from the scenes of classical and contemporary music, jazz, pop and rock. As jazz musician known primarily from his performances within Helge Lien Trio with Knut Aalefjær as the third party. On the scenes of classical and contemporary music primarily known as an orchestral bassist in the Oslo Philharmonic Orchestra (from 2010) and the Tampere Philharmonic Orchestra (2011). In addition he is known from playing with such as John Parricelli, Peter Erskine and Martin Robertson."]}, {"page": "Spurius Tadius", "response": ["* Martin Robertson, History of Greek Art (1975), p. 611"]}, {"page": "Yates Professor of Classical Art and Archaeology", "response": ["* Martin Robertson (1948-1961)"]}, {"page": "The Exaltation of the Flower", "response": ["A precise description and interpretation of the work has remained elusive since its initial discovery in the 19th century. Scholars agree on some aspects and disagree on others.Louvre Ma 701 (Sculpture). Perseus Project. Tufts University. . British Greek art scholar Martin Robertson notes that both women can be seen wearing the tubular peplos garment common to the Classical period. According to the descriptive text found in the Atlas database of the exhibited works of art at the Louvre, the women also are wearing a kekryphalos, a hairnet in the Greco-Roman hairstyle, and appear to hold a type of flower, perhaps poppy or pomegranate. One of the women in the stele carries what resembles a bag, presumed to be carrying seeds in the interpretation.Fragment de stèle dit \"L'Exaltation de la fleur\". Atlas: the database of the exhibited works of art (in French). Musée du Louvre. Retrieved March 25, 2015. ."]}, {"page": "Kenyon Medal", "response": ["*1987 – Martin Robertson"]}, {"page": "Lincoln Professor of Classical Archaeology and Art", "response": ["* Martin Robertson (1961 to 1978)"]}, {"page": "Giles Henry Robertson", "response": ["He was born in Cambridge in 1913 the son of Prof Donald Struan Robertson, professor of Greek at Cambridge University. His elder brother was Martin Robertson. Giles was educated at the Leys School in Cambridge then read classics at Oxford University."]}, {"page": "Skira (publisher)", "response": ["The Great Centuries of Painting: 14 volumes (1950-1959) This collection provides a historical overview of painting in Europe and western civilization, systematically surveying prehistoric cave painting at Lascaux, ancient Egypt, Greece, Rome, Byzantine, Medieval Europe, The Renaissance, to the end of nineteenth century. The authors include archeologists and art historians: Giulio Carlo Argan, Georges Bataille, André Grabar, Jacques Lassaigne, Amedeo Maiuri, Carl Nordenfalk, Massimo Pallottino, Maurice Raynal, Martin Robertson, and Lionello Venturi. Most volumes were originally written in French or Italian and translated into other languages. Nine of the 14 volumes were translated into English by literary scholar and translator Stuart Gilbert and the Lascaux volume by Austryn Wainhouse. The books have dark forest green, buckram covers with embossed gold gilt-lettering on the front and spines, and are in a quarto (4to) format, near square in dimensions (11.25 x 10 in./28.4 x 25.2 cm.). Many volumes have foldout pages supporting large or comparative sets of color plates. Second editions of some volumes were published in 1972, and paperback editions were published by Skira/Rizzoli later years.Cahill, James. Chinese Painting. (1960), Editions d'Art Albert Skira, Geneva, 213 pp.", "* Greek Painting. Martin Robertson (1959), 99 color plates, 195 pp."]}, {"page": "Your Rockaby", "response": ["The concerto was a BBC commission, composed between November 1992 and November 1993, with a hiatus between February and September 1993. The work was completed in Arsenal. It was first performed on February 23, 1994, at the Royal Festival Hall in London, by Martin Robertson at the soprano saxophone and the BBC Symphony Orchestra conducted by Andrew Davis. The soloist saxophone part was specifically written for Robertson, who first became associated with Turnage in 1986 when he played Turnage's Sarabande for soprano saxophone and piano in his solo debut at the Purcell Room in London. It was published by Schott in 1995.", "Turnage himself described the concerto as \"a journey through the flamboyant landscape of gaudy jazz figures, with the sax desperately clutching its melodic sanity\". It is set in a single, 24-minute movement, even though there are some recognizable sections in it, e. g., an accompanied cadenza and a passacaglia entitled Lullaby for Charlie close to the end of the piece (Charlie is Martin Robertson's son). The lullaby is an instrumental setting of the first lines of the one-woman original play by Beckett."]}, {"page": "Robertson, Martin", "response": ["#redirectMartin Robertson"]}]}}