{"wiki_id": "http://www.wikidata.org/entity/Q1900242", "itemLabel": "Mark Maley", "itemDescription": "English footballer (born 1981)", "wikipedia_url": "https://en.wikipedia.org/wiki/Mark_Maley", "wikipedia_page": {"main": "Mark Maley (born 26 January 1981) is an English former footballer who played as a defender.\nMaley started his career with Sunderland and progressed through the youth system at the club. He was loaned out to lower-league sides Blackpool, Northampton Town and York City, making a number of appearances in the Football League. His career was brought to an end after accidentally being shot in the eye by Sunderland teammate John Oster with an air gun in 2002. After leaving football, Maley earned a degree in corrosion engineering and established a firm specialising in inspecting offshore oil rigs using drones.", "link_mentions": [{"page": "Wallsend Boys Club", "response": ["*Mark Maley"]}, {"page": "John Oster", "response": ["Oster moved to Sunderland for a fee in excess of £1 million, but again failed to find regular form. His low point at the club was when he was involved in an incident that ended the career of reserve player Mark Maley by accidentally shooting him in the eye with an air rifle. While at Sunderland, during the 2002–2003 season, he spent five months back on loan with his former club Grimsby Town. He enjoyed two fruitful and productive spells with the club during that season, but despite this his goals and performances could not save The Mariners from relegation, as the club struggled to stop a slide down the Football League ladder. Oster was released by Sunderland in January 2005, shortly after returning to the Black Cats in disgrace from a loan at Leeds United, where he scored once against Millwall. There was little doubt that Grimsby would have liked Oster back but could not afford him and their financial position and reduced league status made it an unattractive option for the player.", "In April 2002 whilst at Sunderland, Oster accidentally shot reserve team player Mark Maley with an air-gun. Neither of the pair believed the gun was loaded and Maley had to undergo an eye operation. Whilst on loan at Leeds United in December 2004 Oster and Jamie McMaster were suspended by the club for misbehaving at the club's Christmas party. The incident spelled the end of his Leeds career and his loan was terminated. In 2005 his Sunderland contract was terminated after he was arrested for assault outside a Durham nightclub."]}, {"page": "Maley", "response": ["* Mark Maley (born 1981), English footballer"]}, {"page": "2001–02 Sunderland A.F.C. season", "response": ["|  Mark Maley || York City || 21 April 2002"]}, {"page": "2000–01 Northampton Town F.C. season", "response": ["| 2 || RB || style=\"text-align:left;\" |  Mark Maley"]}, {"page": "Maley, Mark", "response": ["#redirectMark Maley"]}]}}