{"wiki_id": "http://www.wikidata.org/entity/Q1903321", "itemLabel": "Martin Albrow", "itemDescription": "sociologist", "wikipedia_url": "https://en.wikipedia.org/wiki/Martin_Albrow", "wikipedia_page": {"main": "Martin Albrow (born 1937) is a British sociologist, noted for his works on globalization, the theory of the global age and global civil society. He was appointed in 1963 as the first full-time sociologist at Reading University, and subsequently worked at University College Cardiff, where he was Head of Department, and at Roehampton University. He has also held visiting or guest positions at Ludwig Maximilian University of Munich, the London School of Economics, the State University of New York at Stony Brook, the Beijing Foreign Studies University, and the University of Bonn.Albrow was President of the British Sociological Association from 1985 to 1987, and the editor-in-chief of its journal Sociology from 1981 to 1984. Additionally, he was the founding editor of the International Sociological Association's journal, International Sociology. He wrote The Global Age: State and Society beyond Modernity, awarded the 1997 European Amalfi Prize, which argued against the view that globalization was an inevitable one-way process, and that a new age had supplanted both the modern and postmodern ages. He is a Fellow of the Academy of Social Sciences.\nAlbrow lives in London with his wife, Sue Owen.\nHis books include: Bureaucracy, London, Pall Mall, 1970; Max Weber's Construction of Social Theory, London, Macmillan, 1990; The Global Age: State and Society beyond Modernity, Cambridge, Polity 1996; Do Organizations Have Feelings?, London and New York, Routledge, 1997; Sociology: The Basics, London and New York, Routledge, 1999; and Global Age Essays on Social and Cultural Change, Frankfurt am Main, Klosterman, 2014. The English-language edition of his book China's Role in a Shared Human Future was published in 2018.The book was launched at the London Book Fair.", "link_mentions": [{"page": "Globalization", "response": ["Sociologists Martin Albrow and Elizabeth King define globalization as \"all those processes by which the people of the world are incorporated into a single world society.\" In The Consequences of Modernity, Anthony Giddens writes: \"Globalization can thus be defined as the intensification of worldwide social relations which link distant localities in such a way that local happenings are shaped by events occurring many miles away and vice versa.\" In 1992, Roland Robertson, professor of sociology at the University of Aberdeen and an early writer in the field, described globalization as \"the compression of the world and the intensification of the consciousness of the world as a whole.\""]}, {"page": "List of sociologists", "response": ["* Martin Albrow, British sociologist"]}, {"page": "Kevin Bales", "response": ["Martin Albrow's globalization theory and Darren O'Byrne's theories on human rights have influenced Bales' research, as has the empirical training he received from Jack Gibbs and Larry DeBord. Some commentators believe his views on modern slavery were anticipated by contributors to the 1970s mode of production debate, and that his work on debt bondage in India and Pakistan was anticipated by the Marxist Tom Brass."]}, {"page": "European Amalfi Prize for Sociology and Social Sciences", "response": [":Martin Albrow for The Global Age (on behalf of the Section for New Perspectives in the Social Sciences)"]}, {"page": "British Sociological Association", "response": ["*Martin Albrow, 1985–1987"]}, {"page": "Sue Owen", "response": ["Owen married Martin Albrow in 1987.Who's Who"]}, {"page": "International Futures Forum", "response": ["*Martin Albrow  − \tFormerly Professor of Sociology, State University of New York, Stony Brook, author"]}, {"page": "Sociology (journal)", "response": ["*Martin Albrow 1981–1984"]}, {"page": "Albrow", "response": ["#REDIRECT Martin Albrow"]}, {"page": "Albrow, Martin", "response": ["#redirectMartin Albrow"]}]}}