{"wiki_id": "http://www.wikidata.org/entity/Q1903560", "itemLabel": "Martin Childs", "itemDescription": "British film designer", "wikipedia_url": "https://en.wikipedia.org/wiki/Martin_Childs", "wikipedia_page": {"main": "Martin David William Childs MBE  (born 1 July 1954), is a British production designer. He won the 1998 Academy Award for Best Art Direction-Set Decoration (jointly with Jill Quertier) for Shakespeare in Love, and was nominated at the 74th Academy Awards for his work on the film Quills. He has also been nominated three times for the Art Directors Guild Award for Excellence in Production Design, and three times for a BAFTA Award for Best Production Design.\nIn the New Year Honours 2002, Childs was appointed as a Member of the Most Excellent Order of the British Empire for his services to the film industry as a production designer.", "link_mentions": [{"page": "Academy Award for Best Production Design", "response": ["| Martin Childs", "| Martin Childs"]}, {"page": "Shakespeare in Love", "response": ["| Martin Childs and Jill Quertier", "| Martin Childs", "| Martin Childs", "| Martin Childs"]}, {"page": "73rd Academy Awards", "response": ["** Quills – Art Direction: Martin Childs; Set Decoration: Jill Quertier"]}, {"page": "71st Academy Awards", "response": ["* Shakespeare in Love – Art Direction: Martin Childs; Set Decoration: Jill Quertier"]}, {"page": "Les Jolies Eaux", "response": ["Les Jolies Eaux has been referenced in a number of television shows including in the third series of the Netflix's The Crown. The set production designer, Martin Childs, consulted the archives of Oliver Messel to accurately represent the interior design of Princess Margaret's estate and sought a similar structure for exterior shots eventually settling on a villa in southern Spain. Les Jolies Eaux was also featured in the second episode of the BBC documentary series, Princess Margaret: The Rebel Royal."]}, {"page": "54th British Academy Film Awards", "response": ["* Quills – Martin Childs"]}, {"page": "52nd British Academy Film Awards", "response": ["* Shakespeare in Love – Martin Childs"]}, {"page": "51st British Academy Film Awards", "response": ["* Mrs Brown – Martin Childs"]}]}}