{"wiki_id": "http://www.wikidata.org/entity/Q1911805", "itemLabel": "Tristan Fry", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Tristan_Fry", "wikipedia_page": {"main": "Tristan Frederick Allan Fry (born 25 October 1946, London) is a British drummer and percussionist.", "link_mentions": [{"page": "A Day in the Life", "response": ["* Tristan Fry – timpani"]}, {"page": "List of drummers", "response": ["* Tristan Fry (Sky)"]}, {"page": "Sky (English/Australian band)", "response": ["Sky was an English/Australian instrumental rock group that specialised in combining a variety of musical styles, most prominently rock, classical and jazz. The group's original and best-known line-up featured classical guitarist John Williams (Australian), bass player Herbie Flowers, electric guitarist Kevin Peek (Australian), drummer Tristan Fry and keyboard player Francis Monkman.", "In 1971, John Williams released the fusion album Changes, his first recording of non-classical music and the first on which he played electric guitar. Among the musicians working on the album were Tristan Fry (an established session drummer who was also the timpanist for the Royal Philharmonic Orchestra and the Academy of St. Martin in the Fields, and had played Timpani on the Beatles' \"A Day in the Life\") and Herbie Flowers (a former member of Blue Mink and T. Rex, as well as a busy session musician who, among other things, had recorded the bassline for Lou Reed's \"Walk on the Wild Side\").", "Having opted not to recruit a permanent replacement for Williams, Sky remained as a quartet and opted to tour with a succession of guest musicians. Both of the band's 1984 tours, Australia in February and the UK in early summer, featured session guitarist Lee Fothergill (an accomplished all-round musician who had first met Tristan Fry as part of the house band for 'The Val Doonican Show') and woodwind player Ron Aspery (Steve Gray's former mentor in both Back Door and the Middlesbrough Municipal Junior Orchestra).", "For the rest of 1987, the core quartet worked on the Mozart album, which united the band with the orchestra of the Academy of St Martin in the Fields. The project was initiated by Tristan Fry (due to his parallel work with both band and orchestra) and was inspired by the bicentenary of Mozart's death. The album contained full orchestral performances of Mozart's work with Sky incorporated into the arrangements (most of which were written by Steve Gray). The band and orchestra (with Paul Hart returning as guest musician) promoted the album with a one-off concert at the Royal Albert Hall on 1 November 1987. Although the album ultimately became Sky's most successful album in the United States, Mozart was roundly panned and dismissed by the press and the band took another two years off. A second compilation album, Classic Sky, was released in 1990.", "Since leaving Sky in 1980, Francis Monkman has divided his time between experimental rock music and classical music recordings of solo keyboard work (generally harpsichord or church organ). Post-Sky, Tristan Fry continued his work as a classical percussionist: he still works with the Orchestra of the Academy of St Martin in the Fields, as well as the Tristan Fry Percussion Ensemble.", "* Tristan Fry – drums, percussion, trumpet (1978–1995)"]}, {"page": "Five Leaves Left", "response": ["*: Tristan Fry – drums and vibraphone"]}, {"page": "Waterphone", "response": ["The instrument has also been used prominently by rock musicians. Tom Waits is a waterphone collector and player as is Mickey Hart. Other users include Richard Barone (both solo and with The Bongos) and Alex Wong (when playing with Vienna Teng), and it can be heard in music by The Harmonica Pocket. Classical/rock crossover percussionist Tristan Fry of the fusion band Sky used a waterphone on the band's composition 'Meeheeco' (the original version is on 1981's Sky 3, although the instrument can be heard much more prominently on the live version from Sky Five Live)."]}, {"page": "Solid Air", "response": ["* Tristan Fry – vibraphone on \"Solid Air\""]}, {"page": "Central Heating (Heatwave album)", "response": ["*Frank Ricotti, Tristan Fry - percussion"]}, {"page": "The Single Factor", "response": ["#* Tristan Fry - glockenspiel", "* Tristan Fry – glockenspiel (B 2)"]}, {"page": "Fry (surname)", "response": ["*Tristan Fry, British drummer and percussionist"]}, {"page": "Later That Same Year", "response": ["*Tristan Fry - vibraphone"]}, {"page": "Bananamour", "response": ["* Tristan Fry – cymbal"]}, {"page": "Sing Children Sing", "response": ["*Tristan Fry – percussion"]}, {"page": "Robert John Godfrey", "response": ["* Tristan Fry - percussion"]}, {"page": "If I Had a Ribbon Bow", "response": ["The band cut the song with singer Judy Dyble playing the harmonium. Her legs were not long enough to reach the pedals/bellows so two other members of the group had to pump them. Tristan Fry, a friend of the group, played the vibes at the beginning and end of the song. Ian Matthews, who was then a new member of the group added a few spoken words. \"If I had a Ribbon Bow\" was released as a 45 with \"If,\" a track from their first album, as the B-side. It was a minor hit on the BBC.The Accidental Musician: The Story of Judy Dyble", "*Tristan Fry – vibes"]}, {"page": "Jeroen van Veen (pianist)", "response": ["| Les Noces ||Koch International Classics 7514||Igor Stravinsky||Philharmonia Orchestra, Simon Joly Chorus, Tristan Fry Percussion Ensemble, International Piano Quartet (Elisabeth, Marcel Bergmann and Jeroen, Maarten van Veen), Robert Craft||1", "| Les Noces ||Naxos Records||Igor Stravinsky||Philharmonia Orchestra, Simon Joly Chorus, Tristan Fry Percussion Ensemble, International Piano Quartet (Elisabeth, Marcel Bergmann and Jeroen, Maarten van Veen), Robert Craft||1"]}, {"page": "Painted Head", "response": ["*Tristan Fry – vibraphone, background vocals"]}, {"page": "Melos Ensemble", "response": ["EMI reissued in 2011 a selection from historical recordings, titled \"Melos Ensemble – Music among Friends\". The principal players were Richard Adeney (and William Bennett, flute), Gervase de Peyer (and Keith Puddy, clarinet), Peter Graeme (and Sarah Barrington, oboe), Neil Sanders (and James Buck, horn), William Waterhouse (and Edgar Williams, bassoon), Emanuel Hurwitz (and Kenneth Sillito, first violin), Ivor McMahon (and Iona Brown, second violin), Cecil Aronowitz (and Kenneth Essex, viola), Terence Weil (and Keith Harvey, cello), Adrian Beers (double bass), Osian Ellis (harp) and Lamar Crowson (piano). The ensemble was expanded for single works by Christopher Hyde-Smith (flute), Anthony Jennings and Stephen Trier (bass clarinet), Barry Tuckwell (horn), David Mason and Philip Jones (trumpet), Arthur Wilson and Alfred Flaszinski (trombone), Robert Masters (violin), Manoug Parikian and Eli Goren (violin), Patrick Ireland (viola), Derek Simpson (cello), Hilary Wilson (harp), Marcal Gazelle (piano), James Blades, Tristan Fry, Jack Lees and Stephen Whittaker (percussion), and singers Mary Thomas (soprano) and Rosemary Phillips (contralto)."]}, {"page": "Rock 'n' Roll Juvenile", "response": ["*Tristan Fry - percussion on \"Carrie\" and \"Language of Love\""]}, {"page": "Lines (The Walker Brothers album)", "response": ["* Gary Walker, Tristan Fry – percussion"]}, {"page": "Classic Rock (album)", "response": ["**Tristan Fry"]}, {"page": "Sky (Sky album)", "response": ["* Tristan Fry – drums, percussion"]}, {"page": "Close Enough for Love (Andy Williams album)", "response": ["*Tristan Fry - percussion"]}, {"page": "Spiral (Stockhausen)", "response": ["* Stockhausen: Spiral (Version Elektrochord), Wach (aus den 17 Texten intuitiver Musik Für kommende Zeiten), Spiral (Version Elektronium), Japan (aus den 17 Texten intuitiver Musik Für kommende Zeiten), Pole (Version Elektronium & Elektrochord). Harald Bojé (electronium, shortwave radio, Japanese woodblock); Péter Eötvös (electrochord, schalmai, Japanese bamboo flute, shortwave radio); Christoph Caskel (percussion); Karlheinz Stockhausen (sound direction). (Recorded 8–10 December 1971, No. 2 Studio, Abbey Road, London.) EMI 2-LP set. EMI Electrola C165-02 313/314. Cologne: The Gramophone Company Ltd., EMI Electrola GmbH, 1973. Reissued with additional material (Zyklus for a percussionist, Tristan Fry, percussion; Tierkreis for trumpet and organ, and In Freundschaft for trumpet, Markus Stockhausen, trumpet, , organ). 2-CD set. EMI Classics 6 95598 2. [N.p.]: EMI Records, 2009."]}, {"page": "Sky 2 (album)", "response": ["* Tristan Fry – drums, tuned percussion on \"Tristan's Magic Garden\" (drumkit, vibraphone, marimba, bass marimba, tympani & xylophones), trumpet on \"Tuba Smarties\""]}, {"page": "Oasis (Oasis album)", "response": ["*Tristan Fry – marimbas"]}, {"page": "Kevin Peek", "response": ["In 1979, he joined the classical/progressive rock quintet Sky.  In association with classical guitarist John Williams, keyboardist Francis Monkman, bassist Herbie Flowers, and drummer Tristan Fry, Peek played on seven studio albums with the band, before departing in 1991. Peek recorded three albums—Guitar Junction, Awakening, and Life & Other Games— but achieved greater prominence through his work with Sky and his session work with Olivia Newton-John, Kiki Dee, Sally Oldfield, the Alan Parsons Project, and the London Symphony Orchestra (in association with Francis Monkman on their Symphonic Rock: British Invasion releases). He also played on various soundtracks, including Monkman's music for The Long Good Friday."]}, {"page": "Sky 3 (album)", "response": ["* Tristan Fry – drums, marimba, vibraphone, waterphone"]}, {"page": "List of people who performed on Beatles recordings", "response": ["*Tristan Fry—percussionist; session musician. Contributed percussion and timpani to \"A Day in the Life\""]}, {"page": "Sky Five Live", "response": ["#\"The Swan\" (Camille Saint-Saëns, Arranged by Tristan Fry) – 4:36", "*Tristan Fry: Drums, Percussion (Premier Drum Kit, Müsser Marimba, Waterphone)"]}, {"page": "Cadmium (album)", "response": ["#\"Troika\" (Sergei Prokofiev/Auth. Arr. Tristan Fry) – 3:00", "#\"Then & Now\" (Tristan Fry) – 3:25", "*Tristan Fry – Drums (Premier), Percussion (Sleigh Bells, Besson B Flat Trumpet with cup mute, Latin Percussion)."]}, {"page": "Changes (John Williams album)", "response": ["*'Percussion:' Ronnie Verrall, Terry Cox, Tristan Fry, Jim Lawless, Ray Cooper, Barry Guard"]}, {"page": "Sky 4: Forthcoming", "response": ["* Tristan Fry - Drums, Marimba, Celeste"]}]}}