{"wiki_id": "http://www.wikidata.org/entity/Q1917237", "itemLabel": "Lizzie Higgins", "itemDescription": "British singer", "wikipedia_url": "https://en.wikipedia.org/wiki/Lizzie_Higgins", "wikipedia_page": {"main": "Lizzie Higgins (20 September 1929 – 20 February 1993) was an Aberdeenshire ballad singer.", "link_mentions": [{"page": "Jeannie Robertson", "response": ["Robertson's daughter Lizzie Higgins issued an album in 1975: Up and Awa' wi' the Laverock. Stanley Robertson, a storyteller, ballad singer and piper from Aberdeen, was Jeannie's nephew. Carmen Higgins, ex-fiddler with the Aberdeen folk band, Rock Salt and Nails, is also closely related to her. Carmen Higgins has played with Old Blind Dogs, recorded a solo CD, and has appeared regularly on television, radio and in the press. Joss Cameron is related to her, and performs Jeannie Robertson ballads. "]}, {"page": "The Raggle Taggle Gypsy", "response": ["Some traditional recordings were made in Scotland, including by the Scottish traveller Jeannie Robertson and her daughter Lizzie Higgins, whose version can be heard online via the Vaughan Williams Memorial Library."]}, {"page": "Allison Gross", "response": ["The ballad was provided by Mrs. Brown (née Anne or Anna Gordon) of Aberdeen, Scotland, recorded by her nephew, Robert Eden Scott, in 1783 (or \"shortly before\"), and in the same year it was sent by her father, prof. Thomas Gordon, to William Tytler with other 14 recorded songs (so-called Tytler-Brown MS). For \"Allison Gross\", no other source has been found. The ballad was first published by Robert Jamieson in his Popular Ballads in 1806. The Scottish traditional singer Lizzie Higgins sang a version in 1977 which can be heard via the Vaughan Williams Memorial Library website, but unlike most of her songs, it was probably derived from print rather than from her family tradition."]}, {"page": "List of Scottish musicians", "response": ["*Lizzie Higgins (1929–1993), ballad singer"]}, {"page": "The Knight and the Shepherd's Daughter", "response": ["The folklorist Alan Lomax recorded John Strachan of Fyvie, Aberdeenshire singing a version in 1957, which is publicly available online. Many Scottish versions had previously been recorded by James Madison Carpenter in the 1930s. A later version was performed by Lizzie Higgins of Aberdeenshire in the 1970s, and is now available on the Vaughan Williams Memorial Library website."]}, {"page": "Edward (ballad)", "response": ["In Scotland, the song was generally known as \"My Son David\". Recordings were made of traditional Scottish traveller Jeannie Robertson (1953), her nephew Stanley Robertson (1987) and daughter Lizzie Higgins (1970) singing the ballad; Lizzie Higgins' recording publicly available on the Vaughan Williams Memorial Library website."]}, {"page": "The Twa Brothers", "response": ["Many traditional recordings of the ballad were made in Scotland in the twentieth century, mostly from members of two particular traveller families. Notable performers include Jeannie Robertson, her daughter Lizzie Higgins and nephew Stanley Robertson, as well as Belle Stewart (on the album O'er his grave the Grass Grew Green, 1988) and her daughter Sheila Stewart (on The Muckle Sangs, 1975). The unrelated Scottish singer Lucy Stewart sang a similar version which was recorded by Peter Kennedy in 1955 and later included on The Voice of the People (along with Belle Stewart's recording) and Good People take Warning (2012). Jeannie Robertson's recording is available on the Tobar an Dualchais website."]}, {"page": "Grit (Martyn Bennett album)", "response": ["The album was recorded while Bennett was ill and unable to play his instruments, so instead he brought together samples of unaccompanied traditional Scottish folk singers, his own bagpipe and fiddle playing, and electronic drum beats. The opening track, Move, samples a recording of traditional singer Sheila Stewart performing Ewan MacColl’s Moving On Song. Stewart was delighted that he was taking her music to a new audience. The album features many other traditional Scottish singers, including Lizzie Higgins and Scottish Gaelic singer Flora MacNeil, as well as Michael Marra narrating an English translation of psalm 118 in the track Liberation.", "* Lizzie Higgins – traditional arrangement (2), vocals (2)"]}, {"page": "Peter Kennedy (folklorist)", "response": ["*Lizzie Higgins"]}, {"page": "Scottish Gypsy and Traveller groups", "response": ["* Lizzie Higgins, Scottish folk singer (daughter of Jeannie Robertson)."]}, {"page": "Traditional singer", "response": ["*Lizzie Higgins (1929-1993)"]}, {"page": "Scottish Cant", "response": ["Hamish Henderson and other folklorists recorded various conversations about the Scottish Cant language with speakers including Lizzie Higgins and Jeannie Robertson. He also recorded Belle Stewart singing a version of \"Dance to Your Daddy\" in both Cant and Scots."]}, {"page": "Heather Heywood", "response": ["Heywood's first performance took place around 1968 in the Eglinton Folk Club in Irvine, Scotland. Inspired by Martin Carthy, Lizzie Higgins and Jeannie Robertson among others, she progressed to bookings as a solo artist for a number of Scottish clubs. She remained a solo artist for most of her career except for one tour of Brittany with the band The Clutha during the absence of their singer Gordeanna McCulloch."]}]}}