{"wiki_id": "http://www.wikidata.org/entity/Q1927071", "itemLabel": "Michael Broadbent", "itemDescription": "British wine critic (1927-2020)", "wikipedia_url": "https://en.wikipedia.org/wiki/Michael_Broadbent", "wikipedia_page": {"main": "John Michael Broadbent, MW (2 May 1927 – 17 March 2020) was a British wine critic, writer and auctioneer in a capacity as a Master of Wine. He was an authority on wine tasting and old wines.", "link_mentions": [{"page": "May 2", "response": ["*  1927   – Michael Broadbent, British wine critic and writer (d. 2020)"]}, {"page": "Riesling", "response": ["Riesling wines are often consumed when young, when they make a fruity and aromatic wine that may have aromas of green or other apples, grapefruit, peach, gooseberry, honey, rose blossom or cut green grass, and usually a crisp taste due to the high acidity.Owen Bird, Rheingold - The German Wine Renaissance, Arima Publishing 2005, p. 91  However, Riesling's naturally high acidity and range of flavours make it suitable for extended aging. International wine expert Michael Broadbent rates aged German Rieslings, some hundreds of years old, highly.Michael Broadbent, Vintage Wines Little, Brown 2002 pg 343  Sweet Riesling wines, such as German Trockenbeerenauslese are especially suited for cellaring since the high sugar content provides for additional preservation. However, high quality dry or off-dry Riesling wine is also known to have not just survived but also been enjoyable at an age exceeding 100 years. Jancis Robinson.com: Exploding myths about German wine.", "The townhall of Bremen, Germany, stores various German wines, including Riesling based wines, in barrel back to the 1653 vintage.Michael Broadbent, Vintage Wines Little, Brown 2002 p. 344 ."]}, {"page": "James Arbuthnot", "response": ["On 6 September 1984, Arbuthnot married Emma Louise Broadbent, daughter of Michael Broadbent, Wine Director of Christie's.   She is a Justice of the High Court, having previously served as the Senior District Judge (Chief Magistrate) for England and Wales."]}, {"page": "Burgundy wine", "response": ["*  With Charles Taylor, MW.  Foreword by Michael Broadbent. Good coverage of the top domaines."]}, {"page": "Chateau Musar", "response": ["The international discovery of Musar took place at the Bristol Wine Fair of 1979 when auctioneer and taster Michael Broadbent and journalist Roger Voss selected Musar 1967 as the \"discovery of the Fair\"."]}, {"page": "Master of Wine", "response": ["* Michael Broadbent"]}, {"page": "St James's Church, Piccadilly", "response": ["* James Arbuthnot MP, married Emma Broadbent, daughter of Michael Broadbent, in 1984."]}, {"page": "Côte d'Or (escarpment)", "response": ["*  Foreword by Michael Broadbent, again a little out of date but good coverage of the top domaines."]}, {"page": "Wine fraud", "response": ["One of the most famous, alleged purveyors of label fraud is wine collector Hardy Rodenstock. In the 1980s and 1990s, Rodenstock hosted a series of high-profile wine tasting events of old and rare wines from his collection, including many from the 18th and 19th centuries. He invited to these tastings dignitaries, celebrities and internationally acclaimed wine writers and critics such as Jancis Robinson, Robert M. Parker Jr. and Michael Broadbent who at the time was a director at the London auction house Christie's and considered one of the world's foremost authorities on rare wine. At one such tasting, Rodenstock produced 125 vintages of Château d'Yquem, including a very rare bottle from the 1784 vintage. In addition to holding these extravagant tastings, Rodenstock also sold many bottles from his collection at auction houses, which supposedly regularly inspect and research wines for authenticity. One such lot that Rodenstock sold were the rare \"Jefferson bottles\", reportedly rare Bordeaux wines bottled for the American president, Thomas Jefferson. American businessman Bill Koch bought four of these Jefferson bottles which were later determined to be fake - the engravings on the bottle that purportedly linked them to Jefferson were determined to have been done with a high-speed electric drill similar to a dentist's drill; technology that did not exist until modern times. This revelation cast a net of suspicion on the authenticity of all the rare bottles that Rodenstock served at his tastings and sold at auctions.P. Keefe The Jefferson Bottles, The New Yorker pages 1-10, September 3, 2007Jancisrobinson.com, March 17, 2007: Flushing out wine fraud and fakes"]}, {"page": "List of wine professionals", "response": ["* Michael Broadbent, MW – influential British wine critic and auctioneer"]}, {"page": "Bruce Duncan Guimaraens", "response": ["In 1961 he was promoted to the position of director of winemaking and vineyard management at Taylor Fonseca, and was credited by The Telegraph as playing an instrumental role in expanding the number of vineyards owned by the firm. His tenure saw the creation of the Fonseca 1963, described by critic Michael Broadbent as \"one of the top '63s, and one of the best-ever Fonsecas\", and the Fonseca 1977, which also received high praise. He retired in 1989."]}, {"page": "André Simon (wine)", "response": ["As a Frenchman, his English prose was heavily influenced by the man who gave him his first break in writing – A. S. Gardiner of the Wine Trade Review. Simon once described a wine as \"a girl of fifteen, who is already a great artist, coming on tip-toe and curtseying herself out with childish grace and laughing blue eyes.\"McCoy, Elin (2005). The Emperor of Wine. New York: HarperCollins.  Hugh Johnson has called Simon's \"figures of speech and choice of phrases deliciously oblique\"; Michael Broadbent admires the \"pure poetry\" of his writing, calling Simon his favourite writer. However, not everyone appreciates such purple prose; Robert Parker developed his 100-point rating scale as a reaction against this style of writing."]}, {"page": "Broadbent", "response": ["*Michael Broadbent (1927–2020), English wine critic and auctioneer"]}, {"page": "1927 in the United Kingdom", "response": ["* 2 May – Michael Broadbent, wine critic (died 2020)"]}, {"page": "Edmund Penning-Rowsell", "response": ["Michael Broadbent noted that Penning-Rowsell had one of the best private wine collections in England. Working with Broadbent, he became an adviser on wine to auctioneers Christie's, and regularly reported on wine auction results."]}, {"page": "Christopher Forbes", "response": ["On December 5, 1985, Kip Forbes paid the highest price ever recorded for a single bottle of wine. Hardy Rodenstock (Meinhard Görke) put one of the 'recently discovered' \"Th. J.\" (Thomas Jefferson) bottles up for auction at Christie's in London: a bottle of 1787 Château Lafite engraved \"1787 Lafitte Th. J.\". The bottles had been found in a walled-up old cellar,Keefe, Patrick Radden, The Jefferson Bottles, The New Yorker, September 3, 2007, p. 7 and were engraved with vintage years from the late eighteenth century. This had in itself been an interesting find for a collector of old wines, but the bottles also were engraved with the initials, \"Th. J.\", which was taken as an indication that they had belonged to Thomas Jefferson. Jefferson was an active oenophile and wine collector, who spent much time in France during the 1780s and whose interest in wine is well documented.J. Robinson (ed), \"The Oxford Companion to Wine\", Third Edition, p 375-376, Oxford University Press 2006,  The auction catalogue simply listed the value as \"inestimable\", and it was sold for 105,000 pound sterling, which as of 2007, still remains the worldwide auction record for a single bottle of wine.Keefe, Patrick Radden, The Jefferson Bottles, The New Yorker, September 3, 2007, p. 1 Christopher Forbes was  bidding against Marvin Shanken of Wine Spectator Magazine, with Michael Broadbent handling the gavel at the auction.", "A book, The Billionaire's Vinegar, has been published about the affair, although it has been withdrawn from the UK market following legal action by Michael Broadbent. The film rights to both the book and a New Yorker article about the scandal have been purchased."]}, {"page": "Hardy Rodenstock", "response": ["The exclusive nature of the wine selection featured at Rodenstock's tastings is indicated by the fact that Michael Broadbent, who was considered to be the world's leading authority on old wines,Michael Broadbent: \"Michael Broadbent's Vintage Wine: 50 Years of Tasting the World's Finest Wines\" (2003), London: Little, Brown,  had tasted many of the rarest and oldest wines at Rodenstock's tastings, in particular, most eighteenth-century wines he has tasted.Keefe, Patrick Radden, The Jefferson Bottles, The New Yorker, September 3, 2007, p. 7", "Later the same year, on 5 December 1985, Rodenstock put one of the \"Th. J.\" bottles up for auction at Christie's in London: a bottle of 1787 Château Lafite, engraved \"1787 Lafitte Th. J.\". The auction catalogue simply listed the value as \"inestimable\", and it was sold for 105,000 pound sterling, which as of 2007 remained the worldwide auction record for a single bottle of wine.Keefe, Patrick Radden, The Jefferson Bottles, The New Yorker, September 3, 2007, p. 1 The buyer was Christopher Forbes, bidding against Marvin Shanken of Wine Spectator Magazine, with Michael Broadbent handling the gavel at the auction.", "In 2005, U.S. art and wine collector Bill Koch, who had bought some of the bottles attributed to Thomas Jefferson, prepared to exhibit items from his collection at the Boston Museum of Fine Arts, including the Jefferson bottles. The museum asked for provenance of the items to be displayed. In 1988, Koch had bought four bottles of Château Lafite and Branne-Mouton (present-day Château Mouton-Rothschild) of the 1784 and 1787 vintages, at a U.S. wine auction house (Chicago Wine Company) and a UK rare wine dealer (Farr Vintners), and paid a total of about 500,000 U.S. dollars for them. When Koch's staff couldn't find anything except Michael Broadbent's authentification of the bottles to confirm their provenance, the Thomas Jefferson Foundation at Monticello, Charlottesville, Virginia was contacted. The foundation's curator replied that based on Jefferson's records, the foundation did not think that the bottles had been in the possession of Thomas Jefferson. Inquiries at Chicago Wine Company and Farr Vintners came up with the result that all four of Koch's bottles originated with Rodenstock.", "In May 2008, a book about the controversy was published under the title The Billionaire's Vinegar, written by Benjamin Wallace. In the book a tritium test and two carbon-14 tests date the wine circa 1962. Later, a cesium-137 test gave similar results. Rodenstock was not available for comments on the publication of the book. Auctioneer Michael Broadbent, on the other hand, was unhappy with how his relationship to Rodenstock was portrayed in the book.", "In July 2009 it was announced that Michael Broadbent would sue Random House, the publishers of The Billionaire's Vinegar, for libel and defamation of character, on claims that the book made allegations that suggested that Broadbent had behaved in an unprofessional manner in the way in which he had auctioned some of these bottles and that his relationship and dealings with Hardy Rodenstock was suspected of being improper. The suit was filed in the United Kingdom, whose libel laws are more favourable to the defendant as the plaintiff has to demonstrate the infraction.  Random House initially stated it did not believe it had defamed Broadbent and would defend the lawsuit."]}, {"page": "The World of Fine Wine", "response": ["Among the content contributors are Michael Broadbent MW, Jancis Robinson MW, David Peppercorn MW, Serena Sutcliffe MW, Clive Coates MW, Nicolas Belfrage MW, Jasper Morris MW, James Halliday, Tim Atkin MW, Tom Stevenson, Michel Bettane, Franco Ziliani, Ann C. Noble, Oz Clarke, Tom Cannavan, Jamie Goode, Anthony Rose, Mike Steinberger, Antonio Galloni, Allen Meadows, David Schildknecht, Francois Mauss, Peter Liem, Roger Scruton, Anthony Hanson MW, and Jeannie Cho Lee MW."]}, {"page": "The Oxford Companion to Wine", "response": ["The Oxford Companion to Wine (OCW) is a book in the series of Oxford Companions published by Oxford University Press. The book provides an alphabetically arranged reference to wine, compiled and edited by Jancis Robinson, with contributions by several wine writers including Hugh Johnson, Michael Broadbent, and James Halliday, and experts such as viticulturist Richard Smart and oenologist Pascal Ribéreau-Gayon."]}, {"page": "Quarterly Review of Wines", "response": ["Quarterly Review of Wines, abbreviated QRW, is a U.S. quarterly publication with an emphasis on wine, food and travel. Published by Richard L. Elia, the first issue was released in 1977. QRW contributors include Michael Broadbent MW, David Peppercorn MW, Serena Sutcliffe MW. Clive Coates MW, Rosemary George MW, Ed McCarthy, Jacqueline Friedrich, Burton Anderson and Gerald D. Boyd. On 1 November 2011, the magazine discontinued its print version and went online."]}, {"page": "Christie's World Encyclopedia of Champagne & Sparkling Wine", "response": ["Christie's World Encyclopedia of Champagne & Sparkling Wine is an encyclopedia written by Tom Stevenson and Essi Avellan, published by Absolute Press, which is devoted to subjects relating to Champagne and sparkling wine. The foreword is written by Michael Broadbent. A smaller reduced version, Champagne & Sparkling Wine Guide, is published in the soft cover format."]}, {"page": "List of Old Oundelians", "response": ["*Michael Broadbent MW, wine critic and auctioneer"]}, {"page": "Ullage (wine)", "response": ["In the late 1980s, Master of Wine and senior consultant of Christie's auction Michael Broadbent developed a guide for evaluating the ullage levels of matured wines. While the focus of his guide was primarily on Bordeaux, it has been generally accepted and widely used in the wine market as an evaluation tool for all sorts of wine. The terms are used to describe the levels of wine in a wine bottle.  They are commonly used to describe old wine bottles offered for sale in wine auctions and by dealers in rare wine. Despite the guide's popularity, Broadbent has been quoted as regretting his decision not to copyright it.G. Harding \"A Wine Miscellany\" pg 33, Clarkson Potter Publishing, New York 2005 "]}, {"page": "Tintara", "response": ["It became the oldest bottle of Australian wine following the accidental destruction of the previous record holder, an 1864 bottle of Cabernet Sauvignon from Pewsey Vale. That bottle was owned by winemaker and collector Len Evans who purchased the wine in the 1970s. Evans left the wine in care of then Christie's senior director of wine, Michael Broadbent, for safe keeping. While at Christie's in Broadbent's office, an office cleaner accidentally knocked over the bottle while dusting, causing it to fall and break on the floor."]}, {"page": "Wine rating", "response": ["A wine rating is a score assigned by one or more wine critics to a wine tasted as a summary of that critic's evaluation of that wine. A wine rating is therefore a subjective quality score, typically of a numerical nature, given to a specific bottle of wine. In most cases, wine ratings are set by a single wine critic, but in some cases a rating is derived by input from several critics tasting the same wine at the same time. A number of different scales for wine ratings are in use. Also, the practices used to arrive at the rating can vary. Over the last couple of decades, the 50–100 scale introduced by Robert M. Parker, Jr. has become commonly used. This or numerically similar scales are used by publications such as Wine Enthusiast, Wine Spectator, and Wine Advocate.Wine Enthusiast Magazine \"About Wine Enthusiast's Rating System\" Accessed: Nov 18, 2013The Wine Advocate \"The Wine Advocate's Rating System\" Accessed: Jan 16, 2010Wine Spectator \"Wine Spectator Tasting Procedures and Taster Profiles\" Accessed: Jan 16, 2010 Other publications or critics, such as Jancis Robinson and Michael Broadbent, may use a 0–20 scale, or a 0–5 scale (often in terms of numbers of stars) either with or without half-star steps.J. Robinson Jancis Robinson's Wine Course Third Edition pp. 19, 283–286 Abbeville Press 2003 "]}]}}