{"wiki_id": "http://www.wikidata.org/entity/Q19276746", "itemLabel": "Matthew Bullock", "itemDescription": "(born 1949)", "wikipedia_url": "https://en.wikipedia.org/wiki/Matthew_Bullock_(banker)", "wikipedia_page": {"main": "Matthew Peter Dominic Bullock (born 9 September 1949) is a former banker and chief executive. From 2014 until 2019, he was Master of St Edmund's College, Cambridge. \nThe son of the historian Alan Bullock, Baron Bullock and his wife Hilda (née Handy), he was educated at Magdalen College School, Oxford and Peterhouse, Cambridge, graduating with a degree in History in 1970. From 1999 to 2011 he was the Chief Executive of Norwich and Peterborough Building Society. In 2011 the building society was fined £1.4 million by the Financial Services Authority for mis-selling high-risk investments to 3,200 customers. The society has made £51 million in compensation payments and the society has apologised for the hardship and anxiety suffered by its customers. \nIn his role as Master of St Edmund's College he presided over the expansion of the College to incorporate the Mount Pleasant Halls development, as well as the dismissal of an honorary research fellow, Noah Carl, after he was found to have activities and connections linking him to conservative academics. Noah Carl subsequently filed an employment tribunal claim against the university for unfair dismissal.", "link_mentions": [{"page": "St Edmund's College, Cambridge", "response": ["* 2014–2019: Matthew Bullock"]}, {"page": "Norwich and Peterborough Building Society", "response": ["In December 2010, it was reported that the Society had received a number of takeover approaches and was keeping its options open.Takeover for Norwich and Peterborough Building Society BBC News, 17 December 2010Briggs, Stephen N&P won’t rule out merger talk Peterborough Evening Telegraph, 17 December 2010 The Society had sold Keydata Investment Services products to some 3,100 customers via its independent financial advisers between November 2005 and June 2009, when the firm was put into administration by the FSA.Keydata: Full compensation for Lifemark investors BBC News, 1 December 2010 In July 2009, the Serious Fraud Office commenced an investigation into Keydata Investment Services Ltd. following a referral by the FSA. Shortly afterwards, in November 2009, the Society announced the closure of 10 branches largely outside its \"regional heartland\" effective March 2010Branch Restructure Norwich and Peterborough Building Society (retrieved 3 January 2011) and in January 2011, chief executive, Matthew Bullock, announced his retirement once a successor could be found.Reville, Matthew N&P chief set to retire when successor found Peterborough Evening Telegraph, 12 January 2011Norwich & Peterborough boss Matthew Bullock to retire BBC News, 12 January 2011 In light of tougher regulation, Aviva Life Services UK Ltd. (formerly Norwich Union) was reappointed to provide financial advice to members.Williams, Sam N&P and Aviva in talks over financial advice tie-up Norwich Evening News, 12 January 2011"]}, {"page": "Matthew Bullock (disambiguation)", "response": ["Matthew Bullock was an African American who fled to Canada and became a cause célèbre in the early 1920s.", "Matthew Bullock may also refer to:", "* Matthew Bullock (banker)  (born 1949), Master of St Edmund's College, Cambridge and former banker ", "* Matthew Bullock (footballer) (born 1980), English footballer"]}, {"page": "List of Cambridge History Faculty alumni", "response": ["*Matthew Bullock, Master of St Edmund's College, Cambridge"]}]}}