{"wiki_id": "http://www.wikidata.org/entity/Q1922657", "itemLabel": "Collet Dobson Collet", "itemDescription": "British Chartist", "wikipedia_url": "https://en.wikipedia.org/wiki/Collet_Dobson_Collet", "wikipedia_page": {"main": "Collet Dobson Collet (31 December 1812 – 28 December 1898) was an English radical freethinker, Chartist and campaigner against newspaper taxation.", "link_mentions": [{"page": "Clara Collet", "response": ["Her Unitarian father, Collet Dobson Collet, sent her to the North London Collegiate School close to where she lived, which was one of the most liberated schools for girls at that time. When finishing her education at the Collegiate School in 1878, she was recommended by the founder of the school, Frances Buss, to work as assistant mistress at the newly founded Wyggeston Girls' School in Leicester, later to become Regent College. Her salary was £80 and she got herself coached by masters from the boy's grammar school in Greek and applied mathematics."]}, {"page": "Thinker's Library", "response": ["# \"A History of the Taxes on Knowledge\" by Collet Dobson Collet"]}, {"page": "Collet Barker", "response": ["Barker never married. His nearest relations were Collet Dobson Collet, nephew; Clara Collet, great niece; Edward Dobson, New Zealand engineer, nephew; and great nephews, Sir Arthur Dudley Dobson, New Zealand survey engineer, and George Dobson, New Zealand surveyor, who was murdered in 1866 by the Burgess gang."]}, {"page": "Conway Hall Ethical Society", "response": ["*Sophia Dobson Collet, who contributed hymns; her brothers Charles, the Society's musical director, and Collet Dobson Collet"]}, {"page": "Edward Dobson", "response": ["Edward Dobson was born in London, probably in 1816 or 1817. His parents were John Dobson, a merchant, and Elizabeth Barker (1787–1875). Collet Dobson Collet (1812–1898) was his brother, Clara Collet (1860–1948) was his niece, and Sophia Dobson Collet (1822–1894) his sister. Collet Barker was an uncle, an elder brother of his mother."]}, {"page": "Wilfred Collet", "response": ["Wilfred Collet was born in Islington, London in 1856, the son of noted radical reformer Collet Dobson Collet and nephew of Sophia Dobson Collet and Edward Dobson. His family had a tradition of overseas service. A great-great-great uncle, Joseph Collett, had been an official in the East India Company and President of Madras (8 January 1717 – 18 January 1720). His sister Clara Collet (1860–1948) was a noted social reformer during the early part of the twentieth century."]}, {"page": "Alfred Novello", "response": ["Alfred Novello promoted and built the business into a huge commercial success, and is credited as being the first to introduce inexpensive sheet music (reducing the retail price by a factor of four)A brief history of Novello and Co Ltd and to depart from the method of publishing by subscription. In 1836 Novello started the publication of The Musical World, a weekly periodical that was the first devoted to music; its publication continued until 1891.The Musical World (London, 1836–1891) from Retrospective Index to Music Periodicals (ripm.org) From 1841 Henry Littleton assisted him, becoming a partner in 1861, when the firm became Novello & Co., and, on Alfred Novello's retirement and the completion of the sale in 1866, sole proprietor. Having incorporated the firm of Ewer & Co. in 1867, the title was changed to Novello, Ewer & Co., and still later back to Novello & Co., and, on Henry Littleton's death in 1888, his two sons carried on the business. Before his retirement, Alfred Novello actively worked against British \"taxation of knowledge\" and played a significant role in the 1853 repeal of the advertisement duty, the 1855 repeal of the newspaper stamp,The campaign for a free Press — The Peel Web, A Web of English History (Dr Marjorie Bloy)Taxes on Knowledge — Spartacus Educational  repeal of duties on paper and foreign books, and repeal of the security system.In reply to an email query as to what is meant by \"repeal of the security system\", Dr. Marjorie Bloy replied on 26 Feb 2013, giving a reference to Collet Dobson Collet's book A History of the Taxes on Knowledge: https://archive.org/stream/historyofthetaxe035181mbp/historyofthetaxe035181mbp_djvu.txt. This is a book; you need chapter 21, if you're going to read it ...  If you aren't, then the short answer is that it refers to the Six Acts of 1819 which levied a tax on newspapers. I gather that newspapers had to be registered under a security by the proprietor and it was this which was abolished. Newspaper proprietors had to give a \"security\" against libel in the period of distress/riots etc. immediately after the French Wars. The House of Lords debate says \"The principle of the present Bill was to repeal the Acts of Parliament which required securities of publishers and printers, and to preserve the Acts of Parliament which insisted on the registration of newspapers at Somerset House.\" He was a friend of Henry Bessemer."]}, {"page": "Collet (name)", "response": ["* Collet Dobson Collet (1812–1898), radical freethinker, Chartist and campaigner against newspaper taxation"]}, {"page": "Sophia Dobson Collet", "response": ["Sophia Dobson Collet was born Sophia Dobson in the parish of St. Pancras, London, the fifth of seven children of John Dobson (1778–1827), and his wife (and first cousin), Elizabeth Barker (1787–1875). She was described by Richard Garnett in the biography of William Johnson Fox as having attacks of a \"disabling illness\". Her elder brother was the Chartist radical Collet Dobson Collet (1812–1898). Another of her brothers was the engineer Edward Dobson (1816/17?–1908). She was the aunt of social reformer Clara Collet (1860–1948), who worked with Charles Booth on his great investigative work Life and Labour of the People of London; and of Sir Wilfred Collet, governor of British Honduras and British Guiana."]}, {"page": "Communist League", "response": ["* Collet Dobson Collet"]}, {"page": "Richard Moore (radical)", "response": ["The NSAC was absorbed after two years by the Association for Promoting the Repeal of Taxes on Knowledge (APRTK or APRTOK), and Moore was one of its most active members, sharing the organisational tasks with Collet Dobson Collet. The officers of the APRTK, set up in 1851, were Thomas Milner Gibson (President), Collet (Secretary), Moore (Chairman), and Francis Place (Treasurer). While the officers were not much affected, the rest of the committee was populated by middle-class radicals, with Cobden dominant; included were John Bright, George Dawson, Charles Gilpin, G. H. Lewes and Edward Miall."]}, {"page": "Taxes on knowledge", "response": ["The successful drive for reform was recognised by William Edwin Adams as \"a twelve years' agitation\". Secretary of APRTOK was Collet Dobson Collet. The President from 1850 was Thomas Milner Gibson. John Watts researched parliamentary questions for Milner Gibson, the Member of Parliament who chaired the 1851 Select Committee on Newspaper Stamps, but who then fell foul of Jeremiah Garnett, editor of the Manchester Guardian. Milner Gibson commented that Garnett \"was a free trader who did not like free trade in newspapers\"."]}]}}