{"wiki_id": "http://www.wikidata.org/entity/Q1928275", "itemLabel": "Michael Korda", "itemDescription": "British writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Michael_Korda", "wikipedia_page": {"main": "Michael Korda (born 8 October 1933) is an English-born writer and novelist who was editor-in-chief of Simon & Schuster in New York City.", "link_mentions": [{"page": "Chauvinism", "response": ["Lloyd and Michael Korda have argued that as they integrated back into the workforce, men returned to predominate, holding positions of power while women worked as their secretaries, usually typing dictations and answering telephone calls. This division of labor was understood and expected, and women typically felt unable to challenge their position or male superiors, argue Korda and Lloyd.Michael Korda, Male Chauvinism! How It Works. New York: Random House, 1973. Print."]}, {"page": "Robert E. Lee", "response": ["In 2014, Michael Korda wrote that \"Although these letters are dismissed by most of Lee's biographers as exaggerated, or simply as unfounded abolitionist propaganda, it is hard to ignore them. ... It seems incongruously out of character for Lee to have whipped a slave woman himself, particularly one stripped to the waist, and that charge may have been a flourish added by the two correspondents; it was not repeated by Wesley Norris when his account of the incident was published in 1866. ... [A]lthough it seems unlikely that he would have done any of the whipping himself, he may not have flinched from observing it to make sure his orders were carried out exactly.\""]}, {"page": "Lawrence of Arabia (film)", "response": ["The film has its defenders. Biographer Michael Korda, the author of Hero: The Life and Legend of Lawrence of Arabia, offers a different opinion. The film is neither \"the full story of Lawrence's life or a completely accurate account of the two years he spent fighting with the Arabs.\" However, Korda argues that criticising its inaccuracy \"misses the point.\" \"The object was to produce, not a faithful docudrama that would educate the audience, but a hit picture.\"Korda, pp. 693–94 Stephen E. Tabachnick goes further than Korda by arguing that the film's portrayal of Lawrence is \"appropriate and true to the text of Seven Pillars of Wisdom\".Lawrence of Arabia: An Encyclopedia. Westport, CT: Greenwood, Press, 2004. p. 24 A British historian of the Arab Revolt, David Murphy, wrote that although the film was flawed by various inaccuracies and omissions, \"it was a truly epic movie and is rightly seen as a classic.\"Murphy, David The Arab Revolt, Osprey: London, 2008 pp. 88–89"]}, {"page": "Harold Robbins", "response": ["Robbins' editors included Cynthia White and Michael Korda and his literary agent was Paul Gitlin."]}, {"page": "Graham Greene", "response": ["Michael Korda, a lifelong friend and later his editor at Simon & Schuster, observed Greene at work: Greene wrote in a small black leather notebook with a black fountain pen and would write approximately 500 words. Korda described this as Graham's daily penance—once he finished he put the notebook away for the rest of the day.", "Greene was one of the more \"cinematic\" of twentieth-century writers; most of his novels and many of his plays and short stories have been adapted for film or television. The Internet Movie Database lists 66 titles between 1934 and 2010 based on Greene material. Some novels were filmed more than once, such as Brighton Rock in 1947 and 2011, The End of the Affair in 1955 and 1999, and The Quiet American in 1958 and 2002. The 1936 thriller A Gun for Sale was filmed at least five times under different titles. Greene received an Academy Award nomination for the screenplay for the 1948 Carol Reed film The Fallen Idol, adapted from his own short story The Basement Room. He also wrote several original screenplays. In 1949, after writing the novella as \"raw material\", he wrote the screenplay for a classic film noir, The Third Man, also directed by Carol Reed, and featuring Orson Welles. In 1983, The Honorary Consul, published ten years earlier, was released as a film under its original title, starring Michael Caine and Richard Gere. Author and screenwriter Michael Korda contributed a foreword and introduction to this novel in a commemorative edition."]}, {"page": "Carlos Castaneda", "response": ["*Michael Korda, editor-in-chief at Simon & Schuster, was Castaneda's editor for his first eight books and discusses their work together in an essay in Another Life: A Memoir of Other People."]}, {"page": "Penthouse (magazine)", "response": ["Writers such as Seymour Hersh, Craig S. Karpel, James Dale Davidson, and Ernest Volkman exposed numerous scandals and corruption at the highest levels of the United States Government. Contributors to the magazine included such writers as Isaac Asimov, James Baldwin, Howard Blum, Victor Bockris, T.C. Boyle, Alexander Cockburn, Harry Crews, Cameron Crowe, Don DeLillo, Alan Dershowitz, Edward Jay Epstein, Joe Flaherty, Chet Flippo, Albert Goldman, Anthony Haden-Guest, John Hawkes, Nat Hentoff, Warren Hinckle, Abbie Hoffman, Nicholas von Hoffman, Michael Korda, Paul Krassner, Michael Ledeen, Anthony Lewis, Peter Manso, Joyce Carol Oates, James Purdy, Philip Roth, Harrison E. Salisbury, Gail Sheehy, Robert Sherrill, Mickey Spillane, Ben Stein, Harry Stein, Tad Szulc, Jerry Tallmer, Studs Terkel, Nick Tosches, Gore Vidal, Irving Wallace, and Ruth Westheimer (Dr. Ruth)."]}, {"page": "Institut Le Rosey", "response": ["In non-fiction, alumni Michael Korda and James Laughlin have written about their experiences and memories at Le Rosey. Columnist Taki Theodoracopulos has written extensively on the school and its alumni, and was in the middle of a mild controversy when in 1998 he jokingly wrote in The Spectator that Osama bin Laden had attended Le Rosey. The story resulted in an outcry from American readers, inquiries from several magazines, and the school publicly and \"vehemently\" denying that bin Laden had attended Le Rosey. In 1999, American journalist Paul Klebnikov (murdered in 2004) wrote an exposé on Le Rosey in Forbes magazine detailing the problems the school was experiencing with its majority Russian student body. Richard René Silvin released his book \"I survived Swiss Boarding Schools\" in 2006 and a second edition in 2018, chronicling his time at Le Rosey in the 50s and 60s."]}, {"page": "Alexander Korda", "response": ["Michael Korda, son of Vincent and thus nephew of Alexander, wrote a roman à clef about Merle Oberon, published after her death. It was entitled Queenie. He also wrote a memoir, Charmed Lives (1979), about his father, his two uncles and the rest of their large extended family."]}, {"page": "Merle Oberon", "response": ["Michael Korda, nephew of Alexander Korda, wrote a roman à clef about Oberon after her death titled Queenie. This was adapted into a television miniseries starring Mia Sara.Korda 1999, pp. 446–447.  F. Scott Fitzgerald's unfinished novel The Last Tycoon was made into a television series, with Jennifer Beals playing Margo Taft, a character created for the TV series and based on Oberon."]}, {"page": "Jacqueline Susann", "response": ["Jacqueline Susann is acknowledged to be the first \"brand-name\" novelist, a novelist who sells independent of critical attention. With her husband, Irving Mansfield, Susann revolutionized book promotion,Seaman. Lovely Me, p. 459. and they are widely credited with creating the modern-day book tour.Méndez, Teresa. Why book tours are passé. The Christian Science Monitor. November 30, 2007. Retrieved January 15, 2017. Michael Korda, editor of Susann's Love Machine said in 1995 that, prior to Susann, \"people weren't so much interested in selling books as they were in publishing them.\"Beram, Nell. Jacqueline Susann and the 50th Anniversary of 'Valley of the Dolls'. V. August 1, 2016. Retrieved January 15, 2017. To what had once been considered a \"gentleman's profession,\"Atlas, Riva D. Bernard Geis, Celebrity Publisher, Dies at 91. The New York Times. January 10, 2001. Retrieved January 15, 2017. she brought a show business sensibility. She toured extensively in support of each book, making appearances at bookstores and on countless television and radio shows.Chilton, Martin. Valley of the Dolls: from reject to 30-million best-seller. The Telegraph. May 8, 2016. Retrieved January 15, 2017. Her books were advertised on the entertainment pages of major newspapers,O'Rourke, Sally. It Was 50 Years Ago Today: ‘Valley of the Dolls’ by Jacqueline Susann. REBEAT. November 8, 2016. Retrieved January 15, 2017. and Mansfield tested her book covers to see how they appeared on television. She even served coffee and doughnuts to the truck drivers who would be delivering her books. She lavished attention on booksellers, sending them thank you notes, and even bought copies of her book for bookstore clerks.Arikoglu, Lale. 50 Years On, ‘Valley of the Dolls’ Is Still Ahead of the Game. New York Observer. July 7, 2016. Retrieved January 15, 2017. \"A new book is like a new brand of detergent,\" she said. \"You have to let the public know about it. What's wrong with that?\"", "Scandalous Me was followed in 2000 by the theatrical film Isn't She Great, based on a New Yorker profile by Michael Korda, with Bette Midler and Nathan Lane. The film was not well-received critically and was a box office bomb, with a worldwide gross of just $3 million on a $44 million budget.Isn't She Great. Box Office Mojo. [n.d.] Retrieved January 9, 2017. Film critic Roger Ebert wrote, \"Jackie Susann deserved better.\"Ebert, Roger. Isn't She Great. RogerEbert.com. January 28, 2000. Retrieved January 9, 2017. Midler was nominated for a Razzie award as Worst Actress for her performance."]}, {"page": "Kitty Kelley", "response": ["Michael Korda, who had been the editor for Kelley's previous book on Elizabeth Taylor, asked to excuse himself from this work as he was slated to edit Ronald Reagan's autobiography. The Nancy Reagan book was edited instead by Alice Mayhew. Korda stated that Nancy Reagan was purported to have said about Kelley, \"I hope she gets hit by a truck.\""]}, {"page": "List of Hollywood novels", "response": ["| Michael Korda || Queenie || 1985"]}, {"page": "Cornelius Ryan", "response": ["For many years Ryan's editor at Simon & Schuster was Peter Schwed, who was assisted by Michael Korda. Ryan's literary agent was Paul Gitlin."]}, {"page": "Arab Revolt", "response": ["In the early days of the revolt, Faisal's forces were largely made up of Bedouins and other nomadic desert tribes, who were only loosely allied, loyal more to their respective tribes than the overall cause.Murphy, p. 21. The Bedouin would not fight unless paid in advance with gold coin,Michael Korda, Hero: The Life and Legend of Lawrence of Arabia , p. 19 and by the end of 1916, the French had spent 1.25 million gold francs in subsidizing the revolt. By September 1918, the British were spending £220,000/month to subsidize the revolt."]}, {"page": "Susan Howatch", "response": ["Howatch wrote the novel at her kitchen table in New Jersey. Publisher Michael Korda wrote, \"It is a frequently stated basic belief of book publishing that somewhere in the country at any given moment some unknown woman is writing a major best-seller (usually referred to as 'the next Gone with the Wind') at her kitchen table while looking after her baby, but this was the first time I had experienced the phenomenon in real life. Susan Howatch had written her massive novel with one hand on the cradle and the other doing the typing, but, like most authors who succeed, she had never doubted that her book would be a bestseller.\" Korda asserted that, while reading the drafts, he noticed similarities to the Plantagenets and asked Howatch if that was the case.  She replied that Shakespeare had borrowed most of his plots from other sources, and asked Korda if he thought anyone would notice.", "According to her publisher Michael Korda, Howatch was never comfortable with publishing popular fiction, and felt that it didn't satisfy her intellectual and moral needs. He cites this as a reason for her shift away from popular fiction to more serious writing. For Korda, she became the only best-selling novelist to walk away from her own success or to leave her publisher because \"he had sold too many copies of her books.\""]}, {"page": "The Story of Civilization", "response": ["Editors on the series included M. Lincoln (\"Max\") Schuster and Michael Korda."]}, {"page": "Irving Wallace", "response": ["Michael Korda and Peter Schwed were the editors for Wallace at Simon & Schuster. In his autobiography Another Life, Korda suggests that Wallace invented a style of novel that is at once a strong story and encyclopedia, with \"some sex thrown in to keep the reader's pulse going.\""]}, {"page": "Jason Epstein", "response": ["In 1958 he left Doubleday to join Random House where he served as editorial director until his retirement in 1999. At Random House he edited such writers as Jane Jacobs, Norman Mailer, Philip Roth, Derek Jeter, Gore Vidal, Vladimir Nabokov, E. L. Doctorow, Michael Korda, Ben Zion Netanyahu, Peter Matthiessen, and Paul Kennedy. During the New York newspaper strike of 1963 Epstein, his wife Barbara and their friends Robert Lowell and Elizabeth Hardwick created The New York Review of Books and turned to their friend Robert Silvers to be its editor along with Epstein's wife Barbara."]}, {"page": "Simon & Schuster", "response": ["In 1984, Simon & Schuster with CEO Richard E. Snyder acquired educational publisher Esquire Corporation, owner of companies including Allyn & Bacon (and former owner of Esquire magazine), for $180 million. Prentice Hall was brought into the company fold in 1985 for over $700 million and was viewed by some executives to be a catalyst for change for the company as a whole. This acquisition was followed by Silver Burdett in 1986, mapmaker Gousha in 1987 and Charles E. Simon in 1988. Part of the acquisition included educational publisher Allyn & Bacon which, according to then editor and chief Michael Korda, became the \"nucleus of S&S's educational and informational business.\" Three California educational companies were also purchased between 1988 and 1990—Quercus, Fearon Education and Janus Book Publishers. In all, Simon & Schuster spent more than $1 billion in acquisitions between 1983 and 1991.", "* Michael Korda (editor-in-chief)", "According to one source, The Sower, the logo of Simon & Schuster, was inspired by the 1850 Jean-François Millet painting of the same name.Larson, Kay (April 16, 1984). \"Poet of Peasants\". New York. According to Michael Korda, the colophon is a small reproduction of The Sower by Sir John Everett Millais.Business Timeline "]}, {"page": "Wire Fox Terrier", "response": ["*Jani, owned by Vincent Korda, mentioned by his son Michael Korda in \"Alone\" (2017)"]}, {"page": "Adrian Carton de Wiart", "response": ["Carton de Wiart was born into an aristocratic family in Brussels, on 5 May 1880, eldest son of Léon Constant Ghislain Carton de Wiart (1854–1915) and Ernestine Wenzig (1860-1886). By his contemporaries, he was widely believed to be an illegitimate son of the King of the Belgians, Leopold II.Michael Korda, Hero: The Life and Legend of Lawrence of Arabia , p. 236 He spent his early days in Belgium and in England. The 'loss of his mother' when he was six prompted his father to move the family to Cairo so his father could practise at Egypt's mixed courts. It was widely assumed by biographers that his mother had died in 1886; however, his parents had in fact divorced in that year and his mother remarried Demosthenes Gregory Cuppa later in 1886. His father was a lawyer and magistrate, as well as a director of the Cairo Electric Railways and Heliopolis Oases Company and was well connected in Egyptian governmental circles. Adrian Carton de Wiart learned to speak Arabic."]}, {"page": "Wayne Dyer", "response": ["Dyer, a Detroit native, worked as a high school guidance counselor there and as a professor of counseling psychology at St. John's University in New York City. He pursued an academic career, published in journals, and established a private therapy practice. His lectures at St. John's University, which focused on positive thinking and motivational speaking techniques, attracted many students. Literary agent Arthur Pine persuaded Dyer to document his theories in his first book, called Your Erroneous Zones (1976).Dyer, Wayne. I Can See Clearly Now. pp. 155, 158–159 Dyer quit his teaching job and began a publicity tour of the United States, doggedly pursuing bookstore appearances and media interviews (\"out of the back of his station wagon\", according to Michael Korda, making the best-seller lists \"before book publishers even noticed what was happening\"). After Your Erroneous Zones dozens more books followed, many of them also best-sellers. Among them were Wishes Fulfilled, Excuses Begone and The Sky’s the Limit. The success of these books eventually led to national television talk show appearances including The Merv Griffin Show, The Tonight Show, and The Phil Donahue Show."]}, {"page": "Chris Korda", "response": ["Korda is the daughter of Michael Korda and his first wife, Carolyn Keese. She is the granddaughter of art director Vincent Korda, and the great-niece of film directors Alexander Korda and Zoltan Korda."]}, {"page": "Irving Paul Lazar", "response": ["At the time of his death, Lazar was working on his autobiography, Swifty: My Life and Good Times, which was completed by Annette Tapert and published by Simon & Schuster in 1995. In 1999 Simon & Schuster editor-in-chief Michael Korda published his memoirs, entitled Another Life: A Memoir of Other People. It has a chapter about Lazar.", "* The New Yorker: Michael Korda's \"The King of the Deal\" (March 29, 1993)"]}, {"page": "Korda", "response": ["* Chris Korda (born 1962), American techno musician; born as son of Michael Korda, now identifying as a trans woman", "* Michael Korda (born 1933), English-born American editor and writer"]}, {"page": "Zoltan Korda", "response": ["Korda married Olly Szokolay in 1921, divorcing in 1924. Korda married the British actress and dancer Joan Gardner in 1930. They were together until his death. They had 2 sons, David and Nicholas. The extended family's colorful history is the subject of a book by Zoltan's nephew Michael Korda, Charmed Lives."]}, {"page": "Richard L. Simon", "response": ["Michael Korda said that when he arrived to work as an editor at Simon and Schuster in 1958, he found a bronze plaque on his desk designed by Richard Simon that said, \"Give the reader a break.\" This was a reminder to every editor that their job was to make things as easy and clear for the reader as possible."]}, {"page": "Sidney Kingsley", "response": ["Meeting him in 1957, Michael Korda described Kingsley as \"a short, powerfully built man with broad shoulders, a big head, and rough-hewn features that made him look like a bust by Sir Jacob Epstein. Kingsley hired Korda as an assistant to do research for a screenplay he was writing for CBS on the Hungarian Revolution which was eventually canceled."]}, {"page": "The Forest People", "response": ["The editor for the book was Michael Korda who attended Oxford University with Turnbull."]}, {"page": "The Kindly Ones (Littell novel)", "response": ["Upon its publication in English in early 2009, The Kindly Ones received mixed reviews. The New Republics literary critic Ruth Franklin called it \"one of the most repugnant books I have ever read [...] if getting under the skin of a murderer were sufficient to produce a masterpiece, then Thomas Harris would be Tolstoy.\" Michiko Kakutani, the principal book critic of The New York Times, called the novel \"[w]illfully sensationalistic and deliberately repellent\" and went on to question the \"perversity\" of the French literary establishment for praising the novel. In a reply to Kakutani, writer and novelist Michael Korda wrote, \"You want to read about Hell, here it is. If you don’t have the strength to read it, tough shit. It’s a dreadful, compelling, brilliantly researched, and imagined masterpiece, a terrifying literary achievement, and perhaps the first work of fiction to come out of the Holocaust that places us in its very heart, and keeps us there.\" Writing for Time, American writer and journalist Lev Grossman compared it to Roberto Bolaño's 2666, similar in \"their seriousness of purpose, their wild overestimation of the reader's attention span and their interest in physical violence that makes Saw look like Dora the Explorer,\" but added that while far from perfect, The Kindly Ones \"is unmistakably the work of a profoundly gifted writer, if not an especially disciplined one.\"Grossman, Lev (Mar. 19, 2009). The Good Soldier. Time. Retrieved on 2009-04-25. In her review for Los Angeles Times, novelist and essayist Laila Lalami wrote: \"Jonathan Littell has undertaken a very ambitious project in The Kindly Ones, and I think his boldness deserves to be commended. In the end, however, his highly problematic characterization and awkward handling of point of view make this book far more successful as a dramatized historical document than as a novel.\" British historian Antony Beevor, author of Stalingrad and The Fall of Berlin 1945, reviewing The Kindly Ones in The Times, called it \"a great work of literary fiction, to which readers and scholars will turn for decades to come,\"Beevor 2009a and listed it as one of the top five books of World War II fiction.Beevor 2009b"]}, {"page": "Marilyn Monroe in popular culture", "response": ["* Michael Korda: The Immortals (1992)"]}, {"page": "The Fifth Horseman (novel)", "response": ["The books was published by Michael Korda at Simon & Schuster in 1980. The authors Larry Collins and Dominique Lapierre were journalists—Collins having written for Newsweek and Lapierre for Paris Match. According to Korda, Charles Bluhdorn, founder of Gulf + Western which at the time was the parent company over Simon & Schuster and Paramount, became obsessed with the possibilities of the realities in the book. Bluhdorn would hold up meetings with financial managers to warn them of the danger written about in the book. To that end, Bluhdorn made it his mission to create a movie out of the book and tried to enlist Barry Diller then head of Paramount to his side. Ultimately Diller and Korda convinced Bluhdorn that making the film was a bad idea and it was abandoned. The agent for the book was Irving \"Swifty\" Lazar."]}, {"page": "Isn't She Great", "response": ["Isn't She Great is a 2000 biographical comedy-drama film that presents a fictionalized biography of author Jacqueline Susann, played by Bette Midler. An international co-production between the United States, the United Kingdom, Germany, and Japan, the film was directed by Andrew Bergman from a screenplay by Paul Rudnick based on a 1995 New Yorker profile by Michael Korda. The film covers Susann's entire life, focusing on her early struggles as an aspiring actress relentlessly hungry for fame, her relationship with press agent husband Irving Mansfield (Nathan Lane), with whom she had an institutionalized autistic son, her success as the author of Valley of the Dolls, and her battle with and subsequent death from breast cancer. In addition to Midler and Lane, the film stars Stockard Channing as Susann's \"gal pal\" Florence Maybelle, David Hyde Pierce as book editor Michael Hastings, and John Cleese as publisher Henry Marcus. John Larroquette, Amanda Peet, Christopher McDonald, Debbie Shapiro, and Paul Benedict have supporting roles."]}, {"page": "The Four Seasons Restaurant", "response": ["In 1977, the book publisher Michael Korda proclaimed the Grill Room “the most powerful place to eat lunch in town”. A 1979 article in Esquire declared its Grill Room the setting for “America’s Most Powerful Lunch”. According to CNN, the term \"power lunch\" may have come from this article."]}, {"page": "Eminent Lives", "response": ["* Michael Korda on Ulysses S. Grant"]}, {"page": "List of alumni of Institut Le Rosey", "response": ["*Michael Korda (born 1933), writer, former Editor-in-Chief of Simon & Schuster"]}]}}