{"wiki_id": "http://www.wikidata.org/entity/Q1923657", "itemLabel": "Alistair Griffin", "itemDescription": "English singer-songwriter and musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Alistair_Griffin", "wikipedia_page": {"main": "Alistair Richard Griffin (born 1 November 1977) is an English singer-songwriter and musician. Already an established songwriter, he first became famous as a solo artist through his appearances on the BBC television show Fame Academy 2 in 2003, where he was mentored by Robin Gibb of the Bee Gees. He subsequently had two top twenty hit singles and a top twenty album in the UK.", "link_mentions": [{"page": "Robin Gibb", "response": ["On 27 January 2003, Robin released a solo album, Magnet in Germany on SPV GmbH, and worldwide shortly afterwards. Magnet featured the Bee Gees song \"Wish You Were Here\" (from the 1989 album One) in a new acoustic version. The lead single, \"Please\", had coincidental lyrics about 'loss'. In recent years, Gibb sang the vocals to the opening titles to the British ITV show The Dame Edna Treatment. In August 2003, Gibb announced the release of a new single of \"My Lover's Prayer\", a song first recorded by the Bee Gees in 1997 on the album Still Waters, with lead vocals by Gibb and singers Wanya Morris and Lance Bass. That version was played on the radio but was never actually released. In October 2003, Gibb recorded a second version of the song with Alistair Griffin, a-runner up in the UK television program Fame Academy on which Gibb appeared as a judge. In January 2004, the new version of that song was released in the UK as a double A side CD single. It eventually reached number 5 in the UK music charts. In late 2004, Gibb embarked a solo tour of Germany, Russia and Asia with singer Alistair Griffin as the opening act. On his return to the UK, Gibb released a CD and DVD of live recordings from the German leg of the tour, backed by the Frankfurt Neue Philharmonic Orchestra of Frankfurt, Germany. In 2005, Gibb made a solo tour of Latin America."]}, {"page": "1977 in music", "response": ["*November 1 – Alistair Griffin, British singer and songwriter"]}, {"page": "List of singer-songwriters", "response": ["*Alistair Griffin"]}, {"page": "Mark Viduka", "response": ["Viduka had a song written about him by English singer/songwriter and Middlesbrough fan Alistair Griffin (who also previously co-wrote the football song recorded by Terry Venables). The song lyrics were written to the tune of Leonard Cohen's \"Hallelujah\"."]}, {"page": "Fame Academy", "response": ["| Alistair Griffin"]}, {"page": "Alex Parks", "response": ["The final showdown between Parks and Alistair Griffin was screened live and generated so many angry messages from viewers after Daniel Bedingfield who duetted with both finalists, made his feelings clear by urging viewers that they should \"just vote for Alex\". This outburst by Bedingfield led to claims of favouritism. The BBC was forced to close down the Points of View message boards as negative messages flooded the board. Bedingfield made a public apology to Griffin for his behaviour and outburst. The actual voting figures have never been publicly released. Parks went on to win the show."]}, {"page": "Phixx", "response": ["In autumn 2004 Phixx toured South Africa, where they were already popular. They released their debut album, Electrophonic Revolution, there and it became the best-selling album for their South African record company Sheer Music. The band co-wrote some of the songs for the album with Lee Ryan from Blue, Brian McFadden (formerly of Westlife), Alistair Griffin, Ultra, and Theo from Liberty X. All the tracks were produced by John McLaughlin, who had previously worked with Busted."]}, {"page": "James Fox (singer)", "response": ["In 2003, he took part in the BBC's Fame Academy and took the stage name James Fox. He came fifth and subsequently appeared on the albums Fame Academy: Bee Gees Special (Polydor, August 2003) and Fame Academy – The Finalists (Polydor, October 2003). He also duetted on the co-written track, \"In Your Smile\" which appeared on winner Alistair Griffin's début album Bring It On"]}, {"page": "York St John University", "response": ["* Alistair Griffin, singer/songwriter who first came to the public's attention on the 2003 BBC television series Fame Academy 2"]}, {"page": "Kimberley Walsh", "response": ["! scope=\"row\" | \"The Road\"(Alistair Griffin featuring Kimberley Walsh)"]}, {"page": "INTRO Festival", "response": ["Alistair Griffin,"]}, {"page": "Ultra (British band)", "response": ["In 2005, the four original members of the band reunited to write and record their second studio album, The Sun Shines Brighter, which also features songs written by former member Alistair Griffin (who provides guest vocals on one of the tracks). Producer credits on the album include Ian Stanley (who produced their first album), Claudio Guidetti (Laura Pausini, Eros Ramazzotti), and Ash Howes (Texas, Blue). This was released on 2 October 2006 on the Goldust label.", "The other band members formed a new group with a number of different short term vocalists including Ryan Molloy. Singers Alistair Griffin and James Fox were both briefly members of the band at different times."]}, {"page": "Shed Seven", "response": ["On 7 July 2007, the band announced a greatest hits reunion tour of 14 UK venues for November and December 2007, starting at the Music Hall in Aberdeen on 27 November and culminating at London's Shepherd's Bush Empire on 14 December. The reformed line-up featured all of the band's original members, including both Joe Johnson and Paul Banks, who appeared together for the very first time; keyboardist and songwriter Fraser Smith, however, took no part in the reunion.  It was the first time Banks had appeared on stage with the band since his departure in 1999. The band's accompanying official announcement stated that: \"These plans do not affect the individual members’ projects which will continue as before. This includes Rick, who recently released a debut album with his new band The Dukes\".  Yet, despite this vow, both Witter and Banks' respective bands - The Dukes and Albion - suffered due to the renewed commitment to their old band's new outing.  Banks parted company with the Alistair Griffin-fronted outfit the following month, whilst Witter completed one further UK tour with The Dukes prior to Shed Seven's Reunion Tour warm-up show in Hull on 25 November."]}, {"page": "The Road (disambiguation)", "response": ["* \"The Road\", a 2014 song by Alistair Griffin from From Nowhere"]}, {"page": "Still Waters (Bee Gees album)", "response": ["In 2003 Robin Gibb re-recorded the track \"My Lover's Prayer\" as a duet with Alistair Griffin. This reached No. 5 on the UK Singles Chart as a double A-side single with Griffin's solo recording of \"Bring It On\". It also appears on Griffin's debut album Bring It On, which reached No. 12 on the UK Albums Chart."]}, {"page": "The Real People", "response": ["They also wrote several tracks for the debut solo album by ex-Atomic Kitten, Natasha Hamilton.BBC Liverpool: Natasha Hamilton interview Bbc.co.uk, 15 June 2005 (Accessed: 29 November 2006) \"Reaching Out\" (co-written with Alistair Griffin and James and Tom Martin) was recorded by the Northern Irish band Bel's Boys and appeared on their 2007 album People Lets Go. "]}, {"page": "Fame Academy (series 2)", "response": ["*Alistair Griffin", "!colspan=\"2\" |Alistair Griffin", "Alex Parks and Alistair Griffin were both immediately signed to major record labels and each went on to have top 5 singles with self-penned songs. They have both subsequently released successful albums and singles.", "#  \"To Love Somebody\" – Alistair Griffin", "#  \"Wherever You Will Go\" – Alistair Griffin", "#  \"Lately\" – Alistair Griffin", "#  \"Truly Madly Deeply\" – Alistair Griffin", "#  \"It Must Be Love\" – Alistair Griffin"]}, {"page": "Louise Griffiths", "response": ["Although Griffiths did not get a recording contract after the show, one of the songs she co-wrote with fellow student Alistair Griffin, \"A Heart Can't Lie\", was included on his debut album Bring It On which reached No. 12 in the UK Albums Chart in January 2004. Shortly after leaving the show it was reported that she had been given an unreleased song by Robbie Williams and Guy Chambers to record, but this was never released."]}, {"page": "Tightrope (Stephanie McIntosh album)", "response": ["McIntosh worked on her debut album with award-winning songwriter/producer Tom Nichols who has written and produced songs for the likes of Jessica Simpson, Lindsay Lohan, Alistair Griffin, Kylie Minogue, S Club 7 and Atomic Kitten."]}, {"page": "Griffin (surname)", "response": ["* Alistair Griffin (born 1977), English singer/songwriter and musician"]}, {"page": "Dramatico", "response": ["Dramatico is a record label founded by Mike Batt in 2000. Artists on the label include Mike Batt, Robert Meadmore, Sarah Blasko, Katie Melua, Leddra Chapman and Alistair Griffin. Dramatico has also established a publishing company  in New York City and Germany. Artists signed to Dramatico Publishing include Reyna Larson, FL Jones, and The Paper Scissors."]}, {"page": "Universal Music TV", "response": ["A small number of individual artists were signed or transferred to this label in the early 2000s, including Malachi Cush, Alistair Griffin and Sam and Mark. None of these currently retain their contract."]}, {"page": "Bring It On (Alistair Griffin song)", "response": ["\"Bring It On\" is the debut single from British singer/songwriter Alistair Griffin, and is also the title track and first release from his debut album, Bring It On. It was released in December 2003 as a double A-side with \"My Lover's Prayer\", a duet with Robin Gibb of the Bee Gees and reached number five on the UK Singles Chart.", "Initially announced as two separate releases, the dates of both singles were unaccountably delayed until after Christmas 2003, when \"Bring It On\" was eventually released as a double A-side with \"My Lover's Prayer\" (the latter credited as Alistair Griffin feat. Robin Gibb) on 29 December, entering the UK Singles Chart at number five the following week.", "Two separate videos were made for \"My Lover's Prayer\", the first featured Alistair Griffin acting out a romantic scenario with a girl, the second showed Robin Gibb and Griffin in the recording studio. Neither video was included on the CD singles, and neither was ever released to the music stations. Clips from the second have appeared on several TV programmes and the full version can be viewed on Robin Gibb's official Myspace page.http://vidsearch.myspace.com/index.cfm?fuseaction=vids.individual&videoid=1405250239", "Two different versions of the single were released, both chart eligible. The extended single also included a cover of Take That's \"Back for Good\" and a video. The artwork for the limited edition single cover featured a dramatic portrait of Robin Gibb with Alistair Griffin.", "Category:Alistair Griffin songs", "Category:Songs written by Alistair Griffin"]}, {"page": "Bring It On (Alistair Griffin album)", "response": ["Bring It On is the debut album by British singer/songwriter Alistair Griffin. Released in January 2004 on the UMTV label, it reached #12 in the UK album charts.", "#\"Bring It On\" - 3:04 (Alistair Griffin)", "*Alistair Griffin - vocals"]}, {"page": "List of Never Mind the Buzzcocks episodes", "response": ["|Tony Wilson and Alistair Griffin"]}, {"page": "1977 in the United Kingdom", "response": ["*1 November – Alistair Griffin, singer/songwriter"]}, {"page": "Perfect Songs", "response": ["In recent years, Perfect has signed David Jordan (singer) (whose 2007 debut album, Set The Mood, has sold over 150,000 copies), singer-songwriter Kid Harpoon, Alistair Griffin, and Tim Hutton (whose recent co-writes include Ian Brown and Sugardaddy, a partnership with Tom Findlay from Groove Armada).", "* Alistair Griffin - \"You And Me Tonight\""]}, {"page": "Angel by My Side", "response": ["\"Angel By My Side\" is the third single of Dutch singer Do off her debut album, Do.  The song was co-written by English songwriters Alistair Griffin and James and Tom Martin. It peaked at No. 10 on the Dutch singles chart.", "Category:Songs written by Alistair Griffin"]}, {"page": "The Sun Shines Brighter", "response": ["The majority of the songs were written by the four original members of the band who reunited in 2005 to write and record it. James Hearn wrote \"Happiness\". Former member Alistair Griffin wrote \"Don't Let Go\" and  \"In Your Smile\", and also co-wrote \"Feeling Alive\". Griffin's vocals have been used on \"In Your Smile\" and \"Feeling Alive\", although these appear to have been recorded some time previously, before he re-recorded the versions which are included on his own 2004 solo album Bring It On."]}, {"page": "Di-rect", "response": ["In January 2005 they released a third album, All Systems Go!, which entered the Dutch album chart at #1. The first single from the album \"Hungry for Love\" (a cover of the song by Alistair Griffin) reached #3 in the singles chart. Two further singles, \"Cool Without You\" and \"Webcam Girl\", also reached the top 10, and \"Blind for You\", featuring the classical pianist Wibi Soerjadi made #13. \"Webcam Girl\" was released in 2 parts and also featured live versions of the other two singles which were performed at Pinkpop 2005. In 2006 a cover of \"Cool Without You\" by German singer Tobias Regner was recorded for the soundtrack of the movie Open Season (Jagdfieber)."]}, {"page": "You and Me (Tonight)", "response": ["\"You and Me (Tonight)\" is the second single release from English singer Alistair Griffin from his debut album Bring It On (2004).", "Category:Alistair Griffin songs", "Category:Songs written by Alistair Griffin"]}]}}