{"wiki_id": "http://www.wikidata.org/entity/Q1929042", "itemLabel": "Michael Rennie", "itemDescription": "English actor (1909-1971)", "wikipedia_url": "https://en.wikipedia.org/wiki/Michael_Rennie", "wikipedia_page": {"main": "Michael Rennie (born Eric Alexander Rennie; 25 August 1909 – 10 June 1971) was a British film, television and stage actor, who had leading roles in a number of Hollywood films, including his portrayal of the space visitor Klaatu in the science fiction film The Day the Earth Stood Still (1951). In a career spanning more than 30 years, Rennie appeared in more than 50 films and in several American television series.", "link_mentions": [{"page": "August 25", "response": ["*  1909   – Michael Rennie, English actor and producer (d. 1971)"]}, {"page": "June 10", "response": ["*1971 – Michael Rennie, English actor (b. 1909)"]}, {"page": "Eddie Chapman", "response": ["In the 1950s producer Ted Banborough announced plans to make a film about Chapman starring Michael Rennie or Stanley Baker, but this did not go ahead."]}, {"page": "1971", "response": ["* June 10 – Michael Rennie, English actor (b. 1909)"]}, {"page": "M. R. James", "response": ["There have been numerous television adaptations of James's stories. The very first TV adaptation was American—a 1951 version of \"The Tractate Middoth\" in the Lights Out series, called \"The Lost Will of Dr Rant\" and featuring Leslie Nielsen. It is available on several DVDs, including an Alpha Video release alongside Gore Vidal's Climax! adaptation of Doctor Jekyll and Mister Hyde, starring Michael Rennie."]}, {"page": "Charles XIV John", "response": ["The novel was filmed as Désirée in 1954, with Marlon Brando as Napoleon, Jean Simmons as Désirée, and Michael Rennie as Bernadotte."]}, {"page": "Kim (novel)", "response": ["*In 1960, a one-hour color adaptation of Kim was televised as part of NBC's series Shirley Temple's Storybook. Tony Haig portrayed Kim, Michael Rennie played Captain Creighton, and Alan Napier played Colonel Devlin. The episode has been released on DVD."]}, {"page": "Les Misérables", "response": ["* The 1952 film adaptation directed by Lewis Milestone, starring Michael Rennie and Robert Newton."]}, {"page": "Lewis Milestone", "response": ["Les Misérables (1952): For the last of his three pictures at 20th Century Fox, Milestone delivered a 104-minute version of Victor Hugo's sprawling romance novel Les Misérables (1862). Fox producers endowed the project with their foremost contract players, including Michael Rennie, Debra Paget, Robert Newton and Sylvia Sidney and lavish production support. The script by Richard Murphy \"telescopes all the novel's famous set-pieces into this cliché-ridden\" abbreviated adaption.Canham, 1974 p. 100: \"...Fox loaded his next film [Les Miserables] with contract players, but Milestone was dealing with an indifferent script...lavish sets and model work helped capture the feeling of the piece...\"Millichap, 1981 pp. 176-177: \"Casting does not aid Milestone's effort...\" And: See p. 176 for \"cliche-ridden\" comment. In a 1968 interview with film historians Charles Higham and Joel Greenberg, Milestone recalled his approach during the filming of Les Miserables: \"Oh, for Chrissake, it was just a job; I'll do it and get it over with.\" Film critic Joseph Millichap observes: \"that he did little with [Hugo's] literary classic...seems to indicate the waning of Milestone's creative energies.\"Millichap, 1981 pp. 176-177: See p. 177 for quote And p. 176: \"The final print bears every evidence of this attitude...\""]}, {"page": "Claude Rains", "response": ["| Michael Rennie, Jill St. John, David Hedison, Fernando Lamas, Richard Haydn"]}, {"page": "The Third Man", "response": ["A television spin-off starring Michael Rennie as Harry Lime ran for five seasons from 1959 to 1965. Seventy-seven episodes were filmed; directors included Paul Henreid (10 episodes) and Arthur Hiller (six episodes). Jonathan Harris played sidekick Bradford Webster for 72 episodes, and Roger Moore guest-starred in the instalment \"The Angry Young Man\", which Hiller directed."]}, {"page": "The Day the Earth Stood Still", "response": ["The Day the Earth Stood Still (a.k.a. Farewell to the Master and Journey to the World) is a 1951 American science fiction film from 20th Century Fox, produced by Julian Blaustein and directed by Robert Wise. The film stars Michael Rennie, Patricia Neal, Hugh Marlowe, Sam Jaffe, Billy Gray, Frances Bavier and Lock Martin. The screenplay was written by Edmund H. North, based on the 1940 science fiction short story \"Farewell to the Master\" by Harry Bates, and the film score was composed by Bernard Herrmann.Gianos 1998 p. 23.", "* Michael Rennie as Klaatu", "The film was dramatized as a radio play on January 4, 1954 for the Lux Radio Theatre; Michael Rennie reprised his lead role as Klaatu with actress Jean Peters as Helen Benson. This production was later re-broadcast on the Hollywood Radio Theater, the re-titled Lux Radio Theatre, which aired on the Armed Forces Radio Service.\"Notes: 'The Day the Earth Stood Still'.\" Turner Classic Movies. Retrieved: February 1, 2015."]}, {"page": "The Ten Commandments (1956 film)", "response": ["DeMille described the role of Rameses II as \"a part equal in dramatic strength to that of Moses\". Rory Calhoun, Jeff Chandler, Anthony Dexter, Mel Ferrer, Stewart Granger, William Holden, and Michael Rennie were considered to play the film's leading antagonist. DeMille saw Yul Brynner in the Broadway musical The King and I and went backstage to meet him. He told Brynner the story of the film from Rameses' point of view and offered him the role."]}, {"page": "Harry Belafonte", "response": ["Belafonte has starred in several films. His first film role was in Bright Road (1953), in which he appeared alongside Dorothy Dandridge. The two subsequently starred in Otto Preminger's hit musical Carmen Jones (1954). Ironically, Belafonte's singing in the film was dubbed by an opera singer, as Belafonte's own singing voice was seen as unsuitable for the role. Using his star clout, Belafonte was subsequently able to realize several then-controversial film roles. In 1957's Island in the Sun, there are hints of an affair between Belafonte's character and the character played by Joan Fontaine. The film also starred James Mason, Dandridge, Joan Collins, Michael Rennie, and John Justin. In 1959, he starred in and produced, through his company HarBel Productions, Robert Wise's Odds Against Tomorrow, in which he plays a bank robber uncomfortably teamed with a racist partner (Robert Ryan). He also co-starred with Inger Stevens in The World, the Flesh and the Devil. Belafonte was offered the role of Porgy in Preminger's Porgy and Bess, where he would have once again starred opposite Dandridge, but he refused the role because he objected to its racial stereotyping."]}, {"page": "Laurence Harvey", "response": ["|Tyrone Power, Orson Welles, Cécile Aubry, Jack Hawkins, Michael Rennie, Herbert Lom"]}, {"page": "1971 in film", "response": ["| style=\"text-align:center;\"| 10 || Michael Rennie || style=\"text-align:center;\"| 61 || style=\"text-align:center;\"| UK || style=\"text-align:center;\"| Actor || "]}, {"page": "1966 in film", "response": ["* Cyborg 2087, starring Michael Rennie and Wendell Corey"]}, {"page": "1960 in film", "response": ["*The Lost World, starring Michael Rennie and Jill St. John"]}, {"page": "John Dickson Carr", "response": ["Carr also wrote many radio scripts, particularly for the Suspense radio anthology series in America and for its UK equivalent Appointment With Fear introduced by Valentine Dyall, as well as many other dramas for the BBC, and some screenplays. His 1943 half-hour radio play Cabin B-13 was expanded into a series on CBS during 1948–49 for which Carr wrote all 25 scripts, basing some on earlier works or re-presenting devices that Chesterton had used.  The 1943 play Cabin B-13 was also expanded into the script for the 1953 movie Dangerous Crossing, directed by Joseph M. Newman and featuring Michael Rennie and Jeanne Crain.  Carr worked extensively for BBC Radio during World War II, writing both mystery stories and propaganda scripts. During the late 1940s he hosted Murder by Experts transmitted by Mutual radio. He introduced works by other mystery writers who were the week's guest writers. The show originated from Mutual's main station WOR in New York City. Many of these shows are available for free listening or downloading at the Internet Archive."]}, {"page": "1959 in film", "response": ["*Third Man on the Mountain, starring Michael Rennie"]}, {"page": "1953 in film", "response": ["*Dangerous Crossing, starring Jeanne Crain and Michael Rennie"]}, {"page": "1952 in film", "response": ["*Les Misérables, starring Michael Rennie, Robert Newton, Debra Paget"]}, {"page": "1951 in film", "response": ["*The Day the Earth Stood Still, directed by Robert Wise, starring Michael Rennie and Patricia Neal"]}, {"page": "1947 in film", "response": ["*The Root of All Evil, starring Phyllis Calvert and Michael Rennie – (GB)"]}, {"page": "1909 in film", "response": ["**Michael Rennie, actor (died 1971)"]}, {"page": "Roger Moore", "response": ["In 1959, he took the lead role in The Miracle, a version of the play Das Mirakel for Warner Bros. showcasing Carroll Baker as a nun. The part had been turned down by Dirk Bogarde. That same year, Moore was directed by Arthur Hiller in \"The Angry Young Man\", an episode of the television series The Third Man starring Michael Rennie as criminal mastermind Harry Lime, the role portrayed by Orson Welles in the film version."]}, {"page": "Jeanne Crain", "response": ["While still at 20th Century Fox, Crain played a young wife losing her mind amid high-seas intrigue in Dangerous Crossing (1953), co-starring Michael Rennie. She starred in Vicki (1953), a remake of I Wake Up Screaming; and Fox tried her in a Western, City of Bad Men (1954). Both films performed only mildly at the box office, and Crain left the studio."]}, {"page": "Patricia Neal", "response": ["Neal starred with John Garfield in The Breaking Point (1950), in The Day the Earth Stood Still (1951) with Michael Rennie, and in Operation Pacific (also 1951) starring John Wayne. She suffered a nervous breakdown around this time, following the end of her relationship with Cooper, and left Hollywood for New York, returning to Broadway in 1952 for a revival of The Children's Hour. In 1955, she starred in Edith Sommer's A Roomful of Roses, staged by Guthrie McClintic."]}, {"page": "Alfred Hitchcock Presents", "response": ["Many notable film actors, such as Robert Redford, Inger Stevens, Cedric Hardwicke, Robert Newton, Steve McQueen, Bruce Dern, Walter Matthau, George Segal, Laurence Harvey, Claude Rains, Joan Fontaine, Thelma Ritter, Dennis Morgan, Joseph Cotten, Vera Miles, Tom Ewell, Peter Lorre, Bette Davis, Dean Stockwell, Jessica Tandy, John Gavin, Michael Rennie, Phyllis Thaxter, Roger Moore, John Cassavetes, Teresa Wright and Barbara Bel Geddes, among others, also appeared on the series."]}, {"page": "List of ship names of the Royal Navy", "response": ["* HMS Stratford, HMS Amesbury, and  (from 1953 Michael Rennie film Single-Handed or Sailor of the King, (based on the novel Brown on Resolution by C. S. Forester), played by : , :  and  )"]}, {"page": "Secret Agent (1936 film)", "response": ["Secret Agent is a 1936 British espionage thriller film directed by Alfred Hitchcock, adapted from the play by Campbell Dixon, which in turn is loosely based on two stories in the 1927 collection Ashenden: Or the British Agent by W. Somerset Maugham. The film stars Madeleine Carroll, Peter Lorre, John Gielgud, and Robert Young. It also features uncredited appearances by Michael Redgrave, future star of Hitchcock's The Lady Vanishes (1938) and Michael Rennie in his film debut.", "* Michael Rennie as Army Captain (uncredited)"]}, {"page": "Les Misérables (1952 film)", "response": ["Les Misérables is a 1952 American film adapted from the 1862 novel Les Misérables by Victor Hugo.  It was directed by Lewis Milestone, and featured Michael Rennie as Jean Valjean, Robert Newton as Javert, and Sylvia Sidney as Fantine.", "* Michael Rennie as Jean Valjean"]}, {"page": "Mark W. Clark", "response": ["Clark was portrayed by Michael Rennie in the film The Devil's Brigade. The  film is about the exploits of the 1st Special Service Force, commanded by Colonel Robert T. Frederick, which came under Clark's command in the Italian Campaign."]}, {"page": "Sandman (DC Comics)", "response": ["* An unrelated Sandman appeared in the Batman episodes \"The Sandman Cometh\" and \"The Catwoman Goeth\" portrayed by Michael Rennie. He is an international criminal who uses special hypnotic sands to control sleepwalkers to do his bidding. Under the alias of Dr. Somnambular, he collaborates with Catwoman to steal the fortune of J. Pauline Spaghetti."]}, {"page": "Margaret Lockwood", "response": ["Lockwood had the biggest success of her career to-date with the title role in The Wicked Lady (1945), opposite Mason and Michael Rennie for director Arliss.  The film was the most popular movie at the British box office in 1946. In 1946, Lockwood gained the Daily Mail National Film Awards First Prize for most popular British film actress. However she was soon to suffer what has been called \"a cold streak of poor films which few other stars have endured.\""]}, {"page": "Handley Page Hampden", "response": ["The HP Hampden had a featured role in The Big Blockade, a 1941 Second World War propaganda film showing \"blockade\" bombing and its effects on the German war industry, with Michael Rennie and John Mills as two of its four-man crew. The trials of flying Hampdens in the early years of the Second World War are also described in the 2002 novel Damned Good Show by Derek Robinson. There is also an issue of the comic Combat about a Hampden and its crew."]}, {"page": "The Barbara Stanwyck Show", "response": ["*Michael Rennie"]}, {"page": "Tyrone Power", "response": ["Power's movies had been highly profitable for Fox in the past, and as an enticement to renew his contract a third time, Fox offered him the lead role in The Robe (1953). He turned it down (Richard Burton was cast instead) and on 1 November 1952, he left on a ten-week national tour with John Brown's Body, a three-person dramatic reading of Stephen Vincent Benét's narrative poem, adapted and directed by Charles Laughton, featuring Power, Judith Anderson and Raymond Massey. The tour culminated in a run of 65 shows between February and April 1953 at the New Century Theatre on Broadway. A second national tour with the show began in October 1953, this time for four months, and with Raymond Massey and Anne Baxter. In the same year, Power filmed King of The Khyber Rifles, a depiction of India in 1857, with Terry Moore and Michael Rennie."]}, {"page": "Edward Smith (sea captain)", "response": ["*Michael Rennie (1966) (The Time Tunnel, episode Rendezvous With Yesterday) (fictionalised as \"Captain Malcolm Smith\")"]}, {"page": "Branded (TV series)", "response": ["John M. Pickard appeared in six episodes as General Phil Sheridan. Other notable guest stars included Chris Alcaide, Russ Conway, Don Collier, Burgess Meredith, John Carradine, Pat Conway, Alex Cord, Janet De Gore, Dolores del Río, Chad Everett, I. Stanford Jolley, Martin Landau, June Lockhart, Gregg Palmer, Larry Pennell, Burt Reynolds, Lee Van Cleef, Bruce Dern and Michael Rennie."]}, {"page": "Jonathan Harris", "response": ["Harris returned to television, where he landed a co-starring role opposite Michael Rennie in The Third Man, from 1959 to 1965. He played Bradford Webster, an eccentric, cowardly assistant. Half the episodes were shot in London, England; the rest were filmed in Hollywood. Harris's teenaged son would visit the set at this time, and Harris did whatever he could to bridge the gap between father and son and tried to make up for lost time."]}, {"page": "The Wicked Lady", "response": ["Caroline (Patricia Roc) invites her beautiful, green-eyed friend Barbara (Margaret Lockwood) to her wedding to wealthy landowner and local magistrate Sir Ralph Skelton (Griffith Jones). The scheming Barbara soon has Sir Ralph entranced. Caroline, wishing his happiness, stands aside, and even allows Barbara to persuade her to be her maid of honour so as to lessen the scandal of the abrupt change of brides. At the wedding reception, Barbara meets a handsome stranger, Kit Locksby (Michael Rennie). It is love at first sight for both, but too late.", "*Michael Rennie as Kit Locksby"]}, {"page": "Columbia Heights (Washington, D.C.)", "response": ["Klaatu, the alien in the 1951 film The Day the Earth Stood Still, played by Michael Rennie, boards in a house at 1412 Harvard Street for his stay in Washington."]}, {"page": "Nicholas Clay", "response": ["In 1981 he gave his most widely seen screen performance, as Lancelot in the 1981 film Excalibur.  He followed it playing the title role in The Search for Alexander the Great (1981). He appeared in Just Jaeckin's film version of D.H. Lawrence's Lady Chatterley's Lover (1981), playing Mellors, and in Agatha Christie's Evil Under the Sun (1982), the latter reuniting him with Diana Rigg, his co-star in The Misanthrope. Director of Evil Guy Hamilton said \"I was looking for someone like Stewart Granger or Michael Rennie - handsome, dashing, physical, romantic. Nick has it all. A fine sense of timing, the right looks and a good physique.\""]}]}}