{"wiki_id": "http://www.wikidata.org/entity/Q1928966", "itemLabel": "Michael R. Rose", "itemDescription": "evolutionary biologist", "wikipedia_url": "https://en.wikipedia.org/wiki/Michael_R._Rose", "wikipedia_page": {"main": "Michael R. Rose is a Professor in the Department of Ecology and Evolutionary Biology at the University of California, Irvine.\nMichael Roberson Rose was born on July 25, 1955. He obtained his B.S. in 1975 from Queen's University, Kingston, Ontario, Canada. In 1976 he obtained his M.S.. In 1978 he obtained his Ph.D from the University of Sussex.His Ph.D. advisor was Brian Charlesworth. His main area of work has been the evolution of aging, approached both theoretically and empirically via the technique of experimental evolution. In 1991, he published Evolutionary Biology of Aging exploring a view of the subject based on antagonistic pleiotropy, the hypothesis that aging is caused by genes that have two effects, one acting early in life and the other much later. The genes are favored by natural selection as a result of their early-life benefits, and the costs that accrue much later appear as incidental side-effects that we identify as aging. Dr. Rose has also suggested that aging can stop in a latter stage of life. The field of aging biology is divided between those who think that it will be very difficult to develop technology to postpone human aging and those who expect breakthroughs in this field in the near future. Rose is an outspoken advocate for the former position.", "link_mentions": [{"page": "Evolutionary neuroscience", "response": ["Evolutionary neuroscience is the scientific study of the evolution of nervous systems. Evolutionary neuroscientists investigate the evolution and natural history of nervous system structure, functions and emergent properties. The field draws on concepts and findings from both neuroscience and evolutionary biology.  Historically, most empirical work has been in the area of comparative neuroanatomy, and modern studies often make use of phylogenetic comparative methods. Selective breeding and experimental evolution approaches are also being used more frequently.Rhodes, J. S., and T. J. Kawecki. 2009. Behavior and neurobiology. Pp. 263–300 in Theodore Garland, Jr. and Michael R. Rose, eds. Experimental Evolution: Concepts, Methods, and Applications of Selection Experiments. University of California Press, Berkeley."]}, {"page": "Life history theory", "response": ["For example, birds with larger broods are unable to afford more prominent secondary sexual characteristics.Gustafsson, L., Qvarnström, A., and Sheldon, B.C.  1995.  Trade-offs between life-history traits and a secondary sexual character in male collared flycatchers. Nature 375, 311—313 Life history characteristics will, in some cases, change according to the population density, since genotypes with the highest fitness at high population densities will not have the highest fitness at low population densities.Mueller, L.D., Guo, P., and Ayala, F.J. 1991. Density dependent natural selection and trade-offs in life history traits. Science, 253: 433-435. Other conditions, such as the stability of the environment, will lead to selection for certain life history traits. Experiments by Michael R. Rose and Brian Charlesworth showed that unstable environments select for flies with both shorter lifespans and higher fecundity—in unreliable conditions, it is better for an organism to breed early and abundantly than waste resources promoting its own survival.Rose, M. and Charlesworth, B. A Test of Evolutionary Theories of Senescence. 1980. Nature 287, 141-142"]}, {"page": "Future Fantastic", "response": ["Interviewed Marvin Minsky (cognitive scientist), Max More (futurist), Natasha Vita-More (author), Rima Greenhill, Malcolm Greenhill, Michael R. Rose (evolutionary biologist), Siegfried Hekimi (biologist), François Schächter (biologist), Robert Ettinger (academic), Steve Bridge (President of Alcor), Michael Taylor (cryobiologist), Ralph C. Merkle (nanotechnologist), Brian Stableford (author), John Clute (author), Frank Tipler (mathematical physicist), Gregory Benford (author)"]}, {"page": "Evolution of ageing", "response": ["In breeding experiments, Michael R. Rose selected fruit flies for long lifespan. Based on antagonistic pleiotropy, Rose expected that this would surely reduce their fertility. His team found that they were able to breed flies that lived more than twice as long as the flies they started with, but to their surprise, the long-lived, inbred flies actually laid more eggs than the short-lived flies. This was another setback for pleiotropy theory, though Rose maintains it may be an experimental artifact."]}, {"page": "Michael Rose", "response": ["*Michael R. Rose, evolutionary biologist"]}, {"page": "Bryant Villeponteau", "response": ["In 2008 Villeponteau joined Genescient as Vice President of Research.  Genescient (an Irvine biotech spinoff of the University of California/UCI that was cofounded by Gregory Benford) uses advanced genomics and machine learning technologies to develop drugs and nutraceuticals for age-related disease.Matsagas, K., Lim, D.B., Horwitz, M., Rizza, C.L., Mueller, L.D., Villeponteau, B., and Rose, M.R. (2009). Long-term functional side-effects of stimulants and sedatives in Drosophila melanogaster. PLoS ONE 4, e6578.  At Genescient, Villeponteau  worked with UCI professors Michael R. Rose, Larry Mueller, and Anthony Long to understand the genetic difference in long-lived Methuselah flies, which live 3 to 4 times longer than wild-type flies.Rose, M.R., Long, A.D., Mueller, L.D., Rizza, C.L., Matsagas, K.C., Greer, L.F., and Villeponteau, B. (2009). Evolutionary Nutrigenomics. In Experimental Evolution, T. Garland and M.R. Rose, eds. (Berkeley, CA, University of California Press).Rose, M.R., Long, A.D., Mueller, L.D., Rizza, C.L., Matsagas, K.C., Greer, L.F., and Villeponteau, B. (2010). Evolutionary Nutrigenomics. In The Future of Aging, G.M. Fahy, M.D. West, L.S. Coles, and S.B. Harris, eds. (Berlin, Germany, Springer), pp 357-366."]}]}}