{"wiki_id": "http://www.wikidata.org/entity/Q1937440", "itemLabel": "William Gosse", "itemDescription": "Australian explorer", "wikipedia_url": "https://en.wikipedia.org/wiki/William_Gosse_(explorer)", "wikipedia_page": {"main": "William Christie Gosse  (11 December 1842–12 August 1881), was an Australian explorer, who was born in Hoddesdon, Hertfordshire, England and migrated to Australia with his father Dr. William Gosse in 1850. He was educated at J.L. Young's Adelaide Educational Institution and in 1859 he entered the Government service of South Australia. He held various positions in the survey department, including Deputy Surveyor-General. He died of a heart attack on 12 August 1881, aged 38, after a long illness.\nAlthough Gosse's exploration was not groundbreaking, he filled in many details in the central map. He named the Musgrave Ranges and was able correctly to lay down the position of some of the discoveries of Ernest Giles. On 19 July 1873 he reached Uluru and gave it the name Ayers Rock. His second-in-charge, Edwin S. Berry (another AEI alumnus) was probably the first white man to climb \"The Rock\".\n\n", "link_mentions": [{"page": "1872", "response": ["* July 19 – Explorer William Gosse reached Uluru in central Australia and named it Ayers Rock."]}, {"page": "Ernest Giles", "response": ["Giles was the first European to see the rock formations named The Olgas, now officially known by  Kata Tjuta/Mount Olga, and Lake Amadeus. He had wanted to name these Mt Mueller and Lake Ferdinand respectively, to honour his benefactor Baron Ferdinand von Mueller, however Mueller prevailed on him to instead honour the King Amadeus of Spain and Queen Olga of Württemberg. Giles supposedly discovered Uluru (also known as Ayers Rock), but was beaten to the claim by a competing explorer, William Gosse."]}, {"page": "Uluru", "response": ["On 19 July 1873, the surveyor William Gosse sighted the landmark and named it Ayers Rock in honour of the then Chief Secretary of South Australia, Sir Henry Ayers. Since then, both names have been used.", "Europeans arrived in the Australian Western Desert in the 1870s. Uluru and Kata Tjuta were first mapped by Europeans in 1872 during the expeditionary period made possible by the construction of the Australian Overland Telegraph Line. In separate expeditions, Ernest Giles and William Gosse were the first European explorers to this area. While exploring the area in 1872, Giles sighted Kata Tjuta from a location near Kings Canyon and called it Mount Olga, while the following year Gosse observed Uluru and named it Ayers' Rock, in honour of the Chief Secretary of South Australia, Sir Henry Ayers."]}, {"page": "List of people on the postage stamps of Australia", "response": ["* William Gosse, explorer (1976)"]}, {"page": "Alexander Downer", "response": ["Downer was born on 9 September 1951 in Adelaide, South Australia. He is the third of four children born to Sir Alexander \"Alick\" Downer and Mary Downer (née Gosse); he has three sisters. The Downer family has a long history in South Australian politics.  Their earliest ancestors were Mary Ann Downer (1792-1868) and her son Henry Downer (great-grandfather) a tailor (1811-1870) who traveled from England in 1862 aboard the Eden settling in Adelaide.The Downers of South Australia Alick Downer - Wakefield Press. Retrieved 6 October 2019 Downer's father was Minister for Immigration in the Menzies Government and later served as High Commissioner to the United Kingdom. His paternal grandfather, Sir John Downer, served twice as Premier of South Australia in the late 19th century, and was later one of the inaugural members of the Australian Senate.Downer, Sir Alexander Russell (Alick) (1910–1981), Australian Dictionary of Biography. Downer's maternal grandfather was the businessman and philanthropist James Hay Gosse, whose father was the explorer William Gosse."]}, {"page": "John McDouall Stuart", "response": [":Kekwick married Marian Caroline Owen in 1864 and had four children. He was appointed mineral and botanical collector for William Gosse's expedition to Central Australia, but fell ill before they set out, and died at Nuccaleena on the way back to Adelaide."]}, {"page": "Gosses Bluff crater", "response": [" Known as Tnorala to the Western Arrernte people of the surrounding region, it is located in the southern Northern Territory, near the centre of Australia, about  west of Alice Springs and about  to the northeast of Uluru (Ayers Rock).  It was named by Ernest Giles in 1872 after Australian explorer William Gosse's brother Henry, who was a member of William's expedition."]}, {"page": "Lake Amadeus", "response": ["The next year, William Gosse climbed and named both rises."]}, {"page": "Henry Ayers", "response": ["His lasting memorial is in the name Ayers Rock, also known as Uluru, which was encountered in 1873 by William Gosse.Shute, Jason (2010) Henry Ayers: The Man Who Became a Rock, published by I.B.Tauris. On this day, 11 June 1897, Sir Henry Ayers: Professional Historians Association"]}, {"page": "Musgrave Ranges", "response": ["They were originally inhabited by the indigenous Yankunytjatjara people. The English explorer William Gosse and his team were the first white people to visit the region in the 1870s. Gosse named the mountains after Anthony Musgrave, then Governor of South Australia. At the start of the 20th century, Yankunytjatjara people began migrating east, and groups of Pitjantjatjara moved into the Musgrave region from the west. Today, the majority of the families in the communities of Amata and Kaltjiti identify as Pitjantjatjara."]}, {"page": "History of the Northern Territory", "response": ["Uluru and Kata Tjuta were first mapped by Europeans in 1872, during the expeditionary period made possible by the construction of the Australian Overland Telegraph Line. In separate expeditions, Ernest Giles and William Gosse were the first European explorers to the area. While exploring the area in 1872, Giles sighted Kata Tjuta from a location near Kings Canyon, naming it Mount Olga for Queen Olga of Württemberg, and in the following year, Gosse observed Uluru and named it Ayers Rock, in honor of the Premier of South Australia Sir Henry Ayers. The barren desert lands of Central Australia disappointed the Europeans as unpromising for pastoral expansion, but would later come to be appreciated as emblematic of Australia."]}, {"page": "History of Australia (1851–1900)", "response": ["Uluru and Kata Tjuta were first mapped by Europeans in 1872 during the expeditionary period made possible by the construction of the Australian Overland Telegraph Line. In separate expeditions, Ernest Giles and William Gosse were the first European explorers to this area. While exploring the area in 1872, Giles sighted Kata Tjuta from a location near Kings Canyon and called it Mount Olga, while the following year Gosse observed Uluru and named it Ayers Rock, in honor of the Chief Secretary of South Australia, Sir Henry Ayers. These barren desert lands of Central Australia disappointed the Europeans as unpromising for pastoral expansion, but would later come to be appreciated as emblematic of Australia."]}, {"page": "George Charles Hawker", "response": ["**Charles Allan Seymour Hawker (16 May 1894 – 25 October 1938), was a South Australian member of the Commonwealth House of Representatives from 1929 to 1938 and a member of the Lyons government. He was killed in the Kyeema crash.*Mary Blanche Hawker (1858 – 10 December 1945), married ophthalmologist Charles Gosse MD (c. 1849 – 1 July 1885), brother of the explorer William Gosse, on 11 May 1880. She left Australia after the accidental death of her husband and died at East Preston, Sussex."]}, {"page": "1842 in Australia", "response": ["*William Gosse"]}, {"page": "1873 in Australia", "response": ["* 19 July – Surveyor William Gosse names \"Ayers Rock\" after the Premier of South Australia Henry Ayers (later changed to its Indigenous name, Uluru)."]}, {"page": "George Gosse", "response": ["George Gosse was born on 16 February 1912 at Harvey, Western Australia, the elder child of William Hay Gosse, a farmer, and his wife Muriel  Davidson. He was a grandson of the explorer William Gosse and a nephew of the businessman Sir James Hay Gosse. His father had served in the 2nd South Australian Mounted Rifles in the Second Boer War in South Africa, and joined the British Army as an artillery officer in World War I. He was awarded the Military Cross for gallantry and was killed in action in 1918. Muriel died in 1920; George and his younger sister were then cared for by their paternal grandmother."]}, {"page": "William Christie Gosse", "response": ["#REDIRECT William Gosse (explorer)"]}, {"page": "Jubilee 150 Walkway", "response": ["File:J150W-Gosse.jpg          |William Gosse"]}, {"page": "Gosse", "response": ["* William Gosse (disambiguation), several people:", ":* William Gosse (explorer) (William Christie Gosse)", ":* William Gosse (surgeon), British Australian doctor", ":* William Gosse (MP) for Bridgwater (UK Parliament constituency)", ":* William Gosse Hay, brother-in-law and nephew of William Christie Gosse"]}, {"page": "Charles Gosse", "response": ["Charles Gosse was born in Hoddesdon, Hertfordshire, the youngest son of the surgeon William Gosse who, in the hopes of curing his bronchitis, brought his family to Australia in 1850, arriving in Adelaide on 31 December. Charles followed his brother William \"Willie\" in John L. Young's Adelaide Educational Institution, where he proved an apt pupil, being prominent at most prizegivings between 1857 and 1861. He was sent to England for further education; first at Clifton College in Bristol, then at Moorfields Hospital where he served as a Clinical Clerk and gained his M.R.C.S. in 1870. He studied medicine at Charing Cross Hospital, was admitted to the Royal College of Surgeons in 1870, and graduated with Bachelor of Medicine and Master of Surgery from the University of Aberdeen in 1872. He returned to Adelaide in 1873 and was promptly taken into partnership with his father. on North Terrace, and received his M.D. from Aberdeen in 1875. He was appointed to the Board of Management of the Adelaide Hospital in 1877. He was appointed ophthalmic surgeon to the Adelaide Hospital in 1881 and made the third member of its Medical Committee in 1883."]}, {"page": "William Gosse", "response": ["William Gosse may refer to:", "*William Gosse (explorer) (William Christie Gosse)", "*William Gosse (surgeon), his father", "*William Gosse (MP) for Bridgwater (UK Parliament constituency)", "*William Gosse Hay, brother-in-law and nephew of William Christie Gosse"]}, {"page": "Mann Ranges", "response": ["The first European person to visit the area was William Gosse in 1873. With the help of local Aboriginal people, Gosse and his team explored the Mann Ranges after seeing the range from the top of Uluṟu. From the Mann Ranges, he went west to the Tomkinson Ranges, but turned back rather than trying to cross the Great Victoria Desert. He came back to the Mann Ranges and then went eastward to the Musgrave Ranges."]}, {"page": "Tomkinson Ranges", "response": ["The Tomkinson Ranges is a mountain range in the northwest corner of South Australia. The range consists of sandstone hills, surrounded by spinifex grasslands. The range was named after politician Samuel Tomkinson (1816–1900) by the explorer William Gosse in the early 1870s. Ernest Giles and his team reached the ranges shortly after, and established a base from which to explore the Gibson and Great Victoria Deserts. Numerous prospecting expeditions were made through the region until the 1930s."]}, {"page": "Mountifort Conner", "response": ["Mount Conner in the Northern Territory was named after him by explorer William Gosse in 1873."]}, {"page": "European land exploration of Australia", "response": ["*William Gosse"]}, {"page": "James Hay Gosse", "response": ["Gosse was born in Kent Town, Adelaide, the second of three children born to the explorer William Gosse and his wife Agnes (née Hay). His father died when he was four years old. His grandfathers were the surgeon William Gosse Sr. and the politician Alexander Hay. Gosse was educated at St Peter's College, Adelaide, leaving in 1896.Gosse, Sir James Hay (1876–1952) - Australian Dictionary of Biography. He was a talented player of Australian rules football, playing for the Norwood Football Club between 1894 and 1905 as a ruckman. He won premierships in 1894 and 1904, and represented South Australia in four interstate games.Players /  G\t/  James Gosse - AustralianFootball.comHALL OF FAME - Sir James Gosse - Redlegs Museum. He also excelled at rowing, representing his state between 1902 and 1905; he was later president of the Adelaide Rowing Club from 1924 to 1931."]}, {"page": "Gosse, South Australia", "response": ["The locality includes a part of the Hundred of Gosse which was proposed as the site of a soldier settlement town during the 1950s.  A site was surveyed in June 1961 and gazetted as a government town in September 1961 with the name Gosse which is derived from Sir James Hay Gosse who had an interest in native fauna and flora conservation on Kangaroo Island and whose father, William Gosse, is remembered in the naming of the Hundred of Gosse.  The locality's boundaries which include the former government town of Gosse were created in May 2002."]}, {"page": "Undoolya Station", "response": ["Undoolya Station was established by South Australian pastoralist and stock agent Edward Mead Bagot. After working the southern section of the Overland Telegraph Line, Bagot applied for two leases adjoining the Alice Springs Telegraph Station in 1872. His friend Joseph Gilbert also applied for two blocks, closer to where Owen Springs Station is today. Bagot's son Ted, Churchill Smith and Joseph Gilbert's son William, selected cattle on Gilbert's Pewsey Vale Station to stock the new Central Australian leases. They undertook the first large cattle drove from South Australia to Alice Springs in June. It is considered to be one of the great droving feats in Australia history, during which they met Charles Todd returning from his first inspection of the southern end of the Overland Telegraph Line, as well as well-known explorers Ernest Giles, Peter Warburton and William Gosse. Emily Gap became their temporary camp upon arrival until construction of a homestead began in 1873."]}, {"page": "Mount Davies (South Australia)", "response": ["The Mount is in the traditional lands of the Pitjantjatjara one of the Anangu peoples of the central desert, who speak the Western Desert language.  William Gosse (explorer) was the first European the see the Mount was  W.C. Gosse on 27 August 1873, and he named it after Richard Davies Hanson Acting Governor from December 1872 to June 1873."]}, {"page": "European exploration of Australia", "response": ["Uluru and Kata Tjuta were first mapped by Europeans in 1872 during the expeditionary period made possible by the construction of the Australian Overland Telegraph Line. In separate expeditions, Ernest Giles and William Gosse were the first European explorers to this area. While exploring the area in 1872, Giles sighted Kata Tjuta from a location near Kings Canyon and called it Mount Olga, while the following year Gosse observed Uluru and named it Ayers Rock, in honour of the Chief Secretary of South Australia, Sir Henry Ayers. These barren desert lands of Central Australia disappointed the Europeans as unpromising for pastoral expansion, but would later come to be appreciated as emblematic of Australia."]}, {"page": "W. C. Gosse", "response": ["#REDIRECT William Gosse (explorer)"]}]}}