{"wiki_id": "http://www.wikidata.org/entity/Q1934589", "itemLabel": "V. C. Wynne-Edwards", "itemDescription": "British zoologist", "wikipedia_url": "https://en.wikipedia.org/wiki/V._C._Wynne-Edwards", "wikipedia_page": {"main": "Vero Copner Wynne-Edwards, CBE, FRS, FRSE (4 July 1906 – 5 January 1997) was an English zoologist. He was best known for his advocacy of group selection, the theory that natural selection acts at the level of the group.", "link_mentions": [{"page": "The Selfish Gene", "response": ["Dawkins examines childbearing and raising children as evolutionary strategies. He attacks the idea of group selection for the good of the species as proposed by V. C. Wynne-Edwards, arguing instead that each parent necessarily behaves selfishly. A question is whether parents should invest in their offspring equally or should favour some of them, and explains that what is best for the survival of the parents' genes is not always best for individual children. Similarly, Dawkins argues, there are conflicts of interest between males and females, but he notes that R. A. Fisher showed that the optimal sex ratio is 50:50. He explains that this is true even in an extreme case like the harem-keeping elephant seal, where 4% of the males get 88% of copulations. In that case, the strategy of having a female offspring is safe, as she'll have a pup, but the strategy of having a male can bring a large return (dozens of pups), even though many males live out their lives as bachelors. Amotz Zahavi's theory of honest signalling explains stotting as a selfish act, he argues, improving the springbok's chances of escaping from a predator by indicating how difficult the chase would be."]}, {"page": "List of biologists", "response": ["*V. C. Wynne-Edwards (1906–1997), Scottish zoologist known for advocacy of group selection, the theory that natural selection acts on groups"]}, {"page": "Red grouse", "response": ["However, in his book,Wynne Edwards, V. C. Evolution through Group Selection 1986 Blackwell Scientific Publications Oxford V. C. Wynne-Edwards suggests that the primary reason for mortality in grouse population is homeostasis depending largely on food availability and that the 'Grouse disease', due to the parasitic worm Trichostrongylus tenuis is a mistaken diagnosis of the after effects of social exclusion."]}, {"page": "Group selection", "response": ["Early authors such as V. C. Wynne-Edwards and Konrad Lorenz argued that the behavior of animals could affect their survival and reproduction as groups, speaking for instance of actions for the good of the species. In the 1930s, R.A. Fisher and J.B.S. Haldane proposed the concept of kin selection, a form of altruism from the gene-centered view of evolution, arguing that animals should sacrifice for their relatives, and thereby implying that they should not sacrifice for non-relatives. From the mid 1960s, evolutionary biologists such as John Maynard Smith, W. D. Hamilton, George C. Williams, and Richard Dawkins argued that natural selection acted primarily at the level of the individual. They argued on the basis of mathematical models that individuals would not altruistically sacrifice fitness for the sake of a group. A consensus emerged that group selection did not occur, including in special situations such as the haplodiploid social insects like honeybees (in the Hymenoptera), where kin selection explains the behaviour of non-reproductives equally well, since the only way for them to reproduce their genes is via kin.", "Once Darwinism had been accepted in the modern synthesis of the mid-twentieth century, animal behavior was glibly explained with unsubstantiated hypotheses about survival value, which was largely taken for granted. The naturalist Konrad Lorenz had argued loosely in books like On Aggression (1966) that animal behavior patterns were \"for the good of the species\", without actually studying survival value in the field. Richard Dawkins noted that Lorenz was a \"'good of the species' man\" so accustomed to group selection thinking that he did not realize his views \"contravened orthodox Darwinian theory\". The ethologist Niko Tinbergen praised Lorenz for his interest in the survival value of behavior, and naturalists enjoyed Lorenz's writings for the same reason. In 1962, group selection was used as a popular explanation for adaptation by the zoologist V. C. Wynne-Edwards.Wynne-Edwards, V. C. (1986) Evolution Through Group Selection, Blackwell.  In 1976, Richard Dawkins wrote a well-known book on the importance of evolution at the level of the gene or the individual, The Selfish Gene."]}, {"page": "Adaptation and Natural Selection", "response": ["Adaptation and Natural Selection: A Critique of Some Current Evolutionary Thought is a 1966 book by the American evolutionary biologist George C. Williams. Williams, in what is now considered a classic by evolutionary biologists,Pinker, S. (1994). The Language Instinct. New York: Harper Perennial Modern Classics, 1994, ch.9, p.294: \"In a book on evolutionary theory often considered to be one of the most important since Darwin's, the biologist George Williams speculates...\" outlines a gene-centered view of evolution, disputes notions of evolutionary progress, and criticizes contemporary models of group selection, including the theories of Alfred Emerson, A. H. Sturtevant, and to a smaller extent, the work of V. C. Wynne-Edwards. The book takes its title from a lecture by George Gaylord Simpson in January 1947 at the Princeton University. Aspects of the book were popularised by Richard Dawkins in his 1976 book The Selfish Gene."]}, {"page": "Vero C. Wynne-Edwards", "response": ["#REDIRECT V. C. Wynne-Edwards"]}, {"page": "Vero Copner Wynne-Edwards", "response": ["#REDIRECT V. C. Wynne-Edwards"]}, {"page": "Edwards (surname)", "response": ["*V. C. Wynne-Edwards (1906–1997), British zoologist"]}, {"page": "V.C. Wynne-Edwards", "response": ["#REDIRECT V. C. Wynne-Edwards"]}, {"page": "V C Wynne-Edwards", "response": ["#REDIRECT V. C. Wynne-Edwards "]}, {"page": "VC Wynne-Edwards", "response": ["#REDIRECT V. C. Wynne-Edwards "]}, {"page": "Vero Wynne-Edwards", "response": ["#REDIRECT V. C. Wynne-Edwards"]}, {"page": "James Macdonald (ornithologist)", "response": ["In 1962 he was elected a Fellow of the Royal Society of Edinburgh. His proposers were D. A. Bannerman, Sir Landsborough Thomson, Sir George Taylor, Edward Hindle and V. C. Wynne-Edwards. He resigned from the Society in 1987."]}, {"page": "Deaths in January 1997", "response": ["*V. C. Wynne-Edwards, 90, English zoologist."]}, {"page": "Epideictic display", "response": ["#REDIRECT V. C. Wynne-Edwards"]}, {"page": "List of University of Aberdeen people", "response": ["* V. C. Wynne-Edwards"]}]}}