{"wiki_id": "http://www.wikidata.org/entity/Q19325110", "itemLabel": "Annie Leigh Browne", "itemDescription": "Browne, Annie Leigh (1851–1936), educationist and suffragist", "wikipedia_url": "https://en.wikipedia.org/wiki/Annie_Leigh_Browne", "wikipedia_page": {"main": "Annie Leigh Browne (14 March 1851 – 8 March 1936) was a United Kingdom educationist and suffragist. She co-founded College Hall, London, and funded and worked to get women elected to local government.", "link_mentions": [{"page": "List of suffragists and suffragettes", "response": ["* Annie Leigh Browne (1851–1936) – co-founder of College Hall, London and of Women's Local Government Society"]}, {"page": "Sheldon Amos", "response": ["His wife, Sarah Amos (the former Sarah Maclardie Bunting), took a prominent part in Liberal Nonconformist politics and in movements connected with the position of women. The first meeting of what would become the Women's Local Government Society was held at her house and included several of her relatives. The group was led by Annie Leigh Browne and it was deciding suitable women candidates for election. Sarah died at Cairo on 21 January 1908."]}, {"page": "John Beddoe", "response": ["Beddoe was born in Bewdley, Worcestershire, and educated at University College, London (BA (London)) and Edinburgh University (M.D. 1853). He served in the Crimean War alongside David ChristisonThe Crimean Doctors by John Shepherd  and was a physician at Bristol Royal Infirmary from 1862 to 1873. He and his wife were both friends with Mary Carpenter and they hosted what was said to be the first women's suffrage meeting in 1868. Invitees included a young Annie Leigh Browne.Jane Martin, ‘Browne, Annie Leigh (1851–1936)’, Oxford Dictionary of National Biography, Oxford University Press, 2004 accessed 12 Jan 2017"]}, {"page": "Henrietta Müller", "response": ["Müller left Cambridge in 1878 and in the same year stood for election to the London School Board. Her campaign was successful, and she became one of the first female members of the board.Brown, Susan; Clements, Patricia; and Grundy, Isobel (eds.) (2006). \"Henrietta Müller\". Orlando: Women's Writing in the British Isles from the Beginnings to the Present. Cambridge University Press. Retrieved on 27 September 2014. During her term, she convinced the board to employ female workers—\"cannily pointing out that this would save money since women were paid less than men\"—and was involved with Annie Leigh Browne and Mary Stewart Kilgour in establishing the first women's residence hall (College Hall) in Bloomsbury before leaving the board in 1885."]}, {"page": "College Hall, London", "response": ["Established in 1882, and initially located in Byng Place, It initially catered for female students (having been co-founded by educationalist and suffragist Annie Leigh Browne, Mary Stewart Kilgour, Mary Browne (Lady Lockyer) and Henrietta Müller)Jane Martin, ‘Browne, Annie Leigh (1851–1936)’, Oxford Dictionary of National Biography, Oxford University Press, 2004 accessed 12 Jan 2017 The first Principal was Eleanor Grove who arranged for lease of the house in Byng Place, assisted by Rosa Morison, who volunteered to take the posts with no salary. College Hall was incorporated into the University of London in 1910. It moved to nearby Malet Street in 1932."]}, {"page": "Women's Local Government Society", "response": ["The organisation emerged from a local electors association formed by Amelia Charles, Caroline Biggs, Mrs Evans and Lucy Wilson at the instigation of Annie Leigh Browne. This group's ambition was to get women into church politics.Jane Martin, ‘Browne, Annie Leigh (1851–1936)’, Oxford Dictionary of National Biography, Oxford University Press, 2004 accessed 14 Jan 2017", "In November 1888 the Society for Promoting the Return of Women as County Councillors was formed by twelve women at Sarah Amos's house. The group included Elizabeth Lidgett and her sister Mary Bunting and it was led by Annie Leigh Browne. It was deciding suitable women candidates for election. Lidgett was offered the opportunity of standing to be a London County Councillor in 1889 but she refused.", "Annie Leigh Browne provided early funding and she, Eva McLaren, the Marchioness of Aberdeen, Louisa Temple Mallett and Newnham College founder Millicent Garret Fawcett were key members. In 1893 it changed its name to the Women's Local Government Society, reflecting the members wish to encourage women to be involved in every branch of politics and not exclusively in county councils. The aim of this society was to get women elected to local government. An early victory was the election of two women, Jane Cobden and Lady Margaret Sandhurst, to the London County Council. This was possible because of the wording of the Local Government Act 1888 which did not disqualify women candidates. A later court case determined that this was a mistake. Campaigns were unsuccessfully started to reverse the court's interpretation. However, in 1894 new legislation did allow women to stand for more minor roles."]}, {"page": "Mary Stewart Kilgour", "response": ["In 1882, Kilgour collaborated with Annie Leigh Browne, Browne's sister Mary (later Lady Lockyer) and Henrietta Müller to found College Hall, London."]}, {"page": "Elizabeth Lidgett", "response": ["In November 1888 she and her sister Mary attended the first meeting of what would become the Women's Local Government Society at Sarah Amos's house. The group was led by Annie Leigh Browne and it was deciding suitable women candidates for election. Lidgett was offered the opportunity of standing to be a London County Councillor in 1889 but she refused. That same year she became involved in the management of the Gray's Inn Road schools. This was a position of some ambition as women were allowed to serve on school boards many years before they were given equal electoral rights in 1928."]}, {"page": "Sarah Amos", "response": ["The first meeting of the \"Society for Promoting the Return of Women as County Councillors\" in November 1888 at her house. This what would become the Women's Local Government Society and the invitees included several of her relatives. The group was led by Annie Leigh Browne and it was deciding suitable women candidates for election. Sarah died in Cairo on 21 January 1908 whilst staying with her son."]}, {"page": "Louisa Mallet", "response": ["In November 1888 the Society for Promoting the Return of Women as County Councillors was formed by twelve women at Sarah Amos's house. The group included Elizabeth Lidgett and her sister Mary Bunting and it was led by Annie Leigh Browne. It was deciding suitable women candidates for election.", "Mallet, Annie Leigh Browne, Eva McLaren, the Marchioness of AberdeenJane Martin, ‘Browne, Annie Leigh (1851–1936)’, Oxford Dictionary of National Biography, Oxford University Press, 2004 accessed 12 Jan 2017 and Millicent Garret Fawcett were key members. In 1891 she stood unsuccessfully for the Lambeth school board. She lost bu only a small amount in an election where Emma Maitland lost her seat. In 1893 the society changed its name to Women's Local Government Society (WLGS), reflecting its wish to encourage women to be involved in politics and not exclusively in county councils. Mallet was at the International Congress of Women in 1899 and she served on the WLGS executive committee until 1901."]}]}}