{"wiki_id": "http://www.wikidata.org/entity/Q19324952", "itemLabel": "James Harington Evans", "itemDescription": "English religious controversialist", "wikipedia_url": "https://en.wikipedia.org/wiki/James_Harington_Evans", "wikipedia_page": {"main": "James Harington Evans (1785-1849) was ordained as a Church of England clergyman in 1810.  During his early years as a curate he suffered a crisis following the death of his first child.  One of his parishioners suggested he study a volume of sermons by the Rev John Hill (1711-46).  As he read his well-being improved and he started to question some of the doctrinal beliefs in the Church of England.  He shared these ideas with his congregation, causing a split in the community and was asked by his rector to leave.  Within a few years he became a Baptist minister and the pastor of John Street Chapel in Bloomsbury, where he remained for thirty years.  After his death it was said of him that, he was to be admired in almost everything except his Nonconformity.", "link_mentions": [{"page": "Baptist Wriothesley Noel", "response": ["The Reverend The Honourable Baptist Wriothesley Noel (Wells, J. C. Longman Pronunciation Dictionary. 3rd edition. Harlow: Pearson Education Limited, 2008. REYE-əths-lee; 16 July 1798 – 19 January 1873) was an English evangelical clergyman of aristocratic family. He was minister of St John's Chapel, Bedford Row, London, from 1827 to 1848,  In 1849 he  became a Baptist minister and pastor of the nearby John Street Baptist Church in Bloomsbury, following the death of the former pastor, James Harington Evans. Noel twice served as President of the Baptist Union. A portrait of him hangs outside the library of Regent's Park College, Oxford."]}, {"page": "James Evans", "response": ["*James Harington Evans (1785–1849), Church of England clergyman"]}, {"page": "Robert Chapman (pastor)", "response": ["In the same year he became a Christian after listening to the gospel preached by James Harington Evans in a nonconformist chapel in London. He prospered in his career and also spiritually and spent most of his spare time visiting and helping the poor of London."]}, {"page": "Robert Merttins Bird", "response": ["In 1833, Bird's sister, Elizabeth, married James Harington Evans, as his second wife. His daughter, Lucy Elizabeth (d.1835) was married to Sir Frederick Currie. In his will Bird made provision for five sons and three daughters.  His fourth son, James Grant Bird, had died in 1849."]}]}}