{"wiki_id": "http://www.wikidata.org/entity/Q19325713", "itemLabel": "Walter Bird", "itemDescription": "English photographer", "wikipedia_url": "https://en.wikipedia.org/wiki/Walter_Bird_(photographer)", "wikipedia_page": {"main": "Walter Bird (1903–1969) was a British photographer. Bird became known for his images of nudes and jointly set up a studio, Photo Centre Ltd., with John Everard and Horace Roye in 1939. From 1958 he was chief photographer for J. Russell & Sons, eventually purchasing the business in 1961. From 1958 to 1967 he was the official photographer for the National Photographic Record, initiated by the National Portrait Gallery to record important and influential citizens. He was a fellow of the Royal Photographic Society.", "link_mentions": [{"page": "List of photographers", "response": ["* Walter Bird (1903–1969)"]}, {"page": "John Everard (photographer)", "response": ["Everard had a studio in Orange Street, London and was self-taught. The book Second Sitting included photographs of a young Pamela Green. As early as 1939, Walter Bird, John Everard and Horace Roye had decided that they were giving each other too much competition. To resolve that difficulty they decided to cooperate, and they set up a company called Photo Centre Ltd. They made their headquarters in a suite of rooms above Walter Bird's studio in Savile Row, and Eves without Leaves was their first joint publication.", "* Eves Without Leaves - with Walter Bird and Roye (C. Arthur Pearson Ltd., London. 1940, 62pp)", "* More Eves Without Leaves - with Walter Bird and Roye (The Camera Studies Club, London. 1941, 42pp)"]}, {"page": "H&E naturist", "response": ["Over its long history, notable photographers such as Walter Bird, Stephen Glass, Bertram Park and Yvonne Gregory have worked for the magazine."]}, {"page": "Walter Stoneman", "response": ["In June 1897, he was the only one of fourteen photographers working for J. Russell & Sons who succeeded in taking four pictures of Queen Victoria in her golden state landau on the occasion of her diamond jubilee. Working for J. Russell & Sons, he took numerous photographs of royalty, aristocracy, members of high society and other prominent individuals.  By 1913 he became managing director of the firm, and after the death of John Lemmon Russell in 1915 he ran the company. In October 1932 it was absorbed into Elliott & Fry. In 1961, Walter Bird purchased Russell & Sons and became its leading photographer; he sold the company to Godfrey Argent in 1967.", "Up until his death Stoneman had been the sole official photographer for the NPR.  After his death, the NPR project continued with Walter Bird as photographer until 1967, when he was succeeded by Godfrey Argent who continued the project until it was stopped in 1970.  By then, the collections counted more than 10,000 photographs."]}, {"page": "Gerald Beadle", "response": ["His portrait, a 1961 photograph by Walter Bird, is in the National Portrait Gallery."]}, {"page": "Godfrey Argent", "response": ["He joined the photographic agency, Camera Press, founded by Tom Blau, who represented  Antony Armstrong-Jones, 1st Earl of Snowdon, Patrick Anson, 5th Earl of Lichfield, Cecil Beaton,  Norman Parkinson and Yousuf Karsh, the latter whom Argent admired the most. Argent had London studios in Queen's Gate and then in Holland Street in Kensington, where he became a celebrated photographer of prominent businessmen, families and soldiers. He also purchased the archives of prominent photographers Walter Bird and Baron."]}, {"page": "Jean Straker", "response": ["On 22 May 1958 the BBC Third Programme broadcast a discussion on Pin-ups and Figure Studies with Jean Straker and fellow photographers Jack Eston and Walter Bird.On the Air - Pamela Green"]}, {"page": "Walter Bird (1903-1969), Photographer", "response": ["#REDIRECT Walter Bird (photographer)"]}, {"page": "Walter Bird", "response": ["Walter Bird may refer to: ", "* Walter Bird (cricketer) (1854–1921), British cricketer", "* Walter Bird (footballer) (1891–1965), British footballer", "* Walter Bird (photographer) (1903–1969), British photographer", "* Walter Bird, founder of the American company Birdair in 1957"]}, {"page": "Joan Craven", "response": ["In the 1950s and 1960s, frustrated with the restrictions of advertising, she concentrated on figure photography, specialising in female nudes. She was described as \"[p]robably the most famous female exponent of figure photography today\", who \"paints her subjects in gleaming highlights and crisp shadows\", and she has been named as one of the three \"finest of the photographers of the female form\". During this period, she shared studios with Walter Bird at Kinocrat House on the Cromwell Road, London, and the notorious model Pamela Green posed for her. Her nude photographs gave her financial independence, appearing in publications including Men Only, Lilliput, Figure Quarterly and Modern Man. She also published articles to assist hopeful models, sitters and photographers. "]}, {"page": "Harvey Druitt", "response": ["* Portrait by Walter Bird (black and white, bromide print, 1965) in the National Portrait Gallery, London (reference no. NPG x167263)."]}, {"page": "Noël Hutton", "response": ["* One photographic portrait of Hutton (by Walter Bird, 1961) is kept in the National Portrait Gallery, London (reference no. NPGx168514)."]}, {"page": "Alan Stewart Orr", "response": ["Portraits of Orr by Walter Bird and Rex Coleman of Baron Studios are in the National Portrait Gallery.Sir Alan Stewart Orr by Walter Bird and Sir Alan Stewart Orr by Rex Coleman at npg.org.uk/collections/. Retrieved 22 March 2019"]}, {"page": "John Paul Wellington Furse", "response": ["In 1957, he had his portrait taken by Walter Bird, dressed in his Royal Navy uniform for the National Portrait Gallery archives."]}]}}