{"wiki_id": "http://www.wikidata.org/entity/Q1937530", "itemLabel": "Minotaur Shock", "itemDescription": "musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Minotaur_Shock", "wikipedia_page": {"main": "Minotaur Shock is the stage name of David Edwards, a Bristol-based electronica musician. His 2005 album Maritime was his first album released through 4AD Records, having previously released work via Manchester based Melodic. Edwards returned to Melodic for the release of his 2012 album, Orchard.He also plays drums in Bronze Age Fox, a band from the Hanham area of Bristol. Since 2010, he has also released music under the stage name Principal Participant.", "link_mentions": [{"page": "4AD", "response": ["* Minotaur Shock (active)"]}, {"page": "David Edwards", "response": ["*Minotaur Shock, stage name of David Edwards, British electronica musician"]}, {"page": "Phantom Power (Super Furry Animals album)", "response": ["*Minotaur Shock"]}, {"page": "Phantom Phorce", "response": ["*Minotaur Shock"]}, {"page": "Summer Sundae", "response": ["*Minotaur Shock"]}, {"page": "Hint (musician)", "response": ["To support the release of the album, Hint toured Europe as a DJ with Hexstatic and Pest. At 2003's Big Chill music festival Hint was joined on stage by Bonobo on bass and Minotaur Shock on drums, the trio performing under the banner \"The Hint Touring Band\". Both artists also contributed remixes to Hint's track \"Count Your Blessings\"."]}, {"page": "Lotte Kestner", "response": ["Williams grew up in Laguna Hills, California, and now lives in Seattle. She is featured on \"Hold Tight London\" from the Chemical Brothers' 2005 Grammy-winning album, Push the Button. She has collaborated with numerous other artists, including Mark Burgess, Courtney Marie Andrews, Robert Deeble, Damien Jurado, Anomie Belle, Motopony and Rocky Votolato, Arnar Guðjónsson of Leaves, Delerium, Minotaur Shock, Tuesday the Sky, Fieldhead, Sadistik and Blue Sky Black Death."]}, {"page": "Silent Alarm Remixed", "response": ["* \"Tulips\" (Minotaur Shock Remix) – 5:19 – hidden track begins at 5:21 of the last song on the UK and US editions and at 5:28 of the last song on the Japanese edition."]}, {"page": "Electric Picnic", "response": ["* Minotaur Shock"]}, {"page": "Maritime (album)", "response": ["Maritime is an album by Minotaur Shock, released in 2005 via 4AD. At Metacritic, which assigns a normalised rating out of 100 to reviews from mainstream critics, Maritime received an average score of 76, based on 15 reviews, indicating \"generally favorable reviews\".", "Category:Minotaur Shock albums"]}, {"page": "Helicopter (Bloc Party song)", "response": ["# \"Tulips\" (Minotaur Shock mix)"]}, {"page": "Grooves (magazine)", "response": ["* Minotaur Shock"]}, {"page": "Tulips (song)", "response": ["# \"Tulips\" (Minotaur Shock Mix)", "# \"Tulips\" (Minotaur Shock Mix)"]}, {"page": "Do You Trust Your Friends?", "response": ["#\"The Big Fight\" (Minotaur Shock) 4:50"]}, {"page": "David Edwards (electronica musician)", "response": ["#REDIRECT Minotaur Shock"]}, {"page": "Chiff-Chaffs and Willow Warblers", "response": ["Chiff-Chaffs and Willow Warblers is the debut album by Minotaur Shock, released in 2001.", "Category:Minotaur Shock albums"]}, {"page": "Rinse (album)", "response": ["Rinse is an album by Minotaur Shock, released in 2003.", "Category:Minotaur Shock albums"]}, {"page": "Melodic Records", "response": ["Melodic's first release was the debut EP from Pedro (aka James Rutledge) in 1999. Over the years the label has been active they have released records for the likes of Baikonour, Topo Gigio, Department of Eagles, The Isles, Outputmessage, Harrisons, ARMS, The Earlies, Micah P Hinson, the Nine Black Alps, Dungen, Minotaur Shock and Psapp.", "Label manager & founder David Cooper started in the industry at Pomona, a music PR company then based in Hebden Bridge. Before deciding to set up his own label to release the debut EP of ambient electronic musician Pedro. In its early years, the label went on to release singles and albums for electronic artists Minotaur Shock, L.Pierre (A guise of Arab Strap's Aidan Moffat) and Baikonour."]}, {"page": "List of 2021 albums (January–June)", "response": ["| Minotaur Shock"]}]}}