{"wiki_id": "http://www.wikidata.org/entity/Q19325627", "itemLabel": "Ethel Trew", "itemDescription": "(1869–1948), headmistress", "wikipedia_url": "https://en.wikipedia.org/wiki/Ethel_Trew", "wikipedia_page": {"main": "Ethel Trew (24 April 1869 – 7 December 1948) was a British headmistress.", "link_mentions": [{"page": "Queenswood School", "response": ["The school's origins were with \"The Educational Home for the Daughters of Wesleyan Ministers\" founded in Clapton, London in 1869. After a transfer to Clapham Park the school reopened with its current name in 1894. The head was Marion Waller and she was the daughter of the school's founder David Waller. Marion Waller arrived with Ethel Trew as her assistant. Waller left to marry in 1897 and Trew was persuaded to give up her own ambitions to lead the school. During the first world war the school raised money to fund an ambulance that was sent to Salonika."]}, {"page": "Enid Essame", "response": ["Ethel Trew at Queenswood gave her a job teaching. Trew's school in Hertfordshire was a private boarding school for girls and it had 240 students. By 1934 she had been identified as Trew's replacement as head of the school. The school paid for her to have a sabbatical and to obtain grants so that she could tour schools in the US and conduct research. She wrote up her observations as \"A Comparative Study of the Aims and Objectives of American and British Education for Girls\". She found that American schools allowed their girls more freedom and gave them less discipline than British schools. The girls were allowed more intellectual freedom and did not have such intensive character training. On the journey home she chanced to meet Baron Stamp who was the chair of the Queenswood governors. They spent many hours together planning the future of the school.", "Queenswood's original school building and the head's house burnt down in 1936 and they were replaced with a nearly identical building. Her boss Ethel Trew had many successes but she took too many years to retire. Essame turned down other offers of headships as she waited over ten years for Trew to begin to partially retire in 1944.  Even then Trew retained parts of the management including the school's estate. She had built herself a retirement home in the school grounds. Trew appointed a manager for the estate and he stole some of the school's money. Trew fully retired in 1948 and died shortly afterwards."]}]}}