{"wiki_id": "http://www.wikidata.org/entity/Q19325925", "itemLabel": "Madge Elliott", "itemDescription": "dancer", "wikipedia_url": "https://en.wikipedia.org/wiki/Madge_Elliott", "wikipedia_page": {"main": "Leah Madeleine (Madge) Elliott (12 May 1896 – 8 August 1955) was a UK born Australian dancer and actor who had success in a partnership with Cyril Ritchard.\n\n", "link_mentions": [{"page": "The Merry Widow", "response": ["The first American production opened on 21 October 1907 at the New Amsterdam Theatre on Broadway for another very successful run of 416 performances, and was reproduced by multiple touring companies across the US, all using the Hood/Ross libretto. It was produced by Henry Wilson Savage. The New York cast starred Ethel Jackson as Sonia and Donald Brian as Danilo. The operetta first played in Australia in 1908 using the Hood/Ross libretto. Since then, it has been staged frequently in English. It was revived in London's West End in 1923, running for 239 performances, and in 1924 and 1932. A 1943 revival ran for 302 performances. Most of these productions featured Graves as Popoff. Madge Elliott and Cyril Ritchard starred in the 1944 production, while June Bronhill and Thomas Round led the 1958 cast and recording. Lizbeth Webb and John Rhys Evans starred in a brief 1969 revival. Revivals were mounted in major New York theatres in 1921, 1929, 1931 and 1943–1944. The last of these starred Marta Eggerth and her husband Jan Kiepura, with sets by Howard Bay and choreography by George Balanchine. It ran for 322 performances at the Majestic Theatre and returned the next season at the New York City Center for another 32 performances.The Merry Widow, Internet Broadway Database, accessed 24 January 2016"]}, {"page": "East Ryde, New South Wales", "response": ["Hooker Rex retained the original name of the Dress Circle Estate and named the streets according to a theatrical theme. Some of the greatest Australian stars of stage and screen are commemorated in the street names of East Ryde.  Personalities commemorated include opera singers June Bronhill, Ronald Dowd and Dame Nellie Melba (Melba Avenue was formerly an extension of Twin Road); actors Diane Cilento, Peter Finch, Cecil Kellaway, John McCallum, Michael Pate and Madge Elliott; comedians Kitty Bluett, Roy Rene and Gladys Moncrieff; songwriter, entertainer and radio broadcasting pioneer Jack Lumsdaine; author and playwright Steele Rudd; and Peggy Sager, prima ballerina.  Heard Street (original name of Rene Street) was named after Henry Heard, a settler in 1858 and an alderman on the first Ryde Council in 1871. Mary Avenue (now Elliott Avenue) was named after Henry's wife, Mary Jane Heard. Twin Road (formerly Bridge Road, extended into today's Moncrieff Drive and Melba Drive) was named after Henry and Mary's twin daughters Laura and Mabel, who were born in 1873.The History of the Dress Circle Estate, John Hood (Ryde District Historical Society) 2010.Origins of the Street Names in the City of Ryde ."]}, {"page": "Gaiety Theatre, London", "response": ["Musicals continued at the Gaiety.  In 1929, Love Lies, by Stanley Lupino and Arthur Rigby, starring Cyril Ritchard and Madge Elliott, had a successful run at the theatre.  In the 1930s, the theatre played works such as Sporting Love (1934) by composer and pianist Billy Mayerl, also with Lupino, which ran for 302 performances.  The last show at the theatre was the farce Running Riot, in 1939."]}, {"page": "Going Up (musical)", "response": ["The musical was produced by George M. Cohan and Sam H. Harris and, after tryouts from November 15, 1917 in Atlantic City, New Jersey,\"Theatrical Notes\". The New York Times, November 2, 1917 it opened on  Broadway at the Liberty Theatre in New York on December 25, 1917.  It ran for 351 performances, directed by Edward Royce and James Montgomery, starring Edith Day and featuring the young Ed Begley.\"Going Up, 1917\". Internet Broadway Database, accessed May 13, 2011  A full-size biplane was used in the production, delighting audiences.\"Going Up Is Enjoyable\". The New York Times, December 26, 1917  The production ran through October 1918, and three companies were sent out to tour it.The Stage Yearbook 1919 Lionel Carson (ed.), The Stage, London, pp. 42 and 88  In the meantime, the musical was introduced to British audiences in Manchester, England, from May 13, 1918 before transferring to the Gaiety Theatre to London, opening on May 22, 1918, and running for an even more successful 574 performances.\"The Musicals\". British Musical Theatre website, accessed May 12. 2011  The London cast starred Joseph Coyne and Marjorie Gordon and featured Evelyn Laye.  Reviews were uniformly positive.See \"Gaiety - Going Up\", The Observer, May 26, 1918, p. 3; \"Prince's Theatre\", The Manchester Guardian, May 14, 1918, p. 4; and \"An Aerial Musical Comedy\", The Times, May 23, 1918, p. 3  In Australia, Cyril Ritchard and Madge Elliott starred in the piece in 1919.\"Cyril Ritchard\" masterworksbroadway.com, accessed May 13, 2011  The piece enjoyed various tours and revivals thereafter.\"1910-1920 Over There\". Talkinbroadway.com, 1998, accessed May 12, 2011"]}, {"page": "Sigh No More (musical)", "response": ["Sigh No More is a musical revue consisting of twenty-two scenes and numbers composed, written and produced by Noël Coward, with additional items by Joyce Grenfell, Richard Addinsell and Norman Hackforth.\"A Noel Coward Revue\", The Manchester Guardian, 12 July 1945; p. 3 The show was Coward's first post-World War II musical and starred Cyril Ritchard, his wife Madge Elliott and Joyce Grenfell.  It also featured Graham Payn, Coward's longtime partner, who sang the best-known song in the show, the wistful \"Matelot\"."]}, {"page": "Blue Mountain Melody", "response": ["Blue Mountain Melody's original production featuring Madge Elliott and Cyril Ritchard opened at the Theatre Royal in Sydney in September 1934. The production moved to Melbourne at His Majesty's Theatre in November 1934."]}, {"page": "Madge Elliott (dancer)", "response": ["#REDIRECT Madge Elliott"]}]}}