{"wiki_id": "http://www.wikidata.org/entity/Q193803", "itemLabel": "Roger Penrose", "itemDescription": "English mathematical physicist, recreational mathematician and philosopher", "wikipedia_url": "https://en.wikipedia.org/wiki/Roger_Penrose", "wikipedia_page": {"main": "Sir Roger Penrose  (born 8 August 1931) is a British mathematician, mathematical physicist, philosopher of science and Nobel Laureate in Physics. He is Emeritus Rouse Ball Professor of Mathematics at the University of Oxford, an emeritus fellow of Wadham College, Oxford, and an honorary fellow of St John's College, Cambridge, and University College London.Penrose has made contributions to the mathematical physics of general relativity and cosmology. He has received several prizes and awards, including the 1988 Wolf Prize in Physics, which he shared with Stephen Hawking for the Penrose–Hawking singularity theorems, and one half of the 2020 Nobel Prize in Physics \"for the discovery that black hole formation is a robust prediction of the general theory of relativity\".", "link_mentions": [{"page": "Atomic orbital", "response": ["Atomic orbitals may be defined more precisely in formal quantum mechanical language.  They are an approximate solution to the Schrodinger equation for the electrons bound to the atom by the electric field of the atom's nucleus. Specifically, in quantum mechanics, the state of an atom, i.e., an eigenstate of the atomic Hamiltonian, is approximated by an expansion (see configuration interaction expansion and basis set) into linear combinations of anti-symmetrized products (Slater determinants) of one-electron functions. The spatial components of these one-electron functions are called atomic orbitals. (When one considers also their spin component, one speaks of atomic spin orbitals.) A state is actually a function of the coordinates of all the electrons, so that their motion is correlated, but this is often approximated by this independent-particle model of products of single electron wave functions.Roger Penrose, The Road to Reality (The London dispersion force, for example, depends on the correlations of the motion of the electrons.)"]}, {"page": "August 8", "response": ["*1931 – Roger Penrose, English physicist, mathematician, and philosopher"]}, {"page": "Aeon", "response": ["Roger Penrose uses the word aeon to describe the period between successive and cyclic Big Bangs within the context of conformal cyclic cosmology."]}, {"page": "Anthropic principle", "response": ["Roger Penrose explained the weak form as follows:"]}, {"page": "Big Bang", "response": ["In 1968 and 1970, Roger Penrose, Stephen Hawking, and George F. R. Ellis published papers where they showed that mathematical singularities were an inevitable initial condition of relativistic models of the Big Bang. Then, from the 1970s to the 1990s, cosmologists worked on characterizing the features of the Big Bang universe and resolving outstanding problems. In 1981, Alan Guth made a breakthrough in theoretical work on resolving certain outstanding theoretical problems in the Big Bang theory with the introduction of an epoch of rapid expansion in the early universe he called \"inflation\". Meanwhile, during these decades, two questions in observational cosmology that generated much discussion and disagreement were over the precise values of the Hubble Constant and the matter-density of the universe (before the discovery of dark energy, thought to be the key predictor for the eventual fate of the universe)."]}, {"page": "Brian Aldiss", "response": ["* White Mars or, the Mind Set Free Little (1999, Little, Brown UK), (2000, St. Martin's), with Roger Penrose "]}, {"page": "Black hole", "response": ["At first, it was suspected that the strange features of the black hole solutions were pathological artifacts from the symmetry conditions imposed, and that the singularities would not appear in generic situations. This view was held in particular by Vladimir Belinsky, Isaak Khalatnikov, and Evgeny Lifshitz, who tried to prove that no singularities appear in generic solutions. However, in the late 1960s Roger Penrose and Stephen Hawking used global techniques to prove that singularities appear generically. For this work, Penrose received half of the 2020 Nobel Prize in Physics, Hawking having died in 2018. Based on observations in Greenwich and Toronto in the early 1970s, Cygnus X-1, a galactic X-ray source discovered in 1964, became the first astronomical object commonly accepted to be a black hole."]}, {"page": "Physical cosmology", "response": ["For a number of years, support for these theories was evenly divided. However, the observational evidence began to support the idea that the universe evolved from a hot dense state. The discovery of the cosmic microwave background in 1965 lent strong support to the Big Bang model, and since the precise measurements of the cosmic microwave background by the Cosmic Background Explorer in the early 1990s, few cosmologists have seriously proposed other theories of the origin and evolution of the cosmos. One consequence of this is that in standard general relativity, the universe began with a singularity, as demonstrated by Roger Penrose and Stephen Hawking in the 1960s."]}, {"page": "Inflation (cosmology)", "response": ["Guth described the inflationary universe as the \"ultimate free lunch\":Hawking (1998), p. 129.Wikiquote new universes, similar to our own, are continually produced in a vast inflating background. Gravitational interactions, in this case, circumvent (but do not violate) the first law of thermodynamics (energy conservation) and the second law of thermodynamics (entropy and the arrow of time problem). However, while there is consensus that this solves the initial conditions problem, some have disputed this, as it is much more likely that the Universe came about by a quantum fluctuation. Don Page was an outspoken critic of inflation because of this anomaly.; see also Roger Penrose's book The Road to Reality: A Complete Guide to the Laws of the Universe. He stressed that the thermodynamic arrow of time necessitates low entropy initial conditions, which would be highly unlikely. According to them, rather than solving this problem, the inflation theory aggravates it – the reheating at the end of the inflation era increases entropy, making it necessary for the initial state of the Universe to be even more orderly than in other Big Bang theories with no inflation phase.", "As pointed out by Roger Penrose from 1986 on, in order to work, inflation requires extremely specific initial conditions of its own, so that the problem (or pseudo-problem) of initial conditions is not solved:", ": \"Not only is bad inflation more likely than good inflation, but no inflation is more likely than either ... Roger Penrose considered all the possible configurations of the inflaton and gravitational fields. Some of these configurations lead to inflation ... Other configurations lead to a uniform, flat universe directly – without inflation. Obtaining a flat universe is unlikely overall. Penrose's shocking conclusion, though, was that obtaining a flat universe without inflation is much more likely than with inflation – by a factor of 10 to the googol power!\""]}, {"page": "Consciousness", "response": ["A few theoretical physicists have argued that classical physics is intrinsically incapable of explaining the holistic aspects of consciousness, but that quantum theory may provide the missing ingredients. Several theorists have therefore proposed quantum mind (QM) theories of consciousness. Notable theories falling into this category include the holonomic brain theory of Karl Pribram and David Bohm, and the Orch-OR theory formulated by Stuart Hameroff and Roger Penrose. Some of these QM theories offer descriptions of phenomenal consciousness, as well as QM interpretations of access consciousness. None of the quantum mechanical theories have been confirmed by experiment. Recent publications by G. Guerreshi, J. Cia, S. Popescu, and H. Briegel could falsify proposals such as those of Hameroff, which rely on quantum entanglement in protein. At the present time many scientists and philosophers consider the arguments for an important role of quantum phenomena to be unconvincing."]}, {"page": "Chinese room", "response": ["** John Preston and Mark Bishop, \"Views into the Chinese Room\", Oxford University Press, 2002. Includes chapters by John Searle, Roger Penrose, Stevan Harnad and Kevin Warwick."]}, {"page": "Church–Turing thesis", "response": ["#The universe is a hypercomputer, and it is possible to build physical devices to harness this property and calculate non-recursive functions. For example, it is an open question whether all quantum mechanical events are Turing-computable, although it is known that rigorous models such as quantum Turing machines are equivalent to deterministic Turing machines. (They are not necessarily efficiently equivalent; see above.) John Lucas and Roger Penrose have suggested that the human mind might be the result of some kind of quantum-mechanically enhanced, \"non-algorithmic\" computation.cf Also the description of \"the non-algorithmic nature of mathematical insight\", "]}, {"page": "Cosmic censorship hypothesis", "response": ["Singularities that arise in the solutions of Einstein's equations are typically hidden within event horizons, and therefore cannot be observed from the rest of spacetime. Singularities that are not so hidden are called naked. The weak cosmic censorship hypothesis was conceived by Roger Penrose in 1969 and posits that no naked singularities exist in the universe.", "thumb|Roger Penrose first formulated the cosmic censorship hypothesis in 1969.", "The hypothesis was first formulated by Roger Penrose in 1969, and it is not stated in a completely formal way. In a sense it is more of a research program proposal: part of the research is to find a proper formal statement that is physically reasonable, falsifiable, and that is sufficiently general to be interesting.  Because the statement is not a strictly formal one, there is sufficient latitude for (at least) two independent formulations, a weak form, and a strong form."]}, {"page": "Darwin's Dangerous Idea", "response": ["Chapter 15 asserts that Gödel's Theorem does not make certain sorts of artificial intelligence impossible. Dennett extends his criticism to Roger Penrose. The subject then moves on to the origin and evolution of morality, beginning with Thomas Hobbes (who Dennett calls \"the first sociobiologist\") and Friedrich Nietzsche. Translated by Walter Kaufmann [New York: Vintage, 1967]. He concludes that only an evolutionary analysis of ethics makes sense, though he cautions against some varieties of 'greedy ethical reductionism'. Before moving to the next chapter, he discusses some sociobiology controversies."]}, {"page": "England", "response": ["Prominent English figures from the field of science and mathematics include Sir Isaac Newton, Michael Faraday, Charles Darwin, Robert Hooke, James Prescott Joule, John Dalton, Lord Rayleigh, J. J. Thomson, James Chadwick, Charles Babbage, George Boole, Alan Turing, Tim Berners-Lee, Paul Dirac, Stephen Hawking, Peter Higgs, Roger Penrose, John Horton Conway, Thomas Bayes, Arthur Cayley, G. H. Hardy, Oliver Heaviside, Andrew Wiles, Edward Jenner, Francis Crick, Joseph Lister, Joseph Priestley, Thomas Young, Christopher Wren and Richard Dawkins. Some experts claim that the earliest concept of a metric system was invented by John Wilkins, the first secretary of the Royal Society, in 1668."]}, {"page": "Many-worlds interpretation", "response": ["Roger Penrose argues that the idea is flawed because it is based on an oversimple version of quantum mechanics that does not account for gravity. In his view, applying conventional quantum mechanics to the universe implies the MWI, but the lack of a successful theory of quantum gravity negates the claimed universality of conventional quantum mechanics. According to Penrose, \"the rules must change when gravity is involved\". He further asserts that gravity helps anchor reality and \"blurry\" events have only one allowable outcome: \"electrons, atoms, molecules, etc., are so minute that they require almost no amount of energy to maintain their gravity, and therefore their overlapping states. They can stay in that state forever, as described in standard quantum theory\". On the other hand, \"in the case of large objects, the duplicate states disappear in an instant due to the fact that these objects create a large gravitational field\".", "According to Martin Gardner, the \"other\" worlds of MWI have two different interpretations: real or unreal; he claimed that Stephen Hawking and Steven Weinberg both favour the unreal interpretation. Gardner also claimed that most physicists favour the unreal interpretation, whereas the \"realist\" view is supported only by MWI experts such as Deutsch and DeWitt. Gardner reports Hawking saying that MWI is \"trivially true\". In a 1983 interview, Hawking also said he regarded MWI as \"self-evidently correct\" but was dismissive of questions about the interpretation of quantum mechanics, saying, \"When I hear of Schrödinger's cat, I reach for my gun.\" In the same interview, he also said, \"But, look: All that one does, really, is to calculate conditional probabilities—in other words, the probability of A happening, given B. I think that that's all the many-worlds interpretation is. Some people overlay it with a lot of mysticism about the wave function splitting into different parts. But all that you're calculating is conditional probabilities.\" Elsewhere Hawking contrasted his attitude towards the \"reality\" of physical theories with that of his colleague Roger Penrose, saying, \"He's a Platonist and I'm a positivist. He's worried that Schrödinger's cat is in a quantum state, where it is half alive and half dead. He feels that can't correspond to reality. But that doesn't bother me. I don't demand that a theory correspond to reality because I don't know what it is. Reality is not a quality you can test with litmus paper. All I'm concerned with is that the theory should predict the results of measurements. Quantum theory does this very successfully.\""]}, {"page": "Entropy", "response": ["If the universe can be considered to have generally increasing entropy, then – as Roger Penrose has pointed out – gravity plays an important role in the increase because gravity causes dispersed matter to accumulate into stars, which collapse eventually into black holes. The entropy of a black hole is proportional to the surface area of the black hole's event horizon. Jacob Bekenstein and Stephen Hawking have shown that black holes have the maximum possible entropy of any object of equal size. This makes them likely end points of all entropy-increasing processes, if they are totally effective matter and energy traps. However, the escape of energy from black holes might be possible due to quantum activity (see Hawking radiation)."]}, {"page": "General relativity", "response": ["Aware of the importance of causal structure, Roger Penrose and others developed what is known as global geometry. In global geometry, the object of study is not one particular solution (or family of solutions) to Einstein's equations. Rather, relations that hold true for all geodesics, such as the Raychaudhuri equation, and additional non-specific assumptions about the nature of matter (usually in the form of energy conditions) are used to derive general results. and "]}, {"page": "Golden ratio", "response": ["The zome construction system, developed by Steve Baer in the late 1960s, is based on the symmetry system of the icosahedron/dodecahedron, and uses the golden ratio ubiquitously. Between 1973 and 1974, Roger Penrose developed Penrose tiling, a pattern related to the golden ratio both in the ratio of areas of its two rhombic tiles and in their relative frequency within the pattern. This led to Dan Shechtman's early 1980s discovery of quasicrystals, some of which exhibit icosahedral symmetry."]}]}}