{"wiki_id": "http://www.wikidata.org/entity/Q1937511", "itemLabel": "Ffyona Campbell", "itemDescription": "British woman who was the first woman to walk around the world", "wikipedia_url": "https://en.wikipedia.org/wiki/Ffyona_Campbell", "wikipedia_page": {"main": "Ffyona Campbell (born 1967 in Totnes, Devon) is an English long distance walker who walked around the world. She covered 32,000 kilometres (20,000 mi) over 11 years and raised £180,000 for charity. She wrote about her experience in a series of three books.", "link_mentions": [{"page": "Janet Street-Porter", "response": ["A rambler, Street-Porter was president of the Ramblers' Association for two years from 1994. She walked across Britain from Dungeness in Kent to Conwy in Wales for the television series Coast to Coast in 1998. Street-Porter also walked from Edinburgh to London in a straight line in 1998, for a television series and her book, As the Crow Flies.As the Crow Flies, Metro Books, London (1998)  In 1994, for the documentary series The Longest Walk, Street-Porter visited long-distance walker Ffyona Campbell on the last section of her round-the-world walk."]}, {"page": "Radio Academy Awards", "response": ["|In the Psychiatrists Chair: Ffyona Campbell"]}, {"page": "Campbell (surname)", "response": ["* Ffyona Campbell, British woman who was the first woman to walk around the world"]}, {"page": "List of people who have walked across Australia", "response": ["! scope=\"row\" | Ffyona Campbell", "Roger Scott departed from Darwin for Dover on 6 August 1988, raising funds for the Top End Life Education Centre and the NT Spastics Association. He walked via Kununurra and Halls Creek, arriving at the Eyre Bird Observatory on the southern coast of South Australia on 22 September 1988 where he encountered Ffyona Campbell on her walk across Australia. He then proceeded on to Adelaide, before catching a flight to Devonport and walking to Dover. He completed the walk in 109 days, and traversed the Great Sandy Desert, Gibson Desert, Great Victoria Desert, and Nullarbor Plain on his journey.", "===Ffyona Campbell===", "Starting from John O'Groats on the northernmost coast of Scotland in 1983, then 16-year-old Ffyona Campbell set out to walk around the world. She departed from Sydney on 11 September 1988, and arrived in Fremantle on 14 December 1988 – a journey lasting 95 days. She completed the journey with David Richard, who acted as her support crew and who waited for her every 10 miles."]}, {"page": "List of pedestrian circumnavigators", "response": ["| Ffyona Campbell ||  || 20,000 miles || First woman claiming to walk around the world. Later she admitted to taking transport on one stretch in USA whilst ill and having to fulfill sponsors' demands. She later returned to walk that stretch. Her walk was carried out in stages and does not fulfill circumnavigation criteria."]}]}}