{"wiki_id": "http://www.wikidata.org/entity/Q1931081", "itemLabel": "Michael Costa", "itemDescription": "Italian conductor and composer", "wikipedia_url": "https://en.wikipedia.org/wiki/Michael_Costa_(conductor)", "wikipedia_page": {"main": "Sir Michael Andrew Angus Costa (14 February 1808 – 29 April 1884) was an Italian-born conductor and composer who achieved success in England.", "link_mentions": [{"page": "February 14", "response": ["*1808 – Michael Costa, Italian-English conductor and composer (d. 1884)"]}, {"page": "Don Carlos", "response": ["However, the Italian translation was first performed not in Italy but in London at the Royal Opera House, Covent Garden on 4 June 1867 (now the Royal Opera House), where it was produced and conducted by Michael Costa. However, it was not as Verdi desired; the opera was given in a cut and altered form, with the first act being removed, the ballet in Act 3 being omitted, and Carlo's aria Io la vidi (originally in Act 1) being moved to Act 3, just before the terzetto. Additionally, the duet between Philip and the Inquisitor was shortened by four lines, and Elisabeth's aria in Act 5 consisted only of part of the middle section and the reprise."]}, {"page": "Jacques Offenbach", "response": ["Among the salons at which Offenbach most frequently appeared was that of the comtesse de Vaux. There he met Hérminie d'Alcain (1827–1887), the daughter of a Carlist general.Faris, p. 28 They fell in love, but he was not yet in a financial position to propose marriage.Gammond, p. 28 To extend his fame and earning power beyond Paris, he undertook tours of France and Germany. Among those with whom he performed were Anton Rubinstein and, in a concert in Offenbach's native Cologne, Liszt. In 1844, probably through English family connections of Hérminie,Harding, p. 39 he embarked on a tour of England. There, he was immediately engaged to appear with some of the most famous musicians of the day, including Mendelssohn, Joseph Joachim, Michael Costa and Julius Benedict. The Era wrote of his debut performance in London, \"His execution and taste excited both wonder and pleasure, the genius he exhibited amounting to absolute inspiration.\"\"Madame Puzzi's Concert\", The Era, 19 May 1844, p. 5 The British press reported a triumphant royal command performance; The Illustrated London News wrote, \"Herr Jacques Offenbach, the astonishing Violoncellist, performed on Thursday evening at Windsor before the Emperor of Russia, the King of Saxony, Queen Victoria, and Prince Albert with great success.\"The Illustrated London News, 8 June 1844, p. 370 The use of \"Herr\" rather than \"Monsieur\", reflecting the fact that Offenbach remained a Prussian citizen, was common to all the British press coverage of Offenbach's 1844 tour.\"Varieties\", The Manchester Guardian 12 June 1844, p. 5; and \"Madame Dulcken's Concert\", The Times, 12 June 1844, p. 7 The ambiguity of his nationality sometimes caused him difficulty in later life."]}, {"page": "City of Birmingham Symphony Orchestra", "response": ["The earliest orchestral concerts known to have taken place in Birmingham were those organised by Barnabas Gunn at the Moor Street Theatre in 1740, and more than 20 separate orchestras are recorded as having existed in the city between that date and the foundation of what is now the CBSO in 1920. These orchestras often owed their origins to Birmingham's internationally significant tradition of choral music, that give birth to works such as Mendelsohn's Elijah and Elgar's Dream of Gerontius, and in 1834 saw the building Birmingham Town Hall, one of Europe's earliest large-scale concert halls. Birmingham's most notable early orchestra was the Birmingham Festival Orchestra, which formed as a group of 25 musicians in 1768 but by 1834 had grown into an orchestra of 147. Under Michael Costa and Hans Richter between 1849 and 1909 it included some of the leading instrumentalists of its day from across Britain and Europe, but remained an ad hoc grouping that assembled to play only at the three-yearly festivals. The town's first permanently established orchestra of locally based professional musicians was William Stockley's Orchestra, which was founded in 1856 and held annual concert seasons between 1873 and 1897. This was eclipsed as the city's leading orchestra at the end of the 19th century by George Halford's Orchestra, which put on similar series of concerts between 1897 and 1909."]}, {"page": "Beard", "response": ["* Neckbeard (a.k.a. Neard, a portmanteau of \"neck\" and \"beard\"): similar to the chinstrap, but with the chin and jawline shaven, leaving hair to grow only on the neck. While never as popular as other beard styles, a few noted historical figures have worn this type of beard, such as Nero, Horace Greeley, Henry David Thoreau, William Empson, Peter Cooper, Moses Mendelssohn, Richard Wagner, and Michael Costa."]}, {"page": "Royal College of Music", "response": ["Under Sullivan, a reluctant and ineffectual principal, the NTSM failed to provide a satisfactory alternative to the Royal Academy and, by 1880, a  committee of examiners comprising Charles Hallé, Sir Julius Benedict, Sir Michael Costa, Henry Leslie and Otto Goldschmidt reported that the school lacked \"executive cohesion\". The following year Sullivan resigned and was replaced by John Stainer. In his 2005 study of the NTSM, Wright comments:"]}, {"page": "1884 in music", "response": ["*April 29 – Michael Costa, conductor and composer"]}, {"page": "1808 in music", "response": ["*February 14 – Michael Costa, Italian-born conductor and composer (died 1884)"]}, {"page": "Royal Opera House", "response": ["The Theatres Act 1843 broke the patent theatres' monopoly of drama. At that time Her Majesty's Theatre in the Haymarket was the main centre of ballet and opera but after a dispute with the management in 1846 Michael Costa, conductor at Her Majesty's, transferred his allegiance to Covent Garden, bringing most of the company with him. The auditorium was completely remodeled after an 1846 fire, during the following 1846–47 seasons, the company performed at the Lyceum Theatre.\"Madame Parepa-Rosa\", Illustrated London News, 7 February 1874, p. 129; and Obituary: \"Madame Parepa Rosa\", The Times, 23 January 1874, p. 10 The theatre reopened as the Royal Italian Opera on 6 April 1847 with a performance of Rossini's Semiramide.History  (Royal Opera House) accessed 18 December 2012."]}, {"page": "William Sterndale Bennett", "response": ["In 1837 Bennett began to teach at the RAM, with which he was associated for most of the rest of his life. For twenty years he taught there, later also teaching at Queen's College, London. Amongst his pupils during this period were Arthur Sullivan, Hubert Parry, and Tobias Matthay. Throughout the 1840s and 1850s he composed little, although he performed as a pianist and directed the Philharmonic Society for ten years. He also actively promoted concerts of chamber music. From 1848 onwards his career was punctuated by antagonism between himself and the conductor Michael Costa.", "From 1842 Bennett had been a director of the Philharmonic Society of London. He helped to relieve the society's perilous finances by persuading Mendelssohn and Spohr to perform with the Society's orchestra, attracting full houses and much-needed income.Bennett (1907), p. 162. In 1842 the orchestra, under the composer's baton, gave the London premiere of Mendelssohn's Third (Scottish) Symphony, two months after its world premiere in Leipzig.\"The Philharmonic Society\", The Times, 13 June 1842, p. 5 In 1844 Mendelssohn conducted the last six concerts of the society's season, in which among his own works and those of many others he included music by Bennett.\"Philharmonic Society\", The Times, 11 June 1844, p. 5. From 1846 to 1854 the Society's conductor was Michael Costa, of whom Bennett disapproved; Costa was too devoted to Italian opera and not a partisan of the German masters, as was Bennett. Bennett wrote to Mendelssohn on 24 July, displaying some querulousness, \"The Philharmonic Directors have engaged Costa ... with which I am not very well pleased, but I could not persuade them to the contrary, and am tired of quarrelling with them. They are a worse set this year than we have ever had.\"Bennett (1907), p. 168.", "thumb|upright=0.8|alt=photograph of middle-aged man with bushy sideboards facing spectator, in jacket, waistcoat and bowtie|Michael Costa – photograph c. 1855"]}, {"page": "Concert pitch", "response": ["British attempts at standardisation in the 19th century gave rise to the old philharmonic pitch standard of about A = 452 Hz (different sources quote slightly different values), replaced in 1896 by the considerably \"deflated\" new philharmonic pitch at A = 439 Hz. The high pitch was maintained by Sir Michael Costa for the Crystal Palace Handel Festivals, causing the withdrawal of the principal tenor Sims Reeves in 1877,J. Sims Reeves, The Life of Sims Reeves, written by himself (Simpkin Marshall, London 1888), 242–252. though at singers' insistence the Birmingham Festival pitch was lowered (and the organ retuned) at that time. At the Queen's Hall in London, the establishment of the diapason normal for the Promenade Concerts in 1895 (and retuning of the organ to A = 435.5 at 15 °C (59 °F), to be in tune with A = 439 in a heated hall) caused the Royal Philharmonic Society and others (including the Bach Choir, and the Felix Mottl and Arthur Nikisch concerts) to adopt the continental pitch thereafter.H.J. Wood, My Life of Music (Gollancz, London 1938) Chapters XIV and XV."]}, {"page": "Alexander Mackenzie (composer)", "response": ["Mackenzie wished to continue his violin studies with the teacher Prosper Sainton, who had taught his father, and in 1862 he successfully applied for admission to the Royal Academy of Music in London, where Sainton taught.  His other tutors were the principal, Charles Lucas (harmony), and Frederick Bowen Jewson (piano).Barker, Duncan J. \"Mackenzie, Sir Alexander Campbell\", Grove Music Online (requires subscription), accessed 27 September 2009 Shortly after starting at the Academy, he was awarded a King's Scholarship, the income from which Mackenzie augmented by playing in theatre and music hall pit-bands, as well as in classical concerts under the leading conductor Michael Costa.The Times obituary, 29 April 1935, p. 16 This sometimes caused him to neglect his academic work, and on one occasion, having failed to prepare a piece by a classical composer for a piano examination, he improvised, \"starting off in A minor and taking care to end in the same key\", and convinced the examiners that it was a little-known work by Schubert. Recalling this prank in his old age, he added, \"I have never ceased to wonder at my escape, and would certainly not advise any student to run a similar risk today.\" Some of Mackenzie's early compositions were performed at the Academy."]}, {"page": "Charles Santley", "response": ["After an audition with Michael Costa, he sang in Mendelssohn's St. Paul in Manchester under Charles Hallé,  and in March 1858 he first sang Mendelssohn's Elijah (at Exeter Hall, Liverpool), of which he became a leading interpreterWilliam Ludwig's conception of Elijah was considered nobler by some, see Henry Wood, My Life of Music, p. 17. for over 50 years. From the first, he was given firm encouragement by Sims Reeves and Clara Novello, and by Mario and Grisi, with whom he sang on various occasions. At the inauguration of the original Leeds Festival of autumn 1858 he was the star performer (with Willoughby Weiss) in Rossini's Stabat Mater . In the autumn of 1859 he was singing items from St Paul, Judas Maccabaeus and Messiah at the Bradford Festival, shortly before embarking on his initial operatic season.", "The year 1863 saw his first appearance at the Worcester and Norwich festivals: at Worcester he sang in Schachner's new work Israel's return from Babylon, and at Norwich he introduced Julius Benedict's Richard Coeur de Lion, a great success. In April 1864 he sang in  Handel's Messiah, and in a miscellaneous concert, at Stratford-upon-Avon for the Shakespeare centenary festival. At the Hereford Festival he sang the second part of The Creation, an English version of Rossini's Stabat Mater and Benedict's Richard. At the Birmingham festival of 1864 was given Michael Costa's new work Naaman, where (as Elisha) he sang opposite Sims Reeves and the young Adelina Patti (then making her first appearance in oratorio).S. Reeves, The Life of Sims Reeves, Written by Himself (Simpkin, Marshall, London 1888), p. 217-218. Santley also appeared there in Messiah and Arthur Sullivan's The Masque at Kenilworth.", "For the season of 1861–62, Santley returned to Covent Garden, opening in Howard Glover's Ruy Blas (as Don Sallust, Harrison as Ruy Blas), then in a re-cast version of Robin Hood, and finally in Balfe's The Puritan's Daughter. He also created the role of 'Danny Man' in Julius Benedict's The Lily of Killarney, which was performed nightly for five or six weeks. Worn out by this busy season, Santley decided to turn his attention to Italian opera, and, armed with a letter from Michael Costa, paid a visit to Rossini in Paris. This meeting proved disappointing; but he made an Italian début at Covent Garden in 1862 when he sang the role of di Luna in Il trovatore for three nights at Covent Garden, 'in place of Graziani, to oblige Mr. Gye':Santley, 'The Art of Singing' (1908), p. 18. that was with the English soprano Fanny Gordosa, Constance Nantier-Didiée, the Italian dramatic tenor Enrico Tamberlik and the Franco-Italian bass-baritone Joseph Tagliafico. Santley's performances were received rapturously by the Covent Garden audience."]}, {"page": "John Tiplady Carrodus", "response": ["On his return to Britain in 1853 Sir Michael Costa got him engagements in the leading orchestras. He was a member of the Covent Garden opera orchestra from 1855, made his debut as a solo player at a concert given on 22 April 1863 by the Musical Society of London, and succeeded Prosper Sainton as leader at Covent Garden in 1869."]}, {"page": "Her Majesty's Theatre", "response": ["Laporte died suddenly, and Benjamin Lumley took over the management in 1842, introducing London audiences to Donizetti's late operas, Don Pasquale and La fille du régiment. Initially, relations between Lumley and Michael Costa, the principal conductor at Her Majesty's were good. Verdi's Ernani, Nabucco and I Lombardi received their British premieres in 1845–46, and Lumley commissioned I masnadieri from the composer. This opera received its world premiere on 22 July 1847, with the Swedish operatic diva Jenny Lind in the role of Amalia, and the British premieres of two more Verdi operas, I due Foscari and Attila, followed in 1847–48. Meanwhile, the performers had continued to feel neglected and the disputes continued. In 1847, Costa finally transferred his opera company to the Theatre Royal, Covent Garden, and the theatre relinquished the sobriquet, 'Italian Opera House', to assume its present title, Her Majesty's Theatre.Discover the History of the Royal Opera House.  Royal Opera House, accessed 18 December 2007."]}, {"page": "Michael Andrew Agnus Costa", "response": ["#REDIRECT Michael Costa (conductor)"]}, {"page": "The Royal Opera", "response": ["From the mid-19th century, opera had been presented on the site of Covent Garden's Royal Opera House, at first by Michael Costa's Royal Italian Opera company.\"History\" , Royal Opera House. Retrieved 17 December 2012 After a fire, the new building opened in 1858 with The Royal English Opera company, which moved there from the Theatre Royal, Drury Lane.\"Drury-Lane Theatre\", The Times, 13 December 1858, p. 10 From the 1860s until the Second World War, various syndicates or individual impresarios presented short seasons of opera at the Royal Opera House (so named in 1892), sung in the original language, with star singers and conductors. Pre-war opera was described by the historian Montague Haltrecht as \"international, dressy and exclusive\".Haltrecht, p.18 During the war, the Royal Opera House was leased by its owners, Covent Garden Properties Ltd, to Mecca Ballrooms who used it profitably as a dance hall.Haltrecht, p. 51 Towards the end of the war, the owners approached the music publishers Boosey and Hawkes to see if they were interested in taking a lease of the building and staging opera (and ballet) once more. Boosey and Hawkes took a lease, and granted a sub-lease at generous terms to a not-for-profit charitable trust established to run the operation.Haltrecht, pp. 52 and 58 The chairman of the trust was Lord Keynes."]}, {"page": "Niccolò Antonio Zingarelli", "response": ["In 1829, aged 80, he wrote a \"Cantata Sacra\", based on Isaiah Chapter 12 for the Birmingham Music Festival. This was the occasion for the memorably inauspicious début of his protégé and representative Michael Costa, aged 19. The intention was that Costa should rehearse and conduct the work; but J. B Cramer and Thomas Greatorex elbowed him out and was instead engaged as a tenor soloist in another concert. Unfortunately both the work and Costa's singing met with ferocious criticism: \"[This cantata] is one of the most tame, insipid things we were ever doomed to hear: a heap of common-place trash from the first to the last note. After twaddling in B flat for half-an-hour, he ventures for a few bars into F, then returns to B, and there is an end.\" \"As a singer [Costa] is far below mediocrity, and he does not compensate for his vocal deficiencies by his personal address, which is abundantly awkward. In the theatre while singing the air \"Nel furor delle tempeste,\" [from Bellini's Il pirata] and accompanying himself, he had a narrow escape. The tempests proved contagious, and were beginning to manifest themselves in the galleries, and had he remained but a few moments longer on the stage, he would have witnessed a storm compared to which the roarings of his own Vesuvius would have seemed but a murmur.\" (Free to read on JSTOR with free registration)"]}, {"page": "Sir Michael Costa", "response": ["#Redirect  Michael Costa (conductor)"]}, {"page": "Henry Chorley", "response": ["In addition to criticism for journals, Chorley wrote voluminously on literature and art.  His non-fiction books were widely read and included Music and Manners in France and Germany (1841), which includes a detailed description of contemporary opera in Paris and Felix Mendelssohn's career in Leipzig, Germany.  He expanded the German section of this book and published it 1854 as Modern German Music.\"Modern German Music – Recollections and Criticisms\", The Times review, 25 April 1854, p. 8, col. B His masterpiece was Thirty Years' Musical Recollections (1862), which covers, year-by-year, the opera seasons of European operas in London between 1830 and 1859.  In the work, he blames the autocratic manager of Her Majesty's Theatre, Benjamin Lumley, for a decline in the quality of performances there.  On the other hand, he praises the efforts of Giulia Grisi, Mario and Michael Costa, together with a group of journalists (including himself), for successfully creating the Royal Italian Opera at Covent Garden in 1847. He also wrote the well-received Memorials of Mrs. Hemans (1836), Handel Studies (1859), an annotated edition Mary Russell Mitford's letters (2 vols., 1872) and The National Music of the World (1882)."]}, {"page": "Prosper Sainton", "response": ["In 1844 he made his first appearance in England, at a Philharmonic concert directed by Mendelssohn. Settling in London, he was in 1845 appointed professor at the Royal Academy of Music. In the early organizations for chamber music which culminated in the establishment of the popular concerts, Sainton bore an important part; and when the Royal Italian Opera was started at Covent Garden, he led the orchestra under Michael Costa, with whom he migrated to Her Majesty's Theatre in 1871."]}, {"page": "Cesare Pugni", "response": ["*La Fille de marbre (Paris production of Perrot's Alma). Choreography by A. Saint-Léon. Music by Michael Costa, adapted by Pugni. 20 October 1847."]}, {"page": "Classical music of the United Kingdom", "response": ["The works of Handel, Mendelssohn and Spohr continued to be a major part of the British musical repertoire but there was an increasing emphasis on religious drama. The Italian-born Sir Michael Costa's Eli (1855) and Naaman (1864) set the pace for the later development in the works of Sullivan, including The Martyr of Antioch (1880) The Light of the World (1873), and The Golden Legend (1886), John Liptrot Hatton's Hezekiah (1877), Joseph Barnby's Rebekah (1870), William Cusins's Gideon (1871), Alfred R. Gaul's The Holy City (1882), Charles Gounod's Redemption (1882) and Mors et Vita (1885) (produced expressly for the British public), and Sir John Stainer's The Crucifixion (1887).H. E. Smither, A History of the Oratorio: the Oratorio in the Nineteenth and Twentieth Centuries (UNC Press, 2000), p. 311. Arguably the last of the great English Victorian composers to emerge was Edward Elgar (1857–1934), who during the 1890s produced his Caractacus and King Olaf cantatas, the Enigma Variations in 1899, and the revolutionary Dream of Gerontius in 1900.J. N. Moore, Edward Elgar: a Creative Life (Oxford: Oxford University Press, 1999)."]}, {"page": "Thérèse Tietjens", "response": ["When the Gye and Mapleson companies were successfully merged, in 1871, Tietjens was the one principal artist not re-engaged by George Wood. However, Lucrezia had remained a staple of her repertoire throughout the 1860s, and in May 1872 she again led a cast, on this occasion at Drury Lane, for the London debut of the tenor Italo Campanini (as Gennaro), with Trebelli as Orsino and the French baritone Jean-Baptiste Faure as Alfonso, under the baton of Sir Michael Costa. She also took the solos in Sullivan's Festival Te Deum at The Crystal Palace.", "Late in her life Mme Tietjens developed cancer, which caused her much pain, and she died at the age of 46. By this stage, she had become a sort of British institution, and under Sir Michael Costa she sang many performances of Handel's Messiah and Mendelssohn's Elijah—both works dear to the taste of London concert-goers. She also grew extremely large: in 1920, the veteran American baritone David Bispham could recall her appearance but not her voice. Shaw, in 1892, remembered how her performances of Lucrezia, of Semiramide, Valentine, Pamina and her Countess had established a sort of belief that all these characters must have been extremely overweight. Despite her bearing, her intelligence, her great art and her goodhearted grace, he remembered a voice that had become stale and a genius that had ceased to be creative. The public had got used to going to see her, not the roles she performed. She had become loved for her private virtues as much as for her artistic gifts."]}, {"page": "Benjamin Lumley", "response": ["The conductor at Her Majesty's was Michael Costa. By their different natures – one a devotee of high musical standards, the other a connoisseur of the star system, Lumley and Costa should have made a perfect team. Indeed they were so for the first five years, one of the longer surviving partnerships of the age. Artistic progress, induced by Lumley, against the inclinations of the more conservative Costa, included the introduction of operas by Giuseppe Verdi to London and of new stars of song and dance, negotiations with Felix Mendelssohn for an opera on William Shakespeare's The Tempest, and in 1847 the London debut of Jenny Lind. The resulting financial success led the optimistic Lumley to purchase the underlying lease of the theatre."]}, {"page": "Don Carlos (play)", "response": ["* 1844 opera by Michael Costa (libretto Leopold Tarentini, London)"]}, {"page": "John Goulden", "response": ["After retiring from the Diplomatic Service, Goulden began to pursue his interest in the revolution in musical performance during the early nineteenth century and the role in this of the conductor and composer Michael Costa.Michael Costa: England's First Conductor by John Goulden, Ashgate Publishing He was awarded a PhD degree in musicology by Durham University in 2012. His PhD thesis was Michael Costa, England's First Conductor: The Revolution in Musical Performance in England, 1830–1880Michael Costa, England’s First Conductor: The Revolution in Musical Performance in England 1830–80 (2012) – Durham e-Theses and his book with the same title was published in 2015.", "*Michael Costa: England's First Conductor: The Revolution in Musical Performance in England, 1830–1880 (Ashgate, 2015). "]}, {"page": "The Masque at Kenilworth", "response": ["Sullivan and Chorley then began collaborating on songs and other works.Ainger, p. 56 In 1863, Sullivan and Chorley were collaborating on an opera, The Sapphire Necklace, that they had hoped would be produced by the Royal Italian Opera House at Covent Garden. Sullivan met the music director of the opera house, Sir Michael Costa, seeking to cultivate a relationship with the important conductor. He expressed his eagerness to learn all that he could about opera and asked to attend rehearsals. Costa hired Sullivan as an organist at Covent Garden.Ainger, p. 57", "Costa also began to send composing commissions to Sullivan. In 1864, at the recommendation of Costa, who was also chief conductor of the triennial Birmingham Musical Festival, Sullivan received a commission to write a cantata for the Festival. At the time, Sullivan and Chorley had submitted The Sapphire Necklace to the Royal Opera House, but the opera was turned down. Instead, Costa, perhaps in consolation for rejecting the opera, arranged for Chorley to write the libretto for the masque.Shepherd, Marc.  Sullivan: 'The Masque at Kenilworth' – Music for Royal and National Occasions , The Gilbert and Sullivan Discography, 24 December 2003, accessed 2 July 2014 Chorley's libretto draws on the description in the 1821 novel Kenilworth, by Sir Walter Scott, of the visit of Queen Elizabeth and her 400-member entourage to Kenilworth Castle in 1575. The libretto also draws on other contemporary accounts and fiction. Chorley noted in his preface to the libretto that his \"fancy was directed\" to the subject matter not only for its \"local interest\" (Kenilworth is near Birmingham), but because he had long enjoyed Scott's \"wondrously musical, but as wondrously simple\" description of Elizabeth's arrival for the masque. Chorley does not allude to it, but Michael Costa had composed a ballet on the subject of Kenilworth in 1831.Profile of Costa"]}, {"page": "Frederick Bridge", "response": ["Bridge first participated in a great national commemoration in 1852, when, aged eight, he was allowed to help toll the cathedral bell to mark the death of the Duke of Wellington. When Bridge was nine, he and his father were members of the choir assembled by Michael Costa for the opening of the Crystal Palace in June 1854. At the age of 14 Bridge left the cathedral choir and was apprenticed to John Hopkins, organist of Rochester Cathedral. While still studying under Hopkins, Bridge was appointed organist of the village church of Shorne in 1851, and the following year moved to Strood Parish Church. From 1863 to 1867 he studied composition with John Goss, professor of harmony at the Royal Academy of Music. Bridge said in 1897, \"Very happy and improving lessons they were and it is impossible for me to over-estimate the value of the instruction given by that dear, simple-minded musician.\""]}, {"page": "Michael Head (composer)", "response": ["After the war, Head resumed his studies at the Academy.  He studied composition with Frederick Corder, piano with T B Knott and organ with Reginald Steggall.  He won the Sir Michael Costa scholarship for composition.  He also won other awards for composition, sight singing and harmony. In 1924, Head was made an Associate of the Royal Academy of Music. Two years later, he took up a post at Bedales School, Petersfield, where he taught for three years."]}, {"page": "Faust (ballet)", "response": ["Category:Ballets by Michael Costa (conductor)"]}, {"page": "Michael Costa (music)", "response": ["#REDIRECT Michael Costa (conductor)"]}, {"page": "1884 in the United Kingdom", "response": ["* 29 April – Sir Michael Costa, conductor (born 1808 in Italy)"]}, {"page": "August Manns", "response": ["Manns retained the position of director of music until his retirement in 1901, undertaking few outside engagements. At the Crystal Palace he also conducted the triennial Handel Festivals, from 1883. He took on the 1883 festival at a few hours' notice, when the established conductor, Sir Michael Costa was unwell.The Times, 16 June 1883, p. 12 He was at first regarded as less successful as a choral conductor than in the orchestral repertory; his beat was eccentric and puzzling to the uninitiated. He was, nevertheless, invited to conduct all the subsequent festivals up to and including 1900. He directed the orchestral concerts of the Glasgow Choral Union for thirteen seasons in succession. He conducted the promenade concerts at Drury Lane in 1859, and was conductor of the festivals of Sheffield in 1896 and 1899, and Cardiff in 1896."]}, {"page": "Italo Campanini", "response": ["Early in his 1872 Drury Lane season J. H. Mapleson, the London opera impresario, recruited Campanini from Rome, where he was in competition with the agents of Frederick Gye, the Covent Garden theatre impresario.J.H. Mapleson, The Mapleson Memoirs (Belford, Clarke & co., Chicago 1888), I, 153-154. On May 4, 1872 the tenor made his London debut as Gennaro in Lucrezia Borgia, with Thérèse Tietjens in the title role, Zelia Trebelli as Orsini and Agnesi as Duke Alfonso, under the baton of Michael Costa.H. Klein, Thirty Years of Musical Life in London (Century Co, New York 1903), 20. Klein states that Alfonso was sung by Jean-Baptiste Faure. He was an immediate success, being hailed by some as the tenor successor to Mario or Antonio Giuglini on what the critic Herman Klein (who attended) called a night of triumphs.Klein 1903, 20. It was at Drury Lane that he first sang with lyric soprano Christine Nilsson, to whom he became a celebrated stage partner. An agent from London attempted to lure him away at a rate of a thousand pounds sterling a month. He remained with Mapleson (at one-fifth of that sum) but became difficult to manage. However, he was to remain a stalwart and mainstay of Mapleson's company for the next ten years. In autumn 1872, he visited Dublin with the company (which included Maria Marimon, Ilma de Murska, Sofia Scalchi and Signor Foli [Allan Foley]), and toured the main cities of England and Scotland. During the spring of 1873, they undertook a back-up tour of British provincial towns.Mapleson 1888, I, 153-154.", "During his London career, Campanini became especially well known in the roles of Manrico (Il trovatore), Fernando (I puritani), and Edgardo (Lucia di Lammermoor). At his return for the 1874 season in London, in June he joined a Drury Lane cast in Michael Balfe's posthumous opera Il Talismano (Italian production) with Tietjens and Nilsson, and with the young Giovanni De Reschi in a baritone role (who later became the famous tenor Jean de Reszke).Klein 1903, 58. Les Huguenots and La favorita were among other productions of the season. In the 1875 season came the first London Lohengrin (with Emma Albani and Ernesto Nicolini at Covent Garden), soon followed by Mapleson's production at Her Majesty's Theatre in which Campanini, Tietjens, Nilsson and Antonio Galassi (baritone) led a starry cast under the direction of Michael Costa.Mapleson 1888, I, 166; Klein 1903, 44-45.", "The 1878 season was distinguished by the first London production of Bizet's opera Carmen, on June 22. Mapleson had seen it the previous winter at the Brussels Monnaie and decided to transfer it to Her Majesty's. He obtained the American soprano Minnie Hauk for Carmen, who had become famous in the role in Paris; Alwina Valleria portrayed Micaëla, and Del Puente Escamillo, to Campanini's Don José— under Michael Costa's baton. Despite the misgivings of the artists in rehearsal, it was an extremely effective cast among which Campanini himself was conspicuous for his singing and acting, reputedly with superb dramatic power, and it was greeted with a triumphant reception. Klein and the famous singing teacher Manuel Garcia were in the audience.Mapleson 1888, I, 197-198; Klein 1903, 84-90.", "The London Her Majesty's season of 1880, with Nilsson and Gerster, saw presentations of Faust, La sonnambula, Carmen and Aida under Michael Costa, and also a Lohengrin conducted for Mapleson by Hans Richter.Mapleson 1888, I, 237, 242. But the major new event of the season, in July, was Boito's Mefistofele, with Nilsson, Trebelli and Nannetti, and with Campanini as Faust. Costa conducted it 'in his old, resolute and vigilant manner', and the production 'lent a special distinction to the season.'Klein 1903, 153. This then went on tour to New York (under Arditi, as usual), where Campanini led the cast for the American premiere at the Academy of Music with Annie Louise Cary, Alwina Valleria and Franco Novara.Kobbé 1935, 475. The same venue saw Mapleson's production of a revised form of Les vêpres siciliennes headed by Campanini and Cary with del Puente and Galassi in support.Kobbé 1935, 436-437. Campanini performed, too, in La favorita."]}, {"page": "Costa (surname)", "response": ["*Sir Michael Costa, English composer and conductor", "*Michael Costa, Australian politician"]}, {"page": "MAA Costa", "response": ["#REDIRECT Michael Costa (conductor) "]}, {"page": "Frederick Gye", "response": ["In 1853 Verdi's Rigoletto and Berlioz's Benvenuto Cellini were given for the first time in England. Covent Garden had now become a success, good operas, with the best artists, and Michael Costa as conductor, serving to draw paying audiences; but on 5 March 1856 the house was destroyed by fire.see John Henry Anderson Gye received £8,000 from the insurance offices for the properties in the house, which were valued at £40,000."]}, {"page": "Antonio Giuglini", "response": ["Giuglini made his debut in London for Benjamin Lumley on 14 April 1857, at Her Majesty's Theatre, as Fernando in La favorita, with Mlle Spezia and Sig. Vialetti. Giuglini took the London palms, and was immediately approved by the London audience.Lumley Reminiscences, 408-410. He joined an already celebrated company which included artists such as Maria Piccolomini, Marietta Alboni and Thérèse Tietjens. This house was in competition with the newly rebuilt Covent Garden theatre, where Giulia Grisi and Mario led the cast and the box-office under Michael Costa for Frederick Gye. La favorita was followed by La traviata with Mlle Piccolomini, and Giuglini was received with even greater excitement than before: and in I puritani, chosen for the debut of Angiolina Ortolani,She became Mme Ortolani-Tiberini, having married the tenor Mario Tiberini. he stole the laurels from his partner.Lumley Reminiscences, 411. His Edgardo in Lucia di Lammermoor, with Piccolomini, was a further sensation:"]}, {"page": "L'Île Enchantée", "response": ["Arthur Sullivan was the organist for the Royal Italian Opera at Covent Garden, precursor to the Royal Opera, under the direction of Sir Michael Costa. He had made a sensation at The Crystal Palace with his incidental music to The Tempest in 1862.Sullivan biography at the G&S Archive"]}, {"page": "Adolf Pollitzer", "response": ["Pollitzer was born in Pest, Hungary.  In 1842, he left Pest for Vienna, where he studied the violin under Joseph Böhm at the Vienna Conservatory; and in his 14th year he took the first prize at the Conservatory. After a concert tour in Germany, he went to Paris and studied under Jean-Delphin Alard. In 1850 he crossed the Channel, and in London his remarkable talents as a violinist were recognized after a short time. He became leader at Her Majesty's Theatre under Sir Michael Costa and also led the new Philharmonic Orchestra and the Royal Choral Society."]}, {"page": "List of British Italians", "response": ["* Michael Costa"]}, {"page": "Ballets by Sir Michael Andrew Costa", "response": ["#REDIRECT Michael Costa (conductor)"]}, {"page": "Michael Costa", "response": ["Michael Costa may refer to:", "* Michael Costa (conductor) (1808–1884), Italian-born conductor and composer", "* Michael Costa (politician) (born 1956), Australian politician", "* Michael Costa (American football), American football coach"]}]}}