{"wiki_id": "http://www.wikidata.org/entity/Q19325186", "itemLabel": "John Armstrong", "itemDescription": "English painter, born  1893", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Armstrong_(artist)", "wikipedia_page": {"main": "John Rutherford Armstrong  (14 November 1893 – 19 May 1973) was a British artist and muralist who also designed for film and theatre productions. He is most notable for the Surrealist paintings he produced.\n\n", "link_mentions": [{"page": "Peel Art Gallery, Museum and Archives", "response": ["Artists mentioned in publicity for the gallery include John Anderson, Caroline Armington, Frank Armington, John Armstrong, Carl Beam, George Broomfield, Alex Cameron, Chuck Close, Tom Dean, Mary Dignam, Leonard J. Hutchinson, Tom LaPierre, Doris McCarthy, David Milne, Robert Motherwell, Will Ogilvie, Stephanie Rayner, Jim Reid, Jack Shadbolt, Michael Snow, Stanley Spencer, Tom Stone, Andy Warhol, and Joyce Weiland. A Tom Thomson sketchbook is included in the collection.The Permanent Collection of the Art Gallery of Peel, undated in-gallery pamphlet from the 1990s."]}, {"page": "List of British artists", "response": ["* John Armstrong (1893–1973) – British artist "]}, {"page": "John Armstrong", "response": ["John Armstrong may refer to:", "*John Armstrong (Australian politician) (1908–1977)", "*John Armstrong (New Zealand politician) (1935–2018)", "*John Armstrong Jr. (1758–1843), soldier and U.S. Secretary of War", "*John Armstrong Sr. (1717–1795), American general and Continental Congressman", "*John Armstrong (archbishop of Armagh) (1915–1987), Anglican bishop", "*John Armstrong (bishop of Grahamstown) (1813–1856), Anglican bishop", "*John Armstrong (bishop of Bermuda) (1905–1992), Anglican bishop", "*John Armstrong (priest) (1792–1856), Anglican priest in Ireland", "* John Armstrong (cricketer) (born 1981), England", "* John Armstrong (footballer, born 1890) (1890–1950), England", "* John Armstrong (footballer, born 1936), Scotland", "* John Armstrong (footballer, born 1987), Scotland", "* John Armstrong (rugby league), Australia", "*John Armstrong (architect) (1857–1941), Scotland", "*John Armstrong (artist) (1893–1973), UK", "*John Armstrong (British Army officer) (1674–1742), Surveyor General", "*John Armstrong (British writer/philosopher) (born 1966)", "*John Armstrong (Carolina) (1735–1784), American soldier and land registrar", "*John Armstrong (of Carrick) (1909–1984), farmer and musician from Northumberland", "*John Armstrong (comics) (died 2018), British artist", "*John Armstrong (frontiersman) (1755–1816), Pennsylvania and Ohio", "*John Armstrong (journalist/poet) (1771–1797), Scotland", "*John Armstrong (model railroader) (1920–2004), US", "*John Armstrong (physician) (1784–1829), England", "*John Armstrong (poet) (1709–1779), Scotland", "*John Armstrong (engineer) (1775–1854), Britain", "*John Armstrong, New Zealand Army, made calculations for the Te Rata Bridge"]}, {"page": "Edward Burra", "response": ["Burra's first solo show was held at the Leicester Galleries in 1929. In May 1929, he visited Paris with Chappell, Ashton, Fedorovitch, Mahoney and Birgit Batholin. His sister Betsy died of meningitis in August 1929. He visited Scotland with his mother in September 1929. In October 1929, Burra exhibited with the London Group; woodblock prints were shown at the Society of Wood-Engravers exhibition at the Redfern Gallery in London. In January 1930, he began to make collages with Paul Nash. Later that year, he travelled with Paul and Margaret Nash to Paris and the South of France. In October 1931, he exhibited in Recent Developments in British Painting, with John Armstrong, Nash, Edward Wadsworth and Ben Nicholson, at Arthur Tooth & Sons in London. Ashton's ballet A Day in a Southern Port (Rio Grande) opened at the Savoy, London in November 1931 with sets and costumes by Burra. He was a member of Unit One in 1933 and showed with the English Surrealists later in the 1930s."]}, {"page": "City Hall, Bristol", "response": ["The ceiling of the council chamber was designed by John Armstrong (1893–1973) and depicts buildings in Bristol at the edge and the centre details sailing ships from different periods of Bristol History. The four corners show the allegorical figures of Enterprise, Wisdom, Industry and Navigation. The ceiling in the Conference Room is by Sir Walter Thomas Monnington (1902–1976) on the theme of molecular and atomic fusion."]}, {"page": "I, Claudius (film)", "response": ["The making of I, Claudius is the subject of the 1965 BBC-TV documentary, The Epic That Never Was. Hosted by Dirk Bogarde, the film uses unedited rushes from the film, contemporary glimpses of the abandoned Denham Film Studios, and modern interviews with Robert Graves, Merle Oberon, Flora Robson, Josef von Sternberg, Emlyn Williams and costume designer John Armstrong.\"The Epic That Never Was.\" BFI Film & TV Database (British Film Institute). Retrieved: 5 January 2016. The 75-minute film incorporates two extended scenes featuring Laughton; briefer scenes featuring Emlyn Williams, Robert Newton, Flora Robson and Merle Oberon; crowd scenes presenting sixty Vestal Virgins, a cinematic exaggeration of the traditional six; and views of Vincent Korda's opulent sets.Greenspun, Roger. \"I, Claudius Recalled.\" The New York Times, 20 September 1969. Retrieved: 5 January 2016."]}, {"page": "St Peter ad Vincula, Coggeshall", "response": ["*Coggeshall Church, Essex, 1940, by John Armstrong at Tate Britain"]}, {"page": "List of Old Paulines", "response": ["*John Armstrong (1893–1973); artist"]}, {"page": "Unit One", "response": ["The artists of the group were: the architects Wells Coates and Colin Lucas; the painters John Armstrong, John Bigge, Edward Burra, Frances Hodgkins, Paul Nash, Ben Nicholson and Edward Wadsworth; and the sculptors Barbara Hepworth and Henry Moore. Frances Hodgkins soon left the group and was replaced by Tristram Hillier."]}, {"page": "List of people from Hastings", "response": ["* John Armstrong (1893–1973), painter of imaginative subjects, designer of film and stage sets, mural painter and book illustrator. Born in Hastings"]}, {"page": "List of painters by name beginning with \"A\"", "response": ["*John Armstrong (1893–1973), English surrealist artist"]}, {"page": "Ingram Collection of Modern British Art", "response": ["*John Armstrong"]}, {"page": "St John's Wood Art School", "response": ["The Art School was established in 1878 and was located on Elm Tree Road. It was founded by two art teachers, Elíseo Abelardo Alvarez Calderón (1847-1911) and Bernard Evans Ward. Lewis Baumer and Byam Shaw were early students. Later students included Mina Loy, John Armstrong, Michael Ayrton, Gladys Baker, Gladys Barron, Eileen Bell, Enid Bell, Frank Beresford, Marcia Lane Foster, Meredith Frampton, Kenneth Martin, G. K. Chesterton, John Minton, Olive Mudie-Cooke, Edward Tennyson Reed, Ursula Wood, Ivan Peries, Herbert James Draper, Flora Lion, Gluck, Leonard Walker and Christopher R. W. Nevinson. Aina Onabolu, the first African to study art in England was a student at the School from 1920 to 1922. Teachers at the School included Vanessa Bell, John Piper, Leonard Walker and John Skeaping."]}, {"page": "War Artists' Advisory Committee", "response": ["* John Armstrong"]}, {"page": "David Dane", "response": ["David Maurice Surrey Dane was the son of William Surrey Dane (1892–1978), C.B.E., M.C., vice-chairman and managerial consultant of Odhams Press and chairman/ president of several hospital boards, including Great Ormond Street Hospital (1957–67), chairman of the Daily Herald newspaper (1949–60), and a member of the General Advisory Council of the BBC (1956–62),Debrett's Peerage, Baronetage, Knightage and Companionage, 1973, Kelly's Directories, p. 2582Who was Who entry, published online 2007 URL= http://oxfordindex.oup.com/view/10.1093/ww/9780199540884.013.U153703 Date accessed= 14 Sep. 2018 and his wife Dorothy Mary, daughter of Rev. William Alexander Armstrong, M.A. (Cantab.), vicar of West Dean, near Chichester; her brother was the artist John Armstrong.John Armstrong: The Paintings, Andrew Lambirth, Philip Wilson Publishing, 2009, p. 13"]}, {"page": "Scarborough Art Gallery", "response": ["Both Eric Ravilious and Edward Bawden, who were close friends, became acquainted with Tom Laughton, who acted as a patron, particularly to Bawden and commissioned pieces from him to adorn his hotels. The Peep Show in the collection was commissioned by Laughton as a plaything for guests at The Royal Hotel. Pieces by John Armstrong are also part of the Laughton gift, some of which were purchased by Tom and some by his brother Charles for their hotels, The Royal and The Pavilion."]}, {"page": "Benita Armstrong", "response": ["Armstrong was born into a Jewish family in Germany and moved to London in 1926. In London she lived in a flat above a restaurant in Charlotte Street and for several years was in a relationship with Clive Bell. After that relationship ended she met and, in 1932, married the British artist John Armstrong. Benita Armstrong studied under the Viennese sculptor Georg Ehrlich and was a frequent participant in group exhibitions in London and elsewhere as well as regularly having work included in the Royal Academy Summer Exhibitions. A solo exhibition of her work was held at the Drian Galleries in London in 1981. She and Armstrong separated and she eventually married the Labour Party politician George Russell Strauss with who she had two children."]}, {"page": "Piano Nobile", "response": ["Since the mid-2010s, Piano Nobile has held around two monographic loan exhibitions a year. Examples include exhibitions of work by Mark Gertler (2012), Paul Nash (2014), John Armstrong (2015), William Coldstream and Euan Uglow (2016), Peter Coker (2017), David Bomberg and Leslie Marr (2017), Vanessa Bell and Duncan Grant (2018), Leon Kossoff (2019), Craigie Aitchison (2019), and Ben Nicholson (2020). These exhibitions have sometimes included museum loans. The exhibition Ben Nicholson: Distant Planes included works from the British Council Collection, Southampton City Art Gallery and Pallant House Gallery."]}]}}