{"wiki_id": "http://www.wikidata.org/entity/Q1949858", "itemLabel": "Yvonne John Lewis", "itemDescription": "British musician", "wikipedia_url": "https://en.wikipedia.org/wiki/Yvonne_John_Lewis", "wikipedia_page": {"main": "Yvonne John Lewis (occasionally spelled Yvonne John-Lewis) is a female lead and backing singer from the United Kingdom. She is currently teaching mathematics at a secondary school in North London.\nHailing from London, she was discovered by Osmond Wright, better known by his stage name \"Mozez\" and a singer for British downtempo group Zero 7.John Lewis first featured as a lead vocalist on Zero 7's albums, and has gone on to provide lead vocals for and been featured on recordings by artists including as Basement Jaxx, Sia, Stella Browne, Narcotic Thrust and Rollercone. She is well known as the featured singer on Narcotic Thrust's number one Billboard Hot Dance Music/Club Play hit from 2002, Safe from Harm.\nJohn Lewis has worked as a backing vocalist for artists like Bryan Ferry, Blue, Enrique Iglesias, James Fargas, Westlife and Atomic Kitten. She also provided the vocal sample in Simon Webbe's track, \"No Worries\". She toured with Roxy Music in 2004.\n\n", "link_mentions": [{"page": "List of Billboard Hot Dance Music/Club Play number ones of 2002", "response": ["|Narcotic Thrust featuring Yvonne John Lewis"]}, {"page": "Narcotic Thrust", "response": ["Their song \"Safe from Harm\" hit No. 1 on the U.S. Hot Dance Club Play chart in 2002, featuring the lead vocals of Yvonne John Lewis. It was also the first track released on Deep Dish's Yoshitoshi Records to top the U.S. dance chart.", "The band's third single in 2005, called \"When the Dawn Breaks\", featured Gary Clark (vocalist from the Scottish band Danny Wilson) on vocals. In 2006, Narcotic Thrust released their fourth single, \"Waiting for You\" again featuring the vocals of Yvonne John Lewis.", "* 2002 \"Safe from Harm\" (with Yvonne John Lewis) - UK No. 24", "* 2004 \"I Like It\" (with Yvonne John Lewis) - UK No. 9", "* 2006 \"Waiting for You\" (with Yvonne John Lewis)"]}, {"page": "List of artists who reached number one on the U.S. Dance Club Songs chart", "response": ["* Yvonne John Lewis (1)"]}, {"page": "Colour the Small One", "response": ["All tracks are co-written by Sia, five of the original eleven tracks are co-written with bass guitarist, Samuel Dixon.au.news.yahoo.com , collaboration with Samuel Dixon. Hogarth also co-wrote three tracks with Furler and provided various instruments. Note: User may have to click on 'Search again' and at 'Performer:' add Sia or Sia Furler to search for other titles. The track \"The Bully\" is co-written by Furler with United States musician, Beck. Two other songs from the Colour the Small One sessions were co-written with Beck but were not used. \"Natale's Song\" has backing vocals from UK singer Sophie Barker who had previously worked with Sia on the Zero 7 single, \"Destiny\" (August 2001).Discogs.com, Sophie Barker and Yvonne John Lewis collaborations. Another UK singer, Yvonne John Lewis, features on \"The Church of What's Happening Now\" as backing vocalist.", "* Yvonne John Lewis: backing vocals "]}, {"page": "Lewis (surname)", "response": ["*Yvonne John Lewis, English singer"]}, {"page": "Yvonne John-Lewis", "response": ["#REDIRECT Yvonne John Lewis"]}, {"page": "No Worries (Simon Webbe song)", "response": ["\"No Worries\" is the second single released from Blue band member Simon Webbe's debut solo album, Sanctuary (2005). The song features backing vocals from Liam Kennedy and Yvonne John Lewis. \"No Worries\" peaked at number four on the UK Singles Chart, the same position as its predecessor, \"Lay Your Hands\", but spent longer in the top 40. The song became a top-20 hit in Italy and reached number two in the Netherlands."]}, {"page": "Matt Schwartz", "response": ["* 2004 Remix  'I Like It {featuring Yvonne John Lewis} Free2Air Recordings UK Charts No. 10"]}, {"page": "I Like It (Narcotic Thrust song)", "response": ["\"I Like It\" is a song by English electronic music duo Narcotic Thrust featuring British singer Yvonne John Lewis on vocals. Andrew Levy from acid jazz group the Brand New Heavies plays bass guitar on the song while ex-member Jan Kincaid handles the percussion. Released as a standalone single in April 2004, \"I Like It\" debuted and peaking at number nine on the UK Singles Chart the same month to become the duo's sole top-10 hit in the UK. The single also reached the top 20 in Flanders, Greece, the Netherlands, and Romania, as well as on three US Billboard dance charts. A music video was made for the song, featuring several female cheerleaders with red pom-poms dancing in a bright grey room filled with confetti.", "* Yvonne John Lewis – vocals"]}, {"page": "Stuart Crichton", "response": ["! scope=\"row\"| \"Safe from Harm\" (featuring Yvonne John Lewis)"]}]}}