{"wiki_id": "http://www.wikidata.org/entity/Q19475023", "itemLabel": "Helen Kerly", "itemDescription": "English pilot of WWII", "wikipedia_url": "https://en.wikipedia.org/wiki/Helen_Kerly", "wikipedia_page": {"main": "Helen Kerly or Ruth Helen Clark (6 January 1916 - 1992) was a British civilian female pilot officer who was one of only two such women commended for their work.", "link_mentions": [{"page": "Thinktank, Birmingham Science Museum", "response": ["In March 2015, a new \"Spitfire gallery\" opened, relating the displayed aircraft to their production, locally. Among the new exhibits are a leather flying helmet previously belonging to Helen Kerly, one of only two British civilian women commended for flying during the Second World War."]}, {"page": "Air Transport Auxiliary", "response": ["Overall during World War II there were 166 women pilots, one in eight of all ATA pilots, and they volunteered from Britain, Canada, Australia, New Zealand, South Africa, the United States, the Netherlands and Poland. British women pilots included Mary de Bunsen and Diana Barnato Walker. From Argentina and Chile came Maureen Dunlop and Margot Duhalde. Fifteen of these women lost their lives in the air, including the British pioneer aviator Amy Johnson and Joy Davison. Two of the women pilots received commendations; one was Helen Kerly."]}, {"page": "Leather flying helmet", "response": ["A particularly fine example of a Type B flying helmet can be found in the Thinktank, The Science museum for Birmingham, England. That helmet belonged to a female pilot, Helen Kerly who was a Spitfire delivery pilot during the Second World War. The Type B flying helmet was designed to accommodate the addition of earphones for radio communication, but unlike later models did not include integrated wiring. Similarly, the helmet was styled to be comfortably worn with an oxygen mask and separate goggles to protect the eyes. Protection from head injuries was not considered, the leather is soft and flexible not hard to withstand blows."]}]}}