{"wiki_id": "http://www.wikidata.org/entity/Q19463079", "itemLabel": "Maude Goodman", "itemDescription": "British painter", "wikipedia_url": "https://en.wikipedia.org/wiki/Maude_Goodman", "wikipedia_page": {"main": "Maude Goodman (1853–1938) was a British painter.", "link_mentions": [{"page": "Kate Greenaway", "response": ["\"Kate Greenaway\" children, all of them girls and boys too young to be put in trousers, were dressed in her own versions of late 18th century and Regency fashions: smock-frocks and skeleton suits for boys, high-waisted pinafores and dresses with mobcaps and straw bonnets for girls. The influence of children's clothes in portraits by British painter John Hoppner (1758–1810) may have provided her some inspiration. Liberty of London adapted Kate Greenaway's drawings as designs for actual children's clothes. A full generation of mothers in the liberal-minded \"artistic\" British circles who called themselves The Souls and embraced the Arts and Crafts movement dressed their daughters in Kate Greenaway pantaloons and bonnets in the 1880s and 1890s. The style was often used by painter Maude Goodman in her depictions of children."]}, {"page": "Brompton Cemetery", "response": ["* Maude Goodman – artist, buried under her married name, Matilda Scanes"]}, {"page": "Bellis perennis", "response": ["File:Maude Goodmann The daisy chain.jpg|The daisy chain by Maude Goodman (1936)"]}, {"page": "List of British artists", "response": ["* Maude Goodman (1853–1938) (a.k.a. Matilda Scanes) – English Victorian fine art painter and children’s book illustrator, Romantic genre paintings"]}, {"page": "West Kensington", "response": ["*Maude Goodman a.k.a. Matilda Scanes, artist, resided at Edith Villas until 1894, and then 7 Addison Crescent until her death in 1938. From 1938 to 1968 the Maude Goodman Studio operated musical recitals there with Dame Eva Turner as president."]}, {"page": "Women Painters of the World", "response": ["*Maude Goodman"]}, {"page": "List of English women artists", "response": ["*Maude Goodman (Matilda Scanes) (1853–1938), painter"]}]}}