{"wiki_id": "http://www.wikidata.org/entity/Q1943941", "itemLabel": "Mona Washbourne", "itemDescription": "English actress of stage, film and television (1903-1988)", "wikipedia_url": "https://en.wikipedia.org/wiki/Mona_Washbourne", "wikipedia_page": {"main": "Mona Lee Washbourne (27 November 1903 – 15 November 1988) was an English actress of stage, film, and television. Her most critically acclaimed role was in the film Stevie (1978), late in her career, for which she was nominated for a Golden Globe Award and a BAFTA Award.", "link_mentions": [{"page": "1988", "response": ["* November 15 – Mona Washbourne, English actress (b. 1903)"]}, {"page": "Stevie Smith", "response": ["Smith died of a brain tumour on 7 March 1971. Her last collection, Scorpion and other Poems was published posthumously in 1972, and the Collected Poems followed in 1975. Three novels were republished and there was a successful play based on her life, Stevie, written by Hugh Whitemore. It was filmed in 1978 by Robert Enders and starred Glenda Jackson and Mona Washbourne.ODNB entry."]}, {"page": "Jean Anouilh", "response": ["* Ring Round the Moon (L'Invitation au château). Globe Theatre, London: 26 January 1950. Directed by Peter Brook. With Paul Scofield, Claire Bloom, Margaret Rutherford, Cecil Trouncer, Mona Washbourne. "]}, {"page": "Jean Rhys", "response": ["In 1968, André Deutsch published a collection of Rhys' short stories, Tigers Are Better-Looking, of which eight were written during her 1950s period of obscurity and nine republished from her 1927 collection The Left Bank and Other Stories. Her 1969 short story \"I Spy a Stranger\", published by Penguin Modern Stories, was adapted for TV in 1972 for the BBC's Thirty-Minute Theatre starring Mona Washbourne, Noel Dyson, Hanah Maria Pravda, and Basil Dignam. In 1976, Deutsch published another collection of her short stories, Sleep It Off Lady, consisting of 16 pieces from an approximately 75-year period, starting from the end of the 19th century."]}, {"page": "Night Must Fall", "response": ["A 1964 film remake was directed by Karel Reisz from a script by Clive Exton, and starred Albert Finney, Susan Hampshire, Sheila Hancock and Mona Washbourne, but was not as successful as the original film."]}, {"page": "Billy Liar", "response": ["The 1963 film was directed by John Schlesinger and featured Tom Courtenay, who played the part when Albert Finney left the cast in the West End play, as Billy and Julie Christie as Liz, one of his three girlfriends. Mona Washbourne played Mrs. Fisher, and Wilfred Pickles played Mr. Fisher. Rodney Bewes, Finlay Currie, and Leonard Rossiter also had roles."]}, {"page": "1988 in film", "response": ["| style=\"text-align:center;\"| 15 || Mona Washbourne || style=\"text-align:center;\"| 84 || style=\"text-align:center;\"| UK || style=\"text-align:center;\"| Actress || "]}, {"page": "1964 in film", "response": ["* Night Must Fall, starring Albert Finney, Mona Washbourne and Susan Hampshire – (U.K.)"]}]}}