{"wiki_id": "http://www.wikidata.org/entity/Q19467667", "itemLabel": "Jane Gardiner", "itemDescription": "British educator and grammarian", "wikipedia_url": "https://en.wikipedia.org/wiki/Jane_Gardiner", "wikipedia_page": {"main": "Jane Arden Gardiner (1758 - 1840) was a British schoolmistress and grammarian, and one of the earliest friends of Mary Wollstonecraft.\n\n", "link_mentions": [{"page": "Governess", "response": ["*Jane Gardiner (1758-1840), from her mid-teens governess to the daughters of Lady Martin, and from 1780 to the children of Lord Ilchester. She was succeeded in this second post by Agnes Porter, whose memoirs were reprinted in 1998 as A Governess in the Age of Jane Austen."]}, {"page": "Karl Heinrich von Bogatzky", "response": ["Bogatzky's main works are Güldenes Schatzkästlein der Kinder Gottes (Little Golden Treasure Chest of God's Children, 1718) and Übung der Gottseligkeit in allerlei geistlichen Liedern (Exercises Regarding God's Blessedness in All Forms of Religious Songs, 1750). He also wrote A Golden Treasury for the Children of God in 1746; this was one of the favourite books of Jane Gardiner (1758-1840), an English school owner."]}, {"page": "Elsham Hall", "response": ["From 1800 to 1814 the house was occupied by Jane Gardiner, who ran a girls' boarding school there."]}, {"page": "Gardiner (surname)", "response": ["* Jane Gardiner, schoolmistress, grammarian"]}, {"page": "Henry Fox-Strangways, 2nd Earl of Ilchester", "response": ["Detailed information about the Ilchester household and family survives in the published diaries and correspondence of Agnes Porter, a Scottish-born governess to his many daughters from 1784 to 1797.A Governess in the Age of Jane Austen. The Journals and Letters of Agnes Porter, ed. Joanna Martin (London: Hambledon Press, 1998). . The family's previous governess had been Jane Gardiner, a childhood friend of Mary Wollstonecraft."]}, {"page": "Jane Arden", "response": ["* Jane Gardiner (1758–1840), née Arden, British schoolmistress and grammarian."]}, {"page": "History of English grammars", "response": ["In 2003, scholar Karen Cajka described nine English women who published grammars in the late eighteenth century: Ellin Devis, Dorothea Du Bois, Mrs. M. C. Edwards, Mrs. Eves, Ellenor Fenn (aka Mrs. Teachwell and Mrs. Lovechild), Ann Fisher, Jane Gardiner née Arden, Blanche Mercy, and Mrs. Taylor. They \"together published a total of twelve discrete grammars, with over one hundred documented editions appearing well into the nineteenth century\". The study of English grammar was seen as important in learning how to write English well, and in learning other languages later. It held a strong significance to many people in the United States with little to no income, and sparse educational backgrounds, ranging from former slaves, to rail splitters or weavers. Learning it permitted individuals like these to speak and write the language with passionate fluency, helping them expand on their careers.", "*1799. Jane Gardiner: Young Ladies’ Grammar "]}, {"page": "Sir Mordaunt Martin, 4th Baronet", "response": ["Governess to the family's first six daughters from 1775 to 1780 was a very young Jane Arden, the first friend of Mary Wollstonecraft. She later set up a school and published educational works as Jane Gardiner. She named her daughter Everilda, very likely after Lady Martin. Governesses were often isolated and oppressed, but the Martins treated her well – on a return visit, \"more as a daughter than as an humble 'gouvernante' ... I am in the very height of enjoyment in this charming family, their society is so refined, so intellectual!\""]}, {"page": "Thomas Corbett (Lincolnshire MP)", "response": ["Corbett inherited estates in several English counties. Elsham Hall near Elsham, North Lincolnshire, for generations the property of families intertwined with the Corbetts, was leased to Jane Gardiner as a girls' boarding school from 1800 to 1814. Later it became Thomas Corbett's family seat, along with Darnhall, in the county of Chester, an estate brought into the family by Thomas Corbett (secretary of the Admiralty) (died 1751). Thomas George Corbett also owned Ryther in North Yorkshire, via the Barons Haversham. In 1844 Corbett was listed in White's Directories as lord of the manor of Wilby, Suffolk"]}]}}