{"wiki_id": "http://www.wikidata.org/entity/Q1946972", "itemLabel": "Brian McNeill", "itemDescription": "British singer", "wikipedia_url": "https://en.wikipedia.org/wiki/Brian_McNeill", "wikipedia_page": {"main": "Brian McNeill (born 6 April 1950, Falkirk, Scotland) is a Scottish folk multi-instrumentalist, songwriter, record producer and musical director. He was a founding member of Battlefield Band which combined traditional Celtic melodies and new material.", "link_mentions": [{"page": "John Harrison", "response": ["The song \"John Harrison's Hands\", written by Brian McNeill and Dick Gaughan, appeared on the 2001 album Outlaws & Dreamers. The song has also been covered by Steve Knightley, appearing on his album 2011 Live in Somerset.  It was further covered by the British band Show of Hands and appears on their 2016 album The Long Way Home."]}, {"page": "Tony McManus (musician)", "response": ["In 1988, McManus substituted for guitarist Soig Siberil in the supergroup Celtic Fiddle Festival, which consisted of  fiddlers Johnny Cunningham, Kevin Burke, and Christian Lemaitre. He has worked as accompanist for Catriona MacDonald and for singer, guitarist, and fiddler Brian McNeill. McManus's album Return to Kintail was a duet with Scottish fiddler Alasdair Fraser.", "* 1995 Stage by Stage, Iain MacKintosh/Brian McNeill ", "* 1996 No Gods, Brian McNeill"]}, {"page": "Veere", "response": ["140px|thumb|Brian McNeill, 2006", "Scottish singer-songwriter Brian McNeill based the song \"The Holland Trade\" from his tenth studio album The Baltic tae Byzantium on the trade and cultural ties between Veere and Scotland from 1541 on."]}, {"page": "Falkirk", "response": ["* Brian McNeill - Founding member of the Battlefield Band, Scottish folk singer"]}, {"page": "Scottish folk music", "response": ["The fusing of various styles of American music with British folk created a distinctive form of fingerstyle guitar playing known as folk baroque, pioneered by figures including Davy Graham and Bert Jansch. This led in part to British progressive folk music, which attempted to elevate folk music through greater musicianship, or compositional and arrangement skills. Many progressive folk performers continued to retain a traditional element in their music, including Jansch who became a member of the band Pentangle in 1967. Others largely abandoned the traditional element of their music. Particularly important were Donovan (who was most influenced by emerging progressive folk musicians in America such as Bob Dylan) and the Incredible String Band, who from 1967 incorporated a range of influences including medieval and Eastern music into their compositions, leading to the development of psychedelic folk, which had a considerable impact on progressive and psychedelic rock.J. DeRogatis, Turn on Your Mind: Four Decades of Great Psychedelic Rock (Milwaukie MI, Hal Leonard, 2003), , p. 120. Acoustic groups who continued to interpret traditional material through into the 1970s included Ossian and Silly Wizard.S. Broughton, M. Ellingham and R. Trillo, eds, World Music: Africa, Europe and the Middle East (London: Rough Guides, 1999), , pp. 267. The Boys of the Lough and Battlefield Band, emerged from the flourishing Glasgow folk scene. Also from this scene were the highly influential The Clutha, whose line up, with two fiddlers, was later augmented by the piper Jimmy Anderson, and the Whistlebinkies, who pursued a strongly instrumental format, relying on traditional instruments, including a Clàrsach (Celtic harp).Broughton, Ellingham and Trillo, World Music: Africa, Europe and the Middle East, pp. 261–3. Many of these groups played largely music originating from the Lowlands, while later, more successful bands tended to favor the Gaelic sounds of the Highlands. While fairly popular within folk circles, none of these groups achieved the success of Irish groups such as The Chieftains and The Dubliners. Some of these bands produced noted solo artists, including Andy M. Stewart of Silly Wizard, Brian McNeill of Battlefield Band, and Dougie MacLean of the Tannahill Weavers. MacLean is perhaps the best known of these, having written \"Caledonia,\" one of Scotland's most beloved songs."]}, {"page": "Battlefield Band", "response": ["Battlefield Band was formed in 1969 by five student friends from Strathclyde University (Brian McNeill, Jim Thomson, Alan Reid, Eddie Morgan and Sandra Lang, who became crime fiction author Alex Gray) and took its name from the Glasgow suburb where McNeill was living at the time. After several line-up changes and an album recorded for a minor Breton label, the band was signed to Topic records and released its official self-titled debut in 1977 with the line-up of McNeill (fiddle, vocals), Reid (keyboards, vocals), Jamie McMenemy (bouzouki, vocals), and John Gahagan (whistle). Gahagan left before the recording of the follow-up, At the Front (1978), and was replaced by Irish singer-guitarist Pat Kilbride. The departure of both Kilbride and McMenemy shortly afterward brought in Jen Clark (vocals, cittern, dulcimer) and Duncan MacGillivray (Highland pipes) for Stand Easy (1979), thus beginning Battlefield Band's tradition of using bagpipes on their albums. Clark was replaced by Northumbrian singer-guitarist Ged Foley on Home is Where the Van Is (1980), which marked a switch from Topic records to producer Robin Morton's label Temple. Home is Where the Van Is also inaugurated the band's practice of placing original songs alongside traditional material. The line-up changes continued, though the group remained based around the core of McNeill and Reid until 1990, when McNeill left to pursue a solo career. Reid finally left the band at the end of 2010, concentrating on his musical duo with guitarist & singer Rob van Sante, the Battlefield Band's sound engineer.", "#Brian McNeill [1969–1990] (founding member; fiddle, writing) – Brian has published two detective novels. In 2001, he took up the post of Head of Scottish Music at the Royal Scottish Academy of Music and Drama in Glasgow, which he has since relinquished."]}, {"page": "Dick Gaughan", "response": ["By the early 90s Gaughan was again feeling the need to work regularly with others, so he invited seven other well-established Scots musicians to form a group called Clan Alba. The original line-up consisted of Gaughan, singer-guitarist Davy Steel, harpists Mary Macmaster and Patsy Seddon, multi-instrumentalist Brian McNeill, piper Gary West and percussionists Mike Travis and Dave Tulloch. The group made its debut at the 1992 Edinburgh Folk Festival and performed at other festivals across the UK and Europe over the next two years, during which time Gary West left and was replaced by Fred Morrison. In 1994 Clan Alba recorded an eponymous double CD, which Gaughan produced  at Redesdale Studios, but the group disbanded the following year after problems with the marketing of the record.", "Resuming his solo career, Gaughan recorded two further albums during the decade. On Sail On (1996) he was accompanied by several Clan Alba alumni. Along with political anthems such as Pete Seeger's \"Waist Deep In The Big Muddy\" and Brian McNeill's \"No Gods and Precious Few Heroes\", the record also featured Gaughan's interpretations of more mainstream songs, including Jagger/Richards's \"Ruby Tuesday\" and Richard Thompson's \"1952 Vincent Black Lightning. He described his next, Redwood Cathedral (1998), as \"primarily a homage by a song interpreter to the craft of the songwriter.\" It featured stripped-down arrangements of reflective songs, including the old Everly Brothers hit, \"Let It Be Me\", Pete Seeger's \"Turn, Turn, Turn\" and Lal Waterson's \"Fine Horseman\".", "In the early 2000s Gaughan turned his hand to larger-scale composition and received two orchestral commissions from the Celtic Connections festival. The first, \"Timewaves (Love Song to a People's Music)\", mixed orchestral playing with folk singing and was performed at the 2004 festival by the Orchestra of Scottish Opera together with Gaughan and other folk singers and players. The second was a symphony, \"Treaty 300\", composed for the inaugural concert of the Celtic Connections Youth Orchestra in 2007. Between 2001 and 2008 five Gaughan albums were released. On Outlaws and Dreamers (2001), he used only his acoustic guitar and Brian McNeill's fiddle to accompany his voice. Prentice Piece (2002) was a self-selected thirty-year retrospective of his career (although some material could not be included owing to copyright disputes). The Definitive Collection (2006) was another compilation. Lucky For Some (2006) consisted almost entirely of self-written songs and Gaughan Live! at the Trades Club (2008) was a live gig, recorded at one of his favourite venues, the Trades Club, Hebden Bridge, Yorkshire."]}, {"page": "Greentrax Recordings", "response": ["The Greentrax catalogue include releases by Gordon Duncan, RURA, Barbara Dickson, The McCalmans, Paul McKenna Band, Jean Redpath, Catherine-Ann MacPhee, Adam McNaughton, Archie Fisher, Aly Bain, Brian McNeill, Judy Small, Shooglenifty, Tony McManus, Fiddlers' Bid, Chris Stout, Willie Hunter & Violet Tulloch, Bodega, Peerie Willie Johnson, Shoormal, Ceilidh Minogue, Dick Gaughan, The Whistlebinkies, The Poozies and the Peatbog Faeries."]}, {"page": "Clementina Walkinshaw", "response": ["Scottish singer-songwriter Brian McNeill composed the song \"How the Foreign Winds Do Blaw\" on his tenth studio album The Baltic tae Byzantium about Walkinshaw."]}, {"page": "Chris Leslie (musician)", "response": ["Chris also takes part in an annual Christmas tour with St Agnes Fountain and also takes part in \"A Feast of Fiddles\" - a collaboration with Peter Knight, Tom Leary (The Hookey Band), Ian Cutler, Phil Beer (Show of Hands) and Brian McNeill (The Battlefield Band)."]}, {"page": "Federal Reserve Bank of Philadelphia", "response": ["!Brian McNeill"]}, {"page": "List of Scottish musicians", "response": ["*Brian McNeill, a founding member of the Battlefield Band"]}, {"page": "42nd Regiment of Foot", "response": ["The second line of Brian McNeill's song \"The Baltic tae Byzantium\" briefly references the 42nd as \"The Gallant Forty Twa\"."]}, {"page": "Home Is Where the Van Is", "response": ["*Brian McNeill: vocals, bouzouki, fiddles, cittern, concertina, hurdy-gurdy, viola", "The band played the album in its entirety at the 2009 Celtic Connections, as part of the festival's Classic Albums series. The performance featured the line-up who recorded the album in 1980 (Alan Reid, Brian McNeill, Duncan MacGillivray & Ged Foley), playing together with the line-up of 2009 (Alan Reid, Mike Katz, Alasdair White & Sean O'Donnell)."]}, {"page": "John Taylor (Scottish fiddler)", "response": ["His 2001 debut CD, After the Dance, was produced by Brian McNeill.Hamilton House, San Jose, California  His second album, The Road Ahead, was also produced by McNeill. Taylor is a frequent visitor to folk-music events in Texas where he is highly regarded and known for his large repertoire, and plays at many festivals across America each year."]}, {"page": "Many's the Fine Tale", "response": ["# \"Gie the Fiddler a Dram\" (Brian McNeill/Ed Miller) - 4:54", "# \"The Lads o' the Fair\" (Brian McNeill) - 3:40", "# \"The Wide Rio Grande\" (Brian McNeill) - 4:33", "# \"All We Can Call Oor Ain\" (Brian McNeill) - 7:18"]}, {"page": "Lowlander (album)", "response": ["# In Your Heart, Home with You (Ian Davidson/Brian McNeill/Ed Miller) - 3:01", "# The Song of the Hammers (Brian McNeill) - 3:05", "# Road, Road (Brian McNeill) - 4:17", "# Lowlander (Brian McNeill) - 1:45"]}, {"page": "Live Celtic Folk Music", "response": ["# \"The Gallant Grahams\" – 3:08 (from Alan Reid & Brian McNeill's Sidetracks 1981) ", "* Brian McNeill"]}, {"page": "Calum Malcolm", "response": ["His working credits also include The Boys of the Lough, Brian McNeill, It's Immaterial, Josef K, Mike Lindup, Stéphane Grappelli, The Happy Family, Tom Anderson, Tommy Smith, William Jackson and on Black's 2015 album, Blind Faith."]}, {"page": "Wae's me for Prince Charlie (album)", "response": ["*Brian McNeill: voice (**), guitar, fiddle, concertina, mandolin, viola"]}, {"page": "Paul McKenna Band", "response": ["In December 2010 the band recorded their second album Stem The Tide with producer Brian McNeill at Watercolour Studios in Ardgour. The album was released in March 2011."]}, {"page": "Iain MacKintosh", "response": ["MacKintosh became one of the best-loved artists of Tønder Festival where he used to run the Saturday afternoon concert at the Mill.Tønder Festival – gennem 25 ar, 1975–1999 For years he did joint tours with other notable folk artists, mainly Hamish Imlach and Brian McNeill. He retired at the age of 68, after a final tour of several European countries in 2000.", "| feat. Brian McNeill", "Brian McNeill", "Brian McNeill"]}, {"page": "The King of Rome", "response": ["The song was most notably recorded by June Tabor in 1988. She had heard Sudbury perform the song at the Northern Arts Council's 'Songsearch' contest in the late 1980s, where she was a judge. Hudson came in fourth.Sleeve notes, Iain MacKintosh & Brian McNeill, Live and Kicking, 2000  Brian McNeill, another finalist at the event, has said:"]}, {"page": "Farewell to Nova Scotia (album)", "response": ["Battlefield Band is a trio made up of the founder members Alan Reid, Brian McNeill and string player Ricky Starrs. Alan Reid on vocals does the singing in much of the songs. Most of the music (7 songs, 5 instrumentals) is Scottish, but there is still Irish, Canadian, English and Australian influences here. Ricky Starrs would later be replaced by singer/bouzouki player Jamie McMenamy and whistle player John Gahagan, making Battlefield Band a quartet...", "*Brian McNeill: fiddle, vocals"]}, {"page": "Parallel Lines (Dick Gaughan & Andy Irvine album)", "response": ["\"The Lads O' The Fair\" / \"Leith Docks\". The first part, sung here by Gaughan, is a modern ballad written by Brian McNeill \"(...) to commemorate a piece of his home town’s social history, the Falkirk Tryst, the great meeting at which the cattle of the Highlands, herded from the north by the drove roads, would be sold to southern buyers. (...) The song takes three characters; a weaver who wants to sell his cloth, a drover who’s looking forward to a good drink at the end of his work, and a ploughman who wants a new job, and it lets each of them tell of their expectations of the Tryst\".Origin of \"The Lads O' The Fair\" at Brian McNeill's website. Retrieved on 8 March 2015 \"Leith Docks\" is a short instrumental coda composed by Gaughan and lasting approximately 20 seconds.", "# \"The Lads O' The Fair\" (Brian McNeill) / \"Leith Docks\" (Dick Gaughan) – 3:45"]}, {"page": "McNeill, Brian", "response": ["#redirectBrian McNeill"]}, {"page": "Handful of Earth", "response": ["Handful of Earth became one in a series of solo albums by Gaughan which re-interpret Scottish and Irish traditional music for guitar.World Music: The Rough Guide (Volume 2: Latin and North America, Caribbean, India, Asia and Pacific), Rough Guides/Penguin (London, 2000; ). In the album's liner notes, he credits a conspicuous influence from many Northern Irish folk singers. The album was recorded in late 1980 at Temple Studios near Edinburgh and was produced by Dick Gaughan with Robin Morton, the latter of whom also engineered the recording. Guest musicians appear on several songs, namely Phil Cunningham, who contributes whistle to one track and keyboard to another, Brian McNeill, who adds fiddle to two tracks, and Stewart Isbister, who adds bass to one track. During the album's recording, both Gaughan and Morton realised the album was developing into a \"special\" one; Morton recalled: \"It was one of those situations where money really wasn't enough, and as time went on it became obvious that Dick needed more time, so I gave him more time just so we could turn out a great album.\"", "For two and a half decades following the album's release, Gaughan rarely revisited its songs and never played the album in concert, which he said was because \"just about every song demands a precise retuning of his guitar.\" Nonetheless, in January 2007, Gaughan played the album live for the first time at City Halls, Glasgow, as part of the Celtic Connections festival, and was joined by fiddler Brian McNeill from the original album. During the performance, Gaughan declared \"Now Westlin Winds\" to be his favourite song ever. The Herald praised the performance, praising his \"idiosyncratic, intense style\" and noting the absence of \"glib ditties or half-hearted performances.\"", "*Brian McNeill – fiddle (tracks 1 and 7)"]}, {"page": "Brian McNeill (playwright)", "response": ["Brian McNeill (born 1939) is a New Zealand playwright, actor and director.", "Brian McNeill on Playmarket website", "Interview of Brian McNeill by Raymond Hawthorne, Art New Zealand"]}]}}