{"wiki_id": "http://www.wikidata.org/entity/Q1952693", "itemLabel": "Ralph Moffitt", "itemDescription": "professional golfer (1932-2003)", "wikipedia_url": "https://en.wikipedia.org/wiki/Ralph_Moffitt", "wikipedia_page": {"main": "Ralph Lawson Moffitt (18 September 1932 – 18 October 2003) was an English professional golfer. He played in the 1961 Ryder Cup.\nMoffitt was born in Ryton, Tyne and Wear in 1932.", "link_mentions": [{"page": "Peter Alliss", "response": ["|  Ralph Moffitt,  Christy O'Connor Snr"]}, {"page": "BMW PGA Championship", "response": ["| 1962 || Peter Alliss (2) || align=\"center\" |287 || align=center| || 1 stroke ||  Ralph Moffitt Christy O'Connor Snr ||Little AstonSutton Coldfield || align=\"center\" |"]}, {"page": "Peter Thomson (golfer)", "response": ["| align=center|17 || 9 Sep 1961 || News of the World Match Play || align=center colspan=2|3 & 1 ||  Ralph Moffitt"]}, {"page": "British Masters", "response": ["| 1964 ||  Cobie Legrange || align=center|288 || align=center| || 1 stroke ||  Max Faulkner Ralph Moffitt || Royal Birkdale ||", "| 1963 ||  Bernard Hunt || align=center|282 || align=center| || Playoff ||  Ralph Moffitt || Little Aston ||", "| 1962 ||  Dai Rees || align=center|278 || align=center| || 2 strokes ||  Ralph Moffitt Peter Thomson || Wentworth ||"]}, {"page": "Moffitt", "response": ["* Ralph Moffitt (1932–2003), English golfer"]}, {"page": "List of European Ryder Cup golfers", "response": ["| Ralph Moffitt ||  || 1961", "|ENG || align=left|Ralph Moffitt || 1961 || 1961 || 1 || 1 || 0 ||  || 0 || 1 || 0 || 0 || 1 || 0 || 0 || 0 || 0 || 0 || 0 || 0"]}, {"page": "Eric Brown (golfer)", "response": ["*1960 News of the World Match Play, Dunlop Tournament (tie with Ralph Moffitt), Scottish Professional Championship"]}, {"page": "British PGA Matchplay Championship", "response": ["| 1961 || Peter Thomson (2) ||  || Walton Heath Golf Club || align=center|3 & 1 ||  Ralph Moffitt || align=center| || || Neil Coles, Bernard Hunt"]}, {"page": "1961 Ryder Cup", "response": ["| align=left| Ralph Moffitt", "|Ralph Moffitt", "|align=left|Ralph Moffitt || 0 || 0–1–0 || 0–1–0 || 0–0–0"]}, {"page": "List of male golfers", "response": ["| Ralph Moffitt||1932–2003"]}, {"page": "1960 Open Championship", "response": ["|Ralph Moffitt|| ", "|Ralph Moffitt||  ||align=center |72-71=143"]}, {"page": "1962 Open Championship", "response": ["|Ralph Moffitt||||align=center |75-70=145", "|align=center|6||Ralph Moffitt||||align=center|75-70-74=219||align=center|+3"]}, {"page": "1963 Open Championship", "response": ["Peter Alliss, Brian Bamford, Michael Bonallack (a), Fred Boobyer, Ken Bousfield, Eric Brown, Peter Butler, Joe Carr (a), Billy Casper, Bob Charles, Neil Coles, Roger Foreman, Jean Garaïalde, Christy Greene, Tom Haliburton, Jimmy Hitchcock, Brian Huggett, Bernard Hunt, Denis Hutchinson, John Jacobs, Bobby Locke, Jimmy Martin, Cary Middlecoff, Sebastián Miguel, Ralph Moffitt, Kel Nagle, Jack Nicklaus, Christy O'Connor Snr, Arnold Palmer, John Panton, Lionel Platts, Gary Player, Dai Rees, Phil Rodgers, Sandy Saddler (a), Doug Sanders, Syd Scott, Doug Sewell, Dave Thomas, Peter Thomson, Harry Weetman, Ross Whitehead, Brian Wilkes, Guy Wolstenholme", "Peter Alliss, Bob Charles, Roger Foreman, Jean Garaïalde, Brian Huggett, Bernard Hunt, Denis Hutchinson, Jimmy Martin, Sebastian Miguel, Ralph Moffitt, Kel Nagle (3), Christy O'Connor Snr, Arnold Palmer (3,6), John Panton, Phil Rodgers, Syd Scott, Dave Thomas, Peter Thomson (3), Harry Weetman, Ross Whitehead"]}, {"page": "1964 Open Championship", "response": ["|Ralph Moffitt||||align=center|76-72-74=222"]}, {"page": "Indian Open (golf)", "response": ["The inaugural event was held in February 1964. Peter Thomson beat Ralph Moffitt by four strokes. Thomson was the inspiration behind the event. He used to stop off in India while travelling worldwide to play and soon realised the potential for golf and that the best way to promote it would be an international tournament. It was this insight that persuaded the Indian Golf Union to establish the Indian Open. Thompson continued to play in the event and won again in 1966 and 1976. His three wins was equalled by Jyoti Randhawa in 2007. ", "|  Ralph Moffitt"]}, {"page": "Egyptian Open", "response": ["| 1938 ||  ||  Ralph Moffitt (7) || align=center|  || align=center|  ||  || ", "| 1935 ||  ||  Ralph Moffitt (6) || align=center|  || align=center|  ||  || ", "| 1933 ||  ||  Ralph Moffitt (5) || align=center|  || align=center|  ||  || ", "| 1932 ||  ||  Ralph Moffitt (4) || align=center|  || align=center|  ||  || ", "| 1930 ||  ||  Ralph Moffitt (3) || align=center|  || align=center|  ||  || ", "| 1929 ||  ||  Ralph Moffitt (2) || align=center|  || align=center|  ||  || ", "| 1928 ||  ||  Ralph Moffitt || align=center|  || align=center|  ||  || "]}, {"page": "Little Aston Golf Club", "response": ["|  Ralph Moffitt"]}, {"page": "Dunlop Tournament (United Kingdom)", "response": ["|align=center|1960 ||  Eric Brown Ralph Moffitt || Gleneagles Hotel || align=center|273 || Tie || || align=center| || "]}, {"page": "Royal Gold Tournament", "response": ["The Royal Gold Tournament was a golf tournament on the British PGA circuit contested in 1962. It was played in a 12-man round-robin format at the Murcar Links Golf Club, Bridge of Don, Aberdeen, Scotland. Ralph Moffitt won the event with 18 points, 3 ahead of the rest of the field. It was the second round-robin event of the season, following the Esso Golden Tournament.", "Ralph Moffitt won 9 of the 11 matches, giving him 18 points, 3 ahead of the rest. He had scored 16 points before the final afternoon round, 5 ahead of anyone else, giving him a guaranteed victory at that point since only 4 points were available in the final  round. Bernard Hunt had the best aggregate score over the 5 rounds with a total of 351, one better than Ralph Moffitt, winning him an extra £25.", "| 1962 || Ralph Moffitt ||  || align=center|18 || 3 points ||  Bob Charles Bernard Hunt Kel Nagle || align=center|750 || "]}, {"page": "Isao Katsumata", "response": ["In 1964 he played the Far East Circuit. He had much success over the course of the season. In late February he began play at the Philippine Open. The event was held at Wack Wack Golf and Country Club in Manila, Philippines. Katsumata opened with even-par rounds of 72 to put him in a tie for fourth place with Doug Sanders, four back of leader Bob Charles. So far Katsumata had outplayed a number of notable players including Peter Thomson, Gene Littler, and Mike Souchak. In the third round he shot a 73 (+1). Despite the higher score he moved into a tie for third place with Sanders and Thomson, though now six strokes behind leader Charles. In the final round, however, leader Charles played poorly opening doors to the field. Katsumata was unable to take advantage, though, shooting a 74 (+2) to finish in a tie for sixth place. The following week the played the Capitol Hills Open, also in the Philippines. After three rounds he was again in contention, this time at 216, five back of leaders Thomson and Tomoo Ishii. He again played poorly in the final round, however, shooting a 75 to finish in a tie for 10th. The following week he played the Singapore Open. He opened with a 72 (−1) to put him in a tie for 8th place with Frank Phillips, three back of the lead. In the second round he shot a 74 (+1) but against \"heavy rains\" this was among the better rounds of the day. He moved into a tie for third place, one back of leaders Ralph Moffitt and Brian Huggett. In the third round he shot a 75 (+2) but still remained in contention, four back of leader Huggett. In the final round he again played poorly, however, shooting a 77 (+4) to fall into a tie for 18th place. Later in the year, in August, he was chosen as an alternate for Japan's 1964 Canada Cup team."]}]}}