{"wiki_id": "http://www.wikidata.org/entity/Q19585364", "itemLabel": "John Balfour", "itemDescription": "Member of the Queensland Legislative Council", "wikipedia_url": "https://en.wikipedia.org/wiki/John_Balfour_(Queensland_politician)", "wikipedia_page": {"main": "John Balfour  (1820 – 21 March 1875) was a Station owner and Member of the Queensland Legislative Council.", "link_mentions": [{"page": "John Balfour", "response": ["John Balfour may refer to:", "* John Balfour (courtier), servant of Mary, Queen of Scots", "* John Balfour, 3rd Lord Balfour of Burleigh (died 1688), Scottish lord", "* John Balfour, 1st Baron Kinross (1837–1905), Scottish lawyer and politician", "* John Balfour, 3rd Baron Kinross (1904–1976), Scottish historian and writer ", "* John Balfour (bishop) (died 1488), bishop of Brechin, 1465–1488", "* John Balfour (diplomat) (1894–1983), British ambassador", "* John Balfour (Orkney MP) (1750–1842), British politician", "* John Balfour (Queensland politician) (1820–1875), member of the Queensland Legislative Council"]}, {"page": "Members of the Queensland Legislative Council, 1860–1869", "response": ["|| John Balfour ||  ||  || Resignation"]}, {"page": "169 Mary Street, Brisbane", "response": ["The land was granted first to John Balfour in 1852. In 1885 the property was transferred to William Allan, then in 1887 he was joined by William Graham as tenants in common. Both Allan and Graham came from Edinburgh originally, and had a number of business interests in common, including sitting on the first board of the Royal Bank of Queensland, established in 1885, and were closely associated with BD Morehead & Co. An expansion of commercial and building activity in Brisbane in the 1880s transformed the streets around lower Edward Street, which were close to the wharves along the town reach of the Brisbane River, into a warehouse precinct. Built as an investment, Allan's and Graham's warehouse reflects this development phase, and remains one of a small group of late Victorian warehouses surviving in Brisbane. Other comparable buildings include the Metro Arts Building (1890), Spencer's Building (1890) and the Brisbane and Area Water Board Building (1886) in Edward Street, Charlotte House (1888) in Charlotte Street, Watson Brothers Building (1887) in Margaret Street, and Tara House (1878) and Heckelmann's Building (1891) in Elizabeth Street."]}, {"page": "George Forbes (Queensland politician)", "response": ["George Forbes was born on 8 August 1828 in Edinburgh, Scotland. He settled in Australia in about 1849, becoming a prominent squatter before forming a partnership with John Balfour in 1854 in Colinton, the Brisbane Valley, buying the business in 1862."]}, {"page": "Cressbrook Homestead", "response": ["David Cannon McConnel arrived in Sydney from Britain in February 1840 where he purchased sheep and started searching for a suitable pastoral lease. His search took him northward to the Moreton Bay region recently opened for selection after the closure of the penal colony. After this event, many eager British immigrants, including the Leslie Brothers, Wickham, the Bigge Brothers and John Balfour were selecting land in the Moreton Bay area. McConnel pressed northward past the rich Darling Downs into the Brisbane River Valley which became the next centre of pastoral development after land on the Darling Downs was fully selected. The Brisbane River Valley was explored by both Cunningham and Patrick Logan in the late 1820s and many squatters took up land in the early 1840s.", "On 15 July 1841 David McConnel took up 240 square miles of land in the Valley, with the Brisbane River and a creek running through. David McConnel was the son of James McConnel who founded a machine making company in Manchester after which, in 1835, he became the owner of the long established and Cressbrook Mill in Derbyshire where lace thread was produced. It was here that the McConnels established their family home and it was to commemorate this place that David McConnel named his Australian property and the creek running through the property. Within one year, Francis and Frederic Bigge established the adjoining Mount Brisbane Station and six months after this John Balfour took up land on the other side of Cressbrook for his station, Colinton."]}, {"page": "Monsildale Homestead", "response": ["The Brisbane River's watershed, of which Monsildale Creek is a part, was one of the earliest areas of Queensland to be settled outside of the Moreton Bay penal settlement. Pastoralists first drove their sheep onto the Darling Downs from New South Wales in 1840, and squatters moved into the Brisbane River Valley the following year. David Cannon McConnel formally established Cressbrook Station in July 1841, and was the first squatter to settle with his stock east of the Great Dividing Range in the future colony of Queensland. He was followed in late 1841 by John Balfour (Colinton Station), the Mackenzie brothers (Kilcoy Station), the Archer brothers (Durundur Station), and the Bigge brothers (Mount Brisbane Station). Pastoralists in the Brisbane River Valley soon switched from sheep to cattle, as sheep were not well suited to the local climate."]}, {"page": "Kilcoy Homestead", "response": ["The Kilcoy run had been taken up as a sheep station by brothers Evan and Colin Mackenzie, of Kilcoy, Scotland, who had started clearing the land and erecting huts by early July 1841. In October that year they secured the run officially, taking out the second pastoral licence issued for the Upper Brisbane Valley. In the New South Wales Government Gazette of 11 May 1848, Kilcoy was described as comprising over , bounded on the south by Frederic and Francis Bigge's Mt Brisbane Station, on the east by the Archers' Durundur Station, on the west by John Balfour's Colinton run, and to the north by the mountains separating Wide Bay from the Brisbane Valley. Establishment of Kilcoy station was resisted by the indigenous population, and the run is infamous for the mass poisoning of Aborigines that occurred there in February 1842."]}, {"page": "Dundalli", "response": ["* 1841 June–August. Evan MacKenzie establishes a station on the western edge of Dalla territory; John Balfour sets up his Colinton station on Wakka Wakka lands; Frederick and Francis Bigge develop their Mount Brisbane station on Yaggera country; and the Archer brothers get a lease of their Durandur run on Dalla land."]}]}}