{"wiki_id": "http://www.wikidata.org/entity/Q19561464", "itemLabel": "Nicholas McCarthy", "itemDescription": "British one handed pianist", "wikipedia_url": "https://en.wikipedia.org/wiki/Nicholas_McCarthy_(pianist)", "wikipedia_page": {"main": "Nicholas McCarthy is a British classical pianist. Born without a right hand, he was the first left-hand-only pianist to graduate from the Royal College of Music in London in its 130-year history.McCarthy was raised in Tadworth, Surrey. He began his piano studies at 14, and by 17 was accepted into the Junior department at the Guildhall School of Music and Drama, where he won the annual piano prize, on the proviso that he focus on repertoire written specifically for the left hand.  He then enrolled in the keyboard department at the Royal College of Music, becoming its first left-hand-only graduate in 2012.\nMcCarthy was an original member of the Paraorchestra, an ensemble founded by conductor Charles Hazlewood in 2011, which performed alongside Coldplay during the closing ceremony of the 2012 Summer Paralympics in London in September 2012. He left the Paraorchestra shortly after to pursue several international solo tours.On 23 September 2013 McCarthy spoke of his experiences at a TED conference held at the Royal Albert Hall. In 2014 he featured as a guest presenter for the BBC Proms televised broadcast.On 4 November 2015, McCarthy appeared on BBC Radio 4's Front Row programme, during which he discussed the recording of his debut album Solo, which had recently reached Number 4 in the classical music charts.", "link_mentions": [{"page": "Géza Zichy", "response": ["The Brazilian composer and virtuoso pianist Artur Cimirro has recorded Zichy's entire piano output for the CD label Acte Préalable. According to Jonathan Welsh:„it is hard to believe there is only one hand at work here as the level of detail to be heard is incredible” or „We finish with the impossibly difficult arrangement of Schubert's Erlkönig for left hand. Here all four voiced sections of Schubert’s masterpiece are presented with just five fingers. The effect is incredible, not just for the pianist; it also shows off Zichy's considerable powers as an arranger.” Zichy’s compositions are also part of the repertoire of British pianist Nicholas McCarthy.", "*2015 : Parlaphone Records  - Solo (Liszt/Zichy: Liebesträume Nr 3), (Nicholas McCarthy)", "* Liszt/Zichy: Liebesträume Nr 3 (Youtube: played by Nicholas McCarthy)", "* Schubert/Liszt/Zichy: Erlkönig (Youtube: played by Nicholas McCarthy)"]}, {"page": "Paraorchestra", "response": ["The Paraorchestra began with 17 members, but plans to add more in the near future. Its members in 2012 included Nicholas McCarthy, a one-handed pianist who graduated from the Royal College of Music in 2012, Clarence Adoo, a former jazz trumpet player who was paralysed below the shoulders after a car accident in 1995 (and now plays an instrument known as \"Headspace\", which is controlled by breath and head motions, developed for him by Rolf Gehlhaar), Gemma Lunt, a viola player who uses a wheelchair and Lyn Levett, who uses a Macintosh to play what Hazlewood feels is \"dizzyingly creative\" electronic music. Blind members of the Paraorchestra included pianist and violinist Abi Baker, James Risdon on recorder, Matthew Wadsworth on the lute, violist Takashi Kikuchi, and multi-instrumentalists Baluji Shrivastav and Ziad Sinno. In 2012 the Paraorchestra added 15-year-old deaf viola player Tilly Chester to its lineup. Hazlewood had encountered her playing with the National Youth Orchestraof which she was also a member."]}, {"page": "Nicholas McCarthy", "response": ["Nicholas McCarthy may refer to:", "*Nicholas McCarthy (director), director and writer", "*Nicholas McCarthy (pianist), British pianist"]}, {"page": "Create (charity)", "response": ["Patrons include: choreographer/director Sir Matthew Bourne OBE, writer Esther Freud, musician Dame Evelyn Glennie, composer/TV presenter Howard Goodall CBE, Royal Academician Ken Howard OBE, Guardian columnist/ex-offender Erwin James and pianist Nicholas McCarthy."]}, {"page": "Opus Theatre", "response": ["Performers appearing at the venue include Carly Paoli, Sunny Li, the London Mozart Players , the London Piano Trio, Nicholas McCarthy and many others."]}]}}