{"wiki_id": "http://www.wikidata.org/entity/Q19518292", "itemLabel": "Norman Stanley Williams", "itemDescription": "British medic", "wikipedia_url": "https://en.wikipedia.org/wiki/Norman_Stanley_Williams", "wikipedia_page": {"main": "Professor Sir Norman Stanley Williams  (born 15 March 1947) is a British surgeon and former President of the Royal College of Surgeons of England (2011–14). He was knighted in the 2015 New Year Honours.He was educated at Roundhay School, Leeds, and at the London Hospital Medical College (University of London). He attended  the University of California, Los Angeles (UCLA), as a Fulbright scholar in 1980. In 1982, he was appointed Senior Lecturer/Honorary Consultant Surgeon at the University of Leeds and the Leeds General Infirmary. He subsequently was appointed to the Chair of Surgery at his alma mater in 1986 and in 1995 became the Head of the merged Academic Department of Surgery of Barts and The London School of Medicine and Dentistry, Queen Mary, University of London and Honorary Consultant Colorectal Surgeon at The Royal London Hospital.His main clinical interests have revolved around sphincter saving procedures and his scientific endeavours have concentrated on gastrointestinal pathophysiology.He is senior editor of the 27th Edition of Bailey and Love’s Short Practice of Surgery (having co-edited 5 previous editions), co-author of Surgery of the Anus, Rectum and Colon now in its 4th Edition and is a founding trustee, Chairman and now President of Bowel & Cancer Research.He was awarded the Patey Prize of the Surgical Research Society (1978), the Moynihan Travelling Fellowship (1985), the Society of Authors’ Prize (Jointly 1995) the Nessim Habif Prize, University of Geneva (1995), the Galen Medal of the Worshipful Company of Apothecaries (2003) and the Cutler’s Surgical Prize (jointly in 2011).He has been President of the Society of Academic & Research Surgery, President of The Ileostomy & Internal Pouch Support Group, Chair of the UKCCCR committee on Colorectal Cancer, President of European Digestive Surgery, President of The International Surgical Group and Vice Chair of The British Journal of Surgery.He was a member of the Secretary of State for Health’s Transparency Group (2014–15), chaired the European Working Time Regulations Taskforce (2013–14), co-chaired the Duty of Candour Review (2014) and was the Medical Advisor to Sir Robert Francis’ Freedom to Speak Up Review (2014–15).He was Chair of Health Education England’s Commission on Training for Patient Safety (2015–16) and Chair of NHS England’s National Patient Safety Collaborative (2014–16).In October 2015, he was appointed senior clinical adviser to the then Secretary of StateJeremy Hunt.During this period he chaired a Rapid Review of Gross Negligence Manslaughter in Healthcare commissioned by Her Majesty’s Government which reported in June 2018.Between 2016-19, he was a Non Executive Director at St George's NHS Foundation Trust and is at present Chair of the National Clinical Improvement Programme (NCIP) which is an integral part of the Getting Right First Time (GIRFT) initiative, Chair of the Independent Reconfiguration Panel (IRP) and a board member of the Private Healthcare Information Network (PHIN).", "link_mentions": [{"page": "Royal College of Surgeons of England", "response": ["|Sir Norman Stanley Williams|| 2011–2014"]}, {"page": "Roundhay School", "response": ["| Prof Sir Norman Stanley Williams || 1947 || || Professor of Surgery and Head of Centre for Academic Surgery at Barts and The London School of Medicine and Dentistry since 1986, President of Academic and Research Surgery since 2009"]}, {"page": "Hunterian Oration", "response": ["*2011 Norman Stanley Williams"]}, {"page": "2015 New Year Honours", "response": ["* Professor Norman Stanley Williams, Past President, Royal College of Surgeons of England. For services to Surgery"]}, {"page": "Norman Williams", "response": ["* Sir Norman Stanley Williams, British surgeon"]}, {"page": "Peter Freyer", "response": ["Every year, the Sir Peter Freyer Memorial Lecture and Surgical Symposium, established in 1975 by professor O'Beirn, is hosted  by the Department of Surgery, NUI Galway. Past lecturers have included Peter Froggatt in 1984, Thomas E. Starzl  in 1985, Mutsuo Sugiura in 1986, Thomas J. Fogarty in 1987, Bernard Fisher (scientist) in 1988, Norman Stanley Williams in 1989, Geoffrey Duncan Chisholm in 1991, Patrick J. Kelly in 2001, Ara Darzi in 2002, Steven D. Wexner in 2004, Peter T. Scardino in 2006 and Patrick Gullane in 2009."]}]}}