{"wiki_id": "http://www.wikidata.org/entity/Q19519591", "itemLabel": "Charlie Walsh", "itemDescription": "Footballer (1910-1954)", "wikipedia_url": "https://en.wikipedia.org/wiki/Charlie_Walsh_(footballer)", "wikipedia_page": {"main": "Charles Henry Walsh (27 October 1910 – 24 April 1954) was an English footballer who played as an inside forward in the Football League for Brentford. He made one FA Cup appearance for Arsenal in 1933. Injury forced Walsh into early retirement in 1935.", "link_mentions": [{"page": "Herbert Chapman", "response": ["In the FA Cup third round, Arsenal had been drawn against Walsall of the Third Division North. Arsenal, as the previous season's losing finalists and league leaders, were clear favourites to win the match. On the day, five of the Arsenal first team were out with injury or flu and had their places taken by reserves.Soar & Tyler, p. 63 Arsenal lost 2–0 in one of the greatest FA Cup upsets. Chapman was enraged by the result, and showed his ruthlessness by selling one player, Tommy Black, who had conceded a penalty in the game, to Plymouth Argyle within a week of the result; another, striker Charlie Walsh, was sold to Brentford a week later.Soar & Tyler, p. 64"]}, {"page": "Charlie Walsh", "response": ["David Barry Vivian Walsh, O.A.M., Dip.T.(Tech), better known as Charlie Walsh, is a former racing cyclist, cycling coach and academic."]}, {"page": "History of Arsenal F.C. (1886–1966)", "response": ["Arsenal bounced back the following season, winning their second League title. Arsenal had started the season weakly, but then went on a long winning run to catch up and then overtake fellow title challengers Aston Villa, whom they beat 5–0 at Highbury in April to clinch the title. By this time Chapman's first set of signings had started to show their age, so with an eye to the future Chapman promoted George Male to the first team to replace Parker, and signed Ray Bowden to take over from Jack. The team did, however, lose to Walsall of the Third Division North in a major upset in the FA Cup; five of the first team were out with injury or flu and had their place taken by reserves, and without them Arsenal lost 2–0 in one of the greatest FA Cup upsets of all time. One of the stand-ins, Tommy Black, was particularly to blame, conceding a penalty for Walsall's second, and was sold by an enraged Chapman to Plymouth Argyle within a week of the result; another, striker Charlie Walsh, was transferred to Brentford a week later."]}, {"page": "1932–33 Brentford F.C. season", "response": ["|Charlie Walsh", "| style=\"text-align:left;\" |Charlie Walsh", "| style=\"text-align:left;\" |Charlie Walsh", "| Charlie Walsh"]}, {"page": "1934–35 Brentford F.C. season", "response": ["| Charlie Walsh"]}]}}