{"wiki_id": "http://www.wikidata.org/entity/Q19571788", "itemLabel": "GFOTY", "itemDescription": "British pop singer", "wikipedia_url": "https://en.wikipedia.org/wiki/GFOTY", "wikipedia_page": {"main": "Polly-Louisa Salmon (born 19 July 1990), better known by her stage name GFOTY, an abbreviation of Girlfriend of the Year, is a British pop singer. From 2013 to 2018, she released music through the PC Music label. She is currently signed to Pretty Wavvy. Much of her work has been in the form of mini-mixes.", "link_mentions": [{"page": "1990 in music", "response": ["*July 19 – GFOTY, British EDM Pop singer with PC music"]}, {"page": "Bobby", "response": ["* \"Bobby\", a 2013 song by GFOTY"]}, {"page": "West Hampstead", "response": ["* GFOTY – artist and musician "]}, {"page": "Jeff Salmon", "response": ["Originally from East London, Salmon worked for Sotheby's between 1970 and 1977. Aged 24, he set up his own business specialising in art nouveau and art-deco. Dealing in mainly in mid-20th-century design he owns businesses, based in Marylebone, London. They include Decoratum, which encompasses the two largest 20th-century furniture and design galleries in London. It was listed by The Guardian newspaper as one of the most favourite shops in west London. Salmon also runs a number of other companies in areas such as health care, air conditioning and facilities for people with disabilities as well as owning the rights to His Excellency, a Gilbert and Sullivan style opera. Salmon lives with his partner Lucia and has four children. His daughter Polly records music under the name GFOTY."]}, {"page": "Kitty (rapper)", "response": ["On October 17, 2019, Kitty announced the formation of her label Pretty Wavvy. Formed by Kitty in partnership with Regime Music Group, Pretty Wavvy is home to all of Kitty's music and has signed artists including The Pom-Poms, Ricky Eat Acid, GFOTY, Pinky Swear, and onlytom."]}, {"page": "Ryan Hemsworth", "response": ["Hemsworth launched his label Secret Songs in 2014. It has since released music from artists across the world including Tennyson, GFOTY, and Kero Kero Bonito. It has also released compilation albums such as shh#ffb6c1 and shh#000000."]}, {"page": "Sophie (musician)", "response": ["Sophie Xeon (17 September 198630 January 2021), known mononymously as Sophie (stylised in all caps), was a Scottish musician, record producer, singer and DJ. Known for a brash and \"hyperkinetic\" take on pop music, Sophie worked closely with artists from the PC Music label, including A.G. Cook and GFOTY, and produced for acts such as Charli XCX, Vince Staples, Kim Petras, Madonna, Let's Eat Grandma, and Namie Amuro.", "Sophie's next single, \"Lemonade\"/\"Hard\", was released in August 2014, with vocal contributions on the former from fellow musician Nabihah Iqbal and model Tess Yopp and vocal contributions on the latter from PC Music artist GFOTY. Numbers released \"Lemonade\"/\"Hard\" as a 12\" single. Both tracks appeared on the Billboard Twitter Real-Time charts. \"Lemonade\" and \"Hard\" placed 68th and 91st respectively on the 2014 Pazz & Jop critics poll, and the single was included in the top ten of year-end singles lists by The Washington Post, Resident Advisor, Complex, and Pitchfork; \"Hard\" was included in the top ten on lists by Dazed and Dummy. \"Lemonade\" appeared in a 2015 commercial for McDonald's."]}, {"page": "PC Music", "response": ["PC Music is a record label and art collective based in London and run by producer A. G. Cook. It was founded in 2013, making its music available on SoundCloud that year. Artists on its roster have included Hannah Diamond, GFOTY, Danny L Harle, EASYFUN, Namasenda, and Planet 1999. The label's releases have been showcased on the compilations PC Music Volume 1 (2015) and Volume 2 (2016).", "On 16 February 2018, PC Music released a limited dual-vinyl compilation of both PC Music Volume 1 and PC Music Volume 2 and in December 2018, PC Music announced new vinyl and CD reissues of PC Music Volume 1 and PC Music Volume 2, as well as the first physical release of the label's Month of Mayhem compilation. GFOTY also announced her departure from the label at this time. She has since signed with a new label, Pretty Wavvy.", "PC Music have produced a number of label focused showcases since their inception. After a brief showcase at SXSW in 2015, on 8 May 2015, PC Music launched a \"multimedia reality network\" called 'Pop Cube'. An event in conjunction with the network was created and became part of the Red Bull Music Academy Festival in New York, which quickly sold out. In May 2016, PC Music presented 'Pop Cosmos' at the Scala in London, featuring Danny L Harle, Hannah Diamond, GFOTY, A. G. Cook, Felicita, Easyfun and Spinee. In July 2016 PC Music held a new one-off event called 'Pop City' at Create in Los Angeles. As well as scheduled performances from PC Music performers, the show featured guests, including Carly Rae Jepsen, Charli XCX, and QT. On the 405 webzine, PC Music’s live shows have been described as being surrounded by a care-less authentic aura and have been recognised for their \"forward-thinking fearlessness to push pop music into new and daring areas\".", "* GFOTY"]}, {"page": "A. G. Cook", "response": ["Cook released his first solo singles in 2014. He has also collaborated with PC Music artists such Hannah Diamond, GFOTY, EASYFUN, Danny L Harle and felicita. He formed the one-off project QT with musician Sophie and performance artist Hayden Dunham, producing the 2014 single \"Hey QT\". Cook came into the public eye as Charli XCX's creative director and has executively produced her last four projects: Number 1 Angel, Pop 2, Charli and How I'm Feeling Now.  Cook was named #12 in the Dazed 100 for \"redefining style and youth culture in 2015 and beyond\". Cook released his two debut albums 7G and Apple, and received the Variety Hitmakers Innovator of The Year Award in 2020.", "In contrast to most of the artists on PC Music, Cook wears plain clothing. GFOTY jokingly characterised his style as normcore.", "|GFOTY", "|GFOTY"]}, {"page": "Hannah Diamond", "response": ["Diamond met GFOTY through a friend, and GFOTY introduced her to A. G. Cook. After a vocalist failed to show up to a session with Cook, the two worked on their first musical collaboration. In 2012, they recorded Diamond's first solo song, titled \"Attachment\". Diamond released her debut single \"Pink and Blue\" through PC Music in October 2013. The song resembles a lullaby, with a harshly synthetic quality. The attention received by \"Pink and Blue\" helped to introduce the fledgling label, and it placed 5th on Facts list of \"The 100 best tracks of the decade so far\"."]}, {"page": "GFOTY (musician)", "response": ["#REDIRECT GFOTY"]}, {"page": "Girlfriend of the Year", "response": ["#REDIRECT GFOTY"]}, {"page": "Polly-Louisa Salmon", "response": ["#REDIRECT GFOTY"]}, {"page": "Danny L Harle", "response": ["Harle has been married to Poppy Harle since January 2018. Together, they have a daughter, Nico, born in November 2018. Former PC Music labelmate GFOTY is her godmother."]}, {"page": "Kero Kero Bonito", "response": ["As well as Kane West, Lobban also releases solo work as Augustus, a project influenced heavily by Japanese city pop music. Under this name he has released an original song entitled \"Vs.\" (as part of a promotional compilation for Zoom Lens), as well as cover versions of songs by GFOTY and Perfume. He also provides vocals on the song \"Money Won't Pay\" by fellow London musician bo en. In addition to these two projects, Lobban co-wrote and produced two tracks on Saint Etienne's 2017 album Home Counties."]}, {"page": "PC Music Volume 1", "response": ["Because the label releases most of its work for free, \"Every Night\" by Hannah Diamond had been the only song available for purchase. PC Music Volume 1 includes one new track—\"USA\" by GFOTY, which had previously appeared on her Secret Mix.", "In more mixed reviews, Rolling Stone's Jon Dolan said that with the exception of A. G. Cook's \"Beautiful\", \"the songs are only as good as the concept, which wears thin fast.\" A review published in The Wire described the song as \"glossy, giddy, sparkly and shallow\", much like music that would fitting wealthy private school teenaged student's sleepover.The Wire. August 2015. p.55. Xavier Boucherat described how he scored the album on a 20-point scale in his review for the magazine Crack: \"2 points for Danny 'dick in the pants' Harle for having arguably the funniest moniker out, 2 for those 'Red Bull own PC Music' rumours that you yourselves probably started, and 6 for GFOTY who weirdly reminds me of my mum.\""]}, {"page": "VIPOTY", "response": ["#REDIRECT GFOTY"]}, {"page": "Lemonade (Sophie song)", "response": ["\"Lemonade\" (stylized in all caps) is a song by Scottish producer Sophie. It was released as a single on 4 August 2014 by the label Numbers, and was backed by the B-side \"Hard\". The single features vocal contributions from Nabihah Iqbal on \"Lemonade\" and PC Music artist GFOTY on \"Hard\". The song was met with polarizing critical response, and appeared on various best-of year-end single polls. \"Lemonade\" was subsequently featured in a 2015 McDonald's television advert."]}, {"page": "The Argument (disambiguation)", "response": ["* The Argument, a song by GFOTY from Call Him A Doctor"]}, {"page": "Easyfun", "response": ["|GFOTY", "|GFOTY, A. G. Cook, Easyfun"]}, {"page": "List of avant-pop artists", "response": ["*GFOTY"]}, {"page": "A. G. Cook discography", "response": ["|GFOTY", "|GFOTY, Cook", "| rowspan=\"14\" |GFOTY", "| rowspan=\"3\" |GFOTY, Cook", "|GFOTY, Cook, EASYFUN", "|GFOTY, Cook", "| rowspan=\"9\" |GFOTY, Cook, Johnny White", "|GFOTY", "|GFOTY, Cook", "| rowspan=\"17\" |GFOTY", "| rowspan=\"17\" |GFOTYBUCKS", "| rowspan=\"17\" |GFOTY, Cook", "|\"Mysterious GFOTY\"", "(ft. A. G. Cook, GFOTY, Danny L Harle, Lil Data,"]}, {"page": "1000 Gecs and the Tree of Clues", "response": ["\"Stupid Horse (Remix)\" featuring British singer GFOTY and DJ Count Baldor was released on May 22, 2020 alongside an animated music video. The remix swaps out the ska-influenced guitars of the original for a \"shredder-like synths\" described as a \"Blink-182 and Sleigh Bells mashup on the verge of implosion.\""]}, {"page": "PC Music Volume 2", "response": ["Described as an electropop, synth-pop, and \"house-fueled\" album, PC Music, Volume 2 features the group's trademark  \"marriage of pop hooks, rubbery synths, and beguiling female vocals,\" as well as \"a mix of styles appropriated from both the dance underground and Top 40\". GFOTY's song \"Poison\" introducing nu-rave and industrial elements to the label's sound. Hannah Diamond's \"Hi\" was praised for its \"restrained\" sound and proving \"that PC Music wheelhouse is far larger than just chrome-painted dance pop.\" \"Super Natural\" features Canadian singer Carly Rae Jepsen, a choice that was noted for breaking the mould in comparison to the \"often metallicized\" and manipulated vocals usually present on PC Music songs. Many of the songs feature an \"allergy\" to the polyrhythms typical in dance music, like on \"Super Natural\" \"where beats, hand claps, and screamingly dense Eurodance keyboards are all pulsing at you as one\". \"Fade Away\" has been described as \"immensely satisfying trance-pop\".  \"A New Family\" by Felicita features \"horror-film whispers emerging from underneath the sort of crunchy torrent of sound favored by so-called post-club producers.\""]}, {"page": "PC Music discography", "response": ["|GFOTY", "|GFOTY", "|GFOTY", "|GFOTY", "| rowspan=\"2\" |GFOTY", "|GFOTYBUCKS", "|GFOTY", "|GFOTYBUCKS: RED CUPS"]}]}}