{"wiki_id": "http://www.wikidata.org/entity/Q19519618", "itemLabel": "Maurice Roberts", "itemDescription": "English footballer (1922-1993)", "wikipedia_url": "https://en.wikipedia.org/wiki/Maurice_Roberts_(footballer)", "wikipedia_page": {"main": "Maurice Ernest Stanley Roberts (5 July 1922 – April 1993) was an English professional football outside left who played in the Football League for Brentford.", "link_mentions": [{"page": "1945–46 Brentford F.C. season", "response": ["|Maurice Roberts", "| style=\"text-align:left;\" |Maurice Roberts", "| style=\"text-align:left;\" |Maurice Roberts"]}, {"page": "1946–47 Brentford F.C. season", "response": ["After three successive top-six finishes in the First Division beginning in 1935–36, Brentford's decline began with the departure of key players during the 1938–39 season, which culminated with a near-relegation. For 1946–47, the first Football League season since the end of the Second World War, manager Harry Curtis was able to call on many of his regular players from the final pre-war seasons, though the elder players, such as Irish international full back Bill Gorman, utility man Buster Brown and former Wales forward Idris Hopkins, were all at age 35. Long-serving forward and once-capped England international Billy Scott had remained with the club and was then aged 38. The team fielded versus Aston Villa on 1 February 1947 was the oldest in club history, with an average age of over 31.5 years. Curtis supplemented the squad by bringing in wing half Cyril Toulouse and forwards John Gillies, Maurice Roberts, Alan Smith and George Stewart. As in the final pre-war seasons, Curtis would also promote players from the Bees' reserve ranks, signing amateur Roddy Munro to a professional contract and handing debuts to Frank Latimer, John Moore and Wally Bragg, with Bragg going on to become the youngest-ever Brentford debutant at that time.", "|Maurice Roberts", "| style=\"text-align:left;\" |Maurice Roberts", "| Maurice Roberts", "| Maurice Roberts", "| Maurice Roberts"]}, {"page": "Maurice Roberts (disambiguation)", "response": ["Maurice Roberts can refer to:", "* Maurice Roberts (1905–1975), American ice hockey player", "* Maurice Roberts (cricketer) (1916–1998), Australian cricketer", "* Maurice Roberts (footballer) (1922–1993), English footballer", "* Maurice Roberts (minister) (born 1938), English minister"]}]}}