{"wiki_id": "http://www.wikidata.org/entity/Q19518133", "itemLabel": "Roy Scammell", "itemDescription": "British stunt actor (1932-2021)", "wikipedia_url": "https://en.wikipedia.org/wiki/Roy_Scammell", "wikipedia_page": {"main": "Royston Edwin Scammell (28 July 1932 – 15 May 2021) was a British stuntman and actor.", "link_mentions": [{"page": "Inferno (Doctor Who)", "response": ["Stuntman Derek Ware did not actually perform the stunt in which his character, the mutated RSF Trooper Wyatt, having been shot, falls to his death from the top of one of the chemical tanks, in case he was injured (since he was also needed for the subsequent studio recording). His place was taken by Roy Scammell, who (ironically) also played the soldier who fired the fatal shot. Ware stated in an interview that Scammell had already signed the contract to do the fall before Ware had been cast as Wyatt. At the time it was filmed, it was the highest fall ever performed by a British stuntman."]}, {"page": "The Ambassadors of Death", "response": ["Location filming took place during January and February 1970 at Blue Circle Cement in Kent, Marlow Lock in Buckinghamshire, Southall Gas Works in Middlesex, and various sites in Aldershot, Hampshire. Studio recording then took place during February and March 1970. The alien underneath the spacesuit was achieved by layering the actor's face with blue make-up, tissue and latex rubber. Because it was uncomfortable for the actors, the make-up was applied shortly before they had to go on set. As the story was supposed to take place in the late 1970s, the spacesuit was designed as a futuristic version. Roy Scammell performed as a stunt double for Caroline John when she is pursued in Bessie and captured on the weir. Her husband, Geoffrey Beevers, briefly appears as a UNIT radio operator, credited as \"Private Johnson\"."]}, {"page": "The Best of Benny Hill", "response": ["*Roy Scammell"]}, {"page": "The Dorcons", "response": ["* Roy Scammell — Maya/Creature"]}, {"page": "Breakaway (Space: 1999)", "response": ["* Roy Scammell — Jim Nordstrom"]}, {"page": "Circus of Fear", "response": ["* Roy Scammell as Speedboat man"]}, {"page": "London Film and Comic Con", "response": ["| 17–19 July 2015|| Olympia|| Sigourney Weaver, Michael J. Fox, Richard Dean Anderson, Alan Flyng, Alan Harris, Alan Swaden, Alexander Siddig, Alice Krige, Arti Shah, Amazon Eve, Ben Champniss, Bill Hargreaves, Bill Paxton, Brad Greenquist, Carice Van Houten, Carrie Henn, Cameron Jebo, Catherine Tate, Christopher Benjamin, Christopher Lloyd, Claudia Wells, Clifton Collins Jr, Colette Hiller, Colin Baker, Daniel Portman, Darren Lynn Bousman, Dave Prowse, David Barclay, Derek Chafer, Derrick Sherwin, Donald Fullilove, Doug Robinson, Eileen Roberts, Elsa Gwilliam, Erik Bauersfeld, Erin Cahill, Finn Jones, Gareth David-Lloyd, Garrett Wang, Gemma Whelan, Gregg Henry, Harry Treadaway, Harry Waters Jr, Hayley Atwell, Iain Glen, Ian Liston, J. LaRose, Jack McKenzie, James Remar, Jamie Hill, James Tolkan, Jason David Frank, Jason Faunt, Jacqueline Kim, Jeffrey Weissman, Jessica Henwick, Jennifer Rubin, Jeremy Bulloch, Jim Dowdall, Joe \"Animal\" Laurinaitis, Jodi Lyn O'Keefe, John Bell, John Gomez, John Ratzenberger, John Morton, Julian Glover, Jonathan Pryce, Kenny Baker, Kelly Jo Minter, Kelly Hu, Keisha Castle-Hughes, Ken Colley, Ken Kirzinger, Kevin Eastman, Kit Hillier, Kristian Nairn, Lasse Wirdestedt, Lea Thompson, Leif Tilden, Len Bond, Luke Pasqualino, Marc McClure, Mark Capri, Marolyn Turk, Maimie McCoy, Marnix Van Den Broeke, Michael Gambon, Michelan Sisti, Michael Traynor, Naomi Grossman, Neve Campbell, Nick Palma, Nicole de Boer, Paul Jerricho, Peta-Maree Rixon, Peter Shinkoda, Reeve Carney, Ray Hassett, Ray Park, Rey Mysterio, Ricky Dean Logan, Robert Englund, Robert Kurtzman, Robert Rusler, Robert Watts, Rocky Johnson, Rose Leslie, Roy Scammell, Sean Gunn, Sherilyn Fenn, Simon Russell Beale, Steve Cardenas, Stephen Fitzalan, Stephen Calcutt, Steve Coulter, Tara Ward, Terry Sach, Terrence Mustoo, Tina Simmons, Tim Russ, Tim McInnerny, Trevor Butterfield, Trevor Steedman, Tom Burke, Tom Savini, Tom Walker, Tommy Weldin, William Forsythe, Dan Slott"]}, {"page": "Alien (film)", "response": ["* Bolaji Badejo as the Alien. Nigerian Badejo, while a 26-year-old design student, was discovered in a bar by a member of the casting team, who put him in touch with Scott. Scott believed that Badejo, at  (7 ft inside the costume) and with a slender frame, could portray the Alien and look as if his arms and legs were too long to be real, creating the illusion that a human being could not possibly be inside the costume. Stuntmen Eddie Powell and Roy Scammell also portrayed the Alien in some scenes.McIntee, 30–31.", "For most of the film's scenes, the Alien was portrayed by Bolaji Badejo. A latex costume was made to fit Badejo's slender  frame by taking a full-body plaster cast. Scott later commented that the Alien \"takes on elements of the host – in this case, a man.\" Badejo attended t'ai chi and mime classes  to create convincing movements for the Alien. For some scenes, such as when the Alien lowers itself from the ceiling to kill Brett, the creature was portrayed by stuntmen Eddie Powell and Roy Scammell—Powell, in costume, was suspended on wires and then lowered in an unfurling motion."]}, {"page": "The Bringers of Wonder, Part One", "response": ["* Roy Scammell — Maya/Alien Animal (Records Lab)"]}, {"page": "The World Is Full of Married Men (film)", "response": ["* Roy Scammell as Jeff Spencer"]}, {"page": "Scammell (surname)", "response": ["*Roy Scammell (1932–2021), British stunt actor"]}, {"page": "2021 in film", "response": ["| style=\"text-align:center;\"| 15 || Roy Scammell || style=\"text-align:center;\"| 88 || style=\"text-align:center;\"| English || style=\"text-align:center;\" | Stuntman, Actor || "]}, {"page": "2021 in the United Kingdom", "response": ["**Roy Scammell, stuntman and actor (Alien, Willow, Flash Gordon) (b. 1932)"]}, {"page": "Deaths in May 2021", "response": ["*Roy Scammell, 88, British stuntman and actor (Alien, Willow, Flash Gordon).Celebrating the life of last action hero Roy Scammell"]}, {"page": "German Comic Con", "response": ["| Amanda Bearse, Billie Piper, Chad L. Coleman, Christopher Lloyd, Christopher Lambert, Dan Starkey, Devon Murray, Ellie Kendrick, Erik Kriek, Famke Janssen, Greg Grunberg, James Marsters, Ken Colley, Ken Kirzinger, Mickey Lewis, Natalia Tena, Paul Blake, Ray Park, Robert Englund, Roy Scammell, Sylvester McCoy, Taimak, Tosin Cole"]}]}}