{"wiki_id": "http://www.wikidata.org/entity/Q1953630", "itemLabel": "Murdo Fraser", "itemDescription": "British politician (born 1965)", "wikipedia_url": "https://en.wikipedia.org/wiki/Murdo_Fraser", "wikipedia_page": {"main": "Murdo MacKenzie Fraser (born 5 September 1965) is a Scottish politician who served as Deputy Leader of the Scottish Conservative Party from 2005 to 2011. He has been a Member of the Scottish Parliament (MSP) for the Mid Scotland and Fife region since 2001. Since May 2021, he has served  as Shadow Cabinet Secretary for Covid Recovery, shadowing Deputy First Minister John Swinney.", "link_mentions": [{"page": "Fort William, Highland", "response": ["On 3 April 2021, it came to light during Gupta's financial troubles involving Greensill Capital that the Jahama Highland Estates (formerly the \"Alcan Estate\") had been purchased in 2016 as part of the Rio Tinto Mines deal for the Lochaber aluminium plant, because the furnace requires so much power that the smelter is located near a hydroelectric plant, which drains the basin of the  Estate. The Estate includes the north face of Ben Nevis. According to reports, the Scottish National Party mandated that the Estate never be split from the hydro plant and aluminium smelter but Gupta ignored them and placed ownership of the Estate in a company that is domiciled on the Isle of Man. The 2016 deal was worth £330 million and was guaranteed by the UK Chancellor of the Exchequer. Conservative finance spokesperson Murdo Fraser was critical about the alleged breach of the SNP agreement and urged the SNP to \"take whatever steps are necessary to protect public funds\"."]}, {"page": "Michael Forsyth, Baron Forsyth of Drumlean", "response": ["In 2011, Forsyth criticised the plans of Conservative MSP Murdo Fraser to disband the Scottish Conservatives and establish a wholly new centre-right party, should he win the forthcoming leadership election. Forsyth later declared his backing for a rival candidate, Ruth Davidson."]}, {"page": "Andrew Moray", "response": ["Moray's early death has meant that his achievements are little known. This situation has been discussed in Scotland's parliament. In December 2009, Murdo Fraser, a Conservative List MSP for Mid-Scotland and Fife, called for a national debate on an appropriate monument to Moray. He stated that it should raise awareness of Andrew Moray's historical role.Scotsman.com, The Scotsman, 26 December 2009 - accessed 3 January 2010 In the late 20th century there was increased recognition of Moray's role in events. One historian recently described his actions as \"the greatest threat to the English government\".Brown, The Wars of Scotland, p.183. "]}, {"page": "Nicola Sturgeon", "response": ["In September 2021, Sturgeon was accused of shutting down debate about gender reforms, after she heckled Murdo Fraser in parliament when he mentioned the Women's Rights Demo organised by feminist campaign group For Women Scotland, and when she described concerns about gender recognition reform as \"not valid\"."]}, {"page": "Mid Scotland and Fife (Scottish Parliament electoral region)", "response": ["|rowspan=\"8\"|Murdo Fraser(Conservative)", "*Murdo Fraser replaced Nick Johnston, who had resigned from the Parliament on 10 August 2001 due to ill health. Fraser was next on the Conservative and Unionist list."]}, {"page": "Young Conservatives (UK)", "response": ["* Murdo Fraser MSP, National Chairman 1991/92"]}, {"page": "Ken Macintosh", "response": ["On 12 May 2016, Macintosh was elected as Presiding Officer of the Scottish Parliament with 71 votes on the third round of voting by MSPs. He defeated Murdo Fraser, Johann Lamont, John Scott and Elaine Smith. He suspended his Scottish Labour Co-operative membership upon taking office, per the tradition of the presiding officer being strictly non-partisan."]}, {"page": "Annabel Goldie", "response": ["Goldie put herself forward as a leadership candidate on 2 November 2005—a joint nomination with Murdo Fraser as her proposed deputy. Their nomination was unopposed and Goldie was appointed leader on 8 November 2005, the first woman to lead the Scottish Conservative Party. In her maiden speech as leader, she promised to act against \"disloyalty and disobedience\" in the party and in a reference to Margaret Thatcher she said, \"I think you may take it matron's handbag will be in hyper-action. There could be worse precedents to follow\"."]}, {"page": "Inverness Royal Academy", "response": ["* Murdo Fraser, Conservative MSP since 2001 for Mid Scotland and Fife"]}, {"page": "Scottish Conservatives", "response": ["In the party leadership elections in 2011, the previous deputy leader Murdo Fraser proposed disbanding the party and creating a new Scottish party of the centre-right, similar to the previous Unionist Party and compared this arrangement to the relationship between the Christian Social Union in Bavaria and the Christian Democratic Union in Germany. The move was opposed by the other three candidates.Sunday Herald Victory went to the newly elected MSP Ruth Davidson who suggested that she would oppose further devolution beyond the new powers proposed by the Calman Commission.", "With an SNP majority delivered, the Scottish Conservatives were reduced from 17 seats to 15, losing the Edinburgh Pentlands constituency to the SNP, seeing notional loses in Eastwood and Dumfriesshire to Labour. Following the election, Annabel Goldie resigned as leader and a leadership election was held in November 2011 – the first to appoint a Leader of the Scottish Conservatives, rather than the Scottish Parliament group, as required by the Sanderson Commission. Ruth Davidson was returned, beating the original front-runner and former deputy leader Murdo Fraser.", "| 1 || 100px || Murdo Fraser || 31 October 2005 || 10 November 2011", "|Murdo Fraser ||Mid Scotland and Fife||2001 || Shadow Cabinet Secretary for Covid Recovery"]}, {"page": "Conservative Friends of Gibraltar", "response": ["*Vice President - Murdo Fraser M.S.P."]}, {"page": "Nick Johnston (politician)", "response": ["His place in the Scottish Parliament was taken by Murdo Fraser."]}, {"page": "Scottish Politician of the Year", "response": ["*2018: Murdo Fraser MSP, Conservative and Unionist", "*2017: Murdo Fraser MSP, Conservative and Unionist", "*2019: Murdo Fraser MSP, Conservative and Unionist", "*2011: Murdo Fraser MSP, Conservative and Unionist"]}, {"page": "Jackson Carlaw", "response": ["In 2011, Carlaw stood as a candidate in the leadership election brought on by Annabel Goldie's resignation. During the campaign, he was hospitalised with appendicitis. Carlaw finished third behind Ruth Davidson and Murdo Fraser. He was appointed as Deputy Leader of the Scottish Conservative Party and Scottish Conservative Spokesperson for Health and Sport by Davidson following her victory.", "On 6 January 2020, Carlaw confirmed his candidacy for the February 2020 Scottish Conservative Party leadership election and launched his campaign in Edinburgh on 15 January. He received support from Ruth Davidson, Murdo Fraser, Adam Tomkins, Liz Smith, Annie Wells and Jamie Greene. This gave Carlaw the position of favourite over his opponent Michelle Ballantyne. He centred his campaign around how he could beat Nicola Sturgeon and the SNP in the next Scottish Parliament election and the local elections in 2022. He also promised to make the Scottish Conservatives more for the middle and working classes and continue to maintain the Scottish Conservatives as the main party of the Union. Carlaw won the election with 4,917 votes in his favour, as opposed to 1,581 for Ballantyne. He promised to provide a \"clear, focused and ambitious alternative to the SNP\"."]}, {"page": "Liz Smith (politician)", "response": ["Smith was narrowly beaten (by just 48 votes) to the Perth seat at the 2001 General Election by the SNP's Annabelle Ewing. She made The Herald Scottish Politician of the Year shortlist for 'The One to Watch' in 2007.The Herald Scottish Politician of the Year 2007  The Herald, November 2007 Smith acted as campaign manager for Murdo Fraser in his leadership election campaign in 2011."]}, {"page": "Opposition Shadow Cabinets of the Scottish Parliament", "response": ["|Murdo Fraser", "|Murdo Fraser", "|Murdo Fraser", "|Murdo Fraser"]}, {"page": "Fraser (surname)", "response": ["*Murdo Fraser (born 1965), Scottish politician"]}, {"page": "2008 UEFA Cup Final riots", "response": ["Many Rangers fans criticised the tactics employed by Greater Manchester Police. In particular, the deputy leader of the Scottish Conservatives' Murdo Fraser suggested the problem might have been caused by heavy-handed policing. He later retracted this after police released footage showing the scale of the problems.Brown brands Rangers riot fans 'a disgrace' - The Scotsman"]}, {"page": "University of Aberdeen School of Law", "response": ["*Murdo Fraser: Deputy Leader of the Scottish Conservatives in the Scottish Parliament and MSP for Mid Scotland and Fife (2003–present)"]}]}}