{"wiki_id": "http://www.wikidata.org/entity/Q19661277", "itemLabel": "Harriet Mathews", "itemDescription": "British diplomat", "wikipedia_url": "https://en.wikipedia.org/wiki/Harriet_Mathews", "wikipedia_page": {"main": "Harriet Lucy Frost, Lady Frost,  (née Mathews; born 22 December 1973, in Lilongwe, Malawi) is a British diplomat, with expertise on African affairs.", "link_mentions": [{"page": "Foreign relations of Somalia", "response": ["Following the establishment of the Federal Government of Somalia in mid-2012, British Prime Minister David Cameron welcomed the new administration and re-affirmed Britain's continued support for the Somali authorities. On 25 April 2013, the UK also became the first Western country to re-open its embassy in Somalia, with British First Secretary of State William Hague attending the opening ceremony. Harriet Mathews was appointed British Ambassador to Somalia in 2015, and as of January 2017 has since been replaced by David Concar."]}, {"page": "David Frost, Baron Frost", "response": ["In 1993 Frost married Jacqueline Elizabeth Dias, divorcing in 2018. He married Harriet Mathews, a former British Ambassador to Somalia, later that year."]}, {"page": "List of alumni of the University of York", "response": ["*Harriet Mathews CMG OBE, British diplomat: BA History, 1996"]}, {"page": "List of ambassadors of the United Kingdom to Somalia", "response": ["*2015–2016: Harriet Mathews"]}, {"page": "Somalia–United Kingdom relations", "response": ["On 25 April 2013, the UK became the first western country to re-open its embassy in Somalia, with British First Secretary of State William Hague attending the opening ceremony in Mogadishu. On 6 June 2013, the British government appointed Neil Wigan as the new British Ambassador to Somalia. He succeeded Matt Baugh. On 16 March 2015, Harriet Mathews was appointed as Wigan's successor as ambassador. He is slated to be transferred to another Diplomatic Service office in June 2015."]}, {"page": "Neil Wigan", "response": ["In June 2013, Wigan was appointed as the UK Ambassador to Somalia, based at the British Embassy in Mogadishu. On 16 March 2015, Harriet Mathews was appointed as Wigan's successor as Ambassador; Wigan was to be transferred to another Diplomatic Service appointment."]}]}}