{"wiki_id": "http://www.wikidata.org/entity/Q19660923", "itemLabel": "Alexander Smollett", "itemDescription": "British politician", "wikipedia_url": "https://en.wikipedia.org/wiki/Alexander_Smollett", "wikipedia_page": {"main": "Alexander Smollett (29 November 1801 – 25 February 1881) was a Scottish Conservative Party politician. He was a Member of Parliament (MP) for Dunbartonshire from 1841 to 1859.", "link_mentions": [{"page": "Dunbartonshire (UK Parliament constituency)", "response": ["|1797 || Alexander Smollett||", "|rowspan=\"4\"| Alexander Smollett"]}, {"page": "List of MPs elected in the 1852 United Kingdom general election", "response": ["|Dunbartonshire||Alexander Smollett||Conservative"]}, {"page": "List of MPs elected in the 1857 United Kingdom general election", "response": ["|Dunbartonshire||Alexander Smollett||Conservative"]}, {"page": "Smollett, Alexander", "response": ["#redirectAlexander Smollett"]}, {"page": "Alexander Dennistoun", "response": ["In 1834, shortly before the death of his father, Alexander Dennistoun was elected on 6 January 1835 as member of parliament for Dunbartonshire.  defeating Alexander Smollett of Bonhill. He served for two-and-a-half years, and Hansard records no contributions on the floor of the House of Commons. His daughter comments that Dennistoun \"did not take kindly to parliamentry life, and gave it up when parliament was dissolved\" in July 1837, never again trying for a seat."]}, {"page": "Municipal Buildings, Helensburgh", "response": ["The foundation stone for the new building was laid by the former member of parliament, Alexander Smollett, on 15 August 1878. It was designed by John Honeyman in the Scottish baronial style, built in ashlar stone at a cost of £4,454 and was officially opened on 13 July 1879. The design involved an asymmetrical main frontage with four bays facing onto Princes Street East; the left hand bay, which was slightly projected forward and was gabled, was fenestrated with a three-light window on the ground floor, a cross-window on the first floor and a single casement window on the second floor and was flanked by bartizans. The second bay featured a doorway with a fanlight and a round headed surround decorated with a keystone bearing a bust of Henry Bell; the doorway was flanked by pilasters and brackets supporting an entablature bearing a coat of arms. The other bays were fenestrated with sash windows on the ground floor and the first floor and, at roof level, there were two dormer windows. Internally, the principal room was the council chamber."]}]}}