{"wiki_id": "http://www.wikidata.org/entity/Q19661468", "itemLabel": "Tim Steiner", "itemDescription": "British composer", "wikipedia_url": "https://en.wikipedia.org/wiki/Tim_Steiner", "wikipedia_page": {"main": "Tim Steiner (born 9 August 1965) is a British composer. He is best known for his creation and direction of extremely large-scale musical events.", "link_mentions": [{"page": "Sonic Arts Network", "response": ["Issues were curated by Nicolas Collins, editor-in-chief of the Leonardo Music Journal and Chair of the Department of Sound at the School of the Art Institute of Chicago, who developed a theme based around silence. Kenny Goldsmith, a writer, poet and founder of UbuWeb, who trawled his archives to create a compilation of sound poetry. Japanese performance artist, Junko Wada curated a deeply personal selection of music, produced by a process of curation, performance and collaboration. Professor Andrew Hugill explored the French absurdist movement 'Pataphysics – a CD which travels from unheard Soft Machine tracks, Marcel Duchamp and Gavin Bryars and through to Frank Zappa's former lover, Nigey Lennon and a piece of silence that predates John Cage by 70 years by Alphonse Allais. Ben Watson delivered a post-Allais polemic through a disgruntled whiny from the Esemplasm. Tim Steiner's Big Ears unearthed the lost art of Radio broadcasting and Irwin Chusid, broadcaster and author of Songs in the Key of Z, delivered DIY and outsider nuggets."]}, {"page": "Play It Again", "response": ["Play It Again is also trying to get people interested in playing music. The BBC have organised several free events, between 21 April and 15 July 2007 around the UK. These events, directed by British composer Tim Steiner are open to any one and offer participants the chance to perform with one of the BBC orchestras and BBC Singers.", "In the first part of the event the public performers are treated to a mini-concert performance by the BBC Orchestra and Tim Steiner then uses the orchestra to illustrate the musical themes and the roles played by sections of the orchestra. At the end of the first section the public are split into their specific groups based on instrument, these being instrumental; saxophone; singer; percussion;  others (generally guitar-like including electric, acoustic, classical but also anything of a similar family such as banjo or mandela).", "In the second part of the event the individual sections are rehearsed separately. Those classified as \"instrumental\" rehearse with the BBC Orchestra. Lines 1 to 4 are rehearsed together with some improvisation at times. All of it is done with much humour on the part of Tim Steiner and everyone involved.", "*Tim Steiner's website"]}, {"page": "Steiner (surname)", "response": ["* Thomas Steiner (politician), Austrian politician*Tim Steiner (born 1965), British composer ", "*Tim Steiner (businessman) (born 1969), British businessman, CEO of Ocado"]}]}}