{"wiki_id": "http://www.wikidata.org/entity/Q19667681", "itemLabel": "Iain Murray", "itemDescription": "British pastor and author", "wikipedia_url": "https://en.wikipedia.org/wiki/Iain_Murray_(author)", "wikipedia_page": {"main": "Iain Hamish Murray (born 19 April 1931) is a British pastor and author who co-founded the Reformed publishing house, the Banner of Truth Trust.", "link_mentions": [{"page": "Thomas Hooker", "response": ["* Thomas Hooker And The Doctrine Of Conversion by Iain Murray"]}, {"page": "Billy Graham", "response": ["Iain Murray, writing from a conservative Protestant standpoint, argues that \"Graham's concessions are sad words from one who once spoke on the basis of biblical certainties.\"Iain Murray, Evangelicalism Divided (2000), p. 74."]}, {"page": "William Carey (missionary)", "response": ["Besides Iain Murray's study, The Puritan Hope,Iain H. Murray, The Puritan Hope. Carlisle, PA: Banner of Truth, 1975. . less attention has been paid in Carey's numerous biographies to his postmillennial eschatology as expressed in his major missionary manifesto, notably not even in Bruce J. Nichols' article \"The Theology of William Carey.\"\"The Theology of William Carey,\" Evangelical Review of Theology 17 (1993): 369–80. Carey was a Calvinist.” and a postmillennialist. Even the two dissertations which discuss his achievements (by OussorenAalbertinus Hermen Oussoren, William Carey, Especially his Missionary Principles (Diss.: Freie Universität Amsterdam), (Leiden: A. W. Sijthoff, 1945). and PottsE. Daniels Potts. British Baptist Missionaries in India 1793–1837: The History of Serampore and its Missions, (Cambridge: University Press, 1967).) ignore large areas of his theology. Neither mention his eschatological views, which played a major role in his missionary zeal.D. James Kennedy, \"William Carey: Texts That Have Changed Lives\": \"It was the belief of these men that there was going to be ushered in by the proclamation of the Gospel a glorious golden age of Gospel submission on the part of the heathen. It is very interesting to note that theologically that is what is known as 'postmillennialism,' a view which is not very popular today, but was the view that animated all the men who were involved in the early missionary enterprise.\" One exception, found in James Beck's biography of his first wife, mentions his personal optimism in the chapter on \"Attitudes Towards the Future,\" but not his optimistic perspective on world missions, which he derived from postmillennial theology.Thomas Schirrmacher, William Carey, Postmillennialism and the Theology of World Missions"]}, {"page": "Hyper-Calvinism", "response": ["Iain Murray adopts a different approach, putting the emphasis on the denial of a \"universal command to repent and believe\" and the assertion \"that we have only warrant to invite to Christ those who are conscious of a sense of sin and need.\"Iain Murray, The Forgotten Spurgeon (Banner of Truth, 1998), p. 47."]}, {"page": "Martyn Lloyd-Jones", "response": ["Since his death, there have been various publications regarding Lloyd-Jones and his work, most popularly a biography in two volumes by Iain Murray."]}, {"page": "F. F. Bruce", "response": ["Most of Bruce's works were scholarly, but he also wrote many popular works on the Bible. He viewed the New Testament writings as historically reliable and the truth claims of Christianity as hinging on their being so. To Bruce this did not mean that the Bible was always precise, or that this lack of precision could not lead to some confusion. He believed, however, that the passages that were still open to debate were ones that had no substantial bearing on Christian theology and thinking. Bruce's colleague at Manchester, James Barr, considered Bruce a \"conservative liberal\".Iain Murray, Evangelicalism Divided, Edinburgh: Banner of Truth (2000), p. 181; John Wenham, Facing Hell: An Autobiography, Carlisle: Paternoster Press (1999), p. 195."]}, {"page": "Presbyterian Church of Australia", "response": ["Current ministers in the Presbyterian Church of Australia include Allan Harman, David Mitchell, Iain Murray and Bruce W. Winter. Notable former ministers of the PCA include Peter Cameron, who was charged with heresy in 1993 and subsequently excommunicated."]}, {"page": "John Elias", "response": ["* — includes a biographical introduction by Iain Murray"]}, {"page": "List of Durham University people", "response": ["File:Iain Murray 2009-05-30.JPG|Iain Murray"]}, {"page": "Union School of Theology", "response": ["The school had 215 students in 2019-20 in undergraduate and graduate degree programs up to the Ph.D. The graduate programme was described by Iain Murray as \"well-known British training schools for ministers and missionaries\" that attracts evangelical Christians wishing to study for the ministry."]}, {"page": "Great Ejection", "response": ["Iain Murray argues that the issue was deeper than \"phrases in the Book of Common Prayer and forms of church order,\" but regarded the \"nature of true Christianity.\""]}, {"page": "Banner of Truth Trust", "response": ["The Banner of Truth Trust is an Evangelical and Reformed (Calvinist) non-profit\"The Story of The Banner of Truth\" by Iain H. Murray. publishing house, structured as a charitable trustCharity Commission for England and Wales  registered charity 235652. and founded in London in 1957 by Iain Murray, Sidney Norton and Jack Cullum. Its offices are now in Edinburgh, Scotland with a key branch office and distribution point in Carlisle, Pennsylvania. It positions itself within the conservative evangelical wing of the church, and has been described as \"an extremely powerful organization within British nonconformist evangelicalism.\""]}, {"page": "London Seminary", "response": ["London Theological Seminary was founded in 1977 by a group of ministers led by Martyn Lloyd-Jones, who was chairman of the Board of Trustees until his death in 1981.Iain Murray, . Banner of Truth Trust, 1990.   It trains preachers and pastors for the Christian ministry.  Its theological position is Conservative Evangelical in the Reformed tradition, and only admits men on the seminary pastoral training course. However, the seminary also runs a separate women's course called Flourish on nine days throughout the academic year.  Students are drawn from both the UK and overseas and from various denominational backgrounds.  London Seminary used to be licensed by the Home Office to enrol international students and in past years students have come from Argentina, Armenia, Brazil, Burma, Cameroon, Canada, China, Ethiopia, France, Germany, Honduras, India, Italy, Korea, Madagascar, Malaysia, Nepal, Netherlands, Nigeria, Pakistan, Peru, Philippines, Poland, Portugal, Russia, South Africa, Spain, Sri Lanka, Switzerland, and the USA. However, this is now no longer the case"]}, {"page": "Iain Murray", "response": ["Iain Murray may refer to:", "*Iain Murray (author) (born 1931), British pastor and author", "*Iain Murray, 10th Duke of Atholl (1931–1996), Scottish peer and landowner", "*Iain Murray (sailor) (born 1958), Australian sailor"]}, {"page": "Conversion of the Jews", "response": ["The conversion of the Jews continued to be the hope of British evangelicals in the 18th and 19th centuries. Iain Murray says of Charles Simeon that \"the conversion of the Jews was perhaps the warmest interest in his life\", and that he would choose the conversion of 6 million Jews over the conversion of 600 million Gentiles, since the former would lead to the latter.Murray, The Puritan Hope, 155. It was also a key concern of the Church of Scotland, which in 1839 sent Robert Murray M'Cheyne and Andrew Bonar to Palestine on a \"Mission of Inquiry into the state of the Jews\".  "]}, {"page": "Iain Hamish Murray", "response": ["#REDIRECT Iain Murray (author)"]}, {"page": "Iain H. Murray", "response": ["#REDIRECT Iain Murray (author)"]}, {"page": "Jeremiah Lanphier", "response": ["Although it has been common in the 21st century to attribute the beginning of the revival to Lanphier's prayer meeting, his former pastor James Alexander believed that when Lanphier and \"a few liked-minded servants of God\" first met, \"Revival was already begun. God had already poured out the Spirit of grace and of supplications. We doubt not there was a simultaneous effusion on other groups and in other places.\" And as Iain Murray has suggested, the extent to which the revival was a \"layman's revival\" has also probably been exaggerated.Murray, 360."]}]}}