{"wiki_id": "http://www.wikidata.org/entity/Q19654799", "itemLabel": "Tom Collins", "itemDescription": "British boxer", "wikipedia_url": "https://en.wikipedia.org/wiki/Tom_Collins_(boxer)", "wikipedia_page": {"main": "Tom Collins (born 1 July 1955) is  British former boxer who held the British and European light heavyweight titles and fought for three world titles.", "link_mentions": [{"page": "Johnny Nelson", "response": ["|style=\"text-align:left;\"| Tom Collins"]}, {"page": "Lonsdale Belt", "response": ["! scope=\"row\" | Tom Collins"]}, {"page": "Collins (surname)", "response": ["** Tom Collins, pseudonym of Joseph Furphy (1843–1912), Australian author", "**Tom Collins (footballer) (1882–1929), Scottish international footballer", "**Tom Collins (athlete), Irish athlete who held the 5 mile world's record", "**Tom Collins (rugby, born 1895) (1895–1957), rugby union international and rugby league footballer of the 1920s", "**Tom Collins (dual player) (died 2008), hurler and Gaelic footballer from County Kerry, Ireland", "**Tom Collins (boxer) (born 1955), British boxer", "*Tom Collins (Rent character), character in the rock musical Rent", "*Tom Collins, cocktail"]}, {"page": "Tom Collins (disambiguation)", "response": ["A Tom Collins is an alcoholic cocktail made with gin and other mixers.", "Tom Collins may also refer to:", "* Joseph Furphy (1843–1912), Australian author who mostly wrote under the pseudonym Tom Collins", "* Tom Collins (athlete), Irish athlete who held the 5 mile world's record", "* Tom Collins (Rent character), character in the rock musical Rent", "* Tom Collins (rugby, born 1895) (1895–1957), rugby union and rugby league footballer of the 1920s for Wales (RU), Mountain Ash, and Hull (RL)", "* Tom Collins (footballer) (1882–1929), Scottish international footballer who played for Heart of Midlothian, Bathgate, East Fife and Tottenham Hotspur", "* Tom Collins (dual player) (?–2008), dual player from County Kerry, Ireland", "* Tom Collins (boxer) (born 1955), British boxer", "* Tom Collins (record producer) (born 1942), American country music producer of Ronnie Milsap, Barbara Mandrell, & others", "* Tom Collins (rugby union, born 1994), English rugby union player", "* Tom Collins, producer of the ice show Champions on Ice", "* Tom Collins, bass player of the band Acroma"]}, {"page": "Leeonzer Barber", "response": ["Barber turned pro in 1986 and won the vacant WBO light-heavyweight title with a TKO win over Tom Collins at Town Hall, Leeds, Yorkshire, England in 1991. He defended the title four times before losing the belt by a unanimous decision to Dariusz Michalczewski at Sporthalle, Alsterdorf, Hamburg, Germany in 1994."]}, {"page": "List of British light-heavyweight boxing champions", "response": ["|align=left | Tom Collins", "|align=left | Tom Collins", "|align=left | Tom Collins"]}, {"page": "Mark Kaylor", "response": ["|align=left| Tom Collins"]}, {"page": "Alex Blanchard", "response": ["Alex Blanchard (born 3 January 1958) is a retired Dutch professional boxer who was active between 1979 and 1991. Between 1985 and 1987 he was rated as world's second light heavyweight boxer by the World Boxing Council. On 29 May 1984 he won the European light heavyweight title (EBU) by knocking out Richard Caramanolis in sixth round; before the bout Caramanolis was a reigning European Champion with a 27–0 record. Blanchard defended the EBU title five times, against Manfred Jassman (1984), Richard Caramanolis (1985), Andrew Andries (1985), Ralf Rocchigiani (1986) and Enrico Scacchia (1987), and lost it in 1987 to Tom Collins. On 11 February 1985, Blanchard won the vacant WAA title by knocking out Jerry Reddick in second round."]}, {"page": "Steve McCarthy (boxer)", "response": ["McCarthy's next fight came in October 1990 at Battersea Town Hall in a rematch against Fame for the British light-heavyweight title vacated by Tom Collins; McCarthy won on points to become British champion in what was dubbed as a \"masterclass\" from the new British Champion. "]}, {"page": "Tony Wilson (boxer)", "response": ["In December 1987, he once again met Logsdon for the vacant British title. After six rounds, the fight was stopped due to cuts over Logsdon's eye. Wilson made his first defence in May 1988 against Brian Schumacher. Wilson was knocked down in the first round but recovered to stop Schumacher in the sixth. He made a second defence against Schumacher in January 1989, this time winning in three rounds to take the Lonsdale Belt outright. His third defence came two months later against Tom Collins. Collins stopped Wilson in the second round to take the title — only Wilson's second defeat."]}, {"page": "Christophe Girard", "response": ["Girard made his debut in 1988. In his tenth fight he became French Light-Heavyweight champion. In 1992 unsuccessfully fought Tom Collins for the European Light Heavyweight Title, suffering his first defeat. After building up a record 30-1, Girard would challenge for that same European title again and was defeated by Dutchman Eddy Smulders."]}, {"page": "List of European Boxing Union champions", "response": ["|align=left | Tom Collins", "|align=left | Tom Collins"]}]}}