{"wiki_id": "http://www.wikidata.org/entity/Q1960565", "itemLabel": "Sara Coleridge", "itemDescription": "British poet, translator, editor, writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Sara_Coleridge", "wikipedia_page": {"main": "Sara Coleridge (23 December 1802 – 3 May 1852) was an English author and translator. She was the third child out of four and the only daughter of the poet Samuel Taylor Coleridge and his wife Sara Fricker. She gained further popularity with instructive verses for children.", "link_mentions": [{"page": "1852", "response": ["* May 3 – Sara Coleridge, British author and translator (b. 1802)"]}, {"page": "1802", "response": ["* December 23 – Sara Coleridge, British scholar (d. 1852)"]}, {"page": "List of fantasy authors", "response": ["* Sara Coleridge, (1802–1852) author of  Phantasmion"]}, {"page": "Elizabeth Peabody", "response": ["* Sara Coleridge's Phantasmion"]}, {"page": "1852 in literature", "response": ["** Sara Coleridge, British author and translator (born 1802)"]}, {"page": "1837 in literature", "response": ["*Sara Coleridge – Phantasmion"]}, {"page": "1802 in literature", "response": ["*December 23 – Sara Coleridge, English poet and translator (died 1852)"]}, {"page": "Hartley Coleridge", "response": ["Hartley Coleridge, possibly David Hartley Coleridge, (19 September 1796 – 6 January 1849) was an English poet, biographer, essayist, and teacher. He was the eldest son of the poet Samuel Taylor Coleridge. His sister Sara Coleridge was a poet and translator, and his brother Derwent Coleridge was a scholar and author. Hartley was named after the philosopher David Hartley."]}, {"page": "Stephen Potter", "response": ["Potter's first book, The Young Man (1929), was an autobiographical novel, which was well-reviewed. The Manchester Guardian wrote, \"a brilliant performance ... a distinguished contribution to intellectual fiction.\"\"Books of the Day\", The Manchester Guardian, 25 October 1929, p. 7  In 1930 he wrote  D. H. Lawrence: A First Study, the first book-length work on Lawrence, which appeared in print within a few days of the death of its subject, unfortunate timing because it seemed like an inadequate memorial rather than what it was intended to be, a critical reappraisal. It also suffered from a regrettable misprint, rendering the heading \"Sea and Sardinia\", as \"Sex and Sardinia\". This was soon amplified by rumour into \"Sex and Sardines\", none of which helped Potter's reputation as a serious writer. Potter's most comprehensive critic was the friend from whom he had inherited the Cape commission, G.B. Edwards, in Middleton Murry's Adelphi.Edward Chaney, Genius Friend: G.B. Edwards and The Book of Ebenezer le Page, Blue Ormer 2015  After this he concentrated in his next four works on Coleridge. He edited the Nonesuch Press Coleridge (1933), praised in The Times as \"the best anthology that has ever shown Coleridge as poet, philosopher and critic.\"Books For the Holidays – Successes of the Year, A Selected List\", The Times, 27 July 1934, p. 8 This was followed by an edition of Sara Coleridge's letters to Thomas Poole, Minnow among Tritons (1934), which Potter edited from the original manuscripts in the British Museum.The Times Literary Supplement, 19 July 1934, p. 507 In 1941 he wrote a play, Married to a Genius, based on the Coleridge marriage.  In 1935 he published his most important contribution to the subject, Coleridge and S.T.C., a discussion of the duality in the poet's nature, \"not merely the earlier and the later, but the true and the false, and the exciting and the nauseating,\" as John Middleton Murry put it in a review in The Times Literary Supplement. Reviews were good, but with reservations that Potter oversimplified the dichotomy in Coleridge's nature (The Observer) or else did not explore the underlying reasons for it (TLS).de Sélincourt, Basil, \"Two Beings in One\", The Observer, 28 April 1935, p. 5"]}, {"page": "Mary Elizabeth Coleridge", "response": ["Mary Coleridge was the daughter of Arthur Duke Coleridge, the lawyer and influential amateur musician. With the singer Jenny Lind, her father was responsible for the formation of the London Bach Choir in 1875. Other family friends included Robert Browning, Alfred, Lord Tennyson, John Millais and Fanny Kemble. She was the great-grandniece of Samuel Taylor Coleridge and the great niece of Sara Coleridge, the author of Phantasmion."]}, {"page": "Oxford period poetry anthologies", "response": ["Lascelles Abercrombie – Percy Addleshaw – Douglas Ainslie – Thomas Bailie Aldrich – William Alexander – William Allingham – Sir Edwin Arnold – Matthew Arnold – Thomas Ashe – Alfred Austin – William Edmonstoune Aytoun – Philip James Bailey – Richard Harris Barham – Maurice Baring – George Barlow – Jane Barlow – William Barnes – Benjamin Disraeli, 1st Earl of Beaconsfield – Thomas Lovell Beddoes – Henry Charles Beeching – Charles Dent Bell – Hilaire Belloc – Arthur Christopher Benson – Laurence Binyon – John Stuart Blackie – Richard Doddridge Blackmore – Mathilde Blind – Wilfrid Scawen Blunt – George Henry Boker – Gordon Bottomley – Francis William Bourdillon – Robert Bridges – Emily Brontë – Rupert Brooke – Robert Barnabas Brough – Oliver Madox Brown – Thomas Edward Brown – Elizabeth Barrett Browning – Robert Browning – William Cullen Bryant – Robert Buchanan – Arthur Gray Butler – Wathen Mark Wilks Call – Thomas Carlyle – Bliss Carman – John Clare – Caroline Clive – Arthur Hugh Clough – Hartley Coleridge – Mary E. Coleridge – Sara Coleridge – Mortimer Collins – Frances Cornford – William Cory – Frances Burdett Money Coutts – Dinah Maria Craik – Walter Crane – Marquess of Crewe – Arthur Shearly Cripps – Henry Cust – George Darley – John Davidson – William H. Davies – Thomas Osborne Davis – William James Dawson – Walter De la Mare – Lord De Tabley – Sir Aubrey De Vere – Aubrey De Vere – Emily Dickinson – Richard Watson Dixon – Bertram Dobell – Sydney Dobell – Austin Dobson – Alfred Domett – Lord Alfred Douglas – Edward Dowden – Ernest Dowson – Sir Francis Hastings Doyle – John Drinkwater – Agnes Mary Frances Duclaux – Helen, Lady Dufferin – George Louis Palmella Busson du Maurier – Matilda Betham Edwards – George Eliot – Ebenezer Elliott – Henry Ellison – Ralph Waldo Emerson – Frederick William Faber – Sir Samuel Ferguson – Michale Field – Edward Fitzgerald – James Elroy Flecker – Alice Furlong – Norman Gale – Richard Garnett – Wilfrid Wilson Gibson – Adam Lindsay Gordon – Edmund Gosse – Charles Granville – David Gray – Dora Greenwell – Gerald Griffin – Louise Imogen Guiney – Fitz-Greene Halleck – Thomas Hardy – Bret Harte – Robert Stephen Hawker – William Ernest Henley – Maurice Hewlett – Emily Henrietta Hickey – Katharine Tynan Hinkson – Oliver Wendell Holmes – Thomas Hood – George Hookham – Gerard Manley Hopkins – Richard Henry Horne – Lord Houghton – Laurence Housman – Julia Ward Howe – William Dean Howells – Leigh Hunt – Douglas Hyde – Jean Ingelow – Lionel Johnson – Ebenezer Jones – Ernest Charles Jones – James Joyce – John Keble – Frances Anne Kemble – Henry Clarence Kendall – John Kenyon – Charles Kingsley – Henry Kingsley – Rudyard Kipling – Walter Savage Landor – Andrew Lang – Emily Lawless – Eugene Lee-Hamilton – Edward Cracroft Lefroy – Richard Le Gallienne – Amy Levy – William James Linton – Frederick Locker-Lampson – John Gibson Lockhart – Henry Wadsworth Longfellow – James Russell Lowell – Henry Dawson Lowry – Sir Alfred Comyn Lyall – Thomas Toke Lynch – Sidney Royse Lysaght – Earl of Lytton – Lord Lytton – Lord Macaulay – Denis Florence MacCarthy – George MacDonald – Charles Mackay – H. C. Compton Mackenzie – Francis Mahony – James Clarence Mangan – Philip Bourke Marston – Theophile Marzials – John Masefield – Gerald Massey – Annie Matheson – George Meredith – Herman Charles Merivale – Alice Meynell – Richard Middleton – William Cosmo Monkhouse – Harold Monro – Mary Montgomerie – T. Sturge Moore – Sir Lewis Morris – William Morris – Neil Munro – Ernest Myers – Frederic William Henry Myers – John Mason Neale – Henry Newbolt – John Henry Newman – John Nicol – Roden Berkeley Wriothesley Noel – Caroline Elizabeth Sarah Norton – Alfred Noyes – Moira O'Neill – John Boyle O'Reilly – Arthur William Edgar O'Shaughnessy – Francis Turner Palgrave – Sir Gilbert Parker – Fanny Parnell – Coventry Patmore – John Payne – John Swinnerton Phillimore – Stephen Phillips – Eden Phillpotts – William Philpot – Edgar Allan Poe – Walter Herries Pollock – Ezra Pound – Winthrop Mackworth Praed – May Probyn – Adelaide Anne Procter – Bryan Waller Procter – Sir Arthur Quiller-Couch – Ernest Radford – William Brighty Rands – Hardwick Drummond Rawnsley – Ernest Rhys – James Logie Robertson – Sir James Rennell Rodd – Samuel Rogers – T. W. Rolleston – William Caldwell Roscoe – William Stanley Roscoe – Christina Georgina Rossetti – Dante Gabriel Rossetti – Earl of Rosslyn – John Ruskin – George William Russell – Lady Margaret Sackville – George Santayana – William Bell Scott – John Campbell Shairp – William Sharp – Dora Sigerson Shorter – Joseph Skipsey – Douglas Brook Wheelton Sladen – Menella Bute Smedley – Alexander Smith – Walter C. Smith – James Stephens – Robert Louis Stevenson – Charles Swain – Elinor Sweetman – Algernon Charles Swinburne – John Addington Symonds – Arthur Symons – John M. Synge – Sir Henry Taylor – Rachel Annand Taylor – Frederick Tennyson – Lord Tennyson – William Makepeace Thackeray – Francis Thompson – Edward William Thomson – James Thomson (B.V.) – Henry David Thoreau – Wilfrid Thorley – Walter Thornbury – John Todhunter – Archbishop Trench – Herbert Trench – Charles Tennyson Turner – Samuel Waddington – Thomas Wade – Edward Walsh – Thomas Herbert Warren – Rosamund Marriott Watson – William Watson – Theodore Watts-Dunton – Augusta Webster – Thomas Westwood – Charles Whitehead – Walt Whitman – John Greenleaf Whittier – Oscar Wilde – Sarah Williams – Nathaniel Parker Lewis – Margaret L. Woods – Thomas Woolner – William Butler Yeats"]}, {"page": "John Taylor Coleridge", "response": ["John married Mary Buchanan at St Peter's, Woodmansterne, Surrey, in 1818; her father, Gilbert Buchanan, was then rector there.Busfield D.W. (1981), St Peter's Woodmansterne Registers 1566-1837 John's eldest son, John Duke Coleridge, 1st Baron Coleridge, became Lord Chief Justice of England. The second son, Henry James Coleridge (1822–1893), left the Anglican for the Roman Catholic church in 1852, and became well known as a Jesuit divine, editor of The Month, and author of numerous theological works. Sir John Taylor Coleridge's brothers were James Duke Coleridge and Henry Nelson Coleridge, the latter the husband of Sara Coleridge. His brother Francis George was the father of Arthur Duke Coleridge (born 1830), clerk of assizes on the Midland circuit and author of Eton in the Forties and whose daughter Mary E. Coleridge became a well-known writer of fiction."]}, {"page": "Sarah Coleridge", "response": ["#redirectSara Coleridge"]}, {"page": "History of fantasy", "response": ["In Britain, Sara Coleridge also wrote a fantasy novel, Phantasmion (1837), described as \"\"the first fairytale novel written in English\".Roderick McGillis, \"Phantasmion\", p 1238-1240, in Frank N. Magill, ed. Survey of Modern Fantasy Literature, Vol 3. Englewood Cliffs, NJ: Salem Press, Inc., 1983. "]}, {"page": "Martin Dobrizhoffer", "response": ["The work, published in three volumes, London, 1822, there appeared in London, an anonymous English translation sometimes ascribed to Southey, but really the work of Sara Coleridge, who had undertaken the task to defray the college expenses of one of her brothers. A delicate compliment was paid to the translator by Southey in the third canto of his A Tale of Paraguay, the story of which was derived from the pages of Dobrizhoffer's narrative:"]}, {"page": "1852 in poetry", "response": ["* May 3 – Sara Coleridge (born 1802), English writer"]}, {"page": "1907 in poetry", "response": ["* August 25 – Mary Elizabeth Coleridge, (born 1861), English novelist, poet and teacher who wrote poetry under the pseudonym Anodos (taken from George MacDonald); great-grandniece of Samuel Taylor Coleridge and great niece of Sara Coleridge"]}, {"page": "1802 in the United Kingdom", "response": ["* 23 December – Sara Coleridge, scholar (died 1852)"]}, {"page": "1834 in poetry", "response": ["* Sara Coleridge, Pretty Lessons in Verse for Good ChildrenCox, Michael, editor, The Concise Oxford Chronology of English Literature, Oxford University Press, 2004, "]}, {"page": "1861 in poetry", "response": ["* September 23 – Mary Elizabeth Coleridge (died 1907), English novelist, poet and teacher writing poetry under the pseudonym Anodos (taken from George MacDonald); great-grandniece of Samuel Taylor Coleridge and great niece of Sara Coleridge"]}, {"page": "1825 in poetry", "response": ["* Sara Coleridge, translator from the French of Jacques de Mailles, The History of the Chevalier Bayard"]}, {"page": "1802 in poetry", "response": ["* December 23 – Sara Coleridge (died 1852), English poet and translator; daughter of Samuel Taylor Coleridge"]}, {"page": "1852 in the United Kingdom", "response": ["* 3 May – Sara Coleridge, author and translator (born 1802)"]}, {"page": "List of coupled cousins", "response": ["*Henry Nelson Coleridge (1798–1843) and his first cousin, Sara Coleridge"]}, {"page": "Coleridge (surname)", "response": ["* Herbert Coleridge (1830–1861), British philologist and lexicographer, son of Sara Coleridge and Henry Nelson Coleridge", "* Sara Coleridge (1802–1852), British writer, daughter of Samuel Taylor Coleridge, and wife of her cousin Henry Nelson Coleridge"]}]}}