{"wiki_id": "http://www.wikidata.org/entity/Q19667527", "itemLabel": "Jim Sterling", "itemDescription": "video game journalist, critic, pundit, and wrestling personality", "wikipedia_url": "https://en.wikipedia.org/wiki/Jim_Sterling", "wikipedia_page": {"main": "James Stephanie Sterling is an English-American freelance video game journalist, critic, pundit, YouTuber, and professional wrestler. Before becoming independent in September 2014, they were the review editor for Destructoid, and an author for The Escapist. Sterling is noted as one of the main examples of a YouTuber achieving success through crowdfunding.", "link_mentions": [{"page": "Frivolous litigation", "response": ["In March 2016, James Romine, one-half of the independent developer Digital Homicide Studios, sued video game critic Jim Sterling (James Stanton) for criticizing the games published under his studios' name, seeking $10 million in damages for \"assault, libel, and slander\" to Romine's business. He claimed that Stanton's coverage of his studio's game The Slaughtering Grounds as \"Worst Game of 2014 Contender\" was not protected under fair use law because he did not believe it was \"fair\" criticism. An additional lawsuit for $18 million was filed against 100 users on the Steam gaming platform for criticizing their games and business practices, which he had interpreted as \"harassment\". The judge issued a subpoena against Valve to disclose the identities of those 100 users. This resulted in Valve removing all published games from Digital Homicide Studios. In addition, Romine filed the lawsuit as an individual and not as a corporation, so such criticism was protected under the right to freedom of speech. The case was dismissed with prejudice in February 2017."]}, {"page": "Shenmue (video game)", "response": ["Reviews of the HD ports of Shenmue and Shenmue II in 2018 were less positive. Destructoids Peter Glagowski wrote that Shenmue had \"interesting concepts that are marred by poor execution\", and criticized the combat and slow pacing. He concluded: \"This open-world design was truly original and fascinating in 1999, but there really wasn't a need to include half of the features that Shenmue has.\" Escapist critic Ben \"Yahtzee\" Croshaw disliked the \"relentless\" and \"frenetic\" combat, and felt that the open world lacked content between key story moments. Critic Jim Sterling wrote that \"Shenmue is dreadful [...] Maybe at the turn of the millennium when this game was worth a shit it could get away with being bold, but boldness is no excuse for wasting the player's time, having absolutely no respect for the audience or its patience, and generally expecting people to make their own fun in a game that doesn't really give all that many tools to have fun with.\""]}, {"page": "Erith", "response": ["*Jim Sterling (b. 1984), video game journalist, born and grew up in Erith"]}, {"page": "Duke Nukem Forever", "response": ["Duke Nukem Forever received very lackluster reviews, with most of the criticism directed towards the game's long loading times, clunky controls, offensive humor, and overall aging and dated design. Elton Jones of Complex chose the game as one of \"the most disappointing games of 2011\". Jim Sterling, review editor for Destructoid, said that the game was \"like a disease\" and named it the \"shittiest game of 2011\".Jimquisition: The Ten Worst Games of 2011 . YouTube (2012-06-26). Retrieved on 2013-07-31. Ben \"Yahtzee\" Croshaw, creator of Zero Punctuation, listed it as #2 on his list of the worst games of 2011, losing to both Battlefield 3 and Call of Duty: Modern Warfare 3.The Escapist : Video Galleries : Zero Punctuation : Top 5 of 2011 . Escapistmagazine.com. Retrieved on 2013-07-31."]}, {"page": "1997 in film", "response": ["| Conspiracy Theory || Warner Bros. Pictures / Silver Pictures || Richard Donner (director); Brian Helgeland (screenplay); Mel Gibson, Julia Roberts, Patrick Stewart, Cylk Cozart, Steve Kahan, Terry Alexander, Pete Koch, Dean Winters, Alex McArthur, Kenneth Tigar, Sean Patrick Thomas, Michael Potts, Jim Sterling, Saxon Trainor, Leonard Jackson, Donal Gibson, Michael Shamus Wiles, Troy Garity, J. Mills Goodloe, Peter Jacobson, Edita Brychta, Tom McCarthy, Joan Lunden, Rick Hoffman, Bert Remsen, Bill Henderson, Tom Schanley, Richard Donner || Action || Live action"]}, {"page": "Survival horror", "response": ["In 2005, Resident Evil 4 attempted to redefine the genre by emphasizing reflexes and precision aiming, broadening the gameplay with elements from the wider action genre. Its ambitions paid off, earning the title several Game of the Year awards for 2005, and the top rank on IGN's Readers' Picks Top 99 Games list. However, this also led some reviewers to suggest that the Resident Evil series had abandoned the survival horror genre, by demolishing the genre conventions that it had established. Other major survival horror series followed suit by developing their combat systems to feature more action, such as Silent Hill Homecoming, and the 2008 version of Alone in the Dark. These changes were part of an overall trend among console games to shift towards visceral action gameplay. These changes in gameplay have led some purists to suggest that the genre has deteriorated into the conventions of other action games. Jim Sterling suggests that the genre lost its core gameplay when it improved the combat interface, thus shifting the gameplay away from hiding and running towards direct combat. Leigh Alexander argues that this represents a shift towards more Western horror aesthetics, which emphasize action and gore rather than the psychological experience of Japanese horror."]}, {"page": "Shadow the Hedgehog", "response": ["Shadow is a divisive Sonic character. Some, such as East, who ranked him one of the series' best characters, praise him for his role in Sonic Adventure 2; Game Informer Brian Shea called Shadow a \"fun equal\" to Sonic who delivered the series' traditional sense of speed, and Polygon Allegra Frank said he is a fan-favorite. \"For others,\" wrote Kotaku Mike Fahey, Shadow \"signifies the looming death of a beloved series.\" Fahey felt Shadow's self-titled game was when the Sonic franchise lost its identity, and dismissed those who argued in favor of his role in Sonic Adventure 2. Jim Sterling, writing for GamesRadar+, ranked Shadow among the series' worst characters, arguing he lost his relevance over time and calling him \"the ultimate example of a good idea gone rotten.\" Despite this, in 2005 Naka said Sonic Team had determined Shadow was the series' most popular character excluding Sonic himself, a finding reaffirmed in a 2009 Sega poll. In 2011, Guinness World Records named Shadow among the 50 greatest video game characters of all time."]}, {"page": "Grand Theft Auto III", "response": ["The port's visuals were well received. IGNs Peter Eykemans commended the smoother textures, especially condensed on a mobile screen, while Destructoids Jim Sterling noted improvements in the character and vehicle models. Mark Walton of GameSpot wrote that the game runs well on high-end devices like the Motorola Xoom and Samsung Galaxy S II, but noticed significant frame rate and texture issues on the Xperia Play. Pocket Gamers Mark Brown identified the game's short draw distance leading to sudden popup, although still found that the models and textures \"have been given a tune-up\" in the port."]}, {"page": "Knuckles' Chaotix", "response": ["With the exception of Mighty, all Chaotix members have become recurring characters in the Sonic series. The characters initially did not reappear until Sonic Heroes in 2003. Director Takashi Iizuka said that Sonic Team revived the Chaotix because the studio thought they were unique and had never used them. Iizuka considers the Heroes version of the characters different from the 32X one, claiming to have created new characters simply using the same designs. The group had storylines in the Sonic the Hedgehog comic series produced by Archie Comics and Sonic the Comic by Fleetway Publications, as well as in the anime series Sonic X. While Game Informer considered the Chaotix to be among the best characters of the franchise and are underutilized, GamesRadar considered the introduction of the Chaotix a negative turning point for the series as it \"diluted the Sonic-verse by introducing tons of shitty characters\". Jim Sterling felt that all the Chaotix lacked redeeming qualities, calling Vector \"Idiot the Crocodile\" and Espio \"Generic Brooder the Chameleon\". They singled out Charmy for particular ridicule, feeling he was annoying and noting his high-pitched voice. Mighty would eventually return as a playable character in Sonic Mania Plus in 2018."]}, {"page": "Psyduck", "response": ["Described as \"downright silly\" by GameSpy, Psyduck has been well received by the media.  The New York Times compared it to a duck-billed platypus, adding that it \"looks entertainingly silly\". GameDaily described it as \"one of the more unique Pokémon characters\", as well as weird, noting it has changed little in either aspect throughout the history of the franchise. IGN described the character as a \"cult favorite\" amongst fans, attributing the reaction to its \"bizarre, bewildered appearance\", as well as citing it as a favorite character around their offices. GamesRadar also called it one of the more popular from the original games, describing it as fun to use \"if only to see the reaction of other players\". Jim Sterling of Destructoid included it in his list of 30 \"rubbish\" Pokémon, describing Psyduck as \"One of the most annoying, irritating lumps of vomit ever invented.\" The Coventry Evening Telegraph also praised its design, stating the character was \"more interesting\" in comparison to more commonly seen Pokémon such as Squirtle. Author Loredana Lipperini described Psyduck as the \"comic talents\" of Nintendo. Kotaku's Patricia Hernandez cited Psyduck as an example of the better-quality Pokémon from the first generation due to its \"endearing dopeyness.\" Author Cindy Jacobs suggested that Psyduck's powers were associated with the occult. She claimed that these telepathic powers were \"actually demons that empower him.\" Pastor Phil Arms states, \"Psyduck defeats his opponents by mesmerizing them with a piercing stare and releasing a barrage of pent-up mental energy. The New Age concept that parallels this ability falls under the heading of an altered state of consciousness.\" Liz Finnegan of The Escapist listed Psyduck as 45th of their favorite Pokemon, stating that \"I liked Psyduck when it was just charmingly dopey.\" Syfy lauded Psyduck in Pokémon Detective Pikachu as the key Pokémon in the storyline."]}, {"page": "Cactuar", "response": ["The Cactuar has been well received, and often described as being an iconic element of the Final Fantasy franchise. Jason Wilson of VentureBeat called the Cactuar his favorite video game monster, saying that, while \"kinda cute\", they \"can be scary [...] especially when these cowardly creatures stick around instead of running away and launch its devastating 1,000 Needles attack\", also saying that they can easily cause a total party kill. Jim Sterling called the Cactuar \"everybody's favorite perennial mascot\" in a 2009 post published by Destructoid, and praised its design for Final Fantasy XIII which was unchanged from previous iterations. Mike Fahey of Kotaku stated that the Cactuar is \"one of Final Fantasy's most iconic creatures\", and commented that the Final Fantasy XIV Gigatender was \"doing the best it can to live up to that legacy, bless its giant plant heart\", also stating that they \"are adorable enough that I just want to sit in The Fields of Amber and watch them nearly topple all day long\". GameFan called the Cactuar \"one of the most popular Final Fantasy enemies of all time, despite its inability to talk,\" saying \"his 1000 Needles attack can be quite painful if your characters don't have triple-digit hit points\". In Darren Nakamura's review of World of Final Fantasy for Destructoid, he found the Cactuar Conductor's antics to be funny, as the context of the Cactuars being reputed as \"slippery jerks\" is well known to the series' fandom."]}, {"page": "List of Internet phenomena", "response": ["*Big Chungus – A still frame of the 1941 Merrie Melodies short Wabbit Twouble when Bugs Bunny mocks a fat Elmer Fudd. The meme originated from fictitious cover art for a video game titled Big Chungus (with \"chungus\" being a neologism associated with video game commentator Jim Sterling), which featured a still from the scene, and was popularized by a Facebook post by a GameStop manager who alleged that a colleague's mother had inquired about purchasing the \"game\" as a gift. Warner Bros. later incorporated Big Chungus into its own video game Looney Tunes World of Mayhem."]}, {"page": "Mai Shiranui", "response": ["In addition to her popularity with male fans, Mai has been a personal choice for some female gamers, such as Dawn Hughes of The Lakeland Mirror, who favorited Mai due to her costumes and being \"fast, agile, and sexy\",The Lakeland Mirror 3/2007, page 11. and Seraphina Brennan of Joystiq, who wrote in 2009 that \"throughout all of the countless MMOs that we've played, we've always asked ourselves one important question: Where is Mai Shiranui and why can't I be her?\"Seraphina Brennan, King of Fighters Online proves you can kick butt in short skirts, literally , Joystiq, June 18th 2009. SNK Playmore's decision to feature Mai only in an unplayable cameo in 2009's The King of Fighters XII was met with media criticism and a fan backlashJC Fletcher, King of Fighters XIII brings Mai back this summer, Joystiq, March 25th 2010.Eric L. Patterson, EGM Feature: 5 Ways Japanese Gaming Still Rules: Dragon's Crown, EGMNOW, December 29, 2011.Gelo Gonzales, Games Review: King of Fighters XIII, FHM.com.ph, November 24, 2011. sparking the meme phrase \"no Mai, no buy\". Shane Bettenhausen, director of business development for game publisher UTV Ignition Entertainment, likened the omission to Capcom leaving Chun-Li out of the original release of Street Fighter III, while Destructoid's Jim Sterling compared it to \"releasing Street Fighter without Ryu\".Jim Sterling, King of Fighters XIII bringing back Mai's breasts, Destructoid, March 25, 2010. GameSpot's Andrew Park noted \"the conspicuous absence of SNK's iconic female ninja/geisha girl\" and Siliconera opined that \"SNK isn't going to make that mistake again\" in omitting Mai from future releases. Adam Biessener of Game Informer said of Mai's return: \"Sometimes fan service is all a franchise needs to stay relevant—and SNK Playmore is certainly delivering that\"."]}, {"page": "Steam (service)", "response": ["Valve has attempted to deal with \"fake games\", those that are built around reused assets and little other innovation, designed to misuse Steam's features for the benefit only to the developer or select few users. To help assist finding and removing these games from the service, the company added Steam Explorers atop its existing Steam Curator program, according to various YouTube personalities that have spoken out about such games in the past and with Valve directly, including Jim Sterling and TotalBiscuit. Any Steam user is able to sign up to be an Explorer, and are asked to look at under-performing games on the service as to either vouch that the game is truly original and simply lost among other releases, or if it is an example of a \"fake game\", at which point Valve can take action to remove the game."]}, {"page": "DigiPen Institute of Technology", "response": ["*In a 2021 video entitled \"DigiPen: The College That Teaches Crunch Culture\", gaming journalist and YouTuber Jim Sterling, citing a series of anonymous interviews they had conducted with former DigiPen students, accused the school of conditioning students into the crunch culture of the larger video game industry and criticized practices such as overburdening students with impossible workloads and class requirements, failure to communicate grades and academic standing with students, and hiring and maintaining professors with outdated industry experience who reportedly engaged in yelling, intimidation, and other abusive behavior towards students. According to Sterling, DigiPen was reached out to for comment a week before the video's release and did not respond."]}, {"page": "Kitana", "response": ["In various articles, often being tongue-in-cheek, Soren Bowie of Mania.com listed Kitana as one of ten \"psychotic video game chicks with too much baggage,\"Soren Bowie, \"The Top 10 Hot But Mostly Bothered Video Game Females\" , Mania.com, May 29, 2008. GameDaily featured her as one of ten \"babes who shouldn't meet your mom,\"\"Ten Babes Who Should and 10 Babes Who Shouldn't Meet Your Mom\", GameDaily, June 20, 2008. GamesRadar's Alan Bradley included her among \"gaming's most twisted royalty\" for having \"a thing for bloody decapitations via razor fan and for boys 9,000 years her junior,\"Alan Bradley, \"Gaming's most twisted royalty\", GamesRadar, 2010-11-30. and Jim Sterling of Destructoid expressed his discomfort at Kitana's design in MK Vs. DCU, implying her bulging crotch made her look like a transvestite. Leah Jackson from MTV's The Feed instead paired her with Kung Lao instead of Liu Kang, as he \"would offer great balance to Princess Kitana's often hectic lifestyle\" of \"always going off getting killed, resurrected, put under spells, or whatever new kind of hell is cooked up for her.\" The character's outfits were parodied in Grey Carter's \"Critical Miss\" comic strip at The Escapist, where Kitana is forced to wear skimpy costumes and high heels by her stepfather.Grey Carter, Critical Miss: Mortal Kombat, The Escapist, May 3, 2011."]}, {"page": "Albert Wesker", "response": ["Albert Wesker appears in the crossover fighting game Marvel vs. Capcom 3: Fate of Two Worlds as a playable character and a key character in the game's plot, in which he joins forces with Doctor Doom as the two build an army of supervillains, attempting to merge the two dimensions in the hopes of conquering both. During the final battle, if Wesker is not one of the playable characters, he will also be revealed to be one of Galactus's heralds along with Doom, the Marvel villain Dormammu, and a fellow Capcom villain Akuma. He also makes a guest appearance as an unlockable character skin in Lost Planet 2. An action figure of Wesker was released by Palisades Toys in 2002. Two more were released by Hot Toys in 2009. In 2016, D. C. Douglas reprised the role in Jim Sterling's short comedy horror film JimSAW. Wesker appears as a Spirit in the Nintendo crossover video game Super Smash Bros. Ultimate."]}, {"page": "Aliens: Colonial Marines", "response": ["The story drew criticism for its lack of a consistent continuity with the Alien films. Edge remarked that the game's Colonial Marines are in an inappropriate context because in the film they are depicted as Weyland-Yutani's private army and tasked with fighting Alien creatures. However, in the game, the Colonial Marines fight Weyland-Yutani's other private military armies. Destructoid editor Jim Sterling criticized the story for its archetypal characters and immature dialogue, stating that the game fails to understand the essence of Aliens. Sterling explained that the film \"dissected its posturing 'manly man' stereotypes, and showcased how utterly frail a cowboy mentality can be when everything falls apart\", while Colonial Marines \"revels in its own testosterone, submerged gleefully in a pool of dank ultramasculinity.\""]}, {"page": "Wabbit Twouble", "response": ["In December 2018, a still from the short depicting Bugs mocking Elmer by imitating his likeness became an Internet meme. The meme originated from fictitious cover art for a video game titled Big Chungus (with \"chungus\" being a neologism coined by video game journalist Jim Sterling in 2012) which featured the still and was popularized by a Facebook post by a GameStop manager in Colorado Springs, who alleged that a customer had inquired about purchasing the fictional game as a gift for her son. Since then, Big Chungus has been featured in numerous works, including songs."]}, {"page": "The Escapist (magazine)", "response": ["During the dispute, a number of other contracted creators spoke out in support of Extra Credits, relaying similar stories of mistreatment by the management. Among them were MovieBob, Jim Sterling, LoadingReadyRun, and the creators of No Right Answer. Later, those creators would also break ties with The Escapist, leaving Ben \"Yahtzee\" Croshaw as the sole contracted creator by 2017. As a result, Extra Credits broke ties with The Escapist, moving to Penny Arcade and later becoming independent."]}, {"page": "Confusopoly", "response": ["Video game critic Jim Sterling criticized the video game industry's use of multiple limited and collector's editions as a confusopoly, citing games including Watch Dogs and Anthem as examples."]}, {"page": "Sonic the Hedgehog (2006 video game)", "response": ["To celebrate the Sonic franchise's 20th anniversary in 2011, Sega released Sonic Generations, which remade aspects of past Sonic games. The PlayStation 3, Xbox 360, and Windows versions feature a remake of Sonic the Hedgehogs \"Crisis City\" level, and every version, including the Nintendo 3DS version, includes a reimagined version of the boss battle with Silver. The decision to include Sonic the Hedgehog stages and bosses in Sonic Generations was criticized by critics and fans of the series; Jim Sterling of Destructoid referred to the Silver boss fight as the \"catch\" of the otherwise high-quality game."]}, {"page": "List of video games notable for negative reception", "response": ["The sixth installment in the Alone in the Dark franchise was published by Atari in 2015 centering around a team of four cooperative characters investigating a mysterious figure in a haunted house. Alone in the Dark: Illumination received universally negative reviews. It received an aggregated score of 19% on GameRankings based on five reviews and 19% on Metacritic based on 12 reviews, indicating \"overwhelming dislike\", and was ranked as the worst game of 2015. Jim Sterling stated that Illumination was \"ugly in every sense of the word, not just visually – though it is about as attractive as an anus in an eye socket\", while criticizing its cooperative play and the mechanic of using light sources to defeat enemies."]}, {"page": "Sonic the Hedgehog", "response": ["*  Writing for Destructoid, Jim Sterling said: \"Hyperbole states that we haven't had a good Sonic game since Sonic Adventure, which really betrays how much we gamers ignore the handheld market... Sonic Advance and the Sonic Rush games have often ranged from decent to superb, which makes one wonder why Dimps is the 'B' team and the inferior Sonic Team is the 'A' team.\" In the wake of the 2006 Sonic the Hedgehog, Brett Elston of GamesRadar+ said that Sonic Rush Adventure \"managed to keep the [series'] spirit alive\". While Sonic Unleashed was criticized for its addition of beat 'em up gameplay, which IGN Hilary Goldstein bemoaned had \"nothing to do with Sonic whatsoever\", its speed-based platforming levels were widely praised; critics suggested that the game would have been better received if it had focused on them."]}, {"page": "Doomguy", "response": ["The Doom Marine's 2016 incarnation has received special acclaim for its characterization and how the game presents the player character as a representation of the player playing Doom: writing for GamesRadar, David Houghton called the presentation \"incidental, not explicit\", which allows the players to immerse completely in the character. Christian Donlan writing for Eurogamer theorised that \"the guy in Doom is playing Doom\", and explained that the main character's impatience with exposition is analogous to \"the temporary frustration of being inside Doom while not being able to play Doom\". In his column Extra Punctuation Ben Croshaw wrote that the game \"establishes the player character as someone who doesn't give a flake of dried Marmite for the larger context, and only cares about ridding the planet of demons. Which is hopefully representative of the player's motivation.\" Additional praise was given for the subtlety of Doomguy's expressions: Jim Sterling noted that both the \"glory kill\" moves and additional pieces of animation \"reinforce his consistent sense of irreverence\", Sterling, along with a number of other reviewers including Houghton, Conlan, and Croshaw from Zero Punctuation noted the initial moment of the game with Doomguy throwing away a communications monitor while a mission briefing plays as a minimalistic, but effective way to convey the entire character's motivations. Cody Gravelle of Screen Rant criticized Doomguy's winged unicorn skin alternate custome, noting that the skin was great, but somehow missed the crossover opportunity, such as adding Isabelle skin from Nintendo's Animal Crossing: New Horizons."]}, {"page": "The Bureau: XCOM Declassified", "response": ["The gameplay received a mixed response. The game's incompetent artificial intelligence (AI) was a common point of criticism because it needed player input to function properly and made squad management cumbersome. The permadeath feature was criticized by Matt Miller from Game Informer for being unengaging because players can always restart from checkpoint, and that agent deaths lacked impact and turned gameplay into a \"monotonous slog\" according to GameSpot's reviewer Kevin VanOrd. Ludwig Kietzmann from Joystiq noted that without these companions, combat could become very difficult but their loss was \"felt in utility more than emotion.\" VanOrd found the gunplay entertaining while Dan Stapleton from IGN found it serviceable. Stapleton also praised the variety of enemies which kept the combat from becoming stale after several hours. Jim Sterling from Destructoid was disappointed by the Battle Focus mode because it was inconvenient to use. Critics noted the game's challenging nature and believed that using tactics was largely the only way to succeed in the game. Whitehead enjoyed the combat perks and skills that helped open up new combat possibilities. Justin McElroy from Polygon also liked the skills since they could be chained seamlessly together. Hollander Cooper from GamesRadar also reacted positively to the combat skills, saying that unlocking these skills and utilizing them in combat was rewarding and engaging."]}, {"page": "Killzone 3", "response": ["IGN gave the game an 8.5, praising the atmosphere, graphics and multiplayer. Destructoid gave the game a perfect 10/10, with reviewer Jim Sterling stating: \"I don't think the PlayStation 3 has ever had quite such a rounded, satisfactory package as this, with this level of polish, refinement and pure, simple, unpretentious action\". PlayStation Lifestyle awarded it a 10/10 as well, calling the game \"the ultimate ending to a new form of sci-fi epic\"."]}, {"page": "Fallout 3", "response": ["Not all fans were happy with the direction the Fallout series was taken in after its acquisition by Bethesda Softworks. Notorious for their support of the series' first two games, Fallout and Fallout 2, members centered on one of the oldest Fallout fansites, No Mutants Allowed, have criticized departures from the original games' stories, gameplay mechanics and setting. Criticisms include the prevalence of unspoiled food after 200 years, the survival of wood-framed dwellings following a nuclear blast, and the ubiquity of Super Mutants at early levels in the game. Also criticized are the quality of the game's writing, its relative lack of verisimilitude, the switch to a first-person action game format, and the level of reactiveness of the surrounding game world to player actions. In response, Jim Sterling of Destructoid has called fan groups like No Mutants Allowed \"selfish\" and \"arrogant\", stating that a new audience deserves a chance to play a Fallout game; and that if the series had stayed the way it was back in 1997, new titles would never have been made and brought to market. Luke Winkie of Kotaku tempers these sentiments, saying that it is a matter of ownership; and that in the case of Fallout 3, hardcore fans of the original series witnessed their favorite games become transformed into something else."]}, {"page": "Ayane (Dead or Alive)", "response": ["Ayane's appearance of a \"sweet girl\" is misleading and hides her \"devious nature\".Hilary Goldstein, Girls of DOAU: Ayane , IGN, September 23, 2004. She wears a variety of mostly purple and black female ninja suits and other attires (including a schoolgirl uniformDead or Alive 2 Schoolgirl Outfits Revealed , IGN, March 8, 2000. and a Carnival of Venice-style costumeMike Fahey, Ninja Gaiden Sigma 2 Gets Fashionable DLC  , Kotaku, November 13, 2009.), often coming with a miniskirt or tunic and often featuring a butterfly motif (later even on her weaponsPete Haas, Ninja Gaiden 3: Razor's Edge Has Playable Ayane , Gaming Blend, 2012-09-12.). Among about 20 Ayane's outfits in the 2004 compilation game Dead or Alive Ultimate,DOA Ultimate Preview, 1UP.com, 07/23/2004. one was inspired by the character Millennia from Kagero: Deception 2. One of her alternative costumes in Ninja Gaiden Sigma 2 also pays homage to Sun Shangxiang (Lady Sun) from Koei's Dynasty Warriors series.Jim Sterling, Ninja Gaiden invades Dynasty Warriors , Destructoid, 09.23.2009. Her other wardrobe in Last Round includes outfits designed by Tamiki Wakaki, a destructible green dress in 2014 and a purple armor in 2016, as well as downloadable costumes based on the Clockwork Princess Millennia from Tecmo Koei's Deception IV: The Nightmare Princess, Fie Claussell from Nihon Falcom's The Legend of Heroes: Trails of Cold Steel II, Satoka Sumihara from Square Enix's School Girl Strikers, Cocona from Tatsunoko's Nurse Witch Komugi, Nene from Samurai Warriors, and Yukino Aguria from Fairy Tail, among others. Her default costume in Dead or Alive 6 is to feature an Assassin's Creed style hood, described as \"a cool new look but keeping things as punk and pink as ever.\"", "Licensed merchandise items featuring Ayane include a variety of statuettes and action figures for the Dead or Alive and Ninja Gaiden series, including the figures by Kotobukiya,Brain Ashcraft, No, Not A Kasumi Figure, An Ayane One , Kotaku, December 22, 2009.Michael McWhertor, Finally, Dead Or Alive Toys With Removable Clothing, Kotaku, July 20, 2007.Take Off Ayane's Top and Skirt, Kotaku, November 12, 2007.Jim Sterling, Strippable Dead or Alive figures for the dirty, shameful win , Destructoid, 07.21.2007. Multiverse Studio, Mr Big,This Bayonetta Figure Pistol Kicks Out A Whopping Price Tag , Kotaku, February 8, 2011. Sega,Jim Sterling, Crane claws + big titties = Happy pervoids indeed , Destructoid, 09.04.2008. Shunya Yamashita,Brain Ashcraft, Catch These Dead or Alive Figures! , Kotaku, September 4, 2008. and Volks.Brian Ashcraft, Ayane Is Not Cheap , Kotaku, January 26, 2010.Hamza CTZ Aziz, Volks, Ninja Gaiden 2 Sigma Ayane figure is looking good , Destructoid, 01.27.2010. A high-quality statuette of Ayane came with the limited edition Japanese release of Ninja Gaiden.", "Some criticised the visual allure of the character, up to allegations of sexual objectification.Amanda Greenslade, Fantasy Women: The Literary Roots of Phallocentrism in Modern Fantasy Computer Games, 2011. Mentioning \"the subject of unlockable gym slips for Ayane\" in 2002, Edge magazine stated that while it \"remains opposed to videogame censorship, the Dead or Alive franchise has certainly challenged the boundaries of taste in games.\"\"Inside...Tecmo\". Edge 113 page 59. In 2009, Joe Newman of GamesRadar ranked the series of Team Ninja's controversial Sigma 2 commercials, designed to draw attention to the fact that the \"notoriously big-breasted\" Ayane was a playable character (one of which was called by Destructoid \"the best and worst thing to have ever been created\"),Jim Sterling, Ninja Gaiden Sigma 2 'boob jiggle' commercial is amazing , Destructoid, 09.16.2009. as the fourth most blatantly sexist game advertisement ever, adding: \"God forbid a moment goes by where any part of her body might be covered up.\"Joe Newman, Top 7... Blatantly sexist game advertisements , GamesRadar, November 25, 2009. Team Ninja's post-Itagaki head Yosuke Hayashi dismissed the criticism, stating in 2012: \"With the representation of female characters in the Dead or Alive franchise, we've always wanted to make the girls look as attractive as possible, and that's something that's not going to change for us at all.\" Hayashi explained: \"We are a Japanese developer, and we're making the female characters with our common sense and our creative sense. When you take that to countries outside of Japan, it tends to be very misinterpreted in some cases, people considering it sexist or derogatory, etc.\"Jessica Conditt, DOA5 lead: Japanese view of women in games 'not going to change' , Joystiq, August 22, 2012. The issue was also dismissed in 2015 by Team Ninja creative director Tom Lee, who said they as well as most of their \"fans around the world don't share the same sentiments\" as their critics.", "As with Kasumi's, Ayane's age has not been listed in the Western versions of the games to avoid backlash regarding characters portrayed as underage; according to Itagaki, Ayane's age in Ninja Gaiden would \"cause problems with the ESRB.\" Nevertheless, some outlets raised this issue and questioned the extent of adolescent Ayane's sexualization in the games (in Ninja Gaiden Sigma 2 players were even given control over the movement of her breasts through use of the Sixaxis game controller).McKinley Noble, Motion-controlled breast jiggling in PS3 Ninja Gaiden 2, GamePro, September 11, 2009. Destructoids Jim Sterling has voiced concern about how a supposedly 14-year-old character (Ayane's Sigma 2 age) has such \"huge busters\", as well as joking they were \"worried that this now means I'm a pedophile.\"Jim Sterling, NG Sigma 2: 14-year-old has huge boobs, new face , Destructoid, 06.29.2009. In 2011, Nintendo of Europe decided to not distribute Dead or Alive: Dimensions in Sweden (this also meant the game would not be released in Norway and Denmark),Dead or Alive 3DS canceled in Sweden over...child porn laws? , MMGN, 25/05/2011. apparently because of a local child pornography law encompassing drawn and animated characters (and despite the age of consent in Sweden being only 15).Brian Ashcraft, Report: Dead or Alive: Dimensions Is Kiddy Porn in Sweden? , Kotaku, May 20, 2011. ABC News mistakenly used GamesRadar's joke image of Ayane \"with the newly attached pterodactyl head and wings of Metroid boss Ridley\" as an illustration for their article while reporting on this story.Justin Towell, ABC News uses our ridiculous big-boobed pterodactyl joke as serious DoA screenshot , GamesRadar, June 1, 2011. Reacting to the Nordic ban, Sterling (writing for GameFront) called her a \"big-eyed lump of grade-A jailbait\" and added: \"Would it murder the fantasy of the fanbase if the girl was canonically 21, despite still looking like an eleven-year-old hormone pill addict? Instead, 21-year-olds are designated as 'old' women in Japanese games, usually playing a villainous, antagonistic role compared to the sweet, innocent, sexually desirable teenager.\" He further wrote that his proposed practice of \"bumping up the age be part of the localization process,\" besides helping to avoid \"silly controversies like we've seen in Sweden,\" would have \"the added benefit of narratives that are far more sensible — having Ayane as an accomplished ninja at sixteen just doesn't make much sense.\"Jim Sterling, Japan and its Sexy, Sexy Children , GameFront, May 23, 2011. Ayane became canonically 18-year-old in Dead or Alive 5. Regarding the other changes in DOA5, according to Kotaku, director Yohei Shimbori received a lot of \"fan backlash from Ayane's breast reduction.\" Previously, one of her new costumes for Dimensions had upset some fans when the game was announced in 2010.Jim Sterling, Ayane & Kasumi's new costumes in Dead or Alive Dimensions , Destructoid, 09.27.2010."]}, {"page": "Yahtzee Croshaw", "response": ["In addition to Zero Punctuation, Croshaw has also starred in a series on The Escapist titled Jim & Yahtzee's Rhymedown Spectacular alongside former Escapist personality Jim Sterling. The weekly series consisted of an original piece of video game themed poetry each from Croshaw and Sterling. Unlike his other shows, Croshaw presented himself on camera the entire time. The series aired weekly from 17 April 2013, to 28 May 2014. "]}, {"page": "James Stanton", "response": ["*James Nicholas Stanton (born 1984), birth name of Jim Sterling, British/American video game critic "]}, {"page": "Dark Queen", "response": ["According to UGO, \"not only was the Dark Queen revolutionary, she was also dead sexy - possibly the hottest babe of the 8-bit era\". UGO editors commented that the Battletoads series is \"notorious for its insanely high difficulty, juvenile sense of humor and big-boobed antagonist\" and adding that \"the anger we felt at losing was only compounded by how hot and unattainable the Dark Queen was.\" Both Seanbaby and Geek World declared her the sexiest NES game character. GamesRadar's Jim Sterling featured her in a 2011 retrospective article featuring the sexy video game women of the sprite era. "]}, {"page": "Crash Bandicoot (video game)", "response": ["Reviewers widely considered the gameplay to be standard for its genre, though some nevertheless regarded it to be enjoyable and polished; E. Storm of GameFan, who gave both the game and its competitor Super Mario 64 perfect scores, determined that \"Mario 64 is a perfect action/adventure and that Crash is a perfect action/platform\". However, Zach Meston of GameSpot and a reviewer for Next Generation were less forgiving, with Meston deriding the gameplay as \"flat as roadkill on a four-lane highway\", and the Next Generation reviewer declaring the game to be \"the single most derivative game to ever hit a console\". While the linearity of the levels and lack of room for exploration was a source of disappointment, the shifting perspectives between levels was acknowledged as interesting, although the fixed camera caused reviewers to experience difficulty in judging jumps. The gameplay variety provided by these altered perspectives as well as the bonus rounds and gems was appreciated. The game's difficulty level was commended as challenging without becoming frustrating, though Glide and Dan Tsu of Electronic Gaming Monthly respectively felt that the bosses and enemies were easy to dispatch. While Radakovic applauded the game's controls, critics generally deemed them to be satisfactory if somewhat sluggish. A reviewer for Official UK PlayStation Magazine considered the save points to be \"a little misplaced\", pointing out a portion of the second island in which there is no save point for three levels. In 2009, Jim Sterling of Destructoid stated that the game has aged poorly since its initial release due to a lack of support for DualShock thumbsticks, a poor camera, and substandard jumping and spinning controls."]}, {"page": "Road Rules: Northern Trail", "response": ["Road Rules: Northern Trail is the subject of recurring jokes on various podcasts by Jim Sterling, owing to their co-host Jon Holmes having been a contestant in the series."]}, {"page": "Blaze Fielding", "response": ["She was also noted for her sex appeal, in particular for the upskirt animation frames, removal of which in America was one early instances of sexual content censored in video games. Famitsu described it as a Japanese fan \"dogma\" of \"Blaze=panties\" while discussing the Western censorship. Electronic Gaming Monthly named her as the \"Hottest Video Game Babe\" of 1993. Digital Press Karl Youngman featured Blaze in his article \"Classic Babes in Videogames\" as a representative of a 'biker chick' trope, opining she has best legs in video games and stating that after seeing her he \"didn't care if I ever saw another 'real' girl again,\" and a Famitsu reviewer admitted to \"worship\" Blaze for both her fighting technique and her sexiness. In 2011, GamesRadar's Jim Sterling recalled this \"16-bit stunner\" as \"one of the sexiest sprites ever.\""]}, {"page": "Alone in the Dark II (film)", "response": ["YouTube critic Jim Sterling reviewed the film along with Conrad Zimmerman on their podcast, remarking that the film was terrible enough that it was hard to believe there could be worse films."]}, {"page": "List of YouTubers", "response": ["| Jim Sterling"]}, {"page": "List of comedy films of the 1990s", "response": ["|Joe's Apartment||||Jerry O'Connell, Megan Ward, Jim Sterling||United States||"]}]}}