{"wiki_id": "http://www.wikidata.org/entity/Q1964578", "itemLabel": "Nanette Newman", "itemDescription": "British actress", "wikipedia_url": "https://en.wikipedia.org/wiki/Nanette_Newman", "wikipedia_page": {"main": "Nanette Newman (born 29 May 1934) is an English actress and author. She appeared in nine films directed by her husband Bryan Forbes, including Séance on a Wet Afternoon (1964), The Whisperers (1967), Deadfall (1968), The Stepford Wives (1975) and International Velvet (1978) for which she won the Evening Standard Film Award for Best Actress. She was also nominated for the BAFTA Award for Best Actress in a Leading Role for another Forbes directed film, The Raging Moon (1971).", "link_mentions": [{"page": "Terry Jones", "response": ["*Bedtime Stories (2002),  – with Nanette Newman"]}, {"page": "Sarah, Duchess of York", "response": ["In April 2020, Sarah launched a new series on her YouTube channel, called Storytime with Fergie and Friends, in which she and a number of authors, including Nanette Newman and Imogen Edwards-Jones, read stories to children from their homes during the lockdowns due to the COVID-19 pandemic. From March to July 2021, the same channel showed 10 short episodes of Little Red News featuring characters from Ferguson's book series, Little Red."]}, {"page": "1978 in film", "response": ["*International Velvet, starring Tatum O'Neal, Nanette Newman and Anthony Hopkins"]}, {"page": "1967 in film", "response": ["* The Whisperers, starring Edith Evans and Nanette Newman – (U.K.)"]}, {"page": "1966 in film", "response": ["* The Wrong Box, starring John Mills, Michael Caine, Peter Cook, Nanette Newman – (U.K.)"]}, {"page": "Oh! What a Lovely War", "response": ["Oh! What a Lovely War is a 1969 British comedy musical war film directed by Richard Attenborough (in his directorial debut), with an ensemble cast, including Maggie Smith, Dirk Bogarde, John Gielgud, John Mills, Kenneth More, Laurence Olivier, Jack Hawkins, Corin Redgrave, Michael Redgrave, Vanessa Redgrave, Ralph Richardson, Ian Holm, Paul Shelley, Malcolm McFee, Jean-Pierre Cassel, Nanette Newman, Edward Fox, Susannah York, John Clements, Phyllis Calvert and Maurice Roëves.", "*Nanette Newman as Nurse"]}, {"page": "The League of Gentlemen (film)", "response": ["* Nanette Newman as Elizabeth Rutland-Smith", "In 2006, a restored version of the film was released as a special edition DVD in the UK. The extras include a South Bank Show documentary on Attenborough and a PDF version of Forbes' original script. An audio commentary for the film was provided by Forbes and his wife Nanette Newman who features in the film as Major Rutland-Smith's wife."]}, {"page": "Séance on a Wet Afternoon", "response": ["Séance on a Wet Afternoon is a 1964 British thriller film directed by Bryan Forbes, and starring Kim Stanley, Richard Attenborough, Nanette Newman, Mark Eden and Patrick Magee. Based on the 1961 novel by Mark McShane, the film follows a mentally unstable medium who convinces her husband to kidnap a child so she can help the police solve the crime and achieve renown for her abilities. Kim Stanley was nominated for the Academy Award for Best Actress for her role in the film."]}, {"page": "The Whisperers", "response": ["* Nanette Newman – Girl Upstairs"]}, {"page": "Sunningdale", "response": ["*Nanette Newman"]}, {"page": "The Stepford Wives", "response": ["In 1975, the book was adapted into a science fiction thriller directed by Bryan Forbes with a screenplay by William Goldman and starring Katharine Ross, Paula Prentiss, Peter Masterson and Tina Louise. While the script emphasis is on gender conflict and the sterility of suburban living, and thus the science fiction elements are only lightly explored, the movie still makes it much clearer than the book that the women are being replaced by some form of robot. Goldman's treatment of the book differed from that of Forbes, with the robots closer to an idealized Playboy Bunny; it has been claimed that the look was scrapped when Forbes' actress wife Nanette Newman was cast as one of the town residents.by Goldman in Adventures in the Screen Trade"]}, {"page": "National Velvet", "response": ["A 1978 film sequel, International Velvet, was made starring Tatum O'Neal as Sarah Brown, a young orphaned American teenager living in England with her aunt Velvet Brown (Nanette Newman) after Sarah's parents die in a car accident. Sarah and Velvet purchase the descendant of The Pie after Sarah earns the money by working for Velvet's boyfriend John. They name him Arizona Pie after Sarah's home state. Working with Arizona Pie, Sarah is selected to represent Britain in the equine three-day Olympic event. While working with the horse with trainer Captain Johnson (Anthony Hopkins), she falls for an American competitor, Scott Saunders (Jeffrey Byron). Though distracted by him, she wins the event. Later, after getting engaged to Scott, Sarah returns to England and presents the medal to her aunt Velvet as a keepsake and introduces her and John to Scott."]}, {"page": "Newman", "response": ["*Nanette Newman (born 1934), English actress and author"]}, {"page": "Jesse Birdsall", "response": ["As a child, Birdsall attended the Anna Scher children's theatre school in Islington, and in his teens appeared in Nanette Newman's children's cooking programme Fun Food Factory and in several television plays and series, usually with his trademark rockabilly look. He had one line as an extra (\"Watch it mate!\") in an episode of Minder from 1980 entitled \"Don't Tell Them Willie Boy was Here\". In 1982 he starred alongside singer Hazel O'Connor in the TV drama series set in a nightclub called Jangles. He first came to wider public attention in the serial Annika in 1984, his first notable television role. He then subsequently appeared in the films Wish You Were Here (1987), directed by David Leland and co-starring Emily Lloyd, Getting It Right (1989), and Beyond Bedlam (1994). He appeared in the 1988 music video of Kim Wilde's single Hey Mister Heartache. "]}, {"page": "Juke Box Jury", "response": ["* 22 January 1966 - Peter Cook, Bryan Forbes, Dudley Moore, Nanette Newman"]}, {"page": "The Rebel (1961 film)", "response": ["* Nanette Newman...Josey"]}, {"page": "Bryan Forbes", "response": ["Coinciding with his time at EMI Films, he resumed directorial work with The Raging Moon (1971), starring his wife, Nanette Newman, and Malcolm McDowell.", "In 1951 he married Irish actress Constance Smith, and the couple travelled to Hollywood in the early 1950s.Bryan Forbes. The Telegraph. 9 May 2013. Retrieved 9 May 2013 Forbes soon returned to the UK; he and Smith divorced in 1955. Forbes went on to marry actress Nanette Newman the same year. It was popularly believed that Roger Moore was their best man, but Newman denied this on the Alan Titchmarsh Show in 2011. The couple had two daughters: journalist Sarah Standing,Sarah Standing \"Bryan Forbes was a giant of a husband and father\", 10 May 2013, The Daily Telegraph. who is married to actor John Standing, and television presenter Emma Forbes."]}, {"page": "Can't Let Go (Mariah Carey song)", "response": ["AllMusic editor Ashley S. Battel wrote that \"yearning cries for a lost love in \"Can't Let Go\" serves to send the listener on a musical journey through time filled with varying emotions. Larry Flick from Billboard described it as a \"rhythmic R&B/pop ballad\", adding, \"Her now-trademark vocal acrobatics are showcased amid gospel-spiced harmonizing and dramatically executed instrumentation.\" Randy Clark and Bryan DeVaney from Cashbox commented, \"This time Carey is slowing down the pace from the first single \"Emotions\". In our opinion, this should have been the first single taken off the album. Her voice still has that crystal-clear sound that has hypnotized listeners of all sorts.\" Los Angeles Times editor Dennis Hunt said that in this song Mariah is playing a wounded lover. Rob Tannenbaum of Rolling Stone wrote that \"moody grandeur\" of this song will sound great on radio. On the song, Sian Pattenden from Smash Hits described Carey as \"the Nanette Newman of pop\"."]}, {"page": "Fairy (brand)", "response": ["In February 2010, Fairy brought back the original washing-up-liquid bottle (which was used until 2000) to celebrate 50 years of the brand. Nanette Newman, who appeared in the 1980s TV advertisements, returned for a new campaign to promote the launch."]}, {"page": "The Wrong Box", "response": ["The cast includes a number of Britain's leading actors and comic actors of the time, including John Mills, Ralph Richardson, Michael Caine, Peter Cook, Dudley Moore, Peter Sellers, Irene Handl, Nanette Newman, Wilfrid Lawson, and Tony Hancock. Included in the cast are other actors who later became more well-known, including John Le Mesurier, John Junkin, Leonard Rossiter, Nicholas Parsons, Jeremy Lloyd, Graham Stark, Thorley Walters, Norman Rossington, David Lodge, Juliet Mills, and Norman Bird. Cicely Courtneidge also appears, as Salvation Army Major Martha and The Temperance Seven also appear (as themselves).", "* Nanette Newman as Julia Finsbury"]}, {"page": "P. P. Arnold", "response": ["*Footprint (1971) - Gary Wright - with George Harrison, Klaus Voormann, Mick Jones, Alan White, Doris Troy, Nanette Newman, etc."]}, {"page": "Emma Forbes", "response": ["Forbes's parents are Nanette Newman and Bryan Forbes (né John Theobald Clarke). She attended the Hurst Lodge School."]}, {"page": "The Wrong Arm of the Law", "response": ["In London, a gang of criminals from Australia led by Jack Coombes (Bill Kerr) impersonate policemen to carry out robberies. Local gang leader \"Pearly\" Gates (Sellers), who operates from the cover of a French couturier, finds his takings cut severely, and blames rival crook \"Nervous\" O'Toole (Bernard Cribbins). When it emerges that they are both being scammed by the same gang, they join forces, along with Lionel Jeffries' Police Inspector \"Nosey\" Parker, to bring the so-called \"I.P.O. mob\" (I.P.O. - Impersonating a Police Officer) to justice. Nanette Newman provides the love interest, John Le Mesurier plays a senior policeman, and a young Michael Caine has a small and uncredited role as a young PC. Other uncredited roles include John Junkin (Maurice), Dennis Price (Educated Ernest), Cardew Robinson (Postman), Dick Emery (Man in Flat 307), Mario Fabrizi (Van Driver), John Harvey (Police Station Sergeant), Harold Siddons (PC in Basement Garage), Jack Silk (Police Station PC), Derek Guyler (non-speaking PC at Scotland Yard), Gerald Sim (Airfield Official) and Marianne Stone (“The bird in the front row” at Gangsters' Meeting).", "* Nanette Newman as Valerie"]}, {"page": "Johnny Briggs (actor)", "response": ["Briggs was born in Battersea, south-west London, on 5 September 1935. His father was a master carpenter.  He was evacuated from London during the Blitz campaign of World War II.  He was awarded a scholarship to train at the Italia Conti Academy stage school when he was 12 years old.  There, he learned alongside Millicent Martin, Nanette Newman and Anthony Newley."]}, {"page": "List of female movie actors by name: N–O", "response": ["*Nanette Newman (born 1932)"]}, {"page": "Beryl Cook", "response": ["Cook was enjoying growing popularity and her paintings soon were in great demand. Her first book of collected works was published by John Murray in 1978, and in 1979, a film was made for LWT's The South Bank Show, where she discussed her work with Melvyn Bragg. Cook then collaborated with such authors as Edward Lucie-Smith and Nanette Newman by providing illustrations for their books. She continued to regularly publish books of her own artworks up into the early 2000s, including Beryl Cook's New York (1985), inspired by her visit to New York City.", "* My Granny Was a Frightful Bore (with Nanette Newman) (Collins, 1983)"]}, {"page": "The Stepford Wives (1975 film)", "response": ["Joanna Eberhart (Katharine Ross) is a young wife who moves with her husband Walter (Peter Masterson) and their two daughters from Manhattan to the idyllic Fairfield County, Connecticut suburb of Stepford. Loneliness quickly sets in as Joanna, a mildly rebellious aspiring photographer, finds that the women in town all look flawless and are obsessed with housework, but have few intellectual interests. The men all belong to the exclusionary Men's Association, which Walter joins to Joanna's dismay. Neighbor Carol Van Sant's (Nanette Newman) sexual submissiveness to her husband Ted (Josef Sommer), and her odd, repetitive behavior after a car accident also strike Joanna as strange.", "Tension developed between Forbes and screenwriter Goldman over the casting of Nanette Newman (Forbes' wife) as one of the wives. Goldman had wanted the wives to be depicted as model-like women who dressed provocatively. But after casting Newman this was not to be, as Goldman stated he felt that Newman's physical appearance did not match the type of woman he imagined, and as a result this caused a change in appearance of costuming for all of the other wives. Goldman has said that he found Newman to be a perfectly good actress; however, Goldman was also unhappy with some rewrites that Forbes contributed. In particular, Forbes toned down Goldman's \"horrific\" ending. Actor Peter Masterson, who was friends with Goldman, secretly called Goldman for his input on scenes, creating additional stresses.The Stepford Wives: Behind the Scenes documentary", "Nanette Newman stated that the ending was deliberately filmed by the director \"in an unreal way, so they were almost like a ballet moving in and out, up and down the aisle.\""]}, {"page": "Honky Tonk Women", "response": ["\"Country Honk\" was recorded at Olympic Studios. Byron Berline played the fiddle on the track, and has said that Gram Parsons was responsible for him being chosen for the job (Berline had previously recorded with Parsons' band the Flying Burrito Brothers). Producer Glyn Johns suggested that Berline should record his part on the pavement outside the studio to add ambiance to the number. Sam Cutler, the Rolling Stones' tour manager, performed the car horn at the beginning of the track.Cutler, Sam. You Can't Always Get What You Want - My Life with the Rolling Stones, the Grateful Dead and Other Wonderful Reprobates  Nanette Workman performs backing vocals on this version (although the album sleeve credits actress Nanette Newman). Berline's fiddle and all vocals were recorded at Elektra. There is a bootleg recording in existence that contains neither the fiddle nor Mick Taylor's slide guitar. "]}, {"page": "You Bet!", "response": ["|bgcolor=\"ffdddd\"| Nanette Newman"]}, {"page": "So Graham Norton", "response": ["| Linford Christie and Nanette Newman"]}, {"page": "Evening Standard British Film Awards", "response": ["*Best Actress : Nanette Newman – International Velvet"]}, {"page": "BAFTA Award for Best Actress in a Leading Role", "response": ["| Nanette Newman"]}, {"page": "Interpol Calling", "response": ["*Guest stars included Mai Zetterling, Patrick Troughton, David Kossoff, Warren Mitchell, Nanette Newman, and Donald Pleasence."]}, {"page": "Sir Francis Drake (TV series)", "response": ["*Nanette Newman as Yana"]}, {"page": "John Standing", "response": ["In 1984, he married Sarah Kate Forbes, the daughter of film director Bryan Forbes and actress Nanette Newman, and the sister of television presenter Emma Forbes. They have three children: India (b. 1985), Archie (b. 1986), and Octavia (b.1989)."]}, {"page": "National Velvet (film)", "response": ["In 1978, the sequel International Velvet, was released. The film stars Tatum O'Neal, Christopher Plummer, Anthony Hopkins, and Nanette Newman, who plays Velvet Brown as an adult. After the events of National Velvet, Donald got married, had a daughter named Sarah Velvet Brown, and moved from England to Cave Creek, Arizona. Sarah comes to live with Velvet and her boyfriend John after Donald and his wife die from their injuries in a car accident. Elizabeth Taylor did not reprise her role as Velvet in the sequel."]}, {"page": "List of alumni of the Royal Academy of Dramatic Art", "response": ["*Nanette Newman (Acting Diploma 1952)"]}, {"page": "Captain Nemo and the Underwater City", "response": ["Captain Nemo and the Underwater City is a 1969 British film starring Robert Ryan, Chuck Connors and Nanette Newman. It features the character Captain Nemo and is inspired by Jules Verne's 1870 novel Twenty Thousand Leagues Under the Sea. It was written by Pip and Jane Baker.Variety film review; 17 December 1969, page 24.", "Captain Nemo's submarine Nautilus rescues drowning passengers and takes them to an underwater city, Templemer (pronounced Temple-Meer) where they are told they will remain forever. The survivors include brothers Barnaby (Bill Fraser) and Swallow Bath (Kenneth Connor), Lomax (Allan Cuthbertson), Helena Beckett (Nanette Newman) and her son, and Senator Robert Fraser (Chuck Connors)."]}, {"page": "International Velvet (film)", "response": ["International Velvet is a 1978 American film and a sequel to the 1944 picture National Velvet starring Tatum O'Neal, Christopher Plummer, Anthony Hopkins and Nanette Newman, and directed by Bryan Forbes. The film received mixed reviews. International Velvet was partly filmed at Birmingham University, England.", "* Nanette Newman as Velvet Brown "]}, {"page": "The Madwoman of Chaillot (film)", "response": ["* Nanette Newman  – Irma"]}, {"page": "The Raging Moon", "response": ["The Raging Moon (released in the US as Long Ago, Tomorrow) is a 1971 British romantic drama film starring Malcolm McDowell and Nanette Newman and based on the book by British novelist Peter Marshall. Adapted and directed by Bryan Forbes (Newman's husband), this \"romance in wheelchairs\" was considered unusual in its time owing in part to the sexual nature of the relationship between McDowell and Newman, who play disabled people. The film received two Golden Globe nominations, for Best Foreign Film (English Language), and Best Song for \"Long Ago Tomorrow\".", "Pritchard gets to know a fellow patient, Jill Matthews (Nanette Newman), a 31-year-old woman from a wealthy family, who is also a wheelchair user, due to polio. Bruce begins to harbour romantic feelings for Matthews but, before he can make his feelings known, she leaves the institution to return home and marry longstanding fiancé, Geoffrey. However, Jill soon realises that Geoffrey is half-hearted about marrying her and so breaks off the engagement and returns to the institution.", "Eventually Curtis took the project to Bryan Forbes who came on board as writer and director. Forbes decided to increase the age of the characters and write the lead role for his wife, Nanette Newman. Forbes was in the unusual position of being able to green-light his own film as he was head of production for EMI Films at the time.\"He Says, 'Yes, Yes, Nanette' \" by John Gruen, The New York Times, 24 October 1971: D11. Forbes commented that he was highly criticized in some quarters for directing a film while running the studio, even though he did not take any extra salary as the director. Once the film was made some executives at EMI did not want it released but Forbes held a successful test screening which secured company support."]}, {"page": "Journey to the Unknown", "response": ["The series has a fantasy, science fiction, supernatural and horror theme, very similar to the American television series The Twilight Zone, and deals with normal people whose everyday situations somehow become extraordinary. It featured both British and American actors: American actors included George Maharis, Vera Miles, Barbara Bel Geddes, Patty Duke, Carol Lynley, Joseph Cotten, Stefanie Powers and Brandon deWilde, along with familiar British actors such as Dennis Waterman, Jane Asher, Kay Walsh, Roddy McDowall, Nanette Newman, Ann Bell and Tom Adams. Seventeen episodes were produced.Journey to the Unknown episode guide. Directors of the episodes included Roy Ward Baker, Alan Gibson, Robert Stevens, Don Chaffey and Michael Lindsay-Hogg. Each episode was executive-produced either by Joan Harrison or Norman Lloyd, both of whom had co-produced Alfred Hitchcock Presents and The Alfred Hitchcock Hour from 1955 to 1965."]}, {"page": "1934 in the United Kingdom", "response": ["* 29 May – Nanette Newman, actress"]}]}}