{"wiki_id": "http://www.wikidata.org/entity/Q19663004", "itemLabel": "Neil Shand", "itemDescription": "British television comedy writer", "wikipedia_url": "https://en.wikipedia.org/wiki/Neil_Shand", "wikipedia_page": {"main": "Neil Hodgson Shand (3 March 1934 – 14 April 2018) was a British television comedy writer.He was born in Luton to parents from Glasgow, the son of a Vauxhall employee and a dressmaker.Raised in a \"two up two down\" house, he passed the 11-plus, and had a positive experience of attending a grammar school. Virtually blind in one eye, an operation at 14 on the day the National Health Service NHS was founded (5 July 1948) saved his eyesight. He began to work for a local paper, the Luton Gazette, after leaving school. Briefly working for the nationals while still having the day job in Luton, he managed to gain a regular job at the Daily Sketch after finding details of the 21st birthday party of a son of the Aga Khan at the Savoy Hotel.Shand was later a journalist for the Daily Mail and Daily Express, before moving into comedy writing in the 1960s. Shortly after being sacked from the Mail for being drunk once too often, he ran into the documentary maker Michael Ingrams, who eventually introduced him to Bernard Braden, for whom Shand first began to write humorous material.Shand worked extensively with David Frost, beginning with The Frost Programme in 1967. Subsequent work with Frost included ITV's coverage of Apollo 11 landing on the Moon in 1969, and spells in New York working on Frost's American talk show as a \"creative consultant\".His work with impressionist Mike Yarwood began around the same time with the sketch show Three of a Kind (1967). Shand also wrote for such acts as Spike Milligan, Kenny Everett, Bob Monkhouse, The Two Ronnies and Jasper Carrott (on Carrott Confidential). He was a member of BBC staff for many years.Shand married Judith Keppel in 1985; the marriage ended in 1987. He died on 14 April 2018, aged 84 in Whitton, North Lincolnshire, where he had lived since 2003.", "link_mentions": [{"page": "Spike Milligan", "response": ["* In 1975 Milligan co-wrote (with Neil Shand) and co-starred in a BBC TV sitcom called The Melting Pot. Its cast of characters included two illegal immigrants, an Irish landlord, a Chinese Cockney, a Scottish Arab and numerous other racial stereotypes; Milligan himself took the part of Mr Van Gogh, described as \"an illegal Pakistani immigrant\". After screening the pilot, the series was deemed to be too offensive for transmission. Five episodes remain unseen. Some of the characters and situations were reused in Milligan's novel The Looney."]}, {"page": "John Bird (actor)", "response": ["In 1975, Bird took the part of Mr Rembrandt, described as \"Van Gogh's son, also an illegal [Pakistani] immigrant\", in The Melting Pot. This was a sitcom written by Spike Milligan and Neil Shand, which was cancelled by the BBC after just one episode had been broadcast. Bird, in blackface, played an African Chief in  a commercial for Benson & Hedges cigarettes."]}, {"page": "Bill Kerr", "response": ["In 1972 he co-starred with Anthony Newley in the Newley/Bricusse musical, The Good Old Bad Old Days,John Fleming \"The Very Highly Talented and now Slightly Forgotten Anthony Newley\", The Huffington Post, 8 September 2011 which enjoyed a run lasting 309 performances.Adrian Wright A Tanner's Worth of Tune: Rediscovering the Post-war British Musical, Woodbridge: The Boydell Press, 2010, p.259 Later he had a role (with Julia McKenzie and Una Stubbs) in the musical play Cole, dedicated to the work of Cole Porter and first staged at the Mermaid Theatre, London in July 1974.Alun Morgan Obituary: Benny Green, The Independent, 24 June 1998 Kerr took the part of Bluey Notts, described as \"an Australian bookie's clerk, a crude racialist\", in The Melting Pot (1975). This was a sitcom written by Spike Milligan and Neil Shand, which was cancelled by the BBC after just one episode had been broadcast. He also appeared in several British films, such as The Dam Busters (1955) and The Wrong Arm of the Law (1963).Nicky Harley \"Actor Bill Kerr dies age 92\", Daily Telegraph, 29 August 2014"]}, {"page": "Frank Carson", "response": ["In 1975, Carson took the part of Paddy O'Brien, described as \"an Irish Republican landlord and coalman\", in The Melting Pot, a sitcom written by Spike Milligan and Neil Shand, which was cancelled by the BBC after just one episode had been broadcast."]}, {"page": "Q... (TV series)", "response": ["Q... is a surreal television comedy sketch show written by Spike Milligan and Neil Shand, and starring Spike Milligan with a number of supporting players, usually including Julia Breck, John Bluthal, Bob Todd, and John Wells.  The show ran from 1969 to 1982 on BBC2. There were six series in all, the first five numbered from Q5 to Q9, and a final series titled There's a Lot of It About. The first and third series ran for seven episodes, and the others for six episodes, each of which was 30 minutes long.", "While Flying Circus had four series between 1969 and 1974, because of Milligan's tempestuous relationship with the BBC, he had to wait until 1975 for his second series, Q6, to be commissioned. The series continued sporadically after this. Q7 appeared in 1978, Q8 shortly after in 1979 (two years before the Kuwait Petroleum Corporation registered the trademark; the TV series' opening credits showed the characters 'Q8' being formed from the word 'Kuwait'), Q9 in 1980 and There's a Lot of It About in 1982. Milligan resented the BBC for the cold attitude they took towards the series in comparison with series like Flying Circus, and always maintained that, given the opportunity, he would have produced more.  The shows were written by Milligan and his writing collaborator Neil Shand, with occasional episodes (especially in later years) giving \"additional contribution\" credit to any or all of David Renwick, Andrew Marshall, and John Antrobus."]}, {"page": "Judith Keppel", "response": ["In 1964, at Chelsea, London, Keppel married her first husband, Desmond Corcoran,Marriages, June 1964: “Corcoran, Desmond L and Keppel, Judith C A” in Register of Marriages for Chelsea Registration District, vol. 5C, p. 429 an art dealer with whom she had three children, Sibylla, Alexander, and Rosie, but they divorced in 1980. In 1985, she married comedy scriptwriter Neil Shand. They were separated in 1987."]}, {"page": "1976 in British television", "response": ["*A series of situation comedy The Melting Pot, written by (and starring, in brownface) Spike Milligan (with Neil Shand), is recorded for BBC2 but never broadcast."]}, {"page": "Luton Sixth Form College", "response": ["* Neil Shand, TV comedy writer"]}, {"page": "Shand", "response": ["* Neil Shand (1934–2018), British television comedy writer"]}, {"page": "The World of Beachcomber", "response": ["The show, like the column, consisted of a series of unrelated pieces of humour. Links between the items were provided by Spike Milligan, dressed in a smoking jacket and cap, as in the cartoon logo above the newspaper column. The other actors were a Who's Who of British comedy of the time, encompassing almost every supporting player seen or heard in comedy.  Likewise the writing staff included Milligan, Barry Took, John Junkin, Neil Shand and others. The producers were John Howard Davies and Duncan Wood."]}, {"page": "Colin Crompton", "response": ["From 1974 to 1977 he was also the \"club chairman\" in another Granada programme, The Wheeltappers and Shunters Social Club. An attempt by producer Johnnie Hamp to reproduce the atmosphere of the working men's clubs in a television studio, Crompton was famous for ringing a hand-operated fire alarm bell and telling the audience to \"give order\" when making announcements from \"the committee\" in between acts. He wrote his own scripts, with occasional additions by Neil Shand. The MC for the show, Bernard Manning, claimed he was cast in the role because he \"had been on The Comedians and he had that gormless look about him so he was ideal\"."]}, {"page": "Robert Dorning", "response": ["In 1975, Dorning took the part of Colonel Grope, described as \"an ex-Indian army, alcoholic racialist\", in The Melting Pot. This was a sitcom written by Spike Milligan and Neil Shand, which was cancelled by the BBC after just one episode."]}, {"page": "John Antrobus", "response": ["*\"Episode #1.4\" (co-written with Neil Shand and Spike Milligan, 1969)"]}, {"page": "Harry Fowler", "response": ["In 1975, Fowler took the part of Eric Lee Fung, described as \"a Chinese cockney spiv\", in The Melting Pot, a sitcom written by Spike Milligan and Neil Shand. The series was cancelled by the BBC after the first episode had been broadcast."]}, {"page": "Alexandra Dane", "response": ["Her many television appearances include Not On Your Nellie, Alas Smith and Jones and Pulaski. In 1975, Dane took the part of Nefertiti Skupinski, described as \"O'Brien's voluptuous, South African-bred daughter\", in The Melting Pot. This was a sitcom written by Spike Milligan and Neil Shand, which was cancelled by the BBC after just one episode had been broadcast."]}, {"page": "1975 in British television", "response": ["*11 June – A pilot of sitcom The Melting Pot, written by (and starring) Spike Milligan (with Neil Shand), is broadcast on BBC2. The following year, a full series of six episodes is recorded, but never broadcast."]}, {"page": "The Melting Pot (TV series)", "response": ["The Melting Pot is British television situation comedy starring Spike Milligan. It was written by Milligan and his regular collaborator Neil Shand. The pilot episode was broadcast only once on BBC1 in June 1976, with a full series recorded the following August but never broadcast."]}, {"page": "2018 in British television", "response": ["|Neil Shand"]}, {"page": "2018 in the United Kingdom", "response": ["**Neil Shand, 84, British comedy writer (Q..., The Russ Abbot Show) and journalist (Daily Mail).Culture stars who died in 2018: from Neil Shand to Harry Anderson "]}, {"page": "2018 in England", "response": ["**Neil Shand, 84, British comedy writer (Q..., The Russ Abbot Show) and journalist (Daily Mail).Culture stars who died in 2018: from Neil Shand to Harry Anderson "]}, {"page": "Deaths in April 2018", "response": ["*Neil Shand, 84, British comedy writer (Q..., The Russ Abbot Show) and journalist (Daily Mail).Culture stars who died in 2018: from Choi Eun-hee to Dale Winton "]}, {"page": "Timeline of BBC Two", "response": ["*24 March – Debut of the surreal comedy sketch show Q, written by Spike Milligan and Neil Shand, and starring Milligan."]}, {"page": "The Kenny Everett Television Show", "response": ["Everett was aided by an extensive supporting cast who included Cleo Rocos, Sheila Steafal, Lou Hirsch, Billy Connolly, John Arnatt and Willie Rushton, along with a long list of  celebrity guest stars who continuously sent themselves up, the likes of Frank Thornton, Brian Blessed, Lionel Blair, Burt Kwouk, Lulu, Tim Brooke-Taylor, Joanna Lumley, Lennie Bennett, Terry Wogan, Mel Smith and Vikki Michelle, whom made frequent number of appearances on the show. In addition to the main pool of writers involved in the show, a number of other writers also submitted various sketches to the show, including Paul Alexander, Simon Booker, Neil Shand, Paul Minett and Dick Vosburgh, the latter whom had previously worked with Everett on his show at Thames. The show was a ratings success for the BBC, repeatedly drawing audiences of around 12-13 million viewers per episode. When the show hit the screens in early 1982, it was lauded by critics; Hilary Kingsley from the Daily Mirror commented \"the first Kenny Everett show was tatty, tasteless and trivial. I loved it!.\" Everett was praised for his inventive comedy style that went against the norm for sketch shows; it was seen as zany, daring and unique, although at times the humour bordered on the grisly and squirm inducing. Towards the end of the show's run in 1987 the reception had changed, it was beginning to look tired and old fashioned as James Green commented in a review for The Stage in December 1987, with its formula of bawdy and surreal humour barely changing over the years. After Series 5 had ended in January 1988, Everett decided not to renew his contract with the BBC due to his growing disillusion with the filming of the show and faltering professional relations with his co-writers. Despite the BBC's intentions for the show to continue, it came to an abrupt end when Everett opted out from doing more shows."]}]}}