{"wiki_id": "http://www.wikidata.org/entity/Q19628823", "itemLabel": "Harold Entwistle", "itemDescription": "British actor (1865-1944)", "wikipedia_url": "https://en.wikipedia.org/wiki/Harold_Entwistle", "wikipedia_page": {"main": "Charles Harold Entwistle was an actor on stage and in films, a manager of theaters and touring theater companies, and director from England who migrated to the United States and worked in Hollywood during and after the silent film era. In England he performed for the king and queen.He married actress Bertha Jane Ross. He was known as a character actor.He was the uncle of Peg Entwistle who died after jumping off the H in the Hollywood Sign.", "link_mentions": [{"page": "List of American films of 1918", "response": ["| Too Fat to Fight || Hobart Henley || Frank McIntyre, Harold Entwistle || Comedy || Goldwyn"]}, {"page": "List of American films of 1917", "response": ["| Miss Robinson Crusoe || Christy Cabanne || Emmy Wehlen, Harold Entwistle || Comedy || Metro"]}, {"page": "List of American films of 1914", "response": ["| Mrs. Wiggs of the Cabbage Patch || Harold Entwistle || Beatriz Michelena, House Peters || Comedy drama || World Film"]}, {"page": "Salomy Jane (1914 film)", "response": ["* Harold Entwistle – Larabee"]}, {"page": "The Moonstone (1934 film)", "response": ["*Harold Entwistle as Sutter"]}, {"page": "Paris in Spring", "response": ["* Harold Entwistle as Charles The Butler"]}, {"page": "Entwistle (surname)", "response": ["* Harold Entwistle, English-born American actor and theatre director"]}, {"page": "The Beggar of Cawnpore", "response": ["* Harold Entwistle as Col. Archer  "]}, {"page": "One of Many (film)", "response": ["One of Many is a 1917 American film written and directed by Christy Cabanne, starring Frances Nelson with Niles Welch, Mary Mersch, Caroline Harris and Harold Entwistle.Motography Volume 16, Issues 15-26 - Page 1443  1916  Frances Nelson in “One of Many,” an offering that carries a profound moralPhotoplay The Aristocrat of Motion Picture Magazines  1917 SHE LIKES BASEBALL AND CAN \"CALL\" AN \"UMP\" — HARD, TOO. THIS is Frances Nelson, who, my dears, is as talented as she is shapely, which is merely another way of ... Now she is with Metro, which is starring her in \"One of Many\"\".Robert B. Connelly The Silents: Silent Feature Films, 1910-36   1998 \"ONE OF MANY (1917) 5 reels COU Metro bw Frances Nelson (Shirley Bryson). Niles Welch (Harold Templeton). Mary Mersch (Emma Bryson), Caroline Harris (Mrs. Bryson). Harold Entwistle (Wilfred Templeton)"]}, {"page": "In the Hollow of Her Hand", "response": ["*Harold Entwistle as Mr. Wrandell Sr."]}, {"page": "Miss Robinson Crusoe", "response": ["Miss Robinson Crusoe is a 1917 silent American comedy-drama film, directed by Christy Cabanne. It stars Emmy Wehlen, Walter C. Miller, and Harold Entwistle, and was released on July 30, 1917.", "* Harold Entwistle as Charles Van Gordon"]}, {"page": "Mrs. Wiggs of the Cabbage Patch (1914 film)", "response": ["Mrs. Wiggs of the Cabbage Patch is a 1914 American silent comedy drama film directed by Harold Entwistle and starring Beatriz Michelena, Blanche Chapman and House Peters. It is based on the 1904 Broadway play by Anne Crawford Flexner,https://www.ibdb.com/broadway-production/mrs-wiggs-of-the-cabbage-patch-5904 which itself is taken from the 1901 novel of the same name by Alice Hegan Rice.Goble p.877", "Category:Films directed by Harold Entwistle"]}, {"page": "California Motion Picture Corporation", "response": ["The Marin Library has a digital collection related to the studio. Their productions included Salomy Jane (1914), Mrs. Wiggs of the Cabbage Patch (1914), Mignon (1915), and Who's Your Servant? (1920). Frank Erlanger was one of the actors who worked for the studio. Salomy Jane survives in its entirety. George E. Middleton was a director with the studio and Beatriz Michelena a leading actress. Harold Entwistle and William Nigh also directed films for the company."]}, {"page": "The Summer Girl", "response": ["*Harold Entwistle - Mr. Anderson"]}]}}