{"wiki_id": "http://www.wikidata.org/entity/Q19653699", "itemLabel": "Michael Marsham, 7th Earl of Romney", "itemDescription": "British hereditary peer (1910-2004)", "wikipedia_url": "https://en.wikipedia.org/wiki/Michael_Marsham,_7th_Earl_of_Romney", "wikipedia_page": {"main": "Michael Henry Marsham, 7th Earl of Romney (22 November 1910 – 5 June 2004) was a British Hereditary peer who served in the House of Lords.", "link_mentions": [{"page": "Countryside Alliance", "response": ["In September 2002, the Countryside Alliance organised a march in central London to promote the interests of rural Britain. It was dubbed one of the largest marches of its type in history, with the BBC reporting around 400,000 in attendance. The Countryside Alliance hailed the march as a huge success and it called on the government to make a \"considered response\". While a central focus of the march was to show opposition to a ban on hunting with hounds in England and Wales, a wide range of other grievances from rural communities were also being linked with the demonstration around farming. Over 300,000 people were in attendance, including Iain Duncan Smith, Vinnie Jones, Edward Fox, Clarissa Dickson-Wright, Earl Spencer, and Michael Marsham, 7th Earl of Romney. Richard Burge, the then Chief Executive of the Countryside Alliance, said of the march \"This is a march for the people and by the people and not simply rural people.The strength of support, not just from the countryside, but from towns and cities across the UK makes us feel both humble and proud.\" The British National Party had called for its members to join the march and support the countryside; however, the Countryside Alliance issued the following statement: \"Everything we stand for is the opposite of what they believe in.\""]}, {"page": "Sherborne School", "response": ["Notable Old Shirburnians in politics include Alan Lennox-Boyd, 1st Viscount Boyd of Merton, Charles Beauclerk, Earl of Burford, Education Minister Sir Christopher Chataway, Michael Marsham, 7th Earl of Romney, William Cecil, 2nd Earl of Salisbury, The Right Honourable The Lord Thomas of Swynnerton, Thomas Buchanan, Robert Key, Paul Tyler, Liberal Party politician John Pardoe, Conservative Party politician Denzil Kingston Freeth, Liberal Party politician Sir Cecil Algernon Cochrane, writer, farmer and father of Boris Johnson Stanley Johnson, Liberal Democrat politician Andrew Duff, and journalist, author and political commentator Peter Oborne."]}, {"page": "Charles Marsham, 4th Earl of Romney", "response": ["* Lt Col the Hon Reginald Hastings Marsham, OBE (born 19 December 1865, died 8 November 1922), father of Michael Marsham, 7th Earl of RomneyThe Peerage.com, entry for Reginald Marsham"]}, {"page": "List of Old Shirburnians", "response": ["*Michael Marsham, 7th Earl of Romney (1910-2004), hereditary peer who served in the House of Lords.The Earl of Romney, The Daily Telegraph, June 10, 2004"]}, {"page": "Marsham (surname)", "response": [":* Michael Marsham, 7th Earl of Romney (1910–2004)"]}, {"page": "Julian Marsham, 8th Earl of Romney", "response": ["He succeeded his first cousin once removed Michael Marsham, 7th Earl of Romney, in the earldom and the titles Baron Romney and Viscount Marsham in 2004."]}]}}